{
  "id": "18813",
  "name": "'Amr bin Wahb al-Thqfy عمرو بن وهب الثقفي",
  "full_name": "'Amr bin Wahb al-Thqfy عمرو بن وهب الثقفي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ س  -  ثقة ]"
    ],
    "tags": [
      "al-Thaqifi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "109",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا هشيم، قال أخبرنا يونس بن عبيد، عن ابن سيرين، قال أخبرني عمرو بن وهب الثقفي، قال سمعت المغيرة بن شعبة، قال خصلتان لا أسأل عنهما أحدا بعد ما شهدت من رسول الله صلى الله عليه وسلم - قال - كنا معه في سفر فبرز لحاجته ثم جاء فتوضأ ومسح بناصيته وجانبى عمامته ومسح على خفيه قال وصلاة الإمام خلف الرجل من رعيته فشهدت من رسول الله صلى الله عليه وسلم أنه كان في سفر فحضرت الصلاة فاحتبس عليهم النبي صلى الله عليه وسلم فأقاموا الصلاة وقدموا ابن عوف فصلى بهم فجاء رسول الله صلى الله عليه وسلم فصلى خلف ابن عوف ما بقي من الصلاة فلما سلم ابن عوف قام النبي صلى الله عليه وسلم فقضى ما سبق به ‏.‏",
      "text_en": " Al-Mughirah bin Shu'bah said:                      \"There are two things which I never asked anyone about after I saw the Messenger of Allah (ﷺ). He was with us on a journey and he went away to relieve himself, then he came and performed Wudu', and he wiped over his forehead and two sides of his 'Imamah, and he wiped over his Khuffs.\" He said: \"And (the other issue) the Imam's Salah behind one of his followers. I saw the Messenger of Allah (ﷺ) when he was on a journey and time for prayer came. The Prophet (ﷺ) could not join them, so they called the Iqamah and they asked Ibn 'Awf to lead them in prayer. Then the Messenger of Allah (ﷺ) came and offered the remainder of the prayer behinf Ibn 'Awf, then when Ibn 'Awf said the Salah, the Prophet (ﷺ) stood up and completed what he had missed (of the prayer).\"",
      "chain": [
        "20184",
        "20468",
        "11075",
        "11035",
        "18813",
        "166"
      ]
    }
  ],
  "total_hadiths": 1
}