{
  "id": "189",
  "name": "'Uqba bin 'Amir al-Juhayni ( عقبة بن عامر الجهني ( رضي الله عنه",
  "full_name": "'Uqba bin 'Amir al-Juhayni ( عقبة بن عامر الجهني ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "HIjaz"
    },
    "death": {
      "date_hijri": "58",
      "date_gregorian": "677",
      "date_display": null,
      "place": "Cario",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Syria",
      "Egypt"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]",
      "Commander",
      "Governor",
      "Art/Poetry"
    ],
    "tags": [
      "B.Juhayna",
      "al-Juhni",
      "B.Quda'a",
      "Mule Driver",
      "Servant",
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "4048",
      "name": "Abu Umama al-Bahili ( أبو أمامة الباهلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11046",
      "name": "Qays bin Abi Hazim قيس بن أبي حازم",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "4097",
      "name": "Jubayr bin Nufayr al-Hadrami ( جبير بن نفير الحضرمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10893",
      "name": "B'jh bin 'Abdullah بعجة بن عبد الله بن بدر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "16027",
      "name": "Dkhyn bin 'Amir al-Hjry Abu دخين بن عامر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11334",
      "name": "Raba'i bin Harash bin Jahsh ربعي بن حراش",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10851",
      "name": "Thmamh bin Shfy ثمامة بن شفي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10867",
      "name": "'Abdur Rahman bin Shmas'h عبد الرحمن بن شماسة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10870",
      "name": "'Ali bin Rabah bin Qasayr علي بن رباح بن قصير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11410",
      "name": "Marthad bin 'Abdullah al-Yazni مرثد بن عبد الله اليزني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "16099",
      "name": "Mushrah bin Ha'an al-Ma'fari مشرح بن هاعان المعافري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11027",
      "name": "Abu Idrees al-Khulani أبو إدريس الخولاني",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "16021",
      "name": "Hay bin Yu'man, Abu 'Ashana حي بن يؤمن بن حجيل",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19940",
      "name": "Kathir bin Marrah al-Hadrami كثير بن مرة الحضرمي",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-375",
      "hadith_no": "375",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال حدثنا الليث، عن يزيد، عن أبي الخير، عن عقبة بن عامر، قال أهدي إلى النبي صلى الله عليه وسلم فروج حرير، فلبسه فصلى فيه، ثم انصرف فنزعه نزعا شديدا كالكاره له وقال ‏\"‏ لا ينبغي هذا للمتقين ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     The Prophet was given a silken Farruj [??] as a present. He wore it while praying. When he had finished his prayer, he took it off violently as if with a strong aversion to it and said, \"It is not the dress of Allah-fearing pious people.\"",
      "usc_msa_ref": "372",
      "chain": [
        "30355",
        "20023",
        "20472",
        "11410",
        "189"
      ]
    },
    {
      "id": "sahih-bukhari-851",
      "hadith_no": "851",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن عبيد، قال حدثنا عيسى بن يونس، عن عمر بن سعيد، قال أخبرني ابن أبي مليكة، عن عقبة، قال صليت وراء النبي صلى الله عليه وسلم بالمدينة العصر فسلم ثم قام مسرعا، فتخطى رقاب الناس إلى بعض حجر نسائه، ففزع الناس من سرعته فخرج عليهم، فرأى أنهم عجبوا من سرعته فقال ‏\"‏ ذكرت شيئا من تبر عندنا فكرهت أن يحبسني، فأمرت بقسمته ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba:                     I offered the `Asr prayer behind the Prophet at Medina. When he had finished the prayer with Taslim, he got up hurriedly and went out by crossing the rows of the people to one of the dwellings of his wives. The people got scared at his speed . The Prophet came back and found the people surprised at his haste and said to them, \"I remembered a piece of gold Lying in my house and I did not like it to divert my attention from Allah's worship, so I have ordered it to be distributed (in charity).",
      "usc_msa_ref": "810",
      "chain": [
        "30213",
        "20347",
        "10652",
        "11090",
        "189"
      ]
    },
    {
      "id": "sahih-bukhari-1344",
      "hadith_no": "1344",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، حدثني يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أن النبي صلى الله عليه وسلم خرج يوما فصلى على أهل أحد صلاته على الميت، ثم انصرف إلى المنبر فقال ‏\"‏ إني فرط لكم، وأنا شهيد عليكم، وإني والله لأنظر إلى حوضي الآن، وإني أعطيت مفاتيح خزائن الأرض  أو مفاتيح الأرض  وإني والله ما أخاف عليكم أن تشركوا بعدي، ولكن أخاف عليكم أن تنافسوا فيها ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     One day the Prophet went out and offered the funeral prayers of the martyrs of Uhud and then went up the pulpit and said, \"I will pave the way for you as your predecessor and will be a witness on you. By Allah! I see my Fount (Kauthar) just now and I have been given the keys of all the treasures of the earth (or the keys of the earth). By Allah! I am not afraid that you will worship others along with Allah after my death, but I am afraid that you will fight with one another for the worldly things.\"",
      "usc_msa_ref": "428",
      "chain": [
        "30355",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "id": "sahih-bukhari-1899",
      "hadith_no": "1899",
      "source": "Sahih Bukhari",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن يحيى بن أيوب، عن يزيد، عن أبي الخير، عن عقبة،، فذكر الحديث‏.‏   حدثنا إبراهيم بن موسى، أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني سعيد بن أبي أيوب، أن يزيد بن أبي حبيب، أخبره أن أبا الخير حدثه عن عقبة بن عامر، قال نذرت أختي أن تمشي، إلى بيت الله، وأمرتني أن أستفتي لها النبي صلى الله عليه وسلم فاستفتيته، فقال عليه السلام ‏\"‏ لتمش ولتركب ‏\"‏‏.‏ قال وكان أبو الخير لا يفارق عقبة‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     My sister vowed to go on foot to the Ka`ba, and she asked me to take the verdict of the Prophet about it. So, I did and the Prophet said, \"She should walk and also should ride.\"Narrated Abul-Khair from `Uqba as above.:",
      "usc_msa_ref": "",
      "chain": [
        "20241",
        "11070",
        "20379",
        "20304",
        "11410",
        "30309",
        "20467",
        "11070",
        "20375",
        "11411",
        "189"
      ]
    },
    {
      "id": "sahih-bukhari-2300",
      "hadith_no": "2300",
      "source": "Sahih Bukhari",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "حدثنا عمرو بن خالد، حدثنا الليث، عن يزيد، عن أبي الخير، عن عقبة بن عامر  رضى الله عنه  أن النبي صلى الله عليه وسلم أعطاه غنما يقسمها على صحابته، فبقي عتود فذكره للنبي صلى الله عليه وسلم فقال ‏\"ضح به أنت.\"",
      "text_en": " Narrated `Uqba bin Amir:                     that the Prophet had given him sheep to distribute among his companions and a male kid was left (after the distribution). When he informed the Prophet of it, he said (to him), \"Offer it as a sacrifice on your behalf.\"",
      "usc_msa_ref": "497",
      "chain": [
        "30237",
        "20023",
        "20472",
        "11410",
        "189"
      ]
    },
    {
      "id": "sahih-bukhari-2461",
      "hadith_no": "2461",
      "source": "Sahih Bukhari",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، قال حدثني يزيد، عن أبي الخير، عن عقبة بن عامر، قال قلنا للنبي صلى الله عليه وسلم إنك تبعثنا فننزل بقوم لا يقرونا فما ترى فيه فقال لنا ‏\"‏ إن نزلتم بقوم، فأمر لكم بما ينبغي للضيف فاقبلوا، فإن لم يفعلوا فخذوا منهم حق الضيف ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     We staid to the Prophet, \"You send us out and it happens that we have to stay with such people as do not entertain us. What do you think about it? He said to us, \"If you stay with some people and they entertain you as they should for a guest, accept their hospitality, but If they don't do, take the right of the guest from them.\"",
      "usc_msa_ref": "641",
      "chain": [
        "30355",
        "20023",
        "20472",
        "11410",
        "189"
      ]
    },
    {
      "id": "sahih-bukhari-2500",
      "hadith_no": "2500",
      "source": "Sahih Bukhari",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر  رضى الله عنه  أن رسول الله صلى الله عليه وسلم أعطاه غنما يقسمها على صحابته ضحايا، فبقي عتود فذكره لرسول الله صلى الله عليه وسلم فقال ‏\"‏ ضح به أنت ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     that Allah's Apostle gave him some sheep to distribute among his companions in order to sacrifice them and a kid was left. He told the Prophet about it and the Prophet said to him, \"Sacrifice it on your behalf.\"",
      "usc_msa_ref": "679",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "id": "sahih-bukhari-2721",
      "hadith_no": "2721",
      "source": "Sahih Bukhari",
      "chapter": "Conditions - كتاب الشروط",
      "chapter_no": "54",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، قال حدثني يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أحق الشروط أن توفوا به ما استحللتم به الفروج ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin Amir:                     Allah's Apostle said, \"From among all the conditions which you have to fulfill, the conditions which make it legal for you to have sexual relations (i.e. the marriage contract) have the greatest right to be fulfilled.\"",
      "usc_msa_ref": "882",
      "chain": [
        "30355",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "id": "sahih-bukhari-3639",
      "hadith_no": "3639",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني سعيد بن شرحبيل، حدثنا ليث، عن يزيد، عن أبي الخير، عن عقبة بن عامر، أن النبي صلى الله عليه وسلم خرج يوما فصلى على أهل أحد صلاته على الميت، ثم انصرف إلى المنبر، فقال ‏\"‏ إني فرطكم، وأنا شهيد عليكم، إني والله لأنظر إلى حوضي الآن، وإني قد أعطيت خزائن مفاتيح الأرض، وإني والله ما أخاف بعدي أن تشركوا، ولكن أخاف أن تنافسوا فيها ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin `Amr:                     The Prophet once came out and offered the funeral prayer for the martyrs of Uhud, and proceeded to the pulpit and said, \"I shall be your predecessor and a witness on you, and I am really looking at my sacred Fount now, and no doubt, I have been given the keys of the treasures of the world. By Allah, I am not afraid that you will worship others along with Allah, but I am afraid that you will envy and fight one another for worldly fortunes.\"",
      "usc_msa_ref": "795",
      "chain": [
        "30194",
        "20023",
        "20472",
        "11410",
        "189"
      ]
    },
    {
      "id": "sahih-bukhari-4092",
      "hadith_no": "4092",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن عبد الرحيم، أخبرنا زكرياء بن عدي، أخبرنا ابن المبارك، عن حيوة، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، قال صلى رسول الله صلى الله عليه وسلم على قتلى أحد بعد ثماني سنين، كالمودع للأحياء والأموات، ثم طلع المنبر فقال ‏\"‏ إني بين أيديكم فرط، وأنا عليكم شهيد، وإن موعدكم الحوض، وإني لأنظر إليه من مقامي هذا، وإني لست أخشى عليكم أن تشركوا، ولكني أخشى عليكم الدنيا أن تنافسوها ‏\"‏‏.‏ قال فكانت آخر نظرة نظرتها إلى رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Uqba bin Amir:                     Allah's Apostle offered the funeral prayers of the martyrs of Uhud eight years after (their death), as if bidding farewell to the living and the dead, then he ascended the pulpit and said, \"I am your predecessor before you, and I am a witness on you, and your promised place to meet me will be Al- Haud (i.e. the Tank) (on the Day of Resurrection), and I am (now) looking at it from this place of mine. I am not afraid that you will worship others besides Allah, but I am afraid that worldly life will tempt you and cause you to compete with each other for it.\" That was the last look which I cast on Allah's Apostle.",
      "usc_msa_ref": "",
      "chain": [
        "30272",
        "30464",
        "20025",
        "26010",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "id": "sahih-bukhari-4134",
      "hadith_no": "4134",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عمرو بن خالد، حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة، أن النبي صلى الله عليه وسلم خرج يوما فصلى على أهل أحد صلاته على الميت، ثم انصرف إلى المنبر فقال ‏\"‏ إني فرط لكم، وأنا شهيد عليكم، وإني لأنظر إلى حوضي الآن، وإني أعطيت مفاتيح خزائن الأرض  أو مفاتيح الأرض  وإني والله ما أخاف عليكم أن تشركوا بعدي، ولكني أخاف عليكم أن تنافسوا فيها ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba:                     One day the Prophet went out and offered the (funeral) prayer for the people (i.e. martyrs) of Uhud as he used to offer a funeral prayer for any dead person, and then (after returning) he ascended the pulpit and said, \"I am your predecessor before you, and I am a witness upon you, and I am looking at my Tank just now, and I have been given the keys of the treasures of the world (or the keys of the world). By Allah, I am not afraid that you will worship others besides Allah after me, but I am afraid that you will compete with each other for (the pleasures of) this world.\"",
      "usc_msa_ref": "411",
      "chain": [
        "30237",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "id": "sahih-bukhari-5206",
      "hadith_no": "5206",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا أبو الوليد، هشام بن عبد الملك حدثنا ليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة، عن النبي صلى الله عليه وسلم قال ‏\"‏ أحق ما أوفيتم من الشروط أن توفوا به ما استحللتم به الفروج ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba:                     The Prophet said: \"The stipulations most entitled to be abided by are those with which you are given the right to enjoy the (women's) private parts (i.e. the stipulations of the marriage contract).",
      "usc_msa_ref": "81",
      "chain": [
        "20296",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "id": "sahih-bukhari-5287",
      "hadith_no": "5287",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إياكم والدخول على النساء ‏\"‏‏.‏ فقال رجل من الأنصار يا رسول الله أفرأيت الحمو‏.‏ قال ‏\"‏ الحمو الموت ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     Allah's Apostle said, \"Beware of entering upon the ladies.\" A man from the Ansar said, \"Allah's Apostle! What about Al-Hamu the in-laws of the wife (the brothers of her husband or his nephews etc.)?\" The Prophet replied: The in-laws of the wife are death itself.",
      "usc_msa_ref": "159",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "id": "sahih-bukhari-5605",
      "hadith_no": "5605",
      "source": "Sahih Bukhari",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا معاذ بن فضالة، حدثنا هشام، عن يحيى، عن بعجة الجهني، عن عقبة بن عامر الجهني، قال قسم النبي صلى الله عليه وسلم بين أصحابه ضحايا، فصارت لعقبة جذعة‏.‏ فقلت يا رسول الله صارت جذعة‏.‏ قال ‏\"‏ ضح بها ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir Al-Juhani:                     that the Prophet distributed among his companions some animals for sacrifice (to be slaughtered on `Id-al-Adha). `Uqba's share was a Jadha'a (a six month old goat). `Uqba said, \"O Allah's Apostle! I get in my share of Jadha'a (a six month old ram).\" The Prophet said, \"Slaughter it as a sacrifice.\"",
      "usc_msa_ref": "455",
      "chain": [
        "30177",
        "20295",
        "20031",
        "189"
      ]
    },
    {
      "id": "sahih-bukhari-5613",
      "hadith_no": "5613",
      "source": "Sahih Bukhari",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا عمرو بن خالد، حدثنا الليث، عن يزيد، عن أبي الخير، عن عقبة بن عامر  رضى الله عنه أن النبي صلى الله عليه وسلم أعطاه غنما يقسمها على صحابته ضحايا، فبقي عتود فذكره للنبي صلى الله عليه وسلم فقال ‏\"‏ ضح أنت به ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     that the Prophet gave him some sheep to distribute among his companions to slaughter as sacrifices (`Id--al--Adha). A kid was left and he told the Prophet of that whereupon he said to him, \"Slaughter it as a sacrifice (on your behalf).",
      "usc_msa_ref": "462",
      "chain": [
        "30237",
        "20023",
        "20472",
        "11410",
        "189"
      ]
    },
    {
      "id": "sahih-bukhari-5861",
      "hadith_no": "5861",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر  رضى الله عنه  أنه قال أهدي لرسول الله صلى الله عليه وسلم فروج حرير، فلبسه، ثم صلى فيه، ثم انصرف فنزعه نزعا شديدا كالكاره له ثم قال ‏\"‏ لا ينبغي هذا للمتقين ‏\"‏‏.‏ تابعه عبد الله بن يوسف عن الليث، وقال غيره فروج حرير‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     A silken Farruj was presented to Allah's Apostle and he put it on and offered the prayer in it. When he finished the prayer, he took it off violently as if he disliked it and said, \"This (garment) does not befit those who fear Allah!\"",
      "usc_msa_ref": "693",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "id": "sahih-bukhari-6207",
      "hadith_no": "6207",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر  رضى الله عنه  أنه قال قلنا يا رسول الله إنك تبعثنا فننزل بقوم فلا يقروننا فما ترى، فقال لنا رسول الله صلى الله عليه وسلم ‏\"‏ إن نزلتم بقوم فأمروا لكم بما ينبغي للضيف فاقبلوا، فإن لم يفعلوا فخذوا منهم حق الضيف الذي ينبغي لهم ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     We said, \"O Allah's Apostle! You send us out and it happens that we have to stay with such people as do not entertain us. What do you think about it?\" Allah's Apostle said to us, \"If you stay with some people and they entertain you as they should for a guest, accept is; but if they do not do then you should take from them the right of the guest, which they ought to give.\"",
      "usc_msa_ref": "159",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "id": "sahih-bukhari-6502",
      "hadith_no": "6502",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أن رسول الله صلى الله عليه وسلم خرج يوما فصلى على أهل أحد صلاته على الميت، ثم انصرف إلى المنبر فقال ‏\"‏ إني فرطكم وأنا شهيد عليكم، وإني والله لأنظر إلى حوضي الآن، وإني قد أعطيت مفاتيح خزائن الأرض  أو مفاتيح الأرض  وإني والله ما أخاف عليكم أن تشركوا بعدي، ولكني أخاف عليكم أن تنافسوا فيها ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     The Prophet went out and offered the funeral prayer for the martyrs of the (battle of) Uhud and then ascended the pulpit and said, \"I am your predecessor and I am a witness against you. By Allah, I am now looking at my Tank-lake (Al-Kauthar) and I have been given the keys of the treasures of the earth (or the keys of the earth). By Allah! I am not afraid that after me you will worship others besides Allah, but I am afraid that you will start competing for (the pleasures of) this world.\"",
      "usc_msa_ref": "434",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "id": "sahih-bukhari-6560",
      "hadith_no": "6560",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "وقال معاذ حدثنا شعبة، عن قتادة، سمعت عقبة، سمعت أبا سعيد، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "32",
        "20020",
        "11019",
        "189",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-6670",
      "hadith_no": "6670",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عمرو بن خالد، حدثنا الليث، عن يزيد، عن أبي الخير، عن عقبة  رضى الله عنه  أن النبي صلى الله عليه وسلم خرج يوما فصلى على أهل أحد صلاته على الميت، ثم انصرف على المنبر فقال ‏\"‏ إني فرط لكم، وأنا شهيد عليكم، وإني والله لأنظر إلى حوضي الآن، وإني أعطيت مفاتيح خزائن الأرض  أو مفاتيح الأرض  وإني والله ما أخاف عليكم أن تشركوا بعدي، ولكن أخاف عليكم أن تنافسوا فيها ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     Once the Prophet went out and offered the funeral prayers for the martyrs of Uhud, and then went to the pulpit and said, \"I am a predecessor for you and I am a witness for you: and by Allah, I am looking at my Fount just now, and the keys of the treasures of the earth (or the keys of the earth) have been given to me: and by Allah, I am not afraid that you will worship others besides Allah after me, but I am afraid that you will strive and struggle against each other over these treasures of the world.\"",
      "usc_msa_ref": "590",
      "chain": [
        "30237",
        "20023",
        "20472",
        "11410",
        "189"
      ]
    },
    {
      "id": "sahih-bukhari-7205",
      "hadith_no": "7205",
      "source": "Sahih Bukhari",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "قال عقبة وحدثنا عبيد الله، حدثنا أبو الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم مثله إلا أنه قال ‏\"‏ يحسر عن جبل من ذهب ‏\"‏‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "189",
        "11201",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-234-2",
      "hadith_no": "234",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثني محمد بن حاتم بن ميمون، حدثنا عبد الرحمن بن مهدي، حدثنا معاوية بن صالح، عن ربيعة، - يعني ابن يزيد - عن أبي إدريس الخولاني، عن عقبة بن عامر، ح وحدثني أبو عثمان، عن جبير بن نفير، عن عقبة بن عامر، قال كانت علينا رعاية الإبل فجاءت نوبتي فروحتها بعشي فأدركت رسول الله صلى الله عليه وسلم قائما يحدث الناس فأدركت من قوله ‏\"‏ ما من مسلم يتوضأ فيحسن وضوءه ثم يقوم فيصلي ركعتين مقبل عليهما بقلبه ووجهه إلا وجبت له الجنة ‏\"‏ ‏.‏ قال فقلت ما أجود هذه ‏.‏ فإذا قائل بين يدى يقول التي قبلها أجود ‏.‏ فنظرت فإذا عمر قال إني قد رأيتك جئت آنفا قال ‏\"‏ ما منكم من أحد يتوضأ فيبلغ - أو فيسبغ - الوضوء ثم يقول أشهد أن لا إله إلا الله وأن محمدا عبد الله ورسوله إلا فتحت له أبواب الجنة الثمانية يدخل من أيها شاء ‏\"‏ ‏.‏",
      "text_en": " 'Uqba b. 'Amir reported:                      We were entrusted with the task of tending the camels. On my turn when I came back in the evening after grazing them in the pastures, I found Allah's Messenger (may peace be upon him) stand and address the people. I heard these words of his: If any Muslim performs ablution well, then stands and prays two rak'ahs setting about them with his heart as well as his face, Paradise would be guaranteed to him. I said: What a fine thing is this! And a narrator who was before me said: The first was better than even this. When I cast a glance, I saw that it was 'Umair who said: I see that you have just come and observed: If anyone amongst you performs the ablution, and then completes the ablution well and then says: I testify that there is no god but Allah and that Muhammad is the servant of Allah and His Messenger, the eight gates of Paradise would be opened for him and he may enter by whichever of them he wishes.",
      "usc_msa_ref": "",
      "chain": [
        "30514",
        "20033",
        "20675",
        "11414",
        "11027",
        "189",
        "11113",
        "4097",
        "189"
      ]
    },
    {
      "id": "sahih-muslim-234-3",
      "hadith_no": "234",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، حدثنا معاوية بن صالح، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، وأبي، عثمان عن جبير بن نفير بن مالك الحضرمي، عن عقبة بن عامر الجهني، أن رسول الله صلى الله عليه وسلم ‏.‏ قال فذكر مثله غير أنه قال ‏\"‏ من توضأ فقال أشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمدا عبده ورسوله ‏\"‏ ‏.‏",
      "text_en": " Uqba b. 'Amir al-Juhani reported:                      Verily the Messenger of Allah (may peace be upon him) said and then narrated (the hadith) like one (mentioned above) except (this) that he said: He who performed ablution and said: I testify that there is no god but Allah, the One, there is no associate with Him and I testify that Muhammad is His servant and His Messenger.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20650",
        "20675",
        "11414",
        "11027",
        "11113",
        "4097",
        "189"
      ]
    },
    {
      "id": "sahih-muslim-1909",
      "hadith_no": "1909",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا الفضل بن دكين، عن موسى بن على، قال سمعت أبي يحدث، عن عقبة بن عامر، قال خرج رسول الله صلى الله عليه وسلم ونحن في الصفة فقال ‏\"‏ أيكم يحب أن يغدو كل يوم إلى بطحان أو إلى العقيق فيأتي منه بناقتين كوماوين في غير إثم ولا قطع رحم ‏\"‏ ‏.‏ فقلنا يا رسول الله نحب ذلك ‏.‏ قال ‏\"‏ أفلا يغدو أحدكم إلى المسجد فيعلم أو يقرأ آيتين من كتاب الله عز وجل خير له من ناقتين وثلاث خير له من ثلاث وأربع خير له من أربع ومن أعدادهن من الإبل ‏\"‏ ‏.‏",
      "text_en": " Abu Umama said he heard Allah's Messenger (may peace be upon him) say:                      Recite the Qur'an, for on the Day of Resurrection it will come as an intercessor for those who recite It. Recite the two bright ones, al-Baqara and Surah Al 'Imran, for on the Day of Resurrection they will come as two clouds or two shades, or two flocks of birds in ranks, pleading for those who recite them. Recite Surah al-Baqara, for to take recourse to it is a blessing and to give it up is a cause of grief, and the magicians cannot confront it. (Mu'awiya said: It has been conveyed to me that here Batala means magicians.)",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20348",
        "189"
      ]
    },
    {
      "id": "sahih-muslim-1927",
      "hadith_no": "1927",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا جرير، عن بيان، عن قيس بن أبي حازم، عن عقبة بن عامر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألم تر آيات أنزلت الليلة لم ير مثلهن قط ‏{‏ قل أعوذ برب الفلق‏}‏ و ‏{‏ قل أعوذ برب الناس‏}‏ ‏\"‏ ‏.‏",
      "text_en": " 'Uqba b. 'Amir reported:                      The Messenger of Allah (may peace be upon him) said to me: There have been sent down to me verses the like of which had never been seen before. They are the Mu'awwadhatain.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20028",
        "11326",
        "11046",
        "189"
      ]
    },
    {
      "id": "sahih-muslim-1928",
      "hadith_no": "1928",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا إسماعيل، عن قيس، عن عقبة بن عامر، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ أنزل - أو أنزلت - على آيات لم ير مثلهن قط المعوذتين ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated through another chain of transmitters directly from the Companions of Muhammad (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "20208",
        "11046",
        "189"
      ]
    },
    {
      "id": "sahih-muslim-1929",
      "hadith_no": "1929",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثني محمد بن رافع، حدثنا أبو أسامة، كلاهما عن إسماعيل، بهذا الإسناد مثله ‏.‏ وفي رواية أبي أسامة عن عقبة، بن عامر الجهني وكان من رفعاء أصحاب محمد صلى الله عليه وسلم ‏.‏",
      "text_en": " Salim narrated on the authority of his father (Ibn 'Umar) that the Apostle of Allah (may peace be upon him) said:                      Envy is not justified but in case of two persons only: one who, having been given (knowledge of) the Qur'an by Allah, recites it during the night and day (and also acts upon it) and a man who, having been given wealth by God, spends it during the night and the day (for the welfare of others. seeking the pleasure of the Lord).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "30375",
        "189"
      ]
    },
    {
      "id": "sahih-muslim-1966",
      "hadith_no": "1966",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا يحيى بن يحيى، حدثنا عبد الله بن وهب، عن موسى بن على، عن أبيه، قال سمعت عقبة بن عامر الجهني، يقول ثلاث ساعات كان رسول الله صلى الله عليه وسلم ينهانا أن نصلي فيهن أو أن نقبر فيهن موتانا حين تطلع الشمس بازغة حتى ترتفع وحين يقوم قائم الظهيرة حتى تميل الشمس وحين تضيف الشمس للغروب حتى تغرب ‏.‏",
      "text_en": " 'Amr b. 'Abasa Sulami reported:                      I in the state of the Ignorance (before embracing Islam) used to think that the people were in error and they were not on anything (which may be called the right path) and worshipped the idols. In the meanwhile I heard of a man in Mecca who was giving news (on the basis of his prophetic knowledge) ; so I sat on my ride and went to him. The Messenger of Allah (may peace be upon him) was at that time hiding as his people had made life hard for him. I adopted a friendly attitude (towards the Meccans and thus managed) to enter Mecca and go to him (the Holy Prophet) and I said to him: Who are you? He said: I am a Prophet (of Allah). I again said: Who is a Prophet? He said: (I am a Prophet in the sense that) I have been sent by Allah. I said: What is that which you have been sent with? He said: I have been sent to join ties of relationship (with kindness and affection), to break the Idols, and to proclaim the oneness of Allah (in a manner that) nothing is to be associated with Him. I said: Who is with you in this (in these beliefs and practices)? He said: A free man and a slave. He (the narrator) said: Abu Bakr and Bilal were there with him among those who had embraced Islam by that time. I said: I intend to follow you. He said: During these days you would not be able to do so. Don't you see the (hard) condition under which I and (my) people are living? You better go back to your people and when you hear that I have been granted victory, you come to me. So I went to my family. I was in my home when the Messengerof Allah (may peace be upon him) came to Medina. I was among my people and used to seek news and ask people when he arrived in Medina. Then a group of people belonging to Yathrib (Medina) came. I said (to them): How is that person getting on who has come to Medina? They said: The people are hastening to him, while his people (the polytheists of Mecca) planned to kill him, but they could not do so. I (on hearing It) came to Medina and went to him and said: Messenger of Allah, do you recognise me? He said: Yes, you are the same man who met me at Mecca. I said: It is so. I again said: Prophet of Allah, tell me that which Allah has taught you and which I do not know, tell me about the prayer. He said: Observe the dawn prayer, then stop praying when the sun is rising till it Is fully up, for when it rises it comes up between the horns of Satan, and the unbelievers prostrate themselves to it at that time. Then pray, for the prayer is witnessed and attended (by angels) till the shadow becomes about the length of a lance; then cease prayer, for at that time Hell is heated up. Then when the shadow moves forward, pray, for the prayer is witnessed and attended by angels, till you pray the afternoon prayer, then cease prayer till the sun sets, for it sets between the horns of devil, and at that time the unbelievers prostrate themselves before it. I said: Apostle of Allah, tell me about ablution also. He said: None of you who uses water for ablution and rinses his mouth, snuffs up water and blows it, but the sins of his face, and his mouth and his nostrils fall out. When he washes his face, as Allah has commanded him, the sins of his face fall out from the end of his beard with water. Then (when) he washes his forearms up to the elbows, the sins of his arms fall out along with water from his finger-tips. And when he wipes his head, the sins of his head fall out from the points of his hair along with water. And (when) he washes his feet up to the ankles, the sins of his feet fall out from his toes along with water. And if he stands to pray and praises Allah, lauds Him and glorifies Him with what becomes Him and shows wholehearted devotion to Allah, his sins would depart leaving him (as innocent) as he was on the day his mother bore him. 'Amr b. 'Abasa narrated this hadith to Abu Umama, a Companion of the Messenger of Allah (may peace be upon him), and Abu Umama said to him: 'Amr b. 'Abasa, think what you are saying that such (a great reward) is given to a man at one place (only in the act of ablution and prayer). Upon this 'Amr said: Abu Umama, I have grown old and my bones have become weak and I am at the door of death; what impetus is there for me to attribute a lie to Allah and the Messenger of Allah (may peace be upon him)? Had I heard it from the Messenger of Allah (may peace be upon him) once, twice, or three times (even seven times), I would have never narrated it, but I have heard it from him on occasions more than these.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20029",
        "189"
      ]
    },
    {
      "id": "sahih-muslim-3529",
      "hadith_no": "3529",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني أبو الطاهر، أخبرنا عبد الله بن وهب، عن الليث، وغيره، عن يزيد بن، أبي حبيب عن عبد الرحمن بن شماسة، أنه سمع عقبة بن عامر، على المنبر يقول إن رسول الله صلى الله عليه وسلم قال ‏\"‏ المؤمن أخو المؤمن فلا يحل للمؤمن أن يبتاع على بيع أخيه ولا يخطب على خطبة أخيه حتى يذر ‏\"‏ ‏.‏",
      "text_en": " 'Uqba b. 'Amir said on the pulpit that Allah's Messenger (may peace be upon him) said:                      A believer is the brother of a believer, so it is not lawful for a believer to outbid his brother, and he should not propose an engagement when his brother has thus proposed until he gives it up.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20023",
        "11411",
        "10867",
        "189"
      ]
    },
    {
      "id": "sahih-muslim-3537",
      "hadith_no": "3537",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا يحيى بن أيوب، حدثنا هشيم، ح وحدثنا ابن نمير، حدثنا وكيع، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، ح وحدثنا محمد بن المثنى، حدثنا يحيى، - وهو القطان - عن عبد الحميد بن جعفر، عن يزيد بن أبي حبيب، عن مرثد بن عبد، الله اليزني عن عقبة بن عامر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أحق الشرط أن يوفى به ما استحللتم به الفروج ‏\"‏ ‏.‏ هذا لفظ حديث أبي بكر وابن المثنى ‏.‏ غير أن ابن المثنى قال ‏\"‏ الشروط ‏\"‏ ‏.‏",
      "text_en": " 'Uqba b. Amir (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      The most worthy condition which must be fulfilled is that which makes sexual intercourse lawful. In the narration transmitted by Ibn Muthanna (instead of the word\" condition\" ) it is\" conditions\".",
      "usc_msa_ref": "",
      "chain": [
        "20379",
        "20468",
        "30212",
        "20032",
        "30201",
        "20326",
        "30170",
        "20031",
        "11875",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "id": "sahih-muslim-4339",
      "hadith_no": "4339",
      "source": "Sahih Muslim",
      "chapter": "The Book of Vows - كتاب النذر",
      "chapter_no": "27",
      "text_ar": "وحدثنا زكرياء بن يحيى بن صالح المصري، حدثنا المفضل، - يعني ابن فضالة - حدثني عبد الله بن عياش، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أنه قال نذرت أختي أن تمشي، إلى بيت الله حافية فأمرتني أن أستفتي لها رسول الله صلى الله عليه وسلم فاستفتيته فقال ‏\"‏ لتمش ولتركب ‏\"‏ ‏.‏",
      "text_en": " 'Uqba b. Amir reported:                      My sister took a vow that she would walk bare foot to the house of Allah (Ka'ba). She asked me to inquire from Allah's Messenger (may peace be upon him) about it. I sought his decision and he said: She should walk on foot and ride also.",
      "usc_msa_ref": "",
      "chain": [
        "30193",
        "20378",
        "778",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "id": "sahih-muslim-4340",
      "hadith_no": "4340",
      "source": "Sahih Muslim",
      "chapter": "The Book of Vows - كتاب النذر",
      "chapter_no": "27",
      "text_ar": "وحدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرنا سعيد، بن أبي أيوب أن يزيد بن أبي حبيب، أخبره أن أبا الخير حدثه عن عقبة بن عامر الجهني، أنه قال نذرت أختي ‏.‏ فذكر بمثل حديث مفضل ولم يذكر في الحديث حافية ‏.‏ وزاد وكان أبو الخير لا يفارق عقبة ‏.‏ وحدثنيه محمد بن حاتم، وابن أبي خلف، قالا حدثنا روح بن عبادة، حدثنا ابن، جريج أخبرني يحيى بن أيوب، أن يزيد بن أبي حبيب، أخبره بهذا الإسناد، ‏.‏ مثل حديث عبد الرزاق ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Uqba b. Amir Juhani. but in this no mention has been made of\" barefoot\".",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20121",
        "11070",
        "20375",
        "11411",
        "189"
      ]
    },
    {
      "id": "sahih-muslim-4342",
      "hadith_no": "4342",
      "source": "Sahih Muslim",
      "chapter": "The Book of Vows - كتاب النذر",
      "chapter_no": "27",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، ويونس بن عبد الأعلى، وأحمد بن عيسى، قال يونس أخبرنا وقال الآخران، حدثنا ابن وهب، أخبرني عمرو بن الحارث، عن كعب بن، علقمة عن عبد الرحمن بن شماسة، عن أبي الخير، عن عقبة بن عامر، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ كفارة النذر كفارة اليمين ‏\"‏ ‏.‏",
      "text_en": " 'Uqba. b. Amir reported Allah's Messenger (may peace be upon him) as saying:                      The expiation of the (breach of) a vow is the same as that of the (breach of an oath).",
      "usc_msa_ref": "",
      "chain": [
        "30492",
        "30227",
        "20475",
        "20029",
        "20377",
        "10872",
        "10867",
        "11410",
        "189"
      ]
    },
    {
      "id": "sahih-muslim-4613",
      "hadith_no": "4613",
      "source": "Sahih Muslim",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، أخبرنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أنه قال قلنا يا رسول الله إنك تبعثنا فننزل بقوم فلا يقروننا فما ترى فقال لنا رسول الله صلى الله عليه وسلم ‏\"‏ إن نزلتم بقوم فأمروا لكم بما ينبغي للضيف فاقبلوا فإن لم يفعلوا فخذوا منهم حق الضيف الذي ينبغي لهم ‏\"‏ ‏.‏",
      "text_en": " 'Uqba b. Amir reported:                      We said to Allah's Messenger (may peace be upon him): You send us out and we come to the people who do not give us hospitality, so what is your opinion? Thereupon Allah's Messenger (may peace be upon him) said: If you come to the people who order for you what is befitting a guest, accept it; but if they do not. take from them what befits them to give to a guest.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "30490",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "id": "sahih-muslim-5055",
      "hadith_no": "5055",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا هارون بن معروف، أخبرنا ابن وهب، أخبرني عمرو بن الحارث، عن  أبي علي، ثمامة بن شفى أنه سمع عقبة بن عامر، يقول سمعت رسول الله صلى الله عليه وسلم وهو على المنبر يقول ‏\"‏ وأعدوا لهم ما استطعتم من قوة ألا إن القوة الرمى ألا إن القوة الرمى ألا إن القوة الرمى ‏\"‏",
      "text_en": " It has been narrated on the authority of Ibn Amir who said:                      I heard the Messenger of Allah (may peace be upon him) say-and he was delivering a sermon from the pulpit: Prepare to meet them with as much strength as you can afford. Beware, strength consists in archery. Beware, strength consists in archery. Beware, strength consists in archery.",
      "usc_msa_ref": "",
      "chain": [
        "30280",
        "20029",
        "20377",
        "189"
      ]
    },
    {
      "id": "sahih-muslim-5056",
      "hadith_no": "5056",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا هارون بن معروف، حدثنا ابن وهب، أخبرني عمرو بن الحارث، عن  أبي علي، عن عقبة بن عامر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ستفتح عليكم أرضون ويكفيكم الله فلا يعجز أحدكم أن يلهو بأسهمه ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Uqba b. Amir who said:                      I heard the Messenger of Allah (may peace be upon him) say: Lands shall be thrown open to you and Allah will suffice you (against your enemies), but none of you should give up playing with his arrows.",
      "usc_msa_ref": "",
      "chain": [
        "30280",
        "20029",
        "20377",
        "189"
      ]
    },
    {
      "id": "sahih-muslim-5057",
      "hadith_no": "5057",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثناه داود بن رشيد، حدثنا الوليد، عن بكر بن مضر، عن عمرو بن الحارث، عن أبي علي الهمداني، قال سمعت عقبة بن عامر، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This tradition has also been narrated on the same authority through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30248",
        "20733",
        "20374",
        "20377",
        "189"
      ]
    },
    {
      "id": "sahih-muslim-5196",
      "hadith_no": "5196",
      "source": "Sahih Muslim",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، أخبرنا الليث، عن  يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أن رسول الله صلى الله عليه وسلم أعطاه غنما يقسمها على أصحابه ضحايا فبقي عتود فذكره لرسول الله صلى الله عليه وسلم فقال ‏\"‏ ضح به أنت ‏\"‏ ‏.‏ قال قتيبة على صحابته ‏.‏",
      "text_en": " Uqba b. 'Amir reported that Allah's Messenger (may peace be upon him) gave the gifts of goats to be distributed amongst his Companions. They sacrificed them, but a lamb of one year of age was left. (Someone) made a mention of that to the Messenger of Allah (may peace be upon him), whereupon he said:                      You sacrifice it.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "30490",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "id": "sahih-muslim-5197",
      "hadith_no": "5197",
      "source": "Sahih Muslim",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، عن هشام الدستوائي، عن  يحيى بن أبي كثير، عن بعجة الجهني، عن عقبة بن عامر الجهني، قال قسم رسول الله صلى الله عليه وسلم فينا ضحايا فأصابني جذع فقلت يا رسول الله إنه أصابني جذع ‏.‏ فقال ‏\"‏ ضح به ‏\"‏ ‏.‏",
      "text_en": " Amir al-Juhani reported:                      Allah's Messenger (may peace be upon him) distributed sacrificial animals (amongst us for sacrificing them on 'Id al-Adha). So we sacrificed them. There fell to my lot a lamb of less than one year I said: Allah's Messenger, there has fallen to my lot a lamb (Jadha'a), whereupon he said: Sacrifice that.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20472",
        "20295",
        "11449",
        "189"
      ]
    },
    {
      "id": "sahih-muslim-5198",
      "hadith_no": "5198",
      "source": "Sahih Muslim",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثني عبد الله بن عبد الرحمن الدارمي، حدثنا يحيى، - يعني ابن حسان - أخبرنا معاوية، - وهو ابن سلام - حدثني يحيى بن أبي كثير، أخبرني بعجة بن عبد، الله أن عقبة بن عامر الجهني، أخبره أن رسول الله صلى الله عليه وسلم قسم ضحايا بين أصحابه ‏.‏ بمثل معناه ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of 'Uqba b. 'Amir al-Juhan with a slight change of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "20300",
        "20401",
        "11449",
        "189"
      ]
    },
    {
      "id": "sahih-muslim-5548",
      "hadith_no": "5548",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أنه قال أهدي لرسول الله صلى الله عليه وسلم فروج حرير فلبسه ثم صلى فيه ثم انصرف فنزعه نزعا شديدا كالكاره له ثم قال ‏\"‏ لا ينبغي هذا للمتقين ‏\"‏.‏",
      "text_en": " Uqba b. 'Amir said:                      A silk go vn was presented to Allah's Messenger (may peace be upon him) and he wore it and observed prayer in it and then returned and put it off so violently as if he despised it. He then said: It does not befit the Godfearing persons.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "id": "sahih-muslim-5803",
      "hadith_no": "5803",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، أخبرنا الليث، عن  يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إياكم والدخول على النساء ‏\"‏ ‏.‏ فقال رجل من الأنصار يا رسول الله أفرأيت الحمو قال ‏\"‏ الحمو الموت ‏\"‏ ‏.‏",
      "text_en": " 'Uqba b. Amir reported Allah's Messenger (may peace be upon him) as saying:                      Beware of getting, into the houses and meeting women (in seclusion). A person from the Ansir said: Allah's Messenger, what about husband's brother, whereupon he said: Husband's brother is like death.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "30490",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "id": "sahih-muslim-6116",
      "hadith_no": "6116",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن  عقبة بن عامر، أن رسول الله صلى الله عليه وسلم خرج يوما فصلى على أهل أحد صلاته على الميت ثم انصرف إلى المنبر فقال ‏\"‏ إني فرط لكم وأنا شهيد عليكم وإني والله لأنظر إلى حوضي الآن وإني قد أعطيت مفاتيح خزائن الأرض أو مفاتيح الأرض وإني والله ما أخاف عليكم أن تشركوا بعدي ولكن أخاف عليكم أن تتنافسوا فيها ‏\"‏ ‏.‏",
      "text_en": " Uqba b. 'Amir reported that Allah's Messenger (may peace be upon him) one day went out and he offered prayer over the martyrs of Uhud just as prayer is offered over the dead. He then came back and sat on pulpit and said:                      I shall be present there (at the Cistern) before you. I shall be your witness and, by Allah, I perceive as if I am seeing with my own eyes my Cistern at this very state and I have been given the keys of the treasures of the earth or the keys of the earth and, by Allah, I am not afraid concerning you that you would associate anything (with Allah after me), but I am afraid that you would be vying with one another (for the possession of) the treasures of the earth.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "id": "sahih-muslim-6117",
      "hadith_no": "6117",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا وهب، - يعني ابن جرير - حدثنا أبي قال، سمعت  يحيى بن أيوب، يحدث عن يزيد بن أبي حبيب، عن مرثد، عن عقبة بن عامر، قال صلى رسول الله صلى الله عليه وسلم على قتلى أحد ثم صعد المنبر كالمودع للأحياء والأموات فقال ‏\"‏ إني فرطكم على الحوض وإن عرضه كما بين أيلة إلى الجحفة إني لست أخشى عليكم أن تشركوا بعدي ولكني أخشى عليكم الدنيا أن تنافسوا فيها وتقتتلوا فتهلكوا كما هلك من كان قبلكم ‏\"‏ ‏.‏ قال عقبة فكانت آخر ما رأيت رسول الله صلى الله عليه وسلم على المنبر ‏.‏",
      "text_en": " Uqba b. 'Amir reported Allah's Messenger (may peace be upon him) as saying:                      Allah's Messenger offered prayer over those who had fallen matyrs at Uhud. He then climbed the pulpit as if someone is saying good-bye to the living and the dead, and then said: I shall be there as your predecesor on the Cistern before you, and it is as wide as the distance between Aila and Juhfa (Aila is at the top of the gulf of 'Aqaba). I am not afraid that you would associate anything with Allah after me, but I am afraid that you may be (allured) by the world and (vie) with one another (in possessing material wealth) and begin killing one another, and you would be destroyed as were destroyed those who had gone before you. 'Uqba said that that was the last occasion that he saw Allah's Massenger on the pulpit.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20298",
        "11272",
        "20379",
        "11411",
        "189"
      ]
    },
    {
      "id": "sahih-muslim-7506",
      "hadith_no": "7506",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثني محمد بن عمرو بن جبلة، حدثنا محمد بن جعفر، ح وحدثنا عقبة بن، مكرم العمي وأبو بكر بن نافع قال عقبة حدثنا وقال أبو بكر، أخبرنا غندر، حدثنا شعبة، قال سمعت خالدا، يحدث عن سعيد بن أبي الحسن، عن أمه، عن أم سلمة، أن رسول الله صلى الله عليه وسلم قال لعمار ‏\"‏ تقتلك الفئة الباغية ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Umm Salama that Allah's Messenger (may peace be upon him) said to 'Ammar:                      A group of rebels would kill you.",
      "usc_msa_ref": "",
      "chain": [
        "38562",
        "20173",
        "30441",
        "189",
        "20436",
        "20278",
        "20020",
        "11282",
        "11287",
        "10737",
        "56"
      ]
    },
    {
      "id": "sunan-abi-daud-169",
      "hadith_no": "169",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن سعيد الهمداني، حدثنا ابن وهب، سمعت معاوية، - يعني ابن صالح - يحدث عن أبي عثمان، عن جبير بن نفير، عن عقبة بن عامر، قال كنا مع رسول الله صلى الله عليه وسلم خدام أنفسنا نتناوب الرعاية رعاية إبلنا فكانت على رعاية الإبل فروحتها بالعشي فأدركت رسول الله صلى الله عليه وسلم يخطب الناس فسمعته يقول ‏\"‏ ما منكم من أحد يتوضأ فيحسن الوضوء ثم يقوم فيركع ركعتين يقبل عليهما بقلبه ووجهه إلا قد أوجب ‏\"‏ ‏.‏ فقلت بخ بخ ما أجود هذه ‏.‏ فقال رجل من بين يدى التي قبلها يا عقبة أجود منها ‏.‏ فنظرت فإذا هو عمر بن الخطاب فقلت ما هي يا أبا حفص قال إنه قال آنفا قبل أن تجيء ‏\"‏ ما منكم من أحد يتوضأ فيحسن الوضوء ثم يقول حين يفرغ من وضوئه أشهد أن لا إله إلا الله وحده لا شريك له وأن محمدا عبده ورسوله إلا فتحت له أبواب الجنة الثمانية يدخل من أيها شاء ‏\"‏ ‏.‏ قال معاوية وحدثني ربيعة بن يزيد عن أبي إدريس عن عقبة بن عامر ‏.‏",
      "text_en": " ‘Uqbah b. ‘Amir said:                      We served ourselves in the company of Messenger of Allah (ﷺ). We tended our camels by turn. One day I had my turn to tend the camels, and I drove them in the afternoon. I found the Messenger of Allah (ﷺ) addressing the people. I heard him say: Anyone amongst you who performs ablution, and does it well, then he stands and offers two rak’ahs of prayer, concentrating on it with his heart and body, Paradise will be his lot by all means. I said: Ha-ha! How fine it is! A man in front of me said: The action (mentioned by the Prophet) earlier, O ‘Uqbah, is finer that this one. I looked at him and found him to be ‘Umar b. al-Khattab. I asked him: What is that, O Abu Hafs? He replied: He (the Prophet) had said before you came: If any one of you performs ablution, and does it well, and when he finishes the ablution, he utters the words : I bear witness that there is no deity except Allah, He has no associate, and I bear witness that Muhammad is His Servant and His Messenger, all the eight doors of Paradise will be opened for him; he may enter (through) any of them. Mu’awiyah said: Rabi’ah b. Yazid narrated this tradition to me from Abu Idris and the authority of  ‘Uqbah b.’Amir.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20029",
        "20675",
        "11113",
        "4097",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-170",
      "hadith_no": "170",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا الحسين بن عيسى، حدثنا عبد الله بن يزيد المقرئ، عن حيوة، - وهو ابن شريح - عن أبي عقيل، عن ابن عمه، عن عقبة بن عامر الجهني، عن النبي صلى الله عليه وسلم نحوه ولم يذكر أمر الرعاية قال عند قوله ‏\"‏ فأحسن الوضوء ‏\"‏ ‏.‏ ثم رفع بصره إلى السماء ‏.‏ فقال وساق الحديث بمعنى حديث معاوية ‏.‏",
      "text_en": " ‘Uqbah b. ‘Amir al-JuhanI narrated this tradition from the Prophet(ﷺ) in a similar way. He did not mention about tending the camels. After the words “and he performed ablution well” he added the words:                      “he then raises his eyes towards the sky”. He transmitted the tradition conveying the same meaning as that of Mu’awiyah.",
      "usc_msa_ref": "",
      "chain": [
        "23033",
        "26010",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-580",
      "hadith_no": "580",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان بن داود المهري، حدثنا ابن وهب، أخبرني يحيى بن أيوب، عن عبد الرحمن بن حرملة، عن أبي علي الهمداني، قال سمعت عقبة بن عامر، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أم الناس فأصاب الوقت فله ولهم ومن انتقص من ذلك شيئا فعليه ولا عليهم ‏\"‏ ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir:                     I heard the Messenger of Allah (ﷺ) say: He who leads the people in prayer, and he does so at the right time, will receive, as well as those who are led (in prayer) will get (the reward). He who delays (prayer) from the appointed time will be responsible (for this delay) and not those who are led in prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30584",
        "20029",
        "20379",
        "11878",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-869",
      "hadith_no": "869",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الربيع بن نافع أبو توبة، وموسى بن إسماعيل، - المعنى - قالا حدثنا ابن المبارك، عن موسى، - قال أبو سلمة موسى بن أيوب - عن عمه، عن عقبة بن عامر، قال لما نزلت ‏{‏ فسبح باسم ربك العظيم ‏}‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ اجعلوها في ركوعكم ‏\"‏ ‏.‏ فلما نزلت ‏{‏ سبح اسم ربك الأعلى ‏}‏ قال ‏\"‏ اجعلوها في سجودكم ‏\"‏ ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir:                     When \"Glorify the name of your mighty Lord\" was revealed, the Messenger of Allah (ﷺ) said: Use it when bowing, and when \"Glorify the name of your most high Lord\" was revealed, he said: Use it when prostrating yourself.",
      "usc_msa_ref": "",
      "chain": [
        "30335",
        "20040",
        "20025",
        "20040",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-870",
      "hadith_no": "870",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا الليث، - يعني ابن سعد - عن أيوب بن موسى، - أو موسى بن أيوب - عن رجل، من قومه عن عقبة بن عامر، بمعناه زاد قال فكان رسول الله صلى الله عليه وسلم إذا ركع قال ‏\"‏ سبحان ربي العظيم وبحمده ‏\"‏ ‏.‏ ثلاثا وإذا سجد قال ‏\"‏ سبحان ربي الأعلى وبحمده ‏\"‏ ‏.‏ ثلاثا ‏.‏ قال أبو داود وهذه الزيادة نخاف أن لا تكون محفوظة ‏.‏ قال أبو داود انفرد أهل مصر بإسناد هذين الحديثين حديث الربيع وحديث أحمد بن يونس ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir:                     The above (No 868) tradition has also been reported through a different chain of narrators by Uqbah ibn Amir to the same effect. This version adds: When the Messenger of Allah (ﷺ) bowed, he said: \"Glory and praise be to my mighty Lord\" three times, and when he prostrated himself, he said: \"Glory and praise be to my most high Lord\" three times.Abu Dawud said: We are afraid the addition of the word \"praise\" is not guarded.",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "20023",
        "11241",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-906",
      "hadith_no": "906",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا زيد بن الحباب، حدثنا معاوية بن صالح، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن جبير بن نفير الحضرمي، عن عقبة بن عامر الجهني، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما من أحد يتوضأ فيحسن الوضوء ويصلي ركعتين يقبل بقلبه ووجهه عليهما إلا وجبت له الجنة ‏\"‏ ‏.‏",
      "text_en": " Uqbah. B Amir al-Juhani reported the Messenger of Allah(ﷺ) as saying:                      Any one performs ablution and performs the ablution perfectly and then offers two rak’ahs of prayers concentrating on them with his heart and face but paradise will necessarily fall to his lot.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20650",
        "20675",
        "11414",
        "11027",
        "4097",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-1203",
      "hadith_no": "1203",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا هارون بن معروف، حدثنا ابن وهب، عن عمرو بن الحارث، أن أبا عشانة المعافري، حدثه عن عقبة بن عامر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ يعجب ربكم من راعي غنم في رأس شظية بجبل يؤذن بالصلاة ويصلي فيقول الله عز وجل انظروا إلى عبدي هذا يؤذن ويقيم الصلاة يخاف مني فقد غفرت لعبدي وأدخلته الجنة ‏\"‏ ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir:                     I heard the Messenger of Allah (ﷺ) say: Allah is pleased with a shepherd of goats who calls to prayer at the peak of a mountain, and offers prayer, Allah, the Exalted, says: Look at this servant of Mine; he calls to prayer and offers it and he fears Me. So I forgive him and admit him to paradise.",
      "usc_msa_ref": "",
      "chain": [
        "30280",
        "20029",
        "20377",
        "16021",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-1333",
      "hadith_no": "1333",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا إسماعيل بن عياش، عن بحير بن سعد، عن خالد بن معدان، عن كثير بن مرة الحضرمي، عن عقبة بن عامر الجهني، قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ الجاهر بالقرآن كالجاهر بالصدقة، والمسر بالقرآن كالمسر بالصدقة ‏\"‏ ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir al-Juhani:                     The Prophet (ﷺ) said: One who recites the Qur'an in a loud voice is like one who gives alms openly; and one who recites the Qur'an quietly is one who gives alms secretly.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20736",
        "11422",
        "19940",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-1402",
      "hadith_no": "1402",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prostration while reciting the Qur'an - كتاب سجود القرآن",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، أخبرنا ابن وهب، أخبرني ابن لهيعة، أن مشرح بن هاعان أبا المصعب، حدثه أن عقبة بن عامر حدثه قال قلت لرسول الله صلى الله عليه وسلم أفي سورة الحج سجدتان قال ‏\"‏ نعم ومن لم يسجدهما فلا يقرأهما ‏\"‏ ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir:                     I said to the Messenger of Allah (ﷺ): Are there two prostrations in Surah al-Hajj? He replied: Yes; if anyone does not make two prostrations, he should not recite them.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "20624",
        "16099",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-1456",
      "hadith_no": "1456",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا سليمان بن داود المهري، حدثنا ابن وهب، حدثنا موسى بن على بن رباح، عن أبيه، عن عقبة بن عامر الجهني، قال خرج علينا رسول الله صلى الله عليه وسلم ونحن في الصفة فقال ‏\"‏ أيكم يحب أن يغدو إلى بطحان أو العقيق فيأخذ ناقتين كوماوين زهراوين بغير إثم بالله عز وجل ولا قطع رحم ‏\"‏ ‏.‏ قالوا كلنا يا رسول الله ‏.‏ قال ‏\"‏ فلأن يغدو أحدكم كل يوم إلى المسجد فيتعلم آيتين من كتاب الله عز وجل خير له من ناقتين وإن ثلاث فثلاث مثل أعدادهن من الإبل ‏\"‏ ‏.‏",
      "text_en": " 'Uqbah b. 'Amir al-Juhani said:                      When we were in the Suffah, the Messenger of Allah (ﷺ) asked: Which of you would like to go out every morning to Buthan or Al-'Aqiq and bring two large humped and fat she-camels without being guilty of sin and severing ties of relationship ? They  (the people) said: Messenger of Allah, we would all like that. He said: If any one of you goes out in the morning to the mosque and learns two verses of the Book of Allah, the Exalted, it is better for him than two she-camels, and three verses are better for him than three she-camels, and so on than their numbers in camels.",
      "usc_msa_ref": "",
      "chain": [
        "30584",
        "20029",
        "20628",
        "10870",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-1462",
      "hadith_no": "1462",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، أخبرنا ابن وهب، أخبرني معاوية، عن العلاء بن الحارث، عن القاسم، مولى معاوية عن عقبة بن عامر، قال كنت أقود برسول الله صلى الله عليه وسلم ناقته في السفر فقال لي ‏\"‏ يا عقبة ألا أعلمك خير سورتين قرئتا ‏\"‏ ‏.‏ فعلمني ‏{‏ قل أعوذ برب الفلق ‏}‏ و ‏{‏ قل أعوذ برب الناس ‏}‏ قال فلم يرني سررت بهما جدا فلما نزل لصلاة الصبح صلى بهما صلاة الصبح للناس فلما فرغ رسول الله صلى الله عليه وسلم من الصلاة التفت إلى فقال ‏\"‏ يا عقبة كيف رأيت ‏\"‏ ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir:                     I was driving the she-camel of the Messenger of Allah (ﷺ) during a journey. He said to me: Uqbah, should I not teach you two best surahs ever recited? He then taught me: \"Say, I seek refuge in the Lord of the dawn,\" and \"Say, I seek refuge in the Lord of men.\" He did not see me much pleased (by these two surahs). When he alighted for prayer, he led the people in the morning prayer and recited them in prayer. When the Messenger of Allah (ﷺ) finished his prayer, he turned to me and said: O Uqbah, how did you see.",
      "usc_msa_ref": "",
      "chain": [
        "30485",
        "20029",
        "27",
        "10884",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-1463",
      "hadith_no": "1463",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا محمد بن سلمة، عن محمد بن إسحاق، عن سعيد بن أبي سعيد المقبري، عن أبيه، عن عقبة بن عامر، قال بينا أنا أسير، مع رسول الله صلى الله عليه وسلم بين الجحفة والأبواء إذ غشيتنا ريح وظلمة شديدة فجعل رسول الله صلى الله عليه وسلم يتعوذ ب ‏{‏ أعوذ برب الفلق ‏}‏ و ‏{‏ أعوذ برب الناس ‏}‏ ويقول ‏\"‏ يا عقبة تعوذ بهما فما تعوذ متعوذ بمثلهما ‏\"‏ ‏.‏ قال وسمعته يؤمنا بهما في الصلاة ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir:                     White I was travelling with the Messenger of Allah (ﷺ) between al-Juhfah and al-Abwa', a wind and intense darkness enveloped us, whereupon the Messenger of Allah (ﷺ) began to seek refuge in Allah, reciting: \"I seek  refuge in the Lord of the dawn,\" and \"I seek refuge in the Lord of men.\" He then said: Uqbah, use them when seeking refuge in Allah, for no one can use anything to compare with them for the purpose. Uqbah added: I heard him reciting them when he led the people in prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20672",
        "11107",
        "11168",
        "11212",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-1523",
      "hadith_no": "1523",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن سلمة المرادي، حدثنا ابن وهب، عن الليث بن سعد، أن حنين بن أبي حكيم، حدثه عن على بن رباح اللخمي، عن عقبة بن عامر، قال أمرني رسول الله صلى الله عليه وسلم أن أقرأ بالمعوذات دبر كل صلاة ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir:                     The Messenger of Allah (ﷺ) commanded me to recite Mu'awwidhatan (the last two surahs of the Qur'an) after every prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30491",
        "20029",
        "20023",
        "18233",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-2117",
      "hadith_no": "2117",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن يحيى بن فارس الذهلي، ومحمد بن المثنى، وعمر بن الخطاب، - قال محمد - حدثنا أبو الأصبغ الجزري عبد العزيز بن يحيى، أخبرنا محمد بن سلمة، عن أبي عبد الرحيم، خالد بن أبي يزيد عن زيد بن أبي أنيسة، عن يزيد بن أبي حبيب، عن مرثد بن عبد الله، عن عقبة بن عامر، أن النبي صلى الله عليه وسلم قال لرجل ‏\"‏ أترضى أن أزوجك فلانة ‏\"‏ ‏.‏ قال نعم ‏.‏ وقال للمرأة ‏\"‏ أترضين أن أزوجك فلانا ‏\"‏ ‏.‏ قالت نعم ‏.‏ فزوج أحدهما صاحبه فدخل بها الرجل ولم يفرض لها صداقا ولم يعطها شيئا وكان ممن شهد الحديبية وكان من شهد الحديبية له سهم بخيبر فلما حضرته الوفاة قال إن رسول الله صلى الله عليه وسلم زوجني فلانة ولم أفرض لها صداقا ولم أعطها شيئا وإني أشهدكم أني أعطيتها من صداقها سهمي بخيبر فأخذت سهما فباعته بمائة ألف ‏.‏ قال أبو داود وزاد عمر بن الخطاب - وحديثه أتم - في أول الحديث قال رسول الله صلى الله عليه وسلم ‏\"‏ خير النكاح أيسره ‏\"‏ ‏.‏ وقال قال رسول الله صلى الله عليه وسلم للرجل ثم ساق معناه ‏.‏ قال أبو داود يخاف أن يكون هذا الحديث ملزقا لأن الأمر على غير هذا ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir:                     The Prophet (ﷺ) said to a man: Would you like me to marry you to so-and-so?  He said: Yes.  He also said to the woman: Would you like me to marry you to so-and-so?  She said: Yes. He then married one to the other. The man had sexual intercourse with her, but he did not fix any dower for her, nor did he give anything to her. He was one of those who participated in the expedition to al-Hudaybiyyah. One part of the expedition to al-Hudaybiyyah had a share in Khaybar.  When he was nearing his death, he said: The Messenger of Allah (ﷺ) married me to so-and-so, and I did not fix a dower for her, nor did I give anything to her. I call upon you as witness that I have given my share in Khaybar as her dower. So she took the share and sold it for one lakh (of dirhams).Abu Dawud said: The version of 'Umar b. al-Khattab added in the beginning of this tradition, and his version is more perfect. He reported the Messenger of Allah (ﷺ) as saying: The best marriage is the one that is most easy. The Messenger of Allah (ﷺ) said to the man. The narrator then transmitted the rest of the tradition to the same effect.Abu Dawud said: I am afraid this tradition has been added later on, for the matter is otherwise.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30170",
        "3",
        "20278",
        "20672",
        "11340",
        "11411",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-2139",
      "hadith_no": "2139",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عيسى بن حماد، أخبرني الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ إن أحق الشروط أن توفوا به ما استحللتم به الفروج ‏\"‏ ‏.‏",
      "text_en": " ‘Uqbah bin ‘Amir reported the Apostle of Allaah(ﷺ) as saying “The condition worthier to be  fulfilled by you is the one by which you made the private parts (of your wife) lawful(for you).",
      "usc_msa_ref": "",
      "chain": [
        "30412",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-2419",
      "hadith_no": "2419",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا الحسن بن علي، حدثنا وهب، حدثنا موسى بن على، ح وحدثنا عثمان بن أبي شيبة، حدثنا وكيع، عن موسى بن على، - والإخبار في حديث وهب - قال سمعت أبي أنه، سمع عقبة بن عامر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يوم عرفة ويوم النحر وأيام التشريق عيدنا أهل الإسلام وهي أيام أكل وشرب ‏\"‏ ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir:                     The Prophet (ﷺ) said: The day of Arafah, the day of sacrifice, the days of tashriq are (the days of) our festival, O people of Islam. These are the days of eating and drinking.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20298",
        "30203",
        "20032",
        "20645",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-2513",
      "hadith_no": "2513",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا عبد الله بن المبارك، حدثني عبد الرحمن بن يزيد بن جابر، حدثني أبو سلام، عن خالد بن زيد، عن عقبة بن عامر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏:‏ ‏\"‏ إن الله عز وجل يدخل بالسهم الواحد ثلاثة نفر الجنة ‏:‏ صانعه يحتسب في صنعته الخير، والرامي به، ومنبله، وارموا واركبوا، وأن ترموا أحب إلى من أن تركبوا، ليس من اللهو إلا ثلاث ‏:‏ تأديب الرجل فرسه وملاعبته أهله ورميه بقوسه ونبله، ومن ترك الرمى بعد ما علمه رغبة عنه فإنها نعمة تركها ‏\"‏ ‏.‏ أو قال ‏:‏ ‏\"‏ كفرها ‏\"‏ ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir:                     I heard the Messenger of Allah (ﷺ) say: Allah, Most High, will cause three persons to enter Paradise for one arrow: the maker when he has a good motive in making it, the one who shoots it, and the one who hands it; so shoot and ride, but your shooting is dearer to me than your riding. Everything with which a man amuses himself is vain except three (things): a man's training of his horse, his playing with his wife, and his shooting with his bow and arrow. If anyone abandons archery after becoming an adept through distaste for it, it is a blessing he has abandoned; or he said: for which he has been ungrateful.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20025",
        "20395",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-2514",
      "hadith_no": "2514",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا عبد الله بن وهب، أخبرني عمرو بن الحارث، عن أبي علي، ‏:‏ ثمامة بن شفى الهمداني أنه سمع عقبة بن عامر الجهني، يقول سمعت رسول الله صلى الله عليه وسلم وهو على المنبر يقول ‏:‏ ‏\"‏ ‏{‏ وأعدوا لهم ما استطعتم من قوة ‏}‏ ألا إن القوة الرمى، ألا إن القوة الرمى، ألا إن القوة الرمى ‏\"‏ ‏.‏",
      "text_en": " ‘Uqabah bin Amir Al Juhani said “I heard the Apostle of Allaah(ﷺ) recite when he was on the pulpit “Against them make ready your strength to the utmost of your power. Beware, strength is shooting, beware strength is shooting, beware strength is shooting.”",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20029",
        "20377",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-2937",
      "hadith_no": "2937",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا محمد بن سلمة، عن محمد بن إسحاق، عن يزيد بن أبي حبيب، عن عبد الرحمن بن شماسة، عن عقبة بن عامر، قال سمعت رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يدخل الجنة صاحب مكس ‏\"‏ ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir:                     I heard the Messenger of Allah (ﷺ) as saying: One who wrongfully takes an extra tax (sahib maks) will not enter Paradise.",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20672",
        "11107",
        "11411",
        "10867",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-3192",
      "hadith_no": "3192",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا وكيع، حدثنا موسى بن على بن رباح، قال سمعت أبي يحدث، أنه سمع عقبة بن عامر، قال ثلاث ساعات كان رسول الله صلى الله عليه وسلم ينهانا أن نصلي فيهن أو نقبر فيهن موتانا حين تطلع الشمس بازغة حتى ترتفع وحين يقوم قائم الظهيرة حتى تميل وحين تضيف الشمس للغروب حتى تغرب أو كما قال ‏.‏",
      "text_en": " Narrated 'Uqbah bin 'Amir:                     There were three times at which the Messenger of Allah (ﷺ) used to forbid us to pray or bury our dead - when the sun begins to rise till it is fully up, when the sun is at its height midway till it passes the meridian, and when the sun draws near to setting till it sets, or as he said.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20032",
        "20645",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-3223",
      "hadith_no": "3223",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أن رسول الله صلى الله عليه وسلم خرج يوما فصلى على أهل أحد صلاته على الميت ثم انصرف ‏.‏",
      "text_en": " Narrated 'Uqbah bin 'Amir:                     One day the Messenger of Allah (ﷺ) went out and prayed over the martyrs of Uhud like his prayer over the dead, and then returned.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-3293",
      "hadith_no": "3293",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا مسدد، حدثنا يحيى بن سعيد القطان، قال أخبرني يحيى بن سعيد الأنصاري، أخبرني عبيد الله بن زحر، أن أبا سعيد، أخبره أن عبد الله بن مالك أخبره أن عقبة بن عامر أخبره ‏:‏ أنه، سأل النبي صلى الله عليه وسلم عن أخت له نذرت أن تحج حافية غير مختمرة فقال ‏:‏ ‏\"‏ مروها فلتختمر ولتركب، ولتصم ثلاثة أيام ‏\"‏ ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir:                     Uqbah consulted the Prophet (ﷺ) about his sister who took a vow to perform hajj barefooted and bareheaded. So he said: Command her to cover her head and to ride, and to fast three days.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "11062",
        "19927",
        "38",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-3299",
      "hadith_no": "3299",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا مخلد بن خالد، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني سعيد بن أبي أيوب، أن يزيد بن أبي حبيب، أخبره أن أبا الخير حدثه عن عقبة بن عامر الجهني، قال ‏:‏ نذرت أختي أن تمشي، إلى بيت الله، فأمرتني أن أستفتي لها رسول الله صلى الله عليه وسلم فاستفتيت النبي صلى الله عليه وسلم فقال ‏:‏ ‏\"‏ لتمش ولتركب ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Uqbah bin 'Amir al-Juhani:                     My sister took a vow to walk on foot to the House of Allah (i.e. Ka'bah). She asked me to consult the Prophet (ﷺ) about her. So I consulted the Prophet (ﷺ). He said: Let her walk and ride.",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "20121",
        "11070",
        "20375",
        "11411",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-3304",
      "hadith_no": "3304",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا شعيب بن أيوب، حدثنا معاوية بن هشام، عن سفيان، عن أبيه، عن عكرمة، عن عقبة بن عامر الجهني، أنه قال للنبي صلى الله عليه وسلم ‏:‏ إن أختي نذرت أن تمشي إلى البيت ‏.‏ فقال ‏:‏ ‏\"‏ إن الله لا يصنع بمشى أختك إلى البيت شيئا ‏\"‏ ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir al-Juhani:                     Uqbah said to the Prophet (ﷺ): My sister has taken a vow that she will walk to the House of Allah (the Ka'bah). Thereupon he said: Allah will not do anything of the walking of your sister to the House of Allah (i.e. the Ka'bah).",
      "usc_msa_ref": "",
      "chain": [
        "20609",
        "20012",
        "20016",
        "11023",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-3323",
      "hadith_no": "3323",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا هارون بن عباد الأزدي، حدثنا أبو بكر، - يعني ابن عياش - عن محمد، مولى المغيرة قال حدثني كعب بن علقمة، عن أبي الخير، عن عقبة بن عامر، قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ كفارة النذر كفارة اليمين ‏\"‏ ‏.‏ قال أبو داود ‏:‏ ورواه عمرو بن الحارث عن كعب بن علقمة عن ابن شماسة عن عقبة ‏.‏",
      "text_en": " Narrated 'Uqbah bin 'Amir:                     The Messenger of Allah (ﷺ) as saying: The atonement for a vow is the same as for an oath.Abu Dawud said: This tradition has also been transmitted by 'Amr b. al-Harith from Ka'b b. 'Alqamah, from Ibn Shamasah on the authority of 'Uqbah.",
      "usc_msa_ref": "",
      "chain": [
        "20373",
        "10872",
        "11410",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-3324",
      "hadith_no": "3324",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن عوف، أن سعيد بن الحكم، حدثهم أخبرنا يحيى بن أيوب، حدثني كعب بن علقمة، أنه سمع ابن شماسة، عن أبي الخير، عن عقبة بن عامر، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " A similar tradition has also been transmitted by 'Uqbah b. 'Amir from the Prophet (ﷺ) through a different chain of narrators.",
      "usc_msa_ref": "",
      "chain": [
        "38566",
        "30232",
        "20379",
        "10872",
        "11410",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-3506",
      "hadith_no": "3506",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا أبان، عن قتادة، عن الحسن، عن عقبة بن عامر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ عهدة الرقيق ثلاثة أيام ‏\"‏ ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir:                     The Prophet (ﷺ) said: The contractual obligation of a slave is three days.",
      "usc_msa_ref": "",
      "chain": [
        "20285",
        "20205",
        "11019",
        "11016",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-3752",
      "hadith_no": "3752",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أنه قال قلنا يا رسول الله إنك تبعثنا فننزل بقوم فما يقروننا فما ترى فقال لنا رسول الله ‏\"‏ إن نزلتم بقوم فأمروا لكم بما ينبغي للضيف فاقبلوا فإن لم يفعلوا فخذوا منهم حق الضيف الذي ينبغي لهم ‏\"‏ ‏.‏ قال أبو داود وهذه حجة للرجل يأخذ الشىء إذا كان له حقا ‏.‏",
      "text_en": " ‘Uqbah b. ‘Amir said:                      we said: Messenger of Allah! You send us out and we come to people who do not give hospitality, so what is your opinion? The Messenger of Allah(ﷺ) said: If you come to people who order for you what is fitting for a guest, accept it; but if they do not, take from them what is fitting for them to give to a guest.Abu Dawud said: And this is an authority for a man to take a thing if it is due to him.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-4891",
      "hadith_no": "4891",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا عبد الله بن المبارك، عن إبراهيم بن نشيط، عن كعب بن علقمة، عن أبي الهيثم، عن عقبة بن عامر، عن النبي صلى الله عليه وسلم قال ‏\"‏ من رأى عورة فسترها كان كمن أحيا موءودة ‏\"‏ ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir:                     The Prophet (ﷺ) said: He who sees something which should be kept hidden and conceals it will be like one who has brought to life a girl buried alive.",
      "usc_msa_ref": "",
      "chain": [
        "20285",
        "20025",
        "16000",
        "10872",
        "189"
      ]
    },
    {
      "id": "jami-al-tirmidhi-578",
      "hadith_no": "578",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا قتيبة، حدثنا ابن لهيعة، عن مشرح بن هاعان، عن عقبة بن عامر، قال قلت يا رسول الله فضلت سورة الحج بأن فيها سجدتين قال ‏\"‏ نعم ومن لم يسجدهما فلا يقرأهما ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث ليس إسناده بذاك القوي ‏.‏ واختلف أهل العلم في هذا فروي عن عمر بن الخطاب وابن عمر أنهما قالا فضلت سورة الحج بأن فيها سجدتين ‏.‏ وبه يقول ابن المبارك والشافعي وأحمد وإسحاق ‏.‏ ورأى بعضهم فيها سجدة وهو قول سفيان الثوري ومالك وأهل الكوفة ‏.‏",
      "text_en": " Uqbah bin Amir narrated:                     \"I said: 'O Messenger of Allah! Surah Al-Hajj has been esteemed by two prostrations?' He said: 'Yes, and whoever does not prostrate for them, he should not recite them.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20624",
        "16099",
        "189"
      ]
    },
    {
      "id": "jami-al-tirmidhi-773",
      "hadith_no": "773",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن موسى بن على، عن أبيه، عن عقبة بن عامر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يوم عرفة ويوم النحر وأيام التشريق عيدنا أهل الإسلام وهي أيام أكل وشرب ‏\"‏ ‏.‏ قال وفي الباب عن علي وسعد وأبي هريرة وجابر ونبيشة وبشر بن سحيم وعبد الله بن حذافة وأنس وحمزة بن عمرو الأسلمي وكعب بن مالك وعائشة وعمرو بن العاص وعبد الله بن عمرو ‏.‏ قال أبو عيسى وحديث عقبة بن عامر حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم يكرهون الصيام أيام التشريق إلا أن قوما من أصحاب النبي صلى الله عليه وسلم وغيرهم رخصوا للمتمتع إذا لم يجد هديا ولم يصم في العشر أن يصوم أيام التشريق ‏.‏ وبه يقول مالك بن أنس والشافعي وأحمد وإسحاق ‏.‏ قال أبو عيسى وأهل العراق يقولون موسى بن علي بن رباح وأهل مصر يقولون موسى بن على ‏.‏ وقال سمعت قتيبة يقول سمعت الليث بن سعد يقول قال موسى بن علي لا أجعل أحدا في حل صغر اسم أبي ‏.‏",
      "text_en": " Uqbah bin Amir narrated that :                     The Messenger of Allah said: \"The Day of Arafah, the Day of Nahr, and the Days of Tashriq are Eid for us. The people of Islam, and they are days of eating and drinking,\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20032",
        "20645",
        "189"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1030",
      "hadith_no": "1030",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن موسى بن على بن رباح، عن أبيه، عن عقبة بن عامر الجهني، قال ثلاث ساعات كان رسول الله صلى الله عليه وسلم ينهانا أن نصلي فيهن أو نقبر فيهن موتانا حين تطلع الشمس بازغة حتى ترتفع وحين يقوم قائم الظهيرة حتى تميل وحين تضيف الشمس للغروب حتى تغرب ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم يكرهون الصلاة على الجنازة في هذه الساعات ‏.‏ وقال ابن المبارك معنى هذا الحديث أن نقبر فيهن موتانا ‏.‏ يعني الصلاة على الجنازة ‏.‏ وكره الصلاة على الجنازة عند طلوع الشمس وعند غروبها وإذا انتصف النهار حتى تزول الشمس ‏.‏ وهو قول أحمد وإسحاق ‏.‏ قال الشافعي لا بأس بالصلاة على الجنازة في الساعات التي تكره فيهن الصلاة ‏.‏",
      "text_en": " Uqbah bin Amir Al-Juhni narrated:                     \"There are three times that the Messenger of Allah prohibited us from performing Salat in, burying our dead in: When the sun's rising appears until it has risen up; when the sun is at the zenith until it passes, and when the sun begins its setting, until it has set.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20032",
        "20645",
        "189"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1127",
      "hadith_no": "1127",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا يوسف بن عيسى، حدثنا وكيع، حدثنا عبد الحميد بن جعفر، عن يزيد بن أبي حبيب، عن مرثد بن عبد الله اليزني أبي الخير، عن عقبة بن عامر الجهني، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أحق الشروط أن يوفى بها ما استحللتم به الفروج ‏\"‏ ‏.‏ حدثنا أبو موسى، محمد بن المثنى حدثنا يحيى بن سعيد، عن عبد الحميد بن جعفر، نحوه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم منهم عمر بن الخطاب قال إذا تزوج رجل امرأة وشرط لها أن لا يخرجها من مصرها فليس له أن يخرجها ‏.‏ وهو قول بعض أهل العلم وبه يقول الشافعي وأحمد وإسحاق ‏.‏ وروي عن علي بن أبي طالب أنه قال شرط الله قبل شرطها ‏.‏ كأنه رأى للزوج أن يخرجها وإن كانت اشترطت على زوجها أن لا يخرجها ‏.‏ وذهب بعض أهل العلم إلى هذا وهو قول سفيان الثوري وبعض أهل الكوفة ‏.‏",
      "text_en": " Uqbah bin Amir Al-Juhani narrated that:                     The Messenger of Allah said: \"Indeed the conditions most deserving to be fulfilled are those that make the private parts lawful among you.\"",
      "usc_msa_ref": "",
      "chain": [
        "30401",
        "20032",
        "11875",
        "11411",
        "189"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1204",
      "hadith_no": "1204",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Suckling - كتاب الرضاع",
      "chapter_no": "12",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إياكم والدخول على النساء ‏\"‏ ‏.‏ فقال رجل من الأنصار يا رسول الله أفرأيت الحمو قال ‏\"‏ الحمو الموت ‏\"‏ ‏.‏ قال وفي الباب عن عمر وجابر وعمرو بن العاص ‏.‏ قال أبو عيسى حديث عقبة بن عامر حديث حسن صحيح ‏.‏ وإنما معنى كراهية الدخول على النساء على نحو ما روي عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يخلون رجل بامرأة إلا كان ثالثهما الشيطان ‏\"‏ ‏.‏ ومعنى قوله ‏\"‏ الحمو ‏\"‏ ‏.‏ يقال هو أخو الزوج كأنه كره له أن يخلو بها ‏.‏",
      "text_en": " Uqbah bin Amir narrated that The Messenger of Allah said:                      “Beware of entering upon women.” So a man from the Ansar said: ‘”O Messenger of Allah! What do you think about Hamu? So he said: “The Hamu is death.”",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1500",
      "hadith_no": "1500",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أن رسول الله صلى الله عليه وسلم أعطاه غنما يقسمها على أصحابه ضحايا فبقي عتود أو جدى فذكرت ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ ضح به أنت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال وكيع الجذع من الضأن يكون ابن ستة أو سبعة أشهر ‏.‏",
      "text_en": " Narrated 'Uqbah bin 'Amir:                     That the Messenger of Allah (ﷺ) gave him sheep to distribute among his Companions as a sacrifice. \"There remained a young male kid or a young billy goat, so I mentioned that to the Messenger of Allah (ﷺ) and he said: 'Sacrifice it for yourself.'\"Waki' said: \"The Jadha' among sheep is seven or six months.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1500-2",
      "hadith_no": "1500",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "وقد روي من، غير هذا الوجه عن عقبة بن عامر، أنه قال قسم رسول الله صلى الله عليه وسلم ضحايا فبقي جذعة فسألت النبي صلى الله عليه وسلم فقال ‏\"‏ ضح بها أنت ‏\"‏ ‏.‏ حدثنا بذلك محمد بن بشار حدثنا يزيد بن هارون وأبو داود قالا حدثنا هشام الدستوائي عن يحيى بن أبي كثير عن بعجة بن عبد الله بن بدر عن عقبة بن عامر عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏",
      "text_en": " It has been reported that 'Uqbah bin Amir said:                      \"The Prophet (ﷺ) distributed the sacrificial animals and I was left with a Jadha', so I asked the Prophet (ﷺ) about it and he said: 'Sacrifice it for yourself.'\"(Another chain) with this Hadith.",
      "usc_msa_ref": "",
      "chain": [
        "189"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1528",
      "hadith_no": "1528",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Vows and Oaths - كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو بكر بن عياش، حدثني محمد، مولى المغيرة بن شعبة حدثني كعب بن علقمة، عن أبي الخير، عن عقبة بن عامر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كفارة النذر إذا لم يسم كفارة يمين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated 'Uqbah bin 'Amir:                     That the Messenger of Allah (ﷺ) said: \"The atonement of a vow when it is not specified is the atonement of an oath.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20373",
        "10872",
        "11410",
        "189"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1544",
      "hadith_no": "1544",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Vows and Oaths - كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "20",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا وكيع، عن سفيان، عن يحيى بن سعيد، عن عبيد الله بن زحر، عن أبي سعيد الرعيني، عن عبد الله بن مالك اليحصبي، عن عقبة بن عامر، قال قلت يا رسول الله إن أختي نذرت أن تمشي إلى البيت حافية غير مختمرة ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن الله لا يصنع بشقاء أختك شيئا فلتركب ولتختمر ولتصم ثلاثة أيام ‏\"‏ ‏.‏ قال وفي الباب عن ابن عباس ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ والعمل على هذا عند أهل العلم وهو قول أحمد وإسحاق ‏.‏",
      "text_en": " Narrated 'Uqbah bin 'Amir:                     \"I said: 'O Messenger of Allah! My sister vowed that she would walk to the House barefoot and without Khimar (covering).' The Prophet (ﷺ) said: 'Verily Allah will not do anything with the misery of your sister. She should ride, and cover, and fast three days.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20032",
        "20012",
        "11062",
        "19927",
        "189"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1589",
      "hadith_no": "1589",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا قتيبة، حدثنا ابن لهيعة، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، قال قلت يا رسول الله إنا نمر بقوم فلا هم يضيفونا ولا هم يؤدون ما لنا عليهم من الحق ولا نحن نأخذ منهم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن أبوا إلا أن تأخذوا كرها فخذوا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد رواه الليث بن سعد عن يزيد بن أبي حبيب أيضا ‏.‏ وإنما معنى هذا الحديث أنهم كانوا يخرجون في الغزو فيمرون بقوم ولا يجدون من الطعام ما يشترون بالثمن فقال النبي صلى الله عليه وسلم ‏\"‏ إن أبوا أن يبيعوا إلا أن تأخذوا كرها فخذوا ‏\"‏ ‏.‏ هكذا روي في بعض الحديث مفسرا وقد روي عن عمر بن الخطاب رضى الله عنه أنه كان يأمر بنحو هذا ‏.‏",
      "text_en": " Narrated 'Uqbah bin 'Amir:                     \"I said: 'O Messenger of Allah! We come across a people and they do not host us, and they do not give us our rights, and we do not take anything from them. So the Messenger of Allah (ﷺ) said: 'If they refuse such that you can only take by force, then take.'\"[Abu 'Eisa said:] This Hadith is Hasan. It has been reported by Al-Laith bin Sa'd from Yazid bin Abi Habib as well.This Hadith only means that they would go out for battles and they would pass a people among whom they would not find any food to buy for a price. So the Prophet (ﷺ) told them: If they refuse to sell you, such that you have to take it forcefully, then take it. This is how the explanation has been related in some of the Ahadith. And it has been related that 'Umar bin Al-Khattab, may Allah be please with him, would order similarly.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20624",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1637-2",
      "hadith_no": "1637",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يزيد بن هارون، أخبرنا هشام الدستوائي، عن يحيى بن أبي كثير، عن أبي سلام، عن عبد الله بن الأزرق، عن عقبة بن عامر الجهني، عن النبي صلى الله عليه وسلم مثله ‏.‏ قال أبو عيسى وفي الباب عن كعب بن مرة وعمرو بن عبسة وعبد الله بن عمرو ‏.‏ وهذا حديث حسن ‏.‏",
      "text_en": " Another chain from 'Abdullah bin Al-Azraq, from 'Uqbah bin 'Amir [Al-Juhani] from the Prophet (ﷺ) with similar meaning.[Abu 'Eisa said:                     ] There are narrations on this topic from Ka'b bin Murrah, 'Amr bin 'Abasah, and 'Abdullah bin 'Amr. This Hadith is Hasan Sahih.",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20472",
        "20295",
        "11449",
        "189"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2175",
      "hadith_no": "2175",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو كريب، حدثنا بكر بن يونس بن بكير، عن موسى بن علي، عن أبيه، عن عقبة بن عامر الجهني، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تكرهوا مرضاكم على الطعام فإن الله يطعمهم ويسقيهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Uqbah bin Amir Al-Juhani narrated that the Messenger of Allah (s.a.w) said:                     \"Do not force your sick to eat, for indeed Allah, Blessed and Most High, provides them food and drink.\"(Dai'f)",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20628",
        "10870",
        "189"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2187",
      "hadith_no": "2187",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا عبد القدوس بن محمد، حدثنا عمرو بن عاصم، حدثنا همام، عن قتادة، عن الحسن، عن عمران بن حصين، قال نهينا عن الكى، ‏.‏ قال أبو عيسى وفي الباب عن ابن مسعود، وعقبة بن عامر، وابن، عباس ‏.‏ وهذا حديث حسن صحيح ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30148",
        "20267",
        "20297",
        "11019",
        "11016",
        "123",
        "16",
        "189"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2406",
      "hadith_no": "2406",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا صالح بن عبد الله، حدثنا عبد الله بن المبارك، ح وحدثنا سويد بن نصر، أخبرنا ابن المبارك، عن يحيى بن أيوب، عن عبيد الله بن زحر، عن علي بن يزيد، عن القاسم، عن أبي أمامة، عن عقبة بن عامر، قال قلت يا رسول الله ما النجاة قال ‏\"‏ أمسك عليك لسانك وليسعك بيتك وابك على خطيئتك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " 'Uqbah bin 'Amir narrated:                      \"I said: 'O Messenger of Allah! What is the means to salvation?' He said:'That you control your tongue, suffice yourself your house, and cry over your sins.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20025",
        "38265",
        "20025",
        "20379",
        "19927",
        "10535",
        "405",
        "189"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3149",
      "hadith_no": "3149",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا إسماعيل بن أبي خالد، أخبرني قيس بن أبي حازم، عن عقبة بن عامر الجهني، عن النبي صلى الله عليه وسلم قال ‏\"‏ قد أنزل الله على آيات لم ير مثلهن ‏(‏قل أعوذ برب الناس ‏)‏ إلى آخر السورة و ‏(‏قل أعوذ برب الفلق ‏)‏ إلى آخر السورة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو حازم أبو قيس بن أبي حازم يسمى عبد عوف وقد رأى النبي وروى عنه ‏.‏",
      "text_en": " Narrated 'Uqbah bin 'Amir Al-Juhani:                     that the Prophet (ﷺ) said: \"Some Ayat have been revealed to me the likes of which have not been seen: Qul A'udhu Birabbin-Nas until the end of the Surah and Qul A'udhu Birabbil-Falaq until the end of the Surah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "11418",
        "11046",
        "189"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3150",
      "hadith_no": "3150",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا قتيبة، حدثنا ابن لهيعة، عن يزيد بن أبي حبيب، عن على بن رباح، عن عقبة بن عامر، قال أمرني رسول الله صلى الله عليه وسلم أن أقرأ بالمعوذتين في دبر كل صلاة ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated 'Uqbah bin 'Amir:                     \"The Messenger of Allah (ﷺ) ordered me to recite Al-Mu'awwidhatain at the end of every Salat.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20624",
        "11411",
        "189"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3169",
      "hadith_no": "3169",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا الحسن بن عرفة، حدثنا إسماعيل بن عياش، عن بحير بن سعد، عن خالد بن معدان، عن كثير بن مرة الحضرمي، عن عقبة بن عامر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الجاهر بالقرآن كالجاهر بالصدقة والمسر بالقرآن كالمسر بالصدقة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ ومعنى هذا الحديث أن الذي يسر بقراءة القرآن أفضل من الذي يجهر بقراءة القرآن لأن صدقة السر أفضل عند أهل العلم من صدقة العلانية وإنما معنى هذا عند أهل العلم لكى يأمن الرجل من العجب لأن الذي يسر العمل لا يخاف عليه العجب ما يخاف عليه من علانيته ‏.‏",
      "text_en": " Narrated 'Uqbah bin 'Amir:                     that the Messenger of Allah (ﷺ) said: \"The one who recites the Qur'an aloud is like the one who gives charity publicly, and the one who recites the Qur'an quietly is like the one who gives charity secretly.\"",
      "usc_msa_ref": "",
      "chain": [
        "36540",
        "20736",
        "11422",
        "19940",
        "189"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3363",
      "hadith_no": "3363",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا وكيع، عن أسامة بن زيد، عن صالح بن كيسان، عن رجل، لم يسمه عن عقبة بن عامر، أن رسول الله صلى الله عليه وسلم قرأ هذه الآية على المنبر ‏:‏ ‏(‏ وأعدوا لهم ما استطعتم من قوة ‏)‏ قال ‏\"‏ ألا إن القوة الرمى ثلاث مرات ألا إن الله سيفتح لكم الأرض وستكفون المؤنة فلا يعجزن أحدكم أن يلهو بأسهمه ‏\"‏ ‏.‏ قال أبو عيسى وقد روى بعضهم هذا الحديث عن أسامة بن زيد عن صالح بن كيسان عن عقبة بن عامر رواه أبو أسامة وغير واحد وحديث وكيع أصح ‏.‏ وصالح بن كيسان لم يدرك عقبة بن عامر وقد أدرك ابن عمر ‏.‏",
      "text_en": " Narrated 'Uqbah bin 'Amir:                     that the Messenger of Allah (ﷺ) recited this Ayah upon the Minbar: And make ready against them all you can of power (8:60). He said: \"Verily! Power is shooting\" - three times - \"Verily! Allah will open the earth for you and suffice you with supplies, so let none of you forsake practicing with his arrows.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20032",
        "50",
        "11176",
        "189"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3693",
      "hadith_no": "3693",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، عن إسماعيل بن أبي خالد، حدثني قيس، وهو ابن أبي حازم عن عقبة بن عامر الجهني، عن النبي صلى الله عليه وسلم قال ‏\"‏ قد أنزل الله على آيات لم ير مثلهن ‏:‏ ‏(‏ قل أعوذ برب الناس ‏)‏ إلى آخر السورة و ‏:‏ ‏(‏قل أعوذ برب الفلق ‏)‏ إلى آخر السورة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Uqbah bin Amir Al-Juhni narrated that:                     the Prophet said: “Allah has revealed to me Ayat the likes of which have not been seen: “Say: I seek refuge in the Lord of mankind…” until the end of the Surat. “Say: I seek refuge in the Lord of Al-Falaq…” until the end of the Surat.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "11418",
        "11046",
        "20165",
        "189"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4050",
      "hadith_no": "4050",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا سلمة بن شبيب، حدثنا المقرئ، عن حيوة بن شريح، عن بكر بن عمرو، عن مشرح بن هاعان، عن عقبة بن عامر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لو كان بعدي نبي لكان عمر بن الخطاب ‏\"‏ ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من حديث مشرح بن هاعان ‏.‏",
      "text_en": " Narrated 'Uqbah bin 'Amir:                     that the Messenger of Allah (ﷺ) said: \"If there was to have a Prophet after me, it would have been 'Umar bin Al-Khattab.\"",
      "usc_msa_ref": "",
      "chain": [
        "30417",
        "26010",
        "10850",
        "16099",
        "189"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4215",
      "hadith_no": "4215",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة، حدثنا ابن لهيعة، عن مشرح بن هاعان، عن عقبة بن عامر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أسلم الناس وآمن عمرو بن العاصي ‏\"‏ ‏.‏ قال هذا حديث غريب لا نعرفه إلا من حديث ابن لهيعة عن مشرح بن هاعان وليس إسناده بالقوي ‏.‏",
      "text_en": " Narrated 'Uqbah bin 'Amir:                     that the Messenger of Allah (ﷺ) said: \"The people submitted while 'Amr bin Al-'As believed.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20624",
        "16099",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-149",
      "hadith_no": "149",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن علي بن حرب المروزي، قال حدثنا زيد بن الحباب، قال حدثنا معاوية بن صالح، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، وأبي، عثمان عن عقبة بن عامر الجهني، عن عمر بن الخطاب، - رضى الله عنه - قال قال رسول الله ‏\"‏ من توضأ فأحسن الوضوء ثم قال أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله فتحت له ثمانية أبواب الجنة يدخل من أيها شاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Umar bin Al-Khattab said:                      \"The Messenger of Allah (ﷺ) said: 'Whoever performs Wudu' and does it well, then says: \"Ashhadu an la ilaha ill-Allah was ashhadu anna Muhammadan 'abduhu wa rasuluh (I bear witness that there is none worthy of worship except Allah, and I bear witness that Muhammad is his slave and Messenger),\" eight gates of Paradise will be opened for him, and he may enter through whichever one he wishes.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38553",
        "20650",
        "20675",
        "11414",
        "11027",
        "11113",
        "189",
        "3"
      ]
    },
    {
      "id": "sunan-an-nasai-152",
      "hadith_no": "152",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا موسى بن عبد الرحمن المسروقي، قال حدثنا زيد بن الحباب، قال حدثنا معاوية بن صالح، قال حدثنا ربيعة بن يزيد الدمشقي، عن أبي إدريس الخولاني، وأبي، عثمان عن جبير بن نفير الحضرمي، عن عقبة بن عامر الجهني، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من توضأ فأحسن الوضوء ثم صلى ركعتين يقبل عليهما بقلبه ووجهه وجبت له الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin 'Amir Al-Juhani said:                      \"The Messenger of Allah (ﷺ) said: 'Whoever performs Wudu' and does it well, then prays two Rak'ahs in which his heart and face are focused, Paradise will be his.\"",
      "usc_msa_ref": "",
      "chain": [
        "35153",
        "20650",
        "20675",
        "11414",
        "11027",
        "11113",
        "4097",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-565",
      "hadith_no": "565",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا سويد بن نصر، قال حدثنا عبد الله، عن موسى بن علي بن رباح، قال سمعت أبي يقول، سمعت عقبة بن عامر الجهني، يقول ثلاث ساعات كان رسول الله صلى الله عليه وسلم ينهانا أن نصلي فيهن أو نقبر فيهن موتانا حين تطلع الشمس بازغة حتى ترتفع وحين يقوم قائم الظهيرة حتى تميل وحين تضيف الشمس للغروب حتى تغرب ‏.‏",
      "text_en": " It was narrated that Musa bin 'Ali bin Rabah said:                      \"I heard my father say: 'I heard 'Uqbah bin 'Amir Al-Juhani say: There are three times during which the Messenger of Allah (ﷺ) forbade us to pray in or bury our dead: When the sun has clearly stated to rise, until it is fully risen; when it is directly overhead at noon, until it has passed its zenith; and when it is close to setting, until it has fully set.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20628",
        "10870",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-570",
      "hadith_no": "570",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا حميد بن مسعدة، قال حدثنا سفيان، - وهو ابن حبيب - عن موسى بن على، عن أبيه، قال سمعت عقبة بن عامر، يقول ثلاث ساعات كان رسول الله صلى الله عليه وسلم ينهانا أن نصلي فيهن أو نقبر فيهن موتانا حين تطلع الشمس بازغة حتى ترتفع وحين يقوم قائم الظهيرة حتى تميل وحين تضيف للغروب حتى تغرب ‏.‏",
      "text_en": " It was narrated from Musa bin 'Ali that his father said:                      \"I heard 'Uqbah bin 'Amir say: 'There are three times during which the Messenger of Allah (ﷺ) forbade us from praying or burying our dead: When the sun had clearly started to rise until it was fully risen, when it was directly overhead at noon until it has passed the zenith, and when it was close to setting until it had fully set.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30430",
        "20711",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-674",
      "hadith_no": "674",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا محمد بن سلمة، قال حدثنا ابن وهب، عن عمرو بن الحارث، أن أبا عشانة المعافري، حدثه عن عقبة بن عامر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ يعجب ربك من راعي غنم في رأس شظية الجبل يؤذن بالصلاة ويصلي فيقول الله عز وجل انظروا إلى عبدي هذا يؤذن ويقيم الصلاة يخاف مني قد غفرت لعبدي وأدخلته الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin 'Amir said:                      \"I heard the Messenger of Allah (ﷺ) say: 'Your Lord is pleased with a shepherd high in the mountains who calls the Adhan for the prayer and prays. Allah says: 'Look at this slave of Mine; he calls the Adhan and Iqamah for the prayer and fears Me. I have forgiven My slave and admitted him to Paradise.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "20029",
        "20377",
        "16021",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-770",
      "hadith_no": "770",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا قتيبة، وعيسى بن حماد، زغبة عن الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، قال أهدي لرسول الله صلى الله عليه وسلم فروج حرير فلبسه ثم صلى فيه ثم انصرف فنزعه نزعا شديدا كالكاره له ثم قال ‏\"‏ لا ينبغي هذا للمتقين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin Amir said:                      \"A silken Farruj was presented to the Messenger ofAllah (ﷺ) and he put it on and offered the prayer in it, then when he had finished the prayer he tore it off as if he disliked it and said:'This is not befitting for those whohave Taqwa.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30412",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-952",
      "hadith_no": "952",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا موسى بن حزام الترمذي، وهارون بن عبد الله، - واللفظ له - قالا حدثنا أبو أسامة، قال أخبرني سفيان، عن معاوية بن صالح، عن عبد الرحمن بن جبير بن نفير، عن أبيه، عن عقبة بن عامر، أنه سأل النبي صلى الله عليه وسلم عن المعوذتين قال عقبة فأمنا بهما رسول الله صلى الله عليه وسلم في صلاة الفجر ‏.‏",
      "text_en": " It was narrated from Uqbah bin Amr that:                     He asked the Prophet (ﷺ) about Al-Mua'awwidhatain. Uqbah said: \"The Messenger of Allah (ﷺ) led us in praying Fajr and recited them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30394",
        "20318",
        "20012",
        "20675",
        "10942",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-953",
      "hadith_no": "953",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي عمران، أسلم عن عقبة بن عامر، قال اتبعت رسول الله صلى الله عليه وسلم وهو راكب فوضعت يدي على قدمه فقلت أقرئني يا رسول الله سورة هود وسورة يوسف ‏.‏ فقال ‏\"‏ لن تقرأ شيئا أبلغ عند الله من ‏{‏ قل أعوذ برب الفلق ‏}‏ و ‏{‏ قل أعوذ برب الناس ‏}‏ ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Uqbah bin Amr said:                     \"I followed the Messenger of Allah (ﷺ) when he was riding, and I placed my hand on his foot and said : O Messenger of Allah, teach me Surah Hud and Surah Yusuf. He said: 'You will never recite anything greater before Allah than: \"Say: I seek refuge with (Allah), the Lord of the daybreak.\" And \"Say: I seek refuge with (Allah) the Lord of mankind.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11411",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-954",
      "hadith_no": "954",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرني محمد بن قدامة، قال حدثنا جرير، عن بيان، عن قيس، عن عقبة بن عامر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ آيات أنزلت على الليلة لم ير مثلهن قط ‏{‏ قل أعوذ برب الفلق ‏}‏ و ‏{‏ قل أعوذ برب الناس ‏}‏ ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Uqbah bin Amr said:                     The Messenger of Allah (ﷺ) said: 'Some verses were revealed to me tonight, the like of which has never been seen: \"Say: I seek refuge with (Allah), the Lord of the daybreak.\" And \"Say: I seek refuge with (Allah) the Lord of mankind.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20028",
        "11326",
        "11046",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-1336",
      "hadith_no": "1336",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن سلمة، قال حدثنا ابن وهب، عن الليث، عن حنين بن أبي حكيم، عن على بن رباح، عن عقبة بن عامر، قال أمرني رسول الله صلى الله عليه وسلم أن أقرأ المعوذات دبر كل صلاة ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin 'Amr said:                     \"The Messenger of Allah (ﷺ) commanded me to recite Al-Mu'awwidhat following every prayer.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "20029",
        "20023",
        "18233",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-1663",
      "hadith_no": "1663",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا هارون بن محمد بن بكار بن بلال، قال حدثنا محمد، - يعني ابن سميع - قال حدثنا زيد يعني ابن واقد، عن كثير بن مرة، أن عقبة بن عامر، حدثهم أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الذي يجهر بالقرآن كالذي يجهر بالصدقة والذي يسر بالقرآن كالذي يسر بالصدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Kathir bin Murrah that 'Uqbah bin 'Amir told them that:                     The Messenger of Allah (ﷺ) said: 'The one who recites the Qur'an loudly is like one who gives charity openly, and the one who recites the Qur'an silently is like the one who gives charity in secret.'\"",
      "usc_msa_ref": "",
      "chain": [
        "37538",
        "11671",
        "19940",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-1954",
      "hadith_no": "1954",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن يزيد، عن أبي الخير، عن عقبة، أن رسول الله صلى الله عليه وسلم خرج يوما فصلى على أهل أحد صلاته على الميت ثم انصرف إلى المنبر فقال ‏\"‏ إني فرط لكم وأنا شهيد عليكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from  'Upbah that:                     the Messenger of Allah went out one day and offered the funeral prayer for the people f Uhd, then he went to the Minbar and said: \"I am your predecessor and I am a witness over your.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "20472",
        "11410",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-2013",
      "hadith_no": "2013",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا عبد الرحمن، قال حدثنا موسى بن على بن رباح، قال سمعت أبي قال، سمعت عقبة بن عامر الجهني، قال ‏:‏ ثلاث ساعات كان رسول الله صلى الله عليه وسلم ينهانا أن نصلي فيهن، أو نقبر فيهن موتانا ‏:‏ حين تطلع الشمس بازغة حتى ترتفع، وحين يقوم قائم الظهيرة حتى تزول الشمس، وحين تضيف الشمس للغروب ‏.‏",
      "text_en": " 'Uqbah bin 'Amir Al-Juhani said:                     \"There are three times at which the Messenger of Allah forbade us to pray or to bury our dead: When the sun has risen fully until it is higher, when it reaches its zenith until it has passed the zenith, and when the sun starts to set\" (Sahib)",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20033",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-2254",
      "hadith_no": "2254",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمود بن خالد، عن محمد بن شعيب، قال أخبرني يحيى بن الحارث، عن القاسم أبي عبد الرحمن، أنه حدثه عن عقبة بن عامر، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من صام يوما في سبيل الله عز وجل باعد الله منه جهنم مسيرة مائة عام ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amir that the Messenger of Allah said:                     \"Whoever fasts one day in the cause of Allah, the mighty and sublime, Allah will separate him the distance of one hundred years from the fire.\"",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20732",
        "19894",
        "11648",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-2561",
      "hadith_no": "2561",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن سلمة، قال حدثنا ابن وهب، عن معاوية بن صالح، عن بحير بن سعد، عن خالد بن معدان، عن كثير بن مرة، عن عقبة بن عامر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الجاهر بالقرآن كالجاهر بالصدقة والمسر بالقرآن كالمسر بالصدقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amir that the Messenger of Allah said:                     \"The one who recites the Qur'an loudly is like one who gives charity openly, and the one who recites the Qur'an quietly is like one who gives charity in secret.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "20029",
        "20675",
        "11422",
        "19940",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-3004",
      "hadith_no": "3004",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني عبيد الله بن فضالة بن إبراهيم، قال أنبأنا عبد الله، - وهو ابن يزيد المقرئ - قال حدثنا موسى بن على، قال سمعت أبي يحدث، عن عقبة بن عامر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن يوم عرفة ويوم النحر وأيام التشريق عيدنا أهل الإسلام وهي أيام أكل وشرب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Uqbah bin Amir that the Messenger of Allah said:                     \"The day of Arafat and the day of sacrifice and the day of At-Tashriq are our Id, the people of Islam, and they are days of eating and drinking.\"",
      "usc_msa_ref": "",
      "chain": [
        "23033",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-3146",
      "hadith_no": "3146",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عمرو بن عثمان بن سعيد، عن الوليد، عن ابن جابر، عن أبي سلام الأسود، عن خالد بن يزيد، عن عقبة بن عامر، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله عز وجل يدخل ثلاثة نفر الجنة بالسهم الواحد صانعه يحتسب في صنعه الخير والرامي به ومنبله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amir that the Prophet (ﷺ) said:                      \"Allah, the Mighty and Sublime, will admit three people into Paradise for one arrow: The one who makes it, intending it to be used for a good cause, the one who shoots it, and one who passes it to him.\"",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "20733",
        "10968",
        "11408",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-3163",
      "hadith_no": "3163",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا ابن وهب، قال حدثني عبد الرحمن بن شريح، عن عبد الله بن ثعلبة الحضرمي، أنه سمع ابن حجيرة، يخبر عن عقبة بن عامر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ خمس من قبض في شىء منهن فهو شهيد المقتول في سبيل الله شهيد والغرق في سبيل الله شهيد والمبطون في سبيل الله شهيد والمطعون في سبيل الله شهيد والنفساء في سبيل الله شهيد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amir that the Messenger of Allah (ﷺ) said:                      \"There are five things, whoever dies of any of them is a martyr. The one who is killed in the cause of Allah is a martyr; the one who dies of an abdominal complaint in the cause of Allah is a martyr; the one who dies of the plague in the cause of Allah is a martyr; and the woman who dies in childbirth in the cause of Allah is a martyr.\"",
      "usc_msa_ref": "",
      "chain": [
        "30493",
        "20029",
        "20438",
        "16053",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-3281",
      "hadith_no": "3281",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا عيسى بن حماد، قال أنبأنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن أحق الشروط أن يوفى به ما استحللتم به الفروج ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Utbah bin 'Amir that the Messenger of Allah said:                      \"The conditions that are most deserving of fulfillment, are those by means of which the private parts become allowed to you.\"",
      "usc_msa_ref": "",
      "chain": [
        "30412",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-3282",
      "hadith_no": "3282",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا عبد الله بن محمد بن تميم، قال سمعت حجاجا، يقول قال ابن جريج أخبرني سعيد بن أبي أيوب، عن يزيد بن أبي حبيب، أن أبا الخير، حدثه عن عقبة بن عامر، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن أحق الشروط أن يوفى به ما استحللتم به الفروج ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Utbah bin 'Amir that the Messenger of Allah said:                      \"The conditions that are most deserving of fulfillment are those by means of which the private parts become permitted to you.\"",
      "usc_msa_ref": "",
      "chain": [
        "20219",
        "11070",
        "20375",
        "11411",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-3578",
      "hadith_no": "3578",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرنا الحسن بن إسماعيل بن مجالد، قال حدثنا عيسى بن يونس، عن عبد الرحمن بن يزيد بن جابر، قال حدثني أبو سلام الدمشقي، عن خالد بن يزيد الجهني، قال كان عقبة بن عامر يمر بي فيقول يا خالد اخرج بنا نرمي ‏.‏ فلما كان ذات يوم أبطأت عنه فقال يا خالد تعال أخبرك بما قال رسول الله صلى الله عليه وسلم فأتيته فقال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله يدخل بالسهم الواحد ثلاثة نفر الجنة صانعه يحتسب في صنعه الخير والرامي به ومنبله وارموا واركبوا وأن ترموا أحب إلى من أن تركبوا وليس اللهو إلا في ثلاثة تأديب الرجل فرسه وملاعبته امرأته ورميه بقوسه ونبله ومن ترك الرمى بعد ما علمه رغبة عنه فإنها نعمة كفرها ‏\"‏ ‏.‏ أو قال ‏\"‏ كفر بها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Khalid bin Yazid Al-Juhani said:                      \"Uqbah bin 'Amir used to pass by me and say: 'O Khalid, let us go out and shoot arrows.' One day I came late and he said: 'O Khalid, come and I will tell you what the Messenger of Allah said.' So I went to him and he said: 'The Messenger of Allah said: Allah will admit three people to Paradise because of one arrow: The one who makes it seeking good thereby, the one who shoots it and the one who hands it to him. So shoot and ride, and if you shoot that is dearer to me than if you ride. And play is only in three things: A man training his horse, and playing with his wife, and shooting with his bow and arrow. Whoever gives up shooting after learning it because he is no longer interested in it, that is a blessing for which he is ungrateful -or that he has rejected.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20347",
        "20395",
        "11408",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-3814",
      "hadith_no": "3814",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرني يوسف بن سعيد، قال حدثنا حجاج، عن ابن جريج، قال حدثني سعيد بن أبي أيوب، عن يزيد بن أبي حبيب، أخبره أن أبا الخير حدثه عن عقبة بن عامر، قال نذرت أختي أن تمشي، إلى بيت الله فأمرتني أن أستفتي لها رسول الله صلى الله عليه وسلم فاستفتيت لها النبي صلى الله عليه وسلم فقال ‏\"‏ لتمش ولتركب ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin 'Amir said:                      \"My sister vowed to walk to the House of Allah, and she told me to ask the Messenger of Allah about that. So I asked the Prophet for her and he said: 'Let her walk, and let her ride.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20219",
        "11070",
        "20375",
        "11411",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-3815",
      "hadith_no": "3815",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عمرو بن علي، ومحمد بن المثنى، قالا حدثنا يحيى بن سعيد، عن يحيى بن سعيد، عن عبيد الله بن زحر، - وقال عمرو إن عبيد الله بن زحر أخبره - عن عبد الله بن مالك، أن عقبة بن عامر، أخبره أنه، سأل النبي صلى الله عليه وسلم عن أخت له نذرت أن تمشي حافية غير مختمرة فقال له النبي صلى الله عليه وسلم ‏\"‏ مرها فلتختمر ولتركب ولتصم ثلاثة أيام ‏\"‏ ‏.‏",
      "text_en": " 'Uqbah bin 'Amir narrated that he asked the Prophet about a sister of his who had vowed to walk, barefoot and bareheaded. The Prophet said to him:                      \"Tell her to cover her head and ride, and fast for three days.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "30170",
        "20031",
        "11062",
        "19927",
        "11081",
        "19927",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-3832",
      "hadith_no": "3832",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا أحمد بن يحيى بن الوزير بن سليمان، والحارث بن مسكين، قراءة عليه وأنا أسمع، عن ابن وهب، قال أخبرني عمرو بن الحارث، عن كعب بن علقمة، عن عبد الرحمن بن شماسة، عن عقبة بن عامر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ كفارة النذر كفارة اليمين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amir that the Messenger of Allah said:                      \"The expiation for vows is the expiation for an oath.\"",
      "usc_msa_ref": "",
      "chain": [
        "36017",
        "20029",
        "20377",
        "10872",
        "10867",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-4379",
      "hadith_no": "4379",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أن رسول الله صلى الله عليه وسلم أعطاه غنما يقسمها على صحابته فبقي عتود فذكره لرسول الله صلى الله عليه وسلم فقال ‏\"‏ ضح به أنت ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amair that:                     the Messenger of Allah gave him some sheep to distribute among his Companions.  A small goat was left over and he mentioned that to the Messenger of Allah. He said: \"Sacrifice it yourself.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-4380",
      "hadith_no": "4380",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا يحيى بن درست، قال حدثنا أبو إسماعيل، - وهو القناد - قال حدثنا يحيى، قال حدثني بعجة بن عبد الله، عن عقبة بن عامر، أن رسول الله صلى الله عليه وسلم قسم بين أصحابه ضحايا فصارت لي جذعة فقلت يا رسول الله صارت لي جذعة ‏.‏ فقال ‏\"‏ ضح بها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amir that:                     the Messenger of Allah divided some sacrificial animals among his Companions, and I got a Jadh'ah sheep. I said: 'O Messenger of Allah, I got a Jadh'ah sheep.' He said: 'Sacrifice it.\"",
      "usc_msa_ref": "",
      "chain": [
        "34282",
        "20031",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-4381",
      "hadith_no": "4381",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا هشام، عن يحيى بن أبي كثير، عن بعجة بن عبد الله الجهني، عن عقبة بن عامر، قال قسم رسول الله صلى الله عليه وسلم بين أصحابه أضاحي فأصابني جذعة فقلت يا رسول الله أصابتني جذعة ‏.‏ فقال ‏\"‏ ضح بها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin 'Amir said:                     \"The Messenger of Allah divided some sacrificial animals among his Companions, and I got a Jadh'ah sheep. I said: 'O Messenger of Allah, I got a Jadh'ah sheep.' He said: 'Sacrifice it.\"\"",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20295",
        "11449",
        "10893",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-4382",
      "hadith_no": "4382",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا سليمان بن داود، عن ابن وهب، قال أخبرني عمرو، عن بكير بن الأشج، عن معاذ بن عبد الله بن خبيب، عن عقبة بن عامر، قال ضحينا مع رسول الله صلى الله عليه وسلم بجذع من الضأن ‏.‏",
      "text_en": " it was narrated that 'Uqbah bin 'Amir said:                     'We sacrificed a Jadh'ah sheep with the Messenger of Allah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30584",
        "20029",
        "20377",
        "11154",
        "19822",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-5136",
      "hadith_no": "5136",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا وهب بن بيان، قال حدثنا ابن وهب، قال أنبأنا عمرو بن الحارث، أن أبا عشانة، - هو المعافري - حدثه أنه، سمع عقبة بن عامر، يخبر أن رسول الله صلى الله عليه وسلم كان يمنع أهله الحلية والحرير ويقول ‏\"‏ إن كنتم تحبون حلية الجنة وحريرها فلا تلبسوها في الدنيا ‏\"‏ ‏.‏",
      "text_en": " 'Uqbah bin 'Amir narrated that:                     The Messenger of Allah [SAW] used to tell his wives not to wear jewelry and silk. He said: \"If you want the jewelry and silk of Paradise, then do not wear them in this world.\"",
      "usc_msa_ref": "",
      "chain": [
        "36063",
        "20029",
        "20377",
        "16021",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-5157",
      "hadith_no": "5157",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "وأخبرنا العباس بن الوليد بن مزيد، عن عقبة، عن الأوزاعي، حدثني يحيى، قال حدثني أبو إسحاق، قال حدثني أبو حمان، قال حج معاوية فدعا نفرا من الأنصار في الكعبة فقال ألم تسمعوا رسول الله صلى الله عليه وسلم نهى عن الذهب قالوا نعم ‏.‏ قال وأنا أشهد ‏.‏",
      "text_en": " Ibn Himman said:                     \"Mu'awiyah went on Hajj and he called a group of Ansar to the Ka'bah. He said: 'Did you hear the Messenger of Allah [SAW] forbid gold?' They said: 'Yes.' He said: 'And I bear witness to that.'\"",
      "usc_msa_ref": "",
      "chain": [
        "189",
        "20024",
        "11449",
        "11049"
      ]
    },
    {
      "id": "sunan-an-nasai-5430",
      "hadith_no": "5430",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا محمد بن علي، قال حدثني القعنبي، عن عبد العزيز، عن عبد الله بن سليمان، عن معاذ بن عبد الله بن خبيب، عن أبيه، عن عقبة بن عامر الجهني، قال بينا أنا أقود، برسول الله صلى الله عليه وسلم راحلته في غزوة إذ قال ‏\"‏ يا عقبة قل ‏\"‏ ‏.‏ فاستمعت ثم قال ‏\"‏ يا عقبة قل ‏\"‏ ‏.‏ فاستمعت فقالها الثالثة فقلت ما أقول فقال ‏\"‏ ‏{‏ قل هو الله أحد ‏}‏ ‏\"‏ ‏.‏ فقرأ السورة حتى ختمها ثم قرأ ‏{‏ قل أعوذ برب الفلق ‏}‏ وقرأت معه حتى ختمها ثم قرأ ‏{‏ قل أعوذ برب الناس ‏}‏ فقرأت معه حتى ختمها ثم قال ‏\"‏ ما تعوذ بمثلهن أحد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin 'Amir Al-Juhani said:                     \"While I was leading the Messenger of Allah [SAW] on his mount on a military campaign, he said: 'O 'Uqbah, say!' I listened, then he said: 'O 'Uqbah, say!' I listened, then he said it a third time. I said: 'What should I say?' He said: 'Say: He is Allah, (the) One...' and he recited the Surah to the end. Then he recited: 'Say: I seek refuge with (Allah) the Lord of the daybreak...' and I recited it with him until the end. Then he recited: 'Say: I seek refuge with (Allah) the Lord of mankind...' and I recited it with him until the end. Then he said: 'No one ever sought refuge (with Allah) by means of anything like them.'\"",
      "usc_msa_ref": "",
      "chain": [
        "11442",
        "20164",
        "20167",
        "19822",
        "5123",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-5431",
      "hadith_no": "5431",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا أحمد بن عثمان بن حكيم، قال حدثنا خالد بن مخلد، قال حدثني عبد الله بن سليمان الأسلمي، عن معاذ بن عبد الله بن خبيب، عن عقبة بن عامر الجهني، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ قل ‏\"‏ ‏.‏ قلت وما أقول قال ‏\"‏ ‏{‏ قل هو الله أحد ‏}‏ ‏{‏ قل أعوذ برب الفلق ‏}‏ ‏{‏ قل أعوذ برب الناس ‏}‏ ‏\"‏ ‏.‏ فقرأهن رسول الله صلى الله عليه وسلم ثم قال ‏\"‏ لم يتعوذ الناس بمثلهن أو لا يتعوذ الناس بمثلهن ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin 'Amir Al-Juhani said:                     \"The Messenger of Allah [SAW] said to me: 'Say.' I said: 'What should I say?' He said: 'Say: He is Allah (the) One,' 'Say: I seek refuge with (Allah) the Lord of the daybreak,' 'Say: I seek refuge with (Allah) the Lord of mankind.' The Messenger of Allah [SAW] recited them, then he said: 'The people have never recited anything like them, or the people have never sought refuge (with Allah) by means of anything like them.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30185",
        "30463",
        "19822",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-5433",
      "hadith_no": "5433",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرني عمرو بن عثمان، قال حدثنا بقية، قال حدثنا بحير بن سعد، عن خالد بن معدان، عن جبير بن نفير، عن عقبة بن عامر، قال أهديت للنبي صلى الله عليه وسلم بغلة شهباء فركبها وأخذ عقبة يقودها به فقال رسول الله صلى الله عليه وسلم لعقبة ‏\"‏ اقرأ ‏\"‏ ‏.‏ قال وما أقرأ يا رسول الله قال ‏\"‏ اقرأ ‏{‏ قل أعوذ برب الفلق * من شر ما خلق ‏}‏ ‏\"‏ ‏.‏ فأعادها على حتى قرأتها فعرف أني لم أفرح بها جدا قال ‏\"‏ لعلك تهاونت بها ‏\"‏ ‏.‏ فما قمت يعني بمثلها ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin 'Amir said:                     \"The Prophet [SAW] was given a gray mule which he rode, and 'Uqbah led it. The Messenger of Allah [SAW] said to 'Uqbah: 'Recite.' He said: 'What should I recite, O Messenger of Allah?' He said: 'Recite: 'Say: I seek refuge with (Allah) the Lord of the daybreak, from the evil of what He has created.' And he repeated it until I had learned it.\"",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "20644",
        "11422",
        "4097",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-5434",
      "hadith_no": "5434",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا موسى بن حزام الترمذي، قال أنبأنا أبو أسامة، عن سفيان، عن معاوية بن صالح، عن عبد الرحمن بن جبير بن نفير، عن أبيه، عن عقبة بن عامر، أنه سأل رسول الله صلى الله عليه وسلم عن المعوذتين ‏.‏ قال عقبة فأمنا رسول الله صلى الله عليه وسلم بهما في صلاة الغداة ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amir that :                     He asked the Messenger of Allah [SAW] about Al-Mu'awwidhatain. 'Uqbah said: \"The Messenger of Allah [SAW] recited them when he led us in Salah Al-Ghadah (As-Subh).\"",
      "usc_msa_ref": "",
      "chain": [
        "30394",
        "20318",
        "20012",
        "20675",
        "10942",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-5435",
      "hadith_no": "5435",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا عبد الرحمن، قال حدثنا معاوية، عن العلاء بن الحارث، عن مكحول، عن عقبة، أن رسول الله صلى الله عليه وسلم قرأ بهما في صلاة الصبح ‏.‏",
      "text_en": " It was narrated from 'Uqbah that:                     The Messenger of Allah [SAW] recited them in the Subh prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "27",
        "10884",
        "11066",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-5436",
      "hadith_no": "5436",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا أحمد بن عمرو، قال أنبأنا ابن وهب، قال أخبرني معاوية بن صالح، عن ابن الحارث، - وهو العلاء - عن القاسم، مولى معاوية عن عقبة بن عامر، قال كنت أقود برسول الله صلى الله عليه وسلم في السفر فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا عقبة ألا أعلمك خير سورتين قرئتا ‏\"‏ ‏.‏ فعلمني ‏{‏ قل أعوذ برب الفلق ‏}‏ و ‏{‏ قل أعوذ برب الناس ‏}‏ فلم يرني سررت بهما جدا فلما نزل لصلاة الصبح صلى بهما صلاة الصبح للناس فلما فرغ رسول الله صلى الله عليه وسلم من الصلاة التفت إلى فقال ‏\"‏ يا عقبة كيف رأيت ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin 'Amir said:                     \"I was leading the Messenger of Allah [SAW] (on his mount) on a journey, and the Messenger of Allah [SAW] said: 'O 'Uqbah, shall I not teach you the best two Surahs that can be recited?' And he taught me: 'Say: I seek refuge with (Allah) the Lord of the daybreak.' And 'Say: I seek refuge with (Allah) the Lord of mankind...' He thought that I did not seem too overjoyed with them, so when he stopped to pray Subh, he recited them when he led the people in the Subh prayer. When the Messenger of Allah [SAW] finished praying, he turned to me and said: 'O 'Uqbah, what do you think?'\"",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "20675",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-5437",
      "hadith_no": "5437",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرني محمود بن خالد، قال حدثنا الوليد، قال حدثني ابن جابر، عن القاسم أبي عبد الرحمن، عن عقبة بن عامر، قال بينا أقود برسول الله صلى الله عليه وسلم في نقب من تلك النقاب إذ قال ‏\"‏ ألا تركب يا عقبة ‏\"‏ ‏.‏ فأجللت رسول الله صلى الله عليه وسلم أن أركب مركب رسول الله صلى الله عليه وسلم ثم قال ‏\"‏ ألا تركب يا عقبة ‏\"‏ ‏.‏ فأشفقت أن يكون معصية فنزل وركبت هنيهة ونزلت وركب رسول الله صلى الله عليه وسلم ثم قال ‏\"‏ ألا أعلمك سورتين من خير سورتين قرأ بهما الناس ‏\"‏ ‏.‏ فأقرأني ‏{‏ قل أعوذ برب الفلق ‏}‏ و ‏{‏ قل أعوذ برب الناس ‏}‏ فأقيمت الصلاة فتقدم فقرأ بهما ثم مر بي فقال ‏\"‏ كيف رأيت يا عقبة بن عامر اقرأ بهما كلما نمت وقمت ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin 'Amir said:                     \"While I was leading the Messenger of Allah [SAW] (on his mount) in one of these mountain passes, he said: 'Why don't you ride, O 'Uqbah?' I had too much respect for the Messenger of Allah [SAW] to ride the mount of the Messenger of Allah [SAW]. Then he said: 'Why don't you ride, O 'Uqbah?' I was worried that I might be disobeying him, so he got off, and I rode for a little while, then I got off and the Messenger of Allah [SAW] rode. Then he said: 'Shall I not teach you two of the best Surahs that the people recite?' And he taught me: 'Say: I seek refuge with (Allah) the Lord of the daybreak,' and 'Say: I seek refuge with (Allah) the Lord of mankind.\" Then the Iqamah was said and he went forward and recited them. Then he passed by me and said: 'What do you think, O 'Uqbah bin 'Amir? Recite them every time you go to sleep and get up.'\"",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "20733",
        "11648",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-5438",
      "hadith_no": "5438",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن ابن عجلان، عن سعيد المقبري، عن عقبة بن عامر، قال كنت أمشي مع رسول الله صلى الله عليه وسلم فقال ‏\"‏ يا عقبة قل ‏\"‏ ‏.‏ فقلت ماذا أقول يا رسول الله فسكت عني ثم قال ‏\"‏ يا عقبة قل ‏\"‏ ‏.‏ قلت ماذا أقول يا رسول الله فسكت عني فقلت اللهم اردده على فقال ‏\"‏ يا عقبة قل ‏\"‏ ‏.‏ قلت ماذا أقول يا رسول الله فقال ‏\"‏ ‏{‏ قل أعوذ برب الفلق ‏}‏ فقرأتها حتى أتيت على آخرها ثم قال ‏\"‏ قل ‏\"‏ ‏.‏ قلت ماذا أقول يا رسول الله قال ‏\"‏ ‏{‏ قل أعوذ برب الناس ‏}‏ ‏\"‏ ‏.‏ فقرأتها حتى أتيت على آخرها ثم قال رسول الله صلى الله عليه وسلم عند ذلك ‏\"‏ ما سأل سائل بمثلهما ولا استعاذ مستعيذ بمثلهما ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin 'Amir said:                     \"I was walking with the Messenger of Allah [SAW] and he said: \"O 'Uqbah, say!' I said: 'What should I say, O Messenger of Allah?' He did not answer me, then h esaid: 'O 'Uqbah, say!' I said: 'What should I say, O Messenger of Allah?' But he did not answer me. I said: 'O Allah, make him answer me.' He said: 'O 'Uqbah, say!' I said: 'What should I say, O Messenger of Allah?' He said: 'Say: I seek refuge with (Allah) the Lord of the daybreak...' So I recited it until I came to the end. Then he said: 'Say,' and I said: 'What should I say, O Messenger of Allah?' He said: 'Say: I seek refuge with (Allah) the Lord of mankind...,' so I recited it until I came to the end. Then the Messenger of Allah [SAW] said: 'No one who asks has ever asked by means of anything like them, and no one who seeks refuge has ever sought refuge with anything like them.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "10616",
        "11168",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-5439",
      "hadith_no": "5439",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي عمران، أسلم عن عقبة بن عامر، قال أتيت رسول الله صلى الله عليه وسلم وهو راكب فوضعت يدي على قدمه فقلت أقرئني سورة هود أقرئني سورة يوسف ‏.‏ فقال ‏\"‏ لن تقرأ شيئا أبلغ عند الله عز وجل من ‏{‏ قل أعوذ برب الفلق ‏}‏ ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin 'Amir said:                     \"I came to the Messenger of Allah [SAW] while he was riding, and I put my hand on his foot and said: 'Teach me Surah Hud, teach me Surah Yusuf. He said: 'You will never recite anything more precious before Allah, the Mighty and Sublime, than: 'Say: I seek refuge with (Allah) the Lord of the daybreak.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11411",
        "189"
      ]
    },
    {
      "id": "sunan-an-nasai-5440",
      "hadith_no": "5440",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا يحيى، قال حدثنا إسماعيل، قال حدثنا قيس، عن عقبة بن عامر، عن النبي صلى الله عليه وسلم قال ‏\"‏ أنزل على آيات لم ير مثلهن ‏{‏ قل أعوذ برب الفلق ‏}‏ إلى آخر السورة و ‏{‏ قل أعوذ برب الناس ‏}‏ ‏\"‏ ‏.‏ إلى آخر السورة ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amir that:                     The Prophet [SAW] said: \"There have been revealed to me Verses the like of which has never been seen: 'Say: I seek refuge with (Allah) the Lord of the daybreak...' to the end of the Surah, and 'Say: I seek refuge with (Allah) the Lord of mankind...' to the end of the Surah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20031",
        "11418",
        "11046",
        "189"
      ]
    },
    {
      "id": "sunan-ibn-majah-508",
      "hadith_no": "508",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا علقمة بن عمرو الدارمي، حدثنا أبو بكر بن عياش، عن أبي إسحاق، عن عبد الله بن عطاء البجلي، عن عقبة بن عامر الجهني، عن عمر بن الخطاب، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ما من مسلم يتوضأ فيحسن الوضوء ثم يقول أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله إلا فتحت له ثمانية أبواب الجنة يدخل من أيها شاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Umar bin Khattab said:                     \"The Messenger of Allah said: 'There is no Muslim who performs ablution and does it well, then says: Ashhadu an la ilaha illallah, wa ashhadu anna Muhammadan 'abduhu wa rasuluhu (I bear witness that none has the right to be worshipped but Allah, and I bear witness that Muhammed is His slave and Messenger),' (except that) eighte gates of Paradise will be opened for him, and he will enter through whichever one he wants.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20373",
        "11049",
        "189",
        "3"
      ]
    },
    {
      "id": "sunan-ibn-majah-601",
      "hadith_no": "601",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن يوسف السلمي، حدثنا أبو عاصم، حدثنا حيوة بن شريح، عن يزيد بن أبي حبيب، عن الحكم بن عبد الله البلوي، عن علي بن رباح اللخمي، عن عقبة بن عامر الجهني، أنه قدم على عمر بن الخطاب من مصر فقال منذ كم لم تنزع خفيك قال من الجمعة إلى الجمعة ‏.‏ قال أصبت السنة ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amir Al-Juhani that:                     He came to 'Umar bin Khattab from Egypt. 'Umar said: \"How long has it been since you have taken off your leather socks?\" He said: \"From one Friday to the next.\" He said: \"You have acted in accordance with the Sunnah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30535",
        "20241",
        "26010",
        "11411",
        "10870",
        "189"
      ]
    },
    {
      "id": "sunan-ibn-majah-937",
      "hadith_no": "937",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عمرو بن رافع البجلي، حدثنا عبد الله بن المبارك، عن موسى بن أيوب الغافقي، قال سمعت عمي، إياس بن عامر يقول سمعت عقبة بن عامر الجهني، يقول لما نزلت ‏{فسبح باسم ربك العظيم}‏ قال لنا رسول الله  صلى الله عليه وسلم  ‏\"‏ اجعلوها في ركوعكم ‏\"‏ ‏.‏ فلما نزلت ‏{سبح اسم ربك الأعلى}‏ قال لنا رسول الله  صلى الله عليه وسلم  ‏\"‏ اجعلوها في سجودكم ‏\"‏ ‏.‏",
      "text_en": " ‘Uqbahbin ‘Amir Al-Juhani said:                      “When the following was revealed:‘Soglorify the Name of your Lord, the Most Great’,[69:52] theMessenger of Allah (ﷺ) said to us: ‘Say this in your Ruku’.’Andwhen the following was revealed: ‘Glorify the Name of yourLord, theMost High.’[87:1] the Messenger of Allah (ﷺ) said tous: ‘Say thisin your prostrations.’”",
      "usc_msa_ref": "",
      "chain": [
        "18792",
        "20025",
        "16104",
        "189"
      ]
    },
    {
      "id": "sunan-ibn-majah-1586",
      "hadith_no": "1586",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، ح وحدثنا عمرو بن رافع، حدثنا عبد الله بن المبارك، جميعا عن موسى بن على بن رباح، قال سمعت أبي يقول، سمعت عقبة بن عامر الجهني، يقول ثلاث ساعات كان رسول الله  صلى الله عليه وسلم  ينهانا أن نصلي فيهن أو نقبر فيهن موتانا حين تطلع الشمس بازغة وحين يقوم قائم الظهيرة حتى تميل الشمس وحين تضيف للغروب حتى تغرب ‏.‏",
      "text_en": " ‘Uqbahbin ‘Amir Al-Juhani said:                      “There are three times during thedaywhen the Messenger of Allah (ﷺ) forbade us to offer the funeralprayer or bury our dead: When the sun has fully risen (until it ishigher up in the sky); when it is overhead at noon, until it haspassed the meridian: and when it is starting to set until it hasset.”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "18792",
        "20025",
        "189"
      ]
    },
    {
      "id": "sunan-ibn-majah-1634",
      "hadith_no": "1634",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن إسماعيل بن سمرة، حدثنا المحاربي، عن الليث بن سعد، عن يزيد بن أبي حبيب، عن أبي الخير، مرثد بن عبد الله اليزني عن عقبة بن عامر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لأن أمشي على جمرة أو سيف أو أخصف نعلي برجلي أحب إلى من أن أمشي على قبر مسلم وما أبالي أوسط القبور قضيت حاجتي أو وسط السوق ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Uqbah bin ‘Amir that the Messenger of Allah(ﷺ)said:                      ‘If I were to walk on a live coal or a sword, or if I weretosew shows to my feet, that would be better for me than walking onthegrave of a Muslim. And I see no difference between relievingmyselfin the midst of graves or in the middle of the marketplace.”",
      "usc_msa_ref": "",
      "chain": [
        "38475",
        "20333",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "id": "sunan-ibn-majah-2011",
      "hadith_no": "2011",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا يحيى بن عثمان بن صالح المصري، حدثنا أبي قال، سمعت الليث بن سعد، يقول قال لي أبو مصعب مشرح بن هاعان قال عقبة بن عامر قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ألا أخبركم بالتيس المستعار ‏\"‏ ‏.‏ قالوا بلى يا رسول الله قال ‏\"‏ هو المحلل لعن الله المحلل والمحلل له ‏\"‏ ‏.‏",
      "text_en": " 'Uqbah bin 'Amir narrated:                     that the Messenger of said: 'Shall I not tell you of a borrowed billy goat.” They said: “Yes, O Messenger of!” He said: “He is Muhallil. May curse the Muhallil and the Muhallal lahu.”",
      "usc_msa_ref": "",
      "chain": [
        "36066",
        "20023",
        "189"
      ]
    },
    {
      "id": "sunan-ibn-majah-2030",
      "hadith_no": "2030",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا عمرو بن عبد الله، ومحمد بن إسماعيل، قالا حدثنا أبو أسامة، عن عبد الحميد بن جعفر، عن يزيد بن أبي حبيب، عن مرثد بن عبد الله، عن عقبة بن عامر، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ إن أحق الشرط أن يوفى به ما استحللتم به الفروج ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amir:                     that the Prophet said: “The conditions most deserving to be fulfilled are those by means of which the private parts become permissible for you.”",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "20318",
        "11875",
        "11411",
        "189"
      ]
    },
    {
      "id": "sunan-ibn-majah-2208",
      "hadith_no": "2208",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا إسماعيل بن رافع، عن خالد بن يزيد، عن عقبة بن عامر الجهني، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من نذر نذرا ولم يسمه فكفارته كفارة يمين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amit Al-Juhani that the Messenger of Allah (ﷺ) said:                     \"Whoever makes a vow and does not state it specifically, the expiation (for such a vow) is the expiation for breaking an oath. \"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "22024",
        "11408",
        "189"
      ]
    },
    {
      "id": "sunan-ibn-majah-2216",
      "hadith_no": "2216",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا علي بن محمد، حدثنا عبد الله بن نمير، عن يحيى بن سعيد، عن عبيد الله بن زحر، عن أبي سعيد الرعيني، أن عبد الله بن مالك، أخبره أن عقبة بن عامر أخبره أن أخته نذرت أن تمشي حافية غير مختمرة وأنه ذكر ذلك لرسول الله  صلى الله عليه وسلم  فقال ‏\"‏ مرها فلتركب ولتختمر ولتصم ثلاثة أيام ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Ar-Ru'aini that 'Abdullah bin Malik told him, that :                     'Uqbah  bin 'Amir told him, that his sister vowed to walk, barefoot and bareheaded, and he mentioned that to the Messenger of Allah (ﷺ) He said: \"Order her to ride and to cover her head, and to fast for three days.\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20331",
        "11062",
        "19927",
        "189"
      ]
    },
    {
      "id": "sunan-ibn-majah-2274",
      "hadith_no": "2274",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا خالد بن الحارث، حدثنا سعيد، عن قتادة، عن الحسن، عن عقبة بن عامر، أو سمرة بن جندب عن النبي  صلى الله عليه وسلم  قال ‏\"‏ أيما رجل باع بيعا من رجلين فهو للأول منهما ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amir or Samurah bin Jundab that the Messenger of Allah (ﷺ) said:                     \"Any man who sells to two men, it is for the one who was first.\"[1]",
      "usc_msa_ref": "",
      "chain": [
        "30430",
        "20226",
        "11168",
        "11019",
        "11016",
        "189"
      ]
    },
    {
      "id": "sunan-ibn-majah-2330",
      "hadith_no": "2330",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا عمرو بن رافع، حدثنا هشيم، عن يونس بن عبيد، عن الحسن، عن عقبة بن عامر، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لا عهدة بعد أربع ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amir that the Messenger of Allah (ﷺ) said:                     \"There is no contractual obligation after four (days).\"",
      "usc_msa_ref": "",
      "chain": [
        "18792",
        "20468",
        "11075",
        "11016",
        "189"
      ]
    },
    {
      "id": "sunan-ibn-majah-2331",
      "hadith_no": "2331",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن بشار، حدثنا وهب بن جرير، حدثنا أبي، سمعت يحيى بن أيوب، يحدث عن يزيد بن أبي حبيب، عن عبد الرحمن بن شماسة، عن عقبة بن عامر، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ المسلم أخو المسلم ولا يحل لمسلم باع من أخيه بيعا فيه عيب إلا بينه له ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin 'Amir said:                     \"I heard the Messenger of Allah (ﷺ) say: 'The Muslim is the brother of another Muslim, and it is not permissible for a Muslim to sell his brother goods in which there is a defect, without pointing that out to him.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20298",
        "11272",
        "20379",
        "11411",
        "10867",
        "189"
      ]
    },
    {
      "id": "sunan-ibn-majah-2716",
      "hadith_no": "2716",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا وكيع، حدثنا إسماعيل بن أبي خالد، عن عبد الرحمن بن عائذ، عن عقبة بن عامر الجهني، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من لقي الله لا يشرك به شيئا لم يتند بدم حرام دخل الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Uqbah bin Amir Al-Juhani that the Messenger of Allah (ﷺ) said:                     “Whoever meets Allah (SWT) not associating anything in worship with him, and not having shed any blood unlawfully, will enter Paradise.”",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20032",
        "11418",
        "19925",
        "189"
      ]
    },
    {
      "id": "sunan-ibn-majah-2874",
      "hadith_no": "2874",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن الصباح، أنبأنا عبد العزيز بن محمد، عن صالح بن محمد بن زائدة، عن عمر بن عبد العزيز، عن عقبة بن عامر الجهني، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ رحم الله حارس الحرس ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Uqbah bin ‘Amir Al-Juhani that the Messenger ofAllah (ﷺ) said:                      “May Allah have mercy on the one who keeps watchover the troops.”",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20167",
        "19807",
        "11010",
        "189"
      ]
    },
    {
      "id": "sunan-ibn-majah-2918",
      "hadith_no": "2918",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، أنبأنا هشام الدستوائي، عن يحيى بن أبي كثير، عن أبي سلام، عن عبد الله بن الأزرق، عن عقبة بن عامر الجهني، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله ليدخل بالسهم الواحد الثلاثة الجنة صانعه يحتسب في صنعته الخير والرامي به والممد به ‏\"‏ ‏.‏ وقال رسول الله صلى الله عليه وسلم ‏\"‏ ارموا واركبوا وأن ترموا أحب إلى من أن تركبوا وكل ما يلهو به المرء المسلم باطل إلا رميه بقوسه وتأديبه فرسه وملاعبته امرأته فإنهن من الحق ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Uqbah bin ‘Amir Al-Juhani that the Prophet(ﷺ)said:                      “Allah will admit three people to Paradise by virtue ofonearrow: The one who makes it, seeking reward by making it well; theone who shoots it; and the one who hands it to him.” And theMessengerof Allah (ﷺ) said: “Shoot and ride, and if you shootthat is dearerto me than if you ride. All things that a Muslim mandoes forentertainment are in vain except for shooting arrows,training hishorse and playing with his wife, for these are thingsthat bringreward.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20472",
        "20295",
        "11449",
        "189"
      ]
    },
    {
      "id": "sunan-ibn-majah-2920",
      "hadith_no": "2920",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا يونس بن عبد الأعلى، أنبأنا عبد الله بن وهب، أخبرني عمرو بن الحارث، عن أبي علي الهمداني، أنه سمع عقبة بن عامر الجهني، يقول سمعت رسول الله صلى الله عليه وسلم يقرأ على المنبر ‏\"‏ ‏{وأعدوا لهم ما استطعتم من قوة}‏ ألا وإن القوة الرمى ‏\"‏ ثلاث مرات ‏.‏",
      "text_en": " It wasnarrated that ‘Uqbah bin ‘Amir Al-Juhani said:                      “I heard theMessenger of Allah (ﷺ) reciting on the pulpit: ‘And make readyagainst them all you can of power.’[8:60] (And saying that) threetimes – ‘Power means shooting.”",
      "usc_msa_ref": "",
      "chain": [
        "30493",
        "20029",
        "20377",
        "189"
      ]
    },
    {
      "id": "sunan-ibn-majah-2921",
      "hadith_no": "2921",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا حرملة بن يحيى المصري، أنبأنا عبد الله بن وهب، أخبرني ابن لهيعة، عن عثمان بن نعيم الرعيني، عن المغيرة بن نهيك، أنه سمع عقبة بن عامر الجهني، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من تعلم الرمى ثم تركه فقد عصاني ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Uqbah bin ‘Amir Al-Juhani said:                      “I heard theMessenger of Allah (ﷺ) say: ‘Whoever learns how to shoot (arrows)then abandons it, has disobeyed me.’”",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "20029",
        "20624",
        "189"
      ]
    },
    {
      "id": "sunan-ibn-majah-3258",
      "hadith_no": "3258",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا محمد بن رمح، أنبأنا الليث بن سعد، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر الجهني، أن رسول الله  صلى الله عليه وسلم  أعطاه غنما فقسمها على أصحابه ضحايا فبقي عتود فذكره لرسول الله  صلى الله عليه وسلم  فقال ‏\"‏ ضح به أنت ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Uqbah bin ‘Amir Al-Juhani that the Messenger ofAllah (ﷺ) gave him some sheep, and he distributed them among hisCompanions to be sacrificed. There remained an ‘Atud.* He mentionedthat to the Messenger of Allah (ﷺ) and he said:                      “You sacrifice ityourself.”",
      "usc_msa_ref": "",
      "chain": [
        "30490",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "id": "sunan-ibn-majah-3491",
      "hadith_no": "3491",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا حرملة بن يحيى، حدثنا عبد الله بن وهب، أخبرني ابن لهيعة، عن عثمان بن نعيم، عن المغيرة بن نهيك، عن دخين الحجري، أنه سمع عقبة بن عامر الجهني، يقول إن رسول الله  صلى الله عليه وسلم  قال لأصحابه ‏\"‏ لا تأكلوا البصل ‏\"‏ ‏.‏ ثم قال كلمة خفية ‏\"‏ النيء ‏\"‏ ‏.‏",
      "text_en": " ‘Uqbahbin ‘Amir Al-Juhani said:                      “The Messenger of Allah (ﷺ) saidtohis Companions: ‘Do not eat onions,’ then he said in a low voice:‘Raw.’”",
      "usc_msa_ref": "",
      "chain": [
        "30487",
        "20029",
        "20624",
        "189"
      ]
    },
    {
      "id": "sunan-ibn-majah-3570",
      "hadith_no": "3570",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا بكر بن يونس بن بكير، عن موسى بن علي بن رباح، عن أبيه، عن عقبة بن عامر الجهني، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا تكرهوا مرضاكم على الطعام والشراب فإن الله يطعمهم ويسقيهم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Uqbah bin ‘Amir Al-Juhani that the Messenger ofAllah (ﷺ) said:                      “Do not force your sick ones to eat or drink.Allahwill feed them and give them to drink.”",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20628",
        "10870",
        "189"
      ]
    },
    {
      "id": "sunan-ibn-majah-3669-2",
      "hadith_no": "3669",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا الحسين بن الحسن المروزي، حدثنا ابن المبارك، عن حرملة بن عمران، قال سمعت أبا عشانة المعافري، قال سمعت عقبة بن عامر، يقول سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ من كان له ثلاث بنات فصبر عليهن وأطعمهن وسقاهن وكساهن من جدته - كن له حجابا من النار يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Uqbah bin Amir said, I heard the Messenger of Allah(ﷺ) say:                     \"Whoever has three daughters and is patient towards them, and feeds them, gives them to drink, and clothes them from his wealth; they will be a shield for him from the Fire on the Day of Resurrection.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20025",
        "20622",
        "16021",
        "189"
      ]
    },
    {
      "id": "sunan-ibn-majah-3676-2",
      "hadith_no": "3676",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن رمح، أنبأنا الليث بن سعد، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أنه قال قلنا لرسول الله  صلى الله عليه وسلم  إنك تبعثنا فننزل بقوم فلا يقرونا فما ترى في ذلك ‏.‏ قال لنا رسول الله  صلى الله عليه وسلم  ‏\"‏ إن نزلتم بقوم فأمروا لكم بما ينبغي للضيف فاقبلوا وإن لم يفعلوا فخذوا منهم حق الضيف الذي ينبغي لهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Uqbah bin Amir said:                     \"We said to the Messenger of Allah(ﷺ): ' You send us and we stay with people who do not show us any hospitality. WHat do you think of that?' The MEssenger of Allah (ﷺ) said: 'If you stay with people and they give you what a guest deserves, then accept it. If they do not do that , then take from them what they should have offered, which a guest is entitled to.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30490",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    }
  ],
  "total_hadiths": 157
}