{
  "id": "189",
  "name": "'Uqba bin 'Amir al-Juhayni ( عقبة بن عامر الجهني ( رضي الله عنه",
  "full_name": "'Uqba bin 'Amir al-Juhayni ( عقبة بن عامر الجهني ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "HIjaz"
    },
    "death": {
      "date_hijri": "58",
      "date_gregorian": "677",
      "date_display": null,
      "place": "Cario",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Syria",
      "Egypt"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]",
      "Commander",
      "Governor",
      "Art/Poetry"
    ],
    "tags": [
      "B.Juhayna",
      "al-Juhni",
      "B.Quda'a",
      "Mule Driver",
      "Servant",
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "4048",
      "name": "Abu Umama al-Bahili ( أبو أمامة الباهلي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11046",
      "name": "Qays bin Abi Hazim قيس بن أبي حازم",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "4097",
      "name": "Jubayr bin Nufayr al-Hadrami ( جبير بن نفير الحضرمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10893",
      "name": "B'jh bin 'Abdullah بعجة بن عبد الله بن بدر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "16027",
      "name": "Dkhyn bin 'Amir al-Hjry Abu دخين بن عامر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11334",
      "name": "Raba'i bin Harash bin Jahsh ربعي بن حراش",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10851",
      "name": "Thmamh bin Shfy ثمامة بن شفي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10867",
      "name": "'Abdur Rahman bin Shmas'h عبد الرحمن بن شماسة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10870",
      "name": "'Ali bin Rabah bin Qasayr علي بن رباح بن قصير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11410",
      "name": "Marthad bin 'Abdullah al-Yazni مرثد بن عبد الله اليزني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "16099",
      "name": "Mushrah bin Ha'an al-Ma'fari مشرح بن هاعان المعافري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11027",
      "name": "Abu Idrees al-Khulani أبو إدريس الخولاني",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "16021",
      "name": "Hay bin Yu'man, Abu 'Ashana حي بن يؤمن بن حجيل",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19940",
      "name": "Kathir bin Marrah al-Hadrami كثير بن مرة الحضرمي",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "375",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن يوسف، قال حدثنا الليث، عن يزيد، عن أبي الخير، عن عقبة بن عامر، قال أهدي إلى النبي صلى الله عليه وسلم فروج حرير، فلبسه فصلى فيه، ثم انصرف فنزعه نزعا شديدا كالكاره له وقال ‏\"‏ لا ينبغي هذا للمتقين ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     The Prophet was given a silken Farruj [??] as a present. He wore it while praying. When he had finished his prayer, he took it off violently as if with a strong aversion to it and said, \"It is not the dress of Allah-fearing pious people.\"",
      "chain": [
        "30355",
        "20023",
        "20472",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "851",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن عبيد، قال حدثنا عيسى بن يونس، عن عمر بن سعيد، قال أخبرني ابن أبي مليكة، عن عقبة، قال صليت وراء النبي صلى الله عليه وسلم بالمدينة العصر فسلم ثم قام مسرعا، فتخطى رقاب الناس إلى بعض حجر نسائه، ففزع الناس من سرعته فخرج عليهم، فرأى أنهم عجبوا من سرعته فقال ‏\"‏ ذكرت شيئا من تبر عندنا فكرهت أن يحبسني، فأمرت بقسمته ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba:                     I offered the `Asr prayer behind the Prophet at Medina. When he had finished the prayer with Taslim, he got up hurriedly and went out by crossing the rows of the people to one of the dwellings of his wives. The people got scared at his speed . The Prophet came back and found the people surprised at his haste and said to them, \"I remembered a piece of gold Lying in my house and I did not like it to divert my attention from Allah's worship, so I have ordered it to be distributed (in charity).",
      "chain": [
        "30213",
        "20347",
        "10652",
        "11090",
        "189"
      ]
    },
    {
      "hadith_no": "1344",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، حدثني يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أن النبي صلى الله عليه وسلم خرج يوما فصلى على أهل أحد صلاته على الميت، ثم انصرف إلى المنبر فقال ‏\"‏ إني فرط لكم، وأنا شهيد عليكم، وإني والله لأنظر إلى حوضي الآن، وإني أعطيت مفاتيح خزائن الأرض  أو مفاتيح الأرض  وإني والله ما أخاف عليكم أن تشركوا بعدي، ولكن أخاف عليكم أن تنافسوا فيها ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     One day the Prophet went out and offered the funeral prayers of the martyrs of Uhud and then went up the pulpit and said, \"I will pave the way for you as your predecessor and will be a witness on you. By Allah! I see my Fount (Kauthar) just now and I have been given the keys of all the treasures of the earth (or the keys of the earth). By Allah! I am not afraid that you will worship others along with Allah after my death, but I am afraid that you will fight with one another for the worldly things.\"",
      "chain": [
        "30355",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "1899",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن يحيى بن أيوب، عن يزيد، عن أبي الخير، عن عقبة،، فذكر الحديث‏.‏   حدثنا إبراهيم بن موسى، أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني سعيد بن أبي أيوب، أن يزيد بن أبي حبيب، أخبره أن أبا الخير حدثه عن عقبة بن عامر، قال نذرت أختي أن تمشي، إلى بيت الله، وأمرتني أن أستفتي لها النبي صلى الله عليه وسلم فاستفتيته، فقال عليه السلام ‏\"‏ لتمش ولتركب ‏\"‏‏.‏ قال وكان أبو الخير لا يفارق عقبة‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     My sister vowed to go on foot to the Ka`ba, and she asked me to take the verdict of the Prophet about it. So, I did and the Prophet said, \"She should walk and also should ride.\"Narrated Abul-Khair from `Uqba as above.:",
      "chain": [
        "20241",
        "11070",
        "20379",
        "20304",
        "11410",
        "30309",
        "20467",
        "11070",
        "20375",
        "11411",
        "189"
      ]
    },
    {
      "hadith_no": "2300",
      "source": " Sahih Bukhari ",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "حدثنا عمرو بن خالد، حدثنا الليث، عن يزيد، عن أبي الخير، عن عقبة بن عامر  رضى الله عنه  أن النبي صلى الله عليه وسلم أعطاه غنما يقسمها على صحابته، فبقي عتود فذكره للنبي صلى الله عليه وسلم فقال ‏\"ضح به أنت.\"",
      "text_en": " Narrated `Uqba bin Amir:                     that the Prophet had given him sheep to distribute among his companions and a male kid was left (after the distribution). When he informed the Prophet of it, he said (to him), \"Offer it as a sacrifice on your behalf.\"",
      "chain": [
        "30237",
        "20023",
        "20472",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "2461",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، قال حدثني يزيد، عن أبي الخير، عن عقبة بن عامر، قال قلنا للنبي صلى الله عليه وسلم إنك تبعثنا فننزل بقوم لا يقرونا فما ترى فيه فقال لنا ‏\"‏ إن نزلتم بقوم، فأمر لكم بما ينبغي للضيف فاقبلوا، فإن لم يفعلوا فخذوا منهم حق الضيف ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     We staid to the Prophet, \"You send us out and it happens that we have to stay with such people as do not entertain us. What do you think about it? He said to us, \"If you stay with some people and they entertain you as they should for a guest, accept their hospitality, but If they don't do, take the right of the guest from them.\"",
      "chain": [
        "30355",
        "20023",
        "20472",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "2500",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر  رضى الله عنه  أن رسول الله صلى الله عليه وسلم أعطاه غنما يقسمها على صحابته ضحايا، فبقي عتود فذكره لرسول الله صلى الله عليه وسلم فقال ‏\"‏ ضح به أنت ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     that Allah's Apostle gave him some sheep to distribute among his companions in order to sacrifice them and a kid was left. He told the Prophet about it and the Prophet said to him, \"Sacrifice it on your behalf.\"",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "2721",
      "source": " Sahih Bukhari ",
      "chapter": "Conditions - كتاب الشروط",
      "chapter_no": "54",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا الليث، قال حدثني يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أحق الشروط أن توفوا به ما استحللتم به الفروج ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin Amir:                     Allah's Apostle said, \"From among all the conditions which you have to fulfill, the conditions which make it legal for you to have sexual relations (i.e. the marriage contract) have the greatest right to be fulfilled.\"",
      "chain": [
        "30355",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "3639",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني سعيد بن شرحبيل، حدثنا ليث، عن يزيد، عن أبي الخير، عن عقبة بن عامر، أن النبي صلى الله عليه وسلم خرج يوما فصلى على أهل أحد صلاته على الميت، ثم انصرف إلى المنبر، فقال ‏\"‏ إني فرطكم، وأنا شهيد عليكم، إني والله لأنظر إلى حوضي الآن، وإني قد أعطيت خزائن مفاتيح الأرض، وإني والله ما أخاف بعدي أن تشركوا، ولكن أخاف أن تنافسوا فيها ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin `Amr:                     The Prophet once came out and offered the funeral prayer for the martyrs of Uhud, and proceeded to the pulpit and said, \"I shall be your predecessor and a witness on you, and I am really looking at my sacred Fount now, and no doubt, I have been given the keys of the treasures of the world. By Allah, I am not afraid that you will worship others along with Allah, but I am afraid that you will envy and fight one another for worldly fortunes.\"",
      "chain": [
        "30194",
        "20023",
        "20472",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "4092",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن عبد الرحيم، أخبرنا زكرياء بن عدي، أخبرنا ابن المبارك، عن حيوة، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، قال صلى رسول الله صلى الله عليه وسلم على قتلى أحد بعد ثماني سنين، كالمودع للأحياء والأموات، ثم طلع المنبر فقال ‏\"‏ إني بين أيديكم فرط، وأنا عليكم شهيد، وإن موعدكم الحوض، وإني لأنظر إليه من مقامي هذا، وإني لست أخشى عليكم أن تشركوا، ولكني أخشى عليكم الدنيا أن تنافسوها ‏\"‏‏.‏ قال فكانت آخر نظرة نظرتها إلى رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Uqba bin Amir:                     Allah's Apostle offered the funeral prayers of the martyrs of Uhud eight years after (their death), as if bidding farewell to the living and the dead, then he ascended the pulpit and said, \"I am your predecessor before you, and I am a witness on you, and your promised place to meet me will be Al- Haud (i.e. the Tank) (on the Day of Resurrection), and I am (now) looking at it from this place of mine. I am not afraid that you will worship others besides Allah, but I am afraid that worldly life will tempt you and cause you to compete with each other for it.\" That was the last look which I cast on Allah's Apostle.",
      "chain": [
        "30272",
        "30464",
        "20025",
        "26010",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "4134",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عمرو بن خالد، حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة، أن النبي صلى الله عليه وسلم خرج يوما فصلى على أهل أحد صلاته على الميت، ثم انصرف إلى المنبر فقال ‏\"‏ إني فرط لكم، وأنا شهيد عليكم، وإني لأنظر إلى حوضي الآن، وإني أعطيت مفاتيح خزائن الأرض  أو مفاتيح الأرض  وإني والله ما أخاف عليكم أن تشركوا بعدي، ولكني أخاف عليكم أن تنافسوا فيها ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba:                     One day the Prophet went out and offered the (funeral) prayer for the people (i.e. martyrs) of Uhud as he used to offer a funeral prayer for any dead person, and then (after returning) he ascended the pulpit and said, \"I am your predecessor before you, and I am a witness upon you, and I am looking at my Tank just now, and I have been given the keys of the treasures of the world (or the keys of the world). By Allah, I am not afraid that you will worship others besides Allah after me, but I am afraid that you will compete with each other for (the pleasures of) this world.\"",
      "chain": [
        "30237",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "5206",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا أبو الوليد، هشام بن عبد الملك حدثنا ليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة، عن النبي صلى الله عليه وسلم قال ‏\"‏ أحق ما أوفيتم من الشروط أن توفوا به ما استحللتم به الفروج ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba:                     The Prophet said: \"The stipulations most entitled to be abided by are those with which you are given the right to enjoy the (women's) private parts (i.e. the stipulations of the marriage contract).",
      "chain": [
        "20296",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "5287",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إياكم والدخول على النساء ‏\"‏‏.‏ فقال رجل من الأنصار يا رسول الله أفرأيت الحمو‏.‏ قال ‏\"‏ الحمو الموت ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     Allah's Apostle said, \"Beware of entering upon the ladies.\" A man from the Ansar said, \"Allah's Apostle! What about Al-Hamu the in-laws of the wife (the brothers of her husband or his nephews etc.)?\" The Prophet replied: The in-laws of the wife are death itself.",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "5605",
      "source": " Sahih Bukhari ",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا معاذ بن فضالة، حدثنا هشام، عن يحيى، عن بعجة الجهني، عن عقبة بن عامر الجهني، قال قسم النبي صلى الله عليه وسلم بين أصحابه ضحايا، فصارت لعقبة جذعة‏.‏ فقلت يا رسول الله صارت جذعة‏.‏ قال ‏\"‏ ضح بها ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir Al-Juhani:                     that the Prophet distributed among his companions some animals for sacrifice (to be slaughtered on `Id-al-Adha). `Uqba's share was a Jadha'a (a six month old goat). `Uqba said, \"O Allah's Apostle! I get in my share of Jadha'a (a six month old ram).\" The Prophet said, \"Slaughter it as a sacrifice.\"",
      "chain": [
        "30177",
        "20295",
        "20031",
        "189"
      ]
    },
    {
      "hadith_no": "5613",
      "source": " Sahih Bukhari ",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا عمرو بن خالد، حدثنا الليث، عن يزيد، عن أبي الخير، عن عقبة بن عامر  رضى الله عنه أن النبي صلى الله عليه وسلم أعطاه غنما يقسمها على صحابته ضحايا، فبقي عتود فذكره للنبي صلى الله عليه وسلم فقال ‏\"‏ ضح أنت به ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     that the Prophet gave him some sheep to distribute among his companions to slaughter as sacrifices (`Id--al--Adha). A kid was left and he told the Prophet of that whereupon he said to him, \"Slaughter it as a sacrifice (on your behalf).",
      "chain": [
        "30237",
        "20023",
        "20472",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "5861",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر  رضى الله عنه  أنه قال أهدي لرسول الله صلى الله عليه وسلم فروج حرير، فلبسه، ثم صلى فيه، ثم انصرف فنزعه نزعا شديدا كالكاره له ثم قال ‏\"‏ لا ينبغي هذا للمتقين ‏\"‏‏.‏ تابعه عبد الله بن يوسف عن الليث، وقال غيره فروج حرير‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     A silken Farruj was presented to Allah's Apostle and he put it on and offered the prayer in it. When he finished the prayer, he took it off violently as if he disliked it and said, \"This (garment) does not befit those who fear Allah!\"",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "6207",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر  رضى الله عنه  أنه قال قلنا يا رسول الله إنك تبعثنا فننزل بقوم فلا يقروننا فما ترى، فقال لنا رسول الله صلى الله عليه وسلم ‏\"‏ إن نزلتم بقوم فأمروا لكم بما ينبغي للضيف فاقبلوا، فإن لم يفعلوا فخذوا منهم حق الضيف الذي ينبغي لهم ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     We said, \"O Allah's Apostle! You send us out and it happens that we have to stay with such people as do not entertain us. What do you think about it?\" Allah's Apostle said to us, \"If you stay with some people and they entertain you as they should for a guest, accept is; but if they do not do then you should take from them the right of the guest, which they ought to give.\"",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "6502",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أن رسول الله صلى الله عليه وسلم خرج يوما فصلى على أهل أحد صلاته على الميت، ثم انصرف إلى المنبر فقال ‏\"‏ إني فرطكم وأنا شهيد عليكم، وإني والله لأنظر إلى حوضي الآن، وإني قد أعطيت مفاتيح خزائن الأرض  أو مفاتيح الأرض  وإني والله ما أخاف عليكم أن تشركوا بعدي، ولكني أخاف عليكم أن تنافسوا فيها ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     The Prophet went out and offered the funeral prayer for the martyrs of the (battle of) Uhud and then ascended the pulpit and said, \"I am your predecessor and I am a witness against you. By Allah, I am now looking at my Tank-lake (Al-Kauthar) and I have been given the keys of the treasures of the earth (or the keys of the earth). By Allah! I am not afraid that after me you will worship others besides Allah, but I am afraid that you will start competing for (the pleasures of) this world.\"",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "6560",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "وقال معاذ حدثنا شعبة، عن قتادة، سمعت عقبة، سمعت أبا سعيد، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": "",
      "chain": [
        "32",
        "20020",
        "11019",
        "189",
        "38"
      ]
    },
    {
      "hadith_no": "6670",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عمرو بن خالد، حدثنا الليث، عن يزيد، عن أبي الخير، عن عقبة  رضى الله عنه  أن النبي صلى الله عليه وسلم خرج يوما فصلى على أهل أحد صلاته على الميت، ثم انصرف على المنبر فقال ‏\"‏ إني فرط لكم، وأنا شهيد عليكم، وإني والله لأنظر إلى حوضي الآن، وإني أعطيت مفاتيح خزائن الأرض  أو مفاتيح الأرض  وإني والله ما أخاف عليكم أن تشركوا بعدي، ولكن أخاف عليكم أن تنافسوا فيها ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     Once the Prophet went out and offered the funeral prayers for the martyrs of Uhud, and then went to the pulpit and said, \"I am a predecessor for you and I am a witness for you: and by Allah, I am looking at my Fount just now, and the keys of the treasures of the earth (or the keys of the earth) have been given to me: and by Allah, I am not afraid that you will worship others besides Allah after me, but I am afraid that you will strive and struggle against each other over these treasures of the world.\"",
      "chain": [
        "30237",
        "20023",
        "20472",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "7205",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "قال عقبة وحدثنا عبيد الله، حدثنا أبو الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم مثله إلا أنه قال ‏\"‏ يحسر عن جبل من ذهب ‏\"‏‏.‏",
      "text_en": "",
      "chain": [
        "189",
        "11201",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "234",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثني محمد بن حاتم بن ميمون، حدثنا عبد الرحمن بن مهدي، حدثنا معاوية بن صالح، عن ربيعة، - يعني ابن يزيد - عن أبي إدريس الخولاني، عن عقبة بن عامر، ح وحدثني أبو عثمان، عن جبير بن نفير، عن عقبة بن عامر، قال كانت علينا رعاية الإبل فجاءت نوبتي فروحتها بعشي فأدركت رسول الله صلى الله عليه وسلم قائما يحدث الناس فأدركت من قوله ‏\"‏ ما من مسلم يتوضأ فيحسن وضوءه ثم يقوم فيصلي ركعتين مقبل عليهما بقلبه ووجهه إلا وجبت له الجنة ‏\"‏ ‏.‏ قال فقلت ما أجود هذه ‏.‏ فإذا قائل بين يدى يقول التي قبلها أجود ‏.‏ فنظرت فإذا عمر قال إني قد رأيتك جئت آنفا قال ‏\"‏ ما منكم من أحد يتوضأ فيبلغ - أو فيسبغ - الوضوء ثم يقول أشهد أن لا إله إلا الله وأن محمدا عبد الله ورسوله إلا فتحت له أبواب الجنة الثمانية يدخل من أيها شاء ‏\"‏ ‏.‏",
      "text_en": " 'Uqba b. 'Amir reported:                      We were entrusted with the task of tending the camels. On my turn when I came back in the evening after grazing them in the pastures, I found Allah's Messenger (may peace be upon him) stand and address the people. I heard these words of his: If any Muslim performs ablution well, then stands and prays two rak'ahs setting about them with his heart as well as his face, Paradise would be guaranteed to him. I said: What a fine thing is this! And a narrator who was before me said: The first was better than even this. When I cast a glance, I saw that it was 'Umair who said: I see that you have just come and observed: If anyone amongst you performs the ablution, and then completes the ablution well and then says: I testify that there is no god but Allah and that Muhammad is the servant of Allah and His Messenger, the eight gates of Paradise would be opened for him and he may enter by whichever of them he wishes.",
      "chain": [
        "30514",
        "20033",
        "20675",
        "11414",
        "11027",
        "189",
        "11113",
        "4097",
        "189"
      ]
    },
    {
      "hadith_no": "234",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، حدثنا معاوية بن صالح، عن ربيعة بن يزيد، عن أبي إدريس الخولاني، وأبي، عثمان عن جبير بن نفير بن مالك الحضرمي، عن عقبة بن عامر الجهني، أن رسول الله صلى الله عليه وسلم ‏.‏ قال فذكر مثله غير أنه قال ‏\"‏ من توضأ فقال أشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمدا عبده ورسوله ‏\"‏ ‏.‏",
      "text_en": " Uqba b. 'Amir al-Juhani reported:                      Verily the Messenger of Allah (may peace be upon him) said and then narrated (the hadith) like one (mentioned above) except (this) that he said: He who performed ablution and said: I testify that there is no god but Allah, the One, there is no associate with Him and I testify that Muhammad is His servant and His Messenger.",
      "chain": [
        "30201",
        "20650",
        "20675",
        "11414",
        "11027",
        "11113",
        "4097",
        "189"
      ]
    },
    {
      "hadith_no": "1909",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا الفضل بن دكين، عن موسى بن على، قال سمعت أبي يحدث، عن عقبة بن عامر، قال خرج رسول الله صلى الله عليه وسلم ونحن في الصفة فقال ‏\"‏ أيكم يحب أن يغدو كل يوم إلى بطحان أو إلى العقيق فيأتي منه بناقتين كوماوين في غير إثم ولا قطع رحم ‏\"‏ ‏.‏ فقلنا يا رسول الله نحب ذلك ‏.‏ قال ‏\"‏ أفلا يغدو أحدكم إلى المسجد فيعلم أو يقرأ آيتين من كتاب الله عز وجل خير له من ناقتين وثلاث خير له من ثلاث وأربع خير له من أربع ومن أعدادهن من الإبل ‏\"‏ ‏.‏",
      "text_en": " Abu Umama said he heard Allah's Messenger (may peace be upon him) say:                      Recite the Qur'an, for on the Day of Resurrection it will come as an intercessor for those who recite It. Recite the two bright ones, al-Baqara and Surah Al 'Imran, for on the Day of Resurrection they will come as two clouds or two shades, or two flocks of birds in ranks, pleading for those who recite them. Recite Surah al-Baqara, for to take recourse to it is a blessing and to give it up is a cause of grief, and the magicians cannot confront it. (Mu'awiya said: It has been conveyed to me that here Batala means magicians.)",
      "chain": [
        "30201",
        "20348",
        "189"
      ]
    },
    {
      "hadith_no": "1927",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا جرير، عن بيان، عن قيس بن أبي حازم، عن عقبة بن عامر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألم تر آيات أنزلت الليلة لم ير مثلهن قط ‏{‏ قل أعوذ برب الفلق‏}‏ و ‏{‏ قل أعوذ برب الناس‏}‏ ‏\"‏ ‏.‏",
      "text_en": " 'Uqba b. 'Amir reported:                      The Messenger of Allah (may peace be upon him) said to me: There have been sent down to me verses the like of which had never been seen before. They are the Mu'awwadhatain.",
      "chain": [
        "30367",
        "20028",
        "11326",
        "11046",
        "189"
      ]
    },
    {
      "hadith_no": "1928",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا إسماعيل، عن قيس، عن عقبة بن عامر، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ أنزل - أو أنزلت - على آيات لم ير مثلهن قط المعوذتين ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated through another chain of transmitters directly from the Companions of Muhammad (may peace be upon him).",
      "chain": [
        "30212",
        "20331",
        "20208",
        "11046",
        "189"
      ]
    },
    {
      "hadith_no": "1929",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثني محمد بن رافع، حدثنا أبو أسامة، كلاهما عن إسماعيل، بهذا الإسناد مثله ‏.‏ وفي رواية أبي أسامة عن عقبة، بن عامر الجهني وكان من رفعاء أصحاب محمد صلى الله عليه وسلم ‏.‏",
      "text_en": " Salim narrated on the authority of his father (Ibn 'Umar) that the Apostle of Allah (may peace be upon him) said:                      Envy is not justified but in case of two persons only: one who, having been given (knowledge of) the Qur'an by Allah, recites it during the night and day (and also acts upon it) and a man who, having been given wealth by God, spends it during the night and the day (for the welfare of others. seeking the pleasure of the Lord).",
      "chain": [
        "30201",
        "20032",
        "30375",
        "189"
      ]
    },
    {
      "hadith_no": "1966",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا يحيى بن يحيى، حدثنا عبد الله بن وهب، عن موسى بن على، عن أبيه، قال سمعت عقبة بن عامر الجهني، يقول ثلاث ساعات كان رسول الله صلى الله عليه وسلم ينهانا أن نصلي فيهن أو أن نقبر فيهن موتانا حين تطلع الشمس بازغة حتى ترتفع وحين يقوم قائم الظهيرة حتى تميل الشمس وحين تضيف الشمس للغروب حتى تغرب ‏.‏",
      "text_en": " 'Amr b. 'Abasa Sulami reported:                      I in the state of the Ignorance (before embracing Islam) used to think that the people were in error and they were not on anything (which may be called the right path) and worshipped the idols. In the meanwhile I heard of a man in Mecca who was giving news (on the basis of his prophetic knowledge) ; so I sat on my ride and went to him. The Messenger of Allah (may peace be upon him) was at that time hiding as his people had made life hard for him. I adopted a friendly attitude (towards the Meccans and thus managed) to enter Mecca and go to him (the Holy Prophet) and I said to him: Who are you? He said: I am a Prophet (of Allah). I again said: Who is a Prophet? He said: (I am a Prophet in the sense that) I have been sent by Allah. I said: What is that which you have been sent with? He said: I have been sent to join ties of relationship (with kindness and affection), to break the Idols, and to proclaim the oneness of Allah (in a manner that) nothing is to be associated with Him. I said: Who is with you in this (in these beliefs and practices)? He said: A free man and a slave. He (the narrator) said: Abu Bakr and Bilal were there with him among those who had embraced Islam by that time. I said: I intend to follow you. He said: During these days you would not be able to do so. Don't you see the (hard) condition under which I and (my) people are living? You better go back to your people and when you hear that I have been granted victory, you come to me. So I went to my family. I was in my home when the Messengerof Allah (may peace be upon him) came to Medina. I was among my people and used to seek news and ask people when he arrived in Medina. Then a group of people belonging to Yathrib (Medina) came. I said (to them): How is that person getting on who has come to Medina? They said: The people are hastening to him, while his people (the polytheists of Mecca) planned to kill him, but they could not do so. I (on hearing It) came to Medina and went to him and said: Messenger of Allah, do you recognise me? He said: Yes, you are the same man who met me at Mecca. I said: It is so. I again said: Prophet of Allah, tell me that which Allah has taught you and which I do not know, tell me about the prayer. He said: Observe the dawn prayer, then stop praying when the sun is rising till it Is fully up, for when it rises it comes up between the horns of Satan, and the unbelievers prostrate themselves to it at that time. Then pray, for the prayer is witnessed and attended (by angels) till the shadow becomes about the length of a lance; then cease prayer, for at that time Hell is heated up. Then when the shadow moves forward, pray, for the prayer is witnessed and attended by angels, till you pray the afternoon prayer, then cease prayer till the sun sets, for it sets between the horns of devil, and at that time the unbelievers prostrate themselves before it. I said: Apostle of Allah, tell me about ablution also. He said: None of you who uses water for ablution and rinses his mouth, snuffs up water and blows it, but the sins of his face, and his mouth and his nostrils fall out. When he washes his face, as Allah has commanded him, the sins of his face fall out from the end of his beard with water. Then (when) he washes his forearms up to the elbows, the sins of his arms fall out along with water from his finger-tips. And when he wipes his head, the sins of his head fall out from the points of his hair along with water. And (when) he washes his feet up to the ankles, the sins of his feet fall out from his toes along with water. And if he stands to pray and praises Allah, lauds Him and glorifies Him with what becomes Him and shows wholehearted devotion to Allah, his sins would depart leaving him (as innocent) as he was on the day his mother bore him. 'Amr b. 'Abasa narrated this hadith to Abu Umama, a Companion of the Messenger of Allah (may peace be upon him), and Abu Umama said to him: 'Amr b. 'Abasa, think what you are saying that such (a great reward) is given to a man at one place (only in the act of ablution and prayer). Upon this 'Amr said: Abu Umama, I have grown old and my bones have become weak and I am at the door of death; what impetus is there for me to attribute a lie to Allah and the Messenger of Allah (may peace be upon him)? Had I heard it from the Messenger of Allah (may peace be upon him) once, twice, or three times (even seven times), I would have never narrated it, but I have heard it from him on occasions more than these.",
      "chain": [
        "30399",
        "20029",
        "189"
      ]
    },
    {
      "hadith_no": "3529",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني أبو الطاهر، أخبرنا عبد الله بن وهب، عن الليث، وغيره، عن يزيد بن، أبي حبيب عن عبد الرحمن بن شماسة، أنه سمع عقبة بن عامر، على المنبر يقول إن رسول الله صلى الله عليه وسلم قال ‏\"‏ المؤمن أخو المؤمن فلا يحل للمؤمن أن يبتاع على بيع أخيه ولا يخطب على خطبة أخيه حتى يذر ‏\"‏ ‏.‏",
      "text_en": " 'Uqba b. 'Amir said on the pulpit that Allah's Messenger (may peace be upon him) said:                      A believer is the brother of a believer, so it is not lawful for a believer to outbid his brother, and he should not propose an engagement when his brother has thus proposed until he gives it up.",
      "chain": [
        "20029",
        "20023",
        "11411",
        "10867",
        "189"
      ]
    },
    {
      "hadith_no": "3537",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا يحيى بن أيوب، حدثنا هشيم، ح وحدثنا ابن نمير، حدثنا وكيع، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، ح وحدثنا محمد بن المثنى، حدثنا يحيى، - وهو القطان - عن عبد الحميد بن جعفر، عن يزيد بن أبي حبيب، عن مرثد بن عبد، الله اليزني عن عقبة بن عامر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أحق الشرط أن يوفى به ما استحللتم به الفروج ‏\"‏ ‏.‏ هذا لفظ حديث أبي بكر وابن المثنى ‏.‏ غير أن ابن المثنى قال ‏\"‏ الشروط ‏\"‏ ‏.‏",
      "text_en": " 'Uqba b. Amir (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      The most worthy condition which must be fulfilled is that which makes sexual intercourse lawful. In the narration transmitted by Ibn Muthanna (instead of the word\" condition\" ) it is\" conditions\".",
      "chain": [
        "20379",
        "20468",
        "30212",
        "20032",
        "30201",
        "20326",
        "30170",
        "20031",
        "11875",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "4339",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vows - كتاب النذر",
      "chapter_no": "27",
      "text_ar": "وحدثنا زكرياء بن يحيى بن صالح المصري، حدثنا المفضل، - يعني ابن فضالة - حدثني عبد الله بن عياش، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أنه قال نذرت أختي أن تمشي، إلى بيت الله حافية فأمرتني أن أستفتي لها رسول الله صلى الله عليه وسلم فاستفتيته فقال ‏\"‏ لتمش ولتركب ‏\"‏ ‏.‏",
      "text_en": " 'Uqba b. Amir reported:                      My sister took a vow that she would walk bare foot to the house of Allah (Ka'ba). She asked me to inquire from Allah's Messenger (may peace be upon him) about it. I sought his decision and he said: She should walk on foot and ride also.",
      "chain": [
        "30193",
        "20378",
        "778",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "4340",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vows - كتاب النذر",
      "chapter_no": "27",
      "text_ar": "وحدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرنا سعيد، بن أبي أيوب أن يزيد بن أبي حبيب، أخبره أن أبا الخير حدثه عن عقبة بن عامر الجهني، أنه قال نذرت أختي ‏.‏ فذكر بمثل حديث مفضل ولم يذكر في الحديث حافية ‏.‏ وزاد وكان أبو الخير لا يفارق عقبة ‏.‏ وحدثنيه محمد بن حاتم، وابن أبي خلف، قالا حدثنا روح بن عبادة، حدثنا ابن، جريج أخبرني يحيى بن أيوب، أن يزيد بن أبي حبيب، أخبره بهذا الإسناد، ‏.‏ مثل حديث عبد الرزاق ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Uqba b. Amir Juhani. but in this no mention has been made of\" barefoot\".",
      "chain": [
        "30375",
        "20121",
        "11070",
        "20375",
        "11411",
        "189"
      ]
    },
    {
      "hadith_no": "4342",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vows - كتاب النذر",
      "chapter_no": "27",
      "text_ar": "وحدثني هارون بن سعيد الأيلي، ويونس بن عبد الأعلى، وأحمد بن عيسى، قال يونس أخبرنا وقال الآخران، حدثنا ابن وهب، أخبرني عمرو بن الحارث، عن كعب بن، علقمة عن عبد الرحمن بن شماسة، عن أبي الخير، عن عقبة بن عامر، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ كفارة النذر كفارة اليمين ‏\"‏ ‏.‏",
      "text_en": " 'Uqba. b. Amir reported Allah's Messenger (may peace be upon him) as saying:                      The expiation of the (breach of) a vow is the same as that of the (breach of an oath).",
      "chain": [
        "30492",
        "30227",
        "20475",
        "20029",
        "20377",
        "10872",
        "10867",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "4613",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، أخبرنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أنه قال قلنا يا رسول الله إنك تبعثنا فننزل بقوم فلا يقروننا فما ترى فقال لنا رسول الله صلى الله عليه وسلم ‏\"‏ إن نزلتم بقوم فأمروا لكم بما ينبغي للضيف فاقبلوا فإن لم يفعلوا فخذوا منهم حق الضيف الذي ينبغي لهم ‏\"‏ ‏.‏",
      "text_en": " 'Uqba b. Amir reported:                      We said to Allah's Messenger (may peace be upon him): You send us out and we come to the people who do not give us hospitality, so what is your opinion? Thereupon Allah's Messenger (may peace be upon him) said: If you come to the people who order for you what is befitting a guest, accept it; but if they do not. take from them what befits them to give to a guest.",
      "chain": [
        "30367",
        "20023",
        "30490",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "5055",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا هارون بن معروف، أخبرنا ابن وهب، أخبرني عمرو بن الحارث، عن  أبي علي، ثمامة بن شفى أنه سمع عقبة بن عامر، يقول سمعت رسول الله صلى الله عليه وسلم وهو على المنبر يقول ‏\"‏ وأعدوا لهم ما استطعتم من قوة ألا إن القوة الرمى ألا إن القوة الرمى ألا إن القوة الرمى ‏\"‏",
      "text_en": " It has been narrated on the authority of Ibn Amir who said:                      I heard the Messenger of Allah (may peace be upon him) say-and he was delivering a sermon from the pulpit: Prepare to meet them with as much strength as you can afford. Beware, strength consists in archery. Beware, strength consists in archery. Beware, strength consists in archery.",
      "chain": [
        "30280",
        "20029",
        "20377",
        "189"
      ]
    },
    {
      "hadith_no": "5056",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا هارون بن معروف، حدثنا ابن وهب، أخبرني عمرو بن الحارث، عن  أبي علي، عن عقبة بن عامر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ستفتح عليكم أرضون ويكفيكم الله فلا يعجز أحدكم أن يلهو بأسهمه ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Uqba b. Amir who said:                      I heard the Messenger of Allah (may peace be upon him) say: Lands shall be thrown open to you and Allah will suffice you (against your enemies), but none of you should give up playing with his arrows.",
      "chain": [
        "30280",
        "20029",
        "20377",
        "189"
      ]
    },
    {
      "hadith_no": "5057",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثناه داود بن رشيد، حدثنا الوليد، عن بكر بن مضر، عن عمرو بن الحارث، عن أبي علي الهمداني، قال سمعت عقبة بن عامر، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This tradition has also been narrated on the same authority through another chain of transmitters.",
      "chain": [
        "30248",
        "20733",
        "20374",
        "20377",
        "189"
      ]
    },
    {
      "hadith_no": "5196",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، أخبرنا الليث، عن  يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أن رسول الله صلى الله عليه وسلم أعطاه غنما يقسمها على أصحابه ضحايا فبقي عتود فذكره لرسول الله صلى الله عليه وسلم فقال ‏\"‏ ضح به أنت ‏\"‏ ‏.‏ قال قتيبة على صحابته ‏.‏",
      "text_en": " Uqba b. 'Amir reported that Allah's Messenger (may peace be upon him) gave the gifts of goats to be distributed amongst his Companions. They sacrificed them, but a lamb of one year of age was left. (Someone) made a mention of that to the Messenger of Allah (may peace be upon him), whereupon he said:                      You sacrifice it.",
      "chain": [
        "30367",
        "20023",
        "30490",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "5197",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، عن هشام الدستوائي، عن  يحيى بن أبي كثير، عن بعجة الجهني، عن عقبة بن عامر الجهني، قال قسم رسول الله صلى الله عليه وسلم فينا ضحايا فأصابني جذع فقلت يا رسول الله إنه أصابني جذع ‏.‏ فقال ‏\"‏ ضح به ‏\"‏ ‏.‏",
      "text_en": " Amir al-Juhani reported:                      Allah's Messenger (may peace be upon him) distributed sacrificial animals (amongst us for sacrificing them on 'Id al-Adha). So we sacrificed them. There fell to my lot a lamb of less than one year I said: Allah's Messenger, there has fallen to my lot a lamb (Jadha'a), whereupon he said: Sacrifice that.",
      "chain": [
        "30201",
        "20472",
        "20295",
        "11449",
        "189"
      ]
    },
    {
      "hadith_no": "5198",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثني عبد الله بن عبد الرحمن الدارمي، حدثنا يحيى، - يعني ابن حسان - أخبرنا معاوية، - وهو ابن سلام - حدثني يحيى بن أبي كثير، أخبرني بعجة بن عبد، الله أن عقبة بن عامر الجهني، أخبره أن رسول الله صلى الله عليه وسلم قسم ضحايا بين أصحابه ‏.‏ بمثل معناه ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of 'Uqba b. 'Amir al-Juhan with a slight change of wording.",
      "chain": [
        "30025",
        "20300",
        "20401",
        "11449",
        "189"
      ]
    },
    {
      "hadith_no": "5548",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أنه قال أهدي لرسول الله صلى الله عليه وسلم فروج حرير فلبسه ثم صلى فيه ثم انصرف فنزعه نزعا شديدا كالكاره له ثم قال ‏\"‏ لا ينبغي هذا للمتقين ‏\"‏.‏",
      "text_en": " Uqba b. 'Amir said:                      A silk go vn was presented to Allah's Messenger (may peace be upon him) and he wore it and observed prayer in it and then returned and put it off so violently as if he despised it. He then said: It does not befit the Godfearing persons.",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "5803",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، أخبرنا الليث، عن  يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إياكم والدخول على النساء ‏\"‏ ‏.‏ فقال رجل من الأنصار يا رسول الله أفرأيت الحمو قال ‏\"‏ الحمو الموت ‏\"‏ ‏.‏",
      "text_en": " 'Uqba b. Amir reported Allah's Messenger (may peace be upon him) as saying:                      Beware of getting, into the houses and meeting women (in seclusion). A person from the Ansir said: Allah's Messenger, what about husband's brother, whereupon he said: Husband's brother is like death.",
      "chain": [
        "30367",
        "20023",
        "30490",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "6116",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن  عقبة بن عامر، أن رسول الله صلى الله عليه وسلم خرج يوما فصلى على أهل أحد صلاته على الميت ثم انصرف إلى المنبر فقال ‏\"‏ إني فرط لكم وأنا شهيد عليكم وإني والله لأنظر إلى حوضي الآن وإني قد أعطيت مفاتيح خزائن الأرض أو مفاتيح الأرض وإني والله ما أخاف عليكم أن تشركوا بعدي ولكن أخاف عليكم أن تتنافسوا فيها ‏\"‏ ‏.‏",
      "text_en": " Uqba b. 'Amir reported that Allah's Messenger (may peace be upon him) one day went out and he offered prayer over the martyrs of Uhud just as prayer is offered over the dead. He then came back and sat on pulpit and said:                      I shall be present there (at the Cistern) before you. I shall be your witness and, by Allah, I perceive as if I am seeing with my own eyes my Cistern at this very state and I have been given the keys of the treasures of the earth or the keys of the earth and, by Allah, I am not afraid concerning you that you would associate anything (with Allah after me), but I am afraid that you would be vying with one another (for the possession of) the treasures of the earth.",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "6117",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا وهب، - يعني ابن جرير - حدثنا أبي قال، سمعت  يحيى بن أيوب، يحدث عن يزيد بن أبي حبيب، عن مرثد، عن عقبة بن عامر، قال صلى رسول الله صلى الله عليه وسلم على قتلى أحد ثم صعد المنبر كالمودع للأحياء والأموات فقال ‏\"‏ إني فرطكم على الحوض وإن عرضه كما بين أيلة إلى الجحفة إني لست أخشى عليكم أن تشركوا بعدي ولكني أخشى عليكم الدنيا أن تنافسوا فيها وتقتتلوا فتهلكوا كما هلك من كان قبلكم ‏\"‏ ‏.‏ قال عقبة فكانت آخر ما رأيت رسول الله صلى الله عليه وسلم على المنبر ‏.‏",
      "text_en": " Uqba b. 'Amir reported Allah's Messenger (may peace be upon him) as saying:                      Allah's Messenger offered prayer over those who had fallen matyrs at Uhud. He then climbed the pulpit as if someone is saying good-bye to the living and the dead, and then said: I shall be there as your predecesor on the Cistern before you, and it is as wide as the distance between Aila and Juhfa (Aila is at the top of the gulf of 'Aqaba). I am not afraid that you would associate anything with Allah after me, but I am afraid that you may be (allured) by the world and (vie) with one another (in possessing material wealth) and begin killing one another, and you would be destroyed as were destroyed those who had gone before you. 'Uqba said that that was the last occasion that he saw Allah's Massenger on the pulpit.",
      "chain": [
        "30170",
        "20298",
        "11272",
        "20379",
        "11411",
        "189"
      ]
    },
    {
      "hadith_no": "7506",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثني محمد بن عمرو بن جبلة، حدثنا محمد بن جعفر، ح وحدثنا عقبة بن، مكرم العمي وأبو بكر بن نافع قال عقبة حدثنا وقال أبو بكر، أخبرنا غندر، حدثنا شعبة، قال سمعت خالدا، يحدث عن سعيد بن أبي الحسن، عن أمه، عن أم سلمة، أن رسول الله صلى الله عليه وسلم قال لعمار ‏\"‏ تقتلك الفئة الباغية ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Umm Salama that Allah's Messenger (may peace be upon him) said to 'Ammar:                      A group of rebels would kill you.",
      "chain": [
        "38562",
        "20173",
        "30441",
        "189",
        "20436",
        "20278",
        "20020",
        "11282",
        "11287",
        "10737",
        "56"
      ]
    },
    {
      "hadith_no": "169",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن سعيد الهمداني، حدثنا ابن وهب، سمعت معاوية، - يعني ابن صالح - يحدث عن أبي عثمان، عن جبير بن نفير، عن عقبة بن عامر، قال كنا مع رسول الله صلى الله عليه وسلم خدام أنفسنا نتناوب الرعاية رعاية إبلنا فكانت على رعاية الإبل فروحتها بالعشي فأدركت رسول الله صلى الله عليه وسلم يخطب الناس فسمعته يقول ‏\"‏ ما منكم من أحد يتوضأ فيحسن الوضوء ثم يقوم فيركع ركعتين يقبل عليهما بقلبه ووجهه إلا قد أوجب ‏\"‏ ‏.‏ فقلت بخ بخ ما أجود هذه ‏.‏ فقال رجل من بين يدى التي قبلها يا عقبة أجود منها ‏.‏ فنظرت فإذا هو عمر بن الخطاب فقلت ما هي يا أبا حفص قال إنه قال آنفا قبل أن تجيء ‏\"‏ ما منكم من أحد يتوضأ فيحسن الوضوء ثم يقول حين يفرغ من وضوئه أشهد أن لا إله إلا الله وحده لا شريك له وأن محمدا عبده ورسوله إلا فتحت له أبواب الجنة الثمانية يدخل من أيها شاء ‏\"‏ ‏.‏ قال معاوية وحدثني ربيعة بن يزيد عن أبي إدريس عن عقبة بن عامر ‏.‏",
      "text_en": " ‘Uqbah b. ‘Amir said:                      We served ourselves in the company of Messenger of Allah (ﷺ). We tended our camels by turn. One day I had my turn to tend the camels, and I drove them in the afternoon. I found the Messenger of Allah (ﷺ) addressing the people. I heard him say: Anyone amongst you who performs ablution, and does it well, then he stands and offers two rak’ahs of prayer, concentrating on it with his heart and body, Paradise will be his lot by all means. I said: Ha-ha! How fine it is! A man in front of me said: The action (mentioned by the Prophet) earlier, O ‘Uqbah, is finer that this one. I looked at him and found him to be ‘Umar b. al-Khattab. I asked him: What is that, O Abu Hafs? He replied: He (the Prophet) had said before you came: If any one of you performs ablution, and does it well, and when he finishes the ablution, he utters the words : I bear witness that there is no deity except Allah, He has no associate, and I bear witness that Muhammad is His Servant and His Messenger, all the eight doors of Paradise will be opened for him; he may enter (through) any of them. Mu’awiyah said: Rabi’ah b. Yazid narrated this tradition to me from Abu Idris and the authority of  ‘Uqbah b.’Amir.",
      "chain": [
        "30296",
        "20029",
        "20675",
        "11113",
        "4097",
        "189"
      ]
    },
    {
      "hadith_no": "170",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا الحسين بن عيسى، حدثنا عبد الله بن يزيد المقرئ، عن حيوة، - وهو ابن شريح - عن أبي عقيل، عن ابن عمه، عن عقبة بن عامر الجهني، عن النبي صلى الله عليه وسلم نحوه ولم يذكر أمر الرعاية قال عند قوله ‏\"‏ فأحسن الوضوء ‏\"‏ ‏.‏ ثم رفع بصره إلى السماء ‏.‏ فقال وساق الحديث بمعنى حديث معاوية ‏.‏",
      "text_en": " ‘Uqbah b. ‘Amir al-JuhanI narrated this tradition from the Prophet(ﷺ) in a similar way. He did not mention about tending the camels. After the words “and he performed ablution well” he added the words:                      “he then raises his eyes towards the sky”. He transmitted the tradition conveying the same meaning as that of Mu’awiyah.",
      "chain": [
        "23033",
        "26010",
        "189"
      ]
    },
    {
      "hadith_no": "580",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان بن داود المهري، حدثنا ابن وهب، أخبرني يحيى بن أيوب، عن عبد الرحمن بن حرملة، عن أبي علي الهمداني، قال سمعت عقبة بن عامر، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أم الناس فأصاب الوقت فله ولهم ومن انتقص من ذلك شيئا فعليه ولا عليهم ‏\"‏ ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir:                     I heard the Messenger of Allah (ﷺ) say: He who leads the people in prayer, and he does so at the right time, will receive, as well as those who are led (in prayer) will get (the reward). He who delays (prayer) from the appointed time will be responsible (for this delay) and not those who are led in prayer.",
      "chain": [
        "30584",
        "20029",
        "20379",
        "11878",
        "189"
      ]
    },
    {
      "hadith_no": "869",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الربيع بن نافع أبو توبة، وموسى بن إسماعيل، - المعنى - قالا حدثنا ابن المبارك، عن موسى، - قال أبو سلمة موسى بن أيوب - عن عمه، عن عقبة بن عامر، قال لما نزلت ‏{‏ فسبح باسم ربك العظيم ‏}‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ اجعلوها في ركوعكم ‏\"‏ ‏.‏ فلما نزلت ‏{‏ سبح اسم ربك الأعلى ‏}‏ قال ‏\"‏ اجعلوها في سجودكم ‏\"‏ ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir:                     When \"Glorify the name of your mighty Lord\" was revealed, the Messenger of Allah (ﷺ) said: Use it when bowing, and when \"Glorify the name of your most high Lord\" was revealed, he said: Use it when prostrating yourself.",
      "chain": [
        "30335",
        "20040",
        "20025",
        "20040",
        "189"
      ]
    },
    {
      "hadith_no": "870",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا الليث، - يعني ابن سعد - عن أيوب بن موسى، - أو موسى بن أيوب - عن رجل، من قومه عن عقبة بن عامر، بمعناه زاد قال فكان رسول الله صلى الله عليه وسلم إذا ركع قال ‏\"‏ سبحان ربي العظيم وبحمده ‏\"‏ ‏.‏ ثلاثا وإذا سجد قال ‏\"‏ سبحان ربي الأعلى وبحمده ‏\"‏ ‏.‏ ثلاثا ‏.‏ قال أبو داود وهذه الزيادة نخاف أن لا تكون محفوظة ‏.‏ قال أبو داود انفرد أهل مصر بإسناد هذين الحديثين حديث الربيع وحديث أحمد بن يونس ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir:                     The above (No 868) tradition has also been reported through a different chain of narrators by Uqbah ibn Amir to the same effect. This version adds: When the Messenger of Allah (ﷺ) bowed, he said: \"Glory and praise be to my mighty Lord\" three times, and when he prostrated himself, he said: \"Glory and praise be to my most high Lord\" three times.Abu Dawud said: We are afraid the addition of the word \"praise\" is not guarded.",
      "chain": [
        "30184",
        "20023",
        "11241",
        "189"
      ]
    }
  ],
  "total_hadiths": 157
}