{
  "id": "18930",
  "name": "Muhammad bin 'Abdur Rahman bin 'Arq محمد بن عبد الرحمن بن عرق",
  "full_name": "Muhammad bin 'Abdur Rahman bin 'Arq محمد بن عبد الرحمن بن عرق",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Hims"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ بخ  د  س  ق  -  صدوق ]"
    ],
    "tags": [
      "al-Himsi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "3650",
      "name": "'Abdullah bin Basr al-Maazni ( عبد الله بن بسر المازني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "20736",
      "name": "Isma'il bin Ayyash bin Saleem إسماعيل بن عياش بن سليم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20644",
      "name": "Baqiyya bin al-Walid bin Sa'aid بقية بن الوليد بن صائد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "28388",
      "name": "'Uthman bin Sa'id bin Kathir bin Dinar عثمان بن سعيد بن كثير بن دينار",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "27049",
      "name": "Yahya bin Sa'id al-Tar يحيى بن سعيد العطار",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20732",
      "name": "Muhammad bin Shu'aib bin Shabur محمد بن شعيب بن شابور",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-3773",
      "hadith_no": "3773",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا عمرو بن عثمان الحمصي، حدثنا أبي، حدثنا محمد بن عبد الرحمن بن عرق، حدثنا عبد الله بن بسر، قال كان للنبي صلى الله عليه وسلم قصعة يقال لها الغراء يحملها أربعة رجال فلما أضحوا وسجدوا الضحى أتي بتلك القصعة - يعني وقد ثرد فيها - فالتفوا عليها فلما كثروا جثى رسول الله صلى الله عليه وسلم فقال أعرابي ما هذه الجلسة قال النبي صلى الله عليه وسلم ‏\"‏ إن الله جعلني عبدا كريما ولم يجعلني جبارا عنيدا ‏\"‏ ‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ كلوا من حواليها ودعوا ذروتها يبارك فيها ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Busr:                     The Prophet (ﷺ) had a bowl called gharra'. It was carried by four persons. When the sun rose high, and they performed the forenoon prayer, the bowl in which tharid was prepared was brought, and the people gathered round it. When they were numerous, the Messenger of Allah (ﷺ) said: Allah has made me a respectable servant, and He did not make me an obstinate tyrant. The Messenger of Allah (ﷺ) said: Eat from it sides and leave its top, the blessing will be conferred on it",
      "usc_msa_ref": "",
      "chain": [
        "38429",
        "28388",
        "18930",
        "3650"
      ]
    },
    {
      "id": "sunan-ibn-majah-3387",
      "hadith_no": "3387",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا عمرو بن عثمان بن سعيد بن كثير بن دينار الحمصي، حدثنا أبي، أنبأنا محمد بن عبد الرحمن بن عرق، حدثنا عبد الله بن بسر، قال أهديت للنبي  صلى الله عليه وسلم  شاة فجثى رسول الله  صلى الله عليه وسلم  على ركبتيه يأكل فقال أعرابي ما هذه الجلسة فقال ‏\"‏ إن الله جعلني عبدا كريما ولم يجعلني جبارا عنيدا ‏\"‏ ‏.‏",
      "text_en": " ‘Abdullah bin Busr said:                      “I gave the Prophet (ﷺ) a gift of asheep,and the Messenger of Allah (ﷺ) sat on his knees to eat. ABedouinsaid: ‘What is this sitting?’ He said: ‘Allah has mademe a humble andgenerous slave (of Allah) and has not made mearrogant and stubborn.’”",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "4",
        "18930",
        "3650"
      ]
    },
    {
      "id": "sunan-ibn-majah-3493",
      "hadith_no": "3493",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا عمرو بن عثمان بن سعيد بن كثير بن دينار الحمصي، حدثنا أبي، حدثنا محمد بن عبد الرحمن بن عرق، عن أبيه، عن النعمان بن بشير، قال أهدي للنبي  صلى الله عليه وسلم  عنب من الطائف فدعاني فقال ‏\"‏ خذ هذا العنقود فأبلغه أمك ‏\"‏ ‏.‏ فأكلته قبل أن أبلغه إياها فلما كان بعد ليال قال لي ‏\"‏ ما فعل العنقود هل أبلغته أمك ‏\"‏ ‏.‏ قلت لا ‏.‏ قال فسماني غدر ‏.‏",
      "text_en": " It wasnarrated that Nu’man bin Bashir said:                      “The Prophet (ﷺ) wasgiven a gift of some grapes from Ta’if. He called me and said:‘Takethis bunch of grapes and give it to your mother.’ But I ateit beforeI gave it to her. A few night later he said to me: ‘Whathappened tothe bunch of grapes? Did you give it to your mother?’ Isaid: ‘No, Sohe called me treacherous.’”",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "4",
        "18930",
        "274"
      ]
    },
    {
      "id": "sunan-ibn-majah-3818",
      "hadith_no": "3818",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا عمرو بن عثمان بن سعيد بن كثير بن دينار الحمصي، حدثنا أبي، حدثنا محمد بن عبد الرحمن بن عرق، سمعت عبد الله بن بسر، يقول قال النبي  صلى الله عليه وسلم  ‏\"‏ طوبى لمن وجد في صحيفته استغفارا كثيرا ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin Busr said that :                     the Prophet (saas) said: \"Glad tidings to those who find a lot of seeking forgiveness in the record of their deeds.\"",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "4",
        "18930",
        "3650"
      ]
    }
  ],
  "total_hadiths": 4
}