{
  "id": "18988",
  "name": "Muslim bin Salam al-Hanfi مسلم بن سلام الحنفي",
  "full_name": "Muslim bin Salam al-Hanfi مسلم بن سلام الحنفي",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ د  ت  س  -  مقبول ]"
    ],
    "tags": [
      "al-Hanfi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5194",
      "name": "'Ali bin Talq bin al-Mundhir ( علي بن طلق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "205",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير بن عبد الحميد، عن عاصم الأحول، عن عيسى بن حطان، عن مسلم بن سلام، عن علي بن طلق، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا فسا أحدكم في الصلاة فلينصرف فليتوضأ وليعد الصلاة ‏\"‏ ‏.‏",
      "text_en": " Narrated Ali ibn Talq:                     The Messenger of Allah (ﷺ) said: When any of you breaks wind during the prayer, he should turn away and perform ablution and repeat the prayer.",
      "chain": [
        "30203",
        "20028",
        "11080",
        "18988",
        "5194"
      ]
    },
    {
      "hadith_no": "1005",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير بن عبد الحميد، عن عاصم الأحول، عن عيسى بن حطان، عن مسلم بن سلام، عن علي بن طلق، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا فسا أحدكم في الصلاة فلينصرف فليتوضأ وليعد صلاته ‏\"‏ ‏.‏",
      "text_en": " ‘Ali b. Talq reported the Messenger of Allah (ﷺ) as saying:                      When any of you breaks wind during prayer, he must withdraw, perform ablution, and repeat the prayer.",
      "chain": [
        "30203",
        "20028",
        "11080",
        "18988",
        "5194"
      ]
    },
    {
      "hadith_no": "1197",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Suckling - كتاب الرضاع",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن منيع، وهناد، قالا حدثنا أبو معاوية، عن عاصم الأحول، عن عيسى بن حطان، عن مسلم بن سلام، عن علي بن طلق، قال أتى أعرابي النبي صلى الله عليه وسلم فقال يا رسول الله الرجل منا يكون في الفلاة فتكون منه الرويحة ويكون في الماء قلة فقال رسول الله صلى الله عليه وسلم ‏\"‏ إذا فسا أحدكم فليتوضأ ولا تأتوا النساء في أعجازهن فإن الله لا يستحيي من الحق ‏\"‏ ‏.‏ قال وفي الباب عن عمر وخزيمة بن ثابت وابن عباس وأبي هريرة ‏.‏ قال أبو عيسى حديث علي بن طلق حديث حسن ‏.‏ وسمعت محمدا يقول لا أعرف لعلي بن طلق عن النبي صلى الله عليه وسلم غير هذا الحديث الواحد ولا أعرف هذا الحديث من حديث طلق بن علي السحيمي ‏.‏ وكأنه رأى أن هذا رجل آخر من أصحاب النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Ali bin Talq narrated that A Bedouin came to the Prophet and said:                      “O Messenger of Allah! A man among us would be in the desert and a small smell would come from him, (what should he do) while the water is scarce? So the Messenger of Allah said: “When one of you breaks wind then let him perform Wudu, and do not go into your women in their behinds for indeed Allah is not shy of the truth.”",
      "chain": [
        "30242",
        "30480",
        "20354",
        "11080",
        "18988",
        "5194"
      ]
    }
  ],
  "total_hadiths": 3
}