{
  "id": "18995",
  "name": "Muslim bin Yasar al-Juhni مسلم بن يسار الجهني",
  "full_name": "Muslim bin Yasar al-Juhni مسلم بن يسار الجهني",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ د  ت  س  -  مقبول ]"
    ],
    "tags": [
      "al-Juhni"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Maqbool] [ د  ت  س  -  مقبول ]",
        "ar": "Narrator[Grade:Maqbool] [ د  ت  س  -  مقبول ]",
        "ckb": "Narrator[Grade:Maqbool] [ د  ت  س  -  مقبول ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "NA",
        "ar": "NA",
        "ckb": "NA"
      }
    ],
    "tags_display": [
      {
        "en": "al-Juhni",
        "ar": "al-Juhni",
        "ckb": "al-Juhni"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-abi-daud-4703",
      "hadith_no": "4703",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا عبد الله القعنبي، عن مالك، عن زيد بن أبي أنيسة، أن عبد الحميد بن عبد الرحمن بن زيد بن الخطاب، أخبره عن مسلم بن يسار الجهني، أن عمر بن الخطاب، سئل عن هذه الآية، ‏{‏ وإذ أخذ ربك من بني آدم من ظهورهم ‏}‏ قال قرأ القعنبي الآية ‏.‏ فقال عمر سمعت رسول الله صلى الله عليه وسلم سئل عنها فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله عز وجل خلق آدم ثم مسح ظهره بيمينه فاستخرج منه ذرية فقال خلقت هؤلاء للجنة وبعمل أهل الجنة يعملون ثم مسح ظهره فاستخرج منه ذرية فقال خلقت هؤلاء للنار وبعمل أهل النار يعملون ‏\"‏ ‏.‏ فقال رجل يا رسول الله ففيم العمل فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله عز وجل إذا خلق العبد للجنة استعمله بعمل أهل الجنة حتى يموت على عمل من أعمال أهل الجنة فيدخله به الجنة وإذا خلق العبد للنار استعمله بعمل أهل النار حتى يموت على عمل من أعمال أهل النار فيدخله به النار ‏\"‏ ‏.‏",
      "text_en": " Narrated Umar ibn al-Khattab:                     Muslim ibn Yasar al-Juhani said: When Umar ibn al-Khattab was asked about the verse \"When your Lord took their offspring from the backs of the children of Adam\" - al-Qa'nabi recited the verse--he said: I heard the Messenger of Allah (ﷺ) say when he was questioned about it: Allah created Adam, then passed His right hand over his back, and brought forth from it his offspring, saying: I have these for Paradise and these will do the deeds of those who go to Paradise. He then passed His hand over his back and brought forth from it his offspring, saying: I have created these for Hell, and they will do the deeds of those who go to Hell.  A man asked: What is the good of doing anything, Messenger of Allah?  The Messenger of Allah (ﷺ) said: When Allah creates a servant for Paradise, He employs him in doing the deeds of those who will go to Paradise, so that his final action before death is one of the deeds of those who go to Paradise, for which He will bring him into Paradise. But when He creates a servant for Hell, He employs him in doing the deeds of those who will go to Hell, so that his final action before death is one of the deeds of those who go to Hell, for which He will bring him into Hell.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20001",
        "11340",
        "11190",
        "18995",
        "3"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-3355",
      "hadith_no": "3355",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن زيد بن أبي أنيسة، عن عبد الحميد بن عبد الرحمن بن زيد بن الخطاب، عن مسلم بن يسار الجهني، أن عمر بن الخطاب، سئل عن هذه الآية ‏(‏ وإذ أخذ ربك من بني آدم من ظهورهم ذريتهم وأشهدهم على أنفسهم ألست بربكم قالوا بلى شهدنا أن تقولوا يوم القيامة إنا كنا عن هذا غافلين ‏)‏ قال عمر بن الخطاب سمعت رسول الله صلى الله عليه وسلم سئل عنها فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله خلق آدم ثم مسح ظهره بيمينه فاستخرج منه ذرية فقال خلقت هؤلاء للجنة وبعمل أهل الجنة يعملون ثم مسح ظهره فاستخرج منه ذرية فقال خلقت هؤلاء للنار وبعمل أهل النار يعملون ‏\"‏ ‏.‏ فقال رجل يا رسول الله ففيم العمل قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله إذا خلق العبد للجنة استعمله بعمل أهل الجنة حتى يموت على عمل من أعمال أهل الجنة فيدخله الله الجنة وإذا خلق العبد للنار استعمله بعمل أهل النار حتى يموت على عمل من أعمال أهل النار فيدخله الله النار ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ ومسلم بن يسار لم يسمع من عمر وقد ذكر بعضهم في هذا الإسناد بين مسلم بن يسار وبين عمر رجلا مجهولا ‏.‏",
      "text_en": " Narrated Muslim bin Yasar Al-Juhani:                     that 'Umar bin Al-Khattab was asked about this Ayah: And when your Lord brought forth from the Children of Adam, from their loins, their seed and made them testify as to themselves: \"Am I not your Lord?\" They said: \"Yes! We testify,\" lest you should say on the Day of Resurrection: 'Verily, we have been unaware of this (7:172).'\" So 'Umar bin Al-Khattab said: \"I heard the Messenger of Allah (ﷺ) being asked about it. So the Messenger of Allah (ﷺ) said: 'Indeed Allah created Adam, then He wiped his back with His Right Hand, and his offspring came out of him. So he said: \"I created these for Paradise, and they will do the deeds of the people of Paradise.\" Then He wiped his back, and his offspring came out of him. So He said: \"I created these for the Fire, and they will do the deeds of the people of the Fire.\" A man said: 'Then of what good is doing deeds O Messenger of Allah!' The Messenger of Allah (ﷺ) said: 'Verily, when Allah created a man for Paradise, He makes him perform the deeds of the people of Paradise, until he dies doing one of the deeds of the people of Paradise. So Allah will admit him into Paradise. And when He created a man for the Fire, He makes him perform the deeds of the people of the Fire until he dies doing the deeds of the people of the Fire. So Allah will enter him into the Fire.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20280",
        "30112",
        "20001",
        "11340",
        "11190",
        "18995",
        "3"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    }
  ],
  "total_hadiths": 2,
  "grade_display": {
    "en": "Follower (Tabi') [3rd Generation]",
    "ar": "تابعي [الجيل الثالث]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
  }
}