{
  "id": "19",
  "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
  "full_name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "10",
      "date_gregorian": "613",
      "date_display": [
        "10 BH",
        "613 CE"
      ],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "93",
      "date_gregorian": "712",
      "date_display": null,
      "place": "Basrah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medinah",
      "Damascus",
      " Basrah"
    ],
    "area_of_interest": [
      "Tafsir/Quran",
      "Recitation/Quran",
      "Narrator [ ع  -  صحابة ]",
      "Fiqh"
    ],
    "tags": [
      "Ansar",
      "Khazraj",
      "B.'Ady B.al-Najjar",
      "Servant"
    ]
  },
  "parents": [
    {
      "id": "83",
      "name": "Umm Sulaym bint Milhan ( أم سليم بنت ملحان ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "385",
      "name": "al-Bara' bin Malik ( البراء بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "11310",
      "name": "al-Nadr bin Anas bin Malik النضر بن أنس بن مالك الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "14631",
      "name": "'Abdullah bin Anas bin Malik عبد الله بن أنس بن مالك الأنصاري",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "14383",
      "name": "Musa bin Anas bin Malik موسى بن أنس بن مالك",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "2",
      "name": "Abu Bakr Al-Siddique ( أبو بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "48",
      "name": "'Abdullah ibn Rawaha ( عبد الله بن رواحة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "63",
      "name": "Fatima bint Muhammad ( فاطمة الزهراء بنت محمد بن عبد الله ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "239",
      "name": "Thabit bin Qays b. Shammas ( ثابت بن قيس بن الشماس الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "8",
      "name": "'Abdur Rahman Ibn 'Awf ( عبد الرحمن بن عوف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1335",
      "name": "Malik bin Sa'sa'a ( مالك بن صعصعة الأنصاري المازني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "23",
      "name": "Abu Dharr al-Ghaffari ( جندب بن جنادة أبو ذر الغفاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "39",
      "name": "Ubayy ibn Ka'b ( أبي بن كعب بن قيس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "229",
      "name": "Abu Talha Ansari ( أبو طلحة الأنصاري زيد بن سهل بن الأسود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "32",
      "name": "Mu'adh ibn Jabal ( معاذ بن جبل بن عمرو بن أوس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "40",
      "name": "'Ubada bin As-Samit ( عبادة بن الصامت بن قيس بن أصرم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "83",
      "name": "Umm Sulaym bint Milhan ( أم سليم بنت ملحان ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "209",
      "name": "Umm Haram bint Milhan ( أم حرام بنت ملحان ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "156",
      "name": "Umm Fadl Lubaba bint al-Harith ( أم الفضل لبابة بنت الحارث ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11047",
      "name": "Abu Qalaba, 'Abdullah bin Zayd al-Jarmi عبد الله بن زيد بن عمرو",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11313",
      "name": "Lahaaq bin Hameed bin Sa'id لاحق بن حميد بن سعيد أبو مجلز",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11295",
      "name": "'Abdul 'Aziz bin Suhaib عبد العزيز بن صهيب البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11151",
      "name": "Ishaq bin 'Abdullah bin Abi Talha إسحاق بن عبد الله بن أبي طلحة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11267",
      "name": "Bakr bin 'Abdullah al-Mazni بكر بن عبد الله المزني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11269",
      "name": "Thabit bin Aslam Albanani ثابت بن أسلم البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11270",
      "name": "Thmamh bin 'Abdullah ثمامة بن عبد الله بن أنس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11113",
      "name": "Abu 'Uthman al-Nahdi عبد الرحمن بن مل - أبو عثمان النهدي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11035",
      "name": "Ibn Sirin محمد بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11038",
      "name": "Anas bin Sirin أنس بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "405",
      "name": "Abu Umama bin Sahl ( أسعد أبو أمامة بن سهل بن حنيف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11240",
      "name": "Ibrahim bin Maysara al-Ta'ifi إبراهيم بن ميسرة الطائفي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19840",
      "name": "Bryd bin Abi Maryam بريد بن أبي مريم مالك",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11326",
      "name": "Byan bin Bashr al-Ahmsi بيان بن بشر الأحمسي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11162",
      "name": "Rabi'ya bin Abi 'Abdur Rahman ربيعة بن أبي عبد الرحمن - ربيعة الرأي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12154",
      "name": "Salmah bin Wrdan al-Lythy سلمة بن وردان الليثي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "13",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، قال حدثنا يحيى، عن شعبة، عن قتادة، عن أنس  رضى الله عنه  عن النبي صلى الله عليه وسلم‏.‏وعن حسين المعلم، قال حدثنا قتادة، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يؤمن أحدكم حتى يحب لأخيه ما يحب لنفسه ‏\"‏‏.‏",
      "text_en": "      Narrated Anas:                          The Prophet said, \"None of you will have faith till he wishes for his      (Muslim) brother what he likes for himself.\"",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "15",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا يعقوب بن إبراهيم، قال حدثنا ابن علية، عن عبد العزيز بن صهيب، عن أنس، عن النبي صلى الله عليه وسلم ح وحدثنا آدم، قال حدثنا شعبة، عن قتادة، عن أنس، قال قال النبي صلى الله عليه وسلم ‏\"‏ لا يؤمن أحدكم حتى أكون أحب إليه من والده وولده والناس أجمعين ‏\"‏‏.‏",
      "text_en": "      Narrated Anas:                          The Prophet said \"None of you will have faith till he loves me more      than his father, his children and all mankind.\"",
      "chain": [
        "20184",
        "20208",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "16",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثنا عبد الوهاب الثقفي، قال حدثنا أيوب، عن أبي قلابة، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاث من كن فيه وجد حلاوة الإيمان أن يكون الله ورسوله أحب إليه مما سواهما، وأن يحب المرء لا يحبه إلا لله، وأن يكره أن يعود في الكفر كما يكره أن يقذف في النار ‏\"‏‏.‏",
      "text_en": "      Narrated Anas:                          The Prophet said, \"Whoever possesses the following three qualities      will have the sweetness (delight) of faith:     1. The one to whom Allah and His Apostle becomes dearer than anything      else.     2. Who loves a person and he loves him only for Allah's sake.     3. Who hates to revert to Atheism (disbelief) as he hates to be thrown     into the fire.\"",
      "chain": [
        "30170",
        "20259",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "17",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا شعبة، قال أخبرني عبد الله بن عبد الله بن جبر، قال سمعت أنسا، عن النبي صلى الله عليه وسلم قال ‏\"‏ آية الإيمان حب الأنصار، وآية النفاق بغض الأنصار ‏\"‏‏.‏",
      "text_en": "      Narrated Anas:                          The Prophet said, \"Love for the Ansar is a sign of faith and hatred      for the Ansar is a sign of hypocrisy.\"",
      "chain": [
        "20296",
        "20020",
        "11185",
        "19"
      ]
    },
    {
      "hadith_no": "21",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن قتادة، عن أنس  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاث من كن فيه وجد حلاوة الإيمان من كان الله ورسوله أحب إليه مما سواهما، ومن أحب عبدا لا يحبه إلا لله، ومن يكره أن يعود في الكفر بعد إذ أنقذه الله، كما يكره أن يلقى في النار ‏\"‏‏.‏",
      "text_en": "      Narrated Anas:                          The Prophet said, \"Whoever possesses the following three qualities      will taste the sweetness of faith:     1. The one to whom Allah and His Apostle become dearer than anything      else.     2. Who loves a person and he loves him only for Allah's sake.     3. Who hates to revert to disbelief (Atheism) after Allah has brought      (saved) him out from it, as he hates to be thrown in fire.\"",
      "chain": [
        "20193",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "44",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا مسلم بن إبراهيم، قال حدثنا هشام، قال حدثنا قتادة، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ يخرج من النار من قال لا إله إلا الله، وفي قلبه وزن شعيرة من خير، ويخرج من النار من قال لا إله إلا الله، وفي قلبه وزن برة من خير، ويخرج من النار من قال لا إله إلا الله، وفي قلبه وزن ذرة من خير ‏\"‏‏.‏ قال أبو عبد الله قال أبان حدثنا قتادة حدثنا أنس عن النبي صلى الله عليه وسلم ‏\"‏ من إيمان ‏\"‏‏.‏ مكان ‏\"‏ من خير ‏\"‏‏.‏",
      "text_en": "      Narrated Anas:                          The Prophet said, \"Whoever said \"None has the right to be worshipped      but Allah and has in his heart good (faith) equal to the weight of a      barley grain will be taken out of Hell. And whoever said: \"None has      the right to be worshipped but Allah and has in his heart good (faith)     equal to the weight of a wheat grain will be taken out of Hell. And      whoever said, \"None has the right to be worshipped but Allah and has      in his heart good (faith) equal to the weight of an atom will be taken     out of Hell.\"",
      "chain": [
        "20285",
        "20295",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "49",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "أخبرنا قتيبة بن سعيد، حدثنا إسماعيل بن جعفر، عن حميد، عن أنس، قال أخبرني عبادة بن الصامت، أن رسول الله صلى الله عليه وسلم خرج يخبر بليلة القدر، فتلاحى رجلان من المسلمين فقال ‏\"‏ إني خرجت لأخبركم بليلة القدر، وإنه تلاحى فلان وفلان فرفعت وعسى أن يكون خيرا لكم التمسوها في السبع والتسع والخمس ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                           \"Allah's Apostle went out to inform the people about the (date of the)     night of decree (Al-Qadr) but there happened a quarrel between two      Muslim men. The Prophet said, \"I came out to inform you about (the      date of) the night of Al-Qadr, but as so and so and so and so      quarrelled, its knowledge was taken away (I forgot it) and maybe it      was better for you. Now look for it in the 7th, the 9th and the 5th      (of the last 10 nights of the month of Ramadan).\"",
      "chain": [
        "30367",
        "20155",
        "11279",
        "19",
        "40"
      ]
    },
    {
      "hadith_no": "63",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبد الله بن يوسف، قال حدثنا الليث، عن سعيد  هو المقبري  عن شريك بن عبد الله بن أبي نمر، أنه سمع أنس بن مالك، يقول بينما نحن جلوس مع النبي صلى الله عليه وسلم في المسجد، دخل رجل على جمل فأناخه في المسجد، ثم عقله، ثم قال لهم أيكم محمد والنبي صلى الله عليه وسلم متكئ بين ظهرانيهم‏.‏ فقلنا هذا الرجل الأبيض المتكئ‏.‏ فقال له الرجل ابن عبد المطلب فقال له النبي صلى الله عليه وسلم ‏\"‏ قد أجبتك ‏\"‏‏.‏ فقال الرجل للنبي صلى الله عليه وسلم إني سائلك فمشدد عليك في المسألة فلا تجد على في نفسك‏.‏ فقال ‏\"‏ سل عما بدا لك ‏\"‏‏.‏ فقال أسألك بربك ورب من قبلك، آلله أرسلك إلى الناس كلهم فقال ‏\"‏ اللهم نعم ‏\"‏‏.‏ قال أنشدك بالله، آلله أمرك أن نصلي الصلوات الخمس في اليوم والليلة قال ‏\"‏ اللهم نعم ‏\"‏‏.‏ قال أنشدك بالله، آلله أمرك أن نصوم هذا الشهر من السنة قال ‏\"‏ اللهم نعم ‏\"‏‏.‏ قال أنشدك بالله، آلله أمرك أن تأخذ هذه الصدقة من أغنيائنا فتقسمها على فقرائنا فقال النبي صلى الله عليه وسلم ‏\"‏ اللهم نعم ‏\"‏‏.‏ فقال الرجل آمنت بما جئت به، وأنا رسول من ورائي من قومي، وأنا ضمام بن ثعلبة أخو بني سعد بن بكر‏.‏ رواه موسى وعلي بن عبد الحميد عن سليمان عن ثابت عن أنس عن النبي صلى الله عليه وسلم بهذا‏.‏",
      "text_en": " Narrated Anas bin Malik:                     While we were sitting with the Prophet in the mosque, a man came riding on a camel. He made his camel kneel down in the mosque, tied its foreleg and then said: \"Who amongst you is Muhammad?\" At that time the Prophet was sitting amongst us (his companions) leaning on his arm. We replied, \"This white man reclining on his arm.\" The man then addressed him, \"O Son of `Abdul Muttalib.\" The Prophet said, \"I am here to answer your questions.\" The man said to the Prophet, \"I want to ask you something and will be hard in questioning. So do not get angry.\" The Prophet said, \"Ask whatever you want.\" The man said, \"I ask you by your Lord, and the Lord of those who were before you, has Allah sent you as an Apostle to all the mankind?\" The Prophet replied, \"By Allah, yes.\" The man further said, \"I ask you by Allah. Has Allah ordered you to offer five prayers in a day and night (24 hours).? He replied, \"By Allah, Yes.\" The man further said, \"I ask you by Allah! Has Allah ordered you to observe fasts during this month of the year (i.e. Ramadan)?\" He replied, \"By Allah, Yes.\" The man further said, \"I ask you by Allah. Has Allah ordered you to take Zakat (obligatory charity) from our rich people and distribute it amongst our poor people?\" The Prophet replied, \"By Allah, yes.\" Thereupon that man said, \"I have believed in all that with which you have been sent, and I have been sent by my people as a messenger, and I am Dimam bin Tha`laba from the brothers of Bani Sa`d bin Bakr.\"",
      "chain": [
        "30355",
        "20023",
        "11168",
        "11858",
        "19"
      ]
    },
    {
      "hadith_no": "65",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن مقاتل أبو الحسن، أخبرنا عبد الله، قال أخبرنا شعبة، عن قتادة، عن أنس بن مالك، قال كتب النبي صلى الله عليه وسلم كتابا  أو أراد أن يكتب  فقيل له إنهم لا يقرءون كتابا إلا مختوما‏.‏ فاتخذ خاتما من فضة نقشه محمد رسول الله‏.‏ كأني أنظر إلى بياضه في يده‏.‏ فقلت لقتادة من قال نقشه محمد رسول الله قال أنس‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Once the Prophet wrote a letter or had an idea of writing a letter. The Prophet was told that they (rulers) would not read letters unless they were sealed. So the Prophet got a silver ring made with \"Muhammad Allah's Apostle\" engraved on it. As if I were just observing its white glitter in the hand of the Prophet.",
      "chain": [
        "30118",
        "20025",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "69",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا يحيى بن سعيد، قال حدثنا شعبة، قال حدثني أبو التياح، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ يسروا ولا تعسروا، وبشروا ولا تنفروا ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"Facilitate things to people (concerning religious matters), and do not make it hard for them and give them good tidings and do not make them run away (from Islam).",
      "chain": [
        "30160",
        "20031",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "80",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عمران بن ميسرة، قال حدثنا عبد الوارث، عن أبي التياح، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من أشراط الساعة أن يرفع العلم، ويثبت الجهل، ويشرب الخمر، ويظهر الزنا ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle said, \"From among the portents of the Hour are (the following): -1. Religious knowledge will be taken away (by the death of Religious learned men). -2. (Religious) ignorance will prevail. -3. Drinking of Alcoholic drinks (will be very common). -4. There will be prevalence of open illegal sexual intercourse.",
      "chain": [
        "30156",
        "20258",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "81",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا مسدد، قال حدثنا يحيى، عن شعبة، عن قتادة، عن أنس، قال لأحدثنكم حديثا لا يحدثكم أحد بعدي سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من أشراط الساعة أن يقل العلم، ويظهر الجهل، ويظهر الزنا، وتكثر النساء ويقل الرجال، حتى يكون لخمسين امرأة القيم الواحد ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     I will narrate to you a Hadith and none other than I will tell you about after it. I heard Allah's Apostle saying: From among the portents of the Hour are (the following): -1. Religious knowledge will decrease (by the death of religious learned men). -2. Religious ignorance will prevail. -3. There will be prevalence of open illegal sexual intercourse. -4. Women will increase in number and men will decrease in number so much so that fifty women will be looked after by one man.",
      "chain": [
        "30175",
        "20031",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "93",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو اليمان، قال أخبرنا شعيب، عن الزهري، قال أخبرني أنس بن مالك، أن رسول الله صلى الله عليه وسلم خرج، فقام عبد الله بن حذافة فقال من أبي فقال ‏\"‏ أبوك حذافة ‏\"‏‏.‏ ثم أكثر أن يقول ‏\"‏ سلوني ‏\"‏‏.‏ فبرك عمر على ركبتيه فقال رضينا بالله ربا، وبالإسلام دينا، وبمحمد صلى الله عليه وسلم نبيا، فسكت‏.‏",
      "text_en": " Narrated Anas bin Malik:                     One day Allah's Apostle came out (before the people) and `Abdullah bin Hudhafa stood up and asked (him) \"Who is my father?\" The Prophet replied, \"Your father is Hudhafa.\" The Prophet told them repeatedly (in anger) to ask him anything they liked. `Umar knelt down before the Prophet and said thrice, \"We accept Allah as (our) Lord and Islam as (our) religion and Muhammad as (our) Prophet.\" After that the Prophet became silent.",
      "chain": [
        "30330",
        "20428",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "94",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبدة، قال حدثنا عبد الصمد، قال حدثنا عبد الله بن المثنى، قال حدثنا ثمامة بن عبد الله، عن أنس، عن النبي صلى الله عليه وسلم أنه كان إذا سلم سلم ثلاثا، وإذا تكلم بكلمة أعادها ثلاثا‏.‏",
      "text_en": " Narrated Anas:                     Whenever the Prophet asked permission to enter, he knocked the door thrice with greeting and whenever he spoke a sentence (said a thing) he used to repeat it thrice. (See Hadith No. 261, Vol. 8).",
      "chain": [
        "20337",
        "20250",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "95",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبدة بن عبد الله، حدثنا عبد الصمد، قال حدثنا عبد الله بن المثنى، قال حدثنا ثمامة بن عبد الله، عن أنس، عن النبي صلى الله عليه وسلم أنه كان إذا تكلم بكلمة أعادها ثلاثا حتى تفهم عنه، وإذا أتى على قوم فسلم عليهم سلم عليهم ثلاثا‏.‏",
      "text_en": " Narrated Anas:                     Whenever the Prophet spoke a sentence (said a thing), he used to repeat it thrice so that the people could understand it properly from him and whenever he asked permission to enter, (he knocked the door) thrice with greeting.",
      "chain": [
        "30149",
        "20250",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "108",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو معمر، قال حدثنا عبد الوارث، عن عبد العزيز، قال أنس إنه ليمنعني أن أحدثكم حديثا كثيرا أن النبي صلى الله عليه وسلم قال ‏\"‏ من تعمد على كذبا فليتبوأ مقعده من النار ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The fact which stops me from narrating a great number of Hadiths to you is that the Prophet said: \"Whoever tells a lie against me intentionally, then (surely) let him occupy his seat in Hell-fire.\"",
      "chain": [
        "30315",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "128",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا إسحاق بن إبراهيم، قال حدثنا معاذ بن هشام، قال حدثني أبي، عن قتادة، قال حدثنا أنس بن مالك، أن النبي صلى الله عليه وسلم ومعاذ رديفه على الرحل قال ‏\"‏ يا معاذ بن جبل ‏\"‏‏.‏ قال لبيك يا رسول الله وسعديك‏.‏ قال ‏\"‏ يا معاذ ‏\"‏‏.‏ قال لبيك يا رسول الله وسعديك‏.‏ ثلاثا‏.‏ قال ‏\"‏ ما من أحد يشهد أن لا إله إلا الله وأن محمدا رسول الله صدقا من قلبه إلا حرمه الله على النار ‏\"‏‏.‏ قال يا رسول الله، أفلا أخبر به الناس فيستبشروا قال ‏\"‏ إذا يتكلوا ‏\"‏‏.‏ وأخبر بها معاذ عند موته تأثما ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"Once Mu`adh was along with Allah's Apostle as a companion rider. Allah's Apostle said, \"O Mu`adh bin Jabal.\" Mu`adh replied, \"Labbaik and Sa`daik. O Allah's Apostle!\" Again the Prophet said, \"O Mu`adh!\" Mu`adh said thrice, \"Labbaik and Sa`daik, O Allah's Apostle!\" Allah's Apostle said, \"There is none who testifies sincerely that none has the right to be worshipped but Allah and Muhammad is his Apostle, except that Allah, will save him from the Hell-fire.\" Mu`adh said, \"O Allah's Apostle ! Should I not inform the people about it so that they may have glad tidings?\" He replied, \"When the people hear about it, they will solely depend on it.\" Then Mu`adh narrated the above-mentioned Hadith just before his death, being afraid of committing sin (by not telling the knowledge).",
      "chain": [
        "30123",
        "20287",
        "20295",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "129",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا مسدد، قال حدثنا معتمر، قال سمعت أبي قال، سمعت أنسا، قال ذكر لي أن النبي صلى الله عليه وسلم قال لمعاذ ‏\"‏ من لقي الله لا يشرك به شيئا دخل الجنة ‏\"‏‏.‏ قال ألا أبشر الناس قال ‏\"‏ لا، إني أخاف أن يتكلوا ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     I was informed that the Prophet had said to Mu`adh, \"Whosoever will meet Allah without associating anything in worship with Him will go to Paradise.\" Mu`adh asked the Prophet, \"Should I not inform the people of this good news?\" The Prophet replied, \"No, I am afraid, lest they should depend upon it (absolutely).",
      "chain": [
        "30175",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "142",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، عن عبد العزيز بن صهيب، قال سمعت أنسا، يقول كان النبي صلى الله عليه وسلم إذا دخل الخلاء قال ‏\"‏ اللهم إني أعوذ بك من الخبث والخبائث ‏\"‏‏.‏ تابعه ابن عرعرة عن شعبة‏.‏ وقال غندر عن شعبة إذا أتى الخلاء‏.‏ وقال موسى عن حماد إذا دخل‏.‏ وقال سعيد بن زيد حدثنا عبد العزيز إذا أراد أن يدخل‏.‏",
      "text_en": " Narrated Anas:                     Whenever the Prophet went to answer the call of nature, he used to say, \"Allah-umma inni a`udhu bika minal khubuthi wal khaba'ith i.e. O Allah, I seek Refuge with You from all offensive and wicked things (evil deeds and evil spirits).",
      "chain": [
        "20404",
        "20020",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "150",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو الوليد، هشام بن عبد الملك قال حدثنا شعبة، عن أبي معاذ  واسمه عطاء بن أبي ميمونة  قال سمعت أنس بن مالك، يقول كان النبي صلى الله عليه وسلم إذا خرج لحاجته أجيء أنا وغلام معنا إداوة من ماء‏.‏ يعني يستنجي به‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Whenever Allah's Apostle went to answer the call of nature, I along with another boy used to accompany him with a tumbler full of water. (Hisham commented, \"So that he might wash his private parts with it.)\"",
      "chain": [
        "20296",
        "20020",
        "11601",
        "19"
      ]
    },
    {
      "hadith_no": "151",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن أبي معاذ  هو عطاء بن أبي ميمونة  قال سمعت أنسا، يقول كان رسول الله صلى الله عليه وسلم إذا خرج لحاجته تبعته أنا وغلام منا معنا إداوة من ماء‏.‏",
      "text_en": " Narrated Anas:                     Whenever Allah's Apostle went to answer the call of nature, I along with another boy from us used to go behind him with a tumbler full of water.",
      "chain": [
        "20193",
        "20020",
        "11601",
        "19"
      ]
    },
    {
      "hadith_no": "152",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، عن عطاء بن أبي ميمونة، سمع أنس بن مالك، يقول كان رسول الله صلى الله عليه وسلم يدخل الخلاء، فأحمل أنا وغلام إداوة من ماء، وعنزة، يستنجي بالماء‏.‏ تابعه النضر وشاذان عن شعبة‏.‏ العنزة عصا عليه زج‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Whenever Allah's Apostle went to answer the call of nature, I along with another boy used to carry a tumbler full of water (for cleaning the private parts) and a short spear (or stick).",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11601",
        "19"
      ]
    },
    {
      "hadith_no": "169",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، أنه قال رأيت رسول الله صلى الله عليه وسلم وحانت صلاة العصر، فالتمس الناس الوضوء فلم يجدوه، فأتي رسول الله صلى الله عليه وسلم بوضوء، فوضع رسول الله صلى الله عليه وسلم في ذلك الإناء يده، وأمر الناس أن يتوضئوا منه‏.‏ قال فرأيت الماء ينبع من تحت أصابعه حتى توضئوا من عند آخرهم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     saw Allah's Apostle when the `Asr prayer was due and the people searched for water to perform ablution but they could not find it. Later on (a pot full of) water for ablution was brought to Allah's Apostle . He put his hand in that pot and ordered the people to perform ablution from it. I saw the water springing out from underneath his fingers till all of them performed the ablution (it was one of the miracles of the Prophet).",
      "chain": [
        "30355",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "171",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن عبد الرحيم، قال أخبرنا سعيد بن سليمان، قال حدثنا عباد، عن ابن عون، عن ابن سيرين، عن أنس، أن رسول الله صلى الله عليه وسلم لما حلق رأسه كان أبو طلحة أول من أخذ من شعره‏.‏",
      "text_en": " Narrated Anas:                     When Allah's Apostle got his head shaved, Abu- Talha was the first to take some of his hair.",
      "chain": [
        "30272",
        "30252",
        "20431",
        "11071",
        "11035",
        "19"
      ]
    },
    {
      "hadith_no": "195",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن منير، سمع عبد الله بن بكر، قال حدثنا حميد، عن أنس، قال حضرت الصلاة، فقام من كان قريب الدار إلى أهله، وبقي قوم، فأتي رسول الله صلى الله عليه وسلم بمخضب من حجارة فيه ماء، فصغر المخضب أن يبسط فيه كفه، فتوضأ القوم كلهم‏.‏ قلنا كم كنتم قال ثمانين وزيادة‏.‏",
      "text_en": " Narrated Anas:                     It was the time for prayer, and those whose houses were near got up and went to their people (to perform ablution), and there remained some people (sitting). Then a painted stove pot (Mikhdab) containing water was brought to Allah's Apostles The pot was small, not broad enough for one to spread one's hand in; yet all the people performed ablution. (The sub narrator said, \"We asked Anas, 'How many persons were you?' Anas replied 'We were eighty or more\"). (It was one of the miracles of Allah's Apostle).",
      "chain": [
        "30353",
        "20244",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "200",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا مسدد، قال حدثنا حماد، عن ثابت، عن أنس، أن النبي صلى الله عليه وسلم دعا بإناء من ماء، فأتي بقدح رحراح فيه شىء من ماء، فوضع أصابعه فيه‏.‏ قال أنس فجعلت أنظر إلى الماء ينبع من بين أصابعه، قال أنس فحزرت من توضأ ما بين السبعين إلى الثمانين‏.‏",
      "text_en": " Narrated Thabit:                     Anas said, \"The Prophet asked for water and a tumbler with a broad base and no so deep, containing a small quantity of water, was brought to him whereby he put his fingers in it.\" Anas further said, ' noticed the water springing out from amongst his fingers.\" Anas added, ' estimated that the people who performed ablution with it numbered between seventy to eighty.\"",
      "chain": [
        "30175",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "201",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا مسعر، قال حدثني ابن جبر، قال سمعت أنسا، يقول كان النبي صلى الله عليه وسلم يغسل  أو كان يغتسل  بالصاع إلى خمسة أمداد، ويتوضأ بالمد‏.‏",
      "text_en": " Narrated Anas:                     The Prophet used to take a bath with one Sa` up to five Mudds (1 Sa` = [??] Mudds) of water and used to perform ablution with one Mudd of water.",
      "chain": [
        "20348",
        "20359",
        "11185",
        "19"
      ]
    },
    {
      "hadith_no": "213",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو معمر، قال حدثنا عبد الوارث، حدثنا أيوب، عن أبي قلابة، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا نعس أحدكم في الصلاة فلينم حتى يعلم ما يقرأ ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"If anyone of you feels drowsy while praying, he should sleep till he understands what he is saying (reciting).",
      "chain": [
        "30315",
        "20258",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "214",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن يوسف، قال حدثنا سفيان، عن عمرو بن عامر، قال سمعت أنسا، ح قال وحدثنا مسدد، قال حدثنا يحيى، عن سفيان، قال حدثني عمرو بن عامر، عن أنس، قال كان النبي صلى الله عليه وسلم يتوضأ عند كل صلاة‏.‏ قلت كيف كنتم تصنعون قال يجزئ أحدنا الوضوء ما لم يحدث‏.‏",
      "text_en": " Narrated `Amr bin `Amir:                     Anas said, \"The Prophet used to perform ablution for every prayer.\" I asked Anas, \"What did you used to do?' Anas replied, \"We used to pray with the same ablution until we break it with Hadath.\"",
      "chain": [
        "30388",
        "20005",
        "15406",
        "19",
        "30175",
        "20031",
        "20012",
        "15406",
        "19"
      ]
    },
    {
      "hadith_no": "217",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا يعقوب بن إبراهيم، قال حدثنا إسماعيل بن إبراهيم، قال حدثني روح بن القاسم، قال حدثني عطاء بن أبي ميمونة، عن أنس بن مالك، قال كان النبي صلى الله عليه وسلم إذا تبرز لحاجته أتيته بماء فيغسل به‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Whenever the Prophet went to answer the call of nature, I used to bring water with which he used to clean his private parts.",
      "chain": [
        "20184",
        "20208",
        "11586",
        "11601",
        "19"
      ]
    },
    {
      "hadith_no": "219",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا همام، أخبرنا إسحاق، عن أنس بن مالك، أن النبي صلى الله عليه وسلم رأى أعرابيا يبول في المسجد فقال ‏\"‏ دعوه ‏\"‏‏.‏ حتى إذا فرغ دعا بماء فصبه عليه‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet saw a Bedouin making water in the mosque and told the people not to disturb him. When he finished, the Prophet asked for some water and poured it over (the urine).",
      "chain": [
        "20040",
        "20297",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "221",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبدان، قال أخبرنا عبد الله، قال أخبرنا يحيى بن سعيد، قال سمعت أنس بن مالك، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said as above (219).",
      "chain": [
        "30349",
        "20025",
        "11062",
        "19"
      ]
    },
    {
      "hadith_no": "221",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا خالد، قال حدثنا سليمان، عن يحيى بن سعيد، قال سمعت أنس بن مالك، قال جاء أعرابي فبال في طائفة المسجد، فزجره الناس، فنهاهم النبي صلى الله عليه وسلم، فلما قضى بوله أمر النبي صلى الله عليه وسلم بذنوب من ماء، فأهريق عليه‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A Bedouin came and passed urine in one corner of the mosque. The people shouted at him but the Prophet stopped them till he finished urinating. The Prophet ordered them to spill a bucket of water over that place and they did so.",
      "chain": [
        "20423",
        "20160",
        "11062",
        "19"
      ]
    },
    {
      "hadith_no": "233",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن أنس، قال قدم أناس من عكل أو عرينة، فاجتووا المدينة، فأمرهم النبي صلى الله عليه وسلم بلقاح، وأن يشربوا من أبوالها وألبانها، فانطلقوا، فلما صحوا قتلوا راعي النبي صلى الله عليه وسلم واستاقوا النعم، فجاء الخبر في أول النهار، فبعث في آثارهم، فلما ارتفع النهار جيء بهم، فأمر فقطع أيديهم وأرجلهم، وسمرت أعينهم، وألقوا في الحرة يستسقون فلا يسقون‏.‏ قال أبو قلابة فهؤلاء سرقوا وقتلوا وكفروا بعد إيمانهم، وحاربوا الله ورسوله‏.‏",
      "text_en": " Narrated Abu Qilaba:                     Anas said, \"Some people of `Ukl or `Uraina tribe came to Medina and its climate did not suit them. So the Prophet ordered them to go to the herd of (Milch) camels and to drink their milk and urine (as a medicine). So they went as directed and after they became healthy, they killed the shepherd of the Prophet and drove away all the camels. The news reached the Prophet early in the morning and he sent (men) in their pursuit and they were captured and brought at noon. He then ordered to cut their hands and feet (and it was done), and their eyes were branded with heated pieces of iron, They were put in 'Al-Harra' and when they asked for water, no water was given to them.\" Abu Qilaba said, \"Those people committed theft and murder, became infidels after embracing Islam and fought against Allah and His Apostle .\"",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "234",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، قال أخبرنا أبو التياح، يزيد بن حميد عن أنس، قال كان النبي صلى الله عليه وسلم يصلي قبل أن يبنى المسجد في مرابض الغنم‏.‏",
      "text_en": " Narrated Anas:                     Prior to the construction of the mosque, the Prophet offered the prayers at sheep-folds.",
      "chain": [
        "20404",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "241",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن يوسف، قال حدثنا سفيان، عن حميد، عن أنس، قال بزق النبي صلى الله عليه وسلم في ثوبه‏.‏ طوله ابن أبي مريم قال أخبرنا يحيى بن أيوب حدثني حميد قال سمعت أنسا عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas:                     The Prophet once spat in his clothes.",
      "chain": [
        "30388",
        "20005",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "264",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا شعبة، عن عبد الله بن عبد الله بن جبر، قال سمعت أنس بن مالك، يقول كان النبي صلى الله عليه وسلم والمرأة من نسائه يغتسلان من إناء واحد‏.‏ زاد مسلم ووهب عن شعبة من الجنابة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet and one of his wives used to take a bath from a single pot of water. (Shu`ba added to Anas' Statement \"After the Janaba\").",
      "chain": [
        "20296",
        "20020",
        "11185",
        "19"
      ]
    },
    {
      "hadith_no": "268",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا معاذ بن هشام، قال حدثني أبي، عن قتادة، قال حدثنا أنس بن مالك، قال كان النبي صلى الله عليه وسلم يدور على نسائه في الساعة الواحدة من الليل والنهار، وهن إحدى عشرة‏.‏ قال قلت لأنس أوكان يطيقه قال كنا نتحدث أنه أعطي قوة ثلاثين‏.‏ وقال سعيد عن قتادة إن أنسا حدثهم تسع نسوة‏.‏",
      "text_en": " Narrated Qatada:                     Anas bin Malik said, \"The Prophet used to visit all his wives in a round, during the day and night and they were eleven in number.\" I asked Anas, \"Had the Prophet the strength for it?\" Anas replied, \"We used to say that the Prophet was given the strength of thirty (men).\" And Sa`id said on the authority of Qatada that Anas had told him about nine wives only (not eleven).",
      "chain": [
        "30160",
        "20287",
        "20295",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "284",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الأعلى بن حماد، قال حدثنا يزيد بن زريع، قال حدثنا سعيد، عن قتادة، أن أنس بن مالك، حدثهم أن نبي الله صلى الله عليه وسلم كان يطوف على نسائه في الليلة الواحدة، وله يومئذ تسع نسوة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet used to visit all his wives in one night and he had nine wives at that time.",
      "chain": [
        "30146",
        "20304",
        "11288",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "318",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا مسدد، قال حدثنا حماد، عن عبيد الله بن أبي بكر، عن أنس بن مالك، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله  عز وجل  وكل بالرحم ملكا يقول يا رب نطفة، يا رب علقة، يا رب مضغة‏.‏ فإذا أراد أن يقضي خلقه قال أذكر أم أنثى شقي أم سعيد فما الرزق والأجل فيكتب في بطن أمه ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"At every womb Allah appoints an angel who says, 'O Lord! A drop of semen, O Lord! A clot. O Lord! A little lump of flesh.\" Then if Allah wishes (to complete) its creation, the angel asks, (O Lord!) Will it be a male or female, a wretched or a blessed, and how much will his provision be? And what will his age be?' So all that is written while the child is still in the mother's womb.\"",
      "chain": [
        "30175",
        "20022",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "349",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا يحيى بن بكير، قال حدثنا الليث، عن يونس، عن ابن شهاب، عن أنس بن مالك، قال كان أبو ذر يحدث أن رسول الله صلى الله عليه وسلم قال ‏\"‏ فرج عن سقف بيتي وأنا بمكة، فنزل جبريل ففرج صدري، ثم غسله بماء زمزم، ثم جاء بطست من ذهب ممتلئ حكمة وإيمانا، فأفرغه في صدري ثم أطبقه، ثم أخذ بيدي فعرج بي إلى السماء الدنيا، فلما جئت إلى السماء الدنيا قال جبريل لخازن السماء افتح‏.‏ قال من هذا قال هذا جبريل‏.‏ قال هل معك أحد قال نعم معي محمد صلى الله عليه وسلم‏.‏ فقال أرسل إليه قال نعم‏.‏ فلما فتح علونا السماء الدنيا، فإذا رجل قاعد على يمينه أسودة وعلى يساره أسودة، إذا نظر قبل يمينه ضحك، وإذا نظر قبل يساره بكى، فقال مرحبا بالنبي الصالح والابن الصالح‏.‏ قلت لجبريل من هذا قال هذا آدم‏.‏ وهذه الأسودة عن يمينه وشماله نسم بنيه، فأهل اليمين منهم أهل الجنة، والأسودة التي عن شماله أهل النار، فإذا نظر عن يمينه ضحك، وإذا نظر قبل شماله بكى، حتى عرج بي إلى السماء الثانية فقال لخازنها افتح‏.‏ فقال له خازنها مثل ما قال الأول ففتح ‏\"‏‏.‏ قال أنس فذكر أنه وجد في السموات آدم وإدريس وموسى وعيسى وإبراهيم  صلوات الله عليهم  ولم يثبت كيف منازلهم، غير أنه ذكر أنه وجد آدم في السماء الدنيا، وإبراهيم في السماء السادسة‏.‏ قال أنس فلما مر جبريل بالنبي صلى الله عليه وسلم بإدريس قال مرحبا بالنبي الصالح والأخ الصالح‏.‏ فقلت من هذا قال هذا إدريس‏.‏ ثم مررت بموسى فقال مرحبا بالنبي الصالح والأخ الصالح‏.‏ قلت من هذا قال هذا موسى‏.‏ ثم مررت بعيسى فقال مرحبا بالأخ الصالح والنبي الصالح‏.‏ قلت من هذا قال هذا عيسى‏.‏ ثم مررت بإبراهيم فقال مرحبا بالنبي الصالح والابن الصالح‏.‏ قلت من هذا قال هذا إبراهيم صلى الله عليه وسلم ‏\"‏‏.‏ قال ابن شهاب فأخبرني ابن حزم أن ابن عباس وأبا حبة الأنصاري كانا يقولان قال النبي صلى الله عليه وسلم ‏\"‏ ثم عرج بي حتى ظهرت لمستوى أسمع فيه صريف الأقلام ‏\"‏‏.‏ قال ابن حزم وأنس بن مالك قال النبي صلى الله عليه وسلم ‏\"‏ ففرض الله على أمتي خمسين صلاة، فرجعت بذلك حتى مررت على موسى فقال ما فرض الله لك على أمتك قلت فرض خمسين صلاة‏.‏ قال فارجع إلى ربك، فإن أمتك لا تطيق ذلك‏.‏ فراجعت فوضع شطرها، فرجعت إلى موسى قلت وضع شطرها‏.‏ فقال راجع ربك، فإن أمتك لا تطيق، فراجعت فوضع شطرها، فرجعت إليه فقال ارجع إلى ربك، فإن أمتك لا تطيق ذلك، فراجعته‏.‏ فقال هي خمس وهى خمسون، لا يبدل القول لدى‏.‏ فرجعت إلى موسى فقال راجع ربك‏.‏ فقلت استحييت من ربي‏.‏ ثم انطلق بي حتى انتهى بي إلى سدرة المنتهى، وغشيها ألوان لا أدري ما هي، ثم أدخلت الجنة، فإذا فيها حبايل اللؤلؤ، وإذا ترابها المسك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhar:                     Allah's Apostle said, \"While I was at Mecca the roof of my house was opened and Gabriel descended, opened my chest, and washed it with Zamzam water. Then he brought a golden tray full of wisdom and faith and having poured its contents into my chest, he closed it. Then he took my hand and ascended with me to the nearest heaven, when I reached the nearest heaven, Gabriel said to the gatekeeper of the heaven, 'Open (the gate).' The gatekeeper asked, 'Who is it?' Gabriel answered: 'Gabriel.' He asked, 'Is there anyone with you?' Gabriel replied, 'Yes, Muhammad I is with me.' He asked, 'Has he been called?' Gabriel said, 'Yes.' So the gate was opened and we went over the nearest heaven and there we saw a man sitting with some people on his right and some on his left. When he looked towards his right, he laughed and when he looked toward his left he wept. Then he said, 'Welcome! O pious Prophet and pious son.' I asked Gabriel, 'Who is he?' He replied, 'He is Adam and the people on his right and left are the souls of his offspring. Those on his right are the people of Paradise and those on his left are the people of Hell and when he looks towards his right he laughs and when he looks towards his left he weeps.' Then he ascended with me till he reached the second heaven and he (Gabriel) said to its gatekeeper, 'Open (the gate).' The gatekeeper said to him the same as the gatekeeper of the first heaven had said and he opened the gate. Anas said: \"Abu Dhar added that the Prophet met Adam, Idris, Moses, Jesus and Abraham, he (Abu Dhar) did not mention on which heaven they were but he mentioned that he (the Prophet ) met Adam on the nearest heaven and Abraham on the sixth heaven. Anas said, \"When Gabriel along with the Prophet passed by Idris, the latter said, 'Welcome! O pious Prophet and pious brother.' The Prophet asked, 'Who is he?' Gabriel replied, 'He is Idris.\" The Prophet added, \"I passed by Moses and he said, 'Welcome! O pious Prophet and pious brother.' I asked Gabriel, 'Who is he?' Gabriel replied, 'He is Moses.' Then I passed by Jesus and he said, 'Welcome! O pious brother and pious Prophet.' I asked, 'Who is he?' Gabriel replied, 'He is Jesus. Then I passed by Abraham and he said, 'Welcome! O pious Prophet and pious son.' I asked Gabriel, 'Who is he?' Gabriel replied, 'He is Abraham. The Prophet added, 'Then Gabriel ascended with me to a place where I heard the creaking of the pens.\" Ibn Hazm and Anas bin Malik said: The Prophet said, \"Then Allah enjoined fifty prayers on my followers when I returned with this order of Allah, I passed by Moses who asked me, 'What has Allah enjoined on your followers?' I replied, 'He has enjoined fifty prayers on them.' Moses said, 'Go back to your Lord (and appeal for reduction) for your followers will not be able to bear it.' (So I went back to Allah and requested for reduction) and He reduced it to half. When I passed by Moses again and informed him about it, he said, 'Go back to your Lord as your followers will not be able to bear it.' So I returned to Allah and requested for further reduction and half of it was reduced. I again passed by Moses and he said to me: 'Return to your Lord, for your followers will not be able to bear it. So I returned to Allah and He said, 'These are five prayers and they are all (equal to) fifty (in reward) for My Word does not change.' I returned to Moses and he told me to go back once again. I replied, 'Now I feel shy of asking my Lord again.' Then Gabriel took me till we '' reached Sidrat-il-Muntaha (Lote tree of; the utmost boundary) which was shrouded in colors, indescribable. Then I was admitted into Paradise where I found small (tents or) walls (made) of pearls and its earth was of musk.\"",
      "chain": [
        "30399",
        "20023",
        "20475",
        "11013",
        "19",
        "23"
      ]
    },
    {
      "hadith_no": "371",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا يعقوب بن إبراهيم، قال حدثنا إسماعيل ابن علية، قال حدثنا عبد العزيز بن صهيب، عن أنس، أن رسول الله صلى الله عليه وسلم غزا خيبر، فصلينا عندها صلاة الغداة بغلس، فركب نبي الله صلى الله عليه وسلم وركب أبو طلحة، وأنا رديف أبي طلحة، فأجرى نبي الله صلى الله عليه وسلم في زقاق خيبر، وإن ركبتي لتمس فخذ نبي الله صلى الله عليه وسلم، ثم حسر الإزار عن فخذه حتى إني أنظر إلى بياض فخذ نبي الله صلى الله عليه وسلم، فلما دخل القرية قال ‏\"‏ الله أكبر، خربت خيبر، إنا إذا نزلنا بساحة قوم فساء صباح المنذرين ‏\"‏‏.‏ قالها ثلاثا‏.‏ قال وخرج القوم إلى أعمالهم فقالوا محمد  قال عبد العزيز وقال بعض أصحابنا  والخميس‏.‏ يعني الجيش، قال فأصبناها عنوة، فجمع السبى، فجاء دحية فقال يا نبي الله، أعطني جارية من السبى‏.‏ قال ‏\"‏ اذهب فخذ جارية ‏\"‏‏.‏ فأخذ صفية بنت حيى، فجاء رجل إلى النبي صلى الله عليه وسلم فقال يا نبي الله، أعطيت دحية صفية بنت حيى سيدة قريظة والنضير، لا تصلح إلا لك‏.‏ قال ‏\"‏ ادعوه بها ‏\"‏‏.‏ فجاء بها، فلما نظر إليها النبي صلى الله عليه وسلم قال ‏\"‏ خذ جارية من السبى غيرها ‏\"‏‏.‏ قال فأعتقها النبي صلى الله عليه وسلم وتزوجها‏.‏ فقال له ثابت يا أبا حمزة، ما أصدقها قال نفسها، أعتقها وتزوجها، حتى إذا كان بالطريق جهزتها له أم سليم فأهدتها له من الليل، فأصبح النبي صلى الله عليه وسلم عروسا فقال ‏\"‏ من كان عنده شىء فليجئ به ‏\"‏‏.‏ وبسط نطعا، فجعل الرجل يجيء بالتمر، وجعل الرجل يجيء بالسمن  قال وأحسبه قد ذكر السويق  قال فحاسوا حيسا، فكانت وليمة رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Abdul `Aziz:                     Anas said, 'When Allah's Apostle invaded Khaibar, we offered the Fajr prayer there yearly in the morning) when it was still dark. The Prophet rode and Abu Talha rode too and I was riding behind Abu Talha. The Prophet passed through the lane of Khaibar quickly and my knee was touching the thigh of the Prophet . He uncovered his thigh and I saw the whiteness of the thigh of the Prophet. When he entered the town, he said, 'Allahu Akbar! Khaibar is ruined. Whenever we approach near a (hostile) nation (to fight) then evil will be the morning of those who have been warned.' He repeated this thrice. The people came out for their jobs and some of them said, 'Muhammad (has come).' (Some of our companions added, \"With his army.\") We conquered Khaibar, took the captives, and the booty was collected. Dihya came and said, 'O Allah's Prophet! Give me a slave girl from the captives.' The Prophet said, 'Go and take any slave girl.' He took Safiya bint Huyai. A man came to the Prophet and said, 'O Allah's Apostles! You gave Safiya bint Huyai to Dihya and she is the chief mistress of the tribes of Quraidha and An-Nadir and she befits none but you.' So the Prophet said, 'Bring him along with her.' So Dihya came with her and when the Prophet saw her, he said to Dihya, 'Take any slave girl other than her from the captives.' Anas added: The Prophet then manumitted her and married her.\" Thabit asked Anas, \"O Abu Hamza! What did the Prophet pay her (as Mahr)?\" He said, \"Her self was her Mahr for he manumitted her and then married her.\" Anas added, \"While on the way, Um Sulaim dressed her for marriage (ceremony) and at night she sent her as a bride to the Prophet . So the Prophet was a bridegroom and he said, 'Whoever has anything (food) should bring it.' He spread out a leather sheet (for the food) and some brought dates and others cooking butter. (I think he (Anas) mentioned As-Sawaq). So they prepared a dish of Hais (a kind of meal). And that was Walima (the marriage banquet) of Allah's Apostle .\"",
      "chain": [
        "20184",
        "20208",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "374",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو معمر عبد الله بن عمرو، قال حدثنا عبد الوارث، قال حدثنا عبد العزيز بن صهيب، عن أنس، كان قرام لعائشة سترت به جانب بيتها فقال النبي صلى الله عليه وسلم ‏\"‏ أميطي عنا قرامك هذا، فإنه لا تزال تصاويره تعرض في صلاتي ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     `Aisha had a Qiram (a thin marked woolen curtain) with which he had screened one side of her home. The Prophet said, \"Take away this Qiram of yours, as its pictures are still displayed in front of me during my prayer (i.e. they divert my attention from the prayer).",
      "chain": [
        "30350",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "378",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن عبد الرحيم، قال حدثنا يزيد بن هارون، قال أخبرنا حميد الطويل، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم سقط عن فرسه، فجحشت ساقه أو كتفه، وآلى من نسائه شهرا، فجلس في مشربة له، درجتها من جذوع، فأتاه أصحابه يعودونه، فصلى بهم جالسا، وهم قيام فلما سلم قال ‏\"‏ إنما جعل الإمام ليؤتم به، فإذا كبر فكبروا، وإذا ركع فاركعوا، وإذا سجد فاسجدوا، وإن صلى قائما فصلوا قياما ‏\"‏‏.‏ ونزل لتسع وعشرين فقالوا يا رسول الله إنك آليت شهرا فقال ‏\"‏ إن الشهر تسع وعشرون ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Once Allah's Apostle fell off a horse and his leg or shoulder got injured. He swore that he would not go to his wives for one month and he stayed in a Mashruba [??] (attic room) having stairs made of date palm trunks. So his companions came to visit him, and he led them in prayer sitting, whereas his companions were standing. When he finished the prayer, he said, \"Imam is meant to be followed, so when he says 'Allahu Akbar,' say 'Allahu Akbar' and when he bows, bow and when he prostrates, prostrate and if he prays standing pray, standing. After the 29th day the Prophet came down (from the attic room) and the people asked him, \"O Allah's Apostle! You swore that you will not go to your wives for one month.\" He said, \"The month is 29 days.\"",
      "chain": [
        "30272",
        "20472",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "380",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله، قال أخبرنا مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، أن جدته، مليكة دعت رسول الله صلى الله عليه وسلم لطعام صنعته له، فأكل منه ثم قال ‏\"‏ قوموا فلأصل لكم ‏\"‏‏.‏ قال أنس فقمت إلى حصير لنا قد اسود من طول ما لبس، فنضحته بماء، فقام رسول الله صلى الله عليه وسلم وصففت واليتيم وراءه، والعجوز من ورائنا، فصلى لنا رسول الله صلى الله عليه وسلم ركعتين ثم انصرف‏.‏",
      "text_en": " Narrated 'Is-haq:                     Anas bin Malik said, \"My grandmother Mulaika invited Allah's Apostle for a meal which she herself had prepared. He ate from it and said, 'Get up! I will lead you in the prayer.' \" Anas added, \"I took my Hasir, washed it with water as it had become dark because of long use and Allah's Apostle stood on it. The orphan (Damira or Ruh) and I aligned behind him and the old lady (Mulaika) stood behind us. Allah's Apostle led us in the prayer and offered two rak`at and then left.\"",
      "chain": [
        "20025",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "385",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو الوليد، هشام بن عبد الملك قال حدثنا بشر بن المفضل، قال حدثني غالب القطان، عن بكر بن عبد الله، عن أنس بن مالك، قال كنا نصلي مع النبي صلى الله عليه وسلم فيضع أحدنا طرف الثوب من شدة الحر في مكان السجود‏.‏",
      "text_en": " Narrated Anas bin Malik:                     We used to pray with the Prophet and some of us used to place the ends of their clothes at the place of prostration because of scorching heat.",
      "chain": [
        "20296",
        "20212",
        "11299",
        "11267",
        "19"
      ]
    },
    {
      "hadith_no": "391",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عمرو بن عباس، قال حدثنا ابن المهدي، قال حدثنا منصور بن سعد، عن ميمون بن سياه، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صلى صلاتنا، واستقبل قبلتنا، وأكل ذبيحتنا، فذلك المسلم الذي له ذمة الله وذمة رسوله، فلا تخفروا الله في ذمته ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle said, \"Whoever prays like us and faces our Qibla and eats our slaughtered animals is a Muslim and is under Allah's and His Apostle's protection. So do not betray Allah by betraying those who are in His protection.\"",
      "chain": [
        "30152",
        "20033",
        "20289",
        "11614",
        "19"
      ]
    },
    {
      "hadith_no": "392",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا نعيم، قال حدثنا ابن المبارك، عن حميد الطويل، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله‏.‏ فإذا قالوها وصلوا صلاتنا، واستقبلوا قبلتنا، وذبحوا ذبيحتنا، فقد حرمت علينا دماؤهم وأموالهم إلا بحقها، وحسابهم على الله ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle said, \"I have been ordered to fight the people till they say: 'None has the right to be worshipped but Allah.' And if they say so, pray like our prayers, face our Qibla and slaughter as we slaughter, then their blood and property will be sacred to us and we will not interfere with them except legally and their reckoning will be with Allah.\"",
      "chain": [
        "30238",
        "20025",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "393",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "قال ابن أبي مريم أخبرنا يحيى، حدثنا حميد، حدثنا أنس، عن النبي صلى الله عليه وسلم‏.‏ وقال علي بن عبد الله حدثنا خالد بن الحارث قال حدثنا حميد قال سأل ميمون بن سياه أنس بن مالك قال يا أبا حمزة، ما يحرم دم العبد وماله فقال من شهد أن لا إله إلا الله، واستقبل قبلتنا، وصلى صلاتنا، وأكل ذبيحتنا، فهو المسلم، له ما للمسلم، وعليه ما على المسلم‏.‏",
      "text_en": " Narrated Maimun bin Siyah that he asked Anas bin Malik, \"O Abu Hamza! What makes the life and property of a person sacred?\" He replied, \"Whoever says, 'None has the right to be worshipped but Allah', faces our Qibla during the prayers, prays like us and eats our slaughtered animal, then he is a Muslim, and has got the same rights and obligations as other Muslims have.\"",
      "chain": [
        "30232",
        "30020",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "402",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عمرو بن عون، قال حدثنا هشيم، عن حميد، عن أنس، قال قال عمر وافقت ربي في ثلاث، فقلت يا رسول الله لو اتخذنا من مقام إبراهيم مصلى فنزلت ‏{‏واتخذوا من مقام إبراهيم مصلى‏}‏ وآية الحجاب قلت يا رسول الله، لو أمرت نساءك أن يحتجبن، فإنه يكلمهن البر والفاجر‏.‏ فنزلت آية الحجاب، واجتمع نساء النبي صلى الله عليه وسلم في الغيرة عليه فقلت لهن عسى ربه إن طلقكن أن يبدله أزواجا خيرا منكن‏.‏ فنزلت هذه الآية‏.‏",
      "text_en": " Narrated `Umar (bin Al-Khattab):                     My Lord agreed with me in three things: -1. I said, \"O Allah's Apostle, I wish we took the station of Abraham as our praying place (for some of our prayers). So came the Divine Inspiration: And take you (people) the station of Abraham as a place of prayer (for some of your prayers e.g. two rak`at of Tawaf of Ka`ba)\". (2.125) -2. And as regards the (verse of) the veiling of the women, I said, 'O Allah's Apostle! I wish you ordered your wives to cover themselves from the men because good and bad ones talk to them.' So the verse of the veiling of the women was revealed. -3. Once the wives of the Prophet made a united front against the Prophet and I said to them, 'It may be if he (the Prophet) divorced you, (all) that his Lord (Allah) will give him instead of you wives better than you.' So this verse (the same as I had said) was revealed.\" (66.5).",
      "chain": [
        "30154",
        "20468",
        "11279",
        "19"
      ]
    }
  ],
  "total_hadiths": 2551
}