{
  "id": "19031",
  "name": "al-Mughira bin Sby' المغيرة بن سبيع",
  "full_name": "al-Mughira bin Sby' المغيرة بن سبيع",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ت  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-'Ajli"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5202",
      "name": "'Amr bin Hurayth bin 'Amr bin 'Uthman ( عمرو بن حريث بن عمرو بن عثمان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11317",
      "name": "Yazid bin Hameed, Abu Tiyah يزيد بن حميد أبو التياح الضبعي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10776",
      "name": "Darar bin Marra, Abu Sinan ضرار بن مرة الكوفي أبو سنان الشيباني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11641",
      "name": "'Urwa bin al-Harith عروة بن الحارث",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2237",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن بشار، وأحمد بن منيع، قالا حدثنا روح بن عبادة، حدثنا سعيد بن أبي عروبة، عن أبي التياح، عن المغيرة بن سبيع، عن عمرو بن حريث، عن أبي بكر الصديق، قال حدثنا رسول الله صلى الله عليه وسلم قال ‏\"‏ الدجال يخرج من أرض بالمشرق يقال لها خراسان يتبعه أقوام كأن وجوههم المجان المطرقة ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي هريرة وعائشة ‏.‏ وهذا حديث حسن غريب ‏.‏ وقد رواه عبد الله بن شوذب وغير واحد عن أبي التياح ولا نعرفه إلا من حديث أبي التياح ‏.‏",
      "text_en": " Abu Bakr As-Siddiq said:                     \"The Messenger of Allah(s.a.w) narrated to us, saying: 'The Dajjal shall emerge from a land in the east called Khurasan. He is followed by a people whom appear as if their f aces are shields coated with leather. '\"",
      "chain": [
        "30160",
        "30242",
        "20229",
        "11073",
        "11317",
        "19031",
        "5202",
        "2"
      ]
    },
    {
      "hadith_no": "2033",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرني محمد بن قدامة، قال حدثنا جرير، عن أبي فروة، عن المغيرة بن سبيع، حدثني عبد الله بن بريدة، عن أبيه، ‏:‏ أنه كان في مجلس فيه رسول الله صلى الله عليه وسلم فقال ‏:‏ ‏\"‏ إني كنت نهيتكم أن تأكلوا لحوم الأضاحي إلا ثلاثا، فكلوا وأطعموا وادخروا ما بدا لكم، وذكرت لكم أن لا تنتبذوا في الظروف الدباء والمزفت والنقير والحنتم، انتبذوا فيما رأيتم واجتنبوا كل مسكر، ونهيتكم عن زيارة القبور فمن أراد أن يزور فليزر، ولا تقولوا هجرا ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin Buraidah narrated from his father:                     That he was in a gathering where the Messenger of Allah was present and he said: \"I used to forbid you to eat the sacrificial mea for more than three days, but now eat it, give it to others and store it for as long as you want. And I told you not to make Nabidh in these containers: Ad-Dubba', Al-Muzaqqat, An-Naqir, and Al-Hantam. But now make Nabidh in whatever you want, but avoid everything that intoxicates. And I forbade you to visit graves, but now whoever want to visit them, let him do so, but do not utter anything which is not suitable.\"",
      "chain": [
        "20028",
        "11653",
        "19031",
        "11432"
      ]
    },
    {
      "hadith_no": "4210",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا نصر بن علي الجهضمي، ومحمد بن بشار، ومحمد بن المثنى، قالوا حدثنا روح بن عبادة، حدثنا سعيد بن أبي عروبة، عن أبي التياح، عن المغيرة بن سبيع، عن عمرو بن حريث، عن أبي بكر الصديق، قال حدثنا رسول الله  صلى الله عليه وسلم  ‏\"‏ أن الدجال يخرج من أرض بالمشرق يقال لها خراسان يتبعه أقوام كأن وجوههم المجان المطرقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Bakr Siddiq said:                      \"The Messenger ofAllah(ﷺ) told us: 'Dajjal will emerge in a land in the east calledKhorasan, and will be followed by people with faces like hammeredshields.'\"",
      "chain": [
        "30395",
        "30160",
        "30170",
        "20229",
        "11073",
        "11317",
        "19031",
        "5202",
        "2"
      ]
    }
  ],
  "total_hadiths": 3
}