{
  "id": "19091",
  "name": "Nmran bin Jaryh bin Zfr نمران بن جارية",
  "full_name": "Nmran bin Jaryh bin Zfr نمران بن جارية",
  "grade": "Follower(Tabi') [4th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Unknown-Majhool] [ ق  -  مجهول ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "2343",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن الصباح، وعمار بن خالد الواسطي، قالا حدثنا أبو بكر بن عياش، عن دهثم بن قران، عن نمران بن جارية، عن أبيه، أن قوما، اختصموا إلى النبي صلى الله عليه وسلم في خص كان بينهم فبعث حذيفة يقضي بينهم فقضى للذين يليهم القمط فلما رجع إلى النبي صلى الله عليه وسلم أخبره فقال ‏\"‏ أصبت وأحسنت ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Nimran bin Jariyah, from his father, that :                     some people referred a dispute to the Prophet (ﷺ) about a hut, so that he could judge between them. He sent Hudhaifah to judge between them, and he ruled in favor of those who had the rope (with which the hut was blinded together). When he went back to the Prophet (ﷺ) he told him (what he had done) and he said: “You did the right thing, and you did well.”",
      "chain": [
        "30269",
        "38417",
        "20373",
        "19091"
      ]
    },
    {
      "hadith_no": "2738",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن الصباح، وعمار بن خالد الواسطي، حدثنا أبو بكر بن عياش، عن دهثم بن قران، حدثني نمران بن جارية، عن أبيه، أن رجلا، ضرب رجلا على ساعده بالسيف فقطعها من غير مفصل فاستعدى عليه النبي صلى الله عليه وسلم فأمر له بالدية فقال يا رسول الله إني أريد القصاص ‏.‏ فقال ‏\"‏ خذ الدية بارك الله لك فيها ‏\"‏ ‏.‏ ولم يقض له بالقصاص ‏.‏",
      "text_en": " Nimran bin Jariyah narrated from his father that :                     a man struck another man on the wrist with his sword and severed it, not at the joint. He appealed to the Prophet (ﷺ) who ordered that the Diyah be paid. The man said: “O Messenger of Allah (ﷺ), I want retaliation.” He said: “Take the compensation and may Allah bless you therein.” And he did not rule that he be allowed retaliation.",
      "chain": [
        "30269",
        "38417",
        "20373",
        "19091"
      ]
    }
  ],
  "total_hadiths": 2
}