{
  "id": "19124",
  "name": "Waqd bin Abi Waqd واقد بن أبي واقد الليثي",
  "full_name": "Waqd bin Abi Waqd واقد بن أبي واقد الليثي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "No Doubt",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:No Doubt] [ د  -  صحبة ]"
    ],
    "tags": [
      "al-Laithi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [
    {
      "id": "11163",
      "name": "Zayd bin Aslam زيد بن أسلم",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "479",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا حامد بن عمر، عن بشر، حدثنا عاصم، حدثنا واقد، عن أبيه، عن ابن عمر، أو ابن عمرو شبك النبي صلى الله عليه وسلم أصابعه‏.‏",
      "text_en": " Narrated Ibn `Umar or Ibn `Amr:                     The Prophet clasped his hands, by interlacing his fingers.",
      "chain": [
        "30128",
        "20212",
        "11080",
        "19124"
      ]
    },
    {
      "hadith_no": "480",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "وقال عاصم بن علي حدثنا عاصم بن محمد، سمعت هذا الحديث، من أبي فلم أحفظه، فقومه لي واقد عن أبيه، قال سمعت أبي وهو، يقول قال عبد الله قال رسول الله صلى الله عليه وسلم ‏\"‏ يا عبد الله بن عمرو، كيف بك إذا بقيت في حثالة من الناس بهذا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     That Allah's Apostle said, \"O `Abdullah bin `Amr! What will be your condition when you will be left with the sediments of (worst) people?\" (They will be in conflict with each other).",
      "chain": [
        "20430",
        "20163",
        "19124",
        "16"
      ]
    },
    {
      "hadith_no": "3760",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "أخبرني عبد الله بن عبد الوهاب، حدثنا خالد، حدثنا شعبة، عن واقد، قال سمعت أبي يحدث، عن ابن عمر، عن أبي بكر  رضى الله عنهم  قال ارقبوا محمدا صلى الله عليه وسلم في أهل بيته‏.‏",
      "text_en": " Abu Bakr:                      Look at      Muhammad through his family (i.e. if you are no good to his family you     are not good to him).",
      "chain": [
        "30143",
        "20423",
        "20020",
        "19124",
        "18",
        "2"
      ]
    },
    {
      "hadith_no": "7164",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، أخبرني واقد، عن أبيه، عن ابن عمر، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ لا ترجعوا بعدي كفارا، يضرب بعضكم رقاب بعض ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     I heard the Prophet saying, \"Do not revert to disbelief after me by striking (cutting) the necks of one another.\"",
      "chain": [
        "20219",
        "20020",
        "19124",
        "18"
      ]
    },
    {
      "hadith_no": "1044",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا قتيبة، حدثنا الليث بن سعد، عن يحيى بن سعيد، عن واقد، وهو ابن عمرو بن سعد بن معاذ عن نافع بن جبير، عن مسعود بن الحكم، عن علي بن أبي طالب، أنه ذكر القيام في الجنائز حتى توضع فقال علي قام رسول الله صلى الله عليه وسلم ثم قعد ‏.‏ وفي الباب عن الحسن بن علي وابن عباس ‏.‏ قال أبو عيسى حديث علي حديث حسن صحيح ‏.‏ وفيه رواية أربعة من التابعين بعضهم عن بعض ‏.‏ والعمل على هذا عند بعض أهل العلم ‏.‏ قال الشافعي وهذا أصح شيء في هذا الباب ‏.‏ وهذا الحديث ناسخ للحديث الأول ‏\"‏ إذا رأيتم الجنازة فقوموا ‏\"‏ ‏.‏ وقال أحمد إن شاء قام وإن شاء لم يقم ‏.‏ واحتج بأن النبي صلى الله عليه وسلم قد روي عنه أنه قام ثم قعد ‏.‏ وهكذا قال إسحاق بن إبراهيم ‏.‏ قال أبو عيسى معنى قول علي قام رسول الله صلى الله عليه وسلم في الجنازة ثم قعد ‏.‏ يقول كان رسول الله صلى الله عليه وسلم إذا رأى الجنازة قام ثم ترك ذلك بعد فكان لا يقوم إذا رأى الجنازة ‏.‏",
      "text_en": " Mas'ud bin Al-Hakim narrated that standing for the funeral (procession) until it is put down was mentioned, and 'Ali bin Abi Talib mentioned and 'Ali bin Abi Talib said:                      \"The Messenger of Allah (ﷺ) stood, then (later) he sat\". (Sahih)There are narrations on this topic from Al-Hasan bin 'Ali, and Ibn 'Abbas. Abu Eisa said: The Hadith of 'Ali is a Hasan Sahih Hadith, regarding which there are narrations from four of the Tabi'in narrating it from each other. This is acted upon according to some of the people of knowledge. Ash-Shafi'i said: \"This is the most correct thing on this topic\" This Hadith abrogates first Hadith: \"Whenever you see a funeral (procession), stand up [for it].\"Ahmad said: \"If he wants, he stands, and if he wants, he does not stand.\" His proof is that it has been reported that the Prophet (ﷺ) stood, then sat, and this is what Ishaq bin Ibrahim said.(Abu Eisa said:) As for the saying of 'Ali: The Prophet (ﷺ) stood for the funeral and then sat, he means that the Prophet (ﷺ) would stand when he saw a funeral (procession), then he did not do so later, so he would not stand when he saw the funeral (procession).",
      "chain": [
        "30367",
        "20023",
        "11062",
        "19124",
        "11059",
        "5"
      ]
    },
    {
      "hadith_no": "1999",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن يحيى، عن واقد، عن نافع بن جبير، عن مسعود بن الحكم، عن علي بن أبي طالب، ‏:‏ أنه ذكر القيام على الجنازة حتى توضع، فقال علي بن أبي طالب ‏:‏ قام رسول الله صلى الله عليه وسلم ثم قعد ‏.‏",
      "text_en": " It was narrated from 'Ali bin Abi Talib that:                     mention was made of standing at the funeral until the body is placed in the grave. 'Ali bin Abi Talib said: \"The Messenger of Allah stood, then he sat down.\"",
      "chain": [
        "30367",
        "20023",
        "20031",
        "19124",
        "11059"
      ]
    }
  ],
  "total_hadiths": 6
}