{
  "id": "19159",
  "name": "Yahya bin Abi al-Mta' يحيى بن أبي المطاع القرشي الأردني",
  "full_name": "Yahya bin Abi al-Mta' يحيى بن أبي المطاع القرشي الأردني",
  "grade": "Follower(Tabi')",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Jordon"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ق  بن  ماجة]"
    ],
    "tags": [
      "Quraish",
      "Jordan"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5172",
      "name": "'Arbad bin Sariyya al-Salmi ( عرباض بن سارية السلمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "20399",
      "name": "'Abdullah bin al-'Ala' عبد الله بن العلاء بن زبر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10947",
      "name": "'Ata' bin Abi Muslim عطاء بن أبي مسلم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19130",
      "name": "al-Walid bin Sulaiman bin Aby الوليد بن سليمان بن أبي السائب القرشي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-ibn-majah-44",
      "hadith_no": "44",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا عبد الله بن أحمد بن بشير بن ذكوان الدمشقي، حدثنا الوليد بن مسلم، حدثنا عبد الله بن العلاء، - يعني ابن زبر - حدثني يحيى بن أبي المطاع، قال سمعت العرباض بن سارية، يقول قام فينا رسول الله  صلى الله عليه وسلم  ذات يوم فوعظنا موعظة بليغة وجلت منها القلوب وذرفت منها العيون فقيل يا رسول الله وعظتنا موعظة مودع فاعهد إلينا بعهد فقال ‏\"‏ عليكم بتقوى الله والسمع والطاعة وإن عبدا حبشيا وسترون من بعدي اختلافا شديدا فعليكم بسنتي وسنة الخلفاء الراشدين المهديين عضوا عليها بالنواجذ وإياكم والأمور المحدثات فإن كل بدعة ضلالة ‏\"‏ ‏.‏",
      "text_en": " Yahya bin Abu Muta' said:                     I heard 'Irbad bin Sariyah say: 'One day, the Messenger of Allah (ﷺ) stood up among us and delivered a deeply moving speech to us that melted our hearts and caused our eyes to overflow with tears. It was said to him: 'O Messenger of Allah, you have delivered a speech of farewell, so enjoin something upon us.' He said: 'I urge you to fear Allah, and to listen and obey, even if (your leader) is an Abyssinian slave. After I am gone, you will see great conflict. I urge you to adhere to my Sunnah and the path of the Rightly-Guided Caliphs, and cling stubbornly to it. And beware of newly-invented matters, for every innovation is a going astray.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20733",
        "20399",
        "19159",
        "5172"
      ]
    }
  ],
  "total_hadiths": 1
}