{
  "id": "19154",
  "name": "Yahya bin Abi 'Amr يحيى بن أبي عمرو السيباني",
  "full_name": "Yahya bin Abi 'Amr يحيى بن أبي عمرو السيباني",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "No Doubt",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "148",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Hims"
    ],
    "area_of_interest": [
      "Narrator[Grade:No Doubt] [ بخ  د  س  ق  -  صحابة ]"
    ],
    "tags": [
      "al-Himsi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "17080",
      "name": "al-Walid bin Sufyan bin Aby الوليد بن سفيان بن أبي مريم الغساني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "17145",
      "name": "Rwh bin Znba' al-Jdhamy روح بن زنباع الجذامي",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "5136",
      "name": "'Abdullah bin al-Dayli ( عبد الله بن فيروز الديلمي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "14204",
      "name": "'Abdullah bin Bjyr عبد الله بن بجير",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "2022",
      "name": "'Abdur Rahman bin Khalid bin al-Walid ( عبد الرحمن بن خالد بن الوليد المخزومي ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "18802",
      "name": "'Amr bin 'Abdullah عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11667",
      "name": "Ibrahim bin Abi Ablh إبراهيم بن أبي عبلة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20738",
      "name": "Dmrh bin Rabi'ya al-Flstyny ضمرة بن ربيعة الفلسطيني أبو عبد الله",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "28258",
      "name": "'Asim bin Hkym Abu عاصم بن حكيم أبو محمد بن أخت",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20732",
      "name": "Muhammad bin Shu'aib bin Shabur محمد بن شعيب بن شابور",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "22024",
      "name": "Isma'il bin Rafa'i bin Awymr إسماعيل بن رافع بن عويمر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20732",
      "name": "Muhammad bin Shu'aib bin Shabur محمد بن شعيب بن شابور",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-39",
      "hadith_no": "39",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا حيوة بن شريح الحمصي، حدثنا ابن عياش، عن يحيى بن أبي عمرو السيباني، عن عبد الله بن الديلمي، عن عبد الله بن مسعود، قال قدم وفد الجن على رسول الله صلى الله عليه وسلم فقالوا يا محمد انه أمتك أن يستنجوا بعظم أو روثة أو حممة فإن الله تعالى جعل لنا فيها رزقا ‏.‏ قال فنهى النبي صلى الله عليه وسلم عن ذلك ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     A deputation of the jinn came to the Prophet (ﷺ) and said: O Muhammad, forbid your community to cleans themselves with a bone or dung or charcoal, for in them Allah has provided sustenance for us.  So the Prophet (ﷺ) forbade them to do so.",
      "usc_msa_ref": "",
      "chain": [
        "26010",
        "19154",
        "5136",
        "16"
      ]
    },
    {
      "id": "sunan-abi-daud-2527",
      "hadith_no": "2527",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عبد الله بن وهب، أخبرني عاصم بن حكيم، عن يحيى بن أبي عمرو السيباني، عن عبد الله بن الديلمي، أن يعلى بن منية، قال ‏:‏ آذن رسول الله صلى الله عليه وسلم بالغزو وأنا شيخ كبير ليس لي خادم، فالتمست أجيرا يكفيني وأجري له سهمه، فوجدت رجلا، فلما دنا الرحيل أتاني فقال ‏:‏ ما أدري ما السهمان وما يبلغ سهمي فسم لي شيئا كان السهم أو لم يكن ‏.‏ فسميت له ثلاثة دنانير، فلما حضرت غنيمته أردت أن أجري له سهمه، فذكرت الدنانير، فجئت النبي صلى الله عليه وسلم فذكرت له أمره، فقال ‏:‏ ‏\"‏ ما أجد له في غزوته هذه في الدنيا والآخرة إلا دنانيره التي سمى ‏\"‏ ‏.‏",
      "text_en": " Narrated Ya'la ibn Munyah:                     The Messenger of Allah (ﷺ) announced an expedition, and I was a very old man and I had no servant. I, therefore, sought a hireling who would serve instead of me, and I would give him his portion. So I found a man. When the time of departure arrived, he came to me and said: I do not know what would be the portions, and how much would be my portion. So offer something (as wages) to me, whether there would be any portion or not. I offered three dinars (as his wages) for him. When some booty arrived, I wanted to offer him his portion. But I remembered the dinars, so I went to the Prophet (ﷺ) and mentioned the matter to him. He said: All I can find for him regarding this expedition of his in this world and the next is three dinars which were offered him.",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "20029",
        "28258",
        "19154",
        "5136"
      ]
    },
    {
      "id": "sunan-abi-daud-2567",
      "hadith_no": "2567",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا ابن عياش، عن يحيى بن أبي عمرو السيباني، عن ابن أبي مريم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إياكم أن تتخذوا ظهور دوابكم منابر فإن الله إنما سخرها لكم لتبلغكم إلى بلد لم تكونوا بالغيه إلا بشق الأنفس وجعل لكم الأرض فعليها فاقضوا حاجتكم ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Prophet(ﷺ) as saying “Do not treat the backs of your beasts as pulpits, for Allaah has made them subject to you only to convey you to a town which you cannot reach without difficulty and He has appointed the earth (a floor to work) for you, so conduct your business on it.",
      "usc_msa_ref": "",
      "chain": [
        "38363",
        "19154",
        "30232",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-3665",
      "hadith_no": "3665",
      "source": "Sunan Abi Da'ud",
      "chapter": "Knowledge (Kitab Al-Ilm) - كتاب العلم",
      "chapter_no": "26",
      "text_ar": "حدثنا محمود بن خالد، حدثنا أبو مسهر، حدثني عباد بن عباد الخواص، عن يحيى بن أبي عمرو السيباني، عن عمرو بن عبد الله السيباني، عن عوف بن مالك الأشجعي، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يقص إلا أمير أو مأمور أو مختال ‏\"‏ ‏.‏",
      "text_en": " Narrated Awf ibn Malik al-Ashja'i:                     I heard the Messenger of Allah (ﷺ) say: Only a ruler, or one put in charge, or one who is presumptuous, gives instructions.",
      "usc_msa_ref": "",
      "chain": [
        "37534",
        "30284",
        "20243",
        "19154",
        "18802",
        "3051"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2642-2",
      "hadith_no": "2642",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا الحسن بن عرفة، حدثنا إسماعيل بن عياش، عن يحيى بن أبي عمرو السيباني، عن عبد الله بن الديلمي، قال سمعت عبد الله بن عمرو، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الله عز وجل خلق خلقه في ظلمة فألقى عليهم من نوره فمن أصابه من ذلك النور اهتدى ومن أخطأه ضل فلذلك أقول جف القلم على علم الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Amr:                     that the Messenger of Allah (ﷺ) said: \"Indeed Allah, the Blessed and Exalted, created His creation in darkness, then He cast His Light upon them, so whoever is touched by that light he is guided, and whoever is not, he goes astray. It is for this reason that I say that the pens have dried with Allah's knowledge.\"",
      "usc_msa_ref": "",
      "chain": [
        "36540",
        "20736",
        "19154",
        "5136",
        "29"
      ]
    }
  ],
  "total_hadiths": 5
}