{
  "id": "19173",
  "name": "Yazid bin Sharih al-Hadrami يزيد بن شريح الحضرمي الحمصي",
  "full_name": "Yazid bin Sharih al-Hadrami يزيد بن شريح الحضرمي الحمصي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Hims"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ بخ  د  ت  ق  -  مقبول ]"
    ],
    "tags": [
      "al-Hadrami",
      "al-Himsi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "130",
      "name": "Thawban bin Bujdud ( ثوبان مولى رسول الله صلى الله عليه وسلم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "405",
      "name": "Abu Umama bin Sahl ( أسعد أبو أمامة بن سهل بن حنيف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18410",
      "name": "Shdad bin Hy Abu شداد بن حي أبو حي الحمصي المؤذن",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "4058",
      "name": "Ka'b al-Ahbar ( كعب الأحبار ,كعب بن ماتع الحميري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "20415",
      "name": "Thaur bin Yazid al-Rahbi ثور بن يزيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28090",
      "name": "Habib bin Salah حبيب بن صالح",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10901",
      "name": "Hudayr bin Karayb Abu al-Zahriyya حدير بن كريب أبو الزاهرية",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18366",
      "name": "al-Sfr bin Nsyr al-Azdy al-Hmsy السفر بن نسير",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10978",
      "name": "Yahya bin Jabir al-Tai'i يحيى بن جابر الطائي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20459",
      "name": "Muhammad bin al-Walid al-Zubaidi محمد بن الوليد بن عامر الزبيدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "90",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا ابن عياش، عن حبيب بن صالح، عن يزيد بن شريح الحضرمي، عن أبي حى المؤذن، عن ثوبان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاث لا يحل لأحد أن يفعلهن لا يؤم رجل قوما فيخص نفسه بالدعاء دونهم فإن فعل فقد خانهم ولا ينظر في قعر بيت قبل أن يستأذن فإن فعل فقد دخل ولا يصلي وهو حقن حتى يتخفف ‏\"‏ ‏.‏",
      "text_en": " Narrated Thawban:                     The Messenger of Allah (ﷺ) said: Three things one is not allowed to do: supplicating Allah specifically for himself and ignoring others while leading people in prayer; if he did so, he deceived them; looking inside a house before taking permission: if he did so, it is as if he entered the house, saying prayer while one is feeling the call of nature until one eases oneself.",
      "chain": [
        "31167",
        "28090",
        "19173",
        "18410",
        "130"
      ]
    },
    {
      "hadith_no": "91",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمود بن خالد السلمي، حدثنا أحمد بن علي، حدثنا ثور، عن يزيد بن شريح الحضرمي، عن أبي حى المؤذن، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يحل لرجل يؤمن بالله واليوم الآخر أن يصلي وهو حقن حتى يتخفف ‏\"‏ ‏.‏ ثم ساق نحوه على هذا اللفظ قال ‏\"‏ ولا يحل لرجل يؤمن بالله واليوم الآخر أن يؤم قوما إلا بإذنهم ولا يختص نفسه بدعوة دونهم فإن فعل فقد خانهم ‏\"‏ ‏.‏ قال أبو داود هذا من سنن أهل الشام لم يشركهم فيها أحد ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: It is not permissible for a man who believes in Allah and in the Last Day that he should say the prayer while he is feeling the call of nature until he becomes light (by relieving himself).Then the narrator Thawr b. Yazid transmitted a similar tradition with the following wordings: \"It is not permissible for a man who believes in Allah and in the Last Day that he should lead the people in prayer but with their permission; and that he should not supplicate to Allah exclusively for himself leaving all others. If he did so, he violated trust.\"Abu Dawud said: This is a tradition reported by the narrators of Syria; no other person has joined them in relating this tradition.",
      "chain": [
        "37534",
        "28001",
        "11155",
        "19173",
        "18410",
        "13"
      ]
    },
    {
      "hadith_no": "357",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا علي بن حجر، حدثنا إسماعيل بن عياش، حدثني حبيب بن صالح، عن يزيد بن شريح، عن أبي حى المؤذن الحمصي، عن ثوبان، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يحل لامرئ أن ينظر في جوف بيت امرئ حتى يستأذن فإن نظر فقد دخل ولا يؤم قوما فيخص نفسه بدعوة دونهم فإن فعل فقد خانهم ولا يقوم إلى الصلاة وهو حقن ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وأبي أمامة ‏.‏ قال أبو عيسى حديث ثوبان حديث حسن ‏.‏ وقد روي هذا الحديث عن معاوية بن صالح عن السفر بن نسير عن يزيد بن شريح عن أبي أمامة عن النبي صلى الله عليه وسلم ‏.‏ وروي هذا الحديث عن يزيد بن شريح عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏ وكأن حديث يزيد بن شريح عن أبي حى المؤذن عن ثوبان في هذا أجود إسنادا وأشهر ‏.‏",
      "text_en": " Thawban narrated that :                     the Prophet said: \"It is not allowed for a man to look into the interior of a man's house until he has been given permission, for if he looks, then he has entered. And one who leads people (in Salat) should not supplicate for himself alone with the exclusion of his congregation. If he does, then he has betrayed them. And one is not to stand for Salat while he has to urinate.\"",
      "chain": [
        "20387",
        "20736",
        "28090",
        "19173",
        "18410",
        "130"
      ]
    },
    {
      "hadith_no": "660",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا بشر بن آدم، حدثنا زيد بن الحباب، حدثنا معاوية بن صالح، عن السفر بن نسير، عن يزيد بن شريح، عن أبي أمامة، أن رسول الله  صلى الله عليه وسلم  نهى أن يصلي الرجل وهو حاقن ‏.‏",
      "text_en": " It was narrated from Abu Umamah that:                     The Messenger of Allah forbade a man to perform prayer when he was suppressing (the urge to urinate or defecate).",
      "chain": [
        "30125",
        "20650",
        "20675",
        "18366",
        "19173",
        "405"
      ]
    },
    {
      "hadith_no": "976",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، حدثنا بقية بن الوليد، عن حبيب بن صالح، عن يزيد بن شريح، عن أبي حى المؤذن، عن ثوبان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يؤم عبد فيخص نفسه بدعوة دونهم فإن فعل فقد خانهم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Thawban said:                      “The Messenger of Allah (ﷺ)said: ‘Noperson should lead others in prayer, then supplicate onlyfor himselfand not for them. If he does that, he has betrayed them.’”",
      "chain": [
        "20644",
        "28090",
        "19173",
        "18410",
        "130"
      ]
    }
  ],
  "total_hadiths": 5
}