{
  "id": "19175",
  "name": "Yazid bin Tlq يزيد بن طلق",
  "full_name": "Yazid bin Tlq يزيد بن طلق",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Unknown-Majhool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Unknown-Majhool] [ س  ق  -  مجهول ]"
    ],
    "tags": [],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Unknown-Majhool] [ س  ق  -  مجهول ]",
        "ar": "Narrator[Grade:Unknown-Majhool] [ س  ق  -  مجهول ]",
        "ckb": "Narrator[Grade:Unknown-Majhool] [ س  ق  -  مجهول ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "NA",
        "ar": "NA",
        "ckb": "NA"
      }
    ],
    "tags_display": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-an-nasai-591",
      "hadith_no": "591",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرني الحسن بن إسماعيل بن سليمان، وأيوب بن محمد، قالا حدثنا حجاج بن محمد، قال أيوب حدثنا وقال، حسن أخبرني شعبة، عن يعلى بن عطاء، عن يزيد بن طلق، عن عبد الرحمن بن البيلماني، عن عمرو بن عبسة، قال أتيت رسول الله صلى الله عليه وسلم فقلت يا رسول الله من أسلم معك قال ‏\"‏ حر وعبد ‏\"‏ ‏.‏ قلت هل من ساعة أقرب إلى الله عز وجل من أخرى قال ‏\"‏ نعم جوف الليل الآخر فصل ما بدا لك حتى تصلي الصبح ثم انته حتى تطلع الشمس وما دامت ‏\"‏ ‏.‏ وقال أيوب فما دامت ‏\"‏ كأنها حجفة حتى تنتشر ثم صل ما بدا لك حتى يقوم العمود على ظله ثم انته حتى تزول الشمس فإن جهنم تسجر نصف النهار ثم صل ما بدا لك حتى تصلي العصر ثم انته حتى تغرب الشمس فإنها تغرب بين قرنى شيطان وتطلع بين قرنى شيطان ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Amr bin 'Abasah said:                      \"I came to the Messenger of Allah, who became Muslim with you?' He said: 'Free men and slaves.' I said: 'Is there any moment which brings one closer to Allah than another?' He said: 'Yes, the last part of the night, so pray as much as you want until you pray Subh, then stop until the sun has risen until and it looks like a shield and (its shinning)spreads. Then pray as much as you want until an object's shadow is at its shortest, then stop until the sun passes its zenith, for Hell is stoked at midday. Then pray 'Asr, then stop until you pray 'Asr, then stop until the sun has set, for it sets between the horns of a Shaitan and rises between the horns of a Shaitan.'\" [1][1] Similar has been recorded by Muslim.",
      "usc_msa_ref": "",
      "chain": [
        "20381",
        "11015",
        "20020",
        "10986",
        "19175",
        "19813",
        "4002"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-296",
      "hadith_no": "296",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن بشار، قالا حدثنا غندر، محمد بن جعفر عن شعبة، عن يعلى بن عطاء، عن يزيد بن طلق، عن عبد الرحمن بن البيلماني، عن عمرو بن عبسة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن العبد إذا توضأ فغسل يديه خرت خطاياه من يديه فإذا غسل وجهه خرت خطاياه من وجهه فإذا غسل ذراعيه ومسح برأسه خرت خطاياه من ذراعيه ورأسه فإذا غسل رجليه خرت خطاياه من رجليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Amr bin 'Abasah said:                     \"The Messenger of Allah said: 'When a person performs ablution and washes his hands, his sins exit through his hands. When he washes his face, his sins exit through his face. When he washes his forearms and wipes his head, his sins exit though his forearms and head. When he washes his feet, his sins exit through his feet.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30160",
        "20020",
        "10986",
        "19175",
        "19813",
        "4002"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-1309",
      "hadith_no": "1309",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، عن يعلى بن عطاء، عن يزيد بن طلق، عن عبد الرحمن بن البيلماني، عن عمرو بن عبسة، قال أتيت رسول الله  صلى الله عليه وسلم  فقلت هل من ساعة أحب إلى الله من أخرى قال ‏\"‏ نعم جوف الليل الأوسط فصل ما بدا لك حتى يطلع الصبح ثم انته حتى تطلع الشمس وما دامت كأنها حجفة حتى تنتشر ثم صل ما بدا لك حتى يقوم العمود على ظله ثم انته حتى تزول الشمس فإن جهنم تسجر نصف النهار ثم صل ما بدا لك حتى تصلي العصر ثم انته حتى تغرب الشمس فإنها تغرب بين قرنى الشيطان وتطلع بين قرنى الشيطان ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Amr bin ‘Abasah said:                      “I came to the Messengerof Allah (ﷺ) and said: ‘Is there any time that is more beloved toAllah than another?’ He said: ‘Yes, the middle of the night, soprayas much as you want until dawn comes. Then refrain from prayinguntilthe sun has risen, and as long as it looks like a shield untilitbecomes apparent. Then pray as much as you want until a polestands onits shadow (i.e., noon), then refrain from praying until ithascrossed the zenith, for Hell is heated up at midday. Then pray asmuchas you want until you pray ‘Asr, then refrain from prayinguntil thesun has set, for it sets between the two horns of Satan andit risesbetween the two horns of Satan.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20278",
        "20020",
        "10986",
        "19175",
        "19813",
        "4002"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-1426",
      "hadith_no": "1426",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن بشار، ومحمد بن الوليد، قالوا حدثنا محمد بن جعفر، حدثنا شعبة، عن يعلى بن عطاء، عن يزيد بن طلق، عن عبد الرحمن بن البيلماني، عن عمرو بن عبسة، قال أتيت رسول الله  صلى الله عليه وسلم  ‏.‏ فقلت يا رسول الله من أسلم معك قال ‏\"‏ حر وعبد ‏\"‏ ‏.‏ قلت هل من ساعة أقرب إلى الله من أخرى قال ‏\"‏ نعم جوف الليل الأوسط ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Amr bin ‘Abasah said:                      “I came to the Messengerof Allah (ﷺ) and said: ‘O Messenger of Allah, who became a Muslimwith you?’ He said: ‘A free man and a slave.’ I said: ‘Isthere anyhour of the night that is closer to Allah than another?’He said:‘Yes, the last hour of the night.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30160",
        "20459",
        "20173",
        "20020",
        "10986",
        "19175",
        "19813",
        "4002"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 4,
  "grade_display": {
    "en": "Follower (Tabi') [6th Generation]",
    "ar": "تابعي [الجيل السادس]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
  }
}