{
  "id": "192",
  "name": "'Abdullah b. Zama'a ( عبد الله بن زمعة بن الأسود بن المطلب ( رضي الله عنه",
  "full_name": "'Abdullah b. Zama'a ( عبد الله بن زمعة بن الأسود بن المطلب ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "63",
      "date_gregorian": "681",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]"
    ],
    "tags": [
      "Quraish",
      "B.Asad"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "244",
      "name": "Zaynab bint Abi Salamah ( زينب بنت أبي سلمة ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "siblings": [
    {
      "id": "761",
      "name": "Yazid bin Zama'a bin al-Aswad ( يزيد/ زيد بن زمعة بن الأسود ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "2306",
      "name": "Wahb bin Zam'a bin al-Aswad ( وهب بن زمعة بن الأسود بن المطلب ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "10994",
      "name": "Abu 'Ubaida bin 'Abdullah bin Zama' أبو عبيدة بن عبد الله بن زمعة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "10994",
      "name": "Abu 'Ubaida bin 'Abdullah bin Zama' أبو عبيدة بن عبد الله بن زمعة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11004",
      "name": "'Ubaydullah bin 'Abdullah bin 'Utba عبيد الله بن عبد الله بن عتبة بن مسعود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11003",
      "name": "Abu Bakr bin 'Abdur Rahman أبو بكر بن عبد الرحمن بن الحارث بن هشام",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3377",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا هشام بن عروة، عن أبيه، عن عبد الله بن زمعة، قال سمعت النبي صلى الله عليه وسلم‏.‏ وذكر الذي عقر الناقة قال ‏\"‏ انتدب لها رجل ذو عز ومنعة في قوة كأبي زمعة ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Zam`a:                     I heard the Prophet while referring to the person who had cut the legs of the she-camel (of the Prophet Salih), saying, \"The man who was appointed for doing this job, was a man of honor and power in his nation like Abu Zam`a.\"",
      "chain": [
        "30418",
        "20005",
        "11065",
        "10511",
        "192"
      ]
    },
    {
      "hadith_no": "4992",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا هشام، عن أبيه، أنه أخبره عبد الله بن زمعة، أنه سمع النبي صلى الله عليه وسلم يخطب وذكر الناقة والذي عقر فقال رسول الله صلى الله عليه وسلم ‏\"‏ ‏{‏إذ انبعث أشقاها‏}‏ انبعث لها رجل عزيز عارم، منيع في رهطه، مثل أبي زمعة ‏\"‏‏.‏ وذكر النساء فقال ‏\"‏ يعمد أحدكم يجلد امرأته جلد العبد، فلعله يضاجعها من آخر يومه ‏\"‏‏.‏ ثم وعظهم في ضحكهم من الضرطة وقال ‏\"‏ لم يضحك أحدكم مما يفعل ‏\"‏‏.‏ وقال أبو معاوية حدثنا هشام عن أبيه عن عبد الله بن زمعة قال النبي صلى الله عليه وسلم ‏\"‏ مثل أبي زمعة عم الزبير بن العوام ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Zama:                     That he heard the Prophet delivering a sermon, and he mentioned the shecamel and the one who hamstrung it. Allah's Apostle recited:-- 'When, the most wicked man among them went forth (to hamstrung the she-camel).' (91.12.) Then he said, \"A tough man whose equal was rare and who enjoyed the protection of his people, like Abi Zama went forth to (hamstrung) it.\" The Prophet then mentioned about the women (in his sermon). \"It is not wise for anyone of you to lash his wife like a slave, for he might sleep with her the same evening.\" Then he advised them not to laugh when somebody breaks wind and said, \"Why should anybody laugh at what he himself does?\"",
      "chain": [
        "20040",
        "20299",
        "11065",
        "10511",
        "192"
      ]
    },
    {
      "hadith_no": "5259",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا سفيان، عن هشام، عن أبيه، عن عبد الله بن زمعة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يجلد أحدكم امرأته جلد العبد، ثم يجامعها في آخر اليوم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Zam`a:                     The Prophet said, \"None of you should flog his wife as he flogs a slave and then have sexual intercourse with her in the last part of the day.\"",
      "chain": [
        "30388",
        "20005",
        "11065",
        "10511",
        "192"
      ]
    },
    {
      "hadith_no": "6111",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، عن هشام، عن أبيه، عن عبد الله بن زمعة، قال نهى النبي صلى الله عليه وسلم أن يضحك الرجل مما يخرج من الأنفس وقال ‏\"‏ بم يضرب أحدكم امرأته ضرب الفحل، ثم لعله يعانقها ‏\"‏‏.‏ وقال الثوري ووهيب وأبو معاوية عن هشام ‏\"‏ جلد العبد ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Zam`a:                     The Prophet forbade laughing at a person who passes wind, and said, \"How does anyone of you beat his wife as he beats the stallion camel and then he may embrace (sleep with) her?\" And Hisham said, \"As he beats his slave\"",
      "chain": [
        "30026",
        "20005",
        "11065",
        "10511",
        "192"
      ]
    },
    {
      "hadith_no": "7370",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا ابن نمير، عن هشام بن، عروة عن أبيه، عن عبد الله بن زمعة، قال خطب رسول الله صلى الله عليه وسلم فذكر الناقة وذكر الذي عقرها فقال ‏\"‏ إذ انبعث أشقاها انبعث بها رجل عزيز عارم منيع في رهطه مثل أبي زمعة ‏\"‏ ‏.‏ ثم ذكر النساء فوعظ فيهن ثم قال ‏\"‏ إلام يجلد أحدكم امرأته ‏\"‏ ‏.‏ في رواية أبي بكر ‏\"‏ جلد الأمة ‏\"‏ ‏.‏ وفي رواية أبي كريب ‏\"‏ جلد العبد ولعله يضاجعها من آخر يومه ‏\"‏ ‏.‏ ثم وعظهم في ضحكهم من الضرطة فقال ‏\"‏ إلام يضحك أحدكم مما يفعل ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Zam'a reported that Allah's Messenger (may peace be upon him) delivered an address and he made a mention of the dromedary and also made a mention of one (base person) who cut off Its hind legs, and he recited:                     \" When the basest of them broke forth with mischief\" (xei. 12). When A mischievous person, strong even because of the strength of a family like Abu Zam'a, broke forth. He then delivered instruction in regard to the women saying: There is amongst you who beats his woman, and in the narration on the authority of Abu Bakr, the words are: He flogs her like a slave-girl. And in the narration of Abu Kuraib (the words are): He flogs like a slave and then comforts his bed with the help of that at the end of the day, and he then advised in regard to laughing of people at the breaking of wind and said: One of you laughs at that which you yourself do.",
      "chain": [
        "30201",
        "30216",
        "30212",
        "11065",
        "10511",
        "192"
      ]
    },
    {
      "hadith_no": "4660",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا محمد بن سلمة، عن محمد بن إسحاق، قال حدثني الزهري، حدثني عبد الملك بن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن أبيه، عن عبد الله بن زمعة، قال لما استعز برسول الله صلى الله عليه وسلم وأنا عنده في نفر من المسلمين دعاه بلال إلى الصلاة فقال مروا من يصلي للناس ‏.‏ فخرج عبد الله بن زمعة فإذا عمر في الناس وكان أبو بكر غائبا فقلت يا عمر قم فصل بالناس فتقدم فكبر فلما سمع رسول الله صلى الله عليه وسلم صوته وكان عمر رجلا مجهرا قال ‏\"‏ فأين أبو بكر يأبى الله ذلك والمسلمون يأبى الله ذلك والمسلمون ‏\"‏ ‏.‏ فبعث إلى أبي بكر فجاء بعد أن صلى عمر تلك الصلاة فصلى بالناس ‏.‏",
      "text_en": " Narrated Abdullah ibn Zam'ah:                     When the illness of the Messenger of Allah (ﷺ) became serious while I was with him among a group of people, Bilal called him for prayer. He said: Ask someone to lead the people in prayer. So Abdullah ibn Zam'ah went out and found that Umar was present among the people and AbuBakr was not there. I said: Umar, get up and lead the people in prayer. So he came forward and uttered \"Allah is Most Great\". When the Messenger of Allah (ﷺ) heard his voice, as Umar had a loud voice, he said: Where is AbuBakr? Allah does not allow that, and the Muslims too; Allah does not allow that, and the Muslims too. So he sent for AbuBakr. He came after Umar had led the people in that prayer. He then led the people in prayer.",
      "chain": [
        "30352",
        "20672",
        "11107",
        "11013",
        "192"
      ]
    },
    {
      "hadith_no": "4661",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن أبي فديك، قال حدثني موسى بن يعقوب، عن عبد الرحمن بن إسحاق، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة، أن عبد الله بن زمعة، أخبره بهذا الخبر، قال لما سمع النبي صلى الله عليه وسلم صوت عمر قال ابن زمعة خرج النبي صلى الله عليه وسلم حتى أطلع رأسه من حجرته ثم قال ‏\"‏ لا لا لا ليصل للناس ابن أبي قحافة ‏\"‏ ‏.‏ يقول ذلك مغضبا ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by ‘Abd Allah b. Zam’ah through a different chain. He said:                      When the Prophet (May peace be upon him) heard ‘Umar’s voice, Ibn Zam’ah said: The Prophet (May peace be upon him) came out until he took out his head of his apartment. He then said : No, no, no; the son of Abu Quhafah should lead the people in prayer. He said it angrily.",
      "chain": [
        "30226",
        "20172",
        "20706",
        "11876",
        "11013",
        "11004",
        "192"
      ]
    },
    {
      "hadith_no": "3666",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا هارون بن إسحاق الهمداني، حدثنا عبدة، عن هشام بن عروة، عن أبيه، عن عبد الله بن زمعة، قال سمعت النبي صلى الله عليه وسلم يوما يذكر الناقة والذي عقرها فقال ‏\"‏ ‏:‏ ‏(‏إذ انبعث أشقاها ‏)‏ انبعث لها رجل عارم عزيز منيع في رهطه مثل أبي زمعة ‏\"‏ ‏.‏ ثم سمعته يذكر النساء فقال ‏\"‏ إلام يعمد أحدكم فيجلد امرأته جلد العبد ولعله أن يضاجعها من آخر يومه ‏\"‏ ‏.‏ قال ثم وعظهم في ضحكهم من الضرطة فقال ‏\"‏ إلام يضحك أحدكم مما يفعل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abdullah bin Zam’ah said:                     “One day, I heard the Prophet while he was mentioning the she-camel and the one who killed her. He said: ‘When their most wicked went forth.’ A strong and mighty man who was invincible among his tribe, like Zam’ah, went forth for her.’ Then I heard him mentioning the women, so he said: ‘One of you should not lash his wife as a slave is lashed, for perhaps he will lay with her at the end of the day.’” He said: “Then he advised against laughing when passing gas, he said: ‘One of you should not laugh at what he himself does.’”",
      "chain": [
        "35158",
        "20337",
        "11065",
        "10511",
        "192"
      ]
    },
    {
      "hadith_no": "2059",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، حدثنا هشام بن عروة، عن أبيه، عن عبد الله بن زمعة، قال خطب النبي  صلى الله عليه وسلم  ثم ذكر النساء فوعظهم فيهن ثم قال ‏\"‏ إلام يجلد أحدكم امرأته جلد الأمة ولعله أن يضاجعها من آخر يومه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abduleh bin Zam'ah said:                     'The Prophet delivered a sermon then he made mention of women, and exhorted (the men) concerning them. Then he said: 'How long will one of you whip his wife like a slave, then lie with her at the end of the day?'",
      "chain": [
        "30201",
        "20331",
        "11065",
        "10511",
        "192"
      ]
    }
  ],
  "total_hadiths": 9
}