{
  "id": "19201",
  "name": "Yonus bin Maysra bin Halbus يونس بن ميسرة",
  "full_name": "Yonus bin Maysra bin Halbus يونس بن ميسرة",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "132",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Syria"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  ت  ق  -  ثقة ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "3202",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا الوليد، ح وحدثنا إبراهيم بن موسى الرازي، أخبرنا الوليد، - وحديث عبد الرحمن أتم - حدثنا مروان بن جناح، عن يونس بن ميسرة بن حلبس، عن واثلة بن الأسقع، قال صلى بنا رسول الله صلى الله عليه وسلم على رجل من المسلمين فسمعته يقول ‏\"‏ اللهم إن فلان بن فلان في ذمتك فقه فتنة القبر ‏\"‏ ‏.‏ قال عبد الرحمن ‏\"‏ في ذمتك وحبل جوارك فقه من فتنة القبر وعذاب النار وأنت أهل الوفاء والحمد اللهم فاغفر له وارحمه إنك أنت الغفور الرحيم ‏\"‏ ‏.‏ قال عبد الرحمن عن مروان بن جناح ‏.‏",
      "text_en": " Narrated Wathilah ibn al-Asqa':                     The Messenger of Allah (ﷺ) led us in prayer over bier of a Muslim and I heard him say: O Allah, so and so, son of so and so, is in Thy protection, so guard him from the trial in the grave. (AbdurRahman in his version said: \"In Thy protection and in Thy nearer presence, so guard him from the trial in the grave) and the punishment in Hell. Thou art faithful and worthy of praise. O Allah, forgive him and show him mercy. Thou art the forgiving and the merciful one.\" AbdurRahman said: \"On the authority of Marwan ibn Janah.\"",
      "chain": [
        "20733",
        "30309",
        "15516",
        "19201",
        "4049"
      ]
    },
    {
      "hadith_no": "5081",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا يزيد بن محمد الدمشقي، حدثنا عبد الرزاق بن مسلم الدمشقي، - وكان من ثقات المسلمين من المتعبدين - قال حدثنا مدرك بن سعد - قال يزيد شيخ ثقة - عن يونس بن ميسرة بن حلبس عن أم الدرداء عن أبي الدرداء رضى الله عنه قال من قال إذا أصبح وإذا أمسى حسبي الله لا إله إلا هو عليه توكلت وهو رب العرش العظيم سبع مرات كفاه الله ما أهمه صادقا كان بها أو كاذبا ‏.‏",
      "text_en": " Abu al-Darda’ said:                      if anyone says seven times morning and evening; “Allah sufficeth me: there is no god but He; on him is my trust- he, the Lord of the Throne (of glory) Supreme”, Allah will be sufficient for him against anything which grieves him, whether he is true or false in (repeating) them.",
      "chain": [
        "19201",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "226",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا هشام بن عمار، حدثنا الوليد بن مسلم، حدثنا مروان بن جناح، عن يونس بن ميسرة بن حلبس، أنه حدثه قال سمعت معاوية بن أبي سفيان، يحدث عن رسول الله  صلى الله عليه وسلم  أنه قال ‏\"‏ الخير عادة والشر لجاجة ومن يرد الله به خيرا يفقهه في الدين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Yunus bin Maisarah bin Halbas said:                     \"I heard Mu'awiyah bin Abu Sufyan narrating that the Messenger of Allah said: \"Goodness is a (natural) habit while evil is a stubbornness (constant prodding from Satan). When Allah wills good for a person, He causes him to understand the religion.'\"",
      "chain": [
        "30288",
        "20733",
        "15516",
        "19201",
        "27"
      ]
    },
    {
      "hadith_no": "891",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، حدثنا إسحاق بن سليمان، حدثنا معاوية بن يحيى، عن يونس بن ميسرة، عن أبي إدريس الخولاني، عن أبي الدرداء، قال سأله رجل فقال أقرأ والإمام يقرأ قال سأل رجل النبي  صلى الله عليه وسلم  أفي كل صلاة قراءة فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ نعم ‏\"‏ ‏.‏ فقال رجل من القوم وجب هذا ‏.‏",
      "text_en": " Abu IdrisAl-Khawlani narrated that a man asked Abu Darda’:                      “Should Irecite when the Imam is reciting?” He said: “A man asked theProphet(ﷺ) whether there was recitation in every prayer. TheMessenger ofAllah (ﷺ) said: ‘Yes.’ A man among the peoplesaid: ‘It has becomeobligatory.’”",
      "chain": [
        "38409",
        "20310",
        "19201",
        "11027",
        "37"
      ]
    },
    {
      "hadith_no": "1490",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا العباس بن عثمان الدمشقي، حدثنا الوليد بن مسلم، عن خالد بن يزيد المري، عن يونس بن ميسرة بن حلبس، عن الصنابحي، عن عبادة بن الصامت، أنه سمع رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ ما من عبد يسجد لله سجدة إلا كتب الله له بها حسنة ومحا عنه بها سيئة ورفع له بها درجة فاستكثروا من السجود ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Ubadah bin Samit that he heard the Messenger ofAllah (ﷺ) say:                      “No one prostrates to Allah but Allah will recordoneHasanah (good reward) for him, and will erase thereby one baddeed andraise him in status one degree. So prostrate a great deal.”",
      "chain": [
        "20733",
        "27507",
        "19201",
        "5144",
        "40"
      ]
    },
    {
      "hadith_no": "1566",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا الوليد بن مسلم، حدثنا مروان بن جناح، حدثني يونس بن ميسرة بن حلبس، عن واثلة بن الأسقع، قال صلى رسول الله  صلى الله عليه وسلم  على رجل من المسلمين فأسمعه يقول ‏\"‏ اللهم إن فلان بن فلان في ذمتك وحبل جوارك فقه من فتنة القبر وعذاب النار وأنت أهل الوفاء والحق فاغفر له وارحمه إنك أنت الغفور الرحيم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Wathilah bin Asqa’ said:                      “The Messenger of Allah(ﷺ) offered the funeral prayer for a man among the Muslims and Iheard him say: ‘O Allah, so-and-so the son of so-and-so is in Yourcase and under Your protection. Protect him from the trial of thegrave and the torment of the Fire, for You are the One Who keeps thepromise and You are the Truth. Forgive him and have mercy on him, forYou are the Oft-Forgiving, Most Merciful.”",
      "chain": [
        "30285",
        "20733",
        "15516",
        "19201",
        "4049"
      ]
    },
    {
      "hadith_no": "3249",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، حدثنا محمد بن شعيب، أخبرني سعيد بن عبد العزيز، حدثنا يونس بن ميسرة بن حلبس، قال خرجنا مع أبي سعيد الزرقي - صاحب رسول الله  صلى الله عليه وسلم  - إلى شراء الضحايا ‏.‏ قال يونس فأشار أبو سعيد إلى كبش أدغم ليس بالمرتفع ولا المتضع في جسمه فقال لي اشتر لي هذا ‏.‏ كأنه شبهه بكبش رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " Yunusbin Maisarah bin Halbas said:                      “I went out with Abu Sa’eedAz-Zuraqi, the Companion of the Messenger of Allah (ﷺ), to buyanimalsor sacrifice.” Yunus said: “Abu Sa’eed pointed to a ramthat had someblackness around its ears and jaw, and was neither toobig nor toosmall, and said to me: ‘Buy this one for them, as itseems to resemblethe ram of the Messenger of Allah (ﷺ).’”",
      "chain": [
        "30285",
        "20732",
        "20638",
        "19201"
      ]
    },
    {
      "hadith_no": "3501",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا هشام بن عمار، حدثنا سليمان بن عتبة، حدثني يونس بن ميسرة بن حلبس، عن أبي إدريس، عن أبي الدرداء، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ لا يدخل الجنة مدمن خمر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Darda’ that the Prophet (ﷺ) said:                      “No onewhois addicted to wine will enter Paradise.”",
      "chain": [
        "30288",
        "28228",
        "19201",
        "11027",
        "37"
      ]
    }
  ],
  "total_hadiths": 8
}