{
  "id": "1924",
  "name": "Suwayd bin al-Nu'man ( سويد بن النعمان الأنصاري ( رضي الله عنه",
  "full_name": "Suwayd bin al-Nu'man ( سويد بن النعمان الأنصاري ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "14",
      "date_gregorian": "636",
      "date_display": null,
      "place": "Iran, Qadsia",
      "reason": "Martyred"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ خ  س  ق  -  صحابي ]"
    ],
    "tags": [
      "Ansar",
      "Aws",
      "B.Haritha",
      "Uhud",
      "Khandaq",
      "Ridwan"
    ]
  },
  "parents": [],
  "spouses": [
    {
      "id": "1956",
      "name": "'Amira bint Murshida bin Jabir ( عميرة بنت مرشدة بن جبر ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "11810",
      "name": "Bashayr bin al-Yasar al-Harithi al-Ansar بشير بن يسار مولى بني حارثة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-209",
      "hadith_no": "209",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن يحيى بن سعيد، عن بشير بن يسار، مولى بني حارثة أن سويد بن النعمان، أخبره‏.‏ أنه، خرج مع رسول الله صلى الله عليه وسلم عام خيبر، حتى إذا كانوا بالصهباء  وهي أدنى خيبر  فصلى العصر، ثم دعا بالأزواد، فلم يؤت إلا بالسويق، فأمر به فثري، فأكل رسول الله صلى الله عليه وسلم وأكلنا، ثم قام إلى المغرب، فمضمض ومضمضنا، ثم صلى ولم يتوضأ‏.‏",
      "text_en": " Narrated Suwaid bin Al-Nu`man:                     In the year of the conquest of Khaibar I went with Allah's Apostle till we reached Sahba, a place near Khaibar, where Allah's Apostle offered the `Asr prayer and asked for food. Nothing but saweeq  was brought. He ordered it to be moistened with water. He and all of us ate it and the Prophet got up for the evening prayer (Maghrib prayer), rinsed his mouth with water and we did the same, and he then prayed without repeating the ablution.",
      "usc_msa_ref": "",
      "chain": [
        "30355",
        "20001",
        "11062",
        "11810",
        "1924"
      ]
    },
    {
      "id": "sahih-bukhari-215",
      "hadith_no": "215",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا خالد بن مخلد، قال حدثنا سليمان، قال حدثني يحيى بن سعيد، قال أخبرني بشير بن يسار، قال أخبرني سويد بن النعمان، قال خرجنا مع رسول الله صلى الله عليه وسلم عام خيبر، حتى إذا كنا بالصهباء، صلى لنا رسول الله صلى الله عليه وسلم العصر، فلما صلى دعا بالأطعمة، فلم يؤت إلا بالسويق، فأكلنا وشربنا، ثم قام النبي صلى الله عليه وسلم إلى المغرب فمضمض، ثم صلى لنا المغرب ولم يتوضأ‏.‏",
      "text_en": " Narrated Suwaid bin Nu`man:                     In the year of the conquest of Khaibar I went with Allah's Apostle till we reached As-Sahba' where Allah's Apostle led the `Asr prayer and asked for the food. Nothing but saweeq was brought and we ate it and drank (water). The Prophet got up for the (Maghrib) Prayer, rinsed his mouth with water and then led the prayer without repeating the ablution.",
      "usc_msa_ref": "",
      "chain": [
        "30463",
        "20160",
        "11062",
        "11810",
        "1924"
      ]
    },
    {
      "id": "sahih-bukhari-2981",
      "hadith_no": "2981",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب، قال سمعت يحيى، قال أخبرني بشير بن يسار، أن سويد بن النعمان  رضى الله عنه  أخبره أنه، خرج مع النبي صلى الله عليه وسلم عام خيبر، حتى إذا كانوا بالصهباء  وهى من خيبر وهى أدنى خيبر  فصلوا العصر، فدعا النبي صلى الله عليه وسلم بالأطعمة، فلم يؤت النبي صلى الله عليه وسلم إلا بسويق، فلكنا فأكلنا وشربنا، ثم قام النبي صلى الله عليه وسلم فمضمض ومضمضنا، وصلينا‏.‏",
      "text_en": " Narrated Suwaid bin An-Nu`man:                     That he went out in the company o; the Prophet during the year of Khaibar (campaign till they reached a place called As-Sahba', the lower part of Khaibar. They offered the `Asr prayer (there) and the Prophet asked for the food. Nothing but Sawiq was brought to the Prophet. So, they chewed it and ate it and drank water. After that the Prophet got up, washed his mouth, and they too washed their mouths and then offered the prayer.",
      "usc_msa_ref": "224",
      "chain": [
        "30170",
        "20259",
        "20031",
        "11810",
        "1924"
      ]
    },
    {
      "id": "sahih-bukhari-4226",
      "hadith_no": "4226",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن بشار، حدثنا ابن أبي عدي، عن شعبة، عن يحيى بن سعيد، عن بشير بن يسار، عن سويد بن النعمان  وكان من أصحاب الشجرة  كان رسول الله صلى الله عليه وسلم وأصحابه أتوا بسويق فلاكوه‏.‏ تابعه معاذ عن شعبة‏.‏",
      "text_en": " Narrated Suwaid bin An-Nu`man:                     who was one of those who witnessed (the Pledge of allegiance beneath) the Tree: Allah's Apostle and his companions were given Sawiq and they chewed it.",
      "usc_msa_ref": "492",
      "chain": [
        "30160",
        "20276",
        "20020",
        "11062",
        "11810",
        "1924"
      ]
    },
    {
      "id": "sahih-bukhari-4244",
      "hadith_no": "4244",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن يحيى بن سعيد، عن بشير بن يسار، أن سويد بن النعمان، أخبره أنه، خرج مع النبي صلى الله عليه وسلم عام خيبر، حتى إذا كنا بالصهباء  وهى من أدنى خيبر  صلى العصر، ثم دعا بالأزواد فلم يؤت إلا بالسويق، فأمر به فثري، فأكل وأكلنا، ثم قام إلى المغرب، فمضمض ومضمضنا، ثم صلى ولم يتوضأ‏.‏",
      "text_en": " Narrated Suwaid bin An-Nu`man:                     I went out in the company of the Prophet in the year of Khaibar, and when we reached As Sahba' which is the lower part of Khaibar, the Prophet offered the `Asr prayer and then asked the people to collect the journey food. Nothing was brought but Sawiq which the Prophet ordered to be moistened with water, and then he ate it and we also ate it. Then he got up to offer the Maghrib prayer. He washed his mouth, and we too washed our mouths, and then he offered the prayer without repeating his abulution.",
      "usc_msa_ref": "508",
      "chain": [
        "20164",
        "20001",
        "11062",
        "11810",
        "1924"
      ]
    },
    {
      "id": "sahih-bukhari-5438",
      "hadith_no": "5438",
      "source": "Sahih Bukhari",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، قال يحيى بن سعيد سمعت بشير بن يسار، يقول حدثنا سويد بن النعمان، قال خرجنا مع رسول الله صلى الله عليه وسلم إلى خيبر، فلما كنا بالصهباء  قال يحيى وهى من خيبر على روحة  دعا رسول الله صلى الله عليه وسلم بطعام، فما أتي إلا بسويق، فلكناه فأكلنا منه، ثم دعا بماء فمضمض ومضمضنا، فصلى بنا المغرب ولم يتوضأ‏.‏ قال سفيان سمعته منه عودا وبدءا‏.‏",
      "text_en": " Narrated Suwaid bin An-Nu`man:                     We went out with Allah's Apostle to Khaibar, and when we were at As-Sahba', (Yahya, a sub-narrator said, \"As-Sahba' is a place at a distance of one day's journey to Khaibar).\" Allah's Apostle asked the people to bring their food, but there was nothing with the people except Sawiq. So we all chewed and ate of it. Then the Prophet asked for some water and he rinsed his mouth, and we too, rinsed our mouths. Then he led us in the Maghrib prayer without performing ablution (again).",
      "usc_msa_ref": "296",
      "chain": [
        "30026",
        "20005",
        "11062",
        "11810",
        "1924"
      ]
    },
    {
      "id": "sahih-bukhari-5444",
      "hadith_no": "5444",
      "source": "Sahih Bukhari",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن يحيى، عن بشير بن يسار، عن سويد بن النعمان، أنه أخبره أنهم، كانوا مع النبي صلى الله عليه وسلم بالصهباء  وهى على روحة من خيبر  فحضرت الصلاة، فدعا بطعام فلم يجده إلا سويقا، فلاك منه فلكنا معه، ثم دعا بماء فمضمض، ثم صلى وصلينا، ولم يتوضأ‏.‏",
      "text_en": " Narrated Suwaid bin An-Nu`man:                     that while they were with the Prophet at As-Sahba' which was at a distance of one day's journey from Khaibar the prayer became due, and the Prophet asked the people for food but there was nothing with the people except Sawiq. He ate of it and we ate along with him, and then he asked for water and rinsed his mouth (with it), and then offered the (Maghrib) prayer and we too offered the prayer but the Prophet did not perform ablution (again after eating the Sawiq.).",
      "usc_msa_ref": "302",
      "chain": [
        "20193",
        "20022",
        "20031",
        "11810",
        "1924"
      ]
    },
    {
      "id": "sahih-bukhari-5510",
      "hadith_no": "5510",
      "source": "Sahih Bukhari",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا علي، حدثنا سفيان، سمعت يحيى بن سعيد، عن بشير بن يسار، عن سويد بن النعمان، قال خرجنا مع رسول الله صلى الله عليه وسلم إلى خيبر، فلما كنا بالصهباء دعا بطعام فما أتي إلا بسويق، فأكلنا فقام إلى الصلاة، فتمضمض ومضمضنا‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "5",
        "20005",
        "11062",
        "11810",
        "1924"
      ]
    },
    {
      "id": "sunan-an-nasai-187",
      "hadith_no": "187",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن يحيى بن سعيد، عن بشير بن يسار، مولى بني حارثة أن سويد بن النعمان، أخبره أنه، خرج مع رسول الله صلى الله عليه وسلم عام خيبر حتى إذا كانوا بالصهباء وهي من أدنى خيبر صلى العصر ثم دعا بالأزواد فلم يؤت إلا بالسويق فأمر به فثري فأكل وأكلنا ثم قام إلى المغرب فتمضمض وتمضمضنا ثم صلى ولم يتوضأ ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11062",
        "11810",
        "1924"
      ]
    }
  ],
  "total_hadiths": 9
}