{
  "id": "19249",
  "name": "Abu Hameed al-R'yny أبو حميد الرعيني",
  "full_name": "Abu Hameed al-R'yny أبو حميد الرعيني",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Unknown-Majhool] [ د  -  مجهول ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [
    {
      "id": "20415",
      "name": "Thaur bin Yazid al-Rahbi ثور بن يزيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2803",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا إبراهيم بن موسى الرازي، قال أخبرنا ح، وحدثنا علي بن بحر بن بري، حدثنا عيسى، - المعنى - عن ثور، حدثني أبو حميد الرعيني، أخبرني يزيد، ذو مصر قال أتيت عتبة بن عبد السلمي فقلت يا أبا الوليد إني خرجت ألتمس الضحايا فلم أجد شيئا يعجبني غير ثرماء فكرهتها فما تقول قال أفلا جئتني بها ‏.‏ قلت سبحان الله تجوز عنك ولا تجوز عني قال نعم إنك تشك ولا أشك إنما نهى رسول الله صلى الله عليه وسلم عن المصفرة والمستأصلة والبخقاء والمشيعة والكسراء فالمصفرة التي تستأصل أذنها حتى يبدو سماخها والمستأصلة التي استؤصل قرنها من أصله والبخقاء التي تبخق عينها والمشيعة التي لا تتبع الغنم عجفا وضعفا والكسراء الكسيرة ‏.‏",
      "text_en": " Narrated Yazid Dhu Misr :                     I came to Utbah ibn AbdusSulami and said: AbulWalid, I went out seeking sacrificial animals. I did not find anything which attracted me except an animal whose teeth have fallen. So I abominated it. What do you say (about it)? He said: Why did you not bring it to me? He said: Glory be to Allah: Is if lawful for you and not lawful for me? He said: Yes, you doubt and I do not doubt. The Messenger of Allah (ﷺ) has forbidden an animal whose ear has been uprooted so much so that its hole appears (outwardly), and an animal whose horn has broken from the root, and an animal which has totally lost the sight of its eye, and an animal which is so thin and weak that it cannot go with the herd, and an animal with a broken leg.",
      "chain": [
        "30309",
        "36596",
        "11155",
        "19249"
      ]
    }
  ],
  "total_hadiths": 1
}