{
  "id": "19291",
  "name": "Abu Salah Maula 'Uthman أبو صالح مولى عثمان",
  "full_name": "Abu Salah Maula 'Uthman أبو صالح مولى عثمان",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ ت  س  -  مقبول ]"
    ],
    "tags": [
      "Client",
      "Ally B.Umayya"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [
    {
      "id": "11507",
      "name": "Zuhrah bin Ma'bad bin 'Abdullah زهرة بن معبد بن عبد الله بن هشام",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-538",
      "hadith_no": "538",
      "source": "Sahih Bukhari",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عمر بن حفص، قال حدثنا أبي قال، حدثنا الأعمش، حدثنا أبو صالح، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أبردوا بالظهر، فإن شدة الحر من فيح جهنم ‏\"‏‏.‏ تابعه سفيان ويحيى وأبو عوانة عن الأعمش‏.‏",
      "text_en": " Narrated Abu Sa`id:                     that Allah's Apostle said, \"Pray Zuhr prayer when it becomes (a bit) cooler as the severity of heat is from the raging of the Hell-fire.\"",
      "usc_msa_ref": "513",
      "chain": [
        "30204",
        "20317",
        "11060",
        "19291",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-647",
      "hadith_no": "647",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا عبد الواحد، قال حدثنا الأعمش، قال سمعت أبا صالح، يقول سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ صلاة الرجل في الجماعة تضعف على صلاته في بيته وفي سوقه خمسا وعشرين ضعفا، وذلك أنه إذا توضأ فأحسن الوضوء، ثم خرج إلى المسجد لا يخرجه إلا الصلاة، لم يخط خطوة إلا رفعت له بها درجة، وحط عنه بها خطيئة، فإذا صلى لم تزل الملائكة تصلي عليه ما دام في مصلاه اللهم صل عليه، اللهم ارحمه‏.‏ ولا يزال أحدكم في صلاة ما انتظر الصلاة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The reward of the prayer offered by a person in congregation is twenty five times greater than that of the prayer offered in one's house or in the market (alone). And this is because if he performs ablution and does it perfectly and then proceeds to the mosque with the sole intention of praying, then for every step he takes towards the mosque, he is upgraded one degree in reward and his one sin is taken off (crossed out) from his accounts (of deeds). When he offers his prayer, the angels keep on asking Allah's Blessings and Allah's forgiveness for him as long as he is (staying) at his Musalla. They say, 'O Allah! Bestow Your blessings upon him, be Merciful and kind to him.' And one is regarded in prayer as long as one is waiting for the prayer.\"",
      "usc_msa_ref": "620",
      "chain": [
        "20040",
        "20256",
        "11060",
        "19291",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-657",
      "hadith_no": "657",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عمر بن حفص، قال حدثنا أبي قال، حدثنا الأعمش، قال حدثني أبو صالح، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ ليس صلاة أثقل على المنافقين من الفجر والعشاء، ولو يعلمون ما فيهما لأتوهما ولو حبوا، لقد هممت أن آمر المؤذن فيقيم، ثم آمر رجلا يؤم الناس، ثم آخذ شعلا من نار فأحرق على من لا يخرج إلى الصلاة بعد ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"No prayer is harder for the hypocrites than the Fajr and the `Isha' prayers and if they knew the reward for these prayers at their respective times, they would certainly present themselves (in the mosques) even if they had to c awl.\" The Prophet added, \"Certainly I decided to order the Mu'adh-dhin (call-maker) to pronounce Iqama and order a man to lead the prayer and then take a fire flame to burn all those who had not left their houses so far for the prayer along with their houses.\"",
      "usc_msa_ref": "626",
      "chain": [
        "30204",
        "20317",
        "11060",
        "19291",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-1504",
      "hadith_no": "1504",
      "source": "Sahih Bukhari",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، حدثنا أبو صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لأن يأخذ أحدكم حبله، ثم يغدو  أحسبه قال  إلى الجبل فيحتطب، فيبيع فيأكل ويتصدق خير له من أن يسأل الناس ‏\"‏‏.‏ قال أبو عبد الله صالح بن كيسان أكبر من الزهري، وهو قد أدرك ابن عمر‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"No doubt, it is better for a person to take a rope and proceed in the morning to the mountains and cut the wood and then sell it, and eat from this income and give alms from it than to ask others for something.\"",
      "usc_msa_ref": "558",
      "chain": [
        "30204",
        "20317",
        "11060",
        "19291",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-1985",
      "hadith_no": "1985",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، حدثنا أبو صالح، عن أبي هريرة  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يصومن أحدكم يوم الجمعة، إلا يوما قبله أو بعده ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard the Prophet saying, \"None of you should fast on Friday unless he fasts a day before or after it.\"",
      "usc_msa_ref": "206",
      "chain": [
        "30204",
        "20317",
        "11060",
        "19291",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-2358",
      "hadith_no": "2358",
      "source": "Sahih Bukhari",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد بن زياد، عن الأعمش، قال سمعت أبا صالح، يقول سمعت أبا هريرة  رضى الله عنه  يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاثة لا ينظر الله إليهم يوم القيامة، ولا يزكيهم، ولهم عذاب أليم رجل كان له فضل ماء بالطريق، فمنعه من ابن السبيل، ورجل بايع إماما لا يبايعه إلا لدنيا، فإن أعطاه منها رضي، وإن لم يعطه منها سخط، ورجل أقام سلعته بعد العصر، فقال والله الذي لا إله غيره لقد أعطيت بها كذا وكذا، فصدقه رجل‏\"‏ ثم قرأ هذه الآية ‏{‏إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا‏}‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"There are three persons whom Allah will not look at on the Day of Resurrection, nor will he purify them and theirs shall be a severe punishment. They are: -1. A man possessed superfluous water, on a way and he withheld it from travelers. -2. A man who gave a pledge of allegiance to a ruler and he gave it only for worldly benefits. If the ruler gives him something he gets satisfied, and if the ruler withholds something from him, he gets dissatisfied. -3. And man displayed his goods for sale after the `Asr prayer and he said, 'By Allah, except Whom None has the right to be worshipped, I have been given so much for my goods,' and somebody believes him (and buys them). The Prophet then recited: \"Verily! Those who purchase a little gain at the cost of Allah's Covenant and their oaths.\" (3.77)",
      "usc_msa_ref": "547",
      "chain": [
        "20040",
        "20256",
        "11060",
        "19291",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-2549",
      "hadith_no": "2549",
      "source": "Sahih Bukhari",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا إسحاق بن نصر، حدثنا أبو أسامة، عن الأعمش، حدثنا أبو صالح، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ نعم ما لأحدهم يحسن عبادة ربه وينصح لسيده ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Goodness and comfort are for him who worships his Lord in a perfect manner and serves his master sincerely.\"",
      "usc_msa_ref": "725",
      "chain": [
        "30311",
        "20318",
        "11060",
        "19291",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-2972",
      "hadith_no": "2972",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا مسدد، حدثنا يحيى بن سعيد، عن يحيى بن سعيد الأنصاري، قال حدثني أبو صالح، قال سمعت أبا هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لولا أن أشق على أمتي ما تخلفت عن سرية، ولكن لا أجد حمولة، ولا أجد ما أحملهم عليه، ويشق على أن يتخلفوا عني، ولوددت أني قاتلت في سبيل الله فقتلت، ثم أحييت ثم قتلت، ثم أحييت ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Were it not for the fear that it would be difficult for my followers, I would not have remained behind any Sariya, (army-unit) but I don't have riding camels and have no other means of conveyance to carry them on, and it is hard for me that my companions should remain behind me. No doubt I wish I could fight in Allah's Cause and be martyred and come to life again to be martyred and come to life once more.\"",
      "usc_msa_ref": "216",
      "chain": [
        "30175",
        "20031",
        "11062",
        "19291",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3348",
      "hadith_no": "3348",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني إسحاق بن نصر، حدثنا أبو أسامة، عن الأعمش، حدثنا أبو صالح، عن أبي سعيد الخدري  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ يقول الله تعالى يا آدم‏.‏ فيقول لبيك وسعديك والخير في يديك‏.‏ فيقول أخرج بعث النار‏.‏ قال وما بعث النار قال من كل ألف تسعمائة وتسعة وتسعين، فعنده يشيب الصغير، وتضع كل ذات حمل حملها، وترى الناس سكارى، وما هم بسكارى، ولكن عذاب الله شديد ‏\"‏‏.‏ قالوا يا رسول الله وأينا ذلك الواحد قال ‏\"‏ أبشروا فإن منكم رجل، ومن يأجوج ومأجوج ألف ‏\"‏‏.‏ ثم قال ‏\"‏ والذي نفسي بيده، إني أرجو أن تكونوا ربع أهل الجنة ‏\"‏‏.‏ فكبرنا‏.‏ فقال ‏\"‏ أرجو أن تكونوا ثلث أهل الجنة ‏\"‏‏.‏ فكبرنا‏.‏ فقال ‏\"‏ أرجو أن تكونوا نصف أهل الجنة ‏\"‏‏.‏ فكبرنا‏.‏ فقال ‏\"‏ ما أنتم في الناس إلا كالشعرة السوداء في جلد ثور أبيض، أو كشعرة بيضاء في جلد ثور أسود ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"Allah will say (on the Day of Resurrection), 'O Adam.' Adam will reply, 'Labbaik wa Sa`daik', and all the good is in Your Hand.' Allah will say: 'Bring out the people of the fire.' Adam will say: 'O Allah! How many are the people of the Fire?' Allah will reply: 'From every one thousand, take out nine-hundred-and ninety-nine.' At that time children will become hoary headed, every pregnant female will have a miscarriage, and one will see mankind as drunken, yet they will not be drunken, but dreadful will be the Wrath of Allah.\" The companions of the Prophet asked, \"O Allah's Apostle! Who is that (excepted) one?\" He said, \"Rejoice with glad tidings; one person will be from you and one-thousand will be from Gog and Magog.\" The Prophet further said, \"By Him in Whose Hands my life is, hope that you will be one-fourth of the people of Paradise.\" We shouted, \"Allahu Akbar!\" He added, \"I hope that you will be one-third of the people of Paradise.\" We shouted, \"Allahu Akbar!\" He said, \"I hope that you will be half of the people of Paradise.\" We shouted, \"Allahu Akbar!\" He further said, \"You (Muslims) (compared with non Muslims) are like a black hair in the skin of a white ox or like a white hair in the skin of a black ox (i.e. your number is very small as compared with theirs).",
      "usc_msa_ref": "567",
      "chain": [
        "30311",
        "20318",
        "11060",
        "19291",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-4528",
      "hadith_no": "4528",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يوسف بن راشد، حدثنا جرير، وأبو أسامة  واللفظ لجرير  عن الأعمش، عن أبي صالح، وقال أبو أسامة، حدثنا أبو صالح، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يدعى نوح يوم القيامة فيقول لبيك وسعديك يا رب‏.‏ فيقول هل بلغت فيقول نعم‏.‏ فيقال لأمته هل بلغكم فيقولون ما أتانا من نذير‏.‏ فيقول من يشهد لك فيقول محمد وأمته‏.‏ فتشهدون أنه قد بلغ ‏\"‏‏.‏ ‏{‏ويكون الرسول عليكم شهيدا‏}‏ فذلك قوله جل ذكره ‏{‏وكذلك جعلناكم أمة وسطا لتكونوا شهداء على الناس ويكون الرسول عليكم شهيدا‏}‏ والوسط العدل‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle said, \"Noah will be called on the Day of Resurrection and he will say, 'Labbaik and Sa`daik, O my Lord!' Allah will say, 'Did you convey the Message?' Noah will say, 'Yes.' His nation will then be asked, 'Did he convey the Message to you?' They will say, 'No Warner came to us.' Then Allah will say (to Noah), 'Who will bear witness in your favor?' He will say, 'Muhammad and his followers. So they (i.e. Muslims) will testify that he conveyed the Message. And the Apostle (Muhammad) will be a witness over yourselves, and that is what is meant by the Statement of Allah \"Thus We have made of you a just and the best nation that you may be witnesses over mankind and the Apostle (Muhammad) will be a witness over yourselves.\" (2.143)",
      "usc_msa_ref": "14",
      "chain": [
        "30224",
        "20028",
        "11060",
        "11161",
        "20318",
        "19291",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-4777",
      "hadith_no": "4777",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، حدثنا أبو صالح، عن أبي سعيد الخدري  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يؤتى بالموت كهيئة كبش أملح فينادي مناد يا أهل الجنة، فيشرئبون وينظرون فيقول هل تعرفون هذا فيقولون نعم هذا الموت، وكلهم قد رآه، ثم ينادي يا أهل النار، فيشرئبون وينظرون، فيقول هل تعرفون هذا فيقولون نعم هذا الموت، وكلهم قد رآه، فيذبح ثم يقول يا أهل الجنة، خلود فلا موت، ويا أهل النار، خلود فلا موت ثم قرأ ‏{‏وأنذرهم يوم الحسرة إذ قضي الأمر وهم في غفلة‏}‏ وهؤلاء في غفلة أهل الدنيا ‏{‏وهم لا يؤمنون‏}‏‏\"‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle said, \"On the Day of Resurrection Death will be brought forward in the shape of a black and white ram. Then a call maker will call, 'O people of Paradise!' Thereupon they will stretch their necks and look carefully. The caller will say, 'Do you know this?' They will say, 'Yes, this is Death.' By then all of them will have seen it. Then it will be announced again, 'O people of Hell !' They will stretch their necks and look carefully. The caller will say, 'Do you know this?' They will say, 'Yes, this is Death.' And by then all of them will have seen it. Then it (that ram) will be slaughtered and the caller will say, 'O people of Paradise! Eternity for you and no death O people of Hell! Eternity for you and no death.\"' Then the Prophet, recited:-- 'And warn them of the Day of distress when the case has been decided, while (now) they are in a state of carelessness (i.e. the people of the world) and they do not believe.' (19.39)",
      "usc_msa_ref": "",
      "chain": [
        "30204",
        "20317",
        "11060",
        "19291",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-4788",
      "hadith_no": "4788",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثنا أبو صالح، عن أبي سعيد الخدري، قال قال النبي صلى الله عليه وسلم ‏\"‏ يقول الله عز وجل يوم القيامة يا آدم‏.‏ يقول لبيك ربنا وسعديك، فينادى بصوت إن الله يأمرك أن تخرج من ذريتك بعثا إلى النار‏.‏ قال يا رب وما بعث النار قال من كل ألف  أراه قال  تسعمائة وتسعة وتسعين فحينئذ تضع الحامل حملها ويشيب الوليد ‏{‏وترى الناس سكارى وما هم بسكارى ولكن عذاب الله شديد‏}‏ ‏\"‏‏.‏ فشق ذلك على الناس حتى تغيرت وجوههم، فقال النبي صلى الله عليه وسلم ‏\"‏ من يأجوج ومأجوج تسعمائة وتسعة وتسعين، ومنكم واحد، ثم أنتم في الناس كالشعرة السوداء في جنب الثور الأبيض، أو كالشعرة البيضاء في جنب الثور الأسود، وإني لأرجو أن تكونوا ربع أهل الجنة ‏\"‏‏.‏ فكبرنا ثم قال ‏\"‏ ثلث أهل الجنة ‏\"‏‏.‏ فكبرنا ثم قال ‏\"‏ شطر أهل الجنة ‏\"‏‏.‏ فكبرنا‏.‏ قال أبو أسامة عن الأعمش ‏{‏ترى الناس سكارى وما هم بسكارى‏}‏ وقال من كل ألف تسعمائة وتسعة وتسعين‏.‏ وقال جرير وعيسى بن يونس وأبو معاوية ‏{‏سكرى وما هم بسكرى‏}‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"On the day of Resurrection Allah will say, 'O Adam!' Adam will reply, 'Labbaik our Lord, and Sa`daik ' Then there will be a loud call (saying), Allah orders you to take from among your offspring a mission for the (Hell) Fire.' Adam will say, 'O Lord! Who are the mission for the (Hell) Fire?' Allah will say, 'Out of each thousand, take out 999.' At that time every pregnant female shall drop her load (have a miscarriage) and a child will have grey hair. And you shall see mankind as in a drunken state, yet not drunk, but severe will be the torment of Allah.\" (22.2) (When the Prophet mentioned this), the people were so distressed (and afraid) that their faces got changed (in color) whereupon the Prophet said, \"From Gog and Magog nine-hundred ninety-nine will be taken out and one from you. You Muslims (compared to the large number of other people) will be like a black hair on the side of a white ox, or a white hair on the side of a black ox, and I hope that you will be onefourth of the people of Paradise.\" On that, we said, \"Allahu-Akbar!\" Then he said, \"I hope that you will be) one-third of the people of Paradise.\" We again said, \"Allahu-Akbar!\" Then he said, \"(I hope that you will be) one-half of the people of Paradise.\" So we said, Allahu Akbar.\"",
      "usc_msa_ref": "265",
      "chain": [
        "30204",
        "20317",
        "11060",
        "19291",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-4827",
      "hadith_no": "4827",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إسحاق بن نصر، حدثنا أبو أسامة، عن الأعمش، حدثنا أبو صالح، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم ‏\"‏ يقول الله تعالى أعددت لعبادي الصالحين ما لا عين رأت، ولا أذن سمعت، ولا خطر على قلب بشر، ذخرا، بله ما أطلعتم عليه ‏\"‏‏.‏ ثم قرأ ‏{‏فلا تعلم نفس ما أخفي لهم من قرة أعين جزاء بما كانوا يعملون‏}‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet, said, \"Allah said, 'I have prepared for My pious worshipers such things as no eye has ever seen, no ear has ever heard of, and nobody has ever thought of. All that is reserved, besides which, all that you have seen, is nothing.\" Then he recited:-- 'No soul knows what is kept hidden (in reserve) for them of joy as a reward for what they used to do.' (32.17)",
      "usc_msa_ref": "",
      "chain": [
        "30311",
        "20318",
        "11060",
        "19291",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-4862",
      "hadith_no": "4862",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي قال، حدثنا الأعمش، قال سمعت أبا صالح، قال سمعت أبا هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ بين النفختين أربعون ‏\"‏‏.‏ قالوا يا أبا هريرة أربعون يوما قال أبيت‏.‏ قال أربعون سنة قال أبيت‏.‏ قال أربعون شهرا‏.‏ قال أبيت، ويبلى كل شىء من الإنسان إلا عجب ذنبه، فيه يركب الخلق‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Between the two blowing of the trumpet there will be forty.\" The people said, \"O Abu Huraira! Forty days?\" I refused to reply. They said, \"Forty years?\" I refused to reply and added: Everything of the human body will decay except the coccyx bone (of the tail) and from that bone Allah will reconstruct the whole body.",
      "usc_msa_ref": "338",
      "chain": [
        "30204",
        "20317",
        "11060",
        "19291",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-5409",
      "hadith_no": "5409",
      "source": "Sahih Bukhari",
      "chapter": "Supporting the Family - كتاب النفقات",
      "chapter_no": "69",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثنا أبو صالح، قال حدثني أبو هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ أفضل الصدقة ما ترك غنى، واليد العليا خير من اليد السفلى، وابدأ بمن تعول ‏\"‏‏.‏ تقول المرأة إما أن تطعمني وإما أن تطلقني‏.‏ ويقول العبد أطعمني واستعملني‏.‏ ويقول الابن أطعمني، إلى من تدعني فقالوا يا أبا هريرة سمعت هذا من رسول الله صلى الله عليه وسلم‏.‏ قال لا هذا من كيس أبي هريرة‏.‏",
      "text_en": " Narrated Abu Huraira:                     \"The Prophet said, 'The best alms is that which is given when one is rich, and a giving hand is better than a taking one, and you should start first to support your dependents.' A wife says, 'You should either provide me with food or divorce me.' A slave says, 'Give me food and enjoy my service.\" A son says, \"Give me food; to whom do you leave me?\" The people said, \"O Abu Huraira! Did you hear that from Allah's Apostle ?\" He said, \"No, it is from my own self.\"",
      "usc_msa_ref": "268",
      "chain": [
        "30204",
        "20317",
        "11060",
        "19291",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6127",
      "hadith_no": "6127",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثنا أبو صالح، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ تجد من شر الناس يوم القيامة عند الله ذا الوجهين، الذي يأتي هؤلاء بوجه وهؤلاء بوجه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The worst people in the Sight of Allah on the Day of Resurrection will be the double faced people who appear to some people with one face and to other people with another face.\"",
      "usc_msa_ref": "84",
      "chain": [
        "30204",
        "20317",
        "11060",
        "19291",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6225",
      "hadith_no": "6225",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، قال سمعت أبا صالح، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لأن يمتلئ جوف رجل قيحا يريه خير من أن يمتلئ شعرا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle; said, \"It is better for anyone of you that the inside of his body be filled with pus which may consume his body, than it be filled with poetry.\"",
      "usc_msa_ref": "176",
      "chain": [
        "30204",
        "20317",
        "11060",
        "19291",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6870",
      "hadith_no": "6870",
      "source": "Sahih Bukhari",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثني أبي، حدثنا الأعمش، قال سمعت أبا صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لعن الله السارق، يسرق البيضة فتقطع يده، ويسرق الحبل فتقطع يده ‏\"‏‏.‏ قال الأعمش كانوا يرون أنه بيض الحديد، والحبل كانوا يرون أنه منها ما يسوى دراهم‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Allah curses a man who steals an egg and gets his hand cut off, or steals a rope and gets his hands cut off.\" Al-A`mash said, \"People used to interpret the Baida as an iron helmet, and they used to think that the rope may cost a few dirhams.\"",
      "usc_msa_ref": "774",
      "chain": [
        "30204",
        "20317",
        "11060",
        "19291",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6887",
      "hadith_no": "6887",
      "source": "Sahih Bukhari",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا الأعمش، قال سمعت أبا صالح، قال سمعت أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لعن الله السارق، يسرق البيضة فتقطع يده، ويسرق الحبل فتقطع يده ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah 's Apostle said, \"Allah curses the thief who steals an egg (or a helmet) for which his hand is to be cut off, or steals a rope, for which his hand is to be cut off.\"",
      "usc_msa_ref": "791",
      "chain": [
        "20040",
        "20256",
        "11060",
        "19291",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-7403-2",
      "hadith_no": "7403",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "‏ حدثنا إسحاق بن منصور، حدثنا أبو أسامة، حدثنا الأعمش، حدثنا أبو صالح، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يجاء بنوح يوم القيامة فيقال له هل بلغت فيقول نعم يا رب‏.‏ فتسأل أمته هل بلغكم فيقولون ما جاءنا من نذير‏.‏ فيقول من شهودك فيقول محمد وأمته‏.‏ فيجاء بكم فتشهدون ‏\"‏‏.‏ ثم قرأ رسول الله صلى الله عليه وسلم ‏{‏وكذلك جعلناكم أمة وسطا‏}‏ قال عدلا ‏{‏لتكونوا شهداء على الناس ويكون الرسول عليكم شهيدا‏}‏وعن جعفر بن عون، حدثنا الأعمش، عن أبي صالح، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم بهذا‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20318",
        "11060",
        "19291",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-7435",
      "hadith_no": "7435",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا إسحاق بن منصور، حدثنا أبو أسامة، حدثنا الأعمش، حدثنا أبو صالح، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يجاء بنوح يوم القيامة فيقال له هل بلغت فيقول نعم يا رب‏.‏ فتسأل أمته هل بلغكم فيقولون ما جاءنا من نذير‏.‏ فيقول من شهودك فيقول محمد وأمته‏.‏ فيجاء بكم فتشهدون ‏\"‏‏.‏ ثم قرأ رسول الله صلى الله عليه وسلم ‏{‏وكذلك جعلناكم أمة وسطا‏}‏ قال عدلا ‏{‏لتكونوا شهداء على الناس ويكون الرسول عليكم شهيدا‏}‏ وعن جعفر بن عون، حدثنا الأعمش، عن أبي صالح، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم بهذا‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle said, \"Noah will be brought (before Allah) on the Day of Resurrection, and will be asked, 'Did you convey the message of Allah?\" He will reply, 'Yes, O Lord.' And then Noah's nation will be asked, 'Did he (Noah) convey Allah's message to you?' They will reply, 'No warner came to us.' Then Noah will be asked, 'Who are your witnesses?' He will reply. '(My witnesses are) Muhammad and his followers.' Thereupon you (Muslims) will be brought and you will bear witness.\" Then the Prophet recited: 'And thus We have made of you (Muslims) a just and the best nation, that you might be witness over the nations, and the Apostle a witness over you.' (2.143)",
      "usc_msa_ref": "448",
      "chain": [
        "30313",
        "20318",
        "11060",
        "19291",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-7494",
      "hadith_no": "7494",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، سمعت أبا صالح، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ يقول الله تعالى أنا عند ظن عبدي بي، وأنا معه إذا ذكرني، فإن ذكرني في نفسه ذكرته في نفسي، وإن ذكرني في ملأ ذكرته في ملأ خير منهم، وإن تقرب إلى بشبر تقربت إليه ذراعا، وإن تقرب إلى ذراعا تقربت إليه باعا، وإن أتاني يمشي أتيته هرولة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Allah says: 'I am just as My slave thinks I am, (i.e. I am able to do for him what he thinks I can do for him) and I am with him if He remembers Me. If he remembers Me in himself, I too, remember him in Myself; and if he remembers Me in a group of people, I remember him in a group that is better than they; and if he comes one span nearer to Me, I go one cubit nearer to him; and if he comes one cubit nearer to Me, I go a distance of two outstretched arms nearer to him; and if he comes to Me walking, I go to him running.' \"",
      "usc_msa_ref": "502",
      "chain": [
        "30204",
        "20317",
        "11060",
        "19291",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-7574",
      "hadith_no": "7574",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، حدثنا أبو صالح، عن أبي سعيد الخدري  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ يقول الله يا آدم‏.‏ فيقول لبيك وسعديك‏.‏ فينادى بصوت إن الله يأمرك أن تخرج من ذريتك بعثا إلى النار ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"Allah will say (on the Day of Resurrection), 'O Adam!' Adam will reply, 'Labbaik wa Sa`daik! ' Then a loud Voice will be heard (Saying) 'Allah Commands you to take out the mission of the Hell Fire from your offspring.' \"",
      "usc_msa_ref": "575",
      "chain": [
        "30204",
        "20317",
        "11060",
        "19291",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-207",
      "hadith_no": "207",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني أمية بن بسطام، حدثنا يزيد، - يعني ابن زريع - حدثنا روح، - وهو ابن القاسم - حدثنا سهيل، عن عطاء بن يزيد، سمعه وهو، يحدث أبا صالح عن تميم الداري، عن رسول الله صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " Umayya b. Bistam narrates the same hadith of the Messenger of Allah (may peace and blessings be upon him) on the authority of Tamim ad-Dari.",
      "usc_msa_ref": "",
      "chain": [
        "30124",
        "20304",
        "11586",
        "11206",
        "19291",
        "382"
      ]
    },
    {
      "id": "sahih-muslim-5541",
      "hadith_no": "5541",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الرحمن، - يعني ابن مهدي - حدثنا شعبة، عن أبي عون، قال سمعت أبا صالح، يحدث عن علي، قال أهديت لرسول الله صلى الله عليه وسلم حلة سيراء فبعث بها إلى فلبستها فعرفت الغضب في وجهه فقال ‏\"‏ إني لم أبعث بها إليك لتلبسها إنما بعثت بها إليك لتشققها خمرا بين النساء ‏\"‏ ‏.‏",
      "text_en": " 'Ali reported:                      A silk cloak was presented to Allah's Messenger (may peace be upon him). and he sent it to me and I wore it. but then found some sign of disapproval upon his face, whereupon he said: I did not send it to you that you wear it, but I sent it to you so that you might tear it and make out head dream for your women.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20033",
        "20020",
        "11649",
        "19291",
        "5"
      ]
    },
    {
      "id": "sahih-muslim-7029",
      "hadith_no": "7029",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي ح، وحدثناه نصر بن علي الجهضمي، حدثنا أبو أسامة، قالا حدثنا الأعمش، عن أبي صالح، وفي حديث أبي أسامة حدثنا أبو صالح عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم بمثل حديث أبي معاوية غير أن حديث أبي أسامة ليس فيه ذكر التيسير على المعسر ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters but with a slight variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "20318",
        "11060",
        "11161",
        "19291",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-3236",
      "hadith_no": "3236",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا شعبة، عن محمد بن جحادة، قال سمعت أبا صالح، يحدث عن ابن عباس، قال لعن رسول الله صلى الله عليه وسلم زائرات القبور والمتخذين عليها المساجد والسرج ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) cursed women who visit graves, those who built mosques over them and erected lamps (there).",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20020",
        "18897",
        "19291",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-4043",
      "hadith_no": "4043",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن أبي عون، قال سمعت أبا صالح، يحدث عن علي، رضى الله عنه قال أهديت إلى رسول الله صلى الله عليه وسلم حلة سيراء فأرسل بها إلى فلبستها فأتيته فرأيت الغضب في وجهه وقال ‏\"‏ إني لم أرسل بها إليك لتلبسها ‏\"‏ ‏.‏ وأمرني فأطرتها بين نسائي ‏.‏",
      "text_en": " Ali said:                      A robe containing silk was presented to the Messenger of Allah (ﷺ). He then sent it to me. I wore it and came to him. I saw him looking angry in his face. He then said: I did not send it to you to wear. He ordered me and I divided it among my women.",
      "usc_msa_ref": "",
      "chain": [
        "20193",
        "20020",
        "11649",
        "19291",
        "5"
      ]
    },
    {
      "id": "sunan-abi-daud-4396",
      "hadith_no": "4396",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا أبو صالح، عن الليث، قال حدثني يونس، عن ابن شهاب، قال كان عروة يحدث أن عائشة رضى الله عنها قالت استعارت امرأة - تعني - حليا على ألسنة أناس يعرفون ولا تعرف هي فباعته فأخذت فأتي بها النبي صلى الله عليه وسلم فأمر بقطع يدها وهي التي شفع فيها أسامة بن زيد وقال فيها رسول الله صلى الله عليه وسلم ما قال ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     A woman borrowed jewellery through some known persons and she herself was unknown. She then sold them. She was seized and brought to the Prophet (ﷺ). He gave orders that her hand should be cut off. It is this woman about whom Usamah interceded and of her the Messenger of Allah (ﷺ) said whatever he said.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "19291",
        "20023",
        "20475",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-4537",
      "hadith_no": "4537",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا أبو صالح، أخبرنا أبو إسحاق الفزاري، عن الجريري، عن أبي نضرة، عن أبي فراس، قال خطبنا عمر بن الخطاب رضى الله عنه فقال إني لم أبعث عمالي ليضربوا أبشاركم ولا ليأخذوا أموالكم فمن فعل به ذلك فليرفعه إلى أقصه منه قال عمرو بن العاص لو أن رجلا أدب بعض رعيته أتقصه منه قال إي والذي نفسي بيده أقصه وقد رأيت رسول الله صلى الله عليه وسلم أقص من نفسه ‏.‏",
      "text_en": " Narrated Abu Firas:                     'Umar b. al-Khattab (ra) addressed us and said: I did not send my collectors (of zakat) so that they strike your bodies and that they take your property. If that is done with someone and he appeals to me, I shall take retaliation on him. Amr ibn al-'As said: If any man (i.e. governor) inflicts disciplinary punishment on his subjects, would you take retaliation on him too? He said: Yes, by Him in Whose hand my soul is, I shall take retaliation on him. I saw that the Messenger of Allah (ﷺ) has given retaliation on himself.",
      "usc_msa_ref": "",
      "chain": [
        "19291",
        "20405",
        "11286",
        "10721"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2179",
      "hadith_no": "2179",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، عن شعبة، عن الأعمش، قال سمعت أبا صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قتل نفسه بحديدة فحديدته في يده يتوجأ بها في بطنه في نار جهنم خالدا مخلدا فيها أبدا ومن قتل نفسه بسم فسمه في يده يتحساه في نار جهنم خالدا مخلدا فيها أبدا ومن تردى من جبل فقتل نفسه فهو يتردى في نار جهنم خالدا مخلدا فيها أبدا ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated (that the the Messenger of Allah (s.a.w)) said:                     \"Whoever kills himself with (an instrument of)iron, his iron will be in his hand, to continually stab himself in his stomach with it, in the fire of Jahannam, dwelling in that state eternally. And whoever kills himself with poison, then his poison will be in his hand, to continually take it in the Fire of Jahannam, dwelling in that state eternally. And whoever throws himself from a mountain to kill himself, then he will be continually throwing himself in the Fire of Jahannam, dwelling in that state eternally\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20547",
        "20020",
        "11060",
        "19291",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-1137",
      "hadith_no": "1137",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن سلمة، قال حدثنا ابن وهب، عن عمرو، - يعني ابن الحارث - عن عمارة بن غزية، عن سمى، أنه سمع أبا صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أقرب ما يكون العبد من ربه عز وجل وهو ساجد فأكثروا الدعاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah (ﷺ) said: \"The closest that a person can be to his Lord, the Mighty and Sublime, is when he is prostrating, so increase in supplication then.\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "20029",
        "20377",
        "11894",
        "11428",
        "19291",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3170",
      "hadith_no": "3170",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا عبد الرحمن بن مهدي، قال حدثنا ابن المبارك، قال حدثنا أبو معن، قال حدثنا زهرة بن معبد، عن أبي صالح، مولى عثمان قال قال عثمان بن عفان رضي الله عنه سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ يوم في سبيل الله خير من ألف يوم فيما سواه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Salih, the freed slace of 'Uthman, said:                      \"uthman bin 'Affan said: 'I heard the Messenger of Allah (ﷺ) say: A day in the cause of Allah is better than a thousand days doing anything else.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20033",
        "20025",
        "11507",
        "19291",
        "4"
      ]
    },
    {
      "id": "sunan-an-nasai-5471",
      "hadith_no": "5471",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثنا بقية، قال حدثنا ضبارة، عن دويد بن نافع، قال قال أبو صالح قال أبو هريرة إن رسول الله صلى الله عليه وسلم كان يدعو ‏\"‏ اللهم إني أعوذ بك من الشقاق والنفاق وسوء الأخلاق ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                     \"The Messenger of Allah [SAW] used to say in his supplication: 'Allahumma inni a'udhu bika minash-shiqaqi wan-nifaqi, wa suw'il-akhlaq (O Allah, I seek refuge with You from opposing the truth, hypocrisy and bad manners.)'\"",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "20644",
        "16029",
        "19291",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-747",
      "hadith_no": "747",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا علي بن داود، ومحمد بن أبي الحسين، قالا حدثنا أبو صالح، حدثني الليث، حدثني نافع، عن ابن عمر، عن عمر بن الخطاب، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ سبع مواطن لا تجوز فيها الصلاة ظاهر بيت الله والمقبرة والمزبلة والمجزرة والحمام وعطن الإبل ومحجة الطريق ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Umar bin Khattab that:                     The Messenger of Allah said: \"There are seven places where it is not permissible to perform the prayer: The top of the House of Allah; graveyards; garbage dumps; slaughterhouses; bathrooms; the area that camels rest, and the main road.\"",
      "usc_msa_ref": "",
      "chain": [
        "19291",
        "20023",
        "11014",
        "18",
        "3"
      ]
    },
    {
      "id": "sunan-ibn-majah-2797",
      "hadith_no": "2797",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا أبو صالح، عن ابن لهيعة، عن ابن أنعم، عن عبادة بن نسى، عن عبد الرحمن بن غنم، حدثنا معاذ بن جبل، وأبو عبيدة بن الجراح وعبادة بن الصامت وشداد بن أوس أن رسول الله صلى الله عليه وسلم قال ‏\"‏ المرأة إذا قتلت عمدا لا تقتل حتى تضع ما في بطنها إن كانت حاملا وحتى تكفل ولدها وإن زنت لم ترجم حتى تضع ما في بطنها وحتى تكفل ولدها ‏\"‏ ‏.‏",
      "text_en": " Mu'adh bin Jabal, Abu Ubaidah bin Jararah, Ubadah bin Samit and Shaddad bin Aws narrated that the Messenger of Allah (ﷺ) said:                     “If a woman kills someone deliberately, she should not be killed until she delivers what is in her womb, if she is pregnant, and until the child's sponsorship is guaranteed. And if a woman commits illegal sex, she should not be stoned until she delivers what is in her womb and until her child's sponsorship is guaranteed.”",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "19291",
        "20624",
        "5152",
        "32"
      ]
    },
    {
      "id": "sunan-ibn-majah-3347",
      "hadith_no": "3347",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا أبو صالح، حدثني الليث، عن يونس، عن ابن شهاب، بإسناده نحوه وقال قرصت ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "19291",
        "20023",
        "20475"
      ]
    },
    {
      "id": "sunan-ibn-majah-3827",
      "hadith_no": "3827",
      "source": "Sunan Ibn Majah",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، حدثنا أبو المليح المدني، قال سمعت أبا صالح، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من لم يدع الله سبحانه غضب عليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the :                     Messenger of Allah (saas) said: \"Whoever does not call upon Allah, He will be angry with him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "38409",
        "20032",
        "19291",
        "13"
      ]
    }
  ],
  "total_hadiths": 38
}