{
  "id": "19340",
  "name": "Abu 'Amr al-Saybani أبو عمرو السيباني",
  "full_name": "Abu 'Amr al-Saybani أبو عمرو السيباني",
  "grade": "Follower(Tabi') [2nd Generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [بخ  البخاري  في  الأدب  المفرد]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "3710",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا عيسى بن محمد، حدثنا ضمرة، عن السيباني، عن عبد الله بن الديلمي، عن أبيه، قال أتينا رسول الله صلى الله عليه وسلم فقلنا يا رسول الله قد علمت من نحن ومن أين نحن فإلى من نحن قال ‏\"‏ إلى الله وإلى رسوله ‏\"‏ ‏.‏ فقلنا يا رسول الله إن لنا أعنابا ما نصنع بها قال ‏\"‏ زببوها ‏\"‏ ‏.‏ قلنا ما نصنع بالزبيب قال ‏\"‏ انبذوه على غدائكم واشربوه على عشائكم وانبذوه على عشائكم واشربوه على غدائكم وانبذوه في الشنان ولا تنبذوه في القلل فإنه إذا تأخر عن عصره صار خلا ‏\"‏ ‏.‏",
      "text_en": " Narrated Ad-Daylami:                     We came to the Prophet (ﷺ) and said to him: Messenger of Allah, you know who we are, from where we are and to whom we have come. He said: To Allah and His Apostle. We said: Messenger of Allah, we have grapes; what should we do with them? He said: Make them raisins. We then asked: What should we do with raisins? He replied: Steep them in the morning and drink in the evening, and steep them in the evening and drink in the morning. Steep them in skin vessels and do not steep them in earthen jar, for it it is delayed in pressing, it becomes vinegar.",
      "chain": [
        "20738",
        "19340",
        "5136",
        "5229"
      ]
    },
    {
      "hadith_no": "4302",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا عيسى بن محمد الرملي، حدثنا ضمرة، عن السيباني، عن أبي سكينة، - رجل من المحررين - عن رجل، من أصحاب النبي صلى الله عليه وسلم عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ دعوا الحبشة ما ودعوكم واتركوا الترك ما تركوكم ‏\"‏ ‏.‏",
      "text_en": " Narrated from Abi Sukainah One of the Companions:                     The Prophet (ﷺ) said: Let the Abyssinians alone as long as they let you alone, and let the Turks alone as long as they leave you alone.",
      "chain": [
        "38443",
        "20738",
        "19340"
      ]
    },
    {
      "hadith_no": "4322",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا عيسى بن محمد، حدثنا ضمرة، عن السيباني، عن عمرو بن عبد الله، عن أبي أمامة، عن النبي صلى الله عليه وسلم نحوه وذكر الصلوات مثل معناه ‏.‏",
      "text_en": " A similar tradition has been transmitted by Abu Umamah from the prophet (ﷺ) through a different chain of narrators. In this version he mentioned the prayers to the same effect.",
      "chain": [
        "20738",
        "19340",
        "405"
      ]
    }
  ],
  "total_hadiths": 3
}