{
  "id": "1935",
  "name": "Fadala bin 'Ubaid bin Naqid ( فضالة بن عبيد بن نافذ ( رضي الله عنه",
  "full_name": "Fadala bin 'Ubaid bin Naqid ( فضالة بن عبيد بن نافذ ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medinah"
    },
    "death": {
      "date_hijri": "53",
      "date_gregorian": "673",
      "date_display": null,
      "place": "Damascus, Syria",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Egypt",
      "Syria",
      "Damascus"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ بخ  م  4  -  صحابة ]",
      "Qadhi(Judge)"
    ],
    "tags": [
      "Ansar",
      "Aws",
      "B.'Amr B.'Auf",
      "B.Jahjaba B.Kulfa",
      "Uhud",
      "Khandaq",
      "Ridwan"
    ]
  },
  "parents": [
    {
      "id": "1775",
      "name": "'Amira bint Muhammad ( عميرة بنت محمد بن عقبة ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "37",
      "name": "Abu al-Darda ( أبو الدرداء عويمر بن زيد بن قيس الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "10851",
      "name": "Thmamh bin Shfy ثمامة بن شفي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10905",
      "name": "Hnsh bin 'Abdullah حنش بن عبد الله ويقال",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19926",
      "name": "'Abdur Rahman bin Mhyryz عبد الرحمن بن محيريز الجمحي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10882",
      "name": "'Abdullah bin 'Amir عبد الله بن عامر بن يزيد بن تميم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "17028",
      "name": "Salman bin Smyr سلمان بن سمير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11253",
      "name": "'Abdullah bin Mahayraz عبد الله بن محيريز",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10870",
      "name": "'Ali bin Rabah bin Qasayr علي بن رباح بن قصير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19936",
      "name": "'Amr bin Malik al-Janbi al-Hamdani عمرو بن مالك الجنبي أبو علي الهمداني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11221",
      "name": "Muhammad bin Ka'b bin Sulaym al-Qarzi محمد بن كعب بن سليم بن أسد القرظي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "26049",
      "name": "Abu Yazid al-Khwlany al-Msry أبو يزيد الخولاني المصري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-4159",
      "hadith_no": "4159",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثني أبو الطاهر، أحمد بن عمرو بن سرح أخبرنا ابن وهب، أخبرني أبو هانئ الخولاني أنه سمع على بن رباح اللخمي، يقول سمعت فضالة بن عبيد الأنصاري، يقول أتي رسول الله صلى الله عليه وسلم وهو بخيبر بقلادة فيها خرز وذهب وهي من المغانم تباع فأمر رسول الله صلى الله عليه وسلم بالذهب الذي في القلادة فنزع وحده ثم قال لهم رسول الله صلى الله عليه وسلم ‏\"‏ الذهب بالذهب وزنا بوزن ‏\"‏ ‏.‏",
      "text_en": " Fadala b. Ubaid al-Ansari reported:                      A necklace having gold and gems in it was brought to Allah's Messenger (may peace be upon him) in Khaibar and it was one of the spoils of war and was put to sale. Allah's Messenger (may peace be upon him) said: The gold used in it should be separated, and then Allah's Messenger (may peace be upon him) further said: (Sell) gold for gold with equal weight.",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "10856",
        "1935"
      ]
    },
    {
      "id": "sahih-muslim-4160",
      "hadith_no": "4160",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن أبي شجاع، سعيد بن يزيد عن خالد بن، أبي عمران عن حنش الصنعاني، عن فضالة بن عبيد، قال اشتريت يوم خيبر قلادة باثنى عشر دينارا فيها ذهب وخرز ففصلتها فوجدت فيها أكثر من اثنى عشر دينارا فذكرت ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ لا تباع حتى تفصل ‏\"‏ ‏.‏",
      "text_en": " Fadila b. 'Ubaid (Allah be pleased with him) reported:                      I bought on the day (of the Victory of Khaibar) a necklace for twelve dinars (gold coins). It was made of gold studded with gems. I separated (gold from gems) in it, and found (gold) of more (worth) than twelve dinars. I made a mention of it to Allah's Apostle (may peace be upon him), whereupon he said: It should not be sold unless it is separated.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "20653",
        "10906",
        "10905",
        "1935"
      ]
    },
    {
      "id": "sahih-muslim-4162",
      "hadith_no": "4162",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن ابن أبي جعفر، عن الجلاح أبي كثير، حدثني حنش الصنعاني، عن فضالة بن عبيد، قال كنا مع رسول الله صلى الله عليه وسلم يوم خيبر نبايع اليهود الوقية الذهب بالدينارين والثلاثة فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تبيعوا الذهب بالذهب إلا وزنا بوزن ‏\"‏ ‏.‏",
      "text_en": " Fadala b. 'Ubaid reported:                      We were in the company of Allah's Messenger ( may peace be upon him) on the day (of the Victory of) Khaibar, and made transaction with the Jews for the 'uqiya of gold for the dinars or three (gold coins), whereupon Allah's Messenger (may peace be upon him) said: Do not sell gold for gold but for equal weight",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "10905",
        "1935"
      ]
    },
    {
      "id": "sunan-abi-daud-2500",
      "hadith_no": "2500",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا عبد الله بن وهب، حدثني أبو هانئ، عن عمرو بن مالك، عن فضالة بن عبيد، أن رسول الله صلى الله عليه وسلم قال ‏:‏ ‏\"‏ كل الميت يختم على عمله، إلا المرابط فإنه ينمو له عمله إلى يوم القيامة ويؤمن من فتان القبر ‏\"‏ ‏.‏",
      "text_en": " Narrated Fadalah ibn Ubayd:                     The Prophet (ﷺ) said: Everyone who dies will have fully complete his action, except one who is on the frontier (in Allah's path), for his deeds will be made to go on increasing till the Day of Resurrection, and he will be safe from the trial in the grave.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20029",
        "1935"
      ]
    },
    {
      "id": "sunan-abi-daud-3351",
      "hadith_no": "3351",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن عيسى، وأبو بكر بن أبي شيبة وأحمد بن منيع قالوا حدثنا ابن المبارك، ح وحدثنا ابن العلاء، أخبرنا ابن المبارك، عن سعيد بن يزيد، حدثني خالد بن أبي عمران، عن حنش، عن فضالة بن عبيد، قال أتي النبي صلى الله عليه وسلم عام خيبر بقلادة فيها ذهب وخرز - قال أبو بكر وابن منيع فيها خرز معلقة بذهب - ابتاعها رجل بتسعة دنانير أو بسبعة دنانير فقال النبي صلى الله عليه وسلم ‏\"‏ لا حتى تميز بينه وبينه ‏\"‏ ‏.‏ فقال إنما أردت الحجارة فقال النبي صلى الله عليه وسلم ‏\"‏ لا حتى تميز بينهما ‏\"‏ ‏.‏ قال فرده حتى ميز بينهما ‏.‏ وقال ابن عيسى أردت التجارة ‏.‏ قال أبو داود وكان في كتابه الحجارة فغيره فقال التجارة ‏.‏",
      "text_en": " Narrated Fudalah ibn Ubayd:                     The Prophet (ﷺ) was brought a necklace in which there were gold and pearls. (The narrators AbuBakr and (Ahmad) Ibn Mani' said: The pearls were set with gold in it, and a man bought it for nine or seven dinars.) The Prophet (ﷺ) said: (It must not be sold) till the contents are considered separately. The narrator said: He returned it till the contents were considered separately. The narrator Ibn Asa said: By this I intended trade.Abu Dawud said: The word hijarah (stone) was recorded in his note-book before, but he changed it and narrated tijarah (trade).",
      "usc_msa_ref": "",
      "chain": [
        "31167",
        "20025",
        "20025",
        "10906",
        "15113",
        "1935"
      ]
    },
    {
      "id": "sunan-abi-daud-3352",
      "hadith_no": "3352",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن أبي شجاع، سعيد بن يزيد عن خالد بن أبي عمران، عن حنش الصنعاني، عن فضالة بن عبيد، قال اشتريت يوم خيبر قلادة باثنى عشر دينارا فيها ذهب وخرز ففصلتها فوجدت فيها أكثر من اثنى عشر دينارا فذكرت ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ لا تباع حتى تفصل ‏\"‏ ‏.‏",
      "text_en": " Narrated Fudalah bin 'Ubaid:                     At the battle of Khaibar I bought a necklace in which there were gold and pearls for twelve dinars. I separated them and found that its worth was more than twelve dinars. So I mentioned that to the Prophet (ﷺ) who said: It must not be sold till the contents are considered separately.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "20653",
        "10906",
        "10905",
        "1935"
      ]
    },
    {
      "id": "sunan-abi-daud-3353",
      "hadith_no": "3353",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن ابن أبي جعفر، عن الجلاح أبي كثير، حدثني حنش الصنعاني، عن فضالة بن عبيد، قال كنا مع رسول الله صلى الله عليه وسلم يوم خيبر نبايع اليهود الأوقية من الذهب بالدينار ‏.‏ قال غير قتيبة بالدينارين والثلاثة ‏.‏ ثم اتفقا فقال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تبيعوا الذهب بالذهب إلا وزنا بوزن ‏\"‏ ‏.‏",
      "text_en": " Narrated Fudalah bin 'Ubaid:                     We were with the Messenger of Allah (ﷺ) at the battle of Khaibar. We were selling to the Jews one uqiyah of gold for one dinar. The narrators other than Qutaibah said: \"for two or three dinars.\" Then both the versions agreed. The Messenger of Allah (ﷺ) said: Do not sell gold except with equal weight.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "10905",
        "1935"
      ]
    },
    {
      "id": "sunan-abi-daud-3892",
      "hadith_no": "3892",
      "source": "Sunan Abi Da'ud",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا يزيد بن خالد بن موهب الرملي، حدثنا الليث، عن زياد بن محمد، عن محمد بن كعب القرظي، عن فضالة بن عبيد، عن أبي الدرداء، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من اشتكى منكم شيئا أو اشتكاه أخ له فليقل ربنا الله الذي في السماء تقدس اسمك أمرك في السماء والأرض كما رحمتك في السماء فاجعل رحمتك في الأرض اغفر لنا حوبنا وخطايانا أنت رب الطيبين أنزل رحمة من رحمتك وشفاء من شفائك على هذا الوجع فيبرأ ‏\"‏ ‏.‏",
      "text_en": " Narrated AbudDarda':                     I heard the Messenger of Allah (ﷺ) say: If any of you is suffering from anything or his brother is suffering, he should say: Our Lord is Allah Who is in the heaven, holy is Thy name, Thy command reigns supreme in the heaven and the earth, as Thy mercy in the heaven, make Thy mercy  in the earth; forgive us our sins, and our errors; Thou art the Lord of good men; send down mercy from Thy mercy, and remedy, and remedy from Thy remedy on this pain so that it is healed up.",
      "usc_msa_ref": "",
      "chain": [
        "38715",
        "20023",
        "11221",
        "1935",
        "37"
      ]
    },
    {
      "id": "sunan-abi-daud-4411",
      "hadith_no": "4411",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عمر بن علي، حدثنا الحجاج، عن مكحول، عن عبد الرحمن بن محيريز، قال سألنا فضالة بن عبيد عن تعليق اليد، في العنق للسارق أمن السنة هو قال أتي رسول الله صلى الله عليه وسلم بسارق فقطعت يده ثم أمر بها فعلقت في عنقه ‏.‏",
      "text_en": " 'Abd al-Rahman b. Muhariz said:                     We asked Fadalah b. 'Ubaid about the hanging the (amputated) hand on the neck of a thief whether it was a sunnan. He said: A thief was brought to the Messenger of Allah (ﷺ) and his hand was cut off. Thereafter he commanded for it, and it was hung on his neck.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20265",
        "20381",
        "11066",
        "19926",
        "1935"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1255",
      "hadith_no": "1255",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن أبي شجاع، سعيد بن يزيد عن خالد بن أبي عمران، عن حنش الصنعاني، عن فضالة بن عبيد، قال اشتريت يوم خيبر قلادة باثنى عشر دينارا فيها ذهب وخرز ففصلتها فوجدت فيها أكثر من اثنى عشر دينارا فذكرت ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ لا تباع حتى تفصل ‏\"‏ ‏.‏",
      "text_en": " Narrated Fadalah bin 'Ubaidah:                     \"On the Day of Khaibar I purchased a necklace that contained gold and jewels for twelve Dinar. I separated it and found that it was worth more than twelve Dinar. I mentioned that to the Prophet (ﷺ) and he said: 'Do not sell it until it is separated.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "20653",
        "10906",
        "10905",
        "1935"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1447",
      "hadith_no": "1447",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا قتيبة، حدثنا عمر بن علي المقدمي، حدثنا الحجاج، عن مكحول، عن عبد الرحمن بن محيريز، قال سألت فضالة بن عبيد عن تعليق اليد، في عنق السارق أمن السنة هو قال أتي رسول الله صلى الله عليه وسلم بسارق فقطعت يده ثم أمر بها فعلقت في عنقه ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث عمر بن علي المقدمي عن الحجاج بن أرطاة ‏.‏ وعبد الرحمن بن محيريز هو أخو عبد الله بن محيريز شامي ‏.‏",
      "text_en": " 'Abdur-Rahman bin Muhariz said:                      \"I asked Fadalah bin 'Ubaid about hanging the hand around the neck of the thief: 'Is this from the Sunnah?' He said: 'A man came to the Messenger of Allah (ﷺ) with a thief so his hand was cut off, and then he ordered that it be hung around his neck.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20265",
        "20381",
        "11066",
        "19926",
        "1935"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1621",
      "hadith_no": "1621",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا أحمد بن محمد، أخبرنا عبد الله بن المبارك، أخبرنا حيوة بن شريح، قال أخبرني أبو هانئ الخولاني، أن عمرو بن مالك الجنبي، أخبره أنه، سمع فضالة بن عبيد، يحدث عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ كل ميت يختم على عمله إلا الذي مات مرابطا في سبيل الله فإنه ينمى له عمله إلى يوم القيامة ويأمن من فتنة القبر ‏\"‏ ‏.‏ وسمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ المجاهد من جاهد نفسه ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عقبة بن عامر وجابر ‏.‏ وحديث فضالة بن عبيد حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Fadalah bin 'Ubaid:                     That the Messenger of Allah (ﷺ) said: \"The deeds of everyone who dies are sealed. Except for the one who dies guarding the frontier from the enemy, in the cause of Allah. For indeed his actions are increased for him until the Day of Judgement, and he is secure from the tribulation of the grave.\" And I heard the Messenger of Allah (ﷺ) saying: \"The Mujahid is one who strives against his own soul.\"[Abu 'Eisa said:] There are narrations on this topic from 'Uqbah bin 'Amir and Jabir.The Hadith is Fadalah is a Hasan Sahih Hadith.",
      "usc_msa_ref": "",
      "chain": [
        "30304",
        "20025",
        "26010",
        "10856",
        "1935"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1644",
      "hadith_no": "1644",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا قتيبة، حدثنا ابن لهيعة، عن عطاء بن دينار، عن أبي يزيد الخولاني، أنه سمع فضالة بن عبيد، يقول سمعت عمر بن الخطاب، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الشهداء أربعة رجل مؤمن جيد الإيمان لقي العدو فصدق الله حتى قتل فذلك الذي يرفع الناس إليه أعينهم يوم القيامة هكذا ‏\"‏ ‏.‏ ورفع رأسه حتى وقعت قلنسوته ‏.‏ قال فما أدري أقلنسوة عمر أراد أم قلنسوة النبي صلى الله عليه وسلم قال ‏\"‏ ورجل مؤمن جيد الإيمان لقي العدو فكأنما ضرب جلده بشوك طلح من الجبن أتاه سهم غرب فقتله فهو في الدرجة الثانية ورجل مؤمن خلط عملا صالحا وآخر سيئا لقي العدو فصدق الله حتى قتل فذلك في الدرجة الثالثة ورجل مؤمن أسرف على نفسه لقي العدو فصدق الله حتى قتل فذلك في الدرجة الرابعة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث عطاء بن دينار ‏.‏ قال سمعت محمدا يقول قد روى سعيد بن أبي أيوب هذا الحديث عن عطاء بن دينار وقال عن أشياخ من خولان ولم يذكر فيه عن أبي يزيد ‏.‏ وقال عطاء بن دينار ليس به بأس ‏.‏",
      "text_en": " Narrated Fadalah bin 'Ubaid:                     That he heard 'Umar bin Al-Khattab saying: \"I heard the Messenger of Allah (ﷺ) saying: 'The martyrs are four: A believing man whose faith is good, he meets the enemy and proves faithful to Allah until he is killed. That is the one to whom the people will raise up their eyes like this on the Day of Judgement' and he raised his head until his Qalansuwah fell - [he said:] I do not know if it was 'Umar's Qalansuwah or the Qalansuwah of the Prophet (ﷺ) that fell - he said, 'And a believing man whose faith is good (but not as brave as first), he meets the enemy, but due to cowardice, it only appears that he was struck with a thorn of an acacia tree when an unexpected arrow comes to him, yet it kills him. He is among the second level. And a believing man who has mixed righteous deed with another evil one, he meets his enemy and proves faithful to Allah until he is killed. This one is in the third level. And a believing man who wasted himself (in wrongdoing), he meets the enemy and proves faithful to Allah until he is killed. This one is in the fourth level.'\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, it is not known except as a narration of 'Ata bin Dinar.He said: I heard Muhammad saying: \"Sa'eed bin Abi Ayyub reported this Hadith from 'Ata bin Dinar - from some Shaikhs of Khawlan - and he did not mention 'from Abu Yazid' in it.\" And he said: \"'Ata bin Dinar; there is no harm in him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20624",
        "16075",
        "26049",
        "1935",
        "3"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2349",
      "hadith_no": "2349",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا العباس بن محمد الدوري، حدثنا عبد الله بن يزيد المقرئ، أخبرنا حيوة بن شريح، أخبرني أبو هانئ الخولاني، أن أبا علي، عمرو بن مالك الجنبي أخبره عن فضالة بن عبيد، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ طوبى لمن هدي إلى الإسلام وكان عيشه كفافا وقنع ‏\"‏ ‏.‏ قال وأبو هانئ اسمه حميد بن هانئ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Fadalah bin 'Ubaid narrated that he heard the Messenger of Allah (s.a.w) saying:                     \"Glad tidings to whoever is guided to Islam, his livelihood was sufficient and he was satisfied.\"",
      "usc_msa_ref": "",
      "chain": [
        "23033",
        "26010",
        "10856",
        "19936",
        "1935"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2368",
      "hadith_no": "2368",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا العباس بن محمد الدوري، حدثنا عبد الله بن يزيد، حدثنا حيوة بن شريح، أخبرني أبو هانئ الخولاني، أن أبا علي، عمرو بن مالك الجنبي أخبره عن فضالة بن عبيد، أن رسول الله صلى الله عليه وسلم كان إذا صلى بالناس يخر رجال من قامتهم في الصلاة من الخصاصة وهم أصحاب الصفة حتى تقول الأعراب هؤلاء مجانين أو مجانون فإذا صلى رسول الله صلى الله عليه وسلم انصرف إليهم فقال ‏\"‏ لو تعلمون ما لكم عند الله لأحببتم أن تزدادوا فاقة وحاجة ‏\"‏ ‏.‏ قال فضالة وأنا يومئذ مع رسول الله صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Fadalah bin 'Ubaid narrated that when the Messenger of Allah (s.a.w) would lead the people in Salat some men would collapse among them during the Salat due to hunger",
      "usc_msa_ref": "",
      "chain": [
        "1945",
        "26010",
        "10856",
        "19936",
        "1935"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2705-2",
      "hadith_no": "2705",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا سويد بن نصر، أنبأنا عبد الله، أنبأنا حيوة بن شريح، أخبرني أبو هانئ، اسمه حميد بن هانئ الخولاني عن أبي علي الجنبي، عن فضالة بن عبيد، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يسلم الفارس على الماشي والماشي على القائم والقليل على الكثير ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وأبو علي الجنبي اسمه عمرو بن مالك ‏.‏",
      "text_en": " Narrated Fadalah bin 'Ubaid:                     that the Messenger of Allah (ﷺ) said: \"The horseman gives Salam to the walking person, the walking person to the one standing and the few to the many.\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "26010",
        "1935"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3476-2",
      "hadith_no": "3476",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا قتيبة، حدثنا رشدين بن سعد، عن أبي هانئ الخولاني، عن أبي علي الجنبي، عن فضالة بن عبيد، قال بينا رسول الله صلى الله عليه وسلم قاعدا إذ دخل رجل فصلى فقال اللهم اغفر لي وارحمني ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ عجلت أيها المصلي إذا صليت فقعدت فاحمد الله بما هو أهله وصل على ثم ادعه ‏\"‏ ‏.‏ قال ثم صلى رجل آخر بعد ذلك فحمد الله وصلى على النبي صلى الله عليه وسلم فقال له النبي صلى الله عليه وسلم ‏\"‏ أيها المصلي ادع تجب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن رواه حيوة بن شريح عن أبي هانئ الخولاني وأبو هانئ اسمه حميد بن هانئ وأبو علي الجنبي اسمه عمرو بن مالك ‏.‏",
      "text_en": " Fadalah bin Ubaid narrated:                     “While the Messenger of Allah was seated, a man entered and performed Salat, and he said: ‘O Allah, forgive me, and have mercy upon me.’ The Messenger of Allah said: ‘You have rushed, O praying person. When you perform Salat, and then sit, then praise Allah with what He is deserving of, and send Salat upon me, then call upon Him.’” He said: “Then another man performed Salat after that, so he praised Allah and sent Salat upon the Prophet. The Prophet said to him: ‘O praying person! Supplicate, and you shall be answered.’”",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "26012",
        "10856",
        "1935"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3477-2",
      "hadith_no": "3477",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا عبد الله بن يزيد المقرئ، حدثنا حيوة بن شريح، حدثني أبو هانئ الخولاني، أن عمرو بن مالك الجنبي، أخبره أنه، سمع فضالة بن عبيد، يقول سمع النبي صلى الله عليه وسلم رجلا يدعو في صلاته فلم يصل على النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ عجل هذا ‏\"‏ ‏.‏ ثم دعاه فقال له أو لغيره ‏\"‏ إذا صلى أحدكم فليبدأ بتحميد الله والثناء عليه ثم ليصل على النبي صلى الله عليه وسلم ثم ليدع بعد بما شاء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Amr bin Malik Al-Janbi narrated that he heard Fadalah bin Ubaid saying:                     “The Prophet heard a man supplicating in his Salat but he did not send Salat upon the Prophet, so the Prophet said: ‘This one has rushed.’ Then he called him and said to him, or to someone othat than him: ‘When one of you performs Salat, then let him begin by expressing gratitude to Allah and praising Him. Then, let him send Salat upon the Prophet, then let him supplicate after that, whatever he wishes.’”",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "23033",
        "26010",
        "10856",
        "1935"
      ]
    },
    {
      "id": "sunan-an-nasai-1284",
      "hadith_no": "1284",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن سلمة، قال حدثنا ابن وهب، عن حيوة بن شريح، عن أبي هانئ، أن أبا علي الجنبي، حدثه أنه، سمع فضالة بن عبيد، يقول سمع رسول الله صلى الله عليه وسلم رجلا يدعو في صلاته لم يمجد الله ولم يصل على النبي صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ عجلت أيها المصلي ‏\"‏ ‏.‏ ثم علمهم رسول الله صلى الله عليه وسلم وسمع رسول الله صلى الله عليه وسلم رجلا يصلي فمجد الله وحمده وصلى على النبي صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ ادع تجب وسل تعط ‏\"‏ ‏.‏",
      "text_en": " Fadalah bin Ubaid said:                     \"The Messenger of Allah (ﷺ) heard a man supplicating during the prayer without glorifying Allah (SWT) nor sending salah upon the Prophet (ﷺ). The Messenger of Allah (ﷺ) said: 'You are in a hurry, O worshipper.' Then the Messenger of Allah (ﷺ) taught them. And the Messenger of Allah (ﷺ) heard a man praying; he glorified and praised Allah (SWT) and sent salah upon the Prophet (ﷺ). The Messenger of Allah (ﷺ) said: 'Supplicate, you will be answered; ask, you will be given.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "20029",
        "26010",
        "1935"
      ]
    },
    {
      "id": "sunan-an-nasai-3133",
      "hadith_no": "3133",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "قال الحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن وهب، قال أخبرني أبو هانئ، عن عمرو بن مالك الجنبي، أنه سمع فضالة بن عبيد، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ أنا زعيم - والزعيم الحميل - لمن آمن بي وأسلم وهاجر ببيت في ربض الجنة وببيت في وسط الجنة وأنا زعيم لمن آمن بي وأسلم وجاهد في سبيل الله ببيت في ربض الجنة وببيت في وسط الجنة وببيت في أعلى غرف الجنة من فعل ذلك فلم يدع للخير مطلبا ولا من الشر مهربا يموت حيث شاء أن يموت ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Malik Al-Janbi that he heard Fadalah bin 'Ubaid say:                      \"I heard the Messenger of Allah (ﷺ) say: 'I am a Za'im - and the Za'im is the guarantor - for the one who believes in me and accepts Islam, and emigrates: A house on the outskirts of Paradise and a house in the middle of Paradise. And I am a guarantor, for the one who believes in me and accepts Islam, and strives in the cause of Allah: A house on the outskirts of Paradise and a house in the middle of Paradise and a house in the highest chambers of Paradise. Whoever does that and seeks goodness wherever it is, and avoids evil wherever it is, may die wherever he wants to die.'\"",
      "usc_msa_ref": "",
      "chain": [
        "36017",
        "20029",
        "1935"
      ]
    },
    {
      "id": "sunan-an-nasai-4573",
      "hadith_no": "4573",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن أبي شجاع، سعيد بن يزيد عن خالد بن أبي عمران، عن حنش الصنعاني، عن فضالة بن عبيد، قال اشتريت يوم خيبر قلادة فيها ذهب وخرز باثنى عشر دينارا ففصلتها فوجدت فيها أكثر من اثنى عشر دينارا فذكر ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ لا تباع حتى تفصل ‏\"‏ ‏.‏",
      "text_en": " It was narrated the Fadalah bin 'Ubaid said:                     \"On the Day of Khaibar I bought a necklace containing gold and ggems for twelve Dinars. The I took it apart and found that it contatined more than twelve Dinars. Mentiion of that was made to the Prophet and he said: 'It should not be sold until it is taken apart.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "20653",
        "10906",
        "10905",
        "1935"
      ]
    },
    {
      "id": "sunan-an-nasai-4574",
      "hadith_no": "4574",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا محمد بن محبوب، قال حدثنا هشيم، قال أنبأنا الليث بن سعد، عن خالد بن أبي عمران، عن حنش الصنعاني، عن فضالة بن عبيد، قال أصبت يوم خيبر قلادة فيها ذهب وخرز فأردت أن أبيعها فذكر ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ افصل بعضها من بعض ثم بعها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Fadalah bin 'Ubad said:                     \"On the Day of Khaibar I got a necklace containing gold and gems, and I wanted to sell it. Mention of that was made to the Prophet and he said: 'Take it apart, and then sell it.\"'",
      "usc_msa_ref": "",
      "chain": [
        "38433",
        "30171",
        "20468",
        "20023",
        "10906",
        "10905",
        "1935"
      ]
    },
    {
      "id": "sunan-an-nasai-4982",
      "hadith_no": "4982",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن أبي بكر بن علي، عن الحجاج، عن مكحول، عن ابن محيريز، قال سألت فضالة بن عبيد عن تعليق، يد السارق في عنقه قال سنة قطع رسول الله صلى الله عليه وسلم يد سارق وعلق يده في عنقه ‏.‏",
      "text_en": " It was narrated that Ibn Muhairiz said;\"I asked Fadalah bin 'Ubaid about hanging the hand (of the thief) from his neck, and he said:                      'It is Sunnah. The Messenger of Allah cut off a thief's hand then hung it from his neck.\"'(Daif)",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20381",
        "11066",
        "1935"
      ]
    },
    {
      "id": "sunan-ibn-majah-1401",
      "hadith_no": "1401",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا راشد بن سعيد بن راشد الرملي، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، حدثنا إسماعيل بن عبيد الله، عن ميسرة، مولى فضالة عن فضالة بن عبيد، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لله أشد أذنا إلى الرجل الحسن الصوت بالقرآن يجهر به من صاحب القينة إلى قينته ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Fadalah bin ‘Ubaid said:                      “The Messenger of Allah(ﷺ) said: ‘Allah listens more attentively to a man with abeautifulvoice who recites Qur’an out loud than the master of asinging slavelistens to his slave.’”",
      "usc_msa_ref": "",
      "chain": [
        "20733",
        "20024",
        "19058",
        "1935"
      ]
    },
    {
      "id": "sunan-ibn-majah-1745",
      "hadith_no": "1745",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يعلى، ومحمد، ابنا عبيد الطنافسي قالا حدثنا محمد بن إسحاق، عن يزيد بن أبي حبيب، عن أبي مرزوق، قال سمعت فضالة بن عبيد الأنصاري، يحدث أن النبي  صلى الله عليه وسلم  خرج عليهم في يوم كان يصومه فدعا بإناء فشرب فقلنا يا رسول الله إن هذا يوم كنت تصومه ‏.‏ قال ‏\"‏ أجل ولكني قئت ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Masruq said:                      “I heard Fadalah bin ‘UbaidAl-Ansari narrating that the Prophet (ﷺ) came out to them on a daywhenhe was fasting. He called for a vessel and drank. We said: ‘OMessenger of Allah, you were fasting today.’ He said: ‘Yes, but Ivomited.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20372",
        "11107",
        "11411",
        "16128",
        "1935"
      ]
    },
    {
      "id": "sunan-ibn-majah-2685",
      "hadith_no": "2685",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو بشر بكر بن خلف ومحمد بن بشار وأبو سلمة الجوباري يحيى بن خلف قالوا حدثنا عمر بن علي بن عطاء بن مقدم، عن حجاج، عن مكحول، عن ابن محيريز، قال سألت فضالة بن عبيد عن تعليق اليد، في العنق فقال السنة قطع رسول الله صلى الله عليه وسلم يد رجل ثم علقها في عنقه ‏.‏",
      "text_en": " It was narrated that Ibn Muhairiz said:                     “I asked Fadalah bin Ubaid about hanging the hand (of the thief) from this neck, and he said: 'It is sunnah. The messenger of Allah (ﷺ) cut off a man's hand then hung it from his neck'''",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20265",
        "20219",
        "11066",
        "1935"
      ]
    },
    {
      "id": "sunan-ibn-majah-4069",
      "hadith_no": "4069",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح المصري، حدثنا عبد الله بن وهب، عن أبي هانئ، عن عمرو بن مالك الجنبي، أن فضالة بن عبيد، حدثه أن النبي  صلى الله عليه وسلم  قال ‏\"‏ المؤمن من أمنه الناس على أموالهم وأنفسهم والمهاجر من هجر الخطايا والذنوب ‏\"‏ ‏.‏",
      "text_en": " Fadalah bin ‘Ubaid narrated that the Prophet (ﷺ) said:                      “Thebeliever is the one from whom their (people’s) wealth and lives aresafe, and the Muhajir is the one who forsakes mistakes and sins.”",
      "usc_msa_ref": "",
      "chain": [
        "20029",
        "1935"
      ]
    }
  ],
  "total_hadiths": 27
}