{
  "id": "19462",
  "name": "Jasrah bint Dajaja جسرة بنت دجاجة",
  "full_name": "Jasrah bint Dajaja جسرة بنت دجاجة",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ د  س  ق  -  مقبول ]"
    ],
    "tags": [
      "Female",
      "Kufi",
      "al-'Amiri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "23",
      "name": "Abu Dharr al-Ghaffari ( جندب بن جنادة أبو ذر الغفاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "56",
      "name": "Umm Salamah ( أم سلمة بنت أبي أمية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-abi-daud-232",
      "hadith_no": "232",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، حدثنا عبد الواحد بن زياد، حدثنا الأفلت بن خليفة، قال حدثتني جسرة بنت دجاجة، قالت سمعت عائشة، رضى الله عنها تقول جاء رسول الله صلى الله عليه وسلم ووجوه بيوت أصحابه شارعة في المسجد فقال ‏\"‏ وجهوا هذه البيوت عن المسجد ‏\"‏ ‏.‏ ثم دخل النبي صلى الله عليه وسلم ولم يصنع القوم شيئا رجاء أن تنزل فيهم رخصة فخرج إليهم بعد فقال ‏\"‏ وجهوا هذه البيوت عن المسجد فإني لا أحل المسجد لحائض ولا جنب ‏\"‏ ‏.‏ قال أبو داود وهو فليت العامري ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) came and saw that the doors of the houses of his Companions were facing the mosque. He said: Turn the direction of the houses from the mosque. The Prophet (ﷺ) then entered (the houses or the mosque), and the people did take any step in this regard hoping that some concession might be revealed. He the Prophet) again came upon them and said: Turn the direction of these (doors) from the mosque I do not make the mosque lawful for a menstruating woman and for a person who is sexually defiled.Abu Dawud said: Aflat b. Khalifah is also called Fulait al-'Amiri.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20256",
        "19462",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-3568",
      "hadith_no": "3568",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، حدثني فليت العامري، عن جسرة بنت دجاجة، قالت قالت عائشة رضى الله عنها ما رأيت صانعا طعاما مثل صفية صنعت لرسول الله صلى الله عليه وسلم طعاما فبعثت به فأخذني أفكل فكسرت الإناء فقلت يا رسول الله ما كفارة ما صنعت قال ‏\"‏ إناء مثل إناء وطعام مثل طعام ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     I saw no one cooking food like Safiyyah. She cooked food for the Messenger of Allah (ﷺ) and sent it. I became angry and broke the vessel. I then asked: Messenger of Allah, what is the atonement for what I have done? He replied: A vessel like (this) vessel and food like (this) food.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "20012",
        "19462",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-1010",
      "hadith_no": "1010",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا نوح بن حبيب، قال حدثنا يحيى بن سعيد القطان، قال حدثنا قدامة بن عبد الله، قال حدثتني جسرة بنت دجاجة، قالت سمعت أبا ذر، يقول قام النبي صلى الله عليه وسلم حتى أصبح بآية والآية ‏{‏ إن تعذبهم فإنهم عبادك وإن تغفر لهم فإنك أنت العزيز الحكيم ‏}‏ ‏.‏",
      "text_en": " Jasrah bint Dijajah said:                     \"I heard Abu Dharr say: 'The Prophet (ﷺ) stayed up all night repeating one verse. The verse was: 'If You punish them, they are Your slaves, and if You forgive them, verily, You, only You, are the All-Mighty, the All-Wise.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38671",
        "20031",
        "19462",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-3957",
      "hadith_no": "3957",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Kind Treatment of Women - كتاب عشرة النساء",
      "chapter_no": "36",
      "text_ar": "أخبرنا محمد بن المثنى، عن عبد الرحمن، عن سفيان، عن فليت، عن جسرة بنت دجاجة، عن عائشة، قالت ما رأيت صانعة طعام مثل صفية أهدت إلى النبي صلى الله عليه وسلم إناء فيه طعام فما ملكت نفسي أن كسرته فسألت النبي صلى الله عليه وسلم عن كفارته فقال ‏\"‏ إناء كإناء وطعام كطعام ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"I never saw any woman who made food like Safiyyah. She sent a dish to the Prophet in which was some food, and I could not keep myself from breaking it. I asked the Prophet what the expiation was for that, and he said: 'A dish like that dish, and food like that food.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20033",
        "20012",
        "19462",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-5680",
      "hadith_no": "5680",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد بن نصر، قال أخبرنا عبد الله، عن قدامة العامري، أن جسرة بنت دجاجة العامرية، حدثته قالت، سمعت عائشة، سألها أناس كلهم يسأل عن النبيذ، يقول ننبذ التمر غدوة ونشربه عشيا وننبذه عشيا ونشربه غدوة ‏.‏ قالت لا أحل مسكرا وإن كان خبزا وإن كانت ماء ‏.‏ قالتها ثلاث مرات ‏.‏",
      "text_en": " It was narrated from Qudamah Al-'Amiri that Jasrah bint Dijajah Al-'Amiriyyah told him:                     \"I heard 'Aishah when some people asked her about Nabidh, saying we soak dates in the morning and drink it in the evening, or we soak them in the evening and drink them in the morning. She said: 'I do not permit any intoxicant even if it were bread or even if it were water.' She said that three times.\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "19462"
      ]
    },
    {
      "id": "sunan-ibn-majah-1411",
      "hadith_no": "1411",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا يحيى بن سعيد، عن قدامة بن عبد الله، عن جسرة بنت دجاجة، قالت سمعت أبا ذر، يقول قام النبي  صلى الله عليه وسلم  بآية حتى أصبح يرددها والآية ‏{إن تعذبهم فإنهم عبادك وإن تغفر لهم فإنك أنت العزيز الحكيم}‏ ‏.‏",
      "text_en": " It wasnarrated that Jasrah bint Dijajah said:                      “I heard Abu Dharrsay:‘The Prophet (ﷺ) stood reciting a Verse and repeating it untilmorning came. That Verse was: “If you punish them, they are Yourslaves, and if You forgive them, verily You, only You, are theAll-Mighty, the All-Wise.’”” [5:118]",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20031",
        "19462",
        "23"
      ]
    }
  ],
  "total_hadiths": 6
}