{
  "id": "19521",
  "name": "Marjana, Umm 'Alqama مرجانة أم علقمة",
  "full_name": "Marjana, Umm 'Alqama مرجانة أم علقمة",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ ي  د  ت  س  -  مقبول ]"
    ],
    "tags": [
      "Female",
      "Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "11208",
      "name": "'Alqama bin Abi 'Alqama علقمة بن أبي علقمة",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "teachers": [
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11208",
      "name": "'Alqama bin Abi 'Alqama علقمة بن أبي علقمة",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "876",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا قتيبة، حدثنا عبد العزيز بن محمد، عن علقمة بن أبي علقمة، عن أمه، عن عائشة، قالت كنت أحب أن أدخل، البيت فأصلي فيه فأخذ رسول الله صلى الله عليه وسلم بيدي فأدخلني الحجر فقال ‏\"‏ صلي في الحجر إن أردت دخول البيت فإنما هو قطعة من البيت ولكن قومك استقصروه حين بنوا الكعبة فأخرجوه من البيت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وعلقمة بن أبي علقمة هو علقمة بن بلال ‏.‏",
      "text_en": " Aishah narrated:                     \"I wanted to enter the House to perform Salat in it, so the Messenger of Allah took me by the hand and put me in the Hijr, and he said: 'Perform Salat in the Hijri if you want to enter the House. For indeed it is part of the House, but your people considered it insignificant when they built the Ka'bah, so they put it outside the House.'\"",
      "chain": [
        "30367",
        "20167",
        "11208",
        "19521",
        "53"
      ]
    },
    {
      "hadith_no": "2038",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرني محمد بن سلمة، والحارث بن مسكين، قراءة عليه وأنا أسمع، - واللفظ له - عن ابن القاسم، قال حدثني مالك، عن علقمة بن أبي علقمة، عن أمه، أنها سمعت عائشة، تقول ‏:‏ قام رسول الله صلى الله عليه وسلم ذات ليلة فلبس ثيابه ثم خرج - قالت - فأمرت جاريتي بريرة تتبعه فتبعته حتى جاء البقيع، فوقف في أدناه ما شاء الله أن يقف، ثم انصرف فسبقته بريرة فأخبرتني، فلم أذكر له شيئا حتى أصبحت، ثم ذكرت ذلك له فقال ‏:‏ ‏\"‏ إني بعثت إلى أهل البقيع لأصلي عليهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Alqamah bin Abi 'Alqamah, from his mother, that she heard 'Aishah say:                     \"The Messenger of Allah got up one night and got dressed, then he went out. I told my slave girl Barirah to follow him, so she followed him until he came to Al-Baqi. Then he stood near if for as long as Allah willed that he should stand, then he left. Barirah came back before he did and told me, but I did not mention anything until morning came, then I mentioned that to him. He said: 'I was sent to the people of Al-Baqi' to pray for them.\"'",
      "chain": [
        "20672",
        "36017",
        "30234",
        "20001",
        "11208",
        "19521"
      ]
    },
    {
      "hadith_no": "2912",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا عبد العزيز بن محمد، قال حدثنا علقمة بن أبي علقمة، عن أمه، عن عائشة، قالت كنت أحب أن أدخل، البيت فأصلي فيه فأخذ رسول الله صلى الله عليه وسلم بيدي فأدخلني الحجر فقال ‏\"‏ إذا أردت دخول البيت فصلي ها هنا فإنما هو قطعة من البيت ولكن قومك اقتصروا حيث بنوه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Aishah said:                     \"I wanted to enter the House and pray therein, so the Messenger of Allah took me by the hand and took me into the Hijr and said: 'If you want to enter the House, then pray here, for it is part of the House, but your people made it too small when they built it.'\" (Sahih)Chatper 130. Reciting The Takbir In the Corners Of the Kabah",
      "chain": [
        "30123",
        "20167",
        "11208",
        "19521",
        "53"
      ]
    }
  ],
  "total_hadiths": 3
}