{
  "id": "198",
  "name": "Umm Hani bint Abi Talib ( ام هانى بنت أبي طالب ( رضي الله عنها",
  "full_name": "Umm Hani bint Abi Talib ( ام هانى بنت أبي طالب ( رضي الله عنها",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "41",
      "date_gregorian": "661",
      "date_display": null,
      "place": "Madinah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابة ]",
      "Fiqh"
    ],
    "tags": [
      "Female",
      "Quraish",
      "B.Hashim",
      "Cousin",
      "Late Muslim"
    ]
  },
  "parents": [
    {
      "id": "9992",
      "name": "Abu Talib ibn 'Abd al-Muttalib أبو طالب بن عبد المطلب بن هاشم",
      "grade": "Prophet's Relative [Non-Muslim]"
    },
    {
      "id": "77",
      "name": "Fatima bint Asad ( فاطمة بنت أسد بن هاشم بن عبد مناف ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "164",
      "name": "Talib ibn Abi Talib ( طالب بن ابي طالب ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "165",
      "name": "'Aqeel ibn Abi Talib ( عقيل بن أبي طالب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "21",
      "name": "Ja'far ibn Abi Talib ( جعفر بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "199",
      "name": "Jumanah bint Abi Talib ( جمانة بنت أبي طالب بن عبد المطلب ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "2080",
      "name": "Ja'dah bin Hubayra bin Abi Wahb ( جعدة بن هبيرة بن أبي وهب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "2081",
      "name": "Yusuf bin Hubayra bin Abi Wahb ( يوسف بن هبيرة بن أبي وهب ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "2082",
      "name": "Hani bin Hubayra bin Abi Wahb ( هانئ بن هبيرة بن أبي وهب ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "2083",
      "name": "'Amr bin Hubayra bin Abi Wahb ( عمرو بن هبيرة بن أبي وهب ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "11237",
      "name": "Abu Murrah, Client of Umm Hani يزيد أبو مرة مولى",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19899",
      "name": "Badham/Badhan, Abu Salah باذام / باذان أبو صالح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18124",
      "name": "J'd'h al-Mkhzwmy جعدة المخزومي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19141",
      "name": "Yahya bin Ja'dah bin Hubayra يحيى بن جعدة بن هبيرة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "778",
      "name": "'Abdullah bin 'Ayyash bin Abi Rabi'a ( عبد الله بن عياش بن أبي ربيعة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "912",
      "name": "'Abdullah ibn al-Harith ibn Nawfal ( عبد الله بن الحارث بن نوفل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11513",
      "name": "'Abdullah bin 'Abdullah bin al-Harith عبد الله بن عبد الله بن الحارث بن نوفل",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11196",
      "name": "'Abdur Rahman bin Abi Layla عبد الرحمن بن أبي ليلى",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11211",
      "name": "Karayb bin Abi Muslim كريب بن أبي مسلم الهاشمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10511",
      "name": "'Urwa ibn al-Zubayr عروة بن الزبير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18937",
      "name": "Muhammad bin 'Uqba bin Aby محمد بن عقبة بن أبي مالك القرظي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "280",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن أبي النضر، مولى عمر بن عبيد الله أن أبا مرة، مولى أم هانئ بنت أبي طالب أخبره أنه، سمع أم هانئ بنت أبي طالب، تقول ذهبت إلى رسول الله صلى الله عليه وسلم عام الفتح، فوجدته يغتسل وفاطمة تستره فقال ‏\"‏ من هذه ‏\"‏‏.‏ فقلت أنا أم هانئ‏.‏",
      "text_en": " Narrated Um Hani bint Abi Talib:                     I went to Allah's Apostle in the year of the conquest of Mecca and found him taking a bath while Fatima was screening him. The Prophet asked, \"Who is it?\" I replied, \"I am Um-Hani.\"",
      "chain": [
        "20164",
        "20001",
        "11164",
        "11237",
        "198"
      ]
    },
    {
      "hadith_no": "336",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن رمح بن المهاجر، أخبرنا الليث، عن يزيد بن أبي حبيب، عن سعيد بن أبي هند، أن أبا مرة، مولى عقيل حدثه أن أم هانئ بنت أبي طالب حدثته أنه، لما كان عام الفتح أتت رسول الله صلى الله عليه وسلم وهو بأعلى مكة ‏.‏ قام رسول الله صلى الله عليه وسلم إلى غسله فسترت عليه فاطمة ثم أخذ ثوبه فالتحف به ثم صلى ثمان ركعات سبحة الضحى ‏.‏",
      "text_en": " Umm Hani b. Abu Talib reported:                      It was the day of the conquest (of Mecca) that she went to the Messenger of Allah (may peace be upon him) and he was staying at a higher part (of that city). The Messenger of Allah (may peace be upon him) got up for his bath. Fatimah held a curtain around him (in order to provide him privacy). He then put on his garments and wrapped himself with that and then offered eight rak'ahs of the forenoon prayer.",
      "chain": [
        "30490",
        "20023",
        "11411",
        "11427",
        "198"
      ]
    },
    {
      "hadith_no": "1703",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا معلى بن أسد، حدثنا وهيب بن خالد، عن جعفر بن محمد، عن أبيه، عن أبي مرة، مولى عقيل عن أم هانئ، أن رسول الله صلى الله عليه وسلم صلى في بيتها عام الفتح ثماني ركعات في ثوب واحد قد خالف بين طرفيه ‏.‏",
      "text_en": " Abu Murra narrated on the authority of Umm Hani that the Messenger of Allah (may peace be upon him) on the day of the Conquest of Mecca observed in her house eight rak'abs of prayer in one cloth, its opposite corners having been tied from the opposite sides.",
      "chain": [
        "38834",
        "30457",
        "20299",
        "10898",
        "11442",
        "11237",
        "198"
      ]
    },
    {
      "hadith_no": "1290",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن صالح، وأحمد بن عمرو بن السرح، قالا حدثنا ابن وهب، حدثني عياض بن عبد الله، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس عن أم هانئ بنت أبي طالب، أن رسول الله صلى الله عليه وسلم يوم الفتح صلى سبحة الضحى ثماني ركعات يسلم من كل ركعتين ‏.‏ قال أبو داود قال أحمد بن صالح إن رسول الله صلى الله عليه وسلم يوم الفتح صلى سبحة الضحى فذكر مثله ‏.‏ قال ابن السرح إن أم هانئ قالت دخل على رسول الله صلى الله عليه وسلم ولم يذكر سبحة الضحى بمعناه ‏.‏",
      "text_en": " Narrated Umm Hani ibn AbuTalib:                     The Messenger of Allah (ﷺ) prayed on the day of the Conquest (of Mecca) eight rak'ahs saluting after every two rak'ahs.Abu Dawud said: Ahmad b. Salih said that the Messenger of Allah offered prayer in the forenoon on the day of the Conquest of Mecca, and he narrated something similar. Ibn al-Sarh reported that Umm Hani said: The Messenger of Allah (ﷺ) entered upon me. This version does not mention the prayer in the forenoon.",
      "chain": [
        "30226",
        "30485",
        "20029",
        "20514",
        "11223",
        "11211",
        "198"
      ]
    },
    {
      "hadith_no": "2456",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير بن عبد الحميد، عن يزيد بن أبي زياد، عن عبد الله بن الحارث، عن أم هانئ، قالت لما كان يوم الفتح فتح مكة جاءت فاطمة فجلست عن يسار رسول الله صلى الله عليه وسلم وأم هانئ عن يمينه قالت فجاءت الوليدة بإناء فيه شراب فناولته فشرب منه ثم ناوله أم هانئ فشربت منه فقالت يا رسول الله لقد أفطرت وكنت صائمة ‏.‏ فقال لها ‏\"‏ أكنت تقضين شيئا ‏\"‏ ‏.‏ قالت لا ‏.‏ قال ‏\"‏ فلا يضرك إن كان تطوعا ‏\"‏ ‏.‏",
      "text_en": " Narrated Umm Hani:                     On the days of the  conquest of Mecca, when Mecca was captured, Fatimah came and sat on the left side of the Messenger of Allah (ﷺ), and Umm Hani was on his right side. A slave-girl brought a vessel which contained some drink; she gave it to him and he drank of it. He then gave it to Umm Hani who drank of it. She said: Messenger of Allah, I have broken my fast; I was fasting. He said to her: Were you making atonement for something? She replied: No. He said: Then it does not harm you if it was voluntary (fast).",
      "chain": [
        "30203",
        "20028",
        "10844",
        "912",
        "198"
      ]
    },
    {
      "hadith_no": "2763",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، قال أخبرني عياض بن عبد الله، عن مخرمة بن سليمان، عن كريب، عن ابن عباس، قال حدثتني أم هانئ بنت أبي طالب، أنها أجارت رجلا من المشركين يوم الفتح فأتت النبي صلى الله عليه وسلم فذكرت له ذلك فقال ‏\"‏ قد أجرنا من أجرت وأمنا من أمنت ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Abbas said “Umm Hani daughter of Abu Talib told me that in the year of the conquest she gave protection to a man from the polytheists. She came to the Prophet (ﷺ) and mentioned it to him. He said “We have given security to those to whom you have given it.”",
      "chain": [
        "30226",
        "20029",
        "20514",
        "11223",
        "11211",
        "17",
        "198"
      ]
    },
    {
      "hadith_no": "731",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا قتيبة، حدثنا أبو الأحوص، عن سماك بن حرب، عن ابن أم هانئ، عن أم هانئ، قالت كنت قاعدة عند النبي صلى الله عليه وسلم فأتي بشراب فشرب منه ثم ناولني فشربت منه فقلت إني أذنبت فاستغفر لي ‏.‏ فقال ‏\"‏ وما ذاك ‏\"‏ ‏.‏ قالت كنت صائمة فأفطرت ‏.‏ فقال ‏\"‏ أمن قضاء كنت تقضينه ‏\"‏ ‏.‏ قالت لا ‏.‏ قال ‏\"‏ فلا يضرك ‏\"‏ ‏.‏ قال وفي الباب عن أبي سعيد وعائشة ‏.‏",
      "text_en": " Umm Hani narrated:                     \"I was sitting with the Prophet when some drink was brought, so he drank from it, then he offered it to me and I drank it. Then I said: 'I have indeed sinned, so seek forgiveness for me.' He said: 'What is that?' I said: 'I was fasting, then I broke the fast.' He said: 'Were you performing a fast that you had to make up?' I said: 'No.' He said: 'Then it is no harm for you.'\"",
      "chain": [
        "30367",
        "20327",
        "10770",
        "198"
      ]
    },
    {
      "hadith_no": "1579",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو الوليد الدمشقي، حدثنا الوليد بن مسلم، أخبرني ابن أبي ذئب، عن سعيد المقبري، عن أبي مرة، مولى عقيل بن أبي طالب عن أم هانئ، أنها قالت أجرت رجلين من أحمائي فقال رسول الله صلى الله عليه وسلم ‏\"‏ قد أمنا من أمنت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم أجازوا أمان المرأة وهو قول أحمد وإسحاق أجازا أمان المرأة والعبد ‏.‏ وأبو مرة مولى عقيل بن أبي طالب ويقال له أيضا مولى أم هانئ واسمه يزيد ‏.‏ وقد روي عن عمر بن الخطاب أنه أجاز أمان العبد ‏.‏ وقد روي عن علي بن أبي طالب وعبد الله بن عمرو عن النبي صلى الله عليه وسلم قال ‏\"‏ ذمة المسلمين واحدة يسعى بها أدناهم ‏\"‏ ‏.‏ قال أبو عيسى ومعنى هذا عند أهل العلم أن من أعطى الأمان من المسلمين فهو جائز على كلهم ‏.‏",
      "text_en": " Another chain from Umm Hani' who said:                      \"I granted asylum for two men among my brother-in-laws. So the Messeneger of Allah (ﷺ) said: 'We grant security to whomever you have granted security.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.This is acted upon according to the people of knowledge. They permit assurance of protection by a women. This is the view of Ahmad and Ishaq. They permitted the asylum of a woman and slaveIt has been related from other routes from 'Umar bin Al-Khattab that he permitted the asylum granted by a slave.One of the narrators of this last narration Abu Murrah is the freed slave of 'Aqil bin Abi Talib - they also say that he was freed slave  of Umm Hani' - and his name was Yazid.It has been related from 'Ali bin Abi Talib and 'Abdullah bin 'Amr that the Prophet (ﷺ) said: \"The covenants of the Muslims are one, it covers the rest of them.\"[Abu 'Eisa said:] According to the people of knowledge, the meaning of this Hadith is that whoever gives assurance of protection among the Muslims, then it is valis to all of them.",
      "chain": [
        "20733",
        "20177",
        "11168",
        "11237",
        "198"
      ]
    },
    {
      "hadith_no": "1781",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثني ابن أبي عمر، حدثنا سفيان بن عيينة، عن ابن أبي نجيح، عن مجاهد، عن أم هانئ، قالت قدم رسول الله صلى الله عليه وسلم مكة وله أربع غدائر ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ قال محمد لا أعرف لمجاهد سماعا من أم هانئ ‏.‏",
      "text_en": " Narrated Umm Hani:                     \"The Messenger of Allah (ﷺ) arrived in Makkah, and he had four braids.\"[Abu 'Eisa said:] This Hadith is Gharib. Muhammad said: \"I do not know of Mujahid (a narrator) hearing from Umm Hani.\"",
      "chain": [
        "30421",
        "20005",
        "11254",
        "11028",
        "198"
      ]
    },
    {
      "hadith_no": "1841",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا أبو بكر بن عياش، عن أبي حمزة الثمالي، عن الشعبي، عن أم هانئ بنت أبي طالب، قالت دخل على رسول الله صلى الله عليه وسلم فقال ‏\"‏ هل عندكم شيء ‏\"‏ ‏.‏ فقلت لا إلا كسر يابسة وخل ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ قربيه فما أقفر بيت من أدم فيه خل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه لا نعرفه من حديث أم هانئ إلا من هذا الوجه ‏.‏ وأبو حمزة الثمالي اسمه ثابت بن أبي صفية وأم هانئ ماتت بعد علي بن أبي طالب بزمان ‏.‏ وسألت محمدا عن هذا الحديث فقال لا أعرف للشعبي سماعا من أم هانئ ‏.‏ فقلت أبو حمزة كيف هو عندك فقال أحمد بن حنبل تكلم فيه وهو عندي مقارب الحديث ‏.‏",
      "text_en": " Narrated Umm Hani' bint Abi Talib:                     \"The Messenger of Allah (ﷺ) entered upon me and said: 'Do you have anything?' I said: 'No, except a piece of hard bread and vinegar.' so he said: 'Bring it, for a house that has vinegar is not impoverished of condiments.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib from this route. We do not know of it as a Hadith of Umm Hani' except through this route. Abu Hamzah Ath-Thumali's (a narrator in the chain) name is Thabit bin Abi Safiyyah. And Umm Hani' died some time after 'Ali bin Abi Talib. I asked Muhammad about this Hadith. He said: \"I do not know Ash-Sha'bi hearing from Umm Hani'.\" So I said: \"How is Abu Hamzah according to you?\" He said: \"Ahmad bin Hanbal criticized him, but he is Muqarib (average) in Hadith to me.\"",
      "chain": [
        "30216",
        "20373",
        "15054",
        "11052",
        "198"
      ]
    },
    {
      "hadith_no": "3493",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أسامة، وعبد الله بن بكر السهمي، عن حاتم بن أبي صغيرة، عن سماك بن حرب، عن أبي صالح، عن أم هانئ، عن النبي صلى الله عليه وسلم في قوله تعالى ‏:‏ ‏(‏أتأتون في ناديكم المنكر ‏)‏ قال ‏\"‏ كانوا يخذفون أهل الأرض ويسخرون منهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن إنما نعرفه من حديث حاتم بن أبي صغيرة عن سماك ‏.‏",
      "text_en": " Narrated Umm Hani:                     that regarding Allah's saying: '...And you practice evil in your meetings... (29:29) that the Prophet (ﷺ) said: \"They would throw pebbles at people of the land and make a mockery of them.\"",
      "chain": [
        "30277",
        "20318",
        "20244",
        "11274",
        "10770",
        "11161",
        "198"
      ]
    },
    {
      "hadith_no": "3520",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا عبيد الله بن موسى، عن إسرائيل، عن السدي، عن أبي صالح، عن أم هانئ بنت أبي طالب، قالت خطبني رسول الله صلى الله عليه وسلم فاعتذرت إليه فعذرني ثم أنزل الله تعالى ‏:‏ ‏(‏إنا أحللنا لك أزواجك اللاتي آتيت أجورهن وما ملكت يمينك مما أفاء الله عليك وبنات عمك وبنات عماتك وبنات خالك وبنات خالاتك اللاتي هاجرن معك وامرأة مؤمنة إن وهبت نفسها للنبي ‏)‏ الآية قالت فلم أكن أحل له لأني لم أهاجر كنت من الطلقاء ‏.‏ قال أبو عيسى هذا حديث حسن صحيح لا نعرفه إلا من هذا الوجه من حديث السدي ‏.‏",
      "text_en": " Narrated Umm Hani bint Abu Talib:                     \"The Messenger of Allah (ﷺ) proposed to me, but I asked him to excuse me. Then Allah [Most High] revealed: 'Verily We have made lawful to you your wives, to whom you have paid their due, and those whom your right hand possess - whom Allah has given to you, and the daughters of your paternal uncles, and the daughters of your paternal aunts, and the daughters of your maternal uncles, and the daughters of your maternal aunts, who migrated with you, and a believing woman if she offers herself to the Prophet... (33:50)' She said: \"So I was not lawful for him because I did not perform Hijrah; I was one of the Tulaqa (those that accepted Islam after the conquest of Makkah).'\"",
      "chain": [
        "30553",
        "20340",
        "20311",
        "10743",
        "11161",
        "198"
      ]
    },
    {
      "hadith_no": "227",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، عن عبد الرحمن، عن مالك، عن سالم، عن أبي مرة، مولى عقيل بن أبي طالب عن أم هانئ، رضى الله عنها أنها ذهبت إلى النبي صلى الله عليه وسلم يوم الفتح فوجدته يغتسل وفاطمة تستره بثوب فسلمت فقال ‏\"‏ من هذا ‏\"‏ ‏.‏ قلت أم هانئ ‏.‏ فلما فرغ من غسله قام فصلى ثماني ركعات في ثوب ملتحفا به ‏.‏",
      "text_en": " It was narrated from Umm Hani' that she went to the Prophet (ﷺ) on the day of the Conquest (of Makkah) and found him performing Ghusl while Fatimah was concealing him with a garment. She gave him Salams and he said:                      \"Who is this?\" She said: \"Umm Hani'.\" When he had finished his Ghusl he stood up and prayed eight Rak'ahs wrapped in a garment.",
      "chain": [
        "20184",
        "20033",
        "20001",
        "11011",
        "11237",
        "198"
      ]
    },
    {
      "hadith_no": "242",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا عبد الرحمن، قال حدثنا إبراهيم بن نافع، عن ابن أبي نجيح، عن مجاهد، عن أم هانئ، أن رسول الله صلى الله عليه وسلم اغتسل هو وميمونة من إناء واحد في قصعة فيها أثر العجين ‏.‏",
      "text_en": " It was narrated from Umm Hani' that the Messenger of Allah (ﷺ) performed Ghusl, he and Maimunah from a single vessel, a bowl in which there were traces of dough.",
      "chain": [
        "30160",
        "20033",
        "20189",
        "11254",
        "11028",
        "198"
      ]
    },
    {
      "hadith_no": "415",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا محمد بن يحيى بن محمد، قال حدثنا محمد بن موسى بن أعين، قال حدثنا أبي، عن عبد الملك بن أبي سليمان، عن عطاء، قال حدثتني أم هانئ، أنها دخلت على النبي صلى الله عليه وسلم يوم فتح مكة وهو يغتسل قد سترته بثوب دونه في قصعة فيها أثر العجين ‏‏.‏‏ قالت فصلى الضحى فما أدري كم صلى حين قضى غسله ‏‏.‏‏",
      "text_en": " Umm Hani' narrated that she entered upon the Prophet (ﷺ) on the day of the Conquest of Makkah, when he was performing Ghusl - while a garment was screening him - from a vessel in which were traces of dough. She said:                      He prayed Ad-Duha - but I do not know how many Rak'ahs he prayed - after he finished Ghusl.'\"",
      "chain": [
        "11222",
        "30384",
        "10945",
        "11029",
        "198"
      ]
    },
    {
      "hadith_no": "1013",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا يعقوب بن إبراهيم الدورقي، عن وكيع، قال حدثنا مسعر، عن أبي العلاء، عن يحيى بن جعدة، عن أم هانئ، قالت كنت أسمع قراءة النبي صلى الله عليه وسلم وأنا على عريشي ‏.‏",
      "text_en": " Umm Hani said:                     \"I used to listen to the Prophet (ﷺ) reciting Quran when I was on my roof.\"",
      "chain": [
        "30400",
        "20032",
        "20359",
        "198"
      ]
    },
    {
      "hadith_no": "409",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو عامر الأشعري عبد الله بن عامر، حدثنا يحيى بن أبي بكير، حدثنا إبراهيم بن نافع، عن ابن أبي نجيح، عن مجاهد، عن أم هانئ، أن النبي  صلى الله عليه وسلم  اغتسل وميمونة من إناء واحد في قصعة فيها أثر العجين ‏.‏",
      "text_en": " It was narrated from Umm Hani that :                     The Prophet and Maimunah took a bath from a single vessel, a large bowl in which they were some traces of dough.",
      "chain": [
        "20365",
        "20189",
        "11254",
        "11028",
        "198"
      ]
    },
    {
      "hadith_no": "502",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن رمح، أنبأنا الليث بن سعد، عن يزيد بن أبي حبيب، عن سعيد بن أبي هند، أن أبا مرة، مولى عقيل حدثه أن أم هانئ بنت أبي طالب حدثته أنه، لما كان عام الفتح قام رسول الله  صلى الله عليه وسلم  إلى غسله فسترت عليه فاطمة ثم أخذ ثوبه فالتحف به ‏.‏",
      "text_en": " Umm Hani' bint Abu Talib narrated that :                     When it was the year of the Conquest (of Makkah), the Messenger of Allah got up to perform a bath and Fatimah screened him. Then he took his garment and wrapped himself in it (such that it became like the towel used to dry oneself).",
      "chain": [
        "30490",
        "20023",
        "11411",
        "11427",
        "198"
      ]
    },
    {
      "hadith_no": "1384",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن محمد بن رمح، أنبأنا ابن وهب، عن عياض بن عبد الله، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس عن أم هانئ بنت أبي طالب، أن رسول الله  صلى الله عليه وسلم  يوم الفتح صلى سبحة الضحى ثماني ركعات سلم من كل ركعتين ‏.‏",
      "text_en": " It wasnarrated from Umm Hani’ bint Abu Talib that on the day of theConquest (of Makkah) the Messenger of Allah (ﷺ) prayed voluntaryDuha with eight Rak’ah, saying the Salam after each two Rak’ah.",
      "chain": [
        "20029",
        "20514",
        "11223",
        "11211",
        "198"
      ]
    },
    {
      "hadith_no": "1410",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، حدثنا مسعر، عن أبي العلاء، عن يحيى بن جعدة، عن أم هانئ بنت أبي طالب، قالت كنت أسمع قراءة النبي  صلى الله عليه وسلم  بالليل وأنا على عريشي ‏.‏",
      "text_en": " It wasnarrated that Umm Hani’ bint Abi Talib said:                      “I used to heartheProphet (ﷺ) reciting at night when I was on the roof of myhouse.”",
      "chain": [
        "30201",
        "38409",
        "20032",
        "20359",
        "198"
      ]
    },
    {
      "hadith_no": "2392",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن هشام بن عروة، عن أبيه، عن أم هانئ، أن النبي  صلى الله عليه وسلم  قال لها ‏\"‏ اتخذي غنما فإن فيها بركة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Hani' that the Prophet (ﷺ) said to her:                     \"Keep sheep, for in them is blessing!'",
      "chain": [
        "30201",
        "20032",
        "11065",
        "10511",
        "198"
      ]
    },
    {
      "hadith_no": "3797",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا إبراهيم بن المنذر الحزامي، حدثنا زكريا بن منظور، حدثني محمد بن عقبة، عن أم هانئ، قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا إله إلا الله لا يسبقها عمل ولا تترك ذنبا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Umm Hani' said:                     \"The Messenger of Allah(ﷺ) said: (About saying) La ilaha illah - no deed takes precedence over it and it does not leave any sin.'\"",
      "chain": [
        "30308",
        "22059",
        "198"
      ]
    },
    {
      "hadith_no": "3810",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا إبراهيم بن المنذر الحزامي، حدثنا أبو يحيى، زكريا بن منظور حدثني محمد بن عقبة بن أبي مالك، عن أم هانئ، قالت أتيت إلى رسول الله  صلى الله عليه وسلم  فقلت يا رسول الله دلني على عمل فإني قد كبرت وضعفت وبدنت ‏.‏ فقال ‏\"‏ كبري الله مائة مرة واحمدي الله مائة مرة وسبحي الله مائة مرة خير من مائة فرس ملجم مسرج في سبيل الله وخير من مائة بدنة وخير من مائة رقبة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Umm Hani' said:                     \"I came to the Messenger of Allah (ﷺ) and said: 'O Messenger of Allah, tell me of a (good) deed, for I have become old and weak and overweight.' He said: 'Proclaim the greatness of Allah (say Allahu Akbar) one hundred times, praise Allah (say Al-Hamdu Lillah) one hundred times, and glorify Allah (say Subhan-Allah) one hundred times. (That is) better than one hundred horses bridled and saddled for the sake of Allah, better than one hundred sacrificial camels, and better than (freeing) one hundred slaves.'\"",
      "chain": [
        "30308",
        "18937",
        "198"
      ]
    }
  ],
  "total_hadiths": 23
}