{
  "id": "19801",
  "name": "Harithh bin Mdrb حارثة بن مضرب",
  "full_name": "Harithh bin Mdrb حارثة بن مضرب",
  "grade": "Follower(Tabi') [2nd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Ray",
      "al-Kufa",
      "al-Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  4  -  ثقة ]"
    ],
    "tags": [
      "al-'Abdi",
      "al-Ra'",
      "al-Kufa",
      "al-Medina"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "14",
      "name": "Salman Farsi ( سلمان أبو عبد الله الفارسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "41",
      "name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "25",
      "name": "'Ammar ibn Yasir ( عمار بن ياسر بن عامر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2652",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن بشار، حدثني محمد بن محبب أبو همام الدلال، حدثنا سفيان بن سعيد، عن أبي إسحاق، عن حارثة بن مضرب، عن فرات بن حيان، أن رسول الله صلى الله عليه وسلم أمر بقتله وكان عينا لأبي سفيان وكان حليفا لرجل من الأنصار فمر بحلقة من الأنصار فقال إني مسلم ‏.‏ فقال رجل من الأنصار يا رسول الله إنه يقول إني مسلم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن منكم رجالا نكلهم إلى إيمانهم منهم فرات بن حيان ‏\"‏ ‏.‏",
      "text_en": " Narrated Furat ibn Hayyan:                     The Messenger of Allah (ﷺ) commanded to kill him: he was a spy of AbuSufyan and an ally of a man of the Ansar. He passed a circle of the Ansar and said: I am a Muslim. A man from the Ansar said, Messenger of Allah, he is saying that he is a Muslim. The Messenger of Allah (ﷺ) said: There are people among you in whose faith we trust. Furat ibn Hayyan is one of them.",
      "chain": [
        "30160",
        "34233",
        "20012",
        "11049",
        "19801"
      ]
    },
    {
      "hadith_no": "2665",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا عثمان بن عمر، أخبرنا إسرائيل، عن أبي إسحاق، عن حارثة بن مضرب، عن علي، قال تقدم - يعني عتبة بن ربيعة - وتبعه ابنه وأخوه فنادى من يبارز فانتدب له شباب من الأنصار فقال من أنتم فأخبروه فقال لا حاجة لنا فيكم إنما أردنا بني عمنا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ قم يا حمزة قم يا علي قم يا عبيدة بن الحارث ‏\"‏ ‏.‏ فأقبل حمزة إلى عتبة وأقبلت إلى شيبة واختلف بين عبيدة والوليد ضربتان فأثخن كل واحد منهما صاحبه ثم ملنا على الوليد فقتلناه واحتملنا عبيدة ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     (At the battle of Badr) Utbah ibn Rabi'ah came forward followed by his son and his brother and cried out: Who will be engaged in single combat?  Some young men of the Helpers responded to his call. He asked: Who are you? They told him. He said: We do not want you; we, in fact, want only our cousins. The Prophet (ﷺ) said: Get up Hamzah get up Ali; get up Ubaydah ibn al-Harith. Hamzah went forward to Utbah, I went forward to Shaybah; and after two blows had been exchanged between Ubaydah and al-Walid, they wounded one another severely; so we turned against al-Walid and killed him, and we carried Ubaydah away.",
      "chain": [
        "30524",
        "20262",
        "20311",
        "11049",
        "19801",
        "5"
      ]
    },
    {
      "hadith_no": "2762",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن أبي إسحاق، عن حارثة بن مضرب، أنه أتى عبد الله فقال ما بيني وبين أحد من العرب حنة وإني مررت بمسجد لبني حنيفة فإذا هم يؤمنون بمسيلمة ‏.‏ فأرسل إليهم عبد الله فجيء بهم فاستتابهم غير ابن النواحة قال له سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لولا أنك رسول لضربت عنقك ‏\"‏ ‏.‏ فأنت اليوم لست برسول فأمر قرظة بن كعب فضرب عنقه في السوق ثم قال من أراد أن ينظر إلى ابن النواحة قتيلا بالسوق ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     Harithah ibn Mudarrib said that he came to Abdullah ibn Mas'ud and said (to him): There is no enmity between me and any of the Arabs. I passed a mosque of Banu Hanifah. They (the people) believed in Musaylimah. Abdullah (ibn Mas'ud) sent for them. They were brought, and he asked them to repent, except Ibn an-Nawwahah. He said to him: I heard the Messenger of Allah (ﷺ) say: Were it not that you were not a messenger, I would behead you. But today you are not a messenger. He then ordered Qarazah ibn Ka'b (to kill him). He beheaded him in the market. Anyone who wants to see Ibn an-Nawwahah slain in the market (he may see him).",
      "chain": [
        "28531",
        "20012",
        "11049",
        "19801"
      ]
    },
    {
      "hadith_no": "970",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي إسحاق، عن حارثة بن مضرب، قال دخلت على خباب وقد اكتوى في بطنه فقال ما أعلم أحدا من أصحاب النبي صلى الله عليه وسلم لقي من البلاء ما لقيت لقد كنت وما أجد درهما على عهد النبي صلى الله عليه وسلم وفي ناحية من بيتي أربعون ألفا ولولا أن رسول الله صلى الله عليه وسلم نهانا - أو نهى - أن نتمنى الموت لتمنيت ‏.‏ قال وفي الباب عن أنس وأبي هريرة وجابر ‏.‏ قال أبو عيسى حديث خباب حديث حسن صحيح ‏.‏ وقد روي عن أنس بن مالك، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ لا يتمنين أحدكم الموت لضر نزل به وليقل اللهم أحيني ما كانت الحياة خيرا لي وتوفني إذا كانت الوفاة خيرا لي ‏.\"‏",
      "text_en": " Harithah bin Mudarrib said:                     \"I entered upon Khabab and he had been cauterized on his stomach. He said: 'I do not know any of the Companions of the Prophet who met with the trial I have met with. Indeed I could not find a Dirham during the time of the Prophet, and (now) outside my house there are forty thousand. If it were not that the Messenger of Allah forbade us' - or: 'forbade' - 'from wishing for death, then I would wish for it.'\"",
      "chain": [
        "30160",
        "20173",
        "20020",
        "11049",
        "19801"
      ]
    },
    {
      "hadith_no": "2671",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا علي بن حجر، أخبرنا شريك، عن أبي إسحاق، عن حارثة بن مضرب، قال أتينا خبابا نعوده وقد اكتوى سبع كيات فقال لقد تطاول مرضي ولولا أني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تمنوا الموت ‏\"‏ ‏.‏ لتمنيت وقال ‏\"‏ يؤجر الرجل في نفقته كلها إلا التراب أو قال في البناء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Harithah bin Mudarrib said:                     \"We went to visit Khabbab who had himself cauterised in seven places on his body. He said: 'I have been ill for so long, and if it was not that I heard the Messenger of Allah (s.a.w) saying: \"None of you should wish for death\" then I would have wished for it, and he said: \"A man is rewarded for [all of] his spending except for the dust\" - or he said - \"in the dust.\"",
      "chain": [
        "20387",
        "20587",
        "11049",
        "19801"
      ]
    },
    {
      "hadith_no": "675",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا الأعمش، عن أبي إسحاق، عن حارثة بن مضرب العبدي، عن خباب، قال شكونا إلى رسول الله  صلى الله عليه وسلم  حر الرمضاء فلم يشكنا ‏.‏ قال القطان حدثنا أبو حاتم، حدثنا الأنصاري، حدثنا عوف، نحوه ‏.‏",
      "text_en": " It was narrated that Khabbab said:                     \"We complained to the Messenger of Allah about the heat of the sunbaked ground, but he did not respond to our complaint.\" (Sahih)Another chain with similar wording.",
      "chain": [
        "38409",
        "20032",
        "11060",
        "11049",
        "19801",
        "149"
      ]
    }
  ],
  "total_hadiths": 6
}