{
  "id": "19800",
  "name": "Usayd bin Abi Usayd أسيد بن أبي أسيد البراد",
  "full_name": "Usayd bin Abi Usayd أسيد بن أبي أسيد البراد",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ بخ  4  -  صدوق ]"
    ],
    "tags": [
      "al-Medina"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "22002",
      "name": "Ibrahim bin Abi Usayd al-Barad إبراهيم بن أبي أسيد البراد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "11224",
      "name": "Nafi' bin 'Abbas/'Ayyash نافع بن عباس/بن عياش الأقرع",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11804",
      "name": "'Abdullah bin Abi Qatada Ibn Rab'i عبد الله بن أبي قتادة الأنصاري السلمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19822",
      "name": "Mu'adh bin 'Abdullah bin Khubayb معاذ بن عبد الله بن خبيب",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11902",
      "name": "Musa bin Abi Musa al-Asha'ari موسى بن أبي موسى الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12184",
      "name": "Salah bin Nubhan صالح بن نبهان",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "22036",
      "name": "Hjaj bin Safwan bin Aby حجاج بن صفوان بن أبي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3131",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا مسدد، حدثنا حميد بن الأسود، حدثنا الحجاج، - عامل لعمر بن عبد العزيز على الربذة حدثني أسيد بن أبي أسيد، عن امرأة، من المبايعات قالت كان فيما أخذ علينا رسول الله صلى الله عليه وسلم في المعروف الذي أخذ علينا أن لا نعصيه فيه أن لا نخمش وجها ولا ندعو ويلا ولا نشق جيبا وأن لا ننشر شعرا ‏.‏",
      "text_en": " Usayd ibn Abu Usayd, reported on the authority of a woman who took oath of allegiance (to the Prophet):                      One of the oaths which the Messenger of Allah (ﷺ) received from us about the virtue was that we would not disobey him in it (virtue): that we would not scratch the face, nor wail, nor tear the front of the garments nor dishevel the hair.",
      "chain": [
        "30175",
        "20225",
        "19800"
      ]
    },
    {
      "hadith_no": "4236",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Signet-Rings (Kitab Al-Khatam) - كتاب الخاتم",
      "chapter_no": "36",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا عبد العزيز، - يعني ابن محمد - عن أسيد بن أبي أسيد البراد، عن نافع بن عياش، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أحب أن يحلق حبيبه حلقة من نار فليحلقه حلقة من ذهب ومن أحب أن يطوق حبيبه طوقا من نار فليطوقه طوقا من ذهب ومن أحب أن يسور حبيبه سوارا من نار فليسوره سوارا من ذهب ولكن عليكم بالفضة فالعبوا بها ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: If anyone wants to put a ring of fire on one he loves, let him put a gold ring on him: if anyone wants to put a necklace of fire on one he loves, let him put a gold necklace on him, and if anyone wants to put a bracelet of fire on one he loves let him put a gold bracelet on him. Keep to silver and amuse yourselves with it.",
      "chain": [
        "20164",
        "20167",
        "19800",
        "13"
      ]
    },
    {
      "hadith_no": "1003",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا علي بن حجر، أخبرنا محمد بن عمار، حدثني أسيد بن أبي أسيد، أن موسى بن أبي موسى الأشعري، أخبره عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما من ميت يموت فيقوم باكيه فيقول واجبلاه واسيداه أو نحو ذلك إلا وكل به ملكان يلهزانه أهكذا كنت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Musa bin Abi Musa Al-Asha'ri narrated from his father that:                     The Messenger of Allah said: \"No one dies and they stand over him crying and saying: 'O what a great man he was! O how respectful he was!' except that two angels are appointed for him to poke him (saying): 'Is that you?'\"",
      "chain": [
        "20387",
        "19800",
        "11902",
        "41"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا عمرو بن سواد، قال أنبأنا ابن وهب، قال أنبأنا ابن أبي ذئب، عن أسيد بن أبي أسيد، عن عبد الله بن أبي قتادة، عن جابر بن عبد الله، - رضى الله عنه - أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من ترك الجمعة ثلاثا من غير ضرورة طبع الله على قلبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir bin 'Abdullah that:                     The Messenger of Allah (ﷺ) said: \"Whoever misses jumu'ah three times with no cogent excuse, Allah (SWT) will place a seal on his heart.\"",
      "chain": [
        "30443",
        "20029",
        "20177",
        "19800",
        "11804",
        "34"
      ]
    },
    {
      "hadith_no": "5428",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا أبو عبد الرحمن، أحمد بن شعيب قال أنبأنا عمرو بن علي، قال حدثنا أبو عاصم، قال حدثنا ابن أبي ذئب، قال حدثني أسيد بن أبي أسيد، عن معاذ بن عبد الله، عن أبيه، قال أصابنا طش وظلمة فانتظرنا رسول الله صلى الله عليه وسلم ليصلي بنا ثم ذكر كلاما معناه فخرج رسول الله صلى الله عليه وسلم ليصلي بنا فقال ‏\"‏ قل ‏\"‏ ‏.‏ فقلت ما أقول قال ‏\"‏ ‏{‏ قل هو الله أحد ‏}‏ والمعوذتين حين تمسي وحين تصبح ثلاثا يكفيك كل شىء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Mu'adh bin 'Abdullah that his father said:                     \"It was raining and dark, and we were waiting for the Messenger of Allah [SAW] to lead us in prayer. Then the Messenger of Allah [SAW] came out to lead us in prayer and he said: 'Say.' I said: 'What should I say?' He said: 'Say: He is Allah, (the) One and Al-Mu'awwadhatain in the evening and in the morning, three times, and that will suffice you against everything.'\"",
      "chain": [
        "30153",
        "20241",
        "20177",
        "19800"
      ]
    },
    {
      "hadith_no": "1180",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا أبو عامر، حدثنا زهير، عن أسيد بن أبي أسيد، ح وحدثنا أحمد بن عيسى المصري، حدثنا عبد الله بن وهب، عن ابن أبي ذئب، عن أسيد بن أبي أسيد، عن عبد الله بن أبي قتادة، عن جابر بن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من ترك الجمعة ثلاثا من غير ضرورة طبع الله على قلبه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Jabir bin ‘Abdullah said:                      “The Messenger ofAllah(ﷺ) said: ‘Whoever abandons Friday (prayer) three times, fornonecessary reason, Allah will place a seal over his heart.’”",
      "chain": [
        "30170",
        "20443",
        "20321",
        "19800",
        "30227",
        "20029",
        "20177",
        "19800",
        "11804",
        "34"
      ]
    },
    {
      "hadith_no": "1662",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد العزيز بن محمد الدراوردي، حدثنا أسيد بن أبي أسيد، عن موسى بن أبي موسى الأشعري، عن أبيه، ‏.‏ أن النبي  صلى الله عليه وسلم  قال ‏\"‏ الميت يعذب ببكاء الحى إذا قالوا واعضداه واكاسياه ‏.‏ واناصراه واجبلاه ونحو هذا - يتعتع ويقال أنت كذلك أنت كذلك ‏\"‏ ‏.‏ قال أسيد فقلت سبحان الله إن الله يقول ‏{ولا تزر وازرة وزر أخرى }‏ ‏.‏ قال ويحك أحدثك أن أبا موسى حدثني عن رسول الله  صلى الله عليه وسلم  فترى أن أبا موسى كذب على النبي  صلى الله عليه وسلم  أو ترى أني كذبت على أبي موسى",
      "text_en": " It wasnarrated from Asid bin Abu Asid, from Musa bin Abu Musa Ash’ari,from his father that the Prophet (ﷺ) said:                      “The deceased ispunished for the weeping of the living. If they say: ‘O mystrength, O he who clothed us, O my help, O my rock,’ and so on, heis rebuked and it is said: ‘Were you really like that? Were youreally like that?’” Asid said: \"I said: 'Subhan-Allah! Allah says: \"And no bearer of burdens shall another's burden (35:18).\" He said: \"Woe to you, I tell you that Abu Musa narrated to me from the Messenger of Allah (ﷺ), and you think that Abu Musa was telling lies about the Prophet (ﷺ)? Or do you think that I am telling lies about Abu Musa?\"",
      "chain": [
        "32048",
        "20167",
        "19800",
        "11902"
      ]
    }
  ],
  "total_hadiths": 7
}