{
  "id": "19820",
  "name": "Abu Ja'far al-Khutami, 'Umayr bin Yazid عمير بن يزيد أبو جعفر الخطمي",
  "full_name": "Abu Ja'far al-Khutami, 'Umayr bin Yazid عمير بن يزيد أبو جعفر الخطمي",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ 4  -  صدوق ]"
    ],
    "tags": [
      "Ansar",
      "Aws",
      "B.Khutama",
      "al-Madni",
      "al-Basra"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "12294",
      "name": "'Abdur Rahman bin 'Uqba bin al-Fakah عبد الرحمن بن عقبة بن الفاكة",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-abi-daud-2601",
      "hadith_no": "2601",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا الحسن بن علي، حدثنا يحيى بن إسحاق السيلحيني، حدثنا حماد بن سلمة، عن أبي جعفر الخطمي، عن محمد بن كعب، عن عبد الله الخطمي، قال كان النبي صلى الله عليه وسلم إذا أراد أن يستودع الجيش قال ‏\"‏ أستودع الله دينكم وأمانتكم وخواتيم أعمالكم ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah al-Khutami:                     When the Prophet (ﷺ) wanted to say farewell to an army, he would say: I entrust to Allah your religion, what you are responsible for, and your final deeds.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "30525",
        "20021",
        "19820",
        "11221"
      ]
    },
    {
      "id": "sunan-abi-daud-3399",
      "hadith_no": "3399",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى، حدثنا أبو جعفر الخطمي، قال بعثني عمي أنا وغلاما، له إلى سعيد بن المسيب قال فقلنا له شىء بلغنا عنك في المزارعة ‏.‏ قال كان ابن عمر لا يرى بها بأسا حتى بلغه عن رافع بن خديج حديث فأتاه فأخبره رافع أن رسول الله صلى الله عليه وسلم أتى بني حارثة فرأى زرعا في أرض ظهير فقال ‏\"‏ ما أحسن زرع ظهير ‏\"‏ ‏.‏ قالوا ليس لظهير ‏.‏ قال ‏\"‏ أليس أرض ظهير ‏\"‏ ‏.‏ قالوا بلى ولكنه زرع فلان ‏.‏ قال ‏\"‏ فخذوا زرعكم وردوا عليه النفقة ‏\"‏ ‏.‏ قال رافع فأخذنا زرعنا ورددنا إليه النفقة ‏.‏ قال سعيد أفقر أخاك أو أكره بالدراهم ‏.‏",
      "text_en": " AbuJa'far al-Khatmi said:                      My uncle sent me and his slave to Sa'id ibn al-Musayyab. We said to him, there is something which has reached us about sharecropping. He replied: Ibn Umar did not see any harm in it until a tradition reached him from Rafi' ibn Khadij. He then came to him and Rafi'  told him that the Messenger of Allah (ﷺ) came to Banu Harithah and saw crop in the land of Zuhayr. He said: What an excellent crop of Zuhayr is! They said: It does not belong to Zuhayr. He asked: Is this not the land of Zuhayr? They said: Yes, but the crop belongs to so-and-so. He said: Take your crop and give him the wages. Rafi' said: We took our crop and gave him the wages. Sa'id (ibn al-Musayyab) said: Lend your brother or employ him for dirhams.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "19820",
        "1986"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3491-2",
      "hadith_no": "3491",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا ابن أبي عدي، عن حماد بن سلمة، عن أبي جعفر الخطمي، عن محمد بن كعب القرظي، عن عبد الله بن يزيد الخطمي الأنصاري، عن رسول الله صلى الله عليه وسلم أنه كان يقول في دعائه ‏\"‏ اللهم ارزقني حبك وحب من ينفعني حبه عندك اللهم ما رزقتني مما أحب فاجعله قوة لي فيما تحب اللهم وما زويت عني مما أحب فاجعله لي فراغا فيما تحب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب وأبو جعفر الخطمي اسمه عمير بن يزيد بن خماشة ‏.‏",
      "text_en": " Abdullah bin Yazid Al-Khatmi Al-Ansari narrated that the Messenger of Allah used to say in his supplication:                     “O Allah grant me Your love and the love of those who love will benefit me with You. O Allah, whatever you have provided me of that which I love, then make it strength for me for that which You love. O Allah, and what you have kept from me of that which I love then make it for me a period of rest in that which You love. (Allahummarzuqni Hubbuka Wa Hubba Man Yanafa’uni Hubbahu Indak. Allahumma Ma Razaqtani Mimma Uhibbu Faj’alhu Quwwatan Li Fima Tuhibb. Allahumma Wa Ma Zawaita Anni Mimma Uhibbu Faj’alhu Faraghan Li Fima Tuhibb). “",
      "usc_msa_ref": "",
      "chain": [
        "35047",
        "20276",
        "20021",
        "19820",
        "11221"
      ]
    },
    {
      "id": "sunan-an-nasai-16",
      "hadith_no": "16",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى بن سعيد، قال حدثنا أبو جعفر الخطمي، عمير بن يزيد قال حدثني الحارث بن فضيل، وعمارة بن خزيمة بن ثابت، عن عبد الرحمن بن أبي قراد، قال خرجت مع رسول الله صلى الله عليه وسلم إلى الخلاء وكان إذا أراد الحاجة أبعد ‏.‏",
      "text_en": " It was narrated that 'Abdur-Rahman bin Abi Qurad said:                      \"I went out with the Messenger of Allah (ﷺ) to an isolated area, and when he wanted to relieve himself he moved far away.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "19820",
        "11835",
        "19817",
        "5153"
      ]
    },
    {
      "id": "sunan-an-nasai-3429",
      "hadith_no": "3429",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا الربيع بن سليمان، قال حدثنا أسد بن موسى، قال حدثنا حماد بن سلمة، عن أبي جعفر الخطمي، عن عمارة بن خزيمة، عن كثير بن السائب، قال حدثني أبناء، قريظة أنهم عرضوا على رسول الله صلى الله عليه وسلم يوم قريظة فمن كان محتلما أو نبتت عانته قتل ومن لم يكن محتلما أو لم تنبت عانته ترك ‏.‏",
      "text_en": " It was narrated that Kathir bin As-Sa'ib said:                      \"The sons of Quraizah told me that they were presented to the Messenger of Allah on the Day of Quraizah, and whoever (among them) had reached puberty, or had grown pubic hair, was killed, and whoever had not reached puberty and had not grown pubic hair was left (alive).\"",
      "usc_msa_ref": "",
      "chain": [
        "30583",
        "28040",
        "20021",
        "19820",
        "19817",
        "5249"
      ]
    },
    {
      "id": "sunan-an-nasai-3889",
      "hadith_no": "3889",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا يحيى، عن أبي جعفر الخطمي، - واسمه عمير بن يزيد - قال أرسلني عمي وغلاما له إلى سعيد بن المسيب أسأله عن المزارعة فقال كان ابن عمر لا يرى بها بأسا حتى بلغه عن رافع بن خديج حديث فلقيه فقال رافع أتى النبي صلى الله عليه وسلم بني حارثة فرأى زرعا فقال ‏‏\"‏‏ ما أحسن زرع ظهير ‏‏\"‏‏‏.‏‏ فقالوا ليس لظهير‏.‏‏ فقال ‏‏\"‏‏ أليس أرض ظهير ‏‏\"‏‏‏.‏‏ قالوا بلى ولكنه أزرعها‏.‏‏ فقال رسول الله صلى الله عليه وسلم ‏‏\"‏‏ خذوا زرعكم وردوا إليه نفقته ‏‏\"‏‏‏.‏‏ قال فأخذنا زرعنا ورددنا إليه نفقته‏.‏‏ ورواه طارق بن عبد الرحمن عن سعيد واختلف عليه فيه‏.‏‏",
      "text_en": " It was narrated that Abu Ja'far Al-Khatmi - whose name was 'Umair bin Yazid - said:                      \"My paternal uncle sent me with a slave of his, to Sa'eed bin Al-Musayyab to ask him about Al-Muzara'ah. He said: 'Ibn 'Umar did not see anything wrong with it, until he heard the Hadith from Rafi' bin Khadij. Then he met him, and Rafi' said: \"The Prophet came to Banu Harithah and saw some crops. He said: 'How good are the crops of Zubair.' They said: 'It is not Zubair's.' He said: 'Is the land not Zubair's?' They said: 'No (it is not his), rather he is leasing it.' The Messenger of Allah said: 'Take your crops and give him what he spent.' So we took our crops, and gave him what he had spent.\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20031",
        "19820"
      ]
    },
    {
      "id": "sunan-ibn-majah-358",
      "hadith_no": "358",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن بشار، قالا حدثنا يحيى بن سعيد القطان، عن أبي جعفر الخطمي، - قال أبو بكر بن أبي شيبة واسمه عمير بن يزيد - عن عمارة بن خزيمة، والحارث بن فضيل، عن عبد الرحمن بن أبي قراد، قال حججت مع النبي  صلى الله عليه وسلم  فذهب لحاجته فأبعد ‏.‏",
      "text_en": " It was narrated that 'Abdur-Rahman bin Abu Qurad said:                     \"I went for Hajj with the Prophet and he went far away to relieve himself.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30160",
        "20031",
        "19820",
        "19817",
        "11835",
        "5153"
      ]
    },
    {
      "id": "sunan-ibn-majah-1377",
      "hadith_no": "1377",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا يوسف بن خالد، حدثنا أبو جعفر الخطمي، عن عبد الرحمن بن عقبة بن الفاكه بن سعد، عن جده الفاكه بن سعد، - وكانت له صحبة - أن رسول الله  صلى الله عليه وسلم  كان يغتسل يوم الفطر ويوم النحر ويوم عرفة وكان الفاكه يأمر أهله بالغسل في هذه الأيام ‏.‏",
      "text_en": " It wasnarrated from ‘Abdur-Rahman bin ‘Uqbah bin Fakih bin Sa’d,fromhis grandfather Fakih bin Sa’d, who was a Companion of theProphet(ﷺ) that the Messenger of Allah (ﷺ) used to take a bath ontheDay of Fitr, the Day of Nahr, and the day of ‘Arafah, and Fakihused to tell his family to have a bath on these days.",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "19820"
      ]
    }
  ],
  "total_hadiths": 8
}