{
  "id": "19836",
  "name": "al-Akhdr bin Ajlan al-Shybany الأخضر بن عجلان الشيباني البصري",
  "full_name": "al-Akhdr bin Ajlan al-Shybany الأخضر بن عجلان الشيباني البصري",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ 4  -  صدوق ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-1641",
      "hadith_no": "1641",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن مسلمة، أخبرنا عيسى بن يونس، عن الأخضر بن عجلان، عن أبي بكر الحنفي، عن أنس بن مالك، أن رجلا، من الأنصار أتى النبي صلى الله عليه وسلم يسأله فقال ‏\"‏ أما في بيتك شىء ‏\"‏ ‏.‏ قال بلى حلس نلبس بعضه ونبسط بعضه وقعب نشرب فيه من الماء ‏.‏ قال ‏\"‏ ائتني بهما ‏\"‏ ‏.‏ فأتاه بهما فأخذهما رسول الله صلى الله عليه وسلم بيده وقال ‏\"‏ من يشتري هذين ‏\"‏ ‏.‏ قال رجل أنا آخذهما بدرهم ‏.‏ قال ‏\"‏ من يزيد على درهم ‏\"‏ ‏.‏ مرتين أو ثلاثا قال رجل أنا آخذهما بدرهمين ‏.‏ فأعطاهما إياه وأخذ الدرهمين وأعطاهما الأنصاري وقال ‏\"‏ اشتر بأحدهما طعاما فانبذه إلى أهلك واشتر بالآخر قدوما فأتني به ‏\"‏ ‏.‏ فأتاه به فشد فيه رسول الله صلى الله عليه وسلم عودا بيده ثم قال له ‏\"‏ اذهب فاحتطب وبع ولا أرينك خمسة عشر يوما ‏\"‏ ‏.‏ فذهب الرجل يحتطب ويبيع فجاء وقد أصاب عشرة دراهم فاشترى ببعضها ثوبا وببعضها طعاما ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هذا خير لك من أن تجيء المسألة نكتة في وجهك يوم القيامة إن المسألة لا تصلح إلا لثلاثة لذي فقر مدقع أو لذي غرم مفظع أو لذي دم موجع ‏\"‏ ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     A man of the Ansar came to the Prophet (ﷺ) and begged from him.  He (the Prophet) asked: Have you nothing in your house?  He replied: Yes, a piece of cloth, a part of which we wear and a part of which we spread (on the ground), and a wooden bowl from which we drink water.  He said: Bring them to me. He then brought these articles to him and he (the Prophet) took them in his hands and asked: Who will buy these?  A man said: I shall buy them for one dirham.  He said twice or thrice: Who will offer more than one dirham?  A man said: I shall buy them for two dirhams.  He gave these to him and took the two dirhams and, giving them to the Ansari, he said: Buy food with one of them and hand it to your family, and buy an axe and bring it to me. He then brought it to him. The Messenger of Allah (ﷺ) fixed a handle on it with his own hands and said: Go, gather firewood and sell it, and do not let me see you for a fortnight. The man went away and gathered firewood and sold it. When he had earned ten dirhams, he came to him and bought a garment with some of them and food with the others.  The Messenger of Allah (ﷺ) then said: This is better for you than that begging should come as a spot on your face on the Day of Judgment. Begging is right only for three people: one who is in grinding poverty, one who is seriously in debt, or one who is responsible for compensation and finds it difficult to pay.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20347",
        "19836",
        "20254",
        "19"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1218-2",
      "hadith_no": "1218",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا حميد بن مسعدة، أخبرنا عبيد الله بن شميط بن عجلان، حدثنا الأخضر بن عجلان، عن عبد الله الحنفي، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم باع حلسا وقدحا وقال ‏\"‏ من يشتري هذا الحلس والقدح ‏\"‏ ‏.‏ فقال رجل أخذتهما بدرهم ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ من يزيد على درهم من يزيد على درهم ‏\"‏ فأعطاه رجل درهمين فباعهما منه ‏.‏ قال أبو عيسى هذا حديث حسن لا نعرفه إلا من حديث الأخضر بن عجلان ‏.‏ وعبد الله الحنفي الذي روى عن أنس هو أبو بكر الحنفي ‏.‏ والعمل على هذا عند بعض أهل العلم لم يروا بأسا ببيع من يزيد في الغنائم والمواريث ‏.‏ وقد روى المعتمر بن سليمان وغير واحد من أهل الحديث عن الأخضر بن عجلان هذا الحديث ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     That the Messenger of Allah (ﷺ) sold a saddle blanket and a drinking bowl. He (ﷺ) said: \"Who will buy saddle blanket and drinking bowl ?\". So a man said: \"I will take them for a Dirham.\" So the Prophet (ﷺ) said: \"Who will give more than a Dirham ? Who will give more that a Dirham ?\" A man agreed to give him two Dirham, so he sold them to him.[Abu 'Eisa said:] This Hadith is Hasan. We do not know of it except from the narration of Al-Akhdar bin 'Ajlan, and 'Abdullah Al-Hanafi who is reporting from Anas, is Abu Bakr Al-Hanafi.This is acted upon according to some of the people of knowledge, they did not see any harm in auctioning the spolis of war and inheritance.Al-Mu'tamir bin Sulaiman and others among the people of Hadith reported from Al-Akhdar bin 'Ajlan.",
      "usc_msa_ref": "",
      "chain": [
        "30430",
        "24293",
        "19836",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-4508",
      "hadith_no": "4508",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا المعتمر، وعيسى بن يونس، قالا حدثنا الأخضر بن عجلان، عن أبي بكر الحنفي، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم باع قدحا وحلسا فيمن يزيد ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that:                     the Messenger of Allah sold a drinking bowl and a blanket (for a horse of camel) to the highest bidder '",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20288",
        "20347",
        "19836",
        "20254",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-2282",
      "hadith_no": "2282",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا هشام بن عمار، حدثنا عيسى بن يونس، حدثنا الأخضر بن عجلان، حدثنا أبو بكر الحنفي، عن أنس بن مالك، أن رجلا، من الأنصار جاء إلى النبي  صلى الله عليه وسلم  يسأله فقال ‏\"‏ لك في بيتك شىء ‏\"‏ ‏.‏ قال بلى حلس نلبس بعضه ونبسط بعضه وقدح نشرب فيه الماء ‏.‏ قال ‏\"‏ ائتني بهما ‏\"‏ ‏.‏ قال فأتاه بهما فأخذهما رسول الله  صلى الله عليه وسلم  بيده ثم قال ‏\"‏ من يشتري هذين ‏\"‏ ‏.‏ فقال رجل أنا آخذهما بدرهم ‏.‏ قال ‏\"‏ من يزيد على درهم ‏\"‏ ‏.‏ مرتين أو ثلاثا قال رجل أنا آخذهما بدرهمين ‏.‏ فأعطاهما إياه وأخذ الدرهمين فأعطاهما الأنصاري وقال ‏\"‏ اشتر بأحدهما طعاما فانبذه إلى أهلك واشتر بالآخر قدوما فأتني به ‏\"‏ ‏.‏ ففعل فأخذه رسول الله  صلى الله عليه وسلم  فشد فيه عودا بيده وقال ‏\"‏ اذهب فاحتطب ولا أراك خمسة عشر يوما ‏\"‏ ‏.‏ فجعل يحتطب ويبيع فجاء وقد أصاب عشرة دراهم فقال ‏\"‏ اشتر ببعضها طعاما وببعضها ثوبا ‏\"‏ ‏.‏ ثم قال ‏\"‏ هذا خير لك من أن تجيء والمسألة نكتة في وجهك يوم القيامة إن المسألة لا تصلح إلا لذي فقر مدقع أو لذي غرم مفظع أو دم موجع ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that :                     a man from among the Ansar came to the Prophet (ﷺ) and begged from him. He said, \"Do you have anything in your house?\" He said: \"Yes, a blanket, part of which we cover ourselves with and part we spread beneath us, and a bowl from which we drink water.\" He said: \"Givethem to me.\" So he brought them to him, and the Messenger of Allah (ﷺ) took them in his hand and said, \"Who will by these two things?\" A man said: \"I will by them for one Dirham.\" He said: \"Who will offer more than a Dirham?\" two or three times. A man said: \"I will buy them for two Dirham.\" So he gave them to him and took the two Dirham, which he gave to the Ansari and said: \"Buy food with one of them and give it to your family, and buy an axe with the other and bring it to me.\" So he did that, and the Messenger of Allah (ﷺ) took it and fixed a handle to it, and said: \"Go and gather firewood, and I do not want to see you for fifteen days.\" So he went and gathered firewood and sold it, then he came back, and he had earned ten Dirham. (The Prophet (ﷺ)) said: \"Buy food with some of it and clothes with some.\" Then he said: \"This is better for you than coming with begging (appearing)  as a spot on your face on the Day of Resurrection. Begging is only appropriate for one who is extremely poor or who is in severe debt, or one who must pay painful blood money.”[1]",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20347",
        "19836",
        "20254",
        "19"
      ]
    }
  ],
  "total_hadiths": 4
}