{
  "id": "19837",
  "name": "Asha'th bin 'Abdullah bin Jabir أشعث بن عبد الله بن جابر",
  "full_name": "Asha'th bin 'Abdullah bin Jabir أشعث بن عبد الله بن جابر",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خت  4  -  صدوق ]"
    ],
    "tags": [
      "al-Azdi",
      "al-Hadani",
      "Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11044",
      "name": "Shar bin Hushab al-Asha'ri شهر بن حوشب الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11035",
      "name": "Ibn Sirin محمد بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20115",
      "name": "Ma'mar bin Rashid معمر بن راشد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "11073",
      "name": "Sa'id bin Abi 'Aruba سعيد بن أبي عروبة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20286",
      "name": "Mua'dh bin Mua'dh bin Nsr معاذ بن معاذ بن نصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "24031",
      "name": "Bstam bin Hryth بسطام بن حريث",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20280",
      "name": "Muhammad bin 'Abdullah al-Ansari محمد بن عبد الله بن المثني - الأنصاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "27",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، والحسن بن علي، قالا حدثنا عبد الرزاق، قال أحمد حدثنا معمر، أخبرني أشعث، وقال الحسن، عن أشعث بن عبد الله، عن الحسن، عن عبد الله بن مغفل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يبولن أحدكم في مستحمه ثم يغتسل فيه ‏\"‏ ‏.‏ قال أحمد ‏\"‏ ثم يتوضأ فيه فإن عامة الوسواس منه ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mughaffal:                     The Messenger of Allah (ﷺ) said: No one of you should make water in his bath and then wash himself there (after urination). The version of Ahmad has: Then performs ablution there, for evil thoughts come from it.",
      "chain": [
        "30007",
        "30",
        "20121",
        "30007",
        "20115",
        "11324",
        "11016",
        "19837",
        "11016",
        "3242"
      ]
    },
    {
      "hadith_no": "4739",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا بسطام بن حريث، عن أشعث الحداني، عن أنس بن مالك، عن النبي صلى الله عليه وسلم قال ‏:‏ ‏\"‏ شفاعتي لأهل الكبائر من أمتي ‏\"‏ ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Prophet (ﷺ) said: My intercession will be for those of my people who have committed major sins.",
      "chain": [
        "20193",
        "24031",
        "19837",
        "19"
      ]
    },
    {
      "hadith_no": "21",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن حجر، وأحمد بن محمد بن موسى، مردويه قالا أخبرنا عبد الله بن المبارك، عن معمر، عن أشعث بن عبد الله، عن الحسن، عن عبد الله بن مغفل، أن النبي صلى الله عليه وسلم نهى أن يبول الرجل في مستحمه ‏.‏ وقال ‏\"‏ إن عامة الوسواس منه ‏\"‏ ‏.‏ قال وفي الباب عن رجل من أصحاب النبي صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه مرفوعا إلا من حديث أشعث بن عبد الله ويقال له أشعث الأعمى ‏.‏ وقد كره قوم من أهل العلم البول في المغتسل وقالوا عامة الوسواس منه ‏.‏ ورخص فيه بعض أهل العلم منهم ابن سيرين وقيل له إنه يقال إن عامة الوسواس منه فقال ربنا الله لا شريك له ‏.‏ وقال ابن المبارك قد وسع في البول في المغتسل إذا جرى فيه الماء ‏.‏ قال أبو عيسى حدثنا بذلك أحمد بن عبدة الآملي عن حبان عن عبد الله بن المبارك ‏.‏",
      "text_en": " Abdullah bin Mughaffal narrated that :                     the Prophet  prohibited that a man should urinate in his bathing area. And he said: \"It will only cause misgivings.\" [He said:] There are narrations on This topic from \"a man from among the Companions of the Prophet.\"",
      "chain": [
        "20387",
        "30304",
        "20025",
        "20115",
        "19837",
        "11016",
        "3242"
      ]
    },
    {
      "hadith_no": "323",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد الرزاق، أنبأنا معمر، عن أشعث بن عبد الله، عن الحسن، عن عبد الله بن مغفل، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يبولن أحدكم في مستحمه فإن عامة الوسواس منه ‏\"‏ ‏.‏ قال أبو عبد الله بن ماجه سمعت علي بن محمد الطنافسي يقول إنما هذا في الحفيرة فأما اليوم فلا ‏.‏ فمغتسلاتهم الجص والصاروج والقير فإذا بال فأرسل عليه الماء لا بأس به ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Mughaffal said:                     \"The Messenger of Allah said: 'None of you should urinate in his wash area for most of the insinuating thoughts come from that.'\" (Da'if)abu 'Abdullah bin Majah said: (\"Abul-Hasan said: 'I heard Muhammed bin Yazid saying:) ''Ali bim Muhammed At-Tanafisi said: 'This (prohibition) applies to cases where the ground (in the place used for washing) was soft. But nowadays this does not apply, because the baths you use now are built of plaster, Saruj and tar; so if a person urinates there then pours water over it, that clears it away, and that is fine.'\"",
      "chain": [
        "11222",
        "20121",
        "20115",
        "19837",
        "11016",
        "3242"
      ]
    },
    {
      "hadith_no": "2808",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Wills - كتاب الوصايا",
      "chapter_no": "22",
      "text_ar": "حدثنا أحمد بن الأزهر، حدثنا عبد الرزاق بن همام، أنبأنا معمر، عن أشعث بن عبد الله، عن شهر بن حوشب، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الرجل ليعمل بعمل أهل الخير سبعين سنة فإذا أوصى حاف في وصيته فيختم له بشر عمله فيدخل النار وإن الرجل ليعمل بعمل أهل الشر سبعين سنة فيعدل في وصيته فيختم له بخير عمله فيدخل الجنة ‏\"‏ ‏.‏ قال أبو هريرة واقرءوا إن شئتم ‏{تلك حدود الله}‏ إلى قوله {عذاب مهين}‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     “A man may do the deeds of the people of goodness for seventy years, then when he makes his will, he is unjust in his will, so he ends (his life) with evil deeds and enters Hell. And a man may do the people of evil for seventy years, then he is just in his will, so he ends (his life) with good deeds and enters Paradise.”Abu Hurairah said: “Recite, if you wish: “These are the limits (set by) Allah (STW) up to His saying: 'a disgraceful torment'”",
      "chain": [
        "38001",
        "20121",
        "20115",
        "19837",
        "11044",
        "13"
      ]
    }
  ],
  "total_hadiths": 5
}