{
  "id": "19831",
  "name": "'Abdul 'Aziz bin Jurayj عبد العزيز بن جريج",
  "full_name": "'Abdul 'Aziz bin Jurayj عبد العزيز بن جريج",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Undefined",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Undefined] [ 4  - ]"
    ],
    "tags": [
      "Client",
      "al-'Ajli",
      "al-Makki"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "teachers": [
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-2171",
      "hadith_no": "2171",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، عن العلاء بن، يعقوب قال أخبرني أبي أنه، سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ألم تروا الإنسان إذا مات شخص بصره ‏\"‏ ‏.‏ قالوا بلى ‏.‏ قال ‏\"‏ فذلك حين يتبع بصره نفسه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Did you not see when the man died and his eyes were fixedly open? He (Abu Huraira) said: Yes. He (the Holy Prophet) said: It is due to the fact that when (the soul leaves the body) his eyesight follows the soul.",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20121",
        "11070",
        "19831",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-356",
      "hadith_no": "356",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مخلد بن خالد، حدثنا عبد الرزاق، أخبرنا ابن جريج، قال أخبرت عن عثيم بن كليب، عن أبيه، عن جده، أنه جاء إلى النبي صلى الله عليه وسلم فقال قد أسلمت ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ ألق عنك شعر الكفر ‏\"‏ ‏.‏ يقول احلق ‏.‏ قال وأخبرني آخر أن النبي صلى الله عليه وسلم قال لآخر معه ‏\"‏ ألق عنك شعر الكفر واختتن ‏\"‏ ‏.‏",
      "text_en": " 'Uthaim b. Kulaib reported from his father (Kuthair) on the authority of his grandfather (Kulaib) that he came to the Prophet (ﷺ):                      I have embraced Islam. The Prophet (ﷺ) said to him: Remove from yourself the hair that grew during of unbelief, saying \"shave them\". He further says that another person (other than the grandfather of 'Uthaim) reported to him that the Prophet (ﷺ) said to another person who accompanied him: Remove from yourself the hair that grew during the period of unbelief and get yourself circumcised.",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "20121",
        "11070",
        "19831"
      ]
    },
    {
      "id": "sunan-abi-daud-1424",
      "hadith_no": "1424",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن أبي شعيب، حدثنا محمد بن سلمة، حدثنا خصيف، عن عبد العزيز بن جريج، قال سألت عائشة أم المؤمنين بأى شىء كان يوتر رسول الله صلى الله عليه وسلم فذكر معناه قال وفي الثالثة ب ‏{‏ قل هو الله أحد ‏}‏ والمعوذتين ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     AbdulAziz ibn Jurayj said: I asked Aisha, mother of the believers: With which (surah) the Messenger of Allah (ﷺ) used to observe witr? (She reported same as in the Hadith of Ubayy ibn Ka'b, No. 1418) This version adds: In the third rak'ah he would recite: \"Say, He is Allah, the One\" (Surah 112), and  \"Say, I seek refuge in the Lord of daybreak\" (Surah 113), and \"Say, I seek refuge in the Lord of mankind\" (Surah 114).",
      "usc_msa_ref": "",
      "chain": [
        "30301",
        "20672",
        "19908",
        "19831",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-5107",
      "hadith_no": "5107",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا إبراهيم بن أبي الوزير، حدثنا داود بن عبد الرحمن العطار، عن ابن جريج، عن أبيه، عن أم حميد، عن عائشة، رضي الله عنها قالت قال لي رسول الله صلى الله عليه وسلم ‏\"‏ هل رئي - أو كلمة غيرها - فيكم المغربون ‏\"‏ ‏.‏ قلت وما المغربون قال ‏\"‏ الذين يشترك فيهم الجن ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) said to me: Have the mugharribun been seen (or some other word) among you? I asked: What do the mugharribun mean? He replied: They are those in whom is a strain of the jinn.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "31010",
        "20192",
        "11070",
        "19831"
      ]
    },
    {
      "id": "jami-al-tirmidhi-463",
      "hadith_no": "463",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا إسحاق بن إبراهيم بن حبيب بن الشهيد البصري، حدثنا محمد بن سلمة الحراني، عن خصيف، عن عبد العزيز بن جريج، قال سألنا عائشة بأى شيء كان يوتر رسول الله صلى الله عليه وسلم قالت كان يقرأ في الأولى ب ‏(‏سبح اسم ربك الأعلى ‏)‏ وفي الثانية ب‏(‏قل يا أيها الكافرون ‏)‏ وفي الثالثة ب ‏(‏قل هو الله أحد ‏)‏ والمعوذتين ‏.‏ قال أبو عيسى ‏.‏ وهذا حديث حسن غريب ‏.‏ قال وعبد العزيز هذا هو والد ابن جريج صاحب عطاء وابن جريج اسمه عبد الملك بن عبد العزيز بن جريج ‏.‏ وقد روى يحيى بن سعيد الأنصاري هذا الحديث عن عمرة عن عائشة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Abdul-Aziz bin Juraij said:                     \"I asked Aishah about what (recitation) Allah's Messenger would perform Al-Witr with. She said: 'In the first he would recite: Glorify the Name of your Lord the Most High, in the second: Say: O you disbelievers!, and in the third: Say: Allah is One\" and, Al-Mu'awwidhatain.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20672",
        "19908",
        "19831"
      ]
    },
    {
      "id": "sunan-an-nasai-1628",
      "hadith_no": "1628",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا حجاج، قال قال ابن جريج عن أبيه، أخبرني ابن أبي مليكة، أن يعلى بن مملك، أخبره أنه، سأل أم سلمة عن صلاة، رسول الله صلى الله عليه وسلم فقالت كان يصلي العتمة ثم يسبح ثم يصلي بعدها ما شاء الله من الليل ثم ينصرف فيرقد مثل ما صلى ثم يستيقظ من نومه ذلك فيصلي مثل ما نام وصلاته تلك الآخرة تكون إلى الصبح ‏.‏",
      "text_en": " Ya'la bin Mamlak said that he asked Umm Salamah about the prayer of the Messenger of Allah (ﷺ) and she said:                     \"He used to pray 'Isha, then he would recite tasbih, then after that he would pray whatever Allah (SWT) willed (he should pray) of night prayer. Then he would go and sleep for as long as he had prayed. Then he would get up from sleep and pray for as long as he had slept, and this last prayer of his would continue until dawn.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20219",
        "11070",
        "19831",
        "11090",
        "56"
      ]
    },
    {
      "id": "sunan-ibn-majah-1229",
      "hadith_no": "1229",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن الصباح، وأبو يوسف الرقي محمد بن أحمد الصيدلاني قالا حدثنا محمد بن سلمة، عن خصيف، عن عبد العزيز بن جريج، قال سألنا عائشة بأى شىء كان يوتر رسول الله  صلى الله عليه وسلم  قالت كان يقرأ في الركعة الأولى ب ‏{سبح اسم ربك الأعلى}‏ وفي الثانية ‏{قل يا أيها الكافرون}‏ وفي الثالثة ‏{قل هو الله أحد}‏ والمعوذتين ‏.‏",
      "text_en": " It wasnarrated that ‘Abdul-‘Aziz bin Juraij said:                      “We asked ‘Aishahwhat the Messenger of Allah (ﷺ) used to recite in Witr. She said:‘He used to recite: “Glorify the Name of your Lord the MostHigh,”[Al-A’la (87)] in the first Rak’ah, ‘Say: “Odisbelievers!’” [Al-Kafirun (109)] in the second Rak’ah, and‘Say: Allah is One’ in thethird and the Mu’awwidhatain(Chapter 113, 114).’”",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "20672",
        "19908",
        "19831"
      ]
    }
  ],
  "total_hadiths": 7
}