{
  "id": "19839",
  "name": "Bard bin Sinan برد بن سنان",
  "full_name": "Bard bin Sinan برد بن سنان",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "135",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Basra",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Damascus",
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ بخ  4  -  صدوق ]",
      "Fiqh"
    ],
    "tags": [
      "Client",
      "al-Damashqi",
      "al-Basra"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-abi-daud-226",
      "hadith_no": "226",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، حدثنا المعتمر، ح حدثنا أحمد بن حنبل، حدثنا إسماعيل بن إبراهيم، قالا حدثنا برد بن سنان، عن عبادة بن نسى، عن غضيف بن الحارث، قال قلت لعائشة أرأيت رسول الله صلى الله عليه وسلم كان يغتسل من الجنابة في أول الليل أو في آخره قالت ربما اغتسل في أول الليل وربما اغتسل في آخره ‏.‏ قلت الله أكبر الحمد لله الذي جعل في الأمر سعة ‏.‏ قلت أرأيت رسول الله صلى الله عليه وسلم كان يوتر أول الليل أم في آخره قالت ربما أوتر في أول الليل وربما أوتر في آخره ‏.‏ قلت الله أكبر الحمد لله الذي جعل في الأمر سعة ‏.‏ قلت أرأيت رسول الله صلى الله عليه وسلم كان يجهر بالقرآن أم يخفت به قالت ربما جهر به وربما خفت ‏.‏ قلت الله أكبر الحمد لله الذي جعل في الأمر سعة ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Ghudayf ibn al-Harith reported: I asked Aisha: Have you seen the Messenger of Allah (ﷺ) washing (because of defilement) at the beginning of the night or at the end?  She replied: Sometimes he would take a bath at the beginning of the night and sometimes at the end.  Thereupon I exclaimed: Allah is most Great. All Praise be to Allah Who made this matter accommodative.  I again asked her: What do you think, did the Messenger of Allah (ﷺ) say the witr prayer (additional prayer after obligatory prayer at night) in the beginning of the night or at the end?  She replied: Sometimes he would say the witr prayer at the beginning of the night and sometimes at the end.  I exclaimed: Allah is most Great. All praise be to Allah Who made the matter accommodative.  Again I asked her: What do you think, did the Messenger of Allah (ﷺ) recite the Qur'an (in the prayer) loudly or softly?  She replied: Sometimes he would recite loudly and sometimes softly.  I exclaimed: Allah is most Great. All praise be to Allah Who made the matter flexible.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20288",
        "30007",
        "20208",
        "19839"
      ]
    },
    {
      "id": "sunan-abi-daud-3838",
      "hadith_no": "3838",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا عبد الأعلى، وإسماعيل، عن برد بن سنان، عن عطاء، عن جابر، قال كنا نغزو مع رسول الله صلى الله عليه وسلم فنصيب من آنية المشركين وأسقيتهم فنستمتع بها فلا يعيب ذلك عليهم ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     I was on an expedition along with the Messenger of Allah (ﷺ). We got the vessels and skins of the polytheists and used them. But he did not object to them (i.e. us) for that (action).",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20246",
        "20208",
        "19839",
        "11029",
        "34"
      ]
    },
    {
      "id": "jami-al-tirmidhi-601",
      "hadith_no": "601",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف حدثنا بشر بن المفضل، عن برد بن سنان، عن الزهري، عن عروة، عن عائشة، قالت جئت ورسول الله صلى الله عليه وسلم يصلي في البيت والباب عليه مغلق فمشى حتى فتح لي ثم رجع إلى مكانه ‏.‏ ووصفت الباب في القبلة ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Urwah narrated that Aishah said:                     \"I came while the Messenger of Allah was praying in the house and the door was closed. So he walked until he opened the door for me, then he returned to his place.\" And she described the door to be in the direction of the Qiblah.",
      "usc_msa_ref": "",
      "chain": [
        "20212",
        "19839",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2694",
      "hadith_no": "2694",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا عمر بن إسماعيل بن مجالد بن سعيد الهمداني، حدثنا حفص بن غياث، ح قال وأخبرنا سلمة بن شبيب، حدثنا أمية بن القاسم الحذاء البصري، حدثنا حفص بن غياث، عن برد بن سنان، عن مكحول، عن واثلة بن الأسقع، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تظهر الشماتة لأخيك فيرحمه الله ويبتليك ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏ ومكحول قد سمع من واثلة بن الأسقع وأنس بن مالك وأبي هند الداري ويقال إنه لم يسمع من أحد من أصحاب النبي صلى الله عليه وسلم إلا من هؤلاء الثلاثة ‏.‏ ومكحول شامي يكنى أبا عبد الله وكان عبدا فأعتق ومكحول الأزدي بصري سمع من عبد الله بن عمر يروي عنه عمارة بن زاذان ‏.‏",
      "text_en": " Wathilah bin Al-Asqa' narrated that the Messenger of Allah (s.a.w) said:                     \"Do not rejoice over the mishaps of your brother so that Allah has mercy on him and subjects you to trials.\"",
      "usc_msa_ref": "",
      "chain": [
        "20317",
        "30417",
        "20317",
        "19839",
        "11066",
        "4049"
      ]
    },
    {
      "id": "sunan-an-nasai-1206",
      "hadith_no": "1206",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا حاتم بن وردان، قال حدثنا برد بن سنان أبو العلاء، عن الزهري، عن عروة، عن عائشة، - رضى الله عنها - قالت استفتحت الباب ورسول الله صلى الله عليه وسلم يصلي تطوعا والباب على القبلة فمشى عن يمينه أو عن يساره ففتح الباب ثم رجع إلى مصلاه ‏.‏",
      "text_en": " It was narrated that 'Aishah, may Allah (SWT) be pleased with her, said:                     \"I knocked at the door when the Messenger of Allah (ﷺ) was offering a voluntary prayer. The door was in the direction of the Qiblah so he took a few steps to his right or left and opened the door, then he went back to where he was praying.\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "19839",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-18",
      "hadith_no": "18",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا هشام بن عمار، حدثنا يحيى بن حمزة، حدثني برد بن سنان، عن إسحاق بن قبيصة، عن أبيه، أن عبادة بن الصامت الأنصاري النقيب، صاحب رسول الله  صلى الله عليه وسلم  غزا مع معاوية أرض الروم فنظر إلى الناس وهم يتبايعون كسر الذهب بالدنانير وكسر الفضة بالدراهم فقال يا أيها الناس إنكم تأكلون الربا سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ لا تبتاعوا الذهب بالذهب إلا مثلا بمثل لا زيادة بينهما ولا نظرة ‏\"‏ ‏.‏ فقال له معاوية يا أبا الوليد لا أرى الربا في هذا إلا ما كان من نظرة ‏.‏ فقال عبادة أحدثك عن رسول الله  صلى الله عليه وسلم  وتحدثني عن رأيك لئن أخرجني الله لا أساكنك بأرض لك على فيها إمرة ‏.‏ فلما قفل لحق بالمدينة فقال له عمر بن الخطاب ما أقدمك يا أبا الوليد فقص عليه القصة وما قال من مساكنته فقال ارجع يا أبا الوليد إلى أرضك فقبح الله أرضا لست فيها وأمثالك ‏.‏ وكتب إلى معاوية لا إمرة لك عليه واحمل الناس على ما قال فإنه هو الأمر ‏.‏",
      "text_en": " It was narrated from Ishaq bin Qabisah from his father that :                     Ubadah bin Samit Al-Ansari, head of the army unit, the Companion of the Messenger of Allah (ﷺ), went on a military campaign with Mu'awiyah in the land of the Byzantines. He saw people trading pieces of gold for Dinar and pieces of silver for Dirham. He said: \"O people, you are consuming Riba (usury)! For I heard the Messenger of Allah (ﷺ) say: 'Do not sell gold for gold unless it is like for like; there should be no increase and no delay (between the two transactions).'\" Mu'awiyah said to him: \"O Abu Walid, I do not think there is any Riba involved in this , except in cases where there is a delay.\" 'Ubadah said to him: \"I tell you a Hadith from the Messenger of Allah (ﷺ) and you tell me your opinion! If Allah brings me back safely I will never live in a land in which you have authority over me.\" When he returned, he stayed in Al-Madinah, and 'Umar bin Khattab said to him: \"What brought you here, O Abu Walid?\" So he told him the story, and what he had said about not living in the same land as Mu'awiyah. 'Umar said: \"Go back to your land, O Abu Walid, for what a bad land is the land from where you and people like you are absent.\" Then he wrote to Mu'awiyah and said: \"You have no authority over him; make the people follow what he says , for he is right.\"",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20402",
        "19839"
      ]
    },
    {
      "id": "sunan-ibn-majah-1415",
      "hadith_no": "1415",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل ابن علية، عن برد بن سنان، عن عبادة بن نسى، عن غضيف بن الحارث، قال أتيت عائشة فقلت أكان رسول الله  صلى الله عليه وسلم  يجهر بالقرآن أو يخافت به قالت ربما جهر وربما خافت ‏.‏ قلت الله أكبر الحمد لله الذي جعل في هذا الأمر سعة ‏.‏",
      "text_en": " It wasnarrated that Ghudaif bin Harith said:                      “I came to ‘Aishah andasked: ‘Did the Messenger of Allah (ﷺ) recite Qur’an loudly orsoftly?’ She said: ‘Sometimes he would recite loud and sometimessoftly.’ I said, ‘Allahu Akbar! Praise is to Allah Who has madethismatter one of broad scope.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20208",
        "19839"
      ]
    }
  ],
  "total_hadiths": 7
}