{
  "id": "19840",
  "name": "Bryd bin Abi Maryam بريد بن أبي مريم مالك",
  "full_name": "Bryd bin Abi Maryam بريد بن أبي مريم مالك",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "144",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  4  -  ثقة ]"
    ],
    "tags": [
      "al-Saluli",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "41",
      "name": "Abu Musa al-Asha'ari ( أبو موسى الأشعري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19845",
      "name": "Rabi'ya bin Shyban al-Sa'dy ربيعة بن شيبان السعدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11044",
      "name": "Shar bin Hushab al-Asha'ri شهر بن حوشب الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10600",
      "name": "Muhammad bin 'Ali bin al-Hanfiyyah محمد بن الحنفية",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10846",
      "name": "Yonus bin Abi Ishaq يونس بن أبي إسحاق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11626",
      "name": "Rqbh bin Msqlh bin Abd رقبة بن مسقلة",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-1425",
      "hadith_no": "1425",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا قتيبة بن سعيد، وأحمد بن جواس الحنفي، قالا حدثنا أبو الأحوص، عن أبي إسحاق، عن بريد بن أبي مريم، عن أبي الحوراء، قال قال الحسن بن علي رضى الله عنهما علمني رسول الله صلى الله عليه وسلم كلمات أقولهن في الوتر قال ابن جواس في قنوت الوتر ‏\"‏ اللهم اهدني فيمن هديت وعافني فيمن عافيت وتولني فيمن توليت وبارك لي فيما أعطيت وقني شر ما قضيت إنك تقضي ولا يقضى عليك وإنه لا يذل من واليت ولا يعز من عاديت تباركت ربنا وتعاليت ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Hasan ibn Ali:                     The Messenger of Allah (ﷺ) taught me some words that I say during the witr. (The version of Ibn Jawwas has: I say them in the supplication of the witr.) They were: \"O Allah, guide me among those Thou hast guided, grant me security among those Thou hast granted security, take me into Thy charge among those Thou hast taken into Thy charge, bless me in what Thou hast given, guard me from the evil of what Thou hast decreed, for Thou dost decree, and nothing is decreed for Thee. He whom Thou befriendest is not humbled. Blessed and Exalted art Thou, our Lord.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30461",
        "20327",
        "11049",
        "19840",
        "30"
      ]
    },
    {
      "id": "jami-al-tirmidhi-464",
      "hadith_no": "464",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا قتيبة، حدثنا أبو الأحوص، عن أبي إسحاق، عن بريد بن أبي مريم، عن أبي الحوراء السعدي، قال قال الحسن بن علي رضى الله عنهما علمني رسول الله صلى الله عليه وسلم كلمات أقولهن في الوتر ‏\"‏ اللهم اهدني فيمن هديت وعافني فيمن عافيت وتولني فيمن توليت وبارك لي فيما أعطيت وقني شر ما قضيت فإنك تقضي ولا يقضى عليك وإنه لا يذل من واليت تباركت ربنا وتعاليت ‏\"‏ ‏.‏ قال وفي الباب عن علي ‏.‏ قال أبو عيسى هذا حديث حسن لا نعرفه إلا من هذا الوجه من حديث أبي الحوراء السعدي واسمه ربيعة بن شيبان ‏.‏ ولا نعرف عن النبي صلى الله عليه وسلم في القنوت في الوتر شيئا أحسن من هذا ‏.‏ واختلف أهل العلم في القنوت في الوتر فرأى عبد الله بن مسعود القنوت في الوتر في السنة كلها واختار القنوت قبل الركوع ‏.‏ وهو قول بعض أهل العلم وبه يقول سفيان الثوري وابن المبارك وإسحاق وأهل الكوفة ‏.‏ وقد روي عن علي بن أبي طالب أنه كان لا يقنت إلا في النصف الآخر من رمضان وكان يقنت بعد الركوع ‏.‏ وقد ذهب بعض أهل العلم إلى هذا وبه يقول الشافعي وأحمد ‏.‏",
      "text_en": " Al-Hasan bin Ali [may Allah be pleased with him] said:                     \"Allah's Messenger taught me some phrases to say during Al-Witr (Allahummahdini fiman hadait, wa a'fini fiman afait, wa tawallani fiman tawallait, wa barik Li fima atait, wa qini sharra ma qadait, fa Innaka taqdi wa la yuqda Alaik, wa innahu la yadhillu man walait, tabarakta Rabbana wa ta'alait.) 'O Allah guide me among those You have guided, pardon me among those You have pardoned, befriend me among those You have befriended, bless me in what You have granted, and save me from the evil that You decreed. Indeed You decree, and none can pass decree, and none can pass decree upon You, indeed he is not humiliated whom You have befriended, blessed are You our Lord and Exalted.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20327",
        "11049",
        "19840",
        "19845",
        "30"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2708",
      "hadith_no": "2708",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو موسى الأنصاري، حدثنا عبد الله بن إدريس، حدثنا شعبة، عن بريد بن أبي مريم، عن أبي الحوراء السعدي، قال قلت للحسن بن علي ما حفظت من رسول الله صلى الله عليه وسلم قال حفظت من رسول الله صلى الله عليه وسلم ‏\"‏ دع ما يريبك إلى ما لا يريبك فإن الصدق طمأنينة وإن الكذب ريبة ‏\"‏ ‏.‏ وفي الحديث قصة ‏.‏ قال وأبو الحوراء السعدي اسمه ربيعة بن شيبان ‏.‏ قال وهذا حديث حسن صحيح ‏.‏",
      "text_en": " Al-Hasan bin 'Ali said:                     \"I remember that the Messenger of Allah (s.a.w) said: 'Leave what makes you in doubt for what does not make you in doubt. The truth brings tranquility while falsehood sows doubt.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20102",
        "20020",
        "19840",
        "19845"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2772",
      "hadith_no": "2772",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا هناد، حدثنا أبو الأحوص، عن أبي إسحاق، عن بريد بن أبي مريم، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من سأل الله الجنة ثلاث مرات قالت الجنة اللهم أدخله الجنة ‏.‏ ومن استجار من النار ثلاث مرات قالت النار اللهم أجره من النار ‏\"‏ ‏.‏ قال هكذا روى يونس بن أبي إسحاق عن أبي إسحاق هذا الحديث عن بريد بن أبي مريم عن أنس عن النبي صلى الله عليه وسلم نحوه وقد روي عن أبي إسحاق عن بريد بن أبي مريم عن أنس بن مالك موقوفا أيضا ‏.‏",
      "text_en": " Anas bin Malik narrated that the Messenger of Allah (s.a.w) said:                     \"Whoever asks Allah (s.w.t) Paradise three times, Paradise says: 'O Allah, admit him into Paradise', and whoever seeks refuge from the Fire three times, the Fire says: 'O Allah, save him from the Fire.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20327",
        "11049",
        "19840",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-628",
      "hadith_no": "628",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا هناد بن السري، عن أبي الأحوص، عن عطاء بن السائب، عن بريد بن أبي مريم، عن أبيه، قال كنا مع رسول الله صلى الله عليه وسلم في سفر فأسرينا ليلة فلما كان في وجه الصبح نزل رسول الله صلى الله عليه وسلم فنام ونام الناس فلم نستيقظ إلا بالشمس قد طلعت علينا فأمر رسول الله صلى الله عليه وسلم المؤذن فأذن ثم صلى الركعتين قبل الفجر ثم أمره فأقام فصلى بالناس ثم حدثنا بما هو كائن حتى تقوم الساعة ‏.‏",
      "text_en": " It was narrated from Buraid bin Abi Mariam that his father said:                      \"We were with the Messenger of Allah (ﷺ) on a journey, and we kept going one night, then when it was nearly morning the Messenger of Allah (ﷺ) dismounted and slept, and the people slept too. We did not wake up until the sun had risen. The Messenger of Allah (ﷺ) asked the Mu'adhdhin to call the Adhan, then he prayed the two Rak'ahs before Fajr, then he asked him to say the Iqamah, then he led the people in prayer. Then he told us about everything that will happen until the Hour begins.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20327",
        "11068",
        "19840"
      ]
    },
    {
      "id": "sunan-an-nasai-1297",
      "hadith_no": "1297",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إسحاق بن منصور، قال حدثنا محمد بن يوسف، قال حدثنا يونس بن أبي إسحاق، عن بريد بن أبي مريم، قال حدثنا أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صلى على صلاة واحدة صلى الله عليه عشر صلوات وحطت عنه عشر خطيئات ورفعت له عشر درجات ‏\"‏ ‏.‏",
      "text_en": " Anas bin Malik said:                     \"The Messenger of Allah (ﷺ) said: \"Whoever sends salah upon me once, Allah (SWT) will send salah upon him tenfold, and will erase ten sins from him, and will raise him ten degrees in status.\"",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "30388",
        "10846",
        "19840",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-5521",
      "hadith_no": "5521",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو الأحوص، عن أبي إسحاق، عن بريد بن أبي مريم، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من سأل الله الجنة ثلاث مرات قالت الجنة اللهم أدخله الجنة ومن استجار من النار ثلاث مرات قالت النار اللهم أجره من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The Messenger of Allah [SAW] said: 'Whoever asks Allah for Paradise three times, Paradise will say: 'O Allah, admit him to Paradise.' And whoever seeks protection from Hell three times, Hell will say: 'O Allah, protect him from the Fire.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20327",
        "11049",
        "19840",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-5711",
      "hadith_no": "5711",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا محمد بن أبان، قال حدثنا عبد الله بن إدريس، قال أنبأنا شعبة، عن بريد بن أبي مريم، عن أبي الحوراء السعدي، قال قلت للحسن بن علي رضى الله عنهما ما حفظت من رسول الله صلى الله عليه وسلم قال حفظت منه ‏\"‏ دع ما يريبك إلى ما لا يريبك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Al-Hawra' As-Sa'di said:                     \"I said to Al-Hasan bin 'Ali, may Allah be pleased with him: 'What did you memorize from the Messenger of Allah [SAW]?' He said: I memorized from him: 'Leave that which makes you doubt for that which does not make you doubt.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30369",
        "20102",
        "20020",
        "19840",
        "19845"
      ]
    },
    {
      "id": "sunan-ibn-majah-970",
      "hadith_no": "970",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن عامر بن زرارة، حدثنا أبو بكر بن عياش، عن أبي إسحاق، عن بريد بن أبي مريم، عن أبي موسى، قال صلى بنا علي يوم الجمل صلاة ذكرنا صلاة رسول الله  صلى الله عليه وسلم  فإما أن نكون نسيناها وإما أن نكون تركناها فسلم على يمينه وعلى شماله ‏.‏",
      "text_en": " It wasnarrated that Abu Musa said:                      “Ali led us in prayer on the dayof(the battle of) the Camel, in a way that reminded us of the prayerofthe Messenger of Allah (ﷺ). Either we had forgotten it or we hadabandoned it. He said the Salam to his right and to his left.”",
      "usc_msa_ref": "",
      "chain": [
        "30467",
        "20373",
        "11049",
        "19840",
        "41"
      ]
    },
    {
      "id": "sunan-ibn-majah-1234",
      "hadith_no": "1234",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شريك، عن أبي إسحاق، عن بريد بن أبي مريم، عن أبي الحوراء، عن الحسن بن علي، قال علمني جدي رسول الله  صلى الله عليه وسلم  كلمات أقولهن في قنوت الوتر ‏\"‏ اللهم عافني فيمن عافيت وتولني فيمن توليت واهدني فيمن هديت وقني شر ما قضيت وبارك لي فيما أعطيت إنك تقضي ولا يقضى عليك إنه لا يذل من واليت سبحانك ربنا تباركت وتعاليت ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Al-Hasan bin ‘Ali said:                      “My grandfather, theMessenger of Allah (ﷺ), taught me some words to say in Qunut ofWitr: Allahumma ‘afini fiman ‘afait, wa tawallani fimantawallait,wahdini fiman hadait, wa qini sharra ma qadait, wa barikli fimaa’tait. Innaka taqdi wa la yuqda ‘alaik, innahu layudhillu manwalait. Subhanaka rabbana tabarakta wa ta’alait (OAllah, pardon mealong with those whom You have pardoned, be an allyto me along withthose whom You are an ally to, guide me along withthose whom You haveguided, protect me from the evil that You havedecreed, and bless forme that which You have bestowed. For verilyYou decree and none candecree over You. He whom You support cannever be humiliated. Glory isto You, our Lord, You are Blessed andExalted).”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20587",
        "11049",
        "19840",
        "30"
      ]
    }
  ],
  "total_hadiths": 10
}