{
  "id": "19853",
  "name": "Abd al-Mjyd bin Aby عبد المجيد بن أبي يزيد وهب العقيلي",
  "full_name": "Abd al-Mjyd bin Aby عبد المجيد بن أبي يزيد وهب العقيلي",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ 4  -  ثقة ]"
    ],
    "tags": [
      "al-Aqayli",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "1216",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن بشار، أخبرنا عباد بن ليث، صاحب الكرابيسي البصري أخبرنا عبد المجيد بن وهب، قال قال لي العداء بن خالد بن هوذة ألا أقرئك كتابا كتبه لي رسول الله صلى الله عليه وسلم قال قلت بلى ‏.‏ فأخرج لي كتابا ‏\"‏ هذا ما اشترى العداء بن خالد بن هوذة من محمد رسول الله صلى الله عليه وسلم اشترى منه عبدا أو أمة لا داء ولا غائلة ولا خبثة بيع المسلم المسلم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث عباد بن ليث وقد روى عنه هذا الحديث غير واحد من أهل الحديث ‏.‏",
      "text_en": " Narrated 'Abbad bin Laith Al-Karabisi [Al-Basri]:                     \"Abdul Majid bin Wahb narrated to us, he said: 'Al-'Adda' bin Khalid bin Hawdhah said to me: \"Shall I not read to you a letter that was written for me from the Messenger of Allah (ﷺ) ?'\" He said: 'I said: \"Of course.\" So he took out a letter for me: \"This is what Al-'Adda' bin Khalid bin Hawdhah purchased from Muhammad, the Messenger of Allah (ﷺ): He purchased from him a slave' - or - 'a female slave, having no ailments, nor being a runaway, nor having any malicious behavior. Sold by a Muslim to a Muslim.'\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except from 'Abbad bin Laith. More than one of the people of Hadith have reported this Hadith from him.",
      "chain": [
        "30160",
        "19853",
        "3701"
      ]
    },
    {
      "hadith_no": "2336",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عباد بن ليث، صاحب الكرابيسي حدثنا عبد المجيد بن وهب، قال قال لي العداء بن خالد بن هوذة ألا نقرئك كتابا كتبه لي رسول الله  صلى الله عليه وسلم  ‏.‏ قال قلت بلى ‏.‏ فأخرج لي كتابا فإذا فيه ‏\"‏ هذا ما اشترى العداء بن خالد بن هوذة من محمد رسول الله  صلى الله عليه وسلم  اشترى منه عبدا أو أمة لا داء ولا غائلة ولا خبثة بيع المسلم للمسلم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdul-Majid bin Wahb said:                     \"Adda' bin Khalid bin Hawdhah said to me: 'Shall I not read to you a letter that the Messenger of Allah (ﷺ), wrote to me?' I said: 'Yes.' So he took out a letter. In it was: 'This is what 'Adda' bin Khalid bin Hawdhah bought [from] Muhammad the Messenger of Allah (ﷺ)  He bought from him a slave' or 'a female slave, having no ailments, nor being a runaway, not having any malicious behavior. Sold by a Muslim to a Muslim.'\"",
      "chain": [
        "30160",
        "19853",
        "3701"
      ]
    }
  ],
  "total_hadiths": 2
}