{
  "id": "19863",
  "name": "Bilal bin Yahya al-Bsy بلال بن يحيى العبسي الكوفي",
  "full_name": "Bilal bin Yahya al-Bsy بلال بن يحيى العبسي الكوفي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ بخ  4  -  صدوق ]"
    ],
    "tags": [
      "al-'Absi",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "145",
      "name": "Hudhayfah ibn al-Yaman ( حذيفة بن اليمان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10773",
      "name": "Shtyr bin Shkl bin Hameed شتير بن شكل",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "students": [
    {
      "id": "20722",
      "name": "Sa'd bin Aws al-Bsy سعد بن أوس العبسي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "25047",
      "name": "Habib bin Slym al-Bsy حبيب بن سليم العبسي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10957",
      "name": "al-Lyth bin Abi Sulaym الليث بن أبي سليم",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1715",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Lost and Found Items - كتاب اللقطة",
      "chapter_no": "10",
      "text_ar": "حدثنا الهيثم بن خالد الجهني، حدثنا وكيع، عن سعد بن أوس، عن بلال بن يحيى العبسي، عن علي، رضى الله عنه أنه التقط دينارا فاشترى به دقيقا فعرفه صاحب الدقيق فرد عليه الدينار فأخذه علي وقطع منه قيراطين فاشترى به لحما ‏.‏",
      "text_en": " Narrated Ali ibn Abu Talib:                     Bilal ibn Yahya al-Absi said: Ali found a dinar and purchased some flour with it. The seller of the flour recognised him and returned the dinar to him. Ali took it, deducted two qirat (carat) from it, and purchased meat with it.",
      "chain": [
        "35162",
        "20032",
        "20722",
        "19863",
        "5"
      ]
    },
    {
      "hadith_no": "986",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا عبد القدوس بن بكر بن خنيس، حدثنا حبيب بن سليم العبسي، عن بلال بن يحيى العبسي، عن حذيفة بن اليمان، قال إذا مت فلا تؤذنوا بي أحدا إني أخاف أن يكون نعيا فإني سمعت رسول الله صلى الله عليه وسلم ينهى عن النعى ‏.‏ هذا حديث حسن ‏.‏",
      "text_en": " Bilal bin Yahya Al-Absiy narrated that:                     Hudaifah (bin Al-Yaman) said: \"When I do not announce about me to anyone, indeed I fear that it would be An-Na'i, and I heard the Messenger of Allah prohibiting from An-Na'i.\"",
      "chain": [
        "30242",
        "25171",
        "25047",
        "19863",
        "145"
      ]
    },
    {
      "hadith_no": "3492",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو أحمد الزبيري، حدثنا سعد بن أوس، عن بلال بن يحيى العبسي، عن شتير بن شكل، عن أبيه، شكل بن حميد قال أتيت النبي صلى الله عليه وسلم فقلت يا رسول الله علمني تعوذا أتعوذ به ‏.‏ قال فأخذ بكتفي فقال ‏\"‏ قل اللهم إني أعوذ بك من شر سمعي ومن شر بصري ومن شر لساني ومن شر قلبي ومن شر منيي ‏\"‏ ‏.‏ يعني فرجه ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه من حديث سعد بن أوس عن بلال بن يحيى ‏.‏",
      "text_en": " Shakal bin Humaid said:                      \"I came to the Prophetand said: 'O Messenger of Allah, teach me away of seeking refuge so that I may seek refuge by it.\" He said: \"So he took my hand and said: 'Say: O Allah, indeed I seek refuge in Youfrom the evil of my hearing and the evil of my sight, and the evil of my tongue and the evil of my heart, and the evil of my semen (Allahumma inni a`udhu bika min sharri sam`i wa min sharri basari, wa min sharri lisani, wa min sharri qalbi, wa min sharri maniyyi.'\"",
      "chain": [
        "30242",
        "20355",
        "20722",
        "19863",
        "10773"
      ]
    },
    {
      "hadith_no": "5444",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا الحسين بن إسحاق، قال حدثنا أبو نعيم، قال حدثنا سعد بن أوس، قال حدثني بلال بن يحيى، أن شتير بن شكل، أخبره عن أبيه، شكل بن حميد قال أتيت النبي صلى الله عليه وسلم فقلت يا نبي الله علمني تعوذا أتعوذ به فأخذ بيدي ثم قال ‏\"‏ قل أعوذ بك من شر سمعي وشر بصري وشر لساني وشر قلبي وشر منيي ‏\"‏ ‏.‏ قال حتى حفظتها قال سعد والمني ماؤه ‏.‏",
      "text_en": " It was narrated that Shakal bin Humaid said:                     \"I came to the Prophet [SAW] and said: 'O Prophet of Allah, teach me words by means of which I may seek refuge with Allah.' He took me by the hand and said: 'Say: A'udhu bika min sharri sam'i, wa sharri basari, wa sharri lisani, wa sharri qalbi, wa sharri mani (I seek refuge with You from the evil of my hearing, the evil of my seeing, the evil of my tongue, the evil of my heart, and the evil of my sperm).'\"",
      "chain": [
        "38164",
        "20348",
        "20722",
        "19863",
        "10773"
      ]
    },
    {
      "hadith_no": "5455",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا الحسين بن إسحاق، قال أنبأنا أبو نعيم، قال حدثنا سعد بن أوس، قال حدثني بلال بن يحيى، أن شتير بن شكل، أخبره عن أبيه، شكل بن حميد قال أتيت النبي صلى الله عليه وسلم فقلت يا نبي الله علمني تعوذا أتعوذ به فأخذ بيدي ثم قال ‏\"‏ قل أعوذ بك من شر سمعي وشر بصري وشر لساني وشر قلبي وشر منيي ‏\"‏ ‏.‏ قال حتى حفظتها قال سعد والمني ماؤه ‏.‏ خالفه وكيع في لفظه ‏.‏",
      "text_en": " It was narrated that Shakal bin Humaid said:                     \"I came to the Prophet [SAW] and said: 'O Prophet of Allah, teach me words by which I may seek refuge (with Allah).' He took me by the hand then said: 'Say: A'udhu bika min sharri sam'i, wa sharri basari, wa sharri lisani, wa sharri qalbi, wa sharri mani (I seek refuge in You from the evil of my hearing, the evil of my seeing, the evil of my tongue, the evil of my heart, and the evil of my sperm),' until I had memorized it.\" Waki' contradicted him in the wordings.",
      "chain": [
        "38164",
        "20348",
        "20722",
        "19863",
        "10773"
      ]
    },
    {
      "hadith_no": "5456",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا عبيد بن وكيع بن الجراح، قال حدثنا أبي، عن سعد بن أوس، عن بلال بن يحيى، عن شتير بن شكل بن حميد، عن أبيه، قال قلت يا رسول الله علمني دعاء أنتفع به ‏.‏ قال ‏\"‏ قل اللهم عافني من شر سمعي وبصري ولساني وقلبي ومن شر منيي ‏\"‏ ‏.‏ يعني ذكره ‏.‏",
      "text_en": " It was narrated from Shutair bin Shakal bin Humaid, that his father said:                     \"I said: 'O Messenger of Allah, teach me a supplication from which I may benefit.' He said: 'Say: Allahumma 'afini min sharri sam'i, wa basari, wa lisani, wa qalbi, wa min sharri mani (O Allah, protect me from the evil of my hearing, my seeing, my tongue and my heart, and from the evil of my sperm.)'\" - Meaning sexual organ.",
      "chain": [
        "20722",
        "19863",
        "10773"
      ]
    },
    {
      "hadith_no": "5484",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرني عبيد بن وكيع، قال حدثنا أبي، عن سعد بن أوس، عن بلال بن يحيى، عن شتير بن شكل بن حميد، عن أبيه، قال قلت يا رسول الله علمني دعاء أنتفع به ‏.‏ قال ‏\"‏ قل اللهم عافني من شر سمعي وبصري ولساني وقلبي وشر منيي ‏\"‏ ‏.‏ يعني ذكره ‏.‏",
      "text_en": " It was narrated from Shutair bin Shakal bin Humaid, that his father said:                     \"I said: 'O Messenger of Allah, teach me a supplication from which I may benefit.' He said: 'Say: Allahumma 'afini min sharri sam'i, wa basari, wa lisani, wa qalbi, wa sharri mani (O Allah, protect me from the evil of my hearing, my seeing, my tongue and my heart, and the evil of my sperm.)\" - Meaning his sexual organ.",
      "chain": [
        "20722",
        "19863",
        "10773"
      ]
    },
    {
      "hadith_no": "1543",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا عمرو بن رافع، حدثنا عبد الله بن المبارك، عن حبيب بن سليم، عن بلال بن يحيى، قال كان حذيفة إذا مات له الميت قال لا تؤذنوا به أحدا إني أخاف أن يكون نعيا إني سمعت رسول الله  صلى الله عليه وسلم  بأذنى هاتين ينهى عن النعى ‏.‏",
      "text_en": " It wasnarrated that Bilal bin Yahya said:                      “If one of the members ofhisfamily died, Hudhaifah would say: ‘Do not inform anyone of it, forI am afraid that that would be a public death announcement. I heardthe Messenger of Allah (ﷺ) with these two ears of mine forbiddingmaking public death announcements.’”",
      "chain": [
        "18792",
        "20025",
        "19863"
      ]
    },
    {
      "hadith_no": "3510",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا الحسين بن أبي السري، حدثنا عبيد الله، حدثنا سعد بن أوس العبسي، عن بلال بن يحيى العبسي، عن أبي بكر بن حفص، عن ابن محيريز، عن ثابت بن السمط، عن عبادة بن الصامت، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يشرب ناس من أمتي الخمر باسم يسمونها إياه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Ubadah bin Samit that the Messenger of Allah(ﷺ)said:                      “People among my nation will drink wine, under some othername that they will give it.”",
      "chain": [
        "11201",
        "20722",
        "19863",
        "11180",
        "40"
      ]
    }
  ],
  "total_hadiths": 9
}