{
  "id": "19862",
  "name": "Bkyr bin Ata'a al-Lythy بكير بن عطاء الليثي الكوفي",
  "full_name": "Bkyr bin Ata'a al-Lythy بكير بن عطاء الليثي الكوفي",
  "grade": "Follower(Tabi') [4th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ 4  -  ثقة ]"
    ],
    "tags": [
      "al-Laithi",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5157",
      "name": "'Abdur Rahman bin Y'mr ( عبد الرحمن بن يعمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-1949",
      "hadith_no": "1949",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن كثير، حدثنا سفيان، حدثني بكير بن عطاء، عن عبد الرحمن بن أبي يعمر الديلي، قال أتيت النبي صلى الله عليه وسلم وهو بعرفة فجاء ناس - أو نفر - من أهل نجد فأمروا رجلا فنادى رسول الله صلى الله عليه وسلم كيف الحج فأمر رسول الله صلى الله عليه وسلم رجلا فنادى ‏\"‏ الحج الحج يوم عرفة من جاء قبل صلاة الصبح من ليلة جمع فتم حجه أيام منى ثلاثة فمن تعجل في يومين فلا إثم عليه ومن تأخر فلا إثم عليه ‏\"‏ ‏.‏ قال ثم أردف رجلا خلفه فجعل ينادي بذلك ‏.‏ قال أبو داود وكذلك رواه مهران عن سفيان قال ‏\"‏ الحج الحج ‏\"‏ ‏.‏ مرتين ورواه يحيى بن سعيد القطان عن سفيان قال ‏\"‏ الحج ‏\"‏ ‏.‏ مرة ‏.‏",
      "text_en": " Narrated AbdurRahman Ya'mar ad-Dayli:                     I came to the Holy Prophet (ﷺ) when he was in Arafat. Some people or a group of people came from Najd. They commanded someone (to ask the Prophet about hajj).  So he called the Messenger of Allah (ﷺ), saying: How is the hajj done? He (the Prophet) ordered a man (to reply).  He shouted loudly: The hajj, the hajj is on the day of Arafah. If anyone comes over there before the dawn prayer on the night of al-Muzdalifah, his hajj will be complete. The period of halting at Mina is three days. Then whoever hastens (his departure) by two days, it is no sin for him, and whoever delays it there is no sin for him.  The narrator said: He (the Prophet) then put a man behind him on the camel. He began to proclaim this loudly.Abu Dawud said: This tradition has been narrated by Mahran from Sufyan in a similar way. This version adds: The Hajj, the Hajj, twice. The version narrated by Yaya b. Sa'id al-Qattan has the words: The Hajj only once.",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "19862"
      ]
    },
    {
      "id": "jami-al-tirmidhi-889",
      "hadith_no": "889",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، وعبد الرحمن بن مهدي، قالا حدثنا سفيان، عن بكير بن عطاء، عن عبد الرحمن بن يعمر، أن ناسا، من أهل نجد أتوا رسول الله صلى الله عليه وسلم وهو بعرفة فسألوه فأمر مناديا فنادى ‏\"‏ الحج عرفة من جاء ليلة جمع قبل طلوع الفجر فقد أدرك الحج أيام منى ثلاثة فمن تعجل في يومين فلا إثم عليه ومن تأخر فلا إثم عليه ‏\"‏ ‏.‏ قال محمد وزاد يحيى وأردف رجلا فنادى.",
      "text_en": " Abdur-Rahman bin Ya'mar narrated that:                     Some people among the residents of Najd came to the Messenger of Allah while he was at Arafat. They were questioning him, so he ordered a caller to proclaim: \"The Hajj is Arafah. Whoever came to Jam during the night, before the time of Fajr, then he has attended the Hajj. The days of Mina are three, so whoever hastens (leaving after) two days, then there is no sin upon him, and whoever delays, then there is no sin upon him.\" Muhammad said: \"Yahya added: 'And he took a companion rider to proclaim it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20033",
        "20012",
        "19862"
      ]
    },
    {
      "id": "jami-al-tirmidhi-890",
      "hadith_no": "890",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن سفيان الثوري، عن بكير بن عطاء، عن عبد الرحمن بن يعمر، عن النبي صلى الله عليه وسلم نحوه بمعناه ‏.‏ وقال ابن أبي عمر قال سفيان بن عيينة وهذا أجود حديث رواه سفيان الثوري ‏.‏ قال أبو عيسى والعمل على حديث عبد الرحمن بن يعمر عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أنه من لم يقف بعرفات قبل طلوع الفجر فقد فاته الحج ولا يجزئ عنه إن جاء بعد طلوع الفجر ويجعلها عمرة وعليه الحج من قابل ‏.‏ وهو قول الثوري والشافعي وأحمد وإسحاق ‏.‏ قال أبو عيسى وقد روى شعبة عن بكير بن عطاء نحو حديث الثوري ‏.‏ قال وسمعت الجارود يقول سمعت وكيعا أنه ذكر هذا الحديث فقال هذا الحديث أم المناسك ‏.‏",
      "text_en": " Abdur-Rahman bin Ya'mar narrated:                     (Another chain) with a similar narration (as no. 889).",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "20012",
        "19862"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3241",
      "hadith_no": "3241",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن سفيان الثوري، عن بكير بن عطاء، عن عبد الرحمن بن يعمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الحج عرفات الحج عرفات الحج عرفات أيام منى ثلاث ‏:‏ ‏(‏فمن تعجل في يومين فلا إثم عليه ومن تأخر فلا إثم عليه ‏)‏ ومن أدرك عرفة قبل أن يطلع الفجر فقد أدرك الحج ‏\"‏ ‏.‏ قال ابن أبي عمر قال سفيان بن عيينة وهذا أجود حديث رواه الثوري ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ ورواه شعبة عن بكير بن عطاء ولا نعرفه إلا من حديث بكير بن عطاء ‏.‏",
      "text_en": " Narrated 'Abdur-Rahman bin Ya'mar:                     that the Messenger of Allah (ﷺ) said: \"The Hajj is 'Arafat, the Hajj is 'Arafat, the Hajj is 'Arafat. The days of Mina are three: But whoever hastens to leave in two days, there is no sin on him, and whoever stays on, there is no sin on him (2:203). And whoever sees (attends) the 'Arafah before the rising of Fajr, then he has performed the Hajj.\" Ibn Abi 'Umar said: \"Sufyan bin 'Uyainah said: 'This is the best Hadith that Ath-Thawri reported.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "20012",
        "19862"
      ]
    },
    {
      "id": "sunan-an-nasai-3016",
      "hadith_no": "3016",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا وكيع، قال حدثنا سفيان، عن بكير بن عطاء، عن عبد الرحمن بن يعمر، قال شهدت رسول الله صلى الله عليه وسلم فأتاه ناس فسألوه عن الحج فقال رسول الله صلى الله عليه وسلم ‏\"‏ الحج عرفة فمن أدرك ليلة عرفة قبل طلوع الفجر من ليلة جمع فقد تم حجه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abdur-Rahman bin Yamur said:                     \"I saw the Messenger of Allah when people came to him and asked him about Hajj. The Messenger of Allah said: 'Hajj is Arafat. Whoever catches up with the night of Arafat before dawn comes on the night of Jam (Al-Muzdalifah), his Hajj is complete.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20032",
        "20012",
        "19862"
      ]
    },
    {
      "id": "sunan-an-nasai-3044",
      "hadith_no": "3044",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا سفيان، قال حدثني بكير بن عطاء، قال سمعت عبد الرحمن بن يعمر الديلي، قال شهدت النبي صلى الله عليه وسلم بعرفة وأتاه ناس من نجد فأمروا رجلا فسأله عن الحج فقال ‏\"‏ الحج عرفة من جاء ليلة جمع قبل صلاة الصبح فقد أدرك حجه أيام منى ثلاثة أيام ‏{‏ من تعجل في يومين فلا إثم عليه ومن تأخر فلا إثم عليه ‏}‏ ‏\"‏ ‏.‏ ثم أردف رجلا فجعل ينادي بها في الناس ‏.‏",
      "text_en": " Abdur Rahman bin Yamur Ad-Daili said:                     \"I saw the prophet in Arafat when some people from Najd coame to him. They told a man to ask him about Hajj. He said: \"Hajj is Arafat. Whoever comes on the night of Jam (Al-Muzdalifah) before Subh prayer, then he has caought up with Hajj. And the days of Mina are three days. But whoever hastens to leave in two days, there is no sion on him, and whoever stays on, there is no sino on him.' Then he made a man ride behind him, and he started proclaiming it to the people.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20012",
        "19862"
      ]
    },
    {
      "id": "sunan-an-nasai-5628",
      "hadith_no": "5628",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا محمد بن أبان، قال حدثنا شبابة بن سوار، قال حدثنا شعبة، عن بكير بن عطاء، عن عبد الرحمن بن يعمر، عن النبي صلى الله عليه وسلم نهى عن الدباء، والمزفت، ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin Ya'mar that:                     The Prophet [SAW] forbade Ad-Dubba' and Al-Muzaffat.",
      "usc_msa_ref": "",
      "chain": [
        "30369",
        "20426",
        "20020",
        "19862"
      ]
    },
    {
      "id": "sunan-ibn-majah-3129",
      "hadith_no": "3129",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا وكيع، حدثنا سفيان، عن بكير بن عطاء، سمعت عبد الرحمن بن يعمر الديلي، قال شهدت رسول الله  صلى الله عليه وسلم  وهو واقف بعرفة وأتاه ناس من أهل نجد فقالوا يا رسول الله كيف الحج قال ‏\"‏ الحج عرفة فمن جاء قبل صلاة الفجر ليلة جمع فقد تم حجه أيام منى ثلاثة فمن تعجل في يومين فلا إثم عليه ومن تأخر فلا إثم عليه ‏\"‏ ‏.‏ ثم أردف رجلا خلفه فجعل ينادي بهن ‏.‏",
      "text_en": " Sufyanbin Bukair bin ‘Ata’ said:                      “I heard ‘Abdur-Rahman bin Ya’murDili say: ‘I saw the Messenger of Allah (ﷺ) when he was standingat‘Arafat, and some people from Najd came to him and said: “OMessengerof Allah, what is Hajj?” He said: “Hajj is ‘Arafah.Whoever comesbefore Fajr prayer on the night of Jam’, he hascompleted his Hajj.The days at Mina are three. ‘But whosoeverhastens to leave in twodays, there is no sin on him and whosoeverstays on, there is no sinon him.’” [2:203] Then he seated a manbehind him on his mount and hestarted calling out these words.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "38409",
        "20032",
        "20012",
        "19862"
      ]
    },
    {
      "id": "sunan-ibn-majah-3130",
      "hadith_no": "3130",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد الرزاق، أنبأنا الثوري، عن بكير بن عطاء الليثي، عن عبد الرحمن بن يعمر الديلي، قال أتيت رسول الله  صلى الله عليه وسلم  بعرفة فجاءه نفر من أهل نجد فذكر نحوه ‏.‏ قال محمد بن يحيى ما أرى للثوري حديثا أشرف منه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20121",
        "20012",
        "19862"
      ]
    },
    {
      "id": "sunan-ibn-majah-3530",
      "hadith_no": "3530",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو بكر، والعباس بن عبد العظيم العنبري، قالا حدثنا شبابة، عن شعبة، عن بكير بن عطاء، عن عبد الرحمن بن يعمر، قال نهى رسول الله  صلى الله عليه وسلم  عن الدباء والحنتم ‏.‏",
      "text_en": " It wasnarrated that ‘Abdur-Rahman bin Ya’mar said:                      “The Messenger ofAllah (ﷺ) forbade Dubba’ and Hantam.”",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "30437",
        "20426",
        "20020",
        "19862"
      ]
    }
  ],
  "total_hadiths": 10
}