{
  "id": "19867",
  "name": "al-Sa'ib bin Malik السائب بن مالك",
  "full_name": "al-Sa'ib bin Malik السائب بن مالك",
  "grade": "Follower(Tabi') [2nd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  4  -  ثقة ]"
    ],
    "tags": [
      "al-Thaqifi",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "11068",
      "name": "Ata'a bin al-Sa'ib al-Thaqifi عطاء بن السائب الثقفي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "teachers": [],
  "students": [
    {
      "id": "11068",
      "name": "Ata'a bin al-Sa'ib al-Thaqifi عطاء بن السائب الثقفي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-1194",
      "hadith_no": "1194",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، قال انكسفت الشمس على عهد رسول الله صلى الله عليه وسلم فقام رسول الله صلى الله عليه وسلم فلم يكد يركع ثم ركع فلم يكد يرفع ثم رفع فلم يكد يسجد ثم سجد فلم يكد يرفع ثم رفع فلم يكد يسجد ثم سجد فلم يكد يرفع ثم رفع وفعل في الركعة الأخرى مثل ذلك ثم نفخ في آخر سجوده فقال ‏\"‏ أف أف ‏\"‏ ‏.‏ ثم قال ‏\"‏ رب ألم تعدني أن لا تعذبهم وأنا فيهم ألم تعدني أن لا تعذبهم وهم يستغفرون ‏\"‏ ‏.‏ ففرغ رسول الله صلى الله عليه وسلم من صلاته وقد أمحصت الشمس وساق الحديث ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     There was an eclipse of the sun in the time of the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) stood up and he was not going to perform bowing till he bowed; and he was not going to raise his head till he raised (after bowing); and he was not going to prostrate himself till he prostrated himself; and he was not going to raise his head till he raised (at the end of prostration); he did similarly in the second rak'ah, he then puffed in the last prostration saying; Fie, Fie! He then said: My Lord, didst Thou not promise me that Thou wouldst not punish them so long as I will remain among them? Didst Thou not promise me that Thou will not punish them so long as they continue to beg pardon of Thee. The Messenger of Allah (ﷺ) finished the prayer, and the sun was clear. The narrator then narrated the tradition (in full).",
      "usc_msa_ref": "",
      "chain": [
        "20040",
        "20022",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "id": "sunan-abi-daud-1389",
      "hadith_no": "1389",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا سليمان بن حرب، أخبرنا حماد، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ صم من كل شهر ثلاثة أيام واقرإ القرآن في شهر ‏\"‏ ‏.‏ فناقصني وناقصته فقال ‏\"‏ صم يوما وأفطر يوما ‏\"‏ ‏.‏ قال عطاء واختلفنا عن أبي فقال بعضنا سبعة أيام وقال بعضنا خمسا ‏.‏",
      "text_en": " Narrated 'Abd Allah b. 'Amr:                     The Messenger of Allah (ﷺ) said to me: Keep fast for three days of month, and finish the recitation of the Qur'an in one month. I and he differed among ourselves on period of time. He said: Fast one day and give it up other day. The narrator 'Ata said: The people differed from my father (in narrating the period of time). Some narrated seven days and others five.",
      "usc_msa_ref": "",
      "chain": [
        "20193",
        "20022",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "id": "sunan-abi-daud-1502",
      "hadith_no": "1502",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، ومحمد بن قدامة، - في آخرين - قالوا حدثنا عثام، عن الأعمش، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، قال رأيت رسول الله صلى الله عليه وسلم - يعقد التسبيح قال ابن قدامة - بيمينه ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     I saw the Messenger of Allah (ﷺ) counting the glorification of Allah on fingers. Ibn Qudamah said (in his version: \"With his right hands\".",
      "usc_msa_ref": "",
      "chain": [
        "30024",
        "38573",
        "20343",
        "11060",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "id": "sunan-abi-daud-2528",
      "hadith_no": "2528",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، حدثنا عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، قال ‏:‏ جاء رجل إلى رسول الله صلى الله عليه وسلم فقال ‏:‏ جئت أبايعك على الهجرة وتركت أبوى يبكيان ‏.‏ فقال ‏:‏ ‏\"‏ ارجع عليهما فأضحكهما كما أبكيتهما ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     A man came to the Messenger of Allah (ﷺ) and said: I came to you to take the oath of allegiance to you on emigration, and I left my parents weeping. He (the Prophet) said: Return to them and make them laugh  as you made them weep.",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "id": "sunan-abi-daud-3046",
      "hadith_no": "3046",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا عطاء بن السائب، عن حرب بن عبيد الله، عن جده أبي أمه، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما العشور على اليهود والنصارى وليس على المسلمين عشور ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubaydullah:                     Harb ibn Ubaydullah told on the authority of his grandfather, his mother's father, that he had it on the authority of his father that the Messenger of Allah (ﷺ) said: Tithes are to be levied on Jews and Christians, but not on Muslims.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20327",
        "11068",
        "19867"
      ]
    },
    {
      "id": "sunan-abi-daud-5065",
      "hadith_no": "5065",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم قال ‏\"‏ خصلتان أو خلتان لا يحافظ عليهما عبد مسلم إلا دخل الجنة هما يسير ومن يعمل بهما قليل يسبح في دبر كل صلاة عشرا ويحمد عشرا ويكبر عشرا فذلك خمسون ومائة باللسان وألف وخمسمائة في الميزان ويكبر أربعا وثلاثين إذا أخذ مضجعه ويحمد ثلاثا وثلاثين ويسبح ثلاثا وثلاثين فذلك مائة باللسان وألف في الميزان ‏\"‏ ‏.‏ فلقد رأيت رسول الله صلى الله عليه وسلم يعقدها بيده قالوا يا رسول الله كيف هما يسير ومن يعمل بهما قليل قال ‏\"‏ يأتي أحدكم - يعني الشيطان - في منامه فينومه قبل أن يقوله ويأتيه في صلاته فيذكره حاجة قبل أن يقولها ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr:                     The Prophet (ﷺ) said: There are two qualities or characteristics which will not be returned by any Muslim without his entering Paradise. While they are easy, those who act upon them are few. One should say: \"Glory be to Allah\" ten times after every prayer, \"Praise be to Allah\" ten times and \"Allah is Most Great\" ten times. That is a hundred and fifty on the tongue, but one thousand and five hundred on the scale. When he goes to bed, he should say: \"Allah is Most Great\" thirty-four times, \"Praise be to Allah\" thirty-three times, and Glory be to Allah thirty-three times, for that is a hundred on the tongue and a thousand on the scale. (He said:) I saw the Messenger of Allah (ﷺ) counting them on his hand.  The people asked: Messenger of Allah! How is it that while they are easy, those who act upon them are few?  He replied: The Devil comes to one of you when he goes to bed and he makes him sleep, before he utters them, and he comes to him while he is engaged in prayer and calls a need to his mind before he utters them.",
      "usc_msa_ref": "",
      "chain": [
        "30329",
        "20020",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "id": "jami-al-tirmidhi-959",
      "hadith_no": "959",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا قتيبة، حدثنا جرير، عن عطاء بن السائب، عن ابن عبيد بن عمير، عن أبيه، أن ابن عمر، كان يزاحم على الركنين زحاما ما رأيت أحدا من أصحاب النبي صلى الله عليه وسلم يفعله ‏.‏ فقلت يا أبا عبد الرحمن إنك تزاحم على الركنين زحاما ما رأيت أحدا من أصحاب النبي صلى الله عليه وسلم يزاحم عليه ‏.‏ فقال إن أفعل فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن مسحهما كفارة للخطايا ‏\"‏ ‏.‏ وسمعته يقول ‏\"‏ من طاف بهذا البيت أسبوعا فأحصاه كان كعتق رقبة ‏\"‏ ‏.‏ وسمعته يقول ‏\"‏ لا يضع قدما ولا يرفع أخرى إلا حط الله عنه بها خطيئة وكتب له بها حسنة ‏\"‏ ‏.‏ قال أبو عيسى وروى حماد بن زيد عن عطاء بن السائب عن ابن عبيد بن عمير عن ابن عمر نحوه ‏.‏ ولم يذكر فيه عن أبيه ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Ibn Ubaid bin Umair narrated from his father:                     \"Ibn Umar was clinging on the two corners (in a manner that I had not seen any of the Companions of the Prophet doing) so I said: 'O Abu Abdur-Rahman! You are clinging on the two corners in a manner that I have not seen any of the Companions of the Prophet clining.' So he said: 'I do it because I heard the Messenger of Allah saying: \"Touching them atones for sins.\" And I heard him saying: \"Whoever performs Tawaf around this House seven times and he keeps track of it, then it is as if he freed a slave.\" And I heard him saying: \"One foot is not put down, nor another raised except that Allah removes a sin from him and records a good merit for him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20028",
        "11068",
        "19867",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1855",
      "hadith_no": "1855",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا هناد، حدثنا أبو الأحوص، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اعبدوا الرحمن وأطعموا الطعام وأفشوا السلام تدخلوا الجنة بسلام ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Amr:                     That the Messenger of Allah (ﷺ) said: \"(All of you) worship Ar-Rahman, feed others, spread the (greeting of) Salam, then you will enter Paradise in security.\"He said: This Hadith is Hasan Sahih.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20327",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2679",
      "hadith_no": "2679",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا هناد، حدثنا أبو الأحوص، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ خرج رجل ممن كان قبلكم في حلة له يختال فيها فأمر الله الأرض فأخذته فهو يتجلجل فيها أو قال يتلجلج فيها إلى يوم القيامة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏",
      "text_en": " 'Abdullah bin 'Amr narrated that the Messenger of Allah (s.a.w) said:                     \"A man among those before you went out arrogantly in a Hullah of his. So Allah ordered the earth to take him. He remains sinking[into it]\" - or he said - \"He will remain sinking into it until the Day of Judgement.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20327",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3410-2",
      "hadith_no": "3410",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا إسماعيل ابن علية، حدثنا عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، رضى الله عنهما قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خلتان لا يحصيهما رجل مسلم إلا دخل الجنة ألا وهما يسير ومن يعمل بهما قليل يسبح الله في دبر كل صلاة عشرا ويحمده عشرا ويكبره عشرا ‏\"‏ ‏.‏ قال فأنا رأيت رسول الله صلى الله عليه وسلم يعقدها بيده قال ‏\"‏ فتلك خمسون ومائة باللسان وألف وخمسمائة في الميزان وإذا أخذت مضجعك تسبحه وتكبره وتحمده مائة فتلك مائة باللسان وألف في الميزان فأيكم يعمل في اليوم والليلة ألفين وخمسمائة سيئة ‏\"‏ ‏.‏ قالوا وكيف لا يحصيها قال ‏\"‏ يأتي أحدكم الشيطان وهو في صلاته فيقول اذكر كذا اذكر كذا ‏.‏ حتى ينفتل فلعله أن لا يفعل ويأتيه وهو في مضجعه فلا يزال ينومه حتى ينام ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ وقد روى شعبة والثوري عن عطاء بن السائب هذا الحديث ‏.‏ وروى الأعمش هذا الحديث عن عطاء بن السائب مختصرا ‏.‏ وفي الباب عن زيد بن ثابت وأنس وابن عباس رضى الله عنهم ‏.‏",
      "text_en": " Abdullah bin `Amr [may Allah be pleased with both of them] said:                     “The Messenger of Allah said: ‘There are two characteristics over which a Muslim man does not guard, except that he enters Paradise. And indeed, they are easy, and those who act upon them are few: He glorifies Allah at the end of every prayer ten times (saying Subhan Allah) and praises Him ten times saying (Al-Hamdullilah) and extols His greatness ten times (saying Allahu Akbar).’”He said: “And I have seen the Messenger of Allah counting them with his hand. He said: ‘So this is one hundred and fifty with the tongue, and one thousand and five hundred on the Scale. When you go to bed, you glorify Him, extol His greatness, and praise Him a hundred times, so this is one hundred with the tongue and one thousand on the Scale. Which of you perform two thousand and five hundred evil deeds in a single day and night?’ They said: ‘How could we not guard over them?’ He said: ‘Shaitan comes to one of you when he is in his Salat and says: “Remember such and such, remember such and such” until he turns perhaps he will not do it. And he comes to him and he is lying down and makes him sleepy until he falls asleep.’”",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20208",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3411-2",
      "hadith_no": "3411",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني، حدثنا عثام بن علي، عن الأعمش، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، رضى الله عنهما قال رأيت رسول الله صلى الله عليه وسلم يعقد التسبيح ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث الأعمش ‏.‏",
      "text_en": " Abdullah bin Amr [may Allah be pleased with him] said:                     “I saw the Messenger of Allah counting At-Tasbih.”",
      "usc_msa_ref": "",
      "chain": [
        "20343",
        "11060",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3486-2",
      "hadith_no": "3486",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن عبد الأعلى، - بصري - حدثنا عثام بن علي، عن الأعمش، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، قال رأيت النبي صلى الله عليه وسلم يعقد التسبيح ‏.‏ وقال هذا حديث حسن غريب من هذا الوجه من حديث الأعمش عن عطاء بن السائب ‏.‏ وروى شعبة والثوري هذا الحديث عن عطاء بن السائب بطوله ‏.‏ وفي الباب عن يسيرة بنت ياسر عن النبي صلى الله عليه وسلم قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ يا معشر النساء اعقدن بالأنامل فإنهن مسئولات مستنطقات ‏\"‏ ‏.‏",
      "text_en": " Abdullah bin Amr narrated:                     “I saw the Prophet counting the Tasbih on his hand.”",
      "usc_msa_ref": "",
      "chain": [
        "20343",
        "11060",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "id": "sunan-an-nasai-1305",
      "hadith_no": "1305",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا حماد، قال حدثنا عطاء بن السائب، عن أبيه، قال صلى بنا عمار بن ياسر صلاة فأوجز فيها فقال له بعض القوم لقد خففت أو أوجزت الصلاة ‏.‏ فقال أما على ذلك فقد دعوت فيها بدعوات سمعتهن من رسول الله صلى الله عليه وسلم فلما قام تبعه رجل من القوم هو أبي غير أنه كنى عن نفسه فسأله عن الدعاء ثم جاء فأخبر به القوم ‏\"‏ اللهم بعلمك الغيب وقدرتك على الخلق أحيني ما علمت الحياة خيرا لي وتوفني إذا علمت الوفاة خيرا لي اللهم وأسألك خشيتك في الغيب والشهادة وأسألك كلمة الحق في الرضا والغضب وأسألك القصد في الفقر والغنى وأسألك نعيما لا ينفد وأسألك قرة عين لا تنقطع وأسألك الرضاء بعد القضاء وأسألك برد العيش بعد الموت وأسألك لذة النظر إلى وجهك والشوق إلى لقائك في غير ضراء مضرة ولا فتنة مضلة اللهم زينا بزينة الإيمان واجعلنا هداة مهتدين ‏\"‏ ‏.‏",
      "text_en": " Ata bn As-Sa'ib narrated that his father said:                     \"Ammar bin Yasir led us in prayer and he made it brief. Some of the people said to him: 'You made the prayer sort (or brief).' He said: 'Nevertheless I still recited supplications that I heard from the Messenger of Allah (ﷺ).' When he got up and left,  a man- he was my father but he did not name himself- followed him and asked him about that supplication, then he came and told the people. \"Allahumma bi 'ilmikal-ghaiba wa qudratika 'alal-khalqi ahini ma 'alimtal-hayata khairan li, wa tawaffani idha 'alimtal-wafata khairan li. Allahumma as'aluka khashyataka fil-ghaibi wash-shahadati wa as'aluka kalimatul-aqua fir-rida'i wal ghadab, wa as'alukal-qasda fil faqr wal-ghina, wa as'aluka na'iman la yanfadu wa as'aluka qurrata ainan la tanqati'u wa as'alukar-rida'i ba'dal-qada'i wa as'aluka bardal 'aishi ba'dal-mawti, wa as'aluka ladhatan-nazari ila wajhika wash-shawqa ila liqa'ika fi fitnatin mudillatin, Allahumma zayyina dizinatil-imani waj'alna hudatan muhtadin (O Alah, by Your knowledge of the unseen and Your power over creation, keep me alive so long as You know that living is good for me and cause me to die when You know that death is better for me. O Allah, cause me to fear You in secret and in public. I ask You to make me true in speech in times of pleasure and of anger. I ask You to make me moderate in times of wealth and poverty. And I ask You for everlasting delight and joy that will never cease. I ask You to make me pleased with that which You have decreed and for an easy life after death. I askYou for the sweetness of looking upon Your face and a longing to meet You in a manner that does not entail a calamity that will bring about harm or a trial that will cause deviation. O Allah, beautify us with the adornment of faith and make us among those who guide and are rightly guided.\"",
      "usc_msa_ref": "",
      "chain": [
        "30459",
        "20022",
        "11068",
        "19867"
      ]
    },
    {
      "id": "sunan-an-nasai-1348",
      "hadith_no": "1348",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا حماد، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خلتان لا يحصيهما رجل مسلم إلا دخل الجنة وهما يسير ومن يعمل بهما قليل ‏\"‏ ‏.‏ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الصلوات الخمس يسبح أحدكم في دبر كل صلاة عشرا ويحمد عشرا ويكبر عشرا فهي خمسون ومائة في اللسان وألف وخمسمائة في الميزان ‏\"‏ ‏.‏ وأنا رأيت رسول الله صلى الله عليه وسلم يعقدهن بيده ‏\"‏ وإذا أوى أحدكم إلى فراشه أو مضجعه سبح ثلاثا وثلاثين وحمد ثلاثا وثلاثين وكبر أربعا وثلاثين فهي مائة على اللسان وألف في الميزان ‏\"‏ ‏.‏ قال قال رسول الله صلى الله عليه وسلم ‏\"‏ فأيكم يعمل في كل يوم وليلة ألفين وخمسمائة سيئة ‏\"‏ ‏.‏ قيل يا رسول الله وكيف لا نحصيهما فقال ‏\"‏ إن الشيطان يأتي أحدكم وهو في صلاته فيقول اذكر كذا اذكر كذا ويأتيه عند منامه فينيمه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abdullah in 'Umar said:                     \"The Messenger of Allah (ﷺ) said: 'There are two qualities which no Muslim person attains but he will enter Paradise, and they are easy, but those who do them are few.' The Messenger of Allah (ﷺ) said: 'The five daily prayers: After each prayer one of you glorifies Allah (SWT) ten times and praises Him ten times and magnifies him ten times, which makes one hundred and fifty on the tongue and one thousand five hundred in the balance.' And I saw the Messenger of Allah (ﷺ) counting them on his hands. 'And when one of you retires to his bed he says the tasbih thirty-three times and the tahmid thirty-three times and the takbir thirty-four times, that is one hundred on the tongue and one thousand in the balance.' The Messenger of Allah (ﷺ) said: \"So which of you does two thousand five hundred bad deeds in a day and a night?\" It was said: \"O Messenger of Allah (ﷺ), how can a person not persist in doing that?\" He said: \"The Shaitan comes to one of you when he is praying and says: 'Remember such and such, remember such and such,\" or he comes to him when he is in bed and makes him fall asleep.\"",
      "usc_msa_ref": "",
      "chain": [
        "30459",
        "20022",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "id": "sunan-an-nasai-1355",
      "hadith_no": "1355",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن عبد الأعلى الصنعاني، والحسين بن محمد الذارع، - واللفظ له - قالا حدثنا عثام بن علي، قال حدثنا الأعمش، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، قال رأيت رسول الله صلى الله عليه وسلم يعقد التسبيح ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     \"I saw the Messenger of Allah (ﷺ) counting tasbih on his fingers.\"",
      "usc_msa_ref": "",
      "chain": [
        "20343",
        "11060",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "id": "sunan-an-nasai-1496",
      "hadith_no": "1496",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرنا عبد الله بن محمد بن عبد الرحمن بن المسور الزهري، قال حدثنا غندر، عن شعبة، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، قال كسفت الشمس على عهد رسول الله صلى الله عليه وسلم فصلى رسول الله صلى الله عليه وسلم فأطال القيام ثم ركع فأطال الركوع ثم رفع فأطال - قال شعبة وأحسبه قال في السجود نحو ذلك - وجعل يبكي في سجوده وينفخ ويقول ‏\"‏ رب لم تعدني هذا وأنا أستغفرك لم تعدني هذا وأنا فيهم ‏\"‏ ‏.‏ فلما صلى قال ‏\"‏ عرضت على الجنة حتى لو مددت يدي تناولت من قطوفها وعرضت على النار فجعلت أنفخ خشية أن يغشاكم حرها ورأيت فيها سارق بدنتى رسول الله صلى الله عليه وسلم ورأيت فيها أخا بني دعدع سارق الحجيج فإذا فطن له قال هذا عمل المحجن ورأيت فيها امرأة طويلة سوداء تعذب في هرة ربطتها فلم تطعمها ولم تسقها ولم تدعها تأكل من خشاش الأرض حتى ماتت وإن الشمس والقمر لا ينكسفان لموت أحد ولا لحياته ولكنهما آيتان من آيات الله فإذا انكسفت إحداهما - أو قال فعل أحدهما شيئا من ذلك - فاسعوا إلى ذكر الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abdullah bin Amr said:                     \"The sun eclipsed during the time of the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) prayed and stood for a long time, then he bowed for a long time, then he stood up and (remained standing) for a long time.\" (One of the narrators) Shu'bh said: \"I think he said something similar concerning prostration.\"- \"He started weeping and blowing during his prostration and said: 'Lord, You did not tell me that You would do that while I am asking You for forgiveness; You did not tell me that You would do that while I was still among them.' When he finished praying he said: \"Paradise was shown to me, and if I had stretched forth my hand I could have taken some of its fruits. And Hell was shown to me, so I started blowing for fear that its heat might overwhelm you. I saw therein the thief who stole the two camels of the Messenger of Allah (ﷺ); and I saw therein the brother of Banu As-Du'du; the thief who stole from the pilgrims, and when he was caught he said: The crooked stick did it; and I saw therein a tall black woman who was being punished because of a cat she tied up and did not feed or give it water, and she did not let it eat of the vermin of the earth, until it died. Then sun and the moon do not become eclipsed for the death or birth of anyone, but they are two of the signs of Allah. If one of them becomes eclipsed'- or he said: 'if one of them does anything like that'- 'then hasten to remember Allah, the Mighty and Sublime.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20278",
        "20020",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "id": "sunan-an-nasai-3384",
      "hadith_no": "3384",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا نصير بن الفرج، قال حدثنا أبو أسامة، عن زائدة، قال حدثنا عطاء بن السائب، عن أبيه، عن علي، رضى الله عنه قال جهز رسول الله صلى الله عليه وسلم فاطمة في خميل وقربة ووسادة حشوها إذخر ‏.‏",
      "text_en": " It was narrated that 'Ali, may Allah be pleased with him, said:                      \"The Messenger of Allah fitted out Fatimah with a velvet dress, a water-skin and a pillow stuffed with Idhkhar.\"",
      "usc_msa_ref": "",
      "chain": [
        "38667",
        "20318",
        "20320",
        "11068",
        "19867",
        "5"
      ]
    },
    {
      "id": "sunan-an-nasai-4163",
      "hadith_no": "4163",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، قال حدثنا حماد بن زيد، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، أن رجلا، أتى النبي صلى الله عليه وسلم فقال إني جئت أبايعك على الهجرة ولقد تركت أبوى يبكيان ‏.‏ قال ‏\"‏ ارجع إليهما فأضحكهما كما أبكيتهما ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Amr that a man came to the Prophet and said:                     \"I have come pledging to emigrate (Hijrah), and I have left my parents weeping.\" He said: \"Go back to them, and make them smile as you made them weep.\"",
      "usc_msa_ref": "",
      "chain": [
        "30459",
        "20022",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "id": "sunan-ibn-majah-979",
      "hadith_no": "979",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو كريب، حدثنا إسماعيل ابن علية، ومحمد بن فضيل، وأبو يحيى التيمي وابن الأجلح عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ خصلتان لا يحصيهما رجل مسلم إلا دخل الجنة وهما يسير ومن يعمل بهما قليل يسبح الله في دبر كل صلاة عشرا ويكبر عشرا ويحمده عشرا ‏\"‏ ‏.‏ فرأيت رسول الله  صلى الله عليه وسلم  يعقدها بيده ‏\"‏ فذلك خمسون ومائة باللسان وألف وخمسمائة في الميزان وإذا أوى إلى فراشه سبح وحمد وكبر مائة فتلك مائة باللسان وألف في الميزان فأيكم يعمل في اليوم ألفين وخمسمائة سيئة ‏\"‏ ‏.‏ قالوا وكيف لا يحصيهما قال ‏\"‏ يأتي أحدكم الشيطان وهو في الصلاة فيقول اذكر كذا وكذا حتى ينفك العبد لا يعقل ويأتيه وهو في مضجعه فلا يزال ينومه حتى ينام ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin ‘Amr said:                      “The Messenger of Allah(ﷺ) said: ‘There are two characteristics which no Muslim manacquires but he will enter Paradise. They are easy but those who dothem are few. At the end of every prayer he should glorify Allah (bysaying Subhan Allah) ten times, extol Him (by saying Allahu Akbar)tentimes, and praise Him (by saying Al-Hamdu Lillah) ten times.’ Isawthe Messenger of Allah (ﷺ) counting them on his hand. ‘Thatis onehundred and fifty (after all the prayers of the day) on thetongue,and one thousand and five hundred on the Scale. And when hegoes tohis bed, let him glorify Allah and praise Him and extol Himonehundred times. That will be one hundred on the tongue and onethousandon the Scale. Who among you does two thousand and fivehundred evilactions in one day?’ They said: ‘Who would not bekeen to do that?’ Hesaid: ‘But the Shaitan comes to anyone ofyou while he is performingprayer and says: ‘Remember such andsuch, remember such and such,”until the person becomes distractedand does not understand (what heis saying). And he comes to him whenhe is in his bed, and makes himsleepy such that he sleeps.’”",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20208",
        "20356",
        "12327",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "id": "sunan-ibn-majah-2888",
      "hadith_no": "2888",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا المحاربي، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، قال أتى رجل رسول الله صلى الله عليه وسلم فقال يا رسول الله إني جئت أريد الجهاد معك أبتغي وجه الله والدار الآخرة ولقد أتيت وإن والدى ليبكيان ‏.‏ قال ‏\"‏ فارجع إليهما فأضحكهما كما أبكيتهما ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin ‘Amr said:                      “A man came to theMessenger of Allah (ﷺ) and said: ‘O Messenger of Allah, I havecomeseeking to go out in Jihad with you, seeking thereby the Face ofAllahand the Hereafter. I have come even though my parents areweeping.’ Hesaid: ‘Go back to them and make them smile as youhave made themweep.’”",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20333",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "id": "sunan-ibn-majah-3694-2",
      "hadith_no": "3694",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن فضيل، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ اعبدوا الرحمن وأفشوا السلام ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abdullah bin 'Amr that the Messenger of Allah(ﷺ) said:                     \"Worship the Most Merciful and spread (the greeting of) peace.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20356",
        "11068",
        "19867",
        "29"
      ]
    }
  ],
  "total_hadiths": 21
}