{
  "id": "1986",
  "name": "Rafi' bin Khadij bin Rafi' ( رافع بن خديج بن رافع الأنصاري ( رضي الله عنه",
  "full_name": "Rafi' bin Khadij bin Rafi' ( رافع بن خديج بن رافع الأنصاري ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "73",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]"
    ],
    "tags": [
      "Ansar",
      "Aws",
      "B.Haritha",
      "Uhud",
      "Khandaq",
      "Ridwan"
    ]
  },
  "parents": [
    {
      "id": "1985",
      "name": "Khadij bin Rafi' ( خديج بن رافع بن عدي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1571",
      "name": "Halima/Jamila bint 'Urwa bin Mas'ud ( حليمة/ جميلة بنت عروة ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "1960",
      "name": "Umama bint Khadij bin Rafi' ( أمامة بنت خديج الأنصارية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "12821",
      "name": "'Abdur Rahman bin Rafa'y bin Khdyj عبد الرحمن بن رافع بن خديج الأنصار",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "12670",
      "name": "Ibrahim bin Rafi' bin Khadayj إبراهيم بن رافع بن خديج الأنصاري",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11506",
      "name": "Rfa'h bin Rafa'i bin Khdyj رفاعة بن رافع بن خديج",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12842",
      "name": "'Abdul Hameed bin Rafa'y bin Khdyj عبد الحميد بن رافع بن خديج الأنصار",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "12818",
      "name": "'Ubaidullah bin Rafa'y bin Khdyj عبيد الله بن رافع بن خديج",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "12907",
      "name": "Muhammad bin Rafa'y bin Khdyj محمد بن رافع بن خديج الأنصاري",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "12795",
      "name": "'Abdullah bin Rafi'a bin Khadayj عبد الله بن رافع بن خديج الأنصاري",
      "grade": "Follower(Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1985",
      "name": "Khadij bin Rafi' ( خديج بن رافع بن عدي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1987",
      "name": "Zuhayr bin Rafi' ( ظهير بن رافع ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "12821",
      "name": "'Abdur Rahman bin Rafa'y bin Khdyj عبد الرحمن بن رافع بن خديج الأنصار",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11506",
      "name": "Rfa'h bin Rafa'i bin Khdyj رفاعة بن رافع بن خديج",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12555",
      "name": "Hryr bin 'Abdur Rahman bin Rafa'i هرير بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11527",
      "name": "Ata'a bin S'hyb al-Ansari عطاء بن صهيب الأنصاري أبو النجاشي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "3048",
      "name": "al-Sa'ib bin Yazid bin Akht Namr ( السائب بن يزيد بن أخت النمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11005",
      "name": "Sulayman ibn Yasar سليمان بن يسار مولى ميمونة بنت الحارث",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11503",
      "name": "Hnzlh bin Qays bin 'Amr حنظلة بن قيس بن عمرو",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11059",
      "name": "Nafi' bin Jubayr bin Mut'im نافع بن جبير بن مطعم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11222",
      "name": "Muhammad bin Yahya bin Hiban محمد بن يحيى بن حبان",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10933",
      "name": "'Abdullah bin 'Amr bin 'Uthman عبد الله بن عمرو بن عثمان المطرف",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "559",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن مهران، قال حدثنا الوليد، قال حدثنا الأوزاعي، قال حدثنا أبو النجاشي، صهيب مولى رافع بن خديج قال سمعت رافع بن خديج، يقول كنا نصلي المغرب مع النبي صلى الله عليه وسلم فينصرف أحدنا وإنه ليبصر مواقع نبله‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     We used to offer the Maghrib prayer with the Prophet and after finishing the prayer one of us may go away and could still see as Par as the spots where one's arrow might reach when shot by a bow.",
      "chain": [
        "30383",
        "20733",
        "20024",
        "1986"
      ]
    },
    {
      "hadith_no": "2327",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد، أخبرنا عبد الله، أخبرنا يحيى بن سعيد، عن حنظلة بن قيس الأنصاري، سمع رافع بن خديج، قال كنا أكثر أهل المدينة مزدرعا، كنا نكري الأرض بالناحية منها مسمى لسيد الأرض، قال فمما يصاب ذلك وتسلم الأرض، ومما يصاب الأرض ويسلم ذلك، فنهينا، وأما الذهب والورق فلم يكن يومئذ‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     We worked on farms more than anybody else in Medina. We used to rent the land at the yield of specific delimited portion of it to be given to the landlord. Sometimes the vegetation of that portion was affected by blights etc., while the rest remained safe and vice versa, so the Prophet forbade this practice. At that time gold or silver were not used (for renting the land). If they provided the seeds, they would get so-and-so much.",
      "chain": [
        "30213",
        "20025",
        "11062",
        "11503",
        "1986"
      ]
    },
    {
      "hadith_no": "2339",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا الأوزاعي، عن أبي النجاشي، مولى رافع بن خديج سمعت رافع بن خديج بن رافع، عن عمه، ظهير بن رافع قال ظهير لقد نهانا رسول الله صلى الله عليه وسلم عن أمر كان بنا رافقا‏.‏ قلت ما قال رسول الله صلى الله عليه وسلم فهو حق‏.‏ قال دعاني رسول الله صلى الله عليه وسلم قال ‏\"‏ ما تصنعون بمحاقلكم ‏\"‏‏.‏ قلت نؤاجرها على الربع وعلى الأوسق من التمر والشعير‏.‏ قال ‏\"‏ لا تفعلوا ازرعوها أو أزرعوها أو أمسكوها ‏\"‏‏.‏ قال رافع قلت سمعا وطاعة‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     My uncle Zuhair said, \"Allah's Apostle forbade us to do a thing which was a source of help to us.\" I said, \"Whatever Allah's Apostle said was right.\" He said, \"Allah's Apostle sent for me and asked, 'What are you doing with your farms?' I replied, 'We give our farms on rent on the basis that we get the yield produced at the banks of the water streams (rivers) for the rent, or rent it for some Wasqs of barley and dates.' Allah's Apostle said, 'Do not do so, but cultivate (the land) yourselves or let it be cultivated by others gratis, or keep it uncultivated.' I said, 'We hear and obey.'",
      "chain": [
        "30118",
        "20025",
        "20024",
        "1986"
      ]
    },
    {
      "hadith_no": "2347",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا عمرو بن خالد، حدثنا الليث، عن ربيعة بن أبي عبد الرحمن، عن حنظلة بن قيس، عن رافع بن خديج، قال حدثني عماى، أنهم كانوا يكرون الأرض على عهد النبي صلى الله عليه وسلم بما ينبت على الأربعاء أو شىء يستثنيه صاحب الأرض فنهى النبي صلى الله عليه وسلم عن ذلك فقلت لرافع فكيف هي بالدينار والدرهم فقال رافع ليس بها بأس بالدينار والدرهم‏.‏ وقال الليث وكان الذي نهي عن ذلك ما لو نظر فيه ذوو الفهم بالحلال والحرام لم يجيزوه، لما فيه من المخاطرة‏.‏",
      "text_en": " Narrated Hanzla bin Qais:                     Rafi` bin Khadij said, \"My two uncles told me that they (i.e. the companions of the Prophet) used to rent the land in the lifetime of the Prophet for the yield on the banks of water streams (rivers) or for a portion of the yield stipulated by the owner of the land. The Prophet forbade it.\" I said to Rafi`, \"What about renting the land for Dinars and Dirhams?\" He replied, \"There is no harm in renting for Dinars- Dirhams. Al-Laith said, \"If those who have discernment for distinguishing what is legal from what is illegal looked into what has been forbidden concerning this matter they would not permit it, for it is surrounded with dangers.\"",
      "chain": [
        "30237",
        "20023",
        "11162",
        "11503",
        "1986"
      ]
    },
    {
      "hadith_no": "2383",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا زكرياء بن يحيى، أخبرنا أبو أسامة، قال أخبرني الوليد بن كثير، قال أخبرني بشير بن يسار، مولى بني حارثة أن رافع بن خديج، وسهل بن أبي حثمة، حدثاه أن رسول الله صلى الله عليه وسلم نهى عن المزابنة بيع الثمر بالتمر، إلا أصحاب العرايا فإنه أذن لهم‏.‏ قال أبو عبد الله وقال ابن إسحاق حدثني بشير مثله‏.‏",
      "text_en": " Narrated Rafi` 'bin Khadij and Sahl bin Abi Hathma:                     Allah's Apostle forbade the sale of Muzabana, i.e. selling of fruits for fruits, except in the case of 'Araya; he allowed the owners of 'Araya such kind of sale.",
      "chain": [
        "30193",
        "20318",
        "11230",
        "11810",
        "1986",
        "1822"
      ]
    },
    {
      "hadith_no": "2485",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا الأوزاعي، حدثنا أبو النجاشي، قال سمعت رافع بن خديج  رضى الله عنه  قال كنا نصلي مع النبي صلى الله عليه وسلم العصر فننحر جزورا، فتقسم عشر قسم، فنأكل لحما نضيجا قبل أن تغرب الشمس‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     We used to offer the `Asr prayer with the Prophet and slaughter a camel, the meat of which would be divided in ten parts. We would eat the cooked meat before sunset.",
      "chain": [
        "30388",
        "20024",
        "1986"
      ]
    },
    {
      "hadith_no": "2507",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد، أخبرنا وكيع، عن سفيان، عن أبيه، عن عباية بن رفاعة، عن جده، رافع بن خديج  رضى الله عنه  قال كنا مع النبي صلى الله عليه وسلم بذي الحليفة من تهامة، فأصبنا غنما وإبلا، فعجل القوم، فأغلوا بها القدور، فجاء رسول الله صلى الله عليه وسلم فأمر بها فأكفئت، ثم عدل عشرا من الغنم بجزور، ثم إن بعيرا ند وليس في القوم إلا خيل يسيرة فرماه رجل فحبسه بسهم، فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن لهذه البهائم أوابد كأوابد الوحش، فما غلبكم منها فاصنعوا به هكذا ‏\"‏‏.‏ قال قال جدي يا رسول الله إنا نرجو  أو نخاف  أن نلقى العدو غدا وليس معنا مدى، فنذبح بالقصب فقال ‏\"‏ اعجل أو أرني، ما أنهر الدم وذكر اسم الله عليه فكلوا، ليس السن والظفر، وسأحدثكم عن ذلك، أما السن فعظم، وأما الظفر فمدى الحبشة ‏\"‏‏.‏",
      "text_en": " Narrated Abaya bin Rifaa:                     My grandfather, Rafi` bin Khadij said, \"We were in the valley of Dhul-Hulaifa of Tuhama in the company of the Prophet and had some camels and sheep (of the booty). The people hurried (in slaughtering the animals) and put their meat in the pots and started cooking. Allah's Apostle came and ordered them to upset the pots, and distributed the booty considering one camel as equal to ten sheep. One of the camels fled and the people had only a few horses, so they got worried. (The camel was chased and) a man slopped the camel by throwing an arrow at it. Allah's Apostle said, 'Some of these animals are untamed like wild animals, so if anyone of them went out of your control, then you should treat it as you have done now.' \" My grandfather said, \"O Allah's Apostle! We fear that we may meet our enemy tomorrow and we have no knives, could we slaughter the animals with reeds?\" The Prophet said, \"Yes, or you can use what would make blood flow (slaughter) and you can eat what is slaughtered and the Name of Allah is mentioned at the time of slaughtering. But don't use teeth or fingernails (in slaughtering). I will tell you why, as for teeth, they are bones, and fingernails are used by Ethiopians for slaughtering. (See Hadith 668)",
      "chain": [
        "30213",
        "20032",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "2722",
      "source": " Sahih Bukhari ",
      "chapter": "Conditions - كتاب الشروط",
      "chapter_no": "54",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا ابن عيينة، حدثنا يحيى بن سعيد، قال سمعت حنظلة الزرقي، قال سمعت رافع بن خديج  رضى الله عنه  يقول كنا أكثر الأنصار حقلا، فكنا نكري الأرض، فربما أخرجت هذه ولم تخرج ذه، فنهينا عن ذلك، ولم ننه عن الورق‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     We used to work on the fields more than the other Ansar, and we used to rent the land (for the yield of a specific portion of it). But sometimes that portion or the rest of the land did not give any yield, so we were forbidden (by the Prophet ) to follow such a system, but we were allowed to rent the land for money.",
      "chain": [
        "20357",
        "20005",
        "11062",
        "1986"
      ]
    },
    {
      "hadith_no": "3262",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثني عمرو بن عباس، حدثنا عبد الرحمن، حدثنا سفيان، عن أبيه، عن عباية بن رفاعة، قال أخبرني رافع بن خديج، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ الحمى من فور جهنم، فأبردوها عنكم بالماء ‏\"‏‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     I heard the Prophet saying, \"Fever is from the heat of the (Hell) Fire; so cool it with water.\"",
      "chain": [
        "30152",
        "20033",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "4062",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء، حدثنا جويرية، عن مالك، عن الزهري، أن سالم بن عبد الله، أخبره قال أخبر رافع بن خديج عبد الله بن عمر، أن عميه، وكانا، شهدا بدرا أخبراه أن رسول الله صلى الله عليه وسلم نهى عن كراء المزارع‏.‏ قلت لسالم فتكريها أنت قال نعم، إن رافعا أكثر على نفسه‏.‏",
      "text_en": " Narrated Az-Zuhri:                     Salim bin `Abdullah told me that Rafi` bin Khadij told `Abdullah bin `Umar that his two paternal uncles who had fought in the battle of Badr informed him that Allah's Apostle forbade the renting of fields. I said to Salim, \"Do you rent your land?\" He said, \"Yes, for Rafi` is mistaken.\"",
      "chain": [
        "30144",
        "20216",
        "20001",
        "11013",
        "11011",
        "1986"
      ]
    },
    {
      "hadith_no": "5556",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثني موسى بن إسماعيل، حدثنا أبو عوانة، عن سعيد بن مسروق، عن عباية بن رفاعة بن رافع، عن جده، رافع بن خديج قال كنا مع النبي صلى الله عليه وسلم بذي الحليفة، فأصاب الناس جوع، فأصبنا إبلا وغنما، وكان النبي صلى الله عليه وسلم في أخريات الناس، فعجلوا فنصبوا القدور، فدفع إليهم النبي صلى الله عليه وسلم فأمر بالقدور فأكفئت، ثم قسم فعدل عشرة من الغنم ببعير، فند منها بعير، وكان في القوم خيل يسيرة فطلبوه فأعياهم، فأهوى إليه رجل بسهم فحبسه الله فقال النبي صلى الله عليه وسلم ‏\"‏ إن لهذه البهائم أوابد كأوابد الوحش، فما ند عليكم فاصنعوا به هكذا ‏\"‏‏.‏ قال وقال جدي إنا لنرجو  أو نخاف  أن نلقى العدو غدا، وليس معنا مدى، أفنذبح بالقصب فقال ‏\"‏ ما أنهر الدم وذكر اسم الله عليه فكل، ليس السن والظفر، وسأخبركم عنه، أما السن عظم وأما الظفر فمدى الحبشة ‏\"‏‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     We were with the Prophet in Dhul-Hulaifa and there the people were struck with severe hunger. Then we got camels and sheep as war booty (and slaughtered them). The Prophet was behind all the people. The people hurried and fixed the cooking pots (for cooking) but the Prophet came there and ordered that the cooking pots be turned upside down. Then he distributed the animals, regarding ten sheep as equal to one camel. One of the camels ran away and there were a few horses with the people. They chased the camel but they got tired, whereupon a man shot it with an arrow whereby Allah stopped it. The Prophet said, \"Among these animals some are as wild as wild beasts, so if one of them runs away from you, treat it in this way.\" I said. \"We hope, or we are afraid that tomorrow we will meet the enemy and we have no knives, shall we slaughter (our animals) with canes?\" The Prophet said, \"If the killing tool causes blood to gush out and if Allah's Name is mentioned, eat (of the slaughterer animal). But do not slaughter with a tooth or a nail. I am telling you why: A tooth is a bone, and the nail is the knife of Ethiopians.\"",
      "chain": [
        "20040",
        "20469",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "5564",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن أبيه، عن عباية بن رفاعة، عن رافع بن خديج، قال قال النبي صلى الله عليه وسلم ‏\"‏ كل  يعني  ما أنهر الدم إلا السن والظفر ‏\"‏‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     The Prophet said, \"Eat what is slaughtered (with any instrument) that makes blood flow out, except what is slaughtered with a tooth or a nail.'",
      "chain": [
        "20351",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "5567",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا عمرو بن علي، حدثنا يحيى، حدثنا سفيان، حدثنا أبي، عن عباية بن رفاعة بن رافع بن خديج، عن رافع بن خديج، قال قلت يا رسول الله إنا لاقو العدو غدا، وليست معنا مدى فقال ‏\"‏ اعجل أو أرن ما أنهر الدم وذكر اسم الله فكل، ليس السن والظفر، وسأحدثك، أما السن فعظم، وأما الظفر فمدى الحبشة ‏\"‏‏.‏ وأصبنا نهب إبل وغنم فند منها بعير، فرماه رجل بسهم فحبسه فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن لهذه الإبل أوابد كأوابد الوحش، فإذا غلبكم منها شىء، فافعلوا به هكذا ‏\"‏‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     I said, \"O Allah's Apostle! We are going to face the enemy tomorrow and we do not have knives.\" He said, \"Hurry up (in killing the animal). If the killing tool causes blood to flow out, and if Allah's Name is mentioned, eat (of the slaughtered animal). But do not slaughter with a tooth or a nail. I will tell you why: As for the tooth, it is a bone; and as for the nail, it is the knife of Ethiopians.\" Then we got some camels and sheep as war booty, and one of those camels ran away, whereupon a man shot it with an arrow and stopped it. Allah's Apostle said, \"Of these camels there are some which are as wild as wild beasts, so if one of them (runs away and) makes you tired, treat it in this manner.\"",
      "chain": [
        "30153",
        "20031",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "5601",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا سعيد بن مسروق، عن عباية بن رفاعة، عن أبيه، عن جده، رافع بن خديج قال قلت للنبي صلى الله عليه وسلم إننا نلقى العدو غدا، وليس معنا مدى‏.‏ فقال ‏\"‏ ما أنهر الدم وذكر اسم الله فكلوا، ما لم يكن سن ولا ظفر، وسأحدثكم عن ذلك، أما السن فعظم، وأما الظفر فمدى الحبشة ‏\"‏‏.‏ وتقدم سرعان الناس فأصابوا من الغنائم والنبي صلى الله عليه وسلم في آخر الناس فنصبوا قدورا فأمر بها فأكفئت وقسم بينهم وعدل بعيرا بعشر شياه، ثم ند بعير من أوائل القوم ولم يكن معهم خيل فرماه رجل بسهم فحبسه الله‏.‏ فقال ‏\"‏ إن لهذه البهائم أوابد كأوابد الوحش فما فعل منها هذا فافعلوا مثل هذا ‏\"‏‏.‏",
      "text_en": " Narrated Rait' bin Khadij:                     I said to the Prophet, \"We will be facing the enemy tomorrow and we have no knives (for slaughtering)' He said, \"If you slaughter the animal with anything that causes its blood to flow out, and if Allah's Name is mentioned on slaughtering it, eat of it, unless the killing instrument is a tooth or nail. I will tell you why: As for the tooth, it is a bone; and as for the nail, it is the knife of Ethiopians.\" The quick ones among the people got the war booty while the Prophet was behind the people. So they placed the cooking pots on the fire, but the Prophet ordered the cooking pots to be turned upside down. Then he distributed (the war booty) among them, considering one camel as equal to ten sheep. Then a camel belonging to the first party of people ran away and they had no horses with them, so a man shot it with an arrow whereby Allah stopped it. The Prophet said, \"Of these animals there are some which are as wild as wild beasts. So, if anyone of them runs away like this, do like this (shoot it with an arrow).",
      "chain": [
        "30175",
        "20327",
        "20016",
        "11179",
        "11506",
        "1986"
      ]
    },
    {
      "hadith_no": "5602",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا ابن سلام، أخبرنا عمر بن عبيد الطنافسي، عن سعيد بن مسروق، عن عباية بن رفاعة، عن جده، رافع بن خديج  رضى الله عنه  قال كنا مع النبي صلى الله عليه وسلم في سفر فند بعير من الإبل  قال  فرماه رجل بسهم فحبسه، قال ثم قال ‏\"‏ إن لها أوابد كأوابد الوحش فما غلبكم منها فاصنعوا به هكذا ‏\"‏‏.‏ قال قلت يا رسول الله إنا نكون في المغازي والأسفار فنريد أن نذبح فلا تكون مدى قال ‏\"‏ أرن ما نهر  أو أنهر  الدم وذكر اسم الله فكل، غير السن والظفر، فإن السن عظم، والظفر مدى الحبشة ‏\"‏‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     While we were with the Prophet. on a journey, one of the camels ran away. A man shot it with an arrow and stopped it. The Prophet said, \"Of these camels some are as wild as wild beasts, so if one of them runs away and you cannot catch it, then do like this (shoot it with an arrow).\" I said, \"O Allah's Apostle! Sometimes when we are in battles or on a journey we want to slaughter (animals) but we have no knives.\" He said, \"Listen! If you slaughter the animal with anything that causes its blood to flow out, and if Allah's Name is mentioned on slaughtering it, eat of it, provided that the slaughtering instrument is not a tooth or a nail, as the tooth is a bone and the nail is the knife of Ethiopians.\"",
      "chain": [
        "30376",
        "20346",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "5785",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا سعيد بن مسروق، عن عباية بن رفاعة، عن جده، رافع بن خديج قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ الحمى من فوح جهنم، فابردوها بالماء ‏\"‏‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     I heard Allah's Apostle saying, \"Fever is from the heat of Hell, so abate fever with water.\"",
      "chain": [
        "30175",
        "20327",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "6212",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، هو ابن زيد  عن يحيى بن سعيد، عن بشير بن يسار، مولى الأنصار عن رافع بن خديج، وسهل بن أبي حثمة، أنهما حدثاه أن عبد الله بن سهل ومحيصة بن مسعود أتيا خيبر فتفرقا في النخل، فقتل عبد الله بن سهل، فجاء عبد الرحمن بن سهل وحويصة ومحيصة ابنا مسعود إلى النبي صلى الله عليه وسلم فتكلموا في أمر صاحبهم فبدأ عبد الرحمن، وكان أصغر القوم فقال النبي صلى الله عليه وسلم ‏\"‏ كبر الكبر ‏\"‏‏.‏  قال يحيى ليلي الكلام الأكبر  فتكلموا في أمر صاحبهم فقال النبي صلى الله عليه وسلم ‏\"‏ أتستحقون قتيلكم  أو قال صاحبكم  بأيمان خمسين منكم ‏\"‏‏.‏ قالوا يا رسول الله أمر لم نره‏.‏ قال ‏\"‏ فتبرئكم يهود في أيمان خمسين منهم ‏\"‏‏.‏ قالوا يا رسول الله قوم كفار‏.‏ فوداهم رسول الله صلى الله عليه وسلم من قبله‏.‏ قال سهل فأدركت ناقة من تلك الإبل، فدخلت مربدا لهم فركضتني برجلها‏.‏",
      "text_en": " Narrated Rafi` bin Khadij and Sahl bin Abu Hathma:                     `Abdullah bin Sahl and Muhaiyisa bin Mas`ud went to Khaibar and they dispersed in the gardens of the date-palm trees. `Abdullah bin Sahl was murdered. Then `Abdur-Rahman bin Sahl, Huwaiyisa and Muhaiyisa, the two sons of Mas`ud, came to the Prophet and spoke about the case of their (murdered) friend. `Abdur-Rahman who was the youngest of them all, started talking. The Prophet said, \"Let the older (among you) speak first.\" So they spoke about the case of their (murdered) friend. The Prophet said, \"Will fifty of you take an oath whereby you will have the right to receive the blood money of your murdered man,\" (or said, \"..your companion\"). They said, \"O Allah's Apostle! The murder was a thing we did not witness.\" The Prophet said, \"Then the Jews will release you from the oath, if fifty of them (the Jews) should take an oath to contradict your claim.\" They said, \"O Allah's Apostle! They are disbelievers (and they will take a false oath).\" Then Allah's Apostle himself paid the blood money to them.",
      "chain": [
        "20193",
        "20022",
        "20031",
        "11810",
        "1986"
      ]
    },
    {
      "hadith_no": "1446",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن مهران الرازي، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، عن أبي النجاشي، قال سمعت رافع بن خديج، يقول كنا نصلي العصر مع رسول الله صلى الله عليه وسلم ثم تنحر الجزور فتقسم عشر قسم ثم تطبخ فنأكل لحما نضيجا قبل مغيب الشمس ‏.‏",
      "text_en": " Rafi' b. Khadij reported:                      We used to say the afternoon prayer with the Messenger of Allah (may peace be upon him), and then the camel was slaughtered and ten parts of it were distributed; then it was cooked and then we ate this cooked meat before the sinking of the sun.",
      "chain": [
        "30383",
        "20733",
        "20024",
        "1986"
      ]
    },
    {
      "hadith_no": "1473",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا محمد بن مهران الرازي، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، حدثني أبو النجاشي، قال سمعت رافع بن خديج، يقول كنا نصلي المغرب مع رسول الله صلى الله عليه وسلم فينصرف أحدنا وإنه ليبصر مواقع نبله ‏.‏",
      "text_en": " Rafi' b. Khadij reported:                      We used to observe the evening prayer with the Messenger of Allah (may peace be upon him) and then one of us would go away and he could see the (distant) place where his arrow would fall.",
      "chain": [
        "30383",
        "20733",
        "20024",
        "1986"
      ]
    },
    {
      "hadith_no": "1474",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا شعيب بن إسحاق الدمشقي، حدثنا الأوزاعي، حدثني أبو النجاشي، حدثني رافع بن خديج، قال كنا نصلي المغرب ‏.‏ بنحوه ‏.‏",
      "text_en": " A hadith like this, i. e.\" We used to observe evening prayer....\" so on and so forth, has been narrated by Rafi' b. Khadij by another chain of transmitters.",
      "chain": [
        "30021",
        "20239",
        "20024",
        "1986"
      ]
    },
    {
      "hadith_no": "2490",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن أبي عمر المكي، حدثنا سفيان، عن عمر بن سعيد بن مسروق، عن أبيه، عن عباية بن رفاعة، عن رافع بن خديج، قال أعطى رسول الله صلى الله عليه وسلم أبا سفيان بن حرب وصفوان بن أمية وعيينة بن حصن والأقرع بن حابس كل إنسان منهم مائة من الإبل وأعطى عباس بن مرداس دون ذلك ‏.‏ فقال عباس بن مرداس أتجعل نهبي ونهب العبيد بين عيينة والأقرع فما كان بدر ولا حابس يفوقان مرداس في المجمع وما كنت دون امرئ منهما ومن تخفض اليوم لا يرفع قال فأتم له رسول الله صلى الله عليه وسلم مائة ‏.‏",
      "text_en": " Rafi' b. Khadij reported that the Messenger of Allah; (may peace be upon him) gave to Abu Sufyan b. Harb and Saf wan. b. Umayya and 'Uyaina b. Hisn and Aqra' b. Habis, i. e. to every one of these persons, one hundred of camels, and gave to 'Abbas b. Mirdas less than this number. Upon this 'Abbas b. Mirdis said:                      You allot the share of my booty and that of my horse between 'Uyaina and Aqra'. Both Uyaina and Aqra' are in no way more eminent than Mirdas (my father) in the assembly. I am in no way inferior to any one of these persons. And he who is let downtoday would not be elevated. He (the narrator) said: The Messenger of Allah (may peace be upon him) then complet- ed one hundred camels for him.",
      "chain": [
        "20012",
        "10652",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "3381",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا بكر، - يعني ابن مضر - عن ابن الهاد، عن أبي، بكر بن محمد عن عبد الله بن عمرو بن عثمان، عن رافع بن خديج، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن إبراهيم حرم مكة وإني أحرم ما بين لابتيها ‏\"‏ ‏.‏ يريد المدينة ‏.‏",
      "text_en": " Rafi' b. Khadij reported Allah's Messenger (may peace be upon him) as saying:                      Ibrahim declared Mecca as sacred and I declare sacred the area between its two stony grounds (lava lands by which he meant Medina).",
      "chain": [
        "30367",
        "20374",
        "11234",
        "10933",
        "1986"
      ]
    },
    {
      "hadith_no": "3972",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وحسن الحلواني، قالا حدثنا أبو أسامة، عن الوليد، بن كثير حدثني بشير بن يسار، مولى بني حارثة أن رافع بن خديج، وسهل بن أبي حثمة، حدثاه أن رسول الله صلى الله عليه وسلم نهى عن المزابنة الثمر بالتمر إلا أصحاب العرايا فإنه قد أذن لهم ‏.‏",
      "text_en": " Sahl b. Abu Hathma reported Allah's Messenger (may peace be upon him) having forbidden Muzabana, i. e. exchange of fresh dates with dry dates. except in case of those to whom donations of some trees have been made. It is for them that concession has been given.",
      "chain": [
        "30201",
        "130115",
        "20318",
        "11230",
        "11810",
        "1986",
        "1822"
      ]
    },
    {
      "hadith_no": "4024",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا حسين، - يعني ابن حسن بن يسار - حدثنا ابن، عون عن نافع، أن ابن عمر، كان يأجر الأرض - قال - فنبئ حديثا عن رافع بن خديج - قال - فانطلق بي معه إليه - قال - فذكر عن بعض عمومته ذكر فيه عن النبي صلى الله عليه وسلم أنه نهى عن كراء الأرض ‏.‏ قال فتركه ابن عمر فلم يأجره ‏.‏",
      "text_en": "  Nafi, reported that Ibn Umar (Allah be pleased with them) used to rent the land, and that he was conveyed the hadith transmitted on the authority of Rafi b. Khadij. He (the narrator) said:                      He then went to him along with me. He (Rafi) narrated from some of his uncles in which it was mentioned that Allah's Apostle (may peace be upon him) forbade the renting of land. Ibn 'Umar (Allah be pleased with them) then abandoned this practice of renting.",
      "chain": [
        "30170",
        "11071",
        "11014",
        "18",
        "1986"
      ]
    },
    {
      "hadith_no": "4026",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثني عبد الملك بن شعيب بن الليث بن سعد، حدثني أبي، عن جدي، حدثني عقيل بن خالد، عن ابن شهاب، أنه قال أخبرني سالم بن عبد الله، أن عبد الله بن عمر، كان يكري أرضيه حتى بلغه أن رافع بن خديج الأنصاري كان ينهى عن كراء الأرض فلقيه عبد الله فقال يا ابن خديج ماذا تحدث عن رسول الله صلى الله عليه وسلم في كراء الأرض قال رافع بن خديج لعبد الله سمعت عمى - وكانا قد شهدا بدرا - يحدثان أهل الدار أن رسول الله صلى الله عليه وسلم نهى عن كراء الأرض ‏.‏ قال عبد الله لقد كنت أعلم في عهد رسول الله صلى الله عليه وسلم أن الأرض تكرى ثم خشي عبد الله أن يكون رسول الله صلى الله عليه وسلم أحدث في ذلك شيئا لم يكن علمه فترك كراء الأرض ‏.‏",
      "text_en": " Salim b. Abdullah reported that AbduUah b. Umar (Allah be pleased with them) used to give land on rent until (this news) reached him that Rafi b. Khadij Ansari used to forbid the renting of land. Abdullah met him and said:                      Ibn Khadij, what is this that you narrate from Allah's Messenger (may peace be upon him) pertaining to renting of land? Rafi b. Khadij said to Abdullah: I heard it from two uncles of mine and they had participated in the Battle of Badr who narrated to the members of the family that Allah's Messenger (may peace be upon him) forbade the renting of land. Abdullah said: I knew it that the land was rented during the lifetime of Allah's Messenger (may peace be upon him). Abdullah then apprehended that Allah's Messenger (may peace be upon him) might have said something new in this connection (in regard to prohibition of renting) which I failed to know. So he abandoned the renting of land.",
      "chain": [
        "11207",
        "11013",
        "11011",
        "18",
        "1986"
      ]
    },
    {
      "hadith_no": "4027",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثني علي بن حجر السعدي، ويعقوب بن إبراهيم، قالا حدثنا إسماعيل، - وهو ابن علية - عن أيوب، عن يعلى بن حكيم، عن سليمان بن يسار، عن رافع بن خديج، قال كنا نحاقل الأرض على عهد رسول الله صلى الله عليه وسلم فنكريها بالثلث والربع والطعام المسمى فجاءنا ذات يوم رجل من عمومتي فقال نهانا رسول الله صلى الله عليه وسلم عن أمر كان لنا نافعا وطواعية الله ورسوله أنفع لنا نهانا أن نحاقل بالأرض فنكريها على الثلث والربع والطعام المسمى وأمر رب الأرض أن يزرعها أو يزرعها وكره كراءها وما سوى ذلك ‏.‏",
      "text_en": " Rafi b. Khadij (Allah be pleased with him) reported:                      We used to give on rent land during the lifetime of Allah's Messenger (may peace be upon him). We rented it on the share of one-third or one-fourth of the (produce) along with a definite quantity of corn. One day a person from among my uncles came to us and said: Allah's Messenger (may peace be upon him) forbade us this act which was a source of benefit to us, but the obedience to Allah and to His Messenger (may peace be upon him) is more beneficial to us. He forbade us that we should rent land with one-third or one-fourth of (the produce) and the corn of a measure, and he commanded the owner of land that he should cultivate it or let it be cultivated by other (persons) but he showed disapproval of renting it or anything besides it.",
      "chain": [
        "20387",
        "20184",
        "20208",
        "11015",
        "11567",
        "11005",
        "1986"
      ]
    },
    {
      "hadith_no": "4028",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثناه يحيى بن يحيى، أخبرنا حماد بن زيد، عن أيوب، قال كتب إلى يعلى بن حكيم قال سمعت سليمان بن يسار، يحدث عن رافع بن خديج، قال كنا نحاقل بالأرض فنكريها على الثلث والربع ‏.‏ ثم ذكر بمثل حديث ابن علية ‏.‏",
      "text_en": " Rafi b. Khadij (Allah be pleased with him) reported:                      We used to give land on rent, and we rented it on one-third or one-fourth share. The rest of the hadith is the same.",
      "chain": [
        "30399",
        "20022",
        "11015",
        "11005",
        "1986"
      ]
    },
    {
      "hadith_no": "4030",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنيه أبو الطاهر، أخبرنا ابن وهب، أخبرني جرير بن حازم، عن يعلى بن، حكيم بهذا الإسناد عن رافع بن خديج، عن النبي صلى الله عليه وسلم ولم يقل عن بعض عمومته ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Rafi' b. Khadij with the same chain of transmitters, but in it no mention is made of some of his uncles.",
      "chain": [
        "20029",
        "11272",
        "11567",
        "1986"
      ]
    },
    {
      "hadith_no": "4033",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ربيعة بن أبي عبد الرحمن، عن حنظلة بن قيس، أنه سأل رافع بن خديج عن كراء الأرض، فقال نهى رسول الله صلى الله عليه وسلم عن كراء الأرض قال فقلت أبالذهب والورق فقال أما بالذهب والورق فلا بأس به ‏.‏",
      "text_en": " Hanzala b. Qais reported that he asked Rafi b. Khadij (Allah be pleased with him) about renting of land, whereupon he said:                      Allah's Messenger (may peace be upon him) forbade the renting of land. I said: Is it forbidden (even if it is paid) in gold (dinar) and silver (dirham)? Thereupon he said: If it is paid in gold and silver, there is no harm in it.",
      "chain": [
        "30399",
        "11162",
        "11503",
        "1986"
      ]
    },
    {
      "hadith_no": "4034",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا إسحاق، أخبرنا عيسى بن يونس، حدثنا الأوزاعي، عن ربيعة بن أبي، عبد الرحمن حدثني حنظلة بن قيس الأنصاري، قال سألت رافع بن خديج عن كراء الأرض، بالذهب والورق فقال لا بأس به إنما كان الناس يؤاجرون على عهد النبي صلى الله عليه وسلم على الماذيانات وأقبال الجداول وأشياء من الزرع فيهلك هذا ويسلم هذا ويسلم هذا ويهلك هذا فلم يكن للناس كراء إلا هذا فلذلك زجر عنه ‏.‏ فأما شىء معلوم مضمون فلا بأس به ‏.‏",
      "text_en": " Hanzala b. Qais al-Ansri reported:                      I asked Rafi' b. Khadij about the renting of land for gold and silver, whereupon he said: There is no harm in it for the people let out land situated near canals and at the ends of the streamlets or portion of fields. (But it so happened) that at times this was destroyed and that was saved. whereas (on other occasions) this portion was saved and the other was destroyed and thus no rent was payable to the people (who let out lands) but for this one (which was saved). It was due to this that he (the Holy Prophet) prohibited it. But if there is something definite and reliable (e. g. money). there is no harm in it.",
      "chain": [
        "30312",
        "20347",
        "20024",
        "11162",
        "11503",
        "1986"
      ]
    },
    {
      "hadith_no": "4035",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا عمرو الناقد، حدثنا سفيان بن عيينة، عن يحيى بن سعيد، عن حنظلة، الزرقي أنه سمع رافع بن خديج، يقول كنا أكثر الأنصار حقلا - قال - كنا نكري الأرض على أن لنا هذه ولهم هذه فربما أخرجت هذه ولم تخرج هذه فنهانا عن ذلك وأما الورق فلم ينهنا ‏.‏",
      "text_en": " Hanzala reported that he heard Rafi' b. Khadij (Allah be pleased with him) say:                      We were the major agriculturists of the Ansar and so we let out land (saying): The produce of this (part of land) would be ours and (the produce) of that would be theirs. But it so happened that at times this (land) gave harvest, but the other one produced nothing. So he (the Holy Prophet) forbade this. But so far as the payment in silver (dirham, a coin) is concerned, he did not forbid.",
      "chain": [
        "30263",
        "20005",
        "11062",
        "1986"
      ]
    },
    {
      "hadith_no": "4094",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا يحيى بن سعيد القطان، عن محمد بن يوسف، قال سمعت السائب بن يزيد، يحدث عن رافع بن خديج، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ شر الكسب مهر البغي وثمن الكلب وكسب الحجام ‏\"‏ ‏.‏",
      "text_en": " Rafi b. Khadij (Allah be pleased with him) reported:                      I heard Allah's Apostle (may peace be upon him) as saying: The worst earning is the earning of a prostitute, the price of a dog and the earning of a cupper.",
      "chain": [
        "38487",
        "20031",
        "30388",
        "3048",
        "1986"
      ]
    },
    {
      "hadith_no": "4095",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا الوليد بن مسلم، عن الأوزاعي، عن يحيى، بن أبي كثير حدثني إبراهيم بن قارظ، عن السائب بن يزيد، حدثني رافع بن خديج، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ ثمن الكلب خبيث ومهر البغي خبيث وكسب الحجام خبيث ‏\"‏ ‏.‏",
      "text_en": " Rafi b. Khadij reported Allah'& Messenger (may peace be upon him) as saying:                      The price of a dog is evil, the earning of a prostitute is evil and the earning of a cupper is evil.",
      "chain": [
        "30123",
        "20733",
        "20024",
        "11449",
        "3048",
        "1986"
      ]
    },
    {
      "hadith_no": "4097",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا النضر بن شميل، حدثنا هشام، عن يحيى، بن أبي كثير حدثني إبراهيم بن عبد الله، عن السائب بن يزيد، حدثنا رافع بن خديج، عن  رسول الله صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Rifi' b. Khadlj through another chain of transmitters.",
      "chain": [
        "30123",
        "20291",
        "11065",
        "11449",
        "3048",
        "1986"
      ]
    },
    {
      "hadith_no": "4434",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن يحيى، - وهو ابن سعيد - عن بشير، بن يسار عن سهل بن أبي حثمة، - قال يحيى وحسبت قال - وعن رافع بن خديج، أنهما قالا خرج عبد الله بن سهل بن زيد ومحيصة بن مسعود بن زيد حتى إذا كانا بخيبر تفرقا في بعض ما هنالك ثم إذا محيصة يجد عبد الله بن سهل قتيلا فدفنه ثم أقبل إلى رسول الله صلى الله عليه وسلم هو وحويصة بن مسعود وعبد الرحمن بن سهل وكان أصغر القوم فذهب عبد الرحمن ليتكلم قبل صاحبيه فقال له رسول الله صلى الله عليه وسلم ‏\"‏ كبر ‏\"‏ ‏.‏ الكبر في السن فصمت فتكلم صاحباه وتكلم معهما فذكروا لرسول الله صلى الله عليه وسلم مقتل عبد الله بن سهل فقال لهم ‏\"‏ أتحلفون خمسين يمينا فتستحقون صاحبكم ‏\"‏ ‏.‏ أو ‏\"‏ قاتلكم ‏\"‏ ‏.‏ قالوا وكيف نحلف ولم نشهد قال ‏\"‏ فتبرئكم يهود بخمسين يمينا ‏\"‏ ‏.‏ قالوا وكيف نقبل أيمان قوم كفار فلما رأى ذلك رسول الله صلى الله عليه وسلم أعطى عقله ‏.‏",
      "text_en": " Sahl b. Abu Hathma and Rafi' b. Khadij reported that 'Abdullah b. Sahl b. Zaid and Muhayyisa b. Mas'ud b. Zaid went out and as they reached Khaibar they were separated. Then Muhayyisa found 'Abdullah b. Sahl having been killed. He buried him, and then came to Allah's Messenger (may peace be upon him). They were Huwayyisa b. Mas'ud and 'Abd al-Rahman b. Sahl, and he (the latter one) was the youngest of the people (those three who had come to seek an interview with the Holy Prophet) began to talk before his Companions (had spoken). Thereupon Allah's Messenger (may peace be upon him) said:                      The eldest one (eldest in regard to age should speak). So he kept quiet, and his companions (Muhayyisa and Huwayyisa) began to speak, and he ('Abd al Rahman) spoke along with them and they narrated to Allah's Messenger (may peace be upon him) the murder of 'Abdullah b. Sahl. Thereupon he said to them: Are you prepared to take fifty oaths so that you may be entitled (to blood-wit) of your companion (or your man who has murdered)? They said: How can we take an oath on a matter which we have not witnessed? He (the Holy Prophet) said: Then the Jews will exonerate themselves by fifty oaths. They said: How can we accept the oaths of people who are unbelievers? When Allah's Messenger (may peace be upon him) saw that, he himself paid his blood-wit.",
      "chain": [
        "30367",
        "20023",
        "11062",
        "11810",
        "1822",
        "1986"
      ]
    },
    {
      "hadith_no": "4435",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "وحدثني عبيد الله بن عمر القواريري، حدثنا حماد بن زيد، حدثنا يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، ورافع بن خديج، أن محيصة بن مسعود، وعبد، الله بن سهل انطلقا قبل خيبر فتفرقا في النخل فقتل عبد الله بن سهل فاتهموا اليهود فجاء أخوه عبد الرحمن وابنا عمه حويصة ومحيصة إلى النبي صلى الله عليه وسلم فتكلم عبد الرحمن في أمر أخيه وهو أصغر منهم فقال رسول الله صلى الله عليه وسلم ‏\"‏ كبر الكبر - أو قال - ليبدإ الأكبر ‏\"‏ ‏.‏ فتكلما في أمر صاحبهما فقال رسول الله صلى الله عليه وسلم ‏\"‏ يقسم خمسون منكم على رجل منهم فيدفع برمته ‏\"‏ ‏.‏ قالوا أمر لم نشهده كيف نحلف قال ‏\"‏ فتبرئكم يهود بأيمان خمسين منهم ‏\"‏ ‏.‏ قالوا يا رسول الله قوم كفار قال فوداه رسول الله صلى الله عليه وسلم من قبله ‏.‏ قال سهل فدخلت مربدا لهم يوما فركضتني ناقة من تلك الإبل ركضة برجلها ‏.‏ قال حماد هذا أو نحوه ‏.‏",
      "text_en": " Sahl. b. Abu Hathma and Rafi' b. Khadij reported that Muhayyisa b. Mas'ud and 'Abdullah b. Sahl went towards Khaibar and they separated near the palm-trees. 'Abdullah b. Sahl was killed. They accused the Jews (for this act). And there came to Allah's Apostle (may peace be upon him) his brother (the brother of the slain person) 'Abd al-Rahman and his cousins Huwayyisa and Muhayyisa; and 'Abd al-Rahman talked to him about the matter pertaining to (the murder of) his brother, and he was the youngest among them. Thereupon Allah's Messenger (may peace be upon him) said:                      Show regard for the greatness of the old, or he said: Let the eldest begin speaking. Then they (Huwayyisa and Muhayyisa) spoke about the matter of their companion (murder of their cousin, 'Abdullah b. Sahl). Thereupon Allah's Messenger (may peace be upon him) said: Let fifty (persons) among you take oath for levelling the charge (of murder) against a person amongst them, and he would be surrendered to you. They said: We have not witnessed this matter ourselves. How can we then take oath? He (the Holy Prophet) said: The Jews will exonerate themselves by the oaths of fifty of them. They said: Messenger of Allah, they are non-believing people. Thereupon Allah's Messenger (may peace be upon him) paid the blood wit for him. Sahl said: As one day I entered the fold a she-camel amongst those camels hit me with its leg.",
      "chain": [
        "30024",
        "20022",
        "20031",
        "11810",
        "1822",
        "1986",
        "1920"
      ]
    },
    {
      "hadith_no": "5204",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن المثنى العنزي، حدثنا يحيى بن سعيد، عن سفيان، حدثني أبي، عن عباية بن رفاعة بن رافع بن خديج، عن رافع بن خديج، قلت يا رسول الله إنا لاقو العدو غدا وليست معنا مدى قال صلى الله عليه وسلم ‏\"‏ أعجل أو أرني ما أنهر الدم وذكر اسم الله فكل ليس السن والظفر وسأحدثك أما السن فعظم وأما الظفر فمدى الحبشة ‏\"‏ ‏.‏ قال وأصبنا نهب إبل وغنم فند منها بعير فرماه رجل بسهم فحبسه فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن لهذه الإبل أوابد كأوابد الوحش فإذا غلبكم منها شىء فاصنعوا به هكذا ‏\"‏ ‏.‏",
      "text_en": " Rafi' b. Khadij is reported to have said:                      Allah's Messenger, we are going to encounter the enemy tomorrow, but we have no knives with us. Thereupon Allah's Messenger (may peace be upon him) said: Make haste or be careful (in making arrangements for procuring knives) which would let the blood flow (and along with it) the name of Allah is also to be recited. Then eat, but not the tooth or nail. And I am going to tell you why it is not permissible to slaughter the animal with the help of tooth and bone; and as for the nail. it is a bone, and the bone is the knife of Abyssinians. He (the narrator) said: There fell to our lot as spoils of war camels and goats, and one of the camels among them became wild. A person (amongst usl struck It with an arrow which brought it under control. whereupon Allah's Messenger (may peace be upon him) said: This camel became wild like wild animals, so if you find any animal getting wild, you do the same with that",
      "chain": [
        "30170",
        "20031",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "5205",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا وكيع، حدثنا سفيان بن سعيد بن مسروق، عن أبيه، عن عباية بن رفاعة بن رافع بن خديج، عن رافع بن خديج، قال كنا مع رسول الله صلى الله عليه وسلم بذي الحليفة من تهامة فأصبنا غنما وإبلا فعجل القوم فأغلوا بها القدور فأمر بها فكفئت ثم عدل عشرا من الغنم بجزور ‏.‏ وذكر باقي الحديث كنحو حديث يحيى بن سعيد ‏.‏",
      "text_en": " Rafi' b. Khadij reported:                      While we were with Allah's Messenger (may peace he upon him) in Dhu'I-Hulaifa in Tihama, we got hold of goats and camels. Some persons (amongst us) made haste and boiled (the flesh of goats and camels) in their earthen pots. He then commanded and these were turned over; then he equalised ten goats for a camel. The rest of the hadith is the same.",
      "chain": [
        "30123",
        "20032",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "5208",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثنا محمد بن الوليد بن عبد الحميد، حدثنا محمد بن جعفر، حدثنا شعبة، عن  سعيد بن مسروق، عن عباية بن رفاعة بن رافع، عن رافع بن خديج، أنه قال يا رسول الله إنا لاقو العدو غدا وليس معنا مدى وساق الحديث ولم يذكر فعجل القوم فأغلوا بها القدور فأمر بها فكفئت وذكر سائر القصة ‏.‏",
      "text_en": " Rafi' b. Khadij reported that he said:                      Allah's Messenger, we are going to encounter the enemy tomorrow. and we do not have large knives with us. The rest of the hadith is the same, but no mention is made of this:\" The people hastened and they boiled (flesh) in the earthen pots. He (the Holy Prophet), cammanded and these were turned over and the narrator narrated the whole event.",
      "chain": [
        "30174",
        "20173",
        "20020",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "5889",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا هناد بن السري، حدثنا أبو الأحوص، عن سعيد بن مسروق، عن عباية، بن رفاعة عن جده، رافع بن خديج قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الحمى فور من جهنم فابردوها بالماء ‏\"‏ ‏.‏",
      "text_en": " Rafi' b. Khadij reported:                      I heard Allah's messenger (may peace be upon him) as saying: The fever is due to the intense heat of the Hell, so cool it with water.",
      "chain": [
        "30480",
        "20327",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "5890",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، ومحمد بن حاتم، وأبو بكر بن نافع قالوا حدثنا عبد الرحمن بن مهدي، عن سفيان، عن أبيه، عن عباية بن رفاعة، حدثني  رافع بن خديج، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الحمى من فور جهنم فابردوها عنكم بالماء ‏\"‏ ‏.‏ ولم يذكر أبو بكر ‏\"‏ عنكم ‏\"‏ ‏.‏ وقال قال أخبرني رافع بن خديج ‏.‏",
      "text_en": " Rafi' b. Khadij reported:                      I heard Allah's Messenger (may peace be upon him) as saying: The fever is due to the intense heat of Hell, so cool it down in your (bodies) with water. Aba Bakr has made no mention of the word\" from you\" ('ankum), but he said that Rafi' b. Khadij had informed him of it.",
      "chain": [
        "30201",
        "30170",
        "38487",
        "20523",
        "20033",
        "20005",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "6276",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا عبد الله بن الرومي اليمامي، وعباس بن عبد العظيم العنبري، وأحمد بن، جعفر المعقري قالوا حدثنا النضر بن محمد، حدثنا عكرمة، - وهو ابن عمار - حدثنا  أبو النجاشي، حدثني رافع بن خديج، قال قدم نبي الله صلى الله عليه وسلم المدينة وهم يأبرون النخل يقولون يلقحون النخل فقال ‏\"‏ ما تصنعون ‏\"‏ ‏.‏ قالوا كنا نصنعه قال ‏\"‏ لعلكم لو لم تفعلوا كان خيرا ‏\"‏ ‏.‏ فتركوه فنفضت أو فنقصت - قال - فذكروا ذلك له فقال ‏\"‏ إنما أنا بشر إذا أمرتكم بشىء من دينكم فخذوا به وإذا أمرتكم بشىء من رأى فإنما أنا بشر ‏\"‏ ‏.‏ قال عكرمة أو نحو هذا ‏.‏ قال المعقري فنفضت ‏.‏ ولم يشك ‏.‏",
      "text_en": " Rafi' b. Khadij reported that Allah's Messenger (may peace be upon him) came to Medina and the people had been grafting the trees. He said:                      What are you doing? They said: We are grafting them, whereupon he said: It may perhaps be good for you if you do not do that, so they abandoned this practice (and the date-palms) began to yield less fruit. They made a mention of it (to the Holy Prophet), whereupon he said: I am a human being, so when I command you about a thing pertaining to religion, do accept it, and when I command you about a thing out of my personal opinion, keep it in mind that I am a human being. 'Ikrima reported that he said something like this.",
      "chain": [
        "30437",
        "30414",
        "28603",
        "10704",
        "1986"
      ]
    },
    {
      "hadith_no": "424",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن إسماعيل، حدثنا سفيان، عن ابن عجلان، عن عاصم بن عمر بن قتادة بن النعمان، عن محمود بن لبيد، عن رافع بن خديج، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أصبحوا بالصبح فإنه أعظم لأجوركم ‏\"‏ ‏.‏ أو ‏\"‏ أعظم للأجر ‏\"‏ ‏.‏",
      "text_en": " Rafi' b. Khadij reported the Messenger of Allah (ﷺ) as saying:                      Offer Fajr prayer at dawn, for it is most productive of rewards to you or most productive of reward.",
      "chain": [
        "20012",
        "10616",
        "1830",
        "1986"
      ]
    },
    {
      "hadith_no": "2821",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا سعيد بن مسروق، عن عباية بن رفاعة، عن أبيه، عن جده، رافع بن خديج قال أتيت رسول الله صلى الله عليه وسلم فقلت يا رسول الله إنا نلقى العدو غدا وليس معنا مدى أفنذبح بالمروة وشقة العصا فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرن أو أعجل ما أنهر الدم وذكر اسم الله عليه فكلوا ما لم يكن سنا أو ظفرا وسأحدثكم عن ذلك أما السن فعظم وأما الظفر فمدى الحبشة ‏\"‏ ‏.‏ وتقدم به سرعان من الناس فتعجلوا فأصابوا من الغنائم ورسول الله صلى الله عليه وسلم في آخر الناس فنصبوا قدورا فمر رسول الله صلى الله عليه وسلم بالقدور فأمر بها فأكفئت وقسم بينهم فعدل بعيرا بعشر شياه وند بعير من إبل القوم ولم يكن معهم خيل فرماه رجل بسهم فحبسه الله فقال النبي صلى الله عليه وسلم ‏\"‏ إن لهذه البهائم أوابد كأوابد الوحش فما فعل منها هذا فافعلوا به مثل هذا ‏\"‏ ‏.‏",
      "text_en": " Narrated Rafi' b. Khadij:                     I came to the Messenger of Allah (ﷺ) and said: Messenger of Allah, we shall meet the enemy tomorrow and we have no knives with us. May we kill with a sharp-edged white stone (flint) and with splinter of a staff ? The Messenger of Allah (ﷺ) said: Hasten in slaughtering it. When Allah's name is mentioned you may eat what is killed by anything which causes the blood to flow except tooth and claw. I shall tell you about it. The tooth is a bone, and the claw is the knife of Abyssinians. Some people hastened and went forward, they made haste and got booty, while the Messenger of Allah (ﷺ) was in the rear and they setup cooking pots. The Messenger of Allah (ﷺ) passed by over the cooking pots. He ordered to turn them over. He then divided (the spoils of war) between them, and gave them a camel for ten goats in equation. One of the camels of the people ran away, and they had no horses with them at that time. A man shot an arrow at it, and Allah prevented it from escaping. The Prophet (ﷺ) said: Among animals (i.e. camels) there are some which bolt like wild animals ; so when any of them does so, do with it like this.",
      "chain": [
        "30175",
        "20327",
        "20016",
        "11179",
        "11506",
        "1986"
      ]
    },
    {
      "hadith_no": "2936",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن إبراهيم الأسباطي، حدثنا عبد الرحيم بن سليمان، عن محمد بن إسحاق، عن عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن رافع بن خديج، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ العامل على الصدقة بالحق كالغازي في سبيل الله حتى يرجع إلى بيته ‏\"‏ ‏.‏",
      "text_en": " Narrated Rafi' ibn Khadij:                     I heard the Messenger of Allah (ﷺ) say: The official who collects sadaqah (zakat) in a just manner is like him who fights in Allah's path till he returns home.",
      "chain": [
        "11213",
        "20334",
        "11107",
        "11103",
        "1830",
        "1986"
      ]
    },
    {
      "hadith_no": "3389",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن عمرو بن دينار، قال سمعت ابن عمر، يقول ما كنا نرى بالمزارعة بأسا حتى سمعت رافع بن خديج يقول إن رسول الله صلى الله عليه وسلم نهى عنها ‏.‏ فذكرته لطاوس فقال قال لي ابن عباس إن رسول الله صلى الله عليه وسلم لم ينه عنها ولكن قال ‏\"‏ لأن يمنح أحدكم أرضه خير من أن يأخذ عليها خراجا معلوما ‏\"‏ ‏.‏",
      "text_en": " Amr ibn Dinar said:                      I heard Ibn Umar say: We did not see any harm in sharecropping till I heard Rafi' ibn Khadij say: The Messenger of Allah (ﷺ) has forbidden it. So I mentioned it to Tawus. He said: Ibn Abbas told me that the Messenger of Allah (ﷺ) had not forbidden it, but said: It is better for one of you to lend to his brother than to take a prescribed sum from him.",
      "chain": [
        "28531",
        "20012",
        "11081",
        "18",
        "1986"
      ]
    },
    {
      "hadith_no": "3392",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا إبراهيم بن موسى الرازي، أخبرنا عيسى، حدثنا الأوزاعي، ح وحدثنا قتيبة بن سعيد، حدثنا ليث، كلاهما عن ربيعة بن أبي عبد الرحمن، - واللفظ للأوزاعي - حدثني حنظلة بن قيس الأنصاري، قال سألت رافع بن خديج عن كراء الأرض، بالذهب والورق فقال لا بأس بها إنما كان الناس يؤاجرون على عهد رسول الله صلى الله عليه وسلم بما على الماذيانات وأقبال الجداول وأشياء من الزرع فيهلك هذا ويسلم هذا ويسلم هذا ويهلك هذا ولم يكن للناس كراء إلا هذا فلذلك زجر عنه فأما شىء مضمون معلوم فلا بأس به ‏.‏ وحديث إبراهيم أتم وقال قتيبة عن حنظلة عن رافع ‏.‏ قال أبو داود رواية يحيى بن سعيد عن حنظلة نحوه ‏.‏",
      "text_en": " Narrated Hanzlah b. Qais al-Ansari:                     I asked Rafi' b. Khadij about the lease of land for gold and silver (i.e. for dinars and dirhams). There is no harm in it, for the people used to let out land in the time of the Messenger of Allah (ﷺ) for what grew by the current of water and at the banks of streamlets and at the places of cultivation. So sometimes this (portion) perished and that (portion) was saved, and sometimes this remained intact and that perished. There was no (form of) lease among the people except this. Therefore, he forbade it. But if there is something which is secure and known, then there is no harm in it. The tradition of Ibrahim is more perfect. Qutaibah said: \"from Hanzalah on the authority of Rafi' \".Abu Dawud said: A similar tradition has been transmitted by Yahya b. Sa'id from Hanzalah.",
      "chain": [
        "30309",
        "20347",
        "20024",
        "30367",
        "20023",
        "11503",
        "1986"
      ]
    },
    {
      "hadith_no": "3393",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا قتيبة بن سعيد، عن مالك، عن ربيعة بن أبي عبد الرحمن، عن حنظلة بن قيس، أنه سأل رافع بن خديج عن كراء الأرض، فقال نهى رسول الله صلى الله عليه وسلم عن كراء الأرض فقلت أبالذهب والورق فقال أما بالذهب والورق فلا بأس به ‏.‏",
      "text_en": " Hanzalah ibn Qays said that he asked Rafi' ibn Khadij about the lease of land. He replied:                      The Messenger of Allah (ﷺ) forbade the leasing of land. I asked: (Did he forbid) for gold and silver (i.e. dinars and dirhams)? He replied: If it is against  gold and silver, then there is no harm in it.",
      "chain": [
        "30367",
        "20001",
        "11162",
        "11503",
        "1986"
      ]
    },
    {
      "hadith_no": "3394",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي الليث، حدثني عقيل، عن ابن شهاب، أخبرني سالم بن عبد الله بن عمر، أن ابن عمر، كان يكري أرضه حتى بلغه أن رافع بن خديج الأنصاري حدث أن رسول الله صلى الله عليه وسلم كان ينهى عن كراء الأرض فلقيه عبد الله فقال يا ابن خديج ماذا تحدث عن رسول الله صلى الله عليه وسلم في كراء الأرض قال رافع لعبد الله بن عمر سمعت عمى وكانا قد شهدا بدرا يحدثان أهل الدار أن رسول الله صلى الله عليه وسلم نهى عن كراء الأرض ‏.‏ قال عبد الله والله لقد كنت أعلم في عهد رسول الله صلى الله عليه وسلم أن الأرض تكرى ‏.‏ ثم خشي عبد الله أن يكون رسول الله صلى الله عليه وسلم أحدث في ذلك شيئا لم يكن علمه فترك كراء الأرض ‏.‏ قال أبو داود رواه أيوب وعبيد الله وكثير بن فرقد ومالك عن نافع عن رافع عن النبي صلى الله عليه وسلم ورواه الأوزاعي عن حفص بن عنان عن نافع عن رافع قال سمعت رسول الله صلى الله عليه وسلم وكذلك رواه زيد بن أبي أنيسة عن الحكم عن نافع عن ابن عمر أنه أتى رافعا فقال سمعت رسول الله صلى الله عليه وسلم فقال نعم ‏.‏ وكذا قال عكرمة بن عمار عن أبي النجاشي عن رافع بن خديج قال سمعت النبي عليه السلام ‏.‏ ورواه الأوزاعي عن أبي النجاشي عن رافع بن خديج عن عمه ظهير بن رافع عن النبي صلى الله عليه وسلم ‏.‏ قال أبو داود أبو النجاشي عطاء بن صهيب ‏.‏",
      "text_en": " Narrated Salim bin 'Abdullah b. 'Umar:                     Ibn 'Umar used to let out his land till it reached him that Rafi' b. Khadij al-Ansari narrated that the Messenger of Allah (ﷺ) forbade let out land. So 'Abd Allah (b. 'Umar) said: Ibn Khadij, what do you narrate from the Messenger of Allah (ﷺ) about leasing the land? Rafi' replied to 'Abd Allah b. 'Umar: I heard both of my uncles were present in the battle of Badr say, and they narrated it to the members of the family, that the Messenger of Allah (ﷺ) forbade leasing land. 'Abd Allah said: I swear by Allah, I knew that land was leased in the time of the Messenger of Allah (ﷺ). 'Abd Allah then feared that the Messenger of Allah (ﷺ) might have created something new in that matter, so he gave up leasing land.Abu Dawud said: This tradition has also been transmitted by Ayyub, 'Ubaid Allah, Kathir b. Farqad, Malik from Nafi' on the authority of Rafi' from the Prophet (ﷺ). It has also been transmitted by al-Auzai' from Hafs b. 'Inan al-Hanafi from Nafi' from Rafi' who said: I heard the Messenger of Allah (ﷺ) say: Similarly, it has been transmitted by Zaid b. Abi Unaisah from al-Hakkam from Nafi' from Ibn 'Umar that he went to Rafi' and asked: Have you heard the Messenger of Allah (ﷺ) say? He replied: Yes. Similarly, it has also been transmitted by 'Ikrimah b. 'Ammar from Abu al-Najashi, from Rafi' b. Khadij who said: I heard the Prophet (ﷺ) say. It has also been transmitted by al-Auza'i from Abu al-Najashi from Rafi' b. Khadij from his uncle Zuhair b. Rafi' from the Prophet (ﷺ).Abu Dawud said: The name of Abu al-Najashi is 'Ata b. Suhaib.",
      "chain": [
        "30489",
        "36033",
        "11207",
        "11013",
        "11011",
        "18",
        "1986"
      ]
    },
    {
      "hadith_no": "3395",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، حدثنا خالد بن الحارث، حدثنا سعيد، عن يعلى بن حكيم، عن سليمان بن يسار، أن رافع بن خديج، قال كنا نخابر على عهد رسول الله صلى الله عليه وسلم فذكر أن بعض عمومته أتاه فقال نهى رسول الله صلى الله عليه وسلم عن أمر كان لنا نافعا وطواعية الله ورسوله أنفع لنا وأنفع ‏.‏ قال قلنا وما ذاك قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كانت له أرض فليزرعها أو فليزرعها أخاه ولا يكاريها بثلث ولا بربع ولا بطعام مسمى ‏\"‏ ‏.‏",
      "text_en": " Narrated Rafi' b. Khadij:                     We used to employ people to till land for a share of it produce. He then maintained that, one of his uncles came to him and said: The Messenger of Allah (ﷺ) forbade us from a work which beneficial to us. But obedience to Allah and His Apostle (ﷺ) is more beneficial to us. We asked : What is that ? He said: The Messenger of Allah (ﷺ) said: If anyone has land, he should cultivate it, or lend it to his brother for cultivation. He should not rent it for a third or a quarter (of the produce) or for specified among of produce.",
      "chain": [
        "30024",
        "20226",
        "11168",
        "11567",
        "11005",
        "1986"
      ]
    }
  ],
  "total_hadiths": 144
}