{
  "id": "19865",
  "name": "al-Harith bin 'Abdullah al-Awar الحارث بن عبد الله الأعور",
  "full_name": "al-Harith bin 'Abdullah al-Awar الحارث بن عبد الله الأعور",
  "grade": "Follower(Tabi') [2nd Generation]",
  "reliability_grade": "Weak",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "70",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hamadan",
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Weak] [ 4  -  ضعيف ]"
    ],
    "tags": [
      "al-Hamdani",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "16",
      "name": "ibn Mas'ud ( عبد الله بن مسعود ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "49",
      "name": "Zayd ibn Thabit ( زيد بن ثابت بن الضحاك بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11347",
      "name": "Sa'id bin Fyrwz Abu al-Bakhtari al-Tai'i سعيد بن فيروز أبو البختري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11362",
      "name": "'Abdullah bin Marrah al-Kharfi عبد الله بن مرة الهمداني الخارفي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-muslim-52",
      "hadith_no": "52",
      "source": "Sahih Muslim",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو عامر عبد الله بن براد الأشعري، حدثنا أبو أسامة، عن مفضل، عن مغيرة، قال سمعت الشعبي، يقول حدثني الحارث الأعور، وهو يشهد أنه أحد الكاذبين ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20318",
        "11072",
        "11052",
        "19865"
      ]
    },
    {
      "id": "sunan-abi-daud-1572",
      "hadith_no": "1572",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا زهير، حدثنا أبو إسحاق، عن عاصم بن ضمرة، وعن الحارث الأعور، عن علي، - رضى الله عنه - قال زهير أحسبه عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ هاتوا ربع العشور من كل أربعين درهما درهم وليس عليكم شىء حتى تتم مائتى درهم فإذا كانت مائتى درهم ففيها خمسة دراهم فما زاد فعلى حساب ذلك وفي الغنم في كل أربعين شاة شاة فإن لم يكن إلا تسعا وثلاثين فليس عليك فيها شىء ‏\"‏ ‏.‏ وساق صدقة الغنم مثل الزهري قال ‏\"‏ وفي البقر في كل ثلاثين تبيع وفي الأربعين مسنة وليس على العوامل شىء وفي الإبل ‏\"‏ ‏.‏ فذكر صدقتها كما ذكر الزهري قال ‏\"‏ وفي خمس وعشرين خمسة من الغنم فإذا زادت واحدة ففيها ابنة مخاض فإن لم تكن بنت مخاض فابن لبون ذكر إلى خمس وثلاثين فإذا زادت واحدة ففيها بنت لبون إلى خمس وأربعين فإذا زادت واحدة ففيها حقة طروقة الجمل إلى ستين ‏\"‏ ‏.‏ ثم ساق مثل حديث الزهري قال ‏\"‏ فإذا زادت واحدة - يعني واحدة وتسعين - ففيها حقتان طروقتا الجمل إلى عشرين ومائة فإن كانت الإبل أكثر من ذلك ففي كل خمسين حقة ولا يفرق بين مجتمع ولا يجمع بين مفترق خشية الصدقة ولا تؤخذ في الصدقة هرمة ولا ذات عوار ولا تيس إلا أن يشاء المصدق وفي النبات ما سقته الأنهار أو سقت السماء العشر وما سقى الغرب ففيه نصف العشر ‏\"‏ ‏.‏ وفي حديث عاصم والحارث ‏\"‏ الصدقة في كل عام ‏\"‏ ‏.‏ قال زهير أحسبه قال ‏\"‏ مرة ‏\"‏ ‏.‏ وفي حديث عاصم ‏\"‏ إذا لم يكن في الإبل ابنة مخاض ولا ابن لبون فعشرة دراهم أو شاتان ‏\"‏ ‏.‏",
      "text_en": " Al-Harith al-A'war reported from Ali. Zuhayr said:                      I think, the Prophet (ﷺ) said: \"Pay a fortieth. A dirham is payable on every forty, but you are not liable for payment until you have accumulated two hundred dirhams. When you have two hundred dirhams, five dirhams are payable, and that proportion is applicable to larger amounts.  \"Regarding sheep, for every forty sheep up to one hundred and twenty, one sheep is due. But if you possess only thirty-nine, nothing is payable on them.\" He further narrated the tradition about the sadaqah (zakat) on sheep like that of az-Zuhri.  \"Regarding cattle, a yearling bull calf is payable for every thirty, and a cow in her third year for forty, and nothing is payable on working animals.  Regarding (the zakat on) camels, he mentioned the rates that az-Zuhri mentioned in his tradition. He said: \"For twenty-five camels, five sheep are to be paid. If they exceed by one, a she-camel in her second year is to be given. If there is no she-camel in her second year, a male camel in its third year is to be given, up to thirty-five. If they exceed by one a she-camel in her third year is to be given, up to forty-five. If they exceed by one, a she-camel in her fourth year which is ready to be covered by a bull-camel is to be given.\" He then transmitted the rest of the tradition like that of az-Zuhri.  He continued: If they exceed by one, i.e. they are ninety-one to hundred and twenty, two she-camels in their fourth year, which are ready to be covered by a bull-camel, are to be given. If there are more camels than that, a she-camel in her fourth year is to be given for every fifty. Those which are in one flock are not to be separated, and those which are separate are not to be brought together. An old sheep, one with a defect in the eye, or a billy goat is not to be accepted as a sadaqah unless the collector is willing.  As regards agricultural produce, a tenth is payable on that which is watered by rivers or rain, and a twentieth on that which is watered by draught camels.\"  The version of Asim and al-Harith says: \"Sadaqah (zakat) is payable every year.\" Zuhayr said: I think he said \"Once a year\".  The version of Asim has the words: \"If a she-camel in her second year is not available among the camels, nor is there a bull-camel in its third year, ten dirhams or two goats are to be given.\"",
      "usc_msa_ref": "",
      "chain": [
        "30352",
        "20321",
        "11049",
        "19871",
        "19865",
        "5"
      ]
    },
    {
      "id": "sunan-abi-daud-1573",
      "hadith_no": "1573",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، أخبرني جرير بن حازم، وسمى، آخر عن أبي إسحاق، عن عاصم بن ضمرة، والحارث الأعور، عن علي، - رضى الله عنه - عن النبي صلى الله عليه وسلم ببعض أول هذا الحديث قال ‏\"‏ فإذا كانت لك مائتا درهم وحال عليها الحول ففيها خمسة دراهم وليس عليك شىء - يعني في الذهب - حتى يكون لك عشرون دينارا فإذا كان لك عشرون دينارا وحال عليها الحول ففيها نصف دينار فما زاد فبحساب ذلك ‏\"‏ ‏.‏ قال فلا أدري أعلي يقول فبحساب ذلك ‏.‏ أو رفعه إلى النبي صلى الله عليه وسلم ‏\"‏ وليس في مال زكاة حتى يحول عليه الحول ‏\"‏ ‏.‏ إلا أن جريرا قال ابن وهب يزيد في الحديث عن النبي صلى الله عليه وسلم ‏\"‏ ليس في مال زكاة حتى يحول عليه الحول ‏\"‏ ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The Prophet (ﷺ) said: \"When you possess two hundred dirhams and one year passes on them, five dirhams are payable. Nothing is incumbent on you, that is, on gold, till it reaches twenty dinars. When you possess twenty dinars and one year passes on them, half a dinar is payable. Whatever exceeds, that will be reckoned properly.\" (The narrator said: I do not remember whether the words \"that will be reckoned properly\" were uttered by All himself or he attributed them to the Prophet (ﷺ). No zakat is payable on property till a year passes on it. But Jarir said: Ibn Wahb (sub-narrator) added to this tradition from the Prophet (ﷺ): \"No zakat is payable on property until a year passes away on it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30584",
        "20029",
        "11272",
        "11049",
        "19871",
        "19865",
        "5"
      ]
    },
    {
      "id": "sunan-abi-daud-2077",
      "hadith_no": "2077",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، عن حصين، عن عامر، عن الحارث الأعور، عن رجل، من أصحاب النبي صلى الله عليه وسلم قال فرأينا أنه علي - عليه السلام - عن النبي صلى الله عليه وسلم بمعناه ‏.‏",
      "text_en": " The aforesaid tradition has also been transmitted by ‘Ali through a different chain of narrators from the Prophet (ﷺ) to the same effect.",
      "usc_msa_ref": "",
      "chain": [
        "30569",
        "20423",
        "15097",
        "11052",
        "19865"
      ]
    }
  ],
  "total_hadiths": 4
}