{
  "id": "19868",
  "name": "Sulaiman bin 'Amr bin al-Ahws سليمان بن عمرو بن الأحوص",
  "full_name": "Sulaiman bin 'Amr bin al-Ahws سليمان بن عمرو بن الأحوص",
  "grade": "Follower(Tabi')",
  "reliability_grade": "Maqbool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [4  الأربعة][د  أبي  داود]"
    ],
    "tags": [
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "4020",
      "name": "Umm Jundab Azdiyya ( أم جندب الأزدية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11430",
      "name": "Shbyb bin Ghrqd'h شبيب بن غرقدة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10844",
      "name": "Yazid bin Abi Ziyad يزيد بن أبي زياد",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1966",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا إبراهيم بن مهدي، حدثني علي بن مسهر، عن يزيد بن أبي زياد، أخبرنا سليمان بن عمرو بن الأحوص، عن أمه، قالت رأيت رسول الله صلى الله عليه وسلم يرمي الجمرة من بطن الوادي وهو راكب يكبر مع كل حصاة ورجل من خلفه يستره فسألت عن الرجل فقالوا الفضل بن العباس وازدحم الناس فقال النبي صلى الله عليه وسلم ‏\"‏ يا أيها الناس لا يقتل بعضكم بعضا وإذا رميتم الجمرة فارموا بمثل حصى الخذف ‏\"‏ ‏.‏",
      "text_en": " Narrated Sulaiman b. 'Amr b. al-Ahwas:                     On the authority of his mother: I saw the Messenger of Allah (ﷺ) throwing pebbles at the jamrah from the botton of wadi (valley) while he was riding (on a camel). He was uttering the takbir (Allah is most great) with each pebble. A man behind him was shading him. I asked about the man. They (the people) said: He is al-Fadl b. al-'Abbas. The people crowded. The Prophet (ﷺ) said: 'O people, do not kill each other ; when you throw pebbled at the jamrah, throw small pebbles.",
      "chain": [
        "20345",
        "10844",
        "19868"
      ]
    },
    {
      "hadith_no": "1967",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو ثور، إبراهيم بن خالد ووهب بن بيان قالا حدثنا عبيدة، عن يزيد بن أبي زياد، عن سليمان بن عمرو بن الأحوص، عن أمه، قالت رأيت رسول الله صلى الله عليه وسلم عند جمرة العقبة راكبا ورأيت بين أصابعه حجرا فرمى ورمى الناس ‏.‏",
      "text_en": " Sulaiman b. 'Amr b. Ahwas reported on the authority of his mother:                      I saw the Messenger of Allah (ﷺ) near the Jamrat al-Aqabah (the third or last pillar) riding (on a camel) and I saw a pebble between his fingers. He threw the pebbles and the people also threw (stones at the Jamrah).",
      "chain": [
        "11370",
        "10844",
        "19868"
      ]
    },
    {
      "hadith_no": "1196",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Suckling - كتاب الرضاع",
      "chapter_no": "12",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا الحسين بن علي الجعفي، عن زائدة، عن شبيب بن غرقدة، عن سليمان بن عمرو بن الأحوص، قال حدثني أبي أنه، شهد حجة الوداع مع رسول الله صلى الله عليه وسلم فحمد الله وأثنى عليه وذكر ووعظ فذكر في الحديث قصة فقال ‏\"‏ ألا واستوصوا بالنساء خيرا فإنما هن عوان عندكم ليس تملكون منهن شيئا غير ذلك إلا أن يأتين بفاحشة مبينة فإن فعلن فاهجروهن في المضاجع واضربوهن ضربا غير مبرح فإن أطعنكم فلا تبغوا عليهن سبيلا ألا إن لكم على نسائكم حقا ولنسائكم عليكم حقا فأما حقكم على نسائكم ألا يوطئن فرشكم من تكرهون ولا يأذن في بيوتكم لمن تكرهون ألا وحقهن عليكم أن تحسنوا إليهن في كسوتهن وطعامهن ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ ومعنى قوله ‏\"‏ عوان عندكم ‏\"‏ ‏.‏ يعني أسرى في أيديكم ‏.‏",
      "text_en": " Sulaiman bin Amr bin Al-Ahwas said:                      “My father narrated to me that he witnessed the farewell Hajj with the Messenger of Allah. So he thanked and praised Allah and he reminded and gave admonition. He mentioned a story in his narration and he (the Prophet) said: “And indeed I order you to be good to the women, for they are but captives with you over whom you have no power than that, except if they come with manifest Fahishah (evil behavior). If they do that, then abandon their beds and beat them with a beating that is not harmful. And if they obey you then you have no cause against them. Indeed you have rights over your women, and your women have rights over you. As for your rights over your women, then they must not allow anyone whom you dislike to treat on your bedding (furniture), nor to admit anyone in your home that you dislike. And their rights over you are that you treat them well in clothing them and feeding them.”",
      "chain": [
        "30115",
        "20315",
        "20320",
        "11430",
        "19868"
      ]
    },
    {
      "hadith_no": "2159",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا هناد، حدثنا أبو الأحوص، عن شبيب بن غرقدة، عن سليمان بن عمرو بن الأحوص، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم يقول في حجة الوداع للناس ‏\"‏ أى يوم هذا ‏\"‏ ‏.‏ قالوا يوم الحج الأكبر ‏.‏ قال ‏\"‏ فإن دماءكم وأموالكم وأعراضكم بينكم حرام كحرمة يومكم هذا في بلدكم هذا ألا لا يجني جان إلا على نفسه ألا لا يجني جان على ولده ولا مولود على والده ألا وإن الشيطان قد أيس من أن يعبد في بلادكم هذه أبدا ولكن ستكون له طاعة فيما تحتقرون من أعمالكم فسيرضى به ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي بكرة وابن عباس وجابر وحذيم بن عمرو السعدي ‏.‏ وهذا حديث حسن صحيح ‏.‏ وروى زائدة عن شبيب بن غرقدة نحوه ولا نعرفه إلا من حديث شبيب بن غرقدة ‏.‏",
      "text_en": " Sulaiman bin 'Amr bin Al-Ahwas narrated from his father who said:                      \"During the Farewell Pilgrimage, I heard the Messenger of Allah(s.a.w) saying:'Which day is this?' They said:'The day of Al-Hajj Al-Akbar.'He said:'Indeed your blood, your wealth, your honour is sacred to each other, just as this day of yours is sacred in this city of yours. Indeed, no one commits a crime except against himself. Indeed none commits a crime for which his son is accountable, nor does a child commit a crime for which his father is held accountable. Indeed Ash-Shaitan has lost hope of ever being worshipped in this city of yours, but he will have compliance in what deeds of yours you consider insignificant, which he will be content with.\"'",
      "chain": [
        "30480",
        "20327",
        "11430",
        "19868"
      ]
    },
    {
      "hadith_no": "3367",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا حسين بن علي الجعفي، عن زائدة، عن شبيب بن غرقدة، عن سليمان بن عمرو بن الأحوص، حدثنا أبي أنه، شهد حجة الوداع مع رسول الله صلى الله عليه وسلم فحمد الله وأثنى عليه وذكر ووعظ ثم قال ‏\"‏ أى يوم أحرم أى يوم أحرم أى يوم أحرم ‏\"‏ ‏.‏ قال فقال الناس يوم الحج الأكبر يا رسول الله ‏.‏ قال ‏\"‏ فإن دماءكم وأموالكم وأعراضكم عليكم حرام كحرمة يومكم هذا في بلدكم هذا في شهركم هذا ألا لا يجني جان إلا على نفسه ولا يجني والد على ولده ولا ولد على والده ألا إن المسلم أخو المسلم فليس يحل لمسلم من أخيه شيء إلا ما أحل من نفسه ألا وإن كل ربا في الجاهلية موضوع لكم رءوس أموالكم لا تظلمون ولا تظلمون غير ربا العباس بن عبد المطلب فإنه موضوع كله ألا وإن كل دم كان في الجاهلية موضوع وأول دم أضع من دماء الجاهلية دم الحارث بن عبد المطلب كان مسترضعا في بني ليث فقتلته هذيل ألا واستوصوا بالنساء خيرا فإنما هن عوان عندكم ليس تملكون منهن شيئا غير ذلك إلا أن يأتين بفاحشة مبينة فإن فعلن فاهجروهن في المضاجع واضربوهن ضربا غير مبرح فإن أطعنكم فلا تبغوا عليهن سبيلا ألا إن لكم على نسائكم حقا ولنسائكم عليكم حقا فأما حقكم على نسائكم فلا يوطئن فرشكم من تكرهون ولا يأذن في بيوتكم من تكرهون ألا وإن حقهن عليكم أن تحسنوا إليهن في كسوتهن وطعامهن ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد رواه أبو الأحوص عن شبيب بن غرقدة ‏.‏",
      "text_en": " Narrated Sulaiman bin 'Amr bin Al-Ahwas:                     \"My father narrated to me that he attended the Farewell Hajj with the Messenger of Allah (ﷺ). He (ﷺ) expressed his gratitude to Allah and praised Him, and reminded and exhorted, then he said: 'Which day is most sacred? Which day is most sacred? Which day is most sacred?' He said: \"So the people said: 'The day of Al-Hajj Al-Akbar O Messenger of Allah!' So he said: 'Indeed, your blood, your wealth, your honor, is as sacred for you as the sacredness of this day of yours, in this city of yours, in this month of yours. Behold! None commits a crime but against himself, none offends a father for a son, nor a son for a father. Behold! Indeed the Muslim is the brother of the Muslim, so it is not lawful for the Muslim to do anything to his brother, which is not lawful to be done to himself. Behold! All Riba from Jahiliyyah is invalid, for you is the principle of your wealth, but your are not to wrong nor be wronged - except in the case of Riba of Al-'Abbas bin 'Abdul-Muttalib - otherwise it is all invalid. Behold! All retribution regarding cases of blood during Jahiliyyah are invalid. The first case of blood retribution invalidated among those of Jahiliyyah, is the blood of Al-Harith bin 'Abdul-Muttalib who was nursed among Banu Laith and killed by Hudhail. Behold! I order you to treat women well, for they are but like captives with you, you have no sovereignty beyond this over them, unless they manifest lewdness. If they do that, then abandon their beds, and beat them with a beating that is not painful. Then if they obey you, then there is no cause for you against them beyond that. Behold! There are rights for you upon your women, and rights for your women upon you. As for your rights upon them,then they are not to allow anyone on your bedding whom you dislike, nor to permit anyone whom you dislike in your homes. Behold! Indeed their rights upon you are that you treat them well in clothing them and feeding them.'\"",
      "chain": [
        "30115",
        "20315",
        "20320",
        "11430",
        "19868"
      ]
    },
    {
      "hadith_no": "1924",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الحسين بن علي، عن زائدة، عن شبيب بن غرقدة البارقي، عن سليمان بن عمرو بن الأحوص، حدثني أبي أنه، شهد حجة الوداع مع رسول الله  صلى الله عليه وسلم  فحمد الله وأثنى عليه وذكر ووعظ ثم قال ‏\"‏ استوصوا بالنساء خيرا فإنما هن عندكم عوان ‏.‏ ليس تملكون منهن شيئا غير ذلك إلا أن يأتين بفاحشة مبينة فإن فعلن فاهجروهن في المضاجع واضربوهن ضربا غير مبرح فإن أطعنكم فلا تبغوا عليهن سبيلا إن لكم من نسائكم حقا ولنسائكم عليكم حقا فأما حقكم على نسائكم فلا يوطئن فرشكم من تكرهون ولا يأذن في بيوتكم لمن تكرهون ألا وحقهن عليكم أن تحسنوا إليهن في كسوتهن وطعامهن ‏\"‏ ‏.‏",
      "text_en": " It was narrated that:                     Sulaiman bin Amr bin Ahwas said: “My father told me that he was present on the Farewell pilgrimage with the Messenger of Allah. He praised and glorified Allah, and reminder and exhorted (the people). The he said: 'I enjoin good treatment of women, for they are prisoners with you, and you have no right to treat them otherwise, unless they commit clear indecency. If they do that, then forsake them in their beds and hit them, but without causing injury or leaving a mark if they obey you, then do not seek means of annoyance against them. You have rights over your women and you women have rights over you. Your rights over you women are that they are not to allow anyone whom you dislike on treat on your bedding (furniture), not allow anyone whom you dislike to enter your houses. And their right over you are that should treat them kindly with regard to their clothing and food.' ”",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11430",
        "19868"
      ]
    },
    {
      "hadith_no": "2771",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو الأحوص، عن شبيب بن غرقدة، عن سليمان بن عمرو بن الأحوص، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم يقول في حجة الوداع ‏\"‏ ألا لا يجني جان إلا على نفسه لا يجني والد على ولده ولا مولود على والده ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sulaiman bin Amr bin Ahwas that his father said:                     I heard the Messenger of Allah (ﷺ) saying during the Farewell pilgrimage: “No criminal commits a crime but he brings. (the punishment for that) upon himself. No father can bring punishment upon his son by his crime, and no son can bring punishment upon his father.”",
      "chain": [
        "30201",
        "20327",
        "11430",
        "19868"
      ]
    },
    {
      "hadith_no": "3143",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن يزيد بن أبي زياد، عن سليمان بن عمرو بن الأحوص، عن أمه، قالت رأيت النبي  صلى الله عليه وسلم  يوم النحر عند جمرة العقبة وهو راكب على بغلة فقال ‏\"‏ يا أيها الناس إذا رميتم الجمرة فارموا بمثل حصى الخذف ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Sulaiman bin ‘Amr bin Ahwas that his mothersaid:                      “Isaw the Prophet (saw0 on the Day of Sacrifice, at ‘AqabahPillar,riding a mule. He said: ‘O people! When you stone the Pillar,throwsmall pebbles.’”",
      "chain": [
        "30201",
        "20345",
        "10844",
        "19868"
      ]
    },
    {
      "hadith_no": "3146",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن يزيد بن أبي زياد، عن سليمان بن عمرو بن الأحوص، عن أمه، قالت رأيت النبي  صلى الله عليه وسلم  يوم النحر عند جمرة العقبة استبطن الوادي فرمى الجمرة بسبع حصيات يكبر مع كل حصاة ثم انصرف ‏.‏",
      "text_en": " It wasnarrated from Sulaiman bin ‘Amr bin Ahwas that his mothersaid:                      “Isaw the Prophet (ﷺ) on the Day of Sacrifice, at ‘AqabahPillar.He went to the interior of the valley and threw seven pebbles,sayingTakbir with each pebble, then he departed.”",
      "chain": [
        "30201",
        "20345",
        "10844",
        "19868"
      ]
    },
    {
      "hadith_no": "3147",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن يزيد بن أبي زياد، عن سليمان بن عمرو بن الأحوص، عن أم جندب، عن النبي  صلى الله عليه وسلم  بنحوه ‏.‏",
      "text_en": "",
      "chain": [
        "30201",
        "20334",
        "10844",
        "19868"
      ]
    },
    {
      "hadith_no": "3171",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وهناد بن السري، قالا حدثنا أبو الأحوص، عن شبيب بن غرقدة، عن سليمان بن عمرو بن الأحوص، عن أبيه، قال سمعت النبي  صلى الله عليه وسلم  يقول في حجة الوداع ‏\"‏ يا أيها الناس ألا أى يوم أحرم ‏\"‏ ‏.‏ ثلاث مرات قالوا يوم الحج الأكبر ‏.‏ قال ‏\"‏ فإن دماءكم وأموالكم وأعراضكم بينكم حرام كحرمة يومكم هذا في شهركم هذا في بلدكم هذا ألا لا يجني جان إلا على نفسه ولا يجني والد على ولده ولا مولود على والده ‏.‏ ألا إن الشيطان قد أيس أن يعبد في بلدكم هذا أبدا ولكن سيكون له طاعة في بعض ما تحتقرون من أعمالكم فيرضى بها ألا وكل دم من دماء الجاهلية موضوع وأول ما أضع منها دم الحارث بن عبد المطلب - كان مسترضعا في بني ليث فقتلته هذيل - ألا وإن كل ربا من ربا الجاهلية موضوع لكم رءوس أموالكم لا تظلمون ولا تظلمون ألا يا أمتاه هل بلغت ‏\"‏ ‏.‏ ثلاث مرات قالوا نعم ‏.‏ قال ‏\"‏ اللهم اشهد ‏\"‏ ‏.‏ ثلاث مرات ‏.‏",
      "text_en": " It wasnarrated from Sulaiman bin ‘Amr bin Ahwas that his fathersaid:                      “Iheard the Prophet (ﷺ) say, during the Farewell Pilgrimage:‘Opeople! Which day is the most sacred?’ three times. They said: ‘Theday of the greatest Hajj.’ He said: ‘Your blood and your wealthandyour honor are sacred to one another, as sacred as this day ofyours,in this land of your. No sinner commits a sin but it isagainsthimself. No father is to be punished for the sins of hischild, and nochild is to be punished for the sins of his father.Satan hasdespaired of ever being worshipping in this land of yours,but he willbe obeyed in some matters which you regard asinsignificant, and hewill be content with that. All the blood feudsof the Ignorance daysare abolished, and the first of them that Iabolish is the blood feudof Harith bin ‘Abdul-Muttalib, who wasnursed among Banu Laith andkilled by Hudhail. All the usuries of theIgnorance days areabolished, but you will have your capital. Do notwrong others and youwill not be wronged. O my nation, have Iconveyed (the message)?’ (Heasked this) three times. They said:‘Yes.’ He said: ‘O Allah, bearwitness!’ three times.”",
      "chain": [
        "30201",
        "30480",
        "20327",
        "11430",
        "19868"
      ]
    },
    {
      "hadith_no": "3662",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن يزيد بن أبي زياد، عن سليمان بن عمرو بن الأحوص، عن أم جندب، قالت رأيت رسول الله  صلى الله عليه وسلم  رمى جمرة العقبة من بطن الوادي يوم النحر ثم انصرف وتبعته امرأة من خثعم ومعها صبي لها به بلاء لا يتكلم فقالت يا رسول الله إن هذا ابني وبقية أهلي وإن به بلاء لا يتكلم ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ ائتوني بشىء من ماء ‏\"‏ ‏.‏ فأتي بماء فغسل يديه ومضمض فاه ثم أعطاها فقال ‏\"‏ اسقيه منه وصبي عليه منه واستشفي الله له ‏\"‏ ‏.‏ قالت فلقيت المرأة فقلت لو وهبت لي منه ‏.‏ فقالت إنما هو لهذا المبتلى ‏.‏ قالت فلقيت المرأة من الحول فسألتها عن الغلام فقالت برأ وعقل عقلا ليس كعقول الناس ‏.‏",
      "text_en": " It wasnarrated from ‘Ali that the Messenger of Allah (ﷺ) said:                     “Thebest remedy is the Qur’an.”",
      "chain": [
        "30201",
        "20334",
        "10844",
        "19868"
      ]
    }
  ],
  "total_hadiths": 12
}