{
  "id": "1986",
  "name": "Rafi' bin Khadij bin Rafi' ( رافع بن خديج بن رافع الأنصاري ( رضي الله عنه",
  "full_name": "Rafi' bin Khadij bin Rafi' ( رافع بن خديج بن رافع الأنصاري ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "73",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ ع  -  صحابي ]"
    ],
    "tags": [
      "Ansar",
      "Aws",
      "B.Haritha",
      "Uhud",
      "Khandaq",
      "Ridwan"
    ]
  },
  "parents": [
    {
      "id": "1985",
      "name": "Khadij bin Rafi' ( خديج بن رافع بن عدي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1571",
      "name": "Halima/Jamila bint 'Urwa bin Mas'ud ( حليمة/ جميلة بنت عروة ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "1960",
      "name": "Umama bint Khadij bin Rafi' ( أمامة بنت خديج الأنصارية ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [
    {
      "id": "12821",
      "name": "'Abdur Rahman bin Rafa'y bin Khdyj عبد الرحمن بن رافع بن خديج الأنصار",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "12670",
      "name": "Ibrahim bin Rafi' bin Khadayj إبراهيم بن رافع بن خديج الأنصاري",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11506",
      "name": "Rfa'h bin Rafa'i bin Khdyj رفاعة بن رافع بن خديج",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12842",
      "name": "'Abdul Hameed bin Rafa'y bin Khdyj عبد الحميد بن رافع بن خديج الأنصار",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "12818",
      "name": "'Ubaidullah bin Rafa'y bin Khdyj عبيد الله بن رافع بن خديج",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "12907",
      "name": "Muhammad bin Rafa'y bin Khdyj محمد بن رافع بن خديج الأنصاري",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "12795",
      "name": "'Abdullah bin Rafi'a bin Khadayj عبد الله بن رافع بن خديج الأنصاري",
      "grade": "Follower(Tabi')"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "1985",
      "name": "Khadij bin Rafi' ( خديج بن رافع بن عدي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1987",
      "name": "Zuhayr bin Rafi' ( ظهير بن رافع ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "12821",
      "name": "'Abdur Rahman bin Rafa'y bin Khdyj عبد الرحمن بن رافع بن خديج الأنصار",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11506",
      "name": "Rfa'h bin Rafa'i bin Khdyj رفاعة بن رافع بن خديج",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "12555",
      "name": "Hryr bin 'Abdur Rahman bin Rafa'i هرير بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11527",
      "name": "Ata'a bin S'hyb al-Ansari عطاء بن صهيب الأنصاري أبو النجاشي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "3048",
      "name": "al-Sa'ib bin Yazid bin Akht Namr ( السائب بن يزيد بن أخت النمر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11005",
      "name": "Sulayman ibn Yasar سليمان بن يسار مولى ميمونة بنت الحارث",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11503",
      "name": "Hnzlh bin Qays bin 'Amr حنظلة بن قيس بن عمرو",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11059",
      "name": "Nafi' bin Jubayr bin Mut'im نافع بن جبير بن مطعم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11222",
      "name": "Muhammad bin Yahya bin Hiban محمد بن يحيى بن حبان",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10933",
      "name": "'Abdullah bin 'Amr bin 'Uthman عبد الله بن عمرو بن عثمان المطرف",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "559",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن مهران، قال حدثنا الوليد، قال حدثنا الأوزاعي، قال حدثنا أبو النجاشي، صهيب مولى رافع بن خديج قال سمعت رافع بن خديج، يقول كنا نصلي المغرب مع النبي صلى الله عليه وسلم فينصرف أحدنا وإنه ليبصر مواقع نبله‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     We used to offer the Maghrib prayer with the Prophet and after finishing the prayer one of us may go away and could still see as Par as the spots where one's arrow might reach when shot by a bow.",
      "chain": [
        "30383",
        "20733",
        "20024",
        "1986"
      ]
    },
    {
      "hadith_no": "2327",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد، أخبرنا عبد الله، أخبرنا يحيى بن سعيد، عن حنظلة بن قيس الأنصاري، سمع رافع بن خديج، قال كنا أكثر أهل المدينة مزدرعا، كنا نكري الأرض بالناحية منها مسمى لسيد الأرض، قال فمما يصاب ذلك وتسلم الأرض، ومما يصاب الأرض ويسلم ذلك، فنهينا، وأما الذهب والورق فلم يكن يومئذ‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     We worked on farms more than anybody else in Medina. We used to rent the land at the yield of specific delimited portion of it to be given to the landlord. Sometimes the vegetation of that portion was affected by blights etc., while the rest remained safe and vice versa, so the Prophet forbade this practice. At that time gold or silver were not used (for renting the land). If they provided the seeds, they would get so-and-so much.",
      "chain": [
        "30213",
        "20025",
        "11062",
        "11503",
        "1986"
      ]
    },
    {
      "hadith_no": "2339",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا الأوزاعي، عن أبي النجاشي، مولى رافع بن خديج سمعت رافع بن خديج بن رافع، عن عمه، ظهير بن رافع قال ظهير لقد نهانا رسول الله صلى الله عليه وسلم عن أمر كان بنا رافقا‏.‏ قلت ما قال رسول الله صلى الله عليه وسلم فهو حق‏.‏ قال دعاني رسول الله صلى الله عليه وسلم قال ‏\"‏ ما تصنعون بمحاقلكم ‏\"‏‏.‏ قلت نؤاجرها على الربع وعلى الأوسق من التمر والشعير‏.‏ قال ‏\"‏ لا تفعلوا ازرعوها أو أزرعوها أو أمسكوها ‏\"‏‏.‏ قال رافع قلت سمعا وطاعة‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     My uncle Zuhair said, \"Allah's Apostle forbade us to do a thing which was a source of help to us.\" I said, \"Whatever Allah's Apostle said was right.\" He said, \"Allah's Apostle sent for me and asked, 'What are you doing with your farms?' I replied, 'We give our farms on rent on the basis that we get the yield produced at the banks of the water streams (rivers) for the rent, or rent it for some Wasqs of barley and dates.' Allah's Apostle said, 'Do not do so, but cultivate (the land) yourselves or let it be cultivated by others gratis, or keep it uncultivated.' I said, 'We hear and obey.'",
      "chain": [
        "30118",
        "20025",
        "20024",
        "1986"
      ]
    },
    {
      "hadith_no": "2347",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا عمرو بن خالد، حدثنا الليث، عن ربيعة بن أبي عبد الرحمن، عن حنظلة بن قيس، عن رافع بن خديج، قال حدثني عماى، أنهم كانوا يكرون الأرض على عهد النبي صلى الله عليه وسلم بما ينبت على الأربعاء أو شىء يستثنيه صاحب الأرض فنهى النبي صلى الله عليه وسلم عن ذلك فقلت لرافع فكيف هي بالدينار والدرهم فقال رافع ليس بها بأس بالدينار والدرهم‏.‏ وقال الليث وكان الذي نهي عن ذلك ما لو نظر فيه ذوو الفهم بالحلال والحرام لم يجيزوه، لما فيه من المخاطرة‏.‏",
      "text_en": " Narrated Hanzla bin Qais:                     Rafi` bin Khadij said, \"My two uncles told me that they (i.e. the companions of the Prophet) used to rent the land in the lifetime of the Prophet for the yield on the banks of water streams (rivers) or for a portion of the yield stipulated by the owner of the land. The Prophet forbade it.\" I said to Rafi`, \"What about renting the land for Dinars and Dirhams?\" He replied, \"There is no harm in renting for Dinars- Dirhams. Al-Laith said, \"If those who have discernment for distinguishing what is legal from what is illegal looked into what has been forbidden concerning this matter they would not permit it, for it is surrounded with dangers.\"",
      "chain": [
        "30237",
        "20023",
        "11162",
        "11503",
        "1986"
      ]
    },
    {
      "hadith_no": "2383",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا زكرياء بن يحيى، أخبرنا أبو أسامة، قال أخبرني الوليد بن كثير، قال أخبرني بشير بن يسار، مولى بني حارثة أن رافع بن خديج، وسهل بن أبي حثمة، حدثاه أن رسول الله صلى الله عليه وسلم نهى عن المزابنة بيع الثمر بالتمر، إلا أصحاب العرايا فإنه أذن لهم‏.‏ قال أبو عبد الله وقال ابن إسحاق حدثني بشير مثله‏.‏",
      "text_en": " Narrated Rafi` 'bin Khadij and Sahl bin Abi Hathma:                     Allah's Apostle forbade the sale of Muzabana, i.e. selling of fruits for fruits, except in the case of 'Araya; he allowed the owners of 'Araya such kind of sale.",
      "chain": [
        "30193",
        "20318",
        "11230",
        "11810",
        "1986",
        "1822"
      ]
    },
    {
      "hadith_no": "2485",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا الأوزاعي، حدثنا أبو النجاشي، قال سمعت رافع بن خديج  رضى الله عنه  قال كنا نصلي مع النبي صلى الله عليه وسلم العصر فننحر جزورا، فتقسم عشر قسم، فنأكل لحما نضيجا قبل أن تغرب الشمس‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     We used to offer the `Asr prayer with the Prophet and slaughter a camel, the meat of which would be divided in ten parts. We would eat the cooked meat before sunset.",
      "chain": [
        "30388",
        "20024",
        "1986"
      ]
    },
    {
      "hadith_no": "2507",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد، أخبرنا وكيع، عن سفيان، عن أبيه، عن عباية بن رفاعة، عن جده، رافع بن خديج  رضى الله عنه  قال كنا مع النبي صلى الله عليه وسلم بذي الحليفة من تهامة، فأصبنا غنما وإبلا، فعجل القوم، فأغلوا بها القدور، فجاء رسول الله صلى الله عليه وسلم فأمر بها فأكفئت، ثم عدل عشرا من الغنم بجزور، ثم إن بعيرا ند وليس في القوم إلا خيل يسيرة فرماه رجل فحبسه بسهم، فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن لهذه البهائم أوابد كأوابد الوحش، فما غلبكم منها فاصنعوا به هكذا ‏\"‏‏.‏ قال قال جدي يا رسول الله إنا نرجو  أو نخاف  أن نلقى العدو غدا وليس معنا مدى، فنذبح بالقصب فقال ‏\"‏ اعجل أو أرني، ما أنهر الدم وذكر اسم الله عليه فكلوا، ليس السن والظفر، وسأحدثكم عن ذلك، أما السن فعظم، وأما الظفر فمدى الحبشة ‏\"‏‏.‏",
      "text_en": " Narrated Abaya bin Rifaa:                     My grandfather, Rafi` bin Khadij said, \"We were in the valley of Dhul-Hulaifa of Tuhama in the company of the Prophet and had some camels and sheep (of the booty). The people hurried (in slaughtering the animals) and put their meat in the pots and started cooking. Allah's Apostle came and ordered them to upset the pots, and distributed the booty considering one camel as equal to ten sheep. One of the camels fled and the people had only a few horses, so they got worried. (The camel was chased and) a man slopped the camel by throwing an arrow at it. Allah's Apostle said, 'Some of these animals are untamed like wild animals, so if anyone of them went out of your control, then you should treat it as you have done now.' \" My grandfather said, \"O Allah's Apostle! We fear that we may meet our enemy tomorrow and we have no knives, could we slaughter the animals with reeds?\" The Prophet said, \"Yes, or you can use what would make blood flow (slaughter) and you can eat what is slaughtered and the Name of Allah is mentioned at the time of slaughtering. But don't use teeth or fingernails (in slaughtering). I will tell you why, as for teeth, they are bones, and fingernails are used by Ethiopians for slaughtering. (See Hadith 668)",
      "chain": [
        "30213",
        "20032",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "2722",
      "source": " Sahih Bukhari ",
      "chapter": "Conditions - كتاب الشروط",
      "chapter_no": "54",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا ابن عيينة، حدثنا يحيى بن سعيد، قال سمعت حنظلة الزرقي، قال سمعت رافع بن خديج  رضى الله عنه  يقول كنا أكثر الأنصار حقلا، فكنا نكري الأرض، فربما أخرجت هذه ولم تخرج ذه، فنهينا عن ذلك، ولم ننه عن الورق‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     We used to work on the fields more than the other Ansar, and we used to rent the land (for the yield of a specific portion of it). But sometimes that portion or the rest of the land did not give any yield, so we were forbidden (by the Prophet ) to follow such a system, but we were allowed to rent the land for money.",
      "chain": [
        "20357",
        "20005",
        "11062",
        "1986"
      ]
    },
    {
      "hadith_no": "3262",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثني عمرو بن عباس، حدثنا عبد الرحمن، حدثنا سفيان، عن أبيه، عن عباية بن رفاعة، قال أخبرني رافع بن خديج، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ الحمى من فور جهنم، فأبردوها عنكم بالماء ‏\"‏‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     I heard the Prophet saying, \"Fever is from the heat of the (Hell) Fire; so cool it with water.\"",
      "chain": [
        "30152",
        "20033",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "4062",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء، حدثنا جويرية، عن مالك، عن الزهري، أن سالم بن عبد الله، أخبره قال أخبر رافع بن خديج عبد الله بن عمر، أن عميه، وكانا، شهدا بدرا أخبراه أن رسول الله صلى الله عليه وسلم نهى عن كراء المزارع‏.‏ قلت لسالم فتكريها أنت قال نعم، إن رافعا أكثر على نفسه‏.‏",
      "text_en": " Narrated Az-Zuhri:                     Salim bin `Abdullah told me that Rafi` bin Khadij told `Abdullah bin `Umar that his two paternal uncles who had fought in the battle of Badr informed him that Allah's Apostle forbade the renting of fields. I said to Salim, \"Do you rent your land?\" He said, \"Yes, for Rafi` is mistaken.\"",
      "chain": [
        "30144",
        "20216",
        "20001",
        "11013",
        "11011",
        "1986"
      ]
    },
    {
      "hadith_no": "5556",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثني موسى بن إسماعيل، حدثنا أبو عوانة، عن سعيد بن مسروق، عن عباية بن رفاعة بن رافع، عن جده، رافع بن خديج قال كنا مع النبي صلى الله عليه وسلم بذي الحليفة، فأصاب الناس جوع، فأصبنا إبلا وغنما، وكان النبي صلى الله عليه وسلم في أخريات الناس، فعجلوا فنصبوا القدور، فدفع إليهم النبي صلى الله عليه وسلم فأمر بالقدور فأكفئت، ثم قسم فعدل عشرة من الغنم ببعير، فند منها بعير، وكان في القوم خيل يسيرة فطلبوه فأعياهم، فأهوى إليه رجل بسهم فحبسه الله فقال النبي صلى الله عليه وسلم ‏\"‏ إن لهذه البهائم أوابد كأوابد الوحش، فما ند عليكم فاصنعوا به هكذا ‏\"‏‏.‏ قال وقال جدي إنا لنرجو  أو نخاف  أن نلقى العدو غدا، وليس معنا مدى، أفنذبح بالقصب فقال ‏\"‏ ما أنهر الدم وذكر اسم الله عليه فكل، ليس السن والظفر، وسأخبركم عنه، أما السن عظم وأما الظفر فمدى الحبشة ‏\"‏‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     We were with the Prophet in Dhul-Hulaifa and there the people were struck with severe hunger. Then we got camels and sheep as war booty (and slaughtered them). The Prophet was behind all the people. The people hurried and fixed the cooking pots (for cooking) but the Prophet came there and ordered that the cooking pots be turned upside down. Then he distributed the animals, regarding ten sheep as equal to one camel. One of the camels ran away and there were a few horses with the people. They chased the camel but they got tired, whereupon a man shot it with an arrow whereby Allah stopped it. The Prophet said, \"Among these animals some are as wild as wild beasts, so if one of them runs away from you, treat it in this way.\" I said. \"We hope, or we are afraid that tomorrow we will meet the enemy and we have no knives, shall we slaughter (our animals) with canes?\" The Prophet said, \"If the killing tool causes blood to gush out and if Allah's Name is mentioned, eat (of the slaughterer animal). But do not slaughter with a tooth or a nail. I am telling you why: A tooth is a bone, and the nail is the knife of Ethiopians.\"",
      "chain": [
        "20040",
        "20469",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "5564",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن أبيه، عن عباية بن رفاعة، عن رافع بن خديج، قال قال النبي صلى الله عليه وسلم ‏\"‏ كل  يعني  ما أنهر الدم إلا السن والظفر ‏\"‏‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     The Prophet said, \"Eat what is slaughtered (with any instrument) that makes blood flow out, except what is slaughtered with a tooth or a nail.'",
      "chain": [
        "20351",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "5567",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا عمرو بن علي، حدثنا يحيى، حدثنا سفيان، حدثنا أبي، عن عباية بن رفاعة بن رافع بن خديج، عن رافع بن خديج، قال قلت يا رسول الله إنا لاقو العدو غدا، وليست معنا مدى فقال ‏\"‏ اعجل أو أرن ما أنهر الدم وذكر اسم الله فكل، ليس السن والظفر، وسأحدثك، أما السن فعظم، وأما الظفر فمدى الحبشة ‏\"‏‏.‏ وأصبنا نهب إبل وغنم فند منها بعير، فرماه رجل بسهم فحبسه فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن لهذه الإبل أوابد كأوابد الوحش، فإذا غلبكم منها شىء، فافعلوا به هكذا ‏\"‏‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     I said, \"O Allah's Apostle! We are going to face the enemy tomorrow and we do not have knives.\" He said, \"Hurry up (in killing the animal). If the killing tool causes blood to flow out, and if Allah's Name is mentioned, eat (of the slaughtered animal). But do not slaughter with a tooth or a nail. I will tell you why: As for the tooth, it is a bone; and as for the nail, it is the knife of Ethiopians.\" Then we got some camels and sheep as war booty, and one of those camels ran away, whereupon a man shot it with an arrow and stopped it. Allah's Apostle said, \"Of these camels there are some which are as wild as wild beasts, so if one of them (runs away and) makes you tired, treat it in this manner.\"",
      "chain": [
        "30153",
        "20031",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "5601",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا سعيد بن مسروق، عن عباية بن رفاعة، عن أبيه، عن جده، رافع بن خديج قال قلت للنبي صلى الله عليه وسلم إننا نلقى العدو غدا، وليس معنا مدى‏.‏ فقال ‏\"‏ ما أنهر الدم وذكر اسم الله فكلوا، ما لم يكن سن ولا ظفر، وسأحدثكم عن ذلك، أما السن فعظم، وأما الظفر فمدى الحبشة ‏\"‏‏.‏ وتقدم سرعان الناس فأصابوا من الغنائم والنبي صلى الله عليه وسلم في آخر الناس فنصبوا قدورا فأمر بها فأكفئت وقسم بينهم وعدل بعيرا بعشر شياه، ثم ند بعير من أوائل القوم ولم يكن معهم خيل فرماه رجل بسهم فحبسه الله‏.‏ فقال ‏\"‏ إن لهذه البهائم أوابد كأوابد الوحش فما فعل منها هذا فافعلوا مثل هذا ‏\"‏‏.‏",
      "text_en": " Narrated Rait' bin Khadij:                     I said to the Prophet, \"We will be facing the enemy tomorrow and we have no knives (for slaughtering)' He said, \"If you slaughter the animal with anything that causes its blood to flow out, and if Allah's Name is mentioned on slaughtering it, eat of it, unless the killing instrument is a tooth or nail. I will tell you why: As for the tooth, it is a bone; and as for the nail, it is the knife of Ethiopians.\" The quick ones among the people got the war booty while the Prophet was behind the people. So they placed the cooking pots on the fire, but the Prophet ordered the cooking pots to be turned upside down. Then he distributed (the war booty) among them, considering one camel as equal to ten sheep. Then a camel belonging to the first party of people ran away and they had no horses with them, so a man shot it with an arrow whereby Allah stopped it. The Prophet said, \"Of these animals there are some which are as wild as wild beasts. So, if anyone of them runs away like this, do like this (shoot it with an arrow).",
      "chain": [
        "30175",
        "20327",
        "20016",
        "11179",
        "11506",
        "1986"
      ]
    },
    {
      "hadith_no": "5602",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا ابن سلام، أخبرنا عمر بن عبيد الطنافسي، عن سعيد بن مسروق، عن عباية بن رفاعة، عن جده، رافع بن خديج  رضى الله عنه  قال كنا مع النبي صلى الله عليه وسلم في سفر فند بعير من الإبل  قال  فرماه رجل بسهم فحبسه، قال ثم قال ‏\"‏ إن لها أوابد كأوابد الوحش فما غلبكم منها فاصنعوا به هكذا ‏\"‏‏.‏ قال قلت يا رسول الله إنا نكون في المغازي والأسفار فنريد أن نذبح فلا تكون مدى قال ‏\"‏ أرن ما نهر  أو أنهر  الدم وذكر اسم الله فكل، غير السن والظفر، فإن السن عظم، والظفر مدى الحبشة ‏\"‏‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     While we were with the Prophet. on a journey, one of the camels ran away. A man shot it with an arrow and stopped it. The Prophet said, \"Of these camels some are as wild as wild beasts, so if one of them runs away and you cannot catch it, then do like this (shoot it with an arrow).\" I said, \"O Allah's Apostle! Sometimes when we are in battles or on a journey we want to slaughter (animals) but we have no knives.\" He said, \"Listen! If you slaughter the animal with anything that causes its blood to flow out, and if Allah's Name is mentioned on slaughtering it, eat of it, provided that the slaughtering instrument is not a tooth or a nail, as the tooth is a bone and the nail is the knife of Ethiopians.\"",
      "chain": [
        "30376",
        "20346",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "5785",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا سعيد بن مسروق، عن عباية بن رفاعة، عن جده، رافع بن خديج قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ الحمى من فوح جهنم، فابردوها بالماء ‏\"‏‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     I heard Allah's Apostle saying, \"Fever is from the heat of Hell, so abate fever with water.\"",
      "chain": [
        "30175",
        "20327",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "6212",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، هو ابن زيد  عن يحيى بن سعيد، عن بشير بن يسار، مولى الأنصار عن رافع بن خديج، وسهل بن أبي حثمة، أنهما حدثاه أن عبد الله بن سهل ومحيصة بن مسعود أتيا خيبر فتفرقا في النخل، فقتل عبد الله بن سهل، فجاء عبد الرحمن بن سهل وحويصة ومحيصة ابنا مسعود إلى النبي صلى الله عليه وسلم فتكلموا في أمر صاحبهم فبدأ عبد الرحمن، وكان أصغر القوم فقال النبي صلى الله عليه وسلم ‏\"‏ كبر الكبر ‏\"‏‏.‏  قال يحيى ليلي الكلام الأكبر  فتكلموا في أمر صاحبهم فقال النبي صلى الله عليه وسلم ‏\"‏ أتستحقون قتيلكم  أو قال صاحبكم  بأيمان خمسين منكم ‏\"‏‏.‏ قالوا يا رسول الله أمر لم نره‏.‏ قال ‏\"‏ فتبرئكم يهود في أيمان خمسين منهم ‏\"‏‏.‏ قالوا يا رسول الله قوم كفار‏.‏ فوداهم رسول الله صلى الله عليه وسلم من قبله‏.‏ قال سهل فأدركت ناقة من تلك الإبل، فدخلت مربدا لهم فركضتني برجلها‏.‏",
      "text_en": " Narrated Rafi` bin Khadij and Sahl bin Abu Hathma:                     `Abdullah bin Sahl and Muhaiyisa bin Mas`ud went to Khaibar and they dispersed in the gardens of the date-palm trees. `Abdullah bin Sahl was murdered. Then `Abdur-Rahman bin Sahl, Huwaiyisa and Muhaiyisa, the two sons of Mas`ud, came to the Prophet and spoke about the case of their (murdered) friend. `Abdur-Rahman who was the youngest of them all, started talking. The Prophet said, \"Let the older (among you) speak first.\" So they spoke about the case of their (murdered) friend. The Prophet said, \"Will fifty of you take an oath whereby you will have the right to receive the blood money of your murdered man,\" (or said, \"..your companion\"). They said, \"O Allah's Apostle! The murder was a thing we did not witness.\" The Prophet said, \"Then the Jews will release you from the oath, if fifty of them (the Jews) should take an oath to contradict your claim.\" They said, \"O Allah's Apostle! They are disbelievers (and they will take a false oath).\" Then Allah's Apostle himself paid the blood money to them.",
      "chain": [
        "20193",
        "20022",
        "20031",
        "11810",
        "1986"
      ]
    },
    {
      "hadith_no": "1446",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن مهران الرازي، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، عن أبي النجاشي، قال سمعت رافع بن خديج، يقول كنا نصلي العصر مع رسول الله صلى الله عليه وسلم ثم تنحر الجزور فتقسم عشر قسم ثم تطبخ فنأكل لحما نضيجا قبل مغيب الشمس ‏.‏",
      "text_en": " Rafi' b. Khadij reported:                      We used to say the afternoon prayer with the Messenger of Allah (may peace be upon him), and then the camel was slaughtered and ten parts of it were distributed; then it was cooked and then we ate this cooked meat before the sinking of the sun.",
      "chain": [
        "30383",
        "20733",
        "20024",
        "1986"
      ]
    },
    {
      "hadith_no": "1473",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا محمد بن مهران الرازي، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، حدثني أبو النجاشي، قال سمعت رافع بن خديج، يقول كنا نصلي المغرب مع رسول الله صلى الله عليه وسلم فينصرف أحدنا وإنه ليبصر مواقع نبله ‏.‏",
      "text_en": " Rafi' b. Khadij reported:                      We used to observe the evening prayer with the Messenger of Allah (may peace be upon him) and then one of us would go away and he could see the (distant) place where his arrow would fall.",
      "chain": [
        "30383",
        "20733",
        "20024",
        "1986"
      ]
    },
    {
      "hadith_no": "1474",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا شعيب بن إسحاق الدمشقي، حدثنا الأوزاعي، حدثني أبو النجاشي، حدثني رافع بن خديج، قال كنا نصلي المغرب ‏.‏ بنحوه ‏.‏",
      "text_en": " A hadith like this, i. e.\" We used to observe evening prayer....\" so on and so forth, has been narrated by Rafi' b. Khadij by another chain of transmitters.",
      "chain": [
        "30021",
        "20239",
        "20024",
        "1986"
      ]
    },
    {
      "hadith_no": "2490",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن أبي عمر المكي، حدثنا سفيان، عن عمر بن سعيد بن مسروق، عن أبيه، عن عباية بن رفاعة، عن رافع بن خديج، قال أعطى رسول الله صلى الله عليه وسلم أبا سفيان بن حرب وصفوان بن أمية وعيينة بن حصن والأقرع بن حابس كل إنسان منهم مائة من الإبل وأعطى عباس بن مرداس دون ذلك ‏.‏ فقال عباس بن مرداس أتجعل نهبي ونهب العبيد بين عيينة والأقرع فما كان بدر ولا حابس يفوقان مرداس في المجمع وما كنت دون امرئ منهما ومن تخفض اليوم لا يرفع قال فأتم له رسول الله صلى الله عليه وسلم مائة ‏.‏",
      "text_en": " Rafi' b. Khadij reported that the Messenger of Allah; (may peace be upon him) gave to Abu Sufyan b. Harb and Saf wan. b. Umayya and 'Uyaina b. Hisn and Aqra' b. Habis, i. e. to every one of these persons, one hundred of camels, and gave to 'Abbas b. Mirdas less than this number. Upon this 'Abbas b. Mirdis said:                      You allot the share of my booty and that of my horse between 'Uyaina and Aqra'. Both Uyaina and Aqra' are in no way more eminent than Mirdas (my father) in the assembly. I am in no way inferior to any one of these persons. And he who is let downtoday would not be elevated. He (the narrator) said: The Messenger of Allah (may peace be upon him) then complet- ed one hundred camels for him.",
      "chain": [
        "20012",
        "10652",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "3381",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا بكر، - يعني ابن مضر - عن ابن الهاد، عن أبي، بكر بن محمد عن عبد الله بن عمرو بن عثمان، عن رافع بن خديج، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن إبراهيم حرم مكة وإني أحرم ما بين لابتيها ‏\"‏ ‏.‏ يريد المدينة ‏.‏",
      "text_en": " Rafi' b. Khadij reported Allah's Messenger (may peace be upon him) as saying:                      Ibrahim declared Mecca as sacred and I declare sacred the area between its two stony grounds (lava lands by which he meant Medina).",
      "chain": [
        "30367",
        "20374",
        "11234",
        "10933",
        "1986"
      ]
    },
    {
      "hadith_no": "3972",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وحسن الحلواني، قالا حدثنا أبو أسامة، عن الوليد، بن كثير حدثني بشير بن يسار، مولى بني حارثة أن رافع بن خديج، وسهل بن أبي حثمة، حدثاه أن رسول الله صلى الله عليه وسلم نهى عن المزابنة الثمر بالتمر إلا أصحاب العرايا فإنه قد أذن لهم ‏.‏",
      "text_en": " Sahl b. Abu Hathma reported Allah's Messenger (may peace be upon him) having forbidden Muzabana, i. e. exchange of fresh dates with dry dates. except in case of those to whom donations of some trees have been made. It is for them that concession has been given.",
      "chain": [
        "30201",
        "130115",
        "20318",
        "11230",
        "11810",
        "1986",
        "1822"
      ]
    },
    {
      "hadith_no": "4024",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا حسين، - يعني ابن حسن بن يسار - حدثنا ابن، عون عن نافع، أن ابن عمر، كان يأجر الأرض - قال - فنبئ حديثا عن رافع بن خديج - قال - فانطلق بي معه إليه - قال - فذكر عن بعض عمومته ذكر فيه عن النبي صلى الله عليه وسلم أنه نهى عن كراء الأرض ‏.‏ قال فتركه ابن عمر فلم يأجره ‏.‏",
      "text_en": "  Nafi, reported that Ibn Umar (Allah be pleased with them) used to rent the land, and that he was conveyed the hadith transmitted on the authority of Rafi b. Khadij. He (the narrator) said:                      He then went to him along with me. He (Rafi) narrated from some of his uncles in which it was mentioned that Allah's Apostle (may peace be upon him) forbade the renting of land. Ibn 'Umar (Allah be pleased with them) then abandoned this practice of renting.",
      "chain": [
        "30170",
        "11071",
        "11014",
        "18",
        "1986"
      ]
    },
    {
      "hadith_no": "4026",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثني عبد الملك بن شعيب بن الليث بن سعد، حدثني أبي، عن جدي، حدثني عقيل بن خالد، عن ابن شهاب، أنه قال أخبرني سالم بن عبد الله، أن عبد الله بن عمر، كان يكري أرضيه حتى بلغه أن رافع بن خديج الأنصاري كان ينهى عن كراء الأرض فلقيه عبد الله فقال يا ابن خديج ماذا تحدث عن رسول الله صلى الله عليه وسلم في كراء الأرض قال رافع بن خديج لعبد الله سمعت عمى - وكانا قد شهدا بدرا - يحدثان أهل الدار أن رسول الله صلى الله عليه وسلم نهى عن كراء الأرض ‏.‏ قال عبد الله لقد كنت أعلم في عهد رسول الله صلى الله عليه وسلم أن الأرض تكرى ثم خشي عبد الله أن يكون رسول الله صلى الله عليه وسلم أحدث في ذلك شيئا لم يكن علمه فترك كراء الأرض ‏.‏",
      "text_en": " Salim b. Abdullah reported that AbduUah b. Umar (Allah be pleased with them) used to give land on rent until (this news) reached him that Rafi b. Khadij Ansari used to forbid the renting of land. Abdullah met him and said:                      Ibn Khadij, what is this that you narrate from Allah's Messenger (may peace be upon him) pertaining to renting of land? Rafi b. Khadij said to Abdullah: I heard it from two uncles of mine and they had participated in the Battle of Badr who narrated to the members of the family that Allah's Messenger (may peace be upon him) forbade the renting of land. Abdullah said: I knew it that the land was rented during the lifetime of Allah's Messenger (may peace be upon him). Abdullah then apprehended that Allah's Messenger (may peace be upon him) might have said something new in this connection (in regard to prohibition of renting) which I failed to know. So he abandoned the renting of land.",
      "chain": [
        "11207",
        "11013",
        "11011",
        "18",
        "1986"
      ]
    },
    {
      "hadith_no": "4027",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثني علي بن حجر السعدي، ويعقوب بن إبراهيم، قالا حدثنا إسماعيل، - وهو ابن علية - عن أيوب، عن يعلى بن حكيم، عن سليمان بن يسار، عن رافع بن خديج، قال كنا نحاقل الأرض على عهد رسول الله صلى الله عليه وسلم فنكريها بالثلث والربع والطعام المسمى فجاءنا ذات يوم رجل من عمومتي فقال نهانا رسول الله صلى الله عليه وسلم عن أمر كان لنا نافعا وطواعية الله ورسوله أنفع لنا نهانا أن نحاقل بالأرض فنكريها على الثلث والربع والطعام المسمى وأمر رب الأرض أن يزرعها أو يزرعها وكره كراءها وما سوى ذلك ‏.‏",
      "text_en": " Rafi b. Khadij (Allah be pleased with him) reported:                      We used to give on rent land during the lifetime of Allah's Messenger (may peace be upon him). We rented it on the share of one-third or one-fourth of the (produce) along with a definite quantity of corn. One day a person from among my uncles came to us and said: Allah's Messenger (may peace be upon him) forbade us this act which was a source of benefit to us, but the obedience to Allah and to His Messenger (may peace be upon him) is more beneficial to us. He forbade us that we should rent land with one-third or one-fourth of (the produce) and the corn of a measure, and he commanded the owner of land that he should cultivate it or let it be cultivated by other (persons) but he showed disapproval of renting it or anything besides it.",
      "chain": [
        "20387",
        "20184",
        "20208",
        "11015",
        "11567",
        "11005",
        "1986"
      ]
    },
    {
      "hadith_no": "4028",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثناه يحيى بن يحيى، أخبرنا حماد بن زيد، عن أيوب، قال كتب إلى يعلى بن حكيم قال سمعت سليمان بن يسار، يحدث عن رافع بن خديج، قال كنا نحاقل بالأرض فنكريها على الثلث والربع ‏.‏ ثم ذكر بمثل حديث ابن علية ‏.‏",
      "text_en": " Rafi b. Khadij (Allah be pleased with him) reported:                      We used to give land on rent, and we rented it on one-third or one-fourth share. The rest of the hadith is the same.",
      "chain": [
        "30399",
        "20022",
        "11015",
        "11005",
        "1986"
      ]
    },
    {
      "hadith_no": "4030",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنيه أبو الطاهر، أخبرنا ابن وهب، أخبرني جرير بن حازم، عن يعلى بن، حكيم بهذا الإسناد عن رافع بن خديج، عن النبي صلى الله عليه وسلم ولم يقل عن بعض عمومته ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Rafi' b. Khadij with the same chain of transmitters, but in it no mention is made of some of his uncles.",
      "chain": [
        "20029",
        "11272",
        "11567",
        "1986"
      ]
    },
    {
      "hadith_no": "4033",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا يحيى بن يحيى، قال قرأت على مالك عن ربيعة بن أبي عبد الرحمن، عن حنظلة بن قيس، أنه سأل رافع بن خديج عن كراء الأرض، فقال نهى رسول الله صلى الله عليه وسلم عن كراء الأرض قال فقلت أبالذهب والورق فقال أما بالذهب والورق فلا بأس به ‏.‏",
      "text_en": " Hanzala b. Qais reported that he asked Rafi b. Khadij (Allah be pleased with him) about renting of land, whereupon he said:                      Allah's Messenger (may peace be upon him) forbade the renting of land. I said: Is it forbidden (even if it is paid) in gold (dinar) and silver (dirham)? Thereupon he said: If it is paid in gold and silver, there is no harm in it.",
      "chain": [
        "30399",
        "11162",
        "11503",
        "1986"
      ]
    },
    {
      "hadith_no": "4034",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا إسحاق، أخبرنا عيسى بن يونس، حدثنا الأوزاعي، عن ربيعة بن أبي، عبد الرحمن حدثني حنظلة بن قيس الأنصاري، قال سألت رافع بن خديج عن كراء الأرض، بالذهب والورق فقال لا بأس به إنما كان الناس يؤاجرون على عهد النبي صلى الله عليه وسلم على الماذيانات وأقبال الجداول وأشياء من الزرع فيهلك هذا ويسلم هذا ويسلم هذا ويهلك هذا فلم يكن للناس كراء إلا هذا فلذلك زجر عنه ‏.‏ فأما شىء معلوم مضمون فلا بأس به ‏.‏",
      "text_en": " Hanzala b. Qais al-Ansri reported:                      I asked Rafi' b. Khadij about the renting of land for gold and silver, whereupon he said: There is no harm in it for the people let out land situated near canals and at the ends of the streamlets or portion of fields. (But it so happened) that at times this was destroyed and that was saved. whereas (on other occasions) this portion was saved and the other was destroyed and thus no rent was payable to the people (who let out lands) but for this one (which was saved). It was due to this that he (the Holy Prophet) prohibited it. But if there is something definite and reliable (e. g. money). there is no harm in it.",
      "chain": [
        "30312",
        "20347",
        "20024",
        "11162",
        "11503",
        "1986"
      ]
    },
    {
      "hadith_no": "4035",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا عمرو الناقد، حدثنا سفيان بن عيينة، عن يحيى بن سعيد، عن حنظلة، الزرقي أنه سمع رافع بن خديج، يقول كنا أكثر الأنصار حقلا - قال - كنا نكري الأرض على أن لنا هذه ولهم هذه فربما أخرجت هذه ولم تخرج هذه فنهانا عن ذلك وأما الورق فلم ينهنا ‏.‏",
      "text_en": " Hanzala reported that he heard Rafi' b. Khadij (Allah be pleased with him) say:                      We were the major agriculturists of the Ansar and so we let out land (saying): The produce of this (part of land) would be ours and (the produce) of that would be theirs. But it so happened that at times this (land) gave harvest, but the other one produced nothing. So he (the Holy Prophet) forbade this. But so far as the payment in silver (dirham, a coin) is concerned, he did not forbid.",
      "chain": [
        "30263",
        "20005",
        "11062",
        "1986"
      ]
    },
    {
      "hadith_no": "4094",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا يحيى بن سعيد القطان، عن محمد بن يوسف، قال سمعت السائب بن يزيد، يحدث عن رافع بن خديج، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ شر الكسب مهر البغي وثمن الكلب وكسب الحجام ‏\"‏ ‏.‏",
      "text_en": " Rafi b. Khadij (Allah be pleased with him) reported:                      I heard Allah's Apostle (may peace be upon him) as saying: The worst earning is the earning of a prostitute, the price of a dog and the earning of a cupper.",
      "chain": [
        "38487",
        "20031",
        "30388",
        "3048",
        "1986"
      ]
    },
    {
      "hadith_no": "4095",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا الوليد بن مسلم، عن الأوزاعي، عن يحيى، بن أبي كثير حدثني إبراهيم بن قارظ، عن السائب بن يزيد، حدثني رافع بن خديج، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ ثمن الكلب خبيث ومهر البغي خبيث وكسب الحجام خبيث ‏\"‏ ‏.‏",
      "text_en": " Rafi b. Khadij reported Allah'& Messenger (may peace be upon him) as saying:                      The price of a dog is evil, the earning of a prostitute is evil and the earning of a cupper is evil.",
      "chain": [
        "30123",
        "20733",
        "20024",
        "11449",
        "3048",
        "1986"
      ]
    },
    {
      "hadith_no": "4097",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا النضر بن شميل، حدثنا هشام، عن يحيى، بن أبي كثير حدثني إبراهيم بن عبد الله، عن السائب بن يزيد، حدثنا رافع بن خديج، عن  رسول الله صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Rifi' b. Khadlj through another chain of transmitters.",
      "chain": [
        "30123",
        "20291",
        "11065",
        "11449",
        "3048",
        "1986"
      ]
    },
    {
      "hadith_no": "4434",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، عن يحيى، - وهو ابن سعيد - عن بشير، بن يسار عن سهل بن أبي حثمة، - قال يحيى وحسبت قال - وعن رافع بن خديج، أنهما قالا خرج عبد الله بن سهل بن زيد ومحيصة بن مسعود بن زيد حتى إذا كانا بخيبر تفرقا في بعض ما هنالك ثم إذا محيصة يجد عبد الله بن سهل قتيلا فدفنه ثم أقبل إلى رسول الله صلى الله عليه وسلم هو وحويصة بن مسعود وعبد الرحمن بن سهل وكان أصغر القوم فذهب عبد الرحمن ليتكلم قبل صاحبيه فقال له رسول الله صلى الله عليه وسلم ‏\"‏ كبر ‏\"‏ ‏.‏ الكبر في السن فصمت فتكلم صاحباه وتكلم معهما فذكروا لرسول الله صلى الله عليه وسلم مقتل عبد الله بن سهل فقال لهم ‏\"‏ أتحلفون خمسين يمينا فتستحقون صاحبكم ‏\"‏ ‏.‏ أو ‏\"‏ قاتلكم ‏\"‏ ‏.‏ قالوا وكيف نحلف ولم نشهد قال ‏\"‏ فتبرئكم يهود بخمسين يمينا ‏\"‏ ‏.‏ قالوا وكيف نقبل أيمان قوم كفار فلما رأى ذلك رسول الله صلى الله عليه وسلم أعطى عقله ‏.‏",
      "text_en": " Sahl b. Abu Hathma and Rafi' b. Khadij reported that 'Abdullah b. Sahl b. Zaid and Muhayyisa b. Mas'ud b. Zaid went out and as they reached Khaibar they were separated. Then Muhayyisa found 'Abdullah b. Sahl having been killed. He buried him, and then came to Allah's Messenger (may peace be upon him). They were Huwayyisa b. Mas'ud and 'Abd al-Rahman b. Sahl, and he (the latter one) was the youngest of the people (those three who had come to seek an interview with the Holy Prophet) began to talk before his Companions (had spoken). Thereupon Allah's Messenger (may peace be upon him) said:                      The eldest one (eldest in regard to age should speak). So he kept quiet, and his companions (Muhayyisa and Huwayyisa) began to speak, and he ('Abd al Rahman) spoke along with them and they narrated to Allah's Messenger (may peace be upon him) the murder of 'Abdullah b. Sahl. Thereupon he said to them: Are you prepared to take fifty oaths so that you may be entitled (to blood-wit) of your companion (or your man who has murdered)? They said: How can we take an oath on a matter which we have not witnessed? He (the Holy Prophet) said: Then the Jews will exonerate themselves by fifty oaths. They said: How can we accept the oaths of people who are unbelievers? When Allah's Messenger (may peace be upon him) saw that, he himself paid his blood-wit.",
      "chain": [
        "30367",
        "20023",
        "11062",
        "11810",
        "1822",
        "1986"
      ]
    },
    {
      "hadith_no": "4435",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "وحدثني عبيد الله بن عمر القواريري، حدثنا حماد بن زيد، حدثنا يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، ورافع بن خديج، أن محيصة بن مسعود، وعبد، الله بن سهل انطلقا قبل خيبر فتفرقا في النخل فقتل عبد الله بن سهل فاتهموا اليهود فجاء أخوه عبد الرحمن وابنا عمه حويصة ومحيصة إلى النبي صلى الله عليه وسلم فتكلم عبد الرحمن في أمر أخيه وهو أصغر منهم فقال رسول الله صلى الله عليه وسلم ‏\"‏ كبر الكبر - أو قال - ليبدإ الأكبر ‏\"‏ ‏.‏ فتكلما في أمر صاحبهما فقال رسول الله صلى الله عليه وسلم ‏\"‏ يقسم خمسون منكم على رجل منهم فيدفع برمته ‏\"‏ ‏.‏ قالوا أمر لم نشهده كيف نحلف قال ‏\"‏ فتبرئكم يهود بأيمان خمسين منهم ‏\"‏ ‏.‏ قالوا يا رسول الله قوم كفار قال فوداه رسول الله صلى الله عليه وسلم من قبله ‏.‏ قال سهل فدخلت مربدا لهم يوما فركضتني ناقة من تلك الإبل ركضة برجلها ‏.‏ قال حماد هذا أو نحوه ‏.‏",
      "text_en": " Sahl. b. Abu Hathma and Rafi' b. Khadij reported that Muhayyisa b. Mas'ud and 'Abdullah b. Sahl went towards Khaibar and they separated near the palm-trees. 'Abdullah b. Sahl was killed. They accused the Jews (for this act). And there came to Allah's Apostle (may peace be upon him) his brother (the brother of the slain person) 'Abd al-Rahman and his cousins Huwayyisa and Muhayyisa; and 'Abd al-Rahman talked to him about the matter pertaining to (the murder of) his brother, and he was the youngest among them. Thereupon Allah's Messenger (may peace be upon him) said:                      Show regard for the greatness of the old, or he said: Let the eldest begin speaking. Then they (Huwayyisa and Muhayyisa) spoke about the matter of their companion (murder of their cousin, 'Abdullah b. Sahl). Thereupon Allah's Messenger (may peace be upon him) said: Let fifty (persons) among you take oath for levelling the charge (of murder) against a person amongst them, and he would be surrendered to you. They said: We have not witnessed this matter ourselves. How can we then take oath? He (the Holy Prophet) said: The Jews will exonerate themselves by the oaths of fifty of them. They said: Messenger of Allah, they are non-believing people. Thereupon Allah's Messenger (may peace be upon him) paid the blood wit for him. Sahl said: As one day I entered the fold a she-camel amongst those camels hit me with its leg.",
      "chain": [
        "30024",
        "20022",
        "20031",
        "11810",
        "1822",
        "1986",
        "1920"
      ]
    },
    {
      "hadith_no": "5204",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن المثنى العنزي، حدثنا يحيى بن سعيد، عن سفيان، حدثني أبي، عن عباية بن رفاعة بن رافع بن خديج، عن رافع بن خديج، قلت يا رسول الله إنا لاقو العدو غدا وليست معنا مدى قال صلى الله عليه وسلم ‏\"‏ أعجل أو أرني ما أنهر الدم وذكر اسم الله فكل ليس السن والظفر وسأحدثك أما السن فعظم وأما الظفر فمدى الحبشة ‏\"‏ ‏.‏ قال وأصبنا نهب إبل وغنم فند منها بعير فرماه رجل بسهم فحبسه فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن لهذه الإبل أوابد كأوابد الوحش فإذا غلبكم منها شىء فاصنعوا به هكذا ‏\"‏ ‏.‏",
      "text_en": " Rafi' b. Khadij is reported to have said:                      Allah's Messenger, we are going to encounter the enemy tomorrow, but we have no knives with us. Thereupon Allah's Messenger (may peace be upon him) said: Make haste or be careful (in making arrangements for procuring knives) which would let the blood flow (and along with it) the name of Allah is also to be recited. Then eat, but not the tooth or nail. And I am going to tell you why it is not permissible to slaughter the animal with the help of tooth and bone; and as for the nail. it is a bone, and the bone is the knife of Abyssinians. He (the narrator) said: There fell to our lot as spoils of war camels and goats, and one of the camels among them became wild. A person (amongst usl struck It with an arrow which brought it under control. whereupon Allah's Messenger (may peace be upon him) said: This camel became wild like wild animals, so if you find any animal getting wild, you do the same with that",
      "chain": [
        "30170",
        "20031",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "5205",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا وكيع، حدثنا سفيان بن سعيد بن مسروق، عن أبيه، عن عباية بن رفاعة بن رافع بن خديج، عن رافع بن خديج، قال كنا مع رسول الله صلى الله عليه وسلم بذي الحليفة من تهامة فأصبنا غنما وإبلا فعجل القوم فأغلوا بها القدور فأمر بها فكفئت ثم عدل عشرا من الغنم بجزور ‏.‏ وذكر باقي الحديث كنحو حديث يحيى بن سعيد ‏.‏",
      "text_en": " Rafi' b. Khadij reported:                      While we were with Allah's Messenger (may peace he upon him) in Dhu'I-Hulaifa in Tihama, we got hold of goats and camels. Some persons (amongst us) made haste and boiled (the flesh of goats and camels) in their earthen pots. He then commanded and these were turned over; then he equalised ten goats for a camel. The rest of the hadith is the same.",
      "chain": [
        "30123",
        "20032",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "5208",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثنا محمد بن الوليد بن عبد الحميد، حدثنا محمد بن جعفر، حدثنا شعبة، عن  سعيد بن مسروق، عن عباية بن رفاعة بن رافع، عن رافع بن خديج، أنه قال يا رسول الله إنا لاقو العدو غدا وليس معنا مدى وساق الحديث ولم يذكر فعجل القوم فأغلوا بها القدور فأمر بها فكفئت وذكر سائر القصة ‏.‏",
      "text_en": " Rafi' b. Khadij reported that he said:                      Allah's Messenger, we are going to encounter the enemy tomorrow. and we do not have large knives with us. The rest of the hadith is the same, but no mention is made of this:\" The people hastened and they boiled (flesh) in the earthen pots. He (the Holy Prophet), cammanded and these were turned over and the narrator narrated the whole event.",
      "chain": [
        "30174",
        "20173",
        "20020",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "5889",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا هناد بن السري، حدثنا أبو الأحوص، عن سعيد بن مسروق، عن عباية، بن رفاعة عن جده، رافع بن خديج قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الحمى فور من جهنم فابردوها بالماء ‏\"‏ ‏.‏",
      "text_en": " Rafi' b. Khadij reported:                      I heard Allah's messenger (may peace be upon him) as saying: The fever is due to the intense heat of the Hell, so cool it with water.",
      "chain": [
        "30480",
        "20327",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "5890",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، ومحمد بن حاتم، وأبو بكر بن نافع قالوا حدثنا عبد الرحمن بن مهدي، عن سفيان، عن أبيه، عن عباية بن رفاعة، حدثني  رافع بن خديج، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الحمى من فور جهنم فابردوها عنكم بالماء ‏\"‏ ‏.‏ ولم يذكر أبو بكر ‏\"‏ عنكم ‏\"‏ ‏.‏ وقال قال أخبرني رافع بن خديج ‏.‏",
      "text_en": " Rafi' b. Khadij reported:                      I heard Allah's Messenger (may peace be upon him) as saying: The fever is due to the intense heat of Hell, so cool it down in your (bodies) with water. Aba Bakr has made no mention of the word\" from you\" ('ankum), but he said that Rafi' b. Khadij had informed him of it.",
      "chain": [
        "30201",
        "30170",
        "38487",
        "20523",
        "20033",
        "20005",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "6276",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا عبد الله بن الرومي اليمامي، وعباس بن عبد العظيم العنبري، وأحمد بن، جعفر المعقري قالوا حدثنا النضر بن محمد، حدثنا عكرمة، - وهو ابن عمار - حدثنا  أبو النجاشي، حدثني رافع بن خديج، قال قدم نبي الله صلى الله عليه وسلم المدينة وهم يأبرون النخل يقولون يلقحون النخل فقال ‏\"‏ ما تصنعون ‏\"‏ ‏.‏ قالوا كنا نصنعه قال ‏\"‏ لعلكم لو لم تفعلوا كان خيرا ‏\"‏ ‏.‏ فتركوه فنفضت أو فنقصت - قال - فذكروا ذلك له فقال ‏\"‏ إنما أنا بشر إذا أمرتكم بشىء من دينكم فخذوا به وإذا أمرتكم بشىء من رأى فإنما أنا بشر ‏\"‏ ‏.‏ قال عكرمة أو نحو هذا ‏.‏ قال المعقري فنفضت ‏.‏ ولم يشك ‏.‏",
      "text_en": " Rafi' b. Khadij reported that Allah's Messenger (may peace be upon him) came to Medina and the people had been grafting the trees. He said:                      What are you doing? They said: We are grafting them, whereupon he said: It may perhaps be good for you if you do not do that, so they abandoned this practice (and the date-palms) began to yield less fruit. They made a mention of it (to the Holy Prophet), whereupon he said: I am a human being, so when I command you about a thing pertaining to religion, do accept it, and when I command you about a thing out of my personal opinion, keep it in mind that I am a human being. 'Ikrima reported that he said something like this.",
      "chain": [
        "30437",
        "30414",
        "28603",
        "10704",
        "1986"
      ]
    },
    {
      "hadith_no": "424",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن إسماعيل، حدثنا سفيان، عن ابن عجلان، عن عاصم بن عمر بن قتادة بن النعمان، عن محمود بن لبيد، عن رافع بن خديج، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أصبحوا بالصبح فإنه أعظم لأجوركم ‏\"‏ ‏.‏ أو ‏\"‏ أعظم للأجر ‏\"‏ ‏.‏",
      "text_en": " Rafi' b. Khadij reported the Messenger of Allah (ﷺ) as saying:                      Offer Fajr prayer at dawn, for it is most productive of rewards to you or most productive of reward.",
      "chain": [
        "20012",
        "10616",
        "1830",
        "1986"
      ]
    },
    {
      "hadith_no": "2821",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا سعيد بن مسروق، عن عباية بن رفاعة، عن أبيه، عن جده، رافع بن خديج قال أتيت رسول الله صلى الله عليه وسلم فقلت يا رسول الله إنا نلقى العدو غدا وليس معنا مدى أفنذبح بالمروة وشقة العصا فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرن أو أعجل ما أنهر الدم وذكر اسم الله عليه فكلوا ما لم يكن سنا أو ظفرا وسأحدثكم عن ذلك أما السن فعظم وأما الظفر فمدى الحبشة ‏\"‏ ‏.‏ وتقدم به سرعان من الناس فتعجلوا فأصابوا من الغنائم ورسول الله صلى الله عليه وسلم في آخر الناس فنصبوا قدورا فمر رسول الله صلى الله عليه وسلم بالقدور فأمر بها فأكفئت وقسم بينهم فعدل بعيرا بعشر شياه وند بعير من إبل القوم ولم يكن معهم خيل فرماه رجل بسهم فحبسه الله فقال النبي صلى الله عليه وسلم ‏\"‏ إن لهذه البهائم أوابد كأوابد الوحش فما فعل منها هذا فافعلوا به مثل هذا ‏\"‏ ‏.‏",
      "text_en": " Narrated Rafi' b. Khadij:                     I came to the Messenger of Allah (ﷺ) and said: Messenger of Allah, we shall meet the enemy tomorrow and we have no knives with us. May we kill with a sharp-edged white stone (flint) and with splinter of a staff ? The Messenger of Allah (ﷺ) said: Hasten in slaughtering it. When Allah's name is mentioned you may eat what is killed by anything which causes the blood to flow except tooth and claw. I shall tell you about it. The tooth is a bone, and the claw is the knife of Abyssinians. Some people hastened and went forward, they made haste and got booty, while the Messenger of Allah (ﷺ) was in the rear and they setup cooking pots. The Messenger of Allah (ﷺ) passed by over the cooking pots. He ordered to turn them over. He then divided (the spoils of war) between them, and gave them a camel for ten goats in equation. One of the camels of the people ran away, and they had no horses with them at that time. A man shot an arrow at it, and Allah prevented it from escaping. The Prophet (ﷺ) said: Among animals (i.e. camels) there are some which bolt like wild animals ; so when any of them does so, do with it like this.",
      "chain": [
        "30175",
        "20327",
        "20016",
        "11179",
        "11506",
        "1986"
      ]
    },
    {
      "hadith_no": "2936",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن إبراهيم الأسباطي، حدثنا عبد الرحيم بن سليمان، عن محمد بن إسحاق، عن عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن رافع بن خديج، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ العامل على الصدقة بالحق كالغازي في سبيل الله حتى يرجع إلى بيته ‏\"‏ ‏.‏",
      "text_en": " Narrated Rafi' ibn Khadij:                     I heard the Messenger of Allah (ﷺ) say: The official who collects sadaqah (zakat) in a just manner is like him who fights in Allah's path till he returns home.",
      "chain": [
        "11213",
        "20334",
        "11107",
        "11103",
        "1830",
        "1986"
      ]
    },
    {
      "hadith_no": "3389",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن عمرو بن دينار، قال سمعت ابن عمر، يقول ما كنا نرى بالمزارعة بأسا حتى سمعت رافع بن خديج يقول إن رسول الله صلى الله عليه وسلم نهى عنها ‏.‏ فذكرته لطاوس فقال قال لي ابن عباس إن رسول الله صلى الله عليه وسلم لم ينه عنها ولكن قال ‏\"‏ لأن يمنح أحدكم أرضه خير من أن يأخذ عليها خراجا معلوما ‏\"‏ ‏.‏",
      "text_en": " Amr ibn Dinar said:                      I heard Ibn Umar say: We did not see any harm in sharecropping till I heard Rafi' ibn Khadij say: The Messenger of Allah (ﷺ) has forbidden it. So I mentioned it to Tawus. He said: Ibn Abbas told me that the Messenger of Allah (ﷺ) had not forbidden it, but said: It is better for one of you to lend to his brother than to take a prescribed sum from him.",
      "chain": [
        "28531",
        "20012",
        "11081",
        "18",
        "1986"
      ]
    },
    {
      "hadith_no": "3392",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا إبراهيم بن موسى الرازي، أخبرنا عيسى، حدثنا الأوزاعي، ح وحدثنا قتيبة بن سعيد، حدثنا ليث، كلاهما عن ربيعة بن أبي عبد الرحمن، - واللفظ للأوزاعي - حدثني حنظلة بن قيس الأنصاري، قال سألت رافع بن خديج عن كراء الأرض، بالذهب والورق فقال لا بأس بها إنما كان الناس يؤاجرون على عهد رسول الله صلى الله عليه وسلم بما على الماذيانات وأقبال الجداول وأشياء من الزرع فيهلك هذا ويسلم هذا ويسلم هذا ويهلك هذا ولم يكن للناس كراء إلا هذا فلذلك زجر عنه فأما شىء مضمون معلوم فلا بأس به ‏.‏ وحديث إبراهيم أتم وقال قتيبة عن حنظلة عن رافع ‏.‏ قال أبو داود رواية يحيى بن سعيد عن حنظلة نحوه ‏.‏",
      "text_en": " Narrated Hanzlah b. Qais al-Ansari:                     I asked Rafi' b. Khadij about the lease of land for gold and silver (i.e. for dinars and dirhams). There is no harm in it, for the people used to let out land in the time of the Messenger of Allah (ﷺ) for what grew by the current of water and at the banks of streamlets and at the places of cultivation. So sometimes this (portion) perished and that (portion) was saved, and sometimes this remained intact and that perished. There was no (form of) lease among the people except this. Therefore, he forbade it. But if there is something which is secure and known, then there is no harm in it. The tradition of Ibrahim is more perfect. Qutaibah said: \"from Hanzalah on the authority of Rafi' \".Abu Dawud said: A similar tradition has been transmitted by Yahya b. Sa'id from Hanzalah.",
      "chain": [
        "30309",
        "20347",
        "20024",
        "30367",
        "20023",
        "11503",
        "1986"
      ]
    },
    {
      "hadith_no": "3393",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا قتيبة بن سعيد، عن مالك، عن ربيعة بن أبي عبد الرحمن، عن حنظلة بن قيس، أنه سأل رافع بن خديج عن كراء الأرض، فقال نهى رسول الله صلى الله عليه وسلم عن كراء الأرض فقلت أبالذهب والورق فقال أما بالذهب والورق فلا بأس به ‏.‏",
      "text_en": " Hanzalah ibn Qays said that he asked Rafi' ibn Khadij about the lease of land. He replied:                      The Messenger of Allah (ﷺ) forbade the leasing of land. I asked: (Did he forbid) for gold and silver (i.e. dinars and dirhams)? He replied: If it is against  gold and silver, then there is no harm in it.",
      "chain": [
        "30367",
        "20001",
        "11162",
        "11503",
        "1986"
      ]
    },
    {
      "hadith_no": "3394",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي الليث، حدثني عقيل، عن ابن شهاب، أخبرني سالم بن عبد الله بن عمر، أن ابن عمر، كان يكري أرضه حتى بلغه أن رافع بن خديج الأنصاري حدث أن رسول الله صلى الله عليه وسلم كان ينهى عن كراء الأرض فلقيه عبد الله فقال يا ابن خديج ماذا تحدث عن رسول الله صلى الله عليه وسلم في كراء الأرض قال رافع لعبد الله بن عمر سمعت عمى وكانا قد شهدا بدرا يحدثان أهل الدار أن رسول الله صلى الله عليه وسلم نهى عن كراء الأرض ‏.‏ قال عبد الله والله لقد كنت أعلم في عهد رسول الله صلى الله عليه وسلم أن الأرض تكرى ‏.‏ ثم خشي عبد الله أن يكون رسول الله صلى الله عليه وسلم أحدث في ذلك شيئا لم يكن علمه فترك كراء الأرض ‏.‏ قال أبو داود رواه أيوب وعبيد الله وكثير بن فرقد ومالك عن نافع عن رافع عن النبي صلى الله عليه وسلم ورواه الأوزاعي عن حفص بن عنان عن نافع عن رافع قال سمعت رسول الله صلى الله عليه وسلم وكذلك رواه زيد بن أبي أنيسة عن الحكم عن نافع عن ابن عمر أنه أتى رافعا فقال سمعت رسول الله صلى الله عليه وسلم فقال نعم ‏.‏ وكذا قال عكرمة بن عمار عن أبي النجاشي عن رافع بن خديج قال سمعت النبي عليه السلام ‏.‏ ورواه الأوزاعي عن أبي النجاشي عن رافع بن خديج عن عمه ظهير بن رافع عن النبي صلى الله عليه وسلم ‏.‏ قال أبو داود أبو النجاشي عطاء بن صهيب ‏.‏",
      "text_en": " Narrated Salim bin 'Abdullah b. 'Umar:                     Ibn 'Umar used to let out his land till it reached him that Rafi' b. Khadij al-Ansari narrated that the Messenger of Allah (ﷺ) forbade let out land. So 'Abd Allah (b. 'Umar) said: Ibn Khadij, what do you narrate from the Messenger of Allah (ﷺ) about leasing the land? Rafi' replied to 'Abd Allah b. 'Umar: I heard both of my uncles were present in the battle of Badr say, and they narrated it to the members of the family, that the Messenger of Allah (ﷺ) forbade leasing land. 'Abd Allah said: I swear by Allah, I knew that land was leased in the time of the Messenger of Allah (ﷺ). 'Abd Allah then feared that the Messenger of Allah (ﷺ) might have created something new in that matter, so he gave up leasing land.Abu Dawud said: This tradition has also been transmitted by Ayyub, 'Ubaid Allah, Kathir b. Farqad, Malik from Nafi' on the authority of Rafi' from the Prophet (ﷺ). It has also been transmitted by al-Auzai' from Hafs b. 'Inan al-Hanafi from Nafi' from Rafi' who said: I heard the Messenger of Allah (ﷺ) say: Similarly, it has been transmitted by Zaid b. Abi Unaisah from al-Hakkam from Nafi' from Ibn 'Umar that he went to Rafi' and asked: Have you heard the Messenger of Allah (ﷺ) say? He replied: Yes. Similarly, it has also been transmitted by 'Ikrimah b. 'Ammar from Abu al-Najashi, from Rafi' b. Khadij who said: I heard the Prophet (ﷺ) say. It has also been transmitted by al-Auza'i from Abu al-Najashi from Rafi' b. Khadij from his uncle Zuhair b. Rafi' from the Prophet (ﷺ).Abu Dawud said: The name of Abu al-Najashi is 'Ata b. Suhaib.",
      "chain": [
        "30489",
        "36033",
        "11207",
        "11013",
        "11011",
        "18",
        "1986"
      ]
    },
    {
      "hadith_no": "3395",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، حدثنا خالد بن الحارث، حدثنا سعيد، عن يعلى بن حكيم، عن سليمان بن يسار، أن رافع بن خديج، قال كنا نخابر على عهد رسول الله صلى الله عليه وسلم فذكر أن بعض عمومته أتاه فقال نهى رسول الله صلى الله عليه وسلم عن أمر كان لنا نافعا وطواعية الله ورسوله أنفع لنا وأنفع ‏.‏ قال قلنا وما ذاك قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كانت له أرض فليزرعها أو فليزرعها أخاه ولا يكاريها بثلث ولا بربع ولا بطعام مسمى ‏\"‏ ‏.‏",
      "text_en": " Narrated Rafi' b. Khadij:                     We used to employ people to till land for a share of it produce. He then maintained that, one of his uncles came to him and said: The Messenger of Allah (ﷺ) forbade us from a work which beneficial to us. But obedience to Allah and His Apostle (ﷺ) is more beneficial to us. We asked : What is that ? He said: The Messenger of Allah (ﷺ) said: If anyone has land, he should cultivate it, or lend it to his brother for cultivation. He should not rent it for a third or a quarter (of the produce) or for specified among of produce.",
      "chain": [
        "30024",
        "20226",
        "11168",
        "11567",
        "11005",
        "1986"
      ]
    },
    {
      "hadith_no": "3399",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى، حدثنا أبو جعفر الخطمي، قال بعثني عمي أنا وغلاما، له إلى سعيد بن المسيب قال فقلنا له شىء بلغنا عنك في المزارعة ‏.‏ قال كان ابن عمر لا يرى بها بأسا حتى بلغه عن رافع بن خديج حديث فأتاه فأخبره رافع أن رسول الله صلى الله عليه وسلم أتى بني حارثة فرأى زرعا في أرض ظهير فقال ‏\"‏ ما أحسن زرع ظهير ‏\"‏ ‏.‏ قالوا ليس لظهير ‏.‏ قال ‏\"‏ أليس أرض ظهير ‏\"‏ ‏.‏ قالوا بلى ولكنه زرع فلان ‏.‏ قال ‏\"‏ فخذوا زرعكم وردوا عليه النفقة ‏\"‏ ‏.‏ قال رافع فأخذنا زرعنا ورددنا إليه النفقة ‏.‏ قال سعيد أفقر أخاك أو أكره بالدراهم ‏.‏",
      "text_en": " AbuJa'far al-Khatmi said:                      My uncle sent me and his slave to Sa'id ibn al-Musayyab. We said to him, there is something which has reached us about sharecropping. He replied: Ibn Umar did not see any harm in it until a tradition reached him from Rafi' ibn Khadij. He then came to him and Rafi'  told him that the Messenger of Allah (ﷺ) came to Banu Harithah and saw crop in the land of Zuhayr. He said: What an excellent crop of Zuhayr is! They said: It does not belong to Zuhayr. He asked: Is this not the land of Zuhayr? They said: Yes, but the crop belongs to so-and-so. He said: Take your crop and give him the wages. Rafi' said: We took our crop and gave him the wages. Sa'id (ibn al-Musayyab) said: Lend your brother or employ him for dirhams.",
      "chain": [
        "30160",
        "20031",
        "19820",
        "1986"
      ]
    },
    {
      "hadith_no": "3400",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا طارق بن عبد الرحمن، عن سعيد بن المسيب، عن رافع بن خديج، قال نهى رسول الله صلى الله عليه وسلم عن المحاقلة والمزابنة وقال ‏\"‏ إنما يزرع ثلاثة رجل له أرض فهو يزرعها ورجل منح أرضا فهو يزرع ما منح ورجل استكرى أرضا بذهب أو فضة ‏\"‏ ‏.‏",
      "text_en": " Narrated Rafi' ibn Khadij:                     The Messenger of Allah (ﷺ) forbade muhaqalah and muzabanah. Those who cultivate land are three: a man who has (his own) land and he tills it: a man who has been lent land and he tills the one lent to him; a man who employs another man to till land against gold (dinars) or silver (dirhams).",
      "chain": [
        "30175",
        "20327",
        "11355",
        "11002",
        "1986"
      ]
    },
    {
      "hadith_no": "3402",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا الفضل بن دكين، حدثنا بكير، - يعني ابن عامر - عن ابن أبي نعم، حدثني رافع بن خديج، أنه زرع أرضا فمر به النبي صلى الله عليه وسلم وهو يسقيها فسأله ‏\"‏ لمن الزرع ولمن الأرض ‏\"‏ ‏.‏ فقال زرعي ببذري وعملي لي الشطر ولبني فلان الشطر ‏.‏ فقال ‏\"‏ أربيتما فرد الأرض على أهلها وخذ نفقتك ‏\"‏ ‏.‏",
      "text_en": " Narrated Rafi' ibn Khadij:                     Rafi' had cultivated a land. The Prophet (ﷺ) passed him when he was watering it. So he asked him: To whom does the crop belong, and to whom does the land belong? He replied: The crop is mine for my seed and labour. The half (of the crop) is mine and the half for so-and-so. He said: You conducted usurious transaction. Return the land to its owner and take your wages and cost.",
      "chain": [
        "30524",
        "20348",
        "11366",
        "1986"
      ]
    },
    {
      "hadith_no": "3403",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا شريك، عن أبي إسحاق، عن عطاء، عن رافع بن خديج، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من زرع في أرض قوم بغير إذنهم فليس له من الزرع شىء وله نفقته ‏\"‏ ‏.‏",
      "text_en": " Narrated Rafi' ibn Khadij:                     The Prophet (ﷺ) said: If anyone sows in other people's land without their permission, he has no right to any of the crop, but he may have what it cost him.",
      "chain": [
        "30367",
        "20587",
        "11049",
        "11029",
        "1986"
      ]
    },
    {
      "hadith_no": "3421",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا موسى بن إسماعيل، أخبرنا أبان، عن يحيى، عن إبراهيم بن عبد الله، - يعني ابن قارظ - عن السائب بن يزيد، عن رافع بن خديج، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ كسب الحجام خبيث وثمن الكلب خبيث ومهر البغي خبيث ‏\"‏ ‏.‏",
      "text_en": " Narrated Rafi' ibn Khadij:                     The Prophet (ﷺ) said: The earnings of a cupper are impure, the price paid for a dog is impure, and the hire paid to a prostitute is impure.",
      "chain": [
        "20040",
        "20577",
        "20031",
        "10888",
        "3048",
        "1986"
      ]
    },
    {
      "hadith_no": "3427",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثني أحمد بن صالح، حدثنا ابن أبي فديك، عن عبيد الله، - يعني ابن هرير - عن أبيه، عن جده، رافع - هو ابن خديج - قال نهى رسول الله صلى الله عليه وسلم عن كسب الأمة حتى يعلم من أين هو ‏.‏",
      "text_en": " Narrated Rafi' b. Khadij:                     The Messenger of Allah (ﷺ) forbade earnings of a slave-girl unless it is known from where it came.",
      "chain": [
        "30226",
        "20172",
        "18048",
        "1986"
      ]
    },
    {
      "hadith_no": "4070",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن العلاء، أخبرنا أبو أسامة، عن الوليد، - يعني ابن كثير - عن محمد بن عمرو بن عطاء، عن رجل، من بني حارثة عن رافع بن خديج، قال خرجنا مع رسول الله صلى الله عليه وسلم في سفر فرأى رسول الله صلى الله عليه وسلم على رواحلنا وعلى إبلنا أكسية فيها خيوط عهن حمر فقال رسول الله صلى الله عليه وسلم ‏\"‏ ألا أرى هذه الحمرة قد علتكم ‏\"‏ ‏.‏ فقمنا سراعا لقول رسول الله صلى الله عليه وسلم حتى نفر بعض إبلنا فأخذنا الأكسية فنزعناها عنها ‏.‏",
      "text_en": " Narrated Rafi' ibn Khadij:                     We went out with the Messenger of Allah (ﷺ) on a journey, and we had on our saddles and camels garments consisting of red warp of wool. The Messenger of Allah (ﷺ) said: Do I not see that red colour has dominated you. We then got up quickly on account of this saying of the Messenger of Allah (ﷺ) and some of our camels ran away. We then took the garments and withdrew them.",
      "chain": [
        "30216",
        "20318",
        "11230",
        "11220",
        "1986"
      ]
    },
    {
      "hadith_no": "4520",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، ومحمد بن عبيد، - المعنى - قالا حدثنا حماد بن زيد، عن يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، ورافع بن خديج، أن محيصة بن مسعود، وعبد الله بن سهل، انطلقا قبل خيبر فتفرقا في النخل فقتل عبد الله بن سهل فاتهموا اليهود فجاء أخوه عبد الرحمن بن سهل وابنا عمه حويصة ومحيصة فأتوا النبي صلى الله عليه وسلم فتكلم عبد الرحمن في أمر أخيه وهو أصغرهم فقال رسول الله صلى الله عليه وسلم ‏\"‏ الكبر الكبر ‏\"‏ ‏.‏ أو قال ‏\"‏ ليبدإ الأكبر ‏\"‏ ‏.‏ فتكلما في أمر صاحبهما فقال رسول الله صلى الله عليه وسلم ‏\"‏ يقسم خمسون منكم على رجل منهم فيدفع برمته ‏\"‏ ‏.‏ قالوا أمر لم نشهده كيف نحلف قال ‏\"‏ فتبرئكم يهود بأيمان خمسين منهم ‏\"‏ ‏.‏ قالوا يا رسول الله قوم كفار ‏.‏ قال فوداه رسول الله صلى الله عليه وسلم من قبله ‏.‏ قال قال سهل دخلت مربدا لهم يوما فركضتني ناقة من تلك الإبل ركضة برجلها ‏.‏ قال حماد هذا أو نحوه ‏.‏ قال أبو داود رواه بشر بن المفضل ومالك عن يحيى بن سعيد قال فيه ‏\"‏ أتحلفون خمسين يمينا وتستحقون دم صاحبكم أو قاتلكم ‏\"‏ ولم يذكر بشر دما وقال عبدة عن يحيى كما قال حماد ورواه ابن عيينة عن يحيى فبدأ بقوله ‏\"‏ تبرئكم يهود بخمسين يمينا يحلفون ‏\"‏ ‏.‏ ولم يذكر الاستحقاق قال أبو داود وهذا وهم من ابن عيينة ‏.‏",
      "text_en": " Narrated Sahl b. Abi Hathmah and Rafi' b. Khadij:                     Muhayyasah b. Mas'ud and 'Abd Allah b. Sahl came to Khaibar and parted (from each other) among palm trees. 'Abd Allah b. Sahl was killed. The Jews were blamed (for the murder). 'Abd al-Rahman b. Sahl and Huwayyasah and Muhayyasah, the sons of his uncle (Mas'ud) came to the Prophet (ﷺ). 'Abd al-Rahman, who was the youngest, spoke about his brother, but the Messenger of Allah (ﷺ) said to him: (Respect) the elder, (respect) the elder or he said: Let the eldest begin. They then spoke about their friend and the Messenger of Allah (ﷺ) said: Fifty of you should take oaths regarding a man from them (the Jews) and he should be entrusted (to him) with his rope (in his neck). They said: It is a matter which we did not see. How can we take oaths ? He said: The Jews exonerate themselves by the oaths of fifty of them. They said: Messenger of Allah! they are a people who are infidels. So the Messenger of Allah (ﷺ) paid them bloodwit himself. Sahl said: Once I entered the resting place of their camels, and the she-camel struck me with her lef. Hammad said this or (something) similar to it.Abu Dawud said: Another version transmitted by Yahya b. Sa'id has: Would you swear fifty oaths and make you claim regarding your friend or your slain man ? Bishr, the transmitter, did mention blood. 'Abdah transmitted it from Yahya as transmitted by Hammad. Ibn 'Uyainah has also transmitted it from Yahya, and began with his words: The Jew will exonerate themselves by fifty oaths which they will swear. He did not mention the claim.Abu Dawud said: This is a misunderstanding on the part of Ibn 'Uyainah.",
      "chain": [
        "30024",
        "30213",
        "20022",
        "11062",
        "11810",
        "1822",
        "1986",
        "1920"
      ]
    },
    {
      "hadith_no": "4524",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا الحسن بن علي بن راشد، أخبرنا هشيم، عن أبي حيان التيمي، حدثنا عباية بن رفاعة، عن رافع بن خديج، قال أصبح رجل من الأنصار مقتولا بخيبر فانطلق أولياؤه إلى النبي صلى الله عليه وسلم فذكروا ذلك له فقال ‏\"‏ لكم شاهدان يشهدان على قتل صاحبكم ‏\"‏ ‏.‏ قالوا يا رسول الله لم يكن ثم أحد من المسلمين وإنما هم يهود وقد يجترئون على أعظم من هذا ‏.‏ قال ‏\"‏ فاختاروا منهم خمسين فاستحلفوهم ‏\"‏ ‏.‏ فأبوا فوداه النبي صلى الله عليه وسلم من عنده ‏.‏",
      "text_en": " Narrated Rafi' ibn Khadij:                     A man of the Ansar was killed at Khaybar and his relatives went to the Prophet (ﷺ) and mentioned that to him. He asked: Have you two witnesses who can testify to the murderer of your friend? They replied: Messenger of Allah! there was not a single Muslim present, but only Jews who sometimes have the audacity to do even greater crimes than this. He said: Then choose fifty of them and demand that they take an oath; but they refused and the Prophet (ﷺ) paid the blood-wit himself.",
      "chain": [
        "30115",
        "20468",
        "11404",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "154",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد، حدثنا عبدة، - هو ابن سليمان - عن محمد بن إسحاق، عن عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن رافع بن خديج، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ أسفروا بالفجر فإنه أعظم للأجر ‏\"‏ ‏.‏ قال وقد روى شعبة والثوري هذا الحديث عن محمد بن إسحاق ‏.‏ قال ورواه محمد بن عجلان أيضا عن عاصم بن عمر بن قتادة ‏.‏ قال وفي الباب عن أبي برزة الأسلمي وجابر وبلال ‏.‏ قال أبو عيسى حديث رافع بن خديج حديث حسن صحيح ‏.‏ وقد رأى غير واحد من أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين الإسفار بصلاة الفجر ‏.‏ وبه يقول سفيان الثوري ‏.‏ وقال الشافعي وأحمد وإسحاق معنى الإسفار أن يضح الفجر فلا يشك فيه ولم يروا أن معنى الإسفار تأخير الصلاة ‏.‏",
      "text_en": " Rafi bin Khadlj said:                     \"I heard Allah's Messenger saying: 'Perform Fajr at AI-Isfar, for indeed its reward is greater.'\"",
      "chain": [
        "30480",
        "20337",
        "11107",
        "11103",
        "1830",
        "1986"
      ]
    },
    {
      "hadith_no": "645",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يزيد بن هارون، أخبرنا يزيد بن عياض، عن عاصم بن عمر بن قتادة، ح وحدثنا محمد بن إسماعيل، قال حدثنا أحمد بن خالد، عن محمد بن إسحاق، عن عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن رافع بن خديج، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ العامل على الصدقة بالحق كالغازي في سبيل الله حتى يرجع إلى بيته ‏\"‏ ‏.‏ قال أبو عيسى حديث رافع بن خديج حديث حسن صحيح ‏.‏ ويزيد بن عياض ضعيف عند أهل الحديث ‏.‏ وحديث محمد بن إسحاق أصح ‏.‏",
      "text_en": " Rafi bin Khadij narrated:                     \"I herd the Messenger of Allah saying: 'The one who works in collecting charity in truth is like the one who fights in the cause of Allah until he returns.'\"",
      "chain": [
        "30242",
        "20472",
        "12592",
        "11103",
        "34188",
        "11107",
        "11103",
        "1830",
        "1986"
      ]
    },
    {
      "hadith_no": "774",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن يحيى، ومحمد بن رافع النيسابوري، ومحمود بن غيلان، ويحيى بن موسى، قالوا حدثنا عبد الرزاق، عن معمر، عن يحيى بن أبي كثير، عن إبراهيم بن عبد الله بن قارظ، عن السائب بن يزيد، عن رافع بن خديج، عن النبي صلى الله عليه وسلم قال ‏\"‏ أفطر الحاجم والمحجوم ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن علي وسعد وشداد بن أوس وثوبان وأسامة بن زيد وعائشة ومعقل بن سنان ويقال ابن يسار وأبي هريرة وابن عباس وأبي موسى وبلال ‏.‏ قال أبو عيسى وحديث رافع بن خديج حديث حسن ‏.‏ وذكر عن أحمد بن حنبل أنه قال أصح شيء في هذا الباب حديث رافع بن خديج ‏.‏ وذكر عن علي بن عبد الله أنه قال أصح شيء في هذا الباب حديث ثوبان وشداد بن أوس لأن يحيى بن أبي كثير روى عن أبي قلابة الحديثين جميعا حديث ثوبان وحديث شداد بن أوس ‏.‏ وقد كره قوم من أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم الحجامة للصائم حتى أن بعض أصحاب النبي صلى الله عليه وسلم احتجم بالليل منهم أبو موسى الأشعري وابن عمر وبهذا يقول ابن المبارك ‏.‏ قال أبو عيسى سمعت إسحاق بن منصور يقول قال عبد الرحمن بن مهدي من احتجم وهو صائم فعليه القضاء ‏.‏ قال إسحاق بن منصور وهكذا قال أحمد بن حنبل وإسحاق بن إبراهيم ‏.‏ وقال أبو عيسى وأخبرني الحسن بن محمد الزعفراني قال قال الشافعي قد روي عن النبي صلى الله عليه وسلم أنه احتجم وهو صائم وروي عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ أفطر الحاجم والمحجوم ‏\"‏ ‏.‏ ولا أعلم واحدا من هذين الحديثين ثابتا ولو توقى رجل الحجامة وهو صائم كان أحب إلى ولو احتجم صائم لم أر ذلك أن يفطره ‏.‏ قال أبو عيسى هكذا كان قول الشافعي ببغداد وأما بمصر فمال إلى الرخصة ولم ير بالحجامة للصائم بأسا واحتج بأن النبي صلى الله عليه وسلم احتجم في حجة الوداع وهو محرم صائم ‏.‏",
      "text_en": " Rafi bin Khadi narrated that:                     The Prophet said: \"The cupper and the one cupped have broke the fast.\"",
      "chain": [
        "11222",
        "30375",
        "30277",
        "30221",
        "20121",
        "20115",
        "11449",
        "10888",
        "3048",
        "1986"
      ]
    },
    {
      "hadith_no": "1275",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن يحيى بن أبي كثير، عن إبراهيم بن عبد الله بن قارظ، عن السائب بن يزيد، عن رافع بن خديج، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ كسب الحجام خبيث ومهر البغي خبيث وثمن الكلب خبيث ‏\"‏ ‏.‏ قال وفي الباب عن عمر وعلي وابن مسعود وأبي مسعود وجابر وأبي هريرة وابن عباس وابن عمر وعبد الله بن جعفر ‏.‏ قال أبو عيسى حديث رافع حديث حسن صحيح ‏.‏ والعمل على هذا عند أكثر أهل العلم كرهوا ثمن الكلب ‏.‏ وهو قول الشافعي وأحمد وإسحاق ‏.‏ وقد رخص بعض أهل العلم في ثمن كلب الصيد ‏.‏",
      "text_en": " Narrated Rafi' b. Khadij:                     That the Messenger of Allah (ﷺ) said: \"The earnings of the cupper is filth, the earnings of the fornicator (from harlotry) is filth, and the price of a dog is filth.\"[He said:] There are narrations on this topic from 'Umar, 'Ali, Ibn Mas'ud, Abu Masu'd, Jabir, Abu Hurairah, Ibn 'Abbas, Ibn 'Umar, and 'Abdullah bin Ja'far.[Abu 'Eisa said:] The Hadith is Rafi' is a Hasan Sahih Hadith. This is acted upon according to most of the people of knowledge, they disliked the price of a dog. This the view of Ash-Shafi'i, Ahmad, and Ishaq. Some of the people of knowledge permitted the price of the hunting dog.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11449",
        "10888",
        "3048",
        "1986"
      ]
    },
    {
      "hadith_no": "1303",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا الحسن بن علي الحلواني الخلال، حدثنا أبو أسامة، عن الوليد بن كثير، حدثنا بشير بن يسار، مولى بني حارثة أن رافع بن خديج، وسهل بن أبي حثمة، حدثاه أن رسول الله صلى الله عليه وسلم نهى عن بيع المزابنة الثمر بالتمر إلا لأصحاب العرايا فإنه قد أذن لهم وعن بيع العنب بالزبيب وعن كل ثمر بخرصه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Bushair bin Yasar, the freed slave of Banu Harithah:                     Rafi' bin Khadij and Sahl bin Abi Hathmah narrated to him that the Messenger of Allah (ﷺ) prohibited Al-Muzabanah sales, (buying) fruits with dried dates, except for those who practice Al-'Araya - for he permitted it for them - and from buying grapes with raisins, and from every fruit by its estimation.[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib from this route.",
      "chain": [
        "30115",
        "20318",
        "11230115",
        "11810",
        "1986",
        "1822"
      ]
    },
    {
      "hadith_no": "1366",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا قتيبة، حدثنا شريك بن عبد الله النخعي، عن أبي إسحاق، عن عطاء، عن رافع بن خديج، أن النبي صلى الله عليه وسلم قال ‏\"‏ من زرع في أرض قوم بغير إذنهم فليس له من الزرع شيء وله نفقته ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه من حديث أبي إسحاق إلا من هذا الوجه من حديث شريك بن عبد الله ‏.‏ والعمل على هذا الحديث عند بعض أهل العلم وهو قول أحمد وإسحاق ‏.‏ وسألت محمد بن إسماعيل عن هذا الحديث فقال هو حديث حسن ‏.‏ وقال لا أعرفه من حديث أبي إسحاق إلا من رواية شريك ‏.‏  قال محمد حدثنا معقل بن مالك البصري، حدثنا عقبة بن الأصم، عن عطاء، عن رافع بن خديج، عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " Narrated Rafi' bin Khadij:                     that the Prophet (ﷺ) said: \"Whoever farms a people's land without their permission, then nothing he farms belongs to him and its finances are due to him.\"",
      "chain": [
        "30367",
        "20587",
        "11049",
        "11029",
        "1986"
      ]
    },
    {
      "hadith_no": "1384",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا هناد، حدثنا أبو بكر بن عياش، عن أبي حصين، عن مجاهد، عن رافع بن خديج، قال نهانا رسول الله صلى الله عليه وسلم عن أمر كان لنا نافعا إذا كانت لأحدنا أرض أن يعطيها ببعض خراجها أو بدراهم وقال ‏\"‏ إذا كانت لأحدكم أرض فليمنحها أخاه أو ليزرعها ‏\"‏ ‏.‏",
      "text_en": " Narrated Rafi' bin Khadij:                     \"The Messenger of Allah (ﷺ) forbade us from a matter that was of benefit for us. When one of us had some land and we would let someone use it for a portion of its produce or some Dirham. He said: 'When one of you has some land then let him grant it to his brother, or let him farm it.'\"",
      "chain": [
        "30480",
        "20373",
        "11371",
        "11028",
        "1986"
      ]
    },
    {
      "hadith_no": "1422",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا قتيبة، حدثنا الليث بن سعد، عن يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، قال يحيى وحسبت عن رافع بن خديج، أنهما قالا خرج عبد الله بن سهل بن زيد ومحيصة بن مسعود بن زيد حتى إذا كانا بخيبر تفرقا في بعض ما هناك ثم إن محيصة وجد عبد الله بن سهل قتيلا قد قتل فدفنه ثم أقبل إلى رسول الله صلى الله عليه وسلم هو وحويصة بن مسعود وعبد الرحمن بن سهل وكان أصغر القوم ذهب عبد الرحمن ليتكلم قبل صاحبيه قال له رسول الله صلى الله عليه وسلم ‏\"‏ كبر الكبر ‏\"‏ ‏.‏ فصمت وتكلم صاحباه ثم تكلم معهما فذكروا لرسول الله صلى الله عليه وسلم مقتل عبد الله بن سهل فقال لهم ‏\"‏ أتحلفون خمسين يمينا فتستحقون صاحبكم أو قاتلكم ‏\"‏ ‏.‏ قالوا وكيف نحلف ولم نشهد قال ‏\"‏ فتبرئكم يهود بخمسين يمينا ‏\"‏ ‏.‏ قالوا وكيف نقبل أيمان قوم كفار فلما رأى ذلك رسول الله صلى الله عليه وسلم أعطى عقله ‏.‏  حدثنا الحسن بن علي الخلال، حدثنا يزيد بن هارون، أخبرنا يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، ورافع بن خديج، نحو هذا الحديث بمعناه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا الحديث عند أهل العلم في القسامة وقد رأى بعض فقهاء المدينة القود بالقسامة ‏.‏ وقال بعض أهل العلم من أهل الكوفة وغيرهم إن القسامة لا توجب القود وإنما توجب الدية ‏.‏ آخر أبواب الديات والحمد لله ‏.‏",
      "text_en": " Narrated Sahl bin Abi Hatamah:                     Yahya (one of the narrators) said: And I think it was from Rafi' bin Khadij - that 'Abdullah bin Sahl bin Zaid and Muhaiysah bin Mas'ud bin Zaid went out and when they reached Khaibar they separated while there. Then Muhayyisah found 'Abdullah bin Sahl murdered [so he buried him]. Then he went to the Messenger of Allah (ﷺ) along with Huwayyisah bin Mas'ud and Abdur-Rahman bin Sahl. The youngest of the people, Abdur-Rahman, went to speak ahead of his companions. The Messenger of Allah (ﷺ) said to him: \"Let the eldest of you speak.\" So he was silent and two companions spoke. So he conversed with them and they mentioned to the Messenger of Allah (ﷺ) about the murder of 'Abdullah bin Sahl. He said to them: \"If fifty of you can swear an oath then you will have the right against the murderer.\" They said: \"How can we take an oath when we did not witness it?\" He said: \"Then fifty of Jews can swear to clear the charge with you?\" They said: \"How could we accept the oaths of a disbelieving people?\" So when he saw that, the Messenger of Allah (ﷺ) paid the blood-money.\" (Another Chain) from Sahl bin Abi Hathman and Rafi' bin Khadij, and the meaning is similar to this Hadith.",
      "chain": [
        "30367",
        "20023",
        "11062",
        "11810",
        "1822",
        "1986"
      ]
    },
    {
      "hadith_no": "1449",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن يحيى بن سعيد، عن محمد بن يحيى بن حبان، عن عمه، واسع بن حبان، أن رافع بن خديج، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا قطع في ثمر ولا كثر ‏\"‏ ‏.‏ قال أبو عيسى هكذا روى بعضهم عن يحيى بن سعيد عن محمد بن يحيى بن حبان عن عمه واسع بن حبان عن رافع بن خديج عن النبي صلى الله عليه وسلم نحو رواية الليث بن سعد ‏.‏ وروى مالك بن أنس وغير واحد هذا الحديث عن يحيى بن سعيد عن محمد بن يحيى بن حبان عن رافع بن خديج عن النبي صلى الله عليه وسلم ولم يذكروا فيه عن واسع بن حبان ‏.‏",
      "text_en": " Narrated Rafi' bin Khadij:                     That he heard the Messenger of Allah (ﷺ) say: \"There is no cutting of the hand for fruits or palm marrow.\"",
      "chain": [
        "30367",
        "20023",
        "11062",
        "11222",
        "1321",
        "1986"
      ]
    },
    {
      "hadith_no": "1491",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا هناد، حدثنا أبو الأحوص، عن سعيد بن مسروق، عن عباية بن رفاعة بن رافع بن خديج، عن أبيه، عن جده، رافع بن خديج قال قلت يا رسول الله إنا نلقى العدو غدا وليست معنا مدى فقال النبي صلى الله عليه وسلم ‏\"‏ ما أنهر الدم وذكر اسم الله عليه فكلوه ما لم يكن سنا أو ظفرا وسأحدثكم عن ذلك أما السن فعظم وأما الظفر فمدى الحبشة ‏\"‏ ‏.‏",
      "text_en": " Narrated Rafi' bin Khadij:                     \"I said: 'O Messenger of Allah! We expect to meet the enemy tomorrow and we have no knives.' So the Prophet (ﷺ) said: 'As long as it causes blood to flow, and Allah's Name has been mentioned over it, then eat it, provided that it was not done with a tooth or nail. And I will tell you why: As for the tooth it is a bone, and as for the nail it is the knife of the Ethiopians.'\"",
      "chain": [
        "30480",
        "20327",
        "20016",
        "11179",
        "11506",
        "1986"
      ]
    },
    {
      "hadith_no": "1491",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، عن سفيان الثوري، قال حدثنا أبي، عن عباية بن رفاعة، عن رافع بن خديج، رضى الله عنه عن النبي صلى الله عليه وسلم نحوه ولم يذكر فيه عباية عن أبيه وهذا أصح وعباية قد سمع من رافع ‏.‏ والعمل على هذا عند أهل العلم لا يرون أن يذكى بسن ولا بعظم ‏.‏",
      "text_en": " Another chain from Rafi' bin Khadij (may Allah be pleased with him) from the Prophet (ﷺ) and it is similar, but the narrator did not mention in it:                      \"Abayah, from his father\" and this is more correct. 'Abayah heard from Rafi'.",
      "chain": [
        "30160",
        "20031",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "1492",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا هناد، حدثنا أبو الأحوص، عن سعيد بن مسروق، عن عباية بن رفاعة بن رافع، عن أبيه، عن جده، رافع بن خديج قال كنا مع النبي صلى الله عليه وسلم في سفر فند بعير من إبل القوم ولم يكن معهم خيل فرماه رجل بسهم فحبسه الله فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن لهذه البهائم أوابد كأوابد الوحش فما فعل منها هذا فافعلوا به هكذا ‏\"‏ ‏.‏",
      "text_en": " Narrated Rafi' bin Khadij:                     \"We were with the Prophet (ﷺ) on journey when the camel that belonged to some people ran away and they did not have a horse. So a man shot it with an arrow and Allah stopped it. The Messenger of Allah (ﷺ) said: 'Of these beasts there are some that are as wild as wild animals. So if one of them does this, then treat it similarly.'\"",
      "chain": [
        "30480",
        "20327",
        "20016",
        "11179",
        "11506",
        "1986"
      ]
    },
    {
      "hadith_no": "1492",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا وكيع، حدثنا سفيان، عن أبيه، عن عباية بن رفاعة، عن جده، رافع بن خديج عن النبي صلى الله عليه وسلم نحوه ولم يذكر فيه عباية عن أبيه وهذا أصح ‏.‏ والعمل على هذا عند أهل العلم ‏.‏ وهكذا رواه شعبة عن سعيد بن مسروق نحو رواية سفيان ‏.‏",
      "text_en": " Another chain from Rafi' bin Khadij from the Prophet (ﷺ) and it is similar, but (the narrator) did not mention in it \"Abayah from his father.\" and this is more correct.",
      "chain": [
        "30277",
        "20032",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "1600",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا هناد، حدثنا أبو الأحوص، عن سعيد بن مسروق، عن عباية بن رفاعة، عن أبيه، عن جده، رافع بن خديج قال كنا مع رسول الله صلى الله عليه وسلم في سفر فتقدم سرعان الناس فتعجلوا من الغنائم فاطبخوا ورسول الله صلى الله عليه وسلم في أخرى الناس فمر بالقدور فأمر بها فأكفئت ثم قسم بينهم فعدل بعيرا بعشر شياه ‏.‏  قال أبو عيسى وروى سفيان الثوري، عن أبيه، عن عباية، عن جده، رافع بن خديج ولم يذكر فيه أبيه ‏.‏ حدثنا بذلك، محمود بن غيلان حدثنا وكيع، عن سفيان، ‏.‏ وهذا أصح وعباية بن رفاعة سمع من، جده رافع بن خديج ‏.‏ قال وفي الباب عن ثعلبة بن الحكم، وأنس، وأبي، ريحانة وأبي الدرداء وعبد الرحمن بن سمرة وزيد بن خالد وجابر وأبي هريرة وأبي أيوب ‏.‏",
      "text_en": " Narrated 'Abayah bin Rifa'ah:                     From his father, from his grandfather Rafi' bin Khadij, who said: \"We were with the Messenger of Allah (ﷺ) on a journey, when the hasty people went rushing ahead to the sheep to cook them, while the Messenger of Allah (ﷺ) was in the rear of the people. Then he passed the kettled and ordered that they be weighed, then he distributed it between them and equated a camel to ten sheep.\"[Abu 'Eisa said:] Sufyan Ath-Thawri reported it from his father, from 'Abayah, from his grandfather Rafi' bin Khadij, and he did not mention \"from his father\" in it.This was narrated to us by Mahmud bin Ghailan (who said:) \"Waki' narrated it to us from Sufyan.\" And this is more correct. 'Abayah bin Rifa'ah heard from his grandfather Rafi' bin Khadij.He said: There are narrations on this topic from Tha'labah bin Al-Hakam, Anas, Abu Rihanah, Abu Ad-Darda, 'Abdur-Rahman bin Samurah, Zaid bin Khalid, Jabir, Abu Hurairah, and Abu Ayyub.",
      "chain": [
        "30480",
        "20327",
        "20016",
        "11179",
        "11506",
        "1986"
      ]
    },
    {
      "hadith_no": "2216",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا هناد، حدثنا أبو الأحوص، عن سعيد بن مسروق، عن عباية بن رفاعة، عن جده، رافع بن خديج عن النبي صلى الله عليه وسلم قال ‏\"‏ الحمى فور من النار فأبردوها بالماء ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أسماء بنت أبي بكر وابن عمر وامرأة الزبير وعائشة وابن عباس ‏.‏",
      "text_en": " \"Rafi' bin Khadij narrated that the Prophet (S.A.W) said:                     \"Fever is from the agitation of the Fire, so cool it with water.\"",
      "chain": [
        "30480",
        "20327",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "3395",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عثمان بن عمر، حدثنا علي بن المبارك، عن يحيى بن أبي كثير، عن يحيى بن إسحاق ابن أخي، رافع بن خديج عن رافع بن خديج، رضى الله عنه أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا اضطجع أحدكم على جنبه الأيمن ثم قال اللهم إني أسلمت نفسي إليك ووجهت وجهي إليك وألجأت ظهري إليك وفوضت أمري إليك لا ملجأ ولا منجا منك إلا إليك أومن بكتابك وبرسلك ‏.‏ فإن مات من ليلته دخل الجنة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه من حديث رافع بن خديج رضى الله عنه ‏.‏",
      "text_en": " Rafi bin Khadij narrated that:                     The Prophet said: “When one of you dies down on his right side, then says: ‘O Allah, I have submitted myself to You, and I have turned my face to You, and I lay myself down relying upon You, and I have entrusted my affair to You, there is no refuge [nor escape] from You except to You. I believe in Your Book and Your Messengers (Allahumma Inni Aslamtu Nafsi Ilaika Wa Wajjahtu Wajhi Ilaika, Wa Alja’tu Zahri Ilaika, Wa Fawwadtu Amri Ilaika, La Malja [Wa La Manja] Minka Illa Ilaik, Uminu Bikitabika Wa Birasulika)’ – then if he dies that night, he shall enter Paradise.”",
      "chain": [
        "30160",
        "20262",
        "20449",
        "11449",
        "30525",
        "1986"
      ]
    },
    {
      "hadith_no": "156",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عثمان بن عبد الله، قال أنبأنا أمية، قال حدثنا يزيد بن زريع، أن روح بن القاسم، حدثه عن ابن أبي نجيح، عن عطاء، عن إياس بن خليفة، عن رافع بن خديج، أن عليا، أمر عمارا أن يسأل رسول الله صلى الله عليه وسلم عن المذى فقال ‏\"‏ يغسل مذاكيره ويتوضأ ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Rafi' bin Khadij that 'Ali told 'Ammar to ask the Messenger of Allah (ﷺ) about prostatic fluid, and he said:                      'Let him wash his male member and perform Wudu'.'\"",
      "chain": [
        "11524",
        "20304",
        "11586",
        "11254",
        "11029",
        "1986"
      ]
    },
    {
      "hadith_no": "553",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، عن ابن عجلان، قال حدثني عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن رافع بن خديج، عن النبي صلى الله عليه وسلم قال ‏\"‏ أسفروا بالفجر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Rafi' bin Khadij that the Prophet (ﷺ) said:                      \"Pray Fajr when the dawn shines.\"",
      "chain": [
        "30359",
        "20031",
        "10616",
        "11103",
        "1830",
        "1986"
      ]
    },
    {
      "hadith_no": "3869",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا أحمد بن سليمان، عن عبيد الله، قال حدثنا إسرائيل، عن إبراهيم بن مهاجر، عن مجاهد، عن رافع بن خديج، قال مر النبي صلى الله عليه وسلم على أرض رجل من الأنصار قد عرف أنه محتاج فقال ‏‏\"‏‏ لمن هذه الأرض ‏‏\"‏‏‏.‏‏ قال لفلان أعطانيها بالأجر‏.‏‏ فقال ‏‏\"‏‏ لو منحها أخاه ‏‏\"‏‏‏.‏‏ فأتى رافع الأنصار فقال إن رسول الله صلى الله عليه وسلم نهاكم عن أمر كان لكم نافعا وطاعة رسول الله صلى الله عليه وسلم أنفع لكم‏.‏‏",
      "text_en": " It was narrated that Rafi' bin Khadij said:                      \"The Prophet passed by the land of a man from among the Ansar who he knew was in need and said: 'Whose is this land?' He said: 'So and so's; he has given it to us in return for rent.' He said: 'Why did he not give it to his brother?'\" Rafi' came to the Ansar and said: \"The Messenger of Allah has forbidden something for you which was beneficial, but obedience to the command of the Messenger of Allah is more beneficial for you.\"",
      "chain": [
        "38022",
        "11201",
        "20311",
        "10739",
        "11028",
        "1986"
      ]
    },
    {
      "hadith_no": "3870",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن المثنى، ومحمد بن بشار، قالا حدثنا محمد، قال حدثنا شعبة، عن الحكم، عن مجاهد، عن رافع بن خديج، قال نهى رسول الله صلى الله عليه وسلم عن الحقل‏.‏‏",
      "text_en": " It was narrated that Rafi' bin Khadij said:                      \"The Messenger of Allah forbade Al-Haql (renting land in return for one-third or one-quarter of the produce).\"",
      "chain": [
        "30170",
        "30160",
        "20278",
        "20020",
        "11069",
        "11028",
        "1986"
      ]
    },
    {
      "hadith_no": "3871",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عمرو بن علي، عن خالد، - وهو ابن الحارث - قال حدثنا شعبة، عن عبد الملك، عن مجاهد، قال حدث رافع بن خديج، قال خرج إلينا رسول الله صلى الله عليه وسلم فنهانا عن أمر كان لنا نافعا فقال ‏‏\"‏‏ من كان له أرض فليزرعها أو يمنحها أو يذرها ‏‏\"‏‏‏.‏‏",
      "text_en": " Rafi' bin Khadij said:                      \"The Messenger of Allah came out to us and forbade something for us that had been beneficial for us. He said: 'Whoever has land, let him cultivate it or give it to someone else (to cultivate), or leave it.'\"",
      "chain": [
        "30153",
        "20226",
        "20020",
        "11368",
        "11028",
        "1986"
      ]
    },
    {
      "hadith_no": "3872",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عبد الرحمن بن خالد، قال حدثنا حجاج، قال حدثني شعبة، عن عبد الملك، عن عطاء، وطاوس، ومجاهد، عن رافع بن خديج، قال خرج إلينا رسول الله صلى الله عليه وسلم فنهانا عن أمر كان لنا نافعا وأمر رسول الله صلى الله عليه وسلم خير لنا قال ‏‏\"‏‏ من كان له أرض فليزرعها أو ليذرها أو ليمنحها ‏‏\"‏‏‏.‏‏ ومما يدل على أن طاوسا لم يسمع هذا الحديث",
      "text_en": " It was narrated from Tawus and Mujahid, that Rafi' bin Khadij said:                      \"The Messenger of Allah came out to us and forbade something for us that had been beneficial for us, but the command of Messenger of Allah is better for us. He said: 'Whoever has land, let him cultivate it or leave it or give it (to someone else to cultivate).'\"",
      "chain": [
        "20376",
        "20219",
        "20020",
        "11368",
        "11029",
        "11053",
        "11028",
        "1986"
      ]
    },
    {
      "hadith_no": "3886",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا زكريا بن يحيى، قال حدثنا محمد بن يزيد بن إبراهيم، قال حدثنا عبد الله بن حمران، قال حدثنا عبد الحميد بن جعفر، عن الأسود بن العلاء، عن أبي سلمة، عن رافع بن خديج، أن رسول الله صلى الله عليه وسلم نهى عن المحاقلة والمزابنة‏.‏‏ رواه القاسم بن محمد عن رافع بن خديج‏.‏‏",
      "text_en": " It was narrated from Rafi' bin Khadij that the Messenger of Allah forbade Al-Muhaqalah and Al-Muzabanah.",
      "chain": [
        "34204",
        "20554",
        "11875",
        "10567",
        "1986"
      ]
    },
    {
      "hadith_no": "3887",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا أبو عاصم، قال حدثنا عثمان بن مرة، قال سألت القاسم عن المزارعة، فحدث عن رافع بن خديج، أن رسول الله صلى الله عليه وسلم نهى عن المحاقلة والمزابنة‏.‏‏ قال أبو عبد الرحمن مرة أخرى‏.‏‏",
      "text_en": " It was narrated from 'Uthman bin Murrah who said:                      \"I asked Al-Qasim about Al-Muzara'ah, so he narrated from Rafi' bin Khadij that the Messenger of Allah forbade Al-Muhaqalah and Al-Muzabanah.\"",
      "chain": [
        "30153",
        "20241",
        "10535",
        "1986"
      ]
    },
    {
      "hadith_no": "3888",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عمرو بن علي، قال قال أبو عاصم عن عثمان بن مرة، قال سألت القاسم عن كراء الأرض، فقال قال رافع بن خديج إن رسول الله صلى الله عليه وسلم نهى عن كراء الأرض‏.‏‏ واختلف على سعيد بن المسيب فيه",
      "text_en": " Rafi' bin Khadij said that the Messenger of Allah forbade leasing land.",
      "chain": [
        "30153",
        "20241",
        "10535",
        "1986"
      ]
    },
    {
      "hadith_no": "3890",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو الأحوص، عن طارق، عن سعيد بن المسيب، عن رافع بن خديج، قال نهى رسول الله صلى الله عليه وسلم عن المحاقلة والمزابنة وقال ‏‏\"‏‏ إنما يزرع ثلاثة رجل له أرض فهو يزرعها أو رجل منح أرضا فهو يزرع ما منح أو رجل استكرى أرضا بذهب أو فضة ‏‏\"‏‏‏.‏‏ ميزه إسرائيل عن طارق فأرسل الكلام الأول وجعل الأخير من قول سعيد",
      "text_en": " It was narrated that Rafi' bin Khadij said:                      \"The Messenger of Allah forbade Al-Muhaqalah and Al-Muzabanah, and said: 'Only three may cultivate: A man who has land which he cultivates; a man who was given some land and cultivates what he was given; and a man who takes land on lease for gold or silver.'\"",
      "chain": [
        "30367",
        "20327",
        "11355",
        "11002",
        "1986"
      ]
    },
    {
      "hadith_no": "3895",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرني زياد بن أيوب، قال حدثنا ابن علية، قال أنبأنا أيوب، عن يعلى بن حكيم، عن سليمان بن يسار، عن رافع بن خديج، قال كنا نحاقل بالأرض على عهد رسول الله صلى الله عليه وسلم فنكريها بالثلث والربع والطعام المسمى فجاء ذات يوم رجل من عمومتي فقال نهاني رسول الله صلى الله عليه وسلم عن أمر كان لنا نافعا وطواعية الله ورسوله أنفع لنا نهانا أن نحاقل بالأرض ونكريها بالثلث والربع والطعام المسمى وأمر رب الأرض أن يزرعها أو يزرعها وكره كراءها وما سوى ذلك‏.‏‏ أيوب لم يسمعه من يعلى‏.‏‏",
      "text_en": " It was narrated that Rafi' bin Khadij said:                      \"At the time of the Messenger of Allah we used to lease land on the basis of Al-Muhaqalah, so we would lease it in return for one-third or one-quarter of the yield, or a specified amount of food (produce). One day, a man among my paternal uncles came and said 'The Messenger of Allah has forbidden me to do something that was beneficial for us, but obedience to Allah and His Messenger is more beneficial for us. He has forbidden us to lease land on the basis of Al-Muhaqalah and to lease it in return for one-third or one-quarter of the yield, and for a specified amount of food (produce). And he commanded the landowner to cultivate it (himself) or to give it to someone else to cultivate. He did not like leasing it or anything else.'\"",
      "chain": [
        "30249",
        "20208",
        "11015",
        "11567",
        "11005",
        "1986"
      ]
    },
    {
      "hadith_no": "3896",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرني زكريا بن يحيى، قال حدثنا محمد بن عبيد، قال حدثنا حماد، عن أيوب، قال كتب إلى يعلى بن حكيم أني سمعت سليمان بن يسار، يحدث عن رافع بن خديج، قال كنا نحاقل الأرض نكريها بالثلث والربع والطعام المسمى‏.‏‏ رواه سعيد عن يعلى بن حكيم‏.‏‏",
      "text_en": " It was narrated from Ayyub who said:                      \"Ya'la bin Al-Hakim wrote to me (saying): 'I heard Sulaiman bin Yasar narrating from Rafi' bin Khadij, who said: \"We used to lease land on the basis of Al-Muhaqalah, leasing it in return for one-third or one-quarter of the yield, and a specified amount of food (produce).\"'\"",
      "chain": [
        "30213",
        "20022",
        "11015",
        "11005",
        "1986",
        "11168"
      ]
    },
    {
      "hadith_no": "3897",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، عن سعيد، عن يعلى بن حكيم، عن سليمان بن يسار، أن رافع بن خديج، قال كنا نحاقل على عهد رسول الله صلى الله عليه وسلم فزعم أن بعض عمومته أتاه فقال نهاني رسول الله صلى الله عليه وسلم عن أمر كان لنا نافعا وطواعية الله ورسوله أنفع لنا‏.‏‏ قلنا وما ذاك قال قال رسول الله صلى الله عليه وسلم ‏‏\"‏‏ من كانت له أرض فليزرعها أو ليزرعها أخاه ولا يكاريها بثلث ولا ربع ولا طعام مسمى ‏‏\"‏‏‏.‏‏ رواه حنظلة بن قيس عن رافع فاختلف على ربيعة في روايته‏.‏‏",
      "text_en": " It was narrated that Rafi' bin Khadij said:                      \"We used to lease land on the basis of Al-Muhaqalah during the time of the Messenger of Allah.\" He said that one of his paternal uncles came to them and said: \"The Messenger of Allah has forbidden me to do something that was beneficial for us, but obedience to Allah and His Messenger is more beneficial.\" We said: \"What is that?\" He said: \"The Messenger of Allah said: 'Whoever has land, let him cultivate it (himself) or give it to his brother to cultivate, and not lease it in return for one-third or one-quarter of the yield nor a specified amount of food (produce).'\"",
      "chain": [
        "34033",
        "20226",
        "11168",
        "11567",
        "11005",
        "1986"
      ]
    },
    {
      "hadith_no": "3898",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا حجين بن المثنى، قال حدثنا الليث، عن ربيعة بن أبي عبد الرحمن، عن حنظلة بن قيس، عن رافع بن خديج، قال حدثني عمي، أنهم كانوا يكرون الأرض على عهد رسول الله صلى الله عليه وسلم بما ينبت على الأربعاء وشىء من الزرع يستثني صاحب الأرض فنهانا رسول الله صلى الله عليه وسلم عن ذلك‏.‏‏ فقلت لرافع فكيف كراؤها بالدينار والدرهم فقال رافع ليس بها بأس بالدينار والدرهم‏.‏‏ خالفه الأوزاعي‏.‏‏",
      "text_en": " It was narrated that Rafi' bin Khadij said:                      \"My paternal uncle told me that they used to lease land at the time of the Messenger of Allah in return for what grew on the banks of the streams, and a share of the crop stipulated by the owner of the land. But the Messenger of Allah forbade us that.\" I (Hanzalah) said to Rafi': \"How about leasing it in return for Dinars and Dirhams?\" Rafi' said: \"There is nothing wrong with (leasing it) for Dinars and Dirhams.\"",
      "chain": [
        "20382",
        "20023",
        "11162",
        "11503",
        "1986"
      ]
    },
    {
      "hadith_no": "3899",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرني المغيرة بن عبد الرحمن، قال حدثنا عيسى، - هو ابن يونس - قال حدثنا الأوزاعي، عن ربيعة بن أبي عبد الرحمن، عن حنظلة بن قيس الأنصاري، قال سألت رافع بن خديج عن كراء الأرض، بالدينار والورق فقال لا بأس بذلك إنما كان الناس على عهد رسول الله صلى الله عليه وسلم يؤاجرون على الماذيانات وأقبال الجداول فيسلم هذا ويهلك هذا ويسلم هذا ويهلك هذا فلم يكن للناس كراء إلا هذا فلذلك زجر عنه فأما شىء معلوم مضمون فلا بأس به‏.‏‏ وافقه مالك بن أنس على إسناده وخالفه في لفظه‏.‏‏",
      "text_en": " It was narrated that Hanzalah bin Qais Al-Ansari said:                      \"I asked Rafi' bin Khadij about leasing land in return for Dinars and silver. He said: 'There is nothing wrong with that. During the time of the Messenger of Allah they used to rent land to one another in return for what grew on the banks of streams and where the springs emerged - some areas of which might give good produce and some might give none at all - and the people did not lease land in any other way. So that was forbidden. But as for leases where the return is known and guaranteed, there is nothing wrong with that.'\"",
      "chain": [
        "20182",
        "20347",
        "20024",
        "11162",
        "11503",
        "1986"
      ]
    },
    {
      "hadith_no": "3900",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا مالك، عن ربيعة، عن حنظلة بن قيس، قال سألت رافع بن خديج عن كراء الأرض، فقال نهى رسول الله صلى الله عليه وسلم عن كراء الأرض‏.‏‏ قلت بالذهب والورق قال لا إنما نهى عنها بما يخرج منها فأما الذهب والفضة فلا بأس‏.‏‏ رواه سفيان الثوري رضى الله عنه عن ربيعة ولم يرفعه‏.‏‏",
      "text_en": " It was narrated that Hanzalah bin Qais said:                      \"I asked Rafi' bin Khadij about leasing land. He said: 'The Messenger of Allah forbade leasing land.' I said: 'For gold or silver?' He said: 'No, rather he forbade leasing it in return for what the land produces. As for gold and silver, there is nothing wrong with that.'\"",
      "chain": [
        "30153",
        "20031",
        "20001",
        "11162",
        "11503",
        "1986"
      ]
    },
    {
      "hadith_no": "3901",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، عن وكيع، قال حدثنا سفيان، عن ربيعة بن أبي عبد الرحمن، عن حنظلة بن قيس، قال سألت رافع بن خديج عن كراء الأرض البيضاء، بالذهب والفضة فقال حلال لا بأس به ذلك فرض الأرض‏.‏‏ رواه يحيى بن سعيد عن حنظلة بن قيس ورفعه كما رواه مالك عن ربيعة‏.‏‏",
      "text_en": " It was narrated that Hanzalah bin Qais said:                      \"I asked Rafi' bin Khadij about leasing uncultivated land in return for gold and silver. He said: '(It is) permissible and there is nothing wrong with that. That is the due of the land.'\"",
      "chain": [
        "20032",
        "20012",
        "11162",
        "11503",
        "1986",
        "20031",
        "11503",
        "20001"
      ]
    },
    {
      "hadith_no": "3902",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا يحيى بن حبيب بن عربي، في حديثه عن حماد بن زيد، عن يحيى بن سعيد، عن حنظلة بن قيس، عن رافع بن خديج، قال نهانا رسول الله صلى الله عليه وسلم عن كراء أرضنا ولم يكن يومئذ ذهب ولا فضة فكان الرجل يكري أرضه بما على الربيع والأقبال وأشياء معلومة وساقه‏.‏‏ رواه سالم بن عبد الله بن عمر عن رافع بن خديج واختلف على الزهري فيه‏.‏‏",
      "text_en": " It was narrated that Rafi' bin Khadij said:                      \"The Messenger of Allah forbade us to lease our land. At that time there was no gold nor silver. A man would lease his land in return for what grew on the banks of streams and where the springs emerged, and in return for something specific.\"",
      "chain": [
        "30459",
        "20022",
        "20031",
        "11503",
        "1986"
      ]
    },
    {
      "hadith_no": "3904",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عبد الملك بن شعيب بن الليث بن سعد، قال حدثنا أبي، عن جدي، قال أخبرني عقيل بن خالد، عن ابن شهاب، قال أخبرني سالم بن عبد الله، أن عبد الله بن عمر، كان يكري أرضه حتى بلغه أن رافع بن خديج كان ينهى عن كراء الأرض فلقيه عبد الله فقال يا ابن خديج ماذا تحدث عن رسول الله صلى الله عليه وسلم في كراء الأرض فقال رافع لعبد الله سمعت عمى - وكانا قد شهدا بدرا - يحدثان أهل الدار أن رسول الله صلى الله عليه وسلم نهى عن كراء الأرض‏.‏‏ قال عبد الله فلقد كنت أعلم في عهد رسول الله صلى الله عليه وسلم أن الأرض تكرى ثم خشي عبد الله أن يكون رسول الله صلى الله عليه وسلم أحدث في ذلك شيئا لم يكن يعلمه فترك كراء الأرض‏.‏‏ أرسله شعيب بن أبي حمزة‏.‏‏",
      "text_en": " Salim bin Abdullah narrated that Abdullah bin Umar used to lease his land until he heard that Rafi bin Khadij forbade leasing land. Abdullah met him and said:                      \"O Ibn Khadij, what do you narrate from the Messenger of Allah about leasing land?\" Rafi said to Abdullah: \"I heard two of my uncles, who had been present at Badr, telling the people in the house, that the Messenger of Allah forbade leasing land.\" Abdullah said: \"I knew that at the time of the Messenger of Allah land used to be leased.\" Then Abdullah was concerned that the Messenger of Allah had decreed something and he had not known about it, so he stopped leasing land.",
      "chain": [
        "11207",
        "11013",
        "11011",
        "18",
        "1986"
      ]
    },
    {
      "hadith_no": "3905",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرني محمد بن خالد بن خلي، قال حدثنا بشر بن شعيب، عن أبيه، عن الزهري، قال بلغنا أن رافع بن خديج، كان يحدث أن عميه، وكانا، - يزعم - شهدا بدرا أن رسول الله صلى الله عليه وسلم نهى عن كراء الأرض‏.‏‏ رواه عثمان بن سعيد عن شعيب ولم يذكر عميه‏.‏‏",
      "text_en": " It was narrated that Az-Zuhri said:                      \"We heard that Rafi bin Khadij used to narrate that his paternal uncles -whom he said had been present at Badr- (said) that the Messenger of Allah forbade leasing land.\"",
      "chain": [
        "38496",
        "30317",
        "20428",
        "11013",
        "1986"
      ]
    },
    {
      "hadith_no": "3906",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا أحمد بن محمد بن المغيرة، قال حدثنا عثمان بن سعيد، عن شعيب، قال الزهري كان ابن المسيب يقول ليس باستكراء الأرض بالذهب والورق بأس وكان رافع بن خديج يحدث أن رسول الله صلى الله عليه وسلم نهى عن ذلك‏.‏‏ وافقه على إرساله عبد الكريم بن الحارث‏.‏‏",
      "text_en": " It was narrated from Shu'aib:                      \"Az-Zuhri said: 'Ibn Al-Musayyab used to say: 'There is nothing wrong with leasing land in return for gold and silver, and Rafi bin Khadij used to narrate that the Messenger of Allah forbade that.''\"",
      "chain": [
        "30304",
        "28388",
        "20428",
        "11013",
        "11002",
        "1986"
      ]
    },
    {
      "hadith_no": "3907",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "قال الحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن وهب، قال أخبرني أبو خزيمة عبد الله بن طريف، عن عبد الكريم بن الحارث، عن ابن شهاب، أن رافع بن خديج، قال نهى رسول الله صلى الله عليه وسلم عن كراء الأرض‏.‏‏ قال ابن شهاب فسئل رافع بعد ذلك كيف كانوا يكرون الأرض قال بشىء من الطعام مسمى ويشترط أن لنا ما تنبت ماذيانات الأرض وأقبال الجداول‏.‏‏ رواه نافع عن رافع بن خديج واختلف عليه فيه‏.‏‏",
      "text_en": " It was narrated from Ibn Shihab that Rafi bin Khadij said:                      \"The Messenger of Allah forbade leasing land.\" Ibn Shihab said: \"Rafi was asked after that: 'How did they lease land?' He said: 'In return for a set amount of food (produce), and it was stipulated that we would have whatever grew on the banks of the streams and springs.'\"",
      "chain": [
        "36017",
        "20029",
        "10869",
        "11013",
        "1986"
      ]
    },
    {
      "hadith_no": "3908",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن عبد الله بن بزيع، قال حدثنا فضيل، قال حدثنا موسى بن عقبة، قال أخبرني نافع، أن رافع بن خديج، أخبر عبد الله بن عمر، أن عمومته، جاءوا إلى رسول الله صلى الله عليه وسلم ثم رجعوا فأخبروا أن رسول الله صلى الله عليه وسلم نهى عن كراء المزارع‏.‏‏ فقال عبد الله قد علمنا أنه كان كل صاحب مزرعة يكريها على عهد رسول الله صلى الله عليه وسلم على أن له ما على الربيع الساقي الذي يتفجر منه الماء وطائفة من التبن لا أدري كم هي‏.‏‏ رواه ابن عون عن نافع فقال عن بعض عمومته‏.‏‏",
      "text_en": " Rafi bin Khadij told Abdullah bin Umar that his paternal uncles went to the Messenger of Allah, then they came back and told them that the Messenger of Allah had forbidden leasing arable land. Abdullah said:                      \"We knew that he owned some arable land that he leased at the time of the Messenger of Allah in return for whatever grew on the banks of the streams of water, and for a certain amount of straw, I do not know how much it was.\" Ibn Awn reported it from Nafi but he said: \"From some of his paternal uncles.\"",
      "chain": [
        "30448",
        "20271",
        "11106",
        "11014",
        "1986",
        "18"
      ]
    },
    {
      "hadith_no": "3909",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرني محمد بن إسماعيل بن إبراهيم، قال حدثنا يزيد، قال أنبأنا ابن عون، عن نافع، كان ابن عمر يأخذ كراء الأرض فبلغه عن رافع بن خديج، شىء فأخذ بيدي فمشى إلى رافع وأنا معه فحدثه رافع عن بعض عمومته أن رسول الله صلى الله عليه وسلم نهى عن كراء الأرض‏.‏‏ فترك عبد الله بعد‏.‏‏",
      "text_en": " It was narrated from Nafi':                      \"Ibn 'Umar used to take rent for some land, then he heard something from Rafi' bin Khadij. He took me by the hand and went off to Rafi', and I was with him. Rafi' narrated to him from some of his paternal uncles, that the Messenger of Allah forbade leasing land, so 'Abdullah stopped (doing that) afterward.\"",
      "chain": [
        "34188",
        "20472",
        "11071",
        "11014",
        "1986"
      ]
    },
    {
      "hadith_no": "3912",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرني عبد الرحمن بن عبد الله بن عبد الحكم بن أعين، قال حدثنا شعيب بن الليث، عن أبيه، عن كثير بن فرقد، عن نافع، أن عبد الله بن عمر، كان يكري المزارع فحدث أن رافع بن خديج يأثر عن رسول الله صلى الله عليه وسلم أنه نهى عن ذلك‏.‏‏ قال نافع فخرج إليه على البلاط وأنا معه فسأله فقال نعم نهى رسول الله صلى الله عليه وسلم عن كراء المزارع‏.‏‏ فترك عبد الله كراءها‏.‏‏",
      "text_en": " It was narrated from Nafi' that 'Abdullah bin 'Umar used to lease arable land, then he was told that Rafi' bin Khadij narrated from the Messenger of Allah that he forbade that. Nafi' said:                      \"He went out to him (and met him) in Al-Balat, and I was with him. He asked him (about that) and he said: 'Yes, the Messenger of Allah forbade leasing arable land.' So 'Abdullah stopped leasing it.\"",
      "chain": [
        "36033",
        "20023",
        "20170",
        "11014",
        "18",
        "1986"
      ]
    },
    {
      "hadith_no": "3913",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، - وهو ابن الحارث - قال حدثنا عبيد الله بن عمر، عن نافع، أن رجلا، أخبر ابن عمر، أن رافع بن خديج، يأثر في كراء الأرض حديثا فانطلقت معه أنا والرجل الذي أخبره حتى أتى رافعا فأخبره رافع أن رسول الله صلى الله عليه وسلم نهى عن كراء الأرض‏.‏‏ فترك عبد الله كراء الأرض‏.‏‏",
      "text_en": " It was narrated from Nafi':                      \"A man told Ibn 'Umar that Rafi' bin Khadij had narrated a Hadith concerning leasing of land. He and I, along with the man who had told him that, went to Rafi', and he told us that the Messenger of Allah had forbidden leasing land. So 'Abdullah stopped leasing land.\"",
      "chain": [
        "34033",
        "20226",
        "11201",
        "11014",
        "18",
        "1986"
      ]
    },
    {
      "hadith_no": "3914",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن عبد الله بن يزيد المقرئ، قال حدثنا أبي قال، حدثنا جويرية، عن نافع، أن رافع بن خديج، حدث عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم نهى عن كراء المزارع‏.‏‏",
      "text_en": " It was narrated from Nafi' that Rafi' bin Khadij told 'Abdullah bin 'Umar that the Messenger of Allah forbade leasing arable land.",
      "chain": [
        "20216",
        "11014",
        "1986",
        "18"
      ]
    },
    {
      "hadith_no": "3915",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا هشام بن عمار، قال حدثنا يحيى بن حمزة، قال حدثنا الأوزاعي، قال حدثني حفص بن عنان، عن نافع، أنه حدثه قال كان ابن عمر يكري أرضه ببعض ما يخرج منها فبلغه أن رافع بن خديج يزجر عن ذلك وقال نهى رسول الله صلى الله عليه وسلم عن ذلك قال كنا نكري الأرض قبل أن نعرف رافعا ثم وجد في نفسه فوضع يده على منكبي حتى دفعنا إلى رافع فقال له عبد الله أسمعت النبي صلى الله عليه وسلم نهى عن كراء الأرض فقال رافع سمعت النبي صلى الله عليه وسلم يقول ‏‏\"‏‏ لا تكروا الأرض بشىء ‏‏\"‏‏‏.‏‏",
      "text_en": " It was narrated from Nafi' that he narrated:                      \"Ibn 'Umar used to lease his land in return for some of its produce.  Then he heard that Rafi' bin Khadij warned against that. He said: 'The Messenger of Allah forbade that.' He said: 'We used to lease our land before we came to know Rafi'.' Then he (Ibn 'Umar) became unsure, so he put his hand on my shoulder and we went to Rafi'. 'Abdullah said to him: 'Did you hear the Prophet forbid leasing land?' Rafi' said: 'I heard the Prophet say: Do not lease land in return for anything.'\"",
      "chain": [
        "30288",
        "20402",
        "20024",
        "11014",
        "1986"
      ]
    },
    {
      "hadith_no": "3916",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا حميد بن مسعدة، عن عبد الوهاب، قال حدثنا هشام، عن محمد، ونافع، أخبراه عن رافع بن خديج، أن رسول الله صلى الله عليه وسلم نهى عن كراء الأرض‏.‏‏ رواه ابن عمر عن رافع بن خديج‏.‏‏ واختلف على عمرو بن دينار‏.‏‏",
      "text_en": " It was narrated from Rafi' bin Khadij that the Messenger of Allah forbade leasing land.",
      "chain": [
        "30430",
        "20259",
        "20295",
        "20278",
        "1986"
      ]
    },
    {
      "hadith_no": "3922",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا أبو بكر، محمد بن إسماعيل الطبراني قال حدثنا عبد الرحمن بن بحر، قال حدثنا مبارك بن سعيد، قال حدثنا يحيى بن أبي كثير، قال حدثني أبو النجاشي، قال حدثني رافع بن خديج، أن رسول الله صلى الله عليه وسلم قال لرافع ‏‏\"‏‏ أتؤاجرون محاقلكم ‏‏\"‏‏‏.‏‏ قلت نعم يا رسول الله نؤاجرها على الربع وعلى الأوساق من الشعير‏.‏‏ فقال رسول الله صلى الله عليه وسلم ‏‏\"‏‏ لا تفعلوا ازرعوها أو أعيروها أو أمسكوها ‏‏\"‏‏‏.‏‏ خالفه الأوزاعي فقال عن رافع عن ظهير بن رافع‏.‏‏",
      "text_en": " Rafi' bin Khadij narrated that the Messenger of Allah said to Rafi':                      \"Do you rent out your arable land?\" I said: \"Yes, O Messenger of Allah. We rent it out in return for one-quarter, and in return for (a number of) Wasqs of barley.\" The Messenger of Allah said: \"Do not do that. Cultivate it (yourselves), or lend it, or keep it.\"",
      "chain": [
        "38479",
        "20014",
        "11449",
        "1986"
      ]
    },
    {
      "hadith_no": "4294",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا شعيب بن يوسف، عن يحيى، عن محمد بن يوسف، عن السائب بن يزيد، عن رافع بن خديج، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ شر الكسب مهر البغي وثمن الكلب وكسب الحجام ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Waqi bin Khadij said:                     \"The Messenger of Allah said: 'The worst of earnings arte the gift of a female fornicator, the price of a dog and the earnings of a cupper.\"\"",
      "chain": [
        "30020",
        "30388",
        "3048",
        "1986"
      ]
    },
    {
      "hadith_no": "4297",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا حسين بن علي، عن زائدة، عن سعيد بن مسروق، عن عباية بن رفاعة بن رافع، عن رافع بن خديج، قال بينما نحن مع رسول الله صلى الله عليه وسلم في ذي الحليفة من تهامة فأصابوا إبلا وغنما ورسول الله صلى الله عليه وسلم في أخريات القوم فعجل أولهم فذبحوا ونصبوا القدور فدفع إليهم رسول الله صلى الله عليه وسلم فأمر بالقدور فأكفئت ثم قسم بينهم فعدل عشرا من الشاء ببعير فبينما هم كذلك إذ ند بعير وليس في القوم إلا خيل يسيرة فطلبوه فأعياهم فرماه رجل بسهم فحبسه الله فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن لهذه البهائم أوابد كأوابد الوحش فما غلبكم منها فاصنعوا به هكذا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi bin Khadij said:                     \"While we were with the Messenger of Allah at Dhul-Hulaifah in Tihamanb, they acquired some camels and sheep (as spoils of war). The Messenger of Allah was among the last of the people, and the first of them hastened to slaughter (the animals) and set up pots (For cooking the meat). The Messenger of Allah came and ordered that the pots be came and ordered that the pots be overturned, then he divided it making ten sheep equivalent to one camel. While they were like that, a camel ran away. The people had only a few horses, so they went after fit and it and it got away from them. A man shot an arrow at it and stopped it. The Messenger of Allah said: 'Some of these animals arte untamed like wild animals, so if one of them goes out of your control, do the same.\"",
      "chain": [
        "38022",
        "20315",
        "20320",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "4391",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا أحمد بن عبد الله بن الحكم، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، قال حدثنا سفيان الثوري، عن أبيه، عن عباية بن رفاعة بن رافع، عن جده، رافع بن خديج قال كان رسول الله صلى الله عليه وسلم يجعل في قسم الغنائم عشرا من الشاء ببعير ‏.‏ قال شعبة وأكبر علمي أني سمعته من سعيد بن مسروق وحدثني به سفيان عنه والله تعالى أعلم ‏.‏",
      "text_en": " It was narrated that Rafi bin Khadij Said:                     \"When distributing the spoils of war, the Messenger of Allah used to make ten sheep equivalent to one camel.\" Shu'bah said: \"I know most if it from what I heard form Sa'eed bin Masruq, and Sufyan narrated it to me.\" (Sahih )",
      "chain": [
        "20173",
        "20020",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "4403",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا محمد بن منصور، قال حدثنا سفيان، عن عمر بن سعيد، عن أبيه، عن عباية بن رفاعة، عن رافع بن خديج، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما أنهر الدم وذكر اسم الله فكل إلا بسن أو ظفر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Rafi bin Khadij that the Messenger of Allah said:                     \"If the blood is shed and the name of Allah is mentioned, then eat, unless (it is slaughtered) with teeth or nails.\"",
      "chain": [
        "36658",
        "20005",
        "10652",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "4404",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا هناد بن السري، عن أبي الأحوص، عن سعيد بن مسروق، عن عباية بن رفاعة، عن أبيه، عن جده، رافع بن خديج قال قلت يا رسول الله إنا نلقى العدو غدا وليس معنا مدى ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما أنهر الدم وذكر اسم الله عز وجل فكلوا ما لم يكن سنا أو ظفرا وسأحدثكم عن ذلك أما السن فعظم وأما الظفر فمدى الحبشة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi bin Khadij said:                     \"I said: 'O Messenger of Allah we are going to meet the enemy tomorrow and we do not have any knives.' The Messenger of Allah said: \"If the blood is shed and the name of Allah is mentioned, then eat, unless (it is slaughtered (with teeth or nails, and I will tell you about that. As for teeth, they are bones, and as for nails, they are the knives of the Ethiopians.\"' (Sahih )",
      "chain": [
        "30480",
        "20327",
        "20016",
        "11179",
        "11506",
        "1986"
      ]
    },
    {
      "hadith_no": "4410",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا عمرو بن علي، قال أنبأنا يحيى بن سعيد، قال حدثنا سفيان، قال حدثني أبي، عن عباية بن رفاعة، عن رافع بن خديج، قال قلت يا رسول الله إنا لاقو العدو غدا وليست معنا مدى ‏.‏ قال ‏\"‏ ما أنهر الدم وذكر اسم الله عز وجل فكل ليس السن والظفر وسأحدثكم أما السن فعظم وأما الظفر فمدى الحبشة ‏\"‏ ‏.‏ وأصبنا نهبة إبل أو غنم فند منها بعير فرماه رجل بسهم فحبسه فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن لهذه الإبل أوابد كأوابد الوحش فإذا غلبكم منها شىء فافعلوا به هكذا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi bin Khadij said:                     \"I said: 'O Messenger of Allah, we are going to meet the enemy tomorrow, and we do not have any knives.' He said: If the blood is shed and the name of Allah is mentioned, then eat, unlike (it is slaughtered) with teeth or nails and I will tell you about that. As for teeth, they are bones, and as for nails, they are the knives of the Ethiopians,; We acquired some spoils of war including sheep or camels, and a camel ran away, so a man shot an arrow at it an stopped it. The Messenger of Allah said: 'some of these animals' or 'these camels'- 'are untamed like wild animals, so if one of them goes out of your control, do the same.\" (Sahih )",
      "chain": [
        "30153",
        "20031",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "4535",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا أبو الأحوص، عن طارق، عن سعيد بن المسيب، عن رافع بن خديج، قال نهى رسول الله صلى الله عليه وسلم عن المحاقلة والمزابنة ‏.‏",
      "text_en": " It was narrated that Rafi bin Khadij said:                     \"the Messenger of Allah forbade Muhaqalah and Muzabana.\"(Hasan )",
      "chain": [
        "30367",
        "20327",
        "11355",
        "11002",
        "1986"
      ]
    },
    {
      "hadith_no": "4543",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا الحسين بن عيسى، قال حدثنا أبو أسامة، قال حدثني الوليد بن كثير، قال أخبرني بشير بن يسار، أن رافع بن خديج، وسهل بن أبي حثمة، حدثاه أن رسول الله صلى الله عليه وسلم نهى عن المزابنة بيع الثمر بالتمر إلا لأصحاب العرايا فإنه أذن لهم ‏.‏",
      "text_en": " Rafi bin Khadij and Sahl Bi Abi Hathamah narrated that the Messenger of Allah forbade Muzabanah, which means selling fresh dates still on the tree for dried dates, except in cases of 'Araya, for which he gave permission. (Sahih",
      "chain": [
        "20318",
        "11230",
        "11810",
        "1986",
        "1822"
      ]
    },
    {
      "hadith_no": "4712",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن يحيى، عن بشير بن يسار، عن سهل بن أبي حثمة، قال وحسبت قال وعن رافع بن خديج، أنهما قالا خرج عبد الله بن سهل بن زيد ومحيصة بن مسعود حتى إذا كانا بخيبر تفرقا في بعض ما هنالك ثم إذا بمحيصة يجد عبد الله بن سهل قتيلا فدفنه ثم أقبل إلى رسول الله صلى الله عليه وسلم هو وحويصة بن مسعود وعبد الرحمن بن سهل - وكان أصغر القوم - فذهب عبد الرحمن يتكلم قبل صاحبيه فقال له رسول الله صلى الله عليه وسلم ‏\"‏ كبر الكبر في السن ‏\"‏ ‏.‏ فصمت وتكلم صاحباه ثم تكلم معهما فذكروا لرسول الله صلى الله عليه وسلم مقتل عبد الله بن سهل فقال لهم ‏\"‏ أتحلفون خمسين يمينا وتستحقون صاحبكم أو قاتلكم ‏\"‏ ‏.‏ قالوا كيف نحلف ولم نشهد قال ‏\"‏ فتبرئكم يهود بخمسين يمينا ‏\"‏ ‏.‏ قالوا وكيف نقبل أيمان قوم كفار فلما رأى ذلك رسول الله صلى الله عليه وسلم أعطاه عقله ‏.‏",
      "text_en": " It was narrated from Yahya, from Bushair bin Yasa, from Sahl bin Abi Hathmah who said - and I think he said:                     and from Rafi bin Khadij, the two of them said - :\"Abdullah bin Sahl bin Zaid and Muhayysah bin Mas'ud went out until when they reached Khaibar, they went their separate ways. Then Muhayysah found 'Abdullah bin Sahl slain, so he buried him. Then he came to the Mesenger of Allah, along with Huwayysah bin Mas'ud and 'Abdur-Rahman bin Sahl, who was the youngest of them, 'Abdur-Rahman started to speak before his two companions, but the Messenger of Allah said to him: \"Let the clear speak first.\" So he fell silent and his two companions spoke, then he spoke with them. They told the Messenger of Allah about the killing of 'Abdullah bin Sahl, and he said to them: \"Will you swear fifty oaths, then you will receive compensation, or be entitled to retaliate?\" They said: \"How can we swear an oath when we did not witness what happened?\" he said: \"Then can the Jews swear fifty oaths declaring their innocence?\" They said: \"How can we accept the oath of a disbelieving people?\" When the Messenger of Allah saw that, he paid the blood money (himself).",
      "chain": [
        "30367",
        "20023",
        "20031",
        "11810",
        "1822",
        "1986"
      ]
    },
    {
      "hadith_no": "4713",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن عبدة، قال أنبأنا حماد، قال حدثنا يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، ورافع بن خديج، أنهما حدثاه أن محيصة بن مسعود وعبد الله بن سهل أتيا خيبر في حاجة لهما فتفرقا في النخل فقتل عبد الله بن سهل فجاء أخوه عبد الرحمن بن سهل وحويصة ومحيصة ابنا عمه إلى رسول الله صلى الله عليه وسلم فتكلم عبد الرحمن في أمر أخيه - وهو أصغر منهم - فقال رسول الله صلى الله عليه وسلم ‏\"‏ الكبر ليبدأ الأكبر ‏\"‏ ‏.‏ فتكلما في أمر صاحبهما فقال رسول الله صلى الله عليه وسلم وذكر كلمة معناها ‏\"‏ يقسم خمسون منكم ‏\"‏ ‏.‏ فقالوا يا رسول الله أمر لم نشهده كيف نحلف قال ‏\"‏ فتبرئكم يهود بأيمان خمسين منهم ‏\"‏ ‏.‏ قالوا يا رسول الله قوم كفار ‏.‏ فوداه رسول الله صلى الله عليه وسلم من قبله ‏.‏ قال سهل فدخلت مربدا لهم فركضتني ناقة من تلك الإبل ‏.‏",
      "text_en": " It was narrated from Sahl bin Ab Hathmah and Rafi bin Khadij that:                     Muhayysah bin Mas'ud and 'Abdullah bin Sahl went to Khaibar for some need they had there, and they parted among the palm trees. 'Abdullah bin Sahl was killed, and 'Abdullah bin Sahl was killed, and his brother 'Abdur-Rahman bin Shl, and Huwayysah, and Musayysah, his paternal cousins, came to the Messenger of Allah. 'Abdur-Rahan spoke about his brother's case, but he was the youngest of them, so the Messenger of Allah said: \"Let the elders speak first.\" So they spoke about their companions, and the Messenger of Allah said: Let fifty of your swear an oath.\" The said: \"O Messenger of Allah, it is something that we did not witness: how can we swear an oath?\" He said: \"Then let the Jews swear fifty oaths to their innocence.\" They said: \"O Messenger of Allah, they area) a disbelieving people,\" So the Messenger of Allah paid the blood money himself Sahl said: \"I entered a Mirbad of theirs, and one of those camels kicked me.\"",
      "chain": [
        "30423",
        "20022",
        "20031",
        "11810",
        "1822",
        "1986"
      ]
    },
    {
      "hadith_no": "4960",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا محمد بن خالد بن خلي، قال حدثنا أبي قال، حدثنا سلمة، - يعني ابن عبد الملك العوصي - عن الحسن، - وهو ابن صالح - عن يحيى بن سعيد، عن القاسم بن محمد بن أبي بكر، عن رافع بن خديج، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا قطع في ثمر ولا كثر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi bin Khadij said:                     \"I heard the Messenger of Allah say: 'The hand is not to be cut off for (stealing) produce or the spadix of palm trees.\"'",
      "chain": [
        "38496",
        "28220",
        "20647",
        "11062",
        "10535",
        "1986"
      ]
    },
    {
      "hadith_no": "4961",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا عمرو بن علي، قال سمعت يحيى بن سعيد القطان، يقول حدثنا يحيى بن سعيد، عن محمد بن يحيى بن حبان، عن رافع بن خديج، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا قطع في ثمر ولا كثر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi bin Khadij said:                     \"I heard the Messenger of Allah say: 'The hand is not to be cut off for (stealing) produce or the spadix of palm trees.\"'",
      "chain": [
        "30153",
        "20031",
        "11062",
        "11222",
        "1986"
      ]
    },
    {
      "hadith_no": "4962",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرني يحيى بن حبيب بن عربي، قال حدثنا حماد، عن يحيى، عن محمد بن يحيى بن حبان، عن رافع بن خديج، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا قطع في ثمر ولا كثر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi bin Khadij said:                     \"I heard the Messenger of Allah say: 'The hand is not to be cut off for (stealing) produce or the spadix of palm trees.\"'",
      "chain": [
        "30459",
        "20022",
        "20031",
        "11222",
        "1986"
      ]
    },
    {
      "hadith_no": "4963",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا عبد الرحمن بن محمد بن سلام، قال حدثنا أبو معاوية، عن يحيى بن سعيد، عن محمد بن يحيى بن حبان، عن رافع بن خديج، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا قطع في ثمر ولا كثر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi bin Khadij said:                     \"I heard the Messenger of Allah say: 'The hand is not to be cut off for (stealing) produce or the spadix of palm trees.\"'",
      "chain": [
        "36587",
        "20354",
        "11062",
        "11222",
        "1986"
      ]
    },
    {
      "hadith_no": "4964",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا عبد الحميد بن محمد، قال حدثنا مخلد، قال حدثنا سفيان، عن يحيى، عن محمد بن يحيى بن حبان، عن رافع بن خديج، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا قطع في ثمر ولا كثر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi bin Khadij said:                     \"I heard the Messenger of Allah say: 'The hand is not to be cut off for (stealing) produce or the spadix of palm trees.\"'",
      "chain": [
        "20462",
        "20012",
        "20031",
        "11222",
        "1986"
      ]
    },
    {
      "hadith_no": "4965",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا أبو نعيم، عن سفيان، عن يحيى، عن محمد بن يحيى بن حبان، عن رافع بن خديج، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا قطع في ثمر ولا كثر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi bin Khadij said:                     \"I heard the Messenger of Allah say: 'The hand is not to be cut off for (stealing) produce or the spadix of palm trees.\"'",
      "chain": [
        "34188",
        "20348",
        "20012",
        "20031",
        "11222",
        "1986"
      ]
    },
    {
      "hadith_no": "4966",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا أحمد بن محمد بن عبيد الله، - هو ابن أبي رجاء - قال حدثنا وكيع، عن سفيان، عن يحيى بن سعيد، عن محمد بن يحيى بن حبان، عن عمه، واسع، عن رافع بن خديج، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا قطع في ثمر ولا كثر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi bin Khadij said:                     \"I heard the Messenger of Allah say: 'The hand is not to be cut off for (stealing) produce or the spadix of palm trees.\"'",
      "chain": [
        "30304",
        "20032",
        "20012",
        "11062",
        "11222",
        "1986"
      ]
    },
    {
      "hadith_no": "4967",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن يحيى بن سعيد، عن محمد بن يحيى بن حبان، عن عمه، أن رافع بن خديج، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا قطع في ثمر ولا كثر ‏\"‏ ‏.‏ والكثر الجمار ‏.‏",
      "text_en": " Rafi bin Khadij said:                     \"I heard the Messenger of Allah say: 'The hand is not be cut off for (stealing) produce or the spadix of palm trees.\"'",
      "chain": [
        "30367",
        "20023",
        "11062",
        "11222",
        "1986"
      ]
    },
    {
      "hadith_no": "4968",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا محمد بن علي بن ميمون، قال حدثنا سعيد بن منصور، قال حدثنا عبد العزيز بن محمد، عن يحيى بن سعيد، عن محمد بن يحيى بن حبان، عن أبي ميمون، عن رافع بن خديج، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا قطع في ثمر ولا كثر ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذا خطأ أبو ميمون لا أعرفه ‏.‏",
      "text_en": " It was narrated that Rafi bin Khadij said:                     \"I heard the Messenger of Allah say: 'The hand is not to be cut off for (stealing) produce or the spadix of palm trees.\"' (Sahih)   Abu 'Abdur-Rahman (An-Nasai) said: This is a mistake, and I do not know who Abu Maimun (one of the narrators) is.",
      "chain": [
        "38556",
        "30116",
        "20167",
        "11062",
        "11222",
        "1986"
      ]
    },
    {
      "hadith_no": "4969",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا الحسين بن منصور، قال حدثنا أبو أسامة، قال حدثنا يحيى بن سعيد، عن محمد بن يحيى بن حبان، عن رجل، من قومه عن رافع بن خديج، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا قطع في ثمر ولا كثر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi bin Khadij said:                     \"I heard the Messenger of Allah say: 'The hand is not to be cut off for (stealing) produce or the spadix of palm trees.\"'",
      "chain": [
        "38181",
        "20318",
        "20031",
        "11222",
        "1986"
      ]
    },
    {
      "hadith_no": "4970",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا بشر، قال حدثنا يحيى بن سعيد، أن رجلا، من قومه حدثه عن عم، له أن رافع بن خديج، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا قطع في ثمر ولا كثر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi bin Khadij said:                     \"I heard the Messenger of Allah say: 'The hand is not to be cut off for (stealing) produce or the spadix of palm trees.\"'",
      "chain": [
        "30153",
        "20212",
        "11062",
        "1986"
      ]
    },
    {
      "hadith_no": "165",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، وأبو كريب قالا حدثنا وكيع، حدثنا سفيان، عن يحيى بن سعيد، عن عباية بن رفاعة، عن جده، رافع بن خديج قال جاء جبريل - أو ملك - إلى النبي  صلى الله عليه وسلم  فقال ‏\"‏ ما تعدون من شهد بدرا فيكم قالوا خيارنا ‏.‏ قال كذلك هم عندنا خيار الملائكة ‏\"‏ ‏.‏",
      "text_en": " Rafi' bin Khadij said:                     \"Jibril or an angel came to the Prophet and said: 'How do you regard those among you who were present at Badr?' He said: 'They are the best among us.' He said: 'We think the same (of the angels who were present at Badr), they are the best of the angels.'\"",
      "chain": [
        "38409",
        "30216",
        "20032",
        "20012",
        "11062",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "672",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن الصباح، أنبأنا سفيان بن عيينة، عن ابن عجلان، سمع عاصم بن عمر بن قتادة، - وجده بدري - يخبر عن محمود بن لبيد، عن رافع بن خديج، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ أصبحوا بالصبح فإنه أعظم للأجر أو لأجركم ‏\"‏ ‏.‏ ‏.‏",
      "text_en": " It was narrated from Rafi' bin Khadij that:                     The Prophet said: \"Pray the Subh early, for indeed its reward is greater\" or \"your reward.\"",
      "chain": [
        "30269",
        "20005",
        "10616",
        "1830",
        "1986"
      ]
    },
    {
      "hadith_no": "687",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، حدثنا أبو النجاشي، قال سمعت رافع بن خديج، يقول كنا نصلي المغرب على عهد رسول الله  صلى الله عليه وسلم  فينصرف أحدنا وإنه لينظر إلى مواقع نبله ‏.‏ حدثنا أبو يحيى الزعفراني، حدثنا إبراهيم بن موسى، نحوه ‏.‏",
      "text_en": " Abu Najashi said:                     \"I heard Rafi' bin Khadij say: 'We used to perform the Maghrib at the time of the Messenger of Allah, and one of us would be able to see the places where his arrows would land when shot from his bow.'\" (Sahih)Another chain with similar wording.",
      "chain": [
        "30285",
        "20733",
        "20024",
        "1986"
      ]
    },
    {
      "hadith_no": "1220",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الوهاب بن الضحاك، حدثنا إسماعيل بن عياش، عن محمد بن إسحاق، عن عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن رافع بن خديج، قال أتانا رسول الله  صلى الله عليه وسلم  في بني عبد الأشهل فصلى بنا المغرب في مسجدنا ثم قال ‏\"‏ اركعوا هاتين الركعتين في بيوتكم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Rafi’ bin Khadij said:                      “We came to the MessengerofAllah (ﷺ) with Banu ‘Abdul-Ashhal, and he led us in praying theMaghrib in our mosque. Then he said: ‘Pray these two Rak’ah inyourhouses.’”",
      "chain": [
        "38361",
        "20736",
        "11107",
        "11103",
        "1830",
        "1986"
      ]
    },
    {
      "hadith_no": "1881",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو كريب، حدثنا عبدة بن سليمان، ومحمد بن فضيل، ويونس بن بكير، عن محمد بن إسحاق، عن عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن رافع بن خديج، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ العامل على الصدقة بالحق كالغازي في سبيل الله حتى يرجع إلى بيته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that:                     Rafi bin Khadij said: “I heard the Messenger of Allah say: 'The person who is appointed to collect the Sadaqah - who does so with sincerity and fairness is like one who foes out to fight for the sake of Allah, until he returns to the house.' ”",
      "chain": [
        "30216",
        "20337",
        "20356",
        "20118",
        "11107",
        "11103",
        "1830",
        "1986"
      ]
    },
    {
      "hadith_no": "2353",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا هناد بن السري، حدثنا أبو الأحوص، عن طارق بن عبد الرحمن، عن سعيد بن المسيب، عن رافع بن خديج، قال نهى رسول الله  صلى الله عليه وسلم  عن المحاقلة والمزابنة ‏.‏",
      "text_en": " It was narrated that Rafi, bin Khadij said:                     \"The Messenger of Allah (ﷺ) forbade the Muhaqalah and the Muzabanah.\"",
      "chain": [
        "30480",
        "20327",
        "11355",
        "11002",
        "1986"
      ]
    },
    {
      "hadith_no": "2543",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا هناد بن السري، حدثنا أبو الأحوص، عن طارق بن عبد الرحمن، عن سعيد بن المسيب، عن رافع بن خديج، قال نهى رسول الله صلى الله عليه وسلم عن المحاقلة والمزابنة ‏.‏ وقال ‏\"‏ إنما يزرع ثلاثة رجل له أرض فهو يزرعها ورجل منح أرضا فهو يزرع ما منح ورجل استكرى أرضا بذهب أو فضة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi 'bin Khadji said:                     “The Messenger of Allah (ﷺ) forbade Muhaqalah and Muzabanah, and said: 'Only three may cultivate: A man who has land which he cultivates a man who was given some land and cultivates what he was given; and a man who takes land on lease for gold or silver.' ”",
      "chain": [
        "30480",
        "20327",
        "11355",
        "11002",
        "1986"
      ]
    },
    {
      "hadith_no": "2547",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو كريب، حدثنا عبدة بن سليمان، وأبو أسامة ومحمد بن عبيد عن عبيد الله، - أو قال عبد الله بن عمر - عن نافع، عن ابن عمر، أنه كان يكري أرضا له مزارعا فأتاه إنسان فأخبره عن رافع بن خديج أن رسول الله صلى الله عليه وسلم نهى عن كراء المزارع فذهب ابن عمر وذهبت معه حتى أتاه بالبلاط فسأله عن ذلك فأخبره أن رسول الله صلى الله عليه وسلم نهى عن كراء المزارع فترك عبد الله كراءها ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     he used to lease out some land that belonged to him, for cultivation. Then someone came to him and told him that Rafi' bin Khadij said that the Messenger of Allah (ﷺ) had forbidden leasing out land for cultivation. Ibn 'Umar went, and I went with him, until he met him in Balat, and asked him about that, and he told him that the Messenger of Allah (ﷺ) had forbidden leasing out land for cultivation. So 'Abdullah stopped lessening out land.",
      "chain": [
        "30216",
        "20337",
        "20507",
        "11014",
        "18",
        "1986"
      ]
    },
    {
      "hadith_no": "2552",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن الصباح، حدثنا سفيان بن عيينة، عن يحيى بن سعيد، عن حنظلة بن قيس، قال سألت رافع بن خديج قال كنا نكري الأرض على أن لك ما أخرجت هذه ولي ما أخرجت هذه فنهينا أن نكريها بما أخرجت ولم ننه أن نكري الأرض بالورق ‏.‏",
      "text_en": " It was narrated that Hazalah bin Qais said:                     “I asked Rafi' bin Khadij and he said: 'We used to lease out land on the basis that you would have what is produced by this piece of land, and I would have what is produced by this (other) piece of land, and we were forbidden to lease it out on the basis of crop-sharing but he did not forbid us to rent out land for silver.”",
      "chain": [
        "30269",
        "20005",
        "11062",
        "11503",
        "1986"
      ]
    },
    {
      "hadith_no": "2553",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، حدثني أبو النجاشي، أنه سمع رافع بن خديج، يحدث عن عمه، ظهير قال نهانا رسول الله صلى الله عليه وسلم عن أمر كان لنا رافقا ‏.‏ فقلت ما قال رسول الله صلى الله عليه وسلم فهو حق ‏.‏ فقال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما تصنعون بمحاقلكم ‏\"‏ ‏.‏ قلنا نؤاجرها على الثلث والربع والأوسق من البر والشعير ‏.‏ فقال ‏\"‏ فلا تفعلوا ازرعوها أو أزرعوها ‏\"‏ ‏.‏",
      "text_en": " Rafi'bin Khadi'j narrated that his paternal uncle Zuhair said:                     “The Messenger of Allah (ﷺ) forbade us from doing something that was convenient for us.” I said: “What the Messenger of Allah (ﷺ) said is true.” He said that the Messenger of Allah (ﷺ) said: “What do you with your farms?” We said: “We rent them out for one third or one quarter of their yield, and a certain amount of wheat and barley.” He said: “Do not do that; cultivate them or let others cultivate them.”",
      "chain": [
        "30285",
        "20733",
        "20024",
        "1986"
      ]
    },
    {
      "hadith_no": "2554",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن يحيى، أنبأنا عبد الرزاق، أنبأنا الثوري، عن منصور، عن مجاهد، عن أسيد بن ظهير ابن أخي، رافع بن خديج عن رافع بن خديج، قال كان أحدنا إذا استغنى عن أرضه، أعطاها بالثلث والربع والنصف واشترط ثلاثة جداول والقصارة وما سقى الربيع وكان العيش إذ ذاك شديدا وكان يعمل فيها بالحديد وبما شاء الله ويصيب منها منفعة فأتانا رافع بن خديج فقال إن رسول الله صلى الله عليه وسلم نهاكم عن أمر كان لكم نافعا وطاعة الله وطاعة رسوله أنفع لكم إن رسول الله صلى الله عليه وسلم ينهاكم عن الحقل ويقول ‏\"‏ من استغنى عن أرضه فليمنحها أخاه أو ليدع ‏\"‏ ‏.‏",
      "text_en": " It was narrated  from Usaid bin Zuhair, the paternal nephew of Rafi' bin Khdij, that Rafi' bin Khadij said:                     “If one of us did not need his land, he would give it (to someone else to cultivate) in return for one third, or one half of the yield , and he would stipulate (that the should receive) the produce grows on the banks of three streams, and the grains that remain in the ear after threshing, and the produce irrigated by a stream. Life at that time was hard, and he would work (the land) with iron and whatever Allah (SWT) willed, and he would benefit from it. Then Rafi bin Khadij came to us and said: ‘The Messenger of Allah (ﷺ) forbade you to do something that may seem beneficial to you, but obedience to Allah and obedience to His Messenger are more beneficial for you. The Messenger of Allah (ﷺ) forbade Haq for you, and he said: “Whoever has no need of his land, let him give it to his brother (to cultivate) or let him leave it (uncultivated).”",
      "chain": [
        "11222",
        "20121",
        "20012",
        "11067",
        "11028",
        "1988",
        "1986"
      ]
    },
    {
      "hadith_no": "2559",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا خالد بن الحارث، حدثنا سعيد بن أبي عروبة، عن يعلى بن حكيم، عن سليمان بن يسار، عن رافع بن خديج، قال كنا نحاقل على عهد رسول الله صلى الله عليه وسلم فزعم أن بعض عمومته أتاهم فقال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كانت له أرض فلا يكريها بطعام مسمى ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi` bin khadij said:                     We used to give land in return for food at the time of the Messenger of Allah (ﷺ), and some of my paternal uncles came to them and said: “The Messenger of Allah (ﷺ) said: 'Whoever has land, he should not rent it out for a set amount of food.”",
      "chain": [
        "30430",
        "20226",
        "11073",
        "11567",
        "11005",
        "1986"
      ]
    },
    {
      "hadith_no": "2560",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا عبد الله بن عامر بن زرارة، حدثنا شريك، عن أبي إسحاق، عن عطاء، عن رافع بن خديج، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من زرع في أرض قوم بغير إذنهم فليس له من الزرع شىء وترد عليه نفقته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi` bin Khadij said:                     “The Messenger of Allah (ﷺ) said: 'Whoever cultivates people`s land without their permission, he has no right to any produce, but he should be recompensed for his expenditure.' ”",
      "chain": [
        "30467",
        "20587",
        "11049",
        "11029",
        "1986"
      ]
    },
    {
      "hadith_no": "2691",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن سفيان، عن يحيى بن سعيد، عن محمد بن يحيى بن حبان، عن عمه، واسع بن حبان، عن رافع بن خديج، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا قطع في ثمر ولا كثر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Rafi bin Khadij that the Messenger of Allah (ﷺ) said:                     “The hand is not to be cut off for (stealing) produce or the spadix of palm trees.”",
      "chain": [
        "38409",
        "20032",
        "20012",
        "11062",
        "11222",
        "1321",
        "1986"
      ]
    },
    {
      "hadith_no": "3257",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا أبو كريب، حدثنا المحاربي، وعبد الرحيم، عن سفيان الثوري، عن سعيد بن مسروق، وحدثنا الحسين بن علي، عن زائدة، عن سعيد بن مسروق، عن عباية بن رفاعة، عن رافع بن خديج، قال كنا مع رسول الله  صلى الله عليه وسلم  ونحن بذي الحليفة من تهامة فأصبنا إبلا وغنما فعجل القوم فأغلينا القدور قبل أن تقسم فأتانا رسول الله  صلى الله عليه وسلم  فأمر بها فأكفئت ثم عدل الجزور بعشرة من الغنم ‏.‏",
      "text_en": " It wasnarrated that Rafi’ bin Khadij said:                      “We were with theMessengerof Allah (ﷺ) in Dhul-Hulaifah in (the land of) Tihamah. Weacquiredsheep and camels and the people hastened to put cooking potson thefires before they had been distributed. The Messenger of Allah(ﷺ)came to us and ordered that they be overturned,* then he madeonecamel equivalent to ten sheep.”",
      "chain": [
        "30216",
        "20333",
        "20334",
        "20012",
        "20016",
        "20315",
        "20320",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "3299",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا عمر بن عبيد الطنافسي، عن سعيد بن مسروق، عن عباية بن رفاعة، عن جده، رافع بن خديج قال كنا مع رسول الله  صلى الله عليه وسلم  في سفر فقلت يا رسول الله إنا نكون في المغازي فلا يكون معنا مدى فقال ‏\"‏ ما أنهر الدم وذكر اسم الله عليه فكل غير السن والظفر فإن السن عظم والظفر مدى الحبشة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Rafi’ bin Khadij said:                      “We were with the Prophet(ﷺ) on a journey, and I said: ‘O Messenger of Allah, we are(sometimes) on military campaigns, and we have no knife with us.’Hesaid: ‘(Use) whatever causes the blood to flow, mention the NameofAllah and eat, but (do not use) teeth or nails, for the tooth is abone and the nail is the knife of the Ethiopians.”",
      "chain": [
        "30212",
        "20346",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "3304",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا عمر بن عبيد، عن سعيد بن مسروق، عن عباية بن رفاعة، عن جده، رافع بن خديج قال كنا مع النبي  صلى الله عليه وسلم  في سفر فند بعير فرماه رجل بسهم فقال النبي  صلى الله عليه وسلم  ‏\"‏ إن لها أوابد - أحسبه قال - كأوابد الوحش فما غلبكم منها فاصنعوا به هكذا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Rafi’ bin Khadij said:                      “We were with the Prophet(ﷺ) on a journey, and a camel ran away. A man shot an arrow at itand the Prophet (ﷺ) said: ‘It has the inclination to run awaylike awild animal. If this happens to any of you, do likewise.’”",
      "chain": [
        "30212",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "3602",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا مصعب بن المقدام، حدثنا إسرائيل، عن سعيد بن مسروق، عن عباية بن رفاعة، عن رافع بن خديج، قال سمعت النبي  صلى الله عليه وسلم  يقول ‏\"‏ الحمى من فيح جهنم فابردوها بالماء ‏\"‏ ‏.‏ فدخل على ابن لعمار فقال ‏\"‏ اكشف الباس رب الناس إله الناس ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Rafi’ bin Khadij said:                      “I heard the Prophet(ﷺ)say: ‘Fever is from the heat of the Hell-fire, so cool it downwithwater.’ He entered upon a son of ‘Ammar and said: ‘Take awaytheharm, O Lord of mankind, O God of mankind.’”",
      "chain": [
        "30212",
        "20608",
        "20311",
        "20016",
        "11179",
        "1986"
      ]
    }
  ],
  "total_hadiths": 144
}