{
  "id": "19861",
  "name": "Asma'a bin al-Hakam al-Fzary أسماء بن الحكم الفزاري وقيل",
  "full_name": "Asma'a bin al-Hakam al-Fzary أسماء بن الحكم الفزاري وقيل",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ 4  -  صدوق ]"
    ],
    "tags": [
      "al-Fazari",
      "al-Salmi",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "1521",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا مسدد، حدثنا أبو عوانة، عن عثمان بن المغيرة الثقفي، عن علي بن ربيعة الأسدي، عن أسماء بن الحكم الفزاري، قال سمعت عليا، - رضي الله عنه - يقول كنت رجلا إذا سمعت من رسول الله صلى الله عليه وسلم حديثا نفعني الله منه بما شاء أن ينفعني وإذا حدثني أحد من أصحابه استحلفته فإذا حلف لي صدقته قال وحدثني أبو بكر وصدق أبو بكر - رضى الله عنه - أنه قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من عبد يذنب ذنبا فيحسن الطهور ثم يقوم فيصلي ركعتين ثم يستغفر الله إلا غفر الله له ‏\"‏ ‏.‏ ثم قرأ هذه الآية ‏{‏ والذين إذا فعلوا فاحشة أو ظلموا أنفسهم ذكروا الله ‏}‏ إلى آخر الآية ‏.‏",
      "text_en": " Narrated AbuBakr as-Siddiq:                     Asma' bint al-Hakam said: I heard Ali say: I was a man; when I heard a tradition from the Messenger of Allah (ﷺ), Allah benefited me with it as much as He willed. But when some one of his companions narrated a tradition to me I adjured him. When he took an oath, I testified him. AbuBakr narrated to me a tradition, and AbuBakr narrated truthfully. He said: I heard the apostle of Allah (ﷺ) saying: When a servant (of Allah) commits a sin, and he performs ablution well, and then stands and prays two rak'ahs, and asks pardon of Allah, Allah pardons him. He then recited this verse: \"And those who, when they commit indecency or wrong their souls, remember Allah\" (Al-Qur'an 3:135).",
      "chain": [
        "30175",
        "20469",
        "11640",
        "11376",
        "19861"
      ]
    },
    {
      "hadith_no": "406",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا أبو عوانة، عن عثمان بن المغيرة، عن علي بن ربيعة، عن أسماء بن الحكم الفزاري، قال سمعت عليا، يقول إني كنت رجلا إذا سمعت من، رسول الله صلى الله عليه وسلم حديثا نفعني الله منه بما شاء أن ينفعني به وإذا حدثني رجل من أصحابه استحلفته فإذا حلف لي صدقته وإنه حدثني أبو بكر وصدق أبو بكر قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من رجل يذنب ذنبا ثم يقوم فيتطهر ثم يصلي ثم يستغفر الله إلا غفر الله له ‏\"‏ ‏.‏ ثم قرأ هذه الآية ‏:‏ ‏(‏والذين إذا فعلوا فاحشة أو ظلموا أنفسهم ذكروا الله فاستغفروا لذنوبهم ومن يغفر الذنوب إلا الله ولم يصروا على ما فعلوا وهم يعلمون ‏)‏ ‏.‏ قال وفي الباب عن ابن مسعود وأبي الدرداء وأنس وأبي أمامة ومعاذ وواثلة وأبي اليسر واسمه كعب بن عمرو ‏.‏ قال أبو عيسى حديث علي حديث حسن لا نعرفه إلا من هذا الوجه من حديث عثمان بن المغيرة ‏.‏ وروى عنه شعبة وغير واحد فرفعوه مثل حديث أبي عوانة ‏.‏ ورواه سفيان الثوري ومسعر فأوقفاه ولم يرفعاه إلى النبي صلى الله عليه وسلم وقد روي عن مسعر هذا الحديث مرفوعا أيضا ‏.‏ ولا نعرف لأسماء بن الحكم حديثا مرفوعا إلا هذا ‏.‏",
      "text_en": " Asma bin Al-Hakam Al-Fazari said:                     \"I heard Ali saying: 'Indeed I am a man who, when I heard a Hadith from Allah's Messenger (S) then Allah causes me to benefit from it as much as He wills for me to benefit from it. When a man among his Companions narrated to me I ask him to swear an oath to me about it, and when he swears an oath to me I trust him. And Abu Bakr narrated to me - and Abu Bakr told the truth - he said: \"I heard Allah's Messenger (S) saying: 'There is no man who commits a sin, then makes Wudu, then performs Salat, then seeks forgiveness from Allah, except that Allah forgives him.' Then he recited this Ayah: Those who when they have committed Fahishah or wronged themselves with eveil, remember Allah. (3:135) until the end of the Ayah.\"",
      "chain": [
        "30367",
        "20469",
        "11640",
        "11376",
        "19861",
        "5"
      ]
    },
    {
      "hadith_no": "3276",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا قتيبة، حدثنا أبو عوانة، عن عثمان بن المغيرة، عن علي بن ربيعة، عن أسماء بن الحكم الفزاري، قال سمعت عليا، يقول إني كنت رجلا إذا سمعت من، رسول الله صلى الله عليه وسلم حديثا نفعني الله منه بما شاء أن ينفعني وإذا حدثني رجل من أصحابه استحلفته فإذا حلف لي صدقته وإنه حدثني أبو بكر وصدق أبو بكر قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من رجل يذنب ذنبا ثم يقوم فيتطهر ثم يصلي ثم يستغفر الله إلا غفر له ‏\"‏ ‏.‏ ثم قرأ هذه الآية ‏:‏ ‏(‏والذين إذا فعلوا فاحشة أو ظلموا أنفسهم ذكروا الله فاستغفروا ‏)‏ إلى آخر الآية ‏.‏ قال أبو عيسى هذا حديث قد رواه شعبة وغير واحد عن عثمان بن المغيرة فرفعوه ورواه مسعر وسفيان عن عثمان بن المغيرة فلم يرفعاه وقد رواه بعضهم عن مسعر فأوقفه ورفعه بعضهم ورواه سفيان الثوري عن عثمان بن المغيرة فأوقفه ولا نعرف لأسماء بن الحكم حديثا إلا هذا ‏.‏",
      "text_en": " Narrated Asma bin Al-Hakam Al-Farazi:                     \"I heard 'Ali saying: 'Indeed I am a man who, when I hear a Hadith from the Messenger of Allah (ﷺ), then Allah causes me to benefit from it as much as He wills for me to benefit from it. When a man among his Companions narrates to me I ask him to swear an oath to me, about it, and when he swears an oath to me I trust him. And Abu Bakr narrated to me - and Abu Bakr told the truth - he said: \"I heard the Messenger of Allah (ﷺ) saying: 'There is no man who commits a sin, then stands for purification, then performs Salat, then seeks forgiveness from Allah, except that Allah forgives him.' Then he recites this Ayah: Those who, when they have committed Fahishah or wronged themselves with evil, remember Allah... (3:135) until the end of the Ayah.\"",
      "chain": [
        "30367",
        "20469",
        "11640",
        "11376",
        "19861",
        "5"
      ]
    },
    {
      "hadith_no": "1459",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ونصر بن علي، قالا حدثنا وكيع، حدثنا مسعر، وسفيان، عن عثمان بن المغيرة الثقفي، عن علي بن ربيعة الوالبي، عن أسماء بن الحكم الفزاري، عن علي بن أبي طالب، قال كنت إذا سمعت من، رسول الله  صلى الله عليه وسلم  حديثا ينفعني الله بما شاء منه وإذا حدثني عنه غيره استحلفته فإذا حلف صدقته وإن أبا بكر حدثني وصدق أبو بكر قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ما من رجل يذنب ذنبا فيتوضأ فيحسن الوضوء ثم يصلي ركعتين - وقال مسعر ثم يصلي - ويستغفر الله إلا غفر الله له ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Ali bin Abu Talib said:                      “If I heard a Hadithfromthe Messenger of Allah (ﷺ), Allah benefitted me with it as muchasHe willed, and if I heard it from anyone else, I would ask him toswear me an oath, then if he swore an oath I would believe him. AbuBakr told me and Abu Bakr spoke the truth that the Messenger of Allah(ﷺ) said: ‘There is no man who commits a sin then he performsablution and does it well, then he prays two Rak’ah,’ (one of thenarrators) Mis’ar said: ‘then performs prayer and seeks theforgiveness of Allah, but Allah will forgive him.’",
      "chain": [
        "30201",
        "30395",
        "20032",
        "20359",
        "20005",
        "11640",
        "11376",
        "19861",
        "5"
      ]
    }
  ],
  "total_hadiths": 4
}