{
  "id": "19864",
  "name": "Jmy' bin 'Umayr bin Afaq جميع بن عمير بن عفاق",
  "full_name": "Jmy' bin 'Umayr bin Afaq جميع بن عمير بن عفاق",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ 4  -  صدوق يخطئ ]"
    ],
    "tags": [
      "B.Taym",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1820",
      "name": "Abu Burda bin Niyar ( أبو بردة بن نيار ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11352",
      "name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19866",
      "name": "Hkym bin Jbyr al-Asady حكيم بن جبير",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "241",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا عبد الرحمن، - يعني ابن مهدي - عن زائدة بن قدامة، عن صدقة، حدثنا جميع بن عمير، - أحد بني تيم الله بن ثعلبة - قال دخلت مع أمي وخالتي على عائشة فسألتها إحداهما كيف كنتم تصنعون عند الغسل فقالت عائشة كان رسول الله صلى الله عليه وسلم يتوضأ وضوءه للصلاة ثم يفيض على رأسه ثلاث مرات ونحن نفيض على رءوسنا خمسا من أجل الضفر ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Jumay' ibn Umayr, one of the sons of Banu Taym Allah ibn Tha'labah, said: Accompanied by my mother and aunt I entered upon Aisha. One of them asked her: How did you do while taking a bath? Aisha replied: The Messenger of Allah (ﷺ) performed ablution (in the beginning) as he did for prayer. He then poured (water) upon his head three times. But we poured water upon our heads five times due to plaits.",
      "chain": [
        "20184",
        "20033",
        "20320",
        "30343",
        "19864"
      ]
    },
    {
      "hadith_no": "3446",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو كامل، حدثنا عبد الواحد، حدثنا صدقة بن سعيد، عن جميع بن عمير التيمي، قال سمعت عبد الله بن عمر، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من ابتاع محفلة فهو بالخيار ثلاثة أيام فإن ردها رد معها مثل أو مثلى لبنها قمحا ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ) said: If anyone buys a sheep whose udders have been tied up, he has option for three days (for decision). If he returns it, he should return with it wheat equal to its milk or double of it.",
      "chain": [
        "30559",
        "20256",
        "19864",
        "18"
      ]
    },
    {
      "hadith_no": "4033",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا يوسف بن موسى القطان البغدادي، حدثنا مالك بن إسماعيل، عن منصور بن أبي الأسود، حدثني كثير أبو إسماعيل، عن جميع بن عمير التيمي، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال لأبي بكر ‏\"‏ أنت صاحبي على الحوض وصاحبي في الغار ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     that the Messenger of Allah (ﷺ) said to Abu Bakr: \"You are my companion at the Hawd, and my companion in the cave.\"",
      "chain": [
        "30224",
        "20357",
        "15551",
        "19864",
        "18"
      ]
    },
    {
      "hadith_no": "4086",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا يوسف بن موسى القطان البغدادي، حدثنا علي بن قادم، حدثنا علي بن صالح بن حى، عن حكيم بن جبير، عن جميع بن عمير التيمي، عن ابن عمر، قال آخى رسول الله صلى الله عليه وسلم بين أصحابه فجاء علي تدمع عيناه فقال يا رسول الله آخيت بين أصحابك ولم تؤاخ بيني وبين أحد ‏.‏ فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أنت أخي في الدنيا والآخرة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وفي الباب عن زيد بن أبي أوفى ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     that the Messenger of Allah (ﷺ) made bonds of brotherhood among his Companions. So 'Ali came crying saying: \"O Messenger of Allah! You have made a bond of brotherhood among your Companions, but you have not made a bond of brotherhood with me and anyone.\" So the Messenger of Allah (ﷺ) said to him: \"I am your brother, in this life and the next.\"",
      "chain": [
        "30224",
        "25198",
        "20593",
        "19866",
        "19864",
        "18"
      ]
    },
    {
      "hadith_no": "4248",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا حسين بن يزيد الكوفي، حدثنا عبد السلام بن حرب، عن أبي الجحاف، عن جميع بن عمير التيمي، قال دخلت مع عمتي على عائشة فسئلت أى الناس كان أحب إلى رسول الله صلى الله عليه وسلم قالت فاطمة ‏.‏ فقيل من الرجال قالت زوجها إن كان ما علمت صواما قواما ‏.‏ هذا حديث حسن غريب ‏.‏ قال وأبو الجحاف اسمه داود بن أبي عوف ويروى عن سفيان الثوري حدثنا أبو الجحاف وكان مرضيا ‏.‏",
      "text_en": " Narrated Jumai' bin 'Umair At-Taimi:                     \"I entered along with my uncle upon 'Aishah and she was asked: 'Who among people was the most beloved to the Messenger of Allah (ﷺ)?' She said: 'Fatimah.' So it was said: 'From the men?' She said: 'Her husband, as I knew him to fast much and stand in prayer much.'\"",
      "chain": [
        "20248",
        "18265",
        "19864"
      ]
    },
    {
      "hadith_no": "375",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا هناد بن السري، عن ابن عياش، - وهو أبو بكر - عن صدقة بن سعيد، ثم ذكر كلمة معناها حدثنا جميع بن عمير، قال دخلت على عائشة مع أمي وخالتي فسألتاها كيف كان رسول الله صلى الله عليه وسلم يصنع إذا حاضت إحداكن قالت كان يأمرنا إذا حاضت إحدانا أن تتزر بإزار واسع ثم يلتزم صدرها وثدييها ‏.‏",
      "text_en": " Jumai' bin 'Umair said:                      \"I entered upon 'Aishah with my mother and maternal aunt, and we asked her what the Prophet (ﷺ) used to do when one of (his wives) was menstruating. She said: He would tell us, when when of us menstruated, to wrap a wide Izar around herself then he would embrace her chest and breasts.",
      "chain": [
        "30480",
        "19864"
      ]
    },
    {
      "hadith_no": "617",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا عبد الواحد بن زياد، حدثنا صدقة بن سعيد الحنفي، حدثنا جميع بن عمير التيمي، قال انطلقت مع عمتي وخالتي فدخلنا على عائشة فسألناها كيف كان يصنع رسول الله  صلى الله عليه وسلم  عند غسله من الجنابة قالت كان يفيض على كفيه ثلاث مرات ثم يدخلها في الإناء ثم يغسل رأسه ثلاث مرات ثم يفيض على جسده ثم يقوم إلى الصلاة وأما نحن فإنا نغسل رءوسنا خمس مرار من أجل الضفر ‏.‏",
      "text_en": " Jumai' bin 'Umair At-Taimi said:                     \"I went out with my paternal aunt and maternal aunt and we entered upon 'Aishah. We asked her: 'What did the Messenger of Allah do when he had the bath to cleanse himself from sexual impurity?' She said: 'He used to pour water on his hand three times, then he would put them in the vessel and wash his face three times, then he would pour water over his body, then he would get up and perform prayer. As for us, we would wash our heads five times because of our braided hair.'\"",
      "chain": [
        "30450",
        "20256",
        "15242",
        "19864"
      ]
    },
    {
      "hadith_no": "2325",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا عبد الواحد بن زياد، حدثنا صدقة بن سعيد الحنفي، حدثنا جميع بن عمير التيمي، حدثنا عبد الله بن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يا أيها الناس من باع محفلة فهو بالخيار ثلاثة أيام فإن ردها رد معها مثلى لبنها - أو قال مثل لبنها - قمحا ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin 'Umar said:                     \"The Messenger of Allah (ﷺ) said: 'Whoever buys a Muhaffalah, (1) he has the choice (of annulling the deal) for three days. If he returns it, then he must also give wheat equal to twice, the amount of its milk, or equal to the amount of its milk.\"'",
      "chain": [
        "30450",
        "20256",
        "15242",
        "19864",
        "18"
      ]
    }
  ],
  "total_hadiths": 8
}