{
  "id": "19876",
  "name": "'Ubaid bin Fyrwz al-Shybany عبيد بن فيروز الشيباني مولاهم أبو الضحاك",
  "full_name": "'Ubaid bin Fyrwz al-Shybany عبيد بن فيروز الشيباني مولاهم أبو الضحاك",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa",
      "Bahrain"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ 4  -  ثقة ]"
    ],
    "tags": [
      "Client",
      "al-Kufa",
      "al-Jazirah"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "400",
      "name": "al-Bara' bin Azib bin al-Harith ( البراء بن عازب بن الحارث ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "19896",
      "name": "al-Qasim bin 'Abdur Rahman القاسم بن عبد الرحمن",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "27354",
      "name": "al-Qasim Abu 'Abdur Rahman القاسم أبو عبد الرحمن ويقال بن عبد الرحم",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2802",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا حفص بن عمر النمري، حدثنا شعبة، عن سليمان بن عبد الرحمن، عن عبيد بن فيروز، قال سألت البراء بن عازب ما لا يجوز في الأضاحي فقال قام فينا رسول الله صلى الله عليه وسلم وأصابعي أقصر من أصابعه وأناملي أقصر من أنامله فقال ‏\"‏ أربع لا تجوز في الأضاحي العوراء بين عورها والمريضة بين مرضها والعرجاء بين ظلعها والكسير التي لا تنقى ‏\"‏ ‏.‏ قال قلت فإني أكره أن يكون في السن نقص ‏.‏ قال ‏\"‏ ما كرهت فدعه ولا تحرمه على أحد ‏\"‏ ‏.‏ قال أبو داود ليس لها مخ ‏.‏",
      "text_en": " Narrated Ubayd ibn Firuz:                     I asked al-Bara' ibn Azib: What should be avoided in sacrificial animals? He said: The Messenger of Allah (ﷺ)  stood among us, and my fingers are smaller than his fingers, and my fingertips are smaller than his fingertips. He said (pointing with his fingers): Four (types of animals) should be avoided in sacrifice: A One-eyed animal which has obviously lost the sight of one eye, a sick animal which is obviously sick, a lame animal which obviously limps and an animal with a broken leg with no marrow. I also detest an animal which has defective teeth. He said: Leave what you detest, but do not make it illegal for anyone.Abu Dawud said: (By a lean animal mean) and animal which has no marrow.",
      "chain": [
        "30329",
        "20020",
        "30587",
        "19876"
      ]
    },
    {
      "hadith_no": "1497",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا علي بن حجر، أخبرنا جرير بن حازم، عن محمد بن إسحاق، عن يزيد بن أبي حبيب، عن سليمان بن عبد الرحمن، عن عبيد بن فيروز، عن البراء بن عازب، رفعه قال ‏\"‏ لا يضحى بالعرجاء بين ظلعها ولا بالعوراء بين عورها ولا بالمريضة بين مرضها ولا بالعجفاء التي لا تنقي ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Bara' bin 'Azib:                     A Marfu' narration (from the Prophet (ﷺ)), saying: \"A crippled animal whose limp is obvious is not to be slaughtered as sacrifice, nor an animal with a bad eye whose blindness is obvious, nor a sick animal whose sickness is obvious, nor an emaciated animal that has no marrow (in its bones).\"",
      "chain": [
        "20387",
        "11272",
        "11107",
        "11411",
        "30587",
        "19876",
        "400"
      ]
    },
    {
      "hadith_no": "1497",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا هناد، حدثنا ابن أبي زائدة، أخبرنا شعبة، عن سليمان بن عبد الرحمن، عن عبيد بن فيروز، عن البراء بن عازب، عن النبي صلى الله عليه وسلم نحوه بمعناه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح لا نعرفه إلا من حديث عبيد بن فيروز عن البراء ‏.‏ والعمل على هذا الحديث عند أهل العلم ‏.‏",
      "text_en": " Another chain from the Prophet (ﷺ) with similar meaning.",
      "chain": [
        "30480",
        "20366",
        "20020",
        "30587",
        "19876",
        "400"
      ]
    },
    {
      "hadith_no": "4370",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا محمد بن جعفر، وأبو داود ويحيى وعبد الرحمن وابن أبي عدي وأبو الوليد قالوا أنبأنا شعبة، قال سمعت سليمان بن عبد الرحمن، قال سمعت عبيد بن فيروز، قال قلت للبراء بن عازب حدثني ما، كره أو نهى عنه رسول الله صلى الله عليه وسلم من الأضاحي ‏.‏ قال فإن رسول الله صلى الله عليه وسلم قال هكذا بيده ويدي أقصر من يد رسول الله صلى الله عليه وسلم ‏\"‏ أربعة لا يجزين في الأضاحي العوراء البين عورها والمريضة البين مرضها والعرجاء البين ظلعها والكسيرة التي لا تنقي ‏\"‏ ‏.‏ قال فإني أكره أن يكون نقص في القرن والأذن ‏.‏ قال فما كرهت منه فدعه ولا تحرمه على أحد ‏.‏",
      "text_en": " 'Ubaid bin Fairuz said:                     \"I said to Al-Bara bin Azib: 'Tell me of the sacrificial animals that the Messenger of Allah dislike or forbade. He said: \"The Messenger of Allah gestured like this with his hand, and my hands are shorter than the hand of the Messenger of Allah, (and he said). 'There are four that will not do as sacrifices: The animal that clearly has one bad eye: the sick animals that is obviously sick; the lame animal with an obvious lamp; and the animal that is so emaciated that it is as if there is no marrow in its bones: He said: \"And I dislike that the animal should have some fault in its horns or ears.\" He said: \"What you dislike, forget about it, and do not make it forbidden to anyone.\"",
      "chain": [
        "30160",
        "20173",
        "20020",
        "30587",
        "19876"
      ]
    },
    {
      "hadith_no": "4371",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا سليمان بن داود، عن ابن وهب، قال أخبرني عمرو بن الحارث، والليث بن سعد، وذكر، آخر وقدمه أن سليمان بن عبد الرحمن، حدثهم عن عبيد بن فيروز، عن البراء بن عازب، قال سمعت رسول الله صلى الله عليه وسلم وأشار بأصابعه وأصابعي أقصر من أصابع رسول الله صلى الله عليه وسلم يشير بأصبعه يقول ‏\"‏ لا يجوز من الضحايا العوراء البين عورها والعرجاء البين عرجها والمريضة البين مرضها والعجفاء التي لا تنقي ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ubaid bin Fairuz thatAl;-Bara bnin 'Azib said:                      \"I heard the Messenger of Allah say\" - and he gestured with his fingers, but his fingers were shorter than the fingers of the Messenger of Allah - he said \"It is not permissible to offer as a sacrifice an animal that clearly has one bad eye, a lame animal that is obviously lame, as sick animal that is obviously sick, or an animals that is so emaciated that it is as if there is no marrow in its bones.\"",
      "chain": [
        "30584",
        "20029",
        "20377",
        "20023",
        "19876",
        "400"
      ]
    },
    {
      "hadith_no": "3264",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، ومحمد بن جعفر، وعبد الرحمن، وأبو داود وابن أبي عدي وأبو الوليد قالوا حدثنا شعبة، سمعت سليمان بن عبد الرحمن، قال سمعت عبيد بن فيروز، قال قلت للبراء بن عازب حدثني بما، كره أو نهى عنه رسول الله  صلى الله عليه وسلم  من الأضاحي ‏.‏ فقال قال رسول الله  صلى الله عليه وسلم  هكذا بيده ويدي أقصر من يده ‏\"‏ أربع لا تجزئ في الأضاحي العوراء البين عورها والمريضة البين مرضها والعرجاء البين ظلعها والكسيرة التي لا تنقي ‏\"‏ ‏.‏ قال فإني أكره أن يكون نقص في الأذن ‏.‏ قال فما كرهت منه فدعه ولا تحرمه على أحد ‏.‏",
      "text_en": " Sulaimanbin ‘Abdur-Rahman said:                      “I heard ‘Ubaid bin Fairuz say: ‘Isaid to Bara’ bin ‘Azib: “Tell us of the sacrificial animalsthat theMessenger of Allah (ﷺ) disliked or forbade.” He said:“Allah’sMessenger (ﷺ) said like this with his hand. And myhand is shorterthan his hand:* ‘There are four that will not beaccepted assacrifices: The one-eyed animal that is obviously blindin one eye;the sick animal that is obviously sick; the lame animalwith anobvious limp; and the animal that is so emaciated that it isas ifthere is no marrow in its bones.’” He said:** “And Idislike that theanimal should have some fault in its ears.” Hesaid: “What youdislike, forget about it and do not make itforbidden to anyone.”",
      "chain": [
        "30160",
        "20031",
        "20173",
        "11055",
        "20020",
        "30587",
        "19876"
      ]
    }
  ],
  "total_hadiths": 6
}