{
  "id": "19875",
  "name": "'Abdur Rahman bin Awsjh عبد الرحمن بن عوسجة الهمداني",
  "full_name": "'Abdur Rahman bin Awsjh عبد الرحمن بن عوسجة الهمداني",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hamadan",
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  4  -  ثقة ]"
    ],
    "tags": [
      "al-Hamdani",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sunan-abi-daud-543",
      "hadith_no": "543",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن علي بن سويد بن منجوف السدوسي، حدثنا عون بن كهمس، عن أبيه، كهمس قال قمنا إلى الصلاة بمنى والإمام لم يخرج فقعد بعضنا فقال لي شيخ من أهل الكوفة ما يقعدك قلت ابن بريدة ‏.‏ قال هذا السمود ‏.‏ فقال لي الشيخ حدثني عبد الرحمن بن عوسجة عن البراء بن عازب قال كنا نقوم في الصفوف على عهد رسول الله صلى الله عليه وسلم طويلا قبل أن يكبر قال وقال ‏\"‏ إن الله وملائكته يصلون على الذين يلون الصفوف الأول وما من خطوة أحب إلى الله من خطوة يمشيها يصل بها صفا ‏\"‏ ‏.‏",
      "text_en": " ‘Awn b. Kahmas reported on the authority of his father Kahmas :                      we stood for praying at Mina when the Imam had not come out. Some of us sat down (and I too). An old man from Kufah said to me: Why did you down? I said : Ibn Buraidah, this is Sumud (i.e., waiting for the Imam in the standing condition). The old man then narrated a tradition from ‘Abd al-Rahman b. ‘Awaajah on the authority of al-Bara’ b. ‘Azib: We would stand in rows during the time of the Messenger of Allah (ﷺ) for a long time before he pronounced Takbir. He further said; Allah, the Exalted and Mighty, sends blessings and the angles invoke blessings for those who are nearer to the front rows. No step is more liking to Allah than a step which one takes to join the row (of the prayer).",
      "usc_msa_ref": "",
      "chain": [
        "28001",
        "19875",
        "400"
      ]
    },
    {
      "id": "sunan-abi-daud-664",
      "hadith_no": "664",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد بن السري، وأبو عاصم بن جواس الحنفي عن أبي الأحوص، عن منصور، عن طلحة اليامي، عن عبد الرحمن بن عوسجة، عن البراء بن عازب، قال كان رسول الله صلى الله عليه وسلم يتخلل الصف من ناحية إلى ناحية يمسح صدورنا ومناكبنا ويقول ‏\"‏ لا تختلفوا فتختلف قلوبكم ‏\"‏ ‏.‏ وكان يقول ‏\"‏ إن الله وملائكته يصلون على الصفوف الأول ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Bara' ibn Azib:                     The Messenger of Allah (ﷺ) used to pass through the row from one side to the other; he used to set out chests and shoulders in order, and say: Do not be irregular. And he would say: Allah and His angels bless those who are near the first rows.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20327",
        "11067",
        "19875",
        "400"
      ]
    },
    {
      "id": "sunan-abi-daud-1468",
      "hadith_no": "1468",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الأعمش، عن طلحة، عن عبد الرحمن بن عوسجة، عن البراء بن عازب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ زينوا القرآن بأصواتكم ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Bara' ibn Azib:                     The Prophet (ﷺ) said: Beautify the Qur'an with your voices.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20028",
        "11060",
        "11356",
        "19875",
        "400"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2084",
      "hadith_no": "2084",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو كريب، حدثنا إبراهيم بن يوسف بن أبي إسحاق، عن أبيه، عن أبي إسحاق، عن طلحة بن مصرف، قال سمعت عبد الرحمن بن عوسجة، يقول سمعت البراء بن عازب، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من منح منيحة لبن أو ورق أو هدى زقاقا كان له مثل عتق رقبة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من حديث أبي إسحاق عن طلحة بن مصرف لا نعرفه إلا من هذا الوجه ‏.‏ وقد روى منصور بن المعتمر وشعبة عن طلحة بن مصرف هذا الحديث ‏.‏ وفي الباب عن النعمان بن بشير ‏.‏ ومعنى قوله ‏\"‏ من منح منيحة ورق ‏\"‏ ‏.‏ إنما يعني به قرض الدراهم قوله ‏\"‏ أو هدى زقاقا ‏\"‏ ‏.‏ يعني به هداية الطريق ‏.‏",
      "text_en": " Al-Bara bin Azib narrated that the Messenger of Allah said :                     \"Whoever gives someone some milk or silver, or guides him through a strait, then he will have the reward similar to freeing a slave.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20406",
        "20473",
        "11049",
        "11356",
        "19875",
        "400"
      ]
    },
    {
      "id": "sunan-an-nasai-811",
      "hadith_no": "811",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا أبو الأحوص، عن منصور، عن طلحة بن مصرف، عن عبد الرحمن بن عوسجة، عن البراء بن عازب، قال كان رسول الله صلى الله عليه وسلم يتخلل الصفوف من ناحية إلى ناحية يمسح مناكبنا وصدورنا ويقول ‏\"‏ لا تختلفوا فتختلف قلوبكم ‏\"‏ ‏.‏ وكان يقول ‏\"‏ إن الله وملائكته يصلون على الصفوف المتقدمة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Al-Bara bin Azib said:                      \"The Messenger of Allah (ﷺ) used to go between the rows from one side to another, patting our shoulders and chests and saying: 'Do not make your rows ragged or your hearts will be filled with enmity toward one another.' And he used to say: 'Allah and His angels send Salah upon the front rows.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20327",
        "11067",
        "11356",
        "19875",
        "400"
      ]
    },
    {
      "id": "sunan-an-nasai-1015",
      "hadith_no": "1015",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا جرير، عن الأعمش، عن طلحة بن مصرف، عن عبد الرحمن بن عوسجة، عن البراء، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ زينوا القرآن بأصواتكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Bara' said:                     \"The Messenger of Allah (ﷺ) said: 'Make your voices beautiful when you recite Quran.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20028",
        "11060",
        "11356",
        "19875",
        "400"
      ]
    },
    {
      "id": "sunan-an-nasai-1016",
      "hadith_no": "1016",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا شعبة، قال حدثني طلحة، عن عبد الرحمن بن عوسجة، عن البراء بن عازب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ زينوا القرآن بأصواتكم ‏\"‏ ‏.‏ قال ابن عوسجة كنت نسيت هذه ‏\"‏ زينوا القرآن ‏\"‏ ‏.‏ حتى ذكرنيه الضحاك بن مزاحم ‏.‏",
      "text_en": " It was narrated that Al-Bara' bin Azib said:                     \"The Messenger of Allah (ﷺ) said: 'Make your voices beautiful when you recite Quran.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20020",
        "11356",
        "19875",
        "400"
      ]
    },
    {
      "id": "sunan-ibn-majah-1050",
      "hadith_no": "1050",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، ومحمد بن جعفر، قالا حدثنا شعبة، قال سمعت طلحة بن مصرف، يقول سمعت عبد الرحمن بن عوسجة، يقول سمعت البراء بن عازب، يقول سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ إن الله وملائكته يصلون على الصفوف الأول ‏\"‏ ‏.‏",
      "text_en": " Bara’bin ‘Azib said:                      “I heard the Messenger of Allah (ﷺ) say:‘Allahand the angels send blessings upon the first row.’”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20173",
        "20020",
        "11356",
        "19875",
        "400"
      ]
    },
    {
      "id": "sunan-ibn-majah-1403",
      "hadith_no": "1403",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، ومحمد بن جعفر، قالا حدثنا شعبة، قال سمعت طلحة اليامي، قال سمعت عبد الرحمن بن عوسجة، قال سمعت البراء بن عازب، يحدث قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ زينوا القرآن بأصواتكم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Bara’ (bin ‘Azib) that the Messenger of Allah(ﷺ)said:                      “Beautify the Qur’an with your voices.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20173",
        "20020",
        "19875",
        "400"
      ]
    }
  ],
  "total_hadiths": 9
}