{
  "id": "19870",
  "name": "Tlyq bin Qays al-Hnfy طليق بن قيس الحنفي الكوفي",
  "full_name": "Tlyq bin Qays al-Hnfy طليق بن قيس الحنفي الكوفي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  4  -  ثقة ]"
    ],
    "tags": [
      "al-Hanfi",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "23",
      "name": "Abu Dharr al-Ghaffari ( جندب بن جنادة أبو ذر الغفاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "37",
      "name": "Abu al-Darda ( أبو الدرداء عويمر بن زيد بن قيس الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "10780",
      "name": "'Abdullah bin al-Harith عبد الله بن الحارث الزبيدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1510",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن عمرو بن مرة، عن عبد الله بن الحارث، عن طليق بن قيس، عن ابن عباس، قال كان النبي صلى الله عليه وسلم يدعو ‏\"‏ رب أعني ولا تعن على وانصرني ولا تنصر على وامكر لي ولا تمكر على واهدني ويسر هداى إلى وانصرني على من بغى على اللهم اجعلني لك شاكرا لك ذاكرا لك راهبا لك مطواعا إليك مخبتا أو منيبا رب تقبل توبتي واغسل حوبتي وأجب دعوتي وثبت حجتي واهد قلبي وسدد لساني واسلل سخيمة قلبي ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) used to supplicate Allah: \"My Lord, help me and do not give help against me; grant me victory, and do not grant victory over me; plan on my behalf and do not plan against me; guide me, and made my right guidance easy for me; grant me victory over those who  act wrongfully towards me; O Allah, make me grateful to Thee, mindful of Thee, full of fear towards Thee, devoted to Thy obedience, humble before Thee, or penitent. My Lord, accept my repentance, wash away my sin, answer my supplication, clearly establish my evidence, guide my heart, make true my tongue and draw out malice in my breast.\"",
      "chain": [
        "28531",
        "20012",
        "11381",
        "912",
        "19870",
        "17"
      ]
    },
    {
      "hadith_no": "3551",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود الحفري، عن سفيان الثوري، عن عمرو بن مرة، عن عبد الله بن الحارث، عن طليق بن قيس، عن ابن عباس، قال كان النبي صلى الله عليه وسلم يدعو يقول ‏\"‏ رب أعني ولا تعن على وانصرني ولا تنصر على وامكر لي ولا تمكر على واهدني ويسر الهدى لي وانصرني على من بغى على رب اجعلني لك شكارا لك ذكارا لك رهابا لك مطواعا لك مخبتا إليك أواها منيبا رب تقبل توبتي واغسل حوبتي وأجب دعوتي وثبت حجتي وسدد لساني واهد قلبي واسلل سخيمة صدري ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال محمود بن غيلان وحدثنا محمد بن بشر العبدي، عن سفيان الثوري، بهذا الإسناد نحوه ‏.‏",
      "text_en": " Ibn Abbas said:                     “The Prophet used to supplicate, saying: “My Lord, aid me and do not aid against me, and grant me victory and do not grant victory over me, plot for me and do not plot against me, guide me and facilitate guidance for me, grant me victory over those who transgress against me. My Lord, make me ever-grateful to You, ever-remembering of You, ever-fearful of You, ever-obedient to You, ever-humble to You, oft-turning and returning to You. My Lord, accept my repentance, wash my sin, answer my call, make firm my proof, make firm my tongue, guide my heart, and remove the treachery of my chest (Rabbi A’inni Wa La Tu’in Alayya, Wansurni Wa La Tansur Alayya, Wahdini Wa Yassir Lil-Huda, Wansurni Ala Man Bagha Alayya. Rabbij’alni Laka Shakkaran, Laka Dhak-Karan, Laka Rahhaban, Laka Mitwa’an, Laka Mikhbitan, Ilaika Awwahan Muniba. Rabbi Taqabbal Tawbati, Waghsil Hawbati, Wa Ajib Da’wati, Wa Thab-bit Hujjati, Wa Saddid Lisani Wahdi Qalbi, Waslul Sakhimata Sadri).”",
      "chain": [
        "30277",
        "20668",
        "20012",
        "11381",
        "912",
        "19870",
        "17"
      ]
    },
    {
      "hadith_no": "3830",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا علي بن محمد، سنة إحدى وثلاثين ومائتين حدثنا وكيع، في سنة خمس وتسعين ومائة قال حدثنا سفيان في مجلس الأعمش منذ خمسين سنة حدثنا عمرو بن مرة الجملي في زمن خالد عن عبد الله بن الحارث المكتب عن طليق بن قيس الحنفي عن ابن عباس أن النبي  صلى الله عليه وسلم  كان يقول في دعائه ‏\"‏ رب أعني ولا تعن على وانصرني ولا تنصر على وامكر لي ولا تمكر على واهدني ويسر الهدى لي وانصرني على من بغى على رب اجعلني لك شكارا لك ذكارا لك رهابا لك مطيعا إليك مخبتا إليك أواها منيبا رب تقبل توبتي واغسل حوبتي وأجب دعوتي واهد قلبي وسدد لساني وثبت حجتي واسلل سخيمة قلبي ‏\"‏ ‏.‏ قال أبو الحسن الطنافسي قلت لوكيع أقوله في قنوت الوتر قال نعم ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that :                     the Prophet (saas) used to say in his supplication: \"Rabbi! A'inni wa la tu'in 'alayya, wansurni wa la tansur 'alayya, wamkurli wa la tamkur 'alayya, wahdini wa yassiril-huda li, wansurni 'ala man bagha 'alayya.  Rabbij'alni laka shakkaran laka dhakkaran, laka rahhaban, laka muti'an, 'ilayka mukhbitan, 'ilayka awwahan muniba. Rabbi! Taqabbal tawbati, waghsil hawbati wa ajib da'wati, wahdi qalbi, wa saddid lisani, wa thabbit hujjati, waslul sakhimata qalbi (O Lord! Help me and do not help others against me, support me and do not support others against me, plan for me and do not plan against me, guide me and make guidance easy for me, and help me against those who wrong me. O Lord! Make me grateful to You, make me remember You much, make me fearful of You, obedient to You, humble before You and turning to You. O Lord! Accept my repentance and wash away my sins, answer my supplication, guide my heart, make my tongue speak the truth, make my proof firm and remove resentment from my heard).\" (Sahih)(One of the narrators) Abul-Hasan At-Tanafisi said: \"I said to Waki': 'Shall I say it in the Qunut of Witr?' He said: 'Yes.'\"",
      "chain": [
        "38409",
        "11381",
        "10780",
        "19870",
        "17"
      ]
    }
  ],
  "total_hadiths": 3
}