{
  "id": "1988",
  "name": "Usayd bin Zuhayr bin Rafi' ( أسيد بن ظهير بن رافع ( رضي الله عنه",
  "full_name": "Usayd bin Zuhayr bin Rafi' ( أسيد بن ظهير بن رافع ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina",
      "place_display": {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      }
    },
    "death": {
      "date_hijri": "60",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural",
      "place_display": {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      }
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ 4  -  صحبة ]"
    ],
    "tags": [
      "Ansar",
      "Aws",
      "B.Haritha",
      "Uhud",
      "Khandaq"
    ],
    "area_of_interest_display": [
      {
        "en": "Recitation/Quran",
        "ar": "تلاوة القرآن",
        "ckb": "خوێندنەوە/قورئان"
      },
      {
        "en": "Narrator [ 4  -  صحبة ]",
        "ar": "Narrator [ 4  -  صحبة ]",
        "ckb": "Narrator [ 4  -  صحبة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      }
    ],
    "tags_display": [
      {
        "en": "Ansar",
        "ar": "الأنصار",
        "ckb": "ئەنسار"
      },
      {
        "en": "Aws",
        "ar": "الأوس",
        "ckb": "ئەوس"
      },
      {
        "en": "B.Haritha",
        "ar": "B.Haritha",
        "ckb": "B.Haritha"
      },
      {
        "en": "Battle of Uhud",
        "ar": "غزوة أحد",
        "ckb": "جەنگی ئوحود"
      },
      {
        "en": "Battle of the Trench",
        "ar": "غزوة الخندق",
        "ckb": "جەنگی خەندەق"
      }
    ]
  },
  "parents": [
    {
      "id": "1987",
      "name": "Zuhayr bin Rafi' ( ظهير بن رافع ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    }
  ],
  "spouses": [
    {
      "id": "1960",
      "name": "Umama bint Khadij bin Rafi' ( أمامة بنت خديج الأنصارية ( رضي الله عنها",
      "grade": "Comp.(RA)",
      "grade_display": {
        "en": "Companion (RA)",
        "ar": "صحابي (رضي الله عنه)",
        "ckb": "هاوەڵ (رەزای خوای لێبێت)"
      }
    }
  ],
  "siblings": [
    {
      "id": "1989",
      "name": "Anas bin Zuhayr bin Rafi' ( أسيد بن ظهير بن رافع ( رضي الله عنه",
      "grade": "Comp.(RA)",
      "grade_display": {
        "en": "Companion (RA)",
        "ar": "صحابي (رضي الله عنه)",
        "ckb": "هاوەڵ (رەزای خوای لێبێت)"
      }
    },
    {
      "id": "1990",
      "name": "Rafi' bin Zuhayr bin Rafi' ( رافع بن ظهير بن رافع ( رضي الله عنه",
      "grade": "Comp.(RA)",
      "grade_display": {
        "en": "Companion (RA)",
        "ar": "صحابي (رضي الله عنه)",
        "ckb": "هاوەڵ (رەزای خوای لێبێت)"
      }
    },
    {
      "id": "1962",
      "name": "'Amira bint Zuhayr bin Rafi' ( عميرة بنت ظهير بن رافع ( رضي الله عنها",
      "grade": "Comp.(RA)",
      "grade_display": {
        "en": "Companion (RA)",
        "ar": "صحابي (رضي الله عنه)",
        "ckb": "هاوەڵ (رەزای خوای لێبێت)"
      }
    }
  ],
  "children": [
    {
      "id": "12090",
      "name": "Rafa'i bin Asyd bin Zuhyr رافع بن أسيد بن ظهير",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah",
      "grade_display": {
        "en": "Messenger of Allah",
        "ar": "رسول الله",
        "ckb": "پێغەمبەری خودا"
      }
    },
    {
      "id": "1986",
      "name": "Rafi' bin Khadij bin Rafi' ( رافع بن خديج بن رافع الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]",
      "grade_display": {
        "en": "Companion (RA) [1st Generation]",
        "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
        "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
      }
    }
  ],
  "students": [
    {
      "id": "12090",
      "name": "Rafa'i bin Asyd bin Zuhyr رافع بن أسيد بن ظهير",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "12109",
      "name": "Ziyad Abu al-Abrad al-Madni زياد أبو الأبرد المدني",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "21944",
      "name": "'Ikrama bin Khalid bin Salma عكرمة بن خالد بن سلمة المخزومي",
      "grade": "Succ. (Taba' Tabi')",
      "grade_display": {
        "en": "Successor (Taba' Tabi')",
        "ar": "تابع التابعين",
        "ckb": "شوێنكەوتووی شوێنكەوتوو"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-3398",
      "hadith_no": "3398",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن منصور، عن مجاهد، أن أسيد بن ظهير، قال جاءنا رافع بن خديج فقال إن رسول الله ينهاكم عن أمر، كان لكم نافعا وطاعة الله وطاعة رسول الله صلى الله عليه وسلم أنفع لكم إن رسول الله صلى الله عليه وسلم ينهاكم عن الحقل وقال ‏\"‏ من استغنى عن أرضه فليمنحها أخاه أو ليدع ‏\"‏ ‏.‏ قال أبو داود وهكذا رواه شعبة ومفضل بن مهلهل عن منصور ‏.‏ قال شعبة أسيد ابن أخي رافع بن خديج ‏.‏",
      "text_en": " Narrated Usaid b. Zuhair:                     Rafi' b. Khadij came to us and said: The Messenger of Allah (ﷺ) forbids you from a work which is beneficial to you ; and obedience to Allah and His Prophet (ﷺ) is more beneficial to you. The Messenger of Allah (ﷺ) forbids you from renting land for share of its produce and he said: If anyone if not in need of his land he should lend it to his brother or leave it.Abu Dawud said: Shu'bah and Mufaddal b. Muhalhal have narrated it from Mansur in similar way. Shu'bah said (in his version): Usaid, nephew of Rafi' b, Khadij.",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "11067",
        "11028",
        "1988"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-324",
      "hadith_no": "324",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن العلاء أبو كريب، وسفيان بن وكيع، قالا حدثنا أبو أسامة، عن عبد الحميد بن جعفر، قال حدثنا أبو الأبرد، مولى بني خطمة أنه سمع أسيد بن ظهير الأنصاري، وكان، من أصحاب النبي صلى الله عليه وسلم يحدث عن النبي صلى الله عليه وسلم قال ‏\"‏ الصلاة في مسجد قباء كعمرة ‏\"‏ ‏.‏ قال وفي الباب عن سهل بن حنيف ‏.‏ قال أبو عيسى حديث أسيد حديث حسن غريب ‏.‏ ولا نعرف لأسيد بن ظهير شيئا يصح غير هذا الحديث ولا نعرفه إلا من حديث أبي أسامة عن عبد الحميد بن جعفر ‏.‏ وأبو الأبرد اسمه زياد مديني ‏.‏",
      "text_en": " Abu Al-Abrad the freed slave of Banu Khatmah narrated that he heard Usaid bin Zuhair Al-Ansari - and he was one of the Companions of the Prophet - narrated that :                     the Prophet said: \"The Salat in Masjid Quba is like Umrah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "35047",
        "20318",
        "11875",
        "1988"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-3863",
      "hadith_no": "3863",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا يحيى، - وهو ابن آدم - قال حدثنا مفضل، - وهو ابن مهلهل - عن منصور، عن مجاهد، عن أسيد بن ظهير، قال جاءنا رافع بن خديج فقال إن رسول الله صلى الله عليه وسلم نهاكم عن الحقل - والحقل الثلث والربع - وعن المزابنة‏.‏‏ والمزابنة شراء ما في رءوس النخل بكذا وكذا وسقا من تمر‏.‏‏",
      "text_en": " It was narrated that Usaid bin Zuhair said:                      \"Rafi' bin Khadij came to us and said: 'The Messenger of Allah has forbidden for you Al-Haql. Al-Haql is the third and the fourth. And Al-Muzabanah. Al-Muzabanah is to buy what is at the top of the date-palm trees in return for a certain number of Wasqs of dried dates.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20364",
        "11067",
        "11028",
        "1988"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3864",
      "hadith_no": "3864",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا محمد، قال حدثنا شعبة، عن منصور، سمعت مجاهدا، يحدث عن أسيد بن ظهير، قال أتانا رافع بن خديج فقال نهانا رسول الله صلى الله عليه وسلم عن أمر كان لنا نافعا وطاعة رسول الله صلى الله عليه وسلم خير لكم نهاكم عن الحقل وقال ‏‏\"‏‏ من كانت له أرض فليمنحها أو ليدعها ‏‏\"‏‏‏.‏‏ ونهى عن المزابنة‏.‏‏ والمزابنة الرجل يكون له المال العظيم من النخل فيجيء الرجل فيأخذها بكذا وكذا وسقا من تمر‏.‏‏",
      "text_en": " It was narrated that Usaid bin Zuhair said:                      \"Rafi' bin Khadij came to us and said: 'The Messenger of Allah has forbidden something that was beneficial for us, but obedience to the Messenger of Allah is better for you.  He has forbidden Al-Haql (renting land in return for one-third or one-quarter of the produce) to you, and says: Whoever has land, let him give it (to someone else to cultivate it) or leave it. And he has forbidden Al-Muzabanah. Al-Muzabanah means when a man has a lot of date-palm trees and another man comes and takes it in return for a certain number of Wasqs of dried dates.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20278",
        "20020",
        "11067",
        "11028",
        "1988"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3865",
      "hadith_no": "3865",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرني محمد بن قدامة، قال حدثنا جرير، عن منصور، عن مجاهد، عن أسيد بن ظهير، قال أتى علينا رافع بن خديج فقال - ولم أفهم - فقال إن رسول الله صلى الله عليه وسلم نهاكم عن أمر كان ينفعكم وطاعة رسول الله صلى الله عليه وسلم خير لكم مما ينفعكم نهاكم رسول الله صلى الله عليه وسلم عن الحقل - والحقل المزارعة بالثلث والربع - فمن كان له أرض فاستغنى عنها فليمنحها أخاه أو ليدع ونهاكم عن المزابنة‏.‏‏ والمزابنة الرجل يجيء إلى النخل الكثير بالمال العظيم فيقول خذه بكذا وكذا وسقا من تمر ذلك العام‏.‏‏",
      "text_en": " It was narrated that Usaid bin Zuhair said:                      \"Rafi' bin Khadij came to us and I was not sure what he meant. He said: 'The Messenger of Allah has forbidden to you something that used to benefit you, but obedience to the Messenger of Allah is better for you than that which benefits you. The Messenger of Allah has forbidden Al-Haql for you. Al-Haql means share-cropping the land in return for one-third or one-quarter (of the yield). So whoever has land that he does not need, let him give it to his brother (to cultivate it) or let him leave it. And he has forbidden to you Al-Muzabanah. Al-Muzabanah means when a man has a great number of datepalms and says: Take it in return for (a certain number of) Wasqs of dried dates this year.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20028",
        "11067",
        "11028",
        "1988"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3866",
      "hadith_no": "3866",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرني إبراهيم بن يعقوب بن إسحاق، قال حدثنا عفان، قال حدثنا عبد الواحد، قال حدثنا سعيد بن عبد الرحمن، عن مجاهد، قال حدثني أسيد بن رافع بن خديج، قال قال رافع بن خديج نهاكم رسول الله صلى الله عليه وسلم عن أمر كان لنا نافعا وطاعة رسول الله صلى الله عليه وسلم أنفع لنا قال ‏‏\"‏‏ من كانت له أرض فليزرعها فإن عجز عنها فليزرعها أخاه ‏‏\"‏‏‏.‏‏ خالفه عبد الكريم بن مالك‏.‏‏",
      "text_en": " Usaid bin Rafi' bin Khadij said:                      \"Rafi' bin Khadij said: 'The Messenger of Allah has forbidden something for you that used to be beneficial for us, but obedience to the Messenger of Allah is more beneficial for us. He said: \"Whoever has land let him cultivate it, and if he is unable to do so, let him give it to his brother to cultivate.\"'\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30106",
        "20256",
        "11028",
        "1988"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3924",
      "hadith_no": "3924",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن حاتم، قال حدثنا حبان، قال حدثنا عبد الله بن المبارك، عن ليث، قال حدثني بكير بن عبد الله بن الأشج، عن أسيد بن رافع بن خديج، أن أخا، رافع قال لقومه قد نهى رسول الله صلى الله عليه وسلم اليوم عن شىء كان لكم رافقا وأمره طاعة وخير نهى عن الحقل‏.‏‏",
      "text_en": " It was narrated from Usaid bin Rafi' bin Khadij that the brother of Rafi' said to his people:                      \"Today the Messenger of Allah has forbidden something which was convenient for you, but following his command is an act of obedience (to Allah) and is good. He forbade Al-Haql.\"",
      "usc_msa_ref": "",
      "chain": [
        "30514",
        "20218",
        "20025",
        "20023",
        "11154",
        "1988"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-1476",
      "hadith_no": "1476",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن عبد الحميد بن جعفر، حدثنا أبو الأبرد، مولى بني خطمة أنه سمع أسيد بن ظهير الأنصاري، وكان، من أصحاب النبي  صلى الله عليه وسلم  يحدث عن النبي  صلى الله عليه وسلم  أنه قال ‏\"‏ صلاة في مسجد قباء كعمرة ‏\"‏ ‏.‏",
      "text_en": " Abul-Abrad, the freed slave of Banu Khatmah, said that he heard Usaidbin Zuhair Ansari who was one of the Companions of the Prophet (ﷺ)narrating that the Prophet (ﷺ) said:                      “One prayer in the Quba’Mosqueis like ‘Umrah.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20318",
        "11875",
        "1988"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-2554",
      "hadith_no": "2554",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن يحيى، أنبأنا عبد الرزاق، أنبأنا الثوري، عن منصور، عن مجاهد، عن أسيد بن ظهير ابن أخي، رافع بن خديج عن رافع بن خديج، قال كان أحدنا إذا استغنى عن أرضه، أعطاها بالثلث والربع والنصف واشترط ثلاثة جداول والقصارة وما سقى الربيع وكان العيش إذ ذاك شديدا وكان يعمل فيها بالحديد وبما شاء الله ويصيب منها منفعة فأتانا رافع بن خديج فقال إن رسول الله صلى الله عليه وسلم نهاكم عن أمر كان لكم نافعا وطاعة الله وطاعة رسوله أنفع لكم إن رسول الله صلى الله عليه وسلم ينهاكم عن الحقل ويقول ‏\"‏ من استغنى عن أرضه فليمنحها أخاه أو ليدع ‏\"‏ ‏.‏",
      "text_en": " It was narrated  from Usaid bin Zuhair, the paternal nephew of Rafi' bin Khdij, that Rafi' bin Khadij said:                     “If one of us did not need his land, he would give it (to someone else to cultivate) in return for one third, or one half of the yield , and he would stipulate (that the should receive) the produce grows on the banks of three streams, and the grains that remain in the ear after threshing, and the produce irrigated by a stream. Life at that time was hard, and he would work (the land) with iron and whatever Allah (SWT) willed, and he would benefit from it. Then Rafi bin Khadij came to us and said: ‘The Messenger of Allah (ﷺ) forbade you to do something that may seem beneficial to you, but obedience to Allah and obedience to His Messenger are more beneficial for you. The Messenger of Allah (ﷺ) forbade Haq for you, and he said: “Whoever has no need of his land, let him give it to his brother (to cultivate) or let him leave it (uncultivated).”",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20121",
        "20012",
        "11067",
        "11028",
        "1988",
        "1986"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 9,
  "grade_display": {
    "en": "Companion (RA) [1st Generation]",
    "ar": "صحابي (رضي الله عنه) [الجيل الأول]",
    "ckb": "هاوەڵ (رەزای خوای لێبێت) [نەوەی یەكەم]"
  }
}