{
  "id": "19894",
  "name": "Yahya bin al-Harith al-Dhamari يحيى بن الحارث الذماري",
  "full_name": "Yahya bin al-Harith al-Dhamari يحيى بن الحارث الذماري",
  "grade": "Follower(Tabi') [5th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "145",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Syria"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ 4  -  ثقة ]"
    ],
    "tags": [
      "al-Dhamari",
      "al-Ghassani",
      "al-Shami"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "4049",
      "name": "Wathla bin al-'Asqa' ( واثلة بن الأسقع ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11002",
      "name": "Sa'id ibn al-Musayyib سعيد بن المسيب بن حزن أبو محمد القرشي",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10917",
      "name": "Shrahyl bin Aadah, Abu al-Ash'ath شراحيل بن آدة أبو الأشعث الصنعاني",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10883",
      "name": "'Amr bin Marthad, Abu Asma' al-Rahbi عمرو بن مرثد أبو أسماء الرحبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10882",
      "name": "'Abdullah bin 'Amir عبد الله بن عامر بن يزيد بن تميم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11648",
      "name": "al-Qasim bin 'Abdur Rahman القاسم بن عبد الرحمن بن عبد الله",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11011",
      "name": "Salim bin 'Abdullah bin 'Umar سالم بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20638",
      "name": "Sa'id bin 'Abdul 'Aziz al-Tanuqi سعيد بن عبد العزيز التنوخي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20731",
      "name": "'Abdur Rahman bin Thabit عبد الرحمن بن ثابت بن ثوبان العنسي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "18897",
      "name": "Muhammad bin Jahada محمد بن جحادة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20415",
      "name": "Thaur bin Yazid al-Rahbi ثور بن يزيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20402",
      "name": "Yahya bin Hamza bin Waqd يحيى بن حمزة بن واقد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20744",
      "name": "al-Hythm bin Hameed al-Ghsany الهيثم بن حميد الغساني مولاهم أبو أحمد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20398",
      "name": "Sdqh bin Khalid al-Amwy صدقة بن خالد الأموي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20732",
      "name": "Muhammad bin Shu'aib bin Shabur محمد بن شعيب بن شابور",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "27536",
      "name": "'Umar bin Abd al-Wahd عمر بن عبد الواحد بن قيس السلمي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "558",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو توبة، حدثنا الهيثم بن حميد، عن يحيى بن الحارث، عن القاسم أبي عبد الرحمن، عن أبي أمامة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من خرج من بيته متطهرا إلى صلاة مكتوبة فأجره كأجر الحاج المحرم ومن خرج إلى تسبيح الضحى لا ينصبه إلا إياه فأجره كأجر المعتمر وصلاة على أثر صلاة لا لغو بينهما كتاب في عليين ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuUmamah:                     The Messenger of Allah (ﷺ) said: If anyone goes out from his house after performing ablution for saying the prescribed prayer in congregation (in the mosque), his reward will be like that of one who goes for hajj pilgrimage after wearing ihram (robe worn by the hajj pilgrims). And he who goes out to say the mid-morning (duha) prayer, and takes the trouble for this purpose, will take the reward like that of a person who performs umrah. And a prayer followed by a prayer with no worldly talk during the gap between them will be recorded in Illiyyun.",
      "chain": [
        "30335",
        "20744",
        "19894",
        "11648",
        "405"
      ]
    },
    {
      "hadith_no": "1288",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو توبة الربيع بن نافع، حدثنا الهيثم بن حميد، عن يحيى بن الحارث، عن القاسم بن عبد الرحمن، عن أبي أمامة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ صلاة في أثر صلاة لا لغو بينهما كتاب في عليين ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuUmamah:                     The Prophet (ﷺ) said: Prayer followed by a prayer with no idle talk between the two is recorded in Illiyyun.",
      "chain": [
        "30335",
        "20744",
        "19894",
        "19896",
        "405"
      ]
    },
    {
      "hadith_no": "2503",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عمرو بن عثمان، وقرأته، على يزيد بن عبد ربه الجرجسي قالا حدثنا الوليد بن مسلم، عن يحيى بن الحارث، عن القاسم أبي عبد الرحمن، عن أبي أمامة، عن النبي صلى الله عليه وسلم قال ‏:‏ ‏\"‏ من لم يغز أو يجهز غازيا أو يخلف غازيا في أهله بخير أصابه الله بقارعة ‏\"‏ ‏.‏ قال يزيد بن عبد ربه في حديثه ‏:‏ ‏\"‏ قبل يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuUmamah:                     The Prophet (ﷺ) said: He who does not join the warlike expedition (jihad), or equip, or looks well after a warrior's family when he is away, will be smitten by Allah with a sudden calamity. Yazid ibn Abdu Rabbihi said in his tradition: 'before the Day of Resurrection\".",
      "chain": [
        "10581",
        "10725",
        "19894",
        "11648",
        "405"
      ]
    },
    {
      "hadith_no": "4681",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا مؤمل بن الفضل، حدثنا محمد بن شعيب بن شابور، عن يحيى بن الحارث، عن القاسم، عن أبي أمامة، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ من أحب لله وأبغض لله وأعطى لله ومنع لله فقد استكمل الإيمان ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuUmamah:                     The Prophet (ﷺ) said: If anyone loves for Allah's sake, hates for Allah's sake, gives for Allah's sake and withholds for Allah's sake, he will have perfect faith.",
      "chain": [
        "38659",
        "20732",
        "19894",
        "10535",
        "405"
      ]
    },
    {
      "hadith_no": "496",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا وكيع، حدثنا سفيان، وأبو جناب يحيى بن أبي حية عن عبد الله بن عيسى، عن يحيى بن الحارث، عن أبي الأشعث الصنعاني، عن أوس بن أوس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من اغتسل يوم الجمعة وغسل وبكر وابتكر ودنا واستمع وأنصت كان له بكل خطوة يخطوها أجر سنة صيامها وقيامها ‏\"‏ ‏.‏ قال محمود قال وكيع اغتسل هو وغسل امرأته ‏.‏ قال ويروى عن عبد الله بن المبارك أنه قال في هذا الحديث ‏\"‏ من غسل واغتسل ‏\"‏ ‏.‏ يعني غسل رأسه واغتسل ‏.‏ قال وفي الباب عن أبي بكر وعمران بن حصين وسلمان وأبي ذر وأبي سعيد وابن عمر وأبي أيوب ‏.‏ قال أبو عيسى حديث أوس بن أوس حديث حسن ‏.‏ وأبو الأشعث الصنعاني اسمه شراحيل بن آدة ‏.‏ وأبو جناب يحيى بن حبيب القصاب الكوفي ‏.‏",
      "text_en": " Aws bin Aws narrated:                     \"Allah's Messenger said to me: 'Whoever performs Ghusl on Friday, and bathes completely, and goes early, arriving early, gets close and listens and is silent, there will be for him in every step he take the reward of a year of fasting and standing (in prayer).'\"",
      "chain": [
        "30277",
        "20032",
        "20012",
        "11361",
        "19894",
        "10917",
        "3214"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا عمرو بن منصور، وهارون بن محمد بن بكار بن بلال، - واللفظ له - قالا حدثنا أبو مسهر، قال حدثنا سعيد بن عبد العزيز، عن يحيى بن الحارث، عن أبي الأشعث الصنعاني، عن أوس بن أوس، عن النبي صلى الله عليه وسلم قال ‏\"‏ من غسل واغتسل وغدا وابتكر ودنا من الإمام ولم يلغ كان له بكل خطوة عمل سنة صيامها وقيامها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Aws bin Aws that:                     The Prophet (ﷺ) said: \"Whoever washes (ghassala) and performs ghusl, comes early to the masjid and sits near the imam, and does not engage in idle talk, he will have for every step he takes (the reward of) a year's worth of good deeds, fasting it and praying Qiyam during it.\"",
      "chain": [
        "38433",
        "30284",
        "20638",
        "19894",
        "10917",
        "3214"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا محمود بن خالد، قال حدثني عمر بن عبد الواحد، قال سمعت يحيى بن الحارث، يحدث عن أبي الأشعث الصنعاني، عن أوس بن أوس الثقفي، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من غسل واغتسل وابتكر وغدا ودنا من الإمام وأنصت ثم لم يلغ كان له بكل خطوة كأجر سنة صيامها وقيامها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Aws bin Aws Ath-Thaqafi that :                     The Messenger of Allah (ﷺ) said: \"Whoever washes (ghassala) and performs ghusl, and comes early to the masjid and sits near the imam, is attentive and does not engage in idle talk, for every step he takes he will have (the reward of) a year's worth of good deeds, its fasting and Qiyam prayer.\"",
      "chain": [
        "37534",
        "27536",
        "19894",
        "10917",
        "3214"
      ]
    },
    {
      "hadith_no": "2254",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمود بن خالد، عن محمد بن شعيب، قال أخبرني يحيى بن الحارث، عن القاسم أبي عبد الرحمن، أنه حدثه عن عقبة بن عامر، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من صام يوما في سبيل الله عز وجل باعد الله منه جهنم مسيرة مائة عام ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amir that the Messenger of Allah said:                     \"Whoever fasts one day in the cause of Allah, the mighty and sublime, Allah will separate him the distance of one hundred years from the fire.\"",
      "chain": [
        "37534",
        "20732",
        "19894",
        "11648",
        "189"
      ]
    },
    {
      "hadith_no": "1786",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا هشام بن عمار، حدثنا بقية، حدثنا صدقة بن خالد، حدثنا يحيى بن الحارث الذماري، قال سمعت أبا أسماء الرحبي، عن ثوبان، مولى رسول الله  صلى الله عليه وسلم  عن رسول الله  صلى الله عليه وسلم  أنه قال ‏\"‏ من صام ستة أيام بعد الفطر كان تمام السنة ‏{من جاء بالحسنة فله عشر أمثالها}‏ ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Thawban, the freed slave of the Messenger ofAllah(ﷺ), that the Messenger of Allah (ﷺ) said:                      “Whoever fastssixdays after the Fitr will have completed the year, for whoever doesagood deed will have the reward of ten like it.”",
      "chain": [
        "30288",
        "20644",
        "20398",
        "19894",
        "10883"
      ]
    },
    {
      "hadith_no": "2867",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا هشام بن عمار، حدثنا الوليد بن مسلم، حدثنا يحيى بن الحارث الذماري، عن القاسم، عن أبي أمامة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من لم يغز أو يجهز غازيا أو يخلف غازيا في أهله بخير أصابه الله سبحانه بقارعة قبل يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Umamah that the Prophet (ﷺ) said:                      “Whoeverdoesnot fight, or equip a fighter, or stay behind to look after afighter’s family, Allah will strike him with a calamity before theDayof Resurrection.”",
      "chain": [
        "30288",
        "20733",
        "19894",
        "10535",
        "405"
      ]
    },
    {
      "hadith_no": "3512",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا هشام بن عمار، حدثنا صدقة بن خالد، حدثنا يحيى بن الحارث الذماري، سمعت سالم بن عبد الله بن عمر، يحدث عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ كل مسكر حرام ‏\"‏ ‏.‏",
      "text_en": " Salimbin ‘Abdullah bin ‘Umar narrated that his father said:                      “TheMessenger of Allah (ﷺ) said: ‘Every intoxicant is unlawful.’”",
      "chain": [
        "30288",
        "20398",
        "19894",
        "11011",
        "18"
      ]
    }
  ],
  "total_hadiths": 11
}