{
  "id": "19897",
  "name": "Aban bin Salah bin 'Umayr أبان بن صالح بن عمير",
  "full_name": "Aban bin Salah bin 'Umayr أبان بن صالح بن عمير",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Weak",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "110",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Weak] [ خت  4  -  ضعيف ]"
    ],
    "tags": [
      "Quraish",
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11156",
      "name": "al-Hasan bin Muhammad bin 'Ali الحسن بن محمد بن علي بن أبي طالب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "22097",
      "name": "'Abdullah bin 'Amir عبد الله بن عامر الأسلمي أبو عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20500",
      "name": "Usamah bin Zayd al-Lythy أسامة بن زيد الليثي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "898",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "رواه أبان بن صالح عن مجاهد، عن طاوس، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ لله تعالى على كل مسلم حق أن يغتسل في كل سبعة أيام يوما ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira through different narrators that the Prophet      said, \"It is Allah's right on every Muslim that he should take a bath      (at least) once in seven days.\"",
      "chain": [
        "19897",
        "11028",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "4304",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "وزاد ابن إسحاق حدثني ابن أبي نجيح، وأبان بن صالح، عن عطاء، ومجاهد، عن ابن عباس، قال تزوج النبي صلى الله عليه وسلم ميمونة في عمرة القضاء‏.‏",
      "text_en": "",
      "chain": [
        "11254",
        "19897",
        "11029",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "13",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت محمد بن إسحاق، يحدث عن أبان بن صالح، عن مجاهد، عن جابر بن عبد الله، قال نهى نبي الله صلى الله عليه وسلم أن نستقبل القبلة ببول فرأيته قبل أن يقبض بعام يستقبلها ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Prophet of Allah (ﷺ) forbade us to face the qiblah at the time of making water.  Then I saw him facing it (qiblah) urinating or easing himself one year before his death.",
      "chain": [
        "30160",
        "20298",
        "11272",
        "11107",
        "19897",
        "11028",
        "34"
      ]
    },
    {
      "hadith_no": "1860",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن منصور، حدثنا يعقوب، حدثني أبي، عن ابن إسحاق، حدثني أبان، - يعني ابن صالح - عن الحكم بن عتيبة، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، قال أصابني هوام في رأسي وأنا مع، رسول الله صلى الله عليه وسلم عام الحديبية حتى تخوفت على بصري فأنزل الله سبحانه وتعالى ‏{‏ فمن كان منكم مريضا أو به أذى من رأسه ‏}‏ الآية فدعاني رسول الله صلى الله عليه وسلم فقال لي ‏\"‏ احلق رأسك وصم ثلاثة أيام أو أطعم ستة مساكين فرقا من زبيب أو انسك شاة ‏\"‏ ‏.‏ فحلقت رأسي ثم نسكت ‏.‏",
      "text_en": " Ka’b bin ‘Ujrah said I had lice in my head when I accompanied the Apostle of Allaah(ﷺ) in the year of Al Hudaibiyyah so much so that I feared about my eyesight. So Allaah, the exalted revealed these verses about me. “And whoever among you is sick or hath an aliment of the head.” The Apostle of Allaah(ﷺ) called me and said “Shave your head and fast three days or give a faraq of raisins to six poor men or sacrifice a goat. So, I shaved my head and sacrificed.",
      "chain": [
        "36658",
        "20184",
        "20150",
        "11107",
        "19897",
        "11069",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "1997",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا داود بن رشيد، حدثنا يحيى بن زكريا، حدثنا محمد بن إسحاق، عن أبان بن صالح، وعن ابن أبي نجيح، عن مجاهد، عن ابن عباس، أن رسول الله صلى الله عليه وسلم أقام في عمرة القضاء ثلاثا ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) stayed (at Mecca) for three days during umrah for atonement ('Umrat al-Qada')",
      "chain": [
        "30248",
        "11107",
        "19897",
        "11254",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "2164",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عبد العزيز بن يحيى أبو الأصبغ، حدثني محمد، - يعني ابن سلمة - عن محمد بن إسحاق، عن أبان بن صالح، عن مجاهد، عن ابن عباس، قال إن ابن عمر - والله يغفر له - أوهم إنما كان هذا الحى من الأنصار - وهم أهل وثن - مع هذا الحى من يهود - وهم أهل كتاب - وكانوا يرون لهم فضلا عليهم في العلم فكانوا يقتدون بكثير من فعلهم وكان من أمر أهل الكتاب أن لا يأتوا النساء إلا على حرف وذلك أستر ما تكون المرأة فكان هذا الحى من الأنصار قد أخذوا بذلك من فعلهم وكان هذا الحى من قريش يشرحون النساء شرحا منكرا ويتلذذون منهن مقبلات ومدبرات ومستلقيات فلما قدم المهاجرون المدينة تزوج رجل منهم امرأة من الأنصار فذهب يصنع بها ذلك فأنكرته عليه وقالت إنما كنا نؤتى على حرف فاصنع ذلك وإلا فاجتنبني حتى شري أمرهما فبلغ ذلك رسول الله صلى الله عليه وسلم فأنزل الله عز وجل ‏{‏ نساؤكم حرث لكم فأتوا حرثكم أنى شئتم ‏}‏ أى مقبلات ومدبرات ومستلقيات يعني بذلك موضع الولد ‏.‏",
      "text_en": " Narrated Abdullah Ibn Abbas:                     Ibn Umar misunderstood (the Qur'anic verse, \"So come to your tilth however you will\")--may Allah forgive him. The fact is that this clan of the Ansar, who were idolaters, lived in the company of the Jews who were the people of the Book. They (the Ansar) accepted their superiority over themselves in respect of knowledge, and they followed most of their actions. The people of the Book (i.e. the Jews) used to have intercourse with their women on one side alone (i.e. lying on their backs). This was the most concealing position for (the vagina of) the women. This clan of the Ansar adopted this practice from them. But this tribe of the Quraysh used to uncover their women completely, and seek pleasure with them from in front and behind and laying them on their backs.  When the muhajirun (the immigrants) came to Medina, a man married a woman of the Ansar. He began to do the same kind of action with her, but she disliked it, and said to him: We were approached on one side (i.e. lying on the back); do it so, otherwise keep away from me. This matter of theirs spread widely, and it reached the Messenger of Allah (ﷺ).  So Allah, the Exalted, sent down the Qur'anic verse: \"Your wives are a tilth to you, so come to your tilth however you will,\" i.e. from in front, from behind or lying on the back. But this verse meant the place of the delivery of the child, i.e. the vagina.",
      "chain": [
        "20672",
        "11107",
        "19897",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "2236",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا عبد العزيز بن يحيى الحراني، حدثني محمد، - يعني ابن سلمة - عن محمد بن إسحاق، عن أبي جعفر، وعن أبان بن صالح، عن مجاهد، وعن هشام بن عروة، عن أبيه، عن عائشة، أن بريرة، أعتقت وهي عند مغيث - عبد لآل أبي أحمد - فخيرها رسول الله صلى الله عليه وسلم وقال لها ‏\"‏ إن قربك فلا خيار لك ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Barirah was emancipated, and she was the wife of Mughith, a slave of Aal AbuAhmad. The Messenger of Allah (ﷺ) gave her choice, and said to her: If he has intercourse with you, then there is no choice for you.",
      "chain": [
        "38349",
        "20672",
        "11107",
        "19897",
        "11028",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2475",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا عبد الله بن عمر بن محمد، عن أبان بن صالح القرشي، حدثنا عمرو بن محمد، - يعني العنقزي - عن عبد الله بن بديل، بإسناده نحوه قال فبينما هو معتكف إذ كبر الناس فقال ما هذا يا عبد الله قال سبى هوازن أعتقهم النبي صلى الله عليه وسلم قال وتلك الجارية ‏.‏ فأرسلها معهم ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The tradition mentioned above (No. 2468) has also been transmitted by Abdullah ibn Budayl through a different chain of narrators in a similar way. This version adds: While he (Umar) was observing i'tikaf (in the sacred mosque), the people uttered (loudly):  \"Allah is most great.\" He said: What is this, Abdullah?  He said: These are the captives of the Hawazin whom the Messenger of Allah (ﷺ) has set free. He said: This slave-girl too? He sent her along with them.",
      "chain": [
        "19897",
        "20597"
      ]
    },
    {
      "hadith_no": "2700",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد العزيز بن يحيى الحراني، حدثني محمد، - يعني ابن سلمة - عن محمد بن إسحاق، عن أبان بن صالح، عن منصور بن المعتمر، عن ربعي بن حراش، عن علي بن أبي طالب، قال خرج عبدان إلى رسول الله صلى الله عليه وسلم - يعني يوم الحديبية - قبل الصلح فكتب إليه مواليهم فقالوا يا محمد والله ما خرجوا إليك رغبة في دينك وإنما خرجوا هربا من الرق فقال ناس صدقوا يا رسول الله ردهم إليهم ‏.‏ فغضب رسول الله صلى الله عليه وسلم وقال ‏\"‏ ما أراكم تنتهون يا معشر قريش حتى يبعث الله عليكم من يضرب رقابكم على هذا ‏\"‏ ‏.‏ وأبى أن يردهم وقال ‏\"‏ هم عتقاء الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     Some slaves (of the unbelievers) went out to the Messenger of Allah (ﷺ) on the day of al-Hudaybiyyah before treaty. Their masters wrote to him saying: O Muhammad, they have not gone out to you with an interest in your religion, but they have gone out to escape from slavery. Some people said: They have spoken the truth, Messenger of Allah, send them back to them. The Messenger of Allah (ﷺ) became angry and said: I do not see your restraining yourself from this action), group of Quraysh, but that Allah send someone to you who strike your necks. He then refused to return them, and said: They are emancipated (slaves) of Allah, the Exalted.",
      "chain": [
        "38349",
        "20672",
        "11107",
        "19897",
        "11067",
        "11334",
        "5"
      ]
    },
    {
      "hadith_no": "4170",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا ابن السرح، حدثنا ابن وهب، عن أسامة، عن أبان بن صالح، عن مجاهد بن جبر، عن ابن عباس، قال لعنت الواصلة والمستوصلة والنامصة والمتنمصة والواشمة والمستوشمة من غير داء ‏.‏ قال أبو داود وتفسير الواصلة التي تصل الشعر بشعر النساء والمستوصلة المعمول بها والنامصة التي تنقش الحاجب حتى ترقه والمتنمصة المعمول بها والواشمة التي تجعل الخيلان في وجهها بكحل أو مداد والمستوشمة المعمول بها ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     The woman who supplies fake hair and the one who asks for it, the woman who pulls out hair for other people and the woman who depilates herself, the woman who tattoos and the one who has it done when there is no disease to justify it have been cursed.Abu Dawud said: Wasilah means the woman who adds false hair to the hair of women. Mustawsilah means the one who asks for adding the hair to her hair. namisah means a woman who plucks hair from the brow until she makes it thin; mutanammisah means the woman who depilates herself ; washimah is a woman who tattoos in the face with antimony or ink ; mustawshimah is a woman with whom it is done.",
      "chain": [
        "30485",
        "20029",
        "50",
        "19897",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "9",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، ومحمد بن المثنى، قالا حدثنا وهب بن جرير، حدثنا أبي، عن محمد بن إسحاق، عن أبان بن صالح، عن مجاهد، عن جابر بن عبد الله، قال نهى النبي صلى الله عليه وسلم أن نستقبل القبلة ببول فرأيته قبل أن يقبض بعام يستقبلها ‏.‏ وفي الباب عن أبي قتادة وعائشة وعمار بن ياسر ‏.‏ قال أبو عيسى حديث جابر في هذا الباب حديث حسن غريب ‏.‏",
      "text_en": " Jabir bin Abdullah said:                     \"The Prophet prohibited us from facing the Qiblah while urinating. Then i saw him facing it a year before he died.\"",
      "chain": [
        "30160",
        "30170",
        "20298",
        "11272",
        "11107",
        "19897",
        "11028",
        "34"
      ]
    },
    {
      "hadith_no": "3371",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا علي بن حجر، أخبرنا الوليد بن مسلم، عن ابن لهيعة، عن عبيد الله بن أبي جعفر، عن أبان بن صالح، عن أنس بن مالك، عن النبي صلى الله عليه وسلم قال ‏\"‏ الدعاء مخ العبادة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه لا نعرفه إلا من حديث ابن لهيعة ‏.‏",
      "text_en": " Anas bin Malik narrated that :                     the Prophet said: “The supplication is the essence of worship.”",
      "chain": [
        "20387",
        "20733",
        "20624",
        "11409",
        "19897",
        "19"
      ]
    },
    {
      "hadith_no": "2887",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني عبد الرحمن بن خالد الرقي القطان، قال حدثنا حجاج، قال ابن جريج أخبرني أبان بن صالح، عن ابن شهاب، أن عروة، أخبره أن عائشة قالت قال النبي صلى الله عليه وسلم ‏\"‏ خمس من الدواب كلهن فاسق يقتلن في الحل والحرم الكلب العقور والغراب والحدأة والعقرب والفأرة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Aishah said:                     \"The Prophet said: \"There are five animals all of which are vermin, and may killed outside and inside the sanctuary: Vicious dogs, crows, kites, scorpions and mice.'\"",
      "chain": [
        "20219",
        "11070",
        "19897",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "348",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت محمد بن إسحاق، عن أبان بن صالح، عن مجاهد، عن جابر، قال نهى رسول الله  صلى الله عليه وسلم  أن نستقبل القبلة ببول فرأيته قبل أن يقبض بعام يستقبلها ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"The Messenger of Allah forbade facing the Qiblah when urinating. But I saw him, one year before he died, facing the Qiblah (while urinating).\"",
      "chain": [
        "30160",
        "20298",
        "11272",
        "11107",
        "19897",
        "11028",
        "34"
      ]
    },
    {
      "hadith_no": "3228",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا يونس بن بكير، حدثنا محمد بن إسحاق، حدثنا أبان بن صالح، عن الحسن بن مسلم بن يناق، عن صفية بنت شيبة، قالت سمعت النبي  صلى الله عليه وسلم  يخطب عام الفتح فقال ‏\"‏ يا أيها الناس إن الله حرم مكة يوم خلق السموات والأرض فهي حرام إلى يوم القيامة لا يعضد شجرها ولا ينفر صيدها ولا يأخذ لقطتها إلا منشد ‏\"‏ ‏.‏ فقال العباس إلا الإذخر فإنه للبيوت والقبور ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ إلا الإذخر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Safiyyah bint Shaibah said:                      “I heard the Prophet(ﷺ) delivering a sermon in the Year of the Conquest (of Makkah),and he said: ‘O people, Allah made Makkah sacred the day He createdthe heavens and the earth, and it is sacred until the Day ofResurrection. Its trees are not to be cut, its game is not to bedisturbed, and its lost property is not to be taken except by one whowill announce it.’‘Abbas said: ‘Except for Idhkhir (a kind of fragrant grass), for it is (used) for houses and graves.’ The messenger of Allah (ﷺ) said: ‘Except for Idhkhir.’”",
      "chain": [
        "30212",
        "20118",
        "11107",
        "19897",
        "11557",
        "2802"
      ]
    },
    {
      "hadith_no": "4175",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا يونس بن عبد الأعلى، حدثنا محمد بن إدريس الشافعي، حدثني محمد بن خالد الجندي، عن أبان بن صالح، عن الحسن، عن أنس بن مالك، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لا يزداد الأمر إلا شدة ولا الدنيا إلا إدبارا ولا الناس إلا شحا ولا تقوم الساعة إلا على شرار الناس ولا المهدي إلا عيسى ابن مريم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that the Messenger of Allah (ﷺ)said:                      “Adhering to religion will only become harder and worldlyaffairs will only become more difficult, and people will only becomemore stingy, and the Hour will only come upon the worst of people,andthe only Mahdi (after Muhammad (ﷺ)) is ‘Eisa bin Maryam.”",
      "chain": [
        "30493",
        "20002",
        "28507",
        "19897",
        "11016",
        "19"
      ]
    }
  ],
  "total_hadiths": 16
}