{
  "id": "19903",
  "name": "al-Harith bin 'Abdur Rahman الحارث بن عبد الرحمن القرشي",
  "full_name": "al-Harith bin 'Abdur Rahman الحارث بن عبد الرحمن القرشي",
  "grade": "Follower(Tabi') [5th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "129",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ 4  -  صدوق ]"
    ],
    "tags": [
      "Quraish",
      "B.'Amir"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11011",
      "name": "Salim bin 'Abdullah bin 'Umar سالم بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11818",
      "name": "Hamza bin 'Abdullah bin 'Umar حمزة بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11058",
      "name": "Muhammad bin Jubayr bin Mut'im محمد بن جبير بن مطعم بن عدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11211",
      "name": "Karayb bin Abi Muslim كريب بن أبي مسلم الهاشمي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11218",
      "name": "Muhammad bin 'AR bin Thauban محمد بن عبد الرحمن بن ثوبان",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "7147",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثنا علي بن خشرم، أخبرنا أبو ضمرة، عن الحارث بن عبد الرحمن، عن عطاء، بن ميناء عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لما قضى الله الخلق كتب في كتابه على نفسه فهو موضوع عنده إن رحمتي تغلب غضبي ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      When Allah created the creation, He ordained for Himself and this document is with Him: Verily, My mercy predominates Mv wrath.",
      "chain": [
        "30556",
        "20157",
        "19903",
        "11205",
        "13"
      ]
    },
    {
      "hadith_no": "3580",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا ابن أبي ذئب، عن الحارث بن عبد الرحمن، عن أبي سلمة، عن عبد الله بن عمرو، قال لعن رسول الله صلى الله عليه وسلم الراشي والمرتشي ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Messenger of Allah (ﷺ) cursed the one who bribes and the one who takes bribe.",
      "chain": [
        "30184",
        "20177",
        "19903",
        "10567",
        "29"
      ]
    },
    {
      "hadith_no": "4484",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا نصر بن عاصم الأنطاكي، حدثنا يزيد بن هارون الواسطي، حدثنا ابن أبي ذئب، عن الحارث بن عبد الرحمن، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا سكر فاجلدوه ثم إن سكر فاجلدوه ثم إن سكر فاجلدوه فإن عاد الرابعة فاقتلوه ‏\"‏ ‏.‏ قال أبو داود وكذا حديث عمر بن أبي سلمة عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم ‏\"‏ إذا شرب الخمر فاجلدوه فإن عاد الرابعة فاقتلوه ‏\"‏ ‏.‏ قال أبو داود وكذا حديث سهيل عن أبي صالح عن أبي هريرة عن النبي صلى الله عليه وسلم ‏\"‏ إن شربوا الرابعة فاقتلوهم ‏\"‏ ‏.‏ وكذا حديث ابن أبي نعم عن ابن عمر عن النبي صلى الله عليه وسلم وكذا حديث عبد الله بن عمرو عن النبي صلى الله عليه وسلم والشريد عن النبي صلى الله عليه وسلم وفي حديث الجدلي عن معاوية أن النبي صلى الله عليه وسلم قال ‏\"‏ فإن عاد في الثالثة أو الرابعة فاقتلوه ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: If he is intoxicated, flog him; again if he is intoxicated, flog him; again if he is intoxicated, flog him if he does it again a fourth time, kill him. Abu Dawud said: And there is a similar tradition of Umar ibn AbuSalamah, from his father, on the authority of AbuHurayrah, from the Prophet (ﷺ): If he drinks wine, flog him if he does it so again, a fourth time, kill him.Abu Dawud said: And there is similar tradition of Suhail from Abu Salih on the authority of Abu Hurairah, from the Prophet (ﷺ): It they drink a fourth time, kill them. And there is similar tradition of Ibn Abi Nu'm on the authority of Ibn 'Umar from Prophet (ﷺ). There is also similar tradition of 'Abd Allah b. 'Amr from the Prophet (ﷺ), and from Sharid from the Prophet (ﷺ). And in the tradition of al-Jadli from Mu'awiyah, the Prophet (ﷺ) said: If he does so again third or fourth time, kill him.",
      "chain": [
        "38662",
        "20472",
        "20177",
        "19903",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1227",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن محمد، أنبأنا ابن المبارك، أنبأنا ابن أبي ذئب، عن الحارث بن عبد الرحمن، عن حمزة بن عبد الله بن عمر، عن ابن عمر، قال كانت تحتي امرأة أحبها وكان أبي يكرهها فأمرني أبي أن أطلقها فأبيت فذكرت ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ يا عبد الله بن عمر طلق امرأتك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح إنما نعرفه من حديث ابن أبي ذئب ‏.‏",
      "text_en": " Ibn Umar narrated:                     \"I had a wife whom I loved, but my father disliked her, so he ordered me to divorce her but I refused. I mentioned that to the Prophet and he said: 'O Abdullah bin Umar! Divorce your wife.'\"",
      "chain": [
        "30304",
        "20025",
        "20177",
        "19903",
        "11818",
        "18"
      ]
    },
    {
      "hadith_no": "3692",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الملك بن عمرو العقدي، عن ابن أبي ذئب، عن الحارث بن عبد الرحمن، عن أبي سلمة، عن عائشة، أن النبي صلى الله عليه وسلم نظر إلى القمر فقال ‏\"‏ يا عائشة استعيذي بالله من شر هذا فإن هذا الغاسق إذا وقب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Aishah narrated:                     “The Prophet looked at the moon and he said: ‘O Aishah! Do you seek refuge with Allah from the evil of this? For indeed this is Al-Ghasiqu Idha Waqab (The darkened one as it darkens).’”",
      "chain": [
        "30170",
        "20177",
        "19903",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "826",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، عن ابن أبي ذئب، قال أخبرني الحارث بن عبد الرحمن، عن سالم بن عبد الله، عن عبد الله بن عمر، قال كان رسول الله صلى الله عليه وسلم يأمر بالتخفيف ويؤمنا بالصافات ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Umar said:                      \"The Messenger of Allah (ﷺ) used to enjoin upon us to make the prayer short, but he would lead us in prayer and recite As-Saffat.\"",
      "chain": [
        "34033",
        "20226",
        "20177",
        "19903",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "3244",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرني حاجب بن سليمان، قال حدثنا حجاج، قال حدثنا ابن أبي ذئب، عن الزهري، ويزيد بن عبد الله بن قسيط، عن أبي سلمة بن عبد الرحمن، وعن الحارث بن عبد الرحمن، عن محمد بن عبد الرحمن بن ثوبان، أنهما سألا فاطمة بنت قيس عن أمرها، فقالت طلقني زوجي ثلاثا فكان يرزقني طعاما فيه شىء فقلت والله لئن كانت لي النفقة والسكنى لأطلبنها ولا أقبل هذا ‏.‏ فقال الوكيل ليس لك سكنى ولا نفقة ‏.‏ قالت فأتيت النبي صلى الله عليه وسلم فذكرت ذلك له فقال ‏\"‏ ليس لك سكنى ولا نفقة فاعتدي عند فلانة ‏\"‏ ‏.‏ قالت وكان يأتيها أصحابه ثم قال ‏\"‏ اعتدي عند ابن أم مكتوم فإنه أعمى فإذا حللت فآذنيني ‏\"‏ ‏.‏ قالت فلما حللت آذنته فقال رسول الله صلى الله عليه وسلم ‏\"‏ ومن خطبك ‏\"‏ ‏.‏ فقلت معاوية ورجل آخر من قريش ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أما معاوية فإنه غلام من غلمان قريش لا شىء له وأما الآخر فإنه صاحب شر لا خير فيه ولكن انكحي أسامة بن زيد ‏\"‏ ‏.‏ قالت فكرهته ‏.‏ فقال لها ذلك ثلاث مرات فنكحته ‏.‏",
      "text_en": " It was narrated from Muhammad bin 'Abdur-Rahman bin Thawban that they asked Fatimah bint Qais about her story and she said:                      \"My husband divorced me three times, and he used to provide me with food that was not good.\" She said: \"By Allah, if I were entitled to maintenance and accommodation I would demand them and I would not accept this.\" The deputy said: \"You are not entitled to accommodation or maintenance.\" She said: \"I came to the Prophet and told him about that, and he said: 'You are not entitled to accommodation nor maintenance; observe your 'Iddah in the house of so-and-so.' She said: 'His Companions used to go to her.' Then he said: 'Observe your 'Iddah in the house of Ibn Umm Maktum, who is blind, and when your 'Iddah is over, let me know.'\"  She said: \"When my 'Iddah was over, I let him know. The Messenger of Allah said: 'Who has proposed marriage to you?' I said: 'Mu'awiyah and another man from the Quraish.' He said: 'As for Mu'awiyah, he is a boy among the Quraish and does not have anything, and as for the other he is a bad man with no goodness in him. Rather you should marry Usamah bin Zaid.'\" She said: \"I did not like the idea.\" But he said that to her three times so she married him.",
      "chain": [
        "38136",
        "20219",
        "20177",
        "11013",
        "11236",
        "10567",
        "19903"
      ]
    },
    {
      "hadith_no": "3948",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Kind Treatment of Women - كتاب عشرة النساء",
      "chapter_no": "36",
      "text_ar": "أخبرنا علي بن خشرم، قال أنبأنا عيسى بن يونس، عن ابن أبي ذئب، عن الحارث بن عبد الرحمن، عن أبي سلمة، عن عائشة، أن النبي صلى الله عليه وسلم قال ‏\"‏ فضل عائشة على النساء كفضل الثريد على سائر الطعام ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that the Prophet said:                      \"The superiority of 'Aishah to other women is like the superiority of Tharid to other kinds of food.\"",
      "chain": [
        "30556",
        "20347",
        "20177",
        "19903",
        "10567",
        "53"
      ]
    }
  ],
  "total_hadiths": 8
}