{
  "id": "19909",
  "name": "Rashid bin Sa'd راشد بن سعد",
  "full_name": "Rashid bin Sa'd راشد بن سعد",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "113",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Ray",
      "al-Hims"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  4  -  ثقة ]"
    ],
    "tags": [
      "al-Ra'",
      "al-Himsi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "130",
      "name": "Thawban bin Bujdud ( ثوبان مولى رسول الله صلى الله عليه وسلم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "9",
      "name": "Sa'd ibn Abi Waqqas ( سعد بن أبي وقاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "37",
      "name": "Abu al-Darda ( أبو الدرداء عويمر بن زيد بن قيس الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "28",
      "name": "'Amr bin al-'Aas ( عمرو بن العاص بن وائل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5021",
      "name": "Dhw Mkhbr Bksr ( ذو مخبر الحبشي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10805",
      "name": "'Auf bin Malik bin Nadlah عوف بن مالك بن نضلة - أبو الأحوص",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5334",
      "name": "Ya'la bin Marra bin Wahb ( يعلي بن مرة بن وهب بن جابر الثقفي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5034",
      "name": "Zubayb bin Tha'laba ( زبيب بن ثعلبة بن عمرو ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3650",
      "name": "'Abdullah bin Basr al-Maazni ( عبد الله بن بسر المازني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "405",
      "name": "Abu Umama bin Sahl ( أسعد أبو أمامة بن سهل بن حنيف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18481",
      "name": "'Amir bin 'Abdullah al-Huzani عامر بن عبد الله بن لحي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10942",
      "name": "'Abdur Rahman bin Jbyr عبد الرحمن بن جبير",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "11684",
      "name": "Huraiz bin 'Uthman bin Jabir حريز بن عثمان بن جبر الرحبي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10921",
      "name": "Safwan bin 'Amr bin Harm al-Saksaki صفوان بن عمرو بن هرم السكسكي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20675",
      "name": "Mu'awiya bin Salah bin Hadayr معاوية بن صالح بن حدير",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10948",
      "name": "'Ali bin Abi Talha علي بن أبي طلحة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20415",
      "name": "Thaur bin Yazid al-Rahbi ثور بن يزيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "27053",
      "name": "Abu Bakr bin 'Abdullah bin Abi Maryum أبو بكر بن عبد الله بن أبي مريم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "146",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا يحيى بن سعيد، عن ثور، عن راشد بن سعد، عن ثوبان، قال بعث رسول الله صلى الله عليه وسلم سرية فأصابهم البرد فلما قدموا على رسول الله صلى الله عليه وسلم أمرهم أن يمسحوا على العصائب والتساخين ‏.‏",
      "text_en": " Narrated Thawban:                     The Messenger of Allah (ﷺ) sent out an expedition. They were affected by cold. When they returned to the Messenger of Allah (ﷺ), he commanded them to wipe over turbans and stockings.",
      "chain": [
        "30007",
        "20031",
        "11155",
        "19909",
        "130"
      ]
    },
    {
      "hadith_no": "421",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو بن عثمان الحمصي، حدثنا أبي، حدثنا حريز، عن راشد بن سعد، عن عاصم بن حميد السكوني، أنه سمع معاذ بن جبل، يقول ارتقبنا النبي صلى الله عليه وسلم في صلاة العتمة فأخر حتى ظن الظان أنه ليس بخارج والقائل منا يقول صلى فإنا لكذلك حتى خرج النبي صلى الله عليه وسلم فقالوا له كما قالوا فقال لهم ‏\"‏ أعتموا بهذه الصلاة فإنكم قد فضلتم بها على سائر الأمم ولم تصلها أمة قبلكم ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     We waited for the Prophet (ﷺ) to offer the night prayer. He delayed until people thought that he would not come out and some of us said that he had offered the prayer. At the moment when we were in this condition the Prophet (ﷺ) came out. People said to him as they were already saying. He said: Observe this prayer when it is dark, for by it you have been made superior to all the peoples, no people having observed it before you.",
      "chain": [
        "38429",
        "28388",
        "19909",
        "18471",
        "32"
      ]
    },
    {
      "hadith_no": "1765",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا إبراهيم بن موسى الرازي، أخبرنا عيسى، ح وحدثنا مسدد، أخبرنا عيسى، - وهذا لفظ إبراهيم - عن ثور، عن راشد بن سعد، عن عبد الله بن عامر بن لحى، عن عبد الله بن قرط، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن أعظم الأيام عند الله تبارك وتعالى يوم النحر ثم يوم القر ‏\"‏ ‏.‏ قال عيسى قال ثور وهو اليوم الثاني ‏.‏ قال وقرب لرسول الله صلى الله عليه وسلم بدنات خمس أو ست فطفقن يزدلفن إليه بأيتهن يبدأ فلما وجبت جنوبها - قال فتكلم بكلمة خفية لم أفهمها فقلت ما قال - قال ‏\"‏ من شاء اقتطع ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Qurt:                     The Prophet (ﷺ) said: The greatest day in Allah's sight is the day of sacrifice and next the day of resting which Isa said on the authority of Thawr is the second day. Five or six sacrificial camels were brought to the Messenger of Allah (ﷺ) and they began to draw near to see which he would sacrifice first. When they fell down dead, he said something in a low voice, which I could not catch. So I asked: What did he say? He was told that he had said: Anyone who wants can cut off a piece.",
      "chain": [
        "30309",
        "20347",
        "30175",
        "20347",
        "11155",
        "19909"
      ]
    },
    {
      "hadith_no": "2899",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، عن بديل، عن علي بن أبي طلحة، عن راشد بن سعد، عن أبي عامر الهوزني عبد الله بن لحى، عن المقدام، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من ترك كلا فإلى ‏\"‏ ‏.‏ وربما قال ‏\"‏ إلى الله وإلى رسوله ‏\"‏ ‏.‏ ‏\"‏ ومن ترك مالا فلورثته وأنا وارث من لا وارث له أعقل له وأرثه والخال وارث من لا وارث له يعقل عنه ويرثه ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Miqdam al-Kindi:                     The Prophet (ﷺ) said: If anyone leaves a debt or a  helpless family I shall be responsible-and sometimes the narrator said: Allah and His Apostle  will be responsible-but if anyone leaves property, it goes to his heirs. I am the heirs of him who has none, paying blood-wit for him and inheriting from him; and a maternal uncle is the heir of him who has none, paying blood-wit for him and inheriting from him.",
      "chain": [
        "30329",
        "20020",
        "10948",
        "19909",
        "5304"
      ]
    },
    {
      "hadith_no": "2900",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا سليمان بن حرب، - في آخرين - قالوا حدثنا حماد، عن بديل، - يعني ابن ميسرة - عن علي بن أبي طلحة، عن راشد بن سعد، عن أبي عامر الهوزني، عن المقدام الكندي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنا أولى بكل مؤمن من نفسه فمن ترك دينا أو ضيعة فإلى ومن ترك مالا فلورثته وأنا مولى من لا مولى له أرث ماله وأفك عانه والخال مولى من لا مولى له يرث ماله ويفك عانه ‏\"‏ ‏.‏ قال أبو داود رواه الزبيدي عن راشد بن سعد عن ابن عائذ عن المقدام ورواه معاوية بن صالح عن راشد قال سمعت المقدام ‏.‏ قال أبو داود يقول الضيعة معناه عيال ‏.‏",
      "text_en": " Narrated Al-Miqdam al-Kindi:                     The Prophet (ﷺ) said: I am nearer to every believer than himself, so if anyone leaves a debt or a helpless family, I shall be responsible, but if anyone leaves property, it goes to his heirs. I am patron of him who has none, inheriting his property and freeing him from his liabilities. A maternal uncle is patron of him who has none, inheriting his property and freeing him from his liabilities.Abu Dawud said: da'iah means dependants or helpless family.Abu Dawud said: This tradition has been transmitted by al-Zubaidi from Rashid b. Sa'd from Ibn 'A'idh on the authority of al-Miqdam. It has also been transmitted by Mu'awiyah b. Salih from Rashid who said: I heard al-Miqdam (say).",
      "chain": [
        "20193",
        "20022",
        "10672",
        "10948",
        "19909"
      ]
    },
    {
      "hadith_no": "4878",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن المصفى، حدثنا بقية، وأبو المغيرة، قالا حدثنا صفوان، قال حدثني راشد بن سعد، وعبد الرحمن بن جبير، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لما عرج بي مررت بقوم لهم أظفار من نحاس يخمشون وجوههم وصدورهم فقلت من هؤلاء يا جبريل قال هؤلاء الذين يأكلون لحوم الناس ويقعون في أعراضهم ‏\"‏ ‏.‏ قال أبو داود حدثناه يحيى بن عثمان عن بقية ليس فيه أنس ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Prophet (ﷺ) said: When I was taken up to heaven I passed by people who had nails of copper and were scratching their faces and their breasts. I said: Who are these people,  Gabriel? He replied: They are those who were given to back biting and who aspersed people's honour.Abu Dawud said: Yahya b. 'Uthman has also transmitted it from Baqiyyah, there is no mention of Anas in it.",
      "chain": [
        "20644",
        "20442",
        "10921",
        "19909",
        "10865",
        "19"
      ]
    },
    {
      "hadith_no": "4888",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عيسى بن محمد الرملي، وابن، عوف - وهذا لفظه - قالا حدثنا الفريابي، عن سفيان، عن ثور، عن راشد بن سعد، عن معاوية، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنك إن اتبعت عورات الناس أفسدتهم أو كدت أن تفسدهم ‏\"‏ ‏.‏ فقال أبو الدرداء كلمة سمعها معاوية من رسول الله صلى الله عليه وسلم نفعه الله تعالى بها ‏.‏",
      "text_en": " Narrated Mu'awiyah:                     I heard the Messenger of Allah (ﷺ) say: If you search for the faults of the people, you will corrupt them, or will nearly corrupt them. AbudDarda' said: These are the words which Mu'awiyah himself from the Messenger of Allah (ﷺ), and Allah benefited him by them.",
      "chain": [
        "38443",
        "20034",
        "20012",
        "11155",
        "19909",
        "27"
      ]
    },
    {
      "hadith_no": "1012",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا علي بن حجر، أخبرنا عيسى بن يونس، عن أبي بكر بن أبي مريم، عن راشد بن سعد، عن ثوبان، قال خرجنا مع رسول الله صلى الله عليه وسلم في جنازة فرأى ناسا ركبانا فقال ‏\"‏ ألا تستحيون إن ملائكة الله على أقدامهم وأنتم على ظهور الدواب ‏\"‏ ‏.‏ قال وفي الباب عن المغيرة بن شعبة وجابر بن سمرة ‏.‏ قال أبو عيسى حديث ثوبان قد روي عنه موقوفا قال محمد الموقوف منه أصح ‏.‏",
      "text_en": " Thawban narrated:                     \"We went with the Prophet (following) a funeral. He saw people riding so he said: 'Are you not ashamed? Indeed Allah's angels are on their feet, while you are on the backs of your beasts'\"",
      "chain": [
        "20387",
        "20347",
        "27053",
        "19909",
        "130"
      ]
    },
    {
      "hadith_no": "3345",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الحسن بن عرفة، حدثنا إسماعيل بن عياش، عن أبي بكر بن أبي مريم الغساني، عن راشد بن سعد، عن سعد بن أبي وقاص، عن النبي صلى الله عليه وسلم في هذه الآية‏:‏  ‏(‏قل هو القادر على أن يبعث عليكم عذابا من فوقكم أو من تحت أرجلكم ‏)‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أما إنها كائنة ولم يأت تأويلها بعد ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated Sa'd bin Abi Waqqas:                     from the Prophet (ﷺ), regarding this Ayah \"Say: He has the power to send torment on you from above or from under your feet...' the Prophet (ﷺ) said \"Indeed they shall be, even though they have not occurred as of yet.\"",
      "chain": [
        "36540",
        "20736",
        "19909",
        "9"
      ]
    },
    {
      "hadith_no": "2053",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إبراهيم بن الحسن، قال حدثنا حجاج، عن ليث بن سعد، عن معاوية بن صالح، أن صفوان بن عمرو، حدثه عن راشد بن سعد، عن رجل، من أصحاب النبي صلى الله عليه وسلم أن رجلا قال يا رسول الله ما بال المؤمنين يفتنون في قبورهم إلا الشهيد قال ‏\"‏ كفى ببارقة السيوف على رأسه فتنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Rashid bin Sa'd, that a man among the Companions of the Prophet said:                     \"O Messenger of Allah, why will the believers be tested in their graves except the martyr?\" He said: \"The flashing of the swords above his head is trial enough.\"",
      "chain": [
        "38070",
        "20219",
        "20023",
        "20675",
        "10921",
        "19909"
      ]
    },
    {
      "hadith_no": "563",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمود بن خالد، والعباس بن الوليد الدمشقيان، قالا حدثنا مروان بن محمد، حدثنا رشدين، أنبأنا معاوية بن صالح، عن راشد بن سعد، عن أبي أمامة الباهلي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن الماء لا ينجسه شىء إلا ما غلب على ريحه وطعمه ولونه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Umamah Al-Bahili said:                     \"The Messenger of Allah said: 'Water is not made impure by anything except that which changes its smell, taste and color.'\"",
      "chain": [
        "37534",
        "20640",
        "20675",
        "19909",
        "4048"
      ]
    },
    {
      "hadith_no": "1547",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا كثير بن عبيد الحمصي، حدثنا بقية بن الوليد، عن أبي بكر بن أبي مريم، عن راشد بن سعد، عن ثوبان، مولى رسول الله  صلى الله عليه وسلم  قال رأى رسول الله  صلى الله عليه وسلم  ناسا ركبانا على دوابهم في جنازة فقال ‏\"‏ ألا تستحيون أن ملائكة الله يمشون على أقدامهم وأنتم ركبان ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Thawban, the freed slave of the Messenger ofAllah(ﷺ), said:                      “The Messenger of Allah (ﷺ) saw some peopleridingon their animals in a funeral (procession). He said: ‘Do younotfeel ashamed that the angels of Allah are walking on foot and youareriding?’”",
      "chain": [
        "38462",
        "20644",
        "27053",
        "19909"
      ]
    },
    {
      "hadith_no": "1996",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا إسحاق بن وهب الواسطي، حدثنا الوليد بن القاسم الهمداني، حدثنا الأحوص بن حكيم، عن أبيه، وراشد بن سعد، وعبد الأعلى بن عدي، عن عتبة بن عبد السلمي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا أتى أحدكم أهله فليستتر ولا يتجرد تجرد العيرين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Utbah bin 'Abd Sulamain:                     that the Messenger of Allah said: “When anyone of you has intercourse with his wife, let him cover himself and not be naked liked donkeys.”",
      "chain": [
        "30314",
        "25341",
        "18014",
        "19909",
        "5166"
      ]
    },
    {
      "hadith_no": "2736",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا يحيى بن درست، حدثنا حماد بن زيد، عن بديل بن ميسرة، عن علي بن أبي طلحة، عن راشد بن سعد، عن أبي عامر الهوزني، عن المقدام الشامي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنا وارث من لا وارث له أعقل عنه وأرثه والخال وارث من لا وارث له يعقل عنه ويرثه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Miqdam Ash-Shami that the Messenger of Allah (ﷺ) said:                     “I am the heir of the one who has no heir, and I will pay blood money on his behalf and inherit from him, and the maternal uncle is the heir of the one who has no heir; he pays the blood money on his behalf and inherits from him.'”",
      "chain": [
        "34282",
        "20022",
        "10672",
        "10948",
        "19909"
      ]
    },
    {
      "hadith_no": "2843",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Shares of Inheritance - كتاب الفرائض",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شبابة، ح وحدثنا محمد بن الوليد، حدثنا محمد بن جعفر، قالا حدثنا شعبة، حدثني بديل بن ميسرة العقيلي، عن علي بن أبي طلحة، عن راشد بن سعد، عن أبي عامر الهوزني، عن المقدام أبي كريمة، - رجل من أهل الشام من أصحاب رسول الله صلى الله عليه وسلم قال - قال رسول الله صلى الله عليه وسلم ‏\"‏ من ترك مالا فلورثته ومن ترك كلا فإلينا - وربما قال فإلى الله وإلى رسوله - وأنا وارث من لا وارث له أعقل عنه وأرثه والخال وارث من لا وارث له يعقل عنه ويرثه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Miqdam Abu Karimah, a man from Sham who was oneof theCompanions of the Messenger of Allah (ﷺ), that the MessengerofAllah (ﷺ) said:                      “Whoever leaves behind wealth, it is for hisheirs. Whoever leaves behind poor dependents and a debt, it is for usto take care of – or he said: ‘It is for Allah and His Messenger(totake care of) – I am the heir of the one who has no heir, Iwill paythe blood money on his behalf and inherit from him. And thematernaluncle is the heir of the one who has no heir, he pays bloodmoney onhis behalf and inherits from him.”",
      "chain": [
        "30201",
        "20426",
        "20459",
        "20173",
        "20020",
        "10672",
        "10948",
        "19909"
      ]
    },
    {
      "hadith_no": "4127",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عمرو بن عثمان بن سعيد بن كثير بن دينار الحمصي، حدثنا عباد بن يوسف، حدثنا صفوان بن عمرو، عن راشد بن سعد، عن عوف بن مالك، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ افترقت اليهود على إحدى وسبعين فرقة فواحدة في الجنة وسبعون في النار وافترقت النصارى على ثنتين وسبعين فرقة فإحدى وسبعون في النار وواحدة في الجنة والذي نفس محمد بيده لتفترقن أمتي على ثلاث وسبعين فرقة فواحدة في الجنة وثنتان وسبعون في النار ‏\"‏ ‏.‏ قيل يا رسول الله من هم قال ‏\"‏ الجماعة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from ‘Awf binMalik that the Messenger of Allah(ﷺ)said:                      “The Jews split intoseventy-one sects, one of which will be inParadise and seventy inHell. The Christians split into seventy-twosects, seventy-one ofwhich will be in Hell and one in Paradise. Iswear by the One WhoseHand is the soul of Muhammad, my nation willsplit into seventy-threesects, one of which will be in Paradise andseventy-two in Hell.”It was said: “O Messenger of Allah, who arethey?” He said: “Themain body.”",
      "chain": [
        "10581",
        "10921",
        "19909",
        "10805"
      ]
    }
  ],
  "total_hadiths": 16
}