{
  "id": "19911",
  "name": "Shu'aib bin Muhammad bin 'Abdullah شعيب بن محمد بن عبد الله بن عمرو",
  "full_name": "Shu'aib bin Muhammad bin 'Abdullah شعيب بن محمد بن عبد الله بن عمرو",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ 4  -  ثقة ثبت ]"
    ],
    "tags": [
      "Quraish",
      "B.Sahm",
      "Hijazi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "40",
      "name": "'Ubada bin As-Samit ( عبادة بن الصامت بن قيس بن أصرم ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18924",
      "name": "Muhammad bin 'Abdullah محمد بن عبد الله بن عمرو بن العاص",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "19934",
      "name": "'Amr bin Shu'aib bin Muhammad عمرو بن شعيب بن محمد السهمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19960",
      "name": "Shu'aib bin Shu'aib bin Muhammad شعيب بن شعيب بن محمد السهمي",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11269",
      "name": "Thabit bin Aslam Albanani ثابت بن أسلم البناني",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "135",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، حدثنا أبو عوانة، عن موسى بن أبي عائشة، عن عمرو بن شعيب، عن أبيه، عن جده، أن رجلا، أتى النبي صلى الله عليه وسلم فقال يا رسول الله كيف الطهور فدعا بماء في إناء فغسل كفيه ثلاثا ثم غسل وجهه ثلاثا ثم غسل ذراعيه ثلاثا ثم مسح برأسه فأدخل إصبعيه السباحتين في أذنيه ومسح بإبهاميه على ظاهر أذنيه وبالسباحتين باطن أذنيه ثم غسل رجليه ثلاثا ثلاثا ثم قال ‏\"‏ هكذا الوضوء فمن زاد على هذا أو نقص فقد أساء وظلم ‏\"‏ ‏.‏ أو ‏\"‏ ظلم وأساء ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     A man came to the Prophet (ﷺ) and asked him: Messenger of Allah, how is the ablution (to performed)? He (the Prophet) then called for water in a vessel and washed his hands up to the wrists three times, then washed his face three times, and washed his forearms three times. He then wiped his head and inserted both his index fingers in his ear-holes; he wiped the back of his ears with his thumbs and the front of his ears with the index fingers. He then washed his feet three times. Then he said: This is how ablution should be performed. If anyone does more or less than this, he has done wrong and transgressed, or (said) transgressed and done wrong.",
      "chain": [
        "30175",
        "20469",
        "11399",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "347",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا ابن أبي عقيل، ومحمد بن سلمة المصريان، قالا حدثنا ابن وهب، - قال ابن أبي عقيل - أخبرني أسامة، - يعني ابن زيد - عن عمرو بن شعيب، عن أبيه، عن عبد الله بن عمرو بن العاص، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ من اغتسل يوم الجمعة ومس من طيب امرأته - إن كان لها - ولبس من صالح ثيابه ثم لم يتخط رقاب الناس ولم يلغ عند الموعظة كانت كفارة لما بينهما ومن لغا وتخطى رقاب الناس كانت له ظهرا ‏\"‏ ‏.‏",
      "text_en": " 'Abd Allah b. 'Amr al-'As reported the Prophet (ﷺ) as saying:                      Whoever washed himself on Friday and applies perfume of his wife if she has one, and wears good clothes and does not step over the necks of the people (in the mosque to sit in the front row) and does not indulge in idle talk during the sermon, that will atone (for his sins) between the two Fridays. But he who indulges in idle talk and steps over the necks of people (in the mosque), that (Friday) will be for him like the noon prayer.",
      "chain": [
        "20672",
        "20029",
        "50",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "495",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مؤمل بن هشام، - يعني اليشكري - حدثنا إسماعيل، عن سوار أبي حمزة، - قال أبو داود وهو سوار بن داود أبو حمزة المزني الصيرفي - عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مروا أولادكم بالصلاة وهم أبناء سبع سنين واضربوهم عليها وهم أبناء عشر سنين وفرقوا بينهم في المضاجع ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Messenger of Allah (ﷺ) said: Command your children to pray when they become seven years old, and beat them for it (prayer) when they become ten years old; and arrange their beds (to sleep) separately.",
      "chain": [
        "30180",
        "20208",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "653",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا علي بن المبارك، عن حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، قال رأيت رسول الله صلى الله عليه وسلم يصلي حافيا ومنتعلا ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     I saw the Messenger of Allah (ﷺ) praying both  barefooted and wearing sandals.",
      "chain": [
        "20285",
        "20449",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "708",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا عيسى بن يونس، حدثنا هشام بن الغاز، عن عمرو بن شعيب، عن أبيه، عن جده، قال هبطنا مع رسول الله صلى الله عليه وسلم من ثنية أذاخر فحضرت الصلاة - يعني - فصلى إلى جدار فاتخذه قبلة ونحن خلفه فجاءت بهمة تمر بين يديه فما زال يدارئها حتى لصق بطنه بالجدار ومرت من ورائه ‏.‏ أو كما قال مسدد ‏.‏",
      "text_en": " ‘Amr b. Shu’aib reported from his father on the authority of his grand-father:                      We came down from the mountain pass of Adhaakhir in the company of the Messenger of Allah (ﷺ). The time of prayer came and he prayed facing a direction of prayer, and we were (standing) behind him. Then a kid came and passed in front of him. He kept on stopping it until he brought his stomach near the wall (to detain it), and at last it passed behind him, or as Musaddad said.",
      "chain": [
        "30175",
        "20347",
        "20729",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "814",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن سعيد السرخسي، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت محمد بن إسحاق، يحدث عن عمرو بن شعيب، عن أبيه، عن جده، أنه قال ما من المفصل سورة صغيرة ولا كبيرة إلا وقد سمعت رسول الله صلى الله عليه وسلم يؤم الناس بها في الصلاة المكتوبة ‏.‏",
      "text_en": " ‘Amr b. Shu’aib, on his father’s authority, quoted his grandfather as saying:                      There is no short or long surah in al-Mufassal which I have not heard the Messenger of Allah (May peace be upon him) reciting when he led the people in the prescribed prayer.",
      "chain": [
        "30296",
        "20298",
        "11272",
        "11107",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1079",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن ابن عجلان، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم نهى عن الشراء والبيع في المسجد وأن تنشد فيه ضالة وأن ينشد فيه شعر ونهى عن التحلق قبل الصلاة يوم الجمعة ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Messenger of Allah (ﷺ) prohibited buying and selling in the mosque, announcing aloud about a lost thing, the recitation of a poem in it, and prohibited sitting in a circle (in the mosque) on Friday before the prayer.",
      "chain": [
        "30175",
        "20031",
        "10616",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1113",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، وأبو كامل قالا حدثنا يزيد، عن حبيب المعلم، عن عمرو بن شعيب، عن أبيه، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم قال ‏\"‏ يحضر الجمعة ثلاثة نفر رجل حضرها يلغو وهو حظه منها ورجل حضرها يدعو فهو رجل دعا الله عز وجل إن شاء أعطاه وإن شاء منعه ورجل حضرها بإنصات وسكوت ولم يتخط رقبة مسلم ولم يؤذ أحدا فهي كفارة إلى الجمعة التي تليها وزيادة ثلاثة أيام وذلك بأن الله عز وجل يقول ‏{‏ من جاء بالحسنة فله عشر أمثالها ‏}‏ ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: Three types of people attend Friday prayer; One is present in a frivolous way and that is all he gets from it; another comes with a supplication, Allah may grant or refuse his request as He wishes; another is present silently and quietly with-out stepping over a Muslim or annoying anyone, and that is an atonement for his sins till the next Friday and three days more, the reason being that Allah, the Exalted, says: \"He who does a good deed will have ten times as much\" (vi.160).",
      "chain": [
        "30175",
        "30559",
        "20304",
        "11276",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "1151",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا المعتمر، قال سمعت عبد الله بن عبد الرحمن الطائفي، يحدث عن عمرو بن شعيب، عن أبيه، عن عبد الله بن عمرو بن العاص، قال قال نبي الله صلى الله عليه وسلم ‏\"‏ التكبير في الفطر سبع في الأولى وخمس في الآخرة والقراءة بعدهما كلتيهما ‏\"‏ ‏.‏",
      "text_en": " 'Abd b. 'Amr b. al-'As said:                      The Prophet of Allah (ﷺ) said: There are seven takers in the first rak'ah and five in the second rak'ah of the prayer offered on the day of the breaking of the fast.",
      "chain": [
        "30175",
        "20288",
        "20658",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "1152",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو توبة الربيع بن نافع، حدثنا سليمان، - يعني ابن حيان - عن أبي يعلى الطائفي، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم كان يكبر في الفطر في الأولى سبعا ثم يقرأ ثم يكبر ثم يقوم فيكبر أربعا ثم يقرأ ثم يركع ‏.‏ قال أبو داود رواه وكيع وابن المبارك قالا سبعا وخمسا ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) used to say on the day of the breaking of the fast seven takbirs in the first rak'ah and then recite the Qur'an, and utter the takbir (Allah is most great). Then he would stand, and utter the takbir four times. Thereafter he would recite the Qur'an and bow.Abu Dawud said: This has been narrated by Waki' and Ibn al-Mubarak. Their version goes: \"Seven (in the first rak'ah) and five (in the second).\"",
      "chain": [
        "30335",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1176",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن يحيى بن سعيد، عن عمرو بن شعيب، أن رسول الله صلى الله عليه وسلم كان يقول ح وحدثنا سهل بن صالح حدثنا علي بن قادم أخبرنا سفيان عن يحيى بن سعيد عن عمرو بن شعيب عن أبيه عن جده قال كان رسول الله صلى الله عليه وسلم إذا استسقى قال ‏\"‏ اللهم اسق عبادك وبهائمك وانشر رحمتك وأحى بلدك الميت ‏\"‏ ‏.‏ هذا لفظ حديث مالك ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, quoted his grandfather as saying: When the Messenger of Allah (ﷺ) prayed for rain, he said: O Allah! Provide water for Your servants and Your cattle, display Your mercy and give life to Your dead land.This is the wording of Malik.",
      "chain": [
        "20164",
        "20001",
        "11062",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "1563",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو كامل، وحميد بن مسعدة، - المعنى - أن خالد بن الحارث، حدثهم حدثنا حسين، عن عمرو بن شعيب، عن أبيه، عن جده، أن امرأة، أتت رسول الله صلى الله عليه وسلم ومعها ابنة لها وفي يد ابنتها مسكتان غليظتان من ذهب فقال لها ‏\"‏ أتعطين زكاة هذا ‏\"‏ ‏.‏ قالت لا ‏.‏ قال ‏\"‏ أيسرك أن يسورك الله بهما يوم القيامة سوارين من نار ‏\"‏ ‏.‏ قال فخلعتهما فألقتهما إلى النبي صلى الله عليه وسلم وقالت هما لله عز وجل ولرسوله ‏.‏",
      "text_en": " 'Amr bin Shu'aib on his father's authority said that his grandfather reported:                     A woman came to the Messenger of Allah (ﷺ) and she was accompanied by her daughter who wore two heavy gold bangles in her hands. He said to her: Do you pay zakat on them? She said: No. He then said: Are you pleased that Allah may put two bangles of fire on your hands? Thereupon she took them off and placed them before the Prophet (ﷺ) saying: They are for Allah and His Apostle.",
      "chain": [
        "30559",
        "30430",
        "20226",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1591",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ابن أبي عدي، عن ابن إسحاق، عن عمرو بن شعيب، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا جلب ولا جنب ولا تؤخذ صدقاتهم إلا في دورهم ‏\"‏ ‏.‏",
      "text_en": " 'Amr bin Shu'aib, on his father's authority, said that his grandfather reported the Prophet (ﷺ) as saying:                      There is to be no collecting of sadaqah (zakat) from a distance, nor must people who own property remove it far away, and their sadaqahs are to be received in their dwelling.",
      "chain": [
        "30367",
        "20276",
        "11107",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1600",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن أبي شعيب الحراني، حدثنا موسى بن أعين، عن عمرو بن الحارث المصري، عن عمرو بن شعيب، عن أبيه، عن جده، قال جاء هلال - أحد بني متعان - إلى رسول الله صلى الله عليه وسلم بعشور نحل له وكان سأله أن يحمي له واديا يقال له سلبة فحمى له رسول الله صلى الله عليه وسلم ذلك الوادي فلما ولي عمر بن الخطاب - رضى الله عنه - كتب سفيان بن وهب إلى عمر بن الخطاب يسأله عن ذلك فكتب عمر رضى الله عنه إن أدى إليك ما كان يؤدي إلى رسول الله صلى الله عليه وسلم من عشور نحله له فاحم له سلبة وإلا فإنما هو ذباب غيث يأكله من يشاء ‏.‏",
      "text_en": " 'Amr bin Shu'aib, on his father's authority, said that his grandfather reported:                      Hilal, a man from the tribe of Banu Mat'an brought a tenth of honey which he possessed in beehives to the Messenger of Allah (ﷺ). He asked him (the apostle of Allah) to give the wood known as Salabah as a protected (or restricted) land. The Messenger of Allah (ﷺ) gave him that wood as a protected land. When Umar ibn al-Khattab succeeded, Sufyan ibn Wahb wrote to Umar asking him about this wood. Umar ibn al-Khattab wrote to him: If he (Hilal) pays you the tithe on honey what he used to pay to the Messenger of Allah (ﷺ), leave the protected land of Salabah in his possession; otherwise those bees are like those of any wood; anyone can take the honey as he likes.",
      "chain": [
        "30301",
        "20465",
        "20377",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1601",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا المغيرة، - ونسبه إلى عبد الرحمن بن الحارث المخزومي - قال حدثني أبي، عن عمرو بن شعيب، عن أبيه، عن جده، أن شبابة، - بطن من فهم - فذكر نحوه قال من كل عشر قرب قربة وقال سفيان بن عبد الله الثقفي قال وكان يحمي لهم واديين زاد فأدوا إليه ما كانوا يؤدون إلى رسول الله صلى الله عليه وسلم وحمى لهم وادييهم ‏.‏",
      "text_en": " 'Amr bin Shu'aib, on his father's authority, said that his grandfather reported:                      That was Banu Shababah, a sub-clan of the tribe Fahm. The narrator then transmitted the tradition something similar. He added:(They used to pay) one bag (of honey) out of ten bags. Sufyan ibn Abdullah ath-Thaqafi gave them two woods as protected lands. They used to give as much honey (as zakat) as they gave to the Messenger of Allah (ﷺ). He (Sufyan) used to protect their woods.",
      "chain": [
        "30423",
        "19934",
        "19911",
        "5066"
      ]
    },
    {
      "hadith_no": "1602",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا الربيع بن سليمان المؤذن، حدثنا ابن وهب، أخبرني أسامة بن زيد، عن عمرو بن شعيب، عن أبيه، عن جده، أن بطنا، من فهم بمعنى المغيرة قال من عشر قرب قربة ‏.‏ وقال واديين لهم ‏.‏",
      "text_en": " ‘Amr bin Shu’aib said on the authority of his father that his grandfather reported a sub clan of Fahm. He then narrated the tradition like that of the narrator Al Mughirah. This version has “(They used to give) sadaqah out of ten bags (of honey).” He also added “Two woods of theirs”.",
      "chain": [
        "30583",
        "20029",
        "50",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1708",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Lost and Found Items - كتاب اللقطة",
      "chapter_no": "10",
      "text_ar": "حدثنا موسى بن إسماعيل، عن حماد بن سلمة، عن يحيى بن سعيد، وربيعة، بإسناد قتيبة ومعناه وزاد فيه ‏\"‏ فإن جاء باغيها فعرف عفاصها وعددها فادفعها إليه ‏\"‏ ‏.‏ وقال حماد أيضا عن عبيد الله بن عمر عن عمرو بن شعيب عن أبيه عن جده عن النبي صلى الله عليه وسلم مثله ‏.‏ قال أبو داود وهذه الزيادة التي زاد حماد بن سلمة في حديث سلمة بن كهيل ويحيى بن سعيد وعبيد الله بن عمر وربيعة ‏\"‏ إن جاء صاحبها فعرف عفاصها ووكاءها فادفعها إليه ‏\"‏ ‏.‏ ليست بمحفوظة ‏\"‏ فعرف عفاصها ووكاءها ‏\"‏ ‏.‏ وحديث عقبة بن سويد عن أبيه عن النبي صلى الله عليه وسلم أيضا قال ‏\"‏ عرفها سنة ‏\"‏ ‏.‏ وحديث عمر بن الخطاب أيضا عن النبي صلى الله عليه وسلم قال ‏\"‏ عرفها سنة ‏\"‏ ‏.‏",
      "text_en": " The above mentioned tradition has also been transmitted by Yahya bin Sa’id and Rabi’ah through the chain of narrators mentioned by Qutaibah to the same effect.  This version adds; if its seeker comes, and recognizes its container and its number, then give it to him.  Hammad also narrated it from `Ubaid Allah bin `Umar from `Amr bin Shu’aib, from his father, from his grandfather, from the Prophet (SWAS) something similar.  Abu Dawud said :                      This addition made by Hammad bin Salamah bin Kuhail, Yahya bin Sa’id, `Ubaid Allah bin `Umar and Rabi’ah; “if its owner comes and recognizes its container, and its string,” is not guarded.  The version narrated by Uqbah bin Suwaid on the authority of his father from the Prophet (SWAS) has also the words : “make it known for a year”.  The version of `Umar bin al-Khattab has also been transmitted from the Prophet (SWAS).  This version has : “Make it known for a year”.",
      "chain": [
        "20040",
        "20021",
        "11062",
        "20022",
        "11201",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1710",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Lost and Found Items - كتاب اللقطة",
      "chapter_no": "10",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن ابن عجلان، عن عمرو بن شعيب، عن أبيه، عن جده عبد الله بن عمرو بن العاص، عن رسول الله صلى الله عليه وسلم أنه سئل عن الثمر المعلق فقال ‏\"‏ من أصاب بفيه من ذي حاجة غير متخذ خبنة فلا شىء عليه ومن خرج بشىء منه فعليه غرامة مثليه والعقوبة ومن سرق منه شيئا بعد أن يئويه الجرين فبلغ ثمن المجن فعليه القطع ‏\"‏ ‏.‏ وذكر في ضالة الإبل والغنم كما ذكره غيره قال وسئل عن اللقطة فقال ‏\"‏ ما كان منها في طريق الميتاء أو القرية الجامعة فعرفها سنة فإن جاء طالبها فادفعها إليه وإن لم يأت فهي لك وما كان في الخراب - يعني - ففيها وفي الركاز الخمس ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Messenger of Allah (ﷺ) was asked about the hanging fruit. He replied: If a needy person takes some and does not take a supply away in his garment, he is not to be blamed, but he who carries any of it away is to be find twice the value and punished, and he who steals any of it after it has been put in the place where dates are dried is to have his hand cut off if its value reaches the price of a shield. Regarding stray camels and sheep he mentioned the same as others have done. He said: He was asked about finds and replied: If it is in a frequented road and a large town, make the matter known for a year, and if its owner comes, give it to him, but if he does not, it belongs to you. If it is in a place which has been a waste from ancient time, or if it is a hidden treasure (belonging to the Islamic period), it is subject to the payment of the fifth.",
      "chain": [
        "30367",
        "20023",
        "10616",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "1713",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Lost and Found Items - كتاب اللقطة",
      "chapter_no": "10",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، ح وحدثنا ابن العلاء، حدثنا ابن إدريس، عن ابن إسحاق، عن عمرو بن شعيب، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم بهذا ‏.‏ قال في ضالة الشاء ‏\"‏ فاجمعها حتى يأتيها باغيها ‏\"‏ ‏.‏",
      "text_en": " The above mentioned tradition has also been narrated by ‘Amr bin Shu’aib from his father, from his grandfather, from the Prophet (SWAS) to the same effect. This version has:                      regarding the stray sheep he said: Take it (and keep it with you) till its seeker comes to it.",
      "chain": [
        "20040",
        "20022",
        "20102",
        "11107",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1899",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا مسدد، حدثنا عيسى بن يونس، حدثنا المثنى بن الصباح، عن عمرو بن شعيب، عن أبيه، قال طفت مع عبد الله فلما جئنا دبر الكعبة قلت ألا تتعوذ ‏.‏ قال نعوذ بالله من النار ‏.‏ ثم مضى حتى استلم الحجر وأقام بين الركن والباب فوضع صدره ووجهه وذراعيه وكفيه هكذا وبسطهما بسطا ثم قال هكذا رأيت رسول الله صلى الله عليه وسلم يفعله ‏.‏",
      "text_en": " Amr b. Shu'aib reported on the authority of his father:                      I went round the Ka'bah along with Abdullah ibn Amr. When we came behind the Ka'bah I asked: Do you not seek refuge? He uttered the words: I seek refuge in Allah from the Hell-fire. He then went (farther) and touched the Black Stone, and stood between the corner (Black Stone) and the entrance of the Ka'bah. He then placed his breast, his face, his hands and his palms in this manner, and he spread them, and said: I saw the apostle of Allah (ﷺ) doing like this.",
      "chain": [
        "30175",
        "20347",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2051",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا إبراهيم بن محمد التيمي، حدثنا يحيى، عن عبيد الله بن الأخنس، عن عمرو بن شعيب، عن أبيه، عن جده، أن مرثد بن أبي مرثد الغنوي، كان يحمل الأسارى بمكة وكان بمكة بغي يقال لها عناق وكانت صديقته قال جئت إلى النبي صلى الله عليه وسلم فقلت يا رسول الله أنكح عناق قال فسكت عني فنزلت ‏{‏ والزانية لا ينكحها إلا زان أو مشرك ‏}‏ فدعاني فقرأها على وقال ‏\"‏ لا تنكحها ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     Marthad ibn AbuMarthad al-Ghanawi used to take prisoners (of war) from Mecca (to Medina). At Mecca there was a prostitute called Inaq who had illicit relations with him. (Marthad said:) I came to the Prophet (ﷺ) and said to him: May I marry Inaq, Messenger of Allah? The narrator said: He kept silence towards me. Then the verse was revealed:\"....and the adulteress none shall marry save and adulterer or an idolater.\" He called me and recited this (verse) to me, and said: Do not marry her.",
      "chain": [
        "30020",
        "20444",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2129",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن معمر، حدثنا محمد بن بكر البرساني، أخبرنا ابن جريج، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما امرأة نكحت على صداق أو حباء أو عدة قبل عصمة النكاح فهو لها وما كان بعد عصمة النكاح فهو لمن أعطيه وأحق ما أكرم عليه الرجل ابنته أو أخته ‏\"‏ ‏.‏",
      "text_en": " 'Amr b. Shu'aib on his father's authority said that his grandfather reported  The Messenger of Allah (ﷺ) said:                      A woman who marries on a dower or a reward or a promise before the solemnisation of marriage is entitled to it; and whatever is fixed for her after solemnisation of marriage belongs to whom it is given. A man is more entitled to receive a thing given as a gift on account of his daughter or sister (than other kinds of gifts).",
      "chain": [
        "30172",
        "20277",
        "11070",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2160",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وعبد الله بن سعيد، قالا حدثنا أبو خالد، - يعني سليمان بن حيان - عن ابن عجلان، عن عمرو بن شعيب، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا تزوج أحدكم امرأة أو اشترى خادما فليقل اللهم إني أسألك خيرها وخير ما جبلتها عليه وأعوذ بك من شرها ومن شر ما جبلتها عليه وإذا اشترى بعيرا فليأخذ بذروة سنامه وليقل مثل ذلك ‏\"‏ ‏.‏ قال أبو داود زاد أبو سعيد ‏\"‏ ثم ليأخذ بناصيتها وليدع بالبركة ‏\"‏ ‏.‏ في المرأة والخادم ‏.‏",
      "text_en": " 'Amr b. Shu'aib on his father's authority said that his grandfather (Abdullah ibn Amr ibn al-'As) reported the Prophet (ﷺ)  said:                      If one of you marries a woman or buys a slave, he should say: \"O Allah, I ask You for the good in her, and in the disposition You have given her; I take refuge in You from the evil in her, and in the disposition You have given her.\" When he buys a camel, he should take hold of the top of its hump and say the same kind of thing.Abu Dawud said: Abu Sa'id added the following words in his version: He should then tale hold of her forelock and pray for blessing in the case of a woman or a slave.",
      "chain": [
        "30203",
        "11184",
        "10616",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2190",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا هشام، ح وحدثنا ابن الصباح، حدثنا عبد العزيز بن عبد الصمد، قالا حدثنا مطر الوراق، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال ‏\"‏ لا طلاق إلا فيما تملك ولا عتق إلا فيما تملك ولا بيع إلا فيما تملك ‏\"‏ ‏.‏ زاد ابن الصباح ‏\"‏ ولا وفاء نذر إلا فيما تملك ‏\"‏ ‏.‏",
      "text_en": " 'Amr b. Shu'aib on his father's authority said that his grandfather (Abdullah ibn Amr ibn al-'As):                      The Prophet (ﷺ) said: There is no divorce except in what you possess; there is no possession, there is no sale transaction till you possess. The narrator Ibn as-Sabbah added: There is no fulfilling a vow till you possess.",
      "chain": [
        "20285",
        "20295",
        "20251",
        "10719",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2192",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا ابن السرح، حدثنا ابن وهب، عن يحيى بن عبد الله بن سالم، عن عبد الرحمن بن الحارث المخزومي، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال في هذا الخبر زاد ‏\"‏ ولا نذر إلا فيما ابتغي به وجه الله تعالى ذكره ‏\"‏ ‏.‏",
      "text_en": " The above tradition has also been transmitted by ‘Amr bin Shu’aib through a different chain of narrators. This version adds The Prophet (ﷺ) said “There is no vow except in an act which seeks the pleasure of Allah, the Exalted.",
      "chain": [
        "30485",
        "20029",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2265",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا محمد بن راشد، ح وحدثنا الحسن بن علي، حدثنا يزيد بن هارون، أخبرنا محمد بن راشد، - وهو أشبع - عن سليمان بن موسى، عن عمرو بن شعيب، عن أبيه، عن جده، قال إن النبي صلى الله عليه وسلم قضى أن كل مستلحق استلحق بعد أبيه الذي يدعى له ادعاه ورثته فقضى أن كل من كان من أمة يملكها يوم أصابها فقد لحق بمن استلحقه وليس له مما قسم قبله من الميراث شىء وما أدرك من ميراث لم يقسم فله نصيبه ولا يلحق إذا كان أبوه الذي يدعى له أنكره وإن كان من أمة لم يملكها أو من حرة عاهر بها فإنه لا يلحق به ولا يرث وإن كان الذي يدعى له هو ادعاه فهو ولد زنية من حرة كان أو أمة ‏.‏",
      "text_en": " 'Amr b. Shu'aib on his father's authority said that his grandfather reported:                      The Prophet (ﷺ) decided regarding one who was treated as a member of a family after the death of his father, to whom he was attributed when the heirs said he was one of them, that if he was the child of a slave-woman whom the father owned when he had intercourse with her, he was included among those who sought his inclusion, but received none of the inheritance which was previously divided; he, however, received his portion of the inheritance which had not already been divided; but if the father to whom he was attributed had disowned him, he was not joined to the heirs. If he was a child of a slave-woman whom the father did not possess or of a free woman with whom he had illicit intercourse, he was not joined to the heirs and did not inherit even if the one to whom he was attributed is the one who claimed paternity, since he was a child of fornication whether his mother was free or a slave.",
      "chain": [
        "20656",
        "20719",
        "30",
        "20472",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2274",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا زهير بن حرب، حدثنا يزيد بن هارون، أخبرنا حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، قال قام رجل فقال يا رسول الله إن فلانا ابني عاهرت بأمه في الجاهلية فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا دعوة في الإسلام ذهب أمر الجاهلية الولد للفراش وللعاهر الحجر ‏\"‏ ‏.‏",
      "text_en": " 'Amr b. Shu'aib on his father's authority said that his grandfather reported:                      A man got up and said: Messenger of Allah, so-and-so is my son; I had illicit intercourse with his mother in the pre-Islamic period. The Messenger of Allah (ﷺ) said: There is no unlawful claiming of paternity in Islam. What was done in pre-Islamic times has been annulled. The child is attributed to the one on whose bed it is born, and the fornicator is deprived of any right.",
      "chain": [
        "30022",
        "20472",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2276",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا محمود بن خالد السلمي، حدثنا الوليد، عن أبي عمرو، - يعني الأوزاعي - حدثني عمرو بن شعيب، عن أبيه، عن جده عبد الله بن عمرو، أن امرأة، قالت يا رسول الله إن ابني هذا كان بطني له وعاء وثديي له سقاء وحجري له حواء وإن أباه طلقني وأراد أن ينتزعه مني فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ أنت أحق به ما لم تنكحي ‏\"‏ ‏.‏ ‏.‏",
      "text_en": " 'Amr b. Shu'aib on his father's authority said that his grandfather (Abdullah ibn Amr ibn al-'As) reported:                      A woman said: Messenger of Allah, my womb is a vessel to this son of mine, my breasts, a water-skin for him, and my lap a guard for him, yet his father has divorced me, and wants to take him away from me. The Messenger of Allah (ﷺ) said: You have more right to him as long as you do not marry.",
      "chain": [
        "37534",
        "20733",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "2607",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الله بن مسلمة القعنبي، عن مالك، عن عبد الرحمن بن حرملة، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الراكب شيطان والراكبان شيطانان والثلاثة ركب ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Messenger of Allah (ﷺ)  said: A single rider is a devil, and a pair of riders are a pair of devils, but three are a company of riders.",
      "chain": [
        "20164",
        "20001",
        "11878",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2694",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا حماد، عن محمد بن إسحاق، عن عمرو بن شعيب، عن أبيه، عن جده، في هذه القصة قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ ردوا عليهم نساءهم وأبناءهم فمن مسك بشىء من هذا الفىء فإن له به علينا ست فرائض من أول شىء يفيئه الله علينا ‏\"‏ ‏.‏ ثم دنا - يعني النبي صلى الله عليه وسلم - من بعير فأخذ وبرة من سنامه ثم قال ‏\"‏ يا أيها الناس إنه ليس لي من الفىء شىء ولا هذا ‏\"‏ ‏.‏ ورفع أصبعيه ‏\"‏ إلا الخمس والخمس مردود عليكم فأدوا الخياط والمخيط ‏\"‏ ‏.‏ فقام رجل في يده كبة من شعر فقال أخذت هذه لأصلح بها برذعة لي فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما ما كان لي ولبني عبد المطلب فهو لك ‏\"‏ ‏.‏ فقال أما إذ بلغت ما أرى فلا أرب لي فيها ‏.‏ ونبذها ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Messenger of Allah (ﷺ) then said: Return to them (Hawazin) their women and their sons. If any of you withholds anything from this booty, we have six camels for him from the first booty which Allah gives us. The Prophet (ﷺ) then approached a camel, and taking a hair from its hump said: O people, I get nothing of this booty, not even this (meanwhile raising his two fingers) but the fifth, and the fifth is returned to you, so hand over threads and needles. A man got up with a ball of hair in his hand and said: I took this to repair the cloth under a pack-saddle. The Messenger of Allah (ﷺ) said: You can have what belongs to me and to the Banu al-Muttalib. He said: If it produces the result that I now realise, I have no desire for it.",
      "chain": [
        "20040",
        "20022",
        "11107",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2715",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن عوف، قال حدثنا موسى بن أيوب، قال حدثنا الوليد بن مسلم، قال حدثنا زهير بن محمد، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم وأبا بكر وعمر حرقوا متاع الغال وضربوه ‏.‏ قال أبو داود وزاد فيه علي بن بحر عن الوليد - ولم أسمعه منه - ومنعوه سهمه ‏.‏ قال أبو داود وحدثنا به الوليد بن عتبة وعبد الوهاب بن نجدة قالا حدثنا الوليد عن زهير بن محمد عن عمرو بن شعيب قوله ولم يذكر عبد الوهاب بن نجدة الحوطي منع سهمه ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Messenger of Allah (ﷺ), AbuBakr and Umar burned the belongings of anyone who had been dishonest about booty and beat him.Abu Dawud said: 'Ali b. Bahr added on the authority of al-Walid, and I did not hear (a tradition) from him: And they denied him his share.\"Abu Dawud said: This tradition has also been transmitted by al-Walid b. 'Utbah from 'Abd al-Wahhab b. Najdah; They said: This has been transmitted by al-Walid, from Zuhair b. Muhammad, from 'Amr b. Shu'aib. 'Abd al-Wahhab b. Najdah al-Huti did not mention the words \"He denied him his share\" (as narrated by 'Ali b. Bahr from al-Walid).",
      "chain": [
        "38566",
        "20733",
        "20394",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2751",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ابن أبي عدي، عن ابن إسحاق، - هو محمد - ببعض هذا ح وحدثنا عبيد الله بن عمر بن ميسرة، حدثني هشيم، عن يحيى بن سعيد، جميعا عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ المسلمون تتكافأ دماؤهم يسعى بذمتهم أدناهم ويجير عليهم أقصاهم وهم يد على من سواهم يرد مشدهم على مضعفهم ومتسرعهم على قاعدهم لا يقتل مؤمن بكافر ولا ذو عهد في عهده ‏\"‏ ‏.‏ ولم يذكر ابن إسحاق القود والتكافؤ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Messenger of Allah (ﷺ)  said: Muslims are equal in respect of blood. The lowest of them is entitled to give protection on behalf of them, and the one residing far away may give protection on behalf of them. They are like one hand over against all those who are outside the community. Those who have quick mounts should return to those who have slow mounts, and those who got out along with a detachment (should return) to those who are stationed. A believer shall not be killed for an unbeliever, nor a confederate within the term of confederation with him.Ibn Ishaq did not mention retaliation and equality in respect of blood.",
      "chain": [
        "30367",
        "20276",
        "30024",
        "20468",
        "11062",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2857",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Game (Kitab Al-Said) - كتاب الصيد",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن المنهال الضرير، حدثنا يزيد بن زريع، حدثنا حبيب المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، أن أعرابيا، يقال له أبو ثعلبة قال يا رسول الله إن لي كلابا مكلبة فأفتني في صيدها ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن كان لك كلاب مكلبة فكل مما أمسكن عليك ‏\"‏ ‏.‏ قال ذكيا أو غير ذكي قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال فإن أكل منه قال ‏\"‏ وإن أكل منه ‏\"‏ ‏.‏ فقال يا رسول الله أفتني في قوسي ‏.‏ قال ‏\"‏ كل ما ردت عليك قوسك ‏\"‏ ‏.‏ قال ‏\"‏ ذكيا أو غير ذكي ‏\"‏ ‏.‏ قال وإن تغيب عني قال ‏\"‏ وإن تغيب عنك ما لم يصل أو تجد فيه أثرا غير سهمك ‏\"‏ ‏.‏ قال أفتني في آنية المجوس إن اضطررنا إليها ‏.‏ قال ‏\"‏ اغسلها وكل فيها ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     There was a bedouin called AbuTha'labah. He said: Messenger of Allah, I have trained dogs, so tell me your opinion about (eating) the animal they hunt. The Prophet (ﷺ) said: If you have trained dogs, then eat what they catch for you. He asked: Whether it is slaughtered or not? He replied: Yes. He asked: Does it apply even if it eats any of it? He replied: Even if it eats any of it. He again asked: Messenger of Allah, tell me your opinion about my bow (i.e. the game hunted by arrow). He said: Eat what your bow returns to you, whether it is slaughtered or not. He asked: If it goes out of my sight? He replied: Even if it goes out of your sight, provided it has no stench, or you find a mark on it other than the mark of your arrow. He asked: Tell me about the use of the vessels of the Magians when we are forced to use them. He replied: Wash them and eat in them.",
      "chain": [
        "30173",
        "20304",
        "11276",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2872",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wills (Kitab Al-Wasaya) - كتاب الوصايا",
      "chapter_no": "18",
      "text_ar": "حدثنا حميد بن مسعدة، أن خالد بن الحارث، حدثهم حدثنا حسين، - يعني المعلم - عن عمرو بن شعيب، عن أبيه، عن جده، أن رجلا، أتى النبي صلى الله عليه وسلم فقال إني فقير ليس لي شىء ولي يتيم ‏.‏ قال فقال ‏\"‏ كل من مال يتيمك غير مسرف ولا مبادر ولا متأثل ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather told that a man came to the Prophet (ﷺ) and said: I am poor, I have nothing (with me), and I have an orphan. He said: Use the property of your orphan without spending it lavishly, hurrying and taking it as your own property.",
      "chain": [
        "30430",
        "20226",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2883",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wills (Kitab Al-Wasaya) - كتاب الوصايا",
      "chapter_no": "18",
      "text_ar": "حدثنا العباس بن الوليد بن مزيد، أخبرني أبي، حدثنا الأوزاعي، حدثني حسان بن عطية، عن عمرو بن شعيب، عن أبيه، عن جده، أن العاص بن وائل، أوصى أن يعتق، عنه مائة رقبة فأعتق ابنه هشام خمسين رقبة فأراد ابنه عمرو أن يعتق عنه الخمسين الباقية فقال حتى أسأل رسول الله صلى الله عليه وسلم فأتى النبي صلى الله عليه وسلم فقال يا رسول الله إن أبي أوصى بعتق مائة رقبة وإن هشاما أعتق عنه خمسين وبقيت عليه خمسون رقبة أفأعتق عنه فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنه لو كان مسلما فأعتقتم عنه أو تصدقتم عنه أو حججتم عنه بلغه ذلك ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather told that Al-'As ibn Wa'il left his will that a hundred slaves should be emancipated on his behalf. His son Hisham emancipated fifty slaves and his son Amr intended to emancipate the remaining fifty on his behalf, but he said: I should ask first the Messenger of Allah (ﷺ). He, therefore, came to the Prophet (ﷺ) and said: Messenger of Allah, my father left in his will that a hundred slaves should be emancipated on his behalf and Hisham has emancipated fifty on his behalf and fifty remain. Shall I emancipate them on his behalf? The Messenger of Allah (ﷺ) said: Had he been a Muslim and you had emancipated slaves on his behalf, or given sadaqah on his behalf, or performed the pilgrimage, that would have reached him.",
      "chain": [
        "20024",
        "11413",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2908",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا موسى بن عامر، حدثنا الوليد، أخبرني عيسى أبو محمد، عن العلاء بن الحارث، عن عمرو بن شعيب، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " Narrated 'Amr bin Shu'aib:                     On his father's authority, said that his grandfather reported from the Prophet (ﷺ) something similar.",
      "chain": [
        "20733",
        "10884",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2911",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن حبيب المعلم، عن عمرو بن شعيب، عن أبيه، عن جده عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يتوارث أهل ملتين شتى ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: people of two different religions would not inherit from one another.",
      "chain": [
        "20040",
        "20022",
        "11276",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "2917",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا عبد الله بن عمرو بن أبي الحجاج أبو معمر، حدثنا عبد الوارث، عن حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، أن رئاب بن حذيفة، تزوج امرأة فولدت له ثلاثة غلمة فماتت أمهم فورثوها رباعها وولاء مواليها وكان عمرو بن العاص عصبة بنيها فأخرجهم إلى الشام فماتوا فقدم عمرو بن العاص ومات مولى لها وترك مالا له فخاصمه إخوتها إلى عمر بن الخطاب فقال عمر قال رسول الله صلى الله عليه وسلم ‏\"‏ ما أحرز الولد أو الوالد فهو لعصبته من كان ‏\"‏ ‏.‏ قال فكتب له كتابا فيه شهادة عبد الرحمن بن عوف وزيد بن ثابت ورجل آخر فلما استخلف عبد الملك اختصموا إلى هشام بن إسماعيل أو إلى إسماعيل بن هشام فرفعهم إلى عبد الملك فقال هذا من القضاء الذي ما كنت أراه ‏.‏ قال فقضى لنا بكتاب عمر بن الخطاب فنحن فيه إلى الساعة ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather reported: Rabab ibn Hudhayfah married a woman and three sons were born to him from her. Their mother then died. They inherited her houses and had the right of inheritance of her freed slaves. Amr ibn al-'As was the agnate of her sons. He sent them to Syria where they died. Amr ibn al-'As then came. A freed slave of hers died and left some property. Her brothers disputed with him and brought the case to Umar ibn al-Khattab.  Umar reported the Messenger of Allah (ﷺ) as saying: Whatever property a son or a father receives as an heir will go to his agnates, whoever they may be. He then wrote a document for him, witnessed by AbdurRahman ibn Awf, Zayd ibn Thabit and one other person. When AbdulMalik became caliph, they presented the case to Hisham ibn Isma'il or Isma'il ibn Hisham (the narrator is doubtful).  He sent them to 'Abd al-Malik who said: This is the decision which I have already seen.  The narrator said: So he ('Abd al-Malik) made the decision on the basis of the document of Umar ibn al-Khattab, and that is still with us till this moment.",
      "chain": [
        "30350",
        "20258",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3273",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا المغيرة بن عبد الرحمن، حدثني أبي عبد الرحمن، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏:‏ ‏\"‏ لا نذر إلا فيما يبتغى به وجه الله، ولا يمين في قطيعة رحم ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Messenger of Allah (ﷺ) said: A vow is binding in those things by which the pleasure of Allah is sought, and an oath to break ties of relationship is not binding.",
      "chain": [
        "30423",
        "20182",
        "11359",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3274",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا المنذر بن الوليد، حدثنا عبد الله بن بكر، حدثنا عبيد الله بن الأخنس، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ لا نذر ولا يمين فيما لا يملك ابن آدم ولا في معصية الله ولا في قطيعة رحم، ومن حلف على يمين فرأى غيرها خيرا منها فليدعها وليأت الذي هو خير، فإن تركها كفارتها ‏\"‏ ‏.‏ قال أبو داود ‏:‏ الأحاديث كلها عن النبي صلى الله عليه وسلم ‏:‏ ‏\"‏ وليكفر عن يمينه ‏\"‏ ‏.‏ إلا فيما لا يعبأ به ‏.‏ قال أبو داود قلت لأحمد ‏:‏ روى يحيى بن سعيد عن يحيى بن عبيد الله فقال ‏:‏ تركه بعد ذلك وكان أهلا لذلك، قال أحمد ‏:‏ أحاديثه مناكير وأبوه لا يعرف ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Messenger of Allah (ﷺ)  said: An oath or a vow about something over which a human being has no control, and to disobey Allah, and to break ties of relationship is not binding. If anyone takes an oath and then considers something else better than it, he should give it up, and do what is better, for leaving it is its atonement.Abu Dawud said: All sound traditions from the Prophet (ﷺ) say: \"He should make atonement for his oath,\" except those versions which are not reliable.Abu Dawud said: I said to Ahmad: Yahya b. Sa'id (al-Qattan) has transmitted this tradition from Yahya b. 'Ubaid Allah. He (Ahmad b. Hanbal) said: But he gave it up after that, and he was competent for doing it. Ahmad said: His (Yahya b. 'Ubaid Allah's) tradition are munkar (rejected) and his father is not known.",
      "chain": [
        "20244",
        "20444",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3312",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا مسدد، حدثنا الحارث بن عبيد أبو قدامة، عن عبيد الله بن الأخنس، عن عمرو بن شعيب، عن أبيه، عن جده، ‏:‏ أن امرأة، أتت النبي صلى الله عليه وسلم فقالت ‏:‏ يا رسول الله إني نذرت أن أضرب على رأسك بالدف ‏.‏ قال ‏:‏ ‏\"‏ أوفي بنذرك ‏\"‏ ‏.‏ قالت ‏:‏ إني نذرت أن أذبح بمكان كذا وكذا، مكان كان يذبح فيه أهل الجاهلية ‏.‏ قال ‏:‏ ‏\"‏ لصنم ‏\"‏ ‏.‏ قالت ‏:‏ لا ‏.‏ قال ‏:‏ ‏\"‏ لوثن ‏\"‏ ‏.‏ قالت ‏:‏ لا ‏.‏ قال ‏:‏ ‏\"‏ أوفي بنذرك ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather said: A woman came to the Prophet (ﷺ) and said: Messenger of Allah, I have taken a vow to play the tambourine over you. He said: Fulfil your vow. She said: And I have taken a vow to perform a sacrifice in such a such a place, a place in which people had performed sacrifices  in pre-Islamic times. He asked: For an Idol? She replied: No. He asked: For an image? She replied: No. He said: Fulfil your vow.",
      "chain": [
        "30175",
        "20533",
        "20444",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3456",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن ابن عجلان، عن عمرو بن شعيب، عن أبيه، عن عبد الله بن عمرو بن العاص، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ المتبايعان بالخيار ما لم يفترقا إلا أن تكون صفقة خيار ولا يحل له أن يفارق صاحبه خشية أن يستقيله ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: Both parties in a business transaction have a right to annul it so long as they have not separated unless it is a bargain with the option to annul is attached to it; and it is not permissible for one of them to separate from the other for fear that one may demand that the bargain be rescinded.",
      "chain": [
        "30367",
        "20023",
        "10616",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "3502",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن مسلمة، قال قرأت على مالك بن أنس أنه بلغه عن عمرو بن شعيب، عن أبيه، عن جده، أنه قال نهى رسول الله صلى الله عليه وسلم عن بيع العربان ‏.‏ قال مالك وذلك - فيما نرى والله أعلم - أن يشتري الرجل العبد أو يتكارى الدابة ثم يقول أعطيك دينارا على أني إن تركت السلعة أو الكراء فما أعطيتك لك ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather told that the Messenger of Allah (ﷺ) forbade the type of transactions in which earnest money was paid. Malik said: This means, as we think--Allah better knows-that a man buys a slave or hires an animal, and he says: I give you a dinar on condition that if I give up the transaction or hire, what I gave you is yours.",
      "chain": [
        "20164",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3504",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا زهير بن حرب، حدثنا إسماعيل، عن أيوب، حدثني عمرو بن شعيب، حدثني أبي، عن أبيه، عن أبيه، حتى ذكر عبد الله بن عمرو قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يحل سلف وبيع ولا شرطان في بيع ولا ربح ما لم تضمن ولا بيع ما ليس عندك ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather 'Abd Allah b. 'Amr reported the Messenger of Allah (ﷺ) as saying: The proviso of a loan combined with a sale is not allowable, nor two conditions relating to one transaction, nor profit arising from something which is not in one's charge, nor selling what is not in your possession.",
      "chain": [
        "30022",
        "20208",
        "11015",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "3530",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن المنهال، حدثنا يزيد بن زريع، حدثنا حبيب المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، أن رجلا، أتى النبي صلى الله عليه وسلم فقال يا رسول الله إن لي مالا وولدا وإن والدي يجتاح مالي ‏.‏ قال ‏\"‏ أنت ومالك لوالدك إن أولادكم من أطيب كسبكم فكلوا من كسب أولادكم ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     A man came to the Prophet (ﷺ) and said: Messenger of Allah, I have property and children, and my father finishes my property. He replied; You and your property belong to your father; your children come from the pleasantest of what you earn; so enjoy from the earning of your children.",
      "chain": [
        "30173",
        "20304",
        "11276",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3540",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، أخبرني أسامة بن زيد، أن عمرو بن شعيب، حدثه عن أبيه، عن عبد الله بن عمرو، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ مثل الذي يسترد ما وهب كمثل الكلب يقيء فيأكل قيئه فإذا استرد الواهب فليوقف فليعرف بما استرد ثم ليدفع إليه ما وهب ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: The similitude of the one who takes back what he gifted is like that of a dog which vomits and then it eats vomit. When a donor seeks to take back (his gift), it should be made known and he informed why he sought to take it back. Then whatever he donated should be returned to him.",
      "chain": [
        "30584",
        "20029",
        "50",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "3546",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن داود بن أبي هند، وحبيب المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يجوز لامرأة أمر في مالها إذا ملك زوجها عصمتها ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Amr bin Shu'aib:                     On his father's authority, said that his grandfather reported the Messenger of Allah (ﷺ) as saying: It is not permissible for a woman to present a gift from the property which she has in her possession when her husband owns her chastity.",
      "chain": [
        "20040",
        "20022",
        "11585",
        "11276",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3547",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو كامل، حدثنا خالد، - يعني ابن الحارث - حدثنا حسين، عن عمرو بن شعيب، أن أباه، أخبره عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يجوز لامرأة عطية إلا بإذن زوجها ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: It is not permissible for a woman to present a gift (from her husband's property) except with the permission of her husband.",
      "chain": [
        "30559",
        "20226",
        "11278",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "3600",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا حفص بن عمر، حدثنا محمد بن راشد، حدثنا سليمان بن موسى، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم رد شهادة الخائن والخائنة وذي الغمر على أخيه ورد شهادة القانع لأهل البيت وأجازها لغيرهم ‏.‏ قال أبو داود الغمر الحنة والشحناء والقانع الأجير التابع مثل الأجير الخاص ‏.‏",
      "text_en": " 'Amr bin Shu'aib on his father's authority told that his grandfather said:                      The Messenger of Allah (ﷺ) rejected the testimony of a deceitful man and woman, of one who harbours rancour against his brother, and he rejected the testimony of one who is dependent on a family, and he allowed his testimony for other.Abu Dawud said: Ghimr means malice and enimity ; qani (dependant), a subordinate servant like a special servant.",
      "chain": [
        "30329",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3639",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا المغيرة بن عبد الرحمن، حدثني أبي عبد الرحمن بن الحارث، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قضى في السيل المهزور أن يمسك حتى يبلغ الكعبين ثم يرسل الأعلى على الأسفل ‏.‏",
      "text_en": " 'Amr bin Shu'aib on his father's authority said that his grandfather told that the Messenger of Allah (ﷺ) decided regarding the stream al-Mahzur that its water should be held back till it reached the ankles, and that the upper waters should then be allowed to flow to the lower.",
      "chain": [
        "30423",
        "20182",
        "11359",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3811",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا سهل بن بكار، حدثنا وهيب، عن ابن طاوس، عن عمرو بن شعيب، عن أبيه، عن جده، قال نهى رسول الله صلى الله عليه وسلم يوم خيبر عن لحوم الحمر الأهلية وعن الجلالة عن ركوبها وأكل لحمها ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     On the day of Khaybar the Messenger of Allah (may pease be upon him) forbade (eating) the flesh of domestic asses, and the animal which feeds on filth: riding it and eating its flesh.",
      "chain": [
        "30138",
        "20299",
        "11433",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3893",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا حماد، عن محمد بن إسحاق، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم كان يعلمهم من الفزع كلمات ‏\"‏ أعوذ بكلمات الله التامة من غضبه وشر عباده ومن همزات الشياطين وأن يحضرون ‏\"‏ ‏.‏ وكان عبد الله بن عمرو يعلمهن من عقل من بنيه ومن لم يعقل كتبه فأعلقه عليه ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Messenger of Allah (ﷺ) sued to teach them the following words in the case of alarm: I seek refuge in Allah's perfect words from His anger, the evil of His servants, the evil suggestions of the devils and their presence. Abdullah ibn Amr used to teach them to those of his children who had reached puberty, and he wrote them down (on some material) and hung on the child who had not reached puberty.",
      "chain": [
        "20040",
        "20022",
        "11107",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3926",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا أبو بدر، حدثني أبو عتبة، إسماعيل بن عياش حدثني سليمان بن سليم، عن عمرو بن شعيب، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم قال ‏\"‏ المكاتب عبد ما بقي عليه من مكاتبته درهم ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Amr b. Shu'aib:                     on his father's authority, told that his grandfather reported the Prophet (ﷺ) said: A slave who has entered into an agreement to purchase his freedom is a slave as long as a dirham of the agreed price remains to be paid.",
      "chain": [
        "30524",
        "36577",
        "20730",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3927",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا محمد بن المثنى، حدثني عبد الصمد، حدثنا همام، حدثنا عباس الجريري، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال ‏\"‏ أيما عبد كاتب على مائة أوقية فأداها إلا عشرة أواق فهو عبد وأيما عبد كاتب على مائة دينار فأداها إلا عشرة دنانير فهو عبد ‏\"‏ ‏.‏ قال أبو داود ليس هو عباس الجريري قالوا هو وهم ولكنه هو شيخ آخر ‏.‏",
      "text_en": " Narrated 'Amr b. Shu'aib:                     On his father's authority, told that his grandfather reported the Prophet (ﷺ) said: If any slave entered into an agreement to buy his freedom for one hundred uqiyahs and he pays them all but ten, he remains a slave (until he pays the remaining ten); and if a slave entered into an agreement to purchase his freedom for one hundred dinars, and he pays them all but ten dinars, he remains a slave (until he pays the remaining ten).Abu Dawud said: This narrator 'Abbas al-Jariri is not the same person. They said: It is misunderstanding. He is some other narrator.",
      "chain": [
        "30170",
        "20250",
        "20297",
        "11292",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4066",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا مسدد، حدثنا عيسى بن يونس، حدثنا هشام بن الغاز، عن عمرو بن شعيب، عن أبيه، عن جده، قال هبطنا مع رسول الله صلى الله عليه وسلم من ثنية فالتفت إلى وعلى ريطة مضرجة بالعصفر فقال ‏\"‏ ما هذه الريطة عليك ‏\"‏ ‏.‏ فعرفت ما كره فأتيت أهلي وهم يسجرون تنورا لهم فقذفتها فيه ثم أتيته من الغد فقال ‏\"‏ يا عبد الله ما فعلت الريطة ‏\"‏ ‏.‏ فأخبرته فقال ‏\"‏ ألا كسوتها بعض أهلك فإنه لا بأس به للنساء ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather said: We came down with the Messenger of Allah (ﷺ) from a turning of a valley. He turned his attention to me and I was wearing a garment dyed with a reddish yellow dye. He asked: What is this garment over you? I recognised what he disliked. I then came to my family who were burning their oven. I threw it (the garment) in it and came to him the next day. He asked: Abdullah, what have you done  with the garment? I informed him about it. He said: Why did you not give it to one of your family to wear, for there is no harm in it for women.",
      "chain": [
        "30175",
        "20347",
        "20729",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4113",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن عبد الله بن الميمون، حدثنا الوليد، عن الأوزاعي، عن عمرو بن شعيب، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا زوج أحدكم عبده أمته فلا ينظر إلى عورتها ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather reported the Prophet (ﷺ) said: When one of you marries his male-slave to his slave-woman, he should not look at her private parts.",
      "chain": [
        "20733",
        "20024",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4114",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا زهير بن حرب، حدثنا وكيع، حدثني داود بن سوار المزني، عن عمرو بن شعيب، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا زوج أحدكم خادمه عبده أو أجيره فلا ينظر إلى ما دون السرة وفوق الركبة ‏\"‏ ‏.‏ قال أبو داود صوابه سوار بن داود المزني الصيرفي وهم فيه وكيع ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather reported the Prophet (ﷺ) said: When one of you marries his female servant to his slave or to his employee, he should not look at her private part below the navel and above the knees.Abu Dawud said: The correct name is Sawwad b. Dawud al-Muzani al-Sairafi (and not Dawud b. Sawwad as mentioned in the chain). The narrator waki' misunderstood it.",
      "chain": [
        "30022",
        "20032",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4202",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، ح وحدثنا مسدد، حدثنا سفيان، - المعنى - عن ابن عجلان، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تنتفوا الشيب ما من مسلم يشيب شيبة في الإسلام ‏\"‏ ‏.‏ قال عن سفيان ‏\"‏ إلا كانت له نورا يوم القيامة ‏\"‏ ‏.‏ وقال في حديث يحيى ‏\"‏ إلا كتب الله له بها حسنة وحط عنه بها خطيئة ‏\"‏ ‏.‏",
      "text_en": " 'Amr b. Shu'aib, on his father's authority, told that his grandfather reported the Messenger of Allah (ﷺ) said:                      Do not pluck out grey hair. If any believer grows a grey hair in Islam, he will have light on the Day of Resurrection. (This is Sufyan's version). Yahya's version says: Allah will record on his behalf a good deed for it, and will blot out a sin for it.",
      "chain": [
        "30175",
        "20031",
        "30175",
        "10616",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4376",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، قال سمعت ابن جريج، يحدث عن عمرو بن شعيب، عن أبيه، عن عبد الله بن عمرو بن العاص، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ تعافوا الحدود فيما بينكم فما بلغني من حد فقد وجب ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: Forgive the infliction of prescribed penalties among yourselves, for any prescribed penalty of which I hear must be carried out.",
      "chain": [
        "30584",
        "20029",
        "11070",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "4390",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا الليث، عن ابن عجلان، عن عمرو بن شعيب، عن أبيه، عن جده عبد الله بن عمرو بن العاص، عن رسول الله صلى الله عليه وسلم أنه سئل عن الثمر المعلق فقال ‏\"‏ من أصاب بفيه من ذي حاجة غير متخذ خبنة فلا شىء عليه ومن خرج بشىء منه فعليه غرامة مثليه والعقوبة ومن سرق منه شيئا بعد أن يئويه الجرين فبلغ ثمن المجن فعليه القطع ومن سرق دون ذلك فعليه غرامة مثليه والعقوبة ‏\"‏ ‏.‏ قال أبو داود الجرين الجوخان ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Messenger of Allah  (ﷺ) was asked about fruit which was bung up and said: If a needy person takes some with his mouth and does not take a supply away in his garment, there is nothing on him, but he who carries any of it is to be fined twice the value and punished, and he who steals any of it after it has been put in the place where dates are dried to have his hand cut off if their value reaches the value of a shield. If he steals a thing less in value than it, he is to be find twice the value and punished.Abu Dawud said: Jarin means the place where dates are dried.",
      "chain": [
        "30367",
        "20023",
        "10616",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "4506",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا مسلم، حدثنا محمد بن راشد، حدثنا سليمان بن موسى، عن عمرو بن شعيب، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يقتل مؤمن بكافر ومن قتل مؤمنا متعمدا دفع إلى أولياء المقتول فإن شاءوا قتلوه وإن شاءوا أخذوا الدية ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Amr b. Shu'aib:                     On his father's authority said that his grandfather reported the Prophet (ﷺ) said: A believer will not be killed for an infidel. If anyone kills a man deliberately, he is to be handed over to the relatives of the one who has been killed. If they wish, they may kill, but if they wish, they may accept blood-wit",
      "chain": [
        "20285",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4519",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن الحسن بن تسنيم العتكي، حدثنا محمد بن بكر، أخبرنا سوار أبو حمزة، حدثنا عمرو بن شعيب، عن أبيه، عن جده، قال جاء رجل مستصرخ إلى النبي صلى الله عليه وسلم فقال جارية له يا رسول الله ‏.‏ فقال ‏\"‏ ويحك ما لك ‏\"‏ ‏.‏ قال شرا أبصر لسيده جارية له فغار فجب مذاكيره ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ على بالرجل ‏\"‏ ‏.‏ فطلب فلم يقدر عليه فقال رسول الله صلى الله عليه وسلم ‏\"‏ اذهب فأنت حر ‏\"‏ ‏.‏ فقال يا رسول الله على من نصرتي قال ‏\"‏ على كل مؤمن ‏\"‏ ‏.‏ أو قال ‏\"‏ كل مسلم ‏\"‏ ‏.‏ قال أبو داود الذي عتق كان اسمه روح بن دينار ‏.‏ قال أبو داود الذي جبه زنباع ‏.‏ قال أبو داود هذا زنباع أبو روح كان مولى العبد ‏.‏",
      "text_en": " Narrated 'Amr b. Shu'aib:                     On his father's authority, said that his grandfather told that a A man came to the Prophet (ﷺ) crying for help. He said: His slave-girl, Messenger of Allah! He said: Woe to you, what happened with you ? He said that it was an evil one. He saw the slave-girl of his master; he became jealous of him, and cut off his penis. The Messenger of Allah (ﷺ) said: Bring the man to me. The man was called, but people could not get control over him. The Messenger of Allah (ﷺ) then said: Go away, you are free. He asked: Messenger of Allah! upon whom does my help lie? He replied: On every believer, or he said: On every Muslim.Abu Dawud said: The name of the man who was emancipated was Rawh b. DinarAbu Dawud said: The man who cut off the penis was Zinba'Abu Dawud said: The Zinba' Abu Rawh was master of the slave.",
      "chain": [
        "20004",
        "20277",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4531",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا عبيد الله بن عمر، حدثنا هشيم، عن يحيى بن سعيد، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ذكر نحو حديث علي زاد فيه ‏\"‏ ويجير عليهم أقصاهم ويرد مشدهم على مضعفهم ومتسريهم على قاعدهم ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather reported the Messenger of Allah (ﷺ) said, mentioning the tradition similar to the one transmitted by Ali. This version adds: The most distant of them gives protection as from all, those who are strong among them send back (spoil) to those who are weak among them, and their expeditions sending it back to those who are at home.",
      "chain": [
        "11201",
        "20468",
        "11062",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4541",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا مسلم بن إبراهيم، قال حدثنا محمد بن راشد، ح وحدثنا هارون بن زيد بن أبي الزرقاء، حدثنا أبي، حدثنا محمد بن راشد، عن سليمان بن موسى، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قضى أن من قتل خطأ فديته مائة من الإبل ثلاثون بنت مخاض وثلاثون بنت لبون وثلاثون حقة وعشرة بني لبون ذكر ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather reported the  Messenger of Allah (ﷺ) gave judgment that if anyone is killed accidentally, his blood-wit should be one hundred camels: thirty she-camels which had entered their second year, thirty she-camels which had entered their third year, thirty she-camels which had entered their fourth year, and ten male camels which had entered their third year.",
      "chain": [
        "20285",
        "20719",
        "38673",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4542",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا يحيى بن حكيم، حدثنا عبد الرحمن بن عثمان، حدثنا حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، قال كانت قيمة الدية على عهد رسول الله صلى الله عليه وسلم ثمانمائة دينار أو ثمانية آلاف درهم ودية أهل الكتاب يومئذ النصف من دية المسلمين قال فكان ذلك كذلك حتى استخلف عمر رحمه الله فقام خطيبا فقال ألا إن الإبل قد غلت ‏.‏ قال ففرضها عمر على أهل الذهب ألف دينار وعلى أهل الورق اثنى عشر ألفا وعلى أهل البقر مائتى بقرة وعلى أهل الشاء ألفى شاة وعلى أهل الحلل مائتى حلة ‏.‏ قال وترك دية أهل الذمة لم يرفعها فيما رفع من الدية ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather reported that the  value of the blood-money at the time of the Messenger of Allah (ﷺ) was eight hundred dinars or eight thousand dirhams, and the blood-money for the people of the Book was half of that for Muslims.  He said: This applied till Umar (Allah be pleased with him) became caliph and he made a speech in which he said: Take note! Camels have become dear. So Umar fixed the value for those who possessed gold at one thousand dinars, for those who possessed silver at twelve thousand (dirhams), for those who possessed cattle at two hundred cows, for those who possessed sheep at two thousand sheep, and for those who possessed suits of clothing at two hundred suits. He left the blood-money for dhimmis (protected people) as it was, not raising it in proportion to the increase he made in the blood-wit.",
      "chain": [
        "34280",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4562",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا هدبة بن خالد، حدثنا همام، حدثنا حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال في خطبته وهو مسند ظهره إلى الكعبة ‏\"‏ في الأصابع عشر عشر ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather said: The Prophet (ﷺ) said in his address while he was leaning against the Ka'bah: (The blood-wit) for each finger is ten camels.",
      "chain": [
        "20294",
        "20297",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4563",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا زهير بن حرب أبو خيثمة، حدثنا يزيد بن هارون، حدثنا حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم قال ‏\"‏ في الأسنان خمس خمس ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather said: The Prophet (ﷺ) said: For each tooth are ten camels.",
      "chain": [
        "30022",
        "20472",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4564",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "قال أبو داود وجدت في كتابي عن شيبان، - ولم أسمعه منه - فحدثناه أبو بكر، - صاحب لنا ثقة - قال حدثنا شيبان، حدثنا محمد، - يعني ابن راشد - عن سليمان، - يعني ابن موسى - عن عمرو بن شعيب، عن أبيه، عن جده، قال كان رسول الله صلى الله عليه وسلم يقوم دية الخطإ على أهل القرى أربعمائة دينار أو عدلها من الورق يقومها على أثمان الإبل فإذا غلت رفع في قيمتها وإذا هاجت رخصا نقص من قيمتها وبلغت على عهد رسول الله صلى الله عليه وسلم ما بين أربعمائة دينار إلى ثمانمائة دينار أو عدلها من الورق ثمانية آلاف درهم وقضى رسول الله صلى الله عليه وسلم على أهل البقر مائتى بقرة ومن كان دية عقله في الشاء فألفى شاة قال وقال رسول الله صلى الله عليه وسلم ‏\"‏ إن العقل ميراث بين ورثة القتيل على قرابتهم فما فضل فللعصبة ‏\"‏ ‏.‏ قال وقضى رسول الله صلى الله عليه وسلم في الأنف إذا جدع الدية كاملة وإن جدعت ثندوته فنصف العقل خمسون من الإبل أو عدلها من الذهب أو الورق أو مائة بقرة أو ألف شاة وفي اليد إذا قطعت نصف العقل وفي الرجل نصف العقل وفي المأمومة ثلث العقل ثلاث وثلاثون من الإبل وثلث أو قيمتها من الذهب أو الورق أو البقر أو الشاء والجائفة مثل ذلك وفي الأصابع في كل أصبع عشر من الإبل وفي الأسنان في كل سن خمس من الإبل وقضى رسول الله صلى الله عليه وسلم أن عقل المرأة بين عصبتها من كانوا لا يرثون منها شيئا إلا ما فضل عن ورثتها فإن قتلت فعقلها بين ورثتها وهم يقتلون قاتلهم وقال رسول الله صلى الله عليه وسلم ‏\"‏ ليس للقاتل شىء وإن لم يكن له وارث فوارثه أقرب الناس إليه ولا يرث القاتل شيئا ‏\"‏ ‏.‏ قال محمد هذا كله حدثني به سليمان بن موسى عن عمرو بن شعيب عن أبيه عن جده عن النبي صلى الله عليه وسلم ‏.‏ قال أبو داود محمد بن راشد من أهل دمشق هرب إلى البصرة من القتل ‏.‏",
      "text_en": " Narrated Abu Dawud:                     I found in my notebook from Shaiban and I did not hear from him ; Abu Bakr, a reliable friend of ours, said: Shaiban - Muhammad b. Rashid - Sulaiman b. Musad - 'Amr b. Suh'aib, On his father's authority, said that his grandfather said: The Messenger of Allah (ﷺ) would fix the blood-money for accidental killing at the rate of four hundred dinars or their equivalent in silver for townsmen, and he would fix it according to the price of camels. So when they were dear, he increased the amount to be paid, and when cheap prices prevailed he reduced the amount to be paid. In the time of the Messenger of Allah (ﷺ) they reached between four hundred and eight hundred dinars, their equivalent in silver being eight thousand dirhams.  He said: The Messenger of Allah (ﷺ) gave judgment that those who possessed cattle should pay two hundred cows, and those who possessed sheep two thousand sheep.  He said: The Messenger of Allah (ﷺ) said: The blood-money is to be treated as something to be inherited by the heirs of the one who has been killed, and the remainder should be divided among the agnates.  He said: The Messenger of Allah (ﷺ) gave judgment that for cutting off a nose completely there was full blood-money, one hundred (camels) were to be paid. If the tip of the nose was cut off, half of the blood-money,i.e. fifty camels were to be paid, or their equivalent in gold or in silver, or a hundred cows, or one thousand sheep. For the hand, when it was cut of,f half of the blood-money was to be paid; for one foot of half, the blood-money was to be paid. For a wound in the head, a third of the blood-money was due, i.e. thirty-three camels and a third of the blood-money, or their equivalent in gold, silver, cows or sheep. For a head thrust which reaches the body, the same blood-money was to be paid. Ten camels were to be paid for every finger, and five camels for every tooth.  The Messenger of Allah (ﷺ) gave judgment that the blood-money for a woman should be divided among her relatives on her father's side, who did not inherit anything from her except the residence of her heirs. If she was killed, her blood-money should be distributed among her heirs, and they would have the right of taking revenge on the murderer.  The Messenger of Allah (ﷺ) said: There is nothing for the murderer; and if he (the victim) has no heir, his heir will be the one who is nearest to him among the people, but the murderer should not inherit anything.  Muhammad said: All this has been transmitted to me by Sulayman ibn Musa on the authority of Amr ibn Shu'aib who, on his father's authority, said that his grandfather heard it from the Prophet (ﷺ).Abu Dawud said: Muhammad b. Rashid, an inhabitant of Damascus, fled from Basrah escaping murder.",
      "chain": [
        "20240",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4565",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا محمد بن بكار بن بلال العاملي، أخبرنا محمد، - يعني ابن راشد - عن سليمان، - يعني ابن موسى - عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال ‏\"‏ عقل شبه العمد مغلظ مثل عقل العمد ولا يقتل صاحبه ‏\"‏ ‏.‏ قال وزادنا خليل عن ابن راشد ‏\"‏ وذلك أن ينزو الشيطان بين الناس فتكون دماء في عميا في غير ضغينة ولا حمل سلاح ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather reported the Prophet (ﷺ) said: Blood-wit for what resembles intentional murder is to be made as severe as that for intentional murder, but the culprit is not to be killed. Khalid gave us some additional information on the authority of Ibn Rashid: That (unintentional murder which resembles intentional murder) means that Satan jumps among the people and then the blood is shed blindly without any malice and weapon.",
      "chain": [
        "11222",
        "27540",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4566",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا أبو كامل، فضيل بن حسين أن خالد بن الحارث، حدثهم قال أخبرنا حسين، - يعني المعلم - عن عمرو بن شعيب، أن أباه، أخبره عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ في المواضح خمس ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: Blood-wit for every wound which lays bare a bone is five camels.",
      "chain": [
        "20226",
        "11278",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "4567",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا محمود بن خالد السلمي، حدثنا مروان، - يعني ابن محمد - حدثنا الهيثم بن حميد، حدثني العلاء بن الحارث، حدثني عمرو بن شعيب، عن أبيه، عن جده، قال قضى رسول الله صلى الله عليه وسلم في العين القائمة السادة لمكانها بثلث الدية ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather said: The Messenger of Allah (ﷺ) gave judgment that a third of the blood-wit should be paid for an eye fixed in its place.",
      "chain": [
        "37534",
        "20640",
        "20744",
        "10884",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4583",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا يزيد بن خالد بن موهب الرملي، حدثنا عيسى بن يونس، عن محمد بن إسحاق، عن عمرو بن شعيب، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم قال ‏\"‏ دية المعاهد نصف دية الحر ‏\"‏ ‏.‏ قال أبو داود رواه أسامة بن زيد الليثي وعبد الرحمن بن الحارث عن عمرو بن شعيب مثله ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather reported the Messenger of Allah (ﷺ)  said: The blood-wit for a man who makes a covenant is half of the blood-wit for a free man.Abu Dawud said: It has been transmitted by Usamah b. Zaid al-Laithi and 'Abd al-Rahman b. al-Harith on the authority of 'Amr b. Suh'aib in similar manner.",
      "chain": [
        "38715",
        "20347",
        "11107",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4586",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا نصر بن عاصم الأنطاكي، ومحمد بن الصباح بن سفيان، أن الوليد بن مسلم، أخبرهم عن ابن جريج، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من تطبب ولا يعلم منه طب فهو ضامن ‏\"‏ ‏.‏ قال نصر قال حدثني ابن جريج ‏.‏ قال أبو داود هذا لم يروه إلا الوليد لا ندري هو صحيح أم لا ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather reported the Messenger of Allah (ﷺ) said: Anyone who practises medicine when he is not known as a practitioner will be held responsible.Abu Dawud said: This has been transmitted by al-Walid alone. We do not know whether it is sound or not.",
      "chain": [
        "38662",
        "30269",
        "20733",
        "11070",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4845",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، قال أخبرني أسامة بن زيد الليثي، عن عمرو بن شعيب، عن أبيه، عن عبد الله بن عمرو، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يحل لرجل أن يفرق بين اثنين إلا بإذنهما ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Messenger of Allah (ﷺ) said: It is not lawful for a man to separate two persons except with their permission.",
      "chain": [
        "30584",
        "20029",
        "20500",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "322",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن ابن عجلان، عن عمرو بن شعيب، عن أبيه، عن جده، عن رسول الله صلى الله عليه وسلم أنه نهى عن تناشد الأشعار في المسجد وعن البيع والاشتراء فيه وأن يتحلق الناس فيه يوم الجمعة قبل الصلاة ‏.‏ قال وفي الباب عن بريدة وجابر وأنس ‏.‏ قال أبو عيسى حديث عبد الله بن عمرو بن العاص حديث حسن ‏.‏ وعمرو بن شعيب هو ابن محمد بن عبد الله بن عمرو بن العاص ‏.‏ قال محمد بن إسماعيل رأيت أحمد وإسحاق وذكر غيرهما يحتجون بحديث عمرو بن شعيب ‏.‏ قال محمد وقد سمع شعيب بن محمد من جده عبد الله بن عمرو ‏.‏ قال أبو عيسى ومن تكلم في حديث عمرو بن شعيب إنما ضعفه لأنه يحدث عن صحيفة جده كأنهم رأوا أنه لم يسمع هذه الأحاديث من جده ‏.‏ قال علي بن عبد الله وذكر عن يحيى بن سعيد أنه قال حديث عمرو بن شعيب عندنا واهي ‏.‏ وقد كره قوم من أهل العلم البيع والشراء في المسجد وبه يقول أحمد وإسحاق ‏.‏ وقد روي عن بعض أهل العلم من التابعين رخصة في البيع والشراء في المسجد ‏.‏ وقد روي عن النبي صلى الله عليه وسلم في غير حديث رخصة في إنشاد الشعر في المسجد ‏.‏",
      "text_en": " Amr bin Shu'aib narrated from his father, from his grandfather (Abdullah bin Amr Al-As), that :                     Allah's Messenger prohibited the recitation of poetry in the Masjid, and from selling and buying in it, and (he prohibited) the people from forming circles in it on Friday before the Salat.\"",
      "chain": [
        "30367",
        "20023",
        "10616",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "637",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا قتيبة، حدثنا ابن لهيعة، عن عمرو بن شعيب، عن أبيه، عن جده، أن امرأتين، أتتا رسول الله صلى الله عليه وسلم وفي أيديهما سواران من ذهب فقال لهما ‏\"‏ أتؤديان زكاته ‏\"‏ ‏.‏ قالتا لا ‏.‏ قال فقال لهما رسول الله صلى الله عليه وسلم ‏\"‏ أتحبان أن يسوركما الله بسوارين من نار ‏\"‏ ‏.‏ قالتا لا ‏.‏ قال ‏\"‏ فأديا زكاته ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث قد رواه المثنى بن الصباح عن عمرو بن شعيب نحو هذا ‏.‏ والمثنى بن الصباح وابن لهيعة يضعفان في الحديث ولا يصح في هذا الباب عن النبي صلى الله عليه وسلم شيء ‏.‏",
      "text_en": " Amr bin Shu'aib narrated from his father, from his grandfather, :                     that two women came to the Messenger of Allah, and they each had a bracelet of gold on their forearms. So he said to them: \"Have you paid their Zakat?\" They said, \"No.\" The Messenger of Allah said to them: \"Would you like for Allah to fashion then into two bracelets of Fire?\" They said, \"No.\" He said: \"Then pay its Zakat.\"",
      "chain": [
        "30367",
        "20624",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "641",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا إبراهيم بن موسى، حدثنا الوليد بن مسلم، عن المثنى بن الصباح، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم خطب الناس فقال ‏\"‏ ألا من ولي يتيما له مال فليتجر فيه ولا يتركه حتى تأكله الصدقة ‏\"‏ ‏.‏ قال أبو عيسى وإنما روي هذا الحديث من هذا الوجه وفي إسناده مقال لأن المثنى بن الصباح يضعف في الحديث ‏.‏ وروى بعضهم هذا الحديث عن عمرو بن شعيب أن عمر بن الخطاب ‏.‏ فذكر هذا الحديث ‏.‏ وقد اختلف أهل العلم في هذا الباب فرأى غير واحد من أصحاب النبي صلى الله عليه وسلم في مال اليتيم زكاة ‏.‏ منهم عمر وعلي وعائشة وابن عمر وبه يقول مالك والشافعي وأحمد وإسحاق ‏.‏ وقالت طائفة من أهل العلم ليس في مال اليتيم زكاة ‏.‏ وبه يقول سفيان الثوري وعبد الله بن المبارك ‏.‏ وعمرو بن شعيب هو ابن محمد بن عبد الله بن عمرو بن العاص وشعيب قد سمع من جده عبد الله بن عمرو ‏.‏ وقد تكلم يحيى بن سعيد في حديث عمرو بن شعيب وقال هو عندنا واه ‏.‏ ومن ضعفه فإنما ضعفه من قبل أنه يحدث من صحيفة جده عبد الله بن عمرو وأما أكثر أهل الحديث فيحتجون بحديث عمرو بن شعيب ويثبتونه منهم أحمد وإسحاق وغيرهما ‏.‏",
      "text_en": " Amr bin Shu'aib narrated from his father, from his grandfather that :                     the Prophet addressed the people and said: \"As for one who is the guardian of an orphan who has wealth, then let him do business with it and not leave it until it becomes consumed by charity.\"",
      "chain": [
        "34188",
        "30309",
        "20733",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "674",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا عقبة بن مكرم البصري، حدثنا سالم بن نوح، عن ابن جريج، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم بعث مناديا في فجاج مكة ‏\"‏ ألا إن صدقة الفطر واجبة على كل مسلم ذكر أو أنثى حر أو عبد صغير أو كبير مدان من قمح أو سواه صاع من طعام ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وروى عمر بن هارون هذا الحديث عن ابن جريج وقال عن العباس بن ميناء عن النبي صلى الله عليه وسلم فذكر بعض هذا الحديث ‏.‏حدثنا جارود حدثنا عمر بن هارون هذا الحديث",
      "text_en": " Amr bin Shu'aib narrated from his grandfather that :                     the Prophet sent a caller in the roads of Makkah proclaiming \"Sadaqatul-Fitr is required upon every Muslim, male or female, free or slave, young or old; it is two Mudd of wheat or its equivalent of a Sa of food.\"",
      "chain": [
        "30441",
        "20542",
        "11070",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1117",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا قتيبة، حدثنا ابن لهيعة، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال ‏\"‏ أيما رجل نكح امرأة فدخل بها فلا يحل له نكاح ابنتها فإن لم يكن دخل بها فلينكح ابنتها وأيما رجل نكح امرأة فدخل بها أو لم يدخل بها فلا يحل له نكاح أمها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث لا يصح من قبل إسناده وإنما رواه ابن لهيعة والمثنى بن الصباح عن عمرو بن شعيب ‏.‏ والمثنى بن الصباح وابن لهيعة يضعفان في الحديث ‏.‏ والعمل على هذا عند أكثر أهل العلم قالوا إذا تزوج الرجل امرأة ثم طلقها قبل أن يدخل بها حل له أن ينكح ابنتها وإذا تزوج الرجل الابنة فطلقها قبل أن يدخل بها لم يحل له نكاح أمها لقول الله تعالى ‏(‏وأمهات نسائكم ‏)‏ وهو قول الشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Amr bin Shu'aib narrated from his father, from his grandfather that:                     The Prophet said: \"Whichever man married a woman and entered into her, then it is not lawful for him to marry her daughter. If he did not enter into her then he may marry her daughter. And whichever man married a woman and he entered into her, or he did  not enter into her, then it is not lawful for him to marry her mother.\"",
      "chain": [
        "30367",
        "20624",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1142",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن منيع، وهناد، قالا حدثنا أبو معاوية، عن الحجاج، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم رد ابنته زينب على أبي العاصي بن الربيع بمهر جديد ونكاح جديد ‏.‏ قال أبو عيسى هذا حديث في إسناده مقال ‏.‏ والعمل على هذا الحديث عند أهل العلم أن المرأة إذا أسلمت قبل زوجها ثم أسلم زوجها وهي في العدة أن زوجها أحق بها ما كانت في العدة ‏.‏ وهو قول مالك بن أنس والأوزاعي والشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Amr bin Shu'aib narrated from his father, from his grandfather:                     \"The Messenger of Allah returned his daughter Zainab to Abul-As bin Ar-Rabi with a new dowry and a new wedding.\"",
      "chain": [
        "30242",
        "30480",
        "20354",
        "20381",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1217",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، حدثنا عامر الأحول، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا نذر لابن آدم فيما لا يملك ولا عتق له فيما لا يملك ولا طلاق له فيما لا يملك ‏\"‏ ‏.‏ قال وفي الباب عن علي ومعاذ بن جبل وجابر وابن عباس وعائشة ‏.‏ قال أبو عيسى حديث عبد الله بن عمرو حديث حسن صحيح وهو أحسن شيء روي في هذا الباب ‏.‏ وهو قول أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم روي ذلك عن علي بن أبي طالب وابن عباس وجابر بن عبد الله وسعيد بن المسيب والحسن وسعيد بن جبير وعلي بن الحسين وشريح وجابر بن زيد وغير واحد من فقهاء التابعين وبه يقول الشافعي ‏.‏ وروي عن ابن مسعود أنه قال في المنصوبة إنها تطلق ‏.‏ وقد روي عن إبراهيم النخعي والشعبي وغيرهما من أهل العلم أنهم قالوا إذا وقت نزل ‏.‏ وهو قول سفيان الثوري ومالك بن أنس أنه إذا سمى امرأة بعينها أو وقت وقتا أو قال إن تزوجت من كورة كذا فإنه إن تزوج فإنها تطلق ‏.‏ وأما ابن المبارك فشدد في هذا الباب وقال إن فعل لا أقول هي حرام ‏.‏ وقال أحمد إن تزوج لا آمره أن يفارق امرأته ‏.‏ وقال إسحاق أنا أجيز في المنصوبة لحديث ابن مسعود وإن تزوجها لا أقول تحرم عليه امرأته ‏.‏ ووسع إسحاق في غير المنصوبة ‏.‏ وذكر عن عبد الله بن المبارك أنه سئل عن رجل حلف بالطلاق أنه لا يتزوج ثم بدا له أن يتزوج هل له رخصة بأن يأخذ بقول الفقهاء الذين رخصوا في هذا فقال عبد الله بن المبارك إن كان يرى هذا القول حقا من قبل أن يبتلى بهذه المسألة فله أن يأخذ بقولهم فأما من لم يرض بهذا فلما ابتلي أحب أن يأخذ بقولهم فلا أرى له ذلك ‏.‏",
      "text_en": " Amr bin Shu'aib narrated from his grandfather, from his father, that:                     The Messenger of Allah said: \"There is no vow for the son of Adam over what he has no control, and there is no emancipating he can do for one whom he does not own, and there is no divorce for him regarding that which he has no control over.\"",
      "chain": [
        "30242",
        "20468",
        "10693",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1234",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا إسماعيل بن إبراهيم، حدثنا أيوب، حدثنا عمرو بن شعيب، قال حدثني أبي، عن أبيه، حتى ذكر عبد الله بن عمرو أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يحل سلف وبيع ولا شرطان في بيع ولا ربح ما لم يضمن ولا بيع ما ليس عندك ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح ‏.‏ قال أبو عيسى حديث حكيم بن حزام حديث حسن قد روي عنه من غير وجه ‏.‏ روى أيوب السختياني وأبو بشر عن يوسف بن ماهك عن حكيم بن حزام ‏.‏ قال أبو عيسى وروى هذا الحديث عوف وهشام بن حسان عن ابن سيرين عن حكيم بن حزام عن النبي صلى الله عليه وسلم ‏.‏ وهذا حديث مرسل إنما رواه ابن سيرين عن أيوب السختياني عن يوسف بن ماهك عن حكيم بن حزام ‏.‏",
      "text_en": " Narrated Ayyub:                     'Amr bin Shu'aib narrated to us, saying: My father narrated to me from his father' until he mentioned 'Abdullah bin 'Amr: \"The Messenger of Allah (ﷺ) said: 'It is not lawful to lend and sell, nor two conditions in a sale, nor to profit from what is not possessed, nor to sell what one does not have.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.[Abu 'Eisa said:] The Hadith of Hakim bin Hizam is a Hasan Hadith, it has been reported from him through other routes. Ayyub As-Sakhtiyani and Abu Bishr report from Yusuf bin Mahak, from Hakim bin Hizam.[Abu 'Eisa said:] 'Awf and Hisham bin Hassan reported this Hadith from Ibn Sirin, from Hakim bin Hizam from the Prophet (ﷺ). And this is a Mursal Hadith. Ibn Sirin only reported it from Ayyub As-Sikhtiyani from Yusuf bin Mahak, from Hakim bin Hizam like this.",
      "chain": [
        "30242",
        "20208",
        "11015",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "1247",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "أخبرنا بذلك، قتيبة بن سعيد حدثنا الليث بن سعد، عن ابن عجلان، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ البيعان بالخيار ما لم يتفرقا إلا أن تكون صفقة خيار ولا يحل له أن يفارق صاحبه خشية أن يستقيله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ ومعنى هذا أن يفارقه بعد البيع خشية أن يستقيله ولو كانت الفرقة بالكلام ولم يكن له خيار بعد البيع لم يكن لهذا الحديث معنى حيث قال صلى الله عليه وسلم ‏\"‏ ولا يحل له أن يفارقه خشية أن يستقيله ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Amr bin Shu'aib:                     From his father, from his grandfather, that the Messenger of Allah (ﷺ) said: \"Both the buyer and the seller retain the option as long as they did not separate, unless they agreed to making it optional. And it is not lawful for him to separate from his companion, fearing that he will change his mind.\"[Abu 'Eisa said:] This Hadith is Hasan and this means separating from him after the sale, fearing that he will change his mind. And if the separation referred to speech, and there was no option left for him after the sale, then this Hadith would be meaningless, since he (ﷺ) said: \"And it is not lawful for him to separate from his companion, fearing that he will change his mind.\"",
      "chain": [
        "20023",
        "10616",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1260",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة، حدثنا عبد الوارث بن سعيد، عن يحيى بن أبي أنيسة، عن عمرو بن شعيب، عن أبيه، عن جده، قال سمعت رسول الله صلى الله عليه وسلم يخطب يقول ‏\"‏ من كاتب عبده على مائة أوقية فأداها إلا عشر أواق أو قال عشرة دراهم ثم عجز فهو رقيق ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ والعمل عليه عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أن المكاتب عبد ما بقي عليه شيء من كتابته ‏.‏ وقد روى الحجاج بن أرطاة عن عمرو بن شعيب نحوه ‏.‏",
      "text_en": " Narrated 'Amr bin Shu'aib:                     From his father, from his grandfather that he heard the Messenger of Allah (ﷺ) delivering a Khutbah in which he said: \"Whoever gives a writ of emancipation to his slave, for one hundred Uqiyyah, and he pays it to him less then ten Uqiyah.\" - or he said: \"Ten Dirham\" - \"then he becomes incapable (of paying the remainder), the he remains a slave.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. And this acted upon according to most of the people of knowledge among the Companions of the Prophet (ﷺ) and others: The Mukatab is a slave as long as something remains due from him for his Kitabah.Al-Hajjaj bin Artat reported similarly from 'Amr bin Shu'aib.",
      "chain": [
        "30367",
        "20258",
        "19139",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1289",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن ابن عجلان، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم سئل عن الثمر المعلق فقال ‏\"‏ من أصاب منه من ذي حاجة غير متخذ خبنة فلا شىء عليه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Narrated 'Amr bin Shu'aib:                     From his father, from his grandfather, that the Prophet (ﷺ) was asked about hanging fruits (on the trees), so he said: \"Whoever is in need and picks some of it without taking any in his garment, then there is no sin upon him.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "30367",
        "20023",
        "10616",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1341",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا علي بن حجر، أنبأنا علي بن مسهر، وغيره، عن محمد بن عبيد الله، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال في خطبته ‏\"‏ البينة على المدعي واليمين على المدعى عليه ‏\"‏ ‏.‏ هذا حديث في إسناده مقال ‏.‏ ومحمد بن عبيد الله العرزمي يضعف في الحديث من قبل حفظه ضعفه ابن المبارك وغيره ‏.‏",
      "text_en": " 'Amr bin Shu'aib narrated from his father, from his grandfather, that during a Khutbah, the Prophet (ﷺ) said:                      \"The proof is due from the claimant, and the oath is due from the one the claim is made against.\"",
      "chain": [
        "20387",
        "20345",
        "30213",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1387",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا أحمد بن سعيد الدارمي، أخبرنا حبان، وهو ابن هلال حدثنا محمد بن راشد، أخبرنا سليمان بن موسى، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قتل مؤمنا متعمدا دفع إلى أولياء المقتول فإن شاءوا قتلوا وإن شاءوا أخذوا الدية وهي ثلاثون حقة وثلاثون جذعة وأربعون خلفة وما صالحوا عليه فهو لهم ‏\"‏ ‏.‏ وذلك لتشديد العقل ‏.‏ قال أبو عيسى حديث عبد الله بن عمرو حديث حسن غريب ‏.‏",
      "text_en": " Narrated Amr bin Shu'aib:                     from his father, from his grandfather that the Prophet (ﷺ) said: \"Whoever kills [a believer] deliberately, he is handed over to the guardians of the one killed. If they wish to, they have him killed, and if they wish to, they take the blood-money. That is thirty Hiqqah, thirty Jadha'ahs and forty pregnant camels. Whatever (amount more) they require from him, than that is for them (if they choose).\" THat is because of the severity of blood-money.",
      "chain": [
        "30296",
        "20218",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1390",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا حميد بن مسعدة، أخبرنا يزيد بن زريع، أخبرنا حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال ‏\"‏ في المواضح خمس خمس ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ والعمل على هذا عند أهل العلم وهو قول سفيان الثوري والشافعي وأحمد وإسحاق أن في الموضحة خمسا من الإبل ‏.‏",
      "text_en": " Narrated 'Amr bin Shu'aib:                     from his father, from his grandfather that the Prophet (ﷺ) said: \"Regarding the Mawadih; five, five.\"",
      "chain": [
        "30430",
        "20304",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1399",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا علي بن حجر، حدثنا إسماعيل بن عياش، حدثنا المثنى بن الصباح، عن عمرو بن شعيب، عن أبيه، عن جده، عن سراقة بن مالك بن جعشم، قال حضرت رسول الله صلى الله عليه وسلم يقيد الأب من ابنه ولا يقيد الابن من أبيه ‏.‏ قال أبو عيسى هذا حديث لا نعرفه من حديث سراقة إلا من هذا الوجه وليس إسناده بصحيح رواه إسماعيل بن عياش عن المثنى بن الصباح ‏.‏ والمثنى بن الصباح يضعف في الحديث ‏.‏ وقد روى هذا الحديث أبو خالد الأحمر عن الحجاج بن أرطاة عن عمرو بن شعيب عن أبيه عن جده عن عمر عن النبي صلى الله عليه وسلم وقد روي هذا الحديث عن عمرو بن شعيب مرسلا وهذا حديث فيه اضطراب ‏.‏ والعمل على هذا عند أهل العلم أن الأب إذا قتل ابنه لا يقتل به وإذا قذف ابنه لا يحد ‏.‏",
      "text_en": " Narrated Suraqah bin Malik bin [Ju'shum]:                     \"The Messenger of Allah (ﷺ) judged that the son is to suffer retaliation for [killing] his father, but the father is not to suffer retaliation for [killing] his son.\"",
      "chain": [
        "20387",
        "20736",
        "19934",
        "19911",
        "471"
      ]
    },
    {
      "hadith_no": "1400",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا الأحمر، عن الحجاج بن أرطاة، عن عمرو بن شعيب، عن أبيه، عن جده، عن عمر بن الخطاب، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يقاد الوالد بالولد ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Umar bin Al-Khattab:                     that the Messenger of Allah (ﷺ) said: \"The father does not suffer retaliation for [killing] the son.\"",
      "chain": [
        "30200",
        "20326",
        "20580",
        "19934",
        "19911",
        "3"
      ]
    },
    {
      "hadith_no": "1413",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا عيسى بن أحمد، حدثنا ابن وهب، عن أسامة بن زيد، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يقتل مسلم بكافر ‏\"‏ ‏.‏  وبهذا الإسناد عن النبي صلى الله عليه وسلم قال ‏\"‏ دية عقل الكافر نصف دية عقل المؤمن ‏\"‏ ‏.‏ قال أبو عيسى حديث عبد الله بن عمرو في هذا الباب حديث حسن ‏.‏ واختلف أهل العلم في دية اليهودي والنصراني فذهب بعض أهل العلم في دية اليهودي والنصراني إلى ما روي عن النبي صلى الله عليه وسلم ‏.‏ وقال عمر بن عبد العزيز دية اليهودي والنصراني نصف دية المسلم ‏.‏ وبهذا يقول أحمد بن حنبل وروي عن عمر بن الخطاب أنه قال دية اليهودي والنصراني أربعة آلاف درهم ودية المجوسي ثمانمائة درهم ‏.‏ وبهذا يقول مالك بن أنس والشافعي وإسحاق ‏.‏ وقال بعض أهل العلم دية اليهودي والنصراني مثل دية المسلم ‏.‏ وهو قول سفيان الثوري وأهل الكوفة ‏.‏",
      "text_en": " Narrated 'Amr bin Shu'aib:                     from his father, from his grandfather that the Messenger of Allah (ﷺ) said: \"The Muslim is not killed for disbeliever.\"And with this chain, it has been narrated that the Prophet (ﷺ) said: \"The blood-money paid for disbeliever is half of the blood-money paid for a believer.\"",
      "chain": [
        "20029",
        "50",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1585",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا يزيد بن زريع، حدثنا حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال في خطبته ‏\"‏ أوفوا بحلف الجاهلية فإنه لا يزيده يعني الإسلام إلا شدة ولا تحدثوا حلفا في الإسلام ‏\"‏ ‏.‏ قال وفي الباب عن عبد الرحمن بن عوف وأم سلمة وجبير بن مطعم وأبي هريرة وابن عباس وقيس بن عاصم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Amr bin Shu'aib:                     From his father, from his grandfather, that the Messenger of Allah (ﷺ) said during his Khutbah: \"Fulfill the allegiances sworn in Jahiliyyah for it\" - meaning Islam - \"does not add to them except in gravity. And do not initiate new allegiances in Islam.\"[He said:] There are narration on this topic from 'Abdur-Rahman bin 'Awf, Umm Salamah, Jubair bin Mut'im, Abu Hurairah, Ibn 'Abbas, and Qais bin 'Asim.[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "30430",
        "20304",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1674",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، عن عبد الرحمن بن حرملة، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الراكب شيطان والراكبان شيطانان والثلاثة ركب ‏\"‏ ‏.‏ قال أبو عيسى حديث ابن عمر حديث حسن صحيح لا نعرفه إلا من هذا الوجه من حديث عاصم وهو ابن محمد بن زيد بن عبد الله بن عمر وحديث عبد الله بن عمرو حديث حسن ‏.‏ قال محمد هو ثقة صدوق وعاصم بن عمر العمري ضعيف في الحديث لا أروي عنه شيئا ‏.‏ وحديث عبد الله بن عمرو حديث حسن",
      "text_en": " Narrated 'Amr bin Shu'aib:                     From his father, from his grandfather that the Messenger of Allah (ﷺ) said: \"The (lone) rider is a Shaitan, and two raiders are two Shaitan. Three is a travelling party.[Abu 'Eisa said:] The Hadith of Ibn 'Umar (no, 1673) is  Hasan Sahih. We do not know of it except from this route ; as a narration of 'Asim. And he is Ibn Muhammad bin Zaid bin 'Abdullah bin 'Umar. Muhammad said: \"He is trustworthy, truthful. And 'Asim bin 'Umar Al-'Umari is weak in Hadith, I do not report anything from him.\" The Hadith of 'Abdullah bin 'Amr (no. 1674) is better.",
      "chain": [
        "30410",
        "30112",
        "20001",
        "11878",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1883",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Drinks - كتاب الأشربة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "26",
      "text_ar": "حدثنا قتيبة، حدثنا محمد بن جعفر، عن حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، قال رأيت رسول الله صلى الله عليه وسلم يشرب قائما وقاعدا ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Amr bin Shu'aib:                     From his father, from his grandfather who said: \"I saw the Messenger of Allah (ﷺ) drinking while standing and sitting.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "30367",
        "20173",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2044",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو بكر، محمد بن أبان حدثنا محمد بن فضيل، عن محمد بن إسحاق، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس منا من لم يرحم صغيرنا ويعرف شرف كبيرنا ‏\"‏ ‏.‏",
      "text_en": " Amr bin Shu'aib  narrated that his father, from his grandfather, who said that the Messenger of Allah said:                     'He is not one of us who does not have mercy upon our young, nor knows the honor of our elders.\"",
      "chain": [
        "30369",
        "20356",
        "11107",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2259",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Inheritance - كتاب الفرائض عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "29",
      "text_ar": "حدثنا قتيبة، حدثنا ابن لهيعة، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أيما رجل عاهر بحرة أو أمة فالولد ولد زنا لا يرث ولا يورث ‏\"‏ ‏.‏ قال أبو عيسى وقد روى غير ابن لهيعة هذا الحديث عن عمرو بن شعيب ‏.‏ والعمل على هذا عند أهل العلم أن ولد الزنا لا يرث من أبيه ‏.‏",
      "text_en": " Amr bin Su'aib narrated from his father, from his grandfather, that the Messenger of Allah(S.A.W) said:                     \"Any man who fornicates with a free woman, or a slave woman, then the child born from Zina does not inherit, nor is it inherited from.\"",
      "chain": [
        "30367",
        "20624",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2260",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Inheritance - كتاب الفرائض عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "29",
      "text_ar": "حدثنا قتيبة، حدثنا ابن لهيعة، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يرث الولاء من يرث المال ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث ليس إسناده بالقوي ‏.‏",
      "text_en": " Amr bin Su'aib narrated from his father, from his grandfather, that the Messenger of Allah(S.A.W) said:                     \"The one who inherits the Wala is the one who inherits the wealth.\"",
      "chain": [
        "30367",
        "20624",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2680",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا سويد بن نصر، أخبرنا عبد الله بن المبارك، عن محمد بن عجلان، عن عمرو بن شعيب، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم قال ‏\"‏ يحشر المتكبرون يوم القيامة أمثال الذر في صور الرجال يغشاهم الذل من كل مكان فيساقون إلى سجن في جهنم يسمى بولس تعلوهم نار الأنيار يسقون من عصارة أهل النار طينة الخبال ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " 'Amr bin Shu'aib narrated from his father, from his grandfather from the Prophet (s.a.w) who said:                     \"The proud will be gathered on the Day of Judgement resembling tiny particles in the image of men. They will be covered with humiliation everywhere, they will be dragged into a prison in Hell called Bulas, submerged in the Fire of Fires, drinking the drippings of the people of the Fire, filled with derangement.\"",
      "chain": [
        "38265",
        "20025",
        "10616",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2702",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "أخبرنا موسى بن حزام الرجل الصالح، حدثنا علي بن إسحاق، أخبرنا عبد الله بن المبارك، أخبرنا المثنى بن الصباح، عن عمرو بن شعيب، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم نحوه ‏.‏ قال هذا حديث حسن غريب ولم يذكر سويد بن نصر في حديثه عن أبيه ‏.‏",
      "text_en": "",
      "chain": [
        "30394",
        "20025",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2695",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا قتيبة، حدثنا ابن لهيعة، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس منا من تشبه بغيرنا لا تشبهوا باليهود ولا بالنصارى فإن تسليم اليهود الإشارة بالأصابع وتسليم النصارى الإشارة بالأكف ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث إسناده ضعيف ‏.‏ وروى ابن المبارك هذا الحديث عن ابن لهيعة فلم يرفعه ‏.‏",
      "text_en": " Narrated 'Amr bin Shu'aib:                     from his father, from his grandfather, that the Messenger of Allah (ﷺ) said: \"He is not one of us who resembles other than us, no who resembles the Jews nor the Christians. For indeed greeting of the Jews is pointing the finger, and the greeting of the Christians is waving with the hand.\"",
      "chain": [
        "30367",
        "20624",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2976",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا سويد، أخبرنا عبد الله، أخبرنا أسامة بن زيد، حدثني عمرو بن شعيب، عن أبيه، عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يحل للرجل أن يفرق بين اثنين إلا بإذنهما ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد رواه عامر الأحول عن عمرو بن شعيب أيضا ‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Amr:                     that the Messenger of Allah (ﷺ) said: \"It is not lawful for a man to separate two people except with their permission.\"",
      "chain": [
        "20025",
        "50",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "2988",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا هناد، حدثنا عمر بن هارون، عن أسامة بن زيد، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم كان يأخذ من لحيته من عرضها وطولها ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وسمعت محمد بن إسماعيل يقول عمر بن هارون مقارب الحديث لا أعرف له حديثا ليس إسناده أصلا أو قال ينفرد به إلا هذا الحديث كان النبي صلى الله عليه وسلم يأخذ من لحيته من عرضها وطولها ‏.‏ لا نعرفه إلا من حديث عمر بن هارون ورأيته حسن الرأى في عمر بن هارون ‏.‏ قال أبو عيسى وسمعت قتيبة يقول عمر بن هارون كان صاحب حديث وكان يقول الإيمان قول وعمل ‏.‏",
      "text_en": " Narrated 'Amr bin Shu'aib:                     from his father, from his grandfather that he Prophet (ﷺ) would take from his beard; from its breadth and its length.",
      "chain": [
        "30480",
        "50",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3051",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا الحسن بن محمد الزعفراني، حدثنا عفان بن مسلم، حدثنا همام، عن قتادة، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله يحب أن يرى أثر نعمته على عبده ‏\"‏ ‏.‏ وفي الباب عن أبي الأحوص عن أبيه وعمران بن حصين وابن مسعود ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Narrated 'Amr bin Shu'aib:                     from his father, from his grandfather who said: \"The Messenger of Allah (ﷺ) said: 'Indeed Allah loves to see the results of his favors upon His Slaves.'\"",
      "chain": [
        "30245",
        "30106",
        "20297",
        "11019",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3053",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا هارون بن إسحاق الهمداني، حدثنا عبدة، عن محمد بن إسحاق، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم نهى عن نتف الشيب وقال ‏\"‏ إنه نور المسلم ‏\"‏ ‏.‏ قال هذا حديث حسن قد روي عن عبد الرحمن بن الحارث وغير واحد عن عمرو بن شعيب ‏.‏",
      "text_en": " Narrated 'Amr bin Shu'aib:                     from his father, from his grandfather: \"The Prophet (ﷺ) prohibited plucking gray hair. And he said: \"It is the Muslim's light.'\"",
      "chain": [
        "35158",
        "20337",
        "11107",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3066",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا عبيد الله بن سعد بن إبراهيم بن سعد بن إبراهيم بن عبد الرحمن بن عوف، حدثني عمي، يعقوب بن إبراهيم بن سعد حدثنا شريك، عن محمد بن إسحاق، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم أمر بتسمية المولود يوم سابعه ووضع الأذى عنه والعق ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated 'Amr bin Shu'aib:                     from his father, from his grandfather that the Prophet (ﷺ) ordered naming the child on the seventh day, removing the harm from him, and Al-'Aqq (removing the hair and slaughtering the animal for 'Aqiqah).",
      "chain": [
        "20587",
        "11107",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3477",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا روح بن عبادة، عن عبيد الله بن الأخنس، أخبرني عمرو بن شعيب، عن أبيه، عن جده، قال كان رجل يقال له مرثد بن أبي مرثد وكان رجلا يحمل الأسرى من مكة حتى يأتي بهم المدينة قال وكانت امرأة بغي بمكة يقال لها عناق وكانت صديقة له وإنه كان وعد رجلا من أسارى مكة يحمله قال فجئت حتى انتهيت إلى ظل حائط من حوائط مكة في ليلة مقمرة ‏.‏ قال فجاءت عناق فأبصرت سواد ظلي بجنب الحائط فلما انتهت إلى عرفته فقالت مرثد فقلت مرثد ‏.‏ فقالت مرحبا وأهلا هلم فبت عندنا الليلة ‏.‏ قال قلت يا عناق حرم الله الزنا ‏.‏ قالت يا أهل الخيام هذا الرجل يحمل أسراكم ‏.‏ قال فتبعني ثمانية وسلكت الخندمة فانتهيت إلى كهف أو غار فدخلت فجاءوا حتى قاموا على رأسي فبالوا فطل بولهم على رأسي وأعماهم الله عني ‏.‏ قال ثم رجعوا ورجعت إلى صاحبي فحملته وكان رجلا ثقيلا حتى انتهيت إلى الإذخر ففككت عنه كبله فجعلت أحمله ويعينني حتى قدمت المدينة فأتيت رسول الله صلى الله عليه وسلم فقلت يا رسول الله أنكح عناقا مرتين فأمسك رسول الله صلى الله عليه وسلم ولم يرد على شيئا حتى نزلت ‏:‏ ‏(‏الزاني لا ينكح إلا زانية أو مشركة والزانية لا ينكحها إلا زان أو مشرك وحرم ذلك على المؤمنين ‏)‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا مرثد الزاني لا ينكح إلا زانية أو مشركة والزانية لا ينكحها إلا زان أو مشرك فلا تنكحها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Narrated 'Amr bin Shu'aib:                     from his father, from his grandfather, who said \"There was a man named Marthad bin Abi Marthad, and he was a man who would carry captives from Makkah to Al-Madinah.\" He said: \"And there was a prostitute woman in Makkah called 'Anaq, who was a friend of his. He had promised a man from the captives of Makkah that he would transport him, and he said: 'So I came until I reached one of the walls of Makkah on a moon-lit night.' He said \"'Anaq came along and she saw the darkness of my shadow next to the wall. When she reached me she recognized me and said: \"Marthad?\" So I replied: \"(Yes it is) Marthad.\" She said: \"Welcome, come and spend the night with us.\" I said: \"O 'Anaq! Allah has made illicit sexual relations unlawful.\" So she said: \"O people of the tents! That is the man who takes your captives away!\" He said: \"Eight people followed me, and I went through the passes of Al-Khandamah. I stopped at a cave and entered it. They came until they stood over my head, and they began urinating, their urine falling on my head. Yet Allah made them unable to see me. He said: 'Then I went back. I returned to my companion to transport him - and he was a heavy man - until I reached Al-Idhkir. There I removed his shackles to make him easier to carry, since he was exhausting me, until I arrived at Al-Madinah. I went to the Messenger of Allah (ﷺ) and I said \"O Messenger of Allah! May I marry 'Anaq? [I said this, two times] but the Messenger of Allah (ﷺ) was silent, and he did not reply to me at all until (the following) was revealed: The Zani marries not but a Zaniyah or a Mushrikah; and the Zaniyah, none marries her except a Zani or a Mushrik (24:3). So do not marry her.'\"",
      "chain": [
        "30553",
        "20229",
        "20444",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3471",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن وزير الواسطي، حدثنا أبو سفيان الحميري، هو سعيد بن يحيى الواسطي عن الضحاك بن حمرة، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من سبح الله مائة بالغداة ومائة بالعشي كان كمن حج مائة مرة ومن حمد الله مائة بالغداة ومائة بالعشي كان كمن حمل على مائة فرس في سبيل الله أو قال غزا مائة غزوة ومن هلل الله مائة بالغداة ومائة بالعشي كان كمن أعتق مائة رقبة من ولد إسماعيل ومن كبر الله مائة بالغداة ومائة بالعشي لم يأت في ذلك اليوم أحد بأكثر مما أتى به إلا من قال مثل ما قال أو زاد على ما قال ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Amr bin Shuaib narrated from his father, from his grandfather, that :                     The Messenger of Allah said: “Whoever glorifies Allah a hundred times in the morning a hundred in the night, he is like one who performs Hajj a hundred times. And whoever praises Allah a hundred times in the morning and a hundred in the night, he is like one who provides a hundred horses in the cause of Allah.” – or he said – “went out on a hundred military expeditions. And whoever pronounced At-Tahlil of Allah a hundred times in the night, he is like the one who freed a hundred slaves from the offspring of Isma’il, and whoever extols Allah’s greatness a hundred times in the day and a hundred in the night, none shall bring on that day, more than what he brought, except one who said similar to what he said, or increased upon it.”",
      "chain": [
        "20425",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3528",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا علي بن حجر، حدثنا إسماعيل بن عياش، عن محمد بن إسحاق، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا فزع أحدكم في النوم فليقل أعوذ بكلمات الله التامة من غضبه وعقابه وشر عباده ومن همزات الشياطين وأن يحضرون ‏.‏ فإنها لن تضره ‏\"‏ ‏.‏ قال وكان عبد الله بن عمرو يلقنها من بلغ من ولده ومن لم يبلغ منهم كتبها في صك ثم علقها في عنقه ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Amr bin Shu’aib narrated from his father, from his grandfather, that the Messenger of Allah said:                     “When one of you becomes frightened during sleep, then let him say: ‘I seek refuge in Allah’s Perfect Words from His anger, His punishment, and the evil of His creatures, from the whisperings of the Shayatin, and that they should come (A’udhu Bikalimatillahit-Tammati Min Ghadabihi Wa Iqabihi Wa Sharri Ibadih, Wa Min Hamzatish-Shayatini Wa An Yahdurun).’ For verily, they shall not harm him.’”He said: “So Abdullah bin Amr used to teach it to those of his children who attained maturity, and those of them who did  not, he would write it on a sheet and then hang it around his neck.”",
      "chain": [
        "20387",
        "20736",
        "11107",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3585",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أبو عمرو، مسلم بن عمرو الحذاء المديني حدثني عبد الله بن نافع، عن حماد بن أبي حميد، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال ‏\"‏ خير الدعاء دعاء يوم عرفة وخير ما قلت أنا والنبيون من قبلي لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه ‏.‏ وحماد بن أبي حميد هو محمد بن أبي حميد وهو أبو إبراهيم الأنصاري المدني وليس هو بالقوي عند أهل الحديث ‏.‏",
      "text_en": " Amr bin Shu’aib narrated from his father, from his grandfather, that the Prophet said:                     “The best of supplication is the supplication of the Day of Arafah. and the best of what I and the Prophet before me have said is: None has the right to be worshipped but Allah, Alone, without partner, to Him belongs all that exists, and to Him belongs the Praise, and He is powerful over all things. (La Ilaha Illallah, Wahdahu La Sharika Lahu, Lahul-Mulku Wa Lahul-Hamdu, Wa Huwa Ala Kulli Shai’in Qadir).’”",
      "chain": [
        "30411",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "141",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا يعلى، قال حدثنا سفيان، عن موسى بن أبي عائشة، عن عمرو بن شعيب، عن أبيه، عن جده، قال جاء أعرابي إلى النبي صلى الله عليه وسلم يسأله عن الوضوء فأراه الوضوء ثلاثا ثلاثا ثم قال ‏\"‏ هكذا الوضوء فمن زاد على هذا فقد أساء وتعدى وظلم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:                      \"A Bedouin came to the Prophet (ﷺ) to ask him about Wudu', so he showed him how to perform Wudu', washing each part three times, then he said: 'This is Wudu'. Whoever does more than that has done badly, done to extremes and done wrong.'\"",
      "chain": [
        "30277",
        "20372",
        "20012",
        "11399",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "714",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أخبرني يحيى بن سعيد، عن ابن عجلان، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم نهى عن التحلق يوم الجمعة قبل الصلاة وعن الشراء والبيع في المسجد ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that the Prophet (ﷺ) forbade sitting in circles on Friday before Jumu'ah prayer, and buying and selling in the Masjid.",
      "chain": [
        "30123",
        "20031",
        "10616",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "715",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث بن سعد، عن ابن عجلان، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم نهى عن تناشد الأشعار في المسجد ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that the Prophet (ﷺ) forbade reciting poetry in the Masjid.",
      "chain": [
        "30367",
        "20023",
        "10616",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1871",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا سويد بن نصر، قال حدثنا عبد الله، قال أنبأنا عمر بن سعيد بن أبي حسين، أن عمرو بن شعيب، كتب إلى عبد الله بن عبد الرحمن بن أبي حسين يعزيه بابن له هلك وذكر في كتابه أنه سمع أباه يحدث عن جده عبد الله بن عمرو بن العاص قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله لا يرضى لعبده المؤمن إذا ذهب بصفيه من أهل الأرض فصبر واحتسب وقال ما أمر به بثواب دون الجنة ‏\"‏ ‏.‏",
      "text_en": " 'Amr bin sa'eed bin Abi Husain told us that:                     'Amr bin Shu'aib wrote to 'Abdullah bin 'Abdur-Rahman bin Abi Husain to offer condolences for a son of his who had died. In his letter he mentioned that he had heard his father narrate, that his grandfather, 'Abdullah bin 'Amr bin Al-As said: \"The Messenger of Allah said: 'Allah does not approve for His believing slave, if He takes away his loved one from among the people of the Earth, and he bears that with patience and seeks reward, and says that which he is commanded any reward less than Paradise.\"'",
      "chain": [
        "38265",
        "20025",
        "10652",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "2479",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن حسين، عن عمرو بن شعيب، عن أبيه، عن جده، أن امرأة، من أهل اليمن أتت رسول الله صلى الله عليه وسلم وبنت لها في يد ابنتها مسكتان غليظتان من ذهب فقال ‏\"‏ أتؤدين زكاة هذا ‏\"‏ ‏.‏ قالت لا ‏.‏ قال ‏\"‏ أيسرك أن يسورك الله عز وجل بهما يوم القيامة سوارين من نار ‏\"‏ ‏.‏ قال فخلعتهما فألقتهما إلى رسول الله صلى الله عليه وسلم فقالت هما لله ولرسوله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu 'aib, from his father, from his grandfather, that:                     a woman from among the people of Yemen came to the Messenger of Allah with a daughter of hers, and on the daughter's hand were two thick bangles of gold. He said: \"Do you pay Zakah on these? She said: \"No.\" He said: \"Would it please you if Allah were to put two bangles of fire on you on the Day of Resurrection? \" So she took them of and gave them to the Messenger of Allah and said: \"They are for Allah and His Messenger.\"",
      "chain": [
        "34033",
        "20423",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2494",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو عوانة، عن عبيد الله بن الأخنس، عن عمرو بن شعيب، عن أبيه، عن جده، قال سئل رسول الله صلى الله عليه وسلم عن اللقطة فقال ‏\"‏ ما كان في طريق مأتي أو في قرية عامرة فعرفها سنة فإن جاء صاحبها وإلا فلك وما لم يكن في طريق مأتي ولا في قرية عامرة ففيه وفي الركاز الخمس ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:                     \"The Messenger of Allah was asked about Al-Luqath.[2] He said: \"That which is found on a much-traveled road or in an inhabited village, announce it for a year. If its owner comes (and takes it, well and good), otherwise it is yours. That which was not found on a much-traveled road or in an inhabited village is subject to the Khuns, as is Rikaz.\"'[1]",
      "chain": [
        "30367",
        "20469",
        "20444",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2499",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرني المغيرة بن عبد الرحمن، قال حدثنا أحمد بن أبي شعيب، عن موسى بن أعين، عن عمرو بن الحارث، عن عمرو بن شعيب، عن أبيه، عن جده، قال جاء هلال إلى رسول الله صلى الله عليه وسلم بعشور نحل له وسأله أن يحمي له واديا يقال له سلبة فحمى له رسول الله صلى الله عليه وسلم ذلك الوادي فلما ولي عمر بن الخطاب كتب سفيان بن وهب إلى عمر بن الخطاب يسأله فكتب عمر إن أدى إليك ما كان يؤدي إلى رسول الله صلى الله عليه وسلم من عشر نحله فاحم له سلبة ذلك وإلا فإنما هو ذباب غيث يأكله من شاء ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father that his grandfather said:                     \"Hilal came to the Messenger of Allah with one-tenth of the honey and asked him to protect a valley for him that was called Salabah. 'The Messenger of Allah protected that valley for him. When 'Umar bin Al-Khattab became the Khalifah, sufyan bin Wahb wrote the 'Umar and asked him (about that), and Umar wrote: 'If the gives me what he used to give to the Messenger of Allah, one-tenth of his honey, I will protect Salahab for him, otherwise they are just bees and anyone who wants to may eat of it.\"'",
      "chain": [
        "20182",
        "30301",
        "20465",
        "20377",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2540",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، قال حدثنا حسين المعلم، عن عمرو بن شعيب، أن أباه، حدثه عن عبد الله بن عمرو، قال لما فتح رسول الله صلى الله عليه وسلم مكة قام خطيبا فقال في خطبته ‏\"‏ لا يجوز لامرأة عطية إلا بإذن زوجها ‏\"‏ ‏.‏ مختصر ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     \"When the Messenger of Allah conquered Makkah, he stood up to address the people and said in his Khutbah; 'It is not permissible for a woman to give anything without her husband's permission.\"' (He narrated it) in abridged from.",
      "chain": [
        "34033",
        "20226",
        "11278",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "2559",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يزيد، قال حدثنا همام، عن قتادة، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كلوا وتصدقوا والبسوا في غير إسراف ولا مخيلة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:                     \"Eat, give charity and clothe yourselves, without being extravagant, and without showing off.\"",
      "chain": [
        "38022",
        "20472",
        "20297",
        "11019",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2594",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا أحمد بن سليمان، قال أنبأنا يحيى بن آدم، عن سفيان بن عيينة، عن داود بن شابور، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من سأل وله أربعون درهما فهو الملحف ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:                     \"The Messenger of Allah said:  'Whoever asks when he has forty Dirhams I being too demanding when asking.\"'",
      "chain": [
        "38022",
        "20364",
        "20005",
        "13018",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3228",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا إبراهيم بن محمد التيمي، قال حدثنا يحيى، - هو ابن سعيد - عن عبيد الله بن الأخنس، عن عمرو بن شعيب، عن أبيه، عن جده، أن مرثد بن أبي مرثد الغنوي، - وكان رجلا شديدا - وكان يحمل الأسارى من مكة إلى المدينة ‏.‏ قال فدعوت رجلا لأحمله وكان بمكة بغي يقال لها عناق وكانت صديقته خرجت فرأت سوادي في ظل الحائط فقالت من هذا مرثد مرحبا وأهلا يا مرثد انطلق الليلة فبت عندنا في الرحل ‏.‏ قلت يا عناق إن رسول الله صلى الله عليه وسلم حرم الزنا ‏.‏ قالت يا أهل الخيام هذا الدلدل هذا الذي يحمل أسراءكم من مكة إلى المدينة ‏.‏ فسلكت الخندمة فطلبني ثمانية فجاءوا حتى قاموا على رأسي فبالوا فطار بولهم على وأعماهم الله عني فجئت إلى صاحبي فحملته فلما انتهيت به إلى الأراك فككت عنه كبله فجئت إلى رسول الله صلى الله عليه وسلم فقلت يا رسول الله أنكح عناق فسكت عني فنزلت ‏{‏ الزانية لا ينكحها إلا زان أو مشرك ‏}‏ فدعاني فقرأها على وقال ‏\"‏ لا تنكحها ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Amr bin Shu'aib:                     It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that Marthad bin Abi Marthad Al-Ghanawi --a strong man who used to take the prisoners from Makkah to Al-Madinah-- said: \"I arranged with a man to bring him (from Makkah to Al-Madinah). There was a prostitute in Makkah who was called 'Anaq, and she was his friend. She came out and saw my shadow on the wall, and said: 'Who is this? Marthad? Welcome, O Marthad, come tonight and stay at our place.' I said: 'O 'Anaq, the Messenger of Allah has forbidden adultery.' She said: 'O people of the tents, this porcupine is the one who is taking your prisoners from Makkah to Al-Madinah!' I headed toward (the mountain of) Al-Khandamah, and eight men came after me. They came and stood over my head, and they urinated, and their urine reached me, but Allah caused them not to see me. Then I went to my companion (the prisoner) and brought him to Al-Arak, where I undid his fetters. Then I came to the Messenger of Allah and said: 'O Messenger of Allah, shall I marry 'Anaq?' He remained silent and did not answer me, then the following was revealed: 'And the adulteress-fornicator, none marries her except an adulterer-fornicator or an idolater.' He called me and recited them to me and said: 'Do not marry her.'\"",
      "chain": [
        "20031",
        "20444",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3353",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا هلال بن العلاء، قال حدثنا حجاج، قال ابن جريج حدثني عمرو بن شعيب، ح وأخبرني عبد الله بن محمد بن تميم، قال سمعت حجاجا، يقول قال ابن جريج عن عمرو بن شعيب، عن أبيه، عن عبد الله بن عمرو، أن النبي صلى الله عليه وسلم قال ‏\"‏ أيما امرأة نكحت على صداق أو حباء أو عدة قبل عصمة النكاح فهو لها وما كان بعد عصمة النكاح فهو لمن أعطيه وأحق ما أكرم عليه الرجل ابنته أو أخته ‏\"‏ ‏.‏ اللفظ لعبد الله ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin 'Amr:                      \"The Messenger of Allah said: 'Whatever is given as a dowry, or gift or is promised her before the marriage belongs to her. Whatever is given after the marriage belongs to the one to whom it was given. And the most deserving for which a (man) is to be honored is (when marrying off) his daughter or sister.'\" This is the wording of 'Abdullah (one of the narrators).",
      "chain": [
        "38684",
        "20219",
        "11070",
        "19934",
        "20219",
        "11070",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "3668",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن حسين، عن عمرو بن شعيب، عن أبيه، عن جده، أن رجلا، أتى النبي صلى الله عليه وسلم فقال إني فقير ليس لي شىء ولي يتيم‏.‏ قال ‏\"‏ كل من مال يتيمك غير مسرف ولا مباذر ولا متأثل ‏\"‏‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that a man came to the Prophet and said:                      \"I am poor and I do not have anything, and I have an orphan (under my care).\" He said: \"Eat from the property of your orphan without being extravagant, wasteful or keeping it as capital for yourself.\"",
      "chain": [
        "34033",
        "20423",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3688",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Gifts - كتاب الهبة",
      "chapter_no": "32",
      "text_ar": "أخبرنا عمرو بن يزيد، قال حدثنا ابن أبي عدي، قال حدثنا حماد بن سلمة، عن محمد بن إسحاق، عن عمرو بن شعيب، عن أبيه، عن جده، قال كنا عند رسول الله صلى الله عليه وسلم إذ أتته وفد هوازن فقالوا يا محمد إنا أصل وعشيرة وقد نزل بنا من البلاء ما لا يخفى عليك فامنن علينا من الله عليك ‏.‏ فقال ‏\"‏ اختاروا من أموالكم أو من نسائكم وأبنائكم ‏\"‏ ‏.‏ فقالوا قد خيرتنا بين أحسابنا وأموالنا بل نختار نساءنا وأبناءنا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما ما كان لي ولبني عبد المطلب فهو لكم فإذا صليت الظهر فقوموا فقولوا إنا نستعين برسول الله على المؤمنين أو المسلمين في نسائنا وأبنائنا ‏\"‏ ‏.‏ فلما صلوا الظهر قاموا فقالوا ذلك فقال رسول الله صلى الله عليه وسلم ‏\"‏ فما كان لي ولبني عبد المطلب فهو لكم ‏\"‏ ‏.‏ فقال المهاجرون وما كان لنا فهو لرسول الله صلى الله عليه وسلم ‏.‏ وقالت الأنصار ما كان لنا فهو لرسول الله صلى الله عليه وسلم ‏.‏ فقال الأقرع بن حابس أما أنا وبنو تميم فلا ‏.‏ وقال عيينة بن حصن أما أنا وبنو فزارة فلا ‏.‏ وقال العباس بن مرداس أما أنا وبنو سليم فلا ‏.‏ فقامت بنو سليم فقالوا كذبت ما كان لنا فهو لرسول الله صلى الله عليه وسلم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا أيها الناس ردوا عليهم نساءهم وأبناءهم فمن تمسك من هذا الفىء بشىء فله ست فرائض من أول شىء يفيئه الله عز وجل علينا ‏\"‏ ‏.‏ وركب راحلته وركب الناس اقسم علينا فيأنا فألجئوه إلى شجرة فخطفت رداءه فقال ‏\"‏ يا أيها الناس ردوا على ردائي فوالله لو أن لكم شجر تهامة نعما قسمته عليكم ثم لم تلقوني بخيلا ولا جبانا ولا كذوبا ‏\"‏ ‏.‏ ثم أتى بعيرا فأخذ من سنامه وبرة بين أصبعيه ثم يقول ‏\"‏ ها إنه ليس لي من الفىء شىء ولا هذه إلا خمس والخمس مردود فيكم ‏\"‏ ‏.‏ فقام إليه رجل بكبة من شعر فقال يا رسول الله أخذت هذه لأصلح بها بردعة بعير لي ‏.‏ فقال ‏\"‏ أما ما كان لي ولبني عبد المطلب فهو لك ‏\"‏ ‏.‏ فقال أوبلغت هذه فلا أرب لي فيها ‏.‏ فنبذها ‏.‏ وقال ‏\"‏ يا أيها الناس أدوا الخياط والمخيط فإن الغلول يكون على أهله عارا وشنارا يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:                      \"We were with the Messenger of Allah when the delegation of Hawazin came to him and said: 'O Muhammad! We are one of the 'Arab tribes and a calamity has befallen us of which you are well aware. Do us a favor, may Allah bless you.' He said: 'Choose between your wealth or your women and children.' They said: 'You have given us a choice between our families and our wealth; we choose our women and children.' The Messenger of Allah said: 'As for that which was allocated to myself and to Banu 'Abdul-Muttalib, it is yours. When I have prayed Zuhr, stand up and say: \"We seek the help of the Messenger of Allah in dealing with the believers, or the Muslims, with regard to our women and children.\"' So when they prayed Zuhr, they stood up and said that. The Messenger of Allah said: 'As for that which was allocated to myself and to Banu 'Abdul-Muttalib, it is yours.' The Muhajirun said: 'That which was allocated to us is for the Messenger of Allah.' The Ansar said: 'That which was allocated to us is for the Messenger of Allah.' Al-Aqra' bin Habis said: 'As for myself and Banu Tamim, then no (we will not give it up).' 'Uyaynah bin Hisn said: 'As for myself and Banu Fazarah, then no (we will not give it up).' Al-'Abbas bin Mirdas said: 'As for myself and Banu Sulaim, then no (we will not give it up).' Banu Sulaim stood up and said: 'You lied; whatever was allocated to us, it is for the Messenger of Allah.' The Messenger of Allah said: 'O people, give their women and children back to them. Whoever gives back anything of these spoils of war, he will have six camels from the spoils of war that Allah grants us next.' Then he mounted his riding-animal and the people surrounded him, saying: 'Distribute our spoils of war among us.' They made him go back toward a tree on which his Rida' (upper-wrap) got caught. He said: 'O people! Give me back my Rida'. By Allah! If there were cattle as many in number as the trees of Tihamah I would distribute them among you, then you would not find me a miser, a coward or a liar.' Then he went to a camel and took a hair from its hump between two of his fingers and said: 'Look! I do not have any of the spoils of war. All I have is the Khums, and the Khums will be given back to you.' A man stood up holding a ball of yarn made from goat hair and said: 'O Messenger of Allah, I took this to fix my camel-saddle.' He said: 'What was allocated to myself and to Banu 'Abdul-Muttalib is for you.' He said: 'Is this so important? I don't need it!' And he threw it down. He said: 'O people! Give back even needles large and small, for Al-Ghulul will be (a source of) shame and disgrace for those who took it on the Day of Resurrection.'\"",
      "chain": [
        "20276",
        "20021",
        "11107",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3689",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Gifts - كتاب الهبة",
      "chapter_no": "32",
      "text_ar": "أخبرنا أحمد بن حفص، قال حدثني أبي قال، حدثني إبراهيم، عن سعيد بن أبي عروبة، عن عامر الأحول، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يرجع أحد في هبته إلا والد من ولده والعائد في هبته كالعائد في قيئه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:                      \"The Messenger of Allah said: 'No one should take back his gift except a father (taking back a gift) from his son. The one who takes back his gift is like one who goes back to his vomit.'\"",
      "chain": [
        "30293",
        "20420",
        "20150",
        "11073",
        "10693",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3756",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of 'Umra - كتاب العمرى",
      "chapter_no": "34",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا حبان، قال حدثنا حماد بن سلمة، ح وأخبرني إبراهيم بن يونس بن محمد، قال حدثنا أبي قال، حدثنا حماد بن سلمة، عن داود، - وهو ابن أبي هند - وحبيب المعلم عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يجوز لامرأة هبة في مالها إذا ملك زوجها عصمتها ‏\"‏ ‏.‏ اللفظ لمحمد ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that the Messenger of Allah said:                      \"It is not permissible for a woman to give a gift from her wealth, once her husband has marital authority over her.\" This is the wording of (one of the narrators) Muhammad.",
      "chain": [
        "30172",
        "20218",
        "20021",
        "20021",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3757",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of 'Umra - كتاب العمرى",
      "chapter_no": "34",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، قال حدثنا حسين المعلم، عن عمرو بن شعيب، أن أباه، حدثه عن عبد الله بن عمرو، ح وأخبرنا حميد بن مسعدة، قال حدثنا يزيد بن زريع، قال حدثنا حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، قال لما فتح رسول الله صلى الله عليه وسلم مكة قام خطيبا فقال في خطبته ‏\"‏ لا يجوز لامرأة عطية إلا بإذن زوجها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:                      \"When the Messenger of Allah conquered Makkah, he stood up to address (the people) and said in his Khutbah: 'It is not permissible for a woman to give (a gift) except with her husband's permission.'\"",
      "chain": [
        "34033",
        "20423",
        "11278",
        "19934",
        "19911",
        "29",
        "30430",
        "20304",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3781",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، عن عبيد الله بن الأخنس، قال حدثنا عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من حلف على يمين فرأى غيرها خيرا منها فليكفر عن يمينه وليأت الذي هو خير ‏\"‏ ‏.‏",
      "text_en": " 'Amr bin Shu'aib narrated from his father, from his grandfather, that the Messenger of Allah said:                      \"Whoever swears an oath, then sees something better than it, let him do that which is better.\"",
      "chain": [
        "30153",
        "20031",
        "20444",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3792",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا إبراهيم بن محمد، قال حدثنا يحيى، عن عبيد الله بن الأخنس، قال أخبرني عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا نذر ولا يمين فيما لا تملك ولا في معصية ولا قطيعة رحم ‏\"‏ ‏.‏",
      "text_en": " 'Amr bin Shu'aib narrated from his father, from his grandfather, that the Messenger of Allah said:                      \"There is no vow and no oath concerning that which one does not possess, nor to commit sin, nor to sever the ties of kinship.\"",
      "chain": [
        "30020",
        "20444",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4139",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Distribution of Al-Fay' - كتاب قسم الفىء",
      "chapter_no": "38",
      "text_ar": "أخبرنا عمرو بن يزيد، قال حدثنا ابن أبي عدي، قال حدثنا حماد بن سلمة، عن محمد بن إسحاق، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم أتى بعيرا فأخذ من سنامه وبرة بين إصبعيه ثم قال ‏\"‏ إنه ليس لي من الفىء شىء ولا هذه إلا الخمس والخمس مردود فيكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that:                     the Messenger of Allah went to a camel, and took a hair from its hump between his fingers and said: \"I am not entitled to take anything from the Fay, not even this, except the Khumus, and the Khumus will come back to you.\"",
      "chain": [
        "20276",
        "20021",
        "11107",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4212",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-'Aqiqah - كتاب العقيقة",
      "chapter_no": "40",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو نعيم، قال حدثنا داود بن قيس، عن عمرو بن شعيب، عن أبيه، عن جده، قال سئل رسول الله صلى الله عليه وسلم عن العقيقة فقال ‏\"‏ لا يحب الله عز وجل العقوق ‏\"‏ ‏.‏ وكأنه كره الاسم قال لرسول الله صلى الله عليه وسلم إنما نسألك أحدنا يولد له ‏.‏ قال ‏\"‏ من أحب أن ينسك عن ولده فلينسك عنه عن الغلام شاتان مكافأتان وعن الجارية شاة ‏\"‏ ‏.‏ قال داود سألت زيد بن أسلم عن المكافأتان قال الشاتان المشبهتان تذبحان جميعا ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shuaib, from his fahther, that his grandfather said:                     \"The messenger of Allah was asked about the 'Aqiqah and he said: \"Allah, the mighty and sublime, does not like Al-Uquq' as if he disliked the word (Al-Aqiqah). He said to the Messenger of Allah: 'But one of us may offer a sacrifice when a child is born to him.' He said: 'Whoever wants to offer a sacrifice for his child, let him do so, for a boy; two sheep, Mukafaatan, (of equal age), and for a girl, one.' (One of the narrators) Dawud said: 'I asked Ziad bin Aslam about the word Mukafaatan and he said: 'Two similar sheep that are slaughtered together.",
      "chain": [
        "38022",
        "20348",
        "11845",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4296",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا ابن سواء، قال حدثنا سعيد، عن أبي مالك، عن عمرو بن شعيب، عن أبيه، عن جده، أن رجلا، أتى النبي صلى الله عليه وسلم فقال يا رسول الله إن لي كلابا مكلبة فأفتني فيها ‏.‏ قال ‏\"‏ ما أمسك عليك كلابك فكل ‏\"‏ ‏.‏ قلت وإن قتلن قال ‏\"‏ وإن قتلن ‏\"‏ ‏.‏ قال أفتني في قوسي ‏.‏ قال ‏\"‏ ما رد عليك سهمك فكل ‏\"‏ ‏.‏ قال وإن تغيب على قال ‏\"‏ وإن تغيب عليك ما لم تجد فيه أثر سهم غير سهمك أو تجده قد صل ‏\"‏ ‏.‏ يعني قد أنتن ‏.‏ قال ابن سواء وسمعته من أبي مالك عبيد الله بن الأخنس عن عمرو بن شعيب عن أبيه عن جده عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from 'Arm bin Shu'aib, from his father, from his grandfather, that:                     a man came to the Prophet and said: \"O Messenger of Allah, I have trained dogs; advise me concerning them.\"  He said: \"Whatever your dogs catch for you, eat,\" I side: \"Even if they kill it?\" He said: \"Even if they kill it. \" He said: \"Advise me about my bow. \"He said: \"Whatever your arrow returns to you, eat.\" He said: \"Even if it gets away from you, so long as you do not find the mark of an arrow other than yours on it, or you find that it has gone rotten.\"(Another chain).",
      "chain": [
        "30153",
        "11168",
        "10766",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4447",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرني عثمان بن عبد الله، قال حدثني سهل بن بكار، قال حدثنا وهيب بن خالد، عن ابن طاوس، عن عمرو بن شعيب، عن أبيه، محمد بن عبد الله بن عمرو قال مرة عن أبيه، وقال، مرة عن جده، أن رسول الله صلى الله عليه وسلم نهى يوم خيبر عن لحوم الحمر الأهلية وعن الجلالة وعن ركوبها وعن أكل لحمها ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his father Muhammad bin 'Abdullah bin 'Amr - or on one occasion he said:                     from his father, form his grandfather - the on the Day of Kahaibar, the Messenger of Allah forbade the flesh of domesticated donkeys and of al-Jallalah (animals that eat dung), and (he forbade) riding them and eating their mat.\"",
      "chain": [
        "11524",
        "30138",
        "20299",
        "11433",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4483",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال أنبأنا الليث، عن ابن عجلان، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال ‏\"‏ المتبايعان بالخيار ما لم يتفرقا إلا أن يكون صفقة خيار ولا يحل له أن يفارق صاحبه خشية أن يستقيله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father , form his grandfather, that the Prophet said:                     \"The two parties to a transaction have the choicer so long as they have not separated, unless they reach an agreement before parting, and it is not permissible to hasten to leave for fear that the other party may change his mind.\"",
      "chain": [
        "30367",
        "20023",
        "10616",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4611",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عمرو بن علي، وحميد بن مسعدة، عن يزيد، قال حدثنا أيوب، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يحل سلف وبيع ولا شرطان في بيع ولا بيع ما ليس عندك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from'Amr bin Shu'aib, from his father that his grandfather, Said:                     that the Messenger of Allah said: \"It is not permissible to lend on the condition of a sale, or to have two conditions in one transaction, or to sell what you do not have.\" (Sahih",
      "chain": [
        "30153",
        "30430",
        "20304",
        "11015",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4612",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عثمان بن عبد الله، قال حدثنا سعيد بن سليمان، عن عباد بن العوام، عن سعيد بن أبي عروبة، عن أبي رجاء، - قال عثمان هو محمد بن سيف - عن مطر الوراق، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس على رجل بيع فيما لا يملك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:                     \"The Messenger of Allah said: 'No man is bound by a transaction involving the sale of something that he does not possess.'''",
      "chain": [
        "11524",
        "30252",
        "20431",
        "11073",
        "11440",
        "10719",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4629",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا إسماعيل بن مسعود، عن خالد، عن حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم نهى عن سلف وبيع وشرطين في بيع وربح ما لم يضمن ‏.‏",
      "text_en": " It was narrated from 'Amr bin shu'aib, from his father, from his grandfather, that:                     the Messenger of Allah prohibited lending on the condition of a sale, or to have two conditions in one transaction, or to profit from what you do not posses.",
      "chain": [
        "34033",
        "20423",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4630",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا زياد بن أيوب، قال حدثنا ابن علية، قال حدثنا أيوب، قال حدثنا عمرو بن شعيب، قال حدثني أبي، عن أبيه، حتى ذكر عبد الله بن عمرو قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يحل سلف وبيع ولا شرطان في بيع ولا ربح ما لم يضمن ‏\"‏ ‏.‏",
      "text_en": " 'Amr bin shu'aib said:                     \"My father told me, mar rating from his father, from his father (and he mentioned 'Abdullah bin 'Amr) that he said: \"The Messenger of Allah said: \"It is not permissible to lend on the condition of a sale, or to stipulate two conditions in one transaction, or to make a profit on that which you do not possess.",
      "chain": [
        "30249",
        "20208",
        "11015",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "4631",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن رافع، قال حدثنا عبد الرزاق، قال حدثنا معمر، عن أيوب، عن عمرو بن شعيب، عن أبيه، عن جده، قال نهى رسول الله صلى الله عليه وسلم عن سلف وبيع وعن شرطين في بيع واحد وعن بيع ما ليس عندك وعن ربح ما لم يضمن ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:                     \"The Messenger of Allah forbade lending on the condition of a sale, selling what you do not have, and profiting on what you do not possess.",
      "chain": [
        "30375",
        "20121",
        "20115",
        "11015",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4720",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا روح بن عبادة، قال حدثنا عبيد الله بن الأخنس، عن عمرو بن شعيب، عن أبيه، عن جده، أن ابن محيصة الأصغر، أصبح قتيلا على أبواب خيبر فقال رسول الله صلى الله عليه وسلم ‏\"‏ أقم شاهدين على من قتله أدفعه إليكم برمته ‏\"‏ ‏.‏ قال يا رسول الله ومن أين أصيب شاهدين وإنما أصبح قتيلا على أبوابهم قال ‏\"‏ فتحلف خمسين قسامة ‏\"‏ ‏.‏ قال يا رسول الله وكيف أحلف على ما لا أعلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ فنستحلف منهم خمسين قسامة ‏\"‏ ‏.‏ فقال يا رسول الله كيف نستحلفهم وهم اليهود فقسم رسول الله صلى الله عليه وسلم ديته عليهم وأعانهم بنصفها ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that:                     the younger son of Muhayysah was found slain one morning at the gate of one morning at the gates of Khaibar. The Messenger of Allah said: \"Bring two witnesses to (say) who killed him, and he will hand him over to you.\" He said: \"O Messenger of Allah, where shall I get two witnesses? He was found slain in the morning at their gates.\" He said: \"Will you swear fifty oaths?\" He said: \"O Messenger of Allah, how can I swear concerning something I do not know?\" The Messenger of Allah said: \"Then will you accept fifty oaths from them?\"  He said: \"O Messenger of Allah, how can we accept their oaths when they are Jews?\" So the Messenger of Allah told them (the Jews) to pay the Diyah and he would help them with half.\"",
      "chain": [
        "30172",
        "20229",
        "20444",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4801",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يزيد بن هارون، قال أنبأنا محمد بن راشد، عن سليمان بن موسى، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قتل خطأ فديته مائة من الإبل ثلاثون بنت مخاض وثلاثون بنت لبون وثلاثون حقة وعشرة بني لبون ذكور ‏\"‏ ‏.‏ قال وكان رسول الله صلى الله عليه وسلم يقومها على أهل القرى أربعمائة دينار أو عدلها من الورق ويقومها على أهل الإبل إذا غلت رفع في قيمتها وإذا هانت نقص من قيمتها على نحو الزمان ما كان فبلغ قيمتها على عهد رسول الله صلى الله عليه وسلم ما بين الأربعمائة دينار إلى ثمانمائة دينار أو عدلها من الورق ‏.‏ قال وقضى رسول الله صلى الله عليه وسلم أن من كان عقله في البقر على أهل البقر مائتى بقرة ومن كان عقله في الشاة ألفى شاة وقضى رسول الله صلى الله عليه وسلم أن العقل ميراث بين ورثة القتيل على فرائضهم فما فضل فللعصبة وقضى رسول الله صلى الله عليه وسلم أن يعقل على المرأة عصبتها من كانوا ولا يرثون منه شيئا إلا ما فضل عن ورثتها وإن قتلت فعقلها بين ورثتها وهم يقتلون قاتلها ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that the Messenger of Allah said:                     \"Whoever is killed by mistake, his ransom is one hundred camels: Thirty Bint Makkah, thirty Bint Labun, thirty Hiqqah and ten Bin Labun. \"[1] The Messenger of Allah used to fix the value (of the Diayah for accidental killing) among town-dwellers at four hundred Dinars or the equivalent value in silver. When he calculated the price in terms of people with camels (for Bedouin), it would vary from one time to another. When prices rose, the value in Dinars would rise, and when prices fell the value in Dinars would fall. At the time of the Messenger of Allah the value was between four hundred and eight hundred Dinars, or the equivalent value in silver, eight thousand Dirhams. And the Messenger of Allah ruled that if a person's blood money was paid in cattle, among those who kept cattle, the amount was two hundred cows; and if a person's blood money was paid in sheep, among this who kept sheep, the value was two thousand sheep. The Messenger of Allah ruled that the blood money is part of the estate, to be divided among the heirs of the victim according to their allotted shares, and whatever is left over is for the 'Asabah. And the Messenger of Allah ruled that if a woman commits urder then he 'Asahah, whoever they may be, must pay the blood money, but they do not inherit anything except that which is left over from her heirs; if a woman is killed then her blood money is to be shared among her heirs, and they may kill her killer. (Hasah)",
      "chain": [
        "38022",
        "20472",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4805",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا عيسى بن يونس، قال حدثنا ضمرة، عن إسماعيل بن عياش، عن ابن جريج، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ عقل المرأة مثل عقل الرجل حتى يبلغ الثلث من ديتها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:                     \"The Messenger of Allah said: 'The blood money of a woman (in the event of injury) is like the blood money of a man, up to one-third of the Diyah (for her life).\"",
      "chain": [
        "20347",
        "20738",
        "20736",
        "11070",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4806",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا عبد الرحمن، عن محمد بن راشد، عن سليمان بن موسى، وذكر، كلمة معناها عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ عقل أهل الذمة نصف عقل المسلمين ‏\"‏ ‏.‏ وهم اليهود والنصارى ‏.‏",
      "text_en": " It was narrated from 'Amr Bin Shu'aib, from his father, that his grandfather said:                     \"The Messenger of Allah said: 'The blood money for Ahl Adh-Dhimmah is half that of the blood money for the Muslims, and they are the Jews and Christians.\"",
      "chain": [
        "30153",
        "20033",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4807",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن عمرو بن السرح، قال أنبأنا ابن وهب، قال أخبرني أسامة بن زيد، عن عمرو بن شعيب، عن أبيه، عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ عقل الكافر نصف عقل المؤمن ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from 'Abdullah bin 'Amr, that the Messenger of Allah said:                     \"The blood money for a disbeliever is half the blood money for the believer.\" (Hassan)",
      "chain": [
        "30485",
        "20029",
        "50",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "4830",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرني عمرو بن عثمان، ومحمد بن مصفى، قالا حدثنا الوليد، عن ابن جريج، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من تطبب ولم يعلم منه طب قبل ذلك فهو ضامن ‏\"‏ ‏.‏",
      "text_en": " It was narrated from'Amrbin shu'aib, from his father that his grandfather said:                     \"the Messenger of Allah said: 'Whoever practices medicine when he is not known for that, he is liable.(Daif)",
      "chain": [
        "10581",
        "20733",
        "11070",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4831",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرني محمود بن خالد، قال حدثنا الوليد، عن ابن جريج، عن عمرو بن شعيب، عن أبيه، عن جده، مثله سواء ‏.‏",
      "text_en": " Narrator mentioned in hadith:                     A similar report was narrated from 'Amr bin shu'aib, from his father, from his grandfather. (Daif)",
      "chain": [
        "37534",
        "20733",
        "11070",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4840",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن إبراهيم بن محمد، قال أنبأنا ابن عائذ، قال حدثنا الهيثم بن حميد، قال أخبرني العلاء، - وهو ابن الحارث - عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قضى في العين العوراء السادة لمكانها إذا طمست بثلث ديتها وفي اليد الشلاء إذا قطعت بثلث ديتها وفي السن السوداء إذا نزعت بثلث ديتها ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that:                     the Messenger of Allah ruled that one-third of the Diyah should be paid for a sightless eye that looks fine, if it is destroyed; one-third of the Diyah should be paid for a paralyzed hand if it is cut off; and one-third of the Diyah should be paid for a black tooth if it is knocked out.",
      "chain": [
        "30494",
        "20744",
        "10884",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4841",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن معاوية، قال حدثنا عباد، عن حسين، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ في الأسنان خمس من الإبل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from'Amr bin Shu'aib, from his father that his grandfather said;the Messenger of Allah said:                      \"For teeth (the Diyah is) five camels.",
      "chain": [
        "20431",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4842",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا الحسين بن منصور، قال حدثنا حفص بن عبد الرحمن، قال حدثنا سعيد بن أبي عروبة، عن مطر، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الأسنان سواء خمسا خمسا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin shu'aib, from his father, that his grandfather said:                     The Messenger of Allah said: \"For teeth (the Diyah is ) the same, five camels for each.'",
      "chain": [
        "38181",
        "28123",
        "11073",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4850",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، قال حدثنا حسين المعلم، عن عمرو بن شعيب، أن أباه، حدثه عن عبد الله بن عمرو، قال لما افتتح رسول الله صلى الله عليه وسلم مكة قال في خطبته ‏\"‏ وفي الأصابع عشر عشر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     \"When the Messenger of Allah conquered Makkah, he said in his Khutbah: \"(The Diyah) for fingers is ten each.\"",
      "chain": [
        "34033",
        "20226",
        "11278",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "4851",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرني عبد الله بن الهيثم، قال حدثنا حجاج، قال حدثنا همام، قال حدثنا حسين المعلم، وابن، جريج عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال في خطبته وهو مسند ظهره إلى الكعبة ‏\"‏ الأصابع سواء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that the Messengerof Allah (ﷺ) said in his khutbah, while he was leaning with his back against the Ka'bah:                      \"The fingers are the same.\"",
      "chain": [
        "34121",
        "20219",
        "20297",
        "11278",
        "11070",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4852",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، قال حدثنا حسين المعلم، عن عمرو بن شعيب، أن أباه، حدثه عن عبد الله بن عمرو، قال لما افتتح رسول الله صلى الله عليه وسلم مكة قال في خطبته ‏\"‏ وفي المواضح خمس خمس ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib that his father told him that 'Abdullah bin 'Amr said:                      \"When the Messenger of Allah (ﷺ) conquered Makkah , he said in his Khutbah: 'For any wound that exposes the bone, the diyah is five (camels) each.'\"",
      "chain": [
        "34033",
        "20226",
        "11278",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "4885",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا محمد بن هاشم، قال حدثنا الوليد، قال حدثنا ابن جريج، عن عمرو بن شعيب، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم قال ‏\"‏ تعافوا الحدود قبل أن تأتوني به فما أتاني من حد فقد وجب ‏\"‏ ‏.‏",
      "text_en": " It was narrated form 'Amr bin Shu'ainb, from his father, from his grandfather, that the Prophet said:                     \"Pardon matters that may deserve a Hadd punishment before you bring it to my attention, for whatever is brought to my attention, the Hadd punishment becomes binding.\" (Saif)",
      "chain": [
        "20733",
        "11070",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4886",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "قال الحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن وهب، قال سمعت ابن جريج، يحدث عن عمرو بن شعيب، عن أبيه، عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ تعافوا الحدود فيما بينكم فما بلغني من حد فقد وجب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib from his father, from' Abdullah bin 'Amr that the Messenger of Allah said:                     \"Pardon matters among yourselves that may deserve a Hadd punishment, for whatever is brought to my attention, the Hadd punishment b becomes binding.\" (Daif)",
      "chain": [
        "36017",
        "20029",
        "11070",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "4956",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا خلاد بن أسلم، عن عبد الله بن إدريس، عن محمد بن إسحاق، عن عمرو بن شعيب، عن أبيه، عن جده، قال كان ثمن المجن على عهد رسول الله صلى الله عليه وسلم عشرة دراهم ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shuaib, from his father, that his grandfather said:                     \"The price of a shield at the time of the Messenger of Allah was ten Dirhams.\"",
      "chain": [
        "36553",
        "20102",
        "11107",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4957",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا قتيبة، قال حدثنا أبو عوانة، عن عبيد الله بن الأخنس، عن عمرو بن شعيب، عن أبيه، عن جده، قال سئل رسول الله صلى الله عليه وسلم في كم تقطع اليد قال ‏\"‏ لا تقطع اليد في ثمر معلق فإذا ضمه الجرين قطعت في ثمن المجن ولا تقطع في حريسة الجبل فإذا آوى المراح قطعت في ثمن المجن ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shuaib, from his father, that his grandfather said:                     \"The Messenger of Allah was asked: 'For how much is the hand (of the thief) to be cut off?' He said: 'The hand (of the thief) is not to be cut off for (stealing) fruit on the tree, but if (the fruit) has been taken to the place where it is stored to dry, then the (thief's) hand is to be cut off (if what is stolen is equivalent to) the price of a shield. The (thief's) hand is not to be cut off for a sheep (stolen) from the grazing land, but if it had been put in the pen, then the (thief's) hand is to be cut off (if what is stolen is equivalent to) the price of a shield.\"'",
      "chain": [
        "30367",
        "20469",
        "20444",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "4958",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن ابن عجلان، عن عمرو بن شعيب، عن أبيه، عن جده عبد الله بن عمرو، عن رسول الله صلى الله عليه وسلم أنه سئل عن الثمر المعلق فقال ‏\"‏ ما أصاب من ذي حاجة غير متخذ خبنة فلا شىء عليه ومن خرج بشىء منه فعليه غرامة مثليه والعقوبة ومن سرق شيئا منه بعد أن يئويه الجرين فبلغ ثمن المجن فعليه القطع ومن سرق دون ذلك فعليه غرامة مثليه والعقوبة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shuaib, from his father, that his grandfather 'Abdullah bin 'Amr, that the Messenger of Allah wsa asked about fruit on the tree. He said:                     \"Whatever a needy person takes without putting any in his pocket (and taking it away), there is no penalty on him. But whoever takes anything away, he must pay a penalty of twice its value, and be punished. Whoever steals something after it has been stored properly, and its value is equal to that of a shield, his hand must be cut off. Whoever steals something worth less than that, he must pay a penalty of twice its value and be punished.\"",
      "chain": [
        "30367",
        "20023",
        "10616",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "4959",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "قال الحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن وهب، قال أخبرني عمرو بن الحارث، وهشام بن سعد، عن عمرو بن شعيب، عن أبيه، عن جده عبد الله بن عمرو، أن رجلا، من مزينة أتى رسول الله صلى الله عليه وسلم فقال يا رسول الله كيف ترى في حريسة الجبل فقال ‏\"‏ هي ومثلها والنكال وليس في شىء من الماشية قطع إلا فيما آواه المراح فبلغ ثمن المجن ففيه قطع اليد وما لم يبلغ ثمن المجن ففيه غرامة مثليه وجلدات نكال ‏\"‏ ‏.‏ قال يا رسول الله كيف ترى في الثمر المعلق قال ‏\"‏ هو ومثله معه والنكال وليس في شىء من الثمر المعلق قطع إلا فيما آواه الجرين فما أخذ من الجرين فبلغ ثمن المجن ففيه القطع وما لم يبلغ ثمن المجن ففيه غرامة مثليه وجلدات نكال ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shuaib, from his father, that his grandfather 'Abdullah bin 'Amr, that a man from Muzainah came to the Messenger of Allah and said:                     'O Messenger of Allah, what do you think about a sheep stolen from the pasture?\" He said: \"(The thief must pay) double and be punished. There is no cutting off of the hand for (stealing) livestock, except what which has been put in the pen, if its value is equal to that of a shield, in which case the (thief's) hand is to be cut off. If its value is not equal to that of a shield, then he should pay a penalty of twice its value and be flogged as a punishment.\" He said: \"O Messenger of Allah! What do you think about fruit on the tree?\" He said: \"(The thief must pay) double and be punished. There is no cutting off of the hand for (stealing) fruit on the tree, except for that which has been stored properly if its value is equal to that of a shield, in which case the (thief's) hand is not equal to that of a shield, then he should pay a penalty of twice its value and be flogged as a punishment.\"",
      "chain": [
        "36017",
        "20029",
        "20377",
        "20519",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "5068",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا قتيبة، عن عبد العزيز، عن عمارة بن غزية، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم نهى عن نتف الشيب ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that:                     The Messenger of Allah [SAW] forbade plucking gray hairs.",
      "chain": [
        "30367",
        "20167",
        "11894",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "5490",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا محمد بن عبد الله بن عبد الحكم، عن شعيب، عن الليث، عن يزيد بن الهاد، عن عمرو بن شعيب، عن أبيه، عن جده، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ اللهم إني أعوذ بك من الكسل والهرم والمغرم والمأثم وأعوذ بك من شر المسيح الدجال وأعوذ بك من عذاب القبر وأعوذ بك من عذاب النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:                     \"I heard the Messenger of Allah [SAW] say: 'Allahumma inni a'udhu bika minal-kasali, walharami, wal-maghrami, wal-ma'thami, wa a'udhu bika min sharril-masihid-dajjali, wa a'udhu bika min 'adhabil-qabri, wa a'udhu bika min 'adhabin-nar (O Allah, I seek refuge in You from laziness, old age, debt and sin, and I seek refuge in You from the evil of the Al-Masihid-Dajjal, and I seek refuge in You from the torment of the grave, and I seek refuge in You from the punishment of the Fire.)'\"",
      "chain": [
        "36056",
        "20428",
        "20023",
        "11234",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "5607",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا يحيى، - يعني ابن سعيد - عن عبيد الله، قال حدثنا عمرو بن شعيب، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم قال ‏\"‏ ما أسكر كثيره فقليله حرام ‏\"‏ ‏.‏",
      "text_en": " 'Amr bin Shu'aib narrated from his father, from his grandfather, that:                     The Prophet [SAW] said: \"What intoxicates in large amounts, a small amount of it is unlawful.\"",
      "chain": [
        "30359",
        "20031",
        "11201",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "9",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا القاسم بن نافع، حدثنا الحجاج بن أرطاة، عن عمرو بن شعيب، عن أبيه، قال قام معاوية خطيبا فقال أين علماؤكم أين علماؤكم سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ لا تقوم الساعة إلا وطائفة من أمتي ظاهرون على الناس لا يبالون من خذلهم ولا من نصرهم ‏\"‏ ‏.‏",
      "text_en": " Amr bin Shu'aib narrated that:                     His father said: \"Mu'awiyah stood up to deliver a sermon and said: 'Where are your scholars? Where are your scholars?  For I heard the Messenger of Allah (ﷺ) say: The Hour will not begin until a group of my Ummah will prevail over the people, and they will not care who lets them down and who supports them.\"",
      "chain": [
        "32048",
        "20580",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "90",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو معاوية، حدثنا داود بن أبي هند، عن عمرو بن شعيب، عن أبيه، عن جده، قال خرج رسول الله  صلى الله عليه وسلم  على أصحابه وهم يختصمون في القدر فكأنما يفقأ في وجهه حب الرمان من الغضب فقال ‏\"‏ بهذا أمرتم أو لهذا خلقتم تضربون القرآن بعضه ببعض ‏.‏ بهذا هلكت الأمم قبلكم ‏\"‏ ‏.‏ قال فقال عبد الله بن عمرو ما غبطت نفسي بمجلس تخلفت فيه عن رسول الله  صلى الله عليه وسلم  ما غبطت نفسي بذلك المجلس وتخلفي عنه.‏",
      "text_en": " 'Amr in Shu'aib narrated from his father that his grandfather said:                     \"The Messenger of Allah (ﷺ) came out to his Companions when they were disputing about the Divine Decree, and it was as if pomegranate seeds had burst on his face (i.e. turned red) because of anger. He said: 'Have you been commanded to do this, or were you created for this purpose? You are using one part of the Qur'an against another part, and this is what led to the doom of the nations who came before you.'\" 'Abdullah bin 'Amr said: \"I was never happy to have missed a gathering with the Messenger of Allah (ﷺ) as I was to have missed that gathering.'\"",
      "chain": [
        "38409",
        "20354",
        "11585",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "457",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن محمد، حدثنا خالي، يعلى عن سفيان، عن موسى بن أبي عائشة، عن عمرو بن شعيب، عن أبيه، عن جده، قال جاء أعرابي إلى النبي  صلى الله عليه وسلم  فسأله عن الوضوء فأراه ثلاثا ثلاثا ثم قال ‏\"‏ هذا الوضوء فمن زاد على هذا فقد أساء وتعدى أو ظلم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib from his father, from his grandfather, that:                     A Bedouin came to the Prophet and asked him about ablution. He showed him how to perform it washing each part of the body three times. Then he said: 'This is the ablution, and whoever does more than this, has done evil, transgressed the limits and wronged himself.'\"",
      "chain": [
        "38409",
        "20005",
        "11399",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "654",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو معاوية، عن حجاج، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا التقى الختانان وتوارت الحشفة فقد وجب الغسل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib from his father, that his grandfather said:                     \"The Messenger of Allah said: 'When the two circumcised parts meet, and (the tip of the penis) disappears, then bath is obligatory.'\"",
      "chain": [
        "30201",
        "20354",
        "20219",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "749",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن سعيد الكندي، حدثنا أبو خالد الأحمر، عن ابن عجلان، عن عمرو بن شعيب، عن أبيه، عن جده، قال نهى رسول الله  صلى الله عليه وسلم  عن البيع والابتياع وعن تناشد الأشعار في المساجد ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib from his father that his grandfather said:                     \"The Messenger of Allah forbade buying and selling in the mosque, and reciting poetry in the mosque.\"",
      "chain": [
        "30200",
        "20326",
        "10616",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "766",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن رمح، أنبأنا ابن لهيعة، ح وحدثنا أبو كريب، حدثنا حاتم بن إسماعيل، جميعا عن ابن عجلان، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله  صلى الله عليه وسلم  نهى عن إنشاد الضالة في المسجد ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib from his father, from his grandfather that:                     The Messenger of Allah forbade making lost-and-found announcements in the mosque.",
      "chain": [
        "30490",
        "20624",
        "30216",
        "20159",
        "10616",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "890",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا الوليد بن عمرو بن السكين، حدثنا يوسف بن يعقوب السلعي، حدثنا حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ كل صلاة لا يقرأ فيها بفاتحة الكتاب فهي خداج فهي خداج ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that from ‘Amr bin Shu’aib, from his father, from hisgrandfather, that the Messenger of Allah (ﷺ) said:                      “Every prayerinwhich Fatihatil-Kitab (the Opening of the Book) is not recited, itisdeficient, it is deficient.”",
      "chain": [
        "34278",
        "20305",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "984",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا يزيد بن زريع، عن حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، قال رأيت النبي  صلى الله عليه وسلم  ينفتل عن يمينه وعن يساره في الصلاة ‏.‏",
      "text_en": " It wasnarrated from ‘Amr bin Shu’aib, from his father, that hisgrandfather said:                      “I saw the Prophet (ﷺ) departing to his rightandto his left when he finished the prayer.”",
      "chain": [
        "30537",
        "20304",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1091",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بشر بن هلال الصواف، حدثنا يزيد بن زريع، عن حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، قال رأيت رسول الله  صلى الله عليه وسلم  يصلي حافيا ومنتعلا ‏.‏",
      "text_en": " It wasnarrated from ‘Amr bin Shu’aib, from his father, that hisgrandfather said:                      “I saw the Messenger of Allah (ﷺ) performingprayer both barefoot, and while wearing sandals.”",
      "chain": [
        "30537",
        "20304",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1187",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو كريب، حدثنا حاتم بن إسماعيل، ح وحدثنا محمد بن رمح، أنبأنا ابن لهيعة، جميعا عن ابن عجلان، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله  صلى الله عليه وسلم  نهى أن يحلق في المسجد يوم الجمعة قبل الصلاة ‏.‏",
      "text_en": " It wasnarrated from ‘Amr bin Shu’aib, from his father, from hisgrandfather, that the Messenger of Allah (ﷺ) forbade sitting incircles in the mosque on Fridays before the prayer.",
      "chain": [
        "30216",
        "20159",
        "30490",
        "20624",
        "10616",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1188",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، حدثنا بقية، عن عبد الله بن واقد، عن محمد بن عجلان، عن عمرو بن شعيب، عن أبيه، عن جده، قال نهى رسول الله  صلى الله عليه وسلم  عن الاحتباء يوم الجمعة - يعني - والإمام يخطب ‏.‏",
      "text_en": " It wasnarrated from ‘Amr bin Shu’aib, from his father, that hisgrandfather said:                      “The Messenger of Allah (ﷺ) forbade Ihtiba’onFridays, meaning, when the Imam is delivering the sermon.”",
      "chain": [
        "20644",
        "10616",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1337",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا عبد الله بن المبارك، عن عبد الله بن عبد الرحمن بن يعلى، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي  صلى الله عليه وسلم  كبر في صلاة العيد سبعا وخمسا ‏.‏",
      "text_en": " It wasnarrated from ‘Amr bin Shu’aib, from his father, from hisgrandfather, that the Prophet (ﷺ) said the Takbir seven times andfive times in the ‘Eid prayer.",
      "chain": [
        "30216",
        "20025",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1351",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا عبد الله بن عبد الرحمن الطائفي، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي  صلى الله عليه وسلم  لم يصل قبلها ولا بعدها في عيد ‏.‏",
      "text_en": " It wasnarrated from ‘Amr bin Shu’aib, from his father, from hisgrandfather, that the Prophet (ﷺ) did not pray before or after the‘Eid prayer.",
      "chain": [
        "38409",
        "20032",
        "20658",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1887",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا هشام بن عمار، حدثنا إسماعيل بن عياش، عن محمد بن عبيد الله، عن عمرو بن شعيب، عن أبيه، عن جده، قال إنما سن رسول الله  صلى الله عليه وسلم  الزكاة في هذه الخمسة في الحنطة والشعير والتمر والزبيب والذرة ‏.‏",
      "text_en": " It was narrated from Amr bin:                     Shu'aib, form his father, that his grandfather said: “The Messenger of Allah only prescribed Zakat on these five things: wheat, barley, dates, raisins and corn.”",
      "chain": [
        "30288",
        "20736",
        "30213",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1896",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا نعيم بن حماد، حدثنا ابن المبارك، حدثنا أسامة بن زيد، عن عمرو بن شعيب، عن أبيه، عن جده عبد الله بن عمرو، عن النبي  صلى الله عليه وسلم  أنه أخذ من العسل العشر ‏.‏",
      "text_en": " Abdullah bin 'Amr narrated that:                     the Prophet took one-tenth of honey (as Zakat).",
      "chain": [
        "11222",
        "30238",
        "20025",
        "50",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "1993",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن يحيى، وصالح بن محمد بن يحيى القطان، قالا حدثنا عبيد الله بن موسى، حدثنا سفيان، عن محمد بن عجلان، عن عمرو بن شعيب، عن أبيه، عن جده عبد الله بن عمرو، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ إذا أفاد أحدكم امرأة أو خادما أو دابة فليأخذ بناصيتها وليقل اللهم إني أسألك من خيرها وخير ما جبلت عليه وأعوذ بك من شرها وشر ما جبلت عليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Amr:                     that the Prophet said: “When anyone of you gets a new wife, a servant, or an animal, let him take hold of the forelock and say: Allahumma inni as`aluka min khayriha wa khayri ma jubilat 'alaihi, wa 'audhu bika min sharriha wa sharri ma jubilat `alaih (O Allah, I ask You for the goodness within her and the goodness that she is inclined towards, and I seek refuge with you from the evil to which she is inclined).' ”",
      "chain": [
        "11222",
        "19807",
        "20340",
        "20012",
        "10616",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "2031",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو خالد، عن ابن جريج، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ما كان من صداق أو حباء أو هبة قبل عصمة النكاح فهو لها وما كان بعد عصمة النكاح فهو لمن أعطيه أو حبي وأحق ما يكرم الرجل به ابنته أو أخته ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:                     “The Messenger of Allah said: “Whatever is given as a dowry or gift before the marriage, it belongs to her. Whatever is given after the marriage belongs to the one to whom it was given. And the most deserving matter for which a man is honored is (the marriage of) his daughter or sister.”",
      "chain": [
        "30216",
        "11070",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2088",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو معاوية، عن حجاج، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله  صلى الله عليه وسلم  رد ابنته زينب على أبي العاص بن الربيع بنكاح جديد ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grand father, that:                     the Messenger of Allah, returned his daughter Zainab to Abul-As bin Rabi', with a new marriage contract.",
      "chain": [
        "30216",
        "20354",
        "20219",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2116",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عمرو بن أبي سلمة أبو حفص التنيسي، عن زهير، عن ابن جريج، عن عمرو بن شعيب، عن أبيه، عن جده، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ إذا ادعت المرأة طلاق زوجها فجاءت على ذلك بشاهد عدل استحلف زوجها فإن حلف بطلت شهادة الشاهد وإن نكل فنكوله بمنزلة شاهد آخر وجاز طلاقه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that:                     the Prophet (ﷺ) said: \"If a woman claims that her husband has divorced her, and she brings a witness of good character (to testify) to that, her husband should be asked to swear an oath. If he swears, that will invalidate the testimony of the witness, but if he refuses then that will be equivalent to a second witness, and the divorce will take effect.\"",
      "chain": [
        "11222",
        "20321",
        "11070",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2125",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو كريب، حدثنا هشيم، أنبأنا عامر الأحول، ح وحدثنا أبو كريب، حدثنا حاتم بن إسماعيل، عن عبد الرحمن بن الحارث، جميعا عن عمرو بن شعيب، عن أبيه، عن جده، ‏.‏ أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لا طلاق فيما لا يملك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from \"Amr bin Shu'aib, from his father, from his grandfather, that:                     the Messenger of Allah said : \"There is no divorce regarding that which one does not possess.\"",
      "chain": [
        "30216",
        "20468",
        "10693",
        "30216",
        "20159",
        "448",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2135",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو خالد الأحمر، عن حجاج، عن عمرو بن شعيب، عن أبيه، عن جده، قال كانت حبيبة بنت سهل تحت ثابت بن قيس بن شماس وكان رجلا دميما ‏.‏ فقالت يا رسول الله والله لولا مخافة الله إذا دخل على لبصقت في وجهه فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ أتردين عليه حديقته ‏\"‏ ‏.‏ قالت نعم ‏.‏ قال فردت عليه حديقته ‏.‏ قال ففرق بينهما رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:                     \"Habibah bint Sahl was married to Thabit bin Qais bin Shammas, who was an ugly man. She said: 'O Messenger of Allah, (ﷺ)  by Allah, were it not for fear of Allah when he enters upon me I would spit in his face.' The Messenger of Allah  (ﷺ) said: 'Will you give him back his garden?' She :said: 'Yes.' So she gave him back his garden and the Messenger of Allah (ﷺ) separated them.\"",
      "chain": [
        "30216",
        "20326",
        "20219",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2149",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا حيوة بن شريح الحضرمي، عن ضمرة بن ربيعة، عن ابن عطاء، عن أبيه، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ أربع من النساء لا ملاعنة بينهن النصرانية تحت المسلم واليهودية تحت المسلم والحرة تحت المملوك والمملوكة تحت الحر ‏\"‏ ‏.‏",
      "text_en": " It was nanated from 'Amr bin Shu'aib, from his father, from his grandfather, that:                     the Prophet (ﷺ) said: \"There are four kinds of women for whom there is no Li'an: a Christian woman married to a Muslim, a Jewish woman married to a Muslim, a free woman married to a slave, and a slave woman married to a free man.\"",
      "chain": [
        "11222",
        "26010",
        "20738",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2189",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن عبد المؤمن الواسطي، حدثنا عون بن عمارة، حدثنا روح بن القاسم، عن عبيد الله بن عمر، عن عمرو بن شعيب، عن أبيه، عن جده، ‏.‏ أن النبي  صلى الله عليه وسلم  قال ‏\"‏ من حلف على يمين فرأى غيرها خيرا منها فليتركها فإن تركها كفارتها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said that the Prophet (ﷺ) said:                     \"Whoever swears an oath then sees  that something else is better than it, let him not do it, and his leaving it is the expiation for it. \"",
      "chain": [
        "24352",
        "11586",
        "11201",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2272",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أزهر بن مروان، قال حدثنا حماد بن زيد، ح وحدثنا أبو كريب، حدثنا إسماعيل ابن علية، قالا حدثنا أيوب، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يحل بيع ما ليس عندك ولا ربح ما لم يضمن ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:                     \"The Messenger of Allah (ﷺ) said: 'It is not permissible to sell something that is not with you, nor to profit from what  you do not possess.\"'",
      "chain": [
        "38091",
        "20022",
        "30216",
        "20208",
        "11015",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2276",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا هشام بن عمار، حدثنا مالك بن أنس، قال بلغني عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي  صلى الله عليه وسلم  نهى عن بيع العربان ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather that :                     the Prophet (ﷺ) forbade the deal involving earnest money .",
      "chain": [
        "30288",
        "20001",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2277",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا الفضل بن يعقوب الرخامي، حدثنا حبيب بن أبي حبيب أبو محمد، كاتب مالك بن أنس حدثنا عبد الله بن عامر الأسلمي، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي  صلى الله عليه وسلم  نهى عن بيع العربان ‏.‏ قال أبو عبد الله العربان أن يشتري الرجل دابة بمائة دينار فيعطيه دينارين أربونا فيقول إن لم أشتر الدابة فالديناران لك ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather that :                     the Prophet (ﷺ) forbade the deal involving earnest money. (Hasan)Abu 'Abdullah said: Earnest money refers to when a man buys an animal for one hundred Dinar, then he gives the seller two Dinar in advance and says: \"If I do not buy the animal, then the two Dinar are yours.\"  And it was said that it refers, and Allah knows best, to when a man buys something, and gives the seller a Dirham or less or more, and says: \"If I take it (all well and good), and if I do not, then the Dirham is yours.\"",
      "chain": [
        "30265",
        "22097",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2337",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا عبد الله بن سعيد، حدثنا أبو خالد الأحمر، عن ابن عجلان، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا اشترى أحدكم الجارية فليقل اللهم إني أسألك خيرها وخير ما جبلتها عليه وأعوذ بك من شرها وشر ما جبلتها عليه وليدع بالبركة وإذا اشترى أحدكم بعيرا فليأخذ بذروة سنامه وليدع بالبركة وليقل مثل ذلك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib from his father that his grandfather told that the Messenger of Allah (ﷺ) said:                     \"When anyone of you buys a slave woman let him say: 'Allahumma inni as'aluka khairaha wa khaira ma jabaltaha alaihi, wa a'udhu bika min sharriha wa sharri ma jabaltaha alaihi (O Allah, I ask You for the goodness within her and the goodness that You have made her inclined towards, and I seek refuge with You from the evil within her and the evil that You have made her inclined towards).' And he should pray for blessing. And if anyone of you buys a camel then he should take hold of its hump and pray for. blessing and say similar words.\"",
      "chain": [
        "11184",
        "20326",
        "10616",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2380",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن يحيى، ويحيى بن حكيم، قالا حدثنا يزيد بن هارون، أنبأنا حجاج، عن عمرو بن شعيب، عن أبيه، عن جده، قال جاء رجل إلى النبي  صلى الله عليه وسلم  فقال إن أبي اجتاح مالي ‏.‏ فقال ‏\"‏ أنت ومالك لأبيك ‏\"‏ ‏.‏ وقال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن أولادكم من أطيب كسبكم فكلوا من أموالهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:                     \"A man came to the Messenger of Allah (ﷺ), and said: 'My father is taking all my wealth.' He said: 'You and your wealth belong to your father.' And the Messenger of Allah (ﷺ) said: 'Your children are among the best of your earnings, so eat from your wealth.’”",
      "chain": [
        "11222",
        "34280",
        "20472",
        "20219",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2366",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا أيوب بن محمد الرقي، حدثنا معمر بن سليمان، ح وحدثنا محمد بن يحيى، حدثنا يزيد بن هارون، قالا حدثنا حجاج بن أرطاة، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تجوز شهادة خائن ولا خائنة ولا محدود في الإسلام ولا ذي غمر على أخيه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shuaib  from his father that his grandfather said:                     “The Testimony of a man or woman who is treacherous, or of one who has been subjected to one of the Haad punishments of Islam, or of one who bears a grudge against his brother, is not permissible.”",
      "chain": [
        "38120",
        "28578",
        "11222",
        "20472",
        "20580",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2468",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Gifts - كتاب الهبات",
      "chapter_no": "14",
      "text_ar": "حدثنا جميل بن الحسن، حدثنا عبد الأعلى، حدثنا سعيد، عن عامر الأحول، عن عمرو بن شعيب، عن أبيه، عن جده، أن نبي الله صلى الله عليه وسلم قال ‏\"‏ لا يرجع أحدكم في هبته إلا الوالد من ولده ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Amr bin Shu'aib, from his father, from, his Grandfather, that the Prophet (ﷺ) of Allah (SWT) said:                     “None of you should take back his gift, except a father (taking it back) from his son.”",
      "chain": [
        "34046",
        "20246",
        "11168",
        "10693",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2478",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Gifts - كتاب الهبات",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو يوسف الرقي، محمد بن أحمد الصيدلاني حدثنا محمد بن سلمة، عن المثنى بن الصباح، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال في خطبة خطبها ‏\"‏ لا يجوز لامرأة في مالها إلا بإذن زوجها إذا هو ملك عصمتها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr  bin Shu'aib, from his father that he delivered:                     “It is not permissible for a woman to dispose of her wealth except with her husband's permission, once he has married her.”",
      "chain": [
        "20672",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2485",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد الله بن جعفر الرقي، حدثنا عبيد الله، عن عبد الكريم، عن عمرو بن شعيب، عن أبيه، عن جده، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال إني أعطيت أمي حديقة لي وإنها ماتت ولم تترك وارثا غيري فقال رسول الله صلى الله عليه وسلم ‏\"‏ وجبت صدقتك ورجعت إليك حديقتك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr  bin Shu'aib, from his father, that his grandfather said:                     “A man came to the Prophet (ﷺ) and said: 'I gave my mother a garden of mine, and she has died and has no other heir but me.' The Messenger of Allah(ﷺ) said: 'Your charity is valid and your garden has been returned to you.' ”",
      "chain": [
        "11222",
        "30346",
        "11201",
        "18655",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2492",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا عبيد الله بن الجهم الأنماطي، حدثنا أيوب بن سويد، عن المثنى، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أودع وديعة فلا ضمان عليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr  bin Shu'aib, from his father, that his grandfather said:                     “The Messenger of Allah (ﷺ) said: 'Whoever is entrusted with an item for safekeeping, is not responsible for it (so long as he is not negligent).' ”",
      "chain": [
        "34144",
        "28053",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2576",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا أحمد بن عبدة، أنبأنا المغيرة بن عبد الرحمن، حدثني أبي، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قضى في سيل مهزور أن يمسك حتى يبلغ الكعبين ثم يرسل الماء ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu`aib, from his father, from his grandfather, that :                     the Messenger of Allah (ﷺ) ruled concerning the stream of Mahzur that the water should be retained until it reached the ankles, then released.",
      "chain": [
        "30423",
        "20182",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2615",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Manumission (of Slaves) - كتاب العتق",
      "chapter_no": "19",
      "text_ar": "حدثنا أبو كريب، حدثنا عبد الله بن نمير، ومحمد بن فضيل، عن حجاج، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما عبد كوتب على مائة أوقية فأداها إلا عشر أوقيات فهو رقيق ‏\"‏ ‏.‏",
      "text_en": " It was narrated from `Amr bin Shu'aib , from his father, from his grandfather that the Messenger of Allah (ﷺ) said:                     “Any slave who has made a contract to buy his freedom for one hundread  Uqiyyah  and pays it all except ten Uqiyyah; he is still a slave.” (One Uqiyyah is equal to 40 Dirham.)",
      "chain": [
        "30216",
        "20331",
        "20356",
        "20219",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2694",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو أسامة، عن الوليد بن كثير، عن عمرو بن شعيب، عن أبيه، عن جده، أن رجلا، من مزينة سأل النبي صلى الله عليه وسلم عن الثمار فقال ‏\"‏ ما أخذ في أكمامه فاحتمل فثمنه ومثله معه وما كان في الجران ففيه القطع إذا بلغ ذلك ثمن المجن وإن أكل ولم يأخذ فليس عليه ‏\"‏ ‏.‏ قال الشاة الحريسة منهن يا رسول الله قال ‏\"‏ ثمنها ومثله معه والنكال وما كان في المراح ففيه القطع إذا كان ما يأخذ من ذلك ثمن المجن ‏\"‏ ‏.‏",
      "text_en": " XOIt was narrated from Amr bin Shu'aib, from his father, from his grandfather, that a man from Muzainah asked the Prophet (ﷺ) about fruits. :                     He said: “What is taken from the tree and carried away, its value and the like of it along with it (meaning double its price must be paid). What (is taken) from the place where dates are dried, (the penalty) is cutting off the hand if the amount taken is equal to the price of a shield. But if (the person) eats it and does not take it away, there is no penalty.” He said: “What about the sheep taken from the pasture, O Messenger of Allah (ﷺ)?” He said: “(The thief) must pay double its price and be punished, and if it was in the pen then his hand should be cut off, if what was taken was worth the price of a shield.”",
      "chain": [
        "38409",
        "20318",
        "11230",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2698",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن رمح، أنبأنا عبد الله بن لهيعة، عن محمد بن عجلان، أنه سمع عمرو بن شعيب، يحدث عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم نهى عن جلد الحد في المسجد ‏.‏",
      "text_en": " 'Amr bin Shu'aib narrated from his father, from his grandfather, that:                     the Messenger of Allah (ﷺ) forbade lashing for the legal punishment in the mosques.",
      "chain": [
        "30490",
        "20624",
        "10616",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2727",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا محمود بن خالد الدمشقي، حدثنا أبي، حدثنا محمد بن راشد، عن سليمان بن موسى، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قتل عمدا دفع إلى أولياء القتيل فإن شاءوا قتلوا وإن شاءوا أخذوا الدية وذلك ثلاثون حقة وثلاثون جذعة وأربعون خلفة وذلك عقل العمد ما صولحوا عليه فهو لهم وذلك تشديد العقل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from this father, from his grandfather that the Messenger of Allah (ﷺ) said:                     “Whoever kills deliberately, he will be handed over to the heirs of the victim. If they want, they may kill him, or if they want, they may accept the blood money, which is thirty Hiqqah, thirty Jadha'ah and forty Khalifah. This is the blood money for deliberate slaying. Whatever is settled by reconciliation belongs to them, and that is a binding covenant.”",
      "chain": [
        "37534",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2732",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا إسحاق بن منصور المروزي، أنبأنا يزيد بن هارون، أنبأنا محمد بن راشد، عن سليمان بن موسى، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قتل خطأ فديته من الإبل ثلاثون بنت مخاض وثلاثون ابنة لبون وثلاثون حقة وعشرة بني لبون ‏\"‏ ‏.‏ وكان رسول الله صلى الله عليه وسلم يقومها على أهل القرى أربعمائة دينار أو عدلها من الورق ويقومها على أزمان الإبل إذا غلت رفع في ثمنها وإذا هانت نقص من ثمنها على نحو الزمان ما كان فبلغ قيمتها على عهد رسول الله صلى الله عليه وسلم ما بين الأربعمائة دينار إلى ثمانمائة دينار أو عدلها من الورق ثمانية آلاف درهم قضى رسول الله صلى الله عليه وسلم أن من كان عقله في البقر على أهل البقر مائتى بقرة ومن كان عقله في الشاء على أهل الشاء ألفى شاة ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that the Messenger of Allah (ﷺ) said:                     “Whoever is killed by mistake, his blood money in camels is thirty Bint Makhad (a one-year-old she-camel), thirty Bint Labun (a two-year-old she-camel), thirty Hiqqah (a three-year-old she-camel) and ten Bani Labun (two-years-old male-camel).” The Messenger of Allah (ﷺ) used to fix the value (of the blood money for accidental killing) among town-dwellers at four hundred Dinar or the equivalent value in silver. When he calculated the price in terms of camels (for Bedouins), it would vary from one time to another. When prices roses, the value (in dinars) would rise: and when prices fell, the value (in Dinar) would fall. At the time of the Messenger of Allah (ﷺ) the value was between four hundred and eight hundred dinar, or the equivalent value in silver, eight thousand Dirham. And the Messenger of Allah (ﷺ) ruled that if a person's blood money was paid in cattle, among those who kept cattle, the amount was two hundred cows; and if person's blood money was paid in sheep, among those who kept sheep, the value was two thousand sheep. (Hasan).",
      "chain": [
        "30313",
        "20472",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2746",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا هشام بن عمار، حدثنا حاتم بن إسماعيل، عن عبد الرحمن بن عياش، عن عمرو بن شعيب، عن أبيه، عن جده، ‏.‏ أن رسول الله صلى الله عليه وسلم قضى أن عقل أهل الكتابين نصف عقل المسلمين وهم اليهود والنصارى ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his grandfather, that :                     the Messenger of Allah (ﷺ) ruled that the blood money for the people of the book is half of that of the blood money for the Muslims, and they are the Jews and Christians.",
      "chain": [
        "30288",
        "20159",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2749",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا إسحاق بن منصور، أنبأنا يزيد بن هارون، أنبأنا محمد بن راشد، عن سليمان بن موسى، عن عمرو بن شعيب، عن أبيه، عن جده، قال قضى رسول الله صلى الله عليه وسلم أن يعقل المرأة عصبتها من كانوا ولا يرثوا منها شيئا إلا ما فضل عن ورثتها وإن قتلت فعقلها بين ورثتها فهم يقتلون قاتلها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:                     “The Messenger of Allah (ﷺ) ruled that a woman's blood money (if she kills someone) should be paid by her male relatives on her father's side, whoever they are, and they should not inherit anything from her, except what is left over after her heirs have been taken their shares. If she is killed than her blood money is to be shared among her heirs, since they are the ones who may kill the one who killed her.”",
      "chain": [
        "30313",
        "20472",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2755",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا جميل بن الحسن العتكي، حدثنا عبد الأعلى، حدثنا سعيد، عن مطر، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الأصابع سواء كلهن فيهن عشر عشر من الإبل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that the Messenger of Allah (ﷺ) said:                     “The fingers are all same, and (the compensatory money) for each of them is ten camels.",
      "chain": [
        "34046",
        "20246",
        "11168",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2757",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا جميل بن الحسن، حدثنا عبد الأعلى، حدثنا سعيد بن أبي عروبة، عن مطر، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال ‏\"‏ في المواضح خمس خمس من الإبل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that the Prophet (ﷺ) of said:                     “For a wound that exposes a bone, is five; (the compensation) is five camels.”",
      "chain": [
        "34046",
        "20246",
        "11073",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2761",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا هشام بن عمار، حدثنا حاتم بن إسماعيل، حدثنا عبد الرحمن بن عياش، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يقتل مسلم بكافر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that the Messenger of Allah (ﷺ) said:                     “A Muslim should not be killed in retaliation for the murder of a disbeliever.”",
      "chain": [
        "30288",
        "20159",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2764",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن حجاج، عن عمرو بن شعيب، عن أبيه، عن جده، عن عمر بن الخطاب، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يقتل الوالد بالولد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that 'Umar bin Khattab said:                     “I heard the Messenger of Allah (ﷺ) say: 'A father should not be killed for his son.'”",
      "chain": [
        "30201",
        "20326",
        "20219",
        "19934",
        "19911",
        "3"
      ]
    },
    {
      "hadith_no": "2766",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا ابن الطباع، حدثنا إسماعيل بن عياش، عن إسحاق بن عبد الله بن أبي فروة، عن إبراهيم بن عبد الله بن حنين، عن أبيه، عن علي، وعن عمرو بن شعيب، عن أبيه، عن جده، قال قتل رجل عبده عمدا متعمدا فجلده رسول الله صلى الله عليه وسلم مائة ونفاه سنة ومحا سهمه من المسلمين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:                     “A man killed his slave deliberately and with malice aforethought, so the Messenger of Allah (ﷺ) gave him one hundred lashes, banished him for one year, and cancelled his share from among the Muslims.”",
      "chain": [
        "11222",
        "20736",
        "12009",
        "11150",
        "11181",
        "5",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2780",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا عبد الله بن سعيد، حدثنا أبو خالد الأحمر، عن حجاج، عن عمرو بن شعيب، عن أبيه، عن جده، أن حويصة، ومحيصة، ابنى مسعود وعبد الله وعبد الرحمن ابنى سهل خرجوا يمتارون بخيبر فعدي على عبد الله فقتل فذكر ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ تقسمون وتستحقون ‏\"‏ ‏.‏ فقالوا يا رسول الله كيف نقسم ولم نشهد قال ‏\"‏ فتبرئكم يهود ‏\"‏ ‏.‏ قالوا يا رسول الله إذا تقتلنا ‏.‏ قال فوداه رسول الله صلى الله عليه وسلم من عنده ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that :                     Huwayyisah and Muhayyisah , the sons of Mas'ud, and 'Abdullah and 'Abdur-Rahman the sons of Sahl, went out to search for food in Khaibar. 'Abdullah was attacked and killed, and mention of that was made to the Messenger of Allah (ﷺ). He said: “Will you swear an oath and establish your right to blood money?” They said: “O Messenger of Allah (ﷺ), how can we swear an oath when we did not witness anything?” He said: “Do you want the Jews to swear that they are innocent?” They said: “O Messenger of Allah (ﷺ), then they will kill us too.” So the Messenger of Allah (ﷺ) paid the blood money himself.",
      "chain": [
        "11184",
        "20326",
        "20219",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2782",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا رجاء بن المرجى السمرقندي، حدثنا النضر بن شميل، حدثنا أبو حمزة الصيرفي، حدثني عمرو بن شعيب، عن أبيه، عن جده، قال جاء رجل إلى النبي صلى الله عليه وسلم صارخا فقال له رسول الله صلى الله عليه وسلم ‏\"‏ ما لك ‏\"‏ ‏.‏ قال سيدي رآني أقبل جارية له فجب مذاكيري ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ على بالرجل ‏\"‏ ‏.‏ فطلب فلم يقدر عليه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اذهب فأنت حر ‏\"‏ ‏.‏ قال على من نصرتي يا رسول الله قال يقول أرأيت إن استرقني مولاى فقال رسول الله صلى الله عليه وسلم ‏\"‏ على كل مؤمن أو مسلم ‏\"‏ ‏.‏",
      "text_en": " 'Amr bin Shu'aib narrated from his father that his grandfather said:                     “A man came to the Prophet (ﷺ) screaming. The Messenger of Allah (ﷺ) said to him: 'What is the matter with you?' He said: 'My master saw me kissing a slave woman of his, so he cut off my penis.' The Prophet (ﷺ) said: 'Take me to the man.' He was sought but could not be found, so the Messenger of Allah (ﷺ) said: 'Go, for you are free.' He said: 'Who will protect me, O Messenger of Allah (ﷺ)? What if my master enslaves me again?' The Messenger of Allah (ﷺ) said: 'Your protection will be (incumbent upon) every believer or Muslim.'”",
      "chain": [
        "20291",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2787",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا هشام بن عمار، حدثنا حاتم بن إسماعيل، عن عبد الرحمن بن عياش، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يد المسلمين على من سواهم تتكافأ دماؤهم ويجير على المسلمين أدناهم ويرد على المسلمين أقصاهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather that the Messenger of Allah (ﷺ) said:                     “The hand of the Muslims is over others, and their blood and wealth is equal in value. The (asylum granted by) the lowest of them applies to the Muslims, and the Muslims return (the spoils of war) to the farthest of them.”",
      "chain": [
        "30288",
        "20159",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2822",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Wills - كتاب الوصايا",
      "chapter_no": "22",
      "text_ar": "حدثنا أحمد بن الأزهر، حدثنا روح بن عبادة، حدثنا حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال لا أجد شيئا وليس لي مال ولي يتيم له مال قال ‏\"‏ كل من مال يتيمك غير مسرف ولا متأثل مالا ‏\"‏ ‏.‏ قال وأحسبه قال ‏\"‏ ولا تقي مالك بماله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib from his father, that his a grandfather said:                     “A man came to the Prophet (ﷺ) and said: 'I do not have anything and I have no wealth, but I have an orphan (under my care) who has wealth.” He said: “Eat from the wealth of your orphan, without being extravagant or use it for trade.” He (narrator) said: “And I think he said: 'Do not preserve your wealth using his instead.'”",
      "chain": [
        "38001",
        "20229",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2836",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Shares of Inheritance - كتاب الفرائض",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن رمح، أنبأنا ابن لهيعة، عن خالد بن يزيد، أن المثنى بن الصباح، أخبره عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يتوارث أهل ملتين ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Amr bin Shu’aib, from his father, from hisgrandfather, that the Messenger of Allah (ﷺ) said:                      “People of twodifferent religions do not inherit from one another.”",
      "chain": [
        "30490",
        "20624",
        "11408",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2837",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Shares of Inheritance - كتاب الفرائض",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، حدثنا حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، قال تزوج رئاب بن حذيفة بن سعيد بن سهم أم وائل بنت معمر الجمحية فولدت له ثلاثة فتوفيت أمهم فورثها بنوها رباعا وولاء مواليها فخرج بهم عمرو بن العاص معه إلى الشام فماتوا في طاعون عمواس فورثهم عمرو وكان عصبتهم فلما رجع عمرو بن العاص جاء بنو معمر يخاصمونه في ولاء أختهم إلى عمر فقال عمر أقضي بينكم بما سمعت من رسول الله صلى الله عليه وسلم سمعته يقول ‏\"‏ ما أحرز الولد أو الوالد فهو لعصبته من كان ‏\"‏ ‏.‏ قال فقضى لنا به وكتب لنا به كتابا فيه شهادة عبد الرحمن بن عوف وزيد بن ثابت وآخر حتى إذا استخلف عبد الملك بن مروان توفي مولى لها وترك ألفى دينار فبلغني أن ذلك القضاء قد غير فخاصموه إلى هشام بن إسماعيل فرفعنا إلى عبد الملك فأتيناه بكتاب عمر فقال إن كنت لأرى أن هذا من القضاء الذي لا يشك فيه وما كنت أرى أن أمر أهل المدينة بلغ هذا أن يشكوا في هذا القضاء ‏.‏ فقضى لنا به فلم نزل فيه بعد ‏.‏",
      "text_en": " It wasnarrated from ‘Amr bin Shu’aib, from his father, that hisgrandfather said:                      “Rabab bin Hudhaifah (bin Sa’eed) bin SahmmarriedUmm Wa’il bint Ma’mar Al-Jumahiyyah, and she bore himthree sons.Their mother died and her sons inherited her houses andthe Wala’ ofher freed slaves. ‘Amr bin ‘As took them out toSham, and they died ofthe plague of ‘Amwas. ‘Amr inherited fromthem, and he was their‘Asabah.* When ‘Amr came back, Banu Ma’marcame to him and theyreferred their dispute with him concerning theWala’ of their sisterto ‘Umar. ‘Umar said: ‘I will judgebetween you according to what Iheard from the Messenger of Allah(ﷺ). I heard him say: “What theson or father acquires goes tohis. ‘Asabah, no matter who they are.’”So he ruled in ourfavour and wrote a document to that effect, inwhich was thetestimony of ‘Abdur-Rahman bin ‘Awf, Zaid bin Thabit andsomeoneelse. Then when ‘Abdul-Malik bin Marwan was appointed caliph,afreed slave of hers (Umm Wa’il’s) died, leaving behind twothousandDinar. I heard that that ruling had been changed, so theyreferred thedispute to Hisham bin Isma’il. We referred the matterto ‘Abdul-Malik,and brought him the document of ‘Umar. He said:‘I thought that thiswas a ruling concerning which there was nodoubt. I never thought thatthe people of Al-Madinah would reach sucha state that they woulddoubt this ruling. So he ruled in our favour,and it remained likethat afterwards.”",
      "chain": [
        "30201",
        "20318",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2841",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Shares of Inheritance - كتاب الفرائض",
      "chapter_no": "23",
      "text_ar": "حدثنا علي بن محمد، ومحمد بن يحيى، قالا حدثنا عبيد الله بن موسى، عن الحسن بن صالح، عن محمد بن سعيد، - وقال محمد بن يحيى عن عمر بن سعيد، - عن عمرو بن شعيب، حدثني أبي، عن جدي عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم قام يوم فتح مكة فقال ‏\"‏ المرأة ترث من دية زوجها وماله وهو يرث من ديتها ومالها ما لم يقتل أحدهما صاحبه فإذا قتل أحدهما صاحبه عمدا لم يرث من ديته وماله شيئا وإن قتل أحدهما صاحبه خطأ ورث من ماله ولم يرث من ديته ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin ‘Amr that the Messenger of Allah(ﷺ) stood up, on the day of the conquest of Makkah, and said:                      “Awoman inherits from the blood money and wealth of her husband, and heinherits from her blood money and wealth, so long as one of them didnot kill the other. If one of them killed the other deliberately,thenhe or she inherits nothing from the blood money or wealth. Ifone ofthem killed the other by mistake, he or she inherits from theother’swealth, but not from the blood money.”",
      "chain": [
        "38409",
        "11222",
        "20340",
        "20647",
        "11222",
        "10652",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2849",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Shares of Inheritance - كتاب الفرائض",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد العزيز بن عبد الله، حدثنا سليمان بن بلال، عن يحيى بن سعيد، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال ‏\"‏ كفر بامرئ ادعاء نسب لا يعرفه أو جحده وإن دق ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Amr bin Shu’aib, from his father, from hisgrandfather, that the Prophet (ﷺ) said:                      “It is disbelief for amanto attribute himself to someone other than his father knowingly,or todeny his connection to his father, even subtly.”*",
      "chain": [
        "11222",
        "30105",
        "20160",
        "11062",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2850",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Shares of Inheritance - كتاب الفرائض",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو كريب، حدثنا يحيى بن اليمان، عن المثنى بن الصباح، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من عاهر أمة أو حرة فولده ولد زنا لا يرث ولا يورث ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Amr bin Shu’aib, from his father, from hisgrandfather that the Messenger of Allah (ﷺ) said:                      “Whoevercommitsadultery with a slave woman or a free woman, his child isillegitimate, and he cannot inherit from him or be inherited from(i.e., this child cannot inherit from him).”",
      "chain": [
        "30216",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2851",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Shares of Inheritance - كتاب الفرائض",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن بكار بن بلال الدمشقي، أنبأنا محمد بن راشد، عن سليمان بن موسى، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ كل مستلحق استلحق بعد أبيه الذي يدعى له ادعاه ورثته من بعده فقضى أن من كان من أمة يملكها يوم أصابها فقد لحق بمن استلحقه وليس له فيما قسم قبله من الميراث شىء وما أدرك من ميراث لم يقسم فله نصيبه ولا يلحق إذا كان أبوه الذي يدعى له أنكره وإن كان من أمة لا يملكها أو من حرة عاهر بها فإنه لا يلحق ولا يورث وإن كان الذي يدعى له هو ادعاه فهو ولد زنا لأهل أمه من كانوا حرة أو أمة ‏\"‏ ‏.‏ قال محمد بن راشد يعني بذلك ما قسم في الجاهلية قبل الإسلام ‏.‏",
      "text_en": " It wasnarrated from ‘Amr bin Shu’aib, from his father, from hisgrandfather, that the Messenger of Allah (ﷺ) said:                      “Every childwhois attributed to his father after his father to whom he isattributedhas died, and his heirs attributed him to him after hedied, he ruledthat* whoever was born to a slave woman whom he ownedat the time whenhe had intercourse with her, he should be namedafter the one to whomhe was attributed, but he has no share of anyinheritance that wasdistributed previously. Whatever inheritance hefinds has not yet beendistributed, he will have a share of it. Buthe cannot be named afterhis father if the man whom he claimed as hisfather did notacknowledge him. If he as born to a slave woman whomhis father didnot own, or to a free woman with whom he committedadultery, then hecannot be named after him and he does not inheritfrom him, even ifthe one whom he claims as his father acknowledgeshim. So he is anillegitimate child who belongs to his mother’speople, whoever theyare, whether she is a free woman or a slave.”",
      "chain": [
        "11222",
        "30512",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2961",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو الحسين، أنبأنا رجاء بن أبي سلمة، حدثنا عمرو بن شعيب، عن أبيه، عن جده، قال لا نفل بعد رسول الله صلى الله عليه وسلم يرد المسلمون قويهم على ضعيفهم ‏.‏",
      "text_en": " ‘Amrbin Shu’aib narrated from his father that his grandfather said:                     “There is no awarding of the spoils after the Messenger of Allah(ﷺ), rather whatever the army acquires (of spoils of war) will bedistributed among strong and weak alike.”",
      "chain": [
        "38409",
        "24139",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3075",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد الرزاق، قال سمعت المثنى بن الصباح، يقول حدثني عمرو بن شعيب، عن أبيه، عن جده، قال طفت مع عبد الله بن عمرو فلما فرغنا من السبع ركعنا في دبر الكعبة فقلت ألا نتعوذ بالله من النار ‏.‏ قال أعوذ بالله من النار ‏.‏ قال ثم مضى فاستلم الركن ثم قام بين الحجر والباب فألصق صدره ويديه وخده إليه ثم قال هكذا رأيت رسول الله  صلى الله عليه وسلم  يفعل ‏.‏",
      "text_en": " ‘Amrbin Shu’aib narrated from his father that his grandfather said:                     “Iperformed Tawaf with ‘Abdullah bin ‘Amr, and when we had finishedseven (circuits), we prayed two Rak’ah at the back of the Ka’bah.Isaid: ‘Why do you not seek refuge with Allah from the Fire?’ Hesaid:‘I seek refuge with Allah from the fire.’ Then he went andtouched theCorner, then he stood between the (Black) Stone and thedoor (of theKa’bah) and clung with his chest, hands and cheekagainst it. Then hesaid: ‘I saw the Messenger of Allah (ﷺ) dothis.’”",
      "chain": [
        "11222",
        "20121",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3519",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، حدثنا أنس بن عياض، حدثنا عبيد الله بن عمر، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ ما أسكر كثيره فقليله حرام ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Amr bin Shu’aib, from his father, from hisgrandfather, that the Messenger of Allah (ﷺ) said:                      “Whatevercausesintoxication in large amounts a small amount of it is (also)unlawful.”",
      "chain": [
        "30285",
        "20157",
        "11201",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3595",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا هشام بن عمار، وراشد بن سعيد الرملي، قالا حدثنا الوليد بن مسلم، حدثنا ابن جريج، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من تطبب ولم يعلم منه طب قبل ذلك فهو ضامن ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Amr bin Shu’aib, from his father, that hisgrandfather said:                      “The Messenger of Allah (ﷺ) said: ‘Whoevergivesmedical treatment, with no prior knowledge of medicine, isresponsible(for any harm done).’”",
      "chain": [
        "30288",
        "20733",
        "11070",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3734",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا عيسى بن يونس، عن هشام بن الغاز، عن عمرو بن شعيب، عن أبيه، عن جده، قال أقبلنا مع رسول الله  صلى الله عليه وسلم  من ثنية أذاخر فالتفت إلى وعلى ريطة مضرجة بالعصفر فقال ‏\"‏ ما هذه ‏\"‏ ‏.‏ فعرفت ما كره فأتيت أهلي وهم يسجرون تنورهم فقذفتها فيه ثم أتيته من الغد فقال ‏\"‏ يا عبد الله ما فعلت الريطة ‏\"‏ ‏.‏ فأخبرته فقال ‏\"‏ ألا كسوتها بعض أهلك فإنه لا بأس بذلك للنساء ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Amr bin Shu’aib, from his father, that hisgrandfather said:                      “We came with the Messenger of Allah (ﷺ) wasThaniyyat Adhakhir. He turned to me, and I was wearing a thin cloakdyed with safflower, and said: ‘What is this?’ And I realizedthat hedisliked it. I came to my family when they were heating theiroven andthrew it (in the oven). Then I came to him the following dayand hesaid: ‘O ‘Abdullah, what happened to the thin cloak?’ Itold him (whatI had done) and he said: ‘Why did you not give it tosome of yourfamily to wear, for there is nothing wrong with it forwomen.’”",
      "chain": [
        "20436",
        "20347",
        "20729",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3736",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، أنبأنا همام، عن قتادة، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ كلوا واشربوا وتصدقوا والبسوا ما لم يخالطه إسراف أو مخيلة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Amr bin Shu’aib, from his father, that hisgrandfather said:                      “The Messenger of Allah (ﷺ) said: ‘Eat anddrink,give charity and wear clothes, as long as that does notinvolve anyextravagance or vanity.’”",
      "chain": [
        "30201",
        "20472",
        "20297",
        "11019",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3721",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبدة بن سليمان، عن محمد بن إسحاق، عن عمرو بن شعيب، عن أبيه، عن جده، قال نهى رسول الله  صلى الله عليه وسلم  عن نتف الشيب وقال ‏\"‏ هو نور المؤمن ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Sh'uaib from his father, that his grandfather said:                     \"The Messenger of Allah(ﷺ) forbade plucking out white hairs and said: 'It is the light of the believer.'\"",
      "chain": [
        "30201",
        "20337",
        "11107",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3753",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا هشام بن عمار، حدثنا الهقل بن زياد، حدثنا الأوزاعي، عن عبد الله بن عامر الأسلمي، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لا يقص على الناس إلا أمير أو مأمور أو مراء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Amr bin Shuaib, from his father, from his grandfather, that the Messenger of Allah(ﷺ) said:                     \"No one tells the stories to the people (for the purpose of exhortation) except a ruler, one appointed by a ruler, or a show-off.\"",
      "chain": [
        "30288",
        "20641",
        "20024",
        "22097",
        "19934",
        "19911"
      ]
    }
  ],
  "total_hadiths": 224
}