{
  "id": "19914",
  "name": "Dmdm bin Jws ضمضم بن جوس",
  "full_name": "Dmdm bin Jws ضمضم بن جوس",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Yamama"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ 4  -  ثقة ]"
    ],
    "tags": [
      "al-Yemami"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "1716",
      "name": "'Abdullah bin Hanzala bin Abi 'Amir ( عبد الله بن حنظلة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11449",
      "name": "Yahya bin Abi Kathir يحيى بن أبي كثير الطائي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10704",
      "name": "'Ikrama bin 'Ammar عكرمة بن عمار العجلي أبو عمار اليمامي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "921",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا علي بن المبارك، عن يحيى بن أبي كثير، عن ضمضم بن جوس، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اقتلوا الأسودين في الصلاة الحية والعقرب ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Kill the two black things during prayer, the snake and scorpion.",
      "chain": [
        "20285",
        "20449",
        "11449",
        "19914",
        "13"
      ]
    },
    {
      "hadith_no": "1016",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا هاشم بن القاسم، حدثنا عكرمة بن عمار، عن ضمضم بن جوس الهفاني، حدثني أبو هريرة، بهذا الخبر قال ثم سجد سجدتى السهو بعد ما سلم ‏.‏",
      "text_en": " Abu Hurairah reported; He then made two prostration on account of forgetfulness after he had given the salutation.",
      "chain": [
        "30524",
        "20390",
        "10704",
        "19914",
        "13"
      ]
    },
    {
      "hadith_no": "4901",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن الصباح بن سفيان، أخبرنا علي بن ثابت، عن عكرمة بن عمار، قال حدثني ضمضم بن جوس، قال قال أبو هريرة سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ كان رجلان في بني إسرائيل متآخيين فكان أحدهما يذنب والآخر مجتهد في العبادة فكان لا يزال المجتهد يرى الآخر على الذنب فيقول أقصر ‏.‏ فوجده يوما على ذنب فقال له أقصر فقال خلني وربي أبعثت على رقيبا فقال والله لا يغفر الله لك أو لا يدخلك الله الجنة ‏.‏ فقبض أرواحهما فاجتمعا عند رب العالمين فقال لهذا المجتهد أكنت بي عالما أو كنت على ما في يدي قادرا وقال للمذنب اذهب فادخل الجنة برحمتي وقال للآخر اذهبوا به إلى النار ‏\"‏ ‏.‏ قال أبو هريرة والذي نفسي بيده لتكلم بكلمة أوبقت دنياه وآخرته ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     I heard the Messenger of Allah (ﷺ) say: There were two men among Banu Isra'il, who were striving for the same goal. One of them would commit sin and the other would strive to do his best in the world. The man who exerted himself in worship continued to see the other in sin.  He would say: Refrain from it. One day he found him in sin and said to him: Refrain from it.  He said: Leave me alone with my Lord. Have you been sent as a watchman over me?  He said: I swear by Allah, Allah will not forgive you, nor will he admit you to Paradise. Then their souls were taken back (by Allah), and they met together with the Lord of the worlds.  He (Allah) said to this man who had striven hard in worship; Had you knowledge about Me or had you power over that which I had in My hand? He said to the man who sinned: Go and enter Paradise by My mercy. He said about the other: Take him to Hell.  AbuHurayrah said: By Him in Whose hand my soul is, he spoke a word by which this world and the next world of his were destroyed.",
      "chain": [
        "30269",
        "28408",
        "10704",
        "19914",
        "13"
      ]
    },
    {
      "hadith_no": "390",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا علي بن حجر، حدثنا إسماعيل ابن علية، هو ابن إبراهيم عن علي بن المبارك، عن يحيى بن أبي كثير، عن ضمضم بن جوس، عن أبي هريرة، قال أمر رسول الله صلى الله عليه وسلم بقتل الأسودين في الصلاة الحية والعقرب ‏.‏ قال وفي الباب عن ابن عباس وأبي رافع ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم وبه يقول أحمد وإسحاق ‏.‏ وكره بعض أهل العلم قتل الحية والعقرب في الصلاة ‏.‏ وقال إبراهيم إن في الصلاة لشغلا ‏.‏ والقول الأول أصح ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"Allah's Messenger (S) ordered killing the two black things in Salat; the snake and the scorpion.\"",
      "chain": [
        "20387",
        "20208",
        "20449",
        "11449",
        "19914",
        "13"
      ]
    },
    {
      "hadith_no": "1202",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا قتيبة بن سعيد، عن سفيان، ويزيد، - وهو ابن زريع - عن معمر، عن يحيى بن أبي كثير، عن ضمضم بن جوس، عن أبي هريرة، قال أمر رسول الله صلى الله عليه وسلم بقتل الأسودين في الصلاة ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah (ﷺ) commanded us to kill the two black ones (snakes and scorpions) while praying.\"",
      "chain": [
        "30367",
        "20005",
        "20304",
        "20115",
        "11449",
        "19914",
        "13"
      ]
    },
    {
      "hadith_no": "1330",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا سويد بن نصر، عن عبد الله بن المبارك، عن عكرمة بن عمار، قال حدثنا ضمضم بن جوس، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم سلم ثم سجد سجدتى السهو وهو جالس ثم سلم ‏.‏ قال ذكره في حديث ذي اليدين ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     \"The Messenger of Allah (ﷺ) said the salam then he performed two prostrations of forgetfulness while he was still sitting, then he said the salam.\" He said: He mentioned it in the hadith of Dhul-Yadain.",
      "chain": [
        "38265",
        "20025",
        "10704",
        "19914",
        "13"
      ]
    },
    {
      "hadith_no": "1303",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن الصباح، قالا حدثنا سفيان بن عيينة، عن معمر، عن يحيى بن أبي كثير، عن ضمضم بن جوس، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  أمر بقتل الأسودين في الصلاة العقرب والحية ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) commandedkillingthe two black ones during prayer; the scorpion and the snake.",
      "chain": [
        "30201",
        "30269",
        "20005",
        "20115",
        "11449",
        "19914",
        "13"
      ]
    }
  ],
  "total_hadiths": 7
}