{
  "id": "19927",
  "name": "'Ubaidullah bin Zhr عبيد الله بن زحر",
  "full_name": "'Ubaidullah bin Zhr عبيد الله بن زحر",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ بخ  4  -  صدوق يخطئ ]"
    ],
    "tags": [
      "Client"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Sadooq/Delusion] [ بخ  4  -  صدوق يخطئ ]",
        "ar": "Narrator[Grade:Sadooq/Delusion] [ بخ  4  -  صدوق يخطئ ]",
        "ckb": "Narrator[Grade:Sadooq/Delusion] [ بخ  4  -  صدوق يخطئ ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "NA",
        "ar": "NA",
        "ckb": "NA"
      }
    ],
    "tags_display": [
      {
        "en": "Client (Mawla)",
        "ar": "مولى",
        "ckb": "مەولا"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "10906",
      "name": "Khalid bin Abi 'Imran خالد بن أبي عمران",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "16013",
      "name": "Hban bin Abi Jblh حبان بن أبي جبلة",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "16129",
      "name": "Abu al-Hythm أبو الهيثم",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "11618",
      "name": "Abu al-Aliyya al-Bara', Ziyad bin Feroz أبو العالية البراء زياد بن فيروز",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    }
  ],
  "students": [
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-3293",
      "hadith_no": "3293",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا مسدد، حدثنا يحيى بن سعيد القطان، قال أخبرني يحيى بن سعيد الأنصاري، أخبرني عبيد الله بن زحر، أن أبا سعيد، أخبره أن عبد الله بن مالك أخبره أن عقبة بن عامر أخبره ‏:‏ أنه، سأل النبي صلى الله عليه وسلم عن أخت له نذرت أن تحج حافية غير مختمرة فقال ‏:‏ ‏\"‏ مروها فلتختمر ولتركب، ولتصم ثلاثة أيام ‏\"‏ ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir:                     Uqbah consulted the Prophet (ﷺ) about his sister who took a vow to perform hajj barefooted and bareheaded. So he said: Command her to cover her head and to ride, and to fast three days.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20031",
        "11062",
        "19927",
        "38",
        "189"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-1282",
      "hadith_no": "1282",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة، أخبرنا بكر بن مضر، عن عبيد الله بن زحر، عن علي بن يزيد، عن القاسم، عن أبي أمامة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تبيعوا القينات ولا تشتروهن ولا تعلموهن ولا خير في تجارة فيهن وثمنهن حرام في مثل هذا أنزلت هذه الآية ‏:‏ ‏(‏ ومن الناس من يشتري لهو الحديث ليضل عن سبيل الله ‏)‏ إلى آخر الآية ‏\"‏ ‏.‏ قال وفي الباب عن عمر بن الخطاب ‏.‏ قال أبو عيسى حديث أبي أمامة إنما نعرفه مثل هذا من هذا الوجه ‏.‏ وقد تكلم بعض أهل العلم في علي بن يزيد وضعفه وهو شامي ‏.‏",
      "text_en": " Narrated Abu Umamah:                     That the Messenger of Allah (ﷺ) said: \"Do not sell the (slave) female singers, not purchase them, nor teach them (to sing). And there is no good in trading in them, and their prices are unlawful. It was about the likes of this that this Ayah was revealed: And among mankind is he who purchases idle talk to divert from the way of Allah.\"[He said:] There is narration about this from 'Umar bin Al-Khattab.[Abu 'Eisa said:] We only know of the Hadith of Abu Umamah, like this, from this route. Some of the people of knowledge have criticized 'Ali bin Yazid (one of the narrators) and graded him weak, and he is from Ash-Sham.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20374",
        "19927",
        "10535",
        "405"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-1544",
      "hadith_no": "1544",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Vows and Oaths - كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "20",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا وكيع، عن سفيان، عن يحيى بن سعيد، عن عبيد الله بن زحر، عن أبي سعيد الرعيني، عن عبد الله بن مالك اليحصبي، عن عقبة بن عامر، قال قلت يا رسول الله إن أختي نذرت أن تمشي إلى البيت حافية غير مختمرة ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن الله لا يصنع بشقاء أختك شيئا فلتركب ولتختمر ولتصم ثلاثة أيام ‏\"‏ ‏.‏ قال وفي الباب عن ابن عباس ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ والعمل على هذا عند أهل العلم وهو قول أحمد وإسحاق ‏.‏",
      "text_en": " Narrated 'Uqbah bin 'Amir:                     \"I said: 'O Messenger of Allah! My sister vowed that she would walk to the House barefoot and without Khimar (covering).' The Prophet (ﷺ) said: 'Verily Allah will not do anything with the misery of your sister. She should ride, and cover, and fast three days.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20032",
        "20012",
        "11062",
        "19927",
        "189"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2347",
      "hadith_no": "2347",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "أخبرنا سويد بن نصر، أخبرنا عبد الله بن المبارك، عن يحيى بن أيوب، عن عبيد الله بن زحر، عن علي بن يزيد، عن القاسم أبي عبد الرحمن، عن أبي أمامة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن أغبط أوليائي عندي لمؤمن خفيف الحاذ ذو حظ من الصلاة أحسن عبادة ربه وأطاعه في السر وكان غامضا في الناس لا يشار إليه بالأصابع وكان رزقه كفافا فصبر على ذلك ‏\"‏ ‏.‏ ثم نفض بيده فقال ‏\"‏ عجلت منيته قلت بواكيه قل تراثه ‏\"‏ ‏.‏  وبهذا الإسناد عن النبي صلى الله عليه وسلم قال ‏\"‏ عرض على ربي ليجعل لي بطحاء مكة ذهبا قلت لا يا رب ولكن أشبع يوما وأجوع يوما أو قال ثلاثا أو نحو هذا فإذا جعت تضرعت إليك وذكرتك وإذا شبعت شكرتك وحمدتك ‏\"‏ ‏.‏ قال هذا حديث حسن ‏.‏ وفي الباب عن فضالة بن عبيد ‏.‏ والقاسم هذا هو ابن عبد الرحمن ويكنى أبا عبد الرحمن وهو مولى عبد الرحمن بن خالد بن يزيد بن معاوية وهو شامي ثقة وعلي بن يزيد ضعيف الحديث ويكنى أبا عبد الملك ‏.‏",
      "text_en": " Abu Umamah narrated that the Prophet (s.a.w) said:                     \"Indeed the best of my friends to me is the one of meager conditions, whose share is in Salat, worshipping his Lord well and obeying him (even) in private. He is obscure among the people such that the fingers are not pointed towards him. His provisions are only what is sufficient and he is patient with that.\" Then he tapped with his fingers and said: \"His death comes quickly, his mourners are few, and his inheritance is little.\"With this (the above), chain it is narrated that the Prophet (s.a.w) said: \"My Lord presented to me, that He would make the valley of Makkah into gold for me, I said: 'No O Lord! But being filled for a day and hungry for a day\"-or he said: \"three days\" or something like that- \"So when I am hungry, I would beseech You and remember You, and when I am full I would be grateful to You and praise You.\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20379",
        "19927",
        "11648",
        "405"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2406",
      "hadith_no": "2406",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا صالح بن عبد الله، حدثنا عبد الله بن المبارك، ح وحدثنا سويد بن نصر، أخبرنا ابن المبارك، عن يحيى بن أيوب، عن عبيد الله بن زحر، عن علي بن يزيد، عن القاسم، عن أبي أمامة، عن عقبة بن عامر، قال قلت يا رسول الله ما النجاة قال ‏\"‏ أمسك عليك لسانك وليسعك بيتك وابك على خطيئتك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " 'Uqbah bin 'Amir narrated:                      \"I said: 'O Messenger of Allah! What is the means to salvation?' He said:'That you control your tongue, suffice yourself your house, and cry over your sins.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20025",
        "38265",
        "20025",
        "20379",
        "19927",
        "10535",
        "405",
        "189"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2731-2",
      "hadith_no": "2731",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا سويد بن نصر، أخبرنا عبد الله، أخبرنا يحيى بن أيوب، عن عبيد الله بن زحر، عن علي بن يزيد، عن القاسم أبي عبد الرحمن، عن أبي أمامة، رضى الله عنه أن رسول الله صلى الله عليه وسلم قال ‏\"‏ تمام عيادة المريض أن يضع أحدكم يده على جبهته أو قال على يده فيسأله كيف هو وتمام تحياتكم بينكم المصافحة ‏\"‏ ‏.‏ قال أبو عيسى هذا إسناد ليس بالقوي ‏.‏ قال محمد وعبيد الله بن زحر ثقة وعلي بن يزيد ضعيف والقاسم بن عبد الرحمن يكنى أبا عبد الرحمن وهو مولى عبد الرحمن بن خالد بن يزيد بن معاوية وهو ثقة والقاسم شامي ‏.‏",
      "text_en": " Narrated Abu Umamah:                     that the Messenger of Allah (ﷺ) said: \"From the complete of visiting the ill is that one of you place his hand on his forehead\" - or he said - \"on his hand, and ask him how he is. And shaking hands completes your greetings among each other.\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20379",
        "19927",
        "11648",
        "405"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3499",
      "hadith_no": "3499",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا قتيبة، حدثنا بكر بن مضر، عن عبيد الله بن زحر، عن علي بن يزيد، عن القاسم بن عبد الرحمن، وهو عبد الرحمن مولى عبد الرحمن عن أبي أمامة عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تبيعوا القينات ولا تشتروهن ولا تعلموهن ولا خير في تجارة فيهن وثمنهن حرام ‏\"‏ ‏.‏ في مثل ذلك أنزلت عليه هذه الآية ‏:‏ ‏(‏ومن الناس من يشتري لهو الحديث ليضل عن سبيل الله ‏)‏ إلى آخر الآية ‏.‏ قال أبو عيسى هذا حديث غريب إنما يروى من حديث القاسم عن أبي أمامة ‏.‏ والقاسم ثقة وعلي بن يزيد يضعف في الحديث قال سمعت محمد بن إسماعيل يقول القاسم ثقة وعلي بن يزيد يضعف ‏.‏",
      "text_en": " Narrated Abu Umamah:                     that the Messenger of Allah (ﷺ) said: \"Do not sell the female singers, nor purchase them, nor teach them (to sing). And there is no good in trade in them, and their prices are unlawful. It was about the likes of this that this Ayah was revealed: 'And among mankind is he who purchases idle talk to divert from the way of Allah (31:6).'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20374",
        "19927",
        "19896",
        "405"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3502-2",
      "hadith_no": "3502",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا علي بن حجر، أخبرنا ابن المبارك، أخبرنا يحيى بن أيوب، عن عبيد الله بن زحر، عن خالد بن أبي عمران، أن ابن عمر، قال قلما كان رسول الله صلى الله عليه وسلم يقوم من مجلس حتى يدعو بهؤلاء الكلمات لأصحابه ‏\"‏ اللهم اقسم لنا من خشيتك ما يحول بيننا وبين معاصيك ومن طاعتك ما تبلغنا به جنتك ومن اليقين ما تهون به علينا مصيبات الدنيا ومتعنا بأسماعنا وأبصارنا وقوتنا ما أحييتنا واجعله الوارث منا واجعل ثأرنا على من ظلمنا وانصرنا على من عادانا ولا تجعل مصيبتنا في ديننا ولا تجعل الدنيا أكبر همنا ولا مبلغ علمنا ولا تسلط علينا من لا يرحمنا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وقد روى بعضهم هذا الحديث عن خالد بن أبي عمران عن نافع عن ابن عمر ‏.‏",
      "text_en": " Ibn Umar said:                     “Rarely would the Messenger of Allah stand from a sitting until he supplicated with these words for his Companions: ‘O Allah, apportion for us, fear of You, that shall come between us and disobedience of You, and of obedience to You, which shall cause us to obtain Your Paradise, and of certainty, which shall make the afflictions of the world easy for us, and enjoyment of our hearing, and our seeing, and our strength as long as You keep us alive, and make it the inheritor of us. And let our vengeance be upon those who have wronged us, and aid us against those who show enmity towards us, and do not make our affliction in our religion, and do not make this world our greatest concern, nor the limit of our knowledge, and do not give power over us to those who will not have mercy on us. (Allahumma-qsim Lana Min Khadhaitika Wa Yahuwlu, Bainana Wa Baina Ma’asika Wa Min Ta’atika Ma Tuballighuna Bihi Jannataka Wa Minal-Yaqini, Ma Tuhawwinu Bihi Alaina Musibatid-Dunya Wa Matti’na Bi-Asma’ina Wa Absarina, WA Quwwatina Ma Ahyaytana WAj’alhul-Waritha Minna Waj’al Tha’rana Ala Man Zalamana Wansurna Ala Man Adana Wa La Taj’al Musibatana Fi Dinina Wa La Taj’alid-Dunya Akbara Hammina Wa La Mublagha Ilmina Wa La Tusallit Alaina Man La Yarhamuna).’”",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20025",
        "20379",
        "19927",
        "10906",
        "18"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-3815",
      "hadith_no": "3815",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عمرو بن علي، ومحمد بن المثنى، قالا حدثنا يحيى بن سعيد، عن يحيى بن سعيد، عن عبيد الله بن زحر، - وقال عمرو إن عبيد الله بن زحر أخبره - عن عبد الله بن مالك، أن عقبة بن عامر، أخبره أنه، سأل النبي صلى الله عليه وسلم عن أخت له نذرت أن تمشي حافية غير مختمرة فقال له النبي صلى الله عليه وسلم ‏\"‏ مرها فلتختمر ولتركب ولتصم ثلاثة أيام ‏\"‏ ‏.‏",
      "text_en": " 'Uqbah bin 'Amir narrated that he asked the Prophet about a sister of his who had vowed to walk, barefoot and bareheaded. The Prophet said to him:                      \"Tell her to cover her head and ride, and fast for three days.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "30170",
        "20031",
        "11062",
        "19927",
        "11081",
        "19927",
        "189"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-316",
      "hadith_no": "316",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا ابن أبي مريم، حدثنا يحيى بن أيوب، عن عبيد الله بن زحر، عن علي بن يزيد، عن القاسم، عن أبي أمامة، ‏.‏ أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لا يعجز أحدكم إذا دخل مرفقه أن يقول اللهم إني أعوذ بك من الرجس النجس الخبيث المخبث الشيطان الرجيم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Umamah that:                     The Messenger of Allah said: \"None of you should fail to say, when he enters his toilet: 'Allahumma inni a'udhu bika minar-rijsin-najis, al-khabithil-mukhbith, ash-Shaitanir-rajim (O Allah, I seek refuge with You from the filthy and impure, the evil one with evil companions, the accursed Shaitan).'\" (Da'if)Another chain with a slightly different wording from Ibn Abi Maryam who mentioned similar, but he did not say in his narration: \"Minar-rijsin-najis (From the filthy and the impure)\" he only said: \"Minal-khabithil-mukhbith, ash-Shaitanir-rajim (From the evil one with evil companions, the accursed Shaitan).\"",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30232",
        "20379",
        "19927",
        "10535"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-2216",
      "hadith_no": "2216",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا علي بن محمد، حدثنا عبد الله بن نمير، عن يحيى بن سعيد، عن عبيد الله بن زحر، عن أبي سعيد الرعيني، أن عبد الله بن مالك، أخبره أن عقبة بن عامر أخبره أن أخته نذرت أن تمشي حافية غير مختمرة وأنه ذكر ذلك لرسول الله  صلى الله عليه وسلم  فقال ‏\"‏ مرها فلتركب ولتختمر ولتصم ثلاثة أيام ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Ar-Ru'aini that 'Abdullah bin Malik told him, that :                     'Uqbah  bin 'Amir told him, that his sister vowed to walk, barefoot and bareheaded, and he mentioned that to the Messenger of Allah (ﷺ) He said: \"Order her to ride and to cover her head, and to fast for three days.\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20331",
        "11062",
        "19927",
        "189"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 11,
  "grade_display": {
    "en": "Follower (Tabi') [6th Generation]",
    "ar": "تابعي [الجيل السادس]",
    "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
  }
}