{
  "id": "19929",
  "name": "'Ali bin Bdhymh علي بن بذيمة",
  "full_name": "'Ali bin Bdhymh علي بن بذيمة",
  "grade": "Follower(Tabi') [6th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "130",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ 4  -  ثقة ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "15681",
      "name": "Abu 'Ubaida bin 'Abdullah bin Mas'ud أبو عبيدة بن عبد الله بن مسعود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11725",
      "name": "Maqsim bin Bajra مقسم بن بجرة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11012",
      "name": "Maymun bin Mahran ميمون بن مهران",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "15467",
      "name": "Qays bin Hbtr قيس بن حبتر",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20724",
      "name": "'Abdur Rahman bin 'Abdullah bin 'Utba عبد الرحمن بن عبد الله بن عتبة المسعودي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20395",
      "name": "'Abdur Rahman bin Yazid bin Jabir عبد الرحمن بن يزيد بن جابر الأزدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "27527",
      "name": "'Abdur Rahman bin Yazid bin Tamim عبد الرحمن بن يزيد بن تميم السلمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28660",
      "name": "Yonus bin Rashid يونس بن راشد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20635",
      "name": "Muhammad bin Muslim bin Abi al-Wadah محمد بن مسلم بن أبي الوضاح",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3696",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو أحمد، حدثنا سفيان، عن علي بن بذيمة، حدثني قيس بن حبتر النهشلي، عن ابن عباس، أن وفد عبد القيس، قالوا يا رسول الله فيم نشرب قال ‏\"‏ لا تشربوا في الدباء ولا في المزفت ولا في النقير وانتبذوا في الأسقية ‏\"‏ ‏.‏ قالوا يا رسول الله فإن اشتد في الأسقية قال ‏\"‏ فصبوا عليه الماء ‏\"‏ ‏.‏ قالوا يا رسول الله ‏.‏ فقال لهم في الثالثة أو الرابعة ‏\"‏ أهريقوه ‏\"‏ ‏.‏ ثم قال ‏\"‏ إن الله حرم على أو حرم الخمر والميسر والكوبة ‏\"‏ ‏.‏ قال ‏\"‏ وكل مسكر حرام ‏\"‏ ‏.‏ قال سفيان فسألت علي بن بذيمة عن الكوبة قال الطبل ‏.‏",
      "text_en": " Ibn ‘Abbas said :                      The deputation of ‘Abd al-Qais asked (the prophet):From which(vessels)should we drink ? He (the prophet) replied: Do not drink from the pumpkins, vessels smeared with pitch, and hollow stumps , and steep dates in skins. They asked: Messenger of Allah, if it ferments?  He replied: infuse water in it. They asked: Messenger of Allah...” (repeating the same words). He replied to them third or fourth time: Pour it away. He then said: Allah has forbidden me, or  he said: He has forbidden me wine, game of chance and kubah(drums). He said: Every intoxicant is unlawful. Sufyan said: I asked ‘All b. Badhimah about kubah\t. He replied: Drum.",
      "chain": [
        "30160",
        "20355",
        "20012",
        "19929",
        "15467",
        "17"
      ]
    },
    {
      "hadith_no": "4336",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا يونس بن راشد، عن علي بن بذيمة، عن أبي عبيدة، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أول ما دخل النقص على بني إسرائيل كان الرجل يلقى الرجل فيقول يا هذا اتق الله ودع ما تصنع فإنه لا يحل لك ثم يلقاه من الغد فلا يمنعه ذلك أن يكون أكيله وشريبه وقعيده فلما فعلوا ذلك ضرب الله قلوب بعضهم ببعض ‏\"‏ ‏.‏ ثم قال ‏{‏ لعن الذين كفروا من بني إسرائيل على لسان داود وعيسى ابن مريم ‏}‏ إلى قوله ‏{‏ فاسقون ‏}‏ ثم قال ‏\"‏ كلا والله لتأمرن بالمعروف ولتنهون عن المنكر ولتأخذن على يدى الظالم ولتأطرنه على الحق أطرا ولتقصرنه على الحق قصرا ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Messenger of Allah (ﷺ) said: The first defect that permeated Banu Isra'il was that a man (of them) met another man and said: O so-and-so, fear Allah, and abandon what you are doing, for it is not lawful for you. He then met him the next day and that did not prevent him from eating with him, drinking with him and sitting with him. When they did so. Allah mingled their hearts with each other.  He then recited the verse: \"curses were pronounced on those among the children of Isra'il who rejected Faith, by the tongue of David and of Jesus the son of Mary\"...up to \"wrongdoers\".  He then said: By no means, I swear by Allah, you must enjoin what is good and prohibit what is evil, prevent the wrongdoer, bend him into conformity with what is right, and restrict him to what is right.",
      "chain": [
        "30352",
        "19929",
        "10",
        "16"
      ]
    },
    {
      "hadith_no": "3322",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا يزيد بن هارون، أخبرنا شريك، عن علي بن بذيمة، عن أبي عبيدة، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لما وقعت بنو إسرائيل في المعاصي نهتهم علماؤهم فلم ينتهوا فجالسوهم في مجالسهم وواكلوهم وشاربوهم فضرب الله قلوب بعضهم ببعض ولعنهم على لسان داود وعيسى ابن مريم ذلك بما عصوا وكانوا يعتدون ‏\"‏ ‏.‏ قال فجلس رسول الله صلى الله عليه وسلم وكان متكئا فقال ‏\"‏ لا والذي نفسي بيده حتى تأطروهم على الحق أطرا ‏\"‏ ‏.‏ قال عبد الله بن عبد الرحمن قال يزيد وكان سفيان الثوري لا يقول فيه عن عبد الله ‏.‏ قال أبو عيسى هذا حديث حسن غريب وقد روي هذا الحديث عن محمد بن مسلم بن أبي الوضاح عن علي بن بذيمة عن أبي عبيدة عن عبد الله عن النبي صلى الله عليه وسلم نحوه وبعضهم يقول عن أبي عبيدة عن النبي صلى الله عليه وسلم مرسل ‏.‏",
      "text_en": " Narrated 'Abdullah bin Mas'ud:                     \"The Messenger of Allah (ﷺ) said: 'When the Children of Isra'il fell into disobedience, their scholars forbade them from it. But they did not stop, so they sat with them in their gatherings, and participated in eating and drinking with them. So Allah pitted their hearts against each other, and cursed them upon the tongue of Dawud and 'Eisa bin Mariam. That was because they disobeyed and were ever transgressing.'\" He said: \"The Messenger of Allah (ﷺ) sat up after he had been reclining, and he said: 'No, by the One in Whose Hand is my soul! Not until you incline them to the truth.'\" 'Abdullah bin 'Abdur-Rahman said: \"Yazid said: 'Sufyan Ath-Thawri would not say in it: \"From 'Abdullah.\"",
      "chain": [
        "30025",
        "20472",
        "20587",
        "19929",
        "10",
        "16"
      ]
    },
    {
      "hadith_no": "3323",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا بندار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن علي بن بذيمة، عن أبي عبيدة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن بني إسرائيل لما وقع فيهم النقص كان الرجل فيهم يرى أخاه على الذنب فينهاه عنه فإذا كان الغد لم يمنعه ما رأى منه أن يكون أكيله وشريبه وخليطه فضرب الله قلوب بعضهم ببعض ونزل فيهم القرآن فقال ‏:‏ ‏(‏ لعن الذين كفروا من بني إسرائيل على لسان داود وعيسى ابن مريم ذلك بما عصوا وكانوا يعتدون ‏)‏ ‏\"‏ ‏.‏ فقرأ حتى بلغ ‏:‏ ‏(‏ولو كانوا يؤمنون بالله والنبي وما أنزل إليه ما اتخذوهم أولياء ولكن كثيرا منهم فاسقون ‏)‏ قال وكان نبي الله صلى الله عليه وسلم متكئا فجلس فقال ‏\"‏ لا حتى تأخذوا على يدى الظالم فتأطروه على الحق أطرا ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu 'Ubaidah:                     \"The Messenger of Allah (ﷺ) said: 'When the Children of Isra'il fell into decline, a man among them would see his brother committing a sin, and prohibit them from it. The next day, what he saw him doing would not prevent him from eating with him, drinking with him, and associating with him. So Allah pitted their hearts against each other, and He revealed about them in the Qur'an, He said: Those among the Children of Isra'il who disbelieved were cursed by the tongue of Dawud and 'Eisa, son of Mariam. That was because they disobeyed and were ever transgressing.' And he recited until he reached: 'And had they believed in Allah, and in the Prophet, and in what has been revealed to him, never would they have taken them as friends; but many of them are rebellious (5:78-81).' He said: \"And Allah's Prophet (ﷺ) was reclining, so he sat up and said: 'No! Not until you take the hand of the wrong-doer and incline him toward the truth.'\"",
      "chain": [
        "30160",
        "20033",
        "20012",
        "19929",
        "10"
      ]
    },
    {
      "hadith_no": "3324",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا بندار، حدثنا أبو داود الطيالسي، وأملاه، على حدثنا محمد بن مسلم بن أبي الوضاح، عن علي بن بذيمة، عن أبي عبيدة، عن عبد الله، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": "",
      "chain": [
        "30160",
        "20547",
        "20635",
        "19929",
        "10",
        "16"
      ]
    },
    {
      "hadith_no": "4141",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا سفيان، عن علي بن بذيمة، عن أبي عبيدة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن بني إسرائيل لما وقع فيهم النقص كان الرجل يرى أخاه على الذنب فينهاه عنه فإذا كان الغد لم يمنعه ما رأى منه أن يكون أكيله وشريبه وخليطه فضرب الله قلوب بعضهم ببعض ونزل فيهم القرآن فقال ‏{لعن الذين كفروا من بني إسرائيل على لسان داود وعيسى ابن مريم}‏ حتى بلغ ‏{ولو كانوا يؤمنون بالله والنبي وما أنزل إليه ما اتخذوهم أولياء ولكن كثيرا منهم فاسقون }‏ ‏\"‏ ‏.‏ قال وكان رسول الله  صلى الله عليه وسلم  متكئا فجلس وقال ‏\"‏ لا حتى تأخذوا على يدى الظالم فتأطروه على الحق أطرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu ‘Ubaidah that the Messenger of Allah (ﷺ)said:                      “When the Children of Isral became deficient in religiouscommitment, a man would see his brother committing sin and would tellhim not to do it, but the next day, what he had seen him do did notprevent him from eating or drinking with him, or mixing with him. SoAllah made the hearts of those who did not commit sin like the heartsof those who did, and He revealed Qur’an concerning them and said:“Those among the Children of Israel who disbelieved were cursed bythe tongue of David and ‘Eisa, son of Maryam” until he reached:“And had they believed in Allah, and in the Prophet and in what hasbeen revealed to him, never would they have taken them (thedisbelievers) as their friends; but many of them are disobedient (toAllah).”[5:78-81]The Messenger of Allah (ﷺ) sat up and said: \"No, not until they take the hand of the wrongdoer (i.e. restrain him] and force him to follow the right way.\"",
      "chain": [
        "30160",
        "20033",
        "20012",
        "19929",
        "10"
      ]
    },
    {
      "hadith_no": "4142",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو داود، - أملاه على - حدثنا محمد بن أبي الوضاح، عن علي بن بذيمة، عن أبي عبيدة، عن عبد الله، عن النبي  صلى الله عليه وسلم  بمثله ‏.‏",
      "text_en": "",
      "chain": [
        "30160",
        "19929",
        "10",
        "16"
      ]
    }
  ],
  "total_hadiths": 7
}