{
  "id": "19923",
  "name": "'Abdullah bin Naf' عبد الله بن نافع بن العمياء",
  "full_name": "'Abdullah bin Naf' عبد الله بن نافع بن العمياء",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Unknown-Majhool",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Unknown-Majhool] [ 4  -  مجهول ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "174",
      "name": "Rabi'ah ibn al-Harith ( ربيعة بن الحارث بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "20624",
      "name": "'Abdullah bin lahya'a bin 'Uqba عبد الله بن لهيعة بن عقبة الحضرمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "jami-al-tirmidhi-385",
      "hadith_no": "385",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سويد بن نصر، حدثنا عبد الله بن المبارك، أخبرنا الليث بن سعد، أخبرنا عبد ربه بن سعيد، عن عمران بن أبي أنس، عن عبد الله بن نافع ابن العمياء، عن ربيعة بن الحارث، عن الفضل بن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الصلاة مثنى مثنى تشهد في كل ركعتين وتخشع وتضرع وتمسكن وتذرع وتقنع يديك يقول ترفعهما إلى ربك مستقبلا ببطونهما وجهك وتقول يا رب يا رب ومن لم يفعل ذلك فهو كذا وكذا ‏\"‏ ‏.‏ قال أبو عيسى وقال غير ابن المبارك في هذا الحديث ‏\"‏ من لم يفعل ذلك فهي خداج ‏\"‏ ‏.‏ قال أبو عيسى سمعت محمد بن إسماعيل يقول روى شعبة هذا الحديث عن عبد ربه بن سعيد فأخطأ في مواضع فقال عن أنس بن أبي أنس وهو عمران بن أبي أنس وقال عن عبد الله بن الحارث وإنما هو عبد الله بن نافع ابن العمياء عن ربيعة بن الحارث ‏.‏ وقال شعبة عن عبد الله بن الحارث عن المطلب عن النبي صلى الله عليه وسلم وإنما هو عن ربيعة بن الحارث بن عبد المطلب عن الفضل بن عباس عن النبي صلى الله عليه وسلم ‏.‏ قال محمد وحديث الليث بن سعد يعني أصح من حديث شعبة ‏.‏",
      "text_en": " Al-Fadl bin Abbas narrated that:                     Allah's Messenger (S) said: \"As-Salat is two and two, with a Tashah-hus for every two Rakah, with humility, imploring, having a sense of tranquility, pleading and showing helplessness and stretching out your hand\" - he said: raising them - \"to your Lord, with the insides of them facing your face, saying: 'O Lord! O Lord! And whoever does not do this, then it is like this or that.\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20023",
        "11191",
        "10605",
        "19923",
        "174",
        "135"
      ]
    },
    {
      "id": "sunan-ibn-majah-1386",
      "hadith_no": "1386",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شبابة بن سوار، حدثنا شعبة، حدثني عبد ربه بن سعيد، عن أنس بن أبي أنس، عن عبد الله بن نافع بن العمياء، عن عبد الله بن الحارث، عن المطلب، - يعني ابن أبي وداعة - قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ صلاة الليل مثنى مثنى وتشهد في كل ركعتين وتباءس وتمسكن وتقنع وتقول اللهم اغفر لي فمن لم يفعل ذلك فهي خداج ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Muttalib that is, Ibn Abu Wada’ah said:                      “TheMessenger of Allah 9saw) said: ‘The night prayers are (to beoffered)two by two. Say the Tashah-hud after each two Rak’ah, andraise yourhands in all humility like one who is poor and needy andsay:‘Allahummaghfir li (O Allah, forgive me).’ And whoever doesnot dothat, it is imperfect.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20426",
        "20020",
        "11191",
        "19923",
        "912",
        "5295"
      ]
    }
  ],
  "total_hadiths": 2
}