{
  "id": "19920",
  "name": "'Abdullah bin Zalm عبد الله بن ظالم التميمي المازني",
  "full_name": "'Abdullah bin Zalm عبد الله بن ظالم التميمي المازني",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ 4  -  صدوق ]"
    ],
    "tags": [
      "al-Tamimi",
      "al-Maazni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11",
      "name": "Sa'id bin Zayd ( سعيد بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "10770",
      "name": "Smak bin Hrb bin Aws سماك بن حرب بن أوس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11369",
      "name": "'Abdul Malik bin Mysrh عبد الملك بن ميسرة الزراد",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10835",
      "name": "Hilal bin Yasaf هلال بن يساف",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4648",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن العلاء، عن ابن إدريس، أخبرنا حصين، عن هلال بن يساف، عن عبد الله بن ظالم، وسفيان، عن منصور، عن هلال بن يساف، عن عبد الله بن ظالم المازني، قال ذكر سفيان رجلا فيما بينه وبين عبد الله بن ظالم المازني قال سمعت سعيد بن زيد بن عمرو بن نفيل قال لما قدم فلان الكوفة أقام فلان خطيبا فأخذ بيدي سعيد بن زيد فقال ألا ترى إلى هذا الظالم فأشهد على التسعة إنهم في الجنة ولو شهدت على العاشر لم إيثم - قال ابن إدريس والعرب تقول آثم - قلت ومن التسعة قال قال رسول الله صلى الله عليه وسلم وهو على حراء ‏\"‏ اثبت حراء إنه ليس عليك إلا نبي أو صديق أو شهيد ‏\"‏ ‏.‏ قلت ومن التسعة قال رسول الله صلى الله عليه وسلم وأبو بكر وعمر وعثمان وعلي وطلحة والزبير وسعد بن أبي وقاص وعبد الرحمن بن عوف ‏.‏ قلت ومن العاشر فتلكأ هنية ثم قال أنا ‏.‏ قال أبو داود رواه الأشجعي عن سفيان عن منصور عن هلال بن يساف عن ابن حيان عن عبد الله بن ظالم بإسناده ‏.‏",
      "text_en": " Narrated Sa'id ibn Zayd ibn Amr ibn Nufayl:                     Abdullah ibn Zalim al-Mazini said: I heard Sa'id ibn Zayd ibn Amr ibn Nufayl say: When so and so came to Kufah, and made so and so stand to address the people, Sa'id ibn Zayd caught hold of my hand and said: Are you seeing this tyrant? I bear witness to the nine people that they will go to Paradise. If I testify to the tenth too, I shall not be sinful.  I asked: Who are the nine?  He said: The Messenger of Allah (ﷺ) said when he was on Hira': Be still, Hira', for only a Prophet, or an ever-truthful, or a martyr is on you.  I asked: Who are those nine?  He said: The Messenger of Allah, AbuBakr, Umar, Uthman, Ali, Talhah, az-Zubayr, Sa'd ibn AbuWaqqas and AbdurRahman ibn Awf.  I asked: Who is the tenth? He paused a moment and said: it is I.Abu Dawud said: This tradition has been transmitted by al-Ashja'i, from Sufyan, from Mansur, from Hilal b. Yasaf, from Ibn Hayyan on the authority of 'Abd Allah b. Zalim through his different chain of narrators in a a similar manner.",
      "chain": [
        "30216",
        "20102",
        "15097",
        "10835",
        "19920",
        "20012",
        "11067",
        "10835",
        "11"
      ]
    },
    {
      "hadith_no": "4123",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا هشيم، أخبرنا حصين، عن هلال بن يساف، عن عبد الله بن ظالم المازني، عن سعيد بن زيد بن عمرو بن نفيل، أنه قال أشهد على التسعة أنهم في الجنة ولو شهدت على العاشر لم آثم ‏.‏ قيل وكيف ذلك قال كنا مع رسول الله صلى الله عليه وسلم بحراء فقال ‏\"‏ اثبت حراء فإنه ليس عليك إلا نبي أو صديق أو شهيد ‏\"‏ ‏.‏ قيل ومن هم قال رسول الله صلى الله عليه وسلم وأبو بكر وعمر وعثمان وعلي وطلحة والزبير وسعد وعبد الرحمن بن عوف ‏.‏ قيل فمن العاشر قال أنا ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد روي من غير وجه عن سعيد بن زيد عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated 'Abdullah bin Zalim Al-Mazini:                     that Sa'eed bin Zaid bin 'Amr bin Nufail said: \"I bear witness for nine people, that they are in Paradise, and if I were to bear witness for a tenth, I would not be sinful.\" It was said: \"How is that?\" He said: \"We were with the Messenger of Allah (ﷺ) at (mount) Hira when he said, 'Be firm, Hira! There is not upon you any but a Prophet, or a Siddiq, or a martyr.\" It was said: \"And who were they?\" He said: \"The Messenger of Allah (ﷺ), Abu Bakr, 'Umar, 'Uthman, 'Ali, Talhah, Az-Zubair, Sa'd, and 'Abdur-Rahman bin 'Awf.\" It was said: \"And who is the tenth?\" He said: \"Me.\"",
      "chain": [
        "30242",
        "20468",
        "15097",
        "10835",
        "19920",
        "11"
      ]
    },
    {
      "hadith_no": "139",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، عن شعبة، عن حصين، عن هلال بن يساف، عن عبد الله بن ظالم، عن سعيد بن زيد، قال أشهد على رسول الله  صلى الله عليه وسلم  أني سمعته يقول ‏\"‏ اثبت حراء فما عليك إلا نبي أو صديق أو شهيد ‏\"‏ ‏.‏ وعدهم رسول الله  صلى الله عليه وسلم  أبو بكر وعمر وعثمان وعلي وطلحة والزبير وسعد وابن عوف وسعيد بن زيد ‏.‏",
      "text_en": " It was narrated that Sa'eed bin Zaid:                     'I bear witness that I heard the Messenger of Allah say: 'Stand firm, O (mountain of) Hira', for there is no one upon you but a Prophet, a Siddiq or a martyr.' \" Then he listed them as follows: \"The Messenger of Allah, Abu Bakr, 'Umar, 'Uthman, 'Ali, Talhah, Zubair, Sa'd, Ibn 'Awf and Sa'eed bin Zaid.\"",
      "chain": [
        "30160",
        "20276",
        "20020",
        "15097",
        "10835",
        "19920",
        "11"
      ]
    }
  ],
  "total_hadiths": 3
}