{
  "id": "19939",
  "name": "Kathir bin Jmhan al-Slmy كثير بن جمهان السلمي",
  "full_name": "Kathir bin Jmhan al-Slmy كثير بن جمهان السلمي",
  "grade": "Follower(Tabi') [3rd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Maqbool] [ 4  -  مقبول ]"
    ],
    "tags": [
      "al-Salmi",
      "al-Aslami"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11714",
      "name": "'Amr bin al-Aswad al-Ansi عمرو بن الأسود العنسي",
      "grade": "Follower(Tabi') [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11068",
      "name": "Ata'a bin al-Sa'ib al-Thaqifi عطاء بن السائب الثقفي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10957",
      "name": "al-Lyth bin Abi Sulaym الليث بن أبي سليم",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1904",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا النفيلي، حدثنا زهير، حدثنا عطاء بن السائب، عن كثير بن جمهان، أن رجلا، قال لعبد الله بن عمر بين الصفا والمروة يا أبا عبد الرحمن إني أراك تمشي والناس يسعون قال إن أمش فقد رأيت رسول الله صلى الله عليه وسلم يمشي وإن أسع فقد رأيت رسول الله صلى الله عليه وسلم يسعى وأنا شيخ كبير ‏.‏",
      "text_en": " Kathir ibn Jamhan said:                      A man asked Abdullah ibn Umar between as-Safa and al-Marwah: AbdurRahman, I see you walking while the people are running (between as-Safa and al-Marwah)? He replied: If I walk, I saw the Messenger of Allah (ﷺ) running. I am too old.",
      "chain": [
        "30352",
        "20321",
        "11068",
        "19939"
      ]
    },
    {
      "hadith_no": "864",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا يوسف بن عيسى، حدثنا ابن فضيل، عن عطاء بن السائب، عن كثير بن جمهان، قال رأيت ابن عمر يمشي في السعى فقلت له أتمشي في السعى بين الصفا والمروة قال لئن سعيت لقد رأيت رسول الله صلى الله عليه وسلم يسعى ولئن مشيت لقد رأيت رسول الله صلى الله عليه وسلم يمشي وأنا شيخ كبير ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وروي عن سعيد بن جبير عن ابن عمر نحوه ‏.‏",
      "text_en": " Kathir bin Jumhan said:                     \"I saw Ibn Umar walking at the place of Sa'i so I said to him: 'Do you walk at the place of Sa'i between As-Safa and Al-Marwah?' He said: 'If I performed Sa'i, then it is because I saw the Messenger of Allah performing Sa'i there, and if I walked, then it is because I have seen the Messenger of Allah walking. And I am an old man.'\"",
      "chain": [
        "30401",
        "20356",
        "11068",
        "19939"
      ]
    },
    {
      "hadith_no": "2976",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا بشر بن السري، قال حدثنا سفيان، عن عطاء بن السائب، عن كثير بن جمهان، قال رأيت ابن عمر يمشي بين الصفا والمروة فقال إن أمشي فقد رأيت رسول الله صلى الله عليه وسلم يمشي وإن أسعى فقد رأيت رسول الله صلى الله عليه وسلم يسعى ‏.‏",
      "text_en": " It was narrated that Kathir bin Jumhan said:                     \"I saw Ibn Umar walking between As-Safa and Al-Marwah. He said: 'I am walking because I saw the Messenger of Allah Walking, and I hasten because I saw the Messenger of Allah hasten.'\"",
      "chain": [
        "30277",
        "20190",
        "20012",
        "11068",
        "19939"
      ]
    },
    {
      "hadith_no": "3102",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن محمد، وعمرو بن عبد الله، قالا حدثنا وكيع، حدثنا أبي، عن عطاء بن السائب، عن كثير بن جمهان، عن ابن عمر، قال إن أسع بين الصفا والمروة فقد رأيت رسول الله  صلى الله عليه وسلم  يسعى وإن أمش فقد رأيت رسول الله  صلى الله عليه وسلم  يمشي وأنا شيخ كبير ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “If I go quickly between SafaandMarwah, that is because I saw the Messenger of Allah (ﷺ) goingquickly, and if I walk that is because I saw the Messenger of Allah(ﷺ) walking, even though I am an old man.”",
      "chain": [
        "38409",
        "20032",
        "20645",
        "11068",
        "19939",
        "18"
      ]
    }
  ],
  "total_hadiths": 4
}