{
  "id": "19941",
  "name": "Kulayb bin Shahab كليب بن شهاب",
  "full_name": "Kulayb bin Shahab كليب بن شهاب",
  "grade": "Follower(Tabi') [2nd Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:No Doubt] [ ي  4  -  صحابة ]"
    ],
    "tags": [
      "al-Jarmi",
      "B.Qada'"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "10778",
      "name": "'Asim bin Kulayb bin Shahab عاصم بن كليب بن شهاب بن المجنون",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "teachers": [],
  "students": [
    {
      "id": "10778",
      "name": "'Asim bin Kulayb bin Shahab عاصم بن كليب بن شهاب بن المجنون",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "726",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، عن عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال قلت لأنظرن إلى صلاة رسول الله صلى الله عليه وسلم كيف يصلي قال فقام رسول الله صلى الله عليه وسلم فاستقبل القبلة فكبر فرفع يديه حتى حاذتا أذنيه ثم أخذ شماله بيمينه فلما أراد أن يركع رفعهما مثل ذلك ثم وضع يديه على ركبتيه فلما رفع رأسه من الركوع رفعهما مثل ذلك فلما سجد وضع رأسه بذلك المنزل من بين يديه ثم جلس فافترش رجله اليسرى ووضع يده اليسرى على فخذه اليسرى وحد مرفقه الأيمن على فخذه اليمنى وقبض ثنتين وحلق حلقة ورأيته يقول هكذا ‏.‏ وحلق بشر الإبهام والوسطى وأشار بالسبابة ‏.‏",
      "text_en": " Narrated Wa'il ibn Hujr:                     I purposely looked at the prayer of the Messenger of Allah (ﷺ), how he offered it. The Messenger of Allah (ﷺ) stood up, faced the direction of the qiblah and uttered the takbir (Allah is most great) and then raised his hands in front of his ears, then placed his right hand on his left (catching each other). When he was about to bow, he raised them in the same manner. He then placed his hands on his knees. When he raised his head after bowing, he raised them in the like manner. When he prostrated himself he placed his forehead between his hands. He then sat down and spread his left foot and placed his left hand on his left thigh, and kept his right elbow aloof from his  right thigh. He closed his two fingers and made a circle (with the fingers).  I (Asim ibn Kulayb) saw him (Bishr ibn al-Mufaddal) say in this manner. Bishr made the circle with the thumb and the middle finger and pointed with the forefinger.",
      "chain": [
        "30175",
        "20212",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "728",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا شريك، عن عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال رأيت النبي صلى الله عليه وسلم حين افتتح الصلاة رفع يديه حيال أذنيه - قال - ثم أتيتهم فرأيتهم يرفعون أيديهم إلى صدورهم في افتتاح الصلاة وعليهم برانس وأكسية ‏.‏",
      "text_en": " Narrated Wa'il ibn Hujr:                     I witnessed the Prophet (ﷺ) raise his hands in front of his ears when he began to pray. I then came back and saw them (the people) raising their hands up to their chest when they began to pray. They wore long caps and blankets.",
      "chain": [
        "30203",
        "20587",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "838",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي، وحسين بن عيسى، قالا حدثنا يزيد بن هارون، أخبرنا شريك، عن عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال رأيت النبي صلى الله عليه وسلم إذا سجد وضع ركبتيه قبل يديه وإذا نهض رفع يديه قبل ركبتيه ‏.‏",
      "text_en": " Narrated Wa'il ibn Hujr:                     I saw that the Prophet (ﷺ) placed his knees (on the ground) before placing his hands when he prostrated himself. And when he stood up, he raised his hands before his knees.",
      "chain": [
        "30115",
        "30326",
        "20472",
        "11858",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "957",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، عن عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال قلت لأنظرن إلى صلاة رسول الله صلى الله عليه وسلم كيف يصلي فقام رسول الله صلى الله عليه وسلم فاستقبل القبلة فكبر فرفع يديه حتى حاذتا بأذنيه ثم أخذ شماله بيمينه فلما أراد أن يركع رفعهما مثل ذلك - قال - ثم جلس فافترش رجله اليسرى ووضع يده اليسرى على فخذه اليسرى وحد مرفقه الأيمن على فخذه اليمنى وقبض ثنتين وحلق حلقة ورأيته يقول هكذا وحلق بشر الإبهام والوسطى وأشار بالسبابة ‏.‏",
      "text_en": " Narrated Wa'il ibn Hujr:                     I said that I should look at the prayer of the Messenger of Allah (ﷺ) how he prays. The Messenger of Allah (ﷺ) stood up and faced the qiblah (i.e. the direction of Ka'bah) and uttered the takbir (Allah is most great); then he raised his hands till he brought them in front of his ears; then he caught hold of his left hand with his right hand (i.e. folded his hands). When he was about to bow, he raised them (his hands) in a like manner. Then he sat, stretched out his left foot (to sit on it), placed his left hand on his left thigh, and kept away the tip of his right elbow from his right thigh, joined two fingers, formed a ring, to do so. And the narrator Bishr made a ring with the thumb and the middle finger.",
      "chain": [
        "30175",
        "20212",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "2255",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا مخلد بن خالد الشعيري، حدثنا سفيان، عن عاصم بن كليب، عن أبيه، عن ابن عباس، أن النبي صلى الله عليه وسلم أمر رجلا حين أمر المتلاعنين أن يتلاعنا أن يضع يده على فيه عند الخامسة يقول إنها موجبة ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     When the Prophet (ﷺ) ordered a man and his wife to invoke curses on each other, he ordered a man to put his hand on his mouth when he came to the fifth utterance, saying that it would be the deciding one.",
      "chain": [
        "30567",
        "20005",
        "10778",
        "19941",
        "17"
      ]
    },
    {
      "hadith_no": "2705",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا هناد بن السري، حدثنا أبو الأحوص، عن عاصم، - يعني ابن كليب - عن أبيه، عن رجل، من الأنصار قال خرجنا مع رسول الله صلى الله عليه وسلم في سفر فأصاب الناس حاجة شديدة وجهد وأصابوا غنما فانتهبوها فإن قدورنا لتغلي إذ جاء رسول الله صلى الله عليه وسلم يمشي على قوسه فأكفأ قدورنا بقوسه ثم جعل يرمل اللحم بالتراب ثم قال ‏\"‏ إن النهبة ليست بأحل من الميتة ‏\"‏ ‏.‏ أو ‏\"‏ إن الميتة ليست بأحل من النهبة ‏\"‏ ‏.‏ الشك من هناد ‏.‏",
      "text_en": " Narrated A man of the Ansar:                     Kulayb reported from a man of the Ansar. He said: We went out with the Messenger of Allah (ﷺ) on a journey. The people suffered from intense need and strain. They gained booty and then plundered it. While our pots were boiling the Messenger of Allah (ﷺ) came walking with his bow touching the ground. He turned over our pots with his bow and smeared the meat with the soil, and said: \"Plunder is more unlawful than carrion,\" or he said: \"Carrion is more unlawful than plunder.\" The narrator Hannad was doubtful.",
      "chain": [
        "30480",
        "20327",
        "10778",
        "19941"
      ]
    },
    {
      "hadith_no": "2799",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا الحسن بن علي، حدثنا عبد الرزاق، حدثنا الثوري، عن عاصم بن كليب، عن أبيه، قال كنا مع رجل من أصحاب النبي صلى الله عليه وسلم يقال له مجاشع من بني سليم فعزت الغنم فأمر مناديا فنادى أن رسول الله صلى الله عليه وسلم كان يقول ‏\"‏ إن الجذع يوفي مما يوفي منه الثني ‏\"‏ ‏.‏ قال أبو داود وهو مجاشع بن مسعود ‏.‏",
      "text_en": " Narrated 'Asim b. Kulaib:                     On the authority of his father: We were with a man from the Companions of the Prophet (ﷺ) called Mujashi' who belonged to Banu Sulaim. There was a scarcity if goats (in those days). He commanded a man to announce (among the people); so he announced that the Messenger of Allah (ﷺ) used to say: A lamb may be given as full payent for that for which has full-grown animal is payment.Abu Dawud said: His name is Mujashi' b. Mas'ud.",
      "chain": [
        "30115",
        "20121",
        "20012",
        "10778",
        "19941"
      ]
    },
    {
      "hadith_no": "3332",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن العلاء، أخبرنا ابن إدريس، أخبرنا عاصم بن كليب، عن أبيه، عن رجل، من الأنصار قال خرجنا مع رسول الله صلى الله عليه وسلم في جنازة فرأيت رسول الله صلى الله عليه وسلم وهو على القبر يوصي الحافر ‏\"‏ أوسع من قبل رجليه أوسع من قبل رأسه ‏\"‏ ‏.‏ فلما رجع استقبله داعي امرأة فجاء وجيء بالطعام فوضع يده ثم وضع القوم فأكلوا فنظر آباؤنا رسول الله صلى الله عليه وسلم يلوك لقمة في فمه ثم قال ‏\"‏ أجد لحم شاة أخذت بغير إذن أهلها ‏\"‏ ‏.‏ فأرسلت المرأة قالت يا رسول الله إني أرسلت إلى البقيع يشتري لي شاة فلم أجد فأرسلت إلى جار لي قد اشترى شاة أن أرسل إلى بها بثمنها فلم يوجد فأرسلت إلى امرأته فأرسلت إلى بها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أطعميه الأسارى ‏\"‏ ‏.‏",
      "text_en": " Asim ibn Kulayb quoted his father's authority for the following statement by one of the Ansar:                      We went out with the Messenger of Allah (ﷺ) to a funeral, and I saw the Messenger of Allah (ﷺ) at the grave giving this instruction to the grave-digger:  Make it wide on the side of his feet, and make it wide on the side of his head. When he came back, he was received by a man who conveyed an invitation from a woman. So he came (to her), to it food was brought, and he put his hand (i.e. took a morsel in his hand); the people did the same and they ate. Our fathers noticed that the Messenger of Allah (ﷺ) was moving a morsel around his mouth.  He then said: I find the flesh of a sheep which has been taken without its owner's permission.  The woman sent a message to say: Messenger of Allah, I sent (someone) to an-Naqi' to have a sheep bought for me, but there was none; so I sent (a message) to my neighbour who had bought a sheep, asking him to send it to me for the price (he had paid), but he could not be found. I, therefore, sent (a message) to his wife and she sent it to me.  The Messenger of Allah (ﷺ) said: Give this food to the prisoners.",
      "chain": [
        "30216",
        "20102",
        "10778",
        "19941"
      ]
    },
    {
      "hadith_no": "4190",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا معاوية بن هشام، وسفيان بن عقبة السوائي، - هو أخو قبيصة - وحميد بن خوار عن سفيان الثوري، عن عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال أتيت النبي صلى الله عليه وسلم ولي شعر طويل فلما رآني رسول الله صلى الله عليه وسلم قال ‏\"‏ ذباب ذباب ‏\"‏ ‏.‏ قال فرجعت فجززته ثم أتيته من الغد فقال ‏\"‏ إني لم أعنك وهذا أحسن ‏\"‏ ‏.‏",
      "text_en": " Narrated Wa'il  ibn Hujr:                     I came to the Prophet (ﷺ) and I had long hair. When the Messenger of Allah (ﷺ) saw me, he said: Evil, evil! He said: I then returned and cut them off. I then came to him in the morning. He said (to me): I did not intend to do evil to you. This is much better.",
      "chain": [
        "30216",
        "20609",
        "20586",
        "20012",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "4841",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، وموسى بن إسماعيل، قالا حدثنا عبد الواحد بن زياد، حدثنا عاصم بن كليب، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ كل خطبة ليس فيها تشهد فهي كاليد الجذماء ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Every sermon which does not contain a tashahhud is like a hand cut off.",
      "chain": [
        "30175",
        "20040",
        "20256",
        "10778",
        "19941",
        "13"
      ]
    },
    {
      "hadith_no": "268",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سلمة بن شبيب، وأحمد بن إبراهيم الدورقي، والحسن بن علي الحلواني، وعبد الله بن منير، وغير، واحد، قالوا حدثنا يزيد بن هارون، أخبرنا شريك، عن عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال رأيت رسول الله صلى الله عليه وسلم إذا سجد يضع ركبتيه قبل يديه وإذا نهض رفع يديه قبل ركبتيه ‏.‏ قال زاد الحسن بن علي في حديثه قال يزيد بن هارون ولم يرو شريك عن عاصم بن كليب إلا هذا الحديث ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرف أحدا رواه مثل هذا عن شريك ‏.‏ والعمل عليه عند أكثر أهل العلم يرون أن يضع الرجل ركبتيه قبل يديه وإذا نهض رفع يديه قبل ركبتيه ‏.‏ وروى همام عن عاصم هذا مرسلا ولم يذكر فيه وائل بن حجر ‏.‏",
      "text_en": " Wa'il bin Hujr narrated:                     \"I saw Allah's Messenger when he prostrated placing his knees (on the ground) before his hands, and when he got up, he raised his hands before his knees.\"",
      "chain": [
        "30417",
        "30494",
        "30115",
        "30353",
        "20472",
        "11858",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "292",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو كريب، حدثنا عبد الله بن إدريس، حدثنا عاصم بن كليب الجرمي، عن أبيه، عن وائل بن حجر، قال قدمت المدينة قلت لأنظرن إلى صلاة رسول الله صلى الله عليه وسلم فلما جلس - يعني - للتشهد افترش رجله اليسرى ووضع يده اليسرى يعني على فخذه اليسرى ونصب رجله اليمنى ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل عليه عند أكثر أهل العلم وهو قول سفيان الثوري وأهل الكوفة وابن المبارك ‏.‏",
      "text_en": " Wa'il bin Hujr said:                     \"I arrived in Al-Madinah and I said, 'Let me look at the Salat of Allah's Messenger.' When he sat - meaning for At-Tashah-hud - he spread his left foot, and placed his left hand - meaning on his left thigh - and held his right foot erect.\"",
      "chain": [
        "30216",
        "20102",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "1106",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو هشام الرفاعي، حدثنا محمد بن فضيل، عن عاصم بن كليب، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كل خطبة ليس فيها تشهد فهي كاليد الجذماء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن [صحيح] غريب ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     The Messenger of Allah said: \"Every Khutbah that does not have the Tashah-hud in it, then it is like a severed hand.\"",
      "chain": [
        "30478",
        "20356",
        "10778",
        "19941",
        "13"
      ]
    },
    {
      "hadith_no": "3587",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا عقبة بن مكرم، حدثنا سعيد بن سفيان الجحدري، حدثنا عبد الله بن معدان، أخبرني عاصم بن كليب الجرمي، عن أبيه، عن جده، قال دخلت على النبي صلى الله عليه وسلم وهو يصلي وقد وضع يده اليسرى على فخذه اليسرى ووضع يده اليمنى على فخذه اليمنى وقبض أصابعه وبسط السبابة وهو يقول ‏\"‏ يا مقلب القلوب ثبت قلبي على دينك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏",
      "text_en": " Asim bin Kulaib Al-Jarmi narrated from his father, from his grandfather, who said:                     “I entered upon the Prophet while he was praying and he had placed his left hand on his left thigh, and he had placed his right hand on his right thigh, and clasped his fingers, and extended his index finger, and he was saying: ‘O changer of the hearts, make my heart firm upon Your religion (Ya Muqallibal-Qulubi Thabbit Qalbi Ala Dinik).’”",
      "chain": [
        "30441",
        "24161",
        "23075",
        "10778",
        "19941"
      ]
    },
    {
      "hadith_no": "889",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله بن المبارك، عن زائدة، قال حدثنا عاصم بن كليب، قال حدثني أبي أن وائل بن حجر، أخبره قال قلت لأنظرن إلى صلاة رسول الله صلى الله عليه وسلم كيف يصلي فنظرت إليه فقام فكبر ورفع يديه حتى حاذتا بأذنيه ثم وضع يده اليمنى على كفه اليسرى والرسغ والساعد فلما أراد أن يركع رفع يديه مثلها - قال - ووضع يديه على ركبتيه ثم لما رفع رأسه رفع يديه مثلها ثم سجد فجعل كفيه بحذاء أذنيه ثم قعد وافترش رجله اليسرى ووضع كفه اليسرى على فخذه وركبته اليسرى وجعل حد مرفقه الأيمن على فخذه اليمنى ثم قبض اثنتين من أصابعه وحلق حلقة ثم رفع إصبعه فرأيته يحركها يدعو بها ‏.‏",
      "text_en": " Wa'il bin Hujr said:                     \"I said: 'I am going to watch how the Messenger of Allah (ﷺ) prays.' So I watched him and he stood and said the takbir, and raised his hands until they were in the level with his ears, then he placed his right hand over his left hand, wrist and lower forearm. When he wanted to bow he raised his hands likewise. Then he prostrated and placed his hands in level with his ears. Then he sat up and placed his left leg under him; he put his left hand on his left thigh and knee, and he put the edge of his right elbow on his right thigh, then he held two of his fingers together and made a circle, and raised his forefinger, and I saw him moving it and supplicating with it.\"",
      "chain": [
        "38265",
        "20025",
        "20320",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "1089",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا الحسين بن عيسى القومسي البسطامي، قال حدثنا يزيد، - وهو ابن هارون - قال أنبأنا شريك، عن عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال رأيت رسول الله صلى الله عليه وسلم إذا سجد وضع ركبتيه قبل يديه وإذا نهض رفع يديه قبل ركبتيه ‏.‏",
      "text_en": " It was narrated that Wa'il bin Hujr said:                     \"I saw the Messenger of Allah (ﷺ) when he prostrated, he lowered his knees before his hands, and when he came up he raised his hands before his knees.\"",
      "chain": [
        "20472",
        "20587",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "1102",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرني أحمد بن ناصح، قال حدثنا ابن إدريس، قال سمعت عاصم بن كليب، يذكر عن أبيه، عن وائل بن حجر، قال قدمت المدينة فقلت لأنظرن إلى صلاة رسول الله صلى الله عليه وسلم فكبر ورفع يديه حتى رأيت إبهاميه قريبا من أذنيه فلما أراد أن يركع كبر ورفع يديه ثم رفع رأسه فقال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ثم كبر وسجد فكانت يداه من أذنيه على الموضع الذي استقبل بهما الصلاة ‏.‏",
      "text_en": " It was narrated that Wa'il bin Hujr said:                     \"I came to Al-Madinah and said: 'I am going to watch the Messenger of Allah (ﷺ) pray. He said the takbir and raised his hands until I saw his thumbs near his ears. When he wanted to bow, he said the takbir and raised his hands. Then he raised his head and said: 'Sami Allahu liman hamidah (Allah hears the one who praises Him).' Then he said the takbir and prostrated, and his hands were in the same position in relation to his ears as when he started the prayer.\"",
      "chain": [
        "20102",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "1154",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا إسحاق بن منصور، قال أنبأنا يزيد بن هارون، قال أنبأنا شريك، عن عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال رأيت رسول الله صلى الله عليه وسلم إذا سجد وضع ركبتيه قبل يديه وإذا نهض رفع يديه قبل ركبتيه ‏.‏ قال أبو عبد الرحمن لم يقل هذا عن شريك غير يزيد بن هارون والله تعالى أعلم ‏.‏",
      "text_en": " It was narrated that Wa'il bin Hujr said:                     'I saw the Messenger of Allah (ﷺ) when he prostrated, place his knees on the ground before his hands, and when he got up, he lifted his hands before his knees.\"",
      "chain": [
        "30313",
        "20472",
        "20587",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "1159",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا محمد بن عبد الله بن يزيد المقرئ، قال حدثنا سفيان، قال حدثنا عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال أتيت رسول الله صلى الله عليه وسلم فرأيته يرفع يديه إذا افتتح الصلاة حتى يحاذي منكبيه وإذا أراد أن يركع وإذا جلس في الركعتين أضجع اليسرى ونصب اليمنى ووضع يده اليمنى على فخذه اليمنى ونصب أصبعه للدعاء ووضع يده اليسرى على فخذه اليسرى ‏.‏ قال ثم أتيتهم من قابل فرأيتهم يرفعون أيديهم في البرانس ‏.‏",
      "text_en": " It was narrated that Wa'il bin Hujr said:                     \"I came to the Messenger of Allah (ﷺ) and I saw him raising his hands when he started to pray until they were in level with his shoulders, and when he wanted to bow. When he sat following the first two rak'ahs, he sat on his left foot and held the right foot upright. He placed his right hand on his right thigh and raised his finger for the supplication, and he placed his left hand on his left thigh.\" He said: \"Then I came the following year and I saw them raising their hands inside their Baranis.\"",
      "chain": [
        "20012",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "1263",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا قتيبة، قال حدثنا سفيان، عن عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال رأيت رسول الله صلى الله عليه وسلم يرفع يديه إذا افتتح الصلاة وإذا ركع وإذا رفع رأسه من الركوع وإذا جلس أضجع اليسرى ونصب اليمنى ووضع يده اليسرى على فخذه اليسرى ويده اليمنى على فخذه اليمنى وعقد ثنتين الوسطى والإبهام وأشار ‏.‏",
      "text_en": " It was narrated that Wa'il bin Hujr said:                     \"I saw the Messenger of Allah (ﷺ) raise his hands when he started to pray, and when he bowed, and when he raised his head from bowing. And when he sat, he would ay his left foot on the ground and keep his right foot upright, and he placed his left hand on his left thigh, and his right hand on his right thigh, making a circle with his middle finger and thumb, and pointing.\"",
      "chain": [
        "30367",
        "20005",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "1264",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن علي بن ميمون الرقي، قال حدثنا محمد، - وهو ابن يوسف الفريابي - قال حدثنا سفيان، عن عاصم بن كليب، عن أبيه، عن وائل بن حجر، أنه رأى النبي صلى الله عليه وسلم جلس في الصلاة فافترش رجله اليسرى ووضع ذراعيه على فخذيه وأشار بالسبابة يدعو بها ‏.‏",
      "text_en": " It was narrated from Wa'il bin Hujr that :                     He saw the Prophet (ﷺ) sitting during the prayer. He lay his left foot on the ground and placed his forearms on his thighs, and pointed with his forefinger, supplicating with it.",
      "chain": [
        "38556",
        "20034",
        "20012",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "1265",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال أنبأنا بشر بن المفضل، قال حدثنا عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال قلت لأنظرن إلى صلاة رسول الله صلى الله عليه وسلم كيف يصلي فقام رسول الله صلى الله عليه وسلم فاستقبل القبلة فرفع يديه حتى حاذتا أذنيه ثم أخذ شماله بيمينه فلما أراد أن يركع رفعهما مثل ذلك ووضع يديه على ركبتيه فلما رفع رأسه من الركوع رفعهما مثل ذلك فلما سجد وضع رأسه بذلك المنزل من يديه ثم جلس فافترش رجله اليسرى ووضع يده اليسرى على فخذه اليسرى وحد مرفقه الأيمن على فخذه اليمنى وقبض ثنتين وحلق ورأيته يقول هكذا وأشار بشر بالسبابة من اليمنى وحلق الإبهام والوسطى ‏.‏",
      "text_en": " It was narrated that Wa'il bin Hujr said:                     \"I said: 'I am going to watch the Messenger of Allah (ﷺ) and see how he prays.' The Messenger of Allah (ﷺ) stood up and faced the Qiblah, then he raised his hands until they were in level with his ears, then he held his left hand with his right. When he wanted to bow, he raised them (his hands) likewise, then placed his hands on his knees. When he raised his head from bowing, he raised them (his hands) likewise. When he prostrated he put his hands in the same position in relation to his head, then he sat up and lay his left foot on the ground. He placed his left hand on his left thigh and his right elbow on his right thigh, and made a circle with two of his fingers. And I saw him doing like this\"- Bishr (one of the narrators) pointed with the forefinger of his right hand and made a circle with the thumb and middle finger.",
      "chain": [
        "34033",
        "20212",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "1268",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله بن المبارك، عن زائدة، قال حدثنا عاصم بن كليب، قال حدثني أبي أن وائل بن حجر، قال قلت لأنظرن إلى صلاة رسول الله صلى الله عليه وسلم كيف يصلي فنظرت إليه فوصف قال ثم قعد وافترش رجله اليسرى ووضع كفه اليسرى على فخذه وركبته اليسرى وجعل حد مرفقه الأيمن على فخذه اليمنى ثم قبض اثنتين من أصابعه وحلق حلقة ثم رفع أصبعه فرأيته يحركها يدعو بها ‏.‏ مختصر ‏.‏",
      "text_en": " Wa'il bin Hujr said:                     \"I am going to watch the Messenger of Allah (ﷺ) and see how he prays. So, I watched him.\" And he described (his prayer): \"Then he sat and lay his left foot on the ground, and placed his left hand on his left thigh and knee. He put his right elbow on his right thigh, then he made a circle with two fingers of his (right) hand, then he raised his finger and I saw him moving it, supplicating with it.\"",
      "chain": [
        "38265",
        "20025",
        "20320",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "1645",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا صالح بن مهران، - وكان ثقة - قال حدثنا النعمان بن عبد السلام، عن سفيان، عن عاصم بن كليب، عن أبيه، عن أبي هريرة، قال كان رسول الله صلى الله عليه وسلم يصلي حتى تزلع يعني تشقق قدماه ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah (ﷺ) used to pray until he developed fissures in his feet.\"",
      "chain": [
        "30153",
        "38276",
        "28605",
        "20005",
        "10778",
        "19941",
        "13"
      ]
    },
    {
      "hadith_no": "2458",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا هارون بن زيد بن يزيد، - يعني ابن أبي الزرقاء - قال حدثنا أبي قال، حدثنا سفيان، عن عاصم بن كليب، عن أبيه، عن وائل بن حجر، أن النبي صلى الله عليه وسلم بعث ساعيا فأتى رجلا فأتاه فصيلا مخلولا فقال النبي صلى الله عليه وسلم ‏\"‏ بعثنا مصدق الله ورسوله وإن فلانا أعطاه فصيلا مخلولا اللهم لا تبارك فيه ولا في إبله ‏\"‏ ‏.‏ فبلغ ذلك الرجل فجاء بناقة حسناء فقال أتوب إلى الله عز وجل وإلى نبيه صلى الله عليه وسلم ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ اللهم بارك فيه وفي إبله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from wa'il bin Hujr that:                     the Prophet sent a collector and he came to a man who brought him a slim, recently-weaned camel. The Prophet said: \"We sent to Zakah collector of Allah and His Messenger, and so-and-so gave him a slim, recently-weaned camel. O Allah, do not bless him nor his camels!\" News of that reached the man, so he came with a beautiful she-camel and said: \"I repent to Allah and to His Prophet. \" The Prophet said: \"O Allah, bless him and his camels!\" (Daif)",
      "chain": [
        "20005",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "3472",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا علي بن ميمون، قال حدثنا سفيان، عن عاصم بن كليب، عن أبيه، عن ابن عباس، أن النبي صلى الله عليه وسلم أمر رجلا حين أمر المتلاعنين أن يتلاعنا أن يضع يده عند الخامسة على فيه وقال ‏\"‏ إنها موجبة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas:                      \"When the Prophet commanded the two who were engaging in Li'an to utter the fifth oath, he commanded a man to place his hand over his mouth, and he said: \"It will inevitably bring the punishment upon the liar.\"\"",
      "chain": [
        "20012",
        "10778",
        "19941",
        "17"
      ]
    },
    {
      "hadith_no": "4383",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا هناد بن السري، في حديثه عن أبي الأحوص، عن عاصم بن كليب، عن أبيه، قال كنا في سفر فحضر الأضحى فجعل الرجل منا يشتري المسنة بالجذعتين والثلاثة فقال لنا رجل من مزينة كنا مع رسول الله صلى الله عليه وسلم في سفر فحضر هذا اليوم فجعل الرجل يطلب المسنة بالجذعتين والثلاثة فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الجذع يوفي مما يوفي منه الثني ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Asim bin Kulaib that his father said:                     \"We were on a journey and the day of Al-adha came, so we started to by sheep, a Musinnah for two or three Jadh'ahs. A man from Muzainah said to us: 'We were with the Messenger of Allah on a journey when this came, and we stated to look for sheep, (offering to buy) aMusinnah for two or three Jadh'ahs.  Then the Messenger of Allah said: \"A Jadh'ah is sufficient for that for which a Thani is sufficient.\"",
      "chain": [
        "30480",
        "20327",
        "10778",
        "19941"
      ]
    },
    {
      "hadith_no": "4384",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، قال حدثنا شعبة، عن عاصم بن كليب، قال سمعت أبي يحدث، عن رجل، قال كنا مع النبي صلى الله عليه وسلم قبل الأضحى بيومين نعطي الجذعتين بالثنية فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الجذعة تجزئ ما تجزئ منه الثنية ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Asim bin Kulaib said:                     \"I heard my father narrating from a man who said: 'We were with the Messenger of Allah two days before Al-Adha and we started to offer two Jadh ahs for one Thaniiyah, Then the Messenger of Allah said: 'A Jadh'ah is sufficient for that for which a Thaniyah is sufficient.\"",
      "chain": [
        "30449",
        "20423",
        "20020",
        "10778",
        "19941"
      ]
    },
    {
      "hadith_no": "5052",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا سفيان، أخو قبيصة ومعاوية بن هشام قالا حدثنا سفيان، قال حدثنا عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال أتيت النبي صلى الله عليه وسلم ولي شعر فقال ‏\"‏ ذباب ‏\"‏ ‏.‏ فظننت أنه يعنيني فأخذت من شعري ثم أتيته فقال لي ‏\"‏ لم أعنك وهذا أحسن ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Wa'il bin Hujr said:                     \"I came to the Prophet [SAW] and I had hair. He said: 'This is bad,' and I thought he meant me, so I cut my hair then I came to him. He said to me: 'I didn't mean you, but this is better.'\"",
      "chain": [
        "30277",
        "20005",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "5066",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أحمد بن حرب، قال حدثنا قاسم، قال حدثنا سفيان، عن عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال أتيت النبي صلى الله عليه وسلم ولي جمة قال ‏\"‏ ذباب ‏\"‏ ‏.‏ وظننت أنه يعنيني فانطلقت فأخذت من شعري فقال ‏\"‏ إني لم أعنك وهذا أحسن ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Wa'il bin Hujr said:                     \"I came to the Prophet [SAW] and I had long hair. He said: 'It is not good,' and I thought he meant me, so I went and cut my hair. He said: 'I did not mean you, but this is better.'\"",
      "chain": [
        "38011",
        "20005",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "859",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، حدثنا عبد الله بن إدريس، ح وحدثنا بشر بن معاذ الضرير، حدثنا بشر بن المفضل، قالا حدثنا عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال رأيت النبي  صلى الله عليه وسلم  يصلي فأخذ شماله بيمينه ‏.‏",
      "text_en": " It wasnarrated that Wa’il bin Hujr said:                      “I saw the Prophet (ﷺ)performing prayer, and he took hold of his left hand with his right.”",
      "chain": [
        "38409",
        "20102",
        "34041",
        "20212",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "916",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بشر بن معاذ الضرير، حدثنا بشر بن المفضل، حدثنا عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال قلت لأنظرن إلى رسول الله  صلى الله عليه وسلم  كيف يصلي فقام فاستقبل القبلة فرفع يديه حتى حاذتا أذنيه فلما ركع رفعهما مثل ذلك فلما رفع رأسه من الركوع رفعهما مثل ذلك ‏.‏",
      "text_en": " It wasnarrated that Wa’il bin Hujr said:                      “I said: ‘I will look attheMessenger of Allah (ﷺ) and see how he performs the prayer.’ Hestood up and faced the Qiblah, and raised his hands until they wereparallel to his ears. When he bowed, he raised them likewise, andwhenhe raised his head from Ruku’, he raised them likewise.”",
      "chain": [
        "34041",
        "20212",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "932",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا يزيد بن هارون، أنبأنا شريك، عن عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال رأيت النبي  صلى الله عليه وسلم  إذا سجد وضع ركبتيه قبل يديه وإذا قام من السجود رفع يديه قبل ركبتيه ‏.‏",
      "text_en": " It wasnarrated that Wa’il bin Hujr said:                      “I saw the Prophet (ﷺ)whenhe prostrated and put his knees on the ground before his hands,andwhen he stood up after prostrating, he took his hands off thegroundbefore his knees.”",
      "chain": [
        "30115",
        "20472",
        "20587",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "945",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن ثواب، حدثنا أبو نعيم النخعي، عن أبي مالك، عن عاصم بن كليب، عن أبيه، عن أبي موسى، وأبي، إسحاق عن الحارث، عن علي، قال قال النبي  صلى الله عليه وسلم  ‏\"‏ يا علي لا تقع إقعاء الكلب ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Ali said:                      “The Prophet (ﷺ) said: ‘O ‘Ali, donot squat like a dog.’”",
      "chain": [
        "10766",
        "10778",
        "19941",
        "41",
        "11049",
        "5"
      ]
    },
    {
      "hadith_no": "965",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، حدثنا عبد الله بن إدريس، عن عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال رأيت النبي  صلى الله عليه وسلم  قد حلق الإبهام والوسطى ورفع التي تليهما يدعو بها في التشهد ‏.‏",
      "text_en": " It wasnarrated that Wa’il bin Hujr said:                      “I saw the Prophet (ﷺ)making a circle with his thumb and middle finger, and raising the onenext to it (the index finger), supplicating with it during theTashah-hud.”",
      "chain": [
        "38409",
        "20102",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "3260",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد الرزاق، أنبأنا الثوري، عن عاصم بن كليب، عن أبيه، قال كنا مع رجل من أصحاب رسول الله  صلى الله عليه وسلم  يقال له مجاشع من بني سليم فعزت الغنم فأمر مناديا فنادى أن رسول الله  صلى الله عليه وسلم  كان يقول ‏\"‏ إن الجذع يوفي مما توفي منه الثنية ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Asim bin Kulaib that his father said:                      “We werewith a man from among the Companions of the Messenger of Allah (ﷺ)who was called Mujashi’, from Banu Sulaim, and sheep became scarce.Heordered a caller to call out that the Messenger of Allah (ﷺ)used tosay: ‘A Jadha’a suffices for whatever a two-year-oldsheep suffices.’”",
      "chain": [
        "11222",
        "20121",
        "20012",
        "10778",
        "19941"
      ]
    },
    {
      "hadith_no": "3767",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا معاوية بن هشام، وسفيان بن عقبة، عن سفيان، عن عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال رآني النبي  صلى الله عليه وسلم  ولي شعر طويل فقال ‏\"‏ ذباب ذباب ‏\"‏ ‏.‏ فانطلقت فأخذته فرآني النبي  صلى الله عليه وسلم  فقال ‏\"‏ إني لم أعنك وهذا أحسن ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Wa’il bin Hujr said:                      “The Prophet (ﷺ) saw mewhenI had long hair. He said: ‘Bad news, bad news!’ So I went awayand cut it short. Then the Prophet (ﷺ) saw me and said: ‘I didnotmean you, but this is better.’”",
      "chain": [
        "30201",
        "20609",
        "20586",
        "20012",
        "10778",
        "19941",
        "3045"
      ]
    }
  ],
  "total_hadiths": 37
}