{
  "id": "19946",
  "name": "al-Mughira bin Abi Burda المغيرة بن أبي بردة",
  "full_name": "al-Mughira bin Abi Burda المغيرة بن أبي بردة",
  "grade": "Follower(Tabi') [3rd Generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Nisa'"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ 4  -  ثقة ]"
    ],
    "tags": [
      "al-Nisa'i"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "20502",
      "name": "Sa'id bin Salmah bin Aby سعيد بن سلمة بن أبي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10852",
      "name": "al-Jlah Abu Kathir al-Amwy Mwlahm الجلاح أبو كثير",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11867",
      "name": "'Abdullah bin Abi Salah al-Saman عبد الله/عباد بن أبي صالح السمان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11546",
      "name": "Yazid bin Muhammad bin Qays يزيد بن محمد بن قيس بن مخرمة",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "jami-al-tirmidhi-69",
      "hadith_no": "69",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة، عن مالك، ح وحدثنا الأنصاري، إسحاق بن موسى حدثنا معن، حدثنا مالك، عن صفوان بن سليم، عن سعيد بن سلمة، من آل ابن الأزرق أن المغيرة بن أبي بردة، وهو من بني عبد الدار أخبره أنه، سمع أبا هريرة، يقول سأل رجل رسول الله صلى الله عليه وسلم فقال يا رسول الله إنا نركب البحر ونحمل معنا القليل من الماء فإن توضأنا به عطشنا أفنتوضأ من ماء البحر فقال رسول الله صلى الله عليه وسلم ‏\"‏ هو الطهور ماؤه الحل ميتته ‏\"‏ ‏.‏ قال وفي الباب عن جابر والفراسي ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وهو قول أكثر الفقهاء من أصحاب النبي صلى الله عليه وسلم منهم أبو بكر وعمر وابن عباس لم يروا بأسا بماء البحر ‏.‏ وقد كره بعض أصحاب النبي صلى الله عليه وسلم الوضوء بماء البحر منهم ابن عمر وعبد الله بن عمرو ‏.‏ وقال عبد الله بن عمرو هو نار ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"A man asked Allah's Messenger 'O Messenger of Allah! We sail the seas, and we only carry a little water with us. If we use it for Wudu then we will go thirsty. So shall we perform Wudu from the (water of the) sea?' Allah's Messenger said: 'Its water is pure, and its dead are lawful.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "30112",
        "20001",
        "11177",
        "20502",
        "19946",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-59",
      "hadith_no": "59",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن صفوان بن سليم، عن سعيد بن سلمة، أن المغيرة بن أبي بردة، من بني عبد الدار أخبره أنه، سمع أبا هريرة، يقول سأل رجل رسول الله صلى الله عليه وسلم فقال يا رسول الله إنا نركب البحر ونحمل معنا القليل من الماء فإن توضأنا به عطشنا أفنتوضأ من ماء البحر فقال رسول الله صلى الله عليه وسلم ‏\"‏ هو الطهور ماؤه الحل ميتته ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                      \"A man asked the Prophet (ﷺ): 'O Messenger of Allah, we travel by sea and we take a little water with us, but if we use it for Wudu', we will go thirsty. Can we perform Wudu', with sea-water?' The Messenger of Allah (ﷺ) said: 'Its water is a means of purification and its dead meat is permissible.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11177",
        "20502",
        "19946",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-332",
      "hadith_no": "332",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Water - كتاب المياه",
      "chapter_no": "2",
      "text_ar": "أخبرنا قتيبة، عن مالك، عن صفوان بن سليم، عن سعيد بن سلمة، أن المغيرة بن أبي بردة، أخبره أنه، سمع أبا هريرة، يقول سأل رجل رسول الله صلى الله عليه وسلم فقال يا رسول الله إنا نركب البحر ونحمل معنا القليل من الماء فإن توضأنا به عطشنا أفنتوضأ من ماء البحر فقال رسول الله صلى الله عليه وسلم ‏\"‏ هو الطهور ماؤه الحل ميتته ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                      \"A man asked the prophet (ﷺ): 'O Messenger of Allah, we travel by sea and we take a little water with us, but if we use it for Wudu', we will go thirsty. Can we perform Wudu' with seawater?' The Messenger of Allah (ﷺ) said: 'Its water is a means of purification and its dead meat is permissible.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20001",
        "11177",
        "20502",
        "19946",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-4350",
      "hadith_no": "4350",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا إسحاق بن منصور، قال حدثنا عبد الرحمن، قال حدثنا مالك، عن صفوان بن سليم، عن سعيد بن سلمة، عن المغيرة بن أبي بردة، عن أبي هريرة، عن النبي صلى الله عليه وسلم في ماء البحر ‏\"‏ هو الطهور ماؤه الحلال ميتته ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah, that the Prophet (said), concerning the water of the sea:                     \"Its water is pure (and Purification) and its 'dead meat' is permissible (to eat).\"",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20033",
        "20001",
        "11177",
        "20502",
        "19946",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-417",
      "hadith_no": "417",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا هشام بن عمار، حدثنا مالك بن أنس، حدثني صفوان بن سليم، عن سعيد بن سلمة، - هو من آل ابن الأزرق - أن المغيرة بن أبي بردة، - وهو من بني عبد الدار - حدثه أنه، سمع أبا هريرة، يقول جاء رجل إلى رسول الله  صلى الله عليه وسلم  فقال يا رسول الله إنا نركب البحر ونحمل معنا القليل من الماء فإن توضأنا به عطشنا أفنتوضأ من ماء البحر فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ هو الطهور ماؤه الحل ميتته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Mughirah bin Abu Burdah, who was from the tribe of Banu 'Abdud-Dar, said that:                     He heard Abu Hurairah say: \"A man came to the Messenger of Allah and said: \"O Messenger of Allah, we travel by sea and carry a small amount of water with us. If we use it for ablution, we will become thirsty. Can we perform ablution with seawater?' The Messenger of Allah said: 'Its water is a means of purification, ad its dead meat is permissible. (i.e. the fish found dead in the sea).'\"",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20001",
        "11177",
        "20502",
        "19946",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3369",
      "hadith_no": "3369",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا هشام بن عمار، حدثنا مالك بن أنس، حدثني صفوان بن سليم، عن سعيد بن سلمة، من آل ابن الأزرق أن المغيرة بن أبي بردة، - وهو من بني عبد الدار - حدثه أنه، سمع أبا هريرة، يقول قال رسول الله  صلى الله عليه وسلم  ‏\"‏ البحر الطهور ماؤه الحل ميتته ‏\"‏ ‏.‏ قال أبو عبد الله بلغني عن أبي عبيدة الجواد أنه قال هذا نصف العلم لأن الدنيا بر وبحر فقد أفتاك في البحر وبقي البر ‏.‏",
      "text_en": " Mughirahbin Abu Burdah, who was of the tribe of Banu ‘Abd-Dar,narratedthat he heard Abu Hurairah say:                      “The Messenger of Allah (ﷺ)said:‘The water of the sea is a means of purification and its deadmeatis permissible.’”",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20001",
        "11177",
        "20502",
        "19946",
        "13"
      ]
    }
  ],
  "total_hadiths": 6
}