{
  "id": "19950",
  "name": "Yazid bin Abi Sa'id يزيد بن أبي سعيد النحوي أبو الحسن",
  "full_name": "Yazid bin Abi Sa'id يزيد بن أبي سعيد النحوي أبو الحسن",
  "grade": "Follower(Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "131",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ بخ  4  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "1304",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن محمد المروزي ابن شبوية، حدثني علي بن حسين، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال في المزمل ‏{‏ قم الليل إلا قليلا * نصفه ‏}‏ نسختها الآية التي فيها ‏{‏ علم أن لن تحصوه فتاب عليكم فاقرءوا ما تيسر من القرآن ‏}‏ وناشئة الليل أوله وكانت صلاتهم لأول الليل يقول هو أجدر أن تحصوا ما فرض الله عليكم من قيام الليل وذلك أن الإنسان إذا نام لم يدر متى يستيقظ وقوله ‏{‏ أقوم قيلا ‏}‏ هو أجدر أن يفقه في القرآن وقوله ‏{‏ إن لك في النهار سبحا طويلا ‏}‏ يقول فراغا طويلا ‏.‏",
      "text_en": " Narrated Abdullah Ibn Abbas:                     In Surat al-Muzzammil (73), the verse: \"Keep vigil at night but a little, a half thereof\" (2-3) has been abrogated by the following verse: \"He knoweth that ye count it not, and turneth unto you in mercy. Recite then of the Qur'an that which is easy for you\" (v.20). The phrase \"the vigil of the night\" (nashi'at al-layl) means the early hours of the night. They (the companions) would pray (the tahajjud prayer) in the early hours of the night.  He (Ibn Abbas) says: It is advisable to offer the prayer at night (tahajjud), prescribed by Allah for you (in the early hours of the night). This is because when a person sleeps, he does not know when he will awake. The words \"speech more certain\" (aqwamu qilan) means that this time is more suitable for the understanding of the Qur'an. He says: The verse: \"Lo, thou hast by day a chain of business\" (v.7) means engagement for long periods (in the day's work).",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2090",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن محمد بن ثابت المروزي، حدثني علي بن حسين بن واقد، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال ‏{‏ لا يحل لكم أن ترثوا النساء كرها ولا تعضلوهن لتذهبوا ببعض ما آتيتموهن إلا أن يأتين بفاحشة مبينة ‏}‏ وذلك أن الرجل كان يرث امرأة ذي قرابته فيعضلها حتى تموت أو ترد إليه صداقها فأحكم الله عن ذلك ونهى عن ذلك ‏.‏",
      "text_en": " Ibn ‘Abbas explained the Qur’anic verse It is not lawful for you forcibly to inherit the woman (of your deceased kinsmen) nor (that) ye should put constraint upon them that ye may take away a part of that which ye have given them, unless they be guilty of flagrant lewdness and said “This means that a man used to inherit a relative woman. He prevented her from marriage till she died or returned her dower to her. Hence, Allaah prohibited that practice.",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2195",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن محمد المروزي، حدثني علي بن حسين بن واقد، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال ‏{‏ والمطلقات يتربصن بأنفسهن ثلاثة قروء ولا يحل لهن أن يكتمن ما خلق الله في أرحامهن ‏}‏ الآية وذلك أن الرجل كان إذا طلق امرأته فهو أحق برجعتها وإن طلقها ثلاثا فنسخ ذلك وقال ‏{‏ الطلاق مرتان ‏}‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     Divorced women shall wait concerning themselves for three monthly periods. Nor is it lawful for them to hide what Allah hath created in their wombs. This means that if a man divorced his wife he had the right to take her back in marriage though he had divorced her by three pronouncements. This was then repealed (by a Qur'anic verse). Divorce is only permissible twice.",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2282",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثني أحمد بن محمد بن ثابت المروزي، حدثني علي بن حسين، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال ‏{‏ والمطلقات يتربصن بأنفسهن ثلاثة قروء ‏}‏ ‏.‏ وقال ‏{‏ واللائي يئسن من المحيض من نسائكم إن ارتبتم فعدتهن ثلاثة أشهر ‏}‏ فنسخ من ذلك وقال ‏{‏ وإن طلقتموهن من قبل أن تمسوهن ‏}‏ ‏{‏ فما لكم عليهن من عدة تعتدونها ‏}‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     Women who are divorced shall wait, keeping themselves apart, three monthly courses; and then said: And for such of your women as despair of menstruation, if ye doubt, their period (of waiting) shall be three months. This was abrogated from the former verse. Again he said: (O ye who believe, if ye wed believing women) and divorce them before ye have touched them, then there is no period that ye should reckon.\"",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2298",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن محمد المروزي، حدثني علي بن الحسين بن واقد، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، ‏{‏ والذين يتوفون منكم ويذرون أزواجا وصية لأزواجهم متاعا إلى الحول غير إخراج ‏}‏ فنسخ ذلك بآية الميراث بما فرض لهن من الربع والثمن ونسخ أجل الحول بأن جعل أجلها أربعة أشهر وعشرا ‏.‏",
      "text_en": " The Qur’anic verse “Those of you who die and leave widows should bequeath for their widows a year’s maintenance and residence was abrogated by the verse containing the laws of succession, as one-fourth or one-eighth share was prescribed for them (i.e., the widows). The waiting period for one year was also repealed as a period of four months ten days was prescribed for them.",
      "chain": [
        "30304",
        "30555",
        "20648",
        "19950",
        "11023"
      ]
    },
    {
      "hadith_no": "2313",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن محمد بن شبوية، حدثني علي بن حسين بن واقد، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، ‏{‏ يا أيها الذين آمنوا كتب عليكم الصيام كما كتب على الذين من قبلكم ‏}‏ فكان الناس على عهد النبي صلى الله عليه وسلم إذا صلوا العتمة حرم عليهم الطعام والشراب والنساء وصاموا إلى القابلة فاختان رجل نفسه فجامع امرأته وقد صلى العشاء ولم يفطر فأراد الله عز وجل أن يجعل ذلك يسرا لمن بقي ورخصة ومنفعة فقال سبحانه ‏{‏ علم الله أنكم كنتم تختانون أنفسكم ‏}‏ ‏.‏ وكان هذا مما نفع الله به الناس ورخص لهم ويسر ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     Ibn Abbas explained the following Qur'anic verse: \"O ye who believe! fasting is prescribed for you as it was prescribed for those before you\" During the lifetime of the Prophet (ﷺ), when the people offered night prayer, they were asked to abstain from food and drink and (intercourse with) women, they kept fast till the next night. A man betrayed himself and had intercourse with his wife after he had offered the night prayer, and he did not break his fast. So Allah, the Exalted, intended to make it (fasting) easy for those who survived,  thus providing a concession and utility. Allah, the Glorified, said: \"Allah knoweth what ye used to do secretly among yourselves.\" By this Allah benefited the people and provided concession and ease to them.",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023"
      ]
    },
    {
      "hadith_no": "2316",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن محمد، حدثني علي بن حسين، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، ‏{‏ وعلى الذين يطيقونه فدية طعام مسكين ‏}‏ فكان من شاء منهم أن يفتدي بطعام مسكين افتدى وتم له صومه فقال ‏{‏ فمن تطوع خيرا فهو خير له وأن تصوموا خير لكم ‏}‏ وقال ‏{‏ فمن شهد منكم الشهر فليصمه ومن كان مريضا أو على سفر فعدة من أيام أخر ‏}‏ ‏.‏",
      "text_en": " Ibn ‘Abbas explain the Qur’anic verse “For those who can do it(with hardship) is a ransom, the feeding of one, that is indigent” said “If one of them wished to pay ransom by providing food to an indigent person he could pay ransom.. Thus, his fast was complete. Allaah, the Exalted pronounced “But he that will give more of his own free will, it is better for him”. Again he pronounced “So every one of you who is present (at his home) during that month should spend it in fasting.” But, if anyone is ill or on a journey the prescribed period (should be made up) by days later.",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023"
      ]
    },
    {
      "hadith_no": "2505",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن محمد المروزي، حدثني علي بن الحسين، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال ‏{‏ إلا تنفروا يعذبكم عذابا أليما ‏}‏ و ‏{‏ ما كان لأهل المدينة ‏}‏ إلى قوله ‏{‏ يعملون ‏}‏ نسختها الآية التي تليها ‏{‏ وما كان المؤمنون لينفروا كافة ‏}‏",
      "text_en": " Ibn ‘Abbas said “The Qur’anic verse “Unless you go forth, He will punish you with a grievous penalty, and the verse “It is not fitting for the people of Medina”... up to “that Allaah might required their deed with the best (possible reward)  have been repealed by the verse. Nor should the believers all go forth together.”",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2771",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن محمد بن ثابت المروزي، حدثني علي بن حسين، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال ‏{‏ لا يستأذنك الذين يؤمنون بالله واليوم الآخر ‏}‏ الآية نسختها التي في النور ‏{‏ إنما المؤمنون الذين آمنوا بالله ورسوله ‏}‏ إلى قوله ‏{‏ غفور رحيم ‏}‏ ‏.‏",
      "text_en": " Ibn ‘Abbas said “The verse “Those who believe in Allaah and the Last Day ask thee for no exemption from fighting with their goods and persons” was abrogated by the verse “Only those are believers who believe in Allaah and His Apostle....For Allaah is Oft-Forgiving, Most Merciful.”",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2817",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا أحمد بن محمد بن ثابت المروزي، حدثني علي بن حسين، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال ‏{‏ فكلوا مما ذكر اسم الله عليه ‏}‏ ‏{‏ ولا تأكلوا مما لم يذكر اسم الله عليه ‏}‏ فنسخ واستثنى من ذلك فقال ‏{‏ وطعام الذين أوتوا الكتاب حل لكم وطعامكم حل لهم ‏}‏ ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     The verse: \"So eat of (meats) on which Allah's name hath been pronounced\" and the verse: \"Eat not of  (meats) on which Allah's name hath not been pronounced\" were abrogated, meaning an exception was made therein by the verse: \"The food of the people of the Book is lawful unto you and yours is lawful unto them.\"",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2869",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wills (Kitab Al-Wasaya) - كتاب الوصايا",
      "chapter_no": "18",
      "text_ar": "حدثنا أحمد بن محمد المروزي، حدثني علي بن حسين بن واقد، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، ‏{‏ إن ترك خيرا الوصية للوالدين والأقربين ‏}‏ فكانت الوصية كذلك حتى نسختها آية الميراث ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     The Qur'anic verse goes: \"(It is prescribed when death approaches any of you), if he leaves any goods, that he may bequest to parents and next to kin.\" The bequest was made in this way until the verse of inheritance repealed it.",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023"
      ]
    },
    {
      "hadith_no": "2921",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا أحمد بن محمد بن ثابت، حدثني علي بن حسين، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، رضى الله عنهما قال ‏{‏ والذين عقدت أيمانكم فآتوهم نصيبهم ‏}‏ كان الرجل يحالف الرجل ليس بينهما نسب فيرث أحدهما الآخر فنسخ ذلك الأنفال فقال تعالى ‏{‏ وأولو الأرحام بعضهم أولى ببعض ‏}‏ ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     To those also, to whom your right hand was pledged, give their due portion. A man made an agreement with another man (in early days of Islam), and there was no relationship between the ; one of them inherited from the other. The following verse of Surat Al-Anfal abrogated it: \"But kindred by blood have prior right against each other.\"",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2924",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا أحمد بن محمد، حدثنا علي بن حسين، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، والذين، آمنوا وهاجروا والذين آمنوا ولم يهاجروا فكان الأعرابي لا يرث المهاجر ولا يرثه المهاجر فنسختها فقال ‏{‏ وأولو الأرحام بعضهم أولى ببعض ‏}‏",
      "text_en": " Narrated Ibn 'Abbas:                     Referring to the verse: \"Those who believed and adopted exile... As to those who believed but came not into exile\": A bedouin (who did not migrate to Medina) did not inherit from an emigrant, and an emigrant did no inherit from him. It was abrogated by the verse: \"But kindred by blood have prior rights against each other.\"",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3590",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن محمد المروزي، حدثني علي بن حسين، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال ‏{‏ فإن جاءوك فاحكم بينهم أو أعرض عنهم ‏}‏ فنسخت قال ‏{‏ فاحكم بينهم بما أنزل الله ‏}‏ ‏.‏",
      "text_en": " Ibn 'Abbas said:                      The Qur'anic verse: \"If they do come to thee, either judge between them, or decline to interfere\" was abrogated by the verse: \"So judge between them by what Allah hath revealed.\"",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3672",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن محمد المروزي، حدثنا علي بن حسين، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال ‏{‏ يا أيها الذين آمنوا لا تقربوا الصلاة وأنتم سكارى ‏}‏ و ‏{‏ يسألونك عن الخمر والميسر قل فيهما إثم كبير ومنافع للناس ‏}‏ نسختهما التي في المائدة ‏{‏ إنما الخمر والميسر والأنصاب ‏}‏ الآية ‏.‏",
      "text_en": " Ibn  Abbas said:                      The Quranic verse :”O ye who believe ,approach not prayer with minds befogged until you can understand all they say,” and the verse: “They ask thee concerning wine and gambling.  Say: In them is great sin and some profit for men ,” were repeated by the verse in Surat al-Ma’idah: ”O ye who believe, intoxicants and gambling,(dedication) stones.",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3753",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن محمد المروزي، حدثني علي بن الحسين بن واقد، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال ‏{‏ لا تأكلوا أموالكم بينكم بالباطل إلا أن تكون تجارة عن تراض منكم ‏}‏ فكان الرجل يحرج أن يأكل عند أحد من الناس بعد ما نزلت هذه الآية فنسخ ذلك الآية التي في النور قال ‏{‏ ليس عليكم جناح ‏}‏ ‏{‏ أن تأكلوا من بيوتكم ‏}‏ إلى قوله ‏{‏ أشتاتا ‏}‏ كان الرجل الغني يدعو الرجل من أهله إلى الطعام قال إني لأجنح أن آكل منه ‏.‏ والتجنح الحرج ويقول المسكين أحق به مني ‏.‏ فأحل في ذلك أن يأكلوا مما ذكر اسم الله عليه وأحل طعام أهل الكتاب ‏.‏",
      "text_en": " Narrated Abdullah Ibn Abbas:                     When the verse: \"O ye who believe! eat not up your property among yourselves in vanities, but let there be amongst you traffic and trade by mutual good will\" was revealed, a man thought it a sin to eat in the house of another man after the revelation of this verse.  Then this (injunction) was revealed by the verse in Surat an-Nur: \"No blame on you whether you eat in company or separately.\"  When a rich man (after revelation) invited a man from his people to eat food in his house, he would say: I consider it a sin to eat from it, and he said: a poor man is more entitled to it than I. The Arabic word tajannah means sin or fault. It was then declared lawful to eat something on which the name of Allah was mentioned, and it was made lawful to eat the flesh of an animal slaughtered by the people of the Book.",
      "chain": [
        "30304",
        "30555",
        "20648",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4111",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا أحمد بن محمد المروزي، حدثنا علي بن الحسين بن واقد، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، ‏{‏ وقل للمؤمنات يغضضن من أبصارهن ‏}‏ الآية فنسخ واستثني من ذلك ‏{‏ والقواعد من النساء اللاتي لا يرجون نكاحا ‏}‏ الآية ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     The verse: \"And say to the believing women that they should lower gaze was partly abrogated by the verse: \"Such elderly women as are past the prospect of marriage.\"",
      "chain": [
        "30304",
        "30555",
        "20648",
        "19950",
        "11023"
      ]
    },
    {
      "hadith_no": "4358",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن محمد المروزي، حدثنا علي بن الحسين بن واقد، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال كان عبد الله بن سعد بن أبي سرح يكتب لرسول الله صلى الله عليه وسلم فأزله الشيطان فلحق بالكفار فأمر به رسول الله صلى الله عليه وسلم أن يقتل يوم الفتح فاستجار له عثمان بن عفان فأجاره رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     Abdullah ibn AbuSarh used to write (the revelation) for the Messenger of Allah (ﷺ). Satan made him slip, and he joined the infidels. The Messenger of Allah (ﷺ) commanded to kill him on the day of Conquest (of Mecca). Uthman ibn Affan sought protection for him. The Messenger of Allah (ﷺ) gave him protection.",
      "chain": [
        "30304",
        "30555",
        "20648",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4372",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن محمد بن ثابت، حدثنا علي بن حسين، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال ‏{‏ إنما جزاء الذين يحاربون الله ورسوله ويسعون في الأرض فسادا أن يقتلوا أو يصلبوا أو تقطع أيديهم وأرجلهم من خلاف أو ينفوا من الأرض ‏}‏ إلى قوله ‏{‏ غفور رحيم ‏}‏ نزلت هذه الآية في المشركين فمن تاب منهم قبل أن يقدر عليه لم يمنعه ذلك أن يقام فيه الحد الذي أصابه ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The verse \"The punishment of those who wage war against Allah and His Apostle, and strive with might and main for mischief through the land is execution, or crucifixion, or the cutting off of hands and feet from opposite side or exile from the land...most merciful\" was revealed about polytheists. If any of them repents before they are arrested, it does not prevent from inflicting on him the prescribed punishment which he deserves.",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4413",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن محمد بن ثابت المروزي، حدثني علي بن الحسين، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال ‏{‏ واللاتي يأتين الفاحشة من نسائكم فاستشهدوا عليهن أربعة منكم فإن شهدوا فأمسكوهن في البيوت حتى يتوفاهن الموت أو يجعل الله لهن سبيلا ‏}‏ وذكر الرجل بعد المرأة ثم جمعهما فقال ‏{‏ واللذان يأتيانها منكم فآذوهما فإن تابا وأصلحا فأعرضوا عنهما ‏}‏ فنسخ ذلك بآية الجلد فقال ‏{‏ الزانية والزاني فاجلدوا كل واحد منهما مائة جلدة ‏}‏ ‏.‏",
      "text_en": " Ibn ‘Abbas said:                      The Qur’anic verse goes: “If any of your woman are guilty of lewdness, take the evidence of four (reliable) witnesses from amongst you against them, and if they testify, Confine them to houses until death do chain them or Allah ordains for them some (other) way. Allah then mentioned man after woman and combined them in another verse :  “If two men among you are guilty of lewdness, punish them both. If they repent and amend, leave them alone. This command was abrogated by the verse relating to flogging : “The woman and the man guilty of adultery or fornication – flog  each of them with one hundred stripes.",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4560",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن حاتم بن بزيع، حدثنا علي بن الحسن، أخبرنا أبو حمزة، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الأسنان سواء والأصابع سواء ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: The teeth are equal, and the fingers are equal.",
      "chain": [
        "30163",
        "20458",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4561",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا عبد الله بن عمر بن محمد بن أبان، حدثنا أبو تميلة، عن حسين المعلم، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال جعل رسول الله صلى الله عليه وسلم أصابع اليدين والرجلين سواء ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) treated the fingers and toes as equal.",
      "chain": [
        "20183",
        "11278",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "5016",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن محمد المروزي، قال حدثني علي بن حسين، عن أبيه، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال ‏{‏ والشعراء يتبعهم الغاوون ‏}‏ فنسخ من ذلك واستثنى فقال ‏{‏ إلا الذين آمنوا وعملوا الصالحات وذكروا الله كثيرا ‏}‏ ‏.‏",
      "text_en": " Ibn ‘Abbas said :                      The verse “And the poets it is those straying in evil who follow them. He (Allah) then abrogated it and made an exception saying: Except those who believe and work righteousness, engage much in the remembrance of Allah.\"",
      "chain": [
        "30304",
        "11045",
        "31",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3499",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا زكريا بن يحيى، قال حدثنا إسحاق بن إبراهيم، قال أنبأنا علي بن الحسين بن واقد، قال حدثني أبي قال، أنبأنا يزيد النحوي، عن عكرمة، عن ابن عباس، في قوله ‏{‏ ما ننسخ من آية أو ننسها نأت بخير منها أو مثلها ‏}‏ وقال ‏{‏ وإذا بدلنا آية مكان آية والله أعلم بما ينزل ‏}‏ الآية وقال ‏{‏ يمحو الله ما يشاء ويثبت وعنده أم الكتاب ‏}‏ فأول ما نسخ من القرآن القبلة وقال ‏{‏ والمطلقات يتربصن بأنفسهن ثلاثة قروء ‏}‏ وقال ‏{‏ واللائي يئسن من المحيض من نسائكم إن ارتبتم فعدتهن ثلاثة أشهر ‏}‏ فنسخ من ذلك قال تعالى ‏{‏ وإن طلقتموهن من قبل أن تمسوهن ‏}‏ ‏{‏ فما لكم عليهن من عدة تعتدونها ‏}‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas with regard to Allah's saying:                      \"Whatever a Verse (revelation) do We abrogate or cause to be forgotten, We bring a better one or similar to it.\" and He said: \"And when We change a Verse in place of another --and Allah knows best what He sends down.\" and He said: \"Allah blots out what He wills and confirms (what He wills). And with Him is the Mother of the Book.\"  \"The first thing that was abrogated in the Qur'an was the Qiblah.\"And He said: \"And divorced women shall wait (as regards their marriage) for three menstrual periods.\" and He said: \"And those of your women as have passed the age of monthly courses, for them the 'Iddah, if you have doubt (about their periods), is three months.\" So (some) of that was abrogated, (according to) His, Most High, saying: \"And then divorce them before you have sexual intercourse with them, no 'Iddah have you to count in respect of them.\"",
      "chain": [
        "30123",
        "30555",
        "20648",
        "19950",
        "11023"
      ]
    },
    {
      "hadith_no": "3543",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا زكريا بن يحيى السجزي، خياط السنة قال حدثنا إسحاق بن إبراهيم، قال حدثنا علي بن الحسين بن واقد، قال أخبرني أبي قال، حدثنا يزيد النحوي، عن عكرمة، عن ابن عباس، في قوله ‏{‏ والذين يتوفون منكم ويذرون أزواجا وصية لأزواجهم متاعا إلى الحول غير إخراج ‏}‏ نسخ ذلك بآية الميراث مما فرض لها من الربع والثمن ونسخ أجل الحول أن جعل أجلها أربعة أشهر وعشرا ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas, with regard to Allah's saying:                      \"And those of you who die and leave behind wives should bequeath for their wives a year's maintenance and residence without turning them out.\" This was abrogated by the Verse on inheritance, which allocated to her one-quarter or one-eighth. And the appointed time ('Iddah) of one year was abrogated and replaced with the ('Iddah) term of four months and ten days.",
      "chain": [
        "30123",
        "30555",
        "20648",
        "19950",
        "11023"
      ]
    },
    {
      "hadith_no": "3554",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "حدثنا زكريا بن يحيى، قال حدثنا إسحاق بن إبراهيم، قال حدثنا علي بن الحسين بن واقد، قال حدثني أبي قال، حدثنا يزيد النحوي، عن عكرمة، عن ابن عباس، في قوله ‏{‏ ما ننسخ من آية أو ننسها نأت بخير منها أو مثلها ‏}‏ وقال ‏{‏ وإذا بدلنا آية مكان آية والله أعلم بما ينزل ‏}‏ الآية وقال ‏{‏ يمحو الله ما يشاء ويثبت وعنده أم الكتاب ‏}‏ فأول ما نسخ من القرآن القبلة وقال ‏{‏ والمطلقات يتربصن بأنفسهن ثلاثة قروء ولا يحل لهن أن يكتمن ما خلق الله في أرحامهن ‏}‏ إلى قوله ‏{‏ إن أرادوا إصلاحا ‏}‏ وذلك بأن الرجل كان إذا طلق امرأته فهو أحق برجعتها وإن طلقها ثلاثا فنسخ ذلك وقال ‏{‏ الطلاق مرتان فإمساك بمعروف أو تسريح بإحسان ‏}‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas, regarding Allah's saying:                      \"Whatever a Verse do We abrogate or cause to be forgotten, We bring a better one or similar to it.\" and \"And when We change a Verse in place of another -and Allah knows best what He sends down\" (Al-Nahl 16:101) and \"Allah blots out what He wills and confirms (what He wills). And with Him is the Mother of the Book.\" The first thing that was abrogated in the Qur'an was the Qiblah. And He said: \"And divorced women shall wait (as regards their marriage) for three menstrual periods, and it is not lawful for them to conceal what Allah has created in their wombs, if they believe in Allah and the Last Day.\" \"And their husbands have better right to take them back in that period, if they wish for reconciliation.\" -that is because when a man divorced his wife, he had more right to take her back, even if he had divorced her three times. Then (Allah) abrogated that and said: \"The divorce is twice, after that, either you retain her on reasonable terms or release her with kindness.\"",
      "chain": [
        "30123",
        "30555",
        "20648",
        "19950",
        "11023"
      ]
    },
    {
      "hadith_no": "4046",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا زكريا بن يحيى، قال حدثنا إسحاق بن إبراهيم، قال أنبأني علي بن الحسين بن واقد، قال حدثني أبي قال، حدثنا يزيد النحوي، عن عكرمة، عن ابن عباس، في قوله تعالى ‏{‏ إنما جزاء الذين يحاربون الله ورسوله ‏}‏ الآية قال نزلت هذه الآية في المشركين فمن تاب منهم قبل أن يقدر عليه لم يكن عليه سبيل وليست هذه الآية للرجل المسلم فمن قتل وأفسد في الأرض وحارب الله ورسوله ثم لحق بالكفار قبل أن يقدر عليه لم يمنعه ذلك أن يقام فيه الحد الذي أصاب ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said, :                     Concerning the statement of Allah, the Most High: The recompense of those who wage war against Allah and His Messenger. \"This Verse was revealed concerning the idolators. Whoever among them repents before he is captured, you have no way against him. This Verse does not apply to the Muslims. Whoever kills, spreads mischief in the land, and wages war against Allah and His Messenger, then joins the disbelievers before he can be caught, there is nothing to prevent the Hadd punishment being carried out on him because of what he did.\"",
      "chain": [
        "30123",
        "19950",
        "11023"
      ]
    },
    {
      "hadith_no": "4069",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا زكريا بن يحيى، قال حدثنا إسحاق بن إبراهيم، قال أنبأنا علي بن الحسين بن واقد، قال أخبرني أبي، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال في سورة النحل ‏{‏ من كفر بالله من بعد إيمانه إلا من أكره ‏}‏ إلى قوله ‏{‏ لهم عذاب عظيم ‏}‏ فنسخ واستثنى من ذلك فقال ‏{‏ ثم إن ربك للذين هاجروا من بعد ما فتنوا ثم جاهدوا وصبروا إن ربك من بعدها لغفور رحيم ‏}‏ وهو عبد الله بن سعد بن أبي سرح الذي كان على مصر كان يكتب لرسول الله صلى الله عليه وسلم فأزله الشيطان فلحق بالكفار فأمر به أن يقتل يوم الفتح فاستجار له عثمان بن عفان فأجاره رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said concerning Surat An-Nahl - :                     \"Whoever disbelieved in Allah after his belief, except him who is forced thereto and whose heart is at rest with Faith; but such as open their breasts to disbelief, on them is wrath from Allah, and theirs will be a great torment.\" \"This was abrogated, and an exception was made, as Allah said: \"Then, verily, your Lord for those who emigrated after they had been put to trials and thereafter strove hard and fought (for the Cause of Allah) and were patient, verily, your Lord afterward is, Oft-Forgiving, Most Merciful.\" This was 'Abdullah bin Sa'd bin Abi As-Sarh who was the governor of Egypt and used to write to the Messenger of Allah [SAW]. The Shaitan misled him and he went and joined the unbelievers. So he (the Prophet [SAW]) commanded that he be killed on the day of the Conquest of Makkah. Then, 'Uthman bin 'Afan sought protection for him, and the Messenger of Allah [SAW] granted him protection.\"",
      "chain": [
        "30123",
        "30555",
        "20648",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2308",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا عبد الرحمن بن بشر بن الحكم، ومحمد بن عقيل بن خويلد، قالا حدثنا علي بن الحسين بن واقد، حدثني أبي، حدثني يزيد النحوي، أن عكرمة، حدثه عن ابن عباس، قال لما قدم النبي  صلى الله عليه وسلم  المدينة كانوا من أخبث الناس كيلا فأنزل الله سبحانه ‏{ويل للمطففين}‏ فأحسنوا الكيل بعد ذلك ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"When the Prophet (ﷺ) came to Al-Madinah, they were the worst people in weights and measures. Then Allah, Glorious is He revealed: \"Woe to the Mutaffifun (those who give less in measure and weight)\",[1] and they were fair in weights and measures after that.",
      "chain": [
        "30356",
        "38552",
        "30555",
        "20648",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2753",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا إسماعيل بن إبراهيم البالسي، حدثنا علي بن الحسن بن شقيق، حدثنا أبو حمزة المروزي، حدثنا يزيد النحوي، عن عكرمة، عن ابن عباس، عن النبي صلى الله عليه وسلم أنه قضى في السن خمسا من الإبل ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that :                     the Prophet (ﷺ) ruled that (the compensatory money) for a tooth was five camels.",
      "chain": [
        "38106",
        "30362",
        "19950",
        "11023",
        "17"
      ]
    }
  ],
  "total_hadiths": 30
}