{
  "id": "2",
  "name": "Abu Bakr Al-Siddique ( أبو بكر الصديق ( رضي الله عنه",
  "full_name": "Abu Bakr Al-Siddique ( أبو بكر الصديق ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "reliability_grade": null,
  "biography": {
    "birth": {
      "date_hijri": "51",
      "date_gregorian": "573",
      "date_display": [
        "51 BH",
        "573 CE"
      ],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "13",
      "date_gregorian": "634",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina"
    ],
    "area_of_interest": [
      "Tafsir/Quran",
      "Recitation/Quran",
      "Narrator [ ع  -  صحابة ]",
      "Commander",
      "Khalifah"
    ],
    "tags": [
      "Quraish",
      "B.Taym",
      "Early Muslim",
      "Emigrant",
      "Badr",
      "Uhud",
      "Khandaq",
      "Scribe",
      "Promised Paradise"
    ]
  },
  "parents": [
    {
      "id": "500",
      "name": "Abu Quhafa Uthman bin 'Amir ( أبو قحافة عثمان بن عامر بن عمرو ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "501",
      "name": "Salma Umm-ul-Khair ( سلمى بنت صخر أم الخير ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "spouses": [
    {
      "id": "91",
      "name": "Umm Ruman ( أم رومان زينب بنت عامر ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "69",
      "name": "Asma bint 'Umays ( أسماء بنت عميس بن معد ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "203",
      "name": "Habiba bint Kharijah ibn Zayd ( حبيبة بنت خارجة بن زيد ( رضي الله عنها",
      "grade": "Comp.(RA)"
    }
  ],
  "siblings": [],
  "children": [
    {
      "id": "70",
      "name": "Asma' bint Abi Bakr ( أسماء بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "110",
      "name": "'Abdullah bin Abi Bakr ( عبد الله بن أبي بكر ( رضي الله عنه",
      "grade": "Comp.(RA)"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "107",
      "name": "'Abdur Rahman bin Abi Bakr ( عبد الرحمن بن أبي بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "168",
      "name": "Muhammad ibn Abi Bakr ( محمد بن أبي بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "10500",
      "name": "Umm Khultum bint Abi Bakr أم كلثوم بنت أبي بكر الصديق",
      "grade": "Follower(Tabi') [2nd Generation]"
    }
  ],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    }
  ],
  "students": [
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "4",
      "name": "'Uthman ibn 'Affaan ( عثمان بن عفان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "8",
      "name": "'Abdur Rahman Ibn 'Awf ( عبد الرحمن بن عوف ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "49",
      "name": "Zayd ibn Thabit ( زيد بن ثابت بن الضحاك بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "107",
      "name": "'Abdur Rahman bin Abi Bakr ( عبد الرحمن بن أبي بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "168",
      "name": "Muhammad ibn Abi Bakr ( محمد بن أبي بكر الصديق ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "17",
      "name": "ibn Abbas ( عبد الله بن العباس بن عبد المطلب الحبر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "106",
      "name": "'Abdullah ibn al-Zubayr ( عبد الله بن الزبير بن العوام ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "18",
      "name": "ibn Umar ( عبد الله بن عمر بن الخطاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "29",
      "name": "'Abdullah bin 'Amr bin al-'Aas ( عبد الله بن عمرو بن العاص ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "19",
      "name": "Anas bin Malik ( أنس بن مالك بن النضر ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "34",
      "name": "Jabir ibn 'Abdullah ( جابر بن عبد الله بن عمرو السلمي الأنصاري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "400",
      "name": "al-Bara' bin Azib bin al-Harith ( البراء بن عازب بن الحارث ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "38",
      "name": "Abu Sa'id al-Khudri ( أبو سعيد سعد بن مالك بن سنان الخدري ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "13",
      "name": "Abu Hurairah ( أبو هريرة - عبد الرحمن بن صخر الدوسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3680",
      "name": "Tariq bin Shahab ( طارق بن شهاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "872",
      "name": "'Uqba binal-Harith bin 'Amir ( عقبة بن الحارث ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "3660",
      "name": "Abu al-Tufayl, 'Amir bin Wathla ( أبو الطفيل عامر بن واثلة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11194",
      "name": "'Abdur Rahman bin 'Asayla al-Sanabahi عبد الرحمن بن عسيلة أبو عبد الله الصنابح",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "11416",
      "name": "Aslam Client Of 'Umar أسلم مولى عمر",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11046",
      "name": "Qays bin Abi Hazim قيس بن أبي حازم",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "17003",
      "name": "Awsat al-Bajli أوسط البجلي",
      "grade": "Follower(Tabi') [1st Generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "834",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا قتيبة بن سعيد، قال حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عبد الله بن عمرو، عن أبي بكر الصديق  رضى الله عنه ‏.‏ أنه قال لرسول الله صلى الله عليه وسلم علمني دعاء أدعو به في صلاتي‏.‏ قال ‏\"‏ قل اللهم إني ظلمت نفسي ظلما كثيرا ولا يغفر الذنوب إلا أنت، فاغفر لي مغفرة من عندك، وارحمني إنك أنت الغفور الرحيم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakr As-Siddiq:                     I asked Allah's Apostle to teach me an invocation so that I may invoke Allah with it in my prayer. He told me to say, \"Allahumma inni zalumtu nafsi zulman kathiran, Wala yaghfiru dh-dhunuba illa anta, fa ghfir li maghfiratan min `indika, wa r-hamni, innaka anta l-ghafuru r-rahim (O Allah! I have done great injustice to myself and none except You forgives sins, so bestow on me a forgiveness from You, and Have Mercy on me, You are the Forgiver, the Merciful).",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "29",
        "2"
      ]
    },
    {
      "hadith_no": "1930",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، حدثنا يونس، عن ابن شهاب، عن عروة، وأبي، بكر قالت عائشة  رضى الله عنها  كان النبي صلى الله عليه وسلم يدركه الفجر ‏{‏جنبا‏}‏ في رمضان، من غير حلم فيغتسل ويصوم‏.‏",
      "text_en": " Narrated `Aisha:                     (At times) in Ramadan the Prophet used to take a bath in the morning not because of a wet dream and would continue his fast.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "10511",
        "2",
        "53"
      ]
    },
    {
      "hadith_no": "2439",
      "source": " Sahih Bukhari ",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا النضر، أخبرنا إسرائيل، عن أبي إسحاق، قال أخبرني البراء، عن أبي بكر  رضى الله عنهما ‏.‏ حدثنا عبد الله بن رجاء، حدثنا إسرائيل، عن أبي إسحاق، عن البراء، عن أبي بكر  رضى الله عنهما  قال انطلقت، فإذا أنا براعي غنم يسوق غنمه فقلت لمن أنت قال لرجل من قريش‏.‏ فسماه فعرفته‏.‏ فقلت هل في غنمك من لبن فقال نعم‏.‏ فقلت هل أنت حالب لي قال نعم‏.‏ فأمرته فاعتقل شاة من غنمه، ثم أمرته أن ينفض ضرعها من الغبار، ثم أمرته أن ينفض كفيه، فقال هكذا  ضرب إحدى كفيه بالأخرى  فحلب كثبة من لبن وقد جعلت لرسول الله صلى الله عليه وسلم إداوة على فمها خرقة، فصببت على اللبن، حتى برد أسفله، فانتهيت إلى النبي صلى الله عليه وسلم فقلت اشرب يا رسول الله‏.‏ فشرب حتى رضيت‏.‏",
      "text_en": " Narrated Abu Bakr:                     While I was on my way, all of a sudden I saw a shepherd driving his sheep, I asked him whose servant he was. He replied that he was the servant of a man from Quraish, and then he mentioned his name and I recognized him. I asked, \"Do your sheep have some milk?\" He replied in the affirmative. I said, \"Are you going to milk for me?\" He replied in the affirmative. I ordered him and he tied the legs of one of the sheep. Then I told him to clean the udder (teats) of dust and to remove dust off his hands. He removed the dust off his hands by clapping his hands. He then milked a little milk. I put the milk for Allah's Apostle in a pot and closed its mouth with a piece of cloth and poured water over it till it became cold. I took it to the Prophet and said, \"Drink, O Allah's Apostle!\" He drank it till I was pleased.",
      "chain": [
        "30123",
        "20291",
        "20311",
        "11049",
        "400",
        "2"
      ]
    },
    {
      "hadith_no": "3696",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا محمد بن سنان، حدثنا همام، عن ثابت، عن أنس، عن أبي بكر  رضى الله عنه  قال قلت للنبي صلى الله عليه وسلم وأنا في الغار لو أن أحدهم نظر تحت قدميه لأبصرنا‏.‏ فقال ‏\"‏ ما ظنك يا أبا بكر باثنين الله ثالثهما ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakr:                     I said to the Prophet while I was in the Cave. \"If any of them should look under his feet, he would see us.\" He said, \"O Abu Bakr! What do you think of two (persons) the third of whom is Allah?\"",
      "chain": [
        "34207",
        "20297",
        "11269",
        "19",
        "2"
      ]
    },
    {
      "hadith_no": "3760",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "أخبرني عبد الله بن عبد الوهاب، حدثنا خالد، حدثنا شعبة، عن واقد، قال سمعت أبي يحدث، عن ابن عمر، عن أبي بكر  رضى الله عنهم  قال ارقبوا محمدا صلى الله عليه وسلم في أهل بيته‏.‏",
      "text_en": " Abu Bakr:                      Look at      Muhammad through his family (i.e. if you are no good to his family you     are not good to him).",
      "chain": [
        "30143",
        "20423",
        "20020",
        "19124",
        "18",
        "2"
      ]
    },
    {
      "hadith_no": "3970",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا همام، عن ثابت، عن أنس، عن أبي بكر  رضى الله عنه  قال كنت مع النبي صلى الله عليه وسلم في الغار فرفعت رأسي، فإذا أنا بأقدام القوم، فقلت يا نبي الله، لو أن بعضهم طأطأ بصره رآنا‏.‏ قال ‏\"‏ اسكت يا أبا بكر، اثنان الله ثالثهما ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakr:                     I was with the Prophet in the Cave. When I raised my head, I saw the feet of the people. I said, \"O Allah's Apostle! If some of them should look down, they will see us.\" The Prophet said, \"O Abu Bakr, be quiet! (For we are) two and Allah is the Third of us.\"",
      "chain": [
        "20040",
        "20297",
        "11269",
        "19",
        "2"
      ]
    },
    {
      "hadith_no": "6399",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا الليث، قال حدثني يزيد، عن أبي الخير، عن عبد الله بن عمرو، عن أبي بكر الصديق  رضى الله عنه  أنه قال للنبي صلى الله عليه وسلم علمني دعاء أدعو به في صلاتي‏.‏ قال ‏\"‏ قل اللهم إني ظلمت نفسي ظلما كثيرا، ولا يغفر الذنوب إلا أنت، فاغفر لي مغفرة من عندك، وارحمني، إنك أنت الغفور الرحيم ‏\"‏‏.‏     وقال عمرو عن يزيد، عن أبي الخير، إنه سمع عبد الله بن عمرو، قال أبو بكر  رضى الله عنه  للنبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     Abu Bakr As-Siddiq said to the Prophet, \"Teach me an invocation with which I may invoke (Allah) in my prayer.\" The Prophet said, \"Say: Allahumma inni zalamtu nafsi zulman kathiran wala yaghfirudhdhunuba illa anta, Faghfirli maghfiratan min indika war-hamni, innaka antalGhafur-Rahim.\"",
      "chain": [
        "30355",
        "20023",
        "20472",
        "11410",
        "29",
        "2"
      ]
    },
    {
      "hadith_no": "7307",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، حدثني قيس بن مسلم، عن طارق بن شهاب، عن أبي بكر  رضى الله عنه  قال لوفد بزاخة تتبعون أذناب الإبل حتى يري الله خليفة نبيه صلى الله عليه وسلم والمهاجرين أمرا يعذرونكم به‏.‏",
      "text_en": " Narrated Tariq bin Shihab:                     Abu Bakr said to the delegate of Buzakha. \"Follow the tails of the camels till Allah shows the Caliph (successor) of His Prophet and Al-Muhajirin (emigrants) something because of which you may excuse yourselves.\"",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11386",
        "3680",
        "2"
      ]
    },
    {
      "hadith_no": "1470",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا هداب بن خالد الأزدي، حدثنا همام بن يحيى، حدثني أبو جمرة الضبعي، عن أبي بكر، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من صلى البردين دخل الجنة ‏\"‏ ‏.‏",
      "text_en": " Abu Bakr reported on the authority of his father that the Messenger of Allah (may peace be upon him) said:                      He who observed two prayers at two cool (hours) would enter Paradise.",
      "chain": [
        "20297",
        "11309",
        "2",
        "500"
      ]
    },
    {
      "hadith_no": "2645",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني محمد بن حاتم، حدثنا يحيى بن سعيد، عن ابن جريج، ح وحدثني محمد، بن رافع - واللفظ له - حدثنا عبد الرزاق بن همام، أخبرنا ابن جريج، أخبرني عبد الملك، بن أبي بكر بن عبد الرحمن عن أبي بكر، قال سمعت أبا هريرة، - رضى الله عنه - يقص يقول في قصصه من أدركه الفجر جنبا فلا يصم ‏.‏ فذكرت ذلك لعبد الرحمن بن الحارث - لأبيه - فأنكر ذلك ‏.‏ فانطلق عبد الرحمن وانطلقت معه حتى دخلنا على عائشة وأم سلمة - رضى الله عنهما - فسألهما عبد الرحمن عن ذلك - قال - فكلتاهما قالت كان النبي صلى الله عليه وسلم يصبح جنبا من غير حلم ثم يصوم - قال - فانطلقنا حتى دخلنا على مروان فذكر ذلك له عبد الرحمن ‏.‏ فقال مروان عزمت عليك إلا ما ذهبت إلى أبي هريرة فرددت عليه ما يقول - قال - فجئنا أبا هريرة وأبو بكر حاضر ذلك كله - قال - فذكر له عبد الرحمن فقال أبو هريرة أهما قالتاه لك قال نعم ‏.‏ قال هما أعلم ‏.‏ ثم رد أبو هريرة ما كان يقول في ذلك إلى الفضل بن العباس فقال أبو هريرة سمعت ذلك من الفضل ولم أسمعه من النبي صلى الله عليه وسلم ‏.‏ قال فرجع أبو هريرة عما كان يقول في ذلك ‏.‏ قلت لعبد الملك أقالتا في رمضان قال كذلك كان يصبح جنبا من غير حلم ثم يصوم ‏.‏",
      "text_en": " Abu Bakr (he is Abu Bakr b. Abd al-Rahman b. Harith) reported:                      I heard Abu Huraira (Allah be pleased with him) narrating that he who is overtaken by dawn in a state of seminal emission should not observe fast. I made a mention of it to 'Abd al-Rahman b. Harith (i. e. to his father) but he denied it. 'Abd al-Rahman went and I also went along with him till we came to'A'isha and Umm Salama (Allah be pleased with both of them) and Abd al-Rahman asked them about it. Both of them said: (At times it so happened) that the Apostle of Allah (may peace be upon him) woke up in the morning in a state of junub (but without seminal emission in a dream) and observed fast He (the narrator) said: We then proceeded till we went to Marwan and Abd al-Rahman made a mention of it to him. Upon this Marwan said: I stress upon you (with an oath) that you better go to Abu Huraira and refer to him what is said about it. So we came to Abu Huraira and Abu Bakr had been with us throughout and 'Abd al-Rahman made a mention of it to him, whereupon Abu Huraira said: Did they (the two wives of the Holy Prophet) tell you this? He replied: Yes Upon this (Abu Huraira) said: They have better knowledge. Abu Huraira then attributed that what was said about it to Fadl b. 'Abbas and said: I heard it from Fadl and not from the Apostle of Allah (may peace be upon him). Abu Huraira then retracted from what he used to say about it. Ibn Juraij (one of the narrators) reported: I asked 'Abd al-Malik, if they (the two wives) said (made the statement) in regard to Ramadan, whereupon he said: It was so, and he (the Holy Prophet) (woke up in the) morning in a state of junub which was not due to the wet dream and then observed fast.",
      "chain": [
        "38487",
        "20031",
        "11070",
        "30375",
        "20121",
        "11070",
        "11198",
        "2",
        "13"
      ]
    },
    {
      "hadith_no": "3435",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا عبد العزيز بن محمد المدني، عن يزيد بن الهاد، عن أبي بكر، عن عباد بن تميم، عن عبد الله بن زيد الأنصاري، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما بين منبري وبيتي روضة من رياض الجنة ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Zaid al-Ansari heard Allah's Messenger (may peace be upon him) as saying:                      That which exists between my pulpit and my house is a garden from the gardens of Paradise.",
      "chain": [
        "30399",
        "11234",
        "2",
        "639"
      ]
    },
    {
      "hadith_no": "7044",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح وحدثنا محمد بن رمح، أخبرنا الليث، عن  يزيد بن أبي حبيب، عن أبي الخير، عن عبد الله بن عمرو، عن أبي بكر، أنه قال لرسول الله صلى الله عليه وسلم علمني دعاء أدعو به في صلاتي قال ‏\"‏ قل اللهم إني ظلمت نفسي ظلما كبيرا - وقال قتيبة كثيرا - ولا يغفر الذنوب إلا أنت فاغفر لي مغفرة من عندك وارحمني إنك أنت الغفور الرحيم ‏\"‏ ‏.‏",
      "text_en": " Abu Bakr reported that he said to Allah's Messenger (may peace be upon him):                      Teach me a supplication which I should recite in my prayer. Thereupon he (the Holy Prophet) said: Recite:\" O Allah, I have done great wrong to myself.\" According to Qutaiba (the words were: ) much (wrong) -there is none to forgive the sins but Thou only, say:\" Grant me pardon from Thyself, have mercy upon me for Thou art much Forgiving and Compassionate.\" This hadith has been transmitted on the authority of 'Amr b. al-'As that Abu Bakr Siddiq said to Allah's Messenger (may peace be upon him): Allah's Messenger. teach me a supplication which I should make in my prayer and in my house. The rest of the hadith is the same except with this variation that he said: Much wrong (Zulman Kathira).",
      "chain": [
        "30367",
        "20023",
        "30490",
        "20023",
        "11411",
        "11410",
        "29",
        "2"
      ]
    },
    {
      "hadith_no": "1514",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا النفيلي، حدثنا مخلد بن يزيد، حدثنا عثمان بن واقد العمري، عن أبي نصيرة، عن مولى، لأبي بكر الصديق عن أبي بكر الصديق، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما أصر من استغفر وإن عاد في اليوم سبعين مرة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuBakr as-Siddiq:                     The Prophet (ﷺ) said: He who asks pardon is not a  confirmed sinner, even if he returns to his sin seventy times a day.",
      "chain": [
        "30352",
        "20462",
        "22147",
        "2"
      ]
    },
    {
      "hadith_no": "2466",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا هناد، عن أبي بكر، عن أبي حصين، عن أبي صالح، عن أبي هريرة، قال كان النبي صلى الله عليه وسلم يعتكف كل رمضان عشرة أيام فلما كان العام الذي قبض فيه اعتكف عشرين يوما ‏.‏",
      "text_en": " Abu Hurairah said:                      The Prophet (ﷺ) used to observe I'tikaf during ten days of Ramadan every year. But when the year in which he died, he observed I'tikaf for twenty days.",
      "chain": [
        "30480",
        "2",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2740",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثني هناد بن السري، عن أبي بكر، عن عاصم، عن مصعب بن سعد، عن أبيه، قال جئت إلى النبي صلى الله عليه وسلم يوم بدر بسيف فقلت يا رسول الله إن الله قد شفى صدري اليوم من العدو فهب لي هذا السيف ‏.‏ قال ‏\"‏ إن هذا السيف ليس لي ولا لك ‏\"‏ فذهبت وأنا أقول يعطاه اليوم من لم يبل بلائي ‏.‏ فبينا أنا إذ جاءني الرسول فقال أجب ‏.‏ فظننت أنه نزل في شىء بكلامي فجئت فقال لي النبي صلى الله عليه وسلم ‏\"‏ إنك سألتني هذا السيف وليس هو لي ولا لك وإن الله قد جعله لي فهو لك ثم قرأ ‏{‏ يسألونك عن الأنفال قل الأنفال لله والرسول ‏}‏ إلى آخر الآية ‏\"‏ ‏.‏ قال أبو داود قراءة ابن مسعود يسألونك النفل ‏.‏",
      "text_en": " Mus’ab bin Sa’d reported on the authority of his father (Sa’ad bin Abi Waqqas) “I brought a sword to the Prophet(ﷺ) on the day of the Badr and I said (to him) Apostle of Allaah(ﷺ) , Allaah has healed up my breast from the enemy today, so give me this sword. He said “This sword is neither mine nor yours. I then went away saying “today this will be given to a man who has not been put to trial like me. Meanwhile a messenger and came to me and said “Respond, I thought something was revealed about me owing to my speech. I came and the Prophet (ﷺ) said to me “You asked me for this sword, but this was neither mine nor yours. Now Allaah has given it to me, hence it is yours. He then recited “they ask thee concerning (things taken as) spoils of war. Say “(Such) spoils are at the disposal of Allaah and the Apostle.Abu Dawud said “According to the reading of the Qur’an of Ibn Mas’ud the verse goes. They ask thee concerning (things taken as ) spoils of war.",
      "chain": [
        "30480",
        "2",
        "11080",
        "10556",
        "9"
      ]
    },
    {
      "hadith_no": "827",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن رافع، حدثنا ابن أبي فديك، ح وحدثنا إسحاق بن منصور، أخبرنا ابن أبي فديك، عن الضحاك بن عثمان، عن محمد بن المنكدر، عن عبد الرحمن بن يربوع، عن أبي بكر الصديق، أن النبي صلى الله عليه وسلم سئل أى الحج أفضل قال ‏\"‏ العج والثج ‏\"‏ ‏.‏",
      "text_en": " Abu Bakr As-Siddiq narrated that:                     The Messenger of Allah was asked: \"Which Hajj is the most virtuous?\" He said: \"That with raised voices (Al-Ajj) and the flow of blood (of the sacrifice) (Ath-Thajj).\"",
      "chain": [
        "30375",
        "20172",
        "30313",
        "20172",
        "20504",
        "11048",
        "2"
      ]
    },
    {
      "hadith_no": "2067",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا عبد بن حميد، حدثنا زيد بن الحباب العكلي، حدثني أبو سلمة الكندي، حدثنا فرقد السبخي، عن مرة بن شراحيل الهمداني، وهو الطيب - عن أبي بكر الصديق، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ملعون من ضار مؤمنا أو مكر به ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
      "text_en": " Abu Bakr As-Siddiq narrated that the  Messenger of Allah said:                     \"Cursed are those who harm a believer, or plot to do so.\"",
      "chain": [
        "30553",
        "20650",
        "28683",
        "14313",
        "11391",
        "2"
      ]
    },
    {
      "hadith_no": "2072",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يزيد بن هارون، عن همام بن يحيى، عن فرقد السبخي، عن مرة الطيب، عن أبي بكر، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يدخل الجنة سيئ الملكة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وقد تكلم أيوب السختياني وغير واحد في فرقد السبخي من قبل حفظه ‏.‏",
      "text_en": " Abu Bakr As-Siddiq  narrated that the Messenger of Allah said :                     \"The one who treats his slaves badly will not enter paradise.\"",
      "chain": [
        "30242",
        "20472",
        "20297",
        "14313",
        "2"
      ]
    },
    {
      "hadith_no": "2090",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يزيد بن هارون، حدثنا صدقة بن موسى، عن فرقد السبخي، عن مرة الطيب، عن أبي بكر الصديق، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يدخل الجنة خب ولا منان ولا بخيل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " -Abu  Bakr As-Siddiq narrated that the Messenger of Allah said:                     \"The swindler, the stingy person, and the Mannan shall not enter Paradise.\"",
      "chain": [
        "30242",
        "20472",
        "24209",
        "14313",
        "2"
      ]
    },
    {
      "hadith_no": "2168",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يزيد بن هارون، أخبرنا إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن أبي بكر الصديق، أنه قال أيها الناس إنكم تقرءون هذه الآية ‏:‏ ‏(‏يا أيها الذين آمنوا عليكم أنفسكم لا يضركم من ضل إذا اهتديتم ‏)‏ وإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الناس إذا رأوا الظالم فلم يأخذوا على يديه أوشك أن يعمهم الله بعقاب منه ‏\"‏ ‏.‏ حدثنا محمد بن بشار، حدثنا يزيد بن هارون، عن إسماعيل بن أبي خالد، نحوه ‏.‏ قال أبو عيسى وفي الباب عن عائشة، وأم سلمة والنعمان بن بشير وعبد الله بن عمر وحذيفة ‏.‏ وهذا حديث صحيح ‏.‏ وهكذا روى غير، واحد، عن إسماعيل، نحو حديث يزيد ورفعه بعضهم عن إسماعيل، وأوقفه، بعضهم ‏.‏",
      "text_en": " Abu Bakr As-Siddiq said:                     \"O you people! You recite this Ayah: Take care of yourselves! If you follow the guidance no harm shall come to you. I indeed heard the Messenger of Allah (s.a.w) saying: 'When the people see the wrongdoer and they do not take him by the hand, then soon Allah shall envelope you in a punishment from him.'\"",
      "chain": [
        "30242",
        "20472",
        "11418",
        "11046",
        "2"
      ]
    },
    {
      "hadith_no": "2237",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن بشار، وأحمد بن منيع، قالا حدثنا روح بن عبادة، حدثنا سعيد بن أبي عروبة، عن أبي التياح، عن المغيرة بن سبيع، عن عمرو بن حريث، عن أبي بكر الصديق، قال حدثنا رسول الله صلى الله عليه وسلم قال ‏\"‏ الدجال يخرج من أرض بالمشرق يقال لها خراسان يتبعه أقوام كأن وجوههم المجان المطرقة ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي هريرة وعائشة ‏.‏ وهذا حديث حسن غريب ‏.‏ وقد رواه عبد الله بن شوذب وغير واحد عن أبي التياح ولا نعرفه إلا من حديث أبي التياح ‏.‏",
      "text_en": " Abu Bakr As-Siddiq said:                     \"The Messenger of Allah(s.a.w) narrated to us, saying: 'The Dajjal shall emerge from a land in the east called Khurasan. He is followed by a people whom appear as if their f aces are shields coated with leather. '\"",
      "chain": [
        "30160",
        "30242",
        "20229",
        "11073",
        "11317",
        "19031",
        "5202",
        "2"
      ]
    },
    {
      "hadith_no": "3130",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو موسى، محمد بن المثنى حدثنا أحمد بن سعيد الدارمي، حدثنا قتيبة، عن حميد بن عبد الرحمن، بهذا ‏.‏ وفي الباب عن أبي بكر الصديق، ولا يصح حديث أبي بكر من قبل إسناده إسناده ضعيف ‏.‏",
      "text_en": "",
      "chain": [
        "30296",
        "30367",
        "10561",
        "2"
      ]
    },
    {
      "hadith_no": "3313",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا يحيى بن موسى، وعبد بن حميد، قالا حدثنا روح بن عبادة، عن موسى بن عبيدة، أخبرني مولى ابن سباع، قال سمعت عبد الله بن عمر، يحدث عن أبي بكر الصديق، قال كنت عند رسول الله صلى الله عليه وسلم فأنزلت عليه هذه الآية ‏:‏ ‏(‏ من يعمل سوءا يجز به ولا يجد له من دون الله وليا ولا نصيرا ‏)‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا بكر ألا أقرئك آية أنزلت على ‏\"‏ ‏.‏ قلت بلى يا رسول الله ‏.‏ قال فأقرأنيها فلا أعلم إلا أني قد كنت وجدت انقصاما في ظهري فتمطأت لها فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما شأنك يا أبا بكر ‏\"‏ ‏.‏ قلت يا رسول الله بأبي أنت وأمي وأينا لم يعمل سوءا وإنا لمجزيون بما عملنا فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما أنت يا أبا بكر والمؤمنون فتجزون بذلك في الدنيا حتى تلقوا الله وليس لكم ذنوب وأما الآخرون فيجمع ذلك لهم حتى يجزوا به يوم القيامة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب وفي إسناده مقال ‏.‏ موسى بن عبيدة يضعف في الحديث ضعفه يحيى بن سعيد وأحمد بن حنبل ومولى ابن سباع مجهول ‏.‏ وقد روي هذا الحديث من غير هذا الوجه عن أبي بكر وليس له إسناد صحيح أيضا ‏.‏ وفي الباب عن عائشة ‏.‏",
      "text_en": " Narrated Abu Bakr As-Siddiq:                     \"I was with the Prophet (ﷺ) when this Ayah was revealed to him: Whoever works evil will have the recompense of it (4:123). So the Messenger of Allah (ﷺ) said: 'O Abu Bakr! Shall I recite to you an Ayah revealed to me?' I said: 'Of course O Messenger of Allah!' So he recited it to me, and I do not know except that I found it as a fatal blow, but I repressed it. So the Messenger of Allah (ﷺ) said: 'What is bothering you O Abu Bakr?' I said: 'O Messenger of Allah! May my father and my mother be your ransom! Which of us has not done evil - and yet we shall be recompensed for what we have done?' So the Messenger of Allah (ﷺ) said: 'As for you O Abu Bakr, and the believers, they will be recompensed for that in the world until they meet Allah and they have no sins. As for the others, then that will be collected for them until they are recompensed for it on the Day of Judgement.'\"",
      "chain": [
        "30221",
        "30553",
        "20229",
        "12527",
        "18",
        "2"
      ]
    },
    {
      "hadith_no": "3334",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يزيد بن هارون، حدثنا إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن أبي بكر الصديق، أنه قال يا أيها الناس إنكم تقرءون هذه الآية ‏:‏ ‏(‏ يا أيها الذين آمنوا عليكم أنفسكم لا يضركم من ضل إذا اهتديتم ‏)‏ وإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الناس إذا رأوا ظالما فلم يأخذوا على يديه أوشك أن يعمهم الله بعقاب منه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد رواه غير واحد عن إسماعيل بن أبي خالد نحو هذا الحديث مرفوعا وروى بعضهم عن إسماعيل عن قيس عن أبي بكر قوله ولم يرفعوه ‏.‏",
      "text_en": " Narrated Abu Bakr As-Siddiq:                     \"O you people! You recite this Ayah: Take care of yourselves! If you follow the guidance no harm shall come to you from those who are astray (5:105). I indeed heard the Messenger of Allah (ﷺ) saying: 'When the people see the wrongdoer, and they do not stop him (from doing wrong), then it is soon that Allah shall envelope you in a punishment from Him.'\"",
      "chain": [
        "30242",
        "20472",
        "11418",
        "11046",
        "2"
      ]
    },
    {
      "hadith_no": "3516",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن بشار، حدثنا إبراهيم بن عمر بن أبي الوزير، حدثنا زنفل بن عبد الله أبو عبد الله، عن ابن أبي مليكة، عن عائشة، عن أبي بكر الصديق، أن النبي صلى الله عليه وسلم كان إذا أراد أمرا قال ‏\"‏ اللهم خر لي واختر لي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث زنفل ‏.‏ وهو ضعيف عند أهل الحديث ويقال له زنفل العرفي وكان سكن عرفات وتفرد بهذا الحديث ولا يتابع عليه ‏.‏",
      "text_en": " Aishah narrated from Abu Bakr As-Siddiq,:                     that whenever the Prophet wanted to do a matter, he would say: “O Allah, make it good for me and choose for me. (Allahumma Khir Li Wakhtar Li)”",
      "chain": [
        "30160",
        "11090",
        "53",
        "2"
      ]
    },
    {
      "hadith_no": "3531",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا قتيبة، حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عبد الله بن عمرو، عن أبي بكر الصديق، أنه قال لرسول الله صلى الله عليه وسلم علمني دعاء أدعو به في صلاتي قال ‏\"‏ قل اللهم إني ظلمت نفسي ظلما كثيرا ولا يغفر الذنوب إلا أنت فاغفر لي مغفرة من عندك وارحمني إنك أنت الغفور الرحيم ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح غريب وهو حديث ليث بن سعد وأبو الخير اسمه مرثد بن عبد الله اليزني ‏.‏",
      "text_en": " Abdullah bin Amr narrated from Abu Bakr As-Siddiq that he said:                     “O Messenger of Allah, teach me a supplication that I may supplicate with in my Salat.” He said: “Say: ‘O Allah, I have wronged myself much, and none forgives sins except You. So forgive me with forgiveness from You, and have mercy upon me, indeed, You are the Forgiving, the Merciful (Allahumma Inni Zalamtu Nafsi Zulman Kathiran Wa La Yaghfirudh-Dhunuba Illa Anta Faghfirli Maghfiratan Min Indika Warhamni Innaka Antal-Ghafurur-Rahim)”",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "29",
        "2"
      ]
    },
    {
      "hadith_no": "3559",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا حسين بن يزيد الكوفي، حدثنا أبو يحيى الحماني، حدثنا عثمان بن واقد، عن أبي نصيرة، عن مولى، لأبي بكر عن أبي بكر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما أصر من استغفر ولو فعله في اليوم سبعين مرة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب إنما نعرفه من حديث أبي نصيرة وليس إسناده بالقوي ‏.‏",
      "text_en": " Abu Bakr narrated:                     That the messenger of Allah said: “He who seeks forgiveness has not been persistent in sin, even if he does it seventy times in a day.”",
      "chain": [
        "20332",
        "2"
      ]
    },
    {
      "hadith_no": "1302",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا الليث، عن يزيد بن أبي حبيب، عن أبي الخير، عن عبد الله بن عمرو، عن أبي بكر الصديق، - رضى الله عنهما أنه قال لرسول الله صلى الله عليه وسلم علمني دعاء أدعو به في صلاتي ‏.‏ قال ‏\"‏ قل اللهم إني ظلمت نفسي ظلما كثيرا ولا يغفر الذنوب إلا أنت فاغفر لي مغفرة من عندك وارحمني إنك أنت الغفور الرحيم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Amr, from Abu Bakr As-Siddiq, may Allah (SWT) be pleased with them both, that he said to the Messenger of Allah (ﷺ):                     \"Teach me a supplication that I may recite in my prayer.\" He said: \"Say: 'Alahumma inni zalamtu afsi zulman kathiran wa la yaghfirudhunub illa anta faghfirli maghfiratan min 'indika warhamni innaka antalGhafurur-Rahim (O Allah, verily I have wronged myself much and there is None who forgives sins except You. Grant me forgiveness from You and have mercy on me for You are the Oft-Forgiving, Most Merciful.)'\"",
      "chain": [
        "30367",
        "20023",
        "11411",
        "11410",
        "29",
        "2"
      ]
    },
    {
      "hadith_no": "2591",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا هشام بن عمار، قال حدثنا يحيى، - وهو ابن حمزة - قال حدثني الأوزاعي، عن هارون بن رئاب، أنه حدثه عن أبي بكر، عن قبيصة بن مخارق، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تصلح المسألة إلا لثلاثة رجل أصابت ماله جائحة فيسأل حتى يصيب سدادا من عيش ثم يمسك ورجل تحمل حمالة فيسأل حتى يؤدي إليهم حمالتهم ثم يمسك عن المسألة ورجل يحلف ثلاثة نفر من قومه من ذوي الحجا بالله لقد حلت المسألة لفلان فيسأل حتى يصيب قواما من معيشة ثم يمسك عن المسألة فما سوى ذلك سحت ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Qabisah bin Mukhariq said:                     \"I heard the Messenger of Allah says: 'It is not right to ask (for help) except in three cases: A man whose wealth has been destroyed by some calamity, so he asks until he gets enough to keep him going, then he refrains from asking: a man who undertakes a financial responsibility, and asks for help until he pays off whatever needs to be paid; and a man concerning whom three wise men from his own people swear by Allah that it is permissible for so-an-so to ask for help, so he asks until he has enough to be independent of means, then he refrains from asking. Apart from that. (asking) is unlawful.\"'",
      "chain": [
        "30288",
        "20402",
        "20024",
        "10974",
        "2"
      ]
    },
    {
      "hadith_no": "2597",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا هناد بن السري، عن أبي بكر، عن أبي حصين، عن سالم، عن أبي هريرة، قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تحل الصدقة لغني ولا لذي مرة سوي ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'It is not permissible to give charity to a rich man (or one who is independent of means) or to one who is strong and healthy.\"'",
      "chain": [
        "30480",
        "2",
        "11371",
        "11011",
        "13"
      ]
    },
    {
      "hadith_no": "2664",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني أحمد بن فضالة بن إبراهيم النسائي، قال حدثنا خالد بن مخلد، قال حدثني سليمان بن بلال، قال حدثني يحيى، - وهو ابن سعيد الأنصاري - قال سمعت القاسم بن محمد، يحدث عن أبيه، عن أبي بكر، أنه خرج حاجا مع رسول الله صلى الله عليه وسلم حجة الوداع ومعه امرأته أسماء بنت عميس الخثعمية فلما كانوا بذي الحليفة ولدت أسماء محمد بن أبي بكر فأتى أبو بكر النبي صلى الله عليه وسلم فأخبره فأمره رسول الله صلى الله عليه وسلم أن يأمرها أن تغتسل ثم تهل بالحج وتصنع ما يصنع الناس إلا أنها لا تطوف بالبيت ‏.‏",
      "text_en": " It was narrated from Abu Bakr:                     That he went out for Hajj with the Messenger of Allah on the Farewell Pilgrimage, and his wife Asma' bint 'Umais Al-Khath'amiyyah was with him. When they were at Dhul-Hulaifah, Asma gave birth to Muhammad bin abi Bakr. Abu Bakr. Came to the Prophet and told him, and the Messenger of Allah told him to tell her to perform Ghusl, then begin the Talbniyah for Hajj, and to do everything that the people do, except that she should not circumambulate the House.(sahih)",
      "chain": [
        "38045",
        "30463",
        "20160",
        "11062",
        "10535",
        "168",
        "2"
      ]
    },
    {
      "hadith_no": "5365",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا هناد بن السري، عن أبي بكر، عن أبي إسحاق، عن مجاهد، عن أبي هريرة، قال استأذن جبريل عليه السلام على النبي صلى الله عليه وسلم فقال ‏\"‏ ادخل ‏\"‏ ‏.‏ فقال كيف أدخل وفي بيتك ستر فيه تصاوير فإما أن تقطع رءوسها أو تجعل بساطا يوطأ فإنا معشر الملائكة لا ندخل بيتا فيه تصاوير ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"Jibril, peace be upon him, asked permission to enter upon the Prophet [SAW] and he said: 'Come in.' He said: 'How can I come in when there is a curtain in your house on which there are images? You should either cut off their heads or make it into a rug to be stepped on, for we Angels do not enter a house in which there are images.'\"",
      "chain": [
        "30480",
        "2",
        "11049",
        "11028",
        "13"
      ]
    },
    {
      "hadith_no": "3024",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا خالد بن مخلد، عن سليمان بن بلال، حدثنا يحيى بن سعيد، أنه سمع القاسم بن محمد، يحدث عن أبيه، عن أبي بكر، أنه خرج حاجا مع رسول الله  صلى الله عليه وسلم  ومعه أسماء بنت عميس فولدت بالشجرة محمد بن أبي بكر فأتى أبو بكر النبي  صلى الله عليه وسلم  فأخبره فأمره رسول الله  صلى الله عليه وسلم  أن يأمرها أن تغتسل ثم تهل بالحج وتصنع ما يصنع الناس إلا أنها لا تطوف بالبيت ‏.‏",
      "text_en": " It wasnarrated from Abu Bakr that he went out for Hajj with theMessengerof Allah (ﷺ), and Asma’ bint ‘Umais was with him. She gavebirth, at Shajarah, to Muhammad bin Abu Bakr. Abu Bakr came to theProphet (ﷺ) and told him about that, and the Messenger of Allah(ﷺ) told him to tell her to take a bath, then begin the TalbiyahforHajj, and to do everything that the people did, apart fromcircumambulating the House (Tawaf).",
      "chain": [
        "30201",
        "30463",
        "20160",
        "11062",
        "10535",
        "168",
        "2"
      ]
    },
    {
      "hadith_no": "3036",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا إبراهيم بن المنذر الحزامي، ويعقوب بن حميد بن كاسب، قالا حدثنا ابن أبي فديك، عن الضحاك بن عثمان، عن محمد بن المنكدر، عن عبد الرحمن بن يربوع، عن أبي بكر الصديق، أن رسول الله  صلى الله عليه وسلم  سئل أى الأعمال أفضل قال ‏\"‏ العج والثج ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Bakr As-Siddiq that the Messenger of Allah(ﷺ)was asked:                      “Which actions are best?” He said: “Raising one’svoice and slaughtering the sacrificial animal.”",
      "chain": [
        "30308",
        "32048",
        "20172",
        "20504",
        "11048",
        "2"
      ]
    },
    {
      "hadith_no": "3691",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن محمد، قالا حدثنا إسحاق بن سليمان، عن مغيرة بن مسلم، عن فرقد السبخي، عن مرة الطيب، عن أبي بكر الصديق، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يدخل الجنة سيئ الملكة ‏\"‏ ‏.‏ قالوا يا رسول الله أليس أخبرتنا أن هذه الأمة أكثر الأمم مملوكين ويتامى قال ‏\"‏ نعم فأكرموهم ككرامة أولادكم وأطعموهم مما تأكلون ‏\"‏ ‏.‏ قالوا فما ينفعنا في الدنيا قال ‏\"‏ فرس ترتبطه تقاتل عليه في سبيل الله مملوكك يكفيك فإذا صلى فهو أخوك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Bakr Siddiq(RA) that the Messenger of Allah(ﷺ) said:                     \"No person who mistreats his slave will enter Paradise.\" They said: \" O Messenger of Allah, did you  not tell us that this nation will have more slaves and orphans than any other nation?\" He said: \" Yes, so be as kind to them as you are to your own children, and feed them with the same food that you eat.\" They said: \"What will benefit us in this world?\" He said: \"A horse that is kept ready for fighting in the cause of Allah, and your slave to take care of you, and if he performs prayer, then he is your brother(in Islam).\"",
      "chain": [
        "30201",
        "38409",
        "20310",
        "14313",
        "2"
      ]
    },
    {
      "hadith_no": "3835",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن رمح، حدثنا الليث بن سعد، عن يزيد بن أبي حبيب، عن أبي الخير، عن عبد الله بن عمرو بن العاص، عن أبي بكر الصديق، ‏.‏ أنه قال لرسول الله  صلى الله عليه وسلم  علمني دعاء أدعو به في صلاتي ‏.‏ قال ‏\"‏ قل اللهم إني ظلمت نفسي ظلما كثيرا ولا يغفر الذنوب إلا أنت فاغفر لي مغفرة من عندك وارحمني إنك أنت الغفور الرحيم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Bakr Siddiq that :                     he said to the Messenger of Allah (saas): \"Teach me a supplication which I can say during my prayer.\" He said: \"Say: Allahumma inni zalamtu nafsi zulman kathiran wa la yaghfirudh-dhunub illa Anta, faghfirli maghfiratan min 'indika warhamni, innaka Antal-Ghafurur-Rahim (O Allah, I have wronged myself greatly and no one forgives sins but You, so grant me forgiveness from You and have mercy on me, for You are the Oft-Forgiving, Most Merciful).\"",
      "chain": [
        "30490",
        "20023",
        "11411",
        "11410",
        "29",
        "2"
      ]
    },
    {
      "hadith_no": "4080",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عمرو بن عثمان بن سعيد بن كثير بن دينار الحمصي، حدثنا أحمد بن خالد الوهبي، حدثنا عبد العزيز بن أبي سلمة الماجشون، عن عبد الواحد بن أبي عون، عن سعد بن إبراهيم، عن حابس اليماني، عن أبي بكر الصديق، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من صلى الصبح فهو في ذمة الله فلا تخفروا الله في عهده فمن قتله طلبه الله حتى يكبه في النار على وجهه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Bakr Siddiq that the Messenger of Allah(ﷺ) said:                      “Whoever offers the morning prayer, he is under theprotection of Allah, so do not betray Allah by betraying those whoareunder His protection. Whoever kills him, Allah will seek him outuntilHe throws him on his face into Hell.”",
      "chain": [
        "10581",
        "20734",
        "20026",
        "22141",
        "11063",
        "2"
      ]
    },
    {
      "hadith_no": "4210",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا نصر بن علي الجهضمي، ومحمد بن بشار، ومحمد بن المثنى، قالوا حدثنا روح بن عبادة، حدثنا سعيد بن أبي عروبة، عن أبي التياح، عن المغيرة بن سبيع، عن عمرو بن حريث، عن أبي بكر الصديق، قال حدثنا رسول الله  صلى الله عليه وسلم  ‏\"‏ أن الدجال يخرج من أرض بالمشرق يقال لها خراسان يتبعه أقوام كأن وجوههم المجان المطرقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Bakr Siddiq said:                      \"The Messenger ofAllah(ﷺ) told us: 'Dajjal will emerge in a land in the east calledKhorasan, and will be followed by people with faces like hammeredshields.'\"",
      "chain": [
        "30395",
        "30160",
        "30170",
        "20229",
        "11073",
        "11317",
        "19031",
        "5202",
        "2"
      ]
    }
  ],
  "total_hadiths": 38
}