{
  "id": "20016",
  "name": "Sa'id bin Masrooq Ath-Thawri سعيد بن مسروق الثوري",
  "full_name": "Sa'id bin Masrooq Ath-Thawri سعيد بن مسروق الثوري",
  "grade": "Succ. (Taba' Tabi') [6th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Kufa"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Kufa",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa",
      "Hijaz",
      "Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Thawri",
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "20015",
      "name": "Hamza bin Masrooq Ath-Thawri حمزة بن مسروق الثوري",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "children": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20013",
      "name": "'Umar bin Sa‘id Ath-Thawri عمر بن سعيد الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20014",
      "name": "Muburak bin Sa‘id Ath-Thawri مبارك بن سعيد الثوري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "teachers": [
    {
      "id": "11322",
      "name": "Ibrahim bin Yazid - Taym al-Rabab إبراهيم بن يزيد بن شريك تيم الرباب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11332",
      "name": "Khaythama bin 'Abdur Rahman خيثمة بن عبد الرحمن بن أبي سبرة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11630",
      "name": "Sa'id bin 'Amr bin Ashu' سعيد بن عمرو بن أشوع",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11350",
      "name": "Salmah bin Kahayl al-Hadrami سلمة بن كهيل بن حصين",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "28278",
      "name": "'Abdullah bin Bhyr عبد الله بن بحير",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11179",
      "name": "'Ubaya bin Rafa' bin Rafi' عباية بن رفاعة بن رافع",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11366",
      "name": "'Abdur Rahman bin Abi Na'm عبد الرحمن بن أبي نعم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11392",
      "name": "Muslim bin Sabih al-Hamdani, Abu al-Daha مسلم بن صبيح أبو الضحى",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11398",
      "name": "al-Mandhir bin Ya'la al-Thauri منذر بن يعلى الثوري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "28642",
      "name": "Yazid bin Hyan al-Nbty يزيد بن حيان النبطي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11383",
      "name": "Awn bin Abi Juhayfa عون بن أبي جحيفة",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20013",
      "name": "'Umar bin Sa‘id Ath-Thawri عمر بن سعيد الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20014",
      "name": "Muburak bin Sa‘id Ath-Thawri مبارك بن سعيد الثوري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20327",
      "name": "Abu al-Ahwus, Salam bin Sulaym al-Hanafi أبو الأحوص سلام بن سليم الحنفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "24131",
      "name": "Rabi' bin 'Alayya ربعي بن علية أبو الحسن",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-2488",
      "hadith_no": "2488",
      "source": "Sahih Bukhari",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا علي بن الحكم الأنصاري، حدثنا أبو عوانة، عن سعيد بن مسروق، عن عباية بن رفاعة بن رافع بن خديج، عن جده، قال كنا مع النبي صلى الله عليه وسلم بذي الحليفة فأصاب الناس جوع فأصابوا إبلا وغنما‏.‏ قال وكان النبي صلى الله عليه وسلم في أخريات القوم فعجلوا وذبحوا ونصبوا القدور، فأمر النبي صلى الله عليه وسلم بالقدور فأكفئت، ثم قسم فعدل عشرة من الغنم ببعير فند منها بعير، فطلبوه فأعياهم، وكان في القوم خيل يسيرة فأهوى رجل منهم بسهم فحبسه الله ثم قال ‏\"‏ إن لهذه البهائم أوابد كأوابد الوحش فما غلبكم منها فاصنعوا به هكذا ‏\"‏‏.‏ فقال جدي إنا نرجو  أو نخاف  العدو غدا، وليست معنا مدى أفنذبح بالقصب‏.‏ قال ‏\"‏ ما أنهر الدم وذكر اسم الله عليه، فكلوه، ليس السن والظفر، وسأحدثكم عن ذلك، أما السن فعظم وأما الظفر فمدى الحبشة ‏\"‏‏.‏",
      "text_en": " Narrated 'Abaya bin Rafa'a bin Raft' bin Khadij:                     My grandfather said, \"We were in the company of the Prophet at Dhul-Hulaifa. The people felt hungry and captured some camels and sheep (as booty). The Prophet was behind the people. They hurried and slaughtered the animals and put their meat in pots and started cooking it. (When the Prophet came) he ordered the pots to be upset and then he distributed the animals (of the booty), regarding ten sheep as equal to one camel. One of the camels fled and the people ran after it till they were exhausted. At that time there were few horses. A man threw an arrow at the camel, and Allah stopped the camel with it. The Prophet said, \"Some of these animals are like wild animals, so if you lose control over one of these animals, treat it in this way (i.e. shoot it with an arrow).\" Before distributing them among the soldiers my grandfather said, \"We may meet the enemies in the future and have no knives; can we slaughter the animals with reeds?\" The Prophet said, \"Use whatever causes blood to flow, and eat the animals if the name of Allah has been mentioned on slaughtering them. Do not slaughter with teeth or fingernails and I will tell you why: It is because teeth are bones (i.e. cannot cut properly) and fingernails are the tools used by the Ethiopians (whom we should not imitate for they are infidels).",
      "usc_msa_ref": "668",
      "chain": [
        "20168",
        "20469",
        "20016",
        "11179"
      ]
    },
    {
      "id": "sahih-bukhari-2507",
      "hadith_no": "2507",
      "source": "Sahih Bukhari",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد، أخبرنا وكيع، عن سفيان، عن أبيه، عن عباية بن رفاعة، عن جده، رافع بن خديج  رضى الله عنه  قال كنا مع النبي صلى الله عليه وسلم بذي الحليفة من تهامة، فأصبنا غنما وإبلا، فعجل القوم، فأغلوا بها القدور، فجاء رسول الله صلى الله عليه وسلم فأمر بها فأكفئت، ثم عدل عشرا من الغنم بجزور، ثم إن بعيرا ند وليس في القوم إلا خيل يسيرة فرماه رجل فحبسه بسهم، فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن لهذه البهائم أوابد كأوابد الوحش، فما غلبكم منها فاصنعوا به هكذا ‏\"‏‏.‏ قال قال جدي يا رسول الله إنا نرجو  أو نخاف  أن نلقى العدو غدا وليس معنا مدى، فنذبح بالقصب فقال ‏\"‏ اعجل أو أرني، ما أنهر الدم وذكر اسم الله عليه فكلوا، ليس السن والظفر، وسأحدثكم عن ذلك، أما السن فعظم، وأما الظفر فمدى الحبشة ‏\"‏‏.‏",
      "text_en": " Narrated Abaya bin Rifaa:                     My grandfather, Rafi` bin Khadij said, \"We were in the valley of Dhul-Hulaifa of Tuhama in the company of the Prophet and had some camels and sheep (of the booty). The people hurried (in slaughtering the animals) and put their meat in the pots and started cooking. Allah's Apostle came and ordered them to upset the pots, and distributed the booty considering one camel as equal to ten sheep. One of the camels fled and the people had only a few horses, so they got worried. (The camel was chased and) a man slopped the camel by throwing an arrow at it. Allah's Apostle said, 'Some of these animals are untamed like wild animals, so if anyone of them went out of your control, then you should treat it as you have done now.' \" My grandfather said, \"O Allah's Apostle! We fear that we may meet our enemy tomorrow and we have no knives, could we slaughter the animals with reeds?\" The Prophet said, \"Yes, or you can use what would make blood flow (slaughter) and you can eat what is slaughtered and the Name of Allah is mentioned at the time of slaughtering. But don't use teeth or fingernails (in slaughtering). I will tell you why, as for teeth, they are bones, and fingernails are used by Ethiopians for slaughtering. (See Hadith 668)",
      "usc_msa_ref": "684",
      "chain": [
        "30213",
        "20032",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sahih-bukhari-3075",
      "hadith_no": "3075",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا أبو عوانة، عن سعيد بن مسروق، عن عباية بن رفاعة، عن جده، رافع قال كنا مع النبي صلى الله عليه وسلم بذي الحليفة، فأصاب الناس جوع وأصبنا إبلا وغنما، وكان النبي صلى الله عليه وسلم في أخريات الناس، فعجلوا فنصبوا القدور، فأمر بالقدور فأكفئت، ثم قسم فعدل عشرة من الغنم ببعير، فند منها بعير، وفي القوم خيل يسير فطلبوه فأعياهم، فأهوى إليه رجل بسهم، فحبسه الله فقال ‏\"‏ هذه البهائم لها أوابد كأوابد الوحش، فما ند عليكم فاصنعوا به هكذا ‏\"‏‏.‏ فقال جدي إنا نرجو  أو نخاف  أن نلقى العدو غدا وليس معنا مدى، أفنذبح بالقصب فقال ‏\"‏ ما أنهر الدم وذكر اسم الله فكل، ليس السن والظفر، وسأحدثكم عن ذلك، أما السن فعظم، وأما الظفر فمدى الحبشة ‏\"‏‏.‏",
      "text_en": " Narrated Abaya bin Rifaa:                     My grandfather, Rafi` said, \"We were in the company of the Prophet at DhulHulaifa, and the people suffered from hunger. We got some camels and sheep (as booty) and the Prophet was still behind the people. They hurried and put the cooking pots on the fire. (When he came) he ordered that the cooking pots should be upset and then he distributed the booty (amongst the people) regarding ten sheep as equal to one camel then a camel fled and the people chased it till they got tired, as they had a few horses (for chasing it). So a man threw an arrow at it and caused it to stop (with Allah's Permission). On that the Prophet said, 'Some of these animals behave like wild beasts, so, if any animal flee from you, deal with it in the same way.\" My grandfather asked (the Prophet ), \"We hope (or are afraid) that we may meet the enemy tomorrow and we have no knives. Can we slaughter our animals with canes?\" Allah's Apostle replied, \"If the instrument used for killing causes the animal to bleed profusely and if Allah's Name is mentioned on killing it, then eat its meat (i.e. it is lawful) but won't use a tooth or a nail and I am telling you the reason: A tooth is a bone (and slaughtering with a bone is forbidden ), and a nail is the slaughtering instrument of the Ethiopians.\"",
      "usc_msa_ref": "309",
      "chain": [
        "20040",
        "20469",
        "20016",
        "11179"
      ]
    },
    {
      "id": "sahih-bukhari-3262",
      "hadith_no": "3262",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثني عمرو بن عباس، حدثنا عبد الرحمن، حدثنا سفيان، عن أبيه، عن عباية بن رفاعة، قال أخبرني رافع بن خديج، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ الحمى من فور جهنم، فأبردوها عنكم بالماء ‏\"‏‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     I heard the Prophet saying, \"Fever is from the heat of the (Hell) Fire; so cool it with water.\"",
      "usc_msa_ref": "484",
      "chain": [
        "30152",
        "20033",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sahih-bukhari-3344",
      "hadith_no": "3344",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "قال وقال ابن كثير عن سفيان، عن أبيه، عن ابن أبي نعم، عن أبي سعيد  رضى الله عنه  قال بعث علي  رضى الله عنه  إلى النبي صلى الله عليه وسلم بذهيبة فقسمها بين الأربعة الأقرع بن حابس الحنظلي ثم المجاشعي، وعيينة بن بدر الفزاري، وزيد الطائي ثم أحد بني نبهان، وعلقمة بن علاثة العامري ثم أحد بني كلاب، فغضبت قريش والأنصار، قالوا يعطي صناديد أهل نجد ويدعنا‏.‏ قال ‏\"‏ إنما أتألفهم ‏\"‏‏.‏ فأقبل رجل غائر العينين مشرف الوجنتين، ناتئ الجبين، كث اللحية، محلوق فقال اتق الله يا محمد‏.‏ فقال ‏\"‏ من يطع الله إذا عصيت، أيأمنني الله على أهل الأرض فلا تأمنوني ‏\"‏‏.‏ فسأله رجل قتله  أحسبه خالد بن الوليد  فمنعه، فلما ولى قال ‏\"‏ إن من ضئضئ هذا  أو في عقب هذا  قوم يقرءون القرآن، لا يجاوز حناجرهم، يمرقون من الدين مروق السهم من الرمية، يقتلون أهل الإسلام، ويدعون أهل الأوثان، لئن أنا أدركتهم لأقتلنهم قتل عاد ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                      `Ali sent a piece of gold to the Prophet who distributed it among four persons: Al-Aqra' bin H`Abis Al-Hanzali from the tribe of Mujashi, 'Uyaina bin Badr Al-Fazari, Zaid at-Ta'i who belonged to (the tribe of) Bani Nahban, and 'Alqama bin Ulatha Al-`Amir who belonged to (the tribe of) Bani Kilab. So the Quraish and the Ansar became angry and said, \"He (i.e. the Prophet, ) gives the chief of Najd and does not give us.\" The Prophet said, \"I give them) so as to attract their hearts (to Islam).\" Then a man with sunken eyes, prominent checks, a raised forehead, a thick beard and a shaven head, came (in front of the Prophet ) and said, \"Be afraid of Allah, O Muhammad!\" The Prophet ' said \"Who would obey Allah if I disobeyed Him? (Is it fair that) Allah has trusted all the people of the earth to me while, you do not trust me?\" Somebody who, I think was Khalid bin Al-Walid, requested the Prophet to let him chop that man's head off, but he prevented him. When the man left, the Prophet said, \"Among the off-spring of this man will be some who will recite the Qur'an but the Qur'an will not reach beyond their throats (i.e. they will recite like parrots and will not understand it nor act on it), and they will renegade from the religion as an arrow goes through the game's body. They will kill the Muslims but will not disturb the idolaters. If I should live up to their time' I will kill them as the people of 'Ad were killed (i.e. I will kill all of them).\"",
      "usc_msa_ref": "558",
      "chain": [
        "30169",
        "20012",
        "20016",
        "11366",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-4713",
      "hadith_no": "4713",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن أبيه، عن ابن أبي نعم، عن أبي سعيد   رضى الله عنه  قال بعث إلى النبي صلى الله عليه وسلم بشىء، فقسمه بين أربعة وقال ‏\"‏ أتألفهم ‏\"‏‏.‏ فقال رجل ما عدلت‏.‏ فقال ‏\"‏ يخرج من ضئضئ هذا قوم يمرقون من الدين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     Something was sent to the Prophet and he distributed it amongst four (men) and said, \"I want to attract their hearts,(to Islam thereby),\" A man said (to the Prophet ), \"You have not done justice.\" Thereupon the Prophet said, \"There will emerge from the offspring of this (man) some people who will renounce the religion.\"",
      "usc_msa_ref": "189",
      "chain": [
        "28531",
        "20012",
        "20016",
        "11366",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-5556",
      "hadith_no": "5556",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثني موسى بن إسماعيل، حدثنا أبو عوانة، عن سعيد بن مسروق، عن عباية بن رفاعة بن رافع، عن جده، رافع بن خديج قال كنا مع النبي صلى الله عليه وسلم بذي الحليفة، فأصاب الناس جوع، فأصبنا إبلا وغنما، وكان النبي صلى الله عليه وسلم في أخريات الناس، فعجلوا فنصبوا القدور، فدفع إليهم النبي صلى الله عليه وسلم فأمر بالقدور فأكفئت، ثم قسم فعدل عشرة من الغنم ببعير، فند منها بعير، وكان في القوم خيل يسيرة فطلبوه فأعياهم، فأهوى إليه رجل بسهم فحبسه الله فقال النبي صلى الله عليه وسلم ‏\"‏ إن لهذه البهائم أوابد كأوابد الوحش، فما ند عليكم فاصنعوا به هكذا ‏\"‏‏.‏ قال وقال جدي إنا لنرجو  أو نخاف  أن نلقى العدو غدا، وليس معنا مدى، أفنذبح بالقصب فقال ‏\"‏ ما أنهر الدم وذكر اسم الله عليه فكل، ليس السن والظفر، وسأخبركم عنه، أما السن عظم وأما الظفر فمدى الحبشة ‏\"‏‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     We were with the Prophet in Dhul-Hulaifa and there the people were struck with severe hunger. Then we got camels and sheep as war booty (and slaughtered them). The Prophet was behind all the people. The people hurried and fixed the cooking pots (for cooking) but the Prophet came there and ordered that the cooking pots be turned upside down. Then he distributed the animals, regarding ten sheep as equal to one camel. One of the camels ran away and there were a few horses with the people. They chased the camel but they got tired, whereupon a man shot it with an arrow whereby Allah stopped it. The Prophet said, \"Among these animals some are as wild as wild beasts, so if one of them runs away from you, treat it in this way.\" I said. \"We hope, or we are afraid that tomorrow we will meet the enemy and we have no knives, shall we slaughter (our animals) with canes?\" The Prophet said, \"If the killing tool causes blood to gush out and if Allah's Name is mentioned, eat (of the slaughterer animal). But do not slaughter with a tooth or a nail. I am telling you why: A tooth is a bone, and the nail is the knife of Ethiopians.\"",
      "usc_msa_ref": "406",
      "chain": [
        "20040",
        "20469",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sahih-bukhari-5561",
      "hadith_no": "5561",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا عبدان، قال أخبرني أبي، عن شعبة، عن سعيد بن مسروق، عن عباية بن رافع، عن جده، أنه قال يا رسول الله ليس لنا مدى‏.‏ فقال ‏\"‏ ما أنهر الدم وذكر اسم الله فكل، ليس الظفر والسن، أما الظفر فمدى الحبشة، وأما السن فعظم ‏\"‏‏.‏ وند بعير فحبسه فقال ‏\"‏ إن لهذه الإبل أوابد كأوابد الوحش فما غلبكم منها فاصنعوا هكذا ‏\"‏‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     that he said, \"O Allah's Apostle! We have no knife.\" The Prophet said, \"if the killing tool causes blood to gush out, and if Allah's Name is mentioned, eat (of the slaughtered animal). But do not slaughter with a nail or a tooth, for the nail is the knife of Ethiopians and a tooth is a bone.\" Suddenly a camel ran away and it was stopped (with an arrow). The Prophet then said, \"Of these camels there are some which are as wild as wild beasts; so if one of them runs away from you and you cannot catch it, treat it in this manner (i.e. shoot it with an arrow).",
      "usc_msa_ref": "411",
      "chain": [
        "30349",
        "30361",
        "20020",
        "20016"
      ]
    },
    {
      "id": "sahih-bukhari-5564",
      "hadith_no": "5564",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن أبيه، عن عباية بن رفاعة، عن رافع بن خديج، قال قال النبي صلى الله عليه وسلم ‏\"‏ كل  يعني  ما أنهر الدم إلا السن والظفر ‏\"‏‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     The Prophet said, \"Eat what is slaughtered (with any instrument) that makes blood flow out, except what is slaughtered with a tooth or a nail.'",
      "usc_msa_ref": "414",
      "chain": [
        "20351",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sahih-bukhari-5567",
      "hadith_no": "5567",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا عمرو بن علي، حدثنا يحيى، حدثنا سفيان، حدثنا أبي، عن عباية بن رفاعة بن رافع بن خديج، عن رافع بن خديج، قال قلت يا رسول الله إنا لاقو العدو غدا، وليست معنا مدى فقال ‏\"‏ اعجل أو أرن ما أنهر الدم وذكر اسم الله فكل، ليس السن والظفر، وسأحدثك، أما السن فعظم، وأما الظفر فمدى الحبشة ‏\"‏‏.‏ وأصبنا نهب إبل وغنم فند منها بعير، فرماه رجل بسهم فحبسه فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن لهذه الإبل أوابد كأوابد الوحش، فإذا غلبكم منها شىء، فافعلوا به هكذا ‏\"‏‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     I said, \"O Allah's Apostle! We are going to face the enemy tomorrow and we do not have knives.\" He said, \"Hurry up (in killing the animal). If the killing tool causes blood to flow out, and if Allah's Name is mentioned, eat (of the slaughtered animal). But do not slaughter with a tooth or a nail. I will tell you why: As for the tooth, it is a bone; and as for the nail, it is the knife of Ethiopians.\" Then we got some camels and sheep as war booty, and one of those camels ran away, whereupon a man shot it with an arrow and stopped it. Allah's Apostle said, \"Of these camels there are some which are as wild as wild beasts, so if one of them (runs away and) makes you tired, treat it in this manner.\"",
      "usc_msa_ref": "417",
      "chain": [
        "30153",
        "20031",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sahih-bukhari-5601",
      "hadith_no": "5601",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا سعيد بن مسروق، عن عباية بن رفاعة، عن أبيه، عن جده، رافع بن خديج قال قلت للنبي صلى الله عليه وسلم إننا نلقى العدو غدا، وليس معنا مدى‏.‏ فقال ‏\"‏ ما أنهر الدم وذكر اسم الله فكلوا، ما لم يكن سن ولا ظفر، وسأحدثكم عن ذلك، أما السن فعظم، وأما الظفر فمدى الحبشة ‏\"‏‏.‏ وتقدم سرعان الناس فأصابوا من الغنائم والنبي صلى الله عليه وسلم في آخر الناس فنصبوا قدورا فأمر بها فأكفئت وقسم بينهم وعدل بعيرا بعشر شياه، ثم ند بعير من أوائل القوم ولم يكن معهم خيل فرماه رجل بسهم فحبسه الله‏.‏ فقال ‏\"‏ إن لهذه البهائم أوابد كأوابد الوحش فما فعل منها هذا فافعلوا مثل هذا ‏\"‏‏.‏",
      "text_en": " Narrated Rait' bin Khadij:                     I said to the Prophet, \"We will be facing the enemy tomorrow and we have no knives (for slaughtering)' He said, \"If you slaughter the animal with anything that causes its blood to flow out, and if Allah's Name is mentioned on slaughtering it, eat of it, unless the killing instrument is a tooth or nail. I will tell you why: As for the tooth, it is a bone; and as for the nail, it is the knife of Ethiopians.\" The quick ones among the people got the war booty while the Prophet was behind the people. So they placed the cooking pots on the fire, but the Prophet ordered the cooking pots to be turned upside down. Then he distributed (the war booty) among them, considering one camel as equal to ten sheep. Then a camel belonging to the first party of people ran away and they had no horses with them, so a man shot it with an arrow whereby Allah stopped it. The Prophet said, \"Of these animals there are some which are as wild as wild beasts. So, if anyone of them runs away like this, do like this (shoot it with an arrow).",
      "usc_msa_ref": "451",
      "chain": [
        "30175",
        "20327",
        "20016",
        "11179",
        "11506",
        "1986"
      ]
    },
    {
      "id": "sahih-bukhari-5602",
      "hadith_no": "5602",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا ابن سلام، أخبرنا عمر بن عبيد الطنافسي، عن سعيد بن مسروق، عن عباية بن رفاعة، عن جده، رافع بن خديج  رضى الله عنه  قال كنا مع النبي صلى الله عليه وسلم في سفر فند بعير من الإبل  قال  فرماه رجل بسهم فحبسه، قال ثم قال ‏\"‏ إن لها أوابد كأوابد الوحش فما غلبكم منها فاصنعوا به هكذا ‏\"‏‏.‏ قال قلت يا رسول الله إنا نكون في المغازي والأسفار فنريد أن نذبح فلا تكون مدى قال ‏\"‏ أرن ما نهر  أو أنهر  الدم وذكر اسم الله فكل، غير السن والظفر، فإن السن عظم، والظفر مدى الحبشة ‏\"‏‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     While we were with the Prophet. on a journey, one of the camels ran away. A man shot it with an arrow and stopped it. The Prophet said, \"Of these camels some are as wild as wild beasts, so if one of them runs away and you cannot catch it, then do like this (shoot it with an arrow).\" I said, \"O Allah's Apostle! Sometimes when we are in battles or on a journey we want to slaughter (animals) but we have no knives.\" He said, \"Listen! If you slaughter the animal with anything that causes its blood to flow out, and if Allah's Name is mentioned on slaughtering it, eat of it, provided that the slaughtering instrument is not a tooth or a nail, as the tooth is a bone and the nail is the knife of Ethiopians.\"",
      "usc_msa_ref": "452",
      "chain": [
        "30376",
        "20346",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sahih-bukhari-5785",
      "hadith_no": "5785",
      "source": "Sahih Bukhari",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا سعيد بن مسروق، عن عباية بن رفاعة، عن جده، رافع بن خديج قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ الحمى من فوح جهنم، فابردوها بالماء ‏\"‏‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     I heard Allah's Apostle saying, \"Fever is from the heat of Hell, so abate fever with water.\"",
      "usc_msa_ref": "622",
      "chain": [
        "30175",
        "20327",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sahih-bukhari-6493",
      "hadith_no": "6493",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا صدقة بن الفضل، أخبرنا يحيى، عن سفيان، قال حدثني أبي، عن منذر، عن ربيع بن خثيم، عن عبد الله  رضى الله عنه  قال خط النبي صلى الله عليه وسلم خطا مربعا، وخط خطا في الوسط خارجا منه، وخط خططا صغارا إلى هذا الذي في الوسط، من جانبه الذي في الوسط وقال ‏\"‏ هذا الإنسان، وهذا أجله محيط به  أو قد أحاط به  وهذا الذي هو خارج أمله، وهذه الخطط الصغار الأعراض، فإن أخطأه هذا نهشه هذا، وإن أخطأه هذا نهشه هذا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet drew a square and then drew a line in the middle of it and let it extend outside the square and then drew several small lines attached to that central line, and said, \"This is the human being, and this, (the square) in his lease of life, encircles him from all sides (or has encircled him), and this (line), which is outside (the square), is his hope, and these small lines are the calamities and troubles (which may befall him), and if one misses him, an-other will snap (i.e. overtake) him, and if the other misses him, a third will snap (i.e. overtake) him.\"",
      "usc_msa_ref": "426",
      "chain": [
        "30343",
        "20031",
        "20012",
        "20016",
        "11398",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-7522",
      "hadith_no": "7522",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان، عن أبيه، عن ابن أبي نعم  أو أبي نعم شك قبيصة  عن أبي سعيد، قال بعث إلى النبي صلى الله عليه وسلم بذهيبة فقسمها بين أربعة‏.‏ وحدثني إسحاق بن نصر حدثنا عبد الرزاق أخبرنا سفيان عن أبيه عن ابن أبي نعم عن أبي سعيد الخدري قال بعث علي وهو باليمن إلى النبي صلى الله عليه وسلم بذهيبة في تربتها، فقسمها بين الأقرع بن حابس الحنظلي ثم أحد بني مجاشع، وبين عيينة بن بدر الفزاري، وبين علقمة بن علاثة العامري ثم أحد بني كلاب، وبين زيد الخيل الطائي ثم أحد بني نبهان، فتغضبت قريش والأنصار فقالوا يعطيه صناديد أهل نجد ويدعنا قال ‏\"‏ إنما أتألفهم ‏\"‏‏.‏ فأقبل رجل غائر العينين، ناتئ الجبين، كث اللحية، مشرف الوجنتين، محلوق الرأس فقال يا محمد اتق الله‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ فمن يطيع الله إذا عصيته فيأمني على أهل الأرض، ولا تأمنوني ‏\"‏‏.‏ فسأل رجل من القوم  قتله أراه خالد بن الوليد  فمنعه النبي صلى الله عليه وسلم فلما ولى قال النبي صلى الله عليه وسلم ‏\"‏ إن من ضئضئ هذا قوما يقرءون القرآن لا يجاوز حناجرهم، يمرقون من الإسلام مروق السهم من الرمية، يقتلون أهل الإسلام ويدعون أهل الأوثان، لئن أدركتهم لأقتلنهم قتل عاد ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     When `Ali was in Yemen, he sent some gold in its ore to the Prophet. The Prophet distributed it among Al-Aqra' bin H`Abis Al-Hanzali who belonged to Bani Mujashi, 'Uyaina bin Badr Al-Fazari, 'Alqama bin 'Ulatha Al-`Amiri, who belonged to the Bani Kilab tribe and Zaid AI-Khail at-Ta'i who belonged to Bani Nabhan. So the Quraish and the Ansar became angry and said, \"He gives to the chiefs of Najd and leaves us!\" The Prophet said, \"I just wanted to attract and unite their hearts (make them firm in Islam).\" Then there came a man with sunken eyes, bulging forehead, thick beard, fat raised cheeks, and clean-shaven head, and said, \"O Muhammad! Be afraid of Allah! \" The Prophet said, \"Who would obey Allah if I disobeyed Him? (Allah). He trusts me over the people of the earth, but you do not trust me?\" A man from the people (present then), who, I think, was Khalid bin Al- Walid, asked for permission to kill him, but the Prophet prevented him. When the man went away, the Prophet said, \"Out of the offspring of this man, there will be people who will recite the Qur'an but it will not go beyond their throats, and they will go out of Islam as an arrow goes out through the game, and they will kill the Muslims and leave the idolators. Should I live till they appear, I would kill them as the Killing of the nation of 'Ad.\"",
      "usc_msa_ref": "",
      "chain": [
        "20351",
        "20012",
        "20016",
        "11366",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-1772",
      "hadith_no": "1772",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني علي بن حجر، حدثنا حسان، - قاضي كرمان - عن سعيد بن مسروق، عن أبي الضحى، عن مسروق، عن عائشة، قالت كل الليل قد أوتر رسول الله صلى الله عليه وسلم فانتهى وتره إلى آخر الليل ‏.‏",
      "text_en": " Sa'd b. Hisham b. 'Amir decided to participate in the expedition for the sake of Allah, so he came to Medina and he decided to dispose of his property there and buy arms and horses instead and fight against the Romans to the end of his life. When he came to Medina, he met the people of Medina. They dissuaded him to do such a thing, and informed him that a group of six men had decided to do so during the lifetime of the Apostle of Allah (may peace be upon him) and the Apostle of Allah (may peace be upon him) forbade them to do it, and said:                      Is there not for you a model pattern in me? And when they narrated this to him (Sa'd b. Hisham), he returned to his wife, though he had divorced her and made (people) witness to his reconciliation. He then came to Ibn 'Abbas and asked him about the Witr of the Messenger of Allah (may peace be upon him). Ibn 'Abbas said: Should I not lead you to one who knows best amongst the people of the world about the Witr of the Messenger of Allah (may peace be upon him)? He said: Who is it? He (Ibn 'Abbas) said: It is 'A'isha. So go to her and ask her (about Witr) and then come to me and inform me about her answer that she would give you. So I came to Hakim b. Aflah and requested him to take me to her. He said: I would not go to her, for I forbade her to speak anything (about the conflict) between the two groupS, but she refused (to accept my advice) and went (to participate in that corflict). I (requested) him (Hakim) with an oath to lead me to her. So we went to 'A'isha and we begged permission to meet her. She granted us permission and we went in. She said: Are you Hakim? (She recognised him.) He replied: Yes. She said: Who is there with you? He said: He is Sa'd b. Hisham. She said: Which Hisham? He said: He is Hisham b. 'Amir. She blessed him ('Amir) with mercy from Allah and spoke good of him (Qatada said that he died as a martyr in Uhud). I said: Mother of the Faithful, tell me about the character of the Messenger of Allah (may peace be upon him). She said: Don't you read the Qur'an? I said: Yes. Upon this she said: The character of the Apostle of Allah (may peace be upon him) was the Qur'an. He said: I felt inclined to get up and not ask anything (further) till death. But then I changed my mind and said: Inform me about the observance (of the night prayer) of the Messenger of Allah (may peace be upon him). She said: Did you not recite:\" O thou wrapped up\"? He said: Yes. She said: Allah, the Exalted and the Glorious, made the observance of the night prayer at the beginning of this Surah obligatory. So the Apostle of Allah (may peace be upon him and his Companions around him observed this (night prayer) for one year. Allah held back the concluding portion of this Surah for twelve months in the Heaven till (at the end of this period) Allah revealed the concluding verses of this Surah which lightened (the burden of this prayer), and the night prayer became a supererogatory prayer after being an obligatory one. I said: Mother of the Faithful, inform me about the Witr of the Messenger of Allah (may peace be upon him). She said: I used to prepare tooth stick for him and water for his ablution, and Allah would rouse him to the extent He wished during the night. He would use the tooth stick, and perform ablution, and would offer nine rak'ahs, and would not sit but in the eighth one and would remember Allah, and praise Him and supplicate Him, then he would get up without uttering the salutation and pray the ninth rak'ah. He would then sit, remember, praise Him and supplicate Him and then utter a salutation loud enough for us to hear. He would then pray two rak'ahs sitting after uttering the salutation, and that made eleven rak'ahs. O my son, but when the Apostle of Allah (may peace be upon him) grew old and put on flesh, he observed Witr of seven, doing in the two rak'ahs as he had done formerly, and that made nine. O my son, and when the Apostle of Allah (may peace be upon him) observed prayer, he liked to keep on observing it, and when sleep or pain overpowered him and made it impossible (for him) to observe prayer in the night, he prayed twelve rak'ahs daring the day. I am not aware of Allah's Prophet (may peace be upon him) having recited the whole Qur'an during one single night, or praying through the night till morning, or fasting a complete month, except Ramadan. He (the narrator) said: I then went to Ibn 'Abbas and narrated to him the hadith (transmitted from her), and he said: She says the truth If I went to her and got into her presence, I would have listened to it orally from her. He said: If I were to know that you do not go to her. I would not have transmitted this hadith to you narrated by her.",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20016",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-1832",
      "hadith_no": "1832",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وهناد بن السري، قالا حدثنا أبو الأحوص، عن سعيد بن مسروق، عن سلمة بن كهيل، عن أبي رشدين، مولى ابن عباس عن ابن عباس، قال بت عند خالتي ميمونة ‏.‏ واقتص الحديث ولم يذكر غسل الوجه والكفين غير أنه قال ثم أتى القربة فحل شناقها فتوضأ وضوءا بين الوضوءين ثم أتى فراشه فنام ثم قام قومة أخرى فأتى القربة فحل شناقها ثم توضأ وضوءا هو الوضوء وقال ‏\"‏ أعظم لي نورا ‏\"‏ ‏.‏ ولم يذكر ‏\"‏ واجعلني نورا ‏\"‏ ‏.‏",
      "text_en": " Kuraib reported that Ibn 'Abbas spent a night in the house of the Messenger of Allah (may peace be upon him) and he said:                      The Messenger of Allah may peace be upon him) stood near the water-skin and poured water out of that and performed ablution in which he neither used excess of water nor too little of it, and the rest of the hadith is the same, and in this mention is also made (of the fact) that on that night the Messenger of Allah (may peace be upon him) made supplication before Allah in nineteen words. Kuraib reported: I remember twelve words out of these, bux have forgotten the rest. The Messenger of Allah said:\" Place light in my heart, light in my tongue, light in my hearing, light in my sight, light above me, light below me, light on my right, light on my left, light in front of me, light behind me, place light in my soul, and make light abundant for me.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30480",
        "20327",
        "20016",
        "11350",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-2499",
      "hadith_no": "2499",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا هناد بن السري، حدثنا أبو الأحوص، عن سعيد بن مسروق، عن عبد الرحمن، بن أبي نعم عن أبي سعيد الخدري، قال بعث علي - رضى الله عنه - وهو باليمن بذهبة في تربتها إلى رسول الله صلى الله عليه وسلم فقسمها رسول الله صلى الله عليه وسلم بين أربعة نفر الأقرع بن حابس الحنظلي وعيينة بن بدر الفزاري وعلقمة بن علاثة العامري ثم أحد بني كلاب وزيد الخير الطائي ثم أحد بني نبهان - قال - فغضبت قريش فقالوا أتعطي صناديد نجد وتدعنا فقال رسول الله صلى الله عليه وسلم ‏\"‏ إني إنما فعلت ذلك لأتألفهم ‏\"‏ فجاء رجل كث اللحية مشرف الوجنتين غائر العينين ناتئ الجبين محلوق الرأس فقال اتق الله يا محمد ‏.‏ - قال - فقال رسول الله صلى الله عليه وسلم ‏\"‏ فمن يطع الله إن عصيته أيأمنني على أهل الأرض ولا تأمنوني ‏\"‏ قال ثم أدبر الرجل فاستأذن رجل من القوم في قتله - يرون أنه خالد بن الوليد - فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن من ضئضئ هذا قوما يقرءون القرآن لا يجاوز حناجرهم يقتلون أهل الإسلام ويدعون أهل الأوثان يمرقون من الإسلام كما يمرق السهم من الرمية لئن أدركتهم لأقتلنهم قتل عاد ‏\"‏ ‏.‏",
      "text_en": " Abu Said Khudri reported that 'Ali (Allah be pleased with him) sent some gold alloyed with dust to the Messenger of Allah (may peace be upon him), and the Messenger of Allah (may peace be upon him) distributed that among four men, al-Aqra b. Habis Hanzali and Uyaina b. Badr al-Fazari and 'Alqama b. 'Ulatha al-'Amiri, then to one person of the tribe of Kilab and to Zaid al-Khair al-Ta'l, and then to one person of the tribe of Nabhan. Upon this the people of Quraish felt angry and said:                      He (the Holy Prophet) gave to the chiefs of Najd and ignored us. Upon this the Messenger of Allah (may peace be upon him) said: I have done it with a view to con- cillating them. Then there came a person with thick beard, prominent cheeks, deep sunken eyes and protruding forehead and shaven head. He said: Muhammad, fear Allah. Upon this the Messenger of Allah (may peace be upon him) said: If I disobey Allah, who would then obey Him? Have I not been (sent as the) most trustworthy among the people of the-world? -but you do not repose trust in me. That person then went back. A person among the people then sought permission (from the Holy Prophet) for his murder. According to some, it was Khalid b. Walid who sought the permission. Upon this the Messenger of Allah (may peace be upon him), said: From this very person's posterity there would arise people who would recite the Qur'an, but it would not go beyond their throat; they would kill the followers of Islam and would spare the idol-worshippers. They would glance through the teachings of Islam so hurriedly just as the arrow passes through the pray. If I were to ever find them I would kill them like 'Ad.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20327",
        "20016",
        "11366",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-4284",
      "hadith_no": "4284",
      "source": "Sahih Muslim",
      "chapter": "The Book of Gifts - كتاب الهبات",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا حجاج بن أبي عثمان، ح وحدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، عن وكيع، عن سفيان، ح وحدثنا عبد الوارث بن عبد الصمد، حدثني أبي، عن جدي، عن أيوب، كل هؤلاء عن أبي الزبير، عن جابر، عن النبي صلى الله عليه وسلم بمعنى حديث أبي خيثمة وفي حديث أيوب من الزيادة قال جعل الأنصار يعمرون المهاجرين فقال رسول الله صلى الله عليه وسلم ‏\"‏ أمسكوا عليكم أموالكم ‏\"‏ ‏.‏",
      "text_en": " This hadith is narrated on the authority of Jabir through other chains of transmitters, but (with this addition of words) that thehadith transmitted on the authority of Ayyub (these words are found):                     \" The Helpers (Ansar) conferred the benefit of 'Umra, upon the Emigrants (Muhajirin), whereupon Allah's Messenger (may peace be upon him) said: Keep your property to yourselves.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11277",
        "30201",
        "30123",
        "20032",
        "20012",
        "20016",
        "11263",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-5088",
      "hadith_no": "5088",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا محمد بن الوليد بن عبد الحميد، حدثنا محمد بن جعفر، حدثنا شعبة، عن  سعيد بن مسروق، حدثنا الشعبي، قال سمعت عدي بن حاتم، - وكان لنا جارا ودخيلا وربيطا بالنهرين - أنه سأل النبي صلى الله عليه وسلم قال أرسل كلبي فأجد مع كلبي كلبا قد أخذ لا أدري أيهما أخذ ‏.‏ قال ‏\"‏ فلا تأكل فإنما سميت على كلبك ولم تسم على غيره ‏\"‏ ‏.‏",
      "text_en": " Sha'bi reported:                      I heard Adi b. Hatim say-and he was our neighbour, and our partner and co worker at Nahrain-that he asked Allah's Apostle (may peace he upon him) saying: I let off my dog and find another dog along with my dog and that (any one of them) catches the (game), but I do not know which one had caught it, whereupon he (the Holy Prophet) said: Then don't eat that, for you recited the name of Allah while letting off your dog and did not recite on the other.",
      "usc_msa_ref": "",
      "chain": [
        "30174",
        "20173",
        "20020",
        "20016",
        "11052",
        "212"
      ]
    },
    {
      "id": "sahih-muslim-5204",
      "hadith_no": "5204",
      "source": "Sahih Muslim",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن المثنى العنزي، حدثنا يحيى بن سعيد، عن سفيان، حدثني أبي، عن عباية بن رفاعة بن رافع بن خديج، عن رافع بن خديج، قلت يا رسول الله إنا لاقو العدو غدا وليست معنا مدى قال صلى الله عليه وسلم ‏\"‏ أعجل أو أرني ما أنهر الدم وذكر اسم الله فكل ليس السن والظفر وسأحدثك أما السن فعظم وأما الظفر فمدى الحبشة ‏\"‏ ‏.‏ قال وأصبنا نهب إبل وغنم فند منها بعير فرماه رجل بسهم فحبسه فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن لهذه الإبل أوابد كأوابد الوحش فإذا غلبكم منها شىء فاصنعوا به هكذا ‏\"‏ ‏.‏",
      "text_en": " Rafi' b. Khadij is reported to have said:                      Allah's Messenger, we are going to encounter the enemy tomorrow, but we have no knives with us. Thereupon Allah's Messenger (may peace be upon him) said: Make haste or be careful (in making arrangements for procuring knives) which would let the blood flow (and along with it) the name of Allah is also to be recited. Then eat, but not the tooth or nail. And I am going to tell you why it is not permissible to slaughter the animal with the help of tooth and bone; and as for the nail. it is a bone, and the bone is the knife of Abyssinians. He (the narrator) said: There fell to our lot as spoils of war camels and goats, and one of the camels among them became wild. A person (amongst usl struck It with an arrow which brought it under control. whereupon Allah's Messenger (may peace be upon him) said: This camel became wild like wild animals, so if you find any animal getting wild, you do the same with that",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20031",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sahih-muslim-5205",
      "hadith_no": "5205",
      "source": "Sahih Muslim",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا وكيع، حدثنا سفيان بن سعيد بن مسروق، عن أبيه، عن عباية بن رفاعة بن رافع بن خديج، عن رافع بن خديج، قال كنا مع رسول الله صلى الله عليه وسلم بذي الحليفة من تهامة فأصبنا غنما وإبلا فعجل القوم فأغلوا بها القدور فأمر بها فكفئت ثم عدل عشرا من الغنم بجزور ‏.‏ وذكر باقي الحديث كنحو حديث يحيى بن سعيد ‏.‏",
      "text_en": " Rafi' b. Khadij reported:                      While we were with Allah's Messenger (may peace he upon him) in Dhu'I-Hulaifa in Tihama, we got hold of goats and camels. Some persons (amongst us) made haste and boiled (the flesh of goats and camels) in their earthen pots. He then commanded and these were turned over; then he equalised ten goats for a camel. The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20032",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sahih-muslim-5207",
      "hadith_no": "5207",
      "source": "Sahih Muslim",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثنيه القاسم بن زكرياء، حدثنا حسين بن علي، عن زائدة، عن سعيد بن مسروق، بهذا الإسناد الحديث إلى آخره بتمامه وقال فيه وليست معنا مدى أفنذبح بالقصب",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20315",
        "20320",
        "20016"
      ]
    },
    {
      "id": "sahih-muslim-5208",
      "hadith_no": "5208",
      "source": "Sahih Muslim",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثنا محمد بن الوليد بن عبد الحميد، حدثنا محمد بن جعفر، حدثنا شعبة، عن  سعيد بن مسروق، عن عباية بن رفاعة بن رافع، عن رافع بن خديج، أنه قال يا رسول الله إنا لاقو العدو غدا وليس معنا مدى وساق الحديث ولم يذكر فعجل القوم فأغلوا بها القدور فأمر بها فكفئت وذكر سائر القصة ‏.‏",
      "text_en": " Rafi' b. Khadij reported that he said:                      Allah's Messenger, we are going to encounter the enemy tomorrow. and we do not have large knives with us. The rest of the hadith is the same, but no mention is made of this:\" The people hastened and they boiled (flesh) in the earthen pots. He (the Holy Prophet), cammanded and these were turned over and the narrator narrated the whole event.",
      "usc_msa_ref": "",
      "chain": [
        "30174",
        "20173",
        "20020",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sahih-muslim-5889",
      "hadith_no": "5889",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا هناد بن السري، حدثنا أبو الأحوص، عن سعيد بن مسروق، عن عباية، بن رفاعة عن جده، رافع بن خديج قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الحمى فور من جهنم فابردوها بالماء ‏\"‏ ‏.‏",
      "text_en": " Rafi' b. Khadij reported:                      I heard Allah's messenger (may peace be upon him) as saying: The fever is due to the intense heat of the Hell, so cool it with water.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20327",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sahih-muslim-6379",
      "hadith_no": "6379",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثنا محمد بن بكار بن الريان، حدثنا حسان، - يعني ابن إبراهيم - عن  سعيد بن مسروق، عن يزيد بن حيان، عن زيد بن أرقم، عن النبي صلى الله عليه وسلم ‏.‏ وساق الحديث بنحوه بمعنى حديث زهير ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Zaid b. Arqam through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30512",
        "20417",
        "20016",
        "28642",
        "384"
      ]
    },
    {
      "id": "sahih-muslim-6381",
      "hadith_no": "6381",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن بكار بن الريان، حدثنا حسان، - يعني ابن إبراهيم - عن سعيد، - وهو ابن مسروق - عن يزيد بن حيان، عن زيد بن أرقم، قال دخلنا عليه فقلنا له لقد رأيت خيرا ‏.‏ لقد صاحبت رسول الله صلى الله عليه وسلم وصليت خلفه ‏.‏ وساق الحديث بنحو حديث أبي حيان غير أنه قال ‏\"‏ ألا وإني تارك فيكم ثقلين أحدهما كتاب الله عز وجل هو حبل الله من اتبعه كان على الهدى ومن تركه كان على ضلالة ‏\"‏ ‏.‏ وفيه فقلنا من أهل بيته نساؤه قال لا وايم الله إن المرأة تكون مع الرجل العصر من الدهر ثم يطلقها فترجع إلى أبيها وقومها أهل بيته أصله وعصبته الذين حرموا الصدقة بعده ‏.‏",
      "text_en": " Yazid b. Hayyan reported:                      We went to him (Zaid b. Arqam) and said to him. You have found goodness (for you had the honour) to live in the company of Allah's Messenger (may peace be upon him) and offered prayer behind him, and the rest of the hadith is the same but with this variation of wording that lie said: Behold, for I am leaving amongst you two weighty things, one of which is the Book of Allah, the Exalted and Glorious, and that is the rope of Allah. He who holds it fast would be on right guidance and he who abandons it would be in error, and in this (hadith) these words are also found: We said: Who are amongst the members of the household? Aren't the wives (of the Holy Prophet) included amongst the members of his house hold? Thereupon he said: No, by Allah, a woman lives with a man (as his wife) for a certain period; he then divorces her and she goes back to her parents and to her people; the members of his household include his ownself and his kith and kin (who are related to him by blood) and for him the acceptance of Zakat is prohibited.",
      "usc_msa_ref": "",
      "chain": [
        "30512",
        "20417",
        "20016",
        "28642",
        "384"
      ]
    },
    {
      "id": "sahih-muslim-7399",
      "hadith_no": "7399",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، وأبو بكر بن نافع قالوا حدثنا  عبد الرحمن، - يعنون ابن مهدي - عن سفيان، عن أبيه، عن خيثمة، عن البراء بن عازب، ‏{‏ يثبت الله الذين آمنوا بالقول الثابت في الحياة الدنيا وفي الآخرة‏}‏ قال نزلت في عذاب القبر ‏.‏",
      "text_en": " Al-Bara' b. 'Azib reported that this verse:                     \" Allah keeps steadfast those who believe with firm word in th;s world and the Hereafter,\" was revealed in con- nection with the torment of the grave.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30170",
        "20523",
        "10530",
        "20012",
        "20016",
        "11332",
        "400"
      ]
    },
    {
      "id": "sunan-abi-daud-1922",
      "hadith_no": "1922",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى بن آدم، حدثنا سفيان، عن عبد الرحمن بن عياش، عن زيد بن علي، عن أبيه، عن عبيد الله بن أبي رافع، عن علي، قال ثم أردف أسامة فجعل يعنق على ناقته والناس يضربون الإبل يمينا وشمالا لا يلتفت إليهم ويقول ‏\"‏ السكينة أيها الناس ‏\"‏ ‏.‏ ودفع حين غابت الشمس ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     The Prophet then took up Usamah behind him (on the camel), and drove the camel at a quick pace. The people were beating their camels right and left, but he did not pay attention to them; he was saying: O people, preserve a quiet demeanour. He proceeded (from Arafat) when the sun had set.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20364",
        "20012",
        "20016",
        "11199",
        "5"
      ]
    },
    {
      "id": "sunan-abi-daud-1935",
      "hadith_no": "1935",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا يحيى بن آدم، حدثنا سفيان، عن عبد الرحمن بن عياش، عن زيد بن علي، عن أبيه، عن عبيد الله بن أبي رافع، عن علي، قال فلما أصبح - يعني النبي صلى الله عليه وسلم - ووقف على قزح فقال ‏\"‏ هذا قزح وهو الموقف وجمع كلها موقف ونحرت ها هنا ومنى كلها منحر فانحروا في رحالكم ‏\"‏ ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     When the morning came, the Prophet (ﷺ) stood at the mountain Quzah and said: This is Quzah, and this is a place of stationing, and the whole of al-Muzdalifah is a place of stationing.  I sacrificed the animals here, and the whole of Mina is a place of sacrifice. So sacrifice in your dwellings.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20364",
        "20012",
        "20016",
        "11199",
        "5"
      ]
    },
    {
      "id": "sunan-abi-daud-2821",
      "hadith_no": "2821",
      "source": "Sunan Abi Da'ud",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا سعيد بن مسروق، عن عباية بن رفاعة، عن أبيه، عن جده، رافع بن خديج قال أتيت رسول الله صلى الله عليه وسلم فقلت يا رسول الله إنا نلقى العدو غدا وليس معنا مدى أفنذبح بالمروة وشقة العصا فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرن أو أعجل ما أنهر الدم وذكر اسم الله عليه فكلوا ما لم يكن سنا أو ظفرا وسأحدثكم عن ذلك أما السن فعظم وأما الظفر فمدى الحبشة ‏\"‏ ‏.‏ وتقدم به سرعان من الناس فتعجلوا فأصابوا من الغنائم ورسول الله صلى الله عليه وسلم في آخر الناس فنصبوا قدورا فمر رسول الله صلى الله عليه وسلم بالقدور فأمر بها فأكفئت وقسم بينهم فعدل بعيرا بعشر شياه وند بعير من إبل القوم ولم يكن معهم خيل فرماه رجل بسهم فحبسه الله فقال النبي صلى الله عليه وسلم ‏\"‏ إن لهذه البهائم أوابد كأوابد الوحش فما فعل منها هذا فافعلوا به مثل هذا ‏\"‏ ‏.‏",
      "text_en": " Narrated Rafi' b. Khadij:                     I came to the Messenger of Allah (ﷺ) and said: Messenger of Allah, we shall meet the enemy tomorrow and we have no knives with us. May we kill with a sharp-edged white stone (flint) and with splinter of a staff ? The Messenger of Allah (ﷺ) said: Hasten in slaughtering it. When Allah's name is mentioned you may eat what is killed by anything which causes the blood to flow except tooth and claw. I shall tell you about it. The tooth is a bone, and the claw is the knife of Abyssinians. Some people hastened and went forward, they made haste and got booty, while the Messenger of Allah (ﷺ) was in the rear and they setup cooking pots. The Messenger of Allah (ﷺ) passed by over the cooking pots. He ordered to turn them over. He then divided (the spoils of war) between them, and gave them a camel for ten goats in equation. One of the camels of the people ran away, and they had no horses with them at that time. A man shot an arrow at it, and Allah prevented it from escaping. The Prophet (ﷺ) said: Among animals (i.e. camels) there are some which bolt like wild animals ; so when any of them does so, do with it like this.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20327",
        "20016",
        "11179",
        "11506",
        "1986"
      ]
    },
    {
      "id": "sunan-abi-daud-3132",
      "hadith_no": "3132",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا مسدد، حدثنا سفيان، حدثني جعفر بن خالد، عن أبيه، عن عبد الله بن جعفر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اصنعوا لآل جعفر طعاما فإنه قد أتاهم أمر شغلهم ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Ja'far:                     The Messenger of Allah (ﷺ) said: Prepare food for the family of Ja'far for there came upon them an incident which has engaged them.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20012",
        "20016",
        "108"
      ]
    },
    {
      "id": "sunan-abi-daud-3304",
      "hadith_no": "3304",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا شعيب بن أيوب، حدثنا معاوية بن هشام، عن سفيان، عن أبيه، عن عكرمة، عن عقبة بن عامر الجهني، أنه قال للنبي صلى الله عليه وسلم ‏:‏ إن أختي نذرت أن تمشي إلى البيت ‏.‏ فقال ‏:‏ ‏\"‏ إن الله لا يصنع بمشى أختك إلى البيت شيئا ‏\"‏ ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir al-Juhani:                     Uqbah said to the Prophet (ﷺ): My sister has taken a vow that she will walk to the House of Allah (the Ka'bah). Thereupon he said: Allah will not do anything of the walking of your sister to the House of Allah (i.e. the Ka'bah).",
      "usc_msa_ref": "",
      "chain": [
        "20609",
        "20012",
        "20016",
        "11023",
        "189"
      ]
    },
    {
      "id": "sunan-abi-daud-3341",
      "hadith_no": "3341",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا أبو الأحوص، عن سعيد بن مسروق، عن الشعبي، عن سمعان، عن سمرة، قال خطبنا رسول الله صلى الله عليه وسلم فقال ‏\"‏ ها هنا أحد من بني فلان ‏\"‏ ‏.‏ فلم يجبه أحد ثم قال ‏\"‏ ها هنا أحد من بني فلان ‏\"‏ ‏.‏ فلم يجبه أحد ثم قال ‏\"‏ ها هنا أحد من بني فلان ‏\"‏ ‏.‏ فقام رجل فقال أنا يا رسول الله ‏.‏ فقال صلى الله عليه وسلم ‏\"‏ ما منعك أن تجيبني في المرتين الأوليين أما إني لم أنوه بكم إلا خيرا إن صاحبكم مأسور بدينه ‏\"‏ ‏.‏ فلقد رأيته أدى عنه حتى ما بقي أحد يطلبه بشىء ‏.‏ قال أبو داود سمعان بن مشنج ‏.‏",
      "text_en": " Narrated Samurah:                     The Messenger of Allah (ﷺ) addressed us and said: Is here any one of such and such tribe present? But no one replied. He again asked: Is here any one of such and such tribe present? But no one replied. He again asked: Is here any one of such and such tribe? Then a man stood and said: I am (here), Messenger of Allah. He said: What prevented you from replying the first two times? I wish to tell you something good. Your companion has been detained (from entering Paradise) on account of his debt. Then I saw him that he paid off all his debt on his behalf and there remained no one to demand from him anything.Abu Dawud said: The name of the narrator Sam'an is Sam'an b. Mushannaj.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20327",
        "20016",
        "11052",
        "394"
      ]
    },
    {
      "id": "sunan-abi-daud-4764",
      "hadith_no": "4764",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، عن أبيه، عن ابن أبي نعم، عن أبي سعيد الخدري، قال ‏:‏ بعث علي عليه السلام إلى النبي صلى الله عليه وسلم بذهيبة في تربتها، فقسمها بين أربعة بين ‏:‏ الأقرع بن حابس الحنظلي ثم المجاشعي، وبين عيينة بن بدر الفزاري وبين زيد الخيل الطائي ثم أحد بني نبهان وبين علقمة بن علاثة العامري ثم أحد بني كلاب قال فغضبت قريش والأنصار وقالت ‏:‏ يعطي صناديد أهل نجد ويدعنا ‏.‏ فقال ‏:‏ ‏\"‏ إنما أتألفهم ‏\"‏ ‏.‏ قال ‏:‏ فأقبل رجل غائر العينين مشرف الوجنتين ناتئ الجبين كث اللحية محلوق قال ‏:‏ اتق الله يا محمد ‏.‏ فقال ‏:‏ ‏\"‏ من يطع الله إذا عصيته أيأمنني الله على أهل الأرض ولا تأمنوني ‏\"‏ ‏.‏ قال ‏:‏ فسأل رجل قتله أحسبه خالد بن الوليد - قال - فمنعه ‏.‏ قال ‏:‏ فلما ولى قال ‏:‏ ‏\"‏ إن من ضئضئ هذا أو في عقب هذا قوما يقرءون القرآن لا يجاوز حناجرهم يمرقون من الإسلام مروق السهم من الرمية، يقتلون أهل الإسلام ويدعون أهل الأوثان لئن أنا أدركتهم قتلتهم قتل عاد ‏\"‏ ‏.‏",
      "text_en": " Abu sa’id al-khudri said :                      ‘Ali sent some gold-mixed dust to the prophet (May peace be upon him). He divided it among the four : al-Aqra b. Habis al-Hanzall and then al-Mujashi, uyainah b. Badr al-fazari, zaid al-khail al-Ta’l, next to one of Banu nabhan, and ‘Alqamah b. ‘Ulathat al-Amiri (in general), next to one of Banu kulaib. The Quraish and the ansar became angry and said : He is giving to the chiefs of the people of Najd and leaving us. He said : I am giving them for reconciliation of their hearts. Then a man with deep-seated eyes, high cheek-bones, a projecting brow, a thick beard and a shaven head came forward and said: For Allah, Muhammad! He said : Who will obey Allah if I disobey Him? Allah entrusts me with power over the inhabitants of the earth, but you do not. A man asked to be allowed to kill him and I think he was Khalid b. al-Walid but he prevented him. Then when the man turned away, he said: From this one’s stock there will be people who recite the Quran, but it will not pass down their throats. They will sever from Islam and leave the worshippers of Idols alone; but if I live up to their time I shall certainly kill them as 'Ad were killed.",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "20016",
        "11366",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-95",
      "hadith_no": "95",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة، حدثنا أبو عوانة، عن سعيد بن مسروق، عن إبراهيم التيمي، عن عمرو بن ميمون، عن أبي عبد الله الجدلي، عن خزيمة بن ثابت، عن النبي صلى الله عليه وسلم أنه سئل عن المسح على الخفين فقال ‏\"‏ للمسافر ثلاثة وللمقيم يوم ‏\"‏ ‏.‏ وذكر عن يحيى بن معين أنه صحح حديث خزيمة بن ثابت في المسح ‏.‏ وأبو عبد الله الجدلي اسمه عبد بن عبد ويقال عبد الرحمن بن عبد ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن علي وأبي بكرة وأبي هريرة وصفوان بن عسال وعوف بن مالك وابن عمر وجرير ‏.‏",
      "text_en": " Khuzaimah bin Thabit narrated:                     \"The Prophet was asked about wiping over the Khuff.  So he said: \"Three (days) for the traveler, and one day for the resident.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20469",
        "20016",
        "11322",
        "11382",
        "19307",
        "410"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1491",
      "hadith_no": "1491",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا هناد، حدثنا أبو الأحوص، عن سعيد بن مسروق، عن عباية بن رفاعة بن رافع بن خديج، عن أبيه، عن جده، رافع بن خديج قال قلت يا رسول الله إنا نلقى العدو غدا وليست معنا مدى فقال النبي صلى الله عليه وسلم ‏\"‏ ما أنهر الدم وذكر اسم الله عليه فكلوه ما لم يكن سنا أو ظفرا وسأحدثكم عن ذلك أما السن فعظم وأما الظفر فمدى الحبشة ‏\"‏ ‏.‏",
      "text_en": " Narrated Rafi' bin Khadij:                     \"I said: 'O Messenger of Allah! We expect to meet the enemy tomorrow and we have no knives.' So the Prophet (ﷺ) said: 'As long as it causes blood to flow, and Allah's Name has been mentioned over it, then eat it, provided that it was not done with a tooth or nail. And I will tell you why: As for the tooth it is a bone, and as for the nail it is the knife of the Ethiopians.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20327",
        "20016",
        "11179",
        "11506",
        "1986"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1491-2",
      "hadith_no": "1491",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، عن سفيان الثوري، قال حدثنا أبي، عن عباية بن رفاعة، عن رافع بن خديج، رضى الله عنه عن النبي صلى الله عليه وسلم نحوه ولم يذكر فيه عباية عن أبيه وهذا أصح وعباية قد سمع من رافع ‏.‏ والعمل على هذا عند أهل العلم لا يرون أن يذكى بسن ولا بعظم ‏.‏",
      "text_en": " Another chain from Rafi' bin Khadij (may Allah be pleased with him) from the Prophet (ﷺ) and it is similar, but the narrator did not mention in it:                      \"Abayah, from his father\" and this is more correct. 'Abayah heard from Rafi'.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1492",
      "hadith_no": "1492",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا هناد، حدثنا أبو الأحوص، عن سعيد بن مسروق، عن عباية بن رفاعة بن رافع، عن أبيه، عن جده، رافع بن خديج قال كنا مع النبي صلى الله عليه وسلم في سفر فند بعير من إبل القوم ولم يكن معهم خيل فرماه رجل بسهم فحبسه الله فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن لهذه البهائم أوابد كأوابد الوحش فما فعل منها هذا فافعلوا به هكذا ‏\"‏ ‏.‏",
      "text_en": " Narrated Rafi' bin Khadij:                     \"We were with the Prophet (ﷺ) on journey when the camel that belonged to some people ran away and they did not have a horse. So a man shot it with an arrow and Allah stopped it. The Messenger of Allah (ﷺ) said: 'Of these beasts there are some that are as wild as wild animals. So if one of them does this, then treat it similarly.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20327",
        "20016",
        "11179",
        "11506",
        "1986"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1492-2",
      "hadith_no": "1492",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا وكيع، حدثنا سفيان، عن أبيه، عن عباية بن رفاعة، عن جده، رافع بن خديج عن النبي صلى الله عليه وسلم نحوه ولم يذكر فيه عباية عن أبيه وهذا أصح ‏.‏ والعمل على هذا عند أهل العلم ‏.‏ وهكذا رواه شعبة عن سعيد بن مسروق نحو رواية سفيان ‏.‏",
      "text_en": " Another chain from Rafi' bin Khadij from the Prophet (ﷺ) and it is similar, but (the narrator) did not mention in it \"Abayah from his father.\" and this is more correct.",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20032",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1600",
      "hadith_no": "1600",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا هناد، حدثنا أبو الأحوص، عن سعيد بن مسروق، عن عباية بن رفاعة، عن أبيه، عن جده، رافع بن خديج قال كنا مع رسول الله صلى الله عليه وسلم في سفر فتقدم سرعان الناس فتعجلوا من الغنائم فاطبخوا ورسول الله صلى الله عليه وسلم في أخرى الناس فمر بالقدور فأمر بها فأكفئت ثم قسم بينهم فعدل بعيرا بعشر شياه ‏.‏  قال أبو عيسى وروى سفيان الثوري، عن أبيه، عن عباية، عن جده، رافع بن خديج ولم يذكر فيه أبيه ‏.‏ حدثنا بذلك، محمود بن غيلان حدثنا وكيع، عن سفيان، ‏.‏ وهذا أصح وعباية بن رفاعة سمع من، جده رافع بن خديج ‏.‏ قال وفي الباب عن ثعلبة بن الحكم، وأنس، وأبي، ريحانة وأبي الدرداء وعبد الرحمن بن سمرة وزيد بن خالد وجابر وأبي هريرة وأبي أيوب ‏.‏",
      "text_en": " Narrated 'Abayah bin Rifa'ah:                     From his father, from his grandfather Rafi' bin Khadij, who said: \"We were with the Messenger of Allah (ﷺ) on a journey, when the hasty people went rushing ahead to the sheep to cook them, while the Messenger of Allah (ﷺ) was in the rear of the people. Then he passed the kettled and ordered that they be weighed, then he distributed it between them and equated a camel to ten sheep.\"[Abu 'Eisa said:] Sufyan Ath-Thawri reported it from his father, from 'Abayah, from his grandfather Rafi' bin Khadij, and he did not mention \"from his father\" in it.This was narrated to us by Mahmud bin Ghailan (who said:) \"Waki' narrated it to us from Sufyan.\" And this is more correct. 'Abayah bin Rifa'ah heard from his grandfather Rafi' bin Khadij.He said: There are narrations on this topic from Tha'labah bin Al-Hakam, Anas, Abu Rihanah, Abu Ad-Darda, 'Abdur-Rahman bin Samurah, Zaid bin Khalid, Jabir, Abu Hurairah, and Abu Ayyub.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20327",
        "20016",
        "11179",
        "11506",
        "1986"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2216",
      "hadith_no": "2216",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا هناد، حدثنا أبو الأحوص، عن سعيد بن مسروق، عن عباية بن رفاعة، عن جده، رافع بن خديج عن النبي صلى الله عليه وسلم قال ‏\"‏ الحمى فور من النار فأبردوها بالماء ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أسماء بنت أبي بكر وابن عمر وامرأة الزبير وعائشة وابن عباس ‏.‏",
      "text_en": " \"Rafi' bin Khadij narrated that the Prophet (S.A.W) said:                     \"Fever is from the agitation of the Fire, so cool it with water.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20327",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2469",
      "hadith_no": "2469",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Witnesses - كتاب الشهادات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "35",
      "text_ar": "حدثنا عبد بن حميد، حدثنا محمد بن عبيد، حدثنا سفيان، وهو ابن زياد العصفري عن أبيه، عن حبيب بن النعمان الأسدي، عن خريم بن فاتك الأسدي، أن رسول الله صلى الله عليه وسلم صلى صلاة الصبح فلما انصرف قام قائما فقال ‏\"‏ عدلت شهادة الزور بالشرك بالله ‏\"‏ ‏.‏ ثلاث مرات ثم تلا هذه الآية ‏(‏واجتنبوا قول الزور ‏)‏ إلى آخر الآية ‏.‏ قال أبو عيسى هذا عندي أصح ‏.‏ وخريم بن فاتك له صحبة وقد روى عن النبي صلى الله عليه وسلم أحاديث وهو مشهور ‏.‏",
      "text_en": " Khuraim bin Fatik Al-Asadi narrated that the Messenger of Allah (s.a.w) performed the Subh (Fajr)prayer. Then when he turned  he got up to stand and said:                     \"O you people! False witness is tantamount to Shirk with Allah.\"Saying it three times, then he recited this Ayah And shun false speech Until the end of the Ayah.",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "30213",
        "20012",
        "20016",
        "18155",
        "4127"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2642",
      "hadith_no": "2642",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا سفيان، عن أبيه، عن أبي يعلى، عن الربيع بن خثيم، عن عبد الله بن مسعود، قال خط لنا رسول الله صلى الله عليه وسلم خطا مربعا وخط في وسط الخط خطا وخط خارجا من الخط خطا وحول الذي في الوسط خطوطا فقال ‏\"‏ هذا ابن آدم وهذا أجله محيط به وهذا الذي في الوسط الإنسان وهذه الخطوط عروضه إن نجا من هذا ينهشه هذا والخط الخارج الأمل ‏\"‏ ‏.‏ هذا حديث صحيح ‏.‏",
      "text_en": " 'Abdullah bin Mas'ud narrated \"The Messenger of Allah (s.a.w) drew a square line (on the ground) forus, and in the middle of the (square) line he drew another line, and he  drew another line going out of the  (square) line.Around the one that was in the middle, he drew (various) lines. Then he said:                     'This is the son of Adam, and this is his life-span encircling him, and this one in the middle in the person, and these lines are his obstacles, if he escapes this one, this one ensnares him, and the line extending outside is his hope.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20012",
        "20016",
        "10760",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2683-2",
      "hadith_no": "2683",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا هناد، حدثنا أبو الأحوص، عن سعيد بن مسروق، عن ابن أشوع، عن يزيد بن سلمة الجعفي، قال قال يزيد بن سلمة يا رسول الله إني قد سمعت منك، حديثا كثيرا أخاف أن ينسيني، أوله آخره فحدثني بكلمة تكون جماعا ‏.‏ قال ‏\"‏ اتق الله فيما تعلم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث ليس إسناده بمتصل وهو عندي مرسل ‏.‏ ولم يدرك عندي ابن أشوع يزيد بن سلمة وابن أشوع اسمه سعيد بن أشوع ‏.‏",
      "text_en": " Narrated Ibn Ashwa:                     from Yazid bin Salamah Al-Ju'fi, he said: \"Yazid bin Salamah 'O Messenger of Allah! I heard so many narrations from you that I am afraid the last of them will cause me to forget the first of them. So narrate a statement to me that will encompass them.' So he said: 'Have Taqwa of Allah with what you learn.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20327",
        "20016"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3263",
      "hadith_no": "3263",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد، حدثنا سفيان، عن أبيه، عن أبي الضحى، عن مسروق، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن لكل نبي ولاة من النبيين وإن وليي أبي وخليل ربي ‏\"‏ ‏.‏ ثم قرأ ‏:‏ ‏(‏إن أولى الناس بإبراهيم للذين اتبعوه وهذا النبي والذين آمنوا والله ولي المؤمنين ‏)‏‏.‏",
      "text_en": " Narrated 'Abdullah:                     that the Messenger of Allah (ﷺ) said: \"Every Prophet had a Wali among the Prophets. My Wali is my father Ibrahim the Khalil of my Lord.\" Then he recited: Verily among mankind who have the best claim to Ibrahim, are those who followed him, and this Prophet and those who have believed. And Allah is the Wali (protector) of the believers (3:68).",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20355",
        "20012",
        "20016",
        "11392",
        "11018",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3264",
      "hadith_no": "3264",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمود، حدثنا أبو نعيم، حدثنا سفيان، عن أبيه، عن أبي الضحى، عن عبد الله، عن النبي صلى الله عليه وسلم مثله ولم يقل فيه عن مسروق ‏.‏ قال أبو عيسى هذا أصح من حديث أبي الضحى عن مسروق وأبو الضحى اسمه مسلم بن صبيح ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20348",
        "20012",
        "20016",
        "11392",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3265",
      "hadith_no": "3265",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو كريب، حدثنا وكيع، عن سفيان، عن أبيه، عن أبي الضحى، عن عبد الله، عن النبي صلى الله عليه وسلم نحو حديث أبي نعيم وليس فيه عن مسروق ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20032",
        "20012",
        "20016",
        "11392",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-1121",
      "hadith_no": "1121",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا هناد بن السري، عن أبي الأحوص، عن سعيد بن مسروق، عن سلمة بن كهيل، عن أبي رشدين، - وهو كريب - عن ابن عباس، قال بت عند خالتي ميمونة بنت الحارث وبات رسول الله صلى الله عليه وسلم عندها فرأيته قام لحاجته فأتى القربة فحل شناقها ثم توضأ وضوءا بين الوضوءين ثم أتى فراشه فنام ثم قام قومة أخرى فأتى القربة فحل شناقها ثم توضأ وضوءا هو الوضوء ثم قام يصلي وكان يقول في سجوده ‏\"‏ اللهم اجعل في قلبي نورا واجعل في سمعي نورا واجعل في بصري نورا واجعل من تحتي نورا واجعل من فوقي نورا وعن يميني نورا وعن يساري نورا واجعل أمامي نورا واجعل خلفي نورا وأعظم لي نورا ‏\"‏ ‏.‏ ثم نام حتى نفخ فأتاه بلال فأيقظه للصلاة ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"I stayed overnight with my maternal aunt Maimunah bin Al-Harith, and the Messenger of Allah (ﷺ) stayed overnight with her. I saw him get up to relieve himself and he went to the waterskin and undid its string, then he performed wudu and that was moderate (in the amount of water used). Then he went to his bed and slept. Then he got up again and went to the waterskin and undid its string, and performed wudu again, like the first time. Then he stood and prayed, and when he prostrated he said: 'Allahummaj'al fi qalbi nuran waj'al fi sami' nuran waj'al fi basri nuran, waj'al min tahti nuran waj'al min fawqi nuran, wa 'an yamii nuran wa 'an yasari nuran waj'al amami nuran, waj'al khalfi nuran wa a'zimli nura (O Allah, place light in my heart, and place light in my hearing, and place light in my seeing, and place light beneath me, and place light above me, and light on my right, and light on my left, and place light behind me, and make the light greater for me.') Then he slept until he started to snore, then Bilal came and woke him up for the prayer.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20327",
        "20016",
        "11350",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-1506",
      "hadith_no": "1506",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Praying for Rain (Al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "17",
      "text_ar": "أخبرنا إسحاق بن منصور، ومحمد بن المثنى، عن عبد الرحمن، عن سفيان، عن هشام بن إسحاق بن عبد الله بن كنانة، عن أبيه، قال أرسلني فلان إلى ابن عباس أسأله عن صلاة، رسول الله صلى الله عليه وسلم في الاستسقاء فقال خرج رسول الله صلى الله عليه وسلم متضرعا متواضعا متبذلا فلم يخطب نحو خطبتكم هذه فصلى ركعتين ‏.‏",
      "text_en": " It was narrated from Hisham bin Ishaq bin Abdullah bin Kinanah that :                     His father said: \"So and so sent me to ask him how the Messenger of Allah (ﷺ) prayed for rain (Istisqa').\" He said: 'The Messenger of Allah (ﷺ) went out beseeching and humble, (dressed) in a state of humility. He did not give a Khutbah like this Khutbah of yours, and he prayed two rak'ahs.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "30170",
        "20033",
        "20012",
        "20016"
      ]
    },
    {
      "id": "sunan-an-nasai-1521",
      "hadith_no": "1521",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Praying for Rain (Al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "17",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا وكيع، قال حدثنا سفيان، عن هشام بن إسحاق بن عبد الله بن كنانة، عن أبيه، قال أرسلني أمير من الأمراء إلى ابن عباس أسأله عن الاستسقاء، فقال ابن عباس ما منعه أن يسألني، خرج رسول الله صلى الله عليه وسلم متواضعا متبذلا متخشعا متضرعا فصلى ركعتين كما يصلي في العيدين ولم يخطب خطبتكم هذه ‏.‏",
      "text_en": " It was narrated from Hisham bin Ishaq bin Abdullah bin Kinanah that:                     His father said: \"One of the governors sent me to Ibn Abbas to ask him about the prayer for rain. He said: 'What kept him from asking me? The Messenger of Allah (ﷺ) went out humbly, (dressed) in a state of humility, submissiveness and beseeching, and he prayed two rak'ahs as in the Eid prayer, but he did not deliver a Khutbah like this Khutbah of yours.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20032",
        "20012",
        "20016"
      ]
    },
    {
      "id": "sunan-an-nasai-2044",
      "hadith_no": "2044",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، عن وكيع، عن سفيان، عن سهيل، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لأن يجلس أحدكم على جمرة حتى تحرق ثيابه خير له من أن يجلس على قبر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'If any one of you were to sit on a live coal until it burns his garment, that would be better for him than sitting on a grave.\"",
      "usc_msa_ref": "",
      "chain": [
        "20032",
        "20012",
        "20016",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2056",
      "hadith_no": "2056",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسحاق بن منصور، قال حدثنا عبد الرحمن، عن سفيان، عن أبيه، عن خيثمة، عن البراء، قال ‏{‏ يثبت الله الذين آمنوا بالقول الثابت في الحياة الدنيا وفي الآخرة ‏}‏ قال نزلت في عذاب القبر ‏.‏",
      "text_en": " It was narrated that:                     Al-Bara said about Allah will keep firm those who believe, with the word that stands firm in this world and in the Hereafter \"It was revealed concerning the torment of the grave.",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20033",
        "20012",
        "20016",
        "11332",
        "400"
      ]
    },
    {
      "id": "sunan-an-nasai-2578",
      "hadith_no": "2578",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا هناد بن السري، عن أبي الأحوص، عن سعيد بن مسروق، عن عبد الرحمن بن أبي نعم، عن أبي سعيد الخدري، قال بعث علي وهو باليمن بذهيبة بتربتها إلى رسول الله صلى الله عليه وسلم فقسمها رسول الله صلى الله عليه وسلم بين أربعة نفر الأقرع بن حابس الحنظلي وعيينة بن بدر الفزاري وعلقمة بن علاثة العامري ثم أحد بني كلاب وزيد الطائي ثم أحد بني نبهان فغضبت قريش وقال مرة أخرى صناديد قريش فقالوا تعطي صناديد نجد وتدعنا ‏.‏ قال ‏\"‏ إنما فعلت ذلك لأتألفهم ‏\"‏ ‏.‏ فجاء رجل كث اللحية مشرف الوجنتين غائر العينين ناتئ الجبين محلوق الرأس فقال اتق الله يا محمد ‏.‏ قال ‏\"‏ فمن يطع الله عز وجل إن عصيته أيأمنني على أهل الأرض ولا تأمنوني ‏\"‏ ‏.‏ ثم أدبر الرجل فاستأذن رجل من القوم في قتله يرون أنه خالد بن الوليد فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن من ضئضئ هذا قوما يقرءون القرآن لا يجاوز حناجرهم يقتلون أهل الإسلام ويدعون أهل الأوثان يمرقون من الإسلام كما يمرق السهم من الرمية لئن أدركتهم لأقتلنهم قتل عاد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"When he was in Yemen, Ali sent a piece of gold that was still mixed with sediment to the Messenger of Allah, and the Messenger of Allah distributed it among four people: Al-Aqra' bin Habis Al-Hanzali, 'Uyaynah bin Badr Al-Fazari, 'Alqamah bin 'Ulathah Al- 'Amiri, who was from Banu Kilab and Zaid Al-Ta'I who was from Banu Nabhan. The Quraish\" - he said one time: became angry and said: 'You give to the chiefs of  Najdand that, so as to soften their hearts toward Islam.' Then a man with a thick beard, prominent cheeks, and a shaven head came and said: 'Fear Allah. O Muhammad! He said: 'Who would obey Allah if I disobeyed Him? (Is it fair that) He has entrusted me with all the people of the Earth but you do not trust me?' Then the man went away, and a man from among the people, whom they (the narrators) think was Khalid bin Al-Walid, asked for permission to kill him. The Messenger of Allah said: 'Among the offspring of this man will be some people who will recite the Qur'an but it will not go any further than their throats. They will kill the Muslims but leave the idol worshippers alone, and they will passes through Islam as an arrow passes through the body of the target. If I live to see them. I will kill them all, as the people of 'Ad were killed.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20327",
        "20016",
        "11366",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-3186",
      "hadith_no": "3186",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا أبو بكر بن أبي النضر، قال حدثنا أبو النضر، قال حدثنا عبيد الله الأشجعي، عن سفيان الثوري، عن الركين الفزاري، عن أبيه، عن يسير بن عميلة، عن خريم بن فاتك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أنفق نفقة في سبيل الله كتبت له بسبعمائة ضعف ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Khuraim bin Fatik said:                      \"The Messenger of Allah (ﷺ) said: 'Whoever spends in the cause of Allah, it will be recorded for him seven hundred fold.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30528",
        "20390",
        "20338",
        "20012",
        "20016",
        "4127"
      ]
    },
    {
      "id": "sunan-an-nasai-3320",
      "hadith_no": "3320",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا عبد الله بن محمد بن عبد الرحمن، قال حدثنا سفيان، قال سمعناه من عبد الرحمن، - وهو ابن القاسم - عن أبيه، عن عائشة، قالت جاءت سهلة بنت سهيل إلى رسول الله صلى الله عليه وسلم فقالت إني أرى في وجه أبي حذيفة من دخول سالم على ‏.‏ قال ‏\"‏ فأرضعيه ‏\"‏ ‏.‏ قالت وكيف أرضعه وهو رجل كبير فقال ‏\"‏ ألست أعلم أنه رجل كبير ‏\"‏ ‏.‏ ثم جاءت بعد فقالت والذي بعثك بالحق نبيا ما رأيت في وجه أبي حذيفة بعد شيئا أكره ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"Sahlah bint Suhail came to the Messenger of Allah and said: 'I see (displeasure) in the face of Abu Hudhaifah when Salim enters upon me.' The Messenger of Allah said: 'Breast-feed him.' She said: 'How can I breast-feed him when he is a grown man?' He said: 'Don't I know that he is a grown man?' Then she came after that and said: 'By the One Who sent you with the truth as a Prophet, I have never seen anything I dislike on the face of Abu Hudhaifah after that.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20012",
        "20016",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-4101",
      "hadith_no": "4101",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا عبد الرزاق، قال أنبأنا الثوري، عن أبيه، عن ابن أبي نعم، عن أبي سعيد الخدري، قال بعث علي إلى النبي صلى الله عليه وسلم وهو باليمن بذهيبة في تربتها فقسمها بين الأقرع بن حابس الحنظلي ثم أحد بني مجاشع وبين عيينة بن بدر الفزاري وبين علقمة بن علاثة العامري ثم أحد بني كلاب وبين زيد الخيل الطائي ثم أحد بني نبهان - قال - فغضبت قريش والأنصار وقالوا يعطي صناديد أهل نجد ويدعنا فقال ‏\"‏ إنما أتألفهم ‏\"‏ ‏.‏ فأقبل رجل غائر العينين ناتئ الوجنتين كث اللحية محلوق الرأس فقال يا محمد اتق الله قال ‏\"‏ من يطع الله إذا عصيته أيأمنني على أهل الأرض ولا تأمنوني ‏\"‏ ‏.‏ فسأل رجل من القوم قتله فمنعه فلما ولى قال ‏\"‏ إن من ضئضئ هذا قوما يخرجون يقرءون القرآن لا يجاوز حناجرهم يمرقون من الدين مروق السهم من الرمية يقتلون أهل الإسلام ويدعون أهل الأوثان لئن أنا أدركتهم لأقتلنهم قتل عاد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"When 'Ali was in Yemen, he sent some gold that was still enclosed in rock to the Prophet [SAW], who distributed it among Al-Aqra' bin Habis Al-Hanzali, who belonged to Banu Mujashi', 'Uyaynah bin Badr Al-Fazari, 'Alqamah bin 'Ulathah Al-'Amiri, who belonged to Banu Kilab and Zaid Al-Khail At-Ta'I, who belonged to Banu Nabhan. The Quraish and the Ansar became angry and said: 'He gives to the chiefs of Najd and ignores us!' He said: 'I am seeking to win them over (firmly to Islam).' Then a man with sunken eyes, a bulging forehead, a thick beard and a shaven head came and said: 'O Muhammad, fear Allah!' He said: 'Who will obey Allah if I do not? He trusts me with the people of this Earth but you do not trust me.' A man among the people asked for permission to kill him, but he did not let him do that. When (the man) went away, he (the Prophet [SAW]) said: 'Among the offspring of this man there will be people who will recite the Qur'an but it will not go beyond their throats, and they will go out of Islam as an arrow goes through the target. They will kill the Muslims and leave the idol-worshippers alone. If I live to see them, I will kill them as the killing of 'Ad.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20121",
        "20012",
        "20016",
        "11366",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-4270",
      "hadith_no": "4270",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا أحمد بن عبد الله بن الحكم، قال حدثنا محمد، - وهو ابن جعفر - قال حدثنا شعبة، عن سعيد بن مسروق، قال حدثنا الشعبي، عن عدي بن حاتم، - وكان لنا جارا ودخيلا وربيطا بالنهرين - أنه سأل النبي صلى الله عليه وسلم قال أرسل كلبي فأجد مع كلبي كلبا قد أخذ لا أدري أيهما أخذ قال ‏\"‏ لا تأكل فإنما سميت على كلبك ولم تسم على غيره ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ash-Sha bi that;\"Adiyy bin Hatim who was neighbor, Dakhilan and Rabitan at An-Nahrain narrated that he asked the Prophet Saying:                      'I releaser my dog and I find another dog with my dog, and I do not know which of them caught (the game).' He said: 'Do not eat, for your only said the name of Allah over your dog, and not over any other dog.\"\"",
      "usc_msa_ref": "",
      "chain": [
        "20173",
        "20020",
        "20016",
        "11052",
        "212"
      ]
    },
    {
      "id": "sunan-an-nasai-4273",
      "hadith_no": "4273",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا أبو داود، عن شعبة، عن ابن أبي السفر، عن الشعبي، وعن الحكم، عن الشعبي، وعن سعيد بن مسروق، عن الشعبي، عن عدي بن حاتم، قال سألت رسول الله صلى الله عليه وسلم قلت أرسل كلبي فأجد مع كلبي كلبا آخر لا أدري أيهما أخذ قال ‏\"‏ لا تأكل فإنما سميت على كلبك ولم تسم على غيره ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Adiyy bin Hatim said:                     \"I asked the Messenger of Allah: 'I release my dog, and I find another dog with mine, and I do not know which mine, and I do not know which of them caught (the game).' He said: 'do not eat it, for you said the name of Allah over your dog, but not over any other.\"\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20547",
        "20020",
        "11636",
        "11052",
        "11069",
        "11052",
        "20016",
        "11052",
        "212"
      ]
    },
    {
      "id": "sunan-an-nasai-4297",
      "hadith_no": "4297",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا حسين بن علي، عن زائدة، عن سعيد بن مسروق، عن عباية بن رفاعة بن رافع، عن رافع بن خديج، قال بينما نحن مع رسول الله صلى الله عليه وسلم في ذي الحليفة من تهامة فأصابوا إبلا وغنما ورسول الله صلى الله عليه وسلم في أخريات القوم فعجل أولهم فذبحوا ونصبوا القدور فدفع إليهم رسول الله صلى الله عليه وسلم فأمر بالقدور فأكفئت ثم قسم بينهم فعدل عشرا من الشاء ببعير فبينما هم كذلك إذ ند بعير وليس في القوم إلا خيل يسيرة فطلبوه فأعياهم فرماه رجل بسهم فحبسه الله فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن لهذه البهائم أوابد كأوابد الوحش فما غلبكم منها فاصنعوا به هكذا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi bin Khadij said:                     \"While we were with the Messenger of Allah at Dhul-Hulaifah in Tihamanb, they acquired some camels and sheep (as spoils of war). The Messenger of Allah was among the last of the people, and the first of them hastened to slaughter (the animals) and set up pots (For cooking the meat). The Messenger of Allah came and ordered that the pots be came and ordered that the pots be overturned, then he divided it making ten sheep equivalent to one camel. While they were like that, a camel ran away. The people had only a few horses, so they went after fit and it and it got away from them. A man shot an arrow at it and stopped it. The Messenger of Allah said: 'Some of these animals arte untamed like wild animals, so if one of them goes out of your control, do the same.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20315",
        "20320",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sunan-an-nasai-4391",
      "hadith_no": "4391",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا أحمد بن عبد الله بن الحكم، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، قال حدثنا سفيان الثوري، عن أبيه، عن عباية بن رفاعة بن رافع، عن جده، رافع بن خديج قال كان رسول الله صلى الله عليه وسلم يجعل في قسم الغنائم عشرا من الشاء ببعير ‏.‏ قال شعبة وأكبر علمي أني سمعته من سعيد بن مسروق وحدثني به سفيان عنه والله تعالى أعلم ‏.‏",
      "text_en": " It was narrated that Rafi bin Khadij Said:                     \"When distributing the spoils of war, the Messenger of Allah used to make ten sheep equivalent to one camel.\" Shu'bah said: \"I know most if it from what I heard form Sa'eed bin Masruq, and Sufyan narrated it to me.\" (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "20173",
        "20020",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sunan-an-nasai-4404",
      "hadith_no": "4404",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا هناد بن السري، عن أبي الأحوص، عن سعيد بن مسروق، عن عباية بن رفاعة، عن أبيه، عن جده، رافع بن خديج قال قلت يا رسول الله إنا نلقى العدو غدا وليس معنا مدى ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما أنهر الدم وذكر اسم الله عز وجل فكلوا ما لم يكن سنا أو ظفرا وسأحدثكم عن ذلك أما السن فعظم وأما الظفر فمدى الحبشة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi bin Khadij said:                     \"I said: 'O Messenger of Allah we are going to meet the enemy tomorrow and we do not have any knives.' The Messenger of Allah said: \"If the blood is shed and the name of Allah is mentioned, then eat, unless (it is slaughtered (with teeth or nails, and I will tell you about that. As for teeth, they are bones, and as for nails, they are the knives of the Ethiopians.\"' (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20327",
        "20016",
        "11179",
        "11506",
        "1986"
      ]
    },
    {
      "id": "sunan-an-nasai-4409",
      "hadith_no": "4409",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، عن شعبة، عن سعيد بن مسروق، عن عباية بن رافع، عن رافع، قال قلت يا رسول الله إنا لاقو العدو غدا وليس معنا مدى ‏.‏ قال ‏\"‏ ما أنهر الدم وذكر اسم الله عز وجل فكل ما خلا السن والظفر ‏\"‏ ‏.‏ قال فأصاب رسول الله صلى الله عليه وسلم نهبا فند بعير فرماه رجل بسهم فحبسه فقال ‏\"‏ إن لهذه النعم - أو قال الإبل - أوابد كأوابد الوحش فما غلبكم منها فافعلوا به هكذا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi said:                     \"I said: 'O Messenger of Allah, we are going to meet the enemy tomorrow, and we do not have any knives.' He said: 'If the blood is shed and the name of Allah is mentioned, then eat, unlike (it is slaughtered) with teeth or nails.\" Then the Messenger of Allah got some spoils of war and a camel ran away. A man shot and arrow at it and stopped it. He (the Prophet) said; 'Some of these animals - or 'these camels'- 'are untamed like wild animals, so if one of them goes out of your control, do the same.\"' (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "34033",
        "20423",
        "20020",
        "20016"
      ]
    },
    {
      "id": "sunan-an-nasai-4410",
      "hadith_no": "4410",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا عمرو بن علي، قال أنبأنا يحيى بن سعيد، قال حدثنا سفيان، قال حدثني أبي، عن عباية بن رفاعة، عن رافع بن خديج، قال قلت يا رسول الله إنا لاقو العدو غدا وليست معنا مدى ‏.‏ قال ‏\"‏ ما أنهر الدم وذكر اسم الله عز وجل فكل ليس السن والظفر وسأحدثكم أما السن فعظم وأما الظفر فمدى الحبشة ‏\"‏ ‏.‏ وأصبنا نهبة إبل أو غنم فند منها بعير فرماه رجل بسهم فحبسه فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن لهذه الإبل أوابد كأوابد الوحش فإذا غلبكم منها شىء فافعلوا به هكذا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi bin Khadij said:                     \"I said: 'O Messenger of Allah, we are going to meet the enemy tomorrow, and we do not have any knives.' He said: If the blood is shed and the name of Allah is mentioned, then eat, unlike (it is slaughtered) with teeth or nails and I will tell you about that. As for teeth, they are bones, and as for nails, they are the knives of the Ethiopians,; We acquired some spoils of war including sheep or camels, and a camel ran away, so a man shot an arrow at it an stopped it. The Messenger of Allah said: 'some of these animals' or 'these camels'- 'are untamed like wild animals, so if one of them goes out of your control, do the same.\" (Sahih )",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sunan-an-nasai-4437",
      "hadith_no": "4437",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، قال حدثنا سفيان، قال حدثني هارون بن أبي وكيع، - وهو هارون بن عنترة - عن أبيه، عن ابن عباس، في قوله عز وجل ‏{‏ ولا تأكلوا مما لم يذكر اسم الله عليه ‏}‏ قال خاصمهم المشركون فقالوا ما ذبح الله فلا تأكلوه وما ذبحتم أنتم أكلتموه ‏.‏",
      "text_en": " Harun bin Abi Walki-who is Harun bin 'Antarah -narrated from his father, form Ibn 'Abbas, concerning the saying of Allah, the Mighty and Sublime:                     \"Eat not of that on which Allah's name has not been pronounced\" - that he said: \"The idolaters argued with them and said:  'Whatever Allah kills you do not eat, and whatever you kill you eat!\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20012",
        "20016"
      ]
    },
    {
      "id": "sunan-an-nasai-4685",
      "hadith_no": "4685",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا عبد الرزاق، قال حدثنا الثوري، عن أبيه، عن الشعبي، عن سمعان، عن سمرة، قال كنا مع النبي صلى الله عليه وسلم في جنازة فقال ‏\"‏ أها هنا من بني فلان أحد ‏\"‏ ‏.‏ ثلاثا فقام رجل فقال له النبي صلى الله عليه وسلم ‏\"‏ ما منعك في المرتين الأوليين أن لا تكون أجبتني أما إني لم أنوه بك إلا بخير إن فلانا - لرجل منهم - مات مأسورا بدينه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that samurah said:                     \"We were with the Prophet at a funeral, and he said: 'I there anyone from banu so and so here? He said this three times. Then a man stood up, and he said to him: 'What kept you form answering the first two times? I am not going to say anything but good to you, so and so (mentioning the name of a man from among them) has died and he is being detained (from entering Paradise) because of his debt.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20121",
        "20012",
        "20016",
        "11052",
        "394"
      ]
    },
    {
      "id": "sunan-ibn-majah-596",
      "hadith_no": "596",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا سفيان، عن أبيه، عن إبراهيم التيمي، عن عمرو بن ميمون، عن خزيمة بن ثابت، قال جعل رسول الله  صلى الله عليه وسلم  للمسافر ثلاثا ولو مضى السائل على مسألته لجعلها خمسا ‏.‏",
      "text_en": " It was narrated that Khuzaimah bin Thabit said:                     \"The Messenger of Allah set a time limit for the traveler of three days, and if the questioner had persisted in asking, he would have made it five (days).\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20012",
        "20016",
        "11322",
        "11382",
        "410"
      ]
    },
    {
      "id": "sunan-ibn-majah-1216",
      "hadith_no": "1216",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، حدثنا سفيان، وأبي، وإسرائيل، عن أبي إسحاق، عن عاصم بن ضمرة السلولي، قال سألنا عليا عن تطوع، رسول الله  صلى الله عليه وسلم  بالنهار فقال إنكم لا تطيقونه فقلنا أخبرنا به نأخذ منه ما استطعنا ‏.‏ قال كان رسول الله  صلى الله عليه وسلم  إذا صلى الفجر يمهل حتى إذا كانت الشمس من هاهنا - يعني من قبل المشرق - بمقدارها من صلاة العصر من ها هنا - يعني من قبل المغرب - قام فصلى ركعتين ثم يمهل حتى إذا كانت الشمس من ها هنا - يعني من قبل المشرق - مقدارها من صلاة الظهر من ها هنا قام فصلى أربعا وأربعا قبل الظهر إذا زالت الشمس وركعتين بعدها وأربعا قبل العصر يفصل بين كل ركعتين بالتسليم على الملائكة المقربين والنبيين ومن تبعهم من المسلمين والمؤمنين ‏.‏ قال علي فتلك ست عشرة ركعة تطوع رسول الله  صلى الله عليه وسلم  بالنهار وقل من يداوم عليها ‏.‏ قال وكيع زاد فيه أبي فقال حبيب بن أبي ثابت يا أبا إسحاق ما أحب أن لي بحديثك هذا ملء مسجدك هذا ذهبا ‏.‏",
      "text_en": " It wasnarrated that ‘Asim bin Damrah As-Saluli said:                      “We asked ‘Aliabout the voluntary (prayer) of Allah’s Messenger (ﷺ) during theday. He said: ‘You will not be able.’ We said: ‘Inform us ofit, we will do what we can of it?’ So he said: ‘When he prayedthe Fajr he would delay praying any more. When the sun appeared overthere (west) – like it appears here, meaning in the direction ofthe east, about the amount for the ‘Asr prayer from there, meaningin the direction of the west, meaning before the Maghrib – he wouldstand and perform two Rak’ah* then he would delay praying until thesun appeared over there (west), meaning in the direction of the east,about the amount of the Zuhr prayer from there, then he would standand perform four. And, four before the Zuhr when the sun passed thezenith, and two Rak’ah after it, and, four before the ‘Asr,separating between every two Rak’ah with Taslim** upon the angelsthat are close (to Allah), the Prophets, and those who follow themamong the Muslims and the believers.’”'Ali said: \"That is sixteen Rak'ah of voluntary prayer which Allah's Messenger (ﷺ) performed during the day. And there are very few who offer them regularly.\"",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20012",
        "20016",
        "20311",
        "11049",
        "19871",
        "5"
      ]
    },
    {
      "id": "sunan-ibn-majah-1324",
      "hadith_no": "1324",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، ومحمد بن إسماعيل، قالا حدثنا وكيع، عن سفيان، عن هشام بن إسحاق بن عبد الله بن كنانة، عن أبيه، قال أرسلني أمير من الأمراء إلى ابن عباس أسأله عن الصلاة، في الاستسقاء فقال ابن عباس ما منعه أن يسألني، قال خرج رسول الله  صلى الله عليه وسلم  متواضعا متبذلا متخشعا مترسلا متضرعا فصلى ركعتين كما يصلي في العيد ولم يخطب خطبتكم هذه ‏.‏",
      "text_en": " It wasnarrated from Hisham bin Ishaq bin ‘Absullah bin Kinanah thathisfather said:                      “One of the chiefs* sent me to Ibn ‘Abbas to ask himabout the prayer for rain. Ibn ‘Abbas said: ‘What kept him fromaskingme?’ He said: ‘The Messenger of Allah (ﷺ) went outhumbly, walkingwith a humble and moderate gait, imploring, and heperformed twoRak’ah as he used to pray for ‘Eid, but he did notgive a sermon likethis sermon of yours.’”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "34188",
        "20032",
        "20012",
        "20016"
      ]
    },
    {
      "id": "sunan-ibn-majah-3124",
      "hadith_no": "3124",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن محمد، حدثنا يحيى بن آدم، عن سفيان، عن عبد الرحمن بن عياش، عن زيد بن علي، عن أبيه، عن عبيد الله بن أبي رافع، عن علي، قال وقف رسول الله  صلى الله عليه وسلم  بعرفة فقال ‏\"‏ هذا الموقف وعرفة كلها موقف ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Ali said:                      “The Messenger of Allah (ﷺ) stoppedat‘Arafat and said: ‘This is the place of standing, and all of‘Arafat is a place of standing.’”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20364",
        "20012",
        "20016",
        "11199",
        "5"
      ]
    },
    {
      "id": "sunan-ibn-majah-3257",
      "hadith_no": "3257",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا أبو كريب، حدثنا المحاربي، وعبد الرحيم، عن سفيان الثوري، عن سعيد بن مسروق، وحدثنا الحسين بن علي، عن زائدة، عن سعيد بن مسروق، عن عباية بن رفاعة، عن رافع بن خديج، قال كنا مع رسول الله  صلى الله عليه وسلم  ونحن بذي الحليفة من تهامة فأصبنا إبلا وغنما فعجل القوم فأغلينا القدور قبل أن تقسم فأتانا رسول الله  صلى الله عليه وسلم  فأمر بها فأكفئت ثم عدل الجزور بعشرة من الغنم ‏.‏",
      "text_en": " It wasnarrated that Rafi’ bin Khadij said:                      “We were with theMessengerof Allah (ﷺ) in Dhul-Hulaifah in (the land of) Tihamah. Weacquiredsheep and camels and the people hastened to put cooking potson thefires before they had been distributed. The Messenger of Allah(ﷺ)came to us and ordered that they be overturned,* then he madeonecamel equivalent to ten sheep.”",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20333",
        "20334",
        "20012",
        "20016",
        "20315",
        "20320",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sunan-ibn-majah-3299",
      "hadith_no": "3299",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا عمر بن عبيد الطنافسي، عن سعيد بن مسروق، عن عباية بن رفاعة، عن جده، رافع بن خديج قال كنا مع رسول الله  صلى الله عليه وسلم  في سفر فقلت يا رسول الله إنا نكون في المغازي فلا يكون معنا مدى فقال ‏\"‏ ما أنهر الدم وذكر اسم الله عليه فكل غير السن والظفر فإن السن عظم والظفر مدى الحبشة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Rafi’ bin Khadij said:                      “We were with the Prophet(ﷺ) on a journey, and I said: ‘O Messenger of Allah, we are(sometimes) on military campaigns, and we have no knife with us.’Hesaid: ‘(Use) whatever causes the blood to flow, mention the NameofAllah and eat, but (do not use) teeth or nails, for the tooth is abone and the nail is the knife of the Ethiopians.”",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20346",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sunan-ibn-majah-3304",
      "hadith_no": "3304",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا عمر بن عبيد، عن سعيد بن مسروق، عن عباية بن رفاعة، عن جده، رافع بن خديج قال كنا مع النبي  صلى الله عليه وسلم  في سفر فند بعير فرماه رجل بسهم فقال النبي  صلى الله عليه وسلم  ‏\"‏ إن لها أوابد - أحسبه قال - كأوابد الوحش فما غلبكم منها فاصنعوا به هكذا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Rafi’ bin Khadij said:                      “We were with the Prophet(ﷺ) on a journey, and a camel ran away. A man shot an arrow at itand the Prophet (ﷺ) said: ‘It has the inclination to run awaylike awild animal. If this happens to any of you, do likewise.’”",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sunan-ibn-majah-3602",
      "hadith_no": "3602",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا مصعب بن المقدام، حدثنا إسرائيل، عن سعيد بن مسروق، عن عباية بن رفاعة، عن رافع بن خديج، قال سمعت النبي  صلى الله عليه وسلم  يقول ‏\"‏ الحمى من فيح جهنم فابردوها بالماء ‏\"‏ ‏.‏ فدخل على ابن لعمار فقال ‏\"‏ اكشف الباس رب الناس إله الناس ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Rafi’ bin Khadij said:                      “I heard the Prophet(ﷺ)say: ‘Fever is from the heat of the Hell-fire, so cool it downwithwater.’ He entered upon a son of ‘Ammar and said: ‘Take awaytheharm, O Lord of mankind, O God of mankind.’”",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20608",
        "20311",
        "20016",
        "11179",
        "1986"
      ]
    }
  ],
  "total_hadiths": 74
}