{
  "id": "20017",
  "name": "'Imran bin 'Uyaynah عمران بن عيينة",
  "full_name": "'Imran bin 'Uyaynah عمران بن عيينة",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Kufa"
    },
    "death": {
      "date_hijri": "199",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Kufa",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ 4  -  صدوق له أوهام ]"
    ],
    "tags": [
      "al-Hilali",
      "Client",
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20018",
      "name": "Ibrahim bin 'Uyaynah إبراهيم بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20019",
      "name": "Muhammad bin 'Uyaynah محمد بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11068",
      "name": "Ata'a bin al-Sa'ib al-Thaqifi عطاء بن السائب الثقفي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "15097",
      "name": "Husayn bin 'Abdur Rahman al-Salmi حصين بن عبد الرحمن السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10957",
      "name": "al-Lyth bin Abi Sulaym الليث بن أبي سليم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10844",
      "name": "Yazid bin Abi Ziyad يزيد بن أبي زياد",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "2819",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا عمران بن عيينة، عن عطاء بن السائب، عن سعيد بن جبير، عن ابن عباس، قال جاءت اليهود إلى النبي صلى الله عليه وسلم فقالوا نأكل مما قتلنا ولا نأكل مما قتل الله فأنزل الله ‏{‏ ولا تأكلوا مما لم يذكر اسم الله عليه ‏}‏ إلى آخر الآية ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Jews came to the Prophet (ﷺ) and said: We eat which we kill but we do not eat which Allah kills? So Allah revealed: \"Eat not of (meats) on which Allah's name hath not been pronounced.\" to the end of the verse.",
      "chain": [
        "30203",
        "20017",
        "11068",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1547",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Vows and Oaths - كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن عبد الأعلى حدثنا عمران بن عيينة هو أخو سفيان بن عيينة عن حصين عن سالم بن أبي الجعد عن أبي أمامة وغيره من أصحاب النبي صلى الله عليه وسلم  عن النبي صلى الله عليه وسلم قال أيما امرئ مسلم أعتق امرأ مسلما كان فكاكه من النار يجزي كل عضو منه عضوا منه وأيما امرئ مسلم أعتق امرأتين مسلمتين كانتا فكاكه من النار يجزي كل عضو منهما عضوا منه وأيما امرأة مسلمة أعتقت امرأة مسلمة كانت فكاكها من النار يجزي كل عضو منها عضوا منها  قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه قال أبو عيسى وفي الحديث ما يدل على أن عتق الذكور للرجال أفضل من عتق الإناث لقول رسول الله صلى الله عليه وسلم من أعتق امرأ مسلما كان فكاكه من النار يجزي كل عضو منه عضوا منه",
      "text_en": " Abu Umamah, and other than him from the Companions of the Prophet (ﷺ), narrated that the Prophet (ﷺ) said:                      \"Any Muslim man who frees a Muslim man, then it is his salvation from the Fire - each of his limbs suffices for a limb of himself. And any Muslim man that frees two Muslim women, then are his salvation from the Fire - each of their limbs suffices for a limb of himself. And any Muslim woman that frees a Muslim woman, then she is her salvation from the Fire - each of her limb suffices for a limb of herself.\"",
      "chain": [
        "30449",
        "20017",
        "15097",
        "11342"
      ]
    },
    {
      "hadith_no": "3670",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا عمران بن عيينة، قال حدثنا عطاء بن السائب، عن سعيد بن جبير، عن ابن عباس، في قوله ‏{‏إن الذين يأكلون أموال اليتامى ظلما‏}‏ قال كان يكون في حجر الرجل اليتيم فيعزل له طعامه وشرابه وآنيته فشق ذلك على المسلمين فأنزل الله عز وجل ‏{‏وإن تخالطوهم فإخوانكم‏}‏ ‏{‏في الدين‏}‏ فأحل لهم خلطتهم‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said -concerning the Verse:                      \"Verily, those who unjustly eat up the property of orphans\" -A man would have an orphan in his care, and he would keep his food, drink and vessels separate. This caused hardship to the Muslims, so Allah, the Mighty and Sublime, revealed: \"And they ask you concerning orphans. Say: The best thing is to work honestly in their property, and if you mix your affairs with theirs, then they are your brothers\" (in religion), so it is permissible for you to mix with them.",
      "chain": [
        "30153",
        "20017",
        "11068",
        "11050"
      ]
    },
    {
      "hadith_no": "3005",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن طريف، حدثنا عمران بن عيينة، عن عطاء بن السائب، عن مجاهد، عن ابن عمر، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ الغازي في سبيل الله والحاج والمعتمر وفد الله دعاهم فأجابوه وسألوه فأعطاهم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Umar that the Prophet (ﷺ) said:                      “The onewhofights in the cause of Allah, and the pilgrim performing Hajj and‘Umrah are a delegation to Allah. He invited them, so theyrespondedto Him, and they ask Him and He gives to them.”",
      "chain": [
        "30476",
        "20017",
        "11068",
        "11028",
        "18"
      ]
    }
  ],
  "total_hadiths": 4
}