{
  "id": "20029",
  "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
  "full_name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "125",
      "date_gregorian": "NA",
      "date_display": [
        "125 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "197",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة حافظ ]",
      "Fiqh"
    ],
    "tags": [
      "Quraish",
      "Ally B.Fihr",
      "Client",
      "al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20377",
      "name": "'Amr bin al-Harith bin Ya'qub عمرو بن الحارث",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10856",
      "name": "Hameed bin Han'i Abu حميد بن هانئ أبو هانئ",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20374",
      "name": "Bakr bin Madr bin Muhammad بكر بن مضر بن محمد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "26010",
      "name": "Haywat bin Sharih bin Safwan حيوة بن شريح بن صفوان التجيبي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20375",
      "name": "Sa'id bin Abi Ayoub سعيد بن أبي أيوب الخزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20624",
      "name": "'Abdullah bin lahya'a bin 'Uqba عبد الله بن لهيعة بن عقبة الحضرمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20514",
      "name": "'Ayyad bin 'Abdullah عياض بن عبد الله بن عبد الرحمن",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20438",
      "name": "'Abdur Rahman bin Sharih عبد الرحمن بن شريح أبو شريح المعافري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20475",
      "name": "Yonus bin Yazid bin Abi al-Nijad يونس بن يزيد بن أبي النجاد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "12154",
      "name": "Salmah bin Wrdan al-Lythy سلمة بن وردان الليثي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20503",
      "name": "Sa'id bin 'Abdur Rahman bin 'Abdullah سعيد بن عبد الرحمن بن عبد الله بن حميل",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11530",
      "name": "'Umar bin Muhammad bin Zayd عمر بن محمد بن زيد بن عبد الله",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20675",
      "name": "Mu'awiya bin Salah bin Hadayr معاوية بن صالح بن حدير",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20519",
      "name": "Hisham bin Sa'd al-Madni هشام بن سعد المدني أبو عباد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20192",
      "name": "Da'ud bin 'Abdur Rahman al-'Atar داود بن عبد الرحمن العطار",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20421",
      "name": "Hafs bin Mysrh al-Qyly حفص بن ميسرة العقيلي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30484",
      "name": "Ahmed bin 'Abdur Rahman أحمد بن عبد الرحمن بن وهب",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30355",
      "name": "'Abdullah bin Yusuf al-Tunaysi عبد الله بن يوسف التنيسي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30226",
      "name": "Ahmed bin Salah al-Masri أحمد بن صالح المصري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30399",
      "name": "Yahya bin Yahya bin Bukayr يحيى بن يحيى بن بكير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30232",
      "name": "Sa'id bin Abi Maryam سعيد بن أبي مريم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30399",
      "name": "Yahya bin Yahya bin Bukayr يحيى بن يحيى بن بكير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30308",
      "name": "Ibrahim bin al-Mandhir bin 'Abdullah إبراهيم بن المنذر بن عبد الله",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30228",
      "name": "Asbgh bin al-Frj bin Sa'id أصبغ بن الفرج بن سعيد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30485",
      "name": "Ahmed bin 'Amr bin al-Sarh أحمد بن عمرو بن السرح أبو الطاهر",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30487",
      "name": "Hrmlh bin Yahya bin حرملة بن يحيى",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30412",
      "name": "'Isa bin Hammad bin Muslim, Zaghba عيسى بن حماد بن مسلم أبو موسى زغبة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30280",
      "name": "Harun bin al-Ma'ruf هارون بن معروف المروزي الخزاز الضرير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30526",
      "name": "Yahya bin Ayoub al-Maqabri يحيى بن أيوب المقابري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20672",
      "name": "Muhammad bin Salmah محمد بن سلمة بن عبد الله الباهلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "36014",
      "name": "Bhr bin Nsr bin Sabq بحر بن نصر بن سابق",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36056",
      "name": "Muhammad bin 'Abdullah bin 'Abdul Hakam محمد بن عبد الله بن عبد الحكم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30493",
      "name": "Yonus bin 'Abdul A'la al-Sadfi يونس بن عبد الأعلى بن ميسرة الصدفي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30583",
      "name": "al-Rabi' bin Sulaiman الربيع بن سليمان",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "71",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثنا ابن وهب، عن يونس، عن ابن شهاب، قال قال حميد بن عبد الرحمن سمعت معاوية، خطيبا يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ من يرد الله به خيرا يفقهه في الدين، وإنما أنا قاسم والله يعطي، ولن تزال هذه الأمة قائمة على أمر الله لا يضرهم من خالفهم حتى يأتي أمر الله ‏\"‏‏.‏",
      "text_en": " Narrated Muawiya:                     I heard Allah's Apostle saying, \"If Allah wants to do good to a person, He makes him comprehend the religion. I am just a distributor, but the grant is from Allah. (And remember) that this nation (true Muslims) will keep on following Allah's teachings strictly and they will not be harmed by any one going on a different path till Allah's order (Day of Judgment) is established.\"",
      "chain": [
        "30233",
        "20029",
        "20475",
        "11013",
        "10561",
        "27"
      ]
    },
    {
      "hadith_no": "89",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، ح قال أبو عبد الله وقال ابن وهب أخبرنا يونس، عن ابن شهاب، عن عبيد الله بن عبد الله بن أبي ثور، عن عبد الله بن عباس، عن عمر، قال كنت أنا وجار، لي من الأنصار في بني أمية بن زيد، وهى من عوالي المدينة، وكنا نتناوب النزول على رسول الله صلى الله عليه وسلم ينزل يوما وأنزل يوما، فإذا نزلت جئته بخبر ذلك اليوم من الوحى وغيره، وإذا نزل فعل مثل ذلك، فنزل صاحبي الأنصاري يوم نوبته، فضرب بابي ضربا شديدا‏.‏ فقال أثم هو ففزعت فخرجت إليه فقال قد حدث أمر عظيم‏.‏ قال فدخلت على حفصة فإذا هي تبكي فقلت طلقكن رسول الله صلى الله عليه وسلم قالت لا أدري‏.‏ ثم دخلت على النبي صلى الله عليه وسلم فقلت وأنا قائم أطلقت نساءك قال ‏\"‏ لا ‏\"‏‏.‏ فقلت الله أكبر‏.‏",
      "text_en": " Narrated `Umar:                     My Ansari neighbor from Bani Umaiya bin Zaid who used to live at `Awali Al-Medina and used to visit the Prophet by turns. He used to go one day and I another day. When I went I used to bring the news of that day regarding the Divine Inspiration and other things, and when he went, he used to do the same for me. Once my Ansari friend, in his turn (on returning from the Prophet), knocked violently at my door and asked if I was there.\" I became horrified and came out to him. He said, \"Today a great thing has happened.\" I then went to Hafsa and saw her weeping. I asked her, \"Did Allah's Apostle divorce you all?\" She replied, \"I do not know.\" Then, I entered upon the Prophet and said while standing, \"Have you divorced your wives?\" The Prophet replied in the negative. On what I said, \"Allahu-Akbar (Allah is Greater).\" (See Hadith No. 119, Vol. 3 for details)",
      "chain": [
        "30330",
        "20428",
        "11013",
        "30184",
        "20029",
        "20475",
        "11013",
        "11200",
        "17",
        "3"
      ]
    },
    {
      "hadith_no": "114",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن عبيد الله بن عبد الله، عن ابن عباس، قال لما اشتد بالنبي صلى الله عليه وسلم وجعه قال ‏\"‏ ائتوني بكتاب أكتب لكم كتابا لا تضلوا بعده ‏\"‏‏.‏ قال عمر إن النبي صلى الله عليه وسلم غلبه الوجع وعندنا كتاب الله حسبنا فاختلفوا وكثر اللغط‏.‏ قال ‏\"‏ قوموا عني، ولا ينبغي عندي التنازع ‏\"‏‏.‏ فخرج ابن عباس يقول إن الرزية كل الرزية ما حال بين رسول الله صلى الله عليه وسلم وبين كتابه‏.‏",
      "text_en": " Narrated 'Ubaidullah bin `Abdullah:                     Ibn `Abbas said, \"When the ailment of the Prophet became worse, he said, 'Bring for me (writing) paper and I will write for you a statement after which you will not go astray.' But `Umar said, 'The Prophet is seriously ill, and we have got Allah's Book with us and that is sufficient for us.' But the companions of the Prophet differed about this and there was a hue and cry. On that the Prophet said to them, 'Go away (and leave me alone). It is not right that you should quarrel in front of me.\" Ibn `Abbas came out saying, \"It was most unfortunate (a great disaster) that Allah's Apostle was prevented from writing that statement for them because of their disagreement and noise. (Note: It is apparent from this Hadith that Ibn `Abbas had witnessed the event and came out saying this statement. The truth is not so, for Ibn `Abbas used to say this statement on narrating the Hadith and he had not witnessed the event personally. See Fath Al-Bari Vol. 1, p.220 footnote.) (See Hadith No. 228, Vol. 4).",
      "chain": [
        "30220",
        "20029",
        "20475",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "202",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أصبغ بن الفرج المصري، عن ابن وهب، قال حدثني عمرو، حدثني أبو النضر، عن أبي سلمة بن عبد الرحمن، عن عبد الله بن عمر، عن سعد بن أبي وقاص، عن النبي صلى الله عليه وسلم أنه مسح على الخفين‏.‏ وأن عبد الله بن عمر سأل عمر عن ذلك فقال نعم إذا حدثك شيئا سعد عن النبي صلى الله عليه وسلم فلا تسأل عنه غيره‏.‏ وقال موسى بن عقبة أخبرني أبو النضر أن أبا سلمة أخبره أن سعدا حدثه فقال عمر لعبد الله‏.‏ نحوه‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Sa`d bin Abi Waqqas said, \"The Prophet passed wet hands over his Khuffs (socks made from thick fabric or leather).\" `Abdullah bin `Umar asked `Umar about it. `Umar replied in the affirmative and added, \"Whenever Sa`d narrates a Hadith from the Prophet, there is no need to ask anyone else about it.\"",
      "chain": [
        "30228",
        "20029",
        "20377",
        "20390",
        "10567",
        "18",
        "9"
      ]
    },
    {
      "hadith_no": "210",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "وحدثنا أصبغ، قال أخبرنا ابن وهب، قال أخبرني عمرو، عن بكير، عن كريب، عن ميمونة، أن النبي صلى الله عليه وسلم أكل عندها كتفا، ثم صلى ولم يتوضأ‏.‏",
      "text_en": " Narrated Maimuna:                     The Prophet ate (a piece of) mutton from the shoulder region and then prayed without repeating the ablution.",
      "chain": [
        "30228",
        "20029",
        "20377",
        "11154",
        "11211",
        "61"
      ]
    },
    {
      "hadith_no": "308",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا أصبغ، قال أخبرني ابن وهب، قال أخبرني عمرو بن الحارث، عن عبد الرحمن بن القاسم، حدثه عن أبيه، عن عائشة، قالت كانت إحدانا تحيض، ثم تقترص الدم من ثوبها عند طهرها فتغسله، وتنضح على سائره، ثم تصلي فيه‏.‏",
      "text_en": " Narrated `Aisha:                     Whenever anyone of us got her menses, she, on becoming clean, used to take hold of the blood spot and rub the blood off her garment, and pour water over it and wash that portion thoroughly and sprinkle water over the rest of the garment. After that she would pray in (with) it.",
      "chain": [
        "30228",
        "20029",
        "20377",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "450",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا يحيى بن سليمان، حدثني ابن وهب، أخبرني عمرو، أن بكيرا، حدثه أن عاصم بن عمر بن قتادة حدثه أنه، سمع عبيد الله الخولاني، أنه سمع عثمان بن عفان، يقول عند قول الناس فيه حين بنى مسجد الرسول صلى الله عليه وسلم إنكم أكثرتم، وإني سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ من بنى مسجدا  قال بكير حسبت أنه قال  يبتغي به وجه الله، بنى الله له مثله في الجنة ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubaidullah Al-Khaulani:                     I heard `Uthman bin `Affan saying, when people argued too much about his intention to reconstruct the mosque of Allah's Apostle, \"You have talked too much. I heard the Prophet saying, 'Whoever built a mosque, (Bukair thought that `Asim, another sub-narrator, added, \"Intending Allah's Pleasure\"), Allah would build for him a similar place in Paradise.' \"",
      "chain": [
        "30220",
        "20029",
        "20377",
        "11154",
        "11103",
        "11706",
        "4"
      ]
    },
    {
      "hadith_no": "471",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد، قال حدثنا ابن وهب، قال أخبرني يونس بن يزيد، عن ابن شهاب، حدثني عبد الله بن كعب بن مالك، أن كعب بن مالك، أخبره أنه، تقاضى ابن أبي حدرد دينا له عليه، في عهد رسول الله صلى الله عليه وسلم في المسجد، فارتفعت أصواتهما حتى سمعها رسول الله صلى الله عليه وسلم وهو في بيته، فخرج إليهما رسول الله صلى الله عليه وسلم حتى كشف سجف حجرته ونادى ‏\"‏ يا كعب بن مالك، يا كعب ‏\"‏‏.‏ قال لبيك يا رسول الله‏.‏ فأشار بيده أن ضع الشطر من دينك‏.‏ قال كعب قد فعلت يا رسول الله‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ قم فاقضه ‏\"‏‏.‏",
      "text_en": " Narrated Ka`b bin Malik:                     During the lifetime of Allah's Apostle I asked Ibn Abi Hadrad in the mosque to pay the debts which he owed to me and our voices grew so loud that Allah's Apostle heard them while he was in his house. So he came to us after raising the curtain of his room. The Prophet said, \"O Ka`b bin Malik!\" I replied, \"Labaik, O Allah's Apostle.\" He gestured with his hand to me to reduce the debt to one half. I said, \"O Allah's Apostle have done it.\" Allah's Apostle said (to Ibn Hadrad), \"Get up and pay it.\"",
      "chain": [
        "30007",
        "20029",
        "20475",
        "11013",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "682",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثنا ابن وهب، قال حدثني يونس، عن ابن شهاب، عن حمزة بن عبد الله، أنه أخبره عن أبيه، قال لما اشتد برسول الله صلى الله عليه وسلم وجعه قيل له في الصلاة فقال ‏\"‏ مروا أبا بكر فليصل بالناس ‏\"‏‏.‏ قالت عائشة إن أبا بكر رجل رقيق، إذا قرأ غلبه البكاء‏.‏ قال ‏\"‏ مروه فيصلي ‏\"‏ فعاودته‏.‏ قال ‏\"‏ مروه فيصلي، إنكن صواحب يوسف ‏\"‏‏.‏ تابعه الزبيدي وابن أخي الزهري وإسحاق بن يحيى الكلبي عن الزهري‏.‏ وقال عقيل ومعمر عن الزهري عن حمزة عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Hamza bin `Abdullah:                     My father said, \"When Allah's Apostle became seriously ill, he was told about the prayer. He said, 'Tell Abu Bakr to lead the people in the prayer.' `Aisha said, 'Abu Bakr is a softhearted man and he would be overpowered by his weeping if he recited the Qur'an.' He said to them, 'Tell him (Abu Bakr) to lead the prayer. The same reply was given to him. He said again, 'Tell him to lead the prayer. You (women) are the companions of Joseph.\"",
      "chain": [
        "30220",
        "20029",
        "20475",
        "11013",
        "11818",
        "18"
      ]
    },
    {
      "hadith_no": "698",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد، قال حدثنا ابن وهب، قال حدثنا عمرو، عن عبد ربه بن سعيد، عن مخرمة بن سليمان، عن كريب، مولى ابن عباس عن ابن عباس  رضى الله عنهما  قال نمت عند ميمونة والنبي صلى الله عليه وسلم عندها تلك الليلة، فتوضأ ثم قام يصلي، فقمت على يساره، فأخذني فجعلني عن يمينه، فصلى ثلاث عشرة ركعة، ثم نام حتى نفخ  وكان إذا نام نفخ  ثم أتاه المؤذن، فخرج فصلى ولم يتوضأ‏.‏ قال عمرو فحدثت به بكيرا فقال حدثني كريب بذلك‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     One night I slept at the house of (my aunt) Maimuna and the Prophet was there on that night. He performed ablution and stood up for the prayer. I joined him and stood on his left side but he drew me to his right and prayed thirteen rak`at and then slept till I heard his breath sounds. And whenever he slept, he used to breathe with audible sounds. The Mu'adh-dhin came to the Prophet and he went out and prayed the morning prayer) without repeating the ablution.",
      "chain": [
        "30007",
        "20029",
        "20377",
        "11191",
        "11223",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "855",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثنا ابن وهب، عن يونس، عن ابن شهاب، زعم عطاء أن جابر بن عبد الله، زعم أن النبي صلى الله عليه وسلم قال ‏\"‏ من أكل ثوما أو بصلا فليعتزلنا  أو قال  فليعتزل مسجدنا، وليقعد في بيته ‏\"‏‏.‏ وأن النبي صلى الله عليه وسلم أتي بقدر فيه خضرات من بقول، فوجد لها ريحا فسأل فأخبر بما فيها من البقول فقال ‏\"‏ قربوها ‏\"‏ إلى بعض أصحابه كان معه، فلما رآه كره أكلها قال ‏\"‏ كل فإني أناجي من لا تناجي ‏\"‏‏.‏وقال أحمد بن صالح عن ابن وهب أتي ببدر‏.‏ قال ابن وهب يعني طبقا فيه خضرات‏.‏ ولم يذكر الليث وأبو صفوان عن يونس قصة القدر، فلا أدري هو من قول الزهري أو في الحديث‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet said, \"Whoever eats garlic or onion should keep away from our mosque or should remain in his house.\" (Jabir bin `Abdullah, in another narration said, \"Once a big pot containing cooked vegetables was brought. On finding unpleasant smell coming from it, the Prophet asked, 'What is in it?' He was told all the names of the vegetables that were in it. The Prophet ordered that it should be brought near to some of his companions who were with him. When the Prophet saw it he disliked to eat it and said, 'Eat. (I don't eat) for I converse with those whom you don't converse with (i.e. the angels).",
      "chain": [
        "30233",
        "20029",
        "20475"
      ]
    },
    {
      "hadith_no": "902",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد، قال حدثنا عبد الله بن وهب، قال أخبرني عمرو بن الحارث، عن عبيد الله بن أبي جعفر، أن محمد بن جعفر بن الزبير، حدثه عن عروة بن الزبير، عن عائشة، زوج النبي صلى الله عليه وسلم قالت كان الناس ينتابون يوم الجمعة من منازلهم والعوالي، فيأتون في الغبار، يصيبهم الغبار والعرق، فيخرج منهم العرق، فأتى رسول الله صلى الله عليه وسلم إنسان منهم وهو عندي، فقال النبي صلى الله عليه وسلم ‏\"‏ لو أنكم تطهرتم ليومكم هذا ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     (the wife of the Prophet) The people used to come from their abodes and from Al-`Awali (i.e. outskirts of Medina up to a distance of four miles or more from Medina). They used to pass through dust and used to be drenched with sweat and covered with dust; so sweat used to trickle from them. One of them came to Allah's Apostle who was in my house. The Prophet said to him, \"I wish that you keep yourself clean on this day of yours (i.e. take a bath).\"",
      "chain": [
        "30007",
        "20029",
        "20377",
        "11409",
        "11215",
        "10511"
      ]
    },
    {
      "hadith_no": "950",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد، قال حدثنا ابن وهب، قال أخبرنا عمرو، أن محمد بن عبد الرحمن الأسدي، حدثه عن عروة، عن عائشة، قالت دخل على رسول الله صلى الله عليه وسلم وعندي جاريتان تغنيان بغناء بعاث، فاضطجع على الفراش وحول وجهه، ودخل أبو بكر فانتهرني وقال مزمارة الشيطان عند النبي صلى الله عليه وسلم فأقبل عليه رسول الله  عليه السلام  فقال ‏\"‏ دعهما ‏\"‏ فلما غفل غمزتهما فخرجتا‏.‏ وكان يوم عيد يلعب السودان بالدرق والحراب، فإما سألت النبي صلى الله عليه وسلم وإما قال ‏\"‏ تشتهين تنظرين ‏\"‏‏.‏ فقلت نعم‏.‏ فأقامني وراءه خدي على خده، وهو يقول ‏\"‏ دونكم يا بني أرفدة ‏\"‏‏.‏ حتى إذا مللت قال ‏\"‏ حسبك ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ فاذهبي ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     Allah's Apostle (p.b.u.h) came to my house while two girls were singing beside me the songs of Buath (a story about the war between the two tribes of the Ansar, the Khazraj and the Aus, before Islam). The Prophet (p.b.u.h) lay down and turned his face to the other side. Then Abu Bakr came and spoke to me harshly saying, \"Musical instruments of Satan near the Prophet (p.b.u.h) ?\" Allah's Apostle (p.b.u.h) turned his face towards him and said, \"Leave them.\" When Abu Bakr became inattentive, I signaled to those girls to go out and they left. It was the day of `Id, and the Black people were playing with shields and spears; so either I requested the Prophet (p.b.u.h) or he asked me whether I would like to see the display. I replied in the affirmative. Then the Prophet (p.b.u.h) made me stand behind him and my cheek was touching his cheek and he was saying, \"Carry on! O Bani Arfida,\" till I got tired. The Prophet (p.b.u.h) asked me, \"Are you satisfied (Is that sufficient for you)?\" I replied in the affirmative and he told me to leave.",
      "chain": [
        "30226",
        "20029",
        "20377",
        "11105",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "993",
      "source": " Sahih Bukhari ",
      "chapter": "Witr Prayer - كتاب الوتر",
      "chapter_no": "14",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني عمرو، أن عبد الرحمن بن القاسم، حدثه عن أبيه، عن عبد الله بن عمر، قال قال النبي صلى الله عليه وسلم ‏\"‏ صلاة الليل مثنى مثنى، فإذا أردت أن تنصرف فاركع ركعة توتر لك ما صليت ‏\"‏‏.‏ قال القاسم ورأينا أناسا منذ أدركنا يوترون بثلاث، وإن كلا لواسع أرجو أن لا يكون بشىء منه بأس‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Prophet said, \"Night prayer is offered as two rak`at followed by two rak`at and so on, and if you want to finish it, pray only one rak`a which will be witr for all the previous rak`at.\" Al-Qasim said, \"Since we attained the age of puberty we have seen some people offering a three-rak`at prayer as witr and all that is permissible. I hope there will be no harm in it.\"",
      "chain": [
        "30220",
        "20029",
        "20377",
        "10530",
        "10535",
        "18"
      ]
    },
    {
      "hadith_no": "1042",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا أصبغ، قال أخبرني ابن وهب، قال أخبرني عمرو، عن عبد الرحمن بن القاسم، حدثه عن أبيه، عن ابن عمر  رضى الله عنهما  أنه كان يخبر عن النبي صلى الله عليه وسلم‏.‏ ‏\"‏ إن الشمس والقمر لا يخسفان لموت أحد ولا لحياته، ولكنهما آيتان من آيات الله، فإذا رأيتموها فصلوا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"The sun and the moon do not eclipse because of the death or life (i.e. birth) of someone but they are two signs amongst the signs of Allah. When you see them offer the prayer.\"",
      "chain": [
        "30228",
        "20029",
        "20377",
        "10530",
        "10535",
        "18"
      ]
    },
    {
      "hadith_no": "1101",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال حدثني عمر بن محمد، أن حفص بن عاصم، حدثه قال سافر ابن عمر  رضى الله عنهما  فقال صحبت النبي صلى الله عليه وسلم فلم أره يسبح في السفر، وقال الله جل ذكره ‏{‏لقد كان لكم في رسول الله أسوة حسنة‏}‏‏.‏",
      "text_en": " Narrated Hafs bin `Asim:                     Ibn `Umar went on a journey and said, \"I accompanied the Prophet and he did not offer optional prayers during the journey, and Allah says: 'Verily! In Allah's Apostle you have a good example to follow.' \" (33.21)",
      "chain": [
        "30220",
        "20029",
        "11530",
        "11420",
        "18"
      ]
    },
    {
      "hadith_no": "1233",
      "source": " Sahih Bukhari ",
      "chapter": "Forgetfulness in Prayer - كتاب السهو",
      "chapter_no": "22",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني عمرو، عن بكير، عن كريب، أن ابن عباس، والمسور بن مخرمة، وعبد الرحمن بن أزهر  رضى الله عنهم  أرسلوه إلى عائشة  رضى الله عنها  فقالوا اقرأ عليها السلام منا جميعا وسلها عن الركعتين بعد صلاة العصر وقل لها إنا أخبرنا أنك تصلينهما وقد بلغنا أن النبي صلى الله عليه وسلم نهى عنها‏.‏ وقال ابن عباس وكنت أضرب الناس مع عمر بن الخطاب عنهما‏.‏ فقال كريب فدخلت على عائشة  رضى الله عنها  فبلغتها ما أرسلوني‏.‏ فقالت سل أم سلمة‏.‏ فخرجت إليهم فأخبرتهم بقولها فردوني إلى أم سلمة بمثل ما أرسلوني به إلى عائشة‏.‏ فقالت أم سلمة  رضى الله عنها  سمعت النبي صلى الله عليه وسلم ينهى عنها ثم رأيته يصليهما حين صلى العصر، ثم دخل على وعندي نسوة من بني حرام من الأنصار فأرسلت إليه الجارية فقلت قومي بجنبه قولي له تقول لك أم سلمة يا رسول الله سمعتك تنهى عن هاتين وأراك تصليهما‏.‏ فإن أشار بيده فاستأخري عنه‏.‏ ففعلت الجارية فأشار بيده فاستأخرت عنه فلما انصرف قال ‏\"‏ يا بنت أبي أمية سألت عن الركعتين بعد العصر وإنه أتاني ناس من عبد القيس فشغلوني عن الركعتين اللتين بعد الظهر فهما هاتان ‏\"‏‏.‏",
      "text_en": " Narrated Kuraib:                     I was sent to Aisha by Ibn `Abbas, Al-Miswar bin Makhrama and `Abdur-Rahman bin Azhar . They told me to greet her on their behalf and to ask her about the offering of the two rak`at after the `Asr prayer and to say to her, \"We were informed that you offer those two rak`at and we were told that the Prophet had forbidden offering them.\" Ibn `Abbas said, \"I along with `Umar bin Al-Khattab used to beat the people whenever they offered them.\" I went to Aisha and told her that message. `Aisha said, \"Go and ask Um Salama about them.\" So I returned and informed them about her statement. They then told me to go to Um Salama with the same question with which t sent me to `Aisha. Um Salama replied, \"I heard the Prophet forbidding them. Later I saw him offering them immediately after he prayed the `Asr prayer. He then entered my house at a time when some of the Ansari women from the tribe of Bani Haram were sitting with me, so I sent my slave girl to him having said to her, 'Stand beside him and tell him that Um Salama says to you, \"O Allah's Apostle! I have heard you forbidding the offering of these (two rak`at after the `Asr prayer) but I have seen you offering them.\" If he waves his hand then wait for him.' The slave girl did that. The Prophet beckoned her with his hand and she waited for him. When he had finished the prayer he said, \"O daughter of Bani Umaiya! You have asked me about the two rak`at after the `Asr prayer. The people of the tribe of `Abdul-Qais came to me and made me busy and I could not offer the two rak`at after the Zuhr prayer. These (two rak`at that I have just prayed) are for those (missed) ones.",
      "chain": [
        "30220",
        "20029",
        "20377",
        "11154",
        "11211",
        "17",
        "2201",
        "2216"
      ]
    },
    {
      "hadith_no": "1235",
      "source": " Sahih Bukhari ",
      "chapter": "Forgetfulness in Prayer - كتاب السهو",
      "chapter_no": "22",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، حدثنا الثوري، عن هشام، عن فاطمة، عن أسماء، قالت دخلت على عائشة  رضى الله عنها  وهي تصلي قائمة والناس قيام فقلت ما شأن الناس فأشارت برأسها إلى السماء‏.‏ فقلت آية‏.‏ فقالت برأسها أى نعم‏.‏",
      "text_en": " Narrated Asma':                     I went to `Aisha and she was standing praying and the people, too, were standing (praying). So I said, \"What is the matter with the people?\" She beckoned with her head towards the sky. I said, \"(Is there) a sign?\" She nodded intending to say, \"Yes.\"",
      "chain": [
        "30220",
        "20029",
        "20012",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "1260",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد، حدثنا عبد الله بن وهب، أخبرنا ابن جريج، قال أيوب وسمعت حفصة بنت سيرين، قالت حدثتنا أم عطية  رضى الله عنها  أنهن جعلن رأس بنت رسول الله صلى الله عليه وسلم ثلاثة قرون نقضنه ثم غسلنه ثم جعلنه ثلاثة قرون‏.‏",
      "text_en": " Narrated Hafsa bint Seereen:                     Um 'Atiyya said that they had entwined the hair of the daughter of Allah's Apostle in three braids. They first undid her hair, washed and then entwined it in three braids.\"",
      "chain": [
        "30226",
        "20029",
        "11070",
        "11015",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "1261",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد، حدثنا عبد الله بن وهب، أخبرنا ابن جريج، أن أيوب، أخبره قال سمعت ابن سيرين، يقول جاءت أم عطية  رضى الله عنها  امرأة من الأنصار من اللاتي بايعن، قدمت البصرة، تبادر ابنا لها فلم تدركه  فحدثتنا قالت دخل علينا النبي صلى الله عليه وسلم ونحن نغسل ابنته فقال ‏\"‏ اغسلنها ثلاثا أو خمسا أو أكثر من ذلك إن رأيتن ذلك بماء وسدر، واجعلن في الآخرة كافورا، فإذا فرغتن فآذنني ‏\"‏‏.‏ قالت فلما فرغنا ألقى إلينا حقوه فقال ‏\"‏ أشعرنها إياه ‏\"‏‏.‏ ولم يزد على ذلك، ولا أدري أى بناته‏.‏ وزعم أن الإشعار الففنها فيه، وكذلك كان ابن سيرين يأمر بالمرأة أن تشعر ولا تؤزر‏.‏",
      "text_en": " Narrated Ibn Seereen:                     Um 'Atiyya (an Ansari woman who gave the pledge of allegiance to the Prophet ) came to Basra to visit her son, but she could not find him. She narrated to us, \"The Prophet came to us while we were giving bath to his (dead) daughter, he said: 'Wash her three times, five times or more, if you think it necessary, with water and Sidr, and last of all put camphor, and when you finish, notify me.' \" Um 'Atiyya added, \"After finishing, we informed him and he gave us his waist sheet and told us to shroud her in it and did not say more than that.\"",
      "chain": [
        "30007",
        "20029",
        "11070",
        "11015",
        "11035"
      ]
    },
    {
      "hadith_no": "1304",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا أصبغ، عن ابن وهب، قال أخبرني عمرو، عن سعيد بن الحارث الأنصاري، عن عبد الله بن عمر  رضى الله عنهما  قال اشتكى سعد بن عبادة شكوى له فأتاه النبي صلى الله عليه وسلم يعوده مع عبد الرحمن بن عوف وسعد بن أبي وقاص وعبد الله بن مسعود  رضى الله عنهم  فلما دخل عليه فوجده في غاشية أهله فقال ‏\"‏ قد قضى ‏\"‏‏.‏ قالوا لا يا رسول الله‏.‏ فبكى النبي صلى الله عليه وسلم فلما رأى القوم بكاء النبي صلى الله عليه وسلم بكوا فقال ‏\"‏ ألا تسمعون إن الله لا يعذب بدمع العين، ولا بحزن القلب، ولكن يعذب بهذا  وأشار إلى لسانه  أو يرحم وإن الميت يعذب ببكاء أهله عليه ‏\"‏‏.‏ وكان عمر  رضى الله عنه  يضرب فيه بالعصا، ويرمي بالحجارة ويحثي بالتراب‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Sa`d bin 'Ubada became sick and the Prophet along with `Abdur Rahman bin `Auf, Sa`d bin Abi Waqqas and `Abdullah bin Mas`ud visited him to inquire about his health. When he came to him, he found him surrounded by his household and he asked, \"Has he died?\" They said, \"No, O Allah's Apostle.\" The Prophet wept and when the people saw the weeping of Allah's Apostle (p.b.u.h) they all wept. He said, \"Will you listen? Allah does not punish for shedding tears, nor for the grief of the heart but he punishes or bestows His Mercy because of this.\" He pointed to his tongue and added, \"The deceased is punished for the wailing of his relatives over him.\" `Umar used to beat with a stick and throw stones and put dust over the faces (of those who used to wail over the dead).",
      "chain": [
        "30228",
        "20029",
        "20377",
        "11167",
        "18"
      ]
    },
    {
      "hadith_no": "1373",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا يحيى بن سليمان، حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، أخبرني عروة بن الزبير، أنه سمع أسماء بنت أبي بكر  رضى الله عنهما  تقول قام رسول الله صلى الله عليه وسلم خطيبا فذكر فتنة القبر التي يفتتن فيها المرء، فلما ذكر ذلك ضج المسلمون ضجة‏.‏",
      "text_en": " Narrated Asma' bint Abi Bakr:                     Allah's Apostle once stood up delivering a sermon and mentioned the trial which people will face in the grave. When he mentioned that, the Muslims started shouting loudly.",
      "chain": [
        "30220",
        "20029",
        "20475",
        "11013",
        "10511",
        "70"
      ]
    },
    {
      "hadith_no": "1507",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا عبد الله بن وهب، قال أخبرني يونس بن يزيد، عن الزهري، عن سالم بن عبد الله، عن أبيه  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ فيما سقت السماء والعيون أو كان عثريا العشر، وما سقي بالنضح نصف العشر ‏\"‏‏.‏ قال أبو عبد الله هذا تفسير الأول لأنه لم يوقت في الأول  يعني حديث ابن عمر  وفيما سقت السماء العشر وبين في هذا ووقت، والزيادة مقبولة، والمفسر يقضي على المبهم إذا رواه أهل الثبت، كما روى الفضل بن عباس أن النبي صلى الله عليه وسلم لم يصل في الكعبة‏.‏ وقال بلال قد صلى‏.‏ فأخذ بقول بلال وترك قول الفضل‏.‏",
      "text_en": " Narrated Salim bin `Abdullah from his father:                     The Prophet said, \"On a land irrigated by rain water or by natural water channels or if the land is wet due to a near by water channel Ushr (i.e. one-tenth) is compulsory (as Zakat); and on the land irrigated by the well, half of an Ushr (i.e. one-twentieth) is compulsory (as Zakat on the yield of the land).\"",
      "chain": [
        "30232",
        "20029",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1516",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا سعيد بن عفير، حدثنا ابن وهب، عن يونس، عن ابن شهاب، حدثني عبيد الله بن عبد الله، عن ابن عباس  رضى الله عنهما  قال وجد النبي صلى الله عليه وسلم شاة ميتة أعطيتها مولاة لميمونة من الصدقة، قال النبي صلى الله عليه وسلم ‏\"‏ هلا انتفعتم بجلدها ‏\"‏‏.‏ قالوا إنها ميتة‏.‏ قال ‏\"‏ إنما حرم أكلها ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet saw a dead sheep which had been given in charity to a freed slave-girl of Maimuna, the wife of the Prophet . The Prophet said, \"Why don't you get the benefit of its hide?\" They said, \"It is dead.\" He replied, \"Only to eat (its meat) is illegal.\"",
      "chain": [
        "30233",
        "20029",
        "20475",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "1539",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن عيسى، حدثنا ابن وهب، عن يونس، عن ابن شهاب، أن سالم بن عبد الله، أخبره أن ابن عمر  رضى الله عنهما  قال رأيت رسول الله صلى الله عليه وسلم يركب راحلته بذي الحليفة ثم يهل حتى تستوي به قائمة‏.‏",
      "text_en": " Narrated Ibn `Umar:                     I saw that Allah's Apostle used to ride on his Mount at Dhul Hulaifa and used to start saying, \"Labbaik\" when the Mount stood upright.",
      "chain": [
        "30227",
        "20029",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1553",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد، حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن سالم بن عبد الله، عن أبيه  رضى الله عنه  سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ مهل أهل المدينة ذو الحليفة، ومهل أهل الشأم مهيعة وهي الجحفة، وأهل نجد قرن ‏\"‏‏.‏ قال ابن عمر  رضى الله عنهما  زعموا أن النبي صلى الله عليه وسلم قال ولم أسمعه ‏\"‏ ومهل أهل اليمن يلملم ‏\"‏‏.‏",
      "text_en": " Narrated Salim bin `Abdullah from his father:                     I heard Allah's Apostle saying, \"The Miqat for the people of Medina is Dhul-Hulaifa; for the people of Sham is Mahita; (i.e. Al-Juhfa); and for the people of Najd is Qarn. And said Ibn `Umar, \"They claim, but I did not hear personally, that the Prophet said, \"The Miqat for the people of Yemen is Yalamlam.\"",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1565",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أصبغ، أخبرنا ابن وهب، عن يونس، عن ابن شهاب، عن سالم، عن أبيه  رضى الله عنه  قال سمعت رسول الله صلى الله عليه وسلم يهل ملبدا‏.‏",
      "text_en": " Narrated Salim from his father:                     I heard that Allah's Apostle assumed Ihram with his hair matted together.",
      "chain": [
        "30228",
        "20029",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1604",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد، حدثنا ابن وهب، أخبرنا عمرو، عن هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم دخل عام الفتح من كداء أعلى مكة‏.‏ قال هشام وكان عروة يدخل على كلتيهما من كداء وكدا، وأكثر ما يدخل من كداء، وكانت أقربهما إلى منزله‏.‏",
      "text_en": " Narrated `Aisha:                     In the year of the conquest of Mecca, the Prophet entered Mecca from Kada' at the higher place of Mecca. (Hisham, a sub-narrator said, \" `Urwa used to enter (Mecca) from both Kada' and Kuda and he often entered through Kada' which was nearer to his dwelling place.)\"",
      "chain": [
        "30007",
        "20029",
        "20377",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1613",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أصبغ، قال أخبرني ابن وهب، عن يونس، عن ابن شهاب، عن علي بن حسين، عن عمرو بن عثمان، عن أسامة بن زيد  رضى الله عنهما  أنه قال يا رسول الله، أين تنزل في دارك بمكة‏.‏ فقال ‏\"‏ وهل ترك عقيل من رباع أو دور ‏\"‏‏.‏ وكان عقيل ورث أبا طالب هو وطالب ولم يرثه جعفر ولا علي  رضى الله عنهما  شيئا لأنهما كانا مسلمين، وكان عقيل وطالب كافرين، فكان عمر بن الخطاب  رضى الله عنه  يقول لا يرث المؤمن الكافر‏.‏ قال ابن شهاب وكانوا يتأولون قول الله تعالى ‏{‏إن الذين آمنوا وهاجروا وجاهدوا بأموالهم وأنفسهم في سبيل الله والذين آووا ونصروا أولئك بعضهم أولياء بعض‏}‏ الآية‏.‏",
      "text_en": " Narrated 'Usama bin Zaid:                     I asked, \"O Allah's Apostle! Where will you stay in Mecca? Will you stay in your house in Mecca?\" He replied, \"Has `Aqil left any property or house?\" `Aqil along with Talib had inherited the property of Abu Talib. Jafar and `Ali did not inherit anything as they were Muslims and the other two were non-believers. `Umar bin Al-Khattab used to say, \"A believer cannot inherit (anything from an) infidel.\" Ibn Shihab, (a sub-narrator) said, \"They (`Umar and others) derived the above verdict from Allah's Statement: \"Verily! those who believed and Emigrated and strove with their life And property in Allah's Cause, And those who helped (the emigrants) And gave them their places to live in, These are (all) allies to one another.\" (8.72)",
      "chain": [
        "30228",
        "20029",
        "20475",
        "11013",
        "11045",
        "10581",
        "50"
      ]
    },
    {
      "hadith_no": "1628",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أصبغ بن الفرج، أخبرني ابن وهب، عن يونس، عن ابن شهاب، عن سالم، عن أبيه  رضى الله عنه  قال رأيت رسول الله صلى الله عليه وسلم حين يقدم مكة، إذا استلم الركن الأسود أول ما يطوف يخب ثلاثة أطواف من السبع‏.‏",
      "text_en": " Narrated Salim that his father said:                     I saw Allah's Apostle arriving at Mecca; he kissed the Black Stone Corner first while doing Tawaf and did ramal in the first three rounds of the seven rounds (of Tawaf).",
      "chain": [
        "30228",
        "20029",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1633",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن صالح، ويحيى بن سليمان، قالا حدثنا ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن عبيد الله بن عبد الله، عن ابن عباس  رضى الله عنهما  قال طاف النبي صلى الله عليه وسلم في حجة الوداع على بعير، يستلم الركن بمحجن‏.‏ تابعه الدراوردي عن ابن أخي الزهري عن عمه‏.‏",
      "text_en": " Narrated Ibn `Abbas.:                     In his Last Hajj the Prophet performed Tawaf of the Ka`ba riding a camel and pointed a bent-headed stick towards the Corner (Black Stone).",
      "chain": [
        "30226",
        "30220",
        "20029",
        "20475",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "1640",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أصبغ، عن ابن وهب، أخبرني عمرو، عن محمد بن عبد الرحمن،، ذكرت لعروة، قال فأخبرتني عائشة  رضى الله عنها  أن أول، شىء بدأ به حين قدم النبي صلى الله عليه وسلم أنه توضأ، ثم طاف، ثم لم تكن عمرة، ثم حج أبو بكر وعمر  رضى الله عنهما  مثله، ثم حججت مع أبي الزبير  رضى الله عنه  فأول شىء بدأ به الطواف، ثم رأيت المهاجرين والأنصار يفعلونه، وقد أخبرتني أمي أنها أهلت هي وأختها والزبير وفلان وفلان بعمرة، فلما مسحوا الركن حلوا‏.‏",
      "text_en": " Narrated `Urwa:                     `Aisha said, \"The first thing the Prophet did on reaching Mecca, was the ablution and then he performed Tawaf of the Ka`ba and that was not `Umra (alone), (but Hajj-al-Qiran). `Urwa added: Later Abu Bakr and `Umar did the same in their Hajj.\" And I performed the Hajj with my father Az- Zubair, and the first thing he did was Tawaf of the Ka`ba. Later I saw the Muhajirin (Emigrants) and the Ansar doing the same. My mother (Asma') told me that she, her sister (`Aisha), Az-Zubair and such and such persons assumed Ihram for `Umra, and after they passed their hands over the Black Stone Corner (of the Ka`ba) they finished the Ihram. (i.e. After doing Tawaf of the Ka`ba and Sa`i between Safa-Marwa.",
      "chain": [
        "30228",
        "20029",
        "20377"
      ]
    },
    {
      "hadith_no": "1666",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن عيسى، حدثنا ابن وهب، قال أخبرني عمرو بن الحارث، عن محمد بن عبد الرحمن بن نوفل القرشي، أنه سأل عروة بن الزبير فقال قد حج النبي صلى الله عليه وسلم فأخبرتني عائشة  رضى الله عنها  أنه أول شىء بدأ به حين قدم أنه توضأ ثم طاف بالبيت ثم لم تكن عمرة، ثم حج أبو بكر  رضى الله عنه  فكان أول شىء بدأ به الطواف بالبيت ثم لم تكن عمرة‏.‏ ثم عمر  رضى الله عنه  مثل ذلك‏.‏ ثم حج عثمان  رضى الله عنه  فرأيته أول شىء بدأ به الطواف بالبيت ثم لم تكن عمرة، ثم معاوية وعبد الله بن عمر، ثم حججت مع أبي الزبير بن العوام، فكان أول شىء بدأ به الطواف بالبيت، ثم لم تكن عمرة، ثم رأيت المهاجرين والأنصار يفعلون ذلك، ثم لم تكن عمرة، ثم آخر من رأيت فعل ذلك ابن عمر ثم لم ينقضها عمرة، وهذا ابن عمر عندهم فلا يسألونه، ولا أحد ممن مضى، ما كانوا يبدءون بشىء حتى يضعوا أقدامهم من الطواف بالبيت، ثم لا يحلون، وقد رأيت أمي وخالتي، حين تقدمان لا تبتدئان بشىء أول من البيت، تطوفان به، ثم لا تحلان‏.‏   وقد أخبرتني أمي، أنها أهلت هي وأختها والزبير وفلان وفلان بعمرة، فلما مسحوا الركن حلوا‏.‏",
      "text_en": " Narrated Muhammad bin `Abdur-Rahman bin Nawfal Al-Qurashi:                     I asked `Urwa bin Az-Zubair (regarding the Hajj of the Prophet ). `Urwa replied, \"Aisha narrated, 'When the Prophet reached Mecca, the first thing he started with was the ablution, then he performed Tawaf of the Ka`ba and his intention was not `Umra alone (but Hajj and `Umra together).' \" Later Abu Bakr I performed the Hajj and the first thing he started with was Tawaf of the Ka`ba and it was not `Umra alone (but Hajj and `Umra together). And then `Umar did the same. Then `Uthman performed the Hajj and the first thing he started with was Tawaf of the Ka`ba and it was not `Umra alone. And then Muawiya and `Abdullah bin `Umar did the same. I performed Hajj with Ibn Az-Zubair and the first thing he started with was Tawaf of the Ka`ba and it was not `Umra alone, (but Hajj and `Umra together). Then I saw the Muhajirin (Emigrants) and Ansar doing the same and it was not `Umra alone. And the last person I saw doing the same was Ibn `Umar, and he did not do another `Umra after finishing the first. Now here is Ibn `Umar present amongst the people! They neither ask him nor anyone of the previous ones. And all these people, on entering Mecca, would not start with anything unless they had performed Tawaf of the Ka`ba, and would not finish their Ihram. And no doubt, I saw my mother and my aunt, on entering Mecca doing nothing before performing Tawaf of the Ka`ba, and they would not finish their lhram. And my mother informed me that she, her sister, Az-Zubair and such and such persons had assumed lhram for `Umra and after passing their hands over the Corner (the Black Stone) (i.e. finishing their Umra) they finished their Ihram.\"",
      "chain": [
        "30227",
        "20029",
        "20377",
        "11105"
      ]
    },
    {
      "hadith_no": "1681",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا ابن وهب، أخبرني يونس، عن ابن شهاب، قال أخبرني عبيد الله بن عبد الله بن عمر، عن أبيه، قال صلى رسول الله صلى الله عليه وسلم بمنى ركعتين، وأبو بكر وعمر وعثمان صدرا من خلافته‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle offered a two-rak`at prayer at Mina. Abu Bakr, `Umar and `Uthman, (during the early years of his caliphate) followed the same practice.",
      "chain": [
        "30308",
        "20029",
        "20475",
        "11013",
        "11817",
        "18"
      ]
    },
    {
      "hadith_no": "1783",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أصبغ بن الفرج، أخبرنا ابن وهب، عن عمرو بن الحارث، عن قتادة، أن أنس بن مالك  رضى الله عنه  حدثه أن النبي صلى الله عليه وسلم صلى الظهر والعصر، والمغرب والعشاء، ثم رقد رقدة بالمحصب، ثم ركب إلى البيت فطاف به‏.‏   تابعه الليث حدثني خالد، عن سعيد، عن قتادة، أن أنس بن مالك  رضى الله عنه  حدثه عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet offered the Zuhr, `Asr, Maghrib and the `Isha' prayers and slept for a while at a place called Al-Muhassab and then rode to the Ka`ba and performed Tawaf round it .",
      "chain": [
        "30228",
        "20029",
        "20377",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1791",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد المتعال بن طالب، حدثنا ابن وهب، قال أخبرني عمرو بن الحارث، أن قتادة، حدثه عن أنس بن مالك  رضى الله عنه  حدثه عن النبي صلى الله عليه وسلم أنه صلى الظهر والعصر، والمغرب والعشاء، ورقد رقدة بالمحصب، ثم ركب إلى البيت فطاف به‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet offered the Zuhr, `Asr, Maghrib and `Isha' prayers and slept for a while at a place called Al-Mahassab and then he rode towards the Ka`ba and performed Tawaf (al-Wada`).",
      "chain": [
        "30257",
        "20029",
        "20377",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1824",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا أحمد بن عيسى، حدثنا ابن وهب، أخبرنا عمرو، عن أبي الأسود، أن عبد الله، مولى أسماء بنت أبي بكر حدثه أنه، كان يسمع أسماء تقول كلما مرت بالحجون صلى الله على محمد لقد نزلنا معه ها هنا، ونحن يومئذ خفاف، قليل ظهرنا، قليلة أزوادنا، فاعتمرت أنا وأختي عائشة والزبير وفلان وفلان، فلما مسحنا البيت أحللنا، ثم أهللنا من العشي بالحج‏.‏",
      "text_en": " Narrated Al-Aswad:                     `Abdullah the slave of Asma bint Abu Bakr, told me that he used to hear Asma', whenever she passed by Al-Hajun, saying, \"May Allah bless His Apostle Muhammad. Once we dismounted here with him, and at that time we were traveling with light luggage; we had a few riding animals and a little food ration. I, my sister, `Aisha, Az-Zubair and such and such persons performed `Umra, and when we had passed our hands over the Ka`ba (i.e. performed Tawaf round the Ka`ba and between As-Safa and Al- Marwa) we finished our lhram. Later on we assumed Ihram for Hajj the same evening.\"",
      "chain": [
        "30227",
        "20029",
        "20377",
        "11105",
        "11188"
      ]
    },
    {
      "hadith_no": "1859",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أصبغ، قال أخبرني عبد الله بن وهب، عن يونس، عن ابن شهاب، عن سالم، قال قال عبد الله بن عمر  رضى الله عنهما  قالت حفصة قال رسول الله صلى الله عليه وسلم ‏\"‏ خمس من الدواب لا حرج على من قتلهن الغراب والحدأة والفأرة والعقرب والكلب العقور ‏\"‏‏.‏",
      "text_en": " Narrated Hafsa:                     Allah's Apostle said, \"It is not sinful (of a Muhrim) to kill five kinds of animals, namely: the crow, the kite, the mouse, the scorpion and the rabid dog.\"",
      "chain": [
        "30228",
        "20029",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1860",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال أخبرني يونس، عن ابن شهاب، عن عروة، عن عائشة  رضى الله عنها  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ خمس من الدواب كلهن فاسق، يقتلهن في الحرم الغراب والحدأة والعقرب والفأرة والكلب العقور ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     Allah's Apostle said, \"Five kinds of animals are harmful and could be killed in the Haram (Sanctuary). These are: the crow, the kite, the scorpion, the mouse and the rabid dog.\"",
      "chain": [
        "30220",
        "20029",
        "20475",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1930",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، حدثنا يونس، عن ابن شهاب، عن عروة، وأبي، بكر قالت عائشة  رضى الله عنها  كان النبي صلى الله عليه وسلم يدركه الفجر ‏{‏جنبا‏}‏ في رمضان، من غير حلم فيغتسل ويصوم‏.‏",
      "text_en": " Narrated `Aisha:                     (At times) in Ramadan the Prophet used to take a bath in the morning not because of a wet dream and would continue his fast.",
      "chain": [
        "30226",
        "20029",
        "20475",
        "11013",
        "10511",
        "2",
        "53"
      ]
    },
    {
      "hadith_no": "2025",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني ابن وهب، عن يونس، أن نافعا، أخبره عن عبد الله بن عمر  رضى الله عنهما  قال كان رسول الله صلى الله عليه وسلم يعتكف العشر الأواخر من رمضان‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle used to practice I`tikaf in the last ten days of the month of Ramadan.",
      "chain": [
        "30103",
        "20029",
        "20475",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2070",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني ابن وهب، عن يونس، عن ابن شهاب، قال حدثني عروة بن الزبير، أن عائشة  رضى الله عنها  قالت لما استخلف أبو بكر الصديق قال لقد علم قومي أن حرفتي لم تكن تعجز عن مئونة أهلي، وشغلت بأمر المسلمين، فسيأكل آل أبي بكر من هذا المال ويحترف للمسلمين فيه‏.‏",
      "text_en": " Narrated `Aisha:                     When Abu Bakr As-Siddiq was chosen Caliph, he said, \"My people know that my profession was not incapable of providing substance to my family. And as I will be busy serving the Muslim nation, my family will eat from the National Treasury of Muslims, and I will practice the profession of serving the Muslims.\"",
      "chain": [
        "30103",
        "20029",
        "20475",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2189",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا يحيى بن سليمان، حدثنا ابن وهب، أخبرنا ابن جريج، عن عطاء، وأبي الزبير، عن جابر  رضى الله عنه  قال نهى النبي صلى الله عليه وسلم عن بيع الثمر حتى يطيب، ولا يباع شىء منه إلا بالدينار والدرهم إلا العرايا‏.‏",
      "text_en": " Narrated Jabir:                     The Prophet forbade the selling of fruits unless they get ripe, and none of them should be sold except for Dinar or Dirham (i.e. money), except the 'Araya trees (the dates of which could be sold for dates).",
      "chain": [
        "30220",
        "20029",
        "11070",
        "11029",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "2462",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا يحيى بن سليمان، قال حدثني ابن وهب، قال حدثني مالك،‏.‏ وأخبرني يونس، عن ابن شهاب، أخبرني عبيد الله بن عبد الله بن عتبة، أن ابن عباس، أخبره عن عمر  رضى الله عنهم  قال حين توفى الله نبيه صلى الله عليه وسلم إن الأنصار اجتمعوا في سقيفة بني ساعدة، فقلت لأبي بكر انطلق بنا‏.‏ فجئناهم في سقيفة بني ساعدة‏.‏",
      "text_en": " Narrated `Umar:                     When Allah took away the soul of His Prophet at his death, the Ansar assembled In the shed of Bani Sa`ida. I said to Abu Bakr, \"Let us go.\" So, we come to them (i.e. to Ansar) at the shed of Bani Sa`ida. (See Hadith No. 19, Vol. 5 for details)",
      "chain": [
        "30220",
        "20029",
        "20475",
        "11013",
        "11004",
        "17",
        "3"
      ]
    },
    {
      "hadith_no": "2501",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا أصبغ بن الفرج، قال أخبرني عبد الله بن وهب، قال أخبرني سعيد، عن زهرة بن معبد، عن جده عبد الله بن هشام  وكان قد أدرك النبي صلى الله عليه وسلم  وذهبت به أمه زينب بنت حميد إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله بايعه‏.‏ فقال ‏\"‏ هو صغير ‏\"‏‏.‏ فمسح رأسه ودعا له‏.‏ وعن زهرة بن معبد، أنه كان يخرج به جده عبد الله بن هشام إلى السوق فيشتري الطعام فيلقاه ابن عمر وابن الزبير  رضى الله عنهم  فيقولان له أشركنا، فإن النبي صلى الله عليه وسلم قد دعا لك بالبركة فيشركهم، فربما أصاب الراحلة كما هي، فيبعث بها إلى المنزل‏.‏",
      "text_en": " Narrated `Abdullah bin Hisham:                     that his mother Zainab bint Humaid took him to the Prophet and said, \"O Allah's Apostle! Take the pledge of allegiance from him.\" But he said, \"He is still too young for the pledge,\" and passed his hand on his (i.e. `Abdullah's) head and invoked for Allah's blessing for him. Zuhra bin Ma`bad stated that he used to go with his grandfather, `Abdullah bin Hisham, to the market to buy foodstuff. Ibn `Umar and Ibn Az-Zubair would meet him and say to him, \"Be our partner, as the Prophet invoked Allah to bless you.\" So, he would be their partner, and very often he would win a camel's load and send it home.",
      "chain": [
        "30228",
        "20029",
        "11168",
        "11507",
        "5141"
      ]
    },
    {
      "hadith_no": "2559",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن عبيد الله، حدثنا ابن وهب، قال حدثني مالك بن أنس، قال وأخبرني ابن فلان، عن سعيد المقبري، عن أبيه، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم وحدثنا عبد الله بن محمد، حدثنا عبد الرزاق، أخبرنا معمر، عن همام، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا قاتل أحدكم فليجتنب الوجه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"If somebody fights (or beats somebody) then he should avoid the face.\"",
      "chain": [
        "30213",
        "20029",
        "20001",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "2630",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا عبد الله بن يوسف، أخبرنا ابن وهب، حدثنا يونس، عن ابن شهاب، عن أنس بن مالك  رضى الله عنه  قال لما قدم المهاجرون المدينة من مكة وليس بأيديهم  يعني شيئا  وكانت الأنصار أهل الأرض والعقار، فقاسمهم الأنصار على أن يعطوهم ثمار أموالهم كل عام ويكفوهم العمل والمئونة، وكانت أمه أم أنس أم سليم كانت أم عبد الله بن أبي طلحة، فكانت أعطت أم أنس رسول الله صلى الله عليه وسلم عذاقا فأعطاهن النبي صلى الله عليه وسلم أم أيمن مولاته أم أسامة بن زيد‏.‏ قال ابن شهاب فأخبرني أنس بن مالك أن النبي صلى الله عليه وسلم لما فرغ من قتل أهل خيبر فانصرف إلى المدينة، رد المهاجرون إلى الأنصار منائحهم التي كانوا منحوهم من ثمارهم فرد النبي صلى الله عليه وسلم إلى أمه عذاقها، وأعطى رسول الله صلى الله عليه وسلم أم أيمن مكانهن من حائطه‏.‏ وقال أحمد بن شبيب أخبرنا أبي عن يونس بهذا، وقال مكانهن من خالصه‏.‏",
      "text_en": " Narrated Ibn Shihab Az-Zuhri:                     Anas bin Malik said, \"When the emigrants came Medina, they had nothing whereas the Ansar had land and property. The Ansar gave them their land on condition that the emigrants would give them half the yearly yield and work on the land and provide the necessaries for cultivation.\" His (i.e. Anas's mother who was also the mother of `Abdullah bin Abu Talha, gave some date-palms to Allah' Apostle who gave them to his freed slave-girl (Um Aiman) who was also the mother of Usama bin Zaid. When the Prophet finished from the fighting against the people of Khaibar and returned to Medina, the emigrants returned to the Ansar the fruit gifts which the Ansar had given them. The Prophet also returned to Anas's mother the date-palms. Allah's Apostle gave Um Aiman other trees from his garden in lieu of the old gift.",
      "chain": [
        "30355",
        "20029",
        "20475",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "2648",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا إسماعيل، قال حدثني ابن وهب، عن يونس،‏.‏ وقال الليث حدثني يونس، عن ابن شهاب، أخبرني عروة بن الزبير، أن امرأة، سرقت في غزوة الفتح، فأتي بها رسول الله صلى الله عليه وسلم ثم أمر فقطعت يدها‏.‏ قالت عائشة فحسنت توبتها وتزوجت، وكانت تأتي بعد ذلك فأرفع حاجتها إلى رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Urwa bin Az-Zubair:                     A woman committed theft in the Ghazwa of the Conquest (of Mecca) and she was taken to the Prophet who ordered her hand to be cut off. `Aisha said, \"Her repentance was perfect and she was married (later) and used to come to me (after that) and I would present her needs to Allah's Apostle.\"",
      "chain": [
        "30103",
        "20029",
        "20023",
        "20475",
        "11013",
        "10511"
      ]
    },
    {
      "hadith_no": "2907",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إسماعيل، قال حدثني ابن وهب، قال عمرو حدثني أبو الأسود، عن عروة، عن عائشة  رضى الله عنها  دخل على رسول الله صلى الله عليه وسلم وعندي جاريتان تغنيان بغناء بعاث، فاضطجع على الفراش وحول وجهه، فدخل أبو بكر فانتهرني وقال مزمارة الشيطان عند رسول الله صلى الله عليه وسلم‏.‏ فأقبل عليه رسول الله صلى الله عليه وسلم فقال ‏\"‏ دعهما ‏\"‏‏.‏ فلما غفل غمزتهما فخرجتا‏.‏   قالت وكان يوم عيد يلعب السودان بالدرق والحراب، فإما سألت رسول الله صلى الله عليه وسلم وإما قال ‏\"‏ تشتهين تنظرين ‏\"‏‏.‏ فقالت نعم‏.‏ فأقامني وراءه خدي على خده ويقول ‏\"‏ دونكم بني أرفدة ‏\"‏‏.‏ حتى إذا مللت قال ‏\"‏ حسبك ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ فاذهبي ‏\"‏‏.‏ قال أحمد عن ابن وهب، فلما غفل‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle came to my house while two girls were singing beside me the songs of Bu'ath (a story about the war between the two tribes of the Ansar, i.e. Khazraj and Aus, before Islam.) The Prophet reclined on the bed and turned his face to the other side. Abu Bakr came and scolded me and said protestingly, \"Instrument of Satan in the presence of Allah's Apostle?\" Allah's Apostle turned his face towards him and said, \"Leave them.\" When Abu Bakr became inattentive, I waved the two girls to go away and they left. It was the day of `Id when negroes used to play with leather shields and spears. Either I requested Allah's Apostle or he himself asked me whether I would like to see the display. I replied in the affirmative. Then he let me stand behind him and my cheek was touching his cheek and he was saying, \"Carry on, O Bani Arfida (i.e. negroes)!\" When I got tired, he asked me if that was enough. I replied in the affirmative and he told me to leave.",
      "chain": [
        "30103",
        "20029",
        "20377",
        "11114",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2954",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "وقال ابن وهب أخبرني عمرو، عن بكير، عن سليمان بن يسار، عن أبي هريرة  رضى الله عنه  أنه قال بعثنا رسول الله صلى الله عليه وسلم في بعث، وقال لنا ‏\"‏ إن لقيتم فلانا وفلانا ‏\"‏‏.‏  لرجلين من قريش سماهما  فحرقوهما بالنار‏.‏ قال ثم أتيناه نودعه حين أردنا الخروج فقال ‏\"‏ إني كنت أمرتكم أن تحرقوا فلانا وفلانا بالنار، وإن النار لا يعذب بها إلا الله، فإن أخذتموهما فاقتلوهما ‏\"‏‏.‏",
      "text_en": " Narrated Abu Hurairah (ra):                      Allah's Messenger () sent us on military expedition telling us, \"If you find such and such persons (he named two men from Quraish), burn them fire.\" Then we came to bid him farewell, when we wanted to set out, he said: \"Previously I ordered you to burn so-and-so and so-and-so with fire, but as punishment with fire is done by none except Allah, if you capture them, kill them, (instead).\"",
      "chain": [
        "20029",
        "20377",
        "11154",
        "11005",
        "13"
      ]
    }
  ],
  "total_hadiths": 1243
}