{
  "id": "20024",
  "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
  "full_name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "88",
      "date_gregorian": "NA",
      "date_display": [
        "88 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "157",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Beruit",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Syria",
      "Beruit"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة ثقة ]",
      "Fiqh",
      "Hadith"
    ],
    "tags": [
      "al-Shami",
      "Masri",
      "Imam"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11151",
      "name": "Ishaq bin 'Abdullah bin Abi Talha إسحاق بن عبد الله بن أبي طلحة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10881",
      "name": "Shdad bin 'Abdullah شداد بن عبد الله القرشي أبو عمار",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10793",
      "name": "Abd'h bin Abi Lbabh عبدة بن أبي لبابة الأسدي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11527",
      "name": "Ata'a bin S'hyb al-Ansari عطاء بن صهيب الأنصاري أبو النجاشي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11213",
      "name": "Muhammad bin Ibrahim bin al-Harith محمد بن إبراهيم بن الحارث",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11035",
      "name": "Ibn Sirin محمد بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19944",
      "name": "al-Muttalib bin 'Abdullah bin Hantab المطلب بن عبد الله بن حنطب",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11449",
      "name": "Yahya bin Abi Kathir يحيى بن أبي كثير الطائي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10993",
      "name": "Abu 'Ubaid al-Madhhaji أبو عبيد المذحجي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11692",
      "name": "Sulaiman bin Habib al-Maharbi سليمان بن حبيب المحاربي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11413",
      "name": "Hsan bin Atyh al-Mharby حسان بن عطية المحاربي مولاهم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11162",
      "name": "Rabi'ya bin Abi 'Abdur Rahman ربيعة بن أبي عبد الرحمن - ربيعة الرأي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10530",
      "name": "'Abdur Rahman bin al-Qasim عبد الرحمن بن القاسم بن محمد بن أبي بكر",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10977",
      "name": "al-Walid bin Hisham bin Mu'awiya الوليد بن هشام بن معاوية بن هشام",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10885",
      "name": "Yazid bin Yazid bin Jabir يزيد بن يزيد بن جابر",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20509",
      "name": "'Abdur Rahman bin Abi al-Zanad عبد الرحمن بن أبي الزناد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20644",
      "name": "Baqiyya bin al-Walid bin Sa'aid بقية بن الوليد بن صائد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20413",
      "name": "Bashr bin Bakr al-Tunisi بشر بن بكر التنيسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30373",
      "name": "Muhammad bin Harb al-Wasti محمد بن حرب بن حرمان النشائي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20641",
      "name": "Haql bin Ziyad هقل بن زياد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20239",
      "name": "Shu'aib bin Ishaq bin 'Abdur Rahman شعيب بن إسحاق بن عبد الرحمن",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20157",
      "name": "Abu Damra, Anas bin 'Ayyad أنس بن عياض الليثي - أبو ضمرة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20738",
      "name": "Dmrh bin Rabi'ya al-Flstyny ضمرة بن ربيعة الفلسطيني أبو عبد الله",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28042",
      "name": "Isma'il bin 'Abdullah إسماعيل بن عبد الله بن سماعه",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20405",
      "name": "Ibrahim bin Muhammad bin al-Harith إبراهيم بن محمد أبو اسحاق الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20736",
      "name": "Isma'il bin Ayyash bin Saleem إسماعيل بن عياش بن سليم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "27522",
      "name": "'Abdullah bin Kathir al-Dmshqy عبد الله بن كثير الدمشقي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20331",
      "name": "'Abdullah bin Numayr عبد الله بن نمير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30286",
      "name": "'Amr bin Abi Salmah عمرو بن أبي سلمة التنيسي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20461",
      "name": "Mubashir bin Isma'i مبشر بن إسماعيل - أبو إسماعيل الكلبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20732",
      "name": "Muhammad bin Shu'aib bin Shabur محمد بن شعيب بن شابور",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "5363",
      "name": "Abu 'Abdur Rahman al-Juhni ( أبو عبد الرحمن الجهني ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "20744",
      "name": "al-Hythm bin Hameed al-Ghsany الهيثم بن حميد الغساني مولاهم أبو أحمد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "24481",
      "name": "al-Walid bin Yazid al-Hadadi الوليد بن يزيد الهدادي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20402",
      "name": "Yahya bin Hamza bin Waqd يحيى بن حمزة بن واقد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "27556",
      "name": "Yazid bin al-Smt al-Sn'any يزيد بن السمط الصنعاني أبو السمط الدمشقي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "12578",
      "name": "Yahya bin 'Abdullah bin al-Dahhak يحيى بن عبد الله بن الضحاك",
      "grade": "Follower(Tabi') [9th generation]"
    },
    {
      "id": "20465",
      "name": "Musa bin A'ayn al-Jazri موسى بن أعين الجزري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "27536",
      "name": "'Umar bin Abd al-Wahd عمر بن عبد الواحد بن قيس السلمي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "27523",
      "name": "'Abdul Hameed bin Habib عبد الحميد بن حبيب بن أبي العشرين",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20034",
      "name": "Muhammad bin Yusuf al-Faryabi محمد بن يوسف الفريابي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20340",
      "name": "'Ubaidullah bin Musa bin Abi al-Mukhtar عبيد الله بن موسى بن أبي المختار باذام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28531",
      "name": "Muhammad bin Kathir bin Abi 'Ata' محمد بن كثير بن أبي عطاء الثقفي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "78",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو القاسم، خالد بن خلي قال حدثنا محمد بن حرب، قال قال الأوزاعي أخبرنا الزهري، عن عبيد الله بن عبد الله بن عتبة بن مسعود، عن ابن عباس، أنه تمارى هو والحر بن قيس بن حصن الفزاري في صاحب موسى، فمر بهما أبى بن كعب، فدعاه ابن عباس فقال إني تماريت أنا وصاحبي هذا في صاحب موسى الذي سأل السبيل إلى لقيه، هل سمعت رسول الله صلى الله عليه وسلم يذكر شأنه فقال أبى نعم، سمعت النبي صلى الله عليه وسلم يذكر شأنه يقول ‏\"‏ بينما موسى في ملإ من بني إسرائيل، إذ جاءه رجل فقال أتعلم أحدا أعلم منك قال موسى لا‏.‏ فأوحى الله عز وجل إلى موسى بلى، عبدنا خضر، فسأل السبيل إلى لقيه، فجعل الله له الحوت آية، وقيل له إذا فقدت الحوت فارجع، فإنك ستلقاه، فكان موسى صلى الله عليه وسلم يتبع أثر الحوت في البحر‏.‏ فقال فتى موسى لموسى أرأيت إذ أوينا إلى الصخرة فإني نسيت الحوت، وما أنسانيه إلا الشيطان أن أذكره‏.‏ قال موسى ذلك ما كنا نبغي‏.‏ فارتدا على آثارهما قصصا، فوجدا خضرا، فكان من شأنهما ما قص الله في كتابه ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     that he differed with Hur bin Qais bin Hisn Al-Fazari regarding the companion of the Prophet Moses. Meanwhile, Ubai bin Ka`b passed by them and Ibn `Abbas called him saying, \"My friend (Hur) and I have differed regarding Moses' companion whom Moses asked the way to meet. Have you heard Allah's Apostle mentioning something about him? Ubai bin Ka`b said: \"Yes, I heard the Prophet mentioning something about him (saying) while Moses was sitting in the company of some Israelites, a man came and asked him: \"Do you know anyone who is more learned than you? Moses replied: \"No.\" So Allah sent the Divine Inspiration to Moses: '--Yes, Our slave Khadir is more learned than you. Moses asked Allah how to meet him (Al-Khadir). So Allah made the fish a sign for him and he was told when the fish was lost, he should return (to the place where he had lost it) and there he would meet him (Al-Khadir). So Moses went on looking for the sign of the fish in the sea. The servant-boy of Moses said: 'Do you remember when we betook ourselves to the rock, I indeed forgot the fish, none but Satan made me forget to remember it. On that Moses said, 'That is what we have been seeking.' So they went back retracing their footsteps, and found Khadir. (and) what happened further about them is narrated in the Holy Qur'an by Allah.\" (18.54 up to 18.82)",
      "chain": [
        "30333",
        "30373",
        "20024",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "154",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن يوسف، قال حدثنا الأوزاعي، عن يحيى بن أبي كثير، عن عبد الله بن أبي قتادة، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا بال أحدكم فلا يأخذن ذكره بيمينه، ولا يستنجي بيمينه، ولا يتنفس في الإناء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Qatada:                     The Prophet said, \"Whenever anyone of you makes water he should not hold his penis or clean his private parts with his right hand. (And while drinking) one should not breathe in the drinking utensil .\"",
      "chain": [
        "30388",
        "20024",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "205",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبدان، قال أخبرنا عبد الله، قال أخبرنا الأوزاعي، عن يحيى، عن أبي سلمة، عن جعفر بن عمرو، عن أبيه، قال رأيت النبي صلى الله عليه وسلم يمسح على عمامته وخفيه‏.‏ وتابعه معمر عن يحيى عن أبي سلمة عن عمرو قال رأيت النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ja`far bin `Amr:                     My father said, \"I saw the Prophet passing wet hands over his turban and Khuffs (socks made from thick fabric or leather).",
      "chain": [
        "30349",
        "20025",
        "20024",
        "11449",
        "10567",
        "11501"
      ]
    },
    {
      "hadith_no": "559",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن مهران، قال حدثنا الوليد، قال حدثنا الأوزاعي، قال حدثنا أبو النجاشي، صهيب مولى رافع بن خديج قال سمعت رافع بن خديج، يقول كنا نصلي المغرب مع النبي صلى الله عليه وسلم فينصرف أحدنا وإنه ليبصر مواقع نبله‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     We used to offer the Maghrib prayer with the Prophet and after finishing the prayer one of us may go away and could still see as Par as the spots where one's arrow might reach when shot by a bow.",
      "chain": [
        "30383",
        "20733",
        "20024",
        "1986"
      ]
    },
    {
      "hadith_no": "640",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق، قال حدثنا محمد بن يوسف، قال حدثنا الأوزاعي، عن الزهري، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، قال أقيمت الصلاة فسوى الناس صفوفهم، فخرج رسول الله صلى الله عليه وسلم فتقدم وهو جنب ثم قال ‏\"‏ على مكانكم ‏\"‏‏.‏ فرجع فاغتسل ثم خرج ورأسه يقطر ماء فصلى بهم‏.‏",
      "text_en": " Narrated Abu Huraira:                     Once Iqama was pronounced and the people had straightened the rows, Allah's Apostle went forward (to lead the prayer) but he was Junub, so he said, \"Remain in your places.\" And he went out, took a bath and returned with water trickling from his head. Then he led the prayer.",
      "chain": [
        "30312",
        "30388",
        "20024",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "695",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "قال أبو عبد الله وقال لنا محمد بن يوسف حدثنا الأوزاعي، حدثنا الزهري، عن حميد بن عبد الرحمن، عن عبيد الله بن عدي بن خيار، أنه دخل على عثمان بن عفان  رضى الله عنه  وهو محصور فقال إنك إمام عامة، ونزل بك ما ترى ويصلي لنا إمام فتنة ونتحرج‏.‏ فقال الصلاة أحسن ما يعمل الناس، فإذا أحسن الناس فأحسن معهم، وإذا أساءوا فاجتنب إساءتهم‏.‏ وقال الزبيدي قال الزهري لا نرى أن يصلى خلف المخنث إلا من ضرورة لا بد منها‏.‏",
      "text_en": " Narrated 'Ubaid-Ullah bin Adi bin Khiyar:                      I went to 'Uthman bin Affan while he was besieged, and said to him, \"You are the chief of all Muslims in general and you see what has befallen you. We are led in the Salat (prayer) by a leader of Al-Fitan (trials and afflictions etc.) and we are afraid of being sinful in following him.\" 'Uthman said. \"As-Salat (the prayers) is the best of all deeds so when the people do good deeds do the same with them and when they do bad deeds, avoid those bad deeds.\" Az-Zuhri said, \"In our opinion one should not offer Salat behind an effeminate person unless there is no alternative.\"",
      "chain": [
        "30184",
        "30388",
        "20024",
        "11013",
        "10561",
        "880"
      ]
    },
    {
      "hadith_no": "707",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إبراهيم بن موسى، قال أخبرنا الوليد، قال حدثنا الأوزاعي، عن يحيى بن أبي كثير، عن عبد الله بن أبي قتادة، عن أبيه أبي قتادة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إني لأقوم في الصلاة أريد أن أطول فيها، فأسمع بكاء الصبي، فأتجوز في صلاتي كراهية أن أشق على أمه ‏\"‏‏.‏ تابعه بشر بن بكر وابن المبارك وبقية عن الأوزاعي‏.‏",
      "text_en": " Narrated `Abdullah bin 'Abi Qatada:                     My father said, \"The Prophet said, 'When I stand for prayer, I intend to prolong it but on hearing the cries of a child, I cut it short, as I dislike to trouble the child's mother.' \"",
      "chain": [
        "30309",
        "20733",
        "20024",
        "11449",
        "11804"
      ]
    },
    {
      "hadith_no": "778",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا الأوزاعي، حدثني يحيى بن أبي كثير، حدثني عبد الله بن أبي قتادة، عن أبيه، أن النبي صلى الله عليه وسلم كان يقرأ بأم الكتاب وسورة معها في الركعتين الأوليين من صلاة الظهر وصلاة العصر، ويسمعنا الآية أحيانا، وكان يطيل في الركعة الأولى‏.‏",
      "text_en": " Narrated `Abdullah bin Abi Qatada:                     My father said, \"The Prophet used to recite Al-Fatiha along with another Sura in the first two rak`at of the Zuhr and `Asr prayers. A verse or so was audible at times and he used to prolong the first rak`a.\"",
      "chain": [
        "30388",
        "20024",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "868",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن مسكين، قال حدثنا بشر، أخبرنا الأوزاعي، حدثني يحيى بن أبي كثير، عن عبد الله بن أبي قتادة الأنصاري، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إني لأقوم إلى الصلاة وأنا أريد أن أطول فيها، فأسمع بكاء الصبي، فأتجوز في صلاتي كراهية أن أشق على أمه ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Abi Qatada Al-Ansari:                     My father said, \"Allah's Apostle said, \"Whenever I stand for prayer, I want to prolong it but on hearing the cries of a child, I would shorten it as I dislike to put its mother in trouble.\"",
      "chain": [
        "30275",
        "30126",
        "20024",
        "11449"
      ]
    },
    {
      "hadith_no": "933",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثنا الوليد، قال حدثنا أبو عمرو، قال حدثني إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال أصابت الناس سنة على عهد النبي صلى الله عليه وسلم فبينا النبي صلى الله عليه وسلم يخطب في يوم جمعة قام أعرابي فقال يا رسول الله هلك المال وجاع العيال، فادع الله لنا‏.‏ فرفع يديه، وما نرى في السماء قزعة، فوالذي نفسي بيده ما وضعها حتى ثار السحاب أمثال الجبال، ثم لم ينزل عن منبره حتى رأيت المطر يتحادر على لحيته صلى الله عليه وسلم فمطرنا يومنا ذلك، ومن الغد، وبعد الغد والذي يليه، حتى الجمعة الأخرى، وقام ذلك الأعرابي  أو قال غيره  فقال يا رسول الله، تهدم البناء وغرق المال، فادع الله لنا‏.‏ فرفع يديه، فقال ‏\"‏ اللهم حوالينا، ولا علينا ‏\"‏‏.‏ فما يشير بيده إلى ناحية من السحاب إلا انفرجت، وصارت المدينة مثل الجوبة، وسال الوادي قناة شهرا، ولم يجئ أحد من ناحية إلا حدث بالجود‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Once in the lifetime of the Prophet (p.b.u.h) the people were afflicted with drought (famine). While the Prophet was delivering the Khutba on a Friday, a Bedouin stood up and said, \"O, Allah's Apostle! Our possessions are being destroyed and the children are hungry; Please invoke Allah (for rain)\". So the Prophet raised his hands. At that time there was not a trace of cloud in the sky. By Him in Whose Hands my soul is as soon as he lowered his hands, clouds gathered like mountains, and before he got down from the pulpit, I saw the rain falling on the beard of the Prophet. It rained that day, the next day, the third day, the fourth day till the next Friday. The same Bedouin or another man stood up and said, \"O Allah's Apostle! The houses have collapsed, our possessions and livestock have been drowned; Please invoke Allah (to protect us)\". So the Prophet raised both his hands and said, \"O Allah! Round about us and not on us\". So, in whatever direction he pointed with his hands, the clouds dispersed and cleared away, and Medina's (sky) became clear as a hole in between the clouds. The valley of Qanat remained flooded, for one month, none came from outside but talked about the abundant rain.",
      "chain": [
        "30308",
        "20733",
        "20024",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "973",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثنا الوليد، قال حدثنا أبو عمرو، قال أخبرني نافع، عن ابن عمر، قال كان النبي صلى الله عليه وسلم يغدو إلى المصلى، والعنزة بين يديه، تحمل وتنصب بالمصلى بين يديه فيصلي إليها‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet used to proceed to the Musalla and an 'Anaza used to be carried before him and planted in the Musalla in front of him and he would pray facing it (as a Sutra).",
      "chain": [
        "30308",
        "20733",
        "20024",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1018",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا الحسن بن بشر، قال حدثنا معافى بن عمران، عن الأوزاعي، عن إسحاق بن عبد الله، عن أنس بن مالك، أن رجلا، شكا إلى النبي صلى الله عليه وسلم هلاك المال وجهد العيال، فدعا الله يستسقي، ولم يذكر أنه حول رداءه ولا استقبل القبلة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     I p man complained to the Prophet about the destruction of livestock and property and the hunger of the offspring. So he invoked (Allah for rain. The narrator (Anas) did not mention that the Prophet had worn his cloak inside out or faced the Qibla.",
      "chain": [
        "30188",
        "20464",
        "20024",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "1033",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن مقاتل، قال أخبرنا عبد الله بن المبارك، قال أخبرنا الأوزاعي، قال حدثنا إسحاق بن عبد الله بن أبي طلحة الأنصاري، قال حدثني أنس بن مالك، قال أصابت الناس سنة على عهد رسول الله صلى الله عليه وسلم فبينا رسول الله صلى الله عليه وسلم يخطب على المنبر يوم الجمعة قام أعرابي فقال يا رسول الله، هلك المال وجاع العيال، فادع الله لنا أن يسقينا‏.‏ قال فرفع رسول الله صلى الله عليه وسلم يديه، وما في السماء قزعة، قال فثار سحاب أمثال الجبال، ثم لم ينزل عن منبره حتى رأيت المطر يتحادر على لحيته، قال فمطرنا يومنا ذلك، وفي الغد ومن بعد الغد والذي يليه إلى الجمعة الأخرى، فقام ذلك الأعرابي أو رجل غيره فقال يا رسول الله، تهدم البناء وغرق المال، فادع الله لنا‏.‏ فرفع رسول الله صلى الله عليه وسلم يديه وقال ‏\"‏ اللهم حوالينا ولا علينا ‏\"‏‏.‏ قال فما جعل يشير بيده إلى ناحية من السماء إلا تفرجت حتى صارت المدينة في مثل الجوبة، حتى سال الوادي  وادي قناة  شهرا‏.‏ قال فلم يجئ أحد من ناحية إلا حدث بالجود‏.‏",
      "text_en": " Narrated Anas bin Malik:                     In the lifetime of Allah's Apostle (p.b.u.h) the people were afflicted with a (famine) year. While the Prophet was delivering the Khutba (sermon) on the pulpit on a Friday, a Bedouin stood up and said, \"O Allah's Apostle! The livestock are dying and the families (offspring) are hungry: please pray to Allah to bless us with rain.\" Allah's Apostle raised both his hands towards the sky and at that time there was not a trace of cloud in they sky. Then the clouds started gathering like mountains. Before he got down from the pulpit I saw rainwater trickling down his beard. It rained that day, the next day, the third day, the fourth day and till the next Friday, when the same Bedouin or some other person stood up (during the Friday Khutba) and said, \"O Allah's Apostle! The houses have collapsed and the livestock are drowned. Please invoke Allah for us.\" So Allah's Apostle raised both his hands and said, \"O Allah! Around us and not on us.\" Whichever side the Prophet directed his hand, the clouds dispersed from there till a hole (in the clouds) was formed over Medina. The valley of Qanat remained flowing (with water) for one month and none, came from outside who didn't talk about the abundant rain.",
      "chain": [
        "30118",
        "20025",
        "20024",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "1152",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا عباس بن الحسين، حدثنا مبشر، عن الأوزاعي،‏.‏ وحدثني محمد بن مقاتل أبو الحسن، قال أخبرنا عبد الله، أخبرنا الأوزاعي، قال حدثني يحيى بن أبي كثير، قال حدثني أبو سلمة بن عبد الرحمن، قال حدثني عبد الله بن عمرو بن العاص  رضى الله عنهما  قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا عبد الله، لا تكن مثل فلان، كان يقوم الليل فترك قيام الليل ‏\"‏‏.‏ وقال هشام حدثنا ابن أبي العشرين، حدثنا الأوزاعي، قال حدثني يحيى، عن عمر بن الحكم بن ثوبان، قال حدثني أبو سلمة، مثله‏.‏ وتابعه عمرو بن أبي سلمة عن الأوزاعي،‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr bin Al-`As:                     Allah's Apostle said to me, \"O `Abdullah! Do not be like so and so who used to pray at night and then stopped the night prayer.\"",
      "chain": [
        "30141",
        "20461",
        "20024",
        "30118",
        "20025",
        "20024",
        "11449",
        "10567",
        "29"
      ]
    },
    {
      "hadith_no": "1154",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا صدقة بن الفضل، أخبرنا الوليد، عن الأوزاعي، قال حدثني عمير بن هانئ، قال حدثني جنادة بن أبي أمية، حدثني عبادة بن الصامت، عن النبي صلى الله عليه وسلم قال ‏\"‏ من تعار من الليل فقال لا إله إلا الله وحده لا شريك له، له الملك، وله الحمد، وهو على كل شىء قدير‏.‏ الحمد لله، وسبحان الله، ولا إله إلا الله، والله أكبر، ولا حول ولا قوة إلا بالله‏.‏ ثم قال اللهم اغفر لي‏.‏ أو دعا استجيب، فإن توضأ وصلى قبلت صلاته ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                     The Prophet \"Whoever gets up at night and says: -- 'La ilaha il-lallah Wahdahu la Sharika lahu Lahu-lmulk, waLahu-l-hamd wahuwa 'ala kullishai'in Qadir. Al hamdu lil-lahi wa subhanal-lahi wa la-ilaha il-lal-lah wa-l-lahu akbar wa la hawla Wala Quwata il-la-bil-lah.' (None has the right to be worshipped but Allah. He is the Only One and has no partners . For Him is the Kingdom and all the praises are due for Him. He is Omnipotent. All the praises are for Allah. All the glories are for Allah. And none has the right to be worshipped but Allah, And Allah is Great And there is neither Might nor Power Except with Allah). And then says: -- Allahumma, Ighfir li (O Allah! Forgive me). Or invokes (Allah), he will be responded to and if he performs ablution (and prays), his prayer will be accepted.\"",
      "chain": [
        "30343",
        "20733",
        "20024",
        "11415",
        "3205",
        "40"
      ]
    },
    {
      "hadith_no": "1240",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد، حدثنا عمرو بن أبي سلمة، عن الأوزاعي، قال أخبرني ابن شهاب، قال أخبرني سعيد بن المسيب، أن أبا هريرة  رضى الله عنه  قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ حق المسلم على المسلم خمس رد السلام، وعيادة المريض، واتباع الجنائز، وإجابة الدعوة، وتشميت العاطس ‏\"‏‏.‏ تابعه عبد الرزاق قال أخبرنا معمر‏.‏ ورواه سلامة عن عقيل‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard Allah's Apostle saying, \"The rights of a Muslim on the Muslims are to follow the funeral processions, to accept invitation and to reply the sneezer. (see Hadith No 331)",
      "chain": [
        "30213",
        "30286",
        "20024",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "1425",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا إسحاق بن يزيد، أخبرنا شعيب بن إسحاق، قال الأوزاعي أخبرني يحيى بن أبي كثير، أن عمرو بن يحيى بن عمارة، أخبره عن أبيه، يحيى بن عمارة بن أبي الحسن أنه سمع أبا سعيد  رضى الله عنه  يقول قال النبي صلى الله عليه وسلم ‏\"‏ ليس فيما دون خمس أواق صدقة، وليس فيما دون خمس ذود صدقة، وليس فيما دون خمس أوسق صدقة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     Allah's Apostle (p.b.u.h) said, \"No Zakat is due on property mounting to less than five Uqiyas (of silver), and no Zakat is due on less than five camels, and there is no Zakat on less than five Wasqs.\" (A Wasqs equals 60 Sa's) & (1 Sa=3 K gms App.)",
      "chain": [
        "20239",
        "20024",
        "11449",
        "11210",
        "38"
      ]
    },
    {
      "hadith_no": "1475",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، قال حدثني ابن شهاب، عن عطاء بن يزيد، عن أبي سعيد الخدري  رضى الله عنه  أن أعرابيا سأل رسول الله صلى الله عليه وسلم عن الهجرة فقال ‏\"‏ ويحك، إن شأنها شديد، فهل لك من إبل تؤدي صدقتها ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فاعمل من وراء البحار فإن الله لن يترك من عملك شيئا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     A Bedouin asked Allah's Apostle about the emigration. The Prophet (p.b.u.h) said, \"May Allah have mercy on you! The matter of emigration is very hard. Have you got camels? Do you pay their Zakat?\" The Bedouin said, \"Yes, I have camels and I pay their Zakat.\" The Prophet said, Work beyond the seas and Allah will not decrease (waste) any of your good deeds.\" (See Hadith No. 260 Vol. 5).",
      "chain": [
        "30026",
        "20733",
        "20024",
        "11013",
        "11206",
        "38"
      ]
    },
    {
      "hadith_no": "1527",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا الوليد، حدثنا أبو عمرو الأوزاعي، حدثني إسحاق بن عبد الله بن أبي طلحة، حدثني أنس بن مالك  رضى الله عنه  قال غدوت إلى رسول الله صلى الله عليه وسلم بعبد الله بن أبي طلحة ليحنكه، فوافيته في يده الميسم يسم إبل الصدقة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     I took `Abdullah bin Abu Talha to Allah's Apostle to perform Tahnik for him. (Tahnik was a custom among the Muslims that whenever a child was born they used to take it to the Prophet who would chew a piece of date and put a part of its juice in the child's mouth). I saw the Prophet and he had an instrument for branding in his hands and was branding the camels of Zakat.",
      "chain": [
        "30308",
        "20733",
        "20024",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "1540",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إبراهيم، أخبرنا الوليد، حدثنا الأوزاعي، سمع عطاء، يحدث عن جابر بن عبد الله  رضى الله عنهما  أن إهلال رسول الله صلى الله عليه وسلم من ذي الحليفة حين استوت به راحلته‏.‏ رواه أنس وابن عباس رضى الله عنهم‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     that Allah's Apostle started saying, \"Labbaik\" from Dhul-Hulaifa when his Mount stood upright carrying him .",
      "chain": [
        "20150",
        "20733",
        "20024",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "1559",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا الحميدي، حدثنا الوليد، وبشر بن بكر التنيسي، قالا حدثنا الأوزاعي، قال حدثني يحيى، قال حدثني عكرمة، أنه سمع ابن عباس  رضى الله عنهما  يقول إنه سمع عمر  رضى الله عنه  يقول سمعت النبي صلى الله عليه وسلم بوادي العقيق يقول ‏\"‏ أتاني الليلة آت من ربي فقال صل في هذا الوادي المبارك وقل عمرة في حجة ‏\"‏‏.‏",
      "text_en": " Narrated `Umar:                     In the valley of Al-`Aqiq I heard Allah's Apostle saying, \"To night a messenger came to me from my Lord and asked me to pray in this blessed valley and to assume Ihram for Hajj and `Umra together. \"",
      "chain": [
        "30418",
        "20733",
        "20413",
        "20024",
        "11449",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1615",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا الحميدي، حدثنا الوليد، حدثنا الأوزاعي، قال حدثني الزهري، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم من الغد يوم النحر وهو بمنى ‏\"‏ نحن نازلون غدا بخيف بني كنانة حيث تقاسموا على الكفر ‏\"‏‏.‏ يعني ذلك المحصب، وذلك أن قريشا وكنانة تحالفت على بني هاشم وبني عبد المطلب، أو بني المطلب أن لا يناكحوهم، ولا يبايعوهم حتى يسلموا إليهم النبي صلى الله عليه وسلم‏.‏ وقال سلامة عن عقيل ويحيى بن الضحاك عن الأوزاعي أخبرني ابن شهاب وقالا بني هاشم وبني المطلب‏.‏ قال أبو عبد الله بني المطلب أشبه‏.‏",
      "text_en": " Narrated Abu Huraira:                     On the Day of Nahr at Mina, the Prophet said, \"Tomorrow we shall stay at Khaif Bani Kinana where the pagans had taken the oath of Kufr (heathenism).\" He meant (by that place) Al-Muhassab where the Quraish tribe and Bani Kinana concluded a contract against Bani Hashim and Bani `Abdul-Muttalib or Bani Al-Muttalib that they would not intermarry with them or deal with them in business until they handed over the Prophet to them.",
      "chain": [
        "30418",
        "20733",
        "20024",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1868",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو المغيرة عبد القدوس بن الحجاج، حدثنا الأوزاعي، حدثني عطاء بن أبي رباح، عن ابن عباس  رضى الله عنهما  أن النبي صلى الله عليه وسلم تزوج ميمونة وهو محرم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet married Maimuna while he was in the state of Ihram, (only the ceremonies of marriage were held).",
      "chain": [
        "20442",
        "20024",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "1914",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا الوليد، حدثنا أبو عمرو، حدثنا إسحاق، حدثني أنس بن مالك  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ليس من بلد إلا سيطؤه الدجال، إلا مكة والمدينة، ليس له من نقابها نقب إلا عليه الملائكة صافين، يحرسونها، ثم ترجف المدينة بأهلها ثلاث رجفات، فيخرج الله كل كافر ومنافق ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"There will be no town which Ad-Dajjal will not enter except Mecca and Medina, and there will be no entrance (road) (of both Mecca and Medina) but the angels will be standing in rows guarding it against him, and then Medina will shake with its inhabitants thrice (i.e. three earthquakes will take place) and Allah will expel all the non-believers and the hypocrites from it.\"",
      "chain": [
        "30308",
        "20733",
        "20024",
        "30312",
        "19"
      ]
    },
    {
      "hadith_no": "1975",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا ابن مقاتل، أخبرنا عبد الله، أخبرنا الأوزاعي، قال حدثني يحيى بن أبي كثير، قال حدثني أبو سلمة بن عبد الرحمن، قال حدثني عبد الله بن عمرو بن العاص  رضى الله عنهما  قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا عبد الله ألم أخبر أنك تصوم النهار وتقوم الليل ‏\"‏‏.‏ فقلت بلى يا رسول الله‏.‏ قال ‏\"‏ فلا تفعل، صم وأفطر، وقم ونم، فإن لجسدك عليك حقا، وإن لعينك عليك حقا، وإن لزوجك عليك حقا، وإن لزورك عليك حقا، وإن بحسبك أن تصوم كل شهر ثلاثة أيام، فإن لك بكل حسنة عشر أمثالها، فإن ذلك صيام الدهر كله ‏\"‏‏.‏ فشددت، فشدد على، قلت يا رسول الله، إني أجد قوة‏.‏ قال ‏\"‏ فصم صيام نبي الله داود عليه السلام ولا تزد عليه ‏\"‏‏.‏ قلت وما كان صيام نبي الله داود  عليه السلام  قال ‏\"‏ نصف الدهر ‏\"‏‏.‏ فكان عبد الله يقول بعد ما كبر يا ليتني قبلت رخصة النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr bin Al-`As:                     Allah's Apostle said to me, \"O `Abdullah! Have I not been informed that you fast during the day and offer prayers all the night.\" `Abdullah replied, \"Yes, O Allah's Apostle!\" The Prophet said, \"Don't do that; fast for few days and then give it up for few days, offer prayers and also sleep at night, as your body has a right on you, and your wife has a right on you, and your guest has a right on you. And it is sufficient for you to fast three days in a month, as the reward of a good deed is multiplied ten times, so it will be like fasting throughout the year.\" I insisted (on fasting) and so I was given a hard instruction. I said, \"O Allah's Apostle! I have power.\" The Prophet said, \"Fast like the fasting of the Prophet David and do not fast more than that.\" I said, \"How was the fasting of the Prophet of Allah, David?\" He said, \"Half of the year,\" (i.e. he used to fast on every alternate day). Afterwards when `Abdullah became old, he used to say, \"It would have been better for me if I had accepted the permission of the Prophet (which he gave me i.e. to fast only three days a month).",
      "chain": [
        "30118",
        "20025",
        "20024",
        "11449",
        "10567",
        "29"
      ]
    },
    {
      "hadith_no": "2045",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن مقاتل أبو الحسن، أخبرنا عبد الله، أخبرنا الأوزاعي، قال حدثني يحيى بن سعيد، قال حدثتني عمرة بنت عبد الرحمن، عن عائشة  رضى الله عنها  أن رسول الله صلى الله عليه وسلم ذكر أن يعتكف العشر الأواخر من رمضان، فاستأذنته عائشة فأذن لها، وسألت حفصة عائشة أن تستأذن لها ففعلت فلما رأت ذلك زينب ابنة جحش أمرت ببناء فبني لها قالت وكان رسول الله صلى الله عليه وسلم إذا صلى انصرف إلى بنائه فبصر بالأبنية فقال ‏\"‏ ما هذا ‏\"‏‏.‏ قالوا بناء عائشة وحفصة وزينب‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ آلبر أردن بهذا ما أنا بمعتكف ‏\"‏‏.‏ فرجع، فلما أفطر اعتكف عشرا من شوال‏.‏",
      "text_en": " Narrated `Amra bint `Abdur-Rahman from `Aisha:                     Allah's Apostle mentioned that he would practice I`tikaf in the last ten days of Ramadan. `Aisha asked his permission to perform I`tikaf and he permitted her. Hafsa asked `Aisha to take his permission for her, and she did so. When Zainab bint Jahsh saw that, she ordered a tent to be pitched for her and it was pitched for her. Allah's Apostle used to proceed to his tent after the prayer. So, he saw the tents ans asked, \"What is this?\" He was told that those were the tents of Aisha, Hafsa, and Zainab. Allah's Apostle said, \"Is it righteousness which they intended by doing so? I am not going to perform I`tikaf.\" So he returned home. When the fasting month was over, he performed Itikar for ten days in the month of Shawwal.",
      "chain": [
        "30118",
        "20025",
        "20024",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "2131",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا الوليد بن مسلم، عن الأوزاعي، عن الزهري، عن سالم، عن أبيه  رضى الله عنه  قال رأيت الذين يشترون الطعام مجازفة يضربون على عهد رسول الله صلى الله عليه وسلم أن يبيعوه حتى يئووه إلى رحالهم‏.‏",
      "text_en": " Narrated Salim:                     that his father said. \"I saw those, who used to buy foodstuff without measuring or weighing in the life time of the Prophet being punished if they sold it before carrying it to their own houses.\"",
      "chain": [
        "30123",
        "20733",
        "20024",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "2337",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا شعيب بن إسحاق، عن الأوزاعي، قال حدثني يحيى، عن عكرمة، عن ابن عباس، عن عمر  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الليلة أتاني آت من ربي وهو بالعقيق أن صل في هذا الوادي المبارك وقل عمرة في حجة ‏\"‏‏.‏",
      "text_en": " Narrated `Umar:                     While the Prophet was in Al-`Aqiq he said, \"Someone (meaning Gabriel) came to me from my Lord tonight (in my dream) and said, 'Offer the prayer in this blessed valley and say (I intend to perform) `Umra along with Hajj (together).' \"",
      "chain": [
        "30123",
        "20239",
        "20024",
        "11449",
        "11023",
        "17",
        "3"
      ]
    },
    {
      "hadith_no": "2339",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن مقاتل، أخبرنا عبد الله، أخبرنا الأوزاعي، عن أبي النجاشي، مولى رافع بن خديج سمعت رافع بن خديج بن رافع، عن عمه، ظهير بن رافع قال ظهير لقد نهانا رسول الله صلى الله عليه وسلم عن أمر كان بنا رافقا‏.‏ قلت ما قال رسول الله صلى الله عليه وسلم فهو حق‏.‏ قال دعاني رسول الله صلى الله عليه وسلم قال ‏\"‏ ما تصنعون بمحاقلكم ‏\"‏‏.‏ قلت نؤاجرها على الربع وعلى الأوسق من التمر والشعير‏.‏ قال ‏\"‏ لا تفعلوا ازرعوها أو أزرعوها أو أمسكوها ‏\"‏‏.‏ قال رافع قلت سمعا وطاعة‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     My uncle Zuhair said, \"Allah's Apostle forbade us to do a thing which was a source of help to us.\" I said, \"Whatever Allah's Apostle said was right.\" He said, \"Allah's Apostle sent for me and asked, 'What are you doing with your farms?' I replied, 'We give our farms on rent on the basis that we get the yield produced at the banks of the water streams (rivers) for the rent, or rent it for some Wasqs of barley and dates.' Allah's Apostle said, 'Do not do so, but cultivate (the land) yourselves or let it be cultivated by others gratis, or keep it uncultivated.' I said, 'We hear and obey.'",
      "chain": [
        "30118",
        "20025",
        "20024",
        "1986"
      ]
    },
    {
      "hadith_no": "2340",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا عبيد الله بن موسى، أخبرنا الأوزاعي، عن عطاء، عن جابر  رضى الله عنه  قال كانوا يزرعونها بالثلث والربع والنصف فقال النبي صلى الله عليه وسلم ‏\"‏ من كانت له أرض فليزرعها أو ليمنحها، فإن لم يفعل فليمسك أرضه ‏\"‏‏.‏ وقال الربيع بن نافع أبو توبة حدثنا معاوية، عن يحيى، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كانت له أرض فليزرعها أو ليمنحها أخاه، فإن أبى فليمسك أرضه ‏\"‏‏.‏",
      "text_en": " Narrated Jabir:                     The people used to rent their land for cultivation for one-third, one-fourth or half its yield. The Prophet said, \"Whoever has land should cultivate it himself or give it to his (Muslim) brother gratis; otherwise keep it uncultivated.\" Narrated Abu Huraira: Allah's Apostle said, \"Whoever has land should cultivate it himself or give it to his (Muslim) brother gratis; otherwise he should keep it uncultivated.\"",
      "chain": [
        "20340",
        "20024",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "2434",
      "source": " Sahih Bukhari ",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، قال حدثني يحيى بن أبي كثير، قال حدثني أبو سلمة بن عبد الرحمن، قال حدثني أبو هريرة  رضى الله عنه  قال لما فتح الله على رسوله صلى الله عليه وسلم مكة قام في الناس، فحمد الله، وأثنى عليه ثم قال ‏\"‏ إن الله حبس عن مكة الفيل، وسلط عليها رسوله والمؤمنين، فإنها لا تحل لأحد كان قبلي، وإنها أحلت لي ساعة من نهار، وإنها لا تحل لأحد بعدي، فلا ينفر صيدها ولا يختلى شوكها، ولا تحل ساقطتها إلا لمنشد، ومن قتل له قتيل فهو بخير النظرين، إما أن يفدى، وإما أن يقيد ‏\"‏‏.‏ فقال العباس إلا الإذخر، فإنا نجعله لقبورنا وبيوتنا‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إلا الإذخر ‏\"‏‏.‏ فقام أبو شاه  رجل من أهل اليمن  فقال اكتبوا لي يا رسول الله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اكتبوا لأبي شاه ‏\"‏‏.‏ قلت للأوزاعي ما قوله اكتبوا لي يا رسول الله قال هذه الخطبة التي سمعها من رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     When Allah gave victory to His Apostle over the people of Mecca, Allah's Apostle stood up among the people and after glorifying Allah, said, \"Allah has prohibited fighting in Mecca and has given authority to His Apostle and the believers over it, so fighting was illegal for anyone before me, and was made legal for me for a part of a day, and it will not be legal for anyone after me. Its game should not be chased, its thorny bushes should not be uprooted, and picking up its fallen things is not allowed except for one who makes public announcement for it, and he whose relative is murdered has the option either to accept a compensation for it or to retaliate.\" Al-`Abbas said, \"Except Al-Idhkhir, for we use it in our graves and houses.\" Allah's Apostle said, \"Except Al-Idhkhir.\" Abu Shah, a Yemenite, stood up and said, \"O Allah's Apostle! Get it written for me.\" Allah's Apostle said, \"Write it for Abu Shah.\" (The sub-narrator asked Al-Auza'i): What did he mean by saying, \"Get it written, O Allah's Apostle?\" He replied, \"The speech which he had heard from Allah's Apostle .\"",
      "chain": [
        "30221",
        "20733",
        "20024",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2485",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا الأوزاعي، حدثنا أبو النجاشي، قال سمعت رافع بن خديج  رضى الله عنه  قال كنا نصلي مع النبي صلى الله عليه وسلم العصر فننحر جزورا، فتقسم عشر قسم، فنأكل لحما نضيجا قبل أن تغرب الشمس‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     We used to offer the `Asr prayer with the Prophet and slaughter a camel, the meat of which would be divided in ten parts. We would eat the cooked meat before sunset.",
      "chain": [
        "30388",
        "20024",
        "1986"
      ]
    },
    {
      "hadith_no": "2631",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا مسدد، حدثنا عيسى بن يونس، حدثنا الأوزاعي، عن حسان بن عطية، عن أبي كبشة السلولي، سمعت عبد الله بن عمرو  رضى الله عنهما  يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ أربعون خصلة أعلاهن منيحة العنز، ما من عامل يعمل بخصلة منها رجاء ثوابها وتصديق موعودها إلا أدخله الله بها الجنة ‏\"‏‏.‏ قال حسان فعددنا ما دون منيحة العنز من رد السلام، وتشميت العاطس، وإماطة الأذى عن الطريق ونحوه، فما استطعنا أن نبلغ خمس عشرة خصلة‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     That Allah's Apostle said, \"There are forty virtuous deeds and the best of them is the Maniha of a shegoat, and anyone who does one of these virtuous deeds hoping for Allah's reward with firm confidence that he will get it, then Allah will make him enter Paradise because of Hassan (a subnarrator) said, \"We tried to count those good deeds below the Maniha; we mentioned replying to the sneezer, removing harmful things from the road, etc., but we failed to count even fifteen.\"",
      "chain": [
        "30175",
        "20347",
        "20024",
        "11413",
        "11669",
        "29"
      ]
    },
    {
      "hadith_no": "2632",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا الأوزاعي، قال حدثني عطاء، عن جابر  رضى الله عنه  قال كانت لرجال منا فضول أرضين فقالوا نؤاجرها بالثلث والربع والنصف‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ من كانت له أرض فليزرعها أو ليمنحها أخاه، فإن أبى فليمسك أرضه ‏\"‏‏.‏",
      "text_en": " Narrated Jabir:                     Some men had superfluous land and they said that they would give it to others to cultivate on the condition that they would get one-third or one-fourth or one half of its yield. The Prophet said, \"Whoever has land should cultivate it himself or give it to his brother or keep it uncultivated.\"",
      "chain": [
        "30388",
        "20024",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "2633",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "وقال محمد بن يوسف حدثنا الأوزاعي، حدثني الزهري، حدثني عطاء بن يزيد، حدثني أبو سعيد، قال جاء أعرابي إلى النبي صلى الله عليه وسلم فسأله عن الهجرة، فقال ‏\"‏ ويحك إن الهجرة شأنها شديد فهل لك من إبل ‏\"‏ قال نعم‏.‏ قال ‏\"‏ فتعطي صدقتها ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فهل تمنح منها شيئا ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فتحلبها يوم وردها ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فاعمل من وراء البحار، فإن الله لن يترك من عملك شيئا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                      A bedouin came to the Prophet and asked him about emigration. The Prophet said to him, \"May Allah be merciful to you. The matter of emigration is difficult. Have you got some camels?\" He replied in the affirmative. The Prophet asked him, \"Do you pay their Zakat?\" He replied in the affirmative. He asked, \"Do you lend them so that their milk may be utilized by others?\" The bedouin said, \"Yes.\" The Prophet asked, \"Do you milk them on the day off watering them?\" He replied, \"Yes.\" The Prophet said, \"Do good deeds beyond the merchants (or the sea) and Allah will never disregard any of your deeds.\" (See Hadith No. 260, Vol. 5)",
      "chain": [
        "30388",
        "20024",
        "11013",
        "11206",
        "38"
      ]
    },
    {
      "hadith_no": "2750",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا الأوزاعي، عن الزهري، عن سعيد بن المسيب، وعروة بن الزبير، أن حكيم بن حزام  رضى الله عنه  قال سألت رسول الله صلى الله عليه وسلم فأعطاني، ثم سألته فأعطاني ثم قال لي ‏\"‏ يا حكيم، إن هذا المال خضر حلو، فمن أخذه بسخاوة نفس بورك له فيه، ومن أخذه بإشراف نفس لم يبارك له فيه، وكان كالذي يأكل ولا يشبع، واليد العليا خير من اليد السفلى ‏\"‏‏.‏ قال حكيم فقلت يا رسول الله، والذي بعثك بالحق لا أرزأ أحدا بعدك شيئا حتى أفارق الدنيا‏.‏ فكان أبو بكر يدعو حكيما ليعطيه العطاء فيأبى أن يقبل منه شيئا، ثم إن عمر دعاه ليعطيه فيأبى أن يقبله فقال يا معشر المسلمين، إني أعرض عليه حقه الذي قسم الله له من هذا الفىء فيأبى أن يأخذه‏.‏ فلم يرزأ حكيم أحدا من الناس بعد النبي صلى الله عليه وسلم حتى توفي رحمه الله‏.‏",
      "text_en": " Narrated `Urwa bin Az-Zubair:                     Hakim bin Hizam said, \"I asked Allah's Apostle for something, and he gave me, and I asked him again and he gave me and said, 'O Hakim! This wealth is green and sweet (i.e. as tempting as fruits), and whoever takes it without greed then he is blessed in it, and whoever takes it with greediness, he is not blessed in it and he is like one who eats and never gets satisfied. The upper (i.e. giving) hand is better than the lower (i.e. taking) hand.\" Hakim added, \"I said, O Allah's Apostle! By Him Who has sent you with the Truth I will never demand anything from anybody after you till I die.\" Afterwards Abu Bakr used to call Hakim to give him something but he refused to accept anything from him. Then `Umar called him to give him (something) but he refused. Then `Umar said, \"O Muslims! I offered to him (i.e. Hakim) his share which Allah has ordained for him from this booty and he refuses to take it.\" Thus Hakim did not ask anybody for anything after the Prophet, till he died--may Allah bestow His mercy upon him.",
      "chain": [
        "30388",
        "20024",
        "11013",
        "11002",
        "10511",
        "423"
      ]
    },
    {
      "hadith_no": "2902",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أحمد بن محمد، أخبرنا عبد الله، أخبرنا الأوزاعي، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك  رضى الله عنه  قال كان أبو طلحة يتترس مع النبي صلى الله عليه وسلم بترس واحد، وكان أبو طلحة حسن الرمى، فكان إذا رمى تشرف النبي صلى الله عليه وسلم فينظر إلى موضع نبله‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Abu Talha and the Prophet used to shield themselves with one shield. Abu Talha was a good archer, and when he threw (his arrows) the Prophet would look at the target of his arrows.",
      "chain": [
        "30304",
        "20025",
        "20024",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "2909",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أحمد بن محمد، أخبرنا عبد الله، أخبرنا الأوزاعي، قال سمعت سليمان بن حبيب، قال سمعت أبا أمامة، يقول لقد فتح الفتوح قوم ما كانت حلية سيوفهم الذهب ولا الفضة، إنما كانت حليتهم العلابي والآنك والحديد‏.‏",
      "text_en": " Narrated Abu Umama:                     Some people conquered many countries and their swords were decorated neither with gold nor silver, but they were decorated with leather, lead and iron.",
      "chain": [
        "30304",
        "20025",
        "20024",
        "11692",
        "4048"
      ]
    },
    {
      "hadith_no": "3143",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا الأوزاعي، عن الزهري، عن سعيد بن المسيب، وعروة بن الزبير، أن حكيم بن حزام  رضى الله عنه  قال سألت رسول الله صلى الله عليه وسلم فأعطاني، ثم سألته فأعطاني، ثم قال لي ‏\"‏ يا حكيم، إن هذا المال خضر حلو، فمن أخذه بسخاوة نفس بورك له فيه، ومن أخذه بإشراف نفس لم يبارك له فيه، وكان كالذي يأكل ولا يشبع، واليد العليا خير من اليد السفلى ‏\"‏‏.‏ قال حكيم فقلت يا رسول الله، والذي بعثك بالحق لا أرزأ أحدا بعدك شيئا حتى أفارق الدنيا‏.‏ فكان أبو بكر يدعو حكيما ليعطيه العطاء، فيأبى أن يقبل منه شيئا، ثم إن عمر دعاه ليعطيه فأبى أن يقبل فقال يا معشر المسلمين، إني أعرض عليه حقه الذي قسم الله له من هذا الفىء، فيأبى أن يأخذه‏.‏ فلم يرزأ حكيم أحدا من الناس بعد النبي صلى الله عليه وسلم حتى توفي‏.‏",
      "text_en": " Narrated `Urwa bin Az-Zubair:                     Hakim bin Hizam said, \"I asked Allah's Apostle for something, and he gave me. I asked him again, and he gave me, and said to me. 'O Hakim! This wealth is like green sweet (i.e. fruit), and if one takes it without greed, then one is blessed in it, and if one takes it with greediness, then one is not blessed in it, and will be like the one who eats without satisfaction. And an upper (i.e. giving) hand is better than a lower (i.e. taking) hand,' I said, 'O Allah's Apostle! By Him Who has sent you with the Truth. I will not ask anyone for anything after you till I leave this world.\" So, when Abu Bakr during his Caliphate, called Hakim to give him (some money), Hakim refused to accept anything from him. Once `Umar called him (during his Caliphate) in order to give him something, but Hakim refused to accept it, whereupon `Umar said, \"O Muslims! I give him (i.e. Haklm) his right which Allah has assigned to him) from this Fai '(booty), but he refuses to take it.\" So Haklm never took anything from anybody after the Prophet till he died.",
      "chain": [
        "30388",
        "20024",
        "11013",
        "11002",
        "10511",
        "423"
      ]
    },
    {
      "hadith_no": "3285",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمد بن يوسف، حدثنا الأوزاعي، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ إذا نودي بالصلاة أدبر الشيطان وله ضراط، فإذا قضي أقبل، فإذا ثوب بها أدبر، فإذا قضي أقبل، حتى يخطر بين الإنسان وقلبه، فيقول اذكر كذا وكذا‏.‏ حتى لا يدري أثلاثا صلى أم أربعا فإذا لم يدر ثلاثا صلى أو أربعا سجد سجدتى السهو ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"When the call for the prayer is pronounced, Satan takes to his heels, passing wind with noise, When the call for the prayer is finished, he comes back. And when the Iqama is pronounced, he again takes to his heels, and after its completion, he returns again to interfere between the (praying) person and his heart, saying to him. 'Remember this or that thing.' till the person forgets whether he has offered three or four rak`at: so if one forgets whether he has prayed three or four rak`at, he should perform two prostrations of Sahu (i.e. forgetfulness).",
      "chain": [
        "30388",
        "20024",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3292",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا أبو المغيرة، حدثنا الأوزاعي، قال حدثني يحيى، عن عبد الله بن أبي قتادة، عن أبيه، عن النبي صلى الله عليه وسلم‏.‏ حدثني سليمان بن عبد الرحمن، حدثنا الوليد، حدثنا الأوزاعي، قال حدثني يحيى بن أبي كثير، قال حدثني عبد الله بن أبي قتادة، عن أبيه، قال قال النبي صلى الله عليه وسلم ‏\"‏ الرؤيا الصالحة من الله، والحلم من الشيطان فإذا حلم أحدكم حلما يخافه فليبصق عن يساره، وليتعوذ بالله من شرها، فإنها لا تضره ‏\"‏‏.‏",
      "text_en": " Narrated Abu Qatada:                     as below.Narrated Abu Qatada:The Prophet said, \"A good dream is from Allah, and a bad or evil dream is from Satan; so if anyone of you has a bad dream of which he gets afraid, he should spit on his left side and should seek Refuge with Allah from its evil, for then it will not harm him.\"",
      "chain": [
        "20442",
        "20024",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "3435",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا صدقة بن الفضل، حدثنا الوليد، عن الأوزاعي، قال حدثني عمير بن هانئ، قال حدثني جنادة بن أبي أمية، عن عبادة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من شهد أن لا إله إلا الله وحده لا شريك له، وأن محمدا عبده ورسوله، وأن عيسى عبد الله ورسوله وكلمته، ألقاها إلى مريم، وروح منه، والجنة حق والنار حق، أدخله الله الجنة على ما كان من العمل ‏\"‏‏.‏ قال الوليد حدثني ابن جابر عن عمير عن جنادة وزاد ‏\"‏ من أبواب الجنة الثمانية، أيها شاء ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubada:                     The Prophet said, \"If anyone testifies that None has the right to be worshipped but Allah Alone Who has no partners, and that Muhammad is His Slave and His Apostle, and that Jesus is Allah's Slave and His Apostle and His Word which He bestowed on Mary and a Spirit created by Him, and that Paradise is true, and Hell is true, Allah will admit him into Paradise with the deeds which he had done even if those deeds were few.\" (Junada, the sub-narrator said, \" 'Ubada added, 'Such a person can enter Paradise through any of its eight gates he likes.\")",
      "chain": [
        "30343",
        "20733",
        "20024",
        "11415",
        "3205"
      ]
    },
    {
      "hadith_no": "3461",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا أبو عاصم الضحاك بن مخلد، أخبرنا الأوزاعي، حدثنا حسان بن عطية، عن أبي كبشة، عن عبد الله بن عمرو، أن النبي صلى الله عليه وسلم قال ‏\"‏ بلغوا عني ولو آية، وحدثوا عن بني إسرائيل ولا حرج، ومن كذب على متعمدا فليتبوأ مقعده من النار ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     The Prophet said, \"Convey (my teachings) to the people even if it were a single sentence, and tell others the stories of Bani Israel (which have been taught to you), for it is not sinful to do so. And whoever tells a lie on me intentionally, will surely take his place in the (Hell) Fire.\"",
      "chain": [
        "20241",
        "20024",
        "11413",
        "5371",
        "29"
      ]
    },
    {
      "hadith_no": "3722",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني محمد بن يزيد الكوفي، حدثنا الوليد، عن الأوزاعي، عن يحيى بن أبي كثير، عن محمد بن إبراهيم، عن عروة بن الزبير، قال سألت عبد الله بن عمرو عن أشد، ما صنع المشركون برسول الله صلى الله عليه وسلم قال رأيت عقبة بن أبي معيط جاء إلى النبي صلى الله عليه وسلم وهو يصلي، فوضع رداءه في عنقه فخنقه به خنقا شديدا، فجاء أبو بكر حتى دفعه عنه فقال أتقتلون رجلا أن يقول ربي الله‏.‏ وقد جاءكم بالبينات من ربكم‏.‏",
      "text_en": " Narrated `Urwa bin Az-Zubair:                     I asked `Abdullah bin `Amr, \"What was the worst thing the pagans did to Allah's Apostle?\" He said, \"I saw `Uqba bin Abi Mu'ait coming to the Prophet while he was praying.' `Uqba put his sheet round the Prophet's neck and squeezed it very severely. Abu Bakr came and pulled `Uqba away from the Prophet and said, \"Do you intend to kill a man just because he says: 'My Lord is Allah, and he has brought forth to you the Evident Signs from your Lord?\"",
      "chain": [
        "34204",
        "20733",
        "20024",
        "11449",
        "11213",
        "10511",
        "29"
      ]
    },
    {
      "hadith_no": "3904",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا عياش بن الوليد، حدثنا الوليد بن مسلم، حدثني الأوزاعي، حدثني يحيى بن أبي كثير، عن محمد بن إبراهيم التيمي، قال حدثني عروة بن الزبير، قال سألت ابن عمرو بن العاص أخبرني بأشد، شىء صنعه المشركون بالنبي صلى الله عليه وسلم قال بينا النبي صلى الله عليه وسلم يصلي في حجر الكعبة إذ أقبل عقبة بن أبي معيط، فوضع ثوبه في عنقه فخنقه خنقا شديدا، فأقبل أبو بكر حتى أخذ بمنكبه ودفعه عن النبي صلى الله عليه وسلم قال ‏{‏أتقتلون رجلا أن يقول ربي الله‏}‏ الآية‏.‏ تابعه ابن إسحاق حدثني يحيى بن عروة عن عروة، قلت لعبد الله بن عمرو‏.‏ وقال عبدة عن هشام عن أبيه قيل لعمرو بن العاص‏.‏ وقال محمد بن عمرو عن أبي سلمة حدثني عمرو بن العاص‏.‏",
      "text_en": " Narrated `Urwa bin Az-Zubair:                     I asked Ibn `Amr bin Al-As, \"Tell me of the worst thing which the pagans did to the Prophet.\" He said, \"While the Prophet was praying in the Hijr of the Ka`ba; `Uqba bin Abi Mu'ait came and put his garment around the Prophet's neck and throttled him violently. Abu Bakr came and caught him by his shoulder and pushed him away from the Prophet and said, \"Do you want to kill a man just because he says, 'My Lord is Allah?' \"",
      "chain": [
        "30157",
        "20733",
        "20024",
        "11449",
        "11213",
        "10511",
        "29"
      ]
    },
    {
      "hadith_no": "3947",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني إسحاق بن يزيد الدمشقي، حدثنا يحيى بن حمزة، قال حدثني أبو عمرو الأوزاعي، عن عبدة بن أبي لبابة، عن مجاهد بن جبر المكي، أن عبد الله بن عمر  رضى الله عنهما  كان يقول لا هجرة بعد الفتح‏.‏",
      "text_en": " Narrated Mujahid bin Jabir Al-Makki:                     `Abdullah bin `Umar used to say, \"There is no more Hijrah (i.e. migration) after the Conquest of Mecca.\"",
      "chain": [
        "20402",
        "20024",
        "10793",
        "11028",
        "18"
      ]
    },
    {
      "hadith_no": "3948",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "وحدثني الأوزاعي، عن عطاء بن أبي رباح، قال زرت عائشة مع عبيد بن عمير الليثي فسألناها عن الهجرة، فقالت لا هجرة اليوم، كان المؤمنون يفر أحدهم بدينه إلى الله تعالى وإلى رسوله صلى الله عليه وسلم مخافة أن يفتن عليه، فأما اليوم فقد أظهر الله الإسلام، واليوم يعبد ربه حيث شاء، ولكن جهاد ونية‏.‏",
      "text_en": " Narrated 'Ata bin Abi Rabah:                     `Ubaid bin `Umar Al-Laithi and I visited Aisha and asked her about the Hijra (i.e. migration), and she said, \"Today there is no (Hijrah) emigration. A believer used to run away with his religion to Allah and His Apostle lest he should be put to trial because of his religion. Today Allah has made Islam triumphant, and today a believer can worship his Lord wherever he likes. But the deeds that are still rewardable (in place of emigration) are Jihad and good intentions.\" (See Hadith No. 42 Vol. 4).",
      "chain": [
        "20024",
        "11029"
      ]
    },
    {
      "hadith_no": "3968",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "وقال دحيم حدثنا الوليد، حدثنا الأوزاعي، حدثني أبو عبيد، عن عقبة بن وساج، حدثني أنس بن مالك  رضى الله عنه  قال قدم النبي صلى الله عليه وسلم المدينة، فكان أسن أصحابه أبو بكر، فغلفها بالحناء والكتم حتى قنأ لونها‏.‏",
      "text_en": "",
      "chain": [
        "30285",
        "20733",
        "20024",
        "36618",
        "19"
      ]
    },
    {
      "hadith_no": "3971",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا الوليد بن مسلم، حدثنا الأوزاعي،‏.‏ وقال محمد بن يوسف حدثنا الأوزاعي، حدثنا الزهري، قال حدثني عطاء بن يزيد الليثي، قال حدثني أبو سعيد  رضى الله عنه  قال جاء أعرابي إلى النبي صلى الله عليه وسلم فسأله عن الهجرة فقال ‏\"‏ ويحك إن الهجرة شأنها شديد، فهل لك من إبل ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فتعطي صدقتها ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فهل تمنح منها ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فتحلبها يوم ورودها ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فاعمل من وراء البحار، فإن الله لن يترك من عملك شيئا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     Once a bedouin came to the Prophet and asked him about the migration. The Prophet said, \"Mercy of Allah be on you! The migration is a quite difficult matter. Have you got some camels?\" He replied in the affirmative. Then the Prophet said, \"Do you give their Zakat?\" He replied in the affirmative. The Prophet said, \"Do you let others benefit by their milk gratis?\" He replied in the affirmative. Then the Prophet asked, \"Do you milk them on their watering days and give their milk to the poor and needy?\" He replied in the affirmative. The Prophet, said, \"Go on doing like this from beyond the seas, and there is no doubt that Allah will not overlook any of your good deeds.\"",
      "chain": [
        "30026",
        "20733",
        "20024",
        "30388",
        "20024",
        "11013",
        "11206",
        "38"
      ]
    },
    {
      "hadith_no": "4356",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق بن يزيد، حدثنا يحيى بن حمزة، قال حدثني أبو عمرو الأوزاعي، عن عبدة بن أبي لبابة، عن مجاهد بن جبر المكي، أن عبد الله بن عمر  رضى الله عنهما  كان يقول لا هجرة بعد الفتح‏.‏",
      "text_en": " Narrated Mujahid bin Jabr:                     `Abdullah bin `Umar used to say, \"There is no migration after the Conquest (of Mecca).",
      "chain": [
        "20402",
        "20024",
        "10793",
        "11028",
        "18"
      ]
    }
  ],
  "total_hadiths": 403
}