{
  "id": "20022",
  "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
  "full_name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "biography": {
    "birth": {
      "date_hijri": "98",
      "date_gregorian": "NA",
      "date_display": [
        "98 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "179",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة ثبت ]",
      "Fiqh",
      "Hadith"
    ],
    "tags": [
      "al-Azdi",
      "al-Jahdami",
      "Client",
      "Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "20543",
      "name": "Sa'id bin Zayd bin Darham سعيد بن زيد بن درهم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "11269",
      "name": "Thabit bin Aslam Albanani ثابت بن أسلم البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11038",
      "name": "Anas bin Sirin أنس بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11295",
      "name": "'Abdul 'Aziz bin Suhaib عبد العزيز بن صهيب البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11216",
      "name": "Muhammad bin Ziyad محمد بن زياد القرشي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11309",
      "name": "Nasr bin 'Imran bin Isam نصر بن عمران بن عصام",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11580",
      "name": "al-J'd bin Dinar al-Yshkry الجعد بن دينار اليشكري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11172",
      "name": "Abu Hazim, Salma bin Dinar سلمة بن دينار أبو حازم الأعرج",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11596",
      "name": "Shu'iab bin al-Habhab al-Azdi شعيب بن الحبحاب الأزدي المعولي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11176",
      "name": "Salah bin Kaysan al-Madni صالح بن كيسان المدني أبو محمد",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11703",
      "name": "'Abdul Hameed bin Dinar al-Ziyadi عبد الحميد بن دينار صاحب الزيادي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11296",
      "name": "Abu 'Imran al-Jauni عبد الملك بن حبيب أبو عمران الجوني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11081",
      "name": "'Amr bin Dinar عمرو بن دينار الأثرم الجمحي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11667",
      "name": "Ibrahim bin Abi Ablh إبراهيم بن أبي عبلة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20285",
      "name": "Muslim bin Ibrahim al-Azdy مسلم بن إبراهيم الأزدي الفراهيدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20283",
      "name": "Muhammad bin al-Fadl 'Aram محمد بن الفضل السدوسي أبو النعمان عارم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30175",
      "name": "Masdad bin Masrhad مسدد بن مسرهد بن مسربل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "23066",
      "name": "Mu'ml bin Isma'il al-Dwy Mwla مؤمل بن إسماعيل العدوي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20193",
      "name": "Sulaiman bin Harb سليمان بن حرب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30106",
      "name": "'Affan bin Muslim عفان بن مسلم بن عبد الله الصفار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "33021",
      "name": "Muhammad bin Znbwr محمد بن زنبور",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30121",
      "name": "Ahmed bin al-Miqdam أحمد بن المقدام",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "31",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الرحمن بن المبارك، حدثنا حماد بن زيد، حدثنا أيوب، ويونس، عن الحسن، عن الأحنف بن قيس، قال ذهبت لأنصر هذا الرجل، فلقيني أبو بكرة فقال أين تريد قلت أنصر هذا الرجل‏.‏ قال ارجع فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا التقى المسلمان بسيفيهما فالقاتل والمقتول في النار ‏\"‏‏.‏ فقلت يا رسول الله هذا القاتل فما بال المقتول قال ‏\"‏ إنه كان حريصا على قتل صاحبه ‏\"‏‏.‏",
      "text_en": "      Narrated Al-Ahnaf bin Qais:                          While I was going to help this man ('Ali Ibn Abi Talib), Abu Bakra met     me and asked, \"Where are you going?\" I replied, \"I am going to help      that person.\" He said, \"Go back for I have heard Allah's Apostle      saying, 'When two Muslims fight (meet) each other with their swords,      both the murderer as well as the murdered will go to the Hell-fire.' I     said, 'O Allah's Apostle! It is all right for the murderer but what      about the murdered one?' Allah's Apostle replied, \"He surely had the      intention to kill his companion.\"",
      "chain": [
        "30147",
        "20022",
        "11015",
        "11075",
        "11016",
        "11112",
        "3229"
      ]
    },
    {
      "hadith_no": "105",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، قال حدثنا حماد، عن أيوب، عن محمد، عن ابن أبي بكرة، عن أبي بكرة، ذكر النبي صلى الله عليه وسلم قال ‏\"‏ فإن دماءكم وأموالكم  قال محمد وأحسبه قال وأعراضكم  عليكم حرام كحرمة يومكم هذا في شهركم هذا، ألا ليبلغ الشاهد منكم الغائب ‏\"‏‏.‏ وكان محمد يقول صدق رسول الله صلى الله عليه وسلم كان ذلك ‏\"‏ ألا هل بلغت ‏\"‏ مرتين‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet said. No doubt your blood, property, the sub-narrator Muhammad thought that Abu Bakra had also mentioned and your honor (chastity), are sacred to one another as is the sanctity of this day of yours in this month of yours. It is incumbent on those who are present to inform those who are absent.\" (Muhammad the Sub-narrator used to say, \"Allah's Apostle told the truth.\") The Prophet repeated twice: \"No doubt! Haven't I conveyed Allah's message to you.",
      "chain": [
        "30143",
        "20022",
        "11015",
        "11035",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "200",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا مسدد، قال حدثنا حماد، عن ثابت، عن أنس، أن النبي صلى الله عليه وسلم دعا بإناء من ماء، فأتي بقدح رحراح فيه شىء من ماء، فوضع أصابعه فيه‏.‏ قال أنس فجعلت أنظر إلى الماء ينبع من بين أصابعه، قال أنس فحزرت من توضأ ما بين السبعين إلى الثمانين‏.‏",
      "text_en": " Narrated Thabit:                     Anas said, \"The Prophet asked for water and a tumbler with a broad base and no so deep, containing a small quantity of water, was brought to him whereby he put his fingers in it.\" Anas further said, ' noticed the water springing out from amongst his fingers.\" Anas added, ' estimated that the people who performed ablution with it numbered between seventy to eighty.\"",
      "chain": [
        "30175",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "233",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن أنس، قال قدم أناس من عكل أو عرينة، فاجتووا المدينة، فأمرهم النبي صلى الله عليه وسلم بلقاح، وأن يشربوا من أبوالها وألبانها، فانطلقوا، فلما صحوا قتلوا راعي النبي صلى الله عليه وسلم واستاقوا النعم، فجاء الخبر في أول النهار، فبعث في آثارهم، فلما ارتفع النهار جيء بهم، فأمر فقطع أيديهم وأرجلهم، وسمرت أعينهم، وألقوا في الحرة يستسقون فلا يسقون‏.‏ قال أبو قلابة فهؤلاء سرقوا وقتلوا وكفروا بعد إيمانهم، وحاربوا الله ورسوله‏.‏",
      "text_en": " Narrated Abu Qilaba:                     Anas said, \"Some people of `Ukl or `Uraina tribe came to Medina and its climate did not suit them. So the Prophet ordered them to go to the herd of (Milch) camels and to drink their milk and urine (as a medicine). So they went as directed and after they became healthy, they killed the shepherd of the Prophet and drove away all the camels. The news reached the Prophet early in the morning and he sent (men) in their pursuit and they were captured and brought at noon. He then ordered to cut their hands and feet (and it was done), and their eyes were branded with heated pieces of iron, They were put in 'Al-Harra' and when they asked for water, no water was given to them.\" Abu Qilaba said, \"Those people committed theft and murder, became infidels after embracing Islam and fought against Allah and His Apostle .\"",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "244",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا حماد بن زيد، عن غيلان بن جرير، عن أبي بردة، عن أبيه، قال أتيت النبي صلى الله عليه وسلم فوجدته يستن بسواك بيده يقول ‏\"‏ أع أع ‏\"‏، والسواك في فيه، كأنه يتهوع‏.‏",
      "text_en": " Narrated Abu Burda:                     My father said, \"I came to the Prophet and saw him carrying a Siwak in his hand and cleansing his teeth, saying, 'U' U',\" as if he was retching while the Siwak was in his mouth.\"",
      "chain": [
        "20283",
        "20022",
        "11300",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "262",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا مسدد، قال حدثنا حماد، عن هشام، عن أبيه، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا اغتسل من الجنابة غسل يده‏.‏",
      "text_en": " Narrated `Aisha:                     Whenever Allah's Apostle took a bath of Janaba, he washed his hands first.",
      "chain": [
        "30175",
        "20022",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "313",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، قال حدثنا حماد بن زيد، عن أيوب، عن حفصة  قال أبو عبد الله أو هشام بن حسان عن حفصة، عن أم عطية  قالت كنا ننهى أن نحد على ميت فوق ثلاث، إلا على زوج أربعة أشهر وعشرا، ولا نكتحل ولا نتطيب ولا نلبس ثوبا مصبوغا إلا ثوب عصب، وقد رخص لنا عند الطهر إذا اغتسلت إحدانا من محيضها في نبذة من كست أظفار، وكنا ننهى عن اتباع الجنائز‏.‏ قال رواه هشام بن حسان عن حفصة عن أم عطية عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Um-`Atiya:                     We were forbidden to mourn for a dead person for more than three days except in the case of a husband for whom mourning was allowed for four months and ten days. (During that time) we were not allowed to put kohl (Antimony eye power) in our eyes or to use perfumes or to put on colored clothes except a dress made of `Asr (a kind of Yemen cloth, very coarse and rough). We were allowed very light perfumes at the time of taking a bath after menses and also we were forbidden to go with the funeral procession .",
      "chain": [
        "30143",
        "20022",
        "11015",
        "11039",
        "11311",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "318",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا مسدد، قال حدثنا حماد، عن عبيد الله بن أبي بكر، عن أنس بن مالك، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله  عز وجل  وكل بالرحم ملكا يقول يا رب نطفة، يا رب علقة، يا رب مضغة‏.‏ فإذا أراد أن يقضي خلقه قال أذكر أم أنثى شقي أم سعيد فما الرزق والأجل فيكتب في بطن أمه ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"At every womb Allah appoints an angel who says, 'O Lord! A drop of semen, O Lord! A clot. O Lord! A little lump of flesh.\" Then if Allah wishes (to complete) its creation, the angel asks, (O Lord!) Will it be a male or female, a wretched or a blessed, and how much will his provision be? And what will his age be?' So all that is written while the child is still in the mother's womb.\"",
      "chain": [
        "30175",
        "20022",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "365",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، عن محمد، عن أبي هريرة، قال قام رجل إلى النبي صلى الله عليه وسلم فسأله عن الصلاة في الثوب الواحد فقال ‏\"‏ أوكلكم يجد ثوبين ‏\"‏‏.‏ ثم سأل رجل عمر فقال إذا وسع الله فأوسعوا، جمع رجل عليه ثيابه، صلى رجل في إزار ورداء، في إزار وقميص، في إزار وقباء، في سراويل ورداء، في سراويل وقميص، في سراويل وقباء، في تبان وقباء، في تبان وقميص  قال وأحسبه قال  في تبان ورداء‏.‏",
      "text_en": " Narrated Abu Huraira:                     A man stood up and asked the Prophet about praying in a single garment. The Prophet said, \"Has every one of you two garments?\" A man put a similar question to `Umar on which he replied, \"When Allah makes you wealthier then you should clothe yourself properly during prayers. Otherwise one can pray with an Izar and a Rida' (a sheet covering the upper part of the body.) Izar and a shirt, Izar and a Qaba', trousers and a Rida, trousers and a shirt or trousers and a Qaba', Tubban and a Qaba' or Tubban and a shirt.\" (The narrator added, \"I think that he also said a Tubban and a Rida. \")",
      "chain": [
        "20193",
        "20022",
        "11015",
        "20278",
        "13"
      ]
    },
    {
      "hadith_no": "458",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن ثابت، عن أبي رافع، عن أبي هريرة، أن رجلا، أسود  أو امرأة سوداء  كان يقم المسجد، فمات، فسأل النبي صلى الله عليه وسلم عنه فقالوا مات‏.‏ قال ‏\"‏ أفلا كنتم آذنتموني به دلوني على قبره ‏\"‏‏.‏  أو قال قبرها  فأتى قبره فصلى عليه‏.‏",
      "text_en": " Narrated Abu Huraira:                     A black man or a black woman used to sweep the mosque and he or she died. The Prophet asked about her (or him). He was told that she (or he) had died. He said, \"Why did you not inform me? Show me his grave (or her grave).\" So he went to her (his) grave and offered her (his) funeral prayer.\"",
      "chain": [
        "20193",
        "20022",
        "11269",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "460",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن واقد، قال حدثنا حماد، عن ثابت، عن أبي رافع، عن أبي هريرة، أن امرأة  أو رجلا  كانت تقم المسجد  ولا أراه إلا امرأة  فذكر حديث النبي صلى الله عليه وسلم أنه صلى على قبره‏.‏",
      "text_en": "      Narrated Abu Rafi:                          Abu Huraira said, \"A man or a woman used to clean the mosque.\" (A      sub-narrator said, 'Most probably a woman..') Then he narrated the      Hadith of the Prophet",
      "chain": [
        "20022",
        "11269",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "468",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو النعمان، وقتيبة، قالا حدثنا حماد، عن أيوب، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم قدم مكة، فدعا عثمان بن طلحة، ففتح الباب، فدخل النبي صلى الله عليه وسلم وبلال وأسامة بن زيد وعثمان بن طلحة، ثم أغلق الباب، فلبث فيه ساعة ثم خرجوا‏.‏ قال ابن عمر فبدرت فسألت بلالا فقال صلى فيه‏.‏ فقلت في أى قال بين الأسطوانتين‏.‏ قال ابن عمر فذهب على أن أسأله كم صلى‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar said, \"The Prophet arrived at Mecca and sent for `Uthman bin Talha. He opened the gate of the Ka`ba and the Prophet, Bilal, Usama bin Zaid and `Uthman bin Talha entered the Ka`ba and then they closed its door (from inside). They stayed there for an hour, and then came out.\" Ibn `Umar added, \"I quickly went to Bilal and asked him (whether the Prophet had prayed). Bilal replied, 'He prayed in it.' I asked, 'Where?' He replied, 'Between the two pillars.' \"Ibn `Umar added, \"I forgot to ask how many rak`at he (the Prophet) had prayed in the Ka`ba.\"",
      "chain": [
        "20283",
        "30367",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "473",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا حماد، عن أيوب، عن نافع، عن ابن عمر، أن رجلا، جاء إلى النبي صلى الله عليه وسلم وهو يخطب فقال كيف صلاة الليل فقال ‏\"‏ مثنى مثنى، فإذا خشيت الصبح فأوتر بواحدة، توتر لك ما قد صليت ‏\"‏‏.‏ قال الوليد بن كثير حدثني عبيد الله بن عبد الله أن ابن عمر حدثهم أن رجلا نادى النبي صلى الله عليه وسلم وهو في المسجد‏.‏",
      "text_en": " Narrated Ibn `Umar:                     A man came to the Prophet while he was delivering the sermon and asked him how to offer the night prayers. The Prophet replied, 'Pray two rak`at at a time and then two and then two and so on and if you are afraid of dawn (the approach of the time of the Fajr prayer) pray one rak`a and that will be the with for all the rak`at which you have prayed.\" Narrated 'Ubaidullah bin `Abdullah bin `Umar: A man called the Prophet while he was in the mosque.",
      "chain": [
        "20283",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "543",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا حماد  هو ابن زيد  عن عمرو بن دينار، عن جابر بن زيد، عن ابن عباس، أن النبي صلى الله عليه وسلم صلى بالمدينة سبعا وثمانيا الظهر والعصر، والمغرب والعشاء‏.‏ فقال أيوب لعله في ليلة مطيرة‏.‏ قال عسى‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     \"The Prophet prayed eight rak`at for the Zuhr and `Asr, and seven for the Maghrib and `Isha prayers in Medina.\" Aiyub said, \"Perhaps those were rainy nights.\" Anas said, \"May be.\"",
      "chain": [
        "20283",
        "20022",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "589",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن أيوب، عن نافع، عن ابن عمر، قال أصلي كما رأيت أصحابي يصلون، لا أنهى أحدا يصلي بليل ولا نهار ما شاء، غير أن لا تحروا طلوع الشمس ولا غروبها‏.‏",
      "text_en": " Narrated Ibn `Umar:                     I pray as I saw my companions praying. I do not forbid praying at any time during the day or night except at sunset and sunrise.",
      "chain": [
        "20283",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "605",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن سماك بن عطية، عن أيوب، عن أبي قلابة، عن أنس، قال أمر بلال أن يشفع، الأذان وأن يوتر الإقامة إلا الإقامة‏.‏",
      "text_en": " Narrated Anas:                     Bilal was ordered to repeat the wording of the Adhan for prayers twice, and to pronounce the wording of the Iqama once except \"Qad-qamat-is-salat\".",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "616",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسدد، قال حدثنا حماد، عن أيوب، وعبد الحميد، صاحب الزيادي وعاصم الأحول عن عبد الله بن الحارث قال خطبنا ابن عباس في يوم ردغ، فلما بلغ المؤذن حى على الصلاة‏.‏ فأمره أن ينادي الصلاة في الرحال‏.‏ فنظر القوم بعضهم إلى بعض فقال فعل هذا من هو خير منه وإنها عزمة‏.‏",
      "text_en": " Narrated `Abdullah bin Al-Harith:                     Once on a rainy muddy day, Ibn `Abbas delivered a sermon in our presence and when the Mu'adhdhin pronounced the Adhan and said, \"Haiyi `ala-s-sala(t) (come for the prayer)\" Ibn `Abbas ordered him to say 'Pray at your homes.' The people began to look at each other (surprisingly). Ibn `Abbas said. \"It was done by one who was much better than I (i.e. the Prophet or his Mu'adh-dhin), and it is a license.'",
      "chain": [
        "30175",
        "20022",
        "11015",
        "912"
      ]
    },
    {
      "hadith_no": "668",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، قال حدثنا حماد بن زيد، قال حدثنا عبد الحميد، صاحب الزيادي قال سمعت عبد الله بن الحارث، قال خطبنا ابن عباس في يوم ذي ردغ، فأمر المؤذن لما بلغ حى على الصلاة‏.‏ قال قل الصلاة في الرحال، فنظر بعضهم إلى بعض، فكأنهم أنكروا فقال كأنكم أنكرتم هذا إن هذا فعله من هو خير مني  يعني النبي صلى الله عليه وسلم  إنها عزمة، وإني كرهت أن أحرجكم‏.‏ وعن حماد عن عاصم عن عبد الله بن الحارث عن ابن عباس نحوه، غير أنه قال كرهت أن أؤثمكم، فتجيئون تدوسون الطين إلى ركبكم‏.‏",
      "text_en": " Narrated `Abdullah bin Al-Harith:                     Ibn `Abbas addressed us on a (rainy and) muddy day and when the Mu'adh-dhin said, \"Come for the prayer\" Ibn `Abbas ordered him to say, \"Pray in your homes.\" The people began to look at one another with surprise as if they did not like it. Ibn `Abbas said, \"It seems that you thought ill of it but no doubt it was done by one who was better than I (i.e. the Prophet). It (the prayer) is a strict order and I disliked to bring you out.\" Ibn `Abbas narrated the same as above but he said, \"I did not like you to make you sinful (in refraining from coming to the mosque) and to come (to the mosque) covered with mud up to the knees.\"",
      "chain": [
        "30143",
        "20022",
        "11703",
        "912"
      ]
    },
    {
      "hadith_no": "685",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن مالك بن الحويرث، قال قدمنا على النبي صلى الله عليه وسلم ونحن شببة، فلبثنا عنده نحوا من عشرين ليلة، وكان النبي صلى الله عليه وسلم رحيما فقال ‏\"‏ لو رجعتم إلى بلادكم فعلمتموهم، مروهم فليصلوا صلاة كذا في حين كذا، وصلاة كذا في حين كذا، وإذا حضرت الصلاة فليؤذن لكم أحدكم، وليؤمكم أكبركم ‏\"‏‏.‏",
      "text_en": " Narrated Malik bin Huwairith:                     We went to the Prophet and we were all young men and stayed with him for about twenty nights. The Prophet was very merciful. He said, \"When you return home, impart religious teachings to your families and tell them to offer perfectly such and such a prayer at such and such a time and such and such a prayer at such and such a time. And al the time of the prayer one of you should pronounce the Adhan and the oldest of you should lead the prayer.\"",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "711",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، وأبو النعمان، قالا حدثنا حماد بن زيد، عن أيوب، عن عمرو بن دينار، عن جابر، قال كان معاذ يصلي مع النبي صلى الله عليه وسلم ثم يأتي قومه فيصلي بهم‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Mu`adh used to pray with the Prophet and then go and lead his people (tribe) in the prayer.",
      "chain": [
        "20193",
        "20283",
        "20022",
        "11015",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "786",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا حماد، عن غيلان بن جرير، عن مطرف بن عبد الله، قال صليت خلف علي بن أبي طالب  رضى الله عنه  أنا وعمران بن حصين،، فكان إذا سجد كبر، وإذا رفع رأسه كبر، وإذا نهض من الركعتين كبر، فلما قضى الصلاة أخذ بيدي عمران بن حصين فقال قد ذكرني هذا صلاة محمد صلى الله عليه وسلم‏.‏ أو قال لقد صلى بنا صلاة محمد صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Mutarrif bin `Abdullah:                     `Imran bin Husain and I offered the prayer behind `Ali bin Abi Talib. When `Ali prostrated, he said the Takbir, when he raised his head, he said the Takbir and when he got up for the third rak`a he said the Takbir. On completion of the prayer `Imran took my hand and said, \"This (i.e. `Ali) made me remember the prayer of Muhammad\" Or he said, \"He led us in a prayer like that of Muhammad.\"",
      "chain": [
        "20283",
        "20022",
        "11300",
        "11305"
      ]
    },
    {
      "hadith_no": "802",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، قال كان مالك بن الحويرث يرينا كيف كان صلاة النبي صلى الله عليه وسلم وذاك في غير وقت صلاة، فقام فأمكن القيام، ثم ركع فأمكن الركوع، ثم رفع رأسه فأنصت هنية، قال فصلى بنا صلاة شيخنا هذا أبي بريد‏.‏ وكان أبو بريد إذا رفع رأسه من السجدة الآخرة استوى قاعدا ثم نهض‏.‏",
      "text_en": " Narrated Aiyub:                     Abu Qilaba said, \"Malik bin Huwairith used to demonstrate to us the prayer of the Prophet at times other than that of the compulsory prayers. So (once) he stood up for prayer and performed a perfect Qiyam (standing and reciting from the Holy Qur'an) and then bowed and performed bowing perfectly; then he raised his head and stood straight for a while.\" Abu Qilaba added, \"Malik bin Huwairith in that demonstration prayed like this Sheikh of ours, Abu Yazid.\" Abu, Yazid used to sit (for a while) on raising his head from the second prostration before getting up.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "815",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا حماد  وهو ابن زيد  عن عمرو بن دينار، عن طاوس، عن ابن عباس، قال أمر النبي صلى الله عليه وسلم أن يسجد على سبعة أعظم، ولا يكف ثوبه ولا شعره‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet was ordered to prostrate on seven bony parts and not to tuck up his clothes or hair.",
      "chain": [
        "20283",
        "20022",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "819",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا حماد، عن أيوب، عن أبي قلابة، أن مالك بن الحويرث، قال لأصحابه ألا أنبئكم صلاة رسول الله صلى الله عليه وسلم قال وذاك في غير حين صلاة، فقام، ثم ركع فكبر ثم رفع رأسه، فقام هنية، ثم سجد ثم رفع رأسه هنية، فصلى صلاة عمرو بن سلمة شيخنا هذا‏.‏ قال أيوب كان يفعل شيئا لم أرهم يفعلونه، كان يقعد في الثالثة والرابعة‏.‏ قال فأتينا النبي صلى الله عليه وسلم فأقمنا عنده فقال ‏\"‏ لو رجعتم إلى أهليكم صلوا صلاة كذا في حين كذا، صلوا صلاة كذا في حين كذا، فإذا حضرت الصلاة فليؤذن أحدكم وليؤمكم أكبركم ‏\"‏",
      "text_en": " Narrated Abu Qilaba:                     Once Malik bin Huwairith said to his friends, \"Shall I show you how Allah's Apostle used to offer his prayers?\" And it was not the time for any of the compulsory congregational prayers. So he stood up (for the prayer) bowed and said the Takbir, then he raised his head and remained standing for a while and then prostrated and raised his head for a while (sat up for a while). He prayed like our Sheikh `Amr Ibn Salama. (Aiyub said, \"The latter used to do a thing which I did not see the people doing i.e. he used to sit between the third and the fourth rak`a). Malik bin Huwairith said, \"We came to the Prophet (after embracing Islam) and stayed with him. He said to us, 'When you go back to your families, pray such and such a prayer at such and such a time, pray such and such a prayer at such and such a time, and when there is the time for the prayer then only of you should pronounce the Adhan for the prayer and the oldest of you should lead the prayer.\"",
      "chain": [
        "20283",
        "20022",
        "11015",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "821",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن ثابت، عن أنس  رضى الله عنه  قال إني لا آلو أن أصلي بكم كما رأيت النبي صلى الله عليه وسلم يصلي بنا‏.‏ قال ثابت كان أنس يصنع شيئا لم أركم تصنعونه، كان إذا رفع رأسه من الركوع قام حتى يقول القائل قد نسي‏.‏ وبين السجدتين حتى يقول القائل قد نسي‏.‏",
      "text_en": " Narrated Thabit:                     Anas said, \"I will leave no stone unturned in making you offer the prayer as I have seen the Prophet making us offer it.\" Anas used to do a thing which I have not seen you doing. He used to stand after the bowing for such a long time that one would think that he had forgotten (the prostrations) and he used to sit in-between the prostrations so long that one would think that he had forgotten the second prostration.",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "826",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، قال حدثنا غيلان بن جرير، عن مطرف، قال صليت أنا وعمران، صلاة خلف علي بن أبي طالب  رضى الله عنه  فكان إذا سجد كبر، وإذا رفع كبر، وإذا نهض من الركعتين كبر، فلما سلم أخذ عمران بيدي فقال لقد صلى بنا هذا صلاة محمد صلى الله عليه وسلم‏.‏ أو قال لقد ذكرني هذا صلاة محمد صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Mutarrif:                     `Imran and I prayed behind `Ali bin Abi Talib and he said Takbir on prostrating, on rising and on getting up after the two rak`at (i.e. after the second rak`a). When the prayer was finished, `Imran took me by the hand and said, \"He (`Ali) has prayed the prayer of Muhammad\" (or said, \"He made us remember the prayer of Muhammad).",
      "chain": [
        "20193",
        "20022",
        "11300",
        "11395"
      ]
    },
    {
      "hadith_no": "930",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا حماد بن زيد، عن عمرو بن دينار، عن جابر بن عبد الله، قال جاء رجل والنبي صلى الله عليه وسلم يخطب الناس يوم الجمعة فقال ‏\"‏ أصليت يا فلان ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ قم فاركع ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     A person entered the mosque while the Prophet was delivering the Khutba on a Friday. The Prophet said to him, \"Have you prayed?\" The man replied in the negative. The Prophet said, \"Get up and pray two rak`at.\"",
      "chain": [
        "20283",
        "20022",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "932",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا مسدد، قال حدثنا حماد بن زيد، عن عبد العزيز، عن أنس،‏.‏ وعن يونس، عن ثابت، عن أنس، قال بينما النبي صلى الله عليه وسلم يخطب يوم الجمعة إذ قام رجل فقال يا رسول الله، هلك الكراع، وهلك الشاء، فادع الله أن يسقينا‏.‏ فمد يديه ودعا‏.‏",
      "text_en": " Narrated Anas:                     While the Prophet was delivering the Khutba on a Friday, a man stood up and said, \"O, Allah's Apostle! The livestock and the sheep are dying, so pray to Allah for rain.\" So he (the Prophet) raised both his hands and invoked Allah (for it).",
      "chain": [
        "30175",
        "20022",
        "11295",
        "20475",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "947",
      "source": " Sahih Bukhari ",
      "chapter": "Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "12",
      "text_ar": "حدثنا مسدد، قال حدثنا حماد، عن عبد العزيز بن صهيب، وثابت البناني، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم صلى الصبح بغلس ثم ركب فقال ‏\"‏ الله أكبر خربت خيبر، إنا إذا نزلنا بساحة قوم فساء صباح المنذرين ‏\"‏‏.‏ فخرجوا يسعون في السكك ويقولون محمد والخميس  قال والخميس الجيش  فظهر عليهم رسول الله صلى الله عليه وسلم فقتل المقاتلة وسبى الذراري، فصارت صفية لدحية الكلبي، وصارت لرسول الله صلى الله عليه وسلم ثم تزوجها وجعل صداقها عتقها‏.‏ فقال عبد العزيز لثابت يا أبا محمد، أنت سألت أنسا ما أمهرها قال أمهرها نفسها‏.‏ فتبسم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle (p.b.u.h) offered the Fajr prayer when it was still dark, then he rode and said, 'Allah Akbar! Khaibar is ruined. When we approach near to a nation, the most unfortunate is the morning of those who have been warned.\" The people came out into the streets saying, \"Muhammad and his army.\" Allah's Apostle vanquished them by force and their warriors were killed; the children and women were taken as captives. Safiya was taken by Dihya Al-Kalbi and later she belonged to Allah's Apostle go who married her and her Mahr was her manumission.",
      "chain": [
        "30175",
        "20022",
        "11295",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "974",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، قال حدثنا حماد، عن أيوب، عن محمد، عن أم عطية، قالت أمرنا أن نخرج، العواتق وذوات الخدور‏.‏ وعن أيوب عن حفصة بنحوه‏.‏ وزاد في حديث حفصة قال أو قالت العواتق وذوات الخدور، ويعتزلن الحيض المصلى‏.‏",
      "text_en": " Narrated Muhammad:                     Um 'Atiyya said: \"Our Prophet ordered us to come out (on `Id day) with the mature girls and the virgins staying in seclusion.\" Hafsa narrated the above mentioned Hadith and added, \"The mature girls or virgins staying in seclusion but the menstruating women had to keep away from the Musalla.\"",
      "chain": [
        "30143",
        "20022",
        "11015",
        "20278",
        "71",
        "11015"
      ]
    },
    {
      "hadith_no": "984",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا حامد بن عمر، عن حماد بن زيد، عن أيوب، عن محمد، أن أنس بن مالك، قال إن رسول الله صلى الله عليه وسلم صلى يوم النحر، ثم خطب فأمر من ذبح قبل الصلاة أن يعيد ذبحه فقام رجل من الأنصار فقال يا رسول الله، جيران لي  إما قال بهم خصاصة، وإما قال بهم فقر  وإني ذبحت قبل الصلاة وعندي عناق لي أحب إلى من شاتى لحم‏.‏ فرخص له فيها‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle offered the prayer on the day of Nahr and then delivered the Khutba and ordered that whoever had slaughtered his sacrifice before the prayer should repeat it, that is, should slaughter another sacrifice. Then a person from the Ansar stood up and said, \"O Allah's Apostle! because of my neighbors (he described them as being very needy or poor) I slaughtered before the prayer. I have a young she-goat which, in my opinion, is better than two sheep.\" The Prophet gave him the permission for slaughtering it as a sacrifice.",
      "chain": [
        "30128",
        "20022",
        "11015",
        "20278",
        "19"
      ]
    },
    {
      "hadith_no": "995",
      "source": " Sahih Bukhari ",
      "chapter": "Witr Prayer - كتاب الوتر",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا حماد بن زيد، قال حدثنا أنس بن سيرين، قال قلت لابن عمر أرأيت الركعتين قبل صلاة الغداة أطيل فيهما القراءة فقال كان النبي صلى الله عليه وسلم يصلي من الليل مثنى مثنى، ويوتر بركعة ويصلي الركعتين قبل صلاة الغداة وكأن الأذان بأذنيه‏.‏ قال حماد أى سرعة‏.‏",
      "text_en": " Narrated Anas bin Seereen:                     I asked Ibn `Umar, \"What is your opinion about the two rak`at before the Fajr (compulsory) prayer, as to prolonging the recitation in them?\" He said, \"The Prophet (p.b.u.h) used to pray at night two rak`at followed by two and so on, and end the prayer by one rak`a witr. He used to offer two rak`at before the Fajr prayer immediately after the Adhan.\" (Hammad, the sub-narrator said, \"That meant (that he prayed) quickly.)\"",
      "chain": [
        "20283",
        "20022",
        "11038"
      ]
    },
    {
      "hadith_no": "1001",
      "source": " Sahih Bukhari ",
      "chapter": "Witr Prayer - كتاب الوتر",
      "chapter_no": "14",
      "text_ar": "حدثنا مسدد، قال حدثنا حماد بن زيد، عن أيوب، عن محمد، قال سئل أنس أقنت النبي صلى الله عليه وسلم في الصبح قال نعم‏.‏ فقيل له أوقنت قبل الركوع قال بعد الركوع يسيرا‏.‏",
      "text_en": " Narrated Muhammad bin Seereen:                     Anas was asked, \"Did the Prophet recite Qunut in the Fajr prayer?\" Anas replied in the affirmative. He was further asked, \"Did he recite Qunut before bowing?\" Anas replied, \"He recited Qunut after bowing for some time (for one month).\"",
      "chain": [
        "30175",
        "20022",
        "11015",
        "20278"
      ]
    },
    {
      "hadith_no": "1048",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا قتيبة بن سعيد، قال حدثنا حماد بن زيد، عن يونس، عن الحسن، عن أبي بكرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الشمس والقمر آيتان من آيات الله، لا ينكسفان لموت أحد، ولكن الله تعالى يخوف بها عباده ‏\"‏‏.‏ وقال أبو عبد الله لم يذكر عبد الوارث وشعبة وخالد بن عبد الله وحماد بن سلمة عن يونس ‏\"‏ يخوف بها عباده ‏\"‏‏.‏ وتابعه موسى عن مبارك عن الحسن قال أخبرني أبو بكرة عن النبي صلى الله عليه وسلم‏.‏ ‏\"‏ إن الله تعالى يخوف بهما عباده ‏\"‏‏.‏ وتابعه أشعث عن الحسن‏.‏",
      "text_en": " Narrated Abu Bakra:                     Allah's Apostle said: \"The sun and the moon are two signs amongst the signs of Allah and they do not eclipse because of the death of someone but Allah frightens His devotees with them.\"",
      "chain": [
        "30367",
        "20022",
        "20475",
        "11016",
        "3229"
      ]
    },
    {
      "hadith_no": "1069",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا سليمان بن حرب، وأبو النعمان، قالا حدثنا حماد، عن أيوب، عن عكرمة، عن ابن عباس  رضى الله عنهما  قال ‏{‏ص‏}‏ ليس من عزائم السجود، وقد رأيت النبي صلى الله عليه وسلم يسجد فيها‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The prostration of Sa`d is not a compulsory one but I saw the Prophet prostrating while reciting it.",
      "chain": [
        "20193",
        "20283",
        "20022",
        "11015",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1156",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن أيوب، عن نافع، عن ابن عمر، رضى الله عنهما قال رأيت على عهد النبي صلى الله عليه وسلم كأن بيدي قطعة إستبرق، فكأني لا أريد مكانا من الجنة إلا طارت إليه، ورأيت كأن اثنين أتياني أرادا أن يذهبا بي إلى النار فتلقاهما ملك فقال لم ترع خليا عنه‏.‏ فقصت حفصة على النبي صلى الله عليه وسلم إحدى رؤياى فقال النبي صلى الله عليه وسلم ‏\"‏ نعم الرجل عبد الله لو كان يصلي من الليل ‏\"‏‏.‏ فكان عبد الله  رضى الله عنه  يصلي من الليل‏.‏ وكانوا لا يزالون يقصون على النبي صلى الله عليه وسلم الرؤيا أنها في الليلة السابعة من العشر الأواخر، فقال النبي صلى الله عليه وسلم ‏\"‏ أرى رؤياكم قد تواطت في العشر الأواخر، فمن كان متحريها فليتحرها من العشر الأواخر ‏\"‏‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar said, \"In the lifetime of the Prophet I dreamt that a piece of silk cloth was in my hand and it flew with me to whichever part of Paradise I wanted. I also saw as if two persons (i.e. angels) came to me and wanted to take me to Hell. Then an angel met us and told me not to be afraid. He then told them to leave me. Hafsa narrated one of my dreams to the Prophet and the Prophet said, \"Abdullah is a good man. Would that he offer the night prayer (Tahajjud)!\" So after that day `Abdullah (bin `Umar) started offering Tahajjud. The companions of the Prophet (p.b.u.h) used to tell him their dreams that (Laila-tul-Qadr) was on the 27th of the month of Ramadan. The Prophet said, \"I see that your dreams agree on the last ten nights of Ramadan and so whoever is in search of it should seek it in the last ten nights of Ramadan.\"",
      "chain": [
        "20283",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1180",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، عن نافع، عن ابن عمر  رضى الله عنهما  قال حفظت من النبي صلى الله عليه وسلم عشر ركعات ركعتين قبل الظهر، وركعتين بعدها، وركعتين بعد المغرب في بيته، وركعتين بعد العشاء في بيته، وركعتين قبل صلاة الصبح، وكانت ساعة لا يدخل على النبي صلى الله عليه وسلم فيها‏.‏ حدثتني حفصة، أنه كان إذا أذن المؤذن وطلع الفجر صلى ركعتين‏.‏",
      "text_en": "      Narrated Ibn 'Umar:                          I remember ten Rakat of Nawafil from the Prophet, two Rakat before the Zuhr prayer and two after it; two Rakat after Maghrib prayer in his house, and two Rakat after 'Isha' prayer in his house, and two Rakat before the Fajr prayer and at that time nobody would enter the house of the Prophet.Hafsa told me that the Prophet used to offer two Rakat after the call maker had made the Adhan and the day had dawned.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1213",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن أيوب، عن نافع، عن ابن عمر  رضى الله عنهما  أن النبي صلى الله عليه وسلم رأى نخامة في قبلة المسجد، فتغيظ على أهل المسجد وقال ‏\"‏ إن الله قبل أحدكم، فإذا كان في صلاته، فلا يبزقن  أو قال  لا يتنخمن ‏\"‏‏.‏ ثم نزل فحتها بيده‏.‏ وقال ابن عمر  رضى الله عنهما  إذا بزق أحدكم فليبزق على يساره‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet saw some sputum on the wall facing the Qibla of the mosque and became furious with the people of the mosque and said, \"During the prayer, Allah is in front of everyone of you and so he should not spit (or said, 'He should not expectorate').\" Then he got down and scratched the sputum with his hand. Ibn `Umar said (after narrating), \"If anyone of you has to spit during the prayer, he should spit to his left.\"",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1219",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد، عن أيوب، عن محمد، عن أبي هريرة  رضى الله عنه  قال نهي عن الخصر، في الصلاة‏.‏ وقال هشام وأبو هلال عن ابن سيرين، عن أبي هريرة، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     It was forbidden to keep the hands on the hips during the prayer. (This is narrated by Abu Huraira from the Prophet.)",
      "chain": [
        "20283",
        "20022",
        "11015",
        "20278",
        "13"
      ]
    },
    {
      "hadith_no": "1228",
      "source": " Sahih Bukhari ",
      "chapter": "Forgetfulness in Prayer - كتاب السهو",
      "chapter_no": "22",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن سلمة بن علقمة، قال قلت لمحمد في سجدتى السهو تشهد قال ليس في حديث أبي هريرة‏.‏",
      "text_en": " Narrated Salama bin 'Alqama:                     I asked Muhammad (bin Seereen) whether Tashah-hud should be recited after the two prostrations of Sahu. He replied, \"It is not (mentioned) in Abu Huraira's narration . \"",
      "chain": [
        "20193",
        "20022",
        "11593"
      ]
    },
    {
      "hadith_no": "1258",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا حامد بن عمر، حدثنا حماد بن زيد، عن أيوب، عن محمد، عن أم عطية، قالت توفيت إحدى بنات النبي صلى الله عليه وسلم فخرج، فقال ‏\"‏ اغسلنها ثلاثا أو خمسا أو أكثر من ذلك إن رأيتن بماء وسدر، واجعلن في الآخرة كافورا أو شيئا من كافور، فإذا فرغتن فآذنني ‏\"‏‏.‏ قالت فلما فرغنا آذناه، فألقى إلينا حقوه فقال ‏\"‏ أشعرنها إياه ‏\"‏‏.‏   وعن أيوب، عن حفصة، عن أم عطية  رضى الله عنهما  بنحوه وقالت إنه قال ‏\"‏ اغسلنها ثلاثا أو خمسا أو سبعا أو أكثر من ذلك إن رأيتن ‏\"‏‏.‏ قالت حفصة قالت أم عطية  رضى الله عنها  وجعلنا رأسها ثلاثة قرون‏.‏",
      "text_en": " Narrated Muhammad:                     Um 'Atiyya said, \"One of the daughters of the Prophet died and he came out and said, 'Wash her three or five times or more, if you think it necessary, with water and Sidr, and last of all put camphor (or some camphor) and when you finish, inform me.' \" Um Atiyya added, \"When we finished we informed him and he gave us his waist-sheet and said, 'Shroud her in it.' \" And Um 'Atiyya (in another narration) added, \"The Prophet said, 'Wash her three, five or seven times or more, if you think it necessary.' \" Hafsa said that Um 'Atiyya had also said, \"We entwined her hair into three braids.\"",
      "chain": [
        "30128",
        "20022",
        "11015",
        "20278",
        "71"
      ]
    },
    {
      "hadith_no": "1265",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن أيوب، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهم  قال بينما رجل واقف بعرفة إذ وقع عن راحلته فوقصته  أو قال فأوقصته  قال النبي صلى الله عليه وسلم ‏\"‏ اغسلوه بماء وسدر، وكفنوه في ثوبين، ولا تحنطوه ولا تخمروا رأسه، فإنه يبعث يوم القيامة ملبيا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     While a man was riding (his Mount) in `Arafat, he fell down from it (his Mount) and broke his neck (and died). The Prophet said, \"Wash him with water and Sidr and shroud him in two pieces of cloth, and neither perfume him, nor cover his head, for he will be resurrected on the Day of Resurrection saying, 'Labbaik,' (i.e. like a pilgrim).\"",
      "chain": [
        "20283",
        "20022",
        "11015",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1266",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا قتيبة، حدثنا حماد، عن أيوب، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال بينما رجل واقف مع رسول الله صلى الله عليه وسلم بعرفة إذ وقع من راحلته فأقصعته  أو قال فأقعصته  فقال رسول الله صلى الله عليه وسلم ‏\"‏ اغسلوه بماء وسدر، وكفنوه في ثوبين، ولا تحنطوه ولا تخمروا رأسه، فإن الله يبعثه يوم القيامة ملبيا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     While a man was at `Arafat (for Hajj) with Allah's Apostle the fell down from his Mount and broke his neck (and died). So Allah's Apostle said, \"Wash him with water and Sidr and shroud him in two pieces of cloth and neither perfume him nor cover his head, for Allah will resurrect him on the Day of Resurrection and he will be saying 'Labbaik.\"",
      "chain": [
        "30367",
        "20022",
        "11015",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1268",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا مسدد، حدثنا حماد بن زيد، عن عمرو، وأيوب، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهم  قال كان رجل واقف مع النبي صلى الله عليه وسلم بعرفة فوقع عن راحلته  قال أيوب فوقصته، وقال عمرو فأقصعته  فمات فقال ‏\"‏ اغسلوه بماء وسدر، وكفنوه في ثوبين، ولا تحنطوه ولا تخمروا رأسه، فإنه يبعث يوم القيامة  قال أيوب يلبي، وقال عمرو  ملبيا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A man fell from his Mount and died while he was with the Prophet at `Arafat. The Prophet said, \"Wash him with water and Sidr and shroud him in two pieces of cloth and neither perfume him nor cover his head, for he will be resurrected on the Day of Resurrection saying, 'Labbaik'.\"",
      "chain": [
        "30175",
        "20022",
        "11081",
        "11015",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1306",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا حماد بن زيد، حدثنا أيوب، عن محمد، عن أم عطية  رضى الله عنها  قالت أخذ علينا النبي صلى الله عليه وسلم عند البيعة أن لا ننوح، فما وفت منا امرأة غير خمس نسوة أم سليم وأم العلاء وابنة أبي سبرة امرأة معاذ وامرأتين أو ابنة أبي سبرة وامرأة معاذ وامرأة أخرى‏.‏",
      "text_en": " Narrated Um 'Atiyya:                     At the time of giving the pledge of allegiance to the Prophet one of the conditions was that we would not wail, but it was not fulfilled except by five women and they are Um Sulaim, Um Al-`Ala', the daughter of Abi Sabra (the wife of Mu`adh), and two other women; or the daughter of Abi Sabra and the wife of Mu`adh and another woman.",
      "chain": [
        "30143",
        "20022",
        "11015",
        "20278",
        "71"
      ]
    },
    {
      "hadith_no": "1337",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن الفضل، حدثنا حماد بن زيد، عن ثابت، عن أبي رافع، عن أبي هريرة  رضى الله عنه  أن أسود  رجلا أو امرأة  كان يقم المسجد فمات، ولم يعلم النبي صلى الله عليه وسلم بموته فذكره ذات يوم فقال ‏\"‏ ما فعل ذلك الإنسان ‏\"‏‏.‏ قالوا مات يا رسول الله‏.‏ قال ‏\"‏ أفلا آذنتموني ‏\"‏‏.‏ فقالوا إنه كان كذا وكذا قصته‏.‏ قال فحقروا شأنه‏.‏ قال ‏\"‏ فدلوني على قبره ‏\"‏‏.‏ فأتى قبره فصلى عليه‏.‏",
      "text_en": " Narrated Abu Huraira:                     A black person, a male or a female used to clean the Mosque and then died. The Prophet (p.b.u.h) did not know about it . One day the Prophet remembered him and said, \"What happened to that person?\" The people replied, \"O Allah's Apostle! He died.\" He said, \"Why did you not inform me?\" They said, \"His story was so and so (i.e. regarded him as insignificant).\" He said, \"Show me his grave.\" He then went to his grave and offered the funeral prayer.",
      "chain": [
        "20283",
        "20022",
        "11269",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "1356",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد  وهو ابن زيد  عن ثابت، عن أنس  رضى الله عنه  قال كان غلام يهودي يخدم النبي صلى الله عليه وسلم فمرض، فأتاه النبي صلى الله عليه وسلم يعوده، فقعد عند رأسه فقال له ‏\"‏ أسلم ‏\"‏‏.‏ فنظر إلى أبيه وهو عنده فقال له أطع أبا القاسم صلى الله عليه وسلم‏.‏ فأسلم، فخرج النبي صلى الله عليه وسلم وهو يقول ‏\"‏ الحمد لله الذي أنقذه من النار ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     A young Jewish boy used to serve the Prophet and he became sick. So the Prophet went to visit him. He sat near his head and asked him to embrace Islam. The boy looked at his father, who was sitting there; the latter told him to obey Abul-Qasim and the boy embraced Islam. The Prophet came out saying: \"Praises be to Allah Who saved the boy from the Hell-fire.\"",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "1418",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا حجاج، حدثنا حماد بن زيد، حدثنا أبو جمرة، قال سمعت ابن عباس  رضى الله عنهما  يقول قدم وفد عبد القيس على النبي صلى الله عليه وسلم فقالوا يا رسول الله إن هذا الحى من ربيعة قد حالت بيننا وبينك كفار مضر، ولسنا نخلص إليك إلا في الشهر الحرام، فمرنا بشىء نأخذه عنك، وندعو إليه من وراءنا‏.‏ قال ‏\"‏ آمركم بأربع، وأنهاكم عن أربع الإيمان بالله وشهادة أن لا إله إلا الله  وعقد بيده هكذا  وإقام الصلاة، وإيتاء الزكاة، وأن تؤدوا خمس ما غنمتم، وأنهاكم عن الدباء والحنتم والنقير والمزفت ‏\"‏‏.‏ وقال سليمان وأبو النعمان عن حماد ‏\"‏ الإيمان بالله شهادة أن لا إله إلا الله ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A delegation of the tribe of `Abdul Qais came to the Prophet and said, \"O Allah's Apostle! We are from the tribe of Rabi`a, and the infidels of the tribe of Mudar stands between us and you; so we cannot come to you except during the Sacred Months. Please order us to do something (religious deeds) which we may carry out and also invite to it our people whom we have left behind.\" The Prophet said, \"I order you to do four things and forbid you four others: (I order you) to have faith in Allah, and confess that none has the right to be worshipped but Allah, (and the Prophet gestured with his hand like this (i.e. one knot) and to offer prayers perfectly and to pay the Zakat, and to pay onefifth of the booty in Allah's Cause. And I forbid you to use Dubba', Hantam, Naqir and Muzaffat (all these are the names of utensils used for preparing alcoholic drinks).\"",
      "chain": [
        "20219",
        "20022",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "1450",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا حماد بن زيد، عن أيوب، عن نافع، عن ابن عمر  رضى الله عنهما  قال سمعت النبي صلى الله عليه وسلم ح‏.‏ وحدثنا عبد الله بن مسلمة، عن مالك، عن نافع، عن عبد الله بن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال وهو على المنبر، وذكر الصدقة والتعفف والمسألة ‏\"‏ اليد العليا خير من اليد السفلى، فاليد العليا هي المنفقة، والسفلى هي السائلة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     I heard Allah's Apostle (p.b.u.h) while he was on the pulpit speaking about charity, to abstain from asking others for some financial help and about begging others, saying, \"The upper hand is better than the lower hand. The upper hand is that of the giver and the lower (hand) is that of the beggar.\"",
      "chain": [
        "20283",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1536",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد بن زيد، حدثنا أيوب، عن نافع، عن ابن عمر  رضى الله عنهما  قال فرض النبي صلى الله عليه وسلم صدقة الفطر  أو قال رمضان  على الذكر والأنثى، والحر والمملوك، صاعا من تمر أو صاعا من شعير، فعدل الناس به نصف صاع من بر‏.‏ فكان ابن عمر  رضى الله عنهما  يعطي التمر، فأعوز أهل المدينة من التمر فأعطى شعيرا، فكان ابن عمر يعطي عن الصغير والكبير، حتى إن كان يعطي عن بني، وكان ابن عمر  رضى الله عنهما  يعطيها الذين يقبلونها، وكانوا يعطون قبل الفطر بيوم أو يومين‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar said, \"The Prophet made incumbent on every male or female, free man or slave, the payment of one Sa' of dates or barley as Sadaqat-ul-Fitr (or said Sadaqa-Ramadan).\" The people then substituted half Sa' of wheat for that. Ibn `Umar used to give dates (as Sadaqat-ul-Fitr). Once there was scarcity of dates in Medina and Ibn `Umar gave barley. 'And Ibn `Umar used to give Sadaqat-ul- Fitr for every young and old person. He even used to give on behalf of my children. Ibn `Umar used to give Sadaqat-ul-Fitr to those who had been officially appointed for its collection. People used to give Sadaqat-ul-Fitr (even) a day or two before the `Id.",
      "chain": [
        "20283",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    }
  ],
  "total_hadiths": 1059
}