{
  "id": "20028",
  "name": "Jarir bin 'Abdul Hameed al-Razi جرير بن عبد الحميد أبو عبد الله الضبي",
  "full_name": "Jarir bin 'Abdul Hameed al-Razi جرير بن عبد الحميد أبو عبد الله الضبي",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "biography": {
    "birth": {
      "date_hijri": "107",
      "date_gregorian": "NA",
      "date_display": [
        "107 AH"
      ],
      "place": "Kufa"
    },
    "death": {
      "date_hijri": "188",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Ray'",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa",
      "Ray'"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة ]",
      "Qadhi(Judge)"
    ],
    "tags": [
      "al-Dabi",
      "al-Razi",
      "Kufi",
      "Hafiz",
      "Imam"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11368",
      "name": "'Abdul Malik bin 'Umayr al-Qabti عبد الملك بن عمير بن سويد القبطي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11352",
      "name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11173",
      "name": "Suhayl bin Abi Salah سهيل بن أبي صالح",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11257",
      "name": "'Abdul 'Aziz bin Rafi' عبد العزيز بن رفيع",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11379",
      "name": "'Ammara bin al-Q'aqa' bin Shabrma عمارة بن القعقاع بن شبرمة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11072",
      "name": "al-Mughira bin Maqsam المغيرة بن مقسم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10844",
      "name": "Yazid bin Abi Ziyad يزيد بن أبي زياد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11068",
      "name": "Ata'a bin al-Sa'ib al-Thaqifi عطاء بن السائب الثقفي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30349",
      "name": "'Abdullah bin 'Uthman - ''Aabadan عبد الله بن عثمان - عبدان",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "11410",
      "name": "Marthad bin 'Abdullah al-Yazni مرثد بن عبد الله اليزني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "38573",
      "name": "Muhammad bin Qdamh bin A'yn محمد بن قدامة بن أعين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38574",
      "name": "Muhammad bin Qdamh al-Twsy محمد بن قدامة الطوسي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30564",
      "name": "Muhammad bin Qdamh bin Isma'il محمد بن قدامة بن إسماعيل السلمي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30399",
      "name": "Yahya bin Yahya bin Bukayr يحيى بن يحيى بن بكير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30224",
      "name": "Yusuf bin Musa bin Rashid al-Qatan يوسف بن موسى بن راشد القطان",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30137",
      "name": "Sulaiman bin Da'ud al-'Atki al-Zahrani سليمان بن داود أبو الربيع الزهراني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20387",
      "name": "'Ali bin Hujr bin Iyas bin Maqatil علي بن حجر بن إياس بن مقاتل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "70",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عثمان بن أبي شيبة، قال حدثنا جرير، عن منصور، عن أبي وائل، قال كان عبد الله يذكر الناس في كل خميس، فقال له رجل يا أبا عبد الرحمن لوددت أنك ذكرتنا كل يوم‏.‏ قال أما إنه يمنعني من ذلك أني أكره أن أملكم، وإني أتخولكم بالموعظة كما كان النبي صلى الله عليه وسلم يتخولنا بها، مخافة السآمة علينا‏.‏",
      "text_en": " Narrated Abu Wail:                     `Abdullah used to give a religious talk to the people on every Thursday. Once a man said, \"O Aba `Abdur-Rahman! (By Allah) I wish if you could preach us daily.\" He replied, \"The only thing which prevents me from doing so, is that I hate to bore you, and no doubt I take care of you in preaching by selecting a suitable time just as the Prophet used to do with us, for fear of making us bored.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "123",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عثمان، قال أخبرنا جرير، عن منصور، عن أبي وائل، عن أبي موسى، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله، ما القتال في سبيل الله فإن أحدنا يقاتل غضبا، ويقاتل حمية‏.‏ فرفع إليه رأسه  قال وما رفع إليه رأسه إلا أنه كان قائما  فقال ‏\"‏ من قاتل لتكون كلمة الله هي العليا فهو في سبيل الله عز وجل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     A man came to the Prophet and asked, \"O Allah's Apostle! What kind of fighting is in Allah's cause? (I ask this), for some of us fight because of being enraged and angry and some for the sake of his pride and haughtiness.\" The Prophet raised his head (as the questioner was standing) and said, \"He who fights so that Allah's Word (Islam) should be superior, then he fights in Allah's cause.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11353",
        "41"
      ]
    },
    {
      "hadith_no": "141",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا جرير، عن منصور، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس، يبلغ به النبي صلى الله عليه وسلم قال ‏\"‏ لو أن أحدكم إذا أتى أهله قال بسم الله اللهم جنبنا الشيطان وجنب الشيطان ما رزقتنا‏.‏ فقضي بينهما ولد، لم يضره ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"If anyone of you on having sexual relations with his wife said (and he must say it before starting) 'In the name of Allah. O Allah! Protect us from Satan and also protect what you bestow upon us (i.e. the coming offspring) from Satan, and if it is destined that they should have a child then, Satan will never be able to harm that offspring.\"",
      "chain": [
        "30026",
        "20028",
        "11067",
        "11342",
        "11211"
      ]
    },
    {
      "hadith_no": "178",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا قتيبة بن سعيد، قال حدثنا جرير، عن الأعمش، عن منذر أبي يعلى الثوري، عن محمد ابن الحنفية، قال قال علي كنت رجلا مذاء، فاستحييت أن أسأل رسول الله صلى الله عليه وسلم فأمرت المقداد بن الأسود فسأله فقال ‏\"‏ فيه الوضوء ‏\"‏‏.‏ ورواه شعبة عن الأعمش‏.‏",
      "text_en": " Narrated `Ali:                     I used to get emotional urethral discharges frequently and felt shy to ask Allah's Apostle about it. So I requested Al-Miqdad bin Al-Aswad to ask (the Prophet ) about it. Al-Miqdad asked him and he replied, \"On has to perform ablution (after it).",
      "chain": [
        "30367",
        "20028",
        "11060",
        "11398",
        "10600"
      ]
    },
    {
      "hadith_no": "216",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عثمان، قال حدثنا جرير، عن منصور، عن مجاهد، عن ابن عباس، قال مر النبي صلى الله عليه وسلم بحائط من حيطان المدينة أو مكة، فسمع صوت إنسانين يعذبان في قبورهما، فقال النبي صلى الله عليه وسلم ‏\"‏ يعذبان، وما يعذبان في كبير ‏\"‏، ثم قال ‏\"‏ بلى، كان أحدهما لا يستتر من بوله، وكان الآخر يمشي بالنميمة ‏\"‏‏.‏ ثم دعا بجريدة فكسرها كسرتين، فوضع على كل قبر منهما كسرة‏.‏ فقيل له يا رسول الله لم فعلت هذا قال ‏\"‏ لعله أن يخفف عنهما ما لم تيبسا أو إلى أن ييبسا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Once the Prophet, while passing through one of the graveyards of Medina or Mecca heard the voices of two persons who were being tortured in their graves. The Prophet said, \"These two persons are being tortured not for a major sin (to avoid).\" The Prophet then added, \"Yes! (they are being tortured for a major sin). Indeed, one of them never saved himself from being soiled with his urine while the other used to go about with calumnies (to make enmity between friends). The Prophet then asked for a green leaf of a date-palm tree, broke it into two pieces and put one on each grave. On being asked why he had done so, he replied, \"I hope that their torture might be lessened, till these get dried.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "225",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عثمان بن أبي شيبة، قال حدثنا جرير، عن منصور، عن أبي وائل، عن حذيفة، قال رأيتني أنا والنبي، صلى الله عليه وسلم نتماشى، فأتى سباطة قوم خلف حائط، فقام كما يقوم أحدكم فبال، فانتبذت منه، فأشار إلى فجئته، فقمت عند عقبه حتى فرغ‏.‏",
      "text_en": " Narrated Hudhaifa':                     The Prophet and I walked till we reached the dumps of some people. He stood, as any one of you stands, behind a wall and urinated. I went away, but he beckoned me to come. So I approached him and stood near his back till he finished.",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "245",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عثمان، قال حدثنا جرير، عن منصور، عن أبي وائل، عن حذيفة، قال كان النبي صلى الله عليه وسلم إذا قام من الليل يشوص فاه بالسواك‏.‏",
      "text_en": " Narrated Hudhaifa:                     Whenever the Prophet got up at night, he used to clean his mouth with Siwak.",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "401",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عثمان، قال حدثنا جرير، عن منصور، عن إبراهيم، عن علقمة، قال قال عبد الله صلى النبي صلى الله عليه وسلم  قال إبراهيم لا أدري زاد أو نقص  فلما سلم قيل له يا رسول الله، أحدث في الصلاة شىء قال ‏\"‏ وما ذاك ‏\"‏‏.‏ قالوا صليت كذا وكذا‏.‏ فثنى رجليه واستقبل القبلة، وسجد سجدتين ثم سلم، فلما أقبل علينا بوجهه قال ‏\"‏ إنه لو حدث في الصلاة شىء لنبأتكم به، ولكن إنما أنا بشر مثلكم، أنسى كما تنسون، فإذا نسيت فذكروني، وإذا شك أحدكم في صلاته فليتحرى الصواب، فليتم عليه ثم يسلم، ثم يسجد سجدتين ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet prayed (and the sub-narrator Ibrahim said, \"I do not know whether he prayed more or less than usual\"), and when he had finished the prayers he was asked, \"O Allah's Apostle! Has there been any change in the prayers?\" He said, \"What is it?' The people said, \"You have prayed so much and so much.\" So the Prophet bent his legs, faced the Qibla and performed two prostration's (of Sahu) and finished his prayers with Taslim (by turning his face to right and left saying: 'As-Salamu `Alaikum- Warahmat-ullah'). When he turned his face to us he said, \"If there had been anything changed in the prayer, surely I would have informed you but I am a human being like you and liable to forget like you. So if I forget remind me and if anyone of you is doubtful about his prayer, he should follow what he thinks to be correct and complete his prayer accordingly and finish it and do two prostrations (of Sahu).",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "508",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عثمان بن أبي شيبة، قال حدثنا جرير، عن منصور، عن إبراهيم، عن الأسود، عن عائشة، قالت أعدلتمونا بالكلب والحمار لقد رأيتني مضطجعة على السرير، فيجيء النبي صلى الله عليه وسلم فيتوسط السرير فيصلي، فأكره أن أسنحه فأنسل من قبل رجلى السرير حتى أنسل من لحافي‏.‏",
      "text_en": " Narrated `Aisha:                     Do you make us (women) equal to dogs and donkeys? While I used to lie in my bed, the Prophet would come and pray facing the middle of the bed. I used to consider it not good to stand in front of him in his prayers. So I used to slip away slowly and quietly from the foot of the bed till I got out of my guilt.",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "777",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا قتيبة بن سعيد، قال حدثنا جرير، عن الأعمش، عن عمارة بن عمير، عن أبي معمر، قلت لخباب أكان رسول الله صلى الله عليه وسلم يقرأ في الظهر والعصر قال نعم‏.‏ قلنا من أين علمت قال باضطراب لحيته‏.‏",
      "text_en": " Narrated Abu Ma`mar:                     We said to Khabbab \"Did Allah's Apostle used to recite in Zuhr and `Asr prayers?\" He replied in the affirmative. We said, \"How did you come to know about it?\" He said, \"By the movement of his beard.\"",
      "chain": [
        "30367",
        "20028",
        "11060",
        "11378",
        "11360"
      ]
    },
    {
      "hadith_no": "955",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا عثمان، قال حدثنا جرير، عن منصور، عن الشعبي، عن البراء بن عازب  رضى الله عنهما  قال خطبنا النبي صلى الله عليه وسلم يوم الأضحى بعد الصلاة فقال ‏\"‏ من صلى صلاتنا ونسك نسكنا فقد أصاب النسك، ومن نسك قبل الصلاة فإنه قبل الصلاة، ولا نسك له ‏\"‏‏.‏ فقال أبو بردة بن نيار خال البراء يا رسول الله، فإني نسكت شاتي قبل الصلاة، وعرفت أن اليوم يوم أكل وشرب، وأحببت أن تكون شاتي أول ما يذبح في بيتي، فذبحت شاتي وتغديت قبل أن آتي الصلاة‏.‏ قال ‏\"‏ شاتك شاة لحم ‏\"‏‏.‏ قال يا رسول الله، فإن عندنا عناقا لنا جذعة هي أحب إلى من شاتين، أفتجزي عني قال ‏\"‏ نعم، ولن تجزي عن أحد بعدك ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara' bin `Azib:                     The Prophet delivered the Khutba after offering the prayer on the Day of Nahr and said, \"Whoever offers the prayer like us and slaughters like us then his Nusuk (sacrifice) will be accepted by Allah. And whoever slaughters his sacrifice before the `Id prayer then he has not done the sacrifice.\" Abi Burda bin Niyar, the uncle of Al-Bara' said, \"O Allah's Apostle! I have slaughtered my sheep before the `Id prayer and I thought today as a day of eating and drinking (not alcoholic drinks), and I liked that my sheep should be the first to be slaughtered in my house. So slaughtered my sheep and took my food before coming for the prayer.\" The Prophet said, \"The sheep which you have slaughtered is just mutton (not a Nusuk).\" He (Abu Burda) said, \"O Allah's Apostle! I have a young she-goat which is dearer to me than two sheep. Will that be sufficient as a Nusuk on my behalf? \"The Prophet (p.b.u.h) said, \"Yes, it will be sufficient for you but it will not be sufficient (as a Nusuk) for anyone else after you.\"",
      "chain": [
        "4",
        "20028",
        "11067",
        "11052",
        "400"
      ]
    },
    {
      "hadith_no": "1007",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا عثمان بن أبي شيبة، قال حدثنا جرير، عن منصور، عن أبي الضحى، عن مسروق، قال كنا عند عبد الله فقال إن النبي صلى الله عليه وسلم لما رأى من الناس إدبارا قال ‏\"‏ اللهم سبع كسبع يوسف ‏\"‏‏.‏ فأخذتهم سنة حصت كل شىء حتى أكلوا الجلود والميتة والجيف، وينظر أحدهم إلى السماء فيرى الدخان من الجوع، فأتاه أبو سفيان فقال يا محمد إنك تأمر بطاعة الله وبصلة الرحم وإن قومك قد هلكوا، فادع الله لهم قال الله تعالى ‏{‏فارتقب يوم تأتي السماء بدخان مبين‏}‏ إلى قوله ‏{‏عائدون * يوم نبطش البطشة الكبرى‏}‏ فالبطشة يوم بدر، وقد مضت الدخان والبطشة واللزام وآية الروم‏.‏",
      "text_en": " Narrated Masruq:                     We were with `Abdullah and he said, \"When the Prophet saw the refusal of the people to accept Islam he said, \"O Allah! Send (famine) years on them for (seven years) like the seven years (of famine during the time) of (Prophet) Joseph.\" So famine overtook them for one year and destroyed every kind of life to such an extent that the people started eating hides, carcasses and rotten dead animals. Whenever one of them looked towards the sky, he would (imagine himself to) see smoke because of hunger. So Abu Sufyan went to the Prophet and said, \"O Muhammad! You order people to obey Allah and to keep good relations with kith and kin. No doubt the people of your tribe are dying, so please pray to Allah for them.\" So Allah revealed: \"Then watch you For the day that The sky will bring forth a kind Of smoke Plainly visible ... Verily! You will return (to disbelief) On the day when We shall seize You with a mighty grasp. (44.10-16) Ibn Mas`ud added, \"Al-Batsha (i.e. grasp) happened in the battle of Badr and no doubt smoke, Al-Batsha, Al-Lizam, and the verse of Surat Ar-Rum have all passed .",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11392",
        "11018"
      ]
    },
    {
      "hadith_no": "1340",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الشيباني، عن الشعبي، عن ابن عباس  رضى الله عنهما  قال صلى النبي صلى الله عليه وسلم على رجل بعد ما دفن بليلة قام هو وأصحابه، وكان سأل عنه فقال ‏\"‏ من هذا ‏\"‏‏.‏ فقالوا فلان، دفن البارحة‏.‏ فصلوا عليه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet (p.b.u.h) offered the funeral prayer of a man one night after he was buried, he and his companions stood up (for the Prayer). He had asked them about him before standing, saying, \"Who is this?\" They said, \"He is so and so and was buried last night.\" So all of them offered the funeral prayer.",
      "chain": [
        "30203",
        "20028",
        "11352",
        "11052",
        "17"
      ]
    },
    {
      "hadith_no": "1362",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عثمان، قال حدثني جرير، عن منصور، عن سعد بن عبيدة، عن أبي عبد الرحمن، عن علي  رضى الله عنه  قال كنا في جنازة في بقيع الغرقد، فأتانا النبي صلى الله عليه وسلم فقعد وقعدنا حوله، ومعه مخصرة فنكس، فجعل ينكت بمخصرته ثم قال ‏\"‏ ما منكم من أحد، ما من نفس منفوسة إلا كتب مكانها من الجنة والنار، وإلا قد كتب شقية أو سعيدة ‏\"‏‏.‏ فقال رجل يا رسول الله، أفلا نتكل على كتابنا وندع العمل، فمن كان منا من أهل السعادة فسيصير إلى عمل أهل السعادة، وأما من كان منا من أهل الشقاوة فسيصير إلى عمل أهل الشقاوة قال ‏\"‏ أما أهل السعادة فييسرون لعمل السعادة، وأما أهل الشقاوة فييسرون لعمل الشقاوة ‏\"‏، ثم قرأ ‏{‏فأما من أعطى واتقى‏}‏ الآية‏.‏",
      "text_en": " Narrated `Ali:                     \" We were accompanying a funeral procession in Baqi-I-Gharqad. The Prophet came to us and sat and we sat around him. He had a small stick in his hand then he bent his head and started scraping the ground with it. He then said, \"There is none among you, and not a created soul, but has place either in Paradise or in Hell assigned for him and it is also determined for him whether he will be among the blessed or wretched.\" A man said, \"O Allah's Apostle! Should we not depend on what has been written for us and leave the deeds as whoever amongst us is blessed will do the deeds of a blessed person and whoever amongst us will be wretched, will do the deeds of a wretched person?\" The Prophet said, \"The good deeds are made easy for the blessed, and bad deeds are made easy for the wretched.\" Then he recited the Verses:-- \"As for him who gives (in charity) and is Allah-fearing And believes in the Best reward from Allah. \" (92.5-6)",
      "chain": [
        "4",
        "20028",
        "11067",
        "11344",
        "11359",
        "5"
      ]
    },
    {
      "hadith_no": "1378",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا قتيبة، حدثنا جرير، عن الأعمش، عن مجاهد، عن طاوس، قال ابن عباس  رضى الله عنهما  مر النبي صلى الله عليه وسلم على قبرين فقال ‏\"‏ إنهما ليعذبان، وما يعذبان من كبير  ثم قال  بلى أما أحدهما فكان يسعى بالنميمة، وأما أحدهما فكان لا يستتر من بوله ‏\"‏‏.‏ قال ثم أخذ عودا رطبا فكسره باثنتين ثم غرز كل واحد منهما على قبر، ثم قال ‏\"‏ لعله يخفف عنهما ما لم ييبسا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet once passed by two graves and said, \"They (the deceased persons in those graves) are being tortured not for a great thing to avoid.\" And then added, \"Yes, (they are being punished for a big sin), for one of them used to go about with calumnies while the other never saved himself from being soiled with his urine.\" (Ibn `Abbas added): Then he took a green leaf of a date-palm) and split it into two pieces and fixed one piece on each grave and said, \"May their punishment be abated till these (two pieces) get dry.\"",
      "chain": [
        "30367",
        "20028",
        "11060",
        "11028",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1392",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا قتيبة، حدثنا جرير بن عبد الحميد، حدثنا حصين بن عبد الرحمن، عن عمرو بن ميمون الأودي، قال رأيت عمر بن الخطاب  رضى الله عنه  قال يا عبد الله بن عمر، اذهب إلى أم المؤمنين عائشة  رضى الله عنها  فقل يقرأ عمر بن الخطاب عليك السلام، ثم سلها أن أدفن مع صاحبى‏.‏ قالت كنت أريده لنفسي، فلأوثرنه اليوم على نفسي‏.‏ فلما أقبل قال له ما لديك قال أذنت لك يا أمير المؤمنين‏.‏ قال ما كان شىء أهم إلى من ذلك المضجع، فإذا قبضت فاحملوني ثم سلموا ثم قل يستأذن عمر بن الخطاب‏.‏ فإن أذنت لي فادفنوني، وإلا فردوني إلى مقابر المسلمين، إني لا أعلم أحدا أحق بهذا الأمر من هؤلاء النفر الذين توفي رسول الله صلى الله عليه وسلم وهو عنهم راض، فمن استخلفوا بعدي فهو الخليفة، فاسمعوا له وأطيعوا‏.‏ فسمى عثمان وعليا وطلحة والزبير وعبد الرحمن بن عوف وسعد بن أبي وقاص، وولج عليه شاب من الأنصار فقال أبشر يا أمير المؤمنين ببشرى الله، كان لك من القدم في الإسلام ما قد علمت، ثم استخلفت فعدلت، ثم الشهادة بعد هذا كله‏.‏ فقال ليتني يا ابن أخي وذلك كفافا لا على ولا لي أوصي الخليفة من بعدي بالمهاجرين الأولين خيرا، أن يعرف لهم حقهم، وأن يحفظ لهم حرمتهم، وأوصيه بالأنصار خيرا الذين تبوءوا الدار والإيمان أن يقبل من محسنهم، ويعفى عن مسيئهم، وأوصيه بذمة الله وذمة رسوله صلى الله عليه وسلم أن يوفى لهم بعهدهم، وأن يقاتل من ورائهم، وأن لا يكلفوا فوق طاقتهم‏.‏",
      "text_en": " Narrated `Amr bin Maimun Al-Audi:                     I saw `Umar bin Al-Khattab (when he was stabbed) saying, \"O `Abdullah bin `Umar! Go to the mother of the believers Aisha and say, `Umar bin Al-Khattab sends his greetings to you,' and request her to allow me to be buried with my companions.\" (So, Ibn `Umar conveyed the message to `Aisha.) She said, \"I had the idea of having this place for myself but today I prefer him (`Umar) to myself (and allow him to be buried there).\" When `Abdullah bin `Umar returned, `Umar asked him, \"What (news) do you have?\" He replied, \"O chief of the believers! She has allowed you (to be buried there).\" On that `Umar said, \"Nothing was more important to me than to be buried in that (sacred) place. So, when I expire, carry me there and pay my greetings to her (`Aisha ) and say, `Umar bin Al-Khattab asks permission; and if she gives permission, then bury me (there) and if she does not, then take me to the graveyard of the Muslims. I do not think any person has more right for the caliphate than those with whom Allah's Apostle (p.b.u.h) was always pleased till his death. And whoever is chosen by the people after me will be the caliph, and you people must listen to him and obey him,\" and then he mentioned the name of `Uthman, `Ali, Talha, Az-Zubair, `Abdur-Rahman bin `Auf and Sa`d bin Abi Waqqas. By this time a young man from Ansar came and said, \"O chief of the believers! Be happy with Allah's glad tidings. The grade which you have in Islam is known to you, then you became the caliph and you ruled with justice and then you have been awarded martyrdom after all this.\" `Umar replied, \"O son of my brother! Would that all that privileges will counterbalance (my short comings), so that I neither lose nor gain anything. I recommend my successor to be good to the early emigrants and realize their rights and to protect their honor and sacred things. And I also recommend him to be good to the Ansar who before them, had homes (in Medina) and had adopted the Faith. He should accept the good of the righteous among them and should excuse their wrongdoers. I recommend him to abide by the rules and regulations concerning the Dhimmis (protectees) of Allah and His Apostle, to fulfill their contracts completely and fight for them and not to tax (overburden) them beyond their capabilities.\"",
      "chain": [
        "30367",
        "20028",
        "15097",
        "11382"
      ]
    },
    {
      "hadith_no": "1446",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن شقيق، عن مسروق، عن عائشة  رضى الله عنها  قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أنفقت المرأة من طعام بيتها غير مفسدة كان لها أجرها بما أنفقت ولزوجها أجره بما كسب، وللخازن مثل ذلك، لا ينقص بعضهم أجر بعض شيئا ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle said, \"When a woman gives in charity some of the foodstuff (which she has in her house) without spoiling it, she will receive the reward for what she has spent, and her husband will receive the reward because of his earning, and the storekeeper will also have a reward similar to it. The reward of one will not decrease the reward of the others . \"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11353",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "1457",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا قتيبة، حدثنا جرير، عن الأعمش، عن أبي وائل، عن حذيفة  رضى الله عنه  قال قال عمر  رضى الله عنه  أيكم يحفظ حديث رسول الله صلى الله عليه وسلم عن الفتنة قال قلت أنا أحفظه كما قال‏.‏ قال إنك عليه لجريء فكيف قال قلت فتنة الرجل في أهله وولده وجاره تكفرها الصلاة والصدقة والمعروف‏.‏ قال سليمان قد كان يقول ‏\"‏ الصلاة والصدقة، والأمر بالمعروف والنهى عن المنكر ‏\"‏‏.‏ قال ليس هذه أريد، ولكني أريد التي تموج كموج البحر‏.‏ قال قلت ليس عليك بها يا أمير المؤمنين بأس، بينك وبينها باب مغلق‏.‏ قال فيكسر الباب أو يفتح‏.‏ قال قلت لا‏.‏ بل يكسر‏.‏ قال فإنه إذا كسر لم يغلق أبدا‏.‏ قال قلت أجل‏.‏ فهبنا أن نسأله من الباب فقلنا لمسروق سله‏.‏ قال فسأله‏.‏ فقال عمر  رضى الله عنه ‏.‏ قال قلنا فعلم عمر من تعني قال نعم، كما أن دون غد ليلة، وذلك أني حدثته حديثا ليس بالأغاليط‏.‏",
      "text_en": " Narrated Abu Wail:                     Hudhaifa said, \"`Umar said, 'Who amongst you remembers the statement of Allah's Apostle (p.b.u.h) about afflictions'?' I said, 'I know it as the Prophet had said it.' `Umar said, 'No doubt, you are bold. How did he say it?' I said, 'A man's afflictions (wrong deeds) concerning his wife, children and neighbors are expiated by (his) prayers, charity, and enjoining good.' (The sub-narrator Sulaiman added that he said, 'The prayer, charity, enjoining good and forbidding evil.') `Umar said, 'I did not mean that, but I ask about that affliction which will spread like the waves of the sea.' I said, 'O chief of the believers! You need not be afraid of it as there is a closed door between you and it.' He asked, 'Will the door be broken or opened?' I replied, 'No, it will be broken.' He said, 'Then, if it is broken, it will never be closed again?' I replied, 'Yes.' \" Then we were afraid to ask what that door was, so we asked Masruq to inquire, and he asked Hudhaifa regarding it. Hudhaifa said, \"The door was `Umar. \"We further asked Hudhaifa whether `Umar knew what that door meant. Hudhaifa replied in the affirmative and added, \"He knew it as one knows that there will be a night before the tomorrow morning.\"",
      "chain": [
        "30367",
        "20028",
        "11060",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "1459",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن الأعمش، عن أبي وائل، عن مسروق، عن عائشة  رضى الله عنها  قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا تصدقت المرأة من طعام زوجها غير مفسدة كان لها أجرها، ولزوجها بما كسب، وللخازن مثل ذلك ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle said, \"When a woman gives in charity from her husband's meals without wasting the property of her husband, she will get a reward for it, and her husband too will get a reward for what he earned and the storekeeper will have the reward likewise.\"",
      "chain": [
        "30367",
        "20028",
        "11060",
        "11353",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "1463",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا جرير، عن منصور، عن شقيق، عن مسروق، عن عائشة  رضى الله عنها  عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أنفقت المرأة من طعام بيتها غير مفسدة فلها أجرها، وللزوج بما اكتسب، وللخازن مثل ذلك ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet said, \"When a woman gives in charity from her house meals in Allah's Cause without spoiling her husband's property, she will get a reward for it, and her husband will also get the reward for his earnings and the storekeeper will get a reward likewise.\"",
      "chain": [
        "30399",
        "20028",
        "11067",
        "11353",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "1586",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عثمان، حدثنا جرير، عن منصور، عن إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  خرجنا مع النبي صلى الله عليه وسلم ولا نرى إلا أنه الحج، فلما قدمنا تطوفنا بالبيت، فأمر النبي صلى الله عليه وسلم من لم يكن ساق الهدى أن يحل، فحل من لم يكن ساق الهدى، ونساؤه لم يسقن فأحللن، قالت عائشة  رضى الله عنها  فحضت فلم أطف بالبيت، فلما كانت ليلة الحصبة قالت يا رسول الله، يرجع الناس بعمرة وحجة وأرجع أنا بحجة قال ‏\"‏ وما طفت ليالي قدمنا مكة ‏\"‏‏.‏ قلت لا‏.‏ قال ‏\"‏ فاذهبي مع أخيك إلى التنعيم، فأهلي بعمرة ثم موعدك كذا وكذا ‏\"‏‏.‏ قالت صفية ما أراني إلا حابستهم‏.‏ قال ‏\"‏ عقرى حلقى، أوما طفت يوم النحر ‏\"‏‏.‏ قالت قلت بلى‏.‏ قال ‏\"‏ لا بأس، انفري ‏\"‏‏.‏ قالت عائشة  رضى الله عنها  فلقيني النبي صلى الله عليه وسلم وهو مصعد من مكة، وأنا منهبطة عليها، أو أنا مصعدة وهو منهبط منها‏.‏",
      "text_en": " Narrated Al-Aswad:                     ' Aisha said, We went out with the Prophet (from Medina) with the intention of performing Hajj only and when we reached Mecca we performed Tawaf round the Ka`ba and then the Prophet ordered those who had not driven the Hadi along with them to finish their Ihram. So the people who had not driven the Hadi along with them finished their Ihram. The Prophet's wives, too, had not driven the Hadi with them, so they too, finished their Ihram.\" `Aisha added, \"I got my menses and could not perform Tawaf round the Ka`ba.\" So when it was the night of Hasba (i.e. when we stopped at Al-Muhassab), I said, 'O Allah's Apostle! Everyone is returning after performing Hajj and `Umra but I am returning after performing Hajj only.' He said, 'Didn't you perform Tawaf round the Ka`ba the night we reached Mecca?' I replied in the negative. He said, 'Go with your brother to Tan`im and assume the Ihram for `Umra, (and after performing it) come back to such and such a place.' On that Safiya said, 'I feel that I will detain you all.' The Prophet said, 'O 'Aqra Halqa! Didn't you perform Tawaf of the Ka`ba on the day of sacrifice? (i.e. Tawaf-al-ifada) Safiya replied in the affirmative. He said, (to Safiya). 'There is no harm for you to proceed on with us.' \" `Aisha added, \"(after returning from `Umra), the Prophet met me while he was ascending (from Mecca) and I was descending to it, or I was ascending and he was descending.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "1612",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا جرير بن عبد الحميد، عن منصور، عن مجاهد، عن طاوس، عن ابن عباس  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم يوم فتح مكة ‏\"‏ إن هذا البلد حرمه الله، لا يعضد شوكه، ولا ينفر صيده، ولا يلتقط لقطته إلا من عرفها ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     On the Day of the Conquest of Mecca, Allah's Apostle said, \"Allah has made this town a sanctuary. Its thorny bushes should not be cut, its game should not be chased, and its fallen things should not be picked up except by one who would announce it publicly.\"",
      "chain": [
        "30026",
        "20028",
        "11067",
        "11028",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1803",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا قتيبة، حدثنا جرير، عن منصور، عن مجاهد، قال دخلت أنا وعروة بن الزبير المسجد،، فإذا عبد الله بن عمر  رضى الله عنهما  جالس إلى حجرة عائشة، وإذا ناس يصلون في المسجد صلاة الضحى‏.‏ قال فسألناه عن صلاتهم‏.‏ فقال بدعة‏.‏ ثم قال له كم اعتمر رسول الله صلى الله عليه وسلم قال أربع إحداهن في رجب، فكرهنا أن نرد عليه‏.‏ قال وسمعنا استنان، عائشة أم المؤمنين في الحجرة، فقال عروة يا أماه، يا أم المؤمنين‏.‏ ألا تسمعين ما يقول أبو عبد الرحمن‏.‏ قالت ما يقول قال يقول إن رسول الله صلى الله عليه وسلم اعتمر أربع عمرات إحداهن في رجب‏.‏ قالت يرحم الله أبا عبد الرحمن، ما اعتمر عمرة إلا وهو شاهده، وما اعتمر في رجب قط‏.‏",
      "text_en": " Narrated Mujahid:                     Urwa bin Az-Zubair and I entered the Mosque (of the Prophet) and saw `Abdullah bin `Umar sitting near the dwelling place of Aisha and some people were offering the Duha prayer. We asked him about their prayer and he replied that it was a heresy. He (Urwa) then asked him how many times the Prophet had performed `Umra. He replied, 'Four times; one of them was in the month of Rajab.\" We disliked to contradict him. Then we heard `Aisha, the Mother of faithful believers cleaning her teeth with Siwak in the dwelling place. 'Ursa said, \"O Mother! O Mother of the believers! Don't you hear what Abu `Abdur Rahman is saying?\" She said, \"What does he say?\" 'Urwa said, \"He says that Allah's Apostle performed four `Umra and one of them was in the month of Rajab.\" `Aisha said, \"May Allah be merciful to Abu `Abdur Rahman! The Prophet did not perform any `Umra except that he was with him, and he never performed any `Umra in Rajab.\"",
      "chain": [
        "30367",
        "20028",
        "11067",
        "11028"
      ]
    },
    {
      "hadith_no": "1819",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا إسحاق بن إبراهيم، عن جرير، عن إسماعيل، عن عبد الله بن أبي أوفى، قال اعتمر رسول الله صلى الله عليه وسلم واعتمرنا معه فلما دخل مكة طاف وطفنا معه، وأتى الصفا والمروة وأتيناها معه، وكنا نستره من أهل مكة أن يرميه أحد‏.‏ فقال له صاحب لي أكان دخل الكعبة قال لا‏.‏ قال فحدثنا ما، قال لخديجة‏.‏ قال ‏\"‏ بشروا خديجة ببيت في الجنة من قصب لا صخب فيه ولا نصب ‏\"‏‏.‏",
      "text_en": " Narrated Isma`il:                     `Abdullah bin Abu `Aufa said: \"Allah's Apostle performed `Umra and we too performed `Umra along with him. When he entered Mecca he performed the Tawaf (of Ka`ba) and we too performed it along with him, and then he came to the As-Safa and Al-Marwa (i.e. performed the Sai) and we also came to them along with him. We were shielding him from the people of Mecca lest they may hit him with an arrow.\" A friend of his asked him (i.e. `Abdullah bin `Aufa), \"Did the Prophet enter the Ka`ba (during that `Umra)?\" He replied in the negative. Then he said, \"What did he (the Prophet ) say about Khadija?\" He (Abdullah bin `Aufa) said, \"(He said) 'Give Khadija the good tidings that she will have a palace made of Qasab in Paradise and there will be neither noise nor any trouble in it.\"",
      "chain": [
        "30123",
        "20028",
        "11418",
        "5115"
      ]
    },
    {
      "hadith_no": "1865",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن مجاهد، عن طاوس، عن ابن عباس  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم يوم افتتح مكة ‏\"‏ لا هجرة ولكن جهاد ونية، وإذا استنفرتم فانفروا، فإن هذا بلد حرم الله يوم خلق السموات والأرض، وهو حرام بحرمة الله إلى يوم القيامة، وإنه لم يحل القتال فيه لأحد قبلي، ولم يحل لي إلا ساعة من نهار، فهو حرام بحرمة الله إلى يوم القيامة، لا يعضد شوكه، ولا ينفر صيده، ولا يلتقط لقطته إلا من عرفها، ولا يختلى خلاها ‏\"‏‏.‏ قال العباس يا رسول الله‏.‏ إلا الإذخر، فإنه لقينهم ولبيوتهم‏.‏ قال قال ‏\"‏ إلا الإذخر ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     On the day of the conquest of Mecca, the Prophet said, \"There is no more emigration (from Mecca) but Jihad and intentions, and whenever you are called for Jihad, you should go immediately. No doubt, Allah has made this place (Mecca) a sanctuary since the creation of the heavens and the earth and will remain a sanctuary till the Day of Resurrection as Allah has ordained its sanctity. Fighting was not permissible in it for anyone before me, and even for me it was allowed only for a portion of a day. So, it is a sanctuary with Allah's sanctity till the Day of Resurrection. Its thorns should not be uprooted and its game should not be chased; and its luqata (fallen things) should not be picked up except by one who would announce that publicly, and its vegetation (grass etc.) should not be cut.\" Al-`Abbas said, \"O Allah's Apostle! Except Al-Idhkhir, (for it is used by their blacksmiths and for their domestic purposes).\" So, the Prophet said, \"Except Al-Idhkhir.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11028",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1870",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا قتيبة، حدثنا جرير، عن منصور، عن الحكم، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال وقصت برجل محرم ناقته، فقتلته، فأتي به رسول الله صلى الله عليه وسلم فقال ‏\"‏ اغسلوه، وكفنوه، ولا تغطوا رأسه، ولا تقربوه طيبا، فإنه يبعث يهل ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A man was crushed to death by his she-camel and was brought to Allah's Apostle who said, \"Give him a bath and shroud him, but do not cover his head, and do not bring any perfume near to him, as he will be resurrected reciting Talbiya.\"",
      "chain": [
        "30367",
        "20028",
        "11067",
        "11069",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1937",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن الزهري، عن حميد بن عبد الرحمن، عن أبي هريرة  رضى الله عنه  جاء رجل إلى النبي صلى الله عليه وسلم فقال إن الأخر وقع على امرأته في رمضان‏.‏ فقال ‏\"‏ أتجد ما تحرر رقبة ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ فتستطيع أن تصوم شهرين متتابعين ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ أفتجد ما تطعم به ستين مسكينا ‏\"‏‏.‏ قال لا‏.‏ قال فأتي النبي صلى الله عليه وسلم بعرق فيه تمر  وهو الزبيل  قال ‏\"‏ أطعم هذا عنك ‏\"‏‏.‏ قال على أحوج منا ما بين لابتيها أهل بيت أحوج منا‏.‏ قال ‏\"‏ فأطعمه أهلك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     A man came to the Prophet and said, \"I had sexual intercourse with my wife on Ramadan (while fasting).\" The Prophet asked him, \"Can you afford to manumit a slave?\" He replied in the negative. The Prophet asked him, \"Can you fast for two successive months?\" He replied in the negative. He asked him, \"Can you afford to feed sixty poor persons?\" He replied in the negative. (Abu Huraira added): Then a basket full of dates was brought to the Prophet and he said (to that man), \"Feed (poor people) with this by way of atonement.\" He said, \"(Should I feed it) to poorer people than we? There is no poorer house than ours between its (Medina's) mountains.\" The Prophet said, \"Then feed your family with it.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "2065",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن أبي وائل، عن مسروق، عن عائشة  رضى الله عنها  قالت قال النبي صلى الله عليه وسلم ‏\"‏ إذا أنفقت المرأة من طعام بيتها، غير مفسدة، كان لها أجرها بما أنفقت، ولزوجها بما كسب، وللخازن مثل ذلك، لا ينقص بعضهم أجر بعض شيئا ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet said, \"If a woman gives in charity from her house meals without wasting (i.e. being extravagant), she will get the reward for her giving, and her husband will also get the reward for his earning and the storekeeper will also get a similar reward. The acquisition of the reward of none of them will reduce the reward of the others.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11353",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "2119",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا قتيبة، حدثنا جرير، عن الأعمش، عن أبي صالح، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ صلاة أحدكم في جماعة تزيد على صلاته في سوقه وبيته بضعا وعشرين درجة، وذلك بأنه إذا توضأ فأحسن الوضوء، ثم أتى المسجد، لا يريد إلا الصلاة، لا ينهزه إلا الصلاة، لم يخط خطوة إلا رفع بها درجة، أو حطت عنه بها خطيئة، والملائكة تصلي على أحدكم ما دام في مصلاه الذي يصلي فيه اللهم صل عليه، اللهم ارحمه، ما لم يحدث فيه، ما لم يؤذ فيه ‏\"‏‏.‏ وقال ‏\"‏ أحدكم في صلاة ما كانت الصلاة تحبسه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The congregational prayer of anyone amongst you is more than twenty (five or twenty seven) times in reward than his prayer in the market or in his house, for if he performs ablution completely and then goes to the mosque with the sole intention of performing the prayer, and nothing urges him to proceed to the mosque except the prayer, then, on every step which he takes towards the mosque, he will be raised one degree or one of his sins will be forgiven. The angels will keep on asking Allah's forgiveness and blessings for everyone of you so long as he keeps sitting at his praying place. The angels will say, 'O Allah, bless him! O Allah, be merciful to him!' as long as he does not do Hadath or a thing which gives trouble to the other.\" The Prophet further said, \"One is regarded in prayer so long as one is waiting for the prayer.\"",
      "chain": [
        "30367",
        "20028",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2127",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عبدان، أخبرنا جرير، عن مغيرة، عن الشعبي، عن جابر  رضى الله عنه  قال توفي عبد الله بن عمرو بن حرام، وعليه دين فاستعنت النبي صلى الله عليه وسلم على غرمائه أن يضعوا من دينه، فطلب النبي صلى الله عليه وسلم إليهم، فلم يفعلوا، فقال لي النبي صلى الله عليه وسلم ‏\"‏ اذهب فصنف تمرك أصنافا، العجوة على حدة، وعذق زيد على حدة، ثم أرسل إلى ‏\"‏‏.‏ ففعلت، ثم أرسلت إلى النبي صلى الله عليه وسلم فجلس على أعلاه، أو في وسطه ثم قال ‏\"‏ كل للقوم ‏\"‏‏.‏ فكلتهم حتى أوفيتهم الذي لهم، وبقي تمري، كأنه لم ينقص منه شىء‏.‏ وقال فراس عن الشعبي حدثني جابر عن النبي صلى الله عليه وسلم، فما زال يكيل لهم حتى أداه، وقال هشام عن وهب عن جابر قال النبي صلى الله عليه وسلم ‏\"‏ جذ له فأوف له ‏\"‏‏.‏",
      "text_en": " Narrated Jabir:                     `Abdullah bin `Amr bin Haram died and was in debt to others. I asked the Prophet to intercede with his creditors for some reduction in the debts. The Prophet requested them (to reduce the debts) but they refused. The Prophet said to me, \"Go and put your dates (In heaps) according to their different kinds. The Ajwa on one side, the cluster of Ibn Zaid on another side, etc.. Then call me.\" I did that and called the Prophet He came and sat at the head or in the middle of the heaps and ordered me. Measure (the dates) for the people (creditors).\" I measured for them till I paid all the debts. My dates remained as it nothing had been taken from them. In other narrations, Jabir said; The Prophet said, \"He (i.e. `Abdullah) continued measuring for them till he paid all the debts.\" The Prophet said (to `Abdullah), \"Cut (clusters) for him (i.e. one of the creditors) and measure for him fully.\"",
      "chain": [
        "30349",
        "20028",
        "11072",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "2245",
      "source": " Sahih Bukhari ",
      "chapter": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam) - كتاب السلم",
      "chapter_no": "35",
      "text_ar": "حدثنا إسحاق، حدثنا خالد بن عبد الله، عن الشيباني، عن محمد بن أبي مجالد، بهذا وقال فنسلفهم في الحنطة والشعير‏.‏ وقال عبد الله بن الوليد عن سفيان حدثنا الشيباني وقال والزيت‏.‏ حدثنا قتيبة حدثنا جرير عن الشيباني وقال في الحنطة والشعير والزبيب‏.‏",
      "text_en": " Narrated Muhammad bin Abi Al-Mujalid:                     as above (446) and said, \"We used to pay them in advance for wheat and barley (to be delivered later). Narrated Ash-Shaibani--\"And also for oil.\"Narrated Ash-Shaibani:who said \"We used to pay in advance for wheat barley and dried grapes.\"",
      "chain": [
        "30312",
        "20423",
        "11352",
        "20012",
        "11352",
        "30367",
        "20028",
        "11352"
      ]
    },
    {
      "hadith_no": "2385",
      "source": " Sahih Bukhari ",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد، أخبرنا جرير، عن المغيرة، عن الشعبي، عن جابر بن عبد الله  رضى الله عنهما  قال غزوت مع النبي صلى الله عليه وسلم قال ‏\"‏ كيف ترى بعيرك أتبيعنيه ‏\"‏‏.‏ قلت نعم‏.‏ فبعته إياه، فلما قدم المدينة غدوت إليه بالبعير، فأعطاني ثمنه‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     While I was in the company of the Prophet in one of his Ghazawat, he asked, \"What is wrong with your camel? Will you sell it?\" I replied in the affirmative and sold it to him. When he reached Medina, I took the camel to him in the morning and he paid me its price.",
      "chain": [
        "30213",
        "20028",
        "166",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "2408",
      "source": " Sahih Bukhari ",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا عثمان، حدثنا جرير، عن منصور، عن الشعبي، عن وراد، مولى المغيرة بن شعبة عن المغيرة بن شعبة، قال قال النبي صلى الله عليه وسلم ‏\"‏ إن الله حرم عليكم عقوق الأمهات، ووأد البنات، ومنع وهات، وكره لكم قيل وقال، وكثرة السؤال، وإضاعة المال ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     The Prophet said, \"Allah has forbidden for you, (1) to be undutiful to your mothers, (2) to bury your daughters alive, (3) to not to pay the rights of the others (e.g. charity, etc.) and (4) to beg of men (begging). And Allah has hated for you (1) vain, useless talk, or that you talk too much about others, (2) to ask too many questions, (in disputed religious matters) and (3) to waste the wealth (by extravagance).",
      "chain": [
        "4",
        "20028",
        "11067",
        "11052",
        "166"
      ]
    },
    {
      "hadith_no": "2513",
      "source": " Sahih Bukhari ",
      "chapter": "Mortgaging - كتاب الرهن",
      "chapter_no": "48",
      "text_ar": "حدثنا قتيبة، حدثنا جرير، عن الأعمش، عن إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  قالت اشترى رسول الله صلى الله عليه وسلم من يهودي طعاما ورهنه درعه‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle bought some foodstuff from a Jew and mortgaged his armor to him.",
      "chain": [
        "30367",
        "20028",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2515",
      "source": " Sahih Bukhari ",
      "chapter": "Mortgaging - كتاب الرهن",
      "chapter_no": "48",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن منصور، عن أبي وائل، قال قال عبد الله  رضى الله عنه من حلف على يمين، يستحق بها مالا وهو فيها فاجر، لقي الله وهو عليه غضبان، فأنزل الله تصديق ذلك ‏{‏إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا‏}‏ فقرأ إلى ‏{‏عذاب أليم‏}‏‏.‏ثم إن الأشعث بن قيس خرج إلينا فقال ما يحدثكم أبو عبد الرحمن قال فحدثناه قال فقال صدق لفي والله أنزلت، كانت بيني وبين رجل خصومة في بئر فاختصمنا إلى رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ شاهدك أو يمينه ‏\"‏‏.‏ قلت إنه إذا يحلف ولا يبالي‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف على يمين يستحق بها مالا هو فيها فاجر، لقي الله وهو عليه غضبان ‏\"‏‏.‏ فأنزل الله تصديق ذلك، ثم اقترأ هذه الآية ‏{‏إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا‏}‏ إلى ‏{‏ولهم عذاب أليم‏}‏‏.‏",
      "text_en": "  Narrated Abu Wail:                       Abdullah (bin Mas'ud) said, \"Whoever took a false oath in order to grab somebody's property will meet Allah while Allah will be angry with him.\" Allah revealed the following verse to confirm that:--\"Verily! Those who purchase a small gain at the cost of Allah's covenant And their oaths...a painful torment.\" (3.77)   Al-Ash'ath bin Qais came to us and asked as to what Abu Abdur-Rehman (i.e. Ibn Mas'ud) was telling you.\" We related the story to him. On that he said, \"He has told the truth. This verse was revealed about me. I had some dispute with another man regarding a well and we took the case before Allah's Apostle. Allah's Apostle said (to me), \"Produce two witnesses (to support your claim); otherwise the defendant has the right to take an oath (to refute your claim).' I said, 'The defendant would not mind to take a false oath.\" Allah's Apostle then said, 'Whoever took a false oath in order to grab someone else's property will meet Allah, Allah will be angry with him.' Allah then revealed what Confirmed it.\" Al-Ash'ath then recited the following Verse:--\"Verily! Those who purchase a small gain at the cost of Allah's covenant, And their oaths . . . (to) . . . they shall have a painful torment!' (3.77) (See Hadith No. 546)",
      "chain": [
        "30367",
        "20028",
        "11067",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "2536",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  قالت اشتريت بريرة فاشترط أهلها ولاءها، فذكرت ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ أعتقيها، فإن الولاء لمن أعطى الورق ‏\"‏‏.‏ فأعتقتها، فدعاها النبي صلى الله عليه وسلم فخيرها من زوجها فقالت لو أعطاني كذا وكذا ما ثبت عنده‏.‏ فاختارت نفسها‏.‏",
      "text_en": " Narrated `Aisha:                     I bought Buraira but her masters put the condition that her Wala' would be for them. I told the Prophet about it. He said (to me), \"Manumit her as her Wala' will be for the one who pays the price.\" So, I manumitted her. The Prophet called Buraira and gave her the option of either staying with her husband or leaving him. She said, \"Even if he gave me so much money, I would not stay with him,\" and so she preferred her freedom to her husband.",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2543",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا زهير بن حرب، حدثنا جرير، عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  قال لا أزال أحب بني تميم‏.‏ وحدثني ابن سلام أخبرنا جرير بن عبد الحميد عن المغيرة عن الحارث عن أبي زرعة عن أبي هريرة‏.‏ وعن عمارة عن أبي زرعة عن أبي هريرة قال ما زلت أحب بني تميم منذ ثلاث سمعت من رسول الله صلى الله عليه وسلم يقول فيهم، سمعته يقول ‏\"‏ هم أشد أمتي على الدجال ‏\"‏‏.‏ قال وجاءت صدقاتهم، فقال رسول الله صلى الله عليه وسلم ‏\"‏ هذه صدقات قومنا ‏\"‏‏.‏ وكانت سبية منهم عند عائشة‏.‏ فقال ‏\"‏ أعتقيها فإنها من ولد إسماعيل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I have loved the people of the tribe of Bani Tamim ever since I heard, three things, Allah's Apostle said about them. I heard him saying, These people (of the tribe of Bani Tamim) would stand firm against Ad-Dajjal.\" When the Sadaqat (gifts of charity) from that tribe came, Allah's Apostle said, \"These are the Sadaqat (i.e. charitable gifts) of our folk.\" `Aisha had a slave-girl from that tribe, and the Prophet said to `Aisha, \"Manumit her as she is a descendant of Ishmael (the Prophet).",
      "chain": [
        "30022",
        "20028",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "2669",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن أبي وائل، قال قال عبد الله من حلف على يمين يستحق بها مالا لقي الله وهو عليه غضبان، ثم أنزل الله تصديق ذلك ‏{‏إن الذين يشترون بعهد الله وأيمانهم‏}‏ إلى ‏{‏عذاب أليم‏}‏‏.‏  ثم إن الأشعث بن قيس خرج إلينا فقال ما يحدثكم أبو عبد الرحمن فحدثناه بما، قال، فقال صدق لفي أنزلت، كان بيني وبين رجل خصومة في شىء، فاختصمنا إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ شاهداك أو يمينه ‏\"‏‏.‏ فقلت له إنه إذا يحلف ولا يبالي‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ من حلف على يمين يستحق بها مالا وهو فيها فاجر لقي الله وهو عليه غضبان ‏\"‏‏.‏ فأنزل الله تصديق ذلك، ثم اقترأ هذه الآية‏.‏",
      "text_en": " Narrated Abu Wail:                     `Abdullah (bin Mas`ud) said, \"Whoever takes a (false) oath in order to grab some property (unjustly), Allah will be angry with him when he will meet Him. Allah confirmed that through His Divine Revelation: \"Verily! Those who purchase a little gain at the cost of Allah's covenant and their oaths . . . they will have a painful punishment.\" (3.77) Al-Ash'ath bin Qais came to us and asked, 'What is Abu `Abdur-Rahman (i.e. `Abdullah) telling you? 'We told him what he was narrating to us. He said, 'He was telling the truth; this Divine Verse was revealed in connection with me. There was a dispute between me and another man about something and the case was filed before Allah's Apostle who said, 'Produce your two witnesses or else the defendant is to take an oath.' I said, The defendant will surely take a (false) oath caring for nothing.' The Prophet said, 'Whoever takes a false oath in order to grab (other's) property, then Allah will be angry with him when he will meet Him.' Then Allah revealed its confirmation. Al-Ashath then recited the above Divine Verse.\" (3.77)",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11353",
        "485"
      ]
    },
    {
      "hadith_no": "2672",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا جرير بن عبد الحميد، عن الأعمش، عن أبي صالح، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاثة لا يكلمهم الله، ولا ينظر إليهم ولا يزكيهم، ولهم عذاب أليم رجل على فضل ماء بطريق يمنع منه ابن السبيل، ورجل بايع رجلا لا يبايعه إلا للدنيا، فإن أعطاه ما يريد وفى له، وإلا لم يف له، ورجل ساوم رجلا بسلعة بعد العصر، فحلف بالله لقد أعطي به كذا وكذا، فأخذها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"There are three persons whom Allah will neither talk to nor look at, nor purify from (the sins), and they will have a painful punishment. (They are): (1) A man possessed superfluous water on a way and he withheld it from the travelers. (2) a man who gives a pledge of allegiance to a Muslim ruler and gives it only for worldly gains. If the ruler gives him what he wants, he remains obedient to It, otherwise he does not abide by it, and (3) a man bargains with another man after the `Asr prayer and the latter takes a false oath in the Name of Allah) claiming that he has been offered so much for the thing and the former (believes him and) buys it.\"",
      "chain": [
        "30026",
        "20028",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2791",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا موسى، حدثنا جرير، حدثنا أبو رجاء، عن سمرة، قال النبي صلى الله عليه وسلم ‏\"‏ رأيت الليلة رجلين أتياني فصعدا بي الشجرة، فأدخلاني دارا هي أحسن وأفضل، لم أر قط أحسن منها قالا أما هذه الدار فدار الشهداء ‏\"‏‏.‏",
      "text_en": " Narrated Samura:                     The Prophet said, \"Last night two men came to me (in a dream) and made me ascend a tree and then admitted me into a better and superior house, better of which I have never seen. One of them said, 'This house is the house of martyrs.\"",
      "chain": [
        "20040",
        "20028",
        "11440",
        "394"
      ]
    },
    {
      "hadith_no": "2926",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا جرير، عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تقوم الساعة حتى تقاتلوا اليهود حتى يقول الحجر وراءه اليهودي يا مسلم، هذا يهودي ورائي فاقتله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The Hour will not be established until you fight with the Jews, and the stone behind which a Jew will be hiding will say. \"O Muslim! There is a Jew hiding behind me, so kill him.\"",
      "chain": [
        "30123",
        "20028",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "2964",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن أبي وائل، قال قال عبد الله  رضى الله عنه  لقد أتاني اليوم رجل فسألني عن أمر ما دريت ما أرد عليه، فقال أرأيت رجلا مؤديا نشيطا، يخرج مع أمرائنا في المغازي، فيعزم علينا في أشياء لا نحصيها‏.‏ فقلت له والله ما أدري ما أقول لك إلا أنا كنا مع النبي صلى الله عليه وسلم فعسى أن لا يعزم علينا في أمر إلا مرة حتى نفعله، وإن أحدكم لن يزال بخير ما اتقى الله، وإذا شك في نفسه شىء سأل رجلا فشفاه منه، وأوشك أن لا تجدوه، والذي لا إله إلا هو ما أذكر ما غبر من الدنيا إلا كالثغب شرب صفوه وبقي كدره‏.‏",
      "text_en": " Narrated `Abdullah:                     Today a man came to me and asked me a question which I did not know how to answer. He said, \"Tell me, if a wealthy active man, well-equipped with arms, goes out on military expeditions with our chiefs, and orders us to do such things as we cannot do (should we obey him?)\" I replied, \"By Allah, I do not know what to reply you, except that we, were in the company of the Prophet and he used to order us to do a thing once only till we finished it. And no doubt, everyone among you will remain in a good state as long as he obeys Allah. If one is in doubt as to the legality of something, he should ask somebody who would satisfy him, but soon will come a time when you will not find such a man. By Him, except Whom none has the right to be worshipped. I see that the example of what has passed of this life (to what remains thereof) is like a pond whose fresh water has been used up and nothing remains but muddy water.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "2967",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا جرير، عن المغيرة، عن الشعبي، عن جابر بن عبد الله  رضى الله عنهما  قال غزوت مع رسول الله صلى الله عليه وسلم قال فتلاحق بي النبي صلى الله عليه وسلم وأنا على ناضح لنا قد أعيا فلا يكاد يسير فقال لي ‏\"‏ ما لبعيرك ‏\"‏‏.‏ قال قلت عيي‏.‏ قال فتخلف رسول الله صلى الله عليه وسلم فزجره ودعا له، فما زال بين يدى الإبل قدامها يسير‏.‏ فقال لي ‏\"‏ كيف ترى بعيرك ‏\"‏‏.‏ قال قلت بخير قد أصابته بركتك‏.‏ قال ‏\"‏ أفتبيعنيه ‏\"‏‏.‏ قال فاستحييت، ولم يكن لنا ناضح غيره، قال فقلت نعم‏.‏ قال ‏\"‏ فبعنيه ‏\"‏‏.‏ فبعته إياه على أن لي فقار ظهره حتى أبلغ المدينة‏.‏ قال فقلت يا رسول الله إني عروس، فاستأذنته فأذن لي، فتقدمت الناس إلى المدينة حتى أتيت المدينة، فلقيني خالي فسألني عن البعير، فأخبرته بما صنعت فيه فلامني، قال وقد كان رسول الله صلى الله عليه وسلم قال لي حين استأذنته ‏\"‏ هل تزوجت بكرا أم ثيبا ‏\"‏‏.‏ فقلت تزوجت ثيبا‏.‏ فقال ‏\"‏ هلا تزوجت بكرا تلاعبها وتلاعبك ‏\"‏‏.‏ قلت يا رسول الله توفي والدي  أو استشهد  ولي أخوات صغار، فكرهت أن أتزوج مثلهن، فلا تؤدبهن، ولا تقوم عليهن، فتزوجت ثيبا لتقوم عليهن وتؤدبهن‏.‏ قال فلما قدم رسول الله صلى الله عليه وسلم المدينة غدوت عليه بالبعير، فأعطاني ثمنه، ورده على‏.‏ قال المغيرة هذا في قضائنا حسن لا نرى به بأسا‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     I participated in a Ghazwa along with Allah's Apostle The Prophet met me (on the way) while I was riding a camel of ours used for irrigation and it had got so tired that it could hardly walk. The Prophet asked me, \"What is wrong with the camel?\" I replied, \"It has got tired.\" So. Allah's Apostle came from behind it and rebuked it and prayed for it so it started surpassing the other camels and going ahead of them. Then he asked me, \"How do you find your camel (now)?\" I replied, \"I find it quite well, now as it has received your blessings.\" He said, \"Will you sell it to me?\" I felt shy (to refuse his offer) though it was the only camel for irrigation we had. So, I said, \"Yes.\" He said, \"Sell it to me then.\" I sold it to him on the condition that I should keep on riding it till I reached Medina. Then I said, \"O Allah's Apostle! I am a bridegroom,\" and requested him to allow me to go home. He allowed me, and I set out for Medina before the people till I reached Medina, where I met my uncle, who asked me about the camel and I informed him all about it and he blamed me for that. When I took the permission of Allah's Apostle he asked me whether I had married a virgin or a matron and I replied that I had married a matron. He said, \"Why hadn't you married a virgin who would have played with you, and you would have played with her?\" I replied, \"O Allah's Apostle! My father died (or was martyred) and I have some young sisters, so I felt it not proper that I should marry a young girl like them who would neither teach them manners nor serve them. So, I have married a matron so that she may serve them and teach them manners.\" When Allah's Apostle arrived in Medina, I took the camel to him the next morning and he gave me its price and gave me the camel itself as well.",
      "chain": [
        "30123",
        "20028",
        "166",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "3046",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن منصور، عن أبي وائل، عن أبي موسى  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ فكوا العاني  يعني الأسير  وأطعموا الجائع وعودوا المريض ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"Free the captives, feed the hungry and pay a visit to the sick.\"",
      "chain": [
        "30367",
        "20028",
        "11067",
        "11353",
        "41"
      ]
    },
    {
      "hadith_no": "3121",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا إسحاق، سمع جريرا، عن عبد الملك، عن جابر بن سمرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا هلك كسرى فلا كسرى بعده، وإذا هلك قيصر فلا قيصر بعده، والذي نفسي بيده، لتنفقن كنوزهما في سبيل الله ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin Samura:                     Allah's Apostle said, \"When Khosrau is ruined, there will be no Khosrau after him; and when Caesar is ruined, their will be no Caesar after him. By Him in Whose Hands my life is, you will spend their treasures in Allah's Cause.\"",
      "chain": [
        "30312",
        "20028",
        "11368",
        "393"
      ]
    },
    {
      "hadith_no": "3150",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن أبي وائل، عن عبد الله  رضى الله عنه  قال لما كان يوم حنين آثر النبي صلى الله عليه وسلم أناسا في القسمة، فأعطى الأقرع بن حابس مائة من الإبل، وأعطى عيينة مثل ذلك، وأعطى أناسا من أشراف العرب، فآثرهم يومئذ في القسمة‏.‏ قال رجل والله إن هذه القسمة ما عدل فيها، وما أريد بها وجه الله‏.‏ فقلت والله لأخبرن النبي صلى الله عليه وسلم‏.‏ فأتيته فأخبرته فقال ‏\"‏ فمن يعدل إذا لم يعدل الله ورسوله رحم الله موسى قد أوذي بأكثر من هذا فصبر ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     On the day (of the battle) of Hunain, Allah's Apostle favored some people in the distribution of the booty (to the exclusion of others); he gave Al-Aqra' bin H`Abis one-hundred camels and he gave 'Uyaina the same amount, and also gave to some of the eminent Arabs, giving them preference in this regard. Then a person came and said, \"By Allah, in this distribution justice has not been observed, nor has Allah's Pleasure been aimed at.\" I said (to him), \"By Allah, I will inform the Prophet (of what you have said), \"I went and informed him, and he said, \"If Allah and His Apostle did not act justly, who else would act justly. May Allah be merciful to Moses, for he was harmed with more than this, yet he kept patient.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "3178",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا جرير، عن الأعمش، عن عبد الله بن مرة، عن مسروق، عن عبد الله بن عمرو  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أربع خلال من كن فيه كان منافقا خالصا من إذا حدث كذب، وإذا وعد أخلف، وإذا عاهد غدر وإذا خاصم فجر، ومن كانت فيه خصلة منهن كانت فيه خصلة من النفاق حتى يدعها ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     Allah's Apostle said, \"Whoever has (the following) four characteristics will be a pure hypocrite: \"If he speaks, he tells a lie; if he gives a promise, he breaks it, if he makes a covenant he proves treacherous; and if he quarrels, he behaves in a very imprudent evil insulting manner (unjust). And whoever has one of these characteristics, has one characteristic of a hypocrite, unless he gives it us.\"",
      "chain": [
        "30367",
        "20028",
        "11060",
        "11362",
        "11018",
        "29"
      ]
    },
    {
      "hadith_no": "3189",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا جرير، عن منصور، عن مجاهد، عن طاوس، عن ابن عباس  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم يوم فتح مكة ‏\"‏ لا هجرة ولكن جهاد ونية، وإذا استنفرتم فانفروا ‏\"‏‏.‏ وقال يوم فتح مكة ‏\"‏ إن هذا البلد حرمه الله يوم خلق السموات والأرض، فهو حرام بحرمة الله إلى يوم القيامة، وإنه لم يحل القتال فيه لأحد قبلي، ولم يحل لي إلا ساعة من نهار، فهو حرام بحرمة الله إلى يوم القيامة، لا يعضد شوكه، ولا ينفر صيده، ولا يلتقط لقطته إلا من عرفها، ولا يختلى خلاه ‏\"‏‏.‏ فقال العباس يا رسول الله إلا الإذخر، فإنه لقينهم ولبيوتهم‏.‏ قال ‏\"‏ إلا الإذخر ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle said on the day of the conquest of Mecca, \"There is no migration now, but there is Jihad (i.e.. holy battle) and good intentions. And when you are called for Jihad, you should come out at once\" Allah's Apostle also said, on the day of the conquest of Mecca, \"Allah has made this town a sanctuary since the day He created the Heavens and the Earth. So, it is a sanctuary by Allah's Decree till the Day of Resurrection. Fighting in it was not legal for anyone before me, and it was made legal for me only for an hour by daytime. So, it (i.e. Mecca) is a sanctuary by Allah's Decree till the Day of Resurrection. Its thorny bushes should not be cut, and its game should not be chased, its fallen property (i.e. Luqata) should not be picked up except by one who will announce it publicly; and its grass should not be uprooted,\" On that Al-`Abbas said, \"O Allah's Apostle! Except the Idhkhir, because it is used by the goldsmiths and by the people for their houses.\" On that the Prophet said, \"Except the Idhkhir.\"",
      "chain": [
        "30026",
        "20028",
        "11067",
        "11028",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "3236",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا موسى، حدثنا جرير، حدثنا أبو رجاء، عن سمرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ رأيت الليلة رجلين أتياني قالا الذي يوقد النار مالك خازن النار، وأنا جبريل، وهذا ميكائيل ‏\"‏‏.‏",
      "text_en": " Narrated Samura:                     The Prophet said, \"Last night I saw (in a dream) two men coming to me. One of them said, \"The person who kindles the fire is Malik, the gate-keeper of the (Hell) Fire, and I am Gabriel, and this is Michael.\"",
      "chain": [
        "20040",
        "20028",
        "11440",
        "394"
      ]
    },
    {
      "hadith_no": "3270",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن منصور، عن أبي وائل، عن عبد الله  رضى الله عنه  قال ذكر عند النبي صلى الله عليه وسلم رجل نام ليله حتى أصبح، قال ‏\"‏ ذاك رجل بال الشيطان في أذنيه  أو قال  في أذنه ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     It was mentioned before the Prophet that there was a man who slept the night till morning (after sunrise). The Prophet said, \"He is a man in whose ears (or ear) Satan had urinated.\"",
      "chain": [
        "30203",
        "20028",
        "11067",
        "11353",
        "16"
      ]
    }
  ],
  "total_hadiths": 626
}