{
  "id": "20033",
  "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
  "full_name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "135",
      "date_gregorian": "NA",
      "date_display": [
        "135 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "198",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة ثبت ]",
      "Fiqh",
      "Hadith"
    ],
    "tags": [
      "Basri",
      "Client",
      "hafiz",
      "Imam"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "34018",
      "name": "Ibrahim bin 'Abdur Rahman إبراهيم بن عبد الرحمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "37754",
      "name": "Musa bin 'Abdur Rahman bin Mhda موسى بن عبد الرحمن بن مهدي",
      "grade": "3rd Century AH"
    }
  ],
  "teachers": [
    {
      "id": "11555",
      "name": "Ayman bin Nabil أيمن بن نابل الحبشي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10704",
      "name": "'Ikrama bin 'Ammar عكرمة بن عمار العجلي أبو عمار اليمامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11583",
      "name": "Khalid bin Dinar Abu Khalida خالد بن دينار التميمي السعدي أبو خلدة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11307",
      "name": "Mahdi bin Maymun al-Azdi مهدي بن ميمون الأزدي المعولي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20220",
      "name": "Harb bin Shadaad al-Yashkari حرب بن شداد اليشكري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20719",
      "name": "Muhammad bin Rashid al-Mkhwly محمد بن راشد المكحولي الخزاعي الدمشقي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20358",
      "name": "Malik bin Mghwl مالك بن مغول",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20299",
      "name": "Wahayb bin Khalid bin 'Ajlan al-Bahli وهيب بن خالد بن عجلان الباهلي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20519",
      "name": "Hisham bin Sa'd al-Madni هشام بن سعد المدني أبو عباد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20297",
      "name": "Hmam bin Yahya bin Dinar همام بن يحيى بن دينار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11304",
      "name": "al-Muthna bin Sa'id al-Daba'i المثنى بن سعيد الضبعي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20234",
      "name": "Saleem bin Hiyyan سليم بن حيان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20550",
      "name": "Salam bin Abi Mut'ia سلام بن أبي مطيع",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20189",
      "name": "Ibrahim bin Nafi' al-Makhzumi إبراهيم بن نافع المخزومي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20429",
      "name": "Skhr bin Jwyryh Abu صخر بن جويرية أبو نافع مولى بني",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20718",
      "name": "'Imran bin Da'ud al-'Ami Abu al-'Awwam عمران بن داود العمي أبو العوام القطان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20289",
      "name": "Mnswr bin Sa'd al-Basri منصور بن سعد البصري صاحب اللؤلؤ",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "37754",
      "name": "Musa bin 'Abdur Rahman bin Mhda موسى بن عبد الرحمن بن مهدي",
      "grade": "3rd Century AH"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "5",
      "name": "Ali ibn Abi Talib ( علي بن أبي طالب بن عبد المطلب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30399",
      "name": "Yahya bin Yahya bin Bukayr يحيى بن يحيى بن بكير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38072",
      "name": "Abu Thaur al-Kalbi إبراهيم بن خالد أبو ثور الكلبي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36618",
      "name": "al-Qasim bin Salam القاسم بن سلام",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30297",
      "name": "Ahmed bin Snan bin Asad أحمد بن سنان بن أسد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30426",
      "name": "Ibrahim bin Muhammad bin 'Ar'ara إبراهيم بن محمد بن عرعرة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30351",
      "name": "'Abdullah bin Muhammad al-Musandi عبد الله بن محمد المسندي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30153",
      "name": "'Amr bin 'Ali bin Bahr al-Bahli عمرو بن علي بن بحر الباهلي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30160",
      "name": "Muhammad bin Bashar Bindar محمد بن بشار بندار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30550",
      "name": "'Abdullah bin Hashim عبد الله بن هاشم بن حيان",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "391",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عمرو بن عباس، قال حدثنا ابن المهدي، قال حدثنا منصور بن سعد، عن ميمون بن سياه، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صلى صلاتنا، واستقبل قبلتنا، وأكل ذبيحتنا، فذلك المسلم الذي له ذمة الله وذمة رسوله، فلا تخفروا الله في ذمته ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle said, \"Whoever prays like us and faces our Qibla and eats our slaughtered animals is a Muslim and is under Allah's and His Apostle's protection. So do not betray Allah by betraying those who are in His protection.\"",
      "chain": [
        "30152",
        "20033",
        "20289",
        "11614",
        "19"
      ]
    },
    {
      "hadith_no": "975",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا عمرو بن عباس، قال حدثنا عبد الرحمن، حدثنا سفيان، عن عبد الرحمن، قال سمعت ابن عباس، قال خرجت مع النبي صلى الله عليه وسلم يوم فطر أو أضحى، فصلى ثم خطب، ثم أتى النساء فوعظهن وذكرهن، وأمرهن بالصدقة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I (in my boyhood) went out with the Prophet on the day of `Id ul Fitr or Id-ul-Adha. The Prophet prayed and then delivered the Khutba and then went towards the women, preached and advised them and ordered them to give alms.",
      "chain": [
        "30152",
        "20033",
        "20012",
        "10530",
        "17"
      ]
    },
    {
      "hadith_no": "1297",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن، حدثنا سفيان، عن الأعمش، عن عبد الله بن مرة، عن مسروق، عن عبد الله  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ليس منا من ضرب الخدود، وشق الجيوب، ودعا بدعوى الجاهلية ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet said, \"He who slaps the cheeks, tears the clothes and follows the tradition of the Days of Ignorance is not from us.\"",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11060",
        "11362",
        "11018",
        "16"
      ]
    },
    {
      "hadith_no": "1903",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن، حدثنا سفيان، عن الأعمش، عن إبراهيم التيمي، عن أبيه، عن علي  رضى الله عنه  قال ما عندنا شىء إلا كتاب الله، وهذه الصحيفة عن النبي صلى الله عليه وسلم ‏\"‏ المدينة حرم، ما بين عائر إلى كذا، من أحدث فيها حدثا، أو آوى محدثا، فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل منه صرف ولا عدل ‏\"‏‏.‏ وقال ‏\"‏ ذمة المسلمين واحدة، فمن أخفر مسلما فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل منه صرف ولا عدل، ومن تولى قوما بغير إذن مواليه، فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل منه صرف ولا عدل ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     We have nothing except the Book of Allah and this written paper from the Prophet (wherein is written:) Medina is a sanctuary from the 'Air Mountain to such and such a place, and whoever innovates in it an heresy or commits a sin, or gives shelter to such an innovator in it will incur the curse of Allah, the angels, and all the people, none of his compulsory or optional good deeds of worship will be accepted. And the asylum (of protection) granted by any Muslim is to be secured (respected) by all the other Muslims; and whoever betrays a Muslim in this respect incurs the curse of Allah, the angels, and all the people, and none of his compulsory or optional good deeds of worship will be accepted, and whoever (freed slave) befriends (take as masters) other than his manumitters without their permission incurs the curse of Allah, the angels, and all the people, and none of his compulsory or optional good deeds of worship will be accepted.",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11060",
        "11322",
        "11405",
        "5"
      ]
    },
    {
      "hadith_no": "1916",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا عمرو بن عباس، حدثنا عبد الرحمن، حدثنا سفيان، عن محمد بن المنكدر، عن جابر  رضى الله عنه  جاء أعرابي النبي صلى الله عليه وسلم فبايعه على الإسلام، فجاء من الغد محموما، فقال أقلني، فأبى ثلاث مرار، فقال ‏\"‏ المدينة كالكير، تنفي خبثها، وينصع طيبها ‏\"‏‏.‏",
      "text_en": " Narrated Jabir:                     A bedouin came to the Prophet and gave a pledge of allegiance for embracing Islam. The next day he came with fever and said (to the Prophet ), \"Please cancel my pledge (of embracing Islam and of emigrating to Medina).\" The Prophet refused (that request) three times and said, \"Medina is like a furnace, it expels out the impurities (bad persons) and selects the good ones and makes them perfect.\"",
      "chain": [
        "30152",
        "20033",
        "20012",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "2040",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا عبد الرحمن، حدثنا سفيان، عن ابن جريج، عن سليمان الأحول، خال ابن أبي نجيح عن أبي سلمة، عن أبي سعيد،‏.‏ قال سفيان وحدثنا محمد بن عمرو، عن أبي سلمة، عن أبي سعيد،‏.‏ قال وأظن أن ابن أبي لبيد، حدثنا عن أبي سلمة، عن أبي سعيد  رضى الله عنه  قال اعتكفنا مع رسول الله صلى الله عليه وسلم العشر الأوسط، فلما كان صبيحة عشرين نقلنا متاعنا فأتانا رسول الله صلى الله عليه وسلم قال ‏\"‏ من كان اعتكف فليرجع إلى معتكفه فإني رأيت هذه الليلة، ورأيتني أسجد في ماء وطين ‏\"‏‏.‏ فلما رجع إلى معتكفه، وهاجت السماء، فمطرنا فوالذي بعثه بالحق لقد هاجت السماء من آخر ذلك اليوم، وكان المسجد عريشا، فلقد رأيت على أنفه وأرنبته أثر الماء والطين‏.‏",
      "text_en": " Narrated Abu Sa`id:                     We practiced I`tikaf with Allah's Apostle in the middle ten days (of Ramadan). In the morning of the twentieth (of Ramadan) we shifted our baggage, but Allah's Apostle came to us and said, \"Whoever was m I`tikaf should return to his place of I`tikaf, for I saw (i.e. was informed about the date of) this Night (of Qadr) and saw myself prostrating in mud and water.\" When I returned to my place the sky was overcast with clouds and it rained. By Him Who sent Muhammad with the Truth, the sky was covered with clouds from the end of that day, and the mosque which was roofed with leafstalks of date palm trees (leaked with rain) and I saw the trace of mud and water over the nose of the Prophet and its tip.",
      "chain": [
        "20033",
        "20012",
        "11070",
        "10567",
        "20012",
        "11220",
        "10567",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "2334",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا صدقة، أخبرنا عبد الرحمن، عن مالك، عن زيد بن أسلم، عن أبيه، قال قال عمر  رضى الله عنه  لولا آخر المسلمين ما فتحت قرية إلا قسمتها بين أهلها كما قسم النبي صلى الله عليه وسلم خيبر‏.‏",
      "text_en": " Narrated Zaid bin Aslam from his father:                     `Umar said, \"But for the future Muslim generations, I would have distributed the land of the villages I conquer among the soldiers as the Prophet distributed the land of Khaibar.\"",
      "chain": [
        "30343",
        "20033",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "2427",
      "source": " Sahih Bukhari ",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "حدثنا عمرو بن عباس، حدثنا عبد الرحمن، حدثنا سفيان، عن ربيعة، حدثني يزيد، مولى المنبعث عن زيد بن خالد الجهني  رضى الله عنه  قال جاء أعرابي النبي صلى الله عليه وسلم فسأله عما يلتقطه فقال ‏\"‏ عرفها سنة، ثم احفظ عفاصها ووكاءها، فإن جاء أحد يخبرك بها، وإلا فاستنفقها ‏\"‏‏.‏ قال يا رسول الله فضالة الغنم قال ‏\"‏ لك أو لأخيك أو للذئب ‏\"‏‏.‏ قال ضالة الإبل فتمعر وجه النبي صلى الله عليه وسلم‏.‏ فقال ‏\"‏ ما لك ولها، معها حذاؤها وسقاؤها، ترد الماء وتأكل الشجر ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     A bedouin went to the Prophet and asked him about picking up a lost thing. The Prophet said, \"Make public announcement about it for one year. Remember the description of its container and the string with which it is tied; and if somebody comes and claims it and describes it correctly, (give it to him); otherwise, utilize it.\" He said, \"O Allah's Apostle! What about a lost sheep?\" The Prophet said, \"It is for you, for your brother (i.e. its owner), or for the wolf.\" He further asked, \"What about a lost camel?\" On that the face of the Prophet became red (with anger) and said, \"You have nothing to do with it, as it has its feet, its water reserve and can reach places of water and drink, and eat trees.\"",
      "chain": [
        "30152",
        "20033",
        "20012",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "hadith_no": "2912",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عمرو بن عباس، حدثنا عبد الرحمن، عن سفيان، عن أبي إسحاق، عن عمرو بن الحارث، قال ما ترك النبي صلى الله عليه وسلم إلا سلاحه وبغلة بيضاء وأرضا جعلها صدقة‏.‏",
      "text_en": " Narrated `Amr bin Al-Harith:                     The Prophet did not leave behind him after his death, anything except his arms, his white mule, and a piece of land at Khaibar which he left to be given in charity .",
      "chain": [
        "30152",
        "20033",
        "20012",
        "11049",
        "20377"
      ]
    },
    {
      "hadith_no": "3125",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا صدقة، أخبرنا عبد الرحمن، عن مالك، عن زيد بن أسلم، عن أبيه، قال قال عمر  رضى الله عنه لولا آخر المسلمين ما فتحت قرية إلا قسمتها بين أهلها كما قسم النبي صلى الله عليه وسلم خيبر‏.‏",
      "text_en": " Narrated Aslam:                     `Umar said, \"Were it not for those Muslims who have not come to existence yet, I would have distributed (the land of) every town I conquer among the fighters as the Prophet distributed the land of Khaibar.\"",
      "chain": [
        "30343",
        "20033",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "3262",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثني عمرو بن عباس، حدثنا عبد الرحمن، حدثنا سفيان، عن أبيه، عن عباية بن رفاعة، قال أخبرني رافع بن خديج، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ الحمى من فور جهنم، فأبردوها عنكم بالماء ‏\"‏‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     I heard the Prophet saying, \"Fever is from the heat of the (Hell) Fire; so cool it with water.\"",
      "chain": [
        "30152",
        "20033",
        "20012",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "3390",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "أخبرني عبدة، حدثنا عبد الصمد، عن عبد الرحمن، عن أبيه، عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ الكريم ابن الكريم ابن الكريم ابن الكريم يوسف بن يعقوب بن إسحاق بن إبراهيم عليهم السلام ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                      The Prophet said, \"The honorable, the son of the honorable, the son of the honorable, (was) Joseph, the son of Jacob! the son of Isaac, the son of Abraham.\"",
      "chain": [
        "20337",
        "20250",
        "20033",
        "18"
      ]
    },
    {
      "hadith_no": "3555",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا قبيصة، حدثنا سفيان،‏.‏ حدثني محمد بن بشار، حدثنا ابن مهدي، عن سفيان، عن عبد الملك بن عمير، عن عبد الرحمن بن أبي بكرة، عن أبيه، قال النبي صلى الله عليه وسلم ‏\"‏ أرأيتم إن كان جهينة ومزينة وأسلم وغفار خيرا من بني تميم وبني أسد، ومن بني عبد الله بن غطفان ومن بني عامر بن صعصعة ‏\"‏‏.‏ فقال رجل خابوا وخسروا‏.‏ فقال ‏\"‏ هم خير من بني تميم ومن بني أسد، ومن بني عبد الله بن غطفان، ومن بني عامر بن صعصعة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet said, \"Do you think that the tribes of Juhaina, Muzaina, Aslam and Ghifar are better than the tribes of Bani Tamim, Bani Asad, Bam `Abdullah bin Ghatafan and Bani Amir bin Sasaa?\" A man said, \"They were unsuccessful and losers.\" The Prophet added,\" (Yes), they are better than the tribes of Bani Tamim, Bani Asad, Bani `Abdullah bin Ghatafan and Bani Amir bin Sasaa.\"",
      "chain": [
        "20351",
        "30160",
        "20033",
        "20005",
        "11368",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "3603",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني محمد بن بشار، حدثنا يحيى، وابن، مهدي قالا حدثنا شعبة، مثله وإذا كره شيئا عرف في وجهه‏.‏",
      "text_en": " Narrated Shuba:                     A similar Hadith (i e. No. 762) with this addition: And if he (i.e. the Prophet) disliked something, the sign of aversion would appear on his face.",
      "chain": [
        "30160",
        "20031",
        "20033"
      ]
    },
    {
      "hadith_no": "3674",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني عمرو بن عباس، حدثنا ابن مهدي، حدثنا سفيان، عن محمد بن المنكدر، عن جابر  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ هل لكم من أنماط ‏\"‏‏.‏ قلت وأنى يكون لنا الأنماط قال ‏\"‏ أما إنه سيكون لكم الأنماط ‏\"‏‏.‏ فأنا أقول لها  يعني امرأته  أخري عني أنماطك‏.‏ فتقول ألم يقل النبي صلى الله عليه وسلم ‏\"‏ إنها ستكون لكم الأنماط ‏\"‏‏.‏ فأدعها‏.‏",
      "text_en": " Narrated Jabir:                     (Once) the Prophet said, \"Have you got carpets?\" I replied, \"Whence can we get carpets?\" He said, \"But you shall soon have carpets.\" I used to say to my wife, \"Remove your carpets from my sight,\" but she would say, \"Didn't the Prophet tell you that you would soon have carpets?\" So I would give up my request.",
      "chain": [
        "30152",
        "20033",
        "20012",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "3886",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني عمرو بن عباس، حدثنا عبد الرحمن، حدثنا سفيان، عن أبي إسحاق، عن عمرو بن ميمون، قال قال عمر  رضى الله عنه  إن المشركين كانوا لا يفيضون من جمع حتى تشرق الشمس على ثبير، فخالفهم النبي صلى الله عليه وسلم فأفاض قبل أن تطلع الشمس‏.‏",
      "text_en": " Narrated `Umar:                     The pagans used not to leave Jam' (i.e. Muzdalifa) till the sun had risen on Thabir mountain. The Prophet contradicted them by leaving (Muzdalifa) before the sun rose.",
      "chain": [
        "30152",
        "20033",
        "20012",
        "11049",
        "11382",
        "3"
      ]
    },
    {
      "hadith_no": "3909",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني عمرو بن عباس، حدثنا عبد الرحمن بن مهدي، حدثنا المثنى، عن أبي جمرة، عن ابن عباس  رضى الله عنهما  قال لما بلغ أبا ذر مبعث النبي صلى الله عليه وسلم قال لأخيه اركب إلى هذا الوادي، فاعلم لي علم هذا الرجل الذي يزعم أنه نبي، يأتيه الخبر من السماء، واسمع من قوله، ثم ائتني‏.‏ فانطلق الأخ حتى قدمه وسمع من قوله، ثم رجع إلى أبي ذر، فقال له رأيته يأمر بمكارم الأخلاق، وكلاما ما هو بالشعر‏.‏ فقال ما شفيتني مما أردت، فتزود وحمل شنة له فيها ماء حتى قدم مكة، فأتى المسجد، فالتمس النبي صلى الله عليه وسلم ولا يعرفه، وكره أن يسأل عنه حتى أدركه بعض الليل، فرآه علي فعرف أنه غريب‏.‏ فلما رآه تبعه، فلم يسأل واحد منهما صاحبه عن شىء حتى أصبح، ثم احتمل قربته وزاده إلى المسجد، وظل ذلك اليوم ولا يراه النبي صلى الله عليه وسلم حتى أمسى، فعاد إلى مضجعه، فمر به علي فقال أما نال للرجل أن يعلم منزله فأقامه، فذهب به معه لا يسأل واحد منهما صاحبه عن شىء، حتى إذا كان يوم الثالث، فعاد علي مثل ذلك، فأقام معه ثم قال ألا تحدثني ما الذي أقدمك قال إن أعطيتني عهدا وميثاقا لترشدنني فعلت ففعل فأخبره‏.‏ قال فإنه حق وهو رسول الله صلى الله عليه وسلم، فإذا أصبحت فاتبعني، فإني إن رأيت شيئا أخاف عليك قمت كأني أريق الماء، فإن مضيت فاتبعني حتى تدخل مدخلي‏.‏ ففعل، فانطلق يقفوه حتى دخل على النبي صلى الله عليه وسلم ودخل معه، فسمع من قوله، وأسلم مكانه فقال له النبي صلى الله عليه وسلم ‏\"‏ ارجع إلى قومك، فأخبرهم حتى يأتيك أمري ‏\"‏‏.‏ قال والذي نفسي بيده لأصرخن بها بين ظهرانيهم، فخرج حتى أتى المسجد فنادى بأعلى صوته أشهد أن لا إله إلا الله، وأن محمدا رسول الله‏.‏ ثم قام القوم فضربوه حتى أضجعوه، وأتى العباس فأكب عليه قال ويلكم ألستم تعلمون أنه من غفار وأن طريق تجاركم إلى الشأم فأنقذه منهم، ثم عاد من الغد لمثلها، فضربوه وثاروا إليه، فأكب العباس عليه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When Abu Dhar received the news of the Advent of the Prophet he said to his brother, \"Ride to this valley (of Mecca) and try to find out the truth of the person who claims to be a prophet who is informed of the news of Heaven. Listen to what he says and come back to me.\" So his brother set out and came to the Prophet and listened to some of his talks, and returned to Abu Dhar and said to him. \"I have seen him enjoining virtuous behavior and saying something that is not poetry.\" Abu Dhar said, \"You have not satisfied me as to what I wanted.\" He then took his journey-food and carried a waterskin of his, containing some water till be reached Mecca. He went to the Mosque and searched for the Prophet and though he did not know him, he hated to ask anybody about him. When a part of the night had passed away, `Ali saw him and knew that he was a stranger. So when Abu Dhar saw `Ali, he followed him, and none of them asked his companion about anything, and when it was dawn, Abu Dhar took his journey food and his water-skin to the Mosque and stayed there all the day long without being perceived by the Prophet, and when it was evening, he came back to his retiring place. `Ali passed by him and said, \"Has the man not known his dwelling place yet?\" So `Ali awakened him and took him with him and none of them spoke to the other about anything. When it was the third day. `Ali did the same and Abu Dhar stayed with him. Then `Ali said \"Will you tell me what has brought you here?\" Abu Dhar said, \"If you give me a firm promise that you will guide me, then I will tell you.\" `Ali promised him, and he informed `Ali about the matter. `Ali said, \"It is true, and he is the Apostle of Allah. Next morning when you get up, accompany me, and if I see any danger for you, I will stop as if to pass water, but if I go on, follow me and enter the place which I will enter.\" Abu Dhar did so, and followed `Ali till he entered the place of the Prophet, and Abu Dhar went in with him, Abu Dhar listened to some of the Prophet's talks and embraced Islam on the spot. The Prophet said to him, \"Go back to your people and inform them (about it) till you receive my order.\" Abu Dhar said, \"By Him in Whose Hand my life is, I will proclaim my conversion loudly amongst them (i.e. the pagans).\" So he went out, and when he reached the Mosque, he said as loudly as possible, \"I bear witness that None has the right to be worshipped except Allah, and Muhammad is the Apostle of Allah.\" The People got up and beat him painfully. Then Al-Abbas came and knelt over him ((to protect him) and said (to the people), \"Woe to you! Don't you know that this man belongs to the tribe of Ghifar and your trade to Sha'm is through their way?\" So he rescued him from them. Abu Dhar again did the same the next day. They beat him and took vengeance on him and again Al-Abbas knelt over him (to protect him).",
      "chain": [
        "30152",
        "20033",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "4020",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، قال حدثني يوسف بن الماجشون، عن صالح بن إبراهيم بن عبد الرحمن بن عوف، عن أبيه، عن جده عبد الرحمن، قال كاتبت أمية بن خلف، فلما كان يوم بدر، فذكر قتله وقتل ابنه، فقال بلال لا نجوت إن نجا أمية‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin `Auf:                     \"I had an agreement with Umaiya bin Khalaf (that he would look after my relatives and property in Mecca, and I would look after his relatives and property in Medina).\" `Abdur-Rahman then mentioned the killing of Umaiya and his son on the day of Badr, and Bilal said, \"Woe to me if Umaiya remains safe (i.e. alive) . \"",
      "chain": [
        "30105",
        "20027",
        "11064",
        "584",
        "20033"
      ]
    },
    {
      "hadith_no": "4283",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن المثنى، حدثنا ابن مهدي، عن مالك بن أنس، عن زيد بن أسلم، عن أبيه، عن عمر  رضى الله عنه  قال لولا آخر المسلمين ما فتحت عليهم قرية إلا قسمتها، كما قسم النبي صلى الله عليه وسلم خيبر‏.‏",
      "text_en": " Narrated `Umar:                     But for the other Muslims (i.e. coming generations) I would divide (the land of) whatever villages the Muslims might conquer (among the fighters), as the Prophet divided (the land of) Khaibar.",
      "chain": [
        "30170",
        "20033",
        "20001",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "4519",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمد، حدثنا عبد الرحمن بن مهدي، عن ابن المبارك، عن معمر، عن همام بن منبه، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ قيل لبني إسرائيل ‏{‏ادخلوا الباب سجدا وقولوا حطة‏}‏ فدخلوا يزحفون على أستاههم، فبدلوا وقالوا حطة، حبة في شعرة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"It was said to the children of Israel, 'Enter the gate (of the town), prostrate (in humility) and say: Hittatun (i.e. repentance) i.e. O Allah! Forgive our sins.' But they entered by dragging themselves on their buttocks, so they did something different (from what they had been ordered to do) and said, 'Hittatun,' but added, \"A grain in a hair.\"",
      "chain": [
        "30213",
        "20033",
        "20025",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "4613",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا عبد الرحمن بن مهدي، عن مالك بن أنس، عن مخرمة بن سليمان، عن كريب، عن ابن عباس  رضى الله عنهما  قال بت عند خالتي ميمونة فقلت لأنظرن إلى صلاة رسول الله صلى الله عليه وسلم فطرحت لرسول الله صلى الله عليه وسلم وسادة، فنام رسول الله صلى الله عليه وسلم في طولها، فجعل يمسح النوم عن وجهه، ثم قرأ الآيات العشر الأواخر من آل عمران حتى ختم، ثم أتى شنا معلقا، فأخذه فتوضأ، ثم قام يصلي، فقمت فصنعت مثل ما صنع ثم جئت فقمت إلى جنبه، فوضع يده على رأسي، ثم أخذ بأذني، فجعل يفتلها، ثم صلى ركعتين، ثم صلى ركعتين، ثم صلى ركعتين، ثم صلى ركعتين، ثم صلى ركعتين، ثم صلى ركعتين، ثم أوتر‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     (One night) I stayed overnight in the house of my aunt Maimuna, and said to myself, \"I will watch the prayer of Allah's Apostle \" My aunt placed a cushion for Allah's Apostle and he slept on it in its length-wise direction and (woke-up) rubbing the traces of sleep off his face and then he recited the last ten Verses of Surat-al-`Imran till he finished it. Then he went to a hanging water skin and took it, performed the ablution and then stood up to offer the prayer. I got up and did the same as he had done, and stood beside him. He put his hand on my head and held me by the ear and twisted it. He offered two rak`at, then two rak`at, then two rak`at, then two rak`at, then two rak`at, then two rak`at, and finally the witr (i.e. one rak`a) prayer.",
      "chain": [
        "30026",
        "20033",
        "20001",
        "11223",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "4632",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمد بن بشار، حدثنا غندر، وعبد الرحمن، قالا حدثنا شعبة، عن عدي، عن عبد الله بن يزيد، عن زيد بن ثابت   رضى الله عنه  ‏{‏فما لكم في المنافقين فئتين‏}‏ رجع ناس من أصحاب النبي صلى الله عليه وسلم من أحد، وكان الناس فيهم فرقتين فريق يقول اقتلهم‏.‏ وفريق يقول لا فنزلت ‏{‏فما لكم في المنافقين فئتين‏}‏ وقال ‏\"‏ إنها طيبة تنفي الخبث كما تنفي النار خبث الفضة ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Thabit:                     Regarding the Verse:-- \"Then what is the matter with you that you are divided into two parties about the hypocrites?\" (4.88) Some of the companions of the Prophet returned from the battle of Uhud (i.e. refused to fight) whereupon the Muslims got divided into two parties; one of them was in favor of their execution and the other was not in favour of it. So there ware revealed: \"Then what is the matter with you that you are divided into two parties about the hypocrites?\" (4.88). Then the Prophet said \"It (i.e. Medina) is aTayyaboh (good), it expels impurities as the fire expels the impurities of silver.\"",
      "chain": [
        "30160",
        "20278",
        "20033",
        "20020",
        "11372",
        "1945",
        "49"
      ]
    },
    {
      "hadith_no": "4649",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن، حدثنا سفيان، عن قيس، عن طارق بن شهاب، قالت اليهود لعمر إنكم تقرءون آية لو نزلت فينا لاتخذناها عيدا‏.‏ فقال عمر إني لأعلم حيث أنزلت، وأين أنزلت، وأين رسول الله صلى الله عليه وسلم حين أنزلت يوم عرفة، وإنا والله بعرفة  قال سفيان وأشك كان يوم الجمعة أم لا – ‏{‏اليوم أكملت لكم دينكم‏}‏",
      "text_en": " Narrated Tariq bin Shihab:                     The Jews said to `Umar, \"You (i.e. Muslims) recite a Verse, and had it been revealed to us, we would have taken the day of its revelation as a day of celebration.\" `Umar said, \"I know very well when and where it was revealed, and where Allah's Apostle was when it was revealed. (It was revealed on) the day of `Arafat (Hajj Day), and by Allah, I was at `Arafat\" Sufyan, a sub-narrator said: I am in doubt whether the Verse:-- \"This day I have perfected your religion for you.\" was revealed on a Friday or not.",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11046",
        "3680"
      ]
    },
    {
      "hadith_no": "4674",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن بشار، حدثنا ابن مهدي، حدثنا شعبة، عن قتادة، عن أبي العالية، قال حدثني ابن عم، نبيكم يعني ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ ما ينبغي لعبد أن يقول أنا خير من يونس بن متى ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"Nobody has the rights to say that I am better than Jonah bin Matta.\"",
      "chain": [
        "30160",
        "20033",
        "20020",
        "11019",
        "11618"
      ]
    },
    {
      "hadith_no": "4936",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي، حدثنا عبد الرحمن، عن سفيان، قال ذكرت لعبد الرحمن بن عابس حديث منصور عن إبراهيم، عن علقمة، عن عبد الله  رضى الله عنه  قال لعن رسول الله صلى الله عليه وسلم الواصلة فقال سمعته من امرأة يقال لها أم يعقوب عن عبد الله مثل حديث منصور‏.‏",
      "text_en": " Narrated `Abdullah (bin Mus'ud):                     Allah's Apostle has cursed the lady who uses false hair.",
      "chain": [
        "30026",
        "20033",
        "20012",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "4972",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمد بن بشار، حدثنا عبد الرحمن بن مهدي، وغيره، قالا حدثنا حرب بن شداد، عن يحيى بن أبي كثير، عن أبي سلمة، عن جابر بن عبد الله، رضى الله عنهما عن النبي صلى الله عليه وسلم قال ‏\"‏ جاورت بحراء ‏\"‏‏.‏ مثل حديث عثمان بن عمر عن علي بن المبارك‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet said, \"I was in a seclusion in the cave of Hira.........\"(similar to the narration related by `Ali bin Al-Mubarak, 444 above).",
      "chain": [
        "30160",
        "20033",
        "20220",
        "11449",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "5021",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن أبي شيبة، حدثنا عبد الرحمن، عن سفيان، عن حبيب بن أبي ثابت، عن سعيد بن جبير، عن ابن عباس، أن عمر  رضى الله عنه  سألهم عن قوله تعالى ‏{‏إذا جاء نصر الله والفتح‏}‏ قالوا فتح المدائن والقصور قال ما تقول يا ابن عباس قال أجل أو مثل ضرب لمحمد صلى الله عليه وسلم نعيت له نفسه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     `Umar asked the people regarding Allah's Statement: 'When comes the Help of Allah (to you O Muhammad against your enemies) and the conquest of Mecca.' (110.1) They replied, \"It indicates the future conquest of towns and palaces (by Muslims).\" `Umar said, \"What do you say about it, O Ibn `Abbas?\" I replied, \"(This Surat) indicates the termination of the life of Muhammad. Through it he was informed of the nearness of his death.\"",
      "chain": [
        "30201",
        "20033",
        "20012",
        "11331",
        "11050",
        "17",
        "3"
      ]
    },
    {
      "hadith_no": "5116",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا عمرو بن علي، حدثنا عبد الرحمن بن مهدي، حدثنا سلام بن أبي مطيع، عن أبي عمران الجوني، عن جندب، قال النبي صلى الله عليه وسلم ‏\"‏ اقرءوا القرآن ما ائتلفت عليه قلوبكم فإذا اختلفتم فقوموا عنه ‏\"‏‏.‏ تابعه الحارث بن عبيد وسعيد بن زيد عن أبي عمران ولم يرفعه حماد بن سلمة وأبان‏.‏ وقال غندر عن شعبة عن أبي عمران سمعت جندبا قوله‏.‏ وقال ابن عون عن أبي عمران عن عبد الله بن الصامت عن عمر قوله، وجندب أصح وأكثر‏.‏",
      "text_en": " Narrated Jundub:                     The Prophet said, \"Recite (and study) the Qur'an as long as you agree about its interpretation, but when you have any difference of opinion (as regards its interpretation and meaning) then you should stop reciting it (for the time being)'",
      "chain": [
        "30153",
        "20033",
        "20550",
        "11296",
        "4053"
      ]
    },
    {
      "hadith_no": "5311",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "وقال الحسين بن الوليد النيسابوري عن عبد الرحمن، عن عباس بن سهل، عن أبيه، وأبي، أسيد قالا تزوج النبي صلى الله عليه وسلم أميمة بنت شراحيل، فلما أدخلت عليه بسط يده إليها فكأنها كرهت ذلك فأمر أبا أسيد أن يجهزها ويكسوها ثوبين رازقيين‏.‏",
      "text_en": "",
      "chain": [
        "28114",
        "20033",
        "113"
      ]
    },
    {
      "hadith_no": "5312",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا إبراهيم بن أبي الوزير، حدثنا عبد الرحمن، عن حمزة، عن أبيه، وعن عباس بن سهل بن سعد، عن أبيه، بهذا‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     similarly as above (182).",
      "chain": [
        "30351",
        "31010",
        "20033",
        "11697"
      ]
    },
    {
      "hadith_no": "5380",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا عمرو بن عباس، حدثنا ابن مهدي، حدثنا سفيان، عن عبد الرحمن بن القاسم، عن أبيه، قال عروة بن الزبير لعائشة ألم ترين إلى فلانة بنت الحكم طلقها زوجها البتة فخرجت‏.‏ فقالت بئس ما صنعت‏.‏ قال ألم تسمعي في قول فاطمة قالت أما إنه ليس لها خير في ذكر هذا الحديث‏.‏",
      "text_en": " Narrated Qasim:                     Ursa said to Aisha, \"Do you know so-and-so, the daughter of Al-Hakam? Her husband divorced her irrevocably and she left (her husband's house).\" `Aisha said, \"What a bad thing she has done!\" 'Ursa said (to `Aisha), \"Haven't you heard the statement of Fatima?\" `Aisha replied, \"It is not in her favor to mention.\" 'Ursa added, `Aisha reproached (Fatima) severely and said, \"Fatima was in a lonely place, and she was proned to danger, so the Prophet allowed her (to go out of her husband's house).",
      "chain": [
        "30152",
        "20033",
        "20012",
        "10530",
        "10535",
        "10511"
      ]
    },
    {
      "hadith_no": "5696",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثني عمرو بن عباس، حدثنا عبد الرحمن، حدثنا سفيان، عن سالم أبي النضر، عن عمير، مولى أم الفضل عن أم الفضل، أنهم شكوا في صوم النبي صلى الله عليه وسلم يوم عرفة، فبعث إليه بقدح من لبن فشربه‏.‏",
      "text_en": " Narrated Um Al-Fadl:                     that the people were in doubt whether the Prophet was fasting on the Day of `Arafat or not, so a (wooden) drinking vessel full of milk was sent to him, and he drank it.",
      "chain": [
        "30152",
        "20033",
        "20012",
        "11164",
        "11532"
      ]
    },
    {
      "hadith_no": "5726",
      "source": " Sahih Bukhari ",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا عمرو بن عباس، حدثنا عبد الرحمن، حدثنا سفيان، عن محمد  هو ابن المنكدر  عن جابر  رضى الله عنه  قال جاءني النبي صلى الله عليه وسلم يعودني ليس براكب بغل ولا برذون‏.‏",
      "text_en": " Narrated Jabir:                     The Prophet came to visit me (while I was sick) and he was riding neither a mule, nor a horse.",
      "chain": [
        "30152",
        "20033",
        "20012",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "6008",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني ابن بشار، حدثنا ابن مهدي، حدثنا سفيان، قال ذكرت لعبد الرحمن بن عابس حديث منصور عن إبراهيم، عن علقمة، عن عبد الله،، فقال سمعته من أم يعقوب، عن عبد الله، مثل حديث منصور‏.‏",
      "text_en": " Narrated `Abdullah:                     (As above 827).",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "6012",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الرحمن، عن سفيان، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله  رضى الله عنه  لعن الله الواشمات والمستوشمات، والمتنمصات والمتفلجات للحسن، المغيرات خلق الله‏.‏ ما لي لا ألعن من لعن رسول الله صلى الله عليه وسلم وهو في كتاب الله‏.‏",
      "text_en": " Narrated `Abdullah:                     Allah has cursed those women who practise tattooing and those who get it done for themselves, and those who remove hair from their faces, and those who artificially create spaces between their teeth to look beautiful, such women as alter the features created by Allah. Why should I not then curse those whom Allah's Apostle has cursed and that is in Allah's Book?",
      "chain": [
        "30170",
        "20033",
        "20012",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "6049",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثني عبد الرحمن، حدثنا بهز، حدثنا شعبة، حدثنا ابن عثمان بن عبد الله بن موهب، وأبوه، عثمان بن عبد الله أنهما سمعا موسى بن طلحة، عن أبي أيوب الأنصاري  رضى الله عنه أن رجلا قال يا رسول الله أخبرني بعمل يدخلني الجنة‏.‏ فقال القوم ماله ماله فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرب ماله ‏\"‏‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ تعبد الله لا تشرك به شيئا، وتقيم الصلاة، وتؤتي الزكاة، وتصل الرحم، ذرها ‏\"‏‏.‏ قال كأنه كان على راحلته‏.‏",
      "text_en": " Narrated Abu Aiyub Al-Ansari:                     A man said, \"O Allah's Apostle! Inform me of a deed which will make me enter Paradise.\" The people said, \"What is the matter with him? What is the matter with him?\" Allah's Apostle said, \"He has something to ask (what he needs greatly).\" The Prophet said (to him), (In order to enter Paradise) you should worship Allah and join none in worship with Him: You should offer prayers perfectly, give obligatory charity (Zakat), and keep good relations with your Kith and kin.\" He then said, \"Leave it!\" (The sub-narrator said, \"It seems that the Prophet was riding his she camel.\"",
      "chain": [
        "20033",
        "20214",
        "20020",
        "579",
        "33"
      ]
    },
    {
      "hadith_no": "6206",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا ابن مهدي، حدثنا سفيان، عن أبي حصين، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من كان يؤمن بالله واليوم الآخر فلا يؤذ جاره، ومن كان يؤمن بالله واليوم الآخر فليكرم ضيفه، ومن كان يؤمن بالله واليوم الآخر فليقل خيرا أو ليصمت ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever believes in Allah and the Last Day, should not hurt his neighbor and whoever believes in Allah and the Last Day, should serve his guest generously and whoever believes in Allah and the Last Day, should talk what is good or keep quiet.\"",
      "chain": [
        "30351",
        "20033",
        "20012",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "6217",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا ابن بشار، حدثنا ابن مهدي، حدثنا سفيان، عن عبد الملك، حدثنا أبو سلمة، عن أبي هريرة  رضى الله عنه  قال النبي صلى الله عليه وسلم ‏\"‏ أصدق كلمة قالها الشاعر كلمة لبيد ألا كل شىء ما خلا الله باطل ‏\"‏‏.‏ وكاد أمية بن أبي الصلت أن يسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The most true words said by a poet were the words of Labid. He said, i.e. 'Verily, everything except Allah is perishable and Umaiya bin Abi As-Salt was about to embrace Islam .",
      "chain": [
        "30160",
        "20033",
        "20012",
        "11368",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "6389",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا ابن مهدي، عن سفيان، عن سلمة، عن كريب، عن ابن عباس  رضى الله عنهما  قال بت عند ميمونة فقام النبي صلى الله عليه وسلم فأتى حاجته، غسل وجهه ويديه، ثم نام، ثم قام فأتى القربة فأطلق شناقها، ثم توضأ وضوءا بين وضوءين لم يكثر، وقد أبلغ، فصلى، فقمت فتمطيت كراهية أن يرى أني كنت أتقيه، فتوضأت، فقام يصلي، فقمت عن يساره، فأخذ بأذني فأدارني عن يمينه، فتتامت صلاته ثلاث عشرة ركعة ثم اضطجع فنام حتى نفخ  وكان إذا نام نفخ  فآذنه بلال بالصلاة، فصلى ولم يتوضأ، وكان يقول في دعائه ‏\"‏ اللهم اجعل في قلبي نورا، وفي بصري نورا، وفي سمعي نورا، وعن يميني نورا، وعن يساري نورا، وفوقي نورا، وتحتي نورا، وأمامي نورا، وخلفي نورا، واجعل لي نورا ‏\"‏‏.‏ قال كريب وسبع في التابوت‏.‏ فلقيت رجلا من ولد العباس فحدثني بهن، فذكر عصبي ولحمي ودمي وشعري وبشري، وذكر خصلتين‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     One night I slept at the house of Maimuna. The Prophet woke up, answered the call of nature, washed his face and hands, and then slept. He got up (late at night), went to a water skin, opened the mouth thereof and performed ablution not using much water, yet he washed al I the parts properly and then offered the prayer. I got up and straightened my back in order that the Prophet might not feel that I was watching him, and then I performed the ablution, and when he got up to offer the prayer, stood on his left. He caught hold of my ear and brought me over to his right side. He offered thirteen rak`at in all and then lay down and slept till he started blowing out his breath as he used to do when he slept. In the meantime Bilal informed the Prophet of the approaching time for the (Fajr) prayer, and the Prophet offered the Fajr (Morning) prayer without performing new ablution. He used to say in his invocation, Allaihumma ij'al fi qalbi nuran wa fi basari nuran, wa fi sam'i nuran, wa'an yamini nuran, wa'an yasari nuran, wa fawqi nuran, wa tahti nuran, wa amami nuran, wa khalfi nuran, waj'al li nuran.\" Kuraib (a sub narrator) said, \"I have forgotten seven other words, (which the Prophet mentioned in this invocation). I met a man from the offspring of Al-`Abbas and he narrated those seven things to me, mentioning, '(Let there be light in) my nerves, my flesh, my blood, my hair and my body,' and he also mentioned two other things.\"",
      "chain": [
        "30026",
        "20033",
        "20012",
        "237",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "6769",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "وقال ابن كثير أخبرنا سفيان، حدثنا عبد الرحمن، عن أبيه، أنه قال لعائشة بهذا‏.‏",
      "text_en": "",
      "chain": [
        "30169",
        "20012",
        "20033"
      ]
    },
    {
      "hadith_no": "6828",
      "source": " Sahih Bukhari ",
      "chapter": "Laws of Inheritance (Al-Faraa'id) - كتاب الفرائض",
      "chapter_no": "85",
      "text_ar": "حدثني عمرو بن عباس، حدثنا عبد الرحمن، حدثنا سفيان، عن أبي قيس، عن هزيل، قال قال عبد الله لأقضين فيها بقضاء النبي صلى الله عليه وسلم للابنة النصف، ولابنة الابن السدس، وما بقي فللأخت‏.‏",
      "text_en": " Narrated Huzail:                     `Abdullah said, \"The judgment I will give in this matter will be like the judgment of the Prophet, i.e. one-half is for the daughter and one-sixth for the son's daughter and the rest of the inheritance for the sister.\"",
      "chain": [
        "30152",
        "20033",
        "20012"
      ]
    },
    {
      "hadith_no": "7361",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عمرو بن عباس، حدثنا عبد الرحمن، حدثنا سفيان، عن واصل، عن أبي وائل، قال جلست إلى شيبة في هذا المسجد قال جلس إلى عمر في مجلسك هذا فقال هممت أن لا أدع فيها صفراء ولا بيضاء إلا قسمتها بين المسلمين‏.‏ قلت ما أنت بفاعل‏.‏ قال لم‏.‏ قلت لم يفعله صاحباك قال هما المرآن يقتدى بهما‏.‏",
      "text_en": " Narrated Abu Wail:                     I sat with Shaiba in this Mosque (Al-Masjid-Al-Haram), and he said, \"`Umar once sat beside me here as you are now sitting, and said, 'I feel like distributing all the gold and silver that are in it (i.e., the Ka`ba) among the Muslims'. I said, 'You cannot do that.' `Umar said, 'Why?' I said, 'Your two (previous) companions (the Prophet and Abu Bakr) did not do it. `Umar said, 'They are the two persons whom one must follow.'\" (See Hadith No. 664, Vol. 2)",
      "chain": [
        "30152",
        "20033",
        "20012",
        "11401",
        "11353"
      ]
    },
    {
      "hadith_no": "7421",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عمرو بن علي، حدثنا عبد الرحمن بن مهدي، حدثنا مالك، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما بين بيتي ومنبري روضة من رياض الجنة، ومنبري على حوضي ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Between my house and my pulpit there is a garden from one of the gardens of Paradise, and my pulpit is over my Lake-Tank. (Kauthar);",
      "chain": [
        "30153",
        "20033",
        "20001",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "hadith_no": "7451",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا إسحاق، أخبرنا عبد الرحمن بن مهدي، عن سلام بن أبي مطيع، عن أبي عمران الجوني، عن جندب بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اقرءوا القرآن ما ائتلفت قلوبكم فإذا اختلفتم فقوموا عنه ‏\"‏‏.‏",
      "text_en": " Narrated Jundab bin `Abdullah:                     Allah's Apostle said, \"Recite (and study) the Qur'an as long as you are in agreement as to its interpretation and meanings, but when you have differences regarding its interpretation and meanings, then you should stop reciting it (for the time being.) (See Hadith No 581, Vol. 6)",
      "chain": [
        "30021",
        "20033",
        "20550",
        "11296",
        "4053"
      ]
    },
    {
      "hadith_no": "7",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثنا عبيد الله بن معاذ العنبري، حدثنا أبي ح، وحدثنا محمد بن المثنى، حدثنا عبد الرحمن بن مهدي، قالا حدثنا شعبة، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كفى بالمرء كذبا أن يحدث بكل ما سمع ‏\"‏ ‏.‏",
      "text_en": "",
      "chain": [
        "30150",
        "20286",
        "30170",
        "20033",
        "20020",
        "11159",
        "11420"
      ]
    },
    {
      "hadith_no": "11",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثنا عبد الرحمن، قال حدثنا سفيان، عن أبي إسحاق، عن أبي الأحوص، عن عبد الله، قال بحسب المرء من الكذب أن يحدث بكل ما سمع ‏.‏",
      "text_en": "",
      "chain": [
        "30170",
        "20033",
        "20012",
        "11049",
        "20327",
        "18"
      ]
    },
    {
      "hadith_no": "12",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثنا محمد بن المثنى، قال سمعت عبد الرحمن بن مهدي، يقول لا يكون الرجل إماما يقتدى به حتى يمسك عن بعض ما سمع ‏.‏",
      "text_en": "",
      "chain": [
        "30170",
        "20033"
      ]
    },
    {
      "hadith_no": "57",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني عبيد الله بن سعيد، حدثنا عبد الرحمن، - يعني ابن مهدي - حدثنا حماد بن زيد، عن ابن عون، قال قال لنا إبراهيم إياكم والمغيرة بن سعيد وأبا عبد الرحيم فإنهما كذابان ‏.‏",
      "text_en": "",
      "chain": [
        "30359",
        "20033",
        "20022",
        "11071"
      ]
    },
    {
      "hadith_no": "68",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "حدثني أحمد بن إبراهيم الدورقي، قال حدثني عبد الرحمن بن مهدي، عن حماد بن زيد، قال ذكر أيوب رجلا يوما فقال لم يكن بمستقيم اللسان وذكر آخر فقال هو يزيد في الرقم ‏.‏",
      "text_en": "",
      "chain": [
        "30494",
        "20033",
        "20022"
      ]
    },
    {
      "hadith_no": "137",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثني محمد بن المثنى، حدثنا عبد الرحمن، - يعني ابن مهدي - قالا جميعا حدثنا سفيان، عن أبي الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فإذا قالوا لا إله إلا الله عصموا مني دماءهم وأموالهم إلا بحقها وحسابهم على الله ‏\"‏ ‏.‏ ثم قرأ ‏{‏ إنما أنت مذكر * لست عليهم بمسيطر‏}‏",
      "text_en": " It is narrated on the authority of Jabir that the Messenger of Allah said:                      I have been commanded that I should fight against people till they declare that there is no god but Allah, and when they profess it that there is no god but Allah, their blood and riches are guaranteed protection on my behalf except where it is justified by law, and their affairs rest with Allah, and then he (the Holy Prophet) recited (this verse of the Holy Qur'an):\" Thou art not over them a warden\" (lxxxviii, 22).",
      "chain": [
        "30201",
        "20032",
        "30170",
        "20033",
        "20005",
        "11263",
        "34"
      ]
    }
  ],
  "total_hadiths": 578
}