{
  "id": "2007",
  "name": "al-Harith bin 'Abdullah bin Abi Rabi'a ( الحارث بن عبد الله بن أبي ربيعة ( رضي الله عنه",
  "full_name": "al-Harith bin 'Abdullah bin Abi Rabi'a ( الحارث بن عبد الله بن أبي ربيعة ( رضي الله عنه",
  "grade": "Comp.(RA) [1st Generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Makkah"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Makkah/Basra",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah",
      "Medina",
      "Basra",
      "Kufa"
    ],
    "area_of_interest": [
      "Recitation/Quran",
      "Narrator [ س مد -  صحبة ]",
      "Governor"
    ],
    "tags": [
      "Quraish",
      "B.Makhzum",
      "Child",
      "makki"
    ]
  },
  "parents": [
    {
      "id": "2006",
      "name": "'Abdullah bin Abi Rabi'a ( عبد الله بن أبي ربيعة ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "2008",
      "name": "'Amir/'Umar bin 'Abdullah bin Abi Rabi'a ( عامر/عمر بن عبد الله بن أبي ربيعة ( رضي الله عنه",
      "grade": "Comp.(RA)"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "1",
      "name": "Prophet Muhammad ( محمّد صلّی اللہ علیہ وآلہ وسلّم ( رضي الله عنه",
      "grade": "Rasool Allah"
    },
    {
      "id": "3",
      "name": "'Umar ibn al-Khattab ( عمر بن الخطاب بن نفيل ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "27",
      "name": "Mu'awiya ibn Abu Sufyan ( معاوية بن أبي سفيان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "53",
      "name": "'Aisha bint Abi Bakr ( أمّ المؤمنين عائشة بنت أبي بكر الصديق ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "54",
      "name": "Hafsa bint Umar ( حفصة بنت عمر بن الخطاب أم المؤمنين ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "56",
      "name": "Umm Salamah ( أم سلمة بنت أبي أمية ( رضي الله عنها",
      "grade": "Comp.(RA) [1st Generation]"
    }
  ],
  "students": [
    {
      "id": "11050",
      "name": "Sa'id bin Jubayr سعيد بن جبير الأسدي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10646",
      "name": "'Abdur Rahman bin 'Abdullah bin Sabit عبد الرحمن بن عبد الله بن سابط",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10689",
      "name": "Suwayd bin Hjyr سويد بن حجير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3310",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني محمد بن حاتم، حدثنا محمد بن بكر، أخبرنا ابن جريج، قال سمعت عبد، الله بن عبيد بن عمير والوليد بن عطاء يحدثان عن الحارث بن عبد الله بن أبي ربيعة، قال عبد الله بن عبيد وفد الحارث بن عبد الله على عبد الملك بن مروان في خلافته فقال عبد الملك ما أظن أبا خبيب - يعني ابن الزبير - سمع من عائشة ما كان يزعم أنه سمعه منها ‏.‏ قال الحارث بلى أنا سمعته منها ‏.‏ قال سمعتها تقول ماذا قال قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إن قومك استقصروا من بنيان البيت ولولا حداثة عهدهم بالشرك أعدت ما تركوا منه فإن بدا لقومك من بعدي أن يبنوه فهلمي لأريك ما تركوا منه ‏\"‏ ‏.‏ فأراها قريبا من سبعة أذرع ‏.‏ هذا حديث عبد الله بن عبيد وزاد عليه الوليد بن عطاء قال النبي صلى الله عليه وسلم ‏\"‏ ولجعلت لها بابين موضوعين في الأرض شرقيا وغربيا وهل تدرين لم كان قومك رفعوا بابها ‏\"‏ ‏.‏ قالت قلت لا ‏.‏ قال ‏\"‏ تعززا أن لا يدخلها إلا من أرادوا فكان الرجل إذا هو أراد أن يدخلها يدعونه يرتقي حتى إذا كاد أن يدخل دفعوه فسقط ‏\"‏ ‏.‏ قال عبد الملك للحارث أنت سمعتها تقول هذا قال نعم‏.‏ قال فنكت ساعة بعصاه ثم قال وددت أني تركته وما تحمل.",
      "text_en": " Abdullah b. 'Ubaid reported that Harith b. 'Abdullah led a deputation to 'Abd al-Malik b. Marwan during his caliphate. 'Abd al-Malik said:                      I do riot think that Abu Khubaib (i. e. Ibn Zabair) had heard from 'A'isha (Allah be pleased with her) (about the intended wish of the Holy Prophet [may peace be upon him) In regard to the alteration of the Ka'ba). Harith said: Yes, I myself did hear from her. He ('Abd al-Malik) said: Well, tell me what you heard from her. He stated that she (Hadrat 'A'isha) had said that Allah's Messenger (may peace be upon him) remarked: Verily your people have reduced (the area) of the House from its (original foundations, and if they had not recently abandoned polytheism (and embraced Islam) I would have reversed it to (those foundations) which they had left out of it. nd if your people would take initiative after me in rebuilding it, then come along with me so that I should show you what they have left out of it. He showed her about fifteen cubits of area from the side of Hatim (that they had separated). This is the narration transmitted by 'Abdullah b. Ubaid. Walid b. 'Ata' has, however, made this addition to it:\" Allah's Apostle (may peace be upon him) said: I would have made two doors on the level of the ground (facing) the east and the west. Do you know why your people raised the level of its door (i. e. the door of the Ka'ba)? She said: No. He said: (They did it) out of vanity so that (they might be in a position) to grant admittance to him only whom they wished. When a person intended to get into it, they let him climb (the stairs), and as he was about to enter, they pushed him and he fell down.\" 'Abd al-Malik said to Harith; Did you yourself hear her saying this? He said: Yes. He (Harith) said that he ('Abd al-Malik) scratched the ground with his staff for some time and then said: I wish I had left his (Ibn Zubair's) work there.",
      "chain": [
        "38487",
        "20277",
        "11070",
        "2007"
      ]
    }
  ],
  "total_hadiths": 1
}