{
  "id": "20118",
  "name": "Yunus bin Bukayr al-Shaybani يونس بن بكير بن واصل الشيباني",
  "full_name": "Yunus bin Bukayr al-Shaybani يونس بن بكير بن واصل الشيباني",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "199",
      "date_gregorian": "815",
      "date_display": null,
      "place": "Kufa",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "History",
      "Seerah",
      "Narrator[Grade:No Doubt] [ خت  م  د  ت  ق  -  صدوق يخطئ ]"
    ],
    "tags": [
      "al-Shaybani",
      "Client",
      "Kufi",
      "Hafiz"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "25034",
      "name": "Bakr bin Yonus bin Bkyr بكر بن يونس بن بكير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "39582",
      "name": "'Abdullah bin Yonus bin Bkyr عبد الله بن يونس بن بكير",
      "grade": "3rd Century AH"
    }
  ],
  "teachers": [
    {
      "id": "11583",
      "name": "Khalid bin Dinar Abu Khalida خالد بن دينار التميمي السعدي أبو خلدة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "18238",
      "name": "Khalid bin Dinar al-Nyly خالد بن دينار النيلي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11863",
      "name": "Talha bin Yahya bin Talha طلحة بن يحيى بن طلحة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20643",
      "name": "Asbat bin Nsr al-Hmdany أسباط بن نصر الهمداني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11642",
      "name": "'Umar bin Dhar bin 'Abdullah al-Hamdani عمر بن ذر بن عبد الله بن زرارة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "22146",
      "name": "'Uthman bin 'Abdur Rahman al-Waqqasi عثمان بن عبد الرحمن بن عمر الوقاصي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "19080",
      "name": "al-Nadr bin 'Abdur Rahman al-Khazaz النضر بن عبد الرحمن أبو عمر الخزاز",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "39582",
      "name": "'Abdullah bin Yonus bin Bkyr عبد الله بن يونس بن بكير",
      "grade": "3rd Century AH"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "24162",
      "name": "Sa'id bin Sulaiman al-Basri al-Nashayti سعيد بن سليمان البصري النشيطي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30212",
      "name": "Muhammad bin 'Abdullah bin Numayr محمد بن عبد الله بن نمير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30469",
      "name": "'Ubaid bin Y'ysh al-Mhamly عبيد بن يعيش المحاملي أبو محمد الكوفي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30216",
      "name": "Abu Karayb, Muhammad bin al-'Ala' محمد بن العلاء - أبو كريب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30200",
      "name": "'Abdullah bin Sa'id al-Ashaj عبد الله بن سعيد بن حصين الكندي - الأشج",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "35047",
      "name": "Sufyan bin Wky' bin al-Jrah سفيان بن وكيع بن الجراح",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38636",
      "name": "Masraf bin 'Amr bin al-Sari مصرف بن عمرو بن السري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30480",
      "name": "Hanad bin al-Sari bin Mus'ab هناد بن السري بن مصعب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30410",
      "name": "Ishaq bin Musa bin 'Abdullah bin Musa إسحاق بن موسى بن عبد الله بن موسى",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "35004",
      "name": "Ahmed bin Abd al-Jabbar أحمد بن عبد الجبار بن محمد",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "524",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا وكيع، ويونس بن بكير، قالا حدثنا هشام بن عروة، عن أبيه، عن عائشة، قالت لما نزلت ‏{‏ وأنذر عشيرتك الأقربين‏}‏ قام رسول الله صلى الله عليه وسلم على الصفا فقال ‏\"‏ يا فاطمة بنت محمد يا صفية بنت عبد المطلب يا بني عبد المطلب لا أملك لكم من الله شيئا سلوني من مالي ما شئتم ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of 'A'isha that when this verse was revealed:                     \" And warn thy nearest kindred,\" the Messenger of Allah (may peace be upon him) stood up on Safa' and said: O Fatima, daughter of Muhammad. O Safiya, daughter of 'Abd al-Muttalib, O sons of 'Abd al-Muttalib. I have nothing which can avail you against Allah; you may ask me what you want of my worldly belongings.",
      "chain": [
        "30212",
        "20032",
        "20118",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "944",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن سعيد، حدثنا يونس بن بكير، عن محمد بن إسحاق، عن يعقوب بن عتبة بن الأخنس، عن أبي غطفان، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ التسبيح للرجال ‏\"‏ ‏.‏ يعني في الصلاة ‏\"‏ والتصفيق للنساء من أشار في صلاته إشارة تفهم عنه فليعد لها ‏\"‏ ‏.‏ يعني الصلاة ‏.‏ قال أبو داود هذا الحديث وهم ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Saying Tasbih applies to men during prayer and clapping applies to women. Anyone who makes a sign during his prayer, a sign which is intelligible by implication, should repeat it (i.e. his prayer). (AbuDawud commented on the Hadith saying, this is a result of confusion.)",
      "chain": [
        "11184",
        "20118",
        "11107",
        "19192",
        "13"
      ]
    },
    {
      "hadith_no": "986",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن سعيد الكندي، حدثنا يونس، - يعني ابن بكير - عن محمد بن إسحاق، عن عبد الرحمن بن الأسود، عن أبيه، عن عبد الله، قال من السنة أن يخفى التشهد ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     It pertains to the sunnah to utter the tashahhud quietly.",
      "chain": [
        "30200",
        "20118",
        "11107",
        "11056",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "1878",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا مصرف بن عمرو اليامي، حدثنا يونس، - يعني ابن بكير - حدثنا ابن إسحاق، حدثني محمد بن جعفر بن الزبير، عن عبيد الله بن عبد الله بن أبي ثور، عن صفية بنت شيبة، قالت لما اطمأن رسول الله صلى الله عليه وسلم بمكة عام الفتح طاف على بعير يستلم الركن بمحجن في يده ‏.‏ قالت وأنا أنظر إليه ‏.‏",
      "text_en": " Narrated Safiyyah, daughter of Shaybah:                     When the Messenger of Allah (ﷺ) had some rest at Mecca in the year of its Conquest, he performed circumambulation on a camel and touched the corner (black Stone) with a crooked stick in his hand. She said: I was looking at him.",
      "chain": [
        "38636",
        "20118",
        "11107",
        "11215",
        "11200",
        "2802"
      ]
    },
    {
      "hadith_no": "3001",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا مصرف بن عمرو الأيامي، حدثنا يونس، - يعني ابن بكير - قال حدثنا محمد بن إسحاق، حدثني محمد بن أبي محمد، مولى زيد بن ثابت عن سعيد بن جبير، وعكرمة، عن ابن عباس، قال لما أصاب رسول الله صلى الله عليه وسلم قريشا يوم بدر وقدم المدينة جمع اليهود في سوق بني قينقاع فقال ‏\"‏ يا معشر يهود أسلموا قبل أن يصيبكم مثل ما أصاب قريشا ‏\"‏ ‏.‏ قالوا يا محمد لا يغرنك من نفسك أنك قتلت نفرا من قريش كانوا أغمارا لا يعرفون القتال إنك لو قاتلتنا لعرفت أنا نحن الناس وأنك لم تلق مثلنا ‏.‏ فأنزل الله عز وجل في ذلك ‏{‏ قل للذين كفروا ستغلبون ‏}‏ قرأ مصرف إلى قوله ‏{‏ فئة تقاتل في سبيل الله ‏}‏ ببدر ‏{‏ وأخرى كافرة ‏}‏ ‏.‏",
      "text_en": " Ibn ‘Abbas said “When the Apostle of Allaah(ﷺ) had victory over Quraish in the batte of Badr and came to Madeenah he gathered the Jews in the market of Banu Qainuqa and said “O community of Jews embrace Islam before you suffer an injury as the Quraish suffered.” They said “Muhammad, you should not deceive yourself (taking pride) that you had killed a few persons of the Quariash who were inexperienced and did not know how to fight. Had you fought with us, you would have known us. You have never met people like us.” Allah Most High revealed about this the following verse “Say to those who reject faith, soon will ye be vanished... one army was fighting in the cause of Allaah, the other resisting Allaah.”",
      "chain": [
        "38636",
        "20118",
        "11107",
        "11050",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3041",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا مصرف بن عمرو اليامي، حدثنا يونس، - يعني ابن بكير - حدثنا أسباط بن نصر الهمداني، عن إسماعيل بن عبد الرحمن القرشي، عن ابن عباس، قال صالح رسول الله صلى الله عليه وسلم أهل نجران على ألفى حلة النصف في صفر والبقية في رجب يؤدونها إلى المسلمين وعارية ثلاثين درعا وثلاثين فرسا وثلاثين بعيرا وثلاثين من كل صنف من أصناف السلاح يغزون بها والمسلمون ضامنون لها حتى يردوها عليهم إن كان باليمن كيد أو غدرة على أن لا تهدم لهم بيعة ولا يخرج لهم قس ولا يفتنوا عن دينهم ما لم يحدثوا حدثا أو يأكلوا الربا ‏.‏ قال إسماعيل فقد أكلوا الربا ‏.‏ قال أبو داود إذا نقضوا بعض ما اشترط عليهم فقد أحدثوا ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) concluded peace with the people of Najran on condition that they would pay to Muslims two thousand suits of garments, half of Safar, and the rest in Rajab, and they would lend (Muslims) thirty coats of mail, thirty horses, thirty camels, and thirty weapons of each type used in battle. Muslims will stand surely for them until they return them in case there is any plot or treachery in the Yemen. No church of theirs will be demolished and no clergyman of theirs will be turned out. There will be no interruption in their religion until they bring something new or take usury. Isma'il said: They took usury.Abu Dawud said: If they violate any provision of the treaty, they will be deemed as bringing something new.",
      "chain": [
        "38636",
        "20118",
        "20643",
        "17"
      ]
    },
    {
      "hadith_no": "4229",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Signet-Rings (Kitab Al-Khatam) - كتاب الخاتم",
      "chapter_no": "36",
      "text_ar": "حدثنا عبد الله بن سعيد، حدثنا يونس بن بكير، عن محمد بن إسحاق، قال رأيت على الصلت بن عبد الله بن نوفل بن عبد المطلب خاتما في خنصره اليمنى فقلت ما هذا قال رأيت ابن عباس يلبس خاتمه هكذا وجعل فصه على ظهرها ‏.‏ قال ولا يخال ابن عباس إلا قد كان يذكر أن رسول الله صلى الله عليه وسلم كان يلبس خاتمه كذلك ‏.‏",
      "text_en": " Muhammad ibn Ishaq said:                      I saw as-Salt ibn Abdullah ibn Nawfal ibn AbdulMuttalib wearing the signet-ring on his right small finger. I asked: What is this? He replied: I saw Ibn Abbas wearing his ring in this manner. He put its stone towards the upper part of his palm. Ibn Abbas also mentioned that the Messenger of Allah (ﷺ) used to wear his signet-ring in his manner.",
      "chain": [
        "11184",
        "20118",
        "11107"
      ]
    },
    {
      "hadith_no": "291",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا يونس بن بكير، عن محمد بن إسحاق، عن عبد الرحمن بن الأسود، عن أبيه، عن عبد الله بن مسعود، قال من السنة أن يخفي، التشهد ‏.‏ قال أبو عيسى حديث ابن مسعود حديث حسن غريب ‏.‏ والعمل عليه عند أهل العلم ‏.‏",
      "text_en": " Abdullah bin Mas'ud said:                     \"It is from the Sunnah to say the Tashah-hus quietly\"",
      "chain": [
        "30200",
        "20118",
        "11107",
        "11056",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "473",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا يونس بن بكير، عن محمد بن إسحاق، قال حدثني موسى بن فلان بن أنس، عن عمه، ثمامة بن أنس بن مالك عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صلى الضحى ثنتى عشرة ركعة بنى الله له قصرا من ذهب في الجنة ‏\"‏ ‏.‏ قال وفي الباب عن أم هانئ وأبي هريرة ونعيم بن همار وأبي ذر وعائشة وأبي أمامة وعتبة بن عبد السلمي وابن أبي أوفى وأبي سعيد وزيد بن أرقم وابن عباس ‏.‏ قال أبو عيسى حديث أنس حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Anas bin Malik narrated that :                     Allah's Messenger said: \"Whoever prays twelve Rak'ah of Ad-Duha, Allah will build a castle made of gold for him in Paradise.\"",
      "chain": [
        "30216",
        "20118",
        "11107",
        "19055",
        "19"
      ]
    },
    {
      "hadith_no": "1028",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو كريب، حدثنا عبد الله بن المبارك، ويونس بن بكير، عن محمد بن إسحاق، عن يزيد بن أبي حبيب، عن مرثد بن عبد الله اليزني، قال كان مالك بن هبيرة إذا صلى على جنازة فتقال الناس عليها جزأهم ثلاثة أجزاء ثم قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صلى عليه ثلاثة صفوف فقد أوجب ‏\"‏ ‏.‏ قال وفي الباب عن عائشة وأم حبيبة وأبي هريرة وميمونة زوج النبي صلى الله عليه وسلم ‏.‏ قال أبو عيسى حديث مالك بن هبيرة حديث حسن هكذا رواه غير واحد عن محمد بن إسحاق ‏.‏ وروى إبراهيم بن سعد عن محمد بن إسحاق هذا الحديث وأدخل بين مرثد ومالك بن هبيرة رجلا ‏.‏ ورواية هؤلاء أصح عندنا ‏.‏",
      "text_en": " Marthan bin Abdullah Al-Yazani narrated:                     \"When Malik bin Hubairah performed Salat for a funeral and the people were few he would divide them into three groups (rows) then say: 'The Messenger of Allah said: \"For whomever three rows perform Salat, then it is granted.\"",
      "chain": [
        "30216",
        "20025",
        "20118",
        "11107",
        "11411",
        "11410"
      ]
    },
    {
      "hadith_no": "1143",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا هناد، حدثنا يونس بن بكير، عن محمد بن إسحاق، قال حدثني داود بن الحصين، عن عكرمة، عن ابن عباس، قال رد النبي صلى الله عليه وسلم ابنته زينب على أبي العاصي بن الربيع بعد ست سنين بالنكاح الأول ولم يحدث نكاحا ‏.‏ قال أبو عيسى هذا حديث ليس بإسناده بأس ولكن لا نعرف وجه هذا الحديث ولعله قد جاء هذا من قبل داود بن حصين من قبل حفظه ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Prophet returned his daughter Zainab to Abul-As bin Ar-Rabi after six years in the first marriage without renewing the marriage.\"",
      "chain": [
        "30480",
        "20118",
        "11107",
        "11160",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1692",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا يونس بن بكير، عن محمد بن إسحاق، عن يحيى بن عباد بن عبد الله بن الزبير، عن أبيه، عن جده عبد الله بن الزبير، عن الزبير بن العوام، قال كان على النبي صلى الله عليه وسلم درعان يوم أحد فنهض إلى الصخرة فلم يستطع فأقعد طلحة تحته فصعد النبي صلى الله عليه وسلم عليه حتى استوى على الصخرة فقال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ أوجب طلحة ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن صفوان بن أمية والسائب بن يزيد ‏.‏ وهذا حديث حسن غريب لا نعرفه إلا من حديث محمد بن إسحاق ‏.‏",
      "text_en": " Narrated Az-Zubair bin Al-'Awwam:                     \"On the Day of Uhud, the Prophet (ﷺ) wore two coats of mail. He tried to get up on a boulder but was not able to, so Talhah squatted under him, lifting the Prophet (ﷺ) upon it such that he could sit on the boulder. So he said: (Paradise) \"It is obligated from Talhah.'\"[Abu 'Eisa said:] There are narrations on this topic from Safwan bin Umayyah and As-Sa'ib bin Yazid.This Hadith is Hasan Gharib, we do not know of it except through the narration of Muhammad bin Ishaq.",
      "chain": [
        "30200",
        "20118",
        "11107",
        "19826",
        "11250",
        "106",
        "7"
      ]
    },
    {
      "hadith_no": "2457",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Dreams - كتاب الرؤيا عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو موسى الأنصاري، حدثنا يونس بن بكير، حدثني عثمان بن عبد الرحمن، عن الزهري، عن عروة، عن عائشة، قالت سئل رسول الله صلى الله عليه وسلم عن ورقة فقالت له خديجة إنه كان صدقك ولكنه مات قبل أن تظهر ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أريته في المنام وعليه ثياب بياض ولو كان من أهل النار لكان عليه لباس غير ذلك ‏\"‏ ‏.‏ قال هذا حديث غريب ‏.‏ وعثمان بن عبد الرحمن ليس عند أهل الحديث بالقوي ‏.‏",
      "text_en": " 'Aishah said:                      \"The Messenger of Allah (s.a.w) was asked about Waraqah. Khadijah said to him:'He believed in you, but he died before your advent.' So the Messenger of Allah (s.a.w) said: 'I saw him in a dream, and upon him were white garments. If he were among the inhabitants of the Fire then he would have been  wearing other than that.'\"",
      "chain": [
        "20118",
        "28389",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2661",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا هناد، حدثنا يونس بن بكير، عن محمد بن إسحاق، حدثنا يزيد بن زياد، عن محمد بن كعب القرظي، حدثني من، سمع علي بن أبي طالب، يقول خرجت في يوم شات من بيت رسول الله صلى الله عليه وسلم وقد أخذت إهابا معطونا فحولت وسطه فأدخلته عنقي وشددت وسطي فحزمته بخوص النخل وإني لشديد الجوع ولو كان في بيت رسول الله صلى الله عليه وسلم طعام لطعمت منه فخرجت ألتمس شيئا فمررت بيهودي في مال له وهو يسقي ببكرة له فاطلعت عليه من ثلمة في الحائط فقال ما لك يا أعرابي هل لك في كل دلو بتمرة قلت نعم فافتح الباب حتى أدخل ففتح فدخلت فأعطاني دلوه فكلما نزعت دلوا أعطاني تمرة حتى إذا امتلأت كفي أرسلت دلوه وقلت حسبي فأكلتها ثم جرعت من الماء فشربت ثم جئت المسجد فوجدت رسول الله صلى الله عليه وسلم فيه ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Muhammad bin Ka'b Al-Qurazi said:                     \"Someone narrated to me that he heard 'ali bin abi Talib saying: 'I went out on a cold day from the house of the Messenger of Allah (s.a.w). I had taken a tanned skin, si I tore it in the middle, and out it over my neck, and wrapped my mid-section, fastening it with a palm leave. I was severely hungry, and if there was food in the house of the Messenger of Allah (s.a.w) I would have eaten some of it. I went in search of something. I passed by a Jew on his property drawing water (from a well) with a pulley. I watched him from a gap in the fence. He said: \"what is wrong with you O Arab1 Would you like to get a date for every bucket?\" I said: \"Yes. Open the door so I can come in.\" He opened the door, I entered and he gave me his bucket. Then for every bucket I pulled out, he would give me a date, until when it was enough for me. I put his bucket down and said: \"I think I had enough to eat\" then I scooped some water to drink it. Then I came to the Masjid and found the Messenger of Allah (s.a.w) in it.'\"",
      "chain": [
        "30480",
        "20118",
        "11107",
        "11221",
        "5"
      ]
    },
    {
      "hadith_no": "2664",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا هناد، حدثنا يونس بن بكير، عن محمد بن إسحاق، حدثني يزيد بن زياد، عن محمد بن كعب القرظي، حدثني من، سمع علي بن أبي طالب، يقول إنا لجلوس مع رسول الله صلى الله عليه وسلم في المسجد إذ طلع علينا مصعب بن عمير ما عليه إلا بردة له مرقوعة بفرو فلما رآه رسول الله صلى الله عليه وسلم بكى للذي كان فيه من النعمة والذي هو اليوم فيه ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ كيف بكم إذا غدا أحدكم في حلة وراح في حلة ووضعت بين يديه صحفة ورفعت أخرى وسترتم بيوتكم كما تستر الكعبة ‏\"‏ ‏.‏ قالوا يا رسول الله نحن يومئذ خير منا اليوم نتفرغ للعبادة ونكفى المؤنة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لأنتم اليوم خير منكم يومئذ ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ ويزيد بن زياد هو ابن ميسرة وهو مدني وقد روى عنه مالك بن أنس وغير واحد من أهل العلم ويزيد بن زياد الدمشقي الذي روى عن الزهري روى عنه وكيع ومروان بن معاوية ويزيد بن أبي زياد كوفي روى عنه سفيان وشعبة وابن عيينة وغير واحد من الأئمة ‏.‏",
      "text_en": " Yazid bin Ziyad narrated from Muhammad bin Ka'b Al-Qurazi who heard from Abi Talib narrated that he said:                     'I was sitting in a gathering with the Messenger of Allah (s.a.w) when Mus'ab bin 'Umair appeared before us, wearing nothing but a Burdah patched with some animal furs. When the Messenger of Allah (s.a.w) saw him he began crying because of the good life he previously had compared to the state that he was in that day. Then the Messenger of Allah (s.a.w) said:'How will you people be, when the late morning comes upon one of you while wearing a Hullah, and at the end of the day he is in, (another) Hullah, when a platter is placed in front of him while another is removed, and you cover your houses just as the Ka'bah is covered?' They said: 'O Messenger of Allah! On that day we will be better than we are today, devoting ourselves to worship, satisfied with our good fortune.' So the Messenger of Allah (s.a.w) said: 'No, today you are better than you will be on that day.'\"",
      "chain": [
        "30480",
        "20118",
        "11107",
        "11221",
        "5"
      ]
    },
    {
      "hadith_no": "2665",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا هناد، حدثنا يونس بن بكير، حدثني عمر بن ذر، حدثنا مجاهد، عن أبي هريرة، قال كان أهل الصفة أضياف أهل الإسلام لا يأوون على أهل ولا مال والله الذي لا إله إلا هو إن كنت لأعتمد بكبدي على الأرض من الجوع وأشد الحجر على بطني من الجوع ولقد قعدت يوما على طريقهم الذي يخرجون فيه فمر بي أبو بكر فسألته عن آية من كتاب الله ما سألته إلا ليستتبعني فمر ولم يفعل ثم مر بي عمر فسألته عن آية من كتاب الله ما أسأله إلا ليستتبعني فمر ولم يفعل ثم مر بي أبو القاسم صلى الله عليه وسلم فتبسم حين رآني وقال ‏\"‏ أبا هريرة ‏\"‏ ‏.‏ قلت لبيك يا رسول الله ‏.‏ قال ‏\"‏ الحق ‏\"‏ ‏.‏ ومضى فاتبعته ودخل منزله فاستأذنت فأذن لي فوجد قدحا من لبن فقال ‏\"‏ من أين هذا اللبن لكم ‏\"‏ ‏.‏ قيل أهداه لنا فلان ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أبا هريرة ‏\"‏ ‏.‏ قلت لبيك ‏.‏ فقال ‏\"‏ الحق إلى أهل الصفة فادعهم ‏\"‏ ‏.‏ وهم أضياف أهل الإسلام لا يأوون على أهل ولا مال إذا أتته صدقة بعث بها إليهم ولم يتناول منها شيئا وإذا أتته هدية أرسل إليهم فأصاب منها وأشركهم فيها فساءني ذلك وقلت ما هذا القدح بين أهل الصفة وأنا رسوله إليهم فسيأمرني أن أديره عليهم فما عسى أن يصيبني منه وقد كنت أرجو أن أصيب منه ما يغنيني ولم يكن بد من طاعة الله وطاعة رسوله فأتيتهم فدعوتهم فلما دخلوا عليه فأخذوا مجالسهم فقال ‏\"‏ أبا هريرة خذ القدح وأعطهم ‏\"‏ ‏.‏ فأخذت القدح فجعلت أناوله الرجل فيشرب حتى يروى ثم يرده فأناوله الآخر حتى انتهيت به إلى رسول الله صلى الله عليه وسلم وقد روي القوم كلهم فأخذ رسول الله صلى الله عليه وسلم القدح فوضعه على يديه ثم رفع رأسه فتبسم فقال ‏\"‏ أبا هريرة اشرب ‏\"‏ ‏.‏ فشربت ثم قال ‏\"‏ اشرب ‏\"‏ ‏.‏ فلم أزل أشرب ويقول ‏\"‏ اشرب ‏\"‏ ‏.‏ حتى قلت والذي بعثك بالحق ما أجد له مسلكا فأخذ القدح فحمد الله وسمى ثم شرب ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"The people of As-Suffah were the guests of the people of Islam,they had nothing of people nor wealth to rely upon. And By Allah, the One  Whom there is none worthy  of worship besides Him",
      "chain": [
        "30480",
        "20118",
        "11642",
        "11028",
        "13"
      ]
    },
    {
      "hadith_no": "2737",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا أبو كريب، حدثنا يونس بن بكير، عن محمد بن إسحاق، عن يحيى بن عباد بن عبد الله بن الزبير، عن أبيه، عن أسماء بنت أبي بكر، قالت سمعت رسول الله صلى الله عليه وسلم يقول وذكر له سدرة المنتهى قال ‏\"‏ يسير الراكب في ظل الفنن منها مائة سنة أو يستظل بظلها مائة راكب شك يحيى فيها فراش الذهب كأن ثمرها القلال ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " 'Aishah narrated from Asma' bint Abi Bakr that she said:                     \"I heard the Messenger of Allah (s.a.w) while mentioning the Lote-Tree of the Utmost Boundary, saying: 'A rider will travel in the shade of one of its branches for a hundred years,' or 'a hundred riders will seek to shade themselves with its shade'-(lne of the narrators) Yahya' was in doubt- 'in it are butterflies of gold, it is as if its fruits are Qilal.\"",
      "chain": [
        "30216",
        "20118",
        "11107",
        "19826",
        "11250",
        "70"
      ]
    },
    {
      "hadith_no": "3508",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو كريب، حدثنا يونس بن بكير، عن طلحة بن يحيى، عن موسى، وعيسى، ابنى طلحة عن أبيهما، طلحة أن أصحاب، رسول الله صلى الله عليه وسلم قالوا لأعرابي جاهل سله عمن قضى نحبه من هو وكانوا لا يجترئون على مسألته يوقرونه ويهابونه فسأله الأعرابي فأعرض عنه ثم سأله فأعرض عنه ثم سأله فأعرض عنه ثم إني اطلعت من باب المسجد وعلى ثياب خضر فلما رآني رسول الله صلى الله عليه وسلم قال ‏\"‏ أين السائل عمن قضى نحبه ‏\"‏ ‏.‏ قال الأعرابي أنا يا رسول الله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هذا ممن قضى نحبه ‏\"‏ ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من حديث يونس بن بكير ‏.‏",
      "text_en": " Narrated Musa and 'Eisa, the sons of Talhah:                     from their father: \"The Companions of the Prophet (ﷺ) said, to an unknowing Bedouin man: 'Ask him who it is that has fulfilled his vow.' They were not in the habit of asking questions out of their respect and reverence for him. So the Bedouin asked him, but he turned away from him. Then he asked him again, but he turned away from him. Then again he asked him, but he turned away from him. Then I stood looking from the door of the Masjid, while I was wearing a green garment, and I saw the Prophet (ﷺ), he said: 'Where is the one who was asking about the one who fulfilled his vow?' The Bedouin said: 'Here I am O Messenger of Allah!' The Messenger of Allah (ﷺ) said: 'This is one who has fulfilled his vow.'\"",
      "chain": [
        "30216",
        "20118",
        "11863",
        "20040",
        "10573"
      ]
    },
    {
      "hadith_no": "3992",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا الأنصاري، إسحاق بن موسى حدثنا يونس بن بكير، أخبرنا محمد بن إسحاق، حدثني الزهري، عن عروة، عن عائشة، أنها قالت أول ما ابتدئ به رسول الله صلى الله عليه وسلم من النبوة حين أراد الله كرامته ورحمة العباد به أن لا يرى شيئا إلا جاءت مثل فلق الصبح فمكث على ذلك ما شاء الله أن يمكث وحبب إليه الخلوة فلم يكن شيء أحب إليه من أن يخلو ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated 'Aishah:                     \"The first of what the Messenger of Allah (ﷺ) initiated with of Prophethood, when Allah wanted to honor him and grant His mercy upon His creatures, was that he would not see anything (in a dream) except that it would occur like the break of dawn. So he continued upon that for as long as Allah willed for him to continue, and seclusion was made beloved to him, such that there was not anything more beloved to him than being alone.\"",
      "chain": [
        "20118",
        "11107",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4047",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو كريب، حدثنا يونس بن بكير، عن النضر أبي عمر، عن عكرمة، عن ابن عباس، أن النبي صلى الله عليه وسلم قال ‏\"‏ اللهم أعز الإسلام بأبي جهل بن هشام أو بعمر ‏\"‏ ‏.‏ قال فأصبح فغدا عمر على رسول الله صلى الله عليه وسلم فأسلم ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏ وقد تكلم بعضهم في النضر أبي عمر وهو يروي مناكير من قبل حفظه ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     that the Prophet (ﷺ) said: \"O Allah honor Islam through Abu Jahl bin Hisham or through 'Umar bin Al-Khattab.\" He said: \"So it happened that 'Umar came the next day to the Messenger of Allah (ﷺ) and accepted Islam.\"",
      "chain": [
        "30216",
        "20118",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4103",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا يونس بن بكير، عن محمد بن إسحاق، عن يحيى بن عباد بن عبد الله بن الزبير، عن أبيه، عن جده عبد الله بن الزبير، عن الزبير، قال كان على رسول الله صلى الله عليه وسلم يوم أحد درعان فنهض إلى صخرة فلم يستطع فأقعد تحته طلحة فصعد النبي صلى الله عليه وسلم حتى استوى على الصخرة فقال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ أوجب طلحة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated 'Abdullah bin Az-Zubair:                     that Az-Zubair said: \"On the Day of (the battle of) Uhud, the Messenger of Allah (ﷺ) wore two coats of mail. He tried to get up on a boulder, but was not able to, so Talhah squatted under him, lifting the Prophet (ﷺ) upon it, such that he could sit on the boulder. So he said: 'It (Paradise) is obligatory for Talhah.'\"",
      "chain": [
        "30200",
        "20118",
        "11107",
        "19826",
        "11250",
        "106",
        "7"
      ]
    },
    {
      "hadith_no": "4107",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا يونس بن بكير، حدثنا طلحة بن يحيى، عن موسى، وعيسى، ابنى طلحة عن أبيهما، طلحة أن أصحاب، رسول الله صلى الله عليه وسلم قالوا لأعرابي جاهل سله عمن قضى نحبه من هو وكانوا لا يجترئون على مسألته يوقرونه ويهابونه فسأله الأعرابي فأعرض عنه ثم سأله فأعرض عنه ثم سأله فأعرض عنه ثم إني اطلعت من باب المسجد وعلى ثياب خضر فلما رآني رسول الله صلى الله عليه وسلم قال ‏\"‏ أين السائل عمن قضى نحبه ‏\"‏ ‏.‏ قال الأعرابي أنا يا رسول الله ‏.‏ قال ‏\"‏ هذا ممن قضى نحبه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث أبي كريب عن يونس بن بكير ‏.‏ وقد رواه غير واحد من كبار أهل الحديث عن أبي كريب بهذا الحديث ‏.‏ وسمعت محمد بن إسماعيل يحدث بهذا عن أبي كريب ووضعه في كتاب الفوائد ‏.‏",
      "text_en": " Narrated Musa and 'Eisa, the sons of Talhah:                     from their father: \"The Companions of the Prophet (ﷺ) said, to an unknowing Bedouin man: 'Ask him who it is that has fulfilled his vow.' They were not in the habit of asking questions out of their respect and reverence for him. So the Bedouin asked him, but he turned away from him. Then he asked him again, but he turned away from him. Then again he asked him, but he turned away from him. Then I stood looking from the door of the Masjid, while I was wearing a green garment, and I saw the Prophet (ﷺ), he said: 'Where is the one who was asking about the one who fulfilled his vow?' The Bedouin said: 'Here I am O Messenger of Allah!' The Messenger of Allah (ﷺ) said: 'This is one who has fulfilled his vow.'\"",
      "chain": [
        "30216",
        "20118",
        "11863",
        "20040",
        "10573"
      ]
    },
    {
      "hadith_no": "4188",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو كريب، حدثنا يونس بن بكير، عن محمد بن إسحاق، عن سعيد بن عبيد بن السباق، عن محمد بن أسامة بن زيد، عن أبيه، قال لما ثقل رسول الله صلى الله عليه وسلم هبطت وهبط الناس المدينة فدخلت على رسول الله صلى الله عليه وسلم وقد أصمت فلم يتكلم فجعل رسول الله صلى الله عليه وسلم يضع يديه على ويرفعهما فأعرف أنه يدعو لي ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated Muhammad bin Usamah bin Zaid:                     from his father, that he said: \"When the Messenger of Allah (ﷺ) became weak, I marched and the people marched upon Al-Madinah. I entered upon the Messenger of Allah (ﷺ) and he was unable to speak (because of weakness), so he did not say anything. So the Messenger of Allah (ﷺ) began to place his hands upon me and then raise them up, so I knew he was supplicating for me.\"",
      "chain": [
        "30216",
        "20118",
        "11107",
        "12138",
        "12446"
      ]
    },
    {
      "hadith_no": "1273",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا يونس بن بكير، حدثنا ابن إسحاق، حدثني الزهري، عن أبي سلمة، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ إن الشيطان يأتي أحدكم في صلاته فيدخل بينه وبين نفسه حتى لا يدري زاد أو نقص فإذا كان ذلك فليسجد سجدتين قبل أن يسلم ثم يسلم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) said:                      “TheSatancomes to any one of you while he is praying and comes betweenhim andhis soul, until he does not know whether he as added somethingoromitted something. If that happens, then he should prostrate twicebefore the Salam, then he should say the Salam.”",
      "chain": [
        "35047",
        "20118",
        "11107",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1274",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا يونس بن بكير، حدثنا ابن إسحاق، أخبرني سلمة بن صفوان بن سلمة، عن أبي سلمة، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ إن الشيطان يدخل بين ابن آدم وبين نفسه فلا يدري كم صلى فإذا وجد ذلك فليسجد سجدتين قبل أن يسلم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) said:                      “TheSatancomes between the son of Adam and his soul, and he does not knowhowmany Rak’ah he has prayed. If a person notices that, then let himprostrate twice before he says the Salam.”",
      "chain": [
        "35047",
        "20118",
        "11107",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1443",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، وأبو كريب قالا حدثنا يونس بن بكير، حدثنا محمد بن إسحاق، عن موسى بن أنس، عن ثمامة بن أنس، عن أنس بن مالك، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ من صلى الضحى ثنتى عشرة ركعة بنى الله له قصرا من ذهب في الجنة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Anas bin Malik said:                      “I heard the Messenger ofAllah(ﷺ) say: ‘Whoever prays Duha with twelve Rak’ah, Allah willbuild for him a palace of gold in Paradise.’”",
      "chain": [
        "30212",
        "30216",
        "20118",
        "11107",
        "14383",
        "19"
      ]
    },
    {
      "hadith_no": "1881",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو كريب، حدثنا عبدة بن سليمان، ومحمد بن فضيل، ويونس بن بكير، عن محمد بن إسحاق، عن عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن رافع بن خديج، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ العامل على الصدقة بالحق كالغازي في سبيل الله حتى يرجع إلى بيته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that:                     Rafi bin Khadij said: “I heard the Messenger of Allah say: 'The person who is appointed to collect the Sadaqah - who does so with sincerity and fairness is like one who foes out to fight for the sake of Allah, until he returns to the house.' ”",
      "chain": [
        "30216",
        "20337",
        "20356",
        "20118",
        "11107",
        "11103",
        "1830",
        "1986"
      ]
    },
    {
      "hadith_no": "2940",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا يونس بن بكير، عن محمد بن إسحاق، عن يزيد بن رومان، عن عروة، عن عائشة، أن النبي صلى الله عليه وسلم قال ‏\"‏ الحرب خدعة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Aishah that the Prophet (ﷺ) said:                      “War isdeceit.”",
      "chain": [
        "30212",
        "20118",
        "11107",
        "11233",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2941",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا يونس بن بكير، عن مطر بن ميمون، عن عكرمة، عن ابن عباس، أن النبي صلى الله عليه وسلم قال ‏\"‏ الحرب خدعة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Prophet (ﷺ) said:                      “War isdeceit.”",
      "chain": [
        "30212",
        "20118",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3060",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا يونس بن بكير، حدثنا محمد بن إسحاق، عن محمد بن جعفر بن الزبير، عن عبيد الله بن عبد الله بن أبي ثور، عن صفية بنت شيبة، قالت لما اطمأن رسول الله  صلى الله عليه وسلم  عام الفتح طاف على بعيره يستلم الركن بمحجن بيده ثم دخل الكعبة فوجد فيها حمامة عيدان فكسرها ثم قام على باب الكعبة فرمى بها وأنا أنظره ‏.‏",
      "text_en": " It wasnarrated that Safiyyah bint Shaibah said:                      “When the MessengerofAllah (ﷺ) saw that things had settled down, in the year of theConquest (of Makkah), he performed Tawaf on his camel, touching thecorner with a staff in his hand. Then he entered the House and foundadove made of aloeswood. He broke it, then he stood at the door oftheKa’bah and threw it out, and I was watching him.”",
      "chain": [
        "30212",
        "20118",
        "11107",
        "11215",
        "11200",
        "2802"
      ]
    },
    {
      "hadith_no": "3161",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا يونس بن بكير، حدثنا ابن إسحاق، حدثنا ابن أبي نجيح، عن مجاهد، عن ابن عباس، قال قيل يا رسول الله لم ظاهرت للمحلقين ثلاثا وللمقصرين واحدة قال ‏\"‏ إنهم لم يشكوا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “It was said: ‘O Messenger ofAllah, why did you support (by supplicating for) those who shave(their heads) three times and those who cut (their hair) only once?’He said: ‘Because they did not entertain any doubts.’”",
      "chain": [
        "30212",
        "20118",
        "11107",
        "11254",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "3228",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا يونس بن بكير، حدثنا محمد بن إسحاق، حدثنا أبان بن صالح، عن الحسن بن مسلم بن يناق، عن صفية بنت شيبة، قالت سمعت النبي  صلى الله عليه وسلم  يخطب عام الفتح فقال ‏\"‏ يا أيها الناس إن الله حرم مكة يوم خلق السموات والأرض فهي حرام إلى يوم القيامة لا يعضد شجرها ولا ينفر صيدها ولا يأخذ لقطتها إلا منشد ‏\"‏ ‏.‏ فقال العباس إلا الإذخر فإنه للبيوت والقبور ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ إلا الإذخر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Safiyyah bint Shaibah said:                      “I heard the Prophet(ﷺ) delivering a sermon in the Year of the Conquest (of Makkah),and he said: ‘O people, Allah made Makkah sacred the day He createdthe heavens and the earth, and it is sacred until the Day ofResurrection. Its trees are not to be cut, its game is not to bedisturbed, and its lost property is not to be taken except by one whowill announce it.’‘Abbas said: ‘Except for Idhkhir (a kind of fragrant grass), for it is (used) for houses and graves.’ The messenger of Allah (ﷺ) said: ‘Except for Idhkhir.’”",
      "chain": [
        "30212",
        "20118",
        "11107",
        "19897",
        "11557",
        "2802"
      ]
    },
    {
      "hadith_no": "3449",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا يونس بن بكير، حدثنا هشام بن عروة، عن أبيه، عن عائشة، قالت كانت أمي تعالجني للسمنة تريد أن تدخلني على رسول الله  صلى الله عليه وسلم  فما استقام لها ذلك حتى أكلت القثاء بالرطب فسمنت كأحسن سمنة ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “My mother was trying to fatten meupwhen she wanted to send me to the Messenger of Allah (ﷺ) (whenshegot married), but nothing worked until I ate cucumbers with dates;then I grew plump like the best kind of plump.”",
      "chain": [
        "30212",
        "20118",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4217",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو كريب، حدثنا يونس بن بكير، عن محمد بن إسحاق، حدثني عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن أبي سعيد الخدري، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ تفتح يأجوج ومأجوج فيخرجون كما قال الله تعالى ‏{وهم من كل حدب ينسلون}‏ فيعمون الأرض وينحاز منهم المسلمون حتى تصير بقية المسلمين في مدائنهم وحصونهم ويضمون إليهم مواشيهم حتى أنهم ليمرون بالنهر فيشربونه حتى ما يذرون فيه شيئا فيمر آخرهم على أثرهم فيقول قائلهم لقد كان بهذا المكان مرة ماء ويظهرون على الأرض فيقول قائلهم هؤلاء أهل الأرض قد فرغنا منهم ولننازلن أهل السماء حتى إن أحدهم ليهز حربته إلى السماء فترجع مخضبة بالدم فيقولون قد قتلنا أهل السماء ‏.‏ فبينما هم كذلك إذ بعث الله دواب كنغف الجراد فتأخذ بأعناقهم فيموتون موت الجراد يركب بعضهم بعضا فيصبح المسلمون لا يسمعون لهم حسا فيقولون من رجل يشري نفسه وينظر ما فعلوا فينزل منهم رجل قد وطن نفسه على أن يقتلوه فيجدهم موتى فيناديهم ألا أبشروا فقد هلك عدوكم ‏.‏ فيخرج الناس ويخلون سبيل مواشيهم فما يكون لهم رعى إلا لحومهم فتشكر عليها كأحسن ما شكرت من نبات أصابته قط ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Al-Khudri that the Messenger ofAllah(ﷺ) said:                      \"Gog and Magog people will be set free and they willemerge as Allah says: \"swoop(ing) down from every mound.\"[21:96]Theywill spread throughout the earth, and the Muslims will flee fromthemuntil the remainder of the Muslims are in their cities andfortresses,taking their flocks with them. They will pass by a riverand drinkfrom it, until they leave nothing behind, and the last ofthem willfollow in their footsteps and one of them will say: 'Therewas oncewater in this place.' They will prevail over the earth, thentheirleader will say: 'These are the people of the earth, and wehavefinished them off. Now let us fight the people of heaven!' Thenoneof them will throw his spear towards the sky, and it will comebackdown smeared with blood. And they will say: 'We have killed thepeople of heaven.' While they are like that, Allah will send a wormlike the worm that is found in the noses of sheep, which willpenetrate their necks and they will die like locusts, one on top ofanother. In the morning the Muslims will not hear any sound fromthem,and they will say: 'Who will sell his soul for the sake ofAllah andsee what they are doing?' A man will go down, havingprepared himselfto be killed by them, and he will find them dead, sohe will call outto them: 'Be of good cheer, for your enemy is dead!'Then the peoplewill come out and let their flocks loose, but theywill not haveanything to graze on except their flesh, and they willbecome very fatas if they were grazing on the best vegetation theyever found.'\"",
      "chain": [
        "30216",
        "20118",
        "11107",
        "11103",
        "1830",
        "38"
      ]
    }
  ],
  "total_hadiths": 34
}