{
  "id": "20156",
  "name": "Aflah bin Hameed bin Nafi' أفلح بن حميد بن نافع",
  "full_name": "Aflah bin Hameed bin Nafi' أفلح بن حميد بن نافع",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina",
      "place_display": {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      }
    },
    "death": {
      "date_hijri": "158",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "Ansar",
      "B.al-Najjar",
      "al-Madni"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ خ  م  د  س  ق  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ خ  م  د  س  ق  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ خ  م  د  س  ق  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Medina",
        "ar": "المدينة المنورة",
        "ckb": "مەدینە"
      }
    ],
    "tags_display": [
      {
        "en": "Ansar",
        "ar": "الأنصار",
        "ckb": "ئەنسار"
      },
      {
        "en": "B.al-Najjar",
        "ar": "B.al-Najjar",
        "ckb": "B.al-Najjar"
      },
      {
        "en": "al-Madni",
        "ar": "al-Madni",
        "ckb": "al-Madni"
      }
    ]
  },
  "parents": [
    {
      "id": "11157",
      "name": "Hameed bin Nafi' al-Ansari حميد بن نافع الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "10535",
      "name": "al-Qasim ibn Muhammad القاسم بن محمد بن أبي بكر الصديق",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    },
    {
      "id": "11239",
      "name": "Abu Bakr bin Muhammad bin 'Amr bin Hazm أبو بكر بن محمد بن عمرو بن حزم",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    }
  ],
  "students": [
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20443",
      "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20172",
      "name": "Muhammad bin Abi Fadayk محمد بن إسماعيل بن مسلم بن أبي فديك",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20159",
      "name": "Hatm bin Isma'il al-Madni حاتم بن إسماعيل المدني",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20464",
      "name": "al-Ma'afa bin 'Imaran bin Naufayl المعافى بن عمران",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-261",
      "hadith_no": "261",
      "source": "Sahih Bukhari",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن مسلمة، أخبرنا أفلح، عن القاسم، عن عائشة، قالت كنت أغتسل أنا والنبي، صلى الله عليه وسلم من إناء واحد تختلف أيدينا فيه‏.‏",
      "text_en": " Narrated Aisha:                     The Prophet and I used to take a bath from a single pot of water and our hands used to go in the pot after each other in turn.",
      "usc_msa_ref": "261",
      "chain": [
        "20164",
        "20156",
        "10535",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-1585",
      "hadith_no": "1585",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن بشار، قال حدثني أبو بكر الحنفي، حدثنا أفلح بن حميد، سمعت القاسم بن محمد، عن عائشة  رضى الله عنها  قالت خرجنا مع رسول الله صلى الله عليه وسلم في أشهر الحج، وليالي الحج وحرم الحج، فنزلنا بسرف قالت فخرج إلى أصحابه فقال ‏\"‏ من لم يكن منكم معه هدى فأحب أن يجعلها عمرة فليفعل، ومن كان معه الهدى فلا ‏\"‏‏.‏ قالت فالآخذ بها والتارك لها من أصحابه قالت فأما رسول الله صلى الله عليه وسلم ورجال من أصحابه فكانوا أهل قوة، وكان معهم الهدى، فلم يقدروا على العمرة قالت فدخل على رسول الله صلى الله عليه وسلم وأنا أبكي فقال ‏\"‏ ما يبكيك يا هنتاه ‏\"‏‏.‏ قلت سمعت قولك لأصحابك فمنعت العمرة‏.‏ قال ‏\"‏ وما شأنك ‏\"‏‏.‏ قلت لا أصلي‏.‏ قال ‏\"‏ فلا يضيرك، إنما أنت امرأة من بنات آدم كتب الله عليك ما كتب عليهن، فكوني في حجتك، فعسى الله أن يرزقكيها ‏\"‏‏.‏ قالت فخرجنا في حجته حتى قدمنا منى فطهرت، ثم خرجت من منى فأفضت بالبيت قالت ثم خرجت معه في النفر الآخر حتى نزل المحصب، ونزلنا معه فدعا عبد الرحمن بن أبي بكر فقال ‏\"‏ اخرج بأختك من الحرم، فلتهل بعمرة ثم افرغا، ثم ائتيا ها هنا، فإني أنظركما حتى تأتياني ‏\"‏‏.‏  قالت  فخرجنا حتى إذا فرغت، وفرغت من الطواف ثم جئته بسحر فقال ‏\"‏ هل فرغتم ‏\"‏‏.‏ فقلت نعم‏.‏ فآذن بالرحيل في أصحابه، فارتحل الناس فمر متوجها إلى المدينة‏.‏ ضير من ضار يضير ضيرا، ويقال ضار يضور ضورا وضر يضر ضرا‏.‏",
      "text_en": " Narrated Al-Qasim bin Muhammad:                     ' Aisha said, \"We set out with Allah's Apostles in the months of Hajj, and (in) the nights of Hajj, and at the time and places of Hajj and in a state of Hajj. We dismounted at Sarif (a village six miles from Mecca). The Prophet then addressed his companions and said, \"Anyone who has not got the Hadi and likes to do Umra instead of Hajj may do so (i.e. Hajj-al-Tamattu`) and anyone who has got the Hadi should not finish the Ihram after performing ' `Umra). (i.e. Hajj-al-Qiran). Aisha added, \"The companions of the Prophet obeyed the above (order) and some of them (i.e. who did not have Hadi) finished their Ihram after Umra.\" Allah's Apostle and some of his companions were resourceful and had the Hadi with them, they could not perform Umra (alone) (but had to perform both Hajj and Umra with one Ihram). Aisha added, \"Allah's Apostle came to me and saw me weeping and said, \"What makes you weep, O Hantah?\" I replied, \"I have heard your conversation with your companions and I cannot perform the Umra.\" He asked, \"What is wrong with you?' I replied, ' I do not offer the prayers (i.e. I have my menses).' He said, ' It will not harm you for you are one of the daughters of Adam, and Allah has written for you (this state) as He has written it for them. Keep on with your intentions for Hajj and Allah may reward you that.\" Aisha further added, \"Then we proceeded for Hajj till we reached Mina and I became clean from my menses. Then I went out from Mina and performed Tawaf round the Ka`ba.\" Aisha added, \"I went along with the Prophet in his final departure (from Hajj) till he dismounted at Al-Muhassab (a valley outside Mecca), and we too, dismounted with him.\" He called ' `Abdur-Rahman bin Abu Bakr and said to him, ' Take your sister outside the sanctuary of Mecca and let her assume Ihram for ' `Umra, and when you had finished ' `Umra, return to this place and I will wait for you both till you both return to me.' \" ' Aisha added, \" So we went out of the sanctuary of Mecca and after finishing from the ' `Umra and the Tawaf we returned to the Prophet at dawn. He said, 'Have you performed the ' `Umra?' We replied in the affirmative. So he announced the departure amongst his companions and the people set out for the journey, and the Prophet: too left for Medina.''",
      "usc_msa_ref": "631",
      "chain": [
        "30160",
        "20254",
        "20156",
        "10535",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-1707",
      "hadith_no": "1707",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو نعيم، حدثنا أفلح بن حميد، عن القاسم بن محمد، عن عائشة  رضى الله عنها  قالت نزلنا المزدلفة فاستأذنت النبي صلى الله عليه وسلم سودة أن تدفع قبل حطمة الناس، وكانت امرأة بطيئة، فأذن لها، فدفعت قبل حطمة الناس، وأقمنا حتى أصبحنا نحن، ثم دفعنا بدفعه، فلأن أكون استأذنت رسول الله صلى الله عليه وسلم كما استأذنت سودة أحب إلى من مفروح به‏.‏",
      "text_en": " Narrated `Aisha:                     We got down at Al-Muzdalifa and Sauda asked the permission of the Prophet to leave (early) before the rush of the people. She was a slow woman and he gave her permission, so she departed (from Al- Muzdalifa) before the rush of the people. We kept on staying at Al-Muzdalifa till dawn, and set out with the Prophet but (I suffered so much that) I wished I had taken the permission of Allah's Apostle as Sauda had done, and that would have been dearer to me than any other happiness.",
      "usc_msa_ref": "",
      "chain": [
        "20348",
        "20156",
        "10535",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-1720",
      "hadith_no": "1720",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو نعيم، حدثنا أفلح، عن القاسم، عن عائشة  رضى الله عنها  قالت فتلت قلائد بدن النبي صلى الله عليه وسلم بيدى، ثم قلدها وأشعرها وأهداها، فما حرم عليه شىء كان أحل له‏.‏",
      "text_en": " Narrated `Aisha:                     I twisted with my own hands the garlands for the Budn of the Prophet who garlanded and marked them, and then made them proceed to Mecca; Yet no permissible thing was regarded as illegal for him then.",
      "usc_msa_ref": "753",
      "chain": [
        "20348",
        "20156",
        "10535",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-1723",
      "hadith_no": "1723",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا أفلح بن حميد، عن القاسم، عن عائشة  رضى الله عنها  قالت فتلت قلائد هدى النبي صلى الله عليه وسلم ثم أشعرها وقلدها  أو قلدتها  ثم بعث بها إلى البيت، وأقام بالمدينة، فما حرم عليه شىء كان له حل‏.‏",
      "text_en": " Narrated `Aisha:                     I twisted the garlands for the Hadis of the Prophet and then he marked and garlanded them (or I garlanded them) and then made them proceed to the Ka`ba but he remained in Medina and no permissible thing was regarded as illegal for him then .",
      "usc_msa_ref": "756",
      "chain": [
        "20164",
        "20156",
        "10535",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-1816",
      "hadith_no": "1816",
      "source": "Sahih Bukhari",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا أبو نعيم، حدثنا أفلح بن حميد، عن القاسم، عن عائشة  رضى الله عنها  قالت خرجنا مهلين بالحج في أشهر الحج، وحرم الحج، فنزلنا سرف، فقال النبي صلى الله عليه وسلم لأصحابه ‏\"‏ من لم يكن معه هدى، فأحب أن يجعلها عمرة، فليفعل ومن كان معه هدى فلا ‏\"‏‏.‏ وكان مع النبي صلى الله عليه وسلم ورجال من أصحابه ذوي قوة الهدى، فلم تكن لهم عمرة، فدخل على النبي صلى الله عليه وسلم وأنا أبكي فقال ‏\"‏ ما يبكيك ‏\"‏‏.‏ قلت سمعتك تقول لأصحابك ما قلت فمنعت العمرة‏.‏ قال ‏\"‏ وما شأنك ‏\"‏‏.‏ قلت لا أصلي‏.‏ قال ‏\"‏ فلا يضرك أنت من بنات آدم، كتب عليك ما كتب عليهن، فكوني في حجتك عسى الله أن يرزقكها ‏\"‏‏.‏ قالت فكنت حتى نفرنا من منى، فنزلنا المحصب فدعا عبد الرحمن، فقال ‏\"‏ اخرج بأختك الحرم، فلتهل بعمرة، ثم افرغا من طوافكما، أنتظركما ها هنا ‏\"‏‏.‏ فأتينا في جوف الليل‏.‏ فقال ‏\"‏ فرغتما ‏\"‏‏.‏ قلت نعم‏.‏ فنادى بالرحيل في أصحابه، فارتحل الناس، ومن طاف بالبيت، قبل صلاة الصبح، ثم خرج موجها إلى المدينة‏.‏",
      "text_en": " Narrated `Aisha:                     We set out assuming the Ihram for Hajj in the months of Hajj towards the sacred precincts of Hajj. We dismounted at Sarif and the Prophet said to his companions, \"Whoever has not got the Hadi with him and likes to make it as `Umra, he should do it, but he who has got the Hadi with him should not do it.\" The Prophet and some of his wealthy companions had the Hadi with them, so they did not finish Ihram after performing the `Umra. The Prophet came to me while I was weeping. He asked me the reason for it. I replied, \"I have heard of what you have said to your companions and I cannot do the `Umra.\" He asked me, \"What is the matter with you?\" I replied, \"I am not praying.\" He said, \"There is no harm in it as you are one of the daughters of Adam and the same is written for you as for others. So, you should perform Hajj and I hope that Allah will enable you to perform the `Umra as well.\" So, I carried on till we departed from Mina and halted at Al-Mahassab. The Prophet called `Abdur- Rahman and said, \"Go out of the sanctuary with your sister and let her assume Ihram for `Umra, and after both of you have finished the Tawaf I will be waiting for you at this place.\" We came back at midnight and the Prophet asked us, \"Have you finished?\" I replied in the affirmative. He announced the departure and the people set out for the journey and some of them had performed the Tawaf of the Ka`ba before the morning prayer, and after that the Prophet set out for Medina.",
      "usc_msa_ref": "",
      "chain": [
        "20348",
        "20156",
        "10535",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-muslim-321-4",
      "hadith_no": "321",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن مسلمة بن قعنب، قال حدثنا أفلح بن حميد، عن القاسم بن محمد، عن عائشة، قالت كنت أغتسل أنا ورسول الله، صلى الله عليه وسلم من إناء واحد تختلف أيدينا فيه من الجنابة ‏.‏",
      "text_en": " 'A'isha reported:                      I and the Messenger (may peace be upon him) took a bath from the same vessel and our hands alternated into it in the state that we had had sexual intercourse.",
      "usc_msa_ref": "",
      "chain": [
        "20156",
        "10535",
        "53"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1507",
      "hadith_no": "1507",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا عبد الله بن مسلمة بن قعنب، حدثنا أفلح، عن أبي بكر بن محمد بن عمرو بن حزم، عن سلمان الأغر، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ صلاة الجماعة تعدل خمسا وعشرين من صلاة الفذ ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Prayer said in a congregation is equivalent to twenty-five (prayers) as compared with the prayer said by a single person.",
      "usc_msa_ref": "",
      "chain": [
        "20156",
        "11239",
        "11171",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2882",
      "hadith_no": "2882",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا عبد الله بن مسلمة بن قعنب، حدثنا أفلح بن حميد، عن القاسم بن محمد، عن عائشة، - رضى الله عنها - زوج النبي صلى الله عليه وسلم قالت طيبت رسول الله صلى الله عليه وسلم بيدي لحرمه حين أحرم ولحله حين أحل قبل أن يطوف بالبيت‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her), the wife of the Apostle of Allah (may peace be upon him), reported:                      I applied perfume to the Messenger of Allah (may peace be upon him) with my own hand before he entered upon the state of Ihram, and as he concluded it before-circumambulating the House (for Tawaf-i-lfada).",
      "usc_msa_ref": "",
      "chain": [
        "20156",
        "10535",
        "53"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2980",
      "hadith_no": "2980",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن عبد الله بن نمير، حدثنا إسحاق بن سليمان، عن أفلح بن حميد، عن القاسم، عن عائشة، - رضى الله عنها - قالت خرجنا مع رسول الله صلى الله عليه وسلم مهلين بالحج في أشهر الحج وفي حرم الحج وليالي الحج حتى نزلنا بسرف فخرج إلى أصحابه فقال ‏\"‏ من لم يكن معه منكم هدى فأحب أن يجعلها عمرة فليفعل ومن كان معه هدى فلا ‏\"‏ ‏.‏ فمنهم الآخذ بها والتارك لها ممن لم يكن معه هدى فأما رسول الله صلى الله عليه وسلم فكان معه الهدى ومع رجال من أصحابه لهم قوة فدخل على رسول الله صلى الله عليه وسلم وأنا أبكي فقال ‏\"‏ ما يبكيك ‏\"‏ ‏.‏ قلت سمعت كلامك مع أصحابك فسمعت بالعمرة فمنعت العمرة ‏.‏ قال ‏\"‏ وما لك ‏\"‏ ‏.‏ قلت لا أصلي ‏.‏ قال ‏\"‏ فلا يضرك فكوني في حجك فعسى الله أن يرزقكيها وإنما أنت من بنات آدم كتب الله عليك ما كتب عليهن ‏\"‏ ‏.‏ قالت فخرجت في حجتي حتى نزلنا منى فتطهرت ثم طفنا بالبيت ونزل رسول الله صلى الله عليه وسلم المحصب فدعا عبد الرحمن بن أبي بكر فقال ‏\"‏ اخرج بأختك من الحرم فلتهل بعمرة ثم لتطف بالبيت فإني أنتظركما ها هنا ‏\"‏ ‏.‏ قالت فخرجنا فأهللت ثم طفت بالبيت وبالصفا والمروة فجئنا رسول الله صلى الله عليه وسلم وهو في منزله من جوف الليل فقال ‏\"‏ هل فرغت ‏\"‏ ‏.‏ قلت نعم ‏.‏ فآذن في أصحابه بالرحيل فخرج فمر بالبيت فطاف به قبل صلاة الصبح ثم خرج إلى المدينة ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      We proceeded with the Mes- senger of Allah (may peace be upon him) putting on the Ihram for Hajj during the months of Hajj and the night of Hajj till we encamped at Sarlf. He (the Holy Prophet) went to his Companiens and said: He who has no sacrificial animal with him, in his case I wish that he should perform Umra (with this Ihram), and he who has the sacrificial animal with him should not do it. So some of thtm performed Hajj whereas others who had no sacrificial animals with them did not do (Hajj, but per- formed only 'Umra). The Messenger of Allah (may peace be upon him) had the sacrificial animal with him and those too who could afford it (performed) Hajj). The Messenger of Allah (may peace be upon him) came to me (i. e. A'isha) while I was weeping, and he said: What makes thee weep? I said: I heard your talk with Companions about Umra. He said: What has happened to you? I said: I do not observe prayer (due to the monthly period), whereupon besaid: It would not harm you; you should perform (during this time) the rituals of Hajj (which you can do outside the House). Maybe Allah will compensate you for this. You are one among the daughters of Adam and Allah has ordained for you as He has ordained for them. So I proceeded on (with the rituals of Hajj) till we came to Mina. I washed myself and then circumambuleted the House, and the Messenger of Allah (may peace be upon him) encamped at Muhassab and called, Abd al-Rahman b. Abua Bakr. and said: Take out your sister from the precincts of the Ka'ba in order to put on Ihram for Umra and circumambulate the House. and I shall wait for you here. She said: So I went out and put on Ihram and then circu- mambulated the House. and (ran) between al-Safa and al-Marwa, and then we came to the Messenger of Allah (may peace be upon him) and he was in his bouse in the middle of the night. He said: Have you completed your (rituals)? I said: Yes. He then announced to his Companions to march on. He came out, and went to the House and circumambulated it before the dawn prayer and then proceeded to Medina.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20310",
        "20156",
        "10535",
        "53"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3178",
      "hadith_no": "3178",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا عبد الله بن مسلمة بن قعنب، حدثنا أفلح، - يعني ابن حميد - عن القاسم، عن عائشة، أنها قالت استأذنت سودة رسول الله صلى الله عليه وسلم ليلة المزدلفة تدفع قبله وقبل حطمة الناس وكانت امرأة ثبطة - يقول القاسم والثبطة الثقيلة - قال فأذن لها فخرجت قبل دفعه وحبسنا حتى أصبحنا فدفعنا بدفعه ولأن أكون استأذنت رسول الله صلى الله عليه وسلم كما استأذنته سودة فأكون أدفع بإذنه أحب إلى من مفروح به ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      Sauda (the wife of the Holy Prophet) who was bulky sought the permission of Allah's Messenger (may peace be upon him) on the night of Muzdalifa to move from (that place) ahead of him and before the multitude (set forth). He (Allah's Apostle) gave her the permission. So she set forth before his (Holy Prophet's) departure. But we stayed there until it was dawn and we moved on, when he departed. And if I were to seek the permission of Allah's Messenger. (may peace be upon him) as Sauda had sought permission, I could have also gone with his permission and it would have been better for me than that for which I was happy.",
      "usc_msa_ref": "",
      "chain": [
        "20156",
        "10535",
        "53"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3261",
      "hadith_no": "3261",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا عبد الله بن مسلمة بن قعنب، حدثنا أفلح، عن القاسم، عن عائشة، قالت فتلت قلائد بدن رسول الله صلى الله عليه وسلم بيدى ثم أشعرها وقلدها ثم بعث بها إلى البيت وأقام بالمدينة فما حرم عليه شىء كان له حلا ‏.‏",
      "text_en": " 'A'isha reported:                      I wove the garlands for the sacrificial animals of Allah's Messenger (may peace be upon him) with my own bands, and then he (the Holy Prophet) marked them, and garlanded them, and then sent them to the House, and stayed at Medina and nothing was forbidden to him which was lawful for him (before).",
      "usc_msa_ref": "",
      "chain": [
        "20156",
        "10535",
        "53"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-3289",
      "hadith_no": "3289",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا عبد الله بن مسلمة بن قعنب، حدثنا أفلح، عن القاسم بن محمد، عن عائشة، قالت كنا نتخوف أن تحيض، صفية قبل أن تفيض - قالت - فجاءنا رسول الله صلى الله عليه وسلم فقال ‏\"‏ أحابستنا صفية ‏\"‏ ‏.‏ قلنا قد أفاضت ‏.‏ قال ‏\"‏ فلا إذا ‏\"‏ ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      We feared that Safiyyah might have entered the period of menses before performing Tawaf Ifada. Allah's Messenger (may peace be upon him) came to us and said: Is Safiyyah going to detain us? Thereupon we said: She has performed Tawaf Ifada. He (the Holy Prophet) said: Then there is no detention (for us) now.",
      "usc_msa_ref": "",
      "chain": [
        "20156",
        "10535",
        "53"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-1739",
      "hadith_no": "1739",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا هشام بن بهرام المدائني، حدثنا المعافى بن عمران، عن أفلح، - يعني ابن حميد - عن القاسم بن محمد، عن عائشة، رضى الله عنها أن رسول الله صلى الله عليه وسلم وقت لأهل العراق ذات عرق ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) appointed Dhat Irq as the place for putting on ihram for the people of Iraq.",
      "usc_msa_ref": "",
      "chain": [
        "38681",
        "20156",
        "10535",
        "53"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1757",
      "hadith_no": "1757",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن مسلمة القعنبي، حدثنا أفلح بن حميد، عن القاسم، عن عائشة، قالت فتلت قلائد بدن رسول الله صلى الله عليه وسلم بيدى ثم أشعرها وقلدها ثم بعث بها إلى البيت وأقام بالمدينة فما حرم عليه شىء كان له حلا ‏.‏",
      "text_en": " Ai’shah said :                     I twisted the garlands of the sacrificial animals of the Messenger of Allah (SWAS) with my own hands, after which he made incision in their humps and garlanded them, and sent them as offerings to the house (Kabah), but he himself stayed back at Madinah and nothing which had been lawful for him had been forbidden.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "20156",
        "10535",
        "53"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2005",
      "hadith_no": "2005",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا وهب بن بقية، عن خالد، عن أفلح، عن القاسم، عن عائشة، - رضى الله عنها - قالت أحرمت من التنعيم بعمرة فدخلت فقضيت عمرتي وانتظرني رسول الله صلى الله عليه وسلم بالأبطح حتى فرغت وأمر الناس بالرحيل ‏.‏ قالت وأتى رسول الله صلى الله عليه وسلم البيت فطاف به ثم خرج ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     I put on ihram for umrah at at-Tan'im and I entered (Mecca) and performed my umrah as an atonement. The Messenger of Allah (ﷺ) waited for me at al-Abtah till I finished it. He commanded the people to depart. The Messenger of Allah (ﷺ) came to the House (the Ka'bah), went round it and went out (i.e. left for Medina).",
      "usc_msa_ref": "",
      "chain": [
        "30569",
        "20423",
        "20156",
        "10535",
        "53"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-2006",
      "hadith_no": "2006",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو بكر، - يعني الحنفي - حدثنا أفلح، عن القاسم، عن عائشة، قالت خرجت معه - تعني مع النبي صلى الله عليه وسلم - في النفر الآخر فنزل المحصب - قال أبو داود ولم يذكر ابن بشار قصة بعثها إلى التنعيم في هذا الحديث - قالت ثم جئته بسحر فأذن في أصحابه بالرحيل فارتحل فمر بالبيت قبل صلاة الصبح فطاف به حين خرج ثم انصرف متوجها إلى المدينة ‏.‏",
      "text_en": " Narrated 'Aishah:                     I went out along with the Prophet (ﷺ) during his last march, and he alighted at al-Muhassab.Abu Dawud said: Ibn Bashshar did not mention that she was sent to al-Tan'im in this tradition. She said: I then came to him in the morning. He announced to his companions for departure, and he himself departed. He passed the house (the Ka'bah) before the dawn prayer, and went round it when he proceeded. He then went away facing Medina.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20254",
        "20156",
        "10535",
        "53"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-an-nasai-2653",
      "hadith_no": "2653",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا هشام بن بهرام، قال حدثنا المعافى، عن أفلح بن حميد، عن القاسم، عن عائشة، أن رسول الله صلى الله عليه وسلم وقت لأهل المدينة ذا الحليفة ولأهل الشام ومصر الجحفة ولأهل العراق ذات عرق ولأهل اليمن يلملم ‏.‏",
      "text_en": " It was narrated from 'Aishah:                     That the Messenger of Allah designated Dhul-Hulaifah as the Miqat for the people of Al-Madinah, Al-Juhfah for the people of Ash-sham and Eguypt, Dhat 'Irq fro the people of al-Iraq, and Yalamlam for the people of Yemen.",
      "usc_msa_ref": "",
      "chain": [
        "38433",
        "38681",
        "20156",
        "10535",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2656",
      "hadith_no": "2656",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني محمد بن عبد الله بن عمار الموصلي، قال حدثنا أبو هاشم، محمد بن علي عن المعافى، عن أفلح بن حميد، عن القاسم، عن عائشة، قالت وقت رسول الله صلى الله عليه وسلم لأهل المدينة ذا الحليفة ولأهل الشام ومصر الجحفة ولأهل العراق ذات عرق ولأهل نجد قرنا ولأهل اليمن يلملم ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah designated Dhul-Hulaifah as the Miqat for the people of Al-Madinah, Al-Juhfah for the people Ash-sham and Egypt, Dhat 'Irq for the people Al-'Iraq, Qarn for the people of Najd and Yalamlam for the people of Yemen.\"",
      "usc_msa_ref": "",
      "chain": [
        "30029",
        "20156",
        "10535",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2772",
      "hadith_no": "2772",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عمرو بن علي، قال أنبأنا وكيع، قال حدثني أفلح بن حميد، عن القاسم، عن عائشة، أن رسول الله صلى الله عليه وسلم أشعر بدنه ‏.‏",
      "text_en": " It was narrated from Aishah:                     That the Messenger of Allah marked his Budn",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20032",
        "20156",
        "10535",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-2783",
      "hadith_no": "2783",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أحمد بن حرب، قال حدثنا قاسم، - وهو ابن يزيد - قال حدثنا أفلح، عن القاسم بن محمد، عن عائشة، قالت فتلت قلائد بدن رسول الله صلى الله عليه وسلم بيدى ثم قلدها وأشعرها ووجهها إلى البيت وبعث بها وأقام فما حرم عليه شىء كان له حلالا ‏.‏",
      "text_en": " It was narrated that Aishah said:                     \"I twisted the garlands of the Budn of the Messenger of Allah with my own hands, then he garlanded it and marked it, and directed it toward the House and sent it. But he stayed with his family, and nothing became forbidden for him that was allowed.\"",
      "usc_msa_ref": "",
      "chain": [
        "38011",
        "20156",
        "10535",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-3217",
      "hadith_no": "3217",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حماد بن خالد، عن أفلح، عن القاسم، عن عائشة، أن النبي  صلى الله عليه وسلم  قلد وأشعر وأرسل بها ولم يجتنب ما يجتنب المحرم ‏.‏",
      "text_en": " It wasnarrated from ‘Aishah that the Prophet (ﷺ) garlanded, andmarked,and sent (the sacrificial animals), but he did not avoidanythingthat the one in Ihram avoids.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20537",
        "20156",
        "10535",
        "53"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 22,
  "grade_display": {
    "en": "Successor (Taba' Tabi') [7th Generation]",
    "ar": "تابع التابعين [الجيل السابع]",
    "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
  }
}