{
  "id": "20159",
  "name": "Hatm bin Isma'il al-Madni حاتم بن إسماعيل المدني",
  "full_name": "Hatm bin Isma'il al-Madni حاتم بن إسماعيل المدني",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "187",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ ع  -  صدوق له أوهام ]"
    ],
    "tags": [
      "B.Haritha",
      "Client",
      "al-Madni",
      "Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11450",
      "name": "Yazid bin Abi 'Ubaid يزيد بن أبي عبيد",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11679",
      "name": "al-J'ad bin 'Abdur Rahman الجعد/الجعيد بن عبد الرحمن بن أوس",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "22259",
      "name": "Abu al-Malih al-Farsi أبو المليح الفارسي المدني الخراط",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20156",
      "name": "Aflah bin Hameed bin Nafi' أفلح بن حميد بن نافع",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28061",
      "name": "Bashr bin Rafa'i al-Harithy بشر بن رافع الحارثي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11504",
      "name": "Khthym bin Arak bin Malik خثيم بن عراك بن مالك",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11541",
      "name": "Mua'wiya bin Abi Mazrad معاوية بن أبي مزرد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11106",
      "name": "Musa bin 'Uqba موسى بن عقبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30465",
      "name": "Sa'id bin 'Amr bin Sahl al-Kundi سعيد بن عمرو بن سهل الكندي الأشعثي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30309",
      "name": "Ibrahim bin Musa al-Razi al-Fara' إبراهيم بن موسى الرازي الفراء",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30480",
      "name": "Hanad bin al-Sari bin Mus'ab هناد بن السري بن مصعب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30216",
      "name": "Abu Karayb, Muhammad bin al-'Ala' محمد بن العلاء - أبو كريب",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "190",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الرحمن بن يونس، قال حدثنا حاتم بن إسماعيل، عن الجعد، قال سمعت السائب بن يزيد، يقول ذهبت بي خالتي إلى النبي صلى الله عليه وسلم فقالت يا رسول الله، إن ابن أختي وجع‏.‏ فمسح رأسي ودعا لي بالبركة، ثم توضأ فشربت من وضوئه، ثم قمت خلف ظهره، فنظرت إلى خاتم النبوة بين كتفيه مثل زر الحجلة‏.‏",
      "text_en": " Narrated As-Sa'ib bin Yazid:                     My aunt took me to the Prophet and said, \"O Allah's Apostle! This son of my sister has got a disease in his legs.\" So he passed his hands on my head and prayed for Allah's blessings for me; then he performed ablution and I drank from the remaining water. I stood behind him and saw the seal of Prophethood between his shoulders, and it was like the \"Zir-al-Hijla\" (means the button of a small tent, but some said 'egg of a partridge.' etc.)",
      "chain": [
        "30256",
        "20159",
        "11580",
        "3048"
      ]
    },
    {
      "hadith_no": "1605",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا حاتم، عن هشام، عن عروة، دخل النبي صلى الله عليه وسلم عام الفتح من كداء من أعلى مكة‏.‏ وكان عروة أكثر ما يدخل من كداء وكان أقربهما إلى منزله‏.‏",
      "text_en": " Narrated Hisham:                     `Urwa said, \"The Prophet entered Mecca in the year of the conquest of Mecca from the side of Kada' which is at the higher part of Mecca.\" `Urwa often entered from Kada' which was nearer of the two to his dwelling place.",
      "chain": [
        "30143",
        "20159",
        "11065"
      ]
    },
    {
      "hadith_no": "1889",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا عبد الرحمن بن يونس، حدثنا حاتم بن إسماعيل، عن محمد بن يوسف، عن السائب بن يزيد، قال حج بي مع رسول الله صلى الله عليه وسلم وأنا ابن سبع سنين‏.‏",
      "text_en": " Narrated As-Sa'ib bin Yazid:                     (While in the company of my parents) I was made to perform Hajj with Allah's Apostle and I was a seven-year-old boy then. (Fath-ul-Bari, p.443, Vol.4)",
      "chain": [
        "30256",
        "20159",
        "30388",
        "3048"
      ]
    },
    {
      "hadith_no": "2484",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا بشر بن مرحوم، حدثنا حاتم بن إسماعيل، عن يزيد بن أبي عبيد، عن سلمة  رضى الله عنه  قال خفت أزواد القوم وأملقوا، فأتوا النبي صلى الله عليه وسلم في نحر إبلهم فأذن لهم، فلقيهم عمر فأخبروه فقال ما بقاؤكم بعد إبلكم، فدخل على النبي صلى الله عليه وسلم فقال يا رسول الله ما بقاؤهم بعد إبلهم‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ناد في الناس فيأتون بفضل أزوادهم ‏\"‏‏.‏ فبسط لذلك نطع، وجعلوه على النطع‏.‏ فقام رسول الله صلى الله عليه وسلم فدعا وبرك عليه ثم دعاهم بأوعيتهم فاحتثى الناس حتى فرغوا، ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ أشهد أن لا إله إلا الله وأني رسول الله ‏\"‏‏.‏",
      "text_en": " Narrated Salama:                     Once the journey food diminished and the people were reduced to poverty. They went to the Prophet and asked his permission to slaughter their camels, and he agreed. `Umar met them and they told him about it, and he said, \"How would you survive after slaughtering your camels?\" Then he went to the Prophet and said, \"O Allah's Apostle! How would they survive after slaughtering their camels?\" Allah's Apostle ordered `Umar, \"Call upon the people to bring what has remained of their food.\" A leather sheet was spread and al I the journey food was collected and heaped over it. Allah's Apostle stood up and invoked Allah to bless it, and then directed all the people to come with their utensils, and they started taking from it till all of them got what was sufficient for them. Allah's Apostle then said, \"I testify that None has the right to be worshipped but Allah, and I am His Apostle. \"",
      "chain": [
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "hadith_no": "2824",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، عن محمد بن يوسف، عن السائب بن يزيد، قال صحبت طلحة بن عبيد الله وسعدا والمقداد بن الأسود وعبد الرحمن بن عوف  رضى الله عنهم  فما سمعت أحدا، منهم يحدث عن رسول الله صلى الله عليه وسلم، إلا أني سمعت طلحة يحدث عن يوم أحد‏.‏",
      "text_en": " Narrated As-Sa'-ib bin Yazid:                     I was in the company of Talha bin 'Ubaidullah, Sa`d, Al-Miqdad bin Al-Aswad and `Abdur Rahman bin `Auf and I heard none of them narrating anything from Allah's Apostle but Talha was talking about the day (of the battle) of Uhud.",
      "chain": [
        "30367",
        "20159",
        "30388",
        "3048"
      ]
    },
    {
      "hadith_no": "2899",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا حاتم بن إسماعيل، عن يزيد بن أبي عبيد، قال سمعت سلمة بن الأكوع  رضى الله عنه  قال مر النبي صلى الله عليه وسلم على نفر من أسلم ينتضلون فقال النبي صلى الله عليه وسلم ‏\"‏ ارموا بني إسماعيل، فإن أباكم كان راميا ارموا وأنا مع بني فلان ‏\"‏‏.‏ قال فأمسك أحد الفريقين بأيديهم‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما لكم لا ترمون ‏\"‏‏.‏ قالوا كيف نرمي وأنت معهم‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ ارموا فأنا معكم كلكم ‏\"‏‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     The Prophet passed by some people of the tribe of Bani Aslam who were practicing archery. The Prophet said, \"O Bani Isma`il ! Practice archery as your father Isma`il was a great archer. Keep on throwing arrows and I am with Bani so-and-so.\" So one of the parties ceased throwing. Allah's Apostle said, \"Why do you not throw?\" They replied, \"How should we throw while you are with them (i.e. on their side)?\" On that the Prophet said, \"Throw, and I am with all of you.\"",
      "chain": [
        "20164",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "hadith_no": "2975",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا قتيبة، حدثنا حاتم بن إسماعيل، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع  رضى الله عنه  قال كان علي  رضى الله عنه  تخلف عن النبي صلى الله عليه وسلم في خيبر، وكان به رمد، فقال أنا أتخلف عن رسول الله صلى الله عليه وسلم فخرج علي فلحق بالنبي صلى الله عليه وسلم، فلما كان مساء الليلة التي فتحها في صباحها، فقال رسول الله صلى الله عليه وسلم ‏\"‏ لأعطين الراية  أو قال ليأخذن  غدا رجل يحبه الله ورسوله  أو قال يحب الله ورسوله  يفتح الله عليه ‏\"‏‏.‏ فإذا نحن بعلي، وما نرجوه، فقالوا هذا علي، فأعطاه رسول الله صلى الله عليه وسلم، ففتح الله عليه‏.‏",
      "text_en": "      Narrated Salama bin Al-Akwa:                          Ali remained behind the Prophet during the battle of Khaibar as he way     suffering from some eye trouble but then he said, \"How should I stay      behind Allah's Apostle?\" So, he set out till he joined the Prophet. On     the eve of the day of the conquest of Khaibar, Allah's Apostle said,      \"(No doubt) I will give the flag or, tomorrow, a man whom Allah and      His Apostle love or who loves Allah and His apostle will take the      flag. Allah will bestow victory upon him.\" Suddenly 'Ali joined us      though we were not expecting him. The people said, \"Here is 'Ali. \"So,     Allah's Apostle gave the flag to him and Allah bestowed victory upon      him.",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "hadith_no": "2982",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا بشر بن مرحوم، حدثنا حاتم بن إسماعيل، عن يزيد بن أبي عبيد، عن سلمة  رضى الله عنه قال خفت أزواد الناس وأملقوا، فأتوا النبي صلى الله عليه وسلم في نحر إبلهم، فأذن لهم، فلقيهم عمر فأخبروه فقال ما بقاؤكم بعد إبلكم فدخل عمر على النبي صلى الله عليه وسلم فقال يا رسول الله ما بقاؤهم بعد إبلهم قال رسول الله صلى الله عليه وسلم ‏\"‏ ناد في الناس يأتون بفضل أزوادهم ‏\"‏‏.‏ فدعا وبرك عليه، ثم دعاهم بأوعيتهم، فاحتثى الناس حتى فرغوا، ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ أشهد أن لا إله إلا الله، وأني رسول الله ‏\"‏‏.‏",
      "text_en": " Narrated Salama:                     Once the journey-food of the people ran short and they were in great need. So, they came to the Prophet to take his permission for slaughtering their camels, and he permitted them. Then `Umar met them and they informed him about it. He said, \"What will sustain you after your camels (are finished)?\" Then `Umar went to the Prophet and said, \"O Allah's Apostle! What will sustain them after their camels (are finished)?\" Allah's Apostle said, \"Make an announcement amongst the people that they should bring all their remaining food (to me).\" (They brought it and) the Prophet invoked Allah and asked for His Blessings for it. Then he asked them to bring their food utensils and the people started filling their food utensils with their hands till they were satisfied. Allah's Apostle then said, \"I testify that None has the right to be worshipped but Allah, and I am His Apostle. \"",
      "chain": [
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "hadith_no": "3183",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، عن هشام بن عروة، عن أبيه، عن أسماء ابنة أبي بكر  رضى الله عنهما  قالت قدمت على أمي وهى مشركة في عهد قريش، إذ عاهدوا رسول الله صلى الله عليه وسلم ومدتهم، مع أبيها، فاستفتت رسول الله صلى الله عليه وسلم فقالت يا رسول الله، إن أمي قدمت على، وهى راغبة، أفأصلها قال ‏\"‏ نعم، صليها ‏\"‏‏.‏",
      "text_en": " Narrated Asma 'bint Abi Bakr:                     During the period of the peace treaty of Quraish with Allah's Apostle, my mother, accompanied by her father, came to visit me, and she was a pagan. I consulted Allah's Apostle, \"O Allah's Apostle! My mother has come to me and she desires to receive a reward from me, shall I keep good relation with her?\" He said, \"Yes, keep good relation with her.\"",
      "chain": [
        "30367",
        "20159",
        "11065",
        "10511",
        "70"
      ]
    },
    {
      "hadith_no": "3373",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع  رضى الله عنه  قال مر النبي صلى الله عليه وسلم على نفر من أسلم ينتضلون، فقال رسول الله صلى الله عليه وسلم ‏\"‏ ارموا بني إسماعيل، فإن أباكم كان راميا، وأنا مع بني فلان ‏\"‏‏.‏ قال فأمسك أحد الفريقين بأيديهم، فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما لكم لا ترمون ‏\"‏‏.‏ فقالوا يا رسول الله، نرمي وأنت معهم قال ‏\"‏ ارموا وأنا معكم كلكم ‏\"‏‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     The Prophet passed by some persons of the tribe of Aslam practicing archery (i.e. the throwing of arrows) Allah's Apostle said, \"O offspring of Ishmael! Practice archery (i.e. arrow throwing) as your father was a great archer (i.e. arrow-thrower). I am with (on the side of) the son of so-and-so-.\" Hearing that, one of the two teams stopped throwing. Allah's Apostle asked them, ' Why are you not throwing?\" They replied, \"O Allah's Apostle! How shall we throw when you are with the opposite team?\" He said, \"Throw, for I am with you all.\"",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "hadith_no": "3581",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا محمد بن عبيد الله، حدثنا حاتم، عن الجعيد بن عبد الرحمن، قال سمعت السائب بن يزيد، قال ذهبت بي خالتي إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن ابن أختي‏.‏ وقع فمسح رأسي ودعا لي بالبركة، وتوضأ فشربت من وضوئه، ثم قمت خلف ظهره فنظرت إلى خاتم بين كتفيه‏.‏ قال ابن عبيد الله الحجلة من حجل الفرس الذي بين عينيه‏.‏ قال إبراهيم بن حمزة مثل زر الحجلة",
      "text_en": " Narrated As- Scab bin Yazid:                     My aunt took me to Allah's Apostle and said, \"O Allah's Apostle! My nephew is sick\"' The Prophet passed his hands over my head and blessed me. Then he performed ablution and I drank the remaining water, and standing behind him. A saw the seal in between his shoulders.\"",
      "chain": [
        "30213",
        "20159",
        "11679",
        "3048"
      ]
    },
    {
      "hadith_no": "3749",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا قتيبة، حدثنا حاتم، عن يزيد بن أبي عبيد، عن سلمة، قال كان علي قد تخلف عن النبي صلى الله عليه وسلم في خيبر وكان به رمد فقال أنا أتخلف عن رسول الله صلى الله عليه وسلم فخرج علي فلحق بالنبي صلى الله عليه وسلم، فلما كان مساء الليلة التي فتحها الله في صباحها، قال رسول الله صلى الله عليه وسلم ‏\"‏ لأعطين الراية  أو ليأخذن الراية  غدا رجلا يحبه الله ورسوله  أو قال يحب الله ورسوله  يفتح الله عليه ‏\"‏‏.‏ فإذا نحن بعلي وما نرجوه، فقالوا هذا علي‏.‏ فأعطاه رسول الله صلى الله عليه وسلم ففتح الله عليه‏.‏",
      "text_en": " Narrated Salama:                     `Ali happened to stay behind the Prophet and (did not join him) during the battle of Khaibar for he was having eye trouble. Then he said, \"How could I remain behind Allah's Apostle?\" So `Ali set out following the Prophet , When it was the eve of the day in the morning of which Allah helped (the Muslims) to conquer it, Allah's Apostle said, \"I will give the flag (to a man), or tomorrow a man whom Allah and His Apostle love will take the flag,\" or said, \"A man who loves Allah and His Apostle; and Allah will grant victory under his leadership.\" Suddenly came `Ali whom we did not expect. The people said, \"This is `Ali.\" Allah's Apostle gave him the flag and Allah granted victory under his leadership.",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "hadith_no": "3981",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني إبراهيم بن حمزة، حدثنا حاتم، عن عبد الرحمن بن حميد الزهري، قال سمعت عمر بن عبد العزيز، يسأل السائب ابن أخت النمر ما سمعت في، سكنى مكة قال سمعت العلاء بن الحضرمي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاث للمهاجر بعد الصدر ‏\"‏‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Humaid Az-Zuhri:                     I heard `Umar bin `Abdul-Aziz asking As-Sa'ib, the nephew of An-Nimr. \"What have you heard about residing in Mecca?\" The other said, \"I heard Al-Ala bin Al-Hadrami saying, Allah's Apostle said: An Emigrant is allowed to stay in Mecca for three days after departing from Mina (i.e. after performing all the ceremonies of Hajj)\"",
      "chain": [
        "30101",
        "20159",
        "586"
      ]
    },
    {
      "hadith_no": "4111",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا حاتم بن إسماعيل، عن محمد بن يوسف، قال سمعت السائب بن يزيد، قال صحبت عبد الرحمن بن عوف وطلحة بن عبيد الله والمقداد وسعدا رضى الله عنهم فما سمعت أحدا منهم يحدث عن النبي صلى الله عليه وسلم، إلا أني سمعت طلحة يحدث عن يوم أحد",
      "text_en": " Narrated As-Saib bin Yazid:                     I have been in the company of `AbdurRahman bin `Auf, Talha bin 'Ubaidullah, Al-Miqdad and Sa`d, and I heard none of them narrating anything from the Prophet excepting the fact that I heard Talha narrating about the day of Uhud (battle) .",
      "chain": [
        "30145",
        "20159",
        "30388",
        "3048"
      ]
    },
    {
      "hadith_no": "4220",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، عن يزيد بن أبي عبيد، قال قلت لسلمة بن الأكوع على أى شىء بايعتم رسول الله صلى الله عليه وسلم يوم الحديبية‏.‏ قال على الموت‏.‏",
      "text_en": " Narrated Yazid bin Abi Ubaid:                     I said to Salama bin Al-Akwa`, \"For what did you give the Pledge of allegiance to Allah's Apostle on the day of Al-Hudaibiya?\" He replied, \"For death (in the Cause of Islam.).",
      "chain": [
        "30367",
        "20159",
        "11450"
      ]
    },
    {
      "hadith_no": "4243",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، عن يزيد بن أبي عبيد، قال سمعت سلمة بن الأكوع، يقول خرجت قبل أن يؤذن، بالأولى، وكانت لقاح رسول الله صلى الله عليه وسلم ترعى بذي قرد  قال  فلقيني غلام لعبد الرحمن بن عوف فقال أخذت لقاح رسول الله صلى الله عليه وسلم قلت من أخذها قال غطفان‏.‏ قال فصرخت ثلاث صرخات  يا صباحاه  قال فأسمعت ما بين لابتى المدينة، ثم اندفعت على وجهي حتى أدركتهم وقد أخذوا يستقون من الماء، فجعلت أرميهم بنبلي، وكنت راميا، وأقول أنا ابن الأكوع، اليوم يوم الرضع‏.‏ وأرتجز حتى استنقذت اللقاح منهم، واستلبت منهم ثلاثين بردة، قال وجاء النبي صلى الله عليه وسلم والناس فقلت يا نبي الله قد حميت القوم الماء وهم عطاش، فابعث إليهم الساعة‏.‏ فقال ‏\"‏ يا ابن الأكوع، ملكت فأسجح ‏\"‏‏.‏ قال ثم رجعنا ويردفني رسول الله صلى الله عليه وسلم على ناقته حتى دخلنا المدينة‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     Once I went (from Medina) towards (Al-Ghaba) before the first Adhan of the Fajr Prayer. The shecamels of Allah's Apostle used to graze at a place called Dhi-Qarad. A slave of `Abdur-Rahman bin `Auf met me (on the way) and said, \"The she-camels of Allah's Apostle had been taken away by force.\" I asked, \"Who had taken them?\" He replied \"(The people of) Ghatafan.\" I made three loud cries (to the people of Medina) saying, \"O Sabahah!\" I made the people between the two mountains of Medina hear me. Then I rushed onward and caught up with the robbers while they were watering the camels. I started throwing arrows at them as I was a good archer and I was saying, \"I am the son of Al-Akwa`, and today will perish the wicked people.\" I kept on saying like that till I restored the shecamels (of the Prophet), I also snatched thirty Burda (i.e. garments) from them. Then the Prophet and the other people came there, and I said, \"O Allah's Prophet! I have stopped the people (of Ghatafan) from taking water and they are thirsty now. So send (some people) after them now.\" On that the Prophet said, \"O the son of Al-Akwa`! You have over-powered them, so forgive them.\" Then we all came back and Allah's Apostle seated me behind him on his she-camel till we entered Medina.",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "hadith_no": "4245",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا حاتم بن إسماعيل، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع  رضى الله عنه  قال خرجنا مع النبي صلى الله عليه وسلم إلى خيبر فسرنا ليلا، فقال رجل من القوم لعامر يا عامر ألا تسمعنا من هنيهاتك‏.‏ وكان عامر رجلا شاعرا فنزل يحدو بالقوم يقول اللهم لولا أنت ما اهتدينا ولا تصدقنا ولا صلينا فاغفر فداء لك ما أبقينا وثبت الأقدام إن لاقينا وألقين سكينة علينا إنا إذا صيح بنا أبينا وبالصياح عولوا علينا فقال رسول الله صلى الله عليه وسلم ‏\"‏ من هذا السائق ‏\"‏‏.‏ قالوا عامر بن الأكوع‏.‏ قال ‏\"‏ يرحمه الله ‏\"‏‏.‏ قال رجل من القوم وجبت يا نبي الله، لولا أمتعتنا به‏.‏ فأتينا خيبر، فحاصرناهم حتى أصابتنا مخمصة شديدة، ثم إن الله تعالى فتحها عليهم، فلما أمسى الناس مساء اليوم الذي فتحت عليهم أوقدوا نيرانا كثيرة، فقال النبي صلى الله عليه وسلم ‏\"‏ ما هذه النيران على أى شىء توقدون ‏\"‏‏.‏ قالوا على لحم‏.‏ قال ‏\"‏ على أى لحم ‏\"‏‏.‏ قالوا لحم حمر الإنسية‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ أهريقوها واكسروها ‏\"‏‏.‏ فقال رجل يا رسول الله، أو نهريقها ونغسلها قال ‏\"‏ أو ذاك ‏\"‏‏.‏ فلما تصاف القوم كان سيف عامر قصيرا فتناول به ساق يهودي ليضربه، ويرجع ذباب سيفه، فأصاب عين ركبة عامر، فمات منه قال فلما قفلوا، قال سلمة رآني رسول الله صلى الله عليه وسلم وهو آخذ بيدي، قال ‏\"‏ ما لك ‏\"‏‏.‏ قلت له فداك أبي وأمي، زعموا أن عامرا حبط عمله‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ كذب من قاله، إن له لأجرين  وجمع بين إصبعيه  إنه لجاهد مجاهد قل عربي مشى بها مثله ‏\"‏‏.‏ حدثنا قتيبة حدثنا حاتم قال ‏\"‏ نشأ بها ‏\"‏‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     We went out to Khaibar in the company of the Prophet. While we were proceeding at night, a man from the group said to 'Amir, \"O 'Amir! Won't you let us hear your poetry?\" 'Amir was a poet, so he got down and started reciting for the people poetry that kept pace with the camels' footsteps, saying:-- \"O Allah! Without You we Would not have been guided On the right path Neither would be have given In charity, nor would We have prayed. So please forgive us, what we have committed (i.e. our defects); let all of us Be sacrificed for Your Cause And send Sakina (i.e. calmness) Upon us to make our feet firm When we meet our enemy, and If they will call us towards An unjust thing, We will refuse. The infidels have made a hue and Cry to ask others' help Against us.\" The Prophet on that, asked, \"Who is that (camel) driver (reciting poetry)?\" The people said, \"He is 'Amir bin Al-Akwa`.\" Then the Prophet said, \"May Allah bestow His Mercy on him.\" A man amongst the people said, \"O Allah's Prophet! has (martyrdom) been granted to him. Would that you let us enjoy his company longer.\" Then we reached and besieged Khaibar till we were afflicted with severe hunger. Then Allah helped the Muslims conquer it (i.e. Khaibar). In the evening of the day of the conquest of the city, the Muslims made huge fires. The Prophet said, \"What are these fires? For cooking what, are you making the fire?\" The people replied, \"(For cooking) meat.\" He asked, \"What kind of meat?\" They (i.e. people) said, \"The meat of donkeys.\" The Prophet said, \"Throw away the meat and break the pots!\" Some man said, \"O Allah's Apostle! Shall we throw away the meat and wash the pots instead?\" He said, \"(Yes, you can do) that too.\" So when the army files were arranged in rows (for the clash), 'Amir's sword was short and he aimed at the leg of a Jew to strike it, but the sharp blade of the sword returned to him and injured his own knee, and that caused him to die. When they returned from the battle, Allah's Apostle saw me (in a sad mood). He took my hand and said, \"What is bothering you?\" I replied, \"Let my father and mother be sacrificed for you! The people say that the deeds of 'Amir are lost.\" The Prophet said, \"Whoever says so, is mistaken, for 'Amir has got a double reward.\" The Prophet raised two fingers and added, \"He (i.e. Amir) was a persevering struggler in the Cause of Allah and there are few 'Arabs who achieved the like of (good deeds) 'Amir had done.\"",
      "chain": [
        "20164",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "hadith_no": "4258",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا حاتم، عن يزيد بن أبي عبيد، عن سلمة، رضى الله عنه قال كان علي  رضى الله عنه  تخلف عن النبي صلى الله عليه وسلم في خيبر، وكان رمدا فقال أنا أتخلف عن النبي صلى الله عليه وسلم فلحق، فلما بتنا الليلة التي فتحت قال ‏\"‏ لأعطين الراية غدا  أو ليأخذن الراية غدا  رجل يحبه الله ورسوله، يفتح عليه ‏\"‏‏.‏ فنحن نرجوها فقيل هذا علي، فأعطاه ففتح عليه‏.‏",
      "text_en": " Narrated Salama:                     `Ali remained behind the Prophet during the Ghazwa of Khaibar as he was suffering from eye trouble. He then said, \"(How can) I remain behind the Prophet ,\" and followed him. So when he slept on the night of the conquest of Khaibar, the Prophet said, \"I will give the flag tomorrow, or tomorrow the flag will be taken by a man who is loved by Allah and His Apostle , and (Khaibar) will be conquered through him, (with Allah's help)\" While every one of us was hopeful to have the flag, it was said, \"Here is `Ali\" and the Prophet gave him the flag and Khaibar was conquered through him (with Allah's Help).",
      "chain": [
        "20164",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "hadith_no": "4315",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، عن يزيد بن أبي عبيد، قال سمعت سلمة بن الأكوع، يقول غزوت مع النبي صلى الله عليه وسلم سبع غزوات، وخرجت فيما يبعث من البعوث تسع غزوات، مرة علينا أبو بكر، ومرة علينا أسامة‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     I fought in seven Ghazwat (i.e. battles) along with the Prophet and fought in nine battles, fought by armies dispatched by the Prophet. Once Abu Bakr was our commander and at another time, Usama was our commander. Narrated Salama in another narration: I fought seven Ghazwat (i.e. battles) along with the Prophet and also fought in nine battles, fought by armies sent by the Prophet . Once Abu Bakr was our commander and another time, Usama was (our commander).",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "hadith_no": "4880",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إبراهيم بن حمزة، حدثنا حاتم، عن معاوية، قال حدثني عمي أبو الحباب، سعيد بن يسار عن أبي هريرة، بهذا، ثم قال رسول الله صلى الله عليه وسلم اقرءوا إن شئتم ‏{‏فهل عسيتم‏}‏",
      "text_en": " Narrated Abu Huraira:                     (As above, No. 354, but added) Then Allah's Apostle said, \"Recite if you wish: \"Would you then.\" ..(47.22)",
      "chain": [
        "30101",
        "20159",
        "27"
      ]
    },
    {
      "hadith_no": "5732",
      "source": " Sahih Bukhari ",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا إبراهيم بن حمزة، حدثنا حاتم  هو ابن إسماعيل  عن الجعيد، قال سمعت السائب، يقول ذهبت بي خالتي إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن ابن أختي وجع فمسح رأسي ودعا لي بالبركة، ثم توضأ فشربت من وضوئه وقمت خلف ظهره فنظرت إلى خاتم النبوة بين كتفيه مثل زر الحجلة‏.‏",
      "text_en": " Narrated As-Sa'ib:                     My aunt took me to Allah's Apostle and said, \"O Allah's Apostle! My nephew is- ill.\" The Prophet touched my head with his hand and invoked Allah to bless me. He then performed ablution and I drank of the remaining water of his ablution and then stood behind his back and saw \"Khatam An- Nubuwwa\" (The Seal of Prophethood) between his shoulders like a button of a tent.",
      "chain": [
        "30101",
        "20159",
        "11679",
        "3048"
      ]
    },
    {
      "hadith_no": "6218",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم بن إسماعيل، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، قال خرجنا مع رسول الله صلى الله عليه وسلم إلى خيبر فسرنا ليلا، فقال رجل من القوم لعامر بن الأكوع ألا تسمعنا من هنيهاتك، قال وكان عامر رجلا شاعرا، فنزل يحدو بالقوم يقول اللهم لولا أنت ما اهتدينا ولا تصدقنا ولا صلينا فاغفر فداء لك ما اقتفينا وثبت الأقدام إن لاقينا وألقين سكينة علينا إنا إذا صيح بنا أتينا وبالصياح عولوا علينا فقال رسول الله صلى الله عليه وسلم ‏\"‏ من هذا السائق ‏\"‏‏.‏ قالوا عامر بن الأكوع‏.‏ فقال ‏\"‏ يرحمه الله ‏\"‏‏.‏ فقال رجل من القوم وجبت يا نبي الله، لو أمتعتنا به‏.‏ قال فأتينا خيبر فحاصرناهم حتى أصابتنا مخمصة شديدة، ثم إن الله فتحها عليهم، فلما أمسى الناس اليوم الذي فتحت عليهم أوقدوا نيرانا كثيرة‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما هذه النيران، على أى شىء توقدون ‏\"‏‏.‏ قالوا على لحم‏.‏ قال ‏\"‏ على أى لحم ‏\"‏‏.‏ قالوا على لحم حمر إنسية‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أهرقوها واكسروها ‏\"‏‏.‏ فقال رجل يا رسول الله أو نهريقها ونغسلها قال ‏\"‏ أو ذاك ‏\"‏‏.‏ فلما تصاف القوم كان سيف عامر فيه قصر، فتناول به يهوديا ليضربه، ويرجع ذباب سيفه فأصاب ركبة عامر فمات منه، فلما قفلوا قال سلمة رآني رسول الله صلى الله عليه وسلم شاحبا‏.‏ فقال لي ‏\"‏ ما لك ‏\"‏‏.‏ فقلت فدى لك أبي وأمي زعموا أن عامرا حبط عمله‏.‏ قال ‏\"‏ من قاله ‏\"‏‏.‏ قلت قاله فلان وفلان وفلان وأسيد بن الحضير الأنصاري‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ كذب من قاله، إن له لأجرين  وجمع بين إصبعيه  إنه لجاهد مجاهد، قل عربي نشأ بها مثله ‏\"‏‏.‏",
      "text_en": " Narrated Salama bin Al-Aqwa:                     We went out with Allah's Apostle to Khaibar and we travelled during the night. A man amongst the people said to 'Amir bin Al-Aqwa', \"Won't you let us hear your poetry?\" 'Amir was a poet, and so he got down and started (chanting Huda) reciting for the people, poetry that keep pace with the camel's foot steps, saying, \"O Allah! Without You we would not have been guided on the right path, neither would we have given in charity, nor would we have prayed. So please forgive us what we have committed. Let all of us be sacrificed for Your cause and when we meet our enemy, make our feet firm and bestow peace and calmness on us and if they (our enemy) will call us towards an unjust thing we will refuse. The infidels have made a hue and cry to ask others help against us. Allah's Apostle said, \"Who is that driver (of the camels)?\" They said, \"He is 'Amir bin Al-Aqwa.\"' He said, \"May Allah bestow His mercy on him.\" A man among the people said, Has Martyrdom been granted to him, O Allah's Prophet! Would that you let us enjoy his company longer.\" We reached (the people of) Khaibar and besieged them till we were stricken with severe hunger but Allah helped the Muslims conquer Khaibar. In the evening of its conquest the people made many fires. Allah's Apostle asked, \"What are those fires? For what are you making fires?\" They said, \"For cooking meat.\" He asked, \"What kind of meat?\" They said, \"Donkeys' meat.\" Allah's Apostle said, \"Throw away the meat and break the cooking pots.\" A man said, O Allah's Apostle! Shall we throw away the meat and wash the cooking pots?\" He said, \"You can do that too.\" When the army files aligned in rows (for the battle), 'Amir's sword was a short one, and while attacking a Jew with it in order to hit him, the sharp edge of the sword turned back and hit 'Amir's knee and caused him to die. When the Muslims returned (from the battle), Salama said, Allah's Apostle saw me pale and said, 'What is wrong with you?\"' I said, \"Let my parents be sacrificed for you! The people claim that all the deeds of Amir have been annulled.\" The Prophet asked, \"Who said so?\" I replied, \"So-and-so and soand- so and Usaid bin Al-Hudair Al-Ansari said, 'Whoever says so is telling a lie. Verily, 'Amir will have double reward.\"' (While speaking) the Prophet put two of his fingers together to indicate that, and added, \"He was really a hard-working man and a Mujahid (devout fighter in Allah's Cause) and rarely have there lived in it (i.e., Medina or the battle-field) an \"Arab like him.\"",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "hadith_no": "6426",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، عن الجعد بن عبد الرحمن، قال سمعت السائب بن يزيد، يقول ذهبت بي خالتي إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن ابن أختي وجع‏.‏ فمسح رأسي، ودعا لي بالبركة، ثم توضأ فشربت من وضوئه، ثم قمت خلف ظهره، فنظرت إلى خاتمه بين كتفيه مثل زر الحجلة‏.‏",
      "text_en": " Narrated As-Sa'ib bin Yazid:                     My aunt took me to Allah's Apostle and said, \"O Allah's Apostle! My sister's son is sick.\" So he passed his hand over my head and invoked for Allah's blessing upon me and then performed the ablution. I drank from the water of his ablution and I stood behind him and looked at his Khatam (the seal of Prophethood) between his shoulders (and its size was) like the button of a tent.",
      "chain": [
        "30367",
        "20159",
        "11679",
        "3048"
      ]
    },
    {
      "hadith_no": "7176",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، أنه دخل على الحجاج فقال يا ابن الأكوع ارتددت على عقبيك تعربت قال لا ولكن رسول الله صلى الله عليه وسلم أذن لي في البدو‏.‏ وعن يزيد بن أبي عبيد قال لما قتل عثمان بن عفان خرج سلمة بن الأكوع إلى الربذة، وتزوج هناك امرأة وولدت له أولادا، فلم يزل بها حتى قبل أن يموت بليال، فنزل المدينة‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     That he visited Al-Hajjaj (bin Yusuf). Al-Hajjaj said, \"O son of Al-Akwa`! You have turned on your heels (i.e., deserted Islam) by staying (in the desert) with the bedouins.\" Salama replied, \"No, but Allah's Apostle allowed me to stay with the bedouin in the desert.\" Narrated Yazid bin Abi Ubaid: When `Uthman bin `Affan was killed (martyred), Salama bin Al-Akwa` went out to a place called Ar- Rabadha and married there and begot children, and he stayed there till a few nights before his death when he came to Medina.",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "hadith_no": "7292",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا حاتم، عن يزيد، قال قلت لسلمة على أى شىء بايعتم النبي صلى الله عليه وسلم يوم الحديبية قال على الموت‏.‏",
      "text_en": " Narrated Yazid:                     I said to Salama, \"For what did you give the Pledge of allegiance to the Prophet on the Day of Hudaibiya?\" He replied, \"For death.\"",
      "chain": [
        "20164",
        "20159",
        "20472"
      ]
    },
    {
      "hadith_no": "480",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثناه قتيبة، عن حاتم بن إسماعيل، عن جعفر بن محمد، عن محمد بن المنكدر، عن عبد الله بن حنين، عن علي، ولم يذكر في السجود ‏.‏",
      "text_en": " This hadith is transmitted on the authority of 'Ali, but he made no mention of\" while in prostration\".",
      "chain": [
        "30367",
        "20159",
        "10898",
        "11048",
        "11181",
        "5"
      ]
    },
    {
      "hadith_no": "1274",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن عباد، حدثنا حاتم، - هو ابن إسماعيل - عن يعقوب بن مجاهد، عن ابن أبي عتيق، قال تحدثت أنا والقاسم، عند عائشة - رضى الله عنها - حديثا وكان القاسم رجلا لحانة وكان لأم ولد فقالت له عائشة ما لك لا تحدث كما يتحدث ابن أخي هذا أما إني قد علمت من أين أتيت ‏.‏ هذا أدبته أمه وأنت أدبتك أمك - قال - فغضب القاسم وأضب عليها فلما رأى مائدة عائشة قد أتي بها قام ‏.‏ قالت أين قال أصلي ‏.‏ قالت اجلس ‏.‏ قال إني أصلي ‏.‏ قالت اجلس غدر إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا صلاة بحضرة الطعام ولا وهو يدافعه الأخبثان ‏\"‏ ‏.‏",
      "text_en": " Ibn Atiq reported:                      Al-Qasim was in the presence of 'A'isha (Allah be pleased with her) that I narrated a hadith and Qasim was a man who committed errors in (pronouncing words) and his mother was a freed slave-girl. 'A'isha said to him: What is the matter with you that you do not narrate as this son of my brother narrated (the ahaditb)? Well I know from where you picked it up. This is how his mother brought him up and how your mother brought you up. Qasim felt angry (on this remark of Hadrat 'A'isha) and showed bitterness towards her. When he saw that the table had been spread for 'A'isha, he stood up, 'A'isha, said: Where are you going? He said: (I am going) to say prayer. She said: Sit down (to take the food). He said: I must say prayer. She said: Sit down, ) faithless, for I have heard the Messenger of Allah (may peace be upon him) say: No prayer can be (rightly said) when the food is there (before the worshipper), or when he is prompted by the call of nature.",
      "chain": [
        "30377",
        "20159"
      ]
    },
    {
      "hadith_no": "1472",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، - وهو ابن إسماعيل - عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، أن رسول الله صلى الله عليه وسلم كان يصلي المغرب إذا غربت الشمس وتوارت بالحجاب ‏.‏",
      "text_en": " Salama b. al-Akwa' reported that the Messenger of Allah (may peace be upon him) used to say the evening prayer when the sun had set and disappeared (behind the horizon).",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "hadith_no": "2064",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا قتيبة بن سعيد، وأبو بكر بن أبي شيبة قالا حدثنا حاتم بن إسماعيل، ح وحدثنا قتيبة، حدثنا عبد العزيز، - يعني الدراوردي - كلاهما عن جعفر، عن أبيه، عن عبيد الله بن أبي رافع، قال استخلف مروان أبا هريرة ‏.‏ بمثله غير أن في، رواية حاتم فقرأ بسورة الجمعة في السجدة الأولى وفي الآخرة ‏{‏ إذا جاءك المنافقون‏}‏ ورواية عبد العزيز مثل حديث سليمان بن بلال ‏.‏",
      "text_en": " This hadith is narrated by Abdullah b. Abu Rafi' with the same chain of transmitters but with this modification:                     \" That he recited Surah Jumu'a (lxii.) in the first rak'ah and\" The hypocrites came\" in the second rak'ah.",
      "chain": [
        "30367",
        "30201",
        "20159",
        "30367",
        "20167",
        "11407",
        "11199"
      ]
    },
    {
      "hadith_no": "2322",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا سليمان بن بلال، ح وحدثنا قتيبة، حدثنا حماد، بن زيد ح وحدثنا أبو بكر بن أبي شيبة، حدثنا حاتم بن إسماعيل، كلهم عن خثيم بن، عراك بن مالك عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏ بمثله ‏.‏",
      "text_en": " A hadith like this has been narrated by Abu Huraira through another chain of transmitters.",
      "chain": [
        "30399",
        "20160",
        "30367",
        "20022",
        "30201",
        "20159",
        "11504",
        "11204",
        "13"
      ]
    },
    {
      "hadith_no": "2334",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني عمرو الناقد، حدثنا حاتم بن إسماعيل، عن ابن عجلان، عن عياض، بن عبد الله بن أبي سرح عن أبي سعيد الخدري، أن معاوية، لما جعل نصف الصاع من الحنطة عدل صاع من تمر أنكر ذلك أبو سعيد وقال لا أخرج فيها إلا الذي كنت أخرج في عهد رسول الله صلى الله عليه وسلم صاعا من تمر أو صاعا من زبيب أو صاعا من شعير أو صاعا من أقط ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported that when Mu'awiya prescribed half a sa' of wheat equal to one sa' of dates, he (Abu Sa'id al-Khudri) objected to it, and said:                      I would take out (Sadaqat-ul-Fitr) but that which I used to bring forth during the lifetime of the Messenger of Allah (may peace be upon him) one sa' of dates, or one sa' of raisins, or one sa' of barley, or one sa' of cheese.",
      "chain": [
        "30263",
        "20159",
        "10616",
        "11260",
        "38"
      ]
    },
    {
      "hadith_no": "2416",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا حاتم، - يعني ابن إسماعيل - عن يزيد، - يعني ابن أبي عبيد - قال سمعت عميرا، مولى آبي اللحم قال أمرني مولاى أن أقدد، لحما فجاءني مسكين فأطعمته منه فعلم بذلك مولاى فضربني فأتيت رسول الله صلى الله عليه وسلم فذكرت ذلك له فدعاه ‏.‏ فقال ‏\"‏ لم ضربته ‏\"‏ ‏.‏ فقال يعطي طعامي بغير أن آمره ‏.‏ فقال ‏\"‏ الأجر بينكما ‏\"‏ ‏.‏",
      "text_en": " 'Umair, the freed slave of Abi'l-Lahm, said:                      My master commanded me to cut some meat in strips; (as I was doing it) a poor man came to me and I gave him some of it to eat. My master came to know of that, and he beat me. I came to the Messenger of Allah (may peace be upon him) and narrated it to him. He (the Holy Prophet) summoned him and said: Why did you beat him? He (Abi'l-Lahm) said: He gives away my food without being commanded to do so. Upon this he (the Holy Prophet) sbid: The reward would be shared by you two.",
      "chain": [
        "30367",
        "20159",
        "11450"
      ]
    },
    {
      "hadith_no": "2724",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، - يعني ابن إسماعيل - عن يزيد بن أبي، عبيد عن سلمة بن الأكوع، - رضى الله عنه - أنه قال بعث رسول الله صلى الله عليه وسلم رجلا من أسلم يوم عاشوراء فأمره أن يؤذن في الناس ‏\"‏ من كان لم يصم فليصم ومن كان أكل فليتم صيامه إلى الليل ‏\"‏ ‏.‏",
      "text_en": " Salama b. al-Akwa' (Allah be pleased with him) reported that the Messenger of Allah (may peace be upon him) sent a person of the tribe of Aslam on the day of 'Ashura and commanded him to declare to the people to observe fast in case they had not observed it, and to complete fast till evening if they had taken food",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "hadith_no": "2837",
      "source": " Sahih Muslim ",
      "chapter": "The Book of I'tikaf - كتاب الاعتكاف",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن مهران الرازي، حدثنا حاتم بن إسماعيل، عن موسى بن عقبة، عن نافع، عن ابن عمر، رضى الله عنهما أن النبي صلى الله عليه وسلم كان يعتكف في العشر الأواخر من رمضان ‏.‏",
      "text_en": " Ibn 'Umar (Allah be pleased with both of them) reported that the Apostle of Allah (may peace be upon him) used to observe i'tikaf in the last ten days of Ramadan.",
      "chain": [
        "30383",
        "20159",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2869",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن عباد، حدثنا حاتم، - يعني ابن إسماعيل - عن موسى بن عقبة، عن سالم بن عبد الله بن عمر، ونافع، مولى عبد الله وحمزة بن عبد الله عن عبد الله، بن عمر - رضى الله عنهما - أن رسول الله صلى الله عليه وسلم كان إذا استوت به راحلته قائمة عند مسجد ذي الحليفة أهل فقال ‏\"‏ لبيك اللهم لبيك لبيك لا شريك لك لبيك إن الحمد والنعمة لك والملك لا شريك لك ‏\"‏ ‏.‏ قالوا وكان عبد الله بن عمر - رضى الله عنهما - يقول هذه تلبية رسول الله صلى الله عليه وسلم ‏.‏ قال نافع كان عبد الله - رضى الله عنه - يزيد مع هذا لبيك لبيك وسعديك والخير بيديك لبيك والرغباء إليك والعمل ‏.‏",
      "text_en": " 'Abdullah b. 'Umar (Allah be pleased with them) reported that the Mes- senger of Allah (may peace be upon him) entered upon the state of Ihram near the mosque at Dhu'l-Hulaifa as his camel stood by it and he said:                      Here I am at Thy service, O Lord; here I am at Thy service: here I am at Thy service. There is no associate with Thee. Here I am at Thy service. All praise and grace is due to Thee and the sovereignty (too). There is no associate with Thee. They (the people) said that 'Abdullah b. 'Umar said that that was the Talbiya of the Messenger of Allah (may peace be upon him). Nafi' said: 'Abdullah (Allah be pleased with him) made this addition to it: Here I am at Thy service; here I am at Thy service; ready to obey Thee. The Good is in Thy Hand. Here I am at Thy service. Unto Thee is the petition and deed (is also for Thee).",
      "chain": [
        "30377",
        "20159",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "2874",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه قتيبة بن سعيد، حدثنا حاتم، - يعني ابن إسماعيل - عن موسى بن، عقبة عن سالم، قال كان ابن عمر - رضى الله عنهما - إذا قيل له الإحرام من البيداء قال البيداء التي تكذبون فيها على رسول الله صلى الله عليه وسلم ما أهل رسول الله صلى الله عليه وسلم إلا من عند الشجرة حين قام به بعيره ‏.‏",
      "text_en": " Salim reported that when it was said to Ibn 'Umar (Allah be pleased with them) that the state of Ihram (commences from) al-Baida' he said:                      Al-Baida', you attribute lie about it to the Messenger of Allah (may peace be upon him). And the Messenger of Allah (mav peace be upon him) did not enter upon the state of Ihram but near the-tree when his camel stood up with him.",
      "chain": [
        "30367",
        "20159",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "3009",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، جميعا عن حاتم، - قال أبو بكر حدثنا حاتم بن إسماعيل المدني، - عن جعفر بن محمد، عن أبيه، قال دخلنا على جابر بن عبد الله فسأل عن القوم، حتى انتهى إلى فقلت أنا محمد بن علي بن حسين، ‏.‏ فأهوى بيده إلى رأسي فنزع زري الأعلى ثم نزع زري الأسفل ثم وضع كفه بين ثديى وأنا يومئذ غلام شاب فقال مرحبا بك يا ابن أخي سل عما شئت ‏.‏ فسألته وهو أعمى وحضر وقت الصلاة فقام في نساجة ملتحفا بها كلما وضعها على منكبه رجع طرفاها إليه من صغرها ورداؤه إلى جنبه على المشجب فصلى بنا فقلت أخبرني عن حجة رسول الله صلى الله عليه وسلم ‏.‏ فقال بيده فعقد تسعا فقال إن رسول الله صلى الله عليه وسلم مكث تسع سنين لم يحج ثم أذن في الناس في العاشرة أن رسول الله صلى الله عليه وسلم حاج فقدم المدينة بشر كثير كلهم يلتمس أن يأتم برسول الله صلى الله عليه وسلم ويعمل مثل عمله فخرجنا معه حتى أتينا ذا الحليفة فولدت أسماء بنت عميس محمد بن أبي بكر فأرسلت إلى رسول الله صلى الله عليه وسلم كيف أصنع قال ‏\"‏ اغتسلي واستثفري بثوب وأحرمي ‏\"‏ ‏.‏ فصلى رسول الله صلى الله عليه وسلم في المسجد ثم ركب القصواء حتى إذا استوت به ناقته على البيداء نظرت إلى مد بصري بين يديه من راكب وماش وعن يمينه مثل ذلك وعن يساره مثل ذلك ومن خلفه مثل ذلك ورسول الله صلى الله عليه وسلم بين أظهرنا وعليه ينزل القرآن وهو يعرف تأويله وما عمل به من شىء عملنا به فأهل بالتوحيد ‏\"‏ لبيك اللهم لبيك لبيك لا شريك لك لبيك إن الحمد والنعمة لك والملك لا شريك لك ‏\"‏ ‏.‏ وأهل الناس بهذا الذي يهلون به فلم يرد رسول الله صلى الله عليه وسلم عليهم شيئا منه ولزم رسول الله صلى الله عليه وسلم تلبيته قال جابر - رضى الله عنه - لسنا ننوي إلا الحج لسنا نعرف العمرة حتى إذا أتينا البيت معه استلم الركن فرمل ثلاثا ومشى أربعا ثم نفذ إلى مقام إبراهيم - عليه السلام - فقرأ ‏{‏ واتخذوا من مقام إبراهيم مصلى‏}‏ فجعل المقام بينه وبين البيت فكان أبي يقول ولا أعلمه ذكره إلا عن النبي صلى الله عليه وسلم كان يقرأ في الركعتين ‏{‏ قل هو الله أحد‏}‏ و ‏{‏ قل يا أيها الكافرون‏}‏ ثم رجع إلى الركن فاستلمه ثم خرج من الباب إلى الصفا فلما دنا من الصفا قرأ ‏{‏ إن الصفا والمروة من شعائر الله‏}‏ ‏\"‏ أبدأ بما بدأ الله به ‏\"‏ ‏.‏ فبدأ بالصفا فرقي عليه حتى رأى البيت فاستقبل القبلة فوحد الله وكبره وقال ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير لا إله إلا الله وحده أنجز وعده ونصر عبده وهزم الأحزاب وحده ‏\"‏ ‏.‏ ثم دعا بين ذلك قال مثل هذا ثلاث مرات ثم نزل إلى المروة حتى إذا انصبت قدماه في بطن الوادي سعى حتى إذا صعدتا مشى حتى أتى المروة ففعل على المروة كما فعل على الصفا حتى إذا كان آخر طوافه على المروة فقال ‏\"‏ لو أني استقبلت من أمري ما استدبرت لم أسق الهدى وجعلتها عمرة فمن كان منكم ليس معه هدى فليحل وليجعلها عمرة ‏\"‏ ‏.‏ فقام سراقة بن مالك بن جعشم فقال يا رسول الله ألعامنا هذا أم لأبد فشبك رسول الله صلى الله عليه وسلم أصابعه واحدة في الأخرى وقال ‏\"‏ دخلت العمرة في الحج - مرتين - لا بل لأبد أبد ‏\"‏ ‏.‏ وقدم علي من اليمن ببدن النبي صلى الله عليه وسلم فوجد فاطمة - رضى الله عنها - ممن حل ولبست ثيابا صبيغا واكتحلت فأنكر ذلك عليها فقالت إن أبي أمرني بهذا ‏.‏ قال فكان علي يقول بالعراق فذهبت إلى رسول الله صلى الله عليه وسلم محرشا على فاطمة للذي صنعت مستفتيا لرسول الله صلى الله عليه وسلم فيما ذكرت عنه فأخبرته أني أنكرت ذلك عليها فقال ‏\"‏ صدقت صدقت ماذا قلت حين فرضت الحج ‏\"‏ ‏.‏ قال قلت اللهم إني أهل بما أهل به رسولك ‏.‏ قال ‏\"‏ فإن معي الهدى فلا تحل ‏\"‏ ‏.‏ قال فكان جماعة الهدى الذي قدم به علي من اليمن والذي أتى به النبي صلى الله عليه وسلم مائة - قال - فحل الناس كلهم وقصروا إلا النبي صلى الله عليه وسلم ومن كان معه هدى فلما كان يوم التروية توجهوا إلى منى فأهلوا بالحج وركب رسول الله صلى الله عليه وسلم فصلى بها الظهر والعصر والمغرب والعشاء والفجر ثم مكث قليلا حتى طلعت الشمس وأمر بقبة من شعر تضرب له بنمرة فسار رسول الله صلى الله عليه وسلم ولا تشك قريش إلا أنه واقف عند المشعر الحرام كما كانت قريش تصنع في الجاهلية فأجاز رسول الله صلى الله عليه وسلم حتى أتى عرفة فوجد القبة قد ضربت له بنمرة فنزل بها حتى إذا زاغت الشمس أمر بالقصواء فرحلت له فأتى بطن الوادي فخطب الناس وقال ‏\"‏ إن دماءكم وأموالكم حرام عليكم كحرمة يومكم هذا في شهركم هذا في بلدكم هذا ألا كل شىء من أمر الجاهلية تحت قدمى موضوع ودماء الجاهلية موضوعة وإن أول دم أضع من دمائنا دم ابن ربيعة بن الحارث كان مسترضعا في بني سعد فقتلته هذيل وربا الجاهلية موضوع وأول ربا أضع ربانا ربا عباس بن عبد المطلب فإنه موضوع كله فاتقوا الله في النساء فإنكم أخذتموهن بأمان الله واستحللتم فروجهن بكلمة الله ولكم عليهن أن لا يوطئن فرشكم أحدا تكرهونه ‏.‏ فإن فعلن ذلك فاضربوهن ضربا غير مبرح ولهن عليكم رزقهن وكسوتهن بالمعروف وقد تركت فيكم ما لن تضلوا بعده إن اعتصمتم به كتاب الله ‏.‏ وأنتم تسألون عني فما أنتم قائلون ‏\"‏ ‏.‏ قالوا نشهد أنك قد بلغت وأديت ونصحت ‏.‏ فقال بإصبعه السبابة يرفعها إلى السماء وينكتها إلى الناس ‏\"‏ اللهم اشهد اللهم اشهد ‏\"‏ ‏.‏ ثلاث مرات ثم أذن ثم أقام فصلى الظهر ثم أقام فصلى العصر ولم يصل بينهما شيئا ثم ركب رسول الله صلى الله عليه وسلم حتى أتى الموقف فجعل بطن ناقته القصواء إلى الصخرات وجعل حبل المشاة بين يديه واستقبل القبلة فلم يزل واقفا حتى غربت الشمس وذهبت الصفرة قليلا حتى غاب القرص وأردف أسامة خلفه ودفع رسول الله صلى الله عليه وسلم وقد شنق للقصواء الزمام حتى إن رأسها ليصيب مورك رحله ويقول بيده اليمنى ‏\"‏ أيها الناس السكينة السكينة ‏\"‏ ‏.‏ كلما أتى حبلا من الحبال أرخى لها قليلا حتى تصعد حتى أتى المزدلفة فصلى بها المغرب والعشاء بأذان واحد وإقامتين ولم يسبح بينهما شيئا ثم اضطجع رسول الله صلى الله عليه وسلم حتى طلع الفجر وصلى الفجر - حين تبين له الصبح - بأذان وإقامة ثم ركب القصواء حتى أتى المشعر الحرام فاستقبل القبلة فدعاه وكبره وهلله ووحده فلم يزل واقفا حتى أسفر جدا فدفع قبل أن تطلع الشمس وأردف الفضل بن عباس وكان رجلا حسن الشعر أبيض وسيما فلما دفع رسول الله صلى الله عليه وسلم مرت به ظعن يجرين فطفق الفضل ينظر إليهن فوضع رسول الله صلى الله عليه وسلم يده على وجه الفضل فحول الفضل وجهه إلى الشق الآخر ينظر فحول رسول الله صلى الله عليه وسلم يده من الشق الآخر على وجه الفضل يصرف وجهه من الشق الآخر ينظر حتى أتى بطن محسر فحرك قليلا ثم سلك الطريق الوسطى التي تخرج على الجمرة الكبرى حتى أتى الجمرة التي عند الشجرة فرماها بسبع حصيات يكبر مع كل حصاة منها مثل حصى الخذف رمى من بطن الوادي ثم انصرف إلى المنحر فنحر ثلاثا وستين بيده ثم أعطى عليا فنحر ما غبر وأشركه في هديه ثم أمر من كل بدنة ببضعة فجعلت في قدر فطبخت فأكلا من لحمها وشربا من مرقها ثم ركب رسول الله صلى الله عليه وسلم فأفاض إلى البيت فصلى بمكة الظهر فأتى بني عبد المطلب يسقون على زمزم فقال ‏\"‏ انزعوا بني عبد المطلب فلولا أن يغلبكم الناس على سقايتكم لنزعت معكم ‏\"‏ ‏.‏ فناولوه دلوا فشرب منه ‏.‏",
      "text_en": " Ja'far b Muhammad reported on the authority of his father:                      We went to Jabir b. Abdullah and he began inquiring about the people (who had gone to see him) till it was my turn. I said: I am Muhammad b. 'Ali b. Husain. He placed his hand upon my head and opened my upper button and then the lower one and then placed his palm on my chest (in order to bless me), and I was, during those days, a young boy, and he said: You are welcome, my nephew. Ask whatever you want to ask. And I asked him but as he was blind (he could not respond to me immediately), and the time for prayer came. He stood up covering himself in his mantle. And whenever he placed its ends upon his shoulders they slipped down on account of being short (in size). Another mantle was, however, lying on the clothes rack near by. And he led us in the prayer. I said to him: Tell me about the Hajj of Allah's Messenger (May peace be upon him). And he pointed with his hand nine, and then stated: The Messenger of Allah (may peace be upon him) stayed in (Medina) for nine years but did not perform Hajj, then he made a public announcement in the tenth year to the effect that Allah's Messenger (may peace be upon him) was about to perform the Hajj. A large number of persons came to Medina and all of them were anxious to follow the Messenger of Allah (May peace be upon him) and do according to his doing. We set out with him till we reached Dhu'l-Hulaifa. Asma' daughter of Umais gave birth to Muhammad b. Abu Bakr. She sent message to the Messenger of Allah (May peace be upon him) asking him: What should 1 do? He (the Holy Prophet) said: Take a bath, bandage your private parts and put on Ihram. The Messenger of Allah (May peace be upon him) then prayed in the mosque and then mounted al-Qaswa (his she-camel) and it stood erect with him on its back at al-Baida'. And I saw as far as I could see in front of me but riders and pedestrians, and also on my right and on my left and behind me like this. And the Messenger of Allah (may peace be upon him) was prominent among us and the (revelation) of the Holy Qur'an was descending upon him. And it is he who knows (its true) significance. And whatever he did, we also did that. He pronounced the Oneness of Allah (saying):\" Labbaik,0 Allah, Labbaik, Labbaik. Thou hast no partner, praise and grace is Thine and the Sovereignty too; Thou hast no partner.\" And the people also pronounced this Talbiya which they pronounce (today). The Messenger of Allah (May peace be upon him) did not reject anything out of it. But the Messenger of Allah (May peace. be upon him) adhered to his own Talbiya. Jabir (Allah be pleased with him) said: We did not have any other intention but that of Hajj only, being unaware of the Umra (at that season), but when we came with him to the House, he touched the pillar and (made seven circuits) running three of them and walking four. And then going to the Station of Ibrahim, he recited:\" And adopt the Station of Ibrahim as a place of prayer.\" And this Station was between him and the House. My father said (and I do not know whether he had made a mention of it but that was from Allah's Apostle [May peace be upon him] that he recited in two rak'ahs:\" say: He is Allah One,\" and say:\" Say: 0 unbelievers.\" He then returned to the pillar (Hajar Aswad) and kissed it. He then went out of the gate to al-Safa' and as he reached near it he recited:\" Al-Safa' and al-Marwa are among the signs appointed by Allah,\" (adding: ) I begin with what Allah (has commanded me) to begin. He first mounted al-Safa' till he saw the House, and facing Qibla he declared the Oneness of Allah and glorified Him, and said:\" There is no god but Allah, One, there is no partner with Him. His is the Sovereignty. to Him praise is due. and He is Powerful over everything. There is no god but Allah alone, Who fulfilled His promise, helped His servant and routed the confederates alone.\" He then made supplication in the course of that saying such words three times. He then descended and walked towards al-Marwa, and when his feet came down in the bottom of the valley, he ran, and when he began to ascend he walked till he reached al-Marwa. There he did as he had done at al-Safa'. And when it was his last running at al-Marwa he said: If I had known beforehand what I have come to know afterwards, I would not have brought sacrificial animals and would have performed an 'Umra. So, he who among you has not the sacrificial animals with him should put off Ihram and treat it as an Umra. Suraqa b. Malik b. Ju'sham got up and said: Messenger of Allah, does it apply to the present year, or does it apply forever? Thereupon the Messenger of Allah (May peace be upon him) intertwined the fingers (of one hand) into another and said twice: The 'Umra has become incorporated in the Hajj (adding):\" No, but for ever and ever.\" 'All came from the Yemen with the sacrificial animals for the Prophet (May peace be upon him) and found Fatimah (Allah be pleased with her) to be one among those who had put off Ihram and had put on dyed clothes and had applied antimony. He (Hadrat'Ali) showed disapproval to it, whereupon she said: My father has commanded me to do this. He (the narrator) said that 'Ali used to say in Iraq: I went to the Messenger of Allah (may peace be upon him) showing annoyance at Fatimah for what she had done, and asked the (verdict) of Allah's Messenger (may peace be upon him) regarding what she had narrated from him, and told him that I was angry with her, whereupon he said: She has told the truth, she has told the truth. (The Holy Prophet then asked 'Ali): What did you say when you undertook to go for Hajj? I ('Ali) said: 0 Allah, I am putting on Ihram for the same purpose as Thy Messenger has put it on. He said: I have with me sacrificial animals, so do not put off the Ihram. He (Jabir) said: The total number of those sacrificial animals brought by 'Ali from the Yemen and of those brought by the Apostle (may peace be upon him) was one hundred. Then all the people except the Apostle (may peace be upon him) and those who had with them sacrificial animals, put off Ihram, and got their hair clipped; when it was the day of Tarwiya (8th of Dhu'l-Hijja) they went to Mina and put on the Ihram for Hajj and the Messenger of Ailah (may peace be upon him) rode and led the noon, afternoon, sunset 'Isha' and dawn prayers. He then waited a little till the sun rose, and commanded that a tent of hair should be pitched at Namira. The Messenger of Allah (may peace be upon him) then set out and the Quraish did not doubt that he would halt at al-Mash'ar al-Haram (the sacred site) as the Quraish used to do in the pre-Islamic period. The Messenger of Allah (may peace be upon him), however, passed on till he came to 'Arafa and he found that the tent had been pitched for him at Namira. There he got down till the sun had passed the meridian; he commanded that al-Qaswa should be brought and saddled for him. Then he came to the bottom of the valley, and addressed the people saying: Verily your blood, your property are as sacred and inviolable as the sacredness of this day of yours, in this month of yours, in this town of yours. Behold! Everything pertaining to the Days of Ignorance is under my feet completely abolished. Abolished are also the blood-revenges of the Days of Ignorance. The first claim of ours on blood-revenge which I abolish is that of the son of Rabi'a b. al-Harith, who was nursed among the tribe of Sa'd and killed by Hudhail. And the usury of she pre-Islamic period is abolished, and the first of our usury I abolish is that of 'Abbas b. 'Abd al-Muttalib, for it is all abolished. Fear Allah concerning women! Verily you have taken them on the security of Allah, and intercourse with them has been made lawful unto you by words of Allah. You too have right over them, and that they should not allow anyone to sit on your bed whom you do not like. But if they do that, you can chastise them but not severely. Their rights upon you are that you should provide them with food and clothing in a fitting manner. I have left among you the Book of Allah, and if you hold fast to it, you would never go astray. And you would be asked about me (on the Day of Resurrection), (now tell me) what would you say? They (the audience) said: We will bear witness that you have conveyed (the message), discharged (the ministry of Prophethood) and given wise (sincere) counsel. He (the narrator) said: He (the Holy Prophet) then raised his forefinger towards the sky and pointing it at the people (said):\" O Allah, be witness. 0 Allah, be witness,\" saying it thrice. (Bilal then) pronounced Adhan and later on Iqama and he (the Holy Prophet) led the noon prayer. He (Bilal) then uttered Iqama and he (the Holy Prophet) led the afternoon prayer and he observed no other prayer in between the two. The Messenger of Allah (may peace be upon him) then mounted his camel and came to the place of stay, making his she-camel al-Qaswa, turn towards the side where there we are rocks, having the path taken by those who went on foot in front of him, and faced the Qibla. He kept standing there till the sun set, and the yellow light had somewhat gone, and the disc of the sun had disappeared. He made Usama sit behind him, and he pulled the nosestring of Qaswa so forcefully that its head touched the saddle (in order to keep her under perfect control), and he pointed out to the people with his right hand to be moderate (in speed), and whenever he happened to pass over an elevated tract of sand, he slightly loosened it (the nose-string of his camel) till she climbed up and this is how he reached al-Muzdalifa. There he led the evening and 'Isha prayers with one Adhan and two Iqamas and did not glorify (Allah) in between them (i. e. he did not observe supererogatory rak'ahs between Maghrib and 'Isha' prayers). The Messenger of Allah (may peace be upon him) then lay down till dawn and offered the dawn prayer with an Adhan and Iqama when the morning light was clear. He again mounted al-Qaswa, and when he came to al-Mash'ar al-Haram, he faced towards Qibla, supplicated Him, Glorified Him, and pronounced His Uniqueness (La ilaha illa Allah) and Oneness, and kept standing till the daylight was very clear. He then went quickly before the sun rose, and seated behind him was al-Fadl b. 'Abbas and he was a man having beautiful hair and fair complexion and handsome face. As the Messenger of Allah (May peace be upon him) was moving on, there was also going a group of women (side by side with them). Al-Fadl began to look at them. The Messenger of Allah (may peace be upon him) placed his hand on the face of Fadl who then turned his face to the other side, and began to see, and the Messenger of Allah (may peace be upon him) turned his hand to the other side and placed it on the face of al-Fadl. He again turned his face to the other side till he came to the bottom of Muhassir. 1680 He urged her (al-Qaswa) a little, and, following the middle road, which comes out at the greatest jamra, he came to the jamra which is near the tree. At this be threw seven small pebbles, saying Allah-o-Akbar while throwing every one of them in a manner in which the small pebbles are thrown (with the help of fingers) and this he did in the bottom of the valley. He then went to the place of sacrifice, and sacrificed sixty-three (camels) with his own hand. Then he gave the remaining number to 'All who sacrificed them, and he shared him in his sacrifice. He then commanded that a piece of flesh from each animal sacrificed should be put in a pot, and when it was cooked, both of them (the Holy Prophet and Hadrat 'All) took some meat out of it and drank its soup. The Messenger of Allah (May peace be upon him) again rode and came to the House, and offered the Zuhr prayer at Mecca. He came to the tribe of Abd al-Muttalib, who were supplying water at Zamzam, and said: Draw water. O Bani 'Abd al-Muttalib; were it not that people would usurp this right of supplying water from you, I would have drawn it along with you. So they handed him a basket and he drank from it.",
      "chain": [
        "30201",
        "30123",
        "20159",
        "20436",
        "20159",
        "10898",
        "11442"
      ]
    },
    {
      "hadith_no": "3108",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن عباد، حدثنا حاتم، - يعني ابن إسماعيل - عن موسى بن، عقبة عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم كان إذا طاف في الحج والعمرة أول ما يقدم فإنه يسعى ثلاثة أطواف بالبيت ثم يمشي أربعة ثم يصلي سجدتين ثم يطوف بين الصفا والمروة ‏.‏",
      "text_en": " Ibn'Umar (Allah be pleased with them) reported that when Allah's messenger (may peace be upon him) circumambulated in Hajj and Umra he walked swiftly in the first three circuit about the House, and then walked in four circuits, and then observed two rak'ahs of prayer, and then ran between al-Safa and al-Marwa.",
      "chain": [
        "30377",
        "20159",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3211",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا يعقوب، وهو ابن عبد الرحمن القاري ح وحدثنا قتيبة، حدثنا حاتم، - يعني ابن إسماعيل - كلاهما عن موسى بن عقبة، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم حلق رأسه في حجة الوداع ‏.‏",
      "text_en": " Ibn Umar reported that Allah's Messenger (may peace be upon him) got his head shaved on the occasion of the Farewell Pilgrimage.",
      "chain": [
        "30367",
        "20184",
        "28446",
        "30367",
        "20159",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3350",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن عباد، حدثنا حاتم، - وهو ابن إسماعيل - عن موسى، - وهو ابن عقبة - عن سالم، عن أبيه، أن رسول الله صلى الله عليه وسلم أتي في معرسه بذي الحليفة فقيل له إنك ببطحاء مباركة ‏.‏",
      "text_en": " Salim (b. Abdullah b. 'Umar) reported on the authority of his father (Allah be pleased with them) that Allah's Apostle (may peace be upon him) was visited by (someone, i. e. an angel) during the fag end of the night at Dhu'l-Hulaifa, and it was said to him:                      Verily it is a blessed stony-ground.",
      "chain": [
        "30377",
        "20159",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "3427",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، - يعني ابن إسماعيل - عن عمر بن نبيه، أخبرني دينار القراظ، قال سمعت سعد بن أبي وقاص، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من أراد أهل المدينة بسوء أذابه الله كما يذوب الملح في الماء ‏\"‏ ‏.‏",
      "text_en": " Sa'd b. Abu Waqqas reported Allah's Messenger (may peace be upon him) as saying:                      He who intends to do harm to the people of Medina, Allah would efface him just as water dissolves salt.",
      "chain": [
        "30367",
        "20159",
        "9"
      ]
    },
    {
      "hadith_no": "3454",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وسعيد بن عمرو الأشعثي، قال سعيد أخبرنا وقال أبو بكر، حدثنا حاتم بن إسماعيل، عن حميد، عن أبي سلمة، عن أبي سعيد، عن النبي صلى الله عليه وسلم بمثله ولم يذكر عبد الرحمن بن أبي سعيد في الإسناد ‏.‏",
      "text_en": " Abu Sa'id reported from Allah's Apostle (may peace be upon him) a hadlth like this, but in the chain of transmitters no mention was made of Abd al- Rahman b. Abu Sa'id.",
      "chain": [
        "30201",
        "30465",
        "11168",
        "20436",
        "20159",
        "11279",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "4207",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، حدثنا حاتم بن إسماعيل، عن محمد بن عجلان، عن محمد بن عمرو بن عطاء، عن سعيد بن المسيب، عن معمر بن عبد الله، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يحتكر إلا خاطئ ‏\"‏ ‏.‏",
      "text_en": " Ma'mar b. Abdullah reported Allah's Messenger (may peace be upon him) as saying:                      No one hoards but the sinner.",
      "chain": [
        "30465",
        "20159",
        "10616",
        "11220",
        "11002"
      ]
    },
    {
      "hadith_no": "4769",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا قتيبة بن سعيد، ومحمد بن عباد، - واللفظ لابن عباد - قالا حدثنا حاتم، - وهو ابن إسماعيل - عن يزيد بن أبي عبيد، مولى سلمة بن الأكوع عن سلمة بن الأكوع، قال خرجنا مع رسول الله صلى الله عليه وسلم إلى خيبر فتسيرنا ليلا فقال رجل من القوم لعامر بن الأكوع ألا تسمعنا من هنيهاتك وكان عامر رجلا شاعرا فنزل يحدو بالقوم يقول اللهم لولا أنت ما اهتدينا ولا تصدقنا ولا صلينا فاغفر فداء لك ما اقتفينا وثبت الأقدام إن لاقينا وألقين سكينة علينا إنا إذا صيح بنا أتينا وبالصياح عولوا علينا فقال رسول الله صلى الله عليه وسلم ‏\"‏ من هذا السائق ‏\"‏ ‏.‏ قالوا عامر ‏.‏ قال ‏\"‏ يرحمه الله ‏\"‏ ‏.‏ فقال رجل من القوم وجبت يا رسول الله لولا أمتعتنا به ‏.‏ قال فأتينا خيبر فحصرناهم حتى أصابتنا مخمصة شديدة ثم قال ‏\"‏ إن الله فتحها عليكم ‏\"‏ ‏.‏ قال فلما أمسى الناس مساء اليوم الذي فتحت عليهم أوقدوا نيرانا كثيرة فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما هذه النيران على أى شىء توقدون ‏\"‏ ‏.‏ فقالوا على لحم ‏.‏ قال ‏\"‏ أى لحم ‏\"‏ ‏.‏ قالوا لحم حمر الإنسية ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أهريقوها واكسروها ‏\"‏ ‏.‏ فقال رجل أو يهريقوها ويغسلوها فقال ‏\"‏ أو ذاك ‏\"‏ ‏.‏ قال فلما تصاف القوم كان سيف عامر فيه قصر فتناول به ساق يهودي ليضربه ويرجع ذباب سيفه فأصاب ركبة عامر فمات منه قال فلما قفلوا قال سلمة وهو آخذ بيدي قال فلما رآني رسول الله صلى الله عليه وسلم ساكتا قال ‏\"‏ ما لك ‏\"‏ ‏.‏ قلت له فداك أبي وأمي زعموا أن عامرا حبط عمله قال ‏\"‏ من قاله ‏\"‏ ‏.‏ قلت فلان وفلان وأسيد بن حضير الأنصاري فقال ‏\"‏ كذب من قاله إن له لأجرين ‏\"‏ ‏.‏ وجمع بين إصبعيه ‏\"‏ إنه لجاهد مجاهد قل عربي مشى بها مثله ‏\"‏ ‏.‏ وخالف قتيبة محمدا في الحديث في حرفين وفي رواية ابن عباد وألق سكينة علينا ‏.‏",
      "text_en": " It has been narrated on the authority of Salama b. al-Akwa' who said:                      We marched upon Khaibar with the Messenger of Allah (may peace be upon him). We journeyed during the night. One of the people said to (my brother) 'Amir b. al-Akwa': Won't you recite to us some of your verses? Amir was a poet. So he began to chant his verses to urge the camels, reciting: O God, if Thou hadst not guided us We would have neither been guided rightly nor practised charity, Nor offered prayers. We wish to lay down our lives for Thee; so forgive Thou our lapses, And keep us steadfast when we encounter (our enemies). Bestow upon us peace and tranquillity. Behold, when with a cry they called upon us to help. The Messenger of Allah (may peace be upon him) said: Who is this driver (of the camels)? They said: It is 'Amir. He said: God will show mercy to him. A man said: Martyrdom is reserved for him. Messenger of Allah, would that you had allowed us to benefit ourselves from his life. (The narrator says): We reached Khaibar and besieged them, and (we continued the siege) until extreme hunger afflicted us. Then the Messenger of Allah (may peace be upon him) said: Behold, God has conquered it for you. When it was evening of the day on which the city was conquered. the Muslims lit many fires. The Messenger of Allah (may peace be upon him) said: What are these fires? And what are they cooking? They said: They are cooking meat. He asked. Which meat? They said: That of domestic asses. He said: Let them throw it away and break the pots (in which it is being cooked). A man said: Or should they throw it away and wash the pots? He said: They may do that. When the people drew themselves up in battle array 'Amir caught hold of his sword that was rather short He drove a Jew before him to strike him with it. (As he struck him), his sword recoiled and struck his own knee, and 'Amir died of the wound. When the people returned (after the conquest of Kliaibar) and he (Salama) had caught hold of my hand, and said: The Messenger of Allah (may peace be upon him) saw that I was silent (and dejected) ; he said: What's the matter with thee? I said to him: My father and my mother be thy ransom, people presume that 'Amir's sacrifice has been in vain. He asked: Who has said that? I said: So and so and Usaid b. Hudair al-Ansari. He said: Who has said that has lied. For him (for 'Amir) there is a double reward. (He indicated this by putting two of his fingers together.) He was a devotee of God and a warrior fighting for His cause. There will be hardly any Arab who can fight as bravely as he did. Qutaiba has differed in a few words.",
      "chain": [
        "30367",
        "30377",
        "20159",
        "237"
      ]
    },
    {
      "hadith_no": "4778",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، - يعني ابن إسماعيل - عن يزيد بن أبي، عبيد قال سمعت سلمة بن الأكوع، يقول خرجت قبل أن يؤذن، بالأولى وكانت لقاح رسول الله صلى الله عليه وسلم ترعى بذي قرد - قال - فلقيني غلام لعبد الرحمن بن عوف فقال أخذت لقاح رسول الله صلى الله عليه وسلم فقلت من أخذها قال غطفان قال فصرخت ثلاث صرخات يا صباحاه ‏.‏ قال فأسمعت ما بين لابتى المدينة ثم اندفعت على وجهي حتى أدركتهم بذي قرد وقد أخذوا يسقون من الماء فجعلت أرميهم بنبلي وكنت راميا وأقول أنا ابن الأكوع واليوم يوم الرضع فأرتجز حتى استنقذت اللقاح منهم واستلبت منهم ثلاثين بردة - قال - وجاء النبي صلى الله عليه وسلم والناس فقلت يا نبي الله إني قد حميت القوم الماء وهم عطاش فابعث إليهم الساعة فقال ‏\"‏ يا ابن الأكوع ملكت فأسجح ‏\"‏ ‏.‏ - قال - ثم رجعنا ويردفني رسول الله صلى الله عليه وسلم على ناقته حتى دخلنا المدينة ‏.‏",
      "text_en": " It has been narrated on the authority of Yazid b. Abu 'Ubaid who said that he heard Salama b. al-Akwa' say:                      I went out before the Adhan for the morning prayer had been delivered. The milch she-camels of the Messenger of Allah (may peace be upon him) were grazing at Dhu Qarad. 'Abd al-Rahman b. Auf's slave met me and said: The milch she-camels of the Messenger of Allah (may peace be upon him) had been taken away. I said: Who has taken them away? He said: (the people belonging to the tribe of) Ghatafan. I cried thrice: Help! I made the whole city between the two lavas hear my cry. Then I ran straight in their pursuit until I overtook them at Dhu Qarad where they were just going to water their animals. I, being an archer, began to shoot them with my arrows and was saying: I am the son of al-Akwa'. And today is the day when the cowards will meet their doom. I continued to chant until I rescued the milch she-camels from them, and snatched from them thirty mantles. Now, the Messenger of Allah (may peace be upon him) and some other people came along. I said: Prophet of Allah, I have prevented them from water while they were thirsty. So you should send a force (to punish them). He (the Holy Prophet) said: Ibn al-Akwa', you have taken (what, you have taken). Now let them go. Then we returned and the Messenger of Allah (may peace be upon him) made me mount behind him on his she-camel until we entered Medina.",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "hadith_no": "4788",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، كلاهما عن حاتم بن إسماعيل، عن جعفر بن محمد، عن أبيه، عن يزيد بن هرمز، أن نجدة، كتب إلى ابن عباس يسأله عن خلال، ‏.‏ بمثل حديث سليمان بن بلال غير أن في، حديث حاتم وإن رسول الله صلى الله عليه وسلم لم يكن يقتل الصبيان فلا تقتل الصبيان إلا أن تكون تعلم ما علم الخضر من الصبي الذي قتل ‏.‏ وزاد إسحاق في حديثه عن حاتم وتميز المؤمن فتقتل الكافر وتدع المؤمن ‏.‏",
      "text_en": " This tradition has been narrated by the game authority (Yazid b. Hurmus) through a different chain of transmitters with the following difference in the elucidation of one of the points raised by Najda in his letter to Ibn Abas:                      The Messenger of Allah (may peace be upon him) used not to kill the children, so thou shouldst not kill them unless you could know what Khadir had known about the child he killed, or you could distinguish between a child who would grow up to he a believer (and a child who would grow up to be a non-believer), so that you killed the (prospective) non-believer and left the (prospective) believer aside.",
      "chain": [
        "30201",
        "30123",
        "20159",
        "10898",
        "11442",
        "10627"
      ]
    },
    {
      "hadith_no": "4800",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن عباد، حدثنا حاتم، - يعني ابن إسماعيل - عن يزيد، - وهو ابن أبي عبيد قال سمعت سلمة، يقول غزوت مع رسول الله صلى الله عليه وسلم سبع غزوات وخرجت فيما يبعث من البعوث تسع غزوات مرة علينا أبو بكر ومرة علينا أسامة بن زيد ‏.‏",
      "text_en": " It has been narrated on the authority of Salama who said:                      I joined seven military expeditions led by the Messenger of Allah himself (may peace be upon him), and nine expeditions which he sent out once under Abu Bakr and once under Usama b. Zaid.",
      "chain": [
        "30377",
        "20159",
        "11450",
        "237"
      ]
    },
    {
      "hadith_no": "4815",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا قتيبة بن سعيد، وأبو بكر بن أبي شيبة قالا حدثنا حاتم، - وهو ابن إسماعيل - عن المهاجر بن مسمار، عن عامر بن سعد بن أبي وقاص، قال كتبت إلى جابر بن سمرة مع غلامي نافع أن أخبرني بشىء، سمعته من، رسول الله صلى الله عليه وسلم قال فكتب إلى سمعت رسول الله صلى الله عليه وسلم يوم جمعة عشية رجم الأسلمي يقول ‏\"‏ لا يزال الدين قائما حتى تقوم الساعة أو يكون عليكم اثنا عشر خليفة كلهم من قريش ‏\"‏ ‏.‏ وسمعته يقول ‏\"‏ عصيبة من المسلمين يفتتحون البيت الأبيض بيت كسرى أو آل كسرى ‏\"‏ ‏.‏ وسمعته يقول ‏\"‏ إن بين يدى الساعة كذابين فاحذروهم ‏\"‏ ‏.‏ وسمعته يقول ‏\"‏ إذا أعطى الله أحدكم خيرا فليبدأ بنفسه وأهل بيته ‏\"‏ ‏.‏ وسمعته يقول ‏\"‏ أنا الفرط على الحوض ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Amir b. Sa'd b. Abu Waqqas who said:                      I wrote (a letter) to Jabir b. Samura and sent it to him through my servant Nafi', asking him to inform me of something he had heard from the Messenger of Allah (may peace be upon him). He wrote to me (in reply): I heard the Messenger of Allah (may peace be upon him) say on Friday evening, the day on which al-Aslami was stoned to death (for committing adultery): The Islamic religion will continue until the Hour has been established, or you have been ruled over by twelve Caliphs, all of them being from the Quraish. also heard him say: A small force of the Muslims will capture the white palace, the police of the Persian Emperor or his descendants. I also heard him say: Before the Day of Judgment there will appear (a number of) impostors. You are to guard against them. I also heard him say: When God grants wealth to any one of you, he should first spend it on himself and his family (and then give it in charity to the poor). I heard him (also) say: I will be your forerunner at the Cistern (expecting your arrival).",
      "chain": [
        "30367",
        "30201",
        "20159",
        "10554"
      ]
    },
    {
      "hadith_no": "4929",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا حاتم، - يعني ابن إسماعيل - عن يزيد بن أبي، عبيد مولى سلمة بن الأكوع قال قلت لسلمة على أى شىء بايعتم رسول الله صلى الله عليه وسلم يوم الحديبية قال على الموت ‏.‏",
      "text_en": " It has been narrated on the authority of Yazid b. Abu Ubaid (the freed slave of Salama b. al-Akwa') who said:                      1 asked Salama as to what effect he had sworn fealty to the Messenger of Allah (may peace be upon him) on the Day of Hudaibiya. He said: To the effect that we will die fighting.",
      "chain": [
        "30367",
        "20159"
      ]
    },
    {
      "hadith_no": "4932",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حاتم، - يعني ابن إسماعيل - عن يزيد بن أبي، عبيد عن سلمة بن الأكوع، أنه دخل على الحجاج فقال يا ابن الأكوع ارتددت على عقبيك تعربت قال لا ولكن رسول الله صلى الله عليه وسلم أذن لي في البدو ‏.‏",
      "text_en": " It has been narrated by Salama b. al-Akwa' that he visited al-Hajjaj who said to him:                      O son of al-Akwa', you have turned apostate and have come to live again in the desert with the Bedouins (after your migration). He said: No, but the Messenger of Allah (may peace be upon him) has permitted me to live in the desert.",
      "chain": [
        "30367",
        "20159",
        "11450",
        "237"
      ]
    }
  ],
  "total_hadiths": 131
}