{
  "id": "20155",
  "name": "Isma'il bin Ja'far bin Abi Kathir إسماعيل بن جعفر بن أبي كثير الأنصاري",
  "full_name": "Isma'il bin Ja'far bin Abi Kathir إسماعيل بن جعفر بن أبي كثير الأنصاري",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "biography": {
    "birth": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": [
        "100 AH"
      ],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "180",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Baghdad",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      " Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]",
      "Recitation/Quran"
    ],
    "tags": [
      "Ansar",
      "B.Zurayq",
      "Client",
      "Madni"
    ]
  },
  "parents": [
    {
      "id": "29225",
      "name": "Ja'far bin Abi Kathir al-Ansari جعفر بن أبي كثير الأنصاري",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "20173",
      "name": "Muhammad bin Ja'far bin Abi Kathir محمد بن جعفر بن أبي كثير",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "22700",
      "name": "Yahya bin Ja'far bin Abi Kathir يحيى بن جعفر بن أبي كثير",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "22239",
      "name": "Y'aqub bin Ja'far bin Abi Kathir يعقوب بن جعفر بن أبي كثير الأنصاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "23595",
      "name": "Kathir bin Ja'far bin Abi Kathir كثير بن جعفر بن أبي كثير",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "11186",
      "name": "'Abdullah bin 'Abdur Rahman bin Ma'mar عبد الله بن عبد الرحمن بن معمر",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11183",
      "name": "'Abdullah bin Dinar عبد الله بن دينار العدوي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11414",
      "name": "Rabi'a bin Yazid al-Damashqi ربيعة بن يزيد الدمشقي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10898",
      "name": "Ja'far bin Muhammad bin 'Ali جعفر بن محمد بن علي - الصادق",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11209",
      "name": "'Amr bin Abi 'Amr عمرو بن أبي عمرو ميسرة مولى المطلب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10606",
      "name": "al-Ala' bin 'Abdur Rahman bin Ya'qub العلاء بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10616",
      "name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11445",
      "name": "Nafi' bin Malik bin Abi 'Amir نافع بن مالك بن أبي عامر الأصبحي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11235",
      "name": "Yazid bin 'Abdullah bin Khusayfa يزيد بن عبد الله بن خصيفة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    }
  ],
  "students": [
    {
      "id": "30162",
      "name": "Muhammad bin Jhdm bin Abd محمد بن جهضم بن عبد الله الثقفي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30399",
      "name": "Yahya bin Yahya bin Bukayr يحيى بن يحيى بن بكير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30137",
      "name": "Sulaiman bin Da'ud al-'Atki al-Zahrani سليمان بن داود أبو الربيع الزهراني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30250",
      "name": "Surayj bin al-Nu'man al-Juhari سريج بن النعمان الجوهري اللؤلؤي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30315",
      "name": "Isma'il bin Ibrahim,Abu Ma'mar al-Hadhli إسماعيل بن إبراهيم بن معمر أبو معمر",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30526",
      "name": "Yahya bin Ayoub al-Maqabri يحيى بن أيوب المقابري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20387",
      "name": "'Ali bin Hujr bin Iyas bin Maqatil علي بن حجر بن إياس بن مقاتل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "33",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان أبو الربيع، قال حدثنا إسماعيل بن جعفر، قال حدثنا نافع بن مالك بن أبي عامر أبو سهيل، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ آية المنافق ثلاث إذا حدث كذب، وإذا وعد أخلف، وإذا اؤتمن خان ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          The Prophet said, \"The signs of a hypocrite are three:     1. Whenever he speaks, he tells a lie.     2. Whenever he promises, he always breaks it (his promise ).     3. If you trust him, he proves to be dishonest. (If you keep something     as a trust with him, he will not return it.)\"",
      "chain": [
        "30137",
        "20155",
        "11445",
        "11443",
        "13"
      ]
    },
    {
      "hadith_no": "49",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "أخبرنا قتيبة بن سعيد، حدثنا إسماعيل بن جعفر، عن حميد، عن أنس، قال أخبرني عبادة بن الصامت، أن رسول الله صلى الله عليه وسلم خرج يخبر بليلة القدر، فتلاحى رجلان من المسلمين فقال ‏\"‏ إني خرجت لأخبركم بليلة القدر، وإنه تلاحى فلان وفلان فرفعت وعسى أن يكون خيرا لكم التمسوها في السبع والتسع والخمس ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                           \"Allah's Apostle went out to inform the people about the (date of the)     night of decree (Al-Qadr) but there happened a quarrel between two      Muslim men. The Prophet said, \"I came out to inform you about (the      date of) the night of Al-Qadr, but as so and so and so and so      quarrelled, its knowledge was taken away (I forgot it) and maybe it      was better for you. Now look for it in the 7th, the 9th and the 5th      (of the last 10 nights of the month of Ramadan).\"",
      "chain": [
        "30367",
        "20155",
        "11279",
        "19",
        "40"
      ]
    },
    {
      "hadith_no": "61",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا قتيبة، حدثنا إسماعيل بن جعفر، عن عبد الله بن دينار، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من الشجر شجرة لا يسقط ورقها، وإنها مثل المسلم، فحدثوني ما هي ‏\"‏‏.‏ فوقع الناس في شجر البوادي‏.‏ قال عبد الله ووقع في نفسي أنها النخلة، فاستحييت ثم قالوا حدثنا ما هي يا رسول الله قال ‏\"‏ هي النخلة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"Amongst the trees, there is a tree, the leaves of which do not fall and is like a Muslim. Tell me the name of that tree.\" Everybody started thinking about the trees of the desert areas. And I thought of the date-palm tree but felt shy to answer the others then asked, \"What is that tree, O Allah's Apostle ?\" He replied, \"It is the date-palm tree.\"",
      "chain": [
        "30367",
        "20155",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "405",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا قتيبة، قال حدثنا إسماعيل بن جعفر، عن حميد، عن أنس، أن النبي صلى الله عليه وسلم رأى نخامة في القبلة، فشق ذلك عليه حتى رئي في وجهه، فقام فحكه بيده فقال ‏\"‏ إن أحدكم إذا قام في صلاته، فإنه يناجي ربه  أو إن ربه بينه وبين القبلة  فلا يبزقن أحدكم قبل قبلته، ولكن عن يساره، أو تحت قدميه ‏\"‏‏.‏ ثم أخذ طرف ردائه فبصق فيه، ثم رد بعضه على بعض، فقال ‏\"‏ أو يفعل هكذا ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet saw some sputum in the direction of the Qibla (on the wall of the mosque) and he disliked that and the sign of disgust was apparent from his face. So he got up and scraped it off with his hand and said, \"Whenever anyone of you stands for the prayer, he is speaking in private to his Lord or his Lord is between him and his Qibla. So, none of you should spit in the direction of the Qibla but one can spit to the left or under his foot.\" The Prophet then took the corner of his sheet and spat in it and folded it and said, \"Or you can do this. \"",
      "chain": [
        "30367",
        "20155",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "610",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا قتيبة بن سعيد، قال حدثنا إسماعيل بن جعفر، عن حميد، عن أنس بن مالك، أن النبي صلى الله عليه وسلم كان إذا غزا بنا قوما لم يكن يغزو بنا حتى يصبح وينظر، فإن سمع أذانا كف عنهم، وإن لم يسمع أذانا أغار عليهم، قال فخرجنا إلى خيبر فانتهينا إليهم ليلا، فلما أصبح ولم يسمع أذانا ركب وركبت خلف أبي طلحة، وإن قدمي لتمس قدم النبي صلى الله عليه وسلم‏.‏ قال فخرجوا إلينا بمكاتلهم ومساحيهم فلما رأوا النبي صلى الله عليه وسلم قالوا محمد والله، محمد والخميس‏.‏ قال فلما رآهم رسول الله صلى الله عليه وسلم قال ‏\"‏ الله أكبر، الله أكبر، خربت خيبر، إنا إذا نزلنا بساحة قوم فساء صباح المنذرين ‏\"‏‏.‏",
      "text_en": " Narrated Humaid:                     Anas bin Malik said, \"Whenever the Prophet went out with us to fight (in Allah's cause) against any nation, he never allowed us to attack till morning and he would wait and see: if he heard Adhan he would postpone the attack and if he did not hear Adhan he would attack them.\" Anas added, \"We reached Khaibar at night and in the morning when he did not hear the Adhan for the prayer, he (the Prophet ) rode and I rode behind Abi Talha and my foot was touching that of the Prophet. The inhabitants of Khaibar came out with their baskets and spades and when they saw the Prophet they shouted 'Muhammad! By Allah, Muhammad and his army.' When Allah's Apostle saw them, he said, \"Allahu-Akbar! Allahu-Akbar! Khaibar is ruined. Whenever we approach a (hostile) nation (to fight), then evil will be the morning of those who have been warned.\"",
      "chain": [
        "30367",
        "20155",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "661",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا قتيبة، قال حدثنا إسماعيل بن جعفر، عن حميد، قال سئل أنس هل اتخذ رسول الله صلى الله عليه وسلم خاتما فقال نعم، أخر ليلة صلاة العشاء إلى شطر الليل، ثم أقبل علينا بوجهه بعد ما صلى فقال ‏\"‏ صلى الناس ورقدوا ولم تزالوا في صلاة منذ انتظرتموها ‏\"‏‏.‏ قال فكأني أنظر إلى وبيص خاتمه‏.‏",
      "text_en": " Narrated Humaid:                     Anas was asked, \"Did Allah's Apostle wear a ring?\" He said, \"Yes. Once he delayed the `Isha' prayer till midnight and after the prayer, he faced us and said, 'The people prayed and have slept and you remained in prayer as long as you waited for it.' \" Anas added, \"As if I were just now observing the glitter of his ring.\"",
      "chain": [
        "30367",
        "20155",
        "11279"
      ]
    },
    {
      "hadith_no": "1014",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا قتيبة بن سعيد، قال حدثنا إسماعيل بن جعفر، عن شريك، عن أنس بن مالك، أن رجلا، دخل المسجد يوم جمعة من باب كان نحو دار القضاء، ورسول الله صلى الله عليه وسلم قائم يخطب، فاستقبل رسول الله صلى الله عليه وسلم قائما ثم قال يا رسول الله هلكت الأموال وانقطعت السبل، فادع الله يغيثنا فرفع رسول الله صلى الله عليه وسلم يديه ثم قال ‏\"‏ اللهم أغثنا، اللهم أغثنا، اللهم أغثنا ‏\"‏‏.‏ قال أنس ولا والله ما نرى في السماء من سحاب، ولا قزعة، وما بيننا وبين سلع من بيت ولا دار‏.‏ قال فطلعت من ورائه سحابة مثل الترس، فلما توسطت السماء انتشرت ثم أمطرت، فلا والله ما رأينا الشمس ستا، ثم دخل رجل من ذلك الباب في الجمعة ورسول الله صلى الله عليه وسلم قائم يخطب، فاستقبله قائما فقال يا رسول الله هلكت الأموال وانقطعت السبل، فادع الله يمسكها عنا‏.‏ قال فرفع رسول الله صلى الله عليه وسلم يديه ثم قال ‏\"‏ اللهم حوالينا ولا علينا، اللهم على الآكام والظراب وبطون الأودية ومنابت الشجر ‏\"‏‏.‏ قال فأقلعت وخرجنا نمشي في الشمس‏.‏ قال شريك سألت أنس بن مالك أهو الرجل الأول فقال ما أدري‏.‏",
      "text_en": " Narrated Sharik:                     Anas bin Malik said, \"A person entered the Mosque on a Friday through the gate facing the Daril- Qada' and Allah's Apostle was standing delivering the Khutba (sermon). The man stood in front of Allah's Apostle and said, 'O Allah's Apostle, livestock are dying and the roads are cut off; please pray to Allah for rain.' So Allah's Apostle (p.b.u.h) raised both his hands and said, 'O Allah! Bless us with rain. O Allah! Bless us with rain. O Allah! Bless us with rain!\" Anas added, \"By Allah, there were no clouds in the sky and there was no house or building between us and the mountain of Sila'. Then a big cloud like a shield appeared from behind it (i.e. Silas Mountain) and when it came in the middle of the sky, it spread and then rained. By Allah! We could not see the sun for a week. The next Friday, a person entered through the same gate and Allah's Apostle was delivering the Friday Khutba and the man stood in front of him and said, 'O Allah's Apostle! The livestock are dying and the roads are cut off; Please pray to Allah to withhold rain.' \" Anas added, \"Allah's Apostle raised both his hands and said, 'O Allah! Round about us and not on us. O Allah!' On the plateaus, on the mountains, on the hills, in the valleys and on the places where trees grow.' \" Anas added, \"The rain stopped and we came out, walking in the sun.\" Sharik asked Anas whether it was the same person who had asked for rain the previous Friday. Anas replied that he did not know.",
      "chain": [
        "30367",
        "20155",
        "20587",
        "19"
      ]
    },
    {
      "hadith_no": "1072",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا سليمان بن داود أبو الربيع، قال حدثنا إسماعيل بن جعفر، قال أخبرنا يزيد بن خصيفة، عن ابن قسيط، عن عطاء بن يسار، أنه أخبره، أنه، سأل زيد بن ثابت  رضى الله عنه  فزعم أنه قرأ على النبي صلى الله عليه وسلم ‏{‏والنجم‏}‏ فلم يسجد فيها‏.‏",
      "text_en": " Narrated `Ata' bin Yasar:                     I asked Zaid bin Thabit about prostration on which he said that he had recited An-Najm before the Prophet, yet he (the Prophet) had not performed a prostration.",
      "chain": [
        "30584",
        "20155",
        "11235",
        "11236",
        "11020",
        "49"
      ]
    },
    {
      "hadith_no": "1528",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا يحيى بن محمد بن السكن، حدثنا محمد بن جهضم، حدثنا إسماعيل بن جعفر، عن عمر بن نافع، عن أبيه، عن ابن عمر  رضى الله عنهما  قال فرض رسول الله صلى الله عليه وسلم زكاة الفطر صاعا من تمر، أو صاعا من شعير على العبد والحر، والذكر والأنثى، والصغير والكبير من المسلمين، وأمر بها أن تؤدى قبل خروج الناس إلى الصلاة‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle enjoined the payment of one Sa' of dates or one Sa' of barley as Zakat-ul-Fitr on every Muslim slave or free, male or female, young or old, and he ordered that it be paid before the people went out to offer the `Id prayer. (One Sa' = 3 Kilograms approx.)",
      "chain": [
        "30182",
        "30162",
        "20155",
        "11713",
        "18"
      ]
    },
    {
      "hadith_no": "1695",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا قتيبة، حدثنا إسماعيل بن جعفر، عن محمد بن أبي حرملة، عن كريب، مولى ابن عباس عن أسامة بن زيد  رضى الله عنهما  أنه قال ردفت رسول الله صلى الله عليه وسلم من عرفات فلما بلغ رسول الله صلى الله عليه وسلم الشعب الأيسر الذي دون المزدلفة أناخ، فبال ثم جاء فصببت عليه الوضوء، فتوضأ وضوءا خفيفا‏.‏ فقلت الصلاة يا رسول الله‏.‏ قال ‏\"‏ الصلاة أمامك ‏\"‏‏.‏ فركب رسول الله صلى الله عليه وسلم حتى أتى المزدلفة، فصلى ثم ردف الفضل رسول الله صلى الله عليه وسلم غداة جمع‏.‏   قال كريب فأخبرني عبد الله بن عباس  رضى الله عنهما  عن الفضل، أن رسول الله صلى الله عليه وسلم لم يزل يلبي حتى بلغ الجمرة‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     I rode behind Allah's Apostle from `Arafat and when Allah's Apostle reached the mountain pass on the left side which is before Al-Muzdalifa he made his camel kneel and then urinated, and then I poured water for his ablution. He performed light ablution and then I said to him: (Is it the time for) the prayer, O Allah's Apostle!\" He replied, \"The (place of) prayer is ahead of you (i.e. at Al- Muzdalifa).\" So Allah's Apostle rode till he reached Al-Muzdalifa and then he offered the prayer (there) . Then in the morning (10th Dhul-Hijja) Al-Faql (bin `Abbas) rode behind Allah's Apostle. Kuraib, (a sub-narrator) said that `Abdullah bin `Abbas narrated from Al-Fadl, \"Allah's Apostle (p.b.u.h) kept on reciting Talbiya (during the journey) till he reached the Jamra.\" (Jamrat-Al-`Aqaba)",
      "chain": [
        "30367",
        "20155",
        "11535",
        "11211",
        "50"
      ]
    },
    {
      "hadith_no": "1919",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا قتيبة، حدثنا إسماعيل بن جعفر، عن حميد، عن أنس  رضى الله عنه  أن النبي صلى الله عليه وسلم كان إذا قدم من سفر، فنظر إلى جدرات المدينة أوضع راحلته، وإن كان على دابة، حركها من حبها‏.‏",
      "text_en": " Narrated Anas:                     Whenever the Prophet returned from a journey and observed the walls of Medina, he would make his Mount go fast, and if he was on an animal (i.e. a horse), he would make it gallop because of his love for Medina.",
      "chain": [
        "30367",
        "20155",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "1891",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا إسماعيل بن جعفر، عن أبي سهيل، عن أبيه، عن طلحة بن عبيد الله، أن أعرابيا، جاء إلى رسول الله صلى الله عليه وسلم ثائر الرأس فقال يا رسول الله أخبرني ماذا فرض الله على من الصلاة فقال ‏\"‏ الصلوات الخمس، إلا أن تطوع شيئا ‏\"‏‏.‏ فقال أخبرني ما فرض الله على من الصيام فقال ‏\"‏ شهر رمضان، إلا أن تطوع شيئا ‏\"‏‏.‏ فقال أخبرني بما فرض الله على من الزكاة فقال فأخبره رسول الله صلى الله عليه وسلم شرائع الإسلام‏.‏ قال والذي أكرمك لا أتطوع شيئا، ولا أنقص مما فرض الله على شيئا‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أفلح إن صدق، أو دخل الجنة إن صدق ‏\"‏‏.‏",
      "text_en": " Narrated Talha bin 'Ubaidullah:                     A bedouin with unkempt hair came to Allah's Apostle and said, \"O Allah's Apostle! Inform me what Allah has made compulsory for me as regards the prayers.\" He replied: \"You have to offer perfectly the five compulsory prayers in a day and night (24 hours), unless you want to pray Nawafil.\" The bedouin further asked, \"Inform me what Allah has made compulsory for me as regards fasting.\" He replied, \"You have to fast during the whole month of Ramadan, unless you want to fast more as Nawafil.\" The bedouin further asked, \"Tell me how much Zakat Allah has enjoined on me.\" Thus, Allah's Apostle informed him about all the rules (i.e. fundamentals) of Islam. The bedouin then said, \"By Him Who has honored you, I will neither perform any Nawafil nor will I decrease what Allah has enjoined on me. Allah's Apostle said, \"If he is saying the truth, he will succeed (or he will be granted Paradise).",
      "chain": [
        "30367",
        "20155",
        "11445",
        "11443",
        "6"
      ]
    },
    {
      "hadith_no": "1898",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا قتيبة، حدثنا إسماعيل بن جعفر، عن أبي سهيل، عن أبيه، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا جاء رمضان فتحت أبواب الجنة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"When Ramadan begins, the gates of Paradise are opened.\"",
      "chain": [
        "30367",
        "20155",
        "11445",
        "11443",
        "13"
      ]
    },
    {
      "hadith_no": "2017",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Night of Qadr - كتاب فضل ليلة القدر",
      "chapter_no": "32",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا إسماعيل بن جعفر، حدثنا أبو سهيل، عن أبيه، عن عائشة  رضى الله عنها  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ تحروا ليلة القدر في الوتر من العشر الأواخر من رمضان ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle said, \"Search for the Night of Qadr in the odd nights of the last ten days of Ramadan.\"",
      "chain": [
        "30367",
        "20155",
        "11445",
        "11443",
        "53"
      ]
    },
    {
      "hadith_no": "2208",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا قتيبة، حدثنا إسماعيل بن جعفر، عن حميد، عن أنس  رضى الله عنه  أن النبي صلى الله عليه وسلم نهى عن بيع ثمر التمر حتى تزهو‏.‏ فقلنا لأنس ما زهوها قال تحمر وتصفر، أرأيت إن منع الله الثمرة بم تستحل مال أخيك",
      "text_en": " Narrated Humaid:                     Anas said, \"The Prophet forbade the selling of dates till they were almost ripe.\" We asked Anas, \"What does 'almost ripe' mean?\" He replied, \"They get red and yellow. The Prophet added, 'If Allah destroyed the fruits present on the trees, what right would the seller have to take the money of his brother (somebody else)?' \"",
      "chain": [
        "30367",
        "20155",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "2293",
      "source": " Sahih Bukhari ",
      "chapter": "Kafalah - كتاب الكفالة",
      "chapter_no": "39",
      "text_ar": "حدثنا قتيبة، حدثنا إسماعيل بن جعفر، عن حميد، عن أنس  رضى الله عنه  قال قدم علينا عبد الرحمن بن عوف فآخى رسول الله صلى الله عليه وسلم بينه وبين سعد بن الربيع‏.‏",
      "text_en": " Narrated Anas:                     `Abdur-Rahman bin `Auf came to us and Allah's Apostle established a bond of brotherhood between him and Sa`d bin Rabi`a.",
      "chain": [
        "30367",
        "20155",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "2336",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا قتيبة، حدثنا إسماعيل بن جعفر، عن موسى بن عقبة، عن سالم بن عبد الله بن عمر، عن أبيه  رضى الله عنه  أن النبي صلى الله عليه وسلم أري وهو في معرسه من ذي الحليفة في بطن الوادي، فقيل له إنك ببطحاء مباركة‏.‏ فقال موسى وقد أناخ بنا سالم بالمناخ الذي كان عبد الله ينيخ به، يتحرى معرس رسول الله صلى الله عليه وسلم وهو أسفل من المسجد الذي ببطن الوادي، بينه وبين الطريق وسط من ذلك‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     While the Prophet was passing the night at his place of rest in Dhul-Hulaifa in the bottom of the valley (of Aqiq), he saw a dream and it was said to him, \"You are in a blessed valley.\" Musa said, \"Salim let our camels kneel at the place where `Abdullah used to make his camel kneel, seeking the place where Allah's Apostle used to take a rest, which is situated below the mosque which is in the bottom of the valley; it is midway between the mosque and the road.\"",
      "chain": [
        "30367",
        "20155",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "2436",
      "source": " Sahih Bukhari ",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا إسماعيل بن جعفر، عن ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن خالد الجهني  رضى الله عنه  أن رجلا سأل رسول الله صلى الله عليه وسلم عن اللقطة قال ‏\"‏ عرفها سنة، ثم اعرف وكاءها وعفاصها، ثم استنفق بها، فإن جاء ربها فأدها إليه ‏\"‏‏.‏ قالوا يا رسول الله فضالة الغنم قال ‏\"‏ خذها فإنما هي لك أو لأخيك أو للذئب ‏\"‏‏.‏ قال يا رسول الله، فضالة الإبل قال فغضب رسول الله صلى الله عليه وسلم حتى احمرت وجنتاه  أو احمر وجهه  ثم قال ‏\"‏ ما لك ولها، معها حذاؤها وسقاؤها، حتى يلقاها ربها ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     A man asked Allah's Apostle about the Luqata. He said, \"Make public announcement of it for one year, then remember the description of its container and the string it is tied with, utilize the money, and if its owner comes back after that, give it to him.\" The people asked, \"O Allah's Apostle! What about a lost sheep?\" Allah's Apostle said, \"Take it, for it is for you, for your brother, or for the wolf.\" The man asked, \"O Allah's Apostle! What about a lost camel?\" Allah's Apostle got angry and his cheeks or face became red, and said, \"You have no concern with it as it has its feet, and its watercontainer, till its owner finds it.\"",
      "chain": [
        "30367",
        "20155",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "hadith_no": "2682",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا إسماعيل بن جعفر، عن أبي سهيل، نافع بن مالك بن أبي عامر عن أبيه، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ آية المنافق ثلاث إذا حدث كذب، وإذا اؤتمن خان، وإذا وعد أخلف ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The signs of a hypocrite are three: (1) whenever he speaks, he tells a lie, (2) whenever he is entrusted, he proves to be dishonest, (3) whenever he promises, he breaks his promise.",
      "chain": [
        "30367",
        "20155",
        "11445",
        "11443",
        "13"
      ]
    },
    {
      "hadith_no": "2749",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا سليمان بن داود أبو الربيع، حدثنا إسماعيل بن جعفر، حدثنا نافع بن مالك بن أبي عامر أبو سهيل، عن أبيه، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ آية المنافق ثلاث، إذا حدث كذب، وإذا اؤتمن خان، وإذا وعد أخلف ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The signs of a hypocrite are three: Whenever he speaks he tells a lie; whenever he is entrusted he proves dishonest; whenever he promises he breaks his promise.\"",
      "chain": [
        "30584",
        "20155",
        "11445",
        "11443",
        "13"
      ]
    },
    {
      "hadith_no": "2944",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا قتيبة، حدثنا إسماعيل بن جعفر، عن حميد، عن أنس، أن النبي صلى الله عليه وسلم كان إذا غزا بنا‏.‏",
      "text_en": " Narrated Anas:                     as Hadith No. 193 above.",
      "chain": [
        "30367",
        "20155",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "3575",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا إسماعيل بن جعفر، عن عبد الله بن دينار، عن أبي صالح، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن مثلي ومثل الأنبياء من قبلي كمثل رجل بنى بيتا فأحسنه وأجمله، إلا موضع لبنة من زاوية، فجعل الناس يطوفون به ويعجبون له، ويقولون هلا وضعت هذه اللبنة قال فأنا اللبنة، وأنا خاتم النبيين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"My similitude in comparison with the other prophets before me, is that of a man who has built a house nicely and beautifully, except for a place of one brick in a corner. The people go about it and wonder at its beauty, but say: 'Would that this brick be put in its place!' So I am that brick, and I am the last of the Prophets.\"",
      "chain": [
        "30367",
        "20155",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3827",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا قتيبة، حدثنا إسماعيل بن جعفر، عن حميد، عن أنس  رضى الله عنه  أنه قال قدم علينا عبد الرحمن بن عوف، وآخى رسول الله صلى الله عليه وسلم بينه وبين سعد بن الربيع، وكان كثير المال، فقال سعد قد علمت الأنصار أني من أكثرها مالا، سأقسم مالي بيني وبينك شطرين، ولي امرأتان، فانظر أعجبهما إليك فأطلقها، حتى إذا حلت تزوجتها‏.‏ فقال عبد الرحمن بارك الله لك في أهلك‏.‏ فلم يرجع يومئذ حتى أفضل شيئا من سمن وأقط، فلم يلبث إلا يسيرا، حتى جاء رسول الله صلى الله عليه وسلم وعليه وضر من صفرة فقال له رسول الله صلى الله عليه وسلم ‏\"‏ مهيم ‏\"‏‏.‏ قال تزوجت امرأة من الأنصار‏.‏ فقال ‏\"‏ ما سقت فيها ‏\"‏‏.‏ قال وزن نواة من ذهب، أو نواة من ذهب، فقال ‏\"‏ أولم ولو بشاة ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     When `Abdur-Rahman bin `Auf came to us, Allah's Apostle made a bond of fraternity between him and Sa`d bin Ar-Rabi` who was a rich man, Sa`d said, \"The Ansar know that I am the richest of all of them, so I will divide my property into two parts between me and you, and I have two wives; see which of the two you like so that I may divorce her and you can marry her after she becomes lawful to you by her passing the prescribed period (i.e. 'Idda) of divorce. `Abdur Rahman said, \"May Allah bless you your family (i.e. wives) for you.\" (But `Abdur-Rahman went to the market) and did not return on that day except with some gain of dried yogurt and butter. He went on trading just a few days till he came to Allah's Apostle bearing the traces of yellow scent over his clothes. Allah's Apostle asked him, \"What is this scent?\" He replied, \"I have married a woman from the Ansar.\" Allah's Apostle asked, \"How much Mahr have you given?\" He said, \"A date-stone weight of gold or a golden date-stone.\" The Prophet said, \"Arrange a marriage banquet even with a sheep.\"",
      "chain": [
        "30367",
        "20155",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "3884",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا قتيبة، حدثنا إسماعيل بن جعفر، عن عبد الله بن دينار، عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ ألا من كان حالفا فلا يحلف إلا بالله ‏\"‏‏.‏ فكانت قريش تحلف بآبائها، فقال ‏\"‏ لا تحلفوا بآبائكم ‏\"‏‏.‏",
      "text_en": " Narrated `Umar:                     The Prophet said, \"If anybody has to take an oath, he should swear only by Allah.\" The people of Quraish used to swear by their fathers, but the Prophet said, \"Do not swear by your fathers. \"",
      "chain": [
        "30367",
        "20155",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "4190",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا قتيبة بن سعيد، أخبرنا إسماعيل بن جعفر، عن ربيعة بن أبي عبد الرحمن، عن محمد بن يحيى بن حبان، عن ابن محيريز، أنه قال دخلت المسجد فرأيت أبا سعيد الخدري فجلست إليه فسألته عن العزل،، قال أبو سعيد خرجنا مع رسول الله صلى الله عليه وسلم في غزوة بني المصطلق، فأصبنا سبيا من سبى العرب، فاشتهينا النساء واشتدت علينا العزبة، وأحببنا العزل، فأردنا أن نعزل، وقلنا نعزل ورسول الله صلى الله عليه وسلم بين أظهرنا قبل أن نسأله فسألناه عن ذلك فقال ‏\"‏ ما عليكم أن لا تفعلوا، ما من نسمة كائنة إلى يوم القيامة إلا وهى كائنة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Muhairiz:                     I entered the Mosque and saw Abu Sa`id Al-Khudri and sat beside him and asked him about Al-Azl (i.e. coitus interruptus). Abu Sa`id said, \"We went out with Allah's Apostle for the Ghazwa of Banu Al-Mustaliq and we received captives from among the Arab captives and we desired women and celibacy became hard on us and we loved to do coitus interruptus. So when we intended to do coitus interrupt us, we said, 'How can we do coitus interruptus before asking Allah's Apostle who is present among us?\" We asked (him) about it and he said, 'It is better for you not to do so, for if any soul (till the Day of Resurrection) is predestined to exist, it will exist.\"",
      "chain": [
        "30367",
        "20155",
        "11162",
        "11222"
      ]
    },
    {
      "hadith_no": "5066",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "وزاد أبو معمر حدثنا إسماعيل بن جعفر، عن مالك بن أنس، عن عبد الرحمن بن عبد الله بن عبد الرحمن بن أبي صعصعة، عن أبيه، عن أبي سعيد الخدري، أخبرني أخي، قتادة بن النعمان أن رجلا، قام في زمن النبي صلى الله عليه وسلم يقرأ من السحر ‏{‏قل هو الله أحد‏}‏ لا يزيد عليها، فلما أصبحنا أتى رجل النبي صلى الله عليه وسلم نحوه‏.‏",
      "text_en": "        Narrated Abu Said Al-Khudri:                      My brother, Qatada bin An-Nau'man said, \"A man performed the night prayer late at night in the lifetime of the Prophet and he read: 'Say: He is Allah, (the) One,' (112.1) and read nothing besides that. The next morning a man went to the Prophet ,~ and told him about that . (The Prophet replied the same as (in Hadith 532) above.)",
      "chain": [
        "20155",
        "20001",
        "11518",
        "11514",
        "38"
      ]
    },
    {
      "hadith_no": "5141",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا قتيبة، حدثنا إسماعيل بن جعفر، عن حميد، عن أنس  رضى الله عنه  قال أقام النبي صلى الله عليه وسلم بين خيبر والمدينة ثلاثا يبنى عليه بصفية بنت حيى فدعوت المسلمين إلى وليمته فما كان فيها من خبز ولا لحم، أمر بالأنطاع فألقى فيها من التمر والأقط والسمن فكانت وليمته، فقال المسلمون إحدى أمهات المؤمنين أو مما ملكت يمينه، فقالوا إن حجبها فهى من أمهات المؤمنين، وإن لم يحجبها فهى مما ملكت يمينه، فلما ارتحل وطى لها خلفه ومد الحجاب بينها وبين الناس‏.‏",
      "text_en": " Narrated Anas:                     The Prophet stayed for three days between Khaibar and Medina, and there he consummated his marriage to Safiyya bint Huyai. I invited the Muslims to the wedding banquet in which neither meat nor bread was offered. He ordered for leather dining-sheets to be spread, and dates, dried yoghurt and butter were laid on it, and that was the Prophet's wedding banquet. The Muslims wondered, \"Is she (Saffiyya) considered as his wife or his slave girl?\" Then they said, \"If he orders her to veil herself, she will be one of the mothers of the Believers; but if he does not order her to veil herself, she will be a slave girl. So when the Prophet proceeded from there, he spared her a space behind him (on his shecamel) and put a screening veil between her and the people.",
      "chain": [
        "30367",
        "20155",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "5214",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا محمد بن سلام، أخبرنا إسماعيل بن جعفر، عن حميد، عن أنس، قال أقام النبي صلى الله عليه وسلم بين خيبر والمدينة ثلاثا يبنى عليه بصفية بنت حيى فدعوت المسلمين إلى وليمته، فما كان فيها من خبز ولا لحم، أمر بالأنطاع فألقي فيها من التمر والأقط والسمن فكانت وليمته، فقال المسلمون إحدى أمهات المؤمنين أو مما ملكت يمينه فقالوا إن حجبها فهى من أمهات المؤمنين، وإن لم يحجبها فهى مما ملكت يمينه فلما ارتحل وطى لها خلفه ومد الحجاب بينها وبين الناس‏.‏",
      "text_en": " Narrated Anas:                     The Prophet stayed for three days at a place between Khaibar and Medina, and there he consummated his marriage with Safiyya bint Huyay. I invited the Muslims to a banquet which included neither meat nor bread. The Prophet ordered for the leather dining sheets to be spread, and then dates, dried yogurt and butter were provided over it, and that was the Walima (banquet) of the Prophet. The Muslims asked whether Safiyya would be considered as his wife or as a slave girl of what his right hands possessed. Then they said, \"If the Prophet screens her from the people, then she Is the Prophet's wife but if he does not screen her, then she is a slave girl.\" So when the Prophet proceeded, he made a place for her (on the camel) behind him and screened her from people.",
      "chain": [
        "30376",
        "20155",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "5480",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا قتيبة، حدثنا إسماعيل بن جعفر، عن عمرو بن أبي عمرو، مولى المطلب بن عبد الله بن حنطب أنه سمع أنس بن مالك، يقول قال رسول الله صلى الله عليه وسلم لأبي طلحة ‏\"‏ التمس غلاما من غلمانكم يخدمني ‏\"‏‏.‏ فخرج بي أبو طلحة، يردفني وراءه، فكنت أخدم رسول الله صلى الله عليه وسلم كلما نزل، فكنت أسمعه يكثر أن يقول ‏\"‏ اللهم إني أعوذ بك من الهم والحزن، والعجز والكسل، والبخل والجبن وضلع الدين، وغلبة الرجال ‏\"‏‏.‏ فلم أزل أخدمه حتى أقبلنا من خيبر، وأقبل بصفية بنت حيى قد حازها، فكنت أراه يحوي وراءه بعباءة أو بكساء، ثم يردفها وراءه، حتى إذا كنا بالصهباء صنع حيسا في نطع، ثم أرسلني فدعوت رجالا فأكلوا، وكان ذلك بناءه بها، ثم أقبل حتى إذا بدا له أحد قال ‏\"‏ هذا جبل يحبنا ونحبه ‏\"‏‏.‏ فلما أشرف على المدينة قال ‏\"‏ اللهم إني أحرم ما بين جبليها مثل ما حرم به إبراهيم مكة، اللهم بارك لهم في مدهم وصاعهم ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle said to Abu Talha, \"Seek one of your boys to serve me.\" Abu Talha mounted me behind him (on his riding animal) and took me (to the Prophet ). So I used to serve Allah's Apostle whenever he dismounted (to stay somewhere). I used to hear him saying very often, \"O Allah! I seek refuge with You from, having worries sadness, helplessness, laziness, miserliness, cowardice, from being heavily in debt and from being overpowered by other persons unjustly.\" I kept on serving till we -returned from the battle of Khaibar. The Prophet then brought Safiyya bint Huyai whom he had won from the war booty. I saw him folding up a gown or a garment for her to sit on behind him (on his shecamel). When he reached As-Sahba', he prepared Hais and placed it on a dining sheet. Then he sent me to invite men, who (came and) ate; and that was his and Safiyya's wedding banquet. Then the Prophet proceeded, and when he saw (noticed) the mountain of Uhud, he said, \"This mountain loves us, and we love it.\" When we approached Medina, he said, \"O Allah! I make the area between its two mountains a sanctuary as Abraham has made Mecca a sanctuary. O Allah! Bless their Mudd and Sa (special kinds of measure).",
      "chain": [
        "30367",
        "20155",
        "19"
      ]
    },
    {
      "hadith_no": "5485",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا إسماعيل بن جعفر، عن ربيعة، أنه سمع القاسم بن محمد، يقول كان في بريرة ثلاث سنن، أرادت عائشة أن تشتريها فتعتقها، فقال أهلها، ولنا الولاء، فذكرت ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ لو شئت شرطتيه لهم، فإنما الولاء لمن أعتق ‏\"‏‏.‏ قال وأعتقت فخيرت في أن تقر تحت زوجها أو تفارقه، ودخل رسول الله صلى الله عليه وسلم يوما بيت عائشة وعلى النار برمة تفور، فدعا بالغداء فأتي بخبز وأدم من أدم البيت فقال ‏\"‏ ألم أر لحما ‏\"‏‏.‏ قالوا بلى يا رسول الله، ولكنه لحم تصدق به على بريرة، فأهدته لنا‏.‏ فقال‏\"‏ هو صدقة عليها، وهدية لنا ‏\"‏‏.‏",
      "text_en": " Narrated Qasim bin Muhammad:                     Three traditions have been established because of Barira: `Aisha intended to buy her and set her free, but Barira's masters said, \"Her wala' will be for us.\" `Aisha mentioned that to Allah's Apostle who said, \"You could accept their condition if you wished, for the wala is for the one who manumits the slave.\" Barira was manumitted, then she was given the choice either to stay with her husband or leave him; One day Allah's Apostle entered `Aisha's house while there was a cooking pot of food boiling on the fire. The Prophet asked for lunch, and he was presented with bread and some extra food from the home-made Udm (e.g. soup). He asked, \"Don't I see meat (being cooked)?\" They said, \"Yes, O Allah's Apostle! But it is the meat that has been given to Barira in charity and she has given it to us as a present.\" He said, \"For Barira it is alms, but for us it is a present.\"",
      "chain": [
        "30367",
        "20155",
        "11162",
        "10535"
      ]
    },
    {
      "hadith_no": "5841",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا قتيبة، حدثنا إسماعيل بن جعفر، عن عتبة بن مسلم، مولى بني تيم عن عبيد بن حنين، مولى بني زريق عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا وقع الذباب في إناء أحدكم، فليغمسه كله، ثم ليطرحه، فإن في أحد جناحيه شفاء وفي الآخر داء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If a fly falls in the vessel of any of you, let him dip all of it (into the vessel) and then throw it away, for in one of its wings there is a disease and in the other there is healing (antidote for it) i e. the treatment for that disease.\"",
      "chain": [
        "30367",
        "20155",
        "11522",
        "11202",
        "13"
      ]
    },
    {
      "hadith_no": "6162",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا ابن سلام، حدثنا إسماعيل بن جعفر، عن أبي سهيل، نافع بن مالك بن أبي عامر عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ آية المنافق ثلاث إذا حدث كذب، وإذا وعد أخلف، وإذا اؤتمن خان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The signs of a hypocrite are three: Whenever he speaks, he tells a lie; and whenever he promises, he breaks his promise; and whenever he is entrusted, he betrays (proves to be dishonest)\".",
      "chain": [
        "30376",
        "20155",
        "11445",
        "11443",
        "13"
      ]
    },
    {
      "hadith_no": "6180",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد، حدثنا إسماعيل بن جعفر، أخبرنا ربيعة بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن خالد الجهني، أن رجلا، سأل رسول الله صلى الله عليه وسلم عن اللقطة فقال ‏\"‏ عرفها سنة، ثم اعرف وكاءها وعفاصها، ثم استنفق بها، فإن جاء ربها فأدها إليه ‏\"‏‏.‏ قال يا رسول الله فضالة الغنم قال ‏\"‏ خذها، فإنما هي لك، أو لأخيك، أو للذئب ‏\"‏‏.‏ قال يا رسول الله فضالة الإبل قال فغضب رسول الله صلى الله عليه وسلم حتى احمرت وجنتاه  أو احمر وجهه  ثم قال ‏\"‏ مالك ولها، معها حذاؤها وسقاؤها، حتى يلقاها ربها ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     A man asked Allah's Apostle about \"Al-Luqata\" (a lost fallen purse or a thing picked up by somebody). The Prophet said, \"You should announce it publicly for one year, and then remember and recognize the tying material of its container, and then you can spend it. If its owner came to you, then you should pay him its equivalent.\" The man said, \"O Allah's Apostle! What about a lost sheep?\" The Prophet said, \"Take it because it is for you, for your brother, or for the wolf.\" The man again said, \"O Allah's Apostle! What about a lost camel?\" Allah's Apostle became very angry and furious and his cheeks became red (or his face became red), and he said, \"You have nothing to do with it (the camel) for it has its food and its water container with it till it meets its owner.\"",
      "chain": [
        "30213",
        "20155",
        "11162",
        "11238",
        "3625"
      ]
    },
    {
      "hadith_no": "6372",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا محمد بن عبد الرحيم، أخبرنا عباد بن موسى، حدثنا إسماعيل بن جعفر، عن إسرائيل، عن أبي إسحاق، عن سعيد بن جبير، قال سئل ابن عباس مثل من أنت حين قبض النبي صلى الله عليه وسلم قال أنا يومئذ مختون‏.‏ قال وكانوا لا يختنون الرجل حتى يدرك‏.‏",
      "text_en": "      Narrated Said bin Jubair:                      Ibn 'Abbas was asked, \"How old were you when     the Prophet died?\" He replied. \"At that time I had been circumcised.\"      At that time, people did not circumcise the boys till they attained      the age of puberty. Sa'id bin Jubair said, \"Ibn 'Abbas said, 'When the     Prophet died, I had already been circumcised. \"",
      "chain": [
        "30272",
        "30255",
        "20155",
        "20311",
        "11049",
        "11050"
      ]
    },
    {
      "hadith_no": "6437",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا إسماعيل بن جعفر، عن عمرو بن أبي عمرو، مولى المطلب بن عبد الله بن حنطب أنه سمع أنس بن مالك، يقول قال رسول الله صلى الله عليه وسلم لأبي طلحة ‏\"‏ التمس لنا غلاما من غلمانكم يخدمني ‏\"‏‏.‏ فخرج بي أبو طلحة يردفني وراءه، فكنت أخدم رسول الله صلى الله عليه وسلم كلما نزل، فكنت أسمعه يكثر أن يقول ‏\"‏ اللهم إني أعوذ بك من الهم والحزن، والعجز والكسل، والبخل والجبن، وضلع الدين، وغلبة الرجال ‏\"‏‏.‏ فلم أزل أخدمه حتى أقبلنا من خيبر، وأقبل بصفية بنت حيى قد حازها، فكنت أراه يحوي وراءه بعباءة أو كساء ثم يردفها وراءه حتى إذا كنا بالصهباء صنع حيسا في نطع، ثم أرسلني فدعوت رجالا فأكلوا، وكان ذلك بناءه بها، ثم أقبل حتى بدا له أحد قال ‏\"‏ هذا جبيل يحبنا ونحبه ‏\"‏‏.‏ فلما أشرف على المدينة قال ‏\"‏ اللهم إني أحرم ما بين جبليها مثل ما حرم به إبراهيم مكة، اللهم بارك لهم في مدهم وصاعهم ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said to Abu Talha, \"Choose one of your boys to serve me.\" So Abu Talha took me (to serve the Prophet ) by giving me a ride behind him (on his camel). So I used to serve Allah's Apostle whenever he stayed somewhere. I used to hear him saying, \"O Allah! I seek refuge with you (Allah) from (worries) care and grief, from incapacity and laziness, from miserliness and cowardice, from being heavily in debt and from being overpowered by other men.\" I kept on serving him till he returned from (the battle of) Khaibar. He then brought Safiya, the daughter of Huyay whom he had got (from the booty). I saw him making a kind of cushion with a cloak or a garment for her. He then let her ride behind him. When we reached a place called As-Sahba', he prepared (a special meal called) Hais, and asked me to invite the men who (came and) ate, and that was the marriage banquet given on the consummation of his marriage to her. Then he proceeded till the mountain of Uhud appeared, whereupon he said, \"This mountain loves us and we love it.\" When he approached Medina, he said, \"O Allah! I make the land between its (i.e., Medina's) two mountains a sanctuary, as the prophet Abraham made Mecca a sanctuary. O Allah! Bless them (the people of Medina) in their Mudd and the Sa' (units of measuring).",
      "chain": [
        "30367",
        "20155",
        "19"
      ]
    },
    {
      "hadith_no": "6647",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا قتيبة، حدثنا إسماعيل بن جعفر، عن حميد، عن أنس، أن أم حارثة، أتت رسول الله صلى الله عليه وسلم وقد هلك حارثة يوم بدر، أصابه غرب سهم‏.‏ فقالت يا رسول الله قد علمت موقع حارثة من قلبي، فإن كان في الجنة لم أبك عليه، وإلا سوف ترى ما أصنع‏.‏ فقال لها ‏\"‏ هبلت، أجنة واحدة هي إنها جنان كثيرة، وإنه في الفردوس الأعلى ‏\"‏‏.‏   وقال ‏{‏غدوة في سبيل الله أو روحة خير من الدنيا وما فيها، ولقاب قوس أحدكم أو موضع قدم من الجنة خير من الدنيا وما فيها، ولو أن امرأة من نساء أهل الجنة اطلعت إلى الأرض، لأضاءت ما بينهما، ولملأت ما بينهما ريحا، ولنصيفها  يعني الخمار  خير من الدنيا وما فيها‏)‏‏.‏",
      "text_en": " Narrated Anas:                     Um (the mother of) Haritha came to Allah's Apostle after Haritha had been martyred on the Day (of the battle) of Badr by an arrow thrown by an unknown person. She said, \"O Allah's Apostle! You know the position of Haritha in my heart (i.e. how dear to me he was), so if he is in Paradise, I will not weep for him, or otherwise, you will see what I will do.\" The Prophet said, \"Are you mad? Is there only one Paradise? There are many Paradises, and he is in the highest Paradise of Firdaus.\" The Prophet added, \"A forenoon journey or an after noon journey in Allah's Cause is better than the whole world and whatever is in it; and a place equal to an arrow bow of anyone of you, or a place equal to a foot in Paradise is better than the whole world and whatever is in it; and if one of the women of Paradise looked at the earth, she would fill the whole space between them (the earth and the heaven) with light, and would fill whatever is in between them, with perfume, and the veil of her face is better than the whole world and whatever is in it.\"",
      "chain": [
        "30367",
        "20155",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "6650",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا إسماعيل بن جعفر، عن عمرو، عن سعيد بن أبي سعيد المقبري، عن أبي هريرة  رضى الله عنه  أنه قال قلت يا رسول الله من أسعد الناس بشفاعتك يوم القيامة فقال ‏\"‏ لقد ظننت يا أبا هريرة أن لا يسألني عن هذا الحديث أحد أول منك، لما رأيت من حرصك على الحديث، أسعد الناس بشفاعتي يوم القيامة من قال لا إله إلا الله‏.‏ خالصا من قبل نفسه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I said, \"O Allah's Apostle! Who will be the luckiest person who will gain your intercession on the Day of Resurrection?\" The Prophet said, \"O Abu Huraira! I have thought that none will ask me about this Hadith before you, as I know your longing for the (learning of) Hadiths. The luckiest person who will have my intercession on the Day of Resurrection will be the one who said, 'None has the right to be worshipped but Allah,' sincerely from the bottom of his heart.\"",
      "chain": [
        "30367",
        "20155",
        "20377",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "6709",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا قتيبة بن سعيد، عن إسماعيل بن جعفر، عن عبد الله بن دينار، عن ابن عمر  رضى الله عنهما  قال بعث رسول الله صلى الله عليه وسلم بعثا وأمر عليهم أسامة بن زيد، فطعن بعض الناس في إمرته فقام رسول الله صلى الله عليه وسلم فقال ‏\"‏ إن كنتم تطعنون في إمرته فقد كنتم تطعنون، في إمرة أبيه من قبل، وايم الله إن كان لخليقا للإمارة، وإن كان لمن أحب الناس إلى، وإن هذا لمن أحب الناس إلى بعده ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle sent an army detachment and made Usama bin Zaid its commander. Some people criticized (spoke badly of) Usama's leadership. So Allah's Apostle got up saying, \"If you people are criticizing Usama's leadership, you have already criticized the leadership of his father before. But Waaimullah (i.e., By Allah), he (i.e. Zaid) deserved the leadership, and he was one of the most beloved persons to me; and now this (his son Usama) is one of the dearest persons to me after him.\" (See Hadith No. 765, Vol. 5)",
      "chain": [
        "30367",
        "20155",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "7042",
      "source": " Sahih Bukhari ",
      "chapter": "Tricks - كتاب الحيل",
      "chapter_no": "91",
      "text_ar": "حدثنا قتيبة، حدثنا إسماعيل بن جعفر، عن أبي سهيل، عن أبيه، عن طلحة بن عبيد الله، أن أعرابيا، جاء إلى رسول الله صلى الله عليه وسلم ثائر الرأس فقال يا رسول الله أخبرني ماذا فرض الله على من الصلاة فقال ‏\"‏ الصلوات الخمس، إلا أن تطوع شيئا ‏\"‏‏.‏ فقال أخبرني بما فرض الله على من الصيام قال ‏\"‏ شهر رمضان، إلا أن تطوع شيئا ‏\"‏‏.‏ قال أخبرني بما فرض الله على من الزكاة قال فأخبره رسول الله صلى الله عليه وسلم شرائع الإسلام‏.‏ قال والذي أكرمك لا أتطوع شيئا ولا أنقص مما فرض الله على شيئا‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أفلح إن صدق ‏\"‏‏.‏ أو ‏\"‏ دخل الجنة إن صدق ‏\"‏‏.‏ وقال بعض الناس في عشرين ومائة بعير حقتان‏.‏ فإن أهلكها متعمدا، أو وهبها أو احتال فيها فرارا من الزكاة، فلا شىء عليه‏.‏",
      "text_en": " Narrated Talha bin 'Ubaidullah:                     A bedouin with unkempt hair came to Allah's Apostle and said, \"O Allah's Apostle! Tell me what Allah has enjoined on me as regards prayers.\" The Prophet said, \"You have to offer perfectly the five (compulsory) prayers in a day and a night (24 hrs.), except if you want to perform some extra optional prayers.\" The bedouin said, \"Tell me what Allah has enjoined on me as regards fasting.\" The Prophet said, \"You have to observe fast during the month of Ramadan except if you fast some extra optional fast.\" The bedouin said, \"Tell me what Allah has enjoined on me as regard Zakat.\" The Prophet then told him the Islamic laws and regulations whereupon the bedouin said, \"By Him Who has honored you, I will not perform any optional deeds of worship and I will not leave anything of what Allah has enjoined on me.\" Allah's Apostle said, \"He will be successful if he has told the truth (or he will enter Paradise if he said the truth).\" And some people said, \"The Zakat for one-hundred and twenty camels is two Hiqqas, and if the Zakat payer slaughters the camels intentionally or gives them as a present or plays some other trick in order to avoid the Zakat, then there is no harm (in it) for him.",
      "chain": [
        "30367",
        "20155",
        "11445",
        "11443",
        "6"
      ]
    },
    {
      "hadith_no": "110",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني يحيى بن أيوب، وقتيبة بن سعيد، جميعا عن إسماعيل بن جعفر، عن أبي سهيل، عن أبيه، عن طلحة بن عبيد الله، عن النبي صلى الله عليه وسلم بهذا الحديث نحو حديث مالك غير أنه قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ أفلح وأبيه إن صدق ‏\"‏ ‏.‏ أو ‏\"‏ دخل الجنة وأبيه إن صدق ‏\"‏ ‏.‏",
      "text_en": " Another hadith, the like of which has been narrated by Malik (b. Anas) (and mentioned above) is also reported by Talha b. 'Ubaidullah, with the only variation that the Holy Prophet remarked:                      By his father, he shall succeed if he were true (to what he professed), or: By his father, he would enter heaven if he were true (to what he professed).",
      "chain": [
        "20379",
        "30367",
        "20155",
        "11445",
        "11443",
        "6"
      ]
    },
    {
      "hadith_no": "181",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، جميعا عن إسماعيل بن جعفر، - قال ابن أيوب حدثنا إسماعيل، - قال أخبرني العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يدخل الجنة من لا يأمن جاره بوائقه ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace and blessing be upon him) observed:                      He will not enter Paradise whose neighbour is not secure from his wrongful conduct.",
      "chain": [
        "20379",
        "30367",
        "20387",
        "20155",
        "11418",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "195",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني يحيى بن أيوب، وقتيبة، وابن، حجر عن إسماعيل بن جعفر، - قال ابن أيوب حدثنا إسماعيل، - قال أخبرني العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الإيمان يمان والكفر قبل المشرق والسكينة في أهل الغنم والفخر والرياء في الفدادين أهل الخيل والوبر ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace and blessings be upon him) observed:                      The belief is among the Yemenites, and the unbelief is towards the East, and tranquillity is among those who rear goats and sheep, and pride and simulation is among the uncivil and rude owners of horses and camels.",
      "chain": [
        "20379",
        "30367",
        "20155",
        "11418",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "220",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، - واللفظ ليحيى - قالا حدثنا إسماعيل بن جعفر، قال أخبرني أبو سهيل، نافع بن مالك بن أبي عامر عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ آية المنافق ثلاث إذا حدث كذب وإذا وعد أخلف وإذا ائتمن خان ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Abu Huraira that the Messenger of Allah (may peace and blessings be upon him) said:                      Three are the signs of a hypocrite: when he spoke he told a lie, when he made a promise he acted treacherously against it, when he was trusted he betrayed.",
      "chain": [
        "20379",
        "30367",
        "20155",
        "29225",
        "13"
      ]
    },
    {
      "hadith_no": "225",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا يحيى بن يحيى التميمي، ويحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، جميعا عن إسماعيل بن جعفر، قال يحيى بن يحيى أخبرنا إسماعيل بن جعفر، عن عبد الله بن دينار، أنه سمع ابن عمر، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما امرئ قال لأخيه يا كافر ‏.‏ فقد باء بها أحدهما إن كان كما قال وإلا رجعت عليه ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Ibn 'Umar that the Messenger of Allah (may peace and blessings be upon him) said:                      Any person who called his brother: or unbeliever (has in fact done an act by which this unbelief) would return to one of them. If it were so, as he asserted (then the unbelief of man was confirmed but if it was not true), then it returned to him (to the man who labeled it on his brother Muslim).",
      "chain": [
        "30399",
        "20379",
        "30367",
        "20387",
        "20155",
        "30399",
        "20155",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "253",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا يحيى بن أيوب، وقتيبة، وابن، حجر قالوا حدثنا إسماعيل، - وهو ابن جعفر - عن عمرو بن أبي عمرو، عن المقبري، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثل معنى حديث ابن عمر عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " A hadith like this as narrated by Ibn 'Umar has also been transmitted by Abu Huraira.",
      "chain": [
        "20379",
        "30367",
        "20155",
        "11209",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "295",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني يحيى بن أيوب، وقتيبة، وابن، حجر جميعا عن إسماعيل بن جعفر، - قال ابن أيوب حدثنا إسماعيل، - قال أخبرني العلاء، عن أبيه، عن أبي هريرة، ‏.‏ أن رسول الله صلى الله عليه وسلم مر على صبرة طعام فأدخل يده فيها فنالت أصابعه بللا فقال ‏\"‏ ما هذا يا صاحب الطعام ‏\"‏ ‏.‏ قال أصابته السماء يا رسول الله ‏.‏ قال ‏\"‏ أفلا جعلته فوق الطعام كى يراه الناس من غش فليس مني ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) happened to pass by a heap of eatables (corn). He thrust his hand in that (heap) and his fingers were moistened. He said to the owner of that heap of eatables (corn):                      What is this? He replied: Messenger of Allah, these have been drenched by rainfall. He (the Holy Prophet) remarked: Why did you not place this (the drenched part of the heap) over other eatables so that the people could see it? He who deceives is not of me (is not my follower).",
      "chain": [
        "20379",
        "30367",
        "20155",
        "11418",
        "10606",
        "11884"
      ]
    },
    {
      "hadith_no": "328",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني يحيى بن أيوب، وقتيبة، وابن، حجر جميعا عن إسماعيل بن جعفر، - قال ابن أيوب حدثنا إسماعيل، - قال أخبرني العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بادروا بالأعمال فتنا كقطع الليل المظلم يصبح الرجل مؤمنا ويمسي كافرا أو يمسي مؤمنا ويصبح كافرا يبيع دينه بعرض من الدنيا ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) observed:                      Be prompt in doing good deeds (before you are overtaken) by turbulence which would be like a part of the dark night. During (that stormy period) a man would be a Muslim in the morning and an unbeliever in the evening or he would be a believer in the evening and an unbeliever in the morning, and would sell his faith for worldly goods.",
      "chain": [
        "20379",
        "30367",
        "20155",
        "11418",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "350",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة، وابن، حجر قالوا حدثنا إسماعيل، - وهو ابن جعفر - عن العلاء، عن أبيه، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ قال الله عز وجل إذا هم عبدي بحسنة ولم يعملها كتبتها له حسنة فإن عملها كتبتها عشر حسنات إلى سبعمائة ضعف وإذا هم بسيئة ولم يعملها لم أكتبها عليه فإن عملها كتبتها سيئة واحدة ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) observed:                      Allah, the Great and Glorious, said: Whenever my bondsman intends to do good, but does not do it, I write one good act for him, but if he puts it into practice I wrote from ten to seven hundred good deeds in favour of him. When he intends to commit an evil, but does not actually do it, do not record it. But if he does it, I write only one evil.",
      "chain": [
        "20379",
        "30367",
        "20155",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "370",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، جميعا عن إسماعيل بن جعفر، - قال ابن أيوب حدثنا إسماعيل بن جعفر، - قال أخبرنا العلاء، - وهو ابن عبد الرحمن مولى الحرقة - عن معبد بن كعب السلمي، عن أخيه عبد الله بن كعب، عن أبي أمامة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من اقتطع حق امرئ مسلم بيمينه فقد أوجب الله له النار وحرم عليه الجنة ‏\"‏ ‏.‏ فقال له رجل وإن كان شيئا يسيرا يا رسول الله قال ‏\"‏ وإن قضيبا من أراك ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Umama that the Messenger of Allah (may peace be upon him) observed:                      He who appropriated the right of a Muslim by (swearing a false) oath, Allah would make Hell-fire necessary for him and would declare Paradise forbidden for him. A person said to him: Messenger of Allah, even if it is something insignificant? He (the Holy Prophet) replied: (Yes) even if it is the twig of the arak tree.",
      "chain": [
        "20379",
        "30367",
        "20387",
        "20155",
        "20155",
        "1131",
        "405"
      ]
    },
    {
      "hadith_no": "233",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، كلهم عن إسماعيل، - قال ابن أيوب حدثنا إسماعيل بن جعفر، - أخبرني العلاء بن عبد الرحمن بن يعقوب، مولى الحرقة عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الصلاة الخمس والجمعة إلى الجمعة كفارة لما بينهن ما لم تغش الكبائر ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: Five prayers and from one Friday prayer to (the next) Friday prayer is an expiation (of the sins committed in between their intervals) if major sins are not committed.",
      "chain": [
        "20379",
        "30367",
        "20387",
        "20208",
        "20155",
        "29225",
        "13"
      ]
    }
  ],
  "total_hadiths": 188
}