{
  "id": "20169",
  "name": "Falayh bin Suliaman فليح بن سليمان",
  "full_name": "Falayh bin Suliaman فليح بن سليمان",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "168",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ع  -  صدوق ]"
    ],
    "tags": [
      "al-Khuza'i",
      "al-Aslami",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "20178",
      "name": "Muhammad bin Flyh bin Sulaiman محمد بن فليح بن سليمان الأسلمي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "teachers": [
    {
      "id": "11186",
      "name": "'Abdullah bin 'Abdur Rahman bin Ma'mar عبد الله بن عبد الرحمن بن معمر",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11225",
      "name": "Na'eem bin 'Abdullah al-Majmar نعيم بن عبد الله المجمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11162",
      "name": "Rabi'ya bin Abi 'Abdur Rahman ربيعة بن أبي عبد الرحمن - ربيعة الرأي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11163",
      "name": "Zayd bin Aslam زيد بن أسلم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11167",
      "name": "Sa'id bin al-Harith bin Abi Sa'id سعيد بن الحارث بن أبي سعيد",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11164",
      "name": "Salm Abi al-Nadr سالم بن أبي أمية - أبو النضر",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11172",
      "name": "Abu Hazim, Salma bin Dinar سلمة بن دينار أبو حازم الأعرج",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11697",
      "name": "'Abbas bin Sahl bin Sa'd عباس بن سهل بن سعد الساعدي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11861",
      "name": "Dmrh bin Sa'id bin Aby ضمرة بن سعيد بن أبي حنة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10530",
      "name": "'Abdur Rahman bin al-Qasim عبد الرحمن بن القاسم بن محمد بن أبي بكر",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "23507",
      "name": "Salah bin 'Ajalan Hijazi صالح بن عجلان حجازي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11173",
      "name": "Suhayl bin Abi Salah سهيل بن أبي صالح",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11104",
      "name": "'Abdullah bin Abi Bakr bin Muh. b. 'Amr عبد الله بن أبي بكر بن محمد بن عمرو",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11525",
      "name": "'Uthman bin 'Abdur Rahman bin 'Uthman عثمان بن عبد الرحمن بن عثمان بن عبد الله",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10606",
      "name": "al-Ala' bin 'Abdur Rahman bin Ya'qub العلاء بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11229",
      "name": "Hilal bin Abi Maymuna هلال بن علي بن أسامة",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "11245",
      "name": "Ziyad bin Sa'd bin 'Abdur Rahman زياد بن سعد بن عبد الرحمن الخراساني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11340",
      "name": "Zayd bin Abi Anisa زيد بن أبي أنيسة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20178",
      "name": "Muhammad bin Flyh bin Sulaiman محمد بن فليح بن سليمان الأسلمي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20443",
      "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20393",
      "name": "Yonus bin Muhammad bin Muslim يونس بن محمد بن مسلم المؤدب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20183",
      "name": "Yahya bin Wadh يحيى بن واضح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30247",
      "name": "al-Husain bin Ibrahim bin al-Hur الحسين بن إبراهيم بن الحر",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20650",
      "name": "Zayd bin al-Habab al-'Akli زيد بن الحباب أبو الحسين العكلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20262",
      "name": "'Uthman bin 'Umar bin Fars عثمان بن عمر بن فارس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20470",
      "name": "Yahya bin Salah al-Wahadi يحيى بن صالح الوحاظي أبو زكريا",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "38640",
      "name": "al-Ma'afa bin Sulaiman al-Jzry المعافى بن سليمان الجزري أبو محمد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "34207",
      "name": "Muhammad bin Snan bin Yazid محمد بن سنان بن يزيد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30250",
      "name": "Surayj bin al-Nu'man al-Juhari سريج بن النعمان الجوهري اللؤلؤي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20301",
      "name": "Yahya bin 'Aabad al-Daba'i يحيى بن عباد الضبعي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30116",
      "name": "Sa'id bin Mnswr bin Sh'bh سعيد بن منصور بن شعبة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30211",
      "name": "Muhammad bin al-Salt bin al-Hajjaj محمد بن الصلت بن الحجاج الأسدي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30137",
      "name": "Sulaiman bin Da'ud al-'Atki al-Zahrani سليمان بن داود أبو الربيع الزهراني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30523",
      "name": "Mansur bin Abi Mazahim منصور بن أبي مزاحم بشير التركي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30512",
      "name": "Muhammad bin Bkar bin al-Ryan محمد بن بكار بن الريان الهاشمي مولاهم",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "59",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن سنان، قال حدثنا فليح، ح وحدثني إبراهيم بن المنذر، قال حدثنا محمد بن فليح، قال حدثني أبي قال، حدثني هلال بن علي، عن عطاء بن يسار، عن أبي هريرة، قال بينما النبي صلى الله عليه وسلم في مجلس يحدث القوم جاءه أعرابي فقال متى الساعة فمضى رسول الله صلى الله عليه وسلم يحدث، فقال بعض القوم سمع ما قال، فكره ما قال، وقال بعضهم بل لم يسمع، حتى إذا قضى حديثه قال ‏\"‏ أين  أراه  السائل عن الساعة ‏\"‏‏.‏ قال ها أنا يا رسول الله‏.‏ قال ‏\"‏ فإذا ضيعت الأمانة فانتظر الساعة ‏\"‏‏.‏ قال كيف إضاعتها قال ‏\"‏ إذا وسد الأمر إلى غير أهله فانتظر الساعة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     While the Prophet was saying something in a gathering, a Bedouin came and asked him, \"When would the Hour (Doomsday) take place?\" Allah's Apostle continued his talk, so some people said that Allah's Apostle had heard the question, but did not like what that Bedouin had asked. Some of them said that Allah's Apostle had not heard it. When the Prophet finished his speech, he said, \"Where is the questioner, who inquired about the Hour (Doomsday)?\" The Bedouin said, \"I am here, O Allah's Apostle .\" Then the Prophet said, \"When honesty is lost, then wait for the Hour (Doomsday).\" The Bedouin said, \"How will that be lost?\" The Prophet said, \"When the power or authority comes in the hands of unfit persons, then wait for the Hour (Doomsday.)\"",
      "chain": [
        "34207",
        "20169",
        "30308",
        "20178",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "158",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا حسين بن عيسى، قال حدثنا يونس بن محمد، قال حدثنا فليح بن سليمان، عن عبد الله بن أبي بكر بن عمرو بن حزم، عن عباد بن تميم، عن عبد الله بن زيد، أن النبي صلى الله عليه وسلم توضأ مرتين مرتين‏.‏",
      "text_en": " Narrated `Abdullah bin Zaid:                     The Prophet performed ablution by washing the body parts twice.",
      "chain": [
        "30326",
        "20393",
        "20169",
        "11104",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "361",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا يحيى بن صالح، قال حدثنا فليح بن سليمان، عن سعيد بن الحارث، قال سألنا جابر بن عبد الله عن الصلاة، في الثوب الواحد فقال خرجت مع النبي صلى الله عليه وسلم في بعض أسفاره، فجئت ليلة لبعض أمري، فوجدته يصلي وعلى ثوب واحد، فاشتملت به وصليت إلى جانبه، فلما انصرف قال ‏\"‏ ما السرى يا جابر ‏\"‏‏.‏ فأخبرته بحاجتي، فلما فرغت قال ‏\"‏ ما هذا الاشتمال الذي رأيت ‏\"‏‏.‏ قلت كان ثوب‏.‏ يعني ضاق‏.‏ قال ‏\"‏ فإن كان واسعا فالتحف به، وإن كان ضيقا فاتزر به ‏\"‏‏.‏",
      "text_en": " Narrated Sa`id bin Al-Harith:                     I asked Jabir bin `Abdullah about praying in a single garment. He said, \"I traveled with the Prophet during some of his journeys, and I came to him at night for some purpose and I found him praying. At that time, I was wearing a single garment with which I covered my shoulders and prayed by his side. When he finished the prayer, he asked, 'O Jabir! What has brought you here?' I told him what I wanted. When I finished, he asked, 'O Jabir! What is this garment which I have seen and with which you covered your shoulders?' I replied, 'It is a (tight) garment.' He said, 'If the garment is large enough, wrap it round the body (covering the shoulders) and if it is tight (too short) then use it as an Izar (tie it around your waist only.)' \"",
      "chain": [
        "20470",
        "20169",
        "11167",
        "34"
      ]
    },
    {
      "hadith_no": "419",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا يحيى بن صالح، قال حدثنا فليح بن سليمان، عن هلال بن علي، عن أنس بن مالك، قال صلى بنا النبي صلى الله عليه وسلم صلاة ثم رقي المنبر، فقال في الصلاة وفي الركوع ‏\"‏ إني لأراكم من ورائي كما أراكم ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet led us in a prayer and then got up on the pulpit and said, \"In your prayer and bowing, I certainly see you from my back as I see you (while looking at you.)\"",
      "chain": [
        "20470",
        "20169",
        "11229",
        "19"
      ]
    },
    {
      "hadith_no": "466",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن سنان، قال حدثنا فليح، قال حدثنا أبو النضر، عن عبيد بن حنين، عن بسر بن سعيد، عن أبي سعيد الخدري، قال خطب النبي صلى الله عليه وسلم فقال ‏\"‏ إن الله خير عبدا بين الدنيا وبين ما عنده، فاختار ما عند الله ‏\"‏‏.‏ فبكى أبو بكر  رضى الله عنه  فقلت في نفسي ما يبكي هذا الشيخ إن يكن الله خير عبدا بين الدنيا وبين ما عنده فاختار ما عند الله، فكان رسول الله صلى الله عليه وسلم هو العبد، وكان أبو بكر أعلمنا‏.‏ قال ‏\"‏ يا أبا بكر لا تبك، إن أمن الناس على في صحبته وماله أبو بكر، ولو كنت متخذا خليلا من أمتي لاتخذت أبا بكر، ولكن أخوة الإسلام ومودته، لا يبقين في المسجد باب إلا سد إلا باب أبي بكر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet delivered a sermon and said, \"Allah gave a choice to one of (His) slaves either to choose this world or what is with Him in the Hereafter. He chose the latter.\" Abu Bakr wept. I said to myself, \"Why is this Sheikh weeping, if Allah gave choice to one (of His) slaves either to choose this world or what is with Him in the Here after and he chose the latter?\" And that slave was Allah's Apostle himself. Abu Bakr knew more than us. The Prophet said, \"O Abu Bakr! Don't weep. The Prophet added: Abu- Bakr has favored me much with his property and company. If I were to take a Khalil from mankind I would certainly have taken Abu Bakr but the Islamic brotherhood and friendship is sufficient. Close all the gates in the mosque except that of Abu Bakr.",
      "chain": [
        "34207",
        "20169",
        "20390",
        "11202",
        "11153",
        "38"
      ]
    },
    {
      "hadith_no": "749",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن سنان، قال حدثنا فليح، قال حدثنا هلال بن علي، عن أنس بن مالك، قال صلى لنا النبي صلى الله عليه وسلم ثم رقا المنبر، فأشار بيديه قبل قبلة المسجد ثم قال ‏\"‏ لقد رأيت الآن منذ صليت لكم الصلاة الجنة والنار ممثلتين في قبلة هذا الجدار، فلم أر كاليوم في الخير والشر ‏\"‏ ثلاثا‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet led us in prayer and then went up to the pulpit and beckoned with both hands towards the Qibla of the mosque and then said, \"When I started leading you in prayer, I saw the display of Paradise and Hell on the wall of the mosque (facing the Qibla). I never saw good and bad as I have seen today.\" He repeated the last statement thrice.",
      "chain": [
        "34207",
        "20169",
        "11229",
        "19"
      ]
    },
    {
      "hadith_no": "825",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا يحيى بن صالح، قال حدثنا فليح بن سليمان، عن سعيد بن الحارث، قال صلى لنا أبو سعيد فجهر بالتكبير حين رفع رأسه من السجود، وحين سجد، وحين رفع، وحين قام من الركعتين وقال هكذا رأيت النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Sa`id bin Al-Harith:                     Abu Sa`id led us in the prayer and said the Takbir aloud on arising from the prostration, and on prostrating, on rising again, and on getting up from the second rak`a. Abu Sa`id said, \"I saw the Prophet doing the same.\"",
      "chain": [
        "20470",
        "20169",
        "11167"
      ]
    },
    {
      "hadith_no": "872",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا سعيد بن منصور، حدثنا فليح، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، رضى الله عنها أن رسول الله صلى الله عليه وسلم كان يصلي الصبح بغلس فينصرفن نساء المؤمنين، لا يعرفن من الغلس، أو لا يعرف بعضهن بعضا‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle used to offer the Fajr prayer when it was still dark and the believing women used to return (after finishing their prayer) and nobody could recognize them owing to darkness, or they could not recognize one another.",
      "chain": [
        "30221",
        "30116",
        "20169",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "904",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا سريج بن النعمان، قال حدثنا فليح بن سليمان، عن عثمان بن عبد الرحمن بن عثمان التيمي، عن أنس بن مالك، رضى الله عنه أن النبي صلى الله عليه وسلم كان يصلي الجمعة حين تميل الشمس‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet used to offer the Jumua prayer immediately after midday.",
      "chain": [
        "30250",
        "20169",
        "11525",
        "19"
      ]
    },
    {
      "hadith_no": "986",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد، قال أخبرنا أبو تميلة، يحيى بن واضح عن فليح بن سليمان، عن سعيد بن الحارث، عن جابر، قال كان النبي صلى الله عليه وسلم إذا كان يوم عيد خالف الطريق‏.‏ تابعه يونس بن محمد عن فليح‏.‏ وحديث جابر أصح‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     On the Day of `Id the Prophet used to return (after offering the `Id prayer) through a way different from that by which he went.",
      "chain": [
        "30213",
        "20169",
        "11167",
        "34"
      ]
    },
    {
      "hadith_no": "1285",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا أبو عامر، حدثنا فليح بن سليمان، عن هلال بن علي، عن أنس بن مالك  رضى الله عنه  قال شهدنا بنتا لرسول الله صلى الله عليه وسلم قال ورسول الله صلى الله عليه وسلم جالس على القبر  قال فرأيت عينيه تدمعان قال  فقال ‏\"‏ هل منكم رجل لم يقارف الليلة ‏\"‏‏.‏ فقال أبو طلحة أنا‏.‏ قال ‏\"‏ فانزل ‏\"‏‏.‏ قال فنزل في قبرها‏.‏",
      "text_en": " Narrated Anas bin Malik:                     We were (in the funeral procession) of one of the daughters of the Prophet and he was sitting by the side of the grave. I saw his eyes shedding tears. He said, \"Is there anyone among you who did not have sexual relations with his wife last night?\" Abu Talha replied in the affirmative. And so the Prophet told him to get down in the grave. And so he got down in her grave.",
      "chain": [
        "30351",
        "20443",
        "20169",
        "11229",
        "19"
      ]
    },
    {
      "hadith_no": "1342",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح بن سليمان، حدثنا هلال بن علي، عن أنس  رضى الله عنه  قال شهدنا بنت رسول الله صلى الله عليه وسلم ورسول الله صلى الله عليه وسلم جالس على القبر، فرأيت عينيه تدمعان فقال ‏\"‏ هل فيكم من أحد لم يقارف الليلة ‏\"‏‏.‏ فقال أبو طلحة أنا‏.‏ قال ‏\"‏ فانزل في قبرها ‏\"‏‏.‏ فنزل في قبرها فقبرها‏.‏ قال ابن المبارك قال فليح أراه يعني الذنب‏.‏ قال أبو عبد الله ‏{‏ليقترفوا‏}‏ أى ليكتسبوا‏.‏",
      "text_en": " Narrated Anas:                     We were in the funeral procession of the daughter of Allah's Apostle and Allah's Apostle was sitting near the grave and I saw his eyes full of tears. He said, \"Is there anyone amongst you who did not have sexual relations with his wife last night?\" Abu Talha replied in the affirmative. And so Allah's Apostle told him to get down in her grave and he got down in her grave and buried her.",
      "chain": [
        "34207",
        "20169",
        "11229",
        "19"
      ]
    },
    {
      "hadith_no": "1579",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا سليمان بن داود أبو الربيع، حدثنا فليح، عن نافع، قال كان ابن عمر  رضى الله عنهما  إذا أراد الخروج إلى مكة ادهن بدهن ليس له رائحة طيبة، ثم يأتي مسجد الحليفة فيصلي ثم يركب، وإذا استوت به راحلته قائمة أحرم، ثم قال هكذا رأيت النبي صلى الله عليه وسلم يفعل‏.‏",
      "text_en": " Narrated Nafi`:                     Whenever Ibn `Umar intended to go to Mecca he used to oil himself with a sort of oil that had no pleasant smell, then he would go to the Mosque of Al-Hulaita and offer the prayer, and then ride. When he mounted well on his Mount and the Mount stood up straight, he would proclaim the intention of assuming Ihram, and he used to say that he had seen the Prophet doing the same.",
      "chain": [
        "30584",
        "20169",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1629",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثني محمد، حدثنا سريج بن النعمان، حدثنا فليح، عن نافع، عن ابن عمر  رضى الله عنهما  قال سعى النبي صلى الله عليه وسلم ثلاثة أشواط ومشى أربعة في الحج والعمرة‏.‏   تابعه الليث قال حدثني كثير بن فرقد، عن نافع، عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Prophet did Ramal in (first) three rounds (of Tawaf), and walked in the remaining four, in Hajj and Umra.",
      "chain": [
        "30213",
        "30250",
        "20169",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2125",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح، حدثنا هلال، عن عطاء بن يسار، قال لقيت عبد الله بن عمرو بن العاص  رضى الله عنهما  قلت أخبرني عن صفة، رسول الله صلى الله عليه وسلم في التوراة‏.‏ قال أجل، والله إنه لموصوف في التوراة ببعض صفته في القرآن يا أيها النبي إنا أرسلناك شاهدا ومبشرا ونذيرا، وحرزا للأميين، أنت عبدي ورسولي سميتك المتوكل، ليس بفظ ولا غليظ ولا سخاب في الأسواق، ولا يدفع بالسيئة السيئة ولكن يعفو ويغفر، ولن يقبضه الله حتى يقيم به الملة العوجاء بأن يقولوا لا إله إلا الله‏.‏ ويفتح بها أعينا عميا، وآذانا صما، وقلوبا غلفا‏.‏ تابعه عبد العزيز بن أبي سلمة عن هلال‏.‏ وقال سعيد عن هلال عن عطاء عن ابن سلام‏.‏ غلف كل شىء في غلاف، سيف أغلف، وقوس غلفاء، ورجل أغلف إذا لم يكن مختونا‏.‏",
      "text_en": " Narrated Ata bin Yasar:                     I met `Abdullah bin `Amr bin Al-`As and asked him, \"Tell me about the description of Allah's Apostle which is mentioned in Torah (i.e. Old Testament.\") He replied, 'Yes. By Allah, he is described in Torah with some of the qualities attributed to him in the Qur'an as follows: \"O Prophet ! We have sent you as a witness (for Allah's True religion) And a giver of glad tidings (to the faithful believers), And a warner (to the unbelievers) And guardian of the illiterates. You are My slave and My messenger (i.e. Apostle). I have named you \"Al-Mutawakkil\" (who depends upon Allah). You are neither discourteous, harsh Nor a noisemaker in the markets And you do not do evil to those Who do evil to you, but you deal With them with forgiveness and kindness. Allah will not let him (the Prophet) Die till he makes straight the crooked people by making them say: \"None has the right to be worshipped but Allah,\" With which will be opened blind eyes And deaf ears and enveloped hearts.\"",
      "chain": [
        "34207",
        "20169",
        "11229",
        "11020"
      ]
    },
    {
      "hadith_no": "2348",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح، حدثنا هلال، وحدثنا عبد الله بن محمد، حدثنا أبو عامر، حدثنا فليح، عن هلال بن علي، عن عطاء بن يسار، عن أبي هريرة  رضى الله عنه  أن النبي صلى الله عليه وسلم كان يوما يحدث وعنده رجل من أهل البادية ‏\"‏ أن رجلا من أهل الجنة استأذن ربه في الزرع فقال له ألست فيما شئت قال بلى ولكني أحب أن أزرع‏.‏ قال فبذر فبادر الطرف نباته واستواؤه واستحصاده، فكان أمثال الجبال فيقول الله دونك يا ابن آدم، فإنه لا يشبعك شىء ‏\"‏‏.‏ فقال الأعرابي والله لا تجده إلا قرشيا أو أنصاريا، فإنهم أصحاب زرع، وأما نحن فلسنا بأصحاب زرع‏.‏ فضحك النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     Once the Prophet was narrating (a story), while a bedouin was sitting with him. \"One of the inhabitants of Paradise will ask Allah to allow him to cultivate the land. Allah will ask him, 'Are you not living in the pleasures you like?' He will say, 'Yes, but I like to cultivate the land.' \" The Prophet added, \"When the man (will be permitted he) will sow the seeds and the plants will grow up and get ripe, ready for reaping and so on till it will be as huge as mountains within a wink. Allah will then say to him, 'O son of Adam! Take here you are, gather (the yield); nothing satisfies you.' \" On that, the bedouin said, \"The man must be either from Quraish (i.e. an emigrant) or an Ansari, for they are farmers, whereas we are not farmers.\" The Prophet smiled (at this).",
      "chain": [
        "34207",
        "20169",
        "11229",
        "30351",
        "20443",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "2378",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا محمد بن فليح، قال حدثني أبي، عن هلال بن علي، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من حق الإبل أن تحلب على الماء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"One of the rights of a she camel is that it should be milked at a place of water.\"",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "2399",
      "source": " Sahih Bukhari ",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا أبو عامر، حدثنا فليح، عن هلال بن علي، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة  رضى الله عنه  أن النبي صلى الله عليه وسلم قال ‏\"‏ ما من مؤمن إلا وأنا أولى به في الدنيا والآخرة اقرءوا إن شئتم ‏{‏النبي أولى بالمؤمنين من أنفسهم‏}‏ فأيما مؤمن مات وترك مالا فليرثه عصبته من كانوا، ومن ترك دينا أو ضياعا فليأتني فأنا مولاه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"I am closer to the believers than their selves in this world and in the Hereafter, and if you like, you can read Allah's Statement: \"The Prophet is closer to the believers than their own selves.\" (33.6) So, if a true believer dies and leaves behind some property, it will be for his inheritors (from the father's side), and if he leaves behind some debt to be paid or needy offspring, then they should come to me as I am the guardian of the deceased.\"",
      "chain": [
        "30351",
        "20443",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "2661",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا أبو الربيع، سليمان بن داود وأفهمني بعضه أحمد حدثنا فليح بن سليمان، عن ابن شهاب الزهري، عن عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص الليثي، وعبيد الله بن عبد الله بن عتبة، عن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا، فبرأها الله منه، قال الزهري، وكلهم حدثني طائفة من حديثها وبعضهم أوعى من بعض، وأثبت له اقتصاصا، وقد وعيت عن كل واحد منهم الحديث الذي حدثني عن عائشة، وبعض حديثهم يصدق بعضا‏.‏ زعموا أن عائشة قالت كان رسول الله صلى الله عليه وسلم إذا أراد أن يخرج سفرا أقرع بين أزواجه، فأيتهن خرج سهمها خرج بها معه، فأقرع بيننا في غزاة غزاها فخرج سهمي، فخرجت معه بعد ما أنزل الحجاب، فأنا أحمل في هودج وأنزل فيه، فسرنا حتى إذا فرغ رسول الله صلى الله عليه وسلم من غزوته تلك، وقفل ودنونا من المدينة، آذن ليلة بالرحيل، فقمت حين آذنوا بالرحيل، فمشيت حتى جاوزت الجيش، فلما قضيت شأني أقبلت إلى الرحل، فلمست صدري، فإذا عقد لي من جزع أظفار قد انقطع، فرجعت فالتمست عقدي، فحبسني ابتغاؤه، فأقبل الذين يرحلون لي، فاحتملوا هودجي فرحلوه على بعيري الذي كنت أركب، وهم يحسبون أني فيه، وكان النساء إذ ذاك خفافا لم يثقلن ولم يغشهن اللحم، وإنما يأكلن العلقة من الطعام، فلم يستنكر القوم حين رفعوه ثقل الهودج فاحتملوه وكنت جارية حديثة السن، فبعثوا الجمل وساروا، فوجدت عقدي بعد ما استمر الجيش، فجئت منزلهم وليس فيه أحد، فأممت منزلي الذي كنت به فظننت أنهم سيفقدوني فيرجعون إلى، فبينا أنا جالسة غلبتني عيناى فنمت، وكان صفوان بن المعطل السلمي ثم الذكواني من وراء الجيش، فأصبح عند منزلي فرأى سواد إنسان نائم فأتاني، وكان يراني قبل الحجاب فاستيقظت باسترجاعه حين أناخ راحلته، فوطئ يدها فركبتها فانطلق يقود بي الراحلة، حتى أتينا الجيش بعد ما نزلوا معرسين في نحر الظهيرة، فهلك من هلك، وكان الذي تولى الإفك عبد الله بن أبى ابن سلول، فقدمنا المدينة فاشتكيت بها شهرا، يفيضون من قول أصحاب الإفك، ويريبني في وجعي أني لا أرى من النبي صلى الله عليه وسلم اللطف الذي كنت أرى منه حين أمرض، إنما يدخل فيسلم ثم يقول ‏\"‏ كيف تيكم ‏\"‏‏.‏ لا أشعر بشىء من ذلك حتى نقهت، فخرجت أنا وأم مسطح قبل المناصع متبرزنا، لا نخرج إلا ليلا إلى ليل، وذلك قبل أن نتخذ الكنف قريبا من بيوتنا، وأمرنا أمر العرب الأول في البرية أو في التنزه، فأقبلت أنا وأم مسطح بنت أبي رهم نمشي، فعثرت في مرطها فقالت تعس مسطح، فقلت لها بئس ما قلت، أتسبين رجلا شهد بدرا فقالت يا هنتاه ألم تسمعي ما قالوا فأخبرتني بقول أهل الإفك، فازددت مرضا إلى مرضي، فلما رجعت إلى بيتي دخل على رسول الله صلى الله عليه وسلم فسلم فقال ‏\"‏ كيف تيكم ‏\"‏‏.‏ فقلت ائذن لي إلى أبوى‏.‏ قالت وأنا حينئذ أريد أن أستيقن الخبر من قبلهما، فأذن لي رسول الله صلى الله عليه وسلم فأتيت أبوى فقلت لأمي ما يتحدث به الناس فقالت يا بنية هوني على نفسك الشأن، فوالله لقلما كانت امرأة قط وضيئة عند رجل يحبها ولها ضرائر إلا أكثرن عليها‏.‏ فقلت سبحان الله ولقد يتحدث الناس بهذا قالت فبت تلك الليلة حتى أصبحت لا يرقأ لي دمع ولا أكتحل بنوم، ثم أصبحت فدعا رسول الله صلى الله عليه وسلم علي بن أبي طالب وأسامة بن زيد حين استلبث الوحى، يستشيرهما في فراق أهله، فأما أسامة فأشار عليه بالذي يعلم في نفسه من الود لهم، فقال أسامة أهلك يا رسول الله ولا نعلم والله إلا خيرا، وأما علي بن أبي طالب فقال يا رسول الله لم يضيق الله عليك والنساء سواها كثير، وسل الجارية تصدقك‏.‏ فدعا رسول الله صلى الله عليه وسلم بريرة فقال ‏\"‏ يا بريرة هل رأيت فيها شيئا يريبك ‏\"‏‏.‏ فقالت بريرة لا والذي بعثك بالحق، إن رأيت منها أمرا أغمصه عليها أكثر من أنها جارية حديثة السن تنام عن العجين فتأتي الداجن فتأكله‏.‏ فقام رسول الله صلى الله عليه وسلم من يومه، فاستعذر من عبد الله بن أبى ابن سلول فقال رسول الله صلى الله عليه وسلم ‏\"‏ من يعذرني من رجل بلغني أذاه في أهلي، فوالله ما علمت على أهلي إلا خيرا، وقد ذكروا رجلا ما علمت عليه إلا خيرا، وما كان يدخل على أهلي إلا معي ‏\"‏‏.‏ فقام سعد بن معاذ فقال يا رسول الله أنا والله أعذرك منه، إن كان من الأوس ضربنا عنقه، وإن كان من إخواننا من الخزرج أمرتنا ففعلنا فيه أمرك‏.‏ فقام سعد بن عبادة وهو سيد الخزرج، وكان قبل ذلك رجلا صالحا ولكن احتملته الحمية فقال كذبت لعمر الله، لا تقتله ولا تقدر على ذلك، فقام أسيد بن الحضير فقال كذبت لعمر الله، والله لنقتلنه، فإنك منافق تجادل عن المنافقين‏.‏ فثار الحيان الأوس والخزرج حتى هموا، ورسول الله صلى الله عليه وسلم على المنبر فنزل فخفضهم حتى سكتوا وسكت، وبكيت يومي لا يرقأ لي دمع ولا أكتحل بنوم، فأصبح عندي أبواى، قد بكيت ليلتين ويوما حتى أظن أن البكاء فالق كبدي  قالت  فبينا هما جالسان عندي وأنا أبكي إذ استأذنت امرأة من الأنصار فأذنت لها، فجلست تبكي معي، فبينا نحن كذلك إذ دخل رسول الله صلى الله عليه وسلم فجلس، ولم يجلس عندي من يوم قيل في ما قيل قبلها، وقد مكث شهرا لا يوحى إليه في شأني شىء  قالت  فتشهد ثم قال ‏\"‏ يا عائشة فإنه بلغني عنك كذا وكذا، فإن كنت بريئة فسيبرئك الله، وإن كنت ألممت فاستغفري الله وتوبي إليه، فإن العبد إذا اعترف بذنبه ثم تاب تاب الله عليه ‏\"‏‏.‏ فلما قضى رسول الله صلى الله عليه وسلم مقالته قلص دمعي حتى ما أحس منه قطرة وقلت لأبي أجب عني رسول الله صلى الله عليه وسلم‏.‏ قال والله ما أدري ما أقول لرسول الله صلى الله عليه وسلم‏.‏ فقلت لأمي أجيبي عني رسول الله صلى الله عليه وسلم فيما قال‏.‏ قالت والله ما أدري ما أقول لرسول الله صلى الله عليه وسلم‏.‏ قالت وأنا جارية حديثة السن لا أقرأ كثيرا من القرآن فقلت إني والله لقد علمت أنكم سمعتم ما يتحدث به الناس، ووقر في أنفسكم وصدقتم به، ولئن قلت لكم إني بريئة‏.‏ والله يعلم إني لبريئة لا تصدقوني بذلك، ولئن اعترفت لكم بأمر، والله يعلم أني بريئة لتصدقني والله ما أجد لي ولكم مثلا إلا أبا يوسف إذ قال ‏{‏فصبر جميل والله المستعان على ما تصفون‏}‏ ثم تحولت على فراشي، وأنا أرجو أن يبرئني الله، ولكن والله ما ظننت أن ينزل في شأني وحيا، ولأنا أحقر في نفسي من أن يتكلم بالقرآن في أمري، ولكني كنت أرجو أن يرى رسول الله صلى الله عليه وسلم في النوم رؤيا يبرئني الله، فوالله ما رام مجلسه ولا خرج أحد من أهل البيت حتى أنزل عليه، فأخذه ما كان يأخذه من البرحاء، حتى إنه ليتحدر منه مثل الجمان من العرق في يوم شات، فلما سري عن رسول الله صلى الله عليه وسلم وهو يضحك، فكان أول كلمة تكلم بها أن قال لي ‏\"‏ يا عائشة، احمدي الله فقد برأك الله ‏\"‏‏.‏ فقالت لي أمي قومي إلى رسول الله صلى الله عليه وسلم‏.‏ فقلت لا والله، لا أقوم إليه، ولا أحمد إلا الله فأنزل الله تعالى ‏{‏إن الذين جاءوا بالإفك عصبة منكم‏}‏ الآيات، فلما أنزل الله هذا في براءتي قال أبو بكر الصديق  رضى الله عنه  وكان ينفق على مسطح بن أثاثة لقرابته منه والله لا أنفق على مسطح شيئا أبدا بعد ما قال لعائشة‏.‏ فأنزل الله تعالى ‏{‏ولا يأتل أولو الفضل منكم والسعة‏}‏ إلى قوله ‏{‏غفور رحيم‏}‏ فقال أبو بكر بلى، والله إني لأحب أن يغفر الله لي، فرجع إلى مسطح الذي كان يجري عليه‏.‏ وكان رسول الله صلى الله عليه وسلم يسأل زينب بنت جحش عن أمري، فقال ‏\"‏ يا زينب، ما علمت ما رأيت ‏\"‏‏.‏ فقالت يا رسول الله، أحمي سمعي وبصري، والله ما علمت عليها إلا خيرا، قالت وهى التي كانت تساميني، فعصمها الله بالورع‏.‏   قال وحدثنا فليح، عن هشام بن عروة، عن عروة، عن عائشة، وعبد الله بن الزبير، مثله‏.‏ قال وحدثنا فليح، عن ربيعة بن أبي عبد الرحمن، ويحيى بن سعيد، عن القاسم بن محمد بن أبي بكر، مثله‏.‏",
      "text_en": " Narrated Aisha:                     (the wife of the Prophet) \"Whenever Allah's Apostle intended to go on a journey, he would draw lots amongst his wives and would take with him the one upon whom the lot fell. During a Ghazwa of his, he drew lots amongst us and the lot fell upon me, and I proceeded with him after Allah had decreed the use of the veil by women. I was carried in a Howdah (on the camel) and dismounted while still in it. When Allah's Apostle was through with his Ghazwa and returned home, and we approached the city of Medina, Allah's Apostle ordered us to proceed at night. When the order of setting off was given, I walked till I was past the army to answer the call of nature. After finishing I returned (to the camp) to depart (with the others) and suddenly realized that my necklace over my chest was missing. So, I returned to look for it and was delayed because of that. The people who used to carry me on the camel, came to my Howdah and put it on the back of the camel, thinking that I was in it, as, at that time, women were light in weight, and thin and lean, and did not use to eat much. So, those people did not feel the difference in the heaviness of the Howdah while lifting it, and they put it over the camel. At that time I was a young lady. They set the camel moving and proceeded on. I found my necklace after the army had gone, and came to their camp to find nobody. So, I went to the place where I used to stay, thinking that they would discover my absence and come back in my search. While in that state, I felt sleepy and slept. Safwan bin Mu'attal As-Sulami Adh-Dhakwani was behind the army and reached my abode in the morning. When he saw a sleeping person, he came to me, and he used to see me before veiling. So, I got up when I heard him saying, \"Inna lil-lah-wa inn a ilaihi rajiun (We are for Allah, and we will return to Him).\" He made his camel knell down. He got down from his camel, and put his leg on the front legs of the camel and then I rode and sat over it. Safwan set out walking, leading the camel by the rope till we reached the army who had halted to take rest at midday. Then whoever was meant for destruction, fell into destruction, (some people accused me falsely) and the leader of the false accusers was `Abdullah bin Ubai bin Salul. After that we returned to Medina, and I became ill for one month while the people were spreading the forged statements of the false accusers. I was feeling during my ailment as if I were not receiving the usual kindness from the Prophet which I used to receive from him when I got sick. But he would come, greet and say, 'How is that (girl)?' I did not know anything of what was going on till I recovered from my ailment and went out with Um Mistah to the Manasi where we used to answer the call of nature, and we used not to go to answer the call of nature except from night to night and that was before we had lavatories near to our houses. And this habit of ours was similar to the habit of the old 'Arabs in the open country (or away from houses). So. I and Um Mistah bint Ruhm went out walking. Um Mistah stumbled because of her long dress and on that she said, 'Let Mistah be ruined.' I said, 'You are saying a bad word. Why are you abusing a man who took part in (the battle of) Badr?' She said, 'O Hanata (you there) didn't you hear what they said?' Then she told me the rumors of the false accusers. My sickness was aggravated, and when I returned home, Allah's Apostle came to me, and after greeting he said, 'How is that (girl)?' I requested him to allow me to go to my parents. I wanted then to be sure of the news through them I Allah's Apostle allowed me, and I went to my parents and asked my mother, 'What are the people talking about?' She said, 'O my daughter! Don't worry much about this matter. By Allah, never is there a charming woman loved by her husband who has other wives, but the women would forge false news about her.' I said, 'Glorified be Allah! Are the people really taking of this matter?' That night I kept on weeping and could not sleep till morning. In the morning Allah's Apostle called `Ali bin Abu Talib and Usama bin Zaid when he saw the Divine Inspiration delayed, to consul them about divorcing his wife (i.e. `Aisha). Usama bin Zaid said what he knew of the good reputation of his wives and added, 'O Allah's Apostle! Keep you wife, for, by Allah, we know nothing about her but good.' `Ali bin Abu Talib said, 'O Allah's Apostle! Allah has no imposed restrictions on you, and there are many women other than she, yet you may ask the woman-servant who will tell you the truth.' On that Allah's Apostle called Buraira and said, 'O Burair. Did you ever see anything which roused your suspicions about her?' Buraira said, 'No, by Allah Who has sent you with the Truth, I have never seen in her anything faulty except that she is a girl of immature age, who sometimes sleeps and leaves the dough for the goats to eat.' On that day Allah's Apostle ascended the pulpit and requested that somebody support him in punishing `Abdullah bin Ubai bin Salul. Allah's Apostle said, 'Who will support me to punish that person (`Abdullah bin Ubai bin Salul) who has hurt me by slandering the reputation of my family? By Allah, I know nothing about my family but good, and they have accused a person about whom I know nothing except good, and he never entered my house except in my company.' Sa`d bin Mu`adh got up and said, 'O Allah's Apostle! by Allah, I will relieve you from him. If that man is from the tribe of the Aus, then we will chop his head off, and if he is from our brothers, the Khazraj, then order us, and we will fulfill your order.' On that Sa`d bin 'Ubada, the chief of the Khazraj and before this incident, he had been a pious man, got up, motivated by his zeal for his tribe and said, 'By Allah, you have told a lie; you cannot kill him, and you will never be able to kill him.' On that Usaid bin Al-Hadir got up and said (to Sa`d bin 'Ubada), 'By Allah! you are a liar. By Allah, we will kill him; and you are a hypocrite, defending the hypocrites.' On this the two tribes of Aus and Khazraj got excited and were about to fight each other, while Allah's Apostle was standing on the pulpit. He got down and quieted them till they became silent and he kept quiet. On that day I kept on weeping so much so that neither did my tears stop, nor could I sleep. In the morning my parents were with me and I had wept for two nights and a day, till I thought my liver would burst from weeping. While they were sitting with me and I was weeping, an Ansari woman asked my permission to enter, and I allowed her to come in. She sat down and started weeping with me. While we were in this state, Allah's Apostle came and sat down and he had never sat with me since the day they forged the accusation. No revelation regarding my case came to him for a month. He recited Tashah-hud (i.e. None has the right to be worshipped but Allah and Muhammad is His Apostle) and then said, 'O `Aisha! I have been informed such-and-such about you; if you are innocent, then Allah will soon reveal your innocence, and if you have committed a sin, then repent to Allah and ask Him to forgive you, for when a person confesses his sin and asks Allah for forgiveness, Allah accepts his repentance.' When Allah's Apostle finished his speech my tears ceased completely and there remained not even a single drop of it. I requested my father to reply to Allah's Apostle on my behalf. My father said, By Allah, I do not know what to say to Allah's Apostle.' I said to my mother, 'Talk to Allah's Apostle on my behalf.' She said, 'By Allah, I do not know what to say to Allah's Apostle. I was a young girl and did not have much knowledge of the Qur'an. I said. 'I know, by Allah, that you have listened to what people are saying and that has been planted in your minds and you have taken it as a truth. Now, if I told you that I am innocent and Allah knows that I am innocent, you would not believe me and if I confessed to you falsely that I am guilty, and Allah knows that I am innocent you would believe me. By Allah, I don't compare my situation with you except to the situation of Joseph's father (i.e. Jacob) who said, 'So (for me) patience is most fitting against that which you assert and it is Allah (Alone) whose help can be sought.' Then I turned to the other side of my bed hoping that Allah would prove my innocence. By Allah I never thought that Allah would reveal Divine Inspiration in my case, as I considered myself too inferior to be talked of in the Holy Qur'an. I had hoped that Allah's Apostle might have a dream in which Allah would prove my innocence. By Allah, Allah's Apostle had not got up and nobody had left the house before the Divine Inspiration came to Allah's Apostle. So, there overtook him the same state which used to overtake him, (when he used to have, on being inspired divinely). He was sweating so much so that the drops of the sweat were dropping like pearls though it was a (cold) wintry day. When that state of Allah's Apostle was over, he was smiling and the first word he said, `Aisha! Thank Allah, for Allah has declared your innocence.' My mother told me to go to Allah's Apostle . I replied, 'By Allah I will not go to him and will not thank but Allah.' So Allah revealed: \"Verily! They who spread the slander are a gang among you . . .\" (24.11) When Allah gave the declaration of my Innocence, Abu Bakr, who used to provide for Mistah bin Uthatha for he was his relative, said, 'By Allah, I will never provide Mistah with anything because of what he said about Aisha.' But Allah later revealed: -- \"And let not those who are good and wealthy among you swear not to help their kinsmen, those in need and those who left their homes in Allah's Cause. Let them forgive and overlook. Do you not wish that Allah should forgive you? Verily! Allah is Oft-forgiving, Most Merciful.\" (24.22) After that Abu Bakr said, 'Yes ! By Allah! I like that Allah should forgive me,' and resumed helping Mistah whom he used to help before. Allah's Apostle also asked Zainab bint Jahsh (i.e. the Prophet's wife about me saying, 'What do you know and what did you see?' She replied, 'O Allah's Apostle! I refrain to claim hearing or seeing what I have not heard or seen. By Allah, I know nothing except goodness about Aisha.\" Aisha further added \"Zainab was competing with me (in her beauty and the Prophet's love), yet Allah protected her (from being malicious), for she had piety.\"",
      "chain": [
        "30137",
        "20169",
        "10511",
        "11002",
        "11042",
        "11004",
        "53"
      ]
    },
    {
      "hadith_no": "2701",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا محمد بن رافع، حدثنا سريج بن النعمان، حدثنا فليح، عن نافع، عن ابن عمر، رضى الله عنهما أن رسول الله صلى الله عليه وسلم خرج معتمرا، فحال كفار قريش بينه وبين البيت، فنحر هديه، وحلق رأسه بالحديبية، وقاضاهم على أن يعتمر العام المقبل، ولا يحمل سلاحا عليهم إلا سيوفا، ولا يقيم بها إلا ما أحبوا، فاعتمر من العام المقبل فدخلها كما كان صالحهم، فلما أقام بها ثلاثا أمروه أن يخرج فخرج‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle set out for the `Umra but the pagans of Quraish prevented him from reaching the Ka`ba. So, he slaughtered his sacrifice and got his head shaved at Al-Hudaibiya, and agreed with them that he would perform `Umra the following year and would not carry weapons except swords and would not stay in Mecca except for the period they allowed. So, the Prophet performed the `Umra in the following year and entered Mecca according to the treaty, and when he stayed for three days, the pagans ordered him to depart, and he departed.",
      "chain": [
        "30375",
        "30250",
        "20169",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2790",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا يحيى بن صالح، حدثنا فليح، عن هلال بن علي، عن عطاء بن يسار، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من آمن بالله وبرسوله وأقام الصلاة وصام رمضان، كان حقا على الله أن يدخله الجنة جاهد في سبيل الله، أو جلس في أرضه التي ولد فيها ‏\"‏‏.‏ فقالوا يا رسول الله أفلا نبشر الناس‏.‏ قال ‏\"‏ إن في الجنة مائة درجة أعدها الله للمجاهدين في سبيل الله، ما بين الدرجتين كما بين السماء والأرض، فإذا سألتم الله فاسألوه الفردوس، فإنه أوسط الجنة وأعلى الجنة، أراه فوقه عرش الرحمن، ومنه تفجر أنهار الجنة ‏\"‏‏.‏ قال محمد بن فليح عن أبيه ‏\"‏ وفوقه عرش الرحمن ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever believes in Allah and His Apostle, offer prayer perfectly and fasts the month of Ramadan, will rightfully be granted Paradise by Allah, no matter whether he fights in Allah's Cause or remains in the land where he is born.\" The people said, \"O Allah's Apostle ! Shall we acquaint the people with the is good news?\" He said, \"Paradise has one-hundred grades which Allah has reserved for the Mujahidin who fight in His Cause, and the distance between each of two grades is like the distance between the Heaven and the Earth. So, when you ask Allah (for something), ask for Al-firdaus which is the best and highest part of Paradise.\" (i.e. The sub-narrator added, \"I think the Prophet also said, 'Above it (i.e. Al-Firdaus) is the Throne of Beneficent (i.e. Allah), and from it originate the rivers of Paradise.\")",
      "chain": [
        "20470",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "2793",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا محمد بن فليح، قال حدثني أبي، عن هلال بن علي، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏لقاب قوس في الجنة خير مما تطلع عليه الشمس وتغرب ‏\"‏‏.‏ وقال ‏\"‏ لغدوة أو روحة في سبيل الله خير مما تطلع عليه الشمس وتغرب ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"A place in Paradise as small as a bow is better than all that on which the sun rises and sets (i.e. all the world).\" He also said, \"A single endeavor in Allah's Cause in the afternoon or in the forenoon is better than all that on which the sun rises and sets.\"",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "2842",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح، حدثنا هلال، عن عطاء بن يسار، عن أبي سعيد الخدري  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قام على المنبر فقال ‏\"‏ إنما أخشى عليكم من بعدي ما يفتح عليكم من بركات الأرض ‏\"‏‏.‏ ثم ذكر زهرة الدنيا، فبدأ بإحداهما وثنى بالأخرى، فقام رجل فقال يا رسول الله أويأتي الخير بالشر فسكت عنه النبي صلى الله عليه وسلم قلنا يوحى إليه‏.‏ وسكت الناس كأن على رءوسهم الطير، ثم إنه مسح عن وجهه الرحضاء، فقال ‏\"‏ أين السائل آنفا أوخير هو  ثلاثا  إن الخير لا يأتي إلا بالخير، وإنه كل ما ينبت الربيع ما يقتل حبطا أو يلم كلما أكلت، حتى إذا امتلأت خاصرتاها استقبلت الشمس، فثلطت وبالت ثم رتعت، وإن هذا المال خضرة حلوة، ونعم صاحب المسلم لمن أخذه بحقه، فجعله في سبيل الله واليتامى والمساكين، ومن لم يأخذه بحقه فهو كالآكل الذي لا يشبع، ويكون عليه شهيدا يوم القيامة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle ascended the pulpit and said, \"Nothing worries me as to what will happen to you after me, except the temptation of worldly blessings which will be conferred on you.\" Then he mentioned the worldly pleasures. He started with the one (i.e. the blessings) and took up the other (i.e. the pleasures). A man got up saying, \"O Allah's Apostle! Can the good bring about evil?\" The Prophet remained silent and we thought that he was being inspired divinely, so all the people kept silent with awe. Then the Prophet wiped the sweat off his face and asked, \"Where is the present questioner?\" \"Do you think wealth is good?\" he repeated thrice, adding, \"No doubt, good produces nothing but good. Indeed it is like what grows on the banks of a stream which either kills or nearly kills the grazing animals because of gluttony except the vegetation-eating animal which eats till both its flanks are full (i.e. till it gets satisfied) and then stands in the sun and defecates and urinates and again starts grazing. This worldly property is sweet vegetation. How excellent the wealth of the Muslim is, if it is collected through legal means and is spent in Allah's Cause and on orphans, poor people and travelers. But he who does not take it legally is like an eater who is never satisfied and his wealth will be a witness against him on the Day of Resurrection.\"",
      "chain": [
        "34207",
        "20169",
        "11229",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "3117",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح، حدثنا هلال، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما أعطيكم ولا أمنعكم، أنا قاسم أضع حيث أمرت ‏\"‏‏.‏",
      "text_en": "  Abu Huraira:                     Allah's Apostle said, \"Neither do I give you (anything) nor withhold (anything) from you, but I am just a distributor (i.e. Qasim), and I give as I am ordered.\"",
      "chain": [
        "34207",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "3229",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا محمد بن فليح، حدثنا أبي، عن هلال بن علي، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إن أحدكم في صلاة ما دامت الصلاة تحبسه، والملائكة تقول اللهم اغفر له وارحمه‏.‏ ما لم يقم من صلاته أو يحدث ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"As long as any-one of you is waiting for the prayer, he is considered to be praying actually, and the angels say, 'O Allah! Be merciful to him and forgive him', (and go on saying so) unless he leaves his place of praying or passes wind (i.e. breaks his ablution).",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "3252",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح بن سليمان، حدثنا هلال بن علي، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إن في الجنة لشجرة يسير الراكب في ظلها مائة سنة، واقرءوا إن شئتم ‏{‏وظل ممدود‏}‏‏\"‏«ولقاب قوس أحدكم في الجنة خير مما طلعت عليه الشمس أو تغرب».",
      "text_en": " Narrated Abu Huraira:                     The Prophet said \"There is a tree in Paradise (which is so big and huge that) a rider could travel in its shade for a hundred years. And if you wish, you can recite:--'In shade long extended..' (56. 30) and a place in Paradise equal to an arrow bow of one of you, is better than (the whole earth) on which the sun rises and sets.\"",
      "chain": [
        "34207",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "3254",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا محمد بن فليح، حدثنا أبي، عن هلال، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم ‏\"‏ أول زمرة تدخل الجنة على صورة القمر ليلة البدر، والذين على آثارهم كأحسن كوكب دري في السماء إضاءة، قلوبهم على قلب رجل واحد، لا تباغض بينهم ولا تحاسد، لكل امرئ زوجتان من الحور العين، يرى مخ سوقهن من وراء العظم واللحم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The first batch (of people) who will enter Paradise will be (glittering) like the full moon, and the batch next to them will be (glittering) like the most brilliant star in the sky. Their hearts will be as if the heart of a single man, for they will have neither enmity nor jealousy amongst themselves; everyone will have two wives from the houris, (who will be so beautiful, pure and transparent that) the marrow of the bones of their legs will be seen through the bones and the flesh.\"",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "3443",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح بن سليمان، حدثنا هلال بن علي، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنا أولى الناس بعيسى ابن مريم في الدنيا والآخرة، والأنبياء إخوة لعلات، أمهاتهم شتى، ودينهم واحد ‏\"‏‏.‏   وقال إبراهيم بن طهمان عن موسى بن عقبة، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Both in this world and in the Hereafter, I am the nearest of all the people to Jesus, the son of Mary. The prophets are paternal brothers; their mothers are different, but their religion is one.\"",
      "chain": [
        "34207",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "3697",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا أبو عامر، حدثنا فليح، قال حدثني سالم أبو النضر، عن بسر بن سعيد، عن أبي سعيد الخدري  رضى الله عنه  قال خطب رسول الله صلى الله عليه وسلم الناس وقال ‏\"‏ إن الله خير عبدا بين الدنيا وبين ما عنده فاختار ذلك العبد ما عند الله ‏\"‏‏.‏ قال فبكى أبو بكر، فعجبنا لبكائه أن يخبر رسول الله صلى الله عليه وسلم عن عبد خير‏.‏ فكان رسول الله صلى الله عليه وسلم هو المخير وكان أبو بكر أعلمنا، فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن من أمن الناس على في صحبته وماله أبا بكر، ولو كنت متخذا خليلا غير ربي لاتخذت أبا بكر، ولكن أخوة الإسلام ومودته، لا يبقين في المسجد باب إلا سد، إلا باب أبي بكر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle addressed the people saying, \"Allah has given option to a slave to choose this world or what is with Him. The slave has chosen what is with Allah.\" Abu Bakr wept, and we were astonished at his weeping caused by what the Prophet mentioned as to a Slave ( of Allah) who had been offered a choice, (we learned later on) that Allah's Apostle himself was the person who was given the choice, and that Abu Bakr knew best of all of us. Allah's Apostle added, \"The person who has favored me most of all both with his company and wealth, is Abu Bakr. If I were to take a Khalil other than my Lord, I would have taken Abu Bakr as such, but (what relates us) is the Islamic brotherhood and friendliness. All the gates of the Mosque should be closed except the gate of Abu Bakr.\"",
      "chain": [
        "30351",
        "20443",
        "20169",
        "11164",
        "11153",
        "38"
      ]
    },
    {
      "hadith_no": "4297",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن رافع، حدثنا سريج، حدثنا فليح، ح وحدثني محمد بن الحسين بن إبراهيم، قال حدثني أبي، حدثنا فليح بن سليمان، عن نافع، عن ابن عمر  رضى الله عنهما أن رسول الله صلى الله عليه وسلم خرج معتمرا، فحال كفار قريش بينه وبين البيت، فنحر هديه، وحلق رأسه بالحديبية، وقاضاهم على أن يعتمر العام المقبل، ولا يحمل سلاحا عليهم إلا سيوفا، ولا يقيم بها إلا ما أحبوا، فاعتمر من العام المقبل، فدخلها كما كان صالحهم، فلما أن أقام بها ثلاثا أمروه أن يخرج، فخرج‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle set out with the intention of performing `Umra, but the infidels of Quraish intervened between him and the Ka`ba, so the Prophet slaughtered his Hadi (i.e. sacrificing animals and shaved his head at Al-Hudaibiya and concluded a peace treaty with them (i.e. the infidels) on condition that he would perform the `Umra the next year and that he would not carry arms against them except swords, and would not stay (in Mecca) more than what they would allow. So the Prophet performed the `Umra in the following year and according to the peace treaty, he entered Mecca, and when he had stayed there for three days, the infidels ordered him to leave, and he left.",
      "chain": [
        "30375",
        "20169",
        "30267",
        "30247",
        "20169",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4406",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سليمان بن داود أبو الربيع، حدثنا فليح، عن الزهري، عن حميد بن عبد الرحمن، عن أبي هريرة، أن أبا بكر الصديق  رضى الله عنه  بعثه في الحجة التي أمره النبي صلى الله عليه وسلم قبل حجة الوداع يوم النحر في رهط يؤذن في الناس لا يحج بعد العام مشرك ولا يطوف بالبيت عريان‏.‏",
      "text_en": " Narrated Abu Huraira:                     That during the Hajj in which the Prophet had made Abu Bakr As Siddiq as chief of the, Hajj before the Hajj-ul-Wida,' on the day of Nahr, Abu Bakr sent him along with a group of persons to announce to the people. \"No pagan is permitted to perform Hajj after this year, and nobody is permitted to perform the Tawaf of the Ka`ba naked.\"",
      "chain": [
        "30584",
        "20169",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "4444",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد، حدثنا سريج بن النعمان، حدثنا فليح، عن نافع، عن ابن عمر  رضى الله عنهما  قال أقبل النبي صلى الله عليه وسلم عام الفتح وهو مردف أسامة على القصواء‏.‏ ومعه بلال وعثمان بن طلحة حتى أناخ عند البيت، ثم قال لعثمان ‏\"‏ ائتنا بالمفتاح ‏\"‏، فجاءه بالمفتاح ففتح له الباب، فدخل النبي صلى الله عليه وسلم وأسامة وبلال وعثمان، ثم أغلقوا عليهم الباب، فمكث نهارا طويلا ثم خرج، وابتدر الناس الدخول، فسبقتهم فوجدت بلالا قائما من وراء الباب فقلت له أين صلى رسول الله صلى الله عليه وسلم فقال صلى بين ذينك العمودين المقدمين‏.‏ وكان البيت على ستة أعمدة سطرين، صلى بين العمودين من السطر المقدم، وجعل باب البيت خلف ظهره، واستقبل بوجهه الذي يستقبلك حين تلج البيت بينه وبين الجدار، قال ونسيت أن أسأله كم صلى وعند المكان الذي صلى فيه مرمرة حمراء‏.‏",
      "text_en": " Narrated (Abdullah) bin `Umar:                     The Prophet arrived (at Mecca) in the year of the Conquest (of Mecca) while Usama was riding behind him on (his she-camel)'. Al-Qaswa.' Bilal and `Uthman bin Talha were accompanying him. When he made his she-camel kneel down near the Ka`ba, he said to `Uthman, \"Get us the key (of the Ka`ba). He brought the key to him and opened the gate (of the Ka`ba), for him. The Prophet, Usama, Bilal and `Uthman (bin Talha) entered the Ka`ba and then closed the gate behind them (from inside). The Prophet stayed there for a long period and then came out. The people rushed to get in, but I went in before them and found Bilal standing behind the gate, and I said to him, \"Where did the Prophet pray?\" He said, \"He prayed between those two front pillars.\" The Ka`ba was built on six pillars, arranged in two rows, and he prayed between the two pillars of the front row leaving the gate of the Ka`ba at his back and facing (in prayer) the wall which faces one when one enters the Ka`ba. Between him and that wall (was the distance of about three cubits). But I forgot to ask Bilal about the number of rak`at the Prophet had prayed. There was a red piece of marble at the place where he (i.e. the Prophet) had offered the prayer.",
      "chain": [
        "30213",
        "30250",
        "20169",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4647",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح، حدثنا هلال، عن عطاء بن يسار، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من قال أنا خير من يونس بن متى فقد كذب ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever says that I am better than Jonah bin Matta, is a liar.\"",
      "chain": [
        "34207",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "4793",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني سليمان بن داود أبو الربيع، حدثنا فليح، عن الزهري، عن سهل بن سعد، أن رجلا، أتى رسول الله صلى الله عليه وسلم فقال يا رسول الله، أرأيت رجلا رأى مع امرأته رجلا أيقتله فتقتلونه أم كيف يفعل فأنزل الله فيهما ما ذكر في القرآن من التلاعن، فقال له رسول الله صلى الله عليه وسلم ‏\"‏ قد قضي فيك وفي امرأتك ‏\"‏‏.‏ قال فتلاعنا، وأنا شاهد عند رسول الله صلى الله عليه وسلم ففارقها فكانت سنة أن يفرق بين المتلاعنين وكانت حاملا، فأنكر حملها وكان ابنها يدعى إليها، ثم جرت السنة في الميراث أن يرثها، وترث منه ما فرض الله لها‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     A man came to Allah's Apostle and said, \"O Allah's Apostle! Suppose a man saw another man with his wife, should he kill him whereupon you might kill him (i.e. the killer) (in Qisas) or what should he do?\" So Allah revealed concerning their case what is mentioned of the order of Mula'ana. Allah's Apostle said to the man, \"The matter between you and your wife has been decided.\" So they did Mula'ana in the presence of Allah's Apostle and I was present there, and then the man divorced his wife. So it became a tradition to dissolve the marriage of those spouses who were involved in a case of Mula'ana. The woman was pregnant and the husband denied that he was the cause of her pregnancy, so the son was (later) ascribed to her. Then it became a tradition that such a son would be the heir of his mother, and she would inherit of him what Allah prescribed for her.",
      "chain": [
        "30584",
        "20169",
        "11013",
        "399"
      ]
    },
    {
      "hadith_no": "4828",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إبراهيم بن المنذر، حدثنا محمد بن فليح، حدثنا أبي، عن هلال بن علي، عن عبد الرحمن بن أبي عمرة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ما من مؤمن إلا وأنا أولى الناس به في الدنيا والآخرة، اقرءوا إن شئتم ‏{‏النبي أولى بالمؤمنين من أنفسهم‏}‏ فأيما مؤمن ترك مالا فليرثه عصبته من كانوا، فإن ترك دينا أو ضياعا فليأتني وأنا مولاه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"There is no believer but I, of all the people, I am the closest to him both in this world and in the Hereafter. Recite if you wish: 'The Prophet is closer to the believers than their own selves.' (33.6) so if a believer (dies) leaves some property then his relatives will inherit that property; but if he is in debt or he leaves poor children, let those (creditors and children) come to me (that I may pay the debt and provide for the children), for them I am his sponsor (surely).",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "1238",
        "13"
      ]
    },
    {
      "hadith_no": "4853",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إبراهيم بن المنذر، حدثنا محمد بن فليح، قال حدثني أبي، عن هلال بن علي، من بني عامر بن لؤى عن عطاء بن يسار، عن أبي هريرة، رضى الله عنه عن النبي صلى الله عليه وسلم قال ‏\"‏ من قال أنا خير من يونس بن متى فقد كذب ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"He who says that I am better than Jonah bin Matta, tells a lie.'",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "5461",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثني محمد بن المثنى، قال حدثني عثمان بن عمر، حدثنا فليح، حدثنا أبو حازم المدني، حدثنا عبد الله بن أبي قتادة، عن أبيه، قال خرجنا مع النبي صلى الله عليه وسلم نحو مكة‏.‏",
      "text_en": " Narrated Abu Qatada:                     We went out towards Mecca with the Prophet.",
      "chain": [
        "30170",
        "20262",
        "20169",
        "11172",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "5513",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثني محمد بن فليح، قال حدثني أبي، عن سعيد بن الحارث، عن جابر بن عبد الله  رضى الله عنهما  أنه سأله عن الوضوء مما مست النار، فقال لا قد كنا زمان النبي صلى الله عليه وسلم لا نجد مثل ذلك من الطعام إلا قليلا، فإذا نحن وجدناه لم يكن لنا مناديل، إلا أكفنا وسواعدنا وأقدامنا، ثم نصلي ولا نتوضأ‏.‏",
      "text_en": " Narrated Sa`id bin Al-Harith:                     that he asked Jabir bin `Abdullah about performing ablution after taking a cooked meal. He replied, \"It is not essential,\" and added, \"We never used to get such kind of food during the lifetime of the Prophet except rarely; and if at all we got such a dish, we did not have any handkerchiefs to wipe our hands with except the palms of our hands, our forearms and our feet. We would perform the prayer thereafter with-out performing new ablution.\"",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11167",
        "34"
      ]
    },
    {
      "hadith_no": "5673",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا أبو عامر، حدثنا فليح بن سليمان، عن سعيد بن الحارث، عن جابر بن عبد الله  رضى الله عنهما  أن النبي صلى الله عليه وسلم دخل على رجل من الأنصار ومعه صاحب له فقال له النبي صلى الله عليه وسلم ‏\"‏ إن كان عندك ماء بات هذه الليلة في شنة، وإلا كرعنا ‏\"‏‏.‏ قال والرجل يحول الماء في حائطه  قال  فقال الرجل يا رسول الله عندي ماء بائت فانطلق إلى العريش  قال  فانطلق بهما، فسكب في قدح، ثم حلب عليه من داجن له  قال  فشرب رسول الله صلى الله عليه وسلم ثم شرب الرجل الذي جاء معه‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Allah's Apostle and one of his companions entered upon an Ansari man and the Prophet said to him, \"If you have water kept overnight in a water skin, (give us), otherwise we will drink water by putting our mouth in it.\" The man was watering his garden then. He said, \"O Allah's Apostle! I have water kept overnight; let us go to the shade.\" So he took them both there and poured water into a bowl and milked a domestic goat of his in it. Allah's Apostle drank, and then the man who had come along with him, drank.",
      "chain": [
        "30351",
        "20443",
        "20169",
        "11167",
        "34"
      ]
    },
    {
      "hadith_no": "5681",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا يحيى بن صالح، حدثنا فليح بن سليمان، عن سعيد بن الحارث، عن جابر بن عبد الله  رضى الله عنهما  أن النبي صلى الله عليه وسلم دخل على رجل من الأنصار ومعه صاحب له، فسلم النبي صلى الله عليه وسلم وصاحبه، فرد الرجل فقال يا رسول الله بأبي أنت وأمي‏.‏ وهى ساعة حارة، وهو يحول في حائط له  يعني الماء  فقال النبي صلى الله عليه وسلم ‏\"‏ إن كان عندك ماء بات في شنة وإلا كرعنا ‏\"‏‏.‏ والرجل يحول الماء في حائط فقال الرجل يا رسول الله عندي ماء بات في شنة‏.‏ فانطلق إلى العريش فسكب في قدح ماء، ثم حلب عليه من داجن له، فشرب النبي صلى الله عليه وسلم ثم أعاد، فشرب الرجل الذي جاء معه‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet and one of his companions entered upon an Ansari man. The Prophet and his companion greeted (the man) and he replied, \"O Allah's Apostle! Let my father and mother be sacrificed for you! It is hot,\" while he was watering his garden. The Prophet asked him, \"If you have water kept overnight in a water skin, (give us), or else we will drink by putting our mouths in the basin.\" The man was watering the garden The man said, \"O Allah's Apostle! I have water kept overnight in a water-skin. He went to the shade and poured some water into a bowl and milked some milk from a domestic goat in it. The Prophet drank and then gave the bowl to the man who had come along with him to drink.",
      "chain": [
        "20470",
        "20169",
        "11167",
        "34"
      ]
    },
    {
      "hadith_no": "5704",
      "source": " Sahih Bukhari ",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا إبراهيم بن المنذر، قال حدثني محمد بن فليح، قال حدثني أبي، عن هلال بن علي، من بني عامر بن لؤى عن عطاء بن يسار، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مثل المؤمن كمثل الخامة من الزرع من حيث أتتها الريح كفأتها، فإذا اعتدلت تكفأ بالبلاء، والفاجر كالأرزة صماء معتدلة حتى يقصمها الله إذا شاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The example of a believer is that of a fresh tender plant; from whatever direction the wind comes, it bends it, but when the wind becomes quiet, it becomes straight again. Similarly, a believer is afflicted with calamities (but he remains patient till Allah removes his difficulties.) And an impious wicked person is like a pine tree which keeps hard and straight till Allah cuts (breaks) it down when He wishes.\" (See Hadith No. 558, Vol. 9.)",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "5996",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "وقال ابن أبي شيبة حدثنا يونس بن محمد، حدثنا فليح، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ لعن الله الواصلة والمستوصلة، والواشمة والمستوشمة ‏\"‏‏.‏",
      "text_en": "",
      "chain": [
        "30201",
        "20393",
        "20169",
        "11163",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "6100",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أصبغ، قال أخبرني ابن وهب، أخبرنا أبو يحيى، هو فليح بن سليمان عن هلال بن أسامة، عن أنس بن مالك  رضى الله عنه  قال لم يكن النبي صلى الله عليه وسلم سبابا ولا فحاشا ولا لعانا، كان يقول لأحدنا عند المعتبة ‏\"‏ ما له، ترب جبينه ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet was not one who would abuse (others) or say obscene words, or curse (others), and if he wanted to admonish anyone of us, he used to say: \"What is wrong with him, his forehead be dusted!\"",
      "chain": [
        "30228",
        "20029",
        "20169",
        "11229",
        "19"
      ]
    },
    {
      "hadith_no": "6115",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح بن سليمان، حدثنا هلال بن علي، عن أنس، قال لم يكن رسول الله صلى الله عليه وسلم فاحشا ولا لعانا ولا سبابا، كان يقول عند المعتبة ‏\"‏ ما له، ترب جبينه ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle was neither a Fahish (one who had a bad tongue) nor a Sabbaba (one who abuses others) and he used to say while admonishing somebody, \"What is wrong with him? May dust be on his forehead!\"",
      "chain": [
        "34207",
        "20169",
        "11229",
        "19"
      ]
    },
    {
      "hadith_no": "6346",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا محمد بن أبي غالب، أخبرنا إبراهيم بن المنذر الحزامي، حدثنا محمد بن فليح، عن أبيه، عن نافع، عن ابن عمر  رضى الله عنهما  قال رأيت رسول الله صلى الله عليه وسلم بفناء الكعبة محتبيا بيده هكذا‏.‏",
      "text_en": " Narrated Ibn `Umar:                     I saw Allah's Apostle in the courtyard of the Ka`ba in the Ihtiba.' posture putting his hand round his legs like this.",
      "chain": [
        "30274",
        "30308",
        "20178",
        "20169",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "6546",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا محمد بن فليح، قال حدثني أبي، عن هلال بن علي، عن أنس بن مالك  رضى الله عنه  قال سمعته يقول إن رسول الله صلى الله عليه وسلم صلى لنا يوما الصلاة، ثم رقي المنبر فأشار بيده قبل قبلة المسجد، فقال ‏\"‏ قد أريت الآن  منذ صليت لكم الصلاة  الجنة والنار ممثلتين في قبل هذا الجدار، فلم أر كاليوم في الخير والشر، فلم أر كاليوم في الخير والشر ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Once Allah's Apostle led us in prayer and then (after finishing it) ascended the pulpit and pointed with his hand towards the Qibla of the mosque and said, \"While I was leading you in prayer, both Paradise and Hell were displayed in front of me in the direction of this wall. I had never seen a better thing (than Paradise) and a worse thing (than Hell) as I have seen today, I had never seen a better thing and a worse thing as I have seen today.\"",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "19"
      ]
    },
    {
      "hadith_no": "6575",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح بن سليمان، حدثنا هلال بن علي، عن عطاء بن يسار، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا ضيعت الأمانة فانتظر الساعة ‏\"‏‏.‏ قال كيف إضاعتها يا رسول الله قال ‏\"‏ إذا أسند الأمر إلى غير أهله، فانتظر الساعة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"When honesty is lost, then wait for the Hour.\" It was asked, \"How will honesty be lost, O Allah's Apostle?\" He said, \"When authority is given to those who do not deserve it, then wait for the Hour.\"",
      "chain": [
        "34207",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "6667",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني إبراهيم بن المنذر، حدثنا محمد بن فليح، حدثنا أبي قال، حدثني هلال، عن عطاء بن يسار، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ بينا أنا قائم إذا زمرة، حتى إذا عرفتهم خرج رجل من بيني وبينهم فقال هلم‏.‏ فقلت أين قال إلى النار والله‏.‏ قلت وما شأنهم قال إنهم ارتدوا بعدك على أدبارهم القهقرى‏.‏ ثم إذا زمرة حتى إذا عرفتهم خرج رجل من بيني وبينهم فقال هلم‏.‏ قلت أين قال إلى النار والله‏.‏ قلت ما شأنهم قال إنهم ارتدوا بعدك على أدبارهم القهقرى‏.‏ فلا أراه يخلص منهم إلا مثل همل النعم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"While I was sleeping, a group (of my followers were brought close to me), and when I recognized them, a man (an angel) came out from amongst (us) me and them, he said (to them), 'Come along.' I asked, 'Where?' He said, 'To the (Hell) Fire, by Allah' I asked, 'what is wrong with them' He said, 'They turned apostate as renegades after you left.' Then behold! (Another) group (of my followers) were brought close to me, and when I recognized them, a man (an angel) came out from (me and them) he said (to them); Come along.' I asked, \"Where?' He said, 'To the (Hell) Fire, by Allah.' I asked, What is wrong with them?' He said, 'They turned apostate as renegades after you left. So I did not see anyone of them escaping except a few who were like camels without a shepherd.\"",
      "chain": [
        "30308",
        "20178",
        "20169",
        "11229",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "6697",
      "source": " Sahih Bukhari ",
      "chapter": "Divine Will (Al-Qadar) - كتاب القدر",
      "chapter_no": "82",
      "text_ar": "حدثنا محمد بن سنان، حدثنا فليح، حدثنا عبدة بن أبي لبابة، عن وراد، مولى المغيرة بن شعبة قال كتب معاوية إلى المغيرة اكتب إلى ما سمعت النبي صلى الله عليه وسلم يقول خلف الصلاة‏.‏ فأملى على المغيرة قال سمعت النبي صلى الله عليه وسلم يقول خلف الصلاة ‏\"‏ لا إله إلا الله، وحده لا شريك له، اللهم لا مانع لما أعطيت، ولا معطي لما منعت، ولا ينفع ذا الجد منك الجد ‏\"‏‏.‏ وقال ابن جريج أخبرني عبدة أن ورادا أخبره بهذا‏.‏ ثم وفدت بعد إلى معاوية فسمعته يأمر الناس بذلك القول‏.‏",
      "text_en": " Narrated Warrad:                     (the freed slave of Al-Mughira bin Shu`ba) Muawiya wrote to Mughira. 'Write to me what you heard the Prophet saying after his prayer.' So Al-Mughira dictated to me and said, \"I heard the Prophet saying after the prayer, 'None has the right to be worshipped but Allah Alone Who has no partner. O Allah! No-one can withhold what You give, and none can give what You withhold, and the fortune of a man of means is useless before You (i.e., only good deeds are of value).",
      "chain": [
        "34207",
        "20169",
        "10793"
      ]
    },
    {
      "hadith_no": "6775",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا يحيى بن صالح، حدثنا فليح بن سليمان، حدثنا سعيد بن الحارث، أنه سمع ابن عمر  رضى الله عنهما  يقول أولم ينهوا عن النذر إن النبي صلى الله عليه وسلم قال ‏\"‏ إن النذر لا يقدم شيئا، ولا يؤخر، وإنما يستخرج بالنذر من البخيل ‏\"‏‏.‏",
      "text_en": " Narrated Sa`id bin Al-Harith:                     that he heard Ibn `Umar saying, \"Weren't people forbidden to make vows?\" The Prophet said, 'A vow neither hastens nor delays anything, but by the making of vows, some of the wealth of a miser is taken out.\"",
      "chain": [
        "20470",
        "20169",
        "11167",
        "18"
      ]
    }
  ],
  "total_hadiths": 88
}