{
  "id": "20163",
  "name": "'Asim bin Muhammad bin Zayd عاصم بن محمد بن زيد العمري",
  "full_name": "'Asim bin Muhammad bin Zayd عاصم بن محمد بن زيد العمري",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Fiqh"
    ],
    "tags": [
      "Quraish",
      "B.'Adi",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "11217",
      "name": "Muhammad bin Zayd bin 'Abdullah محمد بن زيد بن عبد الله بن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "11544",
      "name": "Waqid bin Muhammad bin Zayd واقد بن محمد بن زيد بن عبد الله",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11530",
      "name": "'Umar bin Muhammad bin Zayd عمر بن محمد بن زيد بن عبد الله",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "22249",
      "name": "Abu Bakr bin Muhammad bin Zayd أبو بكر بن محمد بن زيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20651",
      "name": "Zayd bin Muhammad bin Zayd زيد بن محمد بن زيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "11217",
      "name": "Muhammad bin Zayd bin 'Abdullah محمد بن زيد بن عبد الله بن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11544",
      "name": "Waqid bin Muhammad bin Zayd واقد بن محمد بن زيد بن عبد الله",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11530",
      "name": "'Umar bin Muhammad bin Zayd عمر بن محمد بن زيد بن عبد الله",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20651",
      "name": "Zayd bin Muhammad bin Zayd زيد بن محمد بن زيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "20405",
      "name": "Ibrahim bin Muhammad bin al-Harith إبراهيم بن محمد أبو اسحاق الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20184",
      "name": "Ya'qub bin Ibrahim bin Sa'd يعقوب بن إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20450",
      "name": "'Umar bin Yonus bin al-Qasim عمر بن يونس بن القاسم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30566",
      "name": "al-Mthna bin Mua'dh bin Mua'dh المثنى بن معاذ بن معاذ العنبري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20296",
      "name": "Hisham bin 'Abdul Malik al-Tayalasi هشام بن عبد الملك أبو الوليد الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20386",
      "name": "'Ali bin al-J'ad al-Jauhri علي بن الجعد بن عبيد الجوهري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-352",
      "hadith_no": "352",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن يونس، قال حدثنا عاصم بن محمد، قال حدثني واقد بن محمد، عن محمد بن المنكدر، قال صلى جابر في إزار قد عقده من قبل قفاه، وثيابه موضوعة على المشجب قال له قائل تصلي في إزار واحد فقال إنما صنعت ذلك ليراني أحمق مثلك، وأينا كان له ثوبان على عهد النبي صلى الله عليه وسلم",
      "text_en": " Narrated Muhammad bin Al-Munkadir:                     Once Jabir prayed with his Izar tied to his back while his clothes were Lying beside him on a wooden peg. Somebody asked him, \"Do you offer your prayer in a single Izar?\" He replied, \"I did so to show it to a fool like you. Had anyone of us two garments in the lifetime of the Prophet?\"",
      "usc_msa_ref": "348",
      "chain": [
        "30184",
        "20163",
        "11544",
        "11048"
      ]
    },
    {
      "id": "sahih-bukhari-480",
      "hadith_no": "480",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "وقال عاصم بن علي حدثنا عاصم بن محمد، سمعت هذا الحديث، من أبي فلم أحفظه، فقومه لي واقد عن أبيه، قال سمعت أبي وهو، يقول قال عبد الله قال رسول الله صلى الله عليه وسلم ‏\"‏ يا عبد الله بن عمرو، كيف بك إذا بقيت في حثالة من الناس بهذا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     That Allah's Apostle said, \"O `Abdullah bin `Amr! What will be your condition when you will be left with the sediments of (worst) people?\" (They will be in conflict with each other).",
      "usc_msa_ref": "",
      "chain": [
        "20430",
        "20163",
        "19124",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-1769",
      "hadith_no": "1769",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا يزيد بن هارون، أخبرنا عاصم بن محمد بن زيد، عن أبيه، عن ابن عمر  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم بمنى ‏\"‏ أتدرون أى يوم هذا ‏\"‏‏.‏ قالوا الله ورسوله أعلم‏.‏ فقال ‏\"‏ فإن هذا يوم حرام، أفتدرون أى بلد هذا ‏\"‏‏.‏ قالوا الله ورسوله أعلم‏.‏ قال ‏\"‏ بلد حرام، أفتدرون أى شهر هذا ‏\"‏‏.‏ قالوا الله ورسوله أعلم‏.‏ قال ‏\"‏ شهر حرام  قال  فإن الله حرم عليكم دماءكم وأموالكم وأعراضكم، كحرمة يومكم هذا، في شهركم هذا، في بلدكم هذا ‏\"‏‏.‏ وقال هشام بن الغاز أخبرني نافع عن ابن عمر  رضى الله عنهما  وقف النبي صلى الله عليه وسلم يوم النحر بين الجمرات في الحجة التي حج بهذا، وقال ‏\"‏ هذا يوم الحج الأكبر ‏\"‏، فطفق النبي صلى الله عليه وسلم يقول ‏\"‏ اللهم اشهد ‏\"‏‏.‏ وودع الناس‏.‏ فقالوا هذه حجة الوداع‏.‏",
      "text_en": " Narrated Ibn `Umar:                     At Mina, the Prophet (p.b.u.h) said, \"Do you know what is the day today?\" The people replied, \"Allah and His Apostle know it better.\" He said, \"It is the forbidden (sacred) day. And do you know what town is this?\" They replied, \"Allah and His Apostle know it better.\" He said, \"This is the forbidden (Sacred) town (Mecca). And do you know which month is this?\" The people replied, \"Allah and His Apostle know it better.\" He said, \"This is the forbidden (sacred) month.\" The Prophet added, \"No doubt, Allah made your blood, your properties, and your honor sacred to one another like the sanctity of this day of yours in this month of yours in this town of yours.\" Narrated Ibn `Umar: On the Day of Nahr (10th of Dhul-Hijja), the Prophet stood in between the Jamrat during his Hajj which he performed (as in the previous Hadith) and said, \"This is the greatest Day (i.e. 10th of Dhul-Hijjah).\" The Prophet started saying repeatedly, \"O Allah! Be Witness (I have conveyed Your Message).\" He then bade the people farewell. The people said, \"This is Hajjat-al-Wada`).\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20472",
        "20163",
        "11217",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-2517",
      "hadith_no": "2517",
      "source": "Sahih Bukhari",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا عاصم بن محمد، قال حدثني واقد بن محمد، قال حدثني سعيد ابن مرجانة، صاحب علي بن حسين قال لي أبو هريرة  رضى الله عنه  قال النبي صلى الله عليه وسلم ‏\"‏ أيما رجل أعتق امرأ مسلما استنقذ الله بكل عضو منه عضوا منه من النار ‏\"‏‏.‏ قال سعيد ابن مرجانة فانطلقت إلى علي بن حسين فعمد علي بن حسين  رضى الله عنهما  إلى عبد له قد أعطاه به عبد الله بن جعفر عشرة آلاف درهم  أو ألف دينار  فأعتقه‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever frees a Muslim slave, Allah will save all the parts of his body from the (Hell) Fire as he has freed the body-parts of the slave.\" Sa`id bin Marjana said that he narrated that Hadith to `Ali bin Al-Husain and he freed his slave for whom `Abdullah bin Ja`far had offered him ten thousand Dirhams or one-thousand Dinars.",
      "usc_msa_ref": "693",
      "chain": [
        "30184",
        "20163",
        "11544",
        "11571",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-2998",
      "hadith_no": "2998",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو الوليد، حدثنا عاصم بن محمد، قال حدثني أبي، عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم‏.‏   حدثنا أبو نعيم، حدثنا عاصم بن محمد بن زيد بن عبد الله بن عمر، عن أبيه، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ لو يعلم الناس ما في الوحدة ما أعلم ما سار راكب بليل وحده ‏\"‏‏.‏",
      "text_en": " Narrated Ibn' `Umar:                     from the Prophet the following Hadith (No. 242).Narrated Ibn `Umar:The Prophet said, \"If the people knew what I know about traveling alone, then nobody would travel alone at night.\"",
      "usc_msa_ref": "",
      "chain": [
        "20296",
        "20163",
        "11217",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-3541",
      "hadith_no": "3541",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا أبو الوليد، حدثنا عاصم بن محمد، قال سمعت أبي، عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يزال هذا الأمر في قريش، ما بقي منهم اثنان ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"Authority of ruling will remain with Quraish, even if only two of them remained.\"",
      "usc_msa_ref": "705",
      "chain": [
        "20296",
        "20163",
        "11217",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-6112",
      "hadith_no": "6112",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثني محمد بن المثنى، حدثنا يزيد بن هارون، أخبرنا عاصم بن محمد بن زيد، عن أبيه، عن ابن عمر، رضى الله عنهما قال قال النبي صلى الله عليه وسلم بمنى ‏\"‏ أتدرون أى يوم هذا ‏\"‏‏.‏ قالوا الله ورسوله أعلم‏.‏ قال ‏\"‏ فإن هذا يوم حرام، أفتدرون أى بلد هذا ‏\"‏‏.‏ قالوا الله ورسوله أعلم‏.‏ قال ‏\"‏ بلد حرام، أتدرون أى شهر هذا ‏\"‏‏.‏ قالوا الله ورسوله أعلم‏.‏ قال ‏\"‏ شهر حرام ‏\"‏‏.‏ قال ‏\"‏ فإن الله حرم عليكم دماءكم وأموالكم وأعراضكم، كحرمة يومكم هذا في شهركم هذا في بلدكم هذا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said at Mina, \"Do you know what day is today?\" They (the people) replied, \"Allah and His Apostle know better,\" He said \"Today is 10th of Dhul-Hijja, the sacred (forbidden) day. Do you know what town is this town?\" They (the people) replied, \"Allah and His Apostle know better.\" He said, \"This is the (forbidden) Sacred town (Mecca a sanctuary).\" And do you know which month is this month?\" They (the People) replied, \"Allah and His Apostle know better.\" He said, ''This is the Sacred (forbidden) month .\" He added, \"Allah has made your blood, your properties and your honor Sacred to one another (i.e. Muslims) like the sanctity of this day of yours in this month of yours, in this town of yours.\" (See Hadith No. 797, Vol. 2.)",
      "usc_msa_ref": "69",
      "chain": [
        "30170",
        "20472",
        "20163",
        "11217",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-6872",
      "hadith_no": "6872",
      "source": "Sahih Bukhari",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثني محمد بن عبد الله، حدثنا عاصم بن علي، حدثنا عاصم بن محمد، عن واقد بن محمد، سمعت أبي قال عبد الله، قال رسول الله صلى الله عليه وسلم في حجة الوداع ‏\"‏ ألا أى شهر تعلمونه أعظم حرمة ‏\"‏‏.‏ قالوا ألا شهرنا هذا‏.‏ قال ‏\"‏ ألا أى بلد تعلمونه أعظم حرمة ‏\"‏‏.‏ قالوا ألا بلدنا هذا‏.‏ قال ‏\"‏ ألا أى يوم تعلمونه أعظم حرمة ‏\"‏‏.‏ قالوا ألا يومنا هذا‏.‏ قال ‏\"‏ فإن الله تبارك وتعالى قد حرم دماءكم وأموالكم وأعراضكم، إلا بحقها، كحرمة يومكم هذا، في بلدكم هذا، في شهركم هذا، ألا هل بلغت ‏\"‏‏.‏  ثلاثا كل ذلك يجيبونه ألا نعم  قال ‏\"‏ ويحكم  أو ويلكم  لا ترجعن بعدي كفارا، يضرب بعضكم رقاب بعض ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     Allah Apostle said in Hajjat-al-Wada`, \"Which month (of the year) do you think is most sacred?\" The people said, \"This current month of ours (the month of Dhull-Hijja).\" He said, \"Which town (country) do you think is the most sacred?\" They said, \"This city of ours (Mecca).\" He said, \"Which day do you think is the most sacred?\" The people said, \"This day of ours.\" He then said, \"Allah, the Blessed, the Supreme, has made your blood, your property and your honor as sacred as this day of yours in this town of yours, in this month of yours (and such protection cannot be slighted) except rightfully.\" He then said thrice, \"Have I conveyed Allah's Message (to you)?\" The people answered him each time saying, 'Yes.\" The Prophet added, 'May Allah be merciful to you (or, woe on you)! Do not revert to disbelief after me by cutting the necks of each other.'",
      "usc_msa_ref": "776",
      "chain": [
        "30561",
        "20430",
        "20163",
        "11544",
        "11217",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-7227",
      "hadith_no": "7227",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا عاصم بن محمد، سمعت أبي يقول، قال ابن عمر قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يزال الأمر في قريش ما بقي منهم اثنان ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"This matter (caliphate) will remain with the Quraish even if only two of them were still existing.\"",
      "usc_msa_ref": "254",
      "chain": [
        "30184",
        "20163",
        "11217",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-7265",
      "hadith_no": "7265",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا أبو نعيم، حدثنا عاصم بن محمد بن زيد بن عبد الله بن عمر، عن أبيه، قال أناس لابن عمر إنا ندخل على سلطاننا فنقول لهم خلاف ما نتكلم إذا خرجنا من عندهم قال كنا نعدها نفاقا‏.‏",
      "text_en": " Narrated Muhammad bin Zaid bin `Abdullah bin `Umar:                     Some people said to Ibn `Umar, \"When we enter upon our ruler(s) we say in their praise what is contrary to what we say when we leave them.\" Ibn `Umar said, \"We used to consider this as hypocrisy.\"",
      "usc_msa_ref": "289",
      "chain": [
        "20348",
        "20163",
        "11217"
      ]
    },
    {
      "id": "sahih-muslim-122",
      "hadith_no": "122",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا عاصم، - وهو ابن محمد بن زيد بن عبد الله بن عمر - عن أبيه، قال قال عبد الله قال رسول الله صلى الله عليه وسلم ‏\"‏ بني الإسلام على خمس شهادة أن لا إله إلا الله وأن محمدا عبده ورسوله وإقام الصلاة وإيتاء الزكاة وحج البيت وصوم رمضان ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of 'Abdullah son of 'Umar that the Messenger of Allah (may peace be upon him) said:                      (The superstructure of) al-Islam is raised on five (pillars), testifying (the fact) that there is no god but Allah, that Muhammad is His bondsman and messenger, and the establishment of prayer, payment of Zakat, Pilgrimage to the House (Ka'ba) and the fast of Ramadan.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20163",
        "11217",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-390",
      "hadith_no": "390",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني محمد بن رافع، والفضل بن سهل الأعرج، قالا حدثنا شبابة بن سوار، حدثنا عاصم، - وهو ابن محمد العمري - عن أبيه، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الإسلام بدأ غريبا وسيعود غريبا كما بدأ وهو يأرز بين المسجدين كما تأرز الحية في جحرها ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Ibn 'Umar ('Abdullah b. 'Umar) that the Messenger of Allah (may peace be upon him) observed:                      Verily Islam started as something strange and it would again revert (to its old position) of being strange just as it started, and it would recede between the two mosques just as the serpent crawls back into its hole.",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "30264",
        "20426",
        "20163",
        "11217",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-3871",
      "hadith_no": "3871",
      "source": "Sahih Muslim",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "وحدثني حميد بن مسعدة، حدثنا بشر بن المفضل، حدثنا عاصم، - وهو ابن محمد العمري - حدثنا واقد، - يعني أخاه - حدثني سعيد ابن مرجانة، - صاحب علي بن حسين - قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما امرئ مسلم أعتق امرأ مسلما استنقذ الله بكل عضو منه عضوا منه من النار ‏\"‏ ‏.‏ قال فانطلقت حين سمعت الحديث من أبي هريرة فذكرته لعلي بن الحسين فأعتق عبدا له قد أعطاه به ابن جعفر عشرة آلاف درهم أو ألف دينار ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      A Muslim who emancipates a Muslim (slave). Allah will save from Fire every limb of his for every limb (of the slave). Sa'id b. Marjana said: When I heard this hadith from Abu Huraira (Allah be pleased with him), I went away and made a mention of it to 'Ali b. Husain and he at once emancipated the slave for which Ibn ja'far was prepared to pay ten thousand dirhams or one thousand dinars.",
      "usc_msa_ref": "",
      "chain": [
        "30430",
        "20212",
        "20163",
        "11571",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-4807",
      "hadith_no": "4807",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا أحمد بن عبد الله بن يونس، حدثنا عاصم بن محمد بن زيد، عن أبيه، قال قال عبد الله قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يزال هذا الأمر في قريش ما بقي من الناس اثنان ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of 'Abdullah that the Messenger of Allah (may peace be upon him) said:                      The Caliphate will remain among the Quraish even if only two persons are left (on the earth),",
      "usc_msa_ref": "",
      "chain": [
        "30184",
        "20163",
        "11217",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-4899",
      "hadith_no": "4899",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا عاصم، - وهو ابن محمد بن زيد - عن زيد بن محمد، عن نافع، قال جاء عبد الله بن عمر إلى عبد الله بن مطيع حين كان من أمر الحرة ما كان زمن يزيد بن معاوية فقال اطرحوا لأبي عبد الرحمن وسادة فقال إني لم آتك لأجلس أتيتك لأحدثك حديثا سمعت رسول الله صلى الله عليه وسلم يقوله سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من خلع يدا من طاعة لقي الله يوم القيامة لا حجة له ومن مات وليس في عنقه بيعة مات ميتة جاهلية ‏\"‏ ‏.‏",
      "text_en": " It has been reported on the authority of Nafi, that 'Abdullah b. Umar paid a visit to Abdullah b. Muti' in the days (when atrocities were perpetrated on the People Of Medina) at Harra in the time of Yazid b. Mu'awiya. Ibn Muti' said:                      Place a pillow for Abu 'Abd al-Rahman (family name of 'Abdullah b. 'Umar). But the latter said: I have not come to sit with you. I have come to you to tell you a tradition I heard from the Messenger of Allah (may peace be upon him). I heard him say: One who withdraws his band from obedience (to the Amir) will find no argument (in his defence) when he stands before Allah on the Day of Judgment, and one who dies without having bound himself by an oath of allegiance (to an Amir) will die the death of one belonging to the days of Jahillyya.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "20163",
        "11014"
      ]
    },
    {
      "id": "sunan-abi-daud-3598",
      "hadith_no": "3598",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن الحسين بن إبراهيم، حدثنا عمر بن يونس، حدثنا عاصم بن محمد بن زيد العمري، حدثني المثنى بن يزيد، عن مطر الوراق، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمعناه قال ‏\"‏ ومن أعان على خصومة بظلم فقد باء بغضب من الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Ibn 'Umar from the Prophet (ﷺ) through different chain of narrators to the same effect. In this version he also said:                      \"He who assits in a dispute unjustly deserves the anger of Allah, Most High.",
      "usc_msa_ref": "",
      "chain": [
        "11045",
        "20450",
        "20163",
        "10719",
        "11014",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1673",
      "hadith_no": "1673",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن عبدة الضبي البصري، حدثنا سفيان بن عيينة، عن عاصم بن محمد، عن أبيه، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لو أن الناس يعلمون ما أعلم من الوحدة ما سرى راكب بليل ‏\"‏ ‏.‏ يعني وحده ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     That the Messenger of Allah (ﷺ) said: \"If the people knew what I know about being alone, then a rider would not journey at night.\" - meaning alone.",
      "usc_msa_ref": "",
      "chain": [
        "30423",
        "20005",
        "20163",
        "11217",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-3557",
      "hadith_no": "3557",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، حدثنا بقية، عن مسلم بن عبد الله، عن زياد بن عبد الله، عن عاصم بن محمد بن زيد بن عبد الله بن عمر، عن أبيه، عن جده، قال نهانا رسول الله  صلى الله عليه وسلم  أن نشرب على بطوننا وهو الكرع ونهانا أن نغترف باليد الواحدة وقال ‏\"‏ لا يلغ أحدكم كما يلغ الكلب ولا يشرب باليد الواحدة كما يشرب القوم الذين سخط الله عليهم ولا يشرب بالليل من إناء حتى يحركه إلا أن يكون إناء مخمرا ومن شرب بيده وهو يقدر على إناء يريد التواضع كتب الله له بعدد أصابعه حسنات وهو إناء عيسى ابن مريم عليهما السلام إذ طرح القدح فقال أف هذا مع الدنيا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Asim bin Muhammad bin Zaid bin ‘Abdullah, fromhisfather, that his grandfather said:                      “The Messenger of Allah (ﷺ)forbade us to drink while (lying) on our bellies, lapping up water,and he forbade us to drink from one hand only. He said: ‘None ofyoushould lap up water as a dog does, and he should not drink waterfromone hand as the people with whom Allah is angry do, and heshould notdrink from a vessel at night without stirring it first,unless thevessel was covered. Whoever drinks from his hand when heis able todrink from a vessel, with the intention of humility, Allahwill recordgood deeds equivalent to the number of fingers for him.It (i.e., thehand) is the vessel of ‘Eisa bin Maryam, (as) when hethrew away thecup and said: ‘Ugh! That belongs to this world.’”",
      "usc_msa_ref": "",
      "chain": [
        "20644",
        "20163",
        "11217"
      ]
    },
    {
      "id": "sunan-ibn-majah-3768-2",
      "hadith_no": "3768",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن عاصم بن محمد، عن أبيه، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لو يعلم أحدكم ما في الوحدة ما سار أحد بليل وحده ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Messenger of Allah(ﷺ) said:                     \"If anyone of you knew what is wrong with being alone, no one would travel at night by himself.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "20163",
        "11217",
        "18"
      ]
    }
  ],
  "total_hadiths": 19
}