{
  "id": "20168",
  "name": "'Ali bin al-Hakam bin Zabyan علي بن الحكم بن ظبيان",
  "full_name": "'Ali bin al-Hakam bin Zabyan علي بن الحكم بن ظبيان",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "226",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Tirmidh",
      "Merv"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  س  -  ثقة ]"
    ],
    "tags": [
      "Ansar",
      "al-Mervazi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "24193",
      "name": "Salam bin Sulaiman al-Mzny سلام بن سليمان المزني",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "24312",
      "name": "'Ady bin al-Fadl al-Taymi عدي بن الفضل التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "24130",
      "name": "Rafa'i bin Salmah bin Ziyad رافع بن سلمة بن زياد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-2488",
      "hadith_no": "2488",
      "source": "Sahih Bukhari",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا علي بن الحكم الأنصاري، حدثنا أبو عوانة، عن سعيد بن مسروق، عن عباية بن رفاعة بن رافع بن خديج، عن جده، قال كنا مع النبي صلى الله عليه وسلم بذي الحليفة فأصاب الناس جوع فأصابوا إبلا وغنما‏.‏ قال وكان النبي صلى الله عليه وسلم في أخريات القوم فعجلوا وذبحوا ونصبوا القدور، فأمر النبي صلى الله عليه وسلم بالقدور فأكفئت، ثم قسم فعدل عشرة من الغنم ببعير فند منها بعير، فطلبوه فأعياهم، وكان في القوم خيل يسيرة فأهوى رجل منهم بسهم فحبسه الله ثم قال ‏\"‏ إن لهذه البهائم أوابد كأوابد الوحش فما غلبكم منها فاصنعوا به هكذا ‏\"‏‏.‏ فقال جدي إنا نرجو  أو نخاف  العدو غدا، وليست معنا مدى أفنذبح بالقصب‏.‏ قال ‏\"‏ ما أنهر الدم وذكر اسم الله عليه، فكلوه، ليس السن والظفر، وسأحدثكم عن ذلك، أما السن فعظم وأما الظفر فمدى الحبشة ‏\"‏‏.‏",
      "text_en": " Narrated 'Abaya bin Rafa'a bin Raft' bin Khadij:                     My grandfather said, \"We were in the company of the Prophet at Dhul-Hulaifa. The people felt hungry and captured some camels and sheep (as booty). The Prophet was behind the people. They hurried and slaughtered the animals and put their meat in pots and started cooking it. (When the Prophet came) he ordered the pots to be upset and then he distributed the animals (of the booty), regarding ten sheep as equal to one camel. One of the camels fled and the people ran after it till they were exhausted. At that time there were few horses. A man threw an arrow at the camel, and Allah stopped the camel with it. The Prophet said, \"Some of these animals are like wild animals, so if you lose control over one of these animals, treat it in this way (i.e. shoot it with an arrow).\" Before distributing them among the soldiers my grandfather said, \"We may meet the enemies in the future and have no knives; can we slaughter the animals with reeds?\" The Prophet said, \"Use whatever causes blood to flow, and eat the animals if the name of Allah has been mentioned on slaughtering them. Do not slaughter with teeth or fingernails and I will tell you why: It is because teeth are bones (i.e. cannot cut properly) and fingernails are the tools used by the Ethiopians (whom we should not imitate for they are infidels).",
      "usc_msa_ref": "668",
      "chain": [
        "20168",
        "20469",
        "20016",
        "11179"
      ]
    },
    {
      "id": "sahih-bukhari-5125",
      "hadith_no": "5125",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا علي بن الحكم الأنصاري، حدثنا أبو عوانة، عن رقبة، عن طلحة اليامي، عن سعيد بن جبير، قال قال لي ابن عباس هل تزوجت قلت لا‏.‏ قال فتزوج فإن خير هذه الأمة أكثرها نساء‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     Ibn `Abbas asked me, \"Are you married?\" I replied, \"No.\" He said, \"Marry, for the best person of this (Muslim) nation (i.e., Muhammad) of all other Muslims, had the largest number of wives.\"",
      "usc_msa_ref": "7",
      "chain": [
        "20168",
        "20469",
        "11050"
      ]
    }
  ],
  "total_hadiths": 2
}