{
  "id": "20166",
  "name": "'Abdul 'Aziz bin 'Umar bin 'Abdul-'Aziz عبد العزيز بن عمر بن عبد العزيز",
  "full_name": "'Abdul 'Aziz bin 'Umar bin 'Abdul-'Aziz عبد العزيز بن عمر بن عبد العزيز",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "150",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ ع  -  صدوق يخطئ ]"
    ],
    "tags": [
      "B.Umayya",
      "al-Madni",
      "Kufi"
    ]
  },
  "parents": [
    {
      "id": "11010",
      "name": "'Umar bin ‘Abdul-‘Aziz عمر بن عبد العزيز",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11010",
      "name": "'Umar bin ‘Abdul-‘Aziz عمر بن عبد العزيز",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "15619",
      "name": "Yahya bin Isma'il bin Jryr يحيى بن إسماعيل بن جرير",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11176",
      "name": "Salah bin Kaysan al-Madni صالح بن كيسان المدني أبو محمد",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11847",
      "name": "al-Rabi' bin Sbrh bin الربيع بن سبرة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "16121",
      "name": "Abu Ta'ma أبو طعمة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11028",
      "name": "Mujahid bin Jabir مجاهد بن جبر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11066",
      "name": "Makhul al-Shami/al-Damashiqi مكحول الشامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "18248",
      "name": "Khalid bin al-Lajlaj al-Amiri خالد بن اللجلاج العامري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11500",
      "name": "Isma'il bin Muhammad bin Sa'd إسماعيل بن محمد بن سعد بن أبي وقاص الزهر",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11069",
      "name": "al-Hakam bin 'Utayba الحكم بن عتيبة",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "11667",
      "name": "Ibrahim bin Abi Ablh إبراهيم بن أبي عبلة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11240",
      "name": "Ibrahim bin Maysara al-Ta'ifi إبراهيم بن ميسرة الطائفي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10846",
      "name": "Yonus bin Abi Ishaq يونس بن أبي إسحاق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20507",
      "name": "'Abdullah bin 'Umar bin Hafs bin 'Asim عبد الله بن عمر بن حفص بن عاصم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20402",
      "name": "Yahya bin Hamza bin Waqd يحيى بن حمزة بن واقد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20366",
      "name": "Yahya bin Zakaria bin Abi Zaida يحيى بن زكريا بن أبي زائدة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20330",
      "name": "'Abdullah bin Da'ud al-Kharaybi عبد الله بن داود أبو عبد الرحمن الخريبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30212",
      "name": "Muhammad bin 'Abdullah bin Numayr محمد بن عبد الله بن نمير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20337",
      "name": "'Abdah bin Sulaiman al-Klabi عبدة بن سليمان الكلابي أبو محمد الكوفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20157",
      "name": "Abu Damra, Anas bin 'Ayyad أنس بن عياض الليثي - أبو ضمرة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20345",
      "name": "'Ali bin Ms'hr علي بن مسهر",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20352",
      "name": "Muhammad bin Bashr bin al-Farafsa محمد بن بشر بن الفرافصة العبدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-4659",
      "hadith_no": "4659",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا محمد بن بشر، حدثنا عبد العزيز بن عمر بن عبد العزيز، قال حدثني نافع، عن ابن عمر  رضى الله عنهما  قال نزل تحريم الخمر وإن في المدينة يومئذ لخمسة أشربة، ما فيها شراب العنب‏.‏",
      "text_en": " Narrated Ibn `Umar:                     (The Verse of) prohibiting alcoholic drinks was revealed when there were in Medina five kinds of (alcoholic) drinks none of which was produced from grapes.",
      "usc_msa_ref": "140",
      "chain": [
        "30123",
        "20352",
        "20166",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-3887",
      "hadith_no": "3887",
      "source": "Sunan Abi Da'ud",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا إبراهيم بن مهدي المصيصي، حدثنا علي بن مسهر، عن عبد العزيز بن عمر بن عبد العزيز، عن صالح بن كيسان، عن أبي بكر بن سليمان بن أبي حثمة، عن الشفاء بنت عبد الله، قالت دخل على رسول الله صلى الله عليه وسلم وأنا عند حفصة فقال لي ‏\"‏ ألا تعلمين هذه رقية النملة كما علمتيها الكتابة ‏\"‏ ‏.‏",
      "text_en": " Narrated Ash-Shifa', daughter of Abdullah,:                     The Messenger of Allah (ﷺ) entered when I was with Hafsah, and he said to me: Why do you not teach this one the spell for skin eruptions as you taught her writing.",
      "usc_msa_ref": "",
      "chain": [
        "20345",
        "20166",
        "11176",
        "11547"
      ]
    },
    {
      "id": "sunan-abi-daud-4435",
      "hadith_no": "4435",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا عبدة بن عبد الله، ومحمد بن داود بن صبيح، قال عبدة أخبرنا حرمي بن حفص، قال حدثنا محمد بن عبد الله بن علاثة، حدثنا عبد العزيز بن عمر بن عبد العزيز، أن خالد بن اللجلاج، حدثه أن اللجلاج أباه أخبره أنه، كان قاعدا يعتمل في السوق فمرت امرأة تحمل صبيا فثار الناس معها وثرت فيمن ثار فانتهيت إلى النبي صلى الله عليه وسلم وهو يقول ‏\"‏ من أبو هذا معك ‏\"‏ ‏.‏ فسكتت فقال شاب حذوها أنا أبوه يا رسول الله ‏.‏ فأقبل عليها فقال ‏\"‏ من أبو هذا معك ‏\"‏ ‏.‏ قال الفتى أنا أبوه يا رسول الله ‏.‏ فنظر رسول الله صلى الله عليه وسلم إلى بعض من حوله يسألهم عنه فقالوا ما علمنا إلا خيرا ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ أحصنت ‏\"‏ ‏.‏ قال نعم ‏.‏ فأمر به فرجم ‏.‏ قال فخرجنا به فحفرنا له حتى أمكنا ثم رميناه بالحجارة حتى هدأ فجاء رجل يسأل عن المرجوم فانطلقنا به إلى النبي صلى الله عليه وسلم فقلنا هذا جاء يسأل عن الخبيث ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لهو أطيب عند الله من ريح المسك ‏\"‏ ‏.‏ فإذا هو أبوه فأعناه على غسله وتكفينه ودفنه وما أدري قال والصلاة عليه أم لا ‏.‏ وهذا حديث عبدة وهو أتم ‏.‏",
      "text_en": " Narrated Al-Lajlaj al-Amiri:                     I was working in the market. A woman passed carrying a child. The people rushed towards her, and I also rushed along with them.  I then went to the Prophet (ﷺ) while he was asking: Who is the father of this (child) who is with you? She remained silent.  A young man by her side said: I am his father, Messenger of Allah!  He then turned towards her and asked: Who is the father of this child with you?  The young man said: I am his father, Messenger of Allah! The Messenger of Allah (ﷺ) then looked at some of those who were around him and asked them about him. They said: We only know good (about him).  The Prophet (ﷺ) said to him: Are you married?  He said: Yes. So he gave orders regarding him and he was stoned to death.  He (the narrator) said: We took him out, dug a pit for him and put him in it. We then threw stones at him until he died. A man then came asking about the man who was stoned.  We brought him to the Prophet (ﷺ) and said: This man has come asking about the wicked man.  The Messenger of Allah (ﷺ) said: He is more agreeable than the fragrance of musk in the eyes of Allah. The man was his father. We then helped him in washing, shrouding and burying him. (The narrator said:) I do not know whether he said or did not say \"in praying over him.\" This is the tradition of Abdah, and it is more accurate.",
      "usc_msa_ref": "",
      "chain": [
        "30149",
        "20337",
        "30129",
        "28523",
        "20166",
        "18248"
      ]
    },
    {
      "id": "sunan-abi-daud-4587",
      "hadith_no": "4587",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا حفص، حدثنا عبد العزيز بن عمر بن عبد العزيز، حدثني بعض الوفد الذين، قدموا على أبي قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما طبيب تطبب على قوم لا يعرف له تطبب قبل ذلك فأعنت فهو ضامن ‏\"‏ ‏.‏ قال عبد العزيز أما إنه ليس بالنعت إنما هو قطع العروق والبط والكى ‏.‏",
      "text_en": " Narrated AbdulAziz ibn Umar ibn AbdulAziz:                     Some people of the deputation which came to my father reported the Messenger of Allah (ﷺ) as saying: Any physician who practises medicine when he was not known as a practitioner before that and he harms (the patients) he will be held responsible. AbdulAziz said: Here physician does not refer to a man by qualification. it means opening a vein, incision and cauterisation.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20317",
        "20166"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2258",
      "hadith_no": "2258",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Inheritance - كتاب الفرائض عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو أسامة، وابن، نمير ووكيع عن عبد العزيز بن عمر بن عبد العزيز، عن عبد الله بن موهب، وقال، بعضهم عن عبد الله بن وهب، عن تميم الداري، قال سألت رسول الله صلى الله عليه وسلم ما السنة في الرجل من أهل الشرك يسلم على يدى رجل من المسلمين فقال رسول الله صلى الله عليه وسلم ‏\"‏ هو أولى الناس بمحياه ومماته ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث لا نعرفه إلا من حديث عبد الله بن وهب ويقال ابن موهب عن تميم الداري ‏.‏ وقد أدخل بعضهم بين عبد الله بن وهب وبين تميم الداري قبيصة بن ذؤيب ولا يصح رواه يحيى بن حمزة عن عبد العزيز بن عمر وزاد فيه قبيصة بن ذؤيب وهو عندي ليس بمتصل ‏.‏ والعمل على هذا الحديث عند بعض أهل العلم وقال بعضهم يجعل ميراثه في بيت المال وهو قول الشافعي واحتج بحديث النبي صلى الله عليه وسلم ‏\"‏ أن الولاء لمن أعتق ‏\"‏ ‏.‏",
      "text_en": " Abudullah bin Mawhab - and some of them said- 'Abdullah bin Wahb, narrated from Tamim Ad-Dari who said:                      'I asked the  Messenger of Allah(S.A.W): What is the Sunnah regarding a man among the people of the Shirk who accepts Islam at the hand of a man among the Muslims?' So the Messenger of Allah(S.A.W) said:\"He is the closet of the people to him in his life and in his death.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20318",
        "20166",
        "19811",
        "20029",
        "382"
      ]
    },
    {
      "id": "sunan-ibn-majah-3505",
      "hadith_no": "3505",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا علي بن محمد، ومحمد بن إسماعيل، قالا حدثنا وكيع، حدثنا عبد العزيز بن عمر بن عبد العزيز، عن عبد الرحمن بن عبد الله الغافقي، وأبي، طعمة مولاهم أنهما سمعا ابن عمر، يقول قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لعنت الخمر على عشرة أوجه بعينها وعاصرها ومعتصرها وبائعها ومبتاعها وحاملها والمحمولة إليه وآكل ثمنها وشاربها وساقيها ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Umar that the Messenger of Allah (ﷺ)said:                     “Wine is cursed from ten angles: The wine itself, the one whosqueezes (the grapes etc), the one for whom it is squeezed, the onewho sells it, the one who buys it, the one who carries it, the one towhom it is carried, the one who consumes its price, the one whodrinksit and the one who pours it.”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "34188",
        "20032",
        "20166",
        "18634",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-3882",
      "hadith_no": "3882",
      "source": "Sunan Ibn Majah",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر، حدثنا محمد بن بشر، ح وحدثنا علي بن محمد، حدثنا وكيع، جميعا عن عبد العزيز بن عمر بن عبد العزيز، حدثني هلال، مولى عمر بن عبد العزيز عن عمر بن عبد العزيز، عن عبد الله بن جعفر، عن أمه، أسماء ابنة عميس قالت علمني رسول الله  صلى الله عليه وسلم  كلمات أقولهن عند الكرب ‏\"‏ الله الله ربي لا أشرك به شيئا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Asma’ bint ‘Umais said:                      “The Messenger of Allah (ﷺ) taught me some words to say at times of distress: Allah! Allahu Rabbi la ushriku bihi shay’an (Allah, Allah is my Lord, I do not associate anything with Him).”",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "20352",
        "38409",
        "20032",
        "20166",
        "11010",
        "108",
        "69"
      ]
    }
  ],
  "total_hadiths": 7
}