{
  "id": "20165",
  "name": "'Abdul 'Aziz bin Abi Hazim عبد العزيز بن أبي حازم",
  "full_name": "'Abdul 'Aziz bin Abi Hazim عبد العزيز بن أبي حازم",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "biography": {
    "birth": {
      "date_hijri": "107",
      "date_gregorian": "NA",
      "date_display": [
        "107 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "184",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ع  -  صدوق ]",
      "Fiqh"
    ],
    "tags": [
      "Client",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "11172",
      "name": "Abu Hazim, Salma bin Dinar سلمة بن دينار أبو حازم الأعرج",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11172",
      "name": "Abu Hazim, Salma bin Dinar سلمة بن دينار أبو حازم الأعرج",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11173",
      "name": "Suhayl bin Abi Salah سهيل بن أبي صالح",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11106",
      "name": "Musa bin 'Uqba موسى بن عقبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11234",
      "name": "Yazid bin 'Abdullah bin Usama B. al-Haad يزيد بن عبد الله بن أسامة بن الهاد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10606",
      "name": "al-Ala' bin 'Abdur Rahman bin Ya'qub العلاء بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20164",
      "name": "'Abdullah bin Muslima al-Qa'nabi عبد الله بن مسلمة بن قعنب القعنبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30101",
      "name": "Ibrahim bin Hamza bin Muhammad إبراهيم بن حمزة بن محمد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30103",
      "name": "Isma'il bin 'Abdullah bin 'Abdullah إسماعيل بن عبد الله بن عبد الله بن أويس",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30232",
      "name": "Sa'id bin Abi Maryam سعيد بن أبي مريم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30116",
      "name": "Sa'id bin Mnswr bin Sh'bh سعيد بن منصور بن شعبة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30547",
      "name": "Swyd bin Sa'id سويد بن سعيد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30418",
      "name": "'Abdullah bin al-Zubair bin 'Isa عبد الله بن الزبير بن عيسى الحميدي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "22141",
      "name": "Abd al-Wahd bin Aby عبد الواحد بن أبي عون",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "30263",
      "name": "'Amr bin Muhammad bin Bukayr عمرو بن محمد بن بكير الناقد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30515",
      "name": "Muhammad bin Hyan محمد بن حيان",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30107",
      "name": "Muhammad bin 'Ubaidullah bin Muhammad محمد بن عبيد الله بن محمد بن زيد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30400",
      "name": "Y'aqub bin Ibrahim bin Kathir يعقوب بن إبراهيم بن كثير بن زيد الدورقي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30399",
      "name": "Yahya bin Yahya bin Bukayr يحيى بن يحيى بن بكير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38696",
      "name": "Yahya bin Aktham bin Muhammad يحيى بن أكثم بن محمد بن قطن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20387",
      "name": "'Ali bin Hujr bin Iyas bin Maqatil علي بن حجر بن إياس بن مقاتل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "35125",
      "name": "Muhammad bin Sulaiman bin Habib محمد بن سليمان بن حبيب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "33021",
      "name": "Muhammad bin Znbwr محمد بن زنبور",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "441",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا قتيبة بن سعيد، قال حدثنا عبد العزيز بن أبي حازم، عن أبي حازم، عن سهل بن سعد، قال جاء رسول الله صلى الله عليه وسلم بيت فاطمة، فلم يجد عليا في البيت فقال ‏\"‏ أين ابن عمك ‏\"‏‏.‏ قالت كان بيني وبينه شىء، فغاضبني فخرج فلم يقل عندي‏.‏ فقال رسول الله صلى الله عليه وسلم لإنسان ‏\"‏ انظر أين هو ‏\"‏‏.‏ فجاء فقال يا رسول الله، هو في المسجد راقد، فجاء رسول الله صلى الله عليه وسلم وهو مضطجع، قد سقط رداؤه عن شقه، وأصابه تراب، فجعل رسول الله صلى الله عليه وسلم يمسحه عنه ويقول ‏\"‏ قم أبا تراب، قم أبا تراب ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     Allah's Apostle went to Fatima's house but did not find `Ali there. So he asked, \"Where is your cousin?\" She replied, \"There was something between us and he got angry with me and went out. He did not sleep (midday nap) in the house.\" Allah's Apostle asked a person to look for him. That person came and said, \"O Allah's Apostle! He (Ali) is sleeping in the mosque.\" Allah's Apostle went there and `Ali was lying. His upper body cover had fallen down to one side of his body and he was covered with dust. Allah's Apostle started cleaning the dust from him saying: \"Get up! O Aba Turab. Get up! O Aba Turab (literally means: O father of dust).",
      "chain": [
        "30367",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "496",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عمرو بن زرارة، قال أخبرنا عبد العزيز بن أبي حازم، عن أبيه، عن سهل، قال كان بين مصلى رسول الله صلى الله عليه وسلم وبين الجدار ممر الشاة‏.‏",
      "text_en": " Narrated Sahl (bin Sa`d):                     The distance between the Musalla of Allah's Apostle and the wall was just sufficient for a sheep to pass through .",
      "chain": [
        "30365",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "528",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا إبراهيم بن حمزة، قال حدثني ابن أبي حازم، والدراوردي، عن يزيد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ أرأيتم لو أن نهرا بباب أحدكم، يغتسل فيه كل يوم خمسا، ما تقول ذلك يبقي من درنه ‏\"‏‏.‏ قالوا لا يبقي من درنه شيئا‏.‏ قال ‏\"‏ فذلك مثل الصلوات الخمس، يمحو الله بها الخطايا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard Allah's Apostle saying, \"If there was a river at the door of anyone of you and he took a bath in it five times a day would you notice any dirt on him?\" They said, \"Not a trace of dirt would be left.\" The Prophet added, \"That is the example of the five prayers with which Allah blots out (annuls) evil deeds.\"",
      "chain": [
        "30101",
        "20165",
        "20167",
        "20304",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "939",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن مسلمة، قال حدثنا ابن أبي حازم، عن أبيه، عن سهل، بهذا وقال ما كنا نقيل ولا نتغدى إلا بعد الجمعة‏.‏",
      "text_en": " Narrated Sahl:                     As above with the addition: We never had an afternoon nap nor meals except after offering the Jumua prayer.",
      "chain": [
        "20164",
        "20165",
        "11172"
      ]
    },
    {
      "hadith_no": "1201",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا عبد العزيز بن أبي حازم، عن أبيه، عن سهل  رضى الله عنه  قال خرج النبي صلى الله عليه وسلم يصلح بين بني عمرو بن عوف، وحانت الصلاة، فجاء بلال أبا بكر  رضى الله عنهما  فقال حبس النبي صلى الله عليه وسلم فتؤم الناس قال نعم إن شئتم‏.‏ فأقام بلال الصلاة، فتقدم أبو بكر  رضى الله عنه  فصلى، فجاء النبي صلى الله عليه وسلم يمشي في الصفوف يشقها شقا حتى قام في الصف الأول، فأخذ الناس بالتصفيح‏.‏ قال سهل هل تدرون ما التصفيح هو التصفيق‏.‏ وكان أبو بكر  رضى الله عنه  لا يلتفت في صلاته، فلما أكثروا التفت فإذا النبي صلى الله عليه وسلم في الصف، فأشار إليه مكانك‏.‏ فرفع أبو بكر يديه، فحمد الله، ثم رجع القهقرى وراءه وتقدم النبي صلى الله عليه وسلم فصلى‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     The Prophet went out to affect a reconciliation between the tribes of Bani `Amr bin `Auf and the time of the prayer became due; Bilal went to Abu Bakr and said, \"The Prophet is detained. Will you lead the people in the prayer?\" Abu Bakr replied, \"Yes, if you wish.\" So Bilal pronounced the Iqama and Abu Bakr led the prayer. In the meantime the Prophet came crossing the rows (of the praying people) till he stood in the first row and the people started clapping. Abu Bakr never looked hither and thither during the prayer but when the people clapped too much, he looked back and saw the Prophet in the (first) row. The Prophet waved him to remain at his place, but Abu Bakr raised both his hands and sent praises to Allah and then retreated and the Prophet went forward and led the prayer. (See Hadith No. 295 & 296)",
      "chain": [
        "20164",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "1277",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا ابن أبي حازم، عن أبيه، عن سهل  رضى الله عنه  أن امرأة، جاءت النبي صلى الله عليه وسلم ببردة منسوجة فيها حاشيتها  أتدرون ما البردة قالوا الشملة‏.‏ قال نعم‏.‏ قالت نسجتها بيدي، فجئت لأكسوكها‏.‏ فأخذها النبي صلى الله عليه وسلم محتاجا إليها، فخرج إلينا وإنها إزاره، فحسنها فلان فقال اكسنيها، ما أحسنها‏.‏ قال القوم ما أحسنت، لبسها النبي صلى الله عليه وسلم محتاجا إليها، ثم سألته وعلمت أنه لا يرد‏.‏ قال إني والله ما سألته لألبسها إنما سألته لتكون كفني‏.‏ قال سهل فكانت كفنه‏.‏",
      "text_en": " Narrated Sahl:                     A woman brought a woven Burda (sheet) having edging (border) to the Prophet, Then Sahl asked them whether they knew what is Burda, they said that Burda is a cloak and Sahl confirmed their reply. Then the woman said, \"I have woven it with my own hands and I have brought it so that you may wear it.\" The Prophet accepted it, and at that time he was in need of it. So he came out wearing it as his waist-sheet. A man praised it and said, \"Will you give it to me? How nice it is!\" The other people said, \"You have not done the right thing as the Prophet is in need of it and you have asked for it when you know that he never turns down anybody's request.\" The man replied, \"By Allah, I have not asked for it to wear it but to make it my shroud.\" Later it was his shroud.",
      "chain": [
        "20164",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "1917",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا ابن أبي حازم، عن أبيه، عن سهل بن سعد، ح‏.‏ حدثني سعيد بن أبي مريم، حدثنا أبو غسان، محمد بن مطرف قال حدثني أبو حازم، عن سهل بن سعد، قال أنزلت ‏{‏وكلوا واشربوا حتى يتبين لكم الخيط الأبيض من الخيط الأسود‏}‏ ولم ينزل من الفجر، فكان رجال إذا أرادوا الصوم ربط أحدهم في رجله الخيط الأبيض والخيط الأسود، ولم يزل يأكل حتى يتبين له رؤيتهما، فأنزل الله بعد ‏{‏من الفجر‏}‏ فعلموا أنه إنما يعني الليل والنهار‏.‏",
      "text_en": " Narrated Sahl bin Saud:                     When the following verses were revealed: 'Eat and drink until the white thread appears to you, distinct from the black thread' and of dawn was not revealed, some people who intended to fast, tied black and white threads to their legs and went on eating till they differentiated between the two. Allah then revealed the words, 'of dawn', and it became clear that meant night and day.",
      "chain": [
        "30232",
        "20165",
        "11172",
        "399",
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "1920",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن عبيد الله، حدثنا عبد العزيز بن أبي حازم، عن أبي حازم، عن سهل بن سعد  رضى الله عنه  قال كنت أتسحر في أهلي، ثم تكون سرعتي أن أدرك السجود مع رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     I used to take my Suhur meals with my family and then hurry up for presenting myself for the (Fajr) prayer with Allah's Apostle.",
      "chain": [
        "30213",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "1967",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا إبراهيم بن حمزة، حدثني ابن أبي حازم، عن يزيد، عن عبد الله بن خباب، عن أبي سعيد الخدري  رضى الله عنه  أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تواصلوا، فأيكم أراد أن يواصل فليواصل حتى السحر ‏\"‏‏.‏ قالوا فإنك تواصل، يا رسول الله‏.‏ قال ‏\"‏ لست كهيئتكم، إني أبيت لي مطعم يطعمني وساق يسقين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle said, \"Do not fast continuously day and night (practice Al-Wisal) and if anyone of you intends to fast continuously day and night, he should continue till the Suhur time.\" They said, \"But you practice Al-Wisal, O Allah's Apostle!\" The Prophet said, \"I am not similar to you;. during my sleep I have One Who makes me eat and drink.\"",
      "chain": [
        "30101",
        "20165",
        "20472",
        "11182",
        "38"
      ]
    },
    {
      "hadith_no": "2018",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Night of Qadr - كتاب فضل ليلة القدر",
      "chapter_no": "32",
      "text_ar": "حدثنا إبراهيم بن حمزة، قال حدثني ابن أبي حازم، والدراوردي، عن يزيد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي سعيد الخدري  رضى الله عنه ‏.‏ كان رسول الله صلى الله عليه وسلم يجاور في رمضان العشر التي في وسط الشهر، فإذا كان حين يمسي من عشرين ليلة تمضي، ويستقبل إحدى وعشرين، رجع إلى مسكنه ورجع من كان يجاور معه‏.‏ وأنه أقام في شهر جاور فيه الليلة التي كان يرجع فيها، فخطب الناس، فأمرهم ما شاء الله، ثم قال ‏\"‏ كنت أجاور هذه العشر، ثم قد بدا لي أن أجاور هذه العشر الأواخر، فمن كان اعتكف معي فليثبت في معتكفه، وقد أريت هذه الليلة ثم أنسيتها فابتغوها في العشر الأواخر وابتغوها في كل وتر، وقد رأيتني أسجد في ماء وطين ‏\"‏‏.‏ فاستهلت السماء في تلك الليلة، فأمطرت، فوكف المسجد في مصلى النبي صلى الله عليه وسلم ليلة إحدى وعشرين، فبصرت عيني رسول الله صلى الله عليه وسلم ونظرت إليه انصرف من الصبح، ووجهه ممتلئ طينا وماء‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle used to practice I`tikaf (in the mosque) in the middle third of Ramadan and after passing the twenty nights he used to go back to his house on the 21st, and the people who were in I`tikaf with him also used to go back to their houses. Once in Ramadan, in which he practiced I`tikaf, he established the night prayers at the night in which he used to return home, and then he addressed the people and ordered them whatever Allah wished him to order and said, \"I used to practice I`tikaf for these ten days (i.e. the middle third but now I intend to stay in I`tikaf for the last ten days (of the month); so whoever was in I`tikaf with me should stay at his place of seclusion. I have verily been shown (the date of) this Night (of Qadr) but I have forgotten it. So search for it in the odd nights of the last ten days (of this month). I also saw myself (in the dream) prostrating in mud and water.\" On the night of the 21st, the sky was covered with clouds and it rained, and the rainwater started leaking through the roof of the mosque at the praying place of the Prophet . I saw with my own eyes the Prophet at the completion of the morning prayer leaving with his face covered with mud and water.",
      "chain": [
        "30101",
        "20165",
        "20167",
        "20304",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "2567",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا عبد العزيز بن عبد الله الأويسي، حدثنا ابن أبي حازم، عن أبيه، عن يزيد بن رومان، عن عروة، عن عائشة  رضى الله عنها  أنها قالت لعروة ابن أختي، إن كنا لننظر إلى الهلال ثم الهلال، ثلاثة أهلة في شهرين، وما أوقدت في أبيات رسول الله صلى الله عليه وسلم نار‏.‏ فقلت يا خالة ما كان يعيشكم قالت الأسودان التمر والماء، إلا أنه قد كان لرسول الله صلى الله عليه وسلم جيران من الأنصار كانت لهم منائح، وكانوا يمنحون رسول الله صلى الله عليه وسلم من ألبانهم، فيسقينا‏.‏",
      "text_en": " Narrated `Urwa:                     Aisha said to me, \"O my nephew! We used to see the crescent, and then the crescent and then the crescent in this way we saw three crescents in two months and no fire (for cooking) used to be made in the houses of Allah's Apostle. I said, \"O my aunt! Then what use to sustain you?\" `Aisha said, \"The two black things: dates and water, our neighbors from Ansar had some Manarh and they used to present Allah's Apostle some of their milk and he used to make us drink.\"",
      "chain": [
        "30105",
        "20165",
        "11172",
        "11233",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2911",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا عبد العزيز بن أبي حازم، عن أبيه، عن سهل  رضى الله عنه  أنه سئل عن جرح النبي، صلى الله عليه وسلم يوم أحد‏.‏ فقال جرح وجه النبي صلى الله عليه وسلم وكسرت رباعيته وهشمت البيضة على رأسه، فكانت فاطمة  عليها السلام  تغسل الدم وعلي يمسك، فلما رأت أن الدم لا يزيد إلا كثرة أخذت حصيرا فأحرقته حتى صار رمادا ثم ألزقته، فاستمسك الدم‏.‏",
      "text_en": " Narrated Sahl:                     That he was asked about the wound of the Prophet on the day (of the battle) of Uhud. He said, \"The face of the Prophet as wounded and one of his front teeth as broken and the helmet over his head was smashed. Fatima washed of the blood while `Ali held water. When she saw that bleeding was increasing continuously, she burnt a mat (of date-palm leaves) till it turned into ashes which she put over the wound and thus the bleeding ceased.\"",
      "chain": [
        "20164",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "2942",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن مسلمة القعنبي، حدثنا عبد العزيز بن أبي حازم، عن أبيه، عن سهل بن سعد   رضى الله عنه  سمع النبي صلى الله عليه وسلم يقول يوم خيبر ‏\"‏ لأعطين الراية رجلا يفتح الله على يديه ‏\"‏‏.‏ فقاموا يرجون لذلك أيهم يعطى، فغدوا وكلهم يرجو أن يعطى فقال ‏\"‏ أين علي ‏\"‏‏.‏ فقيل يشتكي عينيه، فأمر فدعي له، فبصق في عينيه، فبرأ مكانه حتى كأنه لم يكن به شىء فقال نقاتلهم حتى يكونوا مثلنا‏.‏ فقال ‏\"‏ على رسلك حتى تنزل بساحتهم، ثم ادعهم إلى الإسلام، وأخبرهم بما يجب عليهم، فوالله لأن يهدى بك رجل واحد خير لك من حمر النعم ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     That he heard the Prophet on the day (of the battle) of Khaibar saying, \"I will give the flag to a person at whose hands Allah will grant victory.\" So, the companions of the Prophet got up, wishing eagerly to see to whom the flag will be given, and everyone of them wished to be given the flag. But the Prophet asked for `Ali. Someone informed him that he was suffering from eye-trouble. So, he ordered them to bring `Ali in front of him. Then the Prophet spat in his eyes and his eyes were cured immediately as if he had never any eye-trouble. `Ali said, \"We will fight with them (i.e. infidels) till they become like us (i.e. Muslims).\" The Prophet said, \"Be patient, till you face them and invite them to Islam and inform them of what Allah has enjoined upon them. By Allah! If a single person embraces Islam at your hands (i.e. through you), that will be better for you than the red camels.\"",
      "chain": [
        "20164",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "3295",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثني إبراهيم بن حمزة، قال حدثني ابن أبي حازم، عن يزيد، عن محمد بن إبراهيم، عن عيسى بن طلحة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا استيقظ  أراه  أحدكم من منامه فتوضأ فليستنثر ثلاثا، فإن الشيطان يبيت على خيشومه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"If anyone of you rouses from sleep and performs the ablution, he should wash his nose by putting water in it and then blowing it out thrice, because Satan has stayed in the upper part of his nose all the night.\"",
      "chain": [
        "30101",
        "20165",
        "20472",
        "11213",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "3750",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا عبد العزيز بن أبي حازم، عن أبيه، أن رجلا، جاء إلى سهل بن سعد فقال هذا فلان  لأمير المدينة  يدعو عليا عند المنبر‏.‏ قال فيقول ماذا قال يقول له أبو تراب‏.‏ فضحك قال والله ما سماه إلا النبي صلى الله عليه وسلم، وما كان له اسم أحب إليه منه‏.‏ فاستطعمت الحديث سهلا، وقلت يا أبا عباس كيف قال دخل علي على فاطمة ثم خرج فاضطجع في المسجد، فقال النبي صلى الله عليه وسلم ‏\"‏ أين ابن عمك ‏\"‏‏.‏ قالت في المسجد‏.‏ فخرج إليه فوجد رداءه قد سقط عن ظهره، وخلص التراب إلى ظهره، فجعل يمسح التراب عن ظهره فيقول ‏\"‏ اجلس يا أبا تراب ‏\"‏‏.‏ مرتين‏.‏",
      "text_en": " Narrated Abu Hazim:                     A man came to Sahl bin Sa`d and said, \"This is so-and-so,\" meaning the Governor of Medina, \"He is calling `Ali bad names near the pulpit.\" Sahl asked, \"What is he saying?\" He (i.e. the man) replied, \"He calls him (i.e. `Ali) Abu Turab.\" Sahl laughed and said, \"By Allah, none but the Prophet called him by this name and no name was dearer to `Ali than this.\" So I asked Sahl to tell me more, saying, \"O Abu `Abbas! How (was this name given to `Ali)?\" Sahl said, \"`Ali went to Fatima and then came out and slept in the Mosque. The Prophet asked Fatima, \"Where is your cousin?\" She said, \"In the Mosque.\" The Prophet went to him and found that his (i.e. `Ali's) covering sheet had slipped of his back and dust had soiled his back. The Prophet started wiping the dust off his back and said twice, \"Get up! O Abu Turab (i.e. O. man with the dust).",
      "chain": [
        "20164",
        "20165",
        "11172"
      ]
    },
    {
      "hadith_no": "3844",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني محمد بن عبيد الله، حدثنا ابن أبي حازم، عن أبيه، عن سهل، قال جاءنا رسول الله صلى الله عليه وسلم ونحن نحفر الخندق وننقل التراب على أكتادنا، فقال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم لا عيش إلا عيش الآخره فاغفر للمهاجرين والأنصار ‏\"‏‏.‏",
      "text_en": " Narrated Sahl:                     Allah's Apostle came to us while we were digging the trench and carrying out the earth on our backs. Allah's Apostle then said, \"O Allah ! There is no life except the life of the Hereafter, so please forgive the Emigrants and the Ansar.\"",
      "chain": [
        "30213",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "4183",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن عبيد الله، قال حدثني ابن أبي حازم، عن يحيى، سمع القاسم، أخبرني صالح بن خوات، عن سهل، حدثه قوله‏.‏",
      "text_en": " Narrated Salih bin Khawwat:                     Sahl said as above (Hadith 452).",
      "chain": [
        "30213",
        "20165",
        "20031",
        "10535",
        "11175",
        "399"
      ]
    },
    {
      "hadith_no": "4256",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا ابن أبي حازم، عن أبيه، عن سهل، قال التقى النبي صلى الله عليه وسلم والمشركون في بعض مغازيه فاقتتلوا، فمال كل قوم إلى عسكرهم، وفي المسلمين رجل لا يدع من المشركين شاذة ولا فاذة إلا اتبعها فضربها بسيفه، فقيل يا رسول الله ما أجزأ أحدهم ما أجزأ فلان‏.‏ فقال ‏\"‏ إنه من أهل النار ‏\"‏‏.‏ فقالوا أينا من أهل الجنة إن كان هذا من أهل النار فقال رجل من القوم لأتبعنه، فإذا أسرع وأبطأ كنت معه‏.‏ حتى جرح فاستعجل الموت، فوضع نصاب سيفه بالأرض، وذبابه بين ثدييه، ثم تحامل عليه، فقتل نفسه، فجاء الرجل إلى النبي صلى الله عليه وسلم فقال أشهد أنك رسول الله فقال ‏\"‏ وما ذاك ‏\"‏‏.‏ فأخبره‏.‏ فقال ‏\"‏ إن الرجل ليعمل بعمل أهل الجنة، فيما يبدو للناس، وإنه من أهل النار، ويعمل بعمل أهل النار، فيما يبدو للناس وهو من أهل الجنة ‏\"‏‏.‏",
      "text_en": " Narrated Sahl:                     During one of his Ghazawat, the Prophet encountered the pagans, and the two armies fought, and then each of them returned to their army camps. Amongst the (army of the) Muslims there was a man who would follow every pagan separated from the army and strike him with his sword. It was said, \"O Allah's Apostle! None has fought so satisfactorily as so-and-so (namely, that brave Muslim). \"The Prophet said, \"He is from the dwellers of the Hell-Fire.\" The people said, \"Who amongst us will be of the dwellers of Paradise if this (man) is from the dwellers of the Hell-Fire?\" Then a man from amongst the people said, \"I will follow him and accompany him in his fast and slow movements.\" The (brave) man got wounded, and wanting to die at once, he put the handle of his sword on the ground and its tip in between his breasts, and then threw himself over it, committing suicide. Then the man (who had watched the deceased) returned to the Prophet and said, \"I testify that you are Apostle of Allah.\" The Prophet said, \"What is this?\" The man told him the whole story. The Prophet said, \"A man may do what may seem to the people as the deeds of the dwellers of Paradise, but he is of the dwellers of the Hell-Fire and a man may do what may seem to the people as the deeds of the dwellers of the Hell-Fire, but he is from the dwellers of Paradise.\"",
      "chain": [
        "20164",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "4846",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إبراهيم بن حمزة، حدثنا ابن أبي حازم، والدراوردي، عن يزيد، وقال، ‏\"‏ كما صليت على إبراهيم، وبارك على محمد وآل محمد كما باركت على إبراهيم وآل إبراهيم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Abi Hazim and Ad-Darawardi:                     Yazid said, \"Kama sallaita ala Ibrahima wa barik 'ala Muhammad in wa all Muhammadin kama barakta 'ala Abrahima wa all Ibrahim.\"",
      "chain": [
        "30101",
        "20165",
        "20167",
        "20304"
      ]
    },
    {
      "hadith_no": "5143",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا قتيبة، حدثنا عبد العزيز بن أبي حازم، عن أبيه، عن سهل بن سعد الساعدي، قال جاءت امرأة إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله جئت أهب لك نفسي قال فنظر إليها رسول الله صلى الله عليه وسلم فصعد النظر فيها وصوبه ثم طأطأ رسول الله صلى الله عليه وسلم رأسه فلما رأت المرأة أنه لم يقض فيها شيئا جلست فقام رجل من أصحابه فقال يا رسول الله إن لم يكن لك بها حاجة فزوجنيها‏.‏ فقال ‏\"‏ وهل عندك من شىء ‏\"‏‏.‏ قال لا والله يا رسول الله‏.‏ فقال ‏\"‏ اذهب إلى أهلك فانظر هل تجد شيئا ‏\"‏‏.‏ فذهب ثم رجع فقال لا والله ما وجدت شيئا‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ انظر ولو خاتما من حديد ‏\"‏‏.‏ فذهب ثم رجع فقال لا والله يا رسول الله ولا خاتما من حديد ولكن هذا إزاري  قال سهل ما له رداء فلها نصفه  فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما تصنع بإزارك إن لبسته لم يكن عليها منه شىء وإن لبسته لم يكن عليك شىء ‏\"‏‏.‏ فجلس الرجل حتى إذا طال مجلسه قام فرآه رسول الله صلى الله عليه وسلم موليا فأمر به فدعي فلما جاء قال ‏\"‏ ماذا معك من القرآن ‏\"‏‏.‏ قال معي سورة كذا وسورة كذا عددها‏.‏ فقال ‏\"‏ تقرؤهن عن ظهر قلبك ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ اذهب فقد ملكتكها بما معك من القرآن ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d As-Sa`idi:                     A woman came to Allah's Apostle and said, \"O Allah's Apostle! I have come to give you myself in marriage (without Mahr).\" Allah's Apostle looked at her. He looked at her carefully and fixed his glance on her and then lowered his head. When the lady saw that he did not say anything, she sat down. A man from his companions got up and said, \"O Allah's Apostle! If you are not in need of her, then marry her to me.\" The Prophet said, \"Have you got anything to offer?\" The man said, \"No, by Allah, O Allah's Apostle!\" The Prophet said (to him), \"Go to your family and see if you have something.\" The man went and returned, saying, \"No, by Allah, I have not found anything.\" Allah's Apostle said, \"(Go again) and look for something, even if it is an iron ring.\" He went again and returned, saying, \"No, by Allah, O Allah's Apostle! I could not find even an iron ring, but this is my Izar (waist sheet).\" He had no rida. He added, \"I give half of it to her.\" Allah's Apostle said, \"What will she do with your Izar? If you wear it, she will be naked, and if she wears it, you will be naked.\" So that man sat down for a long while and then got up (to depart). When Allah's Apostle saw him going, he ordered that he be called back. When he came, the Prophet said, \"How much of the Qur'an do you know?\" He said, \"I know such Sura and such Sura,\" counting them. The Prophet said, \"Do you know them by heart?\" He replied, \"Yes.\" The Prophet said, \"Go, I marry her to you for that much of the Qur'an which you have.\"",
      "chain": [
        "30367",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "5147",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا إبراهيم بن حمزة، حدثنا ابن أبي حازم، عن أبيه، عن سهل، قال مر رجل على رسول الله صلى الله عليه وسلم فقال ‏\"‏ ما تقولون في هذا ‏\"‏‏.‏ قالوا حري إن خطب أن ينكح، وإن شفع أن يشفع، وإن قال أن يستمع‏.‏ قال ثم سكت فمر رجل من فقراء المسلمين فقال ‏\"‏ ما تقولون في هذا ‏\"‏‏.‏ قالوا حري إن خطب أن لا ينكح وإن شفع أن لا يشفع، وإن قال أن لا يستمع‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هذا خير من ملء الأرض مثل هذا ‏\"‏‏.‏",
      "text_en": " Narrated Sahl:                     A man passed by Allah's Apostle and Allah s Apostle asked (his companions) \"What do you say about this (man)?\" They replied \"If he asks for a lady's hand, he ought to be given her in marriage; and if he intercedes (for someone) his intercessor should be accepted; and if he speaks, he should be listened to.\" Allah's Apostle kept silent, and then a man from among the poor Muslims passed by, an Allah's Apostle asked (them) \"What do you say about this man?\" They replied, \"If he asks for a lady's hand in marriage he does not deserve to be married, and he intercedes (for someone), his intercession should not be accepted; And if he speaks, he should not be listened to.' Allah's Apostle said, \"This poor man is better than so many of the first as filling the earth.'",
      "chain": [
        "30101",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "5231",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز بن أبي حازم، عن أبي حازم، عن سهل بن سعد، قال دعا أبو أسيد الساعدي رسول الله صلى الله عليه وسلم في عرسه، وكانت امرأته يومئذ خادمهم وهى العروس، قال سهل تدرون ما سقت رسول الله صلى الله عليه وسلم أنقعت له تمرات من الليل، فلما أكل سقته إياه‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     Abu Usaid As-Sa'di invited Allah's Apostle to his wedding party and his wife who was the bride, served them on that day. Do you know what drink she gave Allah's Apostle? She had soaked some dates for him (in water) overnight, and when he had finished his meal she gave him that drink (of soaked dates).",
      "chain": [
        "30367",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "5361",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا عمرو بن زرارة، أخبرنا عبد العزيز بن أبي حازم، عن أبيه، عن سهل، قال رسول الله صلى الله عليه وسلم ‏\"‏ أنا وكافل اليتيم في الجنة هكذا ‏\"‏‏.‏ وأشار بالسبابة والوسطى، وفرج بينهما شيئا‏.‏",
      "text_en": " Narrated Sahl:                     Allah's Apostle said, \"I and the one who looks after an orphan will be like this in Paradise,\" showing his middle and index fingers and separating them.",
      "chain": [
        "30365",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "5932",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا عبد العزيز بن أبي حازم، عن أبيه، أنه سمع سهلا، يقول جاءت امرأة إلى النبي صلى الله عليه وسلم فقالت جئت أهب نفسي‏.‏ فقامت طويلا فنظر وصوب، فلما طال مقامها فقال رجل زوجنيها، إن لم تكن لك بها حاجة‏.‏ قال ‏\"‏ عندك شىء تصدقها ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ انظر ‏\"‏‏.‏ فذهب ثم رجع فقال والله إن وجدت شيئا‏.‏ قال ‏\"‏ اذهب فالتمس ولو خاتما من حديد ‏\"‏‏.‏ فذهب ثم رجع قال لا والله ولا خاتما من حديد‏.‏ وعليه إزار ما عليه رداء‏.‏ فقال أصدقها إزاري فقال النبي صلى الله عليه وسلم ‏\"‏ إزارك إن لبسته لم يكن عليك منه شىء، وإن لبسته لم يكن عليها منه شىء ‏\"‏‏.‏ فتنحى الرجل فجلس فرآه النبي صلى الله عليه وسلم موليا فأمر به فدعي فقال ‏\"‏ ما معك من القرآن ‏\"‏‏.‏ قال سورة كذا وكذا لسور عددها‏.‏ قال ‏\"‏ قد ملكتكها بما معك من القرآن ‏\"‏‏.‏",
      "text_en": " Narrated Sahl:                     A woman came to the Prophet and said, \"I have come to present myself to you (for marriage).\" She kept standing for a long period during which period the Prophet looked at her carefully. When she stayed for a Long period, a man said to the Prophet \"If you are not in need of her, then marry her to me.\" The Prophet said, \"Have you got anything to give her (as Mahr)?\" The man said, \"No.\" The Prophet said, \"Go (to your house) and search for something.\" The man went and came back to say, \"By Allah, I could not find anything.\" The Prophet said, \"Go again and search for something, even if it be an iron ring.\" He went again and came back saying, \"No, by Allah, I could not get even an iron ring.\" The man had only an Izar and had no Rida' (upper garment). He said, \"I will give her my Izar as Mahr.\" On that the Prophet said, \"Your Izar? If she wears it, nothing of it will remain on you, and if you wear it nothing of it will be on her\" The man went aside and sat down When the Prophet saw him leaving (after a while), he called back and asked. \"How much Qur'an do you know (by heart)? He said, 'I know such and such Suras,\" naming some Suras. The Prophet said, \"I marry her to you for the amount of Qur'an you know (by heart).",
      "chain": [
        "20164",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "6072",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، قال حدثني عبد العزيز بن أبي حازم، قال حدثني أبي قال، سمعت سهل بن سعد، عن النبي صلى الله عليه وسلم قال ‏\"‏ أنا وكافل اليتيم، في الجنة هكذا ‏\"‏‏.‏ وقال بإصبعيه السبابة والوسطى‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     The Prophet said, \"I and the person who looks after an orphan and provides for him, will be in Paradise like this,\" putting his index and middle fingers together.",
      "chain": [
        "30143",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "6321",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا ابن أبي حازم، عن أبيه، عن سهل، قال كنا نفرح يوم الجمعة‏.‏ قلت ولم قال كانت لنا عجوز ترسل إلى بضاعة  قال ابن مسلمة نخل بالمدينة  فتأخذ من أصول السلق فتطرحه في قدر، وتكركر حبات من شعير، فإذا صلينا الجمعة انصرفنا ونسلم عليها فتقدمه إلينا، فنفرح من أجله، وما كنا نقيل ولا نتغدى إلا بعد الجمعة‏.‏",
      "text_en": " Narrated Abu Hazim:                     Sahl said, \"We used to feel happy on Fridays.\" I asked Sahl, \"Why?\" He said, \"There was an old woman of our acquaintance who used to send somebody to Buda'a (Ibn Maslama said, \"Buda'a was a garden of date-palms at Medina). She used to pull out the silq (a kind of vegetable) from its roots and put it in a cooking pot, adding some powdered barley over it (and cook it). After finishing the Jumua (Friday) prayer we used to (pass by her and) greet her, whereupon she would present us with that meal, so we used to feel happy because of that. We used to have neither a midday nap, nor meals, except after the Friday prayer.\" (See Hadith No. 60, Vol.2)",
      "chain": [
        "20164",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "6354",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز بن أبي حازم، عن أبي حازم، عن سهل بن سعد، قال ما كان لعلي اسم أحب إليه من أبي تراب، وإن كان ليفرح به إذا دعي بها، جاء رسول الله صلى الله عليه وسلم بيت فاطمة  عليها السلام  فلم يجد عليا في البيت فقال ‏\"‏ أين ابن عمك ‏\"‏‏.‏ فقالت كان بيني وبينه شىء، فغاضبني فخرج فلم يقل عندي‏.‏ فقال رسول الله صلى الله عليه وسلم لإنسان ‏\"‏ انظر أين هو ‏\"‏ فجاء فقال يا رسول الله هو في المسجد راقد‏.‏ فجاء رسول الله صلى الله عليه وسلم وهو مضطجع، قد سقط رداؤه عن شقه، فأصابه تراب، فجعل رسول الله صلى الله عليه وسلم يمسحه عنه  وهو يقول ‏\"‏ قم أبا تراب، قم أبا تراب ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     There was no name dearer to `Ali than his nickname Abu Turab (the father of dust). He used to feel happy whenever he was called by this name. Once Allah's Apostle came to the house of Fatima but did not find `Ali in the house. So he asked \"Where is your cousin?\" She replied, \"There was something (a quarrel) between me and him whereupon he got angry with me and went out without having a midday nap in my house.\" Allah's Apostle asked a person to look for him. That person came, and said, \"O Allah's Apostle! He (Ali) is sleeping in the mosque.\" So Allah's Apostle went there and found him lying. His upper body cover had fallen off to one side of his body, and so he was covered with dust. Allah's Apostle started cleaning the dust from him, saying, \"Get up, O Abu Turab! Get up, Abu Turab!\" (See Hadith No. 432, Vol 1)",
      "chain": [
        "30367",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "6432",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا إبراهيم بن حمزة، حدثنا ابن أبي حازم، والدراوردي، عن يزيد، عن عبد الله بن خباب، عن أبي سعيد الخدري، قال قلنا يا رسول الله هذا السلام عليك، فكيف نصلي قال ‏\"‏ قولوا اللهم صل على محمد عبدك ورسولك، كما صليت على إبراهيم، وبارك على محمد وعلى آل محمد، كما باركت على إبراهيم وآل إبراهيم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     We said, \"O Allah's Apostle This is (i.e. we know) the greeting to you; will you tell us how to send Salat on you?\" He said, \"Say: 'Allahumma Salli 'ala Muhammadin `Abdika wa rasulika kama sal-laita 'ala Ibrahima wa barik 'ala Muhammadin wa all Muhammadin kama barakta 'ala Ibrahima wa `Ali Ibrahim.\"",
      "chain": [
        "30101",
        "20165",
        "20167",
        "20304",
        "11182",
        "38"
      ]
    },
    {
      "hadith_no": "6491",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا عبد العزيز بن أبي حازم، عن أبيه، عن سهل، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ موضع سوط في الجنة خير من الدنيا وما فيها، ولغدوة في سبيل الله أو روحة خير من الدنيا وما فيها ‏\"‏‏.‏",
      "text_en": " Narrated Sahl:                     I heard the Prophet saying, \"A (small) place equal to an area occupied by a whip in Paradise is better than the (whole) world and whatever is in it; and an undertaking (journey) in the forenoon or in the afternoon for Allah's Cause, is better than the whole world and whatever is in it.\"",
      "chain": [
        "20164",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "6524",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا إسماعيل، قال حدثني عبد العزيز بن أبي حازم، عن أبيه، عن سهل بن سعد الساعدي، أنه قال مر رجل على رسول الله صلى الله عليه وسلم فقال لرجل عنده جالس ‏\"‏ ما رأيك في هذا ‏\"‏‏.‏ فقال رجل من أشراف الناس، هذا والله حري إن خطب أن ينكح، وإن شفع أن يشفع‏.‏ قال فسكت رسول الله صلى الله عليه وسلم ثم مر رجل فقال له رسول الله صلى الله عليه وسلم ‏\"‏ ما رأيك في هذا ‏\"‏‏.‏ فقال يا رسول الله هذا رجل من فقراء المسلمين، هذا حري إن خطب أن لا ينكح، وإن شفع أن لا يشفع، وإن قال أن لا يسمع لقوله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هذا خير من ملء الأرض مثل هذا ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d As-Sa`id:                     A man passed by Allah's Apostle and the Prophet asked a man sitting beside him, \"What is your opinion about this (passer-by)?\" He replied, \"This (passer-by) is from the noble class of people. By Allah, if he should ask for a lady's hand in marriage, he ought to be given her in marriage, and if he intercedes for somebody, his intercession will be accepted. Allah's Apostle kept quiet, and then another man passed by and Allah's Apostle asked the same man (his companion) again, \"What is your opinion about this (second) one?\" He said, \"O Allah's Apostle! This person is one of the poor Muslims. If he should ask a lady's hand in marriage, no-one will accept him, and if he intercedes for somebody, no one will accept his intercession, and if he talks, no-one will listen to his talk.\" Then Allah's Apostle said, \"This (poor man) is better than such a large number of the first type (i.e. rich men) as to fill the earth.\"",
      "chain": [
        "30103",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "6536",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عبد العزيز بن عبد الله الأويسي، حدثني ابن أبي حازم، عن أبيه، عن يزيد بن رومان، عن عروة، عن عائشة، أنها قالت لعروة ابن أختي إن كنا لننظر إلى الهلال ثلاثة أهلة في شهرين، وما أوقدت في أبيات رسول الله صلى الله عليه وسلم نار‏.‏ فقلت ما كان يعيشكم قالت الأسودان التمر والماء إلا أنه قد كان لرسول الله صلى الله عليه وسلم جيران من الأنصار كان لهم منائح، وكانوا يمنحون رسول الله صلى الله عليه وسلم من أبياتهم، فيسقيناه‏.‏",
      "text_en": " Narrated `Aisha:                     that she said to `Urwa, \"O, the son of my sister! We used to see three crescents in two months, and no fire used to be made in the houses of Allah's Apostle (i.e. nothing used to be cooked).\" `Urwa said, \"What used to sustain you?\" `Aisha said, \"The two black things i.e. dates and water, except that Allah's Apostle had neighbors from the Ansar who had some milch she-camels, and they used to give the Prophet some milk from their house, and he used to make us drink it.\"",
      "chain": [
        "30105",
        "20165",
        "11172",
        "11233",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6555",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني إبراهيم بن حمزة، حدثني ابن أبي حازم، عن يزيد، عن محمد بن إبراهيم، عن عيسى بن طلحة التيمي، عن أبي هريرة، سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن العبد ليتكلم بالكلمة ما يتبين فيها، يزل بها في النار أبعد مما بين المشرق ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     That he heard Allah's Apostle saying, \"A slave of Allah may utter a word without thinking whether it is right or wrong, he may slip down in the Fire as far away a distance equal to that between the east.\"",
      "chain": [
        "30101",
        "20165",
        "20472",
        "11213",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "6644",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا إبراهيم بن حمزة، حدثنا ابن أبي حازم، والدراوردي، عن يزيد، عن عبد الله بن خباب، عن أبي سعيد الخدري  رضى الله عنه  أنه سمع رسول الله صلى الله عليه وسلم وذكر عنده عمه أبو طالب فقال ‏\"‏ لعله تنفعه شفاعتي يوم القيامة فيجعل في ضحضاح من النار، يبلغ كعبيه، يغلي منه أم دماغه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     I heard Allah's Apostles when his uncle, Abu Talib had been mentioned in his presence, saying, \"May be my intercession will help him (Abu Talib) on the Day of Resurrection so that he may be put in a shallow place in the Fire, with fire reaching his ankles and causing his brain to boil.\"",
      "chain": [
        "30101",
        "20165",
        "20167",
        "20304",
        "11182",
        "38"
      ]
    },
    {
      "hadith_no": "6766",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثني علي، سمع عبد العزيز بن أبي حازم، أخبرني أبي، عن سهل بن سعد، أن أبا أسيد، صاحب النبي صلى الله عليه وسلم أعرس فدعا النبي صلى الله عليه وسلم لعرسه، فكانت العروس خادمهم‏.‏ فقال سهل للقوم هل تدرون ما سقته قال أنقعت له تمرا في تور من الليل، حتى أصبح عليه فسقته إياه‏.‏",
      "text_en": " Narrated Abu Hazim:                     Sahl bin Sa`d said, \"Abu Usaid, the companion of the Prophet, got married, so he invited the Prophet to his wedding party, and the bride herself served them. Sahl said to the People, 'Do you know what drink she served him with? She infused some dates in a pot at night and the next morning she served him with the infusion.\"",
      "chain": [
        "30026",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "7075",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثني إبراهيم بن حمزة، حدثني ابن أبي حازم، والدراوردي، عن يزيد، عن عبد الله بن خباب، عن أبي سعيد الخدري، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ الرؤيا الصالحة جزء من ستة وأربعين جزءا من النبوة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     I heard Allah's Apostle saying, \"A good dream is a part of the forty six parts of prophetism.\"",
      "chain": [
        "30101",
        "20165",
        "20167",
        "20304",
        "11182",
        "38"
      ]
    },
    {
      "hadith_no": "7132",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا إبراهيم بن حمزة، حدثني ابن أبي حازم، والدراوردي، عن يزيد، عن عبد الله بن خباب، عن أبي سعيد الخدري، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا رأى أحدكم الرؤيا يحبها، فإنها من الله، فليحمد الله عليها، وليحدث بها، وإذا رأى غير ذلك مما يكره، فإنما هي من الشيطان، فليستعذ من شرها، ولا يذكرها لأحد، فإنها لن تضره ‏\"‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     I heard Allah's Apostle saying, \"If anyone of you saw a dream which he liked, then that was from Allah, and he should thank Allah for it and tell it to others; but if he saw something else, i.e, a dream which he did not like, then that is from Satan and he should seek refuge with Allah from it and should not tell it to anybody for it will not harm him.\"",
      "chain": [
        "30101",
        "20165",
        "20167",
        "20304",
        "11182",
        "38"
      ]
    },
    {
      "hadith_no": "7639",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثني إبراهيم بن حمزة، حدثني ابن أبي حازم، عن يزيد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ ما أذن الله لشىء ما أذن لنبي حسن الصوت بالقرآن يجهر به ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     that he heard the Prophet saying, \"Allah does not listen to anything as He listens to the recitation of the Qur'an by a Prophet who recites it in attractive audible sweet sounding voice.\"",
      "chain": [
        "30101",
        "20165",
        "20472",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "294",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا يعقوب، - وهو ابن عبد الرحمن القاري ح وحدثنا أبو الأحوص، محمد بن حيان حدثنا ابن أبي حازم، كلاهما عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من حمل علينا السلاح فليس منا ومن غشنا فليس منا ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) observed:                      He who took up arms against us is not of us and he who acted dishonestly towards us is not of us.",
      "chain": [
        "30367",
        "20185",
        "20165",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "548",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني ابن أبي حازم - عن أبي حازم، عن سهل بن سعد، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليدخلن الجنة من أمتي سبعون ألفا أو سبعمائة ألف - لا يدري أبو حازم أيهما قال - متماسكون آخذ بعضهم بعضا لا يدخل أولهم حتى يدخل آخرهم وجوههم على صورة القمر ليلة البدر ‏\"‏ ‏.‏",
      "text_en": " Abu Hazim narrated it on the authority of Ibn Sa'd that the Messenger of Allah (may peace be upon him) said:                      Seventy thousand persons or seven hundred thousand persons (Abu Hazim does not remember the exact number) would enter Paradise holding and supporting one another, and the first among them would not enter till the last among them would enter (therein) ; (they would enter simultaneously) and their faces would be bright like the full moon.",
      "chain": [
        "30367",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "421",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني ابن أبي حازم - وقال قتيبة حدثنا يعقوب، - وهو ابن عبد الرحمن القاري - كلاهما عن أبي حازم، عن سهل بن سعد، بمثل حديث مالك ‏.‏ وفي حديثهما فرفع أبو بكر يديه فحمد الله ورجع القهقرى وراءه حتى قام في الصف ‏.‏",
      "text_en": " This hadith is transmitted by Sahl b. Sa'd in the same way as narrated by Malik, with the exception of these words:                     \" Abu Bakr lifted his hands and praised Allah and retraced his (steps) till he stood in a row.\"",
      "chain": [
        "30367",
        "20165",
        "30367",
        "11349"
      ]
    },
    {
      "hadith_no": "508",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني يعقوب بن إبراهيم الدورقي، حدثنا ابن أبي حازم، حدثني أبي، عن سهل بن سعد الساعدي، قال كان بين مصلى رسول الله صلى الله عليه وسلم وبين الجدار ممر الشاة ‏.‏",
      "text_en": " Sahl b. Sa'd al-Si'idi reported:                      Between the place of worship where the Messenger of Allah (may peace be upon him) prayed and the wall, there was a gap through which a goat could pass.",
      "chain": [
        "30400",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "1244",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن يحيى، وقتيبة بن سعيد، كلاهما عن عبد العزيز، قال يحيى أخبرنا عبد العزيز بن أبي حازم، عن أبيه، أن نفرا، جاءوا إلى سهل بن سعد قد تماروا في المنبر من أى عود هو فقال أما والله إني لأعرف من أى عود هو ومن عمله ورأيت رسول الله صلى الله عليه وسلم أول يوم جلس عليه - قال - فقلت له يا أبا عباس فحدثنا ‏.‏ قال أرسل رسول الله صلى الله عليه وسلم إلى امرأة قال أبو حازم إنه ليسميها يومئذ ‏\"‏ انظري غلامك النجار يعمل لي أعوادا أكلم الناس عليها ‏\"‏ ‏.‏ فعمل هذه الثلاث درجات ثم أمر بها رسول الله صلى الله عليه وسلم فوضعت هذا الموضع فهى من طرفاء الغابة ‏.‏ ولقد رأيت رسول الله صلى الله عليه وسلم قام عليه فكبر وكبر الناس وراءه وهو على المنبر ثم رفع فنزل القهقرى حتى سجد في أصل المنبر ثم عاد حتى فرغ من آخر صلاته ثم أقبل على الناس فقال ‏\"‏ يا أيها الناس إني صنعت هذا لتأتموا بي ولتعلموا صلاتي ‏\"‏ ‏.‏",
      "text_en": " Abu Hazim is reported on the authority of his father:                      Some people came to Sahl b. Sa'd and began to differ about the wood of which the (Prophet's pulpit was made. He (Sahl b. Sa'd) said: By Allah, I know of which wood it is made and who made it, and the day when I saw the Messenger of Allah (may peace be upon him) seated himself on it on the first day. I said to him: O Abu Abbas (kunyah of Sabl b. Sa'd), narrate to us (all these facts), He said: The Messenger of Allah (may peace be upon him) sent a person to a woman asking her to allow her slave, a carpenter, to work on woods (to prepare a pulpit) so that I should talk to the people (sitting on it). Abu Hazim said: He (Sahl b. Sa'd) pointed out the name of (that lady) that day. So he (the carpenter) made (a pulpit) with these three steps. Then the Messengerof Allah (may peace be upon him) commanded it to be placed here (where it is lying now). It was fashioned out of the wood of al-Ghaba. And I saw the Messenger of Allah (may peace he upon him) standing upon it and glorifying Allah and the people also glorified Allah after him, while he was on the pulpit. He then raised (his head from prostration) and stepped back (on his heels) till he prostrated himself at the base of pulpit, and then returned (to the former place and this movement of one or two steps continued) till the prayer was complete. He then turned towards the people and said: O people, I have done it so that you should follow me and learn (my mode of) prayer.",
      "chain": [
        "30399",
        "30367",
        "20167",
        "20031",
        "20165",
        "11172"
      ]
    },
    {
      "hadith_no": "2028",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا عبد الله بن مسلمة بن قعنب، ويحيى بن يحيى، وعلي بن حجر، قال يحيى أخبرنا وقال الآخران، حدثنا عبد العزيز بن أبي حازم، عن أبيه، عن سهل، قال ما كنا نقيل ولا نتغدى إلا بعد الجمعة - زاد ابن حجر - في عهد رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Sahl b. Said said:                      We did not have a siesta or lunch till after the Friday prayer. (Ibn Hajr added: ) \"During the lifetime of the Messenger of Allah (may peace be upon him).\"",
      "chain": [
        "30399",
        "20387",
        "20031",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "2608",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا عبد العزيز بن أبي حازم، عن أبيه، عن سهل، بن سعد - رضى الله عنه - أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يزال الناس بخير ما عجلوا الفطر ‏\"‏ ‏.‏",
      "text_en": " Sahl b. Sa'd (Allah be pleased with him) repotted Allah's Messenger (may peace be upon him) as saying:                      The people will continue to prosper as long as they hasten the breaking of the fast.",
      "chain": [
        "30399",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "3552",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا قتيبة بن سعيد الثقفي، حدثنا يعقوب، - يعني ابن عبد الرحمن القاري - عن أبي حازم، عن سهل بن سعد، ح وحدثناه قتيبة، حدثنا عبد العزيز بن أبي حازم، عن أبيه، عن سهل بن سعد، الساعدي قال جاءت امرأة إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله جئت أهب لك نفسي ‏.‏ فنظر إليها رسول الله صلى الله عليه وسلم فصعد النظر فيها وصوبه ثم طأطأ رسول الله صلى الله عليه وسلم رأسه فلما رأت المرأة أنه لم يقض فيها شيئا جلست فقام رجل من أصحابه فقال يا رسول الله إن لم يكن لك بها حاجة فزوجنيها ‏.‏ فقال ‏\"‏ فهل عندك من شىء ‏\"‏ ‏.‏ فقال لا والله يا رسول الله ‏.‏ فقال ‏\"‏ اذهب إلى أهلك فانظر هل تجد شيئا ‏\"‏ ‏.‏ فذهب ثم رجع فقال لا والله ما وجدت شيئا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ انظر ولو خاتما من حديد ‏\"‏ ‏.‏ فذهب ثم رجع ‏.‏ فقال لا والله يا رسول الله ولا خاتما من حديد ‏.‏ ولكن هذا إزاري - قال سهل ما له رداء - فلها نصفه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما تصنع بإزارك إن لبسته لم يكن عليها منه شىء وإن لبسته لم يكن عليك منه شىء ‏\"‏ ‏.‏ فجلس الرجل حتى إذا طال مجلسه قام فرآه رسول الله صلى الله عليه وسلم موليا فأمر به فدعي فلما جاء قال ‏\"‏ ماذا معك من القرآن ‏\"‏ ‏.‏ قال معي سورة كذا وسورة كذا - عددها ‏.‏ فقال ‏\"‏ تقرؤهن عن ظهر قلبك ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ اذهب فقد ملكتكها بما معك من القرآن ‏\"‏ ‏.‏ هذا حديث ابن أبي حازم وحديث يعقوب يقاربه في اللفظ ‏.‏",
      "text_en": " Sahl b. Sa'd al-Sa'idi (Allah be pleased with him) reported:                      A woman came to Allah's Messenger. (may peace be upon him) and said: Messenger of Allah, I have come to you to entrust myself to you (you may contract my marriage with anyone at your discretion). Allah's Messenger (may peace be upon him) saw her and cast a glance at her from head to foot. Allah's Messenger (may peace be upon him) then lowered his head. When the woman saw that he had made no decision in regard to her, she sat down. There stood up a person from amongst his companions and said: Messenger of Allah, marry her to me if you have no need of her. He (the Prophet) said: is there anything with you (which you con give as a dower)? He said: No, Messenger of Allah, by Allah I have nothing. Thereupon Allah's Messenger (may peace be upon him) said: Go to your people (family) and see if you can find something. He returned and said: I have found nothing. The Messenger of Allah (may peace be upon him) said: See even if it is an iron ring. He went and returned and said: No, by Allah, not even an iron ring, but only this lower garment of mine (Sahl said that he had no upper garment), half of which (I am prepared to part with) for her. Thereupon Allah's Messenger (may peace be upon him) said: How can your lower garment serve your purpose, for it you wear it, she would not be able to make any use of it and if she wears it there would not be anything on you? The man sat down and as the sitting prolonged he stood up (in disappointment) and as he was going back Allah's Messenger (may peace be upon him) commanded (him) to be called back, and as he came, he said to him: Do you know any part of the Qur'an? He said: I know such and such surahs (and he counted them), whereupon he () said: Can you recite them from heart (from your memory)? He said: Yes, whereupon he (Allah's Messenger) said: Go, I have given her to you in marriage for the part of the Qur'an which you know.",
      "chain": [
        "30367",
        "20185",
        "11172",
        "399",
        "30367",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "3771",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني ابن أبي حازم وقال قتيبة أيضا حدثنا يعقوب، - يعني ابن عبد الرحمن القاري - كلاهما عن أبي حازم، عن أبي، سلمة عن فاطمة بنت قيس، أنه طلقها زوجها في عهد النبي صلى الله عليه وسلم وكان أنفق عليها نفقة دون فلما رأت ذلك قالت والله لأعلمن رسول الله صلى الله عليه وسلم فإذا كان لي نفقة أخذت الذي يصلحني وإن لم تكن لي نفقة لم آخذ منه شيئا قالت فذكرت ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ لا نفقة لك ولا سكنى ‏\"‏ ‏.‏",
      "text_en": " Fatima bint Qais reported that her husband divorced her during the life time of Allah's Prophet (may peace be upon him) and gave her a meagre maintenance allowance. When she saw that, she said:                      By Allah, I will inform Allah's Messenger (may peace be upon him), and if maintenance allowance is due to me then I will accept that which will suffice me, and if it is not due to me, I will not accept anything from him. She said: I made a mention of that to Allah's Messenger (may peace be upon him) and he said: There is neither maintenance allowance for you nor lodging.",
      "chain": [
        "30367",
        "20165",
        "11172",
        "10567",
        "224"
      ]
    },
    {
      "hadith_no": "4743",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، حدثنا عبد العزيز بن أبي حازم، عن أبيه، أنه سمع سهل بن سعد، يسأل عن جرح، رسول الله صلى الله عليه وسلم يوم أحد فقال جرح وجه رسول الله صلى الله عليه وسلم وكسرت رباعيته وهشمت البيضة على رأسه فكانت فاطمة بنت رسول الله صلى الله عليه وسلم تغسل الدم وكان علي بن أبي طالب يسكب عليها بالمجن فلما رأت فاطمة أن الماء لا يزيد الدم إلا كثرة أخذت قطعة حصير فأحرقته حتى صار رمادا ثم ألصقته بالجرح فاستمسك الدم ‏.‏",
      "text_en": " It has been narrated on the authority of Abd-ul-'Aziz b. Abu Hazim, who learnt from his father (Abu Hazim). The latter heard it from Sahl b. Sa'd who was asked about the injury which the Messenger of Allah (may peace be upon him) got on the day of the Battle of Uhud. He said:                      The face of the Messenger of Allah (may peace be upon him) was injured, his front teeth were damaged and his helmet was crushed. Fatima, the daughter of the Messenger of Allah (may peace be upon him), was washing the blood (from his head), and 'Ali b. Abu Talib was pouring water on it from a shield. When Fatima saw that the bleeding had increased on account of (pouring) water (on the wound), she took a piece of mat and burnt it until it was reduced to ashes. She put the ashes on the wound and the bleeding stopped.",
      "chain": [
        "30399",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "4773",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا عبد الله بن مسلمة القعنبي، حدثنا عبد العزيز بن أبي حازم، عن أبيه، عن سهل بن سعد، قال جاءنا رسول الله صلى الله عليه وسلم ونحن نحفر الخندق وننقل التراب على أكتافنا فقال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم لا عيش إلا عيش الآخرة فاغفر للمهاجرين والأنصار ‏\"‏ ‏.‏",
      "text_en": " It has been reported on the authority of Sahl b. Sa'd who said:                      The Messenger of Allah (may peace be upon him) came to us while we were digging the ditch and were carrying the earth on our shoulders. (Seeing our condition), he said: O God, there is no life but the life of the Hereafter. So forgive Thou the Muhajirs and the Ansar.",
      "chain": [
        "20164",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "4982",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا عبد العزيز بن أبي حازم، عن أبيه، عن سهل، بن سعد الساعدي عن رسول الله صلى الله عليه وسلم قال ‏\"‏ والغدوة يغدوها العبد في سبيل الله خير من الدنيا وما فيها ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Sahl b. Sa'd as-Sa'idi that the Messenger of Allah (may peace be upon him) said:                      The journey undertaken by a person in the morning (for Jihad) in the way of Allah (will merit a reward) better than the world and all that is in it.",
      "chain": [
        "30399",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "4997",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، حدثنا عبد العزيز بن أبي حازم، عن أبيه، عن  بعجة، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ من خير معاش الناس لهم رجل ممسك عنان فرسه في سبيل الله يطير على متنه كلما سمع هيعة أو فزعة طار عليه يبتغي القتل والموت مظانه أو رجل في غنيمة في رأس شعفة من هذه الشعف أو بطن واد من هذه الأودية يقيم الصلاة ويؤتي الزكاة ويعبد ربه حتى يأتيه اليقين ليس من الناس إلا في خير ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      Of the men he lives the best life who holds the reins of his horse (ever ready to march) in the way of Allah, flies on its back whenever he hears a fearful shriek, or a call for help, flies to it seeking death at places where it can be expected. (Next to him) is a man who lives with his sheep at a hill-top or in a valley, says his prayers regularly, gives Zakat and worships his Lord until death comes to him. There is no better person among men except these two.",
      "chain": [
        "30399",
        "20165",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "4998",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثناه قتيبة بن سعيد، عن عبد العزيز بن أبي حازم، ويعقوب، - يعني ابن عبد الرحمن القاري - كلاهما عن أبي حازم، بهذا الإسناد ‏.‏ مثله وقال عن بعجة بن، عبد الله بن بدر وقال ‏\"‏ في شعبة من هذه الشعاب ‏\"‏ ‏.‏ خلاف رواية يحيى ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Abu Huraira with a slight variation of wording.",
      "chain": [
        "30367",
        "20165"
      ]
    },
    {
      "hadith_no": "5351",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني ابن أبي حازم - عن أبي، حازم عن سهل بن سعد، قال دعا أبو أسيد الساعدي رسول الله صلى الله عليه وسلم في عرسه فكانت امرأته يومئذ خادمهم وهي العروس قال سهل تدرون ما سقت رسول الله صلى الله عليه وسلم أنقعت له تمرات من الليل في تور فلما أكل سقته إياه ‏.‏",
      "text_en": " Sahl b. Sa'd reported that Abu Usaid al-Sa'idi invited Allah's Messenger (may peace be upon him) to his wedding feast, and his wife had been serving them on that day while yet a bride. Sahl said ' Do you know what she served as a drink to Allah's Messenger (may peace be upon him)? She steeped the dates in water during the night in a big bowl, and when he (the Holy Prophet) had eaten food she served him this drink.",
      "chain": [
        "30367",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "5413",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا عبد العزيز بن أبي حازم، ح وحدثناه قتيبة بن، سعيد حدثنا يعقوب، - يعني ابن عبد الرحمن القاري - كلاهما عن أبي حازم، عن سهل، بن سعد عن النبي صلى الله عليه وسلم ‏.‏ بمثله ولم يقولا فتله ‏.‏ ولكن في رواية يعقوب قال فأعطاه إياه ‏.‏",
      "text_en": " This hadith is reported on the authority of Sahl b. Sa'd with a slight variation of wording.",
      "chain": [
        "30399",
        "20165",
        "30367",
        "11349",
        "399"
      ]
    },
    {
      "hadith_no": "5633",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثني سويد بن سعيد، حدثنا عبد العزيز بن أبي حازم، عن أبي سلمة بن عبد،الرحمن عن عائشة، أنها قالت واعد رسول الله صلى الله عليه وسلم جبريل عليه السلامفي ساعة يأتيه فيها فجاءت تلك الساعة ولم يأته وفي يده عصا فألقاها من يده وقال‏\"‏ ما يخلف الله وعده ولا رسله ‏\"‏ ‏.‏ ثم التفت فإذا جرو كلب تحت سريره فقال ‏\"‏ ياعائشة متى دخل هذا الكلب ها هنا ‏\"‏ ‏.‏ فقالت والله ما دريت ‏.‏ فأمر به فأخرج فجاءجبريل فقال رسول الله صلى الله عليه وسلم ‏\"‏ واعدتني فجلست لك فلم تأت ‏\"‏ ‏.‏ فقالمنعني الكلب الذي كان في بيتك إنا لا ندخل بيتا فيه كلب ولا صورة ‏.‏",
      "text_en": " A'isha reported that Gabriel (peace be upon him) made a promise with Allah's Messenger (may peace be upon him) to come at a definite hour; that hour came but he did not visit him. And there was in his hand (in the hand of Allah's Apostle) a staff. He threw it from his hand and said:                      Never has Allah or His messengers (angels) ever broken their promise. Then he cast a glance (and by chance) found a puppy under his cot and said: 'A'isha, when did this dog enter here? She said: BY Allah, I don't know He then commanded and it was turned out. Then Gabriel came and Allah's Messenger (may peace be upon him) said to him: You promised me and I waited for you. but you did not come, whereupon he said: It was the dog in your house which prevented me (to come), for we (angels) do not enter a house in which there is a dog or a picture.",
      "chain": [
        "30547",
        "20165",
        "53"
      ]
    },
    {
      "hadith_no": "6376",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني ابن أبي حازم - عن أبي، حازم عن سهل، ح وحدثنا قتيبة بن سعيد، - واللفظ هذا - حدثنا يعقوب، - يعني ابن عبد الرحمن - عن أبي حازم، أخبرني سهل بن سعد، أن رسول الله صلى الله عليه وسلم قال يوم خيبر ‏\"‏ لأعطين هذه الراية رجلا يفتح الله على يديه يحب الله ورسوله ويحبه الله ورسوله ‏\"‏ ‏.‏ قال فبات الناس يدوكون ليلتهم أيهم يعطاها - قال - فلما أصبح الناس غدوا على رسول الله صلى الله عليه وسلم كلهم يرجون أن يعطاها فقال ‏\"‏ أين علي بن أبي طالب ‏\"‏ ‏.‏ فقالوا هو يا رسول الله يشتكي عينيه - قال - فأرسلوا إليه فأتي به فبصق رسول الله صلى الله عليه وسلم في عينيه ودعا له فبرأ حتى كأن لم يكن به وجع فأعطاه الراية فقال علي يا رسول الله أقاتلهم حتى يكونوا مثلنا ‏.‏ فقال ‏\"‏ انفذ على رسلك حتى تنزل بساحتهم ثم ادعهم إلى الإسلام وأخبرهم بما يجب عليهم من حق الله فيه فوالله لأن يهدي الله بك رجلا واحدا خير لك من أن يكون لك حمر النعم ‏\"‏ ‏.‏",
      "text_en": " Sahl b. Sa'd reported that Allah's Messenger (may peace be upon him) said on the Day of Khaibar:                      I would certainly give this standard to a person at whose hand Allah would grant victory and who loves Allah and His Messenger and Allah and His Messenger love him also. The people spent the night thinking as to whom it would be given. When it was morning the people hastened to Allah's Messenger (may peace be upon him) all of them hoping that that would be given to him. He (the Holy Prophet) said: Where is 'Ali b. Abu Talib? They said: Allah's Messenger, his eyes are sore. He then sent for him and he was brought and Allah's Messenger (may peace be upon him) applied saliva to his eyes and invoked blessings and he was all right, as if he had no ailment at all, and coraferred upon him the standard. 'Ali said: Allah's Messenger, I will fight them until they are like us. Thereupon he (the Holy Prophet) said: Advance cautiously until you reach their open places, thereafter invite them to Islam and inform them what is obligatory for them from the rights of Allah, for, by Allah, if Allah guides aright even one person through you that is better for you than to possess the most valuable of the camels.",
      "chain": [
        "30367",
        "20165",
        "11172",
        "399",
        "30367",
        "20185",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "6382",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني ابن أبي حازم - عن أبي، حازم عن سهل بن سعد، قال استعمل على المدينة رجل من آل مروان - قال - فدعا سهل بن سعد فأمره أن يشتم عليا - قال - فأبى سهل فقال له أما إذ أبيت فقل لعن الله أبا التراب ‏.‏ فقال سهل ما كان لعلي اسم أحب إليه من أبي التراب وإن كان ليفرح إذا دعي بها ‏.‏ فقال له أخبرنا عن قصته لم سمي أبا تراب قال جاء رسول الله صلى الله عليه وسلم بيت فاطمة فلم يجد عليا في البيت فقال ‏\"‏ أين ابن عمك ‏\"‏ ‏.‏ فقالت كان بيني وبينه شىء فغاضبني فخرج فلم يقل عندي فقال رسول الله صلى الله عليه وسلم لإنسان ‏\"‏ انظر أين هو ‏\"‏ ‏.‏ فجاء فقال يا رسول الله هو في المسجد راقد ‏.‏ فجاءه رسول الله صلى الله عليه وسلم وهو مضطجع قد سقط رداؤه عن شقه فأصابه تراب فجعل رسول الله صلى الله عليه وسلم يمسحه عنه ويقول ‏\"‏ قم أبا التراب قم أبا التراب ‏\"‏ ‏.‏",
      "text_en": " Sahl b. Sa'd reported that a person from the offspring of Marwan was appointed as the governor of Medina. He called Sahl b. Sa'd and ordered him to abuse All Sahl refused to do that. He (the governor) said to him:                      If you do not agree to it (at least) say: May Allah curse Abu Turab. Sahl said: There was no name dearer to All than Abu Turab (for it was given to him by the Holy Prophet himself) and he felt delighted when he was called by this name. He (the governor) said to him: Narrate to us the story of his being nanied as Abu Turab. He said: Allah's Messenger (may peace be upon him) came to the house of Fatima and he did not find 'Ali in the house; whereupon he said: Where is your uncle's son? She said: (There cropped up something) between me and him which had annoyed him with me. He went out and did not rest here. Allah's Messenger (may peace be upon him) said to a person to find out where he was. He came and said: Allah's Messenger, he is sleeping in the mosque. Allah's Messenger (may peace be upon him) came to him and found him lying in the mosque and saw that his mantle had slipped from his back and his back was covered with dust and Allah's Messenger (may peace be upon him) began to wipe it away from him (from the body of Hadrat 'Ali) saying: Get up, covered with dust; get up, covered with dust.",
      "chain": [
        "30367",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "6853",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني عمرو الناقد، حدثنا عبد العزيز بن أبي حازم، حدثني هشام بن عروة، عن أبيه، عن عائشة، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'A'isha through another chain of transmitters.",
      "chain": [
        "30263",
        "20165",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "7230",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا عبد العزيز بن أبي حازم، حدثني أبي، عن عبيد، الله بن مقسم عن عبد الله بن عمر، قال رأيت رسول الله صلى الله عليه وسلم على المنبر وهو يقول ‏\"‏ يأخذ الجبار عز وجل سمواته وأرضيه بيديه ‏\"‏ ‏.‏ ثم ذكر نحو حديث يعقوب ‏.‏",
      "text_en": " Abdullah b. Miqsam reported that 'Abdullah b. 'Umar reported:                      I saw Allah'h Messenger (may peace be upon him) upon the pulpit and he was saying that the Mighty Lord, the Exalted and Glorious would take hold of the Heavens and earth in His hand. The rest of the hadith is the same,",
      "chain": [
        "30116",
        "20165",
        "11172",
        "11521",
        "18"
      ]
    },
    {
      "hadith_no": "7591",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا يعقوب بن عبد الرحمن، وعبد العزيز بن أبي، حازم عن أبي حازم، عن سهل بن سعد، قال قال رسول الله صلى الله عليه وسلم ‏.‏   وحدثنا قتيبة بن سعيد، - واللفظ له - حدثنا يعقوب، عن أبي حازم، أنه سمع  سهلا، يقول سمعت النبي صلى الله عليه وسلم يشير بإصبعه التي تلي الإبهام والوسطى وهو يقول ‏\"‏ بعثت أنا والساعة هكذا ‏\"‏ ‏.‏",
      "text_en": " This hadith has been reported by Sahl b. Sa'd that he heard Allah's Messenger (may peace be upon him) as saying:                      I and the Last Hour are (close to each other) like this (and he, in order to explain it) pointed (by joining his) forefinger, (one) next to the thumb and the middle finger (together).",
      "chain": [
        "30116",
        "20185",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "7642",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا يحيى بن يحيى، حدثنا عبد العزيز بن أبي حازم، عن أبيه، عن يزيد بن، رومان عن عروة، عن عائشة، أنها كانت تقول والله يا ابن أختي إن كنا لننظر إلى الهلال ثم الهلال ثم الهلال ثلاثة أهلة في شهرين وما أوقد في أبيات رسول الله صلى الله عليه وسلم نار - قال - قلت يا خالة فما كان يعيشكم قالت الأسودان التمر والماء إلا أنه قد كان لرسول الله صلى الله عليه وسلم جيران من الأنصار وكانت لهم منائح فكانوا يرسلون إلى رسول الله صلى الله عليه وسلم من ألبانها فيسقيناه ‏.‏",
      "text_en": " 'A'isha used to say to 'Urwa:                      Son of my sister, by Allah, I used to see the new moon, then the new moon, then the new moon, i. e. three moons in two months, and fire was not kindled in the house of Allah's Messenger (may peace be upon him). I ('Urwa) said: Auntie, then what were your means of sustenance? She said: Dates and water. But it (so happened) that Allah's Messenger (may peace be upon him) had some Ansar as his neighbours and they had milch animals and they used to send to Allah's Messenger (may peace be upon him) some milk of their (animals) and he served that to us.",
      "chain": [
        "30399",
        "20165",
        "11172",
        "11233",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "696",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا القعنبي، والنفيلي، قالا حدثنا عبد العزيز بن أبي حازم، قال أخبرني أبي، عن سهل، قال وكان بين مقام النبي صلى الله عليه وسلم وبين القبلة ممر عنز ‏.‏ قال أبو داود الخبر للنفيلي ‏.‏",
      "text_en": " Sahl said:                      The distance between the place where the Prophet (ﷺ) stood and the qiblah (i.e. the sutrah or the wall of the mosque) was as much as to allow a goat to pass.",
      "chain": [
        "20164",
        "30352",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "3661",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Knowledge (Kitab Al-Ilm) - كتاب العلم",
      "chapter_no": "26",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا عبد العزيز بن أبي حازم، عن أبيه، عن سهل، - يعني ابن سعد - عن النبي صلى الله عليه وسلم قال ‏\"‏ والله لأن يهدى بهداك رجل واحد خير لك من حمر النعم ‏\"‏ ‏.‏",
      "text_en": " Sahl b. Sa’d reported the prophet (ﷺ) as saying:                      I swear on Allah, it will be better for you that Allah should give guidance to one man through your agency than that you should acquire the red ones among the camels.",
      "chain": [
        "30116",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "4691",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد العزيز بن أبي حازم، قال حدثني بمنى، عن أبيه، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ القدرية مجوس هذه الأمة إن مرضوا فلا تعودوهم وإن ماتوا فلا تشهدوهم ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ) said: The Qadariyyah are the Magians of this community. If they are ill, do not pay a sick visit to them, and if they die, do not attend their funerals.",
      "chain": [
        "20040",
        "20165",
        "11172",
        "18"
      ]
    },
    {
      "hadith_no": "5150",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن الصباح بن سفيان، أخبرنا عبد العزيز، - يعني ابن أبي حازم - قال حدثني أبي، عن سهل، أن النبي صلى الله عليه وسلم قال ‏\"‏ أنا وكافل اليتيم كهاتين في الجنة ‏\"‏ ‏.‏ وقرن بين أصبعيه الوسطى والتي تلي الإبهام ‏.‏",
      "text_en": " Sahl (b. Sa’d) reported the prophet (May peace be upon him) as saying; I and the one who takes the responsibility of an orphan will be in Paradise thus, and he joined his middle finger and forefinger.",
      "chain": [
        "30269",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "525",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا علي بن حجر، حدثنا عبد العزيز بن أبي حازم، وعبد الله بن جعفر، عن أبي حازم، عن سهل بن سعد، رضى الله عنه قال ما كنا نتغدى في عهد رسول الله صلى الله عليه وسلم ولا نقيل إلا بعد الجمعة ‏.‏ قال وفي الباب عن أنس بن مالك رضى الله عنه ‏.‏ قال أبو عيسى حديث سهل بن سعد حديث حسن صحيح ‏.‏",
      "text_en": " Sahl bin Sa'd narrated:                     \"We would not have lunch during the time of Allah's Messenger, nor would we have a siesta, until after the Friday prayer.\"",
      "chain": [
        "20387",
        "20165",
        "108",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "1579",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا يحيى بن أكثم، حدثنا عبد العزيز بن أبي حازم، عن كثير بن زيد، عن الوليد بن رباح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن المرأة لتأخذ للقوم ‏\"‏ ‏.‏ يعني تجير على المسلمين ‏.‏ وفي الباب عن أم هانئ ‏.‏ وهذا حديث حسن غريب وسألت محمدا فقال هذا حديث صحيح ‏.‏ وكثير بن زيد قد سمع من الوليد بن رباح والوليد بن رباح سمع من أبي هريرة وهو مقارب الحديث ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     That the Prophet (ﷺ) said: \"Indeed a woman grants (assurances of protection) to a people\" - meaning it is to be honored - \"from the Muslims.\"There is something on this topic from Umm Hani, and this Hadith is Hasan Gharib.I asked Muhammad and he said: \"This Hadith is Sahih. Kathir bin Ziad heard from Al-Walid bin Rabah, and Al-Walid bin Rabah heard from Abu Hurairah, and he is Muqarib (average) in Hadith.",
      "chain": [
        "38696",
        "20165",
        "22171",
        "13"
      ]
    },
    {
      "hadith_no": "1741",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عبيد المحاربي، حدثنا عبد العزيز بن أبي حازم، عن موسى بن عقبة، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم صنع خاتما من ذهب فتختم به في يمينه ثم جلس على المنبر فقال ‏\"‏ إني كنت اتخذت هذا الخاتم في يميني ‏\"‏ ‏.‏ ثم نبذه ونبذ الناس خواتيمهم ‏.‏ قال وفي الباب عن علي وجابر وعبد الله بن جعفر وابن عباس وعائشة وأنس ‏.‏ قال أبو عيسى حديث ابن عمر حديث حسن صحيح ‏.‏ وقد روي هذا الحديث عن نافع عن ابن عمر نحو هذا من غير هذا الوجه ولم يذكر فيه أنه تختم في يمينه ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     \"The Prophet (ﷺ) had a ring of gold made for him which he wore on his right (hand). Then he sat on the Minbar and said: 'I did indeed have this ring on my right hand' then he discarded it and the people discarded their rings.\"He said: There are narrations on this topic from 'Ali, Jabir, 'Abdullah bin Ja'far, Ibn 'Abbas, 'Aishah, and Anas.[Abu 'Eisa said:] The Hadith of Ibn 'Umar is Hasan Sahih Hadith. This Hadith has been reported similarly from 'Nafi, from Ibn 'Umar, through routes other than this, and it was not mentioned in it that the ring was on his right hand.",
      "chain": [
        "35135",
        "20165",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2042",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا عبد الله بن عمران أبو القاسم المكي القرشي، حدثنا عبد العزيز بن أبي حازم، عن أبيه، عن سهل بن سعد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنا وكافل اليتيم في الجنة كهاتين ‏\"‏ ‏.‏ وأشار بأصبعيه يعني السبابة والوسطى ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Sahl bin Sa'd narrated that:                     the Messenger of Allah said: \" I and the sponsor of an orphan shall be in Paradise like these two.\"And he indicaed with his fingers, meaning his index and his middle finger",
      "chain": [
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "3693",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، عن إسماعيل بن أبي خالد، حدثني قيس، وهو ابن أبي حازم عن عقبة بن عامر الجهني، عن النبي صلى الله عليه وسلم قال ‏\"‏ قد أنزل الله على آيات لم ير مثلهن ‏:‏ ‏(‏ قل أعوذ برب الناس ‏)‏ إلى آخر السورة و ‏:‏ ‏(‏قل أعوذ برب الفلق ‏)‏ إلى آخر السورة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Uqbah bin Amir Al-Juhni narrated that:                     the Prophet said: “Allah has revealed to me Ayat the likes of which have not been seen: “Say: I seek refuge in the Lord of mankind…” until the end of the Surat. “Say: I seek refuge in the Lord of Al-Falaq…” until the end of the Surat.",
      "chain": [
        "30160",
        "20031",
        "11418",
        "11046",
        "20165",
        "189"
      ]
    },
    {
      "hadith_no": "3393",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا الحسين بن حريث، حدثنا عبد العزيز بن أبي حازم، عن كثير بن زيد، عن عثمان بن ربيعة، عن شداد بن أوس، رضى الله عنه أن النبي صلى الله عليه وسلم قال له ‏\"‏ ألا أدلك على سيد الاستغفار اللهم أنت ربي لا إله إلا أنت خلقتني وأنا عبدك وأنا على عهدك ووعدك ما استطعت أعوذ بك من شر ما صنعت وأبوء إليك بنعمتك على وأعترف بذنوبي فاغفر لي ذنوبي إنه لا يغفر الذنوب إلا أنت ‏.‏ لا يقولها أحدكم حين يمسي فيأتي عليه قدر قبل أن يصبح إلا وجبت له الجنة ولا يقولها حين يصبح فيأتي عليه قدر قبل أن يمسي إلا وجبت له الجنة ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وابن عمر وابن مسعود وابن أبزى وبريدة رضى الله عنهم ‏.‏ قال وهذا حديث حسن غريب ‏.‏ وعبد العزيز بن أبي حازم هو ابن أبي حازم الزاهد ‏.‏ وقد روي هذا الحديث من غير هذا الوجه عن شداد بن أوس رضى الله عنه ‏.‏",
      "text_en": " Shaddad bin Aws narrated that:                     The Prophet said to him: “Should I not direct you to the chief of supplications for forgiveness? ‘O Allah, You are my Lord, there is none worthy of worship except You, You created me and I am Your slave. I am adhering to Your covenant and Your promise as much as I am able to, I seek refuge in You from the evil of what I have done. I admit to You your blessings upon me, and I admit to me sins. So forgive me, for there is none who can forgive sins except You (Allahumma Anta Rabbi La Ilaha Illa Anta Khalaqtani Wa Ana `Abduka Wa Ana `Ala `Ahdika Wa Wa’dika Ma-stata’tu. A’udhu Bika Min Sharri Ma Sana’tu Wa Abu'u ilayka Bini’matika Alayya Wa A’tarifu Bidhunubi Faghfirli Dhunubi Innahu La Yaghfirudh-Dhunuba Illa Ant).’ None of you says it when he reaches the evening, and a decree comes upon him before he reaches morning, except that Paradise becomes obligatory upon him. And none says it when he reaches the morning, and a decree comes upon him before he reaches evening, except that Paradise becomes obligatory for him.”",
      "chain": [
        "30325",
        "20165",
        "22171",
        "389"
      ]
    },
    {
      "hadith_no": "44",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة، قال حدثنا عبد العزيز بن أبي حازم، عن أبيه، عن مسلم بن قرط، عن عروة، عن عائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا ذهب أحدكم إلى الغائط فليذهب معه بثلاثة أحجار فليستطب بها فإنها تجزي عنه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that the Messenger of Allah (ﷺ) said:                      \"When any one of you goes to the Gha'it (toilet to defecate), let him take with him three stones and clean himself with them, for that will suffice him.\"",
      "chain": [
        "30367",
        "20165",
        "11172",
        "12506",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "90",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن زنبور المكي، قال حدثنا ابن أبي حازم، عن يزيد بن عبد الله، أن محمد بن إبراهيم، حدثه عن عيسى بن طلحة، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا استيقظ أحدكم من منامه فتوضأ فليستنثر ثلاث مرات فإن الشيطان يبيت على خيشومه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                      \"When any one of you wakes from sleep to perform Wudu', then let him sniff water in his nose and blow it out three times, for the Shaitan spends the night on his nose.\"",
      "chain": [
        "33021",
        "20165",
        "11318",
        "11213",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "1017",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن زنبور المكي، قال حدثنا ابن أبي حازم، عن يزيد بن عبد الله، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما أذن الله لشىء ما أذن لنبي حسن الصوت يتغنى بالقرآن يجهر به ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     He heard the Messenger of Allah (ﷺ) say: \"Allah never listens to anything as He listens to a Prophet with a beautiful voice chanting the Quran aloud.\"",
      "chain": [
        "33021",
        "20165",
        "11318",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4440",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا محمد بن زنبور المكي، قال حدثنا ابن أبي حازم، عن يزيد، - وهو ابن الهاد - عن معاوية بن عبد الله بن جعفر، عن عبد الله بن جعفر، قال مر رسول الله صلى الله عليه وسلم على أناس وهم يرمون كبشا بالنبل فكره ذلك وقال ‏\"‏ لا تمثلوا بالبهائم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Ja'far said:                     \"The Messenger of Allah passed by some people who were shooting arrows at a ram. He denounced that and said: 'Do not disfigure animals (by using them as targets).\" (Sahih )",
      "chain": [
        "33021",
        "20165",
        "11234",
        "19017",
        "108"
      ]
    },
    {
      "hadith_no": "4928",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا أبو صالح، محمد بن زنبور قال حدثنا ابن أبي حازم، عن يزيد بن عبد الله، عن أبي بكر بن محمد، عن عمرة، عن عائشة، أنها سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يقطع السارق إلا في ربع دينار فصاعدا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that:                     she heard the Messenger of Allah say: \"The hand of the thief is not be cut off except for one-quarter of a Dinar or more.\"",
      "chain": [
        "20165",
        "11318",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "203",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا هشام بن عمار، ومحمد بن الصباح، قالا حدثنا عبد العزيز بن أبي حازم، حدثني أبي، عن عبيد الله بن مقسم، عن عبد الله بن عمر، أنه قال سمعت رسول الله  صلى الله عليه وسلم  وهو على المنبر يقول ‏\"‏ يأخذ الجبار سمواته وأرضه بيده - وقبض بيده فجعل يقبضها ويبسطها - ثم يقول أنا الجبار أين الجبارون أين المتكبرون ‏\"‏ ‏.‏ قال ويتميل رسول الله  صلى الله عليه وسلم  عن يمينه وعن يساره حتى نظرت إلى المنبر يتحرك من أسفل شىء منه حتى إني أقول أساقط هو برسول الله  صلى الله عليه وسلم",
      "text_en": " It was narrated that 'Abdullah bin 'Umar said:                     \"I heard the Messenger of Allah say, when he was on the pulpit: 'The Compeller will seize the heavens and the earth in His Hand' and he clenched his fist and began to open and close it. Then He will say: \"I am the Compeller! Where are the tyrants? Where are the arrogant?\" He said, the Messenger of Allah was turning to his right and to his left, until he saw the pulpit moving from below and I thought: 'What if it falls with the Messenger of Allah on it?'\"",
      "chain": [
        "30288",
        "30269",
        "20165",
        "11172",
        "11521",
        "18"
      ]
    },
    {
      "hadith_no": "211",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان العثماني حدثنا عبد العزيز بن أبي حازم، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ من دعا إلى هدى كان له من الأجر مثل أجور من اتبعه لا ينقص ذلك من أجورهم شيئا ومن دعا إلى ضلالة فعليه من الإثم مثل آثام من اتبعه لا ينقص ذلك من آثامهم شيئا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah said: \"Whoever calls people to true guidance, will have a reward equal to that of those who follow him, without that detracting from their reward in the slightest. And whoever calls people to misguidance, will have a (burden of) sin equal to that of those who follow him, without that detracting from their sins in the slightest.'\"",
      "chain": [
        "32032",
        "20165",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "610",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد العزيز بن أبي حازم، ح وحدثنا أبو إسحاق الهروي، حدثنا إسماعيل بن جعفر، جميعا عن العلاء، عن أبيه، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ جعلت لي الأرض مسجدا وطهورا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah said: \"the earth has been made for me a place of worship and a means of purification.\"",
      "chain": [
        "32048",
        "20165",
        "20155",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "705",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا المغيرة بن عبد الرحمن، عن محمد بن عجلان، عن المقبري، عن أبي هريرة، ح وحدثنا يعقوب بن حميد، حدثنا ابن أبي حازم، عن عبد الرحمن بن حرملة، عن سعيد بن المسيب، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ لا تغلبنكم الأعراب على اسم صلاتكم - زاد ابن حرملة - فإنما هي العشاء وإنما يقولون العتمة لإعتامهم بالإبل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Prophet said: \"Do not let the Bedouins make you change the name of your prayer.\" Ibn Harmalah added: \"Rather it is the 'Isha', but they say the 'Atamah because they bring their camels in for milking at that time (when it is dark).\"",
      "chain": [
        "32048",
        "20182",
        "10616",
        "11168",
        "13",
        "32048",
        "20165",
        "11878",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "935",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد العزيز بن أبي حازم، عن يزيد بن الهاد، عن محمد بن إبراهيم التيمي، عن عامر بن سعد، عن العباس بن عبد المطلب، أنه سمع النبي  صلى الله عليه وسلم  يقول ‏\"‏ إذا سجد العبد سجد معه سبعة آراب وجهه وكفاه وركبتاه وقدماه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abbas bin ‘Abdul-Muttalib that he heard theProphet (ﷺ) say:                      “When a person prostrates, seven parts of hisbodyprostrate with him: His face, his two hands, his two knees, andhistwo feet.”",
      "chain": [
        "32048",
        "20165",
        "11234",
        "11213",
        "10554",
        "100"
      ]
    },
    {
      "hadith_no": "1036",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محرز بن سلمة العدني، حدثنا ابن أبي حازم، عن عبد الرحمن بن حرملة، عن أبي علي الهمداني، أنه خرج في سفينة فيها عقبة بن عامر الجهني فحانت صلاة من الصلوات فأمرناه أن يؤمنا وقلنا له إنك أحقنا بذلك أنت صاحب رسول الله  صلى الله عليه وسلم  فأبى فقال إني سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ من أم الناس فأصاب فالصلاة له ولهم ومن انتقص من ذلك شيئا فعليه ولا عليهم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu ‘Ali Al-Hamdani that he went out in a ship inwhich ‘Uqbah bin ‘Amir Al-Juhani was present. The time for prayercame, and we told him to lead us in prayer and said to him:                      “Youarethe most deserving of that, you were the Companion of theMessenger ofAllah (ﷺ).” But he refused and said: “I heard theMessenger of Allah(ﷺ) say: ‘Whoever leads the people and gets itright, the prayerwill be for him and for them, but if he fallsshort, then that will becounted against him but not against them.”",
      "chain": [
        "20165",
        "11878"
      ]
    },
    {
      "hadith_no": "1122",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محرز بن سلمة العدني، حدثنا عبد العزيز بن أبي حازم، عن إبراهيم بن إسماعيل، عن عبد الكريم، عن مجاهد، وسعيد بن جبير، وعطاء بن أبي رباح، وطاوس، أخبروه عن ابن عباس، أنه أخبرهم أن رسول الله  صلى الله عليه وسلم  كان يجمع بين المغرب والعشاء في السفر من غير أن يعجله شىء ولا يطلبه عدو ولا يخاف شيئا ‏.‏",
      "text_en": " It wasnarrated from Mujahid, Sa’eed bin Jubair, ‘Ata’ bin Abi Rabahand Tawus that Ibn ‘Abbas told them that the Messenger of Allah(ﷺ)used to combine the Maghrib and ‘Isha’ when traveling,although therewas nothing to make him hurry and no enemy pursuinghim, and he wasnot afraid of anything.",
      "chain": [
        "20165",
        "26500",
        "18655",
        "11028",
        "11050",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "1139",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محرز بن سلمة العدني، حدثنا عبد العزيز بن أبي حازم، عن العلاء، عن أبيه، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ الجمعة إلى الجمعة كفارة ما بينهما ما لم تغش الكبائر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “From one Friday to the next is an expiation for whatever wascommitted in between, so long as one does not commit any major sin.”",
      "chain": [
        "20165",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "1153",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن الصباح، حدثنا عبد العزيز بن أبي حازم، حدثني أبي، عن سهل بن سعد، قال ما كنا نقيل ولا نتغدى إلا بعد الجمعة ‏.‏",
      "text_en": " It wasnarrated that Sahl bin Sa’d said:                      “We did not take a Qailulah noreat Ghada’ until after Friday (prayer).”*",
      "chain": [
        "30269",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "1285",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو مروان العثماني، حدثنا عبد العزيز بن أبي حازم، عن هشام بن عروة، عن أبيه، عن عائشة، قالت ما رأيت رسول الله  صلى الله عليه وسلم  يصلي في شىء من صلاة الليل إلا قائما حتى دخل في السن فجعل يصلي جالسا حتى إذا بقي عليه من قراءته أربعون آية أو ثلاثون آية قام فقرأها وسجد ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “I did not see the Messenger ofAllah(ﷺ) offer any of the night prayers in any way other thanstanding,until he became old. Then he started to pray sitting downuntil, whenthere were thirty or forty Verses left of his recitation,he wouldstand up and recite them, and prostrate.”",
      "chain": [
        "32032",
        "20165",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1432",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، ح وحدثنا أبو مروان، محمد بن عثمان العثماني حدثنا عبد العزيز بن أبي حازم، جميعا عن هشام بن عروة، عن أبيه، عن عائشة، قالت قال النبي  صلى الله عليه وسلم  ‏\"‏ إذا نعس أحدكم فليرقد حتى يذهب عنه النوم فإنه لا يدري إذا صلى وهو ناعس لعله يذهب يستغفر فيسب نفسه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “The Prophet (ﷺ) said: ‘Ifanyoneof you becomes drowsy, let him sleep until he feels refreshed,for hedoes not know, if he prays when he feels drowsy, he may want tosaywords seeking forgiveness but (instead) he ends up cursinghimself.’”",
      "chain": [
        "30201",
        "20331",
        "32032",
        "20165",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1633",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا عبد العزيز بن أبي حازم، عن سهيل، عن أبيه، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لأن يجلس أحدكم على جمرة تحرقه خير له من أن يجلس على قبر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah said:                      The Messenger of Allah (ﷺ)said:“If one of you were to sit on a live coal that burns him, thatwould be better for him than if he were to sit on a grave.”",
      "chain": [
        "30547",
        "20165",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "1767",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا هشام بن عمار، ومحمد بن الصباح، قالا حدثنا عبد العزيز بن أبي حازم، عن أبيه، عن سهل بن سعد، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ لا يزال الناس بخير ما عجلوا الفطر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Sahl bin Sa’d that the Prophet (ﷺ) said:                      “Thepeople will remain upon goodness as long as they hasten to breaktheirfast.”",
      "chain": [
        "30288",
        "30269",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "1858",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان العثماني حدثنا عبد العزيز بن أبي حازم، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ تأتي الإبل التي لم تعط الحق منها تطأ صاحبها بأخفافها وتأتي البقر والغنم تطأ صاحبها بأظلافها وتنطحه بقرونها ويأتي الكنز شجاعا أقرع فيلقى صاحبه يوم القيامة فيفر منه صاحبه مرتين ثم يستقبله فيفر صاحبه فيقول مالي ولك ‏.‏ فيقول أنا كنزك أنا كنزك ‏.‏ فيتقيه بيده فيلقمها ‏.‏",
      "text_en": " 'Abu Hurairah narrated that:                     the Messenger of Allah said: “The camels on which the dues (i.e. Zakat) were not paid will come, trampling their owners with their hooves. And cattle and sheep will come and trample at their owners with their hooves and butt them with their horns, And hoarded treasure will come in the form of a bald-headed snale, and will meet its owner on the Day of Resurrection. Its owner will flee from it two time, then it will come to him and he will flee again, and will say: 'What do I have to do with you?' and it will say: 'I am your hoarded treasure, I am your hoarded treasure.' He will try to shield himself with this hand and it will devour it.”",
      "chain": [
        "32032",
        "20165",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "1978",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد العزيز بن أبي حازم، عن سهيل، عن أبيه، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  لعن المرأة تتشبه بالرجال والرجل يتشبه بالنساء ‏.‏",
      "text_en": " It was narrated from Abu Hurairah:                     that the Messenger of Allah cursed women who imitate men and men who imitate women.",
      "chain": [
        "32048",
        "20165",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "1987",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن الصباح، أنبأنا عبد العزيز بن أبي حازم، حدثني أبي، عن سهل بن سعد الساعدي، قال دعا أبو أسيد الساعدي رسول الله  صلى الله عليه وسلم  إلى عرسه فكانت خادمهم العروس ‏.‏ قالت تدري ما سقيت رسول الله  صلى الله عليه وسلم  قالت أنقعت تمرات من الليل فلما أصبحت صفيتهن فأسقيتهن إياه ‏.‏",
      "text_en": " It was narrated that Sahl bin Sa'd  As-Sa'idi said:                     “Abu Usaid As-Sa'idi invited the Messenger of Allah to his wedding, and the bride herself served them. She said: 'Do you know what I gave the Messenger of Allah to drink? I had soaked some dates the night before, then in the morning I strained them and gave him that water to drink.' ”",
      "chain": [
        "30269",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "2673",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد العزيز بن أبي حازم، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال وحدثنا المغيرة بن عبد الرحمن، عن ابن عجلان، عن أبيه، عن أبي هريرة، قال وحدثنا أنس بن عياض، عن أبي معشر، عن محمد بن كعب، وموسى بن يسار، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ من حمل علينا السلاح فليس منا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     “Whoever bears weapons against us is not one of us.”",
      "chain": [
        "32048",
        "20165",
        "11173",
        "11161",
        "13",
        "20182",
        "10616",
        "13",
        "20157",
        "19825",
        "11221",
        "19054",
        "13"
      ]
    },
    {
      "hadith_no": "2820",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Wills - كتاب الوصايا",
      "chapter_no": "22",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان العثماني حدثنا عبد العزيز بن أبي حازم، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، أن رجلا، سأل رسول الله صلى الله عليه وسلم قال إن أبي مات وترك مالا ولم يوص فهل يكفر عنه أن تصدقت عنه قال ‏\"‏ نعم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that a man asked the Messenger of Allah (ﷺ):                     “My father died and left behind wealth, but he did not make a will. Will it expiate for him if I give charity on his behalf?” He said: “Yes.”",
      "chain": [
        "32032",
        "20165",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "3232",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان العثماني حدثنا عبد العزيز بن أبي حازم، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ اللهم إن إبراهيم خليلك ونبيك وإنك حرمت مكة على لسان إبراهيم اللهم وأنا عبدك ونبيك وإني أحرم ما بين لابتيها ‏\"‏ ‏.‏ قال أبو مروان لابتيها حرتى المدينة ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) said:                      “OAllah!Ibrahim was Your Friend and Prophet, and You declared Makkah tobesacred through Ibrahim. O Allah! I am Your slave and Prophet, and Ideclare what is between its two lava fields to be sacred.”",
      "chain": [
        "32032",
        "20165",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "3460",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن الصباح، وسويد بن سعيد، قالا حدثنا عبد العزيز بن أبي حازم، حدثني أبي قال، سألت سهل بن سعد هل رأيت النقي قال ما رأيت النقي حتى قبض رسول الله  صلى الله عليه وسلم  ‏.‏ فقلت فهل كان لهم مناخل على عهد رسول الله  صلى الله عليه وسلم  قال ما رأيت منخلا حتى قبض رسول الله  صلى الله عليه وسلم  ‏.‏ قلت فكيف كنتم تأكلون الشعير غير منخول قال نعم ننفخه فيطير منه ما طار وما بقي ثريناه ‏.‏",
      "text_en": " ‘Abdul-‘Aziz bin Abu Hazim said:                      My father told me: I asked SahlbinSa’d: “Did you ever see dough made from well-sifted flour?”He said:“I never saw dough made from well-sifted flour until theMessenger ofAllah (ﷺ) passed away.” I said: “Did they havesieves at the time ofthe Messenger of Allah (ﷺ)?” He said: “Inever saw a sieve until theMessenger of Allah (ﷺ) passed away.”I said: “How did you eat barleythat was not sifted?” He said:“We used to blow on it, and whateverflew away, flew away, andwhatever was left we made dough with it.”",
      "chain": [
        "30269",
        "30547",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "3593",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا هشام بن عمار، ومحمد بن الصباح، قالا حدثنا عبد العزيز بن أبي حازم، عن أبيه، عن سهل بن سعد الساعدي، قال جرح رسول الله  صلى الله عليه وسلم  يوم أحد وكسرت رباعيته وهشمت البيضة على رأسه فكانت فاطمة تغسل الدم عنه وعلي يسكب عليه الماء بالمجن فلما رأت فاطمة أن الماء لا يزيد الدم إلا كثرة أخذت قطعة حصير فأحرقتها حتى إذا صار رمادا ألزمته الجرح فاستمسك الدم ‏.‏",
      "text_en": " It wasnarrated that Sahl bin Sa’d As-Sa’idi said:                      “The Messenger ofAllah (ﷺ) was wounded on the Day of Uhud. His molar was broken andhis helmet was crushed on his head. Fatimah was washing the bloodfromhim and ‘Ali was pouring water on him from a shield. WhenFatimahrealized that the water was only making the bleeding worse,she took apiece of a mat and burnt it, and when it had turned toashes, sheapplied it to the wound to stop the bleeding.",
      "chain": [
        "30288",
        "30269",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "3684",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا هشام بن عمار، حدثنا عبد العزيز بن أبي حازم، عن أبيه، عن سهل بن سعد الساعدي، أن امرأة، جاءت إلى رسول الله  صلى الله عليه وسلم  ببردة - قال وما البردة قال الشملة - قالت يا رسول الله إني نسجت هذه بيدي لأكسوكها ‏.‏ فأخذها رسول الله  صلى الله عليه وسلم  محتاجا إليها فخرج علينا فيها وإنها لإزاره فجاء فلان بن فلان - رجل سماه يومئذ - فقال يا رسول الله ما أحسن هذه البردة اكسنيها ‏.‏ قال ‏\"‏ نعم ‏\"‏ ‏.‏ فلما دخل طواها وأرسل بها إليه فقال له القوم والله ما أحسنت كسيها النبي  صلى الله عليه وسلم  محتاجا إليها ثم سألته إياها وقد علمت أنه لا يرد سائلا ‏.‏ فقال إني والله ما سألته إياها لألبسها ولكن سألته إياها لتكون كفني ‏.‏ فقال سهل فكانت كفنه يوم مات ‏.‏",
      "text_en": " It wasnarrated from Sahl bin Sa’d Sa’idi that a woman came to theMessenger of Allah (ﷺ) with a woven sheet – he said:                     * “Whattype ofwoven sheet?” He said: “A Shamlah.” She said: “OMessenger of Allah, Ihave woven this with my own hands for you towear.” The Messenger ofAllah (ﷺ) took it, since he needed it. Hecame out to us wearing itas a lower wrap. So-and-so the son ofso-and-so.” – a man whose namehe told that day – said: “OMessenger of Allah, how beautiful thissheet is! Let me wear it.”He said: “Yes.” When he went inside hefolded it up and sent itto him. The people said to him: “By Allah,you have not done well.The Prophet (ﷺ) wore it because he neededit, then you asked forit, and you knew that he would not refuseanyone who asked him forsomething.” He said: “By Allah, I did not askfor it so that Icould wear it, rather I asked for it so that it couldbe my shroud.”Sahl said: “And it became his shroud the day he died.”",
      "chain": [
        "30288",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "3784",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو مروان، محمد بن عثمان العثماني حدثنا عبد العزيز بن أبي حازم، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ قال الله عز وجل قسمت الصلاة بيني وبين عبدي شطرين فنصفها لي ونصفها لعبدي ولعبدي ما سأل ‏\"‏ ‏.‏ قال فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ اقرءوا يقول العبد ‏{الحمد لله رب العالمين}‏ فيقول الله عز وجل حمدني عبدي ولعبدي ما سأل ‏.‏ فيقول ‏{الرحمن الرحيم}‏ فيقول أثنى على عبدي ولعبدي ما سأل ‏.‏ يقول ‏{مالك يوم الدين }‏ فيقول الله مجدني عبدي فهذا لي وهذه الآية بيني وبين عبدي نصفين يقول العبد ‏{إياك نعبد وإياك نستعين}‏ يعني فهذه بيني وبين عبدي ولعبدي ما سأل وآخر السورة لعبدي يقول العبد ‏{اهدنا الصراط المستقيم * صراط الذين أنعمت عليهم غير المغضوب عليهم ولا الضالين}‏ فهذا لعبدي ولعبدي ما سأل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said, 'I heard the Messenger of Allah(ﷺ) say':                     \"Allah said: 'I have divided the prayer between Myself and My slave into two halves, and My slave shall have what he has asked for.'When the slave says: 'Al-hamdulillah i rabbil Alameen (All the praise is to Allah, the Lord of all that exists),' Allah says:'My slave has praised Me, and My slave shall have what he has asked for.' And when he says: 'Ar-Rahmanir-Rahim (The Mos Gracious, the Most Merciful),' Allah says: 'My slave has extolled Me, and My slave shall have what he has asked for.' And when he says: 'Maliki yawmiddin [The Only Owner (and he Ruling Judge] if the Day of Recompense],' Allahs says: 'My slave has Glorified Me. This is for Me, and this Verse is between me and My slave in two halves.' And when he says: ' Iyyaka na'budu wa iyyaka nastain [You (Alone) we worship, and You (Alone) we ask for help],' He says: 'This is between Me an My slave, and My slave shall have what he has asked for.' And the end of the Surah is for My slave.' And when he says: 'Ihdinas-siratal-mustaqeema, siratal-alldhina an'amta alayhim a lad-dallin [Guide us to the Straight Way, the way of those on whom You have bestowed Your Grace, not(the way) of those who earned Your Anger, nor of those who went astray],' He says: 'THis is for My slave, and My slave shall have what he has asked for.\"",
      "chain": [
        "32032",
        "20165",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "3868",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد العزيز بن أبي حازم، عن سهيل، عن أبيه، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا أصبحتم فقولوا اللهم بك أصبحنا وبك أمسينا وبك نحيى وبك نموت وإذا أمسيتم فقولوا اللهم بك أمسينا وبك أصبحنا وبك نحيى وبك نموت وإليك المصير ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     the Messenger of Allah (saas) said: \"In the morning say: 'Allahumma bika asbahna, wa bika amsayna, wa bika nahya, wa bika namut (O Allah, by Your leave we have reached the morning and by Your leave we reach the evening, and by Your leave we live and by Your leave we die). And when evening comes, say: Allahumma bika amsayna, wa bika asbahna, wa bika nahya, wa bika namut, wa ilaykal-masir (O Allah, by Your leave we have reached the evening and by Your leave we reach the morning, and by Your leave we live and by Your leave we die, and unto You is our return).\"",
      "chain": [
        "32048",
        "20165",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "3901",
      "source": " Sunan Ibn Majah ",
      "chapter": "Interpretation of Dreams - كتاب تعبير الرؤيا",
      "chapter_no": "35",
      "text_ar": "حدثنا أبو مروان العثماني، قال حدثنا عبد العزيز بن أبي حازم، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من رآني في المنام فقد رآني فإن الشيطان لا يتمثل بي ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “Whoever sees me in a dream has (really) seen me, for Satancannotappear in my form.”",
      "chain": [
        "32032",
        "20165",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "4092",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا هشام بن عمار، ومحمد بن الصباح، قالا حدثنا عبد العزيز بن أبي حازم، حدثني أبي، عن عمارة بن حزم، عن عبد الله بن عمرو، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ كيف بكم وبزمان يوشك أن يأتي يغربل الناس فيه غربلة وتبقى حثالة من الناس قد مرجت عهودهم وأماناتهم فاختلفوا وكانوا هكذا ‏\"‏ ‏.‏ وشبك بين أصابعه قالوا كيف بنا يا رسول الله إذا كان ذلك قال ‏\"‏ تأخذون بما تعرفون وتدعون ما تنكرون وتقبلون على خاصتكم وتذرون أمر عوامكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from ‘Abdullah bin ‘Amr that the Messenger ofAllah(ﷺ) said:                      “How will you be at a time that will soon come,when thegood people will pass away and only the worst ones will beleft, whowill break their promises and betray their trusts, and theywilldiffer while they were previously together like this,” – andheinterlaced his fingers. They said: “What should we do, OMessenger ofAllah, when that comes to pass?” He said: “Followthat which you knowis true, and leave that which you dislike. Takecare of your ownaffairs and turn away from the common folk.”",
      "chain": [
        "30288",
        "30269",
        "20165",
        "11172",
        "29"
      ]
    },
    {
      "hadith_no": "4112",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن الصباح، حدثنا عبد العزيز بن أبي حازم، أخبرني أبي، عن بعجة بن عبد الله بن بدر الجهني، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ خير معايش الناس لهم رجل ممسك بعنان فرسه في سبيل الله ويطير على متنه كلما سمع هيعة أو فزعة طار عليه إليها يبتغي الموت أو القتل مظانه ورجل في غنيمة في رأس شعفة من هذه الشعاف أو بطن واد من هذه الأودية يقيم الصلاة ويؤتي الزكاة ويعبد ربه حتى يأتيه اليقين ليس من الناس إلا في خير ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) said:                      “Thebest lifestyle is that of a man who holds onto the reins of his horsefor the sake of Allah, riding on its back. Every time he hears acommotion he rushes towards it, seeking death wherever he thinks hecan find it; and a man who tends sheep at the top of one of thesepeaks, or in the bottom of one of these valleys, establishing theprayer, paying the charity, and worshipping his Lord until theinevitable (death) comes to him and there is nothing between him andthe people except good.”",
      "chain": [
        "30269",
        "20165",
        "11172",
        "10893",
        "13"
      ]
    },
    {
      "hadith_no": "4183",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو مروان العثماني، حدثنا عبد العزيز بن أبي حازم، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لا تقوم الساعة حتى يفيض المال وتظهر الفتن ويكثر الهرج ‏\"‏ ‏.‏ قالوا وما الهرج يا رسول الله قال ‏\"‏ القتل القتل القتل ‏\"‏ ‏.‏ ثلاثا ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “The Hour will not begin until wealth becomes abundant andtribulations appear, and Harj increases.” They said: “What isHarj, OMessenger of Allah?” He said: “Killing, killing,killing,” threetimes.",
      "chain": [
        "32032",
        "20165",
        "10606",
        "11884",
        "13"
      ]
    }
  ],
  "total_hadiths": 103
}