{
  "id": "20167",
  "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
  "full_name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "187",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ع  -  صدوق ]"
    ],
    "tags": [
      "al-Juhni",
      "Client",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11163",
      "name": "Zayd bin Aslam زيد بن أسلم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11858",
      "name": "Sharayk bin 'Abdullah bin Abi Namr شريك بن عبد الله بن أبي نمر",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11209",
      "name": "'Amr bin Abi 'Amr عمرو بن أبي عمرو ميسرة مولى المطلب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11155",
      "name": "Thur bin Zayd al-Dayli ثور بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10898",
      "name": "Ja'far bin Muhammad bin 'Ali جعفر بن محمد بن علي - الصادق",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11835",
      "name": "al-Harith bin Fadayl al-Ansari الحارث بن فضيل الأنصاري الخطمي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11162",
      "name": "Rabi'ya bin Abi 'Abdur Rahman ربيعة بن أبي عبد الرحمن - ربيعة الرأي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11172",
      "name": "Abu Hazim, Salma bin Dinar سلمة بن دينار أبو حازم الأعرج",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11173",
      "name": "Suhayl bin Abi Salah سهيل بن أبي صالح",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11177",
      "name": "Safwan bin Slym al-Madni صفوان بن سليم المدني أبو عبد الله",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11186",
      "name": "'Abdullah bin 'Abdur Rahman bin Ma'mar عبد الله بن عبد الرحمن بن معمر",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11705",
      "name": "'Abdul Majeed bin Sahl bin 'Abdur Rahman عبد المجيد بن سهل بن عبد الرحمن",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11894",
      "name": "'Amarah bin Ghazya bin al-Harith عمارة بن غزية بن الحارث",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11210",
      "name": "'Amr bin Yahya bin 'Ammara عمرو بن يحيى بن عمارة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10606",
      "name": "al-Ala' bin 'Abdur Rahman bin Ya'qub العلاء بن عبد الرحمن",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11220",
      "name": "Muhammad bin 'Amr bin 'Alqama محمد بن عمرو بن علقمة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11106",
      "name": "Musa bin 'Uqba موسى بن عقبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11234",
      "name": "Yazid bin 'Abdullah bin Usama B. al-Haad يزيد بن عبد الله بن أسامة بن الهاد",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20002",
      "name": "Imam Shafi'ee ابو عبد الله محمد بن إدريس الشافعي",
      "grade": "Succ. (Taba' Tabi') [9th generation] [Shafi'ee]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28280",
      "name": "'Abdullah bin Ja'far عبد الله بن جعفر الرقي المعيطي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20164",
      "name": "'Abdullah bin Muslima al-Qa'nabi عبد الله بن مسلمة بن قعنب القعنبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30228",
      "name": "Asbgh bin al-Frj bin Sa'id أصبغ بن الفرج بن سعيد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30316",
      "name": "Bashr bin al-Hakam bin Habib بشر بن الحكم بن حبيب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30116",
      "name": "Sa'id bin Mnswr bin Sh'bh سعيد بن منصور بن شعبة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30418",
      "name": "'Abdullah bin al-Zubair bin 'Isa عبد الله بن الزبير بن عيسى الحميدي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30101",
      "name": "Ibrahim bin Hamza bin Muhammad إبراهيم بن حمزة بن محمد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30421",
      "name": "Muhammad bin Yahya bin Abi 'Umar محمد بن يحيى بن أبي عمر العدني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30280",
      "name": "Harun bin al-Ma'ruf هارون بن معروف المروزي الخزاز الضرير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20296",
      "name": "Hisham bin 'Abdul Malik al-Tayalasi هشام بن عبد الملك أبو الوليد الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20640",
      "name": "Mrwan bin Muhammad bin Hsan مروان بن محمد بن حسان الأسدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "32032",
      "name": "Muhammad bin 'Uthman bin Khalid محمد بن عثمان بن خالد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20387",
      "name": "'Ali bin Hujr bin Iyas bin Maqatil علي بن حجر بن إياس بن مقاتل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30556",
      "name": "'Ali bin Khashram علي بن خشرم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30100",
      "name": "Ahmed bin Abi Bakr أبو مصعب أحمد بن أبي بكر",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "448",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا قتيبة، قال حدثنا عبد العزيز، عن أبي حازم، عن سهل، قال بعث رسول الله صلى الله عليه وسلم إلى امرأة أن مري غلامك النجار يعمل لي أعوادا أجلس عليهن‏.‏",
      "text_en": " Narrated Sahl:                     Allah's Apostle sent someone to a woman telling her to \"Order her slave, carpenter, to prepare a wooden pulpit for him to sit on.\"",
      "chain": [
        "30367",
        "20167",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "528",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا إبراهيم بن حمزة، قال حدثني ابن أبي حازم، والدراوردي، عن يزيد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ أرأيتم لو أن نهرا بباب أحدكم، يغتسل فيه كل يوم خمسا، ما تقول ذلك يبقي من درنه ‏\"‏‏.‏ قالوا لا يبقي من درنه شيئا‏.‏ قال ‏\"‏ فذلك مثل الصلوات الخمس، يمحو الله بها الخطايا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard Allah's Apostle saying, \"If there was a river at the door of anyone of you and he took a bath in it five times a day would you notice any dirt on him?\" They said, \"Not a trace of dirt would be left.\" The Prophet added, \"That is the example of the five prayers with which Allah blots out (annuls) evil deeds.\"",
      "chain": [
        "30101",
        "20165",
        "20167",
        "20304",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1218",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا قتيبة، حدثنا عبد العزيز، عن أبي حازم، عن سهل بن سعد  رضى الله عنه  قال بلغ رسول الله صلى الله عليه وسلم أن بني عمرو بن عوف بقباء كان بينهم شىء، فخرج يصلح بينهم في أناس من أصحابه، فحبس رسول الله صلى الله عليه وسلم وحانت الصلاة، فجاء بلال إلى أبي بكر  رضى الله عنهما  فقال يا أبا بكر، إن رسول الله صلى الله عليه وسلم قد حبس وقد حانت الصلاة، فهل لك أن تؤم الناس قال نعم إن شئت‏.‏ فأقام بلال الصلاة، وتقدم أبو بكر  رضى الله عنه  فكبر للناس، وجاء رسول الله صلى الله عليه وسلم يمشي في الصفوف يشقها شقا، حتى قام في الصف، فأخذ الناس في التصفيح‏.‏ قال سهل التصفيح هو التصفيق‏.‏ قال وكان أبو بكر  رضى الله عنه  لا يلتفت في صلاته، فلما أكثر الناس التفت فإذا رسول الله صلى الله عليه وسلم فأشار إليه، يأمره أن يصلي، فرفع أبو بكر  رضى الله عنه  يده، فحمد الله، ثم رجع القهقرى وراءه حتى قام في الصف، وتقدم رسول الله صلى الله عليه وسلم فصلى للناس، فلما فرغ أقبل على الناس فقال ‏\"‏ يا أيها الناس ما لكم حين نابكم شىء في الصلاة أخذتم بالتصفيح إنما التصفيح للنساء، من نابه شىء في صلاته فليقل سبحان الله ‏\"‏‏.‏ ثم التفت إلى أبي بكر  رضى الله عنه  فقال ‏\"‏ يا أبا بكر، ما منعك أن تصلي للناس حين أشرت إليك ‏\"‏‏.‏ قال أبو بكر ما كان ينبغي لابن أبي قحافة أن يصلي بين يدى رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     The news about the differences amongst the people of Bani `Amr bin `Auf at Quba reached Allah's Apostle and so he went to them along with some of his companions to affect a reconciliation. Allah's Apostle was delayed there and the time for the prayer became due. Bilal came to Abu Bakr! and said, \"O Abu Bakr! Allah's Apostle is detained (there) and the time for the prayer is due. Will you lead the people in prayer?\" Abu Bakr replied, \"Yes, if you wish.\" So Bilal pronounced the Iqama and Abu Bakr went forward and the people said Takbir. In the meantime, Allah's Apostle came piercing through the rows till he stood in the (first) row and the people started clapping. Abu Bakr, would never look hither and thither during the prayer but when the people clapped much he looked back and saw Allah's Apostle. The Prophet beckoned him to carry on. Abu Bakr raised both his hands, praised Allah and retreated till he stood in the row and Allah's Apostle went forward and led the people in the prayer. When he had finished the prayer, he addressed the people and said, \"O people! Why did you start clapping when something happened to you in the prayer? Clapping is for women. Whenever one is confronted with something unusual in the prayer one should say, 'Sub Han Allah'.\" Then the Prophet looked towards Abu Bakr and asked, \"What prevented you from leading the prayer when I beckoned you to carry on?\" Abu Bakr replied, \"It does not befit the son of Al Quhafa to lead the prayer in the presence of Allah's Apostle.",
      "chain": [
        "30367",
        "20167",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "2018",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Night of Qadr - كتاب فضل ليلة القدر",
      "chapter_no": "32",
      "text_ar": "حدثنا إبراهيم بن حمزة، قال حدثني ابن أبي حازم، والدراوردي، عن يزيد، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي سعيد الخدري  رضى الله عنه ‏.‏ كان رسول الله صلى الله عليه وسلم يجاور في رمضان العشر التي في وسط الشهر، فإذا كان حين يمسي من عشرين ليلة تمضي، ويستقبل إحدى وعشرين، رجع إلى مسكنه ورجع من كان يجاور معه‏.‏ وأنه أقام في شهر جاور فيه الليلة التي كان يرجع فيها، فخطب الناس، فأمرهم ما شاء الله، ثم قال ‏\"‏ كنت أجاور هذه العشر، ثم قد بدا لي أن أجاور هذه العشر الأواخر، فمن كان اعتكف معي فليثبت في معتكفه، وقد أريت هذه الليلة ثم أنسيتها فابتغوها في العشر الأواخر وابتغوها في كل وتر، وقد رأيتني أسجد في ماء وطين ‏\"‏‏.‏ فاستهلت السماء في تلك الليلة، فأمطرت، فوكف المسجد في مصلى النبي صلى الله عليه وسلم ليلة إحدى وعشرين، فبصرت عيني رسول الله صلى الله عليه وسلم ونظرت إليه انصرف من الصبح، ووجهه ممتلئ طينا وماء‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle used to practice I`tikaf (in the mosque) in the middle third of Ramadan and after passing the twenty nights he used to go back to his house on the 21st, and the people who were in I`tikaf with him also used to go back to their houses. Once in Ramadan, in which he practiced I`tikaf, he established the night prayers at the night in which he used to return home, and then he addressed the people and ordered them whatever Allah wished him to order and said, \"I used to practice I`tikaf for these ten days (i.e. the middle third but now I intend to stay in I`tikaf for the last ten days (of the month); so whoever was in I`tikaf with me should stay at his place of seclusion. I have verily been shown (the date of) this Night (of Qadr) but I have forgotten it. So search for it in the odd nights of the last ten days (of this month). I also saw myself (in the dream) prostrating in mud and water.\" On the night of the 21st, the sky was covered with clouds and it rained, and the rainwater started leaking through the roof of the mosque at the praying place of the Prophet . I saw with my own eyes the Prophet at the completion of the morning prayer leaving with his face covered with mud and water.",
      "chain": [
        "30101",
        "20165",
        "20167",
        "20304",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "2094",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، عن أبي حازم، قال أتى رجال إلى سهل بن سعد يسألونه عن المنبر، فقال بعث رسول الله صلى الله عليه وسلم إلى فلانة  امرأة قد سماها سهل  ‏\"‏ أن مري غلامك النجار، يعمل لي أعوادا أجلس عليهن إذا كلمت الناس ‏\"‏‏.‏ فأمرته يعملها من طرفاء الغابة ثم جاء بها، فأرسلت إلى رسول الله صلى الله عليه وسلم بها، فأمر بها فوضعت، فجلس عليه‏.‏",
      "text_en": " Narrated Abu Hazim:                     Some men came to Sahl bin Sa`d to ask him about the pulpit. He replied, \"Allah's Apostle sent for a woman (Sahl named her) (this message): 'Order your slave carpenter to make pieces of wood (i.e. a pulpit) for me so that I may sit on it while addressing the people.' So, she ordered him to make it from the tamarisk of the forest. He brought it to her and she sent it to Allah's Apostle . Allah's Apostle ordered it to be placed in the mosque: so, it was put and he sat on it.",
      "chain": [
        "30367",
        "20167",
        "11172"
      ]
    },
    {
      "hadith_no": "2366",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا قتيبة، حدثنا عبد العزيز، عن أبي حازم، عن سهل بن سعد  رضى الله عنه  قال أتي رسول الله صلى الله عليه وسلم بقدح فشرب وعن يمينه غلام، هو أحدث القوم، والأشياخ عن يساره قال ‏\"‏ يا غلام أتأذن لي أن أعطي الأشياخ ‏\"‏‏.‏ فقال ما كنت لأوثر بنصيبي منك أحدا يا رسول الله‏.‏ فأعطاه إياه‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     Once a tumbler (full of milk or water) was brought to Allah's Apostle who drank from it, while on his right side there was sitting a boy who was the youngest of those who were present, and on his left side there were old men. The Prophet asked, \"O boy ! Do you allow me to give (the drink) to the elder people (first)?\" The boy said, \"I will not prefer anybody to have my share from you, O Allah's Apostle!\" So, he gave it to the boy.",
      "chain": [
        "30367",
        "20167",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "3748",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، عن أبي حازم، عن سهل بن سعد  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لأعطين الراية غدا رجلا يفتح الله على يديه ‏\"‏ قال فبات الناس يدوكون ليلتهم أيهم يعطاها فلما أصبح الناس، غدوا على رسول الله صلى الله عليه وسلم كلهم يرجو أن يعطاها فقال ‏\"‏ أين علي بن أبي طالب ‏\"‏‏.‏ فقالوا يشتكي عينيه يا رسول الله‏.‏ قال ‏\"‏ فأرسلوا إليه فأتوني به ‏\"‏‏.‏ فلما جاء بصق في عينيه، ودعا له، فبرأ حتى كأن لم يكن به وجع، فأعطاه الراية‏.‏ فقال علي يا رسول الله أقاتلهم حتى يكونوا مثلنا فقال ‏\"‏ انفذ على رسلك حتى تنزل بساحتهم، ثم ادعهم إلى الإسلام، وأخبرهم بما يجب عليهم من حق الله فيه، فوالله لأن يهدي الله بك رجلا واحدا خير لك من أن يكون لك حمر النعم ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     Allah's Apostle said, \"Tomorrow I will give the flag to a man with whose leadership Allah will grant (the Muslim) victory.\" So the people kept on thinking the whole night as to who would be given the flag. The next morning the people went to Allah's Apostle and every one of them hoped that he would be given the flag. The Prophet said, \"Where is `Ali bin Abi Talib?\" The people replied, \"He is suffering from eye trouble, O Allah's Apostle.\" He said, \"Send for him and bring him to me.\" So when `Ali came, the Prophet spat in his eyes and invoked good on him, and be became alright as if he had no ailment. The Prophet then gave him the flag. `Ali said, \"O Allah's Apostle! Shall I fight them (i.e. enemy) till they become like us?\" The Prophet said, \"Proceed to them steadily till you approach near to them and then invite them to Islam and inform them of their duties towards Allah which Islam prescribes for them, for by Allah, if one man is guided on the right path (i.e. converted to Islam) through you, it would be better for you than (a great number of) red camels.\"",
      "chain": [
        "30367",
        "20167",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "3982",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا عبد العزيز، عن أبيه، عن سهل بن سعد، قال ما عدوا من مبعث النبي صلى الله عليه وسلم ولا من وفاته، ما عدوا إلا من مقدمه المدينة‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     The Prophet's companions did not take as a starting date for the Muslim calendar, the day, the Prophet had been sent as an Apostle or the day of his death, but the day of his arrival at Medina.",
      "chain": [
        "20164",
        "20167",
        "399"
      ]
    },
    {
      "hadith_no": "4148",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني قتيبة، حدثنا عبد العزيز، عن أبي حازم، عن سهل بن سعد  رضى الله عنه  قال كنا مع رسول الله صلى الله عليه وسلم في الخندق، وهم يحفرون، ونحن ننقل التراب على أكتادنا، فقال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم لا عيش إلا عيش الآخره، فاغفر للمهاجرين والأنصار ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     We were with Allah's Apostle in the Trench, and some were digging the trench while we were carrying the earth on our shoulders. Allah's Apostle said, 'O Allah! There is no life except the life of the Hereafter, so please forgive the Emigrants and the Ansar.\"",
      "chain": [
        "30367",
        "20167",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "4291",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "وقال عبد العزيز بن محمد عن عبد المجيد، عن سعيد، أن أبا سعيد، وأبا، هريرة حدثاه أن النبي صلى الله عليه وسلم بعث أخا بني عدي من الأنصار إلى خيبر فأمره عليها‏.‏",
      "text_en": "",
      "chain": [
        "20167",
        "11168",
        "38",
        "13"
      ]
    },
    {
      "hadith_no": "4846",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إبراهيم بن حمزة، حدثنا ابن أبي حازم، والدراوردي، عن يزيد، وقال، ‏\"‏ كما صليت على إبراهيم، وبارك على محمد وآل محمد كما باركت على إبراهيم وآل إبراهيم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Abi Hazim and Ad-Darawardi:                     Yazid said, \"Kama sallaita ala Ibrahima wa barik 'ala Muhammad in wa all Muhammadin kama barakta 'ala Abrahima wa all Ibrahim.\"",
      "chain": [
        "30101",
        "20165",
        "20167",
        "20304"
      ]
    },
    {
      "hadith_no": "4947",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا عبد العزيز، أخبرني ثور، عن أبي الغيث، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏\"‏ لناله رجال من هؤلاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said. Then some men from these people would attain it.\"",
      "chain": [
        "30143",
        "20167",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "6432",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا إبراهيم بن حمزة، حدثنا ابن أبي حازم، والدراوردي، عن يزيد، عن عبد الله بن خباب، عن أبي سعيد الخدري، قال قلنا يا رسول الله هذا السلام عليك، فكيف نصلي قال ‏\"‏ قولوا اللهم صل على محمد عبدك ورسولك، كما صليت على إبراهيم، وبارك على محمد وعلى آل محمد، كما باركت على إبراهيم وآل إبراهيم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     We said, \"O Allah's Apostle This is (i.e. we know) the greeting to you; will you tell us how to send Salat on you?\" He said, \"Say: 'Allahumma Salli 'ala Muhammadin `Abdika wa rasulika kama sal-laita 'ala Ibrahima wa barik 'ala Muhammadin wa all Muhammadin kama barakta 'ala Ibrahima wa `Ali Ibrahim.\"",
      "chain": [
        "30101",
        "20165",
        "20167",
        "20304",
        "11182",
        "38"
      ]
    },
    {
      "hadith_no": "6634",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا قتيبة، حدثنا عبد العزيز، عن أبي حازم، عن سهل بن سعد، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليدخلن الجنة من أمتي سبعون أو سبعمائة ألف  لا يدري أبو حازم أيهما قال  متماسكون، آخذ بعضهم بعضا، لا يدخل أولهم حتى يدخل آخرهم، وجوههم على صورة القمر ليلة البدر ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     Allah's Apostle said, \"Seventy thousand or seven hundred thousand of my followers will enter Paradise. (Abu Hazim, the sub-narrator, is not sure as to which of the two numbers is correct.) They will be holding on to each other, the first will not entering the last one does, their faces like the moon on a full moon night.\"",
      "chain": [
        "30367",
        "20167",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "6635",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا عبد العزيز، عن أبيه، عن سهل، عن النبي صلى الله عليه وسلم قال ‏\"‏إن أهل الجنة ليتراءون الغرف في الجنة كما تتراءون الكوكب في السماء‏\"‏‏.‏",
      "text_en": " Narrated Sahl:                     The Prophet said, \"The people of Paradise will see the Ghuraf (special abodes) in Paradise as you see a star in the sky.\" Abu Sa`id added: \"As you see a glittering star remaining in the eastern horizon and the western horizon.\"",
      "chain": [
        "20164",
        "20167",
        "399"
      ]
    },
    {
      "hadith_no": "6644",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا إبراهيم بن حمزة، حدثنا ابن أبي حازم، والدراوردي، عن يزيد، عن عبد الله بن خباب، عن أبي سعيد الخدري  رضى الله عنه  أنه سمع رسول الله صلى الله عليه وسلم وذكر عنده عمه أبو طالب فقال ‏\"‏ لعله تنفعه شفاعتي يوم القيامة فيجعل في ضحضاح من النار، يبلغ كعبيه، يغلي منه أم دماغه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     I heard Allah's Apostles when his uncle, Abu Talib had been mentioned in his presence, saying, \"May be my intercession will help him (Abu Talib) on the Day of Resurrection so that he may be put in a shallow place in the Fire, with fire reaching his ankles and causing his brain to boil.\"",
      "chain": [
        "30101",
        "20165",
        "20167",
        "20304",
        "11182",
        "38"
      ]
    },
    {
      "hadith_no": "6760",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا عبد العزيز، حدثنا إبراهيم، عن صالح، عن ابن شهاب، ح وحدثنا الحجاج، حدثنا عبد الله بن عمر النميري، حدثنا يونس بن يزيد الأيلي، قال سمعت الزهري، قال سمعت عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله بن عتبة، عن حديث، عائشة زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا، فبرأها الله مما قالوا  كل حدثني طائفة من الحديث  فأنزل الله ‏{‏إن الذين جاءوا بالإفك‏}‏ العشر الآيات كلها في براءتي‏.‏ فقال أبو بكر الصديق  وكان ينفق على مسطح لقرابته منه  والله لا أنفق على مسطح شيئا أبدا، بعد الذي قال لعائشة‏.‏ فأنزل الله ‏{‏ولا يأتل أولو الفضل منكم والسعة أن يؤتوا أولي القربى‏}‏ الآية‏.‏ قال أبو بكر بلى والله إني لأحب أن يغفر الله لي‏.‏ فرجع إلى مسطح النفقة التي كان ينفق عليه وقال والله لا أنزعها عنه أبدا‏.‏",
      "text_en": " Narrated Az-Zuhri:                     I heard `Urwa bin Az-Zubair, Sa`id bin Al-Musaiyab, 'Alqama bin Waqqas and 'Ubaidullah bin `Abdullah bin `Uqba relating from `Aisha, the wife of the Prophet the narration of the people (i.e. the liars) who spread the slander against her and they said what they said, and how Allah revealed her innocence. Each of them related to me a portion of that narration. (They said that `Aisha said), ''Then Allah revealed the ten Verses starting with:--'Verily! Those who spread the slander..' (24.11-21) All these verses were in proof of my innocence. Abu Bakr As-Siddiq who used to provide for Mistah some financial aid because of his relation to him, said, \"By Allah, I will never give anything (in charity) to Mistah, after what he has said about `Aisha\" Then Allah revealed:-- 'And let not those among you who are good and are wealthy swear not to give (any sort of help) to their kins men....' (24.22) On that, Abu Bakr said, \"Yes, by Allah, I like that Allah should forgive me.\" and then resumed giving Mistah the aid he used to give him and said, \"By Allah! I will never withhold it from him.\"",
      "chain": [
        "20167",
        "20150",
        "11176",
        "11013",
        "20381",
        "20434",
        "20475",
        "11013",
        "10511",
        "11002",
        "11042",
        "11004"
      ]
    },
    {
      "hadith_no": "6919",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا عبد العزيز، أخبرنا ابن شهاب، عن عبيد الله بن عبد الله بن عتبة، عن زيد بن خالد الجهني، قال سمعت النبي صلى الله عليه وسلم يأمر فيمن زنى ولم يحصن جلد مائة وتغريب عام‏.‏   قال ابن شهاب وأخبرني عروة بن الزبير، أن عمر بن الخطاب، غرب، ثم لم تزل تلك السنة‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     I heard the Prophet ordering that an unmarried person guilty of illegal sexual intercourse be flogged one-hundred stripes and be exiled for one year. `Umar bin Al-Khattab also exiled such a person, and this tradition is still valid.",
      "chain": [
        "20357",
        "20167",
        "11013",
        "11004",
        "3625"
      ]
    },
    {
      "hadith_no": "7075",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثني إبراهيم بن حمزة، حدثني ابن أبي حازم، والدراوردي، عن يزيد، عن عبد الله بن خباب، عن أبي سعيد الخدري، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ الرؤيا الصالحة جزء من ستة وأربعين جزءا من النبوة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     I heard Allah's Apostle saying, \"A good dream is a part of the forty six parts of prophetism.\"",
      "chain": [
        "30101",
        "20165",
        "20167",
        "20304",
        "11182",
        "38"
      ]
    },
    {
      "hadith_no": "7132",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا إبراهيم بن حمزة، حدثني ابن أبي حازم، والدراوردي، عن يزيد، عن عبد الله بن خباب، عن أبي سعيد الخدري، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا رأى أحدكم الرؤيا يحبها، فإنها من الله، فليحمد الله عليها، وليحدث بها، وإذا رأى غير ذلك مما يكره، فإنما هي من الشيطان، فليستعذ من شرها، ولا يذكرها لأحد، فإنها لن تضره ‏\"‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     I heard Allah's Apostle saying, \"If anyone of you saw a dream which he liked, then that was from Allah, and he should thank Allah for it and tell it to others; but if he saw something else, i.e, a dream which he did not like, then that is from Satan and he should seek refuge with Allah from it and should not tell it to anybody for it will not harm him.\"",
      "chain": [
        "30101",
        "20165",
        "20167",
        "20304",
        "11182",
        "38"
      ]
    },
    {
      "hadith_no": "135",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، أخبرنا عبد العزيز، - يعني الدراوردي - عن العلاء، ح وحدثنا أمية بن بسطام، - واللفظ له - حدثنا يزيد بن زريع، حدثنا روح، عن العلاء بن عبد الرحمن بن يعقوب، عن أبيه، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله ويؤمنوا بي وبما جئت به فإذا فعلوا ذلك عصموا مني دماءهم وأموالهم إلا بحقها وحسابهم على الله ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Abu Huraira that he heard the Messenger of Allah say:                      I have been commanded to fight against people, till they testify to the fact that there is no god but Allah, and believe in me (that) I am the messenger (from the Lord) and in all that I have brought. And when they do it, their blood and riches are guaranteed protection on my behalf except where it is justified by law, and their affairs rest with Allah.",
      "chain": [
        "30423",
        "20167",
        "10606",
        "30124",
        "20304",
        "20229",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "160",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن يحيى بن أبي عمر المكي، وبشر بن الحكم، قالا حدثنا عبد العزيز، - وهو ابن محمد - الدراوردي عن يزيد بن الهاد، عن محمد بن إبراهيم، عن عامر بن سعد، عن العباس بن عبد المطلب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ذاق طعم الإيمان من رضي بالله ربا وبالإسلام دينا وبمحمد رسولا ‏\"‏ ‏‏",
      "text_en": " It is narrated on the authority of 'Abbas b. 'Abdul-Muttalib that he heard the Messenger of Allah saying:                      He relished the flavor of faith (Iman) who became the book of faith pleased with Allah as Lord, with al-Islam as the code of life and with Muhammad as the Messenger (of Allah).",
      "chain": [
        "11222",
        "30316",
        "20167",
        "11234",
        "11213",
        "10554",
        "100"
      ]
    },
    {
      "hadith_no": "189",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنيه أبو بكر بن إسحاق بن محمد، أخبرنا ابن أبي مريم، حدثنا عبد العزيز بن محمد، قال أخبرني الحارث بن الفضيل الخطمي، عن جعفر بن عبد الله بن الحكم، عن عبد الرحمن بن المسور بن مخرمة، عن أبي رافع، مولى النبي صلى الله عليه وسلم عن عبد الله بن مسعود أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما كان من نبي إلا وقد كان له حواريون يهتدون بهديه ويستنون بسنته ‏\"‏ ‏.‏ مثل حديث صالح ولم يذكر قدوم ابن مسعود واجتماع ابن عمر معه ‏.‏",
      "text_en": " The same hadith has been transmitted by another chain of narrators on the authority of 'Abdullah b. Mas'ud who observed:                      Never was there one among the prophets who had had not disciples who followed his direction and followed his ways. The remaining part of the hadith is like that as narrated by Salih but the arrival of Ibn Mas'ud and the meeting of Ibn 'Umar with him is not mentioned.",
      "chain": [
        "30232",
        "20167",
        "11833"
      ]
    },
    {
      "hadith_no": "216",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني الدراوردي - عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم كل هؤلاء بمثل حديث الزهري غير أن العلاء وصفوان بن سليم ليس في حديثهما ‏\"‏ يرفع الناس إليه فيها أبصارهم ‏\"‏ ‏.‏ وفي حديث همام ‏\"‏ يرفع إليه المؤمنون أعينهم فيها وهو حين ينتهبها مؤمن ‏\"‏ ‏.‏ وزاد ‏\"‏ ولا يغل أحدكم حين يغل وهو مؤمن فإياكم إياكم ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Qutaiba b. Sa'id who reported on the authority of Abu Huraira the hadith like that narrated from Zuhri with this exception that in the hadith narrated by 'Ala ' and Safwan b. Sulaim there is no mention of:                      People raise there eyes towards him, and in the hadith narrated by Hammam: The believers raise their eyes towards him, and such like words, so long as he plunders (is not) a believer, and these words were added: And no exploiter who makes an exploitation is a believer as long as he exploits It; therefore avoid and shun (these evils).",
      "chain": [
        "30367",
        "20167",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "325",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا قتيبة بن سعيد، - وهذا حديثه - حدثنا عبد العزيز، - يعني ابن محمد - عن ثور، عن أبي الغيث، عن أبي هريرة، قال خرجنا مع النبي صلى الله عليه وسلم إلى خيبر ففتح الله علينا فلم نغنم ذهبا ولا ورقا غنمنا المتاع والطعام والثياب ثم انطلقنا إلى الوادي ومع رسول الله صلى الله عليه وسلم عبد له وهبه له رجل من جذام يدعى رفاعة بن زيد من بني الضبيب فلما نزلنا الوادي قام عبد رسول الله صلى الله عليه وسلم يحل رحله فرمي بسهم فكان فيه حتفه فقلنا هنيئا له الشهادة يا رسول الله ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ كلا والذي نفس محمد بيده إن الشملة لتلتهب عليه نارا أخذها من الغنائم يوم خيبر لم تصبها المقاسم ‏\"‏ ‏.‏ قال ففزع الناس ‏.‏ فجاء رجل بشراك أو شراكين ‏.‏ فقال يا رسول الله أصبت يوم خيبر ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ شراك من نار أو شراكان من نار ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira:                      We went to Khaibar along with the Apostle (may peace be upon him) and Allah granted us victory. We plundered neither gold nor silver but laid our hands on goods, corn and clothes, and then bent our stops to a valley; along with the Messenger of Allah (may peace be upon him) there was a slave who was presented to him by one Rifa'a b. Zaid of the family of Judham, a tribe of Dubayb. When we got down into the valley the slave of the Messenger of Allah stood up and began to unpack the saddle-bag and was suddenly struck by a (stray) arrow which proved fatal. We said: There is a greeting for him, Messenger of Allah, as he is a martyr. Upon this the Messenger of Allah (may peace be upon him) remarked: Nay, not so. By Him in Whose hand is the life of Muhammad, the small garment which he stole from the booty on the day of Khaibar but which did not (legitimately) fall to his lot is burning like the Fire (of Hell) on him. The people were greatly perturbed (on hearing this). A person came there with a lace or two laces and said: Messenger of Allah, I found (them) on the day of Khaibar. He (the Holy Prophet) remarked: This is a lace of fire or two laces of fire.",
      "chain": [
        "30367",
        "20167",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "327",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا عبد العزيز بن محمد، وأبو علقمة الفروي قالا حدثنا صفوان بن سليم، عن عبد الله بن سلمان، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله يبعث ريحا من اليمن ألين من الحرير فلا تدع أحدا في قلبه - قال أبو علقمة مثقال حبة وقال عبد العزيز مثقال ذرة - من إيمان إلا قبضته ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      Verily Allah would make a wind to blow from the side of the Yemen more delicate than silk and would spare none but cause him to die who, in the words of Abu 'Alqama, has faith equal to the weight of a grain; while Abdul-'Aziz said: having faith equal to the weight of a dust particle.",
      "chain": [
        "30423",
        "20167",
        "11177",
        "13"
      ]
    },
    {
      "hadith_no": "229",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا قتيبة بن سعيد، وأحمد بن عبدة الضبي، قالا حدثنا عبد العزيز، - وهو الدراوردي - عن زيد بن أسلم، عن حمران، مولى عثمان قال أتيت عثمان بن عفان بوضوء فتوضأ ثم قال إن ناسا يتحدثون عن رسول الله صلى الله عليه وسلم أحاديث لا أدري ما هي إلا أني رأيت رسول الله صلى الله عليه وسلم توضأ مثل وضوئي هذا ثم قال ‏\"‏ من توضأ هكذا غفر له ما تقدم من ذنبه وكانت صلاته ومشيه إلى المسجد نافلة ‏\"‏ ‏.‏ وفي رواية ابن عبدة أتيت عثمان فتوضأ ‏.‏",
      "text_en": " Humran, the freed slave of 'Uthman reported:                      I brought for Uthman b. 'Affan the ablution water. He performed ablution and then said: Verily the people narrate from the Messenger of Allah (may peace be upon him) a hadith. I do not know what these are. but (I know this fact) that I saw the Messenger of Allah (may peace be upon him) perform ablution like this ablution of mine and then he said: He who performed ablution like this, all his previous sins would be expiated and his prayer and going towards the mosque would have an extra reward. In the tradition narrated by Ibn 'Abda (the words are):\" I came to Uthman and he performed ablution.\"",
      "chain": [
        "30367",
        "30423",
        "20167",
        "11163",
        "11421",
        "4"
      ]
    },
    {
      "hadith_no": "238",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثني بشر بن الحكم العبدي، حدثنا عبد العزيز، - يعني الدراوردي - عن ابن الهاد، عن محمد بن إبراهيم، عن عيسى بن طلحة، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا استيقظ أحدكم من منامه فليستنثر ثلاث مرات فإن الشيطان يبيت على خياشيمه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Apostle of Allah (may peace be upon him) said. When any one of you awakes up from sleep and performs ablution, he must clean his nose three times, for the devil spends the night in the interior of his nose.",
      "chain": [
        "30316",
        "20167",
        "11234",
        "11213",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "249",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني الدراوردي ح وحدثني إسحاق بن موسى الأنصاري، حدثنا معن، حدثنا مالك، جميعا عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم خرج إلى المقبرة فقال ‏\"‏ السلام عليكم دار قوم مؤمنين وإنا إن شاء الله بكم لاحقون ‏\"‏ ‏.‏ بمثل حديث إسماعيل بن جعفر غير أن حديث مالك ‏\"‏ فليذادن رجال عن حوضي ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace The upon him) went out to the graveyard and said: Peace be upon you, the abode of the believing people. and If Allah so wills we shall join you.... (and so on and so forth) like the hadith narrated by Isma'il b. Ja'far except the words of Malik: Then some persons would be driven away from my Cistern.",
      "chain": [
        "30367",
        "20167",
        "30410",
        "30112",
        "20001",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "284",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا يحيى بن سعيد القطان، عن يحيى بن سعيد الأنصاري، ح وحدثنا يحيى بن يحيى، وقتيبة بن سعيد، جميعا عن الدراوردي، - قال يحيى بن يحيى أخبرنا عبد العزيز بن محمد المدني، - عن يحيى بن سعيد، أنه سمع أنس بن مالك، يذكر أن أعرابيا، قام إلى ناحية في المسجد فبال فيها فصاح به الناس فقال رسول الله صلى الله عليه وسلم ‏\"‏ دعوه ‏\"‏ ‏.‏ فلما فرغ أمر رسول الله صلى الله عليه وسلم بذنوب فصب على بوله ‏.‏",
      "text_en": " Anas b. Malik narrated that a desert Arab (Bedouin) stood in a corner of the mosque and urinated there. The people (the Companions of the Holy Prophet who were present there) shouted, but the Messenger of Allah (may peace be upon him) said:                      Leave him alone. When he had finished, the Messenger of Allah (may peace be upon him) ordered that a bucket (of water) should be brought and poured over it.",
      "chain": [
        "30170",
        "20031",
        "11062",
        "30399",
        "30367",
        "20167",
        "30399",
        "20031",
        "19"
      ]
    },
    {
      "hadith_no": "333",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا عبد العزيز بن محمد، وأبو معاوية ح وحدثنا قتيبة بن سعيد، حدثنا جرير، ح وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا خلف بن هشام، حدثنا حماد بن زيد، كلهم عن هشام بن عروة، بمثل حديث وكيع وإسناده ‏.‏ وفي حديث قتيبة عن جرير جاءت فاطمة بنت أبي حبيش بن عبد المطلب بن أسد وهي امرأة منا ‏.‏ قال وفي حديث حماد بن زيد زيادة حرف تركنا ذكره ‏.‏",
      "text_en": " The hadith narrated by Waki' and with its chain of narrators has been transmitted on the authority of Hisham b. 'Urwa, but in the hadith narrated by Qutaiba on the authority of Jarir, the words are:                     \" There came Fatimah b. Abu Hubaish, b. 'Abd al-Muttalib b. Asad, and she was a woman amongst us,\" and in the hadith of Hammid b. Zaid there is an addition of these words:\" We abandoned mentioning him.\"",
      "chain": [
        "30399",
        "20167",
        "20354",
        "30367",
        "20028",
        "30212",
        "20331",
        "30503",
        "20022",
        "11065"
      ]
    },
    {
      "hadith_no": "366",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، قالا حدثنا ابن عيينة، ح وحدثنا قتيبة بن سعيد، حدثنا عبد العزيز يعني ابن محمد، ح وحدثنا أبو كريب، وإسحاق بن إبراهيم، جميعا عن وكيع، عن سفيان، كلهم عن زيد بن أسلم، عن عبد الرحمن بن وعلة، عن ابن عباس، عن النبي صلى الله عليه وسلم بمثله يعني حديث يحيى بن يحيى ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Ibn 'Abbas by another chain of transmitters.",
      "chain": [
        "30201",
        "30263",
        "20005",
        "30367",
        "20167",
        "30216",
        "30123",
        "20032",
        "11163",
        "17"
      ]
    },
    {
      "hadith_no": "415",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا قتيبة، حدثنا عبد العزيز، - يعني الدراوردي - عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم بنحوه إلا قوله ‏\"‏ ولا الضالين ‏.‏ فقولوا آمين ‏\"‏ ‏.‏ وزاد ‏\"‏ ولا ترفعوا قبله ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported from the Apostle of Allah (may peace be upon him) (a hadith) like it, except the words:                     \" Nor of those who err, say Amin\" and added:\" And don't rise up ahead of him.\"",
      "chain": [
        "30367",
        "20167",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "440",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا قتيبة بن سعيد، قال حدثنا عبد العزيز، - يعني الدراوردي - عن سهيل، بهذا الإسناد ‏.‏",
      "text_en": " This hadith is narrated by Suhail with the same chain of transmitters.",
      "chain": [
        "30367",
        "20167"
      ]
    },
    {
      "hadith_no": "1244",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن يحيى، وقتيبة بن سعيد، كلاهما عن عبد العزيز، قال يحيى أخبرنا عبد العزيز بن أبي حازم، عن أبيه، أن نفرا، جاءوا إلى سهل بن سعد قد تماروا في المنبر من أى عود هو فقال أما والله إني لأعرف من أى عود هو ومن عمله ورأيت رسول الله صلى الله عليه وسلم أول يوم جلس عليه - قال - فقلت له يا أبا عباس فحدثنا ‏.‏ قال أرسل رسول الله صلى الله عليه وسلم إلى امرأة قال أبو حازم إنه ليسميها يومئذ ‏\"‏ انظري غلامك النجار يعمل لي أعوادا أكلم الناس عليها ‏\"‏ ‏.‏ فعمل هذه الثلاث درجات ثم أمر بها رسول الله صلى الله عليه وسلم فوضعت هذا الموضع فهى من طرفاء الغابة ‏.‏ ولقد رأيت رسول الله صلى الله عليه وسلم قام عليه فكبر وكبر الناس وراءه وهو على المنبر ثم رفع فنزل القهقرى حتى سجد في أصل المنبر ثم عاد حتى فرغ من آخر صلاته ثم أقبل على الناس فقال ‏\"‏ يا أيها الناس إني صنعت هذا لتأتموا بي ولتعلموا صلاتي ‏\"‏ ‏.‏",
      "text_en": " Abu Hazim is reported on the authority of his father:                      Some people came to Sahl b. Sa'd and began to differ about the wood of which the (Prophet's pulpit was made. He (Sahl b. Sa'd) said: By Allah, I know of which wood it is made and who made it, and the day when I saw the Messenger of Allah (may peace be upon him) seated himself on it on the first day. I said to him: O Abu Abbas (kunyah of Sabl b. Sa'd), narrate to us (all these facts), He said: The Messenger of Allah (may peace be upon him) sent a person to a woman asking her to allow her slave, a carpenter, to work on woods (to prepare a pulpit) so that I should talk to the people (sitting on it). Abu Hazim said: He (Sahl b. Sa'd) pointed out the name of (that lady) that day. So he (the carpenter) made (a pulpit) with these three steps. Then the Messengerof Allah (may peace be upon him) commanded it to be placed here (where it is lying now). It was fashioned out of the wood of al-Ghaba. And I saw the Messenger of Allah (may peace he upon him) standing upon it and glorifying Allah and the people also glorified Allah after him, while he was on the pulpit. He then raised (his head from prostration) and stepped back (on his heels) till he prostrated himself at the base of pulpit, and then returned (to the former place and this movement of one or two steps continued) till the prayer was complete. He then turned towards the people and said: O people, I have done it so that you should follow me and learn (my mode of) prayer.",
      "chain": [
        "30399",
        "30367",
        "20167",
        "20031",
        "20165",
        "11172"
      ]
    },
    {
      "hadith_no": "1429",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا عبد العزيز، عن العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن هذا الحر من فيح جهنم فأبردوا بالصلاة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that the Messenger of Allah (may peace be upon him) said:                      This heat is from the exhalation of Hell-fire, so delay the prayer till it is cool.",
      "chain": [
        "30367",
        "20167",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "1883",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني بشر بن الحكم، حدثنا عبد العزيز بن محمد، حدثنا يزيد، - وهو ابن الهاد - عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما أذن الله لشىء ما أذن لنبي حسن الصوت يتغنى بالقرآن يجهر به ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated with the same chain of transmitters by Ibn al-Had except this that Abu Huraira reported Allah's Messenger (may peace be upon him) as saying and he did not say:                     \" He heard it.\"",
      "chain": [
        "30316",
        "20167",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2064",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا قتيبة بن سعيد، وأبو بكر بن أبي شيبة قالا حدثنا حاتم بن إسماعيل، ح وحدثنا قتيبة، حدثنا عبد العزيز، - يعني الدراوردي - كلاهما عن جعفر، عن أبيه، عن عبيد الله بن أبي رافع، قال استخلف مروان أبا هريرة ‏.‏ بمثله غير أن في، رواية حاتم فقرأ بسورة الجمعة في السجدة الأولى وفي الآخرة ‏{‏ إذا جاءك المنافقون‏}‏ ورواية عبد العزيز مثل حديث سليمان بن بلال ‏.‏",
      "text_en": " This hadith is narrated by Abdullah b. Abu Rafi' with the same chain of transmitters but with this modification:                     \" That he recited Surah Jumu'a (lxii.) in the first rak'ah and\" The hypocrites came\" in the second rak'ah.",
      "chain": [
        "30367",
        "30201",
        "20159",
        "30367",
        "20167",
        "11407",
        "11199"
      ]
    },
    {
      "hadith_no": "2163",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثناه قتيبة بن سعيد، حدثنا عبد العزيز يعني الدراوردي، ح وحدثنا أبو بكر بن أبي شيبة حدثنا خالد بن مخلد، حدثنا سليمان بن بلال، جميعا بهذا الإسناد ‏.‏",
      "text_en": " This hadith has been narrated by Sulaiman b. Bilal with the same chain of transmitters.",
      "chain": [
        "30367",
        "20167",
        "30201",
        "30463"
      ]
    },
    {
      "hadith_no": "2172",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثناه قتيبة بن سعيد، حدثنا عبد العزيز، - يعني الدراوردي - عن العلاء، بهذا الإسناد ‏.‏",
      "text_en": " This hadith is narrated on the authority of 'Ala' with the same chain of transmitters.",
      "chain": [
        "30367",
        "20167"
      ]
    },
    {
      "hadith_no": "2225",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني ابن أبي عمر، حدثنا عبد العزيز، عن يزيد، عن محمد بن إبراهيم، عن أبي سلمة، أنه قال سألت عائشة زوج النبي صلى الله عليه وسلم فقلت لها في كم كفن رسول الله صلى الله عليه وسلم فقالت في ثلاثة أثواب سحولية ‏.‏",
      "text_en": " Abu Salama said:                      I asked 'A'isha with how many garments the Messenger of Allah (may peace be upon him) was shourded. She said: With three garments of Sahul.",
      "chain": [
        "30421",
        "20167",
        "20472",
        "11213",
        "10567"
      ]
    },
    {
      "hadith_no": "2293",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثناه قتيبة بن سعيد، حدثنا عبد العزيز، - يعني الدراوردي ح وحدثنيه عمرو، الناقد حدثنا أبو أحمد الزبيري، حدثنا سفيان، كلاهما عن سهيل، بهذا الإسناد ‏.‏ نحوه.‏",
      "text_en": " A hadith like this has been narrated by Suhail with the same chain of transmitters.",
      "chain": [
        "30367",
        "20167",
        "20355"
      ]
    },
    {
      "hadith_no": "2296",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني علي بن حجر السعدي، وإسحاق بن إبراهيم الحنظلي، - واللفظ لإسحاق - قال علي حدثنا وقال، إسحاق أخبرنا عبد العزيز بن محمد، عن عبد الواحد بن حمزة، عن عباد بن عبد الله بن الزبير، أن عائشة، أمرت أن يمر، بجنازة سعد بن أبي وقاص في المسجد فتصلي عليه فأنكر الناس ذلك عليها فقالت ما أسرع ما نسي الناس ما صلى رسول الله صلى الله عليه وسلم على سهيل ابن البيضاء إلا في المسجد ‏.‏",
      "text_en": " 'Abbad b. 'Abdullah b. Zubair reported that 'A'isha ordered the bier of Sa'd b. Abu Waqqas to be brought into the mosque so that she should pray for him. The people disapproved this (act) of hers. She said:                      How soon the people have forgotten that the Messenger of Allah (may peace be upon him) offered not the funeral prayer of Suhail b al-Baida' but in a mosque.",
      "chain": [
        "20387",
        "30123",
        "30026",
        "30312",
        "20167",
        "11886",
        "11250"
      ]
    },
    {
      "hadith_no": "2340",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثناه قتيبة بن سعيد، حدثنا عبد العزيز، - يعني الدراوردي - عن سهيل، بهذا الإسناد ‏.‏ وساق الحديث ‏.‏  وحدثنيه محمد بن عبد الله بن بزيع، حدثنا يزيد بن زريع، حدثنا روح بن القاسم، حدثنا سهيل بن أبي صالح، بهذا الإسناد وقال بدل عقصاء عضباء وقال ‏\"‏ فيكوى بها جنبه وظهره ‏\"‏ ‏.‏ ولم يذكر جبينه ‏.‏",
      "text_en": " This hadith has been narrated by Suhail b. Abu Salih with the same chain of transmitters, and he said he substituted the word aqsa' with 'adba' and said:                     \" his side and his back,\" but he made no mention of his forehead.",
      "chain": [
        "30367",
        "20167",
        "20304",
        "11586"
      ]
    },
    {
      "hadith_no": "2667",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثناه قتيبة بن سعيد، حدثنا عبد العزيز، - يعني الدراوردي - عن جعفر، بهذا الإسناد وزاد فقيل له إن الناس قد شق عليهم الصيام وإنما ينظرون فيما فعلت ‏.‏ فدعا بقدح من ماء بعد العصر ‏.‏",
      "text_en": " This hadith has been narrated by Ja'far with the some chain of trans- mitters and he added:                      It was said to him (to the Holy Prophet): There are people to whom fasting has become unbearable and they are waiting how you do. He (the Holy Prophet) then called for a cup of water when it was afternoon. The rest of the hadith is the same.",
      "chain": [
        "30367",
        "20167"
      ]
    },
    {
      "hadith_no": "2747",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني محمد بن أبي عمر المكي، حدثنا عبد العزيز بن محمد الدراوردي، عن يزيد بن عبد الله بن الهاد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن عائشة، - رضى الله عنها - أنها قالت إن كانت إحدانا لتفطر في زمان رسول الله صلى الله عليه وسلم فما تقدر على أن تقضيه مع رسول الله صلى الله عليه وسلم حتى يأتي شعبان ‏.‏",
      "text_en": " 'A'isha reported:                      If one amongst us had to break fasts (of Ramadan due to natural reasons, i. e. menses) during the life of the Messenger of Allah (may peace be upon him) she could not find it possible to complete them so long she had been in the presence of Allah's Messenger (may peace be upon him) till Sha'ban commenced.",
      "chain": [
        "20167",
        "11234",
        "11213",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "2768",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثناه قتيبة بن سعيد، حدثنا عبد العزيز، - يعني الدراوردي - عن سهيل، بهذا الإسناد ‏.‏",
      "text_en": " This hadith has been narrated by Suhail with the, arne chainof trausmitters.",
      "chain": [
        "30367",
        "20167"
      ]
    },
    {
      "hadith_no": "2827",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا ابن أبي عمر، حدثنا عبد العزيز، - يعني الدراوردي - عن يزيد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن أبي سعيد الخدري، - رضى الله عنه - أنه قال كان رسول الله صلى الله عليه وسلم يجاور في رمضان العشر التي في وسط الشهر ‏.‏ وساق الحديث بمثله غير أنه قال ‏\"‏ فليثبت في معتكفه ‏\"‏ ‏.‏ وقال وجبينه ممتلئا طينا وماء ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported that the Messenger of Allah (may peace be upon him) devoted (himself to prayer) in the middle (ten nights) of Ramadan. The rest of the hadith is the same except for these words:                     \" That he adhered to his place of i'tikaf and his forehead was besmeared with mud and water.\"",
      "chain": [
        "30421",
        "20167",
        "20472",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "3379",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني ابن محمد الدراوردي - عن عمرو بن يحيى المازني، عن عباد بن تميم، عن عمه عبد الله بن زيد بن عاصم، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن إبراهيم حرم مكة ودعا لأهلها وإني حرمت المدينة كما حرم إبراهيم مكة وإني دعوت في صاعها ومدها بمثلى ما دعا به إبراهيم لأهل مكة ‏\"‏ ‏.‏",
      "text_en": "  'Abdullah b. Zaid b. 'Asim (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      Verily Ibrahim declared Mecca sacred and supplicated (for blessings to be showered) upon its inhabitants, and I declare Medina to be sacred as lbrahim had declared Mecca to be sacred. I have supplicated (Allah for His blessings to be showered) in its sa' and its mudd (two standards of weight and measurement) twice as did Ibrahim for the inhabitants of Mecca.",
      "chain": [
        "30367",
        "20167",
        "11210",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "3418",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد العزيز، - يعني الدراوردي - عن العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يأتي على الناس زمان يدعو الرجل ابن عمه وقريبه هلم إلى الرخاء هلم إلى الرخاء والمدينة خير لهم لو كانوا يعلمون والذي نفسي بيده لا يخرج منهم أحد رغبة عنها إلا أخلف الله فيها خيرا منه ألا إن المدينة كالكير تخرج الخبيث ‏.‏ لا تقوم الساعة حتى تنفي المدينة شرارها كما ينفي الكير خبث الحديد ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      A time will come for the people (of Medina) when a man will invite his cousin and any other near relation: Come (and settle) at (a place) where living is cheap, come to where there is plenty, but Medina will be better for them; would they know it! By Him in Whose Hand is my life, none amongst them would go out (of the city) with a dislike for it, but Allah would make his successor in it someone better than be. Behold. Medina is like furnace which eliminates from it the impurities. And the Last Hour will not come until Medina banishes its evils just as a furnace eliminates the impurities of iron.",
      "chain": [
        "30367",
        "20167",
        "10606",
        "11884",
        "13"
      ]
    }
  ],
  "total_hadiths": 271
}