{
  "id": "20164",
  "name": "'Abdullah bin Muslima al-Qa'nabi عبد الله بن مسلمة بن قعنب القعنبي",
  "full_name": "'Abdullah bin Muslima al-Qa'nabi عبد الله بن مسلمة بن قعنب القعنبي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "130",
      "date_gregorian": "NA",
      "date_display": [
        "130 AH"
      ],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "221",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Makkah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Basra",
      " Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  ت  س  -  ثقة ]"
    ],
    "tags": [
      "B.Haritha",
      "al-Basri",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "24428",
      "name": "Muslimah bin Qa'nab al-Harithi مسلمة بن قعنب الحارثي البصري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "22025",
      "name": "Isma'il bin Muslima إسماعيل بن مسلمة بن قعنب الحارثي القعنب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "24428",
      "name": "Muslimah bin Qa'nab al-Harithi مسلمة بن قعنب الحارثي البصري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20156",
      "name": "Aflah bin Hameed bin Nafi' أفلح بن حميد بن نافع",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "12154",
      "name": "Salmah bin Wrdan al-Lythy سلمة بن وردان الليثي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11845",
      "name": "Da'ud bin Qays al-Fra'a داود بن قيس الفراء الدباغ",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11163",
      "name": "Zayd bin Aslam زيد بن أسلم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "20303",
      "name": "Yazid bin Ibrahim al-Tstry يزيد بن إبراهيم التستري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "22220",
      "name": "Naf' bin 'Abdur Rahman نافع بن عبد الرحمن بن أبي نعيم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20150",
      "name": "Ibrahim bin Sa'd bin Ibrahim إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20200",
      "name": "Fadayl bin 'Iyyad bin Mas'ud فضيل بن عياض بن مسعود",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20519",
      "name": "Hisham bin Sa'd al-Madni هشام بن سعد المدني أبو عباد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20522",
      "name": "Y'aqub bin Muhammad bin Thla'a يعقوب بن محمد بن طحلاء",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30553",
      "name": "'Abd bin Hameed bin Nasr عبد بن حميد بن نصر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38433",
      "name": "'Amr bin Mnswr al-Nsa'iy عمرو بن منصور النسائي أبو سعيد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30394",
      "name": "Musa bin Hzam موسى بن حزام",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38684",
      "name": "Hilal bin al-'Ala' bin Hilal bin 'Umar هلال بن العلاء بن هلال بن عمر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "25264",
      "name": "Muhammad bin Ziyad al-Yshkry محمد بن زياد اليشكري الطحان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "38556",
      "name": "Muhammad bin 'Ali in Maymun محمد بن علي بن ميمون",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38044",
      "name": "Ahmed bin al-Frat bin Khalid أحمد بن الفرات بن خالد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30516",
      "name": "Muhammad bin Sahl bin Askr محمد بن سهل بن عسكر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30272",
      "name": "Muhammad bin 'Abdul Rahim bin Abi Zuhayr محمد بن عبد الرحيم بن أبي زهير البزاز",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30297",
      "name": "Ahmed bin Snan bin Asad أحمد بن سنان بن أسد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38719",
      "name": "Y'aqub bin Sufyan يعقوب بن سفيان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "39144",
      "name": "Isma'il bin Ishaq bin Isma'il إسماعيل بن إسحاق",
      "grade": "3rd Century AH"
    },
    {
      "id": "32250",
      "name": "'Ali bin 'Abdul 'Aziz al-Baghvi علي بن عبد العزيز البغوي",
      "grade": "3rd Century AH"
    },
    {
      "id": "31378",
      "name": "al-Fadl bin al-Habab bin Muhammad الفضل بن الحباب",
      "grade": "3rd Century AH"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "19",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن عبد الرحمن بن عبد الله بن عبد الرحمن بن أبي صعصعة، عن أبيه، عن أبي سعيد الخدري، أنه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يوشك أن يكون خير مال المسلم غنم يتبع بها شعف الجبال ومواقع القطر، يفر بدينه من الفتن ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Said Al-Khudri:                          Allah's Apostle said, \"A time will come that the best property of a      Muslim will be sheep which he will take on the top of mountains and      the places of rainfall (valleys) so as to flee with his religion from      afflictions.\"",
      "chain": [
        "20164",
        "20001",
        "11518",
        "11514",
        "38"
      ]
    },
    {
      "hadith_no": "29",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن ابن عباس، قال قال النبي صلى الله عليه وسلم ‏\"‏ أريت النار فإذا أكثر أهلها النساء يكفرن ‏\"‏‏.‏ قيل أيكفرن بالله قال ‏\"‏ يكفرن العشير، ويكفرن الإحسان، لو أحسنت إلى إحداهن الدهر ثم رأت منك شيئا قالت ما رأيت منك خيرا قط ‏\"‏‏.‏",
      "text_en": "      Narrated Ibn 'Abbas:                          The Prophet said: \"I was shown the Hell-fire and that the majority of      its dwellers were women who were ungrateful.\" It was asked, \"Do they      disbelieve in Allah?\" (or are they ungrateful to Allah?) He replied,      \"They are ungrateful to their husbands and are ungrateful for the      favors and the good (charitable deeds) done to them. If you have      always been good (benevolent) to one of them and then she sees      something in you (not of her liking), she will say, 'I have never      received any good from you.\"",
      "chain": [
        "20164",
        "20001",
        "11163",
        "11020",
        "17"
      ]
    },
    {
      "hadith_no": "54",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن مسلمة، قال أخبرنا مالك، عن يحيى بن سعيد، عن محمد بن إبراهيم، عن علقمة بن وقاص، عن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الأعمال بالنية، ولكل امرئ ما نوى، فمن كانت هجرته إلى الله ورسوله، فهجرته إلى الله ورسوله، ومن كانت هجرته لدنيا يصيبها، أو امرأة يتزوجها، فهجرته إلى ما هاجر إليه ‏\"‏‏.‏",
      "text_en": "      Narrated 'Umar bin Al-Khattab:                          Allah's Apostle said, \"The reward of deeds depends upon the intention      and every person will get the reward according to what he has      intended. So whoever emigrated for Allah and His Apostle, then his      emigration was for Allah and His Apostle. And whoever emigrated for      worldly benefits or for a woman to marry, his emigration was for what      he emigrated for.\"",
      "chain": [
        "20164",
        "20001",
        "11062",
        "11213",
        "11042",
        "3"
      ]
    },
    {
      "hadith_no": "139",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن موسى بن عقبة، عن كريب، مولى ابن عباس عن أسامة بن زيد، أنه سمعه يقول دفع رسول الله صلى الله عليه وسلم من عرفة حتى إذا كان بالشعب نزل فبال، ثم توضأ ولم يسبغ الوضوء‏.‏ فقلت الصلاة يا رسول الله‏.‏ فقال ‏\"‏ الصلاة أمامك ‏\"‏‏.‏ فركب، فلما جاء المزدلفة نزل فتوضأ، فأسبغ الوضوء، ثم أقيمت الصلاة فصلى المغرب، ثم أناخ كل إنسان بعيره في منزله، ثم أقيمت العشاء فصلى ولم يصل بينهما‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     Allah's Apostle proceeded from `Arafat till when he reached the mountain pass, he dismounted, urinated and then performed ablution but not a perfect one. I said to him, (\"Is it the time for) the prayer, O Allah's Apostle?\" He said, \"The (place of) prayer is ahead of you.\" He rode till when he reached Al-Muzdalifa, he dismounted and performed ablution and a perfect one, The (call for) Iqama was pronounced and he led the Maghrib prayer. Then everybody made his camel kneel down at its place. Then the Iqama was pronounced for the `Isha' prayer which the Prophet led and no prayer was offered in between the two . prayers (`Isha' and Maghrib).",
      "chain": [
        "20164",
        "20001",
        "11106",
        "11211",
        "50"
      ]
    },
    {
      "hadith_no": "261",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن مسلمة، أخبرنا أفلح، عن القاسم، عن عائشة، قالت كنت أغتسل أنا والنبي، صلى الله عليه وسلم من إناء واحد تختلف أيدينا فيه‏.‏",
      "text_en": " Narrated Aisha:                     The Prophet and I used to take a bath from a single pot of water and our hands used to go in the pot after each other in turn.",
      "chain": [
        "20164",
        "20156",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "280",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن أبي النضر، مولى عمر بن عبيد الله أن أبا مرة، مولى أم هانئ بنت أبي طالب أخبره أنه، سمع أم هانئ بنت أبي طالب، تقول ذهبت إلى رسول الله صلى الله عليه وسلم عام الفتح، فوجدته يغتسل وفاطمة تستره فقال ‏\"‏ من هذه ‏\"‏‏.‏ فقلت أنا أم هانئ‏.‏",
      "text_en": " Narrated Um Hani bint Abi Talib:                     I went to Allah's Apostle in the year of the conquest of Mecca and found him taking a bath while Fatima was screening him. The Prophet asked, \"Who is it?\" I replied, \"I am Um-Hani.\"",
      "chain": [
        "20164",
        "20001",
        "11164",
        "11237",
        "198"
      ]
    },
    {
      "hadith_no": "424",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن مسلمة، قال حدثنا إبراهيم بن سعد، عن ابن شهاب، عن محمود بن الربيع، عن عتبان بن مالك، أن النبي صلى الله عليه وسلم أتاه في منزله فقال ‏\"‏ أين تحب أن أصلي لك من بيتك ‏\"‏‏.‏ قال فأشرت له إلى مكان، فكبر النبي صلى الله عليه وسلم وصففنا خلفه، فصلى ركعتين‏.‏",
      "text_en": " Narrated `Itban bin Malik:                     The Prophet came to my house and said, \"Where do you like me to pray?\" I pointed to a place. The Prophet then said, \"Allahu Akbar\", and we aligned behind him and he offered a two-rak`at prayer.",
      "chain": [
        "20164",
        "20150",
        "11013",
        "5278",
        "251"
      ]
    },
    {
      "hadith_no": "431",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن عبد الله بن عباس، قال انخسفت الشمس، فصلى رسول الله صلى الله عليه وسلم ثم قال ‏\"‏ أريت النار، فلم أر منظرا كاليوم قط أفظع ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     The sun eclipsed and Allah's Apostle offered the eclipse prayer and said, \"I have been shown the Hellfire (now) and I never saw a worse and horrible sight than the sight I have seen today.\"",
      "chain": [
        "20164",
        "20001",
        "11163",
        "11020",
        "17"
      ]
    },
    {
      "hadith_no": "437",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ قاتل الله اليهود اتخذوا قبور أنبيائهم مساجد ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"May Allah's curse be on the Jews for they built the places of worship at the graves of their Prophets.\"",
      "chain": [
        "20164",
        "20001",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "475",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن ابن شهاب، عن عباد بن تميم، عن عمه، أنه رأى رسول الله صلى الله عليه وسلم مستلقيا في المسجد، واضعا إحدى رجليه على الأخرى‏.‏ وعن ابن شهاب عن سعيد بن المسيب قال كان عمر وعثمان يفعلان ذلك‏.‏",
      "text_en": " Narrated `Abbad bin Tamim:                     that his uncle said, \"I saw Allah's Apostle lying flat (on his back) in the mosque with one leg on the other.\" Narrated Sa`id bin Al-Musaiyab that `Umar and `Uthman used to do the same.",
      "chain": [
        "20164",
        "20001",
        "11013",
        "639"
      ]
    },
    {
      "hadith_no": "522",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن مسلمة، قال قرأت على مالك عن ابن شهاب، أن عمر بن عبد العزيز، أخر الصلاة يوما، فدخل عليه عروة بن الزبير، فأخبره أن المغيرة بن شعبة أخر الصلاة يوما وهو بالعراق، فدخل عليه أبو مسعود الأنصاري فقال ما هذا يا مغيرة أليس قد علمت أن جبريل نزل فصلى، فصلى رسول الله صلى الله عليه وسلم ثم صلى فصلى رسول الله صلى الله عليه وسلم ثم صلى فصلى رسول الله صلى الله عليه وسلم ثم صلى فصلى رسول الله صلى الله عليه وسلم ثم صلى فصلى رسول الله صلى الله عليه وسلم ثم قال ‏\"‏ بهذا أمرت ‏\"‏‏.‏ فقال عمر لعروة اعلم ما تحدث أوإن جبريل هو أقام لرسول الله صلى الله عليه وسلم وقت الصلاة‏.‏ قال عروة كذلك كان بشير بن أبي مسعود يحدث عن أبيه‏.‏ قال عروة ولقد حدثتني عائشة، أن رسول الله صلى الله عليه وسلم كان يصلي العصر، والشمس في حجرتها قبل أن تظهر‏.‏",
      "text_en": " Narrated Ibn Shihab:                     Once `Umar bin `Abdul `Aziz delayed the prayer and `Urwa bin Az-Zubair went to him and said, \"Once in 'Iraq, Al-Mughira bin Shu`ba delayed his prayers and Abi Mas`ud Al-Ansari went to him and said, 'O Mughira! What is this? Don't you know that once Gabriel came and offered the prayer (Fajr prayer) and Allah's Apostle prayed too, then he prayed again (Zuhr prayer) and so did Allah's Apostle and again he prayed (`Asr prayers and Allah's Apostle did the same; again he prayed (Maghrib-prayer) and so did Allah's Apostle and again prayed (`Isha prayer) and so did Allah's Apostle and (Gabriel) said, 'I was ordered to do so (to demonstrate the prayers prescribed to you)?'\" `Umar (bin `Abdul `Aziz) said to `Urwa, \"Be sure of what you Say. Did Gabriel lead Allah's Apostle at the stated times of the prayers?\" `Urwa replied, \"Bashir bin Abi Mas`ud narrated like this on the authority of his father.\" `Urwa added, \"Aisha told me that Allah's Apostle used to pray `Asr prayer when the sunshine was still inside her residence (during the early time of `Asr).",
      "chain": [
        "20164",
        "11013",
        "166"
      ]
    },
    {
      "hadith_no": "548",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال كنا نصلي العصر ثم يخرج الإنسان إلى بني عمرو بن عوف فنجدهم يصلون العصر‏.‏",
      "text_en": " Narrated Anas bin Malik:                     We used to pray the `Asr prayer and after that if someone happened to go to the tribe of Bani `Amr bin `Auf, he would find them still praying the `Asr (prayer).",
      "chain": [
        "20164",
        "20001",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "579",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن زيد بن أسلم، عن عطاء بن يسار، وعن بسر بن سعيد، وعن الأعرج، يحدثونه عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أدرك من الصبح ركعة قبل أن تطلع الشمس فقد أدرك الصبح، ومن أدرك ركعة من العصر قبل أن تغرب الشمس فقد أدرك العصر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Whoever could get one rak`a (of the Fajr prayer) before sunrise, he has got the (morning) prayer and whoever could get one rak`a of the `Asr prayer before sunset, he has got the (`Asr) prayer.\"",
      "chain": [
        "20164",
        "20001",
        "11163",
        "11020",
        "11153",
        "13"
      ]
    },
    {
      "hadith_no": "617",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن ابن شهاب، عن سالم بن عبد الله، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن بلالا يؤذن بليل، فكلوا واشربوا حتى ينادي ابن أم مكتوم ‏\"‏‏.‏ ثم قال وكان رجلا أعمى لا ينادي حتى يقال له أصبحت أصبحت‏.‏",
      "text_en": " Narrated Salim bin `Abdullah:                     My father said that Allah s Apostle said, \"Bilal pronounces 'Adhan at night, so keep on eating and drinking (Suhur) till Ibn Um Maktum pronounces Adhan.\" Salim added, \"He was a blind man who would not pronounce the Adhan unless he was told that the day had dawned.\"",
      "chain": [
        "20164",
        "20001",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "659",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الملائكة تصلي على أحدكم ما دام في مصلاه ما لم يحدث اللهم اغفر له، اللهم ارحمه‏.‏ لا يزال أحدكم في صلاة ما دامت الصلاة تحبسه، لا يمنعه أن ينقلب إلى أهله إلا الصلاة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The angels keep on asking for Allah's Blessing and Forgiveness for anyone of you as long as he is at his Musalla (praying place) and does not do Hadath (passes wind). The angels say, 'O Allah! Forgive him and be Merciful to him.' Each one of you is in the prayer as long as he is waiting for the prayer and nothing but the prayer detains him from going to his family.\"",
      "chain": [
        "20164",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "714",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك بن أنس، عن أيوب بن أبي تميمة السختياني، عن محمد بن سيرين، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم انصرف من اثنتين، فقال له ذو اليدين أقصرت الصلاة أم نسيت يا رسول الله فقال رسول الله صلى الله عليه وسلم ‏\"‏ أصدق ذو اليدين ‏\"‏‏.‏ فقال الناس نعم‏.‏ فقام رسول الله صلى الله عليه وسلم فصلى اثنتين أخريين ثم سلم، ثم كبر فسجد مثل سجوده أو أطول‏.‏",
      "text_en": " Narrated Abu Huraira:                     Once Allah's Apostle prayed two rak`at (instead of four) and finished his prayer. Dhul-Yadain asked him whether the prayer had been reduced or whether he had forgotten. Allah's Apostle asked the people whether Dhul-Yadain was telling the truth. The people replied in the affirmative. Then Allah's Apostle stood up, offered the remaining two rak`at and then finished his prayer with Taslim and then said, \"Allahu Akbar.\" He followed it with two prostrations like ordinary prostrations or a bit longer.",
      "chain": [
        "20164",
        "20001",
        "11015",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "735",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن ابن شهاب، عن سالم بن عبد الله، عن أبيه، أن رسول الله صلى الله عليه وسلم كان يرفع يديه حذو منكبيه إذا افتتح الصلاة، وإذا كبر للركوع، وإذا رفع رأسه من الركوع رفعهما كذلك أيضا وقال ‏\"‏ سمع الله لمن حمده، ربنا ولك الحمد ‏\"‏‏.‏ وكان لا يفعل ذلك في السجود‏.‏",
      "text_en": " Narrated Salim bin `Abdullah:                     My father said, \"Allah's Apostle used to raise both his hands up to the level of his shoulders when opening the prayer; and on saying the Takbir for bowing. And on raising his head from bowing he used to do the same and then say \"Sami`a l-lahu liman hamidah, Rabbana wa laka l-hamd.\" And he did not do that (i.e. raising his hands) in prostrations.",
      "chain": [
        "20164",
        "20001",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "740",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن أبي حازم، عن سهل بن سعد، قال كان الناس يؤمرون أن يضع الرجل اليد اليمنى على ذراعه اليسرى في الصلاة‏.‏ قال أبو حازم لا أعلمه إلا ينمي ذلك إلى النبي صلى الله عليه وسلم‏.‏ قال إسماعيل ينمى ذلك‏.‏ ولم يقل ينمي‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     The people were ordered to place the right hand on the left forearm in the prayer. Abu Hazim said, \"I knew that the order was from the Prophet .\"",
      "chain": [
        "20164",
        "20001",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "782",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن سمى، مولى أبي بكر عن أبي صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا قال الإمام ‏{‏غير المغضوب عليهم ولا الضالين‏}‏ فقولوا آمين‏.‏ فإنه من وافق قوله قول الملائكة غفر له ما تقدم من ذنبه ‏\"‏‏.‏ تابعه محمد بن عمرو عن أبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم ونعيم المجمر عن أبي هريرة رضى الله عنه‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Say Amen when the Imam says 'Ghairi l-maghdubi `alaihim wala d-daalleen' (not the path of those who earn Your Anger (such as Jews) nor of those who go astray (such as Christians)); all the past sins of the person whose saying (of Amin) coincides with that of the angels, will be forgiven\".",
      "chain": [
        "20164",
        "20001",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "799",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن نعيم بن عبد الله المجمر، عن علي بن يحيى بن خلاد الزرقي، عن أبيه، عن رفاعة بن رافع الزرقي، قال كنا يوما نصلي وراء النبي صلى الله عليه وسلم فلما رفع رأسه من الركعة قال ‏\"‏ سمع الله لمن حمده ‏\"‏‏.‏ قال رجل وراءه ربنا ولك الحمد، حمدا كثيرا طيبا مباركا فيه، فلما انصرف قال ‏\"‏ من المتكلم ‏\"‏‏.‏ قال أنا‏.‏ قال ‏\"‏ رأيت بضعة وثلاثين ملكا يبتدرونها، أيهم يكتبها أول ‏\"‏‏.‏",
      "text_en": " Narrated Rifa`a bin Rafi` Az-Zuraqi:                     One day we were praying behind the Prophet. When he raised his head from bowing, he said, \"Sami`a l-lahu liman hamidah.\" A man behind him said, \"Rabbana wa laka l-hamdu, hamdan kathiran taiyiban mubarakan fihi\" (O our Lord! All the praises are for You, many good and blessed praises). When the Prophet completed the prayer, he asked, \"Who has said these words?\" The man replied, \"I.\" The Prophet said, \"I saw over thirty angels competing to write it first.\" Prophet rose (from bowing) and stood straight till all the vertebrae of his spinal column came to a natural position.",
      "chain": [
        "20164",
        "20001",
        "11225",
        "11710",
        "325",
        "323"
      ]
    },
    {
      "hadith_no": "827",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن عبد الرحمن بن القاسم، عن عبد الله بن عبد الله، أنه أخبره أنه، كان يرى عبد الله بن عمر  رضى الله عنهما  يتربع في الصلاة إذا جلس، ففعلته وأنا يومئذ حديث السن، فنهاني عبد الله بن عمر وقال إنما سنة الصلاة أن تنصب رجلك اليمنى وتثني اليسرى‏.‏ فقلت إنك تفعل ذلك‏.‏ فقال إن رجلى لا تحملاني‏.‏",
      "text_en": " Narrated `Abdullah bin `Abdullah:                     I saw `Abdullah bin `Umar crossing his legs while sitting in the prayer and I, a mere youngster in those days, did the same. Ibn `Umar forbade me to do so, and said, \"The proper way is to keep the right foot propped up and bend the left in the prayer.\" I said questioningly, \"But you are doing so (crossing the legs).\" He said, \"My feet cannot bear my weight.\"",
      "chain": [
        "20164",
        "20001",
        "10530"
      ]
    },
    {
      "hadith_no": "846",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن صالح بن كيسان، عن عبيد الله بن عبد الله بن عتبة بن مسعود، عن زيد بن خالد الجهني، أنه قال صلى لنا رسول الله صلى الله عليه وسلم صلاة الصبح بالحديبية على إثر سماء كانت من الليلة، فلما انصرف أقبل على الناس فقال ‏\"‏ هل تدرون ماذا قال ربكم ‏\"‏‏.‏ قالوا الله ورسوله أعلم‏.‏ قال ‏\"‏ أصبح من عبادي مؤمن بي وكافر، فأما من قال مطرنا بفضل الله ورحمته فذلك مؤمن بي وكافر بالكوكب، وأما من قال بنوء كذا وكذا فذلك كافر بي ومؤمن بالكوكب ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     The Prophet led us in the Fajr prayer at Hudaibiya after a rainy night. On completion of the prayer, he faced the people and said, \"Do you know what your Lord has said (revealed)?\" The people replied, \"Allah and His Apostle know better.\" He said, \"Allah has said, 'In this morning some of my slaves remained as true believers and some became non-believers; whoever said that the rain was due to the Blessings and the Mercy of Allah had belief in Me and he disbelieves in the stars, and whoever said that it rained because of a particular star had no belief in Me but believes in that star.' \"",
      "chain": [
        "20164",
        "20001",
        "11176",
        "11004",
        "3625"
      ]
    },
    {
      "hadith_no": "861",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن ابن شهاب، عن عبيد الله بن عبد الله بن عتبة، عن ابن عباس  رضى الله عنهما  أنه قال أقبلت راكبا على حمار أتان وأنا يومئذ قد ناهزت الاحتلام ورسول الله صلى الله عليه وسلم يصلي بالناس بمنى إلى غير جدار، فمررت بين يدى بعض الصف، فنزلت وأرسلت الأتان ترتع ودخلت في الصف، فلم ينكر ذلك على أحد‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Once I came riding a she-ass and I, then, had just attained the age of puberty. Allah's Apostle was leading the people in prayer at Mina facing no wall. I passed in front of the row and let loose the sheass for grazing and joined the row and no one objected to my deed.",
      "chain": [
        "20164",
        "20001",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "867",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، ح وحدثنا عبد الله بن يوسف، قال أخبرنا مالك، عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، عن عائشة، قالت إن كان رسول الله صلى الله عليه وسلم ليصلي الصبح، فينصرف النساء متلفعات بمروطهن، ما يعرفن من الغلس‏.‏",
      "text_en": " Narrated `Aisha:                     When Allah's Apostle finished the Fajr prayer, the women would leave covered in their sheets and were not recognized owing to the darkness.",
      "chain": [
        "20164",
        "20001",
        "30355",
        "20001",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "895",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن صفوان بن سليم، عن عطاء بن يسار، عن أبي سعيد الخدري  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ غسل يوم الجمعة واجب على كل محتلم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle said, \"The taking of a bath on Friday is compulsory for every Muslim who has attained the age of puberty.\"",
      "chain": [
        "20164",
        "20001",
        "11177",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "935",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم ذكر يوم الجمعة فقال ‏\"‏ فيه ساعة لا يوافقها عبد مسلم، وهو قائم يصلي، يسأل الله تعالى شيئا إلا أعطاه إياه ‏\"‏‏.‏ وأشار بيده يقللها‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle (p.b.u.h) talked about Friday and said, \"There is an hour (opportune time) on Friday and if a Muslim gets it while praying and asks something from Allah, then Allah will definitely meet his demand.\" And he (the Prophet) pointed out the shortness of that time with his hands.",
      "chain": [
        "20164",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "939",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن مسلمة، قال حدثنا ابن أبي حازم، عن أبيه، عن سهل، بهذا وقال ما كنا نقيل ولا نتغدى إلا بعد الجمعة‏.‏",
      "text_en": " Narrated Sahl:                     As above with the addition: We never had an afternoon nap nor meals except after offering the Jumua prayer.",
      "chain": [
        "20164",
        "20165",
        "11172"
      ]
    },
    {
      "hadith_no": "992",
      "source": " Sahih Bukhari ",
      "chapter": "Witr Prayer - كتاب الوتر",
      "chapter_no": "14",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن مخرمة بن سليمان، عن كريب، أن ابن عباس، أخبره أنه، بات عند ميمونة، وهى خالته، فاضطجعت في عرض وسادة، واضطجع رسول الله صلى الله عليه وسلم وأهله في طولها، فنام حتى انتصف الليل أو قريبا منه، فاستيقظ يمسح النوم عن وجهه، ثم قرأ عشر آيات من آل عمران، ثم قام رسول الله صلى الله عليه وسلم إلى شن معلقة، فتوضأ فأحسن الوضوء، ثم قام يصلي فصنعت مثله فقمت إلى جنبه، فوضع يده اليمنى على رأسي، وأخذ بأذني يفتلها، ثم صلى ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم ركعتين، ثم أوتر، ثم اضطجع حتى جاءه المؤذن فقام فصلى ركعتين ثم، خرج فصلى الصبح‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Once I passed the night in the house of Maimuna (his aunt). I slept across the bed while Allah's Apostle and his wife slept length-wise. The Prophet slept till midnight or nearly so and woke up rubbing his face and recited ten verses from Surat \"Al-`Imran.\" Allah's Apostle went towards a leather skin and performed ablution in the most perfect way and then stood for the prayer. I did the same and stood beside him. The Prophet put his right hand on my head, twisted my ear and then prayed two rak`at five times and then ended his prayer with witr. He laid down till the Mu'adh-dhin came then he stood up and offered two rak`at (Sunna of Fajr prayer) and then went out and offered the Fajr prayer. (See Hadith No. 183, Vol. 1)",
      "chain": [
        "20164",
        "20001",
        "11223",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "1016",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن شريك بن عبد الله، عن أنس، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال هلكت المواشي وتقطعت السبل‏.‏ فدعا، فمطرنا من الجمعة إلى الجمعة، ثم جاء فقال تهدمت البيوت وتقطعت السبل، وهلكت المواشي فادع الله يمسكها‏.‏ فقام صلى الله عليه وسلم فقال ‏\"‏ اللهم على الآكام والظراب والأودية ومنابت الشجر ‏\"‏‏.‏ فانجابت عن المدينة انجياب الثوب‏.‏",
      "text_en": " Narrated Anas:                     A man came to the Prophet (p.b.u.h) and said, \"Livestock are destroyed and the roads are cut off.\" So Allah's Apostle invoked Allah for rain and it rained from that Friday till the next Friday. The same person came again and said, \"Houses have collapsed, roads are cut off, and the livestock are destroyed. Please pray to Allah to withhold the rain.\" Allah's Apostle (stood up and) said, \"O Allah! (Let it rain) on the plateaus, on the hills, in the valleys and over the places where trees grow.\" So the clouds cleared away from Medina as clothes are taken off .",
      "chain": [
        "20164",
        "20001",
        "20587",
        "19"
      ]
    },
    {
      "hadith_no": "1044",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن هشام بن عروة، عن أبيه، عن عائشة، أنها قالت خسفت الشمس في عهد رسول الله صلى الله عليه وسلم فصلى رسول الله صلى الله عليه وسلم بالناس، فقام فأطال القيام، ثم ركع فأطال الركوع، ثم قام فأطال القيام وهو دون القيام الأول، ثم ركع فأطال الركوع، وهو دون الركوع الأول، ثم سجد فأطال السجود، ثم فعل في الركعة الثانية مثل ما فعل في الأولى، ثم انصرف وقد انجلت الشمس، فخطب الناس، فحمد الله، وأثنى عليه ثم قال ‏\"‏ إن الشمس والقمر آيتان من آيات الله، لا ينخسفان لموت أحد ولا لحياته، فإذا رأيتم ذلك فادعوا الله وكبروا، وصلوا وتصدقوا ‏\"‏‏.‏ ثم قال ‏\"‏ يا أمة محمد، والله ما من أحد أغير من الله أن يزني عبده أو تزني أمته، يا أمة محمد، والله لو تعلمون ما أعلم لضحكتم قليلا ولبكيتم كثيرا ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     In the lifetime of Allah's Apostle (p.b.u.h) the sun eclipsed, so he led the people in prayer, and stood up and performed a long Qiyam, then bowed for a long while. He stood up again and performed a long Qiyam but this time the period of standing was shorter than the first. He bowed again for a long time but shorter than the first one, then he prostrated and prolonged the prostration. He did the same in the second rak`a as he did in the first and then finished the prayer; by then the sun (eclipse) had cleared. He delivered the Khutba (sermon) and after praising and glorifying Allah he said, \"The sun and the moon are two signs against the signs of Allah; they do not eclipse on the death or life of anyone. So when you see the eclipse, remember Allah and say Takbir, pray and give Sadaqa.\" The Prophet then said, \"O followers of Muhammad! By Allah! There is none who has more ghaira (selfrespect) than Allah as He has forbidden that His slaves, male or female commit adultery (illegal sexual intercourse). O followers of Muhammad! By Allah! If you knew that which I know you would laugh little and weep much.",
      "chain": [
        "20164",
        "20001",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1050",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، عن عائشة، زوج النبي صلى الله عليه وسلم أن يهودية جاءت تسألها فقالت لها أعاذك الله من عذاب القبر‏.‏ فسألت عائشة  رضى الله عنها  رسول الله صلى الله عليه وسلم أيعذب الناس في قبورهم فقال رسول الله صلى الله عليه وسلم عائذا بالله من ذلك‏.‏ ثم ركب رسول الله صلى الله عليه وسلم ذات غداة مركبا، فخسفت الشمس، فرجع ضحى، فمر رسول الله صلى الله عليه وسلم بين ظهرانى الحجر، ثم قام يصلي، وقام الناس وراءه، فقام قياما طويلا، ثم ركع ركوعا طويلا، ثم رفع فقام قياما طويلا، وهو دون القيام الأول ثم ركع ركوعا طويلا، وهو دون الركوع الأول، ثم رفع فسجد، ثم قام فقام قياما طويلا، وهو دون القيام الأول، ثم ركع ركوعا طويلا وهو دون الركوع الأول، ثم قام قياما طويلا وهو دون القيام الأول، ثم ركع ركوعا طويلا وهو دون الركوع الأول، ثم رفع فسجد وانصرف، فقال ما شاء الله أن يقول، ثم أمرهم أن يتعوذوا من عذاب القبر‏.‏",
      "text_en": " Narrated `Amra bint `Abdur-Rahman:                     A Jewess came to ask `Aisha (the wife of the Prophet) about something. She said to her, \"May Allah give you refuge from the punishment of the grave.\" So `Aisha ' asked Allah's Apostle \"Would the people be punished in their graves?\" Allah's Apostle after seeking refuge with Allah from the punishment of the grave (and thus replied in the affirmative). Then one day, Allah's Apostle rode to go to some place but the sun eclipsed. He returned in the forenoon and passed through the rear of the dwellings (of his wives) and stood for the (eclipse) prayer, and the people stood behind him. He stood up for a long period and then performed a prolonged bowing which was shorter than the first bowing. Then he raised his head and prostrated. Then he stood up (for the second rak`a) for a long while but the standing was shorter than that of the first rak`a. Then he performed a prolonged bowing which was shorter than the first one. Then he raised his head and prostrated. Then he stood up for a long time but shorter than the first. Then he performed a prolonged bowing but shorter than the first. Then he raised his head and prostrated and finished the prayer and (then delivered the sermon and) said as much as Allah wished. And then he ordered the people to seek refuge with Allah from the punishment of the grave.",
      "chain": [
        "20164",
        "20001",
        "11062",
        "11455"
      ]
    },
    {
      "hadith_no": "1052",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن زيد بن أسلم، عن عطاء بن يسار، عن عبد الله بن عباس، قال انخسفت الشمس على عهد رسول الله صلى الله عليه وسلم، فصلى رسول الله صلى الله عليه وسلم، فقام قياما طويلا نحوا من قراءة سورة البقرة، ثم ركع ركوعا طويلا، ثم رفع فقام قياما طويلا، وهو دون القيام الأول، ثم ركع ركوعا طويلا، وهو دون الركوع الأول، ثم سجد، ثم قام قياما طويلا وهو دون القيام الأول، ثم ركع ركوعا طويلا، وهو دون الركوع الأول، ثم رفع فقام قياما طويلا، وهو دون القيام الأول، ثم ركع ركوعا طويلا، وهو دون الركوع الأول، ثم سجد، ثم انصرف وقد تجلت الشمس، فقال صلى الله عليه وسلم ‏\"‏ إن الشمس والقمر آيتان من آيات الله، لا يخسفان لموت أحد ولا لحياته، فإذا رأيتم ذلك فاذكروا الله ‏\"‏‏.‏ قالوا يا رسول الله، رأيناك تناولت شيئا في مقامك، ثم رأيناك كعكعت‏.‏ قال صلى الله عليه وسلم ‏\"‏ إني رأيت الجنة، فتناولت عنقودا، ولو أصبته لأكلتم منه ما بقيت الدنيا، وأريت النار، فلم أر منظرا كاليوم قط أفظع، ورأيت أكثر أهلها النساء ‏\"‏‏.‏ قالوا بم يا رسول الله قال ‏\"‏ بكفرهن ‏\"‏‏.‏ قيل يكفرن بالله قال ‏\"‏ يكفرن العشير، ويكفرن الإحسان، لو أحسنت إلى إحداهن الدهر كله، ثم رأت منك شيئا قالت ما رأيت منك خيرا قط ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     The sun eclipsed in the lifetime of the Prophet (p.b.u.h) . Allah's Apostle offered the eclipse prayer and stood for a long period equal to the period in which one could recite Surat-al-Baqara. Then he bowed for a long time and then stood up for a long period which was shorter than that of the first standing, then bowed again for a long time but for a shorter period than the first; then he prostrated twice and then stood up for a long period which was shorter than that of the first standing; then he bowed for a long time which was shorter than the previous one, and then he raised his head and stood up for a long period which was shorter than the first standing, then he bowed for a long time which was shorter than the first bowing, and then prostrated (twice) and finished the prayer. By then, the sun (eclipse) had cleared. The Prophet then said, \"The sun and the moon are two of the signs of Allah. They eclipse neither because of the death of somebody nor because of his life (i.e. birth). So when you see them, remember Allah.\" The people say, \"O Allah's Apostle! We saw you taking something from your place and then we saw you retreating.\" The Prophet replied, \"I saw Paradise and stretched my hands towards a bunch (of its fruits) and had I taken it, you would have eaten from it as long as the world remains. I also saw the Hell-fire and I had never seen such a horrible sight. I saw that most of the inhabitants were women.\" The people asked, \"O Allah's Apostle! Why is it so?\" The Prophet replied, \"Because of their ungratefulness.\" It was asked whether they are ungrateful to Allah. The Prophet said, \"They are ungrateful to their companions of life (husbands) and ungrateful to good deeds. If you are benevolent to one of them throughout the life and if she sees anything (undesirable) in you, she will say, 'I have never had any good from you.' \"",
      "chain": [
        "20164",
        "20001",
        "11163",
        "11020",
        "17"
      ]
    },
    {
      "hadith_no": "1145",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن ابن شهاب، عن أبي سلمة، وأبي عبد الله الأغر، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ينزل ربنا تبارك وتعالى كل ليلة إلى السماء الدنيا حين يبقى ثلث الليل الآخر يقول من يدعوني فأستجيب له من يسألني فأعطيه من يستغفرني فأغفر له ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle (p.b.u.h) said, \"Our Lord, the Blessed, the Superior, comes every night down on the nearest Heaven to us when the last third of the night remains, saying: \"Is there anyone to invoke Me, so that I may respond to invocation? Is there anyone to ask Me, so that I may grant him his request? Is there anyone seeking My forgiveness, so that I may forgive him?\"",
      "chain": [
        "20164",
        "20001",
        "11013",
        "10567",
        "11171",
        "13"
      ]
    },
    {
      "hadith_no": "1151",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "قال وقال عبد الله بن مسلمة عن مالك، عن هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  قالت كانت عندي امرأة من بني أسد فدخل على رسول الله صلى الله عليه وسلم فقال ‏\"‏ من هذه ‏\"‏‏.‏ قلت فلانة لا تنام بالليل‏.‏ فذكر من صلاتها فقال ‏\"‏ مه عليكم ما تطيقون من الأعمال، فإن الله لا يمل حتى تملوا ‏\"‏‏.‏",
      "text_en": "      Narrated 'Aisha:                          A woman from the tribe of Bani Asad was sitting with me and Allah's      Apostle (p.b.u.h) came to my house and said, \"Who is this?\" I said,      \"(She is) So and so. She does not sleep at night because she is      engaged in prayer.\" The Prophet said disapprovingly: Do (good) deeds      which is within your capacity as Allah never gets tired of giving      rewards till you get tired of doing good deeds.\"",
      "chain": [
        "20164",
        "20001",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1201",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا عبد العزيز بن أبي حازم، عن أبيه، عن سهل  رضى الله عنه  قال خرج النبي صلى الله عليه وسلم يصلح بين بني عمرو بن عوف، وحانت الصلاة، فجاء بلال أبا بكر  رضى الله عنهما  فقال حبس النبي صلى الله عليه وسلم فتؤم الناس قال نعم إن شئتم‏.‏ فأقام بلال الصلاة، فتقدم أبو بكر  رضى الله عنه  فصلى، فجاء النبي صلى الله عليه وسلم يمشي في الصفوف يشقها شقا حتى قام في الصف الأول، فأخذ الناس بالتصفيح‏.‏ قال سهل هل تدرون ما التصفيح هو التصفيق‏.‏ وكان أبو بكر  رضى الله عنه  لا يلتفت في صلاته، فلما أكثروا التفت فإذا النبي صلى الله عليه وسلم في الصف، فأشار إليه مكانك‏.‏ فرفع أبو بكر يديه، فحمد الله، ثم رجع القهقرى وراءه وتقدم النبي صلى الله عليه وسلم فصلى‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     The Prophet went out to affect a reconciliation between the tribes of Bani `Amr bin `Auf and the time of the prayer became due; Bilal went to Abu Bakr and said, \"The Prophet is detained. Will you lead the people in the prayer?\" Abu Bakr replied, \"Yes, if you wish.\" So Bilal pronounced the Iqama and Abu Bakr led the prayer. In the meantime the Prophet came crossing the rows (of the praying people) till he stood in the first row and the people started clapping. Abu Bakr never looked hither and thither during the prayer but when the people clapped too much, he looked back and saw the Prophet in the (first) row. The Prophet waved him to remain at his place, but Abu Bakr raised both his hands and sent praises to Allah and then retreated and the Prophet went forward and led the prayer. (See Hadith No. 295 & 296)",
      "chain": [
        "20164",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "1209",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا مالك، عن أبي النضر، عن أبي سلمة، عن عائشة  رضى الله عنها  قالت كنت أمد رجلي في قبلة النبي صلى الله عليه وسلم وهو يصلي، فإذا سجد غمزني فرفعتها، فإذا قام مددتها‏.‏",
      "text_en": " Narrated Aisha:                     I used to stretch my legs towards the Qibla of the Prophet while he was praying; whenever he prostrated he touched me, and I would withdraw my legs, and whenever he stood up, I would restretch my legs.",
      "chain": [
        "20164",
        "20001",
        "11164",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "1277",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا ابن أبي حازم، عن أبيه، عن سهل  رضى الله عنه  أن امرأة، جاءت النبي صلى الله عليه وسلم ببردة منسوجة فيها حاشيتها  أتدرون ما البردة قالوا الشملة‏.‏ قال نعم‏.‏ قالت نسجتها بيدي، فجئت لأكسوكها‏.‏ فأخذها النبي صلى الله عليه وسلم محتاجا إليها، فخرج إلينا وإنها إزاره، فحسنها فلان فقال اكسنيها، ما أحسنها‏.‏ قال القوم ما أحسنت، لبسها النبي صلى الله عليه وسلم محتاجا إليها، ثم سألته وعلمت أنه لا يرد‏.‏ قال إني والله ما سألته لألبسها إنما سألته لتكون كفني‏.‏ قال سهل فكانت كفنه‏.‏",
      "text_en": " Narrated Sahl:                     A woman brought a woven Burda (sheet) having edging (border) to the Prophet, Then Sahl asked them whether they knew what is Burda, they said that Burda is a cloak and Sahl confirmed their reply. Then the woman said, \"I have woven it with my own hands and I have brought it so that you may wear it.\" The Prophet accepted it, and at that time he was in need of it. So he came out wearing it as his waist-sheet. A man praised it and said, \"Will you give it to me? How nice it is!\" The other people said, \"You have not done the right thing as the Prophet is in need of it and you have asked for it when you know that he never turns down anybody's request.\" The man replied, \"By Allah, I have not asked for it to wear it but to make it my shroud.\" Later it was his shroud.",
      "chain": [
        "20164",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "1325",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الله بن مسلمة، قال قرأت على ابن أبي ذئب عن سعيد بن أبي سعيد المقبري، عن أبيه، أنه سأل أبا هريرة  رضى الله عنه  فقال سمعت النبي صلى الله عليه وسلم‏.‏   حدثنا أحمد بن شبيب بن سعيد، قال حدثني أبي، حدثنا يونس، قال ابن شهاب وحدثني عبد الرحمن الأعرج، أن أبا هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من شهد الجنازة حتى يصلي عليها فله قيراط، ومن شهد حتى تدفن كان له قيراطان ‏\"‏‏.‏ قيل وما القيراطان قال ‏\"‏ مثل الجبلين العظيمين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     that Allah's Apostle (p.b.u.h) said, \"Whoever attends the funeral procession till he offers the funeral prayer for it, will get a reward equal to one Qirat, and whoever accompanies it till burial, will get a reward equal to two Qirats.\" It was asked, \"What are two Qirats?\" He replied, \"Like two huge mountains.\"",
      "chain": [
        "20164",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "1581",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا مالك، عن ابن شهاب، عن عروة بن الزبير، عن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم قالت خرجنا مع النبي صلى الله عليه وسلم في حجة الوداع، فأهللنا بعمرة ثم قال النبي صلى الله عليه وسلم ‏\"‏ من كان معه هدى فليهل بالحج مع العمرة، ثم لا يحل حتى يحل منهما جميعا ‏\"‏ فقدمت مكة وأنا حائض، ولم أطف بالبيت ولا بين الصفا والمروة، فشكوت ذلك إلى النبي صلى الله عليه وسلم فقال ‏\"‏ انقضي رأسك وامتشطي، وأهلي بالحج، ودعي العمرة ‏\"‏‏.‏ ففعلت فلما قضينا الحج أرسلني النبي صلى الله عليه وسلم مع عبد الرحمن بن أبي بكر إلى التنعيم فاعتمرت فقال ‏\"‏ هذه مكان عمرتك ‏\"‏‏.‏ قالت فطاف الذين كانوا أهلوا بالعمرة بالبيت وبين الصفا والمروة، ثم حلوا، ثم طافوا طوافا واحدا بعد أن رجعوا من منى، وأما الذين جمعوا الحج والعمرة فإنما طافوا طوافا واحدا‏.‏",
      "text_en": " Narrated Aisha:                     (the wife of the Prophet (p.b.u.h) We set out with the Prophet in his last Hajj and we assumed Ihram for Umra. The Prophet then said, \"Whoever has the Hadi with him should assume Ihram for Hajj along with `Umra and should not finish the Ihram till he finishes both.\" I was menstruating when I reached Mecca, and so I neither did Tawaf round the Ka`ba nor Tawaf between Safa and Marwa. I complained about that to the Prophet on which he replied, \"Undo and comb your head hair, and assume Ihram for Hajj (only) and leave the Umra.\" So, I did so. When we had performed the Hajj, the Prophet sent me with my brother `Abdur-Rahman bin Abu Bakr to Tan`im. So I performed the `Umra. The Prophet said to me, \"This `Umra is instead of your missed one.\" Those who had assumed Ihram for `Umra (Hajj-atTamattu) performed Tawaf round the Ka`ba and between Safa and Marwa and then finished their Ihram. After returning from Mina, they performed another Tawaf (between Safa and Marwa). Those who had assumed Ihram for Hajj and `Umra together (Hajj-al-Qiran) performed only one Tawaf (between Safa and Marwa).",
      "chain": [
        "20164",
        "20001",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1608",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن ابن شهاب، عن سالم بن عبد الله، أن عبد الله بن محمد بن أبي بكر، أخبر عبد الله بن عمر، عن عائشة  رضى الله عنهم  زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم قال لها ‏\"‏ ألم ترى أن قومك لما بنوا الكعبة اقتصروا عن قواعد إبراهيم ‏\"‏‏.‏ فقلت يا رسول الله ألا تردها على قواعد إبراهيم‏.‏ قال ‏\"‏ لولا حدثان قومك بالكفر لفعلت ‏\"‏‏.‏ فقال عبد الله  رضى الله عنه  لئن كانت عائشة  رضى الله عنها  سمعت هذا من رسول الله صلى الله عليه وسلم ما أرى رسول الله صلى الله عليه وسلم ترك استلام الركنين اللذين يليان الحجر، إلا أن البيت لم يتمم على قواعد إبراهيم‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) that Allah's Apostle said to her, \"Do you know that when your people (Quraish) rebuilt the Ka`ba, they decreased it from its original foundation laid by Abraham?\" I said, \"O Allah's Apostle! Why don't you rebuild it on its original foundation laid by Abraham?\" He replied, \"Were it not for the fact that your people are close to the Pre-Islamic Period of ignorance (i.e. they have recently become Muslims) I would have done so.\" The sub-narrator, `Abdullah (bin `Umar ) stated: `Aisha 'must have heard this from Allah's Apostle for in my opinion Allah's Apostle had not placed his hand over the two corners of the Ka`ba opposite Al-Hijr only because the Ka`ba was not rebuilt on its original foundations laid by Abraham.",
      "chain": [
        "20164",
        "20001",
        "11013",
        "11011",
        "11516",
        "18",
        "53"
      ]
    },
    {
      "hadith_no": "1658",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا مالك، عن محمد بن عبد الرحمن بن نوفل، عن عروة، عن زينب ابنة أم سلمة، عن أم سلمة  رضى الله عنها  قالت شكوت إلى رسول الله صلى الله عليه وسلم أني أشتكي‏.‏ فقال ‏\"‏ طوفي من وراء الناس وأنت راكبة ‏\"‏‏.‏ فطفت ورسول الله صلى الله عليه وسلم يصلي إلى جنب البيت، وهو يقرأ بالطور وكتاب مسطور‏.‏",
      "text_en": " Narrated Um Salama:                     I informed Allah's Apostle that I was sick. He said, \"Perform Tawaf (of the Ka`ba) while riding behind the people.\" So, I performed the Tawaf while Allah's Apostle was offering the prayer beside the Ka`ba and was reciting Surat-at-Tur.",
      "chain": [
        "20164",
        "20001",
        "11105",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "1687",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن أبي النضر، عن عمير، مولى عبد الله بن العباس عن أم الفضل بنت الحارث، أن ناسا، اختلفوا عندها يوم عرفة في صوم النبي صلى الله عليه وسلم فقال بعضهم هو صائم‏.‏ وقال بعضهم ليس بصائم‏.‏ فأرسلت إليه بقدح لبن وهو واقف على بعيره فشربه‏.‏",
      "text_en": " Narrated Um Al-Fadl bint Al Harith:                     On the day of `Arafat, some people who were with me, differed about the fasting of the Prophet (p.b.u.h) some said that he was fasting while others said that he was not fasting. So I sent a bowl full of milk to him while he was riding his camel, and he drank that milk.",
      "chain": [
        "20164",
        "20001",
        "11164",
        "156"
      ]
    },
    {
      "hadith_no": "1689",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن مسلمة، أخبرنا مالك، عن ابن شهاب، عن سالم بن عبد الله، أن عبد الملك بن مروان، كتب إلى الحجاج أن يأتم، بعبد الله بن عمر في الحج، فلما كان يوم عرفة جاء ابن عمر  رضى الله عنهما  وأنا معه حين زاغت الشمس أو زالت، فصاح عند فسطاطه أين هذا فخرح إليه فقال ابن عمر الرواح‏.‏ فقال الآن قال نعم‏.‏ قال أنظرني أفيض على ماء‏.‏ فنزل ابن عمر  رضى الله عنهما  حتى خرج، فسار بيني وبين أبي‏.‏ فقلت إن كنت تريد أن تصيب السنة اليوم فاقصر الخطبة وعجل الوقوف‏.‏ فقال ابن عمر صدق‏.‏",
      "text_en": " Narrated Salim bin `Abdullah bin `Umar:                     `Abdul-Malik bin Marwan wrote to Al-Hajjaj that he should follow `Abdullah bin `Umar in all the ceremonies of Hajj. So when it was the Day of `Arafat (9th of Dhul-Hijja), and after the sun has deviated or has declined from the middle of the sky, I and Ibn `Umar came and he shouted near the cotton (cloth) tent of Al-Hajjaj, \"Where is he?\" Al-Hajjaj came out. Ibn `Umar said, \"Let us proceed (to `Arafat).\" Al-Hajjaj asked, \"Just now?\" Ibn `Umar replied, \"Yes.\" Al-Hajjaj said, \"Wait for me till I pour water on me (i.e. take a bath).\" So, Ibn `Umar dismounted (and waited) till Al-Hajjaj came out. He was walking between me and my father. I informed Al-Hajjaj, \"If you want to follow the Sunna today, then you should shorten the sermon and then hurry up for the stay (at `Arafat).\" Ibn `Umar said, \"He (Salim) has spoken the truth.\"",
      "chain": [
        "20164",
        "20001",
        "11013",
        "11011"
      ]
    },
    {
      "hadith_no": "1723",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا أفلح بن حميد، عن القاسم، عن عائشة  رضى الله عنها  قالت فتلت قلائد هدى النبي صلى الله عليه وسلم ثم أشعرها وقلدها  أو قلدتها  ثم بعث بها إلى البيت، وأقام بالمدينة، فما حرم عليه شىء كان له حل‏.‏",
      "text_en": " Narrated `Aisha:                     I twisted the garlands for the Hadis of the Prophet and then he marked and garlanded them (or I garlanded them) and then made them proceed to the Ka`ba but he remained in Medina and no permissible thing was regarded as illegal for him then .",
      "chain": [
        "20164",
        "20156",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "1738",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا يزيد بن زريع، عن يونس، عن زياد بن جبير، قال رأيت ابن عمر  رضى الله عنهما  أتى على رجل، قد أناخ بدنته ينحرها، قال ابعثها قياما مقيدة، سنة محمد صلى الله عليه وسلم‏.‏ وقال شعبة عن يونس أخبرني زياد‏.‏",
      "text_en": " Narrated Ziyad bin Jubair:                     I saw Ibn `Umar passing by a man who had made his Badana sit to slaughter it. Ibn `Umar said, \"Slaughter it while it is standing with one leg tied up as is the tradition of Muhammad.\"",
      "chain": [
        "20164",
        "20304",
        "20475",
        "11285"
      ]
    },
    {
      "hadith_no": "1833",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا مالك، عن سمى، عن أبي صالح، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ السفر قطعة من العذاب، يمنع أحدكم طعامه وشرابه ونومه، فإذا قضى نهمته فليعجل إلى أهله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Traveling is a kind of torture as it prevents one from eating, drinking and sleeping properly. So, when one's needs are fulfilled, one should return quickly to one's family.\"",
      "chain": [
        "20164",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "1886",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن ابن شهاب، عن سليمان بن يسار، عن عبد الله بن عباس  رضى الله عنهما  قال كان الفضل رديف النبي صلى الله عليه وسلم فجاءت امرأة من خثعم، فجعل الفضل ينظر إليها، وتنظر إليه فجعل النبي صلى الله عليه وسلم يصرف وجه الفضل إلى الشق الآخر، فقالت إن فريضة الله أدركت أبي شيخا كبيرا، لا يثبت على الراحلة، أفأحج عنه قال ‏\"‏ نعم ‏\"‏‏.‏ وذلك في حجة الوداع‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Abbas (ra):                      Al Fadl was riding behind the Prophet () and a woman from the tribe of Khath'am came up. Al Fadl started looking at her and she looked at him. The Prophet () turned Al-Fadl's face to the other side. She said, \"My father has come under Allah's obligation of performing Hajj but he is very old man and cannot sit properly on his Rahila (mount). Shall I perform Hajj on his behalf ? The Prophet () replied affirmative. That happened during Hajjat-ul-Wada' of the Prophet ().",
      "chain": [
        "20164",
        "20001",
        "11013",
        "11005",
        "17"
      ]
    },
    {
      "hadith_no": "1894",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الصيام جنة، فلا يرفث ولا يجهل، وإن امرؤ قاتله أو شاتمه فليقل إني صائم‏.‏ مرتين، والذي نفسي بيده لخلوف فم الصائم أطيب عند الله تعالى من ريح المسك، يترك طعامه وشرابه وشهوته من أجلي، الصيام لي، وأنا أجزي به، والحسنة بعشر أمثالها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Fasting is a shield (or a screen or a shelter). So, the person observing fasting should avoid sexual relation with his wife and should not behave foolishly and impudently, and if somebody fights with him or abuses him, he should tell him twice, 'I am fasting.\" The Prophet added, \"By Him in Whose Hands my soul is, the smell coming out from the mouth of a fasting person is better in the sight of Allah than the smell of musk. (Allah says about the fasting person), 'He has left his food, drink and desires for My sake. The fast is for Me. So I will reward (the fasting person) for it and the reward of good deeds is multiplied ten times.\"",
      "chain": [
        "20164",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "1906",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عبد الله بن مسلمة، عن مالك، عن نافع، عن عبد الله بن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم ذكر رمضان فقال ‏\"‏ لا تصوموا حتى تروا الهلال، ولا تفطروا حتى تروه، فإن غم عليكم فاقدروا له ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle mentioned Ramadan and said, \"Do not fast unless you see the crescent (of Ramadan), and do not give up fasting till you see the crescent (of Shawwal), but if the sky is overcast (if you cannot see it), then act on estimation (i.e. count Sha'ban as 30 days).",
      "chain": [
        "20164",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1907",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا مالك، عن عبد الله بن دينار، عن عبد الله بن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الشهر تسع وعشرون ليلة، فلا تصوموا حتى تروه، فإن غم عليكم فأكملوا العدة ثلاثين ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle said, \"The month (can be) 29 nights (i.e. days), and do not fast till you see the moon, and if the sky is overcast, then complete Sha'ban as thirty days.\"",
      "chain": [
        "20164",
        "20001",
        "11183",
        "18"
      ]
    }
  ],
  "total_hadiths": 497
}