{
  "id": "20174",
  "name": "Muhammad bin 'Abdullah bin Hasan محمد بن عبد الله بن حسن بن حسن",
  "full_name": "Muhammad bin 'Abdullah bin Hasan محمد بن عبد الله بن حسن بن حسن",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "145",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "NA"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ د  ت  س  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "B.Hashim",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11061",
      "name": "Abu al-Zanad أبو الزناد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "30411",
      "name": "'Abdullah bin Nafi' al-Sa'agh عبد الله بن نافع الصائغ المخزومي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20505",
      "name": "'Abdullah bin Ja'far bin 'Abdur Rahman عبد الله بن جعفر بن عبد الرحمن - المخرمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-656",
      "hadith_no": "656",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن عبد الله بن حوشب، قال حدثنا عبد الوهاب، قال حدثنا حميد، عن أنس، قال قال النبي صلى الله عليه وسلم ‏\"‏ يا بني سلمة ألا تحتسبون آثاركم ‏\"‏‏.‏ وقال مجاهد في قوله ‏{‏ونكتب ما قدموا وآثارهم‏}‏ قال خطاهم‏.‏ وقال ابن أبي مريم أخبرنا يحيى بن أيوب، حدثني حميد، حدثني أنس، أن بني سلمة، أرادوا أن يتحولوا، عن منازلهم، فينزلوا قريبا من النبي صلى الله عليه وسلم قال فكره رسول الله صلى الله عليه وسلم أن يعروا ‏{‏المدينة‏}‏ فقال ‏\"‏ ألا تحتسبون آثاركم ‏\"‏‏.‏ قال مجاهد خطاهم آثارهم أن يمشى في الأرض بأرجلهم‏.‏",
      "text_en": " Narrated Humaid:                     Anas said, \"The Prophet said, 'O Bani Salima! Don't you think that for every step of yours (that you take towards the mosque) there is a reward (while coming for prayer)?\" Mujahid said: \"Regarding Allah's Statement: \"We record that which they have sent before (them), and their traces\" (36.12). 'Their traces' means 'their steps.' \" And Anas said that the people of Bani Salima wanted to shift to a place near the Prophet but Allah's Apostle disliked the idea of leaving their houses uninhabited and said, \"Don't you think that you will get the reward for your footprints.\" Mujahid said, \"Their foot prints mean their foot steps and their going on foot.\"",
      "usc_msa_ref": "625",
      "chain": [
        "20174",
        "20259",
        "11279",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-1305",
      "hadith_no": "1305",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن عبد الله بن حوشب، حدثنا عبد الوهاب، حدثنا يحيى بن سعيد، قال أخبرتني عمرة، قالت سمعت عائشة  رضى الله عنها  تقول لما جاء قتل زيد بن حارثة وجعفر وعبد الله بن رواحة، جلس النبي صلى الله عليه وسلم يعرف فيه الحزن، وأنا أطلع من شق الباب، فأتاه رجل فقال يا رسول الله إن نساء جعفر وذكر بكاءهن فأمره بأن ينهاهن، فذهب الرجل ثم أتى فقال قد نهيتهن، وذكر أنهن لم يطعنه، فأمره الثانية أن ينهاهن، فذهب، ثم أتى، فقال والله لقد غلبنني أو غلبننا الشك من محمد بن حوشب  فزعمت أن النبي صلى الله عليه وسلم قال ‏\"‏ فاحث في أفواههن التراب ‏\"‏‏.‏ فقلت أرغم الله أنفك، فوالله ما أنت بفاعل وما تركت رسول الله صلى الله عليه وسلم من العناء‏.‏",
      "text_en": " Narrated Aisha:                     When the news of the martyrdom of Zaid bin Haritha, Ja`far and `Abdullah bin Rawaha came, the Prophet sat down looking sad, and I was looking through the chink of the door. A man came and said, \"O Allah's Apostle! The women of Ja`far,\" and then he mentioned their crying . The Prophet (p.b.u.h) ordered him to stop them from crying. The man went and came back and said, \"I tried to stop them but they disobeyed.\" The Prophet (p.b.u.h) ordered him for the second time to forbid them. He went again and came back and said, \"They did not listen to me, (or \"us\": the sub-narrator Muhammad bin Haushab is in doubt as to which is right). \" (`Aisha added: The Prophet said, \"Put dust in their mouths.\" I said (to that man), \"May Allah stick your nose in the dust (i.e. humiliate you).\" By Allah, you could not (stop the women from crying) to fulfill the order, besides you did not relieve Allah's Apostle from fatigue.\"",
      "usc_msa_ref": "",
      "chain": [
        "20174",
        "20259",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-1349",
      "hadith_no": "1349",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن عبد الله بن حوشب، حدثنا عبد الوهاب، حدثنا خالد، عن عكرمة، عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ حرم الله مكة، فلم تحل لأحد قبلي ولا لأحد بعدي، أحلت لي ساعة من نهار، لا يختلى خلاها، ولا يعضد شجرها، ولا ينفر صيدها، ولا تلتقط لقطتها إلا لمعرف ‏\"‏‏.‏ فقال العباس  رضى الله عنه  إلا الإذخر لصاغتنا وقبورنا‏.‏ فقال ‏\"‏ إلا الإذخر ‏\"‏‏.‏ وقال أبو هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم ‏\"‏ لقبورنا وبيوتنا ‏\"‏‏.‏   وقال أبان بن صالح عن الحسن بن مسلم، عن صفية بنت شيبة، سمعت النبي صلى الله عليه وسلم مثله‏.‏ وقال مجاهد عن طاوس عن ابن عباس  رضى الله عنهما  لقينهم وبيوتهم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"Allah has made Mecca a sanctuary (sacred place) and it was a sanctuary before me and will be so after me. It was made legal for me (to fight in it) for a few hours of the day. None is allowed to uproot its thorny shrubs or to cut its trees or to chase its game or to pick up its fallen things except by a person who announces it publicly.\" On that Al-Abbas said (to the Prophet), \"Except Al- Idhkhir for our goldsmiths and for our graves.\" And so the Prophet added, \"Except Al-Idhkhir. \" And Abu Huraira narrated that the Prophet said, \"Except Al-Idhkhir for our graves and houses.\" And Ibn `Abbas said, \"For their goldsmiths and houses.\"",
      "usc_msa_ref": "",
      "chain": [
        "20174",
        "20259",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-1747",
      "hadith_no": "1747",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن عبد الله بن حوشب، حدثنا هشيم، أخبرنا منصور، عن عطاء، عن ابن عباس  رضى الله عنهما  قال سئل النبي صلى الله عليه وسلم عمن حلق قبل أن يذبح ونحوه‏.‏ فقال ‏\"‏ لا حرج، لا حرج ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet was asked about a person who had his head shaved before slaughtering (his Hadi) (or other similar ceremonies of Hajj). He replied, \"There is no harm, there is no harm.\"",
      "usc_msa_ref": "779",
      "chain": [
        "20174",
        "20468",
        "11067",
        "11029",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-4001",
      "hadith_no": "4001",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن عبد الله بن حوشب، حدثنا عبد الوهاب، حدثنا خالد، عن عكرمة، عن ابن عباس، قال قال النبي صلى الله عليه وسلم يوم بدر ‏\"‏ اللهم أنشدك عهدك ووعدك، اللهم إن شئت لم تعبد ‏\"‏‏.‏ فأخذ أبو بكر بيده فقال حسبك‏.‏ فخرج وهو يقول ‏{‏سيهزم الجمع ويولون الدبر‏}‏",
      "text_en": " Narrated Ibn `Abbas:                     On the day of the battle of Badr, the Prophet said, \"O Allah! I appeal to You (to fulfill) Your Covenant and Promise. O Allah! If Your Will is that none should worship You (then give victory to the pagans).\" Then Abu Bakr took hold of him by the hand and said, \"This is sufficient for you.\" The Prophet came out saying, \"Their multitude will be put to flight and they will show their backs.\" (54.45)",
      "usc_msa_ref": "289",
      "chain": [
        "20174",
        "20259",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-4629",
      "hadith_no": "4629",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن عبد الله بن حوشب، حدثنا إبراهيم بن سعد، عن أبيه، عن عروة، عن عائشة  رضى الله عنها  قالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من نبي يمرض إلا خير بين الدنيا والآخرة ‏\"‏‏.‏ وكان في شكواه الذي قبض فيه أخذته بحة شديدة فسمعته يقول ‏{‏مع الذين أنعم الله عليهم من النبيين والصديقين والشهداء والصالحين‏}‏ فعلمت أنه خير‏.‏",
      "text_en": " Narrated `Aisha:                     I heard Allah's Apostle saying, \"No prophet gets sick but he is given the choice to select either this world or the Hereafter.\" `Aisha added: During his fatal illness, his voice became very husky and I heard him saying: \"In the company of those whom is the Grace of Allah, of the prophets, the Siddiqin (those followers of the prophets who were first and foremost to believe in them), the martyrs and the pious.' (4.69) And from this I came to know that he has been given the option.",
      "usc_msa_ref": "110",
      "chain": [
        "20174",
        "20150",
        "11063",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-4924",
      "hadith_no": "4924",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن عبد الله بن حوشب، حدثنا عبد الوهاب، حدثنا خالد، عن عكرمة، عن ابن عباس،‏.‏ وحدثني محمد، حدثنا عفان بن مسلم، عن وهيب، حدثنا خالد، عن عكرمة، عن ابن عباس  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال وهو في قبة يوم بدر ‏\"‏ اللهم إني أنشدك عهدك ووعدك، اللهم إن تشأ لا تعبد بعد اليوم ‏\"‏‏.‏ فأخذ أبو بكر بيده فقال حسبك يا رسول الله، ألححت على ربك‏.‏ وهو يثب في الدرع، فخرج وهو يقول ‏\"‏ ‏{‏سيهزم الجمع ويولون الدبر‏}‏‏.‏‏\"‏",
      "text_en": " Narrated `Abbas:                     Allah's Apostle while in a tent on the day of the Battle of Badr, said, \"O Allah! I request you (to fulfill) Your promise and contract! O Allah! If You wish that you will not be worshipped henceforth..\" On that Abu Bakr held the Prophet by the hand and said, \"That is enough, O Allah's Apostle You have appealed to your Lord too pressingly,\" while the Prophet was putting on his armor. So Allah's Apostle went out, reciting Their multitude will be put to flight, and they will show their backs.' (54.45)",
      "usc_msa_ref": "398",
      "chain": [
        "20174",
        "20259",
        "11282",
        "11023",
        "11035",
        "30106",
        "20299",
        "11282",
        "11023",
        "17"
      ]
    }
  ],
  "total_hadiths": 7
}