{
  "id": "20179",
  "name": "Muhammad bin Matraf محمد بن مطرف",
  "full_name": "Muhammad bin Matraf محمد بن مطرف",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "160",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "'Asqalan"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Laithi",
      "al-Madni",
      "al-'Asqalani"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11163",
      "name": "Zayd bin Aslam زيد بن أسلم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11048",
      "name": "Muhammad bin al-Munkdar bin 'Abdullah محمد بن المنكدر بن عبد الله بن الهدير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11172",
      "name": "Abu Hazim, Salma bin Dinar سلمة بن دينار أبو حازم الأعرج",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11413",
      "name": "Hsan bin Atyh al-Mharby حسان بن عطية المحاربي مولاهم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10616",
      "name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "28678",
      "name": "Abu al-Husain al-Flstyny أبو الحصين الفلسطيني",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11177",
      "name": "Safwan bin Slym al-Madni صفوان بن سليم المدني أبو عبد الله",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11173",
      "name": "Suhayl bin Abi Salah سهيل بن أبي صالح",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11371",
      "name": "'Uthman bin 'Asim bin Husayn عثمان بن عاصم بن حصين أبو حصين",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "11667",
      "name": "Ibrahim bin Abi Ablh إبراهيم بن أبي عبلة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "28388",
      "name": "'Uthman bin Sa'id bin Kathir bin Dinar عثمان بن سعيد بن كثير بن دينار",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20461",
      "name": "Mubashir bin Isma'i مبشر بن إسماعيل - أبو إسماعيل الكلبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20448",
      "name": "'Ali bin 'Ayyash علي بن عياش",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30232",
      "name": "Sa'id bin Abi Maryam سعيد بن أبي مريم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36649",
      "name": "Muhammad bin 'Isa bin al-Tibaa' محمد بن عيسى بن الطباع",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20386",
      "name": "'Ali bin al-J'ad al-Jauhri علي بن الجعد بن عبيد الجوهري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-662",
      "hadith_no": "662",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا يزيد بن هارون، قال أخبرنا محمد بن مطرف، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من غدا إلى المسجد وراح أعد الله له نزله من الجنة كلما غدا أو راح ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Allah will prepare for him who goes to the mosque (every) morning and in the afternoon (for the congregational prayer) an honorable place in Paradise with good hospitality for (what he has done) every morning and afternoon goings.",
      "usc_msa_ref": "631",
      "chain": [
        "30026",
        "20472",
        "20179",
        "11163",
        "11020",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-938",
      "hadith_no": "938",
      "source": "Sahih Bukhari",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا سعيد بن أبي مريم، قال حدثنا أبو غسان، قال حدثني أبو حازم، عن سهل، قال كانت فينا امرأة تجعل على أربعاء في مزرعة لها سلقا، فكانت إذا كان يوم جمعة تنزع أصول السلق فتجعله في قدر، ثم تجعل عليه قبضة من شعير تطحنها، فتكون أصول السلق عرقه، وكنا ننصرف من صلاة الجمعة فنسلم عليها، فتقرب ذلك الطعام إلينا فنلعقه، وكنا نتمنى يوم الجمعة لطعامها ذلك‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     There was a woman amongst us who had a farm and she used to sow Silq (a kind of vegetable) on the edges of streams in her farm. On Fridays she used to pull out the Silq from its roots and put the roots in a utensil. Then she would put a handful of powdered barley over it and cook it. The roots of the Silq were a substitute for meat. After finishing the Jumua prayer we used to greet her and she would give us that food which we would eat with our hands, and because of that meal, we used to look forward to Friday.",
      "usc_msa_ref": "60",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "id": "sahih-bukhari-941",
      "hadith_no": "941",
      "source": "Sahih Bukhari",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا سعيد بن أبي مريم، قال حدثنا أبو غسان، قال حدثني أبو حازم، عن سهل، قال كنا نصلي مع النبي صلى الله عليه وسلم الجمعة ثم تكون القائلة‏.‏",
      "text_en": " Narrated Sahl:                     We used to offer the Jumua prayer with the Prophet and then take the afternoon nap.",
      "usc_msa_ref": "63",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "id": "sahih-bukhari-1917-2",
      "hadith_no": "1917",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا ابن أبي حازم، عن أبيه، عن سهل بن سعد، ح‏.‏ حدثني سعيد بن أبي مريم، حدثنا أبو غسان، محمد بن مطرف قال حدثني أبو حازم، عن سهل بن سعد، قال أنزلت ‏{‏وكلوا واشربوا حتى يتبين لكم الخيط الأبيض من الخيط الأسود‏}‏ ولم ينزل من الفجر، فكان رجال إذا أرادوا الصوم ربط أحدهم في رجله الخيط الأبيض والخيط الأسود، ولم يزل يأكل حتى يتبين له رؤيتهما، فأنزل الله بعد ‏{‏من الفجر‏}‏ فعلموا أنه إنما يعني الليل والنهار‏.‏",
      "text_en": " Narrated Sahl bin Saud:                     When the following verses were revealed: 'Eat and drink until the white thread appears to you, distinct from the black thread' and of dawn was not revealed, some people who intended to fast, tied black and white threads to their legs and went on eating till they differentiated between the two. Allah then revealed the words, 'of dawn', and it became clear that meant night and day.",
      "usc_msa_ref": "141",
      "chain": [
        "30232",
        "20165",
        "11172",
        "399",
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "id": "sahih-bukhari-2076",
      "hadith_no": "2076",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا علي بن عياش، حدثنا أبو غسان، محمد بن مطرف قال حدثني محمد بن المنكدر، عن جابر بن عبد الله  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ رحم الله رجلا سمحا إذا باع، وإذا اشترى، وإذا اقتضى ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Allah's Apostle said, \"May Allah's mercy be on him who is lenient in his buying, selling, and in demanding back his money.\"",
      "usc_msa_ref": "290",
      "chain": [
        "20448",
        "20179",
        "11048",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-2351",
      "hadith_no": "2351",
      "source": "Sahih Bukhari",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا أبو غسان، قال حدثني أبو حازم، عن سهل بن سعد  رضى الله عنه  قال أتي النبي صلى الله عليه وسلم بقدح فشرب منه، وعن يمينه غلام أصغر القوم، والأشياخ عن يساره فقال ‏\"‏ يا غلام أتأذن لي أن أعطيه الأشياخ ‏\"‏‏.‏ قال ما كنت لأوثر بفضلي منك أحدا يا رسول الله‏.‏ فأعطاه إياه‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     A tumbler (full of milk or water) was brought to the Prophet who drank from it, while on his right side there was sitting a boy who was the youngest of those who were present and on his left side there were old men. The Prophet asked, \"O boy, will you allow me to give it (i.e. the rest of the drink) to the old men?\" The boy said, \"O Allah's Apostle! I will not give preference to anyone over me to drink the rest of it from which you have drunk.\" So, the Prophet gave it to him.",
      "usc_msa_ref": "541",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "id": "sahih-bukhari-2569",
      "hadith_no": "2569",
      "source": "Sahih Bukhari",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا ابن أبي مريم، حدثنا أبو غسان، قال حدثني أبو حازم، عن سهل  رضى الله عنه  أن النبي صلى الله عليه وسلم أرسل إلى امرأة من المهاجرين، وكان لها غلام نجار قال لها ‏\"‏ مري عبدك فليعمل لنا أعواد المنبر ‏\"‏‏.‏ فأمرت عبدها، فذهب فقطع من الطرفاء، فصنع له منبرا، فلما قضاه أرسلت إلى النبي صلى الله عليه وسلم أنه قد قضاه، قال صلى الله عليه وسلم ‏\"‏ أرسلي به إلى ‏\"‏‏.‏ فجاءوا به فاحتمله النبي صلى الله عليه وسلم فوضعه حيث ترون‏.‏",
      "text_en": " Narrated Sahl:                     The Prophet sent for a woman from the emigrants and she had a slave who was a carpenter. The Prophet said to her \"Order your slave to prepare the wood (pieces) for the pulpit.\" So, she ordered her slave who went and cut the wood from the tamarisk and prepared the pulpit, for the Prophet. When he finished the pulpit, the woman informed the Prophet that it had been finished. The Prophet asked her to send that pulpit to him, so they brought it. The Prophet lifted it and placed it at the place in which you see now.\"",
      "usc_msa_ref": "743",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "id": "sahih-bukhari-2690",
      "hadith_no": "2690",
      "source": "Sahih Bukhari",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا أبو غسان، قال حدثني أبو حازم، عن سهل بن سعد  رضى الله عنه أن أناسا، من بني عمرو بن عوف كان بينهم شىء، فخرج إليهم النبي صلى الله عليه وسلم في أناس من أصحابه يصلح بينهم، فحضرت الصلاة، ولم يأت النبي صلى الله عليه وسلم، فجاء بلال، فأذن بلال بالصلاة، ولم يأت النبي صلى الله عليه وسلم فجاء إلى أبي بكر فقال إن النبي صلى الله عليه وسلم حبس، وقد حضرت الصلاة فهل لك أن تؤم الناس فقال نعم إن شئت‏.‏ فأقام الصلاة فتقدم أبو بكر، ثم جاء النبي صلى الله عليه وسلم يمشي في الصفوف، حتى قام في الصف الأول، فأخذ الناس بالتصفيح حتى أكثروا، وكان أبو بكر لا يكاد يلتفت في الصلاة، فالتفت فإذا هو بالنبي صلى الله عليه وسلم وراءه فأشار إليه بيده، فأمره يصلي كما هو، فرفع أبو بكر يده، فحمد الله، ثم رجع القهقرى وراءه حتى دخل في الصف، وتقدم النبي صلى الله عليه وسلم فصلى بالناس، فلما فرغ أقبل على الناس فقال ‏\"‏ يا أيها الناس ما لكم إذا نابكم شىء في صلاتكم أخذتم بالتصفيح، إنما التصفيح للنساء، من نابه شىء في صلاته فليقل سبحان الله، فإنه لا يسمعه أحد إلا التفت، يا أبا بكر ما منعك حين أشرت إليك لم تصل بالناس ‏\"‏‏.‏ فقال ما كان ينبغي لابن أبي قحافة أن يصلي بين يدى النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     There was a dispute amongst the people of the tribe of Bani `Amr bin `Auf. The Prophet went to them along with some of his companions in order to make peace between them. The time for the prayer became due but the Prophet did not turn up; Bilal pronounced the Adhan (i.e. call) for the prayer but the Prophet did not turn up, so Bilal went to Abu Bakr and said, \"The time for the prayer is due and the Prophet i detained, would you lead the people in the prayer?\" Abu Bakr replied, \"Yes, you wish.\" So, Bilal pronounced the Iqama of the prayer and Abu Bakr went ahead (to lead the prayer), but the Prophet came walking among the rows till he joined the first row. The people started clapping and they clapped too much, and Abu Bakr used not to look hither and thither in the prayer, but he turned round and saw the Prophet standing behind him. The Prophet beckoned him with his hand to keep on praying where he was. Abu Bakr raised his hand and praised Allah and then retreated till he came in the (first) row, and the Prophet went ahead and lead the people in the prayer. When the Prophet finished the prayer, he turned towards the people and said, \"O people! When something happens to you during the prayer, you start clapping. Really clapping is (permissible) for women only. If something happens to one of you in his prayer, he should say: 'Subhan Allah', (Glorified be Allah), for whoever hears him (saying so) will direct his attention towards him. O Abu Bakr! What prevented you from leading the people in the prayer when I beckoned to you (to continue)?\" Abu Bakr replied, \"It did not befit the son of Abu Quhafa to lead the prayer in front of the Prophet.",
      "usc_msa_ref": "855",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "id": "sahih-bukhari-3257",
      "hadith_no": "3257",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا محمد بن مطرف، قال حدثني أبو حازم، عن سهل بن سعد  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ في الجنة ثمانية أبواب، فيها باب يسمى الريان لا يدخله إلا الصائمون ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     The Prophet said, \"Paradise has eight gates, and one of them is called Ar-Raiyan through which none will enter but those who observe fasting.\" The Prophet also said, \"If a person spends two different kinds of something (for Allah's Cause), he will be called from the gates of Paradise.\"",
      "usc_msa_ref": "479",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "id": "sahih-bukhari-3456",
      "hadith_no": "3456",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا أبو غسان، قال حدثني زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد  رضى الله عنه  أن النبي صلى الله عليه وسلم قال ‏\"‏ لتتبعن سنن من قبلكم شبرا بشبر، وذراعا بذراع، حتى لو سلكوا جحر ضب لسلكتموه ‏\"‏‏.‏ قلنا يا رسول الله، اليهود والنصارى قال ‏\"‏ فمن ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     The Prophet said, \"You will follow the wrong ways, of your predecessors so completely and literally that if they should go into the hole of a mastigure, you too will go there.\" We said, \"O Allah's Apostle! Do you mean the Jews and the Christians?\" He replied, \"Whom else?\" (Meaning, of course, the Jews and the Christians.)",
      "usc_msa_ref": "662",
      "chain": [
        "30232",
        "20179",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-4552",
      "hadith_no": "4552",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا ابن أبي مريم، حدثنا أبو غسان، محمد بن مطرف حدثني أبو حازم، عن سهل بن سعد، قال وأنزلت ‏{‏وكلوا واشربوا حتى يتبين لكم الخيط الأبيض من الخيط الأسود‏}‏ ولم ينزل ‏{‏من الفجر‏}‏ وكان رجال إذا أرادوا الصوم ربط أحدهم في رجليه الخيط الأبيض والخيط الأسود، ولا يزال يأكل حتى يتبين له رؤيتهما، فأنزل الله بعده ‏{‏من الفجر‏}‏ فعلموا أنما يعني الليل من النهار‏.‏",
      "text_en": " Narrated Sahl bin Sa`d The Verse \"And eat and drink until the white thread appears to you distinct:                     from the black thread.\" was revealed, but: '... of dawn' was not revealed (along with it) so some men, when intending to fast, used to tie their legs, one with white thread and the other with black thread and would keep on eating till they could distinguish one thread from the other. Then Allah revealed' ... of dawn,' whereupon they understood that meant the night and the day.",
      "usc_msa_ref": "",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "id": "sahih-bukhari-5176",
      "hadith_no": "5176",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا أبو غسان، قال حدثني أبو حازم، عن سهل، أن امرأة، عرضت نفسها على النبي صلى الله عليه وسلم فقال له رجل يا رسول الله زوجنيها‏.‏ فقال ‏\"‏ ما عندك ‏\"‏‏.‏ قال ما عندي شىء‏.‏ قال ‏\"‏ اذهب فالتمس ولو خاتما من حديد ‏\"‏‏.‏ فذهب ثم رجع فقال لا والله ما وجدت شيئا، ولا خاتما من حديد، ولكن هذا إزاري ولها نصفه  قال سهل وما له رداء‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ وما تصنع بإزارك إن لبسته لم يكن عليها منه شىء، وإن لبسته لم يكن عليك منه شىء ‏\"‏‏.‏ فجلس الرجل حتى إذا طال مجلسه قام فرآه النبي صلى الله عليه وسلم فدعاه أو دعي له فقال ‏\"‏ ماذا معك من القرآن ‏\"‏‏.‏ فقال معي سورة كذا وسورة كذا لسور يعددها‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أملكناكها بما معك من القرآن ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     A woman presented herself to the Prophet (for marriage). A man said to him, \"O Allah's Apostle! (If you are not in need of her) marry her to me.\" The Prophet said, \"What have you got?\" The man said, \"I have nothing.\" The Prophet said (to him), \"Go and search for something) even if it were an iron ring.\" The man went and returned saying, \"No, I have not found anything, not even an iron ring; but this is my (Izar) waist sheet, and half of it is for her.\" He had no Rida' (upper garment). The Prophet said, \"What will she do with your waist sheet? If you wear it, she will have nothing over her; and if she wears it, you will have nothing over you.\" So the man sat down and when he had sat a long time, he got up (to leave). When the Prophet saw him (leaving), he called him back, or the man was called (for him), and he said to the man, \"How much of the Qur'an do you know (by heart)?\" The man replied I know such Sura and such Sura (by heart),\" naming the Suras The Prophet said, \"I have married her to you for what you know of the Qur'an .\"",
      "usc_msa_ref": "54",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "id": "sahih-bukhari-5237",
      "hadith_no": "5237",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا أبو غسان، قال حدثني أبو حازم، عن سهل، قال لما عرس أبو أسيد الساعدي دعا النبي صلى الله عليه وسلم وأصحابه، فما صنع لهم طعاما ولا قربه إليهم إلا امرأته أم أسيد، بلت تمرات في تور من حجارة من الليل، فلما فرغ النبي صلى الله عليه وسلم من الطعام أماثته له فسقته، تتحفه بذلك‏.‏",
      "text_en": " Narrated Sahl:                     When Abu Usaid As-Sa`idi got married, he invited the Prophet and his companions. None prepared the food for them and brought it to them but his wife. She soaked some dates in water in a stone pot overnight, and when the Prophet had finished his food, she provided him with that drink (of soaked dates).",
      "usc_msa_ref": "111",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "id": "sahih-bukhari-5465",
      "hadith_no": "5465",
      "source": "Sahih Bukhari",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا أبو غسان، قال حدثني أبو حازم، أنه سأل سهلا هل رأيتم في زمان النبي صلى الله عليه وسلم النقي قال لا‏.‏ فقلت فهل كنتم تنخلون الشعير قال لا ولكن كنا ننفخه‏.‏",
      "text_en": " Narrated Abu Hazim:                     that he asked Sahl, \"Did you use white flour during the lifetime of the Prophet ?\" Sahl replied, \"No. Hazim asked, \"Did you use to sift barley flour?\" He said, \"No, but we used to blow off the husk (of the barley).",
      "usc_msa_ref": "321",
      "chain": [
        "30232",
        "20179",
        "11172"
      ]
    },
    {
      "id": "sahih-bukhari-5499",
      "hadith_no": "5499",
      "source": "Sahih Bukhari",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا أبو غسان، قال حدثني أبو حازم، عن إبراهيم بن عبد الرحمن بن عبد الله بن أبي ربيعة، عن جابر بن عبد الله، رضى الله عنهما قال كان بالمدينة يهودي وكان يسلفني في تمري إلى الجداد، وكانت لجابر الأرض التي بطريق رومة فجلست، فخلا عاما فجاءني اليهودي عند الجداد، ولم أجد منها شيئا، فجعلت أستنظره إلى قابل فيأبى، فأخبر بذلك النبي صلى الله عليه وسلم فقال لأصحابه ‏\"‏ امشوا نستنظر لجابر من اليهودي ‏\"‏‏.‏ فجاءوني في نخلي فجعل النبي صلى الله عليه وسلم يكلم اليهودي فيقول أبا القاسم لا أنظره‏.‏ فلما رأى النبي صلى الله عليه وسلم قام فطاف في النخل، ثم جاءه فكلمه فأبى فقمت فجئت بقليل رطب فوضعته بين يدى النبي صلى الله عليه وسلم فأكل ثم قال ‏\"‏ أين عريشك يا جابر ‏\"‏‏.‏ فأخبرته فقال ‏\"‏ افرش لي فيه ‏\"‏‏.‏ ففرشته فدخل فرقد، ثم استيقظ فجئته بقبضة أخرى فأكل منها، ثم قام فكلم اليهودي فأبى عليه فقام في الرطاب في النخل الثانية ثم قال ‏\"‏ يا جابر جد واقض ‏\"‏‏.‏ فوقف في الجداد فجددت منها ما قضيته وفضل منه فخرجت حتى جئت النبي صلى الله عليه وسلم فبشرته فقال ‏\"‏ أشهد أني رسول الله ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     There was a Jew in Medina who used to lend me money up to the season of plucking dates. (Jabir had a piece of land which was on the way to Ruma). That year the land was not promising, so the payment of the debt was delayed one year. The Jew came to me at the time of plucking, but gathered nothing from my land. I asked him to give me one year respite, but he refused. This news reached the Prophet whereupon he said to his companions, \"Let us go and ask the Jew for respite for Jabir.\" All of them came to me in my garden, and the Prophet started speaking to the Jew, but he Jew said, \"O Abu Qasim! I will not grant him respite.\" When the Prophet saw the Jew's attitude, he stood up and walked all around the garden and came again and talked to the Jew, but the Jew refused his request. I got up and brought some ripe fresh dates and put it in front of the Prophet. He ate and then said to me, \"Where is your hut, O Jabir?\" I informed him, and he said, \"Spread out a bed for me in it.\" I spread out a bed, and he entered and slept. When he woke up, I brought some dates to him again and he ate of it and then got up and talked to the Jew again, but the Jew again refused his request. Then the Prophet got up for the second time amidst the palm trees loaded with fresh dates, and said, \"O Jabir! Pluck dates to repay your debt.\" The Jew remained with me while I was plucking the dates, till I paid him all his right, yet there remained extra quantity of dates. So I went out and proceeded till I reached the Prophet and informed him of the good news, whereupon he said, \"I testify that I am Allah's Apostle.\"",
      "usc_msa_ref": "354",
      "chain": [
        "30232",
        "20179",
        "11172",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-5697",
      "hadith_no": "5697",
      "source": "Sahih Bukhari",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا أبو غسان، قال حدثني أبو حازم، عن سهل بن سعد  رضى الله عنه  قال ذكر للنبي صلى الله عليه وسلم امرأة من العرب، فأمر أبا أسيد الساعدي أن يرسل إليها فأرسل إليها، فقدمت فنزلت في أجم بني ساعدة، فخرج النبي صلى الله عليه وسلم حتى جاءها فدخل عليها فإذا امرأة منكسة رأسها، فلما كلمها النبي صلى الله عليه وسلم قالت أعوذ بالله منك‏.‏ فقال ‏\"‏ قد أعذتك مني ‏\"‏‏.‏ فقالوا لها أتدرين من هذا قالت لا‏.‏ قالوا هذا رسول الله صلى الله عليه وسلم جاء ليخطبك‏.‏ قالت كنت أنا أشقى من ذلك‏.‏ فأقبل النبي صلى الله عليه وسلم يومئذ حتى جلس في سقيفة بني ساعدة هو وأصحابه، ثم قال ‏\"‏ اسقنا يا سهل ‏\"‏‏.‏ فخرجت لهم بهذا القدح فأسقيتهم فيه، فأخرج لنا سهل ذلك القدح فشربنا منه‏.‏ قال ثم استوهبه عمر بن عبد العزيز بعد ذلك فوهبه له‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     An Arab lady was mentioned to the Prophet so he asked Abu Usaid As-Sa`idi to send for her, and he sent for her and she came and stayed in the castle of Bani Sa`ida. The Prophet came out and went to her and entered upon her. Behold, it was a lady sitting with a drooping head. When the Prophet spoke to her, she said, \"I seek refuge with Allah from you.\" He said, \"I grant you refuge from me.\" They said to her, \"Do you know who this is?\" She said, \"No.\" They said, \"This is Allah's Apostle who has come to command your hand in marriage.\" She said, \"I am very unlucky to lose this chance.\" Then the Prophet and his companions went towards the shed of Bani Sa`ida and sat there. Then he said, \"Give us water, O Sahl!\" So I took out this drinking bowl and gave them water in it. The sub-narrator added: Sahl took out for us that very drinking bowl and we all drank from it. Later on `Umar bin `Abdul `Aziz requested Sahl to give it to him as a present, and he gave it to him as a present.",
      "usc_msa_ref": "541",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "id": "sahih-bukhari-6065",
      "hadith_no": "6065",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا ابن أبي مريم، حدثنا أبو غسان، قال حدثني زيد بن أسلم، عن أبيه، عن عمر بن الخطاب  رضى الله عنه  قدم على النبي صلى الله عليه وسلم سبى، فإذا امرأة من السبى قد تحلب ثديها تسقي، إذا وجدت صبيا في السبى أخذته فألصقته ببطنها وأرضعته، فقال لنا النبي صلى الله عليه وسلم ‏\"‏ أترون هذه طارحة ولدها في النار ‏\"‏‏.‏ قلنا لا وهى تقدر على أن لا تطرحه‏.‏ فقال ‏\"‏ الله أرحم بعباده من هذه بولدها ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Al-Khattab:                     Some Sabi (i.e. war prisoners, children and woman only) were brought before the Prophet and behold, a woman amongst them was milking her breasts to feed and whenever she found a child amongst the captives, she took it over her chest and nursed it (she had lost her child but later she found him) the Prophet said to us, \"Do you think that this lady can throw her son in the fire?\" We replied, \"No, if she has the power not to throw it (in the fire).\" The Prophet then said, \"Allah is more merciful to His slaves than this lady to her son.\"",
      "usc_msa_ref": "28",
      "chain": [
        "30232",
        "20179",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "id": "sahih-bukhari-6090",
      "hadith_no": "6090",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا علي بن عياش، حدثنا أبو غسان، قال حدثني محمد بن المنكدر، عن جابر بن عبد الله  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ كل معروف صدقة ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet said, Enjoining, all that is good is a Sadaqa.\"",
      "usc_msa_ref": "50",
      "chain": [
        "20448",
        "20179",
        "11048",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-6105",
      "hadith_no": "6105",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا أبو غسان، قال حدثني أبو حازم، عن سهل بن سعد، قال جاءت امرأة إلى النبي صلى الله عليه وسلم ببردة‏.‏ فقال سهل للقوم أتدرون ما البردة فقال القوم هي شملة‏.‏ فقال سهل هي شملة منسوجة فيها حاشيتها  فقالت يا رسول الله أكسوك هذه‏.‏ فأخذها النبي صلى الله عليه وسلم محتاجا إليها، فلبسها، فرآها عليه رجل من الصحابة فقال يا رسول الله ما أحسن هذه فاكسنيها‏.‏ فقال ‏\"‏ نعم ‏\"‏‏.‏ فلما قام النبي صلى الله عليه وسلم لامه أصحابه قالوا ما أحسنت حين رأيت النبي صلى الله عليه وسلم أخذها محتاجا إليها، ثم سألته إياها، وقد عرفت أنه لا يسأل شيئا فيمنعه‏.‏ فقال رجوت بركتها حين لبسها النبي صلى الله عليه وسلم لعلي أكفن فيها‏.‏",
      "text_en": " Narrated Abu Hazim:                     Sahl bin Sa`d said that a woman brought a Burda (sheet) to the Prophet. Sahl asked the people, \"Do you know what is a Burda?\" The people replied, \"It is a 'Shamla', a sheet with a fringe.\" That woman said, \"O Allah's Apostle! I have brought it so that you may wear it.\" So the Prophet took it because he was in need of it and wore it. A man among his companions, seeing him wearing it, said, \"O Allah's Apostle! Please give it to me to wear.\" The Prophet said, \"Yes.\" (and gave him that sheet). When the Prophet left, the man was blamed by his companions who said, \"It was not nice on your part to ask the Prophet for it while you know that he took it because he was in need of it, and you also know that he (the Prophet) never turns down anybody's request that he might be asked for.\" That man said, \"I just wanted to have its blessings as the Prophet had put it on, so l hoped that I might be shrouded in it.\"",
      "usc_msa_ref": "62",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "id": "sahih-bukhari-6262",
      "hadith_no": "6262",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا أبو غسان، قال حدثني أبو حازم، عن سهل، قال أتي بالمنذر بن أبي أسيد إلى النبي صلى الله عليه وسلم حين ولد، فوضعه على فخذه وأبو أسيد جالس، فلها النبي صلى الله عليه وسلم بشىء بين يديه، فأمر أبو أسيد بابنه فاحتمل من فخذ النبي صلى الله عليه وسلم فاستفاق النبي صلى الله عليه وسلم فقال ‏\"‏ أين الصبي ‏\"‏‏.‏ فقال أبو أسيد قلبناه يا رسول الله‏.‏ قال ‏\"‏ ما اسمه ‏\"‏‏.‏ قال فلان‏.‏ قال ‏\"‏ ولكن أسمه المنذر ‏\"‏‏.‏ فسماه يومئذ المنذر‏.‏",
      "text_en": " Narrated Sahl:                     When Al-Mundhir bin Abu Usaid was born, he was brought to the Prophet who placed him on his thigh. While Abu Usaid was sitting there, the Prophet was busy with something in his hands so Abu Usaid told someone to take his son from the thigh of the Prophet . When the Prophet finished his job (with which he was busy), he said, \"Where is the boy?\" Abu Usaid replied, \"We have sent him home.\" The Prophet said, \"What is his name?\" Abu Usaid said, \"(His name is) so-and-so. \" The Prophet said, \"No, his name is Al-Mundhir.\" So he called him Al-Mundhir from that day.",
      "usc_msa_ref": "211",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "id": "sahih-bukhari-6572",
      "hadith_no": "6572",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا علي بن عياش، حدثنا أبو غسان، قال حدثني أبو حازم، عن سهل بن سعد الساعدي، قال نظر النبي صلى الله عليه وسلم إلى رجل يقاتل المشركين، وكان من أعظم المسلمين غناء عنهم فقال ‏\"‏ من أحب أن ينظر إلى رجل من أهل النار فلينظر إلى هذا ‏\"‏‏.‏ فتبعه رجل فلم يزل على ذلك حتى جرح، فاستعجل الموت‏.‏ فقال بذبابة سيفه، فوضعه بين ثدييه، فتحامل عليه، حتى خرج من بين كتفيه‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن العبد ليعمل فيما يرى الناس عمل أهل الجنة، وإنه لمن أهل النار، ويعمل فيما يرى الناس عمل أهل النار وهو من أهل الجنة، وإنما الأعمال بخواتيمها ‏\"‏‏.‏",
      "text_en": " Narrated Sa`d bin Sahl As-Sa`idi:                     The Prophet looked at a man fighting against the pagans and he was one of the most competent persons fighting on behalf of the Muslims. The Prophet said, \"Let him who wants to look at a man from the dwellers of the (Hell) Fire, look at this (man).\" Another man followed him and kept on following him till he (the fighter) was injured and, seeking to die quickly, he placed the blade tip of his sword between his breasts and leaned over it till it passed through his shoulders (i.e., committed suicide).\" The Prophet added, \"A person may do deeds that seem to the people as the deeds of the people of Paradise while in fact, he is from the dwellers of the (Hell) Fire: and similarly a person may do deeds that seem to the people as the deeds of the people of the (Hell) Fire while in fact, he is from the dwellers of Paradise. Verily, the (results of) deeds done, depend upon the last actions.\"",
      "usc_msa_ref": "500",
      "chain": [
        "20448",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "id": "sahih-bukhari-6582",
      "hadith_no": "6582",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا أبو غسان، حدثنا أبو حازم، عن سهل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ بعثت أنا والساعة هكذا ‏\"‏‏.‏ ويشير بإصبعيه فيمد بهما‏.‏",
      "text_en": " Narrated Sahl:                     Allah's Apostle said, \"I have been sent and the Hour (is at hand) as these two,\" showing his two fingers and sticking (separating) them out.",
      "usc_msa_ref": "510",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "id": "sahih-bukhari-6623",
      "hadith_no": "6623",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا أبو غسان، قال حدثني أبو حازم، عن سهل بن سعد، قال قال النبي صلى الله عليه وسلم ‏\"‏ ليدخلن الجنة من أمتي سبعون ألفا أو سبعمائة ألف  شك في أحدهما  متماسكين، آخذ بعضهم ببعض، حتى يدخل أولهم وآخرهم الجنة، ووجوههم على ضوء القمر ليلة البدر ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     The Prophet said, \"Seventy-thousand or seven-hundred thousand of my followers (the narrator is in doubt as to the correct number) will enter Paradise holding each other till the first and the last of them enter Paradise at the same time, and their faces will have a glitter like that of the moon at night when it is full.\"",
      "usc_msa_ref": "551",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "id": "sahih-bukhari-6663",
      "hadith_no": "6663",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا محمد بن مطرف، حدثني أبو حازم، عن سهل بن سعد، قال قال النبي صلى الله عليه وسلم ‏\"‏ إني فرطكم على الحوض، من مر على شرب، ومن شرب لم يظمأ أبدا، ليردن على أقوام أعرفهم ويعرفوني، ثم يحال بيني وبينهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Hazim from Sahl bin Sa`d:                     The Prophet said, \"I am your predecessor (forerunner) at the Lake-Fount, and whoever will pass by there, he will drink from it and whoever will drink from it, he will never be thirsty. There will come to me some people whom I will recognize, and they will recognize me, but a barrier will be placed between me and them.\" Abu Hazim added: An-Nu`man bin Abi `Aiyash, on hearing me, said. \"Did you hear this from Sahl?\" I said, \"Yes.\" He said, \" I bear witness that I heard Abu Sa`id Al-Khudri saying the same, adding that the Prophet said: 'I will say: They are of me (i.e. my followers). It will be said, 'You do not know what they innovated (new things) in the religion after you left'. I will say, 'Far removed, far removed (from mercy), those who changed (their religion) after me.\" Abu Huraira narrated that the Prophet said, \"On the Day of Resurrection a group of companions will come to me, but will be driven away from the Lake-Fount, and I will say, 'O Lord (those are) my companions!' It will be said, 'You have no knowledge as to what they innovated after you left; they turned apostate as renegades (reverted from Islam).",
      "usc_msa_ref": "585",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "id": "sahih-bukhari-6687",
      "hadith_no": "6687",
      "source": "Sahih Bukhari",
      "chapter": "Divine Will (Al-Qadar) - كتاب القدر",
      "chapter_no": "82",
      "text_ar": "حدثنا سعيد بن أبي مريم، حدثنا أبو غسان، حدثني أبو حازم، عن سهل، أن رجلا، من أعظم المسلمين غناء عن المسلمين في غزوة غزاها مع النبي صلى الله عليه وسلم فنظر النبي صلى الله عليه وسلم فقال ‏\"‏ من أحب أن ينظر إلى الرجل من أهل النار فلينظر إلى هذا ‏\"‏‏.‏ فاتبعه رجل من القوم، وهو على تلك الحال من أشد الناس على المشركين، حتى جرح فاستعجل الموت، فجعل ذبابة سيفه بين ثدييه حتى خرج من بين كتفيه فأقبل الرجل إلى النبي صلى الله عليه وسلم مسرعا فقال أشهد أنك رسول الله‏.‏ فقال ‏\"‏ وما ذاك ‏\"‏‏.‏ قال قلت لفلان ‏\"‏ من أحب أن ينظر إلى رجل من أهل النار فلينظر إليه ‏\"‏‏.‏ وكان من أعظمنا غناء عن المسلمين، فعرفت أنه لا يموت على ذلك فلما جرح استعجل الموت فقتل نفسه‏.‏ فقال النبي صلى الله عليه وسلم عند ذلك ‏\"‏ إن العبد ليعمل عمل أهل النار، وإنه من أهل الجنة، ويعمل عمل أهل الجنة، وإنه من أهل النار، وإنما الأعمال بالخواتيم ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     There was a man who fought most bravely of all the Muslims on behalf of the Muslims in a battle (Ghazwa) in the company of the Prophet. The Prophet looked at him and said. \"If anyone would like to see a man from the people of the Fire, let him look at this (brave man).\" On that, a man from the People (Muslims) followed him, and he was in that state i.e., fighting fiercely against the pagans till he was wounded, and then he hastened to end his life by placing his sword between his breasts (and pressed it with great force) till it came out between his shoulders. Then the man (who was watching that person) went quickly to the Prophet and said, \"I testify that you are Allah's Apostle!\" The Prophet asked him, \"Why do you say that?\" He said, \"You said about so-and-so, 'If anyone would like to see a man from the people of the Fire, he should look at him.' He fought most bravely of all of us on behalf of the Muslims and I knew that he would not die as a Muslim (Martyr). So when he got wounded, he hastened to die and committed suicide.\" There-upon the Prophet said, \"A man may do the deeds of the people of the Fire while in fact he is one of the people of Paradise, and he may do the deeds of the people of Paradise while in fact he belongs to the people of Fire, and verily, (the rewards of) the deeds are decided by the last actions (deeds)\".",
      "usc_msa_ref": "604",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "id": "sahih-bukhari-6800",
      "hadith_no": "6800",
      "source": "Sahih Bukhari",
      "chapter": "Expiation for Unfulfilled Oaths - كتاب كفارات الأيمان",
      "chapter_no": "84",
      "text_ar": "حدثنا محمد بن عبد الرحيم، حدثنا داود بن رشيد، حدثنا الوليد بن مسلم، عن أبي غسان، محمد بن مطرف عن زيد بن أسلم، عن علي بن حسين، عن سعيد ابن مرجانة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من أعتق رقبة مسلمة، أعتق الله بكل عضو منه عضوا من النار، حتى فرجه بفرجه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"If somebody manumits a Muslim slave, Allah will save from the Fire every part of his body for freeing the corresponding parts of the slave's body, even his private parts will be saved from the Fire) because of freeing the slave's private parts.\"",
      "usc_msa_ref": "706",
      "chain": [
        "30272",
        "30248",
        "20733",
        "20179",
        "11163",
        "11045",
        "11571",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-7420",
      "hadith_no": "7420",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا ابن أبي مريم، حدثنا أبو غسان، حدثني أبو حازم، عن سهل، أنه كان بين جدار المسجد مما يلي القبلة وبين المنبر ممر الشاة‏.‏",
      "text_en": " Narrated Sahl:                     The distance between the pulpit and the wall of the mosque on the side of the Qibla was just sufficient for a sheep to pass through.",
      "usc_msa_ref": "434",
      "chain": [
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "id": "sahih-muslim-379-2",
      "hadith_no": "379",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني أبو غسان المسمعي، مالك بن عبد الواحد وإسحاق بن إبراهيم قال أبو غسان حدثنا معاذ، وقال، إسحاق أخبرنا معاذ بن هشام، صاحب الدستوائي وحدثني أبي، عن عامر الأحول، عن مكحول، عن عبد الله بن محيريز، عن أبي محذورة، أن نبي الله صلى الله عليه وسلم علمه هذا الأذان ‏\"‏ الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله - ثم يعود فيقول - أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة - مرتين - حى على الفلاح - مرتين ‏\"‏ ‏.‏ زاد إسحاق ‏\"‏ الله أكبر الله أكبر لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " Abu Mahdhura said that the Apostle of Allah (may peace be upon him) taught him Adhan like this:                      Allah is the Greatest, Allah is the Greatest; I testify that there is no god but Allah, I testify that there is no god but Allah; I testify that Muhammad Is the Messenger of Allah, I testify that Muhammad is the Messenger of Allah, and it should be again repeated: I testify that there is no god but Allah, I testify that there is no god but Allah; I testify that Muhammad Is the Messenger of Allah, I testify that Muhammad is the Messenger of Allah. Come to the prayer (twice). Come to the prayer (twice). Ishaq added: Allah is the Greatest, Allah is the Greatest; there Is no god but Allah.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "20179",
        "32",
        "30312",
        "20287",
        "20295",
        "10693",
        "11066",
        "11253",
        "2416"
      ]
    },
    {
      "id": "sahih-muslim-1462",
      "hadith_no": "1462",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني أبو غسان المسمعي، ومحمد بن المثنى، عن معاذ بن هشام، - قال أبو غسان حدثنا معاذ بن هشام، - حدثني أبي، عن يحيى بن أبي كثير، قال حدثنا أبو سلمة بن عبد الرحمن، عن جابر بن عبد الله، أن عمر بن الخطاب، يوم الخندق جعل يسب كفار قريش وقال يا رسول الله والله ما كدت أن أصلي العصر حتى كادت أن تغرب الشمس ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فوالله إن صليتها ‏\"‏ ‏.‏ فنزلنا إلى بطحان فتوضأ رسول الله صلى الله عليه وسلم وتوضأنا فصلى رسول الله صلى الله عليه وسلم العصر بعد ما غربت الشمس ثم صلى بعدها المغرب ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported that Umar b. al-Khattab had been cursing the pagans of the Quraish an the day (of the Battle) of Khandaq (Ditch). (He came to the Holy Prophet) and said:                      Messenger of Allah, by God, I could not say. the 'Asr prayer till the sun set. Upon this the Messenger (may peace be upon him) said: By Allah I, too, have not observed it. So we went to a valley. The Messenger of Allah (may peace be upon him) performed ablution and we too performed ablution, and then the Messenger of Allah (may peace be upon him) said the 'Asr prayer after the sun had set. and then said the evening prayer after it.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "30170",
        "20287",
        "20179",
        "20287",
        "20295",
        "11449",
        "10567",
        "34",
        "3"
      ]
    },
    {
      "id": "sahih-muslim-1556",
      "hadith_no": "1556",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، قالا حدثنا يزيد بن هارون، أخبرنا محمد بن مطرف، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏\"‏ من غدا إلى المسجد أو راح أعد الله له في الجنة نزلا كلما غدا أو راح ‏\"‏ ‏.‏",
      "text_en": " Ata' b. Yasar reported, on the authority of Abu Huraira, the Apostle of Allah (may peace be upon him) as saying:                      He who went towards the mosque in the morning or evening, Allah would arrange a feast for him morning or evening in Paradise.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30022",
        "20472",
        "20179",
        "11163",
        "11020",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-2587",
      "hadith_no": "2587",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني محمد بن سهل التميمي، وأبو بكر بن إسحاق قالا حدثنا ابن أبي مريم، أخبرنا أبو غسان، حدثني أبو حازم، عن سهل بن سعد، - رضى الله عنه - قال لما نزلت هذه الآية ‏{‏ وكلوا واشربوا حتى يتبين لكم الخيط الأبيض من الخيط الأسود‏}‏ قال فكان الرجل إذا أراد الصوم ربط أحدهم في رجليه الخيط الأسود والخيط الأبيض فلا يزال يأكل ويشرب حتى يتبين له رئيهما فأنزل الله بعد ذلك ‏{‏ من الفجر‏}‏ فعلموا أنما يعني بذلك الليل والنهار ‏.‏",
      "text_en": " Sahl b. Sa'd (Allah be pleased with him) said:                      When this verse was reveal- ed.\" Eat and drink till the white streak becomes distinct from the dark streak for you,\" the person who decided to observe fast tied on one of his feet a black thread and on the other a white thread. And he went on eating and drinking till he could distinguish (between their colour) on seeing them. It was after this that Allah reveal- ed (the words): min al-fajr. And they (the Muslims) came to know that (the word khait) refers to the night and day.",
      "usc_msa_ref": "",
      "chain": [
        "11108",
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "id": "sahih-muslim-3328",
      "hadith_no": "3328",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني أبو غسان المسمعي، ومحمد بن بشار، جميعا عن معاذ بن هشام، - قال أبو غسان حدثنا معاذ، - حدثني أبي، عن قتادة، عن قزعة، عن أبي سعيد الخدري، أن نبي الله صلى الله عليه وسلم قال ‏\"‏ لا تسافر امرأة فوق ثلاث ليال إلا مع ذي محرم ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id Khudri (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) as saying:                      A woman should not set out on a journey extending beyond three nights but with a Mahram.",
      "usc_msa_ref": "",
      "chain": [
        "30456",
        "30160",
        "20287",
        "20179",
        "32",
        "11019",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-3869",
      "hadith_no": "3869",
      "source": "Sahih Muslim",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "وحدثنا داود بن رشيد، حدثنا الوليد بن مسلم، عن محمد بن مطرف أبي غسان، المدني عن زيد بن أسلم، عن علي بن حسين، عن سعيد ابن مرجانة، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أعتق رقبة أعتق الله بكل عضو منها عضوا من أعضائه من النار حتى فرجه بفرجه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace benpon him) as saying:                      He who emancipates a slave, Allah will set free from Hell every limb (of his body) for every limb of his (slave's) body, even his private parts.",
      "usc_msa_ref": "",
      "chain": [
        "30248",
        "20733",
        "20179",
        "11163",
        "11045",
        "11571",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-5354",
      "hadith_no": "5354",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثني محمد بن سهل التميمي، وأبو بكر بن إسحاق - قال أبو بكر أخبرنا  وقال ابن سهل، حدثنا - ابن أبي مريم، أخبرنا محمد، - وهو ابن مطرف أبو غسان - أخبرني أبو حازم، عن سهل بن سعد، قال ذكر لرسول الله صلى الله عليه وسلم امرأة من العرب فأمر أبا أسيد أن يرسل إليها فأرسل إليها فقدمت فنزلت في أجم بني ساعدة فخرج رسول الله صلى الله عليه وسلم حتى جاءها فدخل عليها فإذا امرأة منكسة رأسها فلما كلمها رسول الله صلى الله عليه وسلم قالت أعوذ بالله منك قال ‏\"‏ قد أعذتك مني ‏\"‏ ‏.‏ فقالوا لها أتدرين من هذا فقالت لا ‏.‏ فقالوا هذا رسول الله صلى الله عليه وسلم جاءك ليخطبك قالت أنا كنت أشقى من ذلك ‏.‏ قال سهل فأقبل رسول الله صلى الله عليه وسلم يومئذ حتى جلس في سقيفة بني ساعدة هو وأصحابه ثم قال ‏\"‏ اسقنا ‏\"‏ ‏.‏ لسهل قال فأخرجت لهم هذا القدح فأسقيتهم فيه ‏.‏ قال أبو حازم فأخرج لنا سهل ذلك القدح فشربنا فيه قال ثم استوهبه بعد ذلك عمر بن عبد العزيز فوهبه له ‏.‏ وفي رواية أبي بكر بن إسحاق قال ‏\"‏ اسقنا يا سهل ‏\"‏ ‏.‏",
      "text_en": " Sahl b. Sa'd reported:                      An Arab woman was mentioned before Allah's Messenger (may peace be upon him). He commanded Abu Usaid to send a message to her and he (accordingly) sent a message to her. She came and stayed in the fortresses of Banu Sa'idah. Allah's Messenger (may peace be upon him) went out until he came to her while she was (at that time) sitting with her head downcast. When Allah's Messenger (may peace be upon him) talked to her, she said: I seek refuge with Allah from you. Thereupon he said: I (have decided to) keep you away from me. They (the people near her) said: Do you know who he is? She said: No. They said: He is the Messenger of Allah (may peace be upon him). He came to you in order to give you the proposal of marriage. She said: Then I am the most unfortunate woman because of this (i. e. my defiance). Sahl said: Allah's. Messenger (may peace be upon him) then set forth on that day until he sat in the Saqifa of Banu Sa'idah along with his Companions. He then said to Sahl: Serve us drink. He (Sahl) said: I brought out for them this bowl (containing drink) and served them this. Abu Hazim said: Sahl brought out this cup for us and we also drank from that. Then 'Umar b. 'Abd al-'Aziz asked him to give that (cup) as a gift to him and he gave (it to) him as a gift. In the narration of Abu Bakr b. Ishaq (the words) are:\" Sahl, serve us drink.\"",
      "usc_msa_ref": "",
      "chain": [
        "11108",
        "20436",
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "id": "sahih-muslim-5745",
      "hadith_no": "5745",
      "source": "Sahih Muslim",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثني محمد بن سهل التميمي، وأبو بكر بن إسحاق قالا حدثنا ابن أبي مريم، حدثنا محمد، - وهو ابن مطرف أبو غسان - حدثني أبو حازم، عن سهل بن سعد، قال أتي بالمنذر بن أبي أسيد إلى رسول الله صلى الله عليه وسلم حين ولد فوضعه النبي صلى الله عليه وسلم على فخذه وأبو أسيد جالس فلهي النبي صلى الله عليه وسلم بشىء بين يديه فأمر أبو أسيد بابنه فاحتمل من على فخذ رسول الله صلى الله عليه وسلم فأقلبوه فاستفاق رسول الله صلى الله عليه وسلم فقال ‏\"‏ أين الصبي ‏\"‏ ‏.‏ فقال أبو أسيد أقلبناه يا رسول الله ‏.‏ فقال ‏\"‏ ما اسمه ‏\"‏ ‏.‏ قال فلان يا رسول الله ‏.‏ قال ‏\"‏ لا ولكن اسمه المنذر ‏\"‏ ‏.‏ فسماه يومئذ المنذر ‏.‏",
      "text_en": " Sahl b. Sa'd reported that Mundhir b. Aba Usaid was brought to Allah's Messenger (may peace be upon him) at the time of his birth Allah's. Apostle (may peace be upon him) placed him on his thigh and Abfi Usaid kept sitting there. Allah's Apostle (may peace be upon him) had been occupied with something else before him. Abu Usaid commanded his child to be lifted from the lap of Allah's Messenger (may peace be upon him) and so he was lifted. When Allah's Messenger (may peace be upon him) had finished the work he said:                      Where is the child? Abd Usaid said: Allah's Messenger, we took him away. He said: What is his name? He said; Allah's Messenger, it is so and so, whereupon he (the Holy Prophet) said: Nay, his name is Mundhir, and named him Mundhir on that day.",
      "usc_msa_ref": "",
      "chain": [
        "11108",
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "id": "sahih-muslim-6953",
      "hadith_no": "6953",
      "source": "Sahih Muslim",
      "chapter": "The Book of Knowledge - كتاب العلم",
      "chapter_no": "48",
      "text_ar": "وحدثنا عدة، من أصحابنا عن سعيد بن أبي مريم، أخبرنا أبو غسان، - وهو محمد بن مطرف - عن زيد بن أسلم، بهذا الإسناد نحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30232",
        "20179",
        "11163"
      ]
    },
    {
      "id": "sahih-muslim-6954",
      "hadith_no": "6954",
      "source": "Sahih Muslim",
      "chapter": "The Book of Knowledge - كتاب العلم",
      "chapter_no": "48",
      "text_ar": "قال أبو إسحاق إبراهيم بن محمد حدثنا محمد بن يحيى، حدثنا ابن أبي مريم، حدثنا أبو غسان، حدثنا زيد بن أسلم، عن عطاء بن يسار، ‏.‏ وذكر الحديث نحوه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Ata' b. Yasir through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "30232",
        "20179",
        "11163",
        "11020"
      ]
    },
    {
      "id": "sahih-muslim-7154",
      "hadith_no": "7154",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثني الحسن بن علي الحلواني، ومحمد بن سهل التميمي، - واللفظ لحسن - حدثنا ابن أبي مريم، حدثنا أبو غسان، حدثني زيد بن أسلم، عن أبيه، عن عمر بن الخطاب، أنه قال قدم على رسول الله صلى الله عليه وسلم بسبى فإذا امرأة من السبى تبتغي إذا وجدت صبيا في السبى أخذته فألصقته ببطنها وأرضعته فقال لنا رسول الله صلى الله عليه وسلم ‏\"‏ أترون هذه المرأة طارحة ولدها في النار ‏\"‏ ‏.‏ قلنا لا والله وهي تقدر على أن لا تطرحه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لله أرحم بعباده من هذه بولدها ‏\"‏ ‏.‏",
      "text_en": " 'Umar b. Khattab reported that there were brought some prisoners to Allah's Messenger (may peace be upon him) amongst whom there was also a woman, who was searching (for someone) and when she found a child amongst the prisoners, she took hold of it, pressed it against her chest and provided it suck. Thereupon Allah's Messenger (may peace be upon him) said:                      Do you think this woman would ever afford to throw her child in the Fire? We said: By Allah, so far as it lies in her power, she would never throw the child in Fire. ' Thereupon Allah's Messenger (may peace be upon him) said: Allah is more kind to His servants than this woman is to her child.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "30232",
        "20179",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "id": "sunan-abi-daud-425",
      "hadith_no": "425",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن حرب الواسطي، حدثنا يزيد، - يعني ابن هارون - حدثنا محمد بن مطرف، عن زيد بن أسلم، عن عطاء بن يسار، عن عبد الله بن الصنابحي، قال زعم أبو محمد أن الوتر، واجب، فقال عبادة بن الصامت كذب أبو محمد أشهد أني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ خمس صلوات افترضهن الله تعالى من أحسن وضوءهن وصلاهن لوقتهن وأتم ركوعهن وخشوعهن كان له على الله عهد أن يغفر له ومن لم يفعل فليس له على الله عهد إن شاء غفر له وإن شاء عذبه ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Sunabihi:                     AbuMuhammad fancies that witr prayer is essential. (Hearing this) Ubadah ibn as-Samit said: AbuMuhammad was wrong. I bear witness that I heard the Messenger of Allah (ﷺ) say: Allah, the Exalted, has made five prayers obligatory. If anyone performs ablution for them well, offers them at their (right) time, and observes perfectly their bowing and submissiveness in them, it is the guarantee of Allah that He will pardon him; if anyone does not do so, there is no guarantee for him on the part of Allah; He may pardon him if He wills, and punish him if He wills.",
      "usc_msa_ref": "",
      "chain": [
        "30373",
        "20472",
        "20179",
        "11163",
        "11020"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2159",
      "hadith_no": "2159",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يزيد بن هارون، عن أبي غسان، محمد بن مطرف عن حسان بن عطية، عن أبي أمامة، عن النبي صلى الله عليه وسلم قال ‏\"‏ الحياء والعي شعبتان من الإيمان والبذاء والبيان شعبتان من النفاق ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب إنما نعرفه من حديث أبي غسان محمد بن مطرف ‏.‏ قال والعي قلة الكلام والبذاء هو الفحش في الكلام والبيان هو كثرة الكلام مثل هؤلاء الخطباء الذين يخطبون فيوسعون في الكلام ويتفصحون فيه من مدح الناس فيما لا يرضي الله ‏.‏",
      "text_en": " Abu Umamah narrated that the Messenger of Allah (s.A.W) said:                     \"Al-Haya' and Al-'Iy are two branches of faith, and Al-Badha and Al-Bayan are two branches of Hypocrisy.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20472",
        "20179",
        "11413",
        "405"
      ]
    },
    {
      "id": "sunan-an-nasai-554",
      "hadith_no": "554",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا ابن أبي مريم، قال أخبرنا أبو غسان، قال حدثني زيد بن أسلم، عن عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن رجال، من قومه من الأنصار أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما أسفرتم بالفجر فإنه أعظم بالأجر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Mahmud bin Labid, from some men among his people who were of the Ansar, that the Messenger of Allah (ﷺ) said:                      \"The more you delay Fajr, the greater the reward.\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "30232",
        "20179",
        "11163",
        "11103",
        "1830"
      ]
    },
    {
      "id": "sunan-ibn-majah-150",
      "hadith_no": "150",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا الحسن بن علي الخلال، وعلي بن المنذر، قالا حدثنا أبو غسان، حدثنا أسباط بن نصر، عن السدي، عن صبيح، مولى أم سلمة عن زيد بن أرقم، قال قال رسول الله  صلى الله عليه وسلم  لعلي وفاطمة والحسن والحسين ‏\"‏ أنا سلم لمن سالمتم وحرب لمن حاربتم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Zaid bin Arqam said:                     \"The Messenger of Allah said to 'Ali, Fatimah, Hasan and Husain: 'I am peace for those with whom you make peace, and I am war for those with whom you make war.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20179",
        "20643",
        "10743",
        "384"
      ]
    },
    {
      "id": "sunan-ibn-majah-1676",
      "hadith_no": "1676",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن يحيى، ومحمد بن إسحاق أبو بكر البكائي، قالا حدثنا أبو غسان، قال حدثنا مندل، عن الحسن بن الحكم النخعي، عن أسماء بنت عابس بن ربيعة، عن أبيها، عن علي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن السقط ليراغم ربه إذا أدخل أبويه النار ‏.‏ فيقال أيها السقط المراغم ربه أدخل أبويك الجنة ‏.‏ فيجرهما بسرره حتى يدخلهما الجنة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Ali said:                      “The Messenger of Allah (ﷺ) said:‘Themiscarried fetus will plead with his Lord if his parents areadmittedto Hell. It will be said: “O fetus who pleads with your Lord!Admityour parents to Paradise.” So he will drag them out with hisumbilical cord until he admits them to Paradise.’”",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "11107",
        "20179",
        "15089",
        "5"
      ]
    },
    {
      "id": "sunan-ibn-majah-2287",
      "hadith_no": "2287",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا عمرو بن عثمان بن سعيد بن كثير بن دينار الحمصي، حدثنا أبي، حدثنا أبو غسان، محمد بن مطرف عن محمد بن المنكدر، عن جابر بن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ رحم الله عبدا سمحا إذا باع سمحا إذا اشترى سمحا إذا اقتضى ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir bin 'Abdullah that the Messenger of Allah (ﷺ) said:                     \"May Allah have mercy on a person who is lenient when he sells, lenient when he buys, and lenient when he asks for payment. \"",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "4",
        "20179",
        "11048",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-3708",
      "hadith_no": "3708",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أحمد بن عثمان بن حكيم الأودي، حدثنا أبو غسان، قال حدثنا حسن بن صالح، ح وحدثنا سفيان بن وكيع، حدثنا أبي، عن الحسن بن صالح، عن مسلم، عن مجاهد، عن ابن عباس، قال كان رسول الله  صلى الله عليه وسلم  يلبس قميصا قصير اليدين والطول ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Messenger of Allah (ﷺ)usedto wear a shirt that was short in the sleeves and length.”",
      "usc_msa_ref": "",
      "chain": [
        "30185",
        "20179",
        "35047",
        "20647",
        "11392",
        "11028",
        "17"
      ]
    }
  ],
  "total_hadiths": 45
}