{
  "id": "20176",
  "name": "Muhammad bin 'Abdullah bin Muslim محمد بن عبد الله بن مسلم",
  "full_name": "Muhammad bin 'Abdullah bin Muslim محمد بن عبد الله بن مسلم",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "152",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Medina",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ ع  -  صدوق له أوهام ]"
    ],
    "tags": [
      "Quraish",
      "B.Zuhrah",
      "al-Madni"
    ]
  },
  "parents": [
    {
      "id": "11872",
      "name": "'Abdullah bin Muslim bin 'Ubaidullah عبد الله بن مسلم بن عبيد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11872",
      "name": "'Abdullah bin Muslim bin 'Ubaidullah عبد الله بن مسلم بن عبيد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11876",
      "name": "'Abdur Rahman bin Ishaq عبد الرحمن بن إسحاق بن عبد الله",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20150",
      "name": "Ibrahim bin Sa'd bin Ibrahim إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20530",
      "name": "Umayya bin Khalid bin al-'Aswad أمية بن خالد بن الأسود",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20506",
      "name": "Abu Uvais al-Madni أبو أويس المدني الأصبحي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20184",
      "name": "Ya'qub bin Ibrahim bin Sa'd يعقوب بن إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20164",
      "name": "'Abdullah bin Muslima al-Qa'nabi عبد الله بن مسلمة بن قعنب القعنبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-369",
      "hadith_no": "369",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إسحاق، قال حدثنا يعقوب بن إبراهيم، قال حدثنا ابن أخي ابن شهاب، عن عمه، قال أخبرني حميد بن عبد الرحمن بن عوف، أن أبا هريرة، قال بعثني أبو بكر في تلك الحجة في مؤذنين يوم النحر نؤذن بمنى أن لا يحج بعد العام مشرك، ولا يطوف بالبيت عريان‏.‏ قال حميد بن عبد الرحمن ثم أردف رسول الله صلى الله عليه وسلم عليا، فأمره أن يؤذن ببراءة قال أبو هريرة فأذن معنا علي في أهل منى يوم النحر لا يحج بعد العام مشرك، ولا يطوف بالبيت عريان‏.‏",
      "text_en": " Narrated Abu Huraira:                     On the Day of Nahr (10th of Dhul-Hijja, in the year prior to the last Hajj of the Prophet when Abu Bakr was the leader of the pilgrims in that Hajj) Abu Bakr sent me along with other announcers to Mina to make a public announcement: \"No pagan is allowed to perform Hajj after this year and no naked person is allowed to perform the Tawaf around the Ka`ba. Then Allah's Apostle sent 'All to read out the Surat Bara'a (at-Tauba) to the people; so he made the announcement along with us on the day of Nahr in Mina: \"No pagan is allowed to perform Hajj after this year and no naked person is allowed to perform the Tawaf around the Ka`ba.\"",
      "usc_msa_ref": "365",
      "chain": [
        "30312",
        "20184",
        "20176",
        "10561",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-515",
      "hadith_no": "515",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إسحاق، قال أخبرنا يعقوب بن إبراهيم، قال حدثني ابن أخي ابن شهاب، أنه سأل عمه عن الصلاة، يقطعها شىء فقال لا يقطعها شىء، أخبرني عروة بن الزبير أن عائشة زوج النبي صلى الله عليه وسلم قالت لقد كان رسول الله صلى الله عليه وسلم يقوم فيصلي من الليل، وإني لمعترضة بينه وبين القبلة على فراش أهله‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) Allah's Apostle used to get up at night and pray while I used to lie across between him and the Qibla on his family's bed.",
      "usc_msa_ref": "494",
      "chain": [
        "30312",
        "20184",
        "20176",
        "10511"
      ]
    },
    {
      "id": "sahih-bukhari-1888",
      "hadith_no": "1888",
      "source": "Sahih Bukhari",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا إسحاق، أخبرنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، عن عمه، أخبرني عبيد الله بن عبد الله بن عتبة بن مسعود، أن عبد الله بن عباس  رضى الله عنهما  قال أقبلت وقد ناهزت الحلم، أسير على أتان لي، ورسول الله صلى الله عليه وسلم قائم يصلي بمنى، حتى سرت بين يدى بعض الصف الأول، ثم نزلت عنها فرتعت، فصففت مع الناس وراء رسول الله صلى الله عليه وسلم‏.‏ وقال يونس عن ابن شهاب بمنى في حجة الوداع‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     I came riding on my she-ass and had (just) then attained the age of puberty. Allah's Apostle was praying at Mina. I passed in front of a part of the first row and then dismounted from it, and the animal started grazing. I aligned with the people behind Allah's Apostle (The sub-narrator added that happened in Mina during the Prophet's Hajjat-al-Wada`.)",
      "usc_msa_ref": "",
      "chain": [
        "30021",
        "20184",
        "20176",
        "11004",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-2176",
      "hadith_no": "2176",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عبيد الله بن سعد، حدثنا عمي، حدثنا ابن أخي الزهري، عن عمه، قال حدثني سالم بن عبد الله، عن عبد الله بن عمر  رضى الله عنهما  أن أبا سعيد، حدثه مثل، ذلك حديثا عن رسول الله صلى الله عليه وسلم فلقيه عبد الله بن عمر فقال يا أبا سعيد، ما هذا الذي تحدث عن رسول الله صلى الله عليه وسلم فقال أبو سعيد في الصرف سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الذهب بالذهب مثلا بمثل والورق بالورق مثلا بمثل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     (Concerning exchange) that he heard Allah's Apostle saying, \"Do not sell gold for gold unless equal in weight, and do not sell silver unless equal in weight.\"",
      "usc_msa_ref": "384",
      "chain": [
        "30258",
        "20150",
        "20176",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-2936",
      "hadith_no": "2936",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إسحاق، أخبرنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، عن عمه، قال أخبرني عبيد الله بن عبد الله بن عتبة بن مسعود، أن عبد الله بن عباس  رضى الله عنهما  أخبره أن رسول الله صلى الله عليه وسلم كتب إلى قيصر، وقال ‏\"‏ فإن توليت فإن عليك إثم الأريسيين ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     Allah's Apostle wrote a letter to Caesar saying, \"If you reject Islam, you will be responsible for the sins of the peasants (i.e. your people).",
      "usc_msa_ref": "187",
      "chain": [
        "30021",
        "20184",
        "20176",
        "11004",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-3940",
      "hadith_no": "3940",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني إسحاق بن منصور، أخبرنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، عن عمه، قال أخبرني أبو إدريس، عائذ الله أن عبادة بن الصامت  من الذين شهدوا بدرا مع رسول الله صلى الله عليه وسلم  ومن أصحابه ليلة العقبة  أخبره أن رسول الله صلى الله عليه وسلم قال وحوله عصابة من أصحابه ‏\"‏ تعالوا بايعوني على أن لا تشركوا بالله شيئا، ولا تسرقوا، ولا تزنوا، ولا تقتلوا أولادكم، ولا تأتون ببهتان تفترونه بين أيديكم وأرجلكم، ولا تعصوني في معروف، فمن وفى منكم فأجره على الله، ومن أصاب من ذلك شيئا فعوقب به في الدنيا فهو له كفارة، ومن أصاب من ذلك شيئا فستره الله فأمره إلى الله، إن شاء عاقبه، وإن شاء عفا عنه ‏\"‏‏.‏ قال فبايعته على ذلك‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                     Who had taken part in the battle of Badr with Allah's Apostle and had been amongst his companions on the night of Al-`Aqaba Pledge: Allah's Apostle, surrounded by a group of his companions said, \"Come along and give me the pledge of allegiance that you will not worship anything besides Allah, will not steal, will not commit illegal sexual intercourse will not kill your children, will not utter; slander, invented by yourself, and will not disobey me if I order you to do something good. Whoever among you will respect and fulfill this pledge, will be rewarded by Allah. And if one of you commits any of these sins and is punished in this world then that will be his expiation for it, and if one of you commits any of these sins and Allah screens his sin, then his matter, will rest with Allah: If He will, He will punish him and if He will,. He will excuse him.\" So I gave the pledge of allegiance to him for these conditions.",
      "usc_msa_ref": "232",
      "chain": [
        "30313",
        "20184",
        "20176"
      ]
    },
    {
      "id": "sahih-bukhari-4068",
      "hadith_no": "4068",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن الزهري، عن عطاء بن يزيد، عن عبيد الله بن عدي، عن المقداد بن الأسود، حدثني إسحاق، حدثنا يعقوب بن إبراهيم بن سعد، حدثنا ابن أخي ابن شهاب، عن عمه، قال أخبرني عطاء بن يزيد الليثي، ثم الجندعي أن عبيد، الله بن عدي بن الخيار أخبره أن المقداد بن عمرو الكندي، وكان حليفا لبني زهرة، وكان ممن شهد بدرا مع رسول الله صلى الله عليه وسلم أخبره أنه قال لرسول الله صلى الله عليه وسلم أرأيت إن لقيت رجلا من الكفار فاقتتلنا، فضرب إحدى يدى بالسيف فقطعها، ثم لاذ مني بشجرة فقال أسلمت لله‏.‏ آأقتله يا رسول الله بعد أن قالها فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقتله ‏\"‏‏.‏ فقال يا رسول الله، إنه قطع إحدى يدى، ثم قال ذلك بعد ما قطعها‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقتله، فإن قتلته فإنه بمنزلتك قبل أن تقتله، وإنك بمنزلته قبل أن يقول كلمته التي قال ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubaidullah bin `Adi bin Al-Khiyar:                     That Al-Miqdad bin `Amr Al-Kindi, who was an ally of Bani Zuhra and one of those who fought the battle of Badr together with Allah's Apostle told him that he said to Allah's Apostle, \"Suppose I met one of the infidels and we fought, and he struck one of my hands with his sword and cut it off and then took refuge in a tree and said, \"I surrender to Allah (i.e. I have become a Muslim),' could I kill him, O Allah's Apostle, after he had said this?\" Allah's Apostle said, \"You should not kill him.\" Al- Miqdad said, \"O Allah's Apostle! But he had cut off one of my two hands, and then he had uttered those words?\" Allah's Apostle replied, \"You should not kill him, for if you kill him, he would be in your position where you had been before killing him, and you would be in his position where he had been before uttering those words.\"",
      "usc_msa_ref": "",
      "chain": [
        "20241",
        "11070",
        "11013",
        "11206",
        "163",
        "30312",
        "20184",
        "20176",
        "11206",
        "880"
      ]
    },
    {
      "id": "sahih-bukhari-4230",
      "hadith_no": "4230",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق، أخبرنا يعقوب، حدثني ابن أخي ابن شهاب، عن عمه، أخبرني عروة بن الزبير، أنه سمع مروان بن الحكم، والمسور بن مخرمة، يخبران خبرا من خبر رسول الله صلى الله عليه وسلم في عمرة الحديبية فكان فيما أخبرني عروة عنهما أنه لما كاتب رسول الله صلى الله عليه وسلم سهيل بن عمرو، يوم الحديبية على قضية المدة، وكان فيما اشترط سهيل بن عمرو أنه قال لا يأتيك منا أحد وإن كان على دينك إلا رددته إلينا، وخليت بيننا وبينه‏.‏ وأبى سهيل أن يقاضي رسول الله صلى الله عليه وسلم إلا على ذلك، فكره المؤمنون ذلك وامعضوا، فتكلموا فيه، فلما أبى سهيل أن يقاضي رسول الله صلى الله عليه وسلم إلا على ذلك، كاتبه رسول الله صلى الله عليه وسلم، فرد رسول الله صلى الله عليه وسلم أبا جندل بن سهيل يومئذ إلى أبيه سهيل بن عمرو، ولم يأت رسول الله صلى الله عليه وسلم أحد من الرجال إلا رده في تلك المدة، وإن كان مسلما، وجاءت المؤمنات مهاجرات، فكانت أم كلثوم بنت عقبة بن معيط ممن خرج إلى رسول الله صلى الله عليه وسلم وهى عاتق، فجاء أهلها يسألون رسول الله صلى الله عليه وسلم أن يرجعها إليهم، حتى أنزل الله تعالى في المؤمنات ما أنزل‏.‏",
      "text_en": " Narrated `Urwa bin Az-Zubair:                     That he heard Marwan bin Al-Hakam and Al-Miswar bin Makhrama relating one of the events that happened to Allah's Apostle in the `Umra of Al-Hudaibiya. They said, \"When Allah's Apostle concluded the truce with Suhail bin `Amr on the day of Al-Hudaibiya, one of the conditions which Suhail bin `Amr stipulated, was his saying (to the Prophet), \"If anyone from us (i.e. infidels) ever comes to you, though he has embraced your religion, you should return him to us, and should not interfere between us and him.\" Suhail refused to conclude the truce with Allah's Apostle except on this condition. The believers disliked this condition and got disgusted with it and argued about it. But when Suhail refused to conclude the truce with Allah's Apostle except on that condition, Allah's Apostle concluded it. Accordingly, Allah's Apostle then returned Abu Jandal bin Suhail to his father, Suhail bin `Amr, and returned every man coming to him from them during that period even if he was a Muslim. The believing women Emigrants came (to Medina) and Um Kulthum, the daughter of `Uqba bin Abi Mu'ait was one of those who came to Allah's Apostle and she was an adult at that time. Her relatives came, asking Allah's Apostle to return her to them, and in this connection, Allah revealed the Verses dealing with the believing (women). Aisha said, \"Allah's Apostle used to test all the believing women who migrated to him, with the following Verse:-- \"O Prophet! When the believing Women come to you, to give the pledge of allegiance to you.\" (60.12) `Urwa's uncle said, \"We were informed when Allah ordered His Apostle to return to the pagans what they had given to their wives who lately migrated (to Medina) and we were informed that Abu Basir...\" relating the whole narration.",
      "usc_msa_ref": "496",
      "chain": [
        "30021",
        "20184",
        "20176",
        "10511",
        "858"
      ]
    },
    {
      "id": "sahih-bukhari-4363",
      "hadith_no": "4363",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سعيد بن عفير، قال حدثني ليث، حدثني عقيل، عن ابن شهاب،‏.‏ وحدثني إسحاق، حدثنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب،، قال محمد بن شهاب وزعم عروة بن الزبير أن مروان، والمسور بن مخرمة، أخبراه أن رسول الله صلى الله عليه وسلم قام حين جاءه وفد هوازن مسلمين، فسألوه أن يرد إليهم أموالهم وسبيهم، فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ معي من ترون، وأحب الحديث إلى أصدقه، فاختاروا إحدى الطائفتين إما السبى، وإما المال، وقد كنت استأنيت بكم ‏\"‏‏.‏ وكان أنظرهم رسول الله صلى الله عليه وسلم بضع عشرة ليلة، حين قفل من الطائف، فلما تبين لهم أن رسول الله صلى الله عليه وسلم غير راد إليهم إلا إحدى الطائفتين قالوا فإنا نختار سبينا‏.‏ فقام رسول الله صلى الله عليه وسلم في المسلمين، فأثنى على الله بما هو أهله ثم قال ‏\"‏ أما بعد، فإن إخوانكم قد جاءونا تائبين، وإني قد رأيت أن أرد إليهم سبيهم، فمن أحب منكم أن يطيب ذلك فليفعل، ومن أحب منكم أن يكون على حظه، حتى نعطيه إياه من أول ما يفيء الله علينا، فليفعل ‏\"‏‏.‏ فقال الناس قد طيبنا ذلك يا رسول الله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنا لا ندري من أذن منكم في ذلك ممن لم يأذن فارجعوا حتى يرفع إلينا عرفاؤكم أمركم ‏\"‏‏.‏ فرجع الناس فكلمهم عرفاؤهم ثم رجعوا إلى رسول الله صلى الله عليه وسلم فأخبروه أنهم قد طيبوا وأذنوا‏.‏ هذا الذي بلغني عن سبى هوازن‏.‏",
      "text_en": " Narrated Marwan and Al-Miswar bin Makhrama:                     When the delegate of Hawazin came to Allah's Apostle declaring their conversion to Islam and asked him to return their properties and captives, Allah's Apostle got up and said to them, \"There Is involved in this matter, the people whom you see with me, and the most beloved talk to me, is the true one. So choose one of two alternatives: Either the captives or the properties. I have been waiting for you (i.e. have not distributed the booty).\" Allah's Apostle had delayed the distribution of their booty over ten nights after his return from Ta'if. So when they came to know that Allah's Apostle was not going to return to them but one of the two, they said, \"We prefer to have our captives.\" So Allah's Apostle got up amongst the Muslims, and praising Allah as He deserved, said, \"To proceed! Your brothers have come to you with repentance and I see (it logical) to return their captives. So, whoever of you likes to do that as a favor then he can do it. And whoever of you likes to stick to his share till we give him from the very first booty which Allah will give us, then he can do so.\" The people said, \"We do that (i.e. return the captives) willingly as a favor, 'O Allah's Apostle!\" Allah's Apostle said, \"We do not know which of you have agreed to it and which have not; so go back and let your chiefs forward us your decision.\" They went back and their chief's spoke to them, and they (i.e. the chiefs) returned to Allah's Apostle and informed him that all of them had agreed (to give up their captives) with pleasure, and had given their permission (i.e. that the captives be returned to their people). (The sub-narrator said, \"That is what has reached me about the captives of Hawazin tribe.\")",
      "usc_msa_ref": "608",
      "chain": [
        "30233",
        "20023",
        "11207",
        "11013",
        "30021",
        "20184",
        "20176",
        "11013",
        "10511",
        "2201"
      ]
    },
    {
      "id": "sahih-bukhari-4940",
      "hadith_no": "4940",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق، حدثنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، عن عمه، أخبرني عروة، أن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم أخبرته أن رسول الله صلى الله عليه وسلم كان يمتحن من هاجر إليه من المؤمنات بهذه الآية، بقول الله ‏{‏يا أيها النبي إذا جاءك المؤمنات يبايعنك‏}‏ إلى قوله ‏{‏غفور رحيم‏}‏‏.‏ قال عروة قالت عائشة فمن أقر بهذا الشرط من المؤمنات قال لها رسول الله صلى الله عليه وسلم ‏\"‏ قد بايعتك ‏\"‏‏.‏ كلاما ولا والله ما مست يده يد امرأة قط في المبايعة، ما يبايعهن إلا بقوله ‏\"‏ قد بايعتك على ذلك ‏\"‏‏.‏ تابعه يونس ومعمر وعبد الرحمن بن إسحاق عن الزهري‏.‏ وقال إسحاق بن راشد عن الزهري عن عروة وعمرة‏.‏",
      "text_en": " Narrated `Urwa:                     Aisha the wife of the Prophet, said, \"Allah's Apostle used to examine the believing women who migrated to him in accordance with this Verse: 'O Prophet! When believing women come to you to take the oath of allegiance to you... Verily! Allah is Oft-Forgiving Most Merciful.' (60.12) `Aisha said, \"And if any of the believing women accepted the condition (assigned in the above-mentioned Verse), Allah's Apostle would say to her. \"I have accepted your pledge of allegiance.\" \"He would only say that, for, by Allah, his hand never touched, any lady during that pledge of allegiance. He did not receive their pledge except by saying, \"I have accepted your pledge of allegiance for that.\"",
      "usc_msa_ref": "414",
      "chain": [
        "30021",
        "20184",
        "20176",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-5633",
      "hadith_no": "5633",
      "source": "Sahih Bukhari",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا محمد بن عبد الرحيم، أخبرنا يعقوب بن إبراهيم بن سعد، عن ابن أخي ابن شهاب، عن عمه ابن شهاب، عن سالم، عن عبد الله بن عمر  رضى الله عنهما  قال رسول الله صلى الله عليه وسلم ‏\"‏ كلوا من الأضاحي ثلاثا ‏\"‏‏.‏ وكان عبد الله يأكل بالزيت حين ينفر من منى، من أجل لحوم الهدى‏.‏",
      "text_en": " Narrated Salim:                     `Abdullah bin `Umar said, \"Allah's Apostle said, \"Eat of the meat of sacrifices (of `Id al Adha) for three days.\" When `Abdullah departed from Mina, he used to eat (bread with) oil, lest he should eat of the meat of Hadi (which is regarded as unlawful after the three days of the `Id).",
      "usc_msa_ref": "480",
      "chain": [
        "30272",
        "20184",
        "20176",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-6138",
      "hadith_no": "6138",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن ابن أخي ابن شهاب، عن ابن شهاب، عن سالم بن عبد الله، قال سمعت أبا هريرة، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ كل أمتي معافى إلا المجاهرين، وإن من المجانة أن يعمل الرجل بالليل عملا، ثم يصبح وقد ستره الله، فيقول يا فلان عملت البارحة كذا وكذا، وقد بات يستره ربه ويصبح يكشف ستر الله عنه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard Allah's Apostle saying. \"All the sins of my followers will be forgiven except those of the Mujahirin (those who commit a sin openly or disclose their sins to the people). An example of such disclosure is that a person commits a sin at night and though Allah screens it from the public, then he comes in the morning, and says, 'O so-and-so, I did such-and-such (evil) deed yesterday,' though he spent his night screened by his Lord (none knowing about his sin) and in the morning he removes Allah's screen from himself.\"",
      "usc_msa_ref": "95",
      "chain": [
        "30105",
        "20150",
        "20176",
        "11013",
        "11011",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-362",
      "hadith_no": "362",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني زهير بن حرب، وعبد بن حميد، جميعا عن يعقوب، قال زهير حدثنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، عن عمه، قال أخبرني عروة بن الزبير، أن أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يأتي الشيطان أحدكم فيقول من خلق كذا وكذا حتى يقول له من خلق ربك فإذا بلغ ذلك فليستعذ بالله ولينته ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah may peace be upon him) observed:                      The Satan comes to everyone. of you and says: Who created this and that? till he questions: Who created your Lord? When he comes to that, one should seek refuge in Allah and keep away (from such idle thoughts).",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30553",
        "20184",
        "20321",
        "20184",
        "20176",
        "10511",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-396",
      "hadith_no": "396",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني زهير بن حرب، حدثنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، عن عمه، قال أخبرني عامر بن سعد بن أبي وقاص، عن أبيه، سعد أن رسول الله صلى الله عليه وسلم أعطى رهطا وسعد جالس فيهم قال سعد فترك رسول الله صلى الله عليه وسلم منهم من لم يعطه وهو أعجبهم إلى فقلت يا رسول الله ما لك عن فلان فوالله إني لأراه مؤمنا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أو مسلما ‏\"‏ ‏.‏ قال فسكت قليلا ثم غلبني ما أعلم منه فقلت يا رسول الله ما لك عن فلان فوالله إني لأراه مؤمنا فقال رسول الله صلى الله عليه وسلم ‏\"‏ أو مسلما ‏\"‏ ‏.‏ قال فسكت قليلا ثم غلبني ما علمت منه فقلت يا رسول الله ما لك عن فلان فوالله إني لأراه مؤمنا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أو مسلما ‏.‏ إني لأعطي الرجل وغيره أحب إلى منه خشية أن يكب في النار على وجهه ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Sa'd that the Messenger of Allah (may peace be upon him) bestowed upon a group of persons (things), and Sa'd was sitting amongst them. Sa'd said:                      The Messenger of Allah (may peace be upon him) ignored some of them. And he who was ignored seemed to be more deserving in my eyes (as compared with others). I (Sa'd) said: Messenger of Allah I why is it that you did not give to such and such (man)? Verily I see him a believer. Upon this the Messenger of Allah (may peace be upon him) observed: Or a Muslim? I kept quiet for some time but I was again impelled (to express) what I knew about him. I said: Messenger of Allah why is it that you did not give it to such and such? Verily, by Allah, see him a believer. Upon this the Messenger of Allah (may peace be upon him) remarked: (Nay, not a believer) but a Muslim. He (Sa'd) said: I again kept quite for some time but what I knew about him again impelled me (to express my opinion) and I said: Why is it that you did not give (the share) to so and so: By Allah, verily I see him a believer. The Messenger of Allah (may peace be upon him) remarked; (Nay, not so) but a Muslim. Verily (at times) I give (a share) to a certain man apprehending that he may not be thrown prostrate in the Fire, whereas the other man (who is not given) is dearer to me (as compared with him).",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20184",
        "20176",
        "10554"
      ]
    },
    {
      "id": "sahih-muslim-410",
      "hadith_no": "410",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، عن عمه، قال أخبرني نافع، مولى أبي قتادة الأنصاري أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ كيف أنتم إذا نزل ابن مريم فيكم وأمكم ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that he heard the Messenger of Allah (may peace be upon him) as saying:                      What would you do when the son of Mary would descend and lead you?",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "20184",
        "20176",
        "11224",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-509",
      "hadith_no": "509",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني زهير بن حرب، وعبد بن حميد، قال زهير حدثنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، عن عمه، أخبرني أبو سلمة بن عبد الرحمن، أن أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لكل نبي دعوة وأردت إن شاء الله أن أختبئ دعوتي شفاعة لأمتي يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: There is for every apostle a prayer, and I intend (if Allah so willed) that I would reserve my prayer for the intercession of my Ummah on the Day of Resurrection.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30553",
        "20321",
        "20184",
        "20176",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-510",
      "hadith_no": "510",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني زهير بن حرب، وعبد بن حميد، قال زهير حدثنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، عن عمه، حدثني عمرو بن أبي سفيان بن أسيد بن جارية الثقفي، مثل ذلك عن أبي هريرة، عن رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " 'Amr b. Abu Sufyan transmitted a hadith like this from Abu Huraira who narrated it from the Messenger of Allah (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30553",
        "20321",
        "20184",
        "20176",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-2481",
      "hadith_no": "2481",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا سفيان، ح وحدثنيه زهير بن حرب، حدثنا يعقوب، بن إبراهيم بن سعد حدثنا ابن أخي ابن شهاب، ح وحدثناه إسحاق بن إبراهيم، وعبد، بن حميد قالا أخبرنا عبد الرزاق، أخبرنا معمر، كلهم عن الزهري، بهذا الإسناد على معنى حديث صالح عن الزهري ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Zuhri with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20005",
        "20184",
        "20176",
        "30123",
        "30553",
        "20121"
      ]
    },
    {
      "id": "sahih-muslim-2485",
      "hadith_no": "2485",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني زهير بن حرب، حدثنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، عن عمه، قال أخبرني أنس بن مالك، ‏.‏ وساق الحديث بمثله ‏.‏ إلا أنه قال قال أنس قالوا نصبر ‏.‏ كرواية يونس عن الزهري ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Anas b. Malik through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20184",
        "20176",
        "19",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-4243",
      "hadith_no": "4243",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Rules of Inheritance - كتاب الفرائض",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الملك بن شعيب بن الليث، حدثني أبي، عن جدي، حدثني عقيل، ح وحدثني زهير بن حرب، حدثنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، ح وحدثنا ابن نمير، حدثنا أبي، حدثنا ابن أبي ذئب، كلهم عن الزهري، بهذا الإسناد هذا الحديث ‏.‏",
      "text_en": " This hadith has been narrated on the authority of al-Zuhri through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30489",
        "36033",
        "11207",
        "30022",
        "20184",
        "20176",
        "30212",
        "20331",
        "20177"
      ]
    },
    {
      "id": "sahih-muslim-5211",
      "hadith_no": "5211",
      "source": "Sahih Muslim",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثني زهير بن حرب، حدثنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، ح وحدثنا حسن الحلواني، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن صالح، ح وحدثنا  عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، كلهم عن الزهري، بهذا الإسناد مثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Zuhri with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20184",
        "20176",
        "130115",
        "20184",
        "20150",
        "11176",
        "30553",
        "20121"
      ]
    },
    {
      "id": "sahih-muslim-6789",
      "hadith_no": "6789",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني زهير بن حرب، وعبد بن حميد، قال زهير حدثنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، عن عمه، حدثني سعيد بن المسيب، عن أبي هريرة، أنه قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ اللهم إني اتخذت عندك عهدا لن تخلفنيه فأيما مؤمن سببته أو جلدته فاجعل ذلك كفارة له يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      I have held covenant with Thee which Thou wouldst not break, so for any believer whom I curse or beat, make that an expiation on the Day of Resurrection.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30553",
        "20321",
        "20184",
        "20176",
        "11002",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-7194",
      "hadith_no": "7194",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "وحدثني عبد بن حميد، حدثني يعقوب بن إبراهيم بن سعد، حدثنا محمد بن عبد، الله بن مسلم ابن أخي الزهري عن عمه، محمد بن مسلم الزهري أخبرني عبد الرحمن، بن عبد الله بن كعب بن مالك أن عبيد الله بن كعب بن مالك، وكان، قائد كعب حين عمي قال سمعت كعب بن مالك يحدث حديثه حين تخلف عن رسول الله صلى الله عليه وسلم في غزوة تبوك ‏.‏ وساق الحديث وزاد فيه على يونس فكان رسول الله صلى الله عليه وسلم قلما يريد غزوة إلا ورى بغيرها حتى كانت تلك الغزوة ‏.‏ ولم يذكر في حديث ابن أخي الزهري أبا خيثمة ولحوقه بالنبي صلى الله عليه وسلم ‏.‏",
      "text_en": " 'Abdullah b. K'ab, who was his (Ka'b's) guide as he became blind, reported that he heard from Ka'b b. Malik the story of his staying behind Allah's Messenger (may peace be upon him) from the expedition of Tabuk. The rest of the hadith is the same (but with this variation) that in the narration transmitted on the authority of Yunus (the words are):                      When Allah's Messenger (may. peace be upon him) intended to set on an expedition he kept It as a secret, but. be did not do so in thic. expedition. And in the narration transmitted on the authority of Muhammad b. Abdullah b. Muslim, there is no mention of Abu Khaithana (Allah be pleased with him) and no mention of his meeting with Allah's Messenger (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20184",
        "20176",
        "20176",
        "11519",
        "390"
      ]
    },
    {
      "id": "sahih-muslim-7676",
      "hadith_no": "7676",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثني زهير بن حرب، ومحمد بن حاتم، وعبد بن حميد، قال عبد حدثني وقال، الآخران حدثنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، عن عمه، قال قال سالم سمعت أبا هريرة، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ كل أمتي معافاة إلا المجاهرين وإن من الإجهار أن يعمل العبد بالليل عملا ثم يصبح قد ستره ربه فيقول يا فلان قد عملت البارحة كذا وكذا وقد بات يستره ربه فيبيت يستره ربه ويصبح يكشف ستر الله عنه ‏\"‏ ‏.‏ قال زهير ‏\"‏ وإن من الهجار ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      All the people of my Ummah would get pardon for their sins except those who publicise them. And (it means) that a servant should do a deed during the night and tell the people in the morning that he has done so and so, whereas Allah has concealed it. And he does a deed during the day and when it is night he tells the people, whereas Allah has concealed it. Zuhair has used the word hijar for publicising.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "38487",
        "30553",
        "20184",
        "20176",
        "11011",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-1379",
      "hadith_no": "1379",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن حفص بن عبد الله السلمي، حدثنا أبي، حدثنا إبراهيم بن طهمان، عن عباد بن إسحاق، عن محمد بن مسلم الزهري، عن ضمرة بن عبد الله بن أنيس، عن أبيه، قال كنت في مجلس بني سلمة وأنا أصغرهم، فقالوا من يسأل لنا رسول الله صلى الله عليه وسلم عن ليلة القدر وذلك صبيحة إحدى وعشرين من رمضان ‏.‏ فخرجت فوافيت مع رسول الله صلى الله عليه وسلم صلاة المغرب ثم قمت بباب بيته فمر بي فقال ‏\"‏ ادخل ‏\"‏ ‏.‏ فدخلت فأتي بعشائه فرآني أكف عنه من قلته فلما فرغ قال ‏\"‏ ناولني نعلي ‏\"‏ ‏.‏ فقام وقمت معه فقال ‏\"‏ كأن لك حاجة ‏\"‏ ‏.‏ قلت أجل أرسلني إليك رهط من بني سلمة يسألونك عن ليلة القدر فقال ‏\"‏ كم الليلة ‏\"‏ ‏.‏ فقلت اثنتان وعشرون قال ‏\"‏ هي الليلة ‏\"‏ ‏.‏ ثم رجع فقال ‏\"‏ أو القابلة ‏\"‏ ‏.‏ يريد ليلة ثلاث وعشرين ‏.‏",
      "text_en": " Narrated Abdullah ibn Unays:                     I was present at the gathering of Banu Salamah, and I was the youngest of them.  They (the people) said: Who will ask the Messenger of Allah (ﷺ) for us about Laylat al-Qadr? That was the twenty-first of Ramadan. I went out and said the sunset prayer along with the Messenger of Allah (ﷺ). I then stood at the door of his house.  He passed by me and said: Come in. I entered (the house) and dinner was brought for him. I was prevented from taking food as it was scanty.  When he finished his dinner, he said to me: Give me my shoes. He then stood up and I also stood up with him. He said: Perhaps you have some business with me.  I said: Yes. Some people of Banu Salamah have sent me to you to ask you about Laylat al-Qadr. He asked: Which night: Is it tonight?  I said: Twenty-second.  He said: This is the very night. He then withdrew and said: Or the following night, referring to the twenty-third night.",
      "usc_msa_ref": "",
      "chain": [
        "30293",
        "20420",
        "20187",
        "20176",
        "12190",
        "1048"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1226",
      "hadith_no": "1226",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "حدثنا عبد الله بن أبي زياد، حدثنا يعقوب بن إبراهيم بن سعد، حدثنا ابن أخي ابن شهاب، عن عمه، عن سعيد بن المسيب، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن المرأة كالضلع إن ذهبت تقيمها كسرتها وإن تركتها استمتعت بها على عوج ‏\"‏ ‏.‏ قال وفي الباب عن أبي ذر وسمرة وعائشة ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     The Messenger of Allah said: \"Indeed the woman is like a rib, if you try to straighten her you will break her, and if you leave her, what you enjoy from her will be with the crookedness.\"",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "20176",
        "11002",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2732-2",
      "hadith_no": "2732",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا إبراهيم بن يحيى بن محمد بن عباد المدني، حدثني أبو يحيى بن محمد، عن محمد بن إسحاق، عن محمد بن مسلم الزهري، عن عروة بن الزبير، عن عائشة، قالت قدم زيد بن حارثة المدينة ورسول الله صلى الله عليه وسلم في بيتي فأتاه فقرع الباب فقام إليه رسول الله صلى الله عليه وسلم عريانا يجر ثوبه والله ما رأيته عريانا قبله ولا بعده فاعتنقه وقبله ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه من حديث الزهري إلا من هذا الوجه ‏.‏",
      "text_en": " Narrated 'Aishah:                     \"Zaid bin Harithah arrived in Al-Madinah while the Messenger of Allah (ﷺ) was in his house. So he went and knocked at the door, so the Messenger of Allah (ﷺ) stood naked (1), dragging his garment - and by Allah! I did not see him naked before nor afterwards - and he hugged him and kissed him.\"(1) They say that the meaning of naked here is that he was not wearing his Rida or upper wrap and it was that which was dragging, so the area between the navel and knees were covered. See Tuhfat Al-Ahwadhi.",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "11107",
        "20176",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-441",
      "hadith_no": "441",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا عمران بن يزيد، قال حدثنا إسماعيل بن عبد الله، قال حدثنا الأوزاعي، قال حدثنا محمد بن مسلم الزهري، قال حدثني سعيد بن المسيب، قال حدثني أبو هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا قام أحدكم من الليل فلا يدخل يده في الإناء حتى يفرغ عليها مرتين أو ثلاثا فإن أحدكم لا يدري أين باتت يده ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                      \"The Messenger of Allah (ﷺ) said: 'When any one of you gets up after (sleeping) at night, let him not put his hand into the vessel until he has poured water on it two or three times, for none of you knows where his hand spent the night.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30103",
        "20024",
        "20176",
        "11002",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-1673",
      "hadith_no": "1673",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن يحيى، قال حدثنا يعقوب بن إبراهيم، قال حدثنا ابن أخي ابن شهاب، عن عمه، قال أخبرني حميد بن عبد الرحمن، أن عبد الله بن عمر، أخبره أن رجلا سأل رسول الله صلى الله عليه وسلم عن صلاة الليل فقال رسول الله صلى الله عليه وسلم ‏\"‏ صلاة الليل مثنى مثنى فإذا خشيت الصبح فأوتر بواحدة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abdullah bin Umar said that:                     A man asked the Messenger of Allah (ﷺ) about prayers at night. The Messenger of Allah (ﷺ) said: \"prayers at night are (offered) two by two, then if you fear that dawn will come, pray witr with one.\"",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20184",
        "20176",
        "10561",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-3519",
      "hadith_no": "3519",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن وهب، قال حدثنا محمد بن سلمة، قال حدثني أبو عبد الرحيم، قال حدثني زيد بن أبي أنيسة، عن يزيد بن أبي حبيب، عن محمد بن مسلم الزهري، قال كتب إليه يذكر أن عبيد الله بن عبد الله حدثه أن زفر بن أوس بن الحدثان النصري حدثه أن أبا السنابل بن بعكك بن السباق قال لسبيعة الأسلمية لا تحلين حتى يمر عليك أربعة أشهر وعشرا أقصى الأجلين ‏.‏ فأتت رسول الله صلى الله عليه وسلم فسألته عن ذلك فزعمت أن رسول الله صلى الله عليه وسلم أفتاها أن تنكح إذا وضعت حملها وكانت حبلى في تسعة أشهر حين توفي زوجها وكانت تحت سعد ابن خولة فتوفي في حجة الوداع مع رسول الله صلى الله عليه وسلم فنكحت فتى من قومها حين وضعت ما في بطنها ‏.‏",
      "text_en": " It was narrated from Yazid bin Abi Habib that Muhammad bin Muslim Az-Zuhri wrote to him mentioning that 'Ubaidullah bin 'Abdullah told him, that Zufar bin Aws bin Al-Hadathan An-Nasri told him that Abu As-Sanabil bin Ba'kak bin As-Sabbaq said to Subai'ah Al-Aslamiyyah:                      \"It is not permissible for you to get married until four months and ten days, the longer of the two periods, have passed.\" She went to the Messenger of Allah and asked him about that. She said that the Messenger of Allah ruled that she could get married when she had given birth. She was nine months pregnant when her husband died, and she was married to Sa'd bin Khawlah, who died during the Farewell Pilgrimage with the Messenger of Allah. She married a young man from her people when she had given birth to (the child).",
      "usc_msa_ref": "",
      "chain": [
        "20672",
        "11340",
        "11411",
        "20176",
        "11004"
      ]
    },
    {
      "id": "sunan-ibn-majah-1461",
      "hadith_no": "1461",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن أبي زياد، حدثنا يعقوب بن إبراهيم بن سعد، حدثني ابن أخي ابن شهاب، عن عمه، حدثني صالح بن عبد الله بن أبي فروة، أن عامر بن سعد، أخبره قال سمعت أبان بن عثمان، يقول قال عثمان سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ أرأيت لو كان بفناء أحدكم نهر يجري يغتسل فيه كل يوم خمس مرات ما كان يبقى من درنه ‏\"‏ قال لا شىء ‏.‏ قال ‏\"‏ فإن الصلاة تذهب الذنوب كما يذهب الماء الدرن ‏\"‏ ‏.‏",
      "text_en": " ‘Uthmansaid:                      “I heard the Messenger of Allah (ﷺ) say: ‘Do youthinkthat if there was a river in the courtyard of anyone of you, andhebathed in it five times each day, would there be any dirt left onhim?’ They said: ‘(There would be) nothing.’ He said: ‘Prayertakesaway sins like water takes away dirt.’”",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "20176",
        "12181",
        "10554",
        "10582",
        "4"
      ]
    }
  ],
  "total_hadiths": 31
}