{
  "id": "20189",
  "name": "Ibrahim bin Nafi' al-Makhzumi إبراهيم بن نافع المخزومي",
  "full_name": "Ibrahim bin Nafi' al-Makhzumi إبراهيم بن نافع المخزومي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة حافظ ]"
    ],
    "tags": [
      "B.Makhzum",
      "al-Makki"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة حافظ ]",
        "ar": "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة حافظ ]",
        "ckb": "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة حافظ ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Makkah",
        "ar": "مكة المكرمة",
        "ckb": "مەككە"
      }
    ],
    "tags_display": [
      {
        "en": "Banu Makhzum",
        "ar": "بنو مخزوم",
        "ckb": "بەنی مەخزوم"
      },
      {
        "en": "al-Makki",
        "ar": "al-Makki",
        "ckb": "al-Makki"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11557",
      "name": "al-Hasan bin Muslim bin Yanaq الحسن بن مسلم بن يناق",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    },
    {
      "id": "19825",
      "name": "Najih bin 'Abdur Rahman نجيح بن عبد الرحمن السندي",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "11563",
      "name": "Kathir bin Kathir bin al-Mtlb كثير بن كثير بن المطلب بن أبي وداعة",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]",
      "grade_display": {
        "en": "Follower (Tabi') [3rd Generation]",
        "ar": "تابعي [الجيل الثالث]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی سێیەم]"
      }
    }
  ],
  "students": [
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20443",
      "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20191",
      "name": "Khallad bin Yahya bin Safwan خلاد بن يحيى بن صفوان",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    },
    {
      "id": "20365",
      "name": "Yahya bin Abi Bkyr يحيى بن أبي بكير واسمه نسر",
      "grade": "Succ. (Taba' Tabi') [9th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [9th Generation]",
        "ar": "تابع التابعين [الجيل التاسع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-277",
      "hadith_no": "277",
      "source": "Sahih Bukhari",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا خلاد بن يحيى، قال حدثنا إبراهيم بن نافع، عن الحسن بن مسلم، عن صفية بنت شيبة، عن عائشة، قالت كنا إذا أصابت إحدانا جنابة، أخذت بيديها ثلاثا فوق رأسها، ثم تأخذ بيدها على شقها الأيمن، وبيدها الأخرى على شقها الأيسر‏.‏",
      "text_en": " Narrated Aisha:                     Whenever any one of us was Junub, she poured water over her head thrice with both her hands and then rubbed the right side of her head with one hand and rubbed the left side of the head with the other hand.",
      "usc_msa_ref": "276",
      "chain": [
        "20191",
        "20189",
        "11557",
        "2802",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-312",
      "hadith_no": "312",
      "source": "Sahih Bukhari",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا إبراهيم بن نافع، عن ابن أبي نجيح، عن مجاهد، قال قالت عائشة ما كان لإحدانا إلا ثوب واحد تحيض فيه، فإذا أصابه شىء من دم، قالت بريقها فقصعته بظفرها‏.‏",
      "text_en": " Narrated `Aisha:                     None of us had more than a single garment and we used to have our menses while wearing it. Whenever it got soiled with blood of menses we used to apply saliva to the blood spot and rub off the blood with our nails.",
      "usc_msa_ref": "309",
      "chain": [
        "20348",
        "20189",
        "11254",
        "11028"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3365",
      "hadith_no": "3365",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا أبو عامر عبد الملك بن عمرو، قال حدثنا إبراهيم بن نافع، عن كثير بن كثير، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال لما كان بين إبراهيم وبين أهله ما كان، خرج بإسماعيل وأم إسماعيل، ومعهم شنة فيها ماء، فجعلت أم إسماعيل تشرب من الشنة فيدر لبنها على صبيها حتى قدم مكة، فوضعها تحت دوحة، ثم رجع إبراهيم إلى أهله، فاتبعته أم إسماعيل، حتى لما بلغوا كداء نادته من ورائه يا إبراهيم إلى من تتركنا قال إلى الله‏.‏ قالت رضيت بالله‏.‏ قال فرجعت فجعلت تشرب من الشنة ويدر لبنها على صبيها، حتى لما فني الماء قالت لو ذهبت فنظرت لعلي أحس أحدا‏.‏ قال فذهبت فصعدت الصفا فنظرت ونظرت هل تحس أحدا فلم تحس أحدا، فلما بلغت الوادي سعت وأتت المروة ففعلت ذلك أشواطا، ثم قالت لو ذهبت فنظرت ما فعل  تعني الصبي  فذهبت فنظرت، فإذا هو على حاله كأنه ينشغ للموت، فلم تقرها نفسها، فقالت لو ذهبت فنظرت لعلي أحس أحدا، فذهبت فصعدت الصفا فنظرت ونظرت فلم تحس أحدا، حتى أتمت سبعا، ثم قالت لو ذهبت فنظرت ما فعل، فإذا هي بصوت فقالت أغث إن كان عندك خير‏.‏ فإذا جبريل، قال فقال بعقبه هكذا، وغمز عقبه على الأرض، قال فانبثق الماء، فدهشت أم إسماعيل فجعلت تحفز‏.‏ قال فقال أبو القاسم صلى الله عليه وسلم ‏\"‏ لو تركته كان الماء ظاهرا ‏\"‏‏.‏ قال فجعلت تشرب من الماء، ويدر لبنها على صبيها  قال  فمر ناس من جرهم ببطن الوادي، فإذا هم بطير، كأنهم أنكروا ذاك، وقالوا ما يكون الطير إلا على ماء‏.‏ فبعثوا رسولهم، فنظر فإذا هم بالماء، فأتاهم فأخبرهم فأتوا إليها، فقالوا يا أم إسماعيل، أتأذنين لنا أن نكون معك أو نسكن معك فبلغ ابنها فنكح فيهم امرأة، قال ثم إنه بدا لإبراهيم فقال لأهله إني مطلع تركتي‏.‏ قال فجاء فسلم فقال أين إسماعيل فقالت امرأته ذهب يصيد‏.‏ قال قولي له إذا جاء غير عتبة بابك‏.‏ فلما جاء أخبرته قال أنت ذاك فاذهبي إلى أهلك‏.‏ قال ثم إنه بدا لإبراهيم فقال لأهله إني مطلع تركتي‏.‏ قال فجاء فقال أين إسماعيل فقالت امرأته ذهب يصيد، فقالت ألا تنزل فتطعم وتشرب فقال وما طعامكم وما شرابكم قالت طعامنا اللحم، وشرابنا الماء‏.‏ قال اللهم بارك لهم في طعامهم وشرابهم‏.‏ قال فقال أبو القاسم صلى الله عليه وسلم ‏\"‏ بركة بدعوة إبراهيم ‏\"‏‏.‏ قال ثم إنه بدا لإبراهيم فقال لأهله إني مطلع تركتي‏.‏ فجاء فوافق إسماعيل من وراء زمزم، يصلح نبلا له، فقال يا إسماعيل، إن ربك أمرني أن أبني له بيتا‏.‏ قال أطع ربك‏.‏ قال إنه قد أمرني أن تعينني عليه‏.‏ قال إذا أفعل‏.‏ أو كما قال‏.‏ قال فقاما فجعل إبراهيم يبني، وإسماعيل يناوله الحجارة، ويقولان ‏{‏ربنا تقبل منا إنك أنت السميع العليم‏}‏ قال حتى ارتفع البناء وضعف الشيخ على نقل الحجارة، فقام على حجر المقام، فجعل يناوله الحجارة، ويقولان ‏{‏ربنا تقبل منا إنك أنت السميع العليم ‏}‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When Abraham had differences with his wife), (because of her jealousy of Hajar, Ishmael's mother), he took Ishmael and his mother and went away. They had a water-skin with them containing some water, Ishmael's mother used to drink water from the water-skin so that her milk would increase for her child. When Abraham reached Mecca, he made her sit under a tree and afterwards returned home. Ishmael's mother followed him, and when they reached Kada', she called him from behind, 'O Abraham! To whom are you leaving us?' He replied, '(I am leaving you) to Allah's (Care).' She said, 'I am satisfied to be with Allah.' She returned to her place and started drinking water from the water-skin, and her milk increased for her child. When the water had all been used up, she said to herself, 'I'd better go and look so that I may see somebody.' She ascended the Safa mountain and looked, hoping to see somebody, but in vain. When she came down to the valley, she ran till she reached the Marwa mountain. She ran to and fro (between the two mountains) many times. They she said to herself, 'i'd better go and see the state of the child,' she went and found it in a state of one on the point of dying. She could not endure to watch it dying and said (to herself), 'If I go and look, I may find somebody.' She went and ascended the Safa mountain and looked for a long while but could not find anybody. Thus she completed seven rounds (of running) between Safa and Marwa. Again she said (to herself), 'I'd better go back and see the state of the child.' But suddenly she heard a voice, and she said to that strange voice, 'Help us if you can offer any help.' Lo! It was Gabriel (who had made the voice). Gabriel hit the earth with his heel like this (Ibn `Abbas hit the earth with his heel to Illustrate it), and so the water gushed out. Ishmael's mother was astonished and started digging. (Abu Al-Qasim) (i.e. the Prophet) said, \"If she had left the water, (flow naturally without her intervention), it would have been flowing on the surface of the earth.\") Ishmael's mother started drinking from the water and her milk increased for her child . Afterwards some people of the tribe of Jurhum, while passing through the bottom of the valley, saw some birds, and that astonished them, and they said, 'Birds can only be found at a place where there is water.' They sent a messenger who searched the place and found the water, and returned to inform them about it. Then they all went to her and said, 'O ishmael's mother! Will you allow us to be with you (or dwell with you)?' (And thus they stayed there.) Later on her boy reached the age of puberty and married a lady from them. Then an idea occurred to Abraham which he disclosed to his wife (Sarah), 'I want to call on my dependents I left (at Mecca).' When he went there, he greeted (Ishmael's wife) and said, 'Where is Ishmael?' She replied, 'He has gone out hunting.' Abraham said (to her), 'When he comes, tell him to change the threshold of his gate.' When he came, she told him the same whereupon Ishmael said to her, 'You are the threshold, so go to your family (i.e. you are divorced).' Again Abraham thought of visiting his dependents whom he had left (at Mecca), and he told his wife (Sarah) of his intentions. Abraham came to Ishmael's house and asked. \"Where is Ishmael?\" Ishmael's wife replied, \"He has gone out hunting,\" and added, \"Will you stay (for some time) and have something to eat and drink?' Abraham asked, 'What is your food and what is your drink?' She replied, 'Our food is meat and our drink is water.' He said, 'O Allah! Bless their meals and their drink.\" Abu Al-Qa-sim (i.e. Prophet) said, \"Because of Abraham's invocation there are blessings (in Mecca).\" Once more Abraham thought of visiting his family he had left (at Mecca), so he told his wife (Sarah) of his decision. He went and found Ishmael behind the Zamzam well, mending his arrows. He said, \"O Ishmael, Your Lord has ordered me to build a house for Him.\" Ishmael said, \"Obey (the order of) your Lord.\" Abraham said, \"Allah has also ordered me that you should help me therein.\" Ishmael said, \"Then I will do.\" So, both of them rose and Abraham started building (the Ka`ba) while Ishmael went on handing him the stones, and both of them were saying, \"O our Lord ! Accept (this service) from us, Verily, You are the All-Hearing, the All-Knowing.\" (2.127). When the building became high and the old man (i.e. Abraham) could no longer lift the stones (to such a high position), he stood over the stone of Al- Maqam and Ishmael carried on handing him the stones, and both of them were saying, 'O our Lord! Accept (this service) from us, Verily You are All-Hearing, All-Knowing.\" (2.127)",
      "usc_msa_ref": "",
      "chain": [
        "30351",
        "20443",
        "20189",
        "11563",
        "11050",
        "17"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4806",
      "hadith_no": "4806",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أبو نعيم، حدثنا إبراهيم بن نافع، عن الحسن بن مسلم، عن صفية بنت شيبة، أن عائشة  رضى الله عنها  كانت تقول لما نزلت هذه الآية ‏{‏وليضربن بخمرهن على جيوبهن‏}‏ أخذن أزرهن فشققنها من قبل الحواشي فاختمرن بها‏.‏",
      "text_en": " Narrated Safiya bint Shaiba:                     `Aisha used to say: \"When (the Verse): \"They should draw their veils over their necks and bosoms,\" was revealed, (the ladies) cut their waist sheets at the edges and covered their faces with the cut pieces.\"",
      "usc_msa_ref": "282",
      "chain": [
        "20348",
        "20189",
        "11557",
        "2802",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5260",
      "hadith_no": "5260",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا خلاد بن يحيى، حدثنا إبراهيم بن نافع، عن الحسن  هو ابن مسلم  عن صفية، عن عائشة، أن امرأة، من الأنصار زوجت ابنتها فتمعط شعر رأسها، فجاءت إلى النبي صلى الله عليه وسلم فذكرت ذلك له، فقالت إن زوجها أمرني أن أصل في شعرها‏.‏ فقال ‏\"‏ لا إنه قد لعن الموصلات ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     An Ansari woman gave her daughter in marriage and the hair of the latter started falling out. The Ansari women came to the Prophet and mentioned that to him and said, \"Her (my daughter's) husband suggested that I should let her wear false hair.\" The Prophet said, \"No, (don't do that) for Allah sends His curses upon such ladies who lengthen their hair artificially.\"",
      "usc_msa_ref": "133",
      "chain": [
        "20191",
        "20189",
        "11557",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5857",
      "hadith_no": "5857",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا أبو عامر، حدثنا إبراهيم بن نافع، عن الحسن، عن طاوس، عن أبي هريرة، قال ضرب رسول الله صلى الله عليه وسلم مثل البخيل والمتصدق، كمثل رجلين عليهما جبتان من حديد، قد اضطرت أيديهما إلى ثديهما وتراقيهما، فجعل المتصدق كلما تصدق بصدقة انبسطت عنه حتى تغشى أنامله وتعفو أثره، وجعل البخيل كلما هم بصدقة قلصت، وأخذت كل حلقة بمكانها‏.‏ قال أبو هريرة فأنا رأيت رسول الله صلى الله عليه وسلم يقول بإصبعه هكذا في جيبه، فلو رأيته يوسعها ولا تتوسع‏.‏ تابعه ابن طاوس عن أبيه وأبو الزناد عن الأعرج في الجبتين‏.‏ وقال حنظلة سمعت طاوسا سمعت أبا هريرة يقول جبتان‏.‏ وقال جعفر عن الأعرج جبتان‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle has set forth an example for a miser and a charitable person by comparing them to two men wearing two iron cloaks and their hands are raised to their breasts and necks. Whenever the charitable man tries to give a charitable gift, his iron cloak expands till it becomes so wide that it will cover his fingertips and obliterate his tracks And, whenever the miser wants to give a charitable gift, his cloak becomes very tight over him and every ring gets stuck to its place Abu Huraira added; I saw Allah's Apostle putting his finger in the (chest) pocket of his shirt like that If you but saw him trying to widen (the opening of his shirt) but it did not widen.",
      "usc_msa_ref": "689",
      "chain": [
        "30351",
        "20443",
        "20189",
        "11016",
        "11053",
        "13"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-muslim-2407",
      "hadith_no": "2407",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني سليمان بن عبيد الله أبو أيوب الغيلاني، حدثنا أبو عامر، - يعني العقدي - حدثنا إبراهيم بن نافع، عن الحسن بن مسلم، عن طاوس، عن أبي هريرة، قال ضرب رسول الله صلى الله عليه وسلم ‏\"‏ مثل البخيل والمتصدق كمثل رجلين عليهما جنتان من حديد قد اضطرت أيديهما إلى ثديهما وتراقيهما فجعل المتصدق كلما تصدق بصدقة انبسطت عنه حتى تغشي أنامله وتعفو أثره وجعل البخيل كلما هم بصدقة قلصت وأخذت كل حلقة مكانها ‏\"‏ ‏.‏ قال فأنا رأيت رسول الله صلى الله عليه وسلم يقول بإصبعه في جيبه فلو رأيته يوسعها ولا توسع ‏.‏",
      "text_en": " Abu Haraira reported that the Messenger of Allah (may peace be upon him) gave similitudes of a miserly man and the giver of charity as two persons who have two coats-of-mail over them with their hands pressed closely to their breasts and their collar bones. Whenever the giver of charity gives charity it (the coat-of mail) expands so much as to cover his finger tips and obliterate his foot prints. And whenever the miserly person intends to give charity (the coat-of-mail) contracts and every ring grips the place where it is. He (Abu Huraira) said:                      I saw the Messenger of Allah (may peace be upon him) saying with fingers in the opening of his shirt:\" If you had seen him trying to expand it, it will not expand.\"",
      "usc_msa_ref": "",
      "chain": [
        "20443",
        "20189",
        "11557",
        "11053",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2993",
      "hadith_no": "2993",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني حسن بن علي الحلواني، حدثنا زيد بن الحباب، حدثني إبراهيم بن نافع، حدثني عبد الله بن أبي نجيح، عن مجاهد، عن عائشة، - رضى الله عنها - أنها حاضت بسرف فتطهرت بعرفة فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ يجزئ عنك طوافك بالصفا والمروة عن حجك وعمرتك ‏\"‏ ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported that she entered in the monthly period at Sarif, and took bath at 'Arafa (after the period was over). The messenger of Allah (may peace be upon him) said to her:                      Your circumambulation between al Safa and al-Marwa is enough for your Hajj and 'Umra.",
      "usc_msa_ref": "",
      "chain": [
        "20650",
        "20189",
        "11254",
        "11028",
        "53"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-5691",
      "hadith_no": "5691",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثني زهير بن حرب، حدثنا زيد بن الحباب، عن إبراهيم بن نافع، أخبرني  الحسن بن مسلم بن يناق، عن صفية بنت شيبة، عن عائشة، أن امرأة، من الأنصار زوجت ابنة لها فاشتكت فتساقط شعرها فأتت النبي صلى الله عليه وسلم فقالت إن زوجها يريدها أفأصل شعرها فقال رسول الله صلى الله عليه وسلم ‏\"‏ لعن الواصلات ‏\"‏ ‏.‏  وحدثنيه محمد بن حاتم، حدثنا عبد الرحمن بن مهدي، عن إبراهيم بن نافع، بهذا الإسناد وقال ‏\"‏ لعن الموصلات ‏\"‏ ‏.‏",
      "text_en": " A'isha reported that a woman from the Ansar married her daughter who had lost her hair because of illness. She came to Allah's Apostle (may peace be upon him) and said:                      Her husband wants that false hair should be aaded to her head. Thereupon Allah's Messenger (may peace be upon him) said: The woman who adds false hair has been cursed. This hadith has been narrated on the authority of Nafi' with the same chain of transmitters but with a slight variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20650",
        "20189",
        "11557",
        "2802",
        "53"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-253",
      "hadith_no": "253",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا يحيى بن أبي بكير، حدثنا إبراهيم بن نافع، عن الحسن بن مسلم، عن صفية بنت شيبة، عن عائشة، قالت كانت إحدانا إذا أصابتها جنابة أخذت ثلاث حفنات هكذا - تعني بكفيها جميعا - فتصب على رأسها وأخذت بيد واحدة فصبتها على هذا الشق والأخرى على الشق الآخر ‏.‏",
      "text_en": " 'Aishah said:                      When any of us was sexually defiled, she took three handfuls (of water) in this way, that is to say, with both hands together and poured (water) over her head. She took one handful (of water) and threw it on one side and the other on the other side.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20365",
        "20189",
        "11557",
        "2802",
        "53"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-358",
      "hadith_no": "358",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن كثير العبدي، أخبرنا إبراهيم بن نافع، قال سمعت الحسن، - يعني ابن مسلم - يذكر عن مجاهد، قال قالت عائشة ما كان لإحدانا إلا ثوب واحد تحيض فيه فإن أصابه شىء من دم بلته بريقها ثم قصعته بريقها ‏.‏",
      "text_en": " 'Aishah said:                      Each of us (wives of the Prophet) had only one clothe in which she would menstruate. Whenever it was smeared with blood, she would moisten it with her saliva and scratch it with saliva.",
      "usc_msa_ref": "",
      "chain": [
        "30169",
        "20189",
        "11557",
        "11028"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1952",
      "hadith_no": "1952",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا ابن المبارك، عن إبراهيم بن نافع، عن ابن أبي نجيح، عن أبيه، عن رجلين، من بني بكر قالا رأينا رسول الله صلى الله عليه وسلم يخطب بين أوسط أيام التشريق ونحن عند راحلته وهي خطبة رسول الله صلى الله عليه وسلم التي خطب بمنى ‏.‏",
      "text_en": " Ibn AbuNajih reported from his father on the authority of two men from Banu Bakr who said:                      We saw the Messenger of Allah (ﷺ) addressing (the people) in the middle of the tashriq days when we were staying near his mount. This is the address of the Messenger of Allah (ﷺ) which he gave at Mina.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20025",
        "20189",
        "11254",
        "13495"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-an-nasai-242",
      "hadith_no": "242",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا عبد الرحمن، قال حدثنا إبراهيم بن نافع، عن ابن أبي نجيح، عن مجاهد، عن أم هانئ، أن رسول الله صلى الله عليه وسلم اغتسل هو وميمونة من إناء واحد في قصعة فيها أثر العجين ‏.‏",
      "text_en": " It was narrated from Umm Hani' that the Messenger of Allah (ﷺ) performed Ghusl, he and Maimunah from a single vessel, a bowl in which there were traces of dough.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20033",
        "20189",
        "11254",
        "11028",
        "198"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1067",
      "hadith_no": "1067",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرني محمد بن إسماعيل بن إبراهيم، قال حدثنا يحيى بن أبي بكير، قال حدثنا إبراهيم بن نافع، عن وهب بن ميناس العدني، عن سعيد بن جبير، عن ابن عباس، أن النبي صلى الله عليه وسلم كان إذا أراد السجود بعد الركعة يقول ‏\"‏ اللهم ربنا ولك الحمد ملء السموات وملء الأرض وملء ما شئت من شىء بعد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     When the Prophet (ﷺ) wanted to prostrate after bowing, he would say: \"Allahumma, Rabbana wa lakal-hamd, mil'as-samawati wa mil'al-ardi wa mil'ama shi'ta min shai'in ba'd ( O Allah, our Lord, to You be the Praise, filling the heavens, filling the Earth, and filling whatever else You will.)\"",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "20365",
        "20189",
        "11050",
        "17"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3692",
      "hadith_no": "3692",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Gifts - كتاب الهبة",
      "chapter_no": "32",
      "text_ar": "أخبرنا محمد بن حاتم، قال حدثنا حبان، قال أنبأنا عبد الله، عن إبراهيم بن نافع، عن الحسن بن مسلم، عن طاوس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يحل لأحد أن يهب هبة ثم يرجع فيها إلا من ولده ‏\"‏ ‏.‏ قال طاوس كنت أسمع وأنا صغير عائد في قيئه فلم ندر أنه ضرب له مثلا قال ‏\"‏ فمن فعل ذلك فمثله كمثل الكلب يأكل ثم يقيء ثم يعود في قيئه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Tawus said:                      \"The Messenger of Allah said: 'It is not permissible for anyone to give a gift then take it back, except from one's son.'\" Tawus said: \"When I was young I used to hear (the phrase), 'The one who goes back to his vomit,' but we did not realize that this was a similitude.\" He said: \"The likeness of the one who does that is that of a dog which eats then vomits, then goes back to its vomit.\"",
      "usc_msa_ref": "",
      "chain": [
        "30514",
        "20218",
        "20025",
        "20189",
        "11557",
        "11053"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5605",
      "hadith_no": "5605",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا أبو بكر بن علي، قال حدثنا نصر بن علي، قال أخبرني أبي قال، حدثنا إبراهيم بن نافع، عن ابن طاوس، عن أبيه، عن ابن عمر، قال خطب رسول الله صلى الله عليه وسلم فذكر آية الخمر فقال رجل يا رسول الله أرأيت المزر قال ‏\"‏ وما المزر ‏\"‏ ‏.‏ قال حبة تصنع باليمن ‏.‏ فقال ‏\"‏ تسكر ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ كل مسكر حرام ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah [SAW] delivered a Khutbah and quoted the Verse about Khamr. A man said: 'O Messenger of Allah, what do you think about Al-Mizr (beer)?' He said: 'What is beer?' He said: 'A (drink) from grains that is made in Yemen.' He said: 'Does it intoxicate?' He said: 'Yes.' He said: 'Every intoxicant is unlawful.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20264",
        "20189",
        "11433",
        "11053",
        "18"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-409",
      "hadith_no": "409",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو عامر الأشعري عبد الله بن عامر، حدثنا يحيى بن أبي بكير، حدثنا إبراهيم بن نافع، عن ابن أبي نجيح، عن مجاهد، عن أم هانئ، أن النبي  صلى الله عليه وسلم  اغتسل وميمونة من إناء واحد في قصعة فيها أثر العجين ‏.‏",
      "text_en": " It was narrated from Umm Hani that :                     The Prophet and Maimunah took a bath from a single vessel, a large bowl in which they were some traces of dough.",
      "usc_msa_ref": "",
      "chain": [
        "20365",
        "20189",
        "11254",
        "11028",
        "198"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 17,
  "grade_display": {
    "en": "Successor (Taba' Tabi') [7th Generation]",
    "ar": "تابع التابعين [الجيل السابع]",
    "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
  }
}