{
  "id": "20187",
  "name": "Ibrahim bin Tahman إبراهيم بن طهمان",
  "full_name": "Ibrahim bin Tahman إبراهيم بن طهمان",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "168",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Makkah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Khurasan",
      "Nisapur",
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Khurasni",
      "Nisapur",
      "Makkah"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11352",
      "name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11295",
      "name": "'Abdul 'Aziz bin Suhaib عبد العزيز بن صهيب البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11309",
      "name": "Nasr bin 'Imran bin Isam نصر بن عمران بن عصام",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11216",
      "name": "Muhammad bin Ziyad محمد بن زياد القرشي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11263",
      "name": "Muhammad bin Muslim bin Tadras محمد بن مسلم بن تدرس أبو الزبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11581",
      "name": "Hajjaj bin Hajjaj al-Bahli حجاج بن حجاج الباهلي البصري",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "20420",
      "name": "Hafs bin 'Abdullah bin Rashid حفص بن عبد الله بن راشد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28156",
      "name": "Khalid bin Nzar خالد بن نزار",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20443",
      "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30166",
      "name": "Muhammad bin Snan al-Bahly محمد بن سنان الباهلي أبو بكر البصري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30209",
      "name": "Muhammad bin Sabiq al-Tamimi محمد بن سابق التميمي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "892",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثنا أبو عامر العقدي، قال حدثنا إبراهيم بن طهمان، عن أبي جمرة الضبعي، عن ابن عباس، أنه قال إن أول جمعة جمعت بعد جمعة في مسجد رسول الله صلى الله عليه وسلم في مسجد عبد القيس بجواثى من البحرين‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The first Jumua prayer which was offered after a Jumua prayer offered at the mosque of Allah's Apostle took place in the mosque of the tribe of `Abdul Qais at Jawathi in Bahrain.",
      "chain": [
        "30170",
        "20443",
        "20187",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "1107",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "وقال إبراهيم بن طهمان عن الحسين المعلم، عن يحيى بن أبي كثير، عن عكرمة، عن ابن عباس  رضى الله عنهما  قال كان رسول الله صلى الله عليه وسلم يجمع بين صلاة الظهر والعصر إذا كان على ظهر سير، ويجمع بين المغرب والعشاء‏.‏",
      "text_en": "  Narrated Ibn `Abbas:                       Allah's Apostle used to offer the Zuhr and `Asr prayers together on journeys, and also used to offer the Maghrib and `Isha' prayers together. Narrated Anas bin Malik: The Prophet used to offer the Maghrib and the `Isha' prayers together on journeys.",
      "chain": [
        "20187",
        "11278",
        "11449",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1117",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا عبدان، عن عبد الله، عن إبراهيم بن طهمان، قال حدثني الحسين المكتب، عن ابن بريدة، عن عمران بن حصين  رضى الله عنه  قال كانت بي بواسير فسألت النبي صلى الله عليه وسلم عن الصلاة فقال ‏\"‏ صل قائما، فإن لم تستطع فقاعدا، فإن لم تستطع فعلى جنب ‏\"‏‏.‏",
      "text_en": " Narrated `Imran bin Husain:                     had piles, so I asked the Prophet about the prayer. He said, \"Pray while standing and if you can't, pray while sitting and if you cannot do even that, then pray Lying on your side.\"",
      "chain": [
        "30349",
        "20025",
        "20187",
        "11278",
        "11432",
        "123"
      ]
    },
    {
      "hadith_no": "1509",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عمر بن محمد بن الحسن الأسدي، حدثنا أبي، حدثنا إبراهيم بن طهمان، عن محمد بن زياد، عن أبي هريرة  رضى الله عنه  قال كان رسول الله صلى الله عليه وسلم يؤتى بالتمر عند صرام النخل فيجيء هذا بتمره وهذا من تمره حتى يصير عنده كوما من تمر، فجعل الحسن والحسين  رضى الله عنهما  يلعبان بذلك التمر، فأخذ أحدهما تمرة، فجعلها في فيه، فنظر إليه رسول الله صلى الله عليه وسلم فأخرجها من فيه فقال ‏\"‏ أما علمت أن آل محمد صلى الله عليه وسلم لا يأكلون الصدقة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Dates used to be brought to Allah's Apostle immediately after being plucked. Different persons would bring their dates till a big heap collected (in front of the Prophet). Once Al-Hasan and Al-Husain were playing with these dates. One of them took a date and put it in his mouth. Allah's Apostle looked at him and took it out from his mouth and said, \"Don't you know that Muhammad's offspring do not eat what is given in charity?\"",
      "chain": [
        "11530",
        "11217",
        "20187",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "2576",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثنا معن، قال حدثني إبراهيم بن طهمان، عن محمد بن زياد، عن أبي هريرة  رضى الله عنه  قال كان رسول الله صلى الله عليه وسلم ‏\"‏إذا أتي بطعام سأل عنه أهدية أم صدقة فإن قيل صدقة‏.‏ قال لأصحابه كلوا‏.‏ ولم يأكل، وإن قيل هدية‏.‏ ضرب بيده صلى الله عليه وسلم فأكل معهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Whenever a meal was brought to Allah's Apostle, he would ask whether it was a gift or Sadaqa (something given in charity). If he was told that it was Sadaqa, he would tell his companions to eat it, but if it was a gift, he would hurry to share it with them.",
      "chain": [
        "30308",
        "30112",
        "20187",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "3049",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "وقال إبراهيم عن عبد العزيز بن صهيب، عن أنس، قال أتي النبي صلى الله عليه وسلم بمال من البحرين، فجاءه العباس فقال يا رسول الله، أعطني فإني فاديت نفسي، وفاديت عقيلا‏.‏ فقال ‏\"‏ خذ ‏\"‏‏.‏ فأعطاه في ثوبه‏.‏",
      "text_en": " (In another narration) Anas said:                      \"Some wealth was brought to the Prophet from Bahrain. Al `Abbas came to him and said, 'O Allah's Apostle! Give me (some of it), as I have paid my and `Aqil's ransom.' The Prophet said, 'Take,' and gave him in his garment.\"",
      "chain": [
        "20187",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "4414",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبد الله بن محمد الجعفي، حدثنا أبو عامر عبد الملك، حدثنا إبراهيم  هو ابن طهمان  عن أبي جمرة، عن ابن عباس، رضى الله عنهما قال أول جمعة جمعت بعد جمعة جمعت في مسجد رسول الله صلى الله عليه وسلم في مسجد عبد القيس بجواثى‏.‏ يعني قرية من البحرين‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The first Friday (i.e. Jumua) prayer offered after the Friday Prayer offered at the Mosque of Allah's Apostle was offered at the mosque of `Abdul Qais situated at Jawathi, that is a village at Al Bahrain .",
      "chain": [
        "30351",
        "20187",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "4815",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "وقال إبراهيم بن طهمان عن ابن أبي ذئب، عن سعيد بن أبي سعيد المقبري، عن أبيه، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إن إبراهيم  عليه الصلاة والسلام  رأى أباه يوم القيامة عليه الغبرة والقترة ‏\"‏‏.‏ الغبرة هي القترة‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"On the Day of Resurrection Abraham will see his father covered with Qatara and Ghabara. (i.e. having a dark face).",
      "chain": [
        "20187",
        "20177",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "5329",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا إسحاق الواسطي، حدثنا خالد، عن خالد الحذاء، عن عكرمة، أن أخت عبد الله بن أبى، بهذا، وقال ‏\"‏ تردين حديقته ‏\"‏‏.‏ قالت نعم‏.‏ فردتها وأمره يطلقها‏.‏ وقال إبراهيم بن طهمان عن خالد عن عكرمة عن النبي صلى الله عليه وسلم وطلقها‏.‏",
      "text_en": " Narrated `Ikrima:                     The sister of `Abdullah bin Ubai narrated (the above narration, 197) with the addition that the Prophet said to Thabit's wife, \"Will you return his garden?\" She said, \"Yes,\" and returned it, and (then) the Prophet ordered Thabit to divorce her. Narrated Ibn `Abbas: The wife of Thabit bin Qais came to Allah's Apostle and said, \"O Allah's Apostle! I do not blame Thabit for any defects in his character or his religion, but I cannot endure to live with him.\" On that Allah's Apostle said, \"Will you return his garden to him?\" She said, \"Yes.\"",
      "chain": [
        "30312",
        "20423",
        "11282",
        "11023",
        "20187",
        "11282",
        "11023"
      ]
    },
    {
      "hadith_no": "5670",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "وقال إبراهيم بن طهمان عن شعبة، عن قتادة، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ رفعت إلى السدرة فإذا أربعة أنهار، نهران ظاهران، ونهران باطنان، فأما الظاهران النيل والفرات، وأما الباطنان فنهران في الجنة فأتيت بثلاثة أقداح، قدح فيه لبن، وقدح فيه عسل، وقدح فيه خمر، فأخذت الذي فيه اللبن فشربت فقيل لي أصبت الفطرة أنت وأمتك ‏\"‏‏.‏ قال هشام وسعيد وهمام عن قتادة عن أنس بن مالك عن مالك بن صعصعة عن النبي صلى الله عليه وسلم في الأنهار نحوه، ولم يذكروا ثلاثة أقداح‏.‏",
      "text_en": "",
      "chain": [
        "20187",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1420",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني أحمد بن يوسف الأزدي، حدثنا عمر بن عبد الله بن رزين، حدثنا إبراهيم، - يعني ابن طهمان - عن الحجاج، - وهو ابن حجاج - عن قتادة، عن أبي أيوب، عن عبد الله بن عمرو بن العاص، أنه قال سئل رسول الله صلى الله عليه وسلم عن وقت الصلوات فقال ‏\"‏ وقت صلاة الفجر ما لم يطلع قرن الشمس الأول ووقت صلاة الظهر إذا زالت الشمس عن بطن السماء ما لم يحضر العصر ووقت صلاة العصر ما لم تصفر الشمس ويسقط قرنها الأول ووقت صلاة المغرب إذا غابت الشمس ما لم يسقط الشفق ووقت صلاة العشاء إلى نصف الليل ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. 'Amr b. al-'As reported:                      The Messenger of Allah (may peace be upon him) was asked about the times of prayers. He said: The time for the morning prayer (lasts) as long as the first visible part of the rising sun does not appear and the time of the noon prayer is when the sun declines from the zenith and there is not a time for the afternoon prayer and the time for the afternoon prayer is so long as the sun does not become pale and its first visible part does not set, and the time for the evening prayer is that when the sun disappears and (it lasts) till the twilight is no more and the time for the night prayer is up to the midnight.",
      "chain": [
        "30535",
        "20187",
        "11019",
        "33",
        "29"
      ]
    },
    {
      "hadith_no": "2257",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، وهارون بن عبد الله، جميعا عن وهب بن جرير، عن شعبة، عن إسماعيل بن أبي خالد، ح وحدثني أبو غسان، محمد بن عمرو الرازي حدثنا يحيى بن الضريس، حدثنا إبراهيم بن طهمان، عن أبي حصين، كلاهما عن الشعبي، عن ابن عباس، عن النبي صلى الله عليه وسلم في صلاته على القبر نحو حديث الشيباني ‏.‏ ليس في حديثهم وكبر أربعا ‏.‏",
      "text_en": " The hadith as narrated by Shaibani has been narrated through another chain of transmitters.",
      "chain": [
        "30123",
        "20298",
        "20020",
        "11418",
        "20678",
        "20187",
        "11052",
        "17"
      ]
    },
    {
      "hadith_no": "2735",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن سابق، حدثنا إبراهيم بن طهمان، عن أبي الزبير، عن ابن كعب بن مالك، عن أبيه، أنه حدثه أن رسول الله صلى الله عليه وسلم بعثه وأوس بن الحدثان أيام التشريق فنادى ‏\"‏ أنه لا يدخل الجنة إلا مؤمن ‏.‏ وأيام منى أيام أكل وشرب ‏\"‏ ‏.‏",
      "text_en": " Ibn Ka'b b. Malik reported on the authority of his father that the Messenger of Allah (may peace be upon him) sent him and Aus b. Hadathan during the days of Tashriq to make this announcement:                      None but the believer would be admitted into Paradise, and the days of Mina' are the days meant for eating and drinking.",
      "chain": [
        "30201",
        "30209",
        "20187",
        "11263"
      ]
    },
    {
      "hadith_no": "2736",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثناه عبد بن حميد، حدثنا أبو عامر عبد الملك بن عمرو، حدثنا إبراهيم، بن طهمان بهذا الإسناد غير أنه قال فناديا ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibrahim b. Tahman with the same chain of transmitters but with this variation that he said:                      Both of them made the announcement.\"",
      "chain": [
        "30553",
        "20443",
        "20187"
      ]
    },
    {
      "hadith_no": "6078",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن أبي بكير، عن إبراهيم بن طهمان، حدثني سماك بن حرب، عن جابر بن سمرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إني لأعرف حجرا بمكة كان يسلم على قبل أن أبعث إني لأعرفه الآن ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Samura reported Allah's Messenger (may peace be upon him) as saying:                      I recognise the stone in Mecca which used to pay me salutations before my advent as a Prophet and I recognise that even now.",
      "chain": [
        "30201",
        "20365",
        "20187",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "952",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا وكيع، عن إبراهيم بن طهمان، عن حسين المعلم، عن ابن بريدة، عن عمران بن حصين، قال كان بي الناصور فسألت النبي صلى الله عليه وسلم فقال ‏\"‏ صل قائما فإن لم تستطع فقاعدا فإن لم تستطع فعلى جنب ‏\"‏ ‏.‏",
      "text_en": " ‘Imran b. Husain said :                      I had a fistula; so I asked the prophet (ﷺ). He said: offer prayer in standing condition; if you are unable to do so, then in sitting condition: if you are then at your side(i.e, in lying condition).",
      "chain": [
        "31160",
        "20032",
        "20187",
        "11278",
        "11432",
        "123"
      ]
    },
    {
      "hadith_no": "1068",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، ومحمد بن عبد الله المخرمي، - لفظه - قالا حدثنا وكيع، عن إبراهيم بن طهمان، عن أبي جمرة، عن ابن عباس، قال إن أول جمعة جمعت في الإسلام بعد جمعة جمعت في مسجد رسول الله صلى الله عليه وسلم بالمدينة لجمعة جمعت بجواثاء قرية من قرى البحرين ‏.‏ قال عثمان قرية من قرى عبد القيس ‏.‏",
      "text_en": " Ibn ‘Abbas said:                      The Friday prayer first offered in Islam after the Friday prayer offered in the mosque of the Messenger of Allah (ﷺ) is Friday prayer offered at Juwatha, a village from the villages of al-Bahrain. The narrator ‘Uthman said: it is a village from the village of the tribe of ‘Abd al-Qais.",
      "chain": [
        "30203",
        "20032",
        "20187",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "1379",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن حفص بن عبد الله السلمي، حدثنا أبي، حدثنا إبراهيم بن طهمان، عن عباد بن إسحاق، عن محمد بن مسلم الزهري، عن ضمرة بن عبد الله بن أنيس، عن أبيه، قال كنت في مجلس بني سلمة وأنا أصغرهم، فقالوا من يسأل لنا رسول الله صلى الله عليه وسلم عن ليلة القدر وذلك صبيحة إحدى وعشرين من رمضان ‏.‏ فخرجت فوافيت مع رسول الله صلى الله عليه وسلم صلاة المغرب ثم قمت بباب بيته فمر بي فقال ‏\"‏ ادخل ‏\"‏ ‏.‏ فدخلت فأتي بعشائه فرآني أكف عنه من قلته فلما فرغ قال ‏\"‏ ناولني نعلي ‏\"‏ ‏.‏ فقام وقمت معه فقال ‏\"‏ كأن لك حاجة ‏\"‏ ‏.‏ قلت أجل أرسلني إليك رهط من بني سلمة يسألونك عن ليلة القدر فقال ‏\"‏ كم الليلة ‏\"‏ ‏.‏ فقلت اثنتان وعشرون قال ‏\"‏ هي الليلة ‏\"‏ ‏.‏ ثم رجع فقال ‏\"‏ أو القابلة ‏\"‏ ‏.‏ يريد ليلة ثلاث وعشرين ‏.‏",
      "text_en": " Narrated Abdullah ibn Unays:                     I was present at the gathering of Banu Salamah, and I was the youngest of them.  They (the people) said: Who will ask the Messenger of Allah (ﷺ) for us about Laylat al-Qadr? That was the twenty-first of Ramadan. I went out and said the sunset prayer along with the Messenger of Allah (ﷺ). I then stood at the door of his house.  He passed by me and said: Come in. I entered (the house) and dinner was brought for him. I was prevented from taking food as it was scanty.  When he finished his dinner, he said to me: Give me my shoes. He then stood up and I also stood up with him. He said: Perhaps you have some business with me.  I said: Yes. Some people of Banu Salamah have sent me to you to ask you about Laylat al-Qadr. He asked: Which night: Is it tonight?  I said: Twenty-second.  He said: This is the very night. He then withdrew and said: Or the following night, referring to the twenty-third night.",
      "chain": [
        "30293",
        "20420",
        "20187",
        "20176",
        "12190",
        "1048"
      ]
    },
    {
      "hadith_no": "1707",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Lost and Found Items - كتاب اللقطة",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن حفص، حدثني أبي، حدثني إبراهيم بن طهمان، عن عباد بن إسحاق، عن عبد الله بن يزيد، عن أبيه، يزيد مولى المنبعث عن زيد بن خالد الجهني، أنه قال سئل رسول الله صلى الله عليه وسلم فذكر نحو حديث ربيعة ‏.‏ قال وسئل عن اللقطة فقال ‏\"‏ تعرفها حولا فإن جاء صاحبها دفعتها إليه وإلا عرفت وكاءها وعفاصها ثم أفضها في مالك فإن جاء صاحبها فادفعها إليه ‏\"‏ ‏.‏",
      "text_en": " The aforesaid tradition has also been transmitted by Zaid bin Khalid al-Juhani through a different chain of narrators. This version has:                      The Messenger of Allah (SWAS) was asked about a find.  He replied : Make the matter known for a year; if its owner comes, give it to him, otherwise note its string and its container and have it along with your property.  If its owner comes, deliver it to him.",
      "chain": [
        "30293",
        "20420",
        "20187",
        "1945",
        "3625"
      ]
    },
    {
      "hadith_no": "2112",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن حفص بن عبد الله، حدثني أبي حفص بن عبد الله، حدثني إبراهيم بن طهمان، عن الحجاج بن الحجاج الباهلي، عن عسل، عن عطاء بن أبي رباح، عن أبي هريرة، نحو هذه القصة لم يذكر الإزار والخاتم فقال ‏\"‏ ما تحفظ من القرآن ‏\"‏ ‏.‏ قال سورة البقرة أو التي تليها ‏.‏ قال ‏\"‏ فقم فعلمها عشرين آية وهي امرأتك ‏\"‏ ‏.‏",
      "text_en": " A tradition similar to the one narrated above has also been transmitted by Abu Hurairah through a different chain of narrators. This version does not mention the lower garment and iron ring. He (the Prophet) said:                      How much do you memorize from Qur'an? He said: Surat al-Baqarah or the one that follows it. He said: Stand up and teach her twenty verses: she is your wife.",
      "chain": [
        "30293",
        "20187",
        "11581",
        "11029"
      ]
    },
    {
      "hadith_no": "2302",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا يعقوب بن إبراهيم الدورقي، حدثنا يحيى بن أبي بكير، حدثنا إبراهيم بن طهمان، حدثني هشام بن حسان، ح وحدثنا عبد الله بن الجراح القهستاني، عن عبد الله، - يعني ابن بكر - السهمي عن هشام، - وهذا لفظ ابن الجراح - عن حفصة، عن أم عطية، أن النبي صلى الله عليه وسلم قال ‏\"‏ لا تحد المرأة فوق ثلاث إلا على زوج فإنها تحد عليه أربعة أشهر وعشرا لا تلبس ثوبا مصبوغا إلا ثوب عصب ولا تكتحل ولا تمس طيبا إلا أدنى طهرتها إذا طهرت من محيضها بنبذة من قسط أو أظفار ‏\"‏ ‏.‏ قال يعقوب مكان عصب ‏\"‏ إلا مغسولا ‏\"‏ ‏.‏ وزاد يعقوب ‏\"‏ ولا تختضب ‏\"‏ ‏.‏",
      "text_en": " ‘Umm Athiyah reported the Prophet(ﷺ) as saying “A woman must not observe mourning for more than three (days) except for four months and ten days in the case of a husband  and she must not wear a dyed garment except one of the types made of dyed yarn or apply collyrium or touch perfume except for a little costus or azfar when she has been purified after her menstrual courses.The narrator Ya’qub mentioned the words “except washed clothes” instead of the words “one of the types made of dyed yarn”. Ya’qub also added “She must not apply Henna”",
      "chain": [
        "30400",
        "20365",
        "20187",
        "11311",
        "38293",
        "20244",
        "11065",
        "54",
        "71"
      ]
    },
    {
      "hadith_no": "2304",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا زهير بن حرب، حدثنا يحيى بن أبي بكير، حدثنا إبراهيم بن طهمان، حدثني بديل، عن الحسن بن مسلم، عن صفية بنت شيبة، عن أم سلمة، زوج النبي صلى الله عليه وسلم عن النبي صلى الله عليه وسلم أنه قال المتوفى عنها زوجها لا تلبس المعصفر من الثياب ولا الممشقة ولا الحلي ولا تختضب ولا تكتحل ‏\"‏ ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     The Prophet (ﷺ) said: A woman whose husband has died must not wear clothes dyed with safflower (usfur) or with red ochre (mishq) and ornaments. She must not apply henna and collyrium.",
      "chain": [
        "30022",
        "20365",
        "20187",
        "11557",
        "2802"
      ]
    },
    {
      "hadith_no": "3133",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا معن بن عيسى، ح وحدثنا عبيد الله بن عمر الجشمي، حدثنا عبد الرحمن بن مهدي، عن إبراهيم بن طهمان، عن أبي الزبير، عن جابر، قال رمي رجل بسهم في صدره أو في حلقه فمات فأدرج في ثيابه كما هو - قال - ونحن مع رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     A man had a shot of arrow in his chest or throat (the narrator is doubtful). So he died. He was shrouded in his clothes as he was. The narrator said: We were with the Messenger of Allah (ﷺ).",
      "chain": [
        "30367",
        "30112",
        "20033",
        "20187",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3303",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا أحمد بن حفص بن عبد الله السلمي، قال حدثني أبي قال، حدثني إبراهيم، - يعني ابن طهمان - عن مطر، عن عكرمة، عن ابن عباس، ‏:‏ أن أخت، عقبة بن عامر نذرت أن تحج، ماشية وأنها لا تطيق ذلك، فقال النبي صلى الله عليه وسلم ‏:‏ ‏\"‏ إن الله لغني عن مشى أختك، فلتركب ولتهد بدنة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The sister of Uqbah ibn Amir took a vow that she would perform hajj on foot, and she was unable to do so. The Prophet (ﷺ) said: Allah is not in need of the walking of your sister. She must ride and offer a sacrificial camel.",
      "chain": [
        "30293",
        "20420",
        "20187",
        "11023"
      ]
    },
    {
      "hadith_no": "3414",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا ابن أبي خلف، حدثنا محمد بن سابق، عن إبراهيم بن طهمان، عن أبي الزبير، عن جابر، أنه قال أفاء الله على رسوله خيبر فأقرهم رسول الله صلى الله عليه وسلم كما كانوا وجعلها بينه وبينهم فبعث عبد الله بن رواحة فخرصها عليهم ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     When Allah bestowed Khaybar on His Prophet (ﷺ) as fay' (as a result of conquest without fighting), the Messenger of Allah (ﷺ) allowed (them) to remain there as they were before, and apportioned it between him and them. He then sent Abdullah ibn Rawahah who assessed (the amount of dates) upon them.",
      "chain": [
        "30209",
        "20187",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "4135",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن عبد الرحيم أبو يحيى، أخبرنا أبو أحمد الزبيري، حدثنا إبراهيم بن طهمان، عن أبي الزبير، عن جابر، قال نهى رسول الله صلى الله عليه وسلم أن ينتعل الرجل قائما ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Messenger of Allah (ﷺ) forbade that a man should put on sandals while standing.",
      "chain": [
        "20355",
        "20187",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "4353",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن سنان الباهلي، حدثنا إبراهيم بن طهمان، عن عبد العزيز بن رفيع، عن عبيد بن عمير، عن عائشة، رضى الله عنها قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يحل دم امرئ مسلم يشهد أن لا إله إلا الله وأن محمدا رسول الله إلا بإحدى ثلاث رجل زنى بعد إحصان فإنه يرجم ورجل خرج محاربا لله ورسوله فإنه يقتل أو يصلب أو ينفى من الأرض أو يقتل نفسا فيقتل بها ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) Said:  The blood of a Muslim man who testifies that there is no god but Allah and that Muhammad is Allah's Apostle  should not lawfully be shed except only for one of three reasons: a man who committed fornication after marriage, in which case he should be stoned; one who goes forth to fight with Allah and His Apostle, in which case he should be killed or crucified or exiled from the land; or one who commits murder for which he is killed.",
      "chain": [
        "34207",
        "20187",
        "11257",
        "11259",
        "53"
      ]
    },
    {
      "hadith_no": "4725",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن حفص، قال حدثني أبي، حدثنا إبراهيم بن طهمان، عن سماك، بإسناده ومعنى هذا الحديث الطويل ‏.‏",
      "text_en": " The tradition mentioned above has again been transmitted by Simak through a different chain of narrators and to the same effect as this lengthy tradition.",
      "chain": [
        "30293",
        "20420",
        "20187"
      ]
    },
    {
      "hadith_no": "4727",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن حفص بن عبد الله، قال حدثني أبي قال، حدثني إبراهيم بن طهمان، عن موسى بن عقبة، عن محمد بن المنكدر، عن جابر بن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ أذن لي أن أحدث عن ملك من ملائكة الله من حملة العرش إن ما بين شحمة أذنه إلى عاتقه مسيرة سبعمائة عام ‏\"‏ ‏.‏",
      "text_en": " Jabir b. ‘Abd Allah reported the Prophet (May peace be upon him) as saying :                      I have been permitted to tell about one of Allah’s angels who bears the throne that the distance between the lobe of his ear and his shoulder is a journey of seven hundred years.",
      "chain": [
        "30293",
        "20420",
        "20187",
        "11106",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "4895",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن حفص، قال حدثني أبي، حدثني إبراهيم بن طهمان، عن الحجاج، عن قتادة، عن يزيد بن عبد الله، عن عياض بن حمار، أنه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله أوحى إلى أن تواضعوا حتى لا يبغي أحد على أحد ولا يفخر أحد على أحد ‏\"‏ ‏.‏",
      "text_en": " Narrated Iyad ibn Himar (al-Mujashi'i):                     The Prophet (ﷺ) said: Allah has revealed to me that you must be humble, so that no one oppresses another and boasts over another.",
      "chain": [
        "30293",
        "20420",
        "20187",
        "20381",
        "11019",
        "11318",
        "5217"
      ]
    },
    {
      "hadith_no": "4995",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا أبو عامر، حدثنا إبراهيم بن طهمان، عن علي بن عبد الأعلى، عن أبي النعمان، عن أبي وقاص، عن زيد بن أرقم، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا وعد الرجل أخاه - ومن نيته أن يفي له - فلم يف ولم يجئ للميعاد فلا إثم عليه ‏\"‏ ‏.‏",
      "text_en": " Narrated Zayd ibn Arqam:                     The Prophet (ﷺ) said: When a man makes a promise to his brother with the intention of fulfilling it and does not do so, and does not come at the appointed time, he is guilty of no sin.",
      "chain": [
        "30170",
        "20443",
        "20187",
        "19877",
        "20283",
        "384"
      ]
    },
    {
      "hadith_no": "4996",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن يحيى بن فارس النيسابوري، حدثنا محمد بن سنان، حدثنا إبراهيم بن طهمان، عن بديل، عن عبد الكريم، عن عبد الله بن شقيق، عن أبيه، عن عبد الله بن أبي الحمساء، قال بايعت النبي صلى الله عليه وسلم ببيع قبل أن يبعث وبقيت له بقية فوعدته أن آتيه بها في مكانه فنسيت ثم ذكرت بعد ثلاث فجئت فإذا هو في مكانه فقال ‏\"‏ يا فتى لقد شققت على أنا ها هنا منذ ثلاث أنتظرك ‏\"‏ ‏.‏ قال أبو داود قال محمد بن يحيى هذا عندنا عبد الكريم بن عبد الله بن شقيق ‏.‏ قال أبو داود هكذا بلغني عن علي بن عبد الله ‏.‏ قال أبو داود بلغني أن بشر بن السري رواه عن عبد الكريم بن عبد الله بن شقيق ‏.‏",
      "text_en": " Narrated Abdullah ibn AbulHamsa':                     I bought something from the Prophet (ﷺ) before he received his Prophetic commission, and as there was something still due to him I promised him that I would bring it to him at his place, but I forgot. When I remembered three days later, I went to that place and found him there. He said: You have vexed me, young man. I have been here for three days waiting for you.Abu Dawud said: Muhammad b. Yahya said : This is, in our opinion, 'Abd al-Karim b. 'Abd Allah b. Shaqiq (instead of \"from 'Abd al-Karim from 'Abd Allah b. Shaqiq\"). Abu Dawud said: In a similar way I have been informed by 'Ali b. 'Abd Allah.Abu Dawud said: I have been told that Bishr b. al-Sarri transmitted it from 'Abd Allah b. Shaqiq.",
      "chain": [
        "11222",
        "34207",
        "20187",
        "18655",
        "10694"
      ]
    },
    {
      "hadith_no": "372",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "وقد روي هذا الحديث، عن إبراهيم بن طهمان، بهذا الإسناد إلا أنه يقول عن عمران بن حصين، قال سألت رسول الله صلى الله عليه وسلم عن صلاة المريض فقال ‏\"‏ صل قائما فإن لم تستطع فقاعدا فإن لم تستطع فعلى جنب ‏\"‏ ‏.‏ حدثنا بذلك هناد حدثنا وكيع عن إبراهيم بن طهمان عن حسين المعلم بهذا الحديث ‏.‏ قال أبو عيسى ولا نعلم أحدا روى عن حسين المعلم نحو رواية إبراهيم بن طهمان ‏.‏ وقد روى أبو أسامة وغير واحد عن حسين المعلم نحو رواية عيسى بن يونس ‏.‏ ومعنى هذا الحديث عند بعض أهل العلم في صلاة التطوع ‏.‏ حدثنا محمد بن بشار حدثنا ابن أبي عدي عن أشعث بن عبد الملك عن الحسن قال إن شاء الرجل صلى صلاة التطوع قائما وجالسا ومضطجعا ‏.‏ واختلف أهل العلم في صلاة المريض إذا لم يستطع أن يصلي جالسا فقال بعض أهل العلم يصلي على جنبه الأيمن ‏.‏ وقال بعضهم يصلي مستلقيا على قفاه ورجلاه إلى القبلة ‏.‏ وقال سفيان الثوري في هذا الحديث ‏\"‏ من صلى جالسا فله نصف أجر القائم ‏\"‏ ‏.‏ قال هذا للصحيح ولمن ليس له عذر ‏.‏ يعني في النوافل فأما من كان له عذر من مرض أو غيره فصلى جالسا فله مثل أجر القائم ‏.‏ وقد روي في بعض هذا الحديث مثل قول سفيان الثوري ‏.‏",
      "text_en": " This Hadith has been related from Ibrahim bin Tahman with this chain. Except that he said:                     \"From Imran bin Husain who said: 'I asked Allah's Messenger (S) about Salat for a sick person. He said: \"He performs Salat standing, if he is not able then sitting, if he is not able then on his side.\"",
      "chain": [
        "20187",
        "123"
      ]
    },
    {
      "hadith_no": "2633",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر، حدثنا إبراهيم بن طهمان، عن علي بن عبد الأعلى، عن أبي النعمان، عن أبي وقاص، عن زيد بن أرقم، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا وعد الرجل وينوي أن يفي به فلم يف به فلا جناح عليه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب وليس إسناده بالقوي ‏.‏ علي بن عبد الأعلى ثقة ولا يعرف أبو النعمان ولا أبو وقاص وهما مجهولان ‏.‏",
      "text_en": " Narrated Zaid bin Arqam:                     that the Messenger of Allah (ﷺ) said: \"Whenever a man makes a promise and he intends to fulfill it, but he does not fulfill it, then there is no burden upon him.\"",
      "chain": [
        "30160",
        "20443",
        "20187",
        "19877",
        "20283",
        "384"
      ]
    },
    {
      "hadith_no": "416",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن إبراهيم بن طهمان، عن أبي الزبير، عن عبيد بن عمير، أن عائشة، قالت لقد رأيتني أغتسل أنا ورسول الله صلى الله عليه وسلم من هذا فإذا تور موضوع مثل الصاع أو دونه فنشرع فيه جميعا فأفيض على رأسي بيدى ثلاث مرات وما أنقض لي شعرا ‏‏.‏‏",
      "text_en": " 'Aishah said:                      \"I remember performing Ghusl - myself and the Messenger of Allah (ﷺ), from this\" - a vessel like a Sa' or smaller. \"We both started taking water from it and I poured water over my head with my hand, three times, without undoing any of my hair.\"",
      "chain": [
        "38265",
        "20025",
        "20187",
        "11263",
        "11259",
        "53"
      ]
    },
    {
      "hadith_no": "1354",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا أحمد بن حفص بن عبد الله النيسابوري، قال حدثني أبي قال، حدثني إبراهيم، - يعني ابن طهمان - عن الحجاج بن الحجاج، عن أبي الزبير، عن أبي علقمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من سبح في دبر صلاة الغداة مائة تسبيحة وهلل مائة تهليلة غفرت له ذنوبه ولو كانت مثل زبد البحر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah (ﷺ) said: 'Whoever says the tasbih one hundred times following the morning prayer, and the tahlil one hundred times, he will be forgiven his sins even if they are like the foam of the sea.'\"",
      "chain": [
        "30293",
        "20420",
        "20187",
        "11263",
        "13"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا محمد بن عبد الله بن عمار، قال حدثنا المعافى، عن إبراهيم بن طهمان، عن محمد بن زياد، عن أبي هريرة، قال إن أول جمعة جمعت بعد جمعة جمعت مع رسول الله صلى الله عليه وسلم بمكة جمعة بجواثا بالبحرين قرية لعبد القيس ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The first Jumu'ah that was held with the Messenger of Allah (ﷺ) in Makkah, was a Jum'ah in Juwatha in al-Bahrain, a village of 'Abdul-Qais.\"",
      "chain": [
        "30029",
        "20187",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "1597",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Prayer for the Two 'Eids - كتاب صلاة العيدين",
      "chapter_no": "19",
      "text_ar": "أخبرنا أحمد بن حفص بن عبد الله، قال حدثني أبي قال، حدثني إبراهيم بن طهمان، عن مالك بن أنس، عن الزهري، عن عروة، أنه حدثه أن عائشة حدثته أن أبا بكر الصديق دخل عليها وعندها جاريتان تضربان بالدف وتغنيان ورسول الله صلى الله عليه وسلم مسجى بثوبه - وقال مرة أخرى متسج ثوبه - فكشف عن وجهه فقال ‏\"‏ دعهما يا أبا بكر إنها أيام عيد ‏\"‏ ‏.‏ وهن أيام منى ورسول الله صلى الله عليه وسلم يومئذ بالمدينة ‏.‏",
      "text_en": " It was narrated from 'Urwah that he narrated from Aishah that Abu Bakr As-Siddiq :                     Entered upon her and there were two girls with her beating the duff and singing, and the Messenger of Allah (ﷺ) was covered with his garment. He uncovered his face and said: \"Let them be there, O Abu Bakr, for these are the days of 'Eid.\" Those were the days of Mina and the Messenger of Allah (ﷺ) was in Al-Madinah on that day.\"",
      "chain": [
        "30293",
        "20420",
        "20187",
        "20001",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1822",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا أحمد بن حفص بن عبد الله، قال حدثني أبي قال، حدثني إبراهيم بن طهمان، عن الحجاج، - وهو البصري - عن يونس، عن ثابت، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تدعوا بالموت ولا تتمنوه فمن كان داعيا لا بد فليقل اللهم أحيني ما كانت الحياة خيرا لي وتوفني إذا كانت الوفاة خيرا لي ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"The Messenger of Allah said: 'Do not pray for death or wish for it. Whoever insists on praying for it let him say: Allahumma ahini ma kanatil-hayatu khairanli wa tawaffani idha kanatil-wafatu khairanli (O Allah, keep me alive so long as life is good for me, and cause me to die when death is good for me.)\"'",
      "chain": [
        "30293",
        "20420",
        "20187",
        "20475",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "2465",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا أحمد بن حفص، قال حدثني أبي قال، قال حدثني إبراهيم بن طهمان، عن موسى، قال حدثني أبو الزناد، عن عبد الرحمن، عن أبي هريرة، قال أمر رسول الله صلى الله عليه وسلم بصدقة مثله سواء ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah enjoined giving Sadaqah;\"and he narrated something similar.",
      "chain": [
        "30293",
        "20420",
        "20187",
        "20040",
        "11061",
        "10530",
        "13"
      ]
    },
    {
      "hadith_no": "3535",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا يحيى بن أبي بكير، قال حدثنا إبراهيم بن طهمان، قال حدثني بديل، عن الحسن بن مسلم، عن صفية بنت شيبة، عن أم سلمة، زوج النبي صلى الله عليه وسلم عن النبي صلى الله عليه وسلم قال ‏\"‏ المتوفى عنها زوجها لا تلبس المعصفر من الثياب ولا الممشقة ولا تختضب ولا تكتحل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Safiyyah bint Shaibah, from Umm Salamah, the wife of the Prophet, that the Prophet said:                      \"The woman whose husband has died should not wear clothes that are dyed with safflower or red clay, and she should not use dye nor kohl.\"",
      "chain": [
        "34188",
        "20365",
        "20187",
        "11557",
        "2802"
      ]
    },
    {
      "hadith_no": "3564",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرني أحمد بن حفص، قال حدثني أبي قال، حدثني إبراهيم بن طهمان، عن سعيد بن أبي عروبة، عن قتادة، عن أنس، قال لم يكن شىء أحب إلى رسول الله صلى الله عليه وسلم بعد النساء من الخيل ‏.‏",
      "text_en": " It was narrated that Anas said:                      \"There was nothing dearer to the Messenger of Allah after women than horses.\"",
      "chain": [
        "30293",
        "20420",
        "20187",
        "11073",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "3854",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا أحمد بن حفص، قال حدثني أبي قال، حدثني إبراهيم بن طهمان، عن يحيى بن سعيد، عن حميد الطويل، عن أنس بن مالك، قال أتى رسول الله صلى الله عليه وسلم على رجل يهادى بين ابنيه فقال ‏\"‏ ما شأن هذا ‏\"‏ ‏.‏ فقيل نذر أن يمشي إلى الكعبة ‏.‏ فقال ‏\"‏ إن الله لا يصنع بتعذيب هذا نفسه شيئا ‏\"‏ ‏.‏ فأمره أن يركب ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                      \"The Messenger of Allah came to a man who was being supported by two others and said: 'What is the matter with him?' It was said: 'He vowed to walk to the Ka'bah.' He said: 'Allah does not benefit from his torturing himself.' And he told him to ride.\"",
      "chain": [
        "30293",
        "20420",
        "20187",
        "11062",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "3941",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Kind Treatment of Women - كتاب عشرة النساء",
      "chapter_no": "36",
      "text_ar": "أخبرنا أحمد بن حفص بن عبد الله، قال حدثني أبي قال، حدثني إبراهيم بن طهمان، عن سعيد بن أبي عروبة، عن قتادة، عن أنس بن مالك، قال لم يكن شىء أحب إلى رسول الله صلى الله عليه وسلم بعد النساء من الخيل ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                      \"Nothing was dearer to the Messenger of Allah after women than horses.\"",
      "chain": [
        "30293",
        "20420",
        "20187",
        "11073",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "3994",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أحمد بن حفص، قال حدثني أبي قال، حدثني إبراهيم بن طهمان، عن الأعمش، عن شقيق، ثم ذكر كلمة معناها عن عمرو بن شرحبيل، عن عبد الله، قال أول ما يقضى بين الناس يوم القيامة في الدماء ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"The first matter concerning which scores will be settled among the people on the Day of Resurrection will be bloodshed.\"",
      "chain": [
        "30293",
        "20420",
        "20187",
        "11060",
        "11644",
        "16"
      ]
    },
    {
      "hadith_no": "4048",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا العباس بن محمد الدوري، قال حدثنا أبو عامر العقدي، عن إبراهيم بن طهمان، عن عبد العزيز بن رفيع، عن عبيد بن عمير، عن عائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يحل دم امرئ مسلم إلا بإحدى ثلاث خصال زان محصن يرجم أو رجل قتل رجلا متعمدا فيقتل أو رجل يخرج من الإسلام يحارب الله عز وجل ورسوله فيقتل أو يصلب أو ينفى من الأرض ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that:                     The Messenger of Allah [SAW] said: \"It is not permissible to shed the blood of a Muslim except in three cases: An adulterer who had been married, who should be stoned to death; a man who killed another man intentionally, who should be killed; and a man who left Islam and waged war against Allah, the Might and Sublime, and His Messenger, who should be killed, or crucified, or banished from the land.\"",
      "chain": [
        "20443",
        "20187",
        "11257",
        "11259",
        "53"
      ]
    },
    {
      "hadith_no": "4219",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-'Aqiqah - كتاب العقيقة",
      "chapter_no": "40",
      "text_ar": "أخبرنا أحمد بن حفص بن عبد الله، قال حدثني أبي قال، حدثني إبراهيم، - هو ابن طهمان - عن الحجاج بن الحجاج، عن قتادة، عن عكرمة، عن ابن عباس، قال عق رسول الله صلى الله عليه وسلم عن الحسن والحسين رضى الله عنهما بكبشين كبشين ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah offered an 'Aqiqah for Al-Hasan and Al-Husain, may Allah be please with them, two rams for each.\"",
      "chain": [
        "30293",
        "20420",
        "20187",
        "11019",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4452",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا أحمد بن حفص بن عبد الله النيسابوري، قال حدثني أبي قال، حدثني إبراهيم بن طهمان، عن عمر بن سعيد، عن الأعمش، عن إبراهيم، عن الأسود، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أطيب ما أكل الرجل من كسبه وإن ولده من كسبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah said: 'The best (most pure) food that a man eats is that which he has earned himself and his child (and his child's wealth) is part of hiss earning.\"",
      "chain": [
        "30293",
        "20420",
        "20187",
        "10652",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "4746",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أحمد بن حفص، قال حدثني أبي قال، حدثني إبراهيم بن طهمان، عن الحجاج بن الحجاج، عن قتادة، عن أبي حسان الأعرج، عن الأشتر، أنه قال لعلي إن الناس قد تفشغ بهم ما يسمعون فإن كان رسول الله صلى الله عليه وسلم عهد إليك عهدا فحدثنا به ‏.‏ قال ما عهد إلى رسول الله صلى الله عليه وسلم عهدا لم يعهده إلى الناس غير أن في قراب سيفي صحيفة فإذا فيها ‏\"‏ المؤمنون تتكافأ دماؤهم يسعى بذمتهم أدناهم لا يقتل مؤمن بكافر ولا ذو عهد في عهده ‏\"‏ ‏.‏ مختصر ‏.‏",
      "text_en": " It was narrataed from Al-Ashtar that he said to 'Ali:                     \"What the people have been hearing from you has become widespread. If the Messenger of Allah told you anything, then tell us,\" He said: \"The Messenger of Allah did not tell me anything that he did not tell the people, except that in the sheath of my sword there is a sheet, in which it says: 'The lives of the believers are equal in value, and they hasten to support the asylum granted by the least of them. But no believer may be killed in return for a disbeliever, nor one with a covenant while his covenant is in effect.\"' It is an abridgement of it.",
      "chain": [
        "30293",
        "20420",
        "20187",
        "11019",
        "10730",
        "11041"
      ]
    },
    {
      "hadith_no": "5274",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أحمد بن حفص بن عبد الله، حدثني أبي قال، حدثني إبراهيم بن طهمان، عن الحجاج، - وهو ابن الحجاج - عن قتادة، عن عبد الملك بن عبيد، عن بشير بن نهيك، عن أبي هريرة، قال نهى رسول الله صلى الله عليه وسلم عن تختم الذهب ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     The Messenger of Allah [SAW] forbade gold rings.",
      "chain": [
        "30293",
        "20420",
        "20187",
        "11019",
        "18661",
        "11266",
        "13"
      ]
    }
  ],
  "total_hadiths": 56
}