{
  "id": "20183",
  "name": "Yahya bin Wadh يحيى بن واضح",
  "full_name": "Yahya bin Wadh يحيى بن واضح",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": [],
      "place": "Medina"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Ansar",
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20648",
      "name": "al-Husain bin Waqid ak-Mervzi الحسين بن واقد المروزي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28306",
      "name": "'Abdullah bin Muslim al-Salmi عبد الله بن مسلم السلمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30376",
      "name": "Muhammad bin Salam al-Baykandi محمد بن سلام البيكندي الكبير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "38240",
      "name": "Sa'id bin Y'aqub al-Talqany سعيد بن يعقوب الطالقاني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30468",
      "name": "'Abdullah bin 'Umar عبد الله بن عمر",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38495",
      "name": "Muhammad bin Hmyd bin Hyan محمد بن حميد بن حيان",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30212",
      "name": "Muhammad bin 'Abdullah bin Numayr محمد بن عبد الله بن نمير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30400",
      "name": "Y'aqub bin Ibrahim bin Kathir يعقوب بن إبراهيم بن كثير بن زيد الدورقي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30563",
      "name": "Muhammad bin 'Amr bin Bakr al-Razi محمد بن عمرو بن بكر الرازي زنيج",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36540",
      "name": "al-Hasan bin Arfh bin Yazid الحسن بن عرفة بن يزيد",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4798",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا زيد بن الحباب، ح وحدثنا سعيد بن محمد، الجرمي حدثنا أبو تميلة، قالا جميعا حدثنا حسين بن واقد، عن عبد الله بن بريدة، عن أبيه، ‏.‏ قال غزا رسول الله صلى الله عليه وسلم تسع عشرة غزوة قاتل في ثمان منهن ‏.‏ ولم يقل أبو بكر منهن ‏.‏ وقال في حديثه حدثني عبد الله بن بريدة ‏.‏",
      "text_en": " It has been narrated on the authority of Buraida (who heard the tradition from his father) that the Messenger of Allah (may peace be upon him) conducted nineteen military campaigns and he (actually) fought in eight of them.",
      "chain": [
        "30201",
        "20650",
        "30195",
        "20183",
        "20648",
        "11432"
      ]
    },
    {
      "hadith_no": "4026",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا زياد بن أيوب، حدثنا أبو تميلة، قال حدثني عبد المؤمن بن خالد، عن عبد الله بن بريدة، عن أبيه، عن أم سلمة، قالت لم يكن ثوب أحب إلى رسول الله صلى الله عليه وسلم من قميص ‏.‏",
      "text_en": " Narrated Umm Salamah, Ummul Mu'minin:                     No clothing was dearer to be Messenger of Allah (ﷺ) than shirt.",
      "chain": [
        "30249",
        "20183",
        "28375",
        "11432",
        "3131",
        "56"
      ]
    },
    {
      "hadith_no": "4544",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "قال أبو داود قرأت على سعيد بن يعقوب الطالقاني قال حدثنا أبو تميلة، حدثنا محمد بن إسحاق، قال ذكر عطاء عن جابر بن عبد الله، قال فرض رسول الله صلى الله عليه وسلم فذكر مثل حديث موسى ‏.‏ قال وعلى أهل الطعام شيئا لا أحفظه ‏.‏",
      "text_en": " Abu Dawud said:                      I read out to Sa'id b. Ya'qub al-Taliqini who said: Abu Tumailah transmitted to us, saying: Muhammad b. Ishaq transmitted to us saying: 'Ata reported Jabir b. 'Abd Allah as saying: The Messenger of Allah (ﷺ) fixed; and he mentioned the tradition like that of Musa; he said: And those who possess corn food should pay something which I do not remember.",
      "chain": [
        "30002",
        "20183",
        "11107",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "4561",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا عبد الله بن عمر بن محمد بن أبان، حدثنا أبو تميلة، عن حسين المعلم، عن يزيد النحوي، عن عكرمة، عن ابن عباس، قال جعل رسول الله صلى الله عليه وسلم أصابع اليدين والرجلين سواء ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) treated the fingers and toes as equal.",
      "chain": [
        "20183",
        "11278",
        "19950",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "5012",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا سعيد بن محمد، حدثنا أبو تميلة، قال حدثني أبو جعفر النحوي عبد الله بن ثابت، قال حدثني صخر بن عبد الله بن بريدة، عن أبيه، عن جده، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن من البيان سحرا وإن من العلم جهلا وإن من الشعر حكما وإن من القول عيالا ‏\"‏ ‏.‏ فقال صعصعة بن صوحان صدق نبي الله صلى الله عليه وسلم أما قوله ‏\"‏ إن من البيان سحرا ‏\"‏ ‏.‏ فالرجل يكون عليه الحق وهو ألحن بالحجج من صاحب الحق فيسحر القوم ببيانه فيذهب بالحق وأما قوله ‏\"‏ إن من العلم جهلا ‏\"‏ ‏.‏ فيتكلف العالم إلى علمه ما لا يعلم فيجهله ذلك وأما قوله ‏\"‏ إن من الشعر حكما ‏\"‏ ‏.‏ فهي هذه المواعظ والأمثال التي يتعظ بها الناس وأما قوله ‏\"‏ إن من القول عيالا ‏\"‏ ‏.‏ فعرضك كلامك وحديثك على من ليس من شأنه ولا يريده ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     I heard the Messenger of Allah (ﷺ) say: In eloquence there is magic, in knowledge ignorance, in poetry wisdom, and in speech heaviness.  Sa'sa'ah ibn Suhan said: The Prophet of Allah (ﷺ) spoke the truth. His statement \"In eloquence there is magic\" means: (For example), there is a right due from a man who is more eloquent in reasoning than the man who is demanding his right. He (the defendant) charms the people by his speech and takes away his right. His statement \"In knowledge there is ignorance\" means: A scholar brings to his knowledge what he does not know, and thus he becomes ignorant of that. His statement \"In poetry there is wisdom\" means: These are the sermons and examples by which people receive admonition. His statement \"In speech there is heaviness\" means: That you present your speech and your talk to a man who is not capable of understanding it, and who does not want it.",
      "chain": [
        "11222",
        "30195",
        "20183"
      ]
    },
    {
      "hadith_no": "206",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا أبو تميلة، حدثنا أبو حمزة، عن جابر، عن مجاهد، عن ابن عباس، أن النبي صلى الله عليه وسلم قال ‏\"‏ من أذن سبع سنين محتسبا كتبت له براءة من النار ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عبد الله بن مسعود وثوبان ومعاوية وأنس وأبي هريرة وأبي سعيد ‏.‏ قال أبو عيسى حديث ابن عباس حديث غريب ‏.‏ وأبو تميلة اسمه يحيى بن واضح ‏.‏ وأبو حمزة السكري اسمه محمد بن ميمون ‏.‏ وجابر بن يزيد الجعفي ضعفوه تركه يحيى بن سعيد وعبد الرحمن بن مهدي ‏.‏ قال أبو عيسى سمعت الجارود يقول سمعت وكيعا يقول لولا جابر الجعفي لكان أهل الكوفة بغير حديث ولولا حماد لكان أهل الكوفة بغير فقه ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Prophet said: 'Whoever calls the Adhan for seven years, seeking reward for it, salvation from the Fire is written for him.'\"",
      "chain": [
        "38495",
        "20183",
        "20458",
        "34",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "1762",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن حميد الرازي، حدثنا أبو تميلة، والفضل بن موسى، وزيد بن حباب، عن عبد المؤمن بن خالد، عن عبد الله بن بريدة، عن أم سلمة، قالت كان أحب الثياب إلى النبي صلى الله عليه وسلم القميص ‏.‏ قال أبو عيسى هذا حديث حسن غريب إنما نعرفه من حديث عبد المؤمن بن خالد تفرد به وهو مروزي ‏.‏ وروى بعضهم هذا الحديث عن أبي تميلة عن عبد المؤمن بن خالد عن عبد الله بن بريدة عن أمه عن أم سلمة ‏.‏",
      "text_en": " Narrated Umm Salamah:                     \"The most loved garment to the Messenger to the Messenger of Allah (ﷺ) was the Qamis (long shirt).\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. We only know of it as a narration of 'Abdul-Mu'min bin Khalid (a narrator in the chain of this Hadith) who was alone in narrating it, and he is from Al-Marwaz. Some of them report this Hadith from Abu Tumailah, from 'Abdul-Mu'min bin Khalid, from 'Abdullah bin Buraidah, from his mother, from Umm Salamah. He said: I heard Muhammad bin Ism'ail saying: \"The narration of Ibn Buraidah from his mother, from Umm Salamah is more correct, Abu Tumailah mentioned 'his mother' in it.\"",
      "chain": [
        "38495",
        "20183",
        "20452",
        "20650",
        "28375",
        "11432",
        "56"
      ]
    },
    {
      "hadith_no": "1763",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا زياد بن أيوب البغدادي، حدثنا أبو تميلة، عن عبد المؤمن بن خالد، عن عبد الله بن بريدة، عن أمه، عن أم سلمة، قالت كان أحب الثياب إلى النبي صلى الله عليه وسلم القميص ‏.‏  قال وسمعت محمد بن إسمعيل يقول حديث عبد الله بن بريدة عن أمه عن أم سلمة أصح وإنما يذكر فيه أبو تميلة عن أمه",
      "text_en": " Narrated Umm Salamah:                     \"The most loved garment to the Messenger of Allah (ﷺ) was the Qamis (long shirt).\"",
      "chain": [
        "30249",
        "20183",
        "28375",
        "11432",
        "56"
      ]
    },
    {
      "hadith_no": "3424",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا يعقوب بن إبراهيم الدورقي، حدثنا أبو تميلة، عن الزبير بن جنادة، عن ابن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لما انتهينا إلى بيت المقدس قال جبريل بإصبعه فخرق به الحجر وشد به البراق ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated Ibn Buraidah:                     from his father that the Messenger of Allah (ﷺ) said: \"When we reached Bait Al-Maqdis, Jibra'il pointed with his finger causing a crack in the rock, and he tied Al-Buraq to it.\"",
      "chain": [
        "30400",
        "20183",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "1585",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Prayer for the Two 'Eids - كتاب صلاة العيدين",
      "chapter_no": "19",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا أبو تميلة، عن الحسين بن واقد، عن ابن بريدة، عن أبيه، قال بينا رسول الله صلى الله عليه وسلم على المنبر يخطب إذ أقبل الحسن والحسين عليهما السلام عليهما قميصان أحمران يمشيان ويعثران فنزل وحملهما فقال ‏\"‏ صدق الله ‏{‏ إنما أموالكم وأولادكم فتنة ‏}‏ رأيت هذين يمشيان ويعثران في قميصيهما فلم أصبر حتى نزلت فحملتهما ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Buraidah that:                     His father said: \"While the Messenger of Allah (ﷺ) was on the minbar, Al-Hasan and Al-Husain came,wearing red shirts, walking and stumbling. He came down and picked them up, then said: 'Allah has spoken the truth: Your wealth and your children are only a trial.' I saw these two walking and stumbling in their shirts, and I could not be patient until I went down and picked them up.'\"",
      "chain": [
        "20184",
        "20183",
        "20648",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "3225",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا أبو تميلة، عن حسين بن واقد، عن ابن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أحساب أهل الدنيا الذي يذهبون إليه المال ‏\"‏ ‏.‏",
      "text_en": " Narrated Ibn Buraidah:                     It was narrated from Ibn Buraidah that his father said: \"The Messenger of Allah said: 'The nobility of the people of this world, that which they (always) go to, is wealth.'\"",
      "chain": [
        "20184",
        "20183",
        "20648",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "1360",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن حميد، حدثنا أبو تميلة، عن فليح بن سليمان، عن سعيد بن الحارث الزرقي، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  كان إذا خرج إلى العيد رجع في غير الطريق الذي أخذ فيه ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that when the Prophet (ﷺ) wentout to‘Eid (prayers), he would return via another route than thefirstone he took.",
      "chain": [
        "38495",
        "20183",
        "20169",
        "11167",
        "13"
      ]
    },
    {
      "hadith_no": "3706",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا يعقوب بن إبراهيم الدورقي، حدثنا أبو تميلة، عن عبد المؤمن بن خالد، عن ابن بريدة، عن أمه، عن أم سلمة، قالت لم يكن ثوب أحب إلى رسول الله  صلى الله عليه وسلم  من القميص ‏.‏",
      "text_en": " It wasnarrated that Umm Salamah said:                      There was no garment morebeloved tothe Messenger of Allah (ﷺ) than the shirt.”",
      "chain": [
        "30400",
        "20183",
        "28375",
        "11432",
        "56"
      ]
    },
    {
      "hadith_no": "4205",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو غسان، محمد بن عمرو زنيج حدثنا أبو تميلة، حدثنا خالد بن عبيد، حدثنا عبد الله بن بريدة، عن أبيه، قال ذهب بي رسول الله  صلى الله عليه وسلم  إلى موضع بالبادية قريب من مكة فإذا أرض يابسة حولها رمل فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ تخرج الدابة من هذا الموضع ‏\"‏ ‏.‏ فإذا فتر في شبر ‏.‏ قال ابن بريدة فحججت بعد ذلك بسنين فأرانا عصا له فإذا هو بعصاى هذه كذا وكذا ‏.‏",
      "text_en": " ‘Abdullah bin Buraidah narrated that his father said:                      “TheMessengerof Allah (ﷺ) took me to a place in the desert, nearMakkah, wherethere was arid land surrounded by sand. The Messengerof Allah (ﷺ)said: ‘The Beast will emerge from this spot – spanby a span. (i.e,the size of that spot).’”",
      "chain": [
        "20183",
        "14100",
        "11432",
        "3131"
      ]
    }
  ],
  "total_hadiths": 14
}