{
  "id": "20184",
  "name": "Ya'qub bin Ibrahim bin Sa'd يعقوب بن إبراهيم بن سعد بن إبراهيم",
  "full_name": "Ya'qub bin Ibrahim bin Sa'd يعقوب بن إبراهيم بن سعد بن إبراهيم",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "208",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina",
      "Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "B.Zuhrah",
      "al-Madni",
      "Baghdad"
    ]
  },
  "parents": [
    {
      "id": "20150",
      "name": "Ibrahim bin Sa'd bin Ibrahim إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "20385",
      "name": "Sa'd bin Ibrahim bin Sa'd سعد بن إبراهيم بن سعد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "20150",
      "name": "Ibrahim bin Sa'd bin Ibrahim إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20176",
      "name": "Muhammad bin 'Abdullah bin Muslim محمد بن عبد الله بن مسلم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20506",
      "name": "Abu Uvais al-Madni أبو أويس المدني الأصبحي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20511",
      "name": "'Abdul 'Aziz bin al-Mtlb عبد العزيز بن المطلب بن عبد الله",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20662",
      "name": "'Abdul Malik bin al-Rabi' عبد الملك بن الربيع بن سبرة بن معبد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20163",
      "name": "'Asim bin Muhammad bin Zayd عاصم بن محمد بن زيد العمري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "25185",
      "name": "'Ubaid'h bin Abi Ra'ith عبيدة بن أبي رائطة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30258",
      "name": "'Ubaidullah bin Sa'd bin Ibrahim b. Sa'd عبيد الله بن سعد بن إبراهيم بن سعد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30351",
      "name": "'Abdullah bin Muhammad al-Musandi عبد الله بن محمد المسندي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30263",
      "name": "'Amr bin Muhammad bin Bukayr عمرو بن محمد بن بكير الناقد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30313",
      "name": "Ishaq bin Mansur al-Kausaj إسحاق بن منصور بن بهرام - الكوسج",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30115",
      "name": "al-Hasan bin 'Ali al-Halwani الحسن بن علي الخلال الحلواني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30295",
      "name": "Ahmed bin Sa'id bin Ibrahim أحمد بن سعيد بن إبراهيم الرباطي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30195",
      "name": "Sa'id bin Muhammad al-Jarmi سعيد بن محمد الجرمي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30514",
      "name": "Muhammad bin Hatim Al-Samayn محمد بن حاتم البغدادي - السمين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38551",
      "name": "Muhammad bin 'Aziz bin 'Abdullah محمد بن عزيز بن عبد الله",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30272",
      "name": "Muhammad bin 'Abdul Rahim bin Abi Zuhayr محمد بن عبد الرحيم بن أبي زهير البزاز",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30553",
      "name": "'Abd bin Hameed bin Nasr عبد بن حميد بن نصر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30585",
      "name": "'Abbas bin Muhammad bin Hatm عباس بن محمد بن حاتم",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "15",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا يعقوب بن إبراهيم، قال حدثنا ابن علية، عن عبد العزيز بن صهيب، عن أنس، عن النبي صلى الله عليه وسلم ح وحدثنا آدم، قال حدثنا شعبة، عن قتادة، عن أنس، قال قال النبي صلى الله عليه وسلم ‏\"‏ لا يؤمن أحدكم حتى أكون أحب إليه من والده وولده والناس أجمعين ‏\"‏‏.‏",
      "text_en": "      Narrated Anas:                          The Prophet said \"None of you will have faith till he loves me more      than his father, his children and all mankind.\"",
      "chain": [
        "20184",
        "20208",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "74",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن غرير الزهري، قال حدثنا يعقوب بن إبراهيم، قال حدثني أبي، عن صالح، عن ابن شهاب، حدث أن عبيد الله بن عبد الله أخبره عن ابن عباس، أنه تمارى هو والحر بن قيس بن حصن الفزاري في صاحب موسى قال ابن عباس هو خضر‏.‏ فمر بهما أبى بن كعب، فدعاه ابن عباس فقال إني تماريت أنا وصاحبي، هذا في صاحب موسى الذي سأل موسى السبيل إلى لقيه، هل سمعت النبي صلى الله عليه وسلم يذكر شأنه قال نعم سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ بينما موسى في ملإ من بني إسرائيل، جاءه رجل فقال هل تعلم أحدا أعلم منك قال موسى لا‏.‏ فأوحى الله إلى موسى بلى، عبدنا خضر، فسأل موسى السبيل إليه، فجعل الله له الحوت آية، وقيل له إذا فقدت الحوت فارجع، فإنك ستلقاه، وكان يتبع أثر الحوت في البحر، فقال لموسى فتاه أرأيت إذ أوينا إلى الصخرة فإني نسيت الحوت، وما أنسانيه إلا الشيطان أن أذكره‏.‏ قال ذلك ما كنا نبغي، فارتدا على آثارهما قصصا، فوجدا خضرا‏.‏ فكان من شأنهما الذي قص الله  عز وجل  في كتابه ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     That he differed with Hur bin Qais bin Hisn Al-Fazari regarding the companion of (the Prophet) Moses. Ibn `Abbas said that he was Al Khadir. Meanwhile, Ubai bin Ka`b passed by them and Ibn `Abbas called him, saying \"My friend (Hur) and I have differed regarding Moses' companion, whom Moses asked the way to meet. Have you heard the Prophet mentioning something about him? He said, \"Yes. I heard Allah's Apostle saying, \"While Moses was sitting in the company of some Israelites, a man came and asked him. \"Do you know anyone who is more learned than you? Moses replied: \"No.\" So Allah sent the Divine Inspiration to Moses: 'Yes, Our slave Khadir (is more learned than you.)' Moses asked (Allah) how to meet him (Khadir). So Allah made the fish as a sign for him and he was told that when the fish was lost, he should return (to the place where he had lost it) and there he would meet him (Al-Khadir). So Moses went on looking for the sign of the fish in the sea. The servant-boy of Moses said to him: Do you remember when we betook ourselves to the rock, I indeed forgot the fish, none but Satan made me forget to remember it. On that Moses said: 'That is what we have been seeking? (18.64) So they went back retracing their footsteps, and found Khadir. (And) what happened further to them is narrated in the Holy Qur'an by Allah. (18.54 up to 18.82)",
      "chain": [
        "30109",
        "20184",
        "20150",
        "11176",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "149",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا يعقوب بن إبراهيم، قال حدثنا يزيد بن هارون، قال أخبرنا يحيى، عن محمد بن يحيى بن حبان، أن عمه، واسع بن حبان، أخبره أن عبد الله بن عمر أخبره قال لقد ظهرت ذات يوم على ظهر بيتنا، فرأيت رسول الله صلى الله عليه وسلم قاعدا على لبنتين مستقبل بيت المقدس‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Once I went up the roof of our house and saw Allah's Apostle answering the call of nature while sitting over two bricks facing Baitul-Maqdis (Jerusalem). (See Hadith No. 147).",
      "chain": [
        "20184",
        "20472",
        "20031",
        "11222",
        "1321",
        "18"
      ]
    },
    {
      "hadith_no": "189",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا يعقوب بن إبراهيم بن سعد، قال حدثنا أبي، عن صالح، عن ابن شهاب، قال أخبرني محمود بن الربيع، قال وهو الذي مج رسول الله صلى الله عليه وسلم في وجهه وهو غلام من بئرهم‏.‏ وقال عروة عن المسور وغيره يصدق كل واحد منهما صاحبه وإذا توضأ النبي صلى الله عليه وسلم كادوا يقتتلون على وضوئه‏.‏",
      "text_en": " Narrated Ibn Shihab:                     Mahmud bin Ar-Rabi` who was the person on whose face the Prophet had ejected a mouthful of water from his family's well while he was a boy, and `Urwa (on the authority of Al-Miswar and others) who testified each other, said, \"Whenever the Prophet , performed ablution, his companions were nearly fighting for the remains of the water.\"",
      "chain": [
        "30026",
        "20184",
        "20150",
        "11176",
        "11013",
        "5278"
      ]
    },
    {
      "hadith_no": "217",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا يعقوب بن إبراهيم، قال حدثنا إسماعيل بن إبراهيم، قال حدثني روح بن القاسم، قال حدثني عطاء بن أبي ميمونة، عن أنس بن مالك، قال كان النبي صلى الله عليه وسلم إذا تبرز لحاجته أتيته بماء فيغسل به‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Whenever the Prophet went to answer the call of nature, I used to bring water with which he used to clean his private parts.",
      "chain": [
        "20184",
        "20208",
        "11586",
        "11601",
        "19"
      ]
    },
    {
      "hadith_no": "369",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إسحاق، قال حدثنا يعقوب بن إبراهيم، قال حدثنا ابن أخي ابن شهاب، عن عمه، قال أخبرني حميد بن عبد الرحمن بن عوف، أن أبا هريرة، قال بعثني أبو بكر في تلك الحجة في مؤذنين يوم النحر نؤذن بمنى أن لا يحج بعد العام مشرك، ولا يطوف بالبيت عريان‏.‏ قال حميد بن عبد الرحمن ثم أردف رسول الله صلى الله عليه وسلم عليا، فأمره أن يؤذن ببراءة قال أبو هريرة فأذن معنا علي في أهل منى يوم النحر لا يحج بعد العام مشرك، ولا يطوف بالبيت عريان‏.‏",
      "text_en": " Narrated Abu Huraira:                     On the Day of Nahr (10th of Dhul-Hijja, in the year prior to the last Hajj of the Prophet when Abu Bakr was the leader of the pilgrims in that Hajj) Abu Bakr sent me along with other announcers to Mina to make a public announcement: \"No pagan is allowed to perform Hajj after this year and no naked person is allowed to perform the Tawaf around the Ka`ba. Then Allah's Apostle sent 'All to read out the Surat Bara'a (at-Tauba) to the people; so he made the announcement along with us on the day of Nahr in Mina: \"No pagan is allowed to perform Hajj after this year and no naked person is allowed to perform the Tawaf around the Ka`ba.\"",
      "chain": [
        "30312",
        "20184",
        "20176",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "371",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا يعقوب بن إبراهيم، قال حدثنا إسماعيل ابن علية، قال حدثنا عبد العزيز بن صهيب، عن أنس، أن رسول الله صلى الله عليه وسلم غزا خيبر، فصلينا عندها صلاة الغداة بغلس، فركب نبي الله صلى الله عليه وسلم وركب أبو طلحة، وأنا رديف أبي طلحة، فأجرى نبي الله صلى الله عليه وسلم في زقاق خيبر، وإن ركبتي لتمس فخذ نبي الله صلى الله عليه وسلم، ثم حسر الإزار عن فخذه حتى إني أنظر إلى بياض فخذ نبي الله صلى الله عليه وسلم، فلما دخل القرية قال ‏\"‏ الله أكبر، خربت خيبر، إنا إذا نزلنا بساحة قوم فساء صباح المنذرين ‏\"‏‏.‏ قالها ثلاثا‏.‏ قال وخرج القوم إلى أعمالهم فقالوا محمد  قال عبد العزيز وقال بعض أصحابنا  والخميس‏.‏ يعني الجيش، قال فأصبناها عنوة، فجمع السبى، فجاء دحية فقال يا نبي الله، أعطني جارية من السبى‏.‏ قال ‏\"‏ اذهب فخذ جارية ‏\"‏‏.‏ فأخذ صفية بنت حيى، فجاء رجل إلى النبي صلى الله عليه وسلم فقال يا نبي الله، أعطيت دحية صفية بنت حيى سيدة قريظة والنضير، لا تصلح إلا لك‏.‏ قال ‏\"‏ ادعوه بها ‏\"‏‏.‏ فجاء بها، فلما نظر إليها النبي صلى الله عليه وسلم قال ‏\"‏ خذ جارية من السبى غيرها ‏\"‏‏.‏ قال فأعتقها النبي صلى الله عليه وسلم وتزوجها‏.‏ فقال له ثابت يا أبا حمزة، ما أصدقها قال نفسها، أعتقها وتزوجها، حتى إذا كان بالطريق جهزتها له أم سليم فأهدتها له من الليل، فأصبح النبي صلى الله عليه وسلم عروسا فقال ‏\"‏ من كان عنده شىء فليجئ به ‏\"‏‏.‏ وبسط نطعا، فجعل الرجل يجيء بالتمر، وجعل الرجل يجيء بالسمن  قال وأحسبه قد ذكر السويق  قال فحاسوا حيسا، فكانت وليمة رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Abdul `Aziz:                     Anas said, 'When Allah's Apostle invaded Khaibar, we offered the Fajr prayer there yearly in the morning) when it was still dark. The Prophet rode and Abu Talha rode too and I was riding behind Abu Talha. The Prophet passed through the lane of Khaibar quickly and my knee was touching the thigh of the Prophet . He uncovered his thigh and I saw the whiteness of the thigh of the Prophet. When he entered the town, he said, 'Allahu Akbar! Khaibar is ruined. Whenever we approach near a (hostile) nation (to fight) then evil will be the morning of those who have been warned.' He repeated this thrice. The people came out for their jobs and some of them said, 'Muhammad (has come).' (Some of our companions added, \"With his army.\") We conquered Khaibar, took the captives, and the booty was collected. Dihya came and said, 'O Allah's Prophet! Give me a slave girl from the captives.' The Prophet said, 'Go and take any slave girl.' He took Safiya bint Huyai. A man came to the Prophet and said, 'O Allah's Apostles! You gave Safiya bint Huyai to Dihya and she is the chief mistress of the tribes of Quraidha and An-Nadir and she befits none but you.' So the Prophet said, 'Bring him along with her.' So Dihya came with her and when the Prophet saw her, he said to Dihya, 'Take any slave girl other than her from the captives.' Anas added: The Prophet then manumitted her and married her.\" Thabit asked Anas, \"O Abu Hamza! What did the Prophet pay her (as Mahr)?\" He said, \"Her self was her Mahr for he manumitted her and then married her.\" Anas added, \"While on the way, Um Sulaim dressed her for marriage (ceremony) and at night she sent her as a bride to the Prophet . So the Prophet was a bridegroom and he said, 'Whoever has anything (food) should bring it.' He spread out a leather sheet (for the food) and some brought dates and others cooking butter. (I think he (Anas) mentioned As-Sawaq). So they prepared a dish of Hais (a kind of meal). And that was Walima (the marriage banquet) of Allah's Apostle .\"",
      "chain": [
        "20184",
        "20208",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "446",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا يعقوب بن إبراهيم بن سعد، قال حدثني أبي، عن صالح بن كيسان، قال حدثنا نافع، أن عبد الله، أخبره أن المسجد كان على عهد رسول الله صلى الله عليه وسلم مبنيا باللبن، وسقفه الجريد، وعمده خشب النخل، فلم يزد فيه أبو بكر شيئا، وزاد فيه عمر وبناه على بنيانه في عهد رسول الله صلى الله عليه وسلم باللبن والجريد، وأعاد عمده خشبا، ثم غيره عثمان، فزاد فيه زيادة كثيرة، وبنى جداره بالحجارة المنقوشة والقصة، وجعل عمده من حجارة منقوشة، وسقفه بالساج‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     In the lifetime of Allah's Apostle the mosque was built of adobes, its roof of the leaves of date-palms and its pillars of the stems of date-palms. Abu Bakr did not alter it. `Umar expanded it on the same pattern as it was in the lifetime of Allah's Apostle by using adobes, leaves of date-palms and changing the pillars into wooden ones. `Uthman changed it by expanding it to a great extent and built its walls with engraved stones and lime and made its pillars of engraved stones and its roof of teak wood.",
      "chain": [
        "30026",
        "20184",
        "20150",
        "11176",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "515",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إسحاق، قال أخبرنا يعقوب بن إبراهيم، قال حدثني ابن أخي ابن شهاب، أنه سأل عمه عن الصلاة، يقطعها شىء فقال لا يقطعها شىء، أخبرني عروة بن الزبير أن عائشة زوج النبي صلى الله عليه وسلم قالت لقد كان رسول الله صلى الله عليه وسلم يقوم فيصلي من الليل، وإني لمعترضة بينه وبين القبلة على فراش أهله‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) Allah's Apostle used to get up at night and pray while I used to lie across between him and the Qibla on his family's bed.",
      "chain": [
        "30312",
        "20184",
        "20176",
        "10511"
      ]
    },
    {
      "hadith_no": "963",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا يعقوب بن إبراهيم، قال حدثنا أبو أسامة، قال حدثنا عبيد الله، عن نافع، عن ابن عمر، قال كان رسول الله صلى الله عليه وسلم وأبو بكر وعمر  رضى الله عنهما  يصلون العيدين قبل الخطبة‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle, Abu Bakr and `Umar! used to offer the two `Id prayers before delivering the Khutba.",
      "chain": [
        "20184",
        "20318",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1134",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا يعقوب بن إبراهيم، قال حدثنا روح، قال حدثنا سعيد، عن قتادة، عن أنس بن مالك  رضى الله عنه  أن نبي الله صلى الله عليه وسلم وزيد بن ثابت  رضى الله عنه  تسحرا، فلما فرغا من سحورهما قام نبي الله صلى الله عليه وسلم إلى الصلاة فصلى‏.‏ قلنا لأنس كم كان بين فراغهما من سحورهما ودخولهما في الصلاة قال كقدر ما يقرأ الرجل خمسين آية‏.‏",
      "text_en": " Narrated Qatada:                     Anas bin Malik said, \"The Prophet (p.b.u.h) and Zaid bin Thabit took their Suhur together. When they finished it, the Prophet stood for the (Fajr) prayer and offered it.\" We asked Anas, \"What was the interval between their finishing the Suhur and the starting of the morning prayer?\" Anas replied, \"It was equal to the time taken by a person in reciting fifty verses of the Qur'an.\"",
      "chain": [
        "20184",
        "20229",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1185",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثني إسحاق، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن ابن شهاب، قال أخبرني محمود بن الربيع الأنصاري، أنه عقل رسول الله صلى الله عليه وسلم، وعقل مجة مجها في وجهه من بئر كانت في دارهم‏.‏ فزعم محمود أنه سمع عتبان بن مالك الأنصاري   رضى الله عنه  وكان ممن شهد بدرا مع رسول الله صلى الله عليه وسلم يقول كنت أصلي لقومي ببني سالم، وكان يحول بيني وبينهم واد إذا جاءت الأمطار فيشق على اجتيازه قبل مسجدهم، فجئت رسول الله صلى الله عليه وسلم فقلت له إني أنكرت بصري، وإن الوادي الذي بيني وبين قومي يسيل إذا جاءت الأمطار فيشق على اجتيازه، فوددت أنك تأتي فتصلي من بيتي مكانا أتخذه مصلى‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ سأفعل ‏\"‏‏.‏ فغدا على رسول الله صلى الله عليه وسلم وأبو بكر  رضى الله عنه  بعد ما اشتد النهار فاستأذن رسول الله صلى الله عليه وسلم فأذنت له فلم يجلس حتى قال ‏\"‏ أين تحب أن أصلي من بيتك ‏\"‏‏.‏ فأشرت له إلى المكان الذي أحب أن أصلي فيه، فقام رسول الله صلى الله عليه وسلم فكبر وصففنا وراءه، فصلى ركعتين، ثم سلم وسلمنا حين سلم، فحبسته على خزير يصنع له فسمع أهل الدار رسول الله صلى الله عليه وسلم في بيتي فثاب رجال منهم حتى كثر الرجال في البيت‏.‏ فقال رجل منهم ما فعل مالك لا أراه‏.‏ فقال رجل منهم ذاك منافق لا يحب الله ورسوله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقل ذاك ألا تراه قال لا إله إلا الله‏.‏ يبتغي بذلك وجه الله ‏\"‏‏.‏ فقال الله ورسوله أعلم‏.‏ أما نحن فوالله لا نرى وده ولا حديثه إلا إلى المنافقين‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فإن الله قد حرم على النار من قال لا إله إلا الله‏.‏ يبتغي بذلك وجه الله ‏\"‏‏.‏ قال محمود فحدثتها قوما فيهم أبو أيوب صاحب رسول الله صلى الله عليه وسلم في غزوته التي توفي فيها ويزيد بن معاوية عليهم بأرض الروم، فأنكرها على أبو أيوب قال والله ما أظن رسول الله صلى الله عليه وسلم قال ما قلت قط‏.‏ فكبر ذلك على فجعلت لله على إن سلمني حتى أقفل من غزوتي أن أسأل عنها عتبان بن مالك  رضى الله عنه  إن وجدته حيا في مسجد قومه، فقفلت فأهللت بحجة أو بعمرة، ثم سرت حتى قدمت المدينة فأتيت بني سالم، فإذا عتبان شيخ أعمى يصلي لقومه فلما سلم من الصلاة سلمت عليه وأخبرته من أنا، ثم سألته عن ذلك الحديث فحدثنيه كما حدثنيه أول مرة‏.‏",
      "text_en": " Narrated Mahmud bin Ar-rabi' Al-Ansari:                     that he remembered Allah's Apostle and he also remembered a mouthful of water which he had thrown on his face, after taking it from a well that was in their house. Mahmud said that he had heard `Itban bin Malik, who was present with Allah's Apostle in the battle of Badr saying, \"I used to lead my people at Bani Salim in the prayer and there was a valley between me and those people. Whenever it rained it used to be difficult for me to cross it to go to their mosque. So I went to Allah's Apostle and said, 'I have weak eyesight and the valley between me and my people flows during the rainy season and it becomes difficult for me to cross it; I wish you would come to my house and pray at a place so that I could take that place as a praying place.' Allah's Apostle said, 'I will do so.' So Allah's Apostle and Abu Bakr came to my house in the (next) morning after the sun had risen high. Allah's Apostle asked my permission to let him in and I admitted him. He did not sit before saying, 'Where do you want us to offer the prayer in your house?' I pointed to the place where I wanted him to pray. So Allah's Apostle stood up for the prayer and started the prayer with Takbir and we aligned in rows behind him; and he offered two rak`at, and finished them with Taslim, and we also performed Taslim with him. I detained him for a meal called \"Khazir\" which I had prepared for him.--(\"Khazir\" is a special type of dish prepared from barley flour and meat soup)-- When the neighbors got the news that Allah's Apostle was in my house, they poured it till there were a great number of men in the house. One of them said, 'What is wrong with Malik, for I do not see him?' One of them replied, 'He is a hypocrite and does not love Allah and His Apostle.' On that Allah's Apostle said, 'Don't say this. Haven't you seen that he said, 'None has the right to be worshipped but Allah for Allah's sake only.' The man replied, 'Allah and His Apostle know better; but by Allah, we never saw him but helping and talking with the hypocrites.' Allah's Apostle replied, 'No doubt, whoever says. None has the right to be worshipped but Allah, and by that he wants the pleasures of Allah, then Allah will save him from Hell.\" Mahmud added, \"I told the above narration to some people, one of whom was Abu Aiyub, the companion of Allah's Apostle in the battle in which he (Abu Aiyub) died and Yazid bin Mu'awiya was their leader in Roman Territory. Abu Aiyub denounced the narration and said, 'I doubt that Allah's Apostle ever said what you have said.' I felt that too much, and I vowed to Allah that if I remained alive in that holy battle, I would (go to Medina and) ask `Itban bin Malik if he was still living in the mosque of his people. So when he returned, I assumed Ihram for Hajj or `Umra and then I proceeded on till I reached Medina. I went to Bani Salim and `Itban bin Malik, who was by then an old blind man, was leading his people in the prayer. When he finished the prayer, I greeted him and introduced myself to him and then asked him about that narration. He told that narration again in the same manner as he had narrated it the first time.\"",
      "chain": [
        "30312",
        "20184",
        "20150",
        "11013",
        "5278"
      ]
    },
    {
      "hadith_no": "1326",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا يحيى بن أبي بكير، حدثنا زائدة، حدثنا أبو إسحاق الشيباني، عن عامر، عن ابن عباس  رضى الله عنهما  قال أتى رسول الله صلى الله عليه وسلم قبرا، فقالوا هذا دفن، أو دفنت البارحة‏.‏ قال ابن عباس  رضى الله عنهما  فصفنا خلفه ثم صلى عليها‏.‏",
      "text_en": " Narrated 'Amir:                     Ibn `Abbas (who was at that time a boy) said, \"Allah's Apostle came to a grave and the people said, 'He or she was buried yesterday.' \" Ibn `Abbas added, \"We aligned behind the Prophet and he led the funeral prayer of the deceased.\"",
      "chain": [
        "20184",
        "20365",
        "20320",
        "11352",
        "11052",
        "17"
      ]
    },
    {
      "hadith_no": "1360",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا إسحاق، أخبرنا يعقوب بن إبراهيم، قال حدثني أبي، عن صالح، عن ابن شهاب، قال أخبرني سعيد بن المسيب، عن أبيه، أنه أخبره أنه، لما حضرت أبا طالب الوفاة جاءه رسول الله صلى الله عليه وسلم فوجد عنده أبا جهل بن هشام، وعبد الله بن أبي أمية بن المغيرة، قال رسول الله صلى الله عليه وسلم لأبي طالب ‏\"‏ يا عم، قل لا إله إلا الله، كلمة أشهد لك بها عند الله ‏\"‏‏.‏ فقال أبو جهل وعبد الله بن أبي أمية يا أبا طالب، أترغب عن ملة عبد المطلب فلم يزل رسول الله صلى الله عليه وسلم يعرضها عليه، ويعودان بتلك المقالة، حتى قال أبو طالب آخر ما كلمهم هو على ملة عبد المطلب، وأبى أن يقول لا إله إلا الله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما والله لأستغفرن لك، ما لم أنه عنك ‏\"‏‏.‏ فأنزل الله تعالى فيه ‏{‏ما كان للنبي‏}‏ الآية‏.‏",
      "text_en": " Narrated Sa`id bin Al-Musaiyab from his father:                     When the time of the death of Abu Talib approached, Allah's Apostle went to him and found Abu Jahl bin Hisham and `Abdullah bin Abi Umaiya bin Al-Mughira by his side. Allah's Apostle said to Abu Talib, \"O uncle! Say: None has the right to be worshipped but Allah, a sentence with which I shall be a witness (i.e. argue) for you before Allah. Abu Jahl and `Abdullah bin Abi Umaiya said, \"O Abu Talib! Are you going to denounce the religion of `Abdul Muttalib?\" Allah's Apostle kept on inviting Abu Talib to say it (i.e. 'None has the right to be worshipped but Allah') while they (Abu Jahl and `Abdullah) kept on repeating their statement till Abu Talib said as his last statement that he was on the religion of `Abdul Muttalib and refused to say, 'None has the right to be worshipped but Allah.' (Then Allah's Apostle said, \"I will keep on asking Allah's forgiveness for you unless I am forbidden (by Allah) to do so.\" So Allah revealed (the verse) concerning him (i.e. It is not fitting for the Prophet and those who believe that they should invoke (Allah) for forgiveness for pagans even though they be of kin, after it has become clear to them that they are companions of the fire (9.113).",
      "chain": [
        "30021",
        "20184",
        "20150",
        "11176",
        "11013",
        "11002",
        "2070"
      ]
    },
    {
      "hadith_no": "1370",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا يعقوب بن إبراهيم، حدثني أبي، عن صالح، حدثني نافع، أن ابن عمر  رضى الله عنهما  أخبره قال اطلع النبي صلى الله عليه وسلم على أهل القليب فقال ‏\"‏ وجدتم ما وعد ربكم حقا ‏\"‏‏.‏ فقيل له تدعو أمواتا فقال ‏\"‏ ما أنتم بأسمع منهم ولكن لا يجيبون ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet looked at the people of the well (the well in which the bodies of the pagans killed in the Battle of Badr were thrown) and said, \"Have you found true what your Lord promised you?\" Somebody said to him, \"You are addressing dead people.\" He replied, \"You do not hear better than they but they cannot reply.\"",
      "chain": [
        "30026",
        "20184",
        "20150",
        "11176",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1381",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا ابن علية، حدثنا عبد العزيز بن صهيب، عن أنس بن مالك  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من الناس مسلم يموت له ثلاثة من الولد لم يبلغوا الحنث إلا أدخله الله الجنة بفضل رحمته إياهم ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle (p.b.u.h) said, \"Any Muslim whose three children died before the age of puberty will be granted Paradise by Allah because of His mercy to them.\"",
      "chain": [
        "20184",
        "20208",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "1501",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا إسماعيل ابن علية، حدثنا خالد الحذاء، عن ابن أشوع، عن الشعبي، حدثني كاتب المغيرة بن شعبة، قال كتب معاوية إلى المغيرة بن شعبة أن اكتب، إلى بشىء سمعته من النبي، صلى الله عليه وسلم‏.‏ فكتب إليه سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إن الله كره لكم ثلاثا قيل وقال، وإضاعة المال، وكثرة السؤال ‏\"‏‏.‏",
      "text_en": " Narrated Ash-Shu`bi:                     The clerk of Al-Mughira bin Shu`ba narrated, \"Muawiya wrote to Al-Mughira bin Shu`ba: Write to me something which you have heard from the Prophet (p.b.u.h) .\" So Al-Mughira wrote: I heard the Prophet saying, \"Allah has hated for you three things: -1. Vain talks, (useless talk) that you talk too much or about others. -2. Wasting of wealth (by extravagance) -3. And asking too many questions (in disputed religious matters) or asking others for something (except in great need). (See Hadith No. 591, Vol. Ill)",
      "chain": [
        "20184",
        "20208",
        "11282",
        "11052"
      ]
    },
    {
      "hadith_no": "1502",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن غرير الزهري، حدثنا يعقوب بن إبراهيم، عن أبيه، عن صالح بن كيسان، عن ابن شهاب، قال أخبرني عامر بن سعد، عن أبيه، قال أعطى رسول الله صلى الله عليه وسلم رهطا وأنا جالس فيهم قال فترك رسول الله صلى الله عليه وسلم منهم رجلا لم يعطه، وهو أعجبهم إلى، فقمت إلى رسول الله صلى الله عليه وسلم فساررته فقلت ما لك عن فلان والله إني لأراه مؤمنا‏.‏ قال ‏\"‏ أو مسلما ‏\"‏ قال فسكت قليلا ثم غلبني ما أعلم فيه فقلت يا رسول الله‏.‏ ما لك عن فلان والله إني لأراه مؤمنا‏.‏ قال ‏\"‏ أو مسلما ‏\"‏‏.‏ قال فسكت قليلا ثم غلبني ما أعلم فيه فقلت يا رسول الله ما لك عن فلان والله إني لأراه مؤمنا‏.‏ قال ‏\"‏ أو مسلما  يعني فقال  إني لأعطي الرجل وغيره أحب إلى منه، خشية أن يكب في النار على وجهه ‏\"‏‏.‏ وعن أبيه عن صالح عن إسماعيل بن محمد أنه قال سمعت أبي يحدث هذا فقال في حديثه فضرب رسول الله صلى الله عليه وسلم بيده فجمع بين عنقي وكتفي ثم قال ‏\"‏ أقبل أى سعد إني لأعطي الرجل ‏\"‏‏.‏ قال أبو عبد الله ‏{‏فكبكبوا‏}‏ قلبوا ‏{‏مكبا‏}‏ أكب الرجل إذا كان فعله غير واقع على أحد، فإذا وقع الفعل قلت كبه الله لوجهه، وكببته أنا‏.‏",
      "text_en": " Narrated Sa`d (bin Abi Waqqas):                     Allah's Apostle distributed something (from the resources of Zakat) amongst a group of people while I was sitting amongst them, but he left a man whom I considered the best of the lot. So, I went up to Allah's Apostle and asked him secretly, \"Why have you left that person? By Allah! I consider him a believer.\" The Prophet said, \"Or merely a Muslim (Who surrender to Allah).\" I remained quiet for a while but could not help repeating my question because of what I knew about him. I said, \"O Allah's Apostle! Why have you left that person? By Allah! I consider him a believer. \" The Prophet said, \"Or merely a Muslim.\" I remained quiet for a while but could not help repeating my question because of what I knew about him. I said, \"O Allah's Apostle! Why have you left that person? By Allah! I consider him a believer.\" The Prophet said, \"Or merely a Muslim.\" Then Allah's Apostle (p.b.u.h) said, \"I give to a person while another is dearer to me, for fear that he may be thrown in the Hell-fire on his face (by reneging from Islam).\"",
      "chain": [
        "30109",
        "20184",
        "20150",
        "11176",
        "11013",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "1598",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثني يعقوب بن إبراهيم، حدثنا ابن علية، أخبرنا أيوب، عن نافع، قال كان ابن عمر  رضى الله عنهما  إذا دخل أدنى الحرم أمسك عن التلبية، ثم يبيت بذي طوى، ثم يصلي به الصبح ويغتسل، ويحدث أن نبي الله صلى الله عليه وسلم كان يفعل ذلك‏.‏",
      "text_en": " Narrated Nafi`:                     On reaching the sanctuary of Mecca, Ibn `Umar used to stop, reciting Talbiya and then he would pass the night at Dhi-Tuwa and then offer the Fajr prayer and take a bath. He used to say that the Prophet used to do the same.",
      "chain": [
        "20184",
        "20208",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1664",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا ابن علية، عن أيوب، عن نافع، أن ابن عمر  رضى الله عنهما  دخل ابنه عبد الله بن عبد الله، وظهره في الدار، فقال إني لا آمن أن يكون العام بين الناس قتال، فيصدوك عن البيت، فلو أقمت‏.‏ فقال قد خرج رسول الله صلى الله عليه وسلم فحال كفار قريش بينه وبين البيت، فإن حيل بيني وبينه أفعل كما فعل رسول الله صلى الله عليه وسلم ‏{‏لقد كان لكم في رسول الله أسوة حسنة‏}‏ ثم قال أشهدكم أني قد أوجبت مع عمرتي حجا‏.‏ قال ثم قدم فطاف لهما طوافا واحدا‏.‏",
      "text_en": " Narrated Nafi`:                     `Abdullah bin `Abdullah bin `Umar and his riding animal entered the house of Ibn `Umar. He (the son of Ibn `Umar) said, \"I fear that this year a battle might take place between the people and you might be prevented from going to the Ka`ba. I suggest that you should stay here.\" Ibn `Umar said, \"Once Allah's Apostle set out for the pilgrimage, and the pagans of Quraish intervened between him and the Ka`ba. So, if the people intervened between me and the Ka`ba, I would do the same as Allah's Apostle had done . . . \"Verily, in Allah's Apostle you have a good example.\" Then he added, \"I make you a witness that I have intended to perform Hajj along with `Umra.\" After arriving at Mecca, Ibn `Umar performed one Tawaf only (between Safa and Marwa).",
      "chain": [
        "20184",
        "20208",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1765",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إسحاق، قال أخبرنا يعقوب بن إبراهيم، حدثنا أبي، عن صالح، عن ابن شهاب، حدثني عيسى بن طلحة بن عبيد الله، أنه سمع عبد الله بن عمرو بن العاص  رضى الله عنهما  قال وقف رسول الله صلى الله عليه وسلم على ناقته‏.‏ فذكر الحديث‏.‏ تابعه معمر عن الزهري‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr bin Al-`As:                     Allah's Apostle stopped while on his she-camel (the sub-narrator then narrated the Hadith as above, i.e. 793).",
      "chain": [
        "30021",
        "20184",
        "20150",
        "11176",
        "11013",
        "10573",
        "29"
      ]
    },
    {
      "hadith_no": "1882",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا هشيم، أخبرنا أبو بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  أن رجلا، كان مع النبي صلى الله عليه وسلم فوقصته ناقته، وهو محرم، فمات، فقال رسول الله صلى الله عليه وسلم ‏\"‏ اغسلوه بماء وسدر، وكفنوه في ثوبيه، ولا تمسوه بطيب، ولا تخمروا رأسه، فإنه يبعث يوم القيامة ملبيا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A man was in the company of the Prophet and his she-camel crushed his neck while he was in a state of Ihram and he died Allah's Apostle said, \"Wash him with water and Sidr and shroud him in his two garments; neither perfume him nor cover his head, for he will be resurrected on the Day of Resurrection, reciting Talbiya.\"",
      "chain": [
        "20184",
        "20468",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1888",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا إسحاق، أخبرنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، عن عمه، أخبرني عبيد الله بن عبد الله بن عتبة بن مسعود، أن عبد الله بن عباس  رضى الله عنهما  قال أقبلت وقد ناهزت الحلم، أسير على أتان لي، ورسول الله صلى الله عليه وسلم قائم يصلي بمنى، حتى سرت بين يدى بعض الصف الأول، ثم نزلت عنها فرتعت، فصففت مع الناس وراء رسول الله صلى الله عليه وسلم‏.‏ وقال يونس عن ابن شهاب بمنى في حجة الوداع‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     I came riding on my she-ass and had (just) then attained the age of puberty. Allah's Apostle was praying at Mina. I passed in front of a part of the first row and then dismounted from it, and the animal started grazing. I aligned with the people behind Allah's Apostle (The sub-narrator added that happened in Mina during the Prophet's Hajjat-al-Wada`.)",
      "chain": [
        "30021",
        "20184",
        "20176",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "2215",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا أبو عاصم، أخبرنا ابن جريج، قال أخبرني موسى بن عقبة، عن نافع، عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ خرج ثلاثة يمشون فأصابهم المطر، فدخلوا في غار في جبل، فانحطت عليهم صخرة‏.‏ قال فقال بعضهم لبعض ادعوا الله بأفضل عمل عملتموه‏.‏ فقال أحدهم اللهم، إني كان لي أبوان شيخان كبيران، فكنت أخرج فأرعى، ثم أجيء فأحلب، فأجيء بالحلاب فآتي به أبوى فيشربان، ثم أسقي الصبية وأهلي وامرأتي، فاحتبست ليلة‏.‏ فجئت فإذا هما نائمان  قال  فكرهت أن أوقظهما، والصبية يتضاغون عند رجلى، فلم يزل ذلك دأبي ودأبهما، حتى طلع الفجر اللهم إن كنت تعلم أني فعلت ذلك ابتغاء وجهك فافرج عنا فرجة نرى منها السماء‏.‏ قال ففرج عنهم‏.‏ وقال الآخر اللهم إن كنت تعلم أني كنت أحب امرأة من بنات عمي كأشد ما يحب الرجل النساء، فقالت لا تنال ذلك منها حتى تعطيها مائة دينار‏.‏ فسعيت فيها حتى جمعتها، فلما قعدت بين رجليها قالت اتق الله، ولا تفض الخاتم إلا بحقه‏.‏ فقمت وتركتها، فإن كنت تعلم أني فعلت ذلك ابتغاء وجهك فافرج عنا فرجة، قال ففرج عنهم الثلثين‏.‏ وقال الآخر اللهم إن كنت تعلم أني استأجرت أجيرا بفرق من ذرة فأعطيته، وأبى ذاك أن يأخذ، فعمدت إلى ذلك الفرق، فزرعته حتى اشتريت منه بقرا وراعيها، ثم جاء فقال يا عبد الله أعطني حقي‏.‏ فقلت انطلق إلى تلك البقر وراعيها، فإنها لك‏.‏ فقال أتستهزئ بي‏.‏ قال فقلت ما أستهزئ بك ولكنها لك‏.‏ اللهم إن كنت تعلم أني فعلت ذلك ابتغاء وجهك فافرج عنا‏.‏ فكشف عنهم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"While three persons were walking, rain began to fall and they had to enter a cave in a mountain. A big rock rolled over and blocked the mouth of the cave. They said to each other, 'Invoke Allah with the best deed you have performed (so Allah might remove the rock)'. One of them said, 'O Allah! My parents were old and I used to go out for grazing (my animals). On my return I would milk (the animals) and take the milk in a vessel to my parents to drink. After they had drunk from it, I would give it to my children, family and wife. One day I was delayed and on my return I found my parents sleeping, and I disliked to wake them up. The children were crying at my feet (because of hunger). That state of affairs continued till it was dawn. O Allah! If You regard that I did it for Your sake, then please remove this rock so that we may see the sky.' So, the rock was moved a bit. The second said, 'O Allah! You know that I was in love with a cousin of mine, like the deepest love a man may have for a woman, and she told me that I would not get my desire fulfilled unless I paid her one-hundred Dinars (gold pieces). So, I struggled for it till I gathered the desired amount, and when I sat in between her legs, she told me to be afraid of Allah, and asked me not to deflower her except rightfully (by marriage). So, I got up and left her. O Allah! If You regard that I did if for Your sake, kindly remove this rock.' So, two-thirds of the rock was removed. Then the third man said, 'O Allah! No doubt You know that once I employed a worker for one Faraq (three Sa's) of millet, and when I wanted to pay him, he refused to take it, so I sowed it and from its yield I bought cows and a shepherd. After a time that man came and demanded his money. I said to him: Go to those cows and the shepherd and take them for they are for you. He asked me whether I was joking with him. I told him that I was not joking with him, and all that belonged to him. O Allah! If You regard that I did it sincerely for Your sake, then please remove the rock.' So, the rock was removed completely from the mouth of the cave.\"",
      "chain": [
        "20184",
        "20241",
        "11070",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2221",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا زهير بن حرب، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن صالح، قال حدثني ابن شهاب، أن عبيد الله بن عبد الله، أخبره أن عبد الله بن عباس  رضى الله عنهما  أخبره أن رسول الله صلى الله عليه وسلم مر بشاة ميتة فقال ‏\"‏ هلا استمتعتم بإهابها ‏\"‏‏.‏ قالوا إنها ميتة‏.‏ قال ‏\"‏ إنما حرم أكلها ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     Once Allah's Apostle passed by a dead sheep and said to the people, \"Wouldn't you benefit by its skin?\" The people replied that it was dead. The Prophet said, \"But its eating only is illegal.\"",
      "chain": [
        "30022",
        "20184",
        "20150",
        "11176",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "2233",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثني زهير بن حرب، حدثنا يعقوب، حدثنا أبي، عن صالح، قال حدث ابن شهاب، أن عبيد الله، أخبره أن زيد بن خالد وأبا هريرة رضى الله عنهما أخبراه أنهما، سمعا رسول الله صلى الله عليه وسلم يسأل عن الأمة تزني ولم تحصن قال ‏\"‏ اجلدوها، ثم إن زنت فاجلدوها، ثم بيعوها بعد الثالثة أو الرابعة ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Khalid and Abu Huraira:                     that Allah's Apostle was asked about an unmarried slave-girl who committed illegal sexual intercourse. They heard him saying, \"Flog her, and if she commits illegal sexual intercourse after that, flog her again, and on the third (or the fourth) offense, sell her.\"",
      "chain": [
        "30022",
        "20184",
        "20150",
        "11176",
        "11013",
        "11201",
        "3625"
      ]
    },
    {
      "hadith_no": "2265",
      "source": " Sahih Bukhari ",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا إسماعيل ابن علية، أخبرنا ابن جريج، قال أخبرني عطاء، عن صفوان بن يعلى، عن يعلى بن أمية  رضى الله عنه  قال غزوت مع النبي صلى الله عليه وسلم جيش العسرة فكان من أوثق أعمالي في نفسي، فكان لي أجير، فقاتل إنسانا، فعض أحدهما إصبع صاحبه، فانتزع إصبعه، فأندر ثنيته فسقطت، فانطلق إلى النبي صلى الله عليه وسلم فأهدر ثنيته وقال ‏\"‏ أفيدع إصبعه في فيك تقضمها  قال أحسبه قال  كما يقضم الفحل ‏\"‏‏.‏ قال ابن جريج وحدثني عبد الله بن أبي مليكة، عن جده، بمثل هذه الصفة أن رجلا، عض يد رجل، فأندر ثنيته، فأهدرها أبو بكر رضى الله عنه‏.‏",
      "text_en": " Narrated Ya`la bin Umaiya:                     I fought in Jaish-al-Usra (Ghazwa of Tabuk) along with the Prophet and in my opinion that was the best of my deeds. Then I had an employee, who quarrel led with someone and one of the them bit and cut the other's finger and caused his own tooth to fall out. He then went to the Prophet (with a complaint) but the Prophet canceled the suit and said to the complainant, \"Did you expect him to let his finger in your mouth so that you might snap and cut it (as does a stallion camel)?\" Narrated Ibn Juraij from `Abdullah bin Abu Mulaika from his grandfather a similar story: A man bit the hand of another man and caused his own tooth to fall out, but Abu Bakr judged that he had no right for compensation (for the broken tooth).",
      "chain": [
        "20184",
        "20208",
        "11070",
        "11029",
        "11248"
      ]
    },
    {
      "hadith_no": "2349",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا يعقوب، عن أبي حازم، عن سهل بن سعد  رضى الله عنه  أنه قال إنا كنا نفرح بيوم الجمعة، كانت لنا عجوز تأخذ من أصول سلق لنا كنا نغرسه في أربعائنا فتجعله في قدر لها فتجعل فيه حبات من شعير لا أعلم إلا أنه قال ليس فيه شحم ولا ودك، فإذا صلينا الجمعة زرناها فقربته، إلينا فكنا نفرح بيوم الجمعة من أجل ذلك وما كنا نتغدى ولا نقيل إلا بعد الجمعة‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     We used to be very happy on Friday as an old lady used to cut some roots of the Silq, which we used to plant on the banks of our small water streams, and cook them in a pot of her's, adding to them, some grains of barley. (Ya'qub, the sub-narrator said, \"I think the narrator mentioned that the food did not contain fat or melted fat (taken from meat).\") When we offered the Friday prayer we would go to her and she would serve us with the dish. So, we used to be happy on Fridays because of that. We used not to take our meals or the midday nap except after the Jumua prayer (i.e. Friday prayer).",
      "chain": [
        "30367",
        "20184",
        "11349",
        "399"
      ]
    },
    {
      "hadith_no": "2697",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا يعقوب، حدثنا إبراهيم بن سعد، عن أبيه، عن القاسم بن محمد، عن عائشة  رضى الله عنها  قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ من أحدث في أمرنا هذا ما ليس فيه فهو رد ‏\"‏‏.‏ رواه عبد الله بن جعفر المخرمي وعبد الواحد بن أبي عون عن سعد بن إبراهيم‏.‏",
      "text_en": " Narrated Aisha:                     Allah's Apostle said, \"If somebody innovates something which is not in harmony with the principles of our religion, that thing is rejected.\"",
      "chain": [
        "20184",
        "20150",
        "11063",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "2768",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا يعقوب بن إبراهيم بن كثير، حدثنا ابن علية، حدثنا عبد العزيز، عن أنس  رضى الله عنه  قال قدم رسول الله صلى الله عليه وسلم المدينة ليس له خادم، فأخذ أبو طلحة بيدي، فانطلق بي إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله إن أنسا غلام كيس، فليخدمك‏.‏ قال فخدمته في السفر والحضر، ما قال لي لشىء صنعته لم صنعت هذا هكذا ولا لشىء لم أصنعه لم لم تصنع هذا هكذا",
      "text_en": " Narrated Anas:                     When Allah's Apostle came to Medina; he did not have any servant. Abu Talha (Anas' step-father) took me to Allah's Apostle and said, \"O Allah's Apostle! Anas is a wise boy, so let him serve you.\" So, I served him at home and on journeys. If I did anything, he never asked me why I did it, and if I refrained from doing anything, he never asked me why I refrained from doing it.",
      "chain": [
        "20184",
        "20208",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "2893",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا قتيبة، حدثنا يعقوب، عن عمرو، عن أنس بن مالك  رضى الله عنه  أن النبي صلى الله عليه وسلم قال لأبي طلحة ‏\"‏ التمس غلاما من غلمانكم يخدمني حتى أخرج إلى خيبر ‏\"‏‏.‏ فخرج بي أبو طلحة مردفي، وأنا غلام راهقت الحلم، فكنت أخدم رسول الله صلى الله عليه وسلم إذا نزل، فكنت أسمعه كثيرا يقول ‏\"‏ اللهم إني أعوذ بك من الهم والحزن والعجز والكسل والبخل والجبن وضلع الدين وغلبة الرجال ‏\"‏‏.‏ ثم قدمنا خيبر، فلما فتح الله عليه الحصن ذكر له جمال صفية بنت حيى بن أخطب، وقد قتل زوجها وكانت عروسا، فاصطفاها رسول الله صلى الله عليه وسلم لنفسه، فخرج بها حتى بلغنا سد الصهباء حلت، فبنى بها، ثم صنع حيسا في نطع صغير، ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ آذن من حولك ‏\"‏‏.‏ فكانت تلك وليمة رسول الله صلى الله عليه وسلم على صفية‏.‏ ثم خرجنا إلى المدينة قال فرأيت رسول الله صلى الله عليه وسلم يحوي لها وراءه بعباءة، ثم يجلس عند بعيره فيضع ركبته، فتضع صفية رجلها على ركبته حتى تركب، فسرنا حتى إذا أشرفنا على المدينة نظر إلى أحد فقال ‏\"‏ هذا جبل يحبنا ونحبه ‏\"‏‏.‏ ثم نظر إلى المدينة فقال ‏\"‏ اللهم إني أحرم ما بين لابتيها بمثل ما حرم إبراهيم مكة، اللهم بارك لهم في مدهم وصاعهم ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said to Abu Talha, \"Choose one of your boy servants to serve me in my expedition to Khaibar.\" So, Abu Talha took me letting me ride behind him while I was a boy nearing the age of puberty. I used to serve Allah's Apostle when he stopped to rest. I heard him saying repeatedly, \"O Allah! I seek refuge with You from distress and sorrow, from helplessness and laziness, from miserliness and cowardice, from being heavily in debt and from being overcome by men.\" Then we reached Khaibar; and when Allah enabled him to conquer the Fort (of Khaibar), the beauty of Safiya bint Huyai bin Akhtab was described to him. Her husband had been killed while she was a bride. So Allah's Apostle selected her for himself and took her along with him till we reached a place called Sa`d-AsSahba,' where her menses were over and he took her for his wife. Haris (a kind of dish) was served on a small leather sheet. Then Allah's Apostle told me to call those who were around me. So, that was the marriage banquet of Allah's Apostle and Safiya. Then we left for Medina. I saw Allah's Apostle folding a cloak round the hump of the camel so as to make a wide space for Safiya (to sit on behind him) He sat beside his camel letting his knees for Safiya to put her feet on so as to mount the camel. Then, we proceeded till we approached Medina; he looked at Uhud (mountain) and said, \"This is a mountain which loves us and is loved by us.\" Then he looked at Medina and said, \"O Allah! I make the area between its (i.e. Medina's) two mountains a sanctuary as Abraham made Mecca a sanctuary. O Allah! Bless them (i.e. the people of Medina) in their Mudd and Sa (i.e. measures).",
      "chain": [
        "30367",
        "20184",
        "20377",
        "19"
      ]
    },
    {
      "hadith_no": "2928",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا سعيد بن محمد، حدثنا يعقوب، حدثنا أبي، عن صالح، عن الأعرج، قال قال أبو هريرة  رضى الله عنه  قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقوم الساعة حتى تقاتلوا الترك صغار الأعين، حمر الوجوه، ذلف الأنوف، كأن وجوههم المجان المطرقة، ولا تقوم الساعة حتى تقاتلوا قوما نعالهم الشعر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The Hour will not be established until you fight with the Turks; people with small eyes, red faces, and flat noses. Their faces will look like shields coated with leather. The Hour will not be established till you fight with people whose shoes are made of hair.\"",
      "chain": [
        "30195",
        "20184",
        "20150",
        "11176",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2936",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إسحاق، أخبرنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، عن عمه، قال أخبرني عبيد الله بن عبد الله بن عتبة بن مسعود، أن عبد الله بن عباس  رضى الله عنهما  أخبره أن رسول الله صلى الله عليه وسلم كتب إلى قيصر، وقال ‏\"‏ فإن توليت فإن عليك إثم الأريسيين ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     Allah's Apostle wrote a letter to Caesar saying, \"If you reject Islam, you will be responsible for the sins of the peasants (i.e. your people).",
      "chain": [
        "30021",
        "20184",
        "20176",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "3063",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا ابن علية، عن أيوب، عن حميد بن هلال، عن أنس بن مالك  رضى الله عنه  قال خطب رسول الله صلى الله عليه وسلم فقال ‏\"‏ أخذ الراية زيد فأصيب، ثم أخذها جعفر فأصيب، ثم أخذها عبد الله بن رواحة فأصيب، ثم أخذها خالد بن الوليد عن غير إمرة ففتح عليه، وما يسرني  أو قال ما يسرهم  أنهم عندنا ‏\"‏‏.‏ وقال وإن عينيه لتذرفان‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle delivered a sermon and said, \"Zaid received the flag and was martyred, then Ja`far took it and was martyred, then `Abdullah bin Rawaha took it and was martyred, and then Khalid bin Al-Walid took it without being appointed, and Allah gave him victory.\" The Prophet added, \"I am not pleased (or they will not be pleased) that they should remain (alive) with us,\" while his eyes were shedding tears.",
      "chain": [
        "20184",
        "20208",
        "11015",
        "11281",
        "19"
      ]
    },
    {
      "hadith_no": "3110",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا سعيد بن محمد الجرمي، حدثنا يعقوب بن إبراهيم، حدثنا أبي أن الوليد بن كثير، حدثه عن محمد بن عمرو بن حلحلة الدؤلي، حدثه أن ابن شهاب حدثه أن علي بن حسين حدثه أنهم، حين قدموا المدينة من عند يزيد بن معاوية مقتل حسين بن علي رحمة الله عليه لقيه المسور بن مخرمة فقال له هل لك إلى من حاجة تأمرني بها فقلت له لا‏.‏ فقال له فهل أنت معطي سيف رسول الله صلى الله عليه وسلم فإني أخاف أن يغلبك القوم عليه، وايم الله، لئن أعطيتنيه لا يخلص إليهم أبدا حتى تبلغ نفسي، إن علي بن أبي طالب خطب ابنة أبي جهل على فاطمة  عليها السلام  فسمعت رسول الله صلى الله عليه وسلم يخطب الناس في ذلك على منبره هذا وأنا يومئذ محتلم فقال ‏\"‏ إن فاطمة مني، وأنا أتخوف أن تفتن في دينها ‏\"‏‏.‏ ثم ذكر صهرا له من بني عبد شمس، فأثنى عليه في مصاهرته إياه قال ‏\"‏ حدثني فصدقني، ووعدني فوفى لي، وإني لست أحرم حلالا ولا أحل حراما، ولكن والله لا تجتمع بنت رسول الله صلى الله عليه وسلم وبنت عدو الله أبدا ‏\"‏‏.‏",
      "text_en": " Narrated `Ali bin Al-Husain:                     That when they reached Medina after returning from Yazid bin Mu'awaiya after the martyrdom of Husain bin `Ali (may Allah bestow His Mercy upon him), Al-Miswar bin Makhrama met him and said to him, \"Do you have any need you may order me to satisfy?\" `Ali said, \"No.\" Al-Miswar said, Will you give me the sword of Allah's Apostle for I am afraid that people may take it from you by force? By Allah, if you give it to me, they will never be able to take it till I die.\" When `Ali bin Abu Talib demanded the hand of the daughter of Abi Jahal to be his wife besides Fatima, I heard Allah's Apostle on his pulpit delivering a sermon in this connection before the people, and I had then attained my age of puberty. Allah's Apostle said, \"Fatima is from me, and I am afraid she will be subjected to trials in her religion (because of jealousy).\" The Prophet then mentioned one of his son-in-law who was from the tribe of 'Abu Shams, and he praised him as a good son-in-law, saying, \"Whatever he said was the truth, and he promised me and fulfilled his promise. I do not make a legal thing illegal, nor do I make an illegal thing legal, but by Allah, the daughter of Allah's Apostle and the daughter of the enemy of Allah, (i.e. Abu Jahl) can never get together (as the wives of one man) (See Hadith No. 76, Vo. 5).",
      "chain": [
        "30195",
        "20184",
        "20150",
        "11230",
        "11220",
        "11013",
        "11045"
      ]
    },
    {
      "hadith_no": "3294",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن صالح، عن ابن شهاب، قال أخبرني عبد الحميد بن عبد الرحمن بن زيد، أن محمد بن سعد بن أبي وقاص، أخبره أن أباه سعد بن أبي وقاص قال استأذن عمر على رسول الله صلى الله عليه وسلم، وعنده نساء من قريش يكلمنه ويستكثرنه، عالية أصواتهن، فلما استأذن عمر، قمن يبتدرن الحجاب، فأذن له رسول الله صلى الله عليه وسلم، ورسول الله صلى الله عليه وسلم يضحك، فقال عمر أضحك الله سنك يا رسول الله‏.‏ قال ‏\"‏ عجبت من هؤلاء اللاتي كن عندي، فلما سمعن صوتك ابتدرن الحجاب ‏\"‏‏.‏ قال عمر فأنت يا رسول الله كنت أحق أن يهبن‏.‏ ثم قال أى عدوات أنفسهن، أتهبنني ولا تهبن رسول الله صلى الله عليه وسلم قلن نعم، أنت أفظ وأغلظ من رسول الله صلى الله عليه وسلم‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ والذي نفسي بيده ما لقيك الشيطان قط سالكا فجا إلا سلك فجا غير فجك ‏\"‏‏.‏",
      "text_en": " Narrated Sa`d bin Abi Waqqas:                     Once `Umar asked the leave to see Allah's Apostle in whose company there were some Quraishi women who were talking to him and asking him for more financial support raising their voices. When `Umar asked permission to enter the women got up (quickly) hurrying to screen themselves. When Allah's Apostle admitted `Umar, Allah's Apostle was smiling, `Umar asked, \"O Allah's Apostle! May Allah keep you gay always.\" Allah's Apostle said, \"I am astonished at these women who were with me. As soon as they heard your voice, they hastened to screen themselves.\" `Umar said, \"O Allah's Apostle! You have more right to be feared by them.\" Then he addressed (those women) saying, \"O enemies of your own souls! Do you fear me and not Allah's Apostle ?\" They replied. \"Yes, for you are a fearful and fierce man as compared with Allah's Apostle.\" On that Allah's Apostle said (to `Umar), \"By Him in Whose Hands my life is, whenever Satan sees you taking a path, he follows a path other than yours.\"",
      "chain": [
        "30026",
        "20184",
        "20150",
        "11176",
        "11013",
        "10553"
      ]
    },
    {
      "hadith_no": "3400",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عمرو بن محمد، حدثنا يعقوب بن إبراهيم، قال حدثني أبي، عن صالح، عن ابن شهاب، أن عبيد الله بن عبد الله، أخبره عن ابن عباس، أنه تمارى هو والحر بن قيس الفزاري في صاحب موسى، قال ابن عباس هو خضر، فمر بهما أبى بن كعب، فدعاه ابن عباس، فقال إني تماريت أنا وصاحبي، هذا في صاحب موسى الذي سأل السبيل إلى لقيه، هل سمعت رسول الله صلى الله عليه وسلم يذكر شأنه قال نعم سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ بينما موسى في ملإ من بني إسرائيل جاءه رجل، فقال هل تعلم أحدا أعلم منك قال لا‏.‏ فأوحى الله إلى موسى بلى عبدنا خضر‏.‏ فسأل موسى السبيل إليه، فجعل له الحوت آية، وقيل له إذا فقدت الحوت فارجع، فإنك ستلقاه‏.‏ فكان يتبع الحوت في البحر، فقال لموسى فتاه أرأيت إذ أوينا إلى الصخرة، فإني نسيت الحوت، وما أنسانيه إلا الشيطان أن أذكره‏.‏ فقال موسى ذلك ما كنا نبغ‏.‏ فارتدا على آثارهما قصصا فوجدا خضرا، فكان من شأنهما الذي قص الله في كتابه ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     That he differed with Al-Hur bin Qais Al-Fazari regarding the companion of Moses. Ibn `Abbas said that he was Al-Khadir. Meanwhile Ubai bin Ka`b passed by them and Ibn `Abbas called him saying, \"My friend and I have differed regarding Moses' companion whom Moses asked the way to meet. Have you heard Allah's Apostle mentioning something about him?\" He said, \"Yes, I heard Allah's Apostle saying, 'While Moses was sitting in the company of some Israelites, a man came and asked (him), 'Do you know anyone who is more learned than you?' Moses replied, 'No.' So, Allah sent the Divine Inspiration to Moses: 'Yes, Our slave, Khadir (is more learned than you).' Moses asked how to meet him (i.e. Khadir). So, the fish, was made, as a sign for him, and he was told that when the fish was lost, he should return and there he would meet him. So, Moses went on looking for the sign of the fish in the sea. The servant boy of Moses said to him, 'Do you know that when we were sitting by the side of the rock, I forgot the fish, and t was only Satan who made me forget to tell (you) about it.' Moses said, That was what we were seeking after,' and both of them returned, following their footmarks and found Khadir; and what happened further to them, is mentioned in Allah's Book.\"",
      "chain": [
        "30263",
        "20184",
        "20150",
        "11176",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "3448",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا إسحاق، أخبرنا يعقوب بن إبراهيم، حدثنا أبي، عن صالح، عن ابن شهاب، أن سعيد بن المسيب، سمع أبا هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ والذي نفسي بيده، ليوشكن أن ينزل فيكم ابن مريم حكما عدلا، فيكسر الصليب، ويقتل الخنزير، ويضع الجزية، ويفيض المال حتى لا يقبله أحد، حتى تكون السجدة الواحدة خيرا من الدنيا وما فيها ‏\"‏‏.‏ ثم يقول أبو هريرة واقرءوا إن شئتم ‏{‏وإن من أهل الكتاب إلا ليؤمنن به قبل موته ويوم القيامة يكون عليهم شهيدا‏}‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"By Him in Whose Hands my soul is, surely (Jesus,) the son of Mary will soon descend amongst you and will judge mankind justly (as a Just Ruler); he will break the Cross and kill the pigs and there will be no Jizya (i.e. taxation taken from non Muslims). Money will be in abundance so that nobody will accept it, and a single prostration to Allah (in prayer) will be better than the whole world and whatever is in it.\" Abu Huraira added \"If you wish, you can recite (this verse of the Holy Book): -- 'And there is none Of the people of the Scriptures (Jews and Christians) But must believe in him (i.e Jesus as an Apostle of Allah and a human being) Before his death. And on the Day of Judgment He will be a witness Against them.\" (4.159) (See Fath-ul-Bari, Page 302 Vol 7)",
      "chain": [
        "30312",
        "20184",
        "20150",
        "11176",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "3544",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن سعد، ح قال يعقوب بن إبراهيم حدثنا أبي، عن أبيه، قال حدثني عبد الرحمن بن هرمز الأعرج، عن أبي هريرة  رضى الله عنه  قال رسول الله صلى الله عليه وسلم ‏\"‏ قريش والأنصار وجهينة ومزينة وأسلم وأشجع وغفار موالي ليس لهم مولى، دون الله ورسوله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The tribe of Quraish, the Ansar, the (people of the tribe of) Julhaina, Muzaina, Aslam, Ashja', and Ghifar are my disciples and have no protectors except Allah and His Apostle.\"",
      "chain": [
        "20348",
        "20012",
        "9",
        "20184",
        "20150",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "3553",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني محمد بن غرير الزهري، حدثنا يعقوب بن إبراهيم، عن أبيه، عن صالح، حدثنا نافع، أن عبد الله، أخبره أن رسول الله صلى الله عليه وسلم قال على المنبر ‏\"‏ غفار غفر الله لها، وأسلم سالمها الله، وعصية عصت الله ورسوله ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     While Allah's Apostle was on the pulpit, he said, \"May Allah give the tribe of Ghifar! And may Allah save the tribe of Aslam! The tribe of 'Usaiya have disobeyed Allah and His Apostle.\"",
      "chain": [
        "30109",
        "20184",
        "20150",
        "11176",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3832",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا يعقوب بن إبراهيم بن كثير، حدثنا بهز بن أسد، حدثنا شعبة، قال أخبرني هشام بن زيد، قال سمعت أنس بن مالك  رضى الله عنه  قال جاءت امرأة من الأنصار إلى رسول الله صلى الله عليه وسلم ومعها صبي لها، فكلمها رسول الله صلى الله عليه وسلم فقال ‏\"‏ والذي نفسي بيده، إنكم أحب الناس إلى ‏\"‏‏.‏ مرتين‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Once an Ansari woman, accompanied by a son of hers, came to Allah's Apostle. Allah's Apostle spoke to her and said twice, \"By Him in Whose Hand my life is, you are the most beloved people to me.\"",
      "chain": [
        "20184",
        "20214",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "hadith_no": "3928",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا زهير بن حرب، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن صالح، عن ابن شهاب، قال حدثني أبو سلمة بن عبد الرحمن، وابن المسيب، أن أبا هريرة  رضى الله عنه  أخبرهما أن رسول الله صلى الله عليه وسلم نعى لهم النجاشي صاحب الحبشة في اليوم الذي مات فيه، وقال ‏\"‏ استغفروا لأخيكم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     that Allah's Apostle informed them (i.e. his companions) of the death of Negus, the king of Ethiopia, on the very day on which the latter died, and said, \"Ask Allah's Forgiveness for your brother\" Abu Huraira further said, \"Allah's Apostle made them (i.e. the Muslims) stand in rows at the Musalla (i.e. praying place) and led the funeral prayer for the Negus and said four Takbir.\"",
      "chain": [
        "30022",
        "20184",
        "20150",
        "11176",
        "11013",
        "10567",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "3940",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني إسحاق بن منصور، أخبرنا يعقوب بن إبراهيم، حدثنا ابن أخي ابن شهاب، عن عمه، قال أخبرني أبو إدريس، عائذ الله أن عبادة بن الصامت  من الذين شهدوا بدرا مع رسول الله صلى الله عليه وسلم  ومن أصحابه ليلة العقبة  أخبره أن رسول الله صلى الله عليه وسلم قال وحوله عصابة من أصحابه ‏\"‏ تعالوا بايعوني على أن لا تشركوا بالله شيئا، ولا تسرقوا، ولا تزنوا، ولا تقتلوا أولادكم، ولا تأتون ببهتان تفترونه بين أيديكم وأرجلكم، ولا تعصوني في معروف، فمن وفى منكم فأجره على الله، ومن أصاب من ذلك شيئا فعوقب به في الدنيا فهو له كفارة، ومن أصاب من ذلك شيئا فستره الله فأمره إلى الله، إن شاء عاقبه، وإن شاء عفا عنه ‏\"‏‏.‏ قال فبايعته على ذلك‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                     Who had taken part in the battle of Badr with Allah's Apostle and had been amongst his companions on the night of Al-`Aqaba Pledge: Allah's Apostle, surrounded by a group of his companions said, \"Come along and give me the pledge of allegiance that you will not worship anything besides Allah, will not steal, will not commit illegal sexual intercourse will not kill your children, will not utter; slander, invented by yourself, and will not disobey me if I order you to do something good. Whoever among you will respect and fulfill this pledge, will be rewarded by Allah. And if one of you commits any of these sins and is punished in this world then that will be his expiation for it, and if one of you commits any of these sins and Allah screens his sin, then his matter, will rest with Allah: If He will, He will punish him and if He will,. He will excuse him.\" So I gave the pledge of allegiance to him for these conditions.",
      "chain": [
        "30313",
        "20184",
        "20176"
      ]
    },
    {
      "hadith_no": "4018",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا هشيم، أخبرنا أبو هاشم، عن أبي مجلز، عن قيس، قال سمعت أبا ذر، يقسم قسما إن هذه الآية ‏{‏هذان خصمان اختصموا في ربهم ‏}‏ نزلت في الذين برزوا يوم بدر حمزة وعلي وعبيدة بن الحارث وعتبة وشيبة ابنى ربيعة والوليد بن عتبة‏.‏",
      "text_en": " Narrated Qais:                     I heard Abu Dhar swearing that the following Holy verse:-- \"These two opponents (believers and disbelievers) disputing with each other about their Lord,\" (22.19) was revealed concerning those men who fought on the day of Badr, namely, Hamza, `Ali, Ubaida bin Al-Harith, `Utba and Shaiba----the two sons of Rabi`a-- and Al-Walid bin `Utba.",
      "chain": [
        "20184",
        "20468",
        "11454",
        "11313",
        "11046"
      ]
    },
    {
      "hadith_no": "4037",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني يعقوب، حدثنا إبراهيم بن سعد، عن أبيه، عن جده، قال قال عبد الرحمن بن عوف إني لفي الصف يوم بدر إذ التفت، فإذا عن يميني وعن يساري فتيان حديثا السن، فكأني لم آمن بمكانهما، إذ قال لي أحدهما سرا من صاحبه يا عم أرني أبا جهل‏.‏ فقلت يا ابن أخي، وما تصنع به قال عاهدت الله إن رأيته أن أقتله أو أموت دونه‏.‏ فقال لي الآخر سرا من صاحبه مثله قال فما سرني أني بين رجلين مكانهما، فأشرت لهما إليه، فشدا عليه مثل الصقرين حتى ضرباه، وهما ابنا عفراء‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin `Auf:                     While I was fighting in the front file on the day (of the battle) of Badr, suddenly I looked behind and saw on my right and left two young boys and did not feel safe by standing between them. Then one of them asked me secretly so that his companion may not hear, \"O Uncle! Show me Abu Jahl.\" I said, \"O nephew! What will you do to him?\" He said, \"I have promised Allah that if I see him (i.e. Abu Jahl), I will either kill him or be killed before I kill him.\" Then the other said the same to me secretly so that his companion should not hear. I would not have been pleased to be in between two other men instead of them. Then I pointed him (i.e. Abu Jahl) out to them. Both of them attacked him like two hawks till they knocked him down. Those two boys were the sons of 'Afra' (i.e. an Ansari woman).",
      "chain": [
        "20184",
        "20150",
        "11063"
      ]
    },
    {
      "hadith_no": "4068",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن الزهري، عن عطاء بن يزيد، عن عبيد الله بن عدي، عن المقداد بن الأسود، حدثني إسحاق، حدثنا يعقوب بن إبراهيم بن سعد، حدثنا ابن أخي ابن شهاب، عن عمه، قال أخبرني عطاء بن يزيد الليثي، ثم الجندعي أن عبيد، الله بن عدي بن الخيار أخبره أن المقداد بن عمرو الكندي، وكان حليفا لبني زهرة، وكان ممن شهد بدرا مع رسول الله صلى الله عليه وسلم أخبره أنه قال لرسول الله صلى الله عليه وسلم أرأيت إن لقيت رجلا من الكفار فاقتتلنا، فضرب إحدى يدى بالسيف فقطعها، ثم لاذ مني بشجرة فقال أسلمت لله‏.‏ آأقتله يا رسول الله بعد أن قالها فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقتله ‏\"‏‏.‏ فقال يا رسول الله، إنه قطع إحدى يدى، ثم قال ذلك بعد ما قطعها‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقتله، فإن قتلته فإنه بمنزلتك قبل أن تقتله، وإنك بمنزلته قبل أن يقول كلمته التي قال ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubaidullah bin `Adi bin Al-Khiyar:                     That Al-Miqdad bin `Amr Al-Kindi, who was an ally of Bani Zuhra and one of those who fought the battle of Badr together with Allah's Apostle told him that he said to Allah's Apostle, \"Suppose I met one of the infidels and we fought, and he struck one of my hands with his sword and cut it off and then took refuge in a tree and said, \"I surrender to Allah (i.e. I have become a Muslim),' could I kill him, O Allah's Apostle, after he had said this?\" Allah's Apostle said, \"You should not kill him.\" Al- Miqdad said, \"O Allah's Apostle! But he had cut off one of my two hands, and then he had uttered those words?\" Allah's Apostle replied, \"You should not kill him, for if you kill him, he would be in your position where you had been before killing him, and you would be in his position where he had been before uttering those words.\"",
      "chain": [
        "20241",
        "11070",
        "11013",
        "11206",
        "163",
        "30312",
        "20184",
        "20176",
        "11206",
        "880"
      ]
    },
    {
      "hadith_no": "4069",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني يعقوب بن إبراهيم، حدثنا ابن علية، حدثنا سليمان التيمي، حدثنا أنس  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم يوم بدر ‏\"‏ من ينظر ما صنع أبو جهل ‏\"‏‏.‏ فانطلق ابن مسعود، فوجده قد ضربه ابنا عفراء حتى برد، فقال آنت أبا جهل قال ابن علية قال سليمان هكذا قالها أنس‏.‏ قال أنت أبا جهل قال وهل فوق رجل قتلتموه قال سليمان أو قال قتله قومه‏.‏ قال وقال أبو مجلز قال أبو جهل فلو غير أكار قتلني‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle said on the day of Badr, \"Who will go and see what has happened to Abu Jahl?\" Ibn Mas`ud went and saw him struck by the two sons of 'Afra and was on the point of death . Ibn Mas`ud said, \"Are you Abu Jahl?\" Abu Jahl replied, \"Can there be a man more superior to the one whom you have killed (or as Sulaiman said, or his own folk have killed.)?\" Abu Jahl added, \"Would that I had been killed by other than a mere farmer. \"",
      "chain": [
        "20184",
        "20208",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "4124",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا يعقوب، عن أبي حازم، أنه سمع سهل بن سعد، وهو يسأل عن جرح رسول الله صلى الله عليه وسلم فقال أما والله إني لأعرف من كان يغسل جرح رسول الله صلى الله عليه وسلم ومن كان يسكب الماء وبما دووي  قال كانت فاطمة  عليها السلام  بنت رسول الله صلى الله عليه وسلم تغسله وعلي يسكب الماء بالمجن، فلما رأت فاطمة أن الماء لا يزيد الدم إلا كثرة أخذت قطعة من حصير، فأحرقتها وألصقتها فاستمسك الدم، وكسرت رباعيته يومئذ، وجرح وجهه، وكسرت البيضة على رأسه‏.‏",
      "text_en": " Narrated Abu Hazim:                     That he heard Sahl bin Sa`d being asked about the wounds of Allah's Apostle saying, \"By Allah, I know who washed the wounds of Allah's Apostle and who poured water (for washing them), and with what he was treated.\" Sahl added, \"Fatima, the daughter of Allah's Apostle used to wash the wounds, and `Ali bin Abi Talib used to pour water from a shield. When Fatima saw that the water aggravated the bleeding, she took a piece of a mat, burnt it, and inserted its ashes into the wound so that the blood was congealed (and bleeding stopped). His canine tooth got broken on that day, and face was wounded, and his helmet was broken on his head.\"",
      "chain": [
        "30367",
        "20184",
        "11349",
        "399"
      ]
    },
    {
      "hadith_no": "4147",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا يحيى بن سعيد، عن عبيد الله، قال أخبرني نافع، عن ابن عمر  رضى الله عنهما أن النبي صلى الله عليه وسلم عرضه يوم أحد وهو ابن أربع عشرة فلم يجزه، وعرضه يوم الخندق وهو ابن خمس عشرة فأجازه‏.‏",
      "text_en": " Narrated Ibn `Umar:                     That the Prophet inspected him on the day of Uhud while he was fourteen years old, and the Prophet did not allow him to take part in the battle. He was inspected again by the Prophet on the day of Al- Khandaq (i.e. battle of the Trench) while he was fifteen years old, and the Prophet allowed him to take Part in the battle.",
      "chain": [
        "20184",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4230",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق، أخبرنا يعقوب، حدثني ابن أخي ابن شهاب، عن عمه، أخبرني عروة بن الزبير، أنه سمع مروان بن الحكم، والمسور بن مخرمة، يخبران خبرا من خبر رسول الله صلى الله عليه وسلم في عمرة الحديبية فكان فيما أخبرني عروة عنهما أنه لما كاتب رسول الله صلى الله عليه وسلم سهيل بن عمرو، يوم الحديبية على قضية المدة، وكان فيما اشترط سهيل بن عمرو أنه قال لا يأتيك منا أحد وإن كان على دينك إلا رددته إلينا، وخليت بيننا وبينه‏.‏ وأبى سهيل أن يقاضي رسول الله صلى الله عليه وسلم إلا على ذلك، فكره المؤمنون ذلك وامعضوا، فتكلموا فيه، فلما أبى سهيل أن يقاضي رسول الله صلى الله عليه وسلم إلا على ذلك، كاتبه رسول الله صلى الله عليه وسلم، فرد رسول الله صلى الله عليه وسلم أبا جندل بن سهيل يومئذ إلى أبيه سهيل بن عمرو، ولم يأت رسول الله صلى الله عليه وسلم أحد من الرجال إلا رده في تلك المدة، وإن كان مسلما، وجاءت المؤمنات مهاجرات، فكانت أم كلثوم بنت عقبة بن معيط ممن خرج إلى رسول الله صلى الله عليه وسلم وهى عاتق، فجاء أهلها يسألون رسول الله صلى الله عليه وسلم أن يرجعها إليهم، حتى أنزل الله تعالى في المؤمنات ما أنزل‏.‏",
      "text_en": " Narrated `Urwa bin Az-Zubair:                     That he heard Marwan bin Al-Hakam and Al-Miswar bin Makhrama relating one of the events that happened to Allah's Apostle in the `Umra of Al-Hudaibiya. They said, \"When Allah's Apostle concluded the truce with Suhail bin `Amr on the day of Al-Hudaibiya, one of the conditions which Suhail bin `Amr stipulated, was his saying (to the Prophet), \"If anyone from us (i.e. infidels) ever comes to you, though he has embraced your religion, you should return him to us, and should not interfere between us and him.\" Suhail refused to conclude the truce with Allah's Apostle except on this condition. The believers disliked this condition and got disgusted with it and argued about it. But when Suhail refused to conclude the truce with Allah's Apostle except on that condition, Allah's Apostle concluded it. Accordingly, Allah's Apostle then returned Abu Jandal bin Suhail to his father, Suhail bin `Amr, and returned every man coming to him from them during that period even if he was a Muslim. The believing women Emigrants came (to Medina) and Um Kulthum, the daughter of `Uqba bin Abi Mu'ait was one of those who came to Allah's Apostle and she was an adult at that time. Her relatives came, asking Allah's Apostle to return her to them, and in this connection, Allah revealed the Verses dealing with the believing (women). Aisha said, \"Allah's Apostle used to test all the believing women who migrated to him, with the following Verse:-- \"O Prophet! When the believing Women come to you, to give the pledge of allegiance to you.\" (60.12) `Urwa's uncle said, \"We were informed when Allah ordered His Apostle to return to the pagans what they had given to their wives who lately migrated (to Medina) and we were informed that Abu Basir...\" relating the whole narration.",
      "chain": [
        "30021",
        "20184",
        "20176",
        "10511",
        "858"
      ]
    }
  ],
  "total_hadiths": 379
}