{
  "id": "20182",
  "name": "al-Mughira bin 'Abdur Rahman - Qusayy المغيرة بن عبد الرحمن بن عبد الله - قصي",
  "full_name": "al-Mughira bin 'Abdur Rahman - Qusayy المغيرة بن عبد الرحمن بن عبد الله - قصي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ قد  ع  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "B.Asad",
      "al-Madni"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "30104",
      "name": "'Abdur Rahman bin al-Mughira عبد الرحمن بن المغيرة بن عبد الرحمن",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "teachers": [
    {
      "id": "11061",
      "name": "Abu al-Zanad أبو الزناد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11106",
      "name": "Musa bin 'Uqba موسى بن عقبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11164",
      "name": "Salm Abi al-Nadr سالم بن أبي أمية - أبو النضر",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11414",
      "name": "Rabi'a bin Yazid al-Damashqi ربيعة بن يزيد الدمشقي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11705",
      "name": "'Abdul Majeed bin Sahl bin 'Abdur Rahman عبد المجيد بن سهل بن عبد الرحمن",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19944",
      "name": "al-Muttalib bin 'Abdullah bin Hantab المطلب بن عبد الله بن حنطب",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20504",
      "name": "al-Dahhak bin 'Uthman bin 'Abdullah الضحاك بن عثمان بن عبد الله بن خالد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30104",
      "name": "'Abdur Rahman bin al-Mughira عبد الرحمن بن المغيرة بن عبد الرحمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20443",
      "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30382",
      "name": "Muhammad bin al-Mubarak محمد بن المبارك",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30399",
      "name": "Yahya bin Yahya bin Bukayr يحيى بن يحيى بن بكير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30399",
      "name": "Yahya bin Yahya bin Bukayr يحيى بن يحيى بن بكير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20164",
      "name": "'Abdullah bin Muslima al-Qa'nabi عبد الله بن مسلمة بن قعنب القعنبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30463",
      "name": "Khalid bin Mukhallad al-Qatwani خالد بن مخلد القطواني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30232",
      "name": "Sa'id bin Abi Maryam سعيد بن أبي مريم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30116",
      "name": "Sa'id bin Mnswr bin Sh'bh سعيد بن منصور بن شعبة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1006",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا قتيبة، حدثنا مغيرة بن عبد الرحمن، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن النبي صلى الله عليه وسلم كان إذا رفع رأسه من الركعة الآخرة يقول ‏\"‏ اللهم أنج عياش بن أبي ربيعة، اللهم أنج سلمة بن هشام، اللهم أنج الوليد بن الوليد، اللهم أنج المستضعفين من المؤمنين، اللهم اشدد وطأتك على مضر، اللهم اجعلها سنين كسني يوسف ‏\"‏‏.‏ وأن النبي صلى الله عليه وسلم قال ‏\"‏ غفار غفر الله لها، وأسلم سالمها الله ‏\"‏‏.‏ قال ابن أبي الزناد عن أبيه هذا كله في الصبح‏.‏",
      "text_en": " Narrated Abu Huraira;:                     Whenever the Prophet (p.b.u.h) lifted his head from the bowing in the last rak`a he used to say: \"O Allah! Save `Aiyash bin Abi Rabi`a. O Allah! Save Salama bin Hisham. O Allah! Save Walid bin Walid. O Allah! Save the weak faithful believers. O Allah! Be hard on the tribes of Mudar and send (famine) years on them like the famine years of (Prophet) Joseph .\" The Prophet further said, \"Allah forgive the tribes of Ghifar and save the tribes of Aslam.\" Abu Az-Zinad (a sub-narrator) said, \"The Qunut used to be recited by the Prophet in the Fajr prayer.\"",
      "chain": [
        "30367",
        "20182",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "3026",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "وقال أبو عامر حدثنا مغيرة بن عبد الرحمن، عن أبي الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تمنوا لقاء العدو، فإذا لقيتموهم فاصبروا ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          The Prophet said: \"Do not wish to meet the enemy, but when you meet      face) the enemy, be patient.\"",
      "chain": [
        "20443",
        "20182",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "3194",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا مغيرة بن عبد الرحمن القرشي، عن أبي الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لما قضى الله الخلق كتب في كتابه، فهو عنده فوق العرش إن رحمتي غلبت غضبي ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"When Allah completed the creation, He wrote in His Book which is with Him on His Throne, \"My Mercy overpowers My Anger.\"",
      "chain": [
        "30367",
        "20182",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "3356",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا مغيرة بن عبد الرحمن القرشي، عن أبي الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اختتن إبراهيم  عليه السلام  وهو ابن ثمانين سنة بالقدوم ‏\"‏‏.‏ حدثنا أبو اليمان أخبرنا شعيب حدثنا أبو الزناد ‏\"‏ بالقدوم ‏\"‏‏.‏ مخففة‏.‏ تابعه عبد الرحمن بن إسحاق عن أبي الزناد‏.‏ تابعه عجلان عن أبي هريرة‏.‏ ورواه محمد بن عمرو عن أبي سلمة‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Abraham did his circumcision with an adze at the age of eighty.\"Narrated Abu Az-Zinad:(as above in Hadith No. 575) With an adze.",
      "chain": [
        "30367",
        "20182",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "3424",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا خالد بن مخلد، حدثنا مغيرة بن عبد الرحمن، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ قال سليمان بن داود لأطوفن الليلة على سبعين امرأة تحمل كل امرأة فارسا يجاهد في سبيل الله، فقال له صاحبه إن شاء الله‏.‏ فلم يقل، ولم تحمل شيئا إلا واحدا ساقطا إحدى شقيه ‏\"‏‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لو قالها لجاهدوا في سبيل الله ‏\"‏‏.‏ قال شعيب وابن أبي الزناد ‏\"‏ تسعين ‏\"‏‏.‏ وهو أصح‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Solomon (the son of) David said, 'Tonight I will sleep with seventy ladies each of whom will conceive a child who will be a knight fighting for \"Allah's Cause.' His companion said, 'If Allah will.' But Solomon did not say so; therefore none of those women got pregnant except one who gave birth to a half child.\" The Prophet further said, \"If the Prophet Solomon had said it (i.e. 'If Allah will') he would have begotten children who would have fought in Allah's Cause.\" Shuaib and Ibn Abi Az-Zinad said, \"Ninety (women) is more correct (than seventy).",
      "chain": [
        "30463",
        "20182",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "3828",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا الصلت بن محمد أبو همام، قال سمعت المغيرة بن عبد الرحمن، حدثنا أبو الزناد، عن الأعرج، عن أبي هريرة  رضى الله عنه  قال قالت الأنصار اقسم بيننا وبينهم النخل‏.‏ قال ‏\"‏ لا ‏\"‏‏.‏ قال يكفونا المئونة وتشركونا في التمر‏.‏ قالوا سمعنا وأطعنا‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Ansar said (to the Prophet ), \"Please divide the date-palm trees between us and them (i.e. emigrants).\" The Prophet said, \"No.\" The Ansar said, \"Let them (i.e. the emigrants) do the labor for us in the gardens and share the date-fruits with us.\" The emigrants said, \"We accepted this.\"",
      "chain": [
        "30140",
        "20182",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "4306",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "أخبرنا أحمد بن أبي بكر، حدثنا مغيرة بن عبد الرحمن، عن عبد الله بن سعيد، عن نافع، عن عبد الله بن عمر  رضى الله عنهما  قال أمر رسول الله صلى الله عليه وسلم في غزوة موتة زيد بن حارثة، فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن قتل زيد فجعفر، وإن قتل جعفر فعبد الله بن رواحة ‏\"‏‏.‏ قال عبد الله كنت فيهم في تلك الغزوة فالتمسنا جعفر بن أبي طالب، فوجدناه في القتلى، ووجدنا ما في جسده بضعا وتسعين من طعنة ورمية‏.‏",
      "text_en": "",
      "chain": [
        "20182",
        "11184",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "7593",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا المغيرة بن عبد الرحمن، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يقول الله إذا أراد عبدي أن يعمل سيئة فلا تكتبوها عليه حتى يعملها، فإن عملها فاكتبوها بمثلها وإن تركها من أجلي فاكتبوها له حسنة وإذا أراد أن يعمل حسنة فلم يعملها فاكتبوها له حسنة، فإن عملها فاكتبوها له بعشر أمثالها إلى سبعمائة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Allah says, \"If My slave intends to do a bad deed then (O Angels) do not write it unless he does it; if he does it, then write it as it is, but if he refrains from doing it for My Sake, then write it as a good deed (in his account). (On the other hand) if he intends to go a good deed, but does not do it, then write a good deed (in his account), and if he does it, then write it for him (in his account) as ten good deeds up to seven-hundred times.' \"",
      "chain": [
        "30367",
        "20182",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "467",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا المغيرة، - وهو ابن عبد الرحمن الحزامي - عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أم أحدكم الناس فليخفف فإن فيهم الصغير والكبير والضعيف والمريض فإذا صلى وحده فليصل كيف شاء ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Apostle of Allah (may peace be upon him) said: When any one of you leads the people in prayer, he should be brief for among them are the young and the aged, the weak and the sick. But when one of you prays by himself, he may (prolong) as he likes.",
      "chain": [
        "30367",
        "20182",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "3272",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا المغيرة بن عبد الرحمن الحزامي، عن أبي الزناد، عن الأعرج، بهذا الإسناد وقال بينما رجل يسوق بدنة مقلدة ‏.‏",
      "text_en": " This hadith has been narrated by A'raj with the same chain of transmitters (and the words are):                     \" Whereas the person was driving a sacrificial camel which was garlanded.\"",
      "chain": [
        "30399",
        "20182",
        "11061"
      ]
    },
    {
      "hadith_no": "4639",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا الحسن بن علي الحلواني، وعبد بن حميد، قالا حدثنا أبو عامر العقدي، عن المغيرة، - وهو ابن عبد الرحمن الحزامي - عن أبي الزناد، عن الأعرج، عن أبي، هريرة أن النبي صلى الله عليه وسلم قال ‏\"‏ لا تمنوا لقاء العدو فإذا لقيتموهم فاصبروا‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      Do not desire an encounter with the enemy; but when you encounter them, be firm.",
      "chain": [
        "30115",
        "30553",
        "20443",
        "20182",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "4852",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا المغيرة بن عبد الرحمن الحزامي، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من أطاعني فقد أطاع الله ومن يعصني فقد عصى الله ومن يطع الأمير فقد أطاعني ومن يعص الأمير فقد عصاني ‏\"‏ ‏.‏ وحدثنيه زهير بن حرب، حدثنا ابن عيينة، عن أبي الزناد، بهذا الإسناد ولم يذكر \" ومن يعص الأمير فقد عصاني ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Huraira that the Holy prophet (may peace be upon him) said:                      Whoso obeys me obeys God, and whoso disobeys me disobeys God. Whoso obeys the commander (appointed by me) obeys me, and whoso disobeys the commander disobeys me. The same tradition transmitted by different persons omits the portion: And whose disobeys the commander disobeys me.",
      "chain": [
        "30399",
        "20182",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "4969",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا المغيرة بن عبد الرحمن الحزامي، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ تكفل الله لمن جاهد في سبيله لا يخرجه من بيته إلا جهاد في سبيله وتصديق كلمته - بأن يدخله الجنة أو يرجعه إلى مسكنه الذي خرج منه مع ما نال من أجر أو غنيمة ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Huraira who said:                      Allah has undertaken to provide for one who leaves his home (only) to fight for His cause and to affirm the truth of His word; Allah will either admit him to Paradise or will bring him back home from where he had come out, with his reward and booty.",
      "chain": [
        "30399",
        "20182",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "5987",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا المغيرة، - يعني ابن عبد الرحمن الحزامي - عن  أبي الزناد، عن الأعرج، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ نزل نبي من الأنبياء تحت شجرة فلدغته نملة فأمر بجهازه فأخرج من تحتها ثم أمر بها فأحرقت فأوحى الله إليه فهلا نملة واحدة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      An Apostle from amongst the Apostles of Allah encamped under a tree, and an ant bit him, and he commanded his belongings to be removed from underneath the tree. He then commanded and it was burnt, and Allah revealed to bin):\" Why one ant (which had bitten you) was not killed?\"",
      "chain": [
        "30367",
        "20182",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "6002",
      "source": " Sahih Muslim ",
      "chapter": "The Book Concerning the Use of Correct Words - كتاب الألفاظ من الأدب وغيرها",
      "chapter_no": "41",
      "text_ar": "حدثنا قتيبة، حدثنا المغيرة بن عبد الرحمن، عن أبي الزناد، عن الأعرج، عن  أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يقولن أحدكم يا خيبة الدهر ‏.‏ فإن الله هو الدهر ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      None of you should say: Woe be upon the Time, for verily Allah is the Time.",
      "chain": [
        "30367",
        "20182",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "6290",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا المغيرة، - يعني ابن عبد الرحمن الحزامي - عن  أبي الزناد، عن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اختتن إبراهيم النبي عليه السلام وهو ابن ثمانين سنة بالقدوم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) having said that Ibrahim circumcised himself with the help of adz when he was eiclhty years old.",
      "chain": [
        "30367",
        "20182",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "6581",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، أخبرنا المغيرة بن عبد الرحمن، عن أبي الزناد، قال شهد أبو سلمة لسمع أبا أسيد الأنصاري يشهد أن رسول الله صلى الله عليه وسلم قال ‏\"‏ خير دور الأنصار بنو النجار ثم بنو عبد الأشهل ثم بنو الحارث بن الخزرج ثم بنو ساعدة وفي كل دور الأنصار خير ‏\"‏ ‏.‏ قال أبو سلمة قال أبو أسيد أتهم أنا على رسول الله صلى الله عليه وسلم لو كنت كاذبا لبدأت بقومي بني ساعدة ‏.‏ وبلغ ذلك سعد بن عبادة فوجد في نفسه وقال خلفنا فكنا آخر الأربع أسرجوا لي حماري آتي رسول الله صلى الله عليه وسلم ‏.‏ وكلمه ابن أخيه سهل فقال أتذهب لترد على رسول الله صلى الله عليه وسلم ورسول الله صلى الله عليه وسلم أعلم أوليس حسبك أن تكون رابع أربع ‏.‏ فرجع وقال الله ورسوله أعلم وأمر بحماره فحل عنه ‏.‏",
      "text_en": " Abu Usaid Ansar reported:                      I bear witness to the fact that Allah's Messenger (may peace be upon him) said: The best settlements of the Ansar are of those of Banu Najjar, then of Banu 'Abu al-Aslihal and then of Banu Harith b. Khazraj, then of Banu Sa'ida and there is in every settlement of the Ansar good. Abu Salama reported that Abu Usaid said: Can I tell a Iie about Allah's Messenger (may peace be upon him)? And if I were a liar, I would have started with my tribe Banu Sa'ida. This was conveyed to Sa'd b. 'Ubida and he found (rankling) in his mind and said: We have been left behind (in the sense) that we have been (mentioned) last of the four. He (Sa'd) sid: Saddle my pony so that I should go to Allah's Messenger (may peace be upon him). His nephew saw him and said: Are you going to contradict (the order of) precedence set by Allah's Messenger (may peace be upon him), whereas Allah's Messenger (may peace be upon him) has the best knowledge of it? Is it not sufficient for you that you are the fourth amongst the four (best tribes of the Ansar)? So he returned and said: Allah and His Messenger know best, and he commanded that his pony should be unsaddled.",
      "chain": [
        "30399",
        "20182",
        "11061"
      ]
    },
    {
      "hadith_no": "6611",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا المغيرة بن عبد الرحمن، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال قدم الطفيل وأصحابه فقالوا يا رسول الله إن دوسا قد كفرت وأبت فادع الله عليها ‏.‏ فقيل هلكت دوس فقال ‏\"‏ اللهم اهد دوسا وائت بهم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that Tufail and his companions said:                      Allah's Messenger, the tribe of Daws has disbelieved and has belied you, so invoke curse upon them. It was said: Let Daws be destroyed, whereupon he (Allah's Messenger) said: Allah guide aright the tribe of Daws and direct them to me.",
      "chain": [
        "30399",
        "20182",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "6617",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا المغيرة بن عبد الرحمن الحزامي، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تجدون الناس معادن ‏\"‏ ‏.‏ بمثل حديث الزهري غير أن في حديث أبي زرعة والأعرج ‏\"‏ تجدون من خير الناس في هذا الشأن أشدهم له كراهية حتى يقع فيه ‏\"‏ ‏.‏",
      "text_en": "",
      "chain": [
        "30367",
        "20182",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "6784",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا المغيرة، - يعني ابن عبد الرحمن الحزامي - عن  أبي الزناد، عن الأعرج، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ اللهم إني أتخذ عندك عهدا لن تخلفنيه فإنما أنا بشر فأى المؤمنين آذيته شتمته لعنته جلدته فاجعلها له صلاة وزكاة وقربة تقربه بها إليك يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace be upon him) as saying:                      O Allah, I make a covenant with Thee against which Thou wouldst never go. I am a human being and thus for a Muslim whom I give any harm or whom I scold or upon whom I invoke curse or whom I beat, make this a source of blessing, purification and nearness to Thee on the Day of Resurrection.",
      "chain": [
        "30367",
        "20182",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "7129",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثني عبد الله بن مسلمة بن قعنب القعنبي، حدثنا المغيرة، - يعني ابن عبد الرحمن الحزامي - عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لله أشد فرحا بتوبة أحدكم من أحدكم بضالته إذا وجدها ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Allah is more pleased with the repentance of His servant when he turns penitently towards Him than one of you would be on finding the lost camel.",
      "chain": [
        "20182",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "7315",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا المغيرة، - يعني ابن عبد الرحمن الحزامي - عن  أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثله وزاد ‏\"‏ لا يقطعها ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters with the addition of these words:                     \" He will not be able to cover this distance.\"",
      "chain": [
        "30367",
        "20182",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "7344",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا المغيرة، - يعني ابن عبد الرحمن الحزامي - عن  أبي الزناد، عن الأعرج، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ ناركم هذه التي يوقد ابن آدم جزء من سبعين جزءا من حر جهنم ‏\"‏ ‏.‏ قالوا والله إن كانت لكافية يا رسول الله ‏.‏ قال ‏\"‏ فإنها فضلت عليها بتسعة وستين جزءا كلها مثل حرها ‏\"‏ ‏.‏",
      "text_en": " Abil Huraira reported Allah's Apostle (may peace be upon him) as seying:                      The fire which sons of Adam burn is only one-seventieth part of the Fire of Hell. His Companions said: By Allah, even ordinary fire would have been enough (to burn people). Thereupon he said: It is sixty-nine parts in excess of (the heat of) fire in this world each of them being equivalent to their heat.",
      "chain": [
        "30367",
        "20182",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "7617",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا يحيى بن يحيى، وقتيبة بن سعيد، قال قتيبة حدثنا وقال، يحيى أخبرنا  المغيرة بن عبد الرحمن الحزامي، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا نظر أحدكم إلى من فضل عليه في المال والخلق فلينظر إلى من هو أسفل منه ممن فضل عليه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that Allah's Messenger (may peace be upon him) said:                      When one of you looks at one who stands at a higher level than you in regard to wealth and physical structure he should also see one who stands at a lower level than you in regard to these things (in which he stands) at a hi-her level (as compared to him).",
      "chain": [
        "30399",
        "30367",
        "30367",
        "20031",
        "20182",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2673",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا مغيرة بن عبد الرحمن الحزامي، عن أبي الزناد، حدثني محمد بن حمزة الأسلمي، عن أبيه، أن رسول الله صلى الله عليه وسلم أمره على سرية قال فخرجت فيها وقال ‏\"‏ إن وجدتم فلانا فاحرقوه بالنار ‏\"‏ ‏.‏ فوليت فناداني فرجعت إليه فقال ‏\"‏ إن وجدتم فلانا فاقتلوه ولا تحرقوه فإنه لا يعذب بالنار إلا رب النار ‏\"‏ ‏.‏",
      "text_en": " Narrated Hamzah al-Aslami:                     The Messenger of Allah (ﷺ) appointed him commander over a detachment. He said: I went out along with it. He (the Prophet) said: If you find so-and-so, burn him with the fire. I then turned away, and he called me. So I returned to him, and he said: If you find so-and-so, kill him, and do not burn him, for no one punishes with fire except the Lord of the fire.",
      "chain": [
        "30116",
        "20182",
        "11061"
      ]
    },
    {
      "hadith_no": "3273",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا المغيرة بن عبد الرحمن، حدثني أبي عبد الرحمن، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏:‏ ‏\"‏ لا نذر إلا فيما يبتغى به وجه الله، ولا يمين في قطيعة رحم ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Messenger of Allah (ﷺ) said: A vow is binding in those things by which the pleasure of Allah is sought, and an oath to break ties of relationship is not binding.",
      "chain": [
        "30423",
        "20182",
        "11359",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3639",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن عبدة، حدثنا المغيرة بن عبد الرحمن، حدثني أبي عبد الرحمن بن الحارث، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قضى في السيل المهزور أن يمسك حتى يبلغ الكعبين ثم يرسل الأعلى على الأسفل ‏.‏",
      "text_en": " 'Amr bin Shu'aib on his father's authority said that his grandfather told that the Messenger of Allah (ﷺ) decided regarding the stream al-Mahzur that its water should be held back till it reached the ankles, and that the upper waters should then be allowed to flow to the lower.",
      "chain": [
        "30423",
        "20182",
        "11359",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "5265",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا قتيبة بن سعيد، عن المغيرة، - يعني ابن عبد الرحمن - عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ نزل نبي من الأنبياء تحت شجرة فلدغته نملة فأمر بجهازه فأخرج من تحتها ثم أمر بها فأحرقت فأوحى الله إليه فهلا نملة واحدة ‏\"‏ ‏.‏",
      "text_en": " Abu hurairah reported the prophet (peace be upon him) as saying :                      A prophet got down beneath a tree and he was stung by an ant. He ordered regarding the baggage and it was removed from beneath it. He then ordered regarding it and it was burnt. Allah then revealed to him : why not (just) one ant?",
      "chain": [
        "30367",
        "20182",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "236",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا المغيرة بن عبد الرحمن، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أم أحدكم الناس فليخفف فإن فيهم الصغير والكبير والضعيف والمريض فإذا صلى وحده فليصل كيف شاء ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عدي بن حاتم وأنس وجابر بن سمرة ومالك بن عبد الله وأبي واقد وعثمان بن أبي العاص وأبي مسعود وجابر بن عبد الله وابن عباس ‏.‏ قال أبو عيسى وحديث أبي هريرة حديث حسن صحيح ‏.‏ وهو قول أكثر أهل العلم اختاروا أن لا يطيل الإمام الصلاة مخافة المشقة على الضعيف والكبير والمريض ‏.‏ قال أبو عيسى وأبو الزناد اسمه عبد الله بن ذكوان ‏.‏ والأعرج هو عبد الرحمن بن هرمز المديني ويكنى أبا داود ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Prophet said: \"When one of you leads the people in prayer then let him be brief, for indeed here are among them the young and the old, the weak and the ill. When one of you prays alone, then let him pray as he wishes.\"",
      "chain": [
        "30367",
        "20182",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "488",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا قتيبة، حدثنا المغيرة بن عبد الرحمن، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ خير يوم طلعت فيه الشمس يوم الجمعة فيه خلق آدم وفيه أدخل الجنة وفيه أخرج منها ولا تقوم الساعة إلا في يوم الجمعة ‏\"‏ ‏.‏ قال وفي الباب عن أبي لبابة وسلمان وأبي ذر وسعد بن عبادة وأوس بن أوس ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     the Prophet said: \"The best day that the sun has risen upon is Friday. On it Adam was created, on it he entered Paradise, and on it, he was expelled from it. And the Hour will not be established except on Friday.\"",
      "chain": [
        "30367",
        "20182",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "3114",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Parables - كتاب الأمثال عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "44",
      "text_ar": "حدثنا قتيبة، حدثنا المغيرة بن عبد الرحمن، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنما مثلي ومثل أمتي كمثل رجل استوقد نارا فجعلت الدواب والفراش يقعن فيها وأنا آخذ بحجزكم وأنتم تقحمون فيها ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح وقد روي من غير وجه ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"The Parable of myself and that of my Ummah is that of a man who kindled a fire, and the flies and moths began flying into it - and I am trying to prevent you from diving into it.\"",
      "chain": [
        "30367",
        "20182",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "3538",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا قتيبة، حدثنا المغيرة بن عبد الرحمن، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لله أفرح بتوبة أحدكم من أحدكم بضالته إذا وجدها ‏\"‏ ‏.‏ قال وفي الباب عن ابن مسعود والنعمان بن بشير وأنس ‏.‏ قال وهذا حديث حسن صحيح غريب من هذا الوجه من حديث أبي الزناد ‏.‏ وقد روي هذا الحديث عن مكحول بإسناد له عن أبي ذر عن النبي صلى الله عليه وسلم نحو هذا ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah said:                     “Allah is more delighted with the repentance of one of you, than one of you is, when finding his lost animal.”",
      "chain": [
        "30367",
        "20182",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "4331",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة، حدثنا المغيرة بن عبد الرحمن، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ والذي نفس محمد بيده لغفار وأسلم ومزينة ومن كان من جهينة أو قال جهينة ومن كان من مزينة خير عند الله يوم القيامة من أسد وطيئ وغطفان ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"By the One in Whose Hand is Muhammad's soul! Ghifar, Aslam, Muzainah, and whoever is from Juhainah,\" or he said: \"Juhainah, and whoever is from Muzainah, they are better with Allah on the Day of Judgment than Asad, Tayyi' and Ghatafan.\"",
      "chain": [
        "30367",
        "20182",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2025",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا المغيرة بن عبد الرحمن، قال حدثنا زيد بن علي، - وهو أبو أسامة - قال حدثنا جعفر بن برقان، عن حبيب بن أبي مرزوق، عن عطاء، عن جابر، ‏:‏ أن النبي صلى الله عليه وسلم صلى على قبر امرأة بعد ما دفنت ‏.‏",
      "text_en": " It was narrated from Jabir:                     That the Prophet prayed at the grave of a woman after she had been buried.",
      "chain": [
        "20182",
        "20646",
        "28091",
        "11029"
      ]
    },
    {
      "hadith_no": "2412",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا زكريا بن يحيى، قال أنبأنا أبو مصعب، عن مغيرة بن عبد الرحمن، عن عبد الله بن سعيد بن أبي هند، عن محمد بن إسحاق، عن سعيد بن أبي هند، قال عثمان بن أبي العاص نحوه مرسل ‏.‏",
      "text_en": " It was narrated that Sa'eed bin Abi Hind said:                     \"Uthman bin Abi Al-As\" and he narrated something similar in Mursal form.",
      "chain": [
        "30100",
        "20182",
        "11184",
        "11107",
        "11427",
        "3210"
      ]
    },
    {
      "hadith_no": "2499",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرني المغيرة بن عبد الرحمن، قال حدثنا أحمد بن أبي شعيب، عن موسى بن أعين، عن عمرو بن الحارث، عن عمرو بن شعيب، عن أبيه، عن جده، قال جاء هلال إلى رسول الله صلى الله عليه وسلم بعشور نحل له وسأله أن يحمي له واديا يقال له سلبة فحمى له رسول الله صلى الله عليه وسلم ذلك الوادي فلما ولي عمر بن الخطاب كتب سفيان بن وهب إلى عمر بن الخطاب يسأله فكتب عمر إن أدى إليك ما كان يؤدي إلى رسول الله صلى الله عليه وسلم من عشر نحله فاحم له سلبة ذلك وإلا فإنما هو ذباب غيث يأكله من شاء ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father that his grandfather said:                     \"Hilal came to the Messenger of Allah with one-tenth of the honey and asked him to protect a valley for him that was called Salabah. 'The Messenger of Allah protected that valley for him. When 'Umar bin Al-Khattab became the Khalifah, sufyan bin Wahb wrote the 'Umar and asked him (about that), and Umar wrote: 'If the gives me what he used to give to the Messenger of Allah, one-tenth of his honey, I will protect Salahab for him, otherwise they are just bees and anyone who wants to may eat of it.\"'",
      "chain": [
        "20182",
        "30301",
        "20465",
        "20377",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3899",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرني المغيرة بن عبد الرحمن، قال حدثنا عيسى، - هو ابن يونس - قال حدثنا الأوزاعي، عن ربيعة بن أبي عبد الرحمن، عن حنظلة بن قيس الأنصاري، قال سألت رافع بن خديج عن كراء الأرض، بالدينار والورق فقال لا بأس بذلك إنما كان الناس على عهد رسول الله صلى الله عليه وسلم يؤاجرون على الماذيانات وأقبال الجداول فيسلم هذا ويهلك هذا ويسلم هذا ويهلك هذا فلم يكن للناس كراء إلا هذا فلذلك زجر عنه فأما شىء معلوم مضمون فلا بأس به‏.‏‏ وافقه مالك بن أنس على إسناده وخالفه في لفظه‏.‏‏",
      "text_en": " It was narrated that Hanzalah bin Qais Al-Ansari said:                      \"I asked Rafi' bin Khadij about leasing land in return for Dinars and silver. He said: 'There is nothing wrong with that. During the time of the Messenger of Allah they used to rent land to one another in return for what grew on the banks of streams and where the springs emerged - some areas of which might give good produce and some might give none at all - and the people did not lease land in any other way. So that was forbidden. But as for leases where the return is known and guaranteed, there is nothing wrong with that.'\"",
      "chain": [
        "20182",
        "20347",
        "20024",
        "11162",
        "11503",
        "1986"
      ]
    },
    {
      "hadith_no": "5404",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا المغيرة بن عبد الرحمن، قال حدثنا مسكين بن بكير، قال حدثنا شعيب بن أبي حمزة، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ خرجت امرأتان معهما ولداهما فأخذ الذئب أحدهما فاختصمتا في الولد إلى داود النبي صلى الله عليه وسلم فقضى به للكبرى منهما فمرتا على سليمان عليه السلام فقال كيف قضى بينكما قالت قضى به للكبرى ‏.‏ قال سليمان أقطعه بنصفين لهذه نصف ولهذه نصف ‏.‏ قالت الكبرى نعم اقطعوه ‏.‏ فقالت الصغرى لا تقطعه هو ولدها ‏.‏ فقضى به للتي أبت أن يقطعه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     The Prophet [SAW] said: \"Two women went out with their two children, and the wolf took one of the children from them. They referred their dispute to Prophet Dawud, peace be upon him, and he ruled that (the remaining child) belonged to the older woman. Then they passed by Sulaiman, peace be upon him, and he said: 'How did he judge between you?' She said: 'He ruled that (the child) belongs to the older woman.' Sulaiman said: 'Cut him in half, and give half to one and half to the other.' The older woman said: 'Yes, cut him in half.' The younger woman said: 'Do not cut him, he is her child.' So he ruled that the child belonged to the woman who refused to let him be cut.\"",
      "chain": [
        "20182",
        "20463",
        "20428",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "333",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا المغيرة بن عبد الرحمن، وعبد الله بن رجاء المكي، عن محمد بن عجلان، عن القعقاع بن حكيم، عن أبي صالح، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا استطاب أحدكم فلا يستطب بيمينه ليستنج بشماله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'When anyone of you cleans himself, he should not clean himself with his right hand. Let him clean himself with his left hand.'\"",
      "chain": [
        "32048",
        "20182",
        "23027",
        "10616",
        "10612",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "688",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا المغيرة بن عبد الرحمن، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، أنه كان يصلي مع النبي  صلى الله عليه وسلم  المغرب إذا توارت بالحجاب ‏.‏",
      "text_en": " It was narrated from Salamah bin Akwa' that:                     He used to pray the Maghrib with the Messenger of Allah when the sun set.",
      "chain": [
        "32048",
        "20182",
        "11450",
        "237"
      ]
    },
    {
      "hadith_no": "705",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا المغيرة بن عبد الرحمن، عن محمد بن عجلان، عن المقبري، عن أبي هريرة، ح وحدثنا يعقوب بن حميد، حدثنا ابن أبي حازم، عن عبد الرحمن بن حرملة، عن سعيد بن المسيب، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ لا تغلبنكم الأعراب على اسم صلاتكم - زاد ابن حرملة - فإنما هي العشاء وإنما يقولون العتمة لإعتامهم بالإبل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Prophet said: \"Do not let the Bedouins make you change the name of your prayer.\" Ibn Harmalah added: \"Rather it is the 'Isha', but they say the 'Atamah because they bring their camels in for milking at that time (when it is dark).\"",
      "chain": [
        "32048",
        "20182",
        "10616",
        "11168",
        "13",
        "32048",
        "20165",
        "11878",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "1569",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا المغيرة بن عبد الرحمن، حدثنا خالد بن إلياس، عن إسماعيل بن عمرو بن سعيد بن العاص، عن عثمان بن عبد الله بن الحكم بن الحارث، عن عثمان بن عفان، ‏.‏ أن النبي  صلى الله عليه وسلم  صلى على عثمان بن مظعون وكبر عليه أربعا ‏.‏",
      "text_en": " It wasnarrated from ‘Uthman bin ‘Affan that the Prophet (ﷺ)offeredthe funeral prayer for ‘Uthman bin Maz’un, and he said fourTakbir over him.",
      "chain": [
        "32048",
        "20182",
        "22048",
        "18046",
        "13535",
        "4"
      ]
    },
    {
      "hadith_no": "2576",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا أحمد بن عبدة، أنبأنا المغيرة بن عبد الرحمن، حدثني أبي، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قضى في سيل مهزور أن يمسك حتى يبلغ الكعبين ثم يرسل الماء ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu`aib, from his father, from his grandfather, that :                     the Messenger of Allah (ﷺ) ruled concerning the stream of Mahzur that the water should be retained until it reached the ankles, then released.",
      "chain": [
        "30423",
        "20182",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2673",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا عبد العزيز بن أبي حازم، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال وحدثنا المغيرة بن عبد الرحمن، عن ابن عجلان، عن أبيه، عن أبي هريرة، قال وحدثنا أنس بن عياض، عن أبي معشر، عن محمد بن كعب، وموسى بن يسار، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ من حمل علينا السلاح فليس منا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     “Whoever bears weapons against us is not one of us.”",
      "chain": [
        "32048",
        "20165",
        "11173",
        "11161",
        "13",
        "20182",
        "10616",
        "13",
        "20157",
        "19825",
        "11221",
        "19054",
        "13"
      ]
    },
    {
      "hadith_no": "2950",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا قتيبة، حدثنا المغيرة بن عبد الرحمن، عن أبي الزناد، عن المرقع، عن جده، رباح بن الربيع عن النبي صلى الله عليه وسلم نحوه ‏.‏ قال أبو بكر بن أبي شيبة يخطئ الثوري فيه ‏.‏",
      "text_en": "",
      "chain": [
        "30201",
        "30367",
        "20182",
        "11061"
      ]
    },
    {
      "hadith_no": "3316",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا المغيرة بن عبد الرحمن، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، قال غزونا مع رسول الله  صلى الله عليه وسلم  غزوة خيبر فأمسى الناس قد أوقدوا النيران فقال النبي  صلى الله عليه وسلم  ‏\"‏ علام توقدون ‏\"‏ ‏.‏ قالوا على لحوم الحمر الإنسية فقال ‏\"‏ أهريقوا ما فيها واكسروها ‏\"‏ ‏.‏ فقال رجل من القوم أو نهريق ما فيها ونغسلها فقال النبي  صلى الله عليه وسلم  ‏\"‏ أو ذاك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Salamah bin Akwa’ said:                      “We went out with theMessenger of Allah (ﷺ) on the campaign of Khaibar, and in theevening the people lit their fires. The Prophet (ﷺ) said: ‘Whatareyou cooking?’ They said: ‘The meat of domesticated donkeys.’He said:‘Throw out what is in them (the pots) and break them.’ Aman said: ‘Orcan we throw out what is in them and wash them?’The Prophet (ﷺ)said: ‘Or (do) that.’”",
      "chain": [
        "32048",
        "20182",
        "11450",
        "237"
      ]
    },
    {
      "hadith_no": "3790",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا المغيرة بن عبد الرحمن، عن عبد الله بن سعيد بن أبي هند، عن زياد بن أبي زياد، مولى ابن عياش عن أبي بحرية، عن أبي الدرداء، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ ألا أنبئكم بخير أعمالكم وأرضاها عند مليككم وأرفعها في درجاتكم وخير لكم من إعطاء الذهب والورق ومن أن تلقوا عدوكم فتضربوا أعناقهم ويضربوا أعناقكم ‏\"‏ ‏.‏ قالوا وما ذاك يا رسول الله قال ‏\"‏ ذكر الله ‏\"‏ ‏.‏ وقال معاذ بن جبل ما عمل امرؤ بعمل أنجى له من عذاب الله عز وجل من ذكر الله ‏.‏",
      "text_en": " It was narrated from Abu Darda that the Prophet(ﷺ) said:                     \"Shall I not tell you of the best of your deeds, the most pleasing to your Sovereign, those that raise you most in status, that are better than your gold and silver, or meeting you enemy (in battle) and you strike their necks and they strike your necks?\" They said: \" WHat is that, O Messenger of Allah?\" He said: \"Remembering Allah(Dhikr).\"",
      "chain": [
        "32048",
        "20182",
        "11184",
        "19921",
        "37"
      ]
    }
  ],
  "total_hadiths": 47
}