{
  "id": "20191",
  "name": "Khallad bin Yahya bin Safwan خلاد بن يحيى بن صفوان",
  "full_name": "Khallad bin Yahya bin Safwan خلاد بن يحيى بن صفوان",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "217",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa",
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  د  ت  -  صدوق ]"
    ],
    "tags": [
      "al-Salmi",
      "al-Kufa",
      "Makkah"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11607",
      "name": "'Isa bin Thman عيسى بن طهمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11560",
      "name": "Abd al-Wahd bin Aymn عبد الواحد بن أيمن المخزومي مولاهم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20189",
      "name": "Ibrahim bin Nafi' al-Makhzumi إبراهيم بن نافع المخزومي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11642",
      "name": "'Umar bin Dhar bin 'Abdullah al-Hamdani عمر بن ذر بن عبد الله بن زرارة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11718",
      "name": "Fatr bin Khalifa فطر بن خليفة",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30516",
      "name": "Muhammad bin Sahl bin Askr محمد بن سهل بن عسكر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38552",
      "name": "Muhammad bin 'Aqeel محمد بن عقيل",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "31170",
      "name": "Muhammad bin Sulaiman al-Baghandi محمد بن سليمان بن الحارث الباغندي",
      "grade": "3rd Century AH"
    },
    {
      "id": "39615",
      "name": "'Abdullah bin Ahmed bin Zakaria عبد الله بن أحمد بن زكريا",
      "grade": "3rd Century AH"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-277",
      "hadith_no": "277",
      "source": "Sahih Bukhari",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا خلاد بن يحيى، قال حدثنا إبراهيم بن نافع، عن الحسن بن مسلم، عن صفية بنت شيبة، عن عائشة، قالت كنا إذا أصابت إحدانا جنابة، أخذت بيديها ثلاثا فوق رأسها، ثم تأخذ بيدها على شقها الأيمن، وبيدها الأخرى على شقها الأيسر‏.‏",
      "text_en": " Narrated Aisha:                     Whenever any one of us was Junub, she poured water over her head thrice with both her hands and then rubbed the right side of her head with one hand and rubbed the left side of the head with the other hand.",
      "usc_msa_ref": "276",
      "chain": [
        "20191",
        "20189",
        "11557",
        "2802",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-443",
      "hadith_no": "443",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا خلاد بن يحيى، قال حدثنا مسعر، قال حدثنا محارب بن دثار، عن جابر بن عبد الله، قال أتيت النبي صلى الله عليه وسلم وهو في المسجد  قال مسعر أراه قال ضحى  فقال ‏\"‏ صل ركعتين ‏\"‏‏.‏ وكان لي عليه دين فقضاني وزادني‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     I went to the Prophet in the mosque (the sub-narrator Mas`ar thought that Jabir had said, \"In the forenoon.\") He ordered me to pray two rak`at. He owed me some money and he repaid it to me and gave more than what was due to me.",
      "usc_msa_ref": "434",
      "chain": [
        "20191",
        "20359",
        "11389",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-481",
      "hadith_no": "481",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا خلاد بن يحيى، قال حدثنا سفيان، عن أبي بردة بن عبد الله بن أبي بردة، عن جده، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن المؤمن للمؤمن كالبنيان، يشد بعضه بعضا ‏\"‏‏.‏ وشبك أصابعه‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"A faithful believer to a faithful believer is like the bricks of a wall, enforcing each other.\" While (saying that) the Prophet clasped his hands, by interlacing his fingers.",
      "usc_msa_ref": "468",
      "chain": [
        "20191",
        "20012",
        "30170"
      ]
    },
    {
      "id": "sahih-bukhari-769",
      "hadith_no": "769",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا خلاد بن يحيى، قال حدثنا مسعر، قال حدثنا عدي بن ثابت، سمع البراء، رضى الله عنه قال سمعت النبي صلى الله عليه وسلم يقرأ ‏{‏والتين والزيتون‏}‏ في العشاء، وما سمعت أحدا أحسن صوتا منه أو قراءة‏.‏",
      "text_en": " Narrated Al-Bara:                     I heard the Prophet reciting wa t-teeni wa z-zaitun\" (95) in the `Isha' prayer, and I never heard a sweeter voice or a better way of recitation than that of the Prophet.",
      "usc_msa_ref": "",
      "chain": [
        "20191",
        "20359",
        "11372",
        "400"
      ]
    },
    {
      "id": "sahih-bukhari-2095",
      "hadith_no": "2095",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا خلاد بن يحيى، حدثنا عبد الواحد بن أيمن، عن أبيه، عن جابر بن عبد الله  رضى الله عنهما  أن امرأة من الأنصار قالت لرسول الله صلى الله عليه وسلم يا رسول الله، ألا أجعل لك شيئا تقعد عليه فإن لي غلاما نجارا‏.‏ قال ‏\"‏ إن شئت ‏\"‏‏.‏ قال فعملت له المنبر، فلما كان يوم الجمعة قعد النبي صلى الله عليه وسلم على المنبر الذي صنع، فصاحت النخلة التي كان يخطب عندها حتى كادت أن تنشق، فنزل النبي صلى الله عليه وسلم حتى أخذها فضمها إليه، فجعلت تئن أنين الصبي الذي يسكت حتى استقرت‏.‏ قال ‏\"‏ بكت على ما كانت تسمع من الذكر ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     An Ansari woman said to Allah's Apostle, \"O Allah's Apostle! Shall I make something for you to sit on, as I have a slave who is a carpenter?\" He replied, \"If you wish.\" So, she got a pulpit made for him. When it was Friday the Prophet sat on that pulpit. The date-palm stem near which the Prophet used to deliver his sermons cried so much so that it was about to burst. The Prophet came down from the pulpit to the stem and embraced it and it started groaning like a child being persuaded to stop crying and then it stopped crying. The Prophet said,\"It has cried because of (missing) what it use to hear of the religions knowledge.\"",
      "usc_msa_ref": "308",
      "chain": [
        "20191",
        "11560",
        "11556",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-2489",
      "hadith_no": "2489",
      "source": "Sahih Bukhari",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا خلاد بن يحيى، حدثنا سفيان، حدثنا جبلة بن سحيم، قال سمعت ابن عمر  رضى الله عنهما  يقول نهى النبي صلى الله عليه وسلم أن يقرن الرجل بين التمرتين جميعا، حتى يستأذن أصحابه‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet decreed that one should not eat two dates together at a time unless he gets the permission from his companions (sharing the meal with him).",
      "usc_msa_ref": "669",
      "chain": [
        "20191",
        "20012",
        "11329",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-2514",
      "hadith_no": "2514",
      "source": "Sahih Bukhari",
      "chapter": "Mortgaging - كتاب الرهن",
      "chapter_no": "48",
      "text_ar": "حدثنا خلاد بن يحيى، حدثنا نافع بن عمر، عن ابن أبي مليكة، قال كتبت إلى ابن عباس فكتب إلى أن النبي صلى الله عليه وسلم قضى أن اليمين على المدعى عليه‏.‏",
      "text_en": " Narrated Ibn Abu Mulaika:                     I wrote a letter to Ibn `Abbas and he wrote to me that the Prophet had given the verdict that the defendant had to take an oath.",
      "usc_msa_ref": "691",
      "chain": [
        "20191",
        "20203",
        "11090"
      ]
    },
    {
      "id": "sahih-bukhari-2726",
      "hadith_no": "2726",
      "source": "Sahih Bukhari",
      "chapter": "Conditions - كتاب الشروط",
      "chapter_no": "54",
      "text_ar": "حدثنا خلاد بن يحيى، حدثنا عبد الواحد بن أيمن المكي، عن أبيه، قال دخلت على عائشة  رضى الله عنها  قالت دخلت على بريرة وهى مكاتبة، فقالت يا أم المؤمنين اشتريني فإن أهلي يبيعوني فأعتقيني قالت نعم‏.‏ قالت إن أهلي لا يبيعوني حتى يشترطوا ولائي‏.‏ قالت لا حاجة لي فيك‏.‏ فسمع ذلك النبي صلى الله عليه وسلم أو بلغه، فقال ‏\"‏ ما شأن بريرة فقال اشتريها فأعتقيها وليشترطوا ما شاءوا ‏\"‏‏.‏ قالت فاشتريتها فأعتقتها، واشترط أهلها ولاءها، فقال النبي صلى الله عليه وسلم ‏\"‏ الولاء لمن أعتق، وإن اشترطوا مائة شرط ‏\"‏‏.‏",
      "text_en": " Narrated Aiman Al-Makki:                     When I visited Aisha she said, \"Buraira who had a written contract for her emancipation for a certain amount came to me and said, \"O mother of the believers! Buy me and manumit me, as my masters will sell me.\" Aisha agreed to it. Buraira said, 'My masters will sell me on the condition that my Wala will go to them.\" Aisha said to her, 'Then I am not in need of you.' The Prophet heard of that or was told about it and so he asked Aisha, 'What is the problem of Buraira?' He said, 'Buy her and manumit her, no matter what they stipulate.' Aisha added, 'I bought and manumitted her, though her masters had stipulated that her Wala would be for them.' The Prophet said, The Wala is for the liberator, even if the other stipulated a hundred conditions.\"",
      "usc_msa_ref": "886",
      "chain": [
        "20191",
        "11560",
        "11556",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-2740",
      "hadith_no": "2740",
      "source": "Sahih Bukhari",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا خلاد بن يحيى، حدثنا مالك، حدثنا طلحة بن مصرف، قال سألت عبد الله بن أبي أوفى  رضى الله عنهما  هل كان النبي صلى الله عليه وسلم أوصى فقال لا‏.‏ فقلت كيف كتب على الناس الوصية أو أمروا بالوصية قال أوصى بكتاب الله‏.‏",
      "text_en": " Narrated Talha bin Musarrif:                     I asked `Abdullah bin Abu `Aufa \"Did the Prophet make a will?\" He replied, \"No,\" I asked him, \"How is it then that the making of a will has been enjoined on people, (or that they are ordered to make a will)?\" He replied, \"The Prophet bequeathed Allah's Book (i.e. Qur'an).",
      "usc_msa_ref": "3",
      "chain": [
        "20191",
        "20001",
        "11356",
        "5115"
      ]
    },
    {
      "id": "sahih-bukhari-3419",
      "hadith_no": "3419",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا خلاد بن يحيى، حدثنا مسعر، حدثنا حبيب بن أبي ثابت، عن أبي العباس، عن عبد الله بن عمرو بن العاص، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ ألم أنبأ أنك تقوم الليل وتصوم ‏\"‏‏.‏ فقلت نعم‏.‏ فقال ‏\"‏ فإنك إذا فعلت ذلك هجمت العين ونفهت النفس، صم من كل شهر ثلاثة أيام، فذلك صوم الدهر  أو كصوم الدهر ‏\"‏‏.‏ قلت إني أجد بي  قال مسعر يعني  قوة‏.‏ قال ‏\"‏ فصم صوم داود  عليه السلام  وكان يصوم يوما، ويفطر يوما، ولا يفر إذا لاقى ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr bin Al-As:                     The Prophet said to me, \"I have been informed that you pray all the nights and observe fast all the days; is this true?\" I replied, \"Yes.\" He said, \"If you do so, your eyes will become weak and you will get bored. So fast three days a month, for this will be the fasting of a whole year, or equal to the fasting of a whole year.\" I said, \"I find myself able to fast more.\" He said, \"Then fast like the fasting of (the Prophet) David who used to fast on alternate days and would not flee on facing the enemy.\"",
      "usc_msa_ref": "630",
      "chain": [
        "20191",
        "20359",
        "11331",
        "11246",
        "29"
      ]
    },
    {
      "id": "sahih-bukhari-4151",
      "hadith_no": "4151",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا خلاد بن يحيى، حدثنا عبد الواحد بن أيمن، عن أبيه، قال أتيت جابرا  رضى الله عنه  فقال إنا يوم الخندق نحفر فعرضت كدية شديدة، فجاءوا النبي صلى الله عليه وسلم فقالوا هذه كدية عرضت في الخندق، فقال ‏\"‏ أنا نازل ‏\"‏‏.‏ ثم قام وبطنه معصوب بحجر، ولبثنا ثلاثة أيام لا نذوق ذواقا، فأخذ النبي صلى الله عليه وسلم المعول فضرب، فعاد كثيبا أهيل أو أهيم، فقلت يا رسول الله ائذن لي إلى البيت‏.‏ فقلت لامرأتي رأيت بالنبي صلى الله عليه وسلم شيئا، ما كان في ذلك صبر، فعندك شىء قالت عندي شعير وعناق‏.‏ فذبحت العناق وطحنت الشعير، حتى جعلنا اللحم في البرمة، ثم جئت النبي صلى الله عليه وسلم والعجين قد انكسر، والبرمة بين الأثافي قد كادت أن تنضج فقلت طعيم لي، فقم أنت يا رسول الله ورجل أو رجلان‏.‏ قال ‏\"‏ كم هو ‏\"‏‏.‏ فذكرت له، قال ‏\"‏ كثير طيب ‏\"‏‏.‏ قال ‏\"‏ قل لها لا تنزع البرمة ولا الخبز من التنور حتى آتي ‏\"‏‏.‏ فقال ‏\"‏ قوموا ‏\"‏‏.‏ فقام المهاجرون والأنصار، فلما دخل على امرأته قال ويحك جاء النبي صلى الله عليه وسلم بالمهاجرين والأنصار ومن معهم‏.‏ قالت هل سألك قلت نعم‏.‏ فقال ‏\"‏ ادخلوا ولا تضاغطوا ‏\"‏‏.‏ فجعل يكسر الخبز ويجعل عليه اللحم، ويخمر البرمة والتنور إذا أخذ منه، ويقرب إلى أصحابه ثم ينزع، فلم يزل يكسر الخبز ويغرف حتى شبعوا وبقي بقية قال ‏\"‏ كلي هذا وأهدي، فإن الناس أصابتهم مجاعة ‏\"‏‏.‏",
      "text_en": " Narrated Jabir:                     We were digging (the trench) on the day of (Al-Khandaq ( i.e. Trench )) and we came across a big solid rock. We went to the Prophet and said, \"Here is a rock appearing across the trench.\" He said, \"I am coming down.\" Then he got up, and a stone was tied to his belly for we had not eaten anything for three days. So the Prophet took the spade and struck the big solid rock and it became like sand. I said, \"O Allah's Apostle! Allow me to go home.\" (When the Prophet allowed me) I said to my wife, \"I saw the Prophet in a state that I cannot treat lightly. Have you got something (for him to eat?\" She replied, \"I have barley and a she goat.\" So I slaughtered the she-kid and she ground the barley; then we put the meat in the earthenware cooking pot. Then I came to the Prophet when the dough had become soft and fermented and (the meat in) the pot over the stone trivet had nearly been well-cooked, and said, \"I have got a little food prepared, so get up O Allah's Apostle, you and one or two men along with you (for the food).\" The Prophet asked, \"How much is that food?\" I told him about it. He said, \"It is abundant and good. Tell your wife not to remove the earthenware pot from the fire and not to take out any bread from the oven till I reach there.\" Then he said (to all his companions), \"Get up.\" So the Muhajirn (i.e. Emigrants) and the Ansar got up. When I came to my wife, I said, \"Allah's Mercy be upon you! The Prophet came along with the Muhajirin and the Ansar and those who were present with them.\" She said, \"Did the Prophet ask you (how much food you had)?\" I replied, \"Yes.\" Then the Prophet said, \"Enter and do not throng.\" The Prophet started cutting the bread (into pieces) and put the cooked meat over it. He covered the earthenware pot and the oven whenever he took something out of them. He would give the food to his companions and take the meat out of the pot. He went on cutting the bread and scooping the meat (for his companions) till they all ate their fill, and even then, some food remained. Then the Prophet said (to my wife), \"Eat and present to others as the people are struck with hunger.\"",
      "usc_msa_ref": "427",
      "chain": [
        "20191",
        "11560",
        "11556"
      ]
    },
    {
      "id": "sahih-bukhari-5260",
      "hadith_no": "5260",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا خلاد بن يحيى، حدثنا إبراهيم بن نافع، عن الحسن  هو ابن مسلم  عن صفية، عن عائشة، أن امرأة، من الأنصار زوجت ابنتها فتمعط شعر رأسها، فجاءت إلى النبي صلى الله عليه وسلم فذكرت ذلك له، فقالت إن زوجها أمرني أن أصل في شعرها‏.‏ فقال ‏\"‏ لا إنه قد لعن الموصلات ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     An Ansari woman gave her daughter in marriage and the hair of the latter started falling out. The Ansari women came to the Prophet and mentioned that to him and said, \"Her (my daughter's) husband suggested that I should let her wear false hair.\" The Prophet said, \"No, (don't do that) for Allah sends His curses upon such ladies who lengthen their hair artificially.\"",
      "usc_msa_ref": "133",
      "chain": [
        "20191",
        "20189",
        "11557",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-5478",
      "hadith_no": "5478",
      "source": "Sahih Bukhari",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا خلاد بن يحيى، حدثنا سفيان، عن عبد الرحمن بن عابس، عن أبيه، قال قلت لعائشة أنهى النبي صلى الله عليه وسلم أن تؤكل لحوم الأضاحي فوق ثلاث قالت ما فعله إلا في عام جاع الناس فيه، فأراد أن يطعم الغني الفقير، وإن كنا لنرفع الكراع فنأكله بعد خمس عشرة‏.‏ قيل ما اضطركم إليه فضحكت قالت ما شبع آل محمد صلى الله عليه وسلم من خبز بر مأدوم ثلاثة أيام حتى لحق بالله‏.‏ وقال ابن كثير أخبرنا سفيان حدثنا عبد الرحمن بن عابس بهذا‏.‏",
      "text_en": " Narrated `Abis:                     I asked `Aisha \"Did the Prophet forbid eating the meat of sacrifices offered on `Id-ul-Adha for more than three days\" She said, \"The Prophet did not do this except in the year when the people were hungry, so he wanted the rich to feed the poor. But later we used to store even a trotter of a sheep to eat it fifteen days later.\" She was asked, \"What compelled you to do so?\" She smiled and said, \"The family of Muhammad did not eat to their satisfaction white bread with meat soup for three successive days till he met Allah.\"",
      "usc_msa_ref": "334",
      "chain": [
        "20191",
        "20012",
        "11638",
        "11357"
      ]
    },
    {
      "id": "sahih-bukhari-5568",
      "hadith_no": "5568",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا خلاد بن يحيى، حدثنا سفيان، عن هشام بن عروة، قال أخبرتني فاطمة بنت المنذر، امرأتي عن أسماء بنت أبي بكر  رضى الله عنهما  قالت نحرنا على عهد النبي صلى الله عليه وسلم فرسا فأكلناه‏.‏",
      "text_en": " Narrated Asma bint Abu Bakr:                     We slaughtered a horse (by Nahr) during the lifetime of the Prophet and ate it.",
      "usc_msa_ref": "418",
      "chain": [
        "20191",
        "20012",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "id": "sahih-bukhari-6344",
      "hadith_no": "6344",
      "source": "Sahih Bukhari",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا خلاد بن يحيى، حدثنا سفيان، عن عبيد الله، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم أنه نهى أن يقام الرجل من مجلسه ويجلس فيه آخر، ولكن تفسحوا وتوسعوا‏.‏ وكان ابن عمر يكره أن يقوم الرجل من مجلسه، ثم يجلس مكانه‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet forbade that a man should be made to get up from his seat so that another might sit on it, but one should make room and spread out. Ibn `Umar disliked that a man should get up from his seat and then somebody else sit at his place.",
      "usc_msa_ref": "287",
      "chain": [
        "20191",
        "20012",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-6549",
      "hadith_no": "6549",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا خلاد بن يحيى، حدثنا مسعر، حدثنا زياد بن علاقة، قال سمعت المغيرة بن شعبة، يقول كان النبي صلى الله عليه وسلم يصلي حتى ترم  أو تنتفخ  قدماه فيقال له، فيقول ‏\"‏ أفلا أكون عبدا شكورا ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     The Prophet used to pray so much that his feet used to become edematous or swollen, and when he was asked as to why he prays so much, he would say, \"Shall I not be a thankful slave (to Allah)?\"",
      "usc_msa_ref": "478",
      "chain": [
        "20191",
        "20359",
        "11339",
        "166"
      ]
    },
    {
      "id": "sahih-bukhari-6745",
      "hadith_no": "6745",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا خلاد بن يحيى، حدثنا مسعر، حدثنا قتادة، حدثنا زرارة بن أوفى، عن أبي هريرة، يرفعه قال ‏\"‏ إن الله تجاوز لأمتي عما وسوست أو حدثت به أنفسها، ما لم تعمل به أو تكلم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Allah forgives my followers those (evil deeds) their souls may whisper or suggest to them as long as they do not act (on it) or speak.\"",
      "usc_msa_ref": "657",
      "chain": [
        "20191",
        "20359",
        "11019",
        "11284"
      ]
    },
    {
      "id": "sahih-bukhari-6776",
      "hadith_no": "6776",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا خلاد بن يحيى، حدثنا سفيان، عن منصور، أخبرنا عبد الله بن مرة، عن عبد الله بن عمر، نهى النبي صلى الله عليه وسلم عن النذر وقال ‏\"‏ إنه لا يرد شيئا، ولكنه يستخرج به من البخيل ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Prophet forbade the making of vows and said, \"It (a vow) does not prevent anything (that has to take place), but the property of a miser is spent (taken out) with it.\"",
      "usc_msa_ref": "684",
      "chain": [
        "20191",
        "20012",
        "11067",
        "11362"
      ]
    },
    {
      "id": "sahih-bukhari-7007",
      "hadith_no": "7007",
      "source": "Sahih Bukhari",
      "chapter": "Dealing with Apostates - كتاب استتابة المرتدين والمعاندين وقتالهم",
      "chapter_no": "89",
      "text_ar": "حدثنا خلاد بن يحيى، حدثنا سفيان، عن منصور، والأعمش، عن أبي وائل، عن ابن مسعود  رضى الله عنه  قال قال رجل يا رسول الله أنؤاخذ بما عملنا في الجاهلية قال ‏\"‏ من أحسن في الإسلام لم يؤاخذ بما عمل في الجاهلية، ومن أساء في الإسلام أخذ بالأول والآخر ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Mas`ud:                     A man said, \"O Allah's Apostle! Shall we be punished for what we did in the Prelslamic Period of ignorance?\" The Prophet said, \"Whoever does good in Islam will not be punished for what he did in the Pre-lslamic Period of ignorance and whoever does evil in Islam will be punished for his former and later (bad deeds).",
      "usc_msa_ref": "56",
      "chain": [
        "20191",
        "20012",
        "11067",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-7510",
      "hadith_no": "7510",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا خلاد بن يحيى، حدثنا عيسى بن طهمان، قال سمعت أنس بن مالك  رضى الله عنه  يقول نزلت آية الحجاب في زينب بنت جحش وأطعم عليها يومئذ خبزا ولحما وكانت تفخر على نساء النبي صلى الله عليه وسلم وكانت تقول إن الله أنكحني في السماء‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Verse of Al-Hijab (veiling of women) was revealed in connection with Zainab bint Jahsh. (On the day of her marriage with him) the Prophet gave a wedding banquet with bread and meat; and she used to boast before other wives of the Prophet and used to say, \"Allah married me (to the Prophet in the Heavens.\"",
      "usc_msa_ref": "517",
      "chain": [
        "20191",
        "11607",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-7545",
      "hadith_no": "7545",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا خلاد بن يحيى، حدثنا عمر بن ذر، سمعت أبي يحدث، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  أن النبي صلى الله عليه وسلم قال ‏\"‏ يا جبريل ما يمنعك أن تزورنا أكثر مما تزورنا ‏\"‏‏.‏ فنزلت ‏{‏وما نتنزل إلا بأمر ربك له ما بين أيدينا وما خلفنا‏}‏ إلى آخر الآية‏.‏ قال هذا كان الجواب لمحمد صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"O Gabriel, what prevents you. from visiting us more often than you do?\" Then this Verse was revealed:--'And we angels descend not but by Command of your Lord. To Him belongs what is before us and what is behind us..' (19.64) So this was the answer to Muhammad.",
      "usc_msa_ref": "",
      "chain": [
        "20191",
        "11642",
        "11423",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-4305",
      "hadith_no": "4305",
      "source": "Sunan Abi Da'ud",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا جعفر بن مسافر التنيسي، حدثنا خلاد بن يحيى، حدثنا بشير بن المهاجر، حدثنا عبد الله بن بريدة، عن أبيه، عن النبي صلى الله عليه وسلم في حديث ‏\"‏ يقاتلكم قوم صغار الأعين ‏\"‏ ‏.‏ يعني الترك قال ‏\"‏ تسوقونهم ثلاث مرار حتى تلحقوهم بجزيرة العرب فأما في السياقة الأولى فينجو من هرب منهم وأما في الثانية فينجو بعض ويهلك بعض وأما في الثالثة فيصطلمون ‏\"‏ ‏.‏ أو كما قال ‏.‏",
      "text_en": " Buraidah said:                      In the tradition telling that people with small eyes, i.e. the Turks, will fight against you, the prophet (ﷺ) said: You will drive them off three times till you catch up with them in Arabia. On the first occasion when you drive them off those who fly will be safe, on the second occasion some will be safe and some will perish, but on the third occasion they will be extirpated, or he said words to that effect.",
      "usc_msa_ref": "",
      "chain": [
        "38132",
        "20191",
        "10747",
        "11432",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3110",
      "hadith_no": "3110",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Parables - كتاب الأمثال عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "44",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا خلاد بن يحيى، حدثنا بشير بن المهاجر، أخبرنا عبد الله بن بريدة، عن أبيه، قال قال النبي صلى الله عليه وسلم ‏\"‏ هل تدرون ما هذه وما هذه ‏\"‏ ‏.‏ ورمى بحصاتين ‏.‏ قالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ هذاك الأمل وهذاك الأجل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated 'Abdullah bin Buraidah:                     from his father that the Prophet (ﷺ) said: \"Do you know what the parable of this and this is?\" - and he tossed two pebbles. They said: \"Allah and His Messenger (ﷺ) know better.\" He said: \"This (the farther) one is hope, and this (closer) one is death.\"",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "20191",
        "10747",
        "11432",
        "3131"
      ]
    }
  ],
  "total_hadiths": 23
}