{
  "id": "20194",
  "name": "Suh'aib bin Harb شعيب بن حرب",
  "full_name": "Suh'aib bin Harb شعيب بن حرب",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "197",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Makkah",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Mada'in",
      "Baghdad",
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  د  س  -  ثقة ]"
    ],
    "tags": [
      "al-Mada'ini",
      "al-Baghdadi",
      "Makkah"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "10704",
      "name": "'Ikrama bin 'Ammar عكرمة بن عمار العجلي أبو عمار اليمامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20721",
      "name": "Aban bin 'Abdullah bin Abi Hazam أبان بن عبد الله بن أبي حازم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20429",
      "name": "Skhr bin Jwyryh Abu صخر بن جويرية أبو نافع مولى بني",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20358",
      "name": "Malik bin Mghwl مالك بن مغول",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30298",
      "name": "Ahmed bin Abi Sarayj أحمد بن أبي سريج",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36504",
      "name": "Ahmed bin Khalid al-Khlal أحمد بن خالد الخلال",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "35019",
      "name": "Ayoub bin Mnswr al-Kwfy أيوب بن منصور الكوفي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30400",
      "name": "Y'aqub bin Ibrahim bin Kathir يعقوب بن إبراهيم بن كثير بن زيد الدورقي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36596",
      "name": "'Ali bin Bhr bin Bry علي بن بحر بن بري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30526",
      "name": "Yahya bin Ayoub al-Maqabri يحيى بن أيوب المقابري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "31167",
      "name": "Muhammad bin 'Isa bin Hyan محمد بن عيسى بن حيان",
      "grade": "3rd Century AH"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "7105",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا يعقوب بن إبراهيم بن كثير، حدثنا شعيب بن حرب، حدثنا صخر بن جويرية، حدثنا نافع، أن ابن عمر  رضى الله عنهما  حدثه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ بينا أنا على بئر أنزع منها إذ جاء أبو بكر وعمر، فأخذ أبو بكر الدلو، فنزع ذنوبا أو ذنوبين، وفي نزعه ضعف، فغفر الله له، ثم أخذها ابن الخطاب من يد أبي بكر فاستحالت في يده غربا، فلم أر عبقريا من الناس يفري فريه، حتى ضرب الناس بعطن ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"(I saw in a dream that) while I was standing at a well and drawing water therefrom, suddenly Abu Bakr and `Umar came to me. Abu Bakr took the bucket and drew one or two buckets (full of water), but there was weakness in his pulling, but Allah forgave him. Then Ibn Al- Khattab took the bucket from Abu Bakr's hand and the bucket turned into a very large one in his hand. I have never seen any strong man among the people doing such a hard job as `Umar did, till (the people drank to their satisfaction) and water their camels to their fill and they sat near the water.\"",
      "chain": [
        "20184",
        "20194",
        "20429",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "533",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أيوب بن منصور، حدثنا شعيب بن حرب، عن عبد العزيز بن أبي رواد، أخبرنا نافع، عن مؤذن، لعمر يقال له مسروح أذن قبل الصبح فأمره عمر فذكر نحوه ‏.‏ قال أبو داود وقد رواه حماد بن زيد عن عبيد الله بن عمر عن نافع أو غيره أن مؤذنا لعمر يقال له مسروح أو غيره ‏.‏ قال أبو داود ورواه الدراوردي عن عبيد الله عن نافع عن ابن عمر قال كان لعمر مؤذن يقال له مسعود وذكر نحوه وهذا أصح من ذلك ‏.‏",
      "text_en": " Nafi' reported :                      A mu'adhdhin of ‘Umar, named Masruh, called the Adhan for the morning prayer before the break of dawn; ‘Umar commanded him (to repeat). The narrator reported the tradition in a similar way.Abu Dawud said: This tradition has been transmitted by al-Darawardi from ‘Ubaid Allah on the authority of Ibn ‘Umar, saying: there was a  mu'adhdhin of ‘Umar, named Mas’ud. He then narrated the rest of the tradition. This version is more correct than one.",
      "chain": [
        "35019",
        "20194",
        "20739",
        "11014",
        "20022",
        "11201"
      ]
    },
    {
      "hadith_no": "51",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا أحمد بن الصباح، قال حدثنا شعيب، - يعني ابن حرب - قال حدثنا أبان بن عبد الله البجلي، قال حدثنا إبراهيم بن جرير، عن أبيه، قال كنت مع النبي صلى الله عليه وسلم فأتى الخلاء فقضى الحاجة ثم قال ‏\"‏ يا جرير هات طهورا ‏\"‏ ‏.‏ فأتيته بالماء فاستنجى بالماء وقال بيده فدلك بها الأرض ‏.‏ قال أبو عبد الرحمن هذا أشبه بالصواب من حديث شريك والله سبحانه وتعالى أعلم ‏.‏",
      "text_en": " Ibrahim bin Jarir narrated that his father said:                      \"I was with the Prophet (ﷺ) and he went to Al Khala' (toilet) and relieved himself, then he said: \"O Jarir, bring Tahur (a means of purification).\" So I brought him some water and he performed Intinja' with water, and did like this with hand, rubbing it on the ground. Abu 'Abdur-Rahman (An-Nasa'i) said: \"This resembles more with what is correct than the (previous) narration of Sharik, and Allah knows best.\"",
      "chain": [
        "20194",
        "20721",
        "18002"
      ]
    },
    {
      "hadith_no": "1737",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن محمد بن عبيد الله، قال حدثنا شعيب بن حرب، عن مالك، عن زبيد، عن ابن أبزى، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يقرأ في الوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ ‏.‏",
      "text_en": " Shu'aib bin Harb reported from Malik, from Zubaid, from Ibn Abza, from his father, who said:                     \"The Messenger of Allah (ﷺ) used to recite in witr: Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.'\"",
      "chain": [
        "30304",
        "20194",
        "20001",
        "11335"
      ]
    },
    {
      "hadith_no": "5569",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرني أحمد بن خالد، قال حدثنا شعيب بن حرب، قال حدثنا إسماعيل بن مسلم، قال حدثنا أبو المتوكل الناجي، قال حدثني أبو سعيد الخدري، أن النبي صلى الله عليه وسلم نهى أن يخلط بسرا بتمر أو زبيبا بتمر أو زبيبا ببسر وقال ‏\"‏ من شرب منكم فليشرب كل واحد منه فردا ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذا أبو المتوكل اسمه علي بن داود ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated that:                     The Prophet [SAW] forbade mixing Al-Busr with dried dates, or raisins with dried dates, or raisins with Al-Busr, and he said: \"Whoever among you (wants to) drink them, let him drink each one on its own.\"",
      "chain": [
        "20194",
        "22025",
        "11297",
        "38"
      ]
    }
  ],
  "total_hadiths": 5
}