{
  "id": "20196",
  "name": "'Abdul Malik bin Ibrahim al-Jaddi عبد الملك بن إبراهيم الجدي",
  "full_name": "'Abdul Malik bin Ibrahim al-Jaddi عبد الملك بن إبراهيم الجدي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "205",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  د  ت  س  -  صدوق ]"
    ],
    "tags": [
      "Ally B.'Abd al-Dar",
      "Client",
      "al-Makki",
      "Hijazi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20187",
      "name": "Ibrahim bin Tahman إبراهيم بن طهمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "22066",
      "name": "Sa'id bin Khalid al-Khza'y سعيد بن خالد الخزاعي المدني",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "22199",
      "name": "Muhammad bin Muhammad bin Naf' محمد بن محمد بن نافع الطائفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20441",
      "name": "'Abdur Rahman bin Abi al-Mawal عبد الرحمن بن أبي الموال",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20303",
      "name": "Yazid bin Ibrahim al-Tstry يزيد بن إبراهيم التستري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20297",
      "name": "Hmam bin Yahya bin Dinar همام بن يحيى بن دينار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30418",
      "name": "'Abdullah bin al-Zubair bin 'Isa عبد الله بن الزبير بن عيسى الحميدي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30353",
      "name": "'Abdullah bin Muneer عبد الله بن منير أبو عبد الرحمن المروزي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30115",
      "name": "al-Hasan bin 'Ali al-Halwani الحسن بن علي الخلال الحلواني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30277",
      "name": "Mahmud bin Ghaylan محمود بن غيلان العدوي مولاهم أبو أحمد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38247",
      "name": "Sulaiman bin Syf bin Yahya سليمان بن سيف بن يحيى",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38088",
      "name": "Ibrahim bin Y'aqub bin Ishaq إبراهيم بن يعقوب بن إسحاق",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38391",
      "name": "'Ali bin al-Hasan bin Abi 'Isa علي بن الحسن بن أبي عيسى الدرابجردي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30292",
      "name": "Ahmed bin al-Hasan bin Junaydab أحمد بن الحسن بن جنيدب",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30417",
      "name": "Salmah bin Shbyb سلمة بن شبيب",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "31683",
      "name": "Muhammad bin al-Fdyl bin Ayad محمد بن الفضيل بن عياض",
      "grade": "3rd Century AH"
    },
    {
      "id": "38001",
      "name": "Ahmed bin al-Azhar bin Mny' أحمد بن الأزهر بن منيع",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36514",
      "name": "Ahmed bin Mansur al-Ramadi أحمد بن منصور الرمادي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30389",
      "name": "Mhmwd bin Aadm محمود بن آدم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "31003",
      "name": "Ahmed bin Shyban al-Rmly Abu أحمد بن شيبان الرملي",
      "grade": "3rd Century AH"
    }
  ],
  "hadiths": [
    {
      "id": "sunan-abi-daud-5210",
      "hadith_no": "5210",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا الحسن بن علي، حدثنا عبد الملك بن إبراهيم الجدي، حدثنا سعيد بن خالد الخزاعي، قال حدثني عبد الله بن المفضل، حدثنا عبيد الله بن أبي رافع، عن علي بن أبي طالب، رضى الله عنه - قال أبو داود رفعه الحسن بن علي - قال ‏\"‏ يجزئ عن الجماعة، إذا مروا أن يسلم، أحدهم ويجزئ عن الجلوس أن يرد أحدهم ‏\"‏ ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     AbuDawud said: Al-Hasan ibn Ali traced this tradition back to the Prophet (ﷺ): When people are passing by, it is enough if one of them gives a salutation on their behalf, and that it is enough for those who are sitting if one of them replies.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20196",
        "22066",
        "11199",
        "5"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3563",
      "hadith_no": "3563",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا عبد الملك بن إبراهيم الجدي، حدثنا شعبة، عن الأعمش، ومنصور، سمعا أبا الضحى، يحدث عن مسروق، قال جاء رجل إلى عبد الله فقال إن قاصا يقص يقول إنه يخرج من الأرض الدخان فيأخذ بمسامع الكفار ويأخذ المؤمن كهيئة الزكام قال فغضب وكان متكئا فجلس ثم قال إذا سئل أحدكم عما يعلم فليقل به قال منصور فليخبر به وإذا سئل عما لا يعلم فليقل الله أعلم فإن من علم الرجل إذا سئل عما لا يعلم أن يقول الله أعلم فإن الله تعالى قال لنبيه ‏:‏ ‏(‏قل ما أسألكم عليه من أجر وما أنا من المتكلفين ‏)‏ ‏\"‏ ‏.‏ إن رسول الله صلى الله عليه وسلم لما رأى قريشا استعصوا عليه قال ‏\"‏ اللهم أعني عليهم بسبع كسبع يوسف ‏\"‏ ‏.‏ فأخذتهم سنة فأحصت كل شيء حتى أكلوا الجلود والميتة وقال أحدهما العظام قال وجعل يخرج من الأرض كهيئة الدخان قال فأتاه أبو سفيان قال إن قومك قد هلكوا فادع الله لهم ‏.‏ قال فهذا لقوله ‏:‏ ‏(‏ يوم تأتي السماء بدخان مبين * يغشى الناس هذا عذاب أليم ‏)‏ ‏.‏ قال منصور هذا لقوله ‏(‏ ربنا اكشف عنا العذاب إنا مؤمنون ‏)‏ فهل يكشف عذاب الآخرة قال مضى البطشة واللزام الدخان وقال أحدهما القمر وقال الآخر الروم ‏.‏ قال أبو عيسى واللزام يعني يوم بدر ‏.‏ قال وهذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Masruq:                     \"A man came to 'Abdullah and said: 'A story teller has said that a smoke will appear from the earth, taking the hearing of disbelievers and manifesting as a cold for the believers.'\" He became angry, and since he was reclining, he sat up then said: 'When one of you is asked about something he knows, then let him speak accordingly' - Mansur (one of the narrators) narrated it as: \"Then let him inform of it\" - \"And when asked about what he does not know, then let him say: \"Allah knows best.\" For indeed, it is part of a man's knowledge, that when he is asked about something he does not know, he says: \"Allah knows best.\" For verily Allah, Most High said to His Prophet: Say: \"No wage do I ask of you for this, nor am I one of the pretenders (38:86).\" When the Messenger of Allah (ﷺ) saw that the Quraish were behaving stubbornly with him, he said: \"O Allah! Assist me against them with seven (years of famine) like the seven of Yusuf.\" So He punished them with drought making everything barren, until they ate skins and carcasses\" - one of them said: \"bones.\" He said: 'And it appeared that smoke was coming out of the earth. So Abu Sufyan came to him and said: \"Verily your people are being destroyed, so supplicate to Allah for them.\" He said: \"So this is about His saying: 'The Day when the sky will bring forth a visible smoke, covering the people, this is a painful torment (44:10 & 11).'\" Mansur narrated it as: \"So this is about His saying: Our Lord! Remove the torment from us, really we shall become believers (44:12).\" - \"So shall the punishment be removed from them in the Hereafter? Al-Batshah (humiliated defeat in Badr), Al-Lizam (disbeliever captives from Badr), the smoke,\" - one of them said: \"The moon\" the other said: \"The Romans have all passed.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20196",
        "20020",
        "11060",
        "11067",
        "11392",
        "11018"
      ]
    }
  ],
  "total_hadiths": 2
}