{
  "id": "20193",
  "name": "Sulaiman bin Harb سليمان بن حرب",
  "full_name": "Sulaiman bin Harb سليمان بن حرب",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "144",
      "date_gregorian": "NA",
      "date_display": [
        "144 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "224",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra",
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Qadhi(Judge)"
    ],
    "tags": [
      "al-Azdi",
      "al-Washshi",
      "Judge",
      "al-Basri",
      "Makkah"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20604",
      "name": "Muhammad bin Talha bin Masraf محمد بن طلحة بن مصرف",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20299",
      "name": "Wahayb bin Khalid bin 'Ajlan al-Bahli وهيب بن خالد بن عجلان الباهلي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "24105",
      "name": "Hushab bin 'Aqil al-Jarmi حوشب بن عقيل الجرمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20303",
      "name": "Yazid bin Ibrahim al-Tstry يزيد بن إبراهيم التستري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20550",
      "name": "Salam bin Abi Mut'ia سلام بن أبي مطيع",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "24031",
      "name": "Bstam bin Hryth بسطام بن حريث",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "35010",
      "name": "Ibrahim bin Abi Bakr bin Muhammad إبراهيم بن أبي بكر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30545",
      "name": "Sulaiman bin Ma'bd bin Kwsjan سليمان بن معبد بن كوسجان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30296",
      "name": "Ahmed bin Sa'id bin Sakhar أحمد بن سعيد بن صخر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30115",
      "name": "al-Hasan bin 'Ali al-Halwani الحسن بن علي الخلال الحلواني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "20264",
      "name": "'Ali bin Nasr bin 'Ali al-Jahdami Older علي بن نصر بن علي الجهضمي الكبير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30153",
      "name": "'Amr bin 'Ali bin Bahr al-Bahli عمرو بن علي بن بحر الباهلي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30494",
      "name": "Ahmed bin Ibrahim bin Kathir أحمد بن إبراهيم بن كثير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30524",
      "name": "Harun bin 'Abdullah al-Hamal هارون بن عبد الله بن مروان الحمال",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38088",
      "name": "Ibrahim bin Y'aqub bin Ishaq إبراهيم بن يعقوب بن إسحاق",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "34044",
      "name": "al-Jrah bin Mkhld al-Jly الجراح بن مخلد العجلي البصري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38178",
      "name": "al-Husain bin Muhammad bin Ja'far الحسين بن محمد بن جعفر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30025",
      "name": "'Abdullah bin 'Abdur Rahman al-Daarimi عبد الله بن عبد الرحمن الدارمي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38433",
      "name": "'Amr bin Mnswr al-Nsa'iy عمرو بن منصور النسائي أبو سعيد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38719",
      "name": "Y'aqub bin Sufyan يعقوب بن سفيان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30418",
      "name": "'Abdullah bin al-Zubair bin 'Isa عبد الله بن الزبير بن عيسى الحميدي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30008",
      "name": "Ibn Sa'd محمد بن سعد البغدادي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30224",
      "name": "Yusuf bin Musa bin Rashid al-Qatan يوسف بن موسى بن راشد القطان",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30203",
      "name": "'Uthman bin Muhammad عثمان بن محمد بن إبراهيم / بن أبي شيبة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "21",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن قتادة، عن أنس  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاث من كن فيه وجد حلاوة الإيمان من كان الله ورسوله أحب إليه مما سواهما، ومن أحب عبدا لا يحبه إلا لله، ومن يكره أن يعود في الكفر بعد إذ أنقذه الله، كما يكره أن يلقى في النار ‏\"‏‏.‏",
      "text_en": "      Narrated Anas:                          The Prophet said, \"Whoever possesses the following three qualities      will taste the sweetness of faith:     1. The one to whom Allah and His Apostle become dearer than anything      else.     2. Who loves a person and he loves him only for Allah's sake.     3. Who hates to revert to disbelief (Atheism) after Allah has brought      (saved) him out from it, as he hates to be thrown in fire.\"",
      "chain": [
        "20193",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "30",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن واصل الأحدب، عن المعرور، قال لقيت أبا ذر بالربذة، وعليه حلة، وعلى غلامه حلة، فسألته عن ذلك، فقال إني ساببت رجلا، فعيرته بأمه، فقال لي النبي صلى الله عليه وسلم ‏\"‏ يا أبا ذر أعيرته بأمه إنك امرؤ فيك جاهلية، إخوانكم خولكم، جعلهم الله تحت أيديكم، فمن كان أخوه تحت يده فليطعمه مما يأكل، وليلبسه مما يلبس، ولا تكلفوهم ما يغلبهم، فإن كلفتموهم فأعينوهم ‏\"‏‏.‏",
      "text_en": "      Narrated Al-Ma'rur:                          At Ar-Rabadha I met Abu Dhar who was wearing a cloak, and his slave,      too, was wearing a similar one. I asked about the reason for it. He      replied, \"I abused a person by calling his mother with bad names.\" The     Prophet said to me, 'O Abu Dhar! Did you abuse him by calling his      mother with bad names You still have some characteristics of      ignorance. Your slaves are your brothers and Allah has put them under      your command. So whoever has a brother under his command should feed      him of what he eats and dress him of what he wears. Do not ask them      (slaves) to do things beyond their capacity (power) and if you do so,      then help them.' \"",
      "chain": [
        "20193",
        "20020",
        "11401",
        "11397"
      ]
    },
    {
      "hadith_no": "98",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن أيوب، قال سمعت عطاء، قال سمعت ابن عباس، قال أشهد على النبي صلى الله عليه وسلم  أو قال عطاء أشهد على ابن عباس  أن رسول الله صلى الله عليه وسلم خرج ومعه بلال، فظن أنه لم يسمع النساء فوعظهن، وأمرهن بالصدقة، فجعلت المرأة تلقي القرط والخاتم، وبلال يأخذ في طرف ثوبه‏.‏وقال إسماعيل عن أيوب عن عطاء وقال عن ابن عباس أشهد على النبي صلى الله عليه وسلم‏.‏",
      "text_en": "      Narrated Ibn 'Abbas:                          Once Allah's Apostle came out while Bilal was accompanying him. He      went towards the women thinking that they had not heard him (i.e. his      sermon). So he preached them and ordered them to pay alms. (Hearing      that) the women started giving alms; some donated their ear-rings,      some gave their rings and Bilal was collecting them in the corner of      his garment.",
      "chain": [
        "20193",
        "20020",
        "11015",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "151",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن أبي معاذ  هو عطاء بن أبي ميمونة  قال سمعت أنسا، يقول كان رسول الله صلى الله عليه وسلم إذا خرج لحاجته تبعته أنا وغلام منا معنا إداوة من ماء‏.‏",
      "text_en": " Narrated Anas:                     Whenever Allah's Apostle went to answer the call of nature, I along with another boy from us used to go behind him with a tumbler full of water.",
      "chain": [
        "20193",
        "20020",
        "11601",
        "19"
      ]
    },
    {
      "hadith_no": "192",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا وهيب، قال حدثنا عمرو بن يحيى، عن أبيه، قال شهدت عمرو بن أبي حسن سأل عبد الله بن زيد عن وضوء النبي، صلى الله عليه وسلم فدعا بتور من ماء، فتوضأ لهم، فكفأ على يديه فغسلهما ثلاثا، ثم أدخل يده في الإناء، فمضمض واستنشق، واستنثر ثلاثا بثلاث غرفات من ماء، ثم أدخل يده في الإناء، فغسل وجهه ثلاثا، ثم أدخل يده في الإناء، فغسل يديه إلى المرفقين مرتين مرتين، ثم أدخل يده في الإناء، فمسح برأسه فأقبل بيديه وأدبر بهما، ثم أدخل يده في الإناء فغسل رجليه‏.‏ وحدثنا موسى قال حدثنا وهيب قال مسح رأسه مرة‏.‏",
      "text_en": " Narrated `Amr bin Yahya:                     My father said, \"I saw `Amr bin Abi Hasan asking `Abdullah bin Zaid about the ablution of the Prophet. `Abdullah bin Zaid asked for an earthenware pot containing water and performed ablution in front of them. He poured water over his hands and washed them thrice. Then he put his (right) hand in the pot and rinsed his mouth and washed his nose by putting water in it and then blowing it out thrice with three handfuls of water Again he put his hand in the water and washed his face thrice. After that he put his hand in the pot and washed his forearms up to the elbows twice and then again put his hand in the water and passed wet hands over his head by bringing them to the front and then to the back and once more he put his hand in the pot and washed his feet (up to the ankles.)\"Narrated Wuhaib:That he (the Prophet in narration 191 above) had passed his wet hands on the head once only.",
      "chain": [
        "20193",
        "20299",
        "11210",
        "11232",
        "605"
      ]
    },
    {
      "hadith_no": "233",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن أنس، قال قدم أناس من عكل أو عرينة، فاجتووا المدينة، فأمرهم النبي صلى الله عليه وسلم بلقاح، وأن يشربوا من أبوالها وألبانها، فانطلقوا، فلما صحوا قتلوا راعي النبي صلى الله عليه وسلم واستاقوا النعم، فجاء الخبر في أول النهار، فبعث في آثارهم، فلما ارتفع النهار جيء بهم، فأمر فقطع أيديهم وأرجلهم، وسمرت أعينهم، وألقوا في الحرة يستسقون فلا يسقون‏.‏ قال أبو قلابة فهؤلاء سرقوا وقتلوا وكفروا بعد إيمانهم، وحاربوا الله ورسوله‏.‏",
      "text_en": " Narrated Abu Qilaba:                     Anas said, \"Some people of `Ukl or `Uraina tribe came to Medina and its climate did not suit them. So the Prophet ordered them to go to the herd of (Milch) camels and to drink their milk and urine (as a medicine). So they went as directed and after they became healthy, they killed the shepherd of the Prophet and drove away all the camels. The news reached the Prophet early in the morning and he sent (men) in their pursuit and they were captured and brought at noon. He then ordered to cut their hands and feet (and it was done), and their eyes were branded with heated pieces of iron, They were put in 'Al-Harra' and when they asked for water, no water was given to them.\" Abu Qilaba said, \"Those people committed theft and murder, became infidels after embracing Islam and fought against Allah and His Apostle .\"",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "340",
      "source": " Sahih Bukhari ",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن الحكم، عن ذر، عن ابن عبد الرحمن بن أبزى، عن أبيه، أنه شهد عمر وقال له عمار كنا في سرية فأجنبنا، وقال تفل فيهما‏.‏",
      "text_en": " Narrated `Abdur Rahman bin Abza:                     that while he was in the company of `Umar, `Ammar said to `Umar, \"We were in a detachment and became Junub and I blew the dust off my hands (performed the rolling over the earth and prayed.)\"",
      "chain": [
        "20193",
        "20020",
        "11069",
        "11423",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "365",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، عن محمد، عن أبي هريرة، قال قام رجل إلى النبي صلى الله عليه وسلم فسأله عن الصلاة في الثوب الواحد فقال ‏\"‏ أوكلكم يجد ثوبين ‏\"‏‏.‏ ثم سأل رجل عمر فقال إذا وسع الله فأوسعوا، جمع رجل عليه ثيابه، صلى رجل في إزار ورداء، في إزار وقميص، في إزار وقباء، في سراويل ورداء، في سراويل وقميص، في سراويل وقباء، في تبان وقباء، في تبان وقميص  قال وأحسبه قال  في تبان ورداء‏.‏",
      "text_en": " Narrated Abu Huraira:                     A man stood up and asked the Prophet about praying in a single garment. The Prophet said, \"Has every one of you two garments?\" A man put a similar question to `Umar on which he replied, \"When Allah makes you wealthier then you should clothe yourself properly during prayers. Otherwise one can pray with an Izar and a Rida' (a sheet covering the upper part of the body.) Izar and a shirt, Izar and a Qaba', trousers and a Rida, trousers and a shirt or trousers and a Qaba', Tubban and a Qaba' or Tubban and a shirt.\" (The narrator added, \"I think that he also said a Tubban and a Rida. \")",
      "chain": [
        "20193",
        "20022",
        "11015",
        "20278",
        "13"
      ]
    },
    {
      "hadith_no": "426",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن الأشعث بن سليم، عن أبيه، عن مسروق، عن عائشة، قالت كان النبي صلى الله عليه وسلم يحب التيمن ما استطاع في شأنه كله في طهوره وترجله وتنعله‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to start every thing from the right (for good things) whenever it was possible in all his affairs; for example: in washing, combing or wearing shoes.",
      "chain": [
        "20193",
        "20020",
        "11324",
        "11351",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "429",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن أبي التياح، عن أنس، قال كان النبي صلى الله عليه وسلم يصلي في مرابض الغنم، ثم سمعته بعد يقول كان يصلي في مرابض الغنم قبل أن يبنى المسجد‏.‏",
      "text_en": " Narrated Abu Al-Taiyah [??]:                     Anas said, \"The Prophet prayed in the sheep fold.\" Later on I heard him saying, \"He prayed in the sheep folds before the construction of the, mosque.\"",
      "chain": [
        "20193",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "458",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن ثابت، عن أبي رافع، عن أبي هريرة، أن رجلا، أسود  أو امرأة سوداء  كان يقم المسجد، فمات، فسأل النبي صلى الله عليه وسلم عنه فقالوا مات‏.‏ قال ‏\"‏ أفلا كنتم آذنتموني به دلوني على قبره ‏\"‏‏.‏  أو قال قبرها  فأتى قبره فصلى عليه‏.‏",
      "text_en": " Narrated Abu Huraira:                     A black man or a black woman used to sweep the mosque and he or she died. The Prophet asked about her (or him). He was told that she (or he) had died. He said, \"Why did you not inform me? Show me his grave (or her grave).\" So he went to her (his) grave and offered her (his) funeral prayer.\"",
      "chain": [
        "20193",
        "20022",
        "11269",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "501",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن الحكم، عن أبي جحيفة، قال خرج رسول الله صلى الله عليه وسلم بالهاجرة فصلى بالبطحاء الظهر والعصر ركعتين، ونصب بين يديه عنزة، وتوضأ، فجعل الناس يتمسحون بوضوئه‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     Allah's Apostle came out at midday and offered a two-rak`at Zuhr and `Asr prayers at Al-Batha and a short spear (or stick) was planted in front of him (as a Sutra). He performed ablution and the people took the remaining water left after his ablution and rubbed their bodies with it.",
      "chain": [
        "20193",
        "20020",
        "11069",
        "4047"
      ]
    },
    {
      "hadith_no": "605",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن سماك بن عطية، عن أيوب، عن أبي قلابة، عن أنس، قال أمر بلال أن يشفع، الأذان وأن يوتر الإقامة إلا الإقامة‏.‏",
      "text_en": " Narrated Anas:                     Bilal was ordered to repeat the wording of the Adhan for prayers twice, and to pronounce the wording of the Iqama once except \"Qad-qamat-is-salat\".",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "685",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن مالك بن الحويرث، قال قدمنا على النبي صلى الله عليه وسلم ونحن شببة، فلبثنا عنده نحوا من عشرين ليلة، وكان النبي صلى الله عليه وسلم رحيما فقال ‏\"‏ لو رجعتم إلى بلادكم فعلمتموهم، مروهم فليصلوا صلاة كذا في حين كذا، وصلاة كذا في حين كذا، وإذا حضرت الصلاة فليؤذن لكم أحدكم، وليؤمكم أكبركم ‏\"‏‏.‏",
      "text_en": " Narrated Malik bin Huwairith:                     We went to the Prophet and we were all young men and stayed with him for about twenty nights. The Prophet was very merciful. He said, \"When you return home, impart religious teachings to your families and tell them to offer perfectly such and such a prayer at such and such a time and such and such a prayer at such and such a time. And al the time of the prayer one of you should pronounce the Adhan and the oldest of you should lead the prayer.\"",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "697",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن الحكم، قال سمعت سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال بت في بيت خالتي ميمونة فصلى رسول الله صلى الله عليه وسلم العشاء، ثم جاء فصلى أربع ركعات ثم نام، ثم قام فجئت فقمت عن يساره، فجعلني عن يمينه، فصلى خمس ركعات، ثم صلى ركعتين، ثم نام حتى سمعت غطيطه  أو قال خطيطه  ثم خرج إلى الصلاة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Once I passed the night in the house of my aunt Maimuna. Allah's Apostle offered the `Isha' prayer and then came to the house and offered four rak`at an slept. Later on, he woke up and stood for the prayer and I stood on his left side. He drew me to his right and prayed five rak`at and then two. He then slept till I heard him snoring (or heard his breath sounds). Afterwards he went out for the morning prayer.",
      "chain": [
        "20193",
        "20020",
        "11069",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "711",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، وأبو النعمان، قالا حدثنا حماد بن زيد، عن أيوب، عن عمرو بن دينار، عن جابر، قال كان معاذ يصلي مع النبي صلى الله عليه وسلم ثم يأتي قومه فيصلي بهم‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Mu`adh used to pray with the Prophet and then go and lead his people (tribe) in the prayer.",
      "chain": [
        "20193",
        "20283",
        "20022",
        "11015",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "770",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن أبي عون، قال سمعت جابر بن سمرة، قال قال عمر لسعد لقد شكوك في كل شىء حتى الصلاة‏.‏ قال أما أنا فأمد في الأوليين، وأحذف في الأخريين، ولا آلو ما اقتديت به من صلاة رسول الله صلى الله عليه وسلم‏.‏ قال صدقت، ذاك الظن بك، أو ظني بك‏.‏",
      "text_en": " Narrated Jabir bin Samura:                     `Umar said to Sa`d, \"The people complained against you in everything, even in prayer.\" Sa`d replied, \"Really I used to prolong the first two rak`at and shorten the last two and I will never shorten the prayer in which I follow Allah's Apostle.\" `Umar said, \"You are telling the truth and that is what I think a tout you.\"",
      "chain": [
        "20193",
        "20020",
        "11649",
        "393"
      ]
    },
    {
      "hadith_no": "802",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، قال كان مالك بن الحويرث يرينا كيف كان صلاة النبي صلى الله عليه وسلم وذاك في غير وقت صلاة، فقام فأمكن القيام، ثم ركع فأمكن الركوع، ثم رفع رأسه فأنصت هنية، قال فصلى بنا صلاة شيخنا هذا أبي بريد‏.‏ وكان أبو بريد إذا رفع رأسه من السجدة الآخرة استوى قاعدا ثم نهض‏.‏",
      "text_en": " Narrated Aiyub:                     Abu Qilaba said, \"Malik bin Huwairith used to demonstrate to us the prayer of the Prophet at times other than that of the compulsory prayers. So (once) he stood up for prayer and performed a perfect Qiyam (standing and reciting from the Holy Qur'an) and then bowed and performed bowing perfectly; then he raised his head and stood straight for a while.\" Abu Qilaba added, \"Malik bin Huwairith in that demonstration prayed like this Sheikh of ours, Abu Yazid.\" Abu, Yazid used to sit (for a while) on raising his head from the second prostration before getting up.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "821",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن ثابت، عن أنس  رضى الله عنه  قال إني لا آلو أن أصلي بكم كما رأيت النبي صلى الله عليه وسلم يصلي بنا‏.‏ قال ثابت كان أنس يصنع شيئا لم أركم تصنعونه، كان إذا رفع رأسه من الركوع قام حتى يقول القائل قد نسي‏.‏ وبين السجدتين حتى يقول القائل قد نسي‏.‏",
      "text_en": " Narrated Thabit:                     Anas said, \"I will leave no stone unturned in making you offer the prayer as I have seen the Prophet making us offer it.\" Anas used to do a thing which I have not seen you doing. He used to stand after the bowing for such a long time that one would think that he had forgotten (the prostrations) and he used to sit in-between the prostrations so long that one would think that he had forgotten the second prostration.",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "826",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، قال حدثنا غيلان بن جرير، عن مطرف، قال صليت أنا وعمران، صلاة خلف علي بن أبي طالب  رضى الله عنه  فكان إذا سجد كبر، وإذا رفع كبر، وإذا نهض من الركعتين كبر، فلما سلم أخذ عمران بيدي فقال لقد صلى بنا هذا صلاة محمد صلى الله عليه وسلم‏.‏ أو قال لقد ذكرني هذا صلاة محمد صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Mutarrif:                     `Imran and I prayed behind `Ali bin Abi Talib and he said Takbir on prostrating, on rising and on getting up after the two rak`at (i.e. after the second rak`a). When the prayer was finished, `Imran took me by the hand and said, \"He (`Ali) has prayed the prayer of Muhammad\" (or said, \"He made us remember the prayer of Muhammad).",
      "chain": [
        "20193",
        "20022",
        "11300",
        "11395"
      ]
    },
    {
      "hadith_no": "964",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن عدي بن ثابت، عن سعيد بن جبير، عن ابن عباس، أن النبي صلى الله عليه وسلم صلى يوم الفطر ركعتين، لم يصل قبلها ولا بعدها، ثم أتى النساء ومعه بلال، فأمرهن بالصدقة، فجعلن يلقين، تلقي المرأة خرصها وسخابها‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet offered a two rak`at prayer on the Day of Id ul Fitr and he did not pray before or after it. Then he went towards women along with Bilal and ordered them to pay alms and so they started giving their earrings and necklaces (in charity).",
      "chain": [
        "20193",
        "20020",
        "11372",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "968",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن زبيد، عن الشعبي، عن البراء، قال خطبنا النبي صلى الله عليه وسلم يوم النحر قال ‏\"‏ إن أول ما نبدأ به في يومنا هذا أن نصلي ثم نرجع فننحر، فمن فعل ذلك فقد أصاب سنتنا، ومن ذبح قبل أن يصلي فإنما هو لحم عجله لأهله، ليس من النسك في شىء ‏\"‏‏.‏ فقام خالي أبو بردة بن نيار فقال يا رسول الله، أنا ذبحت قبل أن أصلي وعندي جذعة خير من مسنة‏.‏ قال ‏\"‏ اجعلها مكانها  أو قال اذبحها  ولن تجزي جذعة عن أحد بعدك ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara':                     The Prophet delivered the Khutba on the day of Nahr (`Id-ul-Adha) and said, \"The first thing we should do on this day of ours is to pray and then return and slaughter (our sacrifices). So anyone who does so he acted according to our Sunna; and whoever slaughtered before the prayer then it was just meat that he offered to his family and would not be considered as a sacrifice in any way. My uncle Abu Burda bin Niyyar got up and said, \"O, Allah's Apostle! I slaughtered the sacrifice before the prayer but I have a young she-goat which is better than an older sheep.\" The Prophet said, \"Slaughter it in lieu of the first and such a goat will not be considered as a sacrifice for anybody else after you.\"",
      "chain": [
        "20193",
        "20020",
        "11335",
        "11052",
        "400"
      ]
    },
    {
      "hadith_no": "1069",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا سليمان بن حرب، وأبو النعمان، قالا حدثنا حماد، عن أيوب، عن عكرمة، عن ابن عباس  رضى الله عنهما  قال ‏{‏ص‏}‏ ليس من عزائم السجود، وقد رأيت النبي صلى الله عليه وسلم يسجد فيها‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The prostration of Sa`d is not a compulsory one but I saw the Prophet prostrating while reciting it.",
      "chain": [
        "20193",
        "20283",
        "20022",
        "11015",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1135",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن الأعمش، عن أبي وائل، عن عبد الله  رضى الله عنه  قال صليت مع النبي صلى الله عليه وسلم ليلة، فلم يزل قائما حتى هممت بأمر سوء‏.‏ قلنا وما هممت قال هممت أن أقعد وأذر النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu-Wail:                     `Abdullah said, \"One night I offered the Tahajjud prayer with the Prophet and he kept on standing till an ill-thought came to me.\" We said, \"What was the ill-thought?\" He said, \"It was to sit down and leave the Prophet (standing).\"",
      "chain": [
        "20193",
        "20020",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "1180",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، عن نافع، عن ابن عمر  رضى الله عنهما  قال حفظت من النبي صلى الله عليه وسلم عشر ركعات ركعتين قبل الظهر، وركعتين بعدها، وركعتين بعد المغرب في بيته، وركعتين بعد العشاء في بيته، وركعتين قبل صلاة الصبح، وكانت ساعة لا يدخل على النبي صلى الله عليه وسلم فيها‏.‏ حدثتني حفصة، أنه كان إذا أذن المؤذن وطلع الفجر صلى ركعتين‏.‏",
      "text_en": "      Narrated Ibn 'Umar:                          I remember ten Rakat of Nawafil from the Prophet, two Rakat before the Zuhr prayer and two after it; two Rakat after Maghrib prayer in his house, and two Rakat after 'Isha' prayer in his house, and two Rakat before the Fajr prayer and at that time nobody would enter the house of the Prophet.Hafsa told me that the Prophet used to offer two Rakat after the call maker had made the Adhan and the day had dawned.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1213",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن أيوب، عن نافع، عن ابن عمر  رضى الله عنهما  أن النبي صلى الله عليه وسلم رأى نخامة في قبلة المسجد، فتغيظ على أهل المسجد وقال ‏\"‏ إن الله قبل أحدكم، فإذا كان في صلاته، فلا يبزقن  أو قال  لا يتنخمن ‏\"‏‏.‏ ثم نزل فحتها بيده‏.‏ وقال ابن عمر  رضى الله عنهما  إذا بزق أحدكم فليبزق على يساره‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet saw some sputum on the wall facing the Qibla of the mosque and became furious with the people of the mosque and said, \"During the prayer, Allah is in front of everyone of you and so he should not spit (or said, 'He should not expectorate').\" Then he got down and scratched the sputum with his hand. Ibn `Umar said (after narrating), \"If anyone of you has to spit during the prayer, he should spit to his left.\"",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1228",
      "source": " Sahih Bukhari ",
      "chapter": "Forgetfulness in Prayer - كتاب السهو",
      "chapter_no": "22",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن سلمة بن علقمة، قال قلت لمحمد في سجدتى السهو تشهد قال ليس في حديث أبي هريرة‏.‏",
      "text_en": " Narrated Salama bin 'Alqama:                     I asked Muhammad (bin Seereen) whether Tashah-hud should be recited after the two prostrations of Sahu. He replied, \"It is not (mentioned) in Abu Huraira's narration . \"",
      "chain": [
        "20193",
        "20022",
        "11593"
      ]
    },
    {
      "hadith_no": "1322",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن الشيباني، عن الشعبي، قال أخبرني من، مر مع نبيكم صلى الله عليه وسلم على قبر منبوذ فأمنا فصففنا خلفه‏.‏ فقلنا يا أبا عمرو من حدثك قال ابن عباس رضى الله عنهما‏.‏",
      "text_en": " Narrated Ash-Shaibani:                     Ash-Shu`bi said, \"Somebody who passed along with your Prophet (p.b.u.h) by a grave that was separate from the other graves informed me (saying), \"The Prophet led us (in the prayer) and we aligned behind him.\" We said, \"O Abu `Amr! Who told you this narration?\" He replied, \"Ibn `Abbas.\"",
      "chain": [
        "20193",
        "20020",
        "11352",
        "11052"
      ]
    },
    {
      "hadith_no": "1356",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد  وهو ابن زيد  عن ثابت، عن أنس  رضى الله عنه  قال كان غلام يهودي يخدم النبي صلى الله عليه وسلم فمرض، فأتاه النبي صلى الله عليه وسلم يعوده، فقعد عند رأسه فقال له ‏\"‏ أسلم ‏\"‏‏.‏ فنظر إلى أبيه وهو عنده فقال له أطع أبا القاسم صلى الله عليه وسلم‏.‏ فأسلم، فخرج النبي صلى الله عليه وسلم وهو يقول ‏\"‏ الحمد لله الذي أنقذه من النار ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     A young Jewish boy used to serve the Prophet and he became sick. So the Prophet went to visit him. He sat near his head and asked him to embrace Islam. The boy looked at his father, who was sitting there; the latter told him to obey Abul-Qasim and the boy embraced Islam. The Prophet came out saying: \"Praises be to Allah Who saved the boy from the Hell-fire.\"",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "1438",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن أبي إسحاق، قال سمعت عبد الله بن معقل، قال سمعت عدي بن حاتم  رضى الله عنه  قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ اتقوا النار ولو بشق تمرة ‏\"‏‏.‏",
      "text_en": " Narrated `Adi bin Hatim heard the Prophet saying:                     \"Save yourself from Hell-fire even by giving half a date-fruit in charity.\"",
      "chain": [
        "20193",
        "20020",
        "11049",
        "18580",
        "212"
      ]
    },
    {
      "hadith_no": "1572",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن أنس  رضى الله عنه  قال صلى النبي صلى الله عليه وسلم بالمدينة الظهر أربعا، والعصر بذي الحليفة ركعتين، وسمعتهم يصرخون بهما جميعا‏.‏",
      "text_en": " Narrated Anas:                     The Prophet offered four rak`at of the Zuhr prayer in Medina and two rak`at of the `Asr prayer in Dhul-Hulaifa and I heard them (the companions of the Prophet) reciting Talbiya together loudly to the extent of shouting.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "1627",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد  هو ابن زيد  عن أيوب، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال قدم رسول الله صلى الله عليه وسلم وأصحابه فقال المشركون إنه يقدم عليكم، وقد وهنهم حمى يثرب‏.‏ فأمرهم النبي صلى الله عليه وسلم أن يرملوا الأشواط الثلاثة، وأن يمشوا ما بين الركنين، ولم يمنعه أن يأمرهم أن يرملوا الأشواط كلها إلا الإبقاء عليهم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When Allah's Apostle and his companions came to Mecca, the pagans circulated the news that a group of people were coming to them and they had been weakened by the Fever of Yathrib (Medina). So the Prophet ordered his companions to do Ramal in the first three rounds of Tawaf of the Ka`ba and to walk between the two corners (The Black Stone and Yemenite corner). The Prophet did not order them to do Ramal in all the rounds of Tawaf out of pity for them.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1703",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أيوب، عن عكرمة، عن ابن عباس  رضى الله عنهما  قال بعثني رسول الله صلى الله عليه وسلم من جمع بليل‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle had sent me from Jam' (i.e. Al-Muzdalifa) at night.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1850",
      "source": " Sahih Bukhari ",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن منصور، عن أبي حازم، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حج هذا البيت، فلم يرفث ولم يفسق، رجع كما ولدته أمه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Whoever performs Hajj to this House (Ka`ba) and does not approach his wife for sexual relations nor commits sins (while performing Hajj), he will come out as sinless as a newlyborn child. (Just delivered by his mother).",
      "chain": [
        "20193",
        "20020",
        "11067",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "1880",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن عمرو بن دينار، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال بينا رجل واقف مع النبي صلى الله عليه وسلم بعرفة إذ وقع عن راحلته، فوقصته  أو قال فأقعصته  فقال النبي صلى الله عليه وسلم ‏\"‏ اغسلوه بماء وسدر، وكفنوه في ثوبين  أو قال ثوبيه  ولا تحنطوه، ولا تخمروا رأسه، فإن الله يبعثه يوم القيامة يلبي ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     While a man was standing with the Prophet at `Arafat, he fell from his Mount and his neck was crushed by it. The Prophet said, \"Wash the deceased with water and Sidr and shroud him in two pieces of cloth, and neither perfume him nor cover his head, for Allah will resurrect him on the Day of Resurrection and he will be reciting Talbiya.\"",
      "chain": [
        "20193",
        "20022",
        "11081",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1881",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن أيوب، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال بينا رجل واقف مع النبي صلى الله عليه وسلم بعرفة إذ وقع عن راحلته فوقصته  أو قال فأوقصته  فقال النبي صلى الله عليه وسلم ‏\"‏ اغسلوه بماء وسدر، وكفنوه في ثوبين، ولا تمسوه طيبا، ولا تخمروا رأسه، ولا تحنطوه، فإن الله يبعثه يوم القيامة ملبيا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     While a man was standing with the Prophet at `Arafat, he fell from his Mount and his neck was crushed by it. The Prophet said, \"Wash the deceased with water and Sidr and shroud him in two pieces of cloth, and neither perfume him nor cover his head, for Allah will resurrect him on the Day of Resurrection and he will be reciting Talbiya.\"",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1895",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن عبد الملك بن عمير، عن قزعة، مولى زياد قال سمعت أبا سعيد  وقد غزا مع النبي صلى الله عليه وسلم ثنتى عشرة  غزوة  قال أربع سمعتهن من رسول الله صلى الله عليه وسلم أو قال يحدثهن عن النبي صلى الله عليه وسلم  فأعجبنني وآنقنني ‏\"‏ أن لا تسافر امرأة مسيرة يومين ليس معها زوجها أو ذو محرم، ولا صوم يومين الفطر والأضحى، ولا صلاة بعد صلاتين بعد العصر حتى تغرب الشمس، وبعد الصبح حتى تطلع الشمس، ولا تشد الرحال إلا إلى ثلاثة مساجد مسجد الحرام، ومسجدي، ومسجد الأقصى ‏\"‏‏.‏",
      "text_en": " Narrated Qaza'a the slave of Ziyad:                     Abu Sa`id who participated in twelve Ghazawat with the Prophet said, \"I heard four things from Allah's Apostle (or I narrate them from the Prophet ) which won my admiration and appreciation. They are: -1. \"No lady should travel without her husband or without a Dhu-Mahram for a two-days' journey. -2. No fasting is permissible on two days of `Id-ul-Fitr, and `Id-al-Adha. -3. No prayer (may be offered) after two prayers: after the `Asr prayer till the sun set and after the morning prayer till the sun rises. -4. Not to travel (for visiting) except for three mosques: Masjid-al-Haram (in Mecca), my Mosque (in Medina), and Masjid-al-Aqsa (in Jerusalem).",
      "chain": [
        "20193",
        "20020",
        "11368",
        "11302"
      ]
    },
    {
      "hadith_no": "1917",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن عدي بن ثابت، عن عبد الله بن يزيد، قال سمعت زيد بن ثابت  رضى الله عنه  يقول لما خرج النبي صلى الله عليه وسلم إلى أحد رجع ناس من أصحابه فقالت فرقة نقتلهم‏.‏ وقالت فرقة لا نقتلهم‏.‏ فنزلت ‏{‏فما لكم في المنافقين فئتين‏}‏ وقال النبي صلى الله عليه وسلم ‏\"‏ إنها تنفي الرجال كما تنفي النار خبث الحديد ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Thabit:                     When the Prophet went out for (the battle of) Uhud, some of his companions (hypocrites) returned (home). A party of the believers remarked that they would kill those (hypocrites) who had returned, but another party said that they would not kill them. So, this Divine Inspiration was revealed: \"Then what is the matter with you that you are divided into two parties concerning the hypocrites.\" (4.88) The Prophet said, \"Medina expels the bad persons from it, as fire expels the impurities of iron.\"",
      "chain": [
        "20193",
        "20020",
        "11372",
        "1945",
        "49"
      ]
    },
    {
      "hadith_no": "1927",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا سليمان بن حرب، قال عن شعبة، عن الحكم، عن إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  قالت كان النبي صلى الله عليه وسلم يقبل ويباشر، وهو صائم، وكان أملككم لإربه‏.‏ وقال قال ابن عباس ‏{‏مآرب‏}‏ حاجة‏.‏ قال طاوس ‏{‏أولي الإربة‏}‏ الأحمق لا حاجة له في النساء‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to kiss and embrace (his wives) while he was fasting, and he had more power to control his desires than any of you. Said Jabir, \"The person who gets discharge after casting a look (on his wife) should complete his fast.\"",
      "chain": [
        "20193",
        "20020",
        "11069",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2079",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن قتادة، عن صالح أبي الخليل، عن عبد الله بن الحارث، رفعه إلى حكيم بن حزام  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ البيعان بالخيار ما لم يتفرقا  أو قال حتى يتفرقا  فإن صدقا وبينا بورك لهما في بيعهما، وإن كتما وكذبا محقت بركة بيعهما ‏\"‏‏.‏",
      "text_en": " Narrated Hakim bin Hizam:                     Allah's Apostle said, \"The seller and the buyer have the right to keep or return goods as long as they have not parted or till they part; and if both the parties spoke the truth and described the defects and qualities (of the goods), then they would be blessed in their transaction, and if they told lies or hid something, then the blessings of their transaction would be lost.\"",
      "chain": [
        "20193",
        "20020",
        "11019",
        "11291"
      ]
    },
    {
      "hadith_no": "2228",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن ثابت، عن أنس  رضى الله عنه  قال كان في السبى صفية، فصارت إلى دحية الكلبي، ثم صارت إلى النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas:                     Amongst the captives was Safiya. First she was given to Dihya Al-Kalbi and then to the Prophet.",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "2268",
      "source": " Sahih Bukhari ",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن أيوب، عن نافع، عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ مثلكم ومثل أهل الكتابين كمثل رجل استأجر أجراء فقال من يعمل لي من غدوة إلى نصف النهار على قيراط فعملت اليهود، ثم قال من يعمل لي من نصف النهار إلى صلاة العصر على قيراط فعملت النصارى ثم، قال من يعمل لي من العصر إلى أن تغيب الشمس على قيراطين فأنتم هم، فغضبت اليهود والنصارى، فقالوا ما لنا أكثر عملا، وأقل عطاء قال هل نقصتكم من حقكم قالوا لا‏.‏ قال فذلك فضلي أوتيه من أشاء ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"Your example and the example of the people of the two Scriptures (i.e. Jews and Christians) is like the example of a man who employed some laborers and asked them, 'Who will work for me from morning till midday for one Qirat?' The Jews accepted and carried out the work. He then asked, Who will work for me from midday up to the `Asr prayer for one Qirat?' The Christians accepted and fulfilled the work. He then said, 'Who will work for me from the `Asr till sunset for two Qirats?' You, Muslims have accepted the offer. The Jews and the Christians got angry and said, 'Why should we work more and get lesser wages?' (Allah) said, 'Have I withheld part of your right?' They replied in the negative. He said, 'It is My Blessing, I bestow upon whomever I wish .'",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2306",
      "source": " Sahih Bukhari ",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن سلمة بن كهيل، سمعت أبا سلمة بن عبد الرحمن، عن أبي هريرة  رضى الله عنه  أن رجلا، أتى النبي صلى الله عليه وسلم يتقاضاه، فأغلظ، فهم به أصحابه فقال رسول الله صلى الله عليه وسلم ‏\"‏ دعوه فإن لصاحب الحق مقالا ‏\"‏‏.‏ ثم قال ‏\"‏ أعطوه سنا مثل سنه ‏\"‏‏.‏ قالوا يا رسول الله لا نجد إلا أمثل من سنه‏.‏ فقال ‏\"‏ أعطوه فإن من خيركم أحسنكم قضاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     A man came to the Prophet demanding his debts and behaved rudely. The companions of the Prophet intended to harm him, but Allah's Apostle said (to them), \"Leave him, for the creditor (i.e. owner of a right) has the right to speak.\" Allah's Apostle then said, \"Give him a camel of the same age as that of his.\" The people said, \"O Allah's Apostle! There is only a camel that is older than his.\" Allah's Apostle said, \"Give (it to) him, for the best amongst you is he who pays the rights of others handsomely.\"",
      "chain": [
        "20193",
        "20020",
        "11350",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2343",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن أيوب، عن نافع، أن ابن عمر  رضى الله عنهما  كان يكري مزارعه على عهد النبي صلى الله عليه وسلم وأبي بكر وعمر وعثمان وصدرا من إمارة معاوية‏.‏ ثم حدث عن رافع بن خديج، أن النبي صلى الله عليه وسلم نهى عن كراء المزارع، فذهب ابن عمر إلى رافع فذهبت معه، فسأله فقال نهى النبي صلى الله عليه وسلم عن كراء المزارع‏.‏ فقال ابن عمر قد علمت أنا كنا نكري مزارعنا على عهد رسول الله صلى الله عليه وسلم بما على الأربعاء وبشىء من التبن‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar used to rent his farms in the time of Abu Bakr, `Umar, `Uthman, and in the early days of Muawiya. Then he was told the narration of Rafi` 'bin Khadij that the Prophet had forbidden the renting of farms. Ibn `Umar went to Rafi` and I accompanied him. He asked Rafi` who replied that the Prophet had forbidden the renting of farms. Ibn `Umar said, \"You know that we used to rent our farms in the lifetime of Allah's Apostle for the yield of the banks of the water streams (rivers) and for certain amount of figs.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2376",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن يحيى بن سعيد، قال سمعت أنسا  رضى الله عنه  قال أراد النبي صلى الله عليه وسلم أن يقطع من البحرين، فقالت الأنصار حتى تقطع لإخواننا من المهاجرين مثل الذي تقطع لنا قال ‏\"‏ سترون بعدي أثرة فاصبروا حتى تلقوني ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet decided to grant a portion of (the uncultivated land of) Bahrain to the Ansar. The Ansar said, \"(We will not accept it) till you give a similar portion to our emigrant brothers (from Quraish).\" He said, \"(O Ansar!) You will soon see people giving preference to others, so remain patient till you meet me (on the Day of Resurrection).",
      "chain": [
        "20193",
        "20022",
        "20031",
        "19"
      ]
    },
    {
      "hadith_no": "2437",
      "source": " Sahih Bukhari ",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن سلمة بن كهيل، قال سمعت سويد بن غفلة، قال كنت مع سلمان بن ربيعة، وزيد بن صوحان في غزاة، فوجدت سوطا‏.‏ فقال لي ألقه‏.‏ قلت لا، ولكن إن وجدت صاحبه، وإلا استمتعت به‏.‏ فلما رجعنا حججنا فمررت بالمدينة، فسألت أبى بن كعب  رضى الله عنه  فقال وجدت صرة على عهد النبي صلى الله عليه وسلم فيها مائة دينار، فأتيت بها النبي صلى الله عليه وسلم فقال ‏\"‏ عرفها حولا ‏\"‏‏.‏ فعرفتها حولا ثم أتيت، فقال ‏\"‏ عرفها حولا ‏\"‏‏.‏ فعرفتها حولا ثم أتيته، فقال ‏\"‏ عرفها حولا ‏\"‏‏.‏ فعرفتها حولا ثم أتيته الرابعة فقال ‏\"‏ اعرف عدتها ووكاءها ووعاءها، فإن جاء صاحبها وإلا استمتع بها ‏\"‏‏.‏",
      "text_en": " Narrated Suwaid bin Ghafala:                     While I as in the company of Salman bin Rabi`a and Suhan, in one of the holy battles, I found a whip. One of them told me to drop it but I refused to do so and said that I would give it to its owner if I found him, otherwise I would utilize it. On our return we performed Hajj and on passing by Medina, I asked Ubai bin Ka`b about it. He said, \"I found a bag containing a hundred Dinars in the lifetime of the Prophet and took it to the Prophet who said to me, 'Make public announcement about it for one year.' So, I announced it for one year and went to the Prophet who said, 'Announce it publicly for another year.' So, I announced it for another year. I went to him again and he said, \"Announce for an other year.\" So I announced for still another year. I went to the Prophet for the fourth time, and he said, 'Remember the amount of money, the description of its container and the string it is tied with, and if the owner comes, give it to him; otherwise, utilize it.' \"",
      "chain": [
        "20193",
        "20020",
        "11350",
        "11174"
      ]
    },
    {
      "hadith_no": "2471",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا سليمان بن حرب، عن شعبة، عن منصور، عن أبي وائل، عن حذيفة  رضى الله عنه  قال لقد رأيت رسول الله صلى الله عليه وسلم، أو قال لقد أتى النبي صلى الله عليه وسلم سباطة قوم فبال قائما‏.‏",
      "text_en": " Narrated Hudhaifa:                     I saw Allah's Apostle coming (or the Prophet came) to the dumps of some people and urinated there while standing .",
      "chain": [
        "20193",
        "20020",
        "11067",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "2572",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن هشام بن زيد بن أنس بن مالك، عن أنس  رضى الله عنه  قال أنفجنا أرنبا بمر الظهران، فسعى القوم فلغبوا، فأدركتها فأخذتها، فأتيت بها أبا طلحة فذبحها، وبعث بها إلى رسول الله صلى الله عليه وسلم بوركها  أو فخذيها قال فخذيها لا شك فيه  فقبله‏.‏ قلت وأكل منه قال وأكل منه‏.‏ ثم قال بعد قبله‏.‏",
      "text_en": " Narrated Anas:                     We chased a rabbit at Mar-al-Zahran and the people ran after it but were exhausted. I overpowered and caught it, and gave it to Abu Talha who slaughtered it and sent its hip or two thighs to Allah's Apostle. (The narrator confirms that he sent two thighs). The Prophet accepted that. (The sub-narrator asked Anas, \"Did the Prophet; eat from it?\" Anas replied, \"He ate from it.\")",
      "chain": [
        "20193",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "hadith_no": "2580",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت كان الناس يتحرون بهداياهم يومي‏.‏ وقالت أم سلمة إن صواحبي اجتمعن‏.‏ فذكرت له، فأعرض عنها‏.‏",
      "text_en": " Narrated `Aisha:                     The people used to send gifts to the Prophet on the day of my turn. Um Salama said: \"My companions (the wives of the Prophet Other than Aisha) gathered and they complained about it. So I informed the Prophet about it on their behalf, but he remained silent.",
      "chain": [
        "20193",
        "20022",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2642",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن ثابت، عن أنس  رضى الله عنه  قال مر على النبي صلى الله عليه وسلم بجنازة، فأثنوا عليها خيرا فقال ‏\"‏ وجبت ‏\"‏‏.‏ ثم مر بأخرى فأثنوا عليها شرا  أو قال غير ذلك  فقال ‏\"‏ وجبت ‏\"‏‏.‏ فقيل يا رسول الله، قلت لهذا وجبت، ولهذا وجبت، قال ‏\"‏ شهادة القوم، المؤمنون شهداء الله في الأرض ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     A funeral procession passed in front of the Prophet and the people praised the deceased. The Prophet said, \"It has been affirmed (Paradise).\" Then another funeral procession passed by and the people talked badly of the deceased. The Prophet said, \"It has been affirmed (Hell).\" Allah's Apostle was asked, \"O Allah's Apostle! You said it has been affirmed for both?\" The Prophet said, \"The testimony of the people (is accepted), (for) the believer are Allah's witnesses on the earth.\"",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    }
  ],
  "total_hadiths": 240
}