{
  "id": "20193",
  "name": "Sulaiman bin Harb سليمان بن حرب",
  "full_name": "Sulaiman bin Harb سليمان بن حرب",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "144",
      "date_gregorian": "NA",
      "date_display": [
        "144 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "224",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra",
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Qadhi(Judge)"
    ],
    "tags": [
      "al-Azdi",
      "al-Washshi",
      "Judge",
      "al-Basri",
      "Makkah"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20604",
      "name": "Muhammad bin Talha bin Masraf محمد بن طلحة بن مصرف",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20299",
      "name": "Wahayb bin Khalid bin 'Ajlan al-Bahli وهيب بن خالد بن عجلان الباهلي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "24105",
      "name": "Hushab bin 'Aqil al-Jarmi حوشب بن عقيل الجرمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20303",
      "name": "Yazid bin Ibrahim al-Tstry يزيد بن إبراهيم التستري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20550",
      "name": "Salam bin Abi Mut'ia سلام بن أبي مطيع",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "24031",
      "name": "Bstam bin Hryth بسطام بن حريث",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "35010",
      "name": "Ibrahim bin Abi Bakr bin Muhammad إبراهيم بن أبي بكر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30545",
      "name": "Sulaiman bin Ma'bd bin Kwsjan سليمان بن معبد بن كوسجان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30296",
      "name": "Ahmed bin Sa'id bin Sakhar أحمد بن سعيد بن صخر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30115",
      "name": "al-Hasan bin 'Ali al-Halwani الحسن بن علي الخلال الحلواني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "20264",
      "name": "'Ali bin Nasr bin 'Ali al-Jahdami Older علي بن نصر بن علي الجهضمي الكبير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30153",
      "name": "'Amr bin 'Ali bin Bahr al-Bahli عمرو بن علي بن بحر الباهلي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30494",
      "name": "Ahmed bin Ibrahim bin Kathir أحمد بن إبراهيم بن كثير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30524",
      "name": "Harun bin 'Abdullah al-Hamal هارون بن عبد الله بن مروان الحمال",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38088",
      "name": "Ibrahim bin Y'aqub bin Ishaq إبراهيم بن يعقوب بن إسحاق",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "34044",
      "name": "al-Jrah bin Mkhld al-Jly الجراح بن مخلد العجلي البصري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38178",
      "name": "al-Husain bin Muhammad bin Ja'far الحسين بن محمد بن جعفر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30025",
      "name": "'Abdullah bin 'Abdur Rahman al-Daarimi عبد الله بن عبد الرحمن الدارمي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38433",
      "name": "'Amr bin Mnswr al-Nsa'iy عمرو بن منصور النسائي أبو سعيد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38719",
      "name": "Y'aqub bin Sufyan يعقوب بن سفيان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30418",
      "name": "'Abdullah bin al-Zubair bin 'Isa عبد الله بن الزبير بن عيسى الحميدي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30008",
      "name": "Ibn Sa'd محمد بن سعد البغدادي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30224",
      "name": "Yusuf bin Musa bin Rashid al-Qatan يوسف بن موسى بن راشد القطان",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30203",
      "name": "'Uthman bin Muhammad عثمان بن محمد بن إبراهيم / بن أبي شيبة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "21",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن قتادة، عن أنس  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاث من كن فيه وجد حلاوة الإيمان من كان الله ورسوله أحب إليه مما سواهما، ومن أحب عبدا لا يحبه إلا لله، ومن يكره أن يعود في الكفر بعد إذ أنقذه الله، كما يكره أن يلقى في النار ‏\"‏‏.‏",
      "text_en": "      Narrated Anas:                          The Prophet said, \"Whoever possesses the following three qualities      will taste the sweetness of faith:     1. The one to whom Allah and His Apostle become dearer than anything      else.     2. Who loves a person and he loves him only for Allah's sake.     3. Who hates to revert to disbelief (Atheism) after Allah has brought      (saved) him out from it, as he hates to be thrown in fire.\"",
      "chain": [
        "20193",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "30",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن واصل الأحدب، عن المعرور، قال لقيت أبا ذر بالربذة، وعليه حلة، وعلى غلامه حلة، فسألته عن ذلك، فقال إني ساببت رجلا، فعيرته بأمه، فقال لي النبي صلى الله عليه وسلم ‏\"‏ يا أبا ذر أعيرته بأمه إنك امرؤ فيك جاهلية، إخوانكم خولكم، جعلهم الله تحت أيديكم، فمن كان أخوه تحت يده فليطعمه مما يأكل، وليلبسه مما يلبس، ولا تكلفوهم ما يغلبهم، فإن كلفتموهم فأعينوهم ‏\"‏‏.‏",
      "text_en": "      Narrated Al-Ma'rur:                          At Ar-Rabadha I met Abu Dhar who was wearing a cloak, and his slave,      too, was wearing a similar one. I asked about the reason for it. He      replied, \"I abused a person by calling his mother with bad names.\" The     Prophet said to me, 'O Abu Dhar! Did you abuse him by calling his      mother with bad names You still have some characteristics of      ignorance. Your slaves are your brothers and Allah has put them under      your command. So whoever has a brother under his command should feed      him of what he eats and dress him of what he wears. Do not ask them      (slaves) to do things beyond their capacity (power) and if you do so,      then help them.' \"",
      "chain": [
        "20193",
        "20020",
        "11401",
        "11397"
      ]
    },
    {
      "hadith_no": "98",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن أيوب، قال سمعت عطاء، قال سمعت ابن عباس، قال أشهد على النبي صلى الله عليه وسلم  أو قال عطاء أشهد على ابن عباس  أن رسول الله صلى الله عليه وسلم خرج ومعه بلال، فظن أنه لم يسمع النساء فوعظهن، وأمرهن بالصدقة، فجعلت المرأة تلقي القرط والخاتم، وبلال يأخذ في طرف ثوبه‏.‏وقال إسماعيل عن أيوب عن عطاء وقال عن ابن عباس أشهد على النبي صلى الله عليه وسلم‏.‏",
      "text_en": "      Narrated Ibn 'Abbas:                          Once Allah's Apostle came out while Bilal was accompanying him. He      went towards the women thinking that they had not heard him (i.e. his      sermon). So he preached them and ordered them to pay alms. (Hearing      that) the women started giving alms; some donated their ear-rings,      some gave their rings and Bilal was collecting them in the corner of      his garment.",
      "chain": [
        "20193",
        "20020",
        "11015",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "151",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن أبي معاذ  هو عطاء بن أبي ميمونة  قال سمعت أنسا، يقول كان رسول الله صلى الله عليه وسلم إذا خرج لحاجته تبعته أنا وغلام منا معنا إداوة من ماء‏.‏",
      "text_en": " Narrated Anas:                     Whenever Allah's Apostle went to answer the call of nature, I along with another boy from us used to go behind him with a tumbler full of water.",
      "chain": [
        "20193",
        "20020",
        "11601",
        "19"
      ]
    },
    {
      "hadith_no": "192",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا وهيب، قال حدثنا عمرو بن يحيى، عن أبيه، قال شهدت عمرو بن أبي حسن سأل عبد الله بن زيد عن وضوء النبي، صلى الله عليه وسلم فدعا بتور من ماء، فتوضأ لهم، فكفأ على يديه فغسلهما ثلاثا، ثم أدخل يده في الإناء، فمضمض واستنشق، واستنثر ثلاثا بثلاث غرفات من ماء، ثم أدخل يده في الإناء، فغسل وجهه ثلاثا، ثم أدخل يده في الإناء، فغسل يديه إلى المرفقين مرتين مرتين، ثم أدخل يده في الإناء، فمسح برأسه فأقبل بيديه وأدبر بهما، ثم أدخل يده في الإناء فغسل رجليه‏.‏ وحدثنا موسى قال حدثنا وهيب قال مسح رأسه مرة‏.‏",
      "text_en": " Narrated `Amr bin Yahya:                     My father said, \"I saw `Amr bin Abi Hasan asking `Abdullah bin Zaid about the ablution of the Prophet. `Abdullah bin Zaid asked for an earthenware pot containing water and performed ablution in front of them. He poured water over his hands and washed them thrice. Then he put his (right) hand in the pot and rinsed his mouth and washed his nose by putting water in it and then blowing it out thrice with three handfuls of water Again he put his hand in the water and washed his face thrice. After that he put his hand in the pot and washed his forearms up to the elbows twice and then again put his hand in the water and passed wet hands over his head by bringing them to the front and then to the back and once more he put his hand in the pot and washed his feet (up to the ankles.)\"Narrated Wuhaib:That he (the Prophet in narration 191 above) had passed his wet hands on the head once only.",
      "chain": [
        "20193",
        "20299",
        "11210",
        "11232",
        "605"
      ]
    },
    {
      "hadith_no": "233",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن أنس، قال قدم أناس من عكل أو عرينة، فاجتووا المدينة، فأمرهم النبي صلى الله عليه وسلم بلقاح، وأن يشربوا من أبوالها وألبانها، فانطلقوا، فلما صحوا قتلوا راعي النبي صلى الله عليه وسلم واستاقوا النعم، فجاء الخبر في أول النهار، فبعث في آثارهم، فلما ارتفع النهار جيء بهم، فأمر فقطع أيديهم وأرجلهم، وسمرت أعينهم، وألقوا في الحرة يستسقون فلا يسقون‏.‏ قال أبو قلابة فهؤلاء سرقوا وقتلوا وكفروا بعد إيمانهم، وحاربوا الله ورسوله‏.‏",
      "text_en": " Narrated Abu Qilaba:                     Anas said, \"Some people of `Ukl or `Uraina tribe came to Medina and its climate did not suit them. So the Prophet ordered them to go to the herd of (Milch) camels and to drink their milk and urine (as a medicine). So they went as directed and after they became healthy, they killed the shepherd of the Prophet and drove away all the camels. The news reached the Prophet early in the morning and he sent (men) in their pursuit and they were captured and brought at noon. He then ordered to cut their hands and feet (and it was done), and their eyes were branded with heated pieces of iron, They were put in 'Al-Harra' and when they asked for water, no water was given to them.\" Abu Qilaba said, \"Those people committed theft and murder, became infidels after embracing Islam and fought against Allah and His Apostle .\"",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "340",
      "source": " Sahih Bukhari ",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن الحكم، عن ذر، عن ابن عبد الرحمن بن أبزى، عن أبيه، أنه شهد عمر وقال له عمار كنا في سرية فأجنبنا، وقال تفل فيهما‏.‏",
      "text_en": " Narrated `Abdur Rahman bin Abza:                     that while he was in the company of `Umar, `Ammar said to `Umar, \"We were in a detachment and became Junub and I blew the dust off my hands (performed the rolling over the earth and prayed.)\"",
      "chain": [
        "20193",
        "20020",
        "11069",
        "11423",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "365",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، عن محمد، عن أبي هريرة، قال قام رجل إلى النبي صلى الله عليه وسلم فسأله عن الصلاة في الثوب الواحد فقال ‏\"‏ أوكلكم يجد ثوبين ‏\"‏‏.‏ ثم سأل رجل عمر فقال إذا وسع الله فأوسعوا، جمع رجل عليه ثيابه، صلى رجل في إزار ورداء، في إزار وقميص، في إزار وقباء، في سراويل ورداء، في سراويل وقميص، في سراويل وقباء، في تبان وقباء، في تبان وقميص  قال وأحسبه قال  في تبان ورداء‏.‏",
      "text_en": " Narrated Abu Huraira:                     A man stood up and asked the Prophet about praying in a single garment. The Prophet said, \"Has every one of you two garments?\" A man put a similar question to `Umar on which he replied, \"When Allah makes you wealthier then you should clothe yourself properly during prayers. Otherwise one can pray with an Izar and a Rida' (a sheet covering the upper part of the body.) Izar and a shirt, Izar and a Qaba', trousers and a Rida, trousers and a shirt or trousers and a Qaba', Tubban and a Qaba' or Tubban and a shirt.\" (The narrator added, \"I think that he also said a Tubban and a Rida. \")",
      "chain": [
        "20193",
        "20022",
        "11015",
        "20278",
        "13"
      ]
    },
    {
      "hadith_no": "426",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن الأشعث بن سليم، عن أبيه، عن مسروق، عن عائشة، قالت كان النبي صلى الله عليه وسلم يحب التيمن ما استطاع في شأنه كله في طهوره وترجله وتنعله‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to start every thing from the right (for good things) whenever it was possible in all his affairs; for example: in washing, combing or wearing shoes.",
      "chain": [
        "20193",
        "20020",
        "11324",
        "11351",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "429",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن أبي التياح، عن أنس، قال كان النبي صلى الله عليه وسلم يصلي في مرابض الغنم، ثم سمعته بعد يقول كان يصلي في مرابض الغنم قبل أن يبنى المسجد‏.‏",
      "text_en": " Narrated Abu Al-Taiyah [??]:                     Anas said, \"The Prophet prayed in the sheep fold.\" Later on I heard him saying, \"He prayed in the sheep folds before the construction of the, mosque.\"",
      "chain": [
        "20193",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "458",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن ثابت، عن أبي رافع، عن أبي هريرة، أن رجلا، أسود  أو امرأة سوداء  كان يقم المسجد، فمات، فسأل النبي صلى الله عليه وسلم عنه فقالوا مات‏.‏ قال ‏\"‏ أفلا كنتم آذنتموني به دلوني على قبره ‏\"‏‏.‏  أو قال قبرها  فأتى قبره فصلى عليه‏.‏",
      "text_en": " Narrated Abu Huraira:                     A black man or a black woman used to sweep the mosque and he or she died. The Prophet asked about her (or him). He was told that she (or he) had died. He said, \"Why did you not inform me? Show me his grave (or her grave).\" So he went to her (his) grave and offered her (his) funeral prayer.\"",
      "chain": [
        "20193",
        "20022",
        "11269",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "501",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن الحكم، عن أبي جحيفة، قال خرج رسول الله صلى الله عليه وسلم بالهاجرة فصلى بالبطحاء الظهر والعصر ركعتين، ونصب بين يديه عنزة، وتوضأ، فجعل الناس يتمسحون بوضوئه‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     Allah's Apostle came out at midday and offered a two-rak`at Zuhr and `Asr prayers at Al-Batha and a short spear (or stick) was planted in front of him (as a Sutra). He performed ablution and the people took the remaining water left after his ablution and rubbed their bodies with it.",
      "chain": [
        "20193",
        "20020",
        "11069",
        "4047"
      ]
    },
    {
      "hadith_no": "605",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن سماك بن عطية، عن أيوب، عن أبي قلابة، عن أنس، قال أمر بلال أن يشفع، الأذان وأن يوتر الإقامة إلا الإقامة‏.‏",
      "text_en": " Narrated Anas:                     Bilal was ordered to repeat the wording of the Adhan for prayers twice, and to pronounce the wording of the Iqama once except \"Qad-qamat-is-salat\".",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "685",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن مالك بن الحويرث، قال قدمنا على النبي صلى الله عليه وسلم ونحن شببة، فلبثنا عنده نحوا من عشرين ليلة، وكان النبي صلى الله عليه وسلم رحيما فقال ‏\"‏ لو رجعتم إلى بلادكم فعلمتموهم، مروهم فليصلوا صلاة كذا في حين كذا، وصلاة كذا في حين كذا، وإذا حضرت الصلاة فليؤذن لكم أحدكم، وليؤمكم أكبركم ‏\"‏‏.‏",
      "text_en": " Narrated Malik bin Huwairith:                     We went to the Prophet and we were all young men and stayed with him for about twenty nights. The Prophet was very merciful. He said, \"When you return home, impart religious teachings to your families and tell them to offer perfectly such and such a prayer at such and such a time and such and such a prayer at such and such a time. And al the time of the prayer one of you should pronounce the Adhan and the oldest of you should lead the prayer.\"",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "697",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن الحكم، قال سمعت سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال بت في بيت خالتي ميمونة فصلى رسول الله صلى الله عليه وسلم العشاء، ثم جاء فصلى أربع ركعات ثم نام، ثم قام فجئت فقمت عن يساره، فجعلني عن يمينه، فصلى خمس ركعات، ثم صلى ركعتين، ثم نام حتى سمعت غطيطه  أو قال خطيطه  ثم خرج إلى الصلاة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Once I passed the night in the house of my aunt Maimuna. Allah's Apostle offered the `Isha' prayer and then came to the house and offered four rak`at an slept. Later on, he woke up and stood for the prayer and I stood on his left side. He drew me to his right and prayed five rak`at and then two. He then slept till I heard him snoring (or heard his breath sounds). Afterwards he went out for the morning prayer.",
      "chain": [
        "20193",
        "20020",
        "11069",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "711",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، وأبو النعمان، قالا حدثنا حماد بن زيد، عن أيوب، عن عمرو بن دينار، عن جابر، قال كان معاذ يصلي مع النبي صلى الله عليه وسلم ثم يأتي قومه فيصلي بهم‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Mu`adh used to pray with the Prophet and then go and lead his people (tribe) in the prayer.",
      "chain": [
        "20193",
        "20283",
        "20022",
        "11015",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "770",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن أبي عون، قال سمعت جابر بن سمرة، قال قال عمر لسعد لقد شكوك في كل شىء حتى الصلاة‏.‏ قال أما أنا فأمد في الأوليين، وأحذف في الأخريين، ولا آلو ما اقتديت به من صلاة رسول الله صلى الله عليه وسلم‏.‏ قال صدقت، ذاك الظن بك، أو ظني بك‏.‏",
      "text_en": " Narrated Jabir bin Samura:                     `Umar said to Sa`d, \"The people complained against you in everything, even in prayer.\" Sa`d replied, \"Really I used to prolong the first two rak`at and shorten the last two and I will never shorten the prayer in which I follow Allah's Apostle.\" `Umar said, \"You are telling the truth and that is what I think a tout you.\"",
      "chain": [
        "20193",
        "20020",
        "11649",
        "393"
      ]
    },
    {
      "hadith_no": "802",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، قال كان مالك بن الحويرث يرينا كيف كان صلاة النبي صلى الله عليه وسلم وذاك في غير وقت صلاة، فقام فأمكن القيام، ثم ركع فأمكن الركوع، ثم رفع رأسه فأنصت هنية، قال فصلى بنا صلاة شيخنا هذا أبي بريد‏.‏ وكان أبو بريد إذا رفع رأسه من السجدة الآخرة استوى قاعدا ثم نهض‏.‏",
      "text_en": " Narrated Aiyub:                     Abu Qilaba said, \"Malik bin Huwairith used to demonstrate to us the prayer of the Prophet at times other than that of the compulsory prayers. So (once) he stood up for prayer and performed a perfect Qiyam (standing and reciting from the Holy Qur'an) and then bowed and performed bowing perfectly; then he raised his head and stood straight for a while.\" Abu Qilaba added, \"Malik bin Huwairith in that demonstration prayed like this Sheikh of ours, Abu Yazid.\" Abu, Yazid used to sit (for a while) on raising his head from the second prostration before getting up.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "821",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن ثابت، عن أنس  رضى الله عنه  قال إني لا آلو أن أصلي بكم كما رأيت النبي صلى الله عليه وسلم يصلي بنا‏.‏ قال ثابت كان أنس يصنع شيئا لم أركم تصنعونه، كان إذا رفع رأسه من الركوع قام حتى يقول القائل قد نسي‏.‏ وبين السجدتين حتى يقول القائل قد نسي‏.‏",
      "text_en": " Narrated Thabit:                     Anas said, \"I will leave no stone unturned in making you offer the prayer as I have seen the Prophet making us offer it.\" Anas used to do a thing which I have not seen you doing. He used to stand after the bowing for such a long time that one would think that he had forgotten (the prostrations) and he used to sit in-between the prostrations so long that one would think that he had forgotten the second prostration.",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "826",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، قال حدثنا غيلان بن جرير، عن مطرف، قال صليت أنا وعمران، صلاة خلف علي بن أبي طالب  رضى الله عنه  فكان إذا سجد كبر، وإذا رفع كبر، وإذا نهض من الركعتين كبر، فلما سلم أخذ عمران بيدي فقال لقد صلى بنا هذا صلاة محمد صلى الله عليه وسلم‏.‏ أو قال لقد ذكرني هذا صلاة محمد صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Mutarrif:                     `Imran and I prayed behind `Ali bin Abi Talib and he said Takbir on prostrating, on rising and on getting up after the two rak`at (i.e. after the second rak`a). When the prayer was finished, `Imran took me by the hand and said, \"He (`Ali) has prayed the prayer of Muhammad\" (or said, \"He made us remember the prayer of Muhammad).",
      "chain": [
        "20193",
        "20022",
        "11300",
        "11395"
      ]
    },
    {
      "hadith_no": "964",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن عدي بن ثابت، عن سعيد بن جبير، عن ابن عباس، أن النبي صلى الله عليه وسلم صلى يوم الفطر ركعتين، لم يصل قبلها ولا بعدها، ثم أتى النساء ومعه بلال، فأمرهن بالصدقة، فجعلن يلقين، تلقي المرأة خرصها وسخابها‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet offered a two rak`at prayer on the Day of Id ul Fitr and he did not pray before or after it. Then he went towards women along with Bilal and ordered them to pay alms and so they started giving their earrings and necklaces (in charity).",
      "chain": [
        "20193",
        "20020",
        "11372",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "968",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن زبيد، عن الشعبي، عن البراء، قال خطبنا النبي صلى الله عليه وسلم يوم النحر قال ‏\"‏ إن أول ما نبدأ به في يومنا هذا أن نصلي ثم نرجع فننحر، فمن فعل ذلك فقد أصاب سنتنا، ومن ذبح قبل أن يصلي فإنما هو لحم عجله لأهله، ليس من النسك في شىء ‏\"‏‏.‏ فقام خالي أبو بردة بن نيار فقال يا رسول الله، أنا ذبحت قبل أن أصلي وعندي جذعة خير من مسنة‏.‏ قال ‏\"‏ اجعلها مكانها  أو قال اذبحها  ولن تجزي جذعة عن أحد بعدك ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara':                     The Prophet delivered the Khutba on the day of Nahr (`Id-ul-Adha) and said, \"The first thing we should do on this day of ours is to pray and then return and slaughter (our sacrifices). So anyone who does so he acted according to our Sunna; and whoever slaughtered before the prayer then it was just meat that he offered to his family and would not be considered as a sacrifice in any way. My uncle Abu Burda bin Niyyar got up and said, \"O, Allah's Apostle! I slaughtered the sacrifice before the prayer but I have a young she-goat which is better than an older sheep.\" The Prophet said, \"Slaughter it in lieu of the first and such a goat will not be considered as a sacrifice for anybody else after you.\"",
      "chain": [
        "20193",
        "20020",
        "11335",
        "11052",
        "400"
      ]
    },
    {
      "hadith_no": "1069",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا سليمان بن حرب، وأبو النعمان، قالا حدثنا حماد، عن أيوب، عن عكرمة، عن ابن عباس  رضى الله عنهما  قال ‏{‏ص‏}‏ ليس من عزائم السجود، وقد رأيت النبي صلى الله عليه وسلم يسجد فيها‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The prostration of Sa`d is not a compulsory one but I saw the Prophet prostrating while reciting it.",
      "chain": [
        "20193",
        "20283",
        "20022",
        "11015",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1135",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، عن الأعمش، عن أبي وائل، عن عبد الله  رضى الله عنه  قال صليت مع النبي صلى الله عليه وسلم ليلة، فلم يزل قائما حتى هممت بأمر سوء‏.‏ قلنا وما هممت قال هممت أن أقعد وأذر النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu-Wail:                     `Abdullah said, \"One night I offered the Tahajjud prayer with the Prophet and he kept on standing till an ill-thought came to me.\" We said, \"What was the ill-thought?\" He said, \"It was to sit down and leave the Prophet (standing).\"",
      "chain": [
        "20193",
        "20020",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "1180",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، عن نافع، عن ابن عمر  رضى الله عنهما  قال حفظت من النبي صلى الله عليه وسلم عشر ركعات ركعتين قبل الظهر، وركعتين بعدها، وركعتين بعد المغرب في بيته، وركعتين بعد العشاء في بيته، وركعتين قبل صلاة الصبح، وكانت ساعة لا يدخل على النبي صلى الله عليه وسلم فيها‏.‏ حدثتني حفصة، أنه كان إذا أذن المؤذن وطلع الفجر صلى ركعتين‏.‏",
      "text_en": "      Narrated Ibn 'Umar:                          I remember ten Rakat of Nawafil from the Prophet, two Rakat before the Zuhr prayer and two after it; two Rakat after Maghrib prayer in his house, and two Rakat after 'Isha' prayer in his house, and two Rakat before the Fajr prayer and at that time nobody would enter the house of the Prophet.Hafsa told me that the Prophet used to offer two Rakat after the call maker had made the Adhan and the day had dawned.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1213",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن أيوب، عن نافع، عن ابن عمر  رضى الله عنهما  أن النبي صلى الله عليه وسلم رأى نخامة في قبلة المسجد، فتغيظ على أهل المسجد وقال ‏\"‏ إن الله قبل أحدكم، فإذا كان في صلاته، فلا يبزقن  أو قال  لا يتنخمن ‏\"‏‏.‏ ثم نزل فحتها بيده‏.‏ وقال ابن عمر  رضى الله عنهما  إذا بزق أحدكم فليبزق على يساره‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet saw some sputum on the wall facing the Qibla of the mosque and became furious with the people of the mosque and said, \"During the prayer, Allah is in front of everyone of you and so he should not spit (or said, 'He should not expectorate').\" Then he got down and scratched the sputum with his hand. Ibn `Umar said (after narrating), \"If anyone of you has to spit during the prayer, he should spit to his left.\"",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1228",
      "source": " Sahih Bukhari ",
      "chapter": "Forgetfulness in Prayer - كتاب السهو",
      "chapter_no": "22",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن سلمة بن علقمة، قال قلت لمحمد في سجدتى السهو تشهد قال ليس في حديث أبي هريرة‏.‏",
      "text_en": " Narrated Salama bin 'Alqama:                     I asked Muhammad (bin Seereen) whether Tashah-hud should be recited after the two prostrations of Sahu. He replied, \"It is not (mentioned) in Abu Huraira's narration . \"",
      "chain": [
        "20193",
        "20022",
        "11593"
      ]
    },
    {
      "hadith_no": "1322",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن الشيباني، عن الشعبي، قال أخبرني من، مر مع نبيكم صلى الله عليه وسلم على قبر منبوذ فأمنا فصففنا خلفه‏.‏ فقلنا يا أبا عمرو من حدثك قال ابن عباس رضى الله عنهما‏.‏",
      "text_en": " Narrated Ash-Shaibani:                     Ash-Shu`bi said, \"Somebody who passed along with your Prophet (p.b.u.h) by a grave that was separate from the other graves informed me (saying), \"The Prophet led us (in the prayer) and we aligned behind him.\" We said, \"O Abu `Amr! Who told you this narration?\" He replied, \"Ibn `Abbas.\"",
      "chain": [
        "20193",
        "20020",
        "11352",
        "11052"
      ]
    },
    {
      "hadith_no": "1356",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد  وهو ابن زيد  عن ثابت، عن أنس  رضى الله عنه  قال كان غلام يهودي يخدم النبي صلى الله عليه وسلم فمرض، فأتاه النبي صلى الله عليه وسلم يعوده، فقعد عند رأسه فقال له ‏\"‏ أسلم ‏\"‏‏.‏ فنظر إلى أبيه وهو عنده فقال له أطع أبا القاسم صلى الله عليه وسلم‏.‏ فأسلم، فخرج النبي صلى الله عليه وسلم وهو يقول ‏\"‏ الحمد لله الذي أنقذه من النار ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     A young Jewish boy used to serve the Prophet and he became sick. So the Prophet went to visit him. He sat near his head and asked him to embrace Islam. The boy looked at his father, who was sitting there; the latter told him to obey Abul-Qasim and the boy embraced Islam. The Prophet came out saying: \"Praises be to Allah Who saved the boy from the Hell-fire.\"",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "1438",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن أبي إسحاق، قال سمعت عبد الله بن معقل، قال سمعت عدي بن حاتم  رضى الله عنه  قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ اتقوا النار ولو بشق تمرة ‏\"‏‏.‏",
      "text_en": " Narrated `Adi bin Hatim heard the Prophet saying:                     \"Save yourself from Hell-fire even by giving half a date-fruit in charity.\"",
      "chain": [
        "20193",
        "20020",
        "11049",
        "18580",
        "212"
      ]
    },
    {
      "hadith_no": "1572",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن أنس  رضى الله عنه  قال صلى النبي صلى الله عليه وسلم بالمدينة الظهر أربعا، والعصر بذي الحليفة ركعتين، وسمعتهم يصرخون بهما جميعا‏.‏",
      "text_en": " Narrated Anas:                     The Prophet offered four rak`at of the Zuhr prayer in Medina and two rak`at of the `Asr prayer in Dhul-Hulaifa and I heard them (the companions of the Prophet) reciting Talbiya together loudly to the extent of shouting.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "1627",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد  هو ابن زيد  عن أيوب، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال قدم رسول الله صلى الله عليه وسلم وأصحابه فقال المشركون إنه يقدم عليكم، وقد وهنهم حمى يثرب‏.‏ فأمرهم النبي صلى الله عليه وسلم أن يرملوا الأشواط الثلاثة، وأن يمشوا ما بين الركنين، ولم يمنعه أن يأمرهم أن يرملوا الأشواط كلها إلا الإبقاء عليهم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When Allah's Apostle and his companions came to Mecca, the pagans circulated the news that a group of people were coming to them and they had been weakened by the Fever of Yathrib (Medina). So the Prophet ordered his companions to do Ramal in the first three rounds of Tawaf of the Ka`ba and to walk between the two corners (The Black Stone and Yemenite corner). The Prophet did not order them to do Ramal in all the rounds of Tawaf out of pity for them.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1703",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أيوب، عن عكرمة، عن ابن عباس  رضى الله عنهما  قال بعثني رسول الله صلى الله عليه وسلم من جمع بليل‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle had sent me from Jam' (i.e. Al-Muzdalifa) at night.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1850",
      "source": " Sahih Bukhari ",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن منصور، عن أبي حازم، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حج هذا البيت، فلم يرفث ولم يفسق، رجع كما ولدته أمه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Whoever performs Hajj to this House (Ka`ba) and does not approach his wife for sexual relations nor commits sins (while performing Hajj), he will come out as sinless as a newlyborn child. (Just delivered by his mother).",
      "chain": [
        "20193",
        "20020",
        "11067",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "1880",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن عمرو بن دينار، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال بينا رجل واقف مع النبي صلى الله عليه وسلم بعرفة إذ وقع عن راحلته، فوقصته  أو قال فأقعصته  فقال النبي صلى الله عليه وسلم ‏\"‏ اغسلوه بماء وسدر، وكفنوه في ثوبين  أو قال ثوبيه  ولا تحنطوه، ولا تخمروا رأسه، فإن الله يبعثه يوم القيامة يلبي ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     While a man was standing with the Prophet at `Arafat, he fell from his Mount and his neck was crushed by it. The Prophet said, \"Wash the deceased with water and Sidr and shroud him in two pieces of cloth, and neither perfume him nor cover his head, for Allah will resurrect him on the Day of Resurrection and he will be reciting Talbiya.\"",
      "chain": [
        "20193",
        "20022",
        "11081",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1881",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن أيوب، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال بينا رجل واقف مع النبي صلى الله عليه وسلم بعرفة إذ وقع عن راحلته فوقصته  أو قال فأوقصته  فقال النبي صلى الله عليه وسلم ‏\"‏ اغسلوه بماء وسدر، وكفنوه في ثوبين، ولا تمسوه طيبا، ولا تخمروا رأسه، ولا تحنطوه، فإن الله يبعثه يوم القيامة ملبيا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     While a man was standing with the Prophet at `Arafat, he fell from his Mount and his neck was crushed by it. The Prophet said, \"Wash the deceased with water and Sidr and shroud him in two pieces of cloth, and neither perfume him nor cover his head, for Allah will resurrect him on the Day of Resurrection and he will be reciting Talbiya.\"",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1895",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن عبد الملك بن عمير، عن قزعة، مولى زياد قال سمعت أبا سعيد  وقد غزا مع النبي صلى الله عليه وسلم ثنتى عشرة  غزوة  قال أربع سمعتهن من رسول الله صلى الله عليه وسلم أو قال يحدثهن عن النبي صلى الله عليه وسلم  فأعجبنني وآنقنني ‏\"‏ أن لا تسافر امرأة مسيرة يومين ليس معها زوجها أو ذو محرم، ولا صوم يومين الفطر والأضحى، ولا صلاة بعد صلاتين بعد العصر حتى تغرب الشمس، وبعد الصبح حتى تطلع الشمس، ولا تشد الرحال إلا إلى ثلاثة مساجد مسجد الحرام، ومسجدي، ومسجد الأقصى ‏\"‏‏.‏",
      "text_en": " Narrated Qaza'a the slave of Ziyad:                     Abu Sa`id who participated in twelve Ghazawat with the Prophet said, \"I heard four things from Allah's Apostle (or I narrate them from the Prophet ) which won my admiration and appreciation. They are: -1. \"No lady should travel without her husband or without a Dhu-Mahram for a two-days' journey. -2. No fasting is permissible on two days of `Id-ul-Fitr, and `Id-al-Adha. -3. No prayer (may be offered) after two prayers: after the `Asr prayer till the sun set and after the morning prayer till the sun rises. -4. Not to travel (for visiting) except for three mosques: Masjid-al-Haram (in Mecca), my Mosque (in Medina), and Masjid-al-Aqsa (in Jerusalem).",
      "chain": [
        "20193",
        "20020",
        "11368",
        "11302"
      ]
    },
    {
      "hadith_no": "1917",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن عدي بن ثابت، عن عبد الله بن يزيد، قال سمعت زيد بن ثابت  رضى الله عنه  يقول لما خرج النبي صلى الله عليه وسلم إلى أحد رجع ناس من أصحابه فقالت فرقة نقتلهم‏.‏ وقالت فرقة لا نقتلهم‏.‏ فنزلت ‏{‏فما لكم في المنافقين فئتين‏}‏ وقال النبي صلى الله عليه وسلم ‏\"‏ إنها تنفي الرجال كما تنفي النار خبث الحديد ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Thabit:                     When the Prophet went out for (the battle of) Uhud, some of his companions (hypocrites) returned (home). A party of the believers remarked that they would kill those (hypocrites) who had returned, but another party said that they would not kill them. So, this Divine Inspiration was revealed: \"Then what is the matter with you that you are divided into two parties concerning the hypocrites.\" (4.88) The Prophet said, \"Medina expels the bad persons from it, as fire expels the impurities of iron.\"",
      "chain": [
        "20193",
        "20020",
        "11372",
        "1945",
        "49"
      ]
    },
    {
      "hadith_no": "1927",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا سليمان بن حرب، قال عن شعبة، عن الحكم، عن إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  قالت كان النبي صلى الله عليه وسلم يقبل ويباشر، وهو صائم، وكان أملككم لإربه‏.‏ وقال قال ابن عباس ‏{‏مآرب‏}‏ حاجة‏.‏ قال طاوس ‏{‏أولي الإربة‏}‏ الأحمق لا حاجة له في النساء‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to kiss and embrace (his wives) while he was fasting, and he had more power to control his desires than any of you. Said Jabir, \"The person who gets discharge after casting a look (on his wife) should complete his fast.\"",
      "chain": [
        "20193",
        "20020",
        "11069",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2079",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن قتادة، عن صالح أبي الخليل، عن عبد الله بن الحارث، رفعه إلى حكيم بن حزام  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ البيعان بالخيار ما لم يتفرقا  أو قال حتى يتفرقا  فإن صدقا وبينا بورك لهما في بيعهما، وإن كتما وكذبا محقت بركة بيعهما ‏\"‏‏.‏",
      "text_en": " Narrated Hakim bin Hizam:                     Allah's Apostle said, \"The seller and the buyer have the right to keep or return goods as long as they have not parted or till they part; and if both the parties spoke the truth and described the defects and qualities (of the goods), then they would be blessed in their transaction, and if they told lies or hid something, then the blessings of their transaction would be lost.\"",
      "chain": [
        "20193",
        "20020",
        "11019",
        "11291"
      ]
    },
    {
      "hadith_no": "2228",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن ثابت، عن أنس  رضى الله عنه  قال كان في السبى صفية، فصارت إلى دحية الكلبي، ثم صارت إلى النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas:                     Amongst the captives was Safiya. First she was given to Dihya Al-Kalbi and then to the Prophet.",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "2268",
      "source": " Sahih Bukhari ",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن أيوب، عن نافع، عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ مثلكم ومثل أهل الكتابين كمثل رجل استأجر أجراء فقال من يعمل لي من غدوة إلى نصف النهار على قيراط فعملت اليهود، ثم قال من يعمل لي من نصف النهار إلى صلاة العصر على قيراط فعملت النصارى ثم، قال من يعمل لي من العصر إلى أن تغيب الشمس على قيراطين فأنتم هم، فغضبت اليهود والنصارى، فقالوا ما لنا أكثر عملا، وأقل عطاء قال هل نقصتكم من حقكم قالوا لا‏.‏ قال فذلك فضلي أوتيه من أشاء ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"Your example and the example of the people of the two Scriptures (i.e. Jews and Christians) is like the example of a man who employed some laborers and asked them, 'Who will work for me from morning till midday for one Qirat?' The Jews accepted and carried out the work. He then asked, Who will work for me from midday up to the `Asr prayer for one Qirat?' The Christians accepted and fulfilled the work. He then said, 'Who will work for me from the `Asr till sunset for two Qirats?' You, Muslims have accepted the offer. The Jews and the Christians got angry and said, 'Why should we work more and get lesser wages?' (Allah) said, 'Have I withheld part of your right?' They replied in the negative. He said, 'It is My Blessing, I bestow upon whomever I wish .'",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2306",
      "source": " Sahih Bukhari ",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن سلمة بن كهيل، سمعت أبا سلمة بن عبد الرحمن، عن أبي هريرة  رضى الله عنه  أن رجلا، أتى النبي صلى الله عليه وسلم يتقاضاه، فأغلظ، فهم به أصحابه فقال رسول الله صلى الله عليه وسلم ‏\"‏ دعوه فإن لصاحب الحق مقالا ‏\"‏‏.‏ ثم قال ‏\"‏ أعطوه سنا مثل سنه ‏\"‏‏.‏ قالوا يا رسول الله لا نجد إلا أمثل من سنه‏.‏ فقال ‏\"‏ أعطوه فإن من خيركم أحسنكم قضاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     A man came to the Prophet demanding his debts and behaved rudely. The companions of the Prophet intended to harm him, but Allah's Apostle said (to them), \"Leave him, for the creditor (i.e. owner of a right) has the right to speak.\" Allah's Apostle then said, \"Give him a camel of the same age as that of his.\" The people said, \"O Allah's Apostle! There is only a camel that is older than his.\" Allah's Apostle said, \"Give (it to) him, for the best amongst you is he who pays the rights of others handsomely.\"",
      "chain": [
        "20193",
        "20020",
        "11350",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2343",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن أيوب، عن نافع، أن ابن عمر  رضى الله عنهما  كان يكري مزارعه على عهد النبي صلى الله عليه وسلم وأبي بكر وعمر وعثمان وصدرا من إمارة معاوية‏.‏ ثم حدث عن رافع بن خديج، أن النبي صلى الله عليه وسلم نهى عن كراء المزارع، فذهب ابن عمر إلى رافع فذهبت معه، فسأله فقال نهى النبي صلى الله عليه وسلم عن كراء المزارع‏.‏ فقال ابن عمر قد علمت أنا كنا نكري مزارعنا على عهد رسول الله صلى الله عليه وسلم بما على الأربعاء وبشىء من التبن‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar used to rent his farms in the time of Abu Bakr, `Umar, `Uthman, and in the early days of Muawiya. Then he was told the narration of Rafi` 'bin Khadij that the Prophet had forbidden the renting of farms. Ibn `Umar went to Rafi` and I accompanied him. He asked Rafi` who replied that the Prophet had forbidden the renting of farms. Ibn `Umar said, \"You know that we used to rent our farms in the lifetime of Allah's Apostle for the yield of the banks of the water streams (rivers) and for certain amount of figs.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2376",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن يحيى بن سعيد، قال سمعت أنسا  رضى الله عنه  قال أراد النبي صلى الله عليه وسلم أن يقطع من البحرين، فقالت الأنصار حتى تقطع لإخواننا من المهاجرين مثل الذي تقطع لنا قال ‏\"‏ سترون بعدي أثرة فاصبروا حتى تلقوني ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet decided to grant a portion of (the uncultivated land of) Bahrain to the Ansar. The Ansar said, \"(We will not accept it) till you give a similar portion to our emigrant brothers (from Quraish).\" He said, \"(O Ansar!) You will soon see people giving preference to others, so remain patient till you meet me (on the Day of Resurrection).",
      "chain": [
        "20193",
        "20022",
        "20031",
        "19"
      ]
    },
    {
      "hadith_no": "2437",
      "source": " Sahih Bukhari ",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن سلمة بن كهيل، قال سمعت سويد بن غفلة، قال كنت مع سلمان بن ربيعة، وزيد بن صوحان في غزاة، فوجدت سوطا‏.‏ فقال لي ألقه‏.‏ قلت لا، ولكن إن وجدت صاحبه، وإلا استمتعت به‏.‏ فلما رجعنا حججنا فمررت بالمدينة، فسألت أبى بن كعب  رضى الله عنه  فقال وجدت صرة على عهد النبي صلى الله عليه وسلم فيها مائة دينار، فأتيت بها النبي صلى الله عليه وسلم فقال ‏\"‏ عرفها حولا ‏\"‏‏.‏ فعرفتها حولا ثم أتيت، فقال ‏\"‏ عرفها حولا ‏\"‏‏.‏ فعرفتها حولا ثم أتيته، فقال ‏\"‏ عرفها حولا ‏\"‏‏.‏ فعرفتها حولا ثم أتيته الرابعة فقال ‏\"‏ اعرف عدتها ووكاءها ووعاءها، فإن جاء صاحبها وإلا استمتع بها ‏\"‏‏.‏",
      "text_en": " Narrated Suwaid bin Ghafala:                     While I as in the company of Salman bin Rabi`a and Suhan, in one of the holy battles, I found a whip. One of them told me to drop it but I refused to do so and said that I would give it to its owner if I found him, otherwise I would utilize it. On our return we performed Hajj and on passing by Medina, I asked Ubai bin Ka`b about it. He said, \"I found a bag containing a hundred Dinars in the lifetime of the Prophet and took it to the Prophet who said to me, 'Make public announcement about it for one year.' So, I announced it for one year and went to the Prophet who said, 'Announce it publicly for another year.' So, I announced it for another year. I went to him again and he said, \"Announce for an other year.\" So I announced for still another year. I went to the Prophet for the fourth time, and he said, 'Remember the amount of money, the description of its container and the string it is tied with, and if the owner comes, give it to him; otherwise, utilize it.' \"",
      "chain": [
        "20193",
        "20020",
        "11350",
        "11174"
      ]
    },
    {
      "hadith_no": "2471",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا سليمان بن حرب، عن شعبة، عن منصور، عن أبي وائل، عن حذيفة  رضى الله عنه  قال لقد رأيت رسول الله صلى الله عليه وسلم، أو قال لقد أتى النبي صلى الله عليه وسلم سباطة قوم فبال قائما‏.‏",
      "text_en": " Narrated Hudhaifa:                     I saw Allah's Apostle coming (or the Prophet came) to the dumps of some people and urinated there while standing .",
      "chain": [
        "20193",
        "20020",
        "11067",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "2572",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن هشام بن زيد بن أنس بن مالك، عن أنس  رضى الله عنه  قال أنفجنا أرنبا بمر الظهران، فسعى القوم فلغبوا، فأدركتها فأخذتها، فأتيت بها أبا طلحة فذبحها، وبعث بها إلى رسول الله صلى الله عليه وسلم بوركها  أو فخذيها قال فخذيها لا شك فيه  فقبله‏.‏ قلت وأكل منه قال وأكل منه‏.‏ ثم قال بعد قبله‏.‏",
      "text_en": " Narrated Anas:                     We chased a rabbit at Mar-al-Zahran and the people ran after it but were exhausted. I overpowered and caught it, and gave it to Abu Talha who slaughtered it and sent its hip or two thighs to Allah's Apostle. (The narrator confirms that he sent two thighs). The Prophet accepted that. (The sub-narrator asked Anas, \"Did the Prophet; eat from it?\" Anas replied, \"He ate from it.\")",
      "chain": [
        "20193",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "hadith_no": "2580",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت كان الناس يتحرون بهداياهم يومي‏.‏ وقالت أم سلمة إن صواحبي اجتمعن‏.‏ فذكرت له، فأعرض عنها‏.‏",
      "text_en": " Narrated `Aisha:                     The people used to send gifts to the Prophet on the day of my turn. Um Salama said: \"My companions (the wives of the Prophet Other than Aisha) gathered and they complained about it. So I informed the Prophet about it on their behalf, but he remained silent.",
      "chain": [
        "20193",
        "20022",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2642",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن ثابت، عن أنس  رضى الله عنه  قال مر على النبي صلى الله عليه وسلم بجنازة، فأثنوا عليها خيرا فقال ‏\"‏ وجبت ‏\"‏‏.‏ ثم مر بأخرى فأثنوا عليها شرا  أو قال غير ذلك  فقال ‏\"‏ وجبت ‏\"‏‏.‏ فقيل يا رسول الله، قلت لهذا وجبت، ولهذا وجبت، قال ‏\"‏ شهادة القوم، المؤمنون شهداء الله في الأرض ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     A funeral procession passed in front of the Prophet and the people praised the deceased. The Prophet said, \"It has been affirmed (Paradise).\" Then another funeral procession passed by and the people talked badly of the deceased. The Prophet said, \"It has been affirmed (Hell).\" Allah's Apostle was asked, \"O Allah's Apostle! You said it has been affirmed for both?\" The Prophet said, \"The testimony of the people (is accepted), (for) the believer are Allah's witnesses on the earth.\"",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "2810",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن عمرو، عن أبي وائل، عن أبي موسى  رضى الله عنه  قال جاء رجل إلى النبي صلى الله عليه وسلم فقال الرجل يقاتل للمغنم، والرجل يقاتل للذكر، والرجل يقاتل ليرى مكانه، فمن في سبيل الله قال ‏\"‏ من قاتل لتكون كلمة الله هي العليا فهو في سبيل الله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     A man came to the Prophet and asked, \"A man fights for war booty; another fights for fame and a third fights for showing off; which of them fights in Allah's Cause?\" The Prophet said, \"He who fights that Allah's Word (i.e. Islam) should be superior, fights in Allah's Cause.\"",
      "chain": [
        "20193",
        "20020",
        "20377",
        "11353",
        "41"
      ]
    },
    {
      "hadith_no": "2839",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد  هو ابن زيد  عن حميد، عن أنس  رضى الله عنه  أن النبي صلى الله عليه وسلم كان في غزاة فقال ‏\"‏ إن أقواما بالمدينة خلفنا، ما سلكنا شعبا ولا واديا إلا وهم معنا فيه، حبسهم العذر ‏\"‏‏.‏   وقال موسى حدثنا حماد، عن حميد، عن موسى بن أنس، عن أبيه، قال النبي صلى الله عليه وسلم‏.‏ قال أبو عبد الله الأول أصح‏.‏",
      "text_en": " Narrated Anas:                     While the Prophet was in a Ghazwa he said, \"Some people have remained behind us in Medina and we never crossed a mountain path or a valley, but they were with us (i.e. sharing the reward with us), as they have been held back by a (legal) excuse. \"",
      "chain": [
        "20193",
        "20022",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "2896",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا محمد بن طلحة، عن طلحة، عن مصعب بن سعد، قال رأى سعد  رضى الله عنه  أن له فضلا على من دونه، فقال النبي صلى الله عليه وسلم ‏\"‏ هل تنصرون وترزقون إلا بضعفائكم ‏\"‏‏.‏",
      "text_en": " Narrated Mus`ab bin Sa`d:                     Once Sa`d (bin Abi Waqqas) thought that he was superior to those who were below him in rank. On that the Prophet said, \"You gain no victory or livelihood except through (the blessings and invocations of) the poor amongst you.\"",
      "chain": [
        "20193",
        "20604",
        "11356",
        "10556"
      ]
    },
    {
      "hadith_no": "2908",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن ثابت، عن أنس  رضى الله عنه  قال كان النبي صلى الله عليه وسلم أحسن الناس وأشجع الناس، ولقد فزع أهل المدينة ليلة فخرجوا نحو الصوت فاستقبلهم النبي صلى الله عليه وسلم وقد استبرأ الخبر، وهو على فرس لأبي طلحة عرى وفي عنقه السيف وهو يقول ‏\"‏ لم تراعوا لم تراعوا ‏\"‏‏.‏ ثم قال ‏\"‏ وجدناه بحرا ‏\"‏‏.‏ أو قال ‏\"‏ إنه لبحر ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The 'Prophet was the best and the bravest amongst the people. Once the people of Medina got terrified at night, so they went in the direction of the noise (that terrified them). The Prophet met them (on his way back) after he had found out the truth. He was riding an unsaddled horse belonging to Abu Talha and a sword was hanging by his neck, and he was saying, \"Don't be afraid! Don't be afraid!\" He further said, \"I found it (i.e. the horse) very fast,\" or said, \"This horse is very fast.\" (Qastala-ni)",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "2935",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن أيوب، عن ابن أبي مليكة، عن عائشة  رضى الله عنها  أن اليهود، دخلوا على النبي صلى الله عليه وسلم فقالوا السام عليك‏.‏ فلعنتهم‏.‏ فقال ‏\"‏ ما لك ‏\"‏‏.‏ قلت أولم تسمع ما قالوا قال ‏\"‏ فلم تسمعي ما قلت وعليكم ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Once the Jews came to the Prophet and said, \"Death be upon you.\" So I cursed them. The Prophet said, \"What is the matter?\" I said, \"Have you not heard what they said?\" The Prophet said, \"Have you not heard what I replied (to them)? (I said), ('The same is upon you.')\"",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11090",
        "53"
      ]
    },
    {
      "hadith_no": "2951",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن أيوب، عن أبي قلابة، عن أنس  رضى الله عنه أن النبي صلى الله عليه وسلم صلى بالمدينة الظهر أربعا، والعصر بذي الحليفة ركعتين، وسمعتهم يصرخون بهما جميعا‏.‏",
      "text_en": " Narrated Anas:                     The Prophet offered a four-rak`at Zuhr prayer at Medina and then offered a two rak`at `Asr prayer at Dhul-Hulaifa and I heard the companions of the Prophet reciting Talbiya aloud (for Hajj and `Umra) altogether.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "3043",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن سعد بن إبراهيم، عن أبي أمامة  هو ابن سهل بن حنيف  عن أبي سعيد الخدري  رضى الله عنه  قال لما نزلت بنو قريظة على حكم سعد  هو ابن معاذ  بعث رسول الله صلى الله عليه وسلم، وكان قريبا منه، فجاء على حمار، فلما دنا قال رسول الله صلى الله عليه وسلم ‏\"‏ قوموا إلى سيدكم ‏\"‏‏.‏ فجاء فجلس إلى رسول الله صلى الله عليه وسلم فقال له ‏\"‏ إن هؤلاء نزلوا على حكمك ‏\"‏‏.‏ قال فإني أحكم أن تقتل المقاتلة، وأن تسبى الذرية‏.‏ قال ‏\"‏ لقد حكمت فيهم بحكم الملك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     When the tribe of Bani Quraiza was ready to accept Sa`d's judgment, Allah's Apostle sent for Sa`d who was near to him. Sa`d came, riding a donkey and when he came near, Allah's Apostle said (to the Ansar), \"Stand up for your leader.\" Then Sa`d came and sat beside Allah's Apostle who said to him. \"These people are ready to accept your judgment.\" Sa`d said, \"I give the judgment that their warriors should be killed and their children and women should be taken as prisoners.\" The Prophet then remarked, \"O Sa`d! You have judged amongst them with (or similar to) the judgment of the King Allah.\"",
      "chain": [
        "20193",
        "20020",
        "11063",
        "405",
        "38"
      ]
    },
    {
      "hadith_no": "3087",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن محارب بن دثار، قال سمعت جابر بن عبد الله، رضى الله عنهما قال كنت مع النبي صلى الله عليه وسلم في سفر فلما قدمنا المدينة قال لي ‏\"‏ ادخل المسجد فصل ركعتين ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     I was on a journey in the company of the Prophet and when we reached Medina, he said to me, \"Enter the Mosque and offer two rak`at.\"",
      "chain": [
        "20193",
        "20020",
        "11389",
        "34"
      ]
    },
    {
      "hadith_no": "3188",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن أيوب، عن نافع، عن ابن عمر  رضى الله عنهما  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لكل غادر لواء ينصب لغدرته ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"Every betrayer will have a flag which will be fixed on the Day of Resurrection, and the flag's prominence will be made in order to show the betrayal he committed.\"",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3563",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن أيوب، عن محمد، عن أبي هريرة  رضى الله عنه  قال قال أسلم وغفار وشىء من مزينة وجهينة  أو قال شىء من جهينة أو مزينة  خير عند الله  أو قال  يوم القيامة من أسد وتميم وهوازن وغطفان‏.‏",
      "text_en": " Narrated Abu Hurairah (ra):                      The Prophet () said, (The people of) Aslam, Ghifar and some people of Muzaina and Juhaina or said (some people of Juhaina or Muzaina) are better with Allah or said (on the Day of resurrection) than the tribe of Asad, Tamim, Hawazin and Ghatafan.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "20278",
        "13"
      ]
    },
    {
      "hadith_no": "3568",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن قتادة، عن أنس  رضى الله عنه  قال دعا النبي صلى الله عليه وسلم الأنصار فقال ‏\"‏ هل فيكم أحد من غيركم ‏\"‏‏.‏ قالوا لا، إلا ابن أخت لنا‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ابن أخت القوم منهم ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet sent for the Ansar (and when they came), he asked, 'Is there any stranger amongst you?\" They said, \"No except the son of our sister.\" Allah's Apostle said, \"The son of the sister of some people belongs to them.\"",
      "chain": [
        "20193",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "3601",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن ثابت، عن أنس  رضى الله عنه  قال ما مسست حريرا ولا ديباجا ألين من كف النبي صلى الله عليه وسلم، ولا شممت ريحا قط أو عرفا قط أطيب من ريح أو عرف النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas:                     I have never touched silk or Dibaj (i.e. thick silk) softer than the palm of the Prophet nor have I smelt a perfume nicer than the sweat of the Prophet.",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3634",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا جرير بن حازم، سمعت الحسن، يقول حدثنا عمرو بن تغلب، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ بين يدى الساعة تقاتلون قوما ينتعلون الشعر، وتقاتلون قوما كأن وجوههم المجان المطرقة ‏\"‏‏.‏",
      "text_en": " Narrated `Umar bin Taghlib:                     I heard Allah's Apostle saying, \"Near the Hour you will fight with people who will wear hairy shoes; and you will also fight people with flat faces like shields.\"",
      "chain": [
        "20193",
        "11272",
        "11016",
        "5200"
      ]
    },
    {
      "hadith_no": "3673",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أيوب، عن حميد بن هلال، عن أنس بن مالك  رضى الله عنه  أن النبي صلى الله عليه وسلم نعى جعفرا وزيدا قبل أن يجيء خبرهم، وعيناه تذرفان‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet had informed us of the death of Ja`far and Zaid before the news of their death reached us, and his eyes were shedding tears.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11281",
        "19"
      ]
    },
    {
      "hadith_no": "3702",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا سليمان بن حرب، أخبرنا حماد بن زيد، عن أيوب، عن عبد الله بن أبي مليكة، قال كتب أهل الكوفة إلى ابن الزبير في الجد‏.‏ فقال أما الذي قال رسول الله صلى الله عليه وسلم ‏\"‏ لو كنت متخذا من هذه الأمة خليلا لاتخذته ‏\"‏‏.‏ أنزله أبا يعني أبا بكر‏.‏",
      "text_en": " Narrated `Abdullah bin Abi Mulaika:                     The people of Kufa sent a letter to Ibn Az-Zubair, asking about (the inheritance of) (paternal) grandfather. He replied that the right of the inheritance of (paternal) grandfather is the same as that of father if the father is dead) and added, \"Allah's Apostle said, ' If I were to take a Khalil from this nation, I would have taken him (i.e. Abu Bakr).",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11090"
      ]
    },
    {
      "hadith_no": "3732",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن ثابت، عن أنس  رضى الله عنه  أن رجلا، سأل النبي صلى الله عليه وسلم عن الساعة، فقال متى الساعة قال ‏\"‏ وماذا أعددت لها ‏\"‏‏.‏ قال لا شىء إلا أني أحب الله ورسوله صلى الله عليه وسلم‏.‏ فقال ‏\"‏ أنت مع من أحببت ‏\"‏‏.‏ قال أنس فما فرحنا بشىء فرحنا بقول النبي صلى الله عليه وسلم ‏\"‏ أنت مع من أحببت ‏\"‏‏.‏ قال أنس فأنا أحب النبي صلى الله عليه وسلم وأبا بكر وعمر، وأرجو أن أكون معهم بحبي إياهم، وإن لم أعمل بمثل أعمالهم‏.‏",
      "text_en": " Narrated Anas:                     A man asked the Prophet about the Hour (i.e. Day of Judgment) saying, \"When will the Hour be?\" The Prophet said, \"What have you prepared for it?\" The man said, \"Nothing, except that I love Allah and His Apostle.\" The Prophet said, \"You will be with those whom you love.\" We had never been so glad as we were on hearing that saying of the Prophet (i.e., \"You will be with those whom you love.\") Therefore, I love the Prophet, Abu Bakr and `Umar, and I hope that I will be with them because of my love for them though my deeds are not similar to theirs.",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3741",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن أيوب، عن أبي عثمان، عن أبي موسى  رضى الله عنه  أن النبي صلى الله عليه وسلم دخل حائطا وأمرني بحفظ باب الحائط، فجاء رجل يستأذن، فقال ‏\"‏ ائذن له وبشره بالجنة ‏\"‏‏.‏ فإذا أبو بكر، ثم جاء آخر يستأذن فقال ‏\"‏ ائذن له وبشره بالجنة ‏\"‏‏.‏ فإذا عمر، ثم جاء آخر يستأذن، فسكت هنيهة ثم قال ‏\"‏ ائذن له وبشره بالجنة على بلوى ستصيبه ‏\"‏‏.‏ فإذا عثمان بن عفان‏.‏ قال حماد وحدثنا عاصم الأحول، وعلي بن الحكم، سمعا أبا عثمان، يحدث عن أبي موسى، بنحوه، وزاد فيه عاصم أن النبي صلى الله عليه وسلم كان قاعدا في مكان فيه ماء، قد انكشفت عن ركبتيه أو ركبته، فلما دخل عثمان غطاها‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet entered a garden and ordered me to guard its gate. A man came and asked permission to enter. The Prophet said, \"Admit him and give him the glad tidings of entering Paradise.\" Behold! It was Abu Bakr. Another man came and asked the permission to enter. The Prophet said, \"Admit him and give him the glad tidings of entering Paradise.\" Behold! It was `Umar. Then another man came, asking the permission to enter. The Prophet kept silent for a short while and then said, \"Admit him and give him the glad tidings of entering Paradise with a calamity which will befall him.\" Behold! It was `Uthman bin `Affan. `Asim, in another narration, said that the Prophet was sitting in a place where there was water, and he was uncovering both his knees or his knee, and when `Uthman entered, he covered them (or it).",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11113",
        "41"
      ]
    },
    {
      "hadith_no": "3788",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن مغيرة، عن إبراهيم، قال ذهب علقمة إلى الشأم، فلما دخل المسجد قال اللهم يسر لي جليسا صالحا‏.‏ فجلس إلى أبي الدرداء فقال أبو الدرداء ممن أنت قال من أهل الكوفة‏.‏ قال أليس فيكم  أو منكم  صاحب السر الذي لا يعلمه غيره يعني حذيفة‏.‏ قال قلت بلى‏.‏ قال أليس فيكم  أو منكم  الذي أجاره الله على لسان نبيه صلى الله عليه وسلم يعني من الشيطان، يعني عمارا‏.‏ قلت بلى‏.‏ قال أليس فيكم  أو منكم  صاحب السواك أو السرار قال بلى‏.‏ قال كيف كان عبد الله يقرأ ‏{‏والليل إذا يغشى * والنهار إذا تجلى‏}‏ قلت ‏{‏والذكر والأنثى‏}‏‏.‏ قال ما زال بي هؤلاء حتى كادوا يستنزلوني عن شىء سمعته من رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ibrahim:                     'Alqama went to Sham and when he entered the mosque, he said, \"O Allah ! Bless me with a pious companion.\" So he sat with Abu Ad-Darda. Abu Ad-Darda' asked him, \"Where are you from?\" 'Alqama replied, \"From the people of Kufa.\" Abu Ad-Darda said, \"Isn't there amongst you the Keeper of the secret which nobody else knows i.e. Hudhaifa?\" Al-qama said, \"Yes.\" Then Abu Ad-Darda further said, \"Isn't there amongst you the person whom Allah gave Refuge from Satan through the invocation of His Prophet namely `Ammar?\" Alqama replied in the affirmative Abu Ad-Darda said, \"Isn't there amongst you the person who carries the Siwak (or the Secret) (i.e. of the Prophet namely `Abdullah bin Massud)?\" Alqama said, \"Yes.\" Then Abu Ad-Darda asked, \"How (Abdullah bin Masud) used to recite the Sura starting with: \"By the night as it envelopes; By the day as it appears in brightness?\" (92.1-2). Alqama said \"And by male and female.\" Abu Ad-Darda then said, \"These people (of Sham) tried hard to make me accept something other than what I had heard from the Prophet.\"",
      "chain": [
        "20193",
        "20020",
        "11072",
        "11051"
      ]
    },
    {
      "hadith_no": "3804",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن عمرو بن مرة، عن إبراهيم، عن مسروق، قال ذكر عبد الله عند عبد الله بن عمرو، فقال ذاك رجل لا أزال أحبه بعد ما سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ استقرئوا القرآن من أربعة من عبد الله بن مسعود، فبدأ به، وسالم مولى أبي حذيفة، وأبى بن كعب، ومعاذ بن جبل ‏\"‏‏.‏ قال لا أدري بدأ بأبى أو بمعاذ‏.‏",
      "text_en": " Narrated Masruq:                     `Abdullah (bin Mas`ud) was mentioned before `Abdullah bin `Amr. The latter said, \"That is a man I continue to love because I heard Allah's Apostle saying, ' Learn the recitation of the Qur'an from (any of these) four persons: `Abdullah bin Masud, Salim the freed slave of Abu Hudhaifa, Ubai bin Ka`b, and Mu`adh bin Jabal.\" I do not remember whether he mentioned Ubai first or Mu`adh.",
      "chain": [
        "20193",
        "20020",
        "11381",
        "11051",
        "11018"
      ]
    },
    {
      "hadith_no": "3808",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن أبي إسحاق، عن عبد الرحمن بن يزيد،، قال سألنا حذيفة عن رجل، قريب السمت والهدى من النبي صلى الله عليه وسلم حتى نأخذ عنه فقال ما أعرف أحدا أقرب سمتا وهديا ودلا بالنبي صلى الله عليه وسلم من ابن أم عبد‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Yazid:                     We asked Hudhaifa to tell us of a person resembling (to some extent) the Prophet in good appearance and straight forward behavior so that we may learn from him (good manners and acceptable conduct). Hudhaifa replied, \"I do not know anybody resembling the Prophet (to some extent) in appearance and conduct more than Ibn Um `Abd.",
      "chain": [
        "20193",
        "20020",
        "11049",
        "20395",
        "145"
      ]
    },
    {
      "hadith_no": "3862",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن سعيد بن أبي بردة، عن أبيه، أتيت المدينة فلقيت عبد الله بن سلام  رضى الله عنه  فقال ألا تجيء فأطعمك سويقا وتمرا، وتدخل في بيت ثم قال إنك بأرض الربا بها فاش، إذا كان لك على رجل حق فأهدى إليك حمل تبن، أو حمل شعير أو حمل قت، فلا تأخذه، فإنه ربا‏.‏ ولم يذكر النضر وأبو داود ووهب عن شعبة البيت‏.‏",
      "text_en": " Narrated Abu Burda:                     When I came to Medina. I met `Abdullah bin Salam. He said, \"Will you come to me so that I may serve you with Sawiq (i.e. powdered barley) and dates, and let you enter a (blessed) house that in which the Prophet entered?\" Then he added, \"You are In a country where the practice of Riba (i.e. usury) is prevalent; so if somebody owe you something and he sends you a present of a load of chopped straw or a load of barley or a load of provender then do not take it, as it is Riba.\"",
      "chain": [
        "20193",
        "20020",
        "11345",
        "11901",
        "103"
      ]
    },
    {
      "hadith_no": "3901",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن أبي إسحاق، عن الأسود، عن عبد الله  رضى الله عنه قال قرأ النبي صلى الله عليه وسلم النجم، فسجد فما بقي أحد إلا سجد، إلا رجل رأيته أخذ كفا من حصا فرفعه فسجد عليه وقال هذا يكفيني‏.‏ فلقد رأيته بعد قتل كافرا بالله‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet recited Surat An-Najam and prostrated, and there was nobody who did not prostrate then except a man whom I saw taking a handful of pebbles, lifting it, and prostrating on it. He then said, \"This is sufficient for me.\" No doubt I saw him killed as a disbeliever afterwards.",
      "chain": [
        "20193",
        "20020",
        "11049",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "4043",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن يحيى، عن معاذ بن رفاعة بن رافع،، وكان، رفاعة من أهل بدر، وكان رافع من أهل العقبة، فكان يقول لابنه ما يسرني أني شهدت بدرا بالعقبة قال سأل جبريل النبي صلى الله عليه وسلم‏.‏ بهذا‏.‏",
      "text_en": " Narrated Mu`adh bin Rifa`a bin Rafi`:                     Rifa`a was one of the warriors of Badr while (his father) Rafi` was one of the people of Al-`Aqaba (i.e. those who gave the pledge of allegiance at Al-`Aqaba). Rafi` used to say to his son, \"I would not have been happier if I had taken part in the Badr battle instead of taking part in the 'Aqaba pledge.\"",
      "chain": [
        "20193",
        "20022",
        "20031",
        "11554"
      ]
    },
    {
      "hadith_no": "4239",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أيوب، عن مجاهد، عن ابن أبي ليلى، عن كعب بن عجرة  رضى الله عنه  قال أتى على النبي صلى الله عليه وسلم زمن الحديبية، والقمل يتناثر على وجهي فقال ‏{‏أيؤذيك هوام رأسك‏}‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ فاحلق، وصم ثلاثة أيام، أو أطعم ستة مساكين، أو انسك نسيكة ‏\"‏‏.‏ قال أيوب لا أدري بأى هذا بدأ‏.‏",
      "text_en": " Narrated Ka`b bin Ujra:                     The Prophet came to me at the time of Al-Hudaibiya Pledge while lice were falling on my face. He said, \"Are the lice of your head troubling you?\" I said, \"Yes.\" He said, \"Shave your head and fast for three days, or feed six poor persons, or slaughter a sheep as sacrifice.\" (The sub-narrator, Aiyub said, \"I do not know with which of these three options he started.\")",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "4249",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن ثابت، عن أنس  رضى الله عنه  قال صلى النبي صلى الله عليه وسلم الصبح قريبا من خيبر بغلس ثم قال ‏\"‏ الله أكبر خربت خيبر، إنا إذا نزلنا بساحة قوم، فساء صباح المنذرين ‏\"‏‏.‏ فخرجوا يسعون في السكك، فقتل النبي صلى الله عليه وسلم المقاتلة، وسبى الذرية، وكان في السبى صفية، فصارت إلى دحية الكلبي، ثم صارت إلى النبي صلى الله عليه وسلم، فجعل عتقها صداقها‏.‏ فقال عبد العزيز بن صهيب لثابت يا أبا محمد آنت قلت لأنس ما أصدقها فحرك ثابت رأسه تصديقا له‏.‏",
      "text_en": " Narrated Anas:                     The Prophet offered the Fajr Prayer near Khaibar when it was still dark and then said, \"Allahu-Akbar! Khaibar is destroyed, for whenever we approach a (hostile) nation (to fight), then evil will be the morning for those who have been warned.\" Then the inhabitants of Khaibar came out running on the roads. The Prophet had their warriors killed, their offspring and woman taken as captives. Safiya was amongst the captives, She first came in the share of Dahya Alkali but later on she belonged to the Prophet . The Prophet made her manumission as her 'Mahr'.",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "4268",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن عمرو، عن محمد بن علي، عن جابر بن عبد الله  رضى الله عنهما  قال نهى رسول الله صلى الله عليه وسلم يوم خيبر عن لحوم الحمر، ورخص في الخيل‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     On the day of Khaibar, Allah's Apostle forbade the eating of donkey meat and allowed the eating of horse meat.",
      "chain": [
        "20193",
        "20022",
        "11081",
        "11442",
        "34"
      ]
    },
    {
      "hadith_no": "4301",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد  هو ابن زيد  عن أيوب، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال قدم رسول الله صلى الله عليه وسلم وأصحابه فقال المشركون إنه يقدم عليكم وفد وهنهم حمى يثرب‏.‏ وأمرهم النبي صلى الله عليه وسلم أن يرملوا الأشواط الثلاثة، وأن يمشوا ما بين الركنين، ولم يمنعه أن يأمرهم أن يرملوا الأشواط كلها إلا الإبقاء عليهم‏.‏ وزاد ابن سلمة عن أيوب عن سعيد بن جبير عن ابن عباس قال لما قدم النبي صلى الله عليه وسلم لعامه الذي استأمن قال ارملوا ليرى المشركون قوتهم، والمشركون من قبل قعيقعان‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When Allah's Apostle and his companions arrived (at Mecca), the pagans said, \"There have come to you a group of people who have been weakened by the fever of Yathrib (i.e. Medina).\" So the Prophet ordered his companions to do Ramal (i.e. fast walking) in the first three rounds of Tawaf around the Ka`ba and to walk in between the two corners (i.e. the black stone and the Yemenite corner). The only cause which prevented the Prophet from ordering them to do Ramal in all the rounds of Tawaf, was that he pitied them.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "4347",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن عمرو بن سلمة، قال قال لي أبو قلابة ألا تلقاه فتسأله، قال فلقيته فسألته فقال كنا بماء ممر الناس، وكان يمر بنا الركبان فنسألهم ما للناس ما للناس ما هذا الرجل فيقولون يزعم أن الله أرسله أوحى إليه، أو أوحى الله بكذا‏.‏ فكنت أحفظ ذلك الكلام، وكأنما يغرى في صدري، وكانت العرب تلوم بإسلامهم الفتح، فيقولون اتركوه وقومه، فإنه إن ظهر عليهم فهو نبي صادق‏.‏ فلما كانت وقعة أهل الفتح بادر كل قوم بإسلامهم، وبدر أبي قومي بإسلامهم، فلما قدم قال جئتكم والله من عند النبي صلى الله عليه وسلم حقا فقال ‏\"‏ صلوا صلاة كذا في حين كذا، وصلوا كذا في حين كذا، فإذا حضرت الصلاة، فليؤذن أحدكم، وليؤمكم أكثركم قرآنا ‏\"‏‏.‏ فنظروا فلم يكن أحد أكثر قرآنا مني، لما كنت أتلقى من الركبان، فقدموني بين أيديهم، وأنا ابن ست أو سبع، سنين وكانت على بردة، كنت إذا سجدت تقلصت عني، فقالت امرأة من الحى ألا تغطوا عنا است قارئكم‏.‏ فاشتروا فقطعوا لي قميصا، فما فرحت بشىء فرحي بذلك القميص‏.‏",
      "text_en": " Narrated `Amr bin Salama:                     We were at a place which was a thoroughfare for the people, and the caravans used to pass by us and we would ask them, \"What is wrong with the people? What is wrong with the people? Who is that man?. They would say, \"That man claims that Allah has sent him (as an Apostle), that he has been divinely inspired, that Allah has revealed to him such-and-such.\" I used to memorize that (Divine) Talk, and feel as if it was inculcated in my chest (i.e. mind) And the 'Arabs (other than Quraish) delayed their conversion to Islam till the Conquest (of Mecca). They used to say.\" \"Leave him (i.e. Muhammad) and his people Quraish: if he overpowers them then he is a true Prophet. So, when Mecca was conquered, then every tribe rushed to embrace Islam, and my father hurried to embrace Islam before (the other members of) my tribe. When my father returned (from the Prophet) to his tribe, he said, \"By Allah, I have come to you from the Prophet for sure!\" The Prophet afterwards said to them, 'Offer such-and-such prayer at such-and-such time, and when the time for the prayer becomes due, then one of you should pronounce the Adhan (for the prayer), and let the one amongst you who knows Qur'an most should, lead the prayer.\" So they looked for such a person and found none who knew more Qur'an than I because of the Qur'anic material which I used to learn from the caravans. They therefore made me their Imam ((to lead the prayer) and at that time I was a boy of six or seven years, wearing a Burda (i.e. a black square garment) proved to be very short for me (and my body became partly naked). A lady from the tribe said, \"Won't you cover the anus of your reciter for us?\" So they bought (a piece of cloth) and made a shirt for me. I had never been so happy with anything before as I was with that shirt.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "5206"
      ]
    },
    {
      "hadith_no": "4376",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن أبي التياح، عن أنس، قال لما كان يوم فتح مكة قسم رسول الله صلى الله عليه وسلم غنائم بين قريش‏.‏ فغضبت الأنصار قال النبي صلى الله عليه وسلم ‏\"‏ أما ترضون أن يذهب الناس بالدنيا، وتذهبون برسول الله صلى الله عليه وسلم ‏\"‏‏.‏ قالوا بلى‏.‏ قال ‏\"‏ لو سلك الناس واديا أو شعبا لسلكت وادي الأنصار أو شعبهم ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     When it was the day of the Conquest (of Mecca) Allah's Apostle distributed the war booty amongst the people of Quraish which caused the Ansar to become angry. So the Prophet said, \"Won't you be pleased that the people take the worldly things and you take Allah's Apostle with you? \"They said, \"Yes.\" The Prophet said, \"If the people took their way through a valley or mountain pass, I would take my way through the Ansar's valley or mountain pass.\"",
      "chain": [
        "20193",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "4391",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن حبيب بن أبي ثابت، عن سعيد بن جبير، عن عمرو بن ميمون، أن معاذا  رضى الله عنه  لما قدم اليمن صلى بهم الصبح فقرأ ‏{‏واتخذ الله إبراهيم خليلا‏}‏ فقال رجل من القوم لقد قرت عين أم إبراهيم‏.‏ زاد معاذ عن شعبة عن حبيب عن سعيد عن عمرو أن النبي صلى الله عليه وسلم بعث معاذا إلى اليمن، فقرأ معاذ في صلاة الصبح سورة النساء فلما قال ‏{‏واتخذ الله إبراهيم خليلا‏}‏ قال رجل خلفه قرت عين أم إبراهيم‏.‏",
      "text_en": " Narrated `Amr bin Maimuin:                     When Mu`adh arrived at Yemen, he led them (i.e. the people of Yemen) in the Fajr prayer wherein he recited: 'Allah took Abraham as a Khalil.' A man amongst the people said, \"(How) glad the mother of Abraham is!\" (In another narration) `Amr said, \"The Prophet sent Mu`adh to Yemen and he (led the people) in the Fajr prayer and recited: 'Allah took Abraham as a Khalil. A man behind him said, \"(How) glad the mother of Abraham is!\"",
      "chain": [
        "20193",
        "20020",
        "11331",
        "11050",
        "11382",
        "32"
      ]
    },
    {
      "hadith_no": "4412",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أبي جمرة، قال سمعت ابن عباس، يقول قدم وفد عبد القيس على النبي صلى الله عليه وسلم فقالوا يا رسول الله إنا هذا الحى من ربيعة، وقد حالت بيننا وبينك كفار مضر، فلسنا نخلص إليك إلا في شهر حرام، فمرنا بأشياء نأخذ بها وندعو إليها من وراءنا‏.‏ قال ‏\"‏ آمركم بأربع وأنهاكم عن أربع، الإيمان بالله شهادة أن لا إله إلا الله  وعقد واحدة  وإقام الصلاة، وإيتاء الزكاة، وأن تؤدوا لله خمس ما غنمتم، وأنهاكم عن الدباء، والنقير والحنتم والمزفت ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The delegation of `Abdul Qais came to the Prophet and said, \"O Allah's Apostle We belong to the tribe of Rabi`a. The infidels of Mudar tribe intervened between us and you so that we cannot come to you except in the Sacred Months, so please order us some things we may act on and invite those left behind to act on. The Prophet said, \"I order you to observe four things and forbid you from four things: (I order you) to believe in Allah, i.e. to testify that None has the right to be worshipped except Allah.\" The Prophet pointed with finger indicating one and added, \"To offer prayers perfectly: to give Zakat, and to give one-fifth of the booty you win (for Allah's Sake). I forbid you to use Ad-Dubba', An-Naquir, Al-Hantam and Al-Muzaffat, (Utensils used for preparing alcoholic liquors and drinks).",
      "chain": [
        "20193",
        "20022",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "4494",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أيوب، عن ابن أبي مليكة، عن عائشة  رضى الله عنها  قالت توفي النبي صلى الله عليه وسلم في بيتي وفي يومي، وبين سحري ونحري، وكانت إحدانا تعوذه بدعاء إذا مرض، فذهبت أعوذه، فرفع رأسه إلى السماء وقال ‏\"‏ في الرفيق الأعلى في الرفيق الأعلى ‏\"‏‏.‏ ومر عبد الرحمن بن أبي بكر وفي يده جريدة رطبة، فنظر إليه النبي صلى الله عليه وسلم فظننت أن له بها حاجة فأخذتها، فمضغت رأسها ونفضتها فدفعتها إليه، فاستن بها كأحسن ما كان مستنا ثم ناولنيها فسقطت يده  أو سقطت من يده  فجمع الله بين ريقي وريقه في آخر يوم من الدنيا وأول يوم من الآخرة‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet expired in my house and on the day of my turn, leaning against my chest. One of us (i.e. the Prophet's wives ) used to recite a prayer asking Allah to protect him from all evils when he became sick. So I started asking Allah to protect him from all evils (by reciting a prayer ). He raised his head towards the sky and said, \"With the highest companions, with the highest companions.\" `Abdur- Rahman bin Abu Bakr passed carrying a fresh leaf-stalk of a date-palm and the Prophet looked at it and I thought that the Prophet was in need of it (for cleaning his teeth ). So I took it (from `Abdur Rahman) and chewed its head and shook it and gave it to the Prophet who cleaned his teeth with it, in the best way he had ever cleaned his teeth, and then he gave it to me, and suddenly his hand dropped down or it fell from his hand (i.e. he expired). So Allah made my saliva mix with his saliva on his last day on earth and his first day in the Hereafter.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11090",
        "53"
      ]
    },
    {
      "hadith_no": "4503",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن ثابت، عن أنس، قال لما ثقل النبي صلى الله عليه وسلم جعل يتغشاه، فقالت فاطمة  عليها السلام  واكرب أباه‏.‏ فقال لها ‏\"‏ ليس على أبيك كرب بعد اليوم ‏\"‏‏.‏ فلما مات قالت يا أبتاه، أجاب ربا دعاه، يا أبتاه من جنة الفردوس مأواه، يا أبتاه إلى جبريل ننعاه‏.‏ فلما دفن قالت فاطمة  عليها السلام  يا أنس، أطابت أنفسكم أن تحثوا على رسول الله صلى الله عليه وسلم التراب",
      "text_en": " Narrated Anas:                     When the ailment of the Prophet got aggravated, he became unconscious whereupon Fatima said, \"Oh, how distressed my father is!\" He said, \"Your father will have no more distress after today.\" When he expired, she said, \"O Father! Who has responded to the call of the Lord Who has invited him! O Father, whose dwelling place is the Garden of Paradise (i.e. Al-Firdaus)! O Father! We convey this news (of your death) to Gabriel.\" When he was buried, Fatima said, \"O Anas! Do you feel pleased to throw earth over Allah's Apostle?\"",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "4631",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أيوب، عن ابن أبي مليكة، أن ابن عباس، تلا ‏{‏لا المستضعفين من الرجال والنساء والولدان‏}‏ قال كنت أنا وأمي ممن عذر الله‏.‏ ويذكر عن ابن عباس ‏{‏حصرت‏}‏ ضاقت ‏{‏تلووا‏}‏ ألسنتكم بالشهادة‏.‏ وقال غيره المراغم المهاجر‏.‏ راغمت هاجرت قومي‏.‏ ‏{‏موقوتا‏}‏ موقتا وقته عليهم‏.‏",
      "text_en": " Narrated Ibn Abi Mulaika:                     Ibn `Abbas recited:-- \"Except the weak ones among men women and children,\" (4.98) and said, \"My mother and I were among those whom Allah had excused.\"",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11090"
      ]
    },
    {
      "hadith_no": "4648",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن أبي إسحاق، سمعت البراء  رضى الله عنه  قال آخر سورة نزلت براءة، وآخر آية نزلت ‏{‏يستفتونك ‏}‏",
      "text_en": " Narrated Al-Bara:                     The last Sura that was revealed was Bara'a, and the last Verse that was revealed was: \"They ask you for a legal verdict, Say: Allah's directs (thus) about those who leave no descendants or ascendants as heirs.\" (4.176)",
      "chain": [
        "20193",
        "20020",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "4682",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن عمرو بن مرة، عن أبي وائل، عن عبد الله  رضى الله عنه  قال قلت أنت سمعت هذا من عبد الله قال نعم، ورفعه‏.‏ قال ‏\"‏ لا أحد أغير من الله، فلذلك حرم الفواحش ما ظهر منها وما بطن، ولا أحد أحب إليه المدحة من الله، فلذلك مدح نفسه ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     Allah's Apostle said, \"None has more sense of ghaira than Allah, and for this He has forbidden shameful sins whether committed openly or secretly, and none loves to be praised more than Allah does, and this is why He Praises Himself.\"",
      "chain": [
        "20193",
        "20020",
        "11381",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "4787",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن المغيرة بن النعمان، شيخ من النخع عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال خطب النبي صلى الله عليه وسلم فقال ‏\"‏ إنكم محشورون إلى الله حفاة عراة غرلا ‏{‏كما بدأنا أول خلق نعيده وعدا علينا إنا كنا فاعلين‏}‏ ثم إن أول من يكسى يوم القيامة إبراهيم، ألا إنه يجاء برجال من أمتي، فيؤخذ بهم ذات الشمال، فأقول يا رب أصحابي فيقال لا تدري ما أحدثوا بعدك فأقول كما قال العبد الصالح ‏{‏وكنت عليهم شهيدا ما دمت‏}‏ إلى قوله ‏{‏شهيد‏}‏ فيقال إن هؤلاء لم يزالوا مرتدين على أعقابهم منذ فارقتهم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet delivered a sermon and said, \"You (people) will be gathered before Allah (on the Day of Resurrection) bare-footed, naked and uncircumcised.\" (The Prophet then recited):-- 'As We began the first creation We shall repeat it. (It is) a promise We have undertaken and truly We shall do it.' and added, \"The first man who will be dressed on the Day of Resurrection, will be Abraham. Lo! Some men from my followers will be brought and taken towards the left side, whereupon I will say, 'O Lord, (these are) my companions!' It will be said, 'You do not know what new things they introduced (into the religion) after you.' I will then say as the righteous pious slave, Jesus, said, 'I was a witness over them while I dwelt among them...(to His Statement)..and You are the Witness to all things.' (5.117) Then it will be said, '(O Muhammad) These people never stopped to apostate since you left them.\"",
      "chain": [
        "20193",
        "20020",
        "11655",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "4839",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، قال أنس بن مالك أنا أعلم الناس، بهذه الآية آية الحجاب، لما أهديت زينب إلى رسول الله صلى الله عليه وسلم كانت معه في البيت، صنع طعاما، ودعا القوم، فقعدوا يتحدثون، فجعل النبي صلى الله عليه وسلم يخرج، ثم يرجع، وهم قعود يتحدثون، فأنزل الله تعالى ‏{‏يا أيها الذين آمنوا لا تدخلوا بيوت النبي إلا أن يؤذن لكم إلى طعام غير ناظرين إناه‏}‏ إلى قوله ‏{‏من وراء حجاب‏}‏ فضرب الحجاب، وقام القوم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     I of all the people know best this verse of Al-Hijab. When Allah's Apostle married Zainab bint Jahsh she was with him in the house and he prepared a meal and invited the people (to it). They sat down (after finishing their meal) and started chatting. So the Prophet went out and then returned several times while they were still sitting and talking. So Allah revealed the Verse: 'O you who believe! Enter not the Prophet's houses until leave is given to you for a meal, (and then) not (so early as) to wait for its preparation .....ask them from behind a screen.' (33.53) So the screen was set up and the people went away.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047"
      ]
    },
    {
      "hadith_no": "4872",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا جرير بن حازم، عن الأعمش، عن أبي الضحى، عن مسروق، قال دخلت على عبد الله ثم قال إن رسول الله صلى الله عليه وسلم لما دعا قريشا كذبوه واستعصوا عليه فقال ‏\"‏ اللهم أعني عليهم بسبع كسبع يوسف ‏\"‏‏.‏ فأصابتهم سنة حصت  يعني  كل شىء حتى كانوا يأكلون الميتة فكان يقوم أحدهم فكان يرى بينه وبين السماء مثل الدخان من الجهد والجوع ثم قرأ ‏{‏فارتقب يوم تأتي السماء بدخان مبين * يغشى الناس هذا عذاب أليم‏}‏ حتى بلغ ‏{‏إنا كاشفو العذاب قليلا إنكم عائدون‏}‏ قال عبد الله أفيكشف عنهم العذاب يوم القيامة قال والبطشة الكبرى يوم بدر‏.‏",
      "text_en": " Narrated Masruq:                     I came upon `Abdullah and he said, \"When Allah's Apostle invited Quraish (to Islam), they disbelieved him and stood against him. So he (the Prophet) said, \"O Allah! Help me against them by afflicting them with seven years of famine similar to the seven years of Joseph.' So they were stricken with a year of drought that destroyed everything, and they started eating dead animals, and if one of them got up he would see something like smoke between him and the sky from the severe fatigue and hunger.\" `Abdullah then recited:-- 'Then watch you for the Day that the sky will bring forth a kind of smoke plainly visible, covering the people. This is a painful torment... (till he reached) ........ We shall indeed remove the punishment for a while, but truly you will revert (to heathenism): (44.10-15) `Abdullah added: \"Will the punishment be removed from them on the Day of Resurrection?\" He added,\" The severe grasp\" was the Day of the Battle of Badr.\"",
      "chain": [
        "20193",
        "11272",
        "11060",
        "11392",
        "11018"
      ]
    },
    {
      "hadith_no": "4959",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "وقال سليمان بن حرب وأبو النعمان حدثنا حماد بن زيد، عن أيوب، عن محمد، قال كنت في حلقة فيها عبد الرحمن بن أبي ليلى وكان أصحابه يعظمونه، فذكر آخر الأجلين فحدثت بحديث سبيعة بنت الحارث عن عبد الله بن عتبة قال فضمز لي بعض أصحابه‏.‏ قال محمد ففطنت له فقلت إني إذا لجريء إن كذبت على عبد الله بن عتبة وهو في ناحية الكوفة‏.‏ فاستحيا وقال لكن عمه لم يقل ذاك‏.‏ فلقيت أبا عطية مالك بن عامر فسألته فذهب يحدثني حديث سبيعة فقلت هل سمعت عن عبد الله فيها شيئا فقال كنا عند عبد الله فقال أتجعلون عليها التغليظ ولا تجعلون عليها الرخصة‏.‏ لنزلت سورة النساء القصرى بعد الطولى ‏{‏وأولات الأحمال أجلهن أن يضعن حملهن‏}‏‏.‏",
      "text_en": "",
      "chain": [
        "20193",
        "20022",
        "11015",
        "20278",
        "4145"
      ]
    },
    {
      "hadith_no": "5117",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن عبد الملك بن ميسرة، عن النزال بن سبرة، عن عبد الله، أنه سمع رجلا، يقرأ آية، سمع النبي صلى الله عليه وسلم خلافها، فأخذت بيده فانطلقت به إلى النبي صلى الله عليه وسلم فقال ‏\"‏ كلاكما محسن فاقرآ  أكبر علمي قال  فإن من كان قبلكم اختلفوا فأهلكهم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     That he heard a man reciting a Quranic Verse which he had heard the Prophet reciting in a different way. So he took that man to the Prophet (and told him the story). The Prophet said, \"Both of you are reciting in a correct way, so carry on reciting.\" The Prophet further added, \"The nations which were before you were destroyed (by Allah) because they differed.\"",
      "chain": [
        "20193",
        "20020",
        "11369",
        "11659",
        "16"
      ]
    },
    {
      "hadith_no": "5203",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن عبد العزيز بن صهيب، عن أنس، أن عبد الرحمن بن عوف، تزوج امرأة على وزن نواة، فرأى النبي صلى الله عليه وسلم بشاشة العرس فسأله فقال إني تزوجت امرأة على وزن نواة‏.‏ وعن قتادة عن أنس أن عبد الرحمن بن عوف تزوج امرأة على وزن نواة من ذهب‏.‏",
      "text_en": " Narrated Anas:                     `Abdur Rahman bin `Auf married a woman and gave her gold equal to the weight of a date stone (as Mahr). When the Prophet noticed the signs of cheerfulness of the marriage (on his face) and asked him about it, he said, \"I have married a woman and gave (her) gold equal to a date stone in weight (as Mahr).",
      "chain": [
        "20193",
        "20020",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "5210",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد  هو ابن زيد  عن ثابت، عن أنس  رضى الله عنه  أن النبي صلى الله عليه وسلم رأى على عبد الرحمن بن عوف أثر صفرة قال ‏\"‏ ما هذا ‏\"‏‏.‏ قال إني تزوجت امرأة على وزن نواة من ذهب‏.‏ قال ‏\"‏ بارك الله لك، أولم ولو بشاة ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet saw the traces of Sufra (yellow perfume) on `Abdur-Rahman bin `Auf and said, \"What is this?\" `Abdur-Rahman, said, \"I have married a woman and have paid gold equal to the weight of a datestone (as her Mahr). The Prophet said to him, \"May Allah bless you: Offer a wedding banquet even with one sheep.\"",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "5223",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن ثابت، عن أنس، قال ما أولم النبي صلى الله عليه وسلم على شىء من نسائه، ما أولم على زينب أولم بشاة‏.‏",
      "text_en": " Narrated Anas:                     The Prophet did not give a better wedding banquet on the occasion of marrying any of his wives than the one he gave on marrying Zainab, and that banquet was with (consisted of) one sheep.",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "5274",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن هشام، عن فاطمة، عن أسماء، عن النبي صلى الله عليه وسلم‏.‏ حدثني محمد بن المثنى، حدثنا يحيى، عن هشام، حدثتني فاطمة، عن أسماء، أن امرأة، قالت يا رسول الله إن لي ضرة، فهل على جناح إن تشبعت من زوجي غير الذي يعطيني فقال رسول الله صلى الله عليه وسلم ‏\"‏ المتشبع بما لم يعط كلابس ثوبى زور ‏\"‏‏.‏",
      "text_en": " Narrated Asma:                     Some lady said, \"O Allah's Apostle! My husband has another wife, so it is sinful of me to claim that he has given me what he has not given me (in order to tease her)?\" Allah's Apostle said, The one who pretends that he has been given what he has not been given, is just like the (false) one who wears two garments of falsehood.\"",
      "chain": [
        "20193",
        "20022",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "5307",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن أنس بن سيرين، قال سمعت ابن عمر، قال طلق ابن عمر امرأته وهى حائض، فذكر عمر للنبي صلى الله عليه وسلم فقال ‏\"‏ ليراجعها ‏\"‏‏.‏ قلت تحتسب قال ‏\"‏ فمه ‏\"‏‏.‏ وعن قتادة عن يونس بن جبير عن ابن عمر قال ‏\"‏ مره فليراجعها ‏\"‏‏.‏ قلت تحتسب قال أرأيت إن عجز واستحمق‏.‏",
      "text_en": " Narrated Anas bin Seereen:                     Ibn `Umar said: \"I divorced my wife while she was menstruating. `Umar mentioned that to the Prophet . The Prophet said, (to my father), \"Let your son take her back.\" I asked (Ibn `Umar), \"Is such a divorce counted (i.e. as one legal divorce)?\" Ibn `Umar said, \"Of course.\" Narrated Yunus bin Jubair: Ibn `Umar said, \"The Prophet said to `Umar, 'Order him (Ibn `Umar) to take her back.' \" I asked, \"Is such a divorce counted (as one legal divorce)?\" Ibn `Umar said, \"What do you think if someone becomes helpless and foolish?\"",
      "chain": [
        "20193",
        "20020",
        "11038",
        "18"
      ]
    },
    {
      "hadith_no": "5383",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن الحكم، عن إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  قالت لما أراد رسول الله صلى الله عليه وسلم أن ينفر إذا صفية على باب خبائها كئيبة، فقال لها ‏\"‏ عقرى  أو حلقى  إنك لحابستنا أكنت أفضت يوم النحر ‏\"‏‏.‏ قالت نعم‏.‏ قال ‏\"‏ فانفري إذا ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     When Allah's Apostle decided to leave Mecca after the Hajj, he saw Safiyya, sad and standing at the entrance of her tent. He said to her, \"Aqr (or) Halq! You will detain us. Did you perform Tawaf-al- Ifada on the day of Nahr? She said, \"Yes.\" He said, \"Then you can depart.\"",
      "chain": [
        "20193",
        "20020",
        "11069",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "5444",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن يحيى، عن بشير بن يسار، عن سويد بن النعمان، أنه أخبره أنهم، كانوا مع النبي صلى الله عليه وسلم بالصهباء  وهى على روحة من خيبر  فحضرت الصلاة، فدعا بطعام فلم يجده إلا سويقا، فلاك منه فلكنا معه، ثم دعا بماء فمضمض، ثم صلى وصلينا، ولم يتوضأ‏.‏",
      "text_en": " Narrated Suwaid bin An-Nu`man:                     that while they were with the Prophet at As-Sahba' which was at a distance of one day's journey from Khaibar the prayer became due, and the Prophet asked the people for food but there was nothing with the people except Sawiq. He ate of it and we ate along with him, and then he asked for water and rinsed his mouth (with it), and then offered the (Maghrib) prayer and we too offered the prayer but the Prophet did not perform ablution (again after eating the Sawiq.).",
      "chain": [
        "20193",
        "20022",
        "20031",
        "11810",
        "1924"
      ]
    },
    {
      "hadith_no": "5452",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن عدي بن ثابت، عن أبي حازم، عن أبي هريرة، أن رجلا، كان يأكل أكلا كثيرا، فأسلم فكان يأكل أكلا قليلا، فذكر ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ إن المؤمن يأكل في معى واحد، والكافر يأكل في سبعة أمعاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     A man used to eat much, but when he embraced Islam, he started eating less. That was mentioned to the Prophet who then said, \"A believer eats in one intestine (is satisfied with a little food) and a Kafir eats in seven intestines (eats much). \"",
      "chain": [
        "20193",
        "20020",
        "11372",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "5534",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن عبد الله بن أبي السفر، عن الشعبي، قال سمعت عدي بن حاتم  رضى الله عنه  قال سألت رسول الله صلى الله عليه وسلم عن المعراض فقال ‏\"‏ إذا أصبت بحده فكل، فإذا أصاب بعرضه فقتل فإنه وقيذ، فلا تأكل ‏\"‏‏.‏ فقلت أرسل كلبي‏.‏ قال ‏\"‏ إذا أرسلت كلبك وسميت، فكل ‏\"‏‏.‏ قلت فإن أكل قال ‏\"‏ فلا تأكل، فإنه لم يمسك عليك، إنما أمسك على نفسه ‏\"‏‏.‏ قلت أرسل كلبي فأجد معه كلبا آخر‏.‏ قال ‏\"‏ لا تأكل، فإنك إنما سميت على كلبك، ولم تسم على آخر ‏\"‏‏.‏",
      "text_en": " Narrated `Adi bin Hatim:                     I asked Allah's Apostle about the Mi'rad. He said, \"If you hit the game with its sharp edge, eat it, but if the Mi'rad hits the game with its shaft with a hit by its broad side do not eat it, for it has been beaten to death with a piece of wood. (i.e. unlawful).\" I asked, \"If I let loose my trained hound after a game?\" He said, \"If you let loose your trained hound after game, and mention the name of Allah, then you can eat.\" I said, \"If the hound eats of the game?\" He said \"Then you should not eat of it, for the hound has hunted the game for itself and not for you.\" I said, \"Some times I send my hound and then I find some other hound with it?\" He said \"Don't eat the game, as you have mentioned the Name of Allah on your dog only and not on the other.\"",
      "chain": [
        "20193",
        "20020",
        "11636",
        "11052",
        "212"
      ]
    },
    {
      "hadith_no": "5583",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن عمرو، عن محمد بن علي، عن جابر بن عبد الله، قال نهى النبي صلى الله عليه وسلم يوم خيبر عن لحوم الحمر، ورخص في لحوم الخيل‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet prohibited the eating of donkey's meat on the day of the battle of Khaibar, and allowed the eating of horse flesh.",
      "chain": [
        "20193",
        "20022",
        "11081",
        "11442",
        "34"
      ]
    },
    {
      "hadith_no": "5718",
      "source": " Sahih Bukhari ",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن ثابت، عن أنس  رضى الله عنه  أن غلاما، ليهود كان يخدم النبي صلى الله عليه وسلم فمرض‏.‏ فأتاه النبي صلى الله عليه وسلم يعوده فقال ‏\"‏ أسلم ‏\"‏‏.‏ فأسلم‏.‏ وقال سعيد بن المسيب عن أبيه، لما حضر أبو طالب جاءه النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas:                     A Jewish boy used to serve the Prophet and became ill. The Prophet went to pay him a visit and said to him, \"Embrace Islam,\" and he did embrace Islam. Al-Musaiyab said: When Abu Talib was on his deathbed, the Prophet visited him.",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "5891",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن الحكم، عن ابن أبي ليلى، قال كان حذيفة بالمداين فاستسقى، فأتاه دهقان بماء في إناء من فضة فرماه به وقال إني لم أرمه إلا أني نهيته فلم ينته قال رسول الله صلى الله عليه وسلم ‏\"‏ الذهب والفضة والحرير والديباج هي لهم في الدنيا، ولكم في الآخرة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Abi Laila:                     While Hudhaifa was at Al-Madain, he asked for water whereupon the chief of the village brought him water in a silver cup. Hudhaifa threw it at him and said, \"I have thrown it only because I have forbidden him to use it, but he does not stop using it. Allah's Apostle said, 'Gold, silver, silk and Dibaj (a kind of silk) are for them (unbelievers) in this world and for you (Muslims) in the hereafter.'",
      "chain": [
        "20193",
        "20020",
        "11069",
        "11196"
      ]
    },
    {
      "hadith_no": "5893",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن ثابت، قال سمعت ابن الزبير، يخطب يقول قال محمد صلى الله عليه وسلم ‏\"‏ من لبس الحرير في الدنيا لم يلبسه في الآخرة ‏\"‏‏.‏",
      "text_en": " Narrated Thabit:                     I heard Ibn Az-Zubair delivering a sermon, saying, \"Muhammad said, 'Whoever wears silk in this world, shall not wear it in the Hereafter.\"",
      "chain": [
        "20193",
        "20022",
        "11269"
      ]
    },
    {
      "hadith_no": "5901",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، ح وحدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن عبد الملك بن ميسرة، عن زيد بن وهب، عن علي  رضى الله عنه  قال كساني النبي صلى الله عليه وسلم حلة سيراء، فخرجت فيها، فرأيت الغضب في وجهه، فشققتها بين نسائي‏.‏",
      "text_en": " Narrated `Ali bin Abi Talib:                     The Prophet gave me a silk suit. I went out wearing it, but seeing the signs of anger on his face, I tore it and distributed it among my wives.",
      "chain": [
        "20193",
        "20020",
        "30160",
        "20278",
        "20020",
        "11369",
        "11341",
        "5"
      ]
    },
    {
      "hadith_no": "5904",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن يحيى بن سعيد، عن عبيد بن حنين، عن ابن عباس  رضى الله عنهما  قال لبثت سنة وأنا أريد أن أسأل عمر عن المرأتين اللتين تظاهرتا على النبي صلى الله عليه وسلم فجعلت أهابه، فنزل يوما منزلا فدخل الأراك، فلما خرج سألته فقال عائشة وحفصة  ثم قال  كنا في الجاهلية لا نعد النساء شيئا، فلما جاء الإسلام وذكرهن الله، رأينا لهن بذلك علينا حقا، من غير أن ندخلهن في شىء من أمورنا، وكان بيني وبين امرأتي كلام فأغلظت لي فقلت لها وإنك لهناك‏.‏ قالت تقول هذا لي وابنتك تؤذي النبي صلى الله عليه وسلم فأتيت حفصة فقلت لها إني أحذرك أن تعصي الله ورسوله‏.‏ وتقدمت إليها في أذاه، فأتيت أم سلمة فقلت لها‏.‏ فقالت أعجب منك يا عمر قد دخلت في أمورنا، فلم يبق إلا أن تدخل بين رسول الله صلى الله عليه وسلم وأزواجه، فرددت، وكان رجل من الأنصار إذا غاب عن رسول الله صلى الله عليه وسلم وشهدته أتيته بما يكون، وإذا غبت عن رسول الله صلى الله عليه وسلم وشهد أتاني بما يكون من رسول الله صلى الله عليه وسلم وكان من حول رسول الله صلى الله عليه وسلم قد استقام له، فلم يبق إلا ملك غسان بالشأم، كنا نخاف أن يأتينا، فما شعرت إلا بالأنصاري وهو يقول إنه قد حدث أمر‏.‏ قلت له وما هو أجاء الغساني قال أعظم من ذاك، طلق رسول الله صلى الله عليه وسلم نساءه‏.‏ فجئت فإذا البكاء من حجرها كلها، وإذا النبي صلى الله عليه وسلم قد صعد في مشربة له، وعلى باب المشربة وصيف فأتيته فقلت استأذن لي‏.‏ فدخلت فإذا النبي صلى الله عليه وسلم على حصير قد أثر في جنبه، وتحت رأسه مرفقة من أدم، حشوها ليف، وإذا أهب معلقة وقرظ، فذكرت الذي قلت لحفصة وأم سلمة، والذي ردت على أم سلمة، فضحك رسول الله صلى الله عليه وسلم فلبث تسعا وعشرين ليلة، ثم نزل‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     For one year I wanted to ask `Umar about the two women who helped each other against the Prophet but I was afraid of him. One day he dismounted his riding animal and went among the trees of Arak to answer the call of nature, and when he returned, I asked him and he said, \"(They were) `Aisha and Hafsa.\" Then he added, \"We never used to give significance to ladies in the days of the Pre-lslamic period of ignorance, but when Islam came and Allah mentioned their rights, we used to give them their rights but did not allow them to interfere in our affairs. Once there was some dispute between me and my wife and she answered me back in a loud voice. I said to her, 'Strange! You can retort in this way?' She said, 'Yes. Do you say this to me while your daughter troubles Allah's Apostle?' So I went to Hafsa and said to her, 'I warn you not to disobey Allah and His Apostle.' I first went to Hafsa and then to Um Salama and told her the same. She said to me, 'O `Umar! It surprises me that you interfere in our affairs so much that you would poke your nose even into the affairs of Allah's Apostle and his wives.' So she rejected my advice. There was an Ansari man; whenever he was absent from Allah's Apostle and I was present there, I used to convey to him what had happened (on that day), and when I was absent and he was present there, he used to convey to me what had happened as regards news from Allah's Apostle . During that time all the rulers of the nearby lands had surrendered to Allah's Apostle except the king of Ghassan in Sham, and we were afraid that he might attack us. All of a sudden the Ansari came and said, 'A great event has happened!' I asked him, 'What is it? Has the Ghassani (king) come?' He said, 'Greater than that! Allah's Apostle has divorced his wives! I went to them and found all of them weeping in their dwellings, and the Prophet had ascended to an upper room of his. At the door of the room there was a slave to whom I went and said, \"Ask the permission for me to enter.\" He admitted me and I entered to see the Prophet lying on a mat that had left its imprint on his side. Under his head there was a leather pillow stuffed with palm fires. Behold! There were some hides hanging there and some grass for tanning. Then I mentioned what I had said to Hafsa and Um Salama and what reply Um Salama had given me. Allah's Apostle smiled and stayed there for twenty nine days and then came down.\" (See Hadith No. 648, Vol. 3 for details)",
      "chain": [
        "20193",
        "20022",
        "20031",
        "11202",
        "17"
      ]
    },
    {
      "hadith_no": "5911",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن سعيد أبي مسلمة، قال سألت أنسا أكان النبي صلى الله عليه وسلم يصلي في نعليه قال نعم‏.‏",
      "text_en": " Narrated Sa`id Abu Maslama:                     I asked Anas (bin Malik), \"Did the Prophet use to offer the prayers with his shoes on?\" He said, \"Yes.\"",
      "chain": [
        "20193",
        "20022"
      ]
    },
    {
      "hadith_no": "5956",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن ثابت، قال سئل أنس عن خضاب النبي، صلى الله عليه وسلم فقال إنه لم يبلغ ما يخضب، لو شئت أن أعد شمطاته في لحيته‏.‏",
      "text_en": " Narrated Thabit:                     Anas was asked whether the Prophet used a a hair dye or not. Anas replied, \"The Prophet had not enough grey hair to dye. I could even count the white grey hairs oil his beard ill would.\"",
      "chain": [
        "20193",
        "20022",
        "11269"
      ]
    },
    {
      "hadith_no": "6009",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن عون بن أبي جحيفة، قال رأيت أبي فقال إن النبي صلى الله عليه وسلم نهى عن ثمن الدم، وثمن الكلب، وآكل الربا وموكله، والواشمة والمستوشمة‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     The Prophet forbade the use of the price of blood and the price of a dog, the one who takes (eats) usury the one who gives usury, the woman who practises tattooing and the woman who gets herself tattooed.",
      "chain": [
        "20193",
        "20020",
        "11383"
      ]
    },
    {
      "hadith_no": "6113",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن منصور، قال سمعت أبا وائل، يحدث عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ سباب المسلم فسوق، وقتاله كفر ‏\"‏‏.‏ تابعه غندر عن شعبة‏.‏",
      "text_en": " Narrated `Abdullah:                     Allah's Apostle said, \"Abusing a Muslim is Fusuq (i.e., an evil-doing), and killing him is Kufr (disbelief).",
      "chain": [
        "20193",
        "20020",
        "11067",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "6212",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، هو ابن زيد  عن يحيى بن سعيد، عن بشير بن يسار، مولى الأنصار عن رافع بن خديج، وسهل بن أبي حثمة، أنهما حدثاه أن عبد الله بن سهل ومحيصة بن مسعود أتيا خيبر فتفرقا في النخل، فقتل عبد الله بن سهل، فجاء عبد الرحمن بن سهل وحويصة ومحيصة ابنا مسعود إلى النبي صلى الله عليه وسلم فتكلموا في أمر صاحبهم فبدأ عبد الرحمن، وكان أصغر القوم فقال النبي صلى الله عليه وسلم ‏\"‏ كبر الكبر ‏\"‏‏.‏  قال يحيى ليلي الكلام الأكبر  فتكلموا في أمر صاحبهم فقال النبي صلى الله عليه وسلم ‏\"‏ أتستحقون قتيلكم  أو قال صاحبكم  بأيمان خمسين منكم ‏\"‏‏.‏ قالوا يا رسول الله أمر لم نره‏.‏ قال ‏\"‏ فتبرئكم يهود في أيمان خمسين منهم ‏\"‏‏.‏ قالوا يا رسول الله قوم كفار‏.‏ فوداهم رسول الله صلى الله عليه وسلم من قبله‏.‏ قال سهل فأدركت ناقة من تلك الإبل، فدخلت مربدا لهم فركضتني برجلها‏.‏",
      "text_en": " Narrated Rafi` bin Khadij and Sahl bin Abu Hathma:                     `Abdullah bin Sahl and Muhaiyisa bin Mas`ud went to Khaibar and they dispersed in the gardens of the date-palm trees. `Abdullah bin Sahl was murdered. Then `Abdur-Rahman bin Sahl, Huwaiyisa and Muhaiyisa, the two sons of Mas`ud, came to the Prophet and spoke about the case of their (murdered) friend. `Abdur-Rahman who was the youngest of them all, started talking. The Prophet said, \"Let the older (among you) speak first.\" So they spoke about the case of their (murdered) friend. The Prophet said, \"Will fifty of you take an oath whereby you will have the right to receive the blood money of your murdered man,\" (or said, \"..your companion\"). They said, \"O Allah's Apostle! The murder was a thing we did not witness.\" The Prophet said, \"Then the Jews will release you from the oath, if fifty of them (the Jews) should take an oath to contradict your claim.\" They said, \"O Allah's Apostle! They are disbelievers (and they will take a false oath).\" Then Allah's Apostle himself paid the blood money to them.",
      "chain": [
        "20193",
        "20022",
        "20031",
        "11810",
        "1986"
      ]
    },
    {
      "hadith_no": "6223",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن عدي بن ثابت، عن البراء  رضى الله عنه  أن النبي صلى الله عليه وسلم قال لحسان ‏\"‏ اهجهم  أو قال هاجهم  وجبريل معك ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara:                     The Prophet said to Hassan, \"Lampoon them (the pagans) in verse, and Gabriel is with you.\"",
      "chain": [
        "20193",
        "20020",
        "11372",
        "400"
      ]
    },
    {
      "hadith_no": "6266",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا سليمان بن حرب، أخبرنا شعبة، عن عدي بن ثابت، قال سمعت البراء، قال لما مات إبراهيم  عليه السلام  قال رسول الله صلى الله عليه وسلم ‏\"‏ إن له مرضعا في الجنة ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara:                     When Ibrahim (the son of the Prophet) died, Allah's Apostle said, \"There is a wet nurse for him in Paradise.\"",
      "chain": [
        "20193",
        "20020",
        "11372",
        "400"
      ]
    },
    {
      "hadith_no": "6281",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن ثابت، عن أنس، وأيوب، عن أبي قلابة، عن أنس  رضى الله عنه  أن النبي صلى الله عليه وسلم كان في سفر، وكان غلام يحدو بهن يقال له أنجشة، فقال النبي صلى الله عليه وسلم ‏\"‏ رويدك يا أنجشة، سوقك بالقوارير ‏\"‏‏.‏ قال أبو قلابة يعني النساء‏.‏",
      "text_en": " Narrated Anas:                     The Prophet was on a journey and a slave named Anjasha was chanting (singing) for the camels to let them go fast (while driving). The Prophet said, \"O Anjasha, drive slowly (the camels) with the glass vessels!\" Abu Qilaba said, \"By the glass vessels' he meant the women (riding the camels).",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "6294",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن الأشعث بن سليم، قال سمعت معاوية بن سويد بن مقرن، عن البراء  رضى الله عنه  قال أمرنا النبي صلى الله عليه وسلم بسبع، ونهانا عن سبع، أمرنا بعيادة المريض، واتباع الجنازة، وتشميت العاطس، وإجابة الداعي، ورد السلام، ونصر المظلوم، وإبرار المقسم، ونهانا عن سبع، عن خاتم الذهب  أو قال حلقة الذهب  وعن لبس الحرير، والديباج، والسندس، والمياثر‏.‏",
      "text_en": " Narrated Al-Bara:                     The Prophet ordered us to do seven (things) and forbade us from seven (other things): He ordered us to pay a visit to the sick, to follow funeral possessions, to say: May Allah be merciful to you to a sneezer, - if he says: Praise be to Allah, to accept invitation (invitation to a wedding banquet), to return greetings, to help the oppressed, and to help others to fulfill their oaths (provided it was not sinful). And he forbade us from seven (things): to wear golden rings or golden bangles, to wear silk (cloth), Dibaj, Sundus and Mayathir.",
      "chain": [
        "20193",
        "20020",
        "11324",
        "3117",
        "400"
      ]
    },
    {
      "hadith_no": "6391",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن الحكم، عن ابن أبي ليلى، عن علي، أن فاطمة  عليهما السلام  شكت ما تلقى في يدها من الرحى، فأتت النبي صلى الله عليه وسلم تسأله خادما، فلم تجده، فذكرت ذلك لعائشة، فلما جاء أخبرته‏.‏ قال فجاءنا وقد أخذنا مضاجعنا، فذهبت أقوم فقال ‏\"‏ مكانك ‏\"‏‏.‏ فجلس بيننا حتى وجدت برد قدميه على صدري فقال ‏\"‏ ألا أدلكما على ما هو خير لكما من خادم، إذا أويتما إلى فراشكما، أو أخذتما مضاجعكما، فكبرا ثلاثا وثلاثين، وسبحا ثلاثا وثلاثين، واحمدا ثلاثا وثلاثين، فهذا خير لكما من خادم ‏\"‏‏.‏ وعن شعبة عن خالد عن ابن سيرين قال التسبيح أربع وثلاثون‏.‏",
      "text_en": " Narrated `Ali:                     Fatima complained about the blisters on her hand because of using a mill-stone. She went to ask the Prophet for servant, but she did not find him (at home) and had to inform `Aisha of her need. When he came, `Aisha informed him about it. `Ali added: The Prophet came to us when we had gone to our beds. When I was going to get up, he said, \"'Stay in your places,\" and sat between us, till I felt the coolness of the feet on my chest. The Prophet then said, \"Shall I not tell you of a thing which is better for you than a servant? When you (both) go to your beds, say 'Allahu Akbar' thirty-four times, and 'Subhan Allah' thirty-three times, 'Al hamdu 'illah' thirty-three times, for that is better for you than a servant.\" Ibn Seereen said, \"Subhan Allah' (is to be said for) thirty-four times.\"",
      "chain": [
        "20193",
        "20020",
        "11069",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "6433",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن عمرو بن مرة، عن ابن أبي أوفى، قال كان إذا أتى رجل النبي صلى الله عليه وسلم بصدقته قال ‏\"‏ اللهم صل عليه‏\"‏ فأتاه أبي بصدقته فقال ‏\"‏ اللهم صل على آل أبي أوفى‏\"‏",
      "text_en": " Narrated Ibn Abi `Aufa:                     Whenever somebody brought alms to the Prophet the used to say, \"Allahumma Salli 'Alaihi (O Allah! Send Your Salat (Grace and Honor) on him).\" Once when my father brought his alms to him, he said, \"O Allah! Send Your Salat (Grace and Honor) on the family of Abi `Aufa.\"",
      "chain": [
        "20193",
        "20020",
        "11381",
        "5115"
      ]
    },
    {
      "hadith_no": "6457",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أيوب، عن أبي عثمان، عن أبي موسى  رضى الله عنه  قال كنا مع النبي صلى الله عليه وسلم في سفر فكنا إذا علونا كبرنا فقال النبي صلى الله عليه وسلم ‏\"‏ أيها الناس اربعوا على أنفسكم، فإنكم لا تدعون أصم ولا غائبا، ولكن تدعون سميعا بصيرا ‏\"‏‏.‏ ثم أتى على وأنا أقول في نفسي لا حول ولا قوة إلا بالله‏.‏ فقال ‏\"‏ يا عبد الله بن قيس قل لا حول ولا قوة إلا بالله فإنها‏.‏ كنز من كنوز الجنة ‏\"‏‏.‏ أو قال ‏\"‏ ألا أدلك على كلمة هي كنز من كنوز الجنة، لا حول ولا قوة إلا بالله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     We were in the company of the Prophet on a journey, and whenever we ascended a high place, we used to say Takbir (in a loud voice). The Prophet said, \"O people! Be kind to yourselves, for you are not calling upon a deaf or an absent one, but You are calling an All-Hearer, and an All-Seer.\" Then he came to me as I was reciting silently, \"La haul a wala quwwata illa bil-lah.\" He said, \"O `Abdullah bin Qais! Say: La haul a walaquwata illa bil-lah, for it is one of the treasures of Paradise.\" Or he said, \"Shall I tell you a word which is one of the treasures of Paradise? It is: La haul a wala quwwata illa bil-lah.\"",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11113",
        "41"
      ]
    },
    {
      "hadith_no": "6565",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن موسى بن أنس، عن أنس  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏لو تعلمون ما أعلم لضحكتم قليلا ولبكيتم كثيرا‏\"‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"If you knew that which I know, you would laugh little and weep much.\"",
      "chain": [
        "20193",
        "20020",
        "14383",
        "19"
      ]
    },
    {
      "hadith_no": "6643",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن عمرو، عن خيثمة، عن عدي بن حاتم، أن النبي صلى الله عليه وسلم ذكر النار فأشاح بوجهه فتعوذ منها، ثم ذكر النار فأشاح بوجهه فتعوذ منها، ثم قال ‏\"‏ اتقوا النار ولو بشق تمرة، فمن لم يجد فبكلمة طيبة ‏\"‏‏.‏",
      "text_en": " Narrated `Adi bin Hatim:                     The Prophet mentioned the Fire and turned his face aside and asked for Allah's protection from it, and then again he mentioned the Fire and turned his face aside and asked for Allah's protection from it and said, \"Protect yourselves from the Hell-Fire, even if with one half of a date, and he who cannot afford that, then (let him do so) by (saying) a good, pleasant word.\"",
      "chain": [
        "20193",
        "20020",
        "20377",
        "11332",
        "212"
      ]
    },
    {
      "hadith_no": "6675",
      "source": " Sahih Bukhari ",
      "chapter": "Divine Will (Al-Qadar) - كتاب القدر",
      "chapter_no": "82",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن عبيد الله بن أبي بكر بن أنس، عن أنس بن مالك  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ وكل الله بالرحم ملكا فيقول أى رب نطفة، أى رب علقة، أى رب مضغة‏.‏ فإذا أراد الله أن يقضي خلقها قال أى رب ذكر أم أنثى أشقي أم سعيد فما الرزق فما الأجل فيكتب كذلك في بطن أمه ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"Allah puts an angel in charge of the uterus and the angel says, 'O Lord, (it is) semen! O Lord, (it is now ) a clot! O Lord, (it is now) a piece of flesh.' And then, if Allah wishes to complete its creation, the angel asks, 'O Lord, (will it be) a male or a female? A wretched (an evil doer) or a blessed (doer of good)? How much will his provisions be? What will his age be?' So all that is written while the creature is still in the mother's womb.\"",
      "chain": [
        "20193",
        "20022",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "6755",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن الأسود بن قيس، قال سمعت جندبا، قال شهدت النبي صلى الله عليه وسلم صلى يوم عيد ثم خطب ثم قال ‏\"‏ من ذبح فليبدل مكانها، ومن لم يكن ذبح فليذبح باسم الله ‏\"‏‏.‏",
      "text_en": " Narrated Jundub:                     I witnessed the Prophet offering the `Id prayer (and after finishing it) he delivered a sermon and said, \"Whoever has slaughtered his sacrifice (before the prayer) should make up for it (i.e. slaughter another animal) and whoever has not slaughtered his sacrifice yet, should slaughter it by mentioning Allah's Name over it.\"",
      "chain": [
        "20193",
        "20020",
        "11323",
        "4053"
      ]
    },
    {
      "hadith_no": "6802",
      "source": " Sahih Bukhari ",
      "chapter": "Expiation for Unfulfilled Oaths - كتاب كفارات الأيمان",
      "chapter_no": "84",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن الحكم، عن إبراهيم، عن الأسود، عن عائشة، أنها أرادت أن تشتري، بريرة فاشترطوا عليها الولاء، فذكرت ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ اشتريها إنما الولاء لمن أعتق ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     that she intended to buy Barira (a slave girl) and her masters stipulated that they would have her Wala'. When `Aisha mentioned that to the Prophet ; he said, \"Buy her, for the Wala' is for the one who manumits.\"",
      "chain": [
        "20193",
        "20020",
        "11069",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "6823",
      "source": " Sahih Bukhari ",
      "chapter": "Laws of Inheritance (Al-Faraa'id) - كتاب الفرائض",
      "chapter_no": "85",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا وهيب، عن ابن طاوس، عن أبيه، عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ ألحقوا الفرائض بأهلها فما بقي فلأولى رجل ذكر ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"Give the Fara'id, (the shares prescribed in the Qur'an) to those who are entitled to receive it, and then whatever remains, should be given to the closest male relative of the deceased.\"",
      "chain": [
        "20193",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "6862",
      "source": " Sahih Bukhari ",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا وهيب بن خالد، عن أيوب، عن عبد الله بن أبي مليكة، عن عقبة بن الحارث، أن النبي صلى الله عليه وسلم أتي بنعيمان أو بابن نعيمان وهو سكران فشق عليه، وأمر من في البيت أن يضربوه، فضربوه بالجريد والنعال، وكنت فيمن ضربه‏.‏",
      "text_en": " Narrated' `Uqba bin Al-Harith:                     An-Nu`man or the son of An-Nu`man was brought to the Prophet in a state of intoxication. The Prophet felt it hard (was angry) and ordered all those who were present in the house, to beat him. And they beat him, using palm-leaf stalks and shoes, and I was among those who beat him.",
      "chain": [
        "20193",
        "20299",
        "11015",
        "11090",
        "872"
      ]
    },
    {
      "hadith_no": "7167",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن علي بن مدرك، سمعت أبا زرعة بن عمرو بن جرير، عن جده، جرير قال قال لي رسول الله صلى الله عليه وسلم في حجة الوداع ‏\"‏ استنصت الناس ‏\"‏‏.‏ ثم قال ‏\"‏ لا ترجعوا بعدي كفارا، يضرب بعضكم رقاب بعض ‏\"‏‏.‏",
      "text_en": " Narrated Jarir:                     The Prophet said to me during Hajjat-al-Wada`, \"Let the people keep quiet and listen.\" Then he said (addressing the people), \"Beware! Do not renegade as disbelievers after me by striking (cutting) the necks of one another.\"",
      "chain": [
        "20193",
        "20020",
        "11377",
        "11406",
        "4057"
      ]
    },
    {
      "hadith_no": "7196",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أيوب، عن نافع، قال لما خلع أهل المدينة يزيد بن معاوية جمع ابن عمر حشمه وولده فقال إني سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ ينصب لكل غادر لواء يوم القيامة ‏\"‏‏.‏ وإنا قد بايعنا هذا الرجل على بيع الله ورسوله، وإني لا أعلم غدرا أعظم من أن يبايع رجل على بيع الله ورسوله، ثم ينصب له القتال، وإني لا أعلم أحدا منكم خلعه، ولا بايع في هذا الأمر، إلا كانت الفيصل بيني وبينه‏.‏",
      "text_en": " Narrated Nafi`:                     When the people of Medina dethroned Yazid bin Muawiya, Ibn `Umar gathered his special friends and children and said, \"I heard the Prophet saying, 'A flag will be fixed for every betrayer on the Day of Resurrection,' and we have given the oath of allegiance to this person (Yazid) in accordance with the conditions enjoined by Allah and His Apostle and I do not know of anything more faithless than fighting a person who has been given the oath of allegiance in accordance with the conditions enjoined by Allah and His Apostle , and if ever I learn that any person among you has agreed to dethrone Yazid, by giving the oath of allegiance (to somebody else) then there will be separation between him and me.\"",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11014"
      ]
    },
    {
      "hadith_no": "7218",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن قتادة، عن أنس، رضى الله عنه قال قال النبي صلى الله عليه وسلم ‏\"‏ ما بعث نبي إلا أنذر أمته الأعور الكذاب، ألا إنه أعور، وإن ربكم ليس بأعور، وإن بين عينيه مكتوب كافر ‏\"‏‏.‏ فيه أبو هريرة وابن عباس عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"No prophet was sent but that he warned his followers against the one-eyed liar (Ad-Dajjal). Beware! He is blind in one eye, and your Lord is not so, and there will be written between his (Ad-Dajjal's) eyes (the word) Kafir (i.e., disbeliever).\" (This Hadith is also quoted by Abu Huraira and Ibn `Abbas).",
      "chain": [
        "20193",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "7230",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن الجعد، عن أبي رجاء، عن ابن عباس، يرويه قال قال النبي صلى الله عليه وسلم ‏\"‏ من رأى من أميره شيئا فكرهه فليصبر، فإنه ليس أحد يفارق الجماعة شبرا فيموت إلا مات ميتة جاهلية ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"If somebody sees his Muslim ruler doing something he disapproves of, he should be patient, for whoever becomes separate from the Muslim group even for a span and then dies, he will die as those who died in the Pre-lslamic period of ignorance (as rebellious sinners). (See Hadith No. 176 and 177)",
      "chain": [
        "20193",
        "20022",
        "11580",
        "11440"
      ]
    },
    {
      "hadith_no": "7341",
      "source": " Sahih Bukhari ",
      "chapter": "Accepting Information Given by a Truthful Person - كتاب أخبار الآحاد",
      "chapter_no": "96",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن أبي إسحاق، عن صلة، عن حذيفة، أن النبي صلى الله عليه وسلم قال لأهل نجران ‏\"‏ لأبعثن إليكم رجلا أمينا حق أمين ‏\"‏‏.‏ فاستشرف لها أصحاب النبي صلى الله عليه وسلم فبعث أبا عبيدة‏.‏",
      "text_en": " Narrated Hudhaifa:                     The Prophet said to the people of Najran, \"I will send to you an honest person who is really trustworthy.\" The Companion, of the Prophet each desired to be that person, but the Prophet sent Abu 'Ubaida.",
      "chain": [
        "20193",
        "20020",
        "11049",
        "145"
      ]
    },
    {
      "hadith_no": "7342",
      "source": " Sahih Bukhari ",
      "chapter": "Accepting Information Given by a Truthful Person - كتاب أخبار الآحاد",
      "chapter_no": "96",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن خالد، عن أبي قلابة، عن أنس  رضى الله عنه  قال النبي صلى الله عليه وسلم ‏\"‏ لكل أمة أمين، وأمين هذه الأمة أبو عبيدة ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"For every nation there is an Amin (honest, trustworthy person) and the Amin of this nation is Abu 'Ubaida.\"",
      "chain": [
        "20193",
        "20020",
        "11282",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "7343",
      "source": " Sahih Bukhari ",
      "chapter": "Accepting Information Given by a Truthful Person - كتاب أخبار الآحاد",
      "chapter_no": "96",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن يحيى بن سعيد، عن عبيد بن حنين، عن ابن عباس، عن عمر  رضى الله عنهم  قال وكان رجل من الأنصار إذا غاب عن رسول الله صلى الله عليه وسلم وشهدته أتيته بما يكون من رسول الله صلى الله عليه وسلم وإذا غبت عن رسول الله صلى الله عليه وسلم وشهد أتاني بما يكون من رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Umar:                     There was a man from the Ansar (who was a friend of mine). If he was not present in the company of Allah's Apostle I used to be present with Allah's Apostle, I would tell him what I used to hear from Allah's Apostle, and when I was absent from Allah's Apostle he used to be present with him, and he would tell me what he used to hear from Allah's Apostle .",
      "chain": [
        "20193",
        "20022",
        "20031",
        "11202",
        "17",
        "3"
      ]
    },
    {
      "hadith_no": "7348",
      "source": " Sahih Bukhari ",
      "chapter": "Accepting Information Given by a Truthful Person - كتاب أخبار الآحاد",
      "chapter_no": "96",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن أيوب، عن أبي عثمان، عن أبي موسى، أن النبي صلى الله عليه وسلم دخل حائطا وأمرني بحفظ الباب فجاء رجل يستأذن فقال ‏\"‏ ائذن له، وبشره بالجنة ‏\"‏‏.‏ فإذا أبو بكر، ثم جاء عمر فقال ‏\"‏ ائذن له، وبشره بالجنة ‏\"‏‏.‏ ثم جاء عثمان فقال ‏\"‏ ائذن له، وبشره بالجنة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet entered a garden and told me to guard its gate. Then a man came and asked permission to enter. The Prophet, said, \"Permit him and give him the good news that he will enter Paradise.\" Behold! It was Abu Bakr. Then `Umar came, and the Prophet said, \"Admit him and give him the good news that he will enter Paradise.\" Then `Uthman came and the Prophet said, \"Admit him and give him the good news that he will enter Paradise. \"",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11113",
        "41"
      ]
    },
    {
      "hadith_no": "7379",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن ثابت، عن أنس، قال كنا عند عمر فقال نهينا عن التكلف‏.‏",
      "text_en": " Narrated Anas:                     We were with `Umar and he said, \"We have been forbidden to undertake a difficult task beyond our capability (i.e. to exceed the religious limits e.g., to clean the inside of the eyes while doing ablution).",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "7410",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن أيوب، عن محمد، قال كنا عند أبي هريرة وعليه ثوبان ممشقان من كتان فتمخط فقال بخ بخ أبو هريرة يتمخط في الكتان، لقد رأيتني وإني لأخر فيما بين منبر رسول الله صلى الله عليه وسلم إلى حجرة عائشة مغشيا على، فيجيء الجائي فيضع رجله على عنقي، ويرى أني مجنون، وما بي من جنون، ما بي إلا الجوع‏.‏",
      "text_en": " Narrated Muhammad:                     We were with Abu Huraira while he was wearing two linen garments dyed with red clay. He cleaned his nose with his garment, saying, \"Bravo! Bravo! Abu Huraira is cleaning his nose with linen! There came a time when I would fall senseless between the pulpit of Allah's Apostle and `Aisha's dwelling whereupon a passerby would come and put his foot on my neck, considering me a mad man, but in fact, I had no madness, I suffered nothing but hunger.\"",
      "chain": [
        "20193",
        "20022",
        "11015",
        "20278"
      ]
    },
    {
      "hadith_no": "7476",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أيوب، عن أبي عثمان، عن أبي موسى، قال كنا مع النبي صلى الله عليه وسلم في سفر فكنا إذا علونا كبرنا فقال ‏\"‏ اربعوا على أنفسكم، فإنكم لا تدعون أصم ولا غائبا، تدعون سميعا بصيرا قريبا ‏\"‏‏.‏ ثم أتى على وأنا أقول في نفسي لا حول ولا قوة إلا بالله‏.‏ فقال لي ‏\"‏ يا عبد الله بن قيس قل لا حول ولا قوة إلا بالله‏.‏ فإنها كنز من كنوز الجنة ‏\"‏‏.‏ أو قال ألا أدلك به‏.‏",
      "text_en": " Narrated Abu Musa:                     We were with the Prophet on a journey, and whenever we ascended a high place, we used to say, \"Allahu Akbar.\" The Prophet said, \"Don't trouble yourselves too much! You are not calling a deaf or an absent person, but you are calling One Who Hears, Sees, and is very near.\" Then he came to me while I was saying in my heart, \"La hawla wala quwwatta illa billah (There is neither might nor power but with Allah).\" He said, to me, \"O `Abdullah bin Qais! Say, 'La hawla wala quwwata illa billah (There is neither might nor power but with Allah), for it is one of the treasures of Paradise.\" Or said, \"Shall I tell you of it?\"",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11113",
        "41"
      ]
    },
    {
      "hadith_no": "7603",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، حدثنا معبد بن هلال العنزي، قال اجتمعنا ناس من أهل البصرة فذهبنا إلى أنس بن مالك وذهبنا معنا بثابت إليه يسأله لنا عن حديث الشفاعة، فإذا هو في قصره فوافقناه يصلي الضحى، فاستأذنا، فأذن لنا وهو قاعد على فراشه فقلنا لثابت لا تسأله عن شىء أول من حديث الشفاعة فقال يا أبا حمزة هؤلاء إخوانك من أهل البصرة جاءوك يسألونك عن حديث الشفاعة‏.‏ فقال حدثنا محمد صلى الله عليه وسلم قال ‏\"‏ إذا كان يوم القيامة ماج الناس بعضهم في بعض فيأتون آدم فيقولون اشفع لنا إلى ربك‏.‏ فيقول لست لها ولكن عليكم بإبراهيم فإنه خليل الرحمن‏.‏ فيأتون إبراهيم فيقول لست لها ولكن عليكم بموسى فإنه كليم الله‏.‏ فيأتون موسى فيقول لست لها ولكن عليكم بعيسى فإنه روح الله وكلمته‏.‏ فيأتون عيسى فيقول لست لها ولكن عليكم بمحمد صلى الله عليه وسلم فيأتوني فأقول أنا لها‏.‏ فأستأذن على ربي فيؤذن لي ويلهمني محامد أحمده بها لا تحضرني الآن، فأحمده بتلك المحامد وأخر له ساجدا فيقال يا محمد ارفع رأسك، وقل يسمع لك، وسل تعط، واشفع تشفع‏.‏ فأقول يا رب أمتي أمتي‏.‏ فيقال انطلق فأخرج من كان في قلبه مثقال شعيرة من إيمان‏.‏ فأنطلق فأفعل ثم أعود فأحمده بتلك المحامد، ثم أخر له ساجدا فيقال يا محمد ارفع رأسك، وقل يسمع لك، وسل تعط، واشفع تشفع، فأقول يا رب أمتي أمتي‏.‏ فيقال انطلق فأخرج منها من كان في قلبه مثقال ذرة أو خردلة من إيمان‏.‏ فأنطلق فأفعل ثم أعود فأحمده بتلك المحامد، ثم أخر له ساجدا فيقال يا محمد ارفع رأسك، وقل يسمع لك، وسل تعط، واشفع تشفع‏.‏ فأقول يا رب أمتي أمتي‏.‏ فيقول انطلق فأخرج من كان في قلبه أدنى أدنى أدنى مثقال حبة خردل من إيمان، فأخرجه من النار‏.‏ فأنطلق فأفعل ‏\"‏‏.‏ فلما خرجنا من عند أنس قلت لبعض أصحابنا لو مررنا بالحسن وهو متوار في منزل أبي خليفة فحدثنا بما حدثنا أنس بن مالك، فأتيناه فسلمنا عليه فأذن لنا فقلنا له يا أبا سعيد جئناك من عند أخيك أنس بن مالك فلم نر مثل ما حدثنا في الشفاعة، فقال هيه، فحدثناه بالحديث فانتهى إلى هذا الموضع فقال هيه، فقلنا لم يزد لنا على هذا‏.‏ فقال لقد حدثني وهو جميع منذ عشرين سنة فلا أدري أنسي أم كره أن تتكلوا‏.‏ قلنا يا أبا سعيد فحدثنا، فضحك وقال خلق الإنسان عجولا ما ذكرته إلا وأنا أريد أن أحدثكم حدثني كما حدثكم به قال ‏\"‏ ثم أعود الرابعة فأحمده بتلك، ثم أخر له ساجدا فيقال يا محمد ارفع رأسك وقل يسمع، وسل تعطه، واشفع تشفع‏.‏ فأقول يا رب ائذن لي فيمن قال لا إله إلا الله‏.‏ فيقول وعزتي وجلالي وكبريائي وعظمتي لأخرجن منها من قال لا إله إلا الله ‏\"‏‏.‏",
      "text_en": " Narrated Ma`bad bin Hilal Al-`Anzi:                     We, i.e., some people from Basra gathered and went to Anas bin Malik, and we went in company with Thabit Al-Bunnani so that he might ask him about the Hadith of Intercession on our behalf. Behold, Anas was in his palace, and our arrival coincided with his Duha prayer. We asked permission to enter and he admitted us while he was sitting on his bed. We said to Thabit, \"Do not ask him about anything else first but the Hadith of Intercession.\" He said, \"O Abu Hamza! There are your brethren from Basra coming to ask you about the Hadith of Intercession.\" Anas then said, \"Muhammad talked to us saying, 'On the Day of Resurrection the people will surge with each other like waves, and then they will come to Adam and say, 'Please intercede for us with your Lord.' He will say, 'I am not fit for that but you'd better go to Abraham as he is the Khalil of the Beneficent.' They will go to Abraham and he will say, 'I am not fit for that, but you'd better go to Moses as he is the one to whom Allah spoke directly.' So they will go to Moses and he will say, 'I am not fit for that, but you'd better go to Jesus as he is a soul created by Allah and His Word.' (Be: And it was) they will go to Jesus and he will say, 'I am not fit for that, but you'd better go to Muhammad.' They would come to me and I would say, 'I am for that.' Then I will ask for my Lord's permission, and it will be given, and then He will inspire me to praise Him with such praises as I do not know now. So I will praise Him with those praises and will fall down, prostrate before Him. Then it will be said, 'O Muhammad, raise your head and speak, for you will be listened to; and ask, for your will be granted (your request); and intercede, for your intercession will be accepted.' I will say, 'O Lord, my followers! My followers!' And then it will be said, 'Go and take out of Hell (Fire) all those who have faith in their hearts, equal to the weight of a barley grain.' I will go and do so and return to praise Him with the same praises, and fall down (prostrate) before Him. Then it will be said, 'O Muhammad, raise your head and speak, for you will be listened to, and ask, for you will be granted (your request); and intercede, for your intercession will be accepted.' I will say, 'O Lord, my followers! My followers!' It will be said, 'Go and take out of it all those who have faith in their hearts equal to the weight of a small ant or a mustard seed.' I will go and do so and return to praise Him with the same praises, and fall down in prostration before Him. It will be said, 'O, Muhammad, raise your head and speak, for you will be listened to, and ask, for you will be granted (your request); and intercede, for your intercession will be accepted.' I will say, 'O Lord, my followers!' Then He will say, 'Go and take out (all those) in whose hearts there is faith even to the lightest, lightest mustard seed. (Take them) out of the Fire.' I will go and do so.\"' When we left Anas, I said to some of my companions, \"Let's pass by Al-Hasan who is hiding himself in the house of Abi Khalifa and request him to tell us what Anas bin Malik has told us.\" So we went to him and we greeted him and he admitted us. We said to him, \"O Abu Sa`id! We came to you from your brother Anas Bin Malik and he related to us a Hadith about the intercession the like of which I have never heard.\" He said, \"What is that?\" Then we told him of the Hadith and said, \"He stopped at this point (of the Hadith).\" He said, \"What then?\" We said, \"He did not add anything to that.\" He said, Anas related the Hadith to me twenty years ago when he was a young fellow. I don't know whether he forgot or if he did not like to let you depend on what he might have said.\" We said, \"O Abu Sa`id ! Let us know that.\" He smiled and said, \"Man was created hasty. I did not mention that, but that I wanted to inform you of it. Anas told me the same as he told you and said that the Prophet added, 'I then return for a fourth time and praise Him similarly and prostrate before Him me the same as he 'O Muhammad, raise your head and speak, for you will be listened to; and ask, for you will be granted (your request): and intercede, for your intercession will be accepted .' I will say, 'O Lord, allow me to intercede for whoever said, 'None has the right to be worshiped except Allah.' Then Allah will say, 'By my Power, and my Majesty, and by My Supremacy, and by My Greatness, I will take out of Hell (Fire) whoever said: 'None has the right to be worshipped except Allah.' ''",
      "chain": [
        "20193",
        "20022",
        "11612"
      ]
    },
    {
      "hadith_no": "69",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "حدثني حجاج بن الشاعر، حدثنا سليمان بن حرب، حدثنا حماد بن زيد، قال قال أيوب إن لي جارا - ثم ذكر من فضله - ولو شهد عندي على تمرتين ما رأيت شهادته جائزة ‏.‏",
      "text_en": "",
      "chain": [
        "38834",
        "20193",
        "20022",
        "11015"
      ]
    },
    {
      "hadith_no": "77",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا سليمان بن حرب، حدثنا ابن زيد، - يعني حمادا - قال قيل لأيوب إن عمرو بن عبيد روى عن الحسن قال لا يجلد السكران من النبيذ ‏.‏ فقال كذب أنا سمعت الحسن يقول يجلد السكران من النبيذ ‏.‏",
      "text_en": "",
      "chain": [
        "38834",
        "20193",
        "24341",
        "11016",
        "11016"
      ]
    },
    {
      "hadith_no": "78",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني حجاج، حدثنا سليمان بن حرب، قال سمعت سلام بن أبي مطيع، يقول بلغ أيوب أني آتي عمرا فأقبل على يوما فقال أرأيت رجلا لا تأمنه على دينه كيف تأمنه على الحديث",
      "text_en": "",
      "chain": [
        "20219",
        "20193",
        "20550"
      ]
    },
    {
      "hadith_no": "99",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "حدثني أحمد بن إبراهيم، قال حدثني سليمان بن حرب، عن حماد بن زيد، قال ذكر فرقد عند أيوب فقال إن فرقدا ليس صاحب حديث ‏.‏",
      "text_en": "",
      "chain": [
        "30494",
        "20193",
        "20022"
      ]
    },
    {
      "hadith_no": "326",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، جميعا عن سليمان، - قال أبو بكر حدثنا سليمان بن حرب، - حدثنا حماد بن زيد، عن حجاج الصواف، عن أبي الزبير، عن جابر، أن الطفيل بن عمرو الدوسي، أتى النبي صلى الله عليه وسلم فقال يا رسول الله هل لك في حصن حصين ومنعة - قال حصن كان لدوس في الجاهلية - فأبى ذلك النبي صلى الله عليه وسلم للذي ذخر الله للأنصار فلما هاجر النبي صلى الله عليه وسلم إلى المدينة هاجر إليه الطفيل بن عمرو وهاجر معه رجل من قومه فاجتووا المدينة فمرض فجزع فأخذ مشاقص له فقطع بها براجمه فشخبت يداه حتى مات فرآه الطفيل بن عمرو في منامه فرآه وهيئته حسنة ورآه مغطيا يديه فقال له ما صنع بك ربك فقال غفر لي بهجرتي إلى نبيه صلى الله عليه وسلم فقال ما لي أراك مغطيا يديك قال قيل لي لن نصلح منك ما أفسدت ‏.‏ فقصها الطفيل على رسول الله صلى الله عليه وسلم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم وليديه فاغفر ‏\"‏",
      "text_en": " It is narrated on the authority of Jabir that Tufail son of Amr al-Dausi came to the Apostle (may peace be upon him) and said:                      Do you need strong, fortified protection? The tribe of Daus had a fort in the pre-Islamic days. The Apostle (may peace be upon him) declined this offer, since it (the privilege of protecting the Holy Prophet) had already been reserved for the Ansar. When the Apostle (may peace be upon him) migrated to Medina, Tufail son of Amr also migrated to that place, and there also migrated along with him a man of his tribe. But the climate of Medina did not suit him, and he fell sick. He felt very uneasy. So he took hold of an iron head of an arrow and cut his finger-joints. The blood streamed forth from his hands, till he died. Tufail son of Amr saw him in a dream. His state was good and he saw him with his hands wrapped. He (Tufail) said to him: What treatment did your Allah accord to you? He replied. Allah granted me pardon for my migration to the Apostle (may peace be upon him): He (Tufail) again said: What is this that I see you wrapping up your hands? He replied: I was told (by Allah): We would not set right anything of yours which you damaged yourself. Tufail narrated this (dream) to the Messenger of Allah (may peace be upon him). Upon this he prayed: O Allah I grant pardon even to his hands.",
      "chain": [
        "30201",
        "30123",
        "20160",
        "20436",
        "20193",
        "20022",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1597",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا سليمان بن حرب، حدثنا حماد بن سلمة، عن حميد، عن بكر بن عبد الله، عن عبد الله بن رباح، عن أبي قتادة، قال كان رسول الله صلى الله عليه وسلم إذا كان في سفر فعرس بليل اضطجع على يمينه وإذا عرس قبيل الصبح نصب ذراعه ووضع رأسه على كفه ‏.‏",
      "text_en": " Abu Qatada reported that when the Messenger of Allah (may peace be upon him) was in a journey he got down for rest at night, and he used to lie down on his right side, and when he lay down for rest before the dawn, he used to stretch his forearm and place his head over his palm.",
      "chain": [
        "30123",
        "20193",
        "20021",
        "11279",
        "11267",
        "11865",
        "391"
      ]
    },
    {
      "hadith_no": "3624",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن ابن عون، قال حدثت محمدا، عن إبراهيم، بحديث عبد الرحمن بن بشر - يعني حديث العزل - فقال إياى حدثه عبد الرحمن بن بشر، ‏.‏",
      "text_en": " Ibn 'Aun reported:                      I reported to Muhammad on the authority of Ibrahim the hadith reported by 'Abd al-Rahmann b. Bishr (the hadith concerning 'azl), where- upon he said: That (hadith) Abd al-Rahman b. Bishr had narrated to me (also).",
      "chain": [
        "38834",
        "20193",
        "20022",
        "11071"
      ]
    },
    {
      "hadith_no": "3748",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا سليمان بن حرب، عن حماد بن زيد، عن أيوب السختياني، عن إبراهيم بن ميسرة، عن طاوس، أن أبا الصهباء، قال لابن عباس هات من هناتك ألم يكن الطلاق الثلاث على عهد رسول الله صلى الله عليه وسلم وأبي بكر واحدة فقال قد كان ذلك فلما كان في عهد عمر تتايع الناس في الطلاق فأجازه عليهم ‏.‏",
      "text_en": " Abu al-Sahba' said to Ibn 'Abbas:                      Enlighten us with your information whether the three divorces (pronounced at one and the same time) were not treated as one during the lifetime of Allah's Messenger (may peace be upon him) and Abu Bakr. He said: It was in fact so, but when during the caliphate of 'Umar (Allah be pleased with him) people began to pronounce divorce frequently, he allowed them to do so (to treat pronouncements of three divorces in a single breath as one).",
      "chain": [
        "30123",
        "20193",
        "20022",
        "11015",
        "11240",
        "11053"
      ]
    },
    {
      "hadith_no": "4447",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "وحدثنا هارون بن عبد الله، حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أيوب، عن أبي رجاء، مولى أبي قلابة قال قال أبو قلابة حدثنا أنس بن مالك، قال قدم على رسول الله صلى الله عليه وسلم قوم من عكل أو عرينة فاجتووا المدينة فأمر لهم رسول الله صلى الله عليه وسلم بلقاح وأمرهم أن يشربوا من أبوالها وألبانها ‏.‏ بمعنى حديث حجاج بن أبي عثمان ‏.‏ قال وسمرت أعينهم وألقوا في الحرة يستسقون فلا يسقون.",
      "text_en": " Anas b. Malik reported that some people of the tribe of 'Ukl or 'Uraina came to Allah's Messenger (may peace be upon him), and they found the climate of Medina uncogenial. Allah's Messenger (may peace be upon him) commanded them to the milch she-camels and commanded them to drink their urine and their milk. The rest of the hadith is the same (and the concluding words are):                     \" Their eyes were pierced, and they were thrown on the stony ground. They were asking for water, but they were not given water.\"",
      "chain": [
        "30524",
        "20193",
        "20022",
        "11015",
        "11592",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "4841",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني أحمد بن سعيد بن صخر الدارمي، حدثنا سليمان بن حرب، حدثنا حماد، - يعني ابن زيد - عن أيوب، عن يحيى بن سعيد، عن أبي زرعة بن عمرو بن جرير، عن أبي هريرة، قال ذكر رسول الله صلى الله عليه وسلم الغلول فعظمه ‏.‏ واقتص الحديث قال حماد ثم سمعت يحيى بعد ذلك يحدثه فحدثنا بنحو ما حدثنا عنه أيوب ‏.‏",
      "text_en": " Abu Huraira has narrated this hadith with a slight variation of words.",
      "chain": [
        "30296",
        "20193",
        "20022",
        "11015",
        "11062",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "6786",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني سليمان بن معبد، حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أيوب، عن عبد الرحمن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم بنحوه ‏.‏",
      "text_en": " A hadith like this has been reported on the authority of Abu Huraira through another chain of transmitters.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "7600",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا سليمان بن حرب، حدثنا حماد، - يعني ابن زيد - حدثنا معبد بن هلال العنزي، عن أنس بن مالك، أن رجلا، سأل النبي صلى الله عليه وسلم قال متى تقوم الساعة قال فسكت رسول الله صلى الله عليه وسلم هنيهة ثم نظر إلى غلام بين يديه من أزد شنوءة فقال ‏\"‏ إن عمر هذا لم يدركه الهرم حتى تقوم الساعة ‏\"‏ ‏.‏ قال قال أنس ذاك الغلام من أترابي يومئذ ‏.‏",
      "text_en": " Anas b. Malik reported that a person asked Allah's Apostle (may peace be upon him):                      When would the Last Hour come? Thereupon Allah's Messenger (way peace be upon him) kept quiet for a while. then looked at a young boy in his presence belonging to the tribe of Azd Shanilwa and he said: If this boy lives he would not grow very old till the Last Hour would come to you. Anas said that this young boy was of our age daring those days.",
      "chain": [
        "38834",
        "20193",
        "20022",
        "11612",
        "19"
      ]
    },
    {
      "hadith_no": "134",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، ح وحدثنا مسدد، وقتيبة، عن حماد بن زيد، عن سنان بن ربيعة، عن شهر بن حوشب، عن أبي أمامة، وذكر، وضوء النبي، صلى الله عليه وسلم قال كان رسول الله صلى الله عليه وسلم يمسح المأقين ‏.‏ قال وقال ‏\"‏ الأذنان من الرأس ‏\"‏ ‏.‏ قال سليمان بن حرب يقولها أبو أمامة ‏.‏ قال قتيبة قال حماد لا أدري هو من قول النبي صلى الله عليه وسلم أو من أبي أمامة ‏.‏ يعني قصة الأذنين ‏.‏ قال قتيبة عن سنان أبي ربيعة ‏.‏ قال أبو داود وهو ابن ربيعة كنيته أبو ربيعة ‏.‏",
      "text_en": " Narrated AbuUmamah:                     AbuUmamah mentioned how the Messenger of Allah (ﷺ) performed ablution, saying that he used to wipe the corners of his eyes, and he said that the ears are treated as part of the head.Sulaiman b. Harb said: the wording \"the ears are treated as part of the head\" were uttered by Abu Umamah.Hammad said: I do not know whether the phrase \"the ears are treated as part of the head\" was he statement of the Prophet (ﷺ) or of Abu Umamah.",
      "chain": [
        "20193",
        "20022",
        "30175",
        "30367",
        "20022",
        "11595",
        "11044",
        "405"
      ]
    },
    {
      "hadith_no": "242",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا سليمان بن حرب الواشحي، ومسدد، قالا حدثنا حماد، عن هشام بن عروة، عن أبيه، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا اغتسل من الجنابة - قال سليمان يبدأ فيفرغ من يمينه على شماله ‏.‏ وقال مسدد غسل يديه يصب الإناء على يده اليمنى ثم اتفقا فيغسل فرجه ‏.‏ - قال مسدد - يفرغ على شماله وربما كنت عن الفرج ثم يتوضأ وضوءه للصلاة ثم يدخل يديه في الإناء فيخلل شعره حتى إذا رأى أنه قد أصاب البشرة أو أنقى البشرة أفرغ على رأسه ثلاثا فإذا فضل فضلة صبها عليه ‏.‏",
      "text_en": " 'Aishah reported :                      When the Messenger of Allah (May peace be upon him) would take a bath because of sexual defilement, according to the version of Sulaiman, in the beginning he would pour water with his right hand (upon his left hand); and according to the version of Musaddad, he would wash both (hands) pouring water from the vessel upon his right hand. According to the agreed version, he then would wash the private part. He would then perform ablution as he did for prayer, then put his hands in the vessel and made the water go through his hair. When he knew that water had reached the entire surface of the body and cleaned it well, he would pour water upon his head three times. If some water was left, he would pour it also upon himself.",
      "chain": [
        "20193",
        "30175",
        "20022",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "368",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا الحسن بن علي، حدثنا سليمان بن حرب، حدثنا حماد، عن هشام، عن ابن سيرين، عن عائشة، أن النبي صلى الله عليه وسلم كان لا يصلي في ملاحفنا ‏.‏ قال حماد وسمعت سعيد بن أبي صدقة قال سألت محمدا عنه فلم يحدثني وقال سمعته منذ زمان ولا أدري ممن سمعته ولا أدري أسمعته من ثبت أو لا فسلوا عنه ‏.‏",
      "text_en": " 'Aishah said:                      The Prophet (ﷺ) would not in our quilts. Hammad said: I heard Sa'id b. Abi Sadaqah say: I asked Muhammad (b. Sirin) about it. He did not narrate it to me, but said: I heard it a long time ago and I do not know whom I heard it. I do not know whether I heard it from a trustworthy person or not. Make an inquiry about it.",
      "chain": [
        "30115",
        "20193",
        "20022",
        "11065",
        "11035",
        "53"
      ]
    },
    {
      "hadith_no": "508",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان بن حرب، وعبد الرحمن بن المبارك، قالا حدثنا حماد، عن سماك بن عطية، ح وحدثنا موسى بن إسماعيل، حدثنا وهيب، جميعا عن أيوب، عن أبي قلابة، عن أنس، قال أمر بلال أن يشفع، الأذان ويوتر الإقامة ‏.‏ زاد حماد في حديثه إلا الإقامة ‏.‏",
      "text_en": " Anas reported; Bilal was commanded to pronounce Adhan in double pairs and IQAMAH in single pairs.Hammam added in his version; “except IQAMAH”.",
      "chain": [
        "20193",
        "30147",
        "20022",
        "20040",
        "20299",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "552",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن عاصم بن بهدلة، عن أبي رزين، عن ابن أم مكتوم، أنه سأل النبي صلى الله عليه وسلم فقال يا رسول الله إني رجل ضرير البصر شاسع الدار ولي قائد لا يلائمني فهل لي رخصة أن أصلي في بيتي قال ‏\"‏ هل تسمع النداء ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ لا أجد لك رخصة ‏\"‏ ‏.‏",
      "text_en": " Narrated Amr ibn Za'dah, Ibn Umm Maktum:                     Ibn Umm Maktum asked the Prophet (ﷺ) saying: Messenger of Allah, I am a blind man, my house is far away (from the mosque), and I have a guide who does not follow me. Is it possible that permission be granted to me for saying prayer in my house? He asked: Do you hear summons (adhan)? He said: Yes. He said: I do not find any permission for you.",
      "chain": [
        "20193",
        "20022",
        "11358",
        "10826"
      ]
    },
    {
      "hadith_no": "566",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن أيوب، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تمنعوا إماء الله مساجد الله ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Umar reported the Messenger of Allah (May peace be upon him) as saying; Do not prevent the female servant your women from visiting the mosques of Allah.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "603",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان بن حرب، ومسلم بن إبراهيم، - المعنى - عن وهيب، عن مصعب بن محمد، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما جعل الإمام ليؤتم به فإذا كبر فكبروا ولا تكبروا حتى يكبر وإذا ركع فاركعوا ولا تركعوا حتى يركع وإذا قال سمع الله لمن حمده فقولوا اللهم ربنا لك الحمد ‏\"‏ ‏.‏ قال مسلم ‏\"‏ ولك الحمد ‏\"‏ ‏.‏ ‏\"‏ وإذا سجد فاسجدوا ولا تسجدوا حتى يسجد وإذا صلى قائما فصلوا قياما وإذا صلى قاعدا فصلوا قعودا أجمعون ‏\"‏ ‏.‏ قال أبو داود ‏\"‏ اللهم ربنا لك الحمد ‏\"‏ ‏.‏ أفهمني بعض أصحابنا عن سليمان ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: The imam is appointed only to be followed; when he says \"Allah is most great,\" say \"Allah is most great\" and do not say \"Allah is most great\" until he says \"Allah is most great.\" When he bows; bow; and do not bow until he bows. And when he says \"Allah listens to him who praise Him,\" say \"O Allah, our Lord, to Thee be the praise.\" The version recorded by Muslim goes: \"And to Thee be the praise:  And when he prostrate; and do not prostrate until he prostrates. When he prays standing, pray standing, and when he prays sitting, all of you pray sitting.Abu Dawud said: The words \"O Allah, our Lord, to You be the praise\" reported by Sulaiman were explained to me by some of our companions.",
      "chain": [
        "20193",
        "20285",
        "20299",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "635",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أيوب، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم أو قال قال عمر رضى الله عنه ‏\"‏ إذا كان لأحدكم ثوبان فليصل فيهما فإن لم يكن إلا ثوب واحد فليتزر به ولا يشتمل اشتمال اليهود ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Umar reported the Messenger of Allah (ﷺ) as saying, or reported ‘Umar as saying (the narrator is doubtful):                      if one of you has two (piece of) cloth, he should pray in them; if he has a single (piece of) cloth, he should use it as a wrapper, and should not hang it upon the shoulder like the Jews.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "668",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو الوليد الطيالسي، وسليمان بن حرب، قالا حدثنا شعبة، عن قتادة، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ سووا صفوفكم فإن تسوية الصف من تمام الصلاة ‏\"‏ ‏.‏",
      "text_en": " Anas reported the Messenger of Allah (ﷺ) as saying :                      Straighten your rows for the straightening of the rows is part of perfecting the prayer.",
      "chain": [
        "20296",
        "20193",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "682",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان بن حرب، وحفص بن عمر، قالا حدثنا شعبة، عن عمرو بن مرة، عن هلال بن يساف، عن عمرو بن راشد، عن وابصة، أن رسول الله صلى الله عليه وسلم رأى رجلا يصلي خلف الصف وحده فأمره أن يعيد - قال سليمان بن حرب - الصلاة ‏.‏",
      "text_en": " Narrated Wabisah:                     The Messenger of Allah (ﷺ) saw a man praying alone behind the row. He ordered him to repeat. Sulayman ibn Harb said: The prayer.",
      "chain": [
        "20193",
        "30329",
        "20020",
        "11381",
        "10835"
      ]
    },
    {
      "hadith_no": "709",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان بن حرب، وحفص بن عمر، قالا حدثنا شعبة، عن عمرو بن مرة، عن يحيى بن الجزار، عن ابن عباس، أن النبي صلى الله عليه وسلم كان يصلي فذهب جدى يمر بين يديه فجعل يتقيه ‏.‏",
      "text_en": " Ibn ‘Abbas said:                      The Prophet (ﷺ) was (once) praying. A kid went passing in front of him and he kept on stopping it.",
      "chain": [
        "20193",
        "30329",
        "20020",
        "11381",
        "10839",
        "17"
      ]
    },
    {
      "hadith_no": "835",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن غيلان بن جرير، عن مطرف، قال صليت أنا وعمران بن حصين، خلف علي بن أبي طالب - رضى الله عنه - فكان إذا سجد كبر وإذا ركع كبر وإذا نهض من الركعتين كبر فلما انصرفنا أخذ عمران بيدي وقال لقد صلى هذا قبل أو قال لقد صلى بنا هذا قبل صلاة محمد صلى الله عليه وسلم ‏.‏",
      "text_en": " Mutarrif said:                      I and ‘Imran b. Husain offered prayer behind ‘All b. AbI Talib(may Allah be pleased with him). When he prostrated, he uttered the takbir (Allah is most great) and when he bowed, he uttered the takbir and when he stood up at the end of two rak’ahs, he uttered the takbir. When we finished our prayer, ‘Imran caught hold of my hand, and said: He has led us in prayer just now like the prayer offered by Muhammed(may peace by upon him).",
      "chain": [
        "20193",
        "20022",
        "11300",
        "11395"
      ]
    },
    {
      "hadith_no": "889",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، وسليمان بن حرب، قالا حدثنا حماد بن زيد، عن عمرو بن دينار، عن طاوس، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ أمرت ‏\"‏ ‏.‏ قال حماد أمر نبيكم صلى الله عليه وسلم - أن يسجد على سبعة ولا يكف شعرا ولا ثوبا ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     Ibn Abbas reported the Prophet (ﷺ) as saying: I have been commanded - according to the version of Hammad: Your Prophet (ﷺ) was commanded - to prostrate on seven (bones), and not to fold back the hair or the clothing.",
      "chain": [
        "30175",
        "20193",
        "20022",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1011",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا علي بن نصر بن علي، حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أيوب، وهشام، ويحيى بن عتيق، وابن، عون عن محمد، عن أبي هريرة، عن النبي صلى الله عليه وسلم في قصة ذي اليدين أنه كبر وسجد ‏.‏ وقال هشام يعني ابن حسان كبر ثم كبر وسجد ‏.‏ قال أبو داود روى هذا الحديث أيضا حبيب بن الشهيد وحميد ويونس وعاصم الأحول عن محمد عن أبي هريرة لم يذكر أحد منهم ما ذكر حماد بن زيد عن هشام أنه كبر ثم كبر وسجد وروى حماد بن سلمة وأبو بكر بن عياش هذا الحديث عن هشام لم يذكرا عنه هذا الذي ذكره حماد بن زيد أنه كبر ثم كبر ‏.‏",
      "text_en": " The above mentioned tradition has also been narrated by Abu Hurairah through a different chain of transmitters. This version goes :                      the Prophet (ﷺ) uttered the takbir and prostrated himself (in a tradition relating to the incidence of the possessor of arms [Dhu al-yadain]). The narrator Hisham, I,e, Ibn Hassan said: he uttered the takbir ; then he uttered the takbir and prostrated himself.Abu Dawud said : This tradition has also been narrated by Habib b. al-shahid, Humaid, Yunus, and Asim b. al-Ahwal, from Muhammad on the authority of abu Hurairah none of them mentioned what Hammad b. Zaid mentioned from from Hisham that he uttered the takbir; then uttered the takbir and prostrated himself. Hammad b. Sulaimah and Abu BAkr b. ‘Ayyash also narrated this tradition from Hisham, but they did not narrate from him what HAmmad b. zaid narrated that he uttered the takbir and again uttered the takbir.",
      "chain": [
        "30557",
        "20193",
        "20022",
        "11015",
        "11065",
        "11315",
        "11071",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "1115",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن عمرو، - وهو ابن دينار - عن جابر، أن رجلا، جاء يوم الجمعة والنبي صلى الله عليه وسلم يخطب فقال ‏\"‏ أصليت يا فلان ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ قم فاركع ‏\"‏ ‏.‏",
      "text_en": " Jabir said:                      I came (to the mouse) while the Prophet (ﷺ) was giving the (Friday) sermon. He asked: Did you pray, so-and-so? He replied: No. He said: Stand and pray.",
      "chain": [
        "20193",
        "20022",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "1265",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن عاصم، عن عبد الله بن سرجس، قال جاء رجل والنبي صلى الله عليه وسلم يصلي الصبح فصلى الركعتين ثم دخل مع النبي صلى الله عليه وسلم في الصلاة فلما انصرف قال ‏\"‏ يا فلان أيتهما صلاتك التي صليت وحدك أو التي صليت معنا ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Abd Allah b. Sarjas:                     A man came while the Prophet (ﷺ) was leading the people in the dawn prayer. He prayed the two rak'ahs and then joined the congregational prayer led by the Prophet (ﷺ). When he finished the prayer, the Prophet (ﷺ) said:  So-and-so, which was your real prayer, the one you prayed alone or the one offered with us ?",
      "chain": [
        "20193",
        "20022",
        "11080",
        "3245"
      ]
    },
    {
      "hadith_no": "1378",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا سليمان بن حرب، ومسدد، - المعنى - قالا حدثنا حماد بن زيد، عن عاصم، عن زر، قال قلت لأبى بن كعب أخبرني عن ليلة القدر، يا أبا المنذر فإن صاحبنا سئل عنها ‏.‏ فقال من يقم الحول يصبها ‏.‏ فقال رحم الله أبا عبد الرحمن والله لقد علم أنها في رمضان - زاد مسدد ولكن كره أن يتكلوا أو أحب أن لا يتكلوا ثم اتفقا - والله إنها لفي رمضان ليلة سبع وعشرين لا يستثني ‏.‏ قلت يا أبا المنذر أنى علمت ذلك قال بالآية التي أخبرنا رسول الله صلى الله عليه وسلم ‏.‏ قلت لزر ما الآية قال تصبح الشمس صبيحة تلك الليلة مثل الطست ليس لها شعاع حتى ترتفع ‏.‏",
      "text_en": " Zirr (b. Hubaish) said:                      I said to Ubayy b. Ka'b: Tell me about lailat al-qadr, O Abu al-Mundhir, for our companion (Ibn Mas'ud) was questioned about it, and he said: Anyone who gets up for prayer every night all the year round will hit upon it (i.e. lailat al-qadr). He replied: May Allah have mercy on Abu 'Abd al-Rahman. By Allah, he knew that it was in Ramadan, (Musaddad's version goes) but he disliked that the people should content themselves (with that night alone); or he liked that the people should not content themselves (with the night alone). According to the agreed version: By Allah, it is the twenty-seventh night of Ramadan, without any reservation. I said: How did you know that, Abu al-Mundhir? He replied: By the indication (or sign) of which the Messenger of Allah (ﷺ) informed us. I asked Zirr: What is the sign ? He replied: The sun rises like a vessel of water in the morning following that night; it has no rays until it rises high up.",
      "chain": [
        "20193",
        "30175",
        "20022",
        "11080",
        "11337",
        "39"
      ]
    },
    {
      "hadith_no": "1389",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا سليمان بن حرب، أخبرنا حماد، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ صم من كل شهر ثلاثة أيام واقرإ القرآن في شهر ‏\"‏ ‏.‏ فناقصني وناقصته فقال ‏\"‏ صم يوما وأفطر يوما ‏\"‏ ‏.‏ قال عطاء واختلفنا عن أبي فقال بعضنا سبعة أيام وقال بعضنا خمسا ‏.‏",
      "text_en": " Narrated 'Abd Allah b. 'Amr:                     The Messenger of Allah (ﷺ) said to me: Keep fast for three days of month, and finish the recitation of the Qur'an in one month. I and he differed among ourselves on period of time. He said: Fast one day and give it up other day. The narrator 'Ata said: The people differed from my father (in narrating the period of time). Some narrated seven days and others five.",
      "chain": [
        "20193",
        "20022",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "hadith_no": "1444",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا سليمان بن حرب، ومسدد، قالا حدثنا حماد، عن أيوب، عن محمد، عن أنس بن مالك، أنه سئل هل قنت رسول الله صلى الله عليه وسلم في صلاة الصبح فقال نعم ‏.‏ فقيل له قبل الركوع أو بعد الركوع قال بعد الركوع ‏.‏ قال مسدد بيسير ‏.‏",
      "text_en": " Muhammad reported:                      Anas b. Malik was asked whether the Messenger of Allah (ﷺ) had recited supplication in the dawn prayer. He replied: Yes. He was again asked whether before bowing or after bowing. He said after bowing.This version of Musaddad adds the words: \"For a short period.\"",
      "chain": [
        "20193",
        "30175",
        "20022",
        "11015",
        "11035",
        "19"
      ]
    },
    {
      "hadith_no": "1498",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن عاصم بن عبيد الله، عن سالم بن عبد الله، عن أبيه، عن عمر، - رضى الله عنه - قال استأذنت النبي صلى الله عليه وسلم في العمرة فأذن لي وقال ‏\"‏ لا تنسنا يا أخى من دعائك ‏\"‏ ‏.‏ فقال كلمة ما يسرني أن لي بها الدنيا قال شعبة ثم لقيت عاصما بعد بالمدينة فحدثنيه وقال ‏\"‏ أشركنا يا أخى في دعائك ‏\"‏ ‏.‏",
      "text_en": " Narrated Umar ibn al-Khattab:                     I sought permission of the Prophet (ﷺ) to perform umrah. He gave me permission and said: My younger brother, do not forget me in your supplication. He (Umar) said: He told me a word that pleased me so much so that I would not have been pleased if I were given the whole world. The narrator Shu'bah said: I then met Asim at Medina. He narrated to me this tradition and reported the wordings: \"My younger brother, share me in your supplication.\"",
      "chain": [
        "20193",
        "20020",
        "19808",
        "11011",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "1515",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا سليمان بن حرب، ومسدد، قالا حدثنا حماد، عن ثابت، عن أبي بردة، عن الأغر المزني، - قال مسدد في حديثه وكانت له صحبة - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنه ليغان على قلبي وإني لأستغفر الله في كل يوم مائة مرة ‏\"‏ ‏.‏",
      "text_en": " Al-Agharr al-Muzani said (Musaddad in his version of this tradition said that he was a Companion of the Prophet):                      The Messenger of Allah (ﷺ) said: My heart is invaded by unmindfulness, and I ask Allah's pardon a hundred times in the day.",
      "chain": [
        "20193",
        "30175",
        "20022",
        "11269",
        "11901"
      ]
    },
    {
      "hadith_no": "1738",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن عمرو بن دينار، عن طاوس، عن ابن عباس، وعن ابن طاوس، عن أبيه، قالا وقت رسول الله صلى الله عليه وسلم بمعناه قال أحدهما ولأهل اليمن يلملم ‏.‏ وقال أحدهما ألملم قال ‏\"‏ فهن لهم ولمن أتى عليهن من غير أهلهن ممن كان يريد الحج والعمرة ومن كان دون ذلك ‏.‏ - قال ابن طاوس - من حيث أنشأ قال وكذلك حتى أهل مكة يهلون منها ‏\"‏ ‏.‏",
      "text_en": " Ibn `Abbas and Tawus reported :                      The Messenger of Allah (SWAS) appointed places for putting on Ihram and narrated the rest of the tradition to the same effect (as mentioned above).  One of them said and Yalamlam for the people of Yemen.  The other narrator said Alamlam.  These (places for Ihram) are appointed for these regions and for people of other regions who come to them intending to perform Hajj and `Umrah.  The place where those who live nearer to Makkah should put on Ihram from where they start and so on up to the inhabitants of Makkah itself who put on Ihram in it. This is the version of Ibn Tawus.",
      "chain": [
        "20193",
        "20022",
        "11081",
        "11053",
        "17",
        "11433",
        "11053"
      ]
    },
    {
      "hadith_no": "1763",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا سليمان بن حرب، ومسدد، قالا حدثنا حماد، ح حدثنا مسدد، حدثنا عبد الوارث، - وهذا حديث مسدد - عن أبي التياح، عن موسى بن سلمة، عن ابن عباس، قال بعث رسول الله صلى الله عليه وسلم فلانا الأسلمي وبعث معه بثمان عشرة بدنة فقال أرأيت إن أزحف على منها شىء قال ‏\"‏ تنحرها ثم تصبغ نعلها في دمها ثم اضربها على صفحتها ولا تأكل منها أنت ولا أحد من أصحابك ‏\"‏ ‏.‏ أو قال ‏\"‏ من أهل رفقتك ‏\"‏ ‏.‏ قال أبو داود الذي تفرد به من هذا الحديث قوله ‏\"‏ ولا تأكل منها أنت ولا أحد من أهل رفقتك ‏\"‏ ‏.‏ وقال في حديث عبد الوارث ‏\"‏ ثم اجعله على صفحتها ‏\"‏ ‏.‏ مكان ‏\"‏ اضربها ‏\"‏ ‏.‏ قال أبو داود سمعت أبا سلمة يقول إذا أقمت الإسناد والمعنى كفاك ‏.‏",
      "text_en": " Ibn Abbas said:                      The Messenger of Allah (SWAS) sent a man of al-Aslam tribe and sent with him eighteen sacrificial camels (as offering to Makkah).  What do you think if any one of them becomes fatigued.  He replied : You should sacrifice it then dye its shoe with its blood, then mark with it on its neck.  But you or any of your companions should not eat out of it.  Abu Dawud said: The following words of this tradition are not supported by any other tradition “You should not eat of it yourself nor any of your companions”.The version of `Abdal Warith has the words “then hang it in its neck” instead of the words “mark or strike with it”.  Abu Dawud said I heard Abu Salamah say if the chain of narrators and the meaning are correct, it is sufficient for you.",
      "chain": [
        "20193",
        "30175",
        "20022",
        "30175",
        "20258",
        "11317",
        "26042",
        "17"
      ]
    },
    {
      "hadith_no": "1778",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، ح وحدثنا موسى بن إسماعيل، حدثنا حماد يعني ابن سلمة، ح وحدثنا موسى، حدثنا وهيب، عن هشام بن عروة، عن أبيه، عن عائشة، أنها قالت خرجنا مع رسول الله صلى الله عليه وسلم موافين هلال ذي الحجة فلما كان بذي الحليفة قال ‏\"‏ من شاء أن يهل بحج فليهل ومن شاء أن يهل بعمرة فليهل بعمرة ‏\"‏ ‏.‏ قال موسى في حديث وهيب ‏\"‏ فإني لولا أني أهديت لأهللت بعمرة ‏\"‏ ‏.‏ وقال في حديث حماد بن سلمة ‏\"‏ وأما أنا فأهل بالحج فإن معي الهدى ‏\"‏ ‏.‏ ثم اتفقوا فكنت فيمن أهل بعمرة فلما كان في بعض الطريق حضت فدخل على رسول الله صلى الله عليه وسلم وأنا أبكي فقال ‏\"‏ ما يبكيك ‏\"‏ ‏.‏ قلت وددت أني لم أكن خرجت العام ‏.‏ قال ‏\"‏ ارفضي عمرتك وانقضي رأسك وامتشطي ‏\"‏ ‏.‏ قال موسى ‏\"‏ وأهلي بالحج ‏\"‏ ‏.‏ وقال سليمان ‏\"‏ واصنعي ما يصنع المسلمون في حجهم ‏\"‏ ‏.‏ فلما كان ليلة الصدر أمر - يعني رسول الله صلى الله عليه وسلم - عبد الرحمن فذهب بها إلى التنعيم ‏.‏ زاد موسى فأهلت بعمرة مكان عمرتها وطافت بالبيت فقضى الله عمرتها وحجها ‏.‏ قال هشام ولم يكن في شىء من ذلك هدى ‏.‏ قال أبو داود زاد موسى في حديث حماد بن سلمة فلما كانت ليلة البطحاء طهرت عائشة رضى الله عنها ‏.‏",
      "text_en": " Ai’shah said :                      We went out along with  The Messenger of Allah (SWAS) when the moon of the month of Dhu al-Hijja was going to appear shortly.  When he reached Dhu al-Hulaifah he said : Anyone who wants to perform Hajj should raise his voice in Talbiyah for Hajj (after wearing Ihram); and he who wants to perform `Umrah should raise his voice in talbiyah for an `Umrah.  The narrator Musa in the version of Wuhaib reported him (the Prophet) as saying if there were no sacrificial animals with me, I would raise my voice in talbiyah for an `Umrah.  But according to the version of Hammad bin Salamah, he said as for myself, I shall raise my voice in talbiyah for Hajj because I have sacrificial animal with me.  The agreed version goes I (Ai’shah) was one of those persons who wore Ihram for an ‘Umrah.  But on my way (to Makkah) I menstruated.  The Messenger of Allah (SWAS) entered upon me while I was weeping.  He asked why are you weeping?  I wished I would not come out (for Hajj) this year.  He said give up your `Umrah; untie your hair and comb.  The version of Musa said and raise your voice in talbiyah for Hajj (after wearing Ihram).  Sulaiman’s version goes and do as all the Muslims do during their Hajj.  When the night for performing the obligatory circumambulation (tawaf al-Ziyarah) came, the Messenger of Allah (SWAS) commanded `Abd al-Rahman.  He took her to al-Tan’im (instead of the words “her ‘Umrah”).  She went round the Ka’bah.  Allah thus completed both her ‘Umrah and Hajj.Hisham said : No sacrificial animal was offered during all this time.  In the version of Hammad bin Salamah, the narrator Musa added when the night of al-Batha came Ai’ shah was purified.",
      "chain": [
        "20193",
        "20022",
        "20040",
        "20021",
        "20040",
        "20299",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1829",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن عمرو بن دينار، عن جابر بن زيد، عن ابن عباس، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ السراويل لمن لا يجد الإزار والخف لمن لا يجد النعلين ‏\"‏ ‏.‏ قال أبو داود هذا حديث أهل مكة ومرجعه إلى البصرة إلى جابر بن زيد والذي تفرد به منه ذكر السراويل ولم يذكر القطع في الخف ‏.‏",
      "text_en": " Ibn ‘Abbas said I heard the Apostle of Allaah(ﷺ) say When one who is wearing ihram cannot get a lower garment(loin cloth) he may ear trousers and when he cannot get sandals he may wear shoes. Abu Dawud said This is the tradition narrated by the narrators of Makkah. Its narrator from Basrah is Jabir bin Zaid. He mentioned only trousers and omitted the mention of cutting of the shoes.",
      "chain": [
        "20193",
        "20022",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "2121",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا سليمان بن حرب، وأبو كامل قالا حدثنا حماد بن زيد، عن هشام بن عروة، عن أبيه، عن عائشة، قالت تزوجني رسول الله صلى الله عليه وسلم وأنا بنت سبع - قال سليمان أو ست - ودخل بي وأنا بنت تسع ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Messenger of Allah (ﷺ) married me when I was seven years old. The narrator Sulaiman said: or Six years. He had intercourse with me when I was nine years old.",
      "chain": [
        "20193",
        "30559",
        "20022",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2204",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا الحسن بن علي، حدثنا سليمان بن حرب، عن حماد بن زيد، قال قلت لأيوب هل تعلم أحدا قال بقول الحسن في أمرك بيدك ‏.‏ قال لا إلا شىء حدثناه قتادة عن كثير مولى ابن سمرة عن أبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم بنحوه قال أيوب فقدم علينا كثير فسألته فقال ما حدثت بهذا قط فذكرته لقتادة فقال بلى ولكنه نسي ‏.‏",
      "text_en": " Hammad ibn Zayd said:                      I asked Ayyub: Do you know anyone who narrates the tradition narrated by Al-Hasan about uttering the words (addressing wife). \"Your matter is in your hand\"? He replied: No, except something similar transmitted by Qatadah from Kathir, the client of Samurah, from AbuSalamah on the authority of AbuHurayrah from the Prophet (ﷺ). Ayyub said: Kathir then came to us; so I asked him (about this matter). He replied: I never narrated it. I mentioned it to Qatadah who said: Yes (he narrated it) but he forgot.",
      "chain": [
        "30115",
        "20193",
        "20022",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2226",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن أيوب، عن أبي قلابة، عن أبي أسماء، عن ثوبان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما امرأة سألت زوجها طلاقا في غير ما بأس فحرام عليها رائحة الجنة ‏\"‏ ‏.‏",
      "text_en": " Narrated Thawban:                     The Prophet (ﷺ) said: If any woman asks her husband for divorce without some strong reason, the odour of Paradise will be forbidden to her.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "130"
      ]
    },
    {
      "hadith_no": "2319",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن الأسود بن قيس، عن سعيد بن عمرو، - يعني ابن سعيد بن العاص - عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنا أمة أمية لا نكتب ولا نحسب الشهر هكذا و هكذا وهكذا ‏\"‏ ‏.‏ وخنس سليمان أصبعه في الثالثة يعني تسعا وعشرين وثلاثين ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ) said: The month consists of twenty-nine days, but do not fast till you sight it (the moon) and do not break your fast till you sight it. If the weather is cloudy, calculate it thirty days. When the twenty-ninth of Sha'ban came, Ibn Umar would send someone (who tried) to sight the moon for him. If it was sighted, then well and good; in case it was not sighted, and there was no cloud and dust before him (on the horizon), he would not keep fast the next day. If there appeared (on the horizon) before him cloud or dust, he would fast the following day. Ibn Umar would end his fasting alone with the people, and did not follow this calculation.",
      "chain": [
        "20193",
        "20020",
        "11323",
        "11509",
        "18"
      ]
    },
    {
      "hadith_no": "2396",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا شعبة، ح وحدثنا محمد بن كثير، قال أخبرنا شعبة، عن حبيب بن أبي ثابت، عن عمارة بن عمير، عن ابن مطوس، عن أبيه، - قال ابن كثير عن أبي المطوس، عن أبيه، - عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أفطر يوما من رمضان من غير رخصة رخصها الله له لم يقض عنه صيام الدهر ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: If anyone breaks his fast one day in Ramadan without a concession granted to him by Allah, a perpetual fast will not atone for it.",
      "chain": [
        "20193",
        "20020",
        "28531",
        "20020",
        "11331",
        "11378",
        "30169",
        "19956",
        "13"
      ]
    },
    {
      "hadith_no": "2402",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا سليمان بن حرب، ومسدد، قالا حدثنا حماد، عن هشام بن عروة، عن أبيه، عن عائشة، أن حمزة الأسلمي، سأل النبي صلى الله عليه وسلم فقال يا رسول الله إني رجل أسرد الصوم أفأصوم في السفر قال ‏\"‏ صم إن شئت وأفطر إن شئت ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Aishah:                     Hamzat al-Aslami asked the Prophet (ﷺ): Messenger of Allah, I am a man who keeps perpetual fast, may I fast while on a journey? He replied: Fast if you like, or break your fast if you like.",
      "chain": [
        "20193",
        "30175",
        "20022",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2425",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا سليمان بن حرب، ومسدد، قالا حدثنا حماد بن زيد، عن غيلان بن جرير، عن عبد الله بن معبد الزماني، عن أبي قتادة، أن رجلا، أتى النبي صلى الله عليه وسلم فقال يا رسول الله كيف تصوم فغضب رسول الله صلى الله عليه وسلم من قوله فلما رأى ذلك عمر قال رضينا بالله ربا وبالإسلام دينا وبمحمد نبيا نعوذ بالله من غضب الله ومن غضب رسوله ‏.‏ فلم يزل عمر يرددها حتى سكن غضب رسول الله صلى الله عليه وسلم ‏.‏ فقال يا رسول الله كيف بمن يصوم الدهر كله قال ‏\"‏ لا صام ولا أفطر ‏\"‏ ‏.‏ قال مسدد ‏\"‏ لم يصم ولم يفطر أو ما صام ولا أفطر ‏\"‏ ‏.‏ شك غيلان ‏.‏ قال يا رسول الله كيف بمن يصوم يومين ويفطر يوما قال ‏\"‏ أويطيق ذلك أحد ‏\"‏ ‏.‏ قال يا رسول الله فكيف بمن يصوم يوما ويفطر يوما قال ‏\"‏ ذلك صوم داود ‏\"‏ ‏.‏ قال يا رسول الله فكيف بمن يصوم يوما ويفطر يومين قال ‏\"‏ وددت أني طوقت ذلك ‏\"‏ ‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاث من كل شهر ورمضان إلى رمضان فهذا صيام الدهر كله وصيام عرفة إني أحتسب على الله أن يكفر السنة التي قبله والسنة التي بعده وصوم يوم عاشوراء إني أحتسب على الله أن يكفر السنة التي قبله ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuQatadah:                     A man came to the Prophet (ﷺ) and said: How do you fast, Messenger of Allah? The Messenger of Allah (ﷺ) became angry at what he said.  When Umar observed this (his anger), he said: We are satisfied with Allah as Lord, with Islam as religion, and with Muhammad as Prophet. We seek refuge in Allah from the anger of Allah, and from the anger of His Apostle. Umar continued to repeat these words till his anger cooled down. He then asked: Messenger of Allah, what is the position of one who observes a perpetual fast?  He replied: May he not fast or break his fast.  Musaddad said in his version: He has neither fasted nor broken his fast. The narrator, Ghaylan, doubted the actual wordings.  He asked: What is the position of one who fasts two days and does not fast one day?  He said: Is anyone able to do that?  He asked: What is the position of one who fasts every second day (i.e. fasts one day and does not fasts the next day)?  He (the Prophet) said: This is the fast that David observed.  He asked: Messenger of Allah, what is the position of one who fasts one day and breaks it for two days?  He replied: I wish I were given the power to observe that. Then the Messenger of Allah (ﷺ) said: The observance of three days' fast every month and of one Ramadan to the other (i.e. the fast of Ramadan every year) is (equivalent to) a perpetual fast. I seek from Allah that fasting on the day of Arafah may atone for the sins of the preceding and the coming year, and I seek from Allah that fasting on the day of Ashura' may atone for the sins of the preceding year.",
      "chain": [
        "20193",
        "30175",
        "20022",
        "11300",
        "10697",
        "391"
      ]
    },
    {
      "hadith_no": "2440",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حوشب بن عقيل، عن مهدي الهجري، حدثنا عكرمة، قال كنا عند أبي هريرة في بيته فحدثنا أن رسول الله صلى الله عليه وسلم نهى عن صوم يوم عرفة بعرفة ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     Ikrimah said: We were with AbuHurayrah in his house when he narrated to us: The Messenger of Allah (ﷺ) prohibited fasting on the day of Arafah at Arafah.",
      "chain": [
        "20193",
        "24105",
        "11023"
      ]
    },
    {
      "hadith_no": "2469",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا سليمان بن حرب، ومسدد، قالا حدثنا حماد بن زيد، عن هشام بن عروة، عن أبيه، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يكون معتكفا في المسجد فيناولني رأسه من خلل الحجرة فأغسل رأسه ‏.‏ وقال مسدد فأرجله وأنا حائض ‏.‏",
      "text_en": " 'Aishah said:                      The Messenger of Allah (ﷺ) used to observe I'tikaf in the mosque and put his head near me through the opening of the apartment, and I would wash his head. Musaddad said: \"And I would comb it while I was menstruating.\"",
      "chain": [
        "20193",
        "30175",
        "20022",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2561",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن أيوب، عن أبي قلابة، عن أبي المهلب، عن عمران بن حصين، أن النبي صلى الله عليه وسلم كان في سفر فسمع لعنة فقال ‏\"‏ ما هذه ‏\"‏ ‏.‏ قالوا هذه فلانة لعنت راحلتها ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ضعوا عنها فإنها ملعونة ‏\"‏ ‏.‏ فوضعوا عنها ‏.‏ قال عمران فكأني أنظر إليها ناقة ورقاء ‏.‏",
      "text_en": " ‘Imran bin Hussain said “The Prophet (ﷺ) was on a journey. He heard a curse. He asked “What is this? They (the people) said “This is so and so (a woman) who cursed her riding beast. The Prophet (ﷺ) said “Remove the saddle from it, for it is accursed. So, they removed (the saddle) from it. ‘Imran said “As if I am looking at it a grey she Camel.”",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "123"
      ]
    },
    {
      "hadith_no": "2703",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا جرير، - يعني ابن حازم - عن يعلى بن حكيم، عن أبي لبيد، قال كنا مع عبد الرحمن بن سمرة بكابل فأصاب الناس غنيمة فانتهبوها فقام خطيبا فقال سمعت رسول الله صلى الله عليه وسلم ينهى عن النهبى ‏.‏ فردوا ما أخذوا فقسمه بينهم ‏.‏",
      "text_en": " Narrated AbdurRahman ibn Samurah ibn Kabul:                     AbuLabid said: We were with AbdurRahman ibn Samurah ibn Kabul. The people got booty and plundered it. He stood and addressed (the people): I heard the Messenger of Allah (ﷺ) prohibiting getting property from the booty before its distribution. Therefore, they returned what they had taken, He then distributed it among them.",
      "chain": [
        "20193",
        "11272",
        "11567"
      ]
    },
    {
      "hadith_no": "2900",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا سليمان بن حرب، - في آخرين - قالوا حدثنا حماد، عن بديل، - يعني ابن ميسرة - عن علي بن أبي طلحة، عن راشد بن سعد، عن أبي عامر الهوزني، عن المقدام الكندي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنا أولى بكل مؤمن من نفسه فمن ترك دينا أو ضيعة فإلى ومن ترك مالا فلورثته وأنا مولى من لا مولى له أرث ماله وأفك عانه والخال مولى من لا مولى له يرث ماله ويفك عانه ‏\"‏ ‏.‏ قال أبو داود رواه الزبيدي عن راشد بن سعد عن ابن عائذ عن المقدام ورواه معاوية بن صالح عن راشد قال سمعت المقدام ‏.‏ قال أبو داود يقول الضيعة معناه عيال ‏.‏",
      "text_en": " Narrated Al-Miqdam al-Kindi:                     The Prophet (ﷺ) said: I am nearer to every believer than himself, so if anyone leaves a debt or a helpless family, I shall be responsible, but if anyone leaves property, it goes to his heirs. I am patron of him who has none, inheriting his property and freeing him from his liabilities. A maternal uncle is patron of him who has none, inheriting his property and freeing him from his liabilities.Abu Dawud said: da'iah means dependants or helpless family.Abu Dawud said: This tradition has been transmitted by al-Zubaidi from Rashid b. Sa'd from Ibn 'A'idh on the authority of al-Miqdam. It has also been transmitted by Mu'awiyah b. Salih from Rashid who said: I heard al-Miqdam (say).",
      "chain": [
        "20193",
        "20022",
        "10672",
        "10948",
        "19909"
      ]
    },
    {
      "hadith_no": "3095",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، - يعني ابن زيد - عن ثابت، عن أنس، أن غلاما، من اليهود كان مرض فأتاه النبي صلى الله عليه وسلم يعوده فقعد عند رأسه فقال له ‏\"‏ أسلم ‏\"‏ ‏.‏ فنظر إلى أبيه وهو عند رأسه فقال له أبوه أطع أبا القاسم ‏.‏ فأسلم فقام النبي صلى الله عليه وسلم وهو يقول ‏\"‏ الحمد لله الذي أنقذه بي من النار ‏\"‏ ‏.‏",
      "text_en": " Narrated Anas :                     A young Jew became ill. The Prophet (ﷺ) went to visit him. He sat down by his head and said to him: Accept Islam. He looked at his father who was beside him near his head, and he said: Obey Abu al-Qasim. So he accepted Islam, and the Prophet (ﷺ) stood up saying: Praise be to Allah Who has saved him through me from Hell.",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3167",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن أيوب، عن حفصة، عن أم عطية، قالت نهينا أن نتبع، الجنائز ولم يعزم علينا ‏.‏",
      "text_en": " Narrated Umm 'Atiyyah :                     We were forbidden accompany the biers, but it was not stressed upon us.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "3203",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا سليمان بن حرب، ومسدد، قالا حدثنا حماد، عن ثابت، عن أبي رافع، عن أبي هريرة، أن امرأة، سوداء أو رجلا كان يقم المسجد ففقده النبي صلى الله عليه وسلم فسأل عنه فقيل مات ‏.‏ فقال ‏\"‏ ألا آذنتموني به ‏\"‏ ‏.‏ قال ‏\"‏ دلوني على قبره ‏\"‏ ‏.‏ فدلوه فصلى عليه ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     A negress (or a youth) used to sweep the mosque. The Prophet (ﷺ) missed him, and when he asked about him the people told him that he had died. He said: Why have you not informed me ? He said: Lead me to his grave. So they led him and he prayed over him.",
      "chain": [
        "20193",
        "30175",
        "20022",
        "11269",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "3232",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن سعيد بن يزيد أبي مسلمة، عن أبي نضرة، عن جابر، قال دفن مع أبي رجل فكان في نفسي من ذلك حاجة فأخرجته بعد ستة أشهر فما أنكرت منه شيئا إلا شعيرات كن في لحيته مما يلي الأرض ‏.‏",
      "text_en": " Narrated Jabir:                     A man was buried with my father. I had a desire at heart for that (place for my burial). So I took him out after six months. I did not find any change (in his body) except a few hair that touched the earth.",
      "chain": [
        "20193",
        "20022",
        "10721",
        "34"
      ]
    },
    {
      "hadith_no": "3239",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا سليمان بن حرب، ومحمد بن عبيد، - المعنى - قالا حدثنا حماد، عن عمرو، وأيوب، عن سعيد بن جبير، عن ابن عباس، نحوه قال ‏\"‏ وكفنوه في ثوبين ‏\"‏ ‏.‏ قال أبو داود قال سليمان قال أيوب ‏\"‏ ثوبيه ‏\"‏ ‏.‏ وقال عمرو ‏\"‏ ثوبين ‏\"‏ ‏.‏ وقال ابن عبيد قال أيوب ‏\"‏ في ثوبين ‏\"‏ ‏.‏ وقال عمرو ‏\"‏ في ثوبيه ‏\"‏ ‏.‏ زاد سليمان وحده ‏\"‏ ولا تحنطوه ‏\"‏ ‏.‏",
      "text_en": " A similar tradition has also been narrated by Ibn 'Abbas through a different chain of narrators. This version has:                      \"Shroud him in two garments.\"Abu Dawud said: The narrator Sulaiman said the Ayyub said: \"his two garments,\" 'Amr said: \"tow garments,\" Ibn 'Ubaid said that Ayyub said: \"in two garments\" and Amr said: \"in his two garments.\" Sulaiman alone added: \"do not put any perfume on him.\"",
      "chain": [
        "20193",
        "30213",
        "20022",
        "11081",
        "11015",
        "11050",
        "17",
        "30002",
        "11060"
      ]
    },
    {
      "hadith_no": "3276",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، حدثنا غيلان بن جرير، عن أبي بردة، عن أبيه، أن النبي صلى الله عليه وسلم قال ‏:‏ ‏\"‏ إني والله إن شاء الله لا أحلف على يمين فأرى غيرها خيرا منها إلا كفرت عن يميني، وأتيت الذي هو خير ‏\"‏ ‏.‏ أو قال ‏:‏ ‏\"‏ إلا أتيت الذي هو خير وكفرت يميني ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Burdah:                     On the authority of his father that the Prophet (ﷺ) said: I swear by Allah that if Allah wills I shall swear on an oath and then consider something else to be better than it without making atonement for my oath and doing the thing that is better. Or he said (according to another version): But doing the thing that is better and making atonement for my oath.",
      "chain": [
        "20193",
        "20022",
        "11300",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "3316",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا سليمان بن حرب، ومحمد بن عيسى، قالا حدثنا حماد، عن أيوب، عن أبي قلابة، عن أبي المهلب، عن عمران بن حصين، ‏:‏ قال كانت العضباء لرجل من بني عقيل وكانت من سوابق الحاج قال ‏:‏ فأسر فأتى النبي صلى الله عليه وسلم وهو في وثاق والنبي صلى الله عليه وسلم على حمار عليه قطيفة فقال ‏:‏ يا محمد علام تأخذني وتأخذ سابقة الحاج قال ‏:‏ ‏\"‏ نأخذك بجريرة حلفائك ثقيف ‏\"‏ ‏.‏ قال ‏:‏ وكان ثقيف قد أسروا رجلين من أصحاب النبي صلى الله عليه وسلم قال ‏:‏ وقد قال فيما قال ‏:‏ وأنا مسلم أو قال ‏:‏ وقد أسلمت ‏.‏ فلما مضى النبي صلى الله عليه وسلم - قال أبو داود ‏:‏ فهمت هذا من محمد بن عيسى - ناداه يا محمد يا محمد ‏.‏ قال ‏:‏ وكان النبي صلى الله عليه وسلم رحيما رفيقا فرجع إليه قال ‏:‏ ‏\"‏ ما شأنك ‏\"‏ ‏.‏ قال ‏:‏ إني مسلم ‏.‏ قال ‏:‏ ‏\"‏ لو قلتها وأنت تملك أمرك أفلحت كل الفلاح ‏\"‏ ‏.‏ قال أبو داود ‏:‏ ثم رجعت إلى حديث سليمان قال ‏:‏ يا محمد إني جائع فأطعمني إني ظمآن فاسقني ‏.‏ قال فقال النبي صلى الله عليه وسلم ‏:‏ ‏\"‏ هذه حاجتك ‏\"‏ ‏.‏ أو قال ‏:‏ ‏\"‏ هذه حاجته ‏\"‏ ‏.‏ قال ‏:‏ ففودي الرجل بعد بالرجلين ‏.‏ قال ‏:‏ وحبس رسول الله صلى الله عليه وسلم العضباء لرحله - قال - فأغار المشركون على سرح المدينة فذهبوا بالعضباء - قال - فلما ذهبوا بها وأسروا امرأة من المسلمين - قال - فكانوا إذا كان الليل يريحون إبلهم في أفنيتهم - قال - فنوموا ليلة وقامت المرأة فجعلت لا تضع يدها على بعير إلا رغا حتى أتت على العضباء - قال - فأتت على ناقة ذلول مجرسة - قال - فركبتها ثم جعلت لله عليها إن نجاها الله لتنحرنها - قال - فلما قدمت المدينة عرفت الناقة ناقة النبي صلى الله عليه وسلم فأخبر النبي صلى الله عليه وسلم بذلك فأرسل إليها، فجيء بها وأخبر بنذرها فقال ‏:‏ ‏\"‏ بئسما جزيتيها ‏\"‏ ‏.‏ أو ‏:‏ ‏\"‏ جزتها ‏\"‏ ‏.‏ ‏:‏ ‏\"‏ إن الله أنجاها عليها لتنحرنها، لا وفاء لنذر في معصية الله ولا فيما لا يملك ابن آدم ‏\"‏ ‏.‏ قال أبو داود ‏:‏ والمرأة هذه امرأة أبي ذر ‏.‏",
      "text_en": " 'Imran b. Husain said:                      'Adba belonged to a man of Banu 'Aqil. It used to go ahead of pligrims. The man was then captivated. He was brought in chains to the Prophet (ﷺ). The Prophet (ﷺ) was riding on a donkey with a blanket on him. He said: Muhammad, why do you arrest me and capture the one (i.e. the she-camel) which goes ahead of the pilgrims. He replied: We are arresting you on account of the crime committed by your allies Thaqid. Thaqif captivated two persons from among the Companions of the Prophet (ﷺ). He said (whatever he said) I am a Muslim, or he said: I have embraced Islam. When the Prophet (ﷺ) went ahead, he called him: O Muhammed, O Muhammed. Abu Dawud said: I learnt it from the version of the narrator Muhammad b. 'Isa. The Prophet (ﷺ) was compassionate and kind hearted. So he returned to him, and asked: What is the matter with you ? He replied: I am a Muslim. He said: Had you said it when the matter was in your hand, you would have succeeded completely. Abu Dawud said: I then returned to the version of the narrator Sulaiman (b. Harb). He said: Muhammad, I am hungry, so feed me. I am thirsty, so give me water. The Prophet (ﷺ) said: This is your need, or he said: This is his need (the narrator is doubtful). Later on the man was taken back (by Thaqif) as a ransom for the two men (of the Companions of the Prophet). The Prophet (ﷺ) retained 'Adba for his journey. The narrator said: The polytheists raided the pasturing animals of Medina and they took away 'Adba. When they took away 'Adba, they also captivated a Muslim woman. They used to leave their camels in the fields for rest at night. One night they slept and the (Muslim) woman stood up. Any camel on which she put her hand brayed until she came to 'Adba. She came to a she-camel which was docile and experienced. She then rode on her and vowed to Allah that if He saved her, she would sacrifice it. When she came to Medina, the people recognized the she-camel of the Prophet (ﷺ). The Prophet (ﷺ) was then informed about it and he sent for her. She was brought to him and she informed him about her vow. He said: It is a bad return that you have given it. Allah has not saved you, on its (back) that you now sacrifice it. A vow to do an act of disobedience must not be fulfilled, or to do something over which one has no control.Abu Dawud said: This woman was the wife of Abu Dharr.",
      "chain": [
        "20193",
        "31167",
        "20022",
        "11015",
        "11047",
        "123"
      ]
    },
    {
      "hadith_no": "3497",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا مسدد، وسليمان بن حرب، قالا حدثنا حماد، ح وحدثنا مسدد، حدثنا أبو عوانة، - وهذا لفظ مسدد - عن عمرو بن دينار، عن طاوس، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا اشترى أحدكم طعاما فلا يبعه حتى يقبضه ‏\"‏ ‏.‏ قال سليمان بن حرب ‏\"‏ حتى يستوفيه ‏\"‏ ‏.‏ زاد مسدد قال وقال ابن عباس وأحسب أن كل شىء مثل الطعام ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     The Messenger of Allah (ﷺ) as saying: If anyone buys a grain, he should not sell it until he takes possession of it. Sulaiman b. Harb said: Until he receives it in full. Musaddad added: Ibn 'Abbas said: And I think that everything is like grain.",
      "chain": [
        "30175",
        "20193",
        "20022",
        "30175",
        "20469",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "3544",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن حاجب بن المفضل بن المهلب، عن أبيه، قال سمعت النعمان بن بشير، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ اعدلوا بين أولادكم اعدلوا بين أبنائكم ‏\"‏ ‏.‏",
      "text_en": " Narrated An-Nu'man ibn Bashir:                     The Prophet (ﷺ) said: Act equally between your children; Act equally between your sons.",
      "chain": [
        "20193",
        "20022",
        "274"
      ]
    },
    {
      "hadith_no": "3603",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أيوب، عن ابن أبي مليكة، حدثني عقبة بن الحارث، وحدثنيه صاحب، لي عنه - وأنا لحديث، صاحبي أحفظ - قال تزوجت أم يحيى بنت أبي إهاب فدخلت علينا امرأة سوداء فزعمت أنها أرضعتنا جميعا فأتيت النبي صلى الله عليه وسلم فذكرت ذلك له فأعرض عني فقلت يا رسول الله إنها لكاذبة ‏.‏ قال ‏\"‏ وما يدريك وقد قالت ما قالت دعها عنك ‏\"‏ ‏.‏",
      "text_en": " 'Uqbah bin al-Harith said:                      \"I married Umm Yahya daughter of Abu Ihab. A black woman entered upon us. She said that she had suckled both of us. So I came to the Prophet (ﷺ), and amentioned it to him. He turned away from me. I said (to him): Messenger of Allah! she is a liar. He said: What do you know? She has said what she has said. Separate yourself from her (wife).",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11090",
        "872"
      ]
    },
    {
      "hadith_no": "3673",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن ثابت، عن أنس، قال كنت ساقي القوم حيث حرمت الخمر في منزل أبي طلحة وما شرابنا يومئذ إلا الفضيخ فدخل علينا رجل فقال إن الخمر قد حرمت ونادى منادي رسول الله صلى الله عليه وسلم فقلنا هذا منادي رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     I was serving wine to the people in the house of AbuTalhah when it was prohibited and that day our wine was made from unripe dates. A man entered upon us and said: The wine has been prohibited, and the herald of the Messenger of Allah (ﷺ) made an announcement. We then said: This is the herald of the Messenger of Allah (ﷺ)",
      "chain": [
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3692",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا سليمان بن حرب، ومحمد بن عبيد، قالا حدثنا حماد، ح وحدثنا مسدد، حدثنا عباد بن عباد، عن أبي جمرة، قال سمعت ابن عباس، يقول - وقال مسدد عن ابن عباس، وهذا، حديث سليمان قال - قدم وفد عبد القيس على رسول الله صلى الله عليه وسلم فقالوا يا رسول الله إنا هذا الحى من ربيعة قد حال بيننا وبينك كفار مضر ولسنا نخلص إليك إلا في شهر حرام فمرنا بشىء نأخذ به وندعو إليه من وراءنا ‏.‏ قال ‏\"‏ آمركم بأربع وأنهاكم عن أربع الإيمان بالله وشهادة أن لا إله إلا الله ‏\"‏ ‏.‏ وعقد بيده واحدة ‏.‏ وقال مسدد الإيمان بالله ثم فسرها لهم شهادة أن لا إله إلا الله ‏\"‏ وأن محمدا رسول الله وإقام الصلاة وإيتاء الزكاة وأن تؤدوا الخمس مما غنمتم وأنهاكم عن الدباء والحنتم والمزفت والمقير ‏\"‏ ‏.‏ وقال ابن عبيد النقير مكان المقير ‏.‏ وقال مسدد والنقير والمقير ولم يذكر المزفت ‏.‏ قال أبو داود أبو جمرة نصر بن عمران الضبعي ‏.‏",
      "text_en": " Ibn 'Abbas said:                      The deputation of 'Abd al-Qais came to Messenger of Allah (ﷺ) and said: This is the tribe of Rabi'ah, and the infidels of Mudar are between us and you. We are able to come to you only in the sacred month. So give a decisive command which we may follow ourselves and to which we call those at home behind us. He (the Prophet) said: I command you to observe four things, and forbade you four things: Belief in Allah. the testimony that there is no god but Allah, and he expresses one by folding his hand. Musadad's version has: Faith in Allah, and he explained to them: The testimony that there is no god but Allah and that Muhammad is the Messenger of Allah, observance of prayer, payment of zakat, and your giving the filth of the booty. I forbid you the use of pumpkins, green jarrs, vessels smeared with pitch, and hollow stumps of palm-trees. Ibn 'Ubaid's version has word muqayyar (vessels smeared with pitch) instead of naqir (hollow stumps). Musaddad's version has naqir and muqayyar (pitch); he did not mention muzaffat (vessels smeared with pitch).Abu Dawud said: The name of Abu Jamrah is Nasr bin 'Imran al-Duba'i.",
      "chain": [
        "20193",
        "30213",
        "20022",
        "30175",
        "20243",
        "11309",
        "17",
        "30175",
        "17"
      ]
    },
    {
      "hadith_no": "3705",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا سليمان بن حرب، وحفص بن عمر النمري، قالا حدثنا شعبة، عن الحكم، عن ابن أبي ليلى، - عن رجل، - قال حفص من أصحاب النبي صلى الله عليه وسلم عن النبي صلى الله عليه وسلم قال نهى عن البلح والتمر والزبيب والتمر ‏.‏",
      "text_en": " Narrated A man:                     A man from among the Companions of the Prophet (ﷺ) said: The Prophet (ﷺ) forbade (mixing) unripe dates and dried dates, and (mixing) raisins and dried dates.",
      "chain": [
        "20193",
        "30329",
        "20020",
        "11069",
        "11196"
      ]
    },
    {
      "hadith_no": "3788",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن عمرو بن دينار، عن محمد بن علي، عن جابر بن عبد الله، قال نهانا رسول الله صلى الله عليه وسلم يوم خيبر عن لحوم الحمر وأذن لنا في لحوم الخيل ‏.‏",
      "text_en": " Jabir  b. ‘Abd Allah said:                      The Messenger of Allah(ﷺ) forbade the flesh of domestic asses on the day of Khaibar, but permitted horse flesh.",
      "chain": [
        "20193",
        "20022",
        "11081",
        "11442",
        "34"
      ]
    },
    {
      "hadith_no": "3958",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن أبي المهلب، عن عمران بن حصين، أن رجلا، أعتق ستة أعبد عند موته ولم يكن له مال غيرهم فبلغ ذلك النبي صلى الله عليه وسلم فقال له قولا شديدا ثم دعاهم فجزأهم ثلاثة أجزاء فأقرع بينهم فأعتق اثنين وأرق أربعة ‏.‏",
      "text_en": " 'Imran b. Hussain said:                      A man who had no other property emancipated six slaves of his at the time of the death. When the Prophet (ﷺ) was informed about it, he spoke severely of him. He then called them, divided them into three sections, cast lots among them, and emancipated two and kept four in slavery.",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "123"
      ]
    },
    {
      "hadith_no": "4043",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن أبي عون، قال سمعت أبا صالح، يحدث عن علي، رضى الله عنه قال أهديت إلى رسول الله صلى الله عليه وسلم حلة سيراء فأرسل بها إلى فلبستها فأتيته فرأيت الغضب في وجهه وقال ‏\"‏ إني لم أرسل بها إليك لتلبسها ‏\"‏ ‏.‏ وأمرني فأطرتها بين نسائي ‏.‏",
      "text_en": " Ali said:                      A robe containing silk was presented to the Messenger of Allah (ﷺ). He then sent it to me. I wore it and came to him. I saw him looking angry in his face. He then said: I did not send it to you to wear. He ordered me and I divided it among my women.",
      "chain": [
        "20193",
        "20020",
        "11649",
        "19291",
        "5"
      ]
    },
    {
      "hadith_no": "4252",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا سليمان بن حرب، ومحمد بن عيسى، قالا حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن أبي أسماء، عن ثوبان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله زوى لي الأرض ‏\"‏ ‏.‏ أو قال ‏\"‏ إن ربي زوى لي الأرض فرأيت مشارقها ومغاربها وإن ملك أمتي سيبلغ ما زوي لي منها وأعطيت الكنزين الأحمر والأبيض وإني سألت ربي لأمتي أن لا يهلكها بسنة بعامة ولا يسلط عليهم عدوا من سوى أنفسهم فيستبيح بيضتهم وإن ربي قال لي يا محمد إني إذا قضيت قضاء فإنه لا يرد ولا أهلكهم بسنة بعامة ولا أسلط عليهم عدوا من سوى أنفسهم فيستبيح بيضتهم ولو اجتمع عليهم من بين أقطارها أو قال بأقطارها حتى يكون بعضهم يهلك بعضا وحتى يكون بعضهم يسبي بعضا وإنما أخاف على أمتي الأئمة المضلين وإذا وضع السيف في أمتي لم يرفع عنها إلى يوم القيامة ولا تقوم الساعة حتى تلحق قبائل من أمتي بالمشركين وحتى تعبد قبائل من أمتي الأوثان وإنه سيكون في أمتي كذابون ثلاثون كلهم يزعم أنه نبي وأنا خاتم النبيين لا نبي بعدي ولا تزال طائفة من أمتي على الحق ‏\"‏ ‏.‏ قال ابن عيسى ‏\"‏ ظاهرين ‏\"‏ ‏.‏ ثم اتفقا ‏\"‏ لا يضرهم من خالفهم حتى يأتي أمر الله ‏\"‏ ‏.‏",
      "text_en": " Narrated Thawban:                     The Messenger of Allah (ﷺ) as saying: Allah, the Exalted, folded for me the earth, or he said (the narrator is doubtful): My Lord folded for me the earth, so much so that I saw its easts and wests (i.e. the extremities). The kingdom of my community will reach as far as the earth was floded for me. The two treasures, the red and the white, were bestowed on me. I prayed to my Lord that He may not destroy my community by prevailing famine, and not give their control to an enemy who annihilates then en masse except from among themselves. My Lord said to me: Muhammad, If I make a decision, it is not withdrawn ; and I shall not destroy them by prevailing famine, and I shall not give their control to an enemy, except from among themselves, who exterminates them en masse, even if they are stormed from all sides of the earth ; only a section of them will destroy another section, and a section will captive another section. I am afraid about my community of those leaders who will lead astray. When the sword is used among my people, it will not be withdrawn from them till the Day of Resurrection, and the Last Hour will not come before the tribes of my people attach themselves to the polytheists and tribes of my people worship idols. There will be among my people thirty great liars each of them asserting that he is (Allah's) prophet, where as I am the seal of the Prophet  s after whom (me) there will be no prophet ; and a section of my people will continue to hold to the truth - (according to the Ibn Isa's version: (will continue to dominate) - the agreed version goes: \"and will not be injured by those who oppose them, till Allah's command comes.\"",
      "chain": [
        "20193",
        "31167",
        "20022",
        "11015",
        "11047",
        "130"
      ]
    },
    {
      "hadith_no": "4347",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا سليمان بن حرب، وحفص بن عمر، قالا حدثنا شعبة، - وهذا لفظه - عن عمرو بن مرة، عن أبي البختري، قال أخبرني من، سمع النبي صلى الله عليه وسلم يقول وقال سليمان حدثني رجل من أصحاب النبي صلى الله عليه وسلم أن النبي صلى الله عليه وسلم قال ‏\"‏ لن يهلك الناس حتى يعذروا أو يعذروا من أنفسهم ‏\"‏ ‏.‏",
      "text_en": " A man from among the companions of the prophet (ﷺ) reported him as saying:                      The people will not perish until their sins and faults become abundant, and there remains no excuse for them.",
      "chain": [
        "20193",
        "30329",
        "20020",
        "11381",
        "11347"
      ]
    },
    {
      "hadith_no": "4364",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن أيوب، عن أبي قلابة، عن أنس بن مالك، أن قوما، من عكل - أو قال من عرينة - قدموا على رسول الله صلى الله عليه وسلم فاجتووا المدينة فأمر لهم رسول الله صلى الله عليه وسلم بلقاح وأمرهم أن يشربوا من أبوالها وألبانها فانطلقوا فلما صحوا قتلوا راعي رسول الله صلى الله عليه وسلم واستاقوا النعم فبلغ النبي صلى الله عليه وسلم خبرهم من أول النهار فأرسل النبي صلى الله عليه وسلم في آثارهم فما ارتفع النهار حتى جيء بهم فأمر بهم فقطعت أيديهم وأرجلهم وسمر أعينهم وألقوا في الحرة يستسقون فلا يسقون ‏.‏ قال أبو قلابة فهؤلاء قوم سرقوا وقتلوا وكفروا بعد إيمانهم وحاربوا الله ورسوله ‏.‏",
      "text_en": " Anas b. Malik said:                      Some people of ‘Ukl or ‘Urainah’ came to the Messenger of Allah (ﷺ) and found Madinah unhealthy. So the Messenger of Allah (ﷺ) ordered them to go to the camels (of the sadaqah) and ordered them to drink some of their urine and milk. They went there when they became well, they killed the herdsman of the Messenger of Allah (ﷺ) and drove off the camels. The news about them reached the prophet (ﷺ) early in the morning. So he sent people in pursuit of them, and they were brought when they day had risen high. He ordered and their hands and feet were cut off and nails were drawn into their eyes, and they were thrown out of Harrah. They begged for water but were not supplied water. Abu Qilabah said: They were people who had stolen, killed, apostatized after their faith and fought against Allah and his Apostle (ﷺ).",
      "chain": [
        "20193",
        "20022",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "4502",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن يحيى بن سعيد، عن أبي أمامة بن سهل، قال كنا مع عثمان وهو محصور في الدار وكان في الدار مدخل من دخله سمع كلام من على البلاط فدخله عثمان فخرج إلينا وهو متغير لونه فقال إنهم ليتواعدونني بالقتل آنفا ‏.‏ قلنا يكفيكهم الله يا أمير المؤمنين ‏.‏ قال ولم يقتلونني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل دم امرئ مسلم إلا بإحدى ثلاث كفر بعد إسلام أو زنا بعد إحصان أو قتل نفس بغير نفس ‏\"‏ ‏.‏ فوالله ما زنيت في جاهلية ولا إسلام قط ولا أحببت أن لي بديني بدلا منذ هداني الله ولا قتلت نفسا فبم يقتلونني قال أبو داود عثمان وأبو بكر رضى الله عنهما تركا الخمر في الجاهلية ‏.‏",
      "text_en": " Narrated AbuUmamah ibn Sahl:                     We were with Uthman when he was besieged in the house. There was an entrance to the house. He who entered it heard the speech of those who were in the Bilat. Uthman then entered it. He came out to us, looking pale.  He said: They are threatening to kill me now.  We said: Allah will be sufficient for you against them, Commander of the Faithful!  He asked: Why kill me? I heard the Messenger of Allah (ﷺ) say: It is not lawful to kill a man who is a Muslim except for one of the three reasons: Kufr (disbelief) after accepting Islam, fornication after marriage, or wrongfully killing someone, for which he may be killed. I swear by Allah, I have not committed fornication before or after the coming of Islam, nor did I ever want another religion for me instead of my religion since Allah gave guidance to me, nor have I killed anyone. So for what reason do you want to kill me?Abu Dawud said: 'Uthman and Abu Bakr (Allah be pleased with them) abandoned drinking wine in pre-Islamic times.",
      "chain": [
        "20193",
        "20022",
        "20031",
        "405"
      ]
    },
    {
      "hadith_no": "4547",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا سليمان بن حرب، ومسدد، - المعنى - قالا حدثنا حماد، عن خالد، عن القاسم بن ربيعة، عن عقبة بن أوس، عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم خطب يوم الفتح بمكة فكبر ثلاثا ثم قال ‏\"‏ لا إله إلا الله وحده صدق وعده ونصر عبده وهزم الأحزاب وحده ‏\"‏ ‏.‏ إلى ها هنا حفظته عن مسدد ثم اتفقا ‏\"‏ ألا إن كل مأثرة كانت في الجاهلية تذكر وتدعى من دم أو مال تحت قدمى إلا ما كان من سقاية الحاج وسدانة البيت ‏\"‏ ‏.‏ ثم قال ‏\"‏ ألا إن دية الخطإ شبه العمد ما كان بالسوط والعصا مائة من الإبل منها أربعون في بطونها أولادها ‏\"‏ ‏.‏ وحديث مسدد أتم ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr:                     (Musaddad's version has): The Messenger of Allah (ﷺ) made a speech on the day of the conquest of Mecca, and said: Allah is Most Great, three times. He then said: There is no god but Allah alone: He fulfilled His promise, helped His servant, and alone defeated the companies. (The narrator said:) I have remembered from Musaddad up to this. Then the agreed version has: Take note! All the merits mentioned in pre-Islamic times, and the claim made for blood or property are under my feet, except the supply of water to the pilgrims and the custody of the Ka'bah. He then said: The blood-money for unintentional murder which appears intentional, such as is done with a whip and a stick, is one hundred camels, forty of which are pregnant. Musaddad's version is more accurate.",
      "chain": [
        "20193",
        "20022",
        "11282",
        "14317",
        "5186",
        "29"
      ]
    },
    {
      "hadith_no": "4588",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا سليمان بن حرب، ومسدد، - المعنى - قالا حدثنا حماد، عن خالد، عن القاسم بن ربيعة، عن عقبة بن أوس، عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم - قال مسدد - خطب يوم الفتح - ثم اتفقا - فقال ‏\"‏ ألا إن كل مأثرة كانت في الجاهلية من دم أو مال تذكر وتدعى تحت قدمى إلا ما كان من سقاية الحاج وسدانة البيت ‏\"‏ ‏.‏ ثم قال ‏\"‏ ألا إن دية الخطإ شبه العمد ما كان بالسوط والعصا مائة من الإبل منها أربعون في بطونها أولادها ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: Musaddad's version has: He addressed on the day of Conquest. The agreed version then goes: Beware! Every object of pride of pre-Islamic times, whether it is blood-vengeance or property, mentioned or claimed, has been put under my feet except supply of water to the pilgrims and custody of the House (the Ka'bah). He then said: Beware! The blood-wit for unintentional murder, such as is done with a whip and stick, is one hundred camels, forty of which are pregnant.",
      "chain": [
        "20193",
        "20022",
        "11282",
        "14317",
        "5186",
        "29"
      ]
    },
    {
      "hadith_no": "4622",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد، قال سمعت أيوب، يقول كذب على الحسن ضربان من الناس قوم القدر رأيهم وهم يريدون أن ينفقوا بذلك رأيهم وقوم له في قلوبهم شنآن وبغض يقولون أليس من قوله كذا أليس من قوله كذا",
      "text_en": " Hammad said:                      I heard Ayyub say: Two kinds of people have lied to al-Hasan: people who believed in free will and they intended that they publicise their belief by it; and people who had enmity with and hostility (for al-Hasan), saying: Did he not say so and so? Did he not say so and so?",
      "chain": [
        "20193",
        "20022",
        "11015"
      ]
    },
    {
      "hadith_no": "4625",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، قال قال لي الحسن ما أنا بعائد، إلى شىء منه أبدا ‏.‏",
      "text_en": " Ayyub said:                      Al-Hasan said: I will never return to it.",
      "chain": [
        "20193",
        "20022",
        "11015"
      ]
    },
    {
      "hadith_no": "4739",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا بسطام بن حريث، عن أشعث الحداني، عن أنس بن مالك، عن النبي صلى الله عليه وسلم قال ‏:‏ ‏\"‏ شفاعتي لأهل الكبائر من أمتي ‏\"‏ ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Prophet (ﷺ) said: My intercession will be for those of my people who have committed major sins.",
      "chain": [
        "20193",
        "24031",
        "19837",
        "19"
      ]
    },
    {
      "hadith_no": "4745",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا سليمان بن حرب، ومسدد، قالا حدثنا حماد بن زيد، عن أيوب، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ إن أمامكم حوضا ما بين ناحيتيه كما بين جرباء وأذرح ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Umar reported the Messenger of Allah(ﷺ) as saying:                      Before you there will be a pond the distance between whose sides is like that between Jarbah and Adhruh.",
      "chain": [
        "20193",
        "30175",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4796",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد، عن إسحاق بن سويد، عن أبي قتادة، قال كنا مع عمران بن حصين وثم بشير بن كعب فحدث عمران بن حصين، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الحياء خير كله ‏\"‏ ‏.‏ أو قال ‏\"‏ الحياء كله خير ‏\"‏ ‏.‏ فقال بشير بن كعب إنا نجد في بعض الكتب أن منه سكينة ووقارا ومنه ضعفا ‏.‏ فأعاد عمران الحديث وأعاد بشير الكلام قال فغضب عمران حتى احمرت عيناه وقال ألا أراني أحدثك عن رسول الله صلى الله عليه وسلم وتحدثني عن كتبك ‏.‏ قال قلنا يا أبا نجيد إيه إيه ‏.‏",
      "text_en": " ABU QATADAH SAID :                      WE WERE SITTING WITH ‘IMRAN B. HUSSAIN AND BUSHAIR B. KA’B WAS ALSO THERE. ‘IMRAN B. HUSSAIN REPORTED THE APOSTLE OF ALLAH (MAY PEACE BE UPON HIM) AS SAYING: MODESTY IS A GOOD ALTOGETHER, OR HE SAID: MODESTY IS ALTOGETHER GOOD. BUSHAIR B. KA’B SAID : WE FIND IN SOME BOOKS THAT THERE  IS A MODESTY WHICH PRODUCES PEACE AND DIGNIFIED BEARING, AND THERE IS A MODESTY WHICH PRODUCES WEAKNESS. ‘IMRAN B. HUSSAIN REPEATED THE SAME WORDS. SO ‘IMRAN BECAME ANGRY SO MUCH SO THAT HIS EYES BECAME RED, AND HE SAID : DON’T YOU SEE THAT I AM TRANSMITTING A TRADITION FROM THE APOSTLE OF ALLAH (MAY PEACE BE UPON HIM) AND YOU ARE MENTIONING SOMETHING FROM YOUR BOOKS? HE (QATADAH) SAID : WE SAID : ABU NUJAID, IT IS SUFFICIENT.",
      "chain": [
        "20193",
        "20022",
        "11575",
        "391"
      ]
    },
    {
      "hadith_no": "4970",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، وسليمان بن حرب، - المعنى - قالا حدثنا حماد، عن هشام بن عروة، عن أبيه، عن عائشة، رضى الله عنها أنها قالت يا رسول الله كل صواحبي لهن كنى ‏.‏ قال ‏\"‏ فاكتني بابنك عبد الله ‏\"‏ ‏.‏ يعني ابن أختها قال مسدد عبد الله بن الزبير قال فكانت تكنى بأم عبد الله ‏.‏ قال أبو داود وهكذا قال قران بن تمام ومعمر جميعا عن هشام نحوه ورواه أبو أسامة عن هشام عن عباد بن حمزة وكذلك حماد بن سلمة ومسلمة بن قعنب عن هشام كما قال أبو أسامة ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Aisha said: Messenger of Allah! All my fellow-wives have kunyahs? He said: Give yourself the kunyah by Abdullah, your son - that is to say, her nephew (her sister's son). Musaddad said: Abdullah ibn az-Zubayr. She was called by the kunyah Umm Abdullah.Abu Dawud said: Qurran b. Tammam and Ma'mar all have transmitted it from Hisham in a similar manner. It has also been transmitted by Abu Usamah from Hisham, from 'Abbad b. Hamzah. Similarly, Hammad b. Salamah and Maslamah b. Qa'nab have narrated it from Hisham, like the tradition transmitted by Abu Usamah.",
      "chain": [
        "30175",
        "20193",
        "20022",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4997",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، أن امرأة، قالت يا رسول الله إن لي جارة - تعني ضرة - هل على جناح إن تشبعت لها بما لم يعط زوجي قال ‏\"‏ المتشبع بما لم يعط كلابس ثوبى زور ‏\"‏ ‏.‏",
      "text_en": " Asma’, daughter of Abu Bakr, told of a woman who said :                      Messenger of Allah! I have a fellow-wife; will it be wrong for me to boast of receiving from my husband what he does not give me? He replied: the one who boasts of receiving what he has not been given is like him who has put on two garments of falsehood.",
      "chain": [
        "20193",
        "20022",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "1211",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "حدثنا علي بن نصر بن علي، حدثنا سليمان بن حرب، حدثنا حماد بن زيد، قال قلت لأيوب هل علمت أن أحدا قال في أمرك بيدك أنها ثلاث إلا الحسن فقال لا إلا الحسن ‏.‏ ثم قال اللهم غفرا إلا ما حدثني قتادة عن كثير مولى ابن سمرة عن أبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاث ‏\"‏ ‏.‏ قال أيوب فلقيت كثيرا - مولى ابن سمرة فسألته فلم يعرفه فرجعت إلى قتادة فأخبرته فقال نسي ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث سليمان بن حرب عن حماد بن زيد ‏.‏",
      "text_en": " Hammad bin Yazid said:                     \"I said to Abu Ayyub: 'Do you know of anyone who said that: \"Your case is up to you?\" counts as three besides Al-Hasan?' He said: \"No, not besides Al-Hasan.' Then he said: 'O Allah forgive me - except for what has been narrated to me by Qatadah, from Kathir the freed slave of Banu Samurah, from Abu Salamah, from Abu Hurairah, that the Prophet said: \"Three.'\"Abu Ayyub said: 'So I met Kathir the freed slave of Banu Samurah and asked him about it, but he was not aware of it. So I returned to Qatadah and informed him about that and he said: \"He forgot.\"",
      "chain": [
        "30557",
        "20193",
        "20022",
        "11019",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1212",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "وسألت محمدا عن هذا الحديث، فقال حدثنا سليمان بن حرب، عن حماد بن زيد، بهذا وإنما هو عن أبي هريرة، موقوف ‏.‏ ولم يعرف حديث أبي هريرة مرفوعا ‏.‏ وكان علي بن نصر حافظا صاحب حديث ‏.‏ وقد اختلف أهل العلم في أمرك بيدك فقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم منهم عمر بن الخطاب وعبد الله بن مسعود هي واحدة ‏.‏ وهو قول غير واحد من أهل العلم من التابعين ومن بعدهم ‏.‏ وقال عثمان بن عفان وزيد بن ثابت القضاء ما قضت ‏.‏ وقال ابن عمر إذا جعل أمرها بيدها وطلقت نفسها ثلاثا وأنكر الزوج وقال لم أجعل أمرها بيدها إلا في واحدة استحلف الزوج وكان القول قوله مع يمينه ‏.‏ وذهب سفيان وأهل الكوفة إلى قول عمر وعبد الله ‏.‏ وأما مالك بن أنس فقال القضاء ما قضت ‏.‏ وهو قول أحمد ‏.‏ وأما إسحاق فذهب إلى قول ابن عمر ‏.‏",
      "text_en": "",
      "chain": [
        "20193",
        "20022"
      ]
    },
    {
      "hadith_no": "1228",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا أبو الوليد، وعفان، وسليمان بن حرب، قالوا حدثنا حماد بن سلمة، عن حميد، عن أنس، أن رسول الله صلى الله عليه وسلم نهى عن بيع العنب حتى يسود وعن بيع الحب حتى يشتد ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه مرفوعا إلا من حديث حماد بن سلمة ‏.‏",
      "text_en": " Narrated Anas:                     \"The Messenger of Allah (ﷺ) prohibited selling grapes until they appear and selling grains until they become firm.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it being Marfu' except from the narration of Hammad bin Salamah.",
      "chain": [
        "30115",
        "20296",
        "30106",
        "20193",
        "20021",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "3243",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثني سليمان بن حرب، حدثنا حماد بن سلمة، عن ثابت، عن أنس، قال كانت اليهود إذا حاضت امرأة منهم لم يواكلوها ولم يشاربوها ولم يجامعوها في البيوت فسئل النبي صلى الله عليه وسلم عن ذلك فأنزل الله تعالى ‏:‏ ‏(‏يسألونك عن المحيض قل هو أذى ‏)‏ فأمرهم رسول الله صلى الله عليه وسلم أن يواكلوهن ويشاربوهن وأن يكونوا معهن في البيوت وأن يفعلوا كل شيء ما خلا النكاح فقالت اليهود ما يريد أن يدع شيئا من أمرنا إلا خالفنا فيه ‏.‏ قال فجاء عباد بن بشر وأسيد بن حضير إلى رسول الله صلى الله عليه وسلم فأخبراه بذلك وقالا يا رسول الله أفلا ننكحهن في المحيض فتمعر وجه رسول الله صلى الله عليه وسلم حتى ظننا أنه قد غضب عليهما فقاما فاستقبلتهما هدية من لبن فأرسل رسول الله صلى الله عليه وسلم في آثارهما فسقاهما فعلمنا أنه لم يغضب عليهما ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Anas:                     \"When the women among the Jews menstruated, they would not eat with them, nor drink with them, nor mingle with them in their homes. The Prophet (ﷺ) was asked about that, so Allah, Blessed and Most High, revealed: \"They ask you about menstruation. Say It is a Adha (harmful matter) (2:222).' So the Messenger of Allah (ﷺ) told them to eat with them, drink with them and to remain in the house with them, and to do everything besides intercourse with them. The Jews said: 'He does not want to leave any matter of ours without opposing us in it.'\" He said: \"Then 'Abbad bin Bishr and Usaid bin Hudair came to the Messenger of Allah (ﷺ) to inform him about that. They said: 'O Messenger of Allah! Should we not (then) have intercourse with them during their menstruation?' The face of the Messenger of Allah (ﷺ) changed color, until they thought that he was angry with them. So they left, and afterwards the Prophet (ﷺ) was given some milk as a gift, so he sent some of it to them to drink. Then they knew that he was not angry with them.\"",
      "chain": [
        "30553",
        "20193",
        "20021",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3353",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا سليمان بن حرب، حدثنا حماد بن سلمة، عن ثابت، عن أنس، أن النبي صلى الله عليه وسلم قرأ هذه الآية ‏:‏ ‏(‏ فلما تجلى ربه للجبل جعله دكا ‏)‏ قال حماد هكذا وأمسك سليمان بطرف إبهامه على أنملة إصبعه اليمنى قال فساخ الجبل ‏(‏ وخر موسى صعقا ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح لا نعرفه إلا من حديث حماد بن سلمة ‏.‏",
      "text_en": " Narrated Sulaiman bin Harb:                     \"Hammad bin Salamah narrated to us, from Thabit, from Anas, that the Prophet (ﷺ) recited this Ayah: So when his Lord appeared to the mountain, He made it collapse to dust (7:143) - Hammad said: \"Like this.\" Sulaiman held his thumb over the tip of his finger on the right hand (so that only the tip of one finger was protruding) - and he [the Prophet (ﷺ)] said: \"So the mountain fainted. 'And Musa fell down unconscious.'\"",
      "chain": [
        "30025",
        "20193",
        "20021",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3435",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا الحسن بن موسى، وسليمان بن حرب، قالا حدثنا حماد بن سلمة، عن علي بن زيد، عن أوس بن خالد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يحشر الناس يوم القيامة ثلاثة أصناف صنفا مشاة وصنفا ركبانا وصنفا على وجوههم ‏\"‏ ‏.‏ قيل يا رسول الله وكيف يمشون على وجوههم قال ‏\"‏ إن الذي أمشاهم على أقدامهم قادر على أن يمشيهم على وجوههم أما إنهم يتقون بوجوههم كل حدب وشوك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد روى وهيب عن ابن طاوس عن أبيه عن أبي هريرة عن النبي صلى الله عليه وسلم شيئا من هذا ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"People will be gathered in three classes on the Day of Resurrection: A class walking, a class riding, and a class upon their faces.\" It was said: \"O Messenger of Allah! How will they walk upon their faces?\" He said: \"Indeed the One Who made them walk upon their feet, is able to make them walk upon their faces. Verily they will try to protect their faces from every bump and thorn.\"",
      "chain": [
        "30553",
        "20383",
        "20193",
        "20021",
        "10664",
        "13"
      ]
    },
    {
      "hadith_no": "3545",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا حبان بن هلال، وسليمان بن حرب، وحجاج بن منهال، قالوا حدثنا حماد بن سلمة، عن ثابت، عن شهر بن حوشب، عن أسماء بنت يزيد، قالت سمعت رسول الله صلى الله عليه وسلم يقرأ ‏:‏ ‏(‏يا عبادي الذين أسرفوا على أنفسهم لا تقنطوا من رحمة الله إن الله يغفر الذنوب جميعا ‏)‏ ولا يبالي ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث ثابت عن شهر بن حوشب ‏.‏ قال وشهر بن حوشب يروي عن أم سلمة الأنصارية وأم سلمة الأنصارية هي أسماء بنت يزيد ‏.‏",
      "text_en": " Narrated Asma bint Yazid:                     \"I heard the Messenger of Allah (ﷺ) reciting: 'Say: \"O My slaves who have transgressed against themselves! Despair not of the mercy of Allah, verily, Allah forgives all sins and I do not mind (referring to 39:53).\"",
      "chain": [
        "30553",
        "20218",
        "20193",
        "20219",
        "20021",
        "11269",
        "11044",
        "84"
      ]
    },
    {
      "hadith_no": "3574",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثني سليمان بن حرب، حدثنا حماد بن سلمة، عن ثابت، عن أنس، أن ثمانين، هبطوا على رسول الله صلى الله عليه وسلم وأصحابه من جبل التنعيم عند صلاة الصبح وهم يريدون أن يقتلوه فأخذوا أخذا فأعتقهم رسول الله صلى الله عليه وسلم فأنزل الله ‏:‏ ‏(‏ هو الذي كف أيديهم عنكم وأيديكم عنهم ‏)‏ الآية ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Anas:                     that eighty people swooped down from the mountain of At-Tan'im to kill the Messenger of Allah (ﷺ) during Salat As-Subh, but he captured them and (later) let them go. So Allah revealed the Ayah: And it is He Who has withheld their hands from you and your hands from them (48:24).",
      "chain": [
        "30553",
        "20193",
        "20021",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "4308",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا يحيى بن موسى، قال حدثنا سليمان بن حرب، حدثنا محمد بن أبي رزين، عن أمه، قالت كانت أم الحرير إذا مات أحد من العرب اشتد عليها فقيل لها إنا نراك إذا مات رجل من العرب اشتد عليك ‏.‏ قالت سمعت مولاى يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من اقتراب الساعة هلاك العرب ‏\"‏ ‏.‏ قال محمد بن أبي رزين ومولاها طلحة بن مالك ‏.‏ قال هذا حديث غريب إنما نعرفه من حديث سليمان بن حرب ‏.‏",
      "text_en": " Narrated Muhammad bin Abi Razin:                     that his mother said: \"If someone died from the Arabs it would be hard upon Umm Al-Harir so it was said to her: 'We see that if a man from the Arabs dies it is hard upon you.' She said: 'I heard my Mawla say that the Messenger of Allah (ﷺ) said: \"From the (signs of) coming of the Hour is the destruction of the Arabs.\" Muhammad bin Abi Razin said: \"And her Mawla was Talhah bin Malik.\"",
      "chain": [
        "30221",
        "20193"
      ]
    },
    {
      "hadith_no": "290",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا سليمان بن حرب، قال حدثنا حماد بن سلمة، عن ثابت، عن أنس، قال كانت اليهود إذا حاضت المرأة منهم لم يؤاكلوهن ولم يشاربوهن ولم يجامعوهن في البيوت فسألوا نبي الله صلى الله عليه وسلم عن ذلك فأنزل الله عز وجل ‏{‏ ويسألونك عن المحيض قل هو أذى ‏}‏ الآية فأمرهم رسول الله صلى الله عليه وسلم أن يؤاكلوهن ويشاربوهن ويجامعوهن في البيوت وأن يصنعوا بهن كل شىء ما خلا الجماع ‏.‏",
      "text_en": " It was narrated that Anas said:                      \"When one of their womenfolk menstruated, the Jews would not eat or drink with them, nor mix with them in their houses. They asked the Prophet of Allah (ﷺ) about that, and Allah the Mighty and Sublime revealed: The ask you concerning menstruation. Say: 'That is an Adha (a harmful thing).'[2] So the Messenger of Allah (ﷺ) commanded them to eat and drink with them (menstruating women) and to mix with them in their houses, and to do everything with them except intercourse. The Jews said: 'The Messenger of Allah (ﷺ) does not leave anything against it.' Usaid bin Hudair and 'Abbad bin Bishr went and told the Messenger of Allah (ﷺ) and they said: 'Should we have intercourse with them when they are menstruating?' The expression of the Messenger of Allah (ﷺ) changed greatly until we thought that he was angry with them, and they left. Then the Messenger of Allah (ﷺ) received a gift of milk, so he sent someone to bring them back and he gave them some to drink, so they knew that he was not angry with them.\"[1] Al-Baqarah 2:222.[2] Al-Baqarah 2:222.",
      "chain": [
        "30123",
        "20193",
        "20021",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "369",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا سليمان بن حرب، قال حدثنا حماد بن سلمة، عن ثابت، عن أنس، قال كانت اليهود إذا حاضت المرأة منهم لم يؤاكلوهن ولا يشاربوهن ولا يجامعوهن في البيوت فسألوا النبي صلى الله عليه وسلم فأنزل الله عز وجل ‏{‏ ويسألونك عن المحيض قل هو أذى ‏}‏ الآية فأمرهم رسول الله صلى الله عليه وسلم أن يؤاكلوهن ويشاربوهن ويجامعوهن في البيوت وأن يصنعوا بهن كل شىء ما خلا الجماع ‏.‏ فقالت اليهود ما يدع رسول الله صلى الله عليه وسلم شيئا من أمرنا إلا خالفنا ‏.‏ فقام أسيد بن حضير وعباد بن بشر فأخبرا رسول الله صلى الله عليه وسلم قالا أنجامعهن في المحيض فتمعر رسول الله صلى الله عليه وسلم تمعرا شديدا حتى ظننا أنه قد غضب فقاما فاستقبل رسول الله صلى الله عليه وسلم هدية لبن فبعث في آثارهما فردهما فسقاهما فعرف أنه لم يغضب عليهما ‏.‏",
      "text_en": " It was narrated that Anas said:                      \"When one of their womenfolk menstruated, the Jews would not eat or drink with them, or mix with them in their houses. They (the Companions) asked the Prophet of Allah (ﷺ) about that, and Allah, the Mighty and Sublime, revealed the Ayah: They ask you concerning menstruation. Say: \"That is an Adha (a harmful thing).[2] So the Messenger of Allah (ﷺ) commanded them to eat and drink with them (menstruating women) and to mix them in their houses, and to do everything with them except intercourse. The Jews said: 'The Messenger of Allah (ﷺ) does not leave anything of our affairs except he goes against it.' Usaid bin Hudair and 'Abbad bin Bishr went and told the Messenger of Allah (ﷺ) and they said: 'Should we have intercourse with them when they are menstruating?' The expression of the Messenger of Allah (ﷺ) changed greatly until we thought he was angry with them, and they left. Then the Messenger of Allah (ﷺ) received a gift of milk, so he sent someone to bring them back and he gave them some to drink, so we knew that he was not angry with them.\"[1] Al-Baqarah 2:222[2] Al-Baqarah 2:222",
      "chain": [
        "30123",
        "20193",
        "20021",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "552",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن ثابت، عن أنس، قال صلى رسول الله صلى الله عليه وسلم يوم خيبر صلاة الصبح بغلس وهو قريب منهم فأغار عليهم وقال ‏\"‏ الله أكبر خربت خيبر - مرتين - إنا إذا نزلنا بساحة قوم فساء صباح المنذرين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas said:                      \"The Messenger of Allah (ﷺ) prayed Fajr on the day of Khaibar during the time it was still dark, when he was near the enemy. Then he attacked them and said: 'Allahu Akbar! Khaibar is destroyed!' Twice. 'Then, when it descends in their courtyard, evil will be the morning for those who had been warned!'\" [1][1] As-Saffat 37:177",
      "chain": [
        "30123",
        "20193",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "643",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، عن أبي قلابة، عن عمرو بن سلمة، فقال لي أبو قلابة هو حى أفلا تلقاه ‏.‏ قال أيوب فلقيته فسألته فقال لما كان وقعة الفتح بادر كل قوم بإسلامهم فذهب أبي بإسلام أهل حوائنا فلما قدم استقبلناه فقال جئتكم والله من عند رسول الله صلى الله عليه وسلم حقا فقال ‏\"‏ صلوا صلاة كذا في حين كذا وصلاة كذا في حين كذا فإذا حضرت الصلاة فليؤذن لكم أحدكم وليؤمكم أكثركم قرآنا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ayyub, from Abu Qilabah, from 'Amr bin Salamah:                      \"Abu Qilabah said to me (Ayyub): He ('Amr) is still alive, do you want to meet him?\" I met him and asked him, and he said: \"When Makkah was conquered, all the people hastened to announce their Islam. My father went to announce the Islam of the poeple of our village, and when he came back we went to see him and he said: 'By Allah, I have indeed come to you from the Messenger of Allah (ﷺ)'. He said: 'Pray such and such a prayer at such and such a time, pray such and such a prayer at such and such a time. When the time for prayer comes let one of you call the Adhan and let the one who knows the most Qur'an lead the prayer.'\"",
      "chain": [
        "38088",
        "20193",
        "20022",
        "11015",
        "11047",
        "5206"
      ]
    },
    {
      "hadith_no": "1304",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا أبو داود، قال حدثنا سليمان بن حرب، قال حدثنا حماد بن سلمة، عن سعيد الجريري، عن أبي العلاء، عن شداد بن أوس، أن رسول الله صلى الله عليه وسلم كان يقول في صلاته ‏\"‏ اللهم إني أسألك الثبات في الأمر والعزيمة على الرشد وأسألك شكر نعمتك وحسن عبادتك وأسألك قلبا سليما ولسانا صادقا وأسألك من خير ما تعلم وأعوذ بك من شر ما تعلم وأستغفرك لما تعلم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Shadad bin Aws that:                     The Messenger of Allah (ﷺ) used to say in his prayer: \"Allahumma inni as'aluka at-thabbuta fi al-amr wal-'azimata 'alar-rushdi wa as'aluka shukr ni'matik wa husna 'ibadatik wa as'aluka qalban saliman wa lisanan sadiqan wa as'aluka min khairi ma at'lamu wa author bika min sharri ma at'lamu wastaghfiruka lima ta'lam (O Allah, I ask You for steadfastness in all my affairs and determination in following the right path, I ask You to make me thankful for Your blessings and to make me worship You properly. I ask You for a sound heart and a truthful tongue. I ask You for the best of what You know and I seek refuge in You from the worst of what You know and I seek Your forgiveness for what You know.)\"",
      "chain": [
        "30002",
        "20193",
        "20021",
        "11286",
        "389"
      ]
    },
    {
      "hadith_no": "1747",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا سليمان بن حرب، وهشام بن عبد الملك، قالا حدثنا حماد بن سلمة، عن هشام بن عمرو الفزاري، عن عبد الرحمن بن الحارث بن هشام، عن علي بن أبي طالب، أن النبي صلى الله عليه وسلم كان يقول في آخر وتره ‏\"‏ اللهم إني أعوذ برضاك من سخطك وبمعافاتك من عقوبتك وأعوذ بك منك لا أحصي ثناء عليك أنت كما أثنيت على نفسك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ali bin Abi Talib that:                     The Prophet (ﷺ) used to say at the end of witr: Allahumma inni audhu bi ridaka min sakhatika wa bi mu'afatika min uqubatika, wa audhu bika minka la uhsi thana'an 'alayka, anta kama athwart ala nafsik ( O Allah, I seek refuge in Your pleasure from Your wrath and in Your forgiveness from Your punishment. And I seek refuge in You from You; I cannot praise You enough; You are as You have praised Yourself.).\"",
      "chain": [
        "20193",
        "20021",
        "448",
        "5"
      ]
    },
    {
      "hadith_no": "1861",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا سليمان بن حرب، قال حدثنا شعبة، عن عوف، عن خالد الأحدب، عن صفوان بن محرز، قال أغمي على أبي موسى فبكوا عليه فقال أبرأ إليكم كما برئ إلينا رسول الله صلى الله عليه وسلم ليس منا من حلق ولا خرق ولا سلق ‏.‏",
      "text_en": " It was narrated that Safwan bin Muhriz said:                     \"Abu Musa fell unconscious and they wept for him. He said: 'I say to you the words of disavowal that the messenger of Allah said: He is not one of us who shaves his head (as a sign of mourning), rends his garments, or raises his voice in Lamentation.\"'",
      "chain": [
        "30153",
        "20193",
        "20020",
        "11298",
        "11693"
      ]
    },
    {
      "hadith_no": "1878",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسحاق، قال أنبأنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، عن حميد بن هلال، عن أنس، أن رسول الله صلى الله عليه وسلم نعى زيدا وجعفرا قبل أن يجيء خبرهم فنعاهم وعيناه تذرفان ‏.‏",
      "text_en": " It was narrated from Anas:                     that the Messenger of Allah announced the news of the death of Zaid and Ja'far before news of them came. He announced their death and his eyes were overflowing with tears.",
      "chain": [
        "30021",
        "20193",
        "20022",
        "11015",
        "11281",
        "19"
      ]
    },
    {
      "hadith_no": "2016",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال أنبأنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، عن حميد بن هلال، عن سعد بن هشام بن عامر، عن أبيه، قال ‏:‏ اشتد الجراح يوم أحد فشكي ذلك إلى رسول الله صلى الله عليه وسلم فقال ‏:‏ ‏\"‏ احفروا وأوسعوا وأحسنوا، وادفنوا في القبر الاثنين والثلاثة، وقدموا أكثرهم قرآنا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sa'd bin Hisham bin 'Amir that his father said:                     \"Many people were wounded on the day of Uhud and complaints were made to the Messenger of Allah about that. He said: 'Dig graves and make them good and wide, and bury two or three in a grave, and put in first the one who knew the Qur'an most.\"'",
      "chain": [
        "38088",
        "20193",
        "20022",
        "11015",
        "11281",
        "11166",
        "1331"
      ]
    },
    {
      "hadith_no": "3022",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني أبو داود، قال حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، عن أبي الزبير، عن جابر، أن النبي صلى الله عليه وسلم أفاض من عرفة وجعل يقول ‏\"‏ السكينة عباد الله ‏\"‏ ‏.‏ يقول بيده هكذا وأشار أيوب بباطن كفه إلى السماء ‏.‏",
      "text_en": " It was narrated from Jabir that the Prophet departed from Arafat and started saying:                     \"Be tranquil, O slaves of Allah!\" gesturing with his hand like this - and Ayyub gested with his palm uppermost.",
      "chain": [
        "30002",
        "20193",
        "20022",
        "11015",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3410",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا علي بن نصر بن علي، قال حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، قال قلت لأيوب هل علمت أحدا قال في أمرك بيدك أنها ثلاث غير الحسن فقال لا ثم قال اللهم غفرا إلا ما حدثني قتادة عن كثير مولى ابن سمرة عن أبي سلمة عن أبي هريرة عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاث ‏\"‏ ‏.‏ فلقيت كثيرا فسألته فلم يعرفه فرجعت إلى قتادة فأخبرته فقال نسي ‏.‏ قال أبو عبد الرحمن هذا حديث منكر ‏.‏",
      "text_en": " Hammad bin Zaid said:                      \"I said to Ayyub: 'Do you know anyone who said concerning the phrase 'It is up to you' that it is equivalent to three (divorces) except Al-Hasan?' He said: 'No.' Then he said: 'O Allah! Grant forgiveness, sorry.'\" Qatadah narrated to me from Kathir the freed slave of Ibn Samurah, from Abu Salamah, from Abu Hurairah, that the Prophet said: \"Three.\" I met Kathir and asked him, and he did not know of it. I went back to Qatadah and told him, and he said: \"He forgot.\"",
      "chain": [
        "30557",
        "20193",
        "20022",
        "11019",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3687",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Presents - كتاب النحل",
      "chapter_no": "31",
      "text_ar": "أخبرنا يعقوب بن سفيان، قال حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن حاجب بن المفضل بن المهلب، عن أبيه، قال سمعت النعمان بن بشير، يخطب قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اعدلوا بين أبنائكم اعدلوا بين أبنائكم ‏\"‏ ‏.‏",
      "text_en": " An-Nu'man bin Bashir delivered a Khutbah and said:                      \"The Messenger of Allah said: 'Treat your children fairly, treat your children fairly.'\"",
      "chain": [
        "38719",
        "20193",
        "20022",
        "274"
      ]
    },
    {
      "hadith_no": "5382",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا سليمان بن حرب، قال حدثنا عمر بن علي، عن أبي عميس، عن سعيد بن أبي بردة، عن أبيه، عن أبي موسى، قال أتاني ناس من الأشعريين فقالوا اذهب معنا إلى رسول الله صلى الله عليه وسلم فإن لنا حاجة‏.‏ فذهبت معهم فقالوا يا رسول الله استعن بنا في عملك‏.‏ قال أبو موسى فاعتذرت مما قالوا وأخبرت أني لا أدري ما حاجتهم فصدقني وعذرني‏.‏ فقال ‏\"‏ إنا لا نستعين في عملنا بمن سألنا ‏\"‏‏.‏",
      "text_en": " It was narrated that Abu Musa said:                     \"Some people from among the Ash'aris came to me and said: 'Go with us to the Messenger of Allah [SAW], for we have something to ask him.' So I went with them, and they said: 'O Messenger of Allah, use us to do your work.'\" Abu Musa said: \"I apologized for what they said, and I told him that I did not know what they were going to ask. He believed me and excused me, and said: 'We do not appoint for our work anyone who asks for that.'\"",
      "chain": [
        "38433",
        "20193",
        "20265",
        "11345",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1492",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن سعيد الدارمي، حدثنا سليمان بن حرب، حدثنا حماد بن سلمة، عن داود بن أبي هند، عن زرارة بن أوفى، عن تميم الداري، عن النبي  صلى الله عليه وسلم  ح وحدثنا الحسن بن محمد بن الصباح، حدثنا عفان، حدثنا حماد، أنبأنا حميد، عن الحسن، عن رجل، عن أبي هريرة، وداود بن أبي هند، عن زرارة بن أوفى، عن تميم الداري، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ أول ما يحاسب به العبد يوم القيامة صلاته فإن أكملها كتبت له نافلة فإن لم يكن أكملها قال الله سبحانه لملائكته انظروا هل تجدون لعبدي من تطوع فأكملوا بها ما ضيع من فريضته ‏.‏ ثم تؤخذ الأعمال على حسب ذلك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Tamim Dari that the Prophet (ﷺ) said:                      “Thefirstthing for which a person will be brought to account on the DayofResurrection will be his prayer. If it is complete, then thevoluntary (prayers) will also be recorded for him (as an increase).Ifit is not complete then Allah will say to His angels: ‘Look andseewhether you find any voluntary prayers for My slave, and takethem tomake up what is lacking from his obligatory prayers.’ Thenall hisdeeds will be reckoned in like manner.”",
      "chain": [
        "30296",
        "20193",
        "20021",
        "11585",
        "11284",
        "382"
      ]
    },
    {
      "hadith_no": "2710",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، حدثنا حماد بن سلمة، ح وحدثنا محمد بن يحيى، حدثنا سليمان بن حرب، ح وحدثنا هارون بن حيان، أنبأنا عبد العزيز بن المغيرة، قالا حدثنا حماد بن سلمة، عن عقيل بن طلحة السلمي، عن مسلم بن هيصم، عن الأشعث بن قيس، قال أتيت رسول الله صلى الله عليه وسلم في وفد كندة ولا يروني أفضلهم فقلت يا رسول الله ألستم منا ‏.‏ فقال ‏\"‏ نحن بنو النضر بن كنانة لا نقفو أمنا ولا ننتفي من أبينا ‏\"‏ ‏.‏ قال فكان الأشعث بن قيس يقول لا أوتى برجل نفى رجلا من قريش من النضر بن كنانة إلا جلدته الحد ‏.‏",
      "text_en": " Muslim bin Haisam narrated from Ash'ath bin Qais who said:                     “I came to the Messenger of Allah (ﷺ) with a delegation from Kindah, and they thought that I was the best of them. I said: 'O Messenger of Allah (ﷺ) are you not from among us?' He said: 'We are the tribe of Banu Nadr bin Kinanah, and we do not attribute ourselves to our mother and we do not deny our forefathers.'”He said: “Ash'ath bin Qais used to say: 'If any man is brought to me who suggests that a man from Quraish does not belong to Nadr bin Kinanah, I would carry out the legal punishment (for slander) on him.'”",
      "chain": [
        "30201",
        "20472",
        "20021",
        "11222",
        "20193",
        "24269",
        "20021",
        "5190",
        "10964",
        "485"
      ]
    },
    {
      "hadith_no": "2729",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا سليمان بن حرب، حدثنا حماد بن زيد، عن خالد الحذاء، عن القاسم بن ربيعة، عن عقبة بن أوس، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "11222",
        "20193",
        "20022",
        "11282",
        "14317",
        "5186",
        "29"
      ]
    }
  ],
  "total_hadiths": 240
}