{
  "id": "20208",
  "name": "Isma'il bin Ibrahim",
  "full_name": "Isma'il bin Ibrahim (Ibn 'Ulayya) (إسماعيل بن إبراهيم ابن علية)",
  "grade": "Thiqah (Trustworthy)",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "193",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-Ahmsi",
      "Client",
      "al-Bajli",
      "al-Kufi"
    ]
  },
  "parents": [
    {
      "id": "19253",
      "name": "Abu Khalid al-Bajli,al-Ahamsi أبو خالد البجلي الأحمسي",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "15185",
      "name": "Sa'id bin Abi Khalid سعيد بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "13645",
      "name": "Ash'ath bin Abi Khalid أشعث بن أبي خالد",
      "grade": "Follower(Tabi')"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "19253",
      "name": "Abu Khalid al-Bajli,al-Ahamsi أبو خالد البجلي الأحمسي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "4047",
      "name": "Abu Juhayfa al-Sawai' ( أبو جحيفة السوائي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5115",
      "name": "'Abdullah bin Abi Awfa ( عبد الله بن أبي أوفي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5202",
      "name": "'Amr bin Hurayth bin 'Amr bin 'Uthman ( عمرو بن حريث بن عمرو بن عثمان ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "5370",
      "name": "Abu Kahil al-Ahamsi ( أبو كاهل الأحمسي ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11341",
      "name": "Zayd bin Wahb al-Jhny زيد بن وهب الجهني",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "10553",
      "name": "Muhammad bin Sa'd ibn Abi Waqqas محمد بن سعد بن أبي وقاص",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10847",
      "name": "Abu Bakr bin 'Umara أبو بكر بن عمارة بن روىبة",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11046",
      "name": "Qays bin Abi Hazim قيس بن أبي حازم",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "15224",
      "name": "Shbyl bin Awf شبيل بن عوف",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11681",
      "name": "al-Harith bin Shabayl الحارث بن شبيل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "3680",
      "name": "Tariq bin Shahab ( طارق بن شهاب ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "11052",
      "name": "'Amir al-Sha'bi عامر الشعبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "15185",
      "name": "Sa'id bin Abi Khalid سعيد بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "13645",
      "name": "Ash'ath bin Abi Khalid أشعث بن أبي خالد",
      "grade": "Follower(Tabi')"
    }
  ],
  "students": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20340",
      "name": "'Ubaidullah bin Musa bin Abi al-Mukhtar عبيد الله بن موسى بن أبي المختار باذام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "10",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا آدم بن أبي إياس، قال حدثنا شعبة، عن عبد الله بن أبي السفر، وإسماعيل، عن الشعبي، عن عبد الله بن عمرو  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ المسلم من سلم المسلمون من لسانه ويده، والمهاجر من هجر ما نهى الله عنه ‏\"‏‏.‏ قال أبو عبد الله وقال أبو معاوية حدثنا داود عن عامر قال سمعت عبد الله عن النبي صلى الله عليه وسلم‏.‏ وقال عبد الأعلى عن داود عن عامر عن عبد الله عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": "      Narrated 'Abdullah bin 'Amr:                          The Prophet said, \"A Muslim is the one who avoids harming Muslims with     his tongue and hands. And a Muhajir (emigrant) is the one who gives up     (abandons) all what Allah has forbidden.\"",
      "chain": [
        "20404",
        "20020",
        "11636",
        "20208",
        "11052",
        "29"
      ]
    },
    {
      "hadith_no": "15",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا يعقوب بن إبراهيم، قال حدثنا ابن علية، عن عبد العزيز بن صهيب، عن أنس، عن النبي صلى الله عليه وسلم ح وحدثنا آدم، قال حدثنا شعبة، عن قتادة، عن أنس، قال قال النبي صلى الله عليه وسلم ‏\"‏ لا يؤمن أحدكم حتى أكون أحب إليه من والده وولده والناس أجمعين ‏\"‏‏.‏",
      "text_en": "      Narrated Anas:                          The Prophet said \"None of you will have faith till he loves me more      than his father, his children and all mankind.\"",
      "chain": [
        "20184",
        "20208",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "50",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، قال حدثنا إسماعيل بن إبراهيم، أخبرنا أبو حيان التيمي، عن أبي زرعة، عن أبي هريرة، قال كان النبي صلى الله عليه وسلم بارزا يوما للناس، فأتاه جبريل فقال ما الإيمان قال ‏\"‏ الإيمان أن تؤمن بالله وملائكته وبلقائه ورسله، وتؤمن بالبعث ‏\"‏‏.‏ قال ما الإسلام قال ‏\"‏ الإسلام أن تعبد الله ولا تشرك به، وتقيم الصلاة، وتؤدي الزكاة المفروضة، وتصوم رمضان ‏\"‏‏.‏ قال ما الإحسان قال ‏\"‏ أن تعبد الله كأنك تراه، فإن لم تكن تراه فإنه يراك ‏\"‏‏.‏ قال متى الساعة قال ‏\"‏ ما المسئول عنها بأعلم من السائل، وسأخبرك عن أشراطها إذا ولدت الأمة ربها، وإذا تطاول رعاة الإبل البهم في البنيان، في خمس لا يعلمهن إلا الله ‏\"‏‏.‏ ثم تلا النبي صلى الله عليه وسلم ‏{‏إن الله عنده علم الساعة‏}‏ الآية‏.‏ ثم أدبر فقال ‏\"‏ ردوه ‏\"‏‏.‏ فلم يروا شيئا‏.‏ فقال ‏\"‏ هذا جبريل جاء يعلم الناس دينهم ‏\"‏‏.‏ قال أبو عبد الله جعل ذلك كله من الإيمان‏.‏",
      "text_en": "      Narrated Abu Huraira:                          One day while the Prophet was sitting in the company of some people,      (The angel) Gabriel came and asked, \"What is faith?\" Allah's Apostle      replied, 'Faith is to believe in Allah, His angels, (the) meeting with     Him, His Apostles, and to believe in Resurrection.\" Then he further      asked, \"What is Islam?\" Allah's Apostle replied, \"To worship Allah      Alone and none else, to offer prayers perfectly to pay the compulsory      charity (Zakat) and to observe fasts during the month of Ramadan.\"       Then he further asked, \"What is Ihsan (perfection)?\" Allah's Apostle      replied, \"To worship Allah as if you see Him, and if you cannot      achieve this state of devotion then you must consider that He is      looking at you.\" Then he further asked, \"When will the Hour be      established?\" Allah's Apostle replied, \"The answerer has no better      knowledge than the questioner. But I will inform you about its      portents.     1. When a slave (lady) gives birth to her master.     2. When the shepherds of black camels start boasting and competing      with others in the construction of higher buildings. And the Hour is      one of five things which nobody knows except Allah.     The Prophet then recited: \"Verily, with Allah (Alone) is the knowledge     of the Hour--.\" (31. 34) Then that man (Gabriel) left and the Prophet      asked his companions to call him back, but they could not see him.      Then the Prophet said, \"That was Gabriel who came to teach the people      their religion.\" Abu 'Abdullah said: He (the Prophet) considered all      that as a part of faith.",
      "chain": [
        "30175",
        "20208",
        "11404",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "167",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا مسدد، قال حدثنا إسماعيل، قال حدثنا خالد، عن حفصة بنت سيرين، عن أم عطية، قالت قال النبي صلى الله عليه وسلم لهن في غسل ابنته ‏\"‏ ابدأن بميامنها ومواضع الوضوء منها ‏\"‏‏.‏",
      "text_en": " Narrated Um-`Atiya:                     That the Prophet at the time of washing his deceased daughter had said to them, \"Start from the right side beginning with those parts which are washed in ablution.\"",
      "chain": [
        "30175",
        "20208",
        "11282",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "217",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا يعقوب بن إبراهيم، قال حدثنا إسماعيل بن إبراهيم، قال حدثني روح بن القاسم، قال حدثني عطاء بن أبي ميمونة، عن أنس بن مالك، قال كان النبي صلى الله عليه وسلم إذا تبرز لحاجته أتيته بماء فيغسل به‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Whenever the Prophet went to answer the call of nature, I used to bring water with which he used to clean his private parts.",
      "chain": [
        "20184",
        "20208",
        "11586",
        "11601",
        "19"
      ]
    },
    {
      "hadith_no": "326",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا قتيبة بن سعيد، قال حدثنا إسماعيل، عن أيوب، عن محمد، عن أم عطية، قالت كنا لا نعد الكدرة والصفرة شيئا‏.‏",
      "text_en": " Narrated Um `Atiya:                     We never considered yellowish discharge as a thing of importance (as menses).",
      "chain": [
        "30367",
        "20208",
        "11015",
        "20278",
        "71"
      ]
    },
    {
      "hadith_no": "371",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا يعقوب بن إبراهيم، قال حدثنا إسماعيل ابن علية، قال حدثنا عبد العزيز بن صهيب، عن أنس، أن رسول الله صلى الله عليه وسلم غزا خيبر، فصلينا عندها صلاة الغداة بغلس، فركب نبي الله صلى الله عليه وسلم وركب أبو طلحة، وأنا رديف أبي طلحة، فأجرى نبي الله صلى الله عليه وسلم في زقاق خيبر، وإن ركبتي لتمس فخذ نبي الله صلى الله عليه وسلم، ثم حسر الإزار عن فخذه حتى إني أنظر إلى بياض فخذ نبي الله صلى الله عليه وسلم، فلما دخل القرية قال ‏\"‏ الله أكبر، خربت خيبر، إنا إذا نزلنا بساحة قوم فساء صباح المنذرين ‏\"‏‏.‏ قالها ثلاثا‏.‏ قال وخرج القوم إلى أعمالهم فقالوا محمد  قال عبد العزيز وقال بعض أصحابنا  والخميس‏.‏ يعني الجيش، قال فأصبناها عنوة، فجمع السبى، فجاء دحية فقال يا نبي الله، أعطني جارية من السبى‏.‏ قال ‏\"‏ اذهب فخذ جارية ‏\"‏‏.‏ فأخذ صفية بنت حيى، فجاء رجل إلى النبي صلى الله عليه وسلم فقال يا نبي الله، أعطيت دحية صفية بنت حيى سيدة قريظة والنضير، لا تصلح إلا لك‏.‏ قال ‏\"‏ ادعوه بها ‏\"‏‏.‏ فجاء بها، فلما نظر إليها النبي صلى الله عليه وسلم قال ‏\"‏ خذ جارية من السبى غيرها ‏\"‏‏.‏ قال فأعتقها النبي صلى الله عليه وسلم وتزوجها‏.‏ فقال له ثابت يا أبا حمزة، ما أصدقها قال نفسها، أعتقها وتزوجها، حتى إذا كان بالطريق جهزتها له أم سليم فأهدتها له من الليل، فأصبح النبي صلى الله عليه وسلم عروسا فقال ‏\"‏ من كان عنده شىء فليجئ به ‏\"‏‏.‏ وبسط نطعا، فجعل الرجل يجيء بالتمر، وجعل الرجل يجيء بالسمن  قال وأحسبه قد ذكر السويق  قال فحاسوا حيسا، فكانت وليمة رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Abdul `Aziz:                     Anas said, 'When Allah's Apostle invaded Khaibar, we offered the Fajr prayer there yearly in the morning) when it was still dark. The Prophet rode and Abu Talha rode too and I was riding behind Abu Talha. The Prophet passed through the lane of Khaibar quickly and my knee was touching the thigh of the Prophet . He uncovered his thigh and I saw the whiteness of the thigh of the Prophet. When he entered the town, he said, 'Allahu Akbar! Khaibar is ruined. Whenever we approach near a (hostile) nation (to fight) then evil will be the morning of those who have been warned.' He repeated this thrice. The people came out for their jobs and some of them said, 'Muhammad (has come).' (Some of our companions added, \"With his army.\") We conquered Khaibar, took the captives, and the booty was collected. Dihya came and said, 'O Allah's Prophet! Give me a slave girl from the captives.' The Prophet said, 'Go and take any slave girl.' He took Safiya bint Huyai. A man came to the Prophet and said, 'O Allah's Apostles! You gave Safiya bint Huyai to Dihya and she is the chief mistress of the tribes of Quraidha and An-Nadir and she befits none but you.' So the Prophet said, 'Bring him along with her.' So Dihya came with her and when the Prophet saw her, he said to Dihya, 'Take any slave girl other than her from the captives.' Anas added: The Prophet then manumitted her and married her.\" Thabit asked Anas, \"O Abu Hamza! What did the Prophet pay her (as Mahr)?\" He said, \"Her self was her Mahr for he manumitted her and then married her.\" Anas added, \"While on the way, Um Sulaim dressed her for marriage (ceremony) and at night she sent her as a bride to the Prophet . So the Prophet was a bridegroom and he said, 'Whoever has anything (food) should bring it.' He spread out a leather sheet (for the food) and some brought dates and others cooking butter. (I think he (Anas) mentioned As-Sawaq). So they prepared a dish of Hais (a kind of meal). And that was Walima (the marriage banquet) of Allah's Apostle .\"",
      "chain": [
        "20184",
        "20208",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "607",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا إسماعيل بن إبراهيم، حدثنا خالد، عن أبي قلابة، عن أنس، قال أمر بلال أن يشفع، الأذان، وأن يوتر الإقامة‏.‏ قال إسماعيل فذكرت لأيوب فقال إلا الإقامة‏.‏",
      "text_en": " Narrated Abu Qilaba:                     Anas said, \"Bilal was ordered to pronounce the wording of Adhan twice and of Iqama once only.\" The sub narrator Isma`il said, \"I mentioned that to Aiyub and he added (to that), \"Except Iqama (i.e. Qadqamat- is-salat which should be said twice).",
      "chain": [
        "30026",
        "20208",
        "11282",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "699",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسدد، قال حدثنا إسماعيل بن إبراهيم، عن أيوب، عن عبد الله بن سعيد بن جبير، عن أبيه، عن ابن عباس، قال بت عند خالتي فقام النبي صلى الله عليه وسلم يصلي من الليل، فقمت أصلي معه فقمت عن يساره، فأخذ برأسي فأقامني عن يمينه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Once I passed the night in the house of my aunt Maimuna. The Prophet stood for the night prayer and I joined him and stood on his left side but he drew me to his right by holding me by the head.",
      "chain": [
        "30175",
        "20208",
        "11015",
        "11635",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "702",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن يونس، قال حدثنا زهير، قال حدثنا إسماعيل، قال سمعت قيسا، قال أخبرني أبو مسعود، أن رجلا، قال والله يا رسول الله إني لأتأخر عن صلاة الغداة من أجل فلان مما يطيل بنا‏.‏ فما رأيت رسول الله صلى الله عليه وسلم في موعظة أشد غضبا منه يومئذ ثم قال ‏\"‏ إن منكم منفرين، فأيكم ما صلى بالناس فليتجوز، فإن فيهم الضعيف والكبير وذا الحاجة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Mas`ud:                     A man came and said, \"O Allah's Apostle! By Allah, I keep away from the morning prayer only because So and so prolongs the prayer when he leads us in it.\" The narrator said, \"I never saw Allah's Apostle more furious in giving advice than he was at that time. He then said, \"Some of you make people dislike good deeds (the prayer). So whoever among you leads the people in prayer should shorten it because among them are the weak, the old and the needy.\"",
      "chain": [
        "30184",
        "20321",
        "20208",
        "11046",
        "402"
      ]
    },
    {
      "hadith_no": "772",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسدد، قال حدثنا إسماعيل بن إبراهيم، قال أخبرنا ابن جريج، قال أخبرني عطاء، أنه سمع أبا هريرة  رضى الله عنه  يقول في كل صلاة يقرأ، فما أسمعنا رسول الله صلى الله عليه وسلم أسمعناكم، وما أخفى عنا أخفينا عنكم، وإن لم تزد على أم القرآن أجزأت، وإن زدت فهو خير‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Qur'an is recited in every prayer and in those prayers in which Allah's Apostle recited aloud for us, we recite aloud in the same prayers for you; and the prayers in which the Prophet recited quietly, we recite quietly. If you recite \"Al-Fatiha\" only it is sufficient but if you recite something else in addition, it is better.",
      "chain": [
        "30175",
        "20208",
        "11070",
        "11029",
        "13"
      ]
    },
    {
      "hadith_no": "774",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسدد، قال حدثنا إسماعيل، قال حدثنا أيوب، عن عكرمة، عن ابن عباس، قال قرأ النبي صلى الله عليه وسلم فيما أمر، وسكت فيما أمر ‏{‏وما كان ربك نسيا‏}‏ ‏{‏لقد كان لكم في رسول الله أسوة حسنة‏}‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet recited aloud in the prayers in which he was ordered to do so and quietly in the prayers in which he was ordered to do so. \"And your Lord is not forgetful.\" \"Verily there was a good example for you in the ways of the Prophet.\"",
      "chain": [
        "30175",
        "20208",
        "11015",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "901",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا مسدد، قال حدثنا إسماعيل، قال أخبرني عبد الحميد، صاحب الزيادي قال حدثنا عبد الله بن الحارث ابن عم، محمد بن سيرين قال ابن عباس لمؤذنه في يوم مطير إذا قلت أشهد أن محمدا رسول الله‏.‏ فلا تقل حى على الصلاة‏.‏ قل صلوا في بيوتكم‏.‏ فكأن الناس استنكروا، قال فعله من هو خير مني، إن الجمعة عزمة، وإني كرهت أن أخرجكم، فتمشون في الطين والدحض‏.‏",
      "text_en": " Narrated Muhammad bin Seereen:                     On a rainy day Ibn `Abbas said to his Mu'adh-dhin, \"After saying, 'Ash-hadu anna Muhammadan Rasulullah' (I testify that Muhammad is Allah's Apostle), do not say 'Haiya 'Alas-Salat' (come for the prayer) but say 'Pray in your houses'.\" (The man did so). But the people disliked it. Ibn `Abbas said, \"It was done by one who was much better than I (i.e. the Prophet (p.b.u.h) ). No doubt, the Jumua prayer is compulsory but I dislike to put you to task by bringing you out walking in mud and slush.\"",
      "chain": [
        "30175",
        "20208",
        "11703"
      ]
    },
    {
      "hadith_no": "954",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا مسدد، قال حدثنا إسماعيل، عن أيوب، عن محمد، عن أنس، قال قال النبي صلى الله عليه وسلم ‏\"‏ من ذبح قبل الصلاة فليعد ‏\"‏‏.‏ فقام رجل فقال هذا يوم يشتهى فيه اللحم‏.‏ وذكر من جيرانه فكأن النبي صلى الله عليه وسلم صدقه، قال وعندي جذعة أحب إلى من شاتى لحم، فرخص له النبي صلى الله عليه وسلم فلا أدري أبلغت الرخصة من سواه أم لا‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"Whoever slaughtered (his sacrifice) before the `Id prayer, should slaughter again.\" A man stood up and said, \"This is the day on which one has desire for meat,\" and he mentioned something about his neighbors. It seemed that the Prophet I believed him. Then the same man added, \"I have a young she-goat which is dearer to me than the meat of two sheep.\" The Prophet permitted him to slaughter it as a sacrifice. I do not know whether that permission was valid only for him or for others as well.",
      "chain": [
        "30175",
        "20208",
        "11015",
        "20278",
        "19"
      ]
    },
    {
      "hadith_no": "1004",
      "source": " Sahih Bukhari ",
      "chapter": "Witr Prayer - كتاب الوتر",
      "chapter_no": "14",
      "text_ar": "حدثنا مسدد، قال حدثنا إسماعيل، قال حدثنا خالد، عن أبي قلابة، عن أنس، قال كان القنوت في المغرب والفجر‏.‏",
      "text_en": " Narrated Anas:                     The Qunut used to be recited in the Maghrib and the Fajr prayers.",
      "chain": [
        "30175",
        "20208",
        "11282",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "1143",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا مؤمل بن هشام، قال حدثنا إسماعيل، قال حدثنا عوف، قال حدثنا أبو رجاء، قال حدثنا سمرة بن جندب  رضى الله عنه  عن النبي صلى الله عليه وسلم في الرؤيا قال ‏\"‏ أما الذي يثلغ رأسه بالحجر فإنه يأخذ القرآن فيرفضه وينام عن الصلاة المكتوبة ‏\"‏‏.‏",
      "text_en": " Narrated Samura bin Jundab:                     The Prophet said in his narration of a dream that he saw, \"He whose head was being crushed with a stone was one who learnt the Qur'an but never acted on it, and slept ignoring the compulsory prayers.\"",
      "chain": [
        "30180",
        "20208",
        "11298",
        "11440",
        "394"
      ]
    },
    {
      "hadith_no": "1191",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Prayer at Masjid Makkah and Madinah - كتاب فضل الصلاة فى مسجد مكة والمدينة",
      "chapter_no": "20",
      "text_ar": "حدثنا يعقوب بن إبراهيم  هو الدورقي  حدثنا ابن علية، أخبرنا أيوب، عن نافع، أن ابن عمر  رضى الله عنهما  كان لا يصلي من الضحى إلا في يومين يوم يقدم بمكة، فإنه كان يقدمها ضحى، فيطوف بالبيت، ثم يصلي ركعتين خلف المقام، ويوم يأتي مسجد قباء، فإنه كان يأتيه كل سبت، فإذا دخل المسجد كره أن يخرج منه حتى يصلي فيه‏.‏ قال وكان يحدث أن رسول الله صلى الله عليه وسلم كان يزوره راكبا وماشيا‏.‏ قال وكان يقول إنما أصنع كما رأيت أصحابي يصنعون، ولا أمنع أحدا أن يصلي في أى ساعة شاء من ليل أو نهار، غير أن لا تتحروا طلوع الشمس ولا غروبها‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar never offered the Duha prayer except on two occasions: (1) Whenever he reached Mecca; and he always used to reach Mecca in the forenoon. He would perform Tawaf round the Ka`ba and then offer two rak`at at the rear of Maqam Ibrahim. (2) Whenever he visited Quba, for he used to visit it every Saturday. When he entered the Mosque, he disliked to leave it without offering a prayer. Ibn `Umar narrated that Allah's Apostle used to visit the Mosque of Quba (sometime) walking and (sometime) riding. And he (i.e. Ibn `Umar) used to say, \"I do only what my companions used to do and I don't forbid anybody to pray at any time during the day or night except that one should not intend to pray at sunrise or sunset.\"",
      "chain": [
        "30400",
        "20208",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1255",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا إسماعيل بن إبراهيم، حدثنا خالد، عن حفصة بنت سيرين، عن أم عطية  رضى الله عنها  قالت قال رسول الله صلى الله عليه وسلم في غسل ابنته ‏\"‏ ابدأن بميامنها ومواضع الوضوء منها ‏\"‏‏.‏",
      "text_en": " Narrated Um 'Atiyya:                     Allah's Apostle , concerning his (dead) daughter's bath, said, \"Start with the right side, and the parts which are washed in ablution.\"",
      "chain": [
        "30026",
        "20208",
        "11282",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "1381",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا ابن علية، حدثنا عبد العزيز بن صهيب، عن أنس بن مالك  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من الناس مسلم يموت له ثلاثة من الولد لم يبلغوا الحنث إلا أدخله الله الجنة بفضل رحمته إياهم ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle (p.b.u.h) said, \"Any Muslim whose three children died before the age of puberty will be granted Paradise by Allah because of His mercy to them.\"",
      "chain": [
        "20184",
        "20208",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "1421",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا ابن نمير، قال حدثني أبي، حدثنا إسماعيل، عن قيس، قال قال جرير بن عبد الله بايعت النبي صلى الله عليه وسلم على إقام الصلاة، وإيتاء الزكاة، والنصح لكل مسلم‏.‏",
      "text_en": " Narrated Jarir bin `Abdullah:                     I gave the pledge of allegiance to the Prophet for offering prayer perfectly, giving Zakat, and giving good advice to every Muslim.",
      "chain": [
        "30212",
        "20331",
        "20208",
        "11046"
      ]
    },
    {
      "hadith_no": "1472",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا مؤمل، حدثنا إسماعيل، عن أيوب، عن عطاء بن أبي رباح، قال قال ابن عباس  رضى الله عنهما  أشهد على رسول الله صلى الله عليه وسلم لصلى قبل الخطبة، فرأى أنه لم يسمع النساء، فأتاهن ومعه بلال ناشر ثوبه فوعظهن، وأمرهن أن يتصدقن، فجعلت المرأة تلقي، وأشار أيوب إلى أذنه وإلى حلقه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I am a witness that Allah's Apostle offered the Id prayer before delivering the sermon and then he thought that the women would not be able to hear him (because of the distance), so he went to them along with Bilal who was spreading his garment. The Prophet advised and ordered them to give in charity. So the women started giving their ornaments (in charity). (The sub-narrator Aiyub pointed towards his ears and neck meaning that they gave ornaments from those places such as earrings and necklaces.)",
      "chain": [
        "30180",
        "20208",
        "11015",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "1501",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا إسماعيل ابن علية، حدثنا خالد الحذاء، عن ابن أشوع، عن الشعبي، حدثني كاتب المغيرة بن شعبة، قال كتب معاوية إلى المغيرة بن شعبة أن اكتب، إلى بشىء سمعته من النبي، صلى الله عليه وسلم‏.‏ فكتب إليه سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إن الله كره لكم ثلاثا قيل وقال، وإضاعة المال، وكثرة السؤال ‏\"‏‏.‏",
      "text_en": " Narrated Ash-Shu`bi:                     The clerk of Al-Mughira bin Shu`ba narrated, \"Muawiya wrote to Al-Mughira bin Shu`ba: Write to me something which you have heard from the Prophet (p.b.u.h) .\" So Al-Mughira wrote: I heard the Prophet saying, \"Allah has hated for you three things: -1. Vain talks, (useless talk) that you talk too much or about others. -2. Wasting of wealth (by extravagance) -3. And asking too many questions (in disputed religious matters) or asking others for something (except in great need). (See Hadith No. 591, Vol. Ill)",
      "chain": [
        "20184",
        "20208",
        "11282",
        "11052"
      ]
    },
    {
      "hadith_no": "1598",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثني يعقوب بن إبراهيم، حدثنا ابن علية، أخبرنا أيوب، عن نافع، قال كان ابن عمر  رضى الله عنهما  إذا دخل أدنى الحرم أمسك عن التلبية، ثم يبيت بذي طوى، ثم يصلي به الصبح ويغتسل، ويحدث أن نبي الله صلى الله عليه وسلم كان يفعل ذلك‏.‏",
      "text_en": " Narrated Nafi`:                     On reaching the sanctuary of Mecca, Ibn `Umar used to stop, reciting Talbiya and then he would pass the night at Dhi-Tuwa and then offer the Fajr prayer and take a bath. He used to say that the Prophet used to do the same.",
      "chain": [
        "20184",
        "20208",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1664",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا ابن علية، عن أيوب، عن نافع، أن ابن عمر  رضى الله عنهما  دخل ابنه عبد الله بن عبد الله، وظهره في الدار، فقال إني لا آمن أن يكون العام بين الناس قتال، فيصدوك عن البيت، فلو أقمت‏.‏ فقال قد خرج رسول الله صلى الله عليه وسلم فحال كفار قريش بينه وبين البيت، فإن حيل بيني وبينه أفعل كما فعل رسول الله صلى الله عليه وسلم ‏{‏لقد كان لكم في رسول الله أسوة حسنة‏}‏ ثم قال أشهدكم أني قد أوجبت مع عمرتي حجا‏.‏ قال ثم قدم فطاف لهما طوافا واحدا‏.‏",
      "text_en": " Narrated Nafi`:                     `Abdullah bin `Abdullah bin `Umar and his riding animal entered the house of Ibn `Umar. He (the son of Ibn `Umar) said, \"I fear that this year a battle might take place between the people and you might be prevented from going to the Ka`ba. I suggest that you should stay here.\" Ibn `Umar said, \"Once Allah's Apostle set out for the pilgrimage, and the pagans of Quraish intervened between him and the Ka`ba. So, if the people intervened between me and the Ka`ba, I would do the same as Allah's Apostle had done . . . \"Verily, in Allah's Apostle you have a good example.\" Then he added, \"I make you a witness that I have intended to perform Hajj along with `Umra.\" After arriving at Mecca, Ibn `Umar performed one Tawaf only (between Safa and Marwa).",
      "chain": [
        "20184",
        "20208",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1678",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا مؤمل بن هشام، حدثنا إسماعيل، عن أيوب، عن حفصة، قالت كنا نمنع عواتقنا أن يخرجن، فقدمت امرأة فنزلت قصر بني خلف، فحدثت أن أختها كانت تحت رجل من أصحاب رسول الله صلى الله عليه وسلم قد غزا مع رسول الله صلى الله عليه وسلم ثنتى عشرة غزوة، وكانت أختي معه في ست غزوات، قالت كنا نداوي الكلمى ونقوم على المرضى‏.‏ فسألت أختي رسول الله صلى الله عليه وسلم فقالت هل على إحدانا بأس إن لم يكن لها جلباب أن لا تخرج قال ‏\"‏ لتلبسها صاحبتها من جلبابها، ولتشهد الخير، ودعوة المؤمنين ‏\"‏‏.‏ فلما قدمت أم عطية  رضى الله عنها  سألنها  أو قالت سألناها  فقالت وكانت لا تذكر رسول الله صلى الله عليه وسلم إلا قالت بأبي‏.‏ فقلنا أسمعت رسول الله صلى الله عليه وسلم يقول كذا وكذا قالت نعم بأبي‏.‏ فقال ‏\"‏ لتخرج العواتق ذوات الخدور  أو العواتق وذوات الخدور  والحيض، فيشهدن الخير، ودعوة المسلمين، ويعتزل الحيض المصلى ‏\"‏‏.‏ فقلت الحائض‏.‏ فقالت أو ليس تشهد عرفة، وتشهد كذا وتشهد كذا",
      "text_en": " Narrated Hafsa:                     (On `Id) We used to forbid our virgins to go out (for `Id prayer). A lady came and stayed at the Palace of Bani Khalaf. She mentioned that her sister was married to one of the companions of Allah's Apostle who participated in twelve Ghazawats along with Allah's Apostle and her sister was with him in six of them. She said, \"We used to dress the wounded and look after the patients.\" She (her sister) asked Allah's Apostle , \"Is there any harm for a woman to stay at home if she doesn't have a veil?\" He said, \"She should cover herself with the veil of her companion and she should take part in the good deeds and in the religious gatherings of the believers.\" When Um 'Atiyya came, I asked her. \"Did you hear anything about that?\" Um 'Atiyya said, \"Bi Abi\" and she never mentioned the name of Allah's Apostle without saying \"Bi Abi\" (i.e. 'Let my father be sacrificed for you'). We asked her, \"Have you heard Allah's Apostle saying so and so (about women)?\" She replied in the affirmative and said, \"Let my father be sacrificed for him. He told us that unmarried mature virgins who stay often screened or unmarried young virgins and mature girls who stay often screened should come out and take part in the good deeds and in the religious gatherings of the believers. But the menstruating women should keep away from the Musalla (praying place).\" I asked her, \"The menstruating women?\" She replied, \"Don't they present themselves at `Arafat and at such and such places?\"",
      "chain": [
        "30180",
        "20208",
        "11015",
        "11039"
      ]
    },
    {
      "hadith_no": "1740",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا مسدد، حدثنا إسماعيل، عن أيوب، عن أبي قلابة، عن أنس بن مالك  رضى الله عنه  قال صلى النبي صلى الله عليه وسلم الظهر بالمدينة أربعا، والعصر بذي الحليفة ركعتين‏.‏ وعن أيوب عن رجل عن أنس  رضى الله عنه  ثم بات حتى أصبح، فصلى الصبح، ثم ركب راحلته حتى إذا استوت به البيداء أهل بعمرة وحجة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet (p.b.u.h) offered four rak`at of Zuhr prayer at Medina and two rak`at of `Asr prayer at Dhul-Hulaifa. Narrated Aiyub: \"A man said: Anas said, \"Then he (the Prophet passed the night there till dawn and then he offered the morning (Fajr) prayer, and mounted his Mount and when it arrived at Al-Baida' he assumed Ihram for both `Umra and Hajj.\"",
      "chain": [
        "30175",
        "20208",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "1831",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا قتيبة، حدثنا إسماعيل، عن حميد، عن أنس، قال جدرات‏.‏ تابعه الحارث بن عمير‏.‏",
      "text_en": " Narrated Anas:                     As above, but mentioned \"the walls of Medina\" instead of \"the high places of Medina. Al-Harith bin `Umar agrees with Anas.",
      "chain": [
        "30367",
        "20208",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "1892",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا مسدد، حدثنا إسماعيل، عن أيوب، عن نافع، عن ابن عمر  رضى الله عنهما  قال صام النبي صلى الله عليه وسلم عاشوراء، وأمر بصيامه‏.‏ فلما فرض رمضان ترك‏.‏ وكان عبد الله لا يصومه، إلا أن يوافق صومه‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet observed the fast on the 10th of Muharram ('Ashura), and ordered (Muslims) to fast on that day, but when the fasting of the month of Ramadan was prescribed, the fasting of the 'Ashura' was abandoned. `Abdullah did not use to fast on that day unless it coincided with his routine fasting by chance.",
      "chain": [
        "30175",
        "20208",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2175",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا صدقة بن الفضل، أخبرنا إسماعيل ابن علية، قال حدثني يحيى بن أبي إسحاق، حدثنا عبد الرحمن بن أبي بكرة، قال قال أبو بكرة  رضى الله عنه  قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تبيعوا الذهب بالذهب إلا سواء بسواء، والفضة بالفضة إلا سواء بسواء، وبيعوا الذهب بالفضة والفضة بالذهب كيف شئتم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     Allah's Apostle said, \"Don't sell gold for gold unless equal in weight, nor silver for silver unless equal in weight, but you could sell gold for silver or silver for gold as you like.\"",
      "chain": [
        "30343",
        "20208",
        "11314",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "2239",
      "source": " Sahih Bukhari ",
      "chapter": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam) - كتاب السلم",
      "chapter_no": "35",
      "text_ar": "حدثنا عمرو بن زرارة، أخبرنا إسماعيل ابن علية، أخبرنا ابن أبي نجيح، عن عبد الله بن كثير، عن أبي المنهال، عن ابن عباس  رضى الله عنهما  قال قدم رسول الله صلى الله عليه وسلم المدينة، والناس يسلفون في الثمر العام والعامين  أو قال عامين أو ثلاثة‏.‏ شك إسماعيل  فقال ‏\"‏ من سلف في تمر فليسلف في كيل معلوم، ووزن معلوم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle came to Medina and the people used to pay in advance the price of fruits to be delivered within one or two years. (The sub-narrator is in doubt whether it was one to two years or two to three years.) The Prophet said, \"Whoever pays money in advance for dates (to be delivered later) should pay it for known specified weight and measure (of the dates).",
      "chain": [
        "30365",
        "20208",
        "11254",
        "11252",
        "11290",
        "17"
      ]
    },
    {
      "hadith_no": "2239",
      "source": " Sahih Bukhari ",
      "chapter": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam) - كتاب السلم",
      "chapter_no": "35",
      "text_ar": "حدثنا محمد، أخبرنا إسماعيل، عن ابن أبي نجيح، بهذا ‏\"‏ في كيل معلوم ووزن معلوم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Abi Najih:                     as above, mentioning only specific measure.",
      "chain": [
        "30212",
        "20208",
        "11254"
      ]
    },
    {
      "hadith_no": "2265",
      "source": " Sahih Bukhari ",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا إسماعيل ابن علية، أخبرنا ابن جريج، قال أخبرني عطاء، عن صفوان بن يعلى، عن يعلى بن أمية  رضى الله عنه  قال غزوت مع النبي صلى الله عليه وسلم جيش العسرة فكان من أوثق أعمالي في نفسي، فكان لي أجير، فقاتل إنسانا، فعض أحدهما إصبع صاحبه، فانتزع إصبعه، فأندر ثنيته فسقطت، فانطلق إلى النبي صلى الله عليه وسلم فأهدر ثنيته وقال ‏\"‏ أفيدع إصبعه في فيك تقضمها  قال أحسبه قال  كما يقضم الفحل ‏\"‏‏.‏ قال ابن جريج وحدثني عبد الله بن أبي مليكة، عن جده، بمثل هذه الصفة أن رجلا، عض يد رجل، فأندر ثنيته، فأهدرها أبو بكر رضى الله عنه‏.‏",
      "text_en": " Narrated Ya`la bin Umaiya:                     I fought in Jaish-al-Usra (Ghazwa of Tabuk) along with the Prophet and in my opinion that was the best of my deeds. Then I had an employee, who quarrel led with someone and one of the them bit and cut the other's finger and caused his own tooth to fall out. He then went to the Prophet (with a complaint) but the Prophet canceled the suit and said to the complainant, \"Did you expect him to let his finger in your mouth so that you might snap and cut it (as does a stallion camel)?\" Narrated Ibn Juraij from `Abdullah bin Abu Mulaika from his grandfather a similar story: A man bit the hand of another man and caused his own tooth to fall out, but Abu Bakr judged that he had no right for compensation (for the broken tooth).",
      "chain": [
        "20184",
        "20208",
        "11070",
        "11029",
        "11248"
      ]
    },
    {
      "hadith_no": "2284",
      "source": " Sahih Bukhari ",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا مسدد، حدثنا عبد الوارث، وإسماعيل بن إبراهيم، عن علي بن الحكم، عن نافع، عن ابن عمر  رضى الله عنهما  قال نهى النبي صلى الله عليه وسلم عن عسب الفحل‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet forbade taking a price for animal copulation.",
      "chain": [
        "30175",
        "20258",
        "20208",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2397",
      "source": " Sahih Bukhari ",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، ح وحدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن عروة، أن عائشة  رضى الله عنها  أخبرته أن رسول الله صلى الله عليه وسلم كان يدعو في الصلاة ويقول ‏\"‏ اللهم إني أعوذ بك من المأثم والمغرم ‏\"‏‏.‏ فقال له قائل ما أكثر ما تستعيذ يا رسول الله من المغرم قال ‏\"‏ إن الرجل إذا غرم حدث فكذب ووعد فأخلف ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle used to invoke Allah in the prayer saying, \"O Allah, I seek refuge with you from all sins, and from being in debt.\" Someone said, O Allah's Apostle! (I see you) very often you seek refuge with Allah from being in debt. He replied, \"If a person is in debt, he tells lies when he speaks, and breaks his promises when he promises.\"",
      "chain": [
        "30330",
        "20428",
        "11013",
        "20208",
        "24131",
        "11005",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2741",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا عمرو بن زرارة، أخبرنا إسماعيل، عن ابن عون، عن إبراهيم، عن الأسود، قال ذكروا عند عائشة أن عليا  رضى الله عنهما  كان وصيا‏.‏ فقالت متى أوصى إليه وقد كنت مسندته إلى صدري  أو قالت حجري  فدعا بالطست، فلقد انخنث في حجري، فما شعرت أنه قد مات، فمتى أوصى إليه",
      "text_en": " Narrated Al-Aswad:                     In the presence of `Aisha some people mentioned that the Prophet had appointed `Ali by will as his successor. `Aisha said, \"When did he appoint him by will? Verily when he died he was resting against my chest (or said: in my lap) and he asked for a wash-basin and then collapsed while in that state, and I could not even perceive that he had died, so when did he appoint him by will?\"",
      "chain": [
        "30365",
        "20208",
        "11071",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2768",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا يعقوب بن إبراهيم بن كثير، حدثنا ابن علية، حدثنا عبد العزيز، عن أنس  رضى الله عنه  قال قدم رسول الله صلى الله عليه وسلم المدينة ليس له خادم، فأخذ أبو طلحة بيدي، فانطلق بي إلى رسول الله صلى الله عليه وسلم فقال يا رسول الله إن أنسا غلام كيس، فليخدمك‏.‏ قال فخدمته في السفر والحضر، ما قال لي لشىء صنعته لم صنعت هذا هكذا ولا لشىء لم أصنعه لم لم تصنع هذا هكذا",
      "text_en": " Narrated Anas:                     When Allah's Apostle came to Medina; he did not have any servant. Abu Talha (Anas' step-father) took me to Allah's Apostle and said, \"O Allah's Apostle! Anas is a wise boy, so let him serve you.\" So, I served him at home and on journeys. If I did anything, he never asked me why I did it, and if I refrained from doing anything, he never asked me why I refrained from doing it.",
      "chain": [
        "20184",
        "20208",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "2798",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا يوسف بن يعقوب الصفار، حدثنا إسماعيل ابن علية، عن أيوب، عن حميد بن هلال، عن أنس بن مالك  رضى الله عنه  قال خطب النبي صلى الله عليه وسلم فقال ‏\"‏ أخذ الراية زيد فأصيب، ثم أخذها جعفر فأصيب، ثم أخذها عبد الله بن رواحة فأصيب، ثم أخذها خالد بن الوليد عن غير إمرة ففتح له  وقال  ما يسرنا أنهم عندنا ‏\"‏‏.‏ قال أيوب أو قال ‏\"‏ ما يسرهم أنهم عندنا ‏\"‏‏.‏ وعيناه تذرفان‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet delivered a sermon and said, \"Zaid took the flag and was martyred, and then Ja`far took the flag and was martyred, and then `Abdullah bin Rawaha took the flag and was martyred too, and then Khalid bin Al-Walid took the flag though he was not appointed as a commander and Allah made him victorious.\" The Prophet further added, \"It would not please us to have them with us.\" Aiyub, a sub-narrator, added, \"Or the Prophet, shedding tears, said, 'It would not please them to be with us.'\"",
      "chain": [
        "30225",
        "20208",
        "11015",
        "11281",
        "19"
      ]
    },
    {
      "hadith_no": "2807",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري، حدثني إسماعيل، قال حدثني أخي، عن سليمان، أراه عن محمد بن أبي عتيق، عن ابن شهاب، عن خارجة بن زيد، أن زيد بن ثابت  رضى الله عنه  قال نسخت الصحف في المصاحف، ففقدت آية من سورة الأحزاب، كنت أسمع رسول الله صلى الله عليه وسلم يقرأ بها، فلم أجدها إلا مع خزيمة بن ثابت الأنصاري الذي جعل رسول الله صلى الله عليه وسلم شهادته شهادة رجلين، وهو قوله ‏{‏من المؤمنين رجال صدقوا ما عاهدوا الله عليه‏}‏",
      "text_en": " Narrated Kharija bin Zaid:                     Zaid bin Thabit said, \"When the Qur'an was compiled from various written manuscripts, one of the Verses of Surat Al-Ahzab was missing which I used to hear Allah's Apostle reciting. I could not find it except with Khuza`ima bin Thabjt Al-Ansari, whose witness Allah's Apostle regarded as equal to the witness of two men. And the Verse was:-- \"Among the believers are men who have been true to what they covenanted with Allah.\" (33.23)",
      "chain": [
        "30330",
        "20428",
        "11013",
        "20208",
        "24131",
        "11005",
        "11013",
        "49"
      ]
    },
    {
      "hadith_no": "3063",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا ابن علية، عن أيوب، عن حميد بن هلال، عن أنس بن مالك  رضى الله عنه  قال خطب رسول الله صلى الله عليه وسلم فقال ‏\"‏ أخذ الراية زيد فأصيب، ثم أخذها جعفر فأصيب، ثم أخذها عبد الله بن رواحة فأصيب، ثم أخذها خالد بن الوليد عن غير إمرة ففتح عليه، وما يسرني  أو قال ما يسرهم  أنهم عندنا ‏\"‏‏.‏ وقال وإن عينيه لتذرفان‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle delivered a sermon and said, \"Zaid received the flag and was martyred, then Ja`far took it and was martyred, then `Abdullah bin Rawaha took it and was martyred, and then Khalid bin Al-Walid took it without being appointed, and Allah gave him victory.\" The Prophet added, \"I am not pleased (or they will not be pleased) that they should remain (alive) with us,\" while his eyes were shedding tears.",
      "chain": [
        "20184",
        "20208",
        "11015",
        "11281",
        "19"
      ]
    },
    {
      "hadith_no": "3164",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا إسماعيل بن إبراهيم، قال أخبرني روح بن القاسم، عن محمد بن المنكدر، عن جابر بن عبد الله  رضى الله عنهما  قال كان رسول الله صلى الله عليه وسلم قال لي ‏\"‏ لو قد جاءنا مال البحرين قد أعطيتك هكذا وهكذا وهكذا ‏\"‏‏.‏ فلما قبض رسول الله صلى الله عليه وسلم وجاء مال البحرين قال أبو بكر من كانت له عند رسول الله صلى الله عليه وسلم عدة فليأتني‏.‏ فأتيته فقلت إن رسول الله صلى الله عليه وسلم قد كان قال لي ‏\"‏ لو قد جاءنا مال البحرين لأعطيتك هكذا وهكذا وهكذا ‏\"‏‏.‏ فقال لي احثه‏.‏ فحثوت حثية فقال لي عدها‏.‏ فعددتها فإذا هي خمسمائة، فأعطاني ألفا وخمسمائة‏.‏ وقال إبراهيم بن طهمان عن عبد العزيز بن صهيب، عن أنس، أتي النبي صلى الله عليه وسلم بمال من البحرين فقال ‏\"‏ انثروه في المسجد ‏\"‏ فكان أكثر مال أتي به رسول الله صلى الله عليه وسلم إذ جاءه العباس فقال يا رسول الله، أعطني إني فاديت نفسي وفاديت عقيلا‏.‏ قال ‏\"‏ خذ ‏\"‏‏.‏ فحثا في ثوبه، ثم ذهب يقله، فلم يستطع‏.‏ فقال أمر بعضهم يرفعه إلى‏.‏ قال ‏\"‏ لا ‏\"‏‏.‏ قال فارفعه أنت على‏.‏ قال ‏\"‏ لا ‏\"‏‏.‏ فنثر منه، ثم ذهب يقله فلم يرفعه‏.‏ فقال أمر بعضهم يرفعه على‏.‏ قال ‏\"‏ لا ‏\"‏‏.‏ قال فارفعه أنت على‏.‏ قال ‏\"‏ لا ‏\"‏‏.‏ فنثر ثم احتمله على كاهله ثم انطلق، فما زال يتبعه بصره حتى خفي علينا عجبا من حرصه، فما قام رسول الله صلى الله عليه وسلم وثم منها درهم‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Allah's Apostle once said to me, \"If the revenue of Bahrain came, I would give you this much and this much.\" When Allah's Apostle had died, the revenue of Bahrain came, and Abu Bakr announced, \" Let whoever was promised something by Allah's Apostle come to me.\" So, I went to Abu Bakr and said, \"Allah's Apostle said to me, 'If the revenue of Bahrain came, I would give you this much and this. much.\" On that Abu Bakr said to me, \"Scoop (money) with both your hands.\" I scooped money with both my hands and Abu Bakr asked me to count it. I counted it and it was five-hundred (gold pieces). The total amount he gave me was one thousand and five hundred (gold pieces.) Narrated Anas: Money from Bahrain was brought to the Prophet . He said, \"Spread it in the Mosque.\" It was the biggest amount that had ever been brought to Allah's Apostle . In the meantime Al-`Abbas came to him and said, \"O Allah's Apostle! Give me, for I gave the ransom of myself and `Aqil.\" The Prophet said (to him), \"Take.\" He scooped money with both hands and poured it in his garment and tried to lift it, but he could not and appealed to the Prophet, \"Will you order someone to help me in lifting it?\" The Prophet said, \"No.\" Then Al-`Abbas said, \"Then will you yourself help me carry it?\" The Prophet said, \"No.\" Then Al `Abbas threw away some of the money, but even then he was not able to lift it, and so he gain requested the Prophet \"Will you order someone to help me carry it?\" The Prophet said, \"No.\" Then Al-`Abbas said, \"Then will you yourself yelp me carry it?\" The Prophet said, 'No.\" So, Al-`Abbas threw away some more money and lifted it on his shoulder and went away. The Prophet kept on looking at him with astonishment at his greediness till he went out of our sight. Allah's Apostle did not get up from there till not a single Dirham remained from that money.",
      "chain": [
        "30026",
        "20208",
        "11586",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "3195",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا علي بن عبد الله، أخبرنا ابن علية، عن علي بن المبارك، حدثنا يحيى بن أبي كثير، عن محمد بن إبراهيم بن الحارث، عن أبي سلمة بن عبد الرحمن، كانت بينه وبين أناس خصومة في أرض، فدخل على عائشة فذكر لها ذلك، فقالت يا أبا سلمة اجتنب الأرض، فإن رسول الله صلى الله عليه وسلم قال ‏\"‏ من ظلم قيد شبر طوقه من سبع أرضين ‏\"‏‏.‏",
      "text_en": " Narrated Muhammad bin Ibrahim bin Al-Harith:                     from Abu Salama bin `Abdur-Rahman who had a dispute with some people on a piece of land, and so he went to `Aisha and told her about it. She said, \"O Abu Salama, avoid the land, for Allah's Apostle said, 'Any person who takes even a span of land unjustly, his neck shall be encircled with it down seven earths.' \"",
      "chain": [
        "30026",
        "20208",
        "20449",
        "11449",
        "11213"
      ]
    },
    {
      "hadith_no": "3354",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا مؤمل، حدثنا إسماعيل، حدثنا عوف، حدثنا أبو رجاء، حدثنا سمرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أتاني الليلة آتيان، فأتينا على رجل طويل، لا أكاد أرى رأسه طولا، وإنه إبراهيم صلى الله عليه وسلم ‏\"‏‏.‏",
      "text_en": " Narrated Samura:                     Allah's Apostle said, \"Two persons came to me at night (in dream) (and took me along with them). We passed by a tall man who was so tall that I was not able to see his head and that person was Abraham.\"",
      "chain": [
        "30180",
        "20208",
        "11298",
        "11440",
        "394"
      ]
    },
    {
      "hadith_no": "3583",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زهير، حدثنا إسماعيل، عن أبي جحيفة  رضى الله عنه  قال رأيت النبي صلى الله عليه وسلم وكان الحسن يشبهه‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     I saw the Prophet, and Al-Hasan resembled him.",
      "chain": [
        "30184",
        "20321",
        "20208",
        "4047"
      ]
    },
    {
      "hadith_no": "3737",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا الصلت بن محمد، حدثنا إسماعيل بن إبراهيم، حدثنا أيوب، عن ابن أبي مليكة، عن المسور بن مخرمة، قال لما طعن عمر جعل يألم، فقال له ابن عباس  وكأنه يجزعه  يا أمير المؤمنين، ولئن كان ذاك لقد صحبت رسول الله صلى الله عليه وسلم فأحسنت صحبته، ثم فارقته وهو عنك راض، ثم صحبت أبا بكر فأحسنت صحبته، ثم فارقته وهو عنك راض، ثم صحبت صحبتهم فأحسنت صحبتهم، ولئن فارقتهم لتفارقنهم وهم عنك راضون‏.‏ قال أما ما ذكرت من صحبة رسول الله صلى الله عليه وسلم ورضاه، فإنما ذاك من من الله تعالى من به على، وأما ما ذكرت من صحبة أبي بكر ورضاه، فإنما ذاك من من الله جل ذكره من به على، وأما ما ترى من جزعي، فهو من أجلك وأجل أصحابك، والله لو أن لي طلاع الأرض ذهبا لافتديت به من عذاب الله عز وجل قبل أن أراه‏.‏ قال حماد بن زيد حدثنا أيوب، عن ابن أبي مليكة، عن ابن عباس، دخلت على عمر بهذا‏.‏",
      "text_en": " Narrated Al-Miswar bin Makhrama:                     When `Umar was stabbed, he showed signs of agony. Ibn `Abbas, as if intending to encourage `Umar, said to him, \"O Chief of the believers! Never mind what has happened to you, for you have been in the company of Allah's Apostle and you kept good relations with him and you parted with him while he was pleased with you. Then you were in the company of Abu Bakr and kept good relations with him and you parted with him (i.e. he died) while he was pleased with you. Then you were in the company of the Muslims, and you kept good relations with them, and if you leave them, you will leave them while they are pleased with you.\" `Umar said, (to Ibn \"Abbas), \"As for what you have said about the company of Allah's Apostle and his being pleased with me, it is a favor, Allah did to me; and as for what you have said about the company of Abu Bakr and his being pleased with me, it is a favor Allah did to me; and concerning my impatience which you see, is because of you and your companions. By Allah! If (at all) I had gold equal to the earth, I would have ransomed myself with it from the Punishment of Allah before I meet Him.\"",
      "chain": [
        "30140",
        "20208",
        "11015",
        "11090",
        "2201"
      ]
    },
    {
      "hadith_no": "3900",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا بيان، وإسماعيل، قالا سمعنا قيسا، يقول سمعت خبابا، يقول أتيت النبي صلى الله عليه وسلم وهو متوسد بردة، وهو في ظل الكعبة، وقد لقينا من المشركين شدة فقلت ألا تدعو الله فقعد وهو محمر وجهه فقال ‏\"‏ لقد كان من قبلكم ليمشط بمشاط الحديد ما دون عظامه من لحم أو عصب ما يصرفه ذلك عن دينه، ويوضع المنشار على مفرق رأسه، فيشق باثنين، ما يصرفه ذلك عن دينه، وليتمن الله هذا الأمر حتى يسير الراكب من صنعاء إلى حضرموت ما يخاف إلا الله ‏\"‏‏.‏ زاد بيان والذئب على غنمه‏.‏",
      "text_en": " Narrated Khabbaba:                     I came to the Prophet while he was leaning against his sheet cloak in the shade of the Ka`ba. We were suffering greatly from the pagans in those days. i said (to him). \"Will you invoke Allah (to help us)?\" He sat down with a red face and said, \"(A believer among) those who were before you used to be combed with iron combs so that nothing of his flesh or nerves would remain on his bones; yet that would never make him desert his religion. A saw might be put over the parting of his head which would be split into two parts, yet all that would never make him abandon his religion. Allah will surely complete this religion (i.e. Islam) so that a traveler from Sana to Hadra-maut will not be afraid of anybody except Allah.\" (The sub-narrator, Baiyan added, \"Or the wolf, lest it should harm his sheep.\")",
      "chain": [
        "30418",
        "20005",
        "11326",
        "20208",
        "149"
      ]
    },
    {
      "hadith_no": "3964",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني محمد بن صباح  أو بلغني عنه  حدثنا إسماعيل، عن عاصم، عن أبي عثمان، قال سمعت ابن عمر  رضى الله عنهما  إذا قيل له هاجر قبل أبيه يغضب، قال وقدمت أنا وعمر على رسول الله صلى الله عليه وسلم فوجدناه قائلا فرجعنا إلى المنزل، فأرسلني عمر وقال اذهب فانظر هل استيقظ فأتيته، فدخلت عليه فبايعته، ثم انطلقت إلى عمر، فأخبرته أنه قد استيقظ، فانطلقنا إليه نهرول هرولة حتى دخل عليه فبايعه ثم بايعته‏.‏",
      "text_en": " Narrated Abu `Uthman:                     I heard that Ibn `Umar used to become angry if someone mentioned that he had migrated before his father (`Umar), and he used to say, \" `Umar and I came to Allah's Apostle and found him having his midday rest, so we returned home. Then `Umar sent me again (to the Prophet ) and said, 'Go and see whether he is awake.' I went to him and entered his place and gave him the pledge of allegiance. Then I went back to `Umar and informed him that the Prophet was awake. So we both went, running slowly, and when `Umar entered his place, he gave him the pledge of allegiance and thereafter I too gave him the pledge of allegiance.\"",
      "chain": [
        "30269",
        "20208",
        "11080",
        "11113",
        "18"
      ]
    },
    {
      "hadith_no": "4069",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني يعقوب بن إبراهيم، حدثنا ابن علية، حدثنا سليمان التيمي، حدثنا أنس  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم يوم بدر ‏\"‏ من ينظر ما صنع أبو جهل ‏\"‏‏.‏ فانطلق ابن مسعود، فوجده قد ضربه ابنا عفراء حتى برد، فقال آنت أبا جهل قال ابن علية قال سليمان هكذا قالها أنس‏.‏ قال أنت أبا جهل قال وهل فوق رجل قتلتموه قال سليمان أو قال قتله قومه‏.‏ قال وقال أبو مجلز قال أبو جهل فلو غير أكار قتلني‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle said on the day of Badr, \"Who will go and see what has happened to Abu Jahl?\" Ibn Mas`ud went and saw him struck by the two sons of 'Afra and was on the point of death . Ibn Mas`ud said, \"Are you Abu Jahl?\" Abu Jahl replied, \"Can there be a man more superior to the one whom you have killed (or as Sulaiman said, or his own folk have killed.)?\" Abu Jahl added, \"Would that I had been killed by other than a mere farmer. \"",
      "chain": [
        "20184",
        "20208",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "4373",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا إسماعيل، حدثنا ابن جريج، قال أخبرني عطاء، أن صفوان بن يعلى بن أمية، أخبر أن يعلى كان يقول ليتني أرى رسول الله صلى الله عليه وسلم حين ينزل عليه‏.‏ قال فبينا النبي صلى الله عليه وسلم بالجعرانة وعليه ثوب قد أظل به، معه فيه ناس من أصحابه، إذ جاءه أعرابي عليه جبة متضمخ بطيب فقال يا رسول الله كيف ترى في رجل أحرم بعمرة في جبة بعد ما تضمخ بالطيب فأشار عمر إلى يعلى بيده أن تعال‏.‏ فجاء يعلى فأدخل رأسه، فإذا النبي صلى الله عليه وسلم محمر الوجه، يغط كذلك ساعة، ثم سري عنه فقال ‏\"‏ أين الذي يسألني عن العمرة آنفا ‏\"‏‏.‏ فالتمس الرجل فأتي به فقال ‏\"‏ أما الطيب الذي بك فاغسله ثلاث مرات، وأما الجبة فانزعها، ثم اصنع في عمرتك كما تصنع في حجك ‏\"‏‏.‏",
      "text_en": " Narrated Safwan bin Ya`la bin Umaiya:                     Ya`la used to say, \"I wish I could see Allah's Apostle at the time when he is being inspired divinely.\" Ya`la added \"While the Prophet was at Al-Ja'rana, shaded with a cloth sheet (in the form of a tent) and there were staying with him, some of his companions under it, suddenly there came to him a bedouin wearing a cloak and perfumed extravagantly. He said, \"O Allah's Apostle ! What is your opinion regarding a man who assumes the state of Ihram for `Umra wearing a cloak after applying perfume to his body?\" `Umar signalled with his hand to Ya`la to come (near). Ya`la came and put his head (underneath that cloth sheet) and saw the Prophet red-faced and when that state (of the Prophet ) was over, he said, \"Where is he who as already asked me about the `Umra?\" The man was looked for and brought to the Prophet The Prophet said (to him), \"As for the perfume you have applied to your body, wash it off your body) thrice, and take off your cloak, and then do in your `Umra the rites you do in your Hajj.\"",
      "chain": [
        "20184",
        "20208",
        "11070",
        "11029",
        "11248",
        "20372"
      ]
    },
    {
      "hadith_no": "4660",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا ابن علية، حدثنا عبد العزيز بن صهيب، قال قال أنس بن مالك  رضى الله عنه  ما كان لنا خمر غير فضيخكم هذا الذي تسمونه الفضيخ‏.‏ فإني لقائم أسقي أبا طلحة وفلانا وفلانا إذ جاء رجل فقال وهل بلغكم الخبر فقالوا وما ذاك قال حرمت الخمر‏.‏ قالوا أهرق هذه القلال يا أنس‏.‏ قال فما سألوا عنها ولا راجعوها بعد خبر الرجل‏.‏",
      "text_en": " Narrated Anas bin Malik:                     We had no alcoholic drink except that which was produced from dates and which you call Fadikh. While I was standing offering drinks to Abu Talh and so-and-so and so-and-so, a man cam and said, \"Has the news reached you? They said, \"What is that?\" He said. \"Alcoholic drinks have been prohibited. They said, \"Spill (the contents of these pots, O Anas! \"Then they neither asked about it (alcoholic drinks) nor returned it after the news from that man.",
      "chain": [
        "20184",
        "20208",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "4720",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا مؤمل  هو ابن هشام  حدثنا إسماعيل بن إبراهيم، وحدثنا عوف، حدثنا أبو رجاء، حدثنا سمرة بن جندب  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم لنا ‏\"‏ أتاني الليلة آتيان فابتعثاني، فانتهينا إلى مدينة مبنية بلبن ذهب ولبن فضة، فتلقانا رجال شطر من خلقهم كأحسن ما أنت راء، وشطر كأقبح ما أنت راء قالا لهم اذهبوا فقعوا في ذلك النهر‏.‏ فوقعوا فيه ثم رجعوا إلينا قد ذهب ذلك السوء عنهم، فصاروا في أحسن صورة قالا لي هذه جنة عدن، وهذاك منزلك قالا أما القوم الذين كانوا شطر منهم حسن وشطر منهم قبيح فإنهم خلطوا عملا صالحا وآخر سيئا تجاوز الله عنهم ‏\"‏‏.‏",
      "text_en": " Narrated Samura bin Jundab:                     Allah's Apostle said, \"Tonight two (visitors) came to me (in my dream) and took me to a town built with gold bricks and silver bricks. There we met men who, half of their bodies, look like the mosthandsome human beings you have ever seen, and the other half, the ugliest human beings you have ever seen. Those two visitors said to those men, 'Go and dip yourselves in that river. So they dipped themselves therein and then came to us, their ugliness having disappeared and they were in the mosthandsome shape. The visitors said, 'The first is the Garden of Eden and that is your dwelling place.' Then they added, 'As for those people who were half ugly and half handsome, they were those who mixed good deeds and bad deeds, but Allah forgave them.\"",
      "chain": [
        "30180",
        "20208",
        "11298",
        "11440",
        "394"
      ]
    }
  ],
  "total_hadiths": 635
}