{
  "id": "20201",
  "name": "Marwan bin Mua'wiya al-Fazari مروان بن معاوية الفزاري",
  "full_name": "Marwan bin Mua'wiya al-Fazari مروان بن معاوية الفزاري",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "112",
      "date_gregorian": "NA",
      "date_display": [
        "112 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "193",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa",
      "Makkah",
      " Damascus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة حافظ ]"
    ],
    "tags": [
      "al-Fazari",
      "al-Kufi",
      "Makkah",
      "Hafiz"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11555",
      "name": "Ayman bin Nabil أيمن بن نابل الحبشي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "28270",
      "name": "'Aabad bin Musa al-Jhny عباد بن موسى الجهني",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11227",
      "name": "Hashim bin Hashim bin 'Utba هاشم بن هاشم بن عتبة بن أبي وقاص",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10766",
      "name": "Sa'd bin Tariq, Abu Malik سعد بن طارق بن أشيم أبو مالك الأشجعي",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "10845",
      "name": "Yazid bin Kysan al-Yshkry يزيد بن كيسان اليشكري أبو إسماعيل",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11365",
      "name": "'Abdur Rahman bin 'Ubaid bin Nastas عبد الرحمن بن عبيد بن نسطاس",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10946",
      "name": "'Ubaidullah bin 'Abdullah bin al-Asm عبيد الله بن عبد الله بن الأصم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19476",
      "name": "al-Rbab Jd'h 'Uthman bin الرباب جدة عثمان",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11899",
      "name": "'Umar bin Hamza bin 'Abdullah عمر بن حمزة بن عبد الله بن عمر",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10969",
      "name": "Mnswr bin Hyan منصور بن حيان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "15594",
      "name": "Hilal bin Maymun al-Jhny هلال بن ميمون الجهني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "15592",
      "name": "Hilal bin 'Amir bin 'Amr هلال بن عامر بن عمرو المزني الكوفي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11387",
      "name": "Muhammad bin Suqah محمد بن سوقة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11298",
      "name": "'Awf bin Abi Jamila al-A'rabi عوف بن أبي جميلة الأعرابي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11560",
      "name": "Abd al-Wahd bin Aymn عبد الواحد بن أيمن المخزومي مولاهم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19901",
      "name": "Bahz bin Hakim bin Mu'awiya al-Qushayri بهز بن حكيم بن معاوية",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11629",
      "name": "Sa'id bin 'Ubaid al-Tai'i سعيد بن عبيد الطائي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20658",
      "name": "'Abdullah bin 'Abdur Rahman bin Ya'la عبد الله بن عبد الرحمن بن يعلى",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "22119",
      "name": "'Abdur Rahman bin Abi Shumayla عبد الرحمن بن أبي شميلة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20358",
      "name": "Malik bin Mghwl مالك بن مغول",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30464",
      "name": "Zakaria bin 'Ady bin Zarayn زكريا بن عدي بن زريق",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30418",
      "name": "'Abdullah bin al-Zubair bin 'Isa عبد الله بن الزبير بن عيسى الحميدي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30248",
      "name": "Da'ud bin Rshyd داود بن رشيد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30351",
      "name": "'Abdullah bin Muhammad al-Musandi عبد الله بن محمد المسندي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30376",
      "name": "Muhammad bin Salam al-Baykandi محمد بن سلام البيكندي الكبير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30263",
      "name": "'Amr bin Muhammad bin Bukayr عمرو بن محمد بن بكير الناقد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30212",
      "name": "Muhammad bin 'Abdullah bin Numayr محمد بن عبد الله بن نمير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36649",
      "name": "Muhammad bin 'Isa bin al-Tibaa' محمد بن عيسى بن الطباع",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30242",
      "name": "Ahmed bin Manay' أحمد بن منيع",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30285",
      "name": "'Abdur Rahman bin Ibrahim عبد الرحمن بن إبراهيم - دحيم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30251",
      "name": "Sryj bin Yonus bin Ibrahim سريج بن يونس بن إبراهيم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30465",
      "name": "Sa'id bin 'Amr bin Sahl al-Kundi سعيد بن عمرو بن سهل الكندي الأشعثي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30116",
      "name": "Sa'id bin Mnswr bin Sh'bh سعيد بن منصور بن شعبة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30547",
      "name": "Swyd bin Sa'id سويد بن سعيد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30117",
      "name": "Muhammad bin 'Aabad bin al-Zabrqan محمد بن عباد بن الزبرقان المكي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30216",
      "name": "Abu Karayb, Muhammad bin al-'Ala' محمد بن العلاء - أبو كريب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30526",
      "name": "Yahya bin Ayoub al-Maqabri يحيى بن أيوب المقابري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30400",
      "name": "Y'aqub bin Ibrahim bin Kathir يعقوب بن إبراهيم بن كثير بن زيد الدورقي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "554",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا الحميدي، قال حدثنا مروان بن معاوية، قال حدثنا إسماعيل، عن قيس، عن جرير، قال كنا عند النبي صلى الله عليه وسلم فنظر إلى القمر ليلة  يعني البدر  فقال ‏\"‏ إنكم سترون ربكم كما ترون هذا القمر لا تضامون في رؤيته، فإن استطعتم أن لا تغلبوا على صلاة قبل طلوع الشمس وقبل غروبها فافعلوا ‏\"‏‏.‏ ثم قرأ ‏{‏وسبح بحمد ربك قبل طلوع الشمس وقبل الغروب‏}‏‏.‏ قال إسماعيل افعلوا لا تفوتنكم‏.‏",
      "text_en": " Narrated Qais:                     Jarir said, \"We were with the Prophet and he looked at the moon--full-moon--and said, 'Certainly you will see your Lord as you see this moon and you will have no trouble in seeing Him. So if you can avoid missing (through sleep or business, etc.) a prayer before the sunrise (Fajr) and a prayer before sunset (`Asr), you must do so.' He then recited Allah's Statement: And celebrate the praises Of your Lord before the rising of the sun and before (its) setting.\" (50.39) Isma`il said, \"Offer those prayers and do not miss them.\"",
      "chain": [
        "30418",
        "20201",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "hadith_no": "1719",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن محمد، أخبرنا عبد الله، أخبرنا معمر، عن الزهري، عن عروة بن الزبير، عن المسور بن مخرمة، ومروان، قالا خرج النبي صلى الله عليه وسلم من المدينة زمن الحديبية في بضع عشرة مائة من أصحابه، حتى إذا كانوا بذي الحليفة قلد النبي صلى الله عليه وسلم الهدى وأشعر وأحرم بالعمرة‏.‏",
      "text_en": " Narrated Al-Miswar bin Makhrama and Marwan:                     The Prophet set out from Medina with over one thousand of his companions (at the time of the Treaty of Hudaibiya) and when they reached Dhul-Hulaifa, the Prophet garlanded his Hadi and marked it and assumed Ihram for `Umra.",
      "chain": [
        "30304",
        "20025",
        "20115",
        "11013",
        "10511",
        "2201",
        "20201"
      ]
    },
    {
      "hadith_no": "2539",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا ابن أبي مريم، قال أخبرني الليث، عن عقيل، عن ابن شهاب، ذكر عروة أن مروان، والمسور بن مخرمة، أخبراه أن النبي صلى الله عليه وسلم قام حين جاءه وفد هوازن، فسألوه أن يرد إليهم أموالهم وسبيهم فقال ‏\"‏ إن معي من ترون، وأحب الحديث إلى أصدقه، فاختاروا إحدى الطائفتين إما المال، وإما السبى، وقد كنت استأنيت بهم ‏\"‏‏.‏ وكان النبي صلى الله عليه وسلم انتظرهم بضع عشرة ليلة حين قفل من الطائف، فلما تبين لهم أن النبي صلى الله عليه وسلم غير راد إليهم إلا إحدى الطائفتين قالوا فإنا نختار سبينا‏.‏ فقام النبي صلى الله عليه وسلم في الناس، فأثنى على الله بما هو أهله، ثم قال ‏\"‏ أما بعد فإن إخوانكم جاءونا تائبين، وإني رأيت أن أرد إليهم سبيهم، فمن أحب منكم أن يطيب ذلك فليفعل، ومن أحب أن يكون على حظه حتى نعطيه إياه من أول ما يفيء الله علينا فليفعل ‏\"‏‏.‏ فقال الناس طيبنا ذلك‏.‏ قال ‏\"‏ إنا لا ندري من أذن منكم ممن لم يأذن فارجعوا حتى يرفع إلينا عرفاؤكم أمركم ‏\"‏‏.‏ فرجع الناس، فكلمهم عرفاؤهم، ثم رجعوا إلى النبي صلى الله عليه وسلم فأخبروه أنهم طيبوا وأذنوا، فهذا الذي بلغنا عن سبى هوازن‏.‏ وقال أنس قال عباس للنبي صلى الله عليه وسلم فاديت نفسي، وفاديت عقيلا‏.‏",
      "text_en": " Narrated Marwan and Al-Miswar bin Makhrama:                     When the delegates of the tribe of Hawazin came to the Prophet and they requested him to return their properties and captives. The Prophet stood up and said to them, \"I have other people with me in this matter (as you see) and the most beloved statement to me is the true one; you may choose either the properties or the prisoners as I have delayed their distribution.\" The Prophet had waited for them for more than ten days since his arrival from Ta'if. So, when it became evident to them that the Prophet was not going to return them except one of the two, they said, \"We choose our prisoners.\" The Prophet got up amongst the people and glorified and praised Allah as He deserved and said, \"Then after, these brethren of yours have come to us with repentance, and I see it logical to return them the captives. So, whoever amongst you likes to do that as a favor, then he can do it, and whoever of you likes to stick to his share till we recompense him from the very first war booty which Allah will give us, then he can do so (i.e. give up the present captives).\" The people unanimously said, \"We do that (return the captives) willingly.\" The Prophet said, \"We do not know which of you has agreed to it and which have not, so go back and let your leaders forward us your decision.\" So, all the people then went back and discussed the matter with their leaders who returned and informed the Prophet that all the people had willingly given their consent to return the captives. This is what has reached us about the captives of Hawazin. Narrated Anas that `Abbas said to the Prophet, \"I paid for my ransom and `Aqil's ransom.\"",
      "chain": [
        "30232",
        "20023",
        "11207",
        "11013",
        "10511",
        "20201",
        "2201"
      ]
    },
    {
      "hadith_no": "2711",
      "source": " Sahih Bukhari ",
      "chapter": "Conditions - كتاب الشروط",
      "chapter_no": "54",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، قال أخبرني عروة بن الزبير، أنه سمع مروان، والمسور بن مخرمة، رضى الله عنهما يخبران عن أصحاب، رسول الله صلى الله عليه وسلم قال لما كاتب سهيل بن عمرو يومئذ كان فيما اشترط سهيل بن عمرو على النبي صلى الله عليه وسلم أنه لا يأتيك منا أحد وإن كان على دينك إلا رددته إلينا، وخليت بيننا وبينه‏.‏ فكره المؤمنون ذلك، وامتعضوا منه، وأبى سهيل إلا ذلك، فكاتبه النبي صلى الله عليه وسلم على ذلك، فرد يومئذ أبا جندل على أبيه سهيل بن عمرو، ولم يأته أحد من الرجال إلا رده في تلك المدة، وإن كان مسلما، وجاء المؤمنات مهاجرات، وكانت أم كلثوم بنت عقبة بن أبي معيط ممن خرج إلى رسول الله صلى الله عليه وسلم يومئذ وهى عاتق، فجاء أهلها يسألون النبي صلى الله عليه وسلم أن يرجعها إليهم، فلم يرجعها إليهم لما أنزل الله فيهن ‏{‏إذا جاءكم المؤمنات مهاجرات فامتحنوهن الله أعلم بإيمانهن‏}‏ إلى قوله ‏{‏ولا هم يحلون لهن‏}‏‏.‏",
      "text_en": " Narrated Marwan and al-Miswar bin Makhrama:                     (from the companions of Allah's Apostle) When Suhail bin `Amr agreed to the Treaty (of Hudaibiya), one of the things he stipulated then, was that the Prophet should return to them (i.e. the pagans) anyone coming to him from their side, even if he was a Muslim; and would not interfere between them and that person. The Muslims did not like this condition and got disgusted with it. Suhail did not agree except with that condition. So, the Prophet agreed to that condition and returned Abu Jandal to his father Suhail bin `Amr. Thenceforward the Prophet returned everyone in that period (of truce) even if he was a Muslim. During that period some believing women emigrants including Um Kulthum bint `Uqba bin Abu Muait who came to Allah's Apostle and she was a young lady then. Her relative came to the Prophet and asked him to return her, but the Prophet did not return her to them for Allah had revealed the following Verse regarding women: \"O you who believe! When the believing women come to you as emigrants. Examine them, Allah knows best as to their belief, then if you know them for true believers, Send them not back to the unbelievers, (for) they are not lawful (wives) for the disbelievers, Nor are the unbelievers lawful (husbands) for them (60.10)",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "10511",
        "20201",
        "2201"
      ]
    },
    {
      "hadith_no": "2744",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا محمد بن عبد الرحيم، حدثنا زكرياء بن عدي، حدثنا مروان، عن هاشم بن هاشم، عن عامر بن سعد، عن أبيه  رضى الله عنه  قال مرضت فعادني النبي صلى الله عليه وسلم فقلت يا رسول الله ادع الله أن لا يردني على عقبي‏.‏ قال ‏\"‏ لعل الله يرفعك وينفع بك ناسا ‏\"‏‏.‏ قلت أريد أن أوصي، وإنما لي ابنة  قلت  أوصي بالنصف قال ‏\"‏ النصف كثير ‏\"‏‏.‏ قلت فالثلث‏.‏ قال ‏\"‏ الثلث، والثلث كثير أو كبير ‏\"‏‏.‏ قال فأوصى الناس بالثلث، وجاز ذلك لهم‏.‏",
      "text_en": " Narrated Sa`d:                     I fell sick and the Prophet paid me a visit. I said to him, \"O Allah's Apostle! I invoke Allah that He may not let me expire in the land whence I migrated (i.e. Mecca).\" He said, \"May Allah give you health and let the people benefit by you.\" I said, \"I want to will my property, and I have only one daughter and I want to will half of my property (to be given in charity).\" He said,\" Half is too much.\" I said, \"Then I will one third.\" He said, \"One-third, yet even one-third is too much.\" (The narrator added, \"So the people started to will one third of their property and that was Permitted for them.\")",
      "chain": [
        "30272",
        "30464",
        "20201",
        "11227",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "4105",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا مروان بن معاوية، حدثنا هاشم بن هاشم السعدي، قال سمعت سعيد بن المسيب، يقول سمعت سعد بن أبي وقاص، يقول نثل لي النبي صلى الله عليه وسلم كنانته يوم أحد فقال ‏\"‏ ارم فداك أبي وأمي ‏\"‏‏.‏",
      "text_en": " Narrated Sa`d bin Abi Waqqas:                     The Prophet took out a quiver (of arrows) for me on the day of Uhud and said, \"Throw (arrows); let my father and mother be sacrificed for you.\"",
      "chain": [
        "30351",
        "20201",
        "11227",
        "11002",
        "9"
      ]
    },
    {
      "hadith_no": "4210",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا سفيان، عن الزهري، عن عروة، عن مروان، والمسور بن مخرمة، قالا خرج النبي صلى الله عليه وسلم عام الحديبية في بضع عشرة مائة من أصحابه، فلما كان بذي الحليفة قلد الهدى وأشعر وأحرم منها‏.‏ لا أحصي كم سمعته من سفيان حتى سمعته يقول لا أحفظ من الزهري الإشعار والتقليد، فلا أدري  يعني  موضع الإشعار والتقليد، أو الحديث كله‏.‏",
      "text_en": " Narrated Marwan and Al-Miswar bin Makhrama:                     The Prophet went out in the company of 1300 to 1500 of his companions in the year of Al-Hudaibiya, and when they reached Dhul-Hulaifa, he garlanded and marked his Hadi and assumed the state of Ihram.",
      "chain": [
        "30026",
        "20005",
        "11013",
        "10511",
        "20201",
        "2201"
      ]
    },
    {
      "hadith_no": "4610",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إبراهيم بن موسى، أخبرنا هشام، أن ابن جريج، أخبرهم عن ابن أبي مليكة، أن علقمة بن وقاص، أخبره أن مروان قال لبوابه اذهب يا رافع إلى ابن عباس فقل لئن كان كل امرئ فرح بما أوتي، وأحب أن يحمد بما لم يفعل، معذبا، لنعذبن أجمعون‏.‏ فقال ابن عباس وما لكم ولهذه إنما دعا النبي صلى الله عليه وسلم يهود فسألهم عن شىء، فكتموه إياه، وأخبروه بغيره، فأروه أن قد استحمدوا إليه بما أخبروه عنه فيما سألهم، وفرحوا بما أوتوا من كتمانهم، ثم قرأ ابن عباس ‏{‏وإذ أخذ الله ميثاق الذين أوتوا الكتاب‏}‏ كذلك حتى قوله ‏{‏يفرحون بما أتوا ويحبون أن يحمدوا بما لم يفعلوا‏}‏‏.‏ تابعه عبد الرزاق عن ابن جريج‏.‏",
      "text_en": " Narrated Alqama bin Waqqas:                     Marwan said to his gatekeeper, \"Go to Ibn `Abbas, O Rafi`, and say, 'If everybody who rejoices in what he has done, and likes to be praised for what he has not done, will be punished, then all of us will be punished.\" Ibn `Abbas said, \"What connection have you with this case? It was only that the Prophet called the Jews and asked them about something, and they hid the truth and told him something else, and showed him that they deserved praise for the favor of telling him the answer to his question, and they became happy with what they had concealed. Then Ibn `Abbas recited:-- \"(And remember) when Allah took a Covenant from those who were given the Scripture..and those who rejoice in what they have done and love to be praised for what they have not done.' \" (3.187-188)",
      "chain": [
        "30309",
        "20295",
        "11070",
        "11090",
        "11042",
        "20201"
      ]
    },
    {
      "hadith_no": "5258",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا مروان بن معاوية، حدثنا أبو يعفور، قال تذاكرنا عند أبي الضحى فقال حدثنا ابن عباس، قال أصبحنا يوما ونساء النبي صلى الله عليه وسلم يبكين، عند كل امرأة منهن أهلها، فخرجت إلى المسجد، فإذا هو ملآن من الناس فجاء عمر بن الخطاب فصعد إلى النبي صلى الله عليه وسلم وهو في غرفة له، فسلم فلم يجبه أحد، ثم سلم فلم يجبه أحد، ثم سلم فلم يجبه أحد، فناداه فدخل على النبي صلى الله عليه وسلم فقال أطلقت نساءك فقال ‏\"‏ لا ولكن آليت منهن شهرا ‏\"‏‏.‏ فمكث تسعا وعشرين، ثم دخل على نسائه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     One morning we saw the wives of the Prophet weeping, and everyone of them had her family with her, I went to the mosque and found that it was crowded with people. Then `Umar bin Al-Khattab came and went up to the Prophet who was in his upper room. He greeted him but nobody answered. He greeted again, but nobody answered. Then the gatekeeper called him and he entered upon the Prophet, and asked, \"Have you divorced your wives?\" The Prophet, said, \"No, but I have taken an oath not to go to them for one month.\" So the Prophet stayed away (from his wives) for twenty nine days and then entered upon them.",
      "chain": [
        "30026",
        "20201",
        "17"
      ]
    },
    {
      "hadith_no": "5501",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا جمعة بن عبد الله، حدثنا مروان، أخبرنا هاشم بن هاشم، أخبرنا عامر بن سعد، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من تصبح كل يوم سبع تمرات عجوة لم يضره في ذلك اليوم سم ولا سحر ‏\"‏‏.‏",
      "text_en": " Narrated Sa`d:                     Allah's Apostle said, \"He who eats seven 'Ajwa dates every morning, will not be affected by poison or magic on the day he eats them.\"",
      "chain": [
        "20201",
        "11227",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "5827",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا علي، حدثنا مروان، أخبرنا هاشم، أخبرنا عامر بن سعد، عن أبيه  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ من اصطبح كل يوم تمرات عجوة، لم يضره سم ولا سحر ذلك اليوم إلى الليل ‏\"‏‏.‏ وقال غيره ‏\"‏ سبع تمرات ‏\"‏‏.‏",
      "text_en": " Narrated Saud:                     The Prophet said, \"If somebody takes some 'Ajwa dates every morning, he will not be effected by poison or magic on that day till night.\" (Another narrator said seven dates).",
      "chain": [
        "5",
        "20201",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "139",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا سويد بن سعيد، وابن أبي عمر، قالا حدثنا مروان، - يعنيان الفزاري - عن أبي مالك، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من قال لا إله إلا الله وكفر بما يعبد من دون الله حرم ماله ودمه وحسابه على الله ‏\"‏ ‏.‏",
      "text_en": " It Is narrated on the authority of Abu Malik:                      I heard the Messenger of Allah (may peace be upon him) say: He who professed that there is no god but Allah and made a denial of everything which the people worship beside Allah, his property and blood became inviolable, an their affairs rest with Allah.",
      "chain": [
        "30547",
        "30421",
        "20201",
        "10766",
        "5098"
      ]
    },
    {
      "hadith_no": "143",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عباد، وابن أبي عمر، قالا حدثنا مروان، عن يزيد، - وهو ابن كيسان - عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم لعمه عند الموت ‏\"‏ قل لا إله إلا الله أشهد لك بها يوم القيامة ‏\"‏ ‏.‏ فأبى فأنزل الله ‏{‏ إنك لا تهدي من أحببت‏}‏ الآية ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah said to his uncle at the time of his death:                      Make a profession of it that there is no god but Allah and I will bear testimony (of your being a Muslim) on the Day of judgment. But he (Abu Talib) refused to do so. Then Allah revealed this verse: \" Verily thou canst not guide to the right path whom thou lovest. And it is Allah Who guideth whom He will and He knoweth best who are the guided\" (xxviii. 56).",
      "chain": [
        "30377",
        "30421",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "389",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عباد، وابن أبي عمر، جميعا عن مروان الفزاري، قال ابن عباد حدثنا مروان، عن يزيد، - يعني ابن كيسان - عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ بدأ الإسلام غريبا وسيعود كما بدأ غريبا فطوبى للغرباء ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      Islam initiated as something strange, and it would revert to its (old position) of being strange. so good tidings for the stranger.",
      "chain": [
        "30377",
        "30421",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "247",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا سويد بن سعيد، وابن أبي عمر، جميعا عن مروان الفزاري، - قال ابن أبي عمر حدثنا مروان، - عن أبي مالك الأشجعي، سعد بن طارق عن أبي حازم، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن حوضي أبعد من أيلة من عدن لهو أشد بياضا من الثلج وأحلى من العسل باللبن ولآنيته أكثر من عدد النجوم وإني لأصد الناس عنه كما يصد الرجل إبل الناس عن حوضه ‏\"‏ ‏.‏ قالوا يا رسول الله أتعرفنا يومئذ قال ‏\"‏ نعم لكم سيما ليست لأحد من الأمم تردون على غرا محجلين من أثر الوضوء ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      Verily Allah's Messenger (may peace be upon him) said: My Cistern has its dimensions wider than the distance between Aila and Aden, and its water is whiter than ice and sweeter than the honey diluted with milk, and its cups are more numerous than the numbers of the stars. Verily I shall prevent the (faithless) people therefrom just as a man prevents the camels of the people from his fountain. They said: Messenger of Allah, will you recognise us on that day? He said: Yes, you will have distinctive marks which nobody among the peoples (except you) will have; you would come to me with blazing forehead and bright hands and feet on account of the traces of ablution.",
      "chain": [
        "30547",
        "30421",
        "30421",
        "20201",
        "10766",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "308",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، ح وحدثنا أبو كريب، أخبرنا ابن أبي زائدة، ح وحدثني عمرو الناقد، وابن، نمير قالا حدثنا مروان بن معاوية الفزاري، كلهم عن عاصم، عن أبي المتوكل، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أتى أحدكم أهله ثم أراد أن يعود فليتوضأ ‏\"‏ ‏.‏ زاد أبو بكر في حديثه بينهما وضوءا وقال ثم أراد أن يعاود ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      The Messenger of Allah (may peace be upon him) said: When anyone amongst you has sexual intercourse with his wife and then he intends to repeat it, he should perform ablution. In the hadith transmitted by Abu Bakr. (the words are):\" Between the two (acts) there should be an ablution,\" or he (the narrator) said:\" Then he intended that it should be repeated.\"",
      "chain": [
        "30201",
        "20317",
        "30216",
        "20366",
        "30263",
        "30212",
        "20201",
        "11080",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "497",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا مروان بن معاوية الفزاري، قال حدثنا عبيد الله بن عبد الله بن الأصم، عن يزيد بن الأصم، أنه أخبره عن ميمونة، زوج النبي صلى الله عليه وسلم قالت كان رسول الله صلى الله عليه وسلم إذا سجد خوى بيديه - يعني جنح - حتى يرى وضح إبطيه من ورائه وإذا قعد اطمأن على فخذه اليسرى ‏.‏",
      "text_en": " Maimuna, the wife of the Apostle of Allah (may peace be upon him), reported:                      When the Messenger of Allah (may peace be upon him) prostrated himself, he spread his arms, i. e. he separated them so much that the whiteness of his armpits became visible from behind and when he sat (for Jalsa) he rested on his left thigh.",
      "chain": [
        "30021",
        "20201",
        "10946",
        "10842"
      ]
    },
    {
      "hadith_no": "1466",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا زهير بن حرب، حدثنا مروان بن معاوية الفزاري، أخبرنا إسماعيل بن أبي خالد، حدثنا قيس بن أبي حازم، قال سمعت جرير بن عبد الله، وهو يقول كنا جلوسا عند رسول الله صلى الله عليه وسلم إذ نظر إلى القمر ليلة البدر فقال ‏\"‏ أما إنكم سترون ربكم كما ترون هذا القمر لا تضامون في رؤيته فإن استطعتم أن لا تغلبوا على صلاة قبل طلوع الشمس وقبل غروبها ‏\"‏ ‏.‏ يعني العصر والفجر ثم قرأ جرير ‏{‏ وسبح بحمد ربك قبل طلوع الشمس وقبل غروبها‏}‏ ‏.‏",
      "text_en": " Jarir b. Abdullah is reported to have said:                      We were sitting with the Messenger of Allah (may peace be upon him) that he looked at the full moon and observed: You shall see your Lord as you are seeing this moon, and you will not be harmed by seeing Him. So if you can, do not let -yourselves be overpowered in case of prayer observed before the rising of the sun and its setting, i. e. the 'Asr prayer and the morning prayer. Jarir then recited it:\" Celebrate the praise of thy Lord before the rising of the sun and before Its setting\" (xx. 130).",
      "chain": [
        "30022",
        "20201",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "hadith_no": "1684",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو كامل الجحدري، حدثنا حماد يعني ابن زيد، ح وحدثني حامد بن عمر البكراوي، حدثنا عبد الواحد يعني ابن زياد، ح وحدثنا ابن نمير، حدثنا أبو معاوية، كلهم عن عاصم، ح وحدثني زهير بن حرب، - واللفظ له - حدثنا مروان بن معاوية الفزاري، عن عاصم الأحول، عن عبد الله بن سرجس، قال دخل رجل المسجد ورسول الله صلى الله عليه وسلم في صلاة الغداة فصلى ركعتين في جانب المسجد ثم دخل مع رسول الله صلى الله عليه وسلم فلما سلم رسول الله صلى الله عليه وسلم قال ‏\"‏ يا فلان بأى الصلاتين اعتددت أبصلاتك وحدك أم بصلاتك معنا ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Sarjis reported:                      A person entered the mosque, while the Messenger of Allah (may peace be upon him) was leading the dawn prayer. He observed two rak'ahs in a corner of the mosque, and then joined the Messenger of Allah (may peace be upon him) in prayer. When the Messenger of Allah (may peace be upon him) had pronounced salutations (he had concluded the prayer), he said: O, so and so, which one out of these two prayers did you count (as your Fard prayer), the one that you observed alone or the prayer that you observed with us?",
      "chain": [
        "30559",
        "20022",
        "30128",
        "20256",
        "30212",
        "11080",
        "30022",
        "20201",
        "11080",
        "3245"
      ]
    },
    {
      "hadith_no": "1723",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني محمد بن عباد، وابن أبي عمر، قالا حدثنا مروان بن معاوية، عن يزيد، - هو ابن كيسان - عن أبي حازم، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قرأ في ركعتى الفجر ‏{‏ قل يا أيها الكافرون‏}‏ و ‏{‏ قل هو الله أحد‏}‏",
      "text_en": " Abu Huraira reported that the Messenger of Allah (may peace be upon him) recited in the two (supererogatory) rak'ahs of the dawn (prayer):                     \" Say: O unbelievers,\" (Qur'an, cix.) and\" Say: Allah is one\" (cxii.).",
      "chain": [
        "30377",
        "30421",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "2303",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا يحيى بن أيوب، ومحمد بن عباد، - واللفظ ليحيى - قالا حدثنا مروان، بن معاوية عن يزيد، - يعني ابن كيسان - عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ استأذنت ربي أن أستغفر لأمي فلم يأذن لي واستأذنته أن أزور قبرها فأذن لي ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger, (may peace be upon him) as saying:                      I sought permission to beg forgiveness for my mother, but He did not grant it to me. I sought permission from Him to visit her grave, and He granted it (permission) to me.",
      "chain": [
        "20379",
        "30377",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "2450",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني عبد الله بن عبد الرحمن الدارمي، وسلمة بن شبيب، - قال سلمة حدثنا وقال الدارمي، أخبرنا مروان، وهو ابن محمد الدمشقي - حدثنا سعيد، - وهو ابن عبد العزيز - عن ربيعة بن يزيد، عن أبي إدريس الخولاني، عن أبي مسلم الخولاني، قال حدثني الحبيب الأمين، أما هو فحبيب إلى وأما هو عندي فأمين عوف بن مالك الأشجعي قال كنا عند رسول الله صلى الله عليه وسلم تسعة أو ثمانية أو سبعة فقال ‏\"‏ ألا تبايعون رسول الله ‏\"‏ وكنا حديث عهد ببيعة فقلنا قد بايعناك يا رسول الله ‏.‏ ثم قال ‏\"‏ ألا تبايعون رسول الله ‏\"‏ ‏.‏ فقلنا قد بايعناك يا رسول الله ‏.‏ ثم قال ‏\"‏ ألا تبايعون رسول الله ‏\"‏ ‏.‏ قال فبسطنا أيدينا وقلنا قد بايعناك يا رسول الله فعلام نبايعك قال ‏\"‏ على أن تعبدوا الله ولا تشركوا به شيئا والصلوات الخمس وتطيعوا - وأسر كلمة خفية - ولا تسألوا الناس شيئا ‏\"‏ ‏.‏ فلقد رأيت بعض أولئك النفر يسقط سوط أحدهم فما يسأل أحدا يناوله إياه ‏.‏",
      "text_en": " Malik al-Ashja'i reported:                      We, nine, eight or seven men, were in the company of the Messenger of Allah (may peace be upon him) and he said: Why don't you pledge allegiance to the Messenger of Allah? -while we had recently pledged allegiance. So we said: Messenger of Allah, we have already pledged allegiance to you. He again said: Why don't you pledge allegiance to the Messenger of Allah? And we said: Messenger of Allah, we have already pledged allegiance to you. He again said: Why don't you pledge allegiance to the Messenger of Allah? We stretched our hands and said: Messenger of Allah. we have already pledged allegiance to you. Now tell (on what things) should we pledge allegiance to you. He said I (You must pledge allegiance) that you would worship Allah only and would not associate with Him anything, (and observe) five prayers, and obey- (and he said onething in an undertone) -that you would not beg people of anything. (And as a consequence of that) I saw that some of these people did not ask anyone to pick up the whip for them if it fell down.",
      "chain": [
        "30025",
        "30417",
        "237",
        "30025",
        "20201",
        "20638",
        "11414",
        "11027",
        "11026"
      ]
    },
    {
      "hadith_no": "2675",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا سعيد بن عمرو الأشعثي، وسهل بن عثمان، وسويد بن سعيد، وحسين، بن حريث كلهم عن مروان، - قال سعيد أخبرنا مروان بن معاوية، - عن عاصم، قال سمعت أبا نضرة، يحدث عن أبي سعيد الخدري، وجابر بن عبد الله، - رضى الله عنهم - قالا سافرنا مع رسول الله صلى الله عليه وسلم فيصوم الصائم ويفطر المفطر فلا يعيب بعضهم على بعض ‏.‏",
      "text_en": " Abu Nadra reported Abu Sa'id al. Khudri and Jabir b. Abdullah as saying:                      We travelled with the Messenger of Allah (may peace be upon him). The observer of the fast observed it, and the breaker of the fast broke it, but none of them found fault with each other.",
      "chain": [
        "30465",
        "30546",
        "30547",
        "30325",
        "20201",
        "11168",
        "20201",
        "11080",
        "10721",
        "38",
        "34"
      ]
    },
    {
      "hadith_no": "2836",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا محمد بن عباد، وابن أبي عمر، قالا حدثنا مروان، - وهو الفزاري - عن يزيد، - وهو ابن كيسان - عن أبي حازم، عن أبي هريرة، - رضى الله عنه - قال تذاكرنا ليلة القدر عند رسول الله صلى الله عليه وسلم فقال ‏\"‏ أيكم يذكر حين طلع القمر وهو مثل شق جفنة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported:                      We were talking about Lailat-ul-Qadr in the presence of the Messenger of Allah (may peace be upon him) and he said: He who amongst you remembers (the night) when the moon arose and it was like a piece of plate (at the fag end of the month in a state of waning).",
      "chain": [
        "30377",
        "30421",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "3028",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا سعيد بن منصور، وابن أبي عمر، جميعا عن الفزاري، - قال سعيد حدثنا مروان بن معاوية، - أخبرنا سليمان التيمي، عن غنيم بن قيس، قال سألت سعد بن أبي وقاص - رضى الله عنه - عن المتعة، فقال فعلناها وهذا يومئذ كافر بالعرش ‏.‏ يعني بيوت مكة ‏.‏",
      "text_en": " Ghunaim b. Qais said:                      I asked Sa'd b. Abu Waqqas (Allah be pleased with him) about Mut'a, whereupon he said: We did that, and it was the day when he was an unbeliever living in (one of the) houses of Mecca.",
      "chain": [
        "30116",
        "30421",
        "20405",
        "11168",
        "20201",
        "11289",
        "10710",
        "9"
      ]
    },
    {
      "hadith_no": "3385",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا ابن أبي عمر، حدثنا مروان بن معاوية، حدثنا عثمان بن حكيم الأنصاري، أخبرني عامر بن سعد بن أبي وقاص، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏.‏ ثم ذكر مثل حديث ابن نمير وزاد في الحديث ‏\"‏ ولا يريد أحد أهل المدينة بسوء إلا أذابه الله في النار ذوب الرصاص أو ذوب الملح في الماء ‏\"‏ ‏.‏",
      "text_en": " 'Amir b. Sa'd b. Abu Waqqas reported on the authority of his father (Allah be pleased with him) that Allah's Messenger (may peace be upon him) said, and then the (above-mentioned) hadith was narrated with this addition:                     \" None should nurse ill-will towards the people of Medina, or Allah will melt him in fire like the melting of lead or the dissolution of salt in water.",
      "chain": [
        "30421",
        "20201",
        "19476",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "3551",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني يحيى بن معين، حدثنا مروان بن معاوية الفزاري، حدثنا يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال إني تزوجت امرأة من الأنصار ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ هل نظرت إليها فإن في عيون الأنصار شيئا ‏\"‏ ‏.‏ قال قد نظرت إليها ‏.‏ قال ‏\"‏ على كم تزوجتها ‏\"‏ ‏.‏ قال على أربع أواق ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ على أربع أواق كأنما تنحتون الفضة من عرض هذا الجبل ما عندنا ما نعطيك ولكن عسى أن نبعثك في بعث تصيب منه ‏\"‏ ‏.‏ قال فبعث بعثا إلى بني عبس بعث ذلك الرجل فيهم ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported:                      A man came to Allah's Messenger (may peace be upon him) and said: I have contracted marriage with a woman of the Ansar, whereupon Allah's Apostle (may peace be upon him) said: Did you cast a glance at her, for there is something in the eyes of the Ansar? He said: I did cast a glance at her, whereupon he said: For what (dower) did you marry her? He said: For four 'uqiyas. Thereupon Allah's Apostle (may peace be upon him) said: For four 'uqiyas; it seems as if you dig out silver from the side of this mountain (and that is why you are prepared to pay such a large amount of dower). We have nothing which we should give you. There is a possibility that we may send you to an (expedition) where you may get (booty). So he sent that man (in the expedition) which was despatched to Banu 'Abs.",
      "chain": [
        "30020",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "3613",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا مروان، عن يزيد، - يعني ابن كيسان - عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ والذي نفسي بيده ما من رجل يدعو امرأته إلى فراشها فتأبى عليه إلا كان الذي في السماء ساخطا عليها حتى يرضى عنها ‏\"‏ ‏.",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      By Him in Whose Hand is my life, when a man calls his wife to his bed, and she does not respond, the One Who is in the heaven is displeased with her until he (her husband) is pleased with her.",
      "chain": [
        "30421",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "3615",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا مروان بن معاوية، عن عمر بن حمزة العمري، حدثنا عبد الرحمن بن سعد، قال سمعت أبا سعيد الخدري، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من أشر الناس عند الله منزلة يوم القيامة الرجل يفضي إلى امرأته وتفضي إليه ثم ينشر سرها ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah he pleased with him) reported that Allah's Messenger (may peace be upoin him) said:                      The most wicked among the people in the eye of Allah on the Day of judgment is the men who goes to his wife and she comes to him, and then he divulges her secret.",
      "chain": [
        "30201",
        "20201",
        "11899",
        "38"
      ]
    },
    {
      "hadith_no": "4111",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا داود بن رشيد، حدثنا مروان بن معاوية، أخبرنا عمر بن حمزة بن عبد، الله بن عمر حدثنا سالم بن عبد الله، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما أهل دار اتخذوا كلبا إلا كلب ماشية أو كلب صائد نقص من عملهم كل يوم قيراطان‏\"‏ ‏.‏",
      "text_en": " Salim b. Abdullah reported on the authority of his father that Allah's Messenger (may peace be upon him) said:                      Whosover amongst the owners of the house keeps a dog other than one meant for watching the herd or for hunting loses two qirat of his deeds every day.",
      "chain": [
        "30248",
        "20201",
        "11899",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "4335",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vows - كتاب النذر",
      "chapter_no": "27",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، أخبرنا يزيد بن زريع، عن حميد، عن ثابت، عن أنس، ح. وحدثنا ابن أبي عمر، - واللفظ له - حدثنا مروان بن معاوية الفزاري، حدثنا حميد، حدثني ثابت، عن أنس، أن النبي صلى الله عليه وسلم رأى شيخا يهادى بين ابنيه فقال ‏\"‏ ما بال هذا ‏\"‏ ‏.‏ قالوا نذر أن يمشي ‏.‏ قال ‏\"‏ إن الله عن تعذيب هذا نفسه لغني ‏\"‏ ‏.‏ وأمره أن يركب ‏.‏",
      "text_en": " Anas reported that Allah's Apostle (may peace be upon him) saw an old man being supported between his two sons. He (the Holy Prophet) said:                      What is the matter with him? They said: He had taken the vow to walk (on foot to the Ka'ba). Thereupon he (Allah's Apoitle) said: Allah is indifferent to his inflicting upon himself chastisement, and he commanded him to ride.",
      "chain": [
        "30399",
        "20304",
        "11279",
        "11269",
        "19",
        "30421",
        "20201",
        "11279",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "4360",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "حدثني زهير بن حرب، حدثنا مروان بن معاوية الفزاري، أخبرنا يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، قال أعتم رجل عند النبي صلى الله عليه وسلم ثم رجع إلى أهله فوجد الصبية قد ناموا فأتاه أهله بطعامه فحلف لا يأكل من أجل صبيته ثم بدا له فأكل فأتى رسول الله صلى الله عليه وسلم فذكر ذلك له فقال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف على يمين فرأى غيرها خيرا منها فليأتها وليكفر عن يمينه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      A person sat late in the night with Allah's Apostle (may peace be upon him), and then came to his family and found that his children had gone to sleep. His wife brought food for him. but he took an oath that he would not eat because of his children (having gone to sleep without food) He then gave precedence (of breaking the vow and then expiating it) and ate the food He then came to Allah s Messenger (may peace be upon him) and made mention of that to him, whereupon Allah's Messenger (may peace he upon him) said: He who took an oath and (later on) found something better than that should do that, and expiate for (breaking) his vow.",
      "chain": [
        "30022",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "4583",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا مروان بن معاوية الفزاري، عن محمد بن سوقة، أخبرنا محمد بن عبيد الله الثقفي، عن وراد، قال كتب المغيرة إلى معاوية سلام عليك أما بعد فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الله حرم ثلاثا ونهى عن ثلاث حرم عقوق الوالد ووأد البنات ولا وهات ‏.‏ ونهى عن ثلاث قيل وقال وكثرة السؤال وإضاعة المال ‏\"‏ ‏.‏",
      "text_en": " Warrad reported that al-Mughira wrote to Mu'awiya:                      Peace be upon you, and then coming to the poirt (I should say) that I heard Allah's Messenger (may peace be upon him) as saying: Verily Allah has Prohibited three things and has forbidden three things. He has declared absolutely haram the disobedience of father, burying of daughters alive, and withholding that which you have power to return, and has forbidden three things: irrelevant talk, persistent questioning, and wasting of wealth.",
      "chain": [
        "30421",
        "20201",
        "11387",
        "30213",
        "11402"
      ]
    },
    {
      "hadith_no": "4973",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا عبد الوهاب يعني الثقفي، ح وحدثنا أبو بكر، بن أبي شيبة حدثنا أبو معاوية، ح وحدثنا ابن أبي عمر، حدثنا مروان بن معاوية، كلهم عن يحيى بن سعيد، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لولا أن أشق على أمتي لأحببت أن لا أتخلف خلف سرية ‏\"‏ ‏.‏ نحو حديثهم ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      If it were not hard upon my Umma (to follow my example), I would not lag behind any expedition-as in the traditions gone before.",
      "chain": [
        "30170",
        "20259",
        "30201",
        "20354",
        "30421",
        "20201",
        "11062",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "4984",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا مروان بن معاوية، عن يحيى بن سعيد، عن ذكوان، بن أبي صالح عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لولا أن رجالا من أمتي ‏\"‏ ‏.‏ وساق الحديث وقال فيه ‏\"‏ ولروحة في سبيل الله أو غدوة خير من الدنيا وما فيها ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      If some persons of my Umma (were not to undertake the hardships of Jihad), and he (Abu Huraira) then narrated the rest of the hadith and then said: A journey undertaken for jihad in the evening or morning merits a reward better than the world and all that is in it.",
      "chain": [
        "30421",
        "20201",
        "11062",
        "13"
      ]
    },
    {
      "hadith_no": "5239",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا زهير بن حرب، وسريج بن يونس، كلاهما عن مروان، قال زهير حدثنا  مروان بن معاوية الفزاري، حدثنا منصور بن حيان، حدثنا أبو الطفيل، عامر بن واثلة قال كنت عند علي بن أبي طالب فأتاه رجل فقال ما كان النبي صلى الله عليه وسلم يسر إليك قال فغضب وقال ما كان النبي صلى الله عليه وسلم يسر إلى شيئا يكتمه الناس غير أنه قد حدثني بكلمات أربع ‏.‏ قال فقال ما هن يا أمير المؤمنين قال قال ‏\"‏ لعن الله من لعن والده ولعن الله من ذبح لغير الله ولعن الله من آوى محدثا ولعن الله من غير منار الأرض ‏\"‏ ‏.‏",
      "text_en": " Abu Tufail 'Amir b. Withila reported:                      I was in the company of 'Ali b. Abi Talib, when a person came to him, and said: What was it that Allah's Apostle (may peace be upon him) told you in secret? Thereupon he (liadrat 'All) was enraged and said: Allah's Apostle (may peace be upon him) did not tell me anything in secret that he hid from people, except that he told me four things. He said: Com- mader of Faithful, what are these? He said: Allah cursed him who cursed his father; Allah cursed him who sacrificed for anyone besides Allah; and Allah cursed him who accommodates an innovator (in religion) ; and Allah cursed him who changed the minarets (the boundary lines) of the land.",
      "chain": [
        "30022",
        "30251",
        "20201",
        "20321",
        "20201",
        "10969",
        "3660"
      ]
    },
    {
      "hadith_no": "5302",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وسريج بن يونس، - واللفظ لأبي بكر - قالا حدثنا مروان بن معاوية، عن منصور بن حيان، عن سعيد بن جبير، قال أشهد على ابن عمر وابن عباس أنهما شهدا أن رسول الله صلى الله عليه وسلم نهى عن الدباء والحنتم والمزفت والنقير ‏.‏",
      "text_en": " Sa'id b. Jubair reported:                      I bear testimony to the fact that Ibn 'Umar and Ibn 'Abbas testified to the fact that Allah's Messenger (may peace be upon him) forbade (the preparation) of Nabidh in gourd in vessel besmeared with pitch and hollow stump.",
      "chain": [
        "30201",
        "30251",
        "20201",
        "10969",
        "11050"
      ]
    },
    {
      "hadith_no": "5461",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثناه ابن أبي عمر، حدثنا مروان بن معاوية الفزاري، ح وحدثناه إسحاق، بن إبراهيم أخبرنا أبو بدر، شجاع بن الوليد كلاهما عن هاشم بن هاشم، بهذا الإسناد عن النبي صلى الله عليه وسلم مثله ولا يقولان سمعت النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " This hadith has been reported on the authority of Ibn Hashim with the same chain of transmitters but with a slight variation of wording.",
      "chain": [
        "30421",
        "20201",
        "30123",
        "11227"
      ]
    },
    {
      "hadith_no": "5708",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثني أبو كريب، محمد بن العلاء وابن أبي عمر - قال أبو كريب أخبرنا وقال، ابن أبي عمر حدثنا واللفظ، له - قالا حدثنا مروان، - يعنيان الفزاري - عن حميد، عن  أنس، قال نادى رجل رجلا بالبقيع يا أبا القاسم ‏.‏ فالتفت إليه رسول الله صلى الله عليه وسلم ‏.‏ فقال يا رسول الله إني لم أعنك إنما دعوت فلانا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ تسموا باسمي ولا تكنوا بكنيتي ‏\"‏ ‏.‏",
      "text_en": " Anas reported that person at Baqi' called another person as\" Abu'l- Qasim,\" and Allah's Messenger (may peace be upon him) turned towards him. He (the person who had uttered these words) said:                      Messenger of Allah, I did not mean you, but I called such and such (person), whereupon Allah's Messenger (may peace be upon him) said: You may call yourself by my name, but not by my kunya.",
      "chain": [
        "30216",
        "30421",
        "20201",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "6333",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن أبي عمر المكي، حدثنا مروان بن معاوية الفزاري، عن يزيد، - وهو ابن كيسان - عن أبي حازم الأشجعي، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أصبح منكم اليوم صائما ‏\"‏ ‏.‏ قال أبو بكر أنا ‏.‏ قال ‏\"‏ فمن تبع منكم اليوم جنازة ‏\"‏ ‏.‏ قال أبو بكر أنا ‏.‏ قال ‏\"‏ فمن أطعم منكم اليوم مسكينا ‏\"‏ ‏.‏ قال أبو بكر أنا ‏.‏ قال ‏\"‏ فمن عاد منكم اليوم مريضا ‏\"‏ ‏.‏ قال أبو بكر أنا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما اجتمعن في امرئ إلا دخل الجنة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that Allah's Messenger (may peace be upon him) said:                      Who amongst you is observing fastthis day? Abu Bake said: It is I. He (again) said: Who amongst you has followed the bier today? Abu Bakr said: It is I. He (the Holy Prophet) again said: Who amongst you has served food to the needy? Abu Bakr said: It is I. He (again) said: Who amongst you has today visited the sick? Abu Bakr said: It is I. Thereupon Allah's Messenger (may peace be upon him) said: He must get into Paradise who combines in himself (all these noble qualities and virtues).",
      "chain": [
        "20201",
        "10845",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "6720",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني سويد بن سعيد، حدثنا مروان بن معاوية، عن عاصم الأحول، بهذا الإسناد ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Asim al-Ahwal with the same chain of transmitters.",
      "chain": [
        "30547",
        "20201"
      ]
    },
    {
      "hadith_no": "6778",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا محمد بن عباد، وابن أبي عمر، قالا حدثنا مروان، - يعنيان الفزاري - عن يزيد، - وهو ابن كيسان - عن أبي حازم، عن أبي هريرة، قال قيل يا رسول الله ادع على المشركين قال ‏\"‏ إني لم أبعث لعانا وإنما بعثت رحمة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported it was said to Allah's Messenger (may peace be upon him):                      Invoke curse upon the polytheists, whereupon he said: I have not been sent as the invoker of curse, but\" I have been sent as mercy.\"",
      "chain": [
        "30377",
        "30421",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "7027",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا مروان، وعلي بن مسهر، عن موسى الجهني، ح وحدثنا محمد بن عبد الله بن نمير، - واللفظ له - حدثنا أبي، حدثنا موسى الجهني، عن مصعب بن سعد، حدثني أبي قال، كنا عند رسول الله صلى الله عليه وسلم فقال ‏\"‏ أيعجز أحدكم أن يكسب كل يوم ألف حسنة ‏\"‏ ‏.‏ فسأله سائل من جلسائه كيف يكسب أحدنا ألف حسنة قال ‏\"‏ يسبح مائة تسبيحة فيكتب له ألف حسنة أو يحط عنه ألف خطيئة ‏\"‏ ‏.‏",
      "text_en": " Mus'ab b. Sa'd reported that his father told him that he had been in the company of Allah's Messenger (may peace be upon him) that he said:                      Is one amongst you powerless to get one thousand virtues every day. Amongst those who had been sitting there, one asked: How one amongst us can get one thousand virtues every day? He said: Recite:\" Hallowed be Allah\" one hundred times for (by reciting them) one thousand virtues are recorded (to your credit) and one tbousand vices are blotted out.",
      "chain": [
        "30201",
        "20201",
        "20345",
        "28270",
        "28270",
        "10556",
        "9"
      ]
    },
    {
      "hadith_no": "7211",
      "source": " Sahih Muslim ",
      "chapter": "Pertaining To The Charateristics Of The Hypocrites And Command Concerning Them - كتاب صفات المنافقين وأحكامهم",
      "chapter_no": "52",
      "text_ar": "حدثنا زهير بن حرب، وهارون بن عبد الله، - واللفظ لزهير - قالا حدثنا حجاج، بن محمد عن ابن جريج، أخبرني ابن أبي مليكة، أن حميد بن عبد الرحمن بن عوف، أخبره  أن مروان قال اذهب يا رافع - لبوابه - إلى ابن عباس فقل لئن كان كل امرئ منا فرح بما أتى وأحب أن يحمد بما لم يفعل معذبا لنعذبن أجمعون ‏.‏ فقال ابن عباس ما لكم ولهذه الآية إنما أنزلت هذه الآية في أهل الكتاب ‏.‏ ثم تلا ابن عباس ‏{‏ وإذ أخذ الله ميثاق الذين أوتوا الكتاب لتبيننه للناس ولا تكتمونه‏}‏ هذه الآية وتلا ابن عباس ‏{‏ لا تحسبن الذين يفرحون بما أتوا ويحبون أن يحمدوا بما لم يفعلوا‏}‏ وقال ابن عباس سألهم النبي صلى الله عليه وسلم عن شىء فكتموه إياه وأخبروه بغيره فخرجوا قد أروه أن قد أخبروه بما سألهم عنه واستحمدوا بذلك إليه وفرحوا بما أتوا من كتمانهم إياه ما سألهم عنه ‏.‏",
      "text_en": " Humaid b. 'Abd al-Rahman b. 'Auf reported that Marwan said to Rafi', his chamberlain, that he should go to Ibn 'Abbas and ask him:                      If every one of us be punished for his being happy upon his deed and for his being praised for what he has not done, nobody would be saved from the torment. Ibn 'Abbas said: What you have to do with this verse? It has been in fact revealed in connection with the people of the Book.\" Then Ibn Abbas recited this verse:\" When Allah took a covenant from those who had been given the Book: You shall explain it to people and shall not conceal this\" (iii. 186), and then Ibn 'Abbas recited this verse:\" Think not that those who exult in what they have done and love to be praised for what they have not done\" (iii. 186). Ibn 'Abbas (further) said: Allah's Apostle (may peace be upon him) asked them about something and then they concealed that and they told him something else and they went out and they thought that they had informed him as lie had asked them and they felt happy of what they had concealed.",
      "chain": [
        "30022",
        "20381",
        "11070",
        "11090",
        "10561",
        "20201"
      ]
    },
    {
      "hadith_no": "7347",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "وحدثناه محمد بن عباد، وابن أبي عمر، قالا حدثنا مروان، عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، بهذا الإسناد وقال ‏\"‏ هذا وقع في أسفلها فسمعتم وجبتها ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abfi Huraira with the same chain of transmitters but with this change of wording that the Holy Prophet (may. peace be upon him) said:                      It reached at its base and you heard its sound.",
      "chain": [
        "30377",
        "30421",
        "20201",
        "10845",
        "11172"
      ]
    },
    {
      "hadith_no": "7443",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثناه ابن أبي عمر، حدثنا مروان بن معاوية، حدثنا عثمان بن حكيم الأنصاري، أخبرني عامر بن سعد، عن أبيه، أنه أقبل مع رسول الله صلى الله عليه وسلم في طائفة من أصحابه فمر بمسجد بني معاوية ‏.‏ بمثل حديث ابن نمير ‏.‏",
      "text_en": " Amir b. Sa'd reported on the authority of his father that Allah's Messenger (may peace be upon him) came with a group of his Companions and he passed by the mosque of Banu Mu'awiya. The rest of the hadith is the same.",
      "chain": [
        "30421",
        "20201",
        "19476",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "7487",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا ابن أبي عمر المكي، حدثنا مروان، عن يزيد، - وهو ابن كيسان - عن  أبي حازم، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ والذي نفسي بيده ليأتين على الناس زمان لا يدري القاتل في أى شىء قتل ولا يدري المقتول على أى شىء قتل ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      By Him in Whose Hand is my life, a time would come when the murderer would not know why he has committed the murder, and the victim would not know why he has been killed.",
      "chain": [
        "30421",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "7648",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن عباد، وابن أبي عمر، قالا حدثنا مروان، - يعنيان الفزاري - عن يزيد، - وهو ابن كيسان - عن أبي حازم، عن أبي هريرة، قال والذي نفسي بيده - وقال ابن عباد والذي نفس أبي هريرة بيده - ما أشبع رسول الله صلى الله عليه وسلم أهله ثلاثة أيام تباعا من خبز حنطة حتى فارق الدنيا ‏.‏",
      "text_en": " Abu Huraira reported:                      By Him in Whose Hand is my life and Ibn 'Abbad also said: By One in Whose hand is the life of Abu Huraira, Allah's Messenger (may peace be upon him) could not afford to provide adequate food to his family which could (fill their bellies) with bread and wheat for three days successively until he left the world.",
      "chain": [
        "30377",
        "30421",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "185",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن العلاء، وأيوب بن محمد الرقي، وعمرو بن عثمان الحمصي، - المعنى - قالوا حدثنا مروان بن معاوية، أخبرنا هلال بن ميمون الجهني، عن عطاء بن يزيد الليثي، - قال هلال لا أعلمه إلا عن أبي سعيد ‏.‏ وقال أيوب وعمرو أراه - عن أبي سعيد أن النبي صلى الله عليه وسلم مر بغلام وهو يسلخ شاة فقال له رسول الله صلى الله عليه وسلم ‏\"‏ تنح حتى أريك فأدخل يده بين الجلد واللحم فدحس بها حتى توارت إلى الإبط ثم مضى فصلى للناس ولم يتوضأ ‏.‏ قال أبو داود زاد عمرو في حديثه - يعني - لم يمس ماء ‏.‏ وقال عن هلال بن ميمون الرملي ورواه عبد الواحد بن زياد وأبو معاوية عن هلال عن عطاء عن النبي صلى الله عليه وسلم مرسلا لم يذكرا أبا سعيد ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     The Prophet (ﷺ) passed by a boy who was skinning a goat. The Messenger of Allah (ﷺ) said: Give it up until I show you. He (the Prophet) inserted his hand between the skin and the flesh until it reached the armpit. He then went away and led the people in prayer and he did not perform ablution. The version of Amr added that he did not touch water.Abu Dawud said: This tradition has been narrated though another chain of transmitters, making no mention of Abu Sa'id.",
      "chain": [
        "30216",
        "38120",
        "10581",
        "20201",
        "15594",
        "11206",
        "38"
      ]
    },
    {
      "hadith_no": "349",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمود بن خالد الدمشقي، أخبرنا مروان، حدثنا علي بن حوشب، قال سألت مكحولا عن هذا القول، ‏\"‏ غسل واغتسل ‏\"‏ ‏.‏ فقال غسل رأسه وغسل جسده ‏.‏",
      "text_en": " Makhul was asked about the meaning of words ghassala and ightasala (that occur in tradition 345) and he said:                      one should was one's head and body well (and not than one should makes one's wife wash).",
      "chain": [
        "37534",
        "20201",
        "27532",
        "11066"
      ]
    },
    {
      "hadith_no": "581",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هارون بن عباد الأزدي، حدثنا مروان، حدثتني طلحة أم غراب، عن عقيلة، - امرأة من بني فزارة مولاة لهم - عن سلامة بنت الحر، أخت خرشة بن الحر الفزاري قالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن من أشراط الساعة أن يتدافع أهل المسجد لا يجدون إماما يصلي بهم ‏\"‏ ‏.‏",
      "text_en": " Narrated Sulamah daughter of al-Hurr:                     I heard the Messenger of Allah (ﷺ) say: One of the signs of the Last Hour will be that people in a mosque will refuse to act as imam and will not find an imam to lead them in prayer.",
      "chain": [
        "20201"
      ]
    },
    {
      "hadith_no": "652",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا مروان بن معاوية الفزاري، عن هلال بن ميمون الرملي، عن يعلى بن شداد بن أوس، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خالفوا اليهود فإنهم لا يصلون في نعالهم ولا خفافهم ‏\"‏ ‏.‏",
      "text_en": " Narrated Aws ibn Thabit al-Ansari:                     The Messenger of Allah (ﷺ) said: Act differently from the Jews, for they do not pray in their sandals or their shoes.",
      "chain": [
        "30367",
        "20201",
        "15594",
        "12606"
      ]
    },
    {
      "hadith_no": "787",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا زياد بن أيوب، حدثنا مروان، - يعني ابن معاوية - أخبرنا عوف الأعرابي، عن يزيد الفارسي، حدثنا ابن عباس، بمعناه قال فيه فقبض رسول الله صلى الله عليه وسلم ولم يبين لنا أنها منها ‏.‏ قال أبو داود قال الشعبي وأبو مالك وقتادة وثابت بن عمارة إن النبي صلى الله عليه وسلم لم يكتب ‏{‏ بسم الله الرحمن الرحيم ‏}‏ حتى نزلت سورة النمل هذا معناه ‏.‏",
      "text_en": " The above mentioned tradition has been reported by ibn abbas through a different chain of narrators to the same effect. This version adds:                      The apostle of Allah (ﷺ) died, but he did not mention to us that surah al baraah ins a part of al-anfal.Abu Dawood said: Al-sha’bl, Abu Malik, Qatadah, and Thabit b. ‘Umarah said: The prophet( may peace be upon him) did not write”In the name of Allah, the compassionate, the merciful” until Surah al-naml was revealed. This is the meaning of what they said. Further, this is a mursal traditional(omitting the name of the companion)",
      "chain": [
        "30249",
        "20201",
        "11298",
        "14432"
      ]
    },
    {
      "hadith_no": "907",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن العلاء، وسليمان بن عبد الرحمن الدمشقي، قالا أخبرنا مروان بن معاوية، عن يحيى الكاهلي، عن المسور بن يزيد المالكي، - أن رسول الله صلى الله عليه وسلم قال يحيى وربما قال - شهدت رسول الله صلى الله عليه وسلم يقرأ في الصلاة فترك شيئا لم يقرأه فقال له رجل يا رسول الله تركت آية كذا وكذا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هلا أذكرتنيها ‏\"‏ ‏.‏ قال سليمان في حديثه قال كنت أراها نسخت ‏.‏ وقال سليمان قال حدثني يحيى بن كثير الأزدي، قال حدثنا المسور بن يزيد الأسدي المالكي.",
      "text_en": " Narrated Al-Miswar ibn Yazid al-Maliki:                     The Messenger of Allah (ﷺ) recited - Yahya (sub narrator) said: Sometimes al-Miswar said: I prayed along with the Messenger of Allah (ﷺ) and witnessed that he recited -  the Qur'an during the prayer and omitted something (i.e. some verses inadvertently) which he did not recite. A man said to him: Messenger of Allah, you omitted such-and-such verse. The Messenger of Allah (ﷺ) said: Why did you not remind me of it?  The narrator Sulayman said in his version: He (the man) said: I thought that it (the verse) was repealed.",
      "chain": [
        "30216",
        "30587",
        "20201"
      ]
    },
    {
      "hadith_no": "1102",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن خالد، حدثنا مروان، حدثنا سليمان بن بلال، عن يحيى بن سعيد، عن عمرة، عن أختها، قالت ما أخذت ق إلا من في رسول الله صلى الله عليه وسلم كان يقرؤها في كل جمعة ‏.‏ قال أبو داود كذا رواه يحيى بن أيوب وابن أبي الرجال عن يحيى بن سعيد عن عمرة عن أم هشام بنت حارثة بن النعمان ‏.‏",
      "text_en": " \t\t\t\t\t\t\t\t\t\t'Umrah reported on the authority of her sister:                      I memorized Surah al-Qaf from the mouth of the Messenger of Allah (ﷺ); he used to recite it on every friday.Abu Dawud said: This tradition has been narrated in a similar way by Yahya b. Ayyub, Ibn Abu Ar-Rijal, from Yahya b. Sa'id, from 'Umrah from Umm Hisham hint Harithah b. al-Nu'man.",
      "chain": [
        "37534",
        "20201",
        "20160",
        "11062",
        "11455"
      ]
    },
    {
      "hadith_no": "1256",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن معين، حدثنا مروان بن معاوية، حدثنا يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، أن النبي صلى الله عليه وسلم قرأ في ركعتى الفجر ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Prophet (ﷺ) would recite in both rak'ahs of the dawn prayer: \"Say, O unbelievers\" and \"Say: He is Allah, the one\"",
      "chain": [
        "30020",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "1348",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا عمر بن عثمان، حدثنا مروان، - يعني ابن معاوية - عن بهز، حدثنا زرارة بن أوفى، عن عائشة أم المؤمنين، ‏:‏ أنها سئلت عن صلاة، رسول الله صلى الله عليه وسلم فقالت ‏:‏ كان يصلي بالناس العشاء، ثم يرجع إلى أهله فيصلي أربعا، ثم يأوي إلى فراشه، ثم ساق الحديث بطوله ولم يذكر ‏:‏ يسوي بينهن في القراءة والركوع والسجود ‏.‏ ولم يذكر في التسليم ‏:‏ حتى يوقظنا ‏.‏",
      "text_en": " Zurarah b. Awfa said that 'Aishah was asked about the prayer of the Messenger of Allah (ﷺ). She said:                      He used to lead the people in the 'Isha prayer and return to his family and pray four rak'ahs and go to his bed. The narrator then transmitted the tradition in full. This version does not mention the words: \"During them (the rak'ahs) he equated all the recitation of the Qur'an, bowing and recitation.\" This also does not mention the words about the salutation: \"Till he almost awakened us.\"",
      "chain": [
        "20201",
        "20214",
        "11284",
        "53"
      ]
    },
    {
      "hadith_no": "1609",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمود بن خالد الدمشقي، وعبد الله بن عبد الرحمن السمرقندي، قالا حدثنا مروان، قال عبد الله حدثنا أبو يزيد الخولاني، - وكان شيخ صدق وكان ابن وهب يروي عنه - حدثنا سيار بن عبد الرحمن، - قال محمود الصدفي - عن عكرمة، عن ابن عباس، قال فرض رسول الله صلى الله عليه وسلم زكاة الفطر طهرة للصائم من اللغو والرفث وطعمة للمساكين من أداها قبل الصلاة فهي زكاة مقبولة ومن أداها بعد الصلاة فهي صدقة من الصدقات ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) prescribed the sadaqah (alms) relating to the breaking of the fast as a purification of the fasting from empty and obscene talk and as food for the poor. If anyone pays it before the prayer (of 'Id), it will be accepted as zakat. If anyone pays it after the prayer, that will be a sadaqah like other sadaqahs (alms).",
      "chain": [
        "37534",
        "20201",
        "18",
        "26049",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1956",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الوهاب بن عبد الرحيم الدمشقي، حدثنا مروان، عن هلال بن عامر المزني، حدثني رافع بن عمرو المزني، قال رأيت رسول الله صلى الله عليه وسلم يخطب الناس بمنى حين ارتفع الضحى على بغلة شهباء وعلي - رضى الله عنه - يعبر عنه والناس بين قاعد وقائم ‏.‏",
      "text_en": " Narrated Rafi' ibn Amr al-Muzani:                     I saw the Messenger of Allah (ﷺ)  addressing the people at Mina (on the day of sacrifice) when the sun rose high (i.e. in the forenoon) on a white mule, and Ali (Allah be pleased with him) was interpreting on his behalf; some people were standing and some sitting.",
      "chain": [
        "20201",
        "15592",
        "3241"
      ]
    },
    {
      "hadith_no": "2371",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمود بن خالد، حدثنا مروان، حدثنا الهيثم بن حميد، أخبرنا العلاء بن الحارث، عن مكحول، عن أبي أسماء الرحبي، عن ثوبان، عن النبي صلى الله عليه وسلم قال ‏\"‏ أفطر الحاجم والمحجوم ‏\"‏ ‏.‏ قال أبو داود ورواه ابن ثوبان عن أبيه عن مكحول بإسناده مثله ‏.‏",
      "text_en": " Narrated Thawban:                     The Prophet (ﷺ) as saying: A man who cups and a man who gets himself cupped break their fast.Abu Dawud said: Ibn Thawban transmitted a similar tradition from his father on the authority of Makhul through an chain of narrators mentioned by him.",
      "chain": [
        "37534",
        "20201",
        "20744",
        "10884",
        "11066",
        "10883",
        "130"
      ]
    },
    {
      "hadith_no": "2493",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن بكار العيشي، حدثنا مروان، ح حدثنا عبد الوهاب بن عبد الرحيم الجوبري الدمشقي، - المعنى - قال حدثنا مروان، أخبرنا هلال بن ميمون الرملي، عن يعلى بن شداد، عن أم حرام، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ المائد في البحر الذي يصيبه القىء له أجر شهيد والغرق له أجر شهيدين ‏\"‏ ‏.‏",
      "text_en": " Umm Haram reported the Prophet(ﷺ) as saying “He who becomes sick on a stormy sea and vomits will have the reward of a martyr. And he who is drowned will have a reward of two martyrs.",
      "chain": [
        "30512",
        "20201",
        "20201",
        "15594"
      ]
    },
    {
      "hadith_no": "2546",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا موسى بن مروان الرقي، حدثنا مروان بن معاوية، عن أبي حيان التيمي، حدثنا أبو زرعة، عن أبي هريرة، ‏:‏ أن رسول الله صلى الله عليه وسلم كان يسمي الأنثى من الخيل فرسا ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Messenger of Allah (ﷺ) used to name a mare a horse.",
      "chain": [
        "35154",
        "20201",
        "11404",
        "30554"
      ]
    },
    {
      "hadith_no": "2693",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن أبي مريم، حدثنا عمي، - يعني سعيد بن الحكم - قال أخبرنا الليث بن سعد، عن عقيل، عن ابن شهاب، قال وذكر عروة بن الزبير أن مروان، والمسور بن مخرمة، أخبراه أن رسول الله صلى الله عليه وسلم قال حين جاءه وفد هوازن مسلمين فسألوه أن يرد إليهم أموالهم فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ معي من ترون وأحب الحديث إلى أصدقه فاختاروا إما السبى وإما المال ‏\"‏ ‏.‏ فقالوا نختار سبينا فقام رسول الله صلى الله عليه وسلم فأثنى على الله ثم قال ‏\"‏ أما بعد فإن إخوانكم هؤلاء جاءوا تائبين وإني قد رأيت أن أرد إليهم سبيهم فمن أحب منكم أن يطيب ذلك فليفعل ومن أحب منكم أن يكون على حظه حتى نعطيه إياه من أول ما يفيء الله علينا فليفعل ‏\"‏ ‏.‏ فقال الناس قد طيبنا ذلك لهم يا رسول الله ‏.‏ فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ إنا لا ندري من أذن منكم ممن لم يأذن فارجعوا حتى يرفع إلينا عرفاؤكم أمركم ‏\"‏ ‏.‏ فرجع الناس فكلمهم عرفاؤهم فأخبروهم أنهم قد طيبوا وأذنوا ‏.‏",
      "text_en": " Marwan and Al Miswar bin Makhramah told that when the deputation of the Hawazin came to the Muslims and asked the Apostle of Allaah(ﷺ) to return to them their property, the Apostle of Allaah(ﷺ) said to them “with me are those whom you see”. The speech dearest to me is the one which is true, so choose (one of the two) either the captives or the property. They said “We choose our captives. The Apostle of Allaah(ﷺ) stood up, extolled Allaah and then said “To proceed, your brethren have come repentant I have considered that I should return their captives to them, so let those of you who are willing to release the captives act accordingly, but those who wish to hold on to what they have till we give them some of the first booty Allaah gives us may do so. The people said “We are willing for that (to release their captives), Apostle of Allaah. The Apostle of Allaah(ﷺ) said “We cannot distinguish between those of you who have granted that and those who have not , so return till your headmen may tell us about your affair. The people then returned and their headmen spoke to them, then they informed that they were agreeable and had given their permission.",
      "chain": [
        "20023",
        "11207",
        "11013",
        "10511",
        "20201",
        "2201"
      ]
    },
    {
      "hadith_no": "4279",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Promised Deliverer (Kitab Al-Mahdi) - كتاب المهدى",
      "chapter_no": "38",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا مروان بن معاوية، عن إسماعيل، - يعني ابن أبي خالد - عن أبيه، عن جابر بن سمرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يزال هذا الدين قائما حتى يكون عليكم اثنا عشر خليفة كلهم تجتمع عليه الأمة ‏\"‏ ‏.‏ فسمعت كلاما من النبي صلى الله عليه وسلم لم أفهمه قلت لأبي ما يقول قال ‏\"‏ كلهم من قريش ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir ibn Samurah:                     The Prophet (ﷺ) said: The religion will continue to be established till there are twelve caliphs over you, and the whole community will agree on each of them. I then heard from the Prophet (ﷺ) some remarks which I could not understand. I asked my father: What is he saying: He said: all of them will belong to Quraysh.",
      "chain": [
        "10581",
        "20201",
        "11418",
        "19253",
        "393"
      ]
    },
    {
      "hadith_no": "4818",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن عيسى بن الطباع، وكثير بن عبيد، قالا حدثنا مروان، - قال ابن عيسى قال - حدثنا حميد، عن أنس، قال جاءت امرأة إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن لي إليك حاجة ‏.‏ فقال لها ‏\"‏ يا أم فلان اجلسي في أى نواحي السكك شئت حتى أجلس إليك ‏\"‏ ‏.‏ قال فجلست فجلس النبي صلى الله عليه وسلم إليها حتى قضت حاجتها ‏.‏ ولم يذكر ابن عيسى حتى قضت حاجتها ‏.‏ وقال كثير عن حميد عن أنس ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     A woman came to the Messenger of Allah (ﷺ) and said: Messenger of Allah: I have some need with you. He said to her: Mother of so and so, sit in the corner of any street you wish and I shall sit with you. So she sat and the Messenger of Allah (ﷺ) also sat with her till she fulfilled her need.The narrator Ibn 'Isa did not mention \"till she fulfilled her need.\" And Kathir said: from Humaid on the authority of Anas.",
      "chain": [
        "36649",
        "38462",
        "20201",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "5251",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا مروان بن معاوية، عن موسى الطحان، قال حدثنا عبد الرحمن بن سابط، عن العباس بن عبد المطلب، أنه قال لرسول الله صلى الله عليه وسلم إنا نريد أن نكنس زمزم وإن فيها من هذه الجنان - يعني الحيات الصغار - فأمر النبي صلى الله عليه وسلم بقتلهن ‏.‏",
      "text_en": " Narrated Al-Abbas ibn AbdulMuttalib:                     Al-Abbas said to the Messenger of Allah (ﷺ): We wish to sweep out Zamzam, but in it there are some of these Jinnan, meaning small snakes; so the Messenger of Allah (ﷺ) ordered that they should be killed.",
      "chain": [
        "30242",
        "20201",
        "10646",
        "100"
      ]
    },
    {
      "hadith_no": "5271",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا سليمان بن عبد الرحمن الدمشقي، وعبد الوهاب بن عبد الرحيم الأشجعي، قالا حدثنا مروان، حدثنا محمد بن حسان، - قال عبد الوهاب الكوفي - عن عبد الملك بن عمير، عن أم عطية الأنصارية، أن امرأة، كانت تختن بالمدينة فقال لها النبي صلى الله عليه وسلم ‏\"‏ لا تنهكي فإن ذلك أحظى للمرأة وأحب إلى البعل ‏\"‏ ‏.‏ قال أبو داود روي عن عبيد الله بن عمرو عن عبد الملك بمعناه وإسناده ‏.‏ قال أبو داود ليس هو بالقوي وقد روي مرسلا ‏.‏ قال أبو داود ومحمد بن حسان مجهول وهذا الحديث ضعيف ‏.‏",
      "text_en": " Narrated Umm Atiyyah al-Ansariyyah:                     A woman used to perform circumcision in Medina. The Prophet (ﷺ) said to her: Do not cut severely as that is better for a woman and more desirable for a husband.Abu Dawud said: It has been transmitted by 'Ubaid Allah b. 'Amr from 'Abd al-Malik to the same effect through a different chain.Abu Dawud said: It is not a strong tradition. It has been transmitted in mursal form (missing the link of the Companions)Abu Dawud said: Muhammad b. Hasan is obscure, and this tradition is weak.",
      "chain": [
        "30587",
        "37522",
        "20201",
        "18899",
        "11368",
        "71"
      ]
    },
    {
      "hadith_no": "83",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "وروى أبو أسامة، وغير، واحد، هذا الحديث عن هشام بن عروة، عن أبيه، عن مروان، عن بسرة، عن النبي صلى الله عليه وسلم نحوه ‏.‏ حدثنا بذلك، إسحاق بن منصور حدثنا أبو أسامة، بهذا ‏.‏",
      "text_en": " Busrah narrated :                     a similar report (as no. 82) from the Prophet.",
      "chain": [
        "11065",
        "10511",
        "20201",
        "861"
      ]
    },
    {
      "hadith_no": "173",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا مروان بن معاوية الفزاري، عن أبي يعفور، عن الوليد بن العيزار، عن أبي عمرو الشيباني، أن رجلا، قال لابن مسعود أى العمل أفضل قال سألت عنه رسول الله صلى الله عليه وسلم فقال ‏\"‏ الصلاة على مواقيتها ‏\"‏ ‏.‏ قلت وماذا يا رسول الله قال ‏\"‏ وبر الوالدين ‏\"‏ ‏.‏ قلت وماذا يا رسول الله قال ‏\"‏ والجهاد في سبيل الله ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح ‏.‏ وقد روى المسعودي وشعبة وسليمان هو أبو إسحاق الشيباني وغير واحد عن الوليد بن العيزار هذا الحديث ‏.‏",
      "text_en": " Abu Amr Ash-Shaibani narrated:                     \"A man said to Ibn Mas'ud: 'Which deed is most virtuous?' He said: 'I asked Allah's Messenger (that). He said: \"Salat at the beginning of its time.\" I asked him: \"What is after that O Messenger of Allah?\" He said: \"Being dutiful to one's parents.\" I said: \"What is after that [O Messenger of Allah]?\" He said: \"Jihad in the Way of Allah.\"",
      "chain": [
        "30367",
        "20201",
        "11403",
        "11663",
        "11343"
      ]
    },
    {
      "hadith_no": "299",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد بن السري، حدثنا مروان بن معاوية الفزاري، وأبو معاوية عن عاصم الأحول، بهذا الإسناد نحوه وقال ‏\"‏ تباركت يا ذا الجلال والإكرام ‏\"‏ ‏.‏ قال وفي الباب عن ثوبان وابن عمر وابن عباس وأبي سعيد وأبي هريرة ‏.‏ والمغيرة بن شعبة ‏.‏ قال أبو عيسى حديث عائشة حديث حسن صحيح ‏.‏ وقد روى خالد الحذاء هذا الحديث من حديث عائشة عن عبد الله بن الحارث نحو حديث عاصم ‏.‏ وقد روي عن النبي صلى الله عليه وسلم أنه كان يقول بعد التسليم ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد يحيي ويميت وهو على كل شيء قدير اللهم لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد ‏\"‏ ‏.‏ وروي عنه أنه كان يقول ‏\"‏ سبحان ربك رب العزة عما يصفون وسلام على المرسلين والحمد لله رب العالمين ‏\"‏ ‏.‏",
      "text_en": " Aishah narrated:                     (Another chain) which is similar, but he said: (Tabarakta ya dhal-jalali wal-ikram) \"Blessed are You, O Possessor of Majesty and Honor.\"",
      "chain": [
        "30480",
        "20201",
        "20354",
        "11080"
      ]
    },
    {
      "hadith_no": "376",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا مروان بن معاوية الفزاري، عن حميد، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ والله إني لأسمع بكاء الصبي وأنا في الصلاة فأخفف مخافة أن تفتتن أمه ‏\"‏ ‏.‏ قال وفي الباب عن أبي قتادة وأبي سعيد وأبي هريرة ‏.‏ قال أبو عيسى حديث أنس حديث حسن صحيح ‏.‏",
      "text_en": " Anas bin Malik narrated that:                     Allah's Messenger said: \"Indeed I hear the crying of a small boy while I am in Salat, so I shorten it in fear that his mother may be tormented.\"",
      "chain": [
        "30367",
        "20201",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "903",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا مروان بن معاوية، عن أيمن بن نابل، عن قدامة بن عبد الله، قال رأيت النبي صلى الله عليه وسلم يرمي الجمار على ناقة ليس ضرب ولا طرد ولا إليك إليك ‏.‏ قال وفي الباب عن عبد الله بن حنظلة ‏.‏ قال أبو عيسى حديث قدامة بن عبد الله حديث حسن صحيح ‏.‏ وإنما يعرف هذا الحديث من هذا الوجه وهو حديث أيمن بن نابل وهو ثقة عند أهل الحديث ‏.‏",
      "text_en": " Qudamah bin Abdullah said:                     \"I saw the Prophet stoning the Jimar upon his she-camel; there was no hitting, nor crowding, nor: 'Look out! Look out!'\"",
      "chain": [
        "30242",
        "20201",
        "11555"
      ]
    },
    {
      "hadith_no": "1000",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا قران بن تمام الأسدي، ومروان بن معاوية، ويزيد بن هارون، عن سعيد بن عبيد الطائي، عن علي بن ربيعة الأسدي، قال مات رجل من الأنصار يقال له قرظة بن كعب فنيح عليه فجاء المغيرة بن شعبة فصعد المنبر فحمد الله وأثنى عليه وقال ما بال النوح في الإسلام أما إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من نيح عليه عذب بما نيح عليه ‏\"‏ ‏.‏ وفي الباب عن عمر وعلي وأبي موسى وقيس بن عاصم وأبي هريرة وجنادة بن مالك وأنس وأم عطية وسمرة وأبي مالك الأشعري ‏.‏ قال أبو عيسى حديث المغيرة حديث غريب حسن صحيح ‏.‏",
      "text_en": " Ali bin Rabi'ah Al-Asadi said:                     \"A man died among the Ansar named Qarazah bin Ka'b, and he was being wailed over. So Al-Mughirah bin Shu'bah came and ascended the Minbar. He uttered thanks and praise to Allah and said: \"As for the gravity of wailing in Islam, indeed I heard the Messenger of Allah saying: 'The one who is wailed over is punished as long as he is being wailed over.'\"",
      "chain": [
        "30242",
        "25244",
        "20201",
        "20472",
        "11629",
        "11376"
      ]
    },
    {
      "hadith_no": "1229",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني، أنبأنا مروان بن معاوية الفزاري، عن عطاء بن عجلان، عن عكرمة بن خالد المخزومي، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كل طلاق جائز إلا طلاق المعتوه المغلوب على عقله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث لا نعرفه مرفوعا إلا من حديث عطاء بن عجلان ‏.‏ وعطاء بن عجلان ضعيف ذاهب الحديث ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أن طلاق المعتوه المغلوب على عقله لا يجوز إلا أن يكون معتوها يفيق الأحيان فيطلق في حال إفاقته ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     The Messenger of Allah said: \"Every divorce is valid except the divorce of the Ma'tuh person whose reason is overcome.\" (Da'if Jiddan)",
      "chain": [
        "20201",
        "14272",
        "11709",
        "13"
      ]
    },
    {
      "hadith_no": "2467",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Witnesses - كتاب الشهادات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "35",
      "text_ar": "حدثنا قتيبة، حدثنا مروان بن معاوية الفزاري، عن يزيد بن زياد الدمشقي، عن الزهري، عن عروة، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تجوز شهادة خائن ولا خائنة ولا مجلود حدا ولا مجلودة ولا ذي غمر لأخيه ولا مجرب شهادة ولا القانع أهل البيت لهم ولا ظنين في ولاء ولا قرابة ‏\"‏ ‏.‏ قال الفزاري القانع التابع ‏.‏ هذا حديث غريب لا نعرفه إلا من حديث يزيد بن زياد الدمشقي ‏.‏ ويزيد يضعف في الحديث ولا يعرف هذا الحديث من حديث الزهري إلا من حديثه ‏.‏ وفي الباب عن عبد الله بن عمرو ‏.‏ قال ولا نعرف معنى هذا الحديث ولا يصح عندي من قبل إسناده ‏.‏ والعمل عند أهل العلم في هذا أن شهادة القريب جائزة لقرابته ‏.‏ واختلف أهل العلم في شهادة الوالد للولد والولد لوالده ولم يجز أكثر أهل العلم شهادة الوالد للولد ولا الولد للوالد ‏.‏ وقال بعض أهل العلم إذا كان عدلا فشهادة الوالد للولد جائزة وكذلك شهادة الولد للوالد ‏.‏ ولم يختلفوا في شهادة الأخ لأخيه أنها جائزة وكذلك شهادة كل قريب لقريبه ‏.‏ وقال الشافعي لا تجوز شهادة لرجل على الآخر وإن كان عدلا إذا كانت بينهما عداوة ‏.‏ وذهب إلى حديث عبد الرحمن الأعرج عن النبي صلى الله عليه وسلم مرسلا ‏\"‏ لا تجوز شهادة صاحب إحنة ‏\"‏ ‏.‏ يعني صاحب عداوة وكذلك معنى هذا الحديث حيث قال ‏\"‏ لا تجوز شهادة صاحب غمر لأخيه ‏\"‏ يعني صاحب عداوة ‏.‏",
      "text_en": " Aishah narrated that the Messenger of Allah (s.a.w) said:                     The testimony of a treacherous man is not acceptable nor a treacherous woman nor a man lashed for the Hadd nor a woman lashed nor one possessing malice of enmity nor a rehearsed witness nor the Qani of (one contracted by)the family on their behalf nor the one associating himself to other than his Wala or to other than his  relatives.\"",
      "chain": [
        "30367",
        "20201",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2468",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Witnesses - كتاب الشهادات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "35",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا مروان بن معاوية، عن سفيان بن زياد الأسدي، عن فاتك بن فضالة، عن أيمن بن خريم، أن النبي صلى الله عليه وسلم قام خطيبا فقال ‏\"‏ يا أيها الناس عدلت شهادة الزور إشراكا بالله ‏\"‏ ‏.‏ ثم قرأ رسول الله صلى الله عليه وسلم ‏:‏ ‏(‏واجتنبوا الرجس من الأوثان واجتنبوا قول الزور ‏)‏ ‏.‏ قال أبو عيسى وهذا حديث غريب إنما نعرفه من حديث سفيان بن زياد واختلفوا في رواية هذا الحديث عن سفيان بن زياد ‏.‏ ولا نعرف لأيمن بن خريم سماعا من النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Ayman bin Khuraim narrated that the Prophet (s.a.w) stood to give a Khutbah and said:                     \"O you people False witness  is tantamount to Shirk with Allah\" Then the Messenger of Allah (s.a.w)recited: So shun the Rijs of the idols, and shun false speech.",
      "chain": [
        "30242",
        "20201",
        "11632",
        "15445"
      ]
    },
    {
      "hadith_no": "2346",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا عمرو بن مالك ومحمود بن خداش البغدادي قالا حدثنا مروان بن معاوية حدثنا عبد الرحمن بن أبي شميلة الأنصاري عن سلمة بن عبيد الله بن محصن الخطمي عن أبيه وكانت له صحبة قال  قال رسول الله صلى الله عليه وسلم من أصبح منكم آمنا في سربه معافى في جسده عنده قوت يومه فكأنما حيزت له الدنيا  قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث مروان بن معاوية وحيزت جمعت حدثنا بذلك محمد بن إسمعيل حدثنا الحميدي حدثنا مروان بن معاوية نحوه وفي الباب عن أبي الدرداء",
      "text_en": " Salamah bin 'Ubaidullah bin Mihsan Al-Khatmi narrated from his father -and he was a Companion- who said:                      \"The Messenger of Allah (s.a.w) said:\"Whoever among you wakes up in the morning secured in his dwelling, healthy in his body, having his food for the day,then it is as if the world has been gathered for him.'\"",
      "chain": [
        "20201",
        "22119"
      ]
    },
    {
      "hadith_no": "2677",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا محمد بن عيينة، عن مروان بن معاوية الفزاري، عن كثير بن عبد الله، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال لبلال بن الحارث ‏\"‏ اعلم ‏\"‏ ‏.‏ قال ما أعلم يا رسول الله قال ‏\"‏ اعلم يا بلال ‏\"‏ ‏.‏ قال ما أعلم يا رسول الله قال ‏\"‏ أنه من أحيا سنة من سنتي قد أميتت بعدي فإن له من الأجر مثل من عمل بها من غير أن ينقص من أجورهم شيئا ومن ابتدع بدعة ضلالة لا يرضاها الله ورسوله كان عليه مثل آثام من عمل بها لا ينقص ذلك من أوزار الناس شيئا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ ومحمد بن عيينة هو مصيصي شامي وكثير بن عبد الله هو ابن عمرو بن عوف المزني ‏.‏",
      "text_en": " Narrated Narrated Kathir bin 'Abdullah [and he is Ibn 'Amr bin 'Awf Al-Musani]:                     narrated from his father, from his grandfather that the Prophet (ﷺ) said to Bilal bin Al-Harith: \"Know.\" He said: \"I am ready to know O Messenger of Allah!\" He (ﷺ) said: \"That indeed whoever revives a Sunnah from my Sunnah which has died after me, then for him is a reward similar to whoever acts upon it without diminishing anything from their rewards. And whoever introduces an erroneous innovation which Allah is not pleased with, nor His Messenger, then he shall receive sins similar to whoever acts upon it, without that diminishing anything from the sins of the people.'\"",
      "chain": [
        "30025",
        "38569",
        "20201",
        "22172"
      ]
    },
    {
      "hadith_no": "3253",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا مروان بن معاوية، ويزيد بن هارون، ومحمد بن عبيد، عن إسماعيل بن أبي خالد، عن الحارث بن شبيل، عن أبي عمرو الشيباني، عن زيد بن أرقم، قال كنا نتكلم على عهد رسول الله صلى الله عليه وسلم في الصلاة فنزلت ‏:‏ ‏(‏وقوموا لله قانتين ‏)‏ فأمرنا بالسكوت ‏.‏",
      "text_en": " Narrated Zaid bin Arqam:                     \"During the time of the Messenger of Allah (ﷺ), we would talk during Salat, so 'And stand before Allah with obedience (2:238) was revealed, ordering us to be silent.\"",
      "chain": [
        "30242",
        "20201",
        "20472",
        "30213",
        "11418",
        "11681",
        "11343",
        "384"
      ]
    },
    {
      "hadith_no": "3372",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا مروان بن معاوية، عن الأعمش، عن ذر، عن يسيع، عن النعمان بن بشير، عن النبي صلى الله عليه وسلم قال ‏\"‏ الدعاء هو العبادة ‏\"‏ ‏.‏ ثم قرأ ‏:‏ ‏(‏وقال ربكم ادعوني أستجب لكم إن الذين يستكبرون عن عبادتي سيدخلون جهنم داخرين ‏)‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ وقد رواه منصور والأعمش عن ذر ولا نعرفه إلا من حديث ذر ‏.‏ هو ذر بن عبد الله الهمداني ثقة والد عمر بن ذر ‏.‏",
      "text_en": " An-Nu’man bin Bashir narrated that:                     The Prophet said: “The supplication, is worship.” Then he recited: And Your Lord said: “Call upon me, I will respond to you. Verily, those who scorn My worship, they will surely enter Hell humiliated.",
      "chain": [
        "30242",
        "20201",
        "11060",
        "11423",
        "19885",
        "274"
      ]
    },
    {
      "hadith_no": "850",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا مروان بن معاوية، قال حدثنا عبيد الله بن عبد الله بن الأصم، عن عمه، يزيد بن الأصم عن أبي هريرة، قال جاء أعمى إلى رسول الله صلى الله عليه وسلم فقال إنه ليس لي قائد يقودني إلى الصلاة فسأله أن يرخص له أن يصلي في بيته فأذن له فلما ولى دعاه قال له ‏\"‏ أتسمع النداء بالصلاة ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فأجب ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"A blind man came to the Messenger of Allah (ﷺ)and said: 'I do not have a guide to bring me to the prayer.' And he asked him to grant him a dispensation allowing him to pray in his house, and he gave him permission. Then when he turned away he said to him: 'Can you hear the call to prayer?' He said: 'Yes.' He said: 'Then respond to it.\"'",
      "chain": [
        "30123",
        "20201",
        "10946",
        "10842",
        "13"
      ]
    },
    {
      "hadith_no": "944",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرني عمران بن يزيد، قال حدثنا مروان بن معاوية الفزاري، قال حدثنا عثمان بن حكيم، قال أخبرني سعيد بن يسار، أن ابن عباس، أخبره أن رسول الله صلى الله عليه وسلم كان يقرأ في ركعتى الفجر في الأولى منهما الآية التي في البقرة ‏{‏ قولوا آمنا بالله وما أنزل إلينا ‏}‏ إلى آخر الآية وفي الأخرى ‏{‏ آمنا بالله واشهد بأنا مسلمون ‏}.‏",
      "text_en": " Ibn Abbad narrated that:                     The Messenger of Allah (ﷺ) used to recite in teh first rak'ah of Fajr \"Say: We believe in Allah and that which has been sent down to us\" to the end verse, and in the second rak'ah, \"We believe in Allah, and bear witness that we are Muslims.\"",
      "chain": [
        "20201",
        "11889",
        "11170",
        "17"
      ]
    },
    {
      "hadith_no": "945",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا عبد الرحمن بن إبراهيم، دحيم قال حدثنا مروان، قال حدثنا يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قرأ في ركعتى الفجر ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah (ﷺ) recited: \"Say: O you disbelievers\" and \"Say: He is Allah, (the) One\" in the two rak'ahs of Fajr.",
      "chain": [
        "30285",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "1147",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا عبد الرحمن بن إبراهيم، دحيم قال حدثنا مروان بن معاوية، قال حدثنا عبيد الله بن عبد الله بن الأصم، قال حدثني يزيد بن الأصم، عن ميمونة، قالت كان رسول الله صلى الله عليه وسلم إذا سجد خوى بيديه حتى يرى وضح إبطيه من ورائه وإذا قعد اطمأن على فخذه اليسرى ‏.‏",
      "text_en": " It was narrated that Maimunah said:                     \"When the Messenger of Allah (ﷺ) prostrated, he would hold his arms out to his sides, so that the whiteness of his armpits could be seen from behind. And when he sat he rested on his left thigh.\"",
      "chain": [
        "30285",
        "20201",
        "10946",
        "10842",
        "61"
      ]
    },
    {
      "hadith_no": "1479",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرني محمود بن خالد، عن مروان، قال حدثني معاوية بن سلام، قال حدثنا يحيى بن أبي كثير، عن أبي سلمة بن عبد الرحمن، عن عبد الله بن عمرو، قال خسفت الشمس على عهد رسول الله صلى الله عليه وسلم فأمر فنودي الصلاة جامعة فصلى رسول الله صلى الله عليه وسلم بالناس ركعتين وسجدة ثم قام فصلى ركعتين وسجدة ‏.‏ قالت عائشة ما ركعت ركوعا قط ولا سجدت سجودا قط كان أطول منه ‏.‏ خالفه محمد بن حمير ‏.‏",
      "text_en": " It was narrated that Abdullah bin 'Amr said:                     \"The sun was eclipsed during the time of the Messenger of Allah (ﷺ), so he issued orders that the call be given: 'As-salatu jam'iah. The Messenger of Allah (ﷺ) led the people in prayer, bowing twice and prostrating twice. Then he stood and prayed, bowing twice and prostrating once. 'Aishah said: 'I never bowed or prostrated for so long as that.'\"",
      "chain": [
        "37534",
        "20201",
        "20401",
        "11449",
        "10567",
        "29"
      ]
    },
    {
      "hadith_no": "1815",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمود بن خالد، عن مروان بن محمد، قال حدثنا سعيد بن عبد العزيز، عن سليمان بن موسى، عن مكحول، عن عنبسة بن أبي سفيان، عن أم حبيبة، - قال مروان وكان سعيد إذا قرئ عليه عن أم حبيبة عن النبي صلى الله عليه وسلم أقر بذلك ولم ينكره وإذا حدثنا به هو لم يرفعه - قالت من ركع أربع ركعات قبل الظهر وأربعا بعدها حرمه الله على النار ‏.‏ قال أبو عبد الرحمن مكحول لم يسمع من عنبسة شيئا ‏.‏",
      "text_en": " It was narrated from Umm Habibah-and when this was narrated to Sa'eed from Umm Habibah from the Prophet (ﷺ), he would approve it and not deny it but when he narrated it to us, he did not attribute it to the Prophet (ﷺ)- she said:                     \"Whoever prays four rak'ahs before Zuhr and four after it, Allah (SWT) will forbid him from the Fire.\"",
      "chain": [
        "37534",
        "20640",
        "20638",
        "10880",
        "11066",
        "846",
        "59",
        "20201",
        "59"
      ]
    },
    {
      "hadith_no": "1920",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرني أيوب بن محمد الوزان، قال حدثنا مروان، قال حدثنا عثمان بن حكيم، قال أخبرني خارجة بن زيد بن ثابت، عن عمه، يزيد بن ثابت أنهم كانوا جلوسا مع النبي صلى الله عليه وسلم فطلعت جنازة فقام رسول الله صلى الله عليه وسلم وقام من معه فلم يزالوا قياما حتى نفذت ‏.‏",
      "text_en": " It was narrated form Yazid bin Thabit:                     That they were sitting with the Messenger of Allah when a funeral appeared. The Messenger of Allah stood up, and those who were with him stood up, until it had passed by.",
      "chain": [
        "38120",
        "20201",
        "11889",
        "11006"
      ]
    },
    {
      "hadith_no": "2207",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني محمود بن خالد، عن مروان، أنبأنا معاوية بن سلام، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قام شهر رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه ومن قام ليلة القدر إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'Whoever spends the nights of Ramadan in prayer (Qiyam) out of faith and in the hope of reward, he will be forgiven his previous sins, and whoever spends the night of Lailat Al-Qadr in prayer out of faith and in the hope of reward, he will be forgiven his previous sins.\"'",
      "chain": [
        "37534",
        "20201",
        "20401",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2312",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني أيوب بن محمد، قال حدثنا مروان، قال حدثنا عاصم، عن أبي نضرة المنذر، عن أبي سعيد، وجابر بن عبد الله، أنهما سافرا مع رسول الله صلى الله عليه وسلم فيصوم الصائم ويفطر المفطر ولا يعيب الصائم على المفطر ولا المفطر على الصائم ‏.‏",
      "text_en": " It was narrated from Abu Saeed and Jabir bin 'Abdullah:                     That they traveled with the Messenger of Allah. Some fasted and some did not, and those who were fasting did not criticize those who were not, and those who were not fasting did not criticize those who were.",
      "chain": [
        "20201",
        "11080",
        "38"
      ]
    },
    {
      "hadith_no": "2723",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا أبو عامر، قال حدثنا شعبة، عن الحكم، قال سمعت علي بن حسين، يحدث عن مروان، أن عثمان، نهى عن المتعة، وأن يجمع الرجل بين الحج والعمرة فقال علي لبيك بحجة وعمرة معا ‏.‏ فقال عثمان أتفعلها وأنا أنهى عنها فقال علي لم أكن لأدع سنة رسول الله صلى الله عليه وسلم لأحد من الناس ‏.‏",
      "text_en": " It was narrated that Al-Hakam said:                     \"I heard 'Ali binHusain narrating from Marwan, that 'Uthman forbade Mut'ah and joining Hajj and \"Umrah. 'Ali said; 'Labbaika bi Hajjatin wa 'Umratin ma'an Here I am, (O Allah) for Hajj and \"Umrah together. 'Uthman said: 'Are you doing this when I have forbidden it?' 'Ali said; 'I will not give up the Summah of the Messenger of Allah for any of the people.'''",
      "chain": [
        "30123",
        "20443",
        "20020",
        "11069",
        "11045",
        "20201"
      ]
    },
    {
      "hadith_no": "3234",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا عبد الرحمن بن إبراهيم، قال حدثنا مروان، قال حدثنا يزيد، - وهو ابن كيسان - عن أبي حازم، عن أبي هريرة، قال خطب رجل امرأة من الأنصار فقال له رسول الله صلى الله عليه وسلم ‏\"‏ هل نظرت إليها ‏\"‏ ‏.‏ قال لا ‏.‏ فأمره أن ينظر إليها ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     It was narrated that Abu Hurairah said: \"A man proposed to a woman from among the Ansar and the Messenger of Allah said to him: 'Have you seen her?' He said: 'No.' So he told him to look at her.\"",
      "chain": [
        "30285",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "3455",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا أحمد بن عبد الله بن الحكم البصري، قال حدثنا مروان بن معاوية، قال حدثنا أبو يعفور، عن أبي الضحى، قال تذاكرنا الشهر عنده فقال بعضنا ثلاثين ‏.‏ وقال بعضنا تسعا وعشرين ‏.‏ فقال أبو الضحى حدثنا ابن عباس قال أصبحنا يوما ونساء النبي صلى الله عليه وسلم يبكين عند كل امرأة منهن أهلها فدخلت المسجد فإذا هو ملآن من الناس - قال - فجاء عمر رضى الله عنه فصعد إلى النبي صلى الله عليه وسلم وهو في علية له فسلم عليه فلم يجبه أحد ثم سلم فلم يجبه أحد ثم سلم فلم يجبه أحد فرجع فنادى بلالا فدخل على النبي صلى الله عليه وسلم فقال أطلقت نساءك فقال ‏\"‏ لا ولكني آليت منهن شهرا ‏\"‏ ‏.‏ فمكث تسعا وعشرين ثم نزل فدخل على نسائه ‏.‏",
      "text_en": " Ibn 'Abbas said:                      \"One morning, we saw the wives of the Prophet weeping, and each one of them had her family with her. I entered the Masjid and found it filled with people. Then 'Umar, may Allah be pleased with him, came, and went to the Prophet who was in his room. He greeted him with the Salam but no one answered. He greeted him again but no one answered. He greeted him (a third time) but no one answered. So he went back and called out: 'Bilal!' He came to the Prophet and said: 'Have you divorced your wives?' He said: 'No, but I have sworn an oath of abstention from them for a month.' So he stayed away from them for twenty-nine days, then he came and went into his wives.\"",
      "chain": [
        "20201",
        "11392",
        "17"
      ]
    },
    {
      "hadith_no": "4750",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا عبد الرحمن بن إبراهيم، دحيم قال حدثنا مروان، قال حدثنا الحسن، - وهو ابن عمرو - عن مجاهد، عن جنادة بن أبي أمية، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قتل قتيلا من أهل الذمة لم يجد ريح الجنة وإن ريحها ليوجد من مسيرة أربعين عاما ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     \"The Messenger of Allah said: 'Whoever kills a person from among Ahl Adh-Dhimmah, he will not smell the fragrance of Paradise, and its fragrance may be detected from a distance of forty years.\"",
      "chain": [
        "30285",
        "20201",
        "11624",
        "11028",
        "3205",
        "29"
      ]
    },
    {
      "hadith_no": "5170",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عبد الرحمن بن إبراهيم، دحيم قال حدثنا مروان، - هو ابن معاوية - قال حدثنا إسماعيل، - هو ابن سميع الحنفي - عن مالك بن عمير، قال جاء صعصعة بن صوحان إلى علي فقال انهنا عما نهاك عنه رسول الله صلى الله عليه وسلم ‏.‏ قال نهانا رسول الله صلى الله عليه وسلم عن الدباء والحنتم والنقير والجعة ونهانا عن حلقة الذهب ولبس الحرير ولبس القسي والميثرة الحمراء ‏.‏",
      "text_en": " It was narrated that Malik bin 'Umair said:                     \"Sa'sa'ah bin Suwhan came to 'Ali and said: 'Forbid to us from that which the Messenger of Allah [SAW] forbade to you.' He said: 'He forbade us from Ad-Dubba', Al-Hantam, An-Naqir, Al-Ji'ah, and he forbade us from gold circles (rings), wearing silk, and wearing Al-Qassi, and red Al-Mitharah.'\"",
      "chain": [
        "30285",
        "20201",
        "10742",
        "15502"
      ]
    },
    {
      "hadith_no": "5530",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا محمد بن الخليل، قال حدثنا مروان، - هو ابن معاوية - عن علي بن عبد العزيز، عن عبادة بن مسلم الفزاري، عن جبير بن أبي سليمان، عن ابن عمر، قال كان النبي صلى الله عليه وسلم يقول ‏\"‏ اللهم ‏\"‏ ‏.‏ فذكر الدعاء وقال في آخره ‏\"‏ أعوذ بك أن أغتال من تحتي ‏\"‏ ‏.‏ يعني بذلك الخسف ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Prophet [SAW] used to say: 'Allahumma (O Allah,)' and he mentioned the supplication, and said at the end, 'A'udhu bika an ughtala min tahti (and I seek refuge with You from being swallowed up from beneath me.)'\"",
      "chain": [
        "20201",
        "25197",
        "19849",
        "18"
      ]
    },
    {
      "hadith_no": "522",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا عمرو بن عثمان بن سعيد بن كثير بن دينار الحمصي، حدثنا مروان بن معاوية، عن جعفر بن الزبير، عن القاسم، عن أبي أمامة، قال سئل رسول الله  صلى الله عليه وسلم  عن مس الذكر فقال ‏\"‏ إنما هو جزء منك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Umamah said:                     \"The Messenger of Allah was asked about touching the penis and he said: 'Rather it is a part of you (your body).'\"",
      "chain": [
        "10581",
        "20201",
        "10535",
        "405"
      ]
    },
    {
      "hadith_no": "1202",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، ويعقوب بن حميد بن كاسب، قالا حدثنا مروان بن معاوية، عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  قرأ في الركعتين قبل الفجر ‏{قل يا أيها الكافرون‏}‏ و ‏{قل هو الله أحد‏}‏",
      "text_en": " It wasnarrated from Abu Hurairah that in the two Rak’ah before theFajr,the Prophet (ﷺ) used to recite:                      “Say: ‘O you disbelievers!”[Al-Kafirun (109)] and “Say: Allah is One.” [Al-Ikhlas (112)]",
      "chain": [
        "30285",
        "32048",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "1210",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، ويعقوب بن حميد بن كاسب، قالا حدثنا مروان بن معاوية، عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  نام عن ركعتى الفجر فقضاهما بعد ما طلعت الشمس ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) slept andmissedthe two Rak’ah before Fajr, so he made them up after the sunhadrisen.",
      "chain": [
        "30285",
        "32048",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "2212",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا مروان بن معاوية، عن عبد الله بن عبد الرحمن الطائفي، عن ميمونة بنت كردم اليسارية، أن أباها، لقي النبي  صلى الله عليه وسلم  وهي رديفة له فقال إني نذرت أن أنحر ببوانة فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ هل بها وثن ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أوف بنذرك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Maimunah bint Kardam Al-Yasariyyah that :                     her father met the Prophet (ﷺ) when she was riding behind him. He said: \"I vowed to offer a sacrifice at Buwanah.\" The Messenger of Allah (ﷺ) said: \"Is there any idol there?\" He said: \"No.\" He said: \" Fulfill your vow.\" (Hasan)Another chain with similar wording.",
      "chain": [
        "30201",
        "20201",
        "20658",
        "4015"
      ]
    },
    {
      "hadith_no": "2325",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا عمرو بن رافع، حدثنا مروان بن معاوية، ح وحدثنا أحمد بن ثابت الجحدري، حدثنا صفوان بن عيسى، قالا حدثنا هاشم بن هاشم، عن عبد الله بن نسطاس، عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف بيمين آثمة عند منبري هذا فليتبوأ مقعده من النار ولو على سواك أخضر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir bin 'Abdullah that the Messenger of Allah (ﷺ) said:                     'Whoever swears a false oath near this pulpit of mine, let him take his place in Hell, even if it is for a green twig.”",
      "chain": [
        "18792",
        "20201",
        "34002",
        "20553",
        "11227",
        "12256",
        "34"
      ]
    },
    {
      "hadith_no": "2586",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا هشام بن عمار، وعمرو بن رافع، قالا حدثنا مروان بن معاوية، حدثنا أبو مالك النخعي، عن يوسف بن ميمون، عن أبي عبيدة بن حذيفة، عن أبيه، حذيفة بن اليمان قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من باع دارا ولم يجعل ثمنها في مثلها لم يبارك له فيها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hudhaifah bin Yaman that the Messenger of Allah (ﷺ) said:                     “Whoever sells a house and does not use the money for something similar, will  not to be blessed therein.' ”",
      "chain": [
        "30288",
        "18792",
        "20201",
        "28688",
        "15650",
        "15680"
      ]
    },
    {
      "hadith_no": "2679",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا الخليل بن عمرو، حدثنا مروان بن معاوية، حدثنا يزيد بن سنان الجزري، عن ميمون بن مهران، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أتي عند ماله فقوتل فقاتل فقتل فهو شهيد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn `Umar that the Messenger of Allah (ﷺ) said:                     “If a man's property is targeted, and he is fought and fights back and is killed, he is a martyr.”",
      "chain": [
        "36552",
        "20201",
        "28643",
        "11012",
        "18"
      ]
    },
    {
      "hadith_no": "2718",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا عمرو بن رافع، حدثنا مروان بن معاوية، حدثنا يزيد بن زياد، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أعان على قتل مؤمن بشطر كلمة لقي الله عز وجل مكتوب بين عينيه آيس من رحمة الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     “Whoever helps to kill a believer, even with half a world, he will meet Allah (SWT) with (the words) written between his eyes, 'He has no hope of the mercy of Allah (SWT).”",
      "chain": [
        "18792",
        "20201",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "3008",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا هشام بن عمار، حدثنا مروان بن معاوية، ح وحدثنا علي بن محمد، وعمرو بن عبد الله، قالا حدثنا وكيع، حدثنا إبراهيم بن يزيد المكي، عن محمد بن عباد بن جعفر المخزومي، عن ابن عمر، قال قام رجل إلى النبي  صلى الله عليه وسلم  فقال يا رسول الله ما يوجب الحج قال ‏\"‏ الزاد والراحلة ‏\"‏ ‏.‏ قال يا رسول الله فما الحاج قال ‏\"‏ الشعث التفل ‏\"‏ ‏.‏ وقام آخر فقال يا رسول الله وما الحج قال ‏\"‏ العج والثج ‏\"‏ ‏.‏ قال وكيع يعني بالعج العجيج بالتلبية والثج نحر البدن ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “A man stood up and said to theProphet (ﷺ): ‘O Messenger of Allah! What makes Hajj obligatory?’Hesaid: ‘Provision and a mount.’ He said: ‘O Messenger ofAllah, what isthe (real) Hajj?’ He said: ‘The one withdishevelled hair and noperfume.’ Another (man) stood up and said:‘O Messenger of Allah, whatis the (real) Hajj?’ He said:‘Raising one’s voice and slaughteringthe sacrificial animal.’”",
      "chain": [
        "30288",
        "20201",
        "38409",
        "20032",
        "11322",
        "30377",
        "18"
      ]
    },
    {
      "hadith_no": "3205",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن موسى القطان الواسطي، حدثنا يزيد بن موهب، حدثنا مروان بن معاوية الفزاري، حدثنا علي بن عبد العزيز، حدثنا حسين المعلم، عن أبي المهزم، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال في بيض النعام يصيبه المحرم ‏\"‏ ثمنه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said,concerning an ostrich egg taken by a Muhrim:                      “Its cost (must bepaid as a penalty).”",
      "chain": [
        "20201",
        "25197",
        "11278",
        "13"
      ]
    },
    {
      "hadith_no": "3300",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو كريب، حدثنا مروان بن معاوية، حدثنا هلال بن ميمون الجهني، عن عطاء بن يزيد الليثي، - قال عطاء لا أعلمه إلا عن أبي سعيد الخدري - أن رسول الله  صلى الله عليه وسلم  مر بغلام يسلخ شاة فقال له رسول الله  صلى الله عليه وسلم  ‏\"‏ تنح حتى أريك ‏\"‏ ‏.‏ فأدخل رسول الله  صلى الله عليه وسلم  يده بين الجلد واللحم فدحس بها حتى توارت إلى الإبط وقال ‏\"‏ يا غلام هكذا فاسلخ ‏\"‏ ‏.‏ ثم مضى وصلى للناس ولم يتوضأ ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed Al-Khudri that the Messenger of Allah(ﷺ) passed by a boy who was skinning a sheep. The Messenger ofAllah(ﷺ) said to him:                      “Step aside and I will show you how.”The Messengerof Allah (ﷺ) put his hand between the skin and theflesh, and thrusthis arm in until it disappeared up to the armpit,and said: “O boy,this is how you skin it.” Then he went and ledthe people in prayerand did not perform Wudu’.",
      "chain": [
        "30216",
        "20201",
        "15594",
        "11206",
        "38"
      ]
    },
    {
      "hadith_no": "3301",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا خلف بن خليفة، ح وحدثنا عبد الرحمن بن إبراهيم، أنبأنا مروان بن معاوية، جميعا عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  أتى رجلا من الأنصار فأخذ الشفرة ليذبح لرسول الله  صلى الله عليه وسلم  فقال له رسول الله  صلى الله عليه وسلم  ‏\"‏ إياك والحلوب ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)came toa man from among the Ansar who had picked up a knife toslaughter ananimal for the Messenger of Allah (ﷺ). The Messenger ofAllah (ﷺ)said to him:                      “Avoid those that are lactating.” (i.e. thosefromwhich milk is received).",
      "chain": [
        "30201",
        "20584",
        "30285",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "3440",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا هشام بن عمار، حدثنا مروان بن معاوية، حدثنا عيسى بن أبي عيسى، عن رجل، - أراه موسى - عن أنس بن مالك، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ سيد إدامكم الملح ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Anas bin Malik that the Messenger of Allah (ﷺ)said:                     ‘The best of your seasonings is salt.”",
      "chain": [
        "30288",
        "20201",
        "12421",
        "20040",
        "19"
      ]
    },
    {
      "hadith_no": "3468",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا مروان بن معاوية، عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، أنه قال والذي نفسي بيده ما شبع نبي الله  صلى الله عليه وسلم  ثلاثة أيام تباعا من خبز الحنطة حتى توفاه الله عز وجل ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “By the One in Whose Hand ismysoul, the Prophet of Allah (ﷺ) never ate his fill of wheat breadfor three days in a row, until Allah took his soul.”",
      "chain": [
        "32048",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "3543",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا هشام بن عمار، ومحمد بن الصباح، قالا حدثنا مروان بن معاوية، حدثنا رشدين بن كريب، عن أبيه، عن ابن عباس، أن النبي  صلى الله عليه وسلم  شرب فتنفس فيه مرتين ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Prophet (ﷺ) drank, andtook twobreaths while doing so.",
      "chain": [
        "30288",
        "30269",
        "20201",
        "17"
      ]
    },
    {
      "hadith_no": "4101",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا مروان بن معاوية، عن عبد الحكم السدوسي، حدثنا شهر بن حوشب، عن أبي أمامة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ من شر الناس منزلة عند الله يوم القيامة عبد أذهب آخرته بدنيا غيره ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Umamah that the Messenger of Allah (ﷺ)said:                      “Among the worst people in status before Allah on the Day ofResurrection will be a person who loses his Hereafter for the sake ofthis world.”",
      "chain": [
        "30547",
        "20201",
        "11044",
        "405"
      ]
    },
    {
      "hadith_no": "4121",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، ويعقوب بن حميد بن كاسب، وسويد بن سعيد، قالوا حدثنا مروان بن معاوية الفزاري، حدثنا يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ بدأ الإسلام غريبا وسيعود غريبا فطوبى للغرباء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “Islam began as something strange and will go back to beingstrange, so glad tidings to the strangers.’”",
      "chain": [
        "30285",
        "32048",
        "30547",
        "20201",
        "10845",
        "11172",
        "13"
      ]
    }
  ],
  "total_hadiths": 112
}