{
  "id": "20217",
  "name": "Hatm bin Wrdan bin Mrwan حاتم بن وردان بن مروان",
  "full_name": "Hatm bin Wrdan bin Mrwan حاتم بن وردان بن مروان",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "184",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  ت  س  -  ثقة ]"
    ],
    "tags": [
      "al-Sa'di",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11071",
      "name": "'Abdullah bin 'Awn bin Artaban عبد الله بن عون بن أرطبان الخزار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11286",
      "name": "Sa'id bin Iyas al-Jariri سعيد بن إياس الجريري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11075",
      "name": "Yonus bin 'Ubaid bin Dinar يونس بن عبيد بن دينار العبدي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "30106",
      "name": "'Affan bin Muslim عفان بن مسلم بن عبد الله الصفار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30135",
      "name": "Ziyad bin Yahya al-Hasani زياد بن يحيى الحساني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30434",
      "name": "Salah bin Hatim bin Wardan صالح بن حاتم بن وردان البصري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20720",
      "name": "Nasr bin 'Ali bin Asbahan نصر بن علي الجهضمي الكبير",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2657",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا زياد بن يحيى، حدثنا حاتم بن وردان، حدثنا أيوب، عن عبد الله بن أبي مليكة، عن المسور بن مخرمة  رضى الله عنهما  قال قدمت على النبي صلى الله عليه وسلم أقبية فقال لي أبي مخرمة انطلق بنا إليه عسى أن يعطينا منها شيئا‏.‏ فقام أبي على الباب فتكلم، فعرف النبي صلى الله عليه وسلم صوته فخرج النبي صلى الله عليه وسلم ومعه قباء وهو يريه محاسنه وهو يقول ‏\"‏ خبأت هذا لك، خبأت هذا لك ‏\"‏‏.‏",
      "text_en": " Narrated Al-Miswar bin Makhrama:                     Some outer garments were received the Prophet and my father (Makhrama) said to me, \"Let us go to the Prophet so that he may give us something from the garments.\" So, my father stood at the door and spoke. The Prophet recognized his voice and came out carrying a garment and telling Makhrama the good qualities of that garment, adding, \"I have kept this for you, I have sent this for you.\"",
      "chain": [
        "20217",
        "11015",
        "11090",
        "2201"
      ]
    },
    {
      "hadith_no": "5616",
      "source": " Sahih Bukhari ",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "وقال حاتم بن وردان عن أيوب، عن محمد، عن أنس، عن النبي صلى الله عليه وسلم وقال عناق جذعة‏.‏",
      "text_en": "",
      "chain": [
        "20217",
        "11015",
        "20278",
        "19"
      ]
    },
    {
      "hadith_no": "7616",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا حاتم بن وردان، حدثنا أيوب، عن عكرمة، عن ابن عباس  رضى الله عنهما  قال كيف تسألون أهل الكتاب عن كتبهم وعندكم كتاب الله أقرب الكتب عهدا بالله، تقرءونه محضا لم يشب",
      "text_en": " Narrated `Ikrima:                     Ibn `Abbas said, \"How can you ask the people of the Scriptures about their Books while you have Allah's Book (the Qur'an) which is the most recent of the Books revealed by Allah, and you read it in its pure undistorted form?\"",
      "chain": [
        "30026",
        "20217",
        "11015",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2479",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو الخطاب، زياد بن يحيى الحساني حدثنا حاتم بن وردان أبو صالح، حدثنا أيوب السختياني، عن عبد الله بن أبي مليكة، عن المسور بن مخرمة، قال قدمت على النبي صلى الله عليه وسلم أقبية فقال لي أبي مخرمة انطلق بنا إليه عسى أن يعطينا منها شيئا ‏.‏ قال فقام أبي على الباب فتكلم فعرف النبي صلى الله عليه وسلم صوته فخرج ومعه قباء وهو يريه محاسنه وهو يقول ‏\"‏ خبأت هذا لك خبأت هذا لك ‏\"‏ ‏.‏",
      "text_en": " Miswar b. Makhrama reported:                      Some cloaks were presented to the Messenger of Allah (may peace be upon him). My father Makhrama said to me: Come along with me to him; perhaps we may be able to get anything out of that (stock of cloaks). My father stood at the door and began to talk. The Apostle of Allah (may peace be upon him) recognised him by his voice and came out and there was a cloak with him, and he was showing its beauties and saying: I kept it for you, I kept it for you.",
      "chain": [
        "30135",
        "20217",
        "11015",
        "11090",
        "2201"
      ]
    },
    {
      "hadith_no": "5193",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثني زياد بن يحيى الحساني، حدثنا حاتم، - يعني ابن وردان - حدثنا أيوب، عن محمد بن سيرين، عن أنس بن مالك، قال خطبنا رسول الله صلى الله عليه وسلم يوم أضحى - قال - فوجد ريح لحم فنهاهم أن يذبحوا قال ‏\"‏ من كان ضحى فليعد ‏\"‏ ‏.‏ ثم ذكر بمثل حديثهما ‏.‏",
      "text_en": " Anas b. Malik reported:                      Allah's Messenger (may peace be upon him) addressed us on the day of 'Id al-Adha. He smelt the odour of flesh and he prohibited thern from slaughtering (the animals before the 'Id prayer), saying: He who slaughtered the animals (before the 'Id prayer) should do that again (as it is not valid as a sacrifice).",
      "chain": [
        "30135",
        "20217",
        "11015",
        "11035",
        "19"
      ]
    }
  ],
  "total_hadiths": 5
}