{
  "id": "20216",
  "name": "Jawayriyya bin Asma' bin 'Ubaid جويرية بن أسماء بن عبيد الضبعي",
  "full_name": "Jawayriyya bin Asma' bin 'Ubaid جويرية بن أسماء بن عبيد الضبعي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "173",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  م  د  س  ق  -  صدوق ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [
    {
      "id": "10667",
      "name": "Asma' bin 'Ubaid bin Makhariq أسماء بن عبيد بن مخارق",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "10667",
      "name": "Asma' bin 'Ubaid bin Makhariq أسماء بن عبيد بن مخارق",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    }
  ],
  "students": [
    {
      "id": "20218",
      "name": "Hiban bin Hilal حبان بن هلال",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20219",
      "name": "Hajjaj bin al-Minhal حجاج بن المنهال",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20232",
      "name": "Sa'id bin 'Amir al-Dab'ai سعيد بن عامر الضبعي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30144",
      "name": "'Abdullah bin Muhammad bin Asma' عبد الله بن محمد بن أسماء",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "23033",
      "name": "'Abdullah bin Yazid al-'Advi عبد الله بن يزيد العدوي المقري القصير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "10567",
      "name": "Abu Salama bin 'Abdur Rahman أبو سلمة بن عبد الرحمن بن عوف",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30175",
      "name": "Masdad bin Masrhad مسدد بن مسرهد بن مسربل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20296",
      "name": "Hisham bin 'Abdul Malik al-Tayalasi هشام بن عبد الملك أبو الوليد الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "289",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا جويرية، عن نافع، عن عبد الله، قال استفتى عمر النبي صلى الله عليه وسلم أينام أحدنا وهو جنب قال ‏\"‏ نعم، إذا توضأ ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     `Umar asked the Prophet \"Can anyone of us sleep while he is Junub?\" He replied, \"Yes, if he performs ablution.\"",
      "chain": [
        "20040",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "504",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا جويرية، عن نافع، عن ابن عمر، قال دخل النبي صلى الله عليه وسلم البيت وأسامة بن زيد وعثمان بن طلحة وبلال، فأطال ثم خرج، وكنت أول الناس دخل على أثره فسألت بلالا أين صلى قال بين العمودين المقدمين‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet entered the Ka`ba along with Usama bin Zaid, `Uthman bin Talha and Bilal and remained there for a long time. When they came out, I was the first man to enter the Ka`ba. I asked Bilal \"Where did the Prophet pray?\" Bilal replied, \"Between the two front Pillars.\"",
      "chain": [
        "20040",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "878",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء، قال أخبرنا جويرية، عن مالك، عن الزهري، عن سالم بن عبد الله بن عمر، عن ابن عمر  رضى الله عنهما  أن عمر بن الخطاب، بينما هو قائم في الخطبة يوم الجمعة إذ دخل رجل من المهاجرين الأولين من أصحاب النبي صلى الله عليه وسلم فناداه عمر أية ساعة هذه قال إني شغلت فلم أنقلب إلى أهلي حتى سمعت التأذين، فلم أزد أن توضأت‏.‏ فقال والوضوء أيضا وقد علمت أن رسول الله صلى الله عليه وسلم كان يأمر بالغسل‏.‏",
      "text_en": " Narrated Ibn `Umar:                     While `Umar bin Al-Khattab was standing and delivering the sermon on a Friday, one of the companions of the Prophet, who was one of the foremost Muhajirs (emigrants) came. `Umar said to him, \"What is the time now?\" He replied, \"I was busy and could not go back to my house till I heard the Adhan. I did not perform more than the ablution.\" Thereupon `Umar said to him, \"Did you perform only the ablution although you know that Allah's Apostle (p.b.u.h) used to order us to take a bath (on Fridays)?\"",
      "chain": [
        "30144",
        "20216",
        "20001",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "946",
      "source": " Sahih Bukhari ",
      "chapter": "Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "12",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء، قال حدثنا جويرية، عن نافع، عن ابن عمر، قال قال النبي صلى الله عليه وسلم لنا لما رجع من الأحزاب ‏\"‏ لا يصلين أحد العصر إلا في بني قريظة ‏\"‏‏.‏ فأدرك بعضهم العصر في الطريق فقال بعضهم لا نصلي حتى نأتيها، وقال بعضهم بل نصلي لم يرد منا ذلك‏.‏ فذكر للنبي صلى الله عليه وسلم فلم يعنف واحدا منهم‏.‏",
      "text_en": " Narrated Ibn `Umar:                     When the Prophet () returned from the battle of Al-Ahzab (The confederates), he said to us, \"None should offer the 'Asr prayer but at Bani Quraiza.\" The 'Asr prayer became due for some of them on the way. Some of them decided not to offer the Salat but at Bani Quraiza while others decided to offer the Salat on the spot and said that the intention of the Prophet () was not what the former party had understood. And when that was told to the Prophet () he did not blame anyone of them.",
      "chain": [
        "30144",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1000",
      "source": " Sahih Bukhari ",
      "chapter": "Witr Prayer - كتاب الوتر",
      "chapter_no": "14",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا جويرية بن أسماء، عن نافع، عن ابن عمر، قال كان النبي صلى الله عليه وسلم يصلي في السفر على راحلته، حيث توجهت به، يومئ إيماء، صلاة الليل إلا الفرائض، ويوتر على راحلته‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet used to offer (Nawafil) prayers on his Rahila (mount) facing its direction by signals, but not the compulsory prayer. He also used to pray witr on his (mount) Rahila.",
      "chain": [
        "20040",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1694",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا جويرية، عن نافع، قال كان عبد الله بن عمر  رضى الله عنهما  يجمع بين المغرب والعشاء بجمع، غير أنه يمر بالشعب الذي أخذه رسول الله صلى الله عليه وسلم فيدخل فينتفض ويتوضأ، ولا يصلي حتى يصلي بجمع‏.‏",
      "text_en": " Narrated Nafi`:                     `Abdullah bin `Umar used to offer the Maghrib and `Isha' prayers together at Jam' (Al-Muzdalifa). But he used to pass by that mountain pass where Allah's Apostle went, and he would enter it and answer the call of nature and perform ablution, and would not offer any prayer till he had prayed at Jam.'",
      "chain": [
        "20040",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1756",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء، حدثنا جويرية بن أسماء، عن نافع، أن عبد الله، قال حلق النبي صلى الله عليه وسلم وطائفة من أصحابه، وقصر بعضهم‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet and some of his companions got their heads shaved and some others got their hair cut short.",
      "chain": [
        "30144",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1836",
      "source": " Sahih Bukhari ",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء، حدثنا جويرية، عن نافع، أن عبيد الله بن عبد الله، وسالم بن عبد الله، أخبراه أنهما، كلما عبد الله بن عمر  رضى الله عنهما  ليالي نزل الجيش بابن الزبير فقالا لا يضرك أن لا تحج العام، وإنا نخاف أن يحال بينك وبين البيت‏.‏ فقال خرجنا مع رسول الله صلى الله عليه وسلم فحال كفار قريش دون البيت، فنحر النبي صلى الله عليه وسلم هديه، وحلق رأسه، وأشهدكم أني قد أوجبت العمرة، إن شاء الله أنطلق، فإن خلي بيني وبين البيت طفت، وإن حيل بيني وبينه فعلت كما فعل النبي صلى الله عليه وسلم وأنا معه‏.‏ فأهل بالعمرة من ذي الحليفة، ثم سار ساعة، ثم قال ‏\"‏ إنما شأنهما واحد، أشهدكم أني قد أوجبت حجة مع عمرتي ‏\"‏‏.‏ فلم يحل منهما حتى حل يوم النحر، وأهدى، وكان يقول لا يحل حتى يطوف طوافا واحدا يوم يدخل مكة‏.‏",
      "text_en": " Narrated Nafi`:                     That Ubaidullah bin `Abdullah and Salim bin `Abdullah informed him that they told Ibn `Umar when Ibn Az-Zubair was attacked by the army, saying \"There is no harm for you if you did not perform Hajj this year. We are afraid that you may be prevented from reaching the Ka`ba.\" Ibn `Umar said \"We set out with Allah's Apostle and the non-believers of Quraish prevented us from reaching the Ka`ba, and so the Prophet slaughtered his Hadi and got his head shaved.\" Ibn `Umar added, \"I make you witnesses that I have made `Umra obligatory for me. And, Allah willing, I will go and then if the way to Ka`ba is clear, I will perform the Tawaf, but if I am prevented from going to the Ka`ba then I will do the same as the Prophet did while I was in his company.\" Ibn `Umar then assumed Ihram for Umra from Dhul-Hulaifa and proceeded for a while and said, \"The conditions of `Umra and Hajj are similar and I make you witnesses that I have made `Umra and Hajj obligatory for myself.\" So, he did not finish the Ihram till the day of Nahr (slaughtering) came, and he slaughtered his Hadi. He used to say, \"I will not finish the Ihram till I perform the Tawaf, one Tawaf on the day of entering Mecca (i.e. of Safa and Marwa for both `Umra and Hajj).",
      "chain": [
        "30144",
        "20216",
        "11014",
        "11004"
      ]
    },
    {
      "hadith_no": "1837",
      "source": " Sahih Bukhari ",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "حدثني موسى بن إسماعيل، حدثنا جويرية، عن نافع، أن بعض بني عبد الله، قال له لو أقمت‏.‏ بهذا‏.‏",
      "text_en": " Narrated Nafi`:                     Some of the sons of `Abdullah told him (i.e. `Abdullah) if he had stayed (and not performed Hajj that year).",
      "chain": [
        "20040",
        "20216",
        "11014"
      ]
    },
    {
      "hadith_no": "1922",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا جويرية، عن نافع، عن عبد الله  رضى الله عنه  أن النبي صلى الله عليه وسلم واصل فواصل الناس فشق عليهم، فنهاهم‏.‏ قالوا إنك تواصل‏.‏ قال ‏\"‏ لست كهيئتكم، إني أظل أطعم وأسقى ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet fasted for days continuously; the people also did the same but it was difficult for them. So, the Prophet forbade them (to fast continuously for more than one day). They slid, \"But you fast without break (no food was taken in the evening or in the morning).\" The Prophet replied, \"I am not like you, for I am provided with food and drink (by Allah).",
      "chain": [
        "20040",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2166",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا جويرية، عن نافع، عن عبد الله  رضى الله عنه  قال كنا نتلقى الركبان فنشتري منهم الطعام، فنهانا النبي صلى الله عليه وسلم أن نبيعه حتى يبلغ به سوق الطعام‏.‏ قال أبو عبد الله هذا في أعلى السوق، يبينه حديث عبيد الله‏.‏",
      "text_en": " Narrated `Abdullah:                     We used to go ahead to meet the caravan and used to buy foodstuff from them. The Prophet forbade us to sell it till it was carried to the market.",
      "chain": [
        "20040",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2256",
      "source": " Sahih Bukhari ",
      "chapter": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam) - كتاب السلم",
      "chapter_no": "35",
      "text_ar": "حدثنا موسى بن إسماعيل، أخبرنا جويرية، عن نافع، عن عبد الله  رضى الله عنه  قال كانوا يتبايعون الجزور إلى حبل الحبلة، فنهى النبي صلى الله عليه وسلم عنه‏.‏ فسره نافع أن تنتج الناقة ما في بطنها‏.‏",
      "text_en": " Narrated `Abdullah:                     The people used to sell camels on the basis of Habal-al-Habala. The Prophet forbade such sale. Nafi` explained Habal-al-Habala by saying. \"The camel is to be delivered to the buyer after the she-camel gives birth.\"",
      "chain": [
        "20040",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2286",
      "source": " Sahih Bukhari ",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا جويرية بن أسماء، عن نافع، عن عبد الله  رضى الله عنه  قال أعطى رسول الله صلى الله عليه وسلم خيبر أن يعملوها ويزرعوها ولهم شطر ما يخرج منها، وأن ابن عمر حدثه أن المزارع كانت تكرى على شىء سماه نافع لا أحفظه‏.‏ وأن رافع بن خديج حدث أن النبي صلى الله عليه وسلم نهى عن كراء المزارع‏.‏ وقال عبيد الله عن نافع عن ابن عمر حتى أجلاهم عمر‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     \"Allah's Apostle gave the land of Khaibar to the Jews to work on and cultivate and take half of its yield. Ibn `Umar added, \"The land used to be rented for a certain portion (of its yield).\" Nafi` mentioned the amount of the portion but I forgot it. Rafi` bin Khadij said, \"The Prophet forbade renting farms.\" Narrated 'Ubaidullah Nafi` said: Ibn `Umar said: (The contract of Khaibar continued) till `Umar evacuated the Jews (from Khaibar).",
      "chain": [
        "20040",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2326",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا جويرية، عن نافع، عن عبد الله  رضى الله عنه  عن النبي صلى الله عليه وسلم أنه حرق نخل بني النضير وقطع، وهى البويرة، ولها يقول حسان وهان على سراة بني لؤى حريق بالبويرة مستطير‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet got the date palm trees of the tribe of Bani-An-Nadir burnt and the trees cut down at a place called Al-Buwaira . Hassan bin Thabit said in a poetic verse: \"The chiefs of Bani Lu'ai found it easy to watch fire spreading at Al-Buwaira.\"",
      "chain": [
        "20040",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2499",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا جويرية بن أسماء، عن نافع، عن عبد الله  رضى الله عنه  قال أعطى رسول الله صلى الله عليه وسلم خيبر اليهود أن يعملوها ويزرعوها ولهم شطر ما يخرج منها‏.‏",
      "text_en": " Narrated `Abdullah:                     Allah's Apostle rented the land of Khaibar to the Jews on the condition that they would work on it and cultivate it and take half of its yield.",
      "chain": [
        "20040",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2503",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا مسدد، حدثنا جويرية بن أسماء، عن نافع، عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ من أعتق شركا له في مملوك وجب عليه أن يعتق كله، إن كان له مال قدر ثمنه يقام قيمة عدل ويعطى شركاؤه حصتهم ويخلى سبيل المعتق ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"Whoever manumits his share o a jointly possessed slave, it is imperative on him to manumit the slave completely if he has sufficient money to pay the rest of its price which is to be estimated justly. He should pay his partners their shares and release him (the freed one).",
      "chain": [
        "30175",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2679",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا جويرية، قال ذكر نافع عن عبد الله  رضى الله عنه  أن النبي صلى الله عليه وسلم قال ‏\"‏ من كان حالفا فليحلف بالله أو ليصمت ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet said, \"Whoever has to take an oath should swear by Allah or remain silent.\" (i.e. He should not swear by other than Allah.)",
      "chain": [
        "20040",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2720",
      "source": " Sahih Bukhari ",
      "chapter": "Conditions - كتاب الشروط",
      "chapter_no": "54",
      "text_ar": "حدثنا موسى، حدثنا جويرية بن أسماء، عن نافع، عن عبد الله  رضى الله عنه  قال أعطى رسول الله صلى الله عليه وسلم خيبر اليهود أن يعملوها ويزرعوها، ولهم شطر ما يخرج منها‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle gave the land of Khaibar to the Jews on the condition that they would work on it and cultivate it and they would get half of its yield.",
      "chain": [
        "20040",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2958",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا جويرية، عن نافع، قال قال ابن عمر  رضى الله عنهما  رجعنا من العام المقبل فما اجتمع منا اثنان على الشجرة التي بايعنا تحتها، كانت رحمة من الله‏.‏ فسألت نافعا على أى شىء بايعهم على الموت قال لا، بايعهم على الصبر‏.‏",
      "text_en": " Narrated Ibn `Umar:                     When we reached (Hudaibiya) in the next year (of the treaty of Hudaibiya), not even two men amongst us agreed unanimously as to which was the tree under which we had given the pledge of allegiance, and that was out of Allah's Mercy. (The sub narrator asked Naf'i, \"For what did the Prophet take their pledge of allegiance, was it for death?\" Naf'i replied \"No, but he took their pledge of allegiance for patience.\")",
      "chain": [
        "20040",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3084",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا جويرية، عن نافع، عن عبد الله  رضى الله عنه أن النبي صلى الله عليه وسلم كان إذا قفل كبر ثلاثا قال ‏\"‏ آيبون إن شاء الله تائبون عابدون حامدون لربنا ساجدون، صدق الله وعده، ونصر عبده، وهزم الأحزاب وحده ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     When the Prophet returned (from Jihad), he would say Takbir thrice and add, \"We are returning, if Allah wishes, with repentance and worshipping and praising (our Lord) and prostrating ourselves before our Lord. Allah fulfilled His Promise and helped His Slave, and He Alone defeated the (infidel) clans.\"",
      "chain": [
        "20040",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3104",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا جويرية، عن نافع، عن عبد الله  رضى الله عنه  قال قام النبي صلى الله عليه وسلم خطيبا فأشار نحو مسكن عائشة فقال ‏\"‏ هنا الفتنة  ثلاثا  من حيث يطلع قرن الشيطان ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet stood up and delivered a sermon, and pointing to `Aisha's house (i.e. eastwards), he said thrice, \"Affliction (will appear from) here,\" and, \"from where the side of the Satan's head comes out (i.e. from the East).",
      "chain": [
        "20040",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3387",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء ابن أخي جويرية حدثنا جويرية بن أسماء، عن مالك، عن الزهري، أن سعيد بن المسيب، وأبا، عبيد أخبراه عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يرحم الله لوطا، لقد كان يأوي إلى ركن شديد، ولو لبثت في السجن ما لبث يوسف ثم أتاني الداعي لأجبته ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"May Allah bestow His Mercy on Lot. He wanted to have a powerful support. If I were to stay in prison (for a period equal to) the stay of Joseph (prison) and then the offer of freedom came to me, then I would have accepted it.\" (See Hadith No. 591)",
      "chain": [
        "30144",
        "20216",
        "20001",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "3482",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني عبد الله بن محمد بن أسماء، حدثنا جويرية بن أسماء، عن نافع، عن عبد الله بن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ عذبت امرأة في هرة سجنتها حتى ماتت، فدخلت فيها النار، لا هي أطعمتها ولا سقتها إذ حبستها، ولا هي تركتها تأكل من خشاش الأرض ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle said, \"A lady was punished because of a cat which she had imprisoned till it died. She entered the (Hell) Fire because of it, for she neither gave it food nor water as she had imprisoned it, nor set it free to eat from the vermin of the earth.\"",
      "chain": [
        "30144",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4062",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء، حدثنا جويرية، عن مالك، عن الزهري، أن سالم بن عبد الله، أخبره قال أخبر رافع بن خديج عبد الله بن عمر، أن عميه، وكانا، شهدا بدرا أخبراه أن رسول الله صلى الله عليه وسلم نهى عن كراء المزارع‏.‏ قلت لسالم فتكريها أنت قال نعم، إن رافعا أكثر على نفسه‏.‏",
      "text_en": " Narrated Az-Zuhri:                     Salim bin `Abdullah told me that Rafi` bin Khadij told `Abdullah bin `Umar that his two paternal uncles who had fought in the battle of Badr informed him that Allah's Apostle forbade the renting of fields. I said to Salim, \"Do you rent your land?\" He said, \"Yes, for Rafi` is mistaken.\"",
      "chain": [
        "30144",
        "20216",
        "20001",
        "11013",
        "11011",
        "1986"
      ]
    },
    {
      "hadith_no": "4082",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق، أخبرنا حبان، أخبرنا جويرية بن أسماء، عن نافع، عن ابن عمر  رضى الله عنهما أن النبي صلى الله عليه وسلم حرق نخل بني النضير قال ولها يقول حسان بن ثابت وهان على سراة بني لؤى حريق بالبويرة مستطير قال فأجابه أبو سفيان بن الحارث أدام الله ذلك من صنيع وحرق في نواحيها السعير ستعلم أينا منها بنزه وتعلم أى أرضينا تضير",
      "text_en": " Narrated Ibn `Umar:                     The Prophet burnt the date-palm trees of Bani An-Nadir. Hassan bin Thabit said the following poetic Verses about this event:-- \"the terrible burning of Al-Buwaira Has been received indifferently By the nobles of Bani Luai (The masters and nobles of Quraish).\" Abu Sufyan bin Al-Harith (i.e. the Prophet's cousin who was still a disbeliever then) replied to Hassan, saying in poetic verses:-- \"May Allah bless that burning And set all its (i.e. Medina's) Parts on burning fire. You will see who is far from it (i.e. Al-Buwaira) And which of our lands will be Harmed by it (i.e. the burning of Al- Buwaira).",
      "chain": [
        "30313",
        "20218",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4169",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء، حدثنا جويرية بن أسماء، عن نافع، عن ابن عمر  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم يوم الأحزاب ‏\"‏ لا يصلين أحد العصر إلا في بني قريظة ‏\"‏‏.‏ فأدرك بعضهم العصر في الطريق، فقال بعضهم لا نصلي حتى نأتيها‏.‏ وقال بعضهم بل نصلي، لم يرد منا ذلك، فذكر ذلك للنبي صلى الله عليه وسلم فلم يعنف واحدا منهم‏.‏",
      "text_en": " Narrated Ibn `Umar:                     On the day of Al-Ahzab (i.e. Clans) the Prophet said, \"None of you Muslims) should offer the `Asr prayer but at Banu Quraiza's place.\" The `Asr prayer became due for some of them on the way. Some of those said, \"We will not offer it till we reach it, the place of Banu Quraiza,\" while some others said, \"No, we will pray at this spot, for the Prophet did not mean that for us.\" Later on It was mentioned to the Prophet and he did not berate any of the two groups.",
      "chain": [
        "30144",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4234",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء، حدثنا جويرية، عن نافع، أن عبيد الله بن عبد الله، وسالم بن عبد الله، أخبراه أنهما، كلما عبد الله بن عمر‏.‏ وحدثنا موسى بن إسماعيل، حدثنا جويرية، عن نافع، أن بعض بني عبد الله، قال له لو أقمت العام، فإني أخاف أن لا تصل إلى البيت‏.‏ قال خرجنا مع النبي صلى الله عليه وسلم فحال كفار قريش دون البيت، فنحر النبي صلى الله عليه وسلم هداياه، وحلق وقصر أصحابه، وقال ‏\"‏ أشهدكم أني أوجبت عمرة ‏\"‏‏.‏ فإن خلي بيني وبين البيت طفت، وإن حيل بيني وبين البيت صنعت كما صنع رسول الله صلى الله عليه وسلم فسار ساعة ثم قال ما أرى شأنهما إلا واحدا، أشهدكم أني قد أوجبت حجة مع عمرتي‏.‏ فطاف طوافا واحدا وسعيا واحدا، حتى حل منهما جميعا‏.‏",
      "text_en": " Narrated Nafi`:                     One of `Abdullah's sons said to `Abdullah (bin `Umar) \"I wish you would stay this year (and not perform Hajj) as I am afraid that you will not be able to reach the Ka`ba.\" On that he (i.e. `Abdullah bin `Umar) said, \"We went out with the Prophet (for `Umra), and when the Quraish infidel intervened between us and the Ka`ba, the Prophet slaughtered his Hadi and shaved (his head), and his companions cut short their hair.\" Then `Abdullah bin `Umar said, \"I make you witness that I have intended to perform `Umra and if I am allowed to reach the Ka`ba, I will perform the Tawaf, and if something (i.e. obstacles) intervene between me and the Ka`ba, then I will do what Allah's Apostle did.\" Then after going for a while, he said, \"I consider the ceremonies (of both `Umra and Hajj as one and the same, so I would like you to witness that I have intended to perform Hajj along with my `Umra.\" So he performed only one Tawaf and one Sai (between Safa and Marwa) and finished the Ihram of both Umra and Hajj).",
      "chain": [
        "30144",
        "20216",
        "11014",
        "11004",
        "20040",
        "20216",
        "11014"
      ]
    },
    {
      "hadith_no": "4293",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا جويرية، عن نافع، عن عبد الله  رضى الله عنه  قال أعطى النبي صلى الله عليه وسلم خيبر اليهود أن يعملوها ويزرعوها، ولهم شطر ما يخرج منها‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet gave (the land of) Khaibar to the Jews (of Khaibar) on condition that they would work on it and cultivate it and they would have half of its yield.",
      "chain": [
        "20040",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5265",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء، حدثنا جويرية، عن مالك بن أنس، عن الزهري، عن ابن محيريز، عن أبي سعيد الخدري، قال أصبنا سبيا فكنا نعزل فسألنا رسول الله صلى الله عليه وسلم فقال ‏\"‏ أوإنكم لتفعلون قالها ثلاثا ما من نسمة كائنة إلى يوم القيامة إلا هي كائنة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     We got female captives in the war booty and we used to do coitus interruptus with them. So we asked Allah's Apostle about it and he said, \"Do you really do that?\" repeating the question thrice, \"There is no soul that is destined to exist but will come into existence, till the Day of Resurrection.\"",
      "chain": [
        "30144",
        "20216",
        "20001",
        "11013",
        "38"
      ]
    },
    {
      "hadith_no": "5363",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا جويرية، عن نافع، عن عبد الله  رضى الله عنه  أن رجلا من الأنصار قذف امرأته فأحلفهما النبي صلى الله عليه وسلم ثم فرق بينهما‏.‏",
      "text_en": " Narrated `Abdullah:                     An Ansari man accused his wife (of committing illegal sexual intercourse). The Prophet made both of them takes the oath of Lian, and separated them from each other (by divorce).",
      "chain": [
        "20040",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5560",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا موسى، حدثنا جويرية، عن نافع، عن رجل، من بني سلمة أخبر عبد الله، أن جارية، لكعب بن مالك ترعى غنما له بالجبيل الذي بالسوق وهو بسلع، فأصيبت شاة، فكسرت حجرا فذبحتها، فذكروا للنبي صلى الله عليه وسلم فأمرهم بأكلها‏.‏",
      "text_en": " Narrated `Abdullah:                     that Ka`b had a slave girl who used to graze his sheep on a small mountain, called \"Sl'a\", situated near the market. Once a sheep was dying, so she broke a stone and slaughtered it with it. When they mentioned that to the Prophet, he, permitted them to eat it.",
      "chain": [
        "20040",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5865",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا جويرية، عن نافع، عن عبد الله، قال قام رجل فقال يا رسول الله ما تأمرنا أن نلبس إذا أحرمنا‏.‏ قال ‏\"‏ لا تلبسوا القميص، والسراويل، والعمائم والبرانس، والخفاف، إلا أن يكون رجل ليس له نعلان، فليلبس الخفين أسفل من الكعبين، ولا تلبسوا شيئا من الثياب مسه زعفران ولا ورس ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     A man got up and said, O Allah's Apostle! What do you order us to wear when we assume the state of Ihram?\" The Prophet replied, \"Do not wear shirts, trousers, turbans, hooded cloaks or Khuffs (socks made from thick fabric or leather), but if a man has no sandals, he can wear Khuffs after cutting them short below the ankles; and do not wear clothes touched with (perfumes) of saffron or wars.\"",
      "chain": [
        "20040",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5902",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثني جويرية، عن نافع، عن عبد الله، أن عمر  رضى الله عنه  رأى حلة سيراء تباع فقال يا رسول الله لو ابتعتها، تلبسها للوفد إذا أتوك والجمعة‏.‏ قال ‏\"‏ إنما يلبس هذه من لا خلاق له ‏\"‏‏.‏ وأن النبي صلى الله عليه وسلم بعث بعد ذلك إلى عمر حلة سيراء حرير، كساها إياه فقال عمر كسوتنيها وقد سمعتك تقول فيها ما قلت فقال ‏\"‏ إنما بعثت إليك لتبيعها أو تكسوها ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     `Umar saw a silk suit being sold, so he said, \"O Allah's Apostle! Why don't you buy it so that you may wear it when delegates come to you, and also on Fridays?\" The Prophet said, \"This is worn only by him who has no share in the Hereafter.\" Afterwards the Prophet sent to `Umar a silk suit suitable for wearing. `Umar said to the Prophet, \"You have given it to me to wear, yet I have heard you saying about it what you said?\" The Prophet said, \"I sent it to you so that you might either sell it or give it to somebody else to wear.\"",
      "chain": [
        "20040",
        "20216",
        "11014",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "5937",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا جويرية، عن نافع، أن عبد الله، حدثه أن النبي صلى الله عليه وسلم اصطنع خاتما من ذهب، جعل فصه في بطن كفه إذا لبسه، فاصطنع الناس خواتيم من ذهب، فرقي المنبر، فحمد الله وأثنى عليه فقال ‏\"‏ إني كنت اصطنعته، وإني لا ألبسه ‏\"‏‏.‏ فنبذه فنبذ الناس‏.‏ قال جويرية ولا أحسبه إلا قال في يده اليمنى‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet had a golden ring made for himself, and when he wore it. he used to turn its stone toward the palm of his! hand. So the people too had gold made for themselves. The Prophet then ascended the pulpit, and after glorifying and praising Allah, he said, \"I had it made for me, but now I will never wear it again.\" He threw it away, and then the people threw away their rings too. (Juwairiya, a subnarrator, said: I think Anas said that the Prophet was wearing the ring in his right hand.)",
      "chain": [
        "20040",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "6022",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا جويرية، عن نافع، عن القاسم، عن عائشة  رضى الله عنها  أنها اشترت نمرقة فيها تصاوير، فقام النبي صلى الله عليه وسلم بالباب فلم يدخل‏.‏ فقلت أتوب إلى الله مما أذنبت‏.‏ قال ‏\"‏ ما هذه النمرقة ‏\"‏‏.‏ قلت لتجلس عليها وتوسدها‏.‏ قال ‏\"‏ إن أصحاب هذه الصور يعذبون يوم القيامة، يقال لهم أحيوا ما خلقتم‏.‏ وإن الملائكة لا تدخل بيتا فيه الصورة ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     I purchased a cushion with pictures on it. The Prophet (came and) stood at the door but did not enter. I said (to him), \"I repent to Allah for what (the guilt) I have done.\" He said, \"What is this cushion?\" I said, \"It is for you to sit on and recline on.\" He said, \"The makers of these pictures will be punished on the Day of Resurrection and it will be said to them, 'Make alive what you have created.' Moreover, the angels do not enter a house where there are pictures.'\"",
      "chain": [
        "20219",
        "20216",
        "11014",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "6179",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا جويرية، عن نافع، عن عبد الله  رضى الله عنه  قال بينا النبي صلى الله عليه وسلم يصلي رأى في قبلة المسجد نخامة، فحكها بيده، فتغيظ ثم قال ‏\"‏ إن أحدكم إذا كان في الصلاة فإن الله حيال وجهه، فلا يتنخمن حيال وجهه في الصلاة ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     While the Prophet was praying, he saw sputum (on the wall) of the mosque, in the direction of the Qibla, and so he scraped it off with his hand, and the sign of disgust (was apparent from his face) and then said, \"Whenever anyone of you is in prayer, he should not spit in front of him (in prayer) because Allah is in front of him.\"",
      "chain": [
        "20040",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "6884",
      "source": " Sahih Bukhari ",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا جويرية، عن نافع، عن ابن عمر، قال قطع النبي صلى الله عليه وسلم في مجن ثمنه ثلاثة دراهم‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet cut off the hand of a thief for stealing a shield that was worth three Dirhams.",
      "chain": [
        "20040",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "6958",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا جويرية، عن نافع، عن عبد الله  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من حمل علينا السلاح فليس منا ‏\"‏‏.‏ رواه أبو موسى عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet said, \"Whoever carries arms against us, is not from us.\"",
      "chain": [
        "20040",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "7078",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا عبد الله، حدثنا جويرية، عن مالك، عن الزهري، أن سعيد بن المسيب، وأبا، عبيد أخبراه عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لو لبثت في السجن ما لبث يوسف، ثم أتاني الداعي لأجبته ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If I stayed in prison as long as Joseph stayed and then the messenger came, I would respond to his call (to go out of the prison) .\"",
      "chain": [
        "16",
        "20216",
        "20001",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "7293",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء، حدثنا جويرية، عن مالك، عن الزهري، أن حميد بن عبد الرحمن، أخبره أن المسور بن مخرمة أخبره‏.‏ أن الرهط الذين ولاهم عمر اجتمعوا فتشاوروا، قال لهم عبد الرحمن لست بالذي أنافسكم على هذا الأمر، ولكنكم إن شئتم اخترت لكم منكم‏.‏ فجعلوا ذلك إلى عبد الرحمن، فلما ولوا عبد الرحمن أمرهم فمال الناس على عبد الرحمن، حتى ما أرى أحدا من الناس يتبع أولئك الرهط ولا يطأ عقبه، ومال الناس على عبد الرحمن يشاورونه تلك الليالي حتى إذا كانت الليلة التي أصبحنا منها، فبايعنا عثمان قال المسور طرقني عبد الرحمن بعد هجع من الليل فضرب الباب حتى استيقظت فقال أراك نائما، فوالله ما اكتحلت هذه الليلة بكبير نوم، انطلق فادع الزبير وسعدا، فدعوتهما له فشاورهما ثم دعاني فقال ادع لي عليا‏.‏ فدعوته فناجاه حتى ابهار الليل، ثم قام علي من عنده، وهو على طمع، وقد كان عبد الرحمن يخشى من علي شيئا، ثم قال ادع لي عثمان، فدعوته فناجاه حتى فرق بينهما المؤذن بالصبح، فلما صلى للناس الصبح واجتمع أولئك الرهط عند المنبر، فأرسل إلى من كان حاضرا من المهاجرين والأنصار، وأرسل إلى أمراء الأجناد وكانوا وافوا تلك الحجة مع عمر، فلما اجتمعوا تشهد عبد الرحمن ثم قال أما بعد يا علي، إني قد نظرت في أمر الناس فلم أرهم يعدلون بعثمان، فلا تجعلن على نفسك سبيلا‏.‏ فقال أبايعك على سنة الله ورسوله والخليفتين من بعده‏.‏ فبايعه عبد الرحمن، وبايعه الناس المهاجرون والأنصار وأمراء الأجناد والمسلمون‏.‏",
      "text_en": " Narrated Al-Miswar bin Makhrama:                     The group of people whom `Umar had selected as candidates for the Caliphate gathered and consulted each other. `Abdur-Rahman said to them, \"I am not going to compete with you in this matter, but if you wish, I would select for you a caliph from among you.\" So all of them agreed to let `Abdur-Rahman decide the case. So when the candidates placed the case in the hands of `Abdur-Rahman, the people went towards him and nobody followed the rest of the group nor obeyed any after him. So the people followed `Abdur-Rahman and consulted him all those nights till there came the night we gave the oath of allegiance to `Uthman. Al-Miswar (bin Makhrama) added: `Abdur-Rahman called on me after a portion of the night had passed and knocked on my door till I got up, and he said to me, \"I see you have been sleeping! By Allah, during the last three nights I have not slept enough. Go and call Az-Zubair and Sa`d.' So I called them for him and he consulted them and then called me saying, 'Call `Ali for me.\" I called `Ali and he held a private talk with him till very late at night, and then 'Al, got up to leave having had much hope (to be chosen as a Caliph) but `Abdur-Rahman was afraid of something concerning `Ali. `Abdur-Rahman then said to me, \"Call `Uthman for me.\" I called him and he kept on speaking to him privately till the Mu'adh-dhin put an end to their talk by announcing the Adhan for the Fajr prayer. When the people finished their morning prayer and that (six men) group gathered near the pulpit, `Abdur-Rahman sent for all the Muhajirin (emigrants) and the Ansar present there and sent for the army chief who had performed the Hajj with `Umar that year. When all of them had gathered, `Abdur- Rahman said, \"None has the right to be worshipped but Allah,\" and added, \"Now then, O `Ali, I have looked at the people's tendencies and noticed that they do not consider anybody equal to `Uthman, so you should not incur blame (by disagreeing).\" Then `Abdur-Rahman said (to `Uthman), \"I gave the oath of allegiance to you on condition that you will follow Allah's Laws and the traditions of Allah's Apostle and the traditions of the two Caliphs after him.\" So `Abdur-Rahman gave the oath of allegiance to him, and so did the people including the Muhajirin (emigrants) and the Ansar and the chiefs of the army staff and all the Muslims.",
      "chain": [
        "30144",
        "20216",
        "20001",
        "11013",
        "10561",
        "2201"
      ]
    },
    {
      "hadith_no": "7422",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا جويرية، عن نافع، عن عبد الله، قال سابق النبي صلى الله عليه وسلم بين الخيل، فأرسلت التي ضمرت منها وأمدها إلى الحفياء إلى ثنية الوداع، والتي لم تضمر أمدها ثنية الوداع إلى مسجد بني زريق، وأن عبد الله كان فيمن سابق‏.‏ حدثنا قتيبة عن ليث عن نافع عن ابن عمر‏.‏",
      "text_en": " Narrated Nafi`:                     `Abdullah said, \"The Prophet arranged for a horse race, and the prepared horses were given less food for a few days before the race to win the race, and were allowed to run from Al-Hafya to Thaniyat-al- Wada`, and the unprepared horses were allowed to run between Thaniyat-al-Wada` and the mosque of Bani Zuraiq,\" `Abdullah was one of those who participated in the race.",
      "chain": [
        "20040",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "7496",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا جويرية، عن نافع، عن عبد الله، قال ذكر الدجال عند النبي صلى الله عليه وسلم فقال ‏\"‏ إن الله لا يخفى عليكم، إن الله ليس بأعور  وأشار بيده إلى عينه  وإن المسيح الدجال أعور العين اليمنى كأن عينه عنبة طافية ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     Ad-Dajjal was mentioned in the presence of the Prophet. The Prophet said, \"Allah is not hidden from you; He is not one-eyed,\" and pointed with his hand towards his eye, adding, \"While Al-Masih Ad- Dajjal is blind in the right eye and his eye looks like a protruding grape.\"",
      "chain": [
        "20040",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "400",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني به، إن شاء الله عبد الله بن محمد بن أسماء الضبعي حدثنا جويرية، عن مالك، عن الزهري، أن سعيد بن المسيب، وأبا، عبيد أخبراه عن أبي هريرة، عن رسول الله صلى الله عليه وسلم بمثل حديث يونس عن الزهري وفي حديث مالك ‏\"‏ ولكن ليطمئن قلبي ‏\"‏ ‏.‏ قال ثم قرأ هذه الآية حتى جازها ‏.‏",
      "text_en": " 'Abdullah b. Muhammad narrated the same hadith on the authority of Abu Huraira and in the transmission by Malik the words are that he (the Holy Prophet) recited the verse:                     \" but that my heart may rest at ease\" and completed it.",
      "chain": [
        "20216",
        "20001",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "2530",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني عبد الله بن محمد بن أسماء الضبعي، حدثنا جويرية، عن مالك، عن الزهري، أن عبد الله بن عبد الله بن نوفل بن الحارث بن عبد المطلب، حدثه أن عبد المطلب بن ربيعة بن الحارث حدثه قال اجتمع ربيعة بن الحارث والعباس بن عبد المطلب فقالا والله لو بعثنا هذين الغلامين - قالا لي وللفضل بن عباس - إلى رسول الله صلى الله عليه وسلم فكلماه فأمرهما على هذه الصدقات فأديا ما يؤدي الناس وأصابا مما يصيب الناس - قال - فبينما هما في ذلك جاء علي بن أبي طالب فوقف عليهما فذكرا له ذلك فقال علي بن أبي طالب لا تفعلا فوالله ما هو بفاعل ‏.‏ فانتحاه ربيعة بن الحارث فقال والله ما تصنع هذا إلا نفاسة منك علينا فوالله لقد نلت صهر رسول الله صلى الله عليه وسلم فما نفسناه عليك ‏.‏ قال علي أرسلوهما ‏.‏ فانطلقا واضطجع علي - قال - فلما صلى رسول الله صلى الله عليه وسلم الظهر سبقناه إلى الحجرة فقمنا عندها حتى جاء فأخذ بآذاننا ‏.‏ ثم قال ‏\"‏ أخرجا ما تصرران ‏\"‏ ثم دخل ودخلنا عليه وهو يومئذ عند زينب بنت جحش - قال - فتواكلنا الكلام ثم تكلم أحدنا فقال يا رسول الله أنت أبر الناس وأوصل الناس وقد بلغنا النكاح فجئنا لتؤمرنا على بعض هذه الصدقات فنؤدي إليك كما يؤدي الناس ونصيب كما يصيبون - قال - فسكت طويلا حتى أردنا أن نكلمه - قال - وجعلت زينب تلمع علينا من وراء الحجاب أن لا تكلماه - قال - ثم قال ‏\"‏ إن الصدقة لا تنبغي لآل محمد ‏.‏ إنما هي أوساخ الناس ادعوا لي محمية - وكان على الخمس - ونوفل بن الحارث بن عبد المطلب ‏\"‏ ‏.‏ قال فجاءاه فقال لمحمية ‏\"‏ أنكح هذا الغلام ابنتك ‏\"‏ ‏.‏ للفضل بن عباس فأنكحه وقال لنوفل بن الحارث ‏\"‏ أنكح هذا الغلام ابنتك ‏\"‏ ‏.‏ لي فأنكحني وقال لمحمية ‏\"‏ أصدق عنهما من الخمس كذا وكذا ‏\"‏ ‏.‏ قال الزهري ولم يسمه لي ‏.‏",
      "text_en": " 'Abd al-Muttalib b. Rabi'a b. al-Harith reported that Rabi'a b. al-Harith and Abbas b. Abd al-Muttalib gathered together and said:                      By Allah, if we had sent these two young boys (i. e. I and Fadl b. 'Abbas) to the Messenger of Allah (may peace be upon him) and they had spoken to him, he would have appointed them (as the collectors) of these sadaqat; and they would (collect them) and pay (to the Holy Prophet) as other people (collectors) paid and would get a share as other people got it. As they were talking about it there came 'Ali b. Abu Talib and stood before them, and they made a mention of it to him. 'Ali b. Abu Talib said: Don't do that; by Allah he (the Holy Prophet) would not do that (would not accept your request). Rabi'a b. Harith turned to him and said: By Allah, you are not doing so but out of jealousy that you nurse against us By Allah, you became the son-in-law of the Messenger of Allah (may peace be upon him) but we felt no jealousy against you (for this great privilege of yours). 'Ali then said: Send them (if you like). They set out and 'Ali lay on the bed. When the Messenger of Allah (may peace be upon him) offered the noon prayer. we went ahead of him to his apartment and stood near it till he came out. He took hold of our ears (out of love and affection) and then said: Give out what you have kept in your hearts. He then entered (the apartment) and we also went in and he (the Holy Prophet) was on that day (in the house of) Zainab b. jahsh. We urged each (of us) to speak. Then one of us thus spoke: Messenger of Allah, you are the best of humanity and the best to cement the ties of blood-relations. We have reached the-marriageable age. We have come (to you) so that you may appoint us (as collectors) of these sadaqat. and we would pay you just as thin people (other collectors) pay you, and get our share as others get it. He (the Holy Prophet) kept silence for a long time till we wished that we should speak with him (again), and Zainab pointied to us from behind the curtain not to talk (any more). He (the Holy Prophet) said; It does not become the family of Muhammad (to accept) sadaqat for they are the impurities of people. You call to me Mahmiya (and he was in charge of khums, i. e, of the one-fifth part that goes to the treasury out of the spoils of war), and Naufal b. Harith b. 'Abd al-Muttalib. They both came to him, and he (the Holy Prophet) said to Mahmiya: Marry your daughter to this young man (i. e. Fadl b. 'Abbas), and he married her to him And he said to Naufal b. Harith: Marry your daughter to this young man (i e. 'Abd al-Muttalib b. Rabi'a, the narrator of this hadith) and he married her to me, and he said to Mahmiya: Pay so much mahr on behalf of both of them from this khums Zuhri, however. said: He did not determine (the amount of mahr).",
      "chain": [
        "20216",
        "20001",
        "11013"
      ]
    },
    {
      "hadith_no": "3498",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثناه عبد الله بن محمد بن أسماء الضبعي، حدثنا جويرية، عن مالك، بهذا الإسناد وقال سمع علي بن أبي طالب، يقول لفلان إنك رجل تائه نهانا رسول الله صلى الله عليه وسلم ‏.‏ بمثل حديث يحيى بن يحيى عن مالك ‏.‏",
      "text_en": " Malik narrated this hadith on the authority of the same chain of trans- witters that 'Ali b. Abil Talib said to a person:                      You are a person led astray; Allah's Messenger (may peace be upon him) forbade us (to do Mut'a), as is stated In the hadith transmitted on the authority of Yahya b. Malik.",
      "chain": [
        "20216",
        "5"
      ]
    },
    {
      "hadith_no": "3619",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثني عبد الله بن محمد بن أسماء الضبعي، حدثنا جويرية، عن مالك، عن الزهري، عن ابن محيريز، عن أبي سعيد الخدري، أنه أخبره قال أصبنا سبايا فكنا نعزل ثم سألنا رسول الله صلى الله عليه وسلم عن ذلك فقال لنا ‏\"‏ وإنكم لتفعلون وإنكم لتفعلون وإنكم لتفعلون ما من نسمة كائنة إلى يوم القيامة إلا هي كائنة ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported:                      We took women captives, and we wanted to do 'azl with them. We then asked Allah's Messen- ger (may peace be upon him) about it, and he said to us: Verily you do it, verily you do it, verily you do it, but the soul which has to be born until the Day of judg- ment must be born.",
      "chain": [
        "20216",
        "20001",
        "11013",
        "38"
      ]
    },
    {
      "hadith_no": "4676",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثني عبد الله بن محمد بن أسماء الضبعي، حدثنا جويرية، عن مالك، عن الزهري، أن مالك بن أوس، حدثه قال أرسل إلى عمر بن الخطاب فجئته حين تعالى النهار - قال - فوجدته في بيته جالسا على سرير مفضيا إلى رماله متكئا على وسادة من أدم ‏.‏ فقال لي يا مال إنه قد دف أهل أبيات من قومك وقد أمرت فيهم برضخ فخذه فاقسمه بينهم - قال - قلت لو أمرت بهذا غيري قال خذه يا مال ‏.‏ قال فجاء يرفا فقال هل لك يا أمير المؤمنين في عثمان وعبد الرحمن بن عوف والزبير وسعد فقال عمر نعم ‏.‏ فأذن لهم فدخلوا ثم جاء ‏.‏ فقال هل لك في عباس وعلي قال نعم ‏.‏ فأذن لهما فقال عباس يا أمير المؤمنين اقض بيني وبين هذا الكاذب الآثم الغادر الخائن ‏.‏ فقال القوم أجل يا أمير المؤمنين فاقض بينهم وأرحهم ‏.‏ فقال مالك بن أوس يخيل إلى أنهم قد كانوا قدموهم لذلك - فقال عمر اتئدا أنشدكم بالله الذي بإذنه تقوم السماء والأرض أتعلمون أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركنا صدقة ‏\"‏ ‏.‏ قالوا نعم ‏.‏ ثم أقبل على العباس وعلي فقال أنشدكما بالله الذي بإذنه تقوم السماء والأرض أتعلمان أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركناه صدقة ‏\"‏ ‏.‏ قالا نعم ‏.‏ فقال عمر إن الله جل وعز كان خص رسوله صلى الله عليه وسلم بخاصة لم يخصص بها أحدا غيره قال ‏{‏ ما أفاء الله على رسوله من أهل القرى فلله وللرسول‏}‏ ما أدري هل قرأ الآية التي قبلها أم لا ‏.‏ قال فقسم رسول الله صلى الله عليه وسلم بينكم أموال بني النضير فوالله ما استأثر عليكم ولا أخذها دونكم حتى بقي هذا المال فكان رسول الله صلى الله عليه وسلم يأخذ منه نفقة سنة ثم يجعل ما بقي أسوة المال ‏.‏ ثم قال أنشدكم بالله الذي بإذنه تقوم السماء والأرض أتعلمون ذلك قالوا نعم ‏.‏ ثم نشد عباسا وعليا بمثل ما نشد به القوم أتعلمان ذلك قالا نعم ‏.‏ قال فلما توفي رسول الله صلى الله عليه وسلم قال أبو بكر أنا ولي رسول الله صلى الله عليه وسلم فجئتما تطلب ميراثك من ابن أخيك ويطلب هذا ميراث امرأته من أبيها فقال أبو بكر قال رسول الله صلى الله عليه وسلم ‏\"‏ ما نورث ما تركنا صدقة ‏\"‏ ‏.‏ فرأيتماه كاذبا آثما غادرا خائنا والله يعلم إنه لصادق بار راشد تابع للحق ثم توفي أبو بكر وأنا ولي رسول الله صلى الله عليه وسلم وولي أبي بكر فرأيتماني كاذبا آثما غادرا خائنا والله يعلم إني لصادق بار راشد تابع للحق فوليتها ثم جئتني أنت وهذا وأنتما جميع وأمركما واحد فقلتما ادفعها إلينا فقلت إن شئتم دفعتها إليكما على أن عليكما عهد الله أن تعملا فيها بالذي كان يعمل رسول الله صلى الله عليه وسلم فأخذتماها بذلك قال أكذلك قالا نعم ‏.‏ قال ثم جئتماني لأقضي بينكما ولا والله لا أقضي بينكما بغير ذلك حتى تقوم الساعة فإن عجزتما عنها فرداها إلى ‏.‏",
      "text_en": " It is reported by Zuhri that this tradition was narrated to him by Malik b. Aus who said:                      Umar b. al-Khattab sent for me and I came to him when the day had advanced. I found him in his house sitting on his bare bed-stead, reclining on a leather pillow. He said (to me): Malik, some people of your tribe have hastened to me (with a request for help). I have ordered a little money for them. Take it and distribute it among them. I said: I wish you had ordered somebody else to do this job. He said: Malik, take it (and do what you have been told). At this moment (his man-servant) Yarfa' came in and said: Commander of the Faithful, what do you say about Uthman, Abd al-Rabman b. 'Auf, Zubair and Sa'd (who have come to seek an audience with you)? He said: Yes, and permitted them. so they entered. Then he (Yarfa') came again and said: What do you say about 'Ali and Abbas (who are present at the door)? He said: Yes, and permitted them to enter. Abbas said: Commander of the Faithful, decide (the dispute) between me and this sinful, treacherous, dishonest liar. The people (who were present) also said: Yes. Commander of the Faithful, do decide (the dispute) and have mercy on them. Malik b. Aus said: I could well imagine that they had sent them in advance for this purpose (by 'Ali and Abbas). 'Umar said: Wait and be patient. I adjure you by Allah by Whose order the heavens and the earth are sustained, don't you know that the Messenger of Allah (may peace be upon him) said:\" We (prophets) do not have any heirs; what we leave behind is (to be given in) charity\"? They said: Yes. Then he turned to Abbas and 'Ali and said: I adjure you both by Allah by Whose order the heavens and earth are sustained, don't you know that the Messenger of Allah (may peace be upon him) said:\" We do not have any heirs; what we leave behind is (to be given in) charity\"? They (too) said: Yes. (Then) Umar said: Allah, the Glorious and Exalted, had done to His Messenger (may peace be upon him) a special favour that He has not done to anyone else except him. He quoted the Qur'anic verse:\" What Allah has bestowed upon His Apostle from (the properties) of the people of township is for Allah and His Messenger\". The narrator said: I do not know whether he also recited the previous verse or not. Umar continued: The Messenger of Allah (may peace be upon him) distrbuted among you the properties abandoned by Banu Nadir. By Allah, he never preferred himself over you and never appropriated anything to your exclusion. (After a fair distribution in this way) this property was left over. The Messenger of Allah (may peace be upon him) would meet from its income his annual expenditure, and what remained would be deposited in the Bait-ul-Mal. (Continuing further) he said: I adjure you by Allah by Whose order the heavens and the earth are sustained. Do you know this? They said: Yes. Then he adjured Abbas and 'All as he had adjured the other persons and asked: Do you both know this? They said: Yes. He said: When the Messenger of Allah (may peace be upon him) passed away, Abu Bakr said:\" I am the successor of the Messenger of Allah (may peace be upon him).\" Both of you came to demand your shares from the property (left behind by the Messenger of Allah). (Referring to Hadrat 'Abbas), he said: You demanded your share from the property of your nephew, and he (referring to 'Ali) demanded a share on behalf of his wife from the property of her father. Abu Bakr (Allah be pleased with him) said: The Messenger of Allah (may peace be upon him) had said:\" We do not have any heirs; what we leave behind is (to be given in) charity.\" So both of you thought him to be a liar, sinful, treacherous and dishonest. And Allah knows that he was true, virtuous, well-guided and a follower of truth. When Abu Bakr passed away and (I have become) the successor of the Messenger of Allah (may peace be upon him) and Abu Bakr (Allah be pleased with him), you thought me to be a liar, sinful, treacherous and dishonest. And Allah knows that I am true, virtuous, well-guided and a follower of truth. I became the guardian of this property. Then you as well as he came to me. Both of you have come and your purpose is identical. You said: Entrust the property to us. I said: If you wish that I should entrust it to you, it will be on the condition that both of you will undertake to abide by a pledge made with Allah that you will use it in the same way as the Messenger of Allah (may peace be upon him) used it. So both of you got it. He said: Wasn't it like this? They said: Yes. He said: Then you have (again) come to me with the request that I should adjudge between you. No, by Allah. I will not give any other judgment except this until the arrival of the Doomsday. If you are unable to hold the property on this condition, return it to me.",
      "chain": [
        "20216",
        "20001",
        "11013"
      ]
    },
    {
      "hadith_no": "4701",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثني عبد الله بن محمد بن أسماء الضبعي، حدثنا جويرية بن أسماء، عن نافع، عن عبد الله، قال نادى فينا رسول الله صلى الله عليه وسلم يوم انصرف عن الأحزاب ‏\"‏ أن لا يصلين أحد الظهر إلا في بني قريظة ‏\"‏ ‏.‏ فتخوف ناس فوت الوقت فصلوا دون بني قريظة ‏.‏ وقال آخرون لا نصلي إلا حيث أمرنا رسول الله صلى الله عليه وسلم وإن فاتنا الوقت قال فما عنف واحدا من الفريقين ‏.‏",
      "text_en": " It has been narrated on the authority of Abdullah who said:                      On the day he returned from the Battle of Ahzab, the Messenger of Allah (may peace be upon him) made for us an announcement that nobody would say his Zuhr prayer but in the quarters of Banu Quraiza (Some) people, being afraid that the time for prayer would expire, said their prayers before reaching the street of Banu Quraiza. The others said: We will not say our prayer except where the Messenger of Allah (may peace be upon him) has ordered us to say it even if the time expires. When he learned of the difference in the view of the two groups of the people, the Messenger of Allah (may peace be tipon him) did not blame anyone from the two groups.",
      "chain": [
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5968",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثني عبد الله بن محمد بن أسماء الضبعي، حدثنا جويرية، عن نافع، عن  عبد الله، أن أبا لبابة، أخبره أن رسول الله صلى الله عليه وسلم نهى عن قتل الجنان التي في البيوت ‏.‏",
      "text_en": " 'Abdullah reported that Abu Lubaba had informed him that Allah's Messenger (may peace be upon him) had forbidden the killing of the snakes found in the house.",
      "chain": [
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5989",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثني عبد الله بن محمد بن أسماء الضبعي، حدثنا جويرية بن أسماء، عن نافع، عن عبد الله، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ عذبت امرأة في هرة سجنتها حتى ماتت فدخلت فيها النار لا هي أطعمتها وسقتها إذ حبستها ولا هي تركتها تأكل من خشاش الأرض ‏\"‏ ‏.‏",
      "text_en": " Nafi' reported from 'Abdullah that Allah's Messenger (may peace be upon him) said:                      A woman was punished because she had kept a cat tied until it died, and (as a punishment of this offence) she was thrown into the Hell. She had not provided it with food, or drink, and had not freed her so that she could eat the insects of the earth.",
      "chain": [
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "6292",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثناه إن، شاء الله عبد الله بن محمد بن أسماء حدثنا جويرية، عن مالك، عن الزهري، أن سعيد بن المسيب، وأبا، عبيد أخبراه عن أبي هريرة، عن رسول الله صلى الله عليه وسلم بمعنى حديث يونس عن الزهري ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Zuhri through another chain of transmitters.",
      "chain": [
        "20216",
        "20001",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "6359",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا عقبة بن مكرم العمي، حدثنا سعيد بن عامر، قال جويرية بن أسماء أخبرنا  عن نافع، عن ابن عمر، قال قال عمر وافقت ربي في ثلاث في مقام إبراهيم وفي الحجاب وفي أسارى بدر ‏.‏",
      "text_en": " Ibn Umar reported Umar as saying:                      My lord concorded with (my judgments) on three occasions. In case of the Station of Ibrahim, in case of the observance of veil and in case of the prisoners of Badr.",
      "chain": [
        "30441",
        "20232",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "6685",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني عبد الله بن محمد بن أسماء الضبعي، حدثنا جويرية، عن مالك، عن الزهري، أن محمد بن جبير بن مطعم، أخبره أن أباه أخبره أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يدخل الجنة قاطع رحم ‏\"‏ ‏.‏",
      "text_en": " Jubair b. Mutlim reported that his father narrated to him that Allah's Messenger (may peace be upon him) said:                      The severer of the tie of kinship would not get into Paradise.",
      "chain": [
        "20216",
        "20001",
        "11013",
        "11058",
        "871"
      ]
    },
    {
      "hadith_no": "6841",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني عبد الله بن محمد بن أسماء بن عبيد الضبعي، حدثنا جويرية، - يعني ابن أسماء - عن نافع، عن عبد الله، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ عذبت امرأة في هرة سجنتها حتى ماتت فدخلت فيها النار لا هي أطعمتها وسقتها إذ هي حبستها ولا هي تركتها تأكل من خشاش الأرض ‏\"‏ ‏.‏",
      "text_en": " Abdullah reported that Allah's Messenger (may peace be upon him) said:                      A woman was tormented because of a cat which she had confined until it died and she had to get into Hell. She did not allow it either to eat or drink as it was confined, nor did she free it so that it might eat the insects of the earth.",
      "chain": [
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "7088",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة بن سعيد، وعمرو الناقد، وابن أبي عمر، - واللفظ لابن أبي عمر - قالوا حدثنا سفيان، عن محمد بن عبد الرحمن، مولى آل طلحة عن كريب، عن ابن عباس، عن جويرية، أن النبي صلى الله عليه وسلم خرج من عندها بكرة حين صلى الصبح وهي في مسجدها ثم رجع بعد أن أضحى وهي جالسة فقال ‏\"‏ ما زلت على الحال التي فارقتك عليها ‏\"‏ ‏.‏ قالت نعم ‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ لقد قلت بعدك أربع كلمات ثلاث مرات لو وزنت بما قلت منذ اليوم لوزنتهن سبحان الله وبحمده عدد خلقه ورضا نفسه وزنة عرشه ومداد كلماته ‏\"‏ ‏.‏",
      "text_en": " Juwairiya reported that Allah's Messenger (may peace be upon him) came out from (her apartment) in the morning as she was busy in observing her dawn prayer in her place of worship. He came back in the forenoon and she was still sitting there. He (the Holy Prophet) said to her:                      You have been in the same seat since I left you. She said: Yes. Thereupon Allah's Apostle (may peace be upon him) said: I recited four words three times after I left you and if these are to be weighed against what you have recited since morning these would outweigh them and (these words) are:\" Hallowed be Allah and praise is due to Him according to the number of His creation and according to the pleasure of His Self and according to the weight of His Throne and according to the ink (used in recording) words (for His Praise).\"",
      "chain": [
        "30367",
        "30263",
        "30421",
        "20005",
        "10818",
        "11211",
        "17",
        "20216"
      ]
    },
    {
      "hadith_no": "7089",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب وإسحاق عن محمد بن بشر، عن مسعر، عن محمد بن عبد الرحمن، عن أبي رشدين، عن ابن عباس، عن جويرية، قالت مر بها رسول الله صلى الله عليه وسلم حين صلى صلاة الغداة أو بعد ما صلى الغداة ‏.‏ فذكر نحوه غير أنه قال ‏\"‏ سبحان الله عدد خلقه سبحان الله رضا نفسه سبحان الله زنة عرشه سبحان الله مداد كلماته ‏\"‏ ‏.‏",
      "text_en": " Juwairiya reported that Allah's Messenger (may peace be upon him) happened to pass by her as she was observing her dawn prayer; or after she had observed her dawn prayer. The rest of the hadith is the same but with this variation that he said:                     \" Hallowed be Allah according to the number of His creation, hallowed be Allah according to the pleasure of His Self, hallowed be Allah according to the weight of His Throne, hallowed be Allah according to the ink used in recording His words.\"",
      "chain": [
        "30201",
        "20352",
        "20359",
        "11105",
        "17",
        "20216"
      ]
    },
    {
      "hadith_no": "3017",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا عبد الله بن محمد، عن جويرية، عن مالك، عن الزهري، أن سعيد بن المسيب، أخبره أن رسول الله صلى الله عليه وسلم افتتح بعض خيبر عنوة ‏.‏ قال أبو داود وقرئ على الحارث بن مسكين وأنا شاهد أخبركم ابن وهب قال حدثني مالك عن ابن شهاب أن خيبر كان بعضها عنوة وبعضها صلحا والكتيبة أكثرها عنوة وفيها صلح ‏.‏ قلت لمالك وما الكتيبة قال أرض خيبر وهي أربعون ألف عذق ‏.‏",
      "text_en": " Sa’id bin Al Musayyab said “The Apostle of Allaah(ﷺ) conquered a portion of Khaibar by force.”Abu Dawud said “This tradition was read out to Al Harith bin Miskin while I was a witness”. Ibn Wahb said “Malik told me on the authority of Ibn Shihab, Khaibar was captured by force in part and by peace in part. Most of Al Kutaibah was captured by force and a portion by peace.” I asked Malik “What is Al Kutaibah?” He replied “The land of Khaibar. It had forty thousand palm trees.”",
      "chain": [
        "11222",
        "30351",
        "20216",
        "20001",
        "11013",
        "11002"
      ]
    },
    {
      "hadith_no": "3945",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا عبد الله بن محمد بن أسماء، حدثنا جويرية، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمعنى مالك ولم يذكر ‏\"‏ وإلا فقد عتق منه ما عتق ‏\"‏ ‏.‏ انتهى حديثه إلى ‏\"‏ وأعتق عليه العبد ‏\"‏ ‏.‏ على معناه ‏.‏",
      "text_en": " The tradition mentioned above has also been narrated by Ibn 'Umar through a different chain of transmitters to the same effect as mentioned by Malik. In this version there is no mention of the words \"otherwise he will be emancipated to the extent of the first man's share.\" His version ends \"and the slave be thus emancipated,\" to the same effect as he (Malik) mentioned.",
      "chain": [
        "30144",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "317",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا العباس بن عبد العظيم العنبري، قال حدثنا عبد الله بن محمد بن أسماء، قال حدثنا جويرية، عن مالك، عن الزهري، عن عبيد الله بن عبد الله بن عتبة، أنه أخبره عن أبيه، عن عمار بن ياسر، قال تيممنا مع رسول الله صلى الله عليه وسلم بالتراب فمسحنا بوجوهنا وأيدينا إلى المناكب ‏.‏",
      "text_en": " It was narrated that 'Ammar bin Yasir said:                      \"We did Tayammum with the Messenger of Allah (ﷺ) using dust, and we wiped our faces and our arms up to the shoulders.\"",
      "chain": [
        "30437",
        "30144",
        "20216",
        "20001",
        "11013",
        "11004",
        "4145",
        "25"
      ]
    },
    {
      "hadith_no": "1598",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا العباس بن عبد العظيم، قال حدثنا عبد الله بن محمد بن أسماء، قال حدثنا جويرية بن أسماء، عن الوليد بن أبي هشام، عن نافع، أن عبد الله بن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ صلوا في بيوتكم ولا تتخذوها قبورا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Nafi' that Abdullah bin Umar said:                     \"Pray in your houses and do not make them like graves.\"",
      "chain": [
        "30437",
        "30144",
        "20216",
        "10622",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1603",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن إسماعيل أبو بكر، قال حدثنا عبد الله بن محمد بن أسماء، قال حدثنا جويرية، عن مالك، قال قال الزهري أخبرني أبو سلمة بن عبد الرحمن، وحميد بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah (ﷺ) said: \"Whoever prays Qiyam during Ramadan out of faith and in the hope of reward, he will be forgiven his previous sins.\"",
      "chain": [
        "34188",
        "30144",
        "20216",
        "20001",
        "11013",
        "10567",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "1775",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن عبد الله بن يزيد، قال حدثنا أبي قال، حدثنا جويرية بن أسماء، عن نافع، عن عبد الله بن عمر، عن حفصة، أن رسول الله صلى الله عليه وسلم كان يصلي ركعتين إذا طلع الفجر ‏.‏",
      "text_en": " It was narrated from Abdullah bin Umar, from Hafsah, that:                     The Messenger of Allah (ﷺ) used to pray two rak'ahs when dawn had broken.",
      "chain": [
        "20216",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "2201",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني محمد بن إسماعيل، قال حدثنا عبد الله بن محمد بن أسماء، قال حدثنا جويرية، عن مالك، قال الزهري أخبرني أبو سلمة بن عبد الرحمن، وحميد بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah said:                     \"Whoever spends the night of Ramadan in prayer (Qiyam) out of faith and in the hope of reward, he will be forgiven his previous sins.\" '",
      "chain": [
        "34188",
        "30144",
        "20216",
        "20001",
        "11013",
        "10567",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "2859",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن عبد الله بن يزيد المقرئ، قال حدثنا أبي قال، حدثنا جويرية، عن نافع، أن عبد الله بن عبد الله، وسالم بن عبد الله، أخبراه أنهما، كلما عبد الله بن عمر لما نزل الجيش بابن الزبير قبل أن يقتل فقالا لا يضرك أن لا تحج العام إنا نخاف أن يحال بينك وبين البيت ‏.‏ قال خرجنا مع رسول الله صلى الله عليه وسلم فحال كفار قريش دون البيت فنحر رسول الله صلى الله عليه وسلم هديه وحلق رأسه وأشهدكم أني قد أوجبت عمرة إن شاء الله أنطلق فإن خلي بيني وبين البيت طفت وإن حيل بيني وبين البيت فعلت ما فعل رسول الله صلى الله عليه وسلم وأنا معه ‏.‏ ثم سار ساعة ثم قال فإنما شأنهما واحد أشهدكم أني قد أوجبت حجة مع عمرتي ‏.‏ فلم يحلل منهما حتى أحل يوم النحر وأهدى ‏.‏",
      "text_en": " It was narrated from Nafi that:                     Abdulla bin Abdullah and salim bin Abdullah bin Umar when the army besiged Ibn Az-Zubair before he was killed. They said: \"It does not matter if you do not perform Hajj this year; we are afraid lest we are prevented from reaching the House.\" He Sadi: we went out with the Messenger of Allah and the disbelievers of the Quraish prevented us from reaching the House. So the Messenger of Allah slaughtered his Hadi and shave his head. I ask you to bear witness that I have resolved to peform Umrah. If Allah wills I will set out and if I am allowed to reach the House I will circumambulate it, and if I am prevented from reaching the House I will do what the Messenger of Allah did when I was with him.\" Then he traveled for a while, then he said: \"They are both the same. I ask you to bear witness that I have resolved to perform Hajj as well as Umrah. And he did not exit Ihram for either until he exited Ihram on the Day of Sacrifice and offered his Hadi.",
      "chain": [
        "20216",
        "11014"
      ]
    },
    {
      "hadith_no": "3903",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن يحيى بن عبد الله، قال حدثنا عبد الله بن محمد بن أسماء، عن جويرية، عن مالك، عن الزهري، أن سالم بن عبد الله، وذكر، نحوه‏.‏‏ تابعه عقيل بن خالد‏.‏‏",
      "text_en": " It was narrated from Az-Zuhri that Salim bin 'Abdullah narrated something similar.",
      "chain": [
        "11222",
        "30144",
        "20216",
        "20001",
        "11013",
        "11011"
      ]
    },
    {
      "hadith_no": "3914",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن عبد الله بن يزيد المقرئ، قال حدثنا أبي قال، حدثنا جويرية، عن نافع، أن رافع بن خديج، حدث عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم نهى عن كراء المزارع‏.‏‏",
      "text_en": " It was narrated from Nafi' that Rafi' bin Khadij told 'Abdullah bin 'Umar that the Messenger of Allah forbade leasing arable land.",
      "chain": [
        "20216",
        "11014",
        "1986",
        "18"
      ]
    },
    {
      "hadith_no": "5026",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا محمد بن إسمعيل قال حدثنا عبد الله بن محمد بن أسماء قال حدثنا جويرية عن مالك عن الزهري أخبرني أبو سلمة بن عبد الرحمن وحميد بن عبد الرحمن عن أبي هريرة  أن النبي صلى الله عليه وسلم قال من قام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه",
      "text_en": " It was narrated from Abu Hurairah that:                     The Prophet [SAW] said: \"Whoever stands (in the voluntary night prayer of) Ramadan out of faith and in the hope of reward, his previous sins will be forgiven.\"",
      "chain": [
        "30144",
        "20216",
        "20001",
        "11013",
        "13"
      ]
    },
    {
      "hadith_no": "5096",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا العباس بن عبد العظيم، قال حدثنا عبد الله بن محمد بن أسماء، قال حدثنا جويرية بن أسماء، عن الوليد بن أبي هشام، عن نافع، أنه بلغه أن رسول الله صلى الله عليه وسلم لعن الواصلة والمستوصلة والواشمة والمستوشمة ‏.‏",
      "text_en": " It was narrated from Nafi' that he heard that:                     The Messenger of Allah [SAW] cursed the woman who affixes hair extensions and the woman who has that done, the woman who does tattoos and the woman who has that done.",
      "chain": [
        "30437",
        "30144",
        "20216",
        "10622",
        "11014"
      ]
    },
    {
      "hadith_no": "2081",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو كريب، حدثنا عباءة بن كليب الليثي أبو غسان، عن جويرية بن أسماء، عن نافع، عن ابن عمر، ‏.‏ أن رجلا، من أهل البادية أتى النبي  صلى الله عليه وسلم  فقال يا رسول الله إن امرأتي ولدت على فراشي غلاما أسود وإنا أهل بيت لم يكن فينا أسود قط ‏.‏ قال ‏\"‏ هل لك من إبل ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فما ألوانها ‏\"‏ ‏.‏ قال حمر ‏.‏ قال ‏\"‏ هل فيها أسود ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فهل فيها أورق ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فأنى كان ذلك ‏\"‏ ‏.‏ قال عسى أن يكون نزعه عرق ‏.‏ قال ‏\"‏ فلعل ابنك هذا نزعه عرق ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     a man frorn the desert people came to the Prophet and said: \"O Messenger of Allah, my wife has given birth on  my bed to a black boy, and there are no black people among my family.\" He said: \"Do you have camels?\" He said: \"Yes.\" He said: \"What color are they?\" He said: \"Red.\" He said: are there any black ones among them?\" He said, \"No.\" He said: \"Are there any grey ones among them?\" He said- \"Yes.\" He said \"How is that?\" He said: \"Perhaps it is hereditary.\" He said: \"Perhaps (the color of) this son of yours is also hereditary.\"",
      "chain": [
        "30216",
        "20216",
        "11014"
      ]
    },
    {
      "hadith_no": "2371",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، أنبأنا جويرية بن أسماء، حدثنا عبد الله بن يزيد، - مولى المنبعث - عن رجل، من أهل مصر عن سرق، أن النبي صلى الله عليه وسلم أجاز شهادة الرجل ويمين الطالب ‏.‏",
      "text_en": " It was narrated from Surraq that :                     the Prophet (ﷺ) allowed the testimony of a man along with the oath of the claimant.",
      "chain": [
        "30201",
        "20472",
        "20216",
        "12260"
      ]
    },
    {
      "hadith_no": "3808",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا مسعر، حدثني محمد بن عبد الرحمن، عن أبي رشدين، عن ابن عباس، عن جويرية، قالت مر بها رسول الله  صلى الله عليه وسلم  حين صلى الغداة أو بعد ما صلى الغداة وهي تذكر الله فرجع حين ارتفع النهار - أو قال انتصف - وهي كذلك فقال ‏\"‏ لقد قلت منذ قمت عنك أربع كلمات ثلاث مرات هي أكثر وأرجح - أو أوزن - مما قلت سبحان الله عدد خلقه سبحان الله رضا نفسه سبحان الله زنة عرشه سبحان الله مداد كلماته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Juwairiyah said:                     \"The Messenger of Allah (ﷺ) passed by her when he prayed the morning prayer, or after he prayed the morning prayer, and she was remembering Allah.  He came back when the sun had risen\" - or he (one of the narrators) said, \"at midday - and she was still doing that. He said: 'I have said four words, three times, since I left you, and they are greater and weigh more heavily than what you have said.  They are: Subhan-Allahi 'adada khalqiha, Subhan-Allahi rida nafsihi, Subhan-Allahi zinata 'arshihi, Subhan-Allah midada kalimatihi (Glory is to Allah, as much as the number of His creation, glory is to Allah as much as pleases Him, glory is to Allah as much as the weight of His Throne, glory is to Allah as much as the ink of His words'.\"",
      "chain": [
        "30201",
        "20352",
        "20359",
        "11105",
        "17",
        "20216"
      ]
    }
  ],
  "total_hadiths": 71
}