{
  "id": "20218",
  "name": "Hiban bin Hilal حبان بن هلال",
  "full_name": "Hiban bin Hilal حبان بن هلال",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "216",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-Basri",
      "al-Bahli"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20424",
      "name": "Da'ud bin Abi al-Frat داود بن أبي الفرات عمرو",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20543",
      "name": "Sa'id bin Zayd bin Darham سعيد بن زيد بن درهم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "25157",
      "name": "Abd Rbh bin Barq عبد ربه بن بارق الحنفي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20258",
      "name": "'Abdul Warith bin Sa'id bin Dhakwan عبد الوارث بن سعيد بن ذكوان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20297",
      "name": "Hmam bin Yahya bin Dinar همام بن يحيى بن دينار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20115",
      "name": "Ma'mar bin Rashid معمر بن راشد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11307",
      "name": "Mahdi bin Maymun al-Azdi مهدي بن ميمون الأزدي المعولي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20299",
      "name": "Wahayb bin Khalid bin 'Ajlan al-Bahli وهيب بن خالد بن عجلان الباهلي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30295",
      "name": "Ahmed bin Sa'id bin Ibrahim أحمد بن سعيد بن إبراهيم الرباطي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30296",
      "name": "Ahmed bin Sa'id bin Sakhar أحمد بن سعيد بن صخر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30313",
      "name": "Ishaq bin Mansur al-Kausaj إسحاق بن منصور بن بهرام - الكوسج",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30025",
      "name": "'Abdullah bin 'Abdur Rahman al-Daarimi عبد الله بن عبد الرحمن الدارمي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30553",
      "name": "'Abd bin Hameed bin Nasr عبد بن حميد بن نصر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30160",
      "name": "Muhammad bin Bashar Bindar محمد بن بشار بندار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38719",
      "name": "Y'aqub bin Sufyan يعقوب بن سفيان",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1100",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا أحمد بن سعيد، قال حدثنا حبان، قال حدثنا همام، قال حدثنا أنس بن سيرين، قال استقبلنا أنسا حين قدم من الشأم، فلقيناه بعين التمر، فرأيته يصلي على حمار ووجهه من ذا الجانب، يعني عن يسار القبلة‏.‏ فقلت رأيتك تصلي لغير القبلة‏.‏ فقال لولا أني رأيت رسول الله صلى الله عليه وسلم فعله لم أفعله‏.‏ رواه ابن طهمان عن حجاج عن أنس بن سيرين عن أنس  رضى الله عنه  عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas bin Seereen:                     We went to receive Anas bin Malik when he returned from Sham and met him at a place called 'Ainat- Tamr. I saw him praying riding the donkey, with his face to this direction, i.e. to the left of the Qibla. I said to him, \"I have seen you offering the prayer in a direction other than that of the Qibla.\" He replied, \"If I had not seen Allah's Apostle doing it, I would not have done it.\"",
      "chain": [
        "30296",
        "20218",
        "20297",
        "11038"
      ]
    },
    {
      "hadith_no": "1383",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا حبان، أخبرنا عبد الله، أخبرنا شعبة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهم  قال سئل رسول الله صلى الله عليه وسلم عن أولاد المشركين فقال ‏\"‏ الله إذ خلقهم أعلم بما كانوا عاملين ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle (p.b.u.h) was asked about the children of (Mushrikeen) pagans. The Prophet replied, \"Since Allah created them, He knows what sort of deeds they would have done.\"",
      "chain": [
        "20218",
        "20025",
        "20020",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2110",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثني إسحاق، أخبرنا حبان، حدثنا شعبة، قال قتادة أخبرني عن صالح أبي الخليل، عن عبد الله بن الحارث، قال سمعت حكيم بن حزام  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ البيعان بالخيار ما لم يتفرقا، فإن صدقا وبينا بورك لهما في بيعهما، وإن كذبا وكتما محقت بركة بيعهما ‏\"‏‏.‏",
      "text_en": " Narrated Hakim bin Hizam:                     The Prophet said, \"The buyer and the seller have the option of canceling or confirming the bargain unless they separate, and if they spoke the truth and made clear the defects of the goods, them they would be blessed in their bargain, and if they told lies and hid some facts, their bargain would be deprived of Allah's blessings.\"",
      "chain": [
        "30312",
        "20218",
        "20020",
        "11019",
        "11291",
        "912",
        "423"
      ]
    },
    {
      "hadith_no": "2114",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثني إسحاق، حدثنا حبان، حدثنا همام، حدثنا قتادة، عن أبي الخليل، عن عبد الله بن الحارث، عن حكيم بن حزام  رضى الله عنه  أن النبي صلى الله عليه وسلم قال ‏\"‏ البيعان بالخيار ما لم يتفرقا ‏\"‏  قال همام وجدت في كتابي يختار ثلاث مرار  ‏\"‏فإن صدقا وبينا بورك لهما في بيعهما، وإن كذبا وكتما فعسى أن يربحا ربحا، ويمحقا بركة بيعهما ‏\"‏‏.‏   قال وحدثنا همام، حدثنا أبو التياح، أنه سمع عبد الله بن الحارث، يحدث بهذا الحديث عن حكيم بن حزام، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Hakim bin Hizam:                     The Prophet said, \"Both the buyer and the seller have the option of canceling or confirming the bargain unless they separate.\" The sub-narrator, Hammam said, \"I found this in my book: 'Both the buyer and the seller give the option of either confirming or canceling the bargain three times, and if they speak the truth and mention the defects, then their bargain will be blessed, and if they tell lies and conceal the defects, they might gain some financial gain but they will deprive their sale of (Allah's) blessings.\"",
      "chain": [
        "30312",
        "20218",
        "20297",
        "11019",
        "11291",
        "912",
        "423"
      ]
    },
    {
      "hadith_no": "2640",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا حبان، أخبرنا عبد الله، أخبرنا عمر بن سعيد بن أبي حسين، قال أخبرني عبد الله بن أبي مليكة، عن عقبة بن الحارث، أنه تزوج ابنة لأبي إهاب بن عزيز، فأتته امرأة فقالت قد أرضعت عقبة والتي تزوج‏.‏ فقال لها عقبة ما أعلم أنك أرضعتني ولا أخبرتني‏.‏ فأرسل إلى آل أبي إهاب يسألهم فقالوا ما علمنا أرضعت صاحبتنا‏.‏ فركب إلى النبي صلى الله عليه وسلم بالمدينة فسأله، فقال رسول الله صلى الله عليه وسلم ‏\"‏ كيف وقد قيل ‏\"‏‏.‏ ففارقها، ونكحت زوجا غيره‏.‏",
      "text_en": " Narrated `Abdullah bin Abu Mulaika from `Uqba bin Al-Harith:                     `Uqba married the daughter of Abu Ihab bin `Aziz, and then a woman came and said, \"I suckled `Uqba and his wife.\" `Uqba said to her, \"I do not know that you have suckled me, and you did not inform me.\" He then sent someone to the house of Abu Ihab to inquire about that but they did not know that she had suckled their daughter. Then `Uqba went to the Prophet in Medina and asked him about it. The Prophet said to him, \"How (can you keep your wife) after it has been said (that both of you were suckled by the same woman)?\" So, he divorced her and she was married to another (husband).",
      "chain": [
        "20218",
        "20025",
        "10652",
        "11090",
        "872"
      ]
    },
    {
      "hadith_no": "3116",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا حبان، أخبرنا عبد الله، عن يونس، عن الزهري، عن حميد بن عبد الرحمن، أنه سمع معاوية، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من يرد الله به خيرا يفقهه في الدين، والله المعطي وأنا القاسم، ولا تزال هذه الأمة ظاهرين على من خالفهم حتى يأتي أمر الله وهم ظاهرون ‏\"‏‏.‏",
      "text_en": " p>Narrated Muawiya:                     Allah's Apostle said, \"If Allah wants to do good for somebody, he makes him comprehend the Religion (i.e. Islam), and Allah is the Giver and I am Al-Qasim (i.e. the distributor), and this (Muslim) nation will remain victorious over their opponents, till Allah's Order comes and they will still be victorious \"",
      "chain": [
        "20218",
        "20025",
        "20475",
        "11013",
        "10561",
        "27"
      ]
    },
    {
      "hadith_no": "3852",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا علي بن مسلم، حدثنا حبان، حدثنا همام، أخبرنا قتادة، عن أنس  رضى الله عنه  أن رجلين، خرجا من عند النبي صلى الله عليه وسلم في ليلة مظلمة، وإذا نور بين أيديهما حتى تفرقا، فتفرق النور معهما‏.‏ وقال معمر عن ثابت عن أنس أن أسيد بن حضير ورجلا من الأنصار‏.‏ قال حماد أخبرنا ثابت عن أنس كان أسيد بن حضير وعباد بن بشر عند النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas:                     Two men left the Prophet on a very dark night. Suddenly a light came in front of them, and when they separated, the light also separated along with them.",
      "chain": [
        "30261",
        "20218",
        "20297",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "4082",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق، أخبرنا حبان، أخبرنا جويرية بن أسماء، عن نافع، عن ابن عمر  رضى الله عنهما أن النبي صلى الله عليه وسلم حرق نخل بني النضير قال ولها يقول حسان بن ثابت وهان على سراة بني لؤى حريق بالبويرة مستطير قال فأجابه أبو سفيان بن الحارث أدام الله ذلك من صنيع وحرق في نواحيها السعير ستعلم أينا منها بنزه وتعلم أى أرضينا تضير",
      "text_en": " Narrated Ibn `Umar:                     The Prophet burnt the date-palm trees of Bani An-Nadir. Hassan bin Thabit said the following poetic Verses about this event:-- \"the terrible burning of Al-Buwaira Has been received indifferently By the nobles of Bani Luai (The masters and nobles of Quraish).\" Abu Sufyan bin Al-Harith (i.e. the Prophet's cousin who was still a disbeliever then) replied to Hassan, saying in poetic verses:-- \"May Allah bless that burning And set all its (i.e. Medina's) Parts on burning fire. You will see who is far from it (i.e. Al-Buwaira) And which of our lands will be Harmed by it (i.e. the burning of Al- Buwaira).",
      "chain": [
        "30313",
        "20218",
        "20216",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4142",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني حبان، أخبرنا عبد الله، أخبرنا معمر، قال حدثني ثمامة بن عبد الله بن أنس، أنه سمع أنس بن مالك  رضى الله عنه  يقول لما طعن حرام بن ملحان  وكان خاله  يوم بئر معونة قال بالدم هكذا، فنضحه على وجهه ورأسه، ثم قال فزت ورب الكعبة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     That when Haram bin Milhan, his uncle was stabbed on the day of Bir Ma'una he sprinkled his blood over his face and his head this way and then said, \"I have succeeded, by the Lord of the Ka`ba.'",
      "chain": [
        "20218",
        "20025",
        "20115",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "4390",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني حبان، أخبرنا عبد الله، عن زكرياء بن إسحاق، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، مولى ابن عباس عن ابن عباس  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم لمعاذ بن جبل حين بعثه إلى اليمن ‏\"‏ إنك ستأتي قوما من أهل الكتاب، فإذا جئتهم فادعهم إلى أن يشهدوا أن لا إله إلا الله، وأن محمدا رسول الله، فإن هم طاعوا لك بذلك فأخبرهم أن الله قد فرض عليهم خمس صلوات في كل يوم وليلة، فإن هم طاعوا لك بذلك، فأخبرهم أن الله قد فرض عليكم صدقة، تؤخذ من أغنيائهم، فترد على فقرائهم، فإن هم طاعوا لك بذلك، فإياك وكرائم أموالهم، واتق دعوة المظلوم فإنه ليس بينه وبين الله حجاب ‏\"‏‏.‏ قال أبو عبد الله ‏{‏طوعت‏}‏ طاعت وأطاعت لغة، طعت وطعت وأطعت‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle said to Mu`adh bin Jabal when he sent him to Yemen. \"You will come to the people of Scripture, and when you reach them, invite them to testify that none has the right to be worshipped except Allah and that Muhammad is His Apostle. And if they obey you in that, then tell them that Allah has enjoined on them five prayers to be performed every day and night. And if they obey you in that, then tell them that Allah has enjoined on them Sadaqa (i.e. rak`at) to be taken from the rich amongst them and given to the poor amongst them. And if they obey you in that, then be cautious! Don't take their best properties (as Zakat) and be afraid of the curse of an oppressed person as there is no screen between his invocation and Allah.",
      "chain": [
        "20218",
        "20025",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "4483",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني حبان، أخبرنا عبد الله، أخبرنا يونس، عن ابن شهاب، قال أخبرني عروة، أن عائشة  رضى الله عنها  أخبرته أن رسول الله صلى الله عليه وسلم كان إذا اشتكى نفث على نفسه بالمعوذات ومسح عنه بيده فلما اشتكى وجعه الذي توفي فيه طفقت أنفث على نفسه بالمعوذات، التي كان ينفث، وأمسح بيد النبي صلى الله عليه وسلم عنه‏.‏",
      "text_en": " Narrated Aisha:                     Whenever Allah's Apostle became ill, he used to recite the Muawidhatan and blow his breath over himself (after their recitation ) and rubbed his hands over his body. So when he was afflicted with his fatal illness. I started reciting the Muawidhatan and blowing my breath over him as he used to blow and made the hand of the Prophet pass over his body.",
      "chain": [
        "20218",
        "20025",
        "20475",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4574",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا حبان، حدثنا عبد الله، أخبرنا عبد الله بن عون، عن محمد بن سيرين، قال جلست إلى مجلس فيه عظم من الأنصار وفيهم عبد الرحمن بن أبي ليلى، فذكرت حديث عبد الله بن عتبة في شأن سبيعة بنت الحارث، فقال عبد الرحمن ولكن عمه كان لا يقول ذلك‏.‏ فقلت إني لجريء إن كذبت على رجل في جانب الكوفة‏.‏ ورفع صوته، قال ثم خرجت فلقيت مالك بن عامر أو مالك بن عوف قلت كيف كان قول ابن مسعود في المتوفى عنها زوجها وهى حامل فقال قال ابن مسعود أتجعلون عليها التغليظ، ولا تجعلون لها الرخصة لنزلت سورة النساء القصرى بعد الطولى‏.‏ وقال أيوب عن محمد لقيت أبا عطية مالك بن عامر‏.‏",
      "text_en": " Narrated Muhammad bin Seereen:                     I sat in a gathering in which the chiefs of the Ansar were present, and `Abdur-Rahman bin Abu Laila was amongst them. I mentioned the narration of `Abdullah bin `Utba regarding the question of Subai'a bint Al-Harith. `Abdur-Rahman said, \"But `Abdullah's uncle used not to say so.\" I said, \"I am too brave if I tell a lie concerning a person who is now in Al-Kufa,\" and I raised my voice. Then I went out and met Malik bin 'Amir or Malik bin `Auf, and said, \"What was the verdict of Ibn Mas`ud about the pregnant widow whose husband had died?\" He replied, \"Ibn Mas`ud said, 'Why do you impose on her the hard order and don't let her make use of the leave? The shorter Sura of women (i.e. Surat-at- Talaq) was revealed after the longer Sura (i.e. Surat-al-Baqara).\" (i.e. Her 'Idda is up till she delivers.)",
      "chain": [
        "20218",
        "20025",
        "11071",
        "11035"
      ]
    },
    {
      "hadith_no": "4709",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا حبان، حدثنا همام، حدثنا ثابت، حدثنا أنس، قال حدثني أبو بكر  رضى الله عنه  قال كنت مع النبي صلى الله عليه وسلم في الغار، فرأيت آثار المشركين قلت يا رسول الله، لو أن أحدهم رفع قدمه رآنا‏.‏ قال ‏\"‏ ما ظنك باثنين الله ثالثهما ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakr:                     I was in the company of the Prophet in the cave, and on seeing the traces of the pagans, I said, \"O Allah's Apostle If one of them (pagans) should lift up his foot, he will see us.\" He said, \"What do you think of two, the third of whom is Allah?\"",
      "chain": [
        "30351",
        "20218",
        "20297",
        "11269",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "5382",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "وحدثني حبان، أخبرنا عبد الله، أخبرنا ابن جريج، عن ابن شهاب، عن عروة، أن عائشة، أنكرت ذلك على فاطمة‏.‏",
      "text_en": " Narrated 'Ursa:                     Aisha disapproved of what Fatima used to say.'",
      "chain": [
        "20218",
        "20025",
        "11070",
        "11013",
        "10511"
      ]
    },
    {
      "hadith_no": "5793",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا إسحاق، أخبرنا حبان، حدثنا داود بن أبي الفرات، حدثنا عبد الله بن بريدة، عن يحيى بن يعمر، عن عائشة، زوج النبي صلى الله عليه وسلم أنها أخبرتنا أنها سألت رسول الله صلى الله عليه وسلم عن الطاعون فأخبرها نبي الله صلى الله عليه وسلم ‏\"‏ أنه كان عذابا يبعثه الله على من يشاء، فجعله الله رحمة للمؤمنين، فليس من عبد يقع الطاعون فيمكث في بلده صابرا، يعلم أنه لن يصيبه إلا ما كتب الله له، إلا كان له مثل أجر الشهيد ‏\"‏‏.‏ تابعه النضر عن داود‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) that she asked Allah's Apostle about plague, and Allah's Apostle informed her saying, \"Plague was a punishment which Allah used to send on whom He wished, but Allah made it a blessing for the believers. None (among the believers) remains patient in a land in which plague has broken out and considers that nothing will befall him except what Allah has ordained for him, but that Allah will grant him a reward similar to that of a martyr.\"",
      "chain": [
        "30312",
        "20218",
        "20424",
        "11432",
        "11316"
      ]
    },
    {
      "hadith_no": "5964",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا إسحاق، أخبرنا حبان، حدثنا همام، حدثنا قتادة، حدثنا أنس، أن النبي صلى الله عليه وسلم كان يضرب شعره منكبيه‏.‏",
      "text_en": "      Narrated Anas :                          The hair of the Prophet   used to hang down up to his shoulders.",
      "chain": [
        "30312",
        "20218",
        "20297",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6059",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا حبان، أخبرنا عبد الله، عن خالد بن سعيد، عن أبيه، عن أم خالد بنت خالد بن سعيد، قالت أتيت رسول الله صلى الله عليه وسلم مع أبي وعلى قميص أصفر، قال رسول الله صلى الله عليه وسلم ‏\"‏ سنه سنه ‏\"‏‏.‏ قال عبد الله وهى بالحبشية حسنة‏.‏ قالت فذهبت ألعب بخاتم النبوة، فزجرني أبي‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ دعها ‏\"‏‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ أبلي وأخلقي، ثم أبلي وأخلقي، ثم أبلي وأخلقي ‏\"‏‏.‏ قال عبد الله فبقيت حتى ذكر‏.‏ يعني من بقائها‏.‏",
      "text_en": " Narrated Sa`id:                     Um Khalid bint Khalid bin Sa`id said, \"I came to Allah's Apostle along with my father and I was wearing a yellow shirt. Allah's Apostle said, \"Sanah Sanah!\" (`Abdullah, the sub-narrator said, \"It means, 'Nice, nice!' in the Ethiopian language.\") Um Khalid added, \"Then I started playing with the seal of Prophethood. My father admonished me. But Allah's Apostle said (to my father), \"Leave her,\" Allah's Apostle (then addressing me) said, \"May you live so long that your dress gets worn out, and you will mend it many times, and then wear another till it gets worn out (i.e. May Allah prolong your life).\" (The sub-narrator, `Abdullah aid, \"That garment (which she was wearing remained usable for a long period.\").",
      "chain": [
        "20218",
        "20025",
        "20422",
        "11509",
        "740"
      ]
    },
    {
      "hadith_no": "6282",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا إسحاق، أخبرنا حبان، حدثنا همام، حدثنا قتادة، حدثنا أنس بن مالك، قال كان للنبي صلى الله عليه وسلم حاد يقال له أنجشة، وكان حسن الصوت، فقال له النبي صلى الله عليه وسلم ‏\"‏ رويدك يا أنجشة، لا تكسر القوارير ‏\"‏‏.‏ قال قتادة يعني ضعفة النساء‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet had a Had (a camel driver) called Anjasha, and he had a nice voice. The Prophet said to him, \"(Drive) slowly, O Anjasha! Do not break the glass vessels!\" And Qatada said, \"(By vessels') he meant the weak women.\"",
      "chain": [
        "30021",
        "20218",
        "20297",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6382",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا إسحاق، أخبرنا حبان، حدثنا همام، حدثنا قتادة، حدثنا أنس بن مالك، عن النبي صلى الله عليه وسلم‏.‏ وحدثنا هدبة، حدثنا همام، حدثنا قتادة، عن أنس  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الله أفرح بتوبة عبده من أحدكم سقط على بعيره، وقد أضله في أرض فلاة ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle said, \"Allah is more pleased with the repentance of His slave than anyone of you is pleased with finding his camel which he had lost in the desert. \"",
      "chain": [
        "30021",
        "20218",
        "20297",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6411",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا يحيى بن محمد بن السكن، حدثنا حبان بن هلال أبو حبيب، حدثنا هارون المقرئ، حدثنا الزبير بن الخريت، عن عكرمة، عن ابن عباس، قال حدث الناس، كل جمعة مرة، فإن أبيت فمرتين، فإن أكثرت فثلاث مرار ولا تمل الناس هذا القرآن، ولا ألفينك تأتي القوم وهم في حديث من حديثهم فتقص عليهم، فتقطع عليهم حديثهم فتملهم، ولكن أنصت، فإذا أمروك فحدثهم وهم يشتهونه، فانظر السجع من الدعاء فاجتنبه، فإني عهدت رسول الله صلى الله عليه وسلم وأصحابه لا يفعلون إلا ذلك‏.‏ يعني لا يفعلون إلا ذلك الاجتناب‏.‏",
      "text_en": " Narrated `Ikrima:                     Ibn `Abbas said, \"Preach to the people once a week, and if you won't, then preach them twice, but if you want to preach more, then let it be three times (a week only), and do not make the people fed-up with this Qur'an. If you come to some people who are engaged in a talk, don't start interrupting their talk by preaching, lest you should cause them to be bored. You should rather keep quiet, and if they ask you, then preach to them at the time when they are eager to hear what you say. And avoid the use of rhymed prose in invocation for I noticed that Allah's Apostle and his companions always avoided it.\"",
      "chain": [
        "30182",
        "20218",
        "11587",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "6725",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثني إسحاق، أخبرنا حبان، حدثنا همام، حدثنا قتادة، حدثنا أنس بن مالك  رضى الله عنه  أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ أتموا الركوع والسجود، فوالذي نفسي بيده إني لأراكم من بعد ظهري إذا ما ركعتم وإذا ما سجدتم ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     I heard the Prophet saying, \"Perform the bowing and the prostration properly (with peace of mind), for, by Him in Whose Hand my soul is, I see you from behind my back when you bow and when you prostrate.\"",
      "chain": [
        "30021",
        "20218",
        "20297",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6968",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثني إسحاق، أخبرنا حبان، حدثنا همام، حدثنا قتادة، حدثنا أنس بن مالك، أن يهوديا، رض رأس جارية بين حجرين، فقيل لها من فعل بك هذا أفلان أفلان حتى سمي اليهودي فأومأت برأسها، فجيء باليهودي فاعترف، فأمر به النبي صلى الله عليه وسلم فرض رأسه بالحجارة‏.‏ وقد قال همام بحجرين‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A Jew crushed the head of a girl between two stones. It was said to her. \"Who has done this to you, such-and-such person, such-and-such person?\" When the name of the Jew was mentioned, she nodded with her head, agreeing. So the Jew was brought and he confessed. The Prophet ordered that his head be crushed with the stones. (Hammam said, \"with two stones.\")",
      "chain": [
        "30021",
        "20218",
        "20297",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "331",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنيه أحمد بن سعيد بن صخر الدارمي، حدثنا حبان، حدثنا سليمان بن المغيرة، عن ثابت، عن أنس، قال لما نزلت ‏{‏ لا ترفعوا أصواتكم فوق صوت النبي‏}‏ ولم يذكر سعد بن معاذ في الحديث ‏.‏",
      "text_en": " This hadith is narrated on the authority of Anas by another chain of transmitters in which there is no mention of Sa'd b. Mu'adh, but the following words are there:                      We observed a man, one of the dwellers of Paradise, walking about amongst us.",
      "chain": [
        "20218",
        "20236",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "223",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا إسحاق بن منصور، حدثنا حبان بن هلال، حدثنا أبان، حدثنا يحيى، أن زيدا، حدثه أن أبا سلام حدثه عن أبي مالك الأشعري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الطهور شطر الإيمان والحمد لله تملأ الميزان ‏.‏ وسبحان الله والحمد لله تملآن - أو تملأ - ما بين السموات والأرض والصلاة نور والصدقة برهان والصبر ضياء والقرآن حجة لك أو عليك كل الناس يغدو فبائع نفسه فمعتقها أو موبقها ‏\"‏ ‏.‏",
      "text_en": " Abu Malik at-Ash'ari reported:                      The Messenger of Allah (may peace be upon him) said: Cleanliness is half of faith and al-Hamdu Liliah (Praise be to Allah) fills the scale, and Subhan Allah (Glory be to Allah) and al-Hamdu Liliah (Praise be to Allah) fill upwhat is between the heavens and the earth, and prayer is a light, and charity is proof (of one's faith) and endurance is a brightness and the Holy Qur'an is a proof on your behalf or against you. All men go out early in the morning and sell themselves, thereby setting themselves free or destroying themselves.",
      "chain": [
        "30313",
        "20218",
        "20205",
        "11449",
        "10912",
        "10968",
        "5372"
      ]
    },
    {
      "hadith_no": "332",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني أحمد بن سعيد الدارمي، حدثنا حبان، حدثنا وهيب، حدثنا منصور، عن أمه، عن عائشة، أن امرأة، سألت النبي صلى الله عليه وسلم كيف أغتسل عند الطهر فقال ‏\"‏ خذي فرصة ممسكة فتوضئي بها ‏\"‏ ‏.‏ ثم ذكر نحو حديث سفيان ‏.‏",
      "text_en": " 'A'isha reported:                      A woman asked the Apostle of Allah (may peace be upon him) how he should wash herself after the menstrual period. He (the Holy Prophet) said: Take a cotton with musk and purity yourself, and the rest of the hadith was narrated like that of Sufyan.",
      "chain": [
        "30296",
        "20218",
        "20299",
        "11067",
        "53"
      ]
    },
    {
      "hadith_no": "376",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثني أحمد بن سعيد بن صخر الدارمي، حدثنا حبان، حدثنا حماد، عن ثابت، عن أنس، أنه قال أقيمت صلاة العشاء فقال رجل لي حاجة ‏.‏ فقام النبي صلى الله عليه وسلم يناجيه حتى نام القوم - أو بعض القوم - ثم صلوا ‏.‏",
      "text_en": " Anas reported:                      (The people) stood up for the night prayer when a man spoke forth: I need to say something. The Apostle of Allah (may peace be upon him) entered into secret conversation with him, till the people dozed off or some of the people (dozed off), and then they said the prayer.",
      "chain": [
        "30296",
        "20218",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "2146",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "وحدثني أحمد بن سعيد الدارمي، حدثنا حبان، حدثنا وهيب، حدثنا منصور، عن أمه، عن أسماء بنت أبي بكر، قالت كسفت الشمس على عهد النبي صلى الله عليه وسلم ففزع فأخطأ بدرع حتى أدرك بردائه بعد ذلك قالت فقضيت حاجتي ثم جئت ودخلت المسجد فرأيت رسول الله صلى الله عليه وسلم قائما فقمت معه فأطال القيام حتى رأيتني أريد أن أجلس ثم ألتفت إلى المرأة الضعيفة فأقول هذه أضعف مني ‏.‏ فأقوم فركع فأطال الركوع ثم رفع رأسه فأطال القيام حتى لو أن رجلا جاء خيل إليه أنه لم يركع ‏.‏",
      "text_en": " Asma' daughter of Abu Bakr reported:                      The sun eclipsed during the lifetime of the Apostle of Allah (may peace be upon him) ; so he felt perturbed and he, by mistake, took hold of the outer garment of a woman till he was given his own cloak. After this I satisfied my need and then came and entered the mosque. I saw the Messenger of Allah (may peace be upon him) standing in prayer. I stood along with him. He prolonged his qiyam till I wished to sit down. Then I cast a glance towards an old woman. So I said: She is older than I. I, therefore, kept standing. He (the Holy Prophet) then observed ruku', and prolonged his ruku'. He then raised his head. He then prolonged his qiyam to such an extent that if a person happened to come he would have thought that he had not observed the ruku'.",
      "chain": [
        "30296",
        "20218",
        "20299",
        "11067",
        "70"
      ]
    },
    {
      "hadith_no": "2203",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا أبان بن يزيد، ح وحدثني إسحاق، بن منصور - واللفظ له - أخبرنا حبان بن هلال، حدثنا أبان، حدثنا يحيى، أن زيدا، حدثه أن أبا سلام حدثه أن أبا مالك الأشعري حدثه أن النبي صلى الله عليه وسلم قال ‏\"‏ أربع في أمتي من أمر الجاهلية لا يتركونهن الفخر في الأحساب والطعن في الأنساب والاستسقاء بالنجوم والنياحة ‏\"‏ ‏.‏ وقال ‏\"‏ النائحة إذا لم تتب قبل موتها تقام يوم القيامة وعليها سربال من قطران ودرع من جرب ‏\"‏ ‏.‏",
      "text_en": " Abu Malik al-Ash'ari reported Allah's Messenger (may peace be upon him) as saying:                      Among my people there are four characteristics belonging to pre-Islamic period which they do not abandon: boasting of high rank, reviling other peoples' genealogies, seeking rain by stars, and walling. And he (further) said: If the wailing woman does not repent before she dies, she will be made to stand on the Day of Resurrection wearing a garment of pitch and a chemise of mange.",
      "chain": [
        "30201",
        "30106",
        "20205",
        "30313",
        "20218",
        "20205",
        "11449",
        "15"
      ]
    },
    {
      "hadith_no": "2806",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني أحمد بن سعيد الدارمي، حدثنا حبان بن هلال، حدثنا أبان العطار، حدثنا غيلان بن جرير، في هذا الإسناد بمثل حديث شعبة غير أنه ذكر فيه الاثنين ولم يذكر الخميس ‏.‏",
      "text_en": " This hadith has been narrated by Ghailan b. Jarir with the same chain of transmitters, but with one variation, that there has been made mention of Monday and not of Thursday.",
      "chain": [
        "30296",
        "20218",
        "20205",
        "11300"
      ]
    },
    {
      "hadith_no": "3669",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثني أحمد بن سعيد الدارمي، حدثنا حبان، حدثنا همام، حدثنا قتادة، عن أبي، الخليل عن عبد الله بن الحارث، عن أم الفضل، سأل رجل النبي صلى الله عليه وسلم أتحرم المصة فقال ‏\"‏ لا ‏\"‏ ‏.‏",
      "text_en": " Umm Fadl (Allah be pleased with her) reported that a person asked Allah's Apostle (may peace be upon him):                      Does one suckling make (the marriage) unlawful? He said: No.",
      "chain": [
        "30296",
        "20218",
        "20297",
        "11019",
        "11291",
        "912"
      ]
    },
    {
      "hadith_no": "4223",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثني إسحاق بن منصور، أخبرنا حبان بن هلال، أخبرنا أبان، حدثنا يحيى، أن محمد بن إبراهيم، حدثه أن أبا سلمة حدثه أنه، دخل على عائشة فذكر مثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Salama with another chain of transmitters.",
      "chain": [
        "30313",
        "20218",
        "20577",
        "20031",
        "11213",
        "10567"
      ]
    },
    {
      "hadith_no": "4600",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "وحدثني إسحاق بن منصور، أخبرنا حبان بن هلال، حدثنا حماد بن سلمة، حدثني يحيى بن سعيد، وربيعة الرأى بن أبي عبد الرحمن، عن يزيد، مولى المنبعث عن زيد بن، خالد الجهني أن رجلا، سأل النبي صلى الله عليه وسلم عن ضالة الإبل ‏.‏ زاد ربيعة فغضب حتى احمرت وجنتاه ‏.‏ واقتص الحديث بنحو حديثهم وزاد ‏\"‏ فإن جاء صاحبها فعرف عفاصها وعددها ووكاءها فأعطها إياه وإلا فهى لك ‏\"‏ ‏.‏",
      "text_en": " Zaid b. Khalid al-Juhani reported:                      A person asked Allah's Apostle (may peace be upon him) about a lost camel; Rabi'a made this addition: He (the Holy Prophet) was so much annoyed that his cheeks became red.\" The rest of the hadith is the same. He (the narrator) made this addition:\" If its (that of the article) owner comes and he recognises the bag (which contained it) and its number, and the strap. then give that to them, but if not, then it is for you.\"",
      "chain": [
        "30313",
        "20218",
        "20021",
        "11062",
        "11238",
        "3625"
      ]
    },
    {
      "hadith_no": "4903",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا أحمد بن خراش، حدثنا حبان، حدثنا أبو عوانة، ح وحدثني القاسم بن، زكرياء حدثنا عبيد الله بن موسى، عن شيبان، ح وحدثنا إسحاق بن إبراهيم، أخبرنا المصعب بن المقدام الخثعمي، حدثنا إسرائيل، ح وحدثني حجاج، حدثنا عارم بن الفضل، حدثنا حماد بن زيد، حدثنا عبد الله بن المختار، ورجل، سماه كلهم عن زياد بن علاقة، عن عرفجة، عن النبي صلى الله عليه وسلم بمثله غير أن في حديثهم جميعا ‏\"‏ فاقتلوه ‏\"‏ ‏.‏",
      "text_en": " In another version of the tradition narrated on the same authority through a different chains of transmitters we have the words:                     \" Kill him.\"",
      "chain": [
        "20218",
        "20469",
        "20340",
        "20240",
        "30123",
        "20311",
        "20219",
        "20283",
        "20022",
        "24244",
        "11339"
      ]
    },
    {
      "hadith_no": "5689",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثني أحمد بن سعيد الدارمي، أخبرنا حبان، حدثنا وهيب، حدثنا منصور، عن  أمه، عن أسماء بنت أبي بكر، أن امرأة، أتت النبي صلى الله عليه وسلم فقالت إني زوجت ابنتي فتمرق شعر رأسها وزوجها يستحسنها أفأصل يا رسول الله فنهاها ‏.‏",
      "text_en": " Asma', daughter of Abu Bakr, reported that a woman came to Allah's Apostle (may peace be upon him) and said:                      I have married my daughter (whose) hair of head have fallen. Her spouse likes them (the long hair). Allah's Messenger (may add false hair to her head? He forbade her to do this.",
      "chain": [
        "30296",
        "20218",
        "20299",
        "11067",
        "70"
      ]
    },
    {
      "hadith_no": "5811",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا أحمد بن المنذر، حدثنا عبد الصمد، حدثنا حرب، - وهو ابن شداد - ح وحدثني إسحاق بن منصور، أخبرنا حبان، حدثنا أبان، قالا جميعا حدثنا يحيى بن، أبي كثير أن إسحاق بن عبد الله بن أبي طلحة، حدثه في، هذا الإسناد بمثله في المعنى ‏.‏",
      "text_en": " This hadith has been reported on the authority of Ishaq b. 'Abdullah b. Talha with the same chain of transmitters.",
      "chain": [
        "20250",
        "20220",
        "30313",
        "20218",
        "20205",
        "11449",
        "11151"
      ]
    },
    {
      "hadith_no": "5879",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثني أحمد بن سعيد بن صخر الدارمي، حدثنا حبان بن هلال، حدثنا وهيب، حدثنا عبد الله بن طاوس، عن أبيه، عن ابن عباس، أن النبي صلى الله عليه وسلم احتجم وأعطى الحجام أجره واستعط ‏.‏",
      "text_en": " Ibn 'Abbas reported that Allah's Apostle (may peace be upon him) got himself cupped and gave to the cupper his wages and he put the medicine in the nostril.",
      "chain": [
        "30296",
        "20218",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "6200",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني أحمد بن سعيد بن صخر الدارمي، حدثنا حبان، حدثنا حماد، حدثنا ثابت، عن أنس، قال كان رسول الله صلى الله عليه وسلم أزهر اللون كأن عرقه اللؤلؤ إذا مشى تكفأ ولا مسست ديباجة ولا حريرة ألين من كف رسول الله صلى الله عليه وسلم ولا شممت مسكة ولا عنبرة أطيب من رائحة رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Anas reported that Allah's Messenger (may peace be upon him) had a very fair complexion and (the drops) of his perspiration shone like pearls, and when he walked he walked inclining forward, and I never touched brocade and silk (and found it) as soft as the softness of the palm of Allah's Messenger (may peace be upon him) and I never smelt musk or ambergris and found its fragrance as sweet as the fragrance of Allah's Messenger (may peace be upon him).",
      "chain": [
        "30296",
        "20218",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "6214",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثني زهير بن حرب، حدثنا حبان بن هلال، ح وحدثنا محمد بن المثنى، حدثنا  عبد الصمد، قالا حدثنا همام، حدثنا قتادة، عن أنس، أن رسول الله صلى الله عليه وسلم كان يضرب شعره منكبيه ‏.‏",
      "text_en": " Anas reported that the hair of Allah's Messenger (may. peace be upon him) came upon his shoulders.",
      "chain": [
        "30022",
        "20218",
        "30170",
        "20250",
        "20297",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6319",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني زهير بن حرب، وعبد بن حميد، وعبد الله بن عبد الرحمن الدارمي، قال عبد الله أخبرنا وقال الآخران، حدثنا حبان بن هلال، حدثنا همام، حدثنا ثابت، حدثنا  أنس بن مالك، أن أبا بكر الصديق، حدثه قال نظرت إلى أقدام المشركين على رءوسنا ونحن في الغار فقلت يا رسول الله لو أن أحدهم نظر إلى قدميه أبصرنا تحت قدميه فقال ‏\"‏ يا أبا بكر ما ظنك باثنين الله ثالثهما ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported that Abu Bakr Siddiq reported him thus:                      I saw the feet of the polytheists very close to us as we were in the cave. I said: Allah's Messenger, if one amongst them were to see at his feet he would have surely seen us. Thereupon he said: Abu Bakr, what can befall two who have Allah as the third One with them.",
      "chain": [
        "30022",
        "30553",
        "30025",
        "18",
        "20218",
        "20297",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "6416",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني أحمد بن سعيد الدارمي، حدثنا حبان، حدثنا وهيب، حدثنا موسى بن عقبة، حدثني سالم، عن عبد الله، بمثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority 'Abdullah through another chain of transmitters.",
      "chain": [
        "30296",
        "20218",
        "20299",
        "11106",
        "11011"
      ]
    },
    {
      "hadith_no": "6667",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني محمد بن حاتم، حدثنا شبابة، حدثنا محمد بن طلحة، ح وحدثني أحمد، بن خراش حدثنا حبان، حدثنا وهيب، كلاهما عن ابن شبرمة، بهذا الإسناد في حديث وهيب من أبر وفي حديث محمد بن طلحة أى الناس أحق مني بحسن الصحبة ثم ذكر بمثل حديث جرير ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn Shubruma with the same chain of transmitters and the hadith transmitted on the authority of Wuhaib there is a slight variation of wording. Same is the case with the hadith transmitted on the authority of Muhammad b. Talha (and the words are):                     \" Who amongst the people deserves the best treatment from me\".",
      "chain": [
        "38487",
        "20426",
        "20604",
        "20218"
      ]
    },
    {
      "hadith_no": "6705",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "وحدثني أحمد بن سعيد الدارمي، حدثنا حبان، حدثنا وهيب، حدثنا سهيل، عن  أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تباغضوا ولا تدابروا ولا تنافسوا وكونوا عباد الله إخوانا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Don't bear aversion against one another and don't be jealous of one another and be servants of Allah.",
      "chain": [
        "30296",
        "20218",
        "20299",
        "13"
      ]
    },
    {
      "hadith_no": "6950",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Knowledge - كتاب العلم",
      "chapter_no": "48",
      "text_ar": "حدثني أحمد بن سعيد بن صخر الدارمي، حدثنا حبان، حدثنا أبان، حدثنا أبو عمران قال قال لنا جندب ونحن غلمان بالكوفة قال رسول الله صلى الله عليه وسلم ‏\"‏ اقرءوا القرآن ‏\"‏ ‏.‏ بمثل حديثهما ‏.‏",
      "text_en": " Abu Imran reported that Jundub told us as we we-re young boys living in Kilfa, that Allah's Messenger (may peace be upon him) had said:                      Recite the Qur'an. The rest of the hadith is the same.",
      "chain": [
        "30296",
        "20218",
        "20577",
        "11296"
      ]
    },
    {
      "hadith_no": "7101",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا زهير بن حرب، حدثنا حبان بن هلال، حدثنا وهيب، حدثنا سعيد الجريري، عن أبي عبد الله الجسري، عن ابن الصامت، عن أبي ذر، أن رسول الله صلى الله عليه وسلم سئل أى الكلام أفضل قال ‏\"‏ ما اصطفى الله لملائكته أو لعباده سبحان الله وبحمده ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported that Allah's Messenger (may peace be upon him) was asked as to which words were the best. He said:                      Those for which Allah made a choice for His Angels and His servants (and the words are):\" Hallowed be Allah and praise is due to Him.\"",
      "chain": [
        "30022",
        "20218",
        "20299",
        "11286",
        "23"
      ]
    },
    {
      "hadith_no": "1298",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن سفيان الأبلي، حدثنا حبان بن هلال أبو حبيب، حدثنا مهدي بن ميمون، حدثنا عمرو بن مالك، عن أبي الجوزاء، قال حدثني رجل، كانت له صحبة يرون أنه عبد الله بن عمرو قال قال النبي صلى الله عليه وسلم ‏\"‏ ائتني غدا أحبوك وأثيبك وأعطيك ‏\"‏ ‏.‏ حتى ظننت أنه يعطيني عطية قال ‏\"‏ إذا زال النهار فقم فصل أربع ركعات ‏\"‏ ‏.‏ فذكر نحوه قال ‏\"‏ ترفع رأسك - يعني من السجدة الثانية - فاستو جالسا ولا تقم حتى تسبح عشرا وتحمد عشرا وتكبر عشرا وتهلل عشرا ثم تصنع ذلك في الأربع ركعات ‏\"‏ ‏.‏ قال ‏\"‏ فإنك لو كنت أعظم أهل الأرض ذنبا غفر لك بذلك ‏\"‏ ‏.‏ قلت فإن لم أستطع أن أصليها تلك الساعة قال ‏\"‏ صلها من الليل والنهار ‏\"‏ ‏.‏ قال أبو داود حبان بن هلال خال هلال الرائي ‏.‏ قال أبو داود رواه المستمر بن الريان عن أبي الجوزاء عن عبد الله بن عمرو موقوفا ورواه روح بن المسيب وجعفر بن سليمان عن عمرو بن مالك النكري عن أبي الجوزاء عن ابن عباس قوله وقال في حديث روح فقال حديث النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr:                     AbulJawza' said: A man who attended the company of the Prophet (ﷺ) narrated to me (it is thought that he was Abdullah ibn Amr): The Prophet (ﷺ) said to me: Come to me tomorrow; I shall give you something, I shall give you something, I shall reward you something, I shall donate something to you. I thought that he would give me some present.  He said (to me when I came to him): When the day declines, stand up and pray four rak'ahs. He then narrated something similar.  This version adds: Do not stand until you glorify Allah ten times, and praise Him ten times, and exalt Him ten times, and say, \"There is no god but Allah\" ten times. Then you should do that in four rak'ahs. If you are the greatest sinner on earth, you will be forgiven (by Allah) on account of this (prayer).  I asked: If I cannot pray this the appointed hour, (what should I do)? He replied: Pray that by night or by day (at any time).Abu Dawud said: Habban b. Hilal is the maternal uncle of Hilal al-Ra'i.Abu Dawud said: This tradition has been narrated by al-Mustamir b. al-Riyyan from Ibn al-Jawza' from 'Abd Allah b. 'Amr without referring to the Prophet (ﷺ), - narrated as a statement of 'Abd Allah b. 'Amr himself (mauquf). This has also been narrated by Rawh b. al-Musayyab, and Ja'far b. Sulaiman from 'Amr b. Malik al-Nakri from Abu al-Jauza' from Ibn 'Abbas as his own statement (and not the statement of the Prophet). But the version of Rawh has the words: \"The tradition of the Prophet (ﷺ).\"",
      "chain": [
        "38508",
        "20218",
        "11307",
        "11265",
        "29"
      ]
    },
    {
      "hadith_no": "3566",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا إبراهيم بن المستمر العصفري، حدثنا حبان بن هلال، حدثنا همام، عن قتادة، عن عطاء بن أبي رباح، عن صفوان بن يعلى، عن أبيه، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ إذا أتتك رسلي فأعطهم ثلاثين درعا وثلاثين بعيرا ‏\"‏ ‏.‏ قال فقلت يا رسول الله أعارية مضمونة أو عارية مؤداة قال ‏\"‏ بل مؤداة ‏\"‏ ‏.‏ قال أبو داود حبان خال هلال الرأى ‏.‏",
      "text_en": " Narrated Ya'la ibn Umayyah:                     The Messenger of Allah (ﷺ) said to me: When my messengers come to you, give them thirty coats of mail, and thirty camels. I asked: Messenger of Allah, is it a loan with a guarantee of its return, or a loan to be paid back? He replied : It is a loan to be paid back.",
      "chain": [
        "34023",
        "20218",
        "20297",
        "11019",
        "11029",
        "11248",
        "897"
      ]
    },
    {
      "hadith_no": "815b",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا إسحاق بن منصور، حدثنا حبان بن هلال، حدثنا همام، حدثنا قتادة، قال قلت لأنس بن مالك كم حج النبي صلى الله عليه وسلم قال حجة واحدة واعتمر أربع عمر عمرة في ذي القعدة وعمرة الحديبية وعمرة مع حجته وعمرة الجعرانة إذ قسم غنيمة حنين ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وحبان بن هلال هو أبو حبيب البصري هو جليل ثقة وثقه يحيى بن سعيد القطان ‏.‏",
      "text_en": " Qatadah narrated:                     \"I said to Anas bin Malik: 'How many times did the Prophet perform Hajj?' He said: 'He performed one Hajj and he performed four Umrah: An Umrah during Dhul-Qa'dah; the Umrah of Al-Hudaibiyah, and Umrah with his Hajj, and an Umrah from Al-Ji'irranah when he divided up the war spoils of Hunain.'\"",
      "chain": [
        "30313",
        "20218",
        "20297",
        "11019"
      ]
    },
    {
      "hadith_no": "1258",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن سعيد الدارمي، حدثنا حبان، وهو ابن هلال أبو حبيب البصري حدثنا هارون الأعور المقرئ، وهو ابن موسى القارئ حدثنا الزبير بن الخريت، عن أبي لبيد، عن عروة البارقي، قال دفع إلى رسول الله صلى الله عليه وسلم دينارا لأشتري له شاة فاشتريت له شاتين فبعت إحداهما بدينار وجئت بالشاة والدينار إلى النبي صلى الله عليه وسلم ‏.‏ فذكر له ما كان من أمره فقال له ‏\"‏ بارك الله لك في صفقة يمينك ‏\"‏ ‏.‏ فكان يخرج بعد ذلك إلى كناسة الكوفة فيربح الربح العظيم فكان من أكثر أهل الكوفة مالا ‏.‏",
      "text_en": " Narrated 'Urwah Al-Bariqi:                     \"The Messenger of Allah (ﷺ) gave me on Dinar to purchase a sheep for him. So I purchased two sheeps for him, and I sold one of them for a Dinar. So I returned with the sheep and the Dinar to the Prophet (ﷺ), and I mentioned what had happened and he said: 'May Allah bless you in your business dealings.' After that we went to Kunasah in Al-Kufah, and he made tremendous profits. He was among the wealthiest of the people in Al-Kufah.\"",
      "chain": [
        "30296",
        "20218",
        "11587",
        "5176"
      ]
    },
    {
      "hadith_no": "1258",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن سعيد الدارمي، حدثنا حبان، حدثنا سعيد بن زيد، هو أخو حماد بن زيد قال حدثنا الزبير بن خريت، عن أبي لبيد، فذكر نحوه ‏.‏ قال أبو عيسى وقد ذهب بعض أهل العلم إلى هذا الحديث وقالوا به وهو قول أحمد وإسحاق ‏.‏ ولم يأخذ بعض أهل العلم بهذا الحديث منهم الشافعي ‏.‏ وسعيد بن زيد أخو حماد بن زيد ‏.‏ وأبو لبيد اسمه لمازة بن زبار ‏.‏",
      "text_en": " Another chain of narration with similar meaning.[Abu 'Eisa said:                     ] Some of the people of knowledge followed this Hadith and stated their view accordingly. This is the view of Ahmad and Ishaq. Some of the people of knowledge did not use this Hadith, among them are Ash-Shafi'i and Sa'eed bin Zaid the brother of Hammad bin Zaid. And Abu Labid's (a narrator) name is Limazah bin Zabbar.",
      "chain": [
        "30296",
        "20218",
        "11"
      ]
    },
    {
      "hadith_no": "1387",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا أحمد بن سعيد الدارمي، أخبرنا حبان، وهو ابن هلال حدثنا محمد بن راشد، أخبرنا سليمان بن موسى، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قتل مؤمنا متعمدا دفع إلى أولياء المقتول فإن شاءوا قتلوا وإن شاءوا أخذوا الدية وهي ثلاثون حقة وثلاثون جذعة وأربعون خلفة وما صالحوا عليه فهو لهم ‏\"‏ ‏.‏ وذلك لتشديد العقل ‏.‏ قال أبو عيسى حديث عبد الله بن عمرو حديث حسن غريب ‏.‏",
      "text_en": " Narrated Amr bin Shu'aib:                     from his father, from his grandfather that the Prophet (ﷺ) said: \"Whoever kills [a believer] deliberately, he is handed over to the guardians of the one killed. If they wish to, they have him killed, and if they wish to, they take the blood-money. That is thirty Hiqqah, thirty Jadha'ahs and forty pregnant camels. Whatever (amount more) they require from him, than that is for them (if they choose).\" THat is because of the severity of blood-money.",
      "chain": [
        "30296",
        "20218",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1773",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا حبان بن هلال، حدثنا همام، حدثنا قتادة، عن أنس، أن رسول الله صلى الله عليه وسلم كان نعلاه لهما قبالان ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال وفي الباب عن ابن عباس وأبي هريرة ‏.‏",
      "text_en": " Narrated Qatadah:                     From Anas: \"The sandals of the Prophet (ﷺ) had two straps.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.He said: There are narrations on this topic from Ibn 'Abbas, and Abu Hurairah.",
      "chain": [
        "30313",
        "20218",
        "20297",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "2150",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن الحسن بن خراش البغدادي، حدثنا حبان بن هلال، حدثنا مبارك بن فضالة، حدثني عبد ربه بن سعيد، عن محمد بن المنكدر، عن جابر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن من أحبكم إلى وأقربكم مني مجلسا يوم القيامة أحاسنكم أخلاقا وإن أبغضكم إلى وأبعدكم مني مجلسا يوم القيامة الثرثارون والمتشدقون والمتفيهقون ‏\"‏ ‏.‏ قالوا يا رسول الله قد علمنا الثرثارون والمتشدقون فما المتفيهقون قال ‏\"‏ المتكبرون ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي هريرة ‏.‏ وهذا حديث حسن غريب من هذا الوجه ‏.‏ وروى بعضهم هذا الحديث عن المبارك بن فضالة عن محمد بن المنكدر عن جابر عن النبي صلى الله عليه وسلم ولم يذكر فيه عن عبد ربه بن سعيد وهذا أصح ‏.‏ والثرثار هو الكثير الكلام والمتشدق الذي يتطاول على الناس في الكلام ويبذو عليهم ‏.‏",
      "text_en": " Jabir narrated that the Messenger of Allah said:                     \"Indeed the most beloved among you to me, and the nearest to sit with me on the Day of Judgment is the best of you in character. And indeed, the most disliked among you to me, and the one sitting furthest from me on the Day of Judgement are the Thartharun, and the Mutashaddiqun and the Muthafaihiqun.\" They said: \"O Messenger of Allah! We know about the Thartharun, and the Mutashaddiqun, but what about the Muthafaihiqun?\"' He said:\"The arrogant.\"",
      "chain": [
        "30292",
        "20218",
        "14352",
        "11191",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "3183",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Recitation - كتاب القراءات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "46",
      "text_ar": "حدثنا يحيى بن موسى، حدثنا وكيع، وحبان بن هلال، قالا حدثنا هارون النحوي، عن ثابت البناني، عن شهر بن حوشب، عن أم سلمة، أن رسول الله صلى الله عليه وسلم قرأ هذه الآية ‏:‏ ‏(‏إنه عمل غير صالح ‏)‏‏.‏",
      "text_en": " Narrated Umm Salamah:                     \"The Messenger of Allah (ﷺ) recited this Ayah: 'Innahu 'Amalun Ghairu Salih'\" (11:46)",
      "chain": [
        "30221",
        "20032",
        "20218",
        "11269",
        "11044",
        "56"
      ]
    },
    {
      "hadith_no": "3206",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا حبان بن هلال، حدثنا سهيل بن عبد الله، وهو ابن أبي حزم أخو حزم القطعي حدثنا أبو عمران الجوني، عن جندب بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال في القرآن برأيه فأصاب فقد أخطأ ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وقد تكلم بعض أهل العلم في سهيل بن أبي حزم ‏.‏ قال أبو عيسى هكذا روي عن بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أنهم شددوا في هذا في أن يفسر القرآن بغير علم ‏.‏ وأما الذي روي عن مجاهد وقتادة وغيرهما من أهل العلم أنهم فسروا القرآن فليس الظن بهم أنهم قالوا في القرآن أو فسروه بغير علم أو من قبل أنفسهم وقد روي عنهم ما يدل على ما قلنا أنهم لم يقولوا من قبل أنفسهم بغير علم ‏.‏",
      "text_en": " Narrated Jundab bin 'Abdullah:                     that the Messenger of Allah (ﷺ) said: \"Whoever says (something) about the Qur'an according to his own opinion and he is correct, yet he has committed a mistake.\"",
      "chain": [
        "30553",
        "20218",
        "11296",
        "4053"
      ]
    },
    {
      "hadith_no": "3289",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، أخبرنا حبان بن هلال، حدثنا همام بن يحيى، حدثنا قتادة، عن أبي الخليل، عن أبي علقمة الهاشمي، عن أبي سعيد الخدري، قال لما كان يوم أوطاس أصبنا نساء لهن أزواج في المشركين فكرههن رجال منهم فأنزل الله ‏:‏ ‏(‏والمحصنات من النساء إلا ما ملكت أيمانكم ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Narrated Abu Sa'eed Al-Khudri:                     \"On the Day of Awtas, we captured some women who had husbands among the idolaters. So some of the men disliked that, so Allah, Most High, revealed: And women already married, except those whom your right hands possess... (4:24)\"",
      "chain": [
        "30553",
        "20218",
        "20297",
        "11019",
        "11291",
        "10876",
        "38"
      ]
    },
    {
      "hadith_no": "3545",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا حبان بن هلال، وسليمان بن حرب، وحجاج بن منهال، قالوا حدثنا حماد بن سلمة، عن ثابت، عن شهر بن حوشب، عن أسماء بنت يزيد، قالت سمعت رسول الله صلى الله عليه وسلم يقرأ ‏:‏ ‏(‏يا عبادي الذين أسرفوا على أنفسهم لا تقنطوا من رحمة الله إن الله يغفر الذنوب جميعا ‏)‏ ولا يبالي ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث ثابت عن شهر بن حوشب ‏.‏ قال وشهر بن حوشب يروي عن أم سلمة الأنصارية وأم سلمة الأنصارية هي أسماء بنت يزيد ‏.‏",
      "text_en": " Narrated Asma bint Yazid:                     \"I heard the Messenger of Allah (ﷺ) reciting: 'Say: \"O My slaves who have transgressed against themselves! Despair not of the mercy of Allah, verily, Allah forgives all sins and I do not mind (referring to 39:53).\"",
      "chain": [
        "30553",
        "20218",
        "20193",
        "20219",
        "20021",
        "11269",
        "11044",
        "84"
      ]
    },
    {
      "hadith_no": "3517",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا إسحاق بن منصور، حدثنا حبان بن هلال، حدثنا أبان، هو ابن يزيد العطار حدثنا يحيى، أن زيد بن سلام، حدثه أن أبا سلام حدثه عن أبي مالك الأشعري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الوضوء شطر الإيمان والحمد لله تملأ الميزان وسبحان الله والحمد لله تملآن أو تملأ ما بين السموات والأرض والصلاة نور والصدقة برهان والصبر ضياء والقرآن حجة لك أو عليك كل الناس يغدو فبائع نفسه فمعتقها أو موبقها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Malik Al-Ashari narrated that the Messenger of Allah said:                     “Al-Wudu is half of faith, and All praise is due to Allah (Al-Hamdulillah) fills the Scale, and Glory is to Allah and all praise is to Allah (Subhan Allah Wal-Hamdulillah)’ fill” - or - “fills what is between the heavens and the earth, and Salat is light and charity is an evidence, and patience is an illumination, and the Quran is a proof for you or against you. And all people shall come to the morning selling their souls, either setting it free or destroying it.”",
      "chain": [
        "30313",
        "20218",
        "20205",
        "11449",
        "10912",
        "5372"
      ]
    },
    {
      "hadith_no": "397",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا محمد بن حاتم، قال حدثنا حبان، قال حدثنا عبد الله، عن معمر، عن همام بن منبه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏‏\"‏‏ لا يبولن الرجل في الماء الدائم ثم يغتسل منه أو يتوضأ ‏‏\"‏‏ ‏‏.‏‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                      \"None of you should urinate into standing water and then perform Ghusl or Wudu' with it.\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "597",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا أبو عاصم، خشيش بن أصرم قال حدثنا حبان بن هلال، حدثنا حبيب، - وهو ابن أبي حبيب - عن عمرو بن هرم، عن جابر بن زيد، عن ابن عباس، أنه صلى بالبصرة الأولى والعصر ليس بينهما شىء والمغرب والعشاء ليس بينهما شىء فعل ذلك من شغل وزعم ابن عباس أنه صلى مع رسول الله صلى الله عليه وسلم بالمدينة الأولى والعصر ثمان سجدات ليس بينهما شىء ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that he prayed Al-Uula (Zuhr) and 'Asr together in Al-Basrah with nothing in between them, and he prayed Maghrib and 'Isha' together with nothing in between them. He did that because he was busy and Ibn 'Abbas said that he had prayed Zuhr and 'Isha' together with the Messenger of Allah (ﷺ) in Al-Madinah, eight Rak'ahs with nothing in between.",
      "chain": [
        "38204",
        "20218",
        "10708",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "632",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا أبو عاصم، قال حدثنا حبان بن هلال، حدثنا حبيب، عن عمرو بن هرم، عن جابر بن زيد، عن ابن عباس، قال أدلج رسول الله صلى الله عليه وسلم ثم عرس فلم يستيقظ حتى طلعت الشمس أو بعضها فلم يصل حتى ارتفعت الشمس فصلى وهي صلاة الوسطى ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                      \"The Messenger of Allah (ﷺ) set out at nightfall, then stopped to camp at the end of the night, and he did not wake up until the sun had risen or had partly risen. He did not pray until the sun had risen (fully), then he prayed, and that was the 'middle prayer' (Salat Al-Wusta).\"",
      "chain": [
        "20241",
        "20218",
        "11276",
        "10708",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا حبان، قال حدثنا أبان، قال حدثنا يحيى بن أبي كثير، عن الحضرمي بن لاحق، عن زيد، عن أبي سلام، عن الحكم بن ميناء، أنه سمع ابن عباس، وابن، عمر يحدثان أن رسول الله صلى الله عليه وسلم قال وهو على أعواد منبره ‏\"‏ لينتهين أقوام عن ودعهم الجمعات أو ليختمن الله على قلوبهم وليكونن من الغافلين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Al-Hakam bin Mina' that:                     He heard Ibn Abbas and Ibn Umar narrated that while he was on the minbar, the Messenger of Allah (ﷺ) said: \"People should stop negleting jumu'ah or Allah (SWT) will place a seal on their hearts and they will be deemed as being among the negligent.\"",
      "chain": [
        "30172",
        "20218",
        "20577",
        "11449",
        "12060",
        "15",
        "11840",
        "17"
      ]
    },
    {
      "hadith_no": "1633",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرني أحمد بن سعيد، قال حدثنا حبان، قال حدثنا حماد بن سلمة، قال أنبأنا ثابت، وسليمان التيمي، عن أنس، أن النبي صلى الله عليه وسلم قال ‏\"‏ مررت على قبر موسى عليه السلام وهو يصلي في قبره ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas that:                     The Prophet (ﷺ) said: \"I passed by the grave of Musa, peace be upon him, and he was praying in his grave.\"",
      "chain": [
        "30296",
        "20218",
        "20021",
        "11269",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "1800",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن حاتم بن نعيم، قال حدثنا حبان، ومحمد بن مكي، قالا أنبأنا عبد الله، عن أبي يونس القشيري، عن ابن أبي رباح، عن شهر بن حوشب، حدثه عن أم حبيبة بنت أبي سفيان، قالت من صلى ثنتى عشرة ركعة في يوم فصلى قبل الظهر بنى الله له بيتا في الجنة ‏.‏",
      "text_en": " It was narrated that Umm Habibah bint Abi Sufyan said:                     \"Whoever prays twelve rak'ahs in a day and prays before Zuhr, Allah (SWT) will build for him a house in Paradise.\"",
      "chain": [
        "30514",
        "20218",
        "18",
        "11044",
        "59"
      ]
    },
    {
      "hadith_no": "1806",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن حاتم، قال حدثنا محمد بن مكي، وحبان، قالا حدثنا عبد الله، عن إسماعيل، عن المسيب بن رافع، عن أم حبيبة، قالت من صلى في يوم وليلة ثنتى عشرة ركعة سوى المكتوبة بنى الله عز وجل له بيتا في الجنة ‏.‏ لم يرفعه حصين وأدخل بين عنبسة وبين المسيب ذكوان ‏.‏",
      "text_en": " It was narrated that Umm Habibah said:                     \"Whoever prays twelve rak'ahs during the night and day apart from the prescribed prayers, Allah (SWT), the Mighty and Sublime, will build for him a house in Paradise.\"",
      "chain": [
        "30514",
        "20218",
        "18",
        "20208",
        "11394",
        "59"
      ]
    },
    {
      "hadith_no": "2124",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أحمد بن عثمان أبو الجوزاء، - وهو ثقة بصري أخو أبي العالية - قال أنبأنا حبان بن هلال، قال حدثنا حماد بن سلمة، عن عمرو بن دينار، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ صوموا لرؤيته وأفطروا لرؤيته فإن غم عليكم فأكملوا العدة ثلاثين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn Abbas said:                     \"The Messenger of Allah said; 'Fast when you see it and stop fasting when you see it, and if it is obscured from you (too cloudy), then complete thirty (days).\"'",
      "chain": [
        "30185",
        "20218",
        "20021",
        "11081",
        "17"
      ]
    },
    {
      "hadith_no": "2128",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن حاتم، قال حدثنا حبان، قال حدثنا عبد الله، عن الحجاج بن أرطاة، عن منصور، عن ربعي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا رأيتم الهلال فصوموا وإذا رأيتموه فأفطروا فإن غم عليكم فأتموا شعبان ثلاثين إلا أن تروا الهلال قبل ذلك ثم صوموا رمضان ثلاثين إلا أن تروا الهلال قبل ذلك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ribi said;\"the Messenger of Allah said:                      \"The Messenger of Allah said: 'When you see the crescent then fast, and when you see it, then stop fasting. If it is too cloudy then complete Shaban as thirty days, unless you see the crescent before that, then fast Ramadan as thirty days, unless you see the new crescent before that.\"'",
      "chain": [
        "30514",
        "20218",
        "20025",
        "20580",
        "11067",
        "11334"
      ]
    },
    {
      "hadith_no": "2235",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن مسعر، عن الوليد بن أبي مالك، قال حدثنا أصحابنا، عن أبي عبيدة، قال الصيام جنة ما لم يخرقها ‏.‏",
      "text_en": " It was narrated that Al-Walid bin Abi Malik said:                     \"Our companions narrated to us that Abu 'Ubaidah said: 'Fasting is a shield, so long as you do not damage it.\"'",
      "chain": [
        "30514",
        "20218",
        "20025",
        "20359",
        "10"
      ]
    },
    {
      "hadith_no": "2275",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن حاتم، قال حدثنا حبان، قال أنبأنا عبد الله، عن ابن عيينة، عن أيوب، عن شيخ، من قشير عن عمه، حدثنا ثم، ألفيناه في إبل له فقال له أبو قلابة حدثه فقال الشيخ حدثني عمي أنه ذهب في إبل له فانتهى إلى النبي صلى الله عليه وسلم وهو يأكل أو قال يطعم فقال ‏\"‏ ادن فكل أو قال ‏\"‏ ادن فاطعم ‏\"‏ ‏.‏ فقلت إني صائم ‏.‏ فقال ‏\"‏ إن الله عز وجل وضع عن المسافر شطر الصلاة والصيام وعن الحامل والمرضع ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ayyub, from a Shailh of Qushair, from his paternal uncle;then we met him concerning some camels of his, and Bu Qilabah said to him:                      \"Tell it to us.\" The old man said: \"My paternal uncle told me that he went to the Prophet, concerning some camels of his, while he was eating. He said: 'Come and eat.' I said: 'I am fasting.' He said: 'Allah, the mighty and sublime, has waived half of the prayer and fasting for the traveler, the pregnant woman and the sick.\"'",
      "chain": [
        "30514",
        "20218",
        "20025",
        "20005",
        "11015"
      ]
    },
    {
      "hadith_no": "2338",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن سفيان بن عيينة، ومعمر، عن الزهري، عن حمزة بن عبد الله بن عمر، عن أبيه، عن حفصة، قالت لا صيام لمن لم يجمع الصيام قبل الفجر ‏.‏",
      "text_en": " It was narrated that Hafsah that:                     \"There is no fast for the one who does not intend to fast before dawn.\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "20005",
        "20115",
        "11013",
        "11818",
        "18",
        "54"
      ]
    },
    {
      "hadith_no": "2410",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن عاصم، عن أبي عثمان، عن رجل، قال أبو ذر سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من صام ثلاثة أيام من كل شهر فقد تم صوم الشهر أو فله صوم الشهر ‏\"‏ ‏.‏ شك عاصم ‏.‏",
      "text_en": " Abu 'Uthman reported from a man, that Abu Dharrr said:                     \"I heard the Messenger of Allah say: \"Whoever fasts three days of each month has fasted the month in full' or 'will have (the reward of) fasting the month.\"' 'Asim was in doubt.",
      "chain": [
        "30514",
        "20218",
        "20025",
        "11080",
        "11113",
        "23"
      ]
    },
    {
      "hadith_no": "2421",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا حبان، قال حدثنا أبو عوانة، عن عبد الملك بن عمير، عن موسى بن طلحة، عن أبي هريرة، قال جاء أعرابي إلى رسول الله صلى الله عليه وسلم بأرنب قد شواها فوضعها بين يديه فأمسك رسول الله صلى الله عليه وسلم فلم يأكل وأمر القوم أن يأكلوا وأمسك الأعرابي فقال له النبي صلى الله عليه وسلم ‏\"‏ ما يمنعك أن تأكل ‏\"‏ ‏.‏ قال إني أصوم ثلاثة أيام من الشهر ‏.‏ قال ‏\"‏ إن كنت صائما فصم الغر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"A Bedouin came to the Prophet with a rabbit that he had grilled it and placed it in front of him. The Messenger of Allah refrained from eating, but he told the people to eat. The Bedouin also refrained, and the Prophet said to him: 'What is keeping you from eating?' He said: 'I fast three days of the month.' He said: 'If you was to fast, fast the shining days.\"'",
      "chain": [
        "30172",
        "20218",
        "20469",
        "11368",
        "579",
        "13"
      ]
    },
    {
      "hadith_no": "2431",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن شعبة، عن أنس بن سيرين، قال سمعت عبد الملك بن أبي المنهال، يحدث عن أبيه، أن النبي صلى الله عليه وسلم أمرهم بصيام ثلاثة أيام البيض قال ‏\"‏ هي صوم الشهر ‏\"‏ ‏.‏",
      "text_en": " 'Abdul-Malik bin Abi Al-Minhai narrated from his father that:                     the Prophet  commanded them to fast the three days of Al-Bid. He said: \"That is (equivalent to) fasting for the whole month.\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "20020",
        "11038"
      ]
    },
    {
      "hadith_no": "2432",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا حبان، قال حدثنا همام، قال حدثنا أنس بن سيرين، قال حدثني عبد الملك بن قدامة بن ملحان، عن أبيه، قال كان رسول الله صلى الله عليه وسلم يأمرنا بصوم أيام الليالي الغر البيض ثلاث عشرة وأربع عشرة وخمس عشرة ‏.‏",
      "text_en": " 'Abdul-Malik bin Qudamah bin Milhan narrated that his father said:                     \"The Messenger of Allah used to command us to fast the three days with the shining bright nights (Al-Ayam Al-Bid), the thirteenth, fourteenth and fifteenth.\"",
      "chain": [
        "30172",
        "20218",
        "20297",
        "11038"
      ]
    },
    {
      "hadith_no": "2870",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا حبان، قال حدثنا وهيب، قال حدثنا أيوب، عن أبي العالية البراء، عن ابن عباس، قال قدم رسول الله صلى الله عليه وسلم وأصحابه لصبح رابعة وهم يلبون بالحج فأمرهم رسول الله صلى الله عليه وسلم أن يحلوا ‏.‏",
      "text_en": " It was narrated that Ibn Abbas said:                     \"The Messenger of Allah and his Companions came on the morning of the fourth day (of Dhul-Hijjah), reciting the Talbiyah for Hajj, and the Messenger of commanded them to exit Ihram\".",
      "chain": [
        "30172",
        "20218",
        "20299",
        "11015",
        "11618",
        "17"
      ]
    },
    {
      "hadith_no": "3017",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن حاتم، قال حدثنا حبان، قال أنبأنا عبد الله، عن عبد الملك بن أبي سليمان، عن عطاء، عن ابن عباس، عن الفضل بن عباس، قال أفاض رسول الله صلى الله عليه وسلم من عرفات وردفه أسامة بن زيد فجالت به الناقة وهو رافع يديه لا تجاوزان رأسه فما زال يسير على هينته حتى انتهى إلى جمع ‏.‏",
      "text_en": " It was narrated from Ibn Abbas that Al-Fadl bin Abbas said:                     \"The Messenger of Allah departed from Arafat and Usmah bin Zaid rode behind him. His camel bolted and he was raising his hands (to rein it in) but not above his head. He carried on like that until he reached Jam (Al-Muzdalifah).\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "10945",
        "11029",
        "17",
        "135"
      ]
    },
    {
      "hadith_no": "3031",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن إبراهيم بن عقبة، أن كريبا، قال سألت أسامة بن زيد - وكان ردف رسول الله صلى الله عليه وسلم عشية عرفة - فقلت كيف فعلتم قال أقبلنا نسير حتى بلغنا المزدلفة فأناخ فصلى المغرب ثم بعث إلى القوم فأناخوا في منازلهم فلم يحلوا حتى صلى رسول الله صلى الله عليه وسلم العشاء الآخرة ثم حل الناس فنزلوا فلما أصبحنا انطلقت على رجلي في سباق قريش وردفه الفضل ‏.‏",
      "text_en": " It was narrated from Ibrahim bin Uqbah that Kuraib said:                     \"I asked usamah bin Zaid, who rode behind the Messenger of Allah one the evening of Arafat. I said: \"What did you do?' He said: 'We started traveling until we reached Al-Muzadalifah, then he stopped and prayed Maghrib. Then he sent word to the people to stay in their camps, and they did not unload their camels until the Messenger of Allah had prayed the later Isah. Then the people unloaded their camels and made camp. When morning came I set out on foot amonth those of the Quraish who got there first, and Al-Fadl rode behind the Prophet.'\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "11125",
        "11211",
        "50"
      ]
    },
    {
      "hadith_no": "3361",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا حبان، قال حدثنا أبان، عن قتادة، عن خالد بن عرفطة، عن حبيب بن سالم، عن النعمان بن بشير، أن رجلا، يقال له عبد الرحمن بن حنين وينبز قرقورا أنه وقع بجارية امرأته فرفع إلى النعمان بن بشير فقال لأقضين فيها بقضية رسول الله صلى الله عليه وسلم إن كانت أحلتها لك جلدتك وإن لم تكن أحلتها لك رجمتك بالحجارة فكانت أحلتها له فجلد مائة ‏.‏ قال قتادة فكتبت إلى حبيب بن سالم فكتب إلى بهذا ‏.‏",
      "text_en": " It was narrated from An-Nu'man bin Bashir that a man called 'Abdur-Rahman bin Hunain or Yunbaz Qurqur had intercourse with his wife's slave woman, and it was brought to An-Nu'man bin Bashir. He said:                      \"I will pass the same judgment concerning her as the Messenger of Allah did. If she let you do that, I will flog you, but if she did not let you do that, I will stone you (to death).\" She had let him do that so he flogged him with one hundred stripes. (One of the narrators) Qatadah said: \"I wrote to Habib bin Salim and he wrote back to me with this information.\"",
      "chain": [
        "30172",
        "20218",
        "20577",
        "11019",
        "18242",
        "11837",
        "274"
      ]
    },
    {
      "hadith_no": "3526",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا حبان، قال حدثنا سليمان بن كثير، قال حدثنا الزهري، عن عروة، عن عائشة، أن النبي صلى الله عليه وسلم قال ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد فوق ثلاثة أيام إلا على زوج ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that the Prophet said:                      \"It is not permissible for a woman who believes in Allah and the Last Day to mourn for more than three days, except for her husband.\"",
      "chain": [
        "30172",
        "20218",
        "20235",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3617",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا محمد بن حاتم بن نعيم، قال حدثنا حبان، قال أنبأنا عبد الله، عن ابن عون، عن نافع، عن ابن عمر، قوله‏.‏",
      "text_en": " (The same) was narrated from Ibn 'Awn, from Nafi', from Ibn 'Umar.",
      "chain": [
        "30514",
        "20218",
        "20025",
        "11071",
        "11014"
      ]
    },
    {
      "hadith_no": "3678",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Presents - كتاب النحل",
      "chapter_no": "31",
      "text_ar": "أخبرنا محمد بن حاتم، قال حدثنا حبان، قال حدثنا عبد الله، عن هشام بن عروة، عن أبيه، أن بشيرا، أتى النبي صلى الله عليه وسلم فقال يا نبي الله نحلت النعمان نحلة ‏.‏ قال ‏\"‏ أعطيت لإخوته ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فاردده ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hisham bin 'Urwah, from his father, that Bashir came to the Prophet and said:                      \"O Prophet of Allah, I have given An-Nu'man a present.\" He said: \"Have you given something to his brothers?\" He said: \"No.\" He said: \"Then take it back.\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "3684",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Presents - كتاب النحل",
      "chapter_no": "31",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا أبو نعيم، قال حدثنا زكريا، عن عامر، قال حدثني عبد الله بن عتبة بن مسعود، ح وأنبأنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن زكريا، عن الشعبي، عن عبد الله بن عتبة بن مسعود، أن رجلا، جاء إلى النبي صلى الله عليه وسلم - وقال محمد أتى النبي صلى الله عليه وسلم - فقال إني تصدقت على ابني بصدقة فاشهد فقال ‏\"‏ هل لك ولد غيره ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ أعطيتهم كما أعطيته ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أأشهد على جور ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Utbah bin Mas'ud that a man came to the Prophet and said:                      \"I have given a gift to my son, so bear witness.\" He said: \"Do you have any other children?\" He said: \"Yes.\" He said: \"Have you given them something like that which you have given him?\" He said: \"No.\" He said: \"Shall I bear witness to unfairness?\"",
      "chain": [
        "38022",
        "20348",
        "11338",
        "11052",
        "4145",
        "30514",
        "20218",
        "18",
        "11338",
        "11052",
        "4145"
      ]
    },
    {
      "hadith_no": "3686",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Presents - كتاب النحل",
      "chapter_no": "31",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن فطر، عن مسلم بن صبيح، قال سمعت النعمان، يقول وهو يخطب انطلق بي أبي إلى رسول الله صلى الله عليه وسلم يشهده على عطية أعطانيها فقال ‏\"‏ هل لك بنون سواه ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ سو بينهم ‏\"‏ ‏.‏",
      "text_en": " An-Nu'man said, when he was delivering a Khutbah:                      \"My father took me to the Messenger of Allah to ask him to bear witness to a gift that he had given me. He said: 'Do you have any other children besides him?' He said: 'Yes.' He said: 'Treat them equally.'\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "11392",
        "274"
      ]
    },
    {
      "hadith_no": "3692",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Gifts - كتاب الهبة",
      "chapter_no": "32",
      "text_ar": "أخبرنا محمد بن حاتم، قال حدثنا حبان، قال أنبأنا عبد الله، عن إبراهيم بن نافع، عن الحسن بن مسلم، عن طاوس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يحل لأحد أن يهب هبة ثم يرجع فيها إلا من ولده ‏\"‏ ‏.‏ قال طاوس كنت أسمع وأنا صغير عائد في قيئه فلم ندر أنه ضرب له مثلا قال ‏\"‏ فمن فعل ذلك فمثله كمثل الكلب يأكل ثم يقيء ثم يعود في قيئه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Tawus said:                      \"The Messenger of Allah said: 'It is not permissible for anyone to give a gift then take it back, except from one's son.'\" Tawus said: \"When I was young I used to hear (the phrase), 'The one who goes back to his vomit,' but we did not realize that this was a similitude.\" He said: \"The likeness of the one who does that is that of a dog which eats then vomits, then goes back to its vomit.\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "20189",
        "11557",
        "11053"
      ]
    },
    {
      "hadith_no": "3700",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Gifts - كتاب الهبة",
      "chapter_no": "32",
      "text_ar": "أخبرنا محمد بن حاتم بن نعيم، قال حدثنا حبان، قال أنبأنا عبد الله، عن خالد، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس لنا مثل السوء الراجع في هبته كالكلب في قيئه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                      \"The Messenger of Allah said: 'It does not befit us to leave bad examples. The one who takes back his gift is like a dog with its vomit.'\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3705",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Gifts - كتاب الهبة",
      "chapter_no": "32",
      "text_ar": "أخبرنا محمد بن حاتم بن نعيم، قال حدثنا حبان، أنبأنا عبد الله، عن حنظلة، أنه سمع طاوسا، يقول أخبرنا بعض، من أدرك النبي صلى الله عليه وسلم أنه قال ‏\"‏ مثل الذي يهب فيرجع في هبته كمثل الكلب يأكل فيقيء ثم يأكل قيئه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hanzalah that he heard Tawus say:                      \"Some of those who met the Prophet told us that he said: 'The likeness of the one who gives (something), then takes back his gift, is that of a dog which eats, then vomits, then eats its vomit.'\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "11243",
        "11053"
      ]
    },
    {
      "hadith_no": "3714",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ar-Ruqba - كتاب الرقبى",
      "chapter_no": "33",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال حدثنا عبد الله، عن حنظلة، أنه سمع طاوسا، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تحل الرقبى فمن أرقب رقبى فهو سبيل الميراث ‏\"‏ ‏.‏",
      "text_en": " Hanzalah narrated that he heard Tawus say:                      \"The Messenger of Allah said: 'Ruqba is not permissible. Whoever is given something on the basis of Ruqba, it is part of his estate.'\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "11243",
        "11053"
      ]
    },
    {
      "hadith_no": "3719",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ar-Ruqba - كتاب الرقبى",
      "chapter_no": "33",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن معمر، قال سمعت عمرو بن دينار، يحدث عن طاوس، عن حجر المدري، عن زيد بن ثابت، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ العمرى للوارث ‏\"‏ ‏.‏ والله أعلم ‏.‏",
      "text_en": " (A different chain) from Ma'mar who said:                      \"I heard 'Amr bin Dinar, narrating from Tawus, from Hujr Al-Madari, from Zaid bin Thabit, that the Messenger of Allah said: \"'Umra (a gift given for life) belongs to the heir.\" And Allah knows best.\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "20115",
        "11081",
        "11053",
        "49"
      ]
    },
    {
      "hadith_no": "3726",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of 'Umra - كتاب العمرى",
      "chapter_no": "34",
      "text_ar": "أخبرنا محمد بن حاتم، قال حدثنا حبان، قال أنبأنا عبد الله، عن محمد بن إسحاق، قال حدثنا مكحول، عن طاوس، بتل رسول الله صلى الله عليه وسلم العمرى والرقبى ‏.‏",
      "text_en": " It was narrated from Tawus that the Messenger of Allah made 'Umra and Ruqba binding.",
      "chain": [
        "30514",
        "20218",
        "20025",
        "11107",
        "11066"
      ]
    },
    {
      "hadith_no": "3730",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of 'Umra - كتاب العمرى",
      "chapter_no": "34",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن عبد الملك بن أبي سليمان، عن عطاء، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أعطي شيئا حياته فهو له حياته وموته ‏\"‏ ‏.‏",
      "text_en": " 'Abdul-Malik bin Abi Sulaiman narrated from 'Ata' who said:                      \"The Messenger of Allah said: 'Whoever is given something for the rest of his life, it belongs to him for as long as he lives and after he dies.'\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "10945",
        "11029"
      ]
    },
    {
      "hadith_no": "3756",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of 'Umra - كتاب العمرى",
      "chapter_no": "34",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا حبان، قال حدثنا حماد بن سلمة، ح وأخبرني إبراهيم بن يونس بن محمد، قال حدثنا أبي قال، حدثنا حماد بن سلمة، عن داود، - وهو ابن أبي هند - وحبيب المعلم عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يجوز لامرأة هبة في مالها إذا ملك زوجها عصمتها ‏\"‏ ‏.‏ اللفظ لمحمد ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that the Messenger of Allah said:                      \"It is not permissible for a woman to give a gift from her wealth, once her husband has marital authority over her.\" This is the wording of (one of the narrators) Muhammad.",
      "chain": [
        "30172",
        "20218",
        "20021",
        "20021",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3793",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرني أحمد بن سعيد، قال حدثنا حبان، قال حدثنا عبد الوارث، قال حدثنا أيوب، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ من حلف فاستثنى فإن شاء مضى وإن شاء ترك غير حنث ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Prophet said:                      \"Whoever swears an oath and says: 'If Allah wills', then if he wishes he may go ahead, and if he wishes he may not, without having broken his oath.\"",
      "chain": [
        "30296",
        "20218",
        "20258",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3857",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن شعبة، عن حماد، عن إبراهيم، عن أبي سعيد، قال إذا استأجرت أجيرا فأعلمه أجره‏.‏‏",
      "text_en": " It was narrated that Abu Sa'eed said:                      \"When you hire a worker, tell him what his wages will be.\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "20020",
        "20022",
        "11051",
        "38"
      ]
    },
    {
      "hadith_no": "3858",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد، قال أنبأنا حبان، قال أنبأنا عبد الله، عن حماد بن سلمة، عن يونس، عن الحسن، أنه كره أن يستأجر الرجل، حتى يعلمه أجره‏.‏‏",
      "text_en": " It was narrated from Al-Hasan that he disliked to hire a man without telling him what his wages would be.",
      "chain": [
        "30213",
        "20218",
        "20025",
        "20021",
        "20475",
        "11016"
      ]
    },
    {
      "hadith_no": "3859",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن جرير بن حازم، عن حماد، - هو ابن أبي سليمان - أنه سئل عن رجل، استأجر أجيرا على طعامه قال لا حتى تعلمه‏.‏‏",
      "text_en": " It was narrated from Hammad -Ibn Abi Sulaiman- that he was asked about a man who hired a worker in return for food and he said:                      \"No, not until he tells him (what his wages will be).\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "11272",
        "10756"
      ]
    },
    {
      "hadith_no": "3860",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد، قال حدثنا حبان، قال أنبأنا عبد الله، عن معمر، عن حماد، وقتادة، في رجل قال لرجل أستكري منك إلى مكة بكذا وكذا فإن سرت شهرا أو كذا وكذا شيئا سماه فلك زيادة كذا وكذا فلم يريا به بأسا وكرها أن يقول أستكري منك بكذا وكذا فإن سرت أكثر من شهر نقصت من كرائك كذا وكذا‏.‏‏",
      "text_en": " It was narrated from Hammad and Qatadah, concerning a man who said to another man:                      \"I will lease (something) from you until I reach Makkah for such and such a payment, and if I travel for a month or such and such -something that he named- I will give you such and such in addition.\" They did not see anything wrong with that, but they did not like it if he said: \"If I travel for more than a month I will deduct such and such from your lease.\"",
      "chain": [
        "30213",
        "20218",
        "20025",
        "20115",
        "20022"
      ]
    },
    {
      "hadith_no": "3861",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن ابن جريج، قراءة قال قلت لعطاء عبد أؤاجره سنة بطعامه وسنة أخرى بكذا وكذا‏.‏‏ قال لا بأس به ويجزئه اشتراطك حين تؤاجره أياما أو آجرته وقد مضى بعض السنة قال إنك لا تحاسبني لما مضى‏.‏‏",
      "text_en": " It was narrated that Ibn Juraij said:                      \"I said to 'Ata': 'What if I hire a slave for a year in return for his food, and for another year, in return for such and such?' He said: 'There is nothing wrong with that, and you may stipulate your conditions of hiring even for a few days.' 'How about if I make a deal to hire him when part of the year has passed?' He said: 'Do not hold me to account for what has passed.'\"",
      "chain": [
        "30514",
        "20218",
        "20025"
      ]
    },
    {
      "hadith_no": "3924",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن حاتم، قال حدثنا حبان، قال حدثنا عبد الله بن المبارك، عن ليث، قال حدثني بكير بن عبد الله بن الأشج، عن أسيد بن رافع بن خديج، أن أخا، رافع قال لقومه قد نهى رسول الله صلى الله عليه وسلم اليوم عن شىء كان لكم رافقا وأمره طاعة وخير نهى عن الحقل‏.‏‏",
      "text_en": " It was narrated from Usaid bin Rafi' bin Khadij that the brother of Rafi' said to his people:                      \"Today the Messenger of Allah has forbidden something which was convenient for you, but following his command is an act of obedience (to Allah) and is good. He forbade Al-Haql.\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "20023",
        "11154",
        "1988"
      ]
    },
    {
      "hadith_no": "3926",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن حاتم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن سعيد بن يزيد أبي شجاع، قال حدثني عيسى بن سهل بن رافع بن خديج، قال إني ليتيم في حجر جدي رافع بن خديج وبلغت رجلا وحججت معه فجاء أخي عمران بن سهل بن رافع بن خديج فقال يا أبتاه إنه قد أكرينا أرضنا فلانة بمائتى درهم‏.‏‏ فقال يا بنى دع ذاك فإن الله عز وجل سيجعل لكم رزقا غيره إن رسول الله صلى الله عليه وسلم قد نهى عن كراء الأرض‏.‏‏",
      "text_en": " 'Eisa bin Sahl bin Rafi' bin Khadij narrated:                      \"I was an orphan in the care of my grandfather Rafi' bin Khadij. I reached puberty and became a man, and I performed Hajj with him. My brother 'Imran bin Sahl bin Rafi' bin Khadij came and said: 'O my father, we have leased our land to so and so (a woman) for two hundred Dirhams.' He said: 'O my son, leave that (do not do it), for Allah will give you other provision. The Messenger of Allah forbade leasing land.'\"",
      "chain": [
        "30514",
        "20218",
        "20025"
      ]
    },
    {
      "hadith_no": "3967",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن حاتم بن نعيم، قال أنبأنا حبان، قال حدثنا عبد الله، عن حميد الطويل، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأن محمدا رسول الله فإذا شهدوا أن لا إله إلا الله وأن محمدا رسول الله واستقبلوا قبلتنا وأكلوا ذبيحتنا وصلوا صلاتنا فقد حرمت علينا دماؤهم وأموالهم إلا بحقها لهم ما للمسلمين وعليهم ما عليهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that :                     The Messenger of Allah [SAW] said: \"I have been commanded to fight the idolators until they bear witness to La ilaha illallah (there is none worthy of worship except Allah) and that Muhammad is the Messenger of Allah [SAW]. If they bear witness to La ilaha illallah and that Muhammad is the Messenger of Allah [SAW], and they face our Qiblah, eat our slaughtered animals, and pray as we do, then their blood and wealth become forbidden except for a right that is due, and they will have the same rights and obligations as the Muslims.\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "4310",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا محمد بن معمر البحراني، قال حدثنا حبان، - وهو ابن هلال قال حدثنا أبو عوانة، عن عبد الملك بن عمير، عن موسى بن طلحة، عن أبي هريرة، قال جاء أعرابي إلى النبي صلى الله عليه وسلم بأرنب قد شواها فوضعها بين يديه فأمسك رسول الله صلى الله عليه وسلم فلم يأكل وأمر القوم أن يأكلوا وأمسك الأعرابي فقال له رسول الله صلى الله عليه وسلم ‏\"‏ ما يمنعك أن تأكل ‏\"‏ ‏.‏ قال إني أصوم ثلاثة أيام من كل شهر ‏.‏ قال ‏\"‏ إن كنت صائما فصم الغر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"A Bedouin brought a rabbit to the Messenger of Allah that he had grilled and placed it before him. The me4ssenger of Allah refrained form eating but he told the people to eat. The Bedouin also refrained from eating, and the Mesenger of Allah said to him: 'What is keeping you from eating?\" He said: 'I fast three days of e4ach month.\" He Said: 'If you are going to fast, then fast the bright days (Al-Ghurr).\"",
      "chain": [
        "30172",
        "20218",
        "20469",
        "11368",
        "579",
        "13"
      ]
    },
    {
      "hadith_no": "4402",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرني محمد بن معمر، قال حدثنا حبان بن هلال، قال حدثنا جرير بن حازم، قال حدثنا أيوب، عن زيد بن أسلم، فلقيت زيد بن أسلم فحدثني عن عطاء بن يسار، عن أبي سعيد الخدري، قال كانت لرجل من الأنصار ناقة ترعى في قبل أحد فعرض لها فنحرها بوتد ‏.‏ فقلت لزيد وتد من خشب أو حديد قال لا بل خشب فأتى النبي صلى الله عليه وسلم فسأله فأمره بأكلها ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"A man form among the Ansar had a she-camel which used to graze in front of Uhud. Something happened to it, and he slaughtered it with a stake,\"- (Ayyub, one of the narrators, said) I said to Zaid:' A stake of wood or of iron?\" He said \"No of wood.\"- \"Then he went to the Prophet and asked him, and he told him to eat it.\" (Sahih )",
      "chain": [
        "30172",
        "20218",
        "11272",
        "11015",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "4880",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا محمد بن حاتم بن نعيم، قال أنبأنا حبان، قال حدثنا عبد الله، عن الأوزاعي، قال حدثني عطاء بن أبي رباح، أن رجلا، سرق ثوبا فأتي به رسول الله صلى الله عليه وسلم فأمر بقطعه فقال الرجل يا رسول الله هو له ‏.‏ قال ‏\"‏ فهلا قبل الآن ‏\"‏ ‏.‏",
      "text_en": " 'Ata' bin Abi Rabah narrated that:                     a man stole a garment, and was brought before the Messenger of Allah, who order that his hand be cut off. The man said: \"O Messenger of Allah, he can keep it.\" He said: \"Why (did you not say that) before now?\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "20024",
        "11029"
      ]
    },
    {
      "hadith_no": "5003",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا محمد بن حاتم بن نعيم، قال أنبأنا حبان، قال أنبأنا عبد الله، عن حميد الطويل، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأن محمدا رسول الله فإذا شهدوا أن لا إله إلا الله وأن محمدا رسول الله واستقبلوا قبلتنا وأكلوا ذبيحتنا وصلوا صلاتنا فقد حرمت علينا دماؤهم وأموالهم إلا بحقها لهم ما للمسلمين وعليهم ما عليهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that:                     The Messenger of Allah [SAW] said: \"I have been commanded to fight the people until they bear witness that there is none worthy of worship except Allah and that Muhammad is the Messenger of Allah. If they bear witness that there is none worthy of worship except Allah and that Muhammad is the Messenger of Allah, they turn to face the same Qiblah as us, they eat our slaughtered animals, and they pray as we pray; then their blood and their wealth are forbidden to us, except for a right that is due, and they have the same rights and duties as the Muslims.\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "5110",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن حاتم، قال حدثنا حبان، قال حدثنا عبد الله، عن حيوة بن شريح، قال حدثني عياش بن عباس القتباني، عن أبي الحصين الحميري، أنه كان هو وصاحب له يلزمان أبا ريحانة يتعلمان منه خيرا قال فحضر صاحبي يوما فأخبرني صاحبي أنه سمع أبا ريحانة يقول إن رسول الله صلى الله عليه وسلم حرم الوشر والوشم والنتف ‏.‏",
      "text_en": " It was narrated from Abu Al-Husain Al-Himyari that :                     He and a companion of his used to stay with Abu Raihanah to learn good things from him. He said: \"One day my companion came and told me that he heard Abu Raihanah say: 'The Messenger of Allah [SAW] forbade filing (the teeth), tattoos, and plucking hairs.'\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "26010",
        "10871",
        "16107",
        "10696"
      ]
    },
    {
      "hadith_no": "5146",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن حاتم، قال حدثنا حبان، قال أنبأنا عبد الله، عن ليث بن سعد، قال حدثني يزيد بن أبي حبيب، عن ابن أبي الصعبة، عن رجل، من همدان يقال له أفلح عن ابن زرير، أنه سمع عليا، يقول إن نبي الله صلى الله عليه وسلم أخذ حريرا فجعله في يمينه وأخذ ذهبا فجعله في شماله ثم قال ‏\"‏ إن هذين حرام على ذكور أمتي ‏\"‏ ‏.‏ قال أبو عبد الرحمن وحديث ابن المبارك أولى بالصواب إلا قوله أفلح فإن أبا أفلح أشبه والله تعالى أعلم ‏.‏",
      "text_en": " 'Ali said:                     \"The Prophet of Allah [SAW] took hold of some silk in his right hand, and some gold in his left, then he said: 'These two are forbidden for the males of my Ummah.'\"",
      "chain": [
        "30514",
        "20218",
        "20025",
        "20023",
        "11411",
        "16056",
        "5"
      ]
    },
    {
      "hadith_no": "5161",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا حبان، قال حدثنا سلم بن زرير، قال حدثنا عبد الرحمن بن طرفة، عن جده، عرفجة بن أسعد أنه أصيب أنفه يوم الكلاب في الجاهلية فاتخذ أنفا من ورق فأنتن عليه فأمره النبي صلى الله عليه وسلم أن يتخذ أنفا من ذهب ‏.‏",
      "text_en": " It was narrated from 'Arafah bin As'ad that:                     His nose was cut off at the battle of Al-Kulab during the Jahiliyyah, so he wore a nose made of silver, but it began to rot, so the Prophet [SAW] told him to wear a nose made of gold.",
      "chain": [
        "30172",
        "20218",
        "11591",
        "18630"
      ]
    },
    {
      "hadith_no": "5204",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن معمر البحراني، قال حدثنا حبان بن هلال، قال حدثنا حماد بن سلمة، عن ابن أبي رافع، عن عبد الله بن جعفر، أن النبي صلى الله عليه وسلم كان يتختم بيمينه ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Ja'far that:                     The Prophet [SAW] used to wear his ring on his right hand.",
      "chain": [
        "30172",
        "20218",
        "20021",
        "108"
      ]
    },
    {
      "hadith_no": "5235",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا حبان، قال حدثنا همام، عن قتادة، عن أنس، أن النبي صلى الله عليه وسلم كان يضرب شعره إلى منكبيه ‏.‏",
      "text_en": " It was narrated from Anas that:                     The hair of the Prophet [SAW] came down to his shoulders.",
      "chain": [
        "30172",
        "20218",
        "20297",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "5367",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا حبان، قال حدثنا همام، قال حدثنا قتادة، قال حدثنا أنس، أن نعل، رسول الله صلى الله عليه وسلم كان لها قبالان ‏.‏",
      "text_en": " Anas narrated that :                     The sandals of the Messenger of Allah [SAW] had two straps.",
      "chain": [
        "30172",
        "20218",
        "20297",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "5447",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا يحيى بن محمد، قال حدثنا حبان بن هلال، قال حدثنا أبو عوانة، عن عبد الملك بن عمير، عن عمرو بن ميمون الأودي، قال كان سعد يعلم بنيه هؤلاء الكلمات كما يعلم المعلم الغلمان ويقول إن رسول الله صلى الله عليه وسلم كان يتعوذ بهن دبر الصلاة ‏\"‏ اللهم إني أعوذ بك من البخل وأعوذ بك من الجبن وأعوذ بك أن أرد إلى أرذل العمر وأعوذ بك من فتنة الدنيا وأعوذ بك من عذاب القبر ‏\"‏ ‏.‏ فحدثت بها مصعبا فصدقه ‏.‏",
      "text_en": " It was narrated that 'Amr bin Maimun Al-Awdi said:                     \"Sa'd used to teach his children these words as a teacher teaches his students, and he said that the Messenger of Allah [SAW] used to seek refuge by means of them at the end of every prayer: 'Allahumma inni a'udhu bika minal-bukhli, wa a'udhu bika minal-jubni, wa a'udhu bika an uradda ila ardhalil-'umuri, wa a'udhu bika min fitnatid-dunya, wa a'udhu bika min 'adhabil-qabr (O Allah, I seek refuge with You from miserliness, and I seek refuge in You from cowardice, and I seek refuge in You from reaching the age of senility, and I seek refuge in You from the trials of this world, and I seek refuge in You from the torment of the grave.) So I narrated that to Mus'ab and he said that he told the truth.\"",
      "chain": [
        "20218",
        "20469",
        "11368",
        "11382"
      ]
    },
    {
      "hadith_no": "5460",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا أبو عاصم، خشيش بن أصرم قال حدثنا حبان، قال حدثنا حماد بن سلمة، عن إسحاق بن عبد الله بن أبي طلحة، عن سعيد بن يسار، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم كان يقول ‏\"‏ اللهم إني أعوذ بك من الفقر وأعوذ بك من القلة والذلة وأعوذ بك أن أظلم أو أظلم ‏\"‏ ‏.‏ خالفه الأوزاعي ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah [SAW] used to say: \"Allahumma, inni a'udhu bika minal-faqri wa a'udhu bika min al-qillati wadh-dhillati, wa a'udhu bika an azlima aw uzlam (O Allah, I seek refuge with you from poverty, I seek refuge with You from want and humiliation, and I seek refuge with You from wronging others or being wronged.)\" Al-Awza'I contradicted him.",
      "chain": [
        "38204",
        "20218",
        "20021",
        "11151",
        "11170",
        "13"
      ]
    },
    {
      "hadith_no": "2056",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بدر، عباد بن الوليد حدثنا حبان بن هلال، حدثنا مبارك بن فضالة، عن علي بن زيد، عن أم محمد، عن عائشة، قالت لما قدم رسول الله  صلى الله عليه وسلم  المدينة وهو عروس بصفية بنت حيى جئن نساء الأنصار فأخبرن عنها ‏.‏ قالت فتنكرت وتنقبت فذهبت فنظر رسول الله  صلى الله عليه وسلم  إلى عيني فعرفني ‏.‏ قالت فالتفت فأسرعت المشى فأدركني فاحتضنني فقال ‏\"‏ كيف رأيت ‏\"‏ ‏.‏ قالت قلت أرسل يهودية وسط يهوديات ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     When the Messenger of Allah came to Al-Madinah, he had just married Safiyyah bint Huyai, and the women of the Ansar came and told us about that. My expression changed and I covered my face and went away. The Messenger of Allah looked at my eyes and recognized me. I turned away and walked quickly, but he caught up with me and put his arm around me and said: 'What did you see?' I said: 'Let me go, (I saw) a Jewish woman among other Jewish women.' \"",
      "chain": [
        "36577",
        "20218",
        "14352",
        "10664",
        "53"
      ]
    },
    {
      "hadith_no": "2494",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن سعيد الدارمي، حدثنا حبان بن هلال، حدثنا سعيد بن زيد، عن الزبير بن الخريت، عن أبي لبيد، لمازة بن زبار عن عروة بن أبي الجعد البارقي، قال قدم جلب فأعطاني النبي صلى الله عليه وسلم دينارا فذكر نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "30296",
        "20218",
        "11",
        "11587",
        "14339"
      ]
    },
    {
      "hadith_no": "2795",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا إسحاق بن منصور، أنبأنا حبان بن هلال، حدثنا عبد الله بن بكر المزني، عن عطاء بن أبي ميمونة، قال لا أعلمه إلا عن أنس بن مالك، قال ما رفع إلى رسول الله صلى الله عليه وسلم شىء فيه القصاص إلا أمر فيه بالعفو ‏.‏",
      "text_en": " It was narrated that 'Ata bin Abu Maimunah said:                     “I only know it from Anas bin Malik who said: 'No case involving retaliation was referred to the Messenger of Allah (ﷺ) but he enjoined forgiveness.”",
      "chain": [
        "30313",
        "20218",
        "24229",
        "11601",
        "19"
      ]
    },
    {
      "hadith_no": "2933",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا عباد بن الوليد، حدثنا حبان بن هلال، حدثنا أبو محصن، عن ابن أبي ليلى، عن نافع، عن ابن عمر، قال كان رسول الله صلى الله عليه وسلم إذا أشخص السرايا يقول للشاخص ‏\"‏ أستودع الله دينك وأمانتك وخواتيم عملك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “When the Messenger of Allah(ﷺ)would dispatch troops, he would say to the leader: ‘I commend toAllah’s keeping your religious commitment, your dignity and the endofyour deeds.’”",
      "chain": [
        "36577",
        "20218",
        "11196",
        "11014",
        "18"
      ]
    }
  ],
  "total_hadiths": 115
}