{
  "id": "20212",
  "name": "Bashr bin Muhammad al-Sakhtiyani بشر بن محمد السختياني",
  "full_name": "Bashr bin Muhammad al-Sakhtiyani بشر بن محمد السختياني",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "224",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Merv"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  -  صدوق ]"
    ],
    "tags": [
      "al-Mervazi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20452",
      "name": "al-Fadl bin Musa al-Synany الفضل بن موسى السيناني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20183",
      "name": "Yahya bin Wadh يحيى بن واضح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "38024",
      "name": "Ahmed bin Syar bin Ayoub أحمد بن سيار بن أيوب",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "32",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا شعبة، ح‏.‏ قال وحدثني بشر، قال حدثنا محمد، عن شعبة، عن سليمان، عن إبراهيم، عن علقمة، عن عبد الله، قال لما نزلت ‏{‏الذين آمنوا ولم يلبسوا إيمانهم بظلم‏}‏ قال أصحاب رسول الله صلى الله عليه وسلم أينا لم يظلم فأنزل الله ‏{‏إن الشرك لظلم عظيم‏}‏‏.‏",
      "text_en": "      Narrated 'Abdullah:                          When the following Verse was revealed: \"It is those who believe and      confuse not their belief with wrong (worshipping others besides      Allah.)\" (6:83), the companions of Allah's Apostle asked, \"Who is      amongst us who had not done injustice (wrong)?\" Allah revealed: \"No      doubt, joining others in worship with Allah is a great injustice      (wrong) indeed.\" (31.13)",
      "chain": [
        "20296",
        "20020",
        "20212",
        "20278",
        "20020",
        "11005",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "67",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا مسدد، قال حدثنا بشر، قال حدثنا ابن عون، عن ابن سيرين، عن عبد الرحمن بن أبي بكرة، عن أبيه، ذكر النبي صلى الله عليه وسلم قعد على بعيره، وأمسك إنسان بخطامه  أو بزمامه  قال ‏\"‏ أى يوم هذا ‏\"‏‏.‏ فسكتنا حتى ظننا أنه سيسميه سوى اسمه‏.‏ قال ‏\"‏ أليس يوم النحر ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ فأى شهر هذا ‏\"‏‏.‏ فسكتنا حتى ظننا أنه سيسميه بغير اسمه‏.‏ فقال ‏\"‏ أليس بذي الحجة ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ فإن دماءكم وأموالكم وأعراضكم بينكم حرام كحرمة يومكم هذا، في شهركم هذا، في بلدكم هذا‏.‏ ليبلغ الشاهد الغائب، فإن الشاهد عسى أن يبلغ من هو أوعى له منه ‏\"‏‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abi Bakra's father:                     Once the Prophet was riding his camel and a man was holding its rein. The Prophet asked, \"What is the day today?\" We kept quiet, thinking that he might give that day another name. He said, \"Isn't it the day of Nahr (slaughtering of the animals of sacrifice)\" We replied, \"Yes.\" He further asked, \"Which month is this?\" We again kept quiet, thinking that he might give it another name. Then he said, \"Isn't it the month of Dhul-Hijja?\" We replied, \"Yes.\" He said, \"Verily! Your blood, property and honor are sacred to one another (i.e. Muslims) like the sanctity of this day of yours, in this month of yours and in this city of yours. It is incumbent upon those who are present to inform those who are absent because those who are absent might comprehend (what I have said) better than the present audience.\"",
      "chain": [
        "30175",
        "20212",
        "11071",
        "11035",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "385",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو الوليد، هشام بن عبد الملك قال حدثنا بشر بن المفضل، قال حدثني غالب القطان، عن بكر بن عبد الله، عن أنس بن مالك، قال كنا نصلي مع النبي صلى الله عليه وسلم فيضع أحدنا طرف الثوب من شدة الحر في مكان السجود‏.‏",
      "text_en": " Narrated Anas bin Malik:                     We used to pray with the Prophet and some of us used to place the ends of their clothes at the place of prostration because of scorching heat.",
      "chain": [
        "20296",
        "20212",
        "11299",
        "11267",
        "19"
      ]
    },
    {
      "hadith_no": "472",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا مسدد، قال حدثنا بشر بن المفضل، عن عبيد الله، عن نافع، عن ابن عمر، قال سأل رجل النبي صلى الله عليه وسلم وهو على المنبر ما ترى في صلاة الليل قال ‏\"‏ مثنى مثنى، فإذا خشي الصبح صلى واحدة، فأوترت له ما صلى ‏\"‏‏.‏ وإنه كان يقول اجعلوا آخر صلاتكم وترا، فإن النبي صلى الله عليه وسلم أمر به‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar said, \"While the Prophet was on the pulpit, a man asked him how to offer the night prayers. He replied, 'Pray two rak`at at a time and then two and then two and so on, and if you are afraid of the dawn (the approach of the time of the Fajr prayer) pray one rak`a and that will be the witr for all the rak`at which you have offered.\" Ibn `Umar said, \"The last rak`at of the night prayer should be odd, for the Prophet ordered it to be so.",
      "chain": [
        "30175",
        "20212",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "479",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا حامد بن عمر، عن بشر، حدثنا عاصم، حدثنا واقد، عن أبيه، عن ابن عمر، أو ابن عمرو شبك النبي صلى الله عليه وسلم أصابعه‏.‏",
      "text_en": " Narrated Ibn `Umar or Ibn `Amr:                     The Prophet clasped his hands, by interlacing his fingers.",
      "chain": [
        "30128",
        "20212",
        "11080",
        "19124"
      ]
    },
    {
      "hadith_no": "928",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا مسدد، قال حدثنا بشر بن المفضل، قال حدثنا عبيد الله، عن نافع، عن عبد الله، قال كان النبي صلى الله عليه وسلم يخطب خطبتين يقعد بينهما‏.‏",
      "text_en": " Narrated `Abdullah Ibn `Umar:                     The Prophet used to deliver two Khutbas and sit in between them.",
      "chain": [
        "30175",
        "20212",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1208",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا مسدد، حدثنا بشر، حدثنا غالب، عن بكر بن عبد الله، عن أنس بن مالك  رضى الله عنه  قال كنا نصلي مع النبي صلى الله عليه وسلم في شدة الحر، فإذا لم يستطع أحدنا أن يمكن وجهه من الأرض بسط ثوبه فسجد عليه‏.‏",
      "text_en": " Narrated Anas bin Malik:                     We used to pray with the Prophet in scorching heat, and if someone of us could not put his face on the earth (because of the heat) then he would spread his clothes and prostrate over them.",
      "chain": [
        "30175",
        "20212",
        "11299",
        "11267",
        "19"
      ]
    },
    {
      "hadith_no": "1279",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، حدثنا سلمة بن علقمة، عن محمد بن سيرين، قال توفي ابن لأم عطية  رضى الله عنها  فلما كان اليوم الثالث دعت بصفرة، فتمسحت به وقالت نهينا أن نحد أكثر من ثلاث إلا بزوج‏.‏",
      "text_en": " Narrated Muhammad bin Seereen:                     One of the sons of Um 'Atiyya died, and when it was the third day she asked for a yellow perfume and put it over her body, and said, \"We were forbidden to mourn for more than three days except for our husbands.\"",
      "chain": [
        "30175",
        "20212",
        "11593",
        "11035"
      ]
    },
    {
      "hadith_no": "1351",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا مسدد، أخبرنا بشر بن المفضل، حدثنا حسين المعلم، عن عطاء، عن جابر  رضى الله عنه  قال لما حضر أحد دعاني أبي من الليل فقال ما أراني إلا مقتولا في أول من يقتل من أصحاب النبي صلى الله عليه وسلم، وإني لا أترك بعدي أعز على منك، غير نفس رسول الله صلى الله عليه وسلم، فإن على دينا فاقض، واستوص بأخواتك خيرا‏.‏ فأصبحنا فكان أول قتيل، ودفن معه آخر في قبر، ثم لم تطب نفسي أن أتركه مع الآخر فاستخرجته بعد ستة أشهر، فإذا هو كيوم وضعته هنية غير أذنه‏.‏",
      "text_en": " Narrated Jabir:                     When the time of the Battle of Uhud approached, my father called me at night and said, \"I think that I will be the first amongst the companions of the Prophet to be martyred. I do not leave anyone after me dearer to me than you, except Allah's Apostle's soul and I owe some debt and you should repay it and treat your sisters favorably (nicely and politely).\" So in the morning he was the first to be martyred and was buried along with another (martyr). I did not like to leave him with the other (martyr) so I took him out of the grave after six months of his burial and he was in the same condition as he was on the day of burial, except a slight change near his ear.",
      "chain": [
        "30175",
        "20212",
        "11278",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "1960",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، حدثنا خالد بن ذكوان، عن الربيع بنت معوذ، قالت أرسل النبي صلى الله عليه وسلم غداة عاشوراء إلى قرى الأنصار ‏\"‏ من أصبح مفطرا فليتم بقية يومه، ومن أصبح صائما فليصم ‏\"‏‏.‏ قالت فكنا نصومه بعد، ونصوم صبياننا، ونجعل لهم اللعبة من العهن، فإذا بكى أحدهم على الطعام أعطيناه ذاك، حتى يكون عند الإفطار‏.‏",
      "text_en": " Narrated Ar-Rubi' bint Mu'awadh:                     \"The Prophet sent a messenger to the village of the Ansar in the morning of the day of 'Ashura' (10th of Muharram) to announce: 'Whoever has eaten something should not eat but complete the fast, and whoever is observing the fast should complete it.' \"She further said, \"Since then we used to fast on that day regularly and also make our boys fast. We used to make toys of wool for the boys and if anyone of them cried for, he was given those toys till it was the time of the breaking of the fast.\"",
      "chain": [
        "30175",
        "20212",
        "11158",
        "617"
      ]
    },
    {
      "hadith_no": "2523",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا مسدد، حدثنا بشر، عن عبيد الله، اختصره‏.‏",
      "text_en": " Narrated 'Ubaidullah:                     as above BRIEFLY.",
      "chain": [
        "30175",
        "20212"
      ]
    },
    {
      "hadith_no": "2654",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، حدثنا الجريري، عن عبد الرحمن بن أبي بكرة، عن أبيه  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ ألا أنبئكم بأكبر الكبائر ‏\"‏‏.‏ ثلاثا‏.‏ قالوا بلى يا رسول الله‏.‏ قال ‏\"‏ الإشراك بالله، وعقوق الوالدين ‏\"‏‏.‏ وجلس وكان متكئا فقال ‏\"‏ ألا وقول الزور ‏\"‏‏.‏ قال فما زال يكررها حتى قلنا ليته سكت‏.‏ وقال إسماعيل بن إبراهيم حدثنا الجريري حدثنا عبد الرحمن‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet said thrice, \"Should I inform you out the greatest of the great sins?\" They said, \"Yes, O Allah's Apostle!\" He said, \"To join others in worship with Allah and to be undutiful to one's parents.\" The Prophet then sat up after he had been reclining (on a pillow) and said, \"And I warn you against giving a false witness, and he kept on saying that warning till we thought he would not stop. (See Hadith No. 7, Vol. 8)",
      "chain": [
        "30175",
        "20212",
        "11286",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "2702",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا مسدد، حدثنا بشر، حدثنا يحيى، عن بشير بن يسار، عن سهل بن أبي حثمة، قال انطلق عبد الله بن سهل ومحيصة بن مسعود بن زيد إلى خيبر، وهى يومئذ صلح‏.‏",
      "text_en": " Narrated Sahl bin Abu Hathma:                     `Abdullah bin Sahl and Muhaiyisa bin Mas`ud bin Zaid went to Khaibar when it had a peace treaty (with the Muslims).",
      "chain": [
        "30175",
        "20212",
        "20031",
        "11810",
        "1822"
      ]
    },
    {
      "hadith_no": "2882",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا بشر بن المفضل، حدثنا خالد بن ذكوان، عن الربيع بنت معوذ، قالت كنا مع النبي صلى الله عليه وسلم نسقي، ونداوي الجرحى، ونرد القتلى إلى المدينة‏.‏",
      "text_en": " Narrated Ar-Rubayyi 'bint Mu'auwidh:                     We were in the company of the Prophet providing the wounded with water and treating them and bringing the killed to Medina (from the battle field) .",
      "chain": [
        "30026",
        "20212",
        "11158",
        "617"
      ]
    },
    {
      "hadith_no": "2883",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، عن خالد بن ذكوان، عن الربيع بنت معوذ، قالت كنا نغزو مع النبي صلى الله عليه وسلم فنسقي القوم ونخدمهم، ونرد الجرحى والقتلى إلى المدينة‏.‏",
      "text_en": " Narrated Ar-Rabi'bint Mu'auwidh:                     We used to take part in holy battles with the Prophet by providing the people with water and serving them and bringing the killed and the wounded back to Medina.",
      "chain": [
        "30175",
        "20212",
        "11158",
        "617"
      ]
    },
    {
      "hadith_no": "3086",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا علي، حدثنا بشر بن المفضل، حدثنا يحيى بن أبي إسحاق، عن أنس بن مالك  رضى الله عنه أنه أقبل هو وأبو طلحة مع النبي صلى الله عليه وسلم ومع النبي صلى الله عليه وسلم صفية مردفها على راحلته، فلما كانوا ببعض الطريق عثرت الناقة، فصرع النبي صلى الله عليه وسلم والمرأة، وإن أبا طلحة  قال أحسب قال  اقتحم عن بعيره فأتى رسول الله صلى الله عليه وسلم فقال يا نبي الله جعلني الله فداءك، هل أصابك من شىء قال ‏\"‏ لا، ولكن عليك بالمرأة ‏\"‏‏.‏ فألقى أبو طلحة ثوبه على وجهه، فقصد قصدها فألقى ثوبه عليها، فقامت المرأة، فشد لهما على راحلتهما فركبا، فساروا حتى إذا كانوا بظهر المدينة  أو قال أشرفوا على المدينة  قال النبي صلى الله عليه وسلم ‏\"‏ آيبون تائبون عابدون لربنا حامدون ‏\"‏‏.‏ فلم يزل يقولها حتى دخل المدينة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     That he and Abu Talha came in the company of the Prophet and Safiya was accompanying the Prophet, who let her ride behind him on his she-camel. During the journey, the she-camel slipped and both the Prophet and (his) wife fell down. Abu Talha (the sub-narrator thinks that Anas said that Abu Talha jumped from his camel quickly) said, \"O Allah's Apostle! May Allah sacrifice me for your sake! Did you get hurt?\" The Prophet replied,\"No, but take care of the lady.\" Abu Talha covered his face with his garment and proceeded towards her and covered her with his garment, and she got up. He then set right the condition of their she-camel and both of them (i.e. the Prophet and his wife) rode and proceeded till they approached Medina. The Prophet said, \"We are returning with repentance and worshipping and praising our Lord.\" The Prophet kept on saying this statement till he entered Medina.",
      "chain": [
        "30026",
        "20212",
        "11314",
        "19"
      ]
    },
    {
      "hadith_no": "3173",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا مسدد، حدثنا بشر  هو ابن المفضل  حدثنا يحيى، عن بشير بن يسار، عن سهل بن أبي حثمة، قال انطلق عبد الله بن سهل ومحيصة بن مسعود بن زيد إلى خيبر، وهى يومئذ صلح، فتفرقا، فأتى محيصة إلى عبد الله بن سهل وهو يتشحط في دم قتيلا، فدفنه ثم قدم المدينة، فانطلق عبد الرحمن بن سهل ومحيصة وحويصة ابنا مسعود إلى النبي صلى الله عليه وسلم، فذهب عبد الرحمن يتكلم فقال ‏\"‏ كبر كبر ‏\"‏‏.‏ وهو أحدث القوم، فسكت فتكلما فقال ‏\"‏ أتحلفون وتستحقون قاتلكم أو صاحبكم ‏\"‏‏.‏ قالوا وكيف نحلف ولم نشهد ولم نر قال ‏\"‏ فتبريكم يهود بخمسين ‏\"‏‏.‏ فقالوا كيف نأخذ أيمان قوم كفار فعقله النبي صلى الله عليه وسلم من عنده‏.‏",
      "text_en": " Narrated Sahl bin Abi Hathma:                     `Abdullah bin Sahl and Muhaiyisa bin Mas`ud bin Zaid set out to Khaibar, the inhabitants of which had a peace treaty with the Muslims at that time. They parted and later on Muhaiyisa came upon `Abdullah bin Sah! and found him murdered agitating in his blood. He buried him and returned to Medina. `Abdur Rahman bin Sahl, Muhaiyisa and Huwaiuisa, the sons of Mas`ud came to the Prophet and `Abdur Rahman intended to talk, but the Prophet said (to him), \"Let the eldest of you speak.\" as `Abdur-Rahman was the youngest:. `Abdur-Rahman kept silent and the other two spoke. The Prophet said, \"If you swear as to who has committed the murder, you will have the right to take your right from the murderer.\" They said, \"How should we swear if we did not witness the murder or see the murderer?\" The Prophet said, \"Then the Jews can clear themselves from the charge by taking Alaska (an oath taken by men that it was not they who committed the murder).\" The!y said, \"How should we believe in the oaths of infidels?\" So, the Prophet himself paid the blood money (of `Abdullah). (See Hadith No. 36 Vol. 9.)",
      "chain": [
        "30175",
        "20212",
        "20031",
        "11810",
        "1822"
      ]
    },
    {
      "hadith_no": "3916",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني عبد الله بن عبد الوهاب، حدثنا بشر بن المفضل، حدثنا سعيد بن أبي عروبة، عن قتادة، عن أنس بن مالك  رضى الله عنه أن أهل، مكة سألوا رسول الله صلى الله عليه وسلم أن يريهم آية، فأراهم القمر شقتين، حتى رأوا حراء بينهما‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The people of Mecca asked Allah's Apostle to show them a miracle. So he showed them the moon split in two halves between which they saw the Hira' mountain.",
      "chain": [
        "30143",
        "20212",
        "11073",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "3986",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني حامد بن عمر، عن بشر بن المفضل، حدثنا حميد، حدثنا أنس، أن عبد الله بن سلام، بلغه مقدم النبي صلى الله عليه وسلم المدينة، فأتاه يسأله عن أشياء، فقال إني سائلك عن ثلاث لا يعلمهن إلا نبي ما أول أشراط الساعة وما أول طعام يأكله أهل الجنة وما بال الولد ينزع إلى أبيه أو إلى أمه قال ‏\"‏ أخبرني به جبريل آنفا ‏\"‏‏.‏ قال ابن سلام ذاك عدو اليهود من الملائكة‏.‏ قال ‏\"‏ أما أول أشراط الساعة فنار تحشرهم من المشرق إلى المغرب، وأما أول طعام يأكله أهل الجنة، فزيادة كبد الحوت، وأما الولد، فإذا سبق ماء الرجل ماء المرأة نزع الولد، وإذا سبق ماء المرأة ماء الرجل نزعت الولد ‏\"‏‏.‏ قال أشهد أن لا إله إلا الله وأنك رسول الله‏.‏ قال يا رسول الله، إن اليهود قوم بهت، فاسألهم عني قبل أن يعلموا بإسلامي، فجاءت اليهود فقال النبي صلى الله عليه وسلم ‏\"‏ أى رجل عبد الله بن سلام فيكم ‏\"‏‏.‏ قالوا خيرنا وابن خيرنا وأفضلنا وابن أفضلنا‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أرأيتم إن أسلم عبد الله بن سلام ‏\"‏‏.‏ قالوا أعاذه الله من ذلك‏.‏ فأعاد عليهم، فقالوا مثل ذلك، فخرج إليهم عبد الله فقال أشهد أن لا إله إلا الله وأن محمدا رسول الله‏.‏ قالوا شرنا وابن شرنا‏.‏ وتنقصوه‏.‏ قال هذا كنت أخاف يا رسول الله‏.‏",
      "text_en": " Narrated Anas:                     When the news of the arrival of the Prophet at Medina reached `Abdullah bin Salam, he went to him to ask him about certain things, He said, \"I am going to ask you about three things which only a Prophet can answer: What is the first sign of The Hour? What is the first food which the people of Paradise will eat? Why does a child attract the similarity to his father or to his mother?\" The Prophet replied, \"Gabriel has just now informed me of that.\" Ibn Salam said, \"He (i.e. Gabriel) is the enemy of the Jews amongst the angels. The Prophet said, \"As for the first sign of The Hour, it will be a fire that will collect the people from the East to the West. As for the first meal which the people of Paradise will eat, it will be the caudate (extra) lobe of the fish-liver. As for the child, if the man's discharge proceeds the woman's discharge, the child attracts the similarity to the man, and if the woman's discharge proceeds the man's, then the child attracts the similarity to the woman.\" On this, `Abdullah bin Salam said, \"I testify that None has the right to be worshipped except Allah, and that you are the Apostle of Allah.\" and added, \"O Allah's Apostle! Jews invent such lies as make one astonished, so please ask them about me before they know about my conversion to I slam . \" The Jews came, and the Prophet said, \"What kind of man is `Abdullah bin Salam among you?\" They replied, \"The best of us and the son of the best of us and the most superior among us, and the son of the most superior among us. \"The Prophet said, \"What would you think if `Abdullah bin Salam should embrace Islam?\" They said, \"May Allah protect him from that.\" The Prophet repeated his question and they gave the same answer. Then `Abdullah came out to them and said, \"I testify that None has the right to be worshipped except Allah and that Muhammad is the Apostle of Allah!\" On this, the Jews said, \"He is the most wicked among us and the son of the most wicked among us.\" So they degraded him. On this, he (i.e. `Abdullah bin Salam) said, \"It is this that I was afraid of, O Allah's Apostle.",
      "chain": [
        "30128",
        "20212",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "4051",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا علي، حدثنا بشر بن المفضل، حدثنا خالد بن ذكوان، عن الربيع بنت معوذ، قالت دخل على النبي صلى الله عليه وسلم غداة بني على، فجلس على فراشي كمجلسك مني، وجويريات يضربن بالدف، يندبن من قتل من آبائهن يوم بدر حتى قالت جارية وفينا نبي يعلم ما في غد‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا تقولي هكذا، وقولي ما كنت تقولين ‏\"‏‏.‏",
      "text_en": " Narrated Ar-Rubai bint Muauwidh:                     The Prophet came to me after consuming his marriage with me and sat down on my bed as you (the sub-narrator) are sitting now, and small girls were beating the tambourine and singing in lamentation of my father who had been killed on the day of the battle of Badr. Then one of the girls said, \"There is a Prophet amongst us who knows what will happen tomorrow.\" The Prophet said (to her),\" Do not say this, but go on saying what you have spoken before.\"",
      "chain": [
        "30026",
        "20212",
        "11158",
        "617"
      ]
    },
    {
      "hadith_no": "4397",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، عن حميد الطويل، حدثنا بكر، أنه ذكر لابن عمر أن أنسا حدثهم أن النبي صلى الله عليه وسلم أهل بعمرة وحجة، فقال أهل النبي صلى الله عليه وسلم بالحج، وأهللنا به معه، فلما قدمنا مكة قال ‏\"‏ من لم يكن معه هدى فليجعلها عمرة ‏\"‏‏.‏ وكان مع النبي صلى الله عليه وسلم هدى، فقدم علينا علي بن أبي طالب من اليمن حاجا فقال النبي صلى الله عليه وسلم ‏\"‏ بم أهللت فإن معنا أهلك ‏\"‏‏.‏ قال أهللت بما أهل به النبي صلى الله عليه وسلم‏.‏ قال ‏\"‏ فأمسك، فإن معنا هديا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet assumed the state of Ihram for Umra and Hajj, and we to assumed it for Hajj with him. When we arrived at Mecca, the Prophet said, \"Whoever does not possess a Hadi should regard his Ihram for Umra only.\" The Prophet had a Hadi with him. `Ali bin Abi Talib came to us from Yemen with the intention of performing Hajj. The Prophet said (to him), \"With what intention have you assumed the Ihram, for your wife is with us?\" `Ali said, \"I assumed the lhram with the same intention as that of the Prophet .\" The Prophet said, \"Keep on the state of lhram, as we have got the Hadi.\"",
      "chain": [
        "30175",
        "20212",
        "11279",
        "11267"
      ]
    },
    {
      "hadith_no": "5202",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، حدثنا خالد بن ذكوان، قال قالت الربيع بنت معوذ ابن عفراء‏.‏ جاء النبي صلى الله عليه وسلم فدخل حين بني على، فجلس على فراشي كمجلسك مني، فجعلت جويريات لنا يضربن بالدف ويندبن من قتل من آبائي يوم بدر، إذ قالت إحداهن وفينا نبي يعلم ما في غد‏.‏ فقال ‏\"‏ دعي هذه، وقولي بالذي كنت تقولين ‏\"‏‏.‏",
      "text_en": " Narrated Ar-Rabi`:                     (the daughter of Muawwidh bin Afra) After the consummation of my marriage, the Prophet came and sat on my bed as far from me as you are sitting now, and our little girls started beating the tambourines and reciting elegiac verses mourning my father who had been killed in the battle of Badr. One of them said, \"Among us is a Prophet who knows what will happen tomorrow.\" On that the Prophet said, \"Leave this (saying) and keep on saying the verses which you had been saying before.\"",
      "chain": [
        "30175",
        "20212",
        "11158"
      ]
    },
    {
      "hadith_no": "5268",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا مسدد، حدثنا بشر، حدثنا خالد، عن أبي قلابة، عن أنس  رضى الله عنه  ولو شئت أن أقول قال النبي صلى الله عليه وسلم ولكن قال السنة إذا تزوج البكر أقام عندها سبعا، وإذا تزوج الثيب أقام عندها ثلاثا‏.‏",
      "text_en": " Narrated Anas:                     The tradition, (of the Prophet) is that if someone marries a virgin and he has already a matron wife (with him), then he should stay with the virgin for seven days; and if someone marries a matron (and he has already a virgin wife with him) then he should stay with her for three days.",
      "chain": [
        "30175",
        "20212",
        "11282",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "5351",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، حدثنا سلمة بن علقمة، عن محمد بن سيرين، عن أبي هريرة، قال قال أبو القاسم صلى الله عليه وسلم ‏\"‏ في الجمعة ساعة لا يوافقها مسلم قائم يصلي، فسأل الله خيرا، إلا أعطاه ‏\"‏‏.‏ وقال بيده، ووضع أنملته على بطن الوسطى والخنصر‏.‏ قلنا يزهدها‏.‏",
      "text_en": "      Narrated Abu Huraira:                          Abul Qasim (the Prophet ) said, \"There is an hour (or a moment) of      particular significance on Friday. If it happens that a Muslim is      offering a prayer and invoking Allah for some good at that very      moment, Allah will grant him his request.\" (The sub-narrator placed      the top of his finger on the palm of the other hand between the middle     finger and the little one.)",
      "chain": [
        "30175",
        "20212",
        "11593",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "5394",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا مسدد، حدثنا بشر، حدثنا سلمة بن علقمة، عن محمد بن سيرين، قالت أم عطية نهينا أن نحد أكثر من ثلاث إلا بزوج‏.‏",
      "text_en": " Narrated Um 'Atiyya:                     We were forbidden to mourn for more than three days except for a husband.",
      "chain": [
        "30175",
        "20212",
        "11593",
        "11035"
      ]
    },
    {
      "hadith_no": "5741",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بشر بن المفضل، عن خالد بن ذكوان، عن ربيع بنت معوذ ابن عفراء، قالت كنا نغزو مع رسول الله صلى الله عليه وسلم نسقي القوم، ونخدمهم، ونرد القتلى والجرحى إلى المدينة‏.‏",
      "text_en": " Narrated Rubai bint Mu`adh bin Afra:                     We used to go for Military expeditions along with Allah's Apostle and provide the people with water, serve them and bring the dead and the wounded back to Medina.",
      "chain": [
        "30367",
        "20212",
        "11158"
      ]
    },
    {
      "hadith_no": "6118",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، عن حميد، قال قال أنس حدثني عبادة بن الصامت، قال خرج رسول الله صلى الله عليه وسلم ليخبر الناس بليلة القدر، فتلاحى رجلان من المسلمين، قال النبي صلى الله عليه وسلم ‏\"‏ خرجت لأخبركم، فتلاحى فلان وفلان وإنها رفعت، وعسى أن يكون خيرا لكم، فالتمسوها في التاسعة والسابعة والخامسة ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                     Allah's Apostle went out to inform the people about the (date of the Night of decree (Al-Qadr). There happened a quarrel between two Muslim men. The Prophet said, \"I came out to inform you about the Night of Al-Qadr, but as so-and-so and so-and-so quarrelled, so the news about it had been taken away; and may be it was better for you. So look for it in the ninth, the seventh, or the fifth (of the last ten days of Ramadan).",
      "chain": [
        "30175",
        "20212",
        "11279",
        "19",
        "40"
      ]
    },
    {
      "hadith_no": "6255",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا بشر بن المفضل، حدثنا يحيى بن أبي إسحاق، عن أنس بن مالك، أنه أقبل هو وأبو طلحة مع النبي صلى الله عليه وسلم ومع النبي صلى الله عليه وسلم صفية، مردفها على راحلته، فلما كانوا ببعض الطريق عثرت الناقة، فصرع النبي صلى الله عليه وسلم والمرأة، وأن أبا طلحة  قال أحسب  اقتحم عن بعيره، فأتى رسول الله صلى الله عليه وسلم فقال يا نبي الله جعلني الله فداك، هل أصابك من شىء‏.‏ قال ‏\"‏ لا ولكن عليك بالمرأة ‏\"‏‏.‏ فألقى أبو طلحة ثوبه على وجهه فقصد قصدها، فألقى ثوبه عليها فقامت المرأة، فشد لهما على راحلتهما فركبا، فساروا حتى إذا كانوا بظهر المدينة  أو قال أشرفوا على المدينة  قال النبي صلى الله عليه وسلم ‏\"‏ آيبون تائبون، عابدون لربنا حامدون ‏\"‏‏.‏ فلم يزل يقولها حتى دخل المدينة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     That he and Abu Talha were coming in the company of the Prophet towards Medina), while Safiya (the Prophet's wife) was riding behind him on his she-camel. After they had covered a portion of the way suddenly the foot of the she-camel slipped and both the Prophet and the woman (i.e., his wife, Safiya) fell down. Abu Talha jumped quickly off his camel and came to the Prophet (saying.) \"O Allah's Apostle! Let Allah sacrifice me for you! Have you received any injury?\" The Prophet said, \"No, but take care of the woman (my wife).\" Abu Talha covered his face with his garment and went towards her and threw his garment over her. Then the woman got up and Abu Talha prepared their she camel (by tightening its saddle, etc.) and both of them (the Prophet and Safiya) mounted it. Then all of them proceeded and when they approached near Medina, or saw Medina, the Prophet said, \"Ayibun,' abidun, taibun, liRabbina hamidun (We are coming back (to Medina) with repentance, worshipping (our Lord) and celebrating His (our Lord's) praises\". The Prophet continued repeating these words till he entered the city of Medina.",
      "chain": [
        "30026",
        "20212",
        "11314",
        "19"
      ]
    },
    {
      "hadith_no": "6347",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا بشر بن المفضل، حدثنا الجريري، عن عبد الرحمن بن أبي بكرة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا أخبركم بأكبر الكبائر ‏\"‏‏.‏ قالوا بلى يا رسول الله‏.‏ قال ‏\"‏ الإشراك بالله، وعقوق الوالدين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     Allah's Apostle said, \"Shall I inform you of the biggest of the great sins?\" They said, \"Yes, O Allah's Apostle!\" He said, \"To join partners in worship with Allah, and to be undutiful to one's parents. \"",
      "chain": [
        "30026",
        "20212",
        "11286",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "7005",
      "source": " Sahih Bukhari ",
      "chapter": "Dealing with Apostates - كتاب استتابة المرتدين والمعاندين وقتالهم",
      "chapter_no": "89",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، حدثنا الجريري، وحدثني قيس بن حفص، حدثنا إسماعيل بن إبراهيم، أخبرنا سعيد الجريري، حدثنا عبد الرحمن بن أبي بكرة، عن أبيه  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ أكبر الكبائر الإشراك بالله، وعقوق الوالدين، وشهادة الزور، وشهادة الزور  ثلاثا  أو قول الزور ‏\"‏‏.‏ فما زال يكررها حتى قلنا ليته سكت‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet. said, \"The biggest of the great sins are: To join others in worship with Allah, to be undutiful to one's parents, and to give a false witness.\" He repeated it thrice, or said, \"....a false statement,\" and kept on repeating that warning till we wished he would stop saying it. (See Hadith No.7, Vol. 8)",
      "chain": [
        "30175",
        "20212",
        "11286",
        "30158",
        "20208",
        "11286",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "146",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا بشر بن المفضل، حدثنا خالد الحذاء، عن الوليد أبي بشر، قال سمعت حمران، يقول سمعت عثمان، يقول سمعت رسول الله صلى الله عليه وسلم يقول مثله سواء ‏.‏",
      "text_en": " It is narrated on the authority of Humran that he heard Uthman saying this:                      I heard the Messenger of Allah (may peace be upon him) uttering these words (as stated above).",
      "chain": [
        "30161",
        "20212",
        "11282",
        "10725",
        "11421",
        "4"
      ]
    },
    {
      "hadith_no": "477",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني نصر بن علي الجهضمي، حدثنا بشر، - يعني ابن المفضل - عن أبي مسلمة، عن أبي نضرة، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أما أهل النار الذين هم أهلها فإنهم لا يموتون فيها ولا يحيون ولكن ناس أصابتهم النار بذنوبهم - أو قال بخطاياهم - فأماتهم إماتة حتى إذا كانوا فحما أذن بالشفاعة فجيء بهم ضبائر ضبائر فبثوا على أنهار الجنة ثم قيل يا أهل الجنة أفيضوا عليهم ‏.‏ فينبتون نبات الحبة تكون في حميل السيل ‏\"‏ ‏.‏ فقال رجل من القوم كأن رسول الله صلى الله عليه وسلم قد كان بالبادية ‏.‏",
      "text_en": " It is reported by Abu Sa'id that the Messenger of Allah (may peace be upon him) said:                      The (permanent) inhabitants of the Fire are those who are doomed to it, and verily they would neither die nor live in it (al-Qur'an, xx. 47; lxxxvii. 13). But the people whom the Fire would afflict (temporarily) on account of their sins, or so said (the narrator)\" on account of their misdeeds,\" He would cause them to die till they would be turned into charcoal. Then they would be granted intercession and would be brought in groups and would be spread on the rivers of Paradise and then it would be said: O inhabitants of Paradise, pour water over them; then they would sprout forth like the sprouting of seed in the silt carried by flood. A man among the people said: (It appears) as if the Messenger of Allah lived in the steppe.",
      "chain": [
        "30395",
        "20212",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "278",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا نصر بن علي الجهضمي، وحامد بن عمر البكراوي، قالا حدثنا بشر بن المفضل، عن خالد، عن عبد الله بن شقيق، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا استيقظ أحدكم من نومه فلا يغمس يده في الإناء حتى يغسلها ثلاثا فإنه لا يدري أين باتت يده ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira said:                      When anyone amongst you wakes up from sleep, he must not put his hand in the utensil till he has washed it three times, for he does not know where his hand was during the night.",
      "chain": [
        "30395",
        "30128",
        "20212",
        "11282",
        "10694",
        "13"
      ]
    },
    {
      "hadith_no": "326",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا أبو كامل الجحدري، وعمرو بن علي، كلاهما عن بشر بن المفضل، - قال أبو كامل حدثنا بشر، - حدثنا أبو ريحانة، عن سفينة، قال كان رسول الله صلى الله عليه وسلم يغسله الصاع من الماء من الجنابة ويوضؤه المد ‏.‏",
      "text_en": " Safina reported:                      The Messenger of Allah (may peace be upon him) took a bath with one g' of water because of sexual intercourse and performed ablution with one Mudd.",
      "chain": [
        "30559",
        "30153",
        "20212",
        "20212",
        "10696",
        "438"
      ]
    },
    {
      "hadith_no": "1264",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا بشر بن المفضل، عن أبي مسلمة، سعيد بن يزيد قال قلت لأنس بن مالك أكان رسول الله صلى الله عليه وسلم يصلي في النعلين قال نعم ‏.‏",
      "text_en": " Sa'd b. Yazid reported:                      I said to Anas b. Malik: Did the Messenger of Allah (may peace be upon him) pray while putting on the shoes? He said: Yes.",
      "chain": [
        "30399",
        "20212",
        "11288"
      ]
    },
    {
      "hadith_no": "1369",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا حامد بن عمر البكراوي، حدثنا بشر، - يعني ابن المفضل ح قال وحدثنا محمد بن المثنى، حدثني أزهر، جميعا عن ابن عون، عن أبي سعيد، عن وراد، كاتب المغيرة بن شعبة قال كتب معاوية إلى المغيرة ‏.‏ بمثل حديث منصور والأعمش ‏.‏",
      "text_en": " Warrad, the scribe of Mughira b. Shu'ba, reported:                      Mu'awiya wrote to Mughira (the contents) of the hadith as transmitted by Mansur and A'mash.",
      "chain": [
        "30128",
        "20212",
        "30170",
        "11071",
        "38",
        "11402"
      ]
    },
    {
      "hadith_no": "1438",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن يحيى، حدثنا بشر بن المفضل، عن غالب القطان، عن بكر بن عبد الله، عن أنس بن مالك، قال كنا نصلي مع رسول الله صلى الله عليه وسلم في شدة الحر فإذا لم يستطع أحدنا أن يمكن جبهته من الأرض بسط ثوبه فسجد عليه ‏.‏",
      "text_en": " Anas b. Malik reported:                      We used to say (the noonprayer) with the Messenger of Allah (may peace be upon him) in the intense heat, but when someone amongst us found it hard to place his forehead on the ground, he spread his cloth and prostrated on it.",
      "chain": [
        "30399",
        "20212",
        "11299",
        "11267",
        "19"
      ]
    },
    {
      "hadith_no": "1686",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا حامد بن عمر البكراوي، حدثنا بشر بن المفضل، حدثنا عمارة بن غزية، عن ربيعة بن أبي عبد الرحمن، عن عبد الملك بن سعيد بن سويد الأنصاري، عن أبي حميد، أو عن أبي أسيد، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been narrated from the Apostle of Allah (may peace be upon him) by Abu Usaid.",
      "chain": [
        "30128",
        "20212",
        "11894",
        "11162",
        "113"
      ]
    },
    {
      "hadith_no": "1728",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني أبو غسان المسمعي، حدثنا بشر بن المفضل، حدثنا داود، عن النعمان بن سالم، بهذا الإسناد ‏\"‏ من صلى في يوم ثنتى عشرة سجدة تطوعا بني له بيت في الجنة ‏\"‏ ‏.‏",
      "text_en": " Nu'man b. Salim reported with the same chain of transmitters:                      He who observed twelve voluntary rak'ahs, a house will be built for him in Paradise.",
      "chain": [
        "30456",
        "20212"
      ]
    },
    {
      "hadith_no": "2157",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "وحدثني عبيد الله بن عمر القواريري، حدثنا بشر بن المفضل، حدثنا الجريري، عن أبي العلاء، حيان بن عمير عن عبد الرحمن بن سمرة، قال بينما أنا أرمي، بأسهمي في حياة رسول الله صلى الله عليه وسلم إذ انكسفت الشمس فنبذتهن وقلت لأنظرن إلى ما يحدث لرسول الله صلى الله عليه وسلم في انكساف الشمس اليوم فانتهيت إليه وهو رافع يديه يدعو ويكبر ويحمد ويهلل حتى جلي عن الشمس فقرأ سورتين وركع ركعتين ‏.‏",
      "text_en": " 'Abd al-Rahman b. Samura said:                      During the lifetime of Allah's Messenger (may peace be upon him) I was shooting my arrows in Medina, when an eclipse of the sun took place. I, therefore, threw them away and said, I must see how the Messenger of Allah (may peace be upon him) acts in a solar eclipse today. When I came to him, he had been supplicating with his hands, raised, pronouncing Allah-o-Akbar, praising Him, acknowledging that He is One God till the eclipse was over, then he recited two surahs and prayed two rak'ahs.",
      "chain": [
        "30024",
        "20212",
        "11286",
        "955"
      ]
    },
    {
      "hadith_no": "2162",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا أبو كامل الجحدري، فضيل بن حسين وعثمان بن أبي شيبة كلاهما عن بشر، - قال أبو كامل حدثنا بشر بن المفضل، - حدثنا عمارة بن غزية، حدثنا يحيى، بن عمارة قال سمعت أبا سعيد الخدري، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لقنوا موتاكم لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported Allah's Messenger (may peace be upon him) as saying:                      Exhort to recite\" There is no god but Allah\" to those of you who are dying.",
      "chain": [
        "30559",
        "20212",
        "20212",
        "11894",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "2555",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني حميد بن مسعدة الباهلي، حدثنا بشر بن المفضل، حدثنا سلمة، - وهو ابن علقمة - عن نافع، عن عبد الله بن عمر، - رضى الله عنهما - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الشهر تسع وعشرون فإذا رأيتم الهلال فصوموا وإذا رأيتموه فأفطروا فإن غم عليكم فاقدروا له ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. 'Umar (Allah be pleased with both of them) reported Allah's Messenger (may peace be upon him) as saying:                      The month (of Ramadan) may consist of twenty nine days; so when you see the new moon observe fast and when you see (the new moon again at the commencement of the month of Shawwal) then break It, and if the sky is cloudy for you, then calculate it (and complete thirty days).",
      "chain": [
        "30430",
        "20212",
        "11593",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2725",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني أبو بكر بن نافع العبدي، حدثنا بشر بن المفضل بن لاحق، حدثنا خالد، بن ذكوان عن الربيع بنت معوذ بن عفراء، قالت أرسل رسول الله صلى الله عليه وسلم غداة عاشوراء إلى قرى الأنصار التي حول المدينة ‏\"‏ من كان أصبح صائما فليتم صومه ومن كان أصبح مفطرا فليتم بقية يومه ‏\"‏ ‏.‏ فكنا بعد ذلك نصومه ونصوم صبياننا الصغار منهم إن شاء الله ونذهب إلى المسجد فنجعل لهم اللعبة من العهن فإذا بكى أحدهم على الطعام أعطيناها إياه عند الإفطار ‏.‏",
      "text_en": " Rubayyi' daughter of Mu'awwidh b. 'Afra' said that the Messenger of Allah (may peace be upon him) sent (a person) on the morning of Ashura to the villages of Ansar around Medina (with this message):                      He who got up in the morning fasting (without eating anything) he should complete his fast, and he who had had his breakfast in the morning, he should complete the rest of the day (without food). The Companions said; We henceforth observed fast on it (on the day of 'Ashura) and, God willing, made our children observe that. We went to the mosque and made toys out of wool for them and when anyone felt hungry and wept for food we gave them these toys till it was the time to break the fast.",
      "chain": [
        "20212",
        "11158",
        "617"
      ]
    },
    {
      "hadith_no": "3039",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا حامد بن عمر البكراوي، ومحمد بن أبي بكر المقدمي، قالا حدثنا بشر، بن المفضل حدثنا عمران بن مسلم، عن أبي رجاء، قال قال عمران بن حصين نزلت آية المتعة في كتاب الله - يعني متعة الحج - وأمرنا بها رسول الله صلى الله عليه وسلم ثم لم تنزل آية تنسخ آية متعة الحج ولم ينه عنها رسول الله صلى الله عليه وسلم حتى مات ‏.‏ قال رجل برأيه بعد ما شاء ‏.‏",
      "text_en": "  'Imran b. Husain said:                      There was revealed the verse of Tamattu' in Hajj in the Book of Allah and the Messenger of Allah (may peace be upon him) commanded us to perform it. and then no verse was revealed abrogating the Tamattu' (form of Hajj), and the Messenger of Allah (may peace be upon him) did not forbid to do it till he died. So whatever a person said was his personal opinion.",
      "chain": [
        "30128",
        "30161",
        "20212",
        "11562",
        "11440"
      ]
    },
    {
      "hadith_no": "3346",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا حميد بن مسعدة، حدثنا بشر بن المفضل، حدثنا يحيى بن أبي إسحاق، عن أنس بن مالك، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been narrated by Anas b. Malik (Allah be pleased with him) through another chain of transmitters.",
      "chain": [
        "30430",
        "20212",
        "11314",
        "19"
      ]
    },
    {
      "hadith_no": "3588",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثني حميد بن مسعدة الباهلي، حدثنا بشر بن المفضل، حدثنا إسماعيل بن، أمية عن نافع، عن عبد الله بن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ائتوا الدعوة إذا دعيتم ‏\"‏ ‏.‏",
      "text_en": " \" Abdullah b. Umar (Allah be pleased with them) reported Allah's Messen- ger (may peace be upon him) as saying:                      Come to the feast, when you are invited.",
      "chain": [
        "30430",
        "20212",
        "11417",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3620",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثنا نصر بن علي الجهضمي، حدثنا بشر بن المفضل، حدثنا شعبة، عن أنس، بن سيرين عن معبد بن سيرين، عن أبي سعيد الخدري، قال قلت له سمعته من أبي سعيد، قال نعم عن النبي صلى الله عليه وسلم قال ‏\"‏ لا عليكم أن لا تفعلوا فإنما هو القدر‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) (was asked if he had heard it himself), to which he said:                      Yes. (I heard) Allah's Apostle (may peace be upon him) as saying: There is no harm if you do not practise it, for it (the birth of the child) is something ordained (by Allah).",
      "chain": [
        "30395",
        "20212",
        "20020",
        "11038",
        "11036",
        "38"
      ]
    },
    {
      "hadith_no": "3871",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "وحدثني حميد بن مسعدة، حدثنا بشر بن المفضل، حدثنا عاصم، - وهو ابن محمد العمري - حدثنا واقد، - يعني أخاه - حدثني سعيد ابن مرجانة، - صاحب علي بن حسين - قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما امرئ مسلم أعتق امرأ مسلما استنقذ الله بكل عضو منه عضوا منه من النار ‏\"‏ ‏.‏ قال فانطلقت حين سمعت الحديث من أبي هريرة فذكرته لعلي بن الحسين فأعتق عبدا له قد أعطاه به ابن جعفر عشرة آلاف درهم أو ألف دينار ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      A Muslim who emancipates a Muslim (slave). Allah will save from Fire every limb of his for every limb (of the slave). Sa'id b. Marjana said: When I heard this hadith from Abu Huraira (Allah be pleased with him), I went away and made a mention of it to 'Ali b. Husain and he at once emancipated the slave for which Ibn ja'far was prepared to pay ten thousand dirhams or one thousand dinars.",
      "chain": [
        "30430",
        "20212",
        "20163",
        "11571",
        "13"
      ]
    },
    {
      "hadith_no": "4101",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثني حميد بن مسعدة، حدثنا بشر، - يعني ابن المفضل - حدثنا إسماعيل، - وهو ابن أمية - عن نافع، عن عبد الله، قال كان رسول الله صلى الله عليه وسلم يأمر بقتل الكلاب فننبعث في المدينة وأطرافها فلا ندع كلبا إلا قتلناه حتى إنا لنقتل كلب المرية من أهل البادية يتبعها ‏.‏",
      "text_en": " Abdullah (b. Umar) (Allah be pleased with them) reported:                      Allah's Messenger (may peace be upon him) ordered the killing of dogs and we would send (men) in Medina and its corners and we did not spare any dog that we did not kill, so much so that we killed the dog that accompanied the wet she-camel belonging to the people of the desert.",
      "chain": [
        "30430",
        "20212",
        "11417",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4436",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "وحدثنا القواريري، حدثنا بشر بن المفضل، حدثنا يحيى بن سعيد، عن بشير بن، يسار عن سهل بن أبي حثمة، عن النبي صلى الله عليه وسلم ‏.‏ نحوه ‏.‏ وقال في حديثه فعقله رسول الله صلى الله عليه وسلم من عنده ‏.‏ ولم يقل في حديثه فركضتني ناقة ‏.‏",
      "text_en": " Sahl b. Abu Hathma has narrated this hadith through another chain of transmitters with a slight variation of words, but no mention has been made of the hitting by the she-camel.",
      "chain": [
        "30024",
        "20212",
        "11062",
        "11810",
        "1822"
      ]
    },
    {
      "hadith_no": "6736",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا عبيد الله بن عمر القواريري، حدثنا يحيى بن سعيد، وبشر بن المفضل، قالا حدثنا عمران أبو بكر، حدثني عطاء بن أبي رباح، قال قال لي ابن عباس ألا أريك امرأة من أهل الجنة قلت بلى ‏.‏ قال هذه المرأة السوداء أتت النبي صلى الله عليه وسلم قالت إني أصرع وإني أتكشف فادع الله لي ‏.‏ قال ‏\"‏ إن شئت صبرت ولك الجنة وإن شئت دعوت الله أن يعافيك ‏.‏ قالت أصبر ‏.‏ قالت فإني أتكشف فادع الله أن لا أتكشف ‏.‏ فدعا لها ‏.‏",
      "text_en": " 'Ata' b. Abi Rabih said:                      Ibn Abbas said to me: May I show you a woman of Paradise? I said: Yes. He said: Here is this dark-complexioned woman. She came to Allah's Apostle (may peace be upon him) and said: I am suffering from falling sickness and I become naked; supplicate Allah for me, whereupon he (the Holy Prophet) said: Show endurance as you can do and there would be Paradise for you and, if you desire, I supplicate Allah that He may cure you. She said: I am prepared to show endurance (but the unbearable trouble is) that I become naked, so supplicate Allah that He should not let me become naked, so he supplicated for her.",
      "chain": [
        "30024",
        "20031",
        "20212",
        "11029"
      ]
    },
    {
      "hadith_no": "7174",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "وحدثنا محمد بن أبي بكر المقدمي، حدثنا بشر بن المفضل، عن هشام، عن يحيى، بن أبي كثير عن أبي سلمة، عن عروة، عن أسماء، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ لا شىء أغير من الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Asma' reported that Allah's Apostle (may peace be upon him) said:                      There is none more self-respecting than Allah, the Exalted and Glorious.",
      "chain": [
        "30161",
        "20212",
        "20295",
        "11449",
        "10567",
        "10511",
        "70"
      ]
    },
    {
      "hadith_no": "7501",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا بشر يعني ابن المفضل، ح وحدثنا علي، بن حجر السعدي حدثنا إسماعيل، - يعني ابن علية - كلاهما عن سعيد بن يزيد، عن  أبي نضرة، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من خلفائكم خليفة يحثو المال حثيا لا يعده عددا ‏\"‏ ‏.‏ وفي رواية ابن حجر ‏\"‏ يحثي المال ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id reported that Allah's Messenger (may peace he upon him) I said:                      There would be amongest your caliphs a caliph who would give handfuls of wealth to the, but wbuld not count it. In. the narration transmitted on the authority of Ibn Hujr, there is a slight variation of wording.",
      "chain": [
        "30395",
        "20212",
        "20387",
        "20208",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "126",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، حدثنا عبد الله بن محمد بن عقيل، عن الربيع بنت معوذ ابن عفراء، قالت كان رسول الله صلى الله عليه وسلم يأتينا فحدثتنا أنه قال ‏\"‏ اسكبي لي وضوءا ‏\"‏ ‏.‏ فذكرت وضوء رسول الله صلى الله عليه وسلم قالت فيه فغسل كفيه ثلاثا ووضأ وجهه ثلاثا ومضمض واستنشق مرة ووضأ يديه ثلاثا ثلاثا ومسح برأسه مرتين يبدأ بمؤخر رأسه ثم بمقدمه وبأذنيه كلتيهما ظهورهما وبطونهما ووضأ رجليه ثلاثا ثلاثا ‏.‏ قال أبو داود وهذا معنى حديث مسدد ‏.‏",
      "text_en": " Narrated Ar-Rubayyi' daughter of Mu'awwidh ibn Afra':                     The Messenger of Allah (ﷺ) used to come to us. He once said: Pour ablution water on me. She then described how the Prophet (ﷺ) performed ablution saying: He washed his hands up to wrist three times and washed his face three times, and rinsed his mouth and snuffed up water once.  Then he washed his forearms three times and wiped his head twice beginning from the back of his head, then wiped its front. He wiped his ears outside and inside. Then he washed his feet three times.Abu Dawud said: The tradition narrated by Musaddad carries the same meaning.",
      "chain": [
        "30175",
        "20212",
        "12246",
        "617"
      ]
    },
    {
      "hadith_no": "231",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، وبشر، عن حميد، عن بكر، عن أبي رافع، عن أبي هريرة، قال لقيني رسول الله صلى الله عليه وسلم في طريق من طرق المدينة وأنا جنب فاختنست فذهبت فاغتسلت ثم جئت فقال ‏\"‏ أين كنت يا أبا هريرة ‏\"‏ ‏.‏ قال قلت إني كنت جنبا فكرهت أن أجالسك على غير طهارة ‏.‏ فقال ‏\"‏ سبحان الله إن المسلم لا ينجس ‏\"‏ ‏.‏ وقال في حديث بشر حدثنا حميد حدثني بكر ‏.‏",
      "text_en": " Abu Hudhaifah reported :                      The Messenger of Allah (ﷺ) met me on one of the streets of medina while I was sexually defiled. I retreated and went away. I then took a bath and came to him. He asked : Where were you, O Abu Hurairah? I replied : As I was sexually defiled, I disliked to sit in your company without purification. He exclaimed: Glory be to Allah! A Muslim is not defiled.He (Abu Dawud) said : The version of this tradition reported by Bishr has the chain: Humaid reported from Bakr.",
      "chain": [
        "30175",
        "20031",
        "20212",
        "11279",
        "11267",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "422",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، حدثنا داود بن أبي هند، عن أبي نضرة، عن أبي سعيد الخدري، قال صلينا مع رسول الله صلى الله عليه وسلم صلاة العتمة فلم يخرج حتى مضى نحو من شطر الليل فقال ‏\"‏ خذوا مقاعدكم ‏\"‏ ‏.‏ فأخذنا مقاعدنا فقال ‏\"‏ إن الناس قد صلوا وأخذوا مضاجعهم وإنكم لن تزالوا في صلاة ما انتظرتم الصلاة ولولا ضعف الضعيف وسقم السقيم لأخرت هذه الصلاة إلى شطر الليل ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     We observed the prayer after nightfall with the Messenger of Allah (ﷺ), and he did not come out till about half the night had passed. He then said: Take your places. We then took our places. Then he said: The people have prayed and gone to bed, but you are still engaged in prayer as long as you wait for the prayer. Were it not for the weakness of the weak and for  the sickness of the sick. I would delay this prayer till half the night had gone.",
      "chain": [
        "30175",
        "20212",
        "11585",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "660",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا بشر، - يعني ابن المفضل - حدثنا غالب القطان، عن بكر بن عبد الله، عن أنس بن مالك، قال كنا نصلي مع رسول الله صلى الله عليه وسلم في شدة الحر فإذا لم يستطع أحدنا أن يمكن وجهه من الأرض بسط ثوبه فسجد عليه ‏.‏",
      "text_en": " Anas b. Malik said:                      we used to pray along with the Messenger of Allah (ﷺ) in intense heat. When any of us could not rest his face on bare ground while prostrating due to intense heat he spread his cloth and would prostrate on it.",
      "chain": [
        "30007",
        "20212",
        "11299",
        "11267",
        "19"
      ]
    },
    {
      "hadith_no": "689",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، حدثنا إسماعيل بن أمية، حدثني أبو عمرو بن محمد بن حريث، أنه سمع جده، حريثا يحدث عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا صلى أحدكم فليجعل تلقاء وجهه شيئا فإن لم يجد فلينصب عصا فإن لم يكن معه عصا فليخطط خطا ثم لا يضره ما مر أمامه ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: When one of you prays, he should put something in front of his face, and if he can find nothing , he should set up his staff; but if he has no staff, he should draw a line; then what passes in front of him will not harm him.",
      "chain": [
        "30175",
        "20212",
        "11417",
        "24077",
        "13"
      ]
    },
    {
      "hadith_no": "726",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، عن عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال قلت لأنظرن إلى صلاة رسول الله صلى الله عليه وسلم كيف يصلي قال فقام رسول الله صلى الله عليه وسلم فاستقبل القبلة فكبر فرفع يديه حتى حاذتا أذنيه ثم أخذ شماله بيمينه فلما أراد أن يركع رفعهما مثل ذلك ثم وضع يديه على ركبتيه فلما رفع رأسه من الركوع رفعهما مثل ذلك فلما سجد وضع رأسه بذلك المنزل من بين يديه ثم جلس فافترش رجله اليسرى ووضع يده اليسرى على فخذه اليسرى وحد مرفقه الأيمن على فخذه اليمنى وقبض ثنتين وحلق حلقة ورأيته يقول هكذا ‏.‏ وحلق بشر الإبهام والوسطى وأشار بالسبابة ‏.‏",
      "text_en": " Narrated Wa'il ibn Hujr:                     I purposely looked at the prayer of the Messenger of Allah (ﷺ), how he offered it. The Messenger of Allah (ﷺ) stood up, faced the direction of the qiblah and uttered the takbir (Allah is most great) and then raised his hands in front of his ears, then placed his right hand on his left (catching each other). When he was about to bow, he raised them in the same manner. He then placed his hands on his knees. When he raised his head after bowing, he raised them in the like manner. When he prostrated himself he placed his forehead between his hands. He then sat down and spread his left foot and placed his left hand on his left thigh, and kept his right elbow aloof from his  right thigh. He closed his two fingers and made a circle (with the fingers).  I (Asim ibn Kulayb) saw him (Bishr ibn al-Mufaddal) say in this manner. Bishr made the circle with the thumb and the middle finger and pointed with the forefinger.",
      "chain": [
        "30175",
        "20212",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "922",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، ومسدد، - وهذا لفظه - قال حدثنا بشر، - يعني ابن المفضل - حدثنا برد، عن الزهري، عن عروة بن الزبير، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم - قال أحمد - يصلي والباب عليه مغلق فجئت فاستفتحت - قال أحمد - فمشى ففتح لي ثم رجع إلى مصلاه ‏.‏ وذكر أن الباب كان في القبلة ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) was praying with his door bolted. I came and asked to have the door opened. He walked and opened the door for me. He then returned to his place for prayer. He (the narrator Urwah) mentioned that the door faced the qiblah.",
      "chain": [
        "30007",
        "30175",
        "20212",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "957",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، عن عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال قلت لأنظرن إلى صلاة رسول الله صلى الله عليه وسلم كيف يصلي فقام رسول الله صلى الله عليه وسلم فاستقبل القبلة فكبر فرفع يديه حتى حاذتا بأذنيه ثم أخذ شماله بيمينه فلما أراد أن يركع رفعهما مثل ذلك - قال - ثم جلس فافترش رجله اليسرى ووضع يده اليسرى على فخذه اليسرى وحد مرفقه الأيمن على فخذه اليمنى وقبض ثنتين وحلق حلقة ورأيته يقول هكذا وحلق بشر الإبهام والوسطى وأشار بالسبابة ‏.‏",
      "text_en": " Narrated Wa'il ibn Hujr:                     I said that I should look at the prayer of the Messenger of Allah (ﷺ) how he prays. The Messenger of Allah (ﷺ) stood up and faced the qiblah (i.e. the direction of Ka'bah) and uttered the takbir (Allah is most great); then he raised his hands till he brought them in front of his ears; then he caught hold of his left hand with his right hand (i.e. folded his hands). When he was about to bow, he raised them (his hands) in a like manner. Then he sat, stretched out his left foot (to sit on it), placed his left hand on his left thigh, and kept away the tip of his right elbow from his right thigh, joined two fingers, formed a ring, to do so. And the narrator Bishr made a ring with the thumb and the middle finger.",
      "chain": [
        "30175",
        "20212",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "1010",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا بشر، - يعني ابن المفضل - حدثنا سلمة، - يعني ابن علقمة - عن محمد، عن أبي هريرة، قال صلى بنا رسول الله صلى الله عليه وسلم بمعنى حماد كله إلى آخر قوله نبئت أن عمران بن حصين قال ثم سلم ‏.‏ قال قلت فالتشهد قال لم أسمع في التشهد وأحب إلى أن يتشهد ولم يذكر كان يسميه ذا اليدين ‏.‏ ولا ذكر فأومئوا ‏.‏ ولا ذكر الغضب وحديث حماد عن أيوب أتم ‏.‏",
      "text_en": " Abu Hurairah said ; The Messenger of Allah (ﷺ) led us in prayer. He then narrated the same version reported by Hammad up to the words “we are sure that ‘Imran b. Husain said:                      then he gave the salutation.”  The narrator said: I asked; What about the Tashahud? He replied: I did not hear  thing about the tashahhud, but it is more liking to me that one should recite the tashahhud. This version has not the words “whom he called the possessor of arms(Dhu al-yadain).” Nor the words “they made a sign,” nor the word “anger”. The tradition narrated by Hammad from Ayyub is more perfect.",
      "chain": [
        "30175",
        "20212",
        "11593",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "1105",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا بشر، - يعني ابن المفضل - حدثنا عبد الرحمن، - يعني ابن إسحاق - عن عبد الرحمن بن معاوية، عن ابن أبي ذباب، عن سهل بن سعد، قال ما رأيت رسول الله صلى الله عليه وسلم شاهرا يديه قط يدعو على منبره ولا على غيره ولكن رأيته يقول هكذا وأشار بالسبابة وعقد الوسطى بالإبهام ‏.‏",
      "text_en": " Narrated Sahl ibn Sa'd:                     I never saw the Messenger of Allah (ﷺ) raising his hands and praying on the pulpit or otherwise. But I saw him saying (doing) this way, and he would point with his forefinger making a circle by joining the middle finger with his thumb.",
      "chain": [
        "30175",
        "20212",
        "11876",
        "399"
      ]
    },
    {
      "hadith_no": "1195",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، حدثنا الجريري، عن حيان بن عمير، عن عبد الرحمن بن سمرة، قال بينما أنا أترمى، بأسهم في حياة رسول الله صلى الله عليه وسلم إذ كسفت الشمس فنبذتهن وقلت لأنظرن ما أحدث لرسول الله صلى الله عليه وسلم في كسوف الشمس اليوم فانتهيت إليه وهو رافع يديه يسبح ويحمد ويهلل ويدعو حتى حسر عن الشمس فقرأ بسورتين وركع ركعتين ‏.‏",
      "text_en": " Narrated 'Abd al-Rahman b. Samurah :                     During the lifetime of the Messenger of Allah (peace be upon him) I was shooting some arrows when an eclipse of the sun tok place.  I, therefore , threw them (the arrows) away and said: I must see how the Messenger of Allah (ﷺ) acts in a solar eclipse today.  So I came to him; he was standing (in prayer) raising his hands, glorifying Allah, praising Him, acknowledging that He is the only Deity, and making supplication till the sun was clear.  He then recited two surahs and prayed two rak'ahs.",
      "chain": [
        "30175",
        "20212",
        "11286",
        "10679",
        "955"
      ]
    },
    {
      "hadith_no": "1613",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا مسدد، أن يحيى بن سعيد، وبشر بن المفضل، حدثاهم عن عبيد الله، ح وحدثنا موسى بن إسماعيل، حدثنا أبان، عن عبيد الله، عن نافع، عن عبد الله، عن النبي صلى الله عليه وسلم أنه فرض صدقة الفطر صاعا من شعير أو تمر على الصغير والكبير والحر والمملوك زاد موسى والذكر والأنثى ‏.‏ قال أبو داود قال فيه أيوب وعبد الله - يعني العمري - في حديثهما عن نافع ذكر أو أنثى ‏.‏ أيضا ‏.‏",
      "text_en": " Ibn ‘Umar said :                      The Messenger of Allah(ﷺ) prescribed sadaqah at the end of Ramadan one sa’ of barley and dried dates, payable by young and old freeman and slave. The version of Musa adds : “ male and female”.Abu Dawud said : the words “male and female” narrated, by Ayyub  and ‘Abd Allah al Umar were narrated in their version on the authority of Nafi’.",
      "chain": [
        "30175",
        "20031",
        "20212",
        "11201",
        "20040",
        "20205",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1759",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، حدثنا ابن عون، عن القاسم بن محمد، وعن إبراهيم، - زعم أنه سمعه منهما، جميعا ولم يحفظ حديث هذا من حديث هذا ولا حديث هذا من حديث هذا - قالا قالت أم المؤمنين بعث رسول الله صلى الله عليه وسلم بالهدى فأنا فتلت قلائدها بيدي من عهن كان عندنا ثم أصبح فينا حلالا يأتي ما يأتي الرجل من أهله ‏.‏",
      "text_en": " Ai’shah said:                      The Messenger of Allah (SWAS) sent sacrificial camels as offering (to the Ka’bah) and I twisted with my own hands their garlands of coloured wool that we had with us.  Next morning he came free from restrictions, having intercourse (with his wife) as a man not wearing Ihram does with his wife.",
      "chain": [
        "30175",
        "20212",
        "11071",
        "10535"
      ]
    },
    {
      "hadith_no": "2174",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا مسدد، حدثنا بشر، حدثنا الجريري، ح وحدثنا مؤمل، حدثنا إسماعيل، ح وحدثنا موسى، حدثنا حماد، كلهم عن الجريري، عن أبي نضرة، حدثني شيخ، من طفاوة قال تثويت أبا هريرة بالمدينة فلم أر رجلا من أصحاب النبي صلى الله عليه وسلم أشد تشميرا ولا أقوم على ضيف منه فبينما أنا عنده يوما وهو على سرير له ومعه كيس فيه حصى أو نوى - وأسفل منه جارية له سوداء - وهو يسبح بها حتى إذا أنفد ما في الكيس ألقاه إليها فجمعته فأعادته في الكيس فدفعته إليه فقال ألا أحدثك عني وعن رسول الله صلى الله عليه وسلم قال قلت بلى ‏.‏ قال بينا أنا أوعك في المسجد إذ جاء رسول الله صلى الله عليه وسلم حتى دخل المسجد ‏.‏ فقال ‏\"‏ من أحس الفتى الدوسي ‏\"‏ ‏.‏ ثلاث مرات ‏.‏ فقال رجل يا رسول الله هو ذا يوعك في جانب المسجد فأقبل يمشي حتى انتهى إلى فوضع يده على فقال لي معروفا فنهضت فانطلق يمشي حتى أتى مقامه الذي يصلي فيه فأقبل عليهم ومعه صفان من رجال وصف من نساء أو صفان من نساء وصف من رجال فقال ‏\"‏ إن أنساني الشيطان شيئا من صلاتي فليسبح القوم وليصفق النساء ‏\"‏ ‏.‏ قال فصلى رسول الله صلى الله عليه وسلم ولم ينس من صلاته شيئا ‏.‏ فقال ‏\"‏ مجالسكم مجالسكم ‏\"‏ ‏.‏ زاد موسى ‏\"‏ ها هنا ‏\"‏ ‏.‏ ثم حمد الله تعالى وأثنى عليه ثم قال ‏\"‏ أما بعد ‏\"‏ ‏.‏ ثم اتفقوا ثم أقبل على الرجال فقال ‏\"‏ هل منكم الرجل إذا أتى أهله فأغلق عليه بابه وألقى عليه ستره واستتر بستر الله ‏\"‏ ‏.‏ قالوا نعم ‏.‏ قال ‏\"‏ ثم يجلس بعد ذلك فيقول فعلت كذا فعلت كذا ‏\"‏ ‏.‏ قال فسكتوا قال فأقبل على النساء فقال ‏\"‏ هل منكن من تحدث ‏\"‏ ‏.‏ فسكتن فجثت فتاة - قال مؤمل في حديثه فتاة كعاب - على إحدى ركبتيها وتطاولت لرسول الله صلى الله عليه وسلم ليراها ويسمع كلامها فقالت يا رسول الله إنهم ليتحدثون وإنهن ليتحدثنه فقال ‏\"‏ هل تدرون ما مثل ذلك ‏\"‏ ‏.‏ فقال ‏\"‏ إنما ذلك مثل شيطانة لقيت شيطانا في السكة فقضى منها حاجته والناس ينظرون إليه ألا وإن طيب الرجال ما ظهر ريحه ولم يظهر لونه ألا إن طيب النساء ما ظهر لونه ولم يظهر ريحه ‏\"‏ ‏.‏ قال أبو داود من ها هنا حفظته عن مؤمل وموسى ‏\"‏ ألا لا يفضين رجل إلى رجل ولا امرأة إلى امرأة إلا إلى ولد أو والد ‏\"‏ ‏.‏ وذكر ثالثة فأنسيتها وهو في حديث مسدد ولكني لم أتقنه كما أحب وقال موسى حدثنا حماد عن الجريري عن أبي نضرة عن الطفاوي ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     AbuNadrah reported: An old man of Tufawah said to me: I was a guest of AbuHurayrah at Medina. I did not find any one of the companions of the Prophet (ﷺ) more devoted to worship and more hospitable than AbuHurayrah.  One day I was with him when he was sitting on his bed. He had a purse which contained pebbles or kernels. A black slave-girl of his was sitting below. Counting them he was glorifying Allah. When the pebbles or the kernels in the purse were finished, she gathered them and put them again in the purse, and gave it to him. He said: Should I not tell you about me and about the Messenger of Allah (ﷺ)?  I said: Yes.  He said: Once when I was laid up with fever in the mosque, the Messenger of Allah (ﷺ) came and entered the mosque, and said: Who saw the youth of ad-Daws. He said this three times.  A man said: Messenger of Allah, there he is, laid up with fever on one side of the mosque. He moved, walking forward till he reached me. He placed his hand on me. He had a kind talk with me, and I rose. He then began to walk till he reached the place where he used to offer his prayer. He paid his attention to the people. There were two rows of men and one row of women, or two rows of women and one row of men (the narrator is doubtful).  He then said: If Satan makes me forget anything during the prayer, the men should glorify Allah, and the women should clap their hands. The Messenger of Allah (ﷺ) then prayed and he did not forget anything during the prayer.  He said: Be seated in your places, be seated in your places. The narrator, Musa, added the word \"here\". He then praised Allah and exalted Him, and said: Now to our topic.  The agreed version begins: He then said: Is there any man among you who approaches his wife, closes the door, covers himself with a curtain, and he is concealed with the curtain of Allah?  They replied: Yes.  He said: later he sits and says: I did so-and-so; I did so-and-so. The people kept silence. He then turned to the women and said (to them): Is there any woman among you who narrates it? They kept silence. Then a girl fell on one of her knees. The narrator, Mu'ammil, said in his version: a buxom girl. She raised her head before the Messenger of Allah (ﷺ) so that he could see her and listen to her.  She said: Messenger of Allah, they (the men) describe the secrets (of intercourse) and they (the women) also describe the secrets (of intercourse) to the people.  He said: Do you know what the similitude is? He said: The likeness of this act is the likeness of a female Satan who meets the male Satan on the roadside; he fulfils his desire with her while the people are looking at him. Beware! The perfume of men is that whose smell becomes visible and its colour does not appear. Beware! The perfume of women is that whose colour becomes visible and whose smell is not obvious.  AbuDawud said: From here I remembered this tradition from Mu'ammil and Musa: Beware! No man should lie with another man, no woman should lie with another woman except with one's child or father. He also mentioned a third which I have forgotten. This has been mentioned in the version of Musaddad, but I do not remember it as precisely as I like.  The narrator, Musa, said: Hammad narrated this tradition from al-Jarir from AbuNadrah from at-Tufawi.",
      "chain": [
        "30175",
        "20212",
        "11286",
        "30180",
        "20208",
        "20040",
        "20022",
        "11286",
        "10721"
      ]
    },
    {
      "hadith_no": "2581",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا يحيى بن خلف، حدثنا عبد الوهاب بن عبد المجيد، حدثنا عنبسة، ح وحدثنا مسدد، حدثنا بشر بن المفضل، عن حميد الطويل، جميعا عن الحسن، عن عمران بن حصين، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا جلب ولا جنب ‏\"‏ ‏.‏ زاد يحيى في حديثه ‏\"‏ في الرهان ‏\"‏ ‏.‏",
      "text_en": " Narrated Imran ibn Husayn:                     The Prophet (ﷺ) said: There must be no shouting or leading another horse at one's side. Yahya added in his tradition: When racing for a wager.",
      "chain": [
        "30460",
        "20259",
        "11716",
        "30175",
        "20212",
        "11279",
        "11016",
        "123"
      ]
    },
    {
      "hadith_no": "2648",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن هشام المصري، حدثنا بشر بن المفضل، حدثنا داود، عن أبي نضرة، عن أبي سعيد، قال نزلت في يوم بدر ‏{‏ ومن يولهم يومئذ دبره ‏}‏ ‏.‏",
      "text_en": " Abu Sa’id said “The verse “If any do turn his back to them on such a day” was revealed on the day of the Battle of Badr.”",
      "chain": [
        "20212",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "2710",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا مسدد، أن يحيى بن سعيد، وبشر بن المفضل، حدثاهم عن يحيى بن سعيد، عن محمد بن يحيى بن حبان، عن أبي عمرة، عن زيد بن خالد الجهني، أن رجلا، من أصحاب النبي صلى الله عليه وسلم توفي يوم خيبر فذكروا ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ صلوا على صاحبكم ‏\"‏ ‏.‏ فتغيرت وجوه الناس لذلك فقال ‏\"‏ إن صاحبكم غل في سبيل الله ‏\"‏ ‏.‏ ففتشنا متاعه فوجدنا خرزا من خرز يهود لا يساوي درهمين ‏.‏",
      "text_en": " Narrated Zayd ibn Khalid al-Juhani:                     A man from the Companions of the Prophet (ﷺ) died on the day of Khaybar. They mentioned the matter to the Messenger of Allah. He said: Offer prayer over your companion. When the faces of the people looked perplexed, he said: Your companion misappropriated booty in the path of Allah. We searched his belongings and found some Jewish beads not worth two dirhams.",
      "chain": [
        "30175",
        "20031",
        "20212",
        "11062",
        "11222",
        "3625"
      ]
    },
    {
      "hadith_no": "2730",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا بشر، - يعني ابن المفضل - عن محمد بن زيد، قال حدثني عمير، مولى آبي اللحم قال شهدت خيبر مع سادتي فكلموا في رسول الله صلى الله عليه وسلم فأمر بي فقلدت سيفا فإذا أنا أجره فأخبر أني مملوك فأمر لي بشىء من خرثي المتاع ‏.‏ قال أبو داود معناه أنه لم يسهم له ‏.‏ قال أبو داود وقال أبو عبيد كان حرم اللحم على نفسه فسمي آبي اللحم ‏.‏",
      "text_en": " Narrated Umayr, client of AbulLahm:                     I was present at Khaybar along with my masters who spoke about me to the Messenger of Allah (ﷺ). He ordered about me, and a sword was girded on me and I was trailing it. He was then informed that I was a slave. He, therefore, ordered that I should be given some inferior goods.Abu Dawud said: This means that he (the Prophet) did not allot a portion of the spoils.Abu Dawud said: Abu 'Ubaid said: As he (the narrator Abi al-Lahm) made eating meat unlawful on himself, he was called Abi al-Lahm (one who hates meat).",
      "chain": [
        "30007",
        "20212",
        "11217",
        "3141"
      ]
    },
    {
      "hadith_no": "2788",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا مسدد، حدثنا يزيد، ح وحدثنا حميد بن مسعدة، حدثنا بشر، عن عبد الله بن عون، عن عامر أبي رملة، قال أخبرنا مخنف بن سليم، قال ونحن وقوف مع رسول الله صلى الله عليه وسلم بعرفات قال ‏\"‏ يا أيها الناس إن على كل أهل بيت في كل عام أضحية وعتيرة أتدرون ما العتيرة هذه التي يقول الناس الرجبية ‏\"‏ ‏.‏ قال أبو داود العتيرة منسوخة هذا خبر منسوخ ‏.‏",
      "text_en": " Narrated Mikhnaf ibn Sulaym:                     We were staying with the Messenger of Allah (ﷺ) at Arafat; he said: O people, every family must offer a sacrifice and an atirah. Do you know what  the atirah is? It is what you call the Rajab sacrifice.Abu Dawud said: 'Atirah has been abrogated, and this tradition is an abrogated one.",
      "chain": [
        "30175",
        "20304",
        "30430",
        "20212",
        "11071",
        "5281"
      ]
    },
    {
      "hadith_no": "2830",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا مسدد، ح وحدثنا نصر بن علي، عن بشر بن المفضل، - المعنى - حدثنا خالد الحذاء، عن أبي قلابة، عن أبي المليح، قال قال نبيشة نادى رجل رسول الله صلى الله عليه وسلم إنا كنا نعتر عتيرة في الجاهلية في رجب فما تأمرنا قال ‏\"‏ اذبحوا لله في أى شهر كان وبروا الله عز وجل وأطعموا ‏\"‏ ‏.‏ قال إنا كنا نفرع فرعا في الجاهلية فما تأمرنا قال ‏\"‏ في كل سائمة فرع تغذوه ماشيتك حتى إذا استحمل ‏\"‏ ‏.‏ قال نصر ‏\"‏ استحمل للحجيج ذبحته فتصدقت بلحمه ‏\"‏ ‏.‏ قال خالد أحسبه قال ‏\"‏ على ابن السبيل فإن ذلك خير ‏\"‏ ‏.‏ قال خالد قلت لأبي قلابة كم السائمة قال مائة ‏.‏",
      "text_en": " Narrated Nubayshah:                     A man called the Messenger of Allah (ﷺ): We used to sacrifice Atirah in pre-Islamic days during Rajab; so what do you command us? He said: Sacrifice for the sake of Allah in any month whatever; obey Allah, Most High, and feed(the people). He said: We used to sacrifice a Fara' in pre-Islamic days, so what do you command us? He said: On every pasturing animal there is a Fara' which is fed by your cattle till it becomes strong and capable of carrying load.  The narrator Nasr said (in his version): When it becomes capable of carrying load of the pilgrims, you may slaughter it and give its meat as charity (sadaqah). The narrator Khalid's version says: You (may give it) to the travellers, for it is better. Khalid said: I asked AbuQilabah: How many pasturing animals? He replied: One hundred.",
      "chain": [
        "30175",
        "30395",
        "20212",
        "11282",
        "11047",
        "11453"
      ]
    },
    {
      "hadith_no": "2878",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wills (Kitab Al-Wasaya) - كتاب الوصايا",
      "chapter_no": "18",
      "text_ar": "حدثنا مسدد، حدثنا يزيد بن زريع، ح وحدثنا مسدد، حدثنا بشر بن المفضل، ح وحدثنا مسدد، حدثنا يحيى، عن ابن عون، عن نافع، عن ابن عمر، قال أصاب عمر أرضا بخيبر فأتى النبي صلى الله عليه وسلم فقال أصبت أرضا لم أصب مالا قط أنفس عندي منه فكيف تأمرني به قال ‏\"‏ إن شئت حبست أصلها وتصدقت بها ‏\"‏ ‏.‏ فتصدق بها عمر أنه لا يباع أصلها ولا يوهب ولا يورث للفقراء والقربى والرقاب وفي سبيل الله وابن السبيل - وزاد عن بشر - والضيف - ثم اتفقوا - لا جناح على من وليها أن يأكل منها بالمعروف ويطعم صديقا غير متمول فيه ‏.‏ زاد عن بشر قال وقال محمد غير متأثل مالا ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     'Umar got some land in Khaibar, and when to the Prophet (ﷺ) and said: I have acquired land in Khaibar which I consider to be more valuable than any I have acquired ; so what do you command me to do with it ? He replied: If you wish, you may make the property as inalienable possession, and give its produce as sadaqah (charity). So 'Umar gave it as a sadaqah declaring that the property must not be sold, given away, or inherited : (and gave its produce as sadaqah to be devoted) to poor, relatives, the emancipation of slaves, Allah's path,  travellers. The narrator Bishr added: \"and guests\". Then the agreed version goes: No sin being committed by the one who administers it if he eats something from it in a reasonable manner, or gives something to a friend, who does not make his own property. The narrator Bishr added: \"(provided) he is not storing-up goods (for himself)\".",
      "chain": [
        "30175",
        "20304",
        "30175",
        "20212",
        "30175",
        "20031",
        "11071",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2891",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، حدثنا عبد الله بن محمد بن عقيل، عن جابر بن عبد الله، قال خرجنا مع رسول الله صلى الله عليه وسلم حتى جئنا امرأة من الأنصار في الأسواق فجاءت المرأة بابنتين لها فقالت يا رسول الله هاتان بنتا ثابت بن قيس قتل معك يوم أحد وقد استفاء عمهما مالهما وميراثهما كله فلم يدع لهما مالا إلا أخذه فما ترى يا رسول الله فوالله لا تنكحان أبدا إلا ولهما مال ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ يقضي الله في ذلك ‏\"‏ ‏.‏ قال ونزلت سورة النساء ‏{‏ يوصيكم الله في أولادكم ‏}‏ الآية ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ادعوا لي المرأة وصاحبها ‏\"‏ ‏.‏ فقال لعمهما ‏\"‏ أعطهما الثلثين وأعط أمهما الثمن وما بقي فلك ‏\"‏ ‏.‏ قال أبو داود أخطأ بشر فيه إنما هما ابنتا سعد بن الربيع وثابت بن قيس قتل يوم اليمامة ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     We went out with the Messenger of Allah (ﷺ) and came to a woman of the Ansar in al-Aswaf. The woman brought her two daughters, and said: Messenger of Allah, these are the daughters of Thabit ibn Qays who was killed as a martyr when he was with you at the battle of Uhud, their paternal uncle has taken all their property and inheritance, and he has not left anything for them. What do you think, Messenger of Allah? They cannot be married unless they have some property. The Messenger of Allah (ﷺ) said: Allah will decide regarding the matter. Then the verse of Surat an-Nisa was revealed: \"Allah (thus) directs you as regards your children's (inheritance).\" Messenger of Allah (ﷺ) said: Call to me the woman and her husband's brother. He then said to their paternal uncle: Give them two-thirds and their mother an eighth, and what remains is yours.Abu Dawud said: The narrator Bishr made a mistake. They were the daughters of Sa'd b. al-Rabi' for Thabit b. Qais was killed in the battle of Yamamah.",
      "chain": [
        "30175",
        "20212",
        "12246",
        "34"
      ]
    },
    {
      "hadith_no": "2934",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، حدثنا غالب القطان، عن رجل، عن أبيه، عن جده، أنهم كانوا على منهل من المناهل فلما بلغهم الإسلام جعل صاحب الماء لقومه مائة من الإبل على أن يسلموا فأسلموا وقسم الإبل بينهم وبدا له أن يرتجعها منهم فأرسل ابنه إلى النبي صلى الله عليه وسلم فقال له ائت النبي صلى الله عليه وسلم فقل له إن أبي يقرئك السلام وإنه جعل لقومه مائة من الإبل على أن يسلموا فأسلموا وقسم الإبل بينهم وبدا له أن يرتجعها منهم أفهو أحق بها أم هم فإن قال لك نعم أو لا فقل له إن أبي شيخ كبير وهو عريف الماء وإنه يسألك أن تجعل لي العرافة بعده ‏.‏ فأتاه فقال إن أبي يقرئك السلام ‏.‏ فقال ‏\"‏ وعليك وعلى أبيك السلام ‏\"‏ ‏.‏ فقال إن أبي جعل لقومه مائة من الإبل على أن يسلموا فأسلموا وحسن إسلامهم ثم بدا له أن يرتجعها منهم أفهو أحق بها أم هم فقال ‏\"‏ إن بدا له أن يسلمها لهم فليسلمها وإن بدا له أن يرتجعها فهو أحق بها منهم فإن هم أسلموا فلهم إسلامهم وإن لم يسلموا قوتلوا على الإسلام ‏\"‏ ‏.‏ فقال إن أبي شيخ كبير وهو عريف الماء وإنه يسألك أن تجعل لي العرافة بعده ‏.‏ فقال ‏\"‏ إن العرافة حق ولا بد للناس من العرفاء ولكن العرفاء في النار ‏\"‏ ‏.‏",
      "text_en": " Narrated Ghalib al-Qattan:                     Ghalib quoted a man who stated on the authority of his father that his grandfather reported: They lived at one of the springs. When Islam reached them, the master of the spring offered his people one hundred camels if they embraced Islam. So they embraced Islam, and he distributed the camels among them. But it occurred to him that he should take the camels back from them.  He sent his son to the Prophet (ﷺ) and said to him: Go to the Prophet (ﷺ) and tell him: My father extends his greetings to you. He asked his people to give them one hundred camels if they embraced Islam, and they embraced Islam. He divided the camels among them. But it occurred to him then that he should withdraw his camels from them. Is he more entitled to them or we? If he says: Yes or no, then tell him: My father is an old man, and he is the chief of the people living at the water. He has requested you to make me chief after him.  He came to him and said: My father has extended his greetings to you.  He replied: On you and you father be peace.  He said: My father asked his people to give them one hundred camels if they embraced Islam. So they embraced Islam, and their belief in Islam is good. Then it occurred to him that he should take his camels back from them. Is he more entitled to them or are they?  He said: If he likes to give them the camels, he may give them; and if he likes to take them back, he is more entitled to them than his people. If they embraced Islam, then for them is their Islam. If they do not embrace Islam, they will be fought against in the cause of Islam.  He said: My father is an old man; he is the chief of the people living at the spring. He has asked you to appoint me chief after him.  He replied: The office of a chief is necessary, for people must have chiefs, but the chiefs will go to Hell.",
      "chain": [
        "30175",
        "20212",
        "11299"
      ]
    },
    {
      "hadith_no": "3117",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا مسدد، حدثنا بشر، حدثنا عمارة بن غزية، حدثنا يحيى بن عمارة، قال سمعت أبا سعيد الخدري، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لقنوا موتاكم قول لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Sa’id Al Khudri :                     The Messenger of Allah (ﷺ) as saying: Recite to those of you who are dying \"There is no god but Allah.\"",
      "chain": [
        "30175",
        "20212",
        "11894",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "3488",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا مسدد، أن بشر بن المفضل، وخالد بن عبد الله، حدثاهم - المعنى، - عن خالد الحذاء، عن بركة، قال مسدد في حديث خالد بن عبد الله عن بركة أبي الوليد، ثم اتفقا - عن ابن عباس، قال رأيت رسول الله صلى الله عليه وسلم جالسا عند الركن - قال - فرفع بصره إلى السماء فضحك فقال ‏\"‏ لعن الله اليهود ‏\"‏ ‏.‏ ثلاثا ‏\"‏ إن الله حرم عليهم الشحوم فباعوها وأكلوا أثمانها وإن الله إذا حرم على قوم أكل شىء حرم عليهم ثمنه ‏\"‏ ‏.‏ ولم يقل في حديث خالد بن عبد الله الطحان ‏\"‏ رأيت ‏\"‏ ‏.‏ وقال ‏\"‏ قاتل الله اليهود ‏\"‏ ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     I saw the Messenger of Allah (ﷺ) sitting neat the Black stone (or at a corner of the Ka'bah). He said: He (the Prophet) raised his eyes towards the heaven, and laughed, and he said: May Allah curse the Jews! He said this three times. Allah declared unlawful for them the fats (of the animals which died a natural death); they sold them and they enjoyed the price they received for them. When Allah declared eating of thing forbidden for the people, He declares it price also forbidden for them. The version of Khalid b. 'Abd Allah al-Tahhan does not have the words \"I saw\". It has: \"May Allah destroy the Jews!\"",
      "chain": [
        "30175",
        "20212",
        "11282",
        "17"
      ]
    },
    {
      "hadith_no": "3844",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا بشر، - يعني ابن المفضل - عن ابن عجلان، عن سعيد المقبري، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا وقع الذباب في إناء أحدكم فامقلوه فإن في أحد جناحيه داء وفي الآخر شفاء وإنه يتقي بجناحه الذي فيه الداء فليغمسه كله ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      when a fly alights in anyone’s vessel, he should plunge it all in, for in one of its wings there is a disease, and in the other is a cure. It prevents the wing of it is which there is a cure, so plunge it all in (the vessel).",
      "chain": [
        "30007",
        "20212",
        "10616",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "4225",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Signet-Rings (Kitab Al-Khatam) - كتاب الخاتم",
      "chapter_no": "36",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، حدثنا عاصم بن كليب، عن أبي بردة، عن علي، - رضى الله عنه - قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ قل اللهم اهدني وسددني واذكر بالهداية هداية الطريق واذكر بالسداد تسديدك السهم ‏\"‏ ‏.‏ قال ونهاني أن أضع الخاتم في هذه أو في هذه للسبابة والوسطى - شك عاصم - ونهاني عن القسية والميثرة ‏.‏ قال أبو بردة فقلنا لعلي ما القسية قال ثياب تأتينا من الشام أو من مصر مضلعة فيها أمثال الأترج قال والميثرة شىء كانت تصنعه النساء لبعولتهن ‏.‏",
      "text_en": " Narrated Ali:                     The Messenger of Allah (ﷺ) said to me: Say: O Allah, guide me, and set me right. Remember by guidance (hidayah) the showing of the straight path, and remember by setting right (sadad) the setting right of an arrow. Then pointing to the middle finger and the one next to it, he said: He forbade me to wear a signet-ring on this finger of mine or on this (Asim was doubtful). He forbade me to wear qassiyyah (qasi garments) and mitharah. Abu Burdah said: We asked 'Ali: What is qasiyyah ? He said: These are garments imported to us from Syria or Egypt. They are stripped and marked like citrons. And mitharah was a thing made by women for their husbands.",
      "chain": [
        "30175",
        "20212",
        "10778",
        "11901",
        "5"
      ]
    },
    {
      "hadith_no": "4806",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا بشر، - يعني ابن المفضل - حدثنا أبو مسلمة، سعيد بن يزيد عن أبي نضرة، عن مطرف، قال قال أبي انطلقت في وفد بني عامر إلى رسول الله صلى الله عليه وسلم فقلنا أنت سيدنا ‏.‏ فقال ‏\"‏ السيد الله تبارك وتعالى ‏\"‏ ‏.‏ قلنا وأفضلنا فضلا وأعظمنا طولا ‏.‏ فقال ‏\"‏ قولوا بقولكم أو بعض قولكم ولا يستجرينكم الشيطان ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn ash-Shikhkhir:                     I went with a deputation of Banu Amir to the apostle of Allah (ﷺ), and we said: You are our lord (sayyid). To this he replied: The lord is Allah, the Blessed and Exalted. Then we said: And the one of us most endowed with excellence and superiority. To this he replied: Say what you have to say, or part of what you have to say, and do not let the devil make you his agents.",
      "chain": [
        "30175",
        "20212",
        "11288",
        "10721",
        "11395"
      ]
    },
    {
      "hadith_no": "4813",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا بشر، حدثنا عمارة بن غزية، قال حدثني رجل، من قومي عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أعطي عطاء فوجد فليجز به فإن لم يجد فليثن به فمن أثنى به فقد شكره ومن كتمه فقد كفره ‏\"‏ ‏.‏ قال أبو داود رواه يحيى بن أيوب عن عمارة بن غزية عن شرحبيل عن جابر ‏.‏ قال أبو داود وهو شرحبيل يعني رجلا من قومي كأنهم كرهوه فلم يسموه ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Prophet (ﷺ) said: If someone is given something, he should give a return for it provided he can afford; if he cannot afford, he should praise him. He who praises him for it, thanks him, and he who conceals it is ungrateful to him.Abu Dawud said: It has been transmitted by Yahya b. Ayyub, from 'Umarah b. Ghaziyyah, from Sharahbil on the authority of JabirAbu Dawud said: In the chain of this tradition 'Umarah b. Ghaziyyah said: A man from my tribe said. The man referred by him is in Sharahbil. It is likely that they disliked him and, therefore, they did not blame him.",
      "chain": [
        "30175",
        "20212",
        "11894",
        "34"
      ]
    },
    {
      "hadith_no": "4816",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا بشر، - يعني ابن المفضل - حدثنا عبد الرحمن بن إسحاق، عن سعيد المقبري، عن أبي هريرة، عن النبي صلى الله عليه وسلم في هذه القصة قال ‏\"‏ وإرشاد السبيل ‏\"‏ ‏.‏",
      "text_en": " ABU HURAIRAH REPORTED THE PROPHET(MAY PEACE BE UPON HIM) AS SAYING ON THE SAME OCCASION:                      AND GUIDING THE PEOPLE ON THEIR WAY.",
      "chain": [
        "30175",
        "20212",
        "11876",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "4922",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا بشر، عن خالد بن ذكوان، عن الربيع بنت معوذ بن عفراء، قالت جاء رسول الله صلى الله عليه وسلم فدخل على صبيحة بني بي فجلس على فراشي كمجلسك مني فجعلت جويريات يضربن بدف لهن ويندبن من قتل من آبائي يوم بدر إلى أن قالت إحداهن وفينا نبي يعلم ما في غد ‏.‏ فقال ‏\"‏ دعي هذه وقولي الذي كنت تقولين ‏\"‏ ‏.‏",
      "text_en": " Al-Ruhayyi’, daughter of Mu’awwidh b. ‘Afra’, said :                      The Messenger of Allah (May peace be upon him) came and visited me in the morning when I had been conducted to my husband, and sat on my bedding as you are sitting beside me. Some little girls of ours began to play the tambourine and eulogise those of my ancestors who were killed in the battle of Badr, and then one of them said: And among us is a Prophet who knows what will happen tomorrow. He said : Stop this and say what you were saying.",
      "chain": [
        "30175",
        "20212",
        "11158",
        "617"
      ]
    },
    {
      "hadith_no": "4954",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا بشر، - يعني ابن المفضل - قال حدثني بشير بن ميمون، عن عمه، أسامة بن أخدري أن رجلا، يقال له أصرم كان في النفر الذين أتوا رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما اسمك ‏\"‏ ‏.‏ قال أنا أصرم ‏.‏ قال ‏\"‏ بل أنت زرعة ‏\"‏ ‏.‏",
      "text_en": " Narrated Usamah ibn Akhdari:                     A man called Asram was among those who came to the Messenger of Allah (ﷺ). The Messenger of Allah (ﷺ) said: What is your name? He replied: Asram. He said: No, you are Zur'ah.",
      "chain": [
        "30175",
        "20212",
        "23009"
      ]
    },
    {
      "hadith_no": "5187",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا بشر، عن شعبة، عن محمد بن المنكدر، عن جابر، أنه ذهب إلى النبي صلى الله عليه وسلم في دين أبيه فدققت الباب فقال ‏\"‏ من هذا ‏\"‏ ‏.‏ قلت أنا ‏.‏ قال ‏\"‏ أنا أنا ‏\"‏ ‏.‏ كأنه كرهه ‏.‏",
      "text_en": " Jabir said that he went to the prophet (ﷺ) about the debt of my father. He said :                      I knocked at the door. He asked : who is there? I replied: it is I. he said: I, as though he disapproved of it.",
      "chain": [
        "30175",
        "20212",
        "20020",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "25",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا نصر بن علي الجهضمي، وبشر بن معاذ العقدي، قالا حدثنا بشر بن المفضل، عن عبد الرحمن بن حرملة، عن أبي ثفال المري، عن رباح بن عبد الرحمن بن أبي سفيان بن حويطب، عن جدته، عن أبيها، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا وضوء لمن لم يذكر اسم الله عليه ‏\"‏ ‏.‏ قال وفي الباب عن عائشة وأبي سعيد وأبي هريرة وسهل بن سعد وأنس ‏.‏ قال أبو عيسى قال أحمد بن حنبل لا أعلم في هذا الباب حديثا له إسناد جيد ‏.‏ وقال إسحاق إن ترك التسمية عامدا أعاد الوضوء وإن كان ناسيا أو متأولا أجزأه ‏.‏ قال محمد بن إسماعيل أحسن شيء في هذا الباب حديث رباح بن عبد الرحمن ‏.‏ قال أبو عيسى ورباح بن عبد الرحمن عن جدته عن أبيها ‏.‏ وأبوها سعيد بن زيد بن عمرو بن نفيل ‏.‏ وأبو ثفال المري اسمه ثمامة بن حصين ‏.‏ ورباح بن عبد الرحمن هو أبو بكر بن حويطب ‏.‏ منهم من روى هذا الحديث فقال عن أبي بكر بن حويطب فنسبه إلى جده ‏.‏",
      "text_en": " Rabah bin Abdur-Rahman bin Abi Sufyan bin Huwaitib narrated from his grandmother, from her father; she said (that he said):                     \"I heard Allah's Messenger saying: there is no Wudu for one who does not mention Allah's Name over it.\"",
      "chain": [
        "30395",
        "34041",
        "20212",
        "11878",
        "18108",
        "12091"
      ]
    },
    {
      "hadith_no": "33",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بشر بن المفضل، عن عبد الله بن محمد بن عقيل، عن الربيع بنت معوذ بن عفراء، أن النبي صلى الله عليه وسلم مسح برأسه مرتين بدأ بمؤخر رأسه ثم بمقدمه وبأذنيه كلتيهما ظهورهما وبطونهما ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن وحديث عبد الله بن زيد أصح من هذا وأجود إسنادا ‏.‏ وقد ذهب بعض أهل الكوفة إلى هذا الحديث منهم وكيع بن الجراح ‏.‏",
      "text_en": " Ar-Rubay' bint Mu'awwidh bin Afra' narrated:                     \"The Prophet wiped his head two times: He began with the rear of his head, then with the front of his head and with both of his ears, outside and Inside of them.\"",
      "chain": [
        "30367",
        "20212",
        "12246",
        "617"
      ]
    },
    {
      "hadith_no": "102",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بشر بن المفضل، عن عبد الرحمن بن إسحاق، هو القرشي عن أبي عبيدة بن محمد بن عمار بن ياسر، قال سألت جابر بن عبد الله عن المسح، على الخفين فقال السنة يا ابن أخي ‏.‏ قال وسألته عن المسح، على العمامة فقال أمس الشعر الماء ‏.‏",
      "text_en": " Abu Ubaidah bin Muttammad bin Ammar bin Yasir said:                     \"I asked Jabir bin Abdullah about wiping over the Khuff. He said, 'O my nephew! It is the Sunnah.'\" [He said:] \"And I asked him about wiping over the lmamah. He said, '[Wipe1 the hair [with water].'\"",
      "chain": [
        "30367",
        "20212",
        "11876",
        "19954",
        "34"
      ]
    },
    {
      "hadith_no": "436",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف حدثنا بشر بن المفضل، عن خالد الحذاء، عن عبد الله بن شقيق، قال سألت عائشة عن صلاة، رسول الله صلى الله عليه وسلم فقالت كان يصلي قبل الظهر ركعتين وبعدها ركعتين وبعد المغرب ثنتين وبعد العشاء ركعتين وقبل الفجر ثنتين ‏.‏ قال وفي الباب عن علي وابن عمر ‏.‏ قال أبو عيسى حديث عبد الله بن شقيق عن عائشة حديث حسن صحيح ‏.‏",
      "text_en": " Abdullah bin Shaqiq said:                     \"I asked Aishah about the Salat of Allah's Messenger (S). She said: 'He would pray four Rak'ah before Az-Zuhr and two Rak'ah after it, and two after Al-Maghrib, and two Rak'ah after Al-Isha, and two before Al-Fajr.\"",
      "chain": [
        "20212",
        "11282",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "601",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف حدثنا بشر بن المفضل، عن برد بن سنان، عن الزهري، عن عروة، عن عائشة، قالت جئت ورسول الله صلى الله عليه وسلم يصلي في البيت والباب عليه مغلق فمشى حتى فتح لي ثم رجع إلى مكانه ‏.‏ ووصفت الباب في القبلة ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Urwah narrated that Aishah said:                     \"I came while the Messenger of Allah was praying in the house and the door was closed. So he walked until he opened the door for me, then he returned to his place.\" And she described the door to be in the direction of the Qiblah.",
      "chain": [
        "20212",
        "19839",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "692",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف البصري حدثنا بشر بن المفضل، عن خالد الحذاء، عن عبد الرحمن بن أبي بكرة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ شهرا عيد لا ينقصان رمضان وذو الحجة ‏\"‏ ‏.‏ قال أبو عيسى حديث أبي بكرة حديث حسن ‏.‏ وقد روي هذا الحديث عن عبد الرحمن بن أبي بكرة عن النبي صلى الله عليه وسلم مرسلا ‏.‏ قال أحمد معنى هذا الحديث ‏\"‏ شهرا عيد لا ينقصان ‏\"‏ ‏.‏ يقول لا ينقصان معا في سنة واحدة شهر رمضان وذو الحجة إن نقص أحدهما تم الآخر ‏.‏ وقال إسحاق معناه ‏\"‏ لا ينقصان ‏\"‏ يقول وإن كان تسعا وعشرين فهو تمام غير نقصان ‏.‏ وعلى مذهب إسحاق يكون ينقص الشهران معا في سنة واحدة ‏.‏",
      "text_en": " Abdur-Rahman bin Abi Bakrah narrated from his father that :                     the Messenger of Allah said: \"The two months of Eid will not both be deficient: Ramadn and Dhul-Hijjah.\"",
      "chain": [
        "30460",
        "20212",
        "11282",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "712",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا بشر بن المفضل، عن سعيد بن يزيد أبي مسلمة، عن أبي نضرة، عن أبي سعيد الخدري، قال كنا نسافر مع رسول الله صلى الله عليه وسلم في رمضان فما يعيب على الصائم صومه ولا على المفطر إفطاره ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Sa'eed (Al-Khudri) narrated:                     \"We were on a journey with the Messenger of Allah during the month of Ramadan. No one objected to the fast of the one fasting nor the fast breaking of the one who broke his fast.\"",
      "chain": [
        "30395",
        "20212",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "778",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا نصر بن علي، حدثنا بشر بن المفضل، وخالد بن الحارث، عن سعيد بن أبي عروبة، عن قتادة، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تواصلوا ‏\"‏ ‏.‏ قالوا فإنك تواصل يا رسول الله ‏.‏ قال ‏\"‏ إني لست كأحدكم إن ربي يطعمني ويسقيني ‏\"‏ ‏.‏ قال وفي الباب عن علي وأبي هريرة وعائشة وابن عمر وجابر وأبي سعيد وبشير ابن الخصاصية ‏.‏ قال أبو عيسى حديث أنس حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم كرهوا الوصال في الصيام ‏.‏ وروي عن عبد الله بن الزبير أنه كان يواصل الأيام ولا يفطر ‏.‏",
      "text_en": " Anas narrated that :                     the Messenger of Allah said: \"Do not perform Wisal\" They said: \"But you perform Wisal O Messenger of Allah.\" He said: \"I am not like you are, indeed my Lord feeds me and gives me to drink.\"",
      "chain": [
        "30395",
        "20212",
        "20226",
        "11073",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "976",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف البصري حدثنا بشر بن المفضل، عن عمارة بن غزية، عن يحيى بن عمارة، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ لقنوا موتاكم لا إله إلا الله ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وأم سلمة وعائشة وجابر وسعدى المرية وهي امرأة طلحة بن عبيد الله ‏.‏ قال أبو عيسى حديث أبي سعيد حديث حسن غريب صحيح ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated that:                     The Prophet said: \"Instruct your dying to say: (La illaha illallah) 'None has the right to be worshipped but Allah'",
      "chain": [
        "30460",
        "20212",
        "11894",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "994",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا قتيبة، حدثنا بشر بن المفضل، عن عبد الله بن عثمان بن خثيم، عن سعيد بن جبير، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ البسوا من ثيابكم البياض فإنها من خير ثيابكم وكفنوا فيها موتاكم ‏\"‏ ‏.‏ وفي الباب عن سمرة وابن عمر وعائشة ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح ‏.‏ وهو الذي يستحبه أهل العلم ‏.‏ وقال ابن المبارك أحب إلى أن يكفن في ثيابه التي كان يصلي فيها ‏.‏ وقال أحمد وإسحاق أحب الثياب إلينا أن يكفن فيها البياض ويستحب حسن الكفن ‏.‏",
      "text_en": " Ibn Abbas narrated that:                     The Messenger of Allah said: \"Wear the white among your garments, for indeed they are among the best of your garments, and shroud your dead in them.\"",
      "chain": [
        "30367",
        "20212",
        "10644",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1039",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف وحميد بن مسعدة قالا حدثنا بشر بن المفضل، حدثنا يونس بن عبيد، عن محمد بن سيرين، عن أبي المهلب، عن عمران بن حصين، قال قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ إن أخاكم النجاشي قد مات فقوموا فصلوا عليه ‏\"‏ ‏.‏ قال فقمنا فصففنا كما يصف على الميت وصلينا عليه كما يصلى على الميت ‏.‏ وفي الباب عن أبي هريرة وجابر بن عبد الله وأبي سعيد وحذيفة بن أسيد وجرير بن عبد الله ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏ وقد رواه أبو قلابة عن عمه أبي المهلب عن عمران بن حصين ‏.‏ وأبو المهلب اسمه عبد الرحمن بن عمرو ويقال معاوية بن عمرو ‏.‏",
      "text_en": " Imran bin Husain narrated that :                     the Prophet said: \"Indeed your brother An-Najashi has died. So stand to perform Salat for him.\" He (Imran) said: \"We stood and lined up just as the deceased is lined up for, and we prayed for him just as the deceased is prayed for.\"",
      "chain": [
        "20212",
        "11075",
        "11035",
        "123"
      ]
    },
    {
      "hadith_no": "1071",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف حدثنا بشر بن المفضل، عن عبد الرحمن بن إسحاق، عن سعيد بن أبي سعيد المقبري، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا قبر الميت - أو قال أحدكم أتاه ملكان أسودان أزرقان يقال لأحدهما المنكر والآخر النكير فيقولان ما كنت تقول في هذا الرجل فيقول ما كان يقول هو عبد الله ورسوله أشهد أن لا إله إلا الله وأن محمدا عبده ورسوله ‏.‏ فيقولان قد كنا نعلم أنك تقول هذا ‏.‏ ثم يفسح له في قبره سبعون ذراعا في سبعين ثم ينور له فيه ثم يقال له نم ‏.‏ فيقول أرجع إلى أهلي فأخبرهم فيقولان نم كنومة العروس الذي لا يوقظه إلا أحب أهله إليه ‏.‏ حتى يبعثه الله من مضجعه ذلك ‏.‏ وإن كان منافقا قال سمعت الناس يقولون فقلت مثله لا أدري ‏.‏ فيقولان قد كنا نعلم أنك تقول ذلك ‏.‏ فيقال للأرض التئمي عليه ‏.‏ فتلتئم عليه ‏.‏ فتختلف فيها أضلاعه فلا يزال فيها معذبا حتى يبعثه الله من مضجعه ذلك ‏\"‏ ‏.‏ وفي الباب عن علي وزيد بن ثابت وابن عباس والبراء بن عازب وأبي أيوب وأنس وجابر وعائشة وأبي سعيد كلهم رووا عن النبي صلى الله عليه وسلم في عذاب القبر ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن غريب ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     The Messenger of Allah said: \"When the deceased - or he said when one of you - is buried, two angels, black and blue (eyed_ come to him. One of them is called Al-Munkar, and the other An-Nakir. They say: 'What did you used to say about this man?' So he says what he was saying (before death) 'He is Allah's slave and His Messenger. I testify that none has the right to be worshipped but Allah and that Muhammad is His slave and His Messenger.' So they say: 'We knew that you would say this.' Then his grave is expanded to seventy by seventy cubits, then it is illuminated for him. Then it is said to him: 'Sleep.' So he said: 'Can I return to my family to inform them?' They say: 'Sleep as a newlywed, whom none awakens but the dearest of his family.' Until Allah resurrects him from his resting place.\"\"If he was a hypocrite he would say: 'I heard people saying something, so I said the same; I do not know.' So they said: 'We knew you would say that.' So the earth is told: 'Constrict him.' So it constricts around him, squeezing his ribs together. He continues being punished like that until Allah resurrects him from his resting place.\"",
      "chain": [
        "20212",
        "11876",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "1090",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا حميد بن مسعدة البصري، حدثنا بشر بن المفضل، حدثنا خالد بن ذكوان، عن الربيع بنت معوذ، قالت جاء رسول الله صلى الله عليه وسلم فدخل على غداة بني بي فجلس على فراشي كمجلسك مني وجويريات لنا يضربن بدفوفهن ويندبن من قتل من آبائي يوم بدر إلى أن قالت إحداهن وفينا نبي يعلم ما في غد ‏.‏ فقال لها رسول الله صلى الله عليه وسلم ‏\"‏ اسكتي عن هذه وقولي الذي كنت تقولين قبلها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Ar-Rubai bint Muawwidh said:                     \"The morning after the consummation of my marriage, the Prophet came and sat on my bed as far from me as you are sitting now, and our little girls started beating the Duff and reciting verses mourning my father who had been killed in the battle of Badr. One of them said: 'Among us is a Prophet who knows what will happen tomorrow.' On that the Prophet said: 'Stop saying this, and keep on saying what you were saying before.'\"",
      "chain": [
        "30430",
        "20212",
        "11158",
        "617"
      ]
    },
    {
      "hadith_no": "1098",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف حدثنا بشر بن المفضل، عن إسماعيل بن أمية، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ائتوا الدعوة إذا دعيتم ‏\"‏ ‏.‏ قال وفي الباب عن علي وأبي هريرة والبراء وأنس وأبي أيوب ‏.‏ قال أبو عيسى حديث ابن عمر حديث حسن صحيح ‏.‏",
      "text_en": " Ibn Umar narrated that:                     The Messenger of Allah said: \"Accept the invitation when you are offered.\"",
      "chain": [
        "20212",
        "11417",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1123",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن عبد الملك بن أبي الشوارب، حدثنا بشر بن المفضل، حدثنا حميد، وهو الطويل قال حدث الحسن، عن عمران بن حصين، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا جلب ولا جنب ولا شغار في الإسلام ومن انتهب نهبة فليس منا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال وفي الباب عن أنس وأبي ريحانة وابن عمر وجابر ومعاوية وأبي هريرة ووائل بن حجر ‏.‏",
      "text_en": " Imran bin Husain narrated that :                     The Prophet said: \"There is no Jalab, no Janab, and no Shighar in Islam. And whoever takes some property by force, then he is not from us.\"",
      "chain": [
        "30450",
        "20212",
        "11279",
        "11016",
        "123"
      ]
    },
    {
      "hadith_no": "1139",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف حدثنا بشر بن المفضل، عن خالد الحذاء، عن أبي قلابة، عن أنس بن مالك، قال لو شئت أن أقول، قال رسول الله صلى الله عليه وسلم ولكنه قال السنة إذا تزوج الرجل البكر على امرأته أقام عندها سبعا وإذا تزوج الثيب على امرأته أقام عندها ثلاثا ‏.‏ قال وفي الباب عن أم سلمة ‏.‏ قال أبو عيسى حديث أنس حديث حسن صحيح ‏.‏ وقد رفعه محمد بن إسحاق عن أيوب عن أبي قلابة عن أنس ولم يرفعه بعضهم ‏.‏ قال والعمل على هذا عند بعض أهل العلم قالوا إذا تزوج الرجل امرأة بكرا على امرأته أقام عندها سبعا ثم قسم بينهما بعد بالعدل وإذا تزوج الثيب على امرأته أقام عندها ثلاثا ‏.‏ وهو قول مالك والشافعي وأحمد وإسحاق ‏.‏ وقال بعض أهل العلم من التابعين إذا تزوج البكر على امرأته أقام عندها ثلاثا وإذا تزوج الثيب أقام عندها ليلتين ‏.‏ والقول الأول أصح ‏.‏",
      "text_en": " Abu Qilabah narrated from Anas bin Malik, :                     He (Abu Qilabah) said: \"If I wish, I could say: 'The Messenger of Allah said'\" but he said: \"The Sunnah when a man married a virgin after he already has a wife, is that he stays with her seven (nights). And when he married a matron when he already has a wife, he stays with her three (nights).\"",
      "chain": [
        "20212",
        "11282",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "1210",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف حدثنا بشر بن المفضل، عن عبد الله بن عثمان بن خثيم، عن إسماعيل بن عبيد بن رفاعة، عن أبيه، عن جده، أنه خرج مع النبي صلى الله عليه وسلم إلى المصلى فرأى الناس يتبايعون فقال ‏\"‏ يا معشر التجار ‏\"‏ ‏.‏ فاستجابوا لرسول الله صلى الله عليه وسلم ورفعوا أعناقهم وأبصارهم إليه فقال ‏\"‏ إن التجار يبعثون يوم القيامة فجارا إلا من اتقى الله وبر وصدق ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ ويقال إسماعيل بن عبيد الله بن رفاعة أيضا ‏.‏",
      "text_en": " Narrated Isma'il bin 'Ubaid bin Rifa'ah:                     From his father, from his grandfather, that he went with the Messenger of Allah (ﷺ) to the Musalla, and he saw the people doing business so he said: 'O people of trade!' and they replied to the Messenger of Allah (ﷺ) turning their necks and their gazes towards him, and he said: Indeed the merchants will be resurrected on the Day of judgement with the wicked, except the one who has Taqwa of Allah, who behaves charitably and is truthful.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. And they also say Isma'il bin 'Ubaidullah bin Rifa'ah.",
      "chain": [
        "20212",
        "10644",
        "38113"
      ]
    },
    {
      "hadith_no": "1338",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو بكر، محمد بن عبد الله بن بزيع حدثنا بشر بن المفضل، حدثنا سعيد، عن قتادة، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لو أهدي إلى كراع لقبلت ولو دعيت عليه لأجبت ‏\"‏ ‏.‏ قال وفي الباب عن علي وعائشة والمغيرة بن شعبة وسلمان ومعاوية بن حيدة وعبد الرحمن بن علقمة ‏.‏ قال أبو عيسى حديث أنس حديث حسن صحيح ‏.‏",
      "text_en": " Anas bin Malik narrated that Messenger of Allah (ﷺ) said:                      \"If trotter (lacking meat) were given to me I would accept it, and if I was invited to (a meal of) it I would accept.\"",
      "chain": [
        "20212",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1513",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف البصري حدثنا بشر بن المفضل، أخبرنا عبد الله بن عثمان بن خثيم، عن يوسف بن ماهك، أنهم دخلوا على حفصة بنت عبد الرحمن فسألوها عن العقيقة، فأخبرتهم أن عائشة أخبرتها أن رسول الله صلى الله عليه وسلم أمرهم عن الغلام شاتان مكافئتان وعن الجارية شاة ‏.‏ قال وفي الباب عن علي وأم كرز وبريدة وسمرة وأبي هريرة وعبد الله بن عمرو وأنس وسلمان بن عامر وابن عباس ‏.‏ قال أبو عيسى حديث عائشة حديث حسن صحيح ‏.‏ وحفصة هي بنت عبد الرحمن بن أبي بكر الصديق ‏.‏",
      "text_en": " Narrated Yusuf bin Mahak:                     They entered upon Hafsah bint 'Abdur-Rahman to ask her about the 'Aqiqah. She informed them that 'Aishah had informed her, that the Messenger of Allah (ﷺ) ordered them that for a boy, two sheep were sufficient, and for a girl one sheep.",
      "chain": [
        "30460",
        "20212",
        "10644",
        "11264",
        "53"
      ]
    },
    {
      "hadith_no": "1557",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا قتيبة، حدثنا بشر بن المفضل، عن محمد بن زيد، عن عمير، مولى آبي اللحم قال شهدت خيبر مع سادتي فكلموا في رسول الله صلى الله عليه وسلم وأعلموه أني مملوك ‏.‏ قال فأمر بي فقلدت السيف فإذا أنا أجره فأمر لي بشيء من خرثي المتاع وعرضت عليه رقية كنت أرقي بها المجانين فأمرني بطرح بعضها وحبس بعضها ‏.‏ وفي الباب عن ابن عباس ‏.‏ وهذا حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم أن لا يسهم للمملوك ولكن يرضخ له بشيء ‏.‏ وهو قول الثوري والشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Narrated 'Umair, the freed slave of Abil-Lahm:                     \"I participated at Khaibar with my masters. They spoke about me to the Messenger of Allah (ﷺ) and told him that I was a slave.\" He said: \"So he ordered me to take up the sword, and I found myself dragging it, so he ordered that I be given something from the goods. I presented a Ruqyah that I used to treat the possessed with, so he ordered me leave some of it and keep some of it.\"There is something on this topic from Ibn 'Abbas.This Hadith is Hasan Sahih. This is acted upon according to the some of the people of knowledge. A complete portion is not given to slave, but something is conferred upon him. This is the view of Ath-Thawri, Ash-Shafi'i, Ahmad, and Ishaq.",
      "chain": [
        "30367",
        "20212",
        "11217",
        "3141"
      ]
    },
    {
      "hadith_no": "2023",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا بشر بن المفضل، حدثنا الجريري، عن عبد الرحمن بن أبي بكرة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا أحدثكم بأكبر الكبائر ‏\"‏ ‏.‏ قالوا بلى يا رسول الله ‏.‏ قال ‏\"‏ الإشراك بالله وعقوق الوالدين ‏\"‏ ‏.‏ قال وجلس وكان متكئا فقال ‏\"‏ وشهادة الزور أو قول الزور ‏\"‏ ‏.‏ فما زال رسول الله صلى الله عليه وسلم يقولها حتى قلنا ليته سكت ‏.‏ قال وفي الباب عن أبي سعيد ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو بكرة اسمه نفيع بن الحارث ‏.‏",
      "text_en": " 'Abdur-Rahman bin Abi Bakrah narrated from his father who said:                     \" The messenger of Allah said: 'Shall I not tell you of the biggest of the major sins?' they said : 'Of course! O Messenger of Allah!' He said: 'To join partners with Allah, and disobeying one's parents.'\"He said : \" He sat up, and he had been reclining. He said: 'And false testimony, or false speech.' And the Messenger of Allah would not stop saying it until we said (to ourselves): 'I wish that he would stop.'\"",
      "chain": [
        "30430",
        "20212",
        "11286",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "2143",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن عبد الله بن بزيع، حدثنا بشر بن المفضل، عن قرة بن خالد، عن أبي جمرة، عن ابن عباس، أن النبي صلى الله عليه وسلم قال لأشج عبد القيس ‏\"‏ إن فيك خصلتين يحبهما الله الحلم والأناة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ وفي الباب عن الأشج العصري ‏.‏",
      "text_en": " Ibn 'Abbas narrated that the Messenger of Allah said to the Ashajj 'Abdul-Qais:                     \"Indeed there are two traits in you that Allah loves: Forbearance, and deliberateness.\"",
      "chain": [
        "30448",
        "20212",
        "11301",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "2470",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Witnesses - كتاب الشهادات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "35",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا بشر بن المفضل، عن الجريري، عن عبد الرحمن بن أبي بكرة، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا أخبركم بأكبر الكبائر ‏\"‏ ‏.‏ قالوا بلى يا رسول الله ‏.‏ قال ‏\"‏ الإشراك بالله وعقوق الوالدين وشهادة الزور أو قول الزور ‏\"‏ ‏.‏ قال فما زال رسول الله صلى الله عليه وسلم يقولها حتى قلنا ليته سكت ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وفي الباب عن عبد الله بن عمرو ‏.‏",
      "text_en": " 'Abdur-Rahman bin Abi Bakrah narrated from his father that the Messenger of Allah (s.a.w) said:                     \"Shall I not inform you of the greatest of the major sins?\" They said: \"Of course O Messenger of Allah(s.a.w)!\" He said: \"Shirk with Allah disobeying parents, and false testimony.\" Or: \"False speech\" He said: \"So the Messenger of Allah(s.a.w) would not stop saying it until we said ( to ourselves): 'I wish he would  be quiet. \"",
      "chain": [
        "30430",
        "20212",
        "11286",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "2622",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا قتيبة، حدثنا بشر بن المفضل، عن الجريري، عن عبد الله بن شقيق العقيلي، قال كان أصحاب محمد صلى الله عليه وسلم لا يرون شيئا من الأعمال تركه كفر غير الصلاة ‏.‏ قال أبو عيسى سمعت أبا مصعب المدني يقول من قال الإيمان قول يستتاب فإن تاب وإلا ضربت عنقه ‏.‏",
      "text_en": " Narrated Abdullah bin Shaqiq Al-'Uqayli:                     The Companions of Muhammad (ﷺ) didn't consider leaving anything to be disblief except for the Salat.",
      "chain": [
        "30367",
        "20212",
        "11286",
        "10694"
      ]
    },
    {
      "hadith_no": "3292",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا حميد بن مسعدة، - بصري - حدثنا بشر بن المفضل، حدثنا الجريري، عن عبد الرحمن بن أبي بكرة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا أحدثكم بأكبر الكبائر ‏\"‏ ‏.‏ قالوا بلى يا رسول الله ‏.‏ قال ‏\"‏ الإشراك بالله وعقوق الوالدين ‏\"‏ ‏.‏ قال وجلس وكان متكئا قال ‏\"‏ وشهادة الزور أو قول الزور ‏\"‏ ‏.‏ قال فما زال رسول الله صلى الله عليه وسلم يقولها حتى قلنا ليته سكت ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏",
      "text_en": " Narrated 'Abdur-Rahman bin Abi Bakrah:                     from his father that the Messenger of Allah (ﷺ) said: \"Shall I not narrate to you about the worst of the major sins?\" They said: \"Of course O Messenger of Allah!\" He said: \"Associating others with Allah and disobeying the parents.\" He said: \"And he sat reclining and said: 'The false testimony.' Or he said: 'The false statement.'\" He said: \"So the Messenger of Allah (ﷺ) would not stop saying it until we said (to ourselves): 'If he would only stop.'\"",
      "chain": [
        "30430",
        "20212",
        "11286",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "3418",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا معتمر بن سليمان، عن ليث بن أبي سليم، عن بشر، عن أنس بن مالك، عن النبي صلى الله عليه وسلم في قوله ‏:‏ ‏(‏ولنسألنهم أجمعين * عما كانوا يعملون ‏)‏ قال ‏\"‏ عن قول لا إله إلا الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب إنما نعرفه من حديث ليث بن أبي سليم ‏.‏ وقد روى عبد الله بن إدريس عن ليث بن أبي سليم عن بشر عن أنس بن مالك نحوه ولم يرفعه ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     that regarding Allah's saying: We shall certainly call all of them to account. For all that they used to do (15:92 & 93). The Prophet (ﷺ) said: \"About saying La Ilaha Illallah.\"",
      "chain": [
        "30423",
        "20288",
        "10957",
        "20212",
        "19"
      ]
    },
    {
      "hadith_no": "3535",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا معتمر بن سليمان، حدثنا ليث بن أبي سليم، عن بشر، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من داع دعا إلى شيء إلا كان موقوفا يوم القيامة لازما له لا يفارقه وإن دعا رجل رجلا ‏\"‏ ‏.‏ ثم قرأ قول الله ‏:‏ ‏(‏ وقفوهم إنهم مسئولون * ما لكم لا تناصرون ‏)‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     that the Messenger of Allah (ﷺ) said: \"No caller invites to anything except that he is detained along with, on the Day of Resurrection, without parting from it, even if a man invites another man.\" Then he recited the saying of Allah, the Mighty and Sublime: 'But stop them, verily they are to be questioned. What is the matter with you? Why do you not help one another (37:24 & 25).'\"",
      "chain": [
        "30423",
        "20288",
        "10957",
        "20212",
        "19"
      ]
    },
    {
      "hadith_no": "3579",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف حدثنا بشر بن المفضل، عن داود بن أبي هند، عن الشعبي، عن أبي جبيرة بن الضحاك، نحوه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": "",
      "chain": [
        "20212",
        "11585",
        "11052",
        "1903"
      ]
    },
    {
      "hadith_no": "4012",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا بشر بن المفضل، حدثنا خالد الحذاء، حدثنا عمار، مولى بني هاشم حدثنا ابن عباس، أن النبي صلى الله عليه وسلم توفي وهو ابن خمس وستين ‏.‏ قال أبو عيسى هذا حديث حسن الإسناد صحيح ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"The Prophet (ﷺ) died when he was sixty-five years old.\"",
      "chain": [
        "30395",
        "20212",
        "11282",
        "17"
      ]
    },
    {
      "hadith_no": "82",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا محمد بن إبراهيم البصري، عن بشر بن المفضل، عن ابن عون، عن عامر الشعبي، عن عروة بن المغيرة، عن المغيرة، وعن محمد بن سيرين، عن رجل، حتى رده إلى المغيرة - قال ابن عون ولا أحفظ حديث ذا من حديث ذا - أن المغيرة قال كنا مع رسول الله صلى الله عليه وسلم في سفر فقرع ظهري بعصا كانت معه فعدل وعدلت معه حتى أتى كذا وكذا من الأرض فأناخ ثم انطلق ‏.‏ قال فذهب حتى توارى عني ثم جاء فقال ‏\"‏ أمعك ماء ‏\"‏ ‏.‏ ومعي سطيحة لي فأتيته بها فأفرغت عليه فغسل يديه ووجهه وذهب ليغسل ذراعيه وعليه جبة شامية ضيقة الكمين فأخرج يده من تحت الجبة فغسل وجهه وذراعيه وذكر من ناصيته شيئا وعمامته شيئا - قال ابن عون لا أحفظ كما أريد ثم مسح على خفيه - ثم قال ‏\"‏ حاجتك ‏\"‏ ‏.‏ قلت يا رسول الله ليست لي حاجة فجئنا وقد أم الناس عبد الرحمن بن عوف وقد صلى بهم ركعة من صلاة الصبح فذهبت لأوذنه فنهاني فصلينا ما أدركنا وقضينا ما سبقنا ‏.‏",
      "text_en": " Al-Mughirah said:                      \"We were with the Prophet (ﷺ) on a journey, and he tapped me on the back with a stick he had with him, then he turned off (route) and I turned off with him until he came to such and such an area. Then he made his camel stop and went away until he disappeared from me, then he came back and said: 'Do you have water with you?' I had a water skin with me, so I brought it out and poured it for him. He washed his hands and face and began to wash his arms, but he was wearing a Syrian Jubbah[1] that had narrow sleeves, so he brought his arms out from beneath the Jubbah and washed his hands and arms, and wiped his forelock a little and his turban a little.\" - Ibn 'Awn said: \"I cannot remember it well - then he wiped over his Khuffs.\" Then he said: 'What do you need?' I said: 'O Messenger of Allah, I do not need anything.' Then we came and 'Abdur-Rahman bin 'Awf was leading the people in Salah, and he had led them in one Rak'ah of the Subh (Fajr) prayer. I wanted to tell him that the Prophet (ﷺ) had arrived but he did not let me, so we prayed what we had caught up with and made up what we had missed.'\"[1] It is a type of cloak.",
      "chain": [
        "11213",
        "20212",
        "11071",
        "11052",
        "11373",
        "166",
        "11035",
        "166"
      ]
    },
    {
      "hadith_no": "271",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا حميد بن مسعدة، قال حدثنا بشر، - وهو ابن المفضل - قال حدثنا حميد، عن بكر، عن أبي رافع، عن أبي هريرة، أن النبي صلى الله عليه وسلم لقيه في طريق من طرق المدينة وهو جنب فانسل عنه فاغتسل ففقده النبي صلى الله عليه وسلم فلما جاء قال ‏\"‏ أين كنت يا أبا هريرة ‏\"‏ ‏.‏ قال يا رسول الله إنك لقيتني وأنا جنب فكرهت أن أجالسك حتى أغتسل ‏.‏ فقال ‏\"‏ سبحان الله إن المؤمن لا ينجس ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) met him in one of the streets of Al-Madinah while he was Junub, so he slipped away from him and performed Ghusl. The Prophet (ﷺ) noticed he was not there, and when he came he said:                      'Where were you, O Abu Hurairah?' He said: 'O Messenger of Allah, you met us but I was Junub, and I did not want to sit in your presence until I had performed Ghusl.' He said: 'Subhan Allah! The believer is not made impure (Najis).'\"",
      "chain": [
        "30430",
        "20212",
        "11279",
        "11267",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "402",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا محمد بن إبراهيم، قال حدثنا بشر بن المفضل، قال حدثنا شعبة، عن مجزأة بن زاهر، أنه سمع عبد الله بن أبي أوفى، يحدث عن النبي صلى الله عليه وسلم أنه كان يدعو ‏‏\"‏‏ اللهم طهرني من الذنوب والخطايا اللهم نقني منها كما ينقى الثوب الأبيض من الدنس اللهم طهرني بالثلج والبرد والماء البارد ‏‏\"‏‏ ‏‏.‏‏",
      "text_en": " 'Abdullah bin Abi Awfa narrated that the Prophet (ﷺ) would supplicate:                      \"Allahumma tahhirni min adh-dhunub wal-khataya. Allahumma naqqini minha kama yunaqqa ath-thawb al-abyad min ad-danas, Allahumma tahhirni bith-thalji wal-barad wal-ma' al-barid (O Allah, purify me of sin and error, O Allah cleanse me of it as a white garment is cleansed of dirt, O Allah purify me with snow and hail and cold water).\"",
      "chain": [
        "11213",
        "20212",
        "20020",
        "11650",
        "5115"
      ]
    },
    {
      "hadith_no": "431",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا حميد بن مسعدة، عن بشر، - وهو ابن المفضل - قال حدثنا شعبة، عن إبراهيم بن محمد، عن أبيه، قال قالت عائشة كنت أطيب رسول الله صلى الله عليه وسلم فيطوف على نسائه ثم يصبح محرما ينضخ طيبا ‏.‏",
      "text_en": " 'Aishah said:                      \"I used to put perfume on the Messenger of Allah (ﷺ) and he would go around to all his wives, then enter Ihram in the morning with the smell of perfume coming from him.\"",
      "chain": [
        "30430",
        "20212",
        "20020",
        "13898"
      ]
    },
    {
      "hadith_no": "1072",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر بن المفضل، عن يونس، عن ابن سيرين، قال حدثني بعض، من صلى مع رسول الله صلى الله عليه وسلم صلاة الصبح فلما قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ في الركعة الثانية قام هنيهة ‏.‏",
      "text_en": " It was narrated that Ibn Sirin said:                     \"Some of those who prayed the Subh prayer with the Messenger of Allah (ﷺ) narrated to me that when he said: Sami'Allahu liman hamidah (Allah hears those who praise Him)' in the second rak'ah, he stood for a while.\"",
      "chain": [
        "34033",
        "20212",
        "20475",
        "11035"
      ]
    },
    {
      "hadith_no": "1265",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال أنبأنا بشر بن المفضل، قال حدثنا عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال قلت لأنظرن إلى صلاة رسول الله صلى الله عليه وسلم كيف يصلي فقام رسول الله صلى الله عليه وسلم فاستقبل القبلة فرفع يديه حتى حاذتا أذنيه ثم أخذ شماله بيمينه فلما أراد أن يركع رفعهما مثل ذلك ووضع يديه على ركبتيه فلما رفع رأسه من الركوع رفعهما مثل ذلك فلما سجد وضع رأسه بذلك المنزل من يديه ثم جلس فافترش رجله اليسرى ووضع يده اليسرى على فخذه اليسرى وحد مرفقه الأيمن على فخذه اليمنى وقبض ثنتين وحلق ورأيته يقول هكذا وأشار بشر بالسبابة من اليمنى وحلق الإبهام والوسطى ‏.‏",
      "text_en": " It was narrated that Wa'il bin Hujr said:                     \"I said: 'I am going to watch the Messenger of Allah (ﷺ) and see how he prays.' The Messenger of Allah (ﷺ) stood up and faced the Qiblah, then he raised his hands until they were in level with his ears, then he held his left hand with his right. When he wanted to bow, he raised them (his hands) likewise, then placed his hands on his knees. When he raised his head from bowing, he raised them (his hands) likewise. When he prostrated he put his hands in the same position in relation to his head, then he sat up and lay his left foot on the ground. He placed his left hand on his left thigh and his right elbow on his right thigh, and made a circle with two of his fingers. And I saw him doing like this\"- Bishr (one of the narrators) pointed with the forefinger of his right hand and made a circle with the thumb and middle finger.",
      "chain": [
        "34033",
        "20212",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "1364",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر، - وهو ابن المفضل - قال حدثنا داود بن أبي هند، عن الوليد بن عبد الرحمن، عن جبير بن نفير، عن أبي ذر، قال صمنا مع رسول الله صلى الله عليه وسلم رمضان فلم يقم بنا النبي صلى الله عليه وسلم حتى بقي سبع من الشهر فقام بنا حتى ذهب نحو من ثلث الليل ثم كانت سادسة فلم يقم بنا فلما كانت الخامسة قام بنا حتى ذهب نحو من شطر الليل قلنا يا رسول الله لو نفلتنا قيام هذه الليلة ‏.‏ قال ‏\"‏ إن الرجل إذا صلى مع الإمام حتى ينصرف حسب له قيام ليلة ‏\"‏ ‏.‏ قال ثم كانت الرابعة فلم يقم بنا فلما بقي ثلث من الشهر أرسل إلى بناته ونسائه وحشد الناس فقام بنا حتى خشينا أن يفوتنا الفلاح ثم لم يقم بنا شيئا من الشهر ‏.‏ قال داود قلت ما الفلاح قال السحور ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"We fasted Ramadan with the Messenger of Allah (ﷺ), and the Prophet (ﷺ) did not lead us in Qiyam until there were seven days left of the month, then he led us in Qiyam until one-third of the night had passed. Then, when there were six days left, he did not lead us in Qiyam. When there were five days left, he led us in praying Qiyam until half the night had passed. We said: 'O Messenger of Allah (SA), why don't you lead us in praying Qiyam for the rest of the night?' He said: 'If a man prays with the Imam until he leaves, that will be continued for him as if he spent the whole night in prayer.' Then, when there were four days left, he did not lead us in praying Qiyam. When there were three days left he sent for his daughters and women, and gathered the people, and he led us in praying Qiyam until we feared that we would miss Al-Falah. Then he did not lead us in praying Qiyam for the rest of the month.\" Dawud (one of the narrators) said: \"I said: ' What is falah?' He said: 'Sahur.'",
      "chain": [
        "34033",
        "20212",
        "11585",
        "10975",
        "4097",
        "23"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا حميد بن مسعدة، قال حدثنا بشر، قال حدثنا داود بن أبي هند، عن أبي الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ على كل رجل مسلم في كل سبعة أيام غسل يوم وهو يوم الجمعة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"The Messenger of Allah (ﷺ) said: 'Every Muslim man has to perform Ghusl one day in every seven, and that is on Friday.'\"",
      "chain": [
        "30430",
        "20212",
        "11585",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر بن المفضل، قال حدثنا عبيد الله، عن نافع، عن عبد الله، أن رسول الله صلى الله عليه وسلم كان يخطب الخطبتين وهو قائم وكان يفصل بينهما بجلوس ‏.‏",
      "text_en": " It was narrated from 'Abdullah that:                     The Messenger of Allah (ﷺ) used to deliver two khutbahs standing, and he would separate them by sitting.",
      "chain": [
        "34033",
        "20212",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1616",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن إبراهيم البصري، عن بشر، - هو ابن المفضل - قال حدثنا شعبة، عن أشعث بن سليم، عن أبيه، عن مسروق، قال قلت لعائشة أى الأعمال أحب إلى رسول الله صلى الله عليه وسلم قالت الدائم ‏.‏ قلت فأى الليل كان يقوم قالت إذا سمع الصارخ ‏.‏",
      "text_en": " It was narrated that Masruq said:                     \"I said to 'Aishah: 'Which deed was most beloved to the Messenger of Allah (ﷺ)?' She said: 'That which was done persistently.' I said: 'At what part of the night did he pray Qiyam?' She said: 'When he heard the rooster.'\"",
      "chain": [
        "11213",
        "20212",
        "20020",
        "11324",
        "11351",
        "11018"
      ]
    },
    {
      "hadith_no": "1698",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر بن المفضل، قال حدثنا سعيد، عن قتادة، عن زرارة بن أوفى، عن سعد بن هشام، أن عائشة، حدثته أن رسول الله صلى الله عليه وسلم كان لا يسلم في ركعتى الوتر ‏.‏",
      "text_en": " It was narrated from Sa'd bin Hisham, that:                     Aishah told him: \"The Messenger of Allah (ﷺ) would not say the taslim for two rak'ahs during witr.\"",
      "chain": [
        "34033",
        "20212",
        "11168",
        "11019",
        "11284",
        "11166",
        "53"
      ]
    },
    {
      "hadith_no": "1826",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا بشر بن المفضل، قال حدثنا عمارة بن غزية، قال حدثنا يحيى بن عمارة، قال سمعت أبا سعيد، ح وأنبأنا قتيبة، قال حدثنا عبد العزيز، عن عمارة بن غزية، عن يحيى بن عمارة، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لقنوا موتاكم لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Saeed said:                     \"The Messenger of Allah said: 'Prompt your dying ones to say La ilaha illallah (there is none worthy of worship except Allah).\"'",
      "chain": [
        "30153",
        "20212",
        "11894",
        "11232",
        "38",
        "30367",
        "20167",
        "11894",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "1874",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر بن المفضل، عن يونس، عن الحسن، عن صعصعة بن معاوية، قال لقيت أبا ذر قلت حدثني ‏.‏ قال نعم قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من مسلمين يموت بينهما ثلاثة أولاد لم يبلغوا الحنث إلا غفر الله لهما بفضل رحمته إياهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Sa'sa'ah bin Mu'awiyah said:                     \"I met Abu Dharr and said: 'Tell me a Hadith.' He said: the Messenger of Allah said: There are no two Muslims, three of whose children die before reaching puberty, but Allah will forgive them by virtue of His mercy towards them.\"'",
      "chain": [
        "34033",
        "20212",
        "20475",
        "11016",
        "18438"
      ]
    },
    {
      "hadith_no": "1889",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر، عن سلمة بن علقمة، عن محمد، عن بعض، إخوته عن أم عطية، قالت توفيت ابنة لرسول الله صلى الله عليه وسلم فأمرنا بغسلها فقال ‏\"‏ اغسلنها ثلاثا أو خمسا أو سبعا أو أكثر من ذلك إن رأيتن ‏\"‏ ‏.‏ قالت قلت وترا قال ‏\"‏ نعم واجعلن في الآخرة كافورا أو شيئا من كافور فإذا فرغتن فآذنني ‏\"‏ ‏.‏ فلما فرغنا آذناه فأعطانا حقوه وقال ‏\"‏ أشعرنها إياه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Umm 'Atiyyah said:                     \"A daughter of the Messenger of Allah died and he told us to wash her. He said: 'Three times, or five or seven, or more than that, if you think that (is necessary).' I said: 'An odd number?' He said: 'Yes, and put camphor, or some camphor, in (the water) the last time. And when you have finished, inform me.' So when you have finished, we informed him, and then gave us his waist-wrap and said: 'Shroud her in it.\"",
      "chain": [
        "34033",
        "20212",
        "11593",
        "11035",
        "71"
      ]
    },
    {
      "hadith_no": "1936",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا حميد بن مسعدة، عن بشر، - وهو ابن المفضل - عن شعبة، عن سليمان الأعمش، عن مجاهد، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تسبوا الأموات فإنهم قد أفضوا إلى ما قدموا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah said: 'Do not verbally abuse the dead, for they have reached the consequences of what they did.\"'",
      "chain": [
        "30430",
        "20212",
        "20020",
        "11060",
        "11028",
        "53"
      ]
    },
    {
      "hadith_no": "1975",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر بن المفضل، قال حدثنا يونس، عن محمد بن سيرين، عن أبي المهلب، عن عمران بن حصين، قال قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ إن أخاكم النجاشي قد مات فقوموا فصلوا عليه ‏\"‏ ‏.‏ قال فقمنا فصففنا عليه كما يصف على الميت وصلينا عليه كما يصلى على الميت ‏.‏",
      "text_en": " It was narrated that 'Imran bin Husain said:                     \"The Messenger of Allah said to us: 'Your brother An-Najashi has died, so get up and offer the funeral prayer for him.' So we got up and formed row to pray for him, as rows are formed to pray for the dead, and he led us in praying for him as people pray for the dead.\"",
      "chain": [
        "34033",
        "20212",
        "20475",
        "11035",
        "123"
      ]
    },
    {
      "hadith_no": "2524",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا الحسين بن محمد الذارع، قال حدثنا يزيد، - وهو ابن زريع - قال حدثنا شعبة، ‏.‏ قال وأنبأنا إسماعيل بن مسعود، قال حدثنا بشر، - وهو ابن المفضل - قال حدثنا شعبة، - واللفظ لبشر - عن قتادة، عن أبي المليح، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الله عز وجل لا يقبل صلاة بغير طهور ولا صدقة من غلول ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Al-Malib that his father said:                     \"I heard the Messenger of Allah say: 'Allah, the Mighty and Sublime, does not accept prayer without purification or charity from Ghulul.\"",
      "chain": [
        "34059",
        "20304",
        "34033",
        "20212",
        "11019",
        "11453",
        "4001"
      ]
    },
    {
      "hadith_no": "2618",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا بشر، ويزيد، قالا حدثنا عبد الرحمن بن إسحاق، عن الزهري، عن سعيد بن المسيب، أن رسول الله صلى الله عليه وسلم أمر عتاب بن أسيد أن يخرص العنب فتؤدى زكاته زبيبا كما تؤدى زكاة النخل تمرا ‏.‏",
      "text_en": " It was narrated from Sa'eed bin Al-Musayyab:                     That the Messenger of Allah told 'Attab bin Usaid to estimate the (harvest of) grapes, and to pay Zakah in raisins, just as the Zakah on date palms is given in died dates.",
      "chain": [
        "30153",
        "20212",
        "20472",
        "11876",
        "11013",
        "11002"
      ]
    },
    {
      "hadith_no": "2697",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا حميد بن مسعدة، قال حدثنا بشر، - يعني ابن المفضل - قال حدثنا شعبة، عن الحكم، عن إبراهيم، عن الأسود، عن عائشة، قالت كأني أنظر إلى وبيص الطيب في مفرق رأس رسول الله صلى الله عليه وسلم وهو محرم ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"It is as if I can see the glistening of the perfume in the parting on the head of the Messenger of Allah when he was in Ihram.(Shah)",
      "chain": [
        "30430",
        "20212",
        "20020",
        "11069",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2704",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا حميد بن مسعدة، عن بشر، - يعني ابن المفضل - قال حدثنا شعبة، عن إبراهيم بن محمد بن المنتشر، عن أبيه، قال سألت ابن عمر عن الطيب، عند الإحرام فقال لأن أطلي بالقطران أحب إلى من ذلك ‏.‏ فذكرت ذلك لعائشة فقالت يرحم الله أبا عبد الرحمن لقد كنت أطيب رسول الله صلى الله عليه وسلم فيطوف في نسائه ثم يصبح ينضح طيبا ‏.‏",
      "text_en": " It was narrated from Ibrahim bin Al-Muntashir that his father said:                     \"I asked Ibn 'Umar about wearing perfume when entering Ihram and he said: 'If I were to be daubed with tar that would be dearer to me than that, I mentioned that to 'Aishah and she said: 'May Allah have mercy on Abu 'Abdur-Rahman. I used to put perfume on the Messenger of Allah then he would go around his wives, then in the morning he would be smelling strongly of perfume.",
      "chain": [
        "30430",
        "20212",
        "20020",
        "11321",
        "11388",
        "18"
      ]
    },
    {
      "hadith_no": "3099",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا محمد بن عبد الله بن بزيع، قال حدثنا بشر، - يعني ابن المفضل - قال أنبأنا عبد الرحمن بن إسحاق، عن الزهري، عن سهل بن سعد، قال رأيت مروان بن الحكم جالسا فجئت حتى جلست إليه فحدثنا أن زيد بن ثابت حدثه أن رسول الله صلى الله عليه وسلم أنزل عليه لا يستوي القاعدون من المؤمنين والمجاهدون في سبيل الله ‏.‏ فجاء ابن أم مكتوم وهو يملها على فقال يا رسول الله لو أستطيع الجهاد لجاهدت فأنزل الله عز وجل وفخذه على فخذي فثقلت على حتى ظننت أن سترض فخذي ثم سري عنه ‏{‏ غير أولي الضرر ‏}‏ قال أبو عبد الرحمن عبد الرحمن بن إسحاق هذا ليس به بأس وعبد الرحمن بن إسحاق يروي عنه علي بن مسهر وأبو معاوية وعبد الواحد بن زياد عن النعمان بن سعد ليس بثقة ‏.‏",
      "text_en": " It was narrated that Sahl bin Sa'd said:                      \"I saw Marwan bin Al-Hakam sitting and I came and sat with him. He told us that Zaid bin Thabit told him, that the following was revealed to Allah's Messenger (ﷺ): (Not equal are those of the believers who sit (at home) and those who strive hard and fight in the cause of Allah), then Ibn Umm Maktum came when he was dictating it to me (Zaid), and said: 'O Messenger of Allah! If I were able to go for Jihad I would go out for Jihad.' Then Allah, the Mighty and Sublime, revealed to him - while his thigh was against mine, and became so heavy that I thought my thigh would break, until (the revelation) stopped -: 'Except those who are disabled (by injury or are blind or lame).'\" [1]Abu 'Abdur-Rahman (An-Nasa'i) said: This 'Abdur-Rahman bin Ishaq is tolerable, while 'Abdur-Rahman bin IShaq, from whom reports 'Ali bin Mushir, abu Mu'awiyah, and 'Abdul-Wahid bin Ziyad from An-Nu'man bin Sa'd - he is not trustworthy.[1] An-Nisa' 4:95.",
      "chain": [
        "30448",
        "20212",
        "11876",
        "11013",
        "399",
        "49"
      ]
    },
    {
      "hadith_no": "3185",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر بن المفضل، عن يونس، عن الحسن، عن صعصعة بن معاوية، قال لقيت أبا ذر قال قلت حدثني ‏.‏ قال نعم قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من عبد مسلم ينفق من كل مال له زوجين في سبيل الله إلا استقبلته حجبة الجنة كلهم يدعوه إلى ما عنده ‏\"‏ ‏.‏ قلت وكيف ذلك قال ‏\"‏ إن كانت إبلا فبعيرين وإن كانت بقرا فبقرتين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Sa'sa'ah bin Mu'awiyah said:                      \"I met Abu Dharr and said: 'Tell me a Hadith.' He said. Yes, the Messenger of Allah (ﷺ) said: There is no Muslim worshiper who spends from each type of his wealth on a pair (of things) in the cause of Allah, but the keepers of Paradise will welcome him, all of them calling him to what they have (of reward).' I said: \"How is that?\" He said: \"If it is camels, he gives two, and if it is cows, he gives two.'\"",
      "chain": [
        "34033",
        "20212",
        "20475",
        "11016",
        "18438"
      ]
    },
    {
      "hadith_no": "3335",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا حميد بن مسعدة، قال حدثنا بشر، قال حدثنا حميد، عن الحسن، عن عمران بن حصين، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا جلب ولا جنب ولا شغار في الإسلام ومن انتهب نهبة فليس منا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Imran bin Husain that the Messenger of Allah said:                      \"There is no 'bringing', no 'avoidance' and no Shighar in Islam, and whoever robs, he is not one of us.\"",
      "chain": [
        "30430",
        "20212",
        "11279",
        "11016",
        "123"
      ]
    },
    {
      "hadith_no": "3566",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Horses, Races and Shooting - كتاب الخيل",
      "chapter_no": "28",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا محمد بن جعفر، قال حدثنا شعبة، ح وأنبأنا إسماعيل بن مسعود، قال حدثنا بشر، قال حدثنا شعبة، عن عبد الله بن يزيد، عن أبي زرعة، عن أبي هريرة، قال كان النبي صلى الله عليه وسلم يكره الشكال من الخيل ‏.‏ واللفظ لإسماعيل ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      The Prophet used to dislike the Shikal among horses. And the wording is that of Isma'il.",
      "chain": [
        "30123",
        "20173",
        "20020",
        "34033",
        "20212",
        "20020",
        "1945",
        "30554",
        "13"
      ]
    },
    {
      "hadith_no": "3600",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Endowments - كتاب الإحباس",
      "chapter_no": "29",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر، عن ابن عون، قال وأنبأنا حميد بن مسعدة، قال حدثنا بشر، قال حدثنا ابن عون، عن نافع، عن ابن عمر، قال أصاب عمر أرضا بخيبر فأتى النبي صلى الله عليه وسلم فاستأمره فيها فقال إني أصبت أرضا كثيرا لم أصب مالا قط أنفس عندي منه فما تأمر فيها قال ‏\"‏ إن شئت حبست أصلها وتصدقت بها ‏\"‏ ‏.‏ فتصدق بها - على أنه لا تباع ولا توهب - فتصدق بها في الفقراء والقربى وفي الرقاب وفي سبيل الله وابن السبيل والضيف لا جناح - يعني - على من وليها أن يأكل أو يطعم صديقا غير متمول اللفظ لإسماعيل ‏.‏",
      "text_en": " It was narrated from Bishr, from Ibn 'Awn, from Nafi', from Ibn 'Umar who said:                      \"Umar acquired some land at Khaibar. He came to the Prophet and consulted him about it. He said: 'I have acquired a great deal of land, and I have never acquired any wealth that is more precious to me than it. What do you command me to do with it?' He said: 'If you wish, you may freeze it and give it in charity.' So he gave it in charity on condition that it would not be sold or given away, and he gave it in charity to the poor, relatives, to emancipate slaves, for the cause of Allah, for wayfarers and guests. There is no sin -on the administrator- if he eats (from it) or feeds a friend, with no intention of becoming wealthy from it.'\" These are the wordings of Isma'il.",
      "chain": [
        "34033",
        "20212",
        "11071",
        "30430",
        "20212",
        "11071",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3736",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of 'Umra - كتاب العمرى",
      "chapter_no": "34",
      "text_ar": "أخبرني محمد بن إبراهيم بن صدران، عن بشر بن المفضل، قال حدثنا الحجاج الصواف، عن أبي الزبير، قال حدثنا جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يا معشر الأنصار امسكوا عليكم - يعني أموالكم - لا تعمروها فإنه من أعمر شيئا فإنه لمن أعمره حياته ومماته ‏\"‏ ‏.‏",
      "text_en": " Al-Hajjaj bin As-Sawwaf narrated from Abu Az-Zubair, who said:                      \"Jabir said: 'The Messenger of Allah said: \"O Ansar! Hold on to your wealth, and do not give it on the basis of 'Umra. For whoever gives something on the basis of 'Umra, it belongs to the one to whom he gave it on that basis, for the rest of his life and after he dies.\"'\"",
      "chain": [
        "34185",
        "20212",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3947",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Kind Treatment of Women - كتاب عشرة النساء",
      "chapter_no": "36",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر، - يعني ابن المفضل - قال حدثنا شعبة، عن عمرو بن مرة، ‏{‏ عن مرة، ‏}‏ عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ فضل عائشة على النساء كفضل الثريد على سائر الطعام ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Musa that the Prophet said:                      \"The superiority of 'Aishah to other women is like the superiority of Tharid to other kinds of food.\"",
      "chain": [
        "34033",
        "20212",
        "20020",
        "11381",
        "41"
      ]
    },
    {
      "hadith_no": "4085",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن عبد الله بن بزيع، قال حدثنا بشر بن المفضل، عن أبي يونس القشيري، عن عمرو بن دينار، عن عبد الله بن صفوان، عن عبد الله بن عمرو، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من قاتل دون ماله فقتل فهو شهيد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     \"I heard the Messenger of Allah [SAW] say: 'Whoever fights to protect his wealth and is killed, he is a martyr.'\"",
      "chain": [
        "30448",
        "20212",
        "11081",
        "487",
        "29"
      ]
    },
    {
      "hadith_no": "4229",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا بشر، - وهو ابن المفضل - عن خالد، وربما، قال عن أبي المليح، وربما، ذكر أبا قلابة عن نبيشة، قال نادى رجل وهو بمنى فقال يا رسول الله إنا كنا نعتر عتيرة في الجاهلية في رجب فما تأمرنا يا رسول الله قال ‏\"‏ اذبحوا في أى شهر ما كان وبروا الله عز وجل وأطعموا ‏\"‏ ‏.‏ قال إنا كنا نفرع فرعا فما تأمرنا قال ‏\"‏ في كل سائمة فرع تغذوه ماشيتك حتى إذا استحمل ذبحته وتصدقت بلحمه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Nubaishah said:                     \"A man called out while he was in Mina and said: 'O Messenger of Allah, we used to sacrifice the 'Atirah during the Jahiliyyah in Rajab; what do you command us to do?' He said: 'Sacrifice during whatever month it is, do good for the sake of Allah, the Mighty and Sublime, and feed (the poor).' They said: 'O Messenger of Allah, we used to sacrifice the Fara' during the Jahiliyyah; what do you command us to do?' He said: 'For every flock of grazing animals, feed the firstborn as you feed the rest of you flock until it reaches an age where it could be used carry loads, then sacrifice it, and give its meat in charity.\"'",
      "chain": [
        "30153",
        "20212",
        "11282",
        "11453",
        "11047"
      ]
    },
    {
      "hadith_no": "4249",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر، - يعني ابن المفضل - قال حدثنا شعبة، عن الحكم، عن ابن أبي ليلى، عن عبد الله بن عكيم، قال قرئ علينا كتاب رسول الله صلى الله عليه وسلم وأنا غلام شاب ‏\"‏ أن لا تنتفعوا من الميتة بإهاب ولا عصب ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Ukaim said:                     \"The letter of the Messenger of Allah was read to us when I was a young boy: 'Do not make use of the skins and sinew of dead animals.\"'",
      "chain": [
        "34033",
        "20212",
        "20020",
        "11069",
        "11196",
        "10786"
      ]
    },
    {
      "hadith_no": "4348",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا إسماعيل بن مسعود، عن بشر، - هو ابن المفضل - قال حدثنا سعيد، عن علي بن الحكم، عن ميمون بن مهران، عن سعيد بن جبير، عن ابن عباس، أن نبي الله صلى الله عليه وسلم نهى يوم خيبر عن كل ذي مخلب من الطير وعن كل ذي ناب من السباع ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     on the Day of Khaibar, the Prophet of Allah forbade eating any birds with talons and any predators with fangs. (Daif)",
      "chain": [
        "34033",
        "20212",
        "11168",
        "11012",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "4562",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر بن المفضل، قال حدثنا سلمة بن علقمة، عن محمد، قال حدثني مسلم بن يسار، وعبد الله بن عبيد، قالا جمع المنزل بين عبادة بن الصامت وبين معاوية فقال عبادة نهى رسول الله صلى الله عليه وسلم أن نبيع الذهب بالذهب والورق بالورق والبر بالبر والشعير بالشعير والتمر بالتمر - قال أحدهما والملح بالملح ولم يقل الآخر - إلا سواء بسواء مثلا بمثل - قال أحدهما من زاد أو ازداد فقد أربى ولم يقل الآخر - وأمرنا أن نبيع الذهب بالورق والورق بالذهب والبر بالشعير والشعير بالبر يدا بيد كيف شئنا فبلغ هذا الحديث معاوية فقام فقال ما بال رجال يحدثون أحاديث عن رسول الله صلى الله عليه وسلم قد صحبناه ولم نسمعه منه ‏.‏ فبلغ ذلك عبادة بن الصامت فقام فأعاد الحديث فقال لنحدثن بما سمعناه من رسول الله صلى الله عليه وسلم وإن رغم معاوية ‏.‏ خالفه قتادة رواه عن مسلم بن يسار عن أبي الأشعث عن عبادة ‏.‏",
      "text_en": " Muslim bin Yasar and 'Abdullah bin 'Ubaid said:                     \"Ubadah bin As-Samit and Muawiyah met at a stopping place on the road. 'Ubadah said: 'The Messenger of Allah forbade us to sell gold for gold, silver for silver, wheat for wheat, barley for barley, dates for dates\"' - one of them said: \"salt for salt, \" but the other did not say \"unless it was equal amount for equal amount, like for like.\" One of them said: \"Whoever gives more or takes more has engaged in Riba,\" but the other one did not say it. \"And the commanded us to sell gold for silver and silver for gold, and wheat for barley and barley for wheat, hand to hand, however we wanted.' News of this hadith reached Muawiyah and he stood up and said: 'What is the matter with men who narrate Hadiths from the Messenger of Allah when we accompanied him and we never heard him say it? News of that reached 'Ubadah bin As-Samit and he stood up and repeated the Hadith, then he said: 'We will narrate what we heard from the Messenger of Allah, whether Muawiyah likes it or not.\"' Qatadah contradicted him, he reported it from Muslim bin Yasar, from Abu Al-=Ashath, from 'Ubadah.",
      "chain": [
        "34033",
        "20212",
        "11593",
        "11035",
        "13118"
      ]
    },
    {
      "hadith_no": "4714",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا بشر، - وهو ابن المفضل - قال حدثنا يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، أن عبد الله بن سهل، ومحيصة بن مسعود بن زيد، أنهما أتيا خيبر وهو يومئذ صلح فتفرقا لحوائجهما فأتى محيصة على عبد الله بن سهل وهو يتشحط في دمه قتيلا فدفنه ثم قدم المدينة فانطلق عبد الرحمن بن سهل وحويصة ومحيصة إلى رسول الله صلى الله عليه وسلم فذهب عبد الرحمن يتكلم - وهو أحدث القوم سنا - فقال رسول الله صلى الله عليه وسلم ‏\"‏ كبر الكبر ‏\"‏ ‏.‏ فسكت فتكلما فقال رسول الله صلى الله عليه وسلم ‏\"‏ أتحلفون بخمسين يمينا منكم فتستحقون دم صاحبكم أو قاتلكم ‏\"‏ ‏.‏ قالوا يا رسول الله كيف نحلف ولم نشهد ولم نر قال ‏\"‏ تبرئكم يهود بخمسين يمينا ‏\"‏ ‏.‏ قالوا يا رسول الله كيف نأخذ أيمان قوم كفار فعقله رسول الله صلى الله عليه وسلم من عنده ‏.‏",
      "text_en": " It was narrated from Sahi bin Abi Hathmah that:                     'Abdullah bin SAahi and Nubayysah bin Mas'ud bin Zaid went o Khaibar, and at that time there was peace treaty. They went their separate ways to about their business, then Muhayysah came upon 'Abdullah in Sahl lying dead in a pool of blood. He buried him, then he came to AL-Madinah. 'Abdur-Rahman bin Sahi. Huwayysah, and Muhayysah came to the Messenger of Allah, and 'Abdur-Rehman started to speak, but he was the youngest of them, so the Messenger of Allah said: \"Let the elders speak first.\" So he fell silent and they (the other two) spoke. The Messenger of Allah said: \"Will you swear fifty oaths, then you will receive compensation or be entitled to retaliate?\" They said: \"O Messenger of Allah, how can we swear an oath when we did not witness, and did not see (what happened)?\" He said: \"The n can the Jews swear fifty oaths declaring their innocence?\" They said: \"O Messenger of Allah, how can we accept the oath of a disbelieving people?\" So the Messenger of Allah paid the blood money himself.",
      "chain": [
        "30153",
        "20212",
        "11062",
        "11810",
        "1822"
      ]
    },
    {
      "hadith_no": "4715",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر بن المفضل، قال حدثنا يحيى بن سعيد، عن بشير بن يسار، عن سهل بن أبي حثمة، قال انطلق عبد الله بن سهل ومحيصة بن مسعود بن زيد إلى خيبر وهي يومئذ صلح فتفرقا في حوائجهما فأتى محيصة على عبد الله بن سهل وهو يتشحط في دمه قتيلا فدفنه ثم قدم المدينة فانطلق عبد الرحمن بن سهل وحويصة ومحيصة ابنا مسعود إلى رسول الله صلى الله عليه وسلم فذهب عبد الرحمن يتكلم فقال له رسول الله صلى الله عليه وسلم ‏\"‏ كبر الكبر ‏\"‏ ‏.‏ وهو أحدث القوم فسكت فتكلما فقال رسول الله صلى الله عليه وسلم ‏\"‏ أتحلفون بخمسين يمينا منكم وتستحقون قاتلكم أو صاحبكم ‏\"‏ ‏.‏ فقالوا يا رسول الله كيف نحلف ولم نشهد ولم نر فقال ‏\"‏ أتبرئكم يهود بخمسين ‏\"‏ ‏.‏ فقالوا يا رسول الله كيف نأخذ أيمان قوم كفار فعقله رسول الله صلى الله عليه وسلم من عنده ‏.‏",
      "text_en": " It was narratd that Sahl bin Abi Hatmah said:                     \"Abdullah bin Sahl and Muhayysah bin Mas'ud bin Zaid went to Khaibar, and at that time there was a peace treaty. They went their separatea ways to go about their business, then Muhayysah came upon 'Abdullah bin Sahl lying dead in a pool of blood. He buried him, then he camae to Al-Madinah. 'Abdur-Rahman bin Sahl and Huwhayysah, and Muhayysah, the tow sons of Nas'ud, came to the Messenger of Allah, and \"Abdur-Rahman started to speak, but the Messenger of Allah said: \"Let the elders speak first,\" for he was the youngest of them. So he fell silent and they (the other two) spoke. The Messenger of Allah said: \"Will you sear fifty oaths, then you will receive compensation or be entitled to retaliate?\" They said: \"O Messenger of Allah, how can we a wear and oath when we did not witness and did not see (what happened)\" He said: \"Then can the Jews swear fifty oaths declaring their innocence?\" They said: \"O Messenger of Allah, how can we accept the oath of a disbelieving people?\" So the Messenger of Allah paid the blood money himself.",
      "chain": [
        "34033",
        "20212",
        "11062",
        "11810",
        "1822"
      ]
    },
    {
      "hadith_no": "4756",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا حميد بن مسعدة، وإسماعيل بن مسعود، قالا حدثنا بشر، عن حميد، قال ذكر أنس أن عمته، كسرت ثنية جارية فقضى نبي الله صلى الله عليه وسلم بالقصاص فقال أخوها أنس بن النضر أتكسر ثنية فلانة لا والذي بعثك بالحق لا تكسر ثنية فلانة ‏.‏ قال وكانوا قبل ذلك سألوا أهلها العفو والأرش فلما حلف أخوها - وهو عم أنس وهو الشهيد يوم أحد - رضي القوم بالعفو ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن من عباد الله من لو أقسم على الله لأبره ‏\"‏ ‏.‏",
      "text_en": " Anas narrated that:                     his paternal aunt broke the front tooth of a girl and the Prophet of Allah decreed retaliation. Her brother, Anas bin An-Nadr, said: \"Will you break the from tooth of so and so? No, by the One Who sent you with the truth, the front tooth of so and so will not be broken!\" Before that, they had asked her family for forgiveness and blood money. When her brother- who was the paternal uncle of Anas and was martyred at Ubud-swore that oath, the people agreed to forgive. The Prophet said: \"There are among the slaves of Allah who, if they swear by Allah who, if they swear by Allah, Allah fulfills their oath.",
      "chain": [
        "30430",
        "34033",
        "20212",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "4796",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر بن المفضل، عن خالد الحذاء، عن القاسم بن ربيعة، عن يعقوب بن أوس، عن رجل، من أصحاب النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم لما دخل مكة يوم الفتح قال ‏\"‏ ألا وإن كل قتيل خطإ العمد أو شبه العمد قتيل السوط والعصا منها أربعون في بطونها أولادها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ya'qub bin Aws, from a man among the Companions of the Prophet that:                     when the Messenger of Allah entered Makkah on the Day of the Conquest, he said: \"Indeed, every accidental killing on purpose, or resembling on purpose - killing with a whip or stick, for it are forty (she-camels) which their young in their wombs.\"",
      "chain": [
        "34033",
        "20212",
        "11282",
        "14317"
      ]
    },
    {
      "hadith_no": "4970",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا بشر، قال حدثنا يحيى بن سعيد، أن رجلا، من قومه حدثه عن عم، له أن رافع بن خديج، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا قطع في ثمر ولا كثر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi bin Khadij said:                     \"I heard the Messenger of Allah say: 'The hand is not to be cut off for (stealing) produce or the spadix of palm trees.\"'",
      "chain": [
        "30153",
        "20212",
        "11062",
        "1986"
      ]
    },
    {
      "hadith_no": "5013",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا حميد بن مسعدة قال حدثنا بشر يعني ابن المفضل قال حدثنا شعبة عن قتادة أنه سمع أنسا يقول  قال رسول الله صلى الله عليه وسلم لا يؤمن أحدكم حتى أكون أحب إليه من ولده ووالده والناس أجمعين",
      "text_en": " It was narrated from Qatadah that:                     He heard Anas say: \"The Messenger of Allah [SAW] said: 'None of you has believed until I am dearer to him than his son, his father and all the people.'\"",
      "chain": [
        "30430",
        "20212",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "5016",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا إسحق بن إبراهيم قال حدثنا النضر قال حدثنا شعبة ح وأنبأنا حميد بن مسعدة قال حدثنا بشر قال حدثنا شعبة عن قتادة قال سمعت أنسا يقول  قال رسول الله صلى الله عليه وسلم وقال حميد بن مسعدة في حديثه إن نبي الله صلى الله عليه وسلم قال لا يؤمن أحدكم حتى يحب لأخيه ما يحب لنفسه",
      "text_en": " It was narrated that Qatadah said:                     \"I heard Anas say: 'The Messenger of Allah [SAW] said (Humaid bin Mas'dah said in his Hadith: 'The Prophet of Allah [SAW] said): None of you has believed until he loves for his brother what he loves for himself.'\"",
      "chain": [
        "20291",
        "20020",
        "30430",
        "20212",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "5043",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا حميد بن مسعدة، عن بشر، قال حدثنا عبد الرحمن بن إسحاق، عن سعيد المقبري، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خمس من الفطرة الختان وحلق العانة ونتف الضبع وتقليم الظفر وتقصير الشارب ‏\"‏ ‏.‏ وقفه مالك ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah [SAW] said: 'Five things are of the Fitrah: Circumcision, shaving the pubes, plucking the armpit hair, clipping the nails and trimming the mustache.'\"",
      "chain": [
        "30430",
        "20212",
        "11876",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "5178",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر، - وهو ابن المفضل - قال حدثنا عبيد الله، عن نافع، عن ابن حنين، مولى علي عن علي، رضى الله عنه قال نهاني رسول الله صلى الله عليه وسلم عن أربع عن التختم بالذهب وعن لبس القسي وعن قراءة القرآن وأنا راكع وعن لبس المعصفر ‏.‏ ووافقه أيوب إلا أنه لم يسم المولى ‏.‏",
      "text_en": " It was narrated from Ibn Hunain, the freed slave of 'Ali, that 'Ali said:                     \"The Messenger of Allah [SAW] forbade me from four: Gold rings, wearing Al-Qassi, reciting Qur'an while I am bowing, and from wearing garments dyed with safflower.\"",
      "chain": [
        "34033",
        "20212",
        "11201",
        "11014",
        "5"
      ]
    },
    {
      "hadith_no": "5201",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا حميد بن مسعدة، عن بشر، - وهو ابن المفضل - قال حدثنا شعبة، عن قتادة، عن أنس، قال أراد رسول الله صلى الله عليه وسلم أن يكتب إلى الروم فقالوا إنهم لا يقرءون كتابا إلا مختوما ‏.‏ فاتخذ خاتما من فضة كأني أنظر إلى بياضه في يده ونقش فيه محمد رسول الله ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"The Messenger of Allah [SAW] wanted to write to the Romans, but they (the Companions) said: 'They do not read any letter unless it has a seal.' So he took a ring of silver, and it is as if I can see its whiteness on his hand, and on it were engraved (the words): \"Muhammad Rasul Allah (Muhammad the Messenger of Allah).\"",
      "chain": [
        "30430",
        "20212",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "5212",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا بشر، قال حدثنا عاصم بن كليب، عن أبي بردة، عن علي، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ قل اللهم اهدني وسددني ‏\"‏ ‏.‏ ونهاني أن أضع الخاتم في هذه وهذه وأشار بشر بالسبابة والوسطى ‏.‏ قال وقال عاصم أحدهما ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"The Messenger of Allah [SAW] said to me: 'Say: O Allah, guide me and make me steadfast,' and he forbade me to put a ring on this one and this one\" - and Bishr (one of the narrators) pointed to his forefinger and middle finger. And 'Asim said: \"One of the two of them.\"",
      "chain": [
        "34033",
        "20212",
        "10778",
        "11901",
        "5"
      ]
    },
    {
      "hadith_no": "5265",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى، ويزيد، ومعتمر، وبشر بن المفضل، قالوا حدثنا عبيد الله، عن نافع، عن سعيد بن أبي هند، عن أبي موسى، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الله عز وجل أحل لإناث أمتي الحرير والذهب وحرمه على ذكورها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Musa that:                     The Messenger of Allah [SAW] said: \"Allah has permitted silk and gold to the females of my Ummah, and has forbidden them to the males.\"",
      "chain": [
        "30153",
        "20031",
        "20472",
        "20288",
        "20212",
        "11201",
        "11014",
        "11427",
        "41"
      ]
    },
    {
      "hadith_no": "5278",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا حميد بن مسعدة، عن بشر، - وهو ابن المفضل - قال حدثنا شعبة، عن قتادة، عن أنس، قال أراد رسول الله صلى الله عليه وسلم أن يكتب إلى الروم فقالوا إنهم لا يقرءون كتابا إلا مختوما ‏.‏ فاتخذ خاتما من فضة كأني أنظر إلى بياضه في يده ونقش فيه محمد رسول الله ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"The Messenger of Allah [SAW] wanted to write to the Romans, and they (the Companions) said: 'They do not read any letter unless it has a seal.' So he took a ring of silver and it is as if I can see its whiteness on his hand, and engraved on it (were the words): 'Muhammad Rasul Allah.'\"",
      "chain": [
        "30430",
        "20212",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "5327",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا الليث، عن نافع، ح وأنبأنا إسماعيل بن مسعود، قال حدثنا بشر، قال حدثنا عبيد الله، عن نافع، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من جر ثوبه - أو قال إن الذي يجر ثوبه - من الخيلاء لم ينظر الله إليه يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"The Messenger of Allah [SAW] said: 'Whoever drags his garment out of pride, Allah will not look at him on the Day of Resurrection.'\"",
      "chain": [
        "30367",
        "20023",
        "11014",
        "34033",
        "20212",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5451",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا حميد بن مسعدة، قال حدثنا بشر، عن حميد، قال قال أنس كان النبي صلى الله عليه وسلم يدعو ‏\"‏ اللهم إني أعوذ بك من الكسل والهرم والجبن والبخل وفتنة الدجال وعذاب القبر ‏\"‏ ‏.‏",
      "text_en": " Anas said:                     \"The Prophet [SAW] used to say in his supplication: 'Allahumma inni a'udhu bika minal-kasali, wal-harami, wal-jubni, wal-bukhli, wa fitnatid-dajjali, wa 'adhabil-qabr (O Allah, I seek refuge in You from laziness, old age, cowardice, miserliness, the tribulation of the Dajjal and the torment of the grave.)\"",
      "chain": [
        "30430",
        "20212",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "859",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، حدثنا عبد الله بن إدريس، ح وحدثنا بشر بن معاذ الضرير، حدثنا بشر بن المفضل، قالا حدثنا عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال رأيت النبي  صلى الله عليه وسلم  يصلي فأخذ شماله بيمينه ‏.‏",
      "text_en": " It wasnarrated that Wa’il bin Hujr said:                      “I saw the Prophet (ﷺ)performing prayer, and he took hold of his left hand with his right.”",
      "chain": [
        "38409",
        "20102",
        "34041",
        "20212",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "916",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بشر بن معاذ الضرير، حدثنا بشر بن المفضل، حدثنا عاصم بن كليب، عن أبيه، عن وائل بن حجر، قال قلت لأنظرن إلى رسول الله  صلى الله عليه وسلم  كيف يصلي فقام فاستقبل القبلة فرفع يديه حتى حاذتا أذنيه فلما ركع رفعهما مثل ذلك فلما رفع رأسه من الركوع رفعهما مثل ذلك ‏.‏",
      "text_en": " It wasnarrated that Wa’il bin Hujr said:                      “I said: ‘I will look attheMessenger of Allah (ﷺ) and see how he performs the prayer.’ Hestood up and faced the Qiblah, and raised his hands until they wereparallel to his ears. When he bowed, he raised them likewise, andwhenhe raised his head from Ruku’, he raised them likewise.”",
      "chain": [
        "34041",
        "20212",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "1086",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا إسحاق بن إبراهيم بن حبيب، حدثنا بشر بن المفضل، عن غالب القطان، عن بكر بن عبد الله، عن أنس بن مالك، قال كنا نصلي مع النبي  صلى الله عليه وسلم  في شدة الحر فإذا لم يقدر أحدنا أن يمكن جبهته بسط ثوبه فسجد عليه ‏.‏",
      "text_en": " It wasnarrated that Anas bin Malik said:                      “We used to perform prayerwiththe Prophet (ﷺ) when it was very hot. When one of us could notplace his forehead firmly on the ground, he would spread his garmentand prostrates on it.”",
      "chain": [
        "34027",
        "20212",
        "11299",
        "11267",
        "19"
      ]
    },
    {
      "hadith_no": "1157",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا عبد الرزاق، أنبأنا معمر، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، ح وحدثنا يحيى بن خلف أبو سلمة، حدثنا بشر بن المفضل، عن عبيد الله، عن نافع، عن ابن عمر، أن النبي  صلى الله عليه وسلم  كان يخطب خطبتين يجلس بينهما جلسة ‏.‏ زاد بشر وهو قائم ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Umar that the Prophet (ﷺ) used to delivertwosermons, and he would sit briefly between the two. (One of thenarrators) Bishr added:                      “While he was standing.”",
      "chain": [
        "30277",
        "20121",
        "20115",
        "11201",
        "11014",
        "18",
        "30460",
        "20212",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1602",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن خلف، ومحمد بن زياد، قالا حدثنا بشر بن المفضل، ح وحدثنا عمرو بن رافع، حدثنا هشيم، جميعا عن يونس، عن أبي قلابة، عن أبي المهلب، عن عمران بن الحصين، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إن أخاكم النجاشي قد مات فصلوا عليه ‏\"‏ ‏.‏ قال فقام فصلينا خلفه وإني لفي الصف الثاني فصلى عليه ‏.‏",
      "text_en": " It wasnarrated from ‘Imran bin Husain:                      “The Messenger of Allah (ﷺ)said: ‘Your brother Najashi has died, so offer the funeral prayerforhim.” Then he stood and we prayed behind him. I was in thesecond rowand two rows prayed for him.”",
      "chain": [
        "30460",
        "11216",
        "20212",
        "18792",
        "20468",
        "20475",
        "11047"
      ]
    },
    {
      "hadith_no": "2072",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا يحيى بن خلف أبو سلمة، حدثنا بشر بن المفضل، عن عبد الرحمن بن إسحاق، عن الزهري، عن سالم، عن أبيه، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ الشؤم في ثلاثة في الفرس والمرأة والدار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Salim, from his father, that:                     the Messenger of Allah said: \"Omens are only to be found in three things: a horse, a woman and a house.\" (Sahih)(One of the narrators) Az-Zuhri said: \" Abu 'Ubaidah bin 'Abdullah bin Zam'ah said that his mother, Zainab, narrated to him, from Umm Salamah, that she used to list these three, and add to them \"the sword.\"",
      "chain": [
        "30460",
        "20212",
        "11876",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "3550",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا بشر بن المفضل، حدثنا سعيد، عن قتادة، عن أنس، أن رسول الله  صلى الله عليه وسلم  نهى عن الشرب قائما ‏.‏",
      "text_en": " It wasnarrated from Anas that the Messenger of Allah (ﷺ) forbadedrinkingwhile standing up.",
      "chain": [
        "30430",
        "20212",
        "11168",
        "11019",
        "19"
      ]
    }
  ],
  "total_hadiths": 169
}