{
  "id": "20219",
  "name": "Hajjaj bin al-Minhal حجاج بن المنهال",
  "full_name": "Hajjaj bin al-Minhal حجاج بن المنهال",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "217",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Salmi",
      "Client",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "34245",
      "name": "Muhammad bin al-Minhal al-'Attar محمد بن المنهال العطار البصري الأنماطي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20026",
      "name": "'Abdul 'Aziz bin 'Abdullah al-Majashun عبد العزيز بن عبد الله الماجشون",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20297",
      "name": "Hmam bin Yahya bin Dinar همام بن يحيى بن دينار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20303",
      "name": "Yazid bin Ibrahim al-Tstry يزيد بن إبراهيم التستري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30160",
      "name": "Muhammad bin Bashar Bindar محمد بن بشار بندار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30272",
      "name": "Muhammad bin 'Abdul Rahim bin Abi Zuhayr محمد بن عبد الرحيم بن أبي زهير البزاز",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30553",
      "name": "'Abd bin Hameed bin Nasr عبد بن حميد بن نصر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30313",
      "name": "Ishaq bin Mansur al-Kausaj إسحاق بن منصور بن بهرام - الكوسج",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38433",
      "name": "'Amr bin Mnswr al-Nsa'iy عمرو بن منصور النسائي أبو سعيد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "34121",
      "name": "'Abdullah bin al-Haytham bin 'Uthman عبد الله بن الهيثم بن عثمان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30148",
      "name": "Abd al-Qdws bin Muhammad عبد القدوس بن محمد بن عبد الكبير",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38684",
      "name": "Hilal bin al-'Ala' bin Hilal bin 'Umar هلال بن العلاء بن هلال بن عمر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38719",
      "name": "Y'aqub bin Sufyan يعقوب بن سفيان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "25197",
      "name": "'Ali bin Gharab علي بن غراب",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "55",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا حجاج بن منهال، قال حدثنا شعبة، قال أخبرني عدي بن ثابت، قال سمعت عبد الله بن يزيد، عن أبي مسعود، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أنفق الرجل على أهله يحتسبها فهو له صدقة ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Mas'ud:                          The Prophet said, \"If a man spends on his family (with the intention      of having a reward from Allah) sincerely for Allah's sake then it is a     (kind of) alms-giving in reward for him.",
      "chain": [
        "20219",
        "20020",
        "11372",
        "1945",
        "402"
      ]
    },
    {
      "hadith_no": "121",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا حجاج، قال حدثنا شعبة، قال أخبرني علي بن مدرك، عن أبي زرعة، عن جرير، أن النبي صلى الله عليه وسلم قال له في حجة الوداع ‏\"‏ استنصت الناس ‏\"‏ فقال ‏\"‏ لا ترجعوا بعدي كفارا يضرب بعضكم رقاب بعض ‏\"‏‏.‏",
      "text_en": " Narrated Jarir:                     The Prophet said to me during Hajjat-al-Wida`: Let the people keep quiet and listen. Then he said (addressing the people), \"Do not (become infidels) revert to disbelief after me by striking the necks (cutting the throats) of one another (killing each other).",
      "chain": [
        "20219",
        "20020",
        "11377",
        "11406",
        "4057"
      ]
    },
    {
      "hadith_no": "339",
      "source": " Sahih Bukhari ",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا حجاج، قال أخبرنا شعبة، أخبرني الحكم، عن ذر، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، قال عمار بهذا، وضرب شعبة بيديه الأرض، ثم أدناهما من فيه، ثم مسح وجهه وكفيه‏.‏ وقال النضر أخبرنا شعبة عن الحكم قال سمعت ذرا يقول عن ابن عبد الرحمن بن أبزى قال الحكم وقد سمعته من ابن عبد الرحمن عن أبيه قال قال عمار‏.‏",
      "text_en": " Narrated Sa`id bin `Abdur Rahman bin Abza:                     (on the authority of his father who said) `Ammar said so (the above Statement). And Shu`ba stroked lightly the earth with his hands and brought them close to his mouth (blew off the dust) and passed them over his face and then the backs of his hands. `Ammar said, \"Ablution (meaning Tayammum here) is sufficient for a Muslim if water is not available.\"",
      "chain": [
        "20219",
        "20020",
        "11069",
        "11423",
        "11346",
        "4046",
        "20291",
        "20020",
        "11069",
        "11423",
        "11346"
      ]
    },
    {
      "hadith_no": "691",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا حجاج بن منهال، قال حدثنا شعبة، عن محمد بن زياد، سمعت أبا هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ أما يخشى أحدكم  أو لا يخشى أحدكم  إذا رفع رأسه قبل الإمام أن يجعل الله رأسه رأس حمار أو يجعل الله صورته صورة حمار ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Isn't he who raises his head before the Imam afraid that Allah may transform his head into that of a donkey or his figure (face) into that of a donkey?\"",
      "chain": [
        "20219",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "747",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا حجاج، حدثنا شعبة، قال أنبأنا أبو إسحاق، قال سمعت عبد الله بن يزيد، يخطب قال حدثنا البراء، وكان، غير كذوب أنهم كانوا إذا صلوا مع النبي صلى الله عليه وسلم فرفع رأسه من الركوع قاموا قياما حتى يرونه قد سجد‏.‏",
      "text_en": " Narrated Al-Bara:                     (And Al-Bara was not a liar) Whenever we offered prayer with the Prophet and he raised his head from the bowing, we used to remain standing till we saw him prostrating .",
      "chain": [
        "20219",
        "20020",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "951",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا حجاج، قال حدثنا شعبة، قال أخبرني زبيد، قال سمعت الشعبي، عن البراء، قال سمعت النبي صلى الله عليه وسلم يخطب فقال ‏\"‏ إن أول ما نبدأ من يومنا هذا أن نصلي، ثم نرجع فننحر، فمن فعل فقد أصاب سنتنا ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara':                     I heard the Prophet (p.b.u.h) delivering a Khutba saying, \"The first thing to be done on this day (first day of `Id ul Adha) is to pray; and after returning from the prayer we slaughter our sacrifices (in the name of Allah) and whoever does so, he acted according to our Sunna (traditions).\"",
      "chain": [
        "20219",
        "20020",
        "11335",
        "11052",
        "400"
      ]
    },
    {
      "hadith_no": "1336",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، قال حدثني سليمان الشيباني، قال سمعت الشعبي، قال أخبرني من، مر مع النبي صلى الله عليه وسلم على قبر منبوذ فأمهم وصلوا خلفه‏.‏ قلت من حدثك هذا يا أبا عمرو قال ابن عباس  رضى الله عنهما ‏.‏",
      "text_en": " Narrated Sulaiman Ash-Shaibani:                     I heard Ash-Shu`bi saying, \"I was told by a man who had passed with the Prophet (p.b.u.h) by a grave that was separate from the other graves that he (the Prophet ) led them in the prayer and they prayed behind him.\" I said, \"O Abu `Amr! Who narrated that to you?\" He replied, \"Ibn `Abbas.\"",
      "chain": [
        "20219",
        "20020",
        "11352",
        "11052"
      ]
    },
    {
      "hadith_no": "1418",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا حجاج، حدثنا حماد بن زيد، حدثنا أبو جمرة، قال سمعت ابن عباس  رضى الله عنهما  يقول قدم وفد عبد القيس على النبي صلى الله عليه وسلم فقالوا يا رسول الله إن هذا الحى من ربيعة قد حالت بيننا وبينك كفار مضر، ولسنا نخلص إليك إلا في الشهر الحرام، فمرنا بشىء نأخذه عنك، وندعو إليه من وراءنا‏.‏ قال ‏\"‏ آمركم بأربع، وأنهاكم عن أربع الإيمان بالله وشهادة أن لا إله إلا الله  وعقد بيده هكذا  وإقام الصلاة، وإيتاء الزكاة، وأن تؤدوا خمس ما غنمتم، وأنهاكم عن الدباء والحنتم والنقير والمزفت ‏\"‏‏.‏ وقال سليمان وأبو النعمان عن حماد ‏\"‏ الإيمان بالله شهادة أن لا إله إلا الله ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A delegation of the tribe of `Abdul Qais came to the Prophet and said, \"O Allah's Apostle! We are from the tribe of Rabi`a, and the infidels of the tribe of Mudar stands between us and you; so we cannot come to you except during the Sacred Months. Please order us to do something (religious deeds) which we may carry out and also invite to it our people whom we have left behind.\" The Prophet said, \"I order you to do four things and forbid you four others: (I order you) to have faith in Allah, and confess that none has the right to be worshipped but Allah, (and the Prophet gestured with his hand like this (i.e. one knot) and to offer prayers perfectly and to pay the Zakat, and to pay onefifth of the booty in Allah's Cause. And I forbid you to use Dubba', Hantam, Naqir and Muzaffat (all these are the names of utensils used for preparing alcoholic drinks).\"",
      "chain": [
        "20219",
        "20022",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "1500",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، أخبرني محمد بن زياد، قال سمعت أبا هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ليس المسكين الذي ترده الأكلة والأكلتان، ولكن المسكين الذي ليس له غنى ويستحيي أو لا يسأل الناس إلحافا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The poor person is not the one who asks a morsel or two (of meals) from the others, but the poor is the one who has nothing and is ashamed to beg from others.\"",
      "chain": [
        "20219",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "1510",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا حجاج، حدثنا شعبة، أخبرني عبد الله بن دينار، سمعت ابن عمر  رضى الله عنهما  نهى النبي صلى الله عليه وسلم عن بيع الثمرة حتى يبدو صلاحها‏.‏ وكان إذا سئل عن صلاحها قال حتى تذهب عاهته‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet had forbidden the sale of dates till they were good (ripe), and when it was asked what it meant, the Prophet said, \"Till there is no danger of blight.\"",
      "chain": [
        "20219",
        "20020",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "1710",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، عن أبي إسحاق، سمعت عمرو بن ميمون، يقول شهدت عمر  رضى الله عنه  صلى بجمع الصبح، ثم وقف فقال إن المشركين كانوا لا يفيضون حتى تطلع الشمس، ويقولون أشرق ثبير‏.‏ وأن النبي صلى الله عليه وسلم خالفهم، ثم أفاض قبل أن تطلع الشمس‏.‏",
      "text_en": " Narrated `Amr bin Maimun:                     I saw `Umar, offering the Fajr (morning) prayer at Jam'; then he got up and said, \"The pagans did not use to depart (from Jam') till the sun had risen, and they used to say, 'Let the sun shine on Thabir (a mountain).' But the Prophet contradicted them and departed from Jam' before sunrise.\"",
      "chain": [
        "20219",
        "20020",
        "11049",
        "11382"
      ]
    },
    {
      "hadith_no": "1916",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا هشيم، قال أخبرني حصين بن عبد الرحمن، عن الشعبي، عن عدي بن حاتم  رضى الله عنه  قال لما نزلت ‏{‏حتى يتبين لكم الخيط الأبيض من الخيط الأسود‏}‏ عمدت إلى عقال أسود وإلى عقال أبيض، فجعلتهما تحت وسادتي، فجعلت أنظر في الليل، فلا يستبين لي، فغدوت على رسول الله صلى الله عليه وسلم فذكرت له ذلك فقال ‏\"‏ إنما ذلك سواد الليل وبياض النهار ‏\"‏‏.‏",
      "text_en": " Narrated `Adi bin Hatim:                     When the above verses were revealed: 'Until the white thread appears to you, distinct from the black thread,' I took two (hair) strings, one black and the other white, and kept them under my pillow and went on looking at them throughout the night but could not make anything out of it. So, the next morning I went to Allah's Apostle and told him the whole story. He explained to me, \"That verse means the darkness of the night and the whiteness of the dawn.\"",
      "chain": [
        "20219",
        "20468",
        "15097",
        "11052",
        "212"
      ]
    },
    {
      "hadith_no": "1995",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، حدثنا عبد الملك بن عمير، قال سمعت قزعة، قال سمعت أبا سعيد الخدري  رضى الله عنه  وكان غزا مع النبي صلى الله عليه وسلم ثنتى عشرة غزوة قال سمعت أربعا من النبي صلى الله عليه وسلم فأعجبنني قال ‏\"‏ لا تسافر المرأة مسيرة يومين إلا ومعها زوجها أو ذو محرم، ولا صوم في يومين الفطر والأضحى، ولا صلاة بعد الصبح حتى تطلع الشمس، ولا بعد العصر حتى تغرب، ولا تشد الرحال إلا إلى ثلاثة مساجد مسجد الحرام، ومسجد الأقصى، ومسجدي هذا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     (who fought in twelve Ghazawat in the company of the Prophet). I heard four things from the Prophet and they won my admiration. He said; -1. \"No lady should travel on a journey of two days except with her husband or a Dhi-Mahram; -2. \"No fasting is permissible on the two days of Id-ul-Fitr and `Id-ul-Adha; -3. \"No prayer (may be offered) after the morning compulsory prayer until the sun rises; and no prayer after the `Asr prayer till the sun sets; -4. \"One should travel only for visiting three Masjid (Mosques): Masjid-al-Haram (Mecca), Masjid-al- Aqsa (Jerusalem), and this (my) Mosque (at Medina).",
      "chain": [
        "20219",
        "20020",
        "11368",
        "38"
      ]
    },
    {
      "hadith_no": "2238",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، قال أخبرني عون بن أبي جحيفة، قال رأيت أبي اشترى حجاما، فسألته عن ذلك،‏.‏ قال إن رسول الله صلى الله عليه وسلم نهى عن ثمن الدم، وثمن الكلب، وكسب الأمة، ولعن الواشمة والمستوشمة، وآكل الربا، وموكله، ولعن المصور‏.‏",
      "text_en": " Narrated `Aun bin Abu Juhaifa:                     I saw my father buying a slave whose profession was cupping, and ordered that his instruments (of cupping) be broken. I asked him the reason for doing so. He replied, \"Allah's Apostle prohibited taking money for blood, the price of a dog, and the earnings of a slave-girl by prostitution; he cursed her who tattoos and her who gets tattooed, the eater of Riba (usury), and the maker of pictures.\"",
      "chain": [
        "20219",
        "20020",
        "11383"
      ]
    },
    {
      "hadith_no": "2259",
      "source": " Sahih Bukhari ",
      "chapter": "Shuf'a - كتاب الشفعة",
      "chapter_no": "36",
      "text_ar": "حدثنا حجاج، حدثنا شعبة، ح وحدثني علي بن عبد الله، حدثنا شبابة، حدثنا شعبة، حدثنا أبو عمران، قال سمعت طلحة بن عبد الله، عن عائشة  رضى الله عنها  قلت يا رسول الله، إن لي جارين، فإلى أيهما أهدي قال ‏\"‏ إلى أقربهما منك بابا ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     I said, \"O Allah's Apostle! I have two neighbors and would like to know to which of them I should give presents.\" He replied, \"To the one whose door is nearer to you.\"",
      "chain": [
        "20219",
        "20020",
        "30026",
        "20426",
        "20020",
        "11296",
        "53"
      ]
    },
    {
      "hadith_no": "2557",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، قال أخبرني محمد بن زياد، سمعت أبا هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم ‏\"‏ إذا أتى أحدكم خادمه بطعامه، فإن لم يجلسه معه، فليناوله لقمة أو لقمتين أو أكلة أو أكلتين، فإنه ولي علاجه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"When your servant brings your meals to you then if he does not let him sit and share the meals, then he should at least give him a mouthful or two mouthfuls of that meal or a meal or two meals, as he has prepared it.\"",
      "chain": [
        "20219",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "2614",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، قال أخبرني عبد الملك بن ميسرة، قال سمعت زيد بن وهب، عن علي  رضى الله عنه  قال أهدى إلى النبي صلى الله عليه وسلم حلة سيراء فلبستها، فرأيت الغضب في وجهه، فشققتها بين نسائي‏.‏",
      "text_en": " Narrated `Ali:                     The Prophet gave me a silken dress as a gift and I wore it. When I saw the signs of anger on his face, I cut it into pieces and distributed it among my wives.\"",
      "chain": [
        "20219",
        "20020",
        "11369",
        "11341",
        "5"
      ]
    },
    {
      "hadith_no": "2637",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا حجاج، حدثنا عبد الله بن عمر النميري، حدثنا يونس،‏.‏ وقال الليث حدثني يونس، عن ابن شهاب، قال أخبرني عروة، وابن المسيب، وعلقمة بن وقاص، وعبيد الله، عن حديث، عائشة  رضى الله عنها  وبعض حديثهم يصدق بعضا، حين قال لها أهل الإفك، فدعا رسول الله صلى الله عليه وسلم عليا وأسامة حين استلبث الوحى يستأمرهما في فراق أهله، فأما أسامة فقال أهلك ولا نعلم إلا خيرا‏.‏ وقالت بريرة إن رأيت عليها أمرا أغمصه أكثر من أنها جارية حديثة السن تنام عن عجين أهلها، فتأتي الداجن فتأكله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ من يعذرنا من رجل بلغني أذاه في أهل بيتي فوالله ما علمت من أهلي إلا خيرا، ولقد ذكروا رجلا ما علمت عليه إلا خيرا ‏\"‏‏.‏",
      "text_en": " Narrated `Urwa bin Al-Musaiyab Alqama bin Waqqas and Ubaidullah bin `Abdullah:                     About the story of `Aisha and their narrations were similar attesting each other, when the liars said what they invented about `Aisha, and the Divine Inspiration was delayed, Allah's Apostle sent for `Ali and Usama to consult them in divorcing his wife (i.e. `Aisha). Usama said, \"Keep your wife, as we know nothing about her except good.\" Buraira said, \"I cannot accuse her of any defect except that she is still a young girl who sleeps, neglecting her family's dough which the domestic goats come to eat (i.e. she was too simpleminded to deceive her husband).\" Allah's Apostle said, \"Who can help me to take revenge over the man who has harmed me by defaming the reputation of my family? By Allah, I have not known about my family-anything except good, and they mentioned (i.e. accused) a man about whom I did not know anything except good.\"",
      "chain": [
        "20219",
        "20434",
        "20023",
        "20475",
        "11013",
        "10511",
        "11002",
        "11042",
        "11201"
      ]
    },
    {
      "hadith_no": "2879",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا عبد الله بن عمر النميري، حدثنا يونس، قال سمعت الزهري، قال سمعت عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله، عن حديث، عائشة، كل حدثني طائفة، من الحديث قالت كان النبي صلى الله عليه وسلم إذا أراد أن يخرج أقرع بين نسائه، فأيتهن يخرج سهمها خرج بها النبي صلى الله عليه وسلم، فأقرع بيننا في غزوة غزاها، فخرج فيها سهمي، فخرجت مع النبي صلى الله عليه وسلم بعد ما أنزل الحجاب‏.‏",
      "text_en": " Narrated `Aisha:                     Whenever the Prophet intended to proceed on a journey, he used to draw lots amongst his wives and would take the one upon whom the lot fell. Once, before setting out for Jihad, he drew lots amongst us and the lot came to me; so I went with the Prophet; and that happened after the revelation of the Verse Hijab (i.e. veiling).",
      "chain": [
        "20219",
        "20434",
        "20475",
        "11013",
        "10511",
        "11002",
        "11042",
        "11004"
      ]
    },
    {
      "hadith_no": "3243",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا همام، قال سمعت أبا عمران الجوني، يحدث عن أبي بكر بن عبد الله بن قيس الأشعري، عن أبيه، أن النبي صلى الله عليه وسلم قال ‏\"‏ الخيمة درة مجوفة، طولها في السماء ثلاثون ميلا، في كل زاوية منها للمؤمن أهل لا يراهم الآخرون ‏\"‏‏.‏ قال أبو عبد الصمد والحارث بن عبيد عن أبي عمران ستون ميلا‏.‏",
      "text_en": " Narrated `Abdullah bin Qais Al-Ash`ari:                     The Prophet said, \"A tent (in Paradise) is like a hollow pearl which is thirty miles in height and on every corner of the tent the believer will have a family that cannot be seen by the others.\" (Narrated Abu `Imran in another narration, \"The tent is sixty miles in height.\")",
      "chain": [
        "20219",
        "20297",
        "11296"
      ]
    },
    {
      "hadith_no": "3255",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، قال عدي بن ثابت أخبرني قال سمعت البراء  رضى الله عنه  عن النبي صلى الله عليه وسلم قال لما مات إبراهيم قال ‏\"‏ إن له مرضعا في الجنة ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara (bin Azib):                     The Prophet, after the death of his son Ibrahim, said, \"There is a wet-nurse for him (i.e. Ibrahim) in Paradise.\"",
      "chain": [
        "20219",
        "20020",
        "11372",
        "400"
      ]
    },
    {
      "hadith_no": "3463",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني محمد، قال حدثني حجاج، حدثنا جرير، عن الحسن، حدثنا جندب بن عبد الله، في هذا المسجد، وما نسينا منذ حدثنا، وما نخشى أن يكون جندب كذب على رسول الله صلى الله عليه وسلم، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كان فيمن كان قبلكم رجل به جرح، فجزع فأخذ سكينا فحز بها يده، فما رقأ الدم حتى مات، قال الله تعالى بادرني عبدي بنفسه، حرمت عليه الجنة ‏\"‏‏.‏",
      "text_en": " Narrated Jundub:                     Allah's Apostle said, \"Amongst the nations before you there was a man who got a wound, and growing impatient (with its pain), he took a knife and cut his hand with it and the blood did not stop till he died. Allah said, 'My Slave hurried to bring death upon himself so I have forbidden him (to enter) Paradise.' \"",
      "chain": [
        "30213",
        "20219",
        "20028",
        "11016"
      ]
    },
    {
      "hadith_no": "3723",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا عبد العزيز الماجشون، حدثنا محمد بن المنكدر، عن جابر بن عبد الله  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم ‏\"‏ رأيتني دخلت الجنة، فإذا أنا بالرميصاء امرأة أبي طلحة وسمعت خشفة، فقلت من هذا فقال هذا بلال‏.‏ ورأيت قصرا بفنائه جارية، فقلت لمن هذا فقال لعمر‏.‏ فأردت أن أدخله فأنظر إليه، فذكرت غيرتك ‏\"‏‏.‏ فقال عمر بأمي وأبي يا رسول الله أعليك أغار",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet said, \"I saw myself (in a dream) entering Paradise, and behold! I saw Ar-Rumaisa', Abu Talha's wife. I heard footsteps. I asked, Who is it? Somebody said, 'It is Bilal ' Then I saw a palace and a lady sitting in its courtyard. I asked, 'For whom is this palace?' Somebody replied, 'It is for `Umar.' I intended to enter it and see it, but I thought of your (`Umar's) Ghira (and gave up the attempt).\" `Umar said, \"Let my parents be sacrificed for you, O Allah's Apostle! How dare I think of my Ghira (self-respect) being offended by you?",
      "chain": [
        "20219",
        "20026",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "3794",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا حجاج بن المنهال، حدثنا شعبة، قال أخبرني عدي، قال سمعت البراء  رضى الله عنه  قال رأيت النبي صلى الله عليه وسلم والحسن على عاتقه يقول ‏\"‏ اللهم إني أحبه فأحبه ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara:                     I saw the Prophet carrying Al-Hasan on his shoulder an saying, \"O Allah! I love him, so please love him.\"",
      "chain": [
        "20219",
        "20020",
        "11372",
        "400"
      ]
    },
    {
      "hadith_no": "3829",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، قال أخبرني عدي بن ثابت، قال سمعت البراء  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم أو قال قال النبي صلى الله عليه وسلم ‏\"‏ الأنصار لا يحبهم إلا مؤمن، ولا يبغضهم إلا منافق، فمن أحبهم أحبه الله، ومن أبغضهم أبغضه الله ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara:                     I heard the Prophet saying (or the Prophet said), \"None loves the Ansar but a believer, and none hates them but a hypocrite. So Allah will love him who loves them, and He will hate him who hates them.\"",
      "chain": [
        "20219",
        "20020",
        "11372",
        "400"
      ]
    },
    {
      "hadith_no": "4075",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا الحجاج بن منهال، حدثنا عبد الله بن عمر النميري، حدثنا يونس بن يزيد، قال سمعت الزهري، قال سمعت عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله، عن حديث، عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم كل  حدثني طائفة من الحديث  قالت فأقبلت أنا وأم مسطح فعثرت أم مسطح في مرطها فقالت تعس مسطح‏.‏ فقلت بئس ما قلت، تسبين رجلا شهد بدرا فذكر حديث الإفك‏.‏",
      "text_en": " Narrated Yunus bin Yazid:                     I heard Az-Zuhri saying, \"I heard `Urwa bin Az-Zubair. Sa`id bin Al-Musaiyab, 'Alqama bin Waqqas and 'Ubaidullah bin `Abdullah each narrating part of the narrative concerning `Aisha the wife of the Prophet. `Aisha said: When I and Um Mistah were returning, Um Mistah stumbled by treading on the end of her robe, and on that she said, 'May Mistah be ruined.' I said, 'You have said a bad thing, you curse a man who took part in the battle of Badr!.\" Az-Zuhri then narrated the narration of the Lie (forged against `Aisha).",
      "chain": [
        "20219",
        "20434",
        "20475",
        "11013",
        "10511",
        "11002",
        "11042",
        "11004"
      ]
    },
    {
      "hadith_no": "4173",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا الحجاج بن منهال، أخبرنا شعبة، قال أخبرني عدي، أنه سمع البراء  رضى الله عنه  قال قال النبي صلى الله عليه وسلم لحسان ‏\"‏ اهجهم  أو هاجهم  وجبريل معك ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara:                     The Prophet said to Hassan, \"Abuse them (with your poems), and Gabriel is with you (i.e, supports you).\" (Through another group of sub narrators) Al-Bara bin Azib said, \"On the day of Quraiza's (besiege), Allah's Apostle said to Hassan bin Thabit, 'Abuse them (with your poems), and Gabriel is with you (i.e. supports you).' \"",
      "chain": [
        "20219",
        "20020",
        "11372",
        "400"
      ]
    },
    {
      "hadith_no": "4270",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، قال أخبرني عدي بن ثابت، عن البراء، وعبد الله بن أبي أوفى، رضى الله عنهم أنهم كانوا مع النبي صلى الله عليه وسلم فأصابوا حمرا فطبخوها، فنادى منادي النبي صلى الله عليه وسلم أكفئوا القدور‏.‏",
      "text_en": " Narrated Al-Bara and `Abdullah bin Abl `Aufa:                     That when they were in the company of the Prophet, they got some donkeys which they (slaughtered and) cooked. Then the announcer of the Prophet said, \"Turn the cooking pots upside down (i.e. throw out the meat).",
      "chain": [
        "20219",
        "20020",
        "11372",
        "400",
        "5115"
      ]
    },
    {
      "hadith_no": "4591",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا أبو عوانة، عن الأعمش، عن أبي وائل، عن عبد الله بن مسعود  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف يمين صبر ليقتطع بها مال امرئ مسلم، لقي الله وهو عليه غضبان ‏\"‏‏.‏ فأنزل الله تصديق ذلك ‏{‏إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا أولئك لا خلاق لهم في الآخرة‏}‏ إلى آخر الآية‏.‏       قال فدخل الأشعث بن قيس وقال ما يحدثكم أبو عبد الرحمن قلنا كذا وكذا‏.‏ قال في أنزلت كانت لي بئر في أرض ابن عم لي قال النبي صلى الله عليه وسلم ‏\"‏ بينتك أو يمينه ‏\"‏ فقلت إذا يحلف يا رسول الله‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ من حلف على يمين صبر يقتطع بها مال امرئ مسلم وهو فيها فاجر، لقي الله وهو عليه غضبان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Wail:                     `Abdullah bin Masud said, \"Allah's Apostle said, 'Whoever takes an oath when asked to do so, in which he may deprive a Muslim of his property unlawfully, will meet Allah Who will be angry with him.' So Allah revealed in confirmation of this statement:--\"Verily! Those who Purchase a small gain at the cost of Allah's Covenant and oaths, they shall have no portion in the Hereafter...\" (3.77) Then entered Al-Ash'ath bin Qais and said, \"What is Abu `Abdur-Rahman narrating to you?\" We replied, 'So-and-so.\" Al-Ash'ath said, \"This Verse was revealed in my connection. I had a well in the land of my cousin (and he denied my, possessing it). On that the Prophet said to me, 'Either you bring forward a proof or he (i.e. your cousin) takes an oath (to confirm his claim)' I said, 'I am sure he would take a (false) oath, O Allah's Apostle.' He said, 'If somebody takes an oath when asked to do so through which he may deprive a Muslim of his property (unlawfully) and he is a liar in his oath, he will meet Allah Who will be angry with him.' \"",
      "chain": [
        "20219",
        "20469",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "4642",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن مقاتل أبو الحسن، أخبرنا حجاج، عن ابن جريج، قال أخبرني يعلى، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  ‏{‏إن كان بكم أذى من مطر أو كنتم مرضى‏}‏ قال عبد الرحمن بن عوف كان جريحا‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Regarding the Verse: \"Because of the inconvenience of rain or because you are ill.\" (4.102) (It was revealed in connection with) `Abdur-Rahman bin `Auf who was wounded.",
      "chain": [
        "30118",
        "20219",
        "11070",
        "20372",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "4711",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني عبد الله بن محمد، قال حدثني يحيى بن معين، حدثنا حجاج، قال ابن جريج قال ابن أبي مليكة وكان بينهما شىء فغدوت على ابن عباس فقلت أتريد أن تقاتل ابن الزبير، فتحل حرم الله‏.‏ فقال معاذ الله، إن الله كتب ابن الزبير وبني أمية محلين، وإني والله لا أحله أبدا‏.‏ قال قال الناس بايع لابن الزبير‏.‏ فقلت وأين بهذا الأمر عنه أما أبوه فحواري النبي صلى الله عليه وسلم، يريد الزبير، وأما جده فصاحب الغار، يريد أبا بكر، وأمه فذات النطاق، يريد أسماء، وأما خالته فأم المؤمنين، يريد عائشة، وأما عمته فزوج النبي صلى الله عليه وسلم، يريد خديجة، وأما عمة النبي صلى الله عليه وسلم فجدته، يريد صفية، ثم عفيف في الإسلام، قارئ للقرآن‏.‏ والله إن وصلوني وصلوني من قريب، وإن ربوني ربني أكفاء كرام، فآثر التويتات والأسامات والحميدات، يريد أبطنا من بني أسد بني تويت وبني أسامة وبني أسد، إن ابن أبي العاص برز يمشي القدمية، يعني عبد الملك بن مروان، وإنه لوى ذنبه، يعني ابن الزبير‏.‏",
      "text_en": " Narrated Ibn Abi Mulaika:                     There was a disagreement between them (i.e. Ibn `Abbas and Ibn Az-Zubair) so I went to Ibn `Abbas in the morning and said (to him), \"Do you want to fight against Ibn Zubair and thus make lawful what Allah has made unlawful (i.e. fighting in Meccas?\" Ibn `Abbas said, \"Allah forbid! Allah ordained that Ibn Zubair and Bani Umaiya would permit (fighting in Mecca), but by Allah, I will never regard it as permissible.\" Ibn `Abbas added. \"The people asked me to take the oath of allegiance to Ibn AzZubair. I said, 'He is really entitled to assume authority for his father, Az-Zubair was the helper of the Prophet, his (maternal) grandfather, Abu Bakr was (the Prophet's) companion in the cave, his mother, Asma' was 'Dhatun-Nitaq', his aunt, `Aisha was the mother of the Believers, his paternal aunt, Khadija was the wife of the Prophet , and the paternal aunt of the Prophet was his grandmother. He himself is pious and chaste in Islam, well versed in the Knowledge of the Qur'an. By Allah! (Really, I left my relatives, Bani Umaiya for his sake though) they are my close relatives, and if they should be my rulers, they are equally apt to be so and are descended from a noble family.",
      "chain": [
        "30351",
        "30020",
        "20219",
        "11070",
        "11090"
      ]
    },
    {
      "hadith_no": "4727",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحسن بن محمد بن صباح، حدثنا حجاج، قال قال ابن جريج أخبرني محمد بن عباد بن جعفر، أنه سمع ابن عباس، يقرأ ‏{‏ألا إنهم تثنوني صدورهم‏}‏ قال سألته عنها فقال أناس كانوا يستحيون أن يتخلوا فيفضوا إلى السماء، وأن يجامعوا نساءهم فيفضوا إلى السماء، فنزل ذلك فيهم‏.‏",
      "text_en": " Narrated Muhammad bin `Abbas bin Ja`far:                     That he heard Ibn `Abbas reciting: \"No doubt! They fold up their breasts.\" (11.5) and asked him about its explanation. He said, \"Some people used to hide themselves while answering the call of nature in an open space lest they be exposed to the sky, and also when they had sexual relation with their wives in an open space lest they be exposed to the sky, so the above revelation was sent down regarding them.\"",
      "chain": [
        "30245",
        "20219",
        "11070",
        "11262"
      ]
    },
    {
      "hadith_no": "4790",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا هشيم، أخبرنا أبو هاشم، عن أبي مجلز، عن قيس بن عباد، عن أبي ذر  رضى الله عنه  أنه كان يقسم فيها إن هذه الآية ‏{‏هذان خصمان اختصموا في ربهم‏}‏ نزلت في حمزة وصاحبيه، وعتبة وصاحبيه يوم برزوا في يوم بدر رواه سفيان عن أبي هاشم‏.‏ وقال عثمان عن جرير عن منصور عن أبي هاشم عن أبي مجلز قوله‏.‏",
      "text_en": " Narrated Qais bin Ubad:                     Abu Dharr used to take an oath confirming that the Verse: 'These two opponents (believers, and disbelievers) dispute with each other about their Lord.' (22.19) was Revealed in connection with Hamza and his two companions and `Utbah and his two companions on the day when they ease out of the battle of Badr.",
      "chain": [
        "20219",
        "20468",
        "11454",
        "11313",
        "11609",
        "23"
      ]
    },
    {
      "hadith_no": "4791",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا معتمر بن سليمان، قال سمعت أبي قال، حدثنا أبو مجلز، عن قيس بن عباد، عن علي بن أبي طالب  رضى الله عنه  قال أنا أول، من يجثو بين يدى الرحمن للخصومة يوم القيامة‏.‏ قال قيس وفيهم نزلت ‏{‏هذان خصمان اختصموا في ربهم‏}‏ قال هم الذين بارزوا يوم بدر علي وحمزة وعبيدة وشيبة بن ربيعة وعتبة بن ربيعة والوليد بن عتبة‏.‏",
      "text_en": " Narrated Qais bin Ubad:                     `Ali said, \"I will be the first to kneel before the Beneficent on the Day of Resurrection because of the dispute.\" Qais said; This Verse: 'These two opponents (believers and disbelievers dispute with each other about their Lord,' (22.19) was revealed in connection with those who came out for the Battle of Badr, i.e. `Ali, Hamza, 'Ubaida, Shaiba bin Rabi`a, `Utba bin Rabi`a and Al-Walid bin `Utba.",
      "chain": [
        "20219",
        "20288",
        "11289",
        "11313",
        "11609",
        "5"
      ]
    },
    {
      "hadith_no": "4868",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا سفيان بن عيينة، عن عمرو، عن عطاء، عن صفوان بن يعلى، عن أبيه، قال سمعت النبي صلى الله عليه وسلم يقرأ على المنبر ‏{‏ونادوا يا مالك ليقض علينا ربك‏}‏ وقال قتادة مثلا للآخرين عظة‏.‏ وقال غيره ‏{‏مقرنين‏}‏ ضابطين يقال فلان مقرن لفلان ضابط له والأكواب الأباريق التي لا خراطيم لها ‏{‏أول العابدين‏}‏ أى ما كان فأنا أول الأنفين وهما لغتان رجل عابد وعبد وقرأ عبد الله ‏{‏وقال الرسول يا رب‏}‏ ويقال أول العابدين الجاحدين من عبد يعبد‏.‏ وقال قتادة ‏{‏في أم الكتاب‏}‏ جملة الكتاب أصل الكتاب ‏{‏أفنضرب عنكم الذكر صفحا أن كنتم قوما مسرفين‏}‏ مشركين‏.‏ والله لو أن هذا القرآن رفع حيث رده أوائل هذه الأمة لهلكوا ‏{‏فأهلكنا أشد منهم بطشا ومضى مثل الأولين‏}‏ عقوبة الأولين ‏{‏جزءا‏}‏ عدلا‏.‏",
      "text_en": " Narrated Ya`la:                     I heard the Prophet reciting when on the pulpit: 'They will cry, \"O Malik (Keeper of Hell) Let your Lord make an end of us.' (43.77)",
      "chain": [
        "20219",
        "20005",
        "11081",
        "11029",
        "11248",
        "897"
      ]
    },
    {
      "hadith_no": "4896",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحسن بن محمد، حدثنا حجاج، عن ابن جريج، قال أخبرني ابن أبي مليكة، أن عبد الله بن الزبير، أخبرهم أنه، قدم ركب من بني تميم على النبي صلى الله عليه وسلم فقال أبو بكر أمر القعقاع بن معبد‏.‏ وقال عمر بل أمر الأقرع بن حابس‏.‏ فقال أبو بكر ما أردت إلى  أو إلا  خلافي‏.‏ فقال عمر ما أردت خلافك‏.‏ فتماريا حتى ارتفعت أصواتهما، فنزل في ذلك ‏{‏يا أيها الذين آمنوا لا تقدموا بين يدى الله ورسوله‏}‏ حتى انقضت الآية‏.‏",
      "text_en": " Narrated `Abdullah bin Az-Zubair:                     A group of Bani Tamim came to the Prophet (and requested him to appoint a governor for them). Abu Bakr said, \"Appoint Al-Qaqa bin Mabad.\" `Umar said, \"Appoint Al-Aqra' bin Habeas.\" On that Abu Bakr said (to `Umar). \"You did not want but to oppose me!\" `Umar replied \"I did not intend to oppose you!\" So both of them argued till their voices grew loud. So the following Verse was revealed: 'O you who believe! Be not for ward......' (49.1)",
      "chain": [
        "30245",
        "20219",
        "11070",
        "11090",
        "106"
      ]
    },
    {
      "hadith_no": "5003",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، قال أخبرني عدي، قال سمعت البراء  رضى الله عنه  أن النبي صلى الله عليه وسلم كان في سفر فقرأ في العشاء في إحدى الركعتين بالتين والزيتون‏.‏ ‏{‏تقويم‏}‏ الخلق‏.‏",
      "text_en": " Narrated Al-Bara:                     While the Prophet was on a journey, he recited Surat at-Tini waz-Zaituni (95) in one of the first two rak`at of the `Isha prayer.",
      "chain": [
        "20219",
        "20020",
        "11372",
        "400"
      ]
    },
    {
      "hadith_no": "5079",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، قال أخبرني علقمة بن مرثد، سمعت سعد بن عبيدة، عن أبي عبد الرحمن السلمي، عن عثمان  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ خيركم من تعلم القرآن وعلمه ‏\"‏‏.‏ قال وأقرأ أبو عبد الرحمن في إمرة عثمان حتى كان الحجاج، قال وذاك الذي أقعدني مقعدي هذا‏.‏",
      "text_en": " Narrated `Uthman:                     The Prophet said, \"The best among you (Muslims) are those who learn the Qur'an and teach it.\"",
      "chain": [
        "20219",
        "20020",
        "11374",
        "11344",
        "11359",
        "4"
      ]
    },
    {
      "hadith_no": "5087",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، قال أخبرني أبو إياس، قال سمعت عبد الله بن مغفل، قال رأيت رسول الله صلى الله عليه وسلم يوم فتح مكة وهو يقرأ على راحلته سورة الفتح‏.‏",
      "text_en": " Narrated `Abdullah bin Mughaffal:                     I saw Allah's Apostle reciting Surat-al-Fath on his she-camel on the day of the Conquest of Mecca.",
      "chain": [
        "20219",
        "20020",
        "11306",
        "3242"
      ]
    },
    {
      "hadith_no": "5313",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا همام بن يحيى، عن قتادة، عن أبي غلاب، يونس بن جبير قال قلت لابن عمر رجل طلق امرأته وهى حائض‏.‏ فقال تعرف ابن عمر إن ابن عمر طلق امرأته وهى حائض فأتى عمر النبي صلى الله عليه وسلم فذكر ذلك له فأمره أن يراجعها فإذا طهرت فأراد أن يطلقها فليطلقها، قلت فهل عد ذلك طلاقا قال أرأيت إن عجز واستحمق‏.‏",
      "text_en": " Narrated Abi Ghallab Yunus bin Jubair:                     I asked Ibn `Umar,\"(What is said regarding) a man divorces his wife during her period?\" He said, \"Do you know Ibn `Umar? Ibn `Umar divorced his wife while she was menstruating. `Umar then went to the Prophet and mentioned that to him. The Prophet ordered him to take her back and when she became clean, he could divorce her if he wanted.\" I asked (Ibn `Umar), \"Was that divorce counted as one legal divorce?\" He said, \"If one becomes helpless and foolish (will he be excused? Of course not). \"",
      "chain": [
        "20219",
        "20297",
        "11019"
      ]
    },
    {
      "hadith_no": "5322",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثني الحسن بن محمد بن صباح، حدثنا حجاج، عن ابن جريج، قال زعم عطاء أنه سمع عبيد بن عمير، يقول سمعت عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم كان يمكث عند زينب ابنة جحش، ويشرب عندها عسلا، فتواصيت أنا وحفصة أن أيتنا دخل عليها النبي صلى الله عليه وسلم فلتقل إني أجد منك ريح مغافير، أكلت مغافير فدخل على إحداهما فقالت له ذلك، فقال ‏\"‏ لا بل شربت عسلا عند زينب ابنة جحش ولن أعود له ‏\"‏‏.‏ فنزلت ‏{‏يا أيها النبي لم تحرم ما أحل الله لك‏}‏ إلى ‏{‏إن تتوبا إلى الله‏}‏ لعائشة وحفصة ‏{‏وإذ أسر النبي إلى بعض أزواجه‏}‏ لقوله ‏\"‏ بل شربت عسلا ‏\"‏‏.‏",
      "text_en": " Narrated `Ubaid bin `Umar:                     I heard `Aisha saying, \"The Prophet used to stay for a long while with Zanab bint Jahsh and drink honey at her house. So Hafsa and I decided that if the Prophet came to anyone of us, she should say him, \"I detect the smell of Maghafir (a nasty smelling gum) in you. Have you eaten Maghafir?' \" So the Prophet visited one of them and she said to him similarly. The Prophet said, \"Never mind, I have taken some honey at the house of Zainab bint Jahsh, but I shall never drink of it anymore.\" So there was revealed: 'O Prophet ! Why do you ban (for you) that which Allah has made lawful for you . . . If you two (wives of Prophet) turn in repentance to Allah,' (66.1-4) addressing Aisha and Hafsa. 'When the Prophet disclosed a matter in confidence to some of his wives.' (66.3) namely his saying: But I have taken some honey.\"",
      "chain": [
        "30245",
        "20219",
        "11070",
        "11259",
        "53"
      ]
    },
    {
      "hadith_no": "5387",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا حجاج، حدثنا يزيد بن إبراهيم، حدثنا محمد بن سيرين، حدثني يونس بن جبير، سألت ابن عمر فقال طلق ابن عمر امرأته وهى حائض، فسأل عمر النبي صلى الله عليه وسلم فأمره أن يراجعها، ثم يطلق من قبل عدتها، قلت فتعتد بتلك التطليقة قال أرأيت إن عجز واستحمق‏.‏",
      "text_en": " Narrated Yunus Ibn Jubair:                     Ibn `Umar divorced his wife while she was having her menses. `Umar asked the Prophet who said, \"Order him (your son) to take her back, and then divorced her before her period of the 'Iddah has elapsed.\" I asked Ibn `Umar, \"Will that divorce (during the menses) be counted?\" He replied, \"If somebody behaves foolishly (will his foolishness be an excuse for his misbehavior)?\"",
      "chain": [
        "20219",
        "20303",
        "11035",
        "11320"
      ]
    },
    {
      "hadith_no": "5420",
      "source": " Sahih Bukhari ",
      "chapter": "Supporting the Family - كتاب النفقات",
      "chapter_no": "69",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، قال أخبرني عبد الملك بن ميسرة، قال سمعت زيد بن وهب، عن علي  رضى الله عنه  قال آتى إلى النبي صلى الله عليه وسلم حلة سيراء فلبستها، فرأيت الغضب في وجهه فشققتها بين نسائي‏.‏",
      "text_en": " Narrated `Ali:                     The Prophet gave me a silk suit and I wore it, but when I noticed anger on his face, I cut it and distributed it among my women-folk.",
      "chain": [
        "20219",
        "20020",
        "11369",
        "11341",
        "5"
      ]
    },
    {
      "hadith_no": "5528",
      "source": " Sahih Bukhari ",
      "chapter": "Sacrifice on Occasion of Birth (`Aqiqa) - كتاب العقيقة",
      "chapter_no": "71",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن أيوب، عن محمد، عن سلمان بن عامر، قال مع الغلام عقيقة‏.‏ وقال حجاج حدثنا حماد أخبرنا أيوب وقتادة وهشام وحبيب عن ابن سيرين عن سلمان عن النبي صلى الله عليه وسلم‏.‏ وقال غير واحد عن عاصم، وهشام، عن حفصة بنت سيرين، عن الرباب، عن سلمان، عن النبي صلى الله عليه وسلم‏.‏ ورواه يزيد بن إبراهيم عن ابن سيرين عن سلمان قوله‏.‏ وقال أصبغ أخبرني ابن وهب عن جرير بن حازم عن أيوب السختياني عن محمد بن سيرين حدثنا سلمان بن عامر الضبي قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ مع الغلام عقيقة، فأهريقوا عنه دما وأميطوا عنه الأذى ‏\"‏‏.‏",
      "text_en": " Narrated Salman bin 'Amir Ad-Dabbi:                     I heard Allah's Apostle saying, \"'Aqiqa is to be offered for a (newly born) boy, so slaughter (an animal) for him, and relieve him of his suffering.\" (Note: It has been quoted in Fath-ul-Bari that the majority of the Religious Scholars agrees to the Hadith narrated in Sahih at-TlRMlZY that the Prophet was asked about Aqiqa and he ordered 2 sheep for a boy and one sheep for a girl and that is his tradition \"SUNNA\".)",
      "chain": [
        "20283",
        "20022",
        "11015",
        "20278",
        "20219",
        "20022",
        "11035"
      ]
    },
    {
      "hadith_no": "5575",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، قال أخبرني عدي بن ثابت، قال سمعت عبد الله بن يزيد، عن النبي صلى الله عليه وسلم أنه نهى عن النهبة والمثلة‏.‏",
      "text_en": " Narrated `Abdullah bin Yazid:                     The Prophet forbade An-Nuhba and Al-Muthla.",
      "chain": [
        "20219",
        "20020",
        "11372",
        "1945"
      ]
    },
    {
      "hadith_no": "5619",
      "source": " Sahih Bukhari ",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا حجاج بن المنهال، حدثنا شعبة، قال أخبرني زبيد، قال سمعت الشعبي، عن البراء  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يخطب فقال ‏\"‏ إن أول ما نبدأ من يومنا هذا أن نصلي، ثم نرجع فننحر، فمن فعل هذا فقد أصاب سنتنا، ومن نحر فإنما هو لحم يقدمه لأهله، ليس من النسك في شىء ‏\"‏‏.‏ فقال أبو بردة يا رسول الله ذبحت قبل أن أصلي، وعندي جذعة خير من مسنة‏.‏ فقال ‏\"‏ اجعلها مكانها، ولن تجزي أو توفي عن أحد بعدك ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara':                     I heard the Prophet delivering a sermon, and he said (on the Day of `Id-Allah. a), \"The first thing we will do on this day of ours is that we will offer the `Id prayer, then we will return and slaughter our sacrifices; and whoever does so, then indeed he has followed our tradition, and whoever slaughtered his sacrifice (before the prayer), what he offered was just meat that he presented to his family, and that was not a sacrifice.\" Abu Burda got up and said, \"O Allah's Apostle! I slaughtered the sacrifice before the prayer and I have got a Jadha'a which is better than an old sheep.\" The Prophet said, \"Slaughter it to make up for that, but it will not be sufficient for anybody else after you.\"",
      "chain": [
        "20219",
        "20020",
        "11335",
        "11052",
        "400"
      ]
    },
    {
      "hadith_no": "5623",
      "source": " Sahih Bukhari ",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا همام، عن قتادة، حدثنا أنس  رضى الله عنه  أن النبي صلى الله عليه وسلم كان يضحي بكبشين أملحين أقرنين، ووضع رجله على صفحتهما، ويذبحهما بيده‏.‏",
      "text_en": " Narrated Anas:                     The Prophet used to offer as sacrifices, two horned rams, black and white in color, and used to put his foot on their sides and slaughter them with his own hands.",
      "chain": [
        "20219",
        "20297",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "5716",
      "source": " Sahih Bukhari ",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، قال أخبرني عاصم، قال سمعت أبا عثمان، عن أسامة بن زيد  رضى الله عنهما  أن ابنة للنبي، صلى الله عليه وسلم أرسلت إليه وهو مع النبي صلى الله عليه وسلم وسعد وأبى نحسب أن ابنتي قد حضرت فاشهدنا فأرسل إليها السلام ويقول ‏\"‏ إن لله ما أخذ وما أعطى وكل شىء عنده مسمى فلتحتسب ولتصبر ‏\"‏‏.‏ فأرسلت تقسم عليه، فقام النبي صلى الله عليه وسلم وقمنا، فرفع الصبي في حجر النبي صلى الله عليه وسلم ونفسه تقعقع ففاضت عينا النبي صلى الله عليه وسلم فقال له سعد ما هذا يا رسول الله قال ‏\"‏ هذه رحمة وضعها الله في قلوب من شاء من عباده، ولا يرحم الله من عباده إلا الرحماء ‏\"‏‏.‏",
      "text_en": " Narrated Abu `Uthman:                     Usama bin Zaid said that while he. Sa`d and Ubai bin Ka`b were with the Prophet a daughter of the Prophet sent a message to him, saying. 'My daughter is dying; please come to us.\" The Prophet sent her his greetings and added \"It is for Allah what He takes, and what He gives; and everything before His sight has a limited period. So she should hope for Allah's reward and remain patient.\" She again sent a message, beseeching him by Allah, to come. So the Prophet got up. and so did we (and went there). The child was placed on his lap while his breath was irregular. Tears flowed from the eyes of the Prophet. Sa`d said to him, \"What is this, O Allah's Apostle?\" He said. \"This Is Mercy which Allah has embedded in the hearts of whomever He wished of His slaves. And Allah does not bestow His Mercy, except on the merciful among His slaves. (See Hadith No. 373 Vol. 2)",
      "chain": [
        "20219",
        "20020",
        "11080",
        "11113",
        "50"
      ]
    },
    {
      "hadith_no": "5915",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا شعبة، قال أخبرني أشعث بن سليم، سمعت أبي يحدث، عن مسروق، عن عائشة  رضى الله عنها  قالت كان النبي صلى الله عليه وسلم يحب التيمن في طهوره وترجله وتنعله‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to like starting from the right in performing ablution, combing his hair and putting on his shoes.",
      "chain": [
        "20219",
        "20020",
        "11324",
        "11351",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "5918",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا همام، عن قتادة، حدثنا أنس  رضى الله عنه  أن نعل، النبي صلى الله عليه وسلم كان لها قبالان‏.‏",
      "text_en": " Narrated Anas:                     The sandal of the Prophet had two straps.",
      "chain": [
        "20219",
        "20297",
        "11019",
        "19"
      ]
    }
  ],
  "total_hadiths": 241
}