{
  "id": "20214",
  "name": "Bahz bin Asad al-'Ami",
  "full_name": "Bahz bin Asad al-'Ami (بهز بن أسد العمي)",
  "grade": "Thiqah (Trustworthy)",
  "biography": {
    "birth": {
      "date_hijri": "",
      "date_gregorian": "",
      "date_display": null,
      "place": ""
    },
    "death": {
      "date_hijri": "",
      "date_gregorian": "",
      "date_display": null,
      "place": "",
      "reason": ""
    },
    "places_of_stay": [],
    "area_of_interest": [],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "3832",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا يعقوب بن إبراهيم بن كثير، حدثنا بهز بن أسد، حدثنا شعبة، قال أخبرني هشام بن زيد، قال سمعت أنس بن مالك  رضى الله عنه  قال جاءت امرأة من الأنصار إلى رسول الله صلى الله عليه وسلم ومعها صبي لها، فكلمها رسول الله صلى الله عليه وسلم فقال ‏\"‏ والذي نفسي بيده، إنكم أحب الناس إلى ‏\"‏‏.‏ مرتين‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Once an Ansari woman, accompanied by a son of hers, came to Allah's Apostle. Allah's Apostle spoke to her and said twice, \"By Him in Whose Hand my life is, you are the most beloved people to me.\"",
      "chain": [
        "20184",
        "20214",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "hadith_no": "6049",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثني عبد الرحمن، حدثنا بهز، حدثنا شعبة، حدثنا ابن عثمان بن عبد الله بن موهب، وأبوه، عثمان بن عبد الله أنهما سمعا موسى بن طلحة، عن أبي أيوب الأنصاري  رضى الله عنه أن رجلا قال يا رسول الله أخبرني بعمل يدخلني الجنة‏.‏ فقال القوم ماله ماله فقال رسول الله صلى الله عليه وسلم ‏\"‏ أرب ماله ‏\"‏‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ تعبد الله لا تشرك به شيئا، وتقيم الصلاة، وتؤتي الزكاة، وتصل الرحم، ذرها ‏\"‏‏.‏ قال كأنه كان على راحلته‏.‏",
      "text_en": " Narrated Abu Aiyub Al-Ansari:                     A man said, \"O Allah's Apostle! Inform me of a deed which will make me enter Paradise.\" The people said, \"What is the matter with him? What is the matter with him?\" Allah's Apostle said, \"He has something to ask (what he needs greatly).\" The Prophet said (to him), (In order to enter Paradise) you should worship Allah and join none in worship with Him: You should offer prayers perfectly, give obligatory charity (Zakat), and keep good relations with your Kith and kin.\" He then said, \"Leave it!\" (The sub-narrator said, \"It seems that the Prophet was riding his she camel.\"",
      "chain": [
        "20033",
        "20214",
        "20020",
        "579",
        "33"
      ]
    },
    {
      "hadith_no": "112",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني عبد الله بن هاشم العبدي، حدثنا بهز، حدثنا سليمان بن المغيرة، عن ثابت، قال قال أنس كنا نهينا في القرآن أن نسأل رسول الله صلى الله عليه وسلم عن شىء ‏.‏ وساق الحديث بمثله ‏.‏",
      "text_en": " It is narrated on the authority of Thabit that Anas said:                      We were forbidden in the Holy Qur'an that we should ask about anything from the Messenger of Allah (may peace be upon him) and then Anas reported the hadith in similar words.",
      "chain": [
        "30550",
        "20214",
        "20236",
        "11269"
      ]
    },
    {
      "hadith_no": "114",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني محمد بن حاتم، وعبد الرحمن بن بشر، قالا حدثنا بهز، حدثنا شعبة، حدثنا محمد بن عثمان بن عبد الله بن موهب، وأبوه، عثمان أنهما سمعا موسى بن طلحة، يحدث عن أبي أيوب، عن النبي صلى الله عليه وسلم بمثل هذا الحديث ‏.‏",
      "text_en": " This hadith is transmitted by Muhammad b. Hatim on the authority of Abu Ayyub Ansari.",
      "chain": [
        "38487",
        "30356",
        "20214",
        "20020",
        "17668",
        "579",
        "33"
      ]
    },
    {
      "hadith_no": "159",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني أبو بكر بن نافع العبدي، حدثنا بهز، حدثنا حماد، حدثنا ثابت، عن أنس، قال حدثني عتبان بن مالك، أنه عمي فأرسل إلى رسول الله صلى الله عليه وسلم فقال تعال فخط لي مسجدا ‏.‏ فجاء رسول الله صلى الله عليه وسلم وجاء قومه ونعت رجل منهم يقال له مالك بن الدخشم ‏.‏ ثم ذكر نحو حديث سليمان بن المغيرة ‏.‏",
      "text_en": " It is narrated on the authority of Anas that 'Itban b. Malik told him that he became blind. He sent a message to the Messenger of Allah (may peace be upon him) that he should come and mark a place of worship for him. Thereupon came the Messenger of Allah (may peace be upon him) and his people and then there was a discussion among them about a man who was known as Malik b. Dukhshum, and subsequently the narrator described the hadith of Sulaiman b. Mughira as stated above.",
      "chain": [
        "20214",
        "20022",
        "11269",
        "19",
        "251"
      ]
    },
    {
      "hadith_no": "430",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني عبد الله بن هاشم العبدي، حدثنا بهز بن أسد، حدثنا سليمان بن المغيرة، حدثنا ثابت، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أتيت فانطلقوا بي إلى زمزم فشرح عن صدري ثم غسل بماء زمزم ثم أنزلت ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the the outhority of Anas b. Malik that the Messenger of Allah (may peace be upon him) said:                      (the angels) came to me and took me to the Zamzam and my heart was opened and washed with the water of Zamzam and then I was left (at my place).",
      "chain": [
        "30550",
        "20214",
        "20236",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "235",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا عبد الرحمن بن بشر العبدي، حدثنا بهز، حدثنا وهيب، حدثنا عمرو بن يحيى، بمثل إسنادهم واقتص الحديث وقال فيه فمضمض واستنشق واستنثر من ثلاث غرفات ‏.‏ وقال أيضا فمسح برأسه فأقبل به وأدبر مرة واحدة ‏.‏ قال بهز أملى على وهيب هذا الحديث ‏.‏ وقال وهيب أملى على عمرو بن يحيى هذا الحديث مرتين ‏.‏",
      "text_en": " Babz reported:                      This hadith has been narrated by Wuwb on the authority of 'Amr b. Yahyi with the same chain of transmitters and it has been mentioned therein: He rinsed his mouth. snuffed up water in nostrils and cleaned the nose with three handfuls and wiped his head moving (his hand) in front and then back once. Bahz said: Wuhaib narrated this hadith to me and Wuhaib said: Amr b. Yahya narrated to me this hadith twice.",
      "chain": [
        "30356",
        "20214",
        "20299",
        "11210"
      ]
    },
    {
      "hadith_no": "378",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا خالد الحذاء، بهذا الإسناد لما كثر الناس ذكروا أن يعلموا ‏.‏ بمثل حديث الثقفي غير أنه قال أن يوروا نارا ‏.‏",
      "text_en": " This hadith is transmitted by Khalid Hadhdha with the same chain of transmitters (and the words are):                      When the majority of the people discussed they should know, like the hadith narrated by al-Thaqafi (mentioned above) except for the words:\" They (the people) should kindle fire.\"",
      "chain": [
        "38487",
        "20214",
        "20299"
      ]
    },
    {
      "hadith_no": "473",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثني أبو بكر بن نافع العبدي، حدثنا بهز، حدثنا حماد، أخبرنا ثابت، عن أنس، قال ما صليت خلف أحد أوجز صلاة من صلاة رسول الله صلى الله عليه وسلم في تمام كانت صلاة رسول الله صلى الله عليه وسلم متقاربة وكانت صلاة أبي بكر متقاربة فلما كان عمر بن الخطاب مد في صلاة الفجر وكان رسول الله صلى الله عليه وسلم إذا قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ قام حتى نقول قد أوهم ‏.‏ ثم يسجد ويقعد بين السجدتين حتى نقول قد أوهم ‏.‏",
      "text_en": " Thabit reported it on the authority of Anas:                      I have never said such a light and perfect prayer as I said behind the Messenger of Allah (may peace be upon him). The prayer of the Messenger. of Allah (may peace be upon him) was well balanced. And so too was the prayer of Abu Bakr well balanced. When it was the time of 'Umar b. al-Khattab he prolonged the morning prayer. When the Messenger of Allah (may peace be upon him) said: Allah listened to him who praised Him, he stood erect till we said: He has forgotten. He then prostrated and sat between two prostration till we said: He has forgotten.",
      "chain": [
        "20214",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "490",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا عبد الله بن طاوس، عن طاوس، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أمرت أن أسجد على سبعة أعظم الجبهة - وأشار بيده على أنفه - واليدين والرجلين وأطراف القدمين ولا نكفت الثياب ولا الشعر ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas reported that the Messenger of Allah (may peace be upon him) said:                      I have been commanded to prostrate myself on seven bones:\" forehead,\" and then pointed with his hand towards his nose, hands, feet, and the extremities of the feet; and we were forbidden to fold back clothing and hair.",
      "chain": [
        "30514",
        "20214",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "503",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني محمد بن حاتم، حدثنا بهز، حدثنا عمر بن أبي زائدة، حدثنا عون بن أبي جحيفة، أن أباه، رأى رسول الله صلى الله عليه وسلم في قبة حمراء من أدم ورأيت بلالا أخرج وضوءا فرأيت الناس يبتدرون ذلك الوضوء فمن أصاب منه شيئا تمسح به ومن لم يصب منه أخذ من بلل يد صاحبه ثم رأيت بلالا أخرج عنزة فركزها وخرج رسول الله صلى الله عليه وسلم في حلة حمراء مشمرا فصلى إلى العنزة بالناس ركعتين ورأيت الناس والدواب يمرون بين يدى العنزة ‏.‏",
      "text_en": " Abu Juhaifa reported on the authority of his father:                      I saw the Messenger of Allah (may peace be upon him) (in Mecca at al-Abtah) in a red leather tent. and I saw Bilal take the ablution water (left by Allah's Messenger), and I saw the people racing, with one another to get that ablution water. If anyone got some of it, he rubbed himself with it, and anyone who did not get any got some of the moisture from his companion's hand. I then saw Bilal take a staff and fix it in the ground, after which the Messenger of Allah (may peace be upon him) came out quickly in a red mantle and led the people in two rak'ahs facing the staff, and I saw people and animals passing in front of the staff.",
      "chain": [
        "38487",
        "20214",
        "11643",
        "11383"
      ]
    },
    {
      "hadith_no": "1480",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني أبو بكر بن نافع العبدي، حدثنا بهز بن أسد العمي، حدثنا حماد بن سلمة، عن ثابت، ‏.‏ أنهم سألوا أنسا عن خاتم، رسول الله صلى الله عليه وسلم فقال أخر رسول الله صلى الله عليه وسلم العشاء ذات ليلة إلى شطر الليل أو كاد يذهب شطر الليل ثم جاء فقال ‏\"‏ إن الناس قد صلوا وناموا وإنكم لم تزالوا في صلاة ما انتظرتم الصلاة ‏\"‏ ‏.‏ قال أنس كأني أنظر إلى وبيص خاتمه من فضة ورفع إصبعه اليسرى بالخنصر ‏.‏",
      "text_en": " Thabit reported:                      They (the believers) asked Anas about the ring of the Messenger of Allah (may peace be upon him) and he said: One night the Messenger of Allah (may peace be upon him) delayed (observing) the 'Isya' prayer up to the midnight or midnight was about to be over. He then came and said: (Other) people have offered prayers and slept, but you are constantly in prayer as long as you wait for prayer. Anas said: I perceive as if I am seeing the lustre of his silver ring, and lifted his, small left finger (in order to show how the Holy Prophet had lifted it).",
      "chain": [
        "20214",
        "20021"
      ]
    },
    {
      "hadith_no": "1541",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا بهز، حدثنا حماد بن سلمة، عن ثابت، عن أبي رافع، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يزال العبد في صلاة ما كان في مصلاه ينتظر الصلاة وتقول الملائكة اللهم اغفر له اللهم ارحمه ‏.‏ حتى ينصرف أو يحدث ‏\"‏ ‏.‏ قلت ما يحدث قال يفسو أو يضرط ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The servant is constantly in prayer so long as he is in a place of worship waiting for the prayer (to be observed in congregation), and the angels invoke (blessings upon him in these words): O Allah! pardon him. O Allah! show mercy to him, (and they continue to do so) till he returns (from the mosque having completed the prayer) or his ablution breaks. I said: How is the ablution broken? He said: By breaking of the wind noiselessly or with noise.",
      "chain": [
        "38487",
        "20214",
        "20021",
        "11269",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "1580",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا بهز بن أسد، حدثنا حماد بن سلمة، أخبرنا أنس بن سيرين، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قنت شهرا بعد الركوع في صلاة الفجر يدعو على بني عصية ‏.‏",
      "text_en": " Anas b. Malik reported that the Messenger of Allah (may peace be upon him) observed Qunut for a month in the dawn prayer after ruku' and invoked curse upon Bani Usayya.",
      "chain": [
        "38487",
        "20214",
        "20021",
        "11038",
        "19"
      ]
    },
    {
      "hadith_no": "1730",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني عبد الرحمن بن بشر، وعبد الله بن هاشم العبدي، قالا حدثنا بهز، حدثنا شعبة، قال النعمان بن سالم أخبرني قال سمعت عمرو بن أوس، يحدث عن عنبسة، عن أم حبيبة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من عبد مسلم توضأ فأسبغ الوضوء ثم صلى لله كل يوم ‏\"‏ ‏.‏ فذكر بمثله ‏.‏",
      "text_en": " Umm Habiba reported the Messenger of Allah (may peace be upon him) having said:                      If any Muslim servant (of Allah) performed ablution, and performed it well, and then observed every day, the rest of the hadith is the same.",
      "chain": [
        "30356",
        "30550",
        "20214",
        "20020",
        "10972",
        "11437",
        "11716",
        "59"
      ]
    },
    {
      "hadith_no": "1862",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا موسى بن عقبة، قال سمعت أبا النضر، عن بسر بن سعيد، عن زيد بن ثابت، أن النبي صلى الله عليه وسلم اتخذ حجرة في المسجد من حصير فصلى رسول الله صلى الله عليه وسلم فيها ليالي حتى اجتمع إليه ناس ‏.‏ فذكر نحوه وزاد فيه ‏\"‏ ولو كتب عليكم ما قمتم به ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported that the Messenger of Allah (may peace be upon him) had a mat and he used it for making an apartment during the night and observed prayer in it, and the people began to pray with him, and he spread it (the mat) during the day time. The people crowded round him one night. He (the Holy Prophet) then Eaid:                      O people, perform such acts as you are capable of doing, for Allah does not grow weary but you will get tired. The acts most pleasing to Allah are those which are done continuously, even if they are small. And it was the habit of the members of Muhammad's (may peace be upon him) household that whenever they did an act they did it continuously.",
      "chain": [
        "38487",
        "20214",
        "20299",
        "11106",
        "20390",
        "11153",
        "49"
      ]
    },
    {
      "hadith_no": "1968",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا عبد الله بن طاوس، عن أبيه، عن عائشة، أنها قالت وهم عمر إنما نهى رسول الله صلى الله عليه وسلم أن يتحرى طلوع الشمس وغروبها ‏.‏",
      "text_en": " 'A'isha said that the Messenger of Allah (may peace be upon him) did not abandon observing two rak'ahs after 'Asr, but she reported Allah's Messenger (may peace be upon him) as saying:                      Do not get used to observe prayer at the time of the rising sun and at the time of its setting and (exhorted the Muslims) to pray at their times.",
      "chain": [
        "38487",
        "20214",
        "20299",
        "11433",
        "11053",
        "53"
      ]
    },
    {
      "hadith_no": "2000",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا عبد الله بن طاوس، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ حق لله على كل مسلم أن يغتسل في كل سبعة أيام يغسل رأسه وجسده ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that the Apostle of Allah (may peace be upon him) said. it is the right of Allah upon every Muslim that he should take a bath (at least) on one day (Friday) during the seven days (of the week) and he should wash his head and body.",
      "chain": [
        "30514",
        "20214",
        "20299",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "2235",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثني سهيل، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من صلى على جنازة ولم يتبعها فله قيراط فإن تبعها فله قيراطان ‏\"‏ ‏.‏ قيل وما القيراطان قال ‏\"‏ أصغرهما مثل أحد ‏\"‏ .‏",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace be upon him) as saying:                      He who offered prayer over the dead, but did not follow the bier, for him is the reward of one qirat, and he who followed it, for him is the reward of two qirats. It was asked what the qirats were. He said: The smaller amongst the two is equivalent to Uhud.",
      "chain": [
        "38487",
        "20214",
        "20299",
        "13"
      ]
    },
    {
      "hadith_no": "2297",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا موسى بن عقبة، عن عبد الواحد، عن عباد بن عبد الله بن الزبير، يحدث عن عائشة، أنها لما توفي سعد بن أبي وقاص أرسل أزواج النبي صلى الله عليه وسلم أن يمروا بجنازته في المسجد فيصلين عليه ففعلوا فوقف به على حجرهن يصلين عليه أخرج به من باب الجنائز الذي كان إلى المقاعد فبلغهن أن الناس عابوا ذلك وقالوا ما كانت الجنائز يدخل بها المسجد ‏.‏ فبلغ ذلك عائشة فقالت ما أسرع الناس إلى أن يعيبوا ما لا علم لهم به ‏.‏ عابوا علينا أن يمر بجنازة في المسجد وما صلى رسول الله صلى الله عليه وسلم على سهيل ابن بيضاء إلا في جوف المسجد ‏.‏",
      "text_en": " 'Abbad b. 'Abdullah b. Zubair reported on the authority of 'A'isha that when Sa'd b. Abu Waqqas died, the wives of the Apostle of Allah (may peace be upon him) sent message to bring his bier into the mosque so that they should offer prayer for him. They (the participants of the funeral) did accordingly, and it was placed in front of their apartments and they offered prayer for him. It was brought out of the door (known as) Bab al-Jana'iz which was towards the side of Maqa'id, and the news reached them (the wives of the Holy Prophet) that the people bad criticised this (i. e. offering of funeral prayer in the mosque) saying that it was not desirable to take the bier inside the mosque. This was conveyed to 'A'isha. She said:                      How hastily the people criticise that about which they know little. They criticise us for carrying the bier in the mosque. The Messenger of Allah (may peace be upon him) offered not the funeral prayer of Suhail b. Baida' but in the innermost part of the mosque.",
      "chain": [
        "30514",
        "20214",
        "20299",
        "11106",
        "20256",
        "11250",
        "53"
      ]
    },
    {
      "hadith_no": "2363",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني محمد بن حاتم، حدثنا بهز، حدثنا حماد بن سلمة، حدثنا ثابت، عن أنس، قال لما نزلت هذه الآية ‏{‏ لن تنالوا البر حتى تنفقوا مما تحبون‏}‏ قال أبو طلحة أرى ربنا يسألنا من أموالنا فأشهدك يا رسول الله أني قد جعلت أرضي بريحا لله ‏.‏ قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ اجعلها في قرابتك ‏\"‏ ‏.‏ قال فجعلها في حسان بن ثابت وأبى بن كعب ‏.‏",
      "text_en": " Anas reported that when this verse was tevealed:                     \" You will not attain righteousness till you give freely of what you love,\" Abu Talha said: I see that our Lord has demanded from us out of our property; so I make you a witness, Messenger of Allah. that I give my land known as Bairaha' for the sake of Allah. Upon this the Messenger of Allah (may peace be upon him) said: Give that to your relatives. So he gave it to Hassan b. Thabit and Ubayy b. Ka'b.",
      "chain": [
        "38487",
        "20214",
        "20021",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "2640",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا بهز بن أسد، حدثنا أبو بكر النهشلي، حدثنا زياد، بن علاقة عن عمرو بن ميمون، عن عائشة، رضى الله عنها قالت كان رسول الله صلى الله عليه وسلم يقبل في رمضان وهو صائم ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported that Allah's Messenger (may peace be upon him) kissed (his wives) during Ramadan while observing fast.",
      "chain": [
        "30514",
        "20214",
        "20619",
        "11339",
        "11382",
        "53"
      ]
    },
    {
      "hadith_no": "2852",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد يعني ابن جعفر، ح وحدثني أبو غسان الرازي، حدثنا بهز، قالا جميعا حدثنا شعبة، عن عمرو بن دينار، بهذا الإسناد أنه سمع النبي صلى الله عليه وسلم يخطب بعرفات ‏.‏ فذكر هذا الحديث ‏.‏",
      "text_en": " 'Amr b. Dinar narrated with the same chain of transmitters that he heard the Messenger of Allah (may peace be upon him) delivering sermon at 'Arafat, and he made a mention of this hadith (as quoted above).",
      "chain": [
        "30160",
        "20173",
        "20214",
        "20020",
        "11081"
      ]
    },
    {
      "hadith_no": "2978",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني أبو أيوب الغيلاني، حدثنا بهز، حدثنا حماد، عن عبد الرحمن، عن أبيه، عن عائشة، - رضى الله عنها - قالت لبينا بالحج حتى إذا كنا بسرف حضت فدخل على رسول الله صلى الله عليه وسلم وأنا أبكي ‏.‏ وساق الحديث بنحو حديث الماجشون ‏.‏ غير أن حمادا ليس في حديثه فكان الهدى مع النبي صلى الله عليه وسلم وأبي بكر وعمر وذوي اليسارة ثم أهلوا حين راحوا ولا قولها وأنا جارية حديثة السن أنعس فتصيب وجهي مؤخرة الرحل ‏.‏",
      "text_en": " A'isha (Allah be pleased with her) reported:                      We entered into the state of. Ihram for Hajj till we were at Sarif and I was in menses. The Messenger of Allah (may peace be upon him) came to me and I was weeping. The rest of the hadith is the same but (with this portion) that there were sacrificial animals with Allah's Apostle (may peace be upon him) and with Abu Bakr, Umar and with rich persons. And they pro- nounced Talbiya as they proceeded on. And there is no mention of this (too):\" I was a girl of tender age and I dozed off and my face touched the bind part of the Haudaj.\"",
      "chain": [
        "20214",
        "20022",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "2992",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا عبد الله بن طاوس، عن أبيه، عن عائشة، - رضى الله عنها - أنها أهلت بعمرة فقدمت ولم تطف بالبيت حتى حاضت فنسكت المناسك كلها ‏.‏ وقد أهلت بالحج ‏.‏ فقال لها النبي صلى الله عليه وسلم يوم النفر ‏\"‏ يسعك طوافك لحجك وعمرتك ‏\"‏ ‏.‏ فأبت فبعث بها مع عبد الرحمن إلى التنعيم فاعتمرت بعد الحج ‏.‏",
      "text_en": " A'isha (Allah be pleased with her) reported that she put on Ihram for, Umra and arrived 'at Mecca) but did not circumambulate the House as she had entered in the period of menses, and then put on Ihram for Hajj and performed all the rituals concerning it (except circumambulating the House). The Apostle of Allah (may peace be upon him) said to her on the day of march (when pilgrims come to Mina):                      Your circumambulation would suffice both Hajj and Umra. She, however, felt reluc- tant. Thereupon the Holy Prophet (may peace be upon him) sent her with 'Abd al- Rahman to Tan'im and she performed Umra (with separate rituals) after Hajj.",
      "chain": [
        "30514",
        "20214",
        "20299",
        "11433",
        "11053",
        "53"
      ]
    },
    {
      "hadith_no": "3068",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا عبد الله بن طاوس، عن أبيه، عن ابن عباس، - رضى الله عنهما - قال كانوا يرون أن العمرة في أشهر الحج من أفجر الفجور في الأرض ويجعلون المحرم صفر ويقولون إذا برأ الدبر وعفا الأثر وانسلخ صفر حلت العمرة لمن اعتمر ‏.‏ فقدم النبي صلى الله عليه وسلم وأصحابه صبيحة رابعة مهلين بالحج فأمرهم أن يجعلوها عمرة فتعاظم ذلك عندهم فقالوا يا رسول الله أى الحل قال ‏\"‏ الحل كله ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with them) reported that they (the Arabs of pre-Islamic days) looked upon Umra during the months of Hajj as the greatest of sins on the earth. So they intercalated the month of Muharram for Safar and said:                      When the backs of their camels would become all right and traces (if the pilgrims) would be effaced (from the paths) and the month of Safar would be over, then Umra would be permissible for one who wants to perform it. When Allah's Apostle (may peace be upon him) and his Companions came in the state of Ihram for performing Hajj on the fourth (of Dhu'l-Hijja) he (Allah's Apostle) commanded them to change their state of Ihram (from Hajj) to that of 'Umra. It was something inconceivable for them. So they said: Messenger of Allah, is it a complete freedom (of the obligation) of Ihram? Thereupon he said: It is a complete freedom (from Ihram).",
      "chain": [
        "30514",
        "20214",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "3086",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنيه حجاج بن الشاعر، حدثنا عبد الصمد، ح وحدثني عبد الله بن هاشم، حدثنا بهز، قالا حدثنا سليم بن حيان، بهذا الإسناد ‏.‏ مثله غير أن في رواية بهز ‏\"‏ لحللت‏\"‏ ‏.‏",
      "text_en": "  This hadith is narrated by Salim b. Hayyin with the same chain of transmitters, but with a slight variation of words.",
      "chain": [
        "20250",
        "20214",
        "20234"
      ]
    },
    {
      "hadith_no": "3224",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا عبد الله بن طاوس، عن أبيه، عن ابن عباس، أن النبي صلى الله عليه وسلم قيل له في الذبح والحلق والرمى والتقديم والتأخير فقال ‏\"‏ لا حرج ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas (Allah be pleased with them) reported that it was said to Allah's Apostle (may peace be upon him) about sacrificing of animals, shaving of one's head, throwing of pebbles, and (the order of) precedence and succession, and he said:                      There is no harm in it.",
      "chain": [
        "30514",
        "20214",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "3469",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني أبو بكر بن نافع العبدي، حدثنا بهز، حدثنا حماد بن سلمة، عن ثابت، عن أنس، أن نفرا، من أصحاب النبي صلى الله عليه وسلم سألوا أزواج النبي صلى الله عليه وسلم عن عمله في السر فقال بعضهم لا أتزوج النساء ‏.‏ وقال بعضهم لا آكل اللحم ‏.‏ وقال بعضهم لا أنام على فراش ‏.‏ فحمد الله وأثنى عليه ‏.‏ فقال ‏\"‏ ما بال أقوام قالوا كذا وكذا لكني أصلي وأنام وأصوم وأفطر وأتزوج النساء فمن رغب عن سنتي فليس مني ‏\"‏ ‏.‏",
      "text_en": " Anas (Allah be pleased with him) reported that some of the Companions of Allah's Apostle (may peace be upon him) asked his (the Prophet's) wives about the acts that he performed in private. Someone among them (among his Companions) said:                      I will not marry women; someone among them said: I will not eat meat; and someone among them said: I will not lie down in bed. He (the Holy Prophet) praised Allah and glorified Him, and said: What has happened to these people that they say so and so, whereas I observe prayer and sleep too; I observe fast and suspend observing them; I marry women also? And he who turns away from my Sunnah, he has no relation with Me",
      "chain": [
        "20214",
        "20021",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3573",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا شبابة، حدثنا سليمان، عن ثابث، عن أنس، ح وحدثني به عبد الله بن هاشم بن حيان، - واللفظ له - حدثنا بهز، حدثنا سليمان، بن المغيرة عن ثابت، حدثنا أنس، قال صارت صفية لدحية في مقسمه وجعلوا يمدحونها عند رسول الله صلى الله عليه وسلم - قال - ويقولون ما رأينا في السبى مثلها - قال - فبعث إلى دحية فأعطاه بها ما أراد ثم دفعها إلى أمي فقال ‏\"‏ أصلحيها ‏\"‏ ‏.‏ قال ثم خرج رسول الله صلى الله عليه وسلم من خيبر حتى إذا جعلها في ظهره نزل ثم ضرب عليها القبة فلما أصبح قال رسول الله صلى الله عليه وسلم ‏\"‏ من كان عنده فضل زاد فليأتنا به ‏\"‏ ‏.‏ قال فجعل الرجل يجيء بفضل التمر وفضل السويق حتى جعلوا من ذلك سوادا حيسا فجعلوا يأكلون من ذلك الحيس ويشربون من حياض إلى جنبهم من ماء السماء - قال - فقال أنس فكانت تلك وليمة رسول الله صلى الله عليه وسلم عليها - قال - فانطلقنا حتى إذا رأينا جدر المدينة هششنا إليها فرفعنا مطينا ورفع رسول الله صلى الله عليه وسلم مطيته - قال - وصفية خلفه قد أردفها رسول الله صلى الله عليه وسلم - قال - فعثرت مطية رسول الله صلى الله عليه وسلم فصرع وصرعت قال فليس أحد من الناس ينظر إليه ولا إليها حتى قام رسول الله صلى الله عليه وسلم فسترها - قال - فأتيناه فقال ‏\"‏ لم نضر ‏\"‏ ‏.‏ قال فدخلنا المدينة فخرج جواري نسائه يتراءينها ويشمتن بصرعتها ‏.‏",
      "text_en": " Anas, (Allah be pleased with him) reported:                      Safiyya (Allah be pleased with her) fell to the lot of Dihya in the spoils of war, and they praised her in the presence of Allah's Messenger (may peace be upon him) and said: We have not seen the like of her among the captives of war. He sent (a messenger) to Dihya and he gave him whatever he demanded. He then sent her to my mother and asked her to embellish her. Allah's Messenger (may peace be upon him) then got out of Khaibar until when he was on the other side of it, he halted, and a tent was pitched for him. When it was morning Allah's Messenger (may peace be upon him) said: He who has surplus of provision with him should bring that to us. Some persons would bring the surplus of dates, and the other surplus of mush of barley until there became a heap of bals. They began to eat the hais and began to drink out of the pond which had the water of rainfall in it and which was situated by their side. Anas said that that constituted the wedding feast of Allah's Messenger (may peace be upon him). He (further) said: We proceeded until we saw the walls of Medina, and we were delighted. We made our mounts run quickly and Allah's Messenger (may peace be upon him) also made his mount run quickly. And Safiyya (Allah be pleased with her) was at his back, and Allah's Messenger (may peace be upon him) had seated her behind him. The camel of Allah's Messenger (may peace be upon him) stumbled and he (the Holy Prophet) fell down and she also fell down. And none among the people was seeing him and her, until Allah's Messeuger (may peace be upon him) stood up and he covered her, and we came to him and he said: We have received no injury. We entered Medina and there came out the young ladies of the household. They saw her (hadrat Safiyya) and blamed her for falling down.",
      "chain": [
        "30201",
        "20426",
        "20160",
        "19",
        "20214",
        "20236",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3575",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن حاتم بن ميمون، حدثنا بهز، ح وحدثني محمد بن رافع، حدثنا أبو النضر، هاشم بن القاسم قالا جميعا حدثنا سليمان بن المغيرة، عن ثابت، عن أنس، وهذا حديث بهز قال لما انقضت عدة زينب قال رسول الله صلى الله عليه وسلم لزيد ‏\"‏ فاذكرها على ‏\"‏ ‏.‏ قال فانطلق زيد حتى أتاها وهى تخمر عجينها قال فلما رأيتها عظمت في صدري حتى ما أستطيع أن أنظر إليها أن رسول الله صلى الله عليه وسلم ذكرها فوليتها ظهري ونكصت على عقبي فقلت يا زينب أرسل رسول الله صلى الله عليه وسلم يذكرك ‏.‏ قالت ما أنا بصانعة شيئا حتى أوامر ربي ‏.‏ فقامت إلى مسجدها ونزل القرآن وجاء رسول الله صلى الله عليه وسلم فدخل عليها بغير إذن قال فقال ولقد رأيتنا أن رسول الله صلى الله عليه وسلم أطعمنا الخبز واللحم حين امتد النهار فخرج الناس وبقي رجال يتحدثون في البيت بعد الطعام فخرج رسول الله صلى الله عليه وسلم واتبعته فجعل يتتبع حجر نسائه يسلم عليهن ويقلن يا رسول الله كيف وجدت أهلك قال فما أدري أنا أخبرته أن القوم خرجوا أو أخبرني - قال - فانطلق حتى دخل البيت فذهبت أدخل معه فألقى الستر بيني وبينه ونزل الحجاب قال ووعظ القوم بما وعظوا به ‏.‏ زاد ابن رافع في حديثه ‏{‏ لا تدخلوا بيوت النبي إلا أن يؤذن لكم إلى طعام غير ناظرين إناه‏}‏ إلى قوله ‏{‏ والله لا يستحيي من الحق‏}‏",
      "text_en": " Anas (Allah be pleased with him) reported:                      When the 'Iddah of Zainab was over, Allah's Messenger (may peace be upon him) said to Zaid to make a mention to her about him. Zaid went on until he came to her and she was fermenting her flour. He (Zaid) said: As I saw her I felt in my heart an idea of her greatness so much so that I could not see towards her (simply for the fact) that Allah's Messenger (may peace be upon him) had made a mention of her. So I turned my back towards her. and I turned upon my heels, and said: Zainab, Allah's Messenger (may peace be upon him) has sent (me) with a message to you. She said: I do not do anything until I solicit the will of my Lord. So she stood at her place of worship and the (verse of) the Qur'an (pertaining to her marriage) were revealed, and Allah's Messenger (may peace be upon him) came to her without permission. He (the narrator) said: I saw that Allah's Messenger (may peace be upon him) served us bread and meat until it was broad day light and the people went away, but some persons who were busy in con- versation stayed on in the house after the meal. Allah's Messenger (may peace be upon him) also went out and I also followed him, and he began to visit the apartments of his wives greeting them (with the words): As-Salamu 'alaikum, and they would say: Allah's Messenger, how did you find your family (hadrat Zainab)? He (the narrator) stated: I do not know whether I had informed him that the people had gone out or he (the Holy Prophet) informed me (about that). He moved on until he entered the apartment, and I also went and wanted to enter (the apartment) along with him, but he threw a curtain between me and him, as (the verfes pertaining to seclusion) had been revealed, and people were instructed in what they had been instructed. Ibn Rafii had made this addition in his narration:\" O you who believe, enter not the houses of the Prophet unless permission is given to you for a meal, not waiting for its cooking being finished...\" to the words\"... Allah forbears not from the truth.\"",
      "chain": [
        "30514",
        "20214",
        "30375",
        "20390",
        "20236",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3741",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنيه يحيى بن حبيب، حدثنا خالد بن الحارث، ح وحدثنيه عبد الرحمن بن، بشر حدثنا بهز، قالا حدثنا شعبة، بهذا الإسناد غير أن في، حديثهما ‏\"‏ ليرجعها ‏\"‏ ‏.‏ وفي حديثهما قال قلت له أتحتسب بها قال فمه ‏.‏",
      "text_en": "  This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters but with a slight variation in wording.",
      "chain": [
        "20226",
        "20214"
      ]
    },
    {
      "hadith_no": "3993",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنا عبد الله بن هاشم، حدثنا بهز، حدثنا سليم بن حيان، حدثنا سعيد بن، ميناء عن جابر بن عبد الله، قال نهى رسول الله صلى الله عليه وسلم عن المزابنة والمحاقلة والمخابرة وعن بيع الثمرة حتى تشقح ‏.‏ قال قلت لسعيد ما تشقح قال تحمار وتصفار ويؤكل منها ‏.‏",
      "text_en": " Jabir b. Abdullah (Allah be pleased with them) reported Allah's Messenger (may peace be upon him) forbidding Muzabana and Muhaqala, and Mukhabara, and the sale of fruits until they are ripe. I (the narrator) said to Sa'id (the other narrator):                      What does ripening imply? He said: It meant that they become red or become yellow and are fit for eating.",
      "chain": [
        "20214",
        "20234",
        "11510",
        "34"
      ]
    },
    {
      "hadith_no": "4174",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا زهير بن حرب، حدثنا عفان، ح وحدثني محمد بن حاتم، حدثنا بهز، قالا حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن ابن عباس، عن أسامة بن زيد، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا ربا فيما كان يدا بيد ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas; (Allah be pleased with them) reported on the authority of Usama b. Zaid Allah's Messenger (may peace be upon him) as having said this:                      There is no element of interest when the money or commodity is exchanged hand to hand.",
      "chain": [
        "30022",
        "30106",
        "38487",
        "20214",
        "20299",
        "11433",
        "11053",
        "17",
        "50"
      ]
    },
    {
      "hadith_no": "4233",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Rules of Inheritance - كتاب الفرائض",
      "chapter_no": "24",
      "text_ar": "حدثني محمد بن حاتم، حدثنا بهز، حدثنا شعبة، أخبرني محمد بن المنكدر، قال سمعت جابر بن عبد الله، يقول دخل على رسول الله صلى الله عليه وسلم وأنا مريض لا أعقل فتوضأ فصبوا على من وضوئه فعقلت فقلت يا رسول الله إنما يرثني كلالة ‏.‏ فنزلت آية الميراث ‏.‏ فقلت لمحمد بن المنكدر ‏{‏ يستفتونك قل الله يفتيكم في الكلالة‏}‏ قال هكذا أنزلت.",
      "text_en": " Jabir b. Abdullah (Allah be pleased with him) reported:                      Whilo I was ill Allah's Messenger (may peace be upon him) came to me and found me unconscious. He (the Holy Prophet) performed ablution, and sprinkled over me the water of his ablution. I regained my consciousness and said: Allah's Messenger, my case of inheritance is that of Kalala. Then the verse pertaining to the inheritance ( of Kalala) was revealed. I (one of the narrators) said: I said to Muhammad b. Munkadir: (Do you mean this verse)\" They ask you; say: Allah gives you decision in regard to Kalala\" (iv. 177)? He said: Yes, it was thus revealed.",
      "chain": [
        "38487",
        "20214",
        "20020",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "4369",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "حدثني محمد بن حاتم، حدثنا بهز، حدثنا شعبة، حدثنا سماك بن حرب، قال سمعت تميم بن طرفة، قال سمعت عدي بن حاتم، أن رجلا، سأله فذكر مثله وزاد ولك أربعمائة في عطائي ‏.‏",
      "text_en": " Tamim b. Tarafa reported:                      I heard 'Adi b. Hatim say that a person asked that and then narrated (the hadith) like one (mentioned above), but he made this addition:\" Here are four hundred (dirhams) for you out of my gift.\"",
      "chain": [
        "38487",
        "20214",
        "20020",
        "10770",
        "10894",
        "212"
      ]
    },
    {
      "hadith_no": "4525",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "حدثني محمد بن حاتم، حدثنا بهز، حدثنا يزيد بن زريع، حدثنا داود، بهذا الإسناد ‏.‏ مثل معناه ‏.‏ وقال في الحديث فقام النبي صلى الله عليه وسلم من العشي فحمد الله وأثنى عليه ثم قال ‏\"‏ أما بعد فما بال أقوام إذا غزونا يتخلف أحدهم عنا له نبيب كنبيب التيس ‏\"‏ ‏.‏ ولم يقل ‏\"‏ في عيالنا ‏\"‏ ‏.‏",
      "text_en": " Dawud narrated the hadith with the same chain of transmitters (and the words are):                      Allah's Apostle (may peace be upon him) stood tip (to address the audience) in the evening and praised Allah, glorified Him and then said: What about the people, that as we set out on an expedition, one of you remained behind us and he shrieked like the bleating of a male goat? But he did not mention (these words): People connected with us.\"",
      "chain": [
        "38487",
        "20214",
        "20304"
      ]
    },
    {
      "hadith_no": "4604",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "وحدثني عبد الرحمن بن بشر العبدي، حدثنا بهز، حدثنا شعبة، أخبرني سلمة، بن كهيل أو أخبر القوم، وأنا فيهم، قال سمعت سويد بن غفلة، قال خرجت مع زيد بن صوحان وسلمان بن ربيعة فوجدت سوطا ‏.‏ واقتص الحديث بمثله إلى قوله فاستمتعت بها ‏.‏ قال شعبة فسمعته بعد عشر سنين يقول عرفها عاما واحدا ‏.‏",
      "text_en": " Shu'ba reported:                      Salama b. Kuhail informed me or he informed people and I was among them. He said: I heard Sawaid b. Ghafala who reported: I went out along with Zaid b. Suhan and Salman b. Rabi'a, and found a whip, the rest of the hadith is the same up to the words:\" I made use of that.\" Shu'ba said: I heard him say after ten years, that he made an announcement of it for one year.",
      "chain": [
        "30356",
        "20214",
        "20020",
        "11350",
        "11174"
      ]
    },
    {
      "hadith_no": "4605",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا جرير، عن الأعمش، ح وحدثنا أبو بكر بن أبي، شيبة حدثنا وكيع، ح وحدثنا ابن نمير، حدثنا أبي جميعا، عن سفيان، ح وحدثني محمد، بن حاتم حدثنا عبد الله بن جعفر الرقي، حدثنا عبيد الله، - يعني ابن عمرو - عن زيد، بن أبي أنيسة ح وحدثني عبد الرحمن بن بشر، حدثنا بهز، حدثنا حماد بن سلمة، كل هؤلاء عن سلمة بن كهيل، بهذا الإسناد ‏.‏ نحو حديث شعبة ‏.‏ وفي حديثهم جميعا ثلاثة أحوال إلا حماد بن سلمة فإن في حديثه عامين أو ثلاثة ‏.‏ وفي حديث سفيان وزيد بن أبي أنيسة وحماد بن سلمة ‏\"‏ فإن جاء أحد يخبرك بعددها ووعائها ووكائها فأعطها إياه ‏\"‏ ‏.‏ وزاد سفيان في رواية وكيع ‏\"‏ وإلا فهي كسبيل مالك ‏\"‏ ‏.‏ وفي رواية ابن نمير ‏\"‏ وإلا فاستمتع بها ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Salama b. Kuhail through different chains of transmitters. In their ahadith, it is three years, except in the hadith of Hammid b. Salama it is two years or three years. In the hadith transmitted on the authority of Sufyan and Zaid b. Abu Unaisa and Hammid b. Salama (the words are):                     \" If someone comes and informs you about the number (of articles) of the bag and the straps, then give that to him.\" Sufyan has made this addition in the narration of Waki':\" Otherwise it is like your property.\" And in the narration of Ibn Numair the words are:\" Otherwise make use of that.\"",
      "chain": [
        "30367",
        "20028",
        "11060",
        "30201",
        "20032",
        "30212",
        "20005",
        "38487",
        "30346",
        "30024",
        "11340",
        "30356",
        "20214"
      ]
    },
    {
      "hadith_no": "4705",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن بشار العبدي، حدثنا بهز بن أسد، حدثنا شعبة، حدثني حميد، بن هلال قال سمعت عبد الله بن مغفل، يقول رمي إلينا جراب فيه طعام وشحم يوم خيبرفوثبت لآخذه قال فالتفت فإذا رسول الله صلى الله عليه وسلم فاستحييت منه ‏.‏",
      "text_en": " This tradition has been transmitted by a different chain of narrators with a different wording, the last in the chain being the same narrator, (i. e. 'Abdullah b. Mughaffal), who said:                      A bag containing food and fat was thrown to us. I lept forward to catch it. Then I turned round and saw (to my surprise) the Messenger of Allah (may peace be upon him) and I felt ashamed of my act in his presence.",
      "chain": [
        "30160",
        "20214",
        "20020",
        "11281",
        "3242"
      ]
    },
    {
      "hadith_no": "4723",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنيه عبد الله بن هاشم، حدثنا بهز، حدثنا سليمان بن المغيرة، بهذا الإسناد وزاد في الحديث ثم قال بيديه إحداهما على الأخرى ‏\"‏ احصدوهم حصدا ‏\"‏ ‏.‏ وقال في الحديث قالوا قلنا ذاك يا رسول الله قال ‏\"‏ فما اسمي إذا كلا إني عبد الله ورسوله ‏\"‏ ‏.‏",
      "text_en": " The tradition has been narrated by a different chain of transmitters with the following additions:                      (i) Then be (the Messenger of Allah) said with his hands one upon the other: Kill them (who stand in your way).... (ii) They (the Ansar) replied: We said so, Messenger of Allah! He said: What is my name? I am but Allah's bondman and His Messenger.",
      "chain": [
        "20214",
        "20236"
      ]
    },
    {
      "hadith_no": "4777",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثني محمد بن حاتم، حدثنا بهز، حدثنا حماد بن سلمة، حدثنا ثابت، عن أنس، أن أصحاب، محمد صلى الله عليه وسلم كانوا يقولون يوم الخندق نحن الذين بايعوا محمدا على الإسلام ما بقينا أبدا أو قال على الجهاد ‏.‏ شك حماد والنبي صلى الله عليه وسلم يقول ‏\"‏ اللهم إن الخير خير الآخره فاغفر للأنصار والمهاجره ‏\"‏ ‏.‏",
      "text_en": " It has been narrated (through a still difterent chain of transmitters) by Anas that the Companions of Muhammad (may peace be upon him) were chanting on the day of the Battle of the Ditch:                      We are those who have sworn allegiance to Muhammad (And made a covenant with him) to follow Islam as long as we live. Hammad is not sure whether Anas said:\" Ala'l-Islam\" or,\" Ala'l-Jihad\". And the Holy Prophet (may peace be upon him) was chanting: O God, the real good is the good of the Hereafter, So forgive Thou the Ansar and the Muhajirs.",
      "chain": [
        "38487",
        "20214",
        "20021",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "4791",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا وهب بن جرير بن حازم، حدثني أبي قال، سمعت قيسا، يحدث عن يزيد بن هرمز، ح وحدثني محمد بن حاتم، - واللفظ له - قال حدثنا بهز، حدثنا جرير بن حازم، حدثني قيس بن سعد، عن يزيد بن هرمز، قال كتب نجدة بن عامر إلى ابن عباس قال فشهدت ابن عباس حين قرأ كتابه وحين كتب جوابه وقال ابن عباس والله لولا أن أرده عن نتن يقع فيه ما كتبت إليه ولا نعمة عين قال فكتب إليه إنك سألت عن سهم ذي القربى الذي ذكر الله من هم وإنا كنا نرى أن قرابة رسول الله صلى الله عليه وسلم هم نحن فأبى ذلك علينا قومنا وسألت عن اليتيم متى ينقضي يتمه وإنه إذا بلغ النكاح وأونس منه رشد ودفع إليه ماله فقد انقضى يتمه وسألت هل كان رسول الله صلى الله عليه وسلم يقتل من صبيان المشركين أحدا فإن رسول الله صلى الله عليه وسلم لم يكن يقتل منهم أحدا وأنت فلا تقتل منهم أحدا إلا أن تكون تعلم منهم ما علم الخضر من الغلام حين قتله وسألت عن المرأة والعبد هل كان لهما سهم معلوم إذا حضروا البأس فإنهم لم يكن لهم سهم معلوم إلا أن يحذيا من غنائم القوم.",
      "text_en": " It has been narrated on the anthority of Yazid b. Hurmuz who said:                      Najda wrote to Ibn Abbas. I was sitting in the company of Ibn 'Abbas when he read his letter and wrote its reply. Ibn Abbas said: Were it not for preventing him from falling into wickedness. I would not have replied to his letter, may he never be joyful. He wrote in reply to him referring to the share of the close relatives (of the Holy Prophet) (from the booty) whom God has mentioned. (I have to tell you that) we thought we were the close relatives of the Messenger of Allah (may peace be upon him), but our people have refused to recognise us as such. You have asked about the orphan as to when his orphanhood comes to an end. (I have to say that) when he reaches the age of marriage, attains maturity of mind, and his property is returned to him, then he is no longer an orphan. You have inquired whether the Messenger of Allah (may peace be upo him) used to kill anyone from the children of the polytheists in the war. (You should know that) the Messenger of Allah (may peace be upon him) used not to kill any one of their children, and you (too) should not kill any one of them, except when you knew about them what Khadir had known about the boy whom he killed. And you have inquired whether there is a fixed share of the booty for women and slaves when they participate in a battle. (I have to tell you that) there is no fixed share for them except that they will be given some reward from the spoils of war.",
      "chain": [
        "30123",
        "20298",
        "11272",
        "11046",
        "10627",
        "38487",
        "20214",
        "11272",
        "172",
        "10627"
      ]
    },
    {
      "hadith_no": "4867",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا عبد الرحمن بن بشر، حدثنا بهز، حدثنا شعبة، بهذا الإسناد ولم يذكر حبشيا مجدعا وزاد أنها سمعت رسول الله صلى الله عليه وسلم بمنى أو بعرفات ‏.",
      "text_en": " Another version of the tradition does not qualify the slave with the epithets\" maimed,\"\" an Abyssinian\" but makes the addition:                     \" I have heard the Holy Prophet (may peace be upon him) (say this) at Mina or 'Arafat.\"",
      "chain": [
        "30356",
        "20214"
      ]
    },
    {
      "hadith_no": "5010",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني أبو بكر بن نافع، - واللفظ له - حدثنا بهز، حدثنا حماد بن سلمة، حدثنا  ثابت، عن أنس بن مالك، أن فتى، من أسلم قال يا رسول الله إني أريد الغزو وليس معي ما أتجهز قال ‏\"‏ ائت فلانا فإنه قد كان تجهز فمرض ‏\"‏ ‏.‏ فأتاه فقال إن رسول الله صلى الله عليه وسلم يقرئك السلام ويقول أعطني الذي تجهزت به قال يا فلانة أعطيه الذي تجهزت به ولا تحبسي عنه شيئا فوالله لا تحبسي منه شيئا فيبارك لك فيه ‏.‏",
      "text_en": " It has been narrated on the authority of Anas b. Malik that a young man from Aslam tribe said:                      Messenger of Allah, I wish to fight (in the way of Allah) but I don't have anything to equip myself with for fighting. He (the Holy Prophet) said: Go to so and so, for he had equipped himself (for fighting) but he fell ill. So, he (the young man) went to him and said: The Messenger of Allah (may peace be upon him) sends you his greetings and says that you should give me the equipage that you have provided yourself with. The man said (to his wife or maidservant): So and so, give him the equipage I have collected for myself and do not withhold anything from him. Do not withhold anything from him so that you may be blessed therein.",
      "chain": [
        "20214",
        "20021",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "5027",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا بهز، حدثنا سليمان بن المغيرة، عن ثابت، قال قال أنس عمي الذي سميت به لم يشهد مع رسول الله صلى الله عليه وسلم بدرا - قال - فشق عليه قال أول مشهد شهده رسول الله صلى الله عليه وسلم غيبت عنه وإن أراني الله مشهدا فيما بعد مع رسول الله صلى الله عليه وسلم ليراني الله ما أصنع - قال - فهاب أن يقول غيرها - قال - فشهد مع رسول الله صلى الله عليه وسلم يوم أحد - قال - فاستقبل سعد بن معاذ فقال له أنس يا أبا عمرو أين فقال واها لريح الجنة أجده دون أحد - قال - فقاتلهم حتى قتل - قال - فوجد في جسده بضع وثمانون من بين ضربة وطعنة ورمية - قال - فقالت أخته عمتي الربيع بنت النضر فما عرفت أخي إلا ببنانه ‏.‏ ونزلت هذه الآية ‏{‏ رجال صدقوا ما عاهدوا الله عليه فمنهم من قضى نحبه ومنهم من ينتظر وما بدلوا تبديلا‏}‏ قال فكانوا يرون أنها نزلت فيه وفي أصحابه ‏.‏",
      "text_en": " It has been Deported on the authority of Anas who said:                      My uncle and I have been named after him was not present with the Messenger of Allah (mav peace be upon him) on the Day of Badr. He felt distressed about it. He would say: I have missed the first battle fought by the Messenger of Allah (may peace be upon him), and if God now gives me an opportunity to see a battlefield with the Messenger of Allah (may peace be upon him), God will see what I do therein. He was afraid to say more than this (lest he be unable to keep his word with God). He was present with the Messenger of Allah (may peace be upon him) on the Day of Uhud. He met Sa'd b. Mu'adh (who was retreating). Anas said to him: O Abu 'Amr, where (are you going)? Woe (to thee)! I find the smell of Paradise beside the Uhud mountain. (Reprimanding Sa'd in these words) he went forward and fought thein (the enemy) until he was killed. (The narrator says). More than eighty wounds inflicted with swords, spears and arrows were found on his body. His sister, my aunt, ar-Rubayyi', daughter of Nadr, said: I could not recognise my brother's body (it was so badly mutilated) except from his finger-tips. (It was on this occasion that) the Qur'anic verse:\" Among the Believers are men who have been true to their covenant with God. Of them some have completed their vow (to the extreme), and some still wait: but they have never changed (their determination) in the least\" (xxxiii. 23). The narrator said that the verse had been revealed about him (Anas b. Nadr) and his Companions.",
      "chain": [
        "38487",
        "20214",
        "20236",
        "11269"
      ]
    },
    {
      "hadith_no": "5052",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا سهيل، بهذا الإسناد وفي حديثه قال أخبرني عبيد الله بن مقسم، عن أبي صالح، وزاد، فيه ‏\"‏ والغرق شهيد ‏\"‏ ‏.‏",
      "text_en": " Another version of the tradition narrated on the authority of Suhail thouch a different chain of transmitters contains the additional words:                     \" A drowned person is a martyr.\"",
      "chain": [
        "38487",
        "20214",
        "20299",
        "11521",
        "11161"
      ]
    },
    {
      "hadith_no": "5156",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثني محمد بن حاتم، حدثنا بهز، حدثنا أبو عقيل الدورقي، حدثنا أبو نضرة، عن أبي سعيد، أن أعرابيا، أتى رسول الله صلى الله عليه وسلم فقال إني في غائط مضبة وإنه عامة طعام أهلي - قال - فلم يجبه فقلنا عاوده ‏.‏ فعاوده فلم يجبه ثلاثا ثم ناداه رسول الله صلى الله عليه وسلم في الثالثة فقال ‏\"‏ يا أعرابي إن الله لعن أو غضب على سبط من بني إسرائيل فمسخهم دواب يدبون في الأرض فلا أدري لعل هذا منها فلست آكلها ولا أنهى عنها ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id reported that an Arab of the desert came to Allah's Messenger (may peace be upon him) and said:                      I live in a low land abounding in lizards, and these are the common diet of my family, but he (the Holy Prophet) did not make any reply. We said to him: Repeat it (your problem) and so he repeated it, but he did not make any reply. (It was repeated thrice ) Then Allah's Messenger (may peace be upon him) called him out at the third time saying: O man of the desert, verily Allah cursed or showed wrath to a tribe of Bani Isra'il and distorted them to beasts which move on the earth. I do not know, perhaps this (lizard) may be one of them. So I do not eat it, nor do I prohibit the eating of it.",
      "chain": [
        "38487",
        "20214",
        "20213",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "5284",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثني محمد بن حاتم، حدثنا بهز، حدثنا وهيب، عن سهيل، عن أبيه، عن أبي، هريرة عن النبي صلى الله عليه وسلم أنه نهى عن المزفت والحنتم والنقير ‏.‏ قال قيل لأبي هريرة ما الحنتم قال الجرار الخضر ‏.‏",
      "text_en": " Abu Huraira reported that Allah's Apostle (may peace be upon him) forbade (the preparation of Nabidh) in varnished jar, pitcher besmeared with green pitch and hollow stump. It was said to Abu Huraira:                      What that Hantama was? He said: It is green pitcher (besmeared with pitch).",
      "chain": [
        "38487",
        "20214",
        "20299",
        "13"
      ]
    },
    {
      "hadith_no": "5309",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا عبد الله بن طاوس، عن أبيه، عن ابن عمر، أن رسول الله صلى الله عليه وسلم نهى عن الجر والدباء ‏.‏",
      "text_en": " Ibn 'Umar reported that Allah's Messenger (may peace be upon him) forbade (the preparation) of Nabidh in a green pitcher (besmeared with pitch) and in varnished jar.",
      "chain": [
        "38487",
        "20214",
        "20299",
        "11433",
        "11053",
        "18"
      ]
    },
    {
      "hadith_no": "5426",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني محمد بن حاتم، وأبو بكر بن نافع العبدي قالا حدثنا بهز، حدثنا حماد، بن سلمة حدثنا ثابت، عن أنس، أن رسول الله صلى الله عليه وسلم كان إذا أكل طعاما لعق أصابعه الثلاث ‏.‏ قال وقال ‏\"‏ إذا سقطت لقمة أحدكم فليمط عنها الأذى وليأكلها ولا يدعها للشيطان ‏\"‏ ‏.‏ وأمرنا أن نسلت القصعة قال ‏\"‏ فإنكم لا تدرون في أى طعامكم البركة ‏\"‏ ‏.‏",
      "text_en": " Anas reported that when Allah's Messenger (may peace be upon him) ate food he licked his three fingers, and he said:                      When any one of you drops a mouthful he should remove anything filthy from it and then eat it, and should not leave it for the Satan. He also commanded us that we should wipe the dish saying: You do not know in what portion of your food the blessing lies.",
      "chain": [
        "38487",
        "20214",
        "20021",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "5427",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا بهز، حدثنا وهيب، حدثنا سهيل، عن أبيه، عن  أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أكل أحدكم فليلعق أصابعه فإنه لا يدري في أيتهن البركة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      When any one of you eats food he should lick his fingers, for he does not know in what part of the food sticking to his fingers the blessing lies. This hadith has been reported on the authority of Hammad with the same chain of transmitters, but with a slight variation of wording.",
      "chain": [
        "38487",
        "20214",
        "20299",
        "13"
      ]
    },
    {
      "hadith_no": "5929",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثني عبد الله بن هاشم بن حيان، حدثنا بهز، حدثنا يزيد، - وهو التستري - حدثنا أبو الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا عدوى ولا غول ولا صفر ‏\"‏ ‏.‏",
      "text_en": " Jabir reported Allah's Messenger (may peace be upon him) as saying:                      There is no transitive disease, no ghoul, no safar.",
      "chain": [
        "20214",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "6476",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني محمد بن حاتم بن ميمون، حدثنا بهز، حدثنا سليمان بن المغيرة، عن ثابت، عن أنس، قال مات ابن لأبي طلحة من أم سليم فقالت لأهلها لا تحدثوا أبا طلحة بابنه حتى أكون أنا أحدثه - قال - فجاء فقربت إليه عشاء فأكل وشرب - فقال - ثم تصنعت له أحسن ما كان تصنع قبل ذلك فوقع بها فلما رأت أنه قد شبع وأصاب منها قالت يا أبا طلحة أرأيت لو أن قوما أعاروا عاريتهم أهل بيت فطلبوا عاريتهم ألهم أن يمنعوهم قال لا ‏.‏ قالت فاحتسب ابنك ‏.‏ قال فغضب وقال تركتني حتى تلطخت ثم أخبرتني بابني ‏.‏ فانطلق حتى أتى رسول الله صلى الله عليه وسلم فأخبره بما كان فقال رسول الله صلى الله عليه وسلم ‏\"‏ بارك الله لكما في غابر ليلتكما ‏\"‏ ‏.‏ قال فحملت - قال - فكان رسول الله صلى الله عليه وسلم في سفر وهي معه وكان رسول الله صلى الله عليه وسلم إذا أتى المدينة من سفر لا يطرقها طروقا فدنوا من المدينة فضربها المخاض فاحتبس عليها أبو طلحة وانطلق رسول الله صلى الله عليه وسلم - قال - يقول أبو طلحة إنك لتعلم يا رب إنه يعجبني أن أخرج مع رسولك إذا خرج وأدخل معه إذا دخل وقد احتبست بما ترى - قال - تقول أم سليم يا أبا طلحة ما أجد الذي كنت أجد انطلق ‏.‏ فانطلقنا - قال - وضربها المخاض حين قدما فولدت غلاما فقالت لي أمي يا أنس لا يرضعه أحد حتى تغدو به على رسول الله صلى الله عليه وسلم ‏.‏ فلما أصبح احتملته فانطلقت به إلى رسول الله صلى الله عليه وسلم - قال - فصادفته ومعه ميسم فلما رآني قال ‏\"‏ لعل أم سليم ولدت ‏\"‏ ‏.‏ قلت نعم ‏.‏ فوضع الميسم - قال - وجئت به فوضعته في حجره ودعا رسول الله صلى الله عليه وسلم بعجوة من عجوة المدينة فلاكها في فيه حتى ذابت ثم قذفها في في الصبي فجعل الصبي يتلمظها - قال - فقال رسول الله صلى الله عليه وسلم ‏\"‏ انظروا إلى حب الأنصار التمر ‏\"‏ ‏.‏ قال فمسح وجهه وسماه عبد الله ‏.‏",
      "text_en": " Anas reported that the son of Abu Talba who was born of Umm Sulaim died. She (Umm Sulaim) said to the members of her family:                      Do not narrate to Abu Talha about his son until I narrate it to him. Abu Talha came (home) ; she presented to him the supper. He took it and drank water. She then embellished herself which she did not do before. He (Abu Talha) had a sexual intercourse with her and when she saw that he was satisfied after sexual intercourse with her, she said: Abu Talha, if some people borrow something from another family and then (the members of the family) ask for its return, would they resist its return? He said: No. She said: I inform you about the death of your son. He was annoyed, and said: You did not inform me until I had a sexual intercourse with you and you later on gave me information about my son. He went to Allah's Messenger (may peace be upon him) and informed him what had happened. Thereupon Allah's Messenger (may peace be upon him) said: May Allah bless both of you in the night spent by you! He (the narrator) said: She became pregnant. Allah's Messenger (may peace he upon him) was in the course of a journey and she was along with him and when Allah's Messenger (may peace be upon him) came back to Medina from the journey he did not enter (his house) (during the night). When the people came near Medina, she felt the pangs of delivery. He (Abu Talha) remained with her and Allah's Messenger (may peace be upon him) proceeded on. Abu Talha said: O Lord, you know that I love to go along with Allah's Messenger when he goes out and enter along with him when he enters and I have been detained as Thou seest. Umm Sulaim said: Abu Talha, I do not feel (so much pain) as I was feeling formerly, so better proceed on. So we proceeded on and she felt the pangs of delivery as they reached (Medina) and a child was born and my mother said to me: Anas, none should suckle him until you go to Allah's Messenger (may peace be upon him) tomorrow morning. And when it was morning I carried him (the child) and went along with him to Allah's Messenger (may peace beupon him). He said: I saw that he had in his hand the instrument for the cauterisation of the camels. When he saw me. he said: This is, perhaps, what Umm Sulaim has given birth to. I said: Yes. He laid down that instrument on the ground. I brought that child to him and placed it in his lap and Allah's Messenger (may peace be upon him) asked Ajwa dates of Medina to be brought and softened them in his month. When these had become palatable he placed them in the mouth of that child. The child began to taste them. Then Allah's Messenger (may peace be upon him) said: See what love the Ansar have for dates. He then wiped his face and named him 'Abdullah.",
      "chain": [
        "30514",
        "20214",
        "20236",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "6533",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو بكر بن نافع، حدثنا بهز، حدثنا حماد، أخبرنا ثابت، عن أنس، قال أتى على رسول الله صلى الله عليه وسلم وأنا ألعب مع الغلمان - قال - فسلم علينا فبعثني إلى حاجة فأبطأت على أمي فلما جئت قالت ما حبسك قلت بعثني رسول الله صلى الله عليه وسلم لحاجة ‏.‏ قالت ما حاجته قلت إنها سر ‏.‏ قالت لا تحدثن بسر رسول الله صلى الله عليه وسلم أحدا ‏.‏ قال أنس والله لو حدثت به أحدا لحدثتك يا ثابت ‏.‏",
      "text_en": " Anas reported:                      Allah's Messenger (may peace be upon him) came to me as I was playing with playmates. He greeted and sent me on an errand and I made delay in going to my mother. When I came to her she said: What detained you? I said: Allah's Messenger (may peace be upon him) sent me on an errand. She said: What was the purpose? I said: It is something secret. Therupon she said: Do not then divulge the secret of Allah's Messenger (may peace be upon him) to anyone. Anas said: By Allah, if I were to divulge it to anyone, then, O Thabit, I would have divulged it to you.",
      "chain": [
        "20523",
        "20214",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "6568",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن حاتم، حدثنا بهز، حدثنا حماد بن سلمة، عن ثابت، عن معاوية، بن قرة عن عائذ بن عمرو، أن أبا سفيان، أتى على سلمان وصهيب وبلال في نفر فقالوا والله ما أخذت سيوف الله من عنق عدو الله مأخذها ‏.‏ قال فقال أبو بكر أتقولون هذا لشيخ قريش وسيدهم فأتى النبي صلى الله عليه وسلم فأخبره فقال ‏\"‏ يا أبا بكر لعلك أغضبتهم لئن كنت أغضبتهم لقد أغضبت ربك ‏\"‏ ‏.‏ فأتاهم أبو بكر فقال يا إخوتاه أغضبتكم قالوا لا يغفر الله لك يا أخى ‏.‏",
      "text_en": " 'A'idh b. Amr reported that Abu Sufyan came to Salman, Suhaib and Bilal in the presence of a group of persons. They said:                      By Allah, the sword of Allah did not reach the neck of the enemy of Allah as it was required to reach. Thereupon Abu Bakr said: Do you say this to the old man of the Quraish and their chief? Then he came to Allah's Apostle (may peace be upon'him) and informed him of this. Thereupon he (the Holy Prophet) said: Abu Bakr, you have perhaps annoyed them and if you annoyed them you have in fact annoyed your Lord. So Abu Bakr came to them and said: O my brothers, I have annoyed you. They said: No, our brother, may Allah forgive you",
      "chain": [
        "38487",
        "20214",
        "20021",
        "11269",
        "11306",
        "3240"
      ]
    },
    {
      "hadith_no": "6639",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني محمد بن حاتم، حدثنا يحيى بن سعيد، ح وحدثنا عبد الرحمن بن بشر، العبدي حدثنا بهز، ح وحدثني محمد بن رافع، حدثنا شبابة، كلهم عن شعبة، بهذا الإسناد ‏.‏ وفي حديثهم قال لا أدري أذكر بعد قرنه قرنين أو ثلاثة ‏.‏ وفي حديث شبابة قال سمعت زهدم بن مضرب وجاءني في حاجة على فرس فحدثني أنه سمع عمران بن حصين ‏.‏ وفي حديث يحيى وشبابة ‏\"‏ ينذرون ولا يفون ‏\"‏ ‏.‏ وفي حديث بهز ‏\"‏ يوفون ‏\"‏ ‏.‏ كما قال ابن جعفر ‏.‏",
      "text_en": " This hadith has been reported on the authority of Shu'ba with the same chain of transmitters (and the words are):                      I do not know whether he made a mention of two generations after his generation or of the third one too. Shababa said: I heard this from Zahdam b. Mudarrib as he came to me riding a horse for some need and he narrated it to me that he had heard it from 'Imran b. Husain, and in the hadith transmitted on the authority of Yahya and Shababa (the words are): They take an oath but they do not fulfil it, and in the hadith transmitted on the authority of Bahz there the word is Yafun as transmitted on the authority of Ibn Ja'far.",
      "chain": [
        "38487",
        "20031",
        "30356",
        "20214",
        "30375",
        "11589"
      ]
    },
    {
      "hadith_no": "6721",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني محمد بن حاتم بن ميمون، حدثنا بهز، حدثنا حماد بن سلمة، عن ثابت، عن أبي رافع، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله عز وجل يقول يوم القيامة يا ابن آدم مرضت فلم تعدني ‏.‏ قال يا رب كيف أعودك وأنت رب العالمين ‏.‏ قال أما علمت أن عبدي فلانا مرض فلم تعده أما علمت أنك لو عدته لوجدتني عنده يا ابن آدم استطعمتك فلم تطعمني ‏.‏ قال يا رب وكيف أطعمك وأنت رب العالمين ‏.‏ قال أما علمت أنه استطعمك عبدي فلان فلم تطعمه أما علمت أنك لو أطعمته لوجدت ذلك عندي يا ابن آدم استسقيتك فلم تسقني ‏.‏ قال يا رب كيف أسقيك وأنت رب العالمين قال استسقاك عبدي فلان فلم تسقه أما إنك لو سقيته وجدت ذلك عندي ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Verily, Allah, the Exalted and Glorious, would say on the Day of Resurrection: O son of Adam, I was sick but you did not visit Me. He would say: O my Lord; how could I visit Thee whereas Thou art the Lord of the worlds? Thereupon He would say: Didn't you know that such and such servant of Mine was sick but you did not visit him and were you not aware of this that if you had visited him, you would have found Me by him? O son of Adam, I asked food from you but you did not feed Me. He would say: My Lord, how could I feed Thee whereas Thou art the Lord of the worlds? He said: Didn't you know that such and such servant of Mine asked food from you but you did not feed him, and were you not aware that if you had fed him you would have found him by My side? (The Lord would again say: ) O son of Adam, I asked drink from you but you did not provide Me. He would say: My Lord, how could I provide Thee whereas Thou art the Lord of the worlds? Thereupon He would say: Such and such of servant of Mine asked you for a drink but you did not provide him, and had you provided him drink you would have found him near Me.",
      "chain": [
        "30514",
        "20214",
        "20021",
        "11269",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "6816",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن نافع، حدثنا بهز، حدثنا حماد، بهذا الإسناد نحوه ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Humaid with the same chain of transmitters.",
      "chain": [
        "20523",
        "20214"
      ]
    },
    {
      "hadith_no": "6838",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني محمد بن حاتم، حدثنا بهز، حدثنا حماد بن سلمة، عن ثابت، عن أبي رافع، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن شجرة كانت تؤذي المسلمين فجاء رجل فقطعها فدخل الجنة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying that there was a tree which caused inconvenience to the Muslims; a person came there and cut that (tree) (and thus entered ) Paradise).",
      "chain": [
        "38487",
        "20214",
        "20021",
        "11269",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "7015",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن حاتم بن ميمون، حدثنا بهز، حدثنا وهيب، حدثنا سهيل، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن لله تبارك وتعالى ملائكة سيارة فضلا يتبعون مجالس الذكر فإذا وجدوا مجلسا فيه ذكر قعدوا معهم وحف بعضهم بعضا بأجنحتهم حتى يملئوا ما بينهم وبين السماء الدنيا فإذا تفرقوا عرجوا وصعدوا إلى السماء - قال - فيسألهم الله عز وجل وهو أعلم بهم من أين جئتم فيقولون جئنا من عند عباد لك في الأرض يسبحونك ويكبرونك ويهللونك ويحمدونك ويسألونك ‏.‏ قال وماذا يسألوني قالوا يسألونك جنتك ‏.‏ قال وهل رأوا جنتي قالوا لا أى رب ‏.‏ قال فكيف لو رأوا جنتي قالوا ويستجيرونك ‏.‏ قال ومم يستجيرونني قالوا من نارك يا رب ‏.‏ قال وهل رأوا ناري قالوا لا ‏.‏ قال فكيف لو رأوا ناري قالوا ويستغفرونك - قال - فيقول قد غفرت لهم فأعطيتهم ما سألوا وأجرتهم مما استجاروا - قال - فيقولون رب فيهم فلان عبد خطاء إنما مر فجلس معهم قال فيقول وله غفرت هم القوم لا يشقى بهم جليسهم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace be upon him) as saying Allah has mobile (squads) of angels, who have no other work (to attend to but) to follow the assemblies of Dhikr and when they find such assemblies in which there is Dhikr (of Allah) they sit in them and some of them surround the others with their wings till the space between them and the sky of the world is fully covered, and when they disperse (after the assembly of Dhikr is adjourned) they go upward to the heaven and Allah, the Exalted and Glorious, asks them although He is best informed about them:                      Where have you come from? They say: We come from Thine servants upon the earth who had been glorifying Thee (reciting Subhan Allah), uttering Thine Greatness (saying Allah o-Akbar) and uttering Thine Oneness (La ilaha ill Allah) and praising Thee (uttering al-Hamdu Lillah) and begging of Thee. Be would say: What do they beg of Me? They would say: They beg of Thee the Paradise of Thine. He (God) would say: Have they seen My Paradise? They said: No, our Lord. He would say: (What it would be then) if they were to see Mine Paradise? They (the angels) said: They seek Thine protection. He (the Lord) would say: Against what do they seek protection of Mine? They (the angels) would say: Our Lord, from the Hell-Fire. He (the Lord) would say: Have they seen My Fire? They would say: No. He (the Lord) would say: What it would be if they were to see My Fire? They would say: They beg of Thee forgiveness. He would say: I grant pardon to them, and confer upon them what they ask for and grant them protection against which they seek protection. They (the angels) would again say: Our Lord, there is one amongst them such and such simple servant who happened to pass by (that assembly) and sat there along with them (who had been participating in that assembly). He (the Lord) would say: I also grant him pardon, for they are a people the seat-fellows of whom are in no way unfortunate.",
      "chain": [
        "30514",
        "20214",
        "20299",
        "13"
      ]
    },
    {
      "hadith_no": "7051",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو بكر بن نافع العبدي، حدثنا بهز بن أسد العمي، حدثنا هارون الأعور، حدثنا شعيب بن الحبحاب، عن أنس، قال كان النبي صلى الله عليه وسلم يدعو بهؤلاء الدعوات ‏\"‏ اللهم إني أعوذ بك من البخل والكسل وأرذل العمر وعذاب القبر وفتنة المحيا والممات ‏\"‏ ‏.‏",
      "text_en": " Anas reported that Allah's Messenger (may peace he upon him) wed to make this supplication:                     \" O Allah, I seek refuge in Thee from miserliness, from sloth and from decrepitude.\"",
      "chain": [
        "20214",
        "11596",
        "19"
      ]
    },
    {
      "hadith_no": "7100",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا بهز، حدثنا حماد بن سلمة، أخبرني يوسف بن، عبد الله بن الحارث عن أبي العالية، عن ابن عباس، أن النبي صلى الله عليه وسلم كان إذا حزبه أمر قال ‏.‏ فذكر بمثل حديث معاذ عن أبيه وزاد معهن ‏\"‏ لا إله إلا الله رب العرش الكريم ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas reported this hadith through another chain of transmitters with a sliglit variation of wording.",
      "chain": [
        "38487",
        "20214",
        "20021",
        "10728",
        "11618",
        "17"
      ]
    },
    {
      "hadith_no": "7300",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا عبد العزيز بن محمد، أخبرنا موسى بن، عقبة ح وحدثني محمد بن حاتم، - واللفظ له - حدثنا بهز، حدثنا وهيب، حدثنا موسى، بن عقبة قال سمعت أبا سلمة بن عبد الرحمن بن عوف، يحدث عن عائشة، زوج النبي صلى الله عليه وسلم أنها كانت تقول قال رسول الله صلى الله عليه وسلم ‏\"‏ سددوا وقاربوا وأبشروا فإنه لن يدخل الجنة أحدا عمله ‏\"‏ ‏.‏ قالوا ولا أنت يا رسول الله قال ‏\"‏ ولا أنا إلا أن يتغمدني الله منه برحمة واعلموا أن أحب العمل إلى الله أدومه وإن قل ‏\"‏ ‏.‏",
      "text_en": " A'isha, the wife of Allah's Apostle (may peace be upon him), reported that Allah's Messenger (may peace be upon him) used to say:                      Observe moderation (in doing deeds), and if yciu fail to observe it perfectly, try to do as much as you can do (to live up to this ideal of moderation) and be happy for none would be able to get into Paradise because of his deeds alone. They (the Companions of the Holy Prophet) said: Allah's Messenger, not even thou? Thereupon he said: Not even I, but that Allah wraps me in His Mercy, and bear this in mind that the deed loved most by Allah is one which is done constantly even though it is insignificant.",
      "chain": [
        "30123",
        "20167",
        "11106",
        "38487",
        "20214",
        "20299",
        "11106",
        "10567"
      ]
    },
    {
      "hadith_no": "7381",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثني زهير بن حرب، حدثنا أحمد بن إسحاق، ح وحدثني محمد بن حاتم، حدثنا  بهز، قالا جميعا حدثنا وهيب، حدثنا عبد الله بن طاوس، عن أبيه، عن أبي هريرة، عن  النبي صلى الله عليه وسلم قال ‏\"‏ يحشر الناس على ثلاث طرائق راغبين راهبين واثنان على بعير وثلاثة على بعير وأربعة على بعير وعشرة على بعير وتحشر بقيتهم النار تبيت معهم حيث باتوا وتقيل معهم حيث قالوا وتصبح معهم حيث أصبحوا وتمسي معهم حيث أمسوا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace be upon him) as saying, The people will be assembled in three categories. Those desirous (of Paradise), fearing (Hell), coming two upon the came], three upon the camel, four upon the camel, ten upon the camel and the rest will be assembled, Hell-Fire being with them when they are at midday where they would spend the night and where they would spend the morning and where they would spend the evening.",
      "chain": [
        "30022",
        "30289",
        "38487",
        "20214",
        "20299",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "1348",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا عمر بن عثمان، حدثنا مروان، - يعني ابن معاوية - عن بهز، حدثنا زرارة بن أوفى، عن عائشة أم المؤمنين، ‏:‏ أنها سئلت عن صلاة، رسول الله صلى الله عليه وسلم فقالت ‏:‏ كان يصلي بالناس العشاء، ثم يرجع إلى أهله فيصلي أربعا، ثم يأوي إلى فراشه، ثم ساق الحديث بطوله ولم يذكر ‏:‏ يسوي بينهن في القراءة والركوع والسجود ‏.‏ ولم يذكر في التسليم ‏:‏ حتى يوقظنا ‏.‏",
      "text_en": " Zurarah b. Awfa said that 'Aishah was asked about the prayer of the Messenger of Allah (ﷺ). She said:                      He used to lead the people in the 'Isha prayer and return to his family and pray four rak'ahs and go to his bed. The narrator then transmitted the tradition in full. This version does not mention the words: \"During them (the rak'ahs) he equated all the recitation of the Qur'an, bowing and recitation.\" This also does not mention the words about the salutation: \"Till he almost awakened us.\"",
      "chain": [
        "20201",
        "20214",
        "11284",
        "53"
      ]
    },
    {
      "hadith_no": "1872",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا بهز بن أسد، وهاشم، - يعني ابن القاسم - قالا حدثنا سليمان بن المغيرة، عن ثابت، عن عبد الله بن رباح، عن أبي هريرة، قال أقبل رسول الله صلى الله عليه وسلم فدخل مكة فأقبل رسول الله صلى الله عليه وسلم إلى الحجر فاستلمه ثم طاف بالبيت ثم أتى الصفا فعلاه حيث ينظر إلى البيت فرفع يديه فجعل يذكر الله ما شاء أن يذكره ويدعوه قال والأنصار تحته قال هاشم فدعا وحمد الله ودعا بما شاء أن يدعو ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Messenger of Allah (ﷺ) came an entered Mecca, and after the Messenger of Allah (ﷺ) had gone forward to the Stone, and touched it, he went round the House (the Ka'bah). He then went to as-Safa and mounted it so that he could look at the House. Then he raised his hands began to make mention of Allah as much as he wished and make supplication. The narrator said: The Ansar were beneath him. The narrator Hashim said: He prayed and praised Allah and asked Him for what he wished to ask.",
      "chain": [
        "30007",
        "20214",
        "20390",
        "20236",
        "11269",
        "11865",
        "13"
      ]
    },
    {
      "hadith_no": "2997",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن خلاد الباهلي، حدثنا بهز بن أسد، حدثنا حماد، أخبرنا ثابت، عن أنس، قال وقع في سهم دحية جارية جميلة فاشتراها رسول الله صلى الله عليه وسلم بسبعة أرؤس ثم دفعها إلى أم سليم تصنعها وتهيئها قال حماد وأحسبه قال وتعتد في بيتها صفية بنت حيى ‏.‏",
      "text_en": " Anas said “A beautiful slave girl fell to Dihyah”. The Apostle of Allaah(ﷺ) purchased her for seven slaves. He then gave her to Umm Sulaim for decorating her and preparing her for marriage. The narrator Hammad said, I think he said “Safiyyah daughter of Huyayy should pass her waiting period in her (Umm Sulaims’) house.”",
      "chain": [
        "20214",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "135",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا بندار، حدثنا يحيى بن سعيد، وعبد الرحمن بن مهدي، وبهز بن أسد، قالوا حدثنا حماد بن سلمة، عن حكيم الأثرم، عن أبي تميمة الهجيمي، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من أتى حائضا أو امرأة في دبرها أو كاهنا فقد كفر بما أنزل على محمد صلى الله عليه وسلم ‏\"‏ ‏.‏ قال أبو عيسى لا نعرف هذا الحديث إلا من حديث حكيم الأثرم عن أبي تميمة الهجيمي عن أبي هريرة ‏.‏ وإنما معنى هذا عند أهل العلم على التغليظ ‏.‏ وقد روي عن النبي صلى الله عليه وسلم قال ‏\"‏ من أتى حائضا فليتصدق بدينار ‏\"‏ ‏.‏ فلو كان إتيان الحائض كفرا لم يؤمر فيه بالكفارة ‏.‏ وضعف محمد هذا الحديث من قبل إسناده ‏.‏ وأبو تميمة الهجيمي اسمه طريف بن مجالد ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Prophet said: \"Whoever engages in sexual intercourse with a menstruating woman, or a woman in her anus, consults a soothsayer, then he has disbelieved in what was revealed to Muhammad.\"",
      "chain": [
        "30160",
        "20031",
        "20033",
        "20214",
        "20021",
        "19843",
        "11597",
        "13"
      ]
    },
    {
      "hadith_no": "28",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا سليمان بن عبيد الله، قال أنبأنا بهز، قال أنبأنا شعبة، عن سليمان، ومنصور، عن أبي وائل، عن حذيفة، أن النبي صلى الله عليه وسلم مشى إلى سباطة قوم فبال قائما ‏.‏ قال سليمان في حديثه ومسح على خفيه ولم يذكر منصور المسح ‏.‏",
      "text_en": " It was narrated from Hudhaifah that the Prophet (ﷺ) went to some people's garbage dump and urinated while standing. In his narration, Sulaiman bin 'Ubaidullah said:                      \"And he wiped over his Khuffs,\" but Mansur did not mention the wiping. [1][1]Meaning, in this route, since Shu'bah narrated it from both Sulaiman and Mansur.",
      "chain": [
        "38252",
        "20214",
        "20020",
        "11060",
        "11067",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "131",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عمرو بن يزيد، قال حدثنا بهز بن أسد، قال حدثنا شعبة، عن عبد الملك بن ميسرة، قال سمعت النزال بن سبرة، قال رأيت عليا - رضى الله عنه - صلى الظهر ثم قعد لحوائج الناس فلما حضرت العصر أتي بتور من ماء فأخذ منه كفا فمسح به وجهه وذراعيه ورأسه ورجليه ثم أخذ فضله فشرب قائما وقال إن ناسا يكرهون هذا وقد رأيت رسول الله صلى الله عليه وسلم يفعله وهذا وضوء من لم يحدث ‏.‏",
      "text_en": " An-Nazzal bin Sabrah said:                      \"I saw 'Ali (may Allah be please with him) praying Zuhr, then he sat to tend to the people's needs, and when the time for 'Asr came, a vessel of water was brought to him. He took a handful of it and wiped his face, forearms, head and feet with it, then he took what was left and drank standing up. He said: 'People dislike this, but I saw the Messenger of Allah (ﷺ) doing it. This is the Wudu' of one who has not committed Hadath.\"",
      "chain": [
        "20214",
        "20020",
        "11369",
        "11659"
      ]
    },
    {
      "hadith_no": "299",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عمرو بن يزيد، قال حدثنا بهز، قال حدثنا شعبة، قال الحكم أخبرني عن إبراهيم، عن همام بن الحارث، أن عائشة، قالت لقد رأيتني وما أزيد على أن أفركه من ثوب رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Hammam bin Al-Harith that 'Aishah said:                      \"I remember when I could do no more than rub it form the garment of the Messenger of Allah (ﷺ).\"",
      "chain": [
        "20214",
        "20020",
        "11069",
        "11051",
        "11400",
        "53"
      ]
    },
    {
      "hadith_no": "319",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عمرو بن يزيد، قال حدثنا بهز، قال حدثنا شعبة، قال حدثنا الحكم، عن ذر، عن ابن عبد الرحمن بن أبزى، عن أبيه، أن رجلا، سأل عمر بن الخطاب عن التيمم، فلم يدر ما يقول فقال عمار أتذكر حيث كنا في سرية فأجنبت فتمعكت في التراب فأتيت النبي صلى الله عليه وسلم فقال ‏\"‏ إنما يكفيك هكذا ‏\"‏ ‏.‏ وضرب شعبة بيديه على ركبتيه ونفخ في يديه ومسح بهما وجهه وكفيه مرة واحدة ‏.‏",
      "text_en": " It was narrated from Ibn 'Abdur-Rahman bin Abza, from his father, that a man asked 'Umar bin Al-Khattab about Tayammum and he did not know what to say. 'Ammar said:                      \"Do you remember when we were on a campaign, and I became Junub and rolled in the dust, then I came to the Prophet (ﷺ) and he said: 'This would have been sufficient.'\" (One of the narrators) Shu'bah struck his hands on his knees and blew into his hands, then he wiped his face and palms with them once.",
      "chain": [
        "20214",
        "20020",
        "11069",
        "11423",
        "11346",
        "4046",
        "3"
      ]
    },
    {
      "hadith_no": "337",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Water - كتاب المياه",
      "chapter_no": "2",
      "text_ar": "أخبرنا عمرو بن يزيد، قال حدثنا بهز بن أسد، قال حدثنا شعبة، عن أبي التياح، يزيد بن حميد قال سمعت مطرفا، يحدث عن عبد الله بن مغفل، قال أمر رسول الله صلى الله عليه وسلم بقتل الكلاب قال ‏\"‏ ما بالهم وبال الكلاب ‏\"‏ ‏.‏ قال ورخص في كلب الصيد وكلب الغنم وقال ‏\"‏ إذا ولغ الكلب في الإناء فاغسلوه سبع مرات وعفروا الثامنة بالتراب ‏\"‏ ‏.‏ خالفه أبو هريرة فقال إحداهن بالتراب ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Mughaffal said:                      \"The Messenger of Allah (ﷺ) commanded that dogs be killed. He said: 'What do they have to do with dogs?' And he granted a concession regarding hunting dogs and sheepdogs. And he said: 'If a dog licks a vessel, wash it seven times, and rub it the eighth time with dust.' Abu Hurairah differed from him and said: 'Rub it one time with dust.'\"",
      "chain": [
        "20214",
        "20020",
        "11395",
        "3242"
      ]
    },
    {
      "hadith_no": "468",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا محمد بن عثمان بن أبي صفوان الثقفي، قال حدثنا بهز بن أسد، قال حدثنا شعبة، قال حدثنا محمد بن عثمان بن عبد الله، وأبوه، عثمان بن عبد الله أنهما سمعا موسى بن طلحة، يحدث عن أبي أيوب، أن رجلا، قال يا رسول الله أخبرني بعمل يدخلني الجنة فقال رسول الله صلى الله عليه وسلم ‏\"‏ تعبد الله ولا تشرك به شيئا وتقيم الصلاة وتؤتي الزكاة وتصل الرحم ذرها ‏\"‏ كأنه كان على راحلته ‏.‏",
      "text_en": " It was narrated from Abu Ayyub that a man said:                      \"O Messenger of Allah, tell me of a deed that will gain me admittance to Paradise.\" The Messenger of Allah (ﷺ) said: 'Worship Allah and do not associate anything with Him, establish the Salah, pay the Zakah and upload the ties of kinship. Let go!'\" - as if he was riding his camel. [1][1] As if he was riding his camel and the man had grabbed hold of its reins to ask this question.",
      "chain": [
        "38549",
        "20214",
        "20020",
        "17668",
        "579",
        "33"
      ]
    },
    {
      "hadith_no": "483",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا عمرو بن يزيد، قال حدثنا بهز بن أسد، قال حدثنا شعبة، قال أخبرني الحكم، قال صلى بنا سعيد بن جبير بجمع المغرب ثلاثا بإقامة ثم سلم ثم صلى العشاء ركعتين ثم ذكر أن عبد الله بن عمر فعل ذلك وذكر أن رسول الله صلى الله عليه وسلم فعل ذلك ‏.‏",
      "text_en": " Al-Hakam said:                      \"Sa'eed bin Jubair led us in prayer in Jam'. (He prayed) Maghrib, three Rak'ahs with an Iqamah, then he prayed 'Isha', two Rak'ahs. Then he mentioned that 'Abdullah bin 'Umar had done that, and he mentioned that the Messenger of Allah (ﷺ) had done that.\"",
      "chain": [
        "20214",
        "20020",
        "11069"
      ]
    },
    {
      "hadith_no": "484",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا عمرو بن يزيد، قال حدثنا بهز بن أسد، قال حدثنا شعبة، قال حدثنا سلمة بن كهيل، قال سمعت سعيد بن جبير، قال رأيت عبد الله بن عمر صلى بجمع فأقام فصلى المغرب ثلاثا ثم صلى العشاء ركعتين ثم قال هكذا رأيت رسول الله صلى الله عليه وسلم يصنع في هذا المكان ‏.‏",
      "text_en": " Salamah bin Kuhail narrated:                      \"I heard Sa'eed bin Jubair say: 'I saw 'Abdullah bin 'Umar pray in Jam'; he made the Iqamah and prayed Maghrib, three Rak'ahs, then he prayed 'Isha', two Rak'ahs, then he said: 'This is what I saw the Messenger of Allah (ﷺ) do in this place.'\"",
      "chain": [
        "20214",
        "20020",
        "11350",
        "11050"
      ]
    },
    {
      "hadith_no": "813",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا أبو بكر بن نافع، قال حدثنا بهز بن أسد، قال حدثنا حماد بن سلمة، عن ثابت، عن أنس، أن النبي صلى الله عليه وسلم كان يقول ‏\"‏ استووا استووا استووا فوالذي نفسي بيده إني لأراكم من خلفي كما أراكم من بين يدى ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas that the Prophet (ﷺ) used to say:                      \"Make your rows straight, make your rows straight, make your rows straight. By the One in Whose Hand is my soul! I can see you behind me as I can see you in front of me.\"",
      "chain": [
        "20523",
        "20214",
        "20021",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "1227",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا سليمان بن عبيد الله، قال حدثنا بهز بن أسد، قال حدثنا شعبة، عن سعد بن إبراهيم، أنه سمع أبا سلمة، يحدث عن أبي هريرة، أن رسول الله صلى الله عليه وسلم صلى صلاة الظهر ركعتين ثم سلم فقالوا أقصرت الصلاة فقام وصلى ركعتين ثم سلم ثم سجد سجدتين ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah (ﷺ) prayed Zuhr with two rak'ahs, then said the salam. They said: \"Has the prayer been shortened?\" So he stood up and prayed two rak'ahs, then he said the salam, then he prostrated twice.",
      "chain": [
        "38252",
        "20214",
        "20020",
        "11063",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1563",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Prayer for the Two 'Eids - كتاب صلاة العيدين",
      "chapter_no": "19",
      "text_ar": "أخبرنا محمد بن عثمان، قال حدثنا بهز، قال حدثنا شعبة، قال أخبرني زبيد، قال سمعت الشعبي، يقول حدثنا البراء بن عازب، عند سارية من سواري المسجد قال خطب النبي صلى الله عليه وسلم يوم النحر فقال ‏\"‏ إن أول ما نبدأ به في يومنا هذا أن نصلي ثم نذبح فمن فعل ذلك فقد أصاب سنتنا ومن ذبح قبل ذلك فإنما هو لحم يقدمه لأهله ‏\"‏ ‏.‏ فذبح أبو بردة بن نيار فقال يا رسول الله عندي جذعة خير من مسنة ‏.‏ قال ‏\"‏ اذبحها ولن توفي عن أحد بعدك ‏\"‏ ‏.‏",
      "text_en": " Al-Bara' bin 'Azib narrated to us by one of the pillars of the masjid:                     \"The Prophet (ﷺ) delivered a Khutbah on the day of An-Nahr and said: 'The first thing we start with on this day of ours is the prayer, then we offer sacrifice. Whoever does that, he has followed our sunnah, but whoever slaughtered (his sacrifice) before the (prayer), that is just meat that he gave to his family. Abu Burdah bin Niyar had slaughtered his sacrifice and he said: 'O Messenger of Allah (ﷺ), I have a Jadha'ah that is better than a Musinnah.' He said: 'Slaughter it (as a sacrifice), but that will not be sufficient for anyone else (as a sacrifice) after you.'\"",
      "chain": [
        "38549",
        "20214",
        "20020",
        "11335",
        "11052",
        "400"
      ]
    },
    {
      "hadith_no": "1732",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عمرو بن يزيد، قال حدثنا بهز بن أسد، قال حدثنا شعبة، عن سلمة، وزبيد، عن ذر، عن ابن عبد الرحمن بن أبزى، عن أبيه، أن رسول الله صلى الله عليه وسلم كان يوتر ب ‏{‏ سبح اسم ربك الأعلى ‏}‏ و ‏{‏ قل يا أيها الكافرون ‏}‏ و ‏{‏ قل هو الله أحد ‏}‏ وكان يقول إذا سلم ‏\"‏ سبحان الملك القدوس ‏\"‏ ‏.‏ ثلاثا ويرفع صوته بالثالثة ‏.‏",
      "text_en": " Bahz bin Asad, said:                     \"Shu'bah narrated to us, from Salamah and Zubaid, from Dharr, from Ibn Abdur-Rahman bin Abza from his father that the Messenger of Allah (ﷺ) used to recite in Witr: \"Glorify the Name of your Lord, the Most High;\" and \"Say: O you disbelievers!;' and 'Say: He is Allah, (the) One.' And when he said the taslim, he would say: Subhanal-Malikil-Quddus (Glory be to the Sovereign, the Most Holy) three times, raising his voice the third time.\"",
      "chain": [
        "20214",
        "20020",
        "237",
        "11335",
        "11423",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "1845",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عمرو بن يزيد، قال حدثنا بهز بن أسد، قال حدثنا شعبة، عن محمد بن المنكدر، عن جابر، أن أباه، قتل يوم أحد - قال - فجعلت أكشف عن وجهه، وأبكي، والناس، ينهوني ورسول الله صلى الله عليه وسلم لا ينهاني وجعلت عمتي تبكيه فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تبكيه ما زالت الملائكة تظله بأجنحتها حتى رفعتموه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir that his father was killed on the day of Uhud. He saide:                     \"I started to uncover his face, weeping. The people told me not to do that but the Messenger of Allah did not forbid me. My paternal aunt started to weep, and the Messenger of Allah said: 'Do not weep, for angels kept on shading him with their wings until you lifted him up.\"'",
      "chain": [
        "20214",
        "20020",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "2133",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عمرو بن يزيد، - هو أبو بريد الجرمي بصري - عن بهز، قال حدثنا شعبة، عن سلمة، عن أبي الحكم، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ أتاني جبريل عليه السلام فقال الشهر تسع وعشرون يوما ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that the Prophet said:                     \"Jibril, peace be upon him, came to me and said: 'The month is twenty-nine days.\"'",
      "chain": [
        "20214",
        "20020",
        "237",
        "17"
      ]
    },
    {
      "hadith_no": "2459",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا عمرو بن يزيد، قال حدثنا بهز بن أسد، قال حدثنا شعبة، قال عمرو بن مرة أخبرني قال سمعت عبد الله بن أبي أوفى، قال كان رسول الله صلى الله عليه وسلم إذا أتاه قوم بصدقتهم قال ‏\"‏ اللهم صل على آل فلان ‏\"‏ ‏.‏ فأتاه أبي بصدقته فقال ‏\"‏ اللهم صل على آل أبي أوفى ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Abi Awfa said:                     \"When people brought their Zakah to him, the Messenger of Allah would say: 'O Allah, send salah upon the family of so-and-so,' My father brought his Sadaqah to him and he said: 'O Allah, send Salah upon the family of Abu Awfa.\"'",
      "chain": [
        "20214",
        "20020",
        "11381",
        "5115"
      ]
    },
    {
      "hadith_no": "2614",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا عمرو بن يزيد، قال حدثنا بهز بن أسد، قال حدثنا شعبة، قال حدثنا الحكم، عن إبراهيم، عن الأسود، عن عائشة، أنها أرادت أن تشتري، بريرة فتعتقها وأنهم اشترطوا ولاءها فذكرت ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ اشتريها واعتقيها فإن الولاء لمن أعتق ‏\"‏ ‏.‏ وخيرت حين أعتقت وأتي رسول الله صلى الله عليه وسلم بلحم فقيل هذا مما تصدق به على بريرة ‏.‏ فقال ‏\"‏ هو لها صدقة ولنا هدية ‏\"‏ ‏.‏ وكان زوجها حرا ‏.‏",
      "text_en": " It was narrated from 'Aishah that:                     she wanted to buy Barirah and set her free, but they stipulated that her loyally as a freed slave (wala') should be to them. She mentioned that to the Messenger of Allah and he said: \"Buy her and set her fee, and loyally is due to the one who frees the slave.\" She was given the choice when she was freed. Some meat was brought to the Messenger of Allah and it was said: \"This is something that is given in charity to Barirah.\" He said: \"It is charity for her and gift for us.\" And her husband was a free man.",
      "chain": [
        "20214",
        "20020",
        "11069",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "3160",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا أبو بكر بن نافع، قال حدثنا بهز، قال حدثنا حماد، عن ثابت، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يؤتى بالرجل من أهل الجنة فيقول الله عز وجل يا ابن آدم كيف وجدت منزلك فيقول أى رب خير منزل ‏.‏ فيقول سل وتمن فيقول أسألك أن تردني إلى الدنيا فأقتل في سبيلك عشر مرات لما يرى من فضل الشهادة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas said:                      \"The Messenger of Allah (ﷺ) said: 'A man from among the people of Paradise will be brought and Allah, the Mighty and Sublime, will say: \"O son of Adam, how do you find your place (in Paradise)?\" He would say: \"O Lord, it is the best place.\" He will say: \"Ask and wish (for whatever you want).\" He would say: \"I ask You to send me back to the world so that I may be killed in Your cause ten time\" - because of what be sees of the virtue of martyrdom.'\"",
      "chain": [
        "20523",
        "20214",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3373",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا أبو بكر بن نافع، قال حدثنا بهز بن أسد، قال حدثنا حماد، قال حدثنا ثابت، عن أنس، أن عبد الرحمن بن عوف، جاء وعليه ردع من زعفران فقال رسول الله صلى الله عليه وسلم ‏\"‏ مهيم ‏\"‏ ‏.‏ قال تزوجت امرأة ‏.‏ قال ‏\"‏ وما أصدقت ‏\"‏ ‏.‏ قال وزن نواة من ذهب ‏.‏ قال ‏\"‏ أولم ولو بشاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas that 'Abdur-Rahman bin 'Awf came with a trace of saffron on him, and the Messenger of Allah said:                      \"What's this for?\" He said: \"I have married a woman.\" He said: \"What dowry did you give?\" He said: \"The weight of a Nawah (five Dirhams) of gold.\" He said: \"Give a Walimah (wedding feast) even if it is with one sheep.\"",
      "chain": [
        "20523",
        "20214",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3436",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا أبو بكر بن نافع، قال حدثنا بهز، قال حدثنا حماد بن سلمة، قال حدثنا ثابت، عن أنس، قال كان لرسول الله صلى الله عليه وسلم جار فارسي طيب المرقة فأتى رسول الله صلى الله عليه وسلم ذات يوم وعنده عائشة فأومأ إليه بيده أن تعال وأومأ رسول الله صلى الله عليه وسلم إلى عائشة أى وهذه فأومأ إليه الآخر هكذا بيده أن لا مرتين أو ثلاثا ‏.‏",
      "text_en": " It was narrated that Anas said:                      \"The Messenger of Allah had a Persian neighbor who was good at making soup. He came to the Messenger of Allah one day when 'Aishah was with him, and gestured to him with his hand to come. The Messenger of Allah gestured toward 'Aishah -meaning: 'What about her?'- and the man gestured to him like this, meaning, 'No,' two or three times.\"",
      "chain": [
        "20523",
        "20214",
        "20021",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3602",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Endowments - كتاب الإحباس",
      "chapter_no": "29",
      "text_ar": "أخبرنا أبو بكر بن نافع، قال حدثنا بهز، قال حدثنا حماد، قال حدثنا ثابت، عن أنس، قال لما نزلت هذه الآية ‏{‏ لن تنالوا البر حتى تنفقوا مما تحبون ‏}‏ قال أبو طلحة إن ربنا ليسألنا عن أموالنا فأشهدك يا رسول الله أني قد جعلت أرضي لله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اجعلها في قرابتك في حسان بن ثابت وأبى بن كعب ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas said:                      \"When this Verse was revealed -'By no means shall you attain Al Birr (piety, righteousness--here it means Allah's reward, i.e. Paradise), unless you spend (in Allah's cause) of that which you love'- Abu Talha said: 'Our Lord will ask us about our wealth. I adjure you, O Messenger of Allah! I am giving my land to Allah.' The Messenger of Allah said: 'Make it for your relatives, Hassan bin Thabit and Ubayy bin Ka'b.'\"",
      "chain": [
        "20523",
        "20214",
        "20022",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3787",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عمرو بن يزيد، قال حدثنا بهز بن أسد، قال حدثنا شعبة، قال أخبرني عبد العزيز بن رفيع، قال سمعت تميم بن طرفة، يحدث عن عدي بن حاتم، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف على يمين فرأى خيرا منها فليأت الذي هو خير وليترك يمينه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Adiyy bin Hatim said:                      \"The Messenger of Allah said: 'Whoever swears an oath, then sees something better than it, let him do that which is better and leave his oath.'\"",
      "chain": [
        "20214",
        "20020",
        "11257",
        "10894",
        "212"
      ]
    },
    {
      "hadith_no": "4034",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن نافع أبو بكر، قال حدثنا بهز، قال حدثنا حماد، قال حدثنا قتادة، وثابت، عن أنس، أن نفرا، من عرينة نزلوا في الحرة فأتوا النبي صلى الله عليه وسلم فاجتووا المدينة فأمرهم رسول الله صلى الله عليه وسلم أن يكونوا في إبل الصدقة وأن يشربوا من ألبانها وأبوالها فقتلوا الراعي وارتدوا عن الإسلام واستاقوا الإبل فبعث رسول الله صلى الله عليه وسلم في آثارهم فجيء بهم فقطع أيديهم وأرجلهم وسمر أعينهم وألقاهم في الحرة ‏.‏ قال أنس فلقد رأيت أحدهم يكدم الأرض بفيه عطشا حتى ماتوا ‏.‏",
      "text_en": " It was narrated from Anas that :                     Some people from 'Uraynah camped in Al-Harrah and came to the Messenger of Allah [SAW]. The climate of Al-Madinah did not suit them, so the Messenger of Allah [SAW] told them to go and stay near the camels that had been given in Sadaqah, and to drink their milk and urine. Then they killed the herdsman and apostatized from Islam, and drove off the camels. The Messenger of Allah [SAW] sent (men) after them, who brought them, then he had their hands and feet cut off, and their eyes gouged out, and left them in Al-Harrah. Anas said: \"I saw one of them biting at the ground from thirst, until they died.\"",
      "chain": [
        "20214",
        "20022",
        "11019",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "4272",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا سليمان بن عبيد الله بن عمرو الغيلاني البصري، قال حدثنا بهز، قال حدثنا شعبة، قال حدثنا عبد الله بن أبي السفر، عن عامر الشعبي، عن عدي بن حاتم، قال سألت رسول الله صلى الله عليه وسلم قلت أرسل كلبي ‏.‏ قال ‏\"‏ إذا أرسلت كلبك فسميت فكل وإن أكل منه فلا تأكل فإنما أمسك على نفسه وإذا أرسلت كلبك فوجدت معه غيره فلا تأكل فإنك إنما سميت على كلبك ولم تسم على غيره ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Adiyy bin Hatim said:                     \"I asked the Messenger of Allah: 'I release my dog. He said: 'If you release your dog and mention the name of Allah, then eat. But it he has eaten some of it, the do not eats, for the caught it for himself. If you release your dog then you find another dog with it, then do not eat, for you said the name of Allah over your dog, and not over any other.\"\"",
      "chain": [
        "20214",
        "20020",
        "11636",
        "11052",
        "212"
      ]
    },
    {
      "hadith_no": "4321",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا عمرو بن يزيد، قال حدثنا بهز بن أسد، قال حدثنا شعبة، قال حدثني عدي بن ثابت، قال سمعت زيد بن وهب، يحدث عن ثابت بن وديعة، قال جاء رجل إلى رسول الله صلى الله عليه وسلم بضب فجعل ينظر إليه ويقلبه وقال ‏\"‏ إن أمة مسخت لا يدرى ما فعلت وإني لا أدري لعل هذا منها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Thabit bin Wadi ah said:                     \"A man brought a mastigure to the Messenger of Allah and he started looking at it, and turning it over. He said: 'A nation was transformed, it is not known what they did, and I do not know if this is one of them.\"",
      "chain": [
        "20214",
        "20020",
        "11372",
        "11341"
      ]
    },
    {
      "hadith_no": "4479",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عمرو بن يزيد، عن بهز بن أسد، قال حدثنا شعبة، قال حدثنا عبد الله بن دينار، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كل بيعين فلا بيع بينهما حتى يتفرقا إلا بيع الخيار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Shu'ban who said:                     \"Abdullah bin Dinr narrated to us, from Ibn'Umar, who said; The Messenger of Allah said; \"When two people meet to engage in trade, the transaction between them is not binding until they separate, unless    they have       chosen to conclude the transaction.\"",
      "chain": [
        "20214",
        "20020",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "4784",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا عبد الرحمن بن مهدي، وبهز بن أسد، وعفان بن مسلم، قالوا حدثنا عبد الله بن بكر المزني، قال حدثنا عطاء بن أبي ميمونة، ولا أعلمه إلا عن أنس بن مالك، قال ما أتي النبي صلى الله عليه وسلم في شىء فيه قصاص إلا أمر فيه بالعفو ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"No case requiring Qisas was ever brought to the Messenger of Allah but he would enjoin pardoning.\"",
      "chain": [
        "30160",
        "20033",
        "20214",
        "30106",
        "24229",
        "11601",
        "19"
      ]
    },
    {
      "hadith_no": "5285",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أبو بكر بن نافع، قال حدثنا بهز بن أسد، قال حدثنا حماد، قال حدثنا ثابت، أنهم سألوا أنسا عن خاتم، رسول الله صلى الله عليه وسلم قال كأني أنظر إلى وبيص خاتمه من فضة ‏.‏ ورفع إصبعه اليسرى الخنصر ‏.‏",
      "text_en": " Thabit narrated that :                     They asked Anas about the ring of the Messenger of Allah [SAW] and he said: \"It is as if I can see the shining of his silver ring, and he raised his right little finger.\"",
      "chain": [
        "20523",
        "20214",
        "20022"
      ]
    },
    {
      "hadith_no": "5645",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا عمرو بن يزيد، قال حدثنا بهز بن أسد، قال حدثنا شعبة، قال أخبرني عمرو بن مرة، قال سمعت زاذان، قال سألت عبد الله بن عمر قلت حدثني بشىء، سمعته من، رسول الله صلى الله عليه وسلم في الأوعية وفسره قال نهى رسول الله صلى الله عليه وسلم عن الحنتم وهو الذي تسمونه أنتم الجرة ونهى عن الدباء وهو الذي تسمونه أنتم القرع ونهى عن النقير وهي النخلة ينقرونها ونهى عن المزفت وهو المقير ‏.‏",
      "text_en": " Zadan said:                     \"I asked 'Abdullah bin 'Umar: 'Tell me of something that you heard from the Messenger of Allah [SAW] concerning vessels and explain it.' He said: 'The Messenger of Allah [SAW] forbade Al-Hantam, which are what you call earthenware jars. And he forbade Ad-Dubba' which are what you call squash. And he forbade An-Naqir, which are hollowed-out date palm wood. And he forbade Al-Muzaffat which are (Al-Muqayyar) vessels daubed with tar.'\"",
      "chain": [
        "20214",
        "20020",
        "11381",
        "10911",
        "18"
      ]
    },
    {
      "hadith_no": "1235",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو عمر، حفص بن عمرو حدثنا بهز بن أسد، حدثنا حماد بن سلمة، حدثني هشام بن عمرو الفزاري، عن عبد الرحمن بن الحارث بن هشام المخزومي، عن علي بن أبي طالب، ‏.‏ أن النبي  صلى الله عليه وسلم  كان يقول في آخر وتره ‏\"‏ اللهم إني أعوذ برضاك من سخطك وأعوذ بمعافاتك من عقوبتك وأعوذ بك منك لا أحصي ثناء عليك أنت كما أثنيت على نفسك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Aki bin Abi Talib that the Prophet (ﷺ) usedto sayat the end of Witr:                      “Allahumma inni a’udhu bika biridaka minsakhatika, wa a’udhu bimu’afatika min ‘uqubatika, wa a’udhubikaminka, la uhsi thana’an ‘alaika, Anta kama athnaita ‘alanafsika (OAllah, I seek refuge in Your pleasure from Your wrath, andI seekrefuge in Your forgiveness from your punishment, and I seekrefuge inYou from You. I cannot enumerate Your praise, You are asYou havepraised Yourself).”",
      "chain": [
        "20214",
        "20021"
      ]
    },
    {
      "hadith_no": "1480",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن خلاد الباهلي، حدثنا بهز بن أسد، حدثنا حماد بن سلمة، عن عمار بن أبي عمار، عن ابن عباس، ‏.‏ وعن ثابت، عن أنس، أن النبي  صلى الله عليه وسلم  كان يخطب إلى جذع فلما اتخذ المنبر ذهب إلى المنبر فحن الجذع فأتاه فاحتضنه فسكن ‏.‏ فقال ‏\"‏ لو لم أحتضنه لحن إلى يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Anas that the Prophet (ﷺ) used to deliver thesermonleaning on a tree trunk. When he started to use the pulpit, hewentto the pulpit, and the trunk made a sorrowful souond. So he cametoit and embraced it, and it calmed down. He said:                      “If I had notembraced it, it would have continued to grieve until the Day ofResurrection.”",
      "chain": [
        "30357",
        "20214",
        "20021",
        "10951",
        "11269",
        "19"
      ]
    }
  ],
  "total_hadiths": 99
}