{
  "id": "20215",
  "name": "Thabit bin Yazid al-Ahwl ثابت بن يزيد الأحول",
  "full_name": "Thabit bin Yazid al-Ahwl ثابت بن يزيد الأحول",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "169",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11312",
      "name": "Hilal bin Khbab هلال بن خباب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11220",
      "name": "Muhammad bin 'Amr bin 'Alqama محمد بن عمرو بن علقمة",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "20389",
      "name": "Mua'wiya bin 'Amr bin al-Mhlb معاوية بن عمرو بن المهلب بن عمرو",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20040",
      "name": "Musa bin Isma'il al-Munqari al-Tabudhaki موسى بن إسماعيل المنقري - لتبوذكي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30211",
      "name": "Muhammad bin al-Salt bin al-Hajjaj محمد بن الصلت بن الحجاج الأسدي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20283",
      "name": "Muhammad bin al-Fadl 'Aram محمد بن الفضل السدوسي أبو النعمان عارم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "728",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا موسى، حدثنا ثابت بن يزيد، حدثنا عاصم، عن الشعبي، عن ابن عباس  رضى الله عنهما  قال قمت ليلة أصلي عن يسار النبي صلى الله عليه وسلم فأخذ بيدي أو بعضدي حتى أقامني عن يمينه، وقال بيده من ورائي‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     One night I stood to the left of the Prophet in the prayer but he caught hold of me by the hand or by the shoulder (arm) till he made me stand on his right and beckoned with his hand (for me) to go from behind (him). (Al-Kashmaihani [??] , Fath-ul-Bari).",
      "chain": [
        "20040",
        "20215",
        "11080",
        "11052",
        "17"
      ]
    },
    {
      "hadith_no": "1900",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو النعمان، حدثنا ثابت بن يزيد، حدثنا عاصم أبو عبد الرحمن الأحول، عن أنس  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ المدينة حرم، من كذا إلى كذا، لا يقطع شجرها، ولا يحدث فيها حدث، من أحدث حدثا فعليه لعنة الله والملائكة والناس أجمعين ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"Medina is a sanctuary from that place to that. Its trees should not be cut and no heresy should be innovated nor any sin should be committed in it, and whoever innovates in it an heresy or commits sins (bad deeds), then he will incur the curse of Allah, the angels, and all the people.\" (See Hadith No. 409, Vol 9).",
      "chain": [
        "20283",
        "20215",
        "11080",
        "19"
      ]
    },
    {
      "hadith_no": "3170",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا أبو النعمان، حدثنا ثابت بن يزيد، حدثنا عاصم، قال سألت أنسا  رضى الله عنه  عن القنوت‏.‏ قال قبل الركوع‏.‏ فقلت إن فلانا يزعم أنك قلت بعد الركوع، فقال كذب‏.‏ ثم حدثنا عن النبي صلى الله عليه وسلم أنه قنت شهرا بعد الركوع يدعو على أحياء من بني سليم  قال  بعث أربعين أو سبعين  يشك فيه  من القراء إلى أناس من المشركين، فعرض لهم هؤلاء فقتلوهم، وكان بينهم وبين النبي صلى الله عليه وسلم عهد، فما رأيته وجد على أحد ما وجد عليهم‏.‏",
      "text_en": " Narrated `Asim:                     I asked Anas about the Qunut (i.e. invocation in the prayer). Anas said, \"It should be recited before bowing.\" I said, \"So-and-so claims that you say that it should be recited after bowing.\" He replied, \"He is mistaken.\" Then Anas narrated to us that the Prophet invoked evil on the tribe of Bani-Sulaim for one month after bowing. ' Anas Further said, \"The Prophet had sent 40 or 70 Qaris (i.e. men well versed in the knowledge of the Qur'an) to some pagans, but the latter struggled with them and martyred them, although there was a peace pact between them and the Prophet I had never seen the Prophet so sorry and worried about anybody as he was about them (i.e. the Qaris).",
      "chain": [
        "20283",
        "20215",
        "11080",
        "19"
      ]
    },
    {
      "hadith_no": "5542",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا ثابت بن يزيد، حدثنا عاصم، عن الشعبي، عن عدي بن حاتم  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أرسلت كلبك وسميت فأمسك وقتل، فكل، وإن أكل فلا تأكل، فإنما أمسك على نفسه، وإذا خالط كلابا لم يذكر اسم الله عليها فأمسكن وقتلن فلا تأكل، فإنك لا تدري أيها قتل، وإن رميت الصيد فوجدته بعد يوم أو يومين، ليس به إلا أثر سهمك، فكل، وإن وقع في الماء فلا تأكل ‏\"‏‏.‏",
      "text_en": " Narrated Adi bin Hatim:                     The Prophet said, \"If you let loose your hound after a game and mention Allah's Name on sending it, and the hound catches the game and kills it, then you can eat of it. But if the hound eats of it, then you should not eat thereof, for the hound has caught it for itself. And if along with your hound, join other hounds, and Allah's Name was not mentioned at the time of their sending, and they catch an animal and kill it, you should not ea: of it, for you will not know which of them has killed it. And if you have thrown an arrow at the game and then find it (dead) two or three days later and, it bears no mark other than the wound inflicted by your arrow, then you can eat of it. But if the game is found (dead) in water, then do not eat of it.\" And it has also been narrated by `Adi bin Hatim that he asked the Prophet \"If a hunter throws an arrow at the game and after tracing it for two or three days he finds it dead but still bearing his arrow, (can he eat of it)?\" The Prophet replied, \"He can eat if he wishes.\"",
      "chain": [
        "20040",
        "20215",
        "11080",
        "11052",
        "212"
      ]
    },
    {
      "hadith_no": "1443",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن معاوية الجمحي، حدثنا ثابت بن يزيد، عن هلال بن خباب، عن عكرمة، عن ابن عباس، قال قنت رسول الله صلى الله عليه وسلم شهرا متتابعا في الظهر والعصر والمغرب والعشاء وصلاة الصبح في دبر كل صلاة إذا قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ من الركعة الآخرة يدعو على أحياء من بني سليم على رعل وذكوان وعصية ويؤمن من خلفه ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) recited the supplication (Qunut) daily for a month at the noon, afternoon, sunset, night and morning prayers. When he said: \"Allah listens to him who praises Him\" in the last rak'ah, invoking a curse on some clans of Banu Sulaym, Ri'l, Dhakwan and Usayyah, and those who were standing behind him said: Amen.",
      "chain": [
        "34120",
        "20215",
        "11312",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2360",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا عبد الله بن معاوية الجمحي، حدثنا ثابت بن يزيد، عن هلال بن خباب، عن عكرمة، عن ابن عباس، قال كان رسول الله صلى الله عليه وسلم يبيت الليالي المتتابعة طاويا وأهله لا يجدون عشاء وكان أكثر خبزهم خبز الشعير ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Ibn 'Abbas  said:                     \" The Messenger of Allah (s.a.w) would spend many consecutive nights and his family did not have supper, and most of the time their bread was barley bread.\"",
      "chain": [
        "34120",
        "20215",
        "11312",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3652",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا محمد بن الفضل، حدثنا ثابت بن يزيد، عن هلال بن خباب، عن عكرمة، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ تحشرون حفاة عراة غرلا ‏\"‏ ‏.‏ فقالت امرأة أيبصر أو يرى بعضنا عورة بعض قال ‏\"‏ يا فلانة‏:‏ ‏(‏لكل امرئ منهم يومئذ شأن يغنيه ‏)‏ ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح قد روي من غير وجه عن ابن عباس رواه سعيد بن جبير أيضا ‏.‏ وفيه عن عائشة رضى الله عنها ‏.‏",
      "text_en": " Ibn Abbas narrated that :                     the Prophet said: “You will be gathered barefoot, naked and uncircumcised.” “A woman said: “Will we see” or “look at each other’s nakedness?” He said: “O so-and-so! Every man among them on that Day will have enough to make him careless of others.”",
      "chain": [
        "30553",
        "20283",
        "20215",
        "11312",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2766",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا أبو النعمان، قال حدثنا ثابت بن يزيد الأحول، قال حدثنا هلال بن خباب، قال سألت سعيد بن جبير عن الرجل، يحج يشترط قال الشرط بين الناس فحدثته حديثه - يعني عكرمة - فحدثني عن ابن عباس أن ضباعة بنت الزبير بن عبد المطلب أتت النبي صلى الله عليه وسلم فقالت يا رسول الله إني أريد الحج فكيف أقول قال ‏\"‏ قولي لبيك اللهم لبيك ومحلي من الأرض حيث تحبسني فإن لك على ربك ما استثنيت ‏\"‏ ‏.‏",
      "text_en": " Hilal bin Khabbab said:                     \"I asked Sa'eed bin Jubair about a man who performs Hajj and stipulates a condition. He said: 'Conditions are something that people do among themselves.' I narrated the Hadith of 'Ikrimah to him, and he narrated to me from Ibn 'Abbas, that Duba'ah bint Az-Zubair bin 'Abdul-Muttalib came to the Prophet, and said: 'O Messenger of Allah, I want to perform Hajj, so what should I say?' He said:  'Say: Labbaik Allahumma! Labbaika wa mahilli min al-ardihayth tahbisuni (Here I am, O Allah, Here I am, and I shall exit Ihram at any place where You decree that I cannot proceed.)\" And whatever condition you stipulate will be accepted by your Lord.\"",
      "chain": [
        "38088",
        "20283",
        "20215",
        "11312",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "4320",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا سليمان بن منصور البلخي، قال حدثنا أبو الأحوص، سلام بن سليم عن حصين، عن زيد بن وهب، عن ثابت بن يزيد الأنصاري، قال كنا مع رسول الله صلى الله عليه وسلم في سفر فنزلنا منزلا فأصاب الناس ضبابا فأخذت ضبا فشويته ثم أتيت به النبي صلى الله عليه وسلم فأخذ عودا يعد به أصابعه ثم قال ‏\"‏ إن أمة من بني إسرائيل مسخت دواب في الأرض وإني لا أدري أى الدواب هي ‏\"‏ ‏.‏ قلت يا رسول الله إن الناس قد أكلوا منها - قال - فما أمر بأكلها ولا نهى ‏.‏",
      "text_en": " It was narrated that Thabit bin Yazid Al-Ansari said:                     \"We were with the Prophet on a journey. We stopped to camp and the people caught some mastigures. I took a mastigure and grilled it, and brought it to the Prophet He took a palm stalk, and started counting his fingers with it, and said: 'A nation from among the children of Israel was turned into beats of the4 Earth, and I do not know what kind of animals they were, I said: 'O Messenger of Allah, the people ha e eaten some of them.' He did not tell them to eat it, and he did not forbid them from eating it.\"",
      "chain": [
        "38256",
        "15097",
        "11341",
        "20215"
      ]
    },
    {
      "hadith_no": "2533",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا عبد الله بن معاوية الجمحي، حدثنا ثابت بن يزيد، حدثنا هلال بن خباب، عن عكرمة، عن ابن عباس، أن رسول الله صلى الله عليه وسلم مات ودرعه رهن عند يهودي بثلاثين صاعا من شعير ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     the Messenger of Allah (ﷺ) died while his armor was pawned to a Jew for thirty Sa’s of barley.' ”",
      "chain": [
        "34120",
        "20215",
        "11312",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3360",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن فضيل، عن حصين، عن زيد بن وهب، عن ثابت بن يزيد الأنصاري، قال كنا مع النبي  صلى الله عليه وسلم  فأصاب الناس ضبابا فاشتووها فأكلوا منها فأصبت منها ضبا فشويته ثم أتيت به النبي  صلى الله عليه وسلم  فأخذ جريدة فجعل يعد بها أصابعه فقال ‏\"‏ إن أمة في بني إسرائيل مسخت دواب في الأرض وإني لا أدري لعلها هي ‏\"‏ ‏.‏ فقلت إن الناس قد اشتووها فأكلوها فلم يأكل ولم ينه ‏.‏",
      "text_en": " It wasnarrated that Thabit bin Yazid Al-Ansari said:                      “We were withtheProphet (ﷺ) and the people caught a mastigure. They grilled itandate from it. Then I caught a mastigure so I grilled it and broughtitto the Prophet (ﷺ). He took a palm stalk and started counting hisfinger with it, and said: ‘A nation from among the Children ofIsraelwas turned into beasts of the earth, and I do not know if thisisthey.’ I said: ‘The people have grilled them and eaten them.’He didnot eat it and he did not forbid it.”",
      "chain": [
        "30201",
        "20356",
        "15097",
        "11341",
        "20215"
      ]
    },
    {
      "hadith_no": "3472",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا عبد الله بن معاوية الجمحي، حدثنا ثابت بن يزيد، عن هلال بن خباب، عن عكرمة، عن ابن عباس، قال كان رسول الله  صلى الله عليه وسلم  يبيت الليالي المتتابعة طاويا وأهله لا يجدون العشاء وكان عامة خبزهم خبز الشعير ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Messenger of Allah (ﷺ)usedto spend many nights in a row hungry and his family could find nosupper, and usually their bread was barley bread.”",
      "chain": [
        "34120",
        "20215",
        "11312",
        "11023",
        "17"
      ]
    }
  ],
  "total_hadiths": 12
}