{
  "id": "20212",
  "name": "Bashr bin Muhammad al-Sakhtiyani بشر بن محمد السختياني",
  "full_name": "Bashr bin Muhammad al-Sakhtiyani بشر بن محمد السختياني",
  "grade": "3rd Century AH [10th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "224",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Merv"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  -  صدوق ]"
    ],
    "tags": [
      "al-Mervazi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20452",
      "name": "al-Fadl bin Musa al-Synany الفضل بن موسى السيناني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20183",
      "name": "Yahya bin Wadh يحيى بن واضح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "38024",
      "name": "Ahmed bin Syar bin Ayoub أحمد بن سيار بن أيوب",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "32",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا شعبة، ح‏.‏ قال وحدثني بشر، قال حدثنا محمد، عن شعبة، عن سليمان، عن إبراهيم، عن علقمة، عن عبد الله، قال لما نزلت ‏{‏الذين آمنوا ولم يلبسوا إيمانهم بظلم‏}‏ قال أصحاب رسول الله صلى الله عليه وسلم أينا لم يظلم فأنزل الله ‏{‏إن الشرك لظلم عظيم‏}‏‏.‏",
      "text_en": "      Narrated 'Abdullah:                          When the following Verse was revealed: \"It is those who believe and      confuse not their belief with wrong (worshipping others besides      Allah.)\" (6:83), the companions of Allah's Apostle asked, \"Who is      amongst us who had not done injustice (wrong)?\" Allah revealed: \"No      doubt, joining others in worship with Allah is a great injustice      (wrong) indeed.\" (31.13)",
      "chain": [
        "20296",
        "20020",
        "20212",
        "20278",
        "20020",
        "11005",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "67",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا مسدد، قال حدثنا بشر، قال حدثنا ابن عون، عن ابن سيرين، عن عبد الرحمن بن أبي بكرة، عن أبيه، ذكر النبي صلى الله عليه وسلم قعد على بعيره، وأمسك إنسان بخطامه  أو بزمامه  قال ‏\"‏ أى يوم هذا ‏\"‏‏.‏ فسكتنا حتى ظننا أنه سيسميه سوى اسمه‏.‏ قال ‏\"‏ أليس يوم النحر ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ فأى شهر هذا ‏\"‏‏.‏ فسكتنا حتى ظننا أنه سيسميه بغير اسمه‏.‏ فقال ‏\"‏ أليس بذي الحجة ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ فإن دماءكم وأموالكم وأعراضكم بينكم حرام كحرمة يومكم هذا، في شهركم هذا، في بلدكم هذا‏.‏ ليبلغ الشاهد الغائب، فإن الشاهد عسى أن يبلغ من هو أوعى له منه ‏\"‏‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abi Bakra's father:                     Once the Prophet was riding his camel and a man was holding its rein. The Prophet asked, \"What is the day today?\" We kept quiet, thinking that he might give that day another name. He said, \"Isn't it the day of Nahr (slaughtering of the animals of sacrifice)\" We replied, \"Yes.\" He further asked, \"Which month is this?\" We again kept quiet, thinking that he might give it another name. Then he said, \"Isn't it the month of Dhul-Hijja?\" We replied, \"Yes.\" He said, \"Verily! Your blood, property and honor are sacred to one another (i.e. Muslims) like the sanctity of this day of yours, in this month of yours and in this city of yours. It is incumbent upon those who are present to inform those who are absent because those who are absent might comprehend (what I have said) better than the present audience.\"",
      "chain": [
        "30175",
        "20212",
        "11071",
        "11035",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "385",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو الوليد، هشام بن عبد الملك قال حدثنا بشر بن المفضل، قال حدثني غالب القطان، عن بكر بن عبد الله، عن أنس بن مالك، قال كنا نصلي مع النبي صلى الله عليه وسلم فيضع أحدنا طرف الثوب من شدة الحر في مكان السجود‏.‏",
      "text_en": " Narrated Anas bin Malik:                     We used to pray with the Prophet and some of us used to place the ends of their clothes at the place of prostration because of scorching heat.",
      "chain": [
        "20296",
        "20212",
        "11299",
        "11267",
        "19"
      ]
    },
    {
      "hadith_no": "472",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا مسدد، قال حدثنا بشر بن المفضل، عن عبيد الله، عن نافع، عن ابن عمر، قال سأل رجل النبي صلى الله عليه وسلم وهو على المنبر ما ترى في صلاة الليل قال ‏\"‏ مثنى مثنى، فإذا خشي الصبح صلى واحدة، فأوترت له ما صلى ‏\"‏‏.‏ وإنه كان يقول اجعلوا آخر صلاتكم وترا، فإن النبي صلى الله عليه وسلم أمر به‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar said, \"While the Prophet was on the pulpit, a man asked him how to offer the night prayers. He replied, 'Pray two rak`at at a time and then two and then two and so on, and if you are afraid of the dawn (the approach of the time of the Fajr prayer) pray one rak`a and that will be the witr for all the rak`at which you have offered.\" Ibn `Umar said, \"The last rak`at of the night prayer should be odd, for the Prophet ordered it to be so.",
      "chain": [
        "30175",
        "20212",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "479",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا حامد بن عمر، عن بشر، حدثنا عاصم، حدثنا واقد، عن أبيه، عن ابن عمر، أو ابن عمرو شبك النبي صلى الله عليه وسلم أصابعه‏.‏",
      "text_en": " Narrated Ibn `Umar or Ibn `Amr:                     The Prophet clasped his hands, by interlacing his fingers.",
      "chain": [
        "30128",
        "20212",
        "11080",
        "19124"
      ]
    },
    {
      "hadith_no": "928",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا مسدد، قال حدثنا بشر بن المفضل، قال حدثنا عبيد الله، عن نافع، عن عبد الله، قال كان النبي صلى الله عليه وسلم يخطب خطبتين يقعد بينهما‏.‏",
      "text_en": " Narrated `Abdullah Ibn `Umar:                     The Prophet used to deliver two Khutbas and sit in between them.",
      "chain": [
        "30175",
        "20212",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1208",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا مسدد، حدثنا بشر، حدثنا غالب، عن بكر بن عبد الله، عن أنس بن مالك  رضى الله عنه  قال كنا نصلي مع النبي صلى الله عليه وسلم في شدة الحر، فإذا لم يستطع أحدنا أن يمكن وجهه من الأرض بسط ثوبه فسجد عليه‏.‏",
      "text_en": " Narrated Anas bin Malik:                     We used to pray with the Prophet in scorching heat, and if someone of us could not put his face on the earth (because of the heat) then he would spread his clothes and prostrate over them.",
      "chain": [
        "30175",
        "20212",
        "11299",
        "11267",
        "19"
      ]
    },
    {
      "hadith_no": "1279",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، حدثنا سلمة بن علقمة، عن محمد بن سيرين، قال توفي ابن لأم عطية  رضى الله عنها  فلما كان اليوم الثالث دعت بصفرة، فتمسحت به وقالت نهينا أن نحد أكثر من ثلاث إلا بزوج‏.‏",
      "text_en": " Narrated Muhammad bin Seereen:                     One of the sons of Um 'Atiyya died, and when it was the third day she asked for a yellow perfume and put it over her body, and said, \"We were forbidden to mourn for more than three days except for our husbands.\"",
      "chain": [
        "30175",
        "20212",
        "11593",
        "11035"
      ]
    },
    {
      "hadith_no": "1351",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا مسدد، أخبرنا بشر بن المفضل، حدثنا حسين المعلم، عن عطاء، عن جابر  رضى الله عنه  قال لما حضر أحد دعاني أبي من الليل فقال ما أراني إلا مقتولا في أول من يقتل من أصحاب النبي صلى الله عليه وسلم، وإني لا أترك بعدي أعز على منك، غير نفس رسول الله صلى الله عليه وسلم، فإن على دينا فاقض، واستوص بأخواتك خيرا‏.‏ فأصبحنا فكان أول قتيل، ودفن معه آخر في قبر، ثم لم تطب نفسي أن أتركه مع الآخر فاستخرجته بعد ستة أشهر، فإذا هو كيوم وضعته هنية غير أذنه‏.‏",
      "text_en": " Narrated Jabir:                     When the time of the Battle of Uhud approached, my father called me at night and said, \"I think that I will be the first amongst the companions of the Prophet to be martyred. I do not leave anyone after me dearer to me than you, except Allah's Apostle's soul and I owe some debt and you should repay it and treat your sisters favorably (nicely and politely).\" So in the morning he was the first to be martyred and was buried along with another (martyr). I did not like to leave him with the other (martyr) so I took him out of the grave after six months of his burial and he was in the same condition as he was on the day of burial, except a slight change near his ear.",
      "chain": [
        "30175",
        "20212",
        "11278",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "1960",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، حدثنا خالد بن ذكوان، عن الربيع بنت معوذ، قالت أرسل النبي صلى الله عليه وسلم غداة عاشوراء إلى قرى الأنصار ‏\"‏ من أصبح مفطرا فليتم بقية يومه، ومن أصبح صائما فليصم ‏\"‏‏.‏ قالت فكنا نصومه بعد، ونصوم صبياننا، ونجعل لهم اللعبة من العهن، فإذا بكى أحدهم على الطعام أعطيناه ذاك، حتى يكون عند الإفطار‏.‏",
      "text_en": " Narrated Ar-Rubi' bint Mu'awadh:                     \"The Prophet sent a messenger to the village of the Ansar in the morning of the day of 'Ashura' (10th of Muharram) to announce: 'Whoever has eaten something should not eat but complete the fast, and whoever is observing the fast should complete it.' \"She further said, \"Since then we used to fast on that day regularly and also make our boys fast. We used to make toys of wool for the boys and if anyone of them cried for, he was given those toys till it was the time of the breaking of the fast.\"",
      "chain": [
        "30175",
        "20212",
        "11158",
        "617"
      ]
    },
    {
      "hadith_no": "2523",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا مسدد، حدثنا بشر، عن عبيد الله، اختصره‏.‏",
      "text_en": " Narrated 'Ubaidullah:                     as above BRIEFLY.",
      "chain": [
        "30175",
        "20212"
      ]
    },
    {
      "hadith_no": "2654",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، حدثنا الجريري، عن عبد الرحمن بن أبي بكرة، عن أبيه  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ ألا أنبئكم بأكبر الكبائر ‏\"‏‏.‏ ثلاثا‏.‏ قالوا بلى يا رسول الله‏.‏ قال ‏\"‏ الإشراك بالله، وعقوق الوالدين ‏\"‏‏.‏ وجلس وكان متكئا فقال ‏\"‏ ألا وقول الزور ‏\"‏‏.‏ قال فما زال يكررها حتى قلنا ليته سكت‏.‏ وقال إسماعيل بن إبراهيم حدثنا الجريري حدثنا عبد الرحمن‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet said thrice, \"Should I inform you out the greatest of the great sins?\" They said, \"Yes, O Allah's Apostle!\" He said, \"To join others in worship with Allah and to be undutiful to one's parents.\" The Prophet then sat up after he had been reclining (on a pillow) and said, \"And I warn you against giving a false witness, and he kept on saying that warning till we thought he would not stop. (See Hadith No. 7, Vol. 8)",
      "chain": [
        "30175",
        "20212",
        "11286",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "2702",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا مسدد، حدثنا بشر، حدثنا يحيى، عن بشير بن يسار، عن سهل بن أبي حثمة، قال انطلق عبد الله بن سهل ومحيصة بن مسعود بن زيد إلى خيبر، وهى يومئذ صلح‏.‏",
      "text_en": " Narrated Sahl bin Abu Hathma:                     `Abdullah bin Sahl and Muhaiyisa bin Mas`ud bin Zaid went to Khaibar when it had a peace treaty (with the Muslims).",
      "chain": [
        "30175",
        "20212",
        "20031",
        "11810",
        "1822"
      ]
    },
    {
      "hadith_no": "2882",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا بشر بن المفضل، حدثنا خالد بن ذكوان، عن الربيع بنت معوذ، قالت كنا مع النبي صلى الله عليه وسلم نسقي، ونداوي الجرحى، ونرد القتلى إلى المدينة‏.‏",
      "text_en": " Narrated Ar-Rubayyi 'bint Mu'auwidh:                     We were in the company of the Prophet providing the wounded with water and treating them and bringing the killed to Medina (from the battle field) .",
      "chain": [
        "30026",
        "20212",
        "11158",
        "617"
      ]
    },
    {
      "hadith_no": "2883",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، عن خالد بن ذكوان، عن الربيع بنت معوذ، قالت كنا نغزو مع النبي صلى الله عليه وسلم فنسقي القوم ونخدمهم، ونرد الجرحى والقتلى إلى المدينة‏.‏",
      "text_en": " Narrated Ar-Rabi'bint Mu'auwidh:                     We used to take part in holy battles with the Prophet by providing the people with water and serving them and bringing the killed and the wounded back to Medina.",
      "chain": [
        "30175",
        "20212",
        "11158",
        "617"
      ]
    },
    {
      "hadith_no": "3086",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا علي، حدثنا بشر بن المفضل، حدثنا يحيى بن أبي إسحاق، عن أنس بن مالك  رضى الله عنه أنه أقبل هو وأبو طلحة مع النبي صلى الله عليه وسلم ومع النبي صلى الله عليه وسلم صفية مردفها على راحلته، فلما كانوا ببعض الطريق عثرت الناقة، فصرع النبي صلى الله عليه وسلم والمرأة، وإن أبا طلحة  قال أحسب قال  اقتحم عن بعيره فأتى رسول الله صلى الله عليه وسلم فقال يا نبي الله جعلني الله فداءك، هل أصابك من شىء قال ‏\"‏ لا، ولكن عليك بالمرأة ‏\"‏‏.‏ فألقى أبو طلحة ثوبه على وجهه، فقصد قصدها فألقى ثوبه عليها، فقامت المرأة، فشد لهما على راحلتهما فركبا، فساروا حتى إذا كانوا بظهر المدينة  أو قال أشرفوا على المدينة  قال النبي صلى الله عليه وسلم ‏\"‏ آيبون تائبون عابدون لربنا حامدون ‏\"‏‏.‏ فلم يزل يقولها حتى دخل المدينة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     That he and Abu Talha came in the company of the Prophet and Safiya was accompanying the Prophet, who let her ride behind him on his she-camel. During the journey, the she-camel slipped and both the Prophet and (his) wife fell down. Abu Talha (the sub-narrator thinks that Anas said that Abu Talha jumped from his camel quickly) said, \"O Allah's Apostle! May Allah sacrifice me for your sake! Did you get hurt?\" The Prophet replied,\"No, but take care of the lady.\" Abu Talha covered his face with his garment and proceeded towards her and covered her with his garment, and she got up. He then set right the condition of their she-camel and both of them (i.e. the Prophet and his wife) rode and proceeded till they approached Medina. The Prophet said, \"We are returning with repentance and worshipping and praising our Lord.\" The Prophet kept on saying this statement till he entered Medina.",
      "chain": [
        "30026",
        "20212",
        "11314",
        "19"
      ]
    },
    {
      "hadith_no": "3173",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا مسدد، حدثنا بشر  هو ابن المفضل  حدثنا يحيى، عن بشير بن يسار، عن سهل بن أبي حثمة، قال انطلق عبد الله بن سهل ومحيصة بن مسعود بن زيد إلى خيبر، وهى يومئذ صلح، فتفرقا، فأتى محيصة إلى عبد الله بن سهل وهو يتشحط في دم قتيلا، فدفنه ثم قدم المدينة، فانطلق عبد الرحمن بن سهل ومحيصة وحويصة ابنا مسعود إلى النبي صلى الله عليه وسلم، فذهب عبد الرحمن يتكلم فقال ‏\"‏ كبر كبر ‏\"‏‏.‏ وهو أحدث القوم، فسكت فتكلما فقال ‏\"‏ أتحلفون وتستحقون قاتلكم أو صاحبكم ‏\"‏‏.‏ قالوا وكيف نحلف ولم نشهد ولم نر قال ‏\"‏ فتبريكم يهود بخمسين ‏\"‏‏.‏ فقالوا كيف نأخذ أيمان قوم كفار فعقله النبي صلى الله عليه وسلم من عنده‏.‏",
      "text_en": " Narrated Sahl bin Abi Hathma:                     `Abdullah bin Sahl and Muhaiyisa bin Mas`ud bin Zaid set out to Khaibar, the inhabitants of which had a peace treaty with the Muslims at that time. They parted and later on Muhaiyisa came upon `Abdullah bin Sah! and found him murdered agitating in his blood. He buried him and returned to Medina. `Abdur Rahman bin Sahl, Muhaiyisa and Huwaiuisa, the sons of Mas`ud came to the Prophet and `Abdur Rahman intended to talk, but the Prophet said (to him), \"Let the eldest of you speak.\" as `Abdur-Rahman was the youngest:. `Abdur-Rahman kept silent and the other two spoke. The Prophet said, \"If you swear as to who has committed the murder, you will have the right to take your right from the murderer.\" They said, \"How should we swear if we did not witness the murder or see the murderer?\" The Prophet said, \"Then the Jews can clear themselves from the charge by taking Alaska (an oath taken by men that it was not they who committed the murder).\" The!y said, \"How should we believe in the oaths of infidels?\" So, the Prophet himself paid the blood money (of `Abdullah). (See Hadith No. 36 Vol. 9.)",
      "chain": [
        "30175",
        "20212",
        "20031",
        "11810",
        "1822"
      ]
    },
    {
      "hadith_no": "3916",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني عبد الله بن عبد الوهاب، حدثنا بشر بن المفضل، حدثنا سعيد بن أبي عروبة، عن قتادة، عن أنس بن مالك  رضى الله عنه أن أهل، مكة سألوا رسول الله صلى الله عليه وسلم أن يريهم آية، فأراهم القمر شقتين، حتى رأوا حراء بينهما‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The people of Mecca asked Allah's Apostle to show them a miracle. So he showed them the moon split in two halves between which they saw the Hira' mountain.",
      "chain": [
        "30143",
        "20212",
        "11073",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "3986",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني حامد بن عمر، عن بشر بن المفضل، حدثنا حميد، حدثنا أنس، أن عبد الله بن سلام، بلغه مقدم النبي صلى الله عليه وسلم المدينة، فأتاه يسأله عن أشياء، فقال إني سائلك عن ثلاث لا يعلمهن إلا نبي ما أول أشراط الساعة وما أول طعام يأكله أهل الجنة وما بال الولد ينزع إلى أبيه أو إلى أمه قال ‏\"‏ أخبرني به جبريل آنفا ‏\"‏‏.‏ قال ابن سلام ذاك عدو اليهود من الملائكة‏.‏ قال ‏\"‏ أما أول أشراط الساعة فنار تحشرهم من المشرق إلى المغرب، وأما أول طعام يأكله أهل الجنة، فزيادة كبد الحوت، وأما الولد، فإذا سبق ماء الرجل ماء المرأة نزع الولد، وإذا سبق ماء المرأة ماء الرجل نزعت الولد ‏\"‏‏.‏ قال أشهد أن لا إله إلا الله وأنك رسول الله‏.‏ قال يا رسول الله، إن اليهود قوم بهت، فاسألهم عني قبل أن يعلموا بإسلامي، فجاءت اليهود فقال النبي صلى الله عليه وسلم ‏\"‏ أى رجل عبد الله بن سلام فيكم ‏\"‏‏.‏ قالوا خيرنا وابن خيرنا وأفضلنا وابن أفضلنا‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أرأيتم إن أسلم عبد الله بن سلام ‏\"‏‏.‏ قالوا أعاذه الله من ذلك‏.‏ فأعاد عليهم، فقالوا مثل ذلك، فخرج إليهم عبد الله فقال أشهد أن لا إله إلا الله وأن محمدا رسول الله‏.‏ قالوا شرنا وابن شرنا‏.‏ وتنقصوه‏.‏ قال هذا كنت أخاف يا رسول الله‏.‏",
      "text_en": " Narrated Anas:                     When the news of the arrival of the Prophet at Medina reached `Abdullah bin Salam, he went to him to ask him about certain things, He said, \"I am going to ask you about three things which only a Prophet can answer: What is the first sign of The Hour? What is the first food which the people of Paradise will eat? Why does a child attract the similarity to his father or to his mother?\" The Prophet replied, \"Gabriel has just now informed me of that.\" Ibn Salam said, \"He (i.e. Gabriel) is the enemy of the Jews amongst the angels. The Prophet said, \"As for the first sign of The Hour, it will be a fire that will collect the people from the East to the West. As for the first meal which the people of Paradise will eat, it will be the caudate (extra) lobe of the fish-liver. As for the child, if the man's discharge proceeds the woman's discharge, the child attracts the similarity to the man, and if the woman's discharge proceeds the man's, then the child attracts the similarity to the woman.\" On this, `Abdullah bin Salam said, \"I testify that None has the right to be worshipped except Allah, and that you are the Apostle of Allah.\" and added, \"O Allah's Apostle! Jews invent such lies as make one astonished, so please ask them about me before they know about my conversion to I slam . \" The Jews came, and the Prophet said, \"What kind of man is `Abdullah bin Salam among you?\" They replied, \"The best of us and the son of the best of us and the most superior among us, and the son of the most superior among us. \"The Prophet said, \"What would you think if `Abdullah bin Salam should embrace Islam?\" They said, \"May Allah protect him from that.\" The Prophet repeated his question and they gave the same answer. Then `Abdullah came out to them and said, \"I testify that None has the right to be worshipped except Allah and that Muhammad is the Apostle of Allah!\" On this, the Jews said, \"He is the most wicked among us and the son of the most wicked among us.\" So they degraded him. On this, he (i.e. `Abdullah bin Salam) said, \"It is this that I was afraid of, O Allah's Apostle.",
      "chain": [
        "30128",
        "20212",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "4051",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا علي، حدثنا بشر بن المفضل، حدثنا خالد بن ذكوان، عن الربيع بنت معوذ، قالت دخل على النبي صلى الله عليه وسلم غداة بني على، فجلس على فراشي كمجلسك مني، وجويريات يضربن بالدف، يندبن من قتل من آبائهن يوم بدر حتى قالت جارية وفينا نبي يعلم ما في غد‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا تقولي هكذا، وقولي ما كنت تقولين ‏\"‏‏.‏",
      "text_en": " Narrated Ar-Rubai bint Muauwidh:                     The Prophet came to me after consuming his marriage with me and sat down on my bed as you (the sub-narrator) are sitting now, and small girls were beating the tambourine and singing in lamentation of my father who had been killed on the day of the battle of Badr. Then one of the girls said, \"There is a Prophet amongst us who knows what will happen tomorrow.\" The Prophet said (to her),\" Do not say this, but go on saying what you have spoken before.\"",
      "chain": [
        "30026",
        "20212",
        "11158",
        "617"
      ]
    },
    {
      "hadith_no": "4397",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، عن حميد الطويل، حدثنا بكر، أنه ذكر لابن عمر أن أنسا حدثهم أن النبي صلى الله عليه وسلم أهل بعمرة وحجة، فقال أهل النبي صلى الله عليه وسلم بالحج، وأهللنا به معه، فلما قدمنا مكة قال ‏\"‏ من لم يكن معه هدى فليجعلها عمرة ‏\"‏‏.‏ وكان مع النبي صلى الله عليه وسلم هدى، فقدم علينا علي بن أبي طالب من اليمن حاجا فقال النبي صلى الله عليه وسلم ‏\"‏ بم أهللت فإن معنا أهلك ‏\"‏‏.‏ قال أهللت بما أهل به النبي صلى الله عليه وسلم‏.‏ قال ‏\"‏ فأمسك، فإن معنا هديا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet assumed the state of Ihram for Umra and Hajj, and we to assumed it for Hajj with him. When we arrived at Mecca, the Prophet said, \"Whoever does not possess a Hadi should regard his Ihram for Umra only.\" The Prophet had a Hadi with him. `Ali bin Abi Talib came to us from Yemen with the intention of performing Hajj. The Prophet said (to him), \"With what intention have you assumed the Ihram, for your wife is with us?\" `Ali said, \"I assumed the lhram with the same intention as that of the Prophet .\" The Prophet said, \"Keep on the state of lhram, as we have got the Hadi.\"",
      "chain": [
        "30175",
        "20212",
        "11279",
        "11267"
      ]
    },
    {
      "hadith_no": "5202",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، حدثنا خالد بن ذكوان، قال قالت الربيع بنت معوذ ابن عفراء‏.‏ جاء النبي صلى الله عليه وسلم فدخل حين بني على، فجلس على فراشي كمجلسك مني، فجعلت جويريات لنا يضربن بالدف ويندبن من قتل من آبائي يوم بدر، إذ قالت إحداهن وفينا نبي يعلم ما في غد‏.‏ فقال ‏\"‏ دعي هذه، وقولي بالذي كنت تقولين ‏\"‏‏.‏",
      "text_en": " Narrated Ar-Rabi`:                     (the daughter of Muawwidh bin Afra) After the consummation of my marriage, the Prophet came and sat on my bed as far from me as you are sitting now, and our little girls started beating the tambourines and reciting elegiac verses mourning my father who had been killed in the battle of Badr. One of them said, \"Among us is a Prophet who knows what will happen tomorrow.\" On that the Prophet said, \"Leave this (saying) and keep on saying the verses which you had been saying before.\"",
      "chain": [
        "30175",
        "20212",
        "11158"
      ]
    },
    {
      "hadith_no": "5268",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا مسدد، حدثنا بشر، حدثنا خالد، عن أبي قلابة، عن أنس  رضى الله عنه  ولو شئت أن أقول قال النبي صلى الله عليه وسلم ولكن قال السنة إذا تزوج البكر أقام عندها سبعا، وإذا تزوج الثيب أقام عندها ثلاثا‏.‏",
      "text_en": " Narrated Anas:                     The tradition, (of the Prophet) is that if someone marries a virgin and he has already a matron wife (with him), then he should stay with the virgin for seven days; and if someone marries a matron (and he has already a virgin wife with him) then he should stay with her for three days.",
      "chain": [
        "30175",
        "20212",
        "11282",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "5351",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، حدثنا سلمة بن علقمة، عن محمد بن سيرين، عن أبي هريرة، قال قال أبو القاسم صلى الله عليه وسلم ‏\"‏ في الجمعة ساعة لا يوافقها مسلم قائم يصلي، فسأل الله خيرا، إلا أعطاه ‏\"‏‏.‏ وقال بيده، ووضع أنملته على بطن الوسطى والخنصر‏.‏ قلنا يزهدها‏.‏",
      "text_en": "      Narrated Abu Huraira:                          Abul Qasim (the Prophet ) said, \"There is an hour (or a moment) of      particular significance on Friday. If it happens that a Muslim is      offering a prayer and invoking Allah for some good at that very      moment, Allah will grant him his request.\" (The sub-narrator placed      the top of his finger on the palm of the other hand between the middle     finger and the little one.)",
      "chain": [
        "30175",
        "20212",
        "11593",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "5394",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا مسدد، حدثنا بشر، حدثنا سلمة بن علقمة، عن محمد بن سيرين، قالت أم عطية نهينا أن نحد أكثر من ثلاث إلا بزوج‏.‏",
      "text_en": " Narrated Um 'Atiyya:                     We were forbidden to mourn for more than three days except for a husband.",
      "chain": [
        "30175",
        "20212",
        "11593",
        "11035"
      ]
    },
    {
      "hadith_no": "5741",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بشر بن المفضل، عن خالد بن ذكوان، عن ربيع بنت معوذ ابن عفراء، قالت كنا نغزو مع رسول الله صلى الله عليه وسلم نسقي القوم، ونخدمهم، ونرد القتلى والجرحى إلى المدينة‏.‏",
      "text_en": " Narrated Rubai bint Mu`adh bin Afra:                     We used to go for Military expeditions along with Allah's Apostle and provide the people with water, serve them and bring the dead and the wounded back to Medina.",
      "chain": [
        "30367",
        "20212",
        "11158"
      ]
    },
    {
      "hadith_no": "6118",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، عن حميد، قال قال أنس حدثني عبادة بن الصامت، قال خرج رسول الله صلى الله عليه وسلم ليخبر الناس بليلة القدر، فتلاحى رجلان من المسلمين، قال النبي صلى الله عليه وسلم ‏\"‏ خرجت لأخبركم، فتلاحى فلان وفلان وإنها رفعت، وعسى أن يكون خيرا لكم، فالتمسوها في التاسعة والسابعة والخامسة ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                     Allah's Apostle went out to inform the people about the (date of the Night of decree (Al-Qadr). There happened a quarrel between two Muslim men. The Prophet said, \"I came out to inform you about the Night of Al-Qadr, but as so-and-so and so-and-so quarrelled, so the news about it had been taken away; and may be it was better for you. So look for it in the ninth, the seventh, or the fifth (of the last ten days of Ramadan).",
      "chain": [
        "30175",
        "20212",
        "11279",
        "19",
        "40"
      ]
    },
    {
      "hadith_no": "6255",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا بشر بن المفضل، حدثنا يحيى بن أبي إسحاق، عن أنس بن مالك، أنه أقبل هو وأبو طلحة مع النبي صلى الله عليه وسلم ومع النبي صلى الله عليه وسلم صفية، مردفها على راحلته، فلما كانوا ببعض الطريق عثرت الناقة، فصرع النبي صلى الله عليه وسلم والمرأة، وأن أبا طلحة  قال أحسب  اقتحم عن بعيره، فأتى رسول الله صلى الله عليه وسلم فقال يا نبي الله جعلني الله فداك، هل أصابك من شىء‏.‏ قال ‏\"‏ لا ولكن عليك بالمرأة ‏\"‏‏.‏ فألقى أبو طلحة ثوبه على وجهه فقصد قصدها، فألقى ثوبه عليها فقامت المرأة، فشد لهما على راحلتهما فركبا، فساروا حتى إذا كانوا بظهر المدينة  أو قال أشرفوا على المدينة  قال النبي صلى الله عليه وسلم ‏\"‏ آيبون تائبون، عابدون لربنا حامدون ‏\"‏‏.‏ فلم يزل يقولها حتى دخل المدينة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     That he and Abu Talha were coming in the company of the Prophet towards Medina), while Safiya (the Prophet's wife) was riding behind him on his she-camel. After they had covered a portion of the way suddenly the foot of the she-camel slipped and both the Prophet and the woman (i.e., his wife, Safiya) fell down. Abu Talha jumped quickly off his camel and came to the Prophet (saying.) \"O Allah's Apostle! Let Allah sacrifice me for you! Have you received any injury?\" The Prophet said, \"No, but take care of the woman (my wife).\" Abu Talha covered his face with his garment and went towards her and threw his garment over her. Then the woman got up and Abu Talha prepared their she camel (by tightening its saddle, etc.) and both of them (the Prophet and Safiya) mounted it. Then all of them proceeded and when they approached near Medina, or saw Medina, the Prophet said, \"Ayibun,' abidun, taibun, liRabbina hamidun (We are coming back (to Medina) with repentance, worshipping (our Lord) and celebrating His (our Lord's) praises\". The Prophet continued repeating these words till he entered the city of Medina.",
      "chain": [
        "30026",
        "20212",
        "11314",
        "19"
      ]
    },
    {
      "hadith_no": "6347",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا بشر بن المفضل، حدثنا الجريري، عن عبد الرحمن بن أبي بكرة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا أخبركم بأكبر الكبائر ‏\"‏‏.‏ قالوا بلى يا رسول الله‏.‏ قال ‏\"‏ الإشراك بالله، وعقوق الوالدين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     Allah's Apostle said, \"Shall I inform you of the biggest of the great sins?\" They said, \"Yes, O Allah's Apostle!\" He said, \"To join partners in worship with Allah, and to be undutiful to one's parents. \"",
      "chain": [
        "30026",
        "20212",
        "11286",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "7005",
      "source": " Sahih Bukhari ",
      "chapter": "Dealing with Apostates - كتاب استتابة المرتدين والمعاندين وقتالهم",
      "chapter_no": "89",
      "text_ar": "حدثنا مسدد، حدثنا بشر بن المفضل، حدثنا الجريري، وحدثني قيس بن حفص، حدثنا إسماعيل بن إبراهيم، أخبرنا سعيد الجريري، حدثنا عبد الرحمن بن أبي بكرة، عن أبيه  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ أكبر الكبائر الإشراك بالله، وعقوق الوالدين، وشهادة الزور، وشهادة الزور  ثلاثا  أو قول الزور ‏\"‏‏.‏ فما زال يكررها حتى قلنا ليته سكت‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet. said, \"The biggest of the great sins are: To join others in worship with Allah, to be undutiful to one's parents, and to give a false witness.\" He repeated it thrice, or said, \"....a false statement,\" and kept on repeating that warning till we wished he would stop saying it. (See Hadith No.7, Vol. 8)",
      "chain": [
        "30175",
        "20212",
        "11286",
        "30158",
        "20208",
        "11286",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "146",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا بشر بن المفضل، حدثنا خالد الحذاء، عن الوليد أبي بشر، قال سمعت حمران، يقول سمعت عثمان، يقول سمعت رسول الله صلى الله عليه وسلم يقول مثله سواء ‏.‏",
      "text_en": " It is narrated on the authority of Humran that he heard Uthman saying this:                      I heard the Messenger of Allah (may peace be upon him) uttering these words (as stated above).",
      "chain": [
        "30161",
        "20212",
        "11282",
        "10725",
        "11421",
        "4"
      ]
    },
    {
      "hadith_no": "477",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني نصر بن علي الجهضمي، حدثنا بشر، - يعني ابن المفضل - عن أبي مسلمة، عن أبي نضرة، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أما أهل النار الذين هم أهلها فإنهم لا يموتون فيها ولا يحيون ولكن ناس أصابتهم النار بذنوبهم - أو قال بخطاياهم - فأماتهم إماتة حتى إذا كانوا فحما أذن بالشفاعة فجيء بهم ضبائر ضبائر فبثوا على أنهار الجنة ثم قيل يا أهل الجنة أفيضوا عليهم ‏.‏ فينبتون نبات الحبة تكون في حميل السيل ‏\"‏ ‏.‏ فقال رجل من القوم كأن رسول الله صلى الله عليه وسلم قد كان بالبادية ‏.‏",
      "text_en": " It is reported by Abu Sa'id that the Messenger of Allah (may peace be upon him) said:                      The (permanent) inhabitants of the Fire are those who are doomed to it, and verily they would neither die nor live in it (al-Qur'an, xx. 47; lxxxvii. 13). But the people whom the Fire would afflict (temporarily) on account of their sins, or so said (the narrator)\" on account of their misdeeds,\" He would cause them to die till they would be turned into charcoal. Then they would be granted intercession and would be brought in groups and would be spread on the rivers of Paradise and then it would be said: O inhabitants of Paradise, pour water over them; then they would sprout forth like the sprouting of seed in the silt carried by flood. A man among the people said: (It appears) as if the Messenger of Allah lived in the steppe.",
      "chain": [
        "30395",
        "20212",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "278",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا نصر بن علي الجهضمي، وحامد بن عمر البكراوي، قالا حدثنا بشر بن المفضل، عن خالد، عن عبد الله بن شقيق، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا استيقظ أحدكم من نومه فلا يغمس يده في الإناء حتى يغسلها ثلاثا فإنه لا يدري أين باتت يده ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira said:                      When anyone amongst you wakes up from sleep, he must not put his hand in the utensil till he has washed it three times, for he does not know where his hand was during the night.",
      "chain": [
        "30395",
        "30128",
        "20212",
        "11282",
        "10694",
        "13"
      ]
    },
    {
      "hadith_no": "326",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا أبو كامل الجحدري، وعمرو بن علي، كلاهما عن بشر بن المفضل، - قال أبو كامل حدثنا بشر، - حدثنا أبو ريحانة، عن سفينة، قال كان رسول الله صلى الله عليه وسلم يغسله الصاع من الماء من الجنابة ويوضؤه المد ‏.‏",
      "text_en": " Safina reported:                      The Messenger of Allah (may peace be upon him) took a bath with one g' of water because of sexual intercourse and performed ablution with one Mudd.",
      "chain": [
        "30559",
        "30153",
        "20212",
        "20212",
        "10696",
        "438"
      ]
    },
    {
      "hadith_no": "1264",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا بشر بن المفضل، عن أبي مسلمة، سعيد بن يزيد قال قلت لأنس بن مالك أكان رسول الله صلى الله عليه وسلم يصلي في النعلين قال نعم ‏.‏",
      "text_en": " Sa'd b. Yazid reported:                      I said to Anas b. Malik: Did the Messenger of Allah (may peace be upon him) pray while putting on the shoes? He said: Yes.",
      "chain": [
        "30399",
        "20212",
        "11288"
      ]
    },
    {
      "hadith_no": "1369",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا حامد بن عمر البكراوي، حدثنا بشر، - يعني ابن المفضل ح قال وحدثنا محمد بن المثنى، حدثني أزهر، جميعا عن ابن عون، عن أبي سعيد، عن وراد، كاتب المغيرة بن شعبة قال كتب معاوية إلى المغيرة ‏.‏ بمثل حديث منصور والأعمش ‏.‏",
      "text_en": " Warrad, the scribe of Mughira b. Shu'ba, reported:                      Mu'awiya wrote to Mughira (the contents) of the hadith as transmitted by Mansur and A'mash.",
      "chain": [
        "30128",
        "20212",
        "30170",
        "11071",
        "38",
        "11402"
      ]
    },
    {
      "hadith_no": "1438",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن يحيى، حدثنا بشر بن المفضل، عن غالب القطان، عن بكر بن عبد الله، عن أنس بن مالك، قال كنا نصلي مع رسول الله صلى الله عليه وسلم في شدة الحر فإذا لم يستطع أحدنا أن يمكن جبهته من الأرض بسط ثوبه فسجد عليه ‏.‏",
      "text_en": " Anas b. Malik reported:                      We used to say (the noonprayer) with the Messenger of Allah (may peace be upon him) in the intense heat, but when someone amongst us found it hard to place his forehead on the ground, he spread his cloth and prostrated on it.",
      "chain": [
        "30399",
        "20212",
        "11299",
        "11267",
        "19"
      ]
    },
    {
      "hadith_no": "1686",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا حامد بن عمر البكراوي، حدثنا بشر بن المفضل، حدثنا عمارة بن غزية، عن ربيعة بن أبي عبد الرحمن، عن عبد الملك بن سعيد بن سويد الأنصاري، عن أبي حميد، أو عن أبي أسيد، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been narrated from the Apostle of Allah (may peace be upon him) by Abu Usaid.",
      "chain": [
        "30128",
        "20212",
        "11894",
        "11162",
        "113"
      ]
    },
    {
      "hadith_no": "1728",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني أبو غسان المسمعي، حدثنا بشر بن المفضل، حدثنا داود، عن النعمان بن سالم، بهذا الإسناد ‏\"‏ من صلى في يوم ثنتى عشرة سجدة تطوعا بني له بيت في الجنة ‏\"‏ ‏.‏",
      "text_en": " Nu'man b. Salim reported with the same chain of transmitters:                      He who observed twelve voluntary rak'ahs, a house will be built for him in Paradise.",
      "chain": [
        "30456",
        "20212"
      ]
    },
    {
      "hadith_no": "2157",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "وحدثني عبيد الله بن عمر القواريري، حدثنا بشر بن المفضل، حدثنا الجريري، عن أبي العلاء، حيان بن عمير عن عبد الرحمن بن سمرة، قال بينما أنا أرمي، بأسهمي في حياة رسول الله صلى الله عليه وسلم إذ انكسفت الشمس فنبذتهن وقلت لأنظرن إلى ما يحدث لرسول الله صلى الله عليه وسلم في انكساف الشمس اليوم فانتهيت إليه وهو رافع يديه يدعو ويكبر ويحمد ويهلل حتى جلي عن الشمس فقرأ سورتين وركع ركعتين ‏.‏",
      "text_en": " 'Abd al-Rahman b. Samura said:                      During the lifetime of Allah's Messenger (may peace be upon him) I was shooting my arrows in Medina, when an eclipse of the sun took place. I, therefore, threw them away and said, I must see how the Messenger of Allah (may peace be upon him) acts in a solar eclipse today. When I came to him, he had been supplicating with his hands, raised, pronouncing Allah-o-Akbar, praising Him, acknowledging that He is One God till the eclipse was over, then he recited two surahs and prayed two rak'ahs.",
      "chain": [
        "30024",
        "20212",
        "11286",
        "955"
      ]
    },
    {
      "hadith_no": "2162",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا أبو كامل الجحدري، فضيل بن حسين وعثمان بن أبي شيبة كلاهما عن بشر، - قال أبو كامل حدثنا بشر بن المفضل، - حدثنا عمارة بن غزية، حدثنا يحيى، بن عمارة قال سمعت أبا سعيد الخدري، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لقنوا موتاكم لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported Allah's Messenger (may peace be upon him) as saying:                      Exhort to recite\" There is no god but Allah\" to those of you who are dying.",
      "chain": [
        "30559",
        "20212",
        "20212",
        "11894",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "2555",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني حميد بن مسعدة الباهلي، حدثنا بشر بن المفضل، حدثنا سلمة، - وهو ابن علقمة - عن نافع، عن عبد الله بن عمر، - رضى الله عنهما - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الشهر تسع وعشرون فإذا رأيتم الهلال فصوموا وإذا رأيتموه فأفطروا فإن غم عليكم فاقدروا له ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. 'Umar (Allah be pleased with both of them) reported Allah's Messenger (may peace be upon him) as saying:                      The month (of Ramadan) may consist of twenty nine days; so when you see the new moon observe fast and when you see (the new moon again at the commencement of the month of Shawwal) then break It, and if the sky is cloudy for you, then calculate it (and complete thirty days).",
      "chain": [
        "30430",
        "20212",
        "11593",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2725",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني أبو بكر بن نافع العبدي، حدثنا بشر بن المفضل بن لاحق، حدثنا خالد، بن ذكوان عن الربيع بنت معوذ بن عفراء، قالت أرسل رسول الله صلى الله عليه وسلم غداة عاشوراء إلى قرى الأنصار التي حول المدينة ‏\"‏ من كان أصبح صائما فليتم صومه ومن كان أصبح مفطرا فليتم بقية يومه ‏\"‏ ‏.‏ فكنا بعد ذلك نصومه ونصوم صبياننا الصغار منهم إن شاء الله ونذهب إلى المسجد فنجعل لهم اللعبة من العهن فإذا بكى أحدهم على الطعام أعطيناها إياه عند الإفطار ‏.‏",
      "text_en": " Rubayyi' daughter of Mu'awwidh b. 'Afra' said that the Messenger of Allah (may peace be upon him) sent (a person) on the morning of Ashura to the villages of Ansar around Medina (with this message):                      He who got up in the morning fasting (without eating anything) he should complete his fast, and he who had had his breakfast in the morning, he should complete the rest of the day (without food). The Companions said; We henceforth observed fast on it (on the day of 'Ashura) and, God willing, made our children observe that. We went to the mosque and made toys out of wool for them and when anyone felt hungry and wept for food we gave them these toys till it was the time to break the fast.",
      "chain": [
        "20212",
        "11158",
        "617"
      ]
    },
    {
      "hadith_no": "3039",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا حامد بن عمر البكراوي، ومحمد بن أبي بكر المقدمي، قالا حدثنا بشر، بن المفضل حدثنا عمران بن مسلم، عن أبي رجاء، قال قال عمران بن حصين نزلت آية المتعة في كتاب الله - يعني متعة الحج - وأمرنا بها رسول الله صلى الله عليه وسلم ثم لم تنزل آية تنسخ آية متعة الحج ولم ينه عنها رسول الله صلى الله عليه وسلم حتى مات ‏.‏ قال رجل برأيه بعد ما شاء ‏.‏",
      "text_en": "  'Imran b. Husain said:                      There was revealed the verse of Tamattu' in Hajj in the Book of Allah and the Messenger of Allah (may peace be upon him) commanded us to perform it. and then no verse was revealed abrogating the Tamattu' (form of Hajj), and the Messenger of Allah (may peace be upon him) did not forbid to do it till he died. So whatever a person said was his personal opinion.",
      "chain": [
        "30128",
        "30161",
        "20212",
        "11562",
        "11440"
      ]
    },
    {
      "hadith_no": "3346",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا حميد بن مسعدة، حدثنا بشر بن المفضل، حدثنا يحيى بن أبي إسحاق، عن أنس بن مالك، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been narrated by Anas b. Malik (Allah be pleased with him) through another chain of transmitters.",
      "chain": [
        "30430",
        "20212",
        "11314",
        "19"
      ]
    },
    {
      "hadith_no": "3588",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثني حميد بن مسعدة الباهلي، حدثنا بشر بن المفضل، حدثنا إسماعيل بن، أمية عن نافع، عن عبد الله بن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ائتوا الدعوة إذا دعيتم ‏\"‏ ‏.‏",
      "text_en": " \" Abdullah b. Umar (Allah be pleased with them) reported Allah's Messen- ger (may peace be upon him) as saying:                      Come to the feast, when you are invited.",
      "chain": [
        "30430",
        "20212",
        "11417",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3620",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثنا نصر بن علي الجهضمي، حدثنا بشر بن المفضل، حدثنا شعبة، عن أنس، بن سيرين عن معبد بن سيرين، عن أبي سعيد الخدري، قال قلت له سمعته من أبي سعيد، قال نعم عن النبي صلى الله عليه وسلم قال ‏\"‏ لا عليكم أن لا تفعلوا فإنما هو القدر‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) (was asked if he had heard it himself), to which he said:                      Yes. (I heard) Allah's Apostle (may peace be upon him) as saying: There is no harm if you do not practise it, for it (the birth of the child) is something ordained (by Allah).",
      "chain": [
        "30395",
        "20212",
        "20020",
        "11038",
        "11036",
        "38"
      ]
    },
    {
      "hadith_no": "3871",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "وحدثني حميد بن مسعدة، حدثنا بشر بن المفضل، حدثنا عاصم، - وهو ابن محمد العمري - حدثنا واقد، - يعني أخاه - حدثني سعيد ابن مرجانة، - صاحب علي بن حسين - قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما امرئ مسلم أعتق امرأ مسلما استنقذ الله بكل عضو منه عضوا منه من النار ‏\"‏ ‏.‏ قال فانطلقت حين سمعت الحديث من أبي هريرة فذكرته لعلي بن الحسين فأعتق عبدا له قد أعطاه به ابن جعفر عشرة آلاف درهم أو ألف دينار ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      A Muslim who emancipates a Muslim (slave). Allah will save from Fire every limb of his for every limb (of the slave). Sa'id b. Marjana said: When I heard this hadith from Abu Huraira (Allah be pleased with him), I went away and made a mention of it to 'Ali b. Husain and he at once emancipated the slave for which Ibn ja'far was prepared to pay ten thousand dirhams or one thousand dinars.",
      "chain": [
        "30430",
        "20212",
        "20163",
        "11571",
        "13"
      ]
    },
    {
      "hadith_no": "4101",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثني حميد بن مسعدة، حدثنا بشر، - يعني ابن المفضل - حدثنا إسماعيل، - وهو ابن أمية - عن نافع، عن عبد الله، قال كان رسول الله صلى الله عليه وسلم يأمر بقتل الكلاب فننبعث في المدينة وأطرافها فلا ندع كلبا إلا قتلناه حتى إنا لنقتل كلب المرية من أهل البادية يتبعها ‏.‏",
      "text_en": " Abdullah (b. Umar) (Allah be pleased with them) reported:                      Allah's Messenger (may peace be upon him) ordered the killing of dogs and we would send (men) in Medina and its corners and we did not spare any dog that we did not kill, so much so that we killed the dog that accompanied the wet she-camel belonging to the people of the desert.",
      "chain": [
        "30430",
        "20212",
        "11417",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4436",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "وحدثنا القواريري، حدثنا بشر بن المفضل، حدثنا يحيى بن سعيد، عن بشير بن، يسار عن سهل بن أبي حثمة، عن النبي صلى الله عليه وسلم ‏.‏ نحوه ‏.‏ وقال في حديثه فعقله رسول الله صلى الله عليه وسلم من عنده ‏.‏ ولم يقل في حديثه فركضتني ناقة ‏.‏",
      "text_en": " Sahl b. Abu Hathma has narrated this hadith through another chain of transmitters with a slight variation of words, but no mention has been made of the hitting by the she-camel.",
      "chain": [
        "30024",
        "20212",
        "11062",
        "11810",
        "1822"
      ]
    }
  ],
  "total_hadiths": 169
}