{
  "id": "20226",
  "name": "Khalid bin al-Harith bin 'Ubaid خالد بن الحارث بن عبيد",
  "full_name": "Khalid bin al-Harith bin 'Ubaid خالد بن الحارث بن عبيد",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "106",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11071",
      "name": "'Abdullah bin 'Awn bin Artaban عبد الله بن عون بن أرطبان الخزار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11073",
      "name": "Sa'id bin Abi 'Aruba سعيد بن أبي عروبة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10945",
      "name": "'Abdul Malik bin Aby عبد الملك بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11311",
      "name": "Hisham bin Hassan al-Azdi هشام بن حسان الأزدي القردوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20295",
      "name": "Hisham bin Abi 'Abdullah al-Dastawa'i هشام بن أبي عبد الله الدستوائي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30175",
      "name": "Masdad bin Masrhad مسدد بن مسرهد بن مسربل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20283",
      "name": "Muhammad bin al-Fadl 'Aram محمد بن الفضل السدوسي أبو النعمان عارم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30153",
      "name": "'Amr bin 'Ali bin Bahr al-Bahli عمرو بن علي بن بحر الباهلي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30143",
      "name": "'Abdullah bin 'Abdul Wahab al-Hajabi عبد الله بن عبد الوهاب الحجبي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30150",
      "name": "'Ubaidullah bin Mua'dh عبيد الله بن معاذ بن معاذ بن نصر",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30459",
      "name": "Yahya bin Habib bin Arby يحيى بن حبيب بن عربي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20720",
      "name": "Nasr bin 'Ali bin Asbahan نصر بن علي الجهضمي الكبير",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "36540",
      "name": "al-Hasan bin Arfh bin Yazid الحسن بن عرفة بن يزيد",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "920",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا عبيد الله بن عمر القواريري، قال حدثنا خالد بن الحارث، قال حدثنا عبيد الله، عن نافع، عن ابن عمر  رضى الله عنهما  قال كان النبي صلى الله عليه وسلم يخطب قائما ثم يقعد ثم يقوم، كما تفعلون الآن‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet (p.b.u.h) used to deliver the Khutba while standing and then he would sit, then stand again as you do now-a-days.",
      "chain": [
        "30024",
        "20226",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1619",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا خالد بن الحارث، حدثنا سفيان، حدثنا واصل الأحدب، عن أبي وائل، قال جئت إلى شيبة‏.‏ وحدثنا قبيصة، حدثنا سفيان، عن واصل، عن أبي وائل، قال جلست مع شيبة على الكرسي في الكعبة فقال لقد جلس هذا المجلس عمر  رضى الله عنه  فقال لقد هممت أن لا أدع فيها صفراء ولا بيضاء إلا قسمته‏.‏ قلت إن صاحبيك لم يفعلا‏.‏ قال هما المرآن أقتدي بهما‏.‏",
      "text_en": " Narrated Abu Wail:                     (One day) I sat along with Shaiba on the chair inside the Ka`ba. He (Shaiba) said, \"No doubt, `Umar sat at this place and said, 'I intended not to leave any yellow (i.e. gold) or white (i.e. silver) (inside the Ka`ba) undistributed.' I said (to `Umar), 'But your two companions (i.e. The Prophet and Abu Bakr) did not do so.' `Umar said, They are the two persons whom I always follow.' \"",
      "chain": [
        "30143",
        "20226",
        "20012",
        "11401",
        "11353",
        "20351",
        "20012",
        "11401",
        "11353"
      ]
    },
    {
      "hadith_no": "1735",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إسحاق بن إبراهيم، سمع خالد بن الحارث، حدثنا عبيد الله بن عمر، عن نافع، أن عبد الله  رضى الله عنه  كان ينحر في المنحر‏.‏ قال عبيد الله منحر رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Nafi`:                     `Abdullah (bin `Umar), used to slaughter (his sacrifice) at the Manhar. ('Ubaidullah, a sub-narrator said, \"The Manhar of Allah's Apostle.\")",
      "chain": [
        "30123",
        "20226",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1795",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا خالد بن الحارث، قال سئل عبيد الله عن المحصب، فحدثنا عبيد الله، عن نافع،، قال نزل بها رسول الله صلى الله عليه وسلم وعمر وابن عمر‏.‏ وعن نافع أن ابن عمر  رضى الله عنهما  كان يصلي بها  يعني المحصب  الظهر والعصر  أحسبه قال والمغرب‏.‏ قال خالد لا أشك في العشاء، ويهجع هجعة، ويذكر ذلك عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Khalid bin Al-Harith:                     'Ubaidullah was asked about Al Mahassab. 'Ubaidullah narrated: Nafi` said, 'Allah's Apostles, `Umar and Ibn `Umar camped there.\" Nafi` added, \"Ibn `Umar used to offer the Zuhr and `Asr prayers at it (i.e. Al-Mahassab).\" I think he mentioned the Maghrib prayer also. I said, \"I don't doubt about `Isha' (i.e. he used to offer it there also), and he used to sleep there for a while. He used to say, 'The Prophet used to do the same.' \"",
      "chain": [
        "30143",
        "20226",
        "11014"
      ]
    },
    {
      "hadith_no": "1982",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثني خالد  هو ابن الحارث  حدثنا حميد، عن أنس  رضى الله عنه  دخل النبي صلى الله عليه وسلم على أم سليم، فأتته بتمر وسمن، قال ‏\"‏ أعيدوا سمنكم في سقائه، وتمركم في وعائه، فإني صائم ‏\"‏‏.‏ ثم قام إلى ناحية من البيت، فصلى غير المكتوبة، فدعا لأم سليم، وأهل بيتها، فقالت أم سليم يا رسول الله، إن لي خويصة، قال ‏\"‏ ما هي ‏\"‏‏.‏ قالت خادمك أنس‏.‏ فما ترك خير آخرة ولا دنيا إلا دعا لي به قال ‏\"‏ اللهم ارزقه مالا وولدا وبارك له ‏\"‏‏.‏ فإني لمن أكثر الأنصار مالا‏.‏ وحدثتني ابنتي أمينة أنه دفن لصلبي مقدم حجاج البصرة بضع وعشرون ومائة‏.‏ حدثنا ابن أبي مريم، أخبرنا يحيى، قال حدثني حميد، سمع أنسا  رضى الله عنه  عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas:                     The Prophet paid a visit to Um-Sulaim and she placed before him dates and ghee. The Prophet said, \"Replace the ghee and dates in their respective containers for I am fasting.\" Then he stood somewhere in her house and offered an optional prayer and then he invoked good on Um-Sulaim and her family. Then Um-Sulaim said, \"O Allah's Apostle! I have a special request (today).\" He said, \"What is it?\" She replied, \"(Please invoke for) your servant Anas.\" So Allah's Apostle did not leave anything good in the world or the Hereafter which he did not invoke (Allah to bestow) on me and said, \"O Allah! Give him (i.e. Anas) property and children and bless him.\" Thus I am one of the richest among the Ansar and my daughter Umaina told me that when Al-Hajjaj came to Basra, more than 120 of my offspring had been buried.",
      "chain": [
        "30170",
        "20226",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "2023",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Night of Qadr - كتاب فضل ليلة القدر",
      "chapter_no": "32",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا خالد بن الحارث، حدثنا حميد، حدثنا أنس، عن عبادة بن الصامت، قال خرج النبي صلى الله عليه وسلم ليخبرنا بليلة القدر، فتلاحى رجلان من المسلمين، فقال ‏\"‏ خرجت لأخبركم بليلة القدر، فتلاحى فلان وفلان، فرفعت، وعسى أن يكون خيرا لكم، فالتمسوها في التاسعة والسابعة والخامسة ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubada bin As-Samit:                     The Prophet came out to inform us about the Night of Qadr but two Muslims were quarreling with each other. So, the Prophet said, \"I came out to inform you about the Night of Qadr but such-and-such persons were quarreling, so the news about it had been taken away; yet that might be for your own good, so search for it on the 29th, 27th and 25th (of Ramadan).",
      "chain": [
        "30170",
        "20226",
        "11279",
        "19",
        "40"
      ]
    },
    {
      "hadith_no": "2617",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا خالد بن الحارث، حدثنا شعبة، عن هشام بن زيد، عن أنس بن مالك  رضى الله عنه  أن يهودية، أتت النبي صلى الله عليه وسلم بشاة مسمومة، فأكل منها فجيء بها فقيل ألا نقتلها‏.‏ قال ‏\"‏ لا ‏\"‏‏.‏ فما زلت أعرفها في لهوات رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A Jewess brought a poisoned (cooked) sheep for the Prophet who ate from it. She was brought to the Prophet and he was asked, \"Shall we kill her?\" He said, \"No.\" I continued to see the effect of the poison on the palate of the mouth of Allah's Apostle .",
      "chain": [
        "30143",
        "20226",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "hadith_no": "2845",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا خالد بن الحارث، حدثنا ابن عون، عن موسى بن أنس، قال وذكر يوم اليمامة قال أتى أنس ثابت بن قيس وقد حسر عن فخذيه وهو يتحنط فقال يا عم ما يحبسك أن لا تجيء قال الآن يا ابن أخي‏.‏ وجعل يتحنط، يعني من الحنوط، ثم جاء فجلس، فذكر في الحديث انكشافا من الناس، فقال هكذا عن وجوهنا حتى نضارب القوم، ما هكذا كنا نفعل مع رسول الله صلى الله عليه وسلم، بئس ما عودتم أقرانكم‏.‏ رواه حماد عن ثابت عن أنس‏.‏",
      "text_en": " Narrated Ibn `Aun:                     Once Musa bin Anas while describing the battle of Yamama, said, \"Anas bin Malik went to Thabit bin Qais, who had lifted his clothes from his thighs and was applying Hunut to his body. Anas asked, 'O Uncle! What is holding you back (from the battle)?' He replied, 'O my nephew! I am coming just now,' and went on perfuming himself with Hunut, then he came and sat (in the row). Anas then mentioned that the people fled from the battle-field. On that Thabit said, 'Clear the way for me to fight the enemy. We would never do so (i.e. flee) in the company of Allah's Apostle. How bad the habits you have acquired from your enemies!\"",
      "chain": [
        "30143",
        "20226",
        "11071",
        "14383"
      ]
    },
    {
      "hadith_no": "3334",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا قيس بن حفص، حدثنا خالد بن الحارث، حدثنا شعبة، عن أبي عمران الجوني، عن أنس، يرفعه ‏\"‏ أن الله، يقول لأهون أهل النار عذابا لو أن لك ما في الأرض من شىء كنت تفتدي به قال نعم‏.‏ قال فقد سألتك ما هو أهون من هذا وأنت في صلب آدم أن لا تشرك بي‏.‏ فأبيت إلا الشرك ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"Allah will say to that person of the (Hell) Fire who will receive the least punishment, 'If you had everything on the earth, would you give it as a ransom to free yourself (i.e. save yourself from this Fire)?' He will say, 'Yes.' Then Allah will say, 'While you were in the backbone of Adam, I asked you much less than this, i.e. not to worship others besides Me, but you insisted on worshipping others besides me.' \"",
      "chain": [
        "30158",
        "20226",
        "20020",
        "11296"
      ]
    },
    {
      "hadith_no": "3688",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا قيس بن حفص، حدثنا خالد بن الحارث، حدثنا شعبة، عن أبي التياح، قال سمعت أنسا، عن النبي صلى الله عليه وسلم قال ‏\"‏ الخيل معقود في نواصيها الخير ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"There is always goodness in horses.\"",
      "chain": [
        "30158",
        "20226",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "5609",
      "source": " Sahih Bukhari ",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا خالد بن الحارث، حدثنا عبيد الله، عن نافع، قال كان عبد الله ينحر في المنحر‏.‏ قال عبيد الله يعني منحر النبي صلى الله عليه وسلم‏.‏",
      "text_en": "      Narrated Nafi':                          'Abdullah (bin 'Umar) used to slaughter his sacrifice at the      slaughtering place (i.e the slaughtering place of the Prophet ) .",
      "chain": [
        "30161",
        "20226",
        "11201",
        "11014"
      ]
    },
    {
      "hadith_no": "5837",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا خالد بن الحارث، حدثنا شعبة، عن سليمان، قال سمعت ذكوان، يحدث عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من تردى من جبل فقتل نفسه، فهو في نار جهنم، يتردى فيه خالدا مخلدا فيها أبدا، ومن تحسى سما فقتل نفسه، فسمه في يده، يتحساه في نار جهنم خالدا مخلدا فيها أبدا، ومن قتل نفسه بحديدة، فحديدته في يده، يجأ بها في بطنه في نار جهنم خالدا مخلدا فيها أبدا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever purposely throws himself from a mountain and kills himself, will be in the (Hell) Fire falling down into it and abiding therein perpetually forever; and whoever drinks poison and kills himself with it, he will be carrying his poison in his hand and drinking it in the (Hell) Fire wherein he will abide eternally forever; and whoever kills himself with an iron weapon, will be carrying that weapon in his hand and stabbing his `Abdomen with it in the (Hell) Fire wherein he will abide eternally forever.\"",
      "chain": [
        "30143",
        "20226",
        "20020",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "6236",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا خالد بن الحارث، حدثنا شعبة، عن واقد بن محمد بن زيد، سمعت أبي، عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ ويلكم  أو ويحكم قال شعبة شك هو  لا ترجعوا بعدي كفارا، يضرب بعضكم رقاب بعض ‏\"‏‏.‏ وقال النضر عن شعبة ويحكم‏.‏ وقال عمر بن محمد عن أبيه ويلكم أو ويحكم‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"Wailakum\" (woe to you) or \"waihakum\" (May Allah be merciful to you).\" Shu`ba is not sure as to which was the right word. \"Do not become disbelievers after me by cutting the necks of one another.\"",
      "chain": [
        "30143",
        "20226",
        "20020",
        "11544",
        "11217",
        "18"
      ]
    },
    {
      "hadith_no": "6606",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا قيس بن حفص، حدثنا خالد بن الحارث، حدثنا حاتم بن أبي صغيرة، عن عبد الله بن أبي مليكة، قال حدثني القاسم بن محمد بن أبي بكر، أن عائشة  رضى الله عنها  قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ تحشرون حفاة عراة غرلا ‏\"‏ قالت عائشة فقلت يا رسول الله الرجال والنساء ينظر بعضهم إلى بعض‏.‏ فقال ‏\"‏ الأمر أشد من أن يهمهم ذاك ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle said, \"The people will be gathered barefooted, naked, and uncircumcised.\" I said, \"O Allah's Apostle! Will the men and the women look at each other?\" He said, \"The situation will be too hard for them to pay attention to that.\"",
      "chain": [
        "30158",
        "20226",
        "11274",
        "11090",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "6865",
      "source": " Sahih Bukhari ",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا خالد بن الحارث، حدثنا سفيان، حدثنا أبو حصين، سمعت عمير بن سعيد النخعي، قال سمعت علي بن أبي طالب  رضى الله عنه  قال ما كنت لأقيم حدا على أحد فيموت، فأجد في نفسي، إلا صاحب الخمر، فإنه لو مات وديته، وذلك أن رسول الله صلى الله عليه وسلم لم يسنه‏.‏",
      "text_en": " Narrated `Ali bin Abi Talib:                     I would not feel sorry for one who dies because of receiving a legal punishment, except the drunk, for if he should die (when being punished), I would give blood money to his family because no fixed punishment has been ordered by Allah's Apostle for the drunk.",
      "chain": [
        "30143",
        "20226",
        "20012",
        "11371",
        "11646",
        "5"
      ]
    },
    {
      "hadith_no": "7287",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا عمرو بن علي، حدثنا خالد بن الحارث، حدثنا حميد، عن أنس  رضى الله عنه  خرج النبي صلى الله عليه وسلم في غداة باردة والمهاجرون والأنصار يحفرون الخندق فقال ‏\"‏ اللهم إن الخير خير الآخره فاغفر للأنصار والمهاجره ‏\"‏ فأجابوا نحن الذين بايعوا محمدا على الجهاد ما بقينا أبدا",
      "text_en": " Narrated Anas:                     The Prophet went out on a cold morning while the Muhajirin (emigrants) and the Ansar were digging the trench. The Prophet then said, \"O Allah! The real goodness is the goodness of the Here after, so please forgive the Ansar and the Muhajirin.\" They replied, \"We are those who have given the Pledge of allegiance to Muhammad for to observe Jihad as long as we remain alive.\"",
      "chain": [
        "30153",
        "20226",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "245",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن حبيب الحارثي، حدثنا خالد، - يعني ابن الحارث - حدثنا شعبة، عن عبد الله بن عبد الله، عن أنس، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ حب الأنصار آية الإيمان وبغضهم آية النفاق ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Anas that the Apostle (may peace and blessings be upon him) said:                      The love of the Ansar is the sign of faith and hatred against them is the sign of dissemblance.",
      "chain": [
        "20226",
        "20020",
        "19"
      ]
    },
    {
      "hadith_no": "270",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني يحيى بن حبيب الحارثي، حدثنا خالد، - وهو ابن الحارث - حدثنا شعبة، أخبرنا عبيد الله بن أبي بكر، عن أنس، عن النبي صلى الله عليه وسلم في الكبائر قال ‏\"‏ الشرك بالله وعقوق الوالدين وقتل النفس وقول الزور ‏\"‏ ‏.‏",
      "text_en": " Anas narrated from the Apostle (may peace be upon him) about the major sins. He (the Holy Prophet) observed:                      Associating anyone with Allah, disobedience to parents, killing a person and false utterance.",
      "chain": [
        "20226",
        "20020",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "314",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني زهير بن حرب، حدثنا جرير، ح وحدثنا سعيد بن عمرو الأشعثي، حدثنا عبثر، ح وحدثني يحيى بن حبيب الحارثي، حدثنا خالد، - يعني ابن الحارث - حدثنا شعبة، كلهم بهذا الإسناد مثله ‏.‏ وفي رواية شعبة عن سليمان قال سمعت ذكوان ‏.‏",
      "text_en": " This hadith has been narrated by another chain of transmitters.",
      "chain": [
        "30022",
        "20028",
        "30465",
        "20226",
        "11005"
      ]
    },
    {
      "hadith_no": "280",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنيه يحيى بن حبيب الحارثي، حدثنا خالد يعني ابن الحارث، ح وحدثني محمد بن حاتم، حدثنا يحيى بن سعيد، ح وحدثني محمد بن الوليد، حدثنا محمد بن جعفر، كلهم عن شعبة، في هذا الإسناد بمثله غير أن في رواية يحيى بن سعيد من الزيادة ورخص في كلب الغنم والصيد والزرع وليس ذكر الزرع في الرواية غير يحيى ‏.‏",
      "text_en": " A hadith like this has been narrated from Shu'ba with the same chain of transmitters except for the fact that in the hadith transmitted by Yahya those words are:                     \" He (the Holy Prophet) gave concession in the case of the dog for looking after the herd, for hunting and for watching the cultivated land,\" and there is no mention of this addition (i. e. concession in case of watching the cultivated lands) except in the hadith transmitted by Yahya.",
      "chain": [
        "20226",
        "38487",
        "11062",
        "30174",
        "20173"
      ]
    },
    {
      "hadith_no": "303",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا يحيى بن حبيب الحارثي، حدثنا خالد، - يعني ابن الحارث - حدثنا شعبة، أخبرني سليمان، قال سمعت منذرا، عن محمد بن علي، عن علي، أنه قال استحييت أن أسأل، النبي صلى الله عليه وسلم عن المذى من أجل فاطمة فأمرت المقداد فسأله فقال ‏\"‏ منه الوضوء ‏\"‏ ‏.‏",
      "text_en": " 'Ali reported:                      I felt shy of asking about prostatic fluid from the Apostle (may peace be upon him) because of Fatimah. I, therefore, asked al-Miqdad (to ask on my behalf) and he asked. He (the Holy Prophet) said: Ablution is obligatory in such a case.",
      "chain": [
        "30459",
        "20226",
        "20020",
        "11060",
        "11398",
        "11442",
        "5"
      ]
    },
    {
      "hadith_no": "376",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني يحيى بن حبيب الحارثي، حدثنا خالد، - وهو ابن الحارث - حدثنا شعبة، عن قتادة، قال سمعت أنسا، يقول كان أصحاب رسول الله صلى الله عليه وسلم ينامون ثم يصلون ولا يتوضئون قال قلت سمعته من أنس قال إي والله ‏.‏",
      "text_en": " Qatida reported:                      I heard Anas as saying that the Companion of the Messenger of Allah (may peace be upon him) dozed off and then offered prayer and did not perform ablution. He (the narrator) said: I asked him if he had actually heard it from Anas. He said: By Allah. yes.",
      "chain": [
        "20226",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "493",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، ح قال وحدثنيه يحيى بن حبيب، حدثنا خالد، - يعني ابن الحارث - قالا حدثنا شعبة، بهذا الإسناد وفي حديث ابن جعفر ‏\"‏ ولا يتبسط أحدكم ذراعيه انبساط الكلب ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated by Shu'ba with the same chain of transmitters. And in the hidith transmitted by Ibn Ja'far (the words are):                     \" None of you should stretch out his forearms like the stretching out of a dog.\"",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20226"
      ]
    },
    {
      "hadith_no": "1203",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثناه يحيى بن يحيى، حدثنا خالد، - يعني ابن الحارث - حدثنا شعبة، عن أبي التياح، قال سمعت أنسا، يقول كان رسول الله صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " Abu al-Tiyyah reported:                      I heard from Anas a narration like this from the Messenger of Allah (may peace be upon him).",
      "chain": [
        "30399",
        "20226",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "1260",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن حبيب الحارثي، حدثنا خالد، - يعني ابن الحارث - حدثنا شعبة، قال سألت قتادة عن التفل، في المسجد فقال سمعت أنس بن مالك، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ التفل في المسجد خطيئة وكفارتها دفنها ‏\"‏ ‏.‏",
      "text_en": " Shu'ba reported:                      I asked Qatada about spitting, in the mosque. He said: I heard Anas b. Malik say: I heard the Messenger of Allah (may peace be upon him) say: Spitting in the mosque is a sin, and its expiation is that it should be buried.",
      "chain": [
        "20226",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1494",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا يحيى بن حبيب الحارثي، حدثنا خالد بن الحارث، حدثنا شعبة، أخبرني سيار بن سلامة، قال سمعت أبي يسأل أبا برزة، عن صلاة، رسول الله صلى الله عليه وسلم - قال - قلت آنت سمعته قال فقال كأنما أسمعك الساعة - قال - سمعت أبي يسأله عن صلاة رسول الله صلى الله عليه وسلم فقال كان لا يبالي بعض تأخيرها - قال يعني العشاء - إلى نصف الليل ولا يحب النوم قبلها ولا الحديث بعدها ‏.‏ قال شعبة ثم لقيته بعد فسألته فقال وكان يصلي الظهر حين تزول الشمس والعصر يذهب الرجل إلى أقصى المدينة والشمس حية - قال - والمغرب لا أدري أى حين ذكر ‏.‏ قال ثم لقيته بعد فسألته فقال وكان يصلي الصبح فينصرف الرجل فينظر إلى وجه جليسه الذي يعرف فيعرفه ‏.‏ قال وكان يقرأ فيها بالستين إلى المائة ‏.‏",
      "text_en": " Sayyar b. Salama reported:                      I heard my father asking Abu Barza (al- Aslami) about the prayer of Allah's Messenger (may peace be upon him) I (Shu'ba, one of the narrators) said: Did you hear it (from Abu Barza)? He said: 1 feel as if I am bearing you at this very time. He said: I heard my father asking about the prayer of the Messenger of Allah (may peace be upon him) and he (Abu Barza) making this reply: He (the Holy Prophet) did not mind delaying-some (prayer) i. e. 'Isya' prayer, even up to the midnight and did not like sleeping before observing it, and talking after it. Shu'ba said: I met him subsequently and asked him (about the prayers of the Holy Prophet) and he said: He observed the noon prayer when the sun was past the meridian, he would pray the afternoon prayer, after which a person would o to the outskirts of Medina and the sun was still bright; (I forgot what he said about the evening prayer) ; I then met him on a subsequent occasion and asked him (about the prayers of the Holy Prophet; and he said: He would observe the morning prayer (at such a time) so that a man would go back and would recognise his neighbour by casting a glance at his face, and he would recite from sixty to one hundred verses in it.",
      "chain": [
        "20226",
        "20020",
        "11290"
      ]
    },
    {
      "hadith_no": "1500",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني يحيى بن حبيب الحارثي، حدثنا خالد بن الحارث، حدثنا شعبة، عن بديل، قال سمعت أبا العالية، يحدث عن عبد الله بن الصامت، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم وضرب فخذي ‏\"‏ كيف أنت إذا بقيت في قوم يؤخرون الصلاة عن وقتها ‏\"‏ ‏.‏ قال قال ما تأمر قال ‏\"‏ صل الصلاة لوقتها ثم اذهب لحاجتك فإن أقيمت الصلاة وأنت في المسجد فصل ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      The Messenger of Allah (may peace be upon him) struck my thigh and said: How would you act if you survive among the people who would delay prayers beyond their (prescribed) time? He (Abu Dharr) said: What do you command (under this situation)? He (the Holy Prophet) slid: Observe prayer at its prescribed time, then go (to meet) your needs, and if the Iqama is pronounced, and you are present in the mosque, then observe prayer (along with the Jama'at).",
      "chain": [
        "20226",
        "20020",
        "11618",
        "10695",
        "23"
      ]
    },
    {
      "hadith_no": "1502",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا عاصم بن النضر التيمي، حدثنا خالد بن الحارث، حدثنا شعبة، عن أبي نعامة، عن عبد الله بن الصامت، عن أبي ذر، قال قال ‏\"‏ كيف أنتم - أو قال كيف أنت - إذا بقيت في قوم يؤخرون الصلاة عن وقتها فصل الصلاة لوقتها ثم إن أقيمت الصلاة فصل معهم فإنها زيادة خير ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      (The Messenger of Allah) said: How would you, or how would thou, act if you survive to live among people who defer prayer beyond the (prescribed) time? (The narrator said: Allah and His Messenger know best). whereupon he said: Observe prayer at its prescribed time, but if the Iqama is pronounced for (congregational) prayer, then observe prayer along with them. for herein is an excess of virtue.",
      "chain": [
        "20226",
        "20020",
        "10695",
        "23"
      ]
    },
    {
      "hadith_no": "1627",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثناه يحيى بن حبيب، حدثنا خالد يعني ابن الحارث، ح وحدثنا ابن المثنى، قال حدثني عبد الصمد، قالا حدثنا شعبة، بهذا الإسناد ولم يقولا في الحديث بمنى ‏.‏ ولكن قالا صلى في السفر ‏.‏",
      "text_en": " This hadith has been narrated by Shu'ba with the same chain of transmitters but no mention has been made of Mina, but they (the narrators) only said:                      He prayed while travelling.",
      "chain": [
        "20226",
        "20250"
      ]
    },
    {
      "hadith_no": "1664",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا يحيى بن حبيب الحارثي، حدثنا خالد، - يعني ابن الحارث - حدثنا قرة، حدثنا أبو الزبير، حدثنا سعيد بن جبير، حدثنا ابن عباس، أن رسول الله صلى الله عليه وسلم جمع بين الصلاة في سفرة سافرها في غزوة تبوك فجمع بين الظهر والعصر والمغرب والعشاء ‏.‏ قال سعيد فقلت لابن عباس ما حمله على ذلك قال أراد أن لا يحرج أمته ‏.‏",
      "text_en": " Ibn 'Abbas reported that the Messenger of Allah (may peace be upon him) combined the prayers as he set on a journey in the expedition to Tabuk. He combined the noon prayer with the afternoon prayer and the sunset prayer with the 'Isha' prayer. Sa'id (one of the rawis) said to Ibn 'Abbas:                      What prompted him to do this? He said: He wanted that his Ummah should not be put to (unnecessary) hardship.",
      "chain": [
        "20226",
        "11301",
        "11263",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1666",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن حبيب، حدثنا خالد، - يعني ابن الحارث - حدثنا قرة بن خالد، حدثنا أبو الزبير، حدثنا عامر بن واثلة أبو الطفيل، حدثنا معاذ بن جبل، قال جمع رسول الله صلى الله عليه وسلم في غزوة تبوك بين الظهر والعصر وبين المغرب والعشاء ‏.‏ قال فقلت ما حمله على ذلك قال فقال أراد أن لا يحرج أمته ‏.‏",
      "text_en": " Mu'adh b. Jabal reported:                      The Messenger of Allah (may peace be upon him) combined in the expedition to Tabuk the noon prayer with the afternoon prayer and the sunset prayer with the 'Isha' prayer. He (one of the narrators) said: What prompted him to do that? He (Mu'adh) replied that he (the Holy Prophet) wanted that his Ummah should not be put to (unnecessary) hardship.",
      "chain": [
        "20226",
        "11301",
        "11263",
        "32"
      ]
    },
    {
      "hadith_no": "1698",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني يحيى بن حبيب الحارثي، حدثنا خالد بن الحارث، عن سعيد، حدثنا قتادة، أن معاذة العدوية، حدثتهم عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصلي الضحى أربعا ويزيد ما شاء الله ‏.‏",
      "text_en": " Mua'ada 'Adawiyya reported 'A'isha as saying:                      The Messenger of Allah (may peace be upon him) used to observe four rak'ahs in the forenoon prayer and he sometimes observed more as Allah pleased.",
      "chain": [
        "20226",
        "11168",
        "11019",
        "53"
      ]
    },
    {
      "hadith_no": "1891",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثناه يحيى بن حبيب الحارثي، حدثنا خالد بن الحارث، ح وحدثنا عبيد، الله بن معاذ حدثنا أبي قالا، حدثنا شعبة، بهذا الإسناد نحوه وفي حديث خالد بن الحارث قال على راحلة يسير وهو يقرأ سورة الفتح ‏.‏",
      "text_en": " Al-Bara' reported that a person was reciting Surat al-Kahf and there was a horse tied with two ropes at his side, a cloud overshadowed him, and as it began to come nearer and nearer his horse began to take fright from it. He went and mentioned that to the Prophet (may peace be upon him) in the morning, and he (the Holy Prophet) said:                      That was tranquillity which came down at the recitation of the Qur'an.",
      "chain": [
        "20226",
        "30150",
        "20286"
      ]
    },
    {
      "hadith_no": "1902",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن حبيب الحارثي، حدثنا خالد، - يعني ابن الحارث - حدثنا شعبة، عن قتادة، قال سمعت أنسا، يقول قال رسول الله صلى الله عليه وسلم لأبى بمثله ‏.‏",
      "text_en": " 'Abdullah (b. Mas'ud) reported:                      The Messenger of Allah (may peace be upon (him) asked me to recite the Qur'an. He said: Messenger of Allah, (how) should I recite to you whereas it has been sent down to you? He (the Holy Prophet) said: I desire to hear it from someone else. So I recited Surat al-Nisa' till I reached the verse: How then shall it be when We shall bring from every people a witness and bring you against them as a witness?\" (verse 41). I lifted my head or a person touched me in my side, and so I lifted my head and saw his tears falling (from the Holy Prophet's eyes).",
      "chain": [
        "20226",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "2031",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا عبيد الله بن عمر القواريري، وأبو كامل الجحدري جميعا عن خالد، - قال أبو كامل حدثنا خالد بن الحارث، - حدثنا عبيد الله، عن نافع، عن ابن عمر، قال كان رسول الله صلى الله عليه وسلم يخطب يوم الجمعة قائما ثم يجلس ثم يقوم ‏.‏ قال كما يفعلون اليوم ‏.‏",
      "text_en": " Ibn 'Umar said that the Messenger of Allah (may peace be upon him) used to deliver the sermon on Friday while standing. He would then sit and then stand (for the second sermon) as they (the Muslims) do nowadays.",
      "chain": [
        "30024",
        "30559",
        "20423",
        "20226",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2144",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "حدثنا يحيى بن حبيب الحارثي، حدثنا خالد بن الحارث، حدثنا ابن جريج، حدثني منصور بن عبد الرحمن، عن أمه، صفية بنت شيبة عن أسماء بنت أبي بكر، أنها قالت فزع النبي صلى الله عليه وسلم يوما - قالت تعني يوم كسفت الشمس - فأخذ درعا حتى أدرك بردائه فقام للناس قياما طويلا لو أن إنسانا أتى لم يشعر أن النبي صلى الله عليه وسلم ركع ما حدث أنه ركع من طول القيام ‏.‏",
      "text_en": " Asma' bint Abu Bakr said:                      The Apostle of Allah (may peace be upon him) was one day (i. e. on the day when the sun eclipsed) so perturbed that he (in haste) took hold of the outer garment (of a female member of his family) and it was later on that his (own) cloak was sent to him. He stood in prayer along with people for such a long time that if a man came he did not realise that the Apostle of Allah (may peace be upon him) had observed ruku', as it has been narrated about ruku' in connection with long qiyam.",
      "chain": [
        "20226",
        "11070",
        "11565",
        "2802",
        "70"
      ]
    },
    {
      "hadith_no": "2180",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثناه يحيى بن حبيب الحارثي، حدثنا خالد يعني ابن الحارث، ح وحدثنا عقبة بن مكرم العمي، حدثنا عبد الملك بن عمرو، ح وحدثني أحمد بن إبراهيم الدورقي، حدثنا عبد الصمد، قالوا جميعا حدثنا شعبة، بهذا الإسناد نحو حديث عثمان بن عمر بقصته ‏.‏ وفي حديث عبد الصمد مر النبي صلى الله عليه وسلم بامرأة عند قبر ‏.‏",
      "text_en": " A hadith like this is narrated with the same chain of transmitters but with the addition of these words:                     \" The Apostle of Allah (may peace be upon him) happened to pass by a woman (who was sitting) by the side of a grave.\"",
      "chain": [
        "20226",
        "30441",
        "30494",
        "20250"
      ]
    },
    {
      "hadith_no": "2626",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا عاصم بن النضر التيمي، حدثنا خالد، - يعني ابن الحارث - حدثنا حميد، عن ثابت، عن أنس، - رضى الله عنه - قال واصل رسول الله صلى الله عليه وسلم في أول شهر رمضان فواصل ناس من المسلمين فبلغه ذلك فقال ‏\"‏ لو مد لنا الشهر لواصلنا وصالا يدع المتعمقون تعمقهم إنكم لستم مثلي - أو قال - إني لست مثلكم إني أظل يطعمني ربي ويسقيني ‏\"‏ ‏.‏",
      "text_en": " Anas (Allah be pleased with him) reported that the Messenger of Allah (may peace be upon him) observed Saum Wisal during the early part of the month of Ramadan. The people among Muslims also observed uninterrupted fast. This (news) reached him (the Holy Prophet) and he said:                      Had the month been lengthened for me I would have continued observing Saum Wisal, so that those who act with forced hardness would (have been obliged) to abandon it. You are not like me (or he said): I am not like you. I continue to do so (in a state) that my Lord feeds me and provides me drink.",
      "chain": [
        "20226",
        "11279",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "2900",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن حبيب الحارثي، حدثنا خالد، - يعني ابن الحارث - حدثنا شعبة، عن إبراهيم بن محمد بن المنتشر، قال سمعت أبي يحدث، عن عائشة، - رضى الله عنها - أنها قالت كنت أطيب رسول الله صلى الله عليه وسلم ثم يطوف على نسائه ثم يصبح محرما ينضخ طيبا ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      I used to apply perfume to the Messenger of Allah (may peace be upon him). He then went round his wives, and entered upon the state of Ihram in the morning and the perfume was shaken off.",
      "chain": [
        "20226",
        "20020",
        "11321",
        "11388",
        "53"
      ]
    },
    {
      "hadith_no": "2994",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا يحيى بن حبيب الحارثي، حدثنا خالد بن الحارث، حدثنا قرة، حدثنا عبد الحميد بن جبير بن شيبة، حدثتنا صفية بنت شيبة، قالت قالت عائشة رضى الله عنها يا رسول الله أيرجع الناس بأجرين وأرجع بأجر فأمر عبد الرحمن بن أبي بكر أن ينطلق بها إلى التنعيم ‏.‏ قالت فأردفني خلفه على جمل له - قالت - فجعلت أرفع خماري أحسره عن عنقي فيضرب رجلي بعلة الراحلة ‏.‏ قلت له وهل ترى من أحد قالت فأهللت بعمرة ثم أقبلنا حتى انتهينا إلى رسول الله صلى الله عليه وسلم وهو بالحصبة ‏.‏",
      "text_en": " Safiyya hint Shaiba reported that 'A'isha (Allah be pleased with her) said:                      Messenger of Allah, lo! the people are returning with two rewards whereas I am return- ing with one reward. Thereupon he commanded 'Abd al-Rahman b. Abu Bakr to take her to al-Tan'im. She ('A'isha) said: He seated me behind him on his camel. She (further) stated: I lifted my head covering and took it off from my neck. He struck my foot as if he was striking the camel. I said to him: Do you find anyone bere? She (further) said: I entered into the state of Ihram fond. 'Umra till we reached the Messen- ger of Allah (may peace be upon him) and he was at Hasba.",
      "chain": [
        "20226",
        "11301",
        "11255",
        "2802",
        "53"
      ]
    },
    {
      "hadith_no": "3022",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنيه يحيى بن حبيب الحارثي، حدثنا خالد، - يعني ابن الحارث - أخبرنا شعبة، بهذا الإسناد مثله ‏.‏",
      "text_en": " This hadith has been narrated by Shu'ba with the same chain of transmitters.",
      "chain": [
        "20226"
      ]
    },
    {
      "hadith_no": "3122",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا خالد بن الحارث، عن عبيد الله، عن نافع، عن عبد الله، ذكر أن رسول الله صلى الله عليه وسلم كان لا يستلم إلا الحجر والركن اليماني.",
      "text_en": " Nafi' reported on the authority of 'Abdullah (Allah be pleased with him) that Allah's Messenger (way peace be upon him) did not touch but the Stone and the Yamani corner.",
      "chain": [
        "30170",
        "20226",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3298",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني حميد بن مسعدة، حدثنا خالد، - يعني ابن الحارث - حدثنا عبد الله، بن عون عن نافع، عن عبد الله بن عمر، أنه انتهى إلى الكعبة وقد دخلها النبي صلى الله عليه وسلم وبلال وأسامة وأجاف عليهم عثمان بن طلحة الباب قال فمكثوا فيه مليا ثم فتح الباب فخرج النبي صلى الله عليه وسلم ورقيت الدرجة فدخلت البيت فقلت أين صلى النبي صلى الله عليه وسلم قالوا ها هنا ‏.‏ قال ونسيت أن أسألهم كم صلى.",
      "text_en": " Abdullah b. Umar reported that he reached the Ka'ba and Allah's Apostle (may peace be upon him) had entered therein, and Bilal and Usama too. 'Uthman b. Talha closed the door to them, and they stayed there for a considerable time, and then the door was opend and Allah's Apostle (may peace be upon him) came out, and I went upstairs and entered the House and said:                      Where did Allah's Apostle (may peace be upon him) observe prayer? They said: At this very place. I, however, forgot to ask them about the (number of) rak'ahs that he observed.",
      "chain": [
        "30430",
        "20226",
        "11071",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3458",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني أبو معن الرقاشي، زيد بن يزيد الثقفي - بصري ثقة - حدثنا خالد، - يعني ابن الحارث - عن ابن عجلان، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمثل حديث يحيى القطان ‏.",
      "text_en": " This hadith has been reported on the authority of Ibn Umar (Allah be pleased with them) with another chain of transmitters.",
      "chain": [
        "30432",
        "20226",
        "10616",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3506",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني أبو معن الرقاشي، حدثنا خالد بن الحارث، حدثنا هشام، عن يحيى، أنه كتب إليه عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تنكح المرأة على عمتها ولا على خالتها ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      One should not combine in marriage a woman with her father's sister, or her mother's sister.",
      "chain": [
        "30432",
        "20226",
        "20295",
        "20031",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3538",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثني عبيد الله بن عمر بن ميسرة القواريري، حدثنا خالد بن الحارث، حدثنا هشام، عن يحيى بن أبي كثير، حدثنا أبو سلمة، حدثنا أبو هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تنكح الأيم حتى تستأمر ولا تنكح البكر حتى تستأذن ‏\"‏ ‏.‏ قالوا يا رسول الله وكيف إذنها قال ‏\"‏ أن تسكت ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as having said:                      A woman without a husband (or divorced or a widow) must not be married until she is consulted, and a virgin must not be married until her permission is sought. They asked the Prophet of Allah (may peace be upon him): How her (virgin's) consent can be solicited? He (the Holy Prophet) said: That she keeps silence.",
      "chain": [
        "20226",
        "20295",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3583",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا خالد بن الحارث، عن عبيد الله، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا دعي أحدكم إلى الوليمة فليجب ‏\"‏ ‏.‏ قال خالد فإذا عبيد الله ينزله على العرس ‏.‏",
      "text_en": " Ibn 'Umar (Allah be pleased with them) reported Allah's Apostle (may peace be upon him) as saying:                      When any one of you is invited to a feast, he should accept. 'Ubaidallah took this feast to be a wedding feast.",
      "chain": [
        "30170",
        "20226",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3612",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثنيه يحيى بن حبيب، حدثنا خالد، - يعني ابن الحارث - حدثنا شعبة، بهذا الإسناد وقال ‏\"‏ حتى ترجع ‏\"‏ ‏.‏",
      "text_en": "  This hadith has been narrated through the same chain of transmitters (with a slight variation):                     \" He said: Until she comes back.\"",
      "chain": [
        "20226"
      ]
    },
    {
      "hadith_no": "3621",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، ح وحدثنا يحيى، بن حبيب حدثنا خالد يعني ابن الحارث، ح وحدثني محمد بن حاتم، حدثنا عبد الرحمن، بن مهدي وبهز قالوا جميعا حدثنا شعبة، عن أنس بن سيرين، بهذا الإسناد مثله غير أن في حديثهم عن النبي صلى الله عليه وسلم قال في العزل ‏\"‏ لا عليكم أن لا تفعلوا ذاكم فإنما هو القدر ‏\"‏ ‏.‏ وفي رواية بهز قال شعبة قلت له سمعته من أبي سعيد قال نعم ‏.‏",
      "text_en": " This hadith is reported on the authority of Abu Sa'id with the same chain of transmitters but with a slight variation (of words).",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20226",
        "38487",
        "20020",
        "11038"
      ]
    },
    {
      "hadith_no": "3683",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثنيه يحيى بن حبيب الحارثي، حدثنا خالد، - يعني ابن الحارث - حدثنا شعبة، عن قتادة، بهذا الإسناد نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "20226",
        "20020"
      ]
    },
    {
      "hadith_no": "3684",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثنيه يحيى بن حبيب الحارثي، حدثنا خالد بن الحارث، حدثنا شعبة، عن قتادة، عن أبي الخليل، عن أبي سعيد، قال أصابوا سبيا يوم أوطاس لهن أزواج فتخوفوا فأنزلت هذه الآية ‏{‏ والمحصنات من النساء إلا ما ملكت أيمانكم‏}‏ ‏.‏",
      "text_en": "  This hadith has been reported on the authority of AbuSa'id (al-Khudri) (Allah be pleased with him) through another chain of transmitters and the words are:                      They took captives (women) on the day of Autas who had their husbands. They were afraid (to have sexual intercourse with them) when this verse was revealed:\" And women already married except those whom you right hands posses\" (iv. 24)",
      "chain": [
        "20226",
        "20020",
        "11019",
        "11291",
        "38"
      ]
    },
    {
      "hadith_no": "3685",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثني يحيى بن حبيب، حدثنا خالد، - يعني ابن الحارث - حدثنا سعيد، عن قتادة، بهذا الإسناد نحوه ‏.‏",
      "text_en": " Qatada reported a hadith like this with the same chain of transmitters.",
      "chain": [
        "20226",
        "11168"
      ]
    },
    {
      "hadith_no": "3741",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنيه يحيى بن حبيب، حدثنا خالد بن الحارث، ح وحدثنيه عبد الرحمن بن، بشر حدثنا بهز، قالا حدثنا شعبة، بهذا الإسناد غير أن في، حديثهما ‏\"‏ ليرجعها ‏\"‏ ‏.‏ وفي حديثهما قال قلت له أتحتسب بها قال فمه ‏.‏",
      "text_en": "  This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters but with a slight variation in wording.",
      "chain": [
        "20226",
        "20214"
      ]
    },
    {
      "hadith_no": "3780",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "حدثنا يحيى بن حبيب، حدثنا خالد بن الحارث الهجيمي، حدثنا قرة، حدثنا سيار، أبو الحكم حدثنا الشعبي، قال دخلنا على فاطمة بنت قيس فأتحفتنا برطب ابن طاب وسقتنا سويق سلت فسألتها عن المطلقة، ثلاثا أين تعتد قالت طلقني بعلي ثلاثا فأذن لي النبي صلى الله عليه وسلم أن أعتد في أهلي ‏.",
      "text_en": " Sha'bi reported:                      We visited Fitima hint Qais and she served us fresh dates and a drink of barley flour, and I asked where should a woman who has been divorced by three pronouncements, spend the period of her 'Idda. She said: My husband divorced me with three pronouncements, and Allah's Apostle (may peace be upon him) permitted me to spend my 'Idda period in my family (with my parents).",
      "chain": [
        "20226",
        "11301",
        "11429",
        "11052"
      ]
    },
    {
      "hadith_no": "4029",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنا يحيى بن حبيب، حدثنا خالد بن الحارث، ح وحدثنا عمرو بن علي، حدثنا عبد الأعلى، ح وحدثنا إسحاق بن إبراهيم، أخبرنا عبدة، كلهم عن ابن أبي عروبة، عن يعلى بن حكيم، بهذا الإسناد ‏.‏ مثله ‏.‏",
      "text_en": "",
      "chain": [
        "20226",
        "30153",
        "20246",
        "30123",
        "11073"
      ]
    },
    {
      "hadith_no": "4105",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثنيه يحيى بن حبيب، حدثنا خالد يعني ابن الحارث، ح وحدثني محمد بن، حاتم حدثنا يحيى بن سعيد، ح وحدثني محمد بن الوليد، حدثنا محمد بن جعفر، ح وحدثنا  إسحاق بن إبراهيم، أخبرنا النضر، ح وحدثنا محمد بن المثنى، حدثنا وهب بن جرير، كلهم عن شعبة، بهذا الإسناد ‏.‏ وقال ابن حاتم في حديثه عن يحيى، ورخص، في كلب الغنم والصيد والزرع ‏.‏",
      "text_en": "  In the hadith transmitted on the authority of Yahya, he (the Holy Prophet) permitted the keeping of dogs for (the protection of) herds, for hunting and (the protection of) cultivated land.",
      "chain": [
        "20226",
        "38487",
        "11062",
        "30174",
        "20173",
        "30123",
        "20291",
        "30170",
        "20298",
        "11449"
      ]
    },
    {
      "hadith_no": "4190",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثني يحيى بن حبيب الحارثي، حدثنا خالد بن الحارث، حدثنا شعبة، أخبرنا محارب، عن جابر، عن النبي صلى الله عليه وسلم بهذه القصة غير أنه قال فاشتراه مني بثمن قد سماه ‏.‏ ولم يذكر الوقيتين والدرهم والدرهمين ‏.‏ وقال أمر ببقرة فنحرت ثم قسم لحمها ‏.‏",
      "text_en": " Jabir b. 'Abdullah (Allah be pleased with them) reported this narration from Allah's Apostle (may peace be upon him) but with this variation that he said:                      He (the Holy Prophet) bought the camel from me on a stipulated price. And he did not mention two 'uqiyas and a dirham or two dirhams, and he comanded a cow (to be slaughtered) and it was slaughtered, and he then distributed its flesh.",
      "chain": [
        "20226",
        "20020",
        "11389",
        "34"
      ]
    },
    {
      "hadith_no": "4280",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Gifts - كتاب الهبات",
      "chapter_no": "25",
      "text_ar": "حدثنا عبيد الله بن عمر القواريري، حدثنا خالد بن الحارث، حدثنا هشام، عن يحيى بن أبي كثير، حدثني أبو سلمة بن عبد الرحمن، قال سمعت جابر بن عبد الله، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ العمرى لمن وهبت له ‏\"‏ ‏.‏",
      "text_en": " Jabir (b. 'Abdullah) (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      Life grant is for one upon whom it is bestowed.",
      "chain": [
        "30024",
        "20226",
        "20295",
        "11449",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "4288",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Gifts - كتاب الهبات",
      "chapter_no": "25",
      "text_ar": "حدثنا يحيى بن حبيب الحارثي، حدثنا خالد، - يعني ابن الحارث - حدثنا سعيد، عن قتادة، عن عطاء، عن جابر، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ العمرى ميراث لأهلها ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Abdullah (Allah be pleased with them) reported Allah's Apostle (may peace be upon him) as saying:                      Life grant is the heritage of one upon whom it is conferred.",
      "chain": [
        "20226",
        "11168",
        "11019",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "4290",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Gifts - كتاب الهبات",
      "chapter_no": "25",
      "text_ar": "وحدثنيه يحيى بن حبيب، حدثنا خالد، - يعني ابن الحارث - حدثنا سعيد، عن قتادة، بهذا الإسناد غير أنه قال ‏\"‏ ميراث لأهلها ‏\"‏ ‏.‏ أو قال ‏\"‏ جائزة ‏\"‏ ‏.‏",
      "text_en": " This hadith is narrated on the authority of Qatada with the same chain of transmitters.",
      "chain": [
        "20226",
        "11168"
      ]
    },
    {
      "hadith_no": "4455",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "وحدثني يحيى بن حبيب الحارثي، حدثنا خالد يعني ابن الحارث، ح وحدثنا أبو كريب، حدثنا ابن إدريس، كلاهما عن شعبة، بهذا الإسناد ‏.‏ نحوه وفي حديث ابن إدريس فرضخ رأسه بين حجرين ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters and in the hadith narrated on the authority of Ibn Idris (the words are):                     \" He (commanded) to crush his head between two stones.\"",
      "chain": [
        "20226",
        "30216"
      ]
    },
    {
      "hadith_no": "4476",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثني يحيى بن حبيب، حدثنا خالد، - يعني ابن الحارث - ح وحدثني بشر بن خالد، حدثنا محمد بن جعفر، ح وحدثنا ابن، المثنى وابن بشار قالا حدثنا ابن أبي عدي، كلهم عن شعبة، عن الأعمش، عن أبي وائل، عن عبد الله، عن النبي صلى الله عليه وسلم ‏.‏ بمثله غير أن بعضهم قال عن شعبة ‏\"‏ يقضى ‏\"‏ ‏.‏ وبعضهم قال ‏\"‏ يحكم بين الناس ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Abdullah through another chain of transmitters with a slight variation of words.",
      "chain": [
        "30150",
        "20286",
        "20226",
        "30126",
        "20173",
        "20276",
        "20020",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "4550",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثنا يحيى بن حبيب الحارثي، حدثنا خالد، - يعني ابن الحارث - حدثنا شعبة، حدثنا قتادة، قال سمعت أنسا، يقول أتي رسول الله صلى الله عليه وسلم برجل ‏.‏ فذكر نحوه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Anas through another chain of transmitters.",
      "chain": [
        "20226",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "4737",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا نصر بن علي الجهضمي، حدثنا خالد بن الحارث، حدثنا سعيد بن أبي، عروبة عن قتادة، أن أنس بن مالك، حدثهم قال لما نزلت ‏{‏ إنا فتحنا لك فتحا مبينا * ليغفر لك الله‏}‏ إلى قوله ‏{‏ فوزا عظيما‏}‏ مرجعه من الحديبية وهم يخالطهم الحزن والكآبة وقد نحر الهدى بالحديبية فقال ‏\"‏ لقد أنزلت على آية هي أحب إلى من الدنيا جميعا ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Anas b. Malik who said:                      When they (Companions of the Holy Prophet) were overwhelmed with grief and distress on his return from Hudaibiya where he had slaughtered his sacrificial beasts (not being allowed to proceed to Mecca), the Qur'anic verse: Inna fatahna... laka fathan mobinan to fauzan 'aziman, was revealed to him. (At this) he said: On me has descended a verse that is dearer to me than the whole world.",
      "chain": [
        "30395",
        "20226",
        "11073",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "4829",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، ح وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا ابن المثنى، حدثنا خالد يعني ابن الحارث، ح وحدثنا عبيد الله بن سعيد، حدثنا يحيى، - يعني القطان - كلهم عن عبيد الله بن عمر، ح وحدثنا أبو الربيع، وأبو كامل قالا حدثنا حماد بن زيد، ح وحدثني زهير بن حرب، حدثنا إسماعيل، جميعا عن أيوب، ح وحدثني محمد بن رافع، حدثنا ابن أبي فديك، أخبرنا الضحاك، - يعني ابن عثمان - ح وحدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثني أسامة، كل هؤلاء عن نافع، عن ابن عمر، مثل حديث الليث عن نافع، ‏.‏",
      "text_en": " This tradition has been narrated through more; than one chain of transmitters.",
      "chain": [
        "30201",
        "20352",
        "30212",
        "20331",
        "20226",
        "30359",
        "11201",
        "30137",
        "20022"
      ]
    },
    {
      "hadith_no": "4886",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني يحيى بن حبيب الحارثي، حدثنا خالد، - يعني ابن الحارث - حدثنا شعبة بن الحجاج، عن قتادة، قال سمعت أنسا، يحدث عن أسيد بن حضير، أن رجلا، من الأنصار خلا برسول الله صلى الله عليه وسلم بمثله ‏.‏ وحدثنيه عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، بهذا الإسناد ولم يقل خلا برسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " This tradition has been narrated on the same authority through a different chain of transmitters. Another version of the tradition narrated on the authority of Shu'ba does not include the words:                     \" He took the Messenger of Allah (may peace be upon him) aside.\"",
      "chain": [
        "20226",
        "20020",
        "11019",
        "19",
        "45"
      ]
    },
    {
      "hadith_no": "4963",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا يحيى بن حبيب، حدثنا خالد يعني ابن الحارث، ح وحدثني محمد بن، الوليد حدثنا محمد بن جعفر، قالا حدثنا شعبة، عن أبي التياح، سمع أنسا، يحدث عن  النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Anas through another chain of transmitters.",
      "chain": [
        "20226",
        "30174",
        "20173",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "5032",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا يحيى بن حبيب الحارثي، حدثنا خالد بن الحارث، حدثنا ابن جريج، حدثني  يونس بن يوسف، عن سليمان بن يسار، قال تفرق الناس عن أبي هريرة، فقال له ناتل أهل الشام أيها الشيخ حدثنا حديثا سمعته من رسول الله صلى الله عليه وسلم قال نعم سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن أول الناس يقضى يوم القيامة عليه رجل استشهد فأتي به فعرفه نعمه فعرفها قال فما عملت فيها قال قاتلت فيك حتى استشهدت ‏.‏ قال كذبت ولكنك قاتلت لأن يقال جريء ‏.‏ فقد قيل ‏.‏ ثم أمر به فسحب على وجهه حتى ألقي في النار ورجل تعلم العلم وعلمه وقرأ القرآن فأتي به فعرفه نعمه فعرفها قال فما عملت فيها قال تعلمت العلم وعلمته وقرأت فيك القرآن ‏.‏ قال كذبت ولكنك تعلمت العلم ليقال عالم ‏.‏ وقرأت القرآن ليقال هو قارئ ‏.‏ فقد قيل ثم أمر به فسحب على وجهه حتى ألقي في النار ‏.‏ ورجل وسع الله عليه وأعطاه من أصناف المال كله فأتي به فعرفه نعمه فعرفها قال فما عملت فيها قال ما تركت من سبيل تحب أن ينفق فيها إلا أنفقت فيها لك قال كذبت ولكنك فعلت ليقال هو جواد ‏.‏ فقد قيل ثم أمر به فسحب على وجهه ثم ألقي في النار ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Sulaiman b. Yasar who said:                      People dispersed from around Abu Huraira, and Natil, who was from the Syrians. said to him: O Shaikh, relate (to us) a tradition you have heard from the Messenger of Allah (may peace be upon him). He said: Yes. I heard the Messenger of Allah (may peace be upon him) say: The first of men (whose case) will be decided on the Day of Judgment will be a man who died as a martyr. He shall be brought (before the Judgment Seat). Allah will make him recount His blessings (i. e. the blessings which He had bestowed upon him) and he will recount them (and admit having enjoyed them in his life). (Then) will Allah say: What did you do (to requite these blessings)? He will say: I fought for Thee until I died as a martyr. Allah will say: You have told a lie. You fought that you might be called a\" brave warrior\". And you were called so. (Then) orders will be passed against him and he will be dragged with his face downward and cast into Hell. Then will be brought forward a man who acquired knowledge and imparted it (to others) and recited the Qur'an. He will be brought And Allah will make him recount His blessings and he will recount them (and admit having enjoyed them in his lifetime). Then will Allah ask: What did you do (to requite these blessings)? He will say: I acquired knowledge and disseminated it and recited the Qur'an seeking Thy pleasure. Allah will say: You have told a lie. You acquired knowledge so that you might be called\" a scholar,\" and you recited the Qur'an so that it might be said:\" He is a Qari\" and such has been said. Then orders will be passed against him and he shall be dragged with his face downward and cast into the Fire. Then will be brought a man whom Allah had made abundantly rich and had granted every kind of wealth. He will be brought and Allah will make him recount His blessings and he will recount them and (admit having enjoyed them in his lifetime). Allah will (then) ask: What have you done (to requite these blessings)? He will say: I spent money in every cause in which Thou wished that it should be spent. Allah will say: You are lying. You did (so) that it might be said about (You):\" He is a generous fellow\" and so it was said. Then will Allah pass orders and he will be dragged with his face downward and thrown into Hell.",
      "chain": [
        "20226",
        "11070",
        "10987",
        "11005"
      ]
    },
    {
      "hadith_no": "5161",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنيه زهير بن حرب، حدثنا يحيى بن سعيد، ح وحدثني يحيى بن حبيب، حدثنا  خالد، - يعني ابن الحارث - كلاهما عن شعبة، بهذا الإسناد وفي حديث يحيى بوركها أو فخذيها ‏.‏",
      "text_en": "",
      "chain": [
        "30022",
        "20031",
        "30459",
        "20226",
        "20020"
      ]
    },
    {
      "hadith_no": "5170",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنيه زهير بن حرب، حدثنا يحيى بن سعيد، وعبد الرحمن بن مهدي، ح وحدثني  يحيى بن حبيب، حدثنا خالد بن الحارث، ح وحدثنا أبو كريب، حدثنا أبو أسامة، كلهم عن  شعبة، بهذا الإسناد ‏.‏",
      "text_en": "",
      "chain": [
        "20031",
        "20033",
        "20226",
        "30216"
      ]
    },
    {
      "hadith_no": "5201",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثنا يحيى بن حبيب، حدثنا خالد، - يعني ابن الحارث - حدثنا شعبة، أخبرني  قتادة، قال سمعت أنسا، يقول ضحى رسول الله صلى الله عليه وسلم ‏.‏ بمثله ‏.‏ قال قلت آنت سمعته من أنس قال نعم ‏.‏",
      "text_en": " Shu'ba reported:                      Qatada informed me that he had heard Anas saying that Allah's Messenger (may peace be npon him) sacrificed (the horned rams) and like that. I said: Did you (Qatada) hear from Anas? He said. Yes.",
      "chain": [
        "20226",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "5595",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، ح وحدثنيه زهير بن حرب،حدثنا يحيى بن سعيد، ح وحدثنا ابن المثنى، حدثنا خالد بن الحارث، ح وحدثنا سهل،بن عثمان حدثنا عقبة بن خالد، كلهم عن عبيد الله، عن نافع، عن ابن عمر، عن النبي صلىالله عليه وسلم بهذا الحديث في خاتم الذهب وزاد في حديث عقبة بن خالد وجعله فييده اليمنى ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn 'Umar through other chains of transmitters but with a slight variation of wording.",
      "chain": [
        "30201",
        "20352",
        "20226",
        "20344",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5781",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا عبيد الله بن معاذ، حدثنا أبي ح، وحدثني يحيى بن حبيب، حدثنا خالد، - يعني ابن الحارث - قالا حدثنا شعبة، ح وحدثنا محمد بن المثنى، وابن، بشار - واللفظ لهما - قالا حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت قتادة، يحدث عن أنس، أنعليه وسلم قالوا للنبي صلى الله عليه وسلم إن أهل الكتاب يسلمون علينا فكيف نرد عليهم قال ‏\"‏ قولوا وعليكم ‏\"‏ ‏.‏",
      "text_en": " Anas reported that the Companions of Allah's Apostle (may peace be upon him) said to him:                      The People. of the Book offer us salutations (by saying as-Salamu- 'Alaikum). How should we reciprocate them? Thereupon he said: Say: Wa 'Alaikum (and upon you too).",
      "chain": [
        "30150",
        "20286",
        "20226",
        "20020",
        "30170",
        "20173",
        "20020",
        "11019"
      ]
    },
    {
      "hadith_no": "5834",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا يحيى بن حبيب الحارثي، حدثنا خالد بن الحارث، حدثنا شعبة، عن هشام، بن زيد عن أنس، أن امرأة، يهودية أتت رسول الله صلى الله عليه وسلم بشاة مسمومة فأكل منها فجيء بها إلى رسول الله صلى الله عليه وسلم فسألها عن ذلك فقالت أردت لأقتلك ‏.‏ قال ‏\"‏ ما كان الله ليسلطك على ذاك ‏\"‏ ‏.‏ قال أو قال ‏\"‏ على ‏\"‏ ‏.‏ قال قالوا ألا نقتلها قال ‏\"‏ لا ‏\"‏ ‏.‏ قال فما زلت أعرفها في لهوات رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Anas reported that a Jewess came to Allah's Messenger (may peace be upon him) with poisoned mutton and he took of that what had been brought to him (Allah's Messenger). (When the effect of this poison were felt by him) he called for her and asked her about that, whereupon she said:                      I had determined to kill you. Thereupon he said: Allah will never give you the power to do it. He (the narrator) said that they (the Companion's of the Holy Prophet) said: Should we not kill her? Thereupon he said: No. He (Anas) said: I felt (the affects of this poison) on the uvula of Aitah's Messenger.",
      "chain": [
        "20226",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "hadith_no": "5886",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا خالد بن الحارث، وعبدة بن سليمان، جميعا عن هشام، بهذا الإسناد مثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Hisham with the same chain of transmitters.",
      "chain": [
        "30123",
        "20226",
        "20337"
      ]
    },
    {
      "hadith_no": "5993",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا أبو كريب، حدثنا أبو معاوية، ح وحدثنا محمد بن المثنى، حدثنا خالد، بن الحارث حدثنا هشام، بهذا الإسناد وفي حديثهما ‏\"‏ ربطتها ‏\"‏ ‏.‏ وفي حديث أبي معاوية ‏\"‏ حشرات الأرض ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Hisham with the same chain of transmitters, but with a slight variation of wording.",
      "chain": [
        "30216",
        "20354",
        "30170",
        "20226"
      ]
    },
    {
      "hadith_no": "6140",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني يحيى بن حبيب الحارثي، ومحمد بن عبد الله الرزي، قالا حدثنا خالد، بن الحارث عن سعيد، عن قتادة، قال قال أنس قال نبي الله صلى الله عليه وسلم ‏\"‏ ترى فيه أباريق الذهب والفضة كعدد نجوم السماء ‏\"‏ ‏.‏  وحدثنيه زهير بن حرب، حدثنا الحسن بن موسى، حدثنا شيبان، عن قتادة، حدثنا  أنس بن مالك، أن نبي الله صلى الله عليه وسلم قال مثله وزاد ‏\"‏ أو أكثر من عدد نجوم السماء ‏\"‏ ‏.‏",
      "text_en": " Anas reported Allah's Apostle (may peace be upon him) as saying:                      You would be shown in it jugs of gold and silver (as numerous) as the number of stars in the sky. This hadith has been transmitted on the authority of Anas b. Malik with this addition:\" More numerous than stars in the sky.\"",
      "chain": [
        "20226",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6148",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثناه محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، ح وحدثنيه  يحيى بن حبيب، حدثنا خالد، - يعني ابن الحارث - قالا حدثنا شعبة، بهذا الإسناد وفي حديث ابن جعفر قال فرسا لنا ‏.‏ ولم يقل لأبي طلحة ‏.‏ وفي حديث خالد عن قتادة سمعت أنسا ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Anas with a slight variation of wording.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20226",
        "11019"
      ]
    },
    {
      "hadith_no": "6160",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا عاصم بن النضر التيمي، حدثنا خالد، - يعني ابن الحارث - حدثنا حميد، عن موسى بن أنس، عن أبيه، قال ما سئل رسول الله صلى الله عليه وسلم على الإسلام شيئا إلا أعطاه - قال - فجاءه رجل فأعطاه غنما بين جبلين فرجع إلى قومه فقال يا قوم أسلموا فإن محمدا يعطي عطاء لا يخشى الفاقة ‏.‏",
      "text_en": " Musa b. Anas reported on the authority of his father:                      It never happened that Allah's Messenger (may peace be upon him) was asked anything for the sake of Islam and he did not give that. There came to him a person and he gave him a large flock (of sheep and goats) and he went back to his people and said: My people, embrace Islam, for Muhammad gives so much charity as if he has no fear of want.",
      "chain": [
        "20226",
        "11279",
        "14383",
        "19"
      ]
    },
    {
      "hadith_no": "6273",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا يحيى بن حبيب الحارثي، حدثنا خالد يعني ابن الحارث، ح وحدثنا محمد، بن بشار حدثنا محمد بن أبي عدي، كلاهما عن هشام، ح وحدثنا عاصم بن النضر التيمي، حدثنا معتمر، قال سمعت أبي قالا، جميعا حدثنا قتادة، عن أنس، بهذه القصة ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Qatada.",
      "chain": [
        "20226",
        "30160",
        "20295",
        "20288",
        "11289",
        "11019"
      ]
    },
    {
      "hadith_no": "6498",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنيه يحيى بن حبيب، حدثنا خالد، - يعني ابن الحارث - حدثنا شعبة، عن  قتادة، قال سمعت أنسا، يقول قال رسول الله صلى الله عليه وسلم لأبى بمثله ‏.‏",
      "text_en": "",
      "chain": [
        "20226",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6575",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنيه يحيى بن حبيب، حدثنا خالد بن الحارث، ح وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا ابن إدريس، كلاهما عن شعبة، بهذا الإسناد ‏.‏",
      "text_en": "",
      "chain": [
        "20226"
      ]
    },
    {
      "hadith_no": "6998",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن عبد الله الرزي، حدثنا خالد بن الحارث الهجيمي، حدثنا سعيد، عن قتادة، عن زرارة، عن سعد بن هشام، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ من أحب لقاء الله أحب الله لقاءه ومن كره لقاء الله كره الله لقاءه ‏\"‏ ‏.‏ فقلت يا نبي الله أكراهية الموت فكلنا نكره الموت فقال ‏\"‏ ليس كذلك ولكن المؤمن إذا بشر برحمة الله ورضوانه وجنته أحب لقاء الله فأحب الله لقاءه وإن الكافر إذا بشر بعذاب الله وسخطه كره لقاء الله وكره الله لقاءه ‏\"‏ ‏.‏",
      "text_en": " A'isha reported that Allah's Messenger (may peace be upon him) said:                      He who loves to meet Allah, Allah loves to meet him, and he who dislikes to meet Allah, Allah abhors to meet him. I ('A'isha) said: Allah's Apostle, so far as the feeling of aversion against death is concerned, we all have this feeling. Thereupon he (the Holy Prophet) said: It is not that (which you construe), but (this) that when a believer (at the time of death) is given the glad tidings of the mercy of Allah, His Pleasure, and of Paradise, he loves to meet Allah, and Allah also loves to meet him, and when an unbeliever is given the news of the torment at the Hand of Allah, and Hardship to be imposed by Him, he dislikes to meet Allah and Allah also abhors to meet him.",
      "chain": [
        "20226",
        "11168",
        "11019",
        "11166",
        "53"
      ]
    },
    {
      "hadith_no": "7012",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثناه عاصم بن النضر التيمي، حدثنا خالد بن الحارث، حدثنا حميد، بهذا الإسناد إلى قوله ‏\"‏ وقنا عذاب النار ‏\"‏ ‏.‏ ولم يذكر الزيادة ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Humaid with the same chain of transmitters, but with a slight variation of wording.",
      "chain": [
        "20226"
      ]
    },
    {
      "hadith_no": "7216",
      "source": " Sahih Muslim ",
      "chapter": "Pertaining To The Charateristics Of The Hypocrites And Command Concerning Them - كتاب صفات المنافقين وأحكامهم",
      "chapter_no": "52",
      "text_ar": "وحدثناه يحيى بن حبيب الحارثي، حدثنا خالد بن الحارث، حدثنا قرة، حدثنا  أبو الزبير، عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من يصعد ثنية المرار أو المرار ‏\"‏ ‏.‏ بمثل حديث معاذ غير أنه قال وإذا هو أعرابي جاء ينشد ضالة له ‏.‏",
      "text_en": " Jabir b. Abdullah reported Allah's Messenger (may peace be upon him) as saying:                      He who would climb this hill of Murar. The rest of the hadith is the same but with this variation that it was a desert Arab who was finding out his lost thing.",
      "chain": [
        "20226",
        "11301",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "7236",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا يحيى بن حبيب الحارثي، حدثنا خالد بن الحارث، حدثنا قرة، حدثنا محمد، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ لو تابعني عشرة من اليهود لم يبق على ظهرها يهودي إلا أسلم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      If ten scholars of the Jews would follow me, no Jew would be left upon the surface of the earth who would not embrace Islam.",
      "chain": [
        "20226",
        "11301",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "7458",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو كامل، فضيل بن حسين وأبو معن الرقاشي - واللفظ لأبي معن - قالا حدثنا خالد بن الحارث، حدثنا عبد الحميد بن جعفر، أخبرني أبي، عن سليمان بن، يسار عن عبد الله بن الحارث بن نوفل، قال كنت واقفا مع أبى بن كعب فقال لا يزال الناس مختلفة أعناقهم في طلب الدنيا ‏.‏ قلت أجل ‏.‏ قال إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ يوشك الفرات أن يحسر عن جبل من ذهب فإذا سمع به الناس ساروا إليه فيقول من عنده لئن تركنا الناس يأخذون منه ليذهبن به كله قال فيقتتلون عليه فيقتل من كل مائة تسعة وتسعون ‏\"‏ ‏.‏ قال أبو كامل في حديثه قال وقفت أنا وأبى بن كعب في ظل أجم حسان ‏.‏",
      "text_en": " 'Abdullah b. Harith b. Naufal reported:                      I was standing along with Ubayy b. Ka, b and he said: The opinions of the people differ in regard to the achievement of worldly ends. I said: Yes, of course. Thereupon he said: I heard Allah's Messenger (may peace be upon him) as saying: The Euphrates would soon uncover a mountain of gold and when the people would bear of it they would flock towards it but the people who would possess that (treasure) (would say): If we allow these persons to take out of it they would take away the whole of it. So they would fight and ninety-nine out of one hundred would be killed. Abu Kamil in his narration said: I and Abu Ka'b stood under the shade of the battlement of Hassan.",
      "chain": [
        "20226",
        "11875",
        "11833",
        "11005",
        "912"
      ]
    },
    {
      "hadith_no": "7483",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو كامل الجحدري، وأبو معن زيد بن يزيد الرقاشي - واللفظ لأبي معن - قالا حدثنا خالد بن الحارث، حدثنا عبد الحميد بن جعفر، عن الأسود بن العلاء، عن  أبي سلمة، عن عائشة، قالت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يذهب الليل والنهار حتى تعبد اللات والعزى ‏\"‏ ‏.‏ فقلت يا رسول الله إن كنت لأظن حين أنزل الله ‏{‏ هو الذي أرسل رسوله بالهدى ودين الحق ليظهره على الدين كله ولو كره المشركون‏}‏  أن ذلك تاما قال ‏\"‏ إنه سيكون من ذلك ما شاء الله ثم يبعث الله ريحا طيبة فتوفى كل من في قلبه مثقال حبة خردل من إيمان فيبقى من لا خير فيه فيرجعون إلى دين آبائهم ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported:                      I heard Allah's Messenger (may peace be upon him) as saying: The (system) of night and day would not end until the people have taken to the worship of Lat and 'Uzza. I said: Allah's Messenger, I think when Allah has revealed this verse:\" He it is Who has sent His Messenger with right guidance, and true religion, so that He may cause it to prevail upon all religions, though the polytheists are averse (to it)\" (ix. 33), it implies that (this promise) is going to be fulfilled. Thereupon he (Allah's Apostle) said: It would happen as Allah would like. Then Allah would send the sweet fragrant air by which everyone who has even a mustard grain of faith in Him would die and those only would survive who would have no goodness in them. And they would revert to the religion of their forefathers.",
      "chain": [
        "30559",
        "20226",
        "11875",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "7505",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثني محمد بن معاذ بن عباد العنبري، وهريم بن عبد الأعلى، قالا حدثنا  خالد بن الحارث، ح وحدثنا إسحاق بن إبراهيم، وإسحاق بن منصور، ومحمود بن غيلان، ومحمد بن قدامة قالوا أخبرنا النضر بن شميل، كلاهما عن شعبة، عن أبي مسلمة، بهذا الإسناد ‏.‏ نحوه غير أن في حديث النضر أخبرني من هو خير مني أبو قتادة ‏.‏ وفي حديث خالد بن الحارث قال أراه يعني أبا قتادة ‏.‏ وفي حديث خالد ويقول ‏\"‏ ويس ‏\"‏ ‏.‏ أو يقول ‏\"‏ يا ويس ابن سمية ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the same authority but with this variation that the hadith trarismitted on the authority of Nabra (the words are):                      One Who is better than I informed me, and he was Abu Qatatda, and in the hadith transmitted on the authority of Khalid instead of the word 'bu_us' there is 'dys' or 'yadis', i. e.:\" how sad it is\".",
      "chain": [
        "20226",
        "30123",
        "30313",
        "30277",
        "20291",
        "20020"
      ]
    },
    {
      "hadith_no": "7574",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا يحيى بن حبيب الحارثي، حدثنا خالد بن الحارث الهجيمي أبو عثمان، حدثنا قرة، حدثنا سيار أبو الحكم، حدثنا الشعبي، قال دخلنا على فاطمة بنت قيس فأتحفتنا برطب يقال له رطب ابن طاب وأسقتنا سويق سلت فسألتها عن المطلقة، ثلاثا أين تعتد قالت طلقني بعلي ثلاثا فأذن لي النبي صلى الله عليه وسلم أن أعتد في أهلي - قالت - فنودي في الناس إن الصلاة جامعة - قالت - فانطلقت فيمن انطلق من الناس - قالت - فكنت في الصف المقدم من النساء وهو يلي المؤخر من الرجال - قالت - فسمعت النبي صلى الله عليه وسلم وهو على المنبر يخطب فقال ‏\"‏ إن بني عم لتميم الداري ركبوا في البحر ‏\"‏ ‏.‏ وساق الحديث وزاد فيه قالت فكأنما أنظر إلى النبي صلى الله عليه وسلم وأهوى بمخصرته إلى الأرض وقال ‏\"‏ هذه طيبة ‏\"‏ ‏.‏ يعني المدينة ‏.‏",
      "text_en": " Al-Sha'bi reported:                      We visited Fatima b. Qais and she served us fresh dates which are called rutab and she also served us barley. I asked her about that woman in whose case three divorces had been pronounced as to how much time she should count as the waiting period. She said: My husband pronounced three divorces in my case and Allah's Messenger (may peace be upon him) permitted me to spend any waiting period in my family. (It was during this period) that announcement was made for the people to observe prayer in the bigger Mosque. I went there along with people and I was in the front row meant for women and it was adjacent to the last row of men and I heard Allah's Messenger (may peace be upon him) deliver sermon sitting on the pulpit. He said: The cousin of Tamim (Dari) sailed in the ocean. The rest of the hadith is the same but with this addition:\" (I see) as if I am looking to Allah's Apostle (may peace be upon him) pointing his rod towards the land (and saying): It is Taiba, i. e. Medina.\"",
      "chain": [
        "20226",
        "11301",
        "11429",
        "11052"
      ]
    },
    {
      "hadith_no": "7594",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا يحيى بن حبيب الحارثي، حدثنا خالد، - يعني ابن الحارث - حدثنا  شعبة، قال سمعت قتادة، وأبا التياح، يحدثان أنهما سمعا أنسا، يحدث أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بعثت أنا والساعة هكذا ‏\"‏ ‏.‏ وقرن شعبة بين إصبعيه المسبحة والوسطى يحكيه ‏.‏",
      "text_en": " Shu'ba reported:                      I heard Qatada and Abu Tayyab narrating that both of them heard Anas as narrating that Allah's Messenger (may peace be upon him) said: I and the Last Hour have been sent like this, and Shu'ba drew his forefinger and middle finger near each other while narrating it.",
      "chain": [
        "20226",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "480",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن حبيب بن عربي، حدثنا خالد، - يعني ابن الحارث - عن محمد بن عجلان، عن عياض بن عبد الله، عن أبي سعيد الخدري، أن النبي صلى الله عليه وسلم كان يحب العراجين ولا يزال في يده منها فدخل المسجد فرأى نخامة في قبلة المسجد فحكها ثم أقبل على الناس مغضبا فقال ‏\"‏ أيسر أحدكم أن يبصق في وجهه إن أحدكم إذا استقبل القبلة فإنما يستقبل ربه جل وعز والملك عن يمينه فلا يتفل عن يمينه ولا في قبلته وليبصق عن يساره أو تحت قدمه فإن عجل به أمر فليقل هكذا ‏\"‏ ‏.‏ ووصف لنا ابن عجلان ذلك أن يتفل في ثوبه ثم يرد بعضه على بعض ‏.‏",
      "text_en": " Abu Sa’id al-khudri said:                      The Prophet(ﷺ) liked the twigs of the date-palm, and he often had one of them in his hand. He entered the mosque and saw phlegm in the wall towards qiblah and he scraped it. He then turned towards people in anger and said: Is any one of you is pleased to spit in his face? When any of you faces qiblah, he indeed faces his Lord, the Majestic the Glorious: the angels are at right side. Therefore, he should not spit on his right side or before him towards qiblah. He should spit towards his left side or beneath his foot. If he is in a hurry, he should do so-and-so. Describing it Ibn ‘Ajlan said: He should spit in his cloth and fold a part of it over the other.",
      "chain": [
        "30459",
        "20226",
        "10616",
        "11260",
        "38"
      ]
    },
    {
      "hadith_no": "665",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن معاذ، حدثنا خالد بن الحارث، حدثنا حاتم، - يعني ابن أبي صغيرة - عن سماك، قال سمعت النعمان بن بشير، قال كان رسول الله صلى الله عليه وسلم يسوي صفوفنا إذا قمنا للصلاة فإذا استوينا كبر ‏.‏",
      "text_en": " Narrated An-Nu'man ibn Bashir:                     The Messenger of Allah (ﷺ) used to straighten our rows when we stood up to pray, and when we were straight, he said: Allah is most great (takbir).",
      "chain": [
        "30150",
        "20226",
        "11274",
        "10770",
        "274"
      ]
    },
    {
      "hadith_no": "772",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو كامل، حدثنا خالد، - يعني ابن الحارث - حدثنا عمران بن مسلم، أن قيس بن سعد، حدثه قال حدثنا طاوس، عن ابن عباس، أن رسول الله صلى الله عليه وسلم كان في التهجد يقول بعد ما يقول ‏\"‏ الله أكبر ‏\"‏ ‏.‏ ثم ذكر معناه ‏.‏",
      "text_en": " Ibn ‘Abbas said:                      The Messenger of Allah (ﷺ) used to say in his tahajjud prayer(i.e. supererogatory prayer offered in or after the midnight) after he said the takbir; he then narrated the tradition to the same effect.",
      "chain": [
        "30559",
        "20226",
        "11562",
        "172",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "778",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن خلاد، حدثنا خالد بن الحارث، عن أشعث، عن الحسن، عن سمرة بن جندب، عن النبي صلى الله عليه وسلم أنه كان يسكت سكتتين إذا استفتح وإذا فرغ من القراءة كلها ‏.‏ فذكر معنى حديث يونس ‏.‏",
      "text_en": " Samurah b. Jundub said:                      The Prophet(ﷺ) had two periods of silence; when he began his prayer and when he finished the recitation (of the Qur’an). He then narrated the tradition like the version of Yunus.",
      "chain": [
        "30357",
        "20226",
        "11324",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "793",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن حبيب، حدثنا خالد بن الحارث، حدثنا محمد بن عجلان، عن عبيد الله بن مقسم، عن جابر، ذكر قصة معاذ قال وقال - يعني النبي صلى الله عليه وسلم للفتى - ‏\"‏ كيف تصنع يا ابن أخي إذا صليت ‏\"‏ ‏.‏ قال أقرأ بفاتحة الكتاب وأسأل الله الجنة وأعوذ به من النار وإني لا أدري ما دندنتك ولا دندنة معاذ ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إني ومعاذ حول هاتين ‏\"‏ ‏.‏ أو نحو هذا ‏.‏",
      "text_en": " Jabir narrated the story of mu’adh and said:                      The prophet (ﷺ) said to a youth: My nephew, what do you do in prayer? He replied: I recited fatihat al-katab and I ask Allah for paradise and seek his refuge from hell-fire I do not understand well your sound and the sound of mu’adh. The prophet (ﷺ) said: I and Mu’adh go around both (paradise and Hell-fire), or he said something similar.",
      "chain": [
        "30459",
        "20226",
        "10616",
        "11521",
        "34"
      ]
    },
    {
      "hadith_no": "1563",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو كامل، وحميد بن مسعدة، - المعنى - أن خالد بن الحارث، حدثهم حدثنا حسين، عن عمرو بن شعيب، عن أبيه، عن جده، أن امرأة، أتت رسول الله صلى الله عليه وسلم ومعها ابنة لها وفي يد ابنتها مسكتان غليظتان من ذهب فقال لها ‏\"‏ أتعطين زكاة هذا ‏\"‏ ‏.‏ قالت لا ‏.‏ قال ‏\"‏ أيسرك أن يسورك الله بهما يوم القيامة سوارين من نار ‏\"‏ ‏.‏ قال فخلعتهما فألقتهما إلى النبي صلى الله عليه وسلم وقالت هما لله عز وجل ولرسوله ‏.‏",
      "text_en": " 'Amr bin Shu'aib on his father's authority said that his grandfather reported:                     A woman came to the Messenger of Allah (ﷺ) and she was accompanied by her daughter who wore two heavy gold bangles in her hands. He said to her: Do you pay zakat on them? She said: No. He then said: Are you pleased that Allah may put two bangles of fire on your hands? Thereupon she took them off and placed them before the Prophet (ﷺ) saying: They are for Allah and His Apostle.",
      "chain": [
        "30559",
        "30430",
        "20226",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1977",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الرحمن بن المبارك، حدثنا خالد بن الحارث، حدثنا شعبة، عن قتادة، قال سمعت أبا مجلز، يقول سألت ابن عباس عن شىء، من أمر الجمار فقال ما أدري أرماها رسول الله صلى الله عليه وسلم بست أو بسبع ‏.‏",
      "text_en": " AbuMijlaz said:                      I asked Ibn Abbas about a thing concerning the throwing of stones at the jamrahs. He said: I do not know whether the Messenger of Allah (ﷺ) threw six or seven pebbles.",
      "chain": [
        "30147",
        "20226",
        "20020",
        "11019",
        "11313",
        "17"
      ]
    },
    {
      "hadith_no": "2872",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wills (Kitab Al-Wasaya) - كتاب الوصايا",
      "chapter_no": "18",
      "text_ar": "حدثنا حميد بن مسعدة، أن خالد بن الحارث، حدثهم حدثنا حسين، - يعني المعلم - عن عمرو بن شعيب، عن أبيه، عن جده، أن رجلا، أتى النبي صلى الله عليه وسلم فقال إني فقير ليس لي شىء ولي يتيم ‏.‏ قال فقال ‏\"‏ كل من مال يتيمك غير مسرف ولا مبادر ولا متأثل ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Amr b. Suh'aib:                     On his father's authority, said that his grandfather told that a man came to the Prophet (ﷺ) and said: I am poor, I have nothing (with me), and I have an orphan. He said: Use the property of your orphan without spending it lavishly, hurrying and taking it as your own property.",
      "chain": [
        "30430",
        "20226",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3183",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا خالد بن الحارث، ح وحدثنا إبراهيم بن موسى، حدثنا عيسى، - يعني ابن يونس - عن عيينة، بهذا الحديث قالا في جنازة عبد الرحمن بن سمرة وقال فحمل عليهم بغلته وأهوى بالسوط ‏.‏",
      "text_en": " Uyaynah also reported the aforementioned tradition (No. 3176) through a different chain of transmitters. This version goes:                      We attended the funeral of AbdurRahman ibn Samurah and he said: He (AbuBakrah) made his mule run quickly and pointed with the flog.",
      "chain": [
        "30430",
        "20226",
        "30309",
        "20347"
      ]
    },
    {
      "hadith_no": "3395",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، حدثنا خالد بن الحارث، حدثنا سعيد، عن يعلى بن حكيم، عن سليمان بن يسار، أن رافع بن خديج، قال كنا نخابر على عهد رسول الله صلى الله عليه وسلم فذكر أن بعض عمومته أتاه فقال نهى رسول الله صلى الله عليه وسلم عن أمر كان لنا نافعا وطواعية الله ورسوله أنفع لنا وأنفع ‏.‏ قال قلنا وما ذاك قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كانت له أرض فليزرعها أو فليزرعها أخاه ولا يكاريها بثلث ولا بربع ولا بطعام مسمى ‏\"‏ ‏.‏",
      "text_en": " Narrated Rafi' b. Khadij:                     We used to employ people to till land for a share of it produce. He then maintained that, one of his uncles came to him and said: The Messenger of Allah (ﷺ) forbade us from a work which beneficial to us. But obedience to Allah and His Apostle (ﷺ) is more beneficial to us. We asked : What is that ? He said: The Messenger of Allah (ﷺ) said: If anyone has land, he should cultivate it, or lend it to his brother for cultivation. He should not rent it for a third or a quarter (of the produce) or for specified among of produce.",
      "chain": [
        "30024",
        "20226",
        "11168",
        "11567",
        "11005",
        "1986"
      ]
    },
    {
      "hadith_no": "3547",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو كامل، حدثنا خالد، - يعني ابن الحارث - حدثنا حسين، عن عمرو بن شعيب، أن أباه، أخبره عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يجوز لامرأة عطية إلا بإذن زوجها ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: It is not permissible for a woman to present a gift (from her husband's property) except with the permission of her husband.",
      "chain": [
        "30559",
        "20226",
        "11278",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "3618",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا خالد بن الحارث، عن سعيد بن أبي عروبة، بإسناد ابن منهال مثله قال في دابة وليس لهما بينة فأمرهما رسول الله صلى الله عليه وسلم أن يستهما على اليمين ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by sa’id b. ‘Urubah through the chain as narrated by Ibn Minhal. This version has :                      About an animal and they had no proof. So the Messenger of Allah (ﷺ) ordered to cast lots about the oath.",
      "chain": [
        "30201",
        "20226"
      ]
    },
    {
      "hadith_no": "4508",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا يحيى بن حبيب بن عربي، حدثنا خالد بن الحارث، حدثنا شعبة، عن هشام بن زيد، عن أنس بن مالك، أن امرأة، يهودية أتت رسول الله صلى الله عليه وسلم بشاة مسمومة فأكل منها فجيء بها إلى رسول الله صلى الله عليه وسلم فسألها عن ذلك فقالت أردت لأقتلك ‏.‏ فقال ‏\"‏ ما كان الله ليسلطك على ذلك ‏\"‏ ‏.‏ أو قال ‏\"‏ على ‏\"‏ ‏.‏ قال فقالوا ألا نقتلها قال ‏\"‏ لا ‏\"‏ ‏.‏ فما زلت أعرفها في لهوات رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A Jewess brought a poisoned sheep to the Messenger of Allah (ﷺ), and he ate of it. She was then brought to the Messenger of Allah (ﷺ) who asked her about it. She said: I intended to kill you. He said: Allah will not give you control over it ; or he said : over me. They (the Companions) said: Should we not kill her ? He said: No. He (Anas) said: I always found it in the uvula of the Messenger of Allah (ﷺ)",
      "chain": [
        "30459",
        "20226",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "hadith_no": "4566",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا أبو كامل، فضيل بن حسين أن خالد بن الحارث، حدثهم قال أخبرنا حسين، - يعني المعلم - عن عمرو بن شعيب، أن أباه، أخبره عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ في المواضح خمس ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: Blood-wit for every wound which lays bare a bone is five camels.",
      "chain": [
        "20226",
        "11278",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "5108",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا نصر بن علي، وعبيد الله بن عمر الجشمي، قالا حدثنا خالد بن الحارث، حدثنا سعيد، - قال نصر ابن أبي عروبة - عن قتادة، عن أبي نهيك، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من استعاذ بالله فأعيذوه ومن سألكم بوجه الله فأعطوه ‏\"‏ ‏.‏ قال عبيد الله ‏\"‏ من سألكم بالله ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: If anyone asks (you) for refuge for the sake of Allah, give him refuge; and if anyone asks you (for something) for the pleasure of Allah, give him. Ubaydullah said: If anyone asks you for the sake of Allah.",
      "chain": [
        "30395",
        "20226",
        "11168",
        "11019",
        "17"
      ]
    },
    {
      "hadith_no": "5203",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن المثنى، حدثنا خالد، - يعني ابن الحارث - حدثنا حميد، قال قال أنس انتهى إلينا رسول الله صلى الله عليه وسلم وأنا غلام في الغلمان فسلم علينا ثم أخذ بيدي فأرسلني برسالة وقعد في ظل جدار - أو قال إلى جدار - حتى رجعت إليه ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Messenger of Allah (ﷺ) came to us when I was a boy among the boys. He saluted us and took me by my hand. He then sent me with some message. He himself sat in the shadow of a wall, or he said: near a wall until I returned to him.",
      "chain": [
        "30170",
        "20226",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "506",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا حميد بن مسعدة البصري، حدثنا خالد بن الحارث، حدثنا عبيد الله بن عمر، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم كان يخطب يوم الجمعة ثم يجلس ثم يقوم فيخطب قال مثل ما تفعلون اليوم ‏.‏ قال وفي الباب عن ابن عباس وجابر بن عبد الله وجابر بن سمرة ‏.‏ قال أبو عيسى حديث ابن عمر حديث حسن صحيح ‏.‏ وهو الذي رآه أهل العلم أن يفصل بين الخطبتين بجلوس ‏.‏",
      "text_en": " Ibn Umar narrated:                     \"The Prophet would give a Khutbah on Friday, then sit, then stand and give (another) Khutbah.\" He said: \"Similar to what they do today.\"",
      "chain": [
        "30430",
        "20226",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "600",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن عبد الأعلى، حدثنا خالد بن الحارث، عن أشعث، وهو ابن عبد الملك عن محمد بن سيرين، عن عبد الله بن شقيق، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم لا يصلي في لحف نسائه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روي عن النبي صلى الله عليه وسلم رخصة في ذلك ‏.‏",
      "text_en": " Aishah narrated:                     \"The Messenger of Allah would not pray in women's covers.\"",
      "chain": [
        "30449",
        "20226",
        "11324",
        "11035",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "778",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا نصر بن علي، حدثنا بشر بن المفضل، وخالد بن الحارث، عن سعيد بن أبي عروبة، عن قتادة، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تواصلوا ‏\"‏ ‏.‏ قالوا فإنك تواصل يا رسول الله ‏.‏ قال ‏\"‏ إني لست كأحدكم إن ربي يطعمني ويسقيني ‏\"‏ ‏.‏ قال وفي الباب عن علي وأبي هريرة وعائشة وابن عمر وجابر وأبي سعيد وبشير ابن الخصاصية ‏.‏ قال أبو عيسى حديث أنس حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم كرهوا الوصال في الصيام ‏.‏ وروي عن عبد الله بن الزبير أنه كان يواصل الأيام ولا يفطر ‏.‏",
      "text_en": " Anas narrated that :                     the Messenger of Allah said: \"Do not perform Wisal\" They said: \"But you perform Wisal O Messenger of Allah.\" He said: \"I am not like you are, indeed my Lord feeds me and gives me to drink.\"",
      "chain": [
        "30395",
        "20212",
        "20226",
        "11073",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1067",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا خالد بن الحارث، حدثنا سعيد بن أبي عروبة، ح قال وحدثنا محمد بن بشار، حدثنا محمد بن بكر، عن سعيد بن أبي عروبة، عن قتادة، عن زرارة بن أوفى، عن سعد بن هشام، عن عائشة، أنها ذكرت أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أحب لقاء الله أحب الله لقاءه ومن كره لقاء الله كره الله لقاءه ‏\"‏ ‏.‏ قالت فقلت يا رسول الله كلنا نكره الموت ‏.‏ قال ‏\"‏ ليس ذلك ولكن المؤمن إذا بشر برحمة الله ورضوانه وجنته أحب لقاء الله وأحب الله لقاءه وإن الكافر إذا بشر بعذاب الله وسخطه كره لقاء الله وكره الله لقاءه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Sa'd bin Hisham narrated that:                     Aishah mentioned that the Messenger of Allah said: \"Whoever loves to meet Allah, then Allah loves to meet him. And whoever dislikes meeting Allah, then Allah dislikes meeting him.\" She said: \"O Messenger of Allah! All of us dislike death.\" He said: \"It is not like that. But when the believer is given the good news of Allah's mercy, His pleasure, and His Paradise, then he loves to meet Allah and Allah loves to meet him. Whereas when the disbeliever is given the news of Allah's punishment and His wrath, he dislikes meeting Allah, and Allah dislikes meeting him.\"",
      "chain": [
        "30430",
        "20226",
        "11073",
        "30160",
        "20277",
        "11073",
        "11019",
        "11284",
        "11166",
        "53"
      ]
    },
    {
      "hadith_no": "1207",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني، حدثنا خالد بن الحارث، عن شعبة، حدثنا عبيد الله بن أبي بكر بن أنس، عن أنس، عن النبي صلى الله عليه وسلم في الكبائر قال ‏\"‏ الشرك بالله وعقوق الوالدين وقتل النفس وقول الزور ‏\"‏ ‏.‏ قال وفي الباب عن أبي بكرة وأيمن بن خريم وابن عمر ‏.‏ قال أبو عيسى حديث أنس حديث حسن صحيح غريب ‏.‏",
      "text_en": " Anas narrated that the Prophet (ﷺ) said about the major sins:                      \"Associating partners with Allah, disobeying parents, killing oneself, and false speech.\"He said: There are narrations on this topic from Abu Bakrah, Ayman bin Khuraim, and Ibn 'UmarAbu 'Eisa said: The Hadith of Anas is a Hasan Sahih Gharib Hadith.",
      "chain": [
        "20226",
        "20020",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "1537",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Vows and Oaths - كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "20",
      "text_ar": "حدثنا أبو موسى، محمد بن المثنى حدثنا خالد بن الحارث، حدثنا حميد، عن ثابت، عن أنس، قال مر النبي صلى الله عليه وسلم بشيخ كبير يتهادى بين ابنيه فقال ‏\"‏ ما بال هذا ‏\"‏ ‏.‏ قالوا يا رسول الله نذر أن يمشي ‏.‏ قال ‏\"‏ إن الله عز وجل لغني عن تعذيب هذا نفسه ‏\"‏ ‏.‏ قال فأمره أن يركب ‏.‏",
      "text_en": " Narrated Anas:                     \"The Prophet (ﷺ) passed by old man walking (while supported) between his two sons, so he said: 'What is the matter with this one?' They said: \"O Messenger of Allah! He vowed to walk.' He said: 'Verily Allah [the Mighty and Sublime] is in no need of this person punishing himself.'\" He said: \"So he ordered him to ride.\"",
      "chain": [
        "20226",
        "11279",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "1881",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Drinks - كتاب الأشربة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "26",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا خالد بن الحارث، عن سعيد، عن قتادة، عن أبي مسلم الجذمي، عن الجارود بن المعلى، أن النبي صلى الله عليه وسلم نهى عن الشرب قائما ‏.‏ قال وفي الباب عن أبي سعيد وأبي هريرة وأنس ‏.‏ قال أبو عيسى هذا حديث غريب حسن ‏.‏ وهكذا روى غير واحد هذا الحديث عن سعيد عن قتادة عن أبي مسلم عن الجارود عن النبي صلى الله عليه وسلم ‏.‏ وروي عن قتادة عن يزيد بن عبد الله بن الشخير عن أبي مسلم عن الجارود أن النبي صلى الله عليه وسلم قال ‏\"‏ ضالة المسلم حرق النار ‏\"‏ ‏.‏ والجارود هو ابن المعلى العبدي صاحب النبي صلى الله عليه وسلم ويقال الجارود بن العلاء أيضا والصحيح ابن المعلى ‏.‏",
      "text_en": " Narrated Al-Jarud bin Al-'Ala':                     \"The Prophet (ﷺ) prohibited drinking while standing.\"And there are narrations on this topic from Abu Sa'eed, Abu Hurairah, and Anas. And this Hadith is Hasan Gharib. This Hadith was reported from other narrators, from Sa'eed, from Qatadah, from Abu Muslim, from Al-Jarud, that the Prophet (ﷺ) said: \"The Muslim's wandering (animal) stirs the Fire.\" Al-Jarud bin Al-Mu'alla is called Ibn Al-'Al' but what is correct is Al-Mu'alla.",
      "chain": [
        "30430",
        "20226",
        "11168",
        "11019",
        "19375"
      ]
    },
    {
      "hadith_no": "2020",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو حفص، عمرو بن علي حدثنا خالد بن الحارث، حدثنا شعبة، عن يعلى بن عطاء، عن أبيه، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم قال ‏\"‏ رضا الرب في رضا الوالد وسخط الرب في سخط الوالد ‏\"‏ ‏.‏",
      "text_en": " Abdullah bin Amr narrated that:                     the Prophet said: \"The Lord's pleasure is in the parent's pleasure, and the Lord's anger is in the parent's anger.\"(Hasan).",
      "chain": [
        "30286",
        "20226",
        "20020",
        "10986",
        "29"
      ]
    },
    {
      "hadith_no": "2227",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا حسين بن محمد البصري، حدثنا خالد بن الحارث، حدثنا شعبة، عن حبيب بن الزبير، قال سمعت عبد الله بن أبي الهذيل، يقول كان ناس من ربيعة عند عمرو بن العاصي فقال رجل من بكر بن وائل لتنتهين قريش أو ليجعلن الله هذا الأمر في جمهور من العرب غيرهم ‏.‏ فقال عمرو بن العاصي كذبت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ قريش ولاة الناس في الخير والشر إلى يوم القيامة ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن ابن مسعود وابن عمر وجابر ‏.‏ وهذا حديث حسن غريب صحيح ‏.‏",
      "text_en": " 'Abdullah bin Abi Al-Hudhail said:                     \" There were some people from(the tribe of) Rabiah with 'Amr bin Al-'As, so a man from(the tribe of) Bakr bin Wa'il said: \"Either the Quraish will stop, or Allah will place this matter among the masses of the Arabs other than them.' So 'Amr bin Al-'As said: 'You have lied, I heard the Messenger of Allah(s.a.w) saying: \"The Quraish are the leaders of the people, in the good and the bad, until the Day of Judgement.\"",
      "chain": [
        "20384",
        "20226",
        "20020",
        "14067",
        "10787"
      ]
    },
    {
      "hadith_no": "2262",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا خالد بن الحارث، حدثنا حميد الطويل، عن الحسن، عن أبي بكرة، قال عصمني الله بشيء سمعته من، رسول الله صلى الله عليه وسلم لما هلك كسرى قال ‏\"‏ من استخلفوا ‏\"‏ ‏.‏ قالوا ابنته ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لن يفلح قوم ولوا أمرهم امرأة ‏\"‏ ‏.‏ قال فلما قدمت عائشة يعني البصرة ذكرت قول رسول الله صلى الله عليه وسلم فعصمني الله به ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏",
      "text_en": " Abu Bakrah said:                     \"Allah restrained me with something that I heard from the Messenger of Allah(s.a.w). When Kisra was destroyed, he said: 'Who did they have to succeed him?' They said: 'His daughter.' So the Prophet(s.a.w) said: 'A people will never succeed who give their leadership to a woman.'\" He said: \"So when 'Aishah arrived - meaning in Al-Basrah - I remembered the saying of Messenger of Allah (ﷺ), so Allah restrained me by it.\"Abu Eisa said: This Hadith is [Hasan] Sahih.",
      "chain": [
        "30170",
        "20226",
        "11279",
        "11016",
        "3229"
      ]
    },
    {
      "hadith_no": "2330",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو حفص، عمرو بن علي حدثنا خالد بن الحارث، حدثنا شعبة، عن علي بن زيد، عن عبد الرحمن بن أبي بكرة، عن أبيه، أن رجلا، قال يا رسول الله أى الناس خير قال ‏\"‏ من طال عمره وحسن عمله ‏\"‏ ‏.‏ قال فأى الناس شر قال ‏\"‏ من طال عمره وساء عمله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " 'Abdur-Rahman bin Abi-Bakrah narrated from his father that a man  said:                     \"O Messenger of Allah! Which of the people is the best?\" He said: \"He whose life is long and his deeds are good.\" He said: \"Then which of the people is the worst?\" He said: \"He whose life is long and his deeds are bad.\"",
      "chain": [
        "30286",
        "20226",
        "20020",
        "10664",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "3275",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا يحيى بن حبيب بن عربي البصري، حدثنا خالد بن الحارث، عن محمد بن عجلان، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم كان يدعو على أربعة نفر فأنزل الله ‏:‏ ‏(‏ليس لك من الأمر شيء أو يتوب عليهم أو يعذبهم فإنهم ظالمون ‏)‏ فهداهم الله للإسلام ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح يستغرب من هذا الوجه من حديث نافع عن ابن عمر ورواه يحيى بن أيوب عن ابن عجلان ‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Umar:                     \"The Messenger of Allah (ﷺ) was supplicating against four people, so Allah, Blessed and Most High, revealed: Not for you is the decision; whether He turns in mercy towards them or punishes them; verily they are the wrongdoers (3:128). So Allah guided them to Islam.\"",
      "chain": [
        "30459",
        "20226",
        "10616",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3291",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني، حدثنا خالد بن الحارث، عن شعبة، حدثنا عبيد الله بن أبي بكر بن أنس، عن أنس، عن النبي صلى الله عليه وسلم في الكبائر قال ‏\"‏ الشرك بالله وعقوق الوالدين وقتل النفس وقول الزور ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏ ورواه روح بن عبادة عن شعبة وقال عن عبد الله بن أبي بكر ولا يصح ‏.‏",
      "text_en": " Narrated 'Ubaidullah bin Abi Bakr [bin Anas]:                     from Anas bin Malik, that the Prophet (ﷺ) [said] about the major sins: \"Shirk with Allah, disobeying the parents, taking the life, and false statement.\"",
      "chain": [
        "20226",
        "20020",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "3393",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني، حدثنا خالد بن الحارث، أخبرنا شعبة، أخبرني عدي بن ثابت، وعطاء بن السائب، عن سعيد بن جبير، عن ابن عباس، ذكر أحدهما عن النبي صلى الله عليه وسلم أنه ذكر ‏\"‏ أن جبريل صلى الله عليه وسلم جعل يدس في في فرعون الطين خشية أن يقول لا إله إلا الله فيرحمه الله أو خشية أن يرحمه الله ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Shu'bah:                     \"'Adi bin Thabit and 'Ata bin As-Sa'ib informed me, from Sa'eed bin Jubair, from Ibn 'Abbas - and one of them mentioned that it was from the Prophet (ﷺ) - that he mentioned that Jibra'il began shoving clay in the mouth of Fir'awn out of fear that he would say La Ilaha Illallah and Allah would have mercy upon him - or fearing that Allah would have mercy upon him.\"",
      "chain": [
        "20226",
        "20020",
        "11372",
        "11068",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "135",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، عن شعبة، عن منصور، عن مجاهد، عن الحكم، عن أبيه، أن رسول الله صلى الله عليه وسلم كان إذا توضأ أخذ حفنة من ماء فقال بها هكذا - ووصف شعبة - نضح به فرجه فذكرته لإبراهيم فأعجبه قال الشيخ ابن السني قال أبو عبد الرحمن الحكم هو ابن سفيان الثقفي رضى الله عنه ‏.‏",
      "text_en": " It was narrated from Al-Hakam, from his father, that when the Messenger of Allah (ﷺ) performed Wudu', he would take a handful of water and do this with it. Shu'bah described it:                      \"He would sprinkle his private parts with it.\" [1]Shaikh Ibn As-Sunni said: \"Al-Hakam (one of the narrators) is Ibn Sufyan Ath-Thaqafi.[1] The purpose is to ward off devilish whispers lest the person think any emission has taken place, and thus think that his Wudu' has been invalidated.",
      "chain": [
        "34033",
        "20226",
        "20020",
        "11067",
        "11028",
        "11069"
      ]
    },
    {
      "hadith_no": "221",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا أبو الأشعث، قال حدثنا خالد بن الحارث، قال سمعت هشام بن عروة، عن أبيه، عن عائشة، أن بنت أبي حبيش، قالت يا رسول الله إني لا أطهر أفأترك الصلاة قال ‏\"‏ لا إنما هو عرق ‏\"‏ ‏.‏ قال خالد فيما قرأت عليه ‏\"‏ وليست بالحيضة فإذا أقبلت الحيضة فدعي الصلاة وإذا أدبرت فاغسلي عنك الدم وصلي ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that the daughter of Abu Hubaish said:                      \"O Messenger of Allah, I do not become pure, so should I stop praying?\" He said: \"No, that is a vein.\" Khalid said, in what I read from him, [1] \"And it is not menstruation, so when your period comes, stop praying, and when it goes, wash the blood from yourself and pray.\"[1] Meaning, before Hisham, from whom he narrates it.",
      "chain": [
        "10917",
        "20226",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "336",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Water - كتاب المياه",
      "chapter_no": "2",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، - يعني ابن الحارث - عن شعبة، عن أبي التياح، قال سمعت مطرفا، عن عبد الله بن مغفل، أن رسول الله صلى الله عليه وسلم أمر بقتل الكلاب ورخص في كلب الصيد والغنم وقال ‏\"‏ إذا ولغ الكلب في الإناء فاغسلوه سبع مرات وعفروه الثامنة بالتراب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Mughaffal that the Messenger of Allah (ﷺ) commanded that dogs be killed, but he made an exception for hunting dogs and sheepdogs and said:                      \"If a dog licks a vessel then wash it seven times and rub it the eighth time with dust.\"",
      "chain": [
        "30449",
        "20226",
        "20020",
        "11317",
        "11395",
        "3242"
      ]
    },
    {
      "hadith_no": "367",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا أبو الأشعث، قال حدثنا خالد بن الحارث، قال سمعت هشاما، يحدث عن أبيه، عن عائشة، أن بنت أبي حبيش، قالت يا رسول الله إني لا أطهر أفأترك الصلاة قال ‏\"‏ لا إنما هو عرق ‏\"‏ ‏.‏ قال خالد وفيما قرأت عليه ‏\"‏ وليست بالحيضة فإذا أقبلت الحيضة فدعي الصلاة وإذا أدبرت فاغسلي عنك الدم ثم صلي ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that the daughter of Abu Hubaish said:                      \"O Messenger of Allah, I do not become pure, so should I stop praying? He said: \"no, that is a vein.\" - (One of the narrators) Khalid said, in what I read from him - \"and it is not menstruation, so when your period comes, stop praying, and when it goes, wash the blood from yourself and pray.\"",
      "chain": [
        "10917",
        "20226",
        "20295",
        "53"
      ]
    },
    {
      "hadith_no": "371",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا معاذ بن هشام، ح وأنبأنا إسحاق بن إبراهيم، قال أنبأنا معاذ بن هشام، قال حدثني أبي ح، وأنبأنا إسماعيل بن مسعود، قال حدثنا خالد، - وهو ابن الحارث - قال حدثنا هشام، عن يحيى بن أبي كثير، قال حدثني أبو سلمة، أن زينب بنت أبي سلمة، حدثته أن أم سلمة حدثتها قالت، بينما أنا مضطجعة، مع رسول الله صلى الله عليه وسلم إذ حضت فانسللت فأخذت ثياب حيضتي فقال رسول الله صلى الله عليه وسلم ‏\"‏ أنفست ‏\"‏ ‏.‏ قلت نعم فدعاني فاضطجعت معه في الخميلة ‏.‏ واللفظ لعبيد الله بن سعيد ‏.‏",
      "text_en": " Umm Salamah narrated:                      \"While I was lying down with the Messenger of Allah (ﷺ) under a blanket, my period came so I slipped away and put on the clothes I used to wear when I was menstruating. The Messenger of Allah (ﷺ) said: 'Are you menstruating?' I said: 'Yes.' Then he called me to lie down with him under the blanket.\" This is the wording of 'Ubaidullah bin Sa'eed.[1][1] That is, one of the narrators in one of the chains, as the author reported it throughdifferent chains, as he did when it preceded, see No. 284.",
      "chain": [
        "30359",
        "20287",
        "30123",
        "20287",
        "20295",
        "34033",
        "20226",
        "11065",
        "11449",
        "10567",
        "244"
      ]
    },
    {
      "hadith_no": "437",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد بن الحارث، قال حدثنا شعبة، قال أخبرني سليمان الأعمش، قال سمعت منذرا، عن محمد بن علي، عن علي، - رضى الله عنه - قال استحييت أن أسأل رسول الله صلى الله عليه وسلم عن المذى من أجل فاطمة فأمرت المقداد فسأله فقال ‏\"‏ فيه الوضوء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ali said:                      \"I felt too shy to ask the Messenger of Allah (ﷺ) about Madhi because of Fatimah, so I told Al-Miqdad to ask him, and he said: 'Wudu' (is required) for that.'\"",
      "chain": [
        "30449",
        "20226",
        "20020",
        "11060",
        "11398",
        "11442",
        "5"
      ]
    },
    {
      "hadith_no": "583",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا إسماعيل بن مسعود، عن خالد بن الحارث، عن شعبة، عن أبي إسحاق، قال سمعت مسروقا، والأسود، قالا نشهد على عائشة أنها قالت كان رسول الله صلى الله عليه وسلم إذا كان عندي بعد العصر صلاهما ‏.‏",
      "text_en": " It was narrated that Abu Ishaq said:                      \"I heard Masruq and Al-Aswad say: We bear witness that 'Aishah said: 'When the Messenger of Allah (ﷺ) was with me after 'Asr, he would pray them (these two Rak'ahs).'\"",
      "chain": [
        "34033",
        "20226",
        "20020",
        "11049",
        "11018",
        "11054"
      ]
    },
    {
      "hadith_no": "826",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، عن ابن أبي ذئب، قال أخبرني الحارث بن عبد الرحمن، عن سالم بن عبد الله، عن عبد الله بن عمر، قال كان رسول الله صلى الله عليه وسلم يأمر بالتخفيف ويؤمنا بالصافات ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Umar said:                      \"The Messenger of Allah (ﷺ) used to enjoin upon us to make the prayer short, but he would lead us in prayer and recite As-Saffat.\"",
      "chain": [
        "34033",
        "20226",
        "20177",
        "19903",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "843",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، عن شعبة، عن أبي إسحاق، أنه أخبرهم عن عبد الله بن أبي بصير، عن أبيه، - قال شعبة وقال أبو إسحاق وقد سمعته منه، ومن أبيه - قال سمعت أبى بن كعب، يقول صلى رسول الله صلى الله عليه وسلم يوما صلاة الصبح فقال ‏\"‏ أشهد فلان الصلاة ‏\"‏ ‏.‏ قالوا لا ‏.‏ قال ‏\"‏ ففلان ‏\"‏ ‏.‏ قالوا لا ‏.‏ قال ‏\"‏ إن هاتين الصلاتين من أثقل الصلاة على المنافقين ولو يعلمون ما فيهما لأتوهما ولو حبوا والصف الأول على مثل صف الملائكة ولو تعلمون فضيلته لابتدرتموه وصلاة الرجل مع الرجل أزكى من صلاته وحده وصلاة الرجل مع الرجلين أزكى من صلاته مع الرجل وما كانوا أكثر فهو أحب إلى الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Ubay bin Ka'b said:                      \"One day the Messenger of Allah (ﷺ) prayed Fajr, then he said: 'Did so-and-so attend the prayer? They said: 'No.' He said: '(What about) so-and-so? They said:'No' He said: 'These two prayers. are the most burdensome for the hypocrites. If they knew what (virtue) there is in them, they would come, even if they had to crawl. And the virtue of the first row is like thatof the row of the angels. If you knew its virtue, you would compete for it. A man's prayer with another man is greater in reward than his prayer alone. And a man's prayer with two other men is greater in reward thanhis prayer with one other man; the more people there are, the more beloved that is to Allah, the Mighty and Sublime.\"'",
      "chain": [
        "34033",
        "20226",
        "20020",
        "11049",
        "20020",
        "39"
      ]
    },
    {
      "hadith_no": "859",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، ومحمد بن إبراهيم بن صدران، - واللفظ له - عن خالد بن الحارث، قال حدثنا شعبة، عن بديل، قال سمعت أبا العالية، يحدث عن عبد الله بن الصامت، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم وضرب فخذي ‏\"‏ كيف أنت إذا بقيت في قوم يؤخرون الصلاة عن وقتها ‏\"‏ ‏.‏ قال ما تأمر قال ‏\"‏ صل الصلاة لوقتها ثم اذهب لحاجتك فإن أقيمت الصلاة وأنت في المسجد فصل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ahu Dharr said:                      \"The Messenger of A;;ah (ﷺ) said to me, and struck my thigh: 'What will you do if you stay among people who delay the prayer until its time is over?' He said: 'What do you command me to do?' He said: 'Offer the prayer on time, then go about your business, Then if the Iqamah for that prayer is saidand you are in the Masjid, then pray.\"'",
      "chain": [
        "30449",
        "11213",
        "20226",
        "20020",
        "11618",
        "10695",
        "23"
      ]
    },
    {
      "hadith_no": "1029",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، عن شعبة، عن سليمان، قال سمعت إبراهيم، يحدث عن علقمة، والأسود، أنهما كانا مع عبد الله في بيته فقال أصلى هؤلاء قلنا نعم ‏.‏ فأمهما وقام بينهما بغير أذان ولا إقامة ‏.‏ قال إذا كنتم ثلاثة فاصنعوا هكذا وإذا كنتم أكثر من ذلك فليؤمكم أحدكم وليفرش كفيه على فخذيه فكأنما أنظر إلى اختلاف أصابع رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from 'Alqamah and Al-Aswad that:                     They were with 'Abdullah in his house and he said: \"Have these people prayed?\" We said: \"Yes.\" So he led them in prayer and stood between them, with no Adhan and no Iqamah, and said: \"If you are three then do this, and if you are more than that then let one of you lead the others in prayer, and let him lay his hands on his thighs. It is as if I can see the fingers of the Messenger of Allah (ﷺ), interlaced.'\"",
      "chain": [
        "34033",
        "20226",
        "20020",
        "11060",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "1244",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، عن شعبة، قال كتب إلى منصور وقرأته عليه وسمعته يحدث رجلا عن إبراهيم عن علقمة عن عبد الله أن رسول الله صلى الله عليه وسلم صلى صلاة الظهر ثم أقبل عليهم بوجهه فقالوا أحدث في الصلاة حدث قال ‏\"‏ وما ذاك ‏\"‏ ‏.‏ فأخبروه بصنيعه فثنى رجله واستقبل القبلة فسجد سجدتين ثم سلم ثم أقبل عليهم بوجهه فقال ‏\"‏ إنما أنا بشر أنسى كما تنسون فإذا نسيت فذكروني ‏\"‏ ‏.‏ وقال ‏\"‏ لو كان حدث في الصلاة حدث أنبأتكم به ‏\"‏ ‏.‏ وقال ‏\"‏ إذا أوهم أحدكم في صلاته فليتحر أقرب ذلك من الصواب ثم ليتم عليه ثم يسجد سجدتين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah that:                     The Messenger of Allah (ﷺ) prayed Zuhr then he turned to face them and they said: 'Has there been some change concerning the prayer?' He said: 'Why are you asking?' They told him what he had done, so he turned back toward the Qiblah and prostrated twice. Then he said the salam and turned to face them and said: 'I am only human, I forget as you forget, so if I forget, then remind me.' And he said: 'If there had been some change concerning the prayer I would have told you.' And he said: 'If one of you is not sure about his prayer, let him estimate what is closest to what is correct, then let him complete it on that basis, then prostrate twice.'",
      "chain": [
        "34033",
        "20226",
        "20020",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1366",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إسماعيل بن مسعود، ومحمد بن عبد الأعلى، قالا حدثنا خالد، - وهو ابن الحارث - عن هشام، عن يحيى بن أبي كثير، عن أبي سلمة بن عبد الرحمن، عن جابر بن عبد الله، أن عمر بن الخطاب، يوم الخندق بعد ما غربت الشمس جعل يسب كفار قريش وقال يا رسول الله ما كدت أن أصلي حتى كادت الشمس تغرب فقال رسول الله صلى الله عليه وسلم ‏\"‏ فوالله ما صليتها ‏\"‏ ‏.‏ فنزلنا مع رسول الله صلى الله عليه وسلم إلى بطحان فتوضأ للصلاة وتوضأنا لها فصلى العصر بعد ما غربت الشمس ثم صلى بعدها المغرب ‏.‏",
      "text_en": " It was narrated from Jabir bin Abdullah that:                     On the Day of Al-Khandaq, after the sun had set, Umar bin Al-Khattab started cursing the disbelievers of the Quraish and said: \"O Messenger of Allah, I was hardly able to pray until the sun set.\" The Messenger of Allah (ﷺ) said: \"By Allah, I did not pray.\" So we went down with the Messenger of Allah (ﷺ) to Buthan. He performed wudu' for prayer and so did we, and he prayed 'Asr after the sun had set, then he prayed Maghrib after that.\"",
      "chain": [
        "34033",
        "30449",
        "20226",
        "20295",
        "11449",
        "10567",
        "34",
        "3"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا محمد بن عبد الأعلى الصنعاني، قال حدثنا خالد بن الحارث، قال حدثنا شعبة، قال أخبرني مخول، قال سمعت مسلما البطين، عن سعيد بن جبير، عن ابن عباس، أن رسول الله صلى الله عليه وسلم كان يقرأ يوم الجمعة في صلاة الصبح ‏{‏ الم * تنزيل ‏}‏ و‏{‏ هل أتى على الإنسان ‏}‏ وفي صلاة الجمعة بسورة الجمعة والمنافقين ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that :                     During the subh prayer on Friday, the Messenger of Allah (ﷺ) used to recite: \"Alif-Lam-Mim. The Revelation\" and: \"Has there not been over man,\" and in Jumu'ah prayer he would recite Al-Jumu'ah (62) and Al-Munafiqin (63).",
      "chain": [
        "20226",
        "20020",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1443",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Shortening the Prayer When Traveling - كتاب تقصير الصلاة فى السفر",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن عبد الأعلى، في حديثه عن خالد بن الحارث، قال حدثنا شعبة، عن قتادة، قال سمعت موسى، - وهو ابن سلمة - قال قلت لابن عباس كيف أصلي بمكة إذا لم أصل في جماعة قال ركعتين سنة أبي القاسم صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Qatadah said:                     \"I heard Muas- bin Salamah-say: 'I said to Ibn 'Abbas: How should I pray in Makkah if I do not pray in congregation? He said: Two rak'ahs, the sunnah of Abu Al-Qasim.'\"",
      "chain": [
        "20226",
        "20020",
        "11019",
        "26042"
      ]
    },
    {
      "hadith_no": "1765",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا محمد بن إبراهيم البصري، قال حدثنا خالد بن الحارث، قال قرأت على عبد الحميد بن جعفر عن نافع، عن صفية، عن حفصة، عن النبي صلى الله عليه وسلم أنه كان يصلي ركعتى الفجر ركعتين خفيفتين ‏.‏",
      "text_en": " It was narrated from Hafsah that:                     The Prophet (ﷺ) used to pray the two rak'ahs of Fajr, two brief rak'ahs.",
      "chain": [
        "11213",
        "20226",
        "11014",
        "2802",
        "54"
      ]
    },
    {
      "hadith_no": "1774",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، قال حدثنا عبيد الله، عن نافع، عن عبد الله، قال حدثتني أختي، حفصة أنه كان يصلي قبل الفجر ركعتين خفيفتين ‏.‏",
      "text_en": " It was narrated that Abdullah said:                     \"My sister Hafsah told me that he used to pray two brief rak'ahs before Fajr.\"",
      "chain": [
        "34033",
        "20226",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1838",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا عبد الأعلى، قال حدثنا سعيد، ح وأخبرنا حميد بن مسعدة، عن خالد بن الحارث، قال حدثنا سعيد، عن قتادة، عن زرارة، عن سعد بن هشام، عن عائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أحب لقاء الله أحب الله لقاءه ومن كره لقاء الله كره الله لقاءه ‏\"‏ ‏.‏ زاد عمرو في حديثه فقيل يا رسول الله كراهية لقاء الله كراهية الموت كلنا نكره الموت ‏.‏ قال ‏\"‏ ذاك عند موته إذا بشر برحمة الله ومغفرته أحب لقاء الله وأحب الله لقاءه وإذا بشر بعذاب الله كره لقاء الله وكره الله لقاءه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that the Messenger of Allah said:                     \"Whoever loves to meet Allah, Allah loves to meet him, and whoever hates to meet Allah, Allah, hates to meet him.\" Amr (one of the narrators) added in his narration: \"t was said: 'O Messenger of Allah mean hating death? Fore all of us hate death.' He said; 'That is when he is dying; if he is given the glad tidings of the mercy and forgiveness of Allah, he loves to meet Allah and Allah loves to meet him. But if he is given the tidings of the punishment of  Allah, he hates to meet Allah and Allah hates to meet him.\"'",
      "chain": [
        "30153",
        "20246",
        "11168",
        "30430",
        "20226",
        "11168",
        "11019",
        "11166",
        "53"
      ]
    },
    {
      "hadith_no": "2046",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عمرو بن علي، حدثنا خالد بن الحارث، قال حدثنا شعبة، عن قتادة، عن سعيد بن المسيب، عن عائشة، أن النبي صلى الله عليه وسلم قال ‏\"‏ لعن الله قوما اتخذوا قبور أنبيائهم مساجد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Aishah that the Prophet said:                     \"May Allah curse people who take the graves of their prophets as Masjids.\"",
      "chain": [
        "30153",
        "20226",
        "20020",
        "11019",
        "11002",
        "53"
      ]
    },
    {
      "hadith_no": "2184",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال أنبأنا خالد، - وهو ابن الحارث - عن كهمس، عن عبد الله بن شقيق، قال قلت لعائشة أكان رسول الله صلى الله عليه وسلم يصلي صلاة الضحى قالت لا إلا أن يجيء من مغيبه ‏.‏ قلت هل كان رسول الله صلى الله عليه وسلم يصوم شهرا كله قالت لا ما علمت صام شهرا كله إلا رمضان ولا أفطر حتى يصوم منه حتى مضى لسبيله ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Shaqiq said:                     \"I said to Aishah: 'Did the Messenger of Allah offer Duha prayer? She said: \"No, unless he was returning from a journey, I Did the Messenger of Allah fast an entire month?' She said: 'No, I do not remember him fasting any month in full apart from Ramadan, and he did not break his fast for a whole month, rather he would fast some of (each month) until he passed away.\"' '",
      "chain": [
        "34033",
        "20226",
        "11303",
        "10694"
      ]
    },
    {
      "hadith_no": "2262",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى بن سعيد، وخالد بن الحارث، عن شعبة، عن محمد بن عبد الرحمن، عن محمد بن عمرو بن حسن، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم رأى رجلا قد ظلل عليه في السفر فقال ‏\"‏ ليس من البر الصيام في السفر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir bin Abdullah that:                     the Messenger of Allah saw a man who was being shaded on a journey. He said: \"It is not righteousness to fast when traveling.\"",
      "chain": [
        "30153",
        "20031",
        "20226",
        "20020",
        "11105",
        "11220",
        "34"
      ]
    },
    {
      "hadith_no": "2508",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا خالد، - وهو ابن الحارث - قال حدثنا حميد، عن الحسن، قال قال ابن عباس وهو أمير البصرة في آخر الشهر أخرجوا زكاة صومكم ‏.‏ فنظر الناس بعضهم إلى بعض فقال من ها هنا من أهل المدينة قوموا فعلموا إخوانكم فإنهم لا يعلمون إن هذه الزكاة فرضها رسول الله صلى الله عليه وسلم على كل ذكر وأنثى حر ومملوك صاعا من شعير أو تمر أو نصف صاع من قمح ‏.‏ فقاموا ‏.‏ خالفه هشام فقال عن محمد بن سيرين ‏.‏",
      "text_en": " When he was the governor of Al-Basrah, at the end of the month, Ibn 'Abbas said:                     \"Give Zakah of your fast.\" The people looked at one another, so he said: \"Whoever is here from the people of Al-Madinah, get up and teach your brothers, for they do lnot know that this Zakah was enjoined by the Messenger of Allah upon every male and female, free and slave, a Sa' of barley or dates, or half a Sa' of wheat. \"So they got up. (Da'if) Hisham contradicted him, he said:  \"From Muhammad bin Sirin.\"",
      "chain": [
        "30170",
        "20226",
        "11279",
        "11016"
      ]
    },
    {
      "hadith_no": "2540",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، قال حدثنا حسين المعلم، عن عمرو بن شعيب، أن أباه، حدثه عن عبد الله بن عمرو، قال لما فتح رسول الله صلى الله عليه وسلم مكة قام خطيبا فقال في خطبته ‏\"‏ لا يجوز لامرأة عطية إلا بإذن زوجها ‏\"‏ ‏.‏ مختصر ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     \"When the Messenger of Allah conquered Makkah, he stood up to address the people and said in his Khutbah; 'It is not permissible for a woman to give anything without her husband's permission.\"' (He narrated it) in abridged from.",
      "chain": [
        "34033",
        "20226",
        "11278",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "2554",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا أزهر بن جميل، قال حدثنا خالد بن الحارث، قال حدثنا شعبة، قال وذكر عون بن أبي جحيفة قال سمعت المنذر بن جرير، يحدث عن أبيه، قال كنا عند رسول الله صلى الله عليه وسلم في صدر النهار فجاء قوم عراة حفاة متقلدي السيوف عامتهم من مضر بل كلهم من مضر فتغير وجه رسول الله صلى الله عليه وسلم لما رأى بهم من الفاقة فدخل ثم خرج فأمر بلالا فأذن فأقام الصلاة فصلى ثم خطب فقال ‏\"‏ ‏{‏ يا أيها الناس اتقوا ربكم الذي خلقكم من نفس واحدة وخلق منها زوجها وبث منهما رجالا كثيرا ونساء واتقوا الله الذي تساءلون به والأرحام إن الله كان عليكم رقيبا ‏}‏ و ‏{‏ اتقوا الله ولتنظر نفس ما قدمت لغد ‏}‏ تصدق رجل من ديناره من درهمه من ثوبه من صاع بره من صاع تمره - حتى قال - ولو بشق تمرة ‏\"‏ ‏.‏ فجاء رجل من الأنصار بصرة كادت كفه تعجز عنها بل قد عجزت ثم تتابع الناس حتى رأيت كومين من طعام وثياب حتى رأيت وجه رسول الله صلى الله عليه وسلم يتهلل كأنه مذهبة فقال رسول الله صلى الله عليه وسلم ‏\"‏ من سن في الإسلام سنة حسنة فله أجرها وأجر من عمل بها من غير أن ينقص من أجورهم شيئا ومن سن في الإسلام سنة سيئة فعليه وزرها ووزر من عمل بها من غير أن ينقص من أوزارهم شيئا ‏\"‏ ‏.‏",
      "text_en": " Al-Mundhir bin Jarir narrated that his father said:                     \"While we were with the Messenger of Allah in the early hours of the morning, some people came who were naked and barefoot, with their swords hung (around their necks). Most of them, may all of them, belonged to the tribe of Mudar. The face of the Messenger of Allah changed when he saw them in poverty. He went in (to his house) then he came out and ordered Bilah to call the Adhan and then the Iqamah. He (the Prophet) prayed, tjem je addressed te,, (reciting the Verses): 'O mankind! Be dutiful to your Lord, Who created you from a single person (Adam), and from him(Adam) He created his wife [Hawwa (Eve)], and from them both He created many men and women: and fear Allah through Whom you demand (your mutual right), and (do not cut the relations of) the wombs (kinship).  Surely, Allah is Ever and All-Watcher over you.' [1] and: 'Fear Allah and keep your duty to Him. And let every person look to what he has sent forth for the morrow,' [2] Then they gave in charity, some giving a Dinar, others a Dirham, or a garment, or a Sa' of wheat or, a Sa' of dates, until he said: 'Even half a date.' A man from among the Ansar came with a bag of money which his hands could hardly lift. The people followed one another (in giving charity) until I saw two heaps of food and clothing, and I saw the face of the Messenger of Allah shining like gold (with joy). The Messenger of Allah said: 'Whoever sets a good precedent in Islam, he will have the reward for that, and the reward of those who acted in accordance with it, without that detracting from their reward in the slightest. And whoever sets an evil precedent in Islam, he will have a burden of sin for that, and the burden of those who acted in accordance with it, without that detracting from their burden in the slightest.\"'",
      "chain": [
        "30122",
        "20226",
        "20020",
        "11383",
        "10831"
      ]
    },
    {
      "hadith_no": "3267",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، - وهو ابن الحارث - قال حدثنا هشام، عن يحيى بن أبي كثير، قال حدثنا أبو سلمة بن عبد الرحمن، قال حدثني أبو هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تنكح الأيم حتى تستأمر ولا تنكح البكر حتى تستأذن ‏\"‏ ‏.‏ قالوا يا رسول الله كيف إذنها قال ‏\"‏ أن تسكت ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah said:                      \"A previously married woman should not be married until her consent has been sought, and a virgin should not be married until her permission has been sought.\" They said: \"O Messenger of Allah, what is her permission?\" He said: \"If she remains silent.\"",
      "chain": [
        "30449",
        "20226",
        "20295",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3443",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن إبراهيم بن صدران، عن خالد بن الحارث، قال حدثنا أشعث، - وهو ابن عبد الملك - عن عاصم، عن الشعبي، عن مسروق، عن عائشة، قالت قد خير النبي صلى الله عليه وسلم نساءه فلم يكن طلاقا ‏.‏",
      "text_en": " It was narrated from Masruq that 'Aishah said:                      \"The Prophet gave his wives the choice and that was not a divorce.\"",
      "chain": [
        "34185",
        "20226",
        "19838",
        "11080",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "3620",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، قال حدثنا مالك بن مغول، قال حدثنا طلحة، قال سألت ابن أبي أوفى أوصى رسول الله صلى الله عليه وسلم قال لا‏.‏ قلت كيف كتب على المسلمين الوصية قال أوصى بكتاب الله‏.‏",
      "text_en": " Talha said:                      \"I asked Ibn Abi Awfa: 'Did the Messenger of Allah leave a will?' He said: 'No.' I said: 'How come it is prescribed for the Muslims to make wills?' He said: 'He left instructions urging the Muslims to adhere to the Book of Allah.'\"",
      "chain": [
        "34033",
        "20226",
        "20358",
        "11356"
      ]
    },
    {
      "hadith_no": "3750",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of 'Umra - كتاب العمرى",
      "chapter_no": "34",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد بن الحارث، قال حدثنا هشام، قال حدثنا يحيى بن أبي كثير، قال حدثني أبو سلمة، قال سمعت جابرا، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ العمرى لمن وهبت له ‏\"‏ ‏.‏",
      "text_en": " Hisham said:                      \"Yahya bin Abi Kathir narrated to us, he said: 'Abu Salamah bin 'Abdur-Rahman narrated to me, he said: \"I heard Jabir say: 'The Messenger of Allah said: \"A lifelong gift belongs to the one to whom it was given.\"'\"'\"",
      "chain": [
        "30449",
        "20226",
        "20295",
        "11449",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "3862",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن إبراهيم، قال أنبأنا خالد، - هو ابن الحارث - قال قرأت على عبد الحميد بن جعفر أخبرني أبي، عن رافع بن أسيد بن ظهير، عن أبيه، أسيد بن ظهير أنه خرج إلى قومه إلى بني حارثة فقال يا بني حارثة لقد دخلت عليكم مصيبة‏.‏‏ قالوا ما هي قال نهى رسول الله صلى الله عليه وسلم عن كراء الأرض‏.‏‏ قلنا يا رسول الله إذا نكريها بشىء من الحب‏.‏‏ قال ‏‏\"‏‏ لا ‏‏\"‏‏‏.‏‏ قال وكنا نكريها بالتبن فقال ‏‏\"‏‏ لا ‏‏\"‏‏‏.‏‏ وكنا نكريها بما على الربيع الساقي قال ‏‏\"‏‏ لا ازرعها أو امنحها أخاك ‏‏\"‏‏‏.‏‏ خالفه مجاهد‏.‏‏",
      "text_en": " It was narrated from Usaid bin Zuhair that he went out to his people, Banu Harithah, and said:                      \"O Banu Harithah, a calamity has befallen you.\" They said: \"What is it?\" He said: \"The Messenger of Allah has forbidden leasing land.\" We said: \"O Messenger of Allah, what if we lease it in return for some of the grain?\" He said, \"No.\" He said: \"We used to lease it in return for straw.\" He said: \"No.\" \"We used to lease it in return for what is planted on the banks of a stream that is used for irrigation.\" He said: \"No. Cultivate it (yourself) or give it to your brother.\"",
      "chain": [
        "11213",
        "20226"
      ]
    },
    {
      "hadith_no": "3871",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عمرو بن علي، عن خالد، - وهو ابن الحارث - قال حدثنا شعبة، عن عبد الملك، عن مجاهد، قال حدث رافع بن خديج، قال خرج إلينا رسول الله صلى الله عليه وسلم فنهانا عن أمر كان لنا نافعا فقال ‏‏\"‏‏ من كان له أرض فليزرعها أو يمنحها أو يذرها ‏‏\"‏‏‏.‏‏",
      "text_en": " Rafi' bin Khadij said:                      \"The Messenger of Allah came out to us and forbade something for us that had been beneficial for us. He said: 'Whoever has land, let him cultivate it or give it to someone else (to cultivate), or leave it.'\"",
      "chain": [
        "30153",
        "20226",
        "20020",
        "11368",
        "11028",
        "1986"
      ]
    },
    {
      "hadith_no": "3874",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "حدثنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، قال حدثنا عبد الملك، عن عطاء، عن جابر، أن رسول الله صلى الله عليه وسلم قال ‏‏\"‏‏ من كان له أرض فليزرعها فإن عجز أن يزرعها فليمنحها أخاه المسلم ولا يزرعها إياه ‏‏\"‏‏‏.‏‏",
      "text_en": " It was narrated from 'Ata' from Jabir, that the Messenger of Allah said:                      \"Whoever has land, let him cultivate it. If he is unable to cultivate it, let him give it to his Muslim brother and not share-crop it with him.\"",
      "chain": [
        "34033",
        "20226",
        "11368",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "3897",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، عن سعيد، عن يعلى بن حكيم، عن سليمان بن يسار، أن رافع بن خديج، قال كنا نحاقل على عهد رسول الله صلى الله عليه وسلم فزعم أن بعض عمومته أتاه فقال نهاني رسول الله صلى الله عليه وسلم عن أمر كان لنا نافعا وطواعية الله ورسوله أنفع لنا‏.‏‏ قلنا وما ذاك قال قال رسول الله صلى الله عليه وسلم ‏‏\"‏‏ من كانت له أرض فليزرعها أو ليزرعها أخاه ولا يكاريها بثلث ولا ربع ولا طعام مسمى ‏‏\"‏‏‏.‏‏ رواه حنظلة بن قيس عن رافع فاختلف على ربيعة في روايته‏.‏‏",
      "text_en": " It was narrated that Rafi' bin Khadij said:                      \"We used to lease land on the basis of Al-Muhaqalah during the time of the Messenger of Allah.\" He said that one of his paternal uncles came to them and said: \"The Messenger of Allah has forbidden me to do something that was beneficial for us, but obedience to Allah and His Messenger is more beneficial.\" We said: \"What is that?\" He said: \"The Messenger of Allah said: 'Whoever has land, let him cultivate it (himself) or give it to his brother to cultivate, and not lease it in return for one-third or one-quarter of the yield nor a specified amount of food (produce).'\"",
      "chain": [
        "34033",
        "20226",
        "11168",
        "11567",
        "11005",
        "1986"
      ]
    },
    {
      "hadith_no": "3913",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، - وهو ابن الحارث - قال حدثنا عبيد الله بن عمر، عن نافع، أن رجلا، أخبر ابن عمر، أن رافع بن خديج، يأثر في كراء الأرض حديثا فانطلقت معه أنا والرجل الذي أخبره حتى أتى رافعا فأخبره رافع أن رسول الله صلى الله عليه وسلم نهى عن كراء الأرض‏.‏‏ فترك عبد الله كراء الأرض‏.‏‏",
      "text_en": " It was narrated from Nafi':                      \"A man told Ibn 'Umar that Rafi' bin Khadij had narrated a Hadith concerning leasing of land. He and I, along with the man who had told him that, went to Rafi', and he told us that the Messenger of Allah had forbidden leasing land. So 'Abdullah stopped leasing land.\"",
      "chain": [
        "34033",
        "20226",
        "11201",
        "11014",
        "18",
        "1986"
      ]
    },
    {
      "hadith_no": "4000",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "قال وأخبرني أزهر بن جميل البصري، قال حدثنا خالد بن الحارث، قال حدثنا شعبة، عن المغيرة بن النعمان، عن سعيد بن جبير، قال اختلف أهل الكوفة في هذه الآية ‏{‏ ومن يقتل مؤمنا متعمدا ‏}‏ فرحلت إلى ابن عباس فسألته فقال لقد أنزلت في آخر ما أنزل ثم ما نسخها شىء ‏.‏",
      "text_en": " It was narrated that Sa'eed bin Jubair said:                     \"The people of Al-Kufah differed concerning this Verse: \"And whoever kills a believer intentionally.\" So I went to Ibn 'Abbas and asked him, and he said: 'It was revealed among the last of what was revealed, and nothing of it was abrogated after that.'\"",
      "chain": [
        "30122",
        "20226",
        "20020",
        "11655",
        "11050"
      ]
    },
    {
      "hadith_no": "4453",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني، قال حدثنا خالد، - وهو ابن الحارث - قال حدثنا ابن عون، عن الشعبي، قال سمعت النعمان بن بشير، قال سمعت رسول الله صلى الله عليه وسلم - فوالله لا أسمع بعده أحدا يقول سمعت رسول الله صلى الله عليه وسلم - يقول ‏\"‏ إن الحلال بين وإن الحرام بين وإن بين ذلك أمورا مشتبهات ‏\"‏ ‏.‏ وربما قال ‏\"‏ وإن بين ذلك أمورا مشتبهة ‏\"‏ ‏.‏ قال ‏\"‏ وسأضرب لكم في ذلك مثلا إن الله عز وجل حمى حمى وإن حمى الله عز وجل ما حرم وإنه من يرتع حول الحمى يوشك أن يخالط الحمى ‏\"‏ ‏.‏ وربما قال ‏\"‏ إنه من يرعى حول الحمى يوشك أن يرتع فيه وإن من يخالط الريبة يوشك أن يجسر ‏\"‏ ‏.‏",
      "text_en": " An-Nu'man bin Bashir said:                     \"I heard the Messenger of Allah say: \"That which is lawful is plain and that which is unlawful is plain, and between them are matters which are not as clear. I will strike a parable for you about that: indeed Allah, the Mighty and Sublime, has established a sanctuary, and the sanctuary of Allah is that which He has forbidden. Whoever approaches the sanctuary is bound to transgress upon it, Or he said: 'Whoever grazes around the sanctuary will soon transgress upon it, and whoever indulges in matters that are not clear, he will soon transgress beyond the limits,\"\"",
      "chain": [
        "20226",
        "11071",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "4620",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا يحيى بن سعيد، ويزيد بن زريع، وخالد بن الحارث، قالوا حدثنا شعبة، وأخبرني أحمد بن فضالة بن إبراهيم، قال حدثنا عبيد الله بن موسى، قال حدثنا الحسن بن صالح، عن ابن أبي عروبة، عن قتادة، عن الحسن، عن سمرة، أن رسول الله صلى الله عليه وسلم نهى عن بيع الحيوان بالحيوان نسيئة ‏.‏",
      "text_en": " It was narrated from Sasmurah that:                     the Messenger of Allah forbade selling animals in exchange for animal's ion credit.",
      "chain": [
        "30153",
        "20031",
        "20304",
        "20226",
        "20020",
        "38045",
        "20340",
        "20647",
        "11073",
        "11019",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "4850",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، قال حدثنا حسين المعلم، عن عمرو بن شعيب، أن أباه، حدثه عن عبد الله بن عمرو، قال لما افتتح رسول الله صلى الله عليه وسلم مكة قال في خطبته ‏\"‏ وفي الأصابع عشر عشر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     \"When the Messenger of Allah conquered Makkah, he said in his Khutbah: \"(The Diyah) for fingers is ten each.\"",
      "chain": [
        "34033",
        "20226",
        "11278",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "4852",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، قال حدثنا حسين المعلم، عن عمرو بن شعيب، أن أباه، حدثه عن عبد الله بن عمرو، قال لما افتتح رسول الله صلى الله عليه وسلم مكة قال في خطبته ‏\"‏ وفي المواضح خمس خمس ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib that his father told him that 'Abdullah bin 'Amr said:                      \"When the Messenger of Allah (ﷺ) conquered Makkah , he said in his Khutbah: 'For any wound that exposes the bone, the diyah is five (camels) each.'\"",
      "chain": [
        "34033",
        "20226",
        "11278",
        "19934",
        "19911",
        "29"
      ]
    },
    {
      "hadith_no": "4864",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا أزهر بن جميل، قال حدثنا خالد بن الحارث، قال حدثنا شعبة، عن المغيرة بن النعمان، عن سعيد بن جبير، قال اختلف أهل الكوفة في هذه الآية ‏{‏ ومن يقتل مؤمنا متعمدا ‏}‏ فرحلت إلى ابن عباس فسألته فقال نزلت في آخر ما أنزلت وما نسخها شىء ‏.‏",
      "text_en": " It was narrated that Sa'eed bin Jabair said:                     \"The people of Al-Kufah differed concerning this verse: 'And whoever kills a believer intentionally. So I went to Ibn 'Abbas and asked him, and he said: 'It was revealed among the last of what was revealed, and nothing of it was abrogated after that.",
      "chain": [
        "30122",
        "20226",
        "20020",
        "11655",
        "11050"
      ]
    },
    {
      "hadith_no": "4954",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "حدثنا سوار بن عبد الله بن سوار، قال حدثنا خالد بن الحارث، قال حدثنا عبد الملك، ح وأنبأنا عبد الرحمن بن محمد بن سلام، قال أنبأنا إسحاق، - هو الأزرق - قال حدثنا به عبد الملك، عن عطاء، عن أيمن، مولى ابن الزبير - وقال خالد في حديثه مولى الزبير - عن تبيع عن كعب قال من توضأ فأحسن الوضوء ثم صلى - وقال عبد الرحمن فصلى العشاء الآخرة - ثم صلى بعدها أربع ركعات فأتم - وقال سوار يتم - ركوعهن وسجودهن ويعلم ما يقترئ - وقال سوار يقرأ - فيهن كن له بمنزلة ليلة القدر ‏.‏",
      "text_en": " It was narrated that Ka'b said:                     \"Whoever performs wudu and performs wudu, well, then prays ('Abdur-Rahman said: and prays Isha), then prays after that four Rakahs and does them well (Sawwar said: and understands what he is reciting (Sawwar said: and recites therein), they will be equivalent to (praying) Lailat Al-Qadr for him\". (Hasan Maqtu)",
      "chain": [
        "20226",
        "11368",
        "36587",
        "20411",
        "11029"
      ]
    },
    {
      "hadith_no": "5006",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "حدثنا يحيى بن حبيب بن عربي، قال حدثنا خالد، - يعني ابن الحارث - عن ابن عجلان، عن عبد الله بن دينار، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ الحياء شعبة من الإيمان ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Prophet [SAW] said: \"Modesty (Al-Haya') is a branch of Faith.\"",
      "chain": [
        "30459",
        "20226",
        "10616",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "5019",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا إسمعيل بن مسعود قال حدثنا خالد يعني ابن الحارث عن شعبة عن عبد الله بن عبد الله بن جبر عن أنس  عن النبي صلى الله عليه وسلم قال حب الأنصار آية الإيمان وبغض الأنصار آية النفاق",
      "text_en": " It was narrated from Anas that:                     The Prophet [SAW] said: \"Love for Ansar is a sign of Faith, and hatred for Ansar is a sign of hypocrisy.\"",
      "chain": [
        "20226",
        "20020",
        "11185",
        "19"
      ]
    },
    {
      "hadith_no": "5027",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو الأشعث قال حدثنا خالد يعني ابن الحارث قال حدثنا هشام عن يحيى بن أبي كثير عن أبي سلمة بن عبد الرحمن قال حدثني أبو هريرة  أن رسول الله صلى الله عليه وسلم قال من قام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه ومن قام ليلة القدر إيمانا واحتسابا غفر له ما تقدم من ذنبه",
      "text_en": " Abu Hurairah narrated that:                     The Messenger of Allah [SAW] said: \"Whoever stands (in the voluntary night prayer of) Ramadan out of faith and in the hope of reward, his previous sins will be forgiven. And whoever spends the night of Lailat Al-Qadr in prayer out of faith and in the hope of reward, his previous sins will be forgiven.\"",
      "chain": [
        "10917",
        "20226",
        "20295",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "5058",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد بن الحارث، عن كهمس، عن عبد الله بن شقيق، قال كان رجل من أصحاب النبي صلى الله عليه وسلم عاملا بمصر فأتاه رجل من أصحابه فإذا هو شعث الرأس مشعان قال ما لي أراك مشعانا وأنت أمير قال كان نبي الله صلى الله عليه وسلم ينهانا عن الإرفاه ‏.‏ قلنا وما الإرفاه قال الترجل كل يوم ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Shaqiq said:                     \"One of the Companions of the Prophet [SAW] was a governor in Egypt, and one of his companions came to him and found him with unkempt, wild hair. He said: 'How come I see you with wild hair when you are a governor?' He said: 'The Prophet of Allah [SAW] forbade us from Al-Irfah,' and we said: 'What is Al-Irfah?' He said: 'To comb your hair every day.'\"",
      "chain": [
        "34033",
        "20226",
        "11303",
        "10694"
      ]
    },
    {
      "hadith_no": "5175",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا الحسن بن قزعة، قال حدثنا خالد بن الحارث، قال حدثنا محمد بن عمرو، عن إبراهيم بن عبد الله بن حنين، عن أبيه، قال سمعت عليا، يقول نهاني رسول الله صلى الله عليه وسلم ولا أقول نهاكم عن خاتم الذهب وعن القسي والمعصفر وأن لا أقرأ وأنا راكع ‏.‏",
      "text_en": " It was narrated from Ibrahim bin 'Abdullah bin Hunain that his father said:                     \"I heard 'Ali say: 'The Messenger of Allah [SAW] forbade me- but I do not say that he forbade you- from wearing gold rings, Al-Qassi, and garments dyed with safflower, and reciting Qur'an while bowing.'\"",
      "chain": [
        "34055",
        "20226",
        "11220",
        "11150",
        "11181",
        "5"
      ]
    },
    {
      "hadith_no": "5242",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، قال حدثنا خالد، - وهو ابن الحارث - قال حدثنا عزرة، - وهو ابن ثابت - عن أبي الزبير، عن جابر، قال أتي النبي صلى الله عليه وسلم بأبي قحافة ورأسه ولحيته كأنه ثغامة فقال النبي صلى الله عليه وسلم ‏\"‏ غيروا أو اخضبوا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"Abu Quhafah was brought to the Messenger of Allah [SAW] and his head and beard were white like the Thaghamah. The Prophet [SAW] said: 'Change this, or dye it.'\"",
      "chain": [
        "30449",
        "20226",
        "20561",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "5302",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا الحسن بن قزعة، عن خالد، - وهو ابن الحارث - قال حدثنا محمد بن عمرو، عن واقد بن عمرو بن سعد بن معاذ، قال دخلت على أنس بن مالك حين قدم المدينة فسلمت عليه فقال ممن أنت قلت أنا واقد بن عمرو بن سعد بن معاذ ‏.‏ قال إن سعدا كان أعظم الناس وأطوله ‏.‏ ثم بكى فأكثر البكاء ثم قال إن رسول الله صلى الله عليه وسلم بعث إلى أكيدر صاحب دومة بعثا فأرسل إليه بجبة ديباج منسوجة فيها الذهب فلبسه رسول الله صلى الله عليه وسلم ثم قام على المنبر وقعد فلم يتكلم ونزل فجعل الناس يلمسونها بأيديهم فقال ‏\"‏ أتعجبون من هذه لمناديل سعد في الجنة أحسن مما ترون ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Wafid bin 'Amr bin Sa'd bin Mu'adh said:                     \"I entered upon Anas bin Malik when he came to Al-Madinah and greeted him with Salam. He said: 'Where are you from?' I said: 'I am Wafid bin 'Amr bin Sa'd bin Mu'adh.' He said: 'Sa'd was the greatest and most virtuous of people.' Then he wept a great deal, then he said: 'The Messenger of Allah [SAW] sent a delegation to Ukaidir the ruler of Dumah, who sent him a Jubbah made of Ad-Dibaj interwoven with gold. The Messenger of Allah [SAW] put it on, then he stood on the Minbar and sat, without speaking, then he came down and the people started touching it with their hands. He said: 'Are you admiring this? The handkerchiefs of Sa'd in Paradise are more beautiful than what you see.'\"",
      "chain": [
        "34055",
        "20226",
        "11220",
        "10621",
        "9"
      ]
    },
    {
      "hadith_no": "5316",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، - وهو ابن الحارث - قال حدثنا هشام، عن يحيى بن أبي كثير، عن محمد بن إبراهيم، أن خالد بن معدان، أخبره أن جبير بن نفير أخبره أن عبد الله بن عمرو أخبره أنه، رآه رسول الله صلى الله عليه وسلم وعليه ثوبان معصفران فقال ‏\"‏ هذه ثياب الكفار فلا تلبسها ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin 'Amr narrated that:                     The Messenger of Allah [SAW] saw him wearing two garments dyed with safflower and he said: \"This is the clothing of disbelievers; do not wear it.\"",
      "chain": [
        "34033",
        "20226",
        "20295",
        "11449",
        "11213",
        "11422",
        "4097",
        "29"
      ]
    },
    {
      "hadith_no": "5330",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، - وهو ابن الحارث - قال حدثنا هشام، عن يحيى، عن محمد بن إبراهيم، قال حدثني أبو يعقوب، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ما تحت الكعبين من الإزار ففي النار ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                     \"The Messenger of Allah [SAW] said: 'Whatever of the Izar comes below the ankles is in the Fire.'\"",
      "chain": [
        "34033",
        "20226",
        "20295",
        "11449",
        "11213",
        "13"
      ]
    },
    {
      "hadith_no": "5358",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا خالد، - وهو ابن الحارث - قال حدثنا سعيد بن أبي عروبة، عن النضر بن أنس، قال كنت جالسا عند ابن عباس أتاه رجل من أهل العراق فقال إني أصور هذه التصاوير فما تقول فيها فقال ادنه ادنه سمعت محمدا صلى الله عليه وسلم يقول ‏\"‏ من صور صورة في الدنيا كلف يوم القيامة أن ينفخ فيها الروح وليس بنافخه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that An-Nadr bin Anas said:                     \"I was sitting with Ibn 'Abbas when a man from among the people of Al-'Iraq came to him and said: 'I make these images; what do you say concerning them?' He said: 'Come closer, come closer. I heard Muhammad [SAW] say: Whoever makes an image in this world will be commanded on the Day of Resurrection to breathe a soul into it, and he will not be able to do so.\"",
      "chain": [
        "30153",
        "20226",
        "11073",
        "11310"
      ]
    },
    {
      "hadith_no": "5388",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا خالد بن الحارث، قال حدثنا حميد، عن الحسن، عن أبي بكرة، قال عصمني الله بشىء سمعته من، رسول الله صلى الله عليه وسلم لما هلك كسرى قال ‏\"‏ من استخلفوا ‏\"‏‏.‏ قالوا بنته‏.‏ قال ‏\"‏ لن يفلح قوم ولوا أمرهم امرأة ‏\"‏‏.‏",
      "text_en": " It was narrated that Abu Bakrah said:                     \"Allah protected me with something that I heard from the Messenger of Allah [SAW]. When Chosroes died, he said: 'Whom have they appointed as his successor?' They said: 'His daughter.' He said: 'No people will ever prosper who entrust their leadership to a woman.'\"",
      "chain": [
        "30170",
        "20226",
        "11279",
        "11016",
        "3229"
      ]
    },
    {
      "hadith_no": "5498",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا أزهر بن جميل، قال حدثنا خالد بن الحارث، قال حدثنا شعبة، عن عاصم، عن عبد الله بن سرجس، أن رسول الله صلى الله عليه وسلم كان إذا سافر قال ‏\"‏ اللهم إني أعوذ بك من وعثاء السفر وكآبة المنقلب والحور بعد الكور ودعوة المظلوم وسوء المنظر في الأهل والمال ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Sarjis that :                     When the Messenger of Allah [SAW] traveled, he would say: \"Allahumma inni a'udhu bika min wa'tha'is-safari, wa kabatil-munqalabi, wal-hawri ba'dal-kawri, wa da'watil-mazlumi, wa suw'il-munzari fil-ahli wal-mal (O Allah, I seek refuge with You from the hardships of travel and the sorrows of return, from loss after plenty, from the supplication of the one who has been wronged, and seeing some calamity befall my family or wealth.)\"",
      "chain": [
        "30122",
        "20226",
        "20020",
        "11080",
        "3245"
      ]
    },
    {
      "hadith_no": "5566",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا إسماعيل بن مسعود، قال حدثنا خالد، - يعني ابن الحارث - قال حدثنا هشام، عن يحيى، عن عبد الله بن أبي قتادة، عن أبي قتادة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تنبذوا الزهو والرطب جميعا ولا البسر والزبيب جميعا وانبذوا كل واحد منهما على حدته ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Qatadah that:                     The Messenger of Allah [SAW] said: \"Do not soak Az-Zahuw and ripe dates together, nor Al-Busr and raisins together. Soak each one of them on its own.\"",
      "chain": [
        "34033",
        "20226",
        "20295",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "5649",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سوار بن عبد الله بن سوار، قال حدثنا خالد بن الحارث، قال حدثنا عبد الملك، قال حدثنا أبو الزبير، عن جابر، رضى الله عنه أن رسول الله صلى الله عليه وسلم نهى عن الدباء والنقير والجر والمزفت ‏.‏",
      "text_en": " It was narrated from Jabir that:                     The Messenger of Allah [SAW] forbade Ad-Dubba' (gourds), An-Naqir, earthenware jars, and Al-Muzaffat.",
      "chain": [
        "20226",
        "11368",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "5658",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا محمد بن عبد الأعلى، عن خالد، - وهو ابن الحارث - عن شعبة، قال سمعت أبا بكر بن حفص، يقول سمعت ابن محيريز، يحدث عن رجل، من أصحاب النبي صلى الله عليه وسلم عن النبي صلى الله عليه وسلم قال ‏\"‏ يشرب ناس من أمتي الخمر يسمونها بغير اسمها ‏\"‏ ‏.‏",
      "text_en": " Ibn Muhairiz narrated from a man among the Companions of the Prophet [SAW] that :                     The Prophet [SAW] said: \"People among my Ummah will drink Khamr, calling it by another name.\"",
      "chain": [
        "30449",
        "20226",
        "20020",
        "11180"
      ]
    },
    {
      "hadith_no": "188",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا خالد بن الحارث، حدثنا سعيد، عن قتادة، عن صفوان بن محرز المازني، قال بينما نحن مع عبد الله بن عمر وهو يطوف بالبيت إذ عرض له رجل فقال يا ابن عمر كيف سمعت رسول الله  صلى الله عليه وسلم  يذكر في النجوى قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ يدنى المؤمن من ربه يوم القيامة حتى يضع عليه كنفه ثم يقرره بذنوبه فيقول هل تعرف فيقول يا رب أعرف ‏.‏ حتى إذا بلغ منه ما شاء الله أن يبلغ قال إني سترتها عليك في الدنيا وأنا أغفرها لك اليوم ‏.‏ قال ثم يعطى صحيفة حسناته أو كتابه بيمينه ‏.‏ قال وأما الكافر أو المنافق فينادى على رءوس الأشهاد ‏\"‏ ‏.‏ قال خالد في ‏\"‏ الأشهاد ‏\"‏ ‏.‏ شىء من انقطاع ‏.‏ ‏{هؤلاء الذين كذبوا على ربهم ألا لعنة الله على الظالمين}‏ ‏.‏",
      "text_en": " It was narrated that Safwan bin Muhriz Al-Mazini said:                     \"We were with 'Abdullah bin 'Umar when he was circumambulating the House; a man came up to him and said: 'O Ibn 'Umar, what did you hear the Messenger of Allah say about the Najwa?' He said: 'I heard the Messenger of Allah say: 'On the Day of Resurrection, the believer will be brought close to his Lord until He will cover him with His screen, then He will make him confess his sins. He will ask him: \"Do you confess?\" He will say: \"O Lord, I confess.\" This will continue as long as Allah wills, then He will say: \"I concealed them for you in the world, and I forgive you for them today.\" Then he will be given the scroll of his good deeds, or his record, in his right hand. But as for the disbeliever or the hypocrite, (his sins) will be announced before the witnesses.' \" (One of the narrators) Khalid said: \"At: 'before the witnesses' there is something missing.\" \"These are the ones who lied against their Lord!' No doubt! The curse of Allah is on the wrongdoers.\"",
      "chain": [
        "30430",
        "20226",
        "11168",
        "11019",
        "11693"
      ]
    },
    {
      "hadith_no": "692",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا خالد بن الحارث، حدثنا حميد، قال سئل أنس بن مالك هل اتخذ النبي  صلى الله عليه وسلم  خاتما قال نعم أخر ليلة العشاء الآخرة إلى قريب من شطر الليل فلما صلى أقبل علينا بوجهه فقال ‏\"‏ إن الناس قد صلوا وناموا وإنكم لن تزالوا في صلاة ما انتظرتم الصلاة ‏\"‏ ‏.‏ قال أنس كأني أنظر إلى وبيص خاتمه ‏.‏",
      "text_en": " Humaid said:                     \"Anas bin Malik was asked: 'Did the Prophet wear a ring?' He said: 'Yes.' One night he delayed the 'Isha' prayer until almost the middle of the night. When he had prayed, he turned to face us and said: 'The people have prayed and gone to sleep, but you will still be in a state of prayer so long as you are waiting for the (next) prayer.'\" (Sahih)Anas said: \"It was as if I can see the sparkle from his ring.'\"",
      "chain": [
        "30170",
        "20226",
        "11279"
      ]
    },
    {
      "hadith_no": "784",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو موسى، محمد بن المثنى حدثنا خالد بن الحارث، حدثنا حميد، عن أنس بن مالك، قال أرادت بنو سلمة أن يتحولوا، من ديارهم إلى قرب المسجد فكره النبي  صلى الله عليه وسلم  أن يعروا المدينة فقال ‏\"‏ يا بني سلمة ألا تحتسبون آثاركم ‏\"‏ ‏.‏ فأقاموا ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"Banu Salimah wanted to move from their homes to somewhere near the mosque, but the Prophet did not want the outskirts of Al-madinah to be left vacant, so he said: 'O Banu Salimah, do you not hope for the reward of your footsteps?' So they stayed (where they were).\"",
      "chain": [
        "20226",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "960",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا خالد بن الحارث، عن شعبة، عن عاصم بن عبيد الله، قال سمعت عبد الله بن عامر بن ربيعة، عن أبيه، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ ما من مسلم يصلي على إلا صلت عليه الملائكة ما صلى على فليقل العبد من ذلك أو ليكثر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Asim bin ‘Ubaidullah said:                      “I heard ‘Abdullahbin ‘Amir bin Rabi’ah narrating from his father that the Prophet(ﷺ)said: “There is no Muslim who sends peace and blessings uponme, butthe angels will send peace and blessings upon him as long ashe sendspeace and blessings upon me. So let a person do a little ofthat or alot.”",
      "chain": [
        "34043",
        "20226",
        "20020",
        "19808",
        "709",
        "708"
      ]
    },
    {
      "hadith_no": "1095",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بكر بن خلف، حدثنا خالد بن الحارث، عن شعبة، ح وحدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، أخبرني مخول بن راشد، قال سمعت أبا سعد، - رجلا من أهل المدينة - يقول رأيت أبا رافع مولى رسول الله  صلى الله عليه وسلم  رأى الحسن بن علي وهو يصلي وقد عقص شعره فأطلقه أو نهى عنه وقال نهى رسول الله  صلى الله عليه وسلم  أن يصلي الرجل وهو عاقص شعره ‏.‏",
      "text_en": " Mukhawwal said:                      “I heard Abu Sa’d, a man from the people ofMadinah,say: ‘I saw Abu Rafi’, the freed slave of the Messengerof Allah(ﷺ), when he saw Hasan bin ‘Ali performing prayer, withhis hairbraided. He undid it, or told him not to do that, and said:“TheMessenger of Allah (ﷺ) forbade a man from performing prayerwith hishair braided.”",
      "chain": [
        "34043",
        "20226",
        "20020",
        "30160",
        "20173",
        "20020",
        "11390"
      ]
    },
    {
      "hadith_no": "1408",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن جعفر، حدثنا شعبة، ح وحدثنا أبو بكر بن خلاد، حدثنا خالد بن الحارث، حدثنا شعبة، عن قتادة، عن يزيد بن عبد الله بن الشخير، عن عبد الله بن عمرو، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لم يفقه من قرأ القرآن في أقل من ثلاث ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin ‘Amr that the Messenger of Allah(ﷺ) said:                      “No one properly understands who reads the Qur’an inlessthan three days.”",
      "chain": [
        "30160",
        "20173",
        "20020",
        "30357",
        "20226",
        "20020",
        "11019",
        "11318",
        "29"
      ]
    },
    {
      "hadith_no": "1607",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا خالد بن الحارث، حدثنا سعيد، عن قتادة، حدثني سالم بن أبي الجعد، عن معدان بن أبي طلحة، عن ثوبان، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من صلى على جنازة فله قيراط ومن شهد دفنها فله قيراطان ‏\"‏ ‏.‏ قال فسئل نبي الله  صلى الله عليه وسلم  عن القيراط فقال ‏\"‏ مثل أحد ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Thawban that the Messenger of Allah (ﷺ) said:                     “Whoever offers the funeral prayer will have one Qirat and whoeverattends the burial will have two Qirat.” The Prophet (ﷺ) wasaskedabout the Qirat and he said: “(It is) like Uhud.”",
      "chain": [
        "30430",
        "20226",
        "11168",
        "11019",
        "11342",
        "10878",
        "130"
      ]
    },
    {
      "hadith_no": "1979",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن خلاد الباهلي، حدثنا خالد بن الحارث، حدثنا شعبة، عن قتادة، عن عكرمة، عن ابن عباس، أن النبي  صلى الله عليه وسلم  لعن المتشبهين من الرجال بالنساء ولعن المتشبهات من النساء بالرجال ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas:                     that the Prophet cursed men who imitate women and woman who imitate men.",
      "chain": [
        "30357",
        "20226",
        "20020",
        "11019",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2013",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا حميد بن مسعدة، وأبو بكر بن خلاد قالا حدثنا خالد بن الحارث، حدثنا سعيد، عن قتادة، عن جابر بن زيد، عن ابن عباس، أن رسول الله  صلى الله عليه وسلم  أريد على بنت حمزة بن عبد المطلب فقال ‏\"‏ إنها ابنة أخي من الرضاعة وإنه يحرم من الرضاعة ما يحرم من النسب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas:                     that the Messenger of was offered the daughter of Hamzah bin 'Abdul-Muttalib in marriage, and he said: “She is the daughter of my brother through breastfeeding, and breastfeeding makes unlawful (for marriage) the same things that blood ties make unlawful.”",
      "chain": [
        "30430",
        "30357",
        "20226",
        "11168",
        "11019",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "2118",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، وعبدة بن سليمان، ح وحدثنا حميد بن مسعدة، حدثنا خالد بن الحارث، جميعا عن سعيد بن أبي عروبة، عن قتادة، عن زرارة بن أوفى، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن الله تجاوز لأمتي عما حدثت به أنفسها ما لم تعمل به أو تكلم به ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     the Messenger of  Allah (ﷺ) said: \"Allah has forgiven my nation for what they think of to themselves, so long as they do not act upon it or speak of it.\"",
      "chain": [
        "30201",
        "20345",
        "20337",
        "30430",
        "20226",
        "11073",
        "11019",
        "11284",
        "13"
      ]
    },
    {
      "hadith_no": "2274",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا خالد بن الحارث، حدثنا سعيد، عن قتادة، عن الحسن، عن عقبة بن عامر، أو سمرة بن جندب عن النبي  صلى الله عليه وسلم  قال ‏\"‏ أيما رجل باع بيعا من رجلين فهو للأول منهما ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amir or Samurah bin Jundab that the Messenger of Allah (ﷺ) said:                     \"Any man who sells to two men, it is for the one who was first.\"[1]",
      "chain": [
        "30430",
        "20226",
        "11168",
        "11019",
        "11016",
        "189"
      ]
    },
    {
      "hadith_no": "2362",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا خالد بن الحارث، حدثنا سعيد، عن قتادة، عن سعيد بن المسيب، عن عمر بن الخطاب، قال إن آخر ما نزلت آية الربا وإن رسول الله  صلى الله عليه وسلم  قبض ولم يفسرها لنا فدعوا الربا والريبة ‏.‏",
      "text_en": " It was narrated that 'Umar bin Khattab said:                     \"The last thing to be revealed was the Verse on usury but the Messenger of Allah (ﷺ) died before he had explained it to us. So give up usury (interest) and doubtful things.\"",
      "chain": [
        "30395",
        "20226",
        "11168",
        "11019",
        "11002",
        "3"
      ]
    },
    {
      "hadith_no": "2329",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا خالد بن الحارث، حدثنا سعيد بن أبي عروبة، عن قتادة، عن خلاس، عن أبي رافع، عن أبي هريرة، أنه ذكر أن رجلين، ادعيا دابة ولم يكن بينهما بينة فأمرهما النبي صلى الله عليه وسلم أن يستهما على اليمين ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     he said that two men laid claim to an animal, and neither of them had any proof, so the Prophet (ﷺ) commanded them to cast lots as to which of them should swear an oath.",
      "chain": [
        "30201",
        "20226",
        "11073",
        "11019",
        "11283",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "2334",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا خالد بن الحارث، حدثنا حميد، عن أنس بن مالك، قال كان النبي صلى الله عليه وسلم عند إحدى أمهات المؤمنين فأرسلت أخرى بقصعة فيها طعام فضربت يد الرسول فسقطت القصعة فانكسرت فأخذ رسول الله صلى الله عليه وسلم الكسرتين فضم إحداهما إلى الأخرى فجعل يجمع فيها الطعام ويقول ‏\"‏ غارت أمكم كلوا ‏\"‏ ‏.‏ فأكلوا حتى جاءت بقصعتها التي في بيتها فدفع القصعة الصحيحة إلى الرسول وترك المكسورة في بيت التي كسرتها ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     “The Prophet (ﷺ) was with one of the Mothers of the Believers (his wives) and another (wife) sent a bowl containing food. She (the first wife) struck the hand of the Messenger of (ﷺ) and the bowl fell and broke. The Messenger of Allah (ﷺ) took the two pieces and put them back together, then he started gathering up the food and putting it in (the bowl). He said: 'Your mother was jealous. Eat.' So they ate, and she (the wife who broke the bowl) brought the bowl that was in her house and gave the intact bowl to the Messenger (ﷺ), who left the broken bowl in the house of the one who broke it.”",
      "chain": [
        "30170",
        "20226",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "2505",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا خالد بن الحارث، حدثنا سعيد، عن قتادة، عن سالم بن أبي الجعد، عن معدان بن أبي طلحة، عن ثوبان، - مولى رسول الله صلى الله عليه وسلم - عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ من فارق الروح الجسد وهو بريء من ثلاث دخل الجنة من الكبر والغلول والدين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Thawban, the freed slave of the Messenger of Allah (ﷺ), that the Messenger of Allah (ﷺ) said:                     “Anyone whose soul leaves his body and he is free of three things, will enter Paradise: Arrogance, stealing from the spoils of war, and debt.”",
      "chain": [
        "30430",
        "20226",
        "11168",
        "11019",
        "11342",
        "10878"
      ]
    },
    {
      "hadith_no": "2559",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا خالد بن الحارث، حدثنا سعيد بن أبي عروبة، عن يعلى بن حكيم، عن سليمان بن يسار، عن رافع بن خديج، قال كنا نحاقل على عهد رسول الله صلى الله عليه وسلم فزعم أن بعض عمومته أتاهم فقال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كانت له أرض فلا يكريها بطعام مسمى ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi` bin khadij said:                     We used to give land in return for food at the time of the Messenger of Allah (ﷺ), and some of my paternal uncles came to them and said: “The Messenger of Allah (ﷺ) said: 'Whoever has land, he should not rent it out for a set amount of food.”",
      "chain": [
        "30430",
        "20226",
        "11073",
        "11567",
        "11005",
        "1986"
      ]
    },
    {
      "hadith_no": "2648",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا خالد بن الحارث، أنبأنا سعيد، عن قتادة، عن حبيب بن سالم، قال أتي النعمان بن بشير برجل غشى جارية امرأته فقال لا أقضي فيها إلا بقضاء رسول الله صلى الله عليه وسلم ‏.‏ قال إن كانت أحلتها له جلدته مائة وإن لم تكن أذنت له رجمته ‏.‏",
      "text_en": " It was narrated that Habib bin Salim said:                     “A man who had intercourse with the slave woman of his wife was brought to Nu`man bin Bashir. He said: 'I will pass no other judgement than that of the Messenger of Allah (ﷺ) He said: 'If (his wife) had made her lawful for him, then I will give him one hundred lashes, but if she has not given permission, I will stone him.' ”",
      "chain": [
        "30430",
        "20226",
        "11168",
        "11019",
        "11837"
      ]
    },
    {
      "hadith_no": "2751",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن المثنى أبو موسى، حدثنا خالد بن الحارث، وابن أبي عدي، عن حميد، عن أنس، قال كسرت الربيع عمة أنس ثنية جارية فطلبوا العفو فأبوا فعرض عليهم الأرش فأبوا فأتوا النبي صلى الله عليه وسلم فأمر بالقصاص ‏.‏ فقال أنس بن النضر يا رسول الله تكسر ثنية الربيع والذي بعثك بالحق لا تكسر ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ يا أنس كتاب الله القصاص ‏\"‏ ‏.‏ قال فرضي القوم فعفوا فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن من عباد الله من لو أقسم على الله لأبره ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas said:                     “Rubai, the paternal aunt of Anas, broke the tooth of a girl and they (her family) asked (the girl's family) to let her off, but they refused. They offered to pay compensatory money, but they refused. So they came to Prophet (ﷺ) who ordered retaliation. Anas bin Nadr said: 'O Messenger of Allah (ﷺ), will the tooth of Rubai' be broken? By the One Who sent you with the truth, it will not be broken!' The Prophet (ﷺ) said: 'O Anas, what Allah has decreed is retaliation.' So the people accepted that and forgave her. The Messenger of Allah (ﷺ) said: 'there are among the slaves of Allah those who, if they swear by Allah, Allah fulfills their oath.'”",
      "chain": [
        "30170",
        "20226",
        "20276",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "3265",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا خالد بن الحارث، حدثنا سعيد، عن قتادة، أنه ذكر أنه سمع جرى بن كليب، يحدث أنه سمع عليا، يحدث أن رسول الله  صلى الله عليه وسلم  نهى أن يضحى بأعضب القرن والأذن ‏.‏",
      "text_en": " It wasnarrated from Qatadah that he said that he heard Juray binKulaibnarrate that he heard ‘Ali narrate that the Messenger of Allah(ﷺ) forbade sacrificing animals with broken horns and ears.",
      "chain": [
        "30430",
        "20226",
        "11168",
        "11019",
        "5"
      ]
    },
    {
      "hadith_no": "3760",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا خالد بن الحارث، وابن أبي عدي، عن حميد، قال سئل أنس بن مالك أخضب رسول الله  صلى الله عليه وسلم  قال إنه لم ير من الشيب إلا نحو سبعة عشر أو عشرين شعرة في مقدم لحيته ‏.‏",
      "text_en": " It wasnarrated that Humaid said:                      “Anas bin Malik was asked: ‘Did theMessenger of Allah (ﷺ) dye his hair?’ He said: ‘He did not haveanywhite hair apart from approximately seventeen or twenty hairs atthefront of his beard.’”",
      "chain": [
        "30170",
        "20226",
        "20276",
        "11279"
      ]
    }
  ],
  "total_hadiths": 196
}