{
  "id": "20224",
  "name": "Hmad bin Ms'd'h al-Tmymy حماد بن مسعدة التميمي",
  "full_name": "Hmad bin Ms'd'h al-Tmymy حماد بن مسعدة التميمي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "202",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Tamimi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11450",
      "name": "Yazid bin Abi 'Ubaid يزيد بن أبي عبيد",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20295",
      "name": "Hisham bin Abi 'Abdullah al-Dastawa'i هشام بن أبي عبد الله الدستوائي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11071",
      "name": "'Abdullah bin 'Awn bin Artaban عبد الله بن عون بن أرطبان الخزار",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30457",
      "name": "Ma'la bin Asad al-'Ami معلى بن أسد العمي أبو الهيثم البصري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30153",
      "name": "'Amr bin 'Ali bin Bahr al-Bahli عمرو بن علي بن بحر الباهلي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30160",
      "name": "Muhammad bin Bashar Bindar محمد بن بشار بندار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30524",
      "name": "Harun bin 'Abdullah al-Hamal هارون بن عبد الله بن مروان الحمال",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4318",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن عبد الله، حدثنا حماد بن مسعدة، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، قال غزوت مع النبي صلى الله عليه وسلم سبع غزوات‏.‏ فذكر خيبر والحديبية ويوم حنين ويوم القرد‏.‏ قال يزيد ونسيت بقيتهم‏.‏",
      "text_en": " Narrated Yazid bin Abi Ubaid:                     Salama bin Al-Akwa` said, \"I fought in seven Ghazwat along with the Prophet.\" He then mentioned Khaibar, Al-Hudaibiya, the day (i.e. battle) of Hunain and the day of Al-Qurad. I forgot the names of the other Ghazwat.",
      "chain": [
        "30561",
        "20224",
        "11450",
        "237"
      ]
    },
    {
      "hadith_no": "509",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا إسحاق بن إبراهيم، ومحمد بن المثنى، - واللفظ لابن المثنى - قال إسحاق أخبرنا وقال ابن المثنى، حدثنا حماد بن مسعدة، - عن يزيد، - يعني ابن أبي عبيد - عن سلمة، - وهو ابن الأكوع أنه كان يتحرى موضع مكان المصحف يسبح فيه ‏.‏ وذكر أن رسول الله صلى الله عليه وسلم كان يتحرى ذلك المكان وكان بين المنبر والقبلة قدر ممر الشاة ‏.‏",
      "text_en": " Salama b. Akwa' reported:                      He sought the place (in the mosque) where the copies of the Qur'an were kept and glorified Allah there, and the narrator made a mention that the Messenger of Allah (may peace be upon him) sought that place and that was between the pulpit and the qibla-a place where a goat could pass.",
      "chain": [
        "30123",
        "30170",
        "30312",
        "20224",
        "11450",
        "237"
      ]
    },
    {
      "hadith_no": "1273",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا محمد بن إسحاق المسيبي، حدثني أنس، - يعني ابن عياض - عن موسى بن عقبة، ح وحدثنا هارون بن عبد الله، حدثنا حماد بن مسعدة، عن ابن جريج، ح قال وحدثنا الصلت بن مسعود، حدثنا سفيان بن موسى، عن أيوب، كلهم عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بنحوه ‏.‏",
      "text_en": " A hadith like this has been narrated from the Apostle of Allah (may peace be upon him) on the authority of Ibn 'Umar with another chain of transmitters.",
      "chain": [
        "30413",
        "20157",
        "11106",
        "30524",
        "20224",
        "11070",
        "30435",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2592",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، ح وحدثنا إسحاق، أخبرنا عبدة، ح وحدثنا ابن المثنى، حدثنا حماد بن مسعدة، كلهم عن عبيد الله، بالإسنادين كليهما ‏.‏ نحو حديث ابن نمير ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of 'Ubaidullah on the two chains of transmitters.",
      "chain": [
        "30201",
        "20318",
        "30312",
        "20337",
        "20224"
      ]
    },
    {
      "hadith_no": "4479",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا حماد بن مسعدة، عن ابن عون، قال قال محمد قال عبد الرحمن بن أبي بكرة عن أبيه قال لما كان ذلك اليوم جلس النبي صلى الله عليه وسلم على بعير - قال - ورجل آخذ بزمامه - أو قال بخطامه - فذكر نحو حديث يزيد بن زريع ‏.‏",
      "text_en": " Abu Bakra reported that when it was the day of (Dhu'l-Hijja) Allah's Apostle (may peace be upon him) mounted the camel and addressed and a person had been holding its nosestring. The rest of the hadith is the same.",
      "chain": [
        "30170",
        "20224",
        "11071",
        "11035",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "4930",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثناه إسحاق بن إبراهيم، حدثنا حماد بن مسعدة، حدثنا يزيد، عن سلمة، بمثله ‏.‏",
      "text_en": " The above tradition has also been handed down through a different chain of transmitters.",
      "chain": [
        "30123",
        "20224",
        "20472"
      ]
    },
    {
      "hadith_no": "5131",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا حماد بن مسعدة، وصفوان بن عيسى، ح وحدثنا أبو بكر بن النضر، حدثنا أبو عاصم النبيل، كلهم عن يزيد بن أبي عبيد، بهذا الإسناد ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Yazid b. Abu Ubaid.",
      "chain": [
        "30123",
        "20224",
        "20553",
        "14443",
        "20241"
      ]
    },
    {
      "hadith_no": "5738",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا محمد بن بشار، حدثنا حماد بن مسعدة، حدثنا ابن عون، عن محمد، عن  أنس، بهذه القصة نحو حديث يزيد ‏.‏",
      "text_en": " This hadith has been reported on the authority of Anas through another chain of transmit ters.",
      "chain": [
        "30160",
        "20224",
        "11071",
        "11035"
      ]
    },
    {
      "hadith_no": "1734",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن بشار، حدثنا حماد بن مسعدة، حدثنا ابن أبي ذئب، عن عطاء بن أبي رباح، عن عبيد بن عمير، عن عبد الله بن عباس، أن الناس، في أول الحج كانوا يتبايعون بمنى وعرفة وسوق ذي المجاز ومواسم الحج فخافوا البيع وهم حرم فأنزل الله سبحانه ‏{‏ ليس عليكم جناح أن تبتغوا فضلا من ربكم ‏}‏ في مواسم الحج ‏.‏ قال فحدثني عبيد بن عمير أنه كان يقرأها في المصحف ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The people used to trade, in the beginning, at Mina, Arafat, the market place of Dhul-Majaz, and during the season of hajj. But (later on) they became afraid of trading while they were putting on ihram. So Allah, glory be to Him, sent down this verse: \"It is no sin for you that you seek the bounty of your Lord during the seasons of hajj.\" Ubayd ibn Umayr told me that he (Ibn Abbas) used to recite this verse in his codex.",
      "chain": [
        "30160",
        "20224",
        "20177",
        "11029",
        "11259",
        "17"
      ]
    },
    {
      "hadith_no": "2820",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا حماد بن مسعدة، عن عوف، عن أبي ريحانة، عن ابن عباس، قال نهى رسول الله صلى الله عليه وسلم عن أكل معاقرة الأعراب ‏.‏ قال أبو داود اسم أبي ريحانة عبد الله بن مطر وغندر أوقفه على ابن عباس ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) forbade to eat (the meat of animals) slaughtered by the bedouins for vainglory and pride.Abu Dawud said: The narrator Ghundar narrated this tradition as a saying of Ibn 'Abbas (and not of the Prophet).",
      "chain": [
        "30524",
        "20224",
        "11298",
        "10696",
        "17"
      ]
    },
    {
      "hadith_no": "278",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "قال عبد الله وقال معلى بن أسد حدثنا حماد بن مسعدة، عن محمد بن عجلان، عن محمد بن إبراهيم، عن عامر بن سعد، أن النبي صلى الله عليه وسلم أمر بوضع اليدين فذكر نحوه ولم يذكر فيه عن أبيه ‏.‏ قال أبو عيسى وروى يحيى بن سعيد القطان وغير واحد عن محمد بن عجلان عن محمد بن إبراهيم عن عامر بن سعد أن النبي صلى الله عليه وسلم أمر بوضع اليدين ونصب القدمين ‏.‏ مرسل وهذا أصح من حديث وهيب ‏.‏ وهو الذي أجمع عليه أهل العلم واختاروه ‏.‏",
      "text_en": " (Another chain that) Amir bin Sa'd narrated:                     \"The Prophet ordered placing the hands (on the ground).\" And he mentioned in it: \"From his father.\"",
      "chain": [
        "20025",
        "30457",
        "20224",
        "10616",
        "11213",
        "10554"
      ]
    },
    {
      "hadith_no": "471",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Al-Witr - أَبْوَابُ الْوِتْرِ",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن بشار، حدثنا حماد بن مسعدة، عن ميمون بن موسى المرئي، عن الحسن، عن أمه، عن أم سلمة، أن النبي صلى الله عليه وسلم كان يصلي بعد الوتر ركعتين ‏.‏ قال أبو عيسى وقد روي نحو هذا عن أبي أمامة وعائشة وغير واحد عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Umm Salamah narrated:                     \"The Prophet would pray two Rak'ah after Al-Witr.\"",
      "chain": [
        "30160",
        "20224",
        "24453",
        "11016",
        "10737",
        "56"
      ]
    },
    {
      "hadith_no": "1040",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا عبيد الله بن سعيد، حدثنا حماد بن مسعدة، عن أشعث، عن محمد، عن عبيدة، عن علي، قال نهاني النبي صلى الله عليه وسلم عن القسي والحرير وخاتم الذهب وأن أقرأ وأنا راكع وقال مرة أخرى وأن أقرأ راكعا ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"The Prophet (ﷺ) forbade me from wearing A-Qassi and silk, and gold rings, and from reciting Qur'an when bowing.\"",
      "chain": [
        "30359",
        "20224",
        "11324",
        "20278",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "3446",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا حماد بن مسعدة، قال حدثنا ابن موهب، عن القاسم بن محمد، قال كان لعائشة غلام وجارية قالت فأردت أن أعتقهما فذكرت ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ ابدئي بالغلام قبل الجارية ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Al-Qasim bin Muhammad said:                      \"Aishah had a male slave and a female slave. She said: 'I wanted to set them free, and I mentioned that to the Messenger of Allah. He said: Start with the male slave before the female slave.'\"",
      "chain": [
        "30123",
        "20224",
        "10535"
      ]
    },
    {
      "hadith_no": "3852",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا حماد بن مسعدة، عن حميد، عن ثابت، عن أنس، قال رأى النبي صلى الله عليه وسلم رجلا يهادى بين رجلين فقال ‏\"‏ ما هذا ‏\"‏ ‏.‏ قالوا نذر أن يمشي إلى بيت الله ‏.‏ قال ‏\"‏ إن الله غني عن تعذيب هذا نفسه مره فليركب ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas said:                      \"The Prophet saw a man being supported by two others and said: 'What is this?' They said: 'He vowed to walk to the House of Allah.' He said: 'Allah has no need for this man to torture himself. Tell him to ride.'\"",
      "chain": [
        "30123",
        "20224",
        "11279",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3883",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا الثقة، قال حدثنا حماد بن مسعدة، عن هشام بن أبي عبد الله، عن يحيى بن أبي كثير، عن أبي سلمة، عن جابر بن عبد الله، أن النبي صلى الله عليه وسلم نهى عن المزابنة والمخاضرة وقال ‏‏\"‏‏ المخاضرة بيع الثمر قبل أن يزهو والمخابرة بيع الكرم بكذا وكذا صاع ‏‏\"‏‏‏.‏‏ خالفه عمرو بن أبي سلمة فقال عن أبيه عن أبي هريرة‏.‏‏",
      "text_en": " It was narrated from Jabir bin 'Abdullah that the Prophet forbade Al-Muzabanah and Al-Mukhadarah. He (one of the narrators) said:                      \"Al-Mukhadarah means selling fruit before it ripens and Al-Mukhabarah means selling grapes in return for a certain number of Sa's.\"",
      "chain": [
        "20224",
        "11449",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "4066",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن بشار، حدثني حماد بن مسعدة، قال حدثنا قرة بن خالد، عن حميد بن هلال، عن أبي بردة بن أبي موسى الأشعري، عن أبيه، أن النبي صلى الله عليه وسلم بعثه إلى اليمن ثم أرسل معاذ بن جبل بعد ذلك فلما قدم قال أيها الناس إني رسول رسول الله إليكم ‏.‏ فألقى له أبو موسى وسادة ليجلس عليها فأتي برجل كان يهوديا فأسلم ثم كفر فقال معاذ لا أجلس حتى يقتل قضاء الله ورسوله ‏.‏ ثلاث مرات ‏.‏ فلما قتل قعد ‏.‏",
      "text_en": " It was narrated from Abu Burdah bin Abi Musa Al-Ash'ari, from his father:                     \"That the Prophet [SAW] sent him to Yemen, then he sent Mu'adh bin Jabal after that. When he arrived he said: 'O people, I am the envoy of the Messenger of Allah [SAW] to you.' Abu Musa gave him a cushion to sit down, then a man was brought who had been a Jew, then he became a Muslim, then he reverted to Kufr. Mu'adh said: 'I will not sit down until he is killed; this is the decree of Allah and His Messenger,' (saying it) three times. When he was killed, he sat down.\"",
      "chain": [
        "30160",
        "20224",
        "11301",
        "11281",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "4679",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا حماد بن مسعدة، عن ابن جريج، عن عكرمة بن خالد، قال حدثني أسيد بن حضير بن سماك، أن رسول الله صلى الله عليه وسلم قضى أنه إذا وجدها في يد الرجل غير المتهم فإن شاء أخذها بما اشتراها وإن شاء اتبع سارقه وقضى بذلك أبو بكر وعمر ‏.‏",
      "text_en": " Usaid bin Hudair bin Simak narrated that:                     the Messenger of Allah ruled that if a man found (his goods) in the possession of a man who was not guilty, then if he wished he could give the man what he had paid for it, or if he wished he could go after the one who had stolen it. Abu Bakr and 'Umar passed similar judgments.",
      "chain": [
        "30524",
        "20224",
        "11070",
        "11709",
        "45"
      ]
    },
    {
      "hadith_no": "5183",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا حماد بن مسعدة، عن أشعث، عن محمد، عن عبيدة، عن علي، قال نهاني النبي صلى الله عليه وسلم عن القسي والحرير وخاتم الذهب وأن أقرأ راكعا ‏.‏ خالفه هشام ولم يرفعه ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"The Prophet [SAW] forbade me from Al-Qassi, silk, gold rings, and that I recite Qur'an while bowing.\" Hisham contradicted him, he did not narrate it in Marfu' form.",
      "chain": [
        "30359",
        "20224",
        "11324",
        "20278",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "5489",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا عبد الله بن محمد بن عبد الرحمن، قال حدثنا حماد بن مسعدة، عن هارون بن إبراهيم، عن محمد، عن عثمان بن أبي العاص، أن النبي صلى الله عليه وسلم كان يدعو بهذه الدعوات ‏\"‏ اللهم إني أعوذ بك من الكسل والهرم والجبن والعجز ومن فتنة المحيا والممات ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Uthman bin Abi Al-'As that:                     The Prophet [SAW] used to say supplication in these words: \"Allahumma inni a'udhu bika minal-kasali, walharami, wal-jubni, wal-'ajzi, wa min fitnatil-mahya wal-mamat. (O Allah, I seek refuge in You from laziness, old age, cowardice, and incapacity, and from the trials of life and death.)\"",
      "chain": [
        "20224",
        "20278",
        "3210"
      ]
    },
    {
      "hadith_no": "1251",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا حماد بن مسعدة، حدثنا ميمون بن موسى المرئي، عن الحسن، عن أمه، عن أم سلمة، أن النبي  صلى الله عليه وسلم  كان يصلي بعد الوتر ركعتين خفيفتين وهو جالس ‏.‏",
      "text_en": " It wasnarrated from Umm Salamah that the Prophet (ﷺ) used to praytwoshort Rak’ah after Witr, sitting down.",
      "chain": [
        "30160",
        "20224",
        "24453",
        "11016",
        "10737",
        "56"
      ]
    },
    {
      "hadith_no": "2264",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا يحيى بن حكيم، حدثنا يحيى بن سعيد، وحماد بن مسعدة، عن سليمان التيمي، ح وحدثنا إسحاق بن إبراهيم بن حبيب بن الشهيد، حدثنا معتمر بن سليمان، قال سمعت أبي قال، حدثنا أبو عثمان النهدي، عن عبد الله بن مسعود، قال نهى رسول الله  صلى الله عليه وسلم  عن تلقي البيوع ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Mas'ud said:                     \"The Messenger of Allah (ﷺ) forbade. meeting the owners of goods (away from the market).\"",
      "chain": [
        "34280",
        "20031",
        "20224",
        "11289",
        "34027",
        "20288",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "hadith_no": "2629",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Manumission (of Slaves) - كتاب العتق",
      "chapter_no": "19",
      "text_ar": "حدثنا محمد بن بشار، حدثنا حماد بن مسعدة، ح وحدثنا محمد بن خلف العسقلاني، وإسحاق بن منصور، قالا حدثنا عبيد الله بن عبد المجيد، حدثنا عبيد الله بن عبد الرحمن بن عبد الله بن موهب، عن القاسم بن محمد، عن عائشة، أنها كان لها غلام وجارية زوج فقالت يا رسول الله إني أريد أن أعتقهما ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن أعتقتهما فابدئي بالرجل قبل المرأة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that :                     `Aishah had a male slave and a female slave who were married. She said: “O Messenger of Allah (ﷺ), I want to free them both.” The Messenger of Allah (ﷺ) said: “If you free them, then start with the man before the woman.”",
      "chain": [
        "30160",
        "20224",
        "38502",
        "30313",
        "10535",
        "53"
      ]
    }
  ],
  "total_hadiths": 23
}