{
  "id": "20221",
  "name": "Harmy bin 'Umarah حرمي بن عمارة بن أبي حفصة",
  "full_name": "Harmy bin 'Umarah حرمي بن عمارة بن أبي حفصة",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "201",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ خ  م  د  س  ق  -  صدوق له أوهام ]"
    ],
    "tags": [
      "al-Basri",
      "Client",
      "al-'Atki"
    ]
  },
  "parents": [
    {
      "id": "11711",
      "name": "Amarh bin Abi Hafs'h عمارة بن أبي حفصة",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11301",
      "name": "Qurrah bin Khalid al-Sadusi قرة بن خالد السدوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20551",
      "name": "Shadad bin Sa'id شداد بن سعيد أبو طلحة الراسبي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20561",
      "name": "'Uzra bin Thabit عزرة بن ثابت بن أبي زيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30351",
      "name": "'Abdullah bin Muhammad al-Musandi عبد الله بن محمد المسندي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30160",
      "name": "Muhammad bin Bashar Bindar محمد بن بشار بندار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30426",
      "name": "Ibrahim bin Muhammad bin 'Ar'ara إبراهيم بن محمد بن عرعرة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38562",
      "name": "Muhammad bin 'Amr bin محمد بن عمرو",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "34280",
      "name": "Yahya bin Hakeem al-Maquuam يحيى بن حكيم المقوم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30524",
      "name": "Harun bin 'Abdullah al-Hamal هارون بن عبد الله بن مروان الحمال",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30359",
      "name": "'Ubaidullah bin Sa'id عبيد الله بن سعيد أبو قدامة السرخسي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30153",
      "name": "'Amr bin 'Ali bin Bahr al-Bahli عمرو بن علي بن بحر الباهلي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30145",
      "name": "'Abdullah bin Muhammad bin Abi al-Aswad عبد الله بن محمد بن أبي الأسود",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "25",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن محمد المسندي، قال حدثنا أبو روح الحرمي بن عمارة، قال حدثنا شعبة، عن واقد بن محمد، قال سمعت أبي يحدث، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأن محمدا رسول الله، ويقيموا الصلاة، ويؤتوا الزكاة، فإذا فعلوا ذلك عصموا مني دماءهم وأموالهم إلا بحق الإسلام، وحسابهم على الله ‏\"‏‏.‏",
      "text_en": "      Narrated Ibn 'Umar:                          Allah's Apostle said: \"I have been ordered (by Allah) to fight against     the people until they testify that none has the right to be worshipped     but Allah and that Muhammad is Allah's Apostle, and offer the prayers      perfectly and give the obligatory charity, so if they perform that,      then they save their lives and property from me except for Islamic laws     and then their reckoning (accounts) will be done by Allah.\"",
      "chain": [
        "30351",
        "20221",
        "20020",
        "11544",
        "11217",
        "18"
      ]
    },
    {
      "hadith_no": "880",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا علي، قال حدثنا حرمي بن عمارة، قال حدثنا شعبة، عن أبي بكر بن المنكدر، قال حدثني عمرو بن سليم الأنصاري، قال أشهد على أبي سعيد قال أشهد على رسول الله صلى الله عليه وسلم قال ‏\"‏ الغسل يوم الجمعة واجب على كل محتلم، وأن يستن وأن يمس طيبا إن وجد ‏\"‏‏.‏ قال عمرو أما الغسل فأشهد أنه واجب، وأما الاستنان والطيب فالله أعلم أواجب هو أم لا، ولكن هكذا في الحديث‏.‏ قال أبو عبد الله هو أخو محمد بن المنكدر ولم يسم أبو بكر هذا‏.‏ رواه عنه بكير بن الأشج وسعيد بن أبي هلال وعدة‏.‏ وكان محمد بن المنكدر يكنى بأبي بكر وأبي عبد الله‏.‏",
      "text_en": " Narrated Abu Sa`id:                     I testify that Allah's Apostle said, \"The taking of a bath on Friday is compulsory for every male Muslim who has attained the age of puberty and (also) the cleaning of his teeth with Siwak, and the using of perfume if it is available.\" `Amr (a sub-narrator) said, \"I confirm that the taking of a bath is compulsory, but as for the Siwak and the using of perfume, Allah knows better whether it is obligatory or not, but according to the Hadith it is as above.\")",
      "chain": [
        "5",
        "20221",
        "20020",
        "1544"
      ]
    },
    {
      "hadith_no": "906",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، قال حدثنا حرمي بن عمارة، قال حدثنا أبو خلدة  هو خالد بن دينار  قال سمعت أنس بن مالك، يقول كان النبي صلى الله عليه وسلم إذا اشتد البرد بكر بالصلاة، وإذا اشتد الحر أبرد بالصلاة، يعني الجمعة‏.‏ قال يونس بن بكير أخبرنا أبو خلدة فقال بالصلاة، ولم يذكر الجمعة‏.‏ وقال بشر بن ثابت حدثنا أبو خلدة قال صلى بنا أمير الجمعة ثم قال لأنس  رضى الله عنه  كيف كان النبي صلى الله عليه وسلم يصلي الظهر",
      "text_en": " Narrated Anas bin Malik:                     The Prophet used to offer the prayer earlier if it was very cold; and if it was very hot he used to delay the prayer, i.e. the Jumua prayer.",
      "chain": [
        "30161",
        "20221",
        "11583",
        "19"
      ]
    },
    {
      "hadith_no": "4288",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن بشار، حدثنا حرمي، حدثنا شعبة، قال أخبرني عمارة، عن عكرمة، عن عائشة  رضى الله عنها  قالت ولما فتحت خيبر قلنا الآن نشبع من التمر‏.‏",
      "text_en": " Narrated `Aisha:                     When Khaibar was conquered, we said, \"Now we will eat our fill of dates!\"",
      "chain": [
        "30160",
        "20221",
        "20020",
        "11379",
        "11023",
        "53"
      ]
    },
    {
      "hadith_no": "4897",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا حرمي، حدثنا شعبة، عن قتادة، عن أنس  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ يلقى في النار وتقول هل من مزيد‏.‏ حتى يضع قدمه فتقول قط قط ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"The people will be thrown into the (Hell) Fire and it will say: \"Are there any more (to come)?' (50.30) till Allah puts His Foot over it and it will say, 'Qati! Qati! (Enough Enough!)'\"",
      "chain": [
        "30145",
        "20221",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6418",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا حرمي، حدثنا شعبة، عن قتادة، عن أنس  رضى الله عنه  قال قالت أمي يا رسول الله خادمك أنس ادع الله له‏.‏ قال ‏\"‏ اللهم أكثر ماله وولده، وبارك له فيما أعطيته ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     My mother said, \"O Allah's Apostle! Please invoke Allah on behalf of your servant.\" He said, \"O Allah! Increase his wealth and children, and bestow Your Blessing on whatever You give him.\" a time of distress.",
      "chain": [
        "30145",
        "20221",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6671",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا حرمي بن عمارة، حدثنا شعبة، عن معبد بن خالد، أنه سمع حارثة بن وهب، يقول سمعت النبي صلى الله عليه وسلم وذكر الحوض فقال ‏\"‏ كما بين المدينة وصنعاء ‏\"‏‏.‏",
      "text_en": " Narrated Haritha bin Wahb:                     I heard the Prophet mentioning the Lake-Fount (Al-Kauthar), saying, \"(The width of the Lake-Fount) is equal to the distance between Medina and Sana' (capital of Yemen).\" Haritha said that he heard the Prophet saying that his Lake-Fount would be as large as the distance between Sana' and Medina. Al- Mustaurid said to Haritha, \"Didn't you hear him talking about the vessels?\" He said, \"No.\" Al- Mustaurid said, \"The vessels are seen in it as (numberless as) the stars.\"",
      "chain": [
        "30026",
        "20221",
        "20020",
        "11396",
        "4109"
      ]
    },
    {
      "hadith_no": "7096",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا عبد الله بن محمد الجعفي، حدثنا حرمي بن عمارة، حدثنا قرة بن خالد، عن محمد بن سيرين، قال قال قيس بن عباد كنت في حلقة فيها سعد بن مالك وابن عمر فمر عبد الله بن سلام فقالوا هذا رجل من أهل الجنة‏.‏ فقلت له إنهم قالوا كذا وكذا‏.‏ قال سبحان الله ما كان ينبغي لهم أن يقولوا ما ليس لهم به علم، إنما رأيت كأنما عمود وضع في روضة خضراء، فنصب فيها وفي رأسها عروة وفي أسفلها منصف  والمنصف الوصيف  فقيل ارقه‏.‏ فرقيت حتى أخذت بالعروة‏.‏ فقصصتها على رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ يموت عبد الله وهو آخذ بالعروة الوثقى ‏\"‏‏.‏",
      "text_en": " Narrated Qais bin 'Ubada:                     I was sitting in a gathering in which there was Sa`d bin Malik and Ibn `Umar. `Abdullah bin Salam passed in front of them and they said, \"This man is from the people of Paradise.\" I said to `Abdullah bin Salam, \"They said so-and-so.\" He replied, \"Subhan Allah! They ought not to have said things of which they have no knowledge, but I saw (in a dream) that a post was fixed in a green garden. At the top of the post there was a handhold and below it there was a servant. I was asked to climb (the post). So I climbed it till I got hold of the handhold.\" Then I narrated this dream to Allah's Apostle. Allah's Apostle said, \"`Abdullah will die while still holding the firm reliable handhold (i.e., Islam).",
      "chain": [
        "30351",
        "20221",
        "11301",
        "11035",
        "11609"
      ]
    },
    {
      "hadith_no": "7473",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا ابن أبي الأسود، حدثنا حرمي، حدثنا شعبة، عن قتادة، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ يلقى في النار ‏\"‏‏.‏ وقال لي خليفة حدثنا يزيد بن زريع حدثنا سعيد عن قتادة عن أنس‏.‏ وعن معتمر سمعت أبي عن قتادة عن أنس عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يزال يلقى فيها وتقول هل من مزيد‏.‏ حتى يضع فيها رب العالمين قدمه فينزوي بعضها إلى بعض، ثم تقول قد قد بعزتك وكرمك‏.‏ ولا تزال الجنة تفضل حتى ينشئ الله لها خلقا فيسكنهم فضل الجنة ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"(The people will be thrown into Hell ( Fire) and it will keep on saying, 'Is there any more?' till the Lord of the worlds puts His Foot over it, whereupon its different sides will come close to each other, and it will say, 'Qad! Qad! (enough! enough!) By Your 'Izzat (Honor and Power) and YOUR KARAM (Generosity)!' Paradise will remain spacious enough to accommodate more people until Allah will create some more people and let them dwell in the superfluous space of Paradise. \"",
      "chain": [
        "30145",
        "20221",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1423",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني إبراهيم بن محمد بن عرعرة السامي، حدثنا حرمي بن عمارة، حدثنا شعبة، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، أن رجلا، أتى النبي صلى الله عليه وسلم فسأله عن مواقيت الصلاة فقال ‏\"‏ اشهد معنا الصلاة ‏\"‏ ‏.‏ فأمر بلالا فأذن بغلس فصلى الصبح حين طلع الفجر ثم أمره بالظهر حين زالت الشمس عن بطن السماء ثم أمره بالعصر والشمس مرتفعة ثم أمره بالمغرب حين وجبت الشمس ثم أمره بالعشاء حين وقع الشفق ثم أمره الغد فنور بالصبح ثم أمره بالظهر فأبرد ثم أمره بالعصر والشمس بيضاء نقية لم تخالطها صفرة ثم أمره بالمغرب قبل أن يقع الشفق ثم أمره بالعشاء عند ذهاب ثلث الليل أو بعضه - شك حرمي - فلما أصبح قال ‏\"‏ أين السائل ما بين ما رأيت وقت ‏\"‏ ‏.‏",
      "text_en": " Buraida narrated on the authority of his father that a man came to the Prophet (may peace be upon him) and asked about the times of prayer. He said:                      You observe with us the prayer. He commanded Bilal, and he uttered the call to prayer in the darkness of night preceding daybreak and he said the morning prayer till dawn had appeared. He then commanded him (Bilal) to call for the noon prayer when the sun had declined from the zenith. He then commanded him (Bilal) to call for the afternoon prayer when the sun was high. He then commanded him for the evening prayer when the sun had set. He then commanded him for the night prayer when the twilight had disappeared. Then on the next day he commanded him (to call for prayer) when there was light in the morning. He then commanded him (to call) for the noon prayer when the extreme heat was no more. He then commanded him for the afternoon prayer when the sun was bright and clear and yellowness did not blend with it. He then commanded him to observe the sunset prayer. He then commanded him for the night prayer when a third part of the night bad passed or a bit less than that. Harami (the narrator of this hadith) was in doubt about that part of the mentioned hadith which concerned the portion of the night. When it was dawn, he (the Holy Prophet) said: Where is the inquirer (who inquired about the times of prayer and added): Between (these two extremes) is the time for prayer.",
      "chain": [
        "20221",
        "20020",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "3439",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنيه عبيد الله بن عمر القواريري، حدثني حرمي بن عمارة، حدثنا قرة، عن قتادة، عن أنس، قال نظر رسول الله صلى الله عليه وسلم إلى أحد فقال ‏\"‏ إن أحدا جبل يحبنا ونحبه ‏\"‏ ‏.‏",
      "text_en": "  This hadith is narrated by Anas b. Malik (Allah be pleased with him) with another chain of transmitters (and the words are):                     \" Allah's Messenger (may peace be upon him) cast a glance at Uhud and said: Uhud is a mountain which loves us and we love it.\"",
      "chain": [
        "20221",
        "11301",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6123",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني إبراهيم بن محمد بن عرعرة، حدثنا حرمي بن عمارة، حدثنا شعبة، عن معبد بن خالد، أنه سمع حارثة بن وهب الخزاعي، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏.‏ وذكر الحوض بمثله ولم يذكر قول المستورد وقوله ‏.‏",
      "text_en": " Haritha b. Wahb al-Khuza'i reported Allah's Messeiiger's (may peace be upon him) words concerning the Cistern like it, but he made no mention of the words of Mustaurid.",
      "chain": [
        "30426",
        "20221",
        "20020",
        "11396",
        "4109"
      ]
    },
    {
      "hadith_no": "6537",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن عمرو بن عباد بن جبلة بن أبي رواد، حدثنا حرمي بن عمارة، حدثنا قرة بن خالد، عن محمد بن سيرين، قال قال قيس بن عباد كنت في حلقة فيها سعد بن مالك وابن عمر فمر عبد الله بن سلام فقالوا هذا رجل من أهل الجنة ‏.‏ فقمت فقلت له إنهم قالوا كذا وكذا ‏.‏ قال سبحان الله ما كان ينبغي لهم أن يقولوا ما ليس لهم به علم إنما رأيت كأن عمودا وضع في روضة خضراء فنصب فيها وفي رأسها عروة وفي أسفلها منصف - والمنصف الوصيف - فقيل لي ارقه ‏.‏ فرقيت حتى أخذت بالعروة فقصصتها على رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ يموت عبد الله وهو آخذ بالعروة الوثقى ‏\"‏ ‏.‏",
      "text_en": " Qais b. 'Ubaida reported:                      I was (sitting) in a company in which there were (besides others) Sa'd b. Malik and Ibn 'Umar that 'Abdullah b. Saliim happened to pass (by that side). They (the people sitting in that company) said: He is a person from amongst the dwellers of Paradise. I stood up and said to him: They say such and such (thing about you), whereupon he said: Hallowed be Allah, it is not meet for them to say (anything) of which They have no knowledge. Verily I saw as if a pillar had been raised in a green garden and there had been fixed at its (upper) end a handhold and there was a helper at its base. It was said to me: Climb up. So I climbed up and caught hold of the haildhold. I narrated (the contents of this dream) to Allah's Messenger (may peace be upon him), whereupon he said: 'Abdullah would die in a state that he would be catching hold of the firmest handhold (he would die holding fast to the faith).",
      "chain": [
        "30452",
        "20221",
        "11301",
        "11035",
        "11609"
      ]
    },
    {
      "hadith_no": "7190",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن عمرو بن عباد بن جبلة بن أبي رواد، حدثنا حرمي بن عمارة، حدثنا شداد أبو طلحة الراسبي، عن غيلان بن جرير، عن أبي بردة، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ يجيء يوم القيامة ناس من المسلمين بذنوب أمثال الجبال فيغفرها الله لهم ويضعها على اليهود والنصارى ‏\"‏ ‏.‏ فيما أحسب أنا ‏.‏ قال أبو روح لا أدري ممن الشك ‏.‏ قال أبو بردة فحدثت به عمر بن عبد العزيز فقال أبوك حدثك هذا عن النبي صلى الله عليه وسلم قلت نعم ‏.‏",
      "text_en": " Abu Burda reported Allah's Messenger (may peace be upon him) as saying:                      There would come people amongst the Muslims on the Day of Resurrection with as heavy sins as a mountain, and Allah would forgive them and He would place in their stead the Jews and the Christians. (As far as I think), Abu Raub said: I do not know as to who is in doubt. Abu Burda said: I narrated it to 'Umar b. 'Abd al-'Aziz, whereupon he said: Was it your father who narrated it to you from Allah's Apostle (may peace be upon him)? I said: Yes.",
      "chain": [
        "30452",
        "20221",
        "11300",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1196",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن عمرو بن جبلة بن أبي رواد، حدثني حرمي بن عمارة، عن عبيد الله بن النضر، حدثني أبي قال، كانت ظلمة على عهد أنس بن مالك - قال - فأتيت أنسا فقلت يا أبا حمزة هل كان يصيبكم مثل هذا على عهد رسول الله صلى الله عليه وسلم قال معاذ الله إن كانت الريح لتشتد فنبادر المسجد مخافة القيامة ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     Ubaydullah ibn an-Nadr reported on the authority of his father: Darkness prevailed in the time of Anas ibn Malik, I came to Anas and said (to him): AbuHamzah, did anything like this happen to you in the time of the Messenger of Allah (ﷺ)? He replied: Take refuge in Allah. If the wind blew violently, we would run quickly towards the mosque for fear of the coming of the Day of Judgment.",
      "chain": [
        "30452",
        "20221",
        "24295",
        "14397",
        "19"
      ]
    },
    {
      "hadith_no": "178",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عبيد الله بن سعيد، وهارون بن عبد الله، قالا حدثنا حرمي، - وهو ابن عمارة بن أبي حفصة - قال حدثنا شعبة، عن عمرو بن دينار، قال سمعت يحيى بن جعدة، يحدث عن عبد الله بن عمرو القاري، عن أبي طلحة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ توضئوا مما غيرت النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Talhah that the Messenger of Allah (ﷺ) said:                      \"Perform Wudu' from that which has been altered by fire.\"",
      "chain": [
        "30359",
        "30524",
        "20221",
        "20020",
        "11081",
        "229"
      ]
    },
    {
      "hadith_no": "179",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا حرمي بن عمارة، قال حدثنا شعبة، عن أبي بكر بن حفص، عن ابن شهاب، عن ابن أبي طلحة، عن أبي طلحة، أن النبي صلى الله عليه وسلم قال ‏\"‏ توضئوا مما أنضجت النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Talhah that the Prophet (ﷺ) said:                      \"Perform Wudu' from that which has been heated with fire.\"",
      "chain": [
        "30524",
        "20221",
        "20020",
        "11180",
        "11013",
        "229"
      ]
    },
    {
      "hadith_no": "2040",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال حدثنا حرمي بن عمارة، قال حدثنا شعبة، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، ‏:‏ أن رسول الله صلى الله عليه وسلم كان إذا أتى على المقابر فقال ‏:‏ ‏\"‏ السلام عليكم أهل الديار من المؤمنين والمسلمين، وإنا إن شاء الله بكم لاحقون، أنتم لنا فرط ونحن لكم تبع، أسأل الله العافية لنا ولكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sulaiman bin Buraidah, from his father, that:                     when the Messenger of Allah came to the graveyard he would say: \"As-salamu 'alaykum ahli ad-diyari min al-mu'minin wal-muslimin wa inna I sha' Allahu bikum lana faratun wa nahnu lakum taba'un, as'alullahal-'afiyata lana wa lakum. (Peace by upon the inhabitants of this place among the believers and Muslims. Soon we will join you, if Allah willing. You have gone on ahead of us and we will follow you. I ask Allah to keep us and you safe and sound.)\"",
      "chain": [
        "30359",
        "20221",
        "20020",
        "11374",
        "10916"
      ]
    },
    {
      "hadith_no": "3190",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا حرمي بن عمارة، قال حدثنا شعبة، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ حرمة نساء المجاهدين على القاعدين كحرمة أمهاتهم وإذا خلفه في أهله فخانه قيل له يوم القيامة هذا خانك في أهلك فخذ من حسناته ما شئت فما ظنكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sulaiman bin Buraidah, from his father, that the Messenger of Allah (ﷺ) said:                      \"The sanctity of the wive of the Mujahidin to those who stay behind is like the sanctity of their mothers. If he takes on the responsibility of looking after his wife then betrays him, it will be said to him on the Day of Resurrection: 'This one betrayed you with your wife, so take whatever you want of his good deeds.' So what do you think?\"",
      "chain": [
        "30524",
        "20221",
        "20020",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "391",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا عصمة بن الفضل، ويحيى بن حكيم، قالا حدثنا حرمي بن عمارة بن أبي حفصة، حدثنا حريش بن الخريت، أنبأنا ابن أبي مليكة، عن عائشة، قالت كنت أضع لرسول الله  صلى الله عليه وسلم  ثلاثة آنية من الليل مخمرة إناء لطهوره وإناء لسواكه وإناء لشرابه ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"I used to cover three vessels for the Messenger of Allah at night: A vessel (of water) for his ablution, a vessel for his tooth stick and a vessel for his drink.\"",
      "chain": [
        "34280",
        "20221",
        "11090",
        "53"
      ]
    },
    {
      "hadith_no": "2394",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا عصمة بن الفضل النيسابوري، ومحمد بن فراس أبو هريرة الصيرفي، قالا حدثنا حرمي بن عمارة، حدثنا زربي، إمام مسجد هشام بن حسان حدثنا محمد بن سيرين، عن ابن عمر، رضى الله عنه قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الشاة من دواب الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Messenger of Allah (ﷺ) said:                     \"Sheep are among the animals of Paradise.\"'",
      "chain": [
        "20221",
        "11035",
        "18"
      ]
    },
    {
      "hadith_no": "3538",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا عصمة بن الفضل، حدثنا حرمي بن عمارة بن أبي حفصة، حدثنا حريش بن خريت، أنبأنا ابن أبي مليكة، عن عائشة، قالت كنت أصنع لرسول الله  صلى الله عليه وسلم  ثلاثة آنية من الليل مخمرة إناء لطهوره وإناء لسواكه وإناء لشرابه ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “I used to prepare three coveredvessels for the Messenger of Allah (ﷺ) at night: A vessel for hiswater for purification, a vessel for his tooth stick and a vessel forhis drink.”",
      "chain": [
        "20221",
        "11090",
        "53"
      ]
    }
  ],
  "total_hadiths": 22
}