{
  "id": "20236",
  "name": "Sulaiman bin al-Mughira al-Qaysy سليمان بن المغيرة القيسي مولاهم",
  "full_name": "Sulaiman bin al-Mughira al-Qaysy سليمان بن المغيرة القيسي مولاهم",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "165",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة ثقة ]"
    ],
    "tags": [
      "Client",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11269",
      "name": "Thabit bin Aslam Albanani ثابت بن أسلم البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11281",
      "name": "Hameed bin Hilal حميد بن هلال",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11035",
      "name": "Ibn Sirin محمد بن سيرين الأنصاري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11286",
      "name": "Sa'id bin Iyas al-Jariri سعيد بن إياس الجريري",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20214",
      "name": "Bahz bin Asad al-'Ami",
      "grade": "Thiqah (Trustworthy)"
    },
    {
      "id": "20218",
      "name": "Hiban bin Hilal حبان بن هلال",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20296",
      "name": "Hisham bin 'Abdul Malik al-Tayalasi هشام بن عبد الملك أبو الوليد الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20650",
      "name": "Zayd bin al-Habab al-'Akli زيد بن الحباب أبو الحسين العكلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20426",
      "name": "Shababa bin Sawar شبابة بن سوار الفزاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20250",
      "name": "'Abdul Samad bin 'Abdul Warith bin Sa'id عبد الصمد بن عبد الوارث بن سعيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20443",
      "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20291",
      "name": "al-Nadr bin Shumayl al-Maazni النضر بن شميل المازني أبو الحسن النحوي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20390",
      "name": "Hashim bin al-Qasim bin Muslim هاشم بن القاسم أبو النضر - قيصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20364",
      "name": "Yahya bin Aadm bin Sulaiman يحيى بن آدم بن سليمان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30106",
      "name": "'Affan bin Muslim عفان بن مسلم بن عبد الله الصفار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20404",
      "name": "Aadm bin Abi Iyas آدم بن أبي إياس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20430",
      "name": "'Asim bin 'Ali bin 'Asim عاصم بن علي بن عاصم بن صهيب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20193",
      "name": "Sulaiman bin Harb سليمان بن حرب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20285",
      "name": "Muslim bin Ibrahim al-Azdy مسلم بن إبراهيم الأزدي الفراهيدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20040",
      "name": "Musa bin Isma'il al-Munqari al-Tabudhaki موسى بن إسماعيل المنقري - لتبوذكي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "35094",
      "name": "'Ali bin 'Abdul Hameed علي بن عبد الحميد بن مصعب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20656",
      "name": "Shayban bin Farroukh شيبان بن فروخ / أبي شيبة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20294",
      "name": "Hadba bin Khalid bin al-Aswad هدبة بن خالد بن الأسود",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "111",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني عمرو بن محمد بن بكير الناقد، حدثنا هاشم بن القاسم أبو النضر، حدثنا سليمان بن المغيرة، عن ثابت، عن أنس بن مالك، قال نهينا أن نسأل، رسول الله صلى الله عليه وسلم عن شىء فكان يعجبنا أن يجيء الرجل من أهل البادية العاقل فيسأله ونحن نسمع فجاء رجل من أهل البادية فقال يا محمد أتانا رسولك فزعم لنا أنك تزعم أن الله أرسلك قال ‏\"‏ صدق ‏\"‏ ‏.‏ قال فمن خلق السماء قال ‏\"‏ الله ‏\"‏ ‏.‏ قال فمن خلق الأرض قال ‏\"‏ الله ‏\"‏ ‏.‏ قال فمن نصب هذه الجبال وجعل فيها ما جعل ‏.‏ قال ‏\"‏ الله ‏\"‏ ‏.‏ قال فبالذي خلق السماء وخلق الأرض ونصب هذه الجبال آلله أرسلك قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال وزعم رسولك أن علينا خمس صلوات في يومنا وليلتنا ‏.‏ قال ‏\"‏ صدق ‏\"‏ ‏.‏ قال فبالذي أرسلك آلله أمرك بهذا قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال وزعم رسولك أن علينا زكاة في أموالنا ‏.‏ قال ‏\"‏ صدق ‏\"‏ ‏.‏ قال فبالذي أرسلك آلله أمرك بهذا قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال وزعم رسولك أن علينا صوم شهر رمضان في سنتنا ‏.‏ قال ‏\"‏ صدق ‏\"‏ ‏.‏ قال فبالذي أرسلك آلله أمرك بهذا قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال وزعم رسولك أن علينا حج البيت من استطاع إليه سبيلا ‏.‏ قال ‏\"‏ صدق ‏\"‏ ‏.‏ قال ثم ولى ‏.‏ قال والذي بعثك بالحق لا أزيد عليهن ولا أنقص منهن ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لئن صدق ليدخلن الجنة ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Anas b. Malik that he said:                      We were forbidden that we should ask anything (without the genuine need) from the Holy Prophet. It, therefore, pleased us that an intelligent person from the dwellers of the desert should come and asked him (the Holy Prophet) and we should listen to it. A man from the dwellers of the desert came (to the Holy Prophet) and said: Muhammad, your messenger came to us and told us your assertion that verily Allah had sent you (as a prophet). He (the Holy Prophet) remarked: He told the truth. He (the bedouin) said: Who created the heaven? He (the Holy Prophet) replied: Allah. He (the bedouin again) said: Who created the earth? He (the Holy Prophet) replied: Allah. He (the bedouin again) said: Who raised these mountains and who created in them whatever is created there? He (the Holy Prophet) replied: Allah. Upon this he (the bedouin) remarked: By Him Who created the heaven and created the earth and raised mountains thereupon, has Allah (in fact) sent you? He (the Holy Prophet) said: Yes. He (the bedouin) said: Your messenger also told us that five prayers (had been made) obligatory for us during the day and the night. He (the Holy Prophet) remarked: He told you the truth. He (the bedouin) said: By Him Who sent you, is it Allah Who ordered you about this (i. e. prayers)? He (the Holy Prophet) said: Yes. He (the bedouin) said: Your messenger told us that Zakat had been made obligatory in our riches. He (the Holy Prophet) said. He has told the truth. He (the bedouin) said: By Him Who sent you (as a prophet), is it Allah Who ordered you about it (Zakat)? He (the Holy Prophet) said: Yes. He (the bedouin) said: Your messenger told us that it had been made obligatory for us to fast every year during the month of Ramadan. He (the Holy Prophet) said: He has told the truth. He (the bedouin) said: By Him Who sent you (as a prophet), is it Allah Who ordered you about it (the fasts of Ramadan)? He (the Holy Prophet) said: Yes. He (the bedouin) said: Your messenger also told us that pilgrimage (Hajj) to the House (of Ka'bah) had been made obligatory for him who is able to undertake the journey to it. He (the Holy Prophet) said: Yes. The narrator said that he (the bedouin) set off (at the conclusion of this answer, but at the time of his departure) remarked: 'By Him Who sent you with the Truth, I would neither make any addition to them nor would I diminish anything out of them. Upon this the Holy Prophet remarked: If he were true (to what he said) he must enter Paradise.",
      "chain": [
        "30263",
        "20390",
        "20236",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "112",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني عبد الله بن هاشم العبدي، حدثنا بهز، حدثنا سليمان بن المغيرة، عن ثابت، قال قال أنس كنا نهينا في القرآن أن نسأل رسول الله صلى الله عليه وسلم عن شىء ‏.‏ وساق الحديث بمثله ‏.‏",
      "text_en": " It is narrated on the authority of Thabit that Anas said:                      We were forbidden in the Holy Qur'an that we should ask about anything from the Messenger of Allah (may peace be upon him) and then Anas reported the hadith in similar words.",
      "chain": [
        "30550",
        "20214",
        "20236",
        "11269"
      ]
    },
    {
      "hadith_no": "158",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا سليمان، - يعني ابن المغيرة - قال حدثنا ثابت، عن أنس بن مالك، قال حدثني محمود بن الربيع، عن عتبان بن مالك، قال قدمت المدينة فلقيت عتبان فقلت حديث بلغني عنك قال أصابني في بصري بعض الشىء فبعثت إلى رسول الله صلى الله عليه وسلم أني أحب أن تأتيني فتصلي في منزلي فأتخذه مصلى - قال - فأتى النبي صلى الله عليه وسلم ومن شاء الله من أصحابه فدخل وهو يصلي في منزلي وأصحابه يتحدثون بينهم ثم أسندوا عظم ذلك وكبره إلى مالك بن دخشم قالوا ودوا أنه دعا عليه فهلك وودوا أنه أصابه شر ‏.‏ فقضى رسول الله صلى الله عليه وسلم الصلاة وقال ‏\"‏ أليس يشهد أن لا إله إلا الله وأني رسول الله ‏\"‏ ‏.‏ قالوا إنه يقول ذلك وما هو في قلبه ‏.‏ قال ‏\"‏ لا يشهد أحد أن لا إله إلا الله وأني رسول الله فيدخل النار أو تطعمه ‏\"‏ ‏.‏ قال أنس فأعجبني هذا الحديث فقلت لابني اكتبه فكتبه ‏.‏",
      "text_en": " It is narrated on the authority of 'Itban b. Malik that he came to Medina and said:                      Something had gone wrong with my eyesight. I, therefore, sent (a message to the Holy Prophet): Verily it is my ardent desire that you should kindly grace my house with your presence and observe prayer there so, that I should make that corner a place of worship. He said: The Prophet (may peace be upon him) came there, and those amongst the Companions whom Allah willed also accompanied him. He entered (my place) and offered prayer at my residence and his Companions began to talk amongst themselves (and this conversation centered round hypocrites), and then the conspicuous one, Malik b. Dukhshum was made the target and they wished that he (the Holy Prophet) should curse him and he should die or he should meet some calamity. In the meanwhile the Messenger of Allah (may peace and blessings be upon him) completed his prayer and said: Does Malik b. Dukhshum not testify the fact that there is no god but Allah and verily I am the messenger of Allah. They replied: He makes a profession of it (no doubt) but does not do it out of (sincere) heart. He (the Holy Prophet) said: He who testifies that there is no god but Allah and I am the messenger of Allah would not enter Hell or its (flames) would not consume him. Anas said: This hadith impressed me very much and I told my son to write it down.",
      "chain": [
        "20656",
        "20236",
        "11269",
        "19",
        "5278",
        "251"
      ]
    },
    {
      "hadith_no": "331",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنيه أحمد بن سعيد بن صخر الدارمي، حدثنا حبان، حدثنا سليمان بن المغيرة، عن ثابت، عن أنس، قال لما نزلت ‏{‏ لا ترفعوا أصواتكم فوق صوت النبي‏}‏ ولم يذكر سعد بن معاذ في الحديث ‏.‏",
      "text_en": " This hadith is narrated on the authority of Anas by another chain of transmitters in which there is no mention of Sa'd b. Mu'adh, but the following words are there:                      We observed a man, one of the dwellers of Paradise, walking about amongst us.",
      "chain": [
        "20218",
        "20236",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "430",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني عبد الله بن هاشم العبدي، حدثنا بهز بن أسد، حدثنا سليمان بن المغيرة، حدثنا ثابت، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أتيت فانطلقوا بي إلى زمزم فشرح عن صدري ثم غسل بماء زمزم ثم أنزلت ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the the outhority of Anas b. Malik that the Messenger of Allah (may peace be upon him) said:                      (the angels) came to me and took me to the Zamzam and my heart was opened and washed with the water of Zamzam and then I was left (at my place).",
      "chain": [
        "30550",
        "20214",
        "20236",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "507",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني عمرو الناقد، وزهير بن حرب، قالا حدثنا هاشم بن القاسم، حدثنا سليمان بن المغيرة، عن ثابت، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ آتي باب الجنة يوم القيامة فأستفتح فيقول الخازن من أنت فأقول محمد ‏.‏ فيقول بك أمرت لا أفتح لأحد قبلك ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported:                      The Messenger of Allah (may peace be upon him) said: I will come to the gate of Paradise on the Day of Resurrection. and would seek its opening. and the keeper would say: Who art thou? I would say: Muhammad. He would then say: It is for thee that I have been ordered, and not to open it for anyone before thee.",
      "chain": [
        "30263",
        "30022",
        "20390",
        "20236",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "505",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا سليمان بن المغيرة، حدثنا ابن هلال، - يعني حميدا - قال بينما أنا وصاحب، لي نتذاكر حديثا إذ قال أبو صالح السمان أنا أحدثك، ما سمعت من أبي سعيد، ورأيت، منه قال بينما أنا مع أبي سعيد، يصلي يوم الجمعة إلى شىء يستره من الناس إذ جاء رجل شاب من بني أبي معيط أراد أن يجتاز بين يديه فدفع في نحره فنظر فلم يجد مساغا إلا بين يدى أبي سعيد فعاد فدفع في نحره أشد من الدفعة الأولى فمثل قائما فنال من أبي سعيد ثم زاحم الناس فخرج فدخل على مروان فشكا إليه ما لقي - قال - ودخل أبو سعيد على مروان فقال له مروان ما لك ولابن أخيك جاء يشكوك ‏.‏ فقال أبو سعيد سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا صلى أحدكم إلى شىء يستره من الناس فأراد أحد أن يجتاز بين يديه فليدفع في نحره فإن أبى فليقاتله فإنما هو شيطان ‏\"‏ ‏.‏",
      "text_en": " Abu Salih al-Samman reported:                      I narrate to you what I heard and saw from Abu Sa'id al-Khudri: One day I was with Abu Sa'id and he was saying prayer on Friday turning to a thing which concealed him from the people when a young man from Banu Mu'ait came there and he tried to pass in front of him; he turned him back by striking his chest. He looked about but finding no other way to pass except in front of Abu Sa'id, made a second attempt. He (Abu Sa'id) turned him away by Striking his chest more vigorously than the first stroke. He stood up and had a scuffle with Abu Sa'id. Then the people gathered there He came out and went to Marwan and complained to him what had happened to him. Abu Sa'id too came to Marwan. Marwin said to him: What has happened to you and the son of your brother that he came to complain against you? Abu Sa'id said: I heard from the Messenger of Allah (may peace be upon him) saying: When any one of you prays facing something which conceals him from people and anyone tries to pass in front of him, he should be turned away, but if he refuses, he should be forcibly restrained from it, for he is a devil.",
      "chain": [
        "20656",
        "20236",
        "11161"
      ]
    },
    {
      "hadith_no": "510",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا سليمان بن المغيرة، ح قال وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، ح قال وحدثنا إسحاق بن إبراهيم، أخبرنا وهب بن جرير، حدثنا أبي ح، قال وحدثنا إسحاق، أيضا أخبرنا المعتمر بن سليمان، قال سمعت سلم بن أبي الذيال، ح قال وحدثني يوسف بن حماد المعني، حدثنا زياد البكائي، عن عاصم الأحول، كل هؤلاء عن حميد بن هلال، بإسناد يونس كنحو حديثه ‏.‏",
      "text_en": " This hadith has been transmitted by Humaid b. Hilal on the authority of Yunus.",
      "chain": [
        "20656",
        "20236",
        "30170",
        "30160",
        "20173",
        "20020",
        "30123",
        "20298",
        "11272",
        "20288",
        "30573"
      ]
    },
    {
      "hadith_no": "1594",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا شيبان بن فروخ، حدثنا سليمان، - يعني ابن المغيرة - حدثنا ثابت، عن عبد الله بن رباح، عن أبي قتادة، قال خطبنا رسول الله صلى الله عليه وسلم فقال ‏\"‏ إنكم تسيرون عشيتكم وليلتكم وتأتون الماء إن شاء الله غدا ‏\"‏ ‏.‏ فانطلق الناس لا يلوي أحد على أحد - قال أبو قتادة - فبينما رسول الله صلى الله عليه وسلم يسير حتى ابهار الليل وأنا إلى جنبه - قال - فنعس رسول الله صلى الله عليه وسلم فمال عن راحلته فأتيته فدعمته من غير أن أوقظه حتى اعتدل على راحلته - قال - ثم سار حتى تهور الليل مال عن راحلته - قال - فدعمته من غير أن أوقظه حتى اعتدل على راحلته - قال - ثم سار حتى إذا كان من آخر السحر مال ميلة هي أشد من الميلتين الأوليين حتى كاد ينجفل فأتيته فدعمته فرفع رأسه فقال ‏\"‏ من هذا ‏\"‏ ‏.‏ قلت أبو قتادة ‏.‏ قال ‏\"‏ متى كان هذا مسيرك مني ‏\"‏ ‏.‏ قلت ما زال هذا مسيري منذ الليلة ‏.‏ قال ‏\"‏ حفظك الله بما حفظت به نبيه ‏\"‏ ‏.‏ ثم قال ‏\"‏ هل ترانا نخفى على الناس ‏\"‏ ‏.‏ ثم قال ‏\"‏ هل ترى من أحد ‏\"‏ ‏.‏ قلت هذا راكب ‏.‏ ثم قلت هذا راكب آخر ‏.‏ حتى اجتمعنا فكنا سبعة ركب - قال - فمال رسول الله صلى الله عليه وسلم عن الطريق فوضع رأسه ثم قال ‏\"‏ احفظوا علينا صلاتنا ‏\"‏ ‏.‏ فكان أول من استيقظ رسول الله صلى الله عليه وسلم والشمس في ظهره - قال - فقمنا فزعين ثم قال ‏\"‏ اركبوا ‏\"‏ ‏.‏ فركبنا فسرنا حتى إذا ارتفعت الشمس نزل ثم دعا بميضأة كانت معي فيها شىء من ماء - قال - فتوضأ منها وضوءا دون وضوء - قال - وبقي فيها شىء من ماء ثم قال لأبي قتادة ‏\"‏ احفظ علينا ميضأتك فسيكون لها نبأ ‏\"‏ ‏.‏ ثم أذن بلال بالصلاة فصلى رسول الله صلى الله عليه وسلم ركعتين ثم صلى الغداة فصنع كما كان يصنع كل يوم - قال - وركب رسول الله صلى الله عليه وسلم وركبنا معه - قال - فجعل بعضنا يهمس إلى بعض ما كفارة ما صنعنا بتفريطنا في صلاتنا ثم قال ‏\"‏ أما لكم في أسوة ‏\"‏ ‏.‏ ثم قال ‏\"‏ أما إنه ليس في النوم تفريط إنما التفريط على من لم يصل الصلاة حتى يجيء وقت الصلاة الأخرى فمن فعل ذلك فليصلها حين ينتبه لها فإذا كان الغد فليصلها عند وقتها ‏\"‏ ‏.‏ ثم قال ‏\"‏ ما ترون الناس صنعوا ‏\"‏ ‏.‏ قال ثم قال ‏\"‏ أصبح الناس فقدوا نبيهم فقال أبو بكر وعمر رسول الله صلى الله عليه وسلم بعدكم لم يكن ليخلفكم ‏.‏ وقال الناس إن رسول الله صلى الله عليه وسلم بين أيديكم فإن يطيعوا أبا بكر وعمر يرشدوا ‏\"‏ ‏.‏ قال فانتهينا إلى الناس حين امتد النهار وحمي كل شىء وهم يقولون يا رسول الله هلكنا عطشنا ‏.‏ فقال ‏\"‏ لا هلك عليكم ‏\"‏ ‏.‏ ثم قال ‏\"‏ أطلقوا لي غمري ‏\"‏ ‏.‏ قال ودعا بالميضأة فجعل رسول الله صلى الله عليه وسلم يصب وأبو قتادة يسقيهم فلم يعد أن رأى الناس ماء في الميضأة تكابوا عليها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أحسنوا الملأ كلكم سيروى ‏\"‏ ‏.‏ قال ففعلوا فجعل رسول الله صلى الله عليه وسلم يصب وأسقيهم حتى ما بقي غيري وغير رسول الله صلى الله عليه وسلم - قال - ثم صب رسول الله صلى الله عليه وسلم فقال لي ‏\"‏ اشرب ‏\"‏ ‏.‏ فقلت لا أشرب حتى تشرب يا رسول الله قال ‏\"‏ إن ساقي القوم آخرهم شربا ‏\"‏ ‏.‏ قال فشربت وشرب رسول الله صلى الله عليه وسلم - قال - فأتى الناس الماء جامين رواء ‏.‏ قال فقال عبد الله بن رباح إني لأحدث هذا الحديث في مسجد الجامع إذ قال عمران بن حصين انظر أيها الفتى كيف تحدث فإني أحد الركب تلك الليلة ‏.‏ قال قلت فأنت أعلم بالحديث ‏.‏ فقال ممن أنت قلت من الأنصار ‏.‏ قال حدث فأنتم أعلم بحديثكم ‏.‏ قال فحدثت القوم فقال عمران لقد شهدت تلك الليلة وما شعرت أن أحدا حفظه كما حفظته ‏.‏",
      "text_en": " Abu Qatida reported:                      The Messenger of Allah (way peace be upon him) addressed us and said: You would travel In the evening and the might till (God willing) you would come in the morning to a place of water. So the people travelled (self absorbed) without paying any heed to one another, and the Messenger of Allah (may peace be upon him) also travelled till It was midnight. I was by his side. The Messenger of Allah (may peace be upon him) began to doze and leaned (to one side) of his camel. I came to him and I lent him support without awaking him till he sat poised on his ride. He went on travelling till a major part of the night was over and (he again) leaned (to one side) of his camel. I supported him without awaking him till he sat\" bed on his ride. and then travelled till it was near dawn. He (again) leaned which was far more inclined than the two earlier leanings and he was about to fall down. So I came to him and supported him and he lifted his head and said; Who is this? I said: it is Abu Qatida. He (the Holy Prophet again) said: Since how long have you been travelling along with me like this? I said: I have been travelling in this very state since the night. He said: May Allah protect you, as you have protected His Apostle (from falling down), and again said: Do you see that we are hidden from the people? - and again said: Do you see anyone? I said: Here is a rider. I again said: Here Is another rider till we gathered together and we were seven riders. The Messenger of Allah (may peace be upon him) stepped aside of the highway and placed his head (for sleep and said): Guard for us our prayers. The Messenger of Allah (may peace be upon him) was the first to wake up and the rays of the sun were falling on his back. We got up startled He (the Holy Prophet) said: Ride on So we rode on till the sun had (sufficiently) risen. He then came down from his camel and called for a jug of water which I had with me. There was a little water in that. He performed ablution with that which was less thorough as compared with his usual ablutions and some water of that had been left. He (the Holy Prophet) said to Abu Qatida: Keep a watch over your jug of water; it would have (a miraculous) condition about it. Then Bilal summoned (people) to prayer and then the Messenger of Allah (may peace be upon him) observed two rak'ahs and then said the morning prayer as he said every day. The Messenger of Allah (may peace be upon him) (then) rode on and we rode along with him and some of us whispered to the others saying: How would there be compensation for omission in our prayers? Upon this he (the Apostle of Allah) said: Is there not in me (my life) a model for you? There is no omission in sleeping. The (cognizable) emission is that one should not say prayer (intentionally) till the time of the other prayer comes. So he who did like it (omitted prayer in sleep or due to other unavoidable circumstances) should say prayer when he becomes aware of it and on the next day he should observe it at its prescribed time. He (the Holy Prophet) said: What do you think the people would have done (at this hour)? They would have in the morning found their Apostle missing from amongst them and then Abu Bakr and 'Umar would have told them that the Messenger of Allah (may peace be upon him) must be behind you, he cannot leave you behind (him), but the people said: The Messenger of Allah (may peace be upon him) is ahead of you. So if you had obeyed Abu Bakr and Umar, you would have gone on the right path. So we proceeded on till we came up to the people (from whom we had lagged behind) and the day had considerably risen and everything became hot, and they (the Companions of the Holy Prophet) said: Messenger of Allah, we are dying of thirst. Upon this he (the Holy Prophet) remarked: There is no destruction for you. And again said: Bring that small cup of mine and he then asked for the jug of water to be brought to him. The Messenger of Allah (may peace be upon him) began to pour water (in that small cup) and Abu Qatida gave them to drink. And when the people saw that there was (a little) water in the jug, they fell upon it. Upon this the Messenger of Allah (may peace be upon him) said: Behave well; the water (is enough) to satiate all of you. Then they (the Companions) began to receive (their share of) water with calmness (without showing any anxiety) and the Messenger of Allah (may peace be upon him) began to fill (the cap), and I began to serve them till no one was left except me and the Messenger of Allah (may peace be upon him). He then filled (the cup) with water and said to me: Drink it. I said: Messenger of Allah, I would not drink till you drink. Upon this he said: The server of the people Is the last among them to drink. So I drank and the Messenger of Allah (may peace be upon him) also drank and the people came to the place of water quite happy and satiated. 'Abdullah b. Rabah said: I am going to narrate this hadith in the great mosque, when 'Imran b. Husain said: See, O young man, how will you narrate for I was also one of the riders on that night? I said: So you must be knowing this hadith well. He said: Who are you? I said: I am one of the Ansar. Upon this he said: You narrate, for you know your hadith better. I, therefore, narrated it to the people. 'Imran said: I was also present that night, but I know not anyone else who learnt it so well as you have learnt.",
      "chain": [
        "20656",
        "20236",
        "11269",
        "11865",
        "391"
      ]
    },
    {
      "hadith_no": "2062",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا شيبان بن فروخ، حدثنا سليمان بن المغيرة، حدثنا حميد بن هلال، قال قال أبو رفاعة انتهيت إلى النبي صلى الله عليه وسلم وهو يخطب قال فقلت يا رسول الله رجل غريب جاء يسأل عن دينه لا يدري ما دينه - قال - فأقبل على رسول الله صلى الله عليه وسلم وترك خطبته حتى انتهى إلى فأتي بكرسي حسبت قوائمه حديدا - قال - فقعد عليه رسول الله صلى الله عليه وسلم وجعل يعلمني مما علمه الله ثم أتى خطبته فأتم آخرها ‏.‏",
      "text_en": " Abu Rifa'a reported:                      I came to the Holy Prophet (may peace be upon him) when he was delivering the sermon, and I said: Messenger of Allah, here is a stranger and he wants to learn about this religion and he does not know what this religion is. The Messenger of Allah (may peace be upon him) looked at me and left his sermon till he came to me, and he was given a chair and I thought that Its legs were made of iron. The Messenger of Allah (may peace be upon him) sat In it and he began to teach me what Allah had taught him. He then came (to the pulpit) for his sermon and completed it to the end.",
      "chain": [
        "20656",
        "20236",
        "11281"
      ]
    },
    {
      "hadith_no": "2118",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Rain) - كتاب صلاة الاستسقاء‏",
      "chapter_no": "10",
      "text_ar": "وحدثناه أبو كريب، حدثنا أبو أسامة، عن سليمان بن المغيرة، عن ثابت، عن أنس، بنحوه وزاد فألف الله بين السحاب ومكثنا حتى رأيت الرجل الشديد تهمه نفسه أن يأتي أهله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Anas but with this addition:                     \" Allah gathered the clouds and as we (were obliged) to stay back I saw that even the strong man, impelled by a desire to go to his family, (could not do so).\"",
      "chain": [
        "30216",
        "20318",
        "20236",
        "11269"
      ]
    },
    {
      "hadith_no": "2518",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا سليمان بن المغيرة، حدثنا حميد بن هلال، عن عبد الله بن الصامت، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن بعدي من أمتي - أو سيكون بعدي من أمتي - قوم يقرءون القرآن لا يجاوز حلاقيمهم يخرجون من الدين كما يخرج السهم من الرمية ثم لا يعودون فيه هم شر الخلق والخليقة ‏\"‏ ‏.‏ فقال ابن الصامت فلقيت رافع بن عمرو الغفاري أخا الحكم الغفاري قلت ما حديث سمعته من أبي ذر كذا وكذا فذكرت له هذا الحديث فقال وأنا سمعته من رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Dharr reported Allah's Messenger (may peace be upon him) as saying:                      Verily there would arise from my Ummah after me or soon after me a group (of people) who would recite the Qar'an, but it would not go beyond their throats, and they would pass clean through their religion just as the arrow passes through the prey, and they would never come back to it. They would be the worst among the creation and the creatures. Ibn Samit (one of the narrators) said: I met Rafi' b. 'Amr Ghifari, the brother of Al-Hakam Ghifari and I said: What is this hadith that I heard from Abu Dharr, i. e. so and so? -and then I narrated that hadith to him and said: I heard it from the Messenger of Allah (may peace be upon him).",
      "chain": [
        "20656",
        "20236",
        "11281",
        "10695",
        "23"
      ]
    },
    {
      "hadith_no": "3573",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا شبابة، حدثنا سليمان، عن ثابث، عن أنس، ح وحدثني به عبد الله بن هاشم بن حيان، - واللفظ له - حدثنا بهز، حدثنا سليمان، بن المغيرة عن ثابت، حدثنا أنس، قال صارت صفية لدحية في مقسمه وجعلوا يمدحونها عند رسول الله صلى الله عليه وسلم - قال - ويقولون ما رأينا في السبى مثلها - قال - فبعث إلى دحية فأعطاه بها ما أراد ثم دفعها إلى أمي فقال ‏\"‏ أصلحيها ‏\"‏ ‏.‏ قال ثم خرج رسول الله صلى الله عليه وسلم من خيبر حتى إذا جعلها في ظهره نزل ثم ضرب عليها القبة فلما أصبح قال رسول الله صلى الله عليه وسلم ‏\"‏ من كان عنده فضل زاد فليأتنا به ‏\"‏ ‏.‏ قال فجعل الرجل يجيء بفضل التمر وفضل السويق حتى جعلوا من ذلك سوادا حيسا فجعلوا يأكلون من ذلك الحيس ويشربون من حياض إلى جنبهم من ماء السماء - قال - فقال أنس فكانت تلك وليمة رسول الله صلى الله عليه وسلم عليها - قال - فانطلقنا حتى إذا رأينا جدر المدينة هششنا إليها فرفعنا مطينا ورفع رسول الله صلى الله عليه وسلم مطيته - قال - وصفية خلفه قد أردفها رسول الله صلى الله عليه وسلم - قال - فعثرت مطية رسول الله صلى الله عليه وسلم فصرع وصرعت قال فليس أحد من الناس ينظر إليه ولا إليها حتى قام رسول الله صلى الله عليه وسلم فسترها - قال - فأتيناه فقال ‏\"‏ لم نضر ‏\"‏ ‏.‏ قال فدخلنا المدينة فخرج جواري نسائه يتراءينها ويشمتن بصرعتها ‏.‏",
      "text_en": " Anas, (Allah be pleased with him) reported:                      Safiyya (Allah be pleased with her) fell to the lot of Dihya in the spoils of war, and they praised her in the presence of Allah's Messenger (may peace be upon him) and said: We have not seen the like of her among the captives of war. He sent (a messenger) to Dihya and he gave him whatever he demanded. He then sent her to my mother and asked her to embellish her. Allah's Messenger (may peace be upon him) then got out of Khaibar until when he was on the other side of it, he halted, and a tent was pitched for him. When it was morning Allah's Messenger (may peace be upon him) said: He who has surplus of provision with him should bring that to us. Some persons would bring the surplus of dates, and the other surplus of mush of barley until there became a heap of bals. They began to eat the hais and began to drink out of the pond which had the water of rainfall in it and which was situated by their side. Anas said that that constituted the wedding feast of Allah's Messenger (may peace be upon him). He (further) said: We proceeded until we saw the walls of Medina, and we were delighted. We made our mounts run quickly and Allah's Messenger (may peace be upon him) also made his mount run quickly. And Safiyya (Allah be pleased with her) was at his back, and Allah's Messenger (may peace be upon him) had seated her behind him. The camel of Allah's Messenger (may peace be upon him) stumbled and he (the Holy Prophet) fell down and she also fell down. And none among the people was seeing him and her, until Allah's Messeuger (may peace be upon him) stood up and he covered her, and we came to him and he said: We have received no injury. We entered Medina and there came out the young ladies of the household. They saw her (hadrat Safiyya) and blamed her for falling down.",
      "chain": [
        "30201",
        "20426",
        "20160",
        "19",
        "20214",
        "20236",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3575",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن حاتم بن ميمون، حدثنا بهز، ح وحدثني محمد بن رافع، حدثنا أبو النضر، هاشم بن القاسم قالا جميعا حدثنا سليمان بن المغيرة، عن ثابت، عن أنس، وهذا حديث بهز قال لما انقضت عدة زينب قال رسول الله صلى الله عليه وسلم لزيد ‏\"‏ فاذكرها على ‏\"‏ ‏.‏ قال فانطلق زيد حتى أتاها وهى تخمر عجينها قال فلما رأيتها عظمت في صدري حتى ما أستطيع أن أنظر إليها أن رسول الله صلى الله عليه وسلم ذكرها فوليتها ظهري ونكصت على عقبي فقلت يا زينب أرسل رسول الله صلى الله عليه وسلم يذكرك ‏.‏ قالت ما أنا بصانعة شيئا حتى أوامر ربي ‏.‏ فقامت إلى مسجدها ونزل القرآن وجاء رسول الله صلى الله عليه وسلم فدخل عليها بغير إذن قال فقال ولقد رأيتنا أن رسول الله صلى الله عليه وسلم أطعمنا الخبز واللحم حين امتد النهار فخرج الناس وبقي رجال يتحدثون في البيت بعد الطعام فخرج رسول الله صلى الله عليه وسلم واتبعته فجعل يتتبع حجر نسائه يسلم عليهن ويقلن يا رسول الله كيف وجدت أهلك قال فما أدري أنا أخبرته أن القوم خرجوا أو أخبرني - قال - فانطلق حتى دخل البيت فذهبت أدخل معه فألقى الستر بيني وبينه ونزل الحجاب قال ووعظ القوم بما وعظوا به ‏.‏ زاد ابن رافع في حديثه ‏{‏ لا تدخلوا بيوت النبي إلا أن يؤذن لكم إلى طعام غير ناظرين إناه‏}‏ إلى قوله ‏{‏ والله لا يستحيي من الحق‏}‏",
      "text_en": " Anas (Allah be pleased with him) reported:                      When the 'Iddah of Zainab was over, Allah's Messenger (may peace be upon him) said to Zaid to make a mention to her about him. Zaid went on until he came to her and she was fermenting her flour. He (Zaid) said: As I saw her I felt in my heart an idea of her greatness so much so that I could not see towards her (simply for the fact) that Allah's Messenger (may peace be upon him) had made a mention of her. So I turned my back towards her. and I turned upon my heels, and said: Zainab, Allah's Messenger (may peace be upon him) has sent (me) with a message to you. She said: I do not do anything until I solicit the will of my Lord. So she stood at her place of worship and the (verse of) the Qur'an (pertaining to her marriage) were revealed, and Allah's Messenger (may peace be upon him) came to her without permission. He (the narrator) said: I saw that Allah's Messenger (may peace be upon him) served us bread and meat until it was broad day light and the people went away, but some persons who were busy in con- versation stayed on in the house after the meal. Allah's Messenger (may peace be upon him) also went out and I also followed him, and he began to visit the apartments of his wives greeting them (with the words): As-Salamu 'alaikum, and they would say: Allah's Messenger, how did you find your family (hadrat Zainab)? He (the narrator) stated: I do not know whether I had informed him that the people had gone out or he (the Holy Prophet) informed me (about that). He moved on until he entered the apartment, and I also went and wanted to enter (the apartment) along with him, but he threw a curtain between me and him, as (the verfes pertaining to seclusion) had been revealed, and people were instructed in what they had been instructed. Ibn Rafii had made this addition in his narration:\" O you who believe, enter not the houses of the Prophet unless permission is given to you for a meal, not waiting for its cooking being finished...\" to the words\"... Allah forbears not from the truth.\"",
      "chain": [
        "30514",
        "20214",
        "30375",
        "20390",
        "20236",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3701",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شبابة بن سوار، حدثنا سليمان بن المغيرة، عن ثابت، عن أنس، قال كان للنبي صلى الله عليه وسلم تسع نسوة فكان إذا قسم بينهن لا ينتهي إلى المرأة الأولى إلا في تسع فكن يجتمعن كل ليلة في بيت التي يأتيها فكان في بيت عائشة فجاءت زينب فمد يده إليها فقالت هذه زينب ‏.‏ فكف النبي صلى الله عليه وسلم يده ‏.‏ فتقاولتا حتى استخبتا وأقيمت الصلاة فمر أبو بكر على ذلك فسمع أصواتهما فقال اخرج يا رسول الله إلى الصلاة واحث في أفواههن التراب ‏.‏ فخرج النبي صلى الله عليه وسلم فقالت عائشة الآن يقضي النبي صلى الله عليه وسلم صلاته فيجيء أبو بكر فيفعل بي ويفعل ‏.‏ فلما قضى النبي صلى الله عليه وسلم صلاته أتاها أبو بكر فقال لها قولا شديدا وقال أتصنعين هذا.",
      "text_en": " Anas (Allah be pleased with him) reported that Allah's Apostle (may peace be upon him) had ninewives. So when he divided (his stay) with them, the turn of the first wife did not come but on the ninth (day). They (all the wives) used to gather every night in the house of one where he had to come (and stay that night). It was (the night when he had to stay) in the house of 'A'isha (Allah be pleased with her), when Zainab came there. He (the Holy Prophet) stretched his hand towards her (Zainab), whereupon she ('A'isha) said:                      It is Zainab. Allah's Apostle (may peace be upon him) withdrew his hand. There was an altercation between the two until their voices became loud (and it was at that time) when Iqama was pronounced for prayer. There happened to come Abu Bakr and he heard their voices and said: Messenger of Allah, (kindly) come for prayer, and throw dust in their moths. So the Prophet (may peace be upon him) went out. 'A'isha said: When Allah's Apostle (may peace be upon him) would finish his prayer there would also come Abu Bakr and he would do as he does (on such occasions, i. e. reprimanding). When Allah's Apostle (may peace be upon him) had finished his prayer, there came to her Abu Bakr. and spoke to her ('A'isha) in stern words and said: Do you behave like this?",
      "chain": [
        "30201",
        "20426",
        "20236",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "4704",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا سليمان، - يعني ابن المغيرة - حدثنا حميد، بن هلال عن عبد الله بن مغفل، قال أصبت جرابا من شحم يوم خيبر - قال - فالتزمته فقلت لا أعطي اليوم أحدا من هذا شيئا - قال - فالتفت فإذا رسول الله صلى الله عليه وسلم متبسما ‏.‏",
      "text_en": " It has been narrated on the authority of Abdullah b. Mughaffal who said I found a bag containing fat on the day of the Battle of Khaibar. I caught hold of it and said:                      I will not give anything today from it to anybody. Then I turned round and saw that the Messenger of Allah (may peace be upon him) was smiling (at my words).",
      "chain": [
        "20656",
        "20236",
        "11281",
        "3242"
      ]
    },
    {
      "hadith_no": "4722",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا سليمان بن المغيرة، حدثنا ثابت البناني، عن عبد الله بن رباح، عن أبي هريرة، قال وفدت وفود إلى معاوية وذلك في رمضان فكان يصنع بعضنا لبعض الطعام فكان أبو هريرة مما يكثر أن يدعونا إلى رحله فقلت ألا أصنع طعاما فأدعوهم إلى رحلي فأمرت بطعام يصنع ثم لقيت أبا هريرة من العشي فقلت الدعوة عندي الليلة فقال سبقتني ‏.‏ قلت نعم ‏.‏ فدعوتهم فقال أبو هريرة ألا أعلمكم بحديث من حديثكم يا معشر الأنصار ثم ذكر فتح مكة فقال أقبل رسول الله صلى الله عليه وسلم حتى قدم مكة فبعث الزبير على إحدى المجنبتين وبعث خالدا على المجنبة الأخرى وبعث أبا عبيدة على الحسر فأخذوا بطن الوادي ورسول الله صلى الله عليه وسلم في كتيبة - قال - فنظر فرآني فقال ‏\"‏ أبو هريرة ‏\"‏ ‏.‏ قلت لبيك يا رسول الله ‏.‏ فقال ‏\"‏ لا يأتيني إلا أنصاري ‏\"‏ ‏.‏ زاد غير شيبان فقال ‏\"‏ اهتف لي بالأنصار ‏\"‏ ‏.‏ قال فأطافوا به ووبشت قريش أوباشا لها وأتباعا ‏.‏ فقالوا نقدم هؤلاء فإن كان لهم شىء كنا معهم ‏.‏ وإن أصيبوا أعطينا الذي سئلنا فقال رسول الله صلى الله عليه وسلم ‏\"‏ ترون إلى أوباش قريش وأتباعهم ‏\"‏ ‏.‏ ثم قال بيديه إحداهما على الأخرى ثم قال ‏\"‏ حتى توافوني بالصفا ‏\"‏ ‏.‏ قال فانطلقنا فما شاء أحد منا أن يقتل أحدا إلا قتله وما أحد منهم يوجه إلينا شيئا - قال - فجاء أبو سفيان فقال يا رسول الله أبيحت خضراء قريش لا قريش بعد اليوم ‏.‏ ثم قال ‏\"‏ من دخل دار أبي سفيان فهو آمن ‏\"‏ ‏.‏ فقالت الأنصار بعضهم لبعض أما الرجل فأدركته رغبة في قريته ورأفة بعشيرته ‏.‏ قال أبو هريرة وجاء الوحى وكان إذا جاء الوحى لا يخفى علينا فإذا جاء فليس أحد يرفع طرفه إلى رسول الله صلى الله عليه وسلم حتى ينقضي الوحى فلما انقضى الوحى قال رسول الله صلى الله عليه وسلم ‏\"‏ يا معشر الأنصار ‏\"‏ ‏.‏ قالوا لبيك يا رسول الله قال ‏\"‏ قلتم أما الرجل فأدركته رغبة في قريته ‏\"‏ ‏.‏ قالوا قد كان ذاك ‏.‏ قال ‏\"‏ كلا إني عبد الله ورسوله هاجرت إلى الله وإليكم والمحيا محياكم والممات مماتكم ‏\"‏ ‏.‏ فأقبلوا إليه يبكون ويقولون والله ما قلنا الذي قلنا إلا الضن بالله وبرسوله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله ورسوله يصدقانكم ويعذرانكم ‏\"‏ ‏.‏ قال فأقبل الناس إلى دار أبي سفيان وأغلق الناس أبوابهم - قال - وأقبل رسول الله صلى الله عليه وسلم حتى أقبل إلى الحجر فاستلمه ثم طاف بالبيت - قال - فأتى على صنم إلى جنب البيت كانوا يعبدونه - قال - وفي يد رسول الله صلى الله عليه وسلم قوس وهو آخذ بسية القوس فلما أتى على الصنم جعل يطعنه في عينه ويقول ‏\"‏ جاء الحق وزهق الباطل ‏\"‏ ‏.‏ فلما فرغ من طوافه أتى الصفا فعلا عليه حتى نظر إلى البيت ورفع يديه فجعل يحمد الله ويدعو بما شاء أن يدعو ‏.‏",
      "text_en": "  It has been narrated by 'Abdullah b. Rabah from Abu Huraira, who said:                      Many deputations came to Mu'awiya. This was in the month of Ramadan. We would prepare food for one another. Abu Huraira was one of those who frequently invited us to his house. I said: Should I not prepare food and invite them to my place? So I ordered meals to be prepared Then I met Abu Huraira in the evening and said: (You will have) your meals with me tonight. He said: You have forestalled me. I said: Yes, and invited them. (When they had finished with the meals) Abu Huraira said: Should I not tell yon a tradition from your traditions, O ye assembly of the Ansar? He then gave an account of the Conquest of Mecca and said: The Messenger of Allah (may peace be upon him) advanced until he reached Mecca. He deputed Zubair on his right flank and Khalid on the left, and he despatched Abu Ubaida with the force that had no armour. They advanced to the interior of the valley. The Messenger of Allah (may peace be upon him) was in the midst of a large contingent of fighters. He saw me and said: Abu Huraira. I said: I am here at your call, Messenger of Allah I He said: Let no one come to me except the Ansar, so call to me the Ansar (only). Abu Huraira continued: So they gathered round him. The Quraish also gathered their ruffians and their (lowly) followers, and said: We send these forward. If they get anything, we shall be with them (to share it), and if misfortune befalls them, we shall pay (as compensation) whatever we are asked for. The Messenger of Allah (may peace be upon him) said (to the Ansar): You see the ruffians and the (lowly) followers of the Quraish. And he indicated by (striking) one of his hands over the other that they should be killed and said: Meet me at as-Safa. Then we went on (and) if any one of us wanted that a certain person should be killed, he was killed, and none could offer any resistance. Abu Huraira continued: Then came Abu Sufyan and said: Messenger of Allah, the blood of the Quraish has become very cheap. There will be no Quraish from this day on. Then he (the Holy Prophet) said: Who enters the house of Abu Sufyan, he will be safe. Some of the Ansar whispered among themselves: (After all), love for his city and tenderness towards his relations have overpowered him. Abu Huraira said: (At this moment) revelation came to the Holy Prophet (may peace be upon him) and when he was going to receive the Revelation, we understood it, and when he was (actually) receiving it, none of us would dare raise his eyes to the Messenger of Allah (may peace be upon him) until the revelation came to an end. When the revelation came to an end, the Messenger of Allah (may peace be upon him) said: O ye Assembly of the Ansar! They said: Here we are at your disposal, Messenger of Allah. He said: You were saying that love for his city and tenderness towards his people have overpowered this man. They said: So it was. He said: No, never. I am a bondman of God and His Messenger. I migrated towards God and towards you. I will live with you and will die with you. So, they (the Ansar) turned towards him in tears and they were saying: By Allah, we said what we said because of our tenacious attachment to Allah and His Messenger. The Messenger of Allah (may peace be upon him) said: Surely, Allah and His Messenger testify to your assertions and accept your apology. The narrator continued: People turned to the house of Abu Sufyan and people locked their doors. The Messenger of Allah (may peace be upon him) proceeded until he approached the (Black) Stone. He kissed it and circumambulated the Ka'ba. He reached near an idol by the side of the Ka'ba which was worshipped by the people. The Messenger of Allah (may peace be upon him) had a bow in his hand, and he was holding it from a corner. When he came near the idol, he began to pierce its eyes with the bow and (while doing so) was saying: Truth has been established and falsehood has perished. When he had finished the circumambulation, he came to Safa', ascended it to a height from where he could see the Ka'ba, raised his hands (in prayer) and began to praise Allah and prayed what he wanted to pray.",
      "chain": [
        "20656",
        "20236",
        "11269",
        "11865",
        "13"
      ]
    },
    {
      "hadith_no": "4723",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنيه عبد الله بن هاشم، حدثنا بهز، حدثنا سليمان بن المغيرة، بهذا الإسناد وزاد في الحديث ثم قال بيديه إحداهما على الأخرى ‏\"‏ احصدوهم حصدا ‏\"‏ ‏.‏ وقال في الحديث قالوا قلنا ذاك يا رسول الله قال ‏\"‏ فما اسمي إذا كلا إني عبد الله ورسوله ‏\"‏ ‏.‏",
      "text_en": " The tradition has been narrated by a different chain of transmitters with the following additions:                      (i) Then be (the Messenger of Allah) said with his hands one upon the other: Kill them (who stand in your way).... (ii) They (the Ansar) replied: We said so, Messenger of Allah! He said: What is my name? I am but Allah's bondman and His Messenger.",
      "chain": [
        "20214",
        "20236"
      ]
    },
    {
      "hadith_no": "5024",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر بن النضر بن أبي النضر، وهارون بن عبد الله، ومحمد بن رافع، وعبد بن حميد - وألفاظهم متقاربة - قالوا حدثنا هاشم بن القاسم، حدثنا سليمان، - وهو ابن المغيرة - عن ثابت، عن أنس بن مالك، قال بعث رسول الله صلى الله عليه وسلم بسيسة عينا ينظر ما صنعت عير أبي سفيان فجاء وما في البيت أحد غيري وغير رسول الله صلى الله عليه وسلم قال لا أدري ما استثنى بعض نسائه قال فحدثه الحديث قال فخرج رسول الله صلى الله عليه وسلم فتكلم فقال ‏\"‏ إن لنا طلبة فمن كان ظهره حاضرا فليركب معنا ‏\"‏ ‏.‏ فجعل رجال يستأذنونه في ظهرانهم في علو المدينة فقال ‏\"‏ لا إلا من كان ظهره حاضرا ‏\"‏ ‏.‏ فانطلق رسول الله صلى الله عليه وسلم وأصحابه حتى سبقوا المشركين إلى بدر وجاء المشركون فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا يقدمن أحد منكم إلى شىء حتى أكون أنا دونه ‏\"‏ ‏.‏ فدنا المشركون فقال رسول الله صلى الله عليه وسلم ‏\"‏ قوموا إلى جنة عرضها السموات والأرض ‏\"‏ ‏.‏ قال يقول عمير بن الحمام الأنصاري يا رسول الله جنة عرضها السموات والأرض قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال بخ بخ ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما يحملك على قولك بخ بخ ‏\"‏ ‏.‏ قال لا والله يا رسول الله إلا رجاءة أن أكون من أهلها ‏.‏ قال ‏\"‏ فإنك من أهلها ‏\"‏ ‏.‏ فأخرج تمرات من قرنه فجعل يأكل منهن ثم قال لئن أنا حييت حتى آكل تمراتي هذه إنها لحياة طويلة - قال - فرمى بما كان معه من التمر ‏.‏ ثم قاتلهم حتى قتل ‏.‏",
      "text_en": " It has been reported on the authority of Anas b. Malik who said:                      The Messenger of Allah (may peace be upon him) sent Busaisah as a scout to see what the caravan of Abu Sufyan was doing. He came (back and met the Holy Prophet in his house) where there was nobody except myself and the Messenger of Allah. I do not remember whether he (Hadrat Anas) made an exception of some wives of the Holy Prophet (may peace be upon him) or not and told him the news of the caravan. (Having heard the news), the Messenger of Allah (may peace be upon him) came out (hurriedly), spoke to the people and said: We are in need (of men) ; whoever has an animal to ride upon ready with him should ride with us. People began to ask him permission for bringing their riding animals which were grazing on the hillocks near Medina. He said: No. (I want) only those who have their riding animals ready. So the Messenger of Allah (may peace be upon him) and his Companions proceeded towards Badr and reached there forestalling the polytheists (of Mecca). When the polytheists (also) reached there, the Messenger of Allah (may peace be upon him) said: None of you should step forward to (do) anything unless I am ahead of him. The polytheists (now) advanced (towards us), and the Messenger of Allah (may peace be upon him) said. Get up to enter Paradise which is equal in width to the heavens and the earth. 'Umair b. al- Humam al-Ansari said: Messenger of Allah, is Paradise equal in extent to the heavens and the earth? He said: Yes. 'Umair said: My goodness! The Messenger of Allah (may peace be upon him) asked him: What prompted you to utter these words (i. e. my goodness! ')? He said: Messenger of Allah, nothing but the desire that I be among its residents. He said: Thou art (surely) amona its residents. He took out dates from his bag and began to eat them. Then he said: If I were to live until I have eaten all these dates of mine, it would be a long life. (The narrator said): He threw away all the dates he had with him. Then he fought the enemies until he was killed.",
      "chain": [
        "30528",
        "30524",
        "30375",
        "20390",
        "20236",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "5027",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا بهز، حدثنا سليمان بن المغيرة، عن ثابت، قال قال أنس عمي الذي سميت به لم يشهد مع رسول الله صلى الله عليه وسلم بدرا - قال - فشق عليه قال أول مشهد شهده رسول الله صلى الله عليه وسلم غيبت عنه وإن أراني الله مشهدا فيما بعد مع رسول الله صلى الله عليه وسلم ليراني الله ما أصنع - قال - فهاب أن يقول غيرها - قال - فشهد مع رسول الله صلى الله عليه وسلم يوم أحد - قال - فاستقبل سعد بن معاذ فقال له أنس يا أبا عمرو أين فقال واها لريح الجنة أجده دون أحد - قال - فقاتلهم حتى قتل - قال - فوجد في جسده بضع وثمانون من بين ضربة وطعنة ورمية - قال - فقالت أخته عمتي الربيع بنت النضر فما عرفت أخي إلا ببنانه ‏.‏ ونزلت هذه الآية ‏{‏ رجال صدقوا ما عاهدوا الله عليه فمنهم من قضى نحبه ومنهم من ينتظر وما بدلوا تبديلا‏}‏ قال فكانوا يرون أنها نزلت فيه وفي أصحابه ‏.‏",
      "text_en": " It has been Deported on the authority of Anas who said:                      My uncle and I have been named after him was not present with the Messenger of Allah (mav peace be upon him) on the Day of Badr. He felt distressed about it. He would say: I have missed the first battle fought by the Messenger of Allah (may peace be upon him), and if God now gives me an opportunity to see a battlefield with the Messenger of Allah (may peace be upon him), God will see what I do therein. He was afraid to say more than this (lest he be unable to keep his word with God). He was present with the Messenger of Allah (may peace be upon him) on the Day of Uhud. He met Sa'd b. Mu'adh (who was retreating). Anas said to him: O Abu 'Amr, where (are you going)? Woe (to thee)! I find the smell of Paradise beside the Uhud mountain. (Reprimanding Sa'd in these words) he went forward and fought thein (the enemy) until he was killed. (The narrator says). More than eighty wounds inflicted with swords, spears and arrows were found on his body. His sister, my aunt, ar-Rubayyi', daughter of Nadr, said: I could not recognise my brother's body (it was so badly mutilated) except from his finger-tips. (It was on this occasion that) the Qur'anic verse:\" Among the Believers are men who have been true to their covenant with God. Of them some have completed their vow (to the extreme), and some still wait: but they have never changed (their determination) in the least\" (xxxiii. 23). The narrator said that the verse had been revealed about him (Anas b. Nadr) and his Companions.",
      "chain": [
        "38487",
        "20214",
        "20236",
        "11269"
      ]
    },
    {
      "hadith_no": "5447",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن العلاء أبو كريب، حدثنا أبو أسامة، عن سليمان بن المغيرة، عن  ثابت، عن أنس، قال دعا رسول الله صلى الله عليه وسلم رجل فانطلقت معه فجيء بمرقة فيها دباء فجعل رسول الله صلى الله عليه وسلم يأكل من ذلك الدباء ويعجبه - قال - فلما رأيت ذلك جعلت ألقيه إليه ولا أطعمه ‏.‏ قال فقال أنس فما زلت بعد يعجبني الدباء ‏.‏",
      "text_en": " Anas b. Malik reported that a person invited Allah's Messenger (may peace be upon him) to a meal. I also went along with him. He brought soup containing pumpkin. Allah's 'messenger (may peace be upon him) ate that pumpkin with relish. He (Anas) said:                      When I saw that I began to place it before him, and did not eat it (myself). Anas said: It was since then that pumpkin was always my favourite (food).",
      "chain": [
        "30216",
        "20318",
        "20236",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "5483",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شبابة بن سوار، حدثنا سليمان بن المغيرة، عن ثابت، عن عبد الرحمن بن أبي ليلى، عن المقداد، قال أقبلت أنا وصاحبان، لي وقد ذهبت أسماعنا وأبصارنا من الجهد فجعلنا نعرض أنفسنا على أصحاب رسول الله صلى الله عليه وسلم فليس أحد منهم يقبلنا فأتينا النبي صلى الله عليه وسلم فانطلق بنا إلى أهله فإذا ثلاثة أعنز فقال النبي صلى الله عليه وسلم ‏\"‏ احتلبوا هذا اللبن بيننا ‏\"‏ ‏.‏ قال فكنا نحتلب فيشرب كل إنسان منا نصيبه ونرفع للنبي صلى الله عليه وسلم نصيبه - قال - فيجيء من الليل فيسلم تسليما لا يوقظ نائما ويسمع اليقظان - قال - ثم يأتي المسجد فيصلي ثم يأتي شرابه فيشرب فأتاني الشيطان ذات ليلة وقد شربت نصيبي فقال محمد يأتي الأنصار فيتحفونه ويصيب عندهم ما به حاجة إلى هذه الجرعة فأتيتها فشربتها فلما أن وغلت في بطني وعلمت أنه ليس إليها سبيل - قال - ندمني الشيطان فقال ويحك ما صنعت أشربت شراب محمد فيجيء فلا يجده فيدعو عليك فتهلك فتذهب دنياك وآخرتك ‏.‏ وعلى شملة إذا وضعتها على قدمى خرج رأسي وإذا وضعتها على رأسي خرج قدماى وجعل لا يجيئني النوم وأما صاحباى فناما ولم يصنعا ما صنعت - قال - فجاء النبي صلى الله عليه وسلم فسلم كما كان يسلم ثم أتى المسجد فصلى ثم أتى شرابه فكشف عنه فلم يجد فيه شيئا فرفع رأسه إلى السماء فقلت الآن يدعو على فأهلك ‏.‏ فقال ‏\"‏ اللهم أطعم من أطعمني وأسق من أسقاني ‏\"‏ ‏.‏ قال فعمدت إلى الشملة فشددتها على وأخذت الشفرة فانطلقت إلى الأعنز أيها أسمن فأذبحها لرسول الله صلى الله عليه وسلم فإذا هي حافلة وإذا هن حفل كلهن فعمدت إلى إناء لآل محمد صلى الله عليه وسلم ما كانوا يطمعون أن يحتلبوا فيه - قال - فحلبت فيه حتى علته رغوة فجئت إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ أشربتم شرابكم الليلة ‏\"‏ ‏.‏ قال قلت يا رسول الله اشرب ‏.‏ فشرب ثم ناولني فقلت يا رسول الله اشرب ‏.‏ فشرب ثم ناولني فلما عرفت أن النبي صلى الله عليه وسلم قد روي وأصبت دعوته ضحكت حتى ألقيت إلى الأرض - قال - فقال النبي صلى الله عليه وسلم ‏\"‏ إحدى سوآتك يا مقداد ‏\"‏ ‏.‏ فقلت يا رسول الله كان من أمري كذا وكذا وفعلت كذا ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ما هذه إلا رحمة من الله أفلا كنت آذنتني فنوقظ صاحبينا فيصيبان منها ‏\"‏ ‏.‏ قال فقلت والذي بعثك بالحق ما أبالي إذا أصبتها وأصبتها معك من أصابها من الناس ‏.‏",
      "text_en": " Miqdad reported:                      I and two of my companions were so much afflicted by hunger that we had lost our power of seeing and hearing. We presented ourselves (as guests) to the Companions of the Holy Prophet (may peace be upon him), but none amongst them would entertain us. So we came to Allah's Apostle (may peace be upon him), and he took us to his residence and there were three goats. Allah's Apostle (may peace be upon him) said: Milk these for us. So we milked them and every person amongst us drank his share and we set aside the share of Allah's Apostle (may peace be upon him). (It was his habit) to come during the night and greet (the people present there) in a manner that would not wake up one in sleep but make one who was awake hear it. He would then go to the mosque and say prayer, then go to the milk and drink it. Miqdad added: One night the Satan came to me when I had taken my share, and he said: Muhammad has gone to the Ansar, who would offer him hospitality and he would get what is with them, and he has no need for this draught (of milk). So I took (that milk) and drank it, and when it had penetrated deeply in my stomach and I was certain that there was no way out (but to digest it), the Satan aroused (my sense of) remorse and said: Woe be to thee! what have you done? You have taken the drink reserved for Muhammad! When he would come and he would not find it, he would curse you, and you would be ruined, and thus there would go (waste) this world and the Hereafter (for) you. There was a sheet over me; as I placed (pulled) it upon my feet, my head was uncovered and as I placed it upon my head, my feet were uncovered, and I could not sleep, but my two companions had gone to sleep for they had not done what I had done. There came Allah's Apostle (may peace be upon him), and he greeted as he used to greet (by saying as-Salamu 'Alaikum). He then came to the mosque and observed prayer and then came to his drink (milk) and uncovered it, but did not find anything in it. He raised his head towards the sky, and I said (to myself) that he (the Holy Prophet) was going to invoke curse upon me and I would be thus ruined; but he (the Holy Prophet) said: Allah, feed him who fed me and give drink to him who provided me drink. I held tight the sheet upon myself (and when he had supplicated), I took hold of the knife and went to the goats (possessed by the Holy Prophet) so that I may slauhter one for Allah's Messenger (may peace be upon him) which was the fattest amongst them, and in fact all of them were milch goats; then I took hold of the vessel which belonged to the family of Allah's Messenger (may peace be upon him) in which they used to milk and drink therefrom, and milked them in that until it swelled up with foam. I came to Allah's Messenger (may peace be upon him) and he said: Have you taken your share of the milk during the night? I said: Drink it. and he drank it; he then handed over (the vessel) to me and I said: Allah's Messenger, drink it, and he drank it and handed over (the vessel) to me again, I then perceived that Allah's Apostle (may peace be upon him) had been satiated and I had got his blessings. I burst into laughter (so much) so that I fell upon the ground, whereupon Allah's Messenger (may peace be upon him) said: Miqdad, it must be one of your mischiefs. I said: Allah's Messenger, this affair of mind is like this and this. and I have done so. Thereupon. Allah's Apostle (may peace be upon him) said: This is nothing but a mercy from Allah. Why is it that you did not give me an opportunity so that we should have awakened our two friends and they would have got their share (of the milk)? I said: By Him Who has sent you with Truth. I do not mind whatever you give (to them), and whatever the (other) people happen to get, when I had got it along with you from among the people.",
      "chain": [
        "30201",
        "20426",
        "20236",
        "11269",
        "11196",
        "163"
      ]
    },
    {
      "hadith_no": "5563",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا سليمان بن المغيرة، حدثنا حميد، عن أبي بردة،قال دخلت على عائشة فأخرجت إلينا إزارا غليظا مما يصنع باليمن وكساء من التييسمونها الملبدة - قال - فأقسمت بالله إن رسول الله صلى الله عليه وسلم قبض فيهذين الثوبين ‏.‏",
      "text_en": " Abu Burda reported:                      I visited A'isha and she brought out for us the coarse lower garfnent (of Allah's Messenger) made in Yemen and clothes made out of Mulabbada cloth, and she swore in the name of Allah that Allah's Messenger (may peace be upon him) died in these two clothes.",
      "chain": [
        "20656",
        "20236",
        "11279"
      ]
    },
    {
      "hadith_no": "6167",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا هداب بن خالد، وشيبان بن فروخ، كلاهما عن سليمان، - واللفظ لشيبان - حدثنا سليمان بن المغيرة، حدثنا ثابت البناني، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ولد لي الليلة غلام فسميته باسم أبي إبراهيم ‏\"‏ ‏.‏ ثم دفعه إلى أم سيف امرأة قين يقال له أبو سيف فانطلق يأتيه واتبعته فانتهينا إلى أبي سيف وهو ينفخ بكيره قد امتلأ البيت دخانا فأسرعت المشى بين يدى رسول الله صلى الله عليه وسلم فقلت يا أبا سيف أمسك جاء رسول الله صلى الله عليه وسلم ‏.‏ فأمسك فدعا النبي صلى الله عليه وسلم بالصبي فضمه إليه وقال ما شاء الله أن يقول ‏.‏ فقال أنس لقد رأيته وهو يكيد بنفسه بين يدى رسول الله صلى الله عليه وسلم فدمعت عينا رسول الله صلى الله عليه وسلم فقال ‏\"‏ تدمع العين ويحزن القلب ولا نقول إلا ما يرضى ربنا والله يا إبراهيم إنا بك لمحزونون ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported that Allah's Messenger (may peace be upon him) said:                      A child was born into me this night and I named him after the name of my father Ibrihim. He then sent him to Umm Saif, the wife of a blacksmith who was called Abu Saif. He (the Holy Prophet) went to him and I followed him until we reached Abu Saif and he was blowing fire with the help of blacksmith's bellows and the house was filled with smoke. I hastened my step and went ahead of Allah's Messenger (may peace be upon him) and said: Abu Saif, stop it, as there comes Allah's Messenger (may peace he upon him). He stopped and Allah's Apostle (may peace be upon him) called for the child. He embraced him and said what Allah had desired. Anas said: I saw that the boy breathed his last in the presence of Allah's Messenger (may peace be upon him). The eyes of Allah's Messenger (may peace be upon him) shed tears and he said: Ibrahim, our eyes shed tears and our hearts are filled with grief, but we do not say anything except that by which Allah is pleased. O Ibrahim, we are grieved for you.",
      "chain": [
        "20656",
        "20236",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "6187",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا مجاهد بن موسى، وأبو بكر بن النضر بن أبي النضر وهارون بن عبد الله جميعا عن أبي النضر، قال أبو بكر حدثنا أبو النضر، - يعني هاشم بن القاسم - حدثنا سليمان بن المغيرة، عن ثابت، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم إذا صلى الغداة جاء خدم المدينة بآنيتهم فيها الماء فما يؤتى بإناء إلا غمس يده فيها فربما جاءوه في الغداة الباردة فيغمس يده فيها ‏.‏",
      "text_en": " Anas b. Malik reported that when Allah's Messenger (may peace be upon him) had completed his dawn prayer, the servants of Medina came to him with utensils containing water, and no utensil was brought in which he did not dip his hand; and sometime they came in the cold dawn (and he did not feel reluctant in acceding to their request even in the cold weather) and dipped his hand in them.",
      "chain": [
        "30521",
        "30283",
        "20436",
        "20390",
        "20236",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "6199",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني زهير بن حرب، - واللفظ له - حدثنا هاشم، - يعني ابن القاسم - حدثنا سليمان، - وهو ابن المغيرة - عن ثابت، قال أنس ما شممت عنبرا قط ولا مسكا ولا شيئا أطيب من ريح رسول الله صلى الله عليه وسلم ولا مسست شيئا قط ديباجا ولا حريرا ألين مسا من رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Anas reported:                      I never smelt ambergris or musk as fragrant as the fragrance of the body of Allah's Messenger (may peace be upon him) and I never touched brocade or silk and found it as soft as the body of Allah's Messenger (may peace be upon him).",
      "chain": [
        "30022",
        "20390",
        "20236",
        "11269"
      ]
    },
    {
      "hadith_no": "6471",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا أبو أسامة، عن سليمان بن المغيرة، عن  ثابت، عن أنس، قال انطلق رسول الله صلى الله عليه وسلم إلى أم أيمن فانطلقت معه فناولته إناء فيه شراب - قال - فلا أدري أصادفته صائما أو لم يرده فجعلت تصخب عليه وتذمر عليه ‏.‏",
      "text_en": " Anas reported that Allah's Messenger (may peace be upon him) went to Umm Aiman and I went along with him and she served him a drink in a vessel and he reported that the narrator said:                      I do not know whether it was because of the fasting (or for any other reason) that he (the Holy Prophet) refused to accept that. She raised her voice and showed annoyance to him.",
      "chain": [
        "30216",
        "20318",
        "20236",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "6472",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا زهير بن حرب، أخبرني عمرو بن عاصم الكلابي، حدثنا سليمان بن المغيرة، عن ثابت، عن أنس، قال قال أبو بكر رضى الله عنه بعد وفاة رسول الله صلى الله عليه وسلم لعمر انطلق بنا إلى أم أيمن نزورها كما كان رسول الله صلى الله عليه وسلم يزورها ‏.‏ فلما انتهينا إليها بكت فقالا لها ما يبكيك ما عند الله خير لرسوله صلى الله عليه وسلم ‏.‏ فقالت ما أبكي أن لا أكون أعلم أن ما عند الله خير لرسوله صلى الله عليه وسلم ولكن أبكي أن الوحى قد انقطع من السماء ‏.‏ فهيجتهما على البكاء فجعلا يبكيان معها ‏.‏",
      "text_en": " Anas reported that after the death of Allah's Messenger (may peace be upon him) Abu Bakr said to 'Umar:                      Let us visit Umm Aiman as Allah's Messenger (may peace be upon him) used to visit her. As we came to her, she wept. They (Abu Bakr and Umar) said to her: What makes you weep? What is in store (in the next world) for Allah's-Messenger (may peace be upon him) is better than (this worldly life). She said: I weep not because I am ignorant of the fact that what is in store for Allah's Messenger (may peace be upon him) (in the next world) is better than (this world), but I weep because the revelation which came from the Heaven has ceased to come. This moved both of them to tears and they began to weep along with her.",
      "chain": [
        "30022",
        "20267",
        "20236",
        "11269",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "6476",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني محمد بن حاتم بن ميمون، حدثنا بهز، حدثنا سليمان بن المغيرة، عن ثابت، عن أنس، قال مات ابن لأبي طلحة من أم سليم فقالت لأهلها لا تحدثوا أبا طلحة بابنه حتى أكون أنا أحدثه - قال - فجاء فقربت إليه عشاء فأكل وشرب - فقال - ثم تصنعت له أحسن ما كان تصنع قبل ذلك فوقع بها فلما رأت أنه قد شبع وأصاب منها قالت يا أبا طلحة أرأيت لو أن قوما أعاروا عاريتهم أهل بيت فطلبوا عاريتهم ألهم أن يمنعوهم قال لا ‏.‏ قالت فاحتسب ابنك ‏.‏ قال فغضب وقال تركتني حتى تلطخت ثم أخبرتني بابني ‏.‏ فانطلق حتى أتى رسول الله صلى الله عليه وسلم فأخبره بما كان فقال رسول الله صلى الله عليه وسلم ‏\"‏ بارك الله لكما في غابر ليلتكما ‏\"‏ ‏.‏ قال فحملت - قال - فكان رسول الله صلى الله عليه وسلم في سفر وهي معه وكان رسول الله صلى الله عليه وسلم إذا أتى المدينة من سفر لا يطرقها طروقا فدنوا من المدينة فضربها المخاض فاحتبس عليها أبو طلحة وانطلق رسول الله صلى الله عليه وسلم - قال - يقول أبو طلحة إنك لتعلم يا رب إنه يعجبني أن أخرج مع رسولك إذا خرج وأدخل معه إذا دخل وقد احتبست بما ترى - قال - تقول أم سليم يا أبا طلحة ما أجد الذي كنت أجد انطلق ‏.‏ فانطلقنا - قال - وضربها المخاض حين قدما فولدت غلاما فقالت لي أمي يا أنس لا يرضعه أحد حتى تغدو به على رسول الله صلى الله عليه وسلم ‏.‏ فلما أصبح احتملته فانطلقت به إلى رسول الله صلى الله عليه وسلم - قال - فصادفته ومعه ميسم فلما رآني قال ‏\"‏ لعل أم سليم ولدت ‏\"‏ ‏.‏ قلت نعم ‏.‏ فوضع الميسم - قال - وجئت به فوضعته في حجره ودعا رسول الله صلى الله عليه وسلم بعجوة من عجوة المدينة فلاكها في فيه حتى ذابت ثم قذفها في في الصبي فجعل الصبي يتلمظها - قال - فقال رسول الله صلى الله عليه وسلم ‏\"‏ انظروا إلى حب الأنصار التمر ‏\"‏ ‏.‏ قال فمسح وجهه وسماه عبد الله ‏.‏",
      "text_en": " Anas reported that the son of Abu Talba who was born of Umm Sulaim died. She (Umm Sulaim) said to the members of her family:                      Do not narrate to Abu Talha about his son until I narrate it to him. Abu Talha came (home) ; she presented to him the supper. He took it and drank water. She then embellished herself which she did not do before. He (Abu Talha) had a sexual intercourse with her and when she saw that he was satisfied after sexual intercourse with her, she said: Abu Talha, if some people borrow something from another family and then (the members of the family) ask for its return, would they resist its return? He said: No. She said: I inform you about the death of your son. He was annoyed, and said: You did not inform me until I had a sexual intercourse with you and you later on gave me information about my son. He went to Allah's Messenger (may peace be upon him) and informed him what had happened. Thereupon Allah's Messenger (may peace be upon him) said: May Allah bless both of you in the night spent by you! He (the narrator) said: She became pregnant. Allah's Messenger (may peace he upon him) was in the course of a journey and she was along with him and when Allah's Messenger (may peace be upon him) came back to Medina from the journey he did not enter (his house) (during the night). When the people came near Medina, she felt the pangs of delivery. He (Abu Talha) remained with her and Allah's Messenger (may peace be upon him) proceeded on. Abu Talha said: O Lord, you know that I love to go along with Allah's Messenger when he goes out and enter along with him when he enters and I have been detained as Thou seest. Umm Sulaim said: Abu Talha, I do not feel (so much pain) as I was feeling formerly, so better proceed on. So we proceeded on and she felt the pangs of delivery as they reached (Medina) and a child was born and my mother said to me: Anas, none should suckle him until you go to Allah's Messenger (may peace be upon him) tomorrow morning. And when it was morning I carried him (the child) and went along with him to Allah's Messenger (may peace beupon him). He said: I saw that he had in his hand the instrument for the cauterisation of the camels. When he saw me. he said: This is, perhaps, what Umm Sulaim has given birth to. I said: Yes. He laid down that instrument on the ground. I brought that child to him and placed it in his lap and Allah's Messenger (may peace be upon him) asked Ajwa dates of Medina to be brought and softened them in his month. When these had become palatable he placed them in the mouth of that child. The child began to taste them. Then Allah's Messenger (may peace be upon him) said: See what love the Ansar have for dates. He then wiped his face and named him 'Abdullah.",
      "chain": [
        "30514",
        "20214",
        "20236",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "6477",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أحمد بن الحسن بن خراش، حدثنا عمرو بن عاصم، حدثنا سليمان بن، المغيرة حدثنا ثابت، حدثني أنس بن مالك، قال مات ابن لأبي طلحة ‏.‏ واقتص الحديث بمثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Anas b. Malik through another chain of transmitters.",
      "chain": [
        "30495",
        "20267",
        "20236",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "6513",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا هداب بن خالد الأزدي، حدثنا سليمان بن المغيرة، أخبرنا حميد بن هلال، عن عبد الله بن الصامت، قال قال أبو ذر خرجنا من قومنا غفار وكانوا يحلون الشهر الحرام فخرجت أنا وأخي أنيس وأمنا فنزلنا على خال لنا فأكرمنا خالنا وأحسن إلينا فحسدنا قومه فقالوا إنك إذا خرجت عن أهلك خالف إليهم أنيس فجاء خالنا فنثا علينا الذي قيل له فقلت له أما ما مضى من معروفك فقد كدرته ولا جماع لك فيما بعد ‏.‏ فقربنا صرمتنا فاحتملنا عليها وتغطى خالنا ثوبه فجعل يبكي فانطلقنا حتى نزلنا بحضرة مكة فنافر أنيس عن صرمتنا وعن مثلها فأتيا الكاهن فخير أنيسا فأتانا أنيس بصرمتنا ومثلها معها - قال - وقد صليت يا ابن أخي قبل أن ألقى رسول الله صلى الله عليه وسلم بثلاث سنين ‏.‏ قلت لمن قال لله ‏.‏ قلت فأين توجه قال أتوجه حيث يوجهني ربي أصلي عشاء حتى إذا كان من آخر الليل ألقيت كأني خفاء حتى تعلوني الشمس ‏.‏ فقال أنيس إن لي حاجة بمكة فاكفني ‏.‏ فانطلق أنيس حتى أتى مكة فراث على ثم جاء فقلت ما صنعت قال لقيت رجلا بمكة على دينك يزعم أن الله أرسله ‏.‏ قلت فما يقول الناس قال يقولون شاعر كاهن ساحر ‏.‏ وكان أنيس أحد الشعراء ‏.‏ قال أنيس لقد سمعت قول الكهنة فما هو بقولهم ولقد وضعت قوله على أقراء الشعر فما يلتئم على لسان أحد بعدي أنه شعر والله إنه لصادق وإنهم لكاذبون ‏.‏ قال قلت فاكفني حتى أذهب فأنظر ‏.‏ قال فأتيت مكة فتضعفت رجلا منهم فقلت أين هذا الذي تدعونه الصابئ فأشار إلى فقال الصابئ ‏.‏ فمال على أهل الوادي بكل مدرة وعظم حتى خررت مغشيا على - قال - فارتفعت حين ارتفعت كأني نصب أحمر - قال - فأتيت زمزم فغسلت عني الدماء وشربت من مائها ولقد لبثت يا ابن أخي ثلاثين بين ليلة ويوم ما كان لي طعام إلا ماء زمزم فسمنت حتى تكسرت عكن بطني وما وجدت على كبدي سخفة جوع - قال - فبينا أهل مكة في ليلة قمراء إضحيان إذ ضرب على أسمختهم فما يطوف بالبيت أحد وامرأتين منهم تدعوان إسافا ونائلة - قال - فأتتا على في طوافهما فقلت أنكحا أحدهما الأخرى - قال - فما تناهتا عن قولهما - قال - فأتتا على فقلت هن مثل الخشبة غير أني لا أكني ‏.‏ فانطلقتا تولولان وتقولان لو كان ها هنا أحد من أنفارنا ‏.‏ قال فاستقبلهما رسول الله صلى الله عليه وسلم وأبو بكر وهما هابطان قال ‏\"‏ ما لكما ‏\"‏ ‏.‏ قالتا الصابئ بين الكعبة وأستارها قال ‏\"‏ ما قال لكما ‏\"‏ ‏.‏ قالتا إنه قال لنا كلمة تملأ الفم ‏.‏ وجاء رسول الله صلى الله عليه وسلم حتى استلم الحجر وطاف بالبيت هو وصاحبه ثم صلى فلما قضى صلاته قال أبو ذر ‏.‏ فكنت أنا أول من حياه بتحية الإسلام - قال - فقلت السلام عليك يا رسول الله ‏.‏ فقال ‏\"‏ وعليك ورحمة الله ‏\"‏ ‏.‏ ثم قال ‏\"‏ من أنت ‏\"‏ ‏.‏ قال قلت من غفار - قال - فأهوى بيده فوضع أصابعه على جبهته فقلت في نفسي كره أن انتميت إلى غفار ‏.‏ فذهبت آخذ بيده فقدعني صاحبه وكان أعلم به مني ثم رفع رأسه ثم قال ‏\"‏ متى كنت ها هنا ‏\"‏ ‏.‏ قال قلت قد كنت ها هنا منذ ثلاثين بين ليلة ويوم قال ‏\"‏ فمن كان يطعمك ‏\"‏ ‏.‏ قال قلت ما كان لي طعام إلا ماء زمزم ‏.‏ فسمنت حتى تكسرت عكن بطني وما أجد على كبدي سخفة جوع قال ‏\"‏ إنها مباركة إنها طعام طعم ‏\"‏ ‏.‏ فقال أبو بكر يا رسول الله ائذن لي في طعامه الليلة ‏.‏ فانطلق رسول الله صلى الله عليه وسلم وأبو بكر وانطلقت معهما ففتح أبو بكر بابا فجعل يقبض لنا من زبيب الطائف وكان ذلك أول طعام أكلته بها ثم غبرت ما غبرت ثم أتيت رسول الله صلى الله عليه وسلم فقال ‏\"‏ إنه قد وجهت لي أرض ذات نخل لا أراها إلا يثرب فهل أنت مبلغ عني قومك عسى الله أن ينفعهم بك ويأجرك فيهم ‏\"‏ ‏.‏ فأتيت أنيسا فقال ما صنعت قلت صنعت أني قد أسلمت وصدقت ‏.‏ قال ما بي رغبة عن دينك فإني قد أسلمت وصدقت ‏.‏ فأتينا أمنا فقالت ما بي رغبة عن دينكما فإني قد أسلمت وصدقت ‏.‏ فاحتملنا حتى أتينا قومنا غفارا فأسلم نصفهم وكان يؤمهم إيماء بن رحضة الغفاري وكان سيدهم ‏.‏ وقال نصفهم إذا قدم رسول الله صلى الله عليه وسلم المدينة أسلمنا ‏.‏ فقدم رسول الله صلى الله عليه وسلم المدينة فأسلم نصفهم الباقي وجاءت أسلم فقالوا يا رسول الله إخوتنا نسلم على الذي أسلموا عليه ‏.‏ فأسلموا فقال رسول الله صلى الله عليه وسلم ‏\"‏ غفار غفر الله لها وأسلم سالمها الله ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Samit reported that Abu Dharr said:                      We set out from our tribe Ghafir who look upon the prohibited months as permissible months. I and my brother Unais and our mother stayed with our maternal uncle who treated us well. The men of his tribe fell jealous and they said: When you are anay from your house, Unais commits adultery with your wife. Our -naternal uncle came and he accused us of the sin which was conveyed to him. I said: You have undone the good you did to us. We cannot stay with you after this. We came to our camels and loaded (our) luggage. Our maternal uncle began to weep covering himself with (a piece of) cloth. We proceeded on until we encamped by the side of Mecca. Unais cast lot on the camels (we had) and an equal number (above that). They both went to a Kahin and he made Unais win and Unais came with our camels and an equal number along with them. He (Abu Dharr) said: My nephew, I used to observe prayer three years before my meeting with Allah's Messenger (may peace be upon him). I said: For whom did you say prayer? He said: For Allah. I said: To which direction did you turn your face (for observing prayer)? He said: I used to turn my face as Allah has directed me to turn my face. I used to observe the night prayer at the time of the end of night and I fell down in prostration like the mantle until the sun rose over me. Unais said: I have a work in Mecca, so you better stay here. Unais went until he came to Mecca and he came to me late. I said: What did you do? He said: I met a person in Mecca who is on your religion and he claims that verily it is Allah Who has sent him. I said: What do the people say about him? He said: They say that he is a poet or a Kahin or a magician. Unais who was himself one of the poets said. I have heard the words of a Kahin but his words in no way resemble his (words). And 1 also compared his words to the verses of poets but such words cannot be uttered by any poet. By Allah, he is truthful and they are liars. Then I said: you stay here, until I go, so that I should see him. He said: I came to Mecca and I selected an insignificant person from amongst them and said to him: Where is he whom you call as-Sabi? He pointed out towards me saying: He is Sabi. Thereupon the people of the valley attacked me with sods and bows until I fell down unconscious. I stood up after havin. regained my consciousness and I found as if I was a red idol. I came to Zamzarn and washed blood from me and drank water from it and listen, O son of my brother, I stayed there for thirty nights or days and there was no food for me but the water of Zamzarn. And I became so bulky that there appeared wrinkles upon my stomach, and I did not feel any hunger in my stomach. It was during this time that the people of Mecca slept in the moonlit night and none was there to eircumambulate the House but only two women who had been invoking the name of Isafa, and Na'ila (the two idols). They came to me while in their circuit and I said: Marry one with the other, but they did not dissuade from their invoking. They came to me and I said to them: Insert wood (in the idols' private parts). (I said this to them in such plain words) as I could not express in metaphorical terms. These women went away crying and saying: Had there been one amongst our people (he would have taught a lesson to you for the obscene words used for our idols before us). These women met Allah's Messenger (may peace be upon him) and Abu Bakr who had also been coming down the hill. He asked them: What has happened to you? They said: There is Sabi, who has hidden himself between the Ka'ba and its curtain. He said: What did he say to you? They said: He uttered such words before us as we cannot express. Allah's Messenger (may peace be upon him) came and he kissed the Black Stone and circumambulated the House along with his Companion and then observed prayer, and when he had finished his prayer, Abu Dharr said: I was the first to greet him with the salutation of peace and uttered (these words) in this way; Allah's Messen- ger, may there be peace upon you, whereupon he said: It may be upon you too and the mercy of Allah. He then said: Who are you? I said: From the tribe of Ghifar. He leaned his hand and placed his finger on his forehead and I said to myself: Perhaps he has not liked it that I belong to the tribe of Ghifar. I attempted to catch hold of his hand but his friend who knew about him more than I dissuaded me f rom doing so. He then lifted his head and said: Since how long have you been here? I said: I have been here for the last thirty nights or days. He said: Who has been feeding you? I said: There has been no food for me but the water of Zamzam. I have grown so bulky that there appear wrinkles upon my stomach and I do not feel any hunger. He said: It is blessed (water) and it also serves as food. Thereupon Abu Bakr said: Allah's Messenger, let me serve as a host to him for tonight, and then Allah's Messenger (may peace be upon him) proceeded forth and so did Abu Bakr and I went along with them. Abu Bakr opened the door and then he brought for us the raisins of Ta'if and that was the first food which I ate there. Then I stayed as long as I had to stay. I then came to Allah's Messenaer (may peace be upon him) and he said: I have been shown the land abound- ing in trees and I think it cannot be but that of Yathrib (that is the old name of Medina). You are a preacher to your people on my behalf. I hope Allah would benefit them through you and He would reward you. I came to Unais and he said: What have you done? I said: I have done that I have embraced Islam and I have testified (to the prophethood of Allah's Messenger). He said: I have no aversion for your religion and I also embrace Islam and testify (to the prophethood of Muhammad). Then both of us came to our mother and she said: I have no aversion for your religion and I also embrace Islam and testify to the prophethood of Muhammad. We then loaded our camels and came to our tribe Ghifir and half of the tribe embraced Islam and their chief was Aimi' b. Rahada Ghifirl and he was their leader and hall of the tribe said: We will embrace Islam when Allah's Messenger (may p,. ace be upon him) would come to Medina, and when Allah's Messenger (may peace be upon him) came to Medina the remaining half also embraced Islam. Then a tribe Aslam came to the Holy Prophet (may peace be upon him) and said: Allah's Messenger, we also embrace Islam like our brothers who have embraced Islam. And they also embraced Islam. Thereupon Allah's Messenger (may peace be upon him) said: Allah granted pardon to the tribe of Ghifar and Allah saved (from destruction) the tribe of Aslam.",
      "chain": [
        "20236",
        "11281",
        "10695"
      ]
    },
    {
      "hadith_no": "6514",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا النضر بن شميل، حدثنا سليمان، بن المغيرة حدثنا حميد بن هلال، بهذا الإسناد وزاد بعد قوله قلت فاكفني حتى أذهب فأنظر ‏.‏ قال نعم وكن على حذر من أهل مكة فإنهم قد شنفوا له وتجهموا ‏.‏",
      "text_en": " This hadlth has been narrated on the authority of Humaid b. Hilal with the same chain of transmitters but with this addition:                     \" As I came to Mecca, Unais said: (Well), go but be on your guard against the Meccans for they are his enemies and are annoyed with him.\"",
      "chain": [
        "30021",
        "20291",
        "20236",
        "11281"
      ]
    },
    {
      "hadith_no": "6585",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا هداب بن خالد، حدثنا سليمان بن المغيرة، حدثنا حميد بن هلال، عن عبد، الله بن الصامت قال قال أبو ذر قال رسول الله صلى الله عليه وسلم ‏\"‏ غفار غفر الله لها وأسلم سالمها الله ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported Allah's Messenger (may peace be upon him) as saying:                      Go to your people and say that the Messenger of Allah (may peace be upon him) says: Ghifar (is a tribe) to whom Allah granted pardon, and Aslam (is the tribe) to whom Allah granted safety.",
      "chain": [
        "20236",
        "11281",
        "10695",
        "23"
      ]
    },
    {
      "hadith_no": "6654",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني زهير بن حرب، حدثنا هاشم بن القاسم، حدثنا سليمان بن المغيرة، حدثني  سعيد الجريري، عن أبي نضرة، عن أسير بن جابر، أن أهل الكوفة، وفدوا، إلى عمر وفيهم رجل ممن كان يسخر بأويس فقال عمر هل ها هنا أحد من القرنيين فجاء ذلك الرجل فقال عمر إن رسول الله صلى الله عليه وسلم قد قال ‏\"‏ إن رجلا يأتيكم من اليمن يقال له أويس لا يدع باليمن غير أم له قد كان به بياض فدعا الله فأذهبه عنه إلا موضع الدينار أو الدرهم فمن لقيه منكم فليستغفر لكم ‏\"‏ ‏.‏",
      "text_en": " Usair b. Jabir reported that a delegation from Kufa came to 'Umar and there was a person amongst them who jeered at Uwais. Thereupon Umar said:                      Is there amongst us one from Qaran? That person came and Umar said: Verily Allah's Messenger (may peace be upon him) has said: There would come to you a person from Yemen who would be called Uwais and he would leave none in Yemen (behind him) except his mother, and he would have the whiteness (due to leprosy) and he supplicated Allah and it was cured except for the size of a dinar or dirham. He who amongst you meets him should ask him to supplicate for forgiveness (from Allah) for you.",
      "chain": [
        "30022",
        "20390",
        "20236",
        "11286",
        "10721"
      ]
    },
    {
      "hadith_no": "6672",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا سليمان بن المغيرة، حدثنا حميد بن هلال، عن  أبي رافع، عن أبي هريرة، أنه قال كان جريج يتعبد في صومعة فجاءت أمه ‏.‏ قال حميد فوصف لنا أبو رافع صفة أبي هريرة لصفة رسول الله صلى الله عليه وسلم أمه حين دعته كيف جعلت كفها فوق حاجبها ثم رفعت رأسها إليه تدعوه فقالت يا جريج أنا أمك كلمني ‏.‏ فصادفته يصلي فقال اللهم أمي وصلاتي ‏.‏ فاختار صلاته فرجعت ثم عادت في الثانية فقالت يا جريج أنا أمك فكلمني ‏.‏ قال اللهم أمي وصلاتي ‏.‏ فاختار صلاته فقالت اللهم إن هذا جريج وهو ابني وإني كلمته فأبى أن يكلمني اللهم فلا تمته حتى تريه المومسات ‏.‏ قال ولو دعت عليه أن يفتن لفتن ‏.‏ قال وكان راعي ضأن يأوي إلى ديره - قال - فخرجت امرأة من القرية فوقع عليها الراعي فحملت فولدت غلاما فقيل لها ما هذا قالت من صاحب هذا الدير ‏.‏ قال فجاءوا بفئوسهم ومساحيهم فنادوه فصادفوه يصلي فلم يكلمهم - قال - فأخذوا يهدمون ديره فلما رأى ذلك نزل إليهم فقالوا له سل هذه - قال - فتبسم ثم مسح رأس الصبي فقال من أبوك قال أبي راعي الضأن ‏.‏ فلما سمعوا ذلك منه قالوا نبني ما هدمنا من ديرك بالذهب والفضة ‏.‏ قال لا ولكن أعيدوه ترابا كما كان ثم علاه ‏.‏",
      "text_en": " Abu Huraira reported that Juraij was one who was devoted to (prayer) in the temple. His mother came to him. Humaid said that Abu Rafi' demonstrated before us like the demonstration made by abu Huraira to whom Allah's Messenger (may peace be upon him) had demonstrated as his mother called him placing her palms upon the eyebrows and lifting her head for calling him and said:                      Juraij, it is your mother, so talk to her. She found him at that time absorbed in prayer, so he said (to himself): O Lord, my mother (is calling me) (whereas I am absorbed) in my prayer. He opted for prayer. She (his mother) went back, then came again for the second time and said: O Juraij, it is your mother (calling you), so talk to me. He said: O Allah. there is my mother also and my prayer, and he opted for prayer. She said: O Allah, this Juraij is my son. I pray to talk to him but he refuses to talk to me. O Allah, don't bring death to him unless he has seen the prostitutes, and had she invoked the curse upon him (from the heart of her heart) he would have been involved in some turmoil. There was a shepherd living near by his temple (the temple where Juraij was engaged in prayer). It so happened that a woman of that village came there and that shepherd committed fornication with her and she became pregnant and gave birth to a child. It was said to her: Whose child is this? She said: He is the child of one who is living in this temple. So there came persons with hatchets and spades. They called Juraij. He was absorbed in prayer and he did not talk to them and they were about to demolish that temple that he saw them and then came to them and they said: Ask her (this woman) what she says. He smiled and then touched the head of the child and said: Who is your father? He (the child) said: My father is the shepherd of the sheep, and when they heard this, they said: We are prepared to rebuild with gold and silver what we have demolished from your temple. He said: No, rebuild it with clay as it had been before. He then went up (to his room and absorbed himself in prayer).",
      "chain": [
        "20656",
        "20236",
        "11281",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "7217",
      "source": " Sahih Muslim ",
      "chapter": "Pertaining To The Charateristics Of The Hypocrites And Command Concerning Them - كتاب صفات المنافقين وأحكامهم",
      "chapter_no": "52",
      "text_ar": "حدثني محمد بن رافع، حدثنا أبو النضر، حدثنا سليمان، - وهو ابن المغيرة - عن ثابت، عن أنس بن مالك، قال كان منا رجل من بني النجار قد قرأ البقرة وآل عمران وكان يكتب لرسول الله صلى الله عليه وسلم فانطلق هاربا حتى لحق بأهل الكتاب - قال - فرفعوه قالوا هذا قد كان يكتب لمحمد فأعجبوا به فما لبث أن قصم الله عنقه فيهم فحفروا له فواروه فأصبحت الأرض قد نبذته على وجهها ثم عادوا فحفروا له فواروه فأصبحت الأرض قد نبذته على وجهها ثم عادوا فحفروا له فواروه فأصبحت الأرض قد نبذته على وجهها فتركوه منبوذا ‏.‏",
      "text_en": " Anas b. Malik reported:                      There was a person amongst us who belonged to the tribe of Bani Najjar and he recited Sura al-Baqarah and Surat Al-i-'Imran and he used to transcribe for Allah's Messenger (may peace be upon him). He ran away as a rebel and joined the People of the Book. They gave it much importance and said: He is the person who used to transcribe for Muhammad and they were much pleased with him. Time rolled on that Allah caused his death. They dug the grave and buried him therein, but they found to their surprise that the earth had thrown him out over the surface. They again dug the grave for him and buried him but the earth again threw him out upon the surface. They again dug the grave for him and buried him but the earth again threw him out upon the surface. At last they left him unburied.",
      "chain": [
        "30375",
        "20390",
        "20236",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "7401",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثني إسحاق بن عمر بن سليط الهذلي، حدثنا سليمان بن المغيرة، عن ثابت، قال قال أنس كنت مع عمر ح",
      "text_en": "",
      "chain": [
        "30427",
        "20236",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "7402",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "وحدثنا شيبان بن فروخ، - واللفظ له - حدثنا سليمان بن المغيرة، عن ثابت، عن أنس بن مالك، قال كنا مع عمر بين مكة والمدينة فتراءينا الهلال وكنت رجلا حديد البصر فرأيته وليس أحد يزعم أنه رآه غيري - قال - فجعلت أقول لعمر أما تراه فجعل لا يراه - قال - يقول عمر سأراه وأنا مستلق على فراشي ‏.‏ ثم أنشأ يحدثنا عن أهل بدر فقال إن رسول الله صلى الله عليه وسلم كان يرينا مصارع أهل بدر بالأمس يقول ‏\"‏ هذا مصرع فلان غدا إن شاء الله ‏\"‏ ‏.‏ قال فقال عمر فوالذي بعثه بالحق ما أخطئوا الحدود التي حد رسول الله صلى الله عليه وسلم - قال - فجعلوا في بئر بعضهم على بعض فانطلق رسول الله صلى الله عليه وسلم حتى انتهى إليهم فقال ‏\"‏ يا فلان بن فلان ويا فلان بن فلان هل وجدتم ما وعدكم الله ورسوله حقا فإني قد وجدت ما وعدني الله حقا ‏\"‏ ‏.‏ قال عمر يا رسول الله كيف تكلم أجسادا لا أرواح فيها قال ‏\"‏ ما أنتم بأسمع لما أقول منهم غير أنهم لا يستطيعون أن يردوا على شيئا ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported:                      We were along with Umar between Mecca and Medina that we began to look for the new moon. And I was a man with sharp eye- sight, so I could see it, but none except me saw it. I began to say to 'Umar: Don't you see it? But he would not see it. Thereupon Umar said: I would soon be able to see it (when it will shine more brightly). I lay upon bed. He then made a mention of the people of Badr to us and said: Allah's Messenger (may peace be upon him) showed us one day before (the actual battle) the place of death of the people (participating) in (the Battle) of Badr and he was saying: This would be the place of death of so and so tomorrow, if Allah wills. Umar said: By Him Who sent him with truth, they did not miss the places (of their death) which Allah's Messenger (may peace be upon him) had pointed for them. Then they were all thrown in a well one after another. Allah's Messenger (may peace be upon him) then went to them and said: O, so and so, the son of so and so; O so and so, the son of so and so, have you found correct what Allah and His Messenger had promised you? I have, however, found absolutely true what Allah had promised with me. Umar said: Allah's Messenger, how are you talking with the bodies without soul in them. Thereupon he said: You cannot hear more distinctly than (their hearing) of what I say, but with this exception that they have not power to make any reply.",
      "chain": [
        "20656",
        "20236",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "7465",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا شيبان بن فروخ، حدثنا سليمان، - يعني ابن المغيرة - حدثنا حميد، - يعني ابن هلال - عن أبي قتادة، عن أسير بن جابر، قال كنت في بيت عبد الله بن مسعود والبيت ملآن - قال - فهاجت ريح حمراء بالكوفة ‏.‏ فذكر نحو حديث ابن علية ‏.‏",
      "text_en": " Jabir reported:                      I was in the house of 'Abdullah b. Mas'ud and the house was fully packed that a red storm blew in Kufah.",
      "chain": [
        "20656",
        "20236",
        "11281",
        "391"
      ]
    },
    {
      "hadith_no": "7625",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا سليمان بن المغيرة، حدثنا حميد بن هلال، عن  خالد بن عمير العدوي، قال خطبنا عتبة بن غزوان فحمد الله وأثنى عليه ثم قال أما بعد فإن الدنيا قد آذنت بصرم وولت حذاء ولم يبق منها إلا صبابة كصبابة الإناء يتصابها صاحبها وإنكم منتقلون منها إلى دار لا زوال لها فانتقلوا بخير ما بحضرتكم فإنه قد ذكر لنا أن الحجر يلقى من شفة جهنم فيهوي فيها سبعين عاما لا يدرك لها قعرا ووالله لتملأن أفعجبتم ولقد ذكر لنا أن ما بين مصراعين من مصاريع الجنة مسيرة أربعين سنة وليأتين عليها يوم وهو كظيظ من الزحام ولقد رأيتني سابع سبعة مع رسول الله صلى الله عليه وسلم ما لنا طعام إلا ورق الشجر حتى قرحت أشداقنا فالتقطت بردة فشققتها بيني وبين سعد بن مالك فاتزرت بنصفها واتزر سعد بنصفها فما أصبح اليوم منا أحد إلا أصبح أميرا على مصر من الأمصار وإني أعوذ بالله أن أكون في نفسي عظيما وعند الله صغيرا وإنها لم تكن نبوة قط إلا تناسخت حتى يكون آخر عاقبتها ملكا فستخبرون وتجربون الأمراء بعدنا ‏.‏",
      "text_en": " 'Umair al-'Adawi reported:                      'Utba b. Ghazwan delivered us a sermon and he praised Allah and lauded Him, then said: Now coming to the point, verily the world has been given the news of its end and that too quite early. Nothing would be left out of it but only water left in the utensil which its owner leaves, and you are going to shift to an abode which knows no end, and you should shift with the good before you, for we have been told that a stone would be thrown at one side of the Hell and it would go down even for seventy years but would not be able to reach its bottom. By Allah, it would be fully packed. Do you find it something strange, and it has been mentioned that there yawns a distance which one would be able to cover in forty years from one end to another of Paradise, and a day would come when it would be fully packed and you must be knowing that I was the seventh amongst seven who had been with Allah's Messenger (may peace be upon him) and we had nothing to eat but the leaves of the tree until the corners of the mouth were injured. We found a sheet which we tore in two and divided between myself and Sa'd b. Malik. I made the lower garment with halt of it and so did Sa'd make the lower garment with half of it and today there is none amongst us who has not become the governor of a city from amongst the cities (of the Islamic Commonwealth) and I seek refuge with Allah that I should consider myself great whereas I am insignificant in the eye of Allah. Prophethood does not remain for ever and its impact fades with the result that it changes eventually into kingship, and you would soon come to know and experience those rulers who would come after us and see (how far they are from religion).",
      "chain": [
        "20656",
        "20236",
        "11281",
        "10681"
      ]
    },
    {
      "hadith_no": "7626",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "وحدثني إسحاق بن عمر بن سليط، حدثنا سليمان بن المغيرة، حدثنا حميد بن، هلال عن خالد بن عمير، وقد أدرك الجاهلية قال خطب عتبة بن غزوان وكان أميرا على البصرة ‏.‏ فذكر نحو حديث شيبان ‏.‏",
      "text_en": " Khalid b. 'Umair reported and he had seen the pre-Islamic days also, that 'Uqba b. Ghazwan delivered this address and he was the governor of Basra. The rest of the hadith is the same as transmitted by Shaiban.",
      "chain": [
        "30427",
        "20236",
        "11281",
        "10681"
      ]
    },
    {
      "hadith_no": "7692",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا هداب بن خالد الأزدي، وشيبان بن فروخ، جميعا عن سليمان بن المغيرة، - واللفظ لشيبان - حدثنا سليمان، حدثنا ثابت، عن عبد الرحمن بن أبي ليلى، عن صهيب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ عجبا لأمر المؤمن إن أمره كله خير وليس ذاك لأحد إلا للمؤمن إن أصابته سراء شكر فكان خيرا له وإن أصابته ضراء صبر فكان خيرا له ‏\"‏ ‏.‏",
      "text_en": " Suhaib reported that Allah's Messenger (may peace be upon him) said:                      Strange are the ways of a believer for there is good in every affair of his and this is not the case with anyone else except in the case of a believer for if he has an occasion to feel delight, he thanks (God), thus there is a good for him in it, and if he gets into trouble and shows resignation (and endures it patiently), there is a good for him in it.",
      "chain": [
        "20656",
        "20236",
        "11060",
        "11269",
        "11196",
        "182"
      ]
    },
    {
      "hadith_no": "441",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا العباس العنبري، حدثنا سليمان بن داود، - وهو الطيالسي - حدثنا سليمان، - يعني ابن المغيرة - عن ثابت، عن عبد الله بن رباح، عن أبي قتادة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس في النوم تفريط إنما التفريط في اليقظة أن تؤخر صلاة حتى يدخل وقت أخرى ‏\"‏ ‏.‏",
      "text_en": " Abu Qatadah reported the Messenger of Allah (ﷺ) as saying:                      There is no remissness in sleep, it is only when one is awake that there is remissness when you delay saying the prayer till the time for the next prayer comes.",
      "chain": [
        "30437",
        "30584",
        "20236",
        "11269",
        "11865",
        "391"
      ]
    },
    {
      "hadith_no": "700",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا سليمان، - يعني ابن المغيرة - عن حميد، - يعني ابن هلال - قال قال أبو صالح أحدثك عما رأيت من أبي سعيد وسمعته منه، دخل أبو سعيد على مروان فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا صلى أحدكم إلى شىء يستره من الناس فأراد أحد أن يجتاز بين يديه فليدفع في نحره فإن أبى فليقاتله فإنما هو شيطان ‏\"‏ ‏.‏ قال أبو داود قال سفيان الثوري يمر الرجل يتبختر بين يدى وأنا أصلي فأمنعه ويمر الضعيف فلا أمنعه ‏.‏",
      "text_en": " Abu Salih said:                      I narrate what I witnesses from Abu Sa'id and heard from him. Abu Sa'id entered upon Marwan and said: I heard the Messenger of Allah (ﷺ) say: When one of you prays facing any object which conceals him from people, and someone wishes to pass in front of him, he should strike him at his chest; if he refuses (to go), he should fight him; he is only a devil.\tAbu Dawud said: Sufyan Ath-Thawri said: \"A person arrogantly walks in front of me while I am praying, so I stop him, and a weak person passes, so I dont stop him.\"",
      "chain": [
        "20040",
        "20236",
        "11281"
      ]
    },
    {
      "hadith_no": "702",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، ح وحدثنا عبد السلام بن مطهر، وابن، كثير - المعنى - أن سليمان بن المغيرة، أخبرهم عن حميد بن هلال، عن عبد الله بن الصامت، عن أبي ذر، - قال حفص - قال قال رسول الله صلى الله عليه وسلم وقالا عن سليمان قال أبو ذر ‏\"‏ يقطع صلاة الرجل - إذا لم يكن بين يديه قيد آخرة الرحل الحمار والكلب الأسود والمرأة ‏\"‏ ‏.‏ فقلت ما بال الأسود من الأحمر من الأصفر من الأبيض فقال يا ابن أخي سألت رسول الله صلى الله عليه وسلم كما سألتني فقال ‏\"‏ الكلب الأسود شيطان ‏\"‏ ‏.‏",
      "text_en": " Hafs reported that the Messenger of Allah(ﷺ) as saying, and the other version of this tradition transmitted through a different chain has:                      Abu Dharr said (and not the Prophet): If there is not anything like the back of a saddle in front of a man who is praying, then a donkey, a black dog, and a woman cut off his prayer. I asked him: Why has the black dog been specified, distinguishing it from a red, a yellow and a white dog? He replied: My nephew, I also asked the Messenger of Allah(ﷺ) the same question as you asked me. He said: The black dog is a devil.",
      "chain": [
        "30329",
        "20020",
        "20249",
        "20236",
        "11281",
        "10695",
        "23",
        "20317"
      ]
    },
    {
      "hadith_no": "1872",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا بهز بن أسد، وهاشم، - يعني ابن القاسم - قالا حدثنا سليمان بن المغيرة، عن ثابت، عن عبد الله بن رباح، عن أبي هريرة، قال أقبل رسول الله صلى الله عليه وسلم فدخل مكة فأقبل رسول الله صلى الله عليه وسلم إلى الحجر فاستلمه ثم طاف بالبيت ثم أتى الصفا فعلاه حيث ينظر إلى البيت فرفع يديه فجعل يذكر الله ما شاء أن يذكره ويدعوه قال والأنصار تحته قال هاشم فدعا وحمد الله ودعا بما شاء أن يدعو ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Messenger of Allah (ﷺ) came an entered Mecca, and after the Messenger of Allah (ﷺ) had gone forward to the Stone, and touched it, he went round the House (the Ka'bah). He then went to as-Safa and mounted it so that he could look at the House. Then he raised his hands began to make mention of Allah as much as he wished and make supplication. The narrator said: The Ansar were beneath him. The narrator Hashim said: He prayed and praised Allah and asked Him for what he wished to ask.",
      "chain": [
        "30007",
        "20214",
        "20390",
        "20236",
        "11269",
        "11865",
        "13"
      ]
    },
    {
      "hadith_no": "2059",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عبد السلام بن مطهر، أن سليمان بن المغيرة، حدثهم عن أبي موسى، عن أبيه، عن ابن لعبد الله بن مسعود، عن ابن مسعود، قال لا رضاع إلا ما شد العظم وأنبت اللحم ‏.‏ فقال أبو موسى لا تسألونا وهذا الحبر فيكم ‏.‏",
      "text_en": " ‘Abd Allaah bin Mas’ud said “Fosterage is not valid except by what strengthens love and grows flesh.” Abu Musa said “Do not ask us so long as this learned man is among us”",
      "chain": [
        "20249",
        "20236",
        "30170",
        "16"
      ]
    },
    {
      "hadith_no": "2060",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا وكيع، عن سليمان بن المغيرة، عن أبي موسى الهلالي، عن أبيه، عن ابن مسعود، عن النبي صلى الله عليه وسلم بمعناه وقال أنشز العظم ‏.‏",
      "text_en": " The aforesaid tradition has also been narrated by Ibn Mas’ud through a different chain of narrators and to the same effect from the Prophet (ﷺ). This version has the words anshaz al-‘azma meaning which nourishes bones and makes them sturdy and vigorous.",
      "chain": [
        "31160",
        "20032",
        "20236",
        "16"
      ]
    },
    {
      "hadith_no": "2375",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا سليمان، - يعني ابن المغيرة - عن ثابت، قال قال أنس ما كنا ندع الحجامة للصائم إلا كراهية الجهد ‏.‏",
      "text_en": " Narrated Anas:                     We would not allow a man who was fasting to get himself cupped due to abomination of hardship.",
      "chain": [
        "20164",
        "20236",
        "11269"
      ]
    },
    {
      "hadith_no": "2618",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا هاشم بن القاسم، حدثنا سليمان، - يعني ابن المغيرة - عن ثابت، عن أنس، قال بعث - يعني النبي صلى الله عليه وسلم - بسبسة عينا ينظر ما صنعت عير أبي سفيان ‏.‏",
      "text_en": " Anas said “the Prophet(ﷺ) sent Busaisah as a spy to see what the caravan of Abu Sufyan was doing.”",
      "chain": [
        "30524",
        "20390",
        "20236",
        "11269",
        "19"
      ]
    }
  ],
  "total_hadiths": 71
}