{
  "id": "20235",
  "name": "Sulaiman bin Khatir al-'Abdi سليمان بن كثير العبدي",
  "full_name": "Sulaiman bin Khatir al-'Abdi سليمان بن كثير العبدي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "163",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ع  -  لا بأس به ]"
    ],
    "tags": [
      "al-'Abdi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "30169",
      "name": "Muhammad bin Kathir al-'Abdi محمد بن كثير العبدي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "15097",
      "name": "Husayn bin 'Abdur Rahman al-Salmi حصين بن عبد الرحمن السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10696",
      "name": "'Abdullah bin Mutar, Abu Rayhana عبد الله بن مطر أبو ريحانة البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11585",
      "name": "Da'ud bin Abi Hnd داود بن أبي هند",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20218",
      "name": "Hiban bin Hilal حبان بن هلال",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20296",
      "name": "Hisham bin 'Abdul Malik al-Tayalasi هشام بن عبد الملك أبو الوليد الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "24162",
      "name": "Sa'id bin Sulaiman al-Basri al-Nashayti سعيد بن سليمان البصري النشيطي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30106",
      "name": "'Affan bin Muslim عفان بن مسلم بن عبد الله الصفار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20040",
      "name": "Musa bin Isma'il al-Munqari al-Tabudhaki موسى بن إسماعيل المنقري - لتبوذكي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4493",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، وعبد بن حميد، قالا أخبرنا عبد الرزاق، أخبرنا معمر، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، أخبرنا سليمان بن كثير، وإبراهيم بن سعد كلهم عن الزهري، ‏.‏ بمثله في هذا الإسناد ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Zuhri.",
      "chain": [
        "30123",
        "30553",
        "20121",
        "20115",
        "30201",
        "20472",
        "20235",
        "20150"
      ]
    },
    {
      "hadith_no": "6069",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vision - كتاب الرؤيا",
      "chapter_no": "43",
      "text_ar": "وحدثنا عبد الله بن عبد الرحمن الدارمي، حدثنا محمد بن كثير، حدثنا سليمان، - وهو ابن كثير - عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس، أن رسول الله صلى الله عليه وسلم كان مما يقول لأصحابه ‏\"‏ من رأى منكم رؤيا فليقصها أعبرها له ‏\"‏ ‏.‏ قال فجاء رجل فقال يا رسول الله رأيت ظلة ‏.‏ بنحو حديثهم ‏.‏",
      "text_en": " Ibn 'Abbas reported that Allah's Messenger (may peace be upon him) used to say to his Companions:                      He who amongst you sees a vision should narrate it and I would interpret it for him, and a person came and said: Allah's Messenger, I saw a canopy. The rest of the hadith is the same.",
      "chain": [
        "30025",
        "28531",
        "20235",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "1849",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن كثير، حدثنا سليمان بن كثير، عن حميد الطويل، عن إسحاق بن عبد الله بن الحارث، عن أبيه، وكان الحارث، خليفة عثمان على الطائف فصنع لعثمان طعاما فيه من الحجل والبعاقيب ولحم الوحش قال فبعث إلى علي بن أبي طالب فجاءه الرسول وهو يخبط لأباعر له فجاءه وهو ينفض الخبط عن يده فقالوا له كل ‏.‏ فقال أطعموه قوما حلالا فإنا حرم ‏.‏ فقال علي رضى الله عنه أنشد الله من كان ها هنا من أشجع أتعلمون أن رسول الله صلى الله عليه وسلم أهدى إليه رجل حمار وحش وهو محرم فأبى أن يأكله قالوا نعم ‏.‏",
      "text_en": " Abdullah ibn al-Harith reported on the authority of his father al-Harith:                      (My father) al-Harith was the governor of at-Ta'if under the caliph Uthman. He prepared food for Uthman which contained birds and the flesh of wild ass. He sent it to Ali (may Allah be pleased with him). When the Messenger came to him he was beating leaves for camels and shaking them off with his hand. He said to him: Eat it. He replied: Give it to the people who are not in sacred state; we are wearing ihram. I adjure the people of Ashja' who are present here. Do you know that a man presented a wild ass to the Messenger of Allah (ﷺ) while he was in ihram? But he refused to eat from it. They said: Yes.",
      "chain": [
        "28531",
        "20235",
        "11279",
        "19898"
      ]
    },
    {
      "hadith_no": "2485",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو الوليد الطيالسي، حدثنا سليمان بن كثير، حدثنا الزهري، عن عطاء بن يزيد، عن أبي سعيد، عن النبي صلى الله عليه وسلم أنه سئل أى المؤمنين أكمل إيمانا قال ‏\"‏ رجل يجاهد في سبيل الله بنفسه وماله ورجل يعبد الله في شعب من الشعاب قد كفي الناس شره ‏\"‏ ‏.‏",
      "text_en": " Abu Sa’id (Al Khudri) reported The Prophet(ﷺ) was asked “Which believers are most perfect in respect of faith? He replied “A man who strives in the path of Allaah with his life and property and a man who worships Allaah in a mountain valley where he protects the people from his evil.””",
      "chain": [
        "20296",
        "20235",
        "11013",
        "11206",
        "38"
      ]
    },
    {
      "hadith_no": "3122",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن كثير، حدثنا سليمان بن كثير، عن يحيى بن سعيد، عن عمرة، عن عائشة، قالت لما قتل زيد بن حارثة وجعفر وعبد الله بن رواحة جلس رسول الله صلى الله عليه وسلم في المسجد يعرف في وجهه الحزن وذكر القصة ‏.‏",
      "text_en": " Narrated 'Aishah:                     When Zaid b. Harithah, Ja'far and 'Abd Allah b. Rawahah were killed, the Messenger of Allah (ﷺ) sat down in the mosque and grief was visible in his face. Then he (the narrator) mentioned the rest of the tradition.",
      "chain": [
        "28531",
        "20235",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "3269",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، أخبرنا محمد بن كثير، أخبرنا سليمان بن كثير، عن الزهري، عن عبيد الله، عن ابن عباس، عن النبي صلى الله عليه وسلم بهذا الحديث لم يذكر القسم، زاد فيه ولم يخبره ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Ibn 'Abbas through a different chain of narrators. In this version there is no mention of the word qasam (oath). It has the words:                      \"He did not inform him.\"",
      "chain": [
        "11222",
        "28531",
        "20235",
        "11013",
        "11201",
        "17"
      ]
    },
    {
      "hadith_no": "4540",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن أبي غالب، حدثنا سعيد بن سليمان، عن سليمان بن كثير، حدثنا عمرو بن دينار، عن طاوس، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم فذكر معنى حديث سفيان ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     The Messenger of Allah (ﷺ) as saying: He then mentioned the rest of the tradition to the same effect as mentioned by Sufyan.",
      "chain": [
        "30274",
        "30252",
        "20235",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "4591",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "قال أبو داود حدثت عن سعيد بن سليمان، عن سليمان بن كثير، حدثنا عمرو بن دينار، عن طاوس، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قتل في عميا أو رميا يكون بينهم بحجر أو بسوط فعقله عقل خطإ ومن قتل عمدا فقود يديه فمن حال بينه وبينه فعليه لعنة الله والملائكة والناس أجمعين ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: If anyone is killed blindly or, when people are throwing stones, by a stone or a whip, his blood-wit is the blood-wit for an accidental murder. But if anyone is killed intentionally, retaliation is due. If anyone tries to prevent it, the curse of Allah, of angels, and of all the people will rest on him.",
      "chain": [
        "30252",
        "20235",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "4633",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا محمد بن كثير، حدثنا سليمان بن كثير، عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس، عن النبي صلى الله عليه وسلم بهذه القصة قال فأبى أن يخبره ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Ibn ‘abbas through a different chain of narrators. This version adds:                      He refused to tell him (his mistake).",
      "chain": [
        "11222",
        "28531",
        "20235",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "3517",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا محمد بن كثير، حدثنا سليمان بن كثير، عن حسين، عن عكرمة، عن أم عمارة الأنصارية، أنها أتت النبي صلى الله عليه وسلم فقالت ما أرى كل شيء إلا للرجال وما أرى النساء يذكرن بشيء فنزلت هذه الآية ‏:‏ ‏(‏إن المسلمين والمسلمات والمؤمنين والمؤمنات ‏)‏ الآية ‏.‏ قال أبو عيسى هذا حديث حسن غريب وإنما يعرف هذا الحديث من هذا الوجه ‏.‏",
      "text_en": " Narrated Umm 'Umarah Al-Ansariyyah:                     that she came to the Prophet (ﷺ) and said: \"I do not see bu that everything is for the men, and I do not see anything being mentioned for the women.\" So this Ayah was revealed: 'Indeed the Muslim men and the Muslim women, the believing men and the believing women... (33:35)'",
      "chain": [
        "30553",
        "28531",
        "20235",
        "11278",
        "11023"
      ]
    },
    {
      "hadith_no": "3600",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا محمد بن كثير، حدثنا سليمان بن كثير، عن حصين، عن محمد بن جبير بن مطعم، عن أبيه، قال انشق القمر على عهد النبي صلى الله عليه وسلم حتى صار فرقتين على هذا الجبل وعلى هذا الجبل فقالوا سحرنا محمد فقال بعضهم لئن كان سحرنا ما يستطيع أن يسحر الناس كلهم ‏.‏ قال أبو عيسى وقد روى بعضهم هذا الحديث عن حصين عن جبير بن محمد بن جبير بن مطعم عن أبيه عن جده جبير بن مطعم نحوه ‏.‏",
      "text_en": " Narrated Muhammad bin Jubair bin Mut'im:                     from his father who said: \"The moon was split during the time of the Messenger of Allah (ﷺ) until it became as two sections, one above this mountain and one above that mountain. So they said: 'Muhammad has cast a spell upon us.' Some of them said: 'If he could cast a spell upon us, he can not cast a spell upon all of the people.'\"",
      "chain": [
        "30553",
        "28531",
        "20235",
        "15097",
        "11058",
        "871"
      ]
    },
    {
      "hadith_no": "3526",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا حبان، قال حدثنا سليمان بن كثير، قال حدثنا الزهري، عن عروة، عن عائشة، أن النبي صلى الله عليه وسلم قال ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد فوق ثلاثة أيام إلا على زوج ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that the Prophet said:                      \"It is not permissible for a woman who believes in Allah and the Last Day to mourn for more than three days, except for her husband.\"",
      "chain": [
        "30172",
        "20218",
        "20235",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3656",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا عفان، قال حدثنا سليمان بن كثير، عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس، عن سعد بن عبادة، أنه أتى النبي صلى الله عليه وسلم فقال إن أمي ماتت وعليها نذر أفيجزئ عنها أن أعتق عنها قال ‏\"‏ أعتق عن أمك ‏\"‏‏.‏",
      "text_en": " It was narrated from Sa'd bin 'Ubadah that he came to the Prophet and said:                      \"My mother has died and she had a vow to fulfill. Will it suffice if I free a slave on her behalf?\" He said: \"Free a slave on behalf of your mother.\"",
      "chain": [
        "30524",
        "30106",
        "20235",
        "11013",
        "11004",
        "17",
        "35"
      ]
    },
    {
      "hadith_no": "4789",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا هلال بن العلاء بن هلال، قال حدثنا سعيد بن سليمان، قال أنبأنا سليمان بن كثير، قال حدثنا عمرو بن دينار، عن طاوس، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قتل في عميا أو رميا تكون بينهم بحجر أو سوط أو بعصا فعقله عقل خطإ ومن قتل عمدا فقود يده فمن حال بينه وبينه فعليه لعنة الله والملائكة والناس أجمعين لا يقبل منه صرف ولا عدل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah said: 'Whoever is killed in the blind or by something thrown, while between them is a rock, a wipe, or a stick, then the blood money of be paid for him is the blood money for accidental killing. Whoever kills deliberately, then retaliation is upon him, and whoever tries to prevent that, upon him is the curse of Allah, the Angels, and all the people, and neither Sarf nor Adl will be accepted from him.\"",
      "chain": [
        "38684",
        "30252",
        "20235",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "4790",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا محمد بن كثير، قال حدثنا سليمان بن كثير، عن عمرو بن دينار، عن طاوس، عن ابن عباس، يرفعه قال ‏\"‏ من قتل في عمية أو رمية بحجر أو سوط أو عصا فعقله عقل الخطإ ومن قتل عمدا فهو قود ومن حال بينه وبينه فعليه لعنة الله والملائكة والناس أجمعين لا يقبل الله منه صرفا ولا عدلا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbad, who attributed it to the prophet, said:                     \"Whoever is killed in the blind or by something thrown, with a rock, a whip, or a stick, then the blood money to be paid for him is the blood money for accidental killing. Whoever kills deliberately, then retaliation is upon him, and whoever tries to prevent that, upon him is the curse of Allah, the Angels and all the people, and Allah will not accept any Sarf nor 'Adl from him.\"",
      "chain": [
        "30172",
        "28531",
        "20235",
        "11081",
        "11053"
      ]
    },
    {
      "hadith_no": "1870",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا عبد الرحمن بن مهدي، حدثنا سليمان بن كثير، حدثنا ابن شهاب، عن سالم بن عبد الله، عن أبيه، عن النبي  صلى الله عليه وسلم  قال أقرأني سالم كتابا كتبه رسول الله  صلى الله عليه وسلم  في الصدقات قبل أن يتوفاه الله فوجدت فيه ‏\"‏ في خمس من الإبل شاة وفي عشر شاتان وفي خمس عشرة ثلاث شياه وفي عشرين أربع شياه وفي خمس وعشرين بنت مخاض إلى خمس وثلاثين فإن لم توجد بنت مخاض فابن لبون ذكر فإن زادت على خمس وثلاثين واحدة ففيها بنت لبون إلى خمسة وأربعين فإن زادت على خمس وأربعين واحدة ففيها حقة إلى ستين فإن زادت على ستين واحدة ففيها جذعة إلى خمس وسبعين فإن زادت على خمس وسبعين واحدة ففيها ابنتا لبون إلى تسعين فإن زادت على تسعين واحدة ففيها حقتان إلى عشرين ومائة فإذا كثرت ففي كل خمسين حقة وفي كل أربعين بنت لبون ‏\"‏ ‏.‏",
      "text_en": " Ibn Shihab narrated from Salim bin Abdullah, from his father, from the Prophet(ﷺ):                     Ibn Shihab said: “Salim read to me a letter that the Messenger of Allah had written concerning Sadaqat, before Allah caused him to pass away, in which it was said: 'For five camels one sheep; for ten, two sheep; for twenty, four sheep. For twenty five, a Bint Makhad(a one year old she-camel), up to thirty-five; if there is no Bint Makhad, then a Bin Labun ( a two-year-old male camel). If there are more than thirty-five even one, then a Bint Labun ( a two-year-old she-camel) must be given up to forty-five. If there are more than forty-five, even one, then a Hiqqah (a three-year-old she-camel), up to sixty camels. If there are more than sixty, even one more, then a Jadha'ah ( a four-year-old she-camel) must be given, up to seventy-five. If there are more than seventy-five, even one more, then two Bint Labun must be given, upto ninety. If there are more than ninety, even one more, then two Hiqqah must be given, up to one hundred and twenty. If there are many camels, then for each fifty, one Hiqqah must be given and for each forty a Bint Labun' ”",
      "chain": [
        "34043",
        "20033",
        "20235",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1877",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا بكر بن خلف، حدثنا عبد الرحمن بن مهدي، حدثنا سليمان بن كثير، حدثنا ابن شهاب، عن سالم بن عبد الله، عن أبيه، عن رسول الله  صلى الله عليه وسلم  قال أقرأني سالم كتابا كتبه رسول الله  صلى الله عليه وسلم  في الصدقات قبل أن يتوفاه الله فوجدت فيه ‏\"‏ في أربعين شاة شاة إلى عشرين ومائة فإذا زادت واحدة ففيها شاتان إلى مائتين فإذا زادت واحدة ففيها ثلاث شياه إلى ثلاثمائة فإذا كثرت ففي كل مائة شاة ‏\"‏ ‏.‏ ووجدت فيه ‏\"‏ لا يجمع بين متفرق ولا يفرق بين مجتمع ‏\"‏ ‏.‏ ووجدت فيه ‏\"‏ لا يؤخذ في الصدقة تيس ولا هرمة ولا ذات عوار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Shihab, from Salim bin Abdullah, from his father, from the Messenger of Allah:                     Salim said: “My father read to me a letter that the Messenger of Allah (ﷺ) had written about Sadaqat before Allah caused him to pass away. I read in it: 'For forty sheep, one sheep, up to one hundred and twenty. If there is more than that - even one - then two sheep, up to two hundred, If there is one more than that - even one = then three sheep, up to three hundred. If there are many sheep, then for each hundred, one sheep.' And I read in it: 'Separate flocks should not be combined, and a combined flock should not be separated.' And I read in it: 'And a male goat should not be taken for Sadaqah, nor a decrepit nor defective animal.' ”",
      "chain": [
        "34043",
        "20033",
        "20235",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "2737",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن معمر، حدثنا محمد بن كثير، حدثنا سليمان بن كثير، عن عمرو بن دينار، عن طاوس، عن ابن عباس، رفعه إلى النبي صلى الله عليه وسلم قال ‏\"‏ من قتل في عمية أو عصبية بحجر أو سوط أو عصا فعليه عقل الخطإ ومن قتل عمدا فهو قود ومن حال بينه وبينه فعليه لعنة الله والملائكة والناس أجمعين لا يقبل منه صرف ولا عدل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas, who attributed it to the Prophet (ﷺ):                     “Whoever kills out of folly or for tribal motives, using a rock, a whip, or a stick; he must pay the blood money for killing by mistake. Whoever kills deliberately, he is to be killed in retaliation. Whoever tries to prevent that, upon him is the curse of Allah, the angels and all the people, and no change nor equitable exchange will be accepted from him.”",
      "chain": [
        "30172",
        "28531",
        "20235",
        "11081",
        "11053"
      ]
    }
  ],
  "total_hadiths": 18
}