{
  "id": "20234",
  "name": "Saleem bin Hiyyan سليم بن حيان",
  "full_name": "Saleem bin Hiyyan سليم بن حيان",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Hadhli",
      "al-Basri"
    ]
  },
  "parents": [
    {
      "id": "14096",
      "name": "Hyan bin Bstam al-Hdhly al-Bsry حيان بن بسطام",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "14096",
      "name": "Hyan bin Bstam al-Hdhly al-Bsry حيان بن بسطام",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11510",
      "name": "Sa'id bin Myna سعيد بن مينا",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11081",
      "name": "'Amr bin Dinar عمرو بن دينار الأثرم الجمحي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "14715",
      "name": "Mrwan al-Asghr Knyt'h Abu Khlf مروان الأصغر كنيته أبو خلف",
      "grade": "Follower(Tabi')"
    }
  ],
  "students": [
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20250",
      "name": "'Abdul Samad bin 'Abdul Warith bin Sa'id عبد الصمد بن عبد الوارث بن سعيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20326",
      "name": "Sulaiman bin Hayan al-Azdi سليمان بن حيان الأزدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20556",
      "name": "'Abdul Malik bin Qarib - al-Asma'i عبد الملك بن قريب بن عبد الملك - الأصمعي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20260",
      "name": "'Ubaidullah bin Abd عبيد الله بن عبد المجيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20472",
      "name": "Yazid bin Harun يزيد بن هارون",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30106",
      "name": "'Affan bin Muslim عفان بن مسلم بن عبد الله الصفار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20285",
      "name": "Muslim bin Ibrahim al-Azdy مسلم بن إبراهيم الأزدي الفراهيدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1334",
      "hadith_no": "1334",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن سنان، حدثنا سليم بن حيان، حدثنا سعيد بن ميناء، عن جابر  رضى الله عنه  أن النبي صلى الله عليه وسلم صلى على أصحمة النجاشي فكبر أربعا‏.‏ وقال يزيد بن هارون وعبد الصمد عن سليم أصحمة‏.‏ وتابعه عبد الصمد‏.‏",
      "text_en": " Narrated Jabir:                     The Prophet offered the funeral prayer of As-Hama An-Najash and said four Takbir.",
      "usc_msa_ref": "418",
      "chain": [
        "34207",
        "20234",
        "11510",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-1583",
      "hadith_no": "1583",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا الحسن بن علي الخلال الهذلي، حدثنا عبد الصمد، حدثنا سليم بن حيان، قال سمعت مروان الأصفر، عن أنس بن مالك  رضى الله عنه  قال قدم علي  رضى الله عنه  على النبي صلى الله عليه وسلم من اليمن فقال ‏\"‏ بما أهللت ‏\"‏‏.‏ قال بما أهل به النبي صلى الله عليه وسلم‏.‏ فقال ‏\"‏ لولا أن معي الهدى لأحللت ‏\"‏‏.‏ وزاد محمد بن بكر عن ابن جريج قال له النبي صلى الله عليه وسلم ‏\"‏ بما أهللت يا علي ‏\"‏‏.‏ قال بما أهل به النبي صلى الله عليه وسلم قال ‏\"‏ فأهد وامكث حراما كما أنت ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     `Ali came to the Prophet (p.b.u.h) from Yemen (to Mecca). The Prophet asked `Ali, \"With what intention have you assumed Ihram?\" `Ali replied, \"I have assumed Ihram with the same intention as that of the Prophet.\" The Prophet said, \"If I had not the Hadi with me I would have finished the Ihram.\" Muhammad bin Bakr narrated extra from Ibn Juraij, \"The Prophet said to `Ali, \"With what intention have you assumed the Ihram, O `Ali?\" He replied, \"With the same (intention) as that of the Prophet.\" The Prophet said, \"Have a Hadi and keep your Ihram as it is.\"",
      "usc_msa_ref": "629",
      "chain": [
        "30",
        "20250",
        "20234",
        "11611",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-2196",
      "hadith_no": "2196",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا مسدد، حدثنا يحيى بن سعيد، عن سليم بن حيان، حدثنا سعيد بن مينا، قال سمعت جابر بن عبد الله  رضى الله عنهما  قال نهى النبي صلى الله عليه وسلم أن تباع الثمرة حتى تشقح‏.‏ فقيل ما تشقح قال تحمار وتصفار ويؤكل منها‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet forbade the s of (date) fruits till they were red or yellow and fit for eating.",
      "usc_msa_ref": "401",
      "chain": [
        "30175",
        "20031",
        "20234",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-3574",
      "hadith_no": "3574",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا محمد بن سنان، حدثنا سليم، حدثنا سعيد بن ميناء، عن جابر بن عبد الله  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم ‏\"‏ مثلي ومثل الأنبياء كرجل بنى دارا فأكملها وأحسنها، إلا موضع لبنة، فجعل الناس يدخلونها ويتعجبون، ويقولون لولا موضع اللبنة ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet said, \"My similitude in comparison with the other prophets is that of a man who has built a house completely and excellently except for a place of one brick. When the people enter the house, they admire its beauty and say: 'But for the place of this brick (how splendid the house will be)!\"",
      "usc_msa_ref": "734",
      "chain": [
        "34207",
        "20234",
        "11510",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-3927",
      "hadith_no": "3927",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني عبد الله بن أبي شيبة، حدثنا يزيد، عن سليم بن حيان، حدثنا سعيد بن ميناء، عن جابر بن عبد الله  رضى الله عنهما أن النبي صلى الله عليه وسلم صلى على أصحمة النجاشي، فكبر عليه أربعا‏.‏ تابعه عبد الصمد‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet offered the funeral prayer for Ashama, the Negus, with four Takbir.",
      "usc_msa_ref": "219",
      "chain": [
        "30201",
        "20472",
        "20234",
        "11510",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-5769",
      "hadith_no": "5769",
      "source": "Sahih Bukhari",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "وقال عفان حدثنا سليم بن حيان، حدثنا سعيد بن ميناء، قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا عدوى ولا طيرة ولا هامة ولا صفر، وفر من المجذوم كما تفر من الأسد ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, '(There is) no 'Adwa (no contagious disease is conveyed without Allah's permission). nor is there any bad omen (from birds), nor is there any Hamah, nor is there any bad omen in the month of Safar, and one should run away from the leper as one runs away from a lion.''",
      "usc_msa_ref": "608",
      "chain": [
        "30106",
        "20234",
        "11510",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6174",
      "hadith_no": "6174",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد بن عبادة، أخبرنا يزيد، أخبرنا سليم، حدثنا عمرو بن دينار، حدثنا جابر بن عبد الله، أن معاذ بن جبل  رضى الله عنه  كان يصلي مع النبي صلى الله عليه وسلم ثم يأتي قومه فيصلي بهم الصلاة، فقرأ بهم البقرة  قال  فتجوز رجل فصلى صلاة خفيفة، فبلغ ذلك معاذا فقال إنه منافق‏.‏ فبلغ ذلك الرجل، فأتى النبي صلى الله عليه وسلم فقال يا رسول الله إنا قوم نعمل بأيدينا، ونسقي بنواضحنا، وإن معاذا صلى بنا البارحة، فقرأ البقرة فتجوزت، فزعم أني منافق‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ يا معاذ أفتان أنت  ثلاثا  اقرأ ‏{‏والشمس وضحاها‏}‏ و‏{‏سبح اسم ربك الأعلى‏}‏ ونحوها ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Mu`adh bin Jabal used to pray with the Prophet and then go to lead his people in prayer. Once he led the people in prayer and recited Surat-al-Baqara. A man left (the row of the praying people) and offered (light) prayer (separately) and went away. When Mu`adh came to know about it, he said. \"He (that man) is a hypocrite.\" Later that man heard what Mu`adh said about him, so he came to the Prophet and said, \"O Allah's Apostle! We are people who work with our own hands and irrigate (our farms) with our camels. Last night Mu`adh led us in the (night) prayer and he recited Sura-al-Baqara, so I offered my prayer separately, and because of that, he accused me of being a hypocrite.\" The Prophet called Mu`adh and said thrice, \"O Mu`adh! You are putting the people to trials? Recite 'Washshamsi wad-uhaha' (91) or'Sabbih isma Rabbi ka-l-A'la' (87) or the like.\"",
      "usc_msa_ref": "127",
      "chain": [
        "30378",
        "20472",
        "20234",
        "11081",
        "34",
        "32"
      ]
    },
    {
      "id": "sahih-bukhari-7366",
      "hadith_no": "7366",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا محمد بن عبادة، أخبرنا يزيد، حدثنا سليم بن حيان  وأثنى عليه  حدثنا سعيد بن ميناء، حدثنا أو، سمعت جابر بن عبد الله، يقول جاءت ملائكة إلى النبي صلى الله عليه وسلم وهو نائم فقال بعضهم إنه نائم‏.‏ وقال بعضهم إن العين نائمة والقلب يقظان‏.‏ فقالوا إن لصاحبكم هذا مثلا فاضربوا له مثلا‏.‏ فقال بعضهم إنه نائم‏.‏ وقال بعضهم إن العين نائمة والقلب يقظان‏.‏ فقالوا مثله كمثل رجل بنى دارا، وجعل فيها مأدبة وبعث داعيا، فمن أجاب الداعي دخل الدار وأكل من المأدبة، ومن لم يجب الداعي لم يدخل الدار ولم يأكل من المأدبة‏.‏ فقالوا أولوها له يفقهها فقال بعضهم إنه نائم‏.‏ وقال بعضهم إن العين نائمة والقلب يقظان‏.‏ فقالوا فالدار الجنة، والداعي محمد صلى الله عليه وسلم فمن أطاع محمدا صلى الله عليه وسلم فقد أطاع الله، ومن عصى محمدا صلى الله عليه وسلم فقد عصى الله، ومحمد صلى الله عليه وسلم فرق بين الناس‏.‏ تابعه قتيبة عن ليث، عن خالد، عن سعيد بن أبي هلال، عن جابر، خرج علينا النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Some angels came to the Prophet while he was sleeping. Some of them said, \"He is sleeping.\" Others said, \"His eyes are sleeping but his heart is awake.\" Then they said, \"There is an example for this companion of yours.\" One of them said, \"Then set forth an example for him.\" Some of them said, \"He is sleeping.\" The others said, \"His eyes are sleeping but his heart is awake.\" Then they said, \"His example is that of a man who has built a house and then offered therein a banquet and sent an inviter (messenger) to invite the people. So whoever accepted the invitation of the inviter, entered the house and ate of the banquet, and whoever did not accept the invitation of the inviter, did not enter the house, nor did he eat of the banquet.\" Then the angels said, \"Interpret this example to him so that he may understand it.\" Some of them said, \"He is sleeping.'' The others said, \"His eyes are sleeping but his heart is awake.\" And then they said, \"The houses stands for Paradise and the call maker is Muhammad; and whoever obeys Muhammad, obeys Allah; and whoever disobeys Muhammad, disobeys Allah. Muhammad separated the people (i.e., through his message, the good is distinguished from the bad, and the believers from the disbelievers).",
      "usc_msa_ref": "385",
      "chain": [
        "30378",
        "20472",
        "20234",
        "11510",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-2250",
      "hadith_no": "2250",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا يزيد بن هارون، عن سليم بن حيان، قال حدثنا سعيد بن ميناء، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم صلى",
      "text_en": " Jabir b. 'Abdullah reported that the Messenger of Allah (may peace be upon him) offered prayer for Ashama, the Negus, and recited four takbirs.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20472",
        "20234",
        "11510",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-2800",
      "hadith_no": "2800",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني زهير بن حرب، ومحمد بن حاتم، جميعا عن ابن مهدي، - قال زهير حدثنا عبد الرحمن بن مهدي، - حدثنا سليم بن حيان، حدثنا سعيد بن ميناء، قال قال عبد الله بن عمرو قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا عبد الله بن عمرو بلغني أنك تصوم النهار وتقوم الليل فلا تفعل فإن لجسدك عليك حظا ولعينك عليك حظا وإن لزوجك عليك حظا صم وأفطر صم من كل شهر ثلاثة أيام فذلك صوم الدهر ‏\"‏ ‏.‏ قلت يا رسول الله إن بي قوة ‏.‏ قال ‏\"‏ فصم صوم داود - عليه السلام - صم يوما وأفطر يوما ‏\"‏ ‏.‏ فكان يقول يا ليتني أخذت بالرخصة ‏.‏",
      "text_en": " 'Abdullah b. 'Amr (Allah be pleased with them) reported that the Messenger of Allah (may peace be upon him) said to me! 'Abdullah b. 'Amr, it has been conveyed to me that you observe fast during the day and stand in prayer during the whole night. Don't do that, for your body has a share of its own in you, your eye has a share of its own in you, your wife has a share of her own in you. Observe fast and break it too. Fast for three days in every month and that is a prepetual fasting. I said! Messenger of Allah, I have got strength enough (to do more than this), whereupon he said:                      Then observe the fast of David (peace be upon him). Observe fast one day and break it (on the other) day. And he ('Abdullah b. 'Amr) used to say: Would that I had availed myself of this concession.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "38487",
        "20033",
        "20321",
        "20033",
        "20234",
        "11510",
        "29"
      ]
    },
    {
      "id": "sahih-muslim-3085",
      "hadith_no": "3085",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني محمد بن حاتم، حدثنا ابن مهدي، حدثني سليم بن حيان، عن مروان الأصفر، عن أنس، - رضى الله عنه - أن عليا، قدم من اليمن فقال له النبي صلى الله عليه وسلم ‏\"‏ بم أهللت ‏\"‏ ‏.‏ فقال أهللت بإهلال النبي صلى الله عليه وسلم ‏.‏ قال ‏\"‏ لولا أن معي الهدى لأحللت ‏\"‏ ‏.‏",
      "text_en": "  Anas (Allah be pleased with him) reported that 'Ali (Allah be pleased with him) came from the Yemen, and the Apostle (may peace be upon him) said:                      With (what intention) have you put on Ihram? He said: I have put on Ibram in accordance with the intention with which Allah's Apostle (may peace be upon him) has put on Ibram, whereupon he (the Holy Prophet) said: Had there not been the sacrificial animals with me, I would have put off Ihram (after performing 'Umra).",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "20033",
        "20234",
        "11611",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-3086",
      "hadith_no": "3086",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنيه حجاج بن الشاعر، حدثنا عبد الصمد، ح وحدثني عبد الله بن هاشم، حدثنا بهز، قالا حدثنا سليم بن حيان، بهذا الإسناد ‏.‏ مثله غير أن في رواية بهز ‏\"‏ لحللت‏\"‏ ‏.‏",
      "text_en": "  This hadith is narrated by Salim b. Hayyin with the same chain of transmitters, but with a slight variation of words.",
      "usc_msa_ref": "",
      "chain": [
        "20250",
        "20214",
        "20234"
      ]
    },
    {
      "id": "sahih-muslim-3308",
      "hadith_no": "3308",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني محمد بن حاتم، حدثني ابن مهدي، حدثنا سليم بن حيان، عن سعيد، - يعني ابن ميناء - قال سمعت عبد الله بن الزبير، يقول حدثتني خالتي، - يعني عائشة - قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ يا عائشة لولا أن قومك حديثو عهد بشرك لهدمت الكعبة فألزقتها بالأرض وجعلت لها بابين بابا شرقيا وبابا غربيا وزدت فيها ستة أذرع من الحجر فإن قريشا اقتصرتها حيث بنت الكعبة ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Zubair (Allah be pleased with him) reported on the authority of his mother's sister ('A'isha) saying that Allah's Messenger (may peace be upon him) said:                      'A'isha, if your people had not been recently polytheists (and new converts to Islam), I would have demolished the Ka'ba, and would have brought it to the level of the ground and would have constructed two doors, one facing the east and the other one to the west, and would have added to it six cubits of area from Hijr, for the Quraish had reduced it when they rebuilt it.",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "20033",
        "20234",
        "11510",
        "106"
      ]
    },
    {
      "id": "sahih-muslim-3993",
      "hadith_no": "3993",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنا عبد الله بن هاشم، حدثنا بهز، حدثنا سليم بن حيان، حدثنا سعيد بن، ميناء عن جابر بن عبد الله، قال نهى رسول الله صلى الله عليه وسلم عن المزابنة والمحاقلة والمخابرة وعن بيع الثمرة حتى تشقح ‏.‏ قال قلت لسعيد ما تشقح قال تحمار وتصفار ويؤكل منها ‏.‏",
      "text_en": " Jabir b. Abdullah (Allah be pleased with them) reported Allah's Messenger (may peace be upon him) forbidding Muzabana and Muhaqala, and Mukhabara, and the sale of fruits until they are ripe. I (the narrator) said to Sa'id (the other narrator):                      What does ripening imply? He said: It meant that they become red or become yellow and are fit for eating.",
      "usc_msa_ref": "",
      "chain": [
        "20214",
        "20234",
        "11510",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-4004",
      "hadith_no": "4004",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا عبيد الله بن عبد المجيد، حدثنا سليم بن، حيان حدثنا سعيد بن ميناء، قال سمعت جابر بن عبد الله، يقول إن رسول الله صلى الله عليه وسلم قال ‏\"‏ من كان له فضل أرض فليزرعها أو ليزرعها أخاه ولا تبيعوها ‏\"‏ ‏.‏ فقلت لسعيد ما قوله ولا تبيعوها يعني الكراء ‏.‏ قال نعم ‏.‏",
      "text_en": " Jabir b. Abdullah (Allah be pleased with them) heard Allah's Messenger (may peace be upon him) say:                      He who has surplus of land should either cultivate it himself, or let his brother cultivate it, an should not sell it. I (the narrator) said to Sa'id: What does his statement\" do not sell it\" mean? Does it imply\" rent\"? He said: Yes.",
      "usc_msa_ref": "",
      "chain": [
        "38834",
        "20234",
        "11510",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-4685",
      "hadith_no": "4685",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو كامل فضيل بن حسين كلاهما عن سليم، قال يحيى أخبرنا سليم بن أخضر، عن عبيد الله بن عمر، حدثنا نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قسم في النفل للفرس سهمين وللرجل سهما ‏.‏",
      "text_en": " It has been narrated on the authority of Ibn Umar that the Messenger of Allah (may peace be upon him) allowed two shares from the spoils to the horseman and one share to the footman.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20234",
        "20031",
        "20546",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-6098",
      "hadith_no": "6098",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثني محمد بن حاتم، حدثنا ابن مهدي، حدثنا سليم، عن سعيد بن ميناء، عن  جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مثلي ومثلكم كمثل رجل أوقد نارا فجعل الجنادب والفراش يقعن فيها وهو يذبهن عنها وأنا آخذ بحجزكم عن النار وأنتم تفلتون من يدي ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Abdullah reported Allah's Messenger (may peace be upon him) as saying. My example and your example is that of a person who lit the fire and insects and moths began to fall in it and he would be making efforts to take them out, and I am going to hold you back from fire, but you are slipping from my hand.",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "20033",
        "20234",
        "11510",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-6103",
      "hadith_no": "6103",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عفان، حدثنا سليم بن حيان، حدثنا سعيد، بن ميناء عن جابر، عن النبي صلى الله عليه وسلم قال ‏\"‏ مثلي ومثل الأنبياء كمثل رجل بنى دارا فأتمها وأكملها إلا موضع لبنة فجعل الناس يدخلونها ويتعجبون منها ويقولون لولا موضع اللبنة ‏\"‏ ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ فأنا موضع اللبنة جئت فختمت الأنبياء ‏\"‏ ‏.‏",
      "text_en": " Jabir reported Allah's Messenger (may peace be upon him) as saying:                      The similitude of mine and that of the Apostles is like that of a person who built a house and he completed it and made it perfect but for the space of a brick. People entered therein and they were surprised at it and said: Had there been a brick (it would have been complete in all respects). Allah's Messenger (may peace be upon him) said: I am that place where the brick (completing the building is to be placed), and I have come to finalise the chain of Apostles.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30106",
        "20234",
        "11510",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-3370",
      "hadith_no": "3370",
      "source": "Sunan Abi Da'ud",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو بكر، محمد بن خلاد الباهلي حدثنا يحيى بن سعيد، عن سليم بن حيان، أخبرنا سعيد بن ميناء، قال سمعت جابر بن عبد الله، يقول نهى رسول الله صلى الله عليه وسلم أن تباع الثمرة حتى تشقح ‏.‏ قيل وما تشقح قال تحمار وتصفار ويؤكل منها ‏.‏",
      "text_en": " Narrated Jabir bin ‘Abdullah :                     The Messenger of Allah (ﷺ) forbade the sale of fruits until they are ripened (tushqihah). He was asked: What do you mean by their ripening (ishqah)? He replied: They become red or yellow, and they are eaten.",
      "usc_msa_ref": "",
      "chain": [
        "20031",
        "20234",
        "11510",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-4621",
      "hadith_no": "4621",
      "source": "Sunan Abi Da'ud",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن عبيد، حدثنا سليم، عن ابن عون، قال كنت أسير بالشام فناداني رجل من خلفي فالتفت فإذا رجاء بن حيوة فقال يا أبا عون ما هذا الذي يذكرون عن الحسن قال قلت إنهم يكذبون على الحسن كثيرا ‏.‏",
      "text_en": " Ibn ‘Awn said:                      I was a prisoner in Syria. A man called me from behind. I turned towards him and suddenly found that it was Raja b. Haiwah. He said: Abu ‘Awn, what is this that the people are telling about al-Hasan? I said: They are much lying to al-Hasan.",
      "usc_msa_ref": "",
      "chain": [
        "30213",
        "20234",
        "11071",
        "11016"
      ]
    },
    {
      "id": "jami-al-tirmidhi-956",
      "hadith_no": "956",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الوارث بن عبد الصمد بن عبد الوارث، حدثني أبي، حدثنا سليم بن حيان، قال سمعت مروان الأصفر، عن أنس بن مالك، أن عليا، قدم على رسول الله صلى الله عليه وسلم من اليمن فقال ‏\"‏ بم أهللت ‏\"‏ ‏.‏ قال أهللت بما أهل به رسول الله صلى الله عليه وسلم ‏.‏ قال ‏\"‏ لولا أن معي هديا لأحللت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Anas bin Malik narrated:                     \"When Ali returned to the Messenger of Allah from Yemen he said: 'For what did you intended the Talbiyah?' He replied: 'I intended the Talbiyah for what the Messenger of Allah announced it.' So he (pbuh) said: 'If I did not have the Hadi with me then I would exit Ihram.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20234",
        "11611",
        "19"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3101",
      "hadith_no": "3101",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Parables - كتاب الأمثال عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "44",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا محمد بن سنان، حدثنا سليم بن حيان، بصري حدثنا سعيد بن ميناء، عن جابر بن عبد الله، قال قال النبي صلى الله عليه وسلم ‏\"‏ إنما مثلي ومثل الأنبياء قبلي كرجل بنى دارا فأكملها وأحسنها إلا موضع لبنة فجعل الناس يدخلونها ويتعجبون منها ويقولون لولا موضع اللبنة ‏\"‏ ‏.‏ وفي الباب عن أبى بن كعب وأبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Jabir bin 'Abdullah:                     that the Messenger of Allah (ﷺ) said: \"The parable of myself and the Prophets [before myself] is that of a man who constructed a house. He complete it and made it well, except for the space of one brick. So the people enter it and marvel at it saying: 'If not for the space of this brick.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "34207",
        "20234",
        "11510",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-2539",
      "hadith_no": "2539",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو عمر، حفص بن عمرو حدثنا عبد الرحمن بن مهدي، حدثنا سليم بن حيان، سمعت أبي يقول، سمعت أبا هريرة، يقول نشأت يتيما وهاجرت مسكينا وكنت أجيرا لابنة غزوان بطعام بطني وعقبة رجلي أحطب لهم إذا نزلوا وأحدو لهم إذا ركبوا فالحمد لله الذي جعل الدين قواما وجعل أبا هريرة إماما ‏.‏",
      "text_en": " Salim bin Hayyan said:                     I heard Abu Hurairah say: “I grew up an orphan, and I emigrated as a poor man, and I was hired by the daughter of Ghazwan in return for food and a turn riding the camel. I would gather firewood for them when they stopped to camp and urge their camels along for them by singing when they rode. Praise is to Allah (SWT) who has caused His religion to prevail and has made Abu Hurairah an Imam.”",
      "usc_msa_ref": "",
      "chain": [
        "20033",
        "20234",
        "14096",
        "13"
      ]
    }
  ],
  "total_hadiths": 23
}