{
  "id": "20239",
  "name": "Shu'aib bin Ishaq bin 'Abdur Rahman شعيب بن إسحاق بن عبد الرحمن",
  "full_name": "Shu'aib bin Ishaq bin 'Abdur Rahman شعيب بن إسحاق بن عبد الرحمن",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "98",
      "date_gregorian": "NA",
      "date_display": [
        "98 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "189",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra",
      "Damascus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "B.Umayya",
      "Client",
      "al-Basri",
      "al-Damashqi"
    ]
  },
  "parents": [
    {
      "id": "13628",
      "name": "Ishaq bin 'Abdur Rahman إسحاق بن عبد الرحمن",
      "grade": "Follower(Tabi')"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "37510",
      "name": "Shu'aib bin Shu'aib bin Ishaq شعيب بن شعيب بن إسحاق",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "teachers": [
    {
      "id": "13628",
      "name": "Ishaq bin 'Abdur Rahman إسحاق بن عبد الرحمن",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11001",
      "name": "Abu Hanifa أبو حنيفة‎‎",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11073",
      "name": "Sa'id bin Abi 'Aruba سعيد بن أبي عروبة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "30024",
      "name": "'Ubaidullah bin 'Umar al-Qawariri عبيد الله بن عمر القواريري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30248",
      "name": "Da'ud bin Rshyd داود بن رشيد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30502",
      "name": "al-Hakm bin Musa الحكم بن موسى البزاز",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30283",
      "name": "Ishaq bin Ibrahim bin Yazid إسحاق بن إبراهيم بن يزيد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30154",
      "name": "'Amr bin 'Awn/'Auf bin Aws عمرو بن عون/عوف بن أوس البزار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30309",
      "name": "Ibrahim bin Musa al-Razi al-Fara' إبراهيم بن موسى الرازي الفراء",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30547",
      "name": "Swyd bin Sa'id سويد بن سعيد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30216",
      "name": "Abu Karayb, Muhammad bin al-'Ala' محمد بن العلاء - أبو كريب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30288",
      "name": "Hisham bin 'Ammar bin Nasayr هشام بن عمار بن نصير",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1425",
      "hadith_no": "1425",
      "source": "Sahih Bukhari",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا إسحاق بن يزيد، أخبرنا شعيب بن إسحاق، قال الأوزاعي أخبرني يحيى بن أبي كثير، أن عمرو بن يحيى بن عمارة، أخبره عن أبيه، يحيى بن عمارة بن أبي الحسن أنه سمع أبا سعيد  رضى الله عنه  يقول قال النبي صلى الله عليه وسلم ‏\"‏ ليس فيما دون خمس أواق صدقة، وليس فيما دون خمس ذود صدقة، وليس فيما دون خمس أوسق صدقة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     Allah's Apostle (p.b.u.h) said, \"No Zakat is due on property mounting to less than five Uqiyas (of silver), and no Zakat is due on less than five camels, and there is no Zakat on less than five Wasqs.\" (A Wasqs equals 60 Sa's) & (1 Sa=3 K gms App.)",
      "usc_msa_ref": "487",
      "chain": [
        "20239",
        "20024",
        "11449",
        "11210",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-2337",
      "hadith_no": "2337",
      "source": "Sahih Bukhari",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا شعيب بن إسحاق، عن الأوزاعي، قال حدثني يحيى، عن عكرمة، عن ابن عباس، عن عمر  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الليلة أتاني آت من ربي وهو بالعقيق أن صل في هذا الوادي المبارك وقل عمرة في حجة ‏\"‏‏.‏",
      "text_en": " Narrated `Umar:                     While the Prophet was in Al-`Aqiq he said, \"Someone (meaning Gabriel) came to me from my Lord tonight (in my dream) and said, 'Offer the prayer in this blessed valley and say (I intend to perform) `Umra along with Hajj (together).' \"",
      "usc_msa_ref": "530",
      "chain": [
        "30123",
        "20239",
        "20024",
        "11449",
        "11023",
        "17",
        "3"
      ]
    },
    {
      "id": "sahih-muslim-1447",
      "hadith_no": "1447",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا عيسى بن يونس، وشعيب بن إسحاق الدمشقي، قالا حدثنا الأوزاعي، بهذا الإسناد غير أنه قال كنا ننحر الجزور على عهد رسول الله صلى الله عليه وسلم بعد العصر ‏.‏ ولم يقل كنا نصلي معه ‏.‏",
      "text_en": " This hadith has been reported by 'Auza'i with the same chain of transmitters:                      We used to slaughter the camel during the lifetime of the Messenger of Allah (may peace be upon him) after the 'Asr prayer, but he made no mention of:\" We used to pray along with him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20347",
        "20239"
      ]
    },
    {
      "id": "sahih-muslim-1474",
      "hadith_no": "1474",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا شعيب بن إسحاق الدمشقي، حدثنا الأوزاعي، حدثني أبو النجاشي، حدثني رافع بن خديج، قال كنا نصلي المغرب ‏.‏ بنحوه ‏.‏",
      "text_en": " A hadith like this, i. e.\" We used to observe evening prayer....\" so on and so forth, has been narrated by Rafi' b. Khadij by another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30021",
        "20239",
        "20024",
        "1986"
      ]
    },
    {
      "id": "sahih-muslim-2374",
      "hadith_no": "2374",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنيه زهير بن حرب، حدثنا يحيى بن سعيد، ح وحدثنا أبو كريب، حدثنا أبو أسامة، ح وحدثني علي بن حجر، أخبرنا علي بن مسهر، ح حدثنا الحكم بن موسى، حدثنا شعيب بن إسحاق، كلهم عن هشام، بهذا الإسناد ‏.‏ وفي حديث أبي أسامة ولم توص ‏.‏ كما قال ابن بشر ولم يقل ذلك الباقون ‏.‏",
      "text_en": "  This hadith has been narrated on the authority of Hisham with the same chain of transmitters. And in the hadith transmitted by Abu Usama the words are:                     \" She did not make any will,\" as it has been reported by Ibn Bishr, but it was not reported by the rest of the narrators.",
      "usc_msa_ref": "",
      "chain": [
        "20031",
        "30216",
        "20318",
        "20387",
        "20345",
        "30502",
        "20239"
      ]
    },
    {
      "id": "sahih-muslim-3135",
      "hadith_no": "3135",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني الحكم بن موسى القنطري، حدثنا شعيب بن إسحاق، عن هشام بن عروة، عن عروة، عن عائشة، قالت طاف النبي صلى الله عليه وسلم في حجة الوداع حول الكعبة على بعيره يستلم الركن كراهية أن يضرب عنه الناس ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported that Allah's Apostle (may peace be upon him) circumambulated the Ka'ba on the back of his camel on the occasion of the Farewell Pilgrimage and touched the corner and he did not like that the people should be pushed away from him.",
      "usc_msa_ref": "",
      "chain": [
        "30502",
        "20239",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-4116",
      "hadith_no": "4116",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا شعيب بن إسحاق، حدثنا الأوزاعي، حدثني يحيى بن أبي كثير، حدثني أبو سلمة بن عبد الرحمن، حدثني أبو هريرة، عن رسول الله صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been transmitted on the authority of Abu Huraira.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20239",
        "20024",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-4309",
      "hadith_no": "4309",
      "source": "Sahih Muslim",
      "chapter": "The Book of Bequests - كتاب الوصية",
      "chapter_no": "26",
      "text_ar": "وحدثناه أبو كريب، حدثنا أبو أسامة، ح وحدثني الحكم بن موسى، حدثنا شعيب، بن إسحاق ح وحدثني أمية بن بسطام، حدثنا يزيد، - يعني ابن زريع - حدثنا روح، - وهو ابن القاسم - ح وحدثنا أبو بكر بن أبي شيبة، حدثنا جعفر بن عون، كلهم عن هشام بن عروة، بهذا الإسناد أما أبو أسامة وروح ففي حديثهما فهل لي أجر كما قال يحيى بن سعيد ‏.‏ وأما شعيب وجعفر ففي حديثهما أفلها أجر كرواية ابن بشر ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Hisham b. 'Urwa with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20318",
        "30502",
        "20239",
        "30124",
        "20304",
        "11586",
        "30201",
        "20416"
      ]
    },
    {
      "id": "sahih-muslim-4533",
      "hadith_no": "4533",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "حدثني الحكم بن موسى أبو صالح، حدثنا شعيب بن إسحاق، أخبرنا عبيد الله، عن نافع، أن عبد الله بن عمر، أخبره أن رسول الله صلى الله عليه وسلم أتي بيهودي ويهودية قد زنيا فانطلق رسول الله صلى الله عليه وسلم حتى جاء يهود فقال ‏\"‏ ما تجدون في التوراة على من زنى ‏\"‏ ‏.‏ قالوا نسود وجوههما ونحملهما ونخالف بين وجوههما ويطاف بهما ‏.‏ قال ‏\"‏ فأتوا بالتوراة إن كنتم صادقين ‏\"‏ ‏.‏ فجاءوا بها فقرءوها حتى إذا مروا بآية الرجم وضع الفتى الذي يقرأ يده على آية الرجم وقرأ ما بين يديها وما وراءها فقال له عبد الله بن سلام وهو مع رسول الله صلى الله عليه وسلم مره فليرفع يده فرفعها فإذا تحتها آية الرجم فأمر بهما رسول الله صلى الله عليه وسلم فرجما ‏.‏ قال عبد الله بن عمر كنت فيمن رجمهما فلقد رأيته يقيها من الحجارة بنفسه ‏.‏",
      "text_en": " Abdullah b. 'Umar reported that a Jew and a Jewess were brought to Allah's Messenger (may peace be upon him) who had committed adultery. Allah's Messenger (may peace be upon him) came to the Jews and said:                      What do you find in Torah for one who commits adultery? They said: We darken their faces and make them ride on the donkey with their faces turned to the opposite direction (and their backs touching each other), and then they are taken round (the city). He said: Bring Torah if you are truthful. They brought it and recited it until when they came to the verse pertaining to stoning, the person who was reading placed his hand on the verse pertaining to stoning, and read (only that which was) between his hands and what was subsequent to that. Abdullah b. Salim who was at that time with the Messenger of Allah (may peace be upon him) said: Command him (the reciter) to lift his hand. He lifted it and there was, underneath that, the verse pertaining to stoning. Allah's Messenger (may peace be upon him) pronounced judgment about both of them and they were stoned. Abdullah b. 'Umar said: I was one of those who stoned them, and I saw him (the Jew) protecting her (the Jewess) with his body.",
      "usc_msa_ref": "",
      "chain": [
        "30502",
        "20239",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-5547",
      "hadith_no": "5547",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثني إبراهيم بن موسى الرازي، أخبرنا شعيب بن إسحاق الدمشقي، عن الأوزاعي، حدثني شداد أبو عمار، حدثني أبو أمامة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من لبس الحرير في الدنيا لم يلبسه في الآخرة ‏\"‏ ‏.‏",
      "text_en": " Abu Umama reported Allah's Messenger (may peace be upon him) having said:                      He who wore silk in this world would not wear it in the Hereafter.",
      "usc_msa_ref": "",
      "chain": [
        "30309",
        "20239",
        "20024",
        "10881",
        "4048"
      ]
    },
    {
      "id": "sahih-muslim-5740",
      "hadith_no": "5740",
      "source": "Sahih Muslim",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا الحكم بن موسى أبو صالح، حدثنا شعيب، - يعني ابن إسحاق - أخبرني  هشام بن عروة، حدثني عروة بن الزبير، وفاطمة بنت المنذر بن الزبير، أنهما قالا خرجت أسماء بنت أبي بكر حين هاجرت وهي حبلى بعبد الله بن الزبير فقدمت قباء فنفست بعبد الله بقباء ثم خرجت حين نفست إلى رسول الله صلى الله عليه وسلم ليحنكه فأخذه رسول الله صلى الله عليه وسلم منها فوضعه في حجره ثم دعا بتمرة قال قالت عائشة فمكثنا ساعة نلتمسها قبل أن نجدها فمضغها ثم بصقها في فيه فإن أول شىء دخل بطنه لريق رسول الله صلى الله عليه وسلم ثم قالت أسماء ثم مسحه وصلى عليه وسماه عبد الله ثم جاء وهو ابن سبع سنين أو ثمان ليبايع رسول الله صلى الله عليه وسلم وأمره بذلك الزبير فتبسم رسول الله صلى الله عليه وسلم حين رآه مقبلا إليه ثم بايعه ‏.‏",
      "text_en": " 'Urwa b. Zubair and Fatima daughter of Mandhir b. Zubair, reported that Asma' daughter of Abu Bakr was at the time of migration in the family way with 'Abdullah b. Zubair (in her womb). She came to Quba' and gave birth to 'Abdullah at that place and then sent him to Allah's Messenger (may peace be upon him) so that he should rub his palate with chewed dates. Allah's Messenger (may peace he upon him) took hold of him (the child) and he placed him in his lap and then called for dates. 'A'isha said:                      Some time was spent before we were able to find them. He (the Holy Prophet) chewed them and then put his saliva in his mouth. The first thing that entered his stomach, was the saliva of Allah's Messenger (may peace be upon him). Asma' said: He then rubbed him and blessed him and gave him the name of Abdullah. He ('Abdullah) went to him (the Holy Prophet) when he had attained the age of seven or eight years in order to pledge allegiance to Allah's Messenger (may peace be upon him) as Zubair had commanded him to do. Allah's Messenger (may peace be upon him) smiled when he saw him coming towards him and then accepted his allegiance.",
      "usc_msa_ref": "",
      "chain": [
        "30502",
        "20239",
        "11065",
        "10511",
        "10526"
      ]
    },
    {
      "id": "sahih-muslim-7657",
      "hadith_no": "7657",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثني الحكم بن موسى أبو صالح، حدثنا شعيب بن إسحاق، أخبرنا عبيد الله، عن نافع، أن عبد الله بن عمر، أخبره أن الناس نزلوا مع رسول الله صلى الله عليه وسلم على الحجر أرض ثمود فاستقوا من آبارها وعجنوا به العجين فأمرهم رسول الله صلى الله عليه وسلم أن يهريقوا ما استقوا ويعلفوا الإبل العجين وأمرهم أن يستقوا من البئر التي كانت تردها الناقة ‏.‏",
      "text_en": " Abdullah b. 'Umar reported that the people encamped along with Allah's Messenger (may peace be upon him) in the valley of Hijr, the habitations of Thamud, and they quenched their thirst from the wells thereof and kneaded the flour with it. Thereupon Allah's Messenger (may peace be upon him) commanded that the water collected for drinking should be spilt and the flour should be given to the camels and commanded them that the water for drinking should be taken from that well where the she-camel (of Hadrat Salih) used to come.",
      "usc_msa_ref": "",
      "chain": [
        "30502",
        "20239",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-655",
      "hadith_no": "655",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا بقية، وشعيب بن إسحاق، عن الأوزاعي، حدثني محمد بن الوليد، عن سعيد بن أبي سعيد، عن أبيه، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا صلى أحدكم فخلع نعليه فلا يؤذ بهما أحدا ليجعلهما بين رجليه أو ليصل فيهما ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      when any of you prays and takes off his sandals, he should not harm anyone by them. He should place them between his feet or pray with them on",
      "usc_msa_ref": "",
      "chain": [
        "38363",
        "20644",
        "20239",
        "20024",
        "20459",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-746",
      "hadith_no": "746",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن معاذ، حدثنا أبي ح، وحدثنا موسى بن مروان، حدثنا شعيب، - يعني ابن إسحاق المعنى - عن عمران، عن لاحق، عن بشير بن نهيك، قال قال أبو هريرة لو كنت قدام النبي صلى الله عليه وسلم لرأيت إبطيه ‏.‏ زاد ابن معاذ قال يقول لاحق ألا ترى أنه في الصلاة ولا يستطيع أن يكون قدام رسول الله صلى الله عليه وسلم وزاد موسى يعني إذا كبر رفع يديه ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     If I were in front of the Prophet (ﷺ), I would see his armpits. Ibn Mu'adh added that Lahiq said: Do you not see, AbuHurayrah could not stand in front of the Prophet (ﷺ) while he was praying. Musa added: When he uttered the takbir, he raised his hands.",
      "usc_msa_ref": "",
      "chain": [
        "30150",
        "20286",
        "35154",
        "20239",
        "123",
        "11313",
        "11266"
      ]
    },
    {
      "id": "sunan-abi-daud-836",
      "hadith_no": "836",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا أبي وبقية، عن شعيب، عن الزهري، قال أخبرني أبو بكر بن عبد الرحمن، وأبو سلمة أن أبا هريرة، كان يكبر في كل صلاة من المكتوبة وغيرها يكبر حين يقوم ثم يكبر حين يركع ثم يقول سمع الله لمن حمده ثم يقول ربنا ولك الحمد قبل أن يسجد ثم يقول الله أكبر حين يهوي ساجدا ثم يكبر حين يرفع رأسه ثم يكبر حين يسجد ثم يكبر حين يرفع رأسه ثم يكبر حين يقوم من الجلوس في اثنتين فيفعل ذلك في كل ركعة حتى يفرغ من الصلاة ثم يقول حين ينصرف والذي نفسي بيده إني لأقربكم شبها بصلاة رسول الله صلى الله عليه وسلم إن كانت هذه لصلاته حتى فارق الدنيا ‏.‏ قال أبو داود هذا الكلام الأخير يجعله مالك والزبيدي وغيرهما عن الزهري عن علي بن حسين ووافق عبد الأعلى عن معمر شعيب بن أبي حمزة عن الزهري ‏.‏",
      "text_en": " Abu bakr b. ‘Abd al-Rahman and abu Salamah said:                      Abu Hurairah would utter the takbir in every prayer, whether obligatory or non-obligatory, He would utter the takbir when he stood, and he would utter the takbir when he bowed, then he would say: “Allah listens to him who praises Him”; he then would say before prostrating himself; “ Our Lord, to Thee be praise”; then he would say while falling in prostration: “Allah is most great”; he then would utter the takbir when he raised his head after prostration, and then utter the takbir when he prostrated, and then utter takbir the takbir when he stood up at the end of two rak’ahs after sitting down. He used to do so in every rak’ah until he finished his prayer. Then he would say at the end of the prayer: By Him in Whose hands lies my life, I am closer to the Messenger of Allah(ﷺ) in respect of his prayer. Such was the prayer he used to offer until he departed from the world.Abu Dawud said: Malik, al-Zubaidi and others have narrated so that they form the last words from al-Zuhri on the authority of ‘Ali b, Husain. And this is supported by the version reported by ‘Abd al-A’la from Ma’mar and SHu’aib b. Abi Hamzah on the authority of Al-Zuhri.",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "20239",
        "11013",
        "11003",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-1035",
      "hadith_no": "1035",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا أبي وبقية، قالا حدثنا شعيب، عن الزهري، بمعنى إسناده وحديثه زاد وكان منا المتشهد في قيامه ‏.‏ قال أبو داود وكذلك سجدهما ابن الزبير قام من ثنتين قبل التسليم وهو قول الزهري ‏.‏",
      "text_en": " This tradition (mentioned above) has also been transmitted by al-Zuhri through a different chain of narrators to the same effect. This version adds:                      Some of us recited the Tashahhud while they were standing.Abu Dawud said: Ibn-Zubair made two prostrations before giving the salutation in a similar way when he stood up at the end of two rak’ahs. This is the opinion of al-Zuhrl.",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "20239"
      ]
    },
    {
      "id": "sunan-abi-daud-1802",
      "hadith_no": "1802",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا شعيب بن إسحاق، عن ابن جريج، ح حدثنا أبو بكر بن خلاد، حدثنا يحيى، - المعنى - عن ابن جريج، أخبرني الحسن بن مسلم، عن طاوس، عن ابن عباس، أن معاوية بن أبي سفيان، أخبره قال قصرت عن النبي صلى الله عليه وسلم بمشقص على المروة ‏.‏ أو رأيته يقصر عنه على المروة بمشقص ‏.‏ قال ابن خلاد إن معاوية لم يذكر أخبره ‏.‏",
      "text_en": " Ibn ‘Abbas said that Mu’awiyah reported to him I clipped some hair of the Prophet’s(ﷺ) head with a broad iron arrowhead at Al Marwah; or (he said) I saw him that the hair of his head was clipped with a broad iron arrowhead at Al Marwah.The narrator Ibn Khallad said in his version “Mu’awiyah said” and not the word “reported”.",
      "usc_msa_ref": "",
      "chain": [
        "38363",
        "20239",
        "11070",
        "30357",
        "11070",
        "11557",
        "11053",
        "17",
        "27"
      ]
    },
    {
      "id": "sunan-abi-daud-2884",
      "hadith_no": "2884",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wills (Kitab Al-Wasaya) - كتاب الوصايا",
      "chapter_no": "18",
      "text_ar": "حدثنا محمد بن العلاء، أن شعيب بن إسحاق، حدثهم عن هشام بن عروة، عن وهب بن كيسان، عن جابر بن عبد الله، أنه أخبره أن أباه توفي وترك عليه ثلاثين وسقا لرجل من يهود فاستنظره جابر فأبى فكلم جابر النبي صلى الله عليه وسلم أن يشفع له إليه فجاء رسول الله صلى الله عليه وسلم وكلم اليهودي ليأخذ ثمر نخله بالذي له عليه فأبى عليه وكلمه رسول الله صلى الله عليه وسلم أن ينظره فأبى ‏.‏ وساق الحديث ‏.‏",
      "text_en": " Narrated Jabir bin ‘Abdullah :                     That his father died and left a debt of thirty wasqs of a Jew on him. Jabir asked him to defer, but he refused. Jabir then spoke to the Messenger of Allah (ﷺ) asking him to mediate to him on his behalf. The Messenger of Allah (ﷺ) came to the Jew and spoke to him about taking fruit-dates in lieu of the debt that was on him. But he refused. The Messenger of Allah (ﷺ) asked him to defer (the debt) to him, but he refused. He then narrated the rest of the tradition.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20239",
        "11065",
        "11231",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-3201",
      "hadith_no": "3201",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا موسى بن مروان الرقي، حدثنا شعيب، - يعني ابن إسحاق - عن الأوزاعي، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، قال صلى رسول الله صلى الله عليه وسلم على جنازة فقال ‏\"‏ اللهم اغفر لحينا وميتنا وصغيرنا وكبيرنا وذكرنا وأنثانا وشاهدنا وغائبنا اللهم من أحييته منا فأحيه على الإيمان ومن توفيته منا فتوفه على الإسلام اللهم لا تحرمنا أجره ولا تضلنا بعده ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     When the Messenger of Allah (ﷺ) prayed over a dead person, he said: O Allah, forgive those of us who are living and those of us who are dead, those of us who are present and those of us who are absent, our young and our old, our male and our female. O Allah, to whomsoever of us Thou givest life grant him life as a believer, and whomsoever of us Thou takest in death take him in death as a follower of Islam. O Allah, do not withhold from us the reward (of faith) and do not lead us astray after his death.",
      "usc_msa_ref": "",
      "chain": [
        "35154",
        "20239",
        "20024",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-3313",
      "hadith_no": "3313",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا داود بن رشيد، حدثنا شعيب بن إسحاق، عن الأوزاعي، عن يحيى بن أبي كثير، قال حدثني أبو قلابة، قال حدثني ثابت بن الضحاك، قال ‏:‏ نذر رجل على عهد رسول الله صلى الله عليه وسلم أن ينحر إبلا ببوانة، فأتى النبي صلى الله عليه وسلم فقال ‏:‏ إني نذرت أن أنحر إبلا ببوانة ‏.‏ فقال النبي صلى الله عليه وسلم ‏:‏ ‏\"‏ هل كان فيها وثن من أوثان الجاهلية يعبد ‏\"‏ ‏.‏ قالوا ‏:‏ لا ‏.‏ قال ‏:‏ ‏\"‏ هل كان فيها عيد من أعيادهم ‏\"‏ ‏.‏ قالوا ‏:‏ لا ‏.‏ قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ أوف بنذرك، فإنه لا وفاء لنذر في معصية الله ولا فيما لا يملك ابن آدم ‏\"‏ ‏.‏",
      "text_en": " Narrated Thabit ibn ad-Dahhak:                     In the time of the Prophet (ﷺ) a man took a vow to slaughter a camel at Buwanah. So he came to the Prophet (ﷺ) and said: I have taken a vow to sacrifice a camel at Buwanah. The Prophet (ﷺ) asked: Did the place contain any idol worshipped in pre-Islamic times? They (the people) said: No. He asked: Was any pre-Islamic festival observed there? They replied: No. The Prophet (ﷺ) said: Fulfil your vow, for a vow to do an act of disobedience to Allah must not be fulfilled, neither must one do something over which a human being has no control.",
      "usc_msa_ref": "",
      "chain": [
        "30248",
        "20239",
        "20024",
        "11449",
        "11047",
        "1902"
      ]
    },
    {
      "id": "sunan-abi-daud-5003",
      "hadith_no": "5003",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى، عن ابن أبي ذئب، ح وحدثنا سليمان بن عبد الرحمن الدمشقي، حدثنا شعيب بن إسحاق، عن ابن أبي ذئب، عن عبد الله بن السائب بن يزيد، عن أبيه، عن جده، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يأخذن أحدكم متاع أخيه لاعبا ولا جادا ‏\"‏ ‏.‏ وقال سليمان ‏\"‏ لعبا ولا جدا ‏\"‏ ‏.‏ ‏\"‏ ومن أخذ عصا أخيه فليردها ‏\"‏ ‏.‏ لم يقل ابن بشار ابن يزيد وقال قال رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abdullah ibn as-Sa'ib ibn Yazid:                     The Messenger of Allah (ﷺ) said: None of you should take the property of his brother in amusement (i.e. jest), nor in earnest. The narrator Sulayman said: Out of amusement and out of earnest. If anyone takes the staff of his brother, he should return it. The transmitter Ibn Bashshar did not say \"Ibn Yazid, and he said: The Messenger of Allah (ﷺ) said.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20177",
        "30587",
        "20239",
        "20177",
        "12216",
        "3047"
      ]
    },
    {
      "id": "sunan-an-nasai-599",
      "hadith_no": "599",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرني عمرو بن عثمان، قال حدثنا بقية، عن ابن أبي حمزة، ح وأنبأنا أحمد بن محمد بن المغيرة، قال حدثنا عثمان، - واللفظ له - عن شعيب، عن الزهري، قال أخبرني سالم، عن أبيه، قال رأيت رسول الله صلى الله عليه وسلم إذا أعجله السير في السفر يؤخر صلاة المغرب حتى يجمع بينها وبين العشاء ‏.‏",
      "text_en": " It was narrated that Az-Zuhri said:                      \"Salim told me that his father said: 'I saw the Messenger of Allah (ﷺ), when he was in a hurry to travel, delaying Maghrib so that he could combine it with 'Isha'.'\"",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "20644",
        "30304",
        "20239",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-876",
      "hadith_no": "876",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا علي بن عياش، قال حدثنا شعيب، عن الزهري، قال حدثني سالم، ح وأخبرني أحمد بن محمد بن المغيرة، قال حدثنا عثمان، - هو ابن سعيد - عن شعيب، عن محمد، - وهو الزهري - قال أخبرني سالم بن عبد الله بن عمر، عن ابن عمر، قال رأيت رسول الله صلى الله عليه وسلم إذا افتتح التكبير في الصلاة رفع يديه حين يكبر حتى يجعلهما حذو منكبيه وإذا كبر للركوع فعل مثل ذلك ثم إذا قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ فعل مثل ذلك وقال ‏\"‏ ربنا ولك الحمد ‏\"‏ ‏.‏ ولا يفعل ذلك حين يسجد ولا حين يرفع رأسه من السجود ‏.‏",
      "text_en": " It was narrated that Ibn Umar said:                     I saw the Messenger of Allah (ﷺ) when he said the opening Takbir of the prayer, raise his hands until they were level with his shoulders. When he said the Takbir before bowing he did likewise, and when he said: 'Sami Allahu liman hamidah (Allah hears those who praise Him),' he did likewise, then he said: 'Rabbana wa lakal-hamd (Our Lord, to You be praise).' But he did not do that when he prostrated or when he raised his head from prostration.",
      "usc_msa_ref": "",
      "chain": [
        "38433",
        "20448",
        "20428",
        "11013",
        "11011",
        "30304",
        "28388",
        "20239",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-1309",
      "hadith_no": "1309",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عمرو بن عثمان، قال حدثنا أبي، عن شعيب، عن الزهري، قال أخبرني عروة بن الزبير، أن عائشة، أخبرته أن رسول الله صلى الله عليه وسلم كان يدعو في الصلاة ‏\"‏ اللهم إني أعوذ بك من عذاب القبر وأعوذ بك من فتنة المسيح الدجال وأعوذ بك من فتنة المحيا والممات اللهم إني أعوذ بك من المأثم والمغرم ‏\"‏ ‏.‏ فقال له قائل ما أكثر ما تستعيذ من المغرم فقال ‏\"‏ إن الرجل إذا غرم حدث فكذب ووعد فأخلف ‏\"‏ ‏.‏",
      "text_en": " Urwah bin Az-Zbair narrated that:                     Aishah told him that the Messenger of Allah (ﷺ) used to say the following supplication in his prayer: Allahumma inni audhu bika min 'adhab ilqabri wa 'audhu bika min fitnatil-masihid-dajjal, wa 'audhu bika min fitnatil-mahya walmamati, Allahumma inni 'audhu bika min al-ma'thami wal-maghram ( O Allah, I seek refuge with You from the torment of the grave, and I seek refuge in You from the tribulation of the Al-Masihid-Dajjal, and I seek refuge with You from the trials of life and death. O Allah, I seek refuge in You from sin and debt.) Someone said to him: \"How often you seek refuge from debt!\" He said: \"If a man gets into debt, when he speaks lies, and when he makes a promise, he betrays it.\"",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "4",
        "20239",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-2190",
      "hadith_no": "2190",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عبد الملك بن شعيب بن الليث بن سعد، قال أخبرني أبي، عن جدي، قال أخبرني شعيب بن إسحاق، عن الأوزاعي، وابن أبي عروبة، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم أنه كان يقول ‏\"‏ ألا لا تقدموا الشهر بيوم أو اثنين إلا رجل كان يصوم صياما فليصمه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah used to say:                     \"Do not fast onw or two days ahead of the month, unless the one who used to observe a regular fast. In that case let him fast.\" '",
      "usc_msa_ref": "",
      "chain": [
        "20239",
        "20024",
        "11073",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2721",
      "hadith_no": "2721",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عمران بن يزيد، قال أنبأنا شعيب، - يعني ابن إسحاق - قال أنبأنا ابن جريج، ح وأخبرني إبراهيم بن الحسن، قال حدثنا حجاج، قال قال ابن جريج أخبرني حسن بن مسلم، عن مجاهد، وغيره، عن رجل، من أهل العراق يقال له شقيق بن سلمة أبو وائل أن رجلا من بني تغلب يقال له الصبى بن معبد وكان نصرانيا فأسلم فأقبل في أول ما حج فلبى بحج وعمرة جميعا فهو كذلك يلبي بهما جميعا فمر على سلمان بن ربيعة وزيد بن صوحان فقال أحدهما لأنت أضل من جملك هذا ‏.‏ فقال الصبى فلم يزل في نفسي حتى لقيت عمر بن الخطاب فذكرت ذلك له فقال هديت لسنة نبيك صلى الله عليه وسلم ‏.‏ قال شقيق وكنت أختلف أنا ومسروق بن الأجدع إلى الصبى بن معبد نستذكره فلقد اختلفنا إليه مرارا أنا ومسروق بن الأجدع ‏.‏",
      "text_en": " It was narrated from Mujahid and others, from a man from the people of Al-Iraq who was called Shaqiq bin Salmah Abu Wail, that:                     there was a man from Banu Taghlib, who was called As-Subai bin Mabad, who had been a Christian, then became of Muslim.The first time he went for Hajj, he recited the Talbiyah  Hajj and \"Umrah together, and he continued to recite the Talbiyah for them together, He passed by Salman bin Rabiah and Zaid bin suhan, and one to then said; \"You are more lost than this camel of yours.\" As-Subai\" said: \"This upset me until I met 'Umar bin Al-Khattab, and I mentioned that to him. He said: 'Yuou have been guided to the sunnah of your Prophet shaqiq said: \"Masruq bin Al-Ajda and I often used to visit As-Subai bin Ma'bad and talk with him\"",
      "usc_msa_ref": "",
      "chain": [
        "20239",
        "11070",
        "38070",
        "20219",
        "11070",
        "11028"
      ]
    },
    {
      "id": "sunan-an-nasai-2798",
      "hadith_no": "2798",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عمران بن يزيد، قال أنبأنا شعيب بن إسحاق، قال أنبأنا ابن جريج، قال أخبرني جعفر بن محمد، عن أبيه، سمعه يحدث، عن جابر، أنه سمعه يحدث، أن النبي صلى الله عليه وسلم ساق هديا في حجه ‏.‏",
      "text_en": " It was narrated that Jabir said:                     That the Prophet drove a Hadi during his Hajj.",
      "usc_msa_ref": "",
      "chain": [
        "20239",
        "11070",
        "10898",
        "11442",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-2858",
      "hadith_no": "2858",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عمران بن يزيد، قال حدثنا شعيب بن إسحاق، قال أخبرني ابن جريج، قال أخبرني عمرو بن دينار، أن سعيد بن جبير، أخبره أن ابن عباس أخبره قال أقبل رجل حراما مع رسول الله صلى الله عليه وسلم فخر من فوق بعيره فوقص وقصا فمات فقال رسول الله صلى الله عليه وسلم ‏\"‏ اغسلوه بماء وسدر وألبسوه ثوبيه ولا تخمروا رأسه فإنه يأتي يوم القيامة يلبي ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn Abbas said:                     \"A man in Ihram came with the Messenger of Allah and fell from atop his camel, breaking his neck, and he died. The Messenger of Allah said: 'Wash him with water and lotus leaves, and wrap him in his two garments. But do not cover his head, for he will be raised on the Day of Resurrection reciting the Talbiyah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20239",
        "11070",
        "11081",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-2928",
      "hadith_no": "2928",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني عمرو بن عثمان، قال حدثنا شعيب، - وهو ابن إسحاق - عن هشام بن عروة، عن أبيه، عن عائشة، قالت طاف رسول الله صلى الله عليه وسلم في حجة الوداع حول الكعبة على بعير يستلم الركن بمحجنه ‏.‏",
      "text_en": " It was narrated that Aishah said:                     \"The Messenger of Allah performed Tawaf around the Kabah during the farewell pilgrimeage on a camel, touching the Corner with his crooked-ended stick.\" (Sahih)Chpater 141. Tawaf For The One Who Is Performing Hajj Al-Ifrad",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "20239",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-2968",
      "hadith_no": "2968",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني عمرو بن عثمان، قال حدثنا أبي، عن شعيب، عن الزهري، عن عروة، قال سألت عائشة عن قول الله، عز وجل ‏{‏ فلا جناح عليه أن يطوف بهما ‏}‏ فوالله ما على أحد جناح أن لا يطوف بالصفا والمروة ‏.‏ قالت عائشة بئسما قلت يا ابن أختي إن هذه الآية لو كانت كما أولتها كانت فلا جناح عليه أن لا يطوف بهما ولكنها نزلت في الأنصار قبل أن يسلموا كانوا يهلون لمناة الطاغية التي كانوا يعبدون عند المشلل وكان من أهل لها يتحرج أن يطوف بالصفا والمروة فلما سألوا رسول الله صلى الله عليه وسلم عن ذلك أنزل الله عز وجل ‏{‏ إن الصفا والمروة من شعائر الله فمن حج البيت أو اعتمر فلا جناح عليه أن يطوف بهما ‏}‏ ثم قد سن رسول الله صلى الله عليه وسلم الطواف بينهما فليس لأحد أن يترك الطواف بهما ‏.‏",
      "text_en": " It was narrated that Urwah said:                     \"I asked Aishah about the words of Allah, the Mighty and Sublime: 'So it sin not a sin on him who perform Hajj or Umrah (Pilgrimage) of the House (the Kabah at Makkah) to perform the going (Tawaf) between them (as-Safa and Al-Marwah) and (I said): 'By Allah, there is no sin on anyone if he does not go between As-Safa and Al-Marwa.' Aishah said: 'What a bad thing you said, O son of my brother! If this Ayah was as you have interpreted it, there would be no sin on a person if he did not go between them. But it was revealed concering the Ansar. Before they accepted Islam, they sued to enter Ihram for the false goddess Manat whom they used to worship at Al-Mushallal. Whoever enter Ihram for her would refrain from going between As-Safa and Al-Marwah. When they asked the Messenger of Allah about that, Allah, the Might and Sublime, revealed: 'Verily As-Safa and Al-Marwah (Two mountains in Makkah) are of the Symbols of Allah. So it is not a sin on him who performs Hajj or Urmrah (Pilgrimage) of the House (the Kabah at Makkah) to perform the going (Tawaf) between them (As-Safa and Al-Marwah). Then the Messenger of Allah enjoined going between them so no one has the right to refrain from going between them.'\"",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "4",
        "20239",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-3092",
      "hadith_no": "3092",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا أحمد بن محمد بن مغيرة، قال حدثنا عثمان بن سعيد، عن شعيب، عن الزهري، قال حدثنا عبيد الله، ح وأنبأنا كثير بن عبيد، قال حدثنا بقية، عن شعيب، قال حدثني الزهري، عن عبيد الله بن عبد الله بن عتبة بن مسعود، أن أبا هريرة، قال لما توفي رسول الله صلى الله عليه وسلم وكان أبو بكر بعده وكفر من كفر من العرب قال عمر رضى الله عنه يا أبا بكر كيف تقاتل الناس وقد قال رسول الله صلى الله عليه وسلم ‏\"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فمن قال لا إله إلا الله فقد عصم مني ماله ونفسه إلا بحقه وحسابه على الله ‏\"‏ ‏.‏ قال أبو بكر رضى الله عنه لأقاتلن من فرق بين الصلاة والزكاة فإن الزكاة حق المال والله لو منعوني عناقا كانوا يؤدونها إلى رسول الله صلى الله عليه وسلم لقاتلتهم على منعها ‏.‏ قال عمر فوالله ما هو إلا أن رأيت أن الله عز وجل شرح صدر أبي بكر للقتال فعرفت أنه الحق ‏.‏ واللفظ لأحمد ‏.‏",
      "text_en": " It was narrated from 'Ubaidullah bin 'Abdullah bin 'Utbah bin Mas'ud that Abu Hurairah said:                      \"When the Messenger of Allah (ﷺ) died and Abu Bakr (was appointed Khalifah) after him, and some of the 'Arabs disbelieved, 'Umar, may Allah be pleased with him, said: 'O Abu Bakr, how can you fight the people when the Messenger of Allah (ﷺ) said: I have been commanded to fight the people until they say La ilaha illallah (there is none worthy of worship except Allah.) Whoever says La ilaha illallah, his life and his property are safe from me, except for its right, and his reckoning will be with Allah?'\" Abu Bakr, may Allah be pleased with him, said: \"I will surely fight those who separate prayer and Zakah, for Zakah is what is due on wealth. By Allah, if they withhold from me a small she-goat that they used to give to the Messenger of Allah (ﷺ) I will fight them for withholding it.' ('Umar said) 'By Allah, when I realized that Allah, the Mighty and Sublime, had opened the chest of Abu Bakr to fighting, then I knew that it was the truth.'\" The wording is that of Ahmad.",
      "usc_msa_ref": "",
      "chain": [
        "30304",
        "28388",
        "20428",
        "11013",
        "11201",
        "38462",
        "20644",
        "20239",
        "11013",
        "11004",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3095",
      "hadith_no": "3095",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا أحمد بن محمد بن المغيرة، قال حدثنا عثمان، عن شعيب، عن الزهري، ح وأخبرني عمرو بن عثمان بن سعيد بن كثير، قال حدثنا أبي قال، حدثنا شعيب، عن الزهري، قال حدثني سعيد بن المسيب، أن أبا هريرة، أخبره أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فمن قالها فقد عصم مني نفسه وماله إلا بحقه وحسابه على الله ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (ﷺ) said:                      \"I have been commanded to fight the people until they say La ilaha illallah (there is non worthy or worship except Allah). Whoever says it, his life and his property are safe from me, except for its right, and his reckoning will be with Allah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30304",
        "30203",
        "20428",
        "11013",
        "38429",
        "28388",
        "20239",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3152",
      "hadith_no": "3152",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عمرو بن عثمان بن سعيد، قال حدثنا أبي، عن شعيب، عن الزهري، قال حدثني سعيد بن المسيب، عن أبي هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ والذي نفسي بيده لولا أن رجالا من المؤمنين لا تطيب أنفسهم بأن يتخلفوا عني ولا أجد ما أحملهم عليه ما تخلفت عن سرية تغزو في سبيل الله والذي نفسي بيده لوددت أني أقتل في سبيل الله ثم أحيا ثم أقتل ثم أحيا ثم أقتل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"I heard the Messenger of Allah (ﷺ) say: 'By the One in Whose hand is my soul, were it not that some men among the believers would not like to stay behind when I went out (to fight), and I could not find any mounts for them, I would not have stayed behind from any campaign that fought in the cause of Allah. By the One in Whose hand is my soul, I wish that I could be killed in the cause of Allah, then brought back to life, then killed, then be brought back to life, then killed.'\"",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "4",
        "20239",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-4890",
      "hadith_no": "4890",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرني محمد بن الخليل، عن شعيب بن إسحاق، عن عبيد الله، عن نافع، أن امرأة، كانت تستعير الحلي في زمان رسول الله صلى الله عليه وسلم فاستعارت من ذلك حليا فجمعته ثم أمسكته فقال رسول الله صلى الله عليه وسلم ‏\"‏ لتتب هذه المرأة وتؤدي ما عندها ‏\"‏ ‏.‏ مرارا فلم تفعل فأمر بها فقطعت ‏.‏",
      "text_en": " It was narrated from Nafi that:                     a woman used to borrow jewelry during the time of the Messenger of Allah. She borrowed some jewelry, collected it and kept it. The Messenger of Allah said: \"Let this woman repent and give back what she has,\" several times, but she did not do that, so he ordered that her hand be cut off.",
      "usc_msa_ref": "",
      "chain": [
        "20239",
        "11201",
        "11014"
      ]
    },
    {
      "id": "sunan-ibn-majah-54",
      "hadith_no": "54",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا عبد الله بن إدريس، وعبدة، وأبو معاوية وعبد الله بن نمير ومحمد بن بشر ح وحدثنا سويد بن سعيد، حدثنا علي بن مسهر، ومالك بن أنس، وحفص بن ميسرة، وشعيب بن إسحاق، عن هشام بن عروة، عن أبيه، عن عبد الله بن عمرو بن العاص، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إن الله لا يقبض العلم انتزاعا ينتزعه من الناس ولكن يقبض العلم بقبض العلماء فإذا لم يبق عالما اتخذ الناس رءوسا جهالا فسئلوا فأفتوا بغير علم فضلوا وأضلوا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Amr bin 'As that:                     the Messenger of Allah (ﷺ) said: 'Allah will not take away knowledge by removing it from people (from their hearts). Rather He will take away knowledge by taking away the scholars, then when there are no scholars left, the people will take the ignorant as their leaders. They will be asked questions and they will issue verdicts without knowledge, thus they will go astray and lead others astray.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20102",
        "20337",
        "30547",
        "20345",
        "20001",
        "20421",
        "20239",
        "11065",
        "10511"
      ]
    },
    {
      "id": "sunan-ibn-majah-2528",
      "hadith_no": "2528",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا شعيب بن إسحاق، حدثنا هشام بن عروة، عن وهب بن كيسان، عن جابر بن عبد الله، أن أباه، توفي وترك عليه ثلاثين وسقا لرجل من اليهود فاستنظره جابر بن عبد الله فأبى أن ينظره فكلم جابر رسول الله صلى الله عليه وسلم ليشفع له إليه فجاءه رسول الله صلى الله عليه وسلم فكلم اليهودي ليأخذ ثمر نخله بالذي له عليه فأبى عليه فكلمه رسول الله صلى الله عليه وسلم فأبى أن ينظره فدخل رسول الله صلى الله عليه وسلم النخل فمشى فيها ثم قال لجابر ‏\"‏ جد له فأوفه الذي له ‏\"‏ ‏.‏ فجد له بعد ما رجع رسول الله صلى الله عليه وسلم ثلاثين وسقا وفضل له اثنا عشر وسقا فجاء جابر رسول الله صلى الله عليه وسلم ليخبره بالذي كان فوجد رسول الله صلى الله عليه وسلم غائبا فلما انصرف رسول الله صلى الله عليه وسلم جاءه فأخبره أنه قد أوفاه وأخبره بالفضل الذي فضل فقال رسول الله صلى الله عليه وسلم ‏\"‏ أخبر بذلك عمر بن الخطاب ‏\"‏ ‏.‏ فذهب جابر إلى عمر فأخبره فقال له عمر لقد علمت حين مشى فيه رسول الله صلى الله عليه وسلم ليباركن الله فيها ‏.‏",
      "text_en": " It was narrated from Jabir bin 'Abdullah that :                     his father died owing thirty Wasq to a Jewish man. Jabir bin Abdullah asked him for respite but he refused. Jabir asked the Messenger of Allah (ﷺ) to intercede for him with him, so the Messenger of Allah (ﷺ) went and spoke to the Jew, asking him to accept dates in lieu of what was owed, but he refused. The Messenger of Allah (ﷺ) spoke to him but he refused to give respite. Then the Messenger of Allah (ﷺ) went in among the date-palm trees and walked among them. Then he said to Jabir: “Pick (dates) for him and pay off what is owed to him in full.” So he picked thirty Wasq of dates after the Messenger of Allah (ﷺ) came back, and there were twelve Wasq more (than what was owed). Jabir came to the Messenger of Allah (ﷺ) to tell him what had happened, and he found that the Messenger of Allah (ﷺ)  was absent. When the Messenger of Allah (ﷺ) came back he came to him and told him that he had paid off the debt in full, and he told him about the extra dates. The Messenger of Allah (ﷺ) said: “Tell 'Umar bin Khattab about that.” So Jabir went to 'Umar said to him: “I knew when the Messenger of Allah (ﷺ) walked  amongst them that Allah (SWT) would bless them for us.”",
      "usc_msa_ref": "",
      "chain": [
        "30285",
        "20239",
        "11065",
        "11231",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-2670",
      "hadith_no": "2670",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا هشام بن عمار، حدثنا شعيب بن إسحاق، حدثنا سعيد بن أبي عروبة، عن عاصم بن بهدلة، عن ذكوان أبي صالح، عن معاوية بن أبي سفيان، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا شربوا الخمر فاجلدوهم ثم إذا شربوا فاجلدوهم ثم إذا شربوا فاجلدوهم ثم إذا شربوا فاقتلوهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Mu`awiyah bin Abu Sufyan that the Messenger of Allah (ﷺ) said:                     “If they drink (again), then whip them. If they drink (again), then whip them. If they drink (again), then whip them. If they drink (again), then kill them.”",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20239",
        "11073",
        "11358",
        "11161",
        "27"
      ]
    },
    {
      "id": "sunan-ibn-majah-3012",
      "hadith_no": "3012",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا هشام بن عمار، حدثنا شعيب بن إسحاق، حدثنا ابن جريج، حدثني عمرو بن دينار، أنه سمع أبا معبد، مولى ابن عباس عن ابن عباس، قال جاء أعرابي إلى النبي  صلى الله عليه وسلم  قال إني اكتتبت في غزوة كذا وكذا وامرأتي حاجة ‏.‏ قال ‏\"‏ فارجع معها ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “A Bedouin came to the Prophet(ﷺ) and said: ‘I have enlisted for such and such a militarycampaignand my wife is going for Hajj.’ He said: ‘Go back withher.’”",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20239",
        "11070",
        "11081",
        "13127",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3285",
      "hadith_no": "3285",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا هشام بن عمار، حدثنا شعيب بن إسحاق، حدثنا سعيد بن أبي عروبة، عن قتادة، عن الحسن، عن سمرة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ كل غلام مرتهن بعقيقته تذبح عنه يوم السابع ويحلق رأسه ويسمى ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Samurah that the Prophet (ﷺ) said:                      “Every boyismortgaged by his ‘Aqiqah, so slaughter for him on the seventh day,and shave his head, and name him.”",
      "usc_msa_ref": "",
      "chain": [
        "30288",
        "20239",
        "11073",
        "11019",
        "11016",
        "394"
      ]
    }
  ],
  "total_hadiths": 39
}