{
  "id": "20233",
  "name": "Salm bin Qutayba, Abu Qutayba سلم بن قتيبة الشعيري - أبو قتيبة",
  "full_name": "Salm bin Qutayba, Abu Qutayba سلم بن قتيبة الشعيري - أبو قتيبة",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "200",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Khurasan",
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  4  -  صدوق ]"
    ],
    "tags": [
      "al-Khurasni",
      "al-Faryabi",
      "al-Basra"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "10846",
      "name": "Yonus bin Abi Ishaq يونس بن أبي إسحاق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20645",
      "name": "al-Jarrah bin Malih bin 'Ady الجراح بن مليح بن عدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "22006",
      "name": "Ibrahim bin 'Abdur Rahman إبراهيم بن عبد الرحمن",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20713",
      "name": "Suhayl bin Abi Hazm al-Qata'i سهيل بن أبي حزم القطعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11599",
      "name": "'Abdullah bin al-Muthna عبد الله بن المثنى",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20449",
      "name": "'Ali bin al-Mubark al-Hna'iy علي بن المبارك الهنائي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "11304",
      "name": "al-Muthna bin Sa'id al-Daba'i المثنى بن سعيد الضبعي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "15581",
      "name": "Hashim bin al-Bryd هاشم بن البريد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20297",
      "name": "Hmam bin Yahya bin Dinar همام بن يحيى بن دينار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30153",
      "name": "'Amr bin 'Ali bin Bahr al-Bahli عمرو بن علي بن بحر الباهلي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30136",
      "name": "Zayd bin Akhzm زيد بن أخزم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30441",
      "name": "'Uqba bin Mukaram bin Aflah al-''Ami عقبة بن مكرم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "20720",
      "name": "Nasr bin 'Ali bin Asbahan نصر بن علي الجهضمي الكبير",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "34280",
      "name": "Yahya bin Hakeem al-Maquuam يحيى بن حكيم المقوم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30160",
      "name": "Muhammad bin Bashar Bindar محمد بن بشار بندار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "909",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا عمرو بن علي، قال حدثني أبو قتيبة، قال حدثنا علي بن المبارك، عن يحيى بن أبي كثير، عن عبد الله بن أبي قتادة  لا أعلمه إلا عن أبيه  عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تقوموا حتى تروني، وعليكم السكينة ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Abi Qatada on the authority of his father:                     The Prophet (p.b.u.h) said, \"Do not stand up (for prayer) unless you see me, and observe calmness and solemnity\".",
      "chain": [
        "30153",
        "20233",
        "20449",
        "11449"
      ]
    },
    {
      "hadith_no": "1009",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا عمرو بن علي، قال حدثنا أبو قتيبة، قال حدثنا عبد الرحمن بن عبد الله بن دينار، عن أبيه، قال سمعت ابن عمر، يتمثل بشعر أبي طالب وأبيض يستسقى الغمام بوجهه ثمال اليتامى عصمة للأرامل وقال عمر بن حمزة حدثنا سالم، عن أبيه، ربما ذكرت قول الشاعر وأنا أنظر، إلى وجه النبي صلى الله عليه وسلم يستسقي، فما ينزل حتى يجيش كل ميزاب‏.‏ وأبيض يستسقى الغمام بوجهه ثمال اليتامى عصمة للأرامل وهو قول أبي طالب‏.‏",
      "text_en": " Narrated `Abdullah bin Dinar:                     My father said, \"I heard Ibn `Umar reciting the poetic verses of Abu Talib: And a white (person) (i.e. the Prophet) who is requested to pray for rain and who takes care of the orphans and is the guardian of widows.\" Salim's father (Ibn `Umar) said, \"The following poetic verse occurred to my mind while I was looking at the face of the Prophet (p.b.u.h) while he was praying for rain. He did not get down till the rain water flowed profusely from every roof-gutter: And a white (person) who is requested to pray for rain and who takes care of the orphans and is the guardian of widows . . . And these were the words of Abu Talib.\"",
      "chain": [
        "30153",
        "20233",
        "20439",
        "11183",
        "11011"
      ]
    },
    {
      "hadith_no": "3562",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا زيد  هو ابن أخزم  قال أبو قتيبة سلم بن قتيبة حدثني مثنى بن سعيد القصير، قال حدثني أبو جمرة، قال لنا ابن عباس ألا أخبركم بإسلام أبي ذر، قال قلنا بلى‏.‏ قال قال أبو ذر كنت رجلا من غفار، فبلغنا أن رجلا قد خرج بمكة، يزعم أنه نبي، فقلت لأخي انطلق إلى هذا الرجل كلمه وأتني بخبره‏.‏ فانطلق فلقيه، ثم رجع فقلت ما عندك فقال والله لقد رأيت رجلا يأمر بالخير وينهى عن الشر‏.‏ فقلت له لم تشفني من الخبر‏.‏ فأخذت جرابا وعصا، ثم أقبلت إلى مكة فجعلت لا أعرفه، وأكره أن أسأل عنه، وأشرب من ماء زمزم وأكون في المسجد‏.‏ قال فمر بي علي فقال كأن الرجل غريب‏.‏ قال قلت نعم‏.‏ قال فانطلق إلى المنزل‏.‏ قال فانطلقت معه لا يسألني عن شىء، ولا أخبره، فلما أصبحت غدوت إلى المسجد لأسأل عنه، وليس أحد يخبرني عنه بشىء‏.‏ قال فمر بي علي فقال أما نال للرجل يعرف منزله بعد قال قلت لا‏.‏ قال انطلق معي‏.‏ قال فقال ما أمرك وما أقدمك هذه البلدة قال قلت له إن كتمت على أخبرتك‏.‏ قال فإني أفعل‏.‏ قال قلت له بلغنا أنه قد خرج ها هنا رجل يزعم أنه نبي، فأرسلت أخي ليكلمه فرجع ولم يشفني من الخبر، فأردت أن ألقاه‏.‏ فقال له أما إنك قد رشدت، هذا وجهي إليه، فاتبعني، ادخل حيث أدخل، فإني إن رأيت أحدا أخافه عليك، قمت إلى الحائط، كأني أصلح نعلي، وامض أنت، فمضى ومضيت معه، حتى دخل ودخلت معه على النبي صلى الله عليه وسلم فقلت له اعرض على الإسلام‏.‏ فعرضه فأسلمت مكاني، فقال لي ‏\"‏ يا أبا ذر اكتم هذا الأمر، وارجع إلى بلدك، فإذا بلغك ظهورنا فأقبل ‏\"‏‏.‏ فقلت والذي بعثك بالحق لأصرخن بها بين أظهرهم‏.‏ فجاء إلى المسجد، وقريش فيه فقال يا معشر قريش، إني أشهد أن لا إله إلا الله، وأشهد أن محمدا عبده ورسوله‏.‏ فقالوا قوموا إلى هذا الصابئ‏.‏ فقاموا فضربت لأموت فأدركني العباس، فأكب على ثم أقبل عليهم، فقال ويلكم تقتلون رجلا من غفار، ومتجركم وممركم على غفار‏.‏ فأقلعوا عني، فلما أن أصبحت الغد رجعت فقلت مثل ما قلت بالأمس، فقالوا قوموا إلى هذا الصابئ‏.‏ فصنع ‏{‏بي‏}‏ مثل ما صنع بالأمس وأدركني العباس فأكب على، وقال مثل مقالته بالأمس‏.‏ قال فكان هذا أول إسلام أبي ذر رحمه الله‏.‏",
      "text_en": " Narrated Abu Jamra:                     Ibn `Abbas said to us, \"Shall I tell you the story of Abu Dhar's conversion to Islam?\" We said, \"Yes.\" He said, \"Abu Dhar said: I was a man from the tribe of Ghifar. We heard that a man had appeared in Mecca, claiming to be a Prophet. ! said to my brother, 'Go to that man and talk to him and bring me his news.' He set out, met him and returned. I asked him, 'What is the news with you?' He said, 'By Allah, I saw a man enjoining what is good and forbidding what is evil.' I said to him, 'You have not satisfied me with this little information.' So, I took a waterskin and a stick and proceeded towards Mecca. Neither did I know him (i.e. the Prophet ), nor did I like to ask anyone about him. I Kept on drinking Zam zam water and staying in the Mosque. Then `Ali passed by me and said, 'It seems you are a stranger?' I said, 'Yes.' He proceeded to his house and I accompanied him. Neither did he ask me anything, nor did I tell him anything. Next morning I went to the Mosque to ask about the Prophet but no-one told me anything about him. `Ali passed by me again and asked, 'Hasn't the man recognized his dwelling place yet' I said, 'No.' He said, 'Come along with me.' He asked me, 'What is your business? What has brought you to this town?' I said to him, 'If you keep my secret, I will tell you.' He said, 'I will do,' I said to him, 'We have heard that a person has appeared here, claiming to be a Prophet. I sent my brother to speak to him and when he returned, he did not bring a satisfactory report; so I thought of meeting him personally.' `Ali said (to Abu Dhar), 'You have reached your goal; I am going to him just now, so follow me, and wherever I enter, enter after me. If I should see someone who may cause you trouble, I will stand near a wall pretending to mend my shoes (as a warning), and you should go away then.' `Ali proceeded and I accompanied him till he entered a place, and I entered with him to the Prophet to whom I said, 'Present (the principles of) Islam to me.' When he did, I embraced Islam 'immediately. He said to me, 'O Abu Dhar! Keep your conversion as a secret and return to your town; and when you hear of our victory, return to us. ' I said, 'By H him Who has sent you with the Truth, I will announce my conversion to Islam publicly amongst them (i.e. the infidels),' Abu Dhar went to the Mosque, where some people from Quraish were present, and said, 'O folk of Quraish ! I testify that None has the right to be worshipped except Allah, and I (also) testify that Muhammad is Allah's Slave and His Apostle.' (Hearing that) the Quraishi men said, 'Get at this Sabi (i.e. Muslim) !' They got up and beat me nearly to death. Al `Abbas saw me and threw himself over me to protect me. He then faced them and said, 'Woe to you! You want to kill a man from the tribe of Ghifar, although your trade and your communications are through the territory of Ghifar?' They therefore left me. The next morning I returned (to the Mosque) and said the same as I have said on the previous day. They again said, 'Get at this Sabi!' I was treated in the same way as on the previous day, and again Al-Abbas found me and threw himself over me to protect me and told them the same as he had said the day before.' So, that was the conversion of Abu Dhar (may Allah be Merciful to him) to Islam.\"",
      "chain": [
        "30136",
        "20233",
        "11309"
      ]
    },
    {
      "hadith_no": "2079",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عقبة بن مكرم، حدثنا أبو قتيبة، عن عبد الله بن عمر، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا نكح العبد بغير إذن مولاه فنكاحه باطل ‏\"‏ ‏.‏ قال أبو داود هذا الحديث ضعيف وهو موقوف وهو قول ابن عمر رضى الله عنهما ‏.‏",
      "text_en": " Ibn ‘Umar reported the Prophet (ﷺ) as saying “If a slave marries without the permission of his master, his marriage is null and void.Abu Dawud said “This tradition is weak. This is mauquf(does not go back to the Prophet). This is the statement of the Ibn ‘Umar himself.",
      "chain": [
        "30441",
        "20233",
        "20507",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5273",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا أبو قتيبة، سلم بن قتيبة عن داود بن أبي صالح المزني، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم نهى أن يمشي - يعني الرجل - بين المرأتين ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ) prohibited that one, i.e. man, should walk between two women.",
      "chain": [
        "11222",
        "20233",
        "22053",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "50",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا نصر بن علي الجهضمي، وأحمد بن أبي عبيد الله السليمي البصري، قالا حدثنا أبو قتيبة، سلم بن قتيبة عن الحسن بن علي الهاشمي، عن عبد الرحمن الأعرج، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ جاءني جبريل فقال يا محمد إذا توضأت فانتضح ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ قال وسمعت محمدا يقول الحسن بن علي الهاشمي منكر الحديث ‏.‏ قال وفي الباب عن أبي الحكم بن سفيان وابن عباس وزيد بن حارثة وأبي سعيد الخدري ‏.‏ وقال بعضهم سفيان بن الحكم أو الحكم بن سفيان واضطربوا في هذا الحديث ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Prophet said: \"Jibril came to me and he said: 'O Muhammad! When you perform wudu then perform Nadh.'\"",
      "chain": [
        "30395",
        "34008",
        "20233",
        "30",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "241",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عقبة بن مكرم، ونصر بن علي الجهضمي، قالا حدثنا أبو قتيبة، سلم بن قتيبة عن طعمة بن عمرو، عن حبيب بن أبي ثابت، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صلى لله أربعين يوما في جماعة يدرك التكبيرة الأولى كتبت له براءتان براءة من النار وبراءة من النفاق ‏\"‏ ‏.‏ قال أبو عيسى وقد روي هذا الحديث عن أنس موقوفا ولا أعلم أحدا رفعه إلا ما روى سلم بن قتيبة عن طعمة بن عمرو عن حبيب بن أبي ثابت عن أنس ‏.‏ وإنما يروى هذا الحديث عن حبيب بن أبي حبيب البجلي، عن أنس بن مالك، قوله ‏.‏ حدثنا بذلك، هناد حدثنا وكيع، عن خالد بن طهمان، عن حبيب بن أبي حبيب البجلي، عن أنس، نحوه ولم يرفعه ‏.‏ وروى إسماعيل بن عياش، هذا الحديث عن عمارة بن غزية، عن أنس بن مالك، عن عمر بن الخطاب، عن النبي صلى الله عليه وسلم نحو هذا ‏.‏ وهذا حديث غير محفوظ وهو حديث مرسل وعمارة بن غزية لم يدرك أنس بن مالك ‏.‏ قال محمد بن إسماعيل حبيب بن أبي حبيب يكنى أبا الكشوثى ويقال أبو عميرة ‏.‏",
      "text_en": " Anas bin Malik narrated that :                     Allah's Messenger said: \"Whoever performs Salat for Allah for forty days in congregation, catching the first Takbir, two absolutions are written for him: absolution from the Fire, and absolution from the Fire, and absolution from hypocrisy.\"",
      "chain": [
        "30441",
        "30395",
        "20233",
        "11331",
        "19"
      ]
    },
    {
      "hadith_no": "1014",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن الصباح الهاشمي، حدثنا أبو قتيبة، عن الجراح، عن سماك، عن جابر بن سمرة، أن النبي صلى الله عليه وسلم اتبع جنازة أبي الدحداح ماشيا ورجع على فرس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Jabir bin Samurah narrated:                     \"The Prophet followed the funeral of Ibn Ad-Dahdah walking and he returned on horseback.\"",
      "chain": [
        "30142",
        "20233",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1560",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا زيد بن أخزم الطائي، حدثنا أبو قتيبة، سلم بن قتيبة حدثنا شعبة، عن أيوب، عن أبي قلابة، عن أبي ثعلبة الخشني، قال سئل رسول الله صلى الله عليه وسلم عن قدور المجوس فقال ‏\"‏ أنقوها غسلا واطبخوا فيها ‏\"‏ ‏.‏ ونهى عن كل سبع وذي ناب ‏.‏ وقد روي هذا الحديث من غير هذا الوجه عن أبي ثعلبة رواه أبو إدريس الخولاني عن أبي ثعلبة ‏.‏ وأبو قلابة لم يسمع من أبي ثعلبة إنما رواه عن أبي أسماء عن أبي ثعلبة ‏.‏",
      "text_en": " Narrated Abu Tha'labah Al-Khushani:                     \"The Messenger of Allah (ﷺ) was asked about the pots of the Zorastrians. He said: 'Clean them by washing them, and then cook in them.' And he prohibited every predator and possessor of canines.\"This Hadith has been reported through routes other than this from Abu Tha'labah. Abu Idris Al-Khawlani reported it from Abu Tha'labah. Abu Qilabah did not hear from Abu Tha'labah, he only reported it from Abu Asma', from Abu Tha'labah.",
      "chain": [
        "30136",
        "20233",
        "20020",
        "11015",
        "11047",
        "4056"
      ]
    },
    {
      "hadith_no": "1826",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا زيد بن أخزم الطائي، حدثنا أبو قتيبة، عن أبي العوام، عن قتادة، عن زهدم الجرمي، قال دخلت على أبي موسى وهو يأكل دجاجا فقال ادن فكل فإني رأيت رسول الله صلى الله عليه وسلم يأكله ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد روي هذا الحديث من غير وجه عن زهدم ولا نعرفه إلا من حديث زهدم ‏.‏ وأبو العوام هو عمران القطان ‏.‏",
      "text_en": " Narrated Zahdam Al-Jarmi:                     \"I entered upon Abu Musa while he was eating chicken, and he said: 'Sit and eat, for indeed I saw the Messenger of Allah (ﷺ) eating it.'\"[Abu 'Eisa said:] This Hadith is Hasan. This Hadith has been reported through other routes from Zahdam, and we do not know of it except as the narration of Zahdam. (One of the narrators) Abu Al-'Awwam is 'Imran Al-Qattan.",
      "chain": [
        "30136",
        "20233",
        "11019",
        "11589"
      ]
    },
    {
      "hadith_no": "2303",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Qadar - كتاب القدر عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو هريرة، محمد بن فراس البصري حدثنا أبو قتيبة، سلم بن قتيبة حدثنا أبو العوام، عن قتادة، عن مطرف بن عبد الله بن الشخير، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ مثل ابن آدم وإلى جنبه تسع وتسعون منية إن أخطأته المنايا وقع في الهرم حتى يموت ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏ وأبو العوام هو عمران وهو ابن داور القطان ‏.‏",
      "text_en": " Mutarrif bin 'Abdullah bin Ash-Shikh-khir narrated from his father, from the Prophet (s.a.w), who said:                     'Ibn Adam was fashioned with ninety-nine calamities surrounding him, if the calamities miss him, he is stricken by decrepitude until he dies.\"",
      "chain": [
        "20233",
        "11019",
        "11305",
        "5130"
      ]
    },
    {
      "hadith_no": "2644",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو هريرة، محمد بن فراس البصري حدثنا أبو قتيبة، سلم بن قتيبة حدثنا أبو العوام، وهو عمران القطان عن قتادة، عن مطرف بن عبد الله بن الشخير، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مثل ابن آدم وإلى جنبه تسعة وتسعون منية إن أخطأته المنايا وقع في الهرم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Mutarrif bin 'Abdullah bin Ash-Shikh-khir narrated from his father from the Prophet(s.a.w) who said:                     \"The case of the son of Adam is such that he is surrounded by ninety-nine calamities, if the calamities miss him, he falls into decrepitude.\"",
      "chain": [
        "20233",
        "20718",
        "11019",
        "11305",
        "5130"
      ]
    },
    {
      "hadith_no": "3443",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو حفص، عمرو بن علي حدثنا أبو قتيبة، سلم بن قتيبة حدثنا عبد الجبار بن العباس الهمداني، عن أبي إسحاق، عن سعيد بن جبير، عن ابن عباس، عن أبى بن كعب، عن النبي صلى الله عليه وسلم قال ‏\"‏ الغلام الذي قتله الخضر طبع يوم طبع كافرا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     that Ubayy bin Ka'b narrated that the Prophet (ﷺ) said: \"The boy that Al-Khidr killed was destined to be a disbeliever the day he was created.'\"",
      "chain": [
        "30286",
        "20233",
        "30419",
        "11049",
        "11050",
        "17",
        "39"
      ]
    },
    {
      "hadith_no": "3559",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو حفص، عمرو بن علي الفلاس حدثنا أبو قتيبة، سلم بن قتيبة حدثنا سهيل بن أبي حزم القطعي، حدثنا ثابت البناني، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قرأ ‏:‏ ‏(‏إن الذين قالوا ربنا الله ثم استقاموا ‏)‏ قال ‏\"‏ قد قال الناس ثم كفر أكثرهم فمن مات عليها فهو ممن استقام ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ سمعت أبا زرعة يقول روى عفان عن عمرو بن علي حديثا ويروى في هذه الآية عن النبي صلى الله عليه وسلم وأبي بكر وعمر رضى الله عنهما معنى استقاموا ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     that the Messenger of Allah (ﷺ) recited: Verily those who say: \"Our Lord is Allah, and then they stand firm (41:30).\" - He said: \"People have said it, then most of them disbelieved, so whoever dies upon it, then he is among those who stood firm.\"",
      "chain": [
        "30286",
        "20233",
        "20713",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3442",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أحمد بن أبي عبيد الله السليمي البصري، حدثنا أبو قتيبة، سلم بن قتيبة عن إبراهيم بن عبد الرحمن بن يزيد بن أمية، عن نافع، عن ابن عمر، قال كان رسول الله صلى الله عليه وسلم إذا ودع رجلا أخذ بيده فلا يدعها حتى يكون الرجل هو يدع يد النبي صلى الله عليه وسلم ويقول ‏\"‏ أستودع الله دينك وأمانتك وآخر عملك ‏\"‏ ‏.‏ قال هذا حديث غريب من هذا الوجه ‏.‏ وروي هذا الحديث من غير وجه عن ابن عمر ‏.‏",
      "text_en": " Ibn Umar narrated, saying:                     “When the Prophet would bid farewell to a man, he would take his hand, and not let it go until the man let go of the hand, of the Prophet, and he would say: ‘I entrust to Allah your religion, your trusts, and the last of your deeds (Astawdi’ullaha Dinaka Wa Amanataka Wa Akhira Amalik).’”",
      "chain": [
        "34008",
        "20233",
        "22006",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3977",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا زيد بن أخزم الطائي البصري، حدثنا أبو قتيبة، سلم بن قتيبة حدثني أبو مودود المدني، حدثنا عثمان بن الضحاك، عن محمد بن يوسف بن عبد الله بن سلام، عن أبيه، عن جده، قال مكتوب في التوراة صفة محمد وعيسى ابن مريم يدفن معه ‏.‏ قال فقال أبو مودود وقد بقي في البيت موضع قبر ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ هكذا قال عثمان بن الضحاك والمعروف الضحاك بن عثمان المدني ‏.‏",
      "text_en": " Narrated 'Abdullah bin Salam:                     \"The description of Muhammad is written in the Tawrah, [and the description that] 'Eisa will be buried next to him.\" (One of the narrators) Abu Mawdud said: \"[And] there is a place for a grave left in the house.\"",
      "chain": [
        "30136",
        "20233",
        "21357",
        "22145",
        "12492"
      ]
    },
    {
      "hadith_no": "4001",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا أبو قتيبة، سلم بن قتيبة عن عبد الله بن المثنى، عن ثمامة، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم يعيد الكلمة ثلاثا لتعقل عنه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب إنما نعرفه من حديث عبد الله بن المثنى ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     that the Messenger of Allah (ﷺ) would repeat a statement three times so that it could be understood.",
      "chain": [
        "11222",
        "20233",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "1817",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا أبو قتيبة، قال حدثنا محمد بن عبد الله الشعيثي، عن أبيه، عن عنبسة بن أبي سفيان، عن أم حبيبة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من صلى أربعا قبل الظهر وأربعا بعدها لم تمسه النار ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذا خطأ والصواب حديث مروان من حديث سعيد بن عبد العزيز ‏.‏",
      "text_en": " It was narrated from Umm Habibah that:                     The Prophet (ﷺ) said: \"Whoever prays four rak'ahs before Zuhr and four after, the Fire will not touch him.\"",
      "chain": [
        "30153",
        "20233",
        "20741",
        "846",
        "59"
      ]
    },
    {
      "hadith_no": "5243",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا يحيى بن حكيم، قال حدثنا أبو قتيبة، قال حدثنا عبد الرحمن بن عبد الله بن دينار، عن زيد بن أسلم، عن عبيد، قال رأيت ابن عمر يصفر لحيته فقلت له في ذلك فقال رأيت النبي صلى الله عليه وسلم يصفر لحيته ‏.‏",
      "text_en": " It was narrated that 'Ubaid said:                     \"I saw Ibn 'Umar dyeing his beard yellow and I asked him about that. 'He said: \"I saw the Prophet [SAW] dye his beard yellow.\"",
      "chain": [
        "34280",
        "20233",
        "20439",
        "11163"
      ]
    },
    {
      "hadith_no": "1018",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن حكيم، حدثنا أبو قتيبة، حدثنا يونس بن أبي إسحاق، وإسرائيل بن يونس، عن أبي إسحاق، عن الحارث، عن علي، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لا تفقع أصابعك وأنت في الصلاة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Ali that the Messenger of Allah (ﷺ) said:                      “Donot crack your fingers during the prayer.”",
      "chain": [
        "34280",
        "20233",
        "10846",
        "20311",
        "11049",
        "5"
      ]
    },
    {
      "hadith_no": "1055",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا زيد بن أخزم أبو طالب، حدثنا أبو داود، وأبو قتيبة قالا حدثنا هارون بن مسلم، عن قتادة، عن معاوية بن قرة، عن أبيه، قال كنا ننهى أن نصف، بين السواري على عهد رسول الله  صلى الله عليه وسلم  ونطرد عنها طردا ‏.‏",
      "text_en": " It wasnarrated from Mu’awiyah bin Qurrah that his father said:                      “Wewereforbidden to form a row between two pillars at the time of theMessenger of Allah (ﷺ), and we would be repelled from themforcefully.”",
      "chain": [
        "30136",
        "20547",
        "20233",
        "11019",
        "11306",
        "5238"
      ]
    },
    {
      "hadith_no": "1358",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن حكيم، حدثنا أبو قتيبة، حدثنا عبد الله بن عمر، عن نافع، عن ابن عمر، أنه كان يخرج إلى العيد في طريق ويرجع في أخرى ويزعم أن رسول الله  صلى الله عليه وسلم  كان يفعل ذلك ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Umar that he used to go out to the ‘Eidprayers via one route, and return via another, and he said that theMessenger of Allah (ﷺ) used to go that.",
      "chain": [
        "34280",
        "20233",
        "20507",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3270",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا حاتم بن بكر الضبي أبو عمرو، حدثنا محمد بن بكر البرساني، ح وحدثنا محمد بن سعيد بن يزيد بن إبراهيم، حدثنا أبو قتيبة، ويحيى بن كثير، قالوا حدثنا شعبة، عن مالك بن أنس، عن عمرو بن مسلم، عن سعيد بن المسيب، عن أم سلمة، قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من رأى منكم هلال ذي الحجة فأراد أن يضحي فلا يقربن له شعرا ولا ظفرا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Umm Salamah that the Messenger of Allah (ﷺ)said:                     “Whoever among you sees the new crescent of Dhul-Hijjah andwantsto offer a sacrifice, let him not take anything from his hair ornails.”",
      "chain": [
        "20277",
        "20233",
        "20302",
        "20020",
        "20001",
        "10953",
        "11002",
        "56"
      ]
    },
    {
      "hadith_no": "3458",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا أبو قتيبة، عن همام، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال رأيت رسول الله  صلى الله عليه وسلم  أتي بتمر عتيق فجعل يفتشه ‏.‏",
      "text_en": " It wasnarrated that Anas bin Malik said:                      “I saw the Messenger ofAllah(ﷺ) when he was brought some old dates; he started to inspectthem.”",
      "chain": [
        "34043",
        "20233",
        "20297",
        "11151",
        "19"
      ]
    }
  ],
  "total_hadiths": 24
}