{
  "id": "20241",
  "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
  "full_name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "122",
      "date_gregorian": "NA",
      "date_display": [
        "122 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "210",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Basra",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]",
      "Fiqh"
    ],
    "tags": [
      "al-Shaybani",
      "al-Basri"
    ]
  },
  "parents": [
    {
      "id": "28556",
      "name": "Mkhld bin al-Dhak bin Muslim مخلد بن الضحاك بن مسلم الشيباني",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11450",
      "name": "Yazid bin Abi 'Ubaid يزيد بن أبي عبيد",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11555",
      "name": "Ayman bin Nabil أيمن بن نابل الحبشي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "15223",
      "name": "Shbyb bin Bashr شبيب بن بشر",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "14265",
      "name": "'Uthman bin Sa'd عثمان بن سعد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11071",
      "name": "'Abdullah bin 'Awn bin Artaban عبد الله بن عون بن أرطبان الخزار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10616",
      "name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20638",
      "name": "Sa'id bin 'Abdul 'Aziz al-Tanuqi سعيد بن عبد العزيز التنوخي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20415",
      "name": "Thaur bin Yazid al-Rahbi ثور بن يزيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28085",
      "name": "Ja'far bin Yahya bin Thwban جعفر بن يحيى بن ثوبان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11243",
      "name": "Hanzala bin Abi Sufyan bin 'Abdur Rahman حنظلة بن أبي سفيان بن عبد الرحمن",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "26010",
      "name": "Haywat bin Sharih bin Safwan حيوة بن شريح بن صفوان التجيبي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11244",
      "name": "Zakaria bin Ishaq al-Makki زكريا بن إسحاق المكي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11073",
      "name": "Sa'id bin Abi 'Aruba سعيد بن أبي عروبة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11875",
      "name": "'Abdul Hameed bin Ja'far عبد الحميد بن جعفر بن عبد الله",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20561",
      "name": "'Uzra bin Thabit عزرة بن ثابت بن أبي زيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11530",
      "name": "'Umar bin Muhammad bin Zayd عمر بن محمد بن زيد بن عبد الله",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20197",
      "name": "'Uthman bin al-'Aswad bin Musa عثمان بن الأسود بن موسى",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10652",
      "name": "'Umar bin Sa'id bin Abi Hussain عمر بن سعيد بن أبي حسين النوفلي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "11311",
      "name": "Hisham bin Hassan al-Azdi هشام بن حسان الأزدي القردوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "12508",
      "name": "Mzahr bin Aslm مظاهر بن أسلم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11301",
      "name": "Qurrah bin Khalid al-Sadusi قرة بن خالد السدوسي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20556",
      "name": "'Abdul Malik bin Qarib - al-Asma'i عبد الملك بن قريب بن عبد الملك - الأصمعي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20330",
      "name": "'Abdullah bin Da'ud al-Kharaybi عبد الله بن داود أبو عبد الرحمن الخريبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30313",
      "name": "Ishaq bin Mansur al-Kausaj إسحاق بن منصور بن بهرام - الكوسج",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38834",
      "name": "Hajjaj bin Yusuf bin al-Sha'ir حجاج بن يوسف الشاعر",
      "grade": "3rd Century AH"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30437",
      "name": "'Abbas bin 'Abdul 'Azeem al-'Anbari عباس بن عبد العظيم العنبري",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-258",
      "hadith_no": "258",
      "source": "Sahih Bukhari",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثنا أبو عاصم، عن حنظلة، عن القاسم، عن عائشة، قالت كان النبي صلى الله عليه وسلم إذا اغتسل من الجنابة دعا بشىء نحو الحلاب، فأخذ بكفه، فبدأ بشق رأسه الأيمن ثم الأيسر، فقال بهما على رأسه‏.‏",
      "text_en": " Narrated `Aisha:                     Whenever the Prophet took the bath of Janaba (sexual relation or wet dream) he asked for the Hilab or some other scent. He used to take it in his hand, rub it first over the right side of his head and then over the left and then rub the middle of his head with both hands.",
      "usc_msa_ref": "258",
      "chain": [
        "30170",
        "20241",
        "11243",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-359",
      "hadith_no": "359",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو عاصم، عن مالك، عن أبي الزناد، عن عبد الرحمن الأعرج، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ لا يصلي أحدكم في الثوب الواحد، ليس على عاتقيه شىء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"None of you should offer prayer in a single garment that does not cover the shoulders.\"",
      "usc_msa_ref": "355",
      "chain": [
        "20241",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-721",
      "hadith_no": "721",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو عاصم، عن مالك، عن سمى، عن أبي صالح، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ الشهداء الغرق والمطعون والمبطون والهدم ‏\"‏‏.‏ وقال ‏\"‏ ولو يعلمون ما في التهجير لاستبقوا ‏{‏إليه‏}‏ ولو يعلمون ما في العتمة والصبح لأتوهما ولو حبوا، ولو يعلمون ما في الصف المقدم لاستهموا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Martyrs are those who die because of drowning, plague, an Abdominal disease, or of being buried alive by a falling building.\" And then he added, \"If the people knew the Reward for the Zuhr prayer in its early time, they would race for it. If they knew the reward for the `Isha' and the Fajr prayers in congregation, they would join them even if they had to crawl. If they knew the reward for the first row, they would draw lots for it.\"",
      "usc_msa_ref": "688",
      "chain": [
        "20241",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-764",
      "hadith_no": "764",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن ابن أبي مليكة، عن عروة بن الزبير، عن مروان بن الحكم، قال قال لي زيد بن ثابت ما لك تقرأ في المغرب بقصار، وقد سمعت النبي صلى الله عليه وسلم يقرأ بطول الطوليين",
      "text_en": " Narrated Marwan bin Al-Hakam:                     Zaid bin Thabit said to me, \"Why do you recite very short Suras in the Maghrib prayer while I heard the Prophet reciting the longer of the two long Suras?\"",
      "usc_msa_ref": "",
      "chain": [
        "20241",
        "11070",
        "11090",
        "10511",
        "858",
        "49"
      ]
    },
    {
      "id": "sahih-bukhari-854",
      "hadith_no": "854",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا أبو عاصم، قال أخبرنا ابن جريج، قال أخبرني عطاء، قال سمعت جابر بن عبد الله، قال قال النبي صلى الله عليه وسلم ‏\"‏ من أكل من هذه الشجرة  يريد الثوم  فلا يغشانا في مساجدنا ‏\"‏‏.‏ قلت ما يعني به قال ما أراه يعني إلا نيئه‏.‏ وقال مخلد بن يزيد عن ابن جريج إلا نتنه‏.‏",
      "text_en": " Narrated `Ata':                     I heard Jabir bin `Abdullah saying, \"The Prophet said, 'Whoever eats (from) this plant (he meant garlic) should keep away from our mosque.\" I said, \"What does he mean by that?\" He replied, \"I think he means only raw garlic.\"",
      "usc_msa_ref": "813",
      "chain": [
        "30351",
        "20241",
        "11070",
        "11029",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-923",
      "hadith_no": "923",
      "source": "Sahih Bukhari",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن معمر، قال حدثنا أبو عاصم، عن جرير بن حازم، قال سمعت الحسن، يقول حدثنا عمرو بن تغلب، أن رسول الله صلى الله عليه وسلم أتي بمال أو سبى فقسمه، فأعطى رجالا وترك رجالا فبلغه أن الذين ترك عتبوا، فحمد الله ثم أثنى عليه، ثم قال ‏\"‏ أما بعد، فوالله إني لأعطي الرجل، وأدع الرجل، والذي أدع أحب إلى من الذي أعطي ولكن أعطي أقواما لما أرى في قلوبهم من الجزع والهلع، وأكل أقواما إلى ما جعل الله في قلوبهم من الغنى والخير، فيهم عمرو بن تغلب ‏\"‏‏.‏ فوالله ما أحب أن لي بكلمة رسول الله صلى الله عليه وسلم حمر النعم‏.‏ تابعه يونس‏.‏",
      "text_en": " Narrated `Amr bin Taghlib:                     Some property or something was brought to Allah's Apostle and he distributed it. He gave to some men and ignored the others. Later he got the news of his being admonished by those whom he had ignored. So he glorified and praised Allah and said, \"Amma ba'du. By Allah, I may give to a man and ignore another, although the one whom I ignore is more beloved to me than the one whom I give. But I give to some people as I feel that they have no patience and no contentment in their hearts and I leave those who are patient and self-content with the goodness and wealth which Allah has put into their hearts and `Amr bin Taghlib is one of them.\" `Amr added, By Allah! Those words of Allah's Apostle are more beloved to me than the best red camels.",
      "usc_msa_ref": "",
      "chain": [
        "30172",
        "20241",
        "11272",
        "11016",
        "5200"
      ]
    },
    {
      "id": "sahih-bukhari-962",
      "hadith_no": "962",
      "source": "Sahih Bukhari",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو عاصم، قال أخبرنا ابن جريج، قال أخبرني الحسن بن مسلم، عن طاوس، عن ابن عباس، قال شهدت العيد مع رسول الله صلى الله عليه وسلم وأبي بكر وعمر وعثمان  رضى الله عنهم  فكلهم كانوا يصلون قبل الخطبة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I offered the `Id prayer with Allah's Apostle, Abu Bakr, `Umar and `Uthman and all of them offered the prayer before delivering the Khutba.",
      "usc_msa_ref": "79",
      "chain": [
        "20241",
        "11070",
        "11557",
        "11053",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-1413",
      "hadith_no": "1413",
      "source": "Sahih Bukhari",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو عاصم الضحاك بن مخلد، عن زكرياء بن إسحاق، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس  رضى الله عنهما  أن النبي صلى الله عليه وسلم بعث معاذا  رضى الله عنه  إلى اليمن فقال ‏\"‏ ادعهم إلى شهادة أن لا إله إلا الله، وأني رسول الله، فإن هم أطاعوا لذلك فأعلمهم أن الله قد افترض عليهم خمس صلوات في كل يوم وليلة، فإن هم أطاعوا لذلك فأعلمهم أن الله افترض عليهم صدقة في أموالهم، تؤخذ من أغنيائهم وترد على فقرائهم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet () sent Mu`adh to Yemen and said, \"Invite the people to testify that none has the right to be worshipped but Allah and I am Allah's Apostle, and if they obey you to do so, then teach them that Allah has enjoined on them five prayers in every day and night (in twenty-four hours), and if they obey you to do so, then teach them that Allah has made it obligatory for them to pay the Zakat from their property and it is to be taken from the wealthy among them and given to the poor.\"",
      "usc_msa_ref": "",
      "chain": [
        "20241",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-1434",
      "hadith_no": "1434",
      "source": "Sahih Bukhari",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا أبو عاصم النبيل، أخبرنا سعدان بن بشر، حدثنا أبو مجاهد، حدثنا محل بن خليفة الطائي، قال سمعت عدي بن حاتم  رضى الله عنه  يقول كنت عند رسول الله صلى الله عليه وسلم فجاءه رجلان أحدهما يشكو العيلة، والآخر يشكو قطع السبيل، فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما قطع السبيل فإنه لا يأتي عليك إلا قليل حتى تخرج العير إلى مكة بغير خفير، وأما العيلة فإن الساعة لا تقوم حتى يطوف أحدكم بصدقته لا يجد من يقبلها منه، ثم ليقفن أحدكم بين يدى الله ليس بينه وبينه حجاب ولا ترجمان يترجم له، ثم ليقولن له ألم أوتك مالا فليقولن بلى‏.‏ ثم ليقولن ألم أرسل إليك رسولا فليقولن بلى‏.‏ فينظر عن يمينه فلا يرى إلا النار، ثم ينظر عن شماله فلا يرى إلا النار، فليتقين أحدكم النار ولو بشق تمرة، فإن لم يجد فبكلمة طيبة ‏\"‏‏.‏",
      "text_en": " Narrated `Adi bin Hatim:                     While I was sitting with Allah's Apostle (p.b.u.h) two person came to him; one of them complained about his poverty and the other complained about the prevalence of robberies. Allah's Apostle said, \"As regards stealing and robberies, there will shortly come a time when a caravan will go to Mecca (from Medina) without any guard. And regarding poverty, The Hour (Day of Judgment) will not be established till one of you wanders about with his object of charity and will not find anybody to accept it And (no doubt) each one of you will stand in front of Allah and there will be neither a curtain nor an interpreter between him and Allah, and Allah will ask him, 'Did not I give you wealth?' He will reply in the affirmative. Allah will further ask, 'Didn't send a messenger to you?' And again that person will reply in the affirmative Then he will look to his right and he will see nothing but Hell-fire, and then he will look to his left and will see nothing but Hell-fire. And so, any (each one) of you should save himself from the fire even by giving half of a date-fruit (in charity). And if you do not find a hall datefruit, then (you can do it through saying) a good pleasant word (to your brethren). (See Hadith No. 793 Vol. 4).",
      "usc_msa_ref": "",
      "chain": [
        "30351",
        "20241",
        "11651",
        "212"
      ]
    },
    {
      "id": "sahih-bukhari-1451",
      "hadith_no": "1451",
      "source": "Sahih Bukhari",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو عاصم، عن عمر بن سعيد، عن ابن أبي مليكة، أن عقبة بن الحارث  رضى الله عنه  حدثه قال صلى بنا النبي صلى الله عليه وسلم العصر، فأسرع ثم دخل البيت، فلم يلبث أن خرج، فقلت أو قيل له فقال ‏\"‏ كنت خلفت في البيت تبرا من الصدقة، فكرهت أن أبيته فقسمته ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin Al-Harith:                     Once the Prophet offered the `Asr prayer and then hurriedly went to his house and returned immediately. I (or somebody else) asked him (as to what was the matter) and he said, \"I left at home a piece of gold which was from the charity and I disliked to let it remain a night in my house, so I got it distributed . \"",
      "usc_msa_ref": "510",
      "chain": [
        "20241",
        "10652",
        "11090",
        "872"
      ]
    },
    {
      "id": "sahih-bukhari-1456",
      "hadith_no": "1456",
      "source": "Sahih Bukhari",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، وحدثني محمد بن عبد الرحيم، عن حجاج بن محمد، عن ابن جريج، قال أخبرني ابن أبي مليكة، عن عباد بن عبد الله بن الزبير، أخبره عن أسماء بنت أبي بكر  رضى الله عنهما  أنها جاءت إلى النبي صلى الله عليه وسلم فقال ‏\"‏ لا توعي فيوعي الله عليك، ارضخي ما استطعت ‏\"‏‏.‏",
      "text_en": " Narrated Asma' bint Abu Bakr:                     that she had gone to the Prophet and he said, \"Do not shut your money bag; otherwise Allah too will withhold His blessings from you. Spend (in Allah's Cause) as much as you can afford. \"",
      "usc_msa_ref": "515",
      "chain": [
        "20241",
        "11070",
        "30272",
        "20381",
        "11070",
        "11090",
        "11250",
        "70"
      ]
    },
    {
      "id": "sahih-bukhari-1543",
      "hadith_no": "1543",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عمرو بن علي، حدثنا أبو عاصم، حدثنا أيمن بن نابل، حدثنا القاسم بن محمد، عن عائشة  رضى الله عنها  أنها قالت يا رسول الله، اعتمرتم ولم أعتمر‏.‏ فقال ‏\"‏ يا عبد الرحمن اذهب بأختك فأعمرها من التنعيم ‏\"‏‏.‏ فأحقبها على ناقة فاعتمرت‏.‏",
      "text_en": " Narrated Al-Qasim bin Muhammad:                     `Aisha said, \"O Allah's Apostle! You performed `Umra but I did not.\" He said, \"O `Abdur-Rahman! Go along with your sister and let her perform `Umra from Tan`im.\" `Abdur-Rahman made her ride over the packsaddle of a she-camel and she performed `Umra.",
      "usc_msa_ref": "593",
      "chain": [
        "30153",
        "20241",
        "11555",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-1561",
      "hadith_no": "1561",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "قال أبو عاصم أخبرنا ابن جريج، أخبرني عطاء، أن صفوان بن يعلى، أخبره أن يعلى قال لعمر  رضى الله عنه  أرني النبي صلى الله عليه وسلم حين يوحى إليه قال فبينما النبي صلى الله عليه وسلم بالجعرانة، ومعه نفر من أصحابه، جاءه رجل فقال يا رسول الله كيف ترى في رجل أحرم بعمرة، وهو متضمخ بطيب فسكت النبي صلى الله عليه وسلم ساعة فجاءه الوحى، فأشار عمر  رضى الله عنه  إلى يعلى، فجاء يعلى، وعلى رسول الله صلى الله عليه وسلم ثوب قد أظل به فأدخل رأسه، فإذا رسول الله صلى الله عليه وسلم محمر الوجه، وهو يغط ثم سري عنه فقال ‏\"‏ أين الذي سأل عن العمرة ‏\"‏ فأتي برجل فقال ‏\"‏ اغسل الطيب الذي بك ثلاث مرات، وانزع عنك الجبة، واصنع في عمرتك كما تصنع في حجتك ‏\"‏‏.‏ قلت لعطاء أراد الإنقاء حين أمره أن يغسل ثلاث مرات قال نعم‏.‏",
      "text_en": " Narrated Safwan bin Ya'la:                      Ya'la said to 'Umar, \"Show me the Prophet () when he is being inspired Divinely.\" While the Prophet () was at Ji'rana (in the company of some of his Companions) a person came and asked, \"O Allah's Messenger! What is your verdict regarding that person who assumes Ihram for 'Umra and is scented with perfume ?\" The Prophet () kept quiet for a while and he was Divinely inspired (then). 'Umar beckoned Ya'la. So he came, and the Allah's Messenger () was shaded with sheet. Ya'la put his head in and saw that the face of Allah's Messenger was red and he was snoring. When the state of the Prophet () was over, he () asked, \"Where is the person who asked about 'Umra?\" Then that person was brought and the Prophet () said, \"Wash the perfume off your body thrice and take off the cloak and do the same in 'Umra as you do in Hajj.\"",
      "usc_msa_ref": "",
      "chain": [
        "20241",
        "11070",
        "11029",
        "11248",
        "20372"
      ]
    },
    {
      "id": "sahih-bukhari-1577",
      "hadith_no": "1577",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو عاصم، أخبرنا ابن جريج، قال أخبرني صالح بن كيسان، عن نافع، عن ابن عمر  رضى الله عنهما  قال أهل النبي صلى الله عليه وسلم حين استوت به راحلته قائمة‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet (p.b.u.h) recited Talbiya when he had mounted his Mount and was ready to set out.",
      "usc_msa_ref": "624",
      "chain": [
        "20241",
        "11070",
        "11176",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-1607",
      "hadith_no": "1607",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا أبو عاصم، قال أخبرني ابن جريج، قال أخبرني عمرو بن دينار، قال سمعت جابر بن عبد الله  رضى الله عنهما  قال لما بنيت الكعبة ذهب النبي صلى الله عليه وسلم وعباس ينقلان الحجارة فقال العباس للنبي صلى الله عليه وسلم اجعل إزارك على رقبتك‏.‏ فخر إلى الأرض، وطمحت عيناه إلى السماء فقال ‏\"‏ أرني إزاري ‏\"‏‏.‏ فشده عليه‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     When the Ka`ba was built, the Prophet and `Abbas went to bring stones (for its construction). Al `Abbas said to the Prophet, \"Take off your waist sheet and put it on your neck.\" (When the Prophet took it off) he fell on the ground with his eyes open towards the sky and said, \"Give me my waist sheet.\" And he covered himself with it.",
      "usc_msa_ref": "652",
      "chain": [
        "30351",
        "20241",
        "11070",
        "11081",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-1643",
      "hadith_no": "1643",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "وقال لي عمرو بن علي حدثنا أبو عاصم، قال ابن جريج أخبرنا قال أخبرني عطاء، إذ منع ابن هشام النساء الطواف مع الرجال قال كيف يمنعهن، وقد طاف نساء النبي صلى الله عليه وسلم مع الرجال قلت أبعد الحجاب أو قبل قال إي لعمري لقد أدركته بعد الحجاب‏.‏ قلت كيف يخالطن الرجال قال لم يكن يخالطن كانت عائشة  رضى الله عنها  تطوف حجرة من الرجال لا تخالطهم، فقالت امرأة انطلقي نستلم يا أم المؤمنين‏.‏ قالت ‏{‏انطلقي‏}‏ عنك‏.‏ وأبت‏.‏ ‏{‏وكن‏}‏ يخرجن متنكرات بالليل، فيطفن مع الرجال، ولكنهن كن إذا دخلن البيت قمن حتى يدخلن وأخرج الرجال، وكنت آتي عائشة أنا وعبيد بن عمير وهي مجاورة في جوف ثبير‏.‏ قلت وما حجابها قال هي في قبة تركية لها غشاء، وما بيننا وبينها غير ذلك، ورأيت عليها درعا موردا‏.‏",
      "text_en": " Ibn Juraij said, \" 'Ata informed us that when Ibn Hisham forbade women to perform Tawaf with men he said to him, 'How do you forbid them while the wives of the Prophet () used to perform Tawaf with the men ?' I said, 'Was this before decreeing of the use of the veil or after it ? 'Ata took an oath and said, 'I saw it after the order of veil.' I said, 'How did they mix with the men?' 'Ata said, 'The women never mixed with the men, and 'Aishah used to perform Tawaf separately and never mixed with men. Once it happened that 'Aishah was performing the Tawaf and woman said to her, 'O Mother of believers! Let us touch the Black stone.'  'Aishah said to her, 'Go yourself,' and she herself refused to do so. The wives of the Prophet () used to come out in night, in disguise and used to perform Tawaf with men. But whenever they intended to enter the Ka'bah, they would stay outside till the men had gone out. I and 'Ubaid bin 'Umair used to visit  'Aishah while she was residing at Jauf Thabir.\" I asked, \"What was her veil?\" 'Ata said, \"She was wearing and old turkish veil, and that was the only thing (weal) which was screen between us and her. I saw a pink cover on her.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20241",
        "11070"
      ]
    },
    {
      "id": "sahih-bukhari-1646",
      "hadith_no": "1646",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن سليمان الأحول، عن طاوس، عن ابن عباس  رضى الله عنهما  أن النبي صلى الله عليه وسلم رأى رجلا يطوف بالكعبة بزمام أو غيره فقطعه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet saw a man performing Tawaf of the Ka`ba tied with a string or something else. So the Prophet cut that string.",
      "usc_msa_ref": "688",
      "chain": [
        "20241",
        "11070",
        "11247",
        "11053",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-1711",
      "hadith_no": "1711",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو عاصم الضحاك بن مخلد، أخبرنا ابن جريج، عن عطاء، عن ابن عباس  رضى الله عنهما  أن النبي صلى الله عليه وسلم أردف الفضل، فأخبر الفضل أنه لم يزل يلبي حتى رمى الجمرة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet made Al-Fadl ride behind him, and Al-Fadl informed that he (the Prophet ) kept on reciting Talbiya till he did the Rami of the Jamra. (Jamrat-Al-`Aqaba.)",
      "usc_msa_ref": "",
      "chain": [
        "20241",
        "11070",
        "11029",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-1757",
      "hadith_no": "1757",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن الحسن بن مسلم، عن طاوس، عن ابن عباس، عن معاوية  رضى الله عنهم  قال قصرت عن رسول الله صلى الله عليه وسلم بمشقص‏.‏",
      "text_en": " Narrated Muawiya:                      I cut short the hair of Allah's Apostle with a long blade.",
      "usc_msa_ref": "787",
      "chain": [
        "20241",
        "11070",
        "11557",
        "11053",
        "17",
        "27"
      ]
    },
    {
      "id": "sahih-bukhari-1802",
      "hadith_no": "1802",
      "source": "Sahih Bukhari",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا عمرو بن علي، حدثنا أبو عاصم، أخبرنا ابن جريج، قال عكرمة بن خالد سألت ابن عمر  رضى الله عنه  مثله‏.‏",
      "text_en": " Narrated `Ikrima bin Khalid:                     \"I asked Ibn `Umar the same (as above).",
      "usc_msa_ref": "3",
      "chain": [
        "30153",
        "20241",
        "11070",
        "21944",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-1805",
      "hadith_no": "1805",
      "source": "Sahih Bukhari",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا أبو عاصم، أخبرنا ابن جريج، قال أخبرني عطاء، عن عروة بن الزبير، قال سألت عائشة  رضى الله عنها  قالت ما اعتمر رسول الله صلى الله عليه وسلم في رجب‏.‏",
      "text_en": " Narrated 'Ursa bin Az-Zubair:                     I asked `Aisha (whether the Prophet had performed `Umra in Rajab). She replied, \"Allah's Apostle never performed any `Umra in Rajab.\"",
      "usc_msa_ref": "5",
      "chain": [
        "20241",
        "11070",
        "11029",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-1884",
      "hadith_no": "1884",
      "source": "Sahih Bukhari",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن ابن شهاب، عن سليمان بن يسار، عن ابن عباس، عن الفضل بن عباس  رضى الله عنهم  أن امرأة، ح‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A woman from the tribe of Khath'am came in the year (of ,Hajjat-al-Wada` of the Prophet ) and said, \"O Allah's Apostle! My father has come under Allah's obligation of performing Hajj but he is a very old man and cannot sit properly on his Mount. Will the obligation be fulfilled if I perform Hajj on his behalf?\" The Prophet replied in the affirmative.",
      "usc_msa_ref": "",
      "chain": [
        "20241",
        "11070",
        "11013",
        "11005",
        "17",
        "135"
      ]
    },
    {
      "id": "sahih-bukhari-1899",
      "hadith_no": "1899",
      "source": "Sahih Bukhari",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن يحيى بن أيوب، عن يزيد، عن أبي الخير، عن عقبة،، فذكر الحديث‏.‏   حدثنا إبراهيم بن موسى، أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني سعيد بن أبي أيوب، أن يزيد بن أبي حبيب، أخبره أن أبا الخير حدثه عن عقبة بن عامر، قال نذرت أختي أن تمشي، إلى بيت الله، وأمرتني أن أستفتي لها النبي صلى الله عليه وسلم فاستفتيته، فقال عليه السلام ‏\"‏ لتمش ولتركب ‏\"‏‏.‏ قال وكان أبو الخير لا يفارق عقبة‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     My sister vowed to go on foot to the Ka`ba, and she asked me to take the verdict of the Prophet about it. So, I did and the Prophet said, \"She should walk and also should ride.\"Narrated Abul-Khair from `Uqba as above.:",
      "usc_msa_ref": "",
      "chain": [
        "20241",
        "11070",
        "20379",
        "20304",
        "11410",
        "30309",
        "20467",
        "11070",
        "20375",
        "11411",
        "189"
      ]
    },
    {
      "id": "sahih-bukhari-1910-2",
      "hadith_no": "1910",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن يحيى بن عبد الله بن صيفي، عن عكرمة بن عبد الرحمن، عن أم سلمة  رضى الله عنها  أن النبي صلى الله عليه وسلم آلى من نسائه شهرا، فلما مضى تسعة وعشرون يوما غدا أو راح فقيل له إنك حلفت أن لا تدخل شهرا‏.‏ فقال ‏\"‏ إن الشهر يكون تسعة وعشرين يوما ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     The Prophet vowed to keep aloof from his wives for a period of one month, and after the completion of 29 days he went either in the morning or in the afternoon to his wives. Someone said to him \"You vowed that you would not go to your wives for one month.\" He replied, \"The month is of 29 days.\"",
      "usc_msa_ref": "134",
      "chain": [
        "20241",
        "11070",
        "11448",
        "56"
      ]
    },
    {
      "id": "sahih-bukhari-1924",
      "hadith_no": "1924",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو عاصم، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع  رضى الله عنه  أن النبي صلى الله عليه وسلم بعث رجلا ينادي في الناس، يوم عاشوراء ‏\"‏ أن من أكل فليتم أو فليصم، ومن لم يأكل فلا يأكل ‏\"‏‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     Once the Prophet ordered a person on 'Ashura' (the tenth of Muharram) to announce, \"Whoever has eaten, should not eat any more, but fast, and who has not eaten should not eat, but complete his fast (till the end of the day).",
      "usc_msa_ref": "147",
      "chain": [
        "20241",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-1977",
      "hadith_no": "1977",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عمرو بن علي، أخبرنا أبو عاصم، عن ابن جريج، سمعت عطاء، أن أبا العباس الشاعر، أخبره أنه، سمع عبد الله بن عمرو  رضى الله عنهما  بلغ النبي صلى الله عليه وسلم أني أسرد الصوم وأصلي الليل، فإما أرسل إلى، وإما لقيته، فقال ‏\"‏ ألم أخبر أنك تصوم ولا تفطر، وتصلي ولا تنام، فصم وأفطر، وقم ونم، فإن لعينك عليك حظا، وإن لنفسك وأهلك عليك حظا ‏\"‏‏.‏ قال إني لأقوى لذلك‏.‏ قال ‏\"‏ فصم صيام داود  عليه السلام  ‏\"‏‏.‏ قال وكيف قال ‏\"‏ كان يصوم يوما ويفطر يوما، ولا يفر إذا لاقى ‏\"‏‏.‏ قال من لي بهذه يا نبي الله قال عطاء لا أدري كيف ذكر صيام الأبد، قال النبي صلى الله عليه وسلم ‏\"‏ لا صام من صام الأبد ‏\"‏‏.‏ مرتين‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     The news of my daily fasting and praying every night throughout the night reached the Prophet. So he sent for me or I met him, and he said, \"I have been informed that you fast everyday and pray every night (all the night). Fast (for some days) and give up fasting (for some days); pray and sleep, for your eyes have a right on you, and your body and your family (i.e. wife) have a right on you.\" I replied, \"I have more power than that (fasting).\" The Prophet said, \"Then fast like the fasts of (the Prophet) David\". I said, \"How?\" He replied, \"He used to fast on alternate days, and he used not to flee on meeting the enemy.\" I said, \"From where can I get that chance?\" (`Ata' said, \"I do not know how the expression of fasting daily throughout the life occurred.\") So, the Prophet said, twice, \"Whoever fasts daily throughout his life is just as the one who does not fast at all.\"",
      "usc_msa_ref": "198",
      "chain": [
        "30153",
        "20241",
        "11070",
        "11029",
        "29"
      ]
    },
    {
      "id": "sahih-bukhari-1984",
      "hadith_no": "1984",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن عبد الحميد بن جبير، عن محمد بن عباد، قال سألت جابرا  رضى الله عنه  نهى النبي صلى الله عليه وسلم عن صوم يوم الجمعة قال نعم‏.‏ زاد غير أبي عاصم أن ينفرد بصوم‏.‏",
      "text_en": " Narrated Muhammad bin `Abbas:                     I asked Jabir \"Did the Prophet forbid fasting on Fridays?\" He replied, \"Yes.\" (Other narrators added, \"If he intends to fast only that day.\")",
      "usc_msa_ref": "205",
      "chain": [
        "20241",
        "11070",
        "11255",
        "30377",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-2000",
      "hadith_no": "2000",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو عاصم، عن عمر بن محمد، عن سالم، عن أبيه  رضى الله عنه  قال قال النبي صلى الله عليه وسلم يوم عاشوراء ‏\"‏ إن شاء صام ‏\"‏‏.‏",
      "text_en": " Narrated Salim's father:                     The Prophet said, \"Whoever wishes may fast on the day of 'Ashura'.\"",
      "usc_msa_ref": "218",
      "chain": [
        "20241",
        "11530",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-2061",
      "hadith_no": "2061",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، قال أخبرني عمرو بن دينار، عن أبي المنهال، قال كنت أتجر في الصرف، فسألت زيد بن أرقم  رضى الله عنه  فقال قال النبي صلى الله عليه وسلم‏.‏    وحدثني الفضل بن يعقوب، حدثنا الحجاج بن محمد، قال ابن جريج أخبرني عمرو بن دينار، وعامر بن مصعب، أنهما سمعا أبا المنهال، يقول سألت البراء بن عازب وزيد بن أرقم عن الصرف، فقالا كنا تاجرين على عهد رسول الله صلى الله عليه وسلم فسألنا رسول الله صلى الله عليه وسلم عن الصرف فقال ‏\"‏ إن كان يدا بيد فلا بأس، وإن كان نساء فلا يصلح ‏\"‏‏.‏",
      "text_en": " Narrated Abu Al-Minhal:                     I used to practice money exchange, and I asked Zaid bin 'Arqam about it, and he narrated what the Prophet said in the following: Abu Al-Minhal said, \"I asked Al-Bara' bin `Azib and Zaid bin Arqam about practicing money exchange. They replied, 'We were traders in the time of Allah's Apostle and I asked Allah's Apostle about money exchange. He replied, 'If it is from hand to hand, there is no harm in it; otherwise it is not permissible.\"",
      "usc_msa_ref": "",
      "chain": [
        "20241",
        "11070",
        "11081",
        "11290"
      ]
    },
    {
      "id": "sahih-bukhari-2215",
      "hadith_no": "2215",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا أبو عاصم، أخبرنا ابن جريج، قال أخبرني موسى بن عقبة، عن نافع، عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ خرج ثلاثة يمشون فأصابهم المطر، فدخلوا في غار في جبل، فانحطت عليهم صخرة‏.‏ قال فقال بعضهم لبعض ادعوا الله بأفضل عمل عملتموه‏.‏ فقال أحدهم اللهم، إني كان لي أبوان شيخان كبيران، فكنت أخرج فأرعى، ثم أجيء فأحلب، فأجيء بالحلاب فآتي به أبوى فيشربان، ثم أسقي الصبية وأهلي وامرأتي، فاحتبست ليلة‏.‏ فجئت فإذا هما نائمان  قال  فكرهت أن أوقظهما، والصبية يتضاغون عند رجلى، فلم يزل ذلك دأبي ودأبهما، حتى طلع الفجر اللهم إن كنت تعلم أني فعلت ذلك ابتغاء وجهك فافرج عنا فرجة نرى منها السماء‏.‏ قال ففرج عنهم‏.‏ وقال الآخر اللهم إن كنت تعلم أني كنت أحب امرأة من بنات عمي كأشد ما يحب الرجل النساء، فقالت لا تنال ذلك منها حتى تعطيها مائة دينار‏.‏ فسعيت فيها حتى جمعتها، فلما قعدت بين رجليها قالت اتق الله، ولا تفض الخاتم إلا بحقه‏.‏ فقمت وتركتها، فإن كنت تعلم أني فعلت ذلك ابتغاء وجهك فافرج عنا فرجة، قال ففرج عنهم الثلثين‏.‏ وقال الآخر اللهم إن كنت تعلم أني استأجرت أجيرا بفرق من ذرة فأعطيته، وأبى ذاك أن يأخذ، فعمدت إلى ذلك الفرق، فزرعته حتى اشتريت منه بقرا وراعيها، ثم جاء فقال يا عبد الله أعطني حقي‏.‏ فقلت انطلق إلى تلك البقر وراعيها، فإنها لك‏.‏ فقال أتستهزئ بي‏.‏ قال فقلت ما أستهزئ بك ولكنها لك‏.‏ اللهم إن كنت تعلم أني فعلت ذلك ابتغاء وجهك فافرج عنا‏.‏ فكشف عنهم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"While three persons were walking, rain began to fall and they had to enter a cave in a mountain. A big rock rolled over and blocked the mouth of the cave. They said to each other, 'Invoke Allah with the best deed you have performed (so Allah might remove the rock)'. One of them said, 'O Allah! My parents were old and I used to go out for grazing (my animals). On my return I would milk (the animals) and take the milk in a vessel to my parents to drink. After they had drunk from it, I would give it to my children, family and wife. One day I was delayed and on my return I found my parents sleeping, and I disliked to wake them up. The children were crying at my feet (because of hunger). That state of affairs continued till it was dawn. O Allah! If You regard that I did it for Your sake, then please remove this rock so that we may see the sky.' So, the rock was moved a bit. The second said, 'O Allah! You know that I was in love with a cousin of mine, like the deepest love a man may have for a woman, and she told me that I would not get my desire fulfilled unless I paid her one-hundred Dinars (gold pieces). So, I struggled for it till I gathered the desired amount, and when I sat in between her legs, she told me to be afraid of Allah, and asked me not to deflower her except rightfully (by marriage). So, I got up and left her. O Allah! If You regard that I did if for Your sake, kindly remove this rock.' So, two-thirds of the rock was removed. Then the third man said, 'O Allah! No doubt You know that once I employed a worker for one Faraq (three Sa's) of millet, and when I wanted to pay him, he refused to take it, so I sowed it and from its yield I bought cows and a shepherd. After a time that man came and demanded his money. I said to him: Go to those cows and the shepherd and take them for they are for you. He asked me whether I was joking with him. I told him that I was not joking with him, and all that belonged to him. O Allah! If You regard that I did it sincerely for Your sake, then please remove the rock.' So, the rock was removed completely from the mouth of the cave.\"",
      "usc_msa_ref": "418",
      "chain": [
        "20184",
        "20241",
        "11070",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-2295",
      "hadith_no": "2295",
      "source": "Sahih Bukhari",
      "chapter": "Kafalah - كتاب الكفالة",
      "chapter_no": "39",
      "text_ar": "حدثنا أبو عاصم، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع  رضى الله عنه  أن النبي صلى الله عليه وسلم أتي بجنازة، ليصلي عليها، فقال ‏\"‏ هل عليه من دين ‏\"‏‏.‏ قالوا لا‏.‏ فصلى عليه، ثم أتي بجنازة أخرى، فقال ‏\"‏ هل عليه من دين ‏\"‏‏.‏ قالوا نعم‏.‏ قال ‏\"‏ صلوا على صاحبكم ‏\"‏‏.‏ قال أبو قتادة على دينه يا رسول الله‏.‏ فصلى عليه‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     A dead person was brought to the Prophet so that he might lead the funeral prayer for him. He asked, \"Is he in debt?\" When the people replied in the negative, he led the funeral prayer. Another dead person was brought and he asked, \"Is he in debt?\" They said, \"Yes.\" He (refused to lead the prayer and) said, \"Lead the prayer of your friend.\" Abu Qatada said, \"O Allah's Apostle! I undertake to pay his debt.\" Allah's Apostle then led his funeral prayer.",
      "usc_msa_ref": "492",
      "chain": [
        "20241",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-2457",
      "hadith_no": "2457",
      "source": "Sahih Bukhari",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن ابن أبي مليكة، عن عائشة  رضى الله عنها  عن النبي صلى الله عليه وسلم قال ‏\"‏ إن أبغض الرجال إلى الله الألد الخصم ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet said, \"The most hated person in the sight of Allah is the most quarrelsome person.\"",
      "usc_msa_ref": "637",
      "chain": [
        "20241",
        "11070",
        "11090",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-2477",
      "hadith_no": "2477",
      "source": "Sahih Bukhari",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو عاصم الضحاك بن مخلد، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع  رضى الله عنه  أن النبي صلى الله عليه وسلم رأى نيرانا توقد يوم خيبر‏.‏ قال ‏\"‏ على ما توقد هذه النيران ‏\"‏‏.‏ قالوا على الحمر الإنسية‏.‏ قال ‏\"‏ اكسروها، وأهرقوها ‏\"‏‏.‏ قالوا ألا نهريقها ونغسلها قال ‏\"‏ اغسلوا ‏\"‏‏.‏ قال أبو عبد الله كان ابن أبي أويس يقول الحمر الأنسية بنصب الألف والنون",
      "text_en": " Narrated Salama bin Al-Akwa`:                     On the day of Khaibar the Prophet saw fires being lighted. He asked, \"Why are these fires being lighted?\" The people replied that they were cooking the meat of donkeys. He said, \"Break the pots and throw away their contents.\" The people said, \"Shall we throw away their contents and wash the pots (rather than break them)?\" He said, \"Wash them.\"",
      "usc_msa_ref": "657",
      "chain": [
        "20241",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-2497",
      "hadith_no": "2497",
      "source": "Sahih Bukhari",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا عمرو بن علي، حدثنا أبو عاصم، عن عثمان يعني ابن الأسود، قال أخبرني سليمان بن أبي مسلم، قال سألت أبا المنهال عن الصرف، يدا بيد فقال اشتريت أنا وشريك، لي شيئا يدا بيد ونسيئة، فجاءنا البراء بن عازب فسألناه، فقال فعلت أنا وشريكي زيد بن أرقم، وسألنا النبي صلى الله عليه وسلم عن ذلك فقال ‏\"‏ ما كان يدا بيد فخذوه، وما كان نسيئة فذروه ‏\"‏‏.‏",
      "text_en": " Narrated Sulaiman bin Abu Muslim:                     I asked Abu Minhal about money exchange from hand to hand. He said, \"I and a partner of mine bought something partly in cash and partly on credit.\" Al-Bara' bin `Azib passed by us and we asked about it. He replied, \"I and my partner Zaid bin Al-Arqam did the same and then went to the Prophet and asked him about it. He said, 'Take what was from hand to hand and leave what was on credit.' \"",
      "usc_msa_ref": "677",
      "chain": [
        "30153",
        "20241",
        "20197",
        "11247",
        "11290"
      ]
    },
    {
      "id": "sahih-bukhari-2590",
      "hadith_no": "2590",
      "source": "Sahih Bukhari",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن ابن أبي مليكة، عن عباد بن عبد الله، عن أسماء  رضى الله عنها  قالت قلت يا رسول الله ما لي مال إلا ما أدخل على الزبير فأتصدق‏.‏ قال ‏\"‏ تصدقي، ولا توعي فيوعى عليك ‏\"‏‏.‏",
      "text_en": " Narrated Asma:                     Once I said, \"O Allah's Apostle! I have no property except what has been given to me by Az-Zubair (i.e. her husband). May I give in charity?\" The Prophet said, \"Give in charity and do not withhold it; otherwise Allah will withhold it back from you . \"",
      "usc_msa_ref": "763",
      "chain": [
        "20241",
        "11070",
        "11090",
        "70"
      ]
    },
    {
      "id": "sahih-bukhari-2659",
      "hadith_no": "2659",
      "source": "Sahih Bukhari",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن ابن أبي مليكة، عن عقبة بن الحارث،‏.‏ وحدثنا علي بن عبد الله، حدثنا يحيى بن سعيد، عن ابن جريج، قال سمعت ابن أبي مليكة، قال حدثني عقبة بن الحارث، أو سمعته منه، أنه تزوج أم يحيى بنت أبي إهاب قال فجاءت أمة سوداء فقالت قد أرضعتكما‏.‏ فذكرت ذلك للنبي صلى الله عليه وسلم فأعرض عني، قال فتنحيت فذكرت ذلك له قال ‏\"‏ وكيف وقد زعمت أن قد أرضعتكما ‏\"‏‏.‏ فنهاه عنها‏.‏",
      "text_en": " Narrated `Uqba bin Al-Harith:                     That he had married Um Yahya bint Abu Ihab. He said. \"A black slave-lady came and said, 'I suckled you both.' I then mentioned that to the Prophet who turned his face aside.\" `Uqba further said, \"I went to the other side and told the Prophet about it. He said, 'How can you (keep her as your wife) when the lady has said that she suckled both of you (i.e. you and your wife?)\" So, the Prophet ordered him to divorce her.",
      "usc_msa_ref": "827",
      "chain": [
        "20241",
        "11070",
        "11090",
        "30026",
        "20031",
        "11070",
        "11090",
        "872"
      ]
    },
    {
      "id": "sahih-bukhari-2660",
      "hadith_no": "2660",
      "source": "Sahih Bukhari",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا أبو عاصم، عن عمر بن سعيد، عن ابن أبي مليكة، عن عقبة بن الحارث، قال تزوجت امرأة فجاءت امرأة فقالت إني قد أرضعتكما‏.‏ فأتيت النبي صلى الله عليه وسلم فقال ‏\"‏ وكيف وقد قيل دعها عنك ‏\"‏ أو نحوه‏.‏",
      "text_en": " Narrated `Uqba bin Al-Harith:                     I married a woman and later on a woman came and said, \"I suckled you both.\" So, I went to the Prophet (to ask him about it). He said, \"How can you (keep her as a wife) when it has been said (that you were foster brother and sister)? Leave (divorce) her.",
      "usc_msa_ref": "828",
      "chain": [
        "20241",
        "10652",
        "11090",
        "872"
      ]
    },
    {
      "id": "sahih-bukhari-2773",
      "hadith_no": "2773",
      "source": "Sahih Bukhari",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو عاصم، حدثنا ابن عون، عن نافع، عن ابن عمر، أن عمر، رضى الله عنه وجد مالا بخيبر، فأتى النبي صلى الله عليه وسلم فأخبره، قال ‏\"‏ إن شئت تصدقت بها ‏\"‏‏.‏ فتصدق بها في الفقراء والمساكين وذي القربى والضيف‏.‏",
      "text_en": " Narrated Ibn `Umar:                     `Umar got some property in Khaibar and he came to the Prophet and informed him about it. The Prophet said to him, \"If you wish you can give it in charity.\" So `Umar gave it in charity (i.e. as an endowment) the yield of which was to be used for the good of the poor, the needy, the kinsmen and the guests.",
      "usc_msa_ref": "34",
      "chain": [
        "20241",
        "11071",
        "11014",
        "18",
        "3"
      ]
    },
    {
      "id": "sahih-bukhari-2984",
      "hadith_no": "2984",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عمرو بن علي، حدثنا أبو عاصم، حدثنا عثمان بن الأسود، حدثنا ابن أبي مليكة، عن عائشة  رضى الله عنها  أنها قالت يا رسول الله، يرجع أصحابك بأجر حج وعمرة، ولم أزد على الحج‏.‏ فقال لها ‏\"‏ اذهبي وليردفك عبد الرحمن ‏\"‏‏.‏ فأمر عبد الرحمن أن يعمرها من التنعيم، فانتظرها رسول الله صلى الله عليه وسلم بأعلى مكة حتى جاءت‏.‏",
      "text_en": " Narrated Aisha:                     That she said, \"O Allah's Apostle! Your companions are returning with the reward of both Hajj and `Umra, while I am returning with (the reward of) Hajj only.\" He said to her, \"Go, and let `Abdur- Rahman (i.e. your brother) make you sit behind him (on the animal).\" So, he ordered `AbdurRahman to let her perform `Umra from Al-Tan`im. Then the Prophet waited for her at the higher region of Mecca till she returned.",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20241",
        "20197",
        "11090",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-3070",
      "hadith_no": "3070",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عمرو بن علي، حدثنا أبو عاصم، أخبرنا حنظلة بن أبي سفيان، أخبرنا سعيد بن ميناء، قال سمعت جابر بن عبد الله  رضى الله عنهما  قال قلت يا رسول الله، ذبحنا بهيمة لنا، وطحنت صاعا من شعير، فتعال أنت ونفر، فصاح النبي صلى الله عليه وسلم فقال ‏\"‏ يا أهل الخندق، إن جابرا قد صنع سؤرا، فحى هلا بكم ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     I said, \"O Allah's Apostle! We have slaughtered a young sheep of ours and have ground one Sa of barley. So, I invite you along with some persons.\" So, the Prophet said in a loud voice, \"O the people of the Trench! Jabir had prepared \"Sur\" so come along.\"",
      "usc_msa_ref": "304",
      "chain": [
        "30153",
        "20241",
        "11243",
        "11510",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-3088",
      "hadith_no": "3088",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن ابن شهاب، عن عبد الرحمن بن عبد الله بن كعب، عن أبيه، وعمه، عبيد الله بن كعب عن كعب  رضى الله عنه  أن النبي صلى الله عليه وسلم كان إذا قدم من سفر ضحى دخل المسجد، فصلى ركعتين قبل أن يجلس‏.‏",
      "text_en": " Narrated Ka`b:                     Whenever the Prophet returned from a journey in the forenoon, he would enter the Mosque and offer two rak`at before sitting.",
      "usc_msa_ref": "321",
      "chain": [
        "20241",
        "11070",
        "11013",
        "11519",
        "1131"
      ]
    },
    {
      "id": "sahih-bukhari-3461",
      "hadith_no": "3461",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا أبو عاصم الضحاك بن مخلد، أخبرنا الأوزاعي، حدثنا حسان بن عطية، عن أبي كبشة، عن عبد الله بن عمرو، أن النبي صلى الله عليه وسلم قال ‏\"‏ بلغوا عني ولو آية، وحدثوا عن بني إسرائيل ولا حرج، ومن كذب على متعمدا فليتبوأ مقعده من النار ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     The Prophet said, \"Convey (my teachings) to the people even if it were a single sentence, and tell others the stories of Bani Israel (which have been taught to you), for it is not sinful to do so. And whoever tells a lie on me intentionally, will surely take his place in the (Hell) Fire.\"",
      "usc_msa_ref": "667",
      "chain": [
        "20241",
        "20024",
        "11413",
        "5371",
        "29"
      ]
    },
    {
      "id": "sahih-bukhari-3582",
      "hadith_no": "3582",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا أبو عاصم، عن عمر بن سعيد بن أبي حسين، عن ابن أبي مليكة، عن عقبة بن الحارث، قال صلى أبو بكر  رضى الله عنه  العصر، ثم خرج يمشي فرأى الحسن يلعب مع الصبيان، فحمله على عاتقه وقال بأبي شبيه بالنبي لا شبيه بعلي‏.‏ وعلي يضحك‏.‏",
      "text_en": " Narrated `Uqba bin Al-Harith:                     (Once) Abu Bakr offered the `Asr prayer and then went out walking and saw Al-Hasan playing with the boys. He lifted him on to his shoulders and said, \" Let my parents be sacrificed for your sake! (You) resemble the Prophet and not `Ali,\" while `Ali was smiling.",
      "usc_msa_ref": "742",
      "chain": [
        "20241",
        "10652",
        "11090",
        "872"
      ]
    },
    {
      "id": "sahih-bukhari-3638",
      "hadith_no": "3638",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني عبد الله، حدثنا أبو عاصم، أخبرنا سعدان بن بشر، حدثنا أبو مجاهد، حدثنا محل بن خليفة، سمعت عديا، كنت عند النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Adi:                     as above (i.e. Hadith No. 793).",
      "usc_msa_ref": "794",
      "chain": [
        "20025",
        "20241",
        "11651"
      ]
    },
    {
      "id": "sahih-bukhari-4068",
      "hadith_no": "4068",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن الزهري، عن عطاء بن يزيد، عن عبيد الله بن عدي، عن المقداد بن الأسود، حدثني إسحاق، حدثنا يعقوب بن إبراهيم بن سعد، حدثنا ابن أخي ابن شهاب، عن عمه، قال أخبرني عطاء بن يزيد الليثي، ثم الجندعي أن عبيد، الله بن عدي بن الخيار أخبره أن المقداد بن عمرو الكندي، وكان حليفا لبني زهرة، وكان ممن شهد بدرا مع رسول الله صلى الله عليه وسلم أخبره أنه قال لرسول الله صلى الله عليه وسلم أرأيت إن لقيت رجلا من الكفار فاقتتلنا، فضرب إحدى يدى بالسيف فقطعها، ثم لاذ مني بشجرة فقال أسلمت لله‏.‏ آأقتله يا رسول الله بعد أن قالها فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقتله ‏\"‏‏.‏ فقال يا رسول الله، إنه قطع إحدى يدى، ثم قال ذلك بعد ما قطعها‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقتله، فإن قتلته فإنه بمنزلتك قبل أن تقتله، وإنك بمنزلته قبل أن يقول كلمته التي قال ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubaidullah bin `Adi bin Al-Khiyar:                     That Al-Miqdad bin `Amr Al-Kindi, who was an ally of Bani Zuhra and one of those who fought the battle of Badr together with Allah's Apostle told him that he said to Allah's Apostle, \"Suppose I met one of the infidels and we fought, and he struck one of my hands with his sword and cut it off and then took refuge in a tree and said, \"I surrender to Allah (i.e. I have become a Muslim),' could I kill him, O Allah's Apostle, after he had said this?\" Allah's Apostle said, \"You should not kill him.\" Al- Miqdad said, \"O Allah's Apostle! But he had cut off one of my two hands, and then he had uttered those words?\" Allah's Apostle replied, \"You should not kill him, for if you kill him, he would be in your position where you had been before killing him, and you would be in his position where he had been before uttering those words.\"",
      "usc_msa_ref": "",
      "chain": [
        "20241",
        "11070",
        "11013",
        "11206",
        "163",
        "30312",
        "20184",
        "20176",
        "11206",
        "880"
      ]
    },
    {
      "id": "sahih-bukhari-4125",
      "hadith_no": "4125",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عمرو بن علي، حدثنا أبو عاصم، حدثنا ابن جريج، عن عمرو بن دينار، عن عكرمة، عن ابن عباس، قال اشتد غضب الله على من قتله نبي، اشتد غضب الله على من دمى وجه رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Wrath gets severe on a person killed by a prophet, and Allah's Wrath became severe on him who had caused the face of Allah's Apostle to bleed.",
      "usc_msa_ref": "403",
      "chain": [
        "30153",
        "20241",
        "11070",
        "11081",
        "11023",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-4152",
      "hadith_no": "4152",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عمرو بن علي، حدثنا أبو عاصم، أخبرنا حنظلة بن أبي سفيان، أخبرنا سعيد بن ميناء، قال سمعت جابر بن عبد الله  رضى الله عنهما  قال لما حفر الخندق رأيت بالنبي صلى الله عليه وسلم خمصا شديدا، فانكفأت إلى امرأتي فقلت هل عندك شىء فإني رأيت برسول الله صلى الله عليه وسلم خمصا شديدا‏.‏ فأخرجت إلى جرابا فيه صاع من شعير، ولنا بهيمة داجن فذبحتها، وطحنت الشعير ففرغت إلى فراغي، وقطعتها في برمتها، ثم وليت إلى رسول الله صلى الله عليه وسلم فقالت لا تفضحني برسول الله صلى الله عليه وسلم وبمن معه‏.‏ فجئته فساررته فقلت يا رسول الله ذبحنا بهيمة لنا وطحنا صاعا من شعير كان عندنا، فتعال أنت ونفر معك‏.‏ فصاح النبي صلى الله عليه وسلم فقال ‏\"‏ يا أهل الخندق، إن جابرا قد صنع سورا فحى هلا بكم ‏\"‏‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تنزلن برمتكم، ولا تخبزن عجينكم حتى أجيء ‏\"‏‏.‏ فجئت وجاء رسول الله صلى الله عليه وسلم يقدم الناس حتى جئت امرأتي، فقالت بك وبك‏.‏ فقلت قد فعلت الذي قلت‏.‏ فأخرجت له عجينا، فبصق فيه وبارك، ثم عمد إلى برمتنا فبصق وبارك ثم قال ‏\"‏ ادع خابزة فلتخبز معي واقدحي من برمتكم ولا تنزلوها‏\"‏، وهم ألف، فأقسم بالله لقد أكلوا حتى تركوه وانحرفوا، وإن برمتنا لتغط كما هي، وإن عجيننا ليخبز كما هو‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     When the Trench was dug, I saw the Prophet in the state of severe hunger. So I returned to my wife and said, \"Have you got anything (to eat), for I have seen Allah's Apostle in a state of severe hunger.\" She brought out for me, a bag containing one Sa of barley, and we had a domestic she animal (i.e. a kid) which I slaughtered then, and my wife ground the barley and she finished at the time I finished my job (i.e. slaughtering the kid). Then I cut the meat into pieces and put it in an earthenware (cooking) pot, and returned to Allah's Apostle . My wife said, \"Do not disgrace me in front of Allah's Apostle and those who are with him.\" So I went to him and said to him secretly, \"O Allah's Apostle! I have slaughtered a she-animal (i.e. kid) of ours, and we have ground a Sa of barley which was with us. So please come, you and another person along with you.\" The Prophet raised his voice and said, \"O people of Trench ! Jabir has prepared a meal so let us go.\" Allah's Apostle said to me, \"Don't put down your earthenware meat pot (from the fireplace) or bake your dough till I come.\" So I came (to my house) and Allah's Apostle too, came, proceeding before the people. When I came to my wife, she said, \"May Allah do so-and-so to you.\" I said, \"I have told the Prophet of what you said.\" Then she brought out to him (i.e. the Prophet the dough, and he spat in it and invoked for Allah's Blessings in it. Then he proceeded towards our earthenware meat-pot and spat in it and invoked for Allah's Blessings in it. Then he said (to my wife). Call a lady-baker to bake along with you and keep on taking out scoops from your earthenware meat-pot, and do not put it down from its fireplace.\" They were onethousand (who took their meals), and by Allah they all ate, and when they left the food and went away, our earthenware pot was still bubbling (full of meat) as if it had not decreased, and our dough was still being baked as if nothing had been taken from it.",
      "usc_msa_ref": "428",
      "chain": [
        "30153",
        "20241",
        "11243",
        "11510",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-4317",
      "hadith_no": "4317",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو عاصم الضحاك بن مخلد، حدثنا يزيد، عن سلمة بن الأكوع  رضى الله عنه  قال غزوت مع النبي صلى الله عليه وسلم سبع غزوات، وغزوت مع ابن حارثة استعمله علينا‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     I fought in nine Ghazwa-t along with the Prophet, I also fought along with Ibn Haritha when the Prophet made him our commander.",
      "usc_msa_ref": "570",
      "chain": [
        "20241",
        "20472",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-4358",
      "hadith_no": "4358",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسحاق، حدثنا أبو عاصم، عن ابن جريج، قال أخبرني حسن بن مسلم، عن مجاهد، أن رسول الله قام يوم الفتح فقال ‏\"‏ إن الله حرم مكة يوم خلق السموات والأرض، فهى حرام بحرام الله إلى يوم القيامة، لم تحل لأحد قبلي، ولا تحل لأحد بعدي، ولم تحلل لي إلا ساعة من الدهر، لا ينفر صيدها، ولا يعضد شوكها، ولا يختلى خلاها ولا تحل لقطتها إلا لمنشد ‏\"‏‏.‏ فقال العباس بن عبد المطلب إلا الإذخر يا رسول الله، فإنه لا بد منه للقين والبيوت، فسكت ثم قال ‏\"‏ إلا الإذخر فإنه حلال ‏\"‏‏.‏ وعن ابن جريج أخبرني عبد الكريم عن عكرمة عن ابن عباس بمثل هذا أو نحو هذا‏.‏ رواه أبو هريرة عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Mujahid:                     Allah's Apostle got up on the day of the Conquest of Mecca and said, \"Allah has made Mecca a sanctuary since the day He created the Heavens and the Earth, and it will remain a sanctuary by virtue of the sanctity Allah has bestowed on it till the Day of Resurrection. It (i.e. fighting in it) was not made lawful to anyone before me!, nor will it be made lawful to anyone after me, and it was not made lawful for me except for a short period of time. Its game should not be chased, nor should its trees be cut, nor its vegetation or grass uprooted, not its Luqata (i.e. Most things) picked up except by one who makes a public announcement about it.\" Al-Abbas bin `Abdul Muttalib said, \"Except the Idhkhir, O Allah's Apostle, as it is indispensable for blacksmiths and houses.\" On that, the Prophet kept quiet and then said, \"Except the Idhkhir as it is lawful to cut.\"",
      "usc_msa_ref": "603",
      "chain": [
        "30312",
        "20241",
        "11070",
        "11028"
      ]
    },
    {
      "id": "sahih-bukhari-4429",
      "hadith_no": "4429",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عمرو بن علي، حدثنا أبو عاصم، حدثنا سفيان، حدثنا أبو صخرة، جامع بن شداد حدثنا صفوان بن محرز المازني، حدثنا عمران بن حصين، قال جاءت بنو تميم إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ أبشروا يا بني تميم ‏\"‏‏.‏ قالوا أما إذ بشرتنا فأعطنا‏.‏ فتغير وجه رسول الله صلى الله عليه وسلم، فجاء ناس من أهل اليمن، فقال النبي صلى الله عليه وسلم ‏\"‏ اقبلوا البشرى إذ لم يقبلها بنو تميم ‏\"‏‏.‏ قالوا قد قبلنا يا رسول الله‏.‏",
      "text_en": " Narrated `Imran bin Husain:                     The people of Banu Tamim came to Allah's Apostle, and he said, \"Be glad (i.e. have good tidings). O Banu Tamim!\" They said, \"As you have given us good tidings then give us (some material things).\" On that the features of Allah's Apostle changed (i.e. he took it ill). Then some people from Yemen came, and the Prophet said (to them) \"Accept good tidings as Banu Tamim have not accepted them.\" They said, \"We accept them, O Allah's Apostle!\"",
      "usc_msa_ref": "669",
      "chain": [
        "30153",
        "20241",
        "20012",
        "11328",
        "11693",
        "123"
      ]
    },
    {
      "id": "sahih-bukhari-4508",
      "hadith_no": "4508",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو عاصم الضحاك بن مخلد، عن الفضيل بن سليمان، حدثنا موسى بن عقبة، عن سالم، عن أبيه، استعمل النبي صلى الله عليه وسلم أسامة  فقالوا فيه  فقال النبي صلى الله عليه وسلم ‏\"‏ قد بلغني أنكم قلتم في أسامة، وإنه أحب الناس إلى ‏\"‏‏.‏",
      "text_en": " Narrated Salim's father:                     The Prophet appointed Usama as the commander of the troops (to be sent to Syria). The Muslims spoke about Usama (unfavorably ). The Prophet said, \" I have been informed that you spoke about Usama. (Let it be known that ) he is the most beloved of all people to me.\"",
      "usc_msa_ref": "744",
      "chain": [
        "20241",
        "20271",
        "11106",
        "11011"
      ]
    },
    {
      "id": "sahih-bukhari-4678",
      "hadith_no": "4678",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "وقال أبو عاصم حدثنا عبد الحميد، حدثنا يزيد، كتب إلى عطاء سمعت جابرا، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20241",
        "11703",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-5257",
      "hadith_no": "5257",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج،‏.‏ وحدثني محمد بن مقاتل، أخبرنا عبد الله، أخبرنا ابن جريج، قال أخبرني يحيى بن عبد الله بن صيفي، أن عكرمة بن عبد الرحمن بن الحارث، أخبره أن أم سلمة أخبرته أن النبي صلى الله عليه وسلم حلف لا يدخل على بعض أهله شهرا، فلما مضى تسعة وعشرون يوما غدا عليهن أو راح فقيل له يا نبي الله حلفت أن لا تدخل عليهن شهرا قال ‏\"‏ إن الشهر يكون تسعة وعشرين يوما ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     The Prophet took an oath that he would not enter upon some of his wives for one month. But when twenty nine days had elapsed, he went to them in the morning or evening. It was said to him, \"O Allah's Prophet! You had taken an oath that you would not enter upon them for one month.\" He replied, \"The month can be of twenty nine days.\"",
      "usc_msa_ref": "130",
      "chain": [
        "20241",
        "30118",
        "20025",
        "11070",
        "11448",
        "56"
      ]
    },
    {
      "id": "sahih-bukhari-5515",
      "hadith_no": "5515",
      "source": "Sahih Bukhari",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا أبو عاصم، عن ثور بن يزيد، عن خالد بن معدان، عن أبي أمامة، أن النبي صلى الله عليه وسلم كان إذا فرغ من طعامه  وقال مرة إذا رفع مائدته  قال ‏\"‏ الحمد لله الذي كفانا وأروانا، غير مكفي، ولا مكفور  وقال مرة الحمد لله ربنا، غير مكفي، ولا مودع  ولا مستغنى، ربنا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Umama:                     Whenever the Prophet finished his meals (or when his dining sheet was taken away), he used to say. \"Praise be to Allah Who has satisfied our needs and quenched our thirst. Your favor cannot by compensated or denied.\" Once he said, upraise be to You, O our Lord! Your favor cannot be compensated, nor can be left, nor can be dispensed with, O our Lord!\"",
      "usc_msa_ref": "369",
      "chain": [
        "20241",
        "20415",
        "11422",
        "405"
      ]
    },
    {
      "id": "sahih-bukhari-5546",
      "hadith_no": "5546",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا أبو عاصم، عن حيوة،‏.‏ وحدثني أحمد بن أبي رجاء، حدثنا سلمة بن سليمان، عن ابن المبارك، عن حيوة بن شريح، قال سمعت ربيعة بن يزيد الدمشقي، قال أخبرني أبو إدريس، عائذ الله قال سمعت أبا ثعلبة الخشني  رضى الله عنه  يقول أتيت رسول الله صلى الله عليه وسلم فقلت يا رسول الله إنا بأرض قوم أهل الكتاب، نأكل في آنيتهم، وأرض صيد أصيد بقوسي، وأصيد بكلبي المعلم، والذي ليس معلما، فأخبرني ما الذي يحل لنا من ذلك فقال ‏\"‏ أما ما ذكرت أنك بأرض قوم أهل الكتاب، تأكل في آنيتهم، فإن وجدتم غير آنيتهم، فلا تأكلوا فيها، وإن لم تجدوا فاغسلوها ثم كلوا فيها، وأما ما ذكرت أنك بأرض صيد، فما صدت بقوسك، فاذكر اسم الله، ثم كل، وما صدت بكلبك المعلم، فاذكر اسم الله، ثم كل، وما صدت بكلبك الذي ليس معلما فأدركت ذكاته، فكل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Tha`laba Al-Khushani:                     I came to Allah's Apostle and said, \"O Allah's Apostle! We are living in the land of the people of the Scripture and we take our meals in their utensils, and in the land there is game and I hunt with my bow and trained or untrained hounds; please tell me what is lawful for us of that.\" He said, \"As for your saying that you are living in the land of the people of the Scripture and that you eat in their utensils, if you can get utensils other than theirs, do not eat in their utensils, but if you do not find (other than theirs), then wash their utensils and eat in them. As for your saying that you are in the land of game, if you hung something with your bow, and have mentioned Allah's Name while hunting, then you can eat (the game). And if you hunt something with your trained hound, and have mentioned Allah's Name on sending it for hunting then you can eat (the game). But if you hunt something with your untrained hound and you were able to slaughter it before its death, you can eat of it.\"",
      "usc_msa_ref": "396",
      "chain": [
        "20241",
        "30300",
        "30340",
        "20025",
        "26010",
        "11414"
      ]
    },
    {
      "id": "sahih-bukhari-5554",
      "hadith_no": "5554",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا أبو عاصم، عن حيوة بن شريح، قال حدثني ربيعة بن يزيد الدمشقي، قال حدثني أبو إدريس الخولاني، قال حدثني أبو ثعلبة الخشني، قال أتيت النبي صلى الله عليه وسلم فقلت يا رسول الله إنا بأرض أهل الكتاب، فنأكل في آنيتهم، وبأرض صيد، أصيد بقوسي، وأصيد بكلبي المعلم، وبكلبي الذي ليس بمعلم‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أما ما ذكرت أنك بأرض أهل كتاب فلا تأكلوا في آنيتهم، إلا أن لا تجدوا بدا، فإن لم تجدوا بدا فاغسلوها وكلوا، وأما ما ذكرت أنكم بأرض صيد، فما صدت بقوسك، فاذكر اسم الله وكل، وما صدت بكلبك المعلم، فاذكر اسم الله وكل، وما صدت بكلبك الذي ليس بمعلم، فأدركت ذكاته، فكله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Tha`laba Al-Khushani:                     I came to the Prophet and said, \"O Allah's Apostle! We are living in the land of the people of the Scripture, and we take our meals in their utensils, and there is game in that land and I hunt with my bow and with my trained hound and with my untrained hound.\" The Prophet said, \"As for your saying that you are in the land of people of the Scripture, you should not eat in their utensils unless you find no alternative, in which case you must wash the utensils and then eat in them As for your saying that you are in the land of game, if you hunt something with your bow, mention Allah's Name (while hunting the game) and eat; and if you hunt something with your trained hound, mention Allah's Name on sending and eat; and if you hunt something with your untrained hound and get it alive, slaughter it and you can eat of it.\"",
      "usc_msa_ref": "404",
      "chain": [
        "20241",
        "26010",
        "11414",
        "11027"
      ]
    },
    {
      "id": "sahih-bukhari-5628",
      "hadith_no": "5628",
      "source": "Sahih Bukhari",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا أبو عاصم، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، قال قال النبي صلى الله عليه وسلم ‏\"‏ من ضحى منكم فلا يصبحن بعد ثالثة وفي بيته منه شىء ‏\"‏‏.‏ فلما كان العام المقبل قالوا يا رسول الله نفعل كما فعلنا عام الماضي قال ‏\"‏ كلوا وأطعموا وادخروا فإن ذلك العام كان بالناس جهد فأردت أن تعينوا فيها ‏\"‏‏.‏",
      "text_en": " Narrated Salama bin Al-Aqua':                     The Prophet said, \"Whoever has slaughtered a sacrifice should not keep anything of Its meat after three days.\" When it was the next year the people said, \"O Allah's Apostle! Shall we do as we did last year?\" He said, ' Eat of it and feed of it to others and store of it for in that year the people were having a hard time and I wanted you to help (the needy).",
      "usc_msa_ref": "476",
      "chain": [
        "20241",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-5661",
      "hadith_no": "5661",
      "source": "Sahih Bukhari",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، أخبرني عطاء، أنه سمع جابرا  رضى الله عنه  يقول نهى النبي صلى الله عليه وسلم عن الزبيب والتمر والبسر والرطب‏.‏",
      "text_en": " Narrated Jabir:                     The Prophet forbade the drinking of alcoholic drinks prepared from raisins, dates, unripe dates and fresh ripe dates.",
      "usc_msa_ref": "506",
      "chain": [
        "20241",
        "11070",
        "11029",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-5669",
      "hadith_no": "5669",
      "source": "Sahih Bukhari",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا أبو عاصم، عن الأوزاعي، عن ابن شهاب، عن عبيد الله بن عبد الله، عن ابن عباس  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم شرب لبنا فمضمض وقال ‏\"‏ إن له دسما ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle drank milk and then rinsed his mouth and said, \"It contains fat. The Prophet added: I was raised to the Lote Tree and saw four rivers, two of which were coming out and two going in. Those which were coming out were the Nile and the Euphrates, and those which were going in were two rivers in paradise. Then I was given three bowls, one containing milk, and another containing honey, and a third containing wine. I took the bowl containing milk and drank it. It was said to me, \"You and your followers will be on the right path (of Islam).",
      "usc_msa_ref": "514",
      "chain": [
        "20241",
        "20024",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-5691",
      "hadith_no": "5691",
      "source": "Sahih Bukhari",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا أبو عاصم، وأبو نعيم قالا حدثنا عزرة بن ثابت، قال أخبرني ثمامة بن عبد الله، قال كان أنس يتنفس في الإناء مرتين أو ثلاثا، وزعم أن النبي صلى الله عليه وسلم كان يتنفس ثلاثا‏.‏",
      "text_en": " Narrated Thumama bin `Abdullah:                     Anas used to breathe twice or thrice in the vessel (while drinking) and used to say that the Prophet; used to take three breaths while drinking.",
      "usc_msa_ref": "535",
      "chain": [
        "20241",
        "20348",
        "20561",
        "11270"
      ]
    },
    {
      "id": "sahih-bukhari-5792",
      "hadith_no": "5792",
      "source": "Sahih Bukhari",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا أبو عاصم، عن مالك، عن سمى، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ المبطون شهيد، والمطعون شهيد ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"He (a Muslim) who dies of an Abdominal disease is a a martyr, and he who dies of plague is a martyr.\"",
      "usc_msa_ref": "629",
      "chain": [
        "20241",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-5941",
      "hadith_no": "5941",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا أبو عاصم، أخبرنا ابن جريج، أخبرنا الحسن بن مسلم، عن طاوس، عن ابن عباس  رضى الله عنهما  شهدت العيد مع النبي صلى الله عليه وسلم فصلى قبل الخطبة‏.‏ وزاد ابن وهب عن ابن جريج فأتى النساء فجعلن يلقين الفتخ والخواتيم في ثوب بلال‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I offered the `Id prayer with the Prophet and he offered prayer before the Khutba (sermon). ibn `Abbas added: After the prayer the Prophet came towards (the rows of) the women and ordered them to give alms, and the women started putting their big and small rings in the garment of Bilal.",
      "usc_msa_ref": "768",
      "chain": [
        "20241",
        "11070",
        "11557",
        "11053",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-6109",
      "hadith_no": "6109",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عمرو بن علي، حدثنا أبو عاصم، عن ابن جريج، قال أخبرني موسى بن عقبة، عن نافع، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أحب الله عبدا نادى جبريل إن الله يحب فلانا، فأحبه‏.‏ فيحبه جبريل، فينادي جبريل في أهل السماء إن الله يحب فلانا، فأحبوه‏.‏ فيحبه أهل السماء، ثم يوضع له القبول في أهل الأرض ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"If Allah loves a person, He calls Gabriel saying: 'Allah loves so and so; O Gabriel, love him.' Gabriel would love him, and then Gabriel would make an announcement among the residents of the Heaven, 'Allah loves so-and-so, therefore, you should love him also.' So, all the residents of the Heavens would love him and then he is granted the pleasure of the people of the earth.\"",
      "usc_msa_ref": "66",
      "chain": [
        "30153",
        "20241",
        "11070",
        "11106",
        "11014",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-6349",
      "hadith_no": "6349",
      "source": "Sahih Bukhari",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا أبو عاصم، عن عمر بن سعيد، عن ابن أبي مليكة، أن عقبة بن الحارث، حدثه قال صلى النبي صلى الله عليه وسلم العصر، فأسرع، ثم دخل البيت‏.‏",
      "text_en": " Narrated `Uqba bin Al-Harith:                     Once the Prophet offered the `Asr prayer and then he walked quickly and entered his house.",
      "usc_msa_ref": "292",
      "chain": [
        "20241",
        "10652",
        "11090",
        "872"
      ]
    },
    {
      "id": "sahih-bukhari-6512",
      "hadith_no": "6512",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن عطاء، قال سمعت ابن عباس  رضى الله عنهما  يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لو كان لابن آدم واديان من مال لابتغى ثالثا، ولا يملأ جوف ابن آدم إلا التراب، ويتوب الله على من تاب ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I heard the Prophet saying, \"If the son of Adam (the human being) had two valley of money, he would wish for a third, for nothing can fill the belly of Adam's son except dust, and Allah forgives him who repents to Him.\"",
      "usc_msa_ref": "444",
      "chain": [
        "20241",
        "11070",
        "11029",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-6783",
      "hadith_no": "6783",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا أبو عاصم، عن مالك، عن طلحة بن عبد الملك، عن القاسم، عن عائشة  رضى الله عنها  قالت قال النبي صلى الله عليه وسلم ‏\"‏ من نذر أن يطيع الله فليطعه، ومن نذر أن يعصيه فلا يعصه ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet said, \"Whoever vowed to be obedient to Allah, must be obedient to Him; and whoever vowed to be disobedient to Allah, should not be disobedient to Him.\"",
      "usc_msa_ref": "691",
      "chain": [
        "20241",
        "20001",
        "11695",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-6786",
      "hadith_no": "6786",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن سليمان الأحول، عن طاوس، عن ابن عباس، أن النبي صلى الله عليه وسلم رأى رجلا يطوف بالكعبة بزمام أو غيره، فقطعه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet saw a man performing Tawaf around the Ka`ba, tied with a rope or something else (while another person was holding him). The Prophet cut that rope off.",
      "usc_msa_ref": "693",
      "chain": [
        "20241",
        "11070",
        "11247",
        "11053",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-6850",
      "hadith_no": "6850",
      "source": "Sahih Bukhari",
      "chapter": "Laws of Inheritance (Al-Faraa'id) - كتاب الفرائض",
      "chapter_no": "85",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن ابن شهاب، عن علي بن حسين، عن عمرو بن عثمان، عن أسامة بن زيد  رضى الله عنهما  أن النبي صلى الله عليه وسلم قال ‏\"‏ لا يرث المسلم الكافر، ولا الكافر المسلم ‏\"‏‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     the Prophet said, \"A Muslim cannot be the heir of a disbeliever, nor can a disbeliever be the heir of a Muslim.\"",
      "usc_msa_ref": "756",
      "chain": [
        "20241",
        "11070",
        "11013",
        "11045",
        "10581",
        "50"
      ]
    },
    {
      "id": "sahih-bukhari-6977",
      "hadith_no": "6977",
      "source": "Sahih Bukhari",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن عطاء، عن صفوان بن يعلى، عن أبيه، قال خرجت في غزوة، فعض رجل فانتزع ثنيته، فأبطلها النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ya`la:                     I went out in one of the Ghazwa and a man bit another man and as a result, an incisor tooth of the former was pulled out. The Prophet cancelled the case.",
      "usc_msa_ref": "31",
      "chain": [
        "20241",
        "11070",
        "11029",
        "11248",
        "897"
      ]
    },
    {
      "id": "sahih-bukhari-7057",
      "hadith_no": "7057",
      "source": "Sahih Bukhari",
      "chapter": "Tricks - كتاب الحيل",
      "chapter_no": "91",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن ابن أبي مليكة، عن ذكوان، عن عائشة  رضى الله عنها  قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ البكر تستأذن ‏\"‏‏.‏ قلت إن البكر تستحيي قال ‏\"‏ إذنها صماتها ‏\"‏‏.‏ وقال بعض الناس إن هوي رجل جارية يتيمة أو بكرا، فأبت فاحتال فجاء بشاهدى زور على أنه تزوجها، فأدركت فرضيت اليتيمة، فقبل القاضي شهادة الزور، والزوج يعلم ببطلان ذلك، حل له الوطء‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle said, \"It is essential to have the consent of a virgin (for the marriage). I said, \"A virgin feels shy.\" The Prophet; said, \"Her silence means her consent.\" Some people said, \"If a man falls in love with an orphan slave girl or a virgin and she refuses (him) and then he makes a trick by bringing two false witnesses to testify that he has married her, and then she attains the age of puberty and agrees to marry him and the judge accepts the false witness and the husband knows that the witnesses were false ones, he may consummate his marriage.\"",
      "usc_msa_ref": "101",
      "chain": [
        "20241",
        "11070",
        "11090",
        "11161",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-7294",
      "hadith_no": "7294",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا أبو عاصم، عن يزيد بن أبي عبيد، عن سلمة، قال بايعنا النبي صلى الله عليه وسلم تحت الشجرة فقال لي ‏\"‏ يا سلمة ألا تبايع ‏\"‏‏.‏ قلت يا رسول الله قد بايعت في الأول‏.‏ قال ‏\"‏ وفي الثاني ‏\"‏‏.‏",
      "text_en": " Narrated Salama:                     We gave the oath of allegiance to the Prophet under the tree. He said to me, \"O Salama! Will you not give the oath of allegiance?\" I replied, \"O Allah's Apostle! I have already given the oath of allegiance for the first time.\" He said, (Give it again) for the second time.",
      "usc_msa_ref": "315",
      "chain": [
        "20241",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-bukhari-7459",
      "hadith_no": "7459",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا أبو عاصم، حدثنا زكرياء بن إسحاق، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، رضى الله عنهما أن النبي صلى الله عليه وسلم بعث معاذا إلى اليمن‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20241",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-7621",
      "hadith_no": "7621",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا إسحاق، حدثنا أبو عاصم، أخبرنا ابن جريج، أخبرنا ابن شهاب، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس منا من لم يتغن بالقرآن ‏\"‏‏.‏ وزاد غيره ‏\"‏ يجهر به ‏\"‏‏.‏",
      "text_en": " Narrated Abu Salama:                     Abu Huraira said, \"Allah's Apostle said, 'Whoever does not recite Qur'an in a nice voice is not from us,' and others said extra,\" (that means) to recite it aloud.\"",
      "usc_msa_ref": "618",
      "chain": [
        "30312",
        "20241",
        "11070",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-7651",
      "hadith_no": "7651",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عمرو بن علي، حدثنا أبو عاصم، حدثنا قرة بن خالد، حدثنا أبو جمرة الضبعي، قلت لابن عباس فقال قدم وفد عبد القيس على رسول الله صلى الله عليه وسلم فقالوا إن بيننا وبينك المشركين من مضر، وإنا لا نصل إليك إلا في أشهر حرم، فمرنا بجمل من الأمر، إن عملنا به دخلنا الجنة، وندعو إليها من وراءنا‏.‏ قال ‏\"‏ آمركم بأربع وأنهاكم عن أربع، آمركم بالإيمان بالله، وهل تدرون ما الإيمان بالله شهادة أن لا إله إلا الله، وإقام الصلاة، وإيتاء الزكاة، وتعطوا من المغنم الخمس، وأنهاكم عن أربع لا تشربوا في الدباء، والنقير، والظروف المزفتة، والحنتمة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The delegates of `Abdul Qais came to Allah's Apostle and said, \"The pagans of the tribe of Mudar intervene between you and us therefore we cannot come to you except in the Holy months. So please order us to do something good (Religious deeds) by which we may enter Paradise (by acting on them) and we may inform our people whom we have left behind to observe it.\" The Prophet said, \"I order you to do four things and forbid you from four things: I order you to believe in Allah. Do you know what is meant by belief in Allah? It is to testify that none has the right to be worshipped except Allah, to offer prayers perfectly, to give Zakat, and to give Al-Khumus (one-fifth of the war booty) (in Allah's Cause). And I forbid you four things, (i.e., Do not drink alcoholic drinks) Ad-Dubba, An- Naqir, (pitched water skins), Az-Zuruf, Al-Muzaffat and Al--Hantam (names of utensils used for the preparation of alcoholic drinks).\" (See Hadith No. 50, Vol. 1)",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20241",
        "11301",
        "11309"
      ]
    },
    {
      "id": "sahih-muslim-129",
      "hadith_no": "129",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني محمد بن بكار البصري، حدثنا أبو عاصم، عن ابن جريج، ح وحدثني محمد بن رافع، - واللفظ له - حدثنا عبد الرزاق، أخبرنا ابن جريج، قال أخبرني أبو قزعة، أن أبا نضرة، أخبره وحسنا، أخبرهما أن أبا سعيد الخدري أخبره أن وفد عبد القيس لما أتوا نبي الله صلى الله عليه وسلم قالوا يا نبي الله جعلنا الله فداءك ماذا يصلح لنا من الأشربة فقال ‏\"‏ لا تشربوا في النقير ‏\"‏ ‏.‏ قالوا يا نبي الله جعلنا الله فداءك أوتدري ما النقير قال ‏\"‏ نعم الجذع ينقر وسطه ولا في الدباء ولا في الحنتمة وعليكم بالموكى ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Said al-Khudri that when the delegation of the tribe of Abdul-Qais came to the Prophet of Allah (may peace be upon him), (its members) said:                      Apostle of Allah, may God enable us to lay down our lives for you, which beverage is good for us? He (the Prophet) said: (Not to speak of beverages, I would lay stress) that you should not drink in the wine jars. They said: Apostle of Allah, may God enable us to lay down our lives for you, do you know what al-naqir is? He (the Holy Prophet) replied: Yes, it is a stump which you hollow out in the middle, and added: Do not use gourd or receptacle (for drink). Use water-skin the mouth of which is tied with a thong (for this purpose).",
      "usc_msa_ref": "",
      "chain": [
        "30512",
        "20241",
        "11070",
        "30375",
        "20121",
        "11070",
        "10689",
        "10721",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-131",
      "hadith_no": "131",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا بشر بن السري، حدثنا زكرياء بن إسحاق، ح وحدثنا عبد بن حميد، حدثنا أبو عاصم، عن زكرياء بن إسحاق، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، أن النبي صلى الله عليه وسلم بعث معاذا إلى اليمن فقال ‏\"‏ إنك ستأتي قوما ‏\"‏ بمثل حديث وكيع ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20190",
        "11244",
        "30553",
        "20241",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-171",
      "hadith_no": "171",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا حسن الحلواني، وعبد بن حميد، جميعا عن أبي عاصم، - قال عبد أنبأنا أبو عاصم، - عن ابن جريج، أنه سمع أبا الزبير، يقول سمعت جابرا، يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ المسلم من سلم المسلمون من لسانه ويده ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Jabir that he heard the (Holy Prophet) say:                      A Muslim is he from whose hand and tongue the Muslim's are safe.",
      "usc_msa_ref": "",
      "chain": [
        "130115",
        "30553",
        "20241",
        "20241",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-318-2",
      "hadith_no": "318",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا محمد بن المثنى العنزي، حدثني أبو عاصم، عن حنظلة بن أبي سفيان، عن القاسم، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا اغتسل من الجنابة دعا بشىء نحو الحلاب فأخذ بكفه بدأ بشق رأسه الأيمن ثم الأيسر ثم أخذ بكفيه فقال بهما على رأسه ‏.‏",
      "text_en": " 'A'isha reported:                      When the Messenger of Allah (may peace be upon him) took a bath because of sexual intercourse, he called for a vessel and took a handful of water from it and first (washed) the right side of his head, then left, and then took a handful (of water) and poured it on his head.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20241",
        "11243",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-364-2",
      "hadith_no": "364",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا أحمد بن عثمان النوفلي، حدثنا أبو عاصم، حدثنا ابن جريج، أخبرني عمرو بن دينار، أخبرني عطاء، منذ حين قال أخبرني ابن عباس، أن ميمونة، أخبرته أن داجنة كانت لبعض نساء رسول الله صلى الله عليه وسلم فماتت فقال رسول الله صلى الله عليه وسلم ‏\"‏ ألا أخذتم إهابها فاستمتعتم به ‏\"‏ ‏.‏",
      "text_en": " Ibn'Abbas reported on the authority of Maimuna that someone amongst the wives of the Messenger of Allah (may peace be upon him) had a domestic animal and it died. Upon this the Messenger of Allah (may peace be upon him) said:                      Why did you not take off its skin and make use of that?",
      "usc_msa_ref": "",
      "chain": [
        "30185",
        "20241",
        "11070",
        "11081",
        "17",
        "61"
      ]
    },
    {
      "id": "sahih-muslim-374-5",
      "hadith_no": "374",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني محمد بن عمرو بن عباد بن جبلة، حدثنا أبو عاصم، عن ابن جريج، قال حدثنا سعيد بن حويرث، أنه سمع ابن عباس، يقول إن النبي صلى الله عليه وسلم قضى حاجته من الخلاء فقرب إليه طعام فأكل ولم يمس ماء ‏.‏ قال وزادني عمرو بن دينار عن سعيد بن الحويرث أن النبي صلى الله عليه وسلم قيل له إنك لم توضأ قال ‏\"‏ ما أردت صلاة فأتوضأ ‏\"‏ ‏.‏ وزعم عمرو أنه سمع من سعيد بن الحويرث ‏.‏",
      "text_en": " Ibn Abbas, reported:                      The Apostle of Allah (may peace be upon him) came out of the privy after relieving himself, and food was brought to him and he took it, and did not touch water. In another narration transmitted by Sa'id b. al-Huwairith it is like this: It was said to the Apostle of Allah (may peace be upon him) You have not performed ablution. He said: I do not intend to say prayer that I should perform ablution.",
      "usc_msa_ref": "",
      "chain": [
        "11220",
        "20241",
        "11070",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-1804",
      "hadith_no": "1804",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا عبد بن حميد، أخبرنا أبو عاصم، أخبرنا ابن جريج، أخبرني أبو الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أفضل الصلاة طول القنوت ‏\"‏ ‏.‏",
      "text_en": " Jabir reported:                      The Messenger of Allah (may peace be upon him) was asked about the prayer which was most excellent. He said: That in which the standing is longer. (This hadith is narrated by another chain of transmitters too.)",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20241",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-1999",
      "hadith_no": "1999",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثناه إسحاق بن إبراهيم، أخبرنا محمد بن بكر، ح وحدثنا هارون بن عبد، الله حدثنا الضحاك بن مخلد، كلاهما عن ابن جريج، بهذا الإسناد ‏.‏",
      "text_en": " This hadith has been narrated by Ibn Juraij with the came chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20277",
        "30524",
        "20241"
      ]
    },
    {
      "id": "sahih-muslim-2105",
      "hadith_no": "2105",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Two Eids) - كتاب صلاة العيدين",
      "chapter_no": "9",
      "text_ar": "وحدثني إبراهيم بن دينار، وعقبة بن مكرم العمي، وعبد بن حميد، كلهم عن أبي، عاصم - واللفظ لعقبة - قال حدثنا أبو عاصم، عن ابن جريج، قال أخبرني عطاء، أخبرني عبيد بن عمير، أخبرتني عائشة، أنها قالت للعابين وددت أني أراهم قالت فقام رسول الله صلى الله عليه وسلم وقمت على الباب أنظر بين أذنيه وعاتقه وهم يلعبون في المسجد ‏.‏ قال عطاء فرس أو حبش ‏.‏ قال وقال لي ابن عتيق بل حبش ‏.‏",
      "text_en": " 'A'isha said that she sent a message to the players (of this armed fight) saying:                      I like to see them (fighting). She further said: The Messenger of Allah (may peace be upon him) stood up and I stood at the door (behind him) and saw (this fight) between his ears and his shoulders they played in the mosque. 'Ata' (one of the narra- tors) said: Were they persians or Abyssinians? Ibn 'Atiq told me they were Abyssinians.",
      "usc_msa_ref": "",
      "chain": [
        "30496",
        "30441",
        "30553",
        "20241",
        "11070",
        "11029",
        "11259",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-2635",
      "hadith_no": "2635",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا أبو عاصم، قال سمعت ابن عون، عن إبراهيم، عن الأسود، قال انطلقت أنا ومسروق، إلى عائشة - رضى الله عنها - فقلنا لها أكان رسول الله صلى الله عليه وسلم يباشر وهو صائم قالت نعم ولكنه كان أملككم لإربه أو من أملككم لإربه ‏.‏ شك أبو عاصم ‏.‏",
      "text_en": "  Aswad reported:                      I and Masruq went to 'A'isha (Allah be pleased with her) and asked. her if the Messenger of Allah (may peace be upon him) embraced (his wives) while fasting. She said: Yes; but he had the greatest control over his desire among you: or he was one of those who had control over his desire.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20241",
        "11071",
        "11051",
        "11054"
      ]
    },
    {
      "id": "sahih-muslim-2650",
      "hadith_no": "2650",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن عثمان النوفلي، حدثنا أبو عاصم، حدثنا ابن جريج، أخبرني محمد بن يوسف، عن سليمان بن يسار، أنه سأل أم سلمة - رضى الله عنها - عن الرجل يصبح جنبا أيصوم قالت كان رسول الله صلى الله عليه وسلم يصبح جنبا من غير احتلام ثم يصوم ‏.‏",
      "text_en": " Sulaiman b. Yasar reported that he asked Umm Salama whether a person (who gets up) in the morning in a state of junub should observe fast. She said:                      The Messenger of Allah (may peace be upon him) (at times) got up in the morning in a state of junub, not because of sexual dreams (but on account of intercourse at night), and then observed fast.",
      "usc_msa_ref": "",
      "chain": [
        "30185",
        "20241",
        "11070",
        "30388",
        "11005",
        "56"
      ]
    },
    {
      "id": "sahih-muslim-2703",
      "hadith_no": "2703",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا أحمد بن عثمان النوفلي، حدثنا أبو عاصم، حدثنا عمر بن محمد بن، زيد العسقلاني حدثنا سالم بن عبد الله، حدثني عبد الله بن عمر، - رضى الله عنهما - قال ذكر عند رسول الله صلى الله عليه وسلم يوم عاشوراء فقال ‏\"‏ ذاك يوم كان يصومه أهل الجاهلية فمن شاء صامه ومن شاء تركه ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Umar (Allah be pleased with them) reported that the day of 'Ashura was mentioned before the Messenger of Allah (may peace be upon him) and he said:                      It is a day when the people in the pre-Islamic days need to observe fast, so he who wishes to observe fast should do so, and he who wishes to abandon it should do so.",
      "usc_msa_ref": "",
      "chain": [
        "30185",
        "20241",
        "11530",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-3311",
      "hadith_no": "3311",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه محمد بن عمرو بن جبلة، حدثنا أبو عاصم، ح وحدثنا عبد بن حميد، أخبرنا عبد الرزاق، كلاهما عن ابن جريج، بهذا الإسناد ‏.‏ مثل حديث ابن بكر ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Juraij with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "38562",
        "20241",
        "30553"
      ]
    },
    {
      "id": "sahih-muslim-3592",
      "hadith_no": "3592",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثنا ابن نمير، حدثنا أبو عاصم، عن ابن جريج، عن أبي الزبير، بهذا الإسناد بمثله.",
      "text_en": " A hadith like this has been narrated on the authority of Abd Zubair with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20241",
        "11070"
      ]
    },
    {
      "id": "sahih-muslim-3722",
      "hadith_no": "3722",
      "source": "Sahih Muslim",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا أبو عاصم، حدثنا عبد الحميد بن جعفر، حدثنا عمران بن أبي أنس، عن عمر بن الحكم، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Abu Huraira (Allah be pleased with him).",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20241",
        "11875",
        "10605",
        "11897",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-3744",
      "hadith_no": "3744",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثني هارون بن عبد الله، حدثنا أبو عاصم، عن ابن جريج، عن أبي الزبير، عن ابن عمر، ‏.‏ نحو هذه القصة ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20241",
        "11070",
        "11263"
      ]
    },
    {
      "id": "sahih-muslim-3787",
      "hadith_no": "3787",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثني إسحاق بن منصور، أخبرنا أبو عاصم، حدثنا سفيان الثوري، حدثني أبو بكر بن أبي الجهم، قال دخلت أنا وأبو سلمة بن عبد الرحمن على فاطمة بنت قيس فسألناها فقالت كنت عند أبي عمرو بن حفص بن المغيرة فخرج في غزوة نجران ‏.‏ وساق الحديث بنحو حديث ابن مهدي وزاد قالت فتزوجته فشرفني الله بابن زيد وكرمني الله بابن زيد ‏.‏",
      "text_en": " Abu Bakr b. Abu'l-Jahm reported:                      I and Abu Salama b 'Abd al-Rahman came to fatima bint Qais (Al! ah be pleased with her) and asked her (about divorce, etc.). She said: I was the wife of Abu 'Amr b. Hafs b. al-Mughira, and he set out to join the battle of Najran. The rest of the hadith is the same, but he made this addition:\" She said: I married him and Allah hornoured me on account of Ibn Zaid and Allah favoured me because of him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20241",
        "20012",
        "13389"
      ]
    },
    {
      "id": "sahih-muslim-3952",
      "hadith_no": "3952",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا أحمد بن عثمان النوفلي، حدثنا أبو عاصم، ح وحدثني محمد بن حاتم، - واللفظ له - حدثنا روح، قالا حدثنا زكرياء بن إسحاق، حدثنا عمرو بن دينار، أنه سمع جابر بن عبد الله، يقول نهى رسول الله صلى الله عليه وسلم عن بيع الثمر حتى يبدو صلاحه ‏.‏",
      "text_en": " Jabir b. Abdullah (Allah be pleased with them) reported Allah's Messenger (may peace be upon him) forbidding the sale of fruit until its good condition is obvious.",
      "usc_msa_ref": "",
      "chain": [
        "30185",
        "20241",
        "38487",
        "20229",
        "11244",
        "11081",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-3990",
      "hadith_no": "3990",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنا عبد بن حميد، أخبرنا أبو عاصم، أخبرنا ابن جريج، عن عطاء، وأبي، الزبير أنهما سمعا جابر بن عبد الله، يقول نهى رسول الله صلى الله عليه وسلم فذكر بمثله ‏.‏",
      "text_en": " Jabir b. 'Abdullah (Allah be pleased with them) reported that Allah's Messenger (may peace be upon him) forbade the types of sales as described before.",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20241",
        "11070",
        "11029",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-4059",
      "hadith_no": "4059",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثنا حسن الحلواني، حدثنا أبو عاصم، عن ابن جريج، بهذا الإسناد مثله ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Juraij with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "130115",
        "20241"
      ]
    },
    {
      "id": "sahih-muslim-4091",
      "hadith_no": "4091",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثنا أحمد بن عثمان النوفلي، حدثنا أبو عاصم الضحاك بن مخلد، حدثنا ابن جريج، أخبرني زياد بن سعد، أن هلال بن أسامة، أخبره أن أبا سلمة بن عبد الرحمن أخبره أنه، سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يباع فضل الماء ليباع به الكلأ ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      The excess of water should not be sold in order to enable the sate of herbage.",
      "usc_msa_ref": "",
      "chain": [
        "30185",
        "20241",
        "11070",
        "11245",
        "11229",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-5131",
      "hadith_no": "5131",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، أخبرنا حماد بن مسعدة، وصفوان بن عيسى، ح وحدثنا أبو بكر بن النضر، حدثنا أبو عاصم النبيل، كلهم عن يزيد بن أبي عبيد، بهذا الإسناد ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Yazid b. Abu Ubaid.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20224",
        "20553",
        "14443",
        "20241"
      ]
    },
    {
      "id": "sahih-muslim-5222",
      "hadith_no": "5222",
      "source": "Sahih Muslim",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا أبو عاصم، عن يزيد بن أبي عبيد، عن سلمة، بن الأكوع أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من ضحى منكم فلا يصبحن في بيته بعد ثالثة شيئا ‏\"‏ ‏.‏ فلما كان في العام المقبل قالوا يا رسول الله نفعل كما فعلنا عام أول فقال ‏\"‏ لا إن ذاك عام كان الناس فيه بجهد فأردت أن يفشو فيهم ‏\"‏ ‏.‏",
      "text_en": " Salama b. al-Akwa' reported Allah's Messenger (way peace be upon him) having said:                      He who sacrifices (animal) among you nothing should be left in his house (out of its flesh) on the morning of the third day. When it was the next year they (his Companions) said: Should we do this year as we did daring the previous year? Thereupon he said: Don't do that, for that was a year when the people were hard pressed (on account of poverty). so I wanted that the (flesh) might be distributed amongst them.",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20241",
        "11450",
        "237"
      ]
    },
    {
      "id": "sahih-muslim-5360",
      "hadith_no": "5360",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا زهير بن حرب، ومحمد بن المثنى، وعبد بن حميد، كلهم عن أبي عاصم، قال ابن المثنى حدثنا الضحاك، أخبرنا ابن جريج، أخبرني أبو الزبير، أنه سمع جابر، بن عبد الله يقول أخبرني أبو حميد الساعدي، قال أتيت النبي صلى الله عليه وسلم بقدح لبن من النقيع ليس مخمرا فقال ‏\"‏ ألا خمرته ولو تعرض عليه عودا ‏\"‏ ‏.‏ قال أبو حميد إنما أمر بالأسقية أن توكأ ليلا وبالأبواب أن تغلق ليلا ‏.‏",
      "text_en": " Abu Humaid Sa'idi reported:                      I came to Allah's Messenger (may peace be upon him) with a cup of milk from Naqi' which had no cover over it, whereupon he said: Why did you not cover it? - even if you had covered it only with a stick. Abu Humaid said that he had been ordered that waterskins be tied during the night, and the doors be closed during the night.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30170",
        "30553",
        "20241",
        "11070",
        "11263",
        "34",
        "1457"
      ]
    },
    {
      "id": "sahih-muslim-5370",
      "hadith_no": "5370",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا أحمد بن عثمان النوفلي، حدثنا أبو عاصم، أخبرنا ابن جريج، بهذا الحديث عن عطاء، وعمرو بن دينار، كرواية روح ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Ibn Juraij.",
      "usc_msa_ref": "",
      "chain": [
        "30185",
        "20241",
        "11029"
      ]
    },
    {
      "id": "sahih-muslim-5509",
      "hadith_no": "5509",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثني زيد بن يزيد أبو معن الرقاشي، حدثنا أبو عاصم، عن عثمان، - يعني ابن مرة - حدثنا عبد الله بن عبد الرحمن، عن خالته أم سلمة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ من شرب في إناء من ذهب أو فضة فإنما يجرجر في بطنه نارا من جهنم ‏\"‏ ‏.‏",
      "text_en": " Abd al-Rahman reported on the authority of his mother's sister Umm Salama who said that Allah's Messenger (may peace be upon him) said:                      He who drank in vessels of gold or silver he in fact drank down in his belly the fire of Hell.",
      "usc_msa_ref": "",
      "chain": [
        "20241",
        "30025",
        "56"
      ]
    },
    {
      "id": "sahih-muslim-5606",
      "hadith_no": "5606",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا عقبة بن مكرم العمي، حدثنا أبو عاصم، عن ابن جريج، بهذا الإسناد مثله‏.‏",
      "text_en": " A hadith like this has been reported on the authority of Ibn Juraij with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30441",
        "20241"
      ]
    },
    {
      "id": "sahih-muslim-5758",
      "hadith_no": "5758",
      "source": "Sahih Muslim",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عاصم، ح وحدثنا حسين بن حريث، حدثنا  النضر، - يعني ابن شميل - قالا جميعا حدثنا ابن جريج، بهذا الإسناد نحوه ولم يذكر في حديث النضر ألهاني عنه الصفق بالأسواق ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Ibn Juraij, but there is no mention of the words\" business in the market\".",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20241",
        "30325",
        "20291"
      ]
    },
    {
      "id": "sahih-muslim-5772",
      "hadith_no": "5772",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثني عقبة بن مكرم، حدثنا أبو عاصم، عن ابن جريج، ح وحدثني محمد بن، مرزوق حدثنا روح، حدثنا ابن جريج، أخبرني زياد، أن ثابتا، مولى عبد الرحمن بن زيد أخبره أنه، سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ يسلم الراكب على الماشي والماشي على القاعد والقليل على الكثير ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The rider should first greet the pedestrian, and the pedestrian the one who is seated and a small group should greet a larger group (with as-Salam-u-'Alaikum).",
      "usc_msa_ref": "",
      "chain": [
        "30441",
        "20241",
        "11070",
        "34240",
        "20229",
        "11070",
        "11339",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-5855",
      "hadith_no": "5855",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثني عقبة بن مكرم العمي، حدثنا أبو عاصم، عن ابن جريج، قال وأخبرني  أبو الزبير، أنه سمع جابر بن عبد الله، يقول رخص النبي صلى الله عليه وسلم لآل حزم في رقية الحية وقال لأسماء بنت عميس ‏\"‏ ما لي أرى أجسام بني أخي ضارعة تصيبهم الحاجة ‏\"‏ ‏.‏ قالت لا ولكن العين تسرع إليهم ‏.‏ قال ‏\"‏ ارقيهم ‏\"‏ ‏.‏ قالت فعرضت عليه فقال ‏\"‏ ارقيهم ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported that Allah's Apostle (may peace be upon him) granted sanction to the family of Hazm for incantation (in mitigating the effect of the poison of) the snake, and, he said -to Asma' daughter of 'Umais:                      What is this that I see the children of my brother lean? Are they not fed properly? She said: No, but they fall under the influence of an evil eve. He said: Use incantation She recited (the words of incantation before him), whereupon he (by approving them) said: Yes, use this incantation for them.",
      "usc_msa_ref": "",
      "chain": [
        "30441",
        "20241",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-6897",
      "hadith_no": "6897",
      "source": "Sahih Muslim",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن عثمان النوفلي، أخبرنا أبو عاصم، حدثنا ابن جريج، أخبرني  أبو الزبير، أن أبا الطفيل، أخبره أنه، سمع عبد الله بن مسعود، يقول ‏.‏ وساق الحديث بمثل حديث عمرو بن الحارث ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Abdullah b. Mas'ud through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30185",
        "20241",
        "11070",
        "11263",
        "3660",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-7126",
      "hadith_no": "7126",
      "source": "Sahih Muslim",
      "chapter": "The Book of Heart-Melting Traditions - كتاب الرقاق",
      "chapter_no": "50",
      "text_ar": "وحدثنا إسحاق بن منصور، وعبد بن حميد، قالا أخبرنا أبو عاصم، عن ابن، جريج أخبرني موسى بن عقبة، ح وحدثني سويد بن سعيد، حدثنا علي بن مسهر، عن  عبيد الله، ح وحدثني أبو كريب، ومحمد بن طريف البجلي، قالا حدثنا ابن فضيل، حدثنا  أبي ورقبة بن مسقلة، ح وحدثني زهير بن حرب، وحسن الحلواني، وعبد بن حميد، قالوا حدثنا يعقوب، - يعنون ابن إبراهيم بن سعد - حدثنا أبي، عن صالح بن كيسان، كلهم عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمعنى حديث أبي ضمرة عن موسى بن عقبة وزادوا في حديثهم ‏\"‏ وخرجوا يمشون ‏\"‏ ‏.‏ وفي حديث صالح ‏\"‏ يتماشون ‏\"‏ ‏.‏ إلا عبيد الله فإن في حديثه ‏\"‏ وخرجوا ‏\"‏ ‏.‏ ولم يذكر بعدها شيئا ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Musa b. 'Uqba but with a slight variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "30553",
        "20241",
        "11070",
        "11106",
        "30547",
        "20345",
        "11201",
        "30216",
        "30476",
        "20356",
        "30022"
      ]
    },
    {
      "id": "sahih-muslim-7333",
      "hadith_no": "7333",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "وحدثني الحسن بن علي الحلواني، وحجاج بن الشاعر، كلاهما عن أبي عاصم، - قال حسن حدثنا أبو عاصم، - عن ابن جريج، أخبرني أبو الزبير، أنه سمع جابر بن، عبد الله يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ يأكل أهل الجنة فيها ويشربون ولا يتغوطون ولا يمتخطون ولا يبولون ولكن طعامهم ذاك جشاء كرشح المسك يلهمون التسبيح والحمد كما يلهمون النفس ‏\"‏ ‏.‏ قال وفي حديث حجاج ‏\"‏ طعامهم ذلك ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Abdullah reported that Allah's Messenger (may peace be upon him) said that the inmates of Paradise would eat therein and they would also drink, but they would neither void excrement, nor suffer catarrh, nor pass water, and their eating (would be digested) in the form of belching and their sweat would be musk aged they would glorify and praise Allah as easily ai you breathe.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "38834",
        "20241",
        "20241",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-7449",
      "hadith_no": "7449",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثني يعقوب بن إبراهيم الدورقي، وحجاج بن الشاعر، جميعا عن أبي عاصم، - قال حجاج حدثنا أبو عاصم، - أخبرنا عزرة بن ثابت، أخبرنا علباء بن أحمر، حدثني  أبو زيد، - يعني عمرو بن أخطب - قال صلى بنا رسول الله صلى الله عليه وسلم الفجر وصعد المنبر فخطبنا حتى حضرت الظهر فنزل فصلى ثم صعد المنبر فخطبنا حتى حضرت العصر ثم نزل فصلى ثم صعد المنبر فخطبنا حتى غربت الشمس فأخبرنا بما كان وبما هو كائن فأعلمنا أحفظنا ‏.‏",
      "text_en": " Abu Zaid (viz. Amr b. Akhtab) reported:                      Allah's Messenger (may peace be upon him) led us in the dawn prayer and then mounted the pulpit and addressed us until it was (time for the) noon prayer. He then came down the pulpit and observed prayer and then again mounted the pulpit and again addressed us until it was time for the 'Asr prayer. He then again came down and observed the prayer and again mointed the pulpit and addressed us until the sun was set and he informed (about) everything (pertaining to turmoil) that lay hidden in the past and what lies in (the womb) of) the future and the most learned amongst us is one who remembers them well",
      "usc_msa_ref": "",
      "chain": [
        "30400",
        "38834",
        "20241",
        "20219",
        "20241",
        "20561",
        "10705"
      ]
    },
    {
      "id": "sahih-muslim-7581",
      "hadith_no": "7581",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثناه محمد بن بشار، وعبد بن حميد، قالا حدثنا أبو عاصم، عن ابن جريج، بهذا الإسناد ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn Juraij with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "30553",
        "20241"
      ]
    },
    {
      "id": "sunan-abi-daud-144",
      "hadith_no": "144",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا أبو عاصم، حدثنا ابن جريج، بهذا الحديث قال فيه ‏\"‏ إذا توضأت فمضمض ‏\"‏ ‏.‏",
      "text_en": " The version of Ibn Juraij has the working:                      “If you perform ablution, then rinse your mouth.”",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20241",
        "11070"
      ]
    },
    {
      "id": "sunan-abi-daud-240",
      "hadith_no": "240",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا أبو عاصم، عن حنظلة، عن القاسم، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا اغتسل من الجنابة دعا بشىء نحو الحلاب فأخذ بكفه فبدأ بشق رأسه الأيمن ثم الأيسر ثم أخذ بكفيه فقال بهما على رأسه ‏.‏",
      "text_en": " 'Aishah reported :                      when the Messenger of Allah (May peace be upon him) wanted to wash himself because of sexual defilement, he called for a vessel like HILAB (a vessel used for milking the camel). He then took a handful of water and began to pour it on the right side of his head and then on the left side. He then took water in both his hands together and poured it on his head.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20241",
        "11243",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-501",
      "hadith_no": "501",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي، حدثنا أبو عاصم، وعبد الرزاق، عن ابن جريج، قال أخبرني عثمان بن السائب، أخبرني أبي وأم عبد الملك بن أبي محذورة، عن أبي محذورة، عن النبي صلى الله عليه وسلم نحو هذا الخبر وفيه ‏\"‏ الصلاة خير من النوم الصلاة خير من النوم في الأولى من الصبح ‏\"‏ ‏.‏ قال أبو داود وحديث مسدد أبين قال فيه قال وعلمني الإقامة مرتين مرتين ‏\"‏ الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة حى على الصلاة حى على الفلاح حى على الفلاح الله أكبر الله أكبر لا إله إلا الله ‏\"‏ ‏.‏ وقال عبد الرزاق ‏\"‏ وإذا أقمت الصلاة فقلها مرتين قد قامت الصلاة قد قامت الصلاة أسمعت ‏\"‏ ‏.‏ قال فكان أبو محذورة لا يجز ناصيته ولا يفرقها لأن النبي صلى الله عليه وسلم مسح عليها ‏.‏",
      "text_en": " Abu Mahdhurah also narrated this tradition from the prophet (May peace be upon him) to the same effect through a different chain of transmitters. This version has the additional wordings. The phrases “prayer is better than sleep, prayer is better than sleep” are to be pronounced in the first ADHAN (i.e., not in Iqamah) of the morning prayer.Abu Dawud said; The version narrated by Musaddad is more clear. It reads:                      He (the prophet) taught me IQAMAH (to pronounce each phrase) twice: Allah is most great. Allah is most great.  I testify that there is no god but Allah. I testify that there is no god but Allah; I testify that Muhammad is the Messenger of Allah, I testify that Muhammad is the Messenger of Allah: come to prayer, come to prayer: come to salvation, come to salvation: Allah is most great. Allah is great; there is no god but Allah.Abu Dawud said: The narrator ‘Abd al-Razzaq said; You pronounce IQAMAH for announcing the prayer; you must say twice: the time for prayer has come, the time for prayer has come. (The Prophet said to Abu Mahdhurah): did you listen (to me)? Abu Mahdhurah would not have the hair of his forehead cut, nor would he separate them (from him) because the Prophet (ﷺ) wiped over them.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20241",
        "20121",
        "11070",
        "2416"
      ]
    },
    {
      "id": "sunan-abi-daud-503",
      "hadith_no": "503",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عاصم، حدثنا ابن جريج، أخبرني ابن عبد الملك بن أبي محذورة، - يعني عبد العزيز - عن ابن محيريز، عن أبي محذورة، قال ألقى على رسول الله صلى الله عليه وسلم التأذين هو بنفسه فقال ‏\"‏ قل الله أكبر الله أكبر الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله - مرتين مرتين - قال ثم ارجع فمد من صوتك أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة حى على الصلاة حى على الفلاح حى على الفلاح الله أكبر الله أكبر لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " Abu Mahdurah reported :                      The Messenger of Allah (May peace be upon him) himself taught me the call to prayer (adhan). He asked me to pronounce: Allah is most great. Allah is most great. Allah is most great. Allah is most great: I testify that there is no god but Allah. I testify that there is no god but Allah; I testify that Muhammad is the Messenger of Allah, I testify that Muhammad is Messenger of Allah. Then repeat and raise your voice; I testify that there is no god but Allah, I testify that there is no god but Allah ; I testify that Muhammad is the Messenger of Allah; I testify that Muhammad is the Messenger of Allah; come to prayer, come to prayer; come to salvation, come to salvation; Allah is most great. Allah is most great; there is no god but Allah.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20241",
        "11070",
        "2416"
      ]
    },
    {
      "id": "sunan-abi-daud-545",
      "hadith_no": "545",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن إسحاق الجوهري، أخبرنا أبو عاصم، عن ابن جريج، عن موسى بن عقبة، عن سالم أبي النضر، قال كان رسول الله صلى الله عليه وسلم حين تقام الصلاة في المسجد إذا رآهم قليلا جلس لم يصل وإذا رآهم جماعة صلى ‏.‏",
      "text_en": " Abu al-Nadr said:                      when the Iqamah was pronounced and the Messenger of Allah (ﷺ) saw that they (the people) were small in number, he would sit down, nd would not pray; but when he saw them (the people) large in number, he would pray.",
      "usc_msa_ref": "",
      "chain": [
        "30580",
        "20241",
        "11070",
        "11106",
        "11164"
      ]
    },
    {
      "id": "sunan-abi-daud-546",
      "hadith_no": "546",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن إسحاق، أخبرنا أبو عاصم، عن ابن جريج، عن موسى بن عقبة، عن نافع بن جبير، عن أبي مسعود الزرقي، عن علي بن أبي طالب، - رضى الله عنه - مثل ذلك ‏.‏",
      "text_en": " This tradition has been transmitted through a different chain of narrators in a similar way by ‘Ali b. Abi Talib.",
      "usc_msa_ref": "",
      "chain": [
        "30580",
        "20241",
        "11070",
        "11106",
        "11059",
        "5"
      ]
    },
    {
      "id": "sunan-abi-daud-649",
      "hadith_no": "649",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي، حدثنا عبد الرزاق، وأبو عاصم قالا أخبرنا ابن جريج، قال سمعت محمد بن عباد بن جعفر، يقول أخبرني أبو سلمة بن سفيان، وعبد الله بن المسيب العابدي، وعبد الله بن عمرو، عن عبد الله بن السائب، قال صلى بنا رسول الله صلى الله عليه وسلم الصبح بمكة فاستفتح سورة المؤمنين حتى إذا جاء ذكر موسى وهارون - أو ذكر موسى وعيسى ابن عباد يشك أو اختلفوا - أخذت رسول الله صلى الله عليه وسلم سعلة فحذف فركع وعبد الله بن السائب حاضر لذلك ‏.‏",
      "text_en": " ‘Abd Allah b. al-Sa’ib said; the Messenger of Allah (ﷺ) led us in the morning prayer at Mecca. He began to recite Surah al-Mu;minin and while he came to description of Moses and Aaron or the description of Moses and Jesus the narrator Ibn ‘Abbad doubts or other narrators differed amongst themselves on this word the prophet (ﷺ) coughed and gave up (recitation) and then bowed ‘Abd Allah b. al-Sa’ib was present seeing all this incident.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20121",
        "20241",
        "11070",
        "11262",
        "29",
        "2065"
      ]
    },
    {
      "id": "sunan-abi-daud-672",
      "hadith_no": "672",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن بشار، حدثنا أبو عاصم، حدثنا جعفر بن يحيى بن ثوبان، قال أخبرني عمي، عمارة بن ثوبان عن عطاء، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خياركم ألينكم مناكب في الصلاة ‏\"‏ ‏.‏ قال أبو داود جعفر بن يحيى من أهل مكة ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: The best of you are those whose shoulders are soft in prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20241",
        "28085",
        "11029",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-730",
      "hadith_no": "730",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا أبو عاصم الضحاك بن مخلد، ح وحدثنا مسدد، حدثنا يحيى، - وهذا حديث أحمد قال - أخبرنا عبد الحميد، - يعني ابن جعفر - أخبرني محمد بن عمرو بن عطاء، قال سمعت أبا حميد الساعدي، في عشرة من أصحاب رسول الله صلى الله عليه وسلم منهم أبو قتادة قال أبو حميد أنا أعلمكم بصلاة رسول الله صلى الله عليه وسلم ‏.‏ قالوا فلم فوالله ما كنت بأكثرنا له تبعا ولا أقدمنا له صحبة ‏.‏ قال بلى ‏.‏ قالوا فاعرض ‏.‏ قال كان رسول الله صلى الله عليه وسلم إذا قام إلى الصلاة يرفع يديه حتى يحاذي بهما منكبيه ثم يكبر حتى يقر كل عظم في موضعه معتدلا ثم يقرأ ثم يكبر فيرفع يديه حتى يحاذي بهما منكبيه ثم يركع ويضع راحتيه على ركبتيه ثم يعتدل فلا يصب رأسه ولا يقنع ثم يرفع رأسه فيقول ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ثم يرفع يديه حتى يحاذي بهما منكبيه معتدلا ثم يقول ‏\"‏ الله أكبر ‏\"‏ ‏.‏ ثم يهوي إلى الأرض فيجافي يديه عن جنبيه ثم يرفع رأسه ويثني رجله اليسرى فيقعد عليها ويفتح أصابع رجليه إذا سجد ويسجد ثم يقول ‏\"‏ الله أكبر ‏\"‏ ‏.‏ ويرفع رأسه ويثني رجله اليسرى فيقعد عليها حتى يرجع كل عظم إلى موضعه ثم يصنع في الأخرى مثل ذلك ثم إذا قام من الركعتين كبر ورفع يديه حتى يحاذي بهما منكبيه كما كبر عند افتتاح الصلاة ثم يصنع ذلك في بقية صلاته حتى إذا كانت السجدة التي فيها التسليم أخر رجله اليسرى وقعد متوركا على شقه الأيسر ‏.‏ قالوا صدقت هكذا كان يصلي صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Humaid al-Sa’idi once told a company of ten of the companions of the Messenger of Allah (ﷺ) ; Abu Qatadah was one of them:                      I am one among you who is more informed of the way the Messenger of Allah (ﷺ) prayed. They said: Why, By Allah, you did not follow him more than us, nor did you remain in his company longer than us? He said: Yes. They said: Then describe (how the Prophet prayed). He said: When the Messenger of Allah (ﷺ) stood up to pray, he raised his hands so as to bring them opposite his shoulders, and uttered the takbir (Allah is the most great), until every bone rested in its place properly: then re recited (some verses from the Quran); then he uttered the takbir (Allah is most great), raising his hands so as to bring them opposite his shoulders; then he bowed; placing the palms of his hands on his knees and keeping himself straight, neither raising nor lowering his head; then raised his head saying: “Allah listens to him who praise Him”; then raised his hands so as to bring them exactly opposite to his shoulders; then uttered: “Allah is most great”; then lowered himself to the ground (in prostration), keeping his arms away from his sides; then raised his head, bent his left foot and sat on it, and opened the toes when he prostrated: then he uttered: “Allah is most great”; then raised his head, bent his left foot and sat on it so that every bone returned to its place properly; then he did the same in the second (rak’ah). At the end of the two Rak’ahs he stood up and uttered the takbir (Allah is most great), raising his hands so as to bring them opposite to his shoulders; then he bowed, placing the palms of his hands on his knees and keeping himself straight, neither raising or lowering his head: then raised his head saying: “Allah listens to him who praises Him”; then raised his hands so as to bring them exactly opposite his shoulders; then uttered: “Allah is most great”; then lowered himself to the ground (in prostration), keeping his arms away from his sides; then raised his head, bent his left foot and sat on it, and opened the toes when he prostrated himself; then he prostrated; then uttered: “Allah is most great”; then raised his head, bent his left foot and sat on it so that every bone returned to its place properly; then he did the same in the second (rak’ah). At the end of two rak’ahs he stood up and uttered the takbir (Allah is most great), raising his hands so as to bring them opposite to his shoulders in the way he had uttered the Takbir (Allah is most great) at the beginning of the prayer; then he did that in the remainder of his prayer; and after prostration which if followed by the taslim (salutation) he out his left foot and sat on his left hip. They said: You have spoken the truth. This is how he(peace be upon him) used to pray.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20241",
        "30175",
        "20031",
        "11875",
        "11220"
      ]
    },
    {
      "id": "sunan-abi-daud-963",
      "hadith_no": "963",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا أبو عاصم الضحاك بن مخلد، أخبرنا عبد الحميد يعني ابن جعفر، ح وحدثنا مسدد، حدثنا يحيى، حدثنا عبد الحميد، - يعني ابن جعفر - حدثني محمد بن عمرو، عن أبي حميد الساعدي، قال سمعته في، عشرة من أصحاب رسول الله صلى الله عليه وسلم - وقال أحمد قال أخبرني محمد بن عمرو بن عطاء قال سمعت أبا حميد الساعدي في عشرة من أصحاب رسول الله صلى الله عليه وسلم منهم أبو قتادة - قال أبو حميد أنا أعلمكم بصلاة رسول الله صلى الله عليه وسلم ‏.‏ قالوا فاعرض ‏.‏ فذكر الحديث ‏.‏ قال ويفتح أصابع رجليه إذا سجد ثم يقول الله أكبر ويرفع ويثني رجله اليسرى فيقعد عليها ثم يصنع في الأخرى مثل ذلك فذكر الحديث ‏.‏ قال حتى إذا كانت السجدة التي فيها التسليم أخر رجله اليسرى وقعد متوركا على شقه الأيسر ‏.‏ زاد أحمد قالوا صدقت هكذا كان يصلي ولم يذكرا في حديثهما الجلوس في الثنتين كيف جلس",
      "text_en": " Abu Humaid al-sa’idi said (in the presence of ten compansions of the prophet):                      I am more informed than any of you regarding the manner in which the Messenger of Allah (ﷺ) offered his prayer. They said: Present it. The narrator then reported the tradition, saying: he bent the toes of his feet turning them towards the Qiblah when he prostrated, then he uttered “ Allah is most great,” and raised (his head), and bent his left foot and sat on it, and he did the same in the second Rakah. The narrator then transmitted the tradition, and added: In the prostration (i.e., the Rakah) which ended at the salutation, he sat on the hips at the left side. ahmad (b. Hanbal) added: they said : You are right. This is how he used to pray. They (Ahmed and Musaddad) did not mention in their versions how he sat after offering two rak’ahs of prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20241",
        "11875",
        "30175",
        "20031",
        "11875",
        "11220",
        "1457"
      ]
    },
    {
      "id": "sunan-abi-daud-1072",
      "hadith_no": "1072",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن خلف، حدثنا أبو عاصم، عن ابن جريج، قال قال عطاء اجتمع يوم جمعة ويوم فطر على عهد ابن الزبير فقال عيدان اجتمعا في يوم واحد فجمعهما جميعا فصلاهما ركعتين بكرة لم يزد عليهما حتى صلى العصر ‏.‏",
      "text_en": " ‘Ata’ said:                      The Friday and the ‘id prayers synchronized during the time of Ibn al-Zubair. He said: Two festivals (‘id and Friday) synchronized on the same day. He combined them and offered two rak’ahs in the morning and did not add anything to them until he offered the afternoon prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30460",
        "20241",
        "11070"
      ]
    },
    {
      "id": "sunan-abi-daud-1081",
      "hadith_no": "1081",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي، حدثنا أبو عاصم، عن ابن أبي رواد، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم لما بدن قال له تميم الداري ألا أتخذ لك منبرا يا رسول الله يجمع - أو يحمل - عظامك قال ‏\"‏ بلى ‏\"‏ ‏.‏ فاتخذ له منبرا مرقاتين ‏.‏",
      "text_en": " Ibn 'Umar said:                      When the Prophet (ﷺ) became fat, Tamim al-Dari said to him: Should I make for you pulpit, Messenger of Allah, that will bear the burden of your body ? He said: Yes. So he made a pulpit consisting of two steps.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20241",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-1082",
      "hadith_no": "1082",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مخلد بن خالد، حدثنا أبو عاصم، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع، قال كان بين منبر رسول الله صلى الله عليه وسلم وبين الحائط كقدر ممر الشاة ‏.‏",
      "text_en": " Salamah b. al-Akwa' said:                      The space between the pulpit of the Messenger of Allah (ﷺ) and the wall (of the mosque) was such that a goat could pass.",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "20241",
        "11450",
        "237"
      ]
    },
    {
      "id": "sunan-abi-daud-1097",
      "hadith_no": "1097",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عاصم، حدثنا عمران، عن قتادة، عن عبد ربه، عن أبي عياض، عن ابن مسعود، أن رسول الله صلى الله عليه وسلم كان إذا تشهد قال ‏\"‏ الحمد لله نستعينه ونستغفره ونعوذ بالله من شرور أنفسنا من يهده الله فلا مضل له ومن يضلل فلا هادي له وأشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله أرسله بالحق بشيرا ونذيرا بين يدى الساعة من يطع الله ورسوله فقد رشد ومن يعصهما فإنه لا يضر إلا نفسه ولا يضر الله شيئا ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     When the Messenger of Allah (ﷺ) addressed, he would say: Praise be to Allah, from Whom we seek help and pardon,and we seek refuge in Allah from the evils of our souls. He whom Allah guide has no one who can lead him astray, and he whom He leads astray has no one to guide him. And I bear witness that there is no god but Allah, and I bear witness that Muhammad is His servant and apostle. He sent him before the coming of the last hour with truth giving good tidings and warning. He who obeys Allah and His Apostle follows the right path; and he who disobeys them shall harm none except himself, and he will not harm Allah in the least.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20241",
        "123",
        "11019",
        "11714",
        "16"
      ]
    },
    {
      "id": "sunan-abi-daud-1266",
      "hadith_no": "1266",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا حماد بن سلمة، ح وحدثنا أحمد بن حنبل، حدثنا محمد بن جعفر، حدثنا شعبة، عن ورقاء، ح وحدثنا الحسن بن علي، حدثنا أبو عاصم، عن ابن جريج، ح وحدثنا الحسن بن علي، حدثنا يزيد بن هارون، عن حماد بن زيد، عن أيوب، ح وحدثنا محمد بن المتوكل، حدثنا عبد الرزاق، أخبرنا زكريا بن إسحاق، كلهم عن عمرو بن دينار، عن عطاء بن يسار، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أقيمت الصلاة فلا صلاة إلا المكتوبة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Messenger of Allah (ﷺ)as saying: When the iqamah is pronounced for prayer, no prayer is valid except the obligatory prayer.",
      "usc_msa_ref": "",
      "chain": [
        "20285",
        "20021",
        "30007",
        "20173",
        "20020",
        "30",
        "20241",
        "11070",
        "30",
        "20472",
        "20022",
        "11015"
      ]
    },
    {
      "id": "sunan-abi-daud-1355",
      "hadith_no": "1355",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عاصم، حدثنا زهير بن محمد، عن شريك بن عبد الله بن أبي نمر، عن كريب، عن الفضل بن عباس، قال ‏:‏ بت ليلة عند النبي صلى الله عليه وسلم لأنظر كيف يصلي فقام فتوضأ ثم صلى ركعتين قيامه مثل ركوعه، وركوعه مثل سجوده، ثم نام، ثم استيقظ فتوضأ واستن ثم قرأ بخمس آيات من آل عمران ‏{‏ إن في خلق السموات والأرض واختلاف الليل والنهار ‏}‏ فلم يزل يفعل هذا حتى صلى عشر ركعات، ثم قام فصلى سجدة واحدة فأوتر بها، ونادى المنادي عند ذلك، فقام رسول الله صلى الله عليه وسلم بعد ما سكت المؤذن فصلى سجدتين خفيفتين، ثم جلس حتى صلى الصبح ‏.‏ قال أبو داود ‏:‏ خفي على من ابن بشار بعضه ‏.‏",
      "text_en": " Narrated Fadl b. 'Abbas:                     I spent a night with the Prophet (ﷺ) to see how he prayed. He got up, performed ablution and prayed two rak'ahs. His standing was like his bowing (i.e. equal in duration), and his bowing was like his prostration (equal in length). Then he slept. Afterwards he awoke, performed ablution, and used tooth-stick. He then recited five verses from Surah Al-'Imran : \"In the creation of the heavens and the earth and the alternation of night and day\". He went on doing so till he prayed ten rak'ahs. He then stood up and prayed one rak'ah observing witr with it. In the meantime the mu'adhdhin called to prayer. The Messenger of Allah (ﷺ) stood up after the mu'adhdhin had kept silent. He prayed two light rak'ahs and remained sitting till he offered the dawn prayer.Abu Dawud said: A part of the tradition transmitted by Ibn Bashshar remained hidden from me.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20241",
        "20394",
        "11858",
        "11211",
        "135"
      ]
    },
    {
      "id": "sunan-abi-daud-1661",
      "hadith_no": "1661",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا يحيى بن خلف، حدثنا أبو عاصم، عن ابن جريج، قال قال أبو الزبير سمعت عبيد بن عمير، قال قال رجل يا رسول الله ما حق الإبل فذكر نحوه زاد ‏\"‏ وإعارة دلوها ‏\"‏ ‏.‏",
      "text_en": " The aforesaid tradition has also been transmitted by ‘Ubaid bin ‘ Umair through a different chain of narrators. This version goes:                      A man asked: Messenger of Allah (ﷺ), what is due on camels? He replied in a similar way.  This version adds \"and to lend its udders.”",
      "usc_msa_ref": "",
      "chain": [
        "30460",
        "20241",
        "11070",
        "11263",
        "11259"
      ]
    },
    {
      "id": "sunan-abi-daud-1879",
      "hadith_no": "1879",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا هارون بن عبد الله، ومحمد بن رافع، - المعنى - قالا حدثنا أبو عاصم، عن معروف، - يعني ابن خربوذ المكي - حدثنا أبو الطفيل، قال رأيت النبي صلى الله عليه وسلم يطوف بالبيت على راحلته يستلم الركن بمحجنه ثم يقبله زاد محمد بن رافع ثم خرج إلى الصفا والمروة فطاف سبعا على راحلته ‏.‏",
      "text_en": " Abu Al Tufail reported on the authority of Ibn ‘Abbas who said I saw the Prophet (ﷺ) circumambulating the Ka’bah on his Camel, touching the corner (Black Stone) with a crooked stick and kissing it (the crooked stick). The narrator Muhammad bin Rafi’ added “he then went o Al Safa and Al Marwah and ran seven times on his Camel.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "30375",
        "20241",
        "11564",
        "3660"
      ]
    },
    {
      "id": "sunan-abi-daud-1953",
      "hadith_no": "1953",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عاصم، حدثنا ربيعة بن عبد الرحمن بن حصن، حدثتني جدتي، سراء بنت نبهان - وكانت ربة بيت في الجاهلية - قالت خطبنا رسول الله صلى الله عليه وسلم يوم الرءوس فقال ‏\"‏ أى يوم هذا ‏\"‏ ‏.‏ قلنا الله ورسوله أعلم قال ‏\"‏ أليس أوسط أيام التشريق ‏\"‏ ‏.‏ قال أبو داود وكذلك قال عم أبي حرة الرقاشي إنه خطب أوسط أيام التشريق ‏.‏",
      "text_en": " Narrated Sarra' daughter of Nabhan:                     She was mistress of a temple in pre-Islamic days. She said: The prophet (ﷺ) addressed us on the second day of sacrifice (yawm ar-ru'us) and said: Which is this day? We said: Allah and His Apostle  are better aware. He said: Is this not the middle of the tashriq days?",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20241"
      ]
    },
    {
      "id": "sunan-abi-daud-2020",
      "hadith_no": "2020",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا الحسن بن علي، حدثنا أبو عاصم، عن جعفر بن يحيى بن ثوبان، أخبرني عمارة بن ثوبان، حدثني موسى بن باذان، قال أتيت يعلى بن أمية فقال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ احتكار الطعام في الحرم إلحاد فيه ‏\"‏ ‏.‏",
      "text_en": " Narrated Ya'la ibn Umayyah:                     The Prophet (ﷺ) said: Hoarding up food (to sell it at a high price) in the sacred territory is a deviation (from right to wrong).",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20241",
        "28085",
        "13539",
        "13557"
      ]
    },
    {
      "id": "sunan-abi-daud-2119",
      "hadith_no": "2119",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عاصم، حدثنا عمران، عن قتادة، عن عبد ربه، عن أبي عياض، عن ابن مسعود، أن رسول الله صلى الله عليه وسلم كان إذا تشهد ذكر نحوه وقال بعد قوله ‏\"‏ ورسوله ‏\"‏ ‏.‏ ‏\"‏ أرسله بالحق بشيرا ونذيرا بين يدى الساعة من يطع الله ورسوله فقد رشد ومن يعصهما فإنه لا يضر إلا نفسه ولا يضر الله شيئا ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     When the Messenger of Allah (ﷺ) recited the tashahhud....He then narrated the same tradition. In this version after the word \"and His Apostle\" he added the words: \"He has sent him in truth as a bearer of glad tidings and a warner before the Hour. He who obeys Allah and His Prophet is on the right path, and he who disobeys them does not harm anyone except  himself, and he does not harm Allah to the least.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20241",
        "123",
        "11019",
        "11714",
        "16"
      ]
    },
    {
      "id": "sunan-abi-daud-2189",
      "hadith_no": "2189",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن مسعود، حدثنا أبو عاصم، عن ابن جريج، عن مظاهر، عن القاسم بن محمد، عن عائشة، عن النبي صلى الله عليه وسلم قال ‏\"‏ طلاق الأمة تطليقتان وقرؤها حيضتان ‏\"‏ ‏.‏ قال أبو عاصم حدثني مظاهر حدثني القاسم عن عائشة عن النبي صلى الله عليه وسلم مثله إلا أنه قال ‏\"‏ وعدتها حيضتان ‏\"‏ ‏.‏ قال أبو داود وهو حديث مجهول ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Prophet (ﷺ) said: The divorce of a slave-woman consists in saying it twice and her waiting period is two menstrual courses (qur') AbuAsim said: A similar tradition has been narrated to me by Muzahir and al-Qasim on the authority of Aisha from the Prophet (ﷺ), except that he said: And her waiting period ('iddah) is two courses.Abu Dawud said: This tradition is obscure.",
      "usc_msa_ref": "",
      "chain": [
        "20241",
        "11070",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-2277",
      "hadith_no": "2277",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا الحسن بن علي الحلواني، حدثنا عبد الرزاق، وأبو عاصم عن ابن جريج، أخبرني زياد، عن هلال بن أسامة، أن أبا ميمونة، سلمى - مولى من أهل المدينة رجل صدق - قال بينما أنا جالس مع أبي هريرة جاءته امرأة فارسية معها ابن لها فادعياه وقد طلقها زوجها فقالت يا أبا هريرة - ورطنت له بالفارسية - زوجي يريد أن يذهب بابني فقال أبو هريرة استهما عليه ورطن لها بذلك فجاء زوجها فقال من يحاقني في ولدي فقال أبو هريرة اللهم إني لا أقول هذا إلا أني سمعت امرأة جاءت إلى رسول الله صلى الله عليه وسلم وأنا قاعد عنده فقالت يا رسول الله إن زوجي يريد أن يذهب بابني وقد سقاني من بئر أبي عنبة وقد نفعني ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ استهما عليه ‏\"‏ ‏.‏ فقال زوجها من يحاقني في ولدي فقال النبي صلى الله عليه وسلم ‏\"‏ هذا أبوك وهذه أمك فخذ بيد أيهما شئت ‏\"‏ ‏.‏ فأخذ بيد أمه فانطلقت به ‏.‏",
      "text_en": " Hilal ibn Usamah quoted Abu Maimunah Salma, client of the people of Medina, as saying:                      While I was sitting with AbuHurayrah, a Persian woman came to him along with a son of hers. She had been divorced by her husband and they both claimed him.  She said: AbuHurayrah, speaking to him in Persian, my husband wishes to take my son away.  AbuHurayrah said: Cast lots for him, saying it to her in a foreign language.  Then her husband came and asked: Who is disputing with me about my son?  AbuHurayrah said: O Allah, I do not say this, except that I heard a woman who came to the Messenger of Allah (ﷺ) while I was sitting with him, and she said: My husband wishes to take away my son, Messenger of Allah, and he draws water for me from the well of AbuInabah, and he has been good to me.  The Messenger of Allah (ﷺ) said: Cast lots for him.  Her husband said: Who is disputing with me about my son?  The Prophet (ﷺ) said: This is your father and this your mother, so take whichever of them you wish by the hand. So he took his mother's hand and she went away with him.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20121",
        "20241",
        "11070",
        "11339",
        "11229"
      ]
    },
    {
      "id": "sunan-abi-daud-2542",
      "hadith_no": "2542",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو توبة، عن الهيثم بن حميد، ح وحدثنا خشيش بن أصرم، حدثنا أبو عاصم، جميعا عن ثور بن يزيد، عن نصر الكناني، عن رجلوقال أبو توبة ‏:‏ عن ثور بن يزيد، عن شيخ، من بني سليم عن عتبة بن عبد السلمي، - وهذا لفظه - أنه سمع رسول الله صلى الله عليه وسلم يقول ‏:‏ ‏\"‏ لا تقصوا نواصي الخيل ولا معارفها ولا أذنابها، فإن أذنابها مذابها، ومعارفها دفاؤها، ونواصيها معقود فيها الخير ‏\"‏ ‏.‏",
      "text_en": " Narrated Utbah ibn AbdusSulami:                     Utbah heard the Messenger of Allah (ﷺ) say: Do not cut the forelocks, manes, or tails of horse, for their tails are their means of driving flies, their manes provide them with warmth, and blessing is tide to their forelocks.",
      "usc_msa_ref": "",
      "chain": [
        "30335",
        "20744",
        "38204",
        "20241",
        "20415",
        "20415",
        "5166"
      ]
    },
    {
      "id": "sunan-abi-daud-2774",
      "hadith_no": "2774",
      "source": "Sunan Abi Da'ud",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا مخلد بن خالد، حدثنا أبو عاصم، عن أبي بكرة، بكار بن عبد العزيز أخبرني أبي عبد العزيز، عن أبي بكرة، عن النبي صلى الله عليه وسلم أنه كان إذا جاءه أمر سرور أو بشر به خر ساجدا شاكرا لله ‏.‏",
      "text_en": " Narrated AbuBakrah:                     When anything came to the Prophet (ﷺ) which caused pleasure (or, by which he was made glad), he prostrated himself in gratitude to Allah.",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "20241",
        "3229"
      ]
    },
    {
      "id": "sunan-abi-daud-2846",
      "hadith_no": "2846",
      "source": "Sunan Abi Da'ud",
      "chapter": "Game (Kitab Al-Said) - كتاب الصيد",
      "chapter_no": "17",
      "text_ar": "حدثنا يحيى بن خلف، حدثنا أبو عاصم، عن ابن جريج، قال أخبرني أبو الزبير، عن جابر، قال أمر نبي الله صلى الله عليه وسلم بقتل الكلاب حتى إن كانت المرأة تقدم من البادية - يعني بالكلب - فنقتله ثم نهانا عن قتلها وقال ‏\"‏ عليكم بالأسود ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Prophet of Allah (ﷺ) ordered to kill dogs, and we were even killing a dog which a woman brought with her from the desert. Afterwards he forbade to kill them, saying: Confine yourselves to the type which is black.",
      "usc_msa_ref": "",
      "chain": [
        "30460",
        "20241",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-2943",
      "hadith_no": "2943",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا زيد بن أخزم أبو طالب، حدثنا أبو عاصم، عن عبد الوارث بن سعيد، عن حسين المعلم، عن عبد الله بن بريدة، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ من استعملناه على عمل فرزقناه رزقا فما أخذ بعد ذلك فهو غلول ‏\"‏ ‏.‏",
      "text_en": " Narrated Buraidah:                     The Prophet (ﷺ) as saying: When we appoint someone to an administrative post and provide him with an allowance, anything he takes beyond that is unfaithful dealing.",
      "usc_msa_ref": "",
      "chain": [
        "30136",
        "20241",
        "20258",
        "11278",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-abi-daud-2992",
      "hadith_no": "2992",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عاصم، وأزهر، قالا حدثنا ابن عون، قال سألت محمدا عن سهم النبي، صلى الله عليه وسلم والصفي قال كان يضرب له بسهم مع المسلمين وإن لم يشهد والصفي يؤخذ له رأس من الخمس قبل كل شىء ‏.‏",
      "text_en": " Ibn ‘Awn said “I asked Muhammad about the portion of the prophet(ﷺ) and safi. He replied “A portion was taken for him along with the Muslims, even if he did not attend (the battle) and safi (special portion) was taken from the fifth before everything.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20241",
        "20206",
        "11071",
        "11035"
      ]
    },
    {
      "id": "sunan-abi-daud-3030",
      "hadith_no": "3030",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا الحسن بن علي، حدثنا أبو عاصم، وعبد الرزاق، قالا أخبرنا ابن جريج، أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول أخبرني عمر بن الخطاب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ لأخرجن اليهود والنصارى من جزيرة العرب فلا أترك فيها إلا مسلما ‏\"‏ ‏.‏",
      "text_en": " Jabir bin ‘Abd Allah said that he was told by ‘Umar bin Al Khattab that he heard the Apostle of Allaah(ﷺ) say “I will certainly expel the Jews and the Christians from Arabia and I shall leave only Muslims in it.”",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20241",
        "20121",
        "11070",
        "11263",
        "34",
        "3"
      ]
    },
    {
      "id": "sunan-abi-daud-3306",
      "hadith_no": "3306",
      "source": "Sunan Abi Da'ud",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا مخلد بن خالد، قال حدثنا أبو عاصم، ح وحدثنا عباس العنبري، - المعنى - قال حدثنا روح، عن ابن جريج، قال أخبرني يوسف بن الحكم بن أبي سفيان، أنه سمع حفص بن عمر بن عبد الرحمن بن عوف، وعمرا، وقال، عباس ‏:‏ ابن حنة أخبراه عن عمر بن عبد الرحمن بن عوف، عن رجال، من أصحاب النبي صلى الله عليه وسلم بهذا الخبر ‏.‏ زاد فقال النبي صلى الله عليه وسلم ‏\"‏ والذي بعث محمدا بالحق لو صليت ها هنا لأجزأ عنك صلاة في بيت المقدس ‏\"‏ ‏.‏ قال أبو داود ‏:‏ رواه الأنصاري عن ابن جريج فقال جعفر بن عمرو، وقال عمرو بن حية وقال أخبراه عن عبد الرحمن بن عوف وعن رجال من أصحاب النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " The tradition mentioned above (No.3299) has also been transmitted by Umar ibn Abd al-Rahman ibn Awf on the authority of his father and the Companions of the Prophet (ﷺ). This version has:                      \"The Prophet (ﷺ) said: By Him Who sent Muhammad with truth, if you prayed here, this would be sufficient for you like the prayer in Jerusalem.\"Abu Dawud said: This tradition has also been transmitted by al-Ansari, from Ibn-Juraij. He said: Ja'far b. 'Umar and 'Amr b. Hayyah. He said: They transmitted from 'Abd al-Rahman b. 'Awf and from the Companions of the Prophet (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "30567",
        "20241",
        "20229",
        "11070",
        "12062",
        "3",
        "10560"
      ]
    },
    {
      "id": "sunan-abi-daud-3470",
      "hadith_no": "3470",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا سليمان بن داود المهري، وأحمد بن سعيد الهمداني، قالا أخبرنا ابن وهب، قال أخبرني ابن جريج، ح وحدثنا محمد بن معمر، حدثنا أبو عاصم، عن ابن جريج، - المعنى - أن أبا الزبير المكي، أخبره عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن بعت من أخيك تمرا فأصابتها جائحة فلا يحل لك أن تأخذ منه شيئا بم تأخذ مال أخيك بغير حق ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir bin ‘Abdullah :                     The Messenger of Allah (ﷺ) as saying: If you were to sell dried dates to your brother and they were smitten by blight, it will not be allowable for you to take your brother's property unjustly.",
      "usc_msa_ref": "",
      "chain": [
        "30584",
        "30296",
        "20029",
        "11070",
        "30172",
        "20241",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-3487",
      "hadith_no": "3487",
      "source": "Sunan Abi Da'ud",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عاصم، عن عبد الحميد بن جعفر، عن يزيد بن أبي حبيب، قال كتب إلى عطاء عن جابر، نحوه لم يقل ‏\"‏ هو حرام ‏\"‏ ‏.‏",
      "text_en": " Yazid b. Abi Habib said:                      Jabir wrote to me a similar tradition. But he did not say in this version \"It is forbidden.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20241",
        "11875",
        "11411",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-3765",
      "hadith_no": "3765",
      "source": "Sunan Abi Da'ud",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا يحيى بن خلف، حدثنا أبو عاصم، عن ابن جريج، قال أخبرني أبو الزبير، عن جابر بن عبد الله، سمع النبي صلى الله عليه وسلم يقول ‏\"‏ إذا دخل الرجل بيته فذكر الله عند دخوله وعند طعامه قال الشيطان لا مبيت لكم ولا عشاء وإذا دخل فلم يذكر الله عند دخوله قال الشيطان أدركتم المبيت فإذا لم يذكر الله عند طعامه قال أدركتم المبيت والعشاء ‏\"‏ ‏.‏",
      "text_en": " Jabir bin ‘Abd Allah said that he heard the Prophet(ﷺ) say:                      When a man enters his house and mention Allah’s name on entering and on his food, the devil says: You have no place to spend the night and no evening meal; but when he enters without mentioning Allah’s name on entering, the devil says: You have found a place to spend the night, and when he does not mention Allah’s name at his food, he says: You have found a place to spend the night and an evening meal.",
      "usc_msa_ref": "",
      "chain": [
        "30460",
        "20241",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-3918",
      "hadith_no": "3918",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur) - كتاب الكهانة و التطير",
      "chapter_no": "30",
      "text_ar": "حدثنا يحيى بن خلف، حدثنا أبو عاصم، حدثنا ابن جريج، عن عطاء، قال يقول الناس الصفر وجع يأخذ في البطن ‏.‏ قلت فما الهامة قال يقول الناس الهامة التي تصرخ هامة الناس وليست بهامة الإنسان إنما هي دابة ‏.‏",
      "text_en": " Narrated 'Ata:                     People said: safar is a pain within the belly. I asked: What is hamah ? He said: People said (believed) that hamah which is an owl or a nightbird and which shrieks is the spirit of men. It is not the spirit of men. It is an animal.",
      "usc_msa_ref": "",
      "chain": [
        "30460",
        "20241",
        "11070",
        "11029"
      ]
    },
    {
      "id": "sunan-abi-daud-4220",
      "hadith_no": "4220",
      "source": "Sunan Abi Da'ud",
      "chapter": "Signet-Rings (Kitab Al-Khatam) - كتاب الخاتم",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا أبو عاصم، عن المغيرة بن زياد، عن نافع، عن ابن عمر، بهذا الخبر عن النبي صلى الله عليه وسلم قال فالتمسوه فلم يجدوه فاتخذ عثمان خاتما ونقش فيه ‏\"‏ محمد رسول الله ‏\"‏ ‏.‏ قال فكان يختم به أو يتختم به ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Ibn 'Umar through different chain of narrators from the Prophet (ﷺ). This version adds:                      They searched for it but could not find it. 'Uthman then fashioned a signet-ring and engraved on it \"Muhammad, the Messenger of Allah\". He used to wear it or stamp with it.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20241",
        "19947",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-4233",
      "hadith_no": "4233",
      "source": "Sunan Abi Da'ud",
      "chapter": "Signet-Rings (Kitab Al-Khatam) - كتاب الخاتم",
      "chapter_no": "36",
      "text_ar": "حدثنا الحسن بن علي، حدثنا يزيد بن هارون، وأبو عاصم قالا حدثنا أبو الأشهب، عن عبد الرحمن بن طرفة، عن عرفجة بن أسعد، بمعناه ‏.‏ قال يزيد قلت لأبي الأشهب أدرك عبد الرحمن بن طرفة جده عرفجة قال نعم ‏.‏",
      "text_en": " The tradition mentioned above (No. 4220) has also been transmitted by Arfajah ibn As'ad through a different chain to the same effect. Yazid said:                      I asked AbulAshhab: Did AbdurRahman ibn Tarafah meet his grandfather Arfajah? He replied: Yes.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20472",
        "20241",
        "11273",
        "18630",
        "20472"
      ]
    },
    {
      "id": "sunan-abi-daud-4429",
      "hadith_no": "4429",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا الحسن بن علي، حدثنا أبو عاصم، حدثنا ابن جريج، قال أخبرنا أبو الزبير، عن ابن عم أبي هريرة، عن أبي هريرة، بنحوه زاد واختلفوا فقال بعضهم ربط إلى شجرة وقال بعضهم وقف ‏.‏",
      "text_en": " A similar tradition has also been transmitted by Abu Hurrairah through a different chain of narrators. This version adds:                      The narrator Hasan b. “All said: The transmitters have differed in the wordings (of this tradition) reported to me. Some said: He (Ma’iz) was tied to a tree, and others said: He was made to stand.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20241",
        "11070",
        "11263"
      ]
    },
    {
      "id": "sunan-abi-daud-4439",
      "hadith_no": "4439",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن عبد الرحيم أبو يحيى البزاز، أخبرنا أبو عاصم، عن ابن جريج، عن أبي الزبير، عن جابر، أن رجلا، زنى بامرأة فلم يعلم بإحصانه فجلد ثم علم بإحصانه فرجم ‏.‏",
      "text_en": " Jabir said:                      A man committed fornication with a woman. It was not known that he was married. So he was flogged. It was then known that he was married, so he was stoned to death.",
      "usc_msa_ref": "",
      "chain": [
        "20241",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-4476",
      "hadith_no": "4476",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا الحسن بن علي، ومحمد بن المثنى، - وهذا حديثه - قالا حدثنا أبو عاصم، عن ابن جريج، عن محمد بن علي بن ركانة، عن عكرمة، عن ابن عباس، أن رسول الله صلى الله عليه وسلم لم يقت في الخمر حدا ‏.‏ وقال ابن عباس شرب رجل فسكر فلقي يميل في الفج فانطلق به إلى النبي صلى الله عليه وسلم فلما حاذى بدار العباس انفلت فدخل على العباس فالتزمه فذكر ذلك للنبي صلى الله عليه وسلم فضحك وقال ‏\"‏ أفعلها ‏\"‏ ‏.‏ ولم يأمر فيه بشىء ‏.‏ قال أبو داود هذا مما تفرد به أهل المدينة حديث الحسن بن علي هذا ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) did not prescribe any punishment for drinking wine. Ibn Abbas said: A man who had drunk wine and become intoxicated was found staggering on the road, so he was taken to the Prophet (ﷺ). When he was opposite al-Abbas's house, he escaped, and going in to al-Abbas, he grasped hold of him. When that was mentioned to the Prophet (ﷺ), he laughed and said: Did he do that? and he gave no command regarding him.Abu Dawud said: This tradition of al-Hasan b. 'Ali has been transmitted only by the people of Medina.",
      "usc_msa_ref": "",
      "chain": [
        "30",
        "30170",
        "20241",
        "11070",
        "11442",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-4572",
      "hadith_no": "4572",
      "source": "Sunan Abi Da'ud",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن مسعود المصيصي، حدثنا أبو عاصم، عن ابن جريج، قال أخبرني عمرو بن دينار، أنه سمع طاوسا، عن ابن عباس، عن عمر، أنه سأل عن قضية النبي، صلى الله عليه وسلم في ذلك فقام إليه حمل بن مالك بن النابغة فقال كنت بين امرأتين فضربت إحداهما الأخرى بمسطح فقتلتها وجنينها فقضى رسول الله صلى الله عليه وسلم في جنينها بغرة وأن تقتل ‏.‏ قال أبو داود قال النضر بن شميل المسطح هو الصوبج ‏.‏ قال أبو داود وقال أبو عبيد المسطح عود من أعواد الخباء ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     'Umar asked about the decision of the Prophet (ﷺ) about that (i.e. abortion). Haml b. Malik b. al-Nabhigah got up and said: I was between two women. One of them struck another with a rolling-pin killing both her and what was in her womb. So the Messenger of Allah (ﷺ) gave judgement that the bloodwit for the unborn child should be a male or a female slave of the best quality and the she should be killed.Abu Dawud said: Al-Nadr b. Shumail said: Mistah means a rolling-pin.Abu Dawud said: Abu 'Ubaid said: Mistah means a pole from the tent-poles.",
      "usc_msa_ref": "",
      "chain": [
        "20241",
        "11070",
        "11081",
        "11053",
        "17",
        "3"
      ]
    },
    {
      "id": "sunan-abi-daud-5059",
      "hadith_no": "5059",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا حامد بن يحيى، حدثنا أبو عاصم، عن ابن عجلان، عن المقبري، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من اضطجع مضجعا لم يذكر الله تعالى فيه إلا كان عليه ترة يوم القيامة ومن قعد مقعدا لم يذكر الله عز وجل فيه إلا كان عليه ترة يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: If anyone lies on his side where he does not remember Allah, deprivation will descend on him on the Day of Resurrection; and if anyone sits in a place where he does not remember Allah, deprivation will descend on him on the Day of Resurrection.",
      "usc_msa_ref": "",
      "chain": [
        "20241",
        "10616",
        "11168",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-5144",
      "hadith_no": "5144",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن المثنى، حدثنا أبو عاصم، قال حدثني جعفر بن يحيى بن عمارة بن ثوبان، أخبرنا عمارة بن ثوبان، أن أبا الطفيل، أخبره قال رأيت النبي صلى الله عليه وسلم يقسم لحما بالجعرانة - قال أبو الطفيل وأنا يومئذ غلام أحمل عظم الجزور - إذ أقبلت امرأة حتى دنت إلى النبي صلى الله عليه وسلم فبسط لها رداءه فجلست عليه فقلت من هي فقالوا هذه أمه التي أرضعته ‏.‏",
      "text_en": " Narrated AbutTufayl:                     I saw the Prophet (ﷺ) distributing flesh at Ji'irranah, and I was a boy in those days bearing the bone of the camel, and when a woman who came forward approach the Prophet (ﷺ), he spread out his cloak for her, and she sat on it. I asked: Who is she? The people said: She is his foster-mother.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20241",
        "13539",
        "3660"
      ]
    },
    {
      "id": "sunan-abi-daud-5176",
      "hadith_no": "5176",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن بشار، حدثنا أبو عاصم، حدثنا ابن جريج، ح حدثنا يحيى بن حبيب، حدثنا روح، عن ابن جريج، قال أخبرني عمرو بن أبي سفيان، أن عمرو بن عبد الله بن صفوان، أخبره عن كلدة بن حنبل، أن صفوان بن أمية، بعثه إلى رسول الله صلى الله عليه وسلم بلبن وجداية وضغابيس - والنبي صلى الله عليه وسلم بأعلى مكة - فدخلت ولم أسلم فقال ‏\"‏ ارجع فقل السلام عليكم ‏\"‏ ‏.‏ وذاك بعد ما أسلم صفوان بن أمية ‏.‏ قال عمرو وأخبرني ابن صفوان بهذا أجمع عن كلدة بن حنبل ولم يقل سمعته منه ‏.‏ قال أبو داود قال يحيى بن حبيب أمية بن صفوان ولم يقل سمعته من كلدة بن حنبل وقال يحيى أيضا عمرو بن عبد الله بن صفوان أخبره أن كلدة بن الحنبل أخبره ‏.‏",
      "text_en": " Narrated Kaladah ibn Hanbal:                     Safwan ibn Umayyah sent him with some milk, a young gazelle and some small cucumbers to the Messenger of Allah (ﷺ) when he was in the upper part of Mecca. I entered but I did not give a salutation. He said: Go back and say: \"Peace be upon you\"! This happened after Safwan ibn Umayyah and embraced Islam. Amr said: Ibn Safwan told me all this on the authority of Kaladah ibn Hanbal, and he did not say: I heard it from him.Abu Dawud said: Yahya b. Habib said: Umayyah b. Safwan. He did not say: I heard from Kaladah b. Hanbal. Yahya also said: 'Amr b. 'Abd Allah b. Safwan told him that Kaladah b. al-Hanbal told him.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20241",
        "11070",
        "30459",
        "20229",
        "11070",
        "18797",
        "19833",
        "2415"
      ]
    },
    {
      "id": "sunan-abi-daud-5197",
      "hadith_no": "5197",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن يحيى بن فارس الذهلي، حدثنا أبو عاصم، عن أبي خالد، وهب عن أبي سفيان الحمصي، عن أبي أمامة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أولى الناس بالله من بدأهم بالسلام ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuUmamah:                     The Prophet (ﷺ) said: Those who are nearest to Allah are they who are first to give a salutation.",
      "usc_msa_ref": "",
      "chain": [
        "30023",
        "20241",
        "28625",
        "11720",
        "405"
      ]
    },
    {
      "id": "jami-al-tirmidhi-305",
      "hadith_no": "305",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن بشار، والحسن بن علي الخلال الحلواني، وسلمة بن شبيب، وغير، واحد، قالوا حدثنا أبو عاصم النبيل، حدثنا عبد الحميد بن جعفر، حدثنا محمد بن عمرو بن عطاء، قال سمعت أبا حميد الساعدي، في عشرة من أصحاب النبي صلى الله عليه وسلم منهم أبو قتادة بن ربعي فذكر نحو حديث يحيى بن سعيد بمعناه وزاد فيه أبو عاصم عن عبد الحميد بن جعفر هذا الحرف قالوا صدقت هكذا صلى النبي صلى الله عليه وسلم ‏.‏ قال أبو عيسى زاد أبو عاصم الضحاك بن مخلد في هذا الحديث عن عبد الحميد بن جعفر هذا الحرف قالوا صدقت هكذا صلى النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " (Another chain) that Muhammad bin Amir bin Ata narrated from Abu Humaid As-Saidi,:                     he (Muhammad) said: \"I heard him saying - while he was among ten of the Companions of the Prophet, one of whom was Abu Qatadah bin Ribi.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "30",
        "30417",
        "20241",
        "11875",
        "11220"
      ]
    },
    {
      "id": "jami-al-tirmidhi-701",
      "hadith_no": "701",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا أبو عاصم، وأبو المغيرة، عن الأوزاعي، بهذا الإسناد نحوه ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Abu Hurairah narrated:                     (A Hadith similar to no. 700 with a different chain).",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "20241",
        "20442",
        "20024"
      ]
    },
    {
      "id": "jami-al-tirmidhi-747",
      "hadith_no": "747",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا أبو عاصم، عن محمد بن رفاعة، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ تعرض الأعمال يوم الاثنين والخميس فأحب أن يعرض عملي وأنا صائم ‏\"‏ ‏.‏ قال أبو عيسى حديث أبي هريرة في هذا الباب حديث حسن غريب ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     the Messenger of Allah said: \"Deeds are presented on Monday and Thursday, and I love that my deeds be presented while I am fasting.\"",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20241",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1054",
      "hadith_no": "1054",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن بشار، ومحمود بن غيلان، والحسن بن علي الخلال، قالوا حدثنا أبو عاصم النبيل، حدثنا سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ قد كنت نهيتكم عن زيارة القبور فقد أذن لمحمد في زيارة قبر أمه فزوروها فإنها تذكر الآخرة ‏\"‏ ‏.‏ قال وفي الباب عن أبي سعيد وابن مسعود وأنس وأبي هريرة وأم سلمة ‏.‏ قال أبو عيسى حديث بريدة حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم لا يرون بزيارة القبور بأسا ‏.‏ وهو قول ابن المبارك والشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Sulaiman bin Buraidah narrated from his father that:                     The Messenger of Allah said: \"I had prohibited you from visiting the graves. But Muhammad was permitted to visit the grave of his mother: so visit them, for they will remind you of the Hereafter.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "30277",
        "30115",
        "20241",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1218",
      "hadith_no": "1218",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن يحيى النيسابوري، حدثنا أبو عاصم، عن ابن جريج، قال حدثني مظاهر بن أسلم، قال حدثني القاسم، عن عائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ طلاق الأمة تطليقتان وعدتها حيضتان ‏\"‏ ‏.‏",
      "text_en": " Muzahir bin Aslam narrated that Al-Qasim narrated from Aishah that:                     The Messenger of Allah said: \"The divorce for a slave woman is two divorces, and her Iddah is two menstruations.\"",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20241",
        "11070",
        "12508",
        "10535",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1219",
      "hadith_no": "1219",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "قال محمد بن يحيى وحدثنا أبو عاصم، أنبأنا مظاهر، بهذا ‏.‏ قال وفي الباب عن عبد الله بن عمر، ‏.‏ قال أبو عيسى حديث عائشة حديث غريب لا نعرفه مرفوعا إلا من حديث مظاهر بن أسلم ومظاهر لا نعرف له في العلم غير هذا الحديث ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم وهو قول سفيان الثوري والشافعي وأحمد وإسحاق ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20241",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1295",
      "hadith_no": "1295",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا عبد الله بن منير، قال سمعت أبا عاصم، عن شبيب بن بشر، عن أنس بن مالك، قال لعن رسول الله صلى الله عليه وسلم في الخمر عشرة عاصرها ومعتصرها وشاربها وحاملها والمحمولة إليه وساقيها وبائعها وآكل ثمنها والمشتري لها والمشتراة له ‏.‏ قال أبو عيسى هذا حديث غريب من حديث أنس ‏.‏ وقد روي نحو هذا عن ابن عباس وابن مسعود وابن عمر عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"The Messenger of Allah (ﷺ) cursed ten involved in wine: The one who presses it, the one who has it pressed, its drinker, its carrier, and the one it is carried to, its server, its seller, the consumption of its price, the one who purchases it and the one it was purchased for.\"[Abu 'Eisa said:] This Hadith is Gharib as a narration of Anas. Similar to this has been reported from Ibn 'Abbas, Ibn Mas'ud, and Ibn 'Umar, from the Prophet (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "30353",
        "20241",
        "15223",
        "19"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1474",
      "hadith_no": "1474",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا محمد بن يحيى، وغير، واحد، قالوا حدثنا أبو عاصم، عن وهب أبي خالد، قال حدثتني أم حبيبة بنت العرباض، وهو ابن سارية عن أبيها، أن رسول الله صلى الله عليه وسلم نهى يوم خيبر عن لحوم كل ذي ناب من السبع وعن كل ذي مخلب من الطير وعن لحوم الحمر الأهلية وعن المجثمة وعن الخليسة وأن توطأ الحبالى حتى يضعن ما في بطونهن ‏.‏ قال محمد بن يحيى سئل أبو عاصم عن المجثمة قال أن ينصب الطير أو الشىء فيرمى ‏.‏ وسئل عن الخليسة فقال الذئب أو السبع يدركه الرجل فيأخذه منه فيموت في يده قبل أن يذكيها ‏.‏",
      "text_en": " Narrated Umm Habibah bint Al-'Irbad:                     From her father: \"On the day of Khaibar, the Messenger of Allah (ﷺ) prohibited eating the meat of every predator that has canine teeth, the meat of every bird that has talons, the meat of the domestic donkey, the Mujath-thamah, the Khalisah, and from having relations with a pregnant slave until she gives birth to what is in her womb.\"Muhammad bin Yahya said: \"Abu 'Asim was asked about Mujath-thamah and he said: \"To ensnare a bird or something and then shoot it.\" He was asked about Khalisah, so he said: \"(Prey) that a man finds with a wolf or a predator, then he takes it from him but it dies in his hand before it can be slaughtered.\"",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20241",
        "28556"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1510",
      "hadith_no": "1510",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا محمد بن بشار، ومحمود بن غيلان، والحسن بن علي الخلال، وغير، واحد، قالوا أخبرنا أبو عاصم النبيل، حدثنا سفيان الثوري، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كنت نهيتكم عن لحوم الأضاحي فوق ثلاث ليتسع ذو الطول على من لا طول له فكلوا ما بدا لكم وأطعموا وادخروا ‏\"‏ ‏.‏ قال وفي الباب عن ابن مسعود وعائشة ونبيشة وأبي سعيد وقتادة بن النعمان وأنس وأم سلمة ‏.‏ قال أبو عيسى حديث بريدة حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم ‏.‏",
      "text_en": " Narrated Sulaiman bin Buraidah:                     From his father that the Messenger of Allah (ﷺ) said: \"I used to prohibit you from (eating) the meat of Sacrifice beyond three days so that those who have the ability would give to those who do not have it. So (now) eat  as you like, feed others, and save from it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "30277",
        "30115",
        "20241",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1564",
      "hadith_no": "1564",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن يحيى النيسابوري، حدثنا أبو عاصم النبيل، عن وهب أبي خالد، قال حدثتني أم حبيبة بنت عرباض بن سارية، أن أباها، أخبرها أن رسول الله صلى الله عليه وسلم نهى أن توطأ السبايا حتى يضعن ما في بطونهن ‏.‏ قال أبو عيسى وفي الباب عن رويفع بن ثابت ‏.‏ وحديث عرباض حديث غريب ‏.‏ والعمل على هذا عند أهل العلم وقال الأوزاعي إذا اشترى الرجل الجارية من السبى وهي حامل فقد روي عن عمر بن الخطاب أنه قال لا توطأ حامل حتى تضع ‏.‏ قال الأوزاعي وأما الحرائر فقد مضت السنة فيهن بأن أمرن بالعدة ‏.‏ قال حدثني بذلك علي بن خشرم قال حدثنا عيسى بن يونس عن الأوزاعي ‏.‏",
      "text_en": " Narrated Umm Habibah bint 'Irbad bin Sariyah:                     From her father who told her that the Messenger of Allah (ﷺ) prohibited intercourse with female prisoners, until they deliver what is in their wombs.\"[Abu 'Eisa said:] There is something on this topic from Ruwaifi' bin Thabit, and the Hadith of 'Irbad is a Gharib Hadith. This is acted upon according to the people of knowledge.Al-Awza'i said: \"When a man purchases a slave girl from the captives and she is pregnant, then it has been related from 'Umar bin Al-Khattab that he said: 'Do not have intercourse with the pregnant women until she gives birth.'\" Al-Awza'i said: \"As for the free women, then the Sunnah about them has passed, in that the 'Iddah is observed.\" All of this was narrated to me by 'Ali bin Khushram who said: \" 'Eisa bin Yunus narrated to us from Al-Awza'i.\"",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20241"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1578",
      "hadith_no": "1578",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا أبو عاصم، حدثنا بكار بن عبد العزيز بن أبي بكرة، عن أبيه، عن أبي بكرة، أن النبي صلى الله عليه وسلم أتاه أمر فسر به فخر لله ساجدا ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه من حديث بكار بن عبد العزيز ‏.‏ والعمل على هذا عند أكثر أهل العلم رأوا سجدة الشكر ‏.‏ وبكار بن عبد العزيز بن أبي بكرة مقارب الحديث ‏.‏",
      "text_en": " Narrated Abu Bakrah:                     \"The Prophet (ﷺ) was met by some affair that made him happy, so he prostrated to Allah.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except from this route, as a narration of Bakkar bin 'Abdul-'Aziz.This is acted upon according to most of the people of knowledge, they held the view that one could perform the prostration of gratitude. And Bakkar bin 'Adbul-'Aziz bin Abi Bakrah is Muqarib (average) in Hadith.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20241",
        "24041",
        "3229"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1607",
      "hadith_no": "1607",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا أبو عاصم، وعبد الرزاق، قالا أخبرنا ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول أخبرني عمر بن الخطاب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ لأخرجن اليهود والنصارى من جزيرة العرب فلا أترك فيها إلا مسلما ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Jabir bin ‘Abdullah :                     \"Umar bin Al-Khattab informed me that he heard the Messenger of Allah (ﷺ) say: 'I will expel the Jews and the Christians from the Arabian Peninsula, and I will not leave anyone in it except a Muslim.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20241",
        "20121",
        "11070",
        "11263",
        "34",
        "3"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1869",
      "hadith_no": "1869",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Drinks - كتاب الأشربة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "26",
      "text_ar": "حدثنا محمد بن بشار، والحسن بن علي، ومحمود بن غيلان، قالوا حدثنا أبو عاصم، حدثنا سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إني كنت نهيتكم عن الظروف وإن ظرفا لا يحل شيئا ولا يحرمه وكل مسكر حرام ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Sulaiman bin Buraidah:                     From his father, that the Messenger of Allah (ﷺ) said: \"I had indeed forbidden you from using containers, but the container does not make anything lawful nor unlawful, rather every intoxicant is unlawful.\" [Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "30",
        "30277",
        "20241",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2250",
      "hadith_no": "2250",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Inheritance - كتاب الفرائض عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "29",
      "text_ar": "أخبرنا إسحاق بن منصور، أخبرنا أبو عاصم، عن ابن جريج، عن عمرو بن مسلم، عن طاوس، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ الخال وارث من لا وارث له ‏\"‏ ‏.‏ وهذا حديث حسن غريب وقد أرسله بعضهم ولم يذكر فيه عن عائشة ‏.‏ - واختلف فيه أصحاب النبي صلى الله عليه وسلم فورث بعضهم الخال والخالة والعمة وإلى هذا الحديث ذهب أكثر أهل العلم في توريث ذوي الأرحام وأما زيد بن ثابت فلم يورثهم وجعل الميراث في بيت المال ‏.‏",
      "text_en": " Aishah narrated that the Messenger of Allah(S.A.W) said:                     \"The maternal uncle inherits from the one who has no heirs.\"",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20241",
        "11070",
        "10953",
        "11053",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2305",
      "hadith_no": "2305",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Qadar - كتاب القدر عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "32",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عاصم، حدثنا حيوة بن شريح، أخبرني أبو صخر، قال حدثني نافع، أن ابن عمر، جاءه رجل فقال إن فلانا يقرأ عليك السلام ‏.‏ فقال له إنه بلغني أنه قد أحدث فإن كان قد أحدث فلا تقرئه مني السلام فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ يكون في هذه الأمة أو في أمتي الشك منه خسف أو مسخ أو قذف في أهل القدر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ وأبو صخر اسمه حميد بن زياد ‏.‏",
      "text_en": " Nafi' narrated that a man came to Ibn 'Umar and said:                     \"So-and-so conveys his Salam to you.\" So he said: \"It has been conveyed to me that he has innovated, so if he has indeed innovated, then do not convey my Salam to him, for I heard the Messenger of Allah (s.a.w) saying: 'In this Ummah' or: 'In my Ummah'\" - the doubt was his - \"a collapse of the earth, or a transformation, or stones shall rain upon the people of Al-Qadr.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20241",
        "26010",
        "11014"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2458",
      "hadith_no": "2458",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Dreams - كتاب الرؤيا عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عاصم، أخبرنا ابن جريج، أخبرني موسى بن عقبة، أخبرني سالم بن عبد الله، عن عبد الله بن عمر، عن رؤيا النبي، صلى الله عليه وسلم وأبي بكر وعمر قال ‏\"‏ رأيت الناس اجتمعوا فنزع أبو بكر ذنوبا أو ذنوبين فيه ضعف والله يغفر له ثم قام عمر فنزع فاستحالت غربا فلم أر عبقريا يفري فريه حتى ضرب الناس بعطن ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة ‏.‏ وهذا حديث صحيح غريب من حديث ابن عمر ‏.‏",
      "text_en": " Salim bin 'Abdullah narrated from 'Abdullah bin 'Umar about the dream of the Prophet (s.a.w) and Abu Bakr and 'Umar, so he said:                     \"I saw that the people had gathered, so Abu Bakr drew a bucket or two buckets- in  him was some weakness- and Allah forgive him. Then 'Umar stood to draw and the bucket turned into a very large one, and I have never seen a strong man toiling so hard until it was as if the people had gathered at a (camel) watering hole.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20241",
        "11070",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2459",
      "hadith_no": "2459",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Dreams - كتاب الرؤيا عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عاصم، حدثنا ابن جريج، أخبرني موسى بن عقبة، أخبرني سالم بن عبد الله، عن عبد الله بن عمر، عن رؤيا النبي، صلى الله عليه وسلم قال ‏\"‏ رأيت امرأة سوداء ثائرة الرأس خرجت من المدينة حتى قامت بمهيعة وهي الجحفة وأولتها وباء المدينة ينقل إلى الجحفة ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Salim bin 'Abdullah narrated from his father about the dream of the Prophet (s.a.w) who said:                     \"I saw a black woman with unkempt hair going out of Al-Madinah, until she stood in Mabaya'ah, and it is Al-Juhfah. So I interpreted that to be an epidemic in Al-Madinah that would spread to Al-Juhfah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20241",
        "11070",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3068",
      "hadith_no": "3068",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا عقبة بن مكرم العمي البصري، حدثنا أبو عاصم، عن عبد الله بن عمر العمري، عن نافع، عن ابن عمر، قال قال النبي صلى الله عليه وسلم ‏\"‏ إن أحب الأسماء إلى الله عبد الله وعبد الرحمن ‏\"‏ ‏.‏ هذا حديث غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     that the Prophet (ﷺ) said: \"The most loved names to Allah are 'Abdullah and 'Abdur-Rahman.\"",
      "usc_msa_ref": "",
      "chain": [
        "30441",
        "20241",
        "20507",
        "11014",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3331",
      "hadith_no": "3331",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عمرو بن علي أبو حفص الفلاس، حدثنا أبو عاصم، حدثنا عثمان بن سعد، حدثنا عكرمة، عن ابن عباس، أن رجلا، أتى النبي صلى الله عليه وسلم فقال يا رسول الله إني إذا أصبت اللحم انتشرت للنساء وأخذتني شهوتي فحرمت على اللحم ‏.‏ فأنزل الله ‏:‏ ‏(‏ يا أيها الذين آمنوا لا تحرموا طيبات ما أحل الله لكم ولا تعتدوا إن الله لا يحب المعتدين وكلوا مما رزقكم الله حلالا طيبا ‏)‏ قال هذا حديث حسن غريب ‏.‏ ورواه بعضهم عن عثمان بن سعد مرسلا ليس فيه عن ابن عباس ورواه خالد الحذاء عن عكرمة مرسلا ‏.‏",
      "text_en": " Narrated 'Ikrimah:                     from Ibn 'Abbas: \"A man came to the Prophet (ﷺ) and said: 'O Messenger of Allah! When I consume meat and I get around women, my desires get the best of me. So I made meat unlawful for myself.' So Allah revealed: O you who believe! Make not unlawful the good things which Allah has made lawful to you, and transgress not. Verily Allah does not like the transgressors. And eat of the things which Allah has provided for you, lawful and good (5:87-88).\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20241",
        "11023",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3595",
      "hadith_no": "3595",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن عثمان أبو عثمان البصري، حدثنا أبو عاصم، عن زكريا بن إسحاق، عن عمرو بن دينار، عن عطاء، عن ابن عباس ‏:‏ ‏(‏الذين يجتنبون كبائر الإثم والفواحش إلا اللمم ‏)‏ قال قال النبي صلى الله عليه وسلم ‏\"‏ إن تغفر اللهم تغفر جما وأى عبد لك لا ألما ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب لا نعرفه إلا من حديث زكريا بن إسحاق ‏.‏",
      "text_en": " Narrated 'Ata:                     from Ibn 'Abbas (regarding this Ayah): Those who avoid great sins and Al-Fawahish except Al-Lamam (minor sins) (53:32). He said: \"The Prophet (ﷺ) said: 'Your forgiveness, O Allah is so ample, and which of Your worshipers has not committed Al-Lamam (minor sins)!'\"",
      "usc_msa_ref": "",
      "chain": [
        "30185",
        "20241",
        "11244",
        "11081",
        "11029"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3448-2",
      "hadith_no": "3448",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عاصم، حدثنا الحجاج الصواف، عن يحيى بن أبي كثير، عن أبي جعفر، عن أبي هريرة، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاث دعوات مستجابات دعوة المظلوم ودعوة المسافر ودعوة الوالد على ولده ‏\"‏ ‏.‏  حدثنا علي بن حجر، حدثنا إسماعيل بن إبراهيم، عن هشام الدستوائي، عن يحيى بن أبي كثير، بهذا الإسناد نحوه ‏.‏ وزاد فيه مستجابات لا شك فيهن ‏.‏ قال أبو عيسى هذا حديث حسن وأبو جعفر الرازي هذا الذي روى عنه يحيى بن أبي كثير يقال له أبو جعفر المؤذن وقد روى عنه يحيى بن أبي كثير غير حديث ولا نعرف اسمه ‏.‏",
      "text_en": " Abu Hurairah [may Allah be pleased with him] narrated :                     that the Messenger of Allah said: “Three supplications are responded to: The supplication of the oppressed, the supplication of the traveler, and the supplication of the parent against his child.” Ali bin Hujr narrated to us (he said): Ismail bin Ibrahim reported to us from Hisham Ad-Dastawa’i, from Yahya bin Abu Kathir with this chain, narrating similar to it, but he added to it: “responded to, there is no doubt in them.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20241",
        "11449",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3503-2",
      "hadith_no": "3503",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عاصم، حدثنا عثمان الشحام، حدثني مسلم بن أبي بكرة، قال سمعني أبي، وأنا أقول اللهم، إني أعوذ بك من الهم والكسل وعذاب القبر ‏.‏ قال يا بنى ممن سمعت هذا قال قلت سمعتك تقولهن ‏.‏ قال الزمهن فإني سمعت رسول الله صلى الله عليه وسلم يقولهن ‏.‏ قال هذا حديث حسن [صحيح][غريب] ‏.‏",
      "text_en": " Muslim bin Abi Bakrah said:                     “My father heard me while I was saying: “O Allah, I seek refuge in You from sadness and laziness and the punishment of the grave (Allahumma, Inni A’udhu Bika Minal-Hammi Wal-Kasali Wa Adhabil-Qabr).’ He said: ‘O my son, from who did you hear this?’” He said: “I said: ‘I heard you saying them.’ He said: ‘Stick to them, for indeed, I heard the Messenger of Allah saying them.’”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20241",
        "10703"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3540-2",
      "hadith_no": "3540",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا عبد الله بن إسحاق الجوهري البصري، حدثنا أبو عاصم، حدثنا كثير بن فائد، حدثنا سعيد بن عبيد، قال سمعت بكر بن عبد الله المزني، يقول حدثنا أنس بن مالك، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ قال الله يا ابن آدم إنك ما دعوتني ورجوتني غفرت لك على ما كان فيك ولا أبالي يا ابن آدم لو بلغت ذنوبك عنان السماء ثم استغفرتني غفرت لك ولا أبالي يا ابن آدم إنك لو أتيتني بقراب الأرض خطايا ثم لقيتني لا تشرك بي شيئا لأتيتك بقرابها مغفرة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Anas bin Malik narrated that the Messenger of Allah said:                     “Allah, Blessed is He and Most High, said: ‘O son of Adam! Verily as long as you called upon Me and hoped in Me, I forgave you, despite whatever may have occurred from you, and I did not mind. O son of Adam! Were your sins to reach the clouds of the sky, then you sought forgiveness from Me, I would forgive you, and I would not mind. So son of Adam! If you came to me with sins nearly as great as the earth, and then you met Me not associating anything with Me, I would come to you with forgiveness nearly as great as it.’”",
      "usc_msa_ref": "",
      "chain": [
        "20241",
        "11629",
        "11267",
        "19"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3971",
      "hadith_no": "3971",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا بندار، حدثنا أبو عاصم، حدثنا سفيان الثوري، عن ليث، وهو ابن أبي سليم حدثني كعب، حدثني أبو هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ سلوا الله لي الوسيلة ‏\"‏ ‏.‏ قالوا يا رسول الله وما الوسيلة قال ‏\"‏ أعلى درجة في الجنة لا ينالها إلا رجل واحد أرجو أن أكون أنا هو ‏\"‏ ‏.‏ قال هذا حديث غريب إسناده ليس بالقوي ‏.‏ وكعب ليس هو بمعروف ولا نعلم أحدا روى عنه غير ليث بن أبي سليم ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"Ask Allah to grant me Al-Wasilah.\" They said: \"O Messenger of Allah! And what is Al-Wasilah?\" He said: \"The highest level of Paradise. No one will attain it except for one man, and I hope that I am him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20241",
        "20012",
        "20023",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3989",
      "hadith_no": "3989",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، بندار حدثنا أبو عاصم، حدثنا عزرة بن ثابت، حدثنا علباء بن أحمر، حدثنا أبو زيد بن أخطب، قال مسح رسول الله صلى الله عليه وسلم يده على وجهي ودعا لي قال عزرة إنه عاش مائة وعشرين سنة وليس في رأسه إلا شعرات بيض ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وأبو زيد اسمه عمرو بن أخطب ‏.‏",
      "text_en": " Narrated Abu Zaid bin Akhtab:                     \"The Messenger of Allah (ﷺ) wiped his hand over my face and supplicated for me.\" 'Azrah (one of the narrators) said: \"Indeed he lived for one-hundred and twenty years, and there weren't upon his head except for a few small grey hairs.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20241",
        "20561",
        "10705"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4102",
      "hadith_no": "4102",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، ويعقوب بن إبراهيم، وغير، واحد، قالوا أخبرنا أبو عاصم، عن أبي الجراح، حدثني جابر بن صبح، قال حدثتني أم شراحيل، قالت حدثتني أم عطية، قالت بعث النبي صلى الله عليه وسلم جيشا فيهم علي ‏.‏ قالت فسمعت النبي صلى الله عليه وسلم وهو رافع يديه يقول ‏\"‏ اللهم لا تمتني حتى تريني عليا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب إنما نعرفه من هذا الوجه ‏.‏",
      "text_en": " Narrated Umm 'Atiyyah:                     \"The Prophet (ﷺ) sent an army in which was 'Ali.\" She said: \"While he was raising his hands, I heard the Messenger of Allah (ﷺ) saying: 'O Allah! Do not cause me to die until You allow me to see 'Ali.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20184",
        "20241",
        "24050",
        "19549",
        "71"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4197",
      "hadith_no": "4197",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا عبد الله بن إسحاق الجوهري، حدثنا أبو عاصم، عن عبد الله بن المؤمل، عن ابن أبي مليكة، عن عائشة، أن النبي صلى الله عليه وسلم رأى في بيت الزبير مصباحا فقال ‏\"‏ يا عائشة ما أرى أسماء إلا قد نفست فلا تسموه حتى أسميه ‏\"‏ ‏.‏ فسماه عبد الله وحنكه بتمرة بيده ‏.‏ قال هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated Ibn Abi Mulaikah:                     from 'Aishah, that the Prophet (ﷺ) saw a lamp in the house of Az-Zubair, so he said: \"O 'Aishah, I do not think except that Asma has given birth, so do not name him until I should name him.\" So he named him 'Abdullah, and he (performed Tahnik) with a date that was in his hand.",
      "usc_msa_ref": "",
      "chain": [
        "30580",
        "20241",
        "23030",
        "11090",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-632",
      "hadith_no": "632",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا أبو عاصم، قال حدثنا حبان بن هلال، حدثنا حبيب، عن عمرو بن هرم، عن جابر بن زيد، عن ابن عباس، قال أدلج رسول الله صلى الله عليه وسلم ثم عرس فلم يستيقظ حتى طلعت الشمس أو بعضها فلم يصل حتى ارتفعت الشمس فصلى وهي صلاة الوسطى ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                      \"The Messenger of Allah (ﷺ) set out at nightfall, then stopped to camp at the end of the night, and he did not wake up until the sun had risen or had partly risen. He did not pray until the sun had risen (fully), then he prayed, and that was the 'middle prayer' (Salat Al-Wusta).\"",
      "usc_msa_ref": "",
      "chain": [
        "20241",
        "20218",
        "11276",
        "10708",
        "11271",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-1281",
      "hadith_no": "1281",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا أبو عاصم، قال حدثنا أيمن بن نابل، قال حدثنا أبو الزبير، عن جابر بن عبد الله، قال كان رسول الله صلى الله عليه وسلم يعلمنا التشهد كما يعلمنا السورة من القرآن ‏\"‏ بسم الله وبالله التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة الله وبركاته السلام علينا وعلى عباد الله الصالحين أشهد أن لا إله إلا الله وأن محمدا عبده ورسوله وأسأل الله الجنة وأعوذ به من النار ‏\"‏ ‏.‏ قال أبو عبد الرحمن لا نعلم أحدا تابع أيمن بن نابل على هذه الرواية وأيمن عندنا لا بأس به والحديث خطأ وبالله التوفيق ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"The Messenger of Allah (ﷺ) used to teach us the tashahhud just as he would teach us a surah of the Quran: 'Bismillah, wa billahi. At-tahiyyatu lillahi wasalawatu wat-tayibaat, as-salamu 'alaika ayah-Nabiyyu wa rahmatAllahi wa baraktuhu. As-salamu 'alaina a 'ala ibad illahis-salihin, ashadu an la ilaha ill Allah, wa ashhadu anna Muhammadan 'abduhu wa rasuluhu. As'al Allahal-jannah wa author billahi min an-nar (All compliments, prayers and pure words are due to Allah. Peace be upon you O Prophet, and the mercy of Allah and His blessings. Peace be upon us and upon the righteous slaves of Allah. I bear witness that that none has the right to be worshipped except Allah, and I bear witness that Muhammad is His slave and messenger. I ask Allah for Paradise and I seek refuge with Allah from the Fire.)'\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20241",
        "11555",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-1772",
      "hadith_no": "1772",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عبد الله بن إسحاق، عن أبي عاصم، عن ابن جريج، قال أخبرني موسى بن عقبة، عن نافع، عن ابن عمر، عن حفصة أم المؤمنين، أنها أخبرته أن رسول الله صلى الله عليه وسلم كان إذا سكت المؤذن صلى ركعتين خفيفتين ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that Hafsah, the Mother of the Believers, :                     Told him that when the Muaddhin fell silent, Allah's Messenger (ﷺ) would pray two brief rak'ahs.",
      "usc_msa_ref": "",
      "chain": [
        "30580",
        "20241",
        "11070",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-1816",
      "hadith_no": "1816",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عبد الله بن إسحاق، قال حدثنا أبو عاصم، قال حدثنا سعيد بن عبد العزيز، قال سمعت سليمان بن موسى، يحدث عن محمد بن أبي سفيان، قال لما نزل به الموت أخذه أمر شديد فقال حدثتني أختي أم حبيبة بنت أبي سفيان قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ من حافظ على أربع ركعات قبل الظهر وأربع بعدها حرمه الله تعالى على النار ‏\"‏ ‏.‏",
      "text_en": " Sulaiman bin Musa narrated that:                     When Muhammad bin Abi Sufyan was dying, he was greatly distressed and said: \"My sister Umm Habibah bint Abi Sufyan said: 'The Messenger of Allah (ﷺ) said: Whoever maintains four rak'ahs before Zuhr and four after, Allah (SWT) will forbid him from the Fire.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30580",
        "20241",
        "20638",
        "10880"
      ]
    },
    {
      "id": "sunan-an-nasai-2821-2",
      "hadith_no": "2821",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني عمرو بن علي، قال سمعت يحيى، وسمعت أبا عاصم، قالا حدثنا ابن جريج، قال أخبرني الحسن بن مسلم، عن طاوس، عن ابن عباس، قال قدم زيد بن أرقم فقال له ابن عباس يستذكره كيف أخبرتني عن لحم، صيد أهدي لرسول الله صلى الله عليه وسلم وهو حرام قال نعم أهدى له رجل عضوا من لحم صيد فرده وقال ‏\"‏ إنا لا نأكل إنا حرم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"Zaid bin Arqam came and Ibn Abbas said to him, reminding him: \"What did you tell me about the game meat that was given to the Messenger of Allah when he was in Ihram?\" He said: \"Yes, a man gave him a piece of game meat but he returned it and said: 'We cannot eat it, we are in Ihram.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20241",
        "11070",
        "11557",
        "11053",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-2896",
      "hadith_no": "2896",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا أبو عاصم، قال حدثنا ابن جريج، قال حدثني عبيد الله بن أبي يزيد، أن عبد الرحمن بن طارق بن علقمة، أخبره عن أمه، أن النبي صلى الله عليه وسلم كان إذا جاء مكانا في دار يعلى استقبل القبلة ودعا ‏.‏",
      "text_en": " Abdur-Rahman bin Tariq bin Alqamah narrated from his mother, that:                     when the Prophet came to a place in Dar Yala he turned to face the Qiblah and supplicated. (Daif)",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20241",
        "11070",
        "11258",
        "13066"
      ]
    },
    {
      "id": "sunan-an-nasai-3034",
      "hadith_no": "3034",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أبو داود، قال حدثنا أبو عاصم، وعفان، وسليمان، عن شعبة، عن مشاش، عن عطاء، عن ابن عباس، عن الفضل، أن النبي صلى الله عليه وسلم أمر ضعفة بني هاشم أن ينفروا من جمع بليل ‏.‏",
      "text_en": " It was narrated from Ibn Abbas, from Al-Fadl, that:                     the Prophet commanded the weak ones among Banu Hashim to move on from Jam' (Al-Muzadalifah) at night.",
      "usc_msa_ref": "",
      "chain": [
        "30002",
        "20241",
        "30106",
        "11060",
        "20020",
        "11029",
        "17",
        "20452"
      ]
    },
    {
      "id": "sunan-an-nasai-3155",
      "hadith_no": "3155",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا أبو عاصم، قال حدثنا محمد بن عجلان، عن سعيد المقبري، عن أبي هريرة، قال جاء رجل إلى النبي صلى الله عليه وسلم وهو يخطب على المنبر فقال أرأيت إن قاتلت في سبيل الله صابرا محتسبا مقبلا غير مدبر أيكفر الله عني سيئاتي قال ‏\"‏ نعم ‏\"‏ ‏.‏ ثم سكت ساعة قال ‏\"‏ أين السائل آنفا ‏\"‏ ‏.‏ فقال الرجل ها أنا ذا ‏.‏ قال ‏\"‏ ما قلت ‏\"‏ ‏.‏ قال أرأيت إن قتلت في سبيل الله صابرا محتسبا مقبلا غير مدبر أيكفر الله عني سيئاتي قال ‏\"‏ نعم إلا الدين سارني به جبريل آنفا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"A man came to the Prophet (ﷺ) while he was delivering a Khutbah from the Minbar, and he said: 'If I fight in the cause of Allah with patience and seeking reward, facing the enemy and not running away, do you think that Allah will forgive my sins?' He said: 'Yes.' Then he fell silent for a while. Then he said: 'Where is the one who was asking just now?' The man said: 'Here I am.' He said: 'What did you say?' He said: 'What did you say?' He said: 'I said: I said: If I fight in the cause of Allah with patience and seeking reward,facing the enemy and not running away, do you think that Allah will forgive my sins?' He said: 'Yes, except for debt. Jibril told me that just now.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20241",
        "10616",
        "11168",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3406",
      "hadith_no": "3406",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا أبو داود، سليمان بن سيف قال حدثنا أبو عاصم، عن ابن جريج، عن ابن طاوس، عن أبيه، أن أبا الصهباء، جاء إلى ابن عباس فقال يا ابن عباس ألم تعلم أن الثلاث، كانت على عهد رسول الله صلى الله عليه وسلم وأبي بكر وصدرا من خلافة عمر رضي الله عنهما ترد إلى الواحدة قال نعم ‏.‏",
      "text_en": " It was narrated from Ibn Tawus, from his father, that Abu As-Sahba' came to Ibn 'Abbas and said:                      \"O Ibn 'Abbas! Did you not know that the threefold divorce during the time of the Messenger of Allah and Abu Bakr, and during the early part of 'Umar's Caliphate, used to be counted as one divorce?\" He said: \"Yes.\"",
      "usc_msa_ref": "",
      "chain": [
        "20241",
        "11070",
        "11433",
        "11053"
      ]
    },
    {
      "id": "sunan-an-nasai-3559",
      "hadith_no": "3559",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا أبو عاصم، قال ابن جريج أخبرنيه ابن طاوس، عن أبيه، أنه سمع عبد الله بن عمر، يسأل عن رجل، طلق امرأته حائضا فقال أتعرف عبد الله بن عمر قال نعم ‏.‏ قال فإنه طلق امرأته حائضا فأتى عمر النبي صلى الله عليه وسلم فأخبره الخبر فأمره أن يراجعها حتى تطهر ‏.‏ ولم أسمعه يزيد على هذا ‏.‏",
      "text_en": " Ibn Tawus narrated from his father that he heard 'Abdullah bin 'Umar being asked about a man who divorced his wife when she was menstruating. He said:                      \"Do you know 'Abdullah bin 'Umar?\" He said: \"Yes.\" He said: \"He divorced his wife when she was menstruating, and 'Umar went to the Prophet and told him about that. He ordered him to take her back until she became pure,\" and I did not hear him adding anything to that.",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20241",
        "28556"
      ]
    },
    {
      "id": "sunan-an-nasai-3735",
      "hadith_no": "3735",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of 'Umra - كتاب العمرى",
      "chapter_no": "34",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا أبو عاصم، قال حدثنا ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابرا، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من أعمر شيئا فهو له حياته ومماته ‏\"‏ ‏.‏",
      "text_en": " Ibn Juraij said:                      \"Abu Az-Zubair informed me that he heard Jabir saying: 'The Messenger of Allah said: \"Whoever is given something on the basis of 'Umra it belongs to him for the rest of his life and after he dies.\"'\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20241",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-3887",
      "hadith_no": "3887",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا أبو عاصم، قال حدثنا عثمان بن مرة، قال سألت القاسم عن المزارعة، فحدث عن رافع بن خديج، أن رسول الله صلى الله عليه وسلم نهى عن المحاقلة والمزابنة‏.‏‏ قال أبو عبد الرحمن مرة أخرى‏.‏‏",
      "text_en": " It was narrated from 'Uthman bin Murrah who said:                      \"I asked Al-Qasim about Al-Muzara'ah, so he narrated from Rafi' bin Khadij that the Messenger of Allah forbade Al-Muhaqalah and Al-Muzabanah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20241",
        "10535",
        "1986"
      ]
    },
    {
      "id": "sunan-an-nasai-3888",
      "hadith_no": "3888",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عمرو بن علي، قال قال أبو عاصم عن عثمان بن مرة، قال سألت القاسم عن كراء الأرض، فقال قال رافع بن خديج إن رسول الله صلى الله عليه وسلم نهى عن كراء الأرض‏.‏‏ واختلف على سعيد بن المسيب فيه",
      "text_en": " Rafi' bin Khadij said that the Messenger of Allah forbade leasing land.",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20241",
        "10535",
        "1986"
      ]
    },
    {
      "id": "sunan-an-nasai-4099",
      "hadith_no": "4099",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أبو داود، قال حدثنا أبو عاصم، عن ابن جريج، عن ابن طاوس، عن أبيه، عن ابن الزبير، قال من رفع السلاح ثم وضعه فدمه هدر ‏.‏",
      "text_en": " It was narrated that Ibn Az-Zubair said:                     \"Whoever wields a weapon and starts to strike (the people) with it, it is permissible to shed his blood.\"",
      "usc_msa_ref": "",
      "chain": [
        "30002",
        "20241",
        "11070",
        "11433",
        "11053",
        "106"
      ]
    },
    {
      "id": "sunan-an-nasai-5059",
      "hadith_no": "5059",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا أبو عاصم، عن محمد بن بشر، عن أشعث بن أبي الشعثاء، عن الأسود بن يزيد، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يحب التيامن يأخذ بيمينه ويعطي بيمينه ويحب التيمن في جميع أموره ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah [SAW] used to like to start in the right. He would accept with his right hand and give with his right hand, and he liked to start on the right in all his affairs.\"",
      "usc_msa_ref": "",
      "chain": [
        "30172",
        "20241",
        "20352",
        "11324",
        "11054",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-5217",
      "hadith_no": "5217",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا أبو عاصم، عن المغيرة بن زياد، قال حدثنا نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم لبس خاتما من ذهب ثلاثة أيام فلما رآه أصحابه فشت خواتيم الذهب فرمى به فلا ندري ما فعل ثم أمر بخاتم من فضة فأمر أن ينقش فيه محمد رسول الله وكان في يد رسول الله صلى الله عليه وسلم حتى مات وفي يد أبي بكر حتى مات وفي يد عمر حتى مات وفي يد عثمان ست سنين من عمله فلما كثرت عليه الكتب دفعه إلى رجل من الأنصار فكان يختم به فخرج الأنصاري إلى قليب لعثمان فسقط فالتمس فلم يوجد فأمر بخاتم مثله ونقش فيه محمد رسول الله ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     The Messenger of Allah [SAW] wore a ring of gold for three days, and when his Companions saw it, gold rings became popular. Then he threw it away and we did not realize what he had done. Then he ordered that a ring of silver be made, and that (the words): \"Muhammad Rasul Allah\" be engraved on it. It remained on the hand of the Messenger of Allah [SAW] until he died, then on the hand of Abu Bakr until he died, then on the hand of 'Umar until he died. Then (it remained) on the hand of 'Uthman for the first six years of his duties, but when he had to write many letters, he gave it to a man from among Ansar who used to seal letters with it. Then the Ansari went out to a well belonging to 'Uthman and the ring fell. They looked for it but could not find it. He ordered that a similar ring be made and engraved (the words): \"Muhammad Rasul Allah\" on it.",
      "usc_msa_ref": "",
      "chain": [
        "30172",
        "20241",
        "19947",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-5396",
      "hadith_no": "5396",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا أبو عاصم، عن زكريا بن إسحاق، عن عمرو بن دينار، عن أبي الشعثاء، عن ابن عباس، أن رجلا، جاء إلى النبي صلى الله عليه وسلم فقال إن أبي شيخ كبير أفأحج عنه قال ‏\"‏ نعم أرأيت لو كان عليه دين فقضيته أكان يجزئ عنه ‏\"‏‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     A man came to the Prophet [SAW] and said: \"My father is an old man, can I perform Hajj on his behalf?\" He said: \"Yes. Don't you think that if he owed a debt and you paid it off, that would suffice him?\"",
      "usc_msa_ref": "",
      "chain": [
        "30172",
        "20241",
        "11244",
        "11081",
        "11351",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-5428",
      "hadith_no": "5428",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا أبو عبد الرحمن، أحمد بن شعيب قال أنبأنا عمرو بن علي، قال حدثنا أبو عاصم، قال حدثنا ابن أبي ذئب، قال حدثني أسيد بن أبي أسيد، عن معاذ بن عبد الله، عن أبيه، قال أصابنا طش وظلمة فانتظرنا رسول الله صلى الله عليه وسلم ليصلي بنا ثم ذكر كلاما معناه فخرج رسول الله صلى الله عليه وسلم ليصلي بنا فقال ‏\"‏ قل ‏\"‏ ‏.‏ فقلت ما أقول قال ‏\"‏ ‏{‏ قل هو الله أحد ‏}‏ والمعوذتين حين تمسي وحين تصبح ثلاثا يكفيك كل شىء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Mu'adh bin 'Abdullah that his father said:                     \"It was raining and dark, and we were waiting for the Messenger of Allah [SAW] to lead us in prayer. Then the Messenger of Allah [SAW] came out to lead us in prayer and he said: 'Say.' I said: 'What should I say?' He said: 'Say: He is Allah, (the) One and Al-Mu'awwadhatain in the evening and in the morning, three times, and that will suffice you against everything.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20241",
        "20177",
        "19800"
      ]
    },
    {
      "id": "sunan-an-nasai-5515",
      "hadith_no": "5515",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا أبو عاصم، قال حدثنا القاسم بن كثير المقرئ، عن الليث بن سعد، عن يزيد بن أبي حبيب، عن سليمان بن يسار، أنه سمع أبا هريرة، يقول سمعت رسول الله صلى الله عليه وسلم يقول في دعائه ‏\"‏ اللهم إني أعوذ بك من فتنة القبر وفتنة الدجال وفتنة المحيا والممات ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذا خطأ والصواب سليمان بن سنان ‏.‏",
      "text_en": " It was narrated from Sulaiman bin Yasar that he heard Abu Hurairah say:                     \"I heard the Messenger of Allah [SAW] say in his supplication: 'Allahumma, inni a'udhu bika min fitnatil-qabri, wa fitnatid-dajjali, wa fitnatil-mahya wal-mamat (O Allah, I seek refuge with You from the trial of the grave, and the tribulation of the Dajjal, and the trials of life and death.)'\"",
      "usc_msa_ref": "",
      "chain": [
        "20241",
        "38456",
        "20023",
        "11411",
        "11005",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-601",
      "hadith_no": "601",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن يوسف السلمي، حدثنا أبو عاصم، حدثنا حيوة بن شريح، عن يزيد بن أبي حبيب، عن الحكم بن عبد الله البلوي، عن علي بن رباح اللخمي، عن عقبة بن عامر الجهني، أنه قدم على عمر بن الخطاب من مصر فقال منذ كم لم تنزع خفيك قال من الجمعة إلى الجمعة ‏.‏ قال أصبت السنة ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amir Al-Juhani that:                     He came to 'Umar bin Khattab from Egypt. 'Umar said: \"How long has it been since you have taken off your leather socks?\" He said: \"From one Friday to the next.\" He said: \"You have acted in accordance with the Sunnah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30535",
        "20241",
        "26010",
        "11411",
        "10870",
        "189"
      ]
    },
    {
      "id": "sunan-ibn-majah-708-2",
      "hadith_no": "708",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Adhan and the Sunnah Regarding It - كتاب الأذان والسنة فيها",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن بشار، ومحمد بن يحيى، قالا حدثنا أبو عاصم، أنبأنا ابن جريج، أخبرني عبد العزيز بن عبد الملك بن أبي محذورة، عن عبد الله بن محيريز، - وكان يتيما في حجر أبي محذورة بن معير حين جهزه إلى الشام - فقلت لأبي محذورة أى عم إني خارج إلى الشام وإني أسأل عن تأذينك فأخبرني أن أبا محذورة قال خرجت في نفر فكنا ببعض الطريق فأذن مؤذن رسول الله  صلى الله عليه وسلم  بالصلاة عند رسول الله  صلى الله عليه وسلم  فسمعنا صوت المؤذن ونحن عنه متنكبون فصرخنا نحكيه نهزأ به فسمع رسول الله  صلى الله عليه وسلم  فأرسل إلينا قوما فأقعدونا بين يديه فقال ‏\"‏ أيكم الذي سمعت صوته قد ارتفع ‏\"‏ ‏.‏ فأشار إلى القوم كلهم وصدقوا فأرسل كلهم وحبسني وقال لي ‏\"‏ قم فأذن ‏\"‏ ‏.‏ فقمت ولا شىء أكره إلى من رسول الله  صلى الله عليه وسلم  ولا مما يأمرني به فقمت بين يدى رسول الله  صلى الله عليه وسلم  فألقى على رسول الله التأذين هو بنفسه فقال ‏\"‏ قل الله أكبر الله أكبر الله أكبر الله أكبر أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله ‏\"‏ ‏.‏ ثم قال لي ‏\"‏ ارجع فمد من صوتك أشهد أن لا إله إلا الله أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله أشهد أن محمدا رسول الله حى على الصلاة حى على الصلاة حى على الفلاح حى على الفلاح الله أكبر الله أكبر لا إله إلا الله ‏\"‏ ‏.‏ ثم دعاني حين قضيت التأذين فأعطاني صرة فيها شىء من فضة ثم وضع يده على ناصية أبي محذورة ثم أمرها على وجهه من بين يديه ثم على كبده ثم بلغت يد رسول الله  صلى الله عليه وسلم  سرة أبي محذورة ثم قال رسول الله  صلى الله عليه وسلم  ‏\"‏ بارك الله لك وبارك عليك ‏\"‏ ‏.‏ فقلت يا رسول الله أمرتني بالتأذين بمكة قال ‏\"‏ نعم قد أمرتك ‏\"‏ ‏.‏ فذهب كل شىء كان لرسول الله  صلى الله عليه وسلم  من كراهية وعاد ذلك كله محبة لرسول الله  صلى الله عليه وسلم  فقدمت على عتاب بن أسيد عامل رسول الله  صلى الله عليه وسلم  بمكة فأذنت معه بالصلاة على أمر رسول الله  صلى الله عليه وسلم  ‏.‏ قال وأخبرني ذلك من أدرك أبا محذورة على ما أخبرني عبد الله بن محيريز ‏.‏",
      "text_en": " Ibn Juraij narrated:                     \"Abdul-'Aziz bin 'Abdul-Malik bin Abu Mahdhurah narrated from 'Abdullah bin muhairiz who was an orphan under the care of Abu Mahdhurah bin mi'yar that when he was preparing him to travel to Sham, he said: 'O my uncle, I am going out to Sham, and I will be asked about how you started the Adhan.' So he informed me that. Abu Mahdhurah said: 'I went out with a group of people, and we were somewhere on the road, when the Mu'adh-dhin of the Messenger of Allah gave the call to prayer in the presence of the Messenger of Allah. We heard the voice of the Mu'adh-dhin, and we were shunning it (the Adhan), so we started yelling, imitating it and mocking it. The Messenger of Allah heard us, so he sent some people who brought us to sit in front of him. He said: 'Who is the one whose voice I heard so loud?' The people all pointed to me, and they were telling the truth. He sent them all away, but kept me there and said to me: 'Stand up and give the call to prayer.' I stood up and there was nothing more hateful to me than the Messenger of Allah and what he was telling me to do. I stood up in front of the Messenger of Allah and the Messenger of Allah himself taught me the call. He said: \"Say: 'Allahu Akbar Allahu Akbar, Allahu Akbar Allahu Akbar; Ash-hadu an la ilaha illallah, Ash-hadu an la ilaha illallah; Ash-hadu anna Muhammadan Rasulullah, Ash-hadu anna Muhammadan Rasulullah (Allah is the Most great, Allah is the most Great, Allah is the most Great, Allah is the most Great; I bear witness that none has the right to be worshipped but Allah, I bear witness that none has the right to be worshipped but Allah; I bear witness that Muhammad is the Messenger of Allah, I bear witness that Muhammad is the Messenger of Allah).'\" Then he said: \"Raise your voice (and say). Ash-hadu an la ilaha illallah, Ash-hadu an la ilaha illallah; Ash-hadu anna Muhammadan Rasulullah, Ash-hadu anna Muhammadan Rasulullah; Hayya 'alal-salah, Hayya 'alal-salah; Hayya 'alal-falah, Hayya 'alal-falah; Allahu Akbar Allahu Akbar; La ilaha illallah (I bear witness that none has the right to be worshipped but Allah, I bear witness that none has the right to be worshipped but Allah; I bear witness that Muhammad is the Messenger of Allah, I bear witness that Muhammad is the Messenger of Allah; Come to the Prayer, Come to the Prayer; Come to the prosperity, Come to the prosperity; Allah is the Most great, Allah is the Most Great; None has the right to be worshipped but Allah).'\" Then he called me when I had finished saying the Adhan, and gave me a small bag in which there was some silver. Then he put his hand on the forelock of Abu Mahdhurah, then passed it over his face, then over his chest, and over his heart, until the hand of the Messenger of Allah reached his navel. Then the Messenger of Allah said: 'May Allah bless you and send blessings upon you.' I said: 'O Messenger of Allah, do you command me to give the call to prayer in Makkah?' He said: 'Yes, I command you (to do so).' Then all the hatred I had felt towards the Messenger of Allah disappeared, and was replaced with love for the Messenger of Allah. I came to 'Attab bin Asid, the governor of the Messenger of Allah in Makkah, and gave the call to prayer with him by command of the Messenger of Allah.\" (Sahih)He ('Abdul-'Aziz) said: \"Someone who met Abu Mahdhurah told me the same as 'Abdullah bin Muhairiz told me.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "11222",
        "20241",
        "11070",
        "19832",
        "11253"
      ]
    },
    {
      "id": "sunan-ibn-majah-1114",
      "hadith_no": "1114",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عاصم، حدثنا عبد الحميد بن جعفر، حدثنا محمد بن عمرو بن عطاء، قال سمعت أبا حميد الساعدي، في عشرة من أصحاب رسول الله  صلى الله عليه وسلم  فيهم أبو قتادة فقال أبو حميد أنا أعلمكم بصلاة رسول الله  صلى الله عليه وسلم  ‏.‏ قالوا لم فوالله ما كنت بأكثرنا له تبعة ولا أقدمنا له صحبة ‏.‏ قال بلى ‏.‏ قالوا فاعرض ‏.‏ قال كان رسول الله  صلى الله عليه وسلم  إذا قام إلى الصلاة كبر ثم رفع يديه حتى يحاذي بهما منكبيه ويقر كل عضو منه في موضعه ثم يقرأ ثم يكبر ويرفع يديه حتى يحاذي بهما منكبيه ثم يركع ويضع راحتيه على ركبتيه معتمدا لا يصب رأسه ولا يقنع معتدلا ثم يقول ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ويرفع يديه حتى يحاذي بهما منكبيه حتى يقر كل عظم إلى موضعه ثم يهوي إلى الأرض ويجافي يديه عن جنبيه ثم يرفع رأسه ويثني رجله اليسرى فيقعد عليها ويفتخ أصابع رجليه إذا سجد ثم يسجد ثم يكبر ويجلس على رجله اليسرى حتى يرجع كل عظم منه إلى موضعه ثم يقوم فيصنع في الركعة الأخرى مثل ذلك ثم إذا قام من الركعتين رفع يديه حتى يحاذي بهما منكبيه كما صنع عند افتتاح الصلاة ثم يصلي بقية صلاته هكذا حتى إذا كانت السجدة التي ينقضي فيها التسليم أخر إحدى رجليه وجلس على شقه الأيسر متوركا ‏.‏ قالوا صدقت هكذا كان يصلي رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " Muhammadbin ‘Amr bin ‘Ata’ said:                      ‘While he was among ten of theCompanions of the Messenger of Allah (ﷺ) including Abu Qatadah: “Iheard Abu Humaid As-Sa’idi say: ‘I am the most knowledgeable ofyouconcerning the prayer of the Messenger of Allah (ﷺ).’ Theysaid:‘Why? By Allah, you did not follow him more than we did, andyou didnot accompany him for longer.’ He said: ‘Yes I am.’They said: ‘Showus.’ He said: ‘When the Messenger of Allah(ﷺ) stood up for prayer,he would say the Takbir, then he wouldraise his hands parallel to hisshoulders, and every part of his bodywould settle in place. Then hewould recite, then he would raise hishands parallel to his shouldersand bow, placing his palms on hisknees and supporting his weight onthem. He neither lowered his head,nor raised it up, it was evenlybalanced (between either extreme).Then he would say: “Sami’ Allahuliman hamidah (Allah hears thosewho praise Him); and he would raisehis hands parallel with hisshoulders, until every bone returned toits place. Then he wouldprostrate himself on the ground, keeping hisarms away from hissides. Then he would raise his head and tuck hisleft foot under himand sit on it, and he would spread his toes whenhe prostrated.* Thenhe would prostrate, then say the Takbir and siton his left foot,until every bone returned to its place. Then hewould stand up and dothe same in the next Rak’ah. Then when he stoodup after twoRak’ah, he would raise his hands level with his shouldersas he didat the beginning of the prayer. Then he would offer the restof hisprayer in like manner until, when he did the prostration aftertheTaslim comes, he would push one of his feet back and sit and hisweight on his left side, Mutawarrikan.’** They said: ‘You havespokenthe truth; this is how the Messenger of Allah (ﷺ) used toperformthe prayer.’”***",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20241",
        "11875",
        "11220"
      ]
    },
    {
      "id": "sunan-ibn-majah-1127",
      "hadith_no": "1127",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا أبو عاصم، وقرأته، عليه أنبأنا ابن جريج، أخبرني عطاء، حدثني جابر بن عبد الله، في أناس معي قال قدم النبي  صلى الله عليه وسلم  مكة صبح رابعة مضت من شهر ذي الحجة ‏.‏",
      "text_en": " ‘Ata’narrated:                      “Jabir bin ‘Abdullah, who was among the people withme,told me that the Prophet (ﷺ) arrived in Makkah in the morning ofthe fourth day of Dhul-Hijjah.”",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20241",
        "11070",
        "11029"
      ]
    },
    {
      "id": "sunan-ibn-majah-1458",
      "hadith_no": "1458",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبدة بن عبد الله الخزاعي، وأحمد بن يوسف السلمي، قالا حدثنا أبو عاصم، عن بكار بن عبد العزيز بن عبد الله بن أبي بكرة، عن أبيه، عن أبي بكرة، أن النبي  صلى الله عليه وسلم  كان إذا أتاه أمر يسره أو يسر به خر ساجدا شكرا لله تبارك وتعالى ‏.‏",
      "text_en": " It wasnarrated from Abu Bakrah that when the Prophet (ﷺ) heardnews thatmade him happy, or for which one should be happy, he wouldfall downprostrate in gratitude to Allah, the Blessed and Exalted.",
      "usc_msa_ref": "",
      "chain": [
        "30149",
        "30535",
        "20241",
        "28556",
        "3229"
      ]
    },
    {
      "id": "sunan-ibn-majah-1486",
      "hadith_no": "1486",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا أبو عاصم، عن ابن جريج، عن أبي الزبير، عن جابر بن عبد الله، قال سئل النبي  صلى الله عليه وسلم  أى الصلاة أفضل قال ‏\"‏ طول القنوت ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Jabir bin ‘Abdullah said:                      “The Prophet (ﷺ) wasasked: ‘Which prayer is best?’ He said: ‘That with the longerQunut.’”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20241",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-1563",
      "hadith_no": "1563",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا عمرو بن أبي عاصم النبيل، وإبراهيم بن المستمر، قالا حدثنا أبو عاصم، حدثنا حماد بن جعفر العبدي، حدثني شهر بن حوشب، حدثتني أم شريك الأنصارية، قالت أمرنا رسول الله  صلى الله عليه وسلم  أن نقرأ على الجنازة بفاتحة الكتاب ‏.‏",
      "text_en": " UmmSharik Al-Ansari said:                      “The Messenger of Allah (ﷺ) commanded usto recite the Opening of the Book (Al-Fatihah) in the funeralprayer.”",
      "usc_msa_ref": "",
      "chain": [
        "34023",
        "20241",
        "11044"
      ]
    },
    {
      "id": "sunan-ibn-majah-1823",
      "hadith_no": "1823",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن يوسف السلمي، حدثنا أبو عاصم، أنبأنا ابن جريج، عن أبي الزبير، عن جابر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من دعي إلى طعام وهو صائم فليجب فإن شاء طعم وإن شاء ترك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Jabir that the Messenger of Allah (ﷺ) said:                     “Whoeveris invited to eat when he is fasting, let him accept theinvitation;and if he wants to let him eat, and if he wants let himnot eat.”",
      "usc_msa_ref": "",
      "chain": [
        "30535",
        "20241",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-1828",
      "hadith_no": "1828",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا أبو عاصم، حدثنا ثواب بن عتبة المهري، عن ابن بريدة، عن أبيه، أن رسول الله  صلى الله عليه وسلم  كان لا يخرج يوم الفطر حتى يأكل وكان لا يأكل يوم النحر حتى يرجع ‏.‏",
      "text_en": " It wasnarrated from Ibn Buraidah from his father, that:                      The Messenger ofAllah (ﷺ) would not go out on the Day of Fitr until he had eaten,and he would not eat on the Day of Nahr (the day of sacrifice) untilhe came back.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20241",
        "14052",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-2053",
      "hadith_no": "2053",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف ومحمد بن يحيى قالا حدثنا أبو عاصم، عن جعفر بن يحيى بن ثوبان، عن عمه، عمارة بن ثوبان عن عطاء، عن ابن عباس، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ خيركم خيركم لأهله وأنا خيركم لأهلي ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     the Prophet said: \"The best of you is the one who is best to his wife, and I am the best of you to my wives.\"",
      "usc_msa_ref": "",
      "chain": [
        "20241",
        "28085",
        "13539",
        "11029",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-2132",
      "hadith_no": "2132",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا أبو عاصم، عن جعفر بن يحيى بن ثوبان، عن عمه، عمارة بن ثوبان عن عطاء، عن ابن عباس، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ لا تسأل المرأة زوجها الطلاق في غير كنهه فتجد ريح الجنة ‏.‏ وإن ريحها ليوجد من مسيرة أربعين عاما ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that the Prophet (ﷺ) said:                     \"No woman asks for divorce when it is not absolutely necessary, but she will never smell the fragrance of paradise, although its fragrance can be detected from a distance of forty years' travel. \"",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20241",
        "28085",
        "13539",
        "11029",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-2139",
      "hadith_no": "2139",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن يوسف السلمي، حدثنا أبو عاصم، عن ابن جريج، عن يحيى بن عبد الله بن محمد بن صيفي، عن عكرمة بن عبد الرحمن، عن أم سلمة، أن رسول الله  صلى الله عليه وسلم  آلى من بعض نسائه شهرا فلما كان تسعة وعشرين راح أو غدا ‏.‏ فقيل يا رسول الله إنما مضى تسع وعشرون ‏.‏ فقال ‏\"‏ الشهر تسع وعشرون ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Salamah that:                     the Messenger of Allah (ﷺ) swore to keep away from some of his wives for a month. On the twenty-ninth day, in the evening or the morning, it was said: \"O Messenger of Allah, only twenty-nine days have passed.\" He said: \"The month is twenty-nine days.\"",
      "usc_msa_ref": "",
      "chain": [
        "30535",
        "20241",
        "11070",
        "11448",
        "56"
      ]
    },
    {
      "id": "sunan-ibn-majah-2158",
      "hadith_no": "2158",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عاصم، حدثنا ابن جريج، عن مظاهر بن أسلم، عن القاسم، عن عائشة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ طلاق الأمة تطليقتان وقرؤها حيضتان ‏\"‏ ‏.‏ قال أبو عاصم فذكرته لمظاهر فقلت حدثني كما حدثت ابن جريج ‏.‏ فأخبرني عن القاسم عن عائشة عن النبي  صلى الله عليه وسلم  قال ‏\"‏ طلاق الأمة تطليقتان وقرؤها حيضتان ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that the Prophet (ﷺ) said:                     \"The divorce of a slave woman is twice, and her (waiting) period is two menstrual cycles.\" Abu 'Asim said: \"I mentioned this to Muzahir and said: 'Tell me what you told Ibn Juraij.' So he told me, narrating from Qasim  from 'Aishah, that the Prophet (ﷺ) said: 'The divorce of a slave woman is twice, and her (waiting) period is two menstrual cycles.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20241",
        "11070",
        "12508",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-2231",
      "hadith_no": "2231",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا أبو عاصم، أخبرني أبي، عن الزبير بن عبيد، عن نافع، قال كنت أجهز إلى الشام وإلى مصر فجهزت إلى العراق فأتيت عائشة أم المؤمنين فقلت لها يا أم المؤمنين كنت أجهز إلى الشام فجهزت إلى العراق ‏.‏ فقالت لا تفعل مالك ولمتجرك فإني سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ إذا سبب الله لأحدكم رزقا من وجه فلا يدعه حتى يتغير له أو يتنكر له ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Nafi' said:                     I used to send trade goods to Sham and Egypt, then I prepared to send trade goods to 'Iraq. I went to 'Aishah, the Mother of the Believers, and said to her: \" O Mother of the Believers I used to send trade goods to Sham and I am preparing to send trade goods to 'Iraq.\" She said: \"Do not do that. What is wrong with the way you have been doing it? I heard the Messenger of Allah (ﷺ) say: 'If Allah causes provision to come to one of you through a certain means, he should not leave it unless it changes or deteriorates.\"",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20241",
        "28556",
        "11014"
      ]
    },
    {
      "id": "sunan-ibn-majah-2336-2",
      "hadith_no": "2336",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا أبو عاصم، عن ابن جريج، عن عمرو بن دينار، أن هشام بن يحيى، أخبره أن عكرمة بن سلمة أخبره أن أخوين من بلمغيرة أعتق أحدهما أن لا يغرز خشبا في جداره فأقبل مجمع بن يزيد ورجال كثير من الأنصار فقالوا نشهد أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يمنع أحدكم جاره أن يغرز خشبة في جداره ‏\"‏ ‏.‏ فقال يا أخي إنك مقضي لك على وقد حلفت فاجعل أسطوانا دون حائطي أو جداري فاجعل عليه خشبك ‏.‏",
      "text_en": " 'Ikrimah bin Salamh narrated that :                     there were two brothers from among the sons of Mughirah. One of them swore an oath to set a slave free if the other one fixed a piece of wood to his wall. Mujammi' bin Yazid  and many men from among the Ansar came and said: “We bear witness that the Messenger of Allah (ﷺ) said: 'None of you should refuse to let his neighbor fix a piece of wood to his wall.' ” He said: 'O my brother, judgment has been passed in your favor against me, but I have sworn an oath.' So go ahead and fix your wood to my wall.”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20241",
        "11070",
        "11081"
      ]
    },
    {
      "id": "sunan-ibn-majah-2357-2",
      "hadith_no": "2357",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عاصم، حدثنا عبد الله بن مسلم بن هرمز، عن سلمة المكي، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم خلع معاذ بن جبل من غرمائه ثم استعمله على اليمن فقال معاذ إن رسول الله صلى الله عليه وسلم استخلصني بمالي ثم استعملني ‏.‏",
      "text_en": " It was narrated from Jabir bin 'Abdullah that :                     the Messenger of Allah (ﷺ) rid Mu'adh bin Jabal of his creditors, then he appointed him governor of Yemen. Mu'adh said: “The Messenger of Allah (ﷺ) settled my debts with my creditors using what wealth I had, then he appointed me as governor.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20241",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-2592",
      "hadith_no": "2592",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Pre-emption - كتاب الشفعة",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن يحيى، وعبد الرحمن بن عمر، قالا حدثنا أبو عاصم، حدثنا مالك بن أنس، عن الزهري، عن سعيد بن المسيب، وأبي، سلمة بن عبد الرحمن عن أبي هريرة  رضي الله عنه  أن رسول الله صلى الله عليه وسلم قضى بالشفعة فيما لم يقسم فإذا وقعت الحدود فلا شفعة ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     the Messenger of Allah (ﷺ) ruled concerning preemption of land that has not been divided; if the boundaries have been set then there is no preemption.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20241",
        "20001",
        "11013",
        "11002",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2593",
      "hadith_no": "2593",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Pre-emption - كتاب الشفعة",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن حماد الطهراني، حدثنا أبو عاصم، عن مالك، عن الزهري، عن سعيد بن المسيب، وأبي، سلمة عن أبي هريرة، عن النبي صلى الله عليه وسلم نحوه ‏.‏ قال أبو عاصم سعيد بن المسيب مرسل وأبو سلمة عن أبي هريرة متصل ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20241",
        "20001",
        "11013",
        "11002",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2612",
      "hadith_no": "2612",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Manumission (of Slaves) - كتاب العتق",
      "chapter_no": "19",
      "text_ar": "حدثنا أحمد بن يوسف، حدثنا أبو عاصم، حدثنا أبو بكر يعني النهشلي، عن الحسين بن عبد الله، عن عكرمة، عن ابن عباس، قال ذكرت أم إبراهيم عند رسول الله صلى الله عليه وسلم ‏.‏ فقال ‏\"‏ أعتقها ولدها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn`Abbas said:                     “Mention was made of the mother of Ibrahim in the presence of the Messenger of Allah (ﷺ), and he said: 'Her son set her free.'”",
      "usc_msa_ref": "",
      "chain": [
        "30535",
        "20241",
        "20619",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-2689",
      "hadith_no": "2689",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عاصم، عن ابن جريج، عن أبي الزبير، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يقطع الخائن ولا المنتهب ولا المختلس ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir bin Abdullah that the Messenger of Allah (ﷺ) said:                     “The hand of the one who betrays a trust, the robber and the pilferer is not to be cut off”.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20241",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-2743",
      "hadith_no": "2743",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا أحمد بن سعيد الدارمي، حدثنا أبو عاصم، أخبرني ابن جريج، حدثني عمرو بن دينار، أنه سمع طاوسا، عن ابن عباس، عن عمر بن الخطاب، أنه نشد الناس قضاء النبي صلى الله عليه وسلم في ذلك يعني في الجنين فقام حمل بن مالك بن النابغة فقال كنت بين امرأتين لي فضربت إحداهما الأخرى بمسطح فقتلتها وقتلت جنينها فقضى رسول الله صلى الله عليه وسلم في الجنين بغرة عبد وأن تقتل بها ‏.‏",
      "text_en": " It was narrated from 'Umar bin Khattab that :                     he asked the people about the ruling of the Prophet (ﷺ) concerning that - concerning a fetus. Hamal bin Malik bin Nabighah stood up and said: “I was between my two wives and one of them struck the other with a tent-pole, killing her and a fetus. The Messenger of Allah (ﷺ) ruled that the blood money for the fetus was a slave, and that she would be killed in retaliation.”",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "20241",
        "11070",
        "11081",
        "11053",
        "17",
        "3"
      ]
    },
    {
      "id": "sunan-ibn-majah-2769",
      "hadith_no": "2769",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا إبراهيم بن المستمر العروقي، حدثنا أبو عاصم، عن سفيان، عن جابر، عن أبي عازب، عن النعمان بن بشير، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا قود إلا بالسيف ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Nu'man bin Bashir that the Messenger of Allah (ﷺ) said:                     “There is no retaliation with the sword.”",
      "usc_msa_ref": "",
      "chain": [
        "34023",
        "20241",
        "20012",
        "34",
        "274"
      ]
    },
    {
      "id": "sunan-ibn-majah-2880",
      "hadith_no": "2880",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن سعيد بن يزيد بن إبراهيم التستري، حدثنا أبو عاصم، عن شبيب، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من راح روحة في سبيل الله كان له بمثل ما أصابه من الغبار مسكا يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Anas bin Malik that the Messenger of Allah (ﷺ)said:                     “Whoever goes out in the cause of Allah will have the equivalentofthe dust that got on him, in musk, on the Day of Resurrection.”",
      "usc_msa_ref": "",
      "chain": [
        "34204",
        "20241",
        "20238",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-3051",
      "hadith_no": "3051",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا أبو عاصم، عن ابن جريج، أخبرني أبو الزبير، أنه سمع طاوسا، وعكرمة، يحدثان عن ابن عباس، قال جاءت ضباعة بنت الزبير بن عبد المطلب رسول الله  صلى الله عليه وسلم  فقالت إني امرأة ثقيلة وإني أريد الحج فكيف أهل قال ‏\"‏ أهلي واشترطي أن محلي حيث حبستني ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      Duba’ah bint Zubair bin‘Abdul-Muttalib came to the Messenger of Allah (ﷺ) and said: “Iam a heavywoman and I want to go for Hajj. How should I enterIhram?” He said:“Enter Ihram and stipulate the condition thatyou will exit Ihram fromthe point where you are prevented.”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20241",
        "11070",
        "11263",
        "11053",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3097",
      "hadith_no": "3097",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا أبو عاصم، أنبأنا ابن جريج، أخبرني منصور بن عبد الرحمن، عن أمه، صفية عن أسماء بنت أبي بكر، قالت خرجنا مع رسول الله  صلى الله عليه وسلم  محرمين فقال النبي  صلى الله عليه وسلم  ‏\"‏ من كان معه هدى فليقم على إحرامه ومن لم يكن معه هدى فليحلل ‏\"‏ ‏.‏ قالت ولم يكن معي هدى فأحللت وكان مع الزبير هدى فلم يحل فلبست ثيابي وجئت إلى الزبير فقال قومي عني ‏.‏ فقلت أتخشى أن أثب عليك ‏.‏",
      "text_en": " It wasnarrated that Asma’ bint Abi Bakr said:                      “We went out with theMessenger of Allah (ﷺ) in Ihram. The Prophet (ﷺ) said: ‘Whoeverhas a sacrificial animal with him, let him remain in Ihram. Whoeverdoes not have a sacrificial animal with him, let him exit Ihram.’Shesaid: ‘I did not have a sacrificial animal with me, so I exitedIhram,but Zubair had a sacrificial animal with him, so he did notexitIhram. So I put on my regular clothes and came to Zubair, and hesaid:‘Go away from me.’ I said: ‘Are you afraid I am going tojump onyou?!’”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20241",
        "11070",
        "11565",
        "70"
      ]
    },
    {
      "id": "sunan-ibn-majah-3312",
      "hadith_no": "3312",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا أبو عاصم، حدثنا ابن جريج، أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول أكلنا زمن خيبر الخيل وحمر الوحش ‏.‏",
      "text_en": " It wasnarrated from Abu Zubair that he heard Jabir bin ‘Abdullahsay:                      “Atthe time of Khaibar we ate horses and wild donkeys.”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20241",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-3506",
      "hadith_no": "3506",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن سعيد بن يزيد بن إبراهيم التستري، حدثنا أبو عاصم، عن شبيب، سمعت أنس بن مالك، - أو حدثني أنس، - قال لعن رسول الله  صلى الله عليه وسلم  في الخمر عشرة عاصرها ومعتصرها والمعصورة له وحاملها والمحمولة له وبائعها والمبتاعة له وساقيها والمستقاة له ‏\"‏ ‏.‏ حتى عد عشرة من هذا الضرب ‏.‏",
      "text_en": " Anassaid:                      “The Messenger of Allah (ﷺ) cursed ten with regard towine:The one who squeezes (the grapes etc.), the one who asks for itto besqueezed, the one for whom it is squeezed, the one who carriesit,the one to whom it is carried, the one who sells it, the one forwhomit is brought, the one who pours it, the one for whom it ispoured,until he counted ten like this.”",
      "usc_msa_ref": "",
      "chain": [
        "34204",
        "20241",
        "20238",
        "19",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-3574",
      "hadith_no": "3574",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف حدثنا أبو عاصم، عن عثمان بن عبد الملك، قال سمعت سالم بن عبد الله، يحدث عن أبيه، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ عليكم بهذه الحبة السوداء فإن فيها شفاء من كل داء إلا السام ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Uthman bin ‘Abdul-Malik said:                      “I heard Salimbin‘Abdullah narrating from his father that the Messenger of Allah(ﷺ) said: ‘You should eat this black seed, for in it there ishealing from every disease, except the Sam (death).’”",
      "usc_msa_ref": "",
      "chain": [
        "20241",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-3624",
      "hadith_no": "3624",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو سلمة، يحيى بن خلف حدثنا أبو عاصم، حدثني عثمان بن عبد الملك، قال سمعت سالم بن عبد الله، يحدث عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ عليكم بالإثمد فإنه يجلو البصر وينبت الشعر ‏\"‏ ‏.‏",
      "text_en": " Salimbin ‘Abdullah narrated that his father said:                      “The Messenger ofAllah (ﷺ) said: ‘You should use antimony, for it improves theeyesight and makes the hair (eyelashes) grow.’”",
      "usc_msa_ref": "",
      "chain": [
        "20241",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-3805",
      "hadith_no": "3805",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا أبو عاصم، عن شبيب بن بشر، عن أنس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ما أنعم الله على عبد نعمة فقال الحمد لله ‏.‏ إلا كان الذي أعطاه أفضل مما أخذ ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas that :                     the Messenger of Allah (ﷺ) said: 'Allah does not bestow a blessing upon any slave and he says: 'Al-hamdu Lillah (praise is to Allah),' except that what he gives (the praise) is better than what he received (the blessing).\"",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20241",
        "15223",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-3887",
      "hadith_no": "3887",
      "source": "Sunan Ibn Majah",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا أبو عاصم، عن ابن جريج، أخبرني أبو الزبير، عن جابر بن عبد الله، أنه سمع النبي  صلى الله عليه وسلم  يقول ‏\"‏ إذا دخل الرجل بيته فذكر الله عند دخوله وعند طعامه قال الشيطان لا مبيت لكم ولا عشاء ‏.‏ وإذا دخل ولم يذكر الله عند دخوله قال الشيطان أدركتم المبيت ‏.‏ فإذا لم يذكر الله عند طعامه قال أدركتم المبيت والعشاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir bin ‘Abdullah that he heard the Prophet (ﷺ) say:                      “When a man enters his house, and remembers Allah when he enters and when he eats, Satan says: ‘You have no place to stay and no supper.’ If he enters his house and does not remember Allah upon entering, Satan says: ‘You have found a place to stay.’ And if he does not remember Allah when he eats, (Satan) says: ‘You have found a place to stay and supper.’”",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20241",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-4070",
      "hadith_no": "4070",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن بشار، ومحمد بن المثنى، قالا حدثنا أبو عاصم، حدثنا ابن جريج، عن أبي الزبير، عن جابر بن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من انتهب نهبة مشهورة فليس منا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir bin ‘Abdullah that the Messenger ofAllah(ﷺ) said:                      “Whoever plunders openly is not one of us.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "30170",
        "20241",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-4198",
      "hadith_no": "4198",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن بشار، ومحمد بن المثنى، قالا حدثنا أبو عاصم، حدثنا حيوة بن شريح، حدثنا أبو صخر، عن نافع، أن رجلا، أتى ابن عمر فقال إن فلانا يقرأ عليك السلام قال إنه بلغني أنه قد أحدث فإن كان قد أحدث فلا تقرئه مني السلام فإني سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ يكون في أمتي - أو في هذه الأمة - مسخ وخسف وقذف ‏\"‏ ‏.‏ وذلك في أهل القدر ‏.‏",
      "text_en": " It was narrated from Nafi’ that a man came to Ibn ‘Umar and said:                     “So-and-so sends his Salam to you.” He said: “I have heard thathe hasintroduced innovations (into Islam). If he has indeedintroducedinnovations, then do not convey my Salam to him, for Iheard theMessenger of Allah (ﷺ) say: ‘There will be among mynation – oramong this nation – transformations, the earthcollapsing, and Qadhf.’That was concerning Ahlul-Qadar.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "30170",
        "20241",
        "26010",
        "11014"
      ]
    }
  ],
  "total_hadiths": 232
}