{
  "id": "20240",
  "name": "Shayban bin 'Abdur Rahman شيبان بن عبد الرحمن النحوي أبو معاوية",
  "full_name": "Shayban bin 'Abdur Rahman شيبان بن عبد الرحمن النحوي أبو معاوية",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "164",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra",
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Tamimi",
      "Client",
      "al-Basri",
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11368",
      "name": "'Abdul Malik bin 'Umayr al-Qabti عبد الملك بن عمير بن سويد القبطي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11385",
      "name": "Faras bin Yahya al-Hamdani al-Kharfi فراس بن يحيى",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11449",
      "name": "Yahya bin Abi Kathir يحيى بن أبي كثير الطائي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10770",
      "name": "Smak bin Hrb bin Aws سماك بن حرب بن أوس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11324",
      "name": "Ash'ath bin Abi al-Ash'atha أشعث بن أبي الشعثاء",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "24244",
      "name": "'Abdullah bin al-Mukhtar عبد الله بن المختار البصري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11339",
      "name": "Ziyad bin 'Alaqa زياد بن علاقة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11524",
      "name": "'Uthman bin 'Abdullah bin Muhab عثمان بن عبد الله بن موهب التيمي الأعرج",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "22977",
      "name": "Hilal bin 'Abdur Rahman al-Wzan هلال بن عبد الرحمن",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "students": [
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11001",
      "name": "Abu Hanifa أبو حنيفة‎‎",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20355",
      "name": "Muhammad bin 'Abdullah bin al-Zubair محمد بن عبد الله أبو أحمد الزبيري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20609",
      "name": "Mua'wiya bin Hisham al-Qsar معاوية بن هشام القصار",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20426",
      "name": "Shababa bin Sawar شبابة بن سوار الفزاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20384",
      "name": "Abu Ahmed al-Mu'dab الحسين بن محمد بن بهرام - أبو علي المؤدب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20383",
      "name": "al-Hasan bin Musa al-'Ashayb الحسن بن موسى الأشيب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20393",
      "name": "Yonus bin Muhammad bin Muslim يونس بن محمد بن مسلم المؤدب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20390",
      "name": "Hashim bin al-Qasim bin Muslim هاشم بن القاسم أبو النضر - قيصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20365",
      "name": "Yahya bin Abi Bkyr يحيى بن أبي بكير واسمه نسر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20404",
      "name": "Aadm bin Abi Iyas آدم بن أبي إياس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20340",
      "name": "'Ubaidullah bin Musa bin Abi al-Mukhtar عبيد الله بن موسى بن أبي المختار باذام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20386",
      "name": "'Ali bin al-J'ad al-Jauhri علي بن الجعد بن عبيد الجوهري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "112",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو نعيم الفضل بن دكين، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن أبي هريرة، أن خزاعة، قتلوا رجلا من بني ليث عام فتح مكة بقتيل منهم قتلوه، فأخبر بذلك النبي صلى الله عليه وسلم فركب راحلته، فخطب فقال ‏\"‏ إن الله حبس عن مكة القتل  أو الفيل شك أبو عبد الله  وسلط عليهم رسول الله صلى الله عليه وسلم والمؤمنين، ألا وإنها لم تحل لأحد قبلي، ولا تحل لأحد بعدي ألا وإنها حلت لي ساعة من نهار، ألا وإنها ساعتي هذه حرام، لا يختلى شوكها، ولا يعضد شجرها، ولا تلتقط ساقطتها إلا لمنشد، فمن قتل فهو بخير النظرين إما أن يعقل، وإما أن يقاد أهل القتيل ‏\"‏‏.‏ فجاء رجل من أهل اليمن فقال اكتب لي يا رسول الله‏.‏ فقال ‏\"‏ اكتبوا لأبي فلان ‏\"‏‏.‏ فقال رجل من قريش إلا الإذخر يا رسول الله، فإنا نجعله في بيوتنا وقبورنا‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إلا الإذخر، إلا الإذخر ‏\"‏‏.‏ قال أبو عبد الله يقال يقاد بالقاف‏.‏ فقيل لأبي عبد الله أى شىء كتب له قال كتب له هذه الخطبة‏.‏",
      "text_en": " Narrated Abu Huraira:                     In the year of the Conquest of Mecca, the tribe of Khuza`a killed a man from the tribe of Bani Laith in revenge for a killed person, belonging to them. They informed the Prophet about it. So he rode his Rahila (she-camel for riding) and addressed the people saying, \"Allah held back the killing from Mecca. (The sub-narrator is in doubt whether the Prophet said \"elephant or killing,\" as the Arabic words standing for these words have great similarity in shape), but He (Allah) let His Apostle and the believers over power the infidels of Mecca. Beware! (Mecca is a sanctuary) Verily! Fighting in Mecca was not permitted for anyone before me nor will it be permitted for anyone after me. It (war) in it was made legal for me for few hours or so on that day. No doubt it is at this moment a sanctuary, it is not allowed to uproot its thorny shrubs or to uproot its trees or to pick up its Luqat (fallen things) except by a person who will look for its owner (announce it publicly). And if somebody is killed, then his closest relative has the right to choose one of the two-- the blood money (Diyya) or retaliation having the killer killed. In the meantime a man from Yemen came and said, \"O Allah's Apostle! Get that written for me.\" The Prophet ordered his companions to write that for him. Then a man from Quraish said, \"Except Al-Idhkhir (a type of grass that has good smell) O Allah's Apostle, as we use it in our houses and graves.\" The Prophet said, \"Except Al-Idhkhir i.e. Al-Idhkhir is allowed to be plucked.\"",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "179",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن يحيى، عن أبي سلمة، أن عطاء بن يسار، أخبره أن زيد بن خالد أخبره أنه، سأل عثمان بن عفان  رضى الله عنه  قلت أرأيت إذا جامع فلم يمن قال عثمان يتوضأ كما يتوضأ للصلاة، ويغسل ذكره‏.‏ قال عثمان سمعته من رسول الله صلى الله عليه وسلم‏.‏ فسألت عن ذلك عليا، والزبير، وطلحة، وأبى بن كعب  رضى الله عنهم  فأمروه بذلك‏.‏",
      "text_en": " Narrated Zaid bin Khalid:                     I asked `Uthman bin `Affan about a person who engaged in intercourse but did no discharge. `Uthman replied, \"He should perform ablution like the one for an ordinary prayer but he must wash his penis.\" `Uthman added, \"I heard it from Allah's Apostle.\" I asked `Ali Az-Zubair, Talha and Ubai bin Ka`b about it and they, too, gave the same reply. (This order was canceled later on and taking a bath became necessary for such cases).",
      "chain": [
        "35043",
        "20240",
        "11449",
        "10567",
        "11020",
        "3625",
        "4"
      ]
    },
    {
      "hadith_no": "204",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن جعفر بن عمرو بن أمية الضمري، أن أباه، أخبره أنه، رأى النبي صلى الله عليه وسلم يمسح على الخفين‏.‏ وتابعه حرب بن شداد وأبان عن يحيى‏.‏",
      "text_en": " Narrated Ja`far bin `Amr bin Umaiya Ad-Damri:                     My father said, \"I saw the Prophet passing wet hands over his Khuffs (socks made from thick fabric or leather).\"",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "11501"
      ]
    },
    {
      "hadith_no": "286",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا هشام، وشيبان، عن يحيى، عن أبي سلمة، قال سألت عائشة أكان النبي صلى الله عليه وسلم يرقد وهو جنب قالت نعم ويتوضأ‏.‏",
      "text_en": " Narrated Abu Salama:                     I asked `Aisha \"Did the Prophet use to sleep while he was Junub?\" She replied, \"Yes, but he used to perform ablution (before going to bed).",
      "chain": [
        "20348",
        "20295",
        "20240",
        "11449",
        "10567"
      ]
    },
    {
      "hadith_no": "322",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا سعد بن حفص، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن زينب ابنة أبي سلمة، حدثته أن أم سلمة قالت حضت وأنا مع النبي، صلى الله عليه وسلم في الخميلة، فانسللت فخرجت منها، فأخذت ثياب حيضتي فلبستها، فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ أنفست ‏\"‏‏.‏ قلت نعم، فدعاني فأدخلني معه في الخميلة‏.‏ قالت وحدثتني أن النبي صلى الله عليه وسلم كان يقبلها وهو صائم، وكنت أغتسل أنا والنبي صلى الله عليه وسلم من إناء واحد من الجنابة‏.‏",
      "text_en": " Narrated Zainab bint Abi Salama:                     Um-Salama said, \"I got my menses while I was lying with the Prophet under a woolen sheet. So I slipped away, took the clothes for menses and put them on. Allah's Apostle said, 'Have you got your menses?' I replied, 'Yes.' Then he called me and took me with him under the woolen sheet.\" Um Salama further said, \"The Prophet used to kiss me while he was fasting. The Prophet and I used to take the bath of Janaba from a single pot.\"",
      "chain": [
        "35043",
        "20240",
        "11449",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "360",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى بن أبي كثير، عن عكرمة، قال سمعته  أو، كنت سألته  قال سمعت أبا هريرة، يقول أشهد أني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من صلى في ثوب واحد، فليخالف بين طرفيه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Whoever prays in a single garment must cross its ends (over the shoulders).",
      "chain": [
        "20348",
        "20240",
        "11449",
        "11023",
        "13"
      ]
    },
    {
      "hadith_no": "556",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أدرك أحدكم سجدة من صلاة العصر قبل أن تغرب الشمس فليتم صلاته، وإذا أدرك سجدة من صلاة الصبح قبل أن تطلع الشمس فليتم صلاته ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If anyone of you can get one rak`a of the `Asr prayer before sunset, he should complete his prayer. If any of you can get one rak`a of the Fajr prayer before sunrise, he should complete his prayer.\"",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "619",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن عائشة، كان النبي صلى الله عليه وسلم يصلي ركعتين خفيفتين بين النداء والإقامة من صلاة الصبح‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to offer two light rak`at between the Adhan and the Iqama of the Fajr prayer.",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "635",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن عبد الله بن أبي قتادة، عن أبيه، قال بينما نحن نصلي مع النبي صلى الله عليه وسلم إذ سمع جلبة رجال فلما صلى قال ‏\"‏ ما شأنكم ‏\"‏‏.‏ قالوا استعجلنا إلى الصلاة‏.‏ قال ‏\"‏ فلا تفعلوا، إذا أتيتم الصلاة فعليكم بالسكينة، فما أدركتم فصلوا وما فاتكم فأتموا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Abi Qatada:                     My father said, \"While we were praying with the Prophet he heard the noise of some people. After the prayer he said, 'What is the matter?' They replied 'We were hurrying for the prayer.' He said, 'Do not make haste for the prayer, and whenever you come for the prayer, you should come with calmness, and pray whatever you get (with the people) and complete the rest which you have missed.\"",
      "chain": [
        "20348",
        "20240",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "638",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن عبد الله بن أبي قتادة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أقيمت الصلاة فلا تقوموا حتى تروني وعليكم بالسكينة ‏\"‏‏.‏ تابعه علي بن المبارك‏.‏",
      "text_en": " Narrated `Abdullah bin Abi Qatada:                      My father said, \"Allah's Apostle said, 'If the Iqama is pronounced, then do not stand for the prayer till you see me (in front of you) and do it calmly.' \"",
      "chain": [
        "20348",
        "20240",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "641",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، قال سمعت أبا سلمة، يقول أخبرنا جابر بن عبد الله، أن النبي صلى الله عليه وسلم جاءه عمر بن الخطاب يوم الخندق فقال يا رسول الله، والله ما كدت أن أصلي حتى كادت الشمس تغرب، وذلك بعد ما أفطر الصائم‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ والله ما صليتها ‏\"‏ فنزل النبي صلى الله عليه وسلم إلى بطحان وأنا معه فتوضأ ثم صلى  يعني العصر  بعد ما غربت الشمس، ثم صلى بعدها المغرب‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     On the day of Al-Khandaq (the trench), `Umar bin Al-Khattab went to the Prophet and said, \"O Allah's Apostle! By Allah, I could not pray (the `Asr) till the sun had set.\" `Umar told this to the Prophet at the time when a fasting person had done Iftar (taken his meals). The Prophet then went to Buthan and I was with him. He performed ablution and offered the `Asr prayer after the sun had set and then the Maghrib prayer.",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "759",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن عبد الله بن أبي قتادة، عن أبيه، قال كان النبي صلى الله عليه وسلم يقرأ في الركعتين الأوليين من صلاة الظهر بفاتحة الكتاب وسورتين، يطول في الأولى، ويقصر في الثانية، ويسمع الآية أحيانا، وكان يقرأ في العصر بفاتحة الكتاب وسورتين، وكان يطول في الأولى، وكان يطول في الركعة الأولى من صلاة الصبح، ويقصر في الثانية‏.‏",
      "text_en": " Narrated `Abdullah bin Abi Qatada:                     My father said, \"The Prophet in Zuhr prayers used to recite Al-Fatiha along with two other Suras in the first two rak`at: a long one in the first rak`a and a shorter (Sura) in the second, and at times the verses were audible. In the `Asr prayer the Prophet used to recite Al-Fatiha and two more Suras in the first two rak`at and used to prolong the first rak`a. And he used to prolong the first rak`a of the Fajr prayer and shorten the second.",
      "chain": [
        "20348",
        "20240",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "882",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن أبي هريرة، أن عمر  رضى الله عنه  بينما هو يخطب يوم الجمعة إذ دخل رجل فقال عمر لم تحتبسون عن الصلاة فقال الرجل ما هو إلا سمعت النداء توضأت‏.‏ فقال ألم تسمعوا النبي صلى الله عليه وسلم قال ‏\"‏ إذا راح أحدكم إلى الجمعة فليغتسل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     While `Umar (bin Al-Khattab) was delivering the Khutba on a Friday, a man entered (the mosque). `Umar asked him, \"What has detained you from the prayer?\" The man said, \"It was only that when I heard the Adhan I performed ablution (for the prayer).\" On that `Umar said, \"Did you not hear the Prophet saying: 'Anyone of you going out for the Jumua prayer should take a bath'?\".",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "13",
        "3"
      ]
    },
    {
      "hadith_no": "1043",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا هاشم بن القاسم، قال حدثنا شيبان أبو معاوية، عن زياد بن علاقة، عن المغيرة بن شعبة، قال كسفت الشمس على عهد رسول الله صلى الله عليه وسلم يوم مات إبراهيم، فقال الناس كسفت الشمس لموت إبراهيم‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الشمس والقمر لا ينكسفان لموت أحد ولا لحياته، فإذا رأيتم فصلوا وادعوا الله ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     \"The sun eclipsed in the lifetime of Allah's Apostle on the day when (his son) Ibrahim died. So the people said that the sun had eclipsed because of the death of Ibrahim. Allah's Apostle said, \"The sun and the moon do not eclipse because of the death or life (i.e. birth) of someone. When you see the eclipse pray and invoke Allah.\"",
      "chain": [
        "30351",
        "20390",
        "20240",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "1051",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن عبد الله بن عمرو، أنه قال لما كسفت الشمس على عهد رسول الله صلى الله عليه وسلم نودي إن الصلاة جامعة فركع النبي صلى الله عليه وسلم ركعتين في سجدة ثم قام فركع ركعتين في سجدة، ثم جلس، ثم جلي عن الشمس‏.‏ قال وقالت عائشة  رضى الله عنها  ما سجدت سجودا قط كان أطول منها‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     When the sun eclipsed in the lifetime of Allah's Apostle and an announcement was made that the prayer was to be held in congregation. The Prophet performed two bowing in one rak`a. Then he stood up and performed two bowing in one rak`a. Then he sat down and finished the prayer; and by then the (eclipse) had cleared `Aisha said, \"I had never performed such a long prostration.\"",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "29"
      ]
    },
    {
      "hadith_no": "1094",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن محمد بن عبد الرحمن، أن جابر بن عبد الله، أخبره أن النبي صلى الله عليه وسلم كان يصلي التطوع وهو راكب في غير القبلة‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet used to offer the Nawafil, while riding, facing a direction other than that of the Qibla.",
      "chain": [
        "20348",
        "20240",
        "11449",
        "11105",
        "34"
      ]
    },
    {
      "hadith_no": "1207",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو نعيم، حدثنا شيبان، عن يحيى، عن أبي سلمة، قال حدثني معيقيب، أن النبي صلى الله عليه وسلم قال في الرجل يسوي التراب حيث يسجد قال ‏\"‏ إن كنت فاعلا فواحدة ‏\"‏‏.‏",
      "text_en": " Narrated Mu'aiqib:                     The Prophet talked about a man leveling the earth on prostrating, and said, \"If you have to do so, then do it once.\"",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "747"
      ]
    },
    {
      "hadith_no": "1330",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عبيد الله بن موسى، عن شيبان، عن هلال  هو الوزان  عن عروة، عن عائشة  رضى الله عنها  عن النبي صلى الله عليه وسلم قال في مرضه الذي مات فيه ‏\"‏ لعن الله اليهود والنصارى، اتخذوا قبور أنبيائهم مسجدا ‏\"‏‏.‏ قالت ولولا ذلك لأبرزوا قبره غير أني أخشى أن يتخذ مسجدا‏.‏",
      "text_en": " Narrated `Urwa:                     Aisha said, \"The Prophet in his fatal illness said, 'Allah cursed the Jews and the Christians because they took the graves of their Prophets as places for praying.\"' Aisha added, \"Had it not been for that, the grave of the Prophet (p.b.u.h) would have been made prominent but I am afraid it might be taken (as a) place for praying.",
      "chain": [
        "20340",
        "20240",
        "22977",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2080",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو نعيم، حدثنا شيبان، عن يحيى، عن أبي سلمة، عن أبي سعيد  رضى الله عنه  قال كنا نرزق تمر الجمع، وهو الخلط من التمر، وكنا نبيع صاعين بصاع فقال النبي صلى الله عليه وسلم ‏\"‏ لا صاعين بصاع، ولا درهمين بدرهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     We used to be given mixed dates (from the booty) and used to sell (barter) two Sas of those dates) for one Sa (of good dates). The Prophet said (to us), \"No (bartering of) two Sas for one Sa nor two Dirhams for one Dirham is permissible\", (as that is a kind of usury). (See Hadith No. 405).",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "2615",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا يونس بن محمد، حدثنا شيبان، عن قتادة، حدثنا أنس  رضى الله عنه  قال أهدي للنبي صلى الله عليه وسلم جبة سندس، وكان ينهى عن الحرير، فعجب الناس منها فقال ‏\"‏ والذي نفس محمد بيده لمناديل سعد بن معاذ في الجنة أحسن من هذا ‏\"‏‏.‏ وقال سعيد عن قتادة، عن أنس، إن أكيدر دومة أهدى إلى النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas:                     A Jubba (i.e. cloak) made of thick silken cloth was presented to the Prophet. The Prophet used to forbid people to wear silk. So, the people were pleased to see it. The Prophet said, \"By Him in Whose Hands Muhammad's soul is, the handkerchiefs of Sa`d bin Mu`adh in Paradise are better than this.\" Anas added, \"The present was sent to the Prophet by Ukaidir (a Christian) from Dauma.\"",
      "chain": [
        "30351",
        "20393",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "2625",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا أبو نعيم، حدثنا شيبان، عن يحيى، عن أبي سلمة، عن جابر  رضى الله عنه  قال قضى النبي صلى الله عليه وسلم بالعمرى أنها لمن وهبت له‏.‏",
      "text_en": " Narrated Jabir:                     The Prophet gave the verdict that `Umra is for the one to whom it is presented.",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "2781",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا محمد بن سابق، أو الفضل بن يعقوب عنه حدثنا شيبان أبو معاوية، عن فراس، قال قال الشعبي حدثني جابر بن عبد الله الأنصاري  رضى الله عنهما  أن أباه استشهد يوم أحد، وترك ست بنات، وترك عليه دينا، فلما حضر جداد النخل أتيت رسول الله صلى الله عليه وسلم فقلت يا رسول الله قد علمت أن والدي استشهد يوم أحد وترك عليه دينا كثيرا، وإني أحب أن يراك الغرماء قال ‏\"‏ اذهب فبيدر كل تمر على ناحيته ‏\"‏‏.‏ ففعلت ثم دعوته، فلما نظروا إليه أغروا بي تلك الساعة، فلما رأى ما يصنعون أطاف حول أعظمها بيدرا ثلاث مرات ثم جلس عليه ثم قال ‏\"‏ ادع أصحابك ‏\"‏‏.‏ فما زال يكيل لهم حتى أدى الله أمانة والدي، وأنا والله راض أن يؤدي الله أمانة والدي ولا أرجع إلى أخواتي بتمرة، فسلم والله البيادر كلها حتى أني أنظر إلى البيدر الذي عليه رسول الله صلى الله عليه وسلم كأنه لم ينقص تمرة واحدة‏.‏   قال أبو عبد الله أغروا بي يعني هيجوا بي  فأغرينا بينهم العداوة والبغضاء",
      "text_en": " Narrated Jabir bin `Abdullah Al-Ansari:                     My father was martyred on the day (of the Ghazwa) of Uhud and left six daughters and some debts to be paid. When the time of plucking the date-fruits came, I went to Allah's Apostle and said, \"O Allah's Apostle! you know that my father was martyred on Uhud's day and owed much debt, and I wish that the creditors would see you.\" The Prophet said, \"Go and collect the various kinds of dates and place them separately in heaps\"' I did accordingly and called him. On seeing him, the creditors started claiming their rights pressingly at that time. When the Prophet saw how they behaved, he went round the biggest heap for three times and sat over it and said, \"Call your companions (i.e. the creditors).\" Then he kept on measuring and giving them, till Allah cleared all my father's debts. By Allah, it would have pleased me that Allah would clear the debts of my father even though I had not taken a single date to my sisters. But by Allah, all the heaps were complete, (as they were) and I looked at the heap where Allah's Apostle was sitting and noticed as if not a single date had been taken thereof.",
      "chain": [
        "30209",
        "20240",
        "11385",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "2809",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن عبد الله، حدثنا حسين بن محمد أبو أحمد، حدثنا شيبان، عن قتادة، حدثنا أنس بن مالك، أن أم الربيع بنت البراء، وهى أم حارثة بن سراقة أتت النبي صلى الله عليه وسلم فقالت يا نبي الله، ألا تحدثني عن حارثة وكان قتل يوم بدر أصابه سهم غرب، فإن كان في الجنة، صبرت، وإن كان غير ذلك اجتهدت عليه في البكاء‏.‏ قال ‏\"‏ يا أم حارثة، إنها جنان في الجنة، وإن ابنك أصاب الفردوس الأعلى ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Um Ar-Rubai'bint Al-Bara', the mother of Hartha bin Suraqa came to the Prophet and said, \"O Allah's Prophet! Will you tell me about Hartha?\" Hartha has been killed (i.e. martyred) on the day of Badr with an arrow thrown by an unidentified person. She added, \"If he is in Paradise, I will be patient; otherwise, I will weep bitterly for him.\" He said, \"O mother of Hartha! There are Gardens in Paradise and your son got the Firdausal-ala (i.e. the best place in Paradise).",
      "chain": [
        "30561",
        "20384",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "2841",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن يحيى، عن أبي سلمة، أنه سمع أبا هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من أنفق زوجين في سبيل الله دعاه خزنة الجنة، كل خزنة باب أى فل هلم ‏\"‏‏.‏ قال أبو بكر يا رسول الله، ذاك الذي لا توى عليه‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إني لأرجو أن تكون منهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever spends two things in Allah's Cause, will be called by all the gate-keepers of Paradise who will be saying, 'O so-and-so! Come here.' \" Abu Bakr said, \"O Allah's Apostle! Such persons will never be destroyed.\" The Prophet said, \"I hope you will be one of them.\"",
      "chain": [
        "35043",
        "20240",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3077",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا آدم بن أبي إياس، حدثنا شيبان، عن منصور، عن مجاهد، عن طاوس، عن ابن عباس  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم يوم فتح مكة ‏\"‏ لا هجرة ولكن جهاد ونية، وإذا استنفرتم فانفروا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, on the day of the Conquest of Mecca, \"There is no migration (after the Conquest), but Jihad and good intentions, and when you are called for Jihad, you should immediately respond to the call.\"",
      "chain": [
        "20404",
        "20240",
        "11067",
        "11028",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "3216",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا آدم، حدثنا شيبان، حدثنا يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ من أنفق زوجين في سبيل الله دعته خزنة الجنة أى فل هلم ‏\"‏‏.‏ فقال أبو بكر ذاك الذي لا توى عليه‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ أرجو أن تكون منهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard the Prophet saying, \"Who ever spends a couple (of objects) in Allah's cause, will be called by the Gatekeepers of Paradise who will say, \"O so-and-so, come on!\" Abu Bakr said, \"Such a person will never perish or be miserable' The Prophet said, \"I hope you will be among such person.\"",
      "chain": [
        "20404",
        "20240",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3248",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا عبد الله بن محمد الجعفي، حدثنا يونس بن محمد، حدثنا شيبان، عن قتادة، حدثنا أنس  رضى الله عنه  قال أهدي للنبي صلى الله عليه وسلم جبة سندس، وكان ينهى عن الحرير، فعجب الناس منها، فقال ‏\"‏ والذي نفس محمد بيده، لمناديل سعد بن معاذ في الجنة أحسن من هذا ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A silken cloak was presented to the Prophet and he used to forbid the usage of silk (by men). When the people were fascinated by the cloak. he said, \"By Allah in Whose Hands the life of Muhammad is, the handkerchiefs of Sa`d bin Mu`adh in Paradise are better than this.\"",
      "chain": [
        "30351",
        "20393",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "3338",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا أبو نعيم، حدثنا شيبان، عن يحيى، عن أبي سلمة، سمعت أبا هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا أحدثكم حديثا عن الدجال ما حدث به نبي قومه، إنه أعور، وإنه يجيء معه بمثال الجنة والنار، فالتي يقول إنها الجنة‏.‏ هي النار، وإني أنذركم كما أنذر به نوح قومه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Shall I not tell you about the Dajjal a story of which no prophet told his nation? The Dajjall is one-eyed and will bring with him what will resemble Hell and Paradise, and what he will call Paradise will be actually Hell; so I warn you (against him) as Noah warned his nation against him.\"",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3680",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا يونس، حدثنا شيبان، عن قتادة، عن أنس بن مالك،‏.‏ وقال لي خليفة حدثنا يزيد بن زريع، حدثنا سعيد، عن قتادة، عن أنس بن مالك  رضى الله عنه  أنه حدثهم أن أهل مكة سألوا رسول الله صلى الله عليه وسلم أن يريهم آية، فأراهم انشقاق القمر‏.‏",
      "text_en": " Narrated Anas:                     That the Meccan people requested Allah's Apostle to show them a miracle, and so he showed them the splitting of the moon.",
      "chain": [
        "30351",
        "20475",
        "20240",
        "11019",
        "30132",
        "20304",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "3837",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن يحيى، قال أبو سلمة أخبرني أبو أسيد، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ خير الأنصار  أو قال خير دور الأنصار  بنو النجار وبنو عبد الأشهل وبنو الحارث وبنو ساعدة ‏\"‏‏.‏",
      "text_en": "",
      "chain": [
        "35043",
        "20240",
        "11449",
        "10567",
        "113"
      ]
    },
    {
      "hadith_no": "4103",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني أحمد بن أبي سريج، أخبرنا عبيد الله بن موسى، حدثنا شيبان، عن فراس، عن الشعبي، قال حدثني جابر بن عبد الله  رضى الله عنهما أن أباه، استشهد يوم أحد وترك عليه دينا، وترك ست بنات، فلما حضر جذاذ النخل قال أتيت رسول الله صلى الله عليه وسلم فقلت قد علمت أن والدي قد استشهد يوم أحد، وترك دينا كثيرا، وإني أحب أن يراك الغرماء‏.‏ فقال ‏\"‏ اذهب فبيدر كل تمر على ناحية ‏\"‏‏.‏ ففعلت ثم دعوته، فلما نظروا إليه كأنهم أغروا بي تلك الساعة، فلما رأى ما يصنعون أطاف حول أعظمها بيدرا ثلاث مرات، ثم جلس عليه، ثم قال ‏\"‏ ادع لك أصحابك ‏\"‏‏.‏ فما زال يكيل لهم حتى أدى الله عن والدي أمانته، وأنا أرضى أن يؤدي الله أمانة والدي، ولا أرجع إلى أخواتي بتمرة، فسلم الله البيادر كلها وحتى إني أنظر إلى البيدر الذي كان عليه النبي صلى الله عليه وسلم كأنها لم تنقص تمرة واحدة‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     That his father was martyred on the day of the battle of Uhud and was in debt and left six (orphan) daughters. Jabir, added, \"When the season of plucking the dates came, I went to Allah's Apostle and said, \"You know that my father was martyred on the day of Uhud, and he was heavily in debt, and I would like that the creditors should see you.\" The Prophet said, \"Go and pile every kind of dates apart.\" I did so and called him (i.e. the Prophet ). When the creditors saw him, they started claiming their debts from me then in such a harsh manner (as they had never done before). So when he saw their attitude, he went round the biggest heap of dates thrice, and then sat over it and said, 'O Jabir), call your companions (i.e. the creditors).' Then he kept on measuring (and giving) to the creditors (their due) till Allah paid all the debt of my father. I would have been satisfied to retain nothing of those dates for my sisters after Allah had paid the debts of my father. But Allah saved all the heaps (of dates), so that when I looked at the heap where the Prophet had been sitting, it seemed as if a single date had not been taken away thereof.\"",
      "chain": [
        "30298",
        "20340",
        "20240",
        "11385",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "4505",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو نعيم، حدثنا شيبان، عن يحيى، عن أبي سلمة، عن عائشة، وابن، عباس رضى الله عنهم أن النبي صلى الله عليه وسلم لبث بمكة عشر سنين ينزل عليه القرآن، وبالمدينة عشرا‏.‏",
      "text_en": " Narrated Aisha and Ibn `Abbas:                     The Prophet stayed for ten years in Mecca with the Qur'an being revealed to him and he stayed in Medina for ten years.'",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "53",
        "17"
      ]
    },
    {
      "hadith_no": "4604",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق بن إبراهيم بن عبد الرحمن أبو يعقوب، حدثنا حسين بن محمد، حدثنا شيبان، عن قتادة، حدثنا أنس، أن أبا طلحة، قال غشينا النعاس ونحن في مصافنا يوم أحد  قال  فجعل سيفي يسقط من يدي وآخذه، ويسقط وآخذه‏.‏",
      "text_en": " Narrated Abu Talha:                     Slumber overtook us during the battle of Uhud while we were in the front files. My sword would fall from my hand and I would pick it up, and again it would fall down and I would pick it up again.",
      "chain": [
        "30123",
        "20384",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "4641",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أبو نعيم، حدثنا شيبان، عن يحيى، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  قال بينا النبي صلى الله عليه وسلم يصلي العشاء إذ قال ‏\"‏ سمع الله لمن حمده ‏\"‏‏.‏ ثم قال قبل أن يسجد ‏\"‏ اللهم نج عياش بن أبي ربيعة، اللهم نج سلمة بن هشام، اللهم نج الوليد بن الوليد، اللهم نج المستضعفين من المؤمنين، اللهم اشدد وطأتك على مضر، اللهم اجعلها سنين كسني يوسف ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     While the Prophet was offering the `Isha' prayer, he said, \"Allah hears him who sends his praises to Him,\" and then said before falling in prostration, \"O Allah, save `Aiyash bin Rabi`a. O Allah, save Salama bin Hisham. O Allah, save Al-Walid bin Al-Wahd. O Allah, save the weak ones among the believers. O Allah, let Your punishment be severe on the tribe of Mudar. O Allah, inflict upon them years (of famine) like the years of Joseph.\"",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4807",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا يونس بن محمد البغدادي، حدثنا شيبان، عن قتادة، حدثنا أنس بن مالك  رضى الله عنه ‏.‏ أن رجلا، قال يا نبي الله يحشر الكافر على وجهه يوم القيامة قال ‏\"‏ أليس الذي أمشاه على الرجلين في الدنيا قادرا على أن يمشيه على وجهه يوم القيامة ‏\"‏‏.‏ قال قتادة بلى وعزة ربنا‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A man said, \"O Allah's Prophet! Will Allah gather the non-believers on their faces on the Day of Resurrection?\" He said, \"Will not the One Who made him walk on his feet in this world, be able to make him walk on his face on the Day of Resurrection?\" (Qatada, a subnarrator, said: Yes, By the Power of Our Lord!)",
      "chain": [
        "30351",
        "20393",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "4812",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن منصور، عن سعيد بن جبير، قال قال ابن أبزى سل ابن عباس عن قوله تعالى ‏{‏ومن يقتل مؤمنا متعمدا فجزاؤه جهنم‏}‏ وقوله ‏{‏لا يقتلون النفس التي حرم الله إلا بالحق‏}‏ حتى بلغ ‏{‏إلا من تاب‏}‏ فسألته فقال لما نزلت قال أهل مكة فقد عدلنا بالله وقتلنا النفس التي حرم الله إلا بالحق وأتينا الفواحش، فأنزل الله ‏{‏إلا من تاب وآمن وعمل عملا صالحا‏}‏ إلى قوله ‏{‏غفورا رحيما‏}‏",
      "text_en": " Narrated Sa`id bin Jubair:                     Ibn Abza said to me, \"Ask Ibn `Abbas regarding the Statement of Allah: 'And whoever murders a believer intentionally, his recompense is Hell.' (4.69) And also His Statement: '...nor kill such life as Allah has forbidden, except for a just cause .....except those who repent, believe, and do good deeds.' \" (25.68-70) So I asked Ibn `Abbas and he said, \"When this (25.68-69) was revealed, the people of Mecca said, \"We have invoked other gods with Allah, and we have murdered such lives which Allah has made sacred, and we have committed illegal sexual intercourse. So Allah revealed: 'Except those who repent, believe, and do good deeds and Allah is Oft-Forgiving, Most Merciful.' (25.70)",
      "chain": [
        "35043",
        "20240",
        "11067",
        "11050"
      ]
    },
    {
      "hadith_no": "4859",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا آدم، حدثنا شيبان، عن منصور، عن إبراهيم، عن عبيدة، عن عبد الله  رضى الله عنه  قال جاء حبر من الأحبار إلى رسول الله صلى الله عليه وسلم فقال يا محمد، إنا نجد أن الله يجعل السموات على إصبع والأرضين على إصبع، والشجر على إصبع، والماء والثرى على إصبع، وسائر الخلائق على إصبع، فيقول أنا الملك‏.‏ فضحك النبي صلى الله عليه وسلم حتى بدت نواجذه تصديقا لقول الحبر ثم قرأ رسول الله صلى الله عليه وسلم ‏{‏وما قدروا الله حق قدره والأرض جميعا قبضته يوم القيامة والسموات مطويات بيمينه سبحانه وتعالى عما يشركون‏}‏",
      "text_en": " Narrated `Abdullah:                     A (Jewish) Rabbi came to Allah's Apostle and he said, \"O Muhammad! We learn that Allah will put all the heavens on one finger, and the earths on one finger, and the trees on one finger, and the water and the dust on one finger, and all the other created beings on one finger. Then He will say, 'I am the King.' Thereupon the Prophet smiled so that his pre-molar teeth became visible, and that was the confirmation of the Rabbi. Then Allah's Apostle recited: 'No just estimate have they made of Allah such as due to Him.' (39.67)",
      "chain": [
        "20404",
        "20240",
        "11067",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "4916",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا يونس بن محمد، حدثنا شيبان، عن قتادة، عن أنس  رضى الله عنه  قال سأل أهل مكة أن يريهم آية فأراهم انشقاق القمر‏.‏",
      "text_en": " Narrated Anas:                     The people of Mecca asked the Prophet to show them a sign (miracle). So he showed them (the miracle) of the cleaving of the moon.",
      "chain": [
        "30351",
        "20393",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "4958",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن يحيى، قال أخبرني أبو سلمة، قال جاء رجل إلى ابن عباس وأبو هريرة جالس عنده فقال أفتني في امرأة ولدت بعد زوجها بأربعين ليلة‏.‏ فقال ابن عباس آخر الأجلين‏.‏ قلت أنا ‏{‏وأولات الأحمال أجلهن أن يضعن حملهن‏}‏ قال أبو هريرة أنا مع ابن أخي  يعني أبا سلمة  فأرسل ابن عباس غلامه كريبا إلى أم سلمة يسألها فقالت قتل زوج سبيعة الأسلمية وهى حبلى، فوضعت بعد موته بأربعين ليلة فخطبت فأنكحها رسول الله صلى الله عليه وسلم وكان أبو السنابل فيمن خطبها‏.‏",
      "text_en": " Narrated Abu Salama:                     A man came to Ibn `Abbas while Abu Huraira was sitting with him and said, \"Give me your verdict regarding a lady who delivered a baby forty days after the death of her husband.\" Ibn `Abbas said, \"This indicates the end of one of the two prescribed periods.\" I said \"For those who are pregnant, their prescribed period is until they deliver their burdens.\" Abu Huraira said, I agree with my cousin (Abu Salama).\" Then Ibn `Abbas sent his slave, Kuraib to Um Salama to ask her (regarding this matter). She replied. \"The husband of Subai'a al Aslamiya was killed while she was pregnant, and she delivered a baby forty days after his death. Then her hand was asked in marriage and Allah's Apostle married her (to somebody). Abu As-Sanabil was one of those who asked for her hand in marriage\".",
      "chain": [
        "35043",
        "20240",
        "11449",
        "10567"
      ]
    },
    {
      "hadith_no": "5016",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا آدم، حدثنا شيبان، حدثنا قتادة، عن أنس  رضى الله عنه  قال لما عرج بالنبي صلى الله عليه وسلم إلى السماء قال ‏\"‏ أتيت على نهر حافتاه قباب اللؤلؤ مجوفا فقلت ما هذا يا جبريل قال هذا الكوثر ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     When the Prophet was made to ascend to the Heavens, he said (after his return), \"I came upon a river the banks of which were made of tents of hollow pearls. I asked Gabriel. What is this (river?' He replied, 'This is the Kauthar.'",
      "chain": [
        "20404",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "5030",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا عبيد الله بن موسى، عن شيبان، عن يحيى، عن أبي سلمة، قال أخبرتني عائشة، وابن، عباس رضى الله عنهم قالا لبث النبي صلى الله عليه وسلم بمكة عشر سنين ينزل عليه القرآن وبالمدينة عشرا‏.‏",
      "text_en": " Narrated `Aisha and Ibn `Abbas:                     The Prophet remained in Mecca for ten years, during which the Qur'an used to be revealed to him; and he stayed in Medina for ten years.",
      "chain": [
        "20340",
        "20240",
        "11449",
        "10567",
        "53",
        "17"
      ]
    },
    {
      "hadith_no": "5108",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن يحيى، عن محمد بن عبد الرحمن، عن أبي سلمة، عن عبد الله بن عمرو، قال لي النبي صلى الله عليه وسلم ‏\"‏ في كم تقرأ القرآن ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     The Prophet asked me, \"How long does it take you to finish the recitation of the whole Qur'an?\"",
      "chain": [
        "35043",
        "20240",
        "11449",
        "11105",
        "10567",
        "29"
      ]
    },
    {
      "hadith_no": "5109",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثني إسحاق، أخبرنا عبيد الله، عن شيبان، عن يحيى، عن محمد بن عبد الرحمن، مولى بني زهرة عن أبي سلمة  قال وأحسبني قال  سمعت أنا من أبي سلمة، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اقرإ القرآن في شهر ‏\"‏‏.‏ قلت إني أجد قوة حتى قال ‏\"‏ فاقرأه في سبع ولا تزد على ذلك ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     Allah's Apostle said to me, \"Recite the whole Qur'an in one month's time.\" I said, \"But I have power (to do more than that).\" Allah's Apostle said, \"Then finish the recitation of the Qur'an in seven days, and do not finish it in less than this period.\"",
      "chain": [
        "30021",
        "11201",
        "20240",
        "11449",
        "10960",
        "10567",
        "29"
      ]
    },
    {
      "hadith_no": "5220",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن منصور، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس، قال قال النبي صلى الله عليه وسلم ‏\"‏ أما لو أن أحدهم يقول حين يأتي أهله باسم الله، اللهم جنبني الشيطان، وجنب الشيطان ما رزقتنا، ثم قدر بينهما في ذلك، أو قضي ولد، لم يضره شيطان أبدا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"If anyone of you, when having sexual intercourse with his wife, says: Bismillah, Allahumma jannibni-Sh-Shaitan wa jannib-ish-Shaitan ma razaqtana, and if it is destined that they should have a child, then Satan will never be able to harm him.\"",
      "chain": [
        "35043",
        "20240",
        "11067",
        "11342",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "5690",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا أبو نعيم، حدثنا شيبان، عن يحيى، عن عبد الله بن أبي قتادة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا شرب أحدكم فلا يتنفس في الإناء، وإذا بال أحدكم فلا يمسح ذكره بيمينه، وإذا تمسح أحدكم فلا يتمسح بيمينه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Qatada:                     Allah's Apostle said, \"When you drink (water), do not breath in the vessel; and when you urinate, do not touch your penis with your right hand. And when you cleanse yourself after defecation, do not use your right hand.\"",
      "chain": [
        "20348",
        "20240",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "6041",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن منصور، عن المسيب، عن وراد، عن المغيرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله حرم عليكم عقوق الأمهات، ومنع وهات، ووأد البنات، وكره لكم قيل وقال، وكثرة السؤال، وإضاعة المال ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira:                     The Prophet said, \"Allah has forbidden you ( 1 ) to be undutiful to your mothers (2) to withhold (what you should give) or (3) demand (what you do not deserve), and (4) to bury your daughters alive. And Allah has disliked that (A) you talk too much about others ( B), ask too many questions (in religion), or (C) waste your property.\"",
      "chain": [
        "35043",
        "20240",
        "11067",
        "11402",
        "166"
      ]
    },
    {
      "hadith_no": "6509",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن يحيى، عن محمد بن إبراهيم القرشي، قال أخبرني معاذ بن عبد الرحمن، أن ابن أبان، أخبره قال أتيت عثمان بطهور وهو جالس على المقاعد، فتوضأ فأحسن الوضوء ثم قال رأيت النبي صلى الله عليه وسلم توضأ وهو في هذا المجلس، فأحسن الوضوء ثم قال ‏\"‏ من توضأ مثل هذا الوضوء، ثم أتى المسجد فركع ركعتين، ثم جلس، غفر له ما تقدم من ذنبه ‏\"‏‏.‏ قال وقال النبي صلى الله عليه وسلم ‏\"‏ لا تغتروا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I brought water to `Uthman bin `Affan to perform the ablution while he was sitting on his seat. He performed the ablution in a perfect way and said, \"I saw the Prophet performing the ablution in this place and he performed it in a perfect way and said, \"Whoever performs the ablution as I have done this time and then proceeds to the mosque and offers a two-rak`at prayer and then sits there (waiting for the compulsory congregational prayers), then all his past sins will be forgiven.\" The Prophet further added, \"Do not be conceited (thinking that your sins will be forgiven because of your prayer).",
      "chain": [
        "35043",
        "20240",
        "11449",
        "11213",
        "2706"
      ]
    },
    {
      "hadith_no": "6602",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا يونس بن محمد البغدادي، حدثنا شيبان، عن قتادة، حدثنا أنس بن مالك  رضى الله عنه أن رجلا، قال يا نبي الله كيف يحشر الكافر على وجهه قال ‏\"‏ أليس الذي أمشاه على الرجلين في الدنيا قادرا على أن يمشيه على وجهه يوم القيامة ‏\"‏‏.‏ قال قتادة بلى وعزة ربنا‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A man said, \"O Allah's Prophet! Will a Kafir (disbeliever) be gathered (driven prone) on his face?\" The Prophet said, \"Is not He Who made him walk with his legs in this world, able to make him walk on his face on the Day of Resurrection?\" (Qatada, a sub-narrator said: Yes, (He can), by the Power of Our Lord!\")",
      "chain": [
        "30351",
        "20393",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6739",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن منصور، عن إبراهيم، عن عبيدة، عن عبد الله، قال سئل النبي صلى الله عليه وسلم أى الناس خير قال ‏\"‏ قرني، ثم الذين يلونهم، ثم الذين يلونهم، ثم يجيء قوم تسبق شهادة أحدهم يمينه، ويمينه شهادته ‏\"‏‏.‏ قال إبراهيم وكان أصحابنا ينهونا ونحن غلمان أن نحلف بالشهادة والعهد‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet was asked, \"Who are the best people?\" He replied: The people of my generation, and then those who will follow (come after) them, and then those who will come after the later; after that there will come some people whose witness will precede their oaths and their oaths will go ahead of their witness.\" Ibrahim (a sub-narrator) said, \"When we were young, our elder friends used to prohibit us from taking oaths by saying, 'I bear witness swearing by Allah, or by Allah's Covenant.\"'",
      "chain": [
        "35043",
        "20240",
        "11067",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "6742",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا آدم، حدثنا شيبان، حدثنا قتادة، عن أنس بن مالك، قال النبي صلى الله عليه وسلم ‏\"‏ لا تزال جهنم تقول هل من مزيد حتى يضع رب العزة فيها قدمه فتقول قط قط وعزتك‏.‏ ويزوى بعضها إلى بعض ‏\"‏‏.‏ رواه شعبة عن قتادة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"The Hell Fire will keep on saying: 'Are there anymore (people to come)?' Till the Lord of Power and Honor will put His Foot over it and then it will say, 'Qat! Qat! (sufficient! sufficient!) by Your Power and Honor. And its various sides will come close to each other (i.e., it will contract). \"",
      "chain": [
        "20404",
        "20240",
        "11019",
        "19"
      ]
    }
  ],
  "total_hadiths": 156
}