{
  "id": "20246",
  "name": "'Abdul A'ala bin 'Abdul A'ala al-Sami عبد الأعلى بن عبد الأعلى البصري السامي",
  "full_name": "'Abdul A'ala bin 'Abdul A'ala al-Sami عبد الأعلى بن عبد الأعلى البصري السامي",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "189",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "B.Sama",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11314",
      "name": "Yahya bin Abi Ishaq يحيى بن أبي إسحاق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11585",
      "name": "Da'ud bin Abi Hnd داود بن أبي هند",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11282",
      "name": "Khalid bin Mahran al-Hadha' خالد بن مهران الحذاء",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11286",
      "name": "Sa'id bin Iyas al-Jariri سعيد بن إياس الجريري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11073",
      "name": "Sa'id bin Abi 'Aruba سعيد بن أبي عروبة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11220",
      "name": "Muhammad bin 'Amr bin 'Alqama محمد بن عمرو بن علقمة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20115",
      "name": "Ma'mar bin Rashid معمر بن راشد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11311",
      "name": "Hisham bin Hassan al-Azdi هشام بن حسان الأزدي القردوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20295",
      "name": "Hisham bin Abi 'Abdullah al-Dastawa'i هشام بن أبي عبد الله الدستوائي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30153",
      "name": "'Amr bin 'Ali bin Bahr al-Bahli عمرو بن علي بن بحر الباهلي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30309",
      "name": "Ibrahim bin Musa al-Razi al-Fara' إبراهيم بن موسى الرازي الفراء",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30024",
      "name": "'Ubaidullah bin 'Umar al-Qawariri عبيد الله بن عمر القواريري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30456",
      "name": "Malik bin Abd al-Wahd مالك بن عبد الواحد أبو غسان المسمعي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30160",
      "name": "Muhammad bin Bashar Bindar محمد بن بشار بندار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20720",
      "name": "Nasr bin 'Ali bin Asbahan نصر بن علي الجهضمي الكبير",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "30573",
      "name": "Yusuf bin Hmad يوسف بن حماد",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "285",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عياش، قال حدثنا عبد الأعلى، حدثنا حميد، عن بكر، عن أبي رافع، عن أبي هريرة، قال لقيني رسول الله صلى الله عليه وسلم وأنا جنب، فأخذ بيدي، فمشيت معه حتى قعد فانسللت، فأتيت الرحل، فاغتسلت ثم جئت وهو قاعد فقال ‏\"‏ أين كنت يا أبا هر ‏\"‏ فقلت له‏.‏ فقال ‏\"‏ سبحان الله يا أبا هر إن المؤمن لا ينجس ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle came across me and I was Junub He took my hand and I went along with him till he sat down I slipped away, went home and took a bath. When I came back. he was still sitting there. He then said to me, \"O Abu Huraira! Where have you been?' I told him about it The Prophet said, \"Subhan Allah! O Abu Huraira! A believer never becomes impure.\"",
      "chain": [
        "30157",
        "20246",
        "11279",
        "11267",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "643",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عياش بن الوليد، قال حدثنا عبد الأعلى، قال حدثنا حميد، قال سألت ثابتا البناني عن الرجل، يتكلم بعد ما تقام الصلاة فحدثني عن أنس بن مالك، قال أقيمت الصلاة فعرض للنبي صلى الله عليه وسلم رجل فحبسه بعد ما أقيمت الصلاة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Once Iqama was pronounced a man came to the Prophet and detained him (from the prayer).",
      "chain": [
        "30157",
        "20246",
        "11279",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "739",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عياش، قال حدثنا عبد الأعلى، قال حدثنا عبيد الله، عن نافع، أن ابن عمر، كان إذا دخل في الصلاة كبر ورفع يديه، وإذا ركع رفع يديه، وإذا قال سمع الله لمن حمده‏.‏ رفع يديه، وإذا قام من الركعتين رفع يديه‏.‏ ورفع ذلك ابن عمر إلى نبي الله صلى الله عليه وسلم‏.‏ رواه حماد بن سلمة عن أيوب عن نافع عن ابن عمر عن النبي صلى الله عليه وسلم‏.‏ ورواه ابن طهمان عن أيوب وموسى بن عقبة مختصرا‏.‏",
      "text_en": " Narrated Nafi`:                     Whenever Ibn `Umar started the prayer with Takbir, he used to raise his hands: whenever he bowed, he used to raise his hands (before bowing) and also used to raise his hands on saying, \"Sami`a l-lahu liman hamidah\", and he used to do the same on rising from the second rak`a (for the 3rd rak`a). Ibn `Umar said: \"The Prophet used to do the same.\"",
      "chain": [
        "30157",
        "20246",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1093",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا علي بن عبد الله، قال حدثنا عبد الأعلى، قال حدثنا معمر، عن الزهري، عن عبد الله بن عامر، عن أبيه، قال رأيت النبي صلى الله عليه وسلم يصلي على راحلته حيث توجهت به‏.‏",
      "text_en": " Narrated `Abdullah bin 'Amir from his father who said:                     I saw the Prophet (p.b.u.h) offering the prayer on his mount (Rahila) whatever direction it took.",
      "chain": [
        "30026",
        "20246",
        "20115",
        "11013",
        "18572"
      ]
    },
    {
      "hadith_no": "1338",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عياش، حدثنا عبد الأعلى، حدثنا سعيد، قال وقال لي خليفة حدثنا ابن زريع، حدثنا سعيد، عن قتادة، عن أنس  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ العبد إذا وضع في قبره، وتولي وذهب أصحابه حتى إنه ليسمع قرع نعالهم، أتاه ملكان فأقعداه فيقولان له ما كنت تقول في هذا الرجل محمد صلى الله عليه وسلم فيقول أشهد أنه عبد الله ورسوله‏.‏ فيقال انظر إلى مقعدك من النار، أبدلك الله به مقعدا من الجنة  قال النبي صلى الله عليه وسلم فيراهما جميعا  وأما الكافر  أو المنافق  فيقول لا أدري، كنت أقول ما يقول الناس‏.‏ فيقال لا دريت ولا تليت‏.‏ ثم يضرب بمطرقة من حديد ضربة بين أذنيه، فيصيح صيحة يسمعها من يليه إلا الثقلين ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"When a human being is laid in his grave and his companions return and he even hears their foot steps, two angels come to him and make him sit and ask him: What did you use to say about this man, Muhammad ? He will say: I testify that he is Allah's slave and His Apostle. Then it will be said to him, 'Look at your place in the Hell-Fire. Allah has given you a place in Paradise instead of it.' \" The Prophet added, \"The dead person will see both his places. But a non-believer or a hypocrite will say to the angels, 'I do not know, but I used to say what the people used to say! It will be said to him, 'Neither did you know nor did you take the guidance (by reciting the Qur'an).' Then he will be hit with an iron hammer between his two ears, and he will cry and that cry will be heard by whatever approaches him except human beings and jinns.\"",
      "chain": [
        "30157",
        "20246",
        "11168",
        "30132",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1374",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عياش بن الوليد، حدثنا عبد الأعلى، حدثنا سعيد، عن قتادة، عن أنس بن مالك  رضى الله عنه  أنه حدثهم أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن العبد إذا وضع في قبره، وتولى عنه أصحابه، وإنه ليسمع قرع نعالهم، أتاه ملكان فيقعدانه فيقولان ما كنت تقول في الرجل لمحمد صلى الله عليه وسلم‏.‏ فأما المؤمن فيقول أشهد أنه عبد الله ورسوله‏.‏ فيقال له انظر إلى مقعدك من النار، قد أبدلك الله به مقعدا من الجنة، فيراهما جميعا ‏\"‏‏.‏ قال قتادة وذكر لنا أنه يفسح في قبره‏.‏ ثم رجع إلى حديث أنس قال ‏\"‏ وأما المنافق والكافر فيقال له ما كنت تقول في هذا الرجل فيقول لا أدري، كنت أقول ما يقول الناس‏.‏ فيقال لا دريت ولا تليت‏.‏ ويضرب بمطارق من حديد ضربة، فيصيح صيحة يسمعها من يليه، غير الثقلين ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle said, \"When (Allah's) slave is put in his grave and his companions return and he even hears their footsteps, two angels come to him and make him sit and ask, 'What did you use to say about this man (i.e. Muhammad)?' The faithful Believer will say, 'I testify that he is Allah's slave and His Apostle.' Then they will say to him, 'Look at your place in the Hell Fire; Allah has given you a place in Paradise instead of it.' So he will see both his places.\" (Qatada said, \"We were informed that his grave would be made spacious.\" Then Qatada went back to the narration of Anas who said;) Whereas a hypocrite or a non-believer will be asked, \"What did you use to say about this man.\" He will reply, \"I do not know; but I used to say what the people used to say.\" So they will say to him, \"Neither did you know nor did you take the guidance (by reciting the Qur'an).\" Then he will be hit with iron hammers once, that he will send such a cry as everything near to him will hear, except Jinns and human beings. (See Hadith No. 422).",
      "chain": [
        "30157",
        "20246",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1427",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عياش، حدثنا عبد الأعلى، حدثنا الجريري، عن أبي العلاء، عن الأحنف بن قيس، قال جلست‏.‏ وحدثني إسحاق بن منصور، أخبرنا عبد الصمد، قال حدثني أبي، حدثنا الجريري، حدثنا أبو العلاء بن الشخير، أن الأحنف بن قيس، حدثهم قال جلست إلى ملإ من قريش، فجاء رجل خشن الشعر والثياب والهيئة حتى قام عليهم فسلم ثم قال بشر الكانزين برضف يحمى عليه في نار جهنم، ثم يوضع على حلمة ثدى أحدهم حتى يخرج من نغض كتفه، ويوضع على نغض كتفه حتى يخرج من حلمة ثديه يتزلزل، ثم ولى فجلس إلى سارية، وتبعته وجلست إليه، وأنا لا أدري من هو فقلت له لا أرى القوم إلا قد كرهوا الذي قلت‏.‏ قال إنهم لا يعقلون شيئا‏.‏ قال لي خليلي  قال قلت من خليلك قال النبي صلى الله عليه وسلم  ‏\"‏ يا أبا ذر أتبصر أحدا ‏\"‏‏.‏ قال فنظرت إلى الشمس ما بقي من النهار وأنا أرى أن رسول الله صلى الله عليه وسلم يرسلني في حاجة له، قلت نعم‏.‏ قال ‏\"‏ ما أحب أن لي مثل أحد ذهبا أنفقه كله إلا ثلاثة دنانير ‏\"‏‏.‏ وإن هؤلاء لا يعقلون، إنما يجمعون الدنيا‏.‏ لا والله لا أسألهم دنيا، ولا أستفتيهم عن دين حتى ألقى الله‏.‏",
      "text_en": " Narrated Al-Ahnaf bin Qais:                     While I was sitting with some people from Quraish, a man with very rough hair, clothes, and appearance came and stood in front of us, greeted us and said, \"Inform those who hoard wealth, that a stone will be heated in the Hell-fire and will be put on the nipples of their breasts till it comes out from the bones of their shoulders and then put on the bones of their shoulders till it comes through the nipples of their breasts the stone will be moving and hitting.\" After saying that, the person retreated and sat by the side of the pillar, I followed him and sat beside him, and I did not know who he was. I said to him, \"I think the people disliked what you had said.\" He said, \"These people do not understand anything, although my friend told me.\" I asked, \"Who is your friend?\" He said, \"The Prophet said (to me), 'O Abu Dhar! Do you see the mountain of Uhud?' And on that I (Abu Dhar) started looking towards the sun to judge how much remained of the day as I thought that Allah's Apostle wanted to send me to do something for him and I said, 'Yes!' He said, 'I do not love to have gold equal to the mountain of Uhud unless I spend it all (in Allah's cause) except three Dinars (pounds). These people do not understand and collect worldly wealth. No, by Allah, Neither I ask them for worldly benefits nor am I in need of their religious advice till I meet Allah, The Honorable, The Majestic.\" '",
      "chain": [
        "30157",
        "20246",
        "11286",
        "11112",
        "30313",
        "20250",
        "20258",
        "11286",
        "11318",
        "11112"
      ]
    },
    {
      "hadith_no": "1730",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد، أخبرنا عبد الأعلى بن عبد الأعلى، عن معمر، عن يحيى بن أبي كثير، عن عكرمة، عن أبي هريرة  رضى الله عنه  أن نبي الله صلى الله عليه وسلم رأى رجلا يسوق بدنة، قال ‏\"‏ اركبها ‏\"‏‏.‏ قال إنها بدنة‏.‏ قال ‏\"‏ اركبها ‏\"‏‏.‏ قال فلقد رأيته راكبها يساير النبي صلى الله عليه وسلم والنعل في عنقها‏.‏تابعه محمد بن بشار حدثنا عثمان بن عمر، أخبرنا علي بن المبارك، عن يحيى، عن عكرمة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Ikrima:                     Abu Huraira said, \"The Prophet saw a man driving a Badana (sacrificial camel). The Prophet (p.b.u.h) said (to him), 'Ride on it.' He replied, 'It is a Badana.' The Prophet again said, 'Ride on it!' Abu Huraira added, 'Then I saw that man riding it, showing obedience to the Prophet (p.b.u.h), and a shoe was (hanging) from its neck.' \"Narrated Abu Huraira:From the Prophet: (as above).",
      "chain": [
        "30213",
        "20246",
        "20115",
        "11449",
        "11023",
        "13"
      ]
    },
    {
      "hadith_no": "1750",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الأعلى، حدثنا خالد، عن عكرمة، عن ابن عباس  رضى الله عنهما  قال سئل النبي صلى الله عليه وسلم فقال رميت بعد ما أمسيت‏.‏ فقال ‏\"‏ لا حرج ‏\"‏‏.‏ قال حلقت قبل أن أنحر‏.‏ قال ‏\"‏ لا حرج ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet was asked by a man who said, \"I have done the Rami in the evening.\" The Prophet replied, \"There is no harm in it.\" Another man asked, \"I had my head shaved before the slaughtering.\" The Prophet replied, \"There is no harm in it.\"",
      "chain": [
        "30170",
        "20246",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1949",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عياش، حدثنا عبد الأعلى، حدثنا عبيد الله، عن نافع، عن ابن عمر  رضى الله عنهما  قرأ فدية طعام مساكين‏.‏ قال هي منسوخة‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar recited the verse: \"They had a choice either to fast or to feed a poor person for every day, and said that the order of this Verse was canceled.",
      "chain": [
        "30157",
        "20246",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2147",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عياش بن الوليد، حدثنا عبد الأعلى، حدثنا معمر، عن الزهري، عن عطاء بن يزيد، عن أبي سعيد  رضى الله عنه  قال نهى النبي صلى الله عليه وسلم عن لبستين وعن بيعتين الملامسة والمنابذة‏.‏",
      "text_en": " Narrated Abu Sa`id:                     The Prophet forbade two kinds of dresses and two kinds of sale, i.e., Mulamasa and Munabadha.",
      "chain": [
        "30157",
        "20246",
        "20115",
        "11013",
        "11206",
        "38"
      ]
    },
    {
      "hadith_no": "2163",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثني عياش بن الوليد، حدثنا عبد الأعلى، حدثنا معمر، عن ابن طاوس، عن أبيه، قال سألت ابن عباس  رضى الله عنهما  ما معنى قوله ‏\"‏ لا يبيعن حاضر لباد ‏\"‏‏.‏ فقال لا يكن له سمسارا‏.‏",
      "text_en": " Narrated Tawus:                     I asked Ibn `Abbas, \"What is the meaning of, 'No town dweller should sell (or buy) for a desert dweller'?\" Ibn `Abbas said, \"It means he should not become his broker.\"",
      "chain": [
        "30157",
        "20246",
        "20115",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2400",
      "source": " Sahih Bukhari ",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا عبد الأعلى، عن معمر، عن همام بن منبه، أخي وهب بن منبه أنه سمع أبا هريرة  رضى الله عنه  يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ مطل الغني ظلم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Procrastination (delay) in repaying debts by a wealthy person is injustice.\"",
      "chain": [
        "30175",
        "20246",
        "20115",
        "11447",
        "13"
      ]
    },
    {
      "hadith_no": "3318",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا نصر بن علي، أخبرنا عبد الأعلى، حدثنا عبيد الله بن عمر، عن نافع، عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ دخلت امرأة النار في هرة ربطتها، فلم تطعمها، ولم تدعها تأكل من خشاش الأرض ‏\"‏‏.‏ قال وحدثنا عبيد الله عن سعيد المقبري عن أبي هريرة عن النبي صلى الله عليه وسلم مثله‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"A woman entered the (Hell) Fire because of a cat which she had tied, neither giving it food nor setting it free to eat from the vermin of the earth. \"",
      "chain": [
        "30395",
        "20246",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3789",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا عمرو بن علي، حدثنا عبد الأعلى، حدثنا خالد، عن أبي قلابة، قال حدثني أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن لكل أمة أمينا، وإن أميننا أيتها الأمة أبو عبيدة بن الجراح ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle said, \" Every nation has an extremely trustworthy man, and the trustworthy man of this (i.e. Muslim) nation is Abu 'Ubaida bin Al-Jarrah.\"",
      "chain": [
        "30153",
        "20246",
        "11282",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "4322",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عياش بن الوليد، حدثنا عبد الأعلى، حدثنا خالد، عن عكرمة، عن ابن عباس، قال خرج النبي صلى الله عليه وسلم في رمضان إلى حنين، والناس مختلفون فصائم ومفطر، فلما استوى على راحلته دعا بإناء من لبن أو ماء، فوضعه على راحته أو على راحلته، ثم نظر إلى الناس فقال المفطرون للصوام أفطروا‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle set out towards Hunain in the month of Ramadan and some of the people were fasting while some others were not fasting, and when the Prophet mounted his she-camel, he asked for a tumbler of milk or water and put it on the palm of his hand or on his she-camel and then the people looked at him; and those who were not fasting told those who were fasting, to break their fast (i.e. as the Prophet had done so). Ibn `Abbas added, \"The Prophet went (to Hunain) in the year of the Conquest (of Mecca).",
      "chain": [
        "30157",
        "20246",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4547",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عياش بن الوليد، حدثنا عبد الأعلى، حدثنا عبيد الله، عن نافع، عن ابن عمر  رضى الله عنهما  أنه قرأ ‏{‏فدية طعام مساكين‏}‏ قال هي منسوخة‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar recited: \"They had a choice, either fast or feed a poor for every day..\" and added, \"This Verse is abrogated.\"",
      "chain": [
        "30157",
        "20246",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5385",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "وحدثني محمد بن المثنى، حدثنا عبد الأعلى، حدثنا سعيد، عن قتادة، حدثنا الحسن، أن معقل بن يسار، كانت أخته تحت رجل فطلقها، ثم خلى عنها حتى انقضت عدتها، ثم خطبها فحمي معقل من ذلك أنفا فقال خلى عنها وهو يقدر عليها، ثم يخطبها فحال بينه وبينها، فأنزل الله ‏{‏وإذا طلقتم النساء فبلغن أجلهن فلا تعضلوهن‏}‏ إلى آخر الآية، فدعاه رسول الله صلى الله عليه وسلم فقرأ عليه، فترك الحمية واستقاد لأمر الله‏.‏",
      "text_en": " Narrated Al-Hasan:                     The sister of Ma'qil bin Yasar was married to a man and then that man divorced her and remained away from her till her period of the 'Iddah expired. Then he demanded for her hand in marriage, but Ma'qil got angry out of pride and haughtiness and said, \"He kept away from her when he could still retain her, and now he demands her hand again?\" So Ma'qil disagreed to remarry her to him. Then Allah revealed: 'When you have divorced women and they have fulfilled the term of their prescribed period, do not prevent them from marrying their (former) husbands.' (2.232) So the Prophet sent for Ma'qil and recited to him (Allah's order) and consequently Ma'qil gave up his pride and haughtiness and yielded to Allah's order.",
      "chain": [
        "30170",
        "20246",
        "11168",
        "11019",
        "11016"
      ]
    },
    {
      "hadith_no": "5543",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "وقال عبد الأعلى عن داود، عن عامر، عن عدي، أنه قال للنبي صلى الله عليه وسلم، يرمي الصيد فيقتفر أثره اليومين والثلاثة، ثم يجده ميتا وفيه سهمه قال ‏\"‏ يأكل إن شاء ‏\"‏‏.‏",
      "text_en": "",
      "chain": [
        "20246",
        "11052",
        "11372"
      ]
    },
    {
      "hadith_no": "5746",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا عياش بن الوليد، حدثنا عبد الأعلى، حدثنا سعيد، عن قتادة، عن أبي المتوكل، عن أبي سعيد، أن رجلا، أتى النبي صلى الله عليه وسلم فقال أخي يشتكي بطنه‏.‏ فقال ‏\"‏ اسقه عسلا ‏\"‏‏.‏ ثم أتى الثانية فقال ‏\"‏ اسقه عسلا ‏\"‏‏.‏ ثم أتاه فقال فعلت‏.‏ فقال ‏\"‏ صدق الله، وكذب بطن أخيك، اسقه عسلا ‏\"‏‏.‏ فسقاه فبرأ‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     A man came to the Prophet and said, \"My brother has some Abdominal trouble.\" The Prophet said to him \"Let him drink honey.\" The man came for the second time and the Prophet said to him, 'Let him drink honey.\" He came for the third time and the Prophet said, \"Let him drink honey.\" He returned again and said, \"I have done that ' The Prophet then said, \"Allah has said the truth, but your brother's `Abdomen has told a lie. Let him drink honey.\" So he made him drink honey and he was cured.",
      "chain": [
        "30157",
        "20246",
        "11168",
        "11019",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "5844",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني محمد، أخبرنا عبد الأعلى، عن يونس، عن الحسن، عن أبي بكرة  رضى الله عنه  قال خسفت الشمس ونحن عند النبي صلى الله عليه وسلم فقام يجر ثوبه مستعجلا، حتى أتى المسجد وثاب الناس فصلى ركعتين، فجلي عنها، ثم أقبل علينا وقال ‏\"‏ إن الشمس والقمر آيتان من آيات الله، فإذا رأيتم منها شيئا فصلوا وادعوا الله حتى يكشفها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     The solar eclipse occurred while we were sitting with the Prophet He got up dragging his garment (on the ground) hurriedly till he reached the mosque The people turned (to the mosque) and he offered a two-rak`at prayer whereupon the eclipse was over and he traced us and said, \"The sun and the moon are two signs among the signs of Allah, so if you see a thing like this (eclipse) then offer the prayer and invoke Allah till He remove that state.\"",
      "chain": [
        "30213",
        "20246",
        "20475",
        "11016",
        "3229"
      ]
    },
    {
      "hadith_no": "5933",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا عبد الأعلى، حدثنا يزيد بن زريع، حدثنا سعيد، عن قتادة، عن أنس بن مالك  رضى الله عنه  أن نبي الله صلى الله عليه وسلم أراد أن يكتب إلى رهط أو أناس من الأعاجم، فقيل له إنهم لا يقبلون كتابا إلا عليه خاتم، فاتخذ النبي صلى الله عليه وسلم خاتما من فضة نقشه محمد رسول الله فكأني بوبيص أو ببصيص الخاتم في إصبع النبي صلى الله عليه وسلم أو في كفه‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle wanted to write a letter to a group of people or some non-Arabs. It was said to him, \"They do not accept any letter unless it is stamped.\" So the Prophet had a silver ring made for himself, and on it was engraved: 'Muhammad, the Apostle of Allah'. .. as if I am now looking at the glitter of the ring on the finger (or in the palm) of the Prophet .",
      "chain": [
        "20246",
        "20304",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6029",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا عياش بن الوليد، حدثنا عبد الأعلى، حدثنا سعيد، قال سمعت النضر بن أنس بن مالك، يحدث قتادة قال كنت عند ابن عباس وهم يسألونه ولا يذكر النبي صلى الله عليه وسلم حتى سئل فقال سمعت محمدا صلى الله عليه وسلم يقول ‏\"‏ من صور صورة في الدنيا كلف يوم القيامة أن ينفخ فيها الروح، وليس بنافخ ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I heard Muhammad saying, \"Whoever makes a picture in this world will be asked to put life into it on the Day of Resurrection, but he will not be able to do so.\"",
      "chain": [
        "30157",
        "20246",
        "11168",
        "11310",
        "11019"
      ]
    },
    {
      "hadith_no": "6210",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عياش بن الوليد، حدثنا عبد الأعلى، حدثنا سعيد الجريري، عن أبي عثمان، عن عبد الرحمن بن أبي بكر  رضى الله عنهما أن أبا بكر، تضيف رهطا فقال لعبد الرحمن دونك أضيافك فإني منطلق إلى النبي صلى الله عليه وسلم فافرغ من قراهم قبل أن أجيء‏.‏ فانطلق عبد الرحمن فأتاهم بما عنده فقال اطعموا‏.‏ فقالوا أين رب منزلنا قال اطعموا‏.‏ قالوا ما نحن بآكلين حتى يجيء رب منزلنا‏.‏ قال اقبلوا عنا قراكم، فإنه إن جاء ولم تطعموا لنلقين منه‏.‏ فأبوا فعرفت أنه يجد على، فلما جاء تنحيت عنه فقال ما صنعتم فأخبروه فقال يا عبد الرحمن‏.‏ فسكت ثم قال يا عبد الرحمن‏.‏ فسكت فقال يا غنثر أقسمت عليك إن كنت تسمع صوتي لما جئت‏.‏ فخرجت فقلت سل أضيافك‏.‏ فقالوا صدق أتانا به‏.‏ قال فإنما انتظرتموني، والله لا أطعمه الليلة‏.‏ فقال الآخرون والله لا نطعمه حتى تطعمه‏.‏ قال لم أر في الشر كالليلة، ويلكم ما أنتم لم لا تقبلون عنا قراكم هات طعامك‏.‏ فجاءه فوضع يده فقال باسم الله، الأولى للشيطان‏.‏ فأكل وأكلوا‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abu Bakr:                     Abu Bakr invited a group of people and told me, \"Look after your guests.\" Abu Bakr added, I am going to visit the Prophet and you should finish serving them before I return.\" `Abdur-Rahman said, So I went at once and served them with what was available at that time in the house and requested them to eat.\" They said, \"Where is the owner of the house (i.e., Abu Bakr)?\" `Abdur-Rahman said, \"Take your meal.\" They said, \"We will not eat till the owner of the house comes.\" `Abdur-Rahman said, \"Accept your meal from us, for if my father comes and finds you not having taken your meal yet, we will be blamed severely by him, but they refused to take their meals . So I was sure that my father would be angry with me. When he came, I went away (to hide myself) from him. He asked, \"What have you done (about the guests)?\" They informed him the whole story. Abu Bakr called, \"O `Abdur Rahman!\" I kept quiet. He then called again. \"O `Abdur-Rahman!\" I kept quiet and he called again, \"O ignorant (boy)! I beseech you by Allah, if you hear my voice, then come out!\" I came out and said, \"Please ask your guests (and do not be angry with me).\" They said, \"He has told the truth; he brought the meal to us.\" He said, \"As you have been waiting for me, by Allah, I will not eat of it tonight.\" They said, \"By Allah, we will not eat of it till you eat of it.\" He said, I have never seen a night like this night in evil. What is wrong with you? Why don't you accept your meals of hospitality from us?\" (He said to me), \"Bring your meal.\" I brought it to him, and he put his hand in it, saying, \"In the name of Allah. The first (state of fury) was because of Satan.\" So Abu Bakr ate and so did his guests.",
      "chain": [
        "30157",
        "20246",
        "11286",
        "11113",
        "107"
      ]
    },
    {
      "hadith_no": "6252",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عياش بن الوليد، حدثنا عبد الأعلى، حدثنا معمر، عن الزهري، عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تسموا العنب الكرم، ولا تقولوا خيبة الدهر‏.‏ فإن الله هو الدهر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Don't call the grapes Al-Karm, and don't say 'Khaibat-ad-Dahri, for Allah is the Dahr. (See Hadith No. 202.)",
      "chain": [
        "30157",
        "20246",
        "20115",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "6937",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثني عياش بن الوليد، حدثنا عبد الأعلى، حدثنا معمر، عن الزهري، عن سالم، عن عبد الله بن عمر، أنهم كانوا يضربون على عهد رسول الله صلى الله عليه وسلم إذا اشتروا طعاما جزافا أن يبيعوه في مكانهم حتى يئووه إلى رحالهم‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Those people who used to buy foodstuff at random (without weighing or measuring it) were beaten in the lifetime of Allah's Apostle if they sold it at the very place where they had bought it, till they carried it to their dwelling places.",
      "chain": [
        "30157",
        "20246",
        "20115",
        "11013",
        "11011"
      ]
    },
    {
      "hadith_no": "7148",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا عياش بن الوليد، أخبرنا عبد الأعلى، حدثنا معمر، عن الزهري، عن سعيد، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ يتقارب الزمان، وينقص العمل، ويلقى الشح، وتظهر الفتن، ويكثر الهرج ‏\"‏‏.‏ قالوا يا رسول الله أيم هو‏.‏ قال ‏\"‏ القتل القتل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Time will pass rapidly, good deeds will decrease, miserliness will be thrown (in the hearts of the people) afflictions will appear and there will be much 'Al-Harj.\" They said, \"O Allah's Apostle! What is \"Al-Harj?\" He said, \"Killing! Killing!\" (See Hadith No. 63, Vol. 8)",
      "chain": [
        "30157",
        "20246",
        "20115",
        "11013",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "7328",
      "source": " Sahih Bukhari ",
      "chapter": "Wishes - كتاب التمنى",
      "chapter_no": "95",
      "text_ar": "حدثنا عياش بن الوليد، حدثنا عبد الأعلى، حدثنا حميد، عن ثابت، عن أنس، رضى الله عنه قال واصل النبي صلى الله عليه وسلم آخر الشهر، وواصل أناس، من الناس فبلغ النبي صلى الله عليه وسلم فقال ‏\"‏ لو مد بي الشهر لواصلت وصالا يدع المتعمقون تعمقهم، إني لست مثلكم، إني أظل يطعمني ربي ويسقين ‏\"‏‏.‏ تابعه سليمان بن مغيرة عن ثابت عن أنس عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas:                     The Prophet fasted Al-Wisal on the last days of the month. Some people did the same, and when the news reached the Prophet he said, \"If the month had been prolonged for me, then I would have fasted Wisal for such a long time that the most exaggerating ones among you would have given up their exaggeration. I am not like you; my Lord always makes me eat and drink.\"",
      "chain": [
        "30157",
        "20246",
        "11279",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "7425",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الأعلى، حدثنا هشام بن حسان، أن هشام بن عروة، حدثه عن أبيه، أن عائشة، قالت كان يوضع لي ولرسول الله صلى الله عليه وسلم هذا المركن فنشرع فيه جميعا‏.‏",
      "text_en": " Narrated `Aisha:                     This big copper vessel used to be put for me and Allah's Apostle and we would take water from it together (on taking a bath) .",
      "chain": [
        "30160",
        "20246",
        "11311",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "233",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثني نصر بن علي الجهضمي، أخبرنا عبد الأعلى، حدثنا هشام، عن محمد، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ الصلوات الخمس والجمعة إلى الجمعة كفارات لما بينهن ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that the Messenger of Allah (way peace be upon him) said:                      Five prayers and one Friday prayer to (the next) Friday prayer are expiatious (for the sins committed in the intervals) between them.",
      "chain": [
        "30395",
        "20246",
        "20295",
        "20278",
        "13"
      ]
    },
    {
      "hadith_no": "278",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا المغيرة، - يعني الحزامي - عن أبي الزناد، عن الأعرج، عن أبي هريرة، ح\tوحدثنا نصر بن علي، حدثنا عبد الأعلى، عن هشام، عن محمد، عن أبي هريرة، ح\tوحدثني أبو كريب، حدثنا خالد، - يعني ابن مخلد - عن محمد بن جعفر، عن العلاء، عن أبيه، عن أبي هريرة، ح\tوحدثنا محمد بن رافع، حدثنا عبد الرزاق، حدثنا معمر، عن همام بن منبه، عن أبي هريرة، ح\tوحدثني محمد بن حاتم، حدثنا محمد بن بكر، ح وحدثنا الحلواني، وابن، رافع قالا حدثنا عبد الرزاق، قالا جميعا أخبرنا ابن جريج، أخبرني زياد، أن ثابتا، مولى عبد الرحمن بن زيد أخبره أنه، سمع أبا هريرة، في روايتهم جميعا عن النبي صلى الله عليه وسلم بهذا الحديث كلهم يقول حتى يغسلها ‏.‏ ولم يقل واحد منهم ثلاثا ‏.‏ إلا ما قدمنا من رواية جابر وابن المسيب وأبي سلمة وعبد الله بن شقيق وأبي صالح وأبي رزين فإن في حديثهم ذكر الثلاث ‏.‏",
      "text_en": " This hadith has been transmitted through other chains of transmitters on the authority of Abu Huraira in which it is reported that the Apostle of Allah (may peace be upon him) made a mention of washing the hand, and did not instruct to wash it three times. But the hadith narrated from Jabir and Ibn Musayyab. Abu Salama, and Abdullah b. Shaqiq, Abu Salih, Abla Razin, there is a mention of\" three times\".",
      "chain": [
        "30367",
        "11061",
        "11197",
        "20246",
        "20295",
        "11035",
        "30463",
        "20173",
        "10606",
        "11884"
      ]
    },
    {
      "hadith_no": "349",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا محمد بن عبد الله الأنصاري، حدثنا هشام بن حسان، حدثنا حميد بن هلال، عن أبي بردة، عن أبي موسى الأشعري، ح  وحدثنا محمد بن المثنى، حدثنا عبد الأعلى، - وهذا حديثه - حدثنا هشام، عن حميد بن هلال، قال - ولا أعلمه إلا عن أبي بردة، - عن أبي موسى، قال اختلف في ذلك رهط من المهاجرين والأنصار فقال الأنصاريون لا يجب الغسل إلا من الدفق أو من الماء ‏.‏ وقال المهاجرون بل إذا خالط فقد وجب الغسل ‏.‏ قال قال أبو موسى فأنا أشفيكم من ذلك ‏.‏ فقمت فاستأذنت على عائشة فأذن لي فقلت لها يا أماه - أو يا أم المؤمنين - إني أريد أن أسألك عن شىء وإني أستحييك ‏.‏ فقالت لا تستحيي أن تسألني عما كنت سائلا عنه أمك التي ولدتك فإنما أنا أمك ‏.‏ قلت فما يوجب الغسل قالت على الخبير سقطت قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا جلس بين شعبها الأربع ومس الختان الختان فقد وجب الغسل ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported:                      There cropped up a difference of opinion between a group of Muhajirs (Emigrants and a group of Ansar (Helpers) (and the point of dispute was) that the Ansar said: The bath (because of sexual intercourse) becomes obligatory only-when the semen spurts out or ejaculates. But the Muhajirs said: When a man has sexual intercourse (with the woman), a bath becomes obligatory (no matter whether or not there is seminal emission or ejaculation). Abu Musa said: Well, I satisfy you on this (issue). He (Abu Musa, the narrator) said: I got up (and went) to 'A'isha and sought her permission and it was granted, and I said to her: 0 Mother, or Mother of the Faithful, I want to ask you about a matter on which I feel shy. She said: Don't feel shy of asking me about a thing which you can ask your mother, who gave you birth, for I am too your mother. Upon this I said: What makes a bath obligatory for a person? She replied: You have come across one well informed! The Messenger of Allah (may peace be upon him) said: When anyone sits amidst four parts (of the woman) and the circumcised parts touch each other a bath becomes obligatory.",
      "chain": [
        "30170",
        "20280",
        "11311",
        "11281",
        "11901",
        "41",
        "30170",
        "20246",
        "20295",
        "11281",
        "11901"
      ]
    },
    {
      "hadith_no": "421",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن بزيع، أخبرنا عبد الأعلى، حدثنا عبيد الله، عن أبي حازم، عن سهل بن سعد الساعدي، قال ذهب نبي الله صلى الله عليه وسلم يصلح بين بني عمرو بن عوف ‏.‏ بمثل حديثهم وزاد فجاء رسول الله صلى الله عليه وسلم فخرق الصفوف حتى قام عند الصف المقدم ‏.‏ وفيه أن أبا بكر رجع القهقرى ‏.‏",
      "text_en": " Sahl b. Sa'd al-Sa'idi reported:                      The Apostle of Allah (may peace be upon him) went to Bani Amr b. 'Auf in order to bring about reconciliation amongst them. The rest of the hadith is the same but with (the addition of these words):\" The Messenger of Allah (may peace be upon him) came and made his way through the rows till he came to the first row and Abu Bakr retraced his steps.\"",
      "chain": [
        "30448",
        "20246",
        "11201",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "450",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الأعلى، عن داود، عن عامر، قال سألت علقمة هل كان ابن مسعود شهد مع رسول الله صلى الله عليه وسلم ليلة الجن قال فقال علقمة أنا سألت ابن مسعود فقلت هل شهد أحد منكم مع رسول الله صلى الله عليه وسلم ليلة الجن قال لا ولكنا كنا مع رسول الله صلى الله عليه وسلم ذات ليلة ففقدناه فالتمسناه في الأودية والشعاب فقلنا استطير أو اغتيل - قال - فبتنا بشر ليلة بات بها قوم فلما أصبحنا إذا هو جاء من قبل حراء - قال - فقلنا يا رسول الله فقدناك فطلبناك فلم نجدك فبتنا بشر ليلة بات بها قوم ‏.‏ فقال ‏\"‏ أتاني داعي الجن فذهبت معه فقرأت عليهم القرآن ‏\"‏ ‏.‏ قال فانطلق بنا فأرانا آثارهم وآثار نيرانهم وسألوه الزاد فقال ‏\"‏ لكم كل عظم ذكر اسم الله عليه يقع في أيديكم أوفر ما يكون لحما وكل بعرة علف لدوابكم ‏\"‏ ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فلا تستنجوا بهما فإنهما طعام إخوانكم ‏\"‏ ‏.‏",
      "text_en": " Dawud reported from 'Amir who said:                      I asked 'Alqama if Ibn Mas'ud was present with the Messenger of Allah (may peace be upon him) on the night of the Jinn (the night when the Holy Prophet met them). He (Ibn Mas'uad) said: No, but we were in the company of the Messenger of Allah (may peace be upon him) one night and we missed him. We searched for him in the valleys and the hills and said. He has either been taken away (by jinn) or has been secretly killed. He (the narrator) said. We spent the worst night which people could ever spend. When it was dawn we saw him coming from the side of Hiri'. He (the narrator) reported. We said: Messenger of Allah, we missed you and searched for you, but we could not find you and we spent the worst night which people could ever spend. He (the Holy Prophet) said: There came to me an inviter on behalf of the Jinn and I went along with him and recited to them the Qur'an. He (the narrator) said: He then went along with us and showed us their traces and traces of their embers. They (the Jinn) asked him (the Holy Prophet) about their provision and he said: Every bone on which the name of Allah is recited is your provision. The time it will fall in your hand it would be covered with flesh, and the dung of (the camels) is fodder for your animals. The Messenger of Allah (may peace be upon him) said: Don't perform istinja with these (things) for these are the food of your brothers (Jinn).",
      "chain": [
        "30170",
        "20246",
        "11052"
      ]
    },
    {
      "hadith_no": "484",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني محمد بن المثنى، حدثني عبد الأعلى، حدثنا داود، عن عامر، عن مسروق، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يكثر من قول ‏\"‏ سبحان الله وبحمده أستغفر الله وأتوب إليه ‏\"‏ ‏.‏ قالت فقلت يا رسول الله أراك تكثر من قول سبحان الله وبحمده أستغفر الله وأتوب إليه ‏.‏ فقال ‏\"‏ خبرني ربي أني سأرى علامة في أمتي فإذا رأيتها أكثرت من قول سبحان الله وبحمده أستغفر الله وأتوب إليه ‏.‏ فقد رأيتها ‏{‏ إذا جاء نصر الله والفتح‏}‏ فتح مكة ‏{‏ ورأيت الناس يدخلون في دين الله أفواجا * فسبح بحمد ربك واستغفره إنه كان توابا‏}‏ ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported:                      The Messenger of Allah (may peace be upon him) recited often these words: Hallowed be Allah and with His praise, I seek the forgiveness of Allah and return to Him. She said: I asked: Messenger of Allah, I see that you often repeat the saying\" subhan allahi bihamdihi astag firullahi watubuilaih\" whereupon he said: My Lord informed me that I would soon see a sign in my Ummah, so when I see it I often recite (these) words: Hallowed be Allah and with His Praise, I seek forgiveness of Allah and return to Him. Indeed I saw it (when this verse) was revealed:\" When Allah's help and victory came, it marked the victory of Mecca, and you see people entering into Allah's religion in troops, celebrate the praise of Thy Lord and ask His forgiveness. Surely He is ever returning to Mercy.\"",
      "chain": [
        "30170",
        "20246",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "1505",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الأعلى، عن معمر، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ تفضل صلاة في الجميع على صلاة الرجل وحده خمسا وعشرين درجة ‏\"‏ ‏.‏ قال ‏\"‏ وتجتمع ملائكة الليل وملائكة النهار في صلاة الفجر ‏\"‏ ‏.‏ قال أبو هريرة اقرءوا إن شئتم ‏{‏ وقرآن الفجر إن قرآن الفجر كان مشهودا‏}‏",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace be upon him) as saying:                      Prayer said in a congregation is twenty-five degrees more excellent than prayer said by a single person. He (Abu Huraira further) said: The angels of the night and the angels of the day meet together. Abu Huraira said: Recite it you like:\" Surely the recital of the Qur'an at dawn is witnessed\" (al-Qur'an, xvii. 78).",
      "chain": [
        "30201",
        "20246",
        "20115",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "1600",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا عبد الأعلى، حدثنا سعيد، عن قتادة، عن أنس بن مالك، قال قال نبي الله صلى الله عليه وسلم ‏\"‏ من نسي صلاة أو نام عنها فكفارتها أن يصليها إذا ذكرها ‏\"‏ ‏.‏",
      "text_en": " Qatada narrated on the authority of Anas b. Malik that the Apostle of Allah (may peace be upon him) said:                      He who forgets the prayer, or he slept (and it was omitted), its expiation is (only) that he should observe it when he remembers it.",
      "chain": [
        "30170",
        "20246",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1800",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الأعلى بن عبد الأعلى، عن معمر، عن يحيى بن أبي كثير، عن أبي نضرة، عن أبي سعيد، أن النبي صلى الله عليه وسلم قال ‏\"‏ أوتروا قبل أن تصبحوا ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id reported that they (some of the Companions) of the Holy Prophet (may peace be upon him) asked the Apostle of Allah (may peace be upon him) about Witr. He said:                      Observe Witr before morning.",
      "chain": [
        "30201",
        "20246",
        "20115",
        "11449",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "1921",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الأعلى بن عبد الأعلى، عن الجريري، عن أبي السليل، عن عبد الله بن رباح الأنصاري، عن أبى بن كعب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا المنذر أتدري أى آية من كتاب الله معك أعظم ‏\"‏ ‏.‏ قال قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ يا أبا المنذر أتدري أى آية من كتاب الله معك أعظم ‏\"‏ ‏.‏ قال قلت الله لا إله إلا هو الحى القيوم ‏.‏ قال فضرب في صدري وقال ‏\"‏ والله ليهنك العلم أبا المنذر ‏\"‏ ‏.‏",
      "text_en": " Abu Darda' reported Allah's Apostle (may peace be upon him) as saying:                      Is any one of you incapable of reciting a third of the Qur'an in a night? They (the Companions) asked: How could one recite a third of the Qur'an (in a night)? Upon this he (the Holy Prophet) said:\" He is Allah, One\" (Qur'An. cxii.) is equivalent to a third of the Qur'an.",
      "chain": [
        "30201",
        "20246",
        "11286",
        "11865",
        "39"
      ]
    },
    {
      "hadith_no": "1956",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا محمد بن المثنى، حدثني عبد الأعلى، حدثنا داود، عن عامر، عن علقمة، قال أتيت الشام فلقيت أبا الدرداء فذكر بمثل حديث ابن علية ‏.‏",
      "text_en": " Abu Huraira is reported to have said that the Messenger of Allah (may peace be upon him) prohibited to observe prayer after the 'Asr prayer till the sun is set, and after the dawn till the sun rises.",
      "chain": [
        "30170",
        "20246",
        "11052",
        "11017"
      ]
    },
    {
      "hadith_no": "1959",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنيه زهير بن حرب، حدثنا يحيى بن سعيد، عن شعبة، ح وحدثني أبو غسان، المسمعي حدثنا عبد الأعلى، حدثنا سعيد، ح وحدثنا إسحاق بن إبراهيم، أخبرنا معاذ، بن هشام حدثني أبي كلهم، عن قتادة، بهذا الإسناد غير أن في، حديث سعيد وهشام بعد الصبح حتى تشرق الشمس ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported Allah's Messenger (may peace be upon him) as saying:                      No prayer is valid after the 'Asr prayer till the sun sets and no prayer is valid after the dawn prayer till the sun rises.",
      "chain": [
        "20031",
        "20020",
        "30456",
        "20246",
        "11168",
        "30123",
        "20287"
      ]
    },
    {
      "hadith_no": "1978",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الأعلى، عن الجريري، عن عبد الله، بن بريدة عن عبد الله بن مغفل، عن النبي صلى الله عليه وسلم ‏.‏ مثله إلا أنه قال في الرابعة ‏\"‏ لمن شاء ‏\"‏ ‏.‏",
      "text_en": " Salim b. Abdullah b. 'Umar reported:                      The Messenger of Allah (may peace he upon him) led on* of the two groups In one rak'ah of prayer in danger, while the other group faced the -enemy. Then they (the members of the first group) went back and replaced their companions who were facing the enemy. and then they (the members of the second group) came and the Apostle of Allah (may peace be upon him) led them in one rak'ah of prayer. Then the Apostle of Allah (may peace be upon him) pronounced salutation, and then they (the members of the Ant group) completed the rak'ah and they (the members of the second group) completed the rak'ah. This hadith has been narrated by another chain of tranamitters.",
      "chain": [
        "30201",
        "20246",
        "11286",
        "11432",
        "3242"
      ]
    },
    {
      "hadith_no": "2045",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، ومحمد بن المثنى، كلاهما عن عبد الأعلى، - قال ابن المثنى حدثني عبد الأعلى، وهو أبو همام - حدثنا داود، عن عمرو بن سعيد، عن سعيد بن جبير، عن ابن عباس، أن ضمادا، قدم مكة وكان من أزد شنوءة وكان يرقي من هذه الريح فسمع سفهاء من أهل مكة يقولون إن محمدا مجنون ‏.‏ فقال لو أني رأيت هذا الرجل لعل الله يشفيه على يدى - قال - فلقيه فقال يا محمد إني أرقي من هذه الريح وإن الله يشفي على يدي من شاء فهل لك فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الحمد لله نحمده ونستعينه من يهده الله فلا مضل له ومن يضلل فلا هادي له وأشهد أن لا إله إلا الله وحده لا شريك له وأن محمدا عبده ورسوله أما بعد ‏\"‏ ‏.‏ قال فقال أعد على كلماتك هؤلاء ‏.‏ فأعادهن عليه رسول الله صلى الله عليه وسلم ثلاث مرات - قال - فقال لقد سمعت قول الكهنة وقول السحرة وقول الشعراء فما سمعت مثل كلماتك هؤلاء ولقد بلغن ناعوس البحر - قال - فقال هات يدك أبايعك على الإسلام - قال - فبايعه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ وعلى قومك ‏\"‏ ‏.‏ قال وعلى قومي - قال - فبعث رسول الله صلى الله عليه وسلم سرية فمروا بقومه فقال صاحب السرية للجيش هل أصبتم من هؤلاء شيئا فقال رجل من القوم أصبت منهم مطهرة ‏.‏ فقال ردوها فإن هؤلاء قوم ضماد ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      Dimad came to Mecca and he belonged to the tribe of Azd Shanu'a, and he used to protect the person who was under the influence of charm. He heard the foolish people of Mecca say that Muhammad (may peace be upon him) was under the spell. Upon this he said: If 1 were to come across this man, Allah might cure him at my hand. He met him and said: Muhammad, I can protect (one) who is under the influence of charm, and Allah cures one whom He so desires at my hand. Do you desire (this)? Upon this the Messenger of Allah (may peace be upon him) said: Praise is due to Allah, we praise Him, ask His help; and he whom Allah guides aright there is none to lead him astray, and he who is led astray there is none to guide him, and I bear testimony to the fact that there is no god but Allah, He is One, having no partner with Him, and that Muhammad is His Servant and Messenger. Now after this he (Dimad) said: Repeat these words of yours before me, and the messenger of Allah (may peace be upon him) repeated these to him thrice; and he said I have heard the words of soothsayers and the words of magicians, and the words of poets, but I have never heard such words as yours, and they reach the depth (of the ocean of eloquence) ; bring forth your hand so that I should take oath of fealty to you on Islam. So he took an oath of allegiance to him. The Messenger of Allah (may peace be upon him) said: It (this allegiance of yours) is on behalf of your people too. He said: It is on behalf of my people too. The Messenger of Allah (may peace be upon him) sent an expedition and the flying column passed by his people. The leader of the flying column said to the detachment: Did you find anything from these people? One of the people said: I found a utensil for water. Upon this he (the commander) said: Return it, for he is one of the people of Dimad.",
      "chain": [
        "30123",
        "30170",
        "20246",
        "20246",
        "10602",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2113",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Rain) - كتاب صلاة الاستسقاء‏",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا ابن أبي عدي، وعبد الأعلى، عن سعيد، عن قتادة، عن أنس، أن نبي الله صلى الله عليه وسلم كان لا يرفع يديه في شىء من دعائه إلا في الاستسقاء حتى يرى بياض إبطيه ‏.‏ غير أن عبد الأعلى قال يرى بياض إبطه أو بياض إبطيه ‏.‏",
      "text_en": " Anas reported that the Apostle of Allah (may peace be upon him) was not accustomed to raice his hands in any supplication he made except when praying for rain. (He would then raise [his hands] high enough) that the whiteness of his armpits became visible. 'Abd al-A'la said that (he was in doubt whether it was) the whiteness of his armpit or armpits.",
      "chain": [
        "30170",
        "20276",
        "20246",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "2158",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الأعلى بن عبد الأعلى، عن الجريري، عن حيان بن عمير، عن عبد الرحمن بن سمرة، - وكان من أصحاب رسول الله صلى الله عليه وسلم - قال كنت أرتمي بأسهم لي بالمدينة في حياة رسول الله صلى الله عليه وسلم إذ كسفت الشمس فنبذتها فقلت والله لأنظرن إلى ما حدث لرسول الله صلى الله عليه وسلم في كسوف الشمس قال فأتيته وهو قائم في الصلاة رافع يديه فجعل يسبح ويحمد ويهلل ويكبر ويدعو حتى حسر عنها ‏.‏ قال فلما حسر عنها قرأ سورتين وصلى ركعتين ‏.‏",
      "text_en": " 'Abd al-Rahman b. Samura, who was one of the Companions of the Messenger of Allah (may peace be upon him) said:                      During the lifetime of Allah's Messenger (may peace be upon him) I was shooting some of my arrows in Medina, when the sun eclipsed. I threw (the arrows) and said: By Allah, I must see how the Messenger of Allah (may peace be upon him) acts in solar eclipse. So I came to him and he was standing in prayer, raising his hands, glorifying Him, praising Him, acknowledging His Oneness, declaring His greatness, and supplicating Him, till the sun cleared. When the eclipse was over, he recited two surahs and prayed two rak'ahs.",
      "chain": [
        "30201",
        "20246",
        "11286",
        "10679",
        "955"
      ]
    },
    {
      "hadith_no": "2233",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثناه أبو بكر بن أبي شيبة، حدثنا عبد الأعلى، ح وحدثنا ابن رافع، وعبد، بن حميد عن عبد الرزاق، كلاهما عن معمر، عن الزهري، عن سعيد بن المسيب، عن أبي، هريرة عن النبي صلى الله عليه وسلم إلى قوله الجبلين العظيمين ‏.‏ ولم يذكرا ما بعده وفي حديث عبد الأعلى حتى يفرغ منها وفي حديث عبد الرزاق حتى توضع في اللحد .",
      "text_en": " This hadith has been narrated on the authority of Abu Huraira through another chain of narrators up to these words:                     \" two great mountains.\" No mention is made of what followed (these words) ; and in the hadith transmitted by 'Abd al- A'la (the words are):\" till (the burial) is complete.\" In the hadith transmitted by 'Abd ar-Razzaq (the words are):\" till he is placed in the grave.\"",
      "chain": [
        "20246",
        "30553",
        "20115",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "2443",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الأعلى بن عبد الأعلى، عن معمر، عن عبد الله بن مسلم، أخي الزهري عن حمزة بن عبد الله، عن أبيه، أن النبي صلى الله عليه وسلم قال ‏\"‏ لا تزال المسألة بأحدكم حتى يلقى الله وليس في وجهه مزعة لحم ‏\"‏ ‏.‏",
      "text_en": " Hamza. son of 'Abdullah, reported on the authority of his father that the Apostle of Allah (may peace be upon him) said:                      When a man is always begging from people. he would meet Allah (in a state) that there would be no flesh on his face.",
      "chain": [
        "30201",
        "20246",
        "20115",
        "11818",
        "18"
      ]
    },
    {
      "hadith_no": "2509",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الأعلى، حدثنا داود، عن أبي نضرة، عن أبي، سعيد الخدري أن رسول الله صلى الله عليه وسلم قال ‏\"‏ تمرق مارقة في فرقة من الناس فيلي قتلهم أولى الطائفتين بالحق ‏\"‏ ‏.‏",
      "text_en": "",
      "chain": [
        "30170",
        "20246",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "2831",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن المثنى، وأبو بكر بن خلاد قالا حدثنا عبد الأعلى، حدثنا سعيد، عن أبي نضرة، عن أبي سعيد الخدري، - رضى الله عنه - قال اعتكف رسول الله صلى الله عليه وسلم العشر الأوسط من رمضان يلتمس ليلة القدر قبل أن تبان له فلما انقضين أمر بالبناء فقوض ثم أبينت له أنها في العشر الأواخر فأمر بالبناء فأعيد ثم خرج على الناس فقال ‏\"‏ يا أيها الناس إنها كانت أبينت لي ليلة القدر وإني خرجت لأخبركم بها فجاء رجلان يحتقان معهما الشيطان فنسيتها فالتمسوها في العشر الأواخر من رمضان التمسوها في التاسعة والسابعة والخامسة ‏\"‏ ‏.‏ قال قلت يا أبا سعيد إنكم أعلم بالعدد منا ‏.‏ قال أجل ‏.‏ نحن أحق بذلك منكم ‏.‏ قال قلت ما التاسعة والسابعة والخامسة قال إذا مضت واحدة وعشرون فالتي تليها ثنتين وعشرين وهى التاسعة فإذا مضت ثلاث وعشرون فالتي تليها السابعة فإذا مضى خمس وعشرون فالتي تليها الخامسة .‏ وقال ابن خلاد مكان يحتقان يختصمان ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported:                      The Messenger of Allah (may peace be upon him) observed i'tikaf in the middle ten days of Ramadan to seek Lailat-ul-Qadr before it was made manifest to him. When (these nights) were over, he commanded to strike the tent. Then it was made manifest to him that (Lailat-ul-Qadr) was in the last ten nights (of Ramadan), and commanded to pitch the tent (again). He then came to the people and said: O people, Lailat-ul-Qadr was made manifest to me and I came out to inform you about it that two persons came contend- ing with each other and there was a devil along with them and I forgot it. So seek it in the last ten nights of Ramadan. Seek it on the ninth, on the seventh and on the fifth. I (one of the narrators) said: Abu Sa'id, you know more than us about numbers. He said: Yes, indeed we have better right than you. I said: What is this ninth, seventh, and fifth? He said: When twenty-one (nights are over) and the twenty-second begins, it is the ninth, and when twenty-three (nights) are over, that which follows (the last night) is the seventh, and when twenty-five nights are over, what follows it is fifth. Ibn Khallad said: Instead of the word Yahliqan (contending), he said Yakhtasiman, (they are disputing).",
      "chain": [
        "30170",
        "30447",
        "20246",
        "11073",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "3082",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني عبيد الله بن عمر القواريري، حدثنا عبد الأعلى بن عبد الأعلى، حدثنا داود، عن أبي نضرة، عن أبي سعيد، قال خرجنا مع رسول الله صلى الله عليه وسلم نصرخ بالحج صراخا فلما قدمنا مكة أمرنا أن نجعلها عمرة إلا من ساق الهدى فلما كان يوم التروية ورحنا إلى منى أهللنا بالحج ‏.‏",
      "text_en": " Abu Sa'id (Allah be pleased with him) reported:                      We went out with Allah's messenger (may peace be upon him) pronouncing loudly the Talbiya for Hajj When we came to Mecca, he commanded us that we should change this (Ibrim for Hajj) to that of Umra except one who had brought the sacrificial animal with him. When it was the day of Tarwiya (8th of Dhu'l-Hijja) and we went to Mini, we (again) pronounced Talbiya for Hajj.",
      "chain": [
        "30024",
        "20246",
        "10721",
        "38"
      ]
    }
  ],
  "total_hadiths": 223
}