{
  "id": "20240",
  "name": "Shayban bin 'Abdur Rahman شيبان بن عبد الرحمن النحوي أبو معاوية",
  "full_name": "Shayban bin 'Abdur Rahman شيبان بن عبد الرحمن النحوي أبو معاوية",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "164",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra",
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Tamimi",
      "Client",
      "al-Basri",
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11368",
      "name": "'Abdul Malik bin 'Umayr al-Qabti عبد الملك بن عمير بن سويد القبطي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11385",
      "name": "Faras bin Yahya al-Hamdani al-Kharfi فراس بن يحيى",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11449",
      "name": "Yahya bin Abi Kathir يحيى بن أبي كثير الطائي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10770",
      "name": "Smak bin Hrb bin Aws سماك بن حرب بن أوس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11324",
      "name": "Ash'ath bin Abi al-Ash'atha أشعث بن أبي الشعثاء",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "24244",
      "name": "'Abdullah bin al-Mukhtar عبد الله بن المختار البصري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11339",
      "name": "Ziyad bin 'Alaqa زياد بن علاقة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11524",
      "name": "'Uthman bin 'Abdullah bin Muhab عثمان بن عبد الله بن موهب التيمي الأعرج",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "22977",
      "name": "Hilal bin 'Abdur Rahman al-Wzan هلال بن عبد الرحمن",
      "grade": "Succ. (Taba' Tabi')"
    }
  ],
  "students": [
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11001",
      "name": "Abu Hanifa أبو حنيفة‎‎",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20355",
      "name": "Muhammad bin 'Abdullah bin al-Zubair محمد بن عبد الله أبو أحمد الزبيري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20609",
      "name": "Mua'wiya bin Hisham al-Qsar معاوية بن هشام القصار",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20426",
      "name": "Shababa bin Sawar شبابة بن سوار الفزاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20384",
      "name": "Abu Ahmed al-Mu'dab الحسين بن محمد بن بهرام - أبو علي المؤدب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20383",
      "name": "al-Hasan bin Musa al-'Ashayb الحسن بن موسى الأشيب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20393",
      "name": "Yonus bin Muhammad bin Muslim يونس بن محمد بن مسلم المؤدب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20390",
      "name": "Hashim bin al-Qasim bin Muslim هاشم بن القاسم أبو النضر - قيصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20365",
      "name": "Yahya bin Abi Bkyr يحيى بن أبي بكير واسمه نسر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20404",
      "name": "Aadm bin Abi Iyas آدم بن أبي إياس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20340",
      "name": "'Ubaidullah bin Musa bin Abi al-Mukhtar عبيد الله بن موسى بن أبي المختار باذام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20386",
      "name": "'Ali bin al-J'ad al-Jauhri علي بن الجعد بن عبيد الجوهري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "112",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو نعيم الفضل بن دكين، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن أبي هريرة، أن خزاعة، قتلوا رجلا من بني ليث عام فتح مكة بقتيل منهم قتلوه، فأخبر بذلك النبي صلى الله عليه وسلم فركب راحلته، فخطب فقال ‏\"‏ إن الله حبس عن مكة القتل  أو الفيل شك أبو عبد الله  وسلط عليهم رسول الله صلى الله عليه وسلم والمؤمنين، ألا وإنها لم تحل لأحد قبلي، ولا تحل لأحد بعدي ألا وإنها حلت لي ساعة من نهار، ألا وإنها ساعتي هذه حرام، لا يختلى شوكها، ولا يعضد شجرها، ولا تلتقط ساقطتها إلا لمنشد، فمن قتل فهو بخير النظرين إما أن يعقل، وإما أن يقاد أهل القتيل ‏\"‏‏.‏ فجاء رجل من أهل اليمن فقال اكتب لي يا رسول الله‏.‏ فقال ‏\"‏ اكتبوا لأبي فلان ‏\"‏‏.‏ فقال رجل من قريش إلا الإذخر يا رسول الله، فإنا نجعله في بيوتنا وقبورنا‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إلا الإذخر، إلا الإذخر ‏\"‏‏.‏ قال أبو عبد الله يقال يقاد بالقاف‏.‏ فقيل لأبي عبد الله أى شىء كتب له قال كتب له هذه الخطبة‏.‏",
      "text_en": " Narrated Abu Huraira:                     In the year of the Conquest of Mecca, the tribe of Khuza`a killed a man from the tribe of Bani Laith in revenge for a killed person, belonging to them. They informed the Prophet about it. So he rode his Rahila (she-camel for riding) and addressed the people saying, \"Allah held back the killing from Mecca. (The sub-narrator is in doubt whether the Prophet said \"elephant or killing,\" as the Arabic words standing for these words have great similarity in shape), but He (Allah) let His Apostle and the believers over power the infidels of Mecca. Beware! (Mecca is a sanctuary) Verily! Fighting in Mecca was not permitted for anyone before me nor will it be permitted for anyone after me. It (war) in it was made legal for me for few hours or so on that day. No doubt it is at this moment a sanctuary, it is not allowed to uproot its thorny shrubs or to uproot its trees or to pick up its Luqat (fallen things) except by a person who will look for its owner (announce it publicly). And if somebody is killed, then his closest relative has the right to choose one of the two-- the blood money (Diyya) or retaliation having the killer killed. In the meantime a man from Yemen came and said, \"O Allah's Apostle! Get that written for me.\" The Prophet ordered his companions to write that for him. Then a man from Quraish said, \"Except Al-Idhkhir (a type of grass that has good smell) O Allah's Apostle, as we use it in our houses and graves.\" The Prophet said, \"Except Al-Idhkhir i.e. Al-Idhkhir is allowed to be plucked.\"",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "179",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن يحيى، عن أبي سلمة، أن عطاء بن يسار، أخبره أن زيد بن خالد أخبره أنه، سأل عثمان بن عفان  رضى الله عنه  قلت أرأيت إذا جامع فلم يمن قال عثمان يتوضأ كما يتوضأ للصلاة، ويغسل ذكره‏.‏ قال عثمان سمعته من رسول الله صلى الله عليه وسلم‏.‏ فسألت عن ذلك عليا، والزبير، وطلحة، وأبى بن كعب  رضى الله عنهم  فأمروه بذلك‏.‏",
      "text_en": " Narrated Zaid bin Khalid:                     I asked `Uthman bin `Affan about a person who engaged in intercourse but did no discharge. `Uthman replied, \"He should perform ablution like the one for an ordinary prayer but he must wash his penis.\" `Uthman added, \"I heard it from Allah's Apostle.\" I asked `Ali Az-Zubair, Talha and Ubai bin Ka`b about it and they, too, gave the same reply. (This order was canceled later on and taking a bath became necessary for such cases).",
      "chain": [
        "35043",
        "20240",
        "11449",
        "10567",
        "11020",
        "3625",
        "4"
      ]
    },
    {
      "hadith_no": "204",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن جعفر بن عمرو بن أمية الضمري، أن أباه، أخبره أنه، رأى النبي صلى الله عليه وسلم يمسح على الخفين‏.‏ وتابعه حرب بن شداد وأبان عن يحيى‏.‏",
      "text_en": " Narrated Ja`far bin `Amr bin Umaiya Ad-Damri:                     My father said, \"I saw the Prophet passing wet hands over his Khuffs (socks made from thick fabric or leather).\"",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "11501"
      ]
    },
    {
      "hadith_no": "286",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا هشام، وشيبان، عن يحيى، عن أبي سلمة، قال سألت عائشة أكان النبي صلى الله عليه وسلم يرقد وهو جنب قالت نعم ويتوضأ‏.‏",
      "text_en": " Narrated Abu Salama:                     I asked `Aisha \"Did the Prophet use to sleep while he was Junub?\" She replied, \"Yes, but he used to perform ablution (before going to bed).",
      "chain": [
        "20348",
        "20295",
        "20240",
        "11449",
        "10567"
      ]
    },
    {
      "hadith_no": "322",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا سعد بن حفص، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن زينب ابنة أبي سلمة، حدثته أن أم سلمة قالت حضت وأنا مع النبي، صلى الله عليه وسلم في الخميلة، فانسللت فخرجت منها، فأخذت ثياب حيضتي فلبستها، فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ أنفست ‏\"‏‏.‏ قلت نعم، فدعاني فأدخلني معه في الخميلة‏.‏ قالت وحدثتني أن النبي صلى الله عليه وسلم كان يقبلها وهو صائم، وكنت أغتسل أنا والنبي صلى الله عليه وسلم من إناء واحد من الجنابة‏.‏",
      "text_en": " Narrated Zainab bint Abi Salama:                     Um-Salama said, \"I got my menses while I was lying with the Prophet under a woolen sheet. So I slipped away, took the clothes for menses and put them on. Allah's Apostle said, 'Have you got your menses?' I replied, 'Yes.' Then he called me and took me with him under the woolen sheet.\" Um Salama further said, \"The Prophet used to kiss me while he was fasting. The Prophet and I used to take the bath of Janaba from a single pot.\"",
      "chain": [
        "35043",
        "20240",
        "11449",
        "10567",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "360",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى بن أبي كثير، عن عكرمة، قال سمعته  أو، كنت سألته  قال سمعت أبا هريرة، يقول أشهد أني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من صلى في ثوب واحد، فليخالف بين طرفيه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Whoever prays in a single garment must cross its ends (over the shoulders).",
      "chain": [
        "20348",
        "20240",
        "11449",
        "11023",
        "13"
      ]
    },
    {
      "hadith_no": "556",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أدرك أحدكم سجدة من صلاة العصر قبل أن تغرب الشمس فليتم صلاته، وإذا أدرك سجدة من صلاة الصبح قبل أن تطلع الشمس فليتم صلاته ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If anyone of you can get one rak`a of the `Asr prayer before sunset, he should complete his prayer. If any of you can get one rak`a of the Fajr prayer before sunrise, he should complete his prayer.\"",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "619",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن عائشة، كان النبي صلى الله عليه وسلم يصلي ركعتين خفيفتين بين النداء والإقامة من صلاة الصبح‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to offer two light rak`at between the Adhan and the Iqama of the Fajr prayer.",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "635",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن عبد الله بن أبي قتادة، عن أبيه، قال بينما نحن نصلي مع النبي صلى الله عليه وسلم إذ سمع جلبة رجال فلما صلى قال ‏\"‏ ما شأنكم ‏\"‏‏.‏ قالوا استعجلنا إلى الصلاة‏.‏ قال ‏\"‏ فلا تفعلوا، إذا أتيتم الصلاة فعليكم بالسكينة، فما أدركتم فصلوا وما فاتكم فأتموا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Abi Qatada:                     My father said, \"While we were praying with the Prophet he heard the noise of some people. After the prayer he said, 'What is the matter?' They replied 'We were hurrying for the prayer.' He said, 'Do not make haste for the prayer, and whenever you come for the prayer, you should come with calmness, and pray whatever you get (with the people) and complete the rest which you have missed.\"",
      "chain": [
        "20348",
        "20240",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "638",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن عبد الله بن أبي قتادة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أقيمت الصلاة فلا تقوموا حتى تروني وعليكم بالسكينة ‏\"‏‏.‏ تابعه علي بن المبارك‏.‏",
      "text_en": " Narrated `Abdullah bin Abi Qatada:                      My father said, \"Allah's Apostle said, 'If the Iqama is pronounced, then do not stand for the prayer till you see me (in front of you) and do it calmly.' \"",
      "chain": [
        "20348",
        "20240",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "641",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، قال سمعت أبا سلمة، يقول أخبرنا جابر بن عبد الله، أن النبي صلى الله عليه وسلم جاءه عمر بن الخطاب يوم الخندق فقال يا رسول الله، والله ما كدت أن أصلي حتى كادت الشمس تغرب، وذلك بعد ما أفطر الصائم‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ والله ما صليتها ‏\"‏ فنزل النبي صلى الله عليه وسلم إلى بطحان وأنا معه فتوضأ ثم صلى  يعني العصر  بعد ما غربت الشمس، ثم صلى بعدها المغرب‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     On the day of Al-Khandaq (the trench), `Umar bin Al-Khattab went to the Prophet and said, \"O Allah's Apostle! By Allah, I could not pray (the `Asr) till the sun had set.\" `Umar told this to the Prophet at the time when a fasting person had done Iftar (taken his meals). The Prophet then went to Buthan and I was with him. He performed ablution and offered the `Asr prayer after the sun had set and then the Maghrib prayer.",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "759",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن عبد الله بن أبي قتادة، عن أبيه، قال كان النبي صلى الله عليه وسلم يقرأ في الركعتين الأوليين من صلاة الظهر بفاتحة الكتاب وسورتين، يطول في الأولى، ويقصر في الثانية، ويسمع الآية أحيانا، وكان يقرأ في العصر بفاتحة الكتاب وسورتين، وكان يطول في الأولى، وكان يطول في الركعة الأولى من صلاة الصبح، ويقصر في الثانية‏.‏",
      "text_en": " Narrated `Abdullah bin Abi Qatada:                     My father said, \"The Prophet in Zuhr prayers used to recite Al-Fatiha along with two other Suras in the first two rak`at: a long one in the first rak`a and a shorter (Sura) in the second, and at times the verses were audible. In the `Asr prayer the Prophet used to recite Al-Fatiha and two more Suras in the first two rak`at and used to prolong the first rak`a. And he used to prolong the first rak`a of the Fajr prayer and shorten the second.",
      "chain": [
        "20348",
        "20240",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "882",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن أبي هريرة، أن عمر  رضى الله عنه  بينما هو يخطب يوم الجمعة إذ دخل رجل فقال عمر لم تحتبسون عن الصلاة فقال الرجل ما هو إلا سمعت النداء توضأت‏.‏ فقال ألم تسمعوا النبي صلى الله عليه وسلم قال ‏\"‏ إذا راح أحدكم إلى الجمعة فليغتسل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     While `Umar (bin Al-Khattab) was delivering the Khutba on a Friday, a man entered (the mosque). `Umar asked him, \"What has detained you from the prayer?\" The man said, \"It was only that when I heard the Adhan I performed ablution (for the prayer).\" On that `Umar said, \"Did you not hear the Prophet saying: 'Anyone of you going out for the Jumua prayer should take a bath'?\".",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "13",
        "3"
      ]
    },
    {
      "hadith_no": "1043",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا هاشم بن القاسم، قال حدثنا شيبان أبو معاوية، عن زياد بن علاقة، عن المغيرة بن شعبة، قال كسفت الشمس على عهد رسول الله صلى الله عليه وسلم يوم مات إبراهيم، فقال الناس كسفت الشمس لموت إبراهيم‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الشمس والقمر لا ينكسفان لموت أحد ولا لحياته، فإذا رأيتم فصلوا وادعوا الله ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     \"The sun eclipsed in the lifetime of Allah's Apostle on the day when (his son) Ibrahim died. So the people said that the sun had eclipsed because of the death of Ibrahim. Allah's Apostle said, \"The sun and the moon do not eclipse because of the death or life (i.e. birth) of someone. When you see the eclipse pray and invoke Allah.\"",
      "chain": [
        "30351",
        "20390",
        "20240",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "1051",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن عبد الله بن عمرو، أنه قال لما كسفت الشمس على عهد رسول الله صلى الله عليه وسلم نودي إن الصلاة جامعة فركع النبي صلى الله عليه وسلم ركعتين في سجدة ثم قام فركع ركعتين في سجدة، ثم جلس، ثم جلي عن الشمس‏.‏ قال وقالت عائشة  رضى الله عنها  ما سجدت سجودا قط كان أطول منها‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     When the sun eclipsed in the lifetime of Allah's Apostle and an announcement was made that the prayer was to be held in congregation. The Prophet performed two bowing in one rak`a. Then he stood up and performed two bowing in one rak`a. Then he sat down and finished the prayer; and by then the (eclipse) had cleared `Aisha said, \"I had never performed such a long prostration.\"",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "29"
      ]
    },
    {
      "hadith_no": "1094",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا أبو نعيم، قال حدثنا شيبان، عن يحيى، عن محمد بن عبد الرحمن، أن جابر بن عبد الله، أخبره أن النبي صلى الله عليه وسلم كان يصلي التطوع وهو راكب في غير القبلة‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet used to offer the Nawafil, while riding, facing a direction other than that of the Qibla.",
      "chain": [
        "20348",
        "20240",
        "11449",
        "11105",
        "34"
      ]
    },
    {
      "hadith_no": "1207",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو نعيم، حدثنا شيبان، عن يحيى، عن أبي سلمة، قال حدثني معيقيب، أن النبي صلى الله عليه وسلم قال في الرجل يسوي التراب حيث يسجد قال ‏\"‏ إن كنت فاعلا فواحدة ‏\"‏‏.‏",
      "text_en": " Narrated Mu'aiqib:                     The Prophet talked about a man leveling the earth on prostrating, and said, \"If you have to do so, then do it once.\"",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "747"
      ]
    },
    {
      "hadith_no": "1330",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عبيد الله بن موسى، عن شيبان، عن هلال  هو الوزان  عن عروة، عن عائشة  رضى الله عنها  عن النبي صلى الله عليه وسلم قال في مرضه الذي مات فيه ‏\"‏ لعن الله اليهود والنصارى، اتخذوا قبور أنبيائهم مسجدا ‏\"‏‏.‏ قالت ولولا ذلك لأبرزوا قبره غير أني أخشى أن يتخذ مسجدا‏.‏",
      "text_en": " Narrated `Urwa:                     Aisha said, \"The Prophet in his fatal illness said, 'Allah cursed the Jews and the Christians because they took the graves of their Prophets as places for praying.\"' Aisha added, \"Had it not been for that, the grave of the Prophet (p.b.u.h) would have been made prominent but I am afraid it might be taken (as a) place for praying.",
      "chain": [
        "20340",
        "20240",
        "22977",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2080",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو نعيم، حدثنا شيبان، عن يحيى، عن أبي سلمة، عن أبي سعيد  رضى الله عنه  قال كنا نرزق تمر الجمع، وهو الخلط من التمر، وكنا نبيع صاعين بصاع فقال النبي صلى الله عليه وسلم ‏\"‏ لا صاعين بصاع، ولا درهمين بدرهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     We used to be given mixed dates (from the booty) and used to sell (barter) two Sas of those dates) for one Sa (of good dates). The Prophet said (to us), \"No (bartering of) two Sas for one Sa nor two Dirhams for one Dirham is permissible\", (as that is a kind of usury). (See Hadith No. 405).",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "2615",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا يونس بن محمد، حدثنا شيبان، عن قتادة، حدثنا أنس  رضى الله عنه  قال أهدي للنبي صلى الله عليه وسلم جبة سندس، وكان ينهى عن الحرير، فعجب الناس منها فقال ‏\"‏ والذي نفس محمد بيده لمناديل سعد بن معاذ في الجنة أحسن من هذا ‏\"‏‏.‏ وقال سعيد عن قتادة، عن أنس، إن أكيدر دومة أهدى إلى النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas:                     A Jubba (i.e. cloak) made of thick silken cloth was presented to the Prophet. The Prophet used to forbid people to wear silk. So, the people were pleased to see it. The Prophet said, \"By Him in Whose Hands Muhammad's soul is, the handkerchiefs of Sa`d bin Mu`adh in Paradise are better than this.\" Anas added, \"The present was sent to the Prophet by Ukaidir (a Christian) from Dauma.\"",
      "chain": [
        "30351",
        "20393",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "2625",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا أبو نعيم، حدثنا شيبان، عن يحيى، عن أبي سلمة، عن جابر  رضى الله عنه  قال قضى النبي صلى الله عليه وسلم بالعمرى أنها لمن وهبت له‏.‏",
      "text_en": " Narrated Jabir:                     The Prophet gave the verdict that `Umra is for the one to whom it is presented.",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "2781",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا محمد بن سابق، أو الفضل بن يعقوب عنه حدثنا شيبان أبو معاوية، عن فراس، قال قال الشعبي حدثني جابر بن عبد الله الأنصاري  رضى الله عنهما  أن أباه استشهد يوم أحد، وترك ست بنات، وترك عليه دينا، فلما حضر جداد النخل أتيت رسول الله صلى الله عليه وسلم فقلت يا رسول الله قد علمت أن والدي استشهد يوم أحد وترك عليه دينا كثيرا، وإني أحب أن يراك الغرماء قال ‏\"‏ اذهب فبيدر كل تمر على ناحيته ‏\"‏‏.‏ ففعلت ثم دعوته، فلما نظروا إليه أغروا بي تلك الساعة، فلما رأى ما يصنعون أطاف حول أعظمها بيدرا ثلاث مرات ثم جلس عليه ثم قال ‏\"‏ ادع أصحابك ‏\"‏‏.‏ فما زال يكيل لهم حتى أدى الله أمانة والدي، وأنا والله راض أن يؤدي الله أمانة والدي ولا أرجع إلى أخواتي بتمرة، فسلم والله البيادر كلها حتى أني أنظر إلى البيدر الذي عليه رسول الله صلى الله عليه وسلم كأنه لم ينقص تمرة واحدة‏.‏   قال أبو عبد الله أغروا بي يعني هيجوا بي  فأغرينا بينهم العداوة والبغضاء",
      "text_en": " Narrated Jabir bin `Abdullah Al-Ansari:                     My father was martyred on the day (of the Ghazwa) of Uhud and left six daughters and some debts to be paid. When the time of plucking the date-fruits came, I went to Allah's Apostle and said, \"O Allah's Apostle! you know that my father was martyred on Uhud's day and owed much debt, and I wish that the creditors would see you.\" The Prophet said, \"Go and collect the various kinds of dates and place them separately in heaps\"' I did accordingly and called him. On seeing him, the creditors started claiming their rights pressingly at that time. When the Prophet saw how they behaved, he went round the biggest heap for three times and sat over it and said, \"Call your companions (i.e. the creditors).\" Then he kept on measuring and giving them, till Allah cleared all my father's debts. By Allah, it would have pleased me that Allah would clear the debts of my father even though I had not taken a single date to my sisters. But by Allah, all the heaps were complete, (as they were) and I looked at the heap where Allah's Apostle was sitting and noticed as if not a single date had been taken thereof.",
      "chain": [
        "30209",
        "20240",
        "11385",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "2809",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن عبد الله، حدثنا حسين بن محمد أبو أحمد، حدثنا شيبان، عن قتادة، حدثنا أنس بن مالك، أن أم الربيع بنت البراء، وهى أم حارثة بن سراقة أتت النبي صلى الله عليه وسلم فقالت يا نبي الله، ألا تحدثني عن حارثة وكان قتل يوم بدر أصابه سهم غرب، فإن كان في الجنة، صبرت، وإن كان غير ذلك اجتهدت عليه في البكاء‏.‏ قال ‏\"‏ يا أم حارثة، إنها جنان في الجنة، وإن ابنك أصاب الفردوس الأعلى ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Um Ar-Rubai'bint Al-Bara', the mother of Hartha bin Suraqa came to the Prophet and said, \"O Allah's Prophet! Will you tell me about Hartha?\" Hartha has been killed (i.e. martyred) on the day of Badr with an arrow thrown by an unidentified person. She added, \"If he is in Paradise, I will be patient; otherwise, I will weep bitterly for him.\" He said, \"O mother of Hartha! There are Gardens in Paradise and your son got the Firdausal-ala (i.e. the best place in Paradise).",
      "chain": [
        "30561",
        "20384",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "2841",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن يحيى، عن أبي سلمة، أنه سمع أبا هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من أنفق زوجين في سبيل الله دعاه خزنة الجنة، كل خزنة باب أى فل هلم ‏\"‏‏.‏ قال أبو بكر يا رسول الله، ذاك الذي لا توى عليه‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إني لأرجو أن تكون منهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever spends two things in Allah's Cause, will be called by all the gate-keepers of Paradise who will be saying, 'O so-and-so! Come here.' \" Abu Bakr said, \"O Allah's Apostle! Such persons will never be destroyed.\" The Prophet said, \"I hope you will be one of them.\"",
      "chain": [
        "35043",
        "20240",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3077",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا آدم بن أبي إياس، حدثنا شيبان، عن منصور، عن مجاهد، عن طاوس، عن ابن عباس  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم يوم فتح مكة ‏\"‏ لا هجرة ولكن جهاد ونية، وإذا استنفرتم فانفروا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, on the day of the Conquest of Mecca, \"There is no migration (after the Conquest), but Jihad and good intentions, and when you are called for Jihad, you should immediately respond to the call.\"",
      "chain": [
        "20404",
        "20240",
        "11067",
        "11028",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "3216",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا آدم، حدثنا شيبان، حدثنا يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ من أنفق زوجين في سبيل الله دعته خزنة الجنة أى فل هلم ‏\"‏‏.‏ فقال أبو بكر ذاك الذي لا توى عليه‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ أرجو أن تكون منهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard the Prophet saying, \"Who ever spends a couple (of objects) in Allah's cause, will be called by the Gatekeepers of Paradise who will say, \"O so-and-so, come on!\" Abu Bakr said, \"Such a person will never perish or be miserable' The Prophet said, \"I hope you will be among such person.\"",
      "chain": [
        "20404",
        "20240",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3248",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا عبد الله بن محمد الجعفي، حدثنا يونس بن محمد، حدثنا شيبان، عن قتادة، حدثنا أنس  رضى الله عنه  قال أهدي للنبي صلى الله عليه وسلم جبة سندس، وكان ينهى عن الحرير، فعجب الناس منها، فقال ‏\"‏ والذي نفس محمد بيده، لمناديل سعد بن معاذ في الجنة أحسن من هذا ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A silken cloak was presented to the Prophet and he used to forbid the usage of silk (by men). When the people were fascinated by the cloak. he said, \"By Allah in Whose Hands the life of Muhammad is, the handkerchiefs of Sa`d bin Mu`adh in Paradise are better than this.\"",
      "chain": [
        "30351",
        "20393",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "3338",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا أبو نعيم، حدثنا شيبان، عن يحيى، عن أبي سلمة، سمعت أبا هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا أحدثكم حديثا عن الدجال ما حدث به نبي قومه، إنه أعور، وإنه يجيء معه بمثال الجنة والنار، فالتي يقول إنها الجنة‏.‏ هي النار، وإني أنذركم كما أنذر به نوح قومه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Shall I not tell you about the Dajjal a story of which no prophet told his nation? The Dajjall is one-eyed and will bring with him what will resemble Hell and Paradise, and what he will call Paradise will be actually Hell; so I warn you (against him) as Noah warned his nation against him.\"",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3680",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا يونس، حدثنا شيبان، عن قتادة، عن أنس بن مالك،‏.‏ وقال لي خليفة حدثنا يزيد بن زريع، حدثنا سعيد، عن قتادة، عن أنس بن مالك  رضى الله عنه  أنه حدثهم أن أهل مكة سألوا رسول الله صلى الله عليه وسلم أن يريهم آية، فأراهم انشقاق القمر‏.‏",
      "text_en": " Narrated Anas:                     That the Meccan people requested Allah's Apostle to show them a miracle, and so he showed them the splitting of the moon.",
      "chain": [
        "30351",
        "20475",
        "20240",
        "11019",
        "30132",
        "20304",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "3837",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن يحيى، قال أبو سلمة أخبرني أبو أسيد، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ خير الأنصار  أو قال خير دور الأنصار  بنو النجار وبنو عبد الأشهل وبنو الحارث وبنو ساعدة ‏\"‏‏.‏",
      "text_en": "",
      "chain": [
        "35043",
        "20240",
        "11449",
        "10567",
        "113"
      ]
    },
    {
      "hadith_no": "4103",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني أحمد بن أبي سريج، أخبرنا عبيد الله بن موسى، حدثنا شيبان، عن فراس، عن الشعبي، قال حدثني جابر بن عبد الله  رضى الله عنهما أن أباه، استشهد يوم أحد وترك عليه دينا، وترك ست بنات، فلما حضر جذاذ النخل قال أتيت رسول الله صلى الله عليه وسلم فقلت قد علمت أن والدي قد استشهد يوم أحد، وترك دينا كثيرا، وإني أحب أن يراك الغرماء‏.‏ فقال ‏\"‏ اذهب فبيدر كل تمر على ناحية ‏\"‏‏.‏ ففعلت ثم دعوته، فلما نظروا إليه كأنهم أغروا بي تلك الساعة، فلما رأى ما يصنعون أطاف حول أعظمها بيدرا ثلاث مرات، ثم جلس عليه، ثم قال ‏\"‏ ادع لك أصحابك ‏\"‏‏.‏ فما زال يكيل لهم حتى أدى الله عن والدي أمانته، وأنا أرضى أن يؤدي الله أمانة والدي، ولا أرجع إلى أخواتي بتمرة، فسلم الله البيادر كلها وحتى إني أنظر إلى البيدر الذي كان عليه النبي صلى الله عليه وسلم كأنها لم تنقص تمرة واحدة‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     That his father was martyred on the day of the battle of Uhud and was in debt and left six (orphan) daughters. Jabir, added, \"When the season of plucking the dates came, I went to Allah's Apostle and said, \"You know that my father was martyred on the day of Uhud, and he was heavily in debt, and I would like that the creditors should see you.\" The Prophet said, \"Go and pile every kind of dates apart.\" I did so and called him (i.e. the Prophet ). When the creditors saw him, they started claiming their debts from me then in such a harsh manner (as they had never done before). So when he saw their attitude, he went round the biggest heap of dates thrice, and then sat over it and said, 'O Jabir), call your companions (i.e. the creditors).' Then he kept on measuring (and giving) to the creditors (their due) till Allah paid all the debt of my father. I would have been satisfied to retain nothing of those dates for my sisters after Allah had paid the debts of my father. But Allah saved all the heaps (of dates), so that when I looked at the heap where the Prophet had been sitting, it seemed as if a single date had not been taken away thereof.\"",
      "chain": [
        "30298",
        "20340",
        "20240",
        "11385",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "4505",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو نعيم، حدثنا شيبان، عن يحيى، عن أبي سلمة، عن عائشة، وابن، عباس رضى الله عنهم أن النبي صلى الله عليه وسلم لبث بمكة عشر سنين ينزل عليه القرآن، وبالمدينة عشرا‏.‏",
      "text_en": " Narrated Aisha and Ibn `Abbas:                     The Prophet stayed for ten years in Mecca with the Qur'an being revealed to him and he stayed in Medina for ten years.'",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "53",
        "17"
      ]
    },
    {
      "hadith_no": "4604",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق بن إبراهيم بن عبد الرحمن أبو يعقوب، حدثنا حسين بن محمد، حدثنا شيبان، عن قتادة، حدثنا أنس، أن أبا طلحة، قال غشينا النعاس ونحن في مصافنا يوم أحد  قال  فجعل سيفي يسقط من يدي وآخذه، ويسقط وآخذه‏.‏",
      "text_en": " Narrated Abu Talha:                     Slumber overtook us during the battle of Uhud while we were in the front files. My sword would fall from my hand and I would pick it up, and again it would fall down and I would pick it up again.",
      "chain": [
        "30123",
        "20384",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "4641",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أبو نعيم، حدثنا شيبان، عن يحيى، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  قال بينا النبي صلى الله عليه وسلم يصلي العشاء إذ قال ‏\"‏ سمع الله لمن حمده ‏\"‏‏.‏ ثم قال قبل أن يسجد ‏\"‏ اللهم نج عياش بن أبي ربيعة، اللهم نج سلمة بن هشام، اللهم نج الوليد بن الوليد، اللهم نج المستضعفين من المؤمنين، اللهم اشدد وطأتك على مضر، اللهم اجعلها سنين كسني يوسف ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     While the Prophet was offering the `Isha' prayer, he said, \"Allah hears him who sends his praises to Him,\" and then said before falling in prostration, \"O Allah, save `Aiyash bin Rabi`a. O Allah, save Salama bin Hisham. O Allah, save Al-Walid bin Al-Wahd. O Allah, save the weak ones among the believers. O Allah, let Your punishment be severe on the tribe of Mudar. O Allah, inflict upon them years (of famine) like the years of Joseph.\"",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "4807",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا يونس بن محمد البغدادي، حدثنا شيبان، عن قتادة، حدثنا أنس بن مالك  رضى الله عنه ‏.‏ أن رجلا، قال يا نبي الله يحشر الكافر على وجهه يوم القيامة قال ‏\"‏ أليس الذي أمشاه على الرجلين في الدنيا قادرا على أن يمشيه على وجهه يوم القيامة ‏\"‏‏.‏ قال قتادة بلى وعزة ربنا‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A man said, \"O Allah's Prophet! Will Allah gather the non-believers on their faces on the Day of Resurrection?\" He said, \"Will not the One Who made him walk on his feet in this world, be able to make him walk on his face on the Day of Resurrection?\" (Qatada, a subnarrator, said: Yes, By the Power of Our Lord!)",
      "chain": [
        "30351",
        "20393",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "4812",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن منصور، عن سعيد بن جبير، قال قال ابن أبزى سل ابن عباس عن قوله تعالى ‏{‏ومن يقتل مؤمنا متعمدا فجزاؤه جهنم‏}‏ وقوله ‏{‏لا يقتلون النفس التي حرم الله إلا بالحق‏}‏ حتى بلغ ‏{‏إلا من تاب‏}‏ فسألته فقال لما نزلت قال أهل مكة فقد عدلنا بالله وقتلنا النفس التي حرم الله إلا بالحق وأتينا الفواحش، فأنزل الله ‏{‏إلا من تاب وآمن وعمل عملا صالحا‏}‏ إلى قوله ‏{‏غفورا رحيما‏}‏",
      "text_en": " Narrated Sa`id bin Jubair:                     Ibn Abza said to me, \"Ask Ibn `Abbas regarding the Statement of Allah: 'And whoever murders a believer intentionally, his recompense is Hell.' (4.69) And also His Statement: '...nor kill such life as Allah has forbidden, except for a just cause .....except those who repent, believe, and do good deeds.' \" (25.68-70) So I asked Ibn `Abbas and he said, \"When this (25.68-69) was revealed, the people of Mecca said, \"We have invoked other gods with Allah, and we have murdered such lives which Allah has made sacred, and we have committed illegal sexual intercourse. So Allah revealed: 'Except those who repent, believe, and do good deeds and Allah is Oft-Forgiving, Most Merciful.' (25.70)",
      "chain": [
        "35043",
        "20240",
        "11067",
        "11050"
      ]
    },
    {
      "hadith_no": "4859",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا آدم، حدثنا شيبان، عن منصور، عن إبراهيم، عن عبيدة، عن عبد الله  رضى الله عنه  قال جاء حبر من الأحبار إلى رسول الله صلى الله عليه وسلم فقال يا محمد، إنا نجد أن الله يجعل السموات على إصبع والأرضين على إصبع، والشجر على إصبع، والماء والثرى على إصبع، وسائر الخلائق على إصبع، فيقول أنا الملك‏.‏ فضحك النبي صلى الله عليه وسلم حتى بدت نواجذه تصديقا لقول الحبر ثم قرأ رسول الله صلى الله عليه وسلم ‏{‏وما قدروا الله حق قدره والأرض جميعا قبضته يوم القيامة والسموات مطويات بيمينه سبحانه وتعالى عما يشركون‏}‏",
      "text_en": " Narrated `Abdullah:                     A (Jewish) Rabbi came to Allah's Apostle and he said, \"O Muhammad! We learn that Allah will put all the heavens on one finger, and the earths on one finger, and the trees on one finger, and the water and the dust on one finger, and all the other created beings on one finger. Then He will say, 'I am the King.' Thereupon the Prophet smiled so that his pre-molar teeth became visible, and that was the confirmation of the Rabbi. Then Allah's Apostle recited: 'No just estimate have they made of Allah such as due to Him.' (39.67)",
      "chain": [
        "20404",
        "20240",
        "11067",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "4916",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا يونس بن محمد، حدثنا شيبان، عن قتادة، عن أنس  رضى الله عنه  قال سأل أهل مكة أن يريهم آية فأراهم انشقاق القمر‏.‏",
      "text_en": " Narrated Anas:                     The people of Mecca asked the Prophet to show them a sign (miracle). So he showed them (the miracle) of the cleaving of the moon.",
      "chain": [
        "30351",
        "20393",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "4958",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن يحيى، قال أخبرني أبو سلمة، قال جاء رجل إلى ابن عباس وأبو هريرة جالس عنده فقال أفتني في امرأة ولدت بعد زوجها بأربعين ليلة‏.‏ فقال ابن عباس آخر الأجلين‏.‏ قلت أنا ‏{‏وأولات الأحمال أجلهن أن يضعن حملهن‏}‏ قال أبو هريرة أنا مع ابن أخي  يعني أبا سلمة  فأرسل ابن عباس غلامه كريبا إلى أم سلمة يسألها فقالت قتل زوج سبيعة الأسلمية وهى حبلى، فوضعت بعد موته بأربعين ليلة فخطبت فأنكحها رسول الله صلى الله عليه وسلم وكان أبو السنابل فيمن خطبها‏.‏",
      "text_en": " Narrated Abu Salama:                     A man came to Ibn `Abbas while Abu Huraira was sitting with him and said, \"Give me your verdict regarding a lady who delivered a baby forty days after the death of her husband.\" Ibn `Abbas said, \"This indicates the end of one of the two prescribed periods.\" I said \"For those who are pregnant, their prescribed period is until they deliver their burdens.\" Abu Huraira said, I agree with my cousin (Abu Salama).\" Then Ibn `Abbas sent his slave, Kuraib to Um Salama to ask her (regarding this matter). She replied. \"The husband of Subai'a al Aslamiya was killed while she was pregnant, and she delivered a baby forty days after his death. Then her hand was asked in marriage and Allah's Apostle married her (to somebody). Abu As-Sanabil was one of those who asked for her hand in marriage\".",
      "chain": [
        "35043",
        "20240",
        "11449",
        "10567"
      ]
    },
    {
      "hadith_no": "5016",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا آدم، حدثنا شيبان، حدثنا قتادة، عن أنس  رضى الله عنه  قال لما عرج بالنبي صلى الله عليه وسلم إلى السماء قال ‏\"‏ أتيت على نهر حافتاه قباب اللؤلؤ مجوفا فقلت ما هذا يا جبريل قال هذا الكوثر ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     When the Prophet was made to ascend to the Heavens, he said (after his return), \"I came upon a river the banks of which were made of tents of hollow pearls. I asked Gabriel. What is this (river?' He replied, 'This is the Kauthar.'",
      "chain": [
        "20404",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "5030",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا عبيد الله بن موسى، عن شيبان، عن يحيى، عن أبي سلمة، قال أخبرتني عائشة، وابن، عباس رضى الله عنهم قالا لبث النبي صلى الله عليه وسلم بمكة عشر سنين ينزل عليه القرآن وبالمدينة عشرا‏.‏",
      "text_en": " Narrated `Aisha and Ibn `Abbas:                     The Prophet remained in Mecca for ten years, during which the Qur'an used to be revealed to him; and he stayed in Medina for ten years.",
      "chain": [
        "20340",
        "20240",
        "11449",
        "10567",
        "53",
        "17"
      ]
    },
    {
      "hadith_no": "5108",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن يحيى، عن محمد بن عبد الرحمن، عن أبي سلمة، عن عبد الله بن عمرو، قال لي النبي صلى الله عليه وسلم ‏\"‏ في كم تقرأ القرآن ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     The Prophet asked me, \"How long does it take you to finish the recitation of the whole Qur'an?\"",
      "chain": [
        "35043",
        "20240",
        "11449",
        "11105",
        "10567",
        "29"
      ]
    },
    {
      "hadith_no": "5109",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثني إسحاق، أخبرنا عبيد الله، عن شيبان، عن يحيى، عن محمد بن عبد الرحمن، مولى بني زهرة عن أبي سلمة  قال وأحسبني قال  سمعت أنا من أبي سلمة، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اقرإ القرآن في شهر ‏\"‏‏.‏ قلت إني أجد قوة حتى قال ‏\"‏ فاقرأه في سبع ولا تزد على ذلك ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     Allah's Apostle said to me, \"Recite the whole Qur'an in one month's time.\" I said, \"But I have power (to do more than that).\" Allah's Apostle said, \"Then finish the recitation of the Qur'an in seven days, and do not finish it in less than this period.\"",
      "chain": [
        "30021",
        "11201",
        "20240",
        "11449",
        "10960",
        "10567",
        "29"
      ]
    },
    {
      "hadith_no": "5220",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن منصور، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس، قال قال النبي صلى الله عليه وسلم ‏\"‏ أما لو أن أحدهم يقول حين يأتي أهله باسم الله، اللهم جنبني الشيطان، وجنب الشيطان ما رزقتنا، ثم قدر بينهما في ذلك، أو قضي ولد، لم يضره شيطان أبدا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"If anyone of you, when having sexual intercourse with his wife, says: Bismillah, Allahumma jannibni-Sh-Shaitan wa jannib-ish-Shaitan ma razaqtana, and if it is destined that they should have a child, then Satan will never be able to harm him.\"",
      "chain": [
        "35043",
        "20240",
        "11067",
        "11342",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "5690",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا أبو نعيم، حدثنا شيبان، عن يحيى، عن عبد الله بن أبي قتادة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا شرب أحدكم فلا يتنفس في الإناء، وإذا بال أحدكم فلا يمسح ذكره بيمينه، وإذا تمسح أحدكم فلا يتمسح بيمينه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Qatada:                     Allah's Apostle said, \"When you drink (water), do not breath in the vessel; and when you urinate, do not touch your penis with your right hand. And when you cleanse yourself after defecation, do not use your right hand.\"",
      "chain": [
        "20348",
        "20240",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "6041",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن منصور، عن المسيب، عن وراد، عن المغيرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله حرم عليكم عقوق الأمهات، ومنع وهات، ووأد البنات، وكره لكم قيل وقال، وكثرة السؤال، وإضاعة المال ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira:                     The Prophet said, \"Allah has forbidden you ( 1 ) to be undutiful to your mothers (2) to withhold (what you should give) or (3) demand (what you do not deserve), and (4) to bury your daughters alive. And Allah has disliked that (A) you talk too much about others ( B), ask too many questions (in religion), or (C) waste your property.\"",
      "chain": [
        "35043",
        "20240",
        "11067",
        "11402",
        "166"
      ]
    },
    {
      "hadith_no": "6509",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن يحيى، عن محمد بن إبراهيم القرشي، قال أخبرني معاذ بن عبد الرحمن، أن ابن أبان، أخبره قال أتيت عثمان بطهور وهو جالس على المقاعد، فتوضأ فأحسن الوضوء ثم قال رأيت النبي صلى الله عليه وسلم توضأ وهو في هذا المجلس، فأحسن الوضوء ثم قال ‏\"‏ من توضأ مثل هذا الوضوء، ثم أتى المسجد فركع ركعتين، ثم جلس، غفر له ما تقدم من ذنبه ‏\"‏‏.‏ قال وقال النبي صلى الله عليه وسلم ‏\"‏ لا تغتروا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I brought water to `Uthman bin `Affan to perform the ablution while he was sitting on his seat. He performed the ablution in a perfect way and said, \"I saw the Prophet performing the ablution in this place and he performed it in a perfect way and said, \"Whoever performs the ablution as I have done this time and then proceeds to the mosque and offers a two-rak`at prayer and then sits there (waiting for the compulsory congregational prayers), then all his past sins will be forgiven.\" The Prophet further added, \"Do not be conceited (thinking that your sins will be forgiven because of your prayer).",
      "chain": [
        "35043",
        "20240",
        "11449",
        "11213",
        "2706"
      ]
    },
    {
      "hadith_no": "6602",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا يونس بن محمد البغدادي، حدثنا شيبان، عن قتادة، حدثنا أنس بن مالك  رضى الله عنه أن رجلا، قال يا نبي الله كيف يحشر الكافر على وجهه قال ‏\"‏ أليس الذي أمشاه على الرجلين في الدنيا قادرا على أن يمشيه على وجهه يوم القيامة ‏\"‏‏.‏ قال قتادة بلى وعزة ربنا‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A man said, \"O Allah's Prophet! Will a Kafir (disbeliever) be gathered (driven prone) on his face?\" The Prophet said, \"Is not He Who made him walk with his legs in this world, able to make him walk on his face on the Day of Resurrection?\" (Qatada, a sub-narrator said: Yes, (He can), by the Power of Our Lord!\")",
      "chain": [
        "30351",
        "20393",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6739",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن منصور، عن إبراهيم، عن عبيدة، عن عبد الله، قال سئل النبي صلى الله عليه وسلم أى الناس خير قال ‏\"‏ قرني، ثم الذين يلونهم، ثم الذين يلونهم، ثم يجيء قوم تسبق شهادة أحدهم يمينه، ويمينه شهادته ‏\"‏‏.‏ قال إبراهيم وكان أصحابنا ينهونا ونحن غلمان أن نحلف بالشهادة والعهد‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet was asked, \"Who are the best people?\" He replied: The people of my generation, and then those who will follow (come after) them, and then those who will come after the later; after that there will come some people whose witness will precede their oaths and their oaths will go ahead of their witness.\" Ibrahim (a sub-narrator) said, \"When we were young, our elder friends used to prohibit us from taking oaths by saying, 'I bear witness swearing by Allah, or by Allah's Covenant.\"'",
      "chain": [
        "35043",
        "20240",
        "11067",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "6742",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا آدم، حدثنا شيبان، حدثنا قتادة، عن أنس بن مالك، قال النبي صلى الله عليه وسلم ‏\"‏ لا تزال جهنم تقول هل من مزيد حتى يضع رب العزة فيها قدمه فتقول قط قط وعزتك‏.‏ ويزوى بعضها إلى بعض ‏\"‏‏.‏ رواه شعبة عن قتادة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"The Hell Fire will keep on saying: 'Are there anymore (people to come)?' Till the Lord of Power and Honor will put His Foot over it and then it will say, 'Qat! Qat! (sufficient! sufficient!) by Your Power and Honor. And its various sides will come close to each other (i.e., it will contract). \"",
      "chain": [
        "20404",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6964",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا أبو نعيم، حدثنا شيبان، عن يحيى، عن أبي سلمة، عن أبي هريرة، أن خزاعة، قتلوا رجلا‏.‏ وقال عبد الله بن رجاء حدثنا حرب عن يحيى حدثنا أبو سلمة حدثنا أبو هريرة أنه عام فتح مكة قتلت خزاعة رجلا من بني ليث بقتيل لهم في الجاهلية، فقام رسول الله صلى الله عليه وسلم فقال ‏\"‏ إن الله حبس عن مكة الفيل وسلط عليهم رسوله والمؤمنين، ألا وإنها لم تحل لأحد قبلي، ولا تحل لأحد بعدي، ألا وإنما أحلت لي ساعة من نهار، ألا وإنها ساعتي هذه حرام لا يختلى شوكها، ولا يعضد شجرها، ولا يلتقط ساقطتها إلا منشد، ومن قتل له قتيل فهو بخير النظرين إما يودى وإما يقاد ‏\"‏‏.‏ فقام رجل من أهل اليمن يقال له أبو شاه فقال اكتب لي يا رسول الله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اكتبوا لأبي شاه ‏\"‏‏.‏ ثم قام رجل من قريش فقال يا رسول الله إلا الإذخر، فإنما نجعله في بيوتنا وقبورنا‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إلا الإذخر ‏\"‏‏.‏ وتابعه عبيد الله عن شيبان في الفيل، قال بعضهم عن أبي نعيم القتل‏.‏ وقال عبيد الله إما أن يقاد أهل القتيل‏.‏",
      "text_en": " Narrated Abu Huraira:                     In the year of the Conquest of Mecca, the tribe of Khuza`a killed a man from the tribe of Bam Laith in revenge for a killed person belonging to them in the Pre-lslamic Period of Ignorance. So Allah's Apostle got up saying, \"Allah held back the (army having) elephants from Mecca, but He let His Apostle and the believers overpower the infidels (of Mecca). Beware! (Mecca is a sanctuary)! Verily! Fighting in Mecca was not permitted for anybody before me, nor will it be permitted for anybody after me; It was permitted for me only for a while (an hour or so) of that day. No doubt! It is at this moment a sanctuary; its thorny shrubs should not be uprooted; its trees should not be cut down; and its Luqata (fallen things) should not be picked up except by the one who would look for its owner. And if somebody is killed, his closest relative has the right to choose one of two things, i.e., either the Blood money or retaliation by having the killer killed.\" Then a man from Yemen, called Abu Shah, stood up and said, \"Write that) for me, O Allah's Apostle!\" Allah's Apostle said (to his companions), \"Write that for Abu Shah.\" Then another man from Quraish got up, saying, \"O Allah's Apostle! Except Al- Idhkhir (a special kind of grass) as we use it in our houses and for graves.\" Allah's Apostle said, \"Except Al-idhkkir.\"",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "13",
        "20245",
        "20220",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "7006",
      "source": " Sahih Bukhari ",
      "chapter": "Dealing with Apostates - كتاب استتابة المرتدين والمعاندين وقتالهم",
      "chapter_no": "89",
      "text_ar": "حدثني محمد بن الحسين بن إبراهيم، أخبرنا عبيد الله، أخبرنا شيبان، عن فراس، عن الشعبي، عن عبد الله بن عمرو  رضى الله عنهما  قال جاء أعرابي إلى النبي صلى الله عليه وسلم فقال يا رسول الله ما الكبائر قال ‏\"‏ الإشراك بالله ‏\"‏‏.‏ قال ثم ماذا قال ‏\"‏ ثم عقوق الوالدين ‏\"‏‏.‏ قال ثم ماذا قال ‏\"‏ اليمين الغموس ‏\"‏‏.‏ قلت وما اليمين الغموس قال ‏\"‏ الذي يقتطع مال امرئ مسلم هو فيها كاذب ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     A bedouin came to the Prophet and said, \"O Allah's Apostle! What are the biggest sins?: The Prophet said, \"To join others in worship with Allah.\" The bedouin said, \"What is next?\" The Prophet said, \"To be undutiful to one's parents.\" The bedouin said \"What is next?\" The Prophet said \"To take an oath 'Al-Ghamus.\" The bedouin said, \"What is an oath 'Al-Ghamus'?\" The Prophet said, \"The false oath through which one deprives a Muslim of his property (unjustly).",
      "chain": [
        "30267",
        "11201",
        "20240",
        "11385",
        "11052",
        "29"
      ]
    },
    {
      "hadith_no": "7056",
      "source": " Sahih Bukhari ",
      "chapter": "Tricks - كتاب الحيل",
      "chapter_no": "91",
      "text_ar": "حدثنا أبو نعيم، حدثنا شيبان، عن يحيى، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تنكح الأيم حتى تستأمر، ولا تنكح البكر حتى تستأذن ‏\"‏‏.‏ قالوا كيف إذنها قال ‏\"‏ أن تسكت ‏\"‏‏.‏ وقال بعض الناس إن احتال إنسان بشاهدى زور على تزويج امرأة ثيب بأمرها، فأثبت القاضي نكاحها إياه، والزوج يعلم أنه لم يتزوجها قط، فإنه يسعه هذا النكاح، ولا بأس بالمقام له معها‏.‏",
      "text_en": " Narrated Abu Haraira:                     Allah's Apostle said, \"A lady slave should not be given in marriage until she is consulted, and a virgin should not be given in marriage until her permission is granted.\" The people said, \"How will she express her permission?\" The Prophet said, \"By keeping silent (when asked her consent).\" Some people said, \"If a man, by playing a trick, presents two false witnesses before the judge to testify that he has married a matron with her consent and the judge confirms his marriage, and the husband is sure that he has never married her (before), then such a marriage will be considered as a legal one and he may live with her as husband.\"",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "7210",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن يحيى، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال قال النبي صلى الله عليه وسلم ‏\"‏ يجيء الدجال حتى ينزل في ناحية المدينة، ثم ترجف المدينة ثلاث رجفات، فيخرج إليه كل كافر ومنافق ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"Ad-Dajjal will come and encamp at a place close to Medina and then Medina will shake thrice whereupon every Kafir (disbeliever) and hypocrite will go out (of Medina) towards him.\"",
      "chain": [
        "35043",
        "20240",
        "11449",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "7484",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا سعد بن حفص، حدثنا شيبان، عن منصور، عن ربعي بن حراش، عن خرشة بن الحر، عن أبي ذر، قال كان النبي صلى الله عليه وسلم إذا أخذ مضجعه من الليل قال ‏\"‏ باسمك نموت ونحيا، فإذا استيقظ قال الحمد لله الذي أحيانا بعد ما أماتنا وإليه النشور ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dharr:                     When the Prophet went to bed at night, he used to say: \"Bismika namutu wa nahya.\" And when he got up in the morning, he used to say, \"Al hamdu li l-lahi al-ladhi ahyana ba'da ma amatana, wa ilaihi-nnushur.\"",
      "chain": [
        "35043",
        "20240",
        "11067",
        "11334",
        "4026",
        "23"
      ]
    },
    {
      "hadith_no": "7608",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "وقال آدم حدثنا شيبان، حدثنا قتادة، حدثنا صفوان، عن ابن عمر، سمعت النبي صلى الله عليه وسلم",
      "text_en": "",
      "chain": [
        "20404",
        "20240",
        "11019",
        "18"
      ]
    },
    {
      "hadith_no": "118",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني حجاج بن الشاعر، والقاسم بن زكرياء، قالا حدثنا عبيد الله بن موسى، عن شيبان، عن الأعمش، عن أبي صالح، وأبي، سفيان عن جابر، قال قال النعمان بن قوقل يا رسول الله ‏.‏ بمثله ‏.‏ وزاد فيه ولم أزد على ذلك شيئا ‏.‏",
      "text_en": " A similar hadith is narrated on Jabir's authority in which the following words are added:                      I will do nothing more.",
      "chain": [
        "38834",
        "20340",
        "20240",
        "11060",
        "11161",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "321",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني محمد بن رافع، حدثنا الزبيري، - وهو محمد بن عبد الله بن الزبير - حدثنا شيبان، قال سمعت الحسن، يقول ‏\"‏ إن رجلا ممن كان قبلكم خرجت به قرحة فلما آذته انتزع سهما من كنانته فنكأها فلم يرقإ الدم حتى مات ‏.‏ قال ربكم قد حرمت عليه الجنة ‏\"‏ ‏.‏ ثم مد يده إلى المسجد فقال إي والله لقد حدثني بهذا الحديث جندب عن رسول الله صلى الله عليه وسلم في هذا المسجد ‏.‏",
      "text_en": " It is reported on the authority of Hasan:                      A person belonging to the people of the past suffered from a boil, when it pained him, he drew out an arrow from the quiver and pierced it. And the bleeding did not stop till he died. Your Lord said: I forbade his entrance into Paradise. Then he (Hasan) stretched his hand towards the mosque and said: By God, Jundab transmitted this hadith to me from the Messenger of Allah (may peace be upon him) in this very mosque.",
      "chain": [
        "30375",
        "20240",
        "11016"
      ]
    },
    {
      "hadith_no": "437",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا عبد بن حميد، أخبرنا يونس بن محمد، حدثنا شيبان بن عبد الرحمن، عن قتادة، عن أبي العالية، حدثنا ابن عم، نبيكم صلى الله عليه وسلم ابن عباس قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مررت ليلة أسري بي على موسى بن عمران - عليه السلام - رجل آدم طوال جعد كأنه من رجال شنوءة ورأيت عيسى ابن مريم مربوع الخلق إلى الحمرة والبياض سبط الرأس ‏\"‏ ‏.‏ وأري مالكا خازن النار والدجال ‏.‏ في آيات أراهن الله إياه فلا تكن في مرية من لقائه ‏.‏ قال كان قتادة يفسرها أن نبي الله صلى الله عليه وسلم قد لقي موسى عليه السلام ‏.‏",
      "text_en": " Abu al-'Aliya reported:                      Ibn Abbas, the son of your Prophet's uncle, told us that the Messenger of Allah (may peace be upon him) had observed: On the night of my night journey I passed by Moses b. 'Imran (peace be upon him), a man light brown in complexion, tall. well-built as if he was one of the men of the Shanu'a, and saw Jesus son of Mary as a medium-statured man with white and red complexion and crisp hair, and I was shown Malik the guardian of Fire, and Dajjal amongst the signs which were shown to me by Allah. He (the narrator) observed: Then do not doubt his (i. e. of the Holy Prophet) meeting with him (Moses). Qatada elucidated it thus: Verily the Apostle of Allah (may peace be upon him), met Moses (peace be upon him).",
      "chain": [
        "30553",
        "20393",
        "20240",
        "11019",
        "11618"
      ]
    },
    {
      "hadith_no": "360",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا معاوية بن عمرو، حدثنا زائدة، عن سماك، ح وحدثني القاسم بن زكرياء، حدثنا عبيد الله بن موسى، عن شيبان، عن عثمان بن عبد الله بن موهب، وأشعث بن أبي الشعثاء، كلهم عن جعفر بن أبي ثور، عن جابر بن سمرة، عن النبي صلى الله عليه وسلم بمثل حديث أبي كامل عن أبي عوانة ‏.‏",
      "text_en": " This hadith is also narrated by another chain of transmitters.",
      "chain": [
        "30201",
        "20389",
        "20320",
        "10770",
        "20340",
        "20240",
        "11524",
        "10896",
        "393"
      ]
    },
    {
      "hadith_no": "1212",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، قالا حدثنا هاشم بن القاسم، حدثنا شيبان، عن هلال بن أبي حميد، عن عروة بن الزبير، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم في مرضه الذي لم يقم منه ‏\"‏ لعن الله اليهود والنصارى اتخذوا قبور أنبيائهم مساجد ‏\"‏ ‏.‏ قالت فلولا ذاك أبرز قبره غير أنه خشي أن يتخذ مسجدا ‏.‏ وفي رواية ابن أبي شيبة ولولا ذاك لم يذكر قالت ‏.‏",
      "text_en": " 'A'isha reported:                      The Messenger of Allah (may peace be upon him) said during his illness from which he never recovered: Allah cursed the Jews and the Christians that they took the graves of their prophets as mosques. She ('A'isha) reported: Had it not been so, his (Prophet's) grave would have been in an open place, but it could not be due to the fear that it may not be taken as a mosque.",
      "chain": [
        "30201",
        "30263",
        "20390",
        "20240",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1320",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني إسحاق بن منصور، أخبرنا عبيد الله بن موسى، عن شيبان، عن يحيى، عن أبي سلمة، عن أبي هريرة، قال بينا أنا أصلي، مع النبي صلى الله عليه وسلم صلاة الظهر سلم رسول الله صلى الله عليه وسلم من الركعتين فقام رجل من بني سليم ‏.‏ واقتص الحديث ‏.‏",
      "text_en": " Abu Huraira reported:                      I offered with the Apostle of Allah (may peace be upon him) the noon prayer and the Messenger of Allah (may peace be upon him) gave salutation after two rak'ahs. A person from Bani Sulaim stood up, and the rest of the hadith was narrated as mentioned above.",
      "chain": [
        "30313",
        "20340",
        "20240",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1469",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني يعقوب بن إبراهيم الدورقي، حدثنا يحيى بن أبي بكير، حدثنا شيبان، عن عبد الملك بن عمير، عن ابن عمارة بن رؤيبة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يلج النار من صلى قبل طلوع الشمس وقبل غروبها ‏\"‏ ‏.‏ وعنده رجل من أهل البصرة فقال آنت سمعت هذا من النبي صلى الله عليه وسلم قال نعم أشهد به عليه ‏.‏ قال وأنا أشهد لقد سمعت النبي صلى الله عليه وسلم يقوله بالمكان الذي سمعته منه ‏.‏",
      "text_en": " Umara b. Ruwaiba reported on the authority of his father that the Messenger of Allah (may peace be upon him) said:                      He who said prayer before the rising of the sun and its setting would not enter the fire (of Hell), and there was a man from Basra (sitting) beside him who said: Did you hear it from the Apostle of Allah (way peace be upon him)? He said: Yes, I bear witness to it. The man from Basra said: I bear witness that I did hear from the Apostle of Allah (may peace be upon him) saying it from the place that you heard from him.",
      "chain": [
        "30400",
        "20365",
        "20240",
        "11368"
      ]
    },
    {
      "hadith_no": "1532",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا شيبان بن فروخ، وأبو الربيع، كلاهما عن عبد الوارث، قال شيبان حدثنا عبد الوارث، عن أبي التياح، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم أحسن الناس خلقا فربما تحضر الصلاة وهو في بيتنا فيأمر بالبساط الذي تحته فيكنس ثم ينضح ثم يؤم رسول الله صلى الله عليه وسلم ونقوم خلفه فيصلي بنا وكان بساطهم من جريد النخل ‏.‏",
      "text_en": " Anas b. Malik reported that the Messenger of Allah (may peace be upon him) wits the best among people in character. On occasions, the time of prayer would come while he was in our house. He would then order to spread the mat lying under him. That was dusted and then water was sprinkled over it. The Messenger of Allah (may peace be upon him) then led the prayer and we stood behind him, and that mat was made of the leaves of date-palm.",
      "chain": [
        "20656",
        "20258",
        "20240",
        "20258",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "1575",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني زهير بن حرب، حدثنا حسين بن محمد، حدثنا شيبان، عن يحيى، عن أبي سلمة، أن أبا هريرة، أخبره أن رسول الله صلى الله عليه وسلم بينما هو يصلي العشاء إذ قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ثم قال قبل أن يسجد ‏\"‏ اللهم نج عياش بن أبي ربيعة ‏\"‏ ‏.‏ ثم ذكر بمثل حديث الأوزاعي إلى قوله ‏\"‏ كسني يوسف ‏\"‏ ‏.‏ ولم يذكر ما بعده ‏.‏",
      "text_en": " Abu Salama narrated that Abu Huraira told him that when the Messenger of Allah (may peace be upon him) pronounced:                     \" Allah listened to him who praised Him.\" and before prostration, he would recite this in the 'Isya' prayer: O Allah! rescue 'Ayyash b. Abu Rabi'a, and the rest of the hadith is the same as narrated by Auza'i to the words:\" Like the famine (at the time) if Joseph.\" but he made no mention of that which follows afterwards.",
      "chain": [
        "30022",
        "20384",
        "20240",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1759",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني زهير بن حرب، حدثنا حسين بن محمد، حدثنا شيبان، عن يحيى، قال سمعت أبا سلمة، ح وحدثني يحيى بن بشر الحريري، حدثنا معاوية، - يعني ابن سلام - عن يحيى بن أبي كثير، قال أخبرني أبو سلمة، أنه سأل عائشة عن صلاة، رسول الله صلى الله عليه وسلم ‏.‏ بمثله غير أن في حديثهما تسع ركعات قائما يوتر منهن ‏.‏",
      "text_en": " Abu Salama is reported to have said. I came to 'A'isha. I said:                      O mother, inform me about the prayer of the Messenger of Allah (may peace be upon him). She said: His (night prayer) in Ramadan and (during other months) was thirteen rak'ahs at night including two rak'ahs of fajr.",
      "chain": [
        "30022",
        "20384",
        "20240",
        "11449",
        "10567",
        "30483",
        "20401",
        "11449",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "1801",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني إسحاق بن منصور، أخبرني عبيد الله، عن شيبان، عن يحيى، قال أخبرني أبو نضرة العوقي، أن أبا سعيد، أخبرهم أنهم، سألوا النبي صلى الله عليه وسلم عن الوتر فقال ‏\"‏ أوتروا قبل الصبح ‏\"‏ ‏.‏",
      "text_en": " Jabir reported Allah's Messenger (may peace be upon him) as saying:                      If anyone is afraid that he may not get up in the latter part of the night, he should observe Witr in the first part of it; and if anyone is eager to get up in the last part of it, he should observe Witr at the end of the night, for prayer at the end of the night is witnessed (by the angels) and that is preferable.",
      "chain": [
        "30313",
        "11201",
        "20240",
        "11449",
        "38"
      ]
    },
    {
      "hadith_no": "2420",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني محمد بن رافع، حدثنا محمد بن عبد الله بن الزبير، حدثنا شيبان، ح وحدثني محمد بن حاتم، - واللفظ له - حدثنا شبابة، حدثني شيبان بن عبد الرحمن، عن يحيى بن أبي كثير، عن أبي سلمة بن عبد الرحمن، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من أنفق زوجين في سبيل الله دعاه خزنة الجنة كل خزنة باب أى فل هلم ‏\"‏ ‏.‏ فقال أبو بكر يا رسول الله ذلك الذي لا توى عليه ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ إني لأرجو أن تكون منهم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      He who spent pairs for the sake of Allah, the guardians of Paradise would call him, (in fact) every guardian of the door (of Paradise would welcome him saying): O, so and so, come on. Upon this Abu Bakr said: Messenger of Allah, (it means) there would be no distress on this person. The Messenger of Allah (may peace be upon him) said. I hope you would be among them.",
      "chain": [
        "30375",
        "20240",
        "38487",
        "20426",
        "20240",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2559",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا حسن الأشيب، حدثنا شيبان، عن يحيى، قال وأخبرني أبو سلمة، أنه سمع ابن عمر، - رضى الله عنهما - يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ الشهر تسع وعشرون ‏\"‏ ‏.‏",
      "text_en": " Ibn Umar (Allah be pleased with both of them) reported Allah's Messenger (may peace be upon him) as saying:                      The month may consist of twenty-nine days.",
      "chain": [
        "38834",
        "20240",
        "11449",
        "10567",
        "18"
      ]
    },
    {
      "hadith_no": "2637",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الحسن بن موسى، حدثنا شيبان، عن يحيى، بن أبي كثير عن أبي سلمة، أن عمر بن عبد العزيز، أخبره أن عروة بن الزبير أخبره أن عائشة أم المؤمنين - رضى الله عنها - أخبرته أن رسول الله صلى الله عليه وسلم كان يقبلها وهو صائم ‏.‏",
      "text_en": " 'Urwa b. Zubair narrated that 'A'isha the Mother of the Believers (Allah be pleased with her) informed him that the Messenger of Allah (may peace be upon him) kissed her while fasting.",
      "chain": [
        "30201",
        "20383",
        "20240",
        "11449",
        "10567",
        "11010",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2708",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبيد الله بن موسى، أخبرنا شيبان، عن أشعث، بن أبي الشعثاء عن جعفر بن أبي ثور، عن جابر بن سمرة، - رضى الله عنه - قال كان رسول الله صلى الله عليه وسلم يأمرنا بصيام يوم عاشوراء ويحثنا عليه ويتعاهدنا عنده فلما فرض رمضان لم يأمرنا ولم ينهنا ولم يتعاهدنا عنده ‏.‏",
      "text_en": " Jabir b Samura reported that the Messenger of Allah (may peace be upon him) commanded us to observe fast on the day of Ashura and exhorted us to do it and was particular about it But when (fasting) in Ramadan was made obligatory, he hence. forth neither commanded us nor forbade us, nor was he so particular about it.",
      "chain": [
        "30201",
        "20340",
        "20240",
        "11324",
        "10896",
        "393"
      ]
    },
    {
      "hadith_no": "2789",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني القاسم بن زكرياء، حدثنا عبيد الله بن موسى، عن شيبان، عن يحيى، عن محمد بن عبد الرحمن، مولى بني زهرة عن أبي سلمة، قال - وأحسبني قد سمعته أنا من أبي سلمة، - عن عبد الله بن عمرو، - رضى الله عنهما - قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ اقرإ القرآن في كل شهر ‏\"‏ ‏.‏ قال قلت إني أجد قوة ‏.‏ قال ‏\"‏ فاقرأه في عشرين ليلة ‏\"‏ ‏.‏ قال قلت إني أجد قوة ‏.‏ قال ‏\"‏ فاقرأه في سبع ولا تزد على ذلك ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. 'Amr (Allah be pleased with them) reported:                      The Messenger of Allah (may peace be upon him) said to me: Recite the whole of the Qur'An during every month. I said: I find power (to recite it) in a shorter period. He said: Then recite it in twenty nights. I said: I find power (to recite it in a shorter period even than this), whereupon he said: Then recite it in seven (nights) and do not exceed beyond it.",
      "chain": [
        "20340",
        "20240",
        "11449",
        "10960",
        "10567",
        "29"
      ]
    },
    {
      "hadith_no": "3314",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، قال حدثنا عبيد الله، - يعني ابن موسى - حدثنا شيبان، عن أشعث بن أبي الشعثاء، عن الأسود بن يزيد، عن عائشة، قالت سألت رسول الله صلى الله عليه وسلم عن الحجر ‏.‏ وساق الحديث بمعنى حديث أبي الأحوص وقال فيه فقلت فما شأن بابه مرتفعا لا يصعد إليه إلا بسلم وقال ‏\"‏ مخافة أن تنفر قلوبهم ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported:                      I asked Allah's Messenger (may peace be upon him) about Hijr, and the rest of the hadith is the same. I also said: Why is it that the door has been made on a higher level, and one cannot (get into it) but with the help of a ladder? The rest of the hadith is the same as reported above and the concluding words are: (I do not change it) out of the apprehension that their hearts may disapprove of it.\"",
      "chain": [
        "30201",
        "20340",
        "20240",
        "11324",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "3372",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني إسحاق بن منصور، أخبرنا عبيد الله بن موسى، عن شيبان، عن يحيى، أخبرني أبو سلمة، أنه سمع أبا هريرة، يقول إن خزاعة قتلوا رجلا من بني ليث عام فتح مكة بقتيل منهم قتلوه فأخبر بذلك رسول الله صلى الله عليه وسلم فركب راحلته فخطب فقال ‏\"‏ إن الله عز وجل حبس عن مكة الفيل وسلط عليها رسوله والمؤمنين ألا وإنها لم تحل لأحد قبلي ولن تحل لأحد بعدي ألا وإنها أحلت لي ساعة من النهار ألا وإنها ساعتي هذه حرام لا يخبط شوكها ولا يعضد شجرها ولا يلتقط ساقطتها إلا منشد ومن قتل له قتيل فهو بخير النظرين إما أن يعطى - يعني الدية - وإما أن يقاد أهل القتيل ‏\"‏ ‏.‏ قال فجاء رجل من أهل اليمن يقال له أبو شاه فقال اكتب لي يا رسول الله ‏.‏ فقال ‏\"‏ اكتبوا لأبي شاه ‏\"‏ ‏.‏ فقال رجل من قريش إلا الإذخر فإنا نجعله في بيوتنا وقبورنا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إلا الإذخر ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported:                      The people of the Khuza'ah tribe killed a man of the tribe of Laith in the Year of Victory as a retaliation for one whom they had killed (whom the people of the tribe of Laith had killed). It was reported to Allah's Messenger (may peace be upon him). He mounted his camel and delivered this address: Verily Allah, the Exalted and Majestic, held back the Ele- phants from Mecca, and gave its domination to His Messenger and believers. Behold, it was not violable for anyone before me and it will not be violable for anyone after me. Behold, it was made violable for me for an hour of a day; and at this very hour it has again been made inviolable (for me as well as for others). So its thorns are not to be cut, its trees are not to be lopped, and (no one is allowed to) pick up a thing dropped, but the one who makes an announcement of it. And one whose fellow is killed is allowed to opt between two alternatives: either he should receive blood-money or get the life of the (murderer) in return. He (the narrator said): A person from the Yemen, who was called Abu Shah, came to him and said: Messenger of Allah, write it down for me, whereupon he (Allah's Messenger) said: Write it down for Abu Shah. One of the persons from among the Quraish also said: Except Idhkhir, for we use it in our houses ant our graves. Thereupon Allah's Messenger (may peace be upon him) said: Except Idhkhir.",
      "chain": [
        "30313",
        "20340",
        "20240",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3404",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا عبيد الله بن موسى، أخبرنا شيبان، ح وحدثني إسحاق بن منصور، أخبرنا عبد الصمد، حدثنا حرب، - يعني ابن شداد - كلاهما عن يحيى بن أبي كثير، بهذا الإسناد ‏.‏ مثله ‏.‏",
      "text_en": " A hadith like this has been narrated by Yabya b. Abu Kathir with the same chain of transmitters.",
      "chain": [
        "30201",
        "20340",
        "20240",
        "30313",
        "20250",
        "20220"
      ]
    },
    {
      "hadith_no": "3507",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني إسحاق بن منصور، حدثنا عبيد الله بن موسى، عن شيبان، عن يحيى، حدثني أبو سلمة، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم بمثله‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Abu Huraira (Allah be pleased with him) through another chain of transmitters.",
      "chain": [
        "30313",
        "20340",
        "20240",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3539",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني زهير بن حرب، حدثنا إسماعيل بن إبراهيم، حدثنا الحجاج بن أبي، عثمان ح وحدثني إبراهيم بن موسى، أخبرنا عيسى، - يعني ابن يونس - عن الأوزاعي، ح وحدثني زهير بن حرب، حدثنا حسين بن محمد، حدثنا شيبان، ح وحدثني عمرو الناقد، ومحمد بن رافع قالا حدثنا عبد الرزاق، عن معمر، ح وحدثنا عبد الله بن عبد الرحمن، الدارمي أخبرنا يحيى بن حسان، حدثنا معاوية، كلهم عن يحيى بن أبي كثير، ‏.‏ بمثل معنى حديث هشام وإسناده ‏.‏ واتفق لفظ حديث هشام وشيبان ومعاوية بن سلام في هذا الحديث‏.‏",
      "text_en": " This hadith has been narrated through another chain of transmitters.",
      "chain": [
        "30022",
        "20208",
        "30309",
        "20347",
        "20024",
        "30022",
        "20384",
        "20240",
        "30263",
        "30375",
        "20121",
        "20115"
      ]
    },
    {
      "hadith_no": "3773",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثني محمد بن رافع، حدثنا حسين بن محمد، حدثنا شيبان، عن يحيى، - وهو ابن أبي كثير - أخبرني أبو سلمة، أن فاطمة بنت قيس، أخت الضحاك بن قيس أخبرته أن أبا حفص بن المغيرة المخزومي طلقها ثلاثا ثم انطلق إلى اليمن فقال لها أهله ليس لك علينا نفقة ‏.‏ فانطلق خالد بن الوليد في نفر فأتوا رسول الله صلى الله عليه وسلم في بيت ميمونة فقالوا إن أبا حفص طلق امرأته ثلاثا فهل لها من نفقة فقال رسول الله صلى الله عليه وسلم ‏\"‏ ليست لها نفقة وعليها العدة ‏\"‏ ‏.‏ وأرسل إليها ‏\"‏ أن لا تسبقيني بنفسك ‏\"‏ ‏.‏ وأمرها أن تنتقل إلى أم شريك ثم أرسل إليها ‏\"‏ أن أم شريك يأتيها المهاجرون الأولون فانطلقي إلى ابن أم مكتوم الأعمى فإنك إذا وضعت خمارك لم يرك ‏\"‏ ‏.‏ فانطلقت إليه فلما مضت عدتها أنكحها رسول الله صلى الله عليه وسلم أسامة بن زيد بن حارثة.",
      "text_en": " Abu Salama reported that Fatima bint Qais, the sister of al-Dahhak b. Qais informed him that Abu Hafs b. Mughira al-Makhzumi divorced her three times and then he proceeded on to the Yemen. The members of his family said to her:                      There is no maintenance allowance due to you from us. Khalid b. Walid along with a group of persons visited Allah's Messenger (may peace be upon him) in the house of Maimuna and they said: Abu Hafs has divorced his wife with three pronouncements; is there any maintenance allowance due to her? Thereupon Allah's Messenger (may peace be upon him) said: No maintenance allowance is due to her, but she is required to spend the 'Idda; and he sent her the message that she should not be hasty in making a decision about herself and commanded her to move to the house of Umm Sharik, and then sent her the message that as the first immigrants (frequently) visit the house of Umm Sharik, she should better go to the house of Ibn Umm Maktum, the blind, (and further said: In case you put off your head-dress, he (Ibn Umm Makhtum) will not see you. So she went to his house, and when the 'Idda was over, Allah's Messenger (may peace be upon him) married her to Usama b. Zaid b. Haritha.",
      "chain": [
        "30375",
        "20384",
        "20240",
        "11449",
        "10567",
        "224"
      ]
    },
    {
      "hadith_no": "4169",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثني إسحاق بن منصور، حدثنا عبيد الله بن موسى، عن شيبان، عن يحيى، عن أبي سلمة، عن أبي سعيد، قال كنا نرزق تمر الجمع على عهد رسول الله صلى الله عليه وسلم وهو الخلط من التمر فكنا نبيع صاعين بصاع فبلغ ذلك رسول الله صلى الله عليه وسلم فقال ‏\"‏ لا صاعى تمر بصاع ولا صاعى حنطة بصاع ولا درهم بدرهمين ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id (Allah be pleased with him) reported:                      We were given to eat, during the lifetime of Allah's Messenger (may peace be upon him), dates of different qualities mixed together, and we used to sell two sa's of these for one sa, (of fine quality of dates). This reached Allah's Messenger (may peace be upon him), whereupon he said: There should be no exchange of two sa's of (inferior) dates for one sa (of fine dates) and two sa's of (inferior) wheat for one sa' of (fine) wheat. and one dirham for two dirharms.",
      "chain": [
        "30313",
        "20340",
        "20240",
        "11449",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "4472",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "وحدثني حجاج بن الشاعر، والقاسم بن زكرياء، قالا حدثنا عبيد الله بن موسى، عن شيبان، عن الأعمش، بالإسنادين جميعا ‏.‏ نحو حديث سفيان ولم يذكرا في الحديث قوله ‏\"‏ والذي لا إله غيره ‏\"‏ ‏.‏",
      "text_en": " This hadith has been reported on the authority of A'mash with the same chain of narrators but with a slight variation of words, i. e. he did not say:                      By Him besides Whom there is no god.",
      "chain": [
        "38834",
        "20340",
        "20240"
      ]
    },
    {
      "hadith_no": "4581",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "وحدثني القاسم بن زكرياء، حدثنا عبيد الله بن موسى، عن شيبان، عن منصور، بهذا الإسناد ‏.‏ مثله ‏.‏ غير أنه قال وحرم عليكم رسول الله صلى الله عليه وسلم ‏.‏ ولم يقل إن الله حرم عليكم ‏.‏",
      "text_en": " A hadith like this has been trransmitted on the authority of Mansur with a slight vairiation of words.",
      "chain": [
        "20340",
        "20240"
      ]
    },
    {
      "hadith_no": "4776",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا يحيى بن يحيى، وشيبان بن فروخ، قال يحيى أخبرنا وقال، شيبان حدثنا عبد الوارث، عن أبي التياح، حدثنا أنس بن مالك، قال كانوا يرتجزون ورسول الله صلى الله عليه وسلم معهم وهم يقولون اللهم لا خير إلا خير الآخره فانصر الأنصار والمهاجره وفي حديث شيبان بدل فانصر فاغفر ‏.‏",
      "text_en": " According to still another version of the tradition narrated by the same authority, and handed down through a different chain of transmitters, it has been reported that they (the Companions of the Holy Prophet) were reciting rajaz verses and the Messenger of Allah (may peace be upon him) was (reciting) with them. And they were chanting:                      O God, there is no good but the good of the Hereafter. So help Thou the Ansar and the Muhajirs. Shaiban substituted\" So forgive Thou\" for\" So help Thou\".",
      "chain": [
        "30399",
        "20656",
        "20031",
        "20240",
        "20258",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "4903",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا أحمد بن خراش، حدثنا حبان، حدثنا أبو عوانة، ح وحدثني القاسم بن، زكرياء حدثنا عبيد الله بن موسى، عن شيبان، ح وحدثنا إسحاق بن إبراهيم، أخبرنا المصعب بن المقدام الخثعمي، حدثنا إسرائيل، ح وحدثني حجاج، حدثنا عارم بن الفضل، حدثنا حماد بن زيد، حدثنا عبد الله بن المختار، ورجل، سماه كلهم عن زياد بن علاقة، عن عرفجة، عن النبي صلى الله عليه وسلم بمثله غير أن في حديثهم جميعا ‏\"‏ فاقتلوه ‏\"‏ ‏.‏",
      "text_en": " In another version of the tradition narrated on the same authority through a different chains of transmitters we have the words:                     \" Kill him.\"",
      "chain": [
        "20218",
        "20469",
        "20340",
        "20240",
        "30123",
        "20311",
        "20219",
        "20283",
        "20022",
        "24244",
        "11339"
      ]
    },
    {
      "hadith_no": "5015",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني إسحاق بن منصور، أخبرنا عبيد الله، - يعني ابن موسى - عن شيبان، عن يحيى، بهذا الإسناد مثله ‏.‏",
      "text_en": "",
      "chain": [
        "30313",
        "20340",
        "20240"
      ]
    },
    {
      "hadith_no": "6485",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثني القاسم بن زكرياء، حدثنا عبيد الله، - هو ابن موسى - عن شيبان، عن الأعمش، عن مالك بن الحارث، عن أبي الأحوص، قال أتيت أبا موسى فوجدت عبد الله وأبا موسى ح وحدثنا أبو كريب، حدثنا محمد بن أبي عبيدة، حدثنا أبي، عن الأعمش، عن زيد بن وهب، قال كنت جالسا مع حذيفة وأبي موسى وساق الحديث وحديث قطبة أتم وأكثر ‏.‏",
      "text_en": " Zaid b. Wahab reported:                      I was sitting along with Hudhaifa and Abu Musa, and the rest of the hadith is the same.",
      "chain": [
        "20340",
        "20240",
        "11060",
        "11041",
        "20327",
        "30216",
        "11060",
        "11341"
      ]
    },
    {
      "hadith_no": "6505",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا زهير بن حرب، حدثنا يونس بن محمد، حدثنا شيبان، عن قتادة، حدثنا  أنس بن مالك، أنه أهدي لرسول الله صلى الله عليه وسلم جبة من سندس وكان ينهى عن الحرير فعجب الناس منها فقال ‏\"‏ والذي نفس محمد بيده إن مناديل سعد بن معاذ في الجنة أحسن من هذا ‏\"‏ ‏.‏",
      "text_en": " This hadith has been reported on the authority of Shu'ba combining the two chains of transmitters. Anas b Malik reported that Allah's Messenger (may peace be upon him) was presented a garment of sundus and he prohibited the use of silk. The persons admired it, whereupon he said:                      By Him in Whose Hand is the life of Muhammad, the kerchiefs of Sa'd b. Mu'adh in Paradise are better than this.",
      "chain": [
        "30022",
        "20393",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6837",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثناه أبو بكر بن أبي شيبة، حدثنا عبيد الله، حدثنا شيبان، عن الأعمش، عن  أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لقد رأيت رجلا يتقلب في الجنة في شجرة قطعها من ظهر الطريق كانت تؤذي الناس ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying that he saw a person enjoying himself in Paradise because of the tree that he cut from the path which was a source of inconvenience to the people.",
      "chain": [
        "11201",
        "20240",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "7161",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "وحدثناه يحيى بن حبيب الحارثي، حدثنا معتمر بن سليمان، قال قال لي أبي حدثنا قتادة، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا الحسن بن موسى، حدثنا شيبان، بن عبد الرحمن ح وحدثنا ابن المثنى، حدثنا أبو الوليد، حدثنا أبو عوانة، كلاهما عن قتادة، ذكروا جميعا بإسناد شعبة نحو حديثه وفي حديث شيبان وأبي عوانة ‏\"‏ أن رجلا من الناس رغسه الله مالا وولدا ‏\"‏ ‏.‏ وفي حديث التيمي ‏\"‏ فإنه لم يبتئر عند الله خيرا ‏\"‏ ‏.‏ قال فسرها قتادة لم يدخر عند الله خيرا ‏.‏ وفي حديث شيبان ‏\"‏ فإنه والله ما ابتأر عند الله خيرا ‏\"‏ ‏.‏ وفي حديث أبي عوانة ‏\"‏ ما امتأر ‏\"‏ ‏.‏ بالميم ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Shu'ba with the chain of transmitters but with a slight variation of wording and Qatada explained the word\" lam yasiru\" as:                     \" I find no good in store for rxie in the eye of Allah.\"",
      "chain": [
        "20288",
        "11289",
        "11019",
        "30201",
        "20383",
        "20240",
        "20296"
      ]
    },
    {
      "hadith_no": "7254",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثني زهير بن حرب، وعبد بن حميد، قالا حدثنا يونس بن محمد، حدثنا شيبان، حدثنا قتادة، عن أنس، أن أهل، مكة سألوا رسول الله صلى الله عليه وسلم أن يريهم آية فأراهم انشقاق القمر مرتين ‏.‏  وحدثنيه محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن قتادة، عن أنس، بمعنى حديث شيبان ‏.‏",
      "text_en": " Anas reported that the people of Mecca demanded from Allah's Messenger (may peace be upon him) that he should show them (some) signs (miracles) and he showed tlicin the splitting of the moon. This hadlth has been narrated on the authority of Anas through another chain of transmitters.",
      "chain": [
        "30022",
        "30553",
        "20393",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "7265",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثني زهير بن حرب، وعبد بن حميد، - واللفظ لزهير - قالا حدثنا يونس، بن محمد حدثنا شيبان، عن قتادة، حدثنا أنس بن مالك، أن رجلا، قال يا رسول الله كيف يحشر الكافر على وجهه يوم القيامة قال ‏\"‏ أليس الذي أمشاه على رجليه في الدنيا قادرا على أن يمشيه على وجهه يوم القيامة ‏\"‏ ‏.‏ قال قتادة بلى وعزة ربنا ‏.‏",
      "text_en": " Anas b. Malik reported that a person said:                      Allah's Messenger, how the non-believers would be made to assemble on the Day of Resurrection (by crawling) on their faces? Thereupon he said: Is He Who is powerfnl to make them walk on their feet is not powerful enough to make them (crawl) upon their faces on the Day of Resurrection? Qatada said: Of conrse, it is so. (He adjured): By the might of our Lord.",
      "chain": [
        "30022",
        "30553",
        "20393",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "7348",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يونس بن محمد، حدثنا شيبان بن عبد الرحمن، قال قال قتادة سمعت أبا نضرة، يحدث عن سمرة، أنه سمع نبي الله صلى الله عليه وسلم يقول ‏\"‏ إن منهم من تأخذه النار إلى كعبيه ومنهم من تأخذه إلى حجزته ومنهم من تأخذه إلى عنقه ‏\"‏ ‏.‏",
      "text_en": " Samura b. Jundub reported Allah's Apostle (may peace -be upon him) as saying:                      There will be some to whose ankels the fire will reach, some to whose knees, some to whose waist the fire will reach, and some to whose collar-bone the fire will reach.",
      "chain": [
        "30201",
        "20393",
        "20240",
        "11019",
        "10721",
        "394"
      ]
    },
    {
      "hadith_no": "7356",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا عبد بن حميد، حدثنا يونس بن محمد، حدثنا شيبان، عن قتادة، حدثنا  أنس بن مالك، أن نبي الله صلى الله عليه وسلم قال ‏\"‏ لا تزال جهنم تقول هل من مزيد ‏.‏ حتى يضع فيها رب العزة تبارك وتعالى قدمه فتقول قط قط وعزتك ‏.‏ ويزوى بعضها إلى بعض ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported that Allah's Apostle (may peace be upon him) said that the Hell would continue to say:                      Is there anything more, until Allah, the Exalted and High, would place His foot therein and that would say: Enough, enough, by Your Honour, and some parts of it would draw close to the other.",
      "chain": [
        "30553",
        "20393",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "7395",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا عبد بن حميد، حدثنا يونس بن محمد، حدثنا شيبان بن عبد الرحمن، عن  قتادة، حدثنا أنس بن مالك، قال قال نبي الله صلى الله عليه وسلم ‏\"‏ إن العبد إذا وضع في قبره وتولى عنه أصحابه إنه ليسمع قرع نعالهم ‏\"‏ ‏.‏ قال ‏\"‏ يأتيه ملكان فيقعدانه فيقولان له ما كنت تقول في هذا الرجل ‏\"‏ ‏.‏ قال ‏\"‏ فأما المؤمن فيقول أشهد أنه عبد الله ورسوله ‏\"‏ ‏.‏ قال ‏\"‏ فيقال له انظر إلى مقعدك من النار قد أبدلك الله به مقعدا من الجنة ‏\"‏ ‏.‏ قال نبي الله صلى الله عليه وسلم ‏\"‏ فيراهما جميعا ‏\"‏ ‏.‏ قال قتادة وذكر لنا أنه يفسح له في قبره سبعون ذراعا ويملأ عليه خضرا إلى يوم يبعثون ‏.‏",
      "text_en": " Anas b. Malik reported Allah's Apostle (may peace be upon him) having said:                      When the servant is placed in his grave and his companions retrace their steps arid he hears the noise of the footsteps, then two angels come to him and make him sit and say to him: What you have to say about this person (the Holy Prophet)? If he is d believer, lie would say: I bear testimony to the fact that he is a servant of Allah and His Messenger. Then it would be said to him: Look to your seat in the Hell- Fire, for Allah has substituted (the seat of yours) with a seat in Paradise. Allah's Messenger (may peace be upon him) said: He would be shown both the seats. Qatada said: It was mentioned to us that his grave (the grave of a believer) expands to seventy cubits and is full with verdure until the Day when they would be resurrected.",
      "chain": [
        "30553",
        "20393",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "7558",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثني محمد بن رافع، حدثنا حسين بن محمد، حدثنا شيبان، عن يحيى، عن أبي، سلمة قال سمعت أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا أخبركم عن الدجال حديثا ما حدثه نبي قومه إنه أعور وإنه يجيء معه مثل الجنة والنار فالتي يقول إنها الجنة هي النار وإني أنذرتكم به كما أنذر به نوح قومه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      May I not inform you about the Dajjal what no Apostle of Allah narrated to his people? He would be blind and he would bring along with him an Image of Paradise and Hell-Fire and what he would call as Paradise that would be Hell-Fire and I warn you as Noah warned his people.",
      "chain": [
        "30375",
        "20384",
        "20240",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "452",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن حاتم، حدثنا عبيد الله بن موسى، عن شيبان، عن فراس، عن عطية، عن ابن عمر، أن مسجد النبي، صلى الله عليه وسلم كانت سواريه على عهد رسول الله صلى الله عليه وسلم من جذوع النخل أعلاه مظلل بجريد النخل ثم إنها نخرت في خلافة أبي بكر فبناها بجذوع النخل وبجريد النخل ثم إنها نخرت في خلافة عثمان فبناها بالآجر فلم تزل ثابتة حتى الآن ‏.‏",
      "text_en": " Ibn 'Umar reported:                      The pillars of the mosque of the Prophet (ﷺ) during the life time of the Messenger of Allah (ﷺ) were made of the trunks of the palm-tree; they covered from the above by twigs of the palm-tree; they decayed during the caliphate of Abu Bakr. He built it afresh with trunks and twigs of the palm-tree. But they again decayed during the caliphate of 'Uthman. He, therefore, built it with bricks. That survives until today.",
      "chain": [
        "30514",
        "20340",
        "20240",
        "11385",
        "18"
      ]
    },
    {
      "hadith_no": "948",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد السلام بن عبد الرحمن الوابصي، حدثنا أبي، عن شيبان، عن حصين بن عبد الرحمن، عن هلال بن يساف، قال قدمت الرقة فقال لي بعض أصحابي هل لك في رجل من أصحاب النبي صلى الله عليه وسلم قال قلت غنيمة فدفعنا إلى وابصة قلت لصاحبي نبدأ فننظر إلى دله فإذا عليه قلنسوة لاطئة ذات أذنين وبرنس خز أغبر وإذا هو معتمد على عصا في صلاته فقلنا بعد أن سلمنا ‏.‏ فقال حدثتني أم قيس بنت محصن أن رسول الله صلى الله عليه وسلم لما أسن وحمل اللحم اتخذ عمودا في مصلاه يعتمد عليه ‏.‏",
      "text_en": " Narrated Umm Qays bint Mihsan:                     Hilal ibn Yasaf said: I came to ar-Raqqah (a place in Syria). One of my companions said to me: Do you want to see any of the Companions of the Prophet (ﷺ)? I said: A good opportunity. So we went to Wabisah. I said to my friend: Let us first see his mode of living. He had a cap with two ears stuck (to his head), and wearing a brown silken robe. He was resting on a staff during prayer. We asked him (about resting on the staff) after salutation; He said: Umm Qays daughter of Mihsan said to me that when the Messenger of Allah (ﷺ) became aged and the flesh grew increasingly on him, he took a prop at his place of prayer and rested on it.",
      "chain": [
        "30510",
        "20240",
        "15097",
        "10835"
      ]
    },
    {
      "hadith_no": "1107",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن خالد، حدثنا الوليد، أخبرني شيبان أبو معاوية، عن سماك بن حرب، عن جابر بن سمرة السوائي، قال كان رسول الله صلى الله عليه وسلم لا يطيل الموعظة يوم الجمعة إنما هن كلمات يسيرات ‏.‏",
      "text_en": " Narrated Jabir ibn Samurah as-Suwa'i:                     The Messenger of Allah (ﷺ) would not lengthen the sermon on Friday. He would say a few words.",
      "chain": [
        "37534",
        "20733",
        "20240",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1309",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا ابن كثير، حدثنا سفيان، عن مسعر، عن علي بن الأقمر، ح وحدثنا محمد بن حاتم بن بزيع، حدثنا عبيد الله بن موسى، عن شيبان، عن الأعمش، عن علي بن الأقمر، - المعنى - عن الأغر، عن أبي سعيد، وأبي، هريرة قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أيقظ الرجل أهله من الليل فصليا أو صلى ركعتين جميعا كتبا في الذاكرين والذاكرات ‏\"‏ ‏.‏ ولم يرفعه ابن كثير ولا ذكر أبا هريرة جعله كلام أبي سعيد ‏.‏ قال أبو داود رواه ابن مهدي عن سفيان قال وأراه ذكر أبا هريرة ‏.‏ قال أبو داود وحديث سفيان موقوف ‏.‏",
      "text_en": " Narrated AbuSa'id and AbuHurayrah:                     The Prophet (ﷺ) said: If a man awakens his wife at night, and then both pray or both offer two rak'ahs together, the (name of the )man will be recorded among those who mention the name of Allah, and the (name of the) woman will be recorded among those who mention the name of Allah. Ibn Kathir did not narrate this tradition as a statement of the Prophet (ﷺ), but he reported it as a statement of Abu Sa'id.Abu Dawud said: This tradition has been narrated by Ibn Mahdi from Sufyan and I think he mentioned the name of Sufyan. He also said: The tradition transmitted by Sufyan is a statement of the Companion (and not that of the Prophet).",
      "chain": [
        "30169",
        "20012",
        "20359",
        "11375",
        "30163",
        "20340",
        "20240",
        "11060",
        "11375",
        "15022",
        "38",
        "13"
      ]
    },
    {
      "hadith_no": "1451",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن حاتم بن بزيع، حدثنا عبيد الله بن موسى، عن شيبان، عن الأعمش، عن علي بن الأقمر، عن الأغر أبي مسلم، عن أبي سعيد الخدري، وأبي، هريرة قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ من استيقظ من الليل وأيقظ امرأته فصليا ركعتين جميعا كتبا من الذاكرين الله كثيرا والذاكرات ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSa'id ; AbuHurayrah:                     The Prophet (ﷺ) said: When a man himself wakes at night and wakens his wife and they pray two rak'ahs together, they are recorded among the men and women who make much mention of Allah.",
      "chain": [
        "30163",
        "20340",
        "20240",
        "11060",
        "11375",
        "38",
        "13"
      ]
    },
    {
      "hadith_no": "2367",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن هشام، ح وحدثنا أحمد بن حنبل، حدثنا حسن بن موسى، حدثنا شيبان، - جميعا - عن يحيى، عن أبي قلابة، عن أبي أسماء، - يعني الرحبي - عن ثوبان، عن النبي صلى الله عليه وسلم قال ‏\"‏ أفطر الحاجم والمحجوم ‏\"‏ ‏.‏ قال شيبان أخبرني أبو قلابة أن أبا أسماء الرحبي حدثه أن ثوبان مولى رسول الله صلى الله عليه وسلم أخبره أنه سمع رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Thawban:                     The Prophet (ﷺ) said: A man who cupped and a man  who has himself cupped broke their fast. The narrator Shayban said in his version: AbuQilabah told me that AbuAsma' ar-Rahbi told him that Thawban, the client of the Messenger of Allah (ﷺ), told him that he heard the Prophet (ﷺ) say this.",
      "chain": [
        "30175",
        "20031",
        "11065",
        "30007",
        "20240",
        "11449",
        "11047",
        "10883",
        "130"
      ]
    },
    {
      "hadith_no": "2368",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا حسن بن موسى، حدثنا شيبان، عن يحيى، قال حدثني أبو قلابة الجرمي، أنه أخبره أن شداد بن أوس بينما هو يمشي مع النبي صلى الله عليه وسلم فذكر نحوه ‏.‏",
      "text_en": " Narrated Shaddad ibn Aws:                     The tradition mentioned above (No. 2361) has also been transmitted by Shaddad ibn Aws through a different chain of narrators. This version adds: While Shaddad ibn Aws was walking along with the Prophet (ﷺ)....The narrator then transmitted the rest of the tradition to the same effect.",
      "chain": [
        "30007",
        "20240",
        "11449",
        "11047"
      ]
    },
    {
      "hadith_no": "2450",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو كامل، حدثنا أبو داود، حدثنا شيبان، عن عاصم، عن زر، عن عبد الله، قال كان رسول الله صلى الله عليه وسلم يصوم - يعني من غرة كل شهر - ثلاثة أيام ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Messenger of Allah (ﷺ) used to fast three days every month.",
      "chain": [
        "30559",
        "30002",
        "20240",
        "11080",
        "11337",
        "16"
      ]
    },
    {
      "hadith_no": "2545",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا يحيى بن معين، حدثنا حسين بن محمد، عن شيبان، عن عيسى بن علي، عن أبيه، عن جده ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ يمن الخيل في شقرها ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: The most favoured horses are the sorrel.",
      "chain": [
        "30020",
        "20384",
        "20240",
        "17"
      ]
    },
    {
      "hadith_no": "4004",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو معمر عبد الله بن عمرو بن أبي الحجاج المنقري، حدثنا عبد الوارث، حدثنا شيبان، عن الأعمش، عن شقيق، عن ابن مسعود، أنه قرأ ‏{‏ هيت لك ‏}‏ فقال شقيق إنا نقرؤها ‏{‏ هئت لك ‏}‏ يعني فقال ابن مسعود أقرؤها كما علمت أحب إلى ‏.‏",
      "text_en": " Narrated Shariq:                     Ibn Mas'ud said read the verse: \"Now come, thou\" (haita laka). Then Shariq said: We read it, \"hi'tu laka\" (I am prepared for thee). Ibn Mas'ud said: I read it as I have been taught ; it is dearer to me.",
      "chain": [
        "20258",
        "20240",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "4162",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا نصر بن علي، حدثنا أبو أحمد، عن شيبان بن عبد الرحمن، عن عبد الله بن المختار، عن موسى بن أنس، عن أنس بن مالك، قال كانت للنبي صلى الله عليه وسلم سكة يتطيب منها ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Prophet (ﷺ)  had sikkah with which he perfumed himself.",
      "chain": [
        "30395",
        "20355",
        "20240",
        "24244",
        "14383",
        "19"
      ]
    },
    {
      "hadith_no": "4249",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا عبيد الله بن موسى، عن شيبان، عن الأعمش، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ ويل للعرب من شر قد اقترب أفلح من كف يده ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Prophet (ﷺ) as saying: Woe to Arabs because of evil which has drawn near! He will escape who restrains his hand.",
      "chain": [
        "11222",
        "20340",
        "20240",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "4332",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا أحمد بن إبراهيم، حدثنا عبيد الله، - يعني ابن موسى - حدثنا شيبان، عن الأعمش، عن سالم، عن جابر، قال فقدنا ابن صياد يوم الحرة ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     We saw the last of Ibn Sayyad at the battle of the Harrah.",
      "chain": [
        "30494",
        "20340",
        "20240",
        "11060",
        "11011",
        "34"
      ]
    },
    {
      "hadith_no": "4564",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "قال أبو داود وجدت في كتابي عن شيبان، - ولم أسمعه منه - فحدثناه أبو بكر، - صاحب لنا ثقة - قال حدثنا شيبان، حدثنا محمد، - يعني ابن راشد - عن سليمان، - يعني ابن موسى - عن عمرو بن شعيب، عن أبيه، عن جده، قال كان رسول الله صلى الله عليه وسلم يقوم دية الخطإ على أهل القرى أربعمائة دينار أو عدلها من الورق يقومها على أثمان الإبل فإذا غلت رفع في قيمتها وإذا هاجت رخصا نقص من قيمتها وبلغت على عهد رسول الله صلى الله عليه وسلم ما بين أربعمائة دينار إلى ثمانمائة دينار أو عدلها من الورق ثمانية آلاف درهم وقضى رسول الله صلى الله عليه وسلم على أهل البقر مائتى بقرة ومن كان دية عقله في الشاء فألفى شاة قال وقال رسول الله صلى الله عليه وسلم ‏\"‏ إن العقل ميراث بين ورثة القتيل على قرابتهم فما فضل فللعصبة ‏\"‏ ‏.‏ قال وقضى رسول الله صلى الله عليه وسلم في الأنف إذا جدع الدية كاملة وإن جدعت ثندوته فنصف العقل خمسون من الإبل أو عدلها من الذهب أو الورق أو مائة بقرة أو ألف شاة وفي اليد إذا قطعت نصف العقل وفي الرجل نصف العقل وفي المأمومة ثلث العقل ثلاث وثلاثون من الإبل وثلث أو قيمتها من الذهب أو الورق أو البقر أو الشاء والجائفة مثل ذلك وفي الأصابع في كل أصبع عشر من الإبل وفي الأسنان في كل سن خمس من الإبل وقضى رسول الله صلى الله عليه وسلم أن عقل المرأة بين عصبتها من كانوا لا يرثون منها شيئا إلا ما فضل عن ورثتها فإن قتلت فعقلها بين ورثتها وهم يقتلون قاتلهم وقال رسول الله صلى الله عليه وسلم ‏\"‏ ليس للقاتل شىء وإن لم يكن له وارث فوارثه أقرب الناس إليه ولا يرث القاتل شيئا ‏\"‏ ‏.‏ قال محمد هذا كله حدثني به سليمان بن موسى عن عمرو بن شعيب عن أبيه عن جده عن النبي صلى الله عليه وسلم ‏.‏ قال أبو داود محمد بن راشد من أهل دمشق هرب إلى البصرة من القتل ‏.‏",
      "text_en": " Narrated Abu Dawud:                     I found in my notebook from Shaiban and I did not hear from him ; Abu Bakr, a reliable friend of ours, said: Shaiban - Muhammad b. Rashid - Sulaiman b. Musad - 'Amr b. Suh'aib, On his father's authority, said that his grandfather said: The Messenger of Allah (ﷺ) would fix the blood-money for accidental killing at the rate of four hundred dinars or their equivalent in silver for townsmen, and he would fix it according to the price of camels. So when they were dear, he increased the amount to be paid, and when cheap prices prevailed he reduced the amount to be paid. In the time of the Messenger of Allah (ﷺ) they reached between four hundred and eight hundred dinars, their equivalent in silver being eight thousand dirhams.  He said: The Messenger of Allah (ﷺ) gave judgment that those who possessed cattle should pay two hundred cows, and those who possessed sheep two thousand sheep.  He said: The Messenger of Allah (ﷺ) said: The blood-money is to be treated as something to be inherited by the heirs of the one who has been killed, and the remainder should be divided among the agnates.  He said: The Messenger of Allah (ﷺ) gave judgment that for cutting off a nose completely there was full blood-money, one hundred (camels) were to be paid. If the tip of the nose was cut off, half of the blood-money,i.e. fifty camels were to be paid, or their equivalent in gold or in silver, or a hundred cows, or one thousand sheep. For the hand, when it was cut of,f half of the blood-money was to be paid; for one foot of half, the blood-money was to be paid. For a wound in the head, a third of the blood-money was due, i.e. thirty-three camels and a third of the blood-money, or their equivalent in gold, silver, cows or sheep. For a head thrust which reaches the body, the same blood-money was to be paid. Ten camels were to be paid for every finger, and five camels for every tooth.  The Messenger of Allah (ﷺ) gave judgment that the blood-money for a woman should be divided among her relatives on her father's side, who did not inherit anything from her except the residence of her heirs. If she was killed, her blood-money should be distributed among her heirs, and they would have the right of taking revenge on the murderer.  The Messenger of Allah (ﷺ) said: There is nothing for the murderer; and if he (the victim) has no heir, his heir will be the one who is nearest to him among the people, but the murderer should not inherit anything.  Muhammad said: All this has been transmitted to me by Sulayman ibn Musa on the authority of Amr ibn Shu'aib who, on his father's authority, said that his grandfather heard it from the Prophet (ﷺ).Abu Dawud said: Muhammad b. Rashid, an inhabitant of Damascus, fled from Basrah escaping murder.",
      "chain": [
        "20240",
        "20719",
        "10880",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "5128",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن المثنى، حدثنا يحيى بن أبي بكير، حدثنا شيبان، عن عبد الملك بن عمير، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ المستشار مؤتمن ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: He who is consulted is trustworthy.",
      "chain": [
        "30170",
        "20365",
        "20240",
        "11368",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "742",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا القاسم بن دينار، حدثنا عبيد الله بن موسى، وطلق بن غنام، عن شيبان، عن عاصم، عن زر، عن عبد الله، قال كان رسول الله صلى الله عليه وسلم يصوم من غرة كل شهر ثلاثة أيام وقلما كان يفطر يوم الجمعة ‏.‏ قال وفي الباب عن ابن عمر وأبي هريرة ‏.‏ قال أبو عيسى حديث عبد الله حديث حسن غريب ‏.‏ وقد استحب قوم من أهل العلم صيام يوم الجمعة وإنما يكره أن يصوم يوم الجمعة لا يصوم قبله ولا بعده ‏.‏ قال وروى شعبة عن عاصم هذا الحديث ولم يرفعه ‏.‏",
      "text_en": " Abdullah narrated:                     \"The Messenger of Allah would fasting during the beginning of every month for three days, and Friday was the least of the days that he did not fast.\"",
      "chain": [
        "20340",
        "30197",
        "20240",
        "11080",
        "11337",
        "16"
      ]
    },
    {
      "hadith_no": "937",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا الحسن بن موسى، حدثنا شيبان، عن منصور، عن مجاهد، عن ابن عمر، أن النبي صلى الله عليه وسلم اعتمر أربعا إحداهن في رجب ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Ibn Umar narrated:                     \"The Prophet performed Umrah four times, one of them was during Rajab.\"",
      "chain": [
        "30242",
        "20383",
        "20240",
        "11067",
        "11028",
        "18"
      ]
    },
    {
      "hadith_no": "1232",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا حسين بن محمد، حدثنا شيبان، عن منصور، عن إبراهيم، عن الأسود، عن أبي السنابل بن بعكك، قال وضعت سبيعة بعد وفاة زوجها بثلاثة وعشرين أو خمسة وعشرين يوما فلما تعلت تشوفت للنكاح فأنكر عليها ذلك فذكر ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ إن تفعل فقد حل أجلها ‏\"‏ ‏.‏",
      "text_en": " Al-Aswad narrated from Abu As-Sanabil bin Ba'kak who said:                     \"Subai'ah delivered twenty-three or twenty-five days after her husband had died. So when she was ready (finished post-natal bleeding) she adorned herself for marriage, but she was rebuked for doing that, so it was mentioned to the Prophet and he said: \"If she has done that then her time has come.'\"",
      "chain": [
        "30242",
        "20384",
        "20240",
        "11067",
        "11051",
        "11054",
        "863"
      ]
    },
    {
      "hadith_no": "1233",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا الحسن بن موسى، حدثنا شيبان، عن منصور، نحوه ‏.‏ قال وفي الباب عن أم سلمة، ‏.‏ قال أبو عيسى حديث أبي السنابل حديث مشهور من هذا الوجه ‏.‏ ولا نعرف للأسود سماعا من أبي السنابل ‏.‏ وسمعت محمدا يقول لا أعرف أن أبا السنابل عاش بعد النبي صلى الله عليه وسلم ‏.‏ والعمل على هذا عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أن الحامل المتوفى عنها زوجها إذا وضعت فقد حل التزويج لها وإن لم تكن انقضت عدتها ‏.‏ وهو قول سفيان الثوري والشافعي وأحمد وإسحاق ‏.‏ وقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم تعتد آخر الأجلين ‏.‏ والقول الأول أصح ‏.‏",
      "text_en": "",
      "chain": [
        "30242",
        "20383",
        "20240",
        "11067",
        "11035"
      ]
    },
    {
      "hadith_no": "1241",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن منيع، أخبرنا حسين بن محمد، أخبرنا شيبان، عن يحيى بن أبي كثير، عن نافع، قال انطلقت أنا وابن، عمر إلى أبي سعيد فحدثنا أن رسول الله صلى الله عليه وسلم قال سمعته أذناى هاتان يقول ‏\"‏ لا تبيعوا الذهب بالذهب إلا مثلا بمثل والفضة بالفضة إلا مثلا بمثل لا يشف بعضه على بعض ولا تبيعوا منه غائبا بناجز ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي بكر وعمر وعثمان وأبي هريرة وهشام بن عامر والبراء وزيد بن أرقم وفضالة بن عبيد وأبي بكرة وابن عمر وأبي الدرداء وبلال ‏.‏ قال وحديث أبي سعيد عن النبي صلى الله عليه وسلم في الربا حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم إلا ما روي عن ابن عباس أنه كان لا يرى بأسا أن يباع الذهب بالذهب متفاضلا والفضة بالفضة متفاضلا إذا كان يدا بيد ‏.‏ وقال إنما الربا في النسيئة ‏.‏ وكذلك روي عن بعض أصحابه شيء من هذا وقد روي عن ابن عباس أنه رجع عن قوله حين حدثه أبو سعيد الخدري عن النبي صلى الله عليه وسلم ‏.‏ والقول الأول أصح ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم وهو قول سفيان الثوري وابن المبارك والشافعي وأحمد وإسحاق ‏.‏ وروي عن ابن المبارك أنه قال ليس في الصرف اختلاف ‏.‏",
      "text_en": " Narrated Nafi':                     \"Ibn 'Umar and I went to Abu Sa'eed and he narrated to us: 'the Messenger of Allah (ﷺ) said - and I heard him with these [two] ears: \"Do not sell gold for gold except kind for kind, nor sliver for silver except kind for kind, do not exchange more of one than the other, and do not sell what is not present from them for what is present.\"[Abu 'Eisa said:] There are narrations on this topic from Abu Bakr, 'Umar, 'Uthman, Abu Hurairah, Hisham bin 'Amir, Al-Bara', Zaid bin Arqam, Fadalah bin 'Ubaid, Abu Bakrah, Ibn 'Umar, Abu Ad-Darda', and Bilal.[He said:] The Hadith of Abu Sa'eed, from the Prophet (ﷺ) [about Riba] is a Hasan Sahih Hadith.This is acted upon according to the people of knowledge among the Companions of the Prophet (ﷺ) and others, except for what has been related from Ibn 'Abbas; he did not see any harm in exchanging gold for gold or silver for silver, more for less, when it is done hand in hand, and he said: \"Riba' is only in credit.\" Similar it has been related from some of his companions. It has been related that Ibn 'Abbas changed his opinion when Abu Sa'eed narrated it to him from the Prophet (ﷺ). The first view is more correct.And this is acted upon according to the people of knowledge [among the Companions of the Prophet (ﷺ) and others]. It is the view of Sufyan Ath-Thawri, Ibn Al-Mubarak, Ash-Shafi'i, Ahmad, and Ishaq. It has been reported that Ibn Al-Mubarak said: \"There is no difference over exchange.\"",
      "chain": [
        "30242",
        "20384",
        "20240",
        "11449",
        "11014"
      ]
    },
    {
      "hadith_no": "1695",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الله بن الصباح الهاشمي البصري، حدثنا يزيد بن هارون، أخبرنا شيبان يعني ابن عبد الرحمن، حدثنا عيسى بن علي بن عبد الله بن عباس، عن أبيه، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يمن الخيل في الشقر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه من حديث شيبان ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     That the Messenger of Allah (ﷺ) said: \"The blessing of the horse is in its redness.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except from this route, from the narration of Shaiban.",
      "chain": [
        "20472",
        "20240",
        "17"
      ]
    },
    {
      "hadith_no": "2217",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا حسين بن محمد البغدادي، حدثنا شيبان، عن يحيى بن أبي كثير، عن أبي قلابة، عن سالم بن عبد الله بن عمر، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ستخرج نار من حضرموت أو من نحو حضرموت قبل يوم القيامة تحشر الناس ‏\"‏ ‏.‏ قالوا يا رسول الله فما تأمرنا قال ‏\"‏ عليكم بالشام ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن حذيفة بن أسيد وأنس وأبي هريرة وأبي ذر ‏.‏ وهذا حديث حسن غريب صحيح من حديث ابن عمر ‏.‏",
      "text_en": " Salim bin 'Abdullas [bin 'Umar] narrated from his father, that the Messenger of Allah(s.a.w) said:                     \"A fire is coming from Hadramawt- before the Day of Judgement- to gather the people.\" They said: \"O Messenger of Allah! What do you order us?\" He said: \"Stick to Ash-Sham.\"",
      "chain": [
        "30242",
        "20384",
        "20240",
        "11449",
        "11047",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "2369",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا آدم بن أبي إياس، حدثنا شيبان أبو معاوية، حدثنا عبد الملك بن عمير، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، قال خرج النبي صلى الله عليه وسلم في ساعة لا يخرج فيها ولا يلقاه فيها أحد فأتاه أبو بكر فقال ‏\"‏ ما جاء بك يا أبا بكر ‏\"‏ ‏.‏ فقال خرجت ألقى رسول الله صلى الله عليه وسلم وأنظر في وجهه والتسليم عليه ‏.‏ فلم يلبث أن جاء عمر فقال ‏\"‏ ما جاء بك يا عمر ‏\"‏ ‏.‏ قال الجوع يا رسول الله قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ وأنا قد وجدت بعض ذلك ‏\"‏ ‏.‏ فانطلقوا إلى منزل أبي الهيثم بن التيهان الأنصاري وكان رجلا كثير النخل والشاء ولم يكن له خدم فلم يجدوه فقالوا لامرأته أين صاحبك فقالت انطلق يستعذب لنا الماء ‏.‏ فلم يلبثوا أن جاء أبو الهيثم بقربة يزعبها فوضعها ثم جاء يلتزم النبي صلى الله عليه وسلم ويفديه بأبيه وأمه ثم انطلق بهم إلى حديقته فبسط لهم بساطا ثم انطلق إلى نخلة فجاء بقنو فوضعه فقال النبي صلى الله عليه وسلم ‏\"‏ أفلا تنقيت لنا من رطبه ‏\"‏ ‏.‏ فقال يا رسول الله إني أردت أن تختاروا أو قال تخيروا من رطبه وبسره ‏.‏ فأكلوا وشربوا من ذلك الماء فقال رسول الله صلى الله عليه وسلم ‏\"‏ هذا والذي نفسي بيده من النعيم الذي تسألون عنه يوم القيامة ظل بارد ورطب طيب وماء بارد ‏\"‏ ‏.‏ فانطلق أبو الهيثم ليصنع لهم طعاما فقال النبي صلى الله عليه وسلم ‏\"‏ لا تذبحن ذات در ‏\"‏ ‏.‏ قال فذبح لهم عناقا أو جديا فأتاهم بها فأكلوا فقال النبي صلى الله عليه وسلم ‏\"‏ هل لك خادم ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فإذا أتانا سبى فائتنا ‏\"‏ ‏.‏ فأتي النبي صلى الله عليه وسلم برأسين ليس معهما ثالث فأتاه أبو الهيثم فقال النبي صلى الله عليه وسلم ‏\"‏ اختر منهما ‏\"‏ ‏.‏ فقال يا نبي الله اختر لي ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن المستشار مؤتمن خذ هذا فإني رأيته يصلي واستوص به معروفا ‏\"‏ ‏.‏ فانطلق أبو الهيثم إلى امرأته فأخبرها بقول رسول الله صلى الله عليه وسلم فقالت امرأته ما أنت ببالغ ما قال فيه النبي صلى الله عليه وسلم إلا أن تعتقه قال فهو عتيق ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن الله لم يبعث نبيا ولا خليفة إلا وله بطانتان بطانة تأمره بالمعروف وتنهاه عن المنكر وبطانة لا تألوه خبالا ومن يوق بطانة السوء فقد وقي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Abu Hurairah narrated :                     \"The Prophet (s.a.w) went out during an hour in which he would normally not go out, nor meet with anyone. Then Abu Bakr came to him. So he said:\"What brought you O Abu Bakr?\" He said: \"I came to meet the Messenger of Allah (s.a.w) and to look at his face, and to make sure he was safe. It was not long before 'Umar came. He said: \"What has brought you O 'Umar ?\" He said: \"Hunger  O  Messenger of Allah!\"He said: \"I also experienced some of that\" So they went to the home of Abu Al-Haitham At-Taiyyihan Al-Ansari. He was a man with many date-palms and sheep, but he had no servants so they did not find him there. They said to his wife: \"Where is your companion?\" She said: \"He has gone to fetch us some good water.\" It was not long before Abu Al-Haitham came along hauling to a large water-skin which he put down. Then he came to hug the Prophet (s.a.w) and uttered that his father and mother should be ransomed for him. Then he went to grove of his and he spread out a mat for them. Then he went to a date-palm and returned with a cluster of dates which he put down. The prophet (s.a.w) said: \"Why don't you select some ripe dates for us?\" He said:  \"O Messenger of Allah(s.a.w)! I wanted you to select from the ripe dates and the unripe dates.\" So they ate and they drank from that water. The Messenger of Allah(s.a.w) said: \"By the One in Whose Hand is my soul! This is among the favors which you shall be asked about on the Day of Judgement. Cool shade, tasty ripe dates, and cool water.\" Abu Al-Haitham left to prepare some food for them. The Prophet (s.a.w) said: \"Do not slaughter one with milk.\" So he Slaughtered a small female or male goat and brought it to them so they could eat it. The Prophet (s.a.w) said: \"Do you have any servants?\" He said: \"No.\" So he said: \"Then if we get some captives we shall bring them for you.\" So (later) the Prophet (s.a.w) came with 2 males, there was no third among them and he brought them to Abu Al-Haitham. The Prophet (s.a.w) said: \"Choose from them.\" He said: \"O Prophet of Allah! Choose for me.\" So the Prophet (s.a.w) said: \"Indeed the one consulted is entrusted. Take this one for I have seen him praying, and encourage him to do well.\" So Abu Al-Haitham went to his wife and informed her of what the Messenger of Allah (s.a.w) said. So his wife said: \"You will not fulfill what the Prophet (s.a.w) said until you have freed him.\" So he said: \"He is free.\" So the Prophet (s.a.w) said: \"Indeed Allah has not send a Prophet nor made a Khalifah except that he has two groups of supporters, group ordering him to do good, and prohibiting him from evil and a group that never ceases spoiling his affairs. So whoever protected.\"",
      "chain": [
        "34188",
        "20404",
        "20240",
        "11368",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2381",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو كريب، حدثنا معاوية بن هشام، عن شيبان، عن فراس، عن عطية، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من يرائي يرائي الله به ومن يسمع يسمع الله به ‏\"‏ ‏.‏ قال وقال رسول الله صلى الله عليه وسلم ‏\"‏ من لا يرحم الناس لا يرحمه الله ‏\"‏ ‏.‏ وفي الباب عن جندب وعبد الله بن عمرو ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " Abu Sa'eed narrated that the Messenger of Allah (S.a.w) said:                     \"Whoever wants to be seen, Allah will show him, And whoever wants to be heard of, Allah will make him heard off.\" And he narrated that the Messenger of Allah (s.a.w) said: \"He who shows no mercy to the people, Allah shows him no mercy.\"",
      "chain": [
        "30216",
        "20609",
        "20240",
        "11385",
        "38"
      ]
    },
    {
      "hadith_no": "2715",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا عباس الدوري، حدثنا عبيد الله بن موسى، عن شيبان، عن فراس، عن عطية، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ في الجنة شجرة يسير الراكب في ظلها مائة عام لا يقطعها وقال ذلك الظل الممدود ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث أبي سعيد ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated that the Prophet (s.a.w) said:                     \"In Paradise there is a tree, a rider will travel in its shade for a hundred years without reaching an end.\"",
      "chain": [
        "30585",
        "20340",
        "20240",
        "11385",
        "38"
      ]
    },
    {
      "hadith_no": "2731",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا العباس بن محمد الدوري، حدثنا عبيد الله بن موسى، أخبرنا شيبان، عن فراس، عن عطية، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ أول زمرة تدخل الجنة على صورة القمر ليلة البدر والثانية على لون أحسن كوكب دري في السماء لكل رجل منهم زوجتان على كل زوجة سبعون حلة يبدو مخ ساقها من ورائها ‏\"‏ ‏.‏ قال هذا حديث صحيح ‏.‏",
      "text_en": "",
      "chain": [
        "20340",
        "20240",
        "11385",
        "38"
      ]
    },
    {
      "hadith_no": "2778",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Description of Hellfire - كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "39",
      "text_ar": "حدثنا عباس الدوري، حدثنا عبيد الله بن موسى، أخبرنا شيبان، عن الأعمش، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن غلظ جلد الكافر اثنان وأربعون ذراعا وإن ضرسه مثل أحد وإن مجلسه من جهنم كما بين مكة والمدينة ‏\"‏ ‏.‏ هذا حديث حسن صحيح غريب من حديث الأعمش ‏.‏",
      "text_en": " Abu Hurairah narrated that the Prophet (s.a.w) said:                     \"Indeed a disbeliever's skin will be forty-two forearm lengths thick, his molar teeth will be like Uhud (mountain), and his sitting place in Hell will be like what is between Makkah and Al-Madinah.\"",
      "chain": [
        "30585",
        "20340",
        "20240",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2793",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Description of Hellfire - كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "39",
      "text_ar": "حدثنا العباس بن محمد الدوري، حدثنا عبيد الله بن موسى، حدثنا شيبان، عن فراس، عن عطية، عن أبي سعيد، عن النبي صلى الله عليه وسلم قال ‏\"‏ ناركم هذه جزء من سبعين جزءا من نار جهنم لكل جزء منها حرها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث أبي سعيد ‏.‏",
      "text_en": " Abu Sa'eed narrated that the Prophet (s.a.w) said:                     \"This fire of yours is one part from seventy parts of the fire of Hell, each part of it is like the heat of this one.\"",
      "chain": [
        "20340",
        "20240",
        "11385",
        "38"
      ]
    },
    {
      "hadith_no": "3054",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا الحسن بن موسى، حدثنا شيبان، عن عبد الملك بن عمير، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ المستشار مؤتمن ‏\"‏ ‏.‏ قال هذا حديث حسن ‏.‏ وقد روى غير واحد عن شيبان بن عبد الرحمن النحوي وشيبان هو صاحب كتاب وهو صحيح الحديث ويكنى أبا معاوية ‏.‏ حدثنا عبد الجبار بن العلاء العطار عن سفيان بن عيينة قال قال عبد الملك بن عمير إني لأحدث الحديث فما أدع منه حرفا ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"The one whose counsel is sought is entrusted.\"",
      "chain": [
        "30242",
        "20383",
        "20240",
        "11368",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3196",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Recitation - كتاب القراءات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "46",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا الحسن بن موسى، حدثنا شيبان، عن عاصم، عن زر بن حبيش، عن أبى بن كعب، قال لقي رسول الله صلى الله عليه وسلم جبريل فقال ‏\"‏ يا جبريل إني بعثت إلى أمة أميين منهم العجوز والشيخ الكبير والغلام والجارية والرجل الذي لم يقرأ كتابا قط ‏\"‏ ‏.‏ قال يا محمد إن القرآن أنزل على سبعة أحرف ‏.‏ وفي الباب عن عمر وحذيفة بن اليمان وأم أيوب وهي امرأة أبي أيوب وسمرة وابن عباس وأبي هريرة وأبي جهيم بن الحارث بن الصمة وعمرو بن العاص وأبي بكرة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد روي من غير وجه عن أبى بن كعب ‏.‏",
      "text_en": " Narrated Ubayy bin Ka'b:                     \"The Messenger of Allah (ﷺ) met Jibra'il and said: 'O Jibra'il! I have been sent to an illiterate nation among whom are the elderly woman, the old man, the boy and the girl, and the man who cannot read a book at all.' He said: 'O Muhammad! Indeed the Qur'an was revealed in seven modes.'\"",
      "chain": [
        "30242",
        "20383",
        "20240",
        "11080",
        "11337",
        "39"
      ]
    },
    {
      "hadith_no": "3451",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا الحسين بن محمد، حدثنا شيبان، عن قتادة، في قوله ‏:‏ ‏(‏ورفعناه مكانا عليا ‏)‏ قال حدثنا أنس بن مالك، أن نبي الله صلى الله عليه وسلم قال ‏\"‏ لما عرج بي رأيت إدريس في السماء الرابعة ‏\"‏ ‏.‏ قال وفي الباب عن أبي سعيد عن النبي صلى الله عليه وسلم ‏.‏ قال وهذا حديث حسن صحيح وقد رواه سعيد بن أبي عروبة وهمام وغير واحد عن قتادة عن أنس عن مالك بن صعصعة عن النبي صلى الله عليه وسلم حديث المعراج بطوله وهذا عندنا مختصر من ذاك ‏.‏",
      "text_en": " Narrated Shaiban:                     from Qatadah, that regarding Allah's saying: And we raised him to a high station (19:57). He said: \"Anas bin Malik narrated that Allah's Prophet (ﷺ) said: \"When I was brought up, I saw Idris in the Fourth Heaven.\"",
      "chain": [
        "30242",
        "20240",
        "19"
      ]
    },
    {
      "hadith_no": "3583",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا يونس بن محمد، حدثنا شيبان، عن قتادة، حدثنا أنس بن مالك، أن نبي الله صلى الله عليه وسلم قال ‏\"‏ لا تزال جهنم تقول هل من مزيد حتى يضع فيها رب العزة قدمه فتقول قط قط وعزتك ويزوى بعضها إلى بعض ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏ وفيه عن أبي هريرة ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     that Allah's Prophet (ﷺ) said: \"Jahannam will continue saying: 'Are there any more' until the Might Lord puts His Foot over it. It will say: 'Enough! Enough! By Your Might.' And one side of it will close in on the other.\"",
      "chain": [
        "30553",
        "20393",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "3609",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو كريب، حدثنا معاوية بن هشام، عن شيبان، عن أبي إسحاق، عن عكرمة، عن ابن عباس، قال قال أبو بكر رضى الله عنه يا رسول الله قد شبت ‏.‏ قال ‏\"‏ شيبتني هود والواقعة والمرسلات و عم يتساءلون وإذا الشمس كورت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه من حديث ابن عباس إلا من هذا الوجه ‏.‏ وروى علي بن صالح هذا الحديث عن أبي إسحاق عن أبي جحيفة نحو هذا ‏.‏ وروي عن أبي إسحاق عن أبي ميسرة شيء من هذا مرسلا ‏.‏",
      "text_en": " Abu Ishaq narrated from Ikrimah, from Ibn Abbas who said:                     “Abu Bakr [may Allah be pleased with him] said: ‘O Messenger of Allah! You have become gray.’ He said: ‘I have gone gray from (Surat) Hud, Al-Waqiah, Al-Mursalat and Amma Yatasa’lim and Idhash Shamsu Kuwwirat.’”",
      "chain": [
        "30216",
        "20609",
        "20240",
        "11049",
        "11023",
        "17",
        "20436"
      ]
    },
    {
      "hadith_no": "3611",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، وغير، واحد، - المعنى واحد قالوا حدثنا يونس بن محمد، حدثنا شيبان بن عبد الرحمن، عن قتادة، حدثنا الحسن، عن أبي هريرة، قال بينما نبي الله صلى الله عليه وسلم جالس وأصحابه إذ أتى عليهم سحاب فقال نبي الله صلى الله عليه وسلم ‏\"‏ هل تدرون ما هذا ‏\"‏ ‏.‏ فقالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ هذا العنان هذه روايا الأرض يسوقه الله تبارك وتعالى إلى قوم لا يشكرونه ولا يدعونه ‏\"‏ ‏.‏ ثم قال ‏\"‏ هل تدرون ما فوقكم ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإنها الرقيع سقف محفوظ وموج مكفوف ‏\"‏ ‏.‏ ثم قال ‏\"‏ هل تدرون كم بينكم وبينها ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ بينكم وبينها مسيرة خمسمائة سنة ‏\"‏ ‏.‏ ثم قال ‏\"‏ هل تدرون ما فوق ذلك ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإن فوق ذلك سماءين وما بينهما مسيرة خمسمائة عام ‏\"‏ ‏.‏ حتى عد سبع سموات ما بين كل سماءين كما بين السماء والأرض ‏.‏ ثم قال ‏\"‏ هل تدرون ما فوق ذلك ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإن فوق ذلك العرش وبينه وبين السماء بعد ما بين السماءين ‏\"‏ ‏.‏ ثم قال ‏\"‏ هل تدرون ما الذي تحتكم ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإنها الأرض ‏\"‏ ‏.‏ ثم قال ‏\"‏ هل تدرون ما الذي تحت ذلك ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإن تحتها الأرض الأخرى بينهما مسيرة خمسمائة سنة ‏\"‏ ‏.‏ حتى عد سبع أرضين بين كل أرضين مسيرة خمسمائة سنة ثم قال ‏\"‏ والذي نفس محمد بيده لو أنكم دليتم رجلا بحبل إلى الأرض السفلى لهبط على الله ‏\"‏ ‏.‏ ثم قرأ ‏(‏ هو الأول والآخر والظاهر والباطن وهو بكل شيء عليم ‏)‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏ قال ويروى عن أيوب ويونس بن عبيد وعلي بن زيد قالوا لم يسمع الحسن من أبي هريرة ‏.‏ وفسر بعض أهل العلم هذا الحديث فقالوا إنما هبط على علم الله وقدرته وسلطانه ‏.‏ علم الله وقدرته وسلطانه في كل مكان وهو على العرش كما وصف في كتابه ‏.‏",
      "text_en": " Al-Hasan narrated that:                     Abu Hurairah said: “Once when the Prophet of Allah was sitting with his Companions, a cloud came above them, so the Prophet of Allah said: ‘Do you know what this is?’ They said: ‘Allah and His Messenger know better.’ He said: ‘These are the clouds that are to drench the earth, which Allah [Blessed and Most High] dispatches to people who are not grateful to Him, nor supplicate to Him.’ Then he said: ‘Do you know what is above you?’ They said: ‘Allah and His Messenger know better.’ He said: ‘Indeed it is a preserved canopy of the firmament whose surge is restrained.’ Then he said: ‘Do you know how much is between you and between it?’ They said: ‘Allah and His Messenger know better.’ He said: ‘Between you and it [is the distance] of five-hundred year.’ Then he said: ‘Do you know what is above that.’ They said: ‘Allah and His Messenger know better.’ He said: ‘Verily, above that are two Heavens, between the two of them there is a distance of five-hundred years’ – until he enumerated seven Heavens – ‘What is between each of the two Heavens is what is between the heavens and the earth.’ Then he said: ‘Do you know what is above that?’ They said: ‘Allah and His Messenger know better.’ He said: ‘Verily, above that is the Throne between it and the heavens is a distance [like] what is between two of the heavens.’ Then he said: ‘Do you know what is under you?’ They said: ‘Allah and His Messenger know better.’ He said: ‘Indeed it is the earth.’ Then he said: ‘Do you know what is under that?’ They said: ‘Allah and His Messenger know better.’ He said: ‘Verily, below it is another earth, between the two of which is a distance of five-hundred years.’ Until he enumerated seven earths: ‘Between every two earths is a distance of five-hundred years.’ Then he said: ‘By the One in Whose Hand is the soul of Muhammad! If you were to send [a man] down with a rope to the lowest earth, then he would descend upon Allah.’ Then he recited: He is Al-Awwal, Al-Akhir, Az-Zahir Al-Batin, and He has knowledge over all things.”",
      "chain": [
        "30553",
        "20393",
        "20240",
        "11019",
        "11016",
        "13"
      ]
    },
    {
      "hadith_no": "3614",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا يونس، عن شيبان، عن قتادة، حدثنا أنس بن مالك، أن يهوديا، أتى على النبي صلى الله عليه وسلم وأصحابه فقال السام عليكم فرد عليه القوم فقال نبي الله صلى الله عليه وسلم ‏\"‏ هل تدرون ما قال هذا ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم سلم يا نبي الله ‏.‏ قال ‏\"‏ لا ولكنه قال كذا وكذا ردوه على ‏\"‏ ‏.‏ فردوه قال ‏\"‏ قلت السام عليكم ‏\"‏ ‏.‏ قال نعم ‏.‏ قال نبي الله صلى الله عليه وسلم عند ذلك ‏\"‏ إذا سلم عليكم أحد من أهل الكتاب فقولوا عليك ‏\"‏ ‏.‏ قال ‏\"‏ عليك ما قلت ‏\"‏ ‏.‏ قال ‏:‏ ‏(‏وإذا جاءوك حيوك بما لم يحيك به الله ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Anas bin Malik narrated that:                     A Jew came to the Prophet of Allah and his Companions and said: “As-Samu Alaikum (Death be upon you).” So the people replied to him. The Prophet of Allah said: “Do you know what this person said?” They said: “Allah and His Messenger know better – he said the Salam – O Allah’s Prophet.” He said: “No, rather he said like this and that. Bring him back for e=me.” So they brought him back and he said: “Did you say As-Samu Alaikum? He said: “Yes.” So with that Allah’s Prophet said: “When one of the People of the Book gives you the Salam, then say: “Alaika Ma Qulta (Whatever you said to you too).” He said: ‘And when they come to you, they greet you with a greeting wherewith Allah greets you not.’",
      "chain": [
        "30553",
        "20475",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "347",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Water - كتاب المياه",
      "chapter_no": "2",
      "text_ar": "أخبرنا أبو بكر بن إسحاق، قال حدثنا الحسن بن موسى، قال حدثنا شيبان، عن قتادة، عن الحسن، عن أمه، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يتوضأ بالمد ويغتسل بالصاع ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"The Messenger of Allah (ﷺ) used to perform Ghusl with a Mudd and Ghusl with a Sa'.\"",
      "chain": [
        "30511",
        "20383",
        "20240",
        "11019",
        "11016",
        "10737",
        "53"
      ]
    },
    {
      "hadith_no": "521",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا الفضل بن دكين، قال حدثنا شيبان، عن يحيى، عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أدرك أحدكم أول سجدة من صلاة العصر قبل أن تغرب الشمس فليتم صلاته وإذا أدرك أول سجدة من صلاة الصبح قبل أن تطلع الشمس فليتم صلاته ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) said:                      \"If any one of you catches the first prostration of 'Asr prayer before the sun sets, let him complete his prayer, and if he catches up with the first prostration of Fajr prayer before the sub rises, let him complete his prayer.\"",
      "chain": [
        "38433",
        "20348",
        "20240",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2050",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، وإبراهيم بن يعقوب بن إسحاق، قالا حدثنا يونس بن محمد، عن شيبان، عن قتادة، أنبأنا أنس بن مالك، قال قال نبي الله صلى الله عليه وسلم ‏\"‏ إن العبد إذا وضع في قبره وتولى عنه أصحابه إنه ليسمع قرع نعالهم ‏\"‏ ‏.‏ قال ‏\"‏ فيأتيه ملكان فيقعدانه فيقولان له ما كنت تقول في هذا الرجل فأما المؤمن فيقول أشهد أنه عبد الله ورسوله فيقال له انظر إلى مقعدك من النار قد أبدلك الله به مقعدا من الجنة ‏\"‏ ‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ فيراهما جميعا ‏\"‏ ‏.‏",
      "text_en": " Anas bin Malik said:                     \"The Prophet of Allah said: 'When a person is placed in his grave and his companions depart from him, he hears the sound of their sandals. Then two angles came to him and make him sit up, and they say to him: What did you say about this man? As for the believer, he says: \"I bear witness that he is the slave of Allah and His Messenger. Then it is said to him: Look at your place in Hell, Which Allah has replaced for you with a place in Paradise. The prophet said: 'And he sees them both.\"'",
      "chain": [
        "38088",
        "20393",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "2372",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني زكريا بن يحيى، قال حدثنا شيبان، قال حدثنا أبو عوانة، عن الحر بن صياح، عن هنيدة بن خالد، عن امرأته، قالت حدثتني بعض، نساء النبي صلى الله عليه وسلم أن النبي صلى الله عليه وسلم كان يصوم يوم عاشوراء وتسعا من ذي الحجة وثلاثة أيام من الشهر أول اثنين من الشهر وخميسين ‏.‏",
      "text_en": " It was narrated from Hunaidah bin Khalid that his wife said:                     \"One of the wives of the Prophet said: \"The Prophet used to fast on the day of 'Ashura, nine days of Dhul-Hijjiah and three days each month: The first Monday of the month, and two Thursday.\"",
      "chain": [
        "20240",
        "20469",
        "5408"
      ]
    },
    {
      "hadith_no": "3435",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرني موسى بن عبد الرحمن، قال حدثنا حسين الجعفي، عن زائدة، عن شيبان، عن قتادة، عن زرارة بن أوفى، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله تعالى تجاوز لأمتي عما حدثت به أنفسها ما لم تكلم أو تعمل به ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet said:                      \"Allah, the Most High, has forgiven my Ummah for whatever enters the mind, so long as it is not spoken of or put into action.\"",
      "chain": [
        "20315",
        "20320",
        "20240",
        "11019",
        "11284",
        "13"
      ]
    },
    {
      "hadith_no": "3636",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا القاسم بن زكريا بن دينار، قال حدثنا عبيد الله، عن شيبان، عن فراس، عن الشعبي، قال حدثني جابر بن عبد الله، أن أباه، استشهد يوم أحد وترك ست بنات وترك عليه دينا فلما حضر جداد النخل أتيت رسول الله صلى الله عليه وسلم فقلت قد علمت أن والدي استشهد يوم أحد وترك دينا كثيرا وإني أحب أن يراك الغرماء‏.‏ قال ‏\"‏ اذهب فبيدر كل تمر على ناحية ‏\"‏‏.‏ ففعلت ثم دعوته فلما نظروا إليه كأنما أغروا بي تلك الساعة فلما رأى ما يصنعون أطاف حول أعظمها بيدرا ثلاث مرات ثم جلس عليه ثم قال ‏\"‏ ادع أصحابك ‏\"‏‏.‏ فما زال يكيل لهم حتى أدى الله أمانة والدي وأنا راض أن يؤدي الله أمانة والدي لم تنقص تمرة واحدة‏.‏",
      "text_en": " Jabir bin 'Abdullah narrated that his father was martyred on the Day of Uhud, and he left behind six daughters, and some outstanding debts. When the time to pick the dates came, I went to the Messenger of Allah and said:                      \"You know that my father was martyred on the Day of Uhud and he left behind a great deal of debt. I would like the creditors to see you.\" He said: \"Go and pile up the dates in separate heaps.\" I did that, then I called him. When they saw him, it was as if they started to put pressure on me at that time. When he saw what they were doing, he went around the biggest heap three times, then he sat on it then said: \"Call your companions (the creditors).\" Then he kept on weighing them out for them, until Allah cleared all my father's debts. I am pleased that Allah cleared my father's debts without even a single date being missed.",
      "chain": [
        "30475",
        "11201",
        "20240",
        "11385",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "3843",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا الحسن بن موسى، قال حدثنا شيبان، عن يحيى، عن محمد بن الزبير، عن أبيه، عن عمران، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا نذر في غضب وكفارته كفارة اليمين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Imran said:                      The Messenger of Allah said: \"There is no vow at a moment of anger and its expiation is the expiation for an oath.\"",
      "chain": [
        "38088",
        "20383",
        "20240",
        "11449",
        "14340",
        "123"
      ]
    },
    {
      "hadith_no": "3978",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا القاسم بن زكريا بن دينار، قال حدثنا عبيد الله بن موسى، قال حدثنا شيبان، عن عاصم، عن زياد بن قيس، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ نقاتل الناس حتى يقولوا لا إله إلا الله فإذا قالوا لا إله إلا الله حرمت علينا دماؤهم وأموالهم إلا بحقها وحسابهم على الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     The Messenger of Allah [SAW] said: \"We will fight the people until they say La ilaha illallah. If they say La ilaha illallah then their blood and their wealth become forbidden to us, except for a right that is due, and their reckoning will be with Allah.\"",
      "chain": [
        "30475",
        "20340",
        "20240",
        "11080",
        "13"
      ]
    },
    {
      "hadith_no": "5272",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا الحسن بن موسى، قال حدثنا شيبان، عن يحيى، أخبرني خالد بن معدان، أن ابن حنين، حدثه أن عليا قال إن رسول الله صلى الله عليه وسلم نهى عن ثياب المعصفر وعن الحرير وأن يقرأ وهو راكع وعن خاتم الذهب ‏.‏",
      "text_en": " It was narrated from Ibn Hunain, that 'Ali said that:                     The Messenger of Allah [SAW] forbade garments dyed with safflower, and from silk, and reciting Qur'an while he is bowing, and from gold rings.",
      "chain": [
        "38088",
        "20383",
        "20240",
        "11449",
        "11422",
        "5"
      ]
    },
    {
      "hadith_no": "5546",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا القاسم بن زكريا، قال أنبأنا عبيد الله، عن شيبان، عن الأعمش، عن محارب بن دثار، عن جابر، عن النبي صلى الله عليه وسلم قال ‏\"‏ الزبيب والتمر هو الخمر ‏\"‏‏.‏",
      "text_en": " It was narrated from Jabir that:                     The Prophet [SAW] said: \"Raisins and dried dates are Khamr.\"",
      "chain": [
        "36617",
        "11201",
        "20240",
        "11060",
        "11389",
        "34"
      ]
    },
    {
      "hadith_no": "689",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبيد الله بن موسى، عن شيبان النحوي، عن يحيى بن أبي كثير، عن أبي سلمة، عن أم بكر، أنها أخبرت أن عائشة قالت قال رسول الله  صلى الله عليه وسلم  في المرأة ترى ما يريبها بعد الطهر قال ‏\"‏ إنما هي عرق أو عروق ‏\"‏ ‏.‏ قال محمد بن يحيى يريد بعد الطهر بعد الغسل ‏.‏",
      "text_en": " It was narrated from Umm Bakr that:                     She was told that 'Aishah said: \"The Messenger of Allah said concerning a woman who sees that which causes her doubt (i.e. some bleeding) after she becomes pure: 'That is a vein or veins.'\" (Da'if)\"What was meant by 'after becomes pure' is after having a bath (following the end of her period).\"",
      "chain": [
        "11222",
        "20340",
        "20240",
        "11449",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "752",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الحسن بن موسى، حدثنا شيبان بن عبد الرحمن، عن يحيى بن أبي كثير، عن أبي سلمة بن عبد الرحمن، أن يعيش بن قيس بن طخفة، حدثه عن أبيه، وكان، من أصحاب الصفة قال قال لنا رسول الله  صلى الله عليه وسلم  ‏\"‏ انطلقوا ‏\"‏ ‏.‏ فانطلقنا إلى بيت عائشة وأكلنا وشربنا فقال لنا رسول الله  صلى الله عليه وسلم  ‏\"‏ إن شئتم نمتم هاهنا وإن شئتم انطلقتم إلى المسجد ‏\"‏ ‏.‏ قال فقلنا بل ننطلق إلى المسجد ‏.‏",
      "text_en": " Ya'ish bin Qais bin Tikhfah narrated that his father, who was one of the people of Suffah, said:                     \"The Messenger of Allah said to us: 'Come with me.' So we went to the house of 'Aishah, where we ate and drank. Then the Messenger of Allah said to us: 'If you want, you can sleep here, or if you want you can go out to the mosque.' We said: 'We will go out to the mosque.'\"",
      "chain": [
        "30201",
        "20383",
        "20240",
        "11449",
        "10567",
        "8"
      ]
    },
    {
      "hadith_no": "1363",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "قال أبو الحسن بن سلمة القطان حدثنا ابن ديزيل، حدثنا آدم، حدثنا شيبان، عن جابر، عن عامر، ح وحدثنا إبراهيم بن نصر، حدثنا إسرائيل، عن جابر، عن عامر، ح وحدثنا إبراهيم بن نصر، حدثنا أبو نعيم، حدثنا شريك، عن أبي إسحاق، عن عامر، نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "20404",
        "20240",
        "34",
        "11052",
        "20311",
        "34",
        "11052",
        "20348",
        "11858",
        "11049",
        "11052"
      ]
    },
    {
      "hadith_no": "1396",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا العباس بن عثمان الدمشقي، حدثنا الوليد بن مسلم، حدثنا شيبان أبو معاوية، عن الأعمش، عن علي بن الأقمر، عن الأغر، عن أبي سعيد، وأبي، هريرة عن النبي  صلى الله عليه وسلم  قال ‏\"‏ إذا استيقظ الرجل من الليل وأيقظ امرأته فصليا ركعتين كتبا من الذاكرين الله كثيرا والذاكرات ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed and Abu Hurairah said that theProphet(ﷺ) said:                      ‘When a man wakes up at night and wakes his wife,andthey pray two Rak’ah, they will be recorded among the men andwomenwho remember Allah much.”",
      "chain": [
        "20733",
        "20240",
        "11060",
        "11375",
        "15022",
        "38",
        "13"
      ]
    },
    {
      "hadith_no": "1555",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبيد الله، أنبأنا شيبان، عن الأعمش، عن أبي صالح، عن أبي هريرة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ من صلى عليه مائة من المسلمين غفر له ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) said:                     “Whoeverhas the funeral prayer offered for him by one hundredMuslims, hewill be forgiven.”",
      "chain": [
        "30201",
        "11201",
        "20240",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "1750",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن يوسف السلمي، حدثنا عبيد الله، أنبأنا شيبان، عن يحيى بن أبي كثير، حدثني أبو قلابة، أن أبا أسماء، حدثه عن ثوبان، قال سمعت النبي  صلى الله عليه وسلم  يقول ‏\"‏ أفطر الحاجم والمحجوم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Thawban said:                      “I heard the Prophet (ﷺ) say:‘Thecupper and the one for whom cupping is done both break theirfast.’”",
      "chain": [
        "30535",
        "11201",
        "20240",
        "11449",
        "11047",
        "130"
      ]
    },
    {
      "hadith_no": "1751",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن يوسف السلمي، قال حدثنا عبيد الله، قال أنبأنا شيبان، عن يحيى، عن أبي قلابة، أنه أخبره أن شداد بن أوس بينما هو يمشي مع رسول الله  صلى الله عليه وسلم  بالبقيع فمر على رجل يحتجم بعد ما مضى من الشهر ثماني عشرة ليلة فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ أفطر الحاجم والمحجوم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Qilabah that when Shaddad bin Aws waswalking withthe Messenger of Allah (ﷺ) in Al-Baqi’, he passed by aman whowas being cupped, after eighteen days of the month (ofRamadan) hadpassed. The Messenger of Allah (ﷺ) said:                      “The cupperand the onefor whom cupping is done both break their fast.”",
      "chain": [
        "30535",
        "11201",
        "20240",
        "11449",
        "11047"
      ]
    },
    {
      "hadith_no": "1796",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا إسحاق بن منصور، أنبأنا أبو داود، حدثنا شيبان، عن عاصم، عن زر، عن عبد الله بن مسعود، قال قلما رأيت رسول الله  صلى الله عليه وسلم  يفطر يوم الجمعة ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin Mas’ud said:                      “I rarely saw theMessenger of Allah (ﷺ) not fasting on a Friday.”",
      "chain": [
        "30313",
        "20547",
        "20240",
        "11080",
        "11337",
        "16"
      ]
    },
    {
      "hadith_no": "2859",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا عبيد الله بن موسى، عن شيبان، عن فراس، عن عطية، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ المجاهد في سبيل الله مضمون على الله إما أن يكفته إلى مغفرته ورحمته وإما أن يرجعه بأجر وغنيمة ومثل المجاهد في سبيل الله كمثل الصائم القائم الذي لا يفتر حتى يرجع ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed Al-Khudri that the Prophet (ﷺ)said:                     “The one who fights in the cause of Allah has a guarantee fromAllah. Either He will raise him to His forgiveness and mercy, or Hewill send him back with reward and spoils of war. The likeness of theone who fights in the cause of Allah is that of one who fasts andprays at night without ceasing, until he returns.”",
      "chain": [
        "30201",
        "30216",
        "20340",
        "20240",
        "11385",
        "38"
      ]
    },
    {
      "hadith_no": "2878",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أحمد بن عبد الرحمن بن بكار بن عبد الملك بن الوليد بن بسر بن أبي أرطاة، حدثنا الوليد، حدثني شيبان، عن الأعمش، عن أبي صالح، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا استنفرتم فانفروا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Prophet (ﷺ) said:                      “If youarecalled to arms then go forth.”",
      "chain": [
        "20733",
        "20240",
        "11060",
        "11161",
        "17"
      ]
    },
    {
      "hadith_no": "3068",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبيد الله بن موسى، حدثنا شيبان، عن أشعث بن أبي الشعثاء، عن الأسود بن يزيد، عن عائشة، قالت سألت رسول الله  صلى الله عليه وسلم  عن الحجر ‏.‏ فقال ‏\"‏ هو من البيت ‏\"‏ ‏.‏ قلت ما منعهم أن يدخلوه فيه قال ‏\"‏ عجزت بهم النفقة ‏\"‏ ‏.‏ قلت فما شأن بابه مرتفعا لا يصعد إليه إلا بسلم قال ‏\"‏ ذلك فعل قومك ليدخلوه من شاءوا ويمنعوه من شاءوا ولولا أن قومك حديث عهد بكفر مخافة أن تنفر قلوبهم لنظرت هل أغيره فأدخل فيه ما انتقص منه وجعلت بابه بالأرض ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “I asked the Messenger of Allah(ﷺ)about the Hijr, and he said: ‘It is part of the House.’ I said:‘What kept them from incorporating it into it?’ He said: ‘Theyran outof funds.’ I said: ‘Why is its door so high up that itcan only bereached with a ladder?’* He said: ‘That is what yourpeople did sothat they could let in whoever they wanted and keep outwhoever theywanted. Were it not that your people have so recentlyleft disbeliefbehind, and I am afraid that it would bother them, Iwould havechanged it, incorporating what they left out and I wouldput its doorat ground level.”",
      "chain": [
        "30201",
        "20340",
        "20240",
        "11324",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "3691",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الحسن بن موسى، عن شيبان، عن قتادة، عن أبي بردة، عن أبيه، قال قال لي يا بنى لو شهدتنا ونحن مع رسول الله  صلى الله عليه وسلم  إذا أصابتنا السماء لحسبت أن ريحنا ريح الضأن ‏.‏",
      "text_en": " It wasnarrated from Abu Burdah that his father said to him:                      “O myson, ifonly you could have seen us when we were with the Messenger ofAllah(ﷺ), when rain fell on us; you would have thought that wesmelledlike sheep.”",
      "chain": [
        "30201",
        "20383",
        "20240",
        "11019",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "3745",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن أبي بكير، عن شيبان، عن عبد الملك بن عمير، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ المستشار مؤتمن ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah(ﷺ) said:                     \"One who is consulted is entrusted.\"",
      "chain": [
        "30201",
        "20365",
        "20240",
        "11368",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3761",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبيد الله، عن شيبان، عن الأعمش، عن عمرو بن مرة، عن يوسف بن ماهك، عن عبيد بن عمير، عن عائشة، قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن أعظم الناس فرية لرجل هاجى رجلا فهجا القبيلة بأسرها ورجل انتفى من أبيه وزنى أمه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Aisha that the Messenger of Allah(ﷺ) said:                     \"The worst of all people lying is a man who trades insults with another man, disparaging the entire tribe, and a man who denies his father and accuses his mother of adultery.\"",
      "chain": [
        "30201",
        "11201",
        "20240",
        "11060",
        "11381",
        "11264",
        "11259",
        "53"
      ]
    },
    {
      "hadith_no": "3780",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا عبيد الله بن موسى، أنبأنا شيبان، عن فراس، عن عطية، عن أبي سعيد الخدري، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يقال لصاحب القرآن إذا دخل الجنة اقرأ واصعد ‏.‏ فيقرأ ويصعد بكل آية درجة حتى يقرأ آخر شىء معه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Saeed Al-Khudri that the Messenger of Allah(ﷺ) said:                     \"It will be said to the companion of the Quran, when he enters Paradise: 'Recite and rise one degree for ever Verse,' until he recites the last thing that he knows.\"",
      "chain": [
        "20436",
        "20340",
        "20240",
        "11385",
        "38"
      ]
    },
    {
      "hadith_no": "3879",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا معاوية بن هشام، أنبأنا شيبان، عن يحيى، عن أبي سلمة، أن ربيعة بن كعب الأسلمي، أخبره أنه، كان يبيت عند باب رسول الله  صلى الله عليه وسلم  وكان يسمع رسول الله  صلى الله عليه وسلم  يقول من الليل ‏\"‏ سبحان الله رب العالمين ‏\"‏ ‏.‏ الهوي ثم يقول ‏\"‏ سبحان الله وبحمده ‏\"‏ ‏.‏",
      "text_en": " Rabi’ah bin Ka’b Al-Aslami narrated that he used to spend the night outside the door of the Messenger of Allah (ﷺ), and he used to hear the Messenger of Allah (ﷺ) saying at night:                      “Subhan Allahi Rabbil-‘alamin (Glory is to Allah, the Lord of the worlds),” repeating that for a while, then he said: Subhan Allahi wa bihamdihi (Glory and praise is to Allah).”",
      "chain": [
        "30201",
        "20609",
        "20240",
        "11449",
        "10567",
        "464"
      ]
    },
    {
      "hadith_no": "3895",
      "source": " Sunan Ibn Majah ",
      "chapter": "Interpretation of Dreams - كتاب تعبير الرؤيا",
      "chapter_no": "35",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا عبيد الله بن موسى، أنبأنا شيبان، عن فراس، عن عطية، عن أبي سعيد الخدري، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ رؤيا الرجل المسلم الصالح جزء من سبعين جزءا من النبوة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed Al-Khudri that the Prophet (ﷺ)said:                     “The dream of a righteous Muslim man is one of the seventy partsofprophecy.”",
      "chain": [
        "30201",
        "30216",
        "20340",
        "20240",
        "11385",
        "38"
      ]
    }
  ],
  "total_hadiths": 156
}