{
  "id": "20249",
  "name": "Abd al-Salam bin Mthr عبد السلام بن مطهر بن حسام",
  "full_name": "Abd al-Salam bin Mthr عبد السلام بن مطهر بن حسام",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "124",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  د  -  صدوق ]"
    ],
    "tags": [
      "al-Azdi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20236",
      "name": "Sulaiman bin al-Mughira al-Qaysy سليمان بن المغيرة القيسي مولاهم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20317",
      "name": "Hafs bin Ghyath حفص بن غياث",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "24448",
      "name": "Musa bin Khlf al-My موسى بن خلف العمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30417",
      "name": "Salmah bin Shbyb سلمة بن شبيب",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30132",
      "name": "Khalifa bin Khayyat bin Khalifa خليفة بن خياط بن خليفة بن خياط",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "31742",
      "name": "Abu Bakr bin Abi Khuthama أبو بكر بن أبي خيثمة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30494",
      "name": "Ahmed bin Ibrahim bin Kathir أحمد بن إبراهيم بن كثير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38719",
      "name": "Y'aqub bin Sufyan يعقوب بن سفيان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "31378",
      "name": "al-Fadl bin al-Habab bin Muhammad الفضل بن الحباب",
      "grade": "3rd Century AH"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "39",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد السلام بن مطهر، قال حدثنا عمر بن علي، عن معن بن محمد الغفاري، عن سعيد بن أبي سعيد المقبري، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الدين يسر، ولن يشاد الدين أحد إلا غلبه، فسددوا وقاربوا وأبشروا، واستعينوا بالغدوة والروحة وشىء من الدلجة ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          The Prophet said, \"Religion is very easy and whoever overburdens      himself in his religion will not be able to continue in that way. So      you should not be extremists, but try to be near to perfection and      receive the good tidings that you will be rewarded; and gain strength      by worshipping in the mornings, the nights.\" (See Fath-ul-Bari, Page      102, Vol 1).",
      "chain": [
        "20249",
        "20265",
        "11724",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "6495",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني عبد السلام بن مطهر، حدثنا عمر بن علي، عن معن بن محمد الغفاري، عن سعيد بن أبي سعيد المقبري، عن أبي هريرة، عن النبي صلى الله عليه وسلم فقال ‏\"‏ أعذر الله إلى امرئ أخر أجله حتى بلغه ستين سنة ‏\"‏‏.‏ تابعه أبو حازم وابن عجلان عن المقبري‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Allah will not accept the excuse of any person whose instant of death is delayed till he is sixty years of age.\"",
      "chain": [
        "20249",
        "20265",
        "11724",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "265",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد السلام بن مطهر، حدثنا جعفر، - يعني ابن سليمان - عن علي بن الحكم البناني، عن أبي الحسن الجزري، عن مقسم، عن ابن عباس، قال إذا أصابها في أول الدم فدينار وإذا أصابها في انقطاع الدم فنصف دينار ‏.‏ قال أبو داود وكذلك قال ابن جريج عن عبد الكريم عن مقسم ‏.‏",
      "text_en": " Ibn ‘Abbas said:                      If one has intercourse in the beginning of the menses,(one should give) one dinar; in case one has intercourse towards the end of the menses, then half a dinar (should be given)",
      "chain": [
        "20249",
        "20532",
        "11605",
        "11725",
        "17",
        "11070",
        "18655"
      ]
    },
    {
      "hadith_no": "702",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، ح وحدثنا عبد السلام بن مطهر، وابن، كثير - المعنى - أن سليمان بن المغيرة، أخبرهم عن حميد بن هلال، عن عبد الله بن الصامت، عن أبي ذر، - قال حفص - قال قال رسول الله صلى الله عليه وسلم وقالا عن سليمان قال أبو ذر ‏\"‏ يقطع صلاة الرجل - إذا لم يكن بين يديه قيد آخرة الرحل الحمار والكلب الأسود والمرأة ‏\"‏ ‏.‏ فقلت ما بال الأسود من الأحمر من الأصفر من الأبيض فقال يا ابن أخي سألت رسول الله صلى الله عليه وسلم كما سألتني فقال ‏\"‏ الكلب الأسود شيطان ‏\"‏ ‏.‏",
      "text_en": " Hafs reported that the Messenger of Allah(ﷺ) as saying, and the other version of this tradition transmitted through a different chain has:                      Abu Dharr said (and not the Prophet): If there is not anything like the back of a saddle in front of a man who is praying, then a donkey, a black dog, and a woman cut off his prayer. I asked him: Why has the black dog been specified, distinguishing it from a red, a yellow and a white dog? He replied: My nephew, I also asked the Messenger of Allah(ﷺ) the same question as you asked me. He said: The black dog is a devil.",
      "chain": [
        "30329",
        "20020",
        "20249",
        "20236",
        "11281",
        "10695",
        "23",
        "20317"
      ]
    },
    {
      "hadith_no": "775",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد السلام بن مطهر، حدثنا جعفر، عن علي بن علي الرفاعي، عن أبي المتوكل الناجي، عن أبي سعيد الخدري، قال كان رسول الله صلى الله عليه وسلم إذا قام من الليل كبر ثم يقول ‏\"‏ سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدك ولا إله غيرك ‏\"‏ ‏.‏ ثم يقول ‏\"‏ لا إله إلا الله ‏\"‏ ‏.‏ ثلاثا ثم يقول ‏\"‏ الله أكبر كبيرا ‏\"‏ ‏.‏ ثلاثا ‏\"‏ أعوذ بالله السميع العليم من الشيطان الرجيم من همزه ونفخه ونفثه ‏\"‏ ‏.‏ ثم يقرأ ‏.‏ قال أبو داود وهذا الحديث يقولون هو عن علي بن علي عن الحسن مرسلا الوهم من جعفر ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     When the Messenger of Allah (ﷺ) got up to pray at night (for tahajjud prayer) he uttered the takbir and then said: \"Glory be to Thee, O Allah,\" and \"Praise be to Thee\" and \"Blessed is Thy name,\" and Exalted is Thy greatness.\" and \"There is no god but Thee.\" He then said: \"There is no god but Allah\" three times; he then said: \"Allah is altogether great\" three times: \"I seek refuge in Allah, All-Hearing and All-Knowing from the accursed devil, from his evil suggestion (hamz), from his puffing up (nafkh), and from his spitting (nafth)\" He then recited (the Qur'an).Abu Dawud said: It is said that this tradition has been narrated by 'Ali b. 'Ali from al-Hasan omitting the name of the Companion of the Prophet (ﷺ). The misunderstanding occurred on the part of Ja'far.",
      "chain": [
        "20249",
        "11407",
        "20716",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "2059",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عبد السلام بن مطهر، أن سليمان بن المغيرة، حدثهم عن أبي موسى، عن أبيه، عن ابن لعبد الله بن مسعود، عن ابن مسعود، قال لا رضاع إلا ما شد العظم وأنبت اللحم ‏.‏ فقال أبو موسى لا تسألونا وهذا الحبر فيكم ‏.‏",
      "text_en": " ‘Abd Allaah bin Mas’ud said “Fosterage is not valid except by what strengthens love and grows flesh.” Abu Musa said “Do not ask us so long as this learned man is among us”",
      "chain": [
        "20249",
        "20236",
        "30170",
        "16"
      ]
    },
    {
      "hadith_no": "2169",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عبد السلام بن مطهر، حدثنا جعفر، - يعني ابن سليمان - عن علي بن الحكم البناني، عن أبي الحسن الجزري، عن مقسم، عن ابن عباس، قال إذا أصابها في الدم فدينار وإذا أصابها في انقطاع الدم فنصف دينار ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     If a man has sexual intercourse (with menstruating woman) during her bleeding, he should give one dinar as sadaqah, and if he does so when bleeding has stopped, he should give half a dinar as sadaqah.",
      "chain": [
        "20249",
        "20532",
        "11605",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "2531",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد السلام بن مطهر، حدثنا جعفر بن سليمان، عن ثابت، عن أنس، قال ‏:‏ كان رسول الله صلى الله عليه وسلم يغزو بأم سليم ونسوة من الأنصار ليسقين الماء ويداوين الجرحى ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     When the Messenger of Allah (ﷺ) went on an expedition, he took Umm Sulaym, and he had some women of the Ansar who supplied water and tended the wounded.",
      "chain": [
        "20249",
        "20532",
        "11269",
        "19"
      ]
    }
  ],
  "total_hadiths": 8
}