{
  "id": "20242",
  "name": "'Aabad bin Rashid al-Tamimi عباد بن راشد التميمي مولاهم البصري البزا",
  "full_name": "'Aabad bin Rashid al-Tamimi عباد بن راشد التميمي مولاهم البصري البزا",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ خ  د  س  ق  -  صدوق له أوهام ]"
    ],
    "tags": [
      "al-Tamimi",
      "Client",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11269",
      "name": "Thabit bin Aslam Albanani ثابت بن أسلم البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11016",
      "name": "al-Hasan al-Basri الحسن البصري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11585",
      "name": "Da'ud bin Abi Hnd داود بن أبي هند",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "14146",
      "name": "Sa'id bin Abi Khyrh سعيد بن أبي خيرة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11019",
      "name": "Qatada قتادة",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20468",
      "name": "Hashaym bin Bashayr bin al-Qasim هشيم بن بشير بن القاسم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20443",
      "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30106",
      "name": "'Affan bin Muslim عفان بن مسلم بن عبد الله الصفار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4571",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبيد الله بن سعيد، حدثنا أبو عامر العقدي، حدثنا عباد بن راشد، حدثنا الحسن، قال حدثني معقل بن يسار، قال كانت لي أخت تخطب إلى‏.‏ وقال إبراهيم عن يونس، عن الحسن، حدثني معقل بن يسار،‏.‏ حدثنا أبو معمر، حدثنا عبد الوارث، حدثنا يونس، عن الحسن، أن أخت، معقل بن يسار طلقها زوجها، فتركها حتى انقضت عدتها، فخطبها فأبى معقل، فنزلت ‏{‏فلا تعضلوهن أن ينكحن أزواجهن‏}‏‏.‏",
      "text_en": " Narrated Al-Hasan:                     The sister of Ma'qal bin Yasar was divorced by her husband who left her till she had fulfilled her term of 'Iddat (i.e. the period which should elapse before she can Remarry) and then he wanted to remarry her but Maqal refused, so this Verse was revealed:-- \"Do not prevent them from marrying their (former) husbands.\" (2.232)",
      "chain": [
        "30359",
        "20443",
        "20242",
        "11016",
        "3120",
        "20150",
        "20475",
        "11016",
        "30315",
        "20258",
        "20475",
        "11016"
      ]
    },
    {
      "hadith_no": "900",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا عباد بن راشد، حدثنا الحسن، حدثنا أحمر بن جزء، صاحب رسول الله صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم كان إذا سجد جافى عضديه عن جنبيه حتى نأوي له ‏.‏",
      "text_en": " Narrated Ahmar ibn Jaz':                     When the Messenger of Allah (ﷺ) prostrated himself, he kept his arms far away from his sides so much so that we took pity on him.",
      "chain": [
        "20285",
        "20242",
        "11016"
      ]
    },
    {
      "hadith_no": "2087",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن المثنى، حدثني أبو عامر، حدثنا عباد بن راشد، عن الحسن، حدثني معقل بن يسار، قال كانت لي أخت تخطب إلى فأتاني ابن عم لي فأنكحتها إياه ثم طلقها طلاقا له رجعة ثم تركها حتى انقضت عدتها فلما خطبت إلى أتاني يخطبها فقلت لا والله لا أنكحها أبدا ‏.‏ قال ففي نزلت هذه الآية ‏{‏ وإذا طلقتم النساء فبلغن أجلهن فلا تعضلوهن أن ينكحن أزواجهن ‏}‏ الآية ‏.‏ قال فكفرت عن يميني فأنكحتها إياه ‏.‏",
      "text_en": " Ma’qil bin Yasar said:                      I had a sister and I was asked to give her in marriage. My cousin came to me and I married her to him. He then divorced her one revocable divorce. He abandoned her till her waiting period passed. When I was asked to give her in marriage, he again came to me and asked her in marriage. Thereupon I said to him “No, by Allah, I will never marry her to you. Then the following verse was revealed about my case: “And when ye have divorced women and they reach their term, place not difficulties in the way of their marrying their husbands.” So I expiated for my oath, and married her off to him.",
      "chain": [
        "30170",
        "20443",
        "20242",
        "11016",
        "3120"
      ]
    },
    {
      "hadith_no": "3331",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا هشيم، أخبرنا عباد بن راشد، قال سمعت سعيد بن أبي خيرة، يقول حدثنا الحسن، منذ أربعين سنة عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ح وحدثنا وهب بن بقية أخبرنا خالد عن داود - يعني ابن أبي هند - وهذا لفظه عن سعيد بن أبي خيرة عن الحسن عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليأتين على الناس زمان لا يبقى أحد إلا أكل الربا فإن لم يأكله أصابه من بخاره ‏\"‏ ‏.‏ قال ابن عيسى ‏\"‏ أصابه من غباره ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: A time is certainly coming to mankind when only the receiver of usury will remain, and if he does not receive it, some of its vapour will reach him. Ibn Isa said: Some of its dust will reach him.",
      "chain": [
        "31167",
        "20468",
        "20242",
        "14146",
        "13"
      ]
    },
    {
      "hadith_no": "936",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، حدثنا عباد بن راشد، عن الحسن، حدثنا أحمر، صاحب رسول الله  صلى الله عليه وسلم  قال إن كنا لنأوي لرسول الله  صلى الله عليه وسلم  مما يجافي بيديه عن جنبيه إذا سجد ‏.‏",
      "text_en": " Ahmar,the Companion of the Messenger of Allah (ﷺ), narrated to us:                     “Weused to feel sorry for the Messenger of Allah (ﷺ) because hetookpains to keep his arms away from his sides when he prostrated.”",
      "chain": [
        "30201",
        "20032",
        "20242",
        "11016"
      ]
    }
  ],
  "total_hadiths": 5
}