{
  "id": "20245",
  "name": "'Abdullah bin Raja' bin 'Umar عبد الله بن رجاء بن عمر/المثني الغداني",
  "full_name": "'Abdullah bin Raja' bin 'Umar عبد الله بن رجاء بن عمر/المثني الغداني",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "220",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ خ  ق  -  صدوق له أوهام ]"
    ],
    "tags": [
      "al-Ghadani",
      "Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "10704",
      "name": "'Ikrama bin 'Ammar عكرمة بن عمار العجلي أبو عمار اليمامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20220",
      "name": "Harb bin Shadaad al-Yashkari حرب بن شداد اليشكري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20724",
      "name": "'Abdur Rahman bin 'Abdullah bin 'Utba عبد الرحمن بن عبد الله بن عتبة المسعودي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20718",
      "name": "'Imran bin Da'ud al-'Ami Abu al-'Awwam عمران بن داود العمي أبو العوام القطان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "27031",
      "name": "Frj bin Fdalh bin al-N'man فرج بن فضالة بن النعمان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20297",
      "name": "Hmam bin Yahya bin Dinar همام بن يحيى بن دينار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20295",
      "name": "Hisham bin Abi 'Abdullah al-Dastawa'i هشام بن أبي عبد الله الدستوائي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20647",
      "name": "al-Hasan bin Salah bin Salah الحسن بن صالح بن صالح",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20502",
      "name": "Sa'id bin Salmah bin Aby سعيد بن سلمة بن أبي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20026",
      "name": "'Abdul 'Aziz bin 'Abdullah al-Majashun عبد العزيز بن عبد الله الماجشون",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30132",
      "name": "Khalifa bin Khayyat bin Khalifa خليفة بن خياط بن خليفة بن خياط",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "34091",
      "name": "Sahl bin Muhammad bin 'Uthman سهل بن محمد بن عثمان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30142",
      "name": "'Abdullah bin al-Sabah bin 'Abdullah عبد الله بن الصباح بن عبد الله",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30580",
      "name": "'Abdullah bin Ishaq عبد الله بن إسحاق الجوهري",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38433",
      "name": "'Amr bin Mnswr al-Nsa'iy عمرو بن منصور النسائي أبو سعيد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "34140",
      "name": "'Abdul Malik bin Muhammad bin 'Abdullah عبد الملك بن محمد أبو قلابة الرقاشي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30376",
      "name": "Muhammad bin Salam al-Baykandi محمد بن سلام البيكندي الكبير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38719",
      "name": "Y'aqub bin Sufyan يعقوب بن سفيان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "25197",
      "name": "'Ali bin Gharab علي بن غراب",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "37896",
      "name": "Hisham bin Ala bin Hisham هشام بن علي",
      "grade": "3rd Century AH"
    },
    {
      "id": "20264",
      "name": "'Ali bin Nasr bin 'Ali al-Jahdami Older علي بن نصر بن علي الجهضمي الكبير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "31378",
      "name": "al-Fadl bin al-Habab bin Muhammad الفضل بن الحباب",
      "grade": "3rd Century AH"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "399",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن رجاء، قال حدثنا إسرائيل، عن أبي إسحاق، عن البراء بن عازب  رضى الله عنهما  قال كان رسول الله صلى الله عليه وسلم صلى نحو بيت المقدس ستة عشر أو سبعة عشر شهرا، وكان رسول الله صلى الله عليه وسلم يحب أن يوجه إلى الكعبة، فأنزل الله ‏{‏قد نرى تقلب وجهك في السماء‏}‏ فتوجه نحو الكعبة، وقال السفهاء من الناس  وهم اليهود  ما ولاهم عن قبلتهم التي كانوا عليها ‏{‏قل لله المشرق والمغرب يهدي من يشاء إلى صراط مستقيم‏}‏ فصلى مع النبي صلى الله عليه وسلم رجل ثم خرج بعد ما صلى، فمر على قوم من الأنصار في صلاة العصر نحو بيت المقدس فقال هو يشهد أنه صلى مع رسول الله صلى الله عليه وسلم، وأنه توجه نحو الكعبة‏.‏ فتحرف القوم حتى توجهوا نحو الكعبة‏.‏",
      "text_en": " Narrated Bara' bin `Azib:                     Allah's Apostle prayed facing Baitul-Maqdis for sixteen or seventeen months but he loved to face the Ka`ba (at Mecca) so Allah revealed: \"Verily, We have seen the turning of your face to the heaven!\" (2:144) So the Prophet faced the Ka`ba and the fools amongst the people namely \"the Jews\" said, \"What has turned them from their Qibla (Baitul-Maqdis) which they formerly observed\"\" (Allah revealed): \"Say: 'To Allah belongs the East and the West. He guides whom he will to a straight path'.\" (2:142) A man prayed with the Prophet (facing the Ka`ba) and went out. He saw some of the Ansar praying the `Asr prayer with their faces towards Baitul-Maqdis, he said, \"I bear witness that I prayed with Allah's Apostle facing the Ka`ba.\" So all the people turned their faces towards the Ka`ba.",
      "chain": [
        "20245",
        "20311",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "1709",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن رجاء، حدثنا إسرائيل، عن أبي إسحاق، عن عبد الرحمن بن يزيد، قال خرجنا مع عبد الله  رضى الله عنه  إلى مكة، ثم قدمنا جمعا، فصلى الصلاتين، كل صلاة وحدها بأذان وإقامة، والعشاء بينهما، ثم صلى الفجر حين طلع الفجر، قائل يقول طلع الفجر‏.‏ وقائل يقول لم يطلع الفجر‏.‏ ثم قال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن هاتين الصلاتين حولتا عن وقتهما في هذا المكان المغرب والعشاء، فلا يقدم الناس جمعا حتى يعتموا، وصلاة الفجر هذه الساعة ‏\"‏‏.‏ ثم وقف حتى أسفر، ثم قال لو أن أمير المؤمنين أفاض الآن أصاب السنة‏.‏ فما أدري أقوله كان أسرع أم دفع عثمان  رضى الله عنه  فلم يزل يلبي حتى رمى جمرة العقبة يوم النحر‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Yazid:                     I went out with `Abdullah , to Mecca and when we proceeded to am' he offered the two prayers (the Maghrib and the `Isha') together, making the Adhan and Iqama separately for each prayer. He took his supper in between the two prayers. He offered the Fajr prayer as soon as the day dawned. Some people said, \"The day had dawned (at the time of the prayer),\" and others said, \"The day had not dawned.\" `Abdullah then said, \"Allah's Apostle said, 'These two prayers have been shifted from their stated times at this place only (at Al-Muzdalifa); first: The Maghrib and the `Isha'. So the people should not arrive at Al-Muzdalifa till the time of the `Isha' prayer has become due. The second prayer is the morning prayer which is offered at this hour.' \" Then `Abdullah stayed there till it became a bit brighter. He then said, \"If the chief of the believers hastened onwards to Mina just now, then he had indeed followed the Sunna.\" I do not know which proceeded the other, his (`Abdullah's) statement or the departure of `Uthman . `Abdullah was reciting Talbiya till he threw pebbles at the Jamrat-Al- `Aqaba on the Day of Nahr (slaughtering) (that is the 10th of Dhul-Hijja).",
      "chain": [
        "20245",
        "20311",
        "11049",
        "20395"
      ]
    },
    {
      "hadith_no": "3585",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا عبد الله بن رجاء، حدثنا إسرائيل، عن أبي إسحاق، عن وهب أبي جحيفة السوائي، قال رأيت النبي صلى الله عليه وسلم ورأيت بياضا من تحت شفته السفلى العنفقة‏.‏",
      "text_en": " Narrated Wahb Abu Juhaifa As-Sawwai:                     I saw the Prophet and saw some white hair below his lower lip above the chin.",
      "chain": [
        "20245",
        "20311",
        "11049"
      ]
    },
    {
      "hadith_no": "3695",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا عبد الله بن رجاء، حدثنا إسرائيل، عن أبي إسحاق، عن البراء، قال اشترى أبو بكر  رضى الله عنه  من عازب رحلا بثلاثة عشر درهما فقال أبو بكر لعازب مر البراء فليحمل إلى رحلي‏.‏ فقال عازب لا حتى تحدثنا كيف صنعت أنت ورسول الله صلى الله عليه وسلم حين خرجتما من مكة والمشركون يطلبونكم قال ارتحلنا من مكة، فأحيينا أو سرينا ليلتنا ويومنا حتى أظهرنا وقام قائم الظهيرة، فرميت ببصري هل أرى من ظل فآوي إليه، فإذا صخرة أتيتها فنظرت بقية ظل لها فسويته، ثم فرشت للنبي صلى الله عليه وسلم فيه، ثم قلت له اضطجع يا نبي الله‏.‏ فاضطجع النبي صلى الله عليه وسلم ثم انطلقت أنظر ما حولي، هل أرى من الطلب أحدا فإذا أنا براعي غنم يسوق غنمه إلى الصخرة يريد منها الذي أردنا، فسألته فقلت له لمن أنت يا غلام قال لرجل من قريش سماه فعرفته‏.‏ فقلت هل في غنمك من لبن قال نعم‏.‏ قلت فهل أنت حالب لبنا قال نعم‏.‏ فأمرته فاعتقل شاة من غنمه، ثم أمرته أن ينفض ضرعها من الغبار، ثم أمرته أن ينفض كفيه، فقال هكذا ضرب إحدى كفيه بالأخرى فحلب لي كثبة من لبن، وقد جعلت لرسول الله صلى الله عليه وسلم إداوة على فمها خرقة، فصببت على اللبن حتى برد أسفله، فانطلقت به إلى النبي صلى الله عليه وسلم فوافقته قد استيقظ، فقلت اشرب يا رسول الله‏.‏ فشرب حتى رضيت ثم قلت قد آن الرحيل يا رسول الله‏.‏ قال ‏\"‏ بلى ‏\"‏‏.‏ فارتحلنا والقوم يطلبونا، فلم يدركنا أحد منهم غير سراقة بن مالك بن جعشم على فرس له‏.‏ فقلت هذا الطلب قد لحقنا يا رسول الله‏.‏ فقال ‏\"‏ لا تحزن إن الله معنا ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara:                     Abu Bakr bought a (camel) saddle from `Azib for thirteen Dirhams. Abu Bakr said to `Azib, \"Tell Al- Bara' to carry the saddle for me.\" `Azib said, \"No, unless you relate to me what happened to you and Allah 's Apostle when you left Mecca while the pagans were in search of you.\" Abu Bakr said, \"We left Mecca and we travel led continuously for that night and the following day till it was midday. I looked (around) searching for shade to take as shelter, and suddenly I came across a rock, and found a little shade there. So I cleaned the place and spread a bed for the Prophet in the shade and said to him, 'Lie down, O Allah's Apostle.' So the Prophet lay down and I went out, looking around to see if there was any person pursuing us. Suddenly I saw a shepherd driving his sheep towards the rock, seeking what we had already sought from it. I asked him, 'To whom do you belong, O boy?' He said, 'I belong to a man from Quraish.' He named the man and I recognized him. I asked him, 'Is there any milk with your sheep?' He said, 'Yes.' I said, 'Will you then milk (some) for us?' He said, 'Yes.' Then I asked him to tie the legs of one of the sheep and clean its udder, and then ordered him to clean his hands from dust. Then the shepherd cleaned his hands by striking his hands against one another. After doing so, he milked a small amount of milk. I used to keep for Allah's Apostle a leather water-container, the mouth of which was covered with a piece of cloth. I poured water on the milk container till its lower part was cold. Then I took the milk to the Prophet whom I found awake. I said to him, 'Drink, O Allah's Apostle.' So he drank till I became pleased. Then I said, 'It is time for us to move, O Allahs Apostle!' He said, 'Yes.' So we set out while the people (i.e. Quraish pagans) were searching for us, but none found us except Suraiqa bin Malik bin Jushum who was riding his horse. I said, 'These are our pursuers who have found us. O Allah's Apostle!' He said, 'Do not grieve, for Allah is with us.\"",
      "chain": [
        "20245",
        "20311",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "4006",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن رجاء، حدثنا إسرائيل، عن أبي إسحاق، عن البراء، قال كنا أصحاب محمد صلى الله عليه وسلم نتحدث أن عدة أصحاب بدر على عدة أصحاب طالوت الذين جاوزوا معه النهر، ولم يجاوز معه إلا مؤمن، بضعة عشر وثلاثمائة‏.‏",
      "text_en": " Narrated Al-Bara:                     We, the Companions of Muhammad used to say that the number of the warriors of Badr was the same as the number of Saul's companions who crossed the river (of Jordan) with him, and none crossed the river with him but a believer, and the were over three-hundred-and-ten men.",
      "chain": [
        "20245",
        "20311",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "4175",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "وقال عبد الله بن رجاء أخبرنا عمران القطان، عن يحيى بن أبي كثير، عن أبي سلمة، عن جابر بن عبد الله  رضى الله عنهما أن النبي صلى الله عليه وسلم صلى بأصحابه في الخوف في غزوة السابعة غزوة ذات الرقاع‏.‏ قال ابن عباس صلى النبي صلى الله عليه وسلم الخوف بذي قرد‏.‏",
      "text_en": "",
      "chain": [
        "20245",
        "20718",
        "11449",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "4407",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبد الله بن رجاء، حدثنا إسرائيل، عن أبي إسحاق، عن البراء  رضى الله عنه  قال آخر سورة نزلت كاملة براءة، وآخر سورة نزلت خاتمة سورة النساء ‏{‏يستفتونك قل الله يفتيكم في الكلالة‏}‏",
      "text_en": " Narrated Al-Bara:                     The last Sura which was revealed in full was Baraa (i.e. Sura-at-Tauba), and the last Sura (i.e. part of a Sura) which was revealed was the last Verses of Sura-an-Nisa':-- \"They ask you for a legal decision. Say: Allah directs (thus) About those who have No descendants or ascendants As heirs.\" (4.177)",
      "chain": [
        "20245",
        "20311",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "4511",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن رجاء، حدثنا إسرائيل، عن أبي إسحاق، قال سألت زيد بن أرقم  رضى الله عنه  كم غزوت مع رسول الله صلى الله عليه وسلم قال سبع عشرة‏.‏ قلت كم غزا النبي صلى الله عليه وسلم قال تسع عشرة‏.‏",
      "text_en": " Narrated Abu 'Is-haq:                     I asked Zaid bin Al-Arqam, \"In how many Ghazawat did you take part in the company of Allah's Apostle?\" He replied, \"Seventeen.\" I further asked, \"How many Ghazawat did the Prophet fight?\" He replied, \"Nineteen.\"",
      "chain": [
        "20245",
        "20311",
        "11049",
        "384"
      ]
    },
    {
      "hadith_no": "4512",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن رجاء، حدثنا إسرائيل، عن أبي إسحاق، حدثنا البراء  رضى الله عنه  قال غزوت مع النبي صلى الله عليه وسلم خمس عشرة‏.‏",
      "text_en": " Narrated Al-Bara:                     I fought fifteen Ghazawat in the company of the Prophet.",
      "chain": [
        "20245",
        "20311",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "4949",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن رجاء، حدثنا إسرائيل، عن أبي إسحاق، عن زيد بن أرقم، قال كنت في غزاة فسمعت عبد الله بن أبى، يقول لا تنفقوا على من عند رسول الله حتى ينفضوا من حوله ولو رجعنا من عنده ليخرجن الأعز منها‏.‏ الأذل فذكرت ذلك لعمي أو لعمر فذكره للنبي صلى الله عليه وسلم فدعاني فحدثته فأرسل رسول الله صلى الله عليه وسلم إلى عبد الله بن أبى وأصحابه فحلفوا ما قالوا فكذبني رسول الله صلى الله عليه وسلم وصدقه فأصابني هم لم يصبني مثله قط، فجلست في البيت فقال لي عمي ما أردت إلى أن كذبك رسول الله صلى الله عليه وسلم ومقتك‏.‏ فأنزل الله تعالى ‏{‏إذا جاءك المنافقون‏}‏ فبعث إلى النبي صلى الله عليه وسلم فقرأ فقال ‏\"‏ إن الله قد صدقك يا زيد ‏\"‏‏.‏",
      "text_en": " Narrated Zaid bin Arqam:                     While I was taking part in a Ghazwa. I heard `Abdullah bin Ubai (bin Abi Salul) saying. \"Don't spend on those who are with Allah's Apostle, that they may disperse and go away from him. If we return (to Medina), surely, the more honorable will expel the meaner amongst them.\" I reported that (saying) to my uncle or to `Umar who, in his turn, informed the Prophet of it. The Prophet called me and I narrated to him the whole story. Then Allah's Apostle sent for `Abdullah bin Ubai and his companions, and they took an oath that they did not say that. So Allah's Apostle disbelieved my saying and believed his. I was distressed as I never was before. I stayed at home and my uncle said to me. \"You just wanted Allah's Apostle to disbelieve your statement and hate you.\" So Allah revealed (the Sura beginning with) 'When the hypocrites come to you.' (63.1) The Prophet then sent for me and recited it and said, \"O Zaid! Allah confirmed your statement.\"",
      "chain": [
        "20245",
        "20311",
        "11049",
        "384"
      ]
    },
    {
      "hadith_no": "5339",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا عبد الله بن رجاء، أخبرنا شعبة، عن الحكم، عن إبراهيم، عن الأسود، أن عائشة، أرادت أن تشتري، بريرة، فأبى مواليها إلا أن يشترطوا الولاء، فذكرت للنبي صلى الله عليه وسلم فقال ‏\"‏ اشتريها وأعتقيها، فإنما الولاء لمن أعتق ‏\"‏‏.‏ وأتي النبي صلى الله عليه وسلم بلحم فقيل إن هذا ما تصدق على بريرة، فقال ‏\"‏ هو لها صدقة، ولنا هدية ‏\"‏‏.‏ حدثنا آدم حدثنا شعبة وزاد فخيرت من زوجها‏.‏",
      "text_en": " Narrated Al-Aswad:                     Aisha intended to buy Barira, but her masters stipulated that her wala wound be for them. Aisha mentioned that to the Prophet who said (to `Aisha), \"Buy and manumit her, for the wala is for the one who manumits.\" Once some me; was brought to the Prophet and was said, \"This meat was given in charity to Barira. \" The Prophet said, \"It an object of charity for Barira and present for us.\"",
      "chain": [
        "20245",
        "20020",
        "11069",
        "11051",
        "11054"
      ]
    },
    {
      "hadith_no": "5979",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا أبو الوليد، وعبد الله بن رجاء، قالا حدثنا شعبة، عن الحكم، عن إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  قالت كأني أنظر إلى وبيص الطيب في مفارق النبي صلى الله عليه وسلم وهو محرم‏.‏ قال عبد الله في مفرق النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Aisha:                     As if I am now looking at the shine of the hair parting of the Prophet while he was in the state of lhram.",
      "chain": [
        "20296",
        "20245",
        "20020",
        "11069",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "6642",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عبد الله بن رجاء، حدثنا إسرائيل، عن أبي إسحاق، عن النعمان بن بشير، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إن أهون أهل النار عذابا يوم القيامة رجل على أخمص قدميه جمرتان يغلي منهما دماغه، كما يغلي المرجل والقمقم‏\"‏‏.‏",
      "text_en": " Narrated An-Nu`man bin Bashir:                     I heard the Prophet saying, \"The least punished person of the (Hell) Fire people on the Day of Resurrection will be a man under whose arch of the feet two smoldering embers will be placed, because of which his brain will boil just like Al-Mirjal (copper vessel) or a Qum-qum (narrow-necked vessel) is boiling with water.\"",
      "chain": [
        "20245",
        "20311",
        "11049",
        "274"
      ]
    },
    {
      "hadith_no": "6964",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا أبو نعيم، حدثنا شيبان، عن يحيى، عن أبي سلمة، عن أبي هريرة، أن خزاعة، قتلوا رجلا‏.‏ وقال عبد الله بن رجاء حدثنا حرب عن يحيى حدثنا أبو سلمة حدثنا أبو هريرة أنه عام فتح مكة قتلت خزاعة رجلا من بني ليث بقتيل لهم في الجاهلية، فقام رسول الله صلى الله عليه وسلم فقال ‏\"‏ إن الله حبس عن مكة الفيل وسلط عليهم رسوله والمؤمنين، ألا وإنها لم تحل لأحد قبلي، ولا تحل لأحد بعدي، ألا وإنما أحلت لي ساعة من نهار، ألا وإنها ساعتي هذه حرام لا يختلى شوكها، ولا يعضد شجرها، ولا يلتقط ساقطتها إلا منشد، ومن قتل له قتيل فهو بخير النظرين إما يودى وإما يقاد ‏\"‏‏.‏ فقام رجل من أهل اليمن يقال له أبو شاه فقال اكتب لي يا رسول الله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اكتبوا لأبي شاه ‏\"‏‏.‏ ثم قام رجل من قريش فقال يا رسول الله إلا الإذخر، فإنما نجعله في بيوتنا وقبورنا‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إلا الإذخر ‏\"‏‏.‏ وتابعه عبيد الله عن شيبان في الفيل، قال بعضهم عن أبي نعيم القتل‏.‏ وقال عبيد الله إما أن يقاد أهل القتيل‏.‏",
      "text_en": " Narrated Abu Huraira:                     In the year of the Conquest of Mecca, the tribe of Khuza`a killed a man from the tribe of Bam Laith in revenge for a killed person belonging to them in the Pre-lslamic Period of Ignorance. So Allah's Apostle got up saying, \"Allah held back the (army having) elephants from Mecca, but He let His Apostle and the believers overpower the infidels (of Mecca). Beware! (Mecca is a sanctuary)! Verily! Fighting in Mecca was not permitted for anybody before me, nor will it be permitted for anybody after me; It was permitted for me only for a while (an hour or so) of that day. No doubt! It is at this moment a sanctuary; its thorny shrubs should not be uprooted; its trees should not be cut down; and its Luqata (fallen things) should not be picked up except by the one who would look for its owner. And if somebody is killed, his closest relative has the right to choose one of two things, i.e., either the Blood money or retaliation by having the killer killed.\" Then a man from Yemen, called Abu Shah, stood up and said, \"Write that) for me, O Allah's Apostle!\" Allah's Apostle said (to his companions), \"Write that for Abu Shah.\" Then another man from Quraish got up, saying, \"O Allah's Apostle! Except Al- Idhkhir (a special kind of grass) as we use it in our houses and for graves.\" Allah's Apostle said, \"Except Al-idhkkir.\"",
      "chain": [
        "20348",
        "20240",
        "11449",
        "10567",
        "13",
        "20245",
        "20220",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3158",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني سريج بن يونس، حدثنا عبد الله بن رجاء، عن موسى بن عقبة، حدثني محمد بن أبي بكر، قال قلت لأنس بن مالك غداة عرفة ما تقول في التلبية هذا اليوم قال سرت هذا المسير مع النبي صلى الله عليه وسلم وأصحابه فمنا المكبر ومنا المهلل ولا يعيب أحدنا على صاحبه ‏.‏",
      "text_en": " Muhammad b. Abu Bakr reported:                      I said to Anas b. Malik in the morning of 'Arafa: What do you say as to pronouncing Talbiya on this day? He said: I travelled with Allah's Apostle (may peace he upon him) and his Companions in this journey. Some of us pronounced Takbir and some of us pronounced Tahlil, and none of us found fault with his companion.",
      "chain": [
        "30251",
        "20245",
        "11106",
        "11214"
      ]
    },
    {
      "hadith_no": "4662",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا سريج بن يونس، وعمرو الناقد، - واللفظ لسريج - قالا حدثنا عبد، الله بن رجاء عن يونس، عن الزهري، عن سالم، عن أبيه، قال نفلنا رسول الله صلى الله عليه وسلم نفلا سوى نصيبنا من الخمس فأصابني شارف والشارف المسن الكبير ‏.",
      "text_en": " A hadith has been narrated by Salim who learnt it from his father and said:                      The Messenger of Allah (may peace be upon him) gave us an extra (camel) besides our share of Khums; (and in this extra share) I got a Sharif (and a Sharif is a big old camel).",
      "chain": [
        "30251",
        "20245",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1006",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا عبد الله بن رجاء، قال أنبأنا إسرائيل، عن أبي حصين، عن يحيى بن وثاب، عن مسروق، عن عبد الله، وأتاه، رجل فقال إني قرأت الليلة المفصل في ركعة ‏.‏ فقال هذا كهذ الشعر لكن رسول الله صلى الله عليه وسلم كان يقرأ النظائر عشرين سورة من المفصل من آل حم ‏.‏",
      "text_en": " It was narrated from 'Abdullah that:                     A man came to him and said: \"Last night I recited Al-Mufassal in one rak'ah.\" He said: \"That is like reciting poetry. But the Messenger of Allah (ﷺ) used to recite similar surahs, twenty surahs from Al-Mufassal, those that start with Ha-Mim.\"",
      "chain": [
        "38433",
        "20245",
        "20311",
        "11371",
        "11018",
        "16"
      ]
    },
    {
      "hadith_no": "3001",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا عبد الله بن رجاء، قال حدثنا موسى بن عقبة، عن محمد بن أبي بكر، - وهو الثقفي - قال قلت لأنس غداة عرفة ما تقول في التلبية في هذا اليوم قال سرت هذا المسير مع رسول الله صلى الله عليه وسلم وأصحابه وكان منهم المهل ومنهم المكبر فلا ينكر أحد منهم على صاحبه ‏.‏",
      "text_en": " It was narrated that Muhmmad bin Abi Abkr - Ath-Thaqafi - said:                     \"I said to Anas on the morning of Arafat: 'What do you say about the Talbiyah on this day?' I said: 'I walked this path with the Messenger of Allah and his Companions. Some of them recited the Talbiyah and some recited the Takbir, and none of them denounced any other.\"",
      "chain": [
        "30123",
        "20245",
        "11106",
        "11573"
      ]
    },
    {
      "hadith_no": "3762",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرني محمد بن يحيى بن عبد الله، قال حدثنا محمد بن الصلت أبو يعلى، قال حدثنا عبد الله بن رجاء، عن عباد بن إسحاق، عن الزهري، عن سالم، عن أبيه، قال كانت يمين رسول الله صلى الله عليه وسلم التي يحلف بها ‏\"‏ لا ومصرف القلوب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Salim that his father said:                      \"The oath by which the Messenger of Allah used to swear was: 'No, by the Controller of the hearts.'\"",
      "chain": [
        "11222",
        "30211",
        "20245",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "5306",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا عبد الله بن رجاء، قال أنبأنا حرب، عن يحيى بن أبي كثير، قال حدثني عمران بن حطان، أنه سأل عبد الله بن عباس عن لبس الحرير، فقال سل عائشة ‏.‏ فسألت عائشة قالت سل عبد الله بن عمر ‏.‏ فسألت ابن عمر فقال حدثني أبو حفص أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من لبس الحرير في الدنيا فلا خلاق له في الآخرة ‏\"‏ ‏.‏",
      "text_en": " 'Imran bin Hittan narrated that :                     He asked 'Abdullah bin 'Abbas about wearing silk. He said: \"Ask 'Aishah.\" \"So I asked 'Aishah and she said: 'Ask 'Abdullah bin 'Umar.' So I asked Ibn 'Umar and he said: 'Abu Hafs told me, that the Messenger of Allah [SAW] said: \"Whoever wears silk in this world will have no share in the Hereafter.\"",
      "chain": [
        "38433",
        "20245",
        "20220",
        "11449",
        "11715",
        "17"
      ]
    },
    {
      "hadith_no": "5453",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا أبو حاتم السجستاني، قال حدثنا عبد الله بن رجاء، قال حدثني سعيد بن سلمة، قال حدثني عمرو بن أبي عمرو، مولى المطلب عن عبد الله بن المطلب، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم كان إذا دعا قال ‏\"‏ اللهم إني أعوذ بك من الهم والحزن والعجز والكسل والبخل والجبن وضلع الدين وغلبة الرجال ‏\"‏ ‏.‏ قال أبو عبد الرحمن سعيد بن سلمة شيخ ضعيف وإنما أخرجناه للزيادة في الحديث ‏.‏",
      "text_en": " It was narrated from Anas bin Malik, that :                     When the Messenger of Allah [SAW] supplicated, he would say: \"Allahumma inni a'udhu bika minal-hammi, wal-hazani, wal-'ajzi, wal-kasali, wal-bukhli, wal-jubni, wad-dala'id-daini, wa ghalabatir-rijal (O Allah, I seek refuge with You from worry, grief, incapacity, laziness, miserliness, cowardice, difficult debt and being overpowered by men.)\"",
      "chain": [
        "34091",
        "20245",
        "20502",
        "11209",
        "19"
      ]
    },
    {
      "hadith_no": "206",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد الله بن رجاء، حدثنا إسرائيل، عن عثمان، - يعني ابن المغيرة الثقفي - عن سالم بن أبي الجعد، عن جابر بن عبد الله، قال كان رسول الله  صلى الله عليه وسلم  يعرض نفسه على الناس في الموسم فيقول ‏\"‏ ألا رجل يحملني إلى قومه فإن قريشا قد منعوني أن أبلغ كلام ربي ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir bin 'Abdullah said:                     The Messenger of Allah used to appear before the people during the Hajj season and say: 'Is there any man who can take me to his people, for the Quraish have prevented me from conveying the speech (i.e. the Message) of my Lord.'\"",
      "chain": [
        "11222",
        "20245",
        "20311",
        "11640",
        "11342",
        "34"
      ]
    },
    {
      "hadith_no": "366",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عبد الله بن رجاء، أنبأنا عكرمة بن عمار، عن يحيى بن أبي كثير، عن هلال بن عياض، عن أبي سعيد الخدري، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لا يتناجى اثنان على غائطهما ينظر كل واحد منهما إلى عورة صاحبه فإن الله عز وجل يمقت على ذلك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Khudri that:                     The Messenger of Allah said: \"No two people should converse while relieving themselves, each of them looking at the private parts of the other, for Allah, the Mighty and Sublime, hates that.\" (Da'if)Other chains with similar wording.",
      "chain": [
        "11222",
        "20245",
        "10704",
        "11449",
        "38"
      ]
    },
    {
      "hadith_no": "2211",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن يحيى، وعبد الله بن إسحاق الجوهري، قالا حدثنا عبد الله بن رجاء، أنبأنا المسعودي، عن حبيب بن أبي ثابت، عن سعيد بن جبير، عن ابن عباس، أن رجلا، جاء إلى النبي  صلى الله عليه وسلم  فقال يا رسول الله إني نذرت أن أنحر ببوانة فقال ‏\"‏ في نفسك شىء من أمر الجاهلية ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ أوف بنذرك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Abbas that a man came to the Prophet (ﷺ) and said:                     \"O Messenger of Allah, I vowed to offer a sacrifice at Buwanah.\" He said: \"Do you intend any action of Ignorance period?\" He said: \"No.\" He said: \"Then fulfill your vow.\"",
      "chain": [
        "11222",
        "30580",
        "20245",
        "20724",
        "11331",
        "11050",
        "17"
      ]
    }
  ],
  "total_hadiths": 24
}