{
  "id": "20241",
  "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
  "full_name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "122",
      "date_gregorian": "NA",
      "date_display": [
        "122 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "210",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Basra",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]",
      "Fiqh"
    ],
    "tags": [
      "al-Shaybani",
      "al-Basri"
    ]
  },
  "parents": [
    {
      "id": "28556",
      "name": "Mkhld bin al-Dhak bin Muslim مخلد بن الضحاك بن مسلم الشيباني",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11450",
      "name": "Yazid bin Abi 'Ubaid يزيد بن أبي عبيد",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11555",
      "name": "Ayman bin Nabil أيمن بن نابل الحبشي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "15223",
      "name": "Shbyb bin Bashr شبيب بن بشر",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "14265",
      "name": "'Uthman bin Sa'd عثمان بن سعد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11071",
      "name": "'Abdullah bin 'Awn bin Artaban عبد الله بن عون بن أرطبان الخزار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10616",
      "name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20638",
      "name": "Sa'id bin 'Abdul 'Aziz al-Tanuqi سعيد بن عبد العزيز التنوخي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20415",
      "name": "Thaur bin Yazid al-Rahbi ثور بن يزيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28085",
      "name": "Ja'far bin Yahya bin Thwban جعفر بن يحيى بن ثوبان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11243",
      "name": "Hanzala bin Abi Sufyan bin 'Abdur Rahman حنظلة بن أبي سفيان بن عبد الرحمن",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "26010",
      "name": "Haywat bin Sharih bin Safwan حيوة بن شريح بن صفوان التجيبي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11244",
      "name": "Zakaria bin Ishaq al-Makki زكريا بن إسحاق المكي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11073",
      "name": "Sa'id bin Abi 'Aruba سعيد بن أبي عروبة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11875",
      "name": "'Abdul Hameed bin Ja'far عبد الحميد بن جعفر بن عبد الله",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20561",
      "name": "'Uzra bin Thabit عزرة بن ثابت بن أبي زيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11530",
      "name": "'Umar bin Muhammad bin Zayd عمر بن محمد بن زيد بن عبد الله",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20197",
      "name": "'Uthman bin al-'Aswad bin Musa عثمان بن الأسود بن موسى",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10652",
      "name": "'Umar bin Sa'id bin Abi Hussain عمر بن سعيد بن أبي حسين النوفلي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "11311",
      "name": "Hisham bin Hassan al-Azdi هشام بن حسان الأزدي القردوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "12508",
      "name": "Mzahr bin Aslm مظاهر بن أسلم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11301",
      "name": "Qurrah bin Khalid al-Sadusi قرة بن خالد السدوسي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20556",
      "name": "'Abdul Malik bin Qarib - al-Asma'i عبد الملك بن قريب بن عبد الملك - الأصمعي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20330",
      "name": "'Abdullah bin Da'ud al-Kharaybi عبد الله بن داود أبو عبد الرحمن الخريبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30313",
      "name": "Ishaq bin Mansur al-Kausaj إسحاق بن منصور بن بهرام - الكوسج",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38834",
      "name": "Hajjaj bin Yusuf bin al-Sha'ir حجاج بن يوسف الشاعر",
      "grade": "3rd Century AH"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30437",
      "name": "'Abbas bin 'Abdul 'Azeem al-'Anbari عباس بن عبد العظيم العنبري",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "258",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثنا أبو عاصم، عن حنظلة، عن القاسم، عن عائشة، قالت كان النبي صلى الله عليه وسلم إذا اغتسل من الجنابة دعا بشىء نحو الحلاب، فأخذ بكفه، فبدأ بشق رأسه الأيمن ثم الأيسر، فقال بهما على رأسه‏.‏",
      "text_en": " Narrated `Aisha:                     Whenever the Prophet took the bath of Janaba (sexual relation or wet dream) he asked for the Hilab or some other scent. He used to take it in his hand, rub it first over the right side of his head and then over the left and then rub the middle of his head with both hands.",
      "chain": [
        "30170",
        "20241",
        "11243",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "359",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو عاصم، عن مالك، عن أبي الزناد، عن عبد الرحمن الأعرج، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ لا يصلي أحدكم في الثوب الواحد، ليس على عاتقيه شىء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"None of you should offer prayer in a single garment that does not cover the shoulders.\"",
      "chain": [
        "20241",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "721",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو عاصم، عن مالك، عن سمى، عن أبي صالح، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ الشهداء الغرق والمطعون والمبطون والهدم ‏\"‏‏.‏ وقال ‏\"‏ ولو يعلمون ما في التهجير لاستبقوا ‏{‏إليه‏}‏ ولو يعلمون ما في العتمة والصبح لأتوهما ولو حبوا، ولو يعلمون ما في الصف المقدم لاستهموا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Martyrs are those who die because of drowning, plague, an Abdominal disease, or of being buried alive by a falling building.\" And then he added, \"If the people knew the Reward for the Zuhr prayer in its early time, they would race for it. If they knew the reward for the `Isha' and the Fajr prayers in congregation, they would join them even if they had to crawl. If they knew the reward for the first row, they would draw lots for it.\"",
      "chain": [
        "20241",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "764",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن ابن أبي مليكة، عن عروة بن الزبير، عن مروان بن الحكم، قال قال لي زيد بن ثابت ما لك تقرأ في المغرب بقصار، وقد سمعت النبي صلى الله عليه وسلم يقرأ بطول الطوليين",
      "text_en": " Narrated Marwan bin Al-Hakam:                     Zaid bin Thabit said to me, \"Why do you recite very short Suras in the Maghrib prayer while I heard the Prophet reciting the longer of the two long Suras?\"",
      "chain": [
        "20241",
        "11070",
        "11090",
        "10511",
        "858",
        "49"
      ]
    },
    {
      "hadith_no": "854",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا أبو عاصم، قال أخبرنا ابن جريج، قال أخبرني عطاء، قال سمعت جابر بن عبد الله، قال قال النبي صلى الله عليه وسلم ‏\"‏ من أكل من هذه الشجرة  يريد الثوم  فلا يغشانا في مساجدنا ‏\"‏‏.‏ قلت ما يعني به قال ما أراه يعني إلا نيئه‏.‏ وقال مخلد بن يزيد عن ابن جريج إلا نتنه‏.‏",
      "text_en": " Narrated `Ata':                     I heard Jabir bin `Abdullah saying, \"The Prophet said, 'Whoever eats (from) this plant (he meant garlic) should keep away from our mosque.\" I said, \"What does he mean by that?\" He replied, \"I think he means only raw garlic.\"",
      "chain": [
        "30351",
        "20241",
        "11070",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "923",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن معمر، قال حدثنا أبو عاصم، عن جرير بن حازم، قال سمعت الحسن، يقول حدثنا عمرو بن تغلب، أن رسول الله صلى الله عليه وسلم أتي بمال أو سبى فقسمه، فأعطى رجالا وترك رجالا فبلغه أن الذين ترك عتبوا، فحمد الله ثم أثنى عليه، ثم قال ‏\"‏ أما بعد، فوالله إني لأعطي الرجل، وأدع الرجل، والذي أدع أحب إلى من الذي أعطي ولكن أعطي أقواما لما أرى في قلوبهم من الجزع والهلع، وأكل أقواما إلى ما جعل الله في قلوبهم من الغنى والخير، فيهم عمرو بن تغلب ‏\"‏‏.‏ فوالله ما أحب أن لي بكلمة رسول الله صلى الله عليه وسلم حمر النعم‏.‏ تابعه يونس‏.‏",
      "text_en": " Narrated `Amr bin Taghlib:                     Some property or something was brought to Allah's Apostle and he distributed it. He gave to some men and ignored the others. Later he got the news of his being admonished by those whom he had ignored. So he glorified and praised Allah and said, \"Amma ba'du. By Allah, I may give to a man and ignore another, although the one whom I ignore is more beloved to me than the one whom I give. But I give to some people as I feel that they have no patience and no contentment in their hearts and I leave those who are patient and self-content with the goodness and wealth which Allah has put into their hearts and `Amr bin Taghlib is one of them.\" `Amr added, By Allah! Those words of Allah's Apostle are more beloved to me than the best red camels.",
      "chain": [
        "30172",
        "20241",
        "11272",
        "11016",
        "5200"
      ]
    },
    {
      "hadith_no": "962",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو عاصم، قال أخبرنا ابن جريج، قال أخبرني الحسن بن مسلم، عن طاوس، عن ابن عباس، قال شهدت العيد مع رسول الله صلى الله عليه وسلم وأبي بكر وعمر وعثمان  رضى الله عنهم  فكلهم كانوا يصلون قبل الخطبة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I offered the `Id prayer with Allah's Apostle, Abu Bakr, `Umar and `Uthman and all of them offered the prayer before delivering the Khutba.",
      "chain": [
        "20241",
        "11070",
        "11557",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1413",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو عاصم الضحاك بن مخلد، عن زكرياء بن إسحاق، عن يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس  رضى الله عنهما  أن النبي صلى الله عليه وسلم بعث معاذا  رضى الله عنه  إلى اليمن فقال ‏\"‏ ادعهم إلى شهادة أن لا إله إلا الله، وأني رسول الله، فإن هم أطاعوا لذلك فأعلمهم أن الله قد افترض عليهم خمس صلوات في كل يوم وليلة، فإن هم أطاعوا لذلك فأعلمهم أن الله افترض عليهم صدقة في أموالهم، تؤخذ من أغنيائهم وترد على فقرائهم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet () sent Mu`adh to Yemen and said, \"Invite the people to testify that none has the right to be worshipped but Allah and I am Allah's Apostle, and if they obey you to do so, then teach them that Allah has enjoined on them five prayers in every day and night (in twenty-four hours), and if they obey you to do so, then teach them that Allah has made it obligatory for them to pay the Zakat from their property and it is to be taken from the wealthy among them and given to the poor.\"",
      "chain": [
        "20241",
        "11244",
        "11448",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "1434",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا أبو عاصم النبيل، أخبرنا سعدان بن بشر، حدثنا أبو مجاهد، حدثنا محل بن خليفة الطائي، قال سمعت عدي بن حاتم  رضى الله عنه  يقول كنت عند رسول الله صلى الله عليه وسلم فجاءه رجلان أحدهما يشكو العيلة، والآخر يشكو قطع السبيل، فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما قطع السبيل فإنه لا يأتي عليك إلا قليل حتى تخرج العير إلى مكة بغير خفير، وأما العيلة فإن الساعة لا تقوم حتى يطوف أحدكم بصدقته لا يجد من يقبلها منه، ثم ليقفن أحدكم بين يدى الله ليس بينه وبينه حجاب ولا ترجمان يترجم له، ثم ليقولن له ألم أوتك مالا فليقولن بلى‏.‏ ثم ليقولن ألم أرسل إليك رسولا فليقولن بلى‏.‏ فينظر عن يمينه فلا يرى إلا النار، ثم ينظر عن شماله فلا يرى إلا النار، فليتقين أحدكم النار ولو بشق تمرة، فإن لم يجد فبكلمة طيبة ‏\"‏‏.‏",
      "text_en": " Narrated `Adi bin Hatim:                     While I was sitting with Allah's Apostle (p.b.u.h) two person came to him; one of them complained about his poverty and the other complained about the prevalence of robberies. Allah's Apostle said, \"As regards stealing and robberies, there will shortly come a time when a caravan will go to Mecca (from Medina) without any guard. And regarding poverty, The Hour (Day of Judgment) will not be established till one of you wanders about with his object of charity and will not find anybody to accept it And (no doubt) each one of you will stand in front of Allah and there will be neither a curtain nor an interpreter between him and Allah, and Allah will ask him, 'Did not I give you wealth?' He will reply in the affirmative. Allah will further ask, 'Didn't send a messenger to you?' And again that person will reply in the affirmative Then he will look to his right and he will see nothing but Hell-fire, and then he will look to his left and will see nothing but Hell-fire. And so, any (each one) of you should save himself from the fire even by giving half of a date-fruit (in charity). And if you do not find a hall datefruit, then (you can do it through saying) a good pleasant word (to your brethren). (See Hadith No. 793 Vol. 4).",
      "chain": [
        "30351",
        "20241",
        "11651",
        "212"
      ]
    },
    {
      "hadith_no": "1451",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو عاصم، عن عمر بن سعيد، عن ابن أبي مليكة، أن عقبة بن الحارث  رضى الله عنه  حدثه قال صلى بنا النبي صلى الله عليه وسلم العصر، فأسرع ثم دخل البيت، فلم يلبث أن خرج، فقلت أو قيل له فقال ‏\"‏ كنت خلفت في البيت تبرا من الصدقة، فكرهت أن أبيته فقسمته ‏\"‏‏.‏",
      "text_en": " Narrated `Uqba bin Al-Harith:                     Once the Prophet offered the `Asr prayer and then hurriedly went to his house and returned immediately. I (or somebody else) asked him (as to what was the matter) and he said, \"I left at home a piece of gold which was from the charity and I disliked to let it remain a night in my house, so I got it distributed . \"",
      "chain": [
        "20241",
        "10652",
        "11090",
        "872"
      ]
    },
    {
      "hadith_no": "1456",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، وحدثني محمد بن عبد الرحيم، عن حجاج بن محمد، عن ابن جريج، قال أخبرني ابن أبي مليكة، عن عباد بن عبد الله بن الزبير، أخبره عن أسماء بنت أبي بكر  رضى الله عنهما  أنها جاءت إلى النبي صلى الله عليه وسلم فقال ‏\"‏ لا توعي فيوعي الله عليك، ارضخي ما استطعت ‏\"‏‏.‏",
      "text_en": " Narrated Asma' bint Abu Bakr:                     that she had gone to the Prophet and he said, \"Do not shut your money bag; otherwise Allah too will withhold His blessings from you. Spend (in Allah's Cause) as much as you can afford. \"",
      "chain": [
        "20241",
        "11070",
        "30272",
        "20381",
        "11070",
        "11090",
        "11250",
        "70"
      ]
    },
    {
      "hadith_no": "1543",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عمرو بن علي، حدثنا أبو عاصم، حدثنا أيمن بن نابل، حدثنا القاسم بن محمد، عن عائشة  رضى الله عنها  أنها قالت يا رسول الله، اعتمرتم ولم أعتمر‏.‏ فقال ‏\"‏ يا عبد الرحمن اذهب بأختك فأعمرها من التنعيم ‏\"‏‏.‏ فأحقبها على ناقة فاعتمرت‏.‏",
      "text_en": " Narrated Al-Qasim bin Muhammad:                     `Aisha said, \"O Allah's Apostle! You performed `Umra but I did not.\" He said, \"O `Abdur-Rahman! Go along with your sister and let her perform `Umra from Tan`im.\" `Abdur-Rahman made her ride over the packsaddle of a she-camel and she performed `Umra.",
      "chain": [
        "30153",
        "20241",
        "11555",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "1561",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "قال أبو عاصم أخبرنا ابن جريج، أخبرني عطاء، أن صفوان بن يعلى، أخبره أن يعلى قال لعمر  رضى الله عنه  أرني النبي صلى الله عليه وسلم حين يوحى إليه قال فبينما النبي صلى الله عليه وسلم بالجعرانة، ومعه نفر من أصحابه، جاءه رجل فقال يا رسول الله كيف ترى في رجل أحرم بعمرة، وهو متضمخ بطيب فسكت النبي صلى الله عليه وسلم ساعة فجاءه الوحى، فأشار عمر  رضى الله عنه  إلى يعلى، فجاء يعلى، وعلى رسول الله صلى الله عليه وسلم ثوب قد أظل به فأدخل رأسه، فإذا رسول الله صلى الله عليه وسلم محمر الوجه، وهو يغط ثم سري عنه فقال ‏\"‏ أين الذي سأل عن العمرة ‏\"‏ فأتي برجل فقال ‏\"‏ اغسل الطيب الذي بك ثلاث مرات، وانزع عنك الجبة، واصنع في عمرتك كما تصنع في حجتك ‏\"‏‏.‏ قلت لعطاء أراد الإنقاء حين أمره أن يغسل ثلاث مرات قال نعم‏.‏",
      "text_en": " Narrated Safwan bin Ya'la:                      Ya'la said to 'Umar, \"Show me the Prophet () when he is being inspired Divinely.\" While the Prophet () was at Ji'rana (in the company of some of his Companions) a person came and asked, \"O Allah's Messenger! What is your verdict regarding that person who assumes Ihram for 'Umra and is scented with perfume ?\" The Prophet () kept quiet for a while and he was Divinely inspired (then). 'Umar beckoned Ya'la. So he came, and the Allah's Messenger () was shaded with sheet. Ya'la put his head in and saw that the face of Allah's Messenger was red and he was snoring. When the state of the Prophet () was over, he () asked, \"Where is the person who asked about 'Umra?\" Then that person was brought and the Prophet () said, \"Wash the perfume off your body thrice and take off the cloak and do the same in 'Umra as you do in Hajj.\"",
      "chain": [
        "20241",
        "11070",
        "11029",
        "11248",
        "20372"
      ]
    },
    {
      "hadith_no": "1577",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو عاصم، أخبرنا ابن جريج، قال أخبرني صالح بن كيسان، عن نافع، عن ابن عمر  رضى الله عنهما  قال أهل النبي صلى الله عليه وسلم حين استوت به راحلته قائمة‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet (p.b.u.h) recited Talbiya when he had mounted his Mount and was ready to set out.",
      "chain": [
        "20241",
        "11070",
        "11176",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1607",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا أبو عاصم، قال أخبرني ابن جريج، قال أخبرني عمرو بن دينار، قال سمعت جابر بن عبد الله  رضى الله عنهما  قال لما بنيت الكعبة ذهب النبي صلى الله عليه وسلم وعباس ينقلان الحجارة فقال العباس للنبي صلى الله عليه وسلم اجعل إزارك على رقبتك‏.‏ فخر إلى الأرض، وطمحت عيناه إلى السماء فقال ‏\"‏ أرني إزاري ‏\"‏‏.‏ فشده عليه‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     When the Ka`ba was built, the Prophet and `Abbas went to bring stones (for its construction). Al `Abbas said to the Prophet, \"Take off your waist sheet and put it on your neck.\" (When the Prophet took it off) he fell on the ground with his eyes open towards the sky and said, \"Give me my waist sheet.\" And he covered himself with it.",
      "chain": [
        "30351",
        "20241",
        "11070",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "1643",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "وقال لي عمرو بن علي حدثنا أبو عاصم، قال ابن جريج أخبرنا قال أخبرني عطاء، إذ منع ابن هشام النساء الطواف مع الرجال قال كيف يمنعهن، وقد طاف نساء النبي صلى الله عليه وسلم مع الرجال قلت أبعد الحجاب أو قبل قال إي لعمري لقد أدركته بعد الحجاب‏.‏ قلت كيف يخالطن الرجال قال لم يكن يخالطن كانت عائشة  رضى الله عنها  تطوف حجرة من الرجال لا تخالطهم، فقالت امرأة انطلقي نستلم يا أم المؤمنين‏.‏ قالت ‏{‏انطلقي‏}‏ عنك‏.‏ وأبت‏.‏ ‏{‏وكن‏}‏ يخرجن متنكرات بالليل، فيطفن مع الرجال، ولكنهن كن إذا دخلن البيت قمن حتى يدخلن وأخرج الرجال، وكنت آتي عائشة أنا وعبيد بن عمير وهي مجاورة في جوف ثبير‏.‏ قلت وما حجابها قال هي في قبة تركية لها غشاء، وما بيننا وبينها غير ذلك، ورأيت عليها درعا موردا‏.‏",
      "text_en": " Ibn Juraij said, \" 'Ata informed us that when Ibn Hisham forbade women to perform Tawaf with men he said to him, 'How do you forbid them while the wives of the Prophet () used to perform Tawaf with the men ?' I said, 'Was this before decreeing of the use of the veil or after it ? 'Ata took an oath and said, 'I saw it after the order of veil.' I said, 'How did they mix with the men?' 'Ata said, 'The women never mixed with the men, and 'Aishah used to perform Tawaf separately and never mixed with men. Once it happened that 'Aishah was performing the Tawaf and woman said to her, 'O Mother of believers! Let us touch the Black stone.'  'Aishah said to her, 'Go yourself,' and she herself refused to do so. The wives of the Prophet () used to come out in night, in disguise and used to perform Tawaf with men. But whenever they intended to enter the Ka'bah, they would stay outside till the men had gone out. I and 'Ubaid bin 'Umair used to visit  'Aishah while she was residing at Jauf Thabir.\" I asked, \"What was her veil?\" 'Ata said, \"She was wearing and old turkish veil, and that was the only thing (weal) which was screen between us and her. I saw a pink cover on her.\"",
      "chain": [
        "30153",
        "20241",
        "11070"
      ]
    },
    {
      "hadith_no": "1646",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن سليمان الأحول، عن طاوس، عن ابن عباس  رضى الله عنهما  أن النبي صلى الله عليه وسلم رأى رجلا يطوف بالكعبة بزمام أو غيره فقطعه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet saw a man performing Tawaf of the Ka`ba tied with a string or something else. So the Prophet cut that string.",
      "chain": [
        "20241",
        "11070",
        "11247",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1711",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو عاصم الضحاك بن مخلد، أخبرنا ابن جريج، عن عطاء، عن ابن عباس  رضى الله عنهما  أن النبي صلى الله عليه وسلم أردف الفضل، فأخبر الفضل أنه لم يزل يلبي حتى رمى الجمرة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet made Al-Fadl ride behind him, and Al-Fadl informed that he (the Prophet ) kept on reciting Talbiya till he did the Rami of the Jamra. (Jamrat-Al-`Aqaba.)",
      "chain": [
        "20241",
        "11070",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "1757",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن الحسن بن مسلم، عن طاوس، عن ابن عباس، عن معاوية  رضى الله عنهم  قال قصرت عن رسول الله صلى الله عليه وسلم بمشقص‏.‏",
      "text_en": " Narrated Muawiya:                      I cut short the hair of Allah's Apostle with a long blade.",
      "chain": [
        "20241",
        "11070",
        "11557",
        "11053",
        "17",
        "27"
      ]
    },
    {
      "hadith_no": "1802",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا عمرو بن علي، حدثنا أبو عاصم، أخبرنا ابن جريج، قال عكرمة بن خالد سألت ابن عمر  رضى الله عنه  مثله‏.‏",
      "text_en": " Narrated `Ikrima bin Khalid:                     \"I asked Ibn `Umar the same (as above).",
      "chain": [
        "30153",
        "20241",
        "11070",
        "21944",
        "18"
      ]
    },
    {
      "hadith_no": "1805",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا أبو عاصم، أخبرنا ابن جريج، قال أخبرني عطاء، عن عروة بن الزبير، قال سألت عائشة  رضى الله عنها  قالت ما اعتمر رسول الله صلى الله عليه وسلم في رجب‏.‏",
      "text_en": " Narrated 'Ursa bin Az-Zubair:                     I asked `Aisha (whether the Prophet had performed `Umra in Rajab). She replied, \"Allah's Apostle never performed any `Umra in Rajab.\"",
      "chain": [
        "20241",
        "11070",
        "11029",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1884",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن ابن شهاب، عن سليمان بن يسار، عن ابن عباس، عن الفضل بن عباس  رضى الله عنهم  أن امرأة، ح‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A woman from the tribe of Khath'am came in the year (of ,Hajjat-al-Wada` of the Prophet ) and said, \"O Allah's Apostle! My father has come under Allah's obligation of performing Hajj but he is a very old man and cannot sit properly on his Mount. Will the obligation be fulfilled if I perform Hajj on his behalf?\" The Prophet replied in the affirmative.",
      "chain": [
        "20241",
        "11070",
        "11013",
        "11005",
        "17",
        "135"
      ]
    },
    {
      "hadith_no": "1899",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن يحيى بن أيوب، عن يزيد، عن أبي الخير، عن عقبة،، فذكر الحديث‏.‏   حدثنا إبراهيم بن موسى، أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني سعيد بن أبي أيوب، أن يزيد بن أبي حبيب، أخبره أن أبا الخير حدثه عن عقبة بن عامر، قال نذرت أختي أن تمشي، إلى بيت الله، وأمرتني أن أستفتي لها النبي صلى الله عليه وسلم فاستفتيته، فقال عليه السلام ‏\"‏ لتمش ولتركب ‏\"‏‏.‏ قال وكان أبو الخير لا يفارق عقبة‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     My sister vowed to go on foot to the Ka`ba, and she asked me to take the verdict of the Prophet about it. So, I did and the Prophet said, \"She should walk and also should ride.\"Narrated Abul-Khair from `Uqba as above.:",
      "chain": [
        "20241",
        "11070",
        "20379",
        "20304",
        "11410",
        "30309",
        "20467",
        "11070",
        "20375",
        "11411",
        "189"
      ]
    },
    {
      "hadith_no": "1910",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن يحيى بن عبد الله بن صيفي، عن عكرمة بن عبد الرحمن، عن أم سلمة  رضى الله عنها  أن النبي صلى الله عليه وسلم آلى من نسائه شهرا، فلما مضى تسعة وعشرون يوما غدا أو راح فقيل له إنك حلفت أن لا تدخل شهرا‏.‏ فقال ‏\"‏ إن الشهر يكون تسعة وعشرين يوما ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     The Prophet vowed to keep aloof from his wives for a period of one month, and after the completion of 29 days he went either in the morning or in the afternoon to his wives. Someone said to him \"You vowed that you would not go to your wives for one month.\" He replied, \"The month is of 29 days.\"",
      "chain": [
        "20241",
        "11070",
        "11448",
        "56"
      ]
    },
    {
      "hadith_no": "1924",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو عاصم، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع  رضى الله عنه  أن النبي صلى الله عليه وسلم بعث رجلا ينادي في الناس، يوم عاشوراء ‏\"‏ أن من أكل فليتم أو فليصم، ومن لم يأكل فلا يأكل ‏\"‏‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     Once the Prophet ordered a person on 'Ashura' (the tenth of Muharram) to announce, \"Whoever has eaten, should not eat any more, but fast, and who has not eaten should not eat, but complete his fast (till the end of the day).",
      "chain": [
        "20241",
        "11450",
        "237"
      ]
    },
    {
      "hadith_no": "1977",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عمرو بن علي، أخبرنا أبو عاصم، عن ابن جريج، سمعت عطاء، أن أبا العباس الشاعر، أخبره أنه، سمع عبد الله بن عمرو  رضى الله عنهما  بلغ النبي صلى الله عليه وسلم أني أسرد الصوم وأصلي الليل، فإما أرسل إلى، وإما لقيته، فقال ‏\"‏ ألم أخبر أنك تصوم ولا تفطر، وتصلي ولا تنام، فصم وأفطر، وقم ونم، فإن لعينك عليك حظا، وإن لنفسك وأهلك عليك حظا ‏\"‏‏.‏ قال إني لأقوى لذلك‏.‏ قال ‏\"‏ فصم صيام داود  عليه السلام  ‏\"‏‏.‏ قال وكيف قال ‏\"‏ كان يصوم يوما ويفطر يوما، ولا يفر إذا لاقى ‏\"‏‏.‏ قال من لي بهذه يا نبي الله قال عطاء لا أدري كيف ذكر صيام الأبد، قال النبي صلى الله عليه وسلم ‏\"‏ لا صام من صام الأبد ‏\"‏‏.‏ مرتين‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     The news of my daily fasting and praying every night throughout the night reached the Prophet. So he sent for me or I met him, and he said, \"I have been informed that you fast everyday and pray every night (all the night). Fast (for some days) and give up fasting (for some days); pray and sleep, for your eyes have a right on you, and your body and your family (i.e. wife) have a right on you.\" I replied, \"I have more power than that (fasting).\" The Prophet said, \"Then fast like the fasts of (the Prophet) David\". I said, \"How?\" He replied, \"He used to fast on alternate days, and he used not to flee on meeting the enemy.\" I said, \"From where can I get that chance?\" (`Ata' said, \"I do not know how the expression of fasting daily throughout the life occurred.\") So, the Prophet said, twice, \"Whoever fasts daily throughout his life is just as the one who does not fast at all.\"",
      "chain": [
        "30153",
        "20241",
        "11070",
        "11029",
        "29"
      ]
    },
    {
      "hadith_no": "1984",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن عبد الحميد بن جبير، عن محمد بن عباد، قال سألت جابرا  رضى الله عنه  نهى النبي صلى الله عليه وسلم عن صوم يوم الجمعة قال نعم‏.‏ زاد غير أبي عاصم أن ينفرد بصوم‏.‏",
      "text_en": " Narrated Muhammad bin `Abbas:                     I asked Jabir \"Did the Prophet forbid fasting on Fridays?\" He replied, \"Yes.\" (Other narrators added, \"If he intends to fast only that day.\")",
      "chain": [
        "20241",
        "11070",
        "11255",
        "30377",
        "34"
      ]
    },
    {
      "hadith_no": "2000",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو عاصم، عن عمر بن محمد، عن سالم، عن أبيه  رضى الله عنه  قال قال النبي صلى الله عليه وسلم يوم عاشوراء ‏\"‏ إن شاء صام ‏\"‏‏.‏",
      "text_en": " Narrated Salim's father:                     The Prophet said, \"Whoever wishes may fast on the day of 'Ashura'.\"",
      "chain": [
        "20241",
        "11530",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "2061",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، قال أخبرني عمرو بن دينار، عن أبي المنهال، قال كنت أتجر في الصرف، فسألت زيد بن أرقم  رضى الله عنه  فقال قال النبي صلى الله عليه وسلم‏.‏    وحدثني الفضل بن يعقوب، حدثنا الحجاج بن محمد، قال ابن جريج أخبرني عمرو بن دينار، وعامر بن مصعب، أنهما سمعا أبا المنهال، يقول سألت البراء بن عازب وزيد بن أرقم عن الصرف، فقالا كنا تاجرين على عهد رسول الله صلى الله عليه وسلم فسألنا رسول الله صلى الله عليه وسلم عن الصرف فقال ‏\"‏ إن كان يدا بيد فلا بأس، وإن كان نساء فلا يصلح ‏\"‏‏.‏",
      "text_en": " Narrated Abu Al-Minhal:                     I used to practice money exchange, and I asked Zaid bin 'Arqam about it, and he narrated what the Prophet said in the following: Abu Al-Minhal said, \"I asked Al-Bara' bin `Azib and Zaid bin Arqam about practicing money exchange. They replied, 'We were traders in the time of Allah's Apostle and I asked Allah's Apostle about money exchange. He replied, 'If it is from hand to hand, there is no harm in it; otherwise it is not permissible.\"",
      "chain": [
        "20241",
        "11070",
        "11081",
        "11290"
      ]
    },
    {
      "hadith_no": "2215",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا أبو عاصم، أخبرنا ابن جريج، قال أخبرني موسى بن عقبة، عن نافع، عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ خرج ثلاثة يمشون فأصابهم المطر، فدخلوا في غار في جبل، فانحطت عليهم صخرة‏.‏ قال فقال بعضهم لبعض ادعوا الله بأفضل عمل عملتموه‏.‏ فقال أحدهم اللهم، إني كان لي أبوان شيخان كبيران، فكنت أخرج فأرعى، ثم أجيء فأحلب، فأجيء بالحلاب فآتي به أبوى فيشربان، ثم أسقي الصبية وأهلي وامرأتي، فاحتبست ليلة‏.‏ فجئت فإذا هما نائمان  قال  فكرهت أن أوقظهما، والصبية يتضاغون عند رجلى، فلم يزل ذلك دأبي ودأبهما، حتى طلع الفجر اللهم إن كنت تعلم أني فعلت ذلك ابتغاء وجهك فافرج عنا فرجة نرى منها السماء‏.‏ قال ففرج عنهم‏.‏ وقال الآخر اللهم إن كنت تعلم أني كنت أحب امرأة من بنات عمي كأشد ما يحب الرجل النساء، فقالت لا تنال ذلك منها حتى تعطيها مائة دينار‏.‏ فسعيت فيها حتى جمعتها، فلما قعدت بين رجليها قالت اتق الله، ولا تفض الخاتم إلا بحقه‏.‏ فقمت وتركتها، فإن كنت تعلم أني فعلت ذلك ابتغاء وجهك فافرج عنا فرجة، قال ففرج عنهم الثلثين‏.‏ وقال الآخر اللهم إن كنت تعلم أني استأجرت أجيرا بفرق من ذرة فأعطيته، وأبى ذاك أن يأخذ، فعمدت إلى ذلك الفرق، فزرعته حتى اشتريت منه بقرا وراعيها، ثم جاء فقال يا عبد الله أعطني حقي‏.‏ فقلت انطلق إلى تلك البقر وراعيها، فإنها لك‏.‏ فقال أتستهزئ بي‏.‏ قال فقلت ما أستهزئ بك ولكنها لك‏.‏ اللهم إن كنت تعلم أني فعلت ذلك ابتغاء وجهك فافرج عنا‏.‏ فكشف عنهم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"While three persons were walking, rain began to fall and they had to enter a cave in a mountain. A big rock rolled over and blocked the mouth of the cave. They said to each other, 'Invoke Allah with the best deed you have performed (so Allah might remove the rock)'. One of them said, 'O Allah! My parents were old and I used to go out for grazing (my animals). On my return I would milk (the animals) and take the milk in a vessel to my parents to drink. After they had drunk from it, I would give it to my children, family and wife. One day I was delayed and on my return I found my parents sleeping, and I disliked to wake them up. The children were crying at my feet (because of hunger). That state of affairs continued till it was dawn. O Allah! If You regard that I did it for Your sake, then please remove this rock so that we may see the sky.' So, the rock was moved a bit. The second said, 'O Allah! You know that I was in love with a cousin of mine, like the deepest love a man may have for a woman, and she told me that I would not get my desire fulfilled unless I paid her one-hundred Dinars (gold pieces). So, I struggled for it till I gathered the desired amount, and when I sat in between her legs, she told me to be afraid of Allah, and asked me not to deflower her except rightfully (by marriage). So, I got up and left her. O Allah! If You regard that I did if for Your sake, kindly remove this rock.' So, two-thirds of the rock was removed. Then the third man said, 'O Allah! No doubt You know that once I employed a worker for one Faraq (three Sa's) of millet, and when I wanted to pay him, he refused to take it, so I sowed it and from its yield I bought cows and a shepherd. After a time that man came and demanded his money. I said to him: Go to those cows and the shepherd and take them for they are for you. He asked me whether I was joking with him. I told him that I was not joking with him, and all that belonged to him. O Allah! If You regard that I did it sincerely for Your sake, then please remove the rock.' So, the rock was removed completely from the mouth of the cave.\"",
      "chain": [
        "20184",
        "20241",
        "11070",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2295",
      "source": " Sahih Bukhari ",
      "chapter": "Kafalah - كتاب الكفالة",
      "chapter_no": "39",
      "text_ar": "حدثنا أبو عاصم، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع  رضى الله عنه  أن النبي صلى الله عليه وسلم أتي بجنازة، ليصلي عليها، فقال ‏\"‏ هل عليه من دين ‏\"‏‏.‏ قالوا لا‏.‏ فصلى عليه، ثم أتي بجنازة أخرى، فقال ‏\"‏ هل عليه من دين ‏\"‏‏.‏ قالوا نعم‏.‏ قال ‏\"‏ صلوا على صاحبكم ‏\"‏‏.‏ قال أبو قتادة على دينه يا رسول الله‏.‏ فصلى عليه‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     A dead person was brought to the Prophet so that he might lead the funeral prayer for him. He asked, \"Is he in debt?\" When the people replied in the negative, he led the funeral prayer. Another dead person was brought and he asked, \"Is he in debt?\" They said, \"Yes.\" He (refused to lead the prayer and) said, \"Lead the prayer of your friend.\" Abu Qatada said, \"O Allah's Apostle! I undertake to pay his debt.\" Allah's Apostle then led his funeral prayer.",
      "chain": [
        "20241",
        "11450",
        "237"
      ]
    },
    {
      "hadith_no": "2457",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن ابن أبي مليكة، عن عائشة  رضى الله عنها  عن النبي صلى الله عليه وسلم قال ‏\"‏ إن أبغض الرجال إلى الله الألد الخصم ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet said, \"The most hated person in the sight of Allah is the most quarrelsome person.\"",
      "chain": [
        "20241",
        "11070",
        "11090",
        "53"
      ]
    },
    {
      "hadith_no": "2477",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو عاصم الضحاك بن مخلد، عن يزيد بن أبي عبيد، عن سلمة بن الأكوع  رضى الله عنه  أن النبي صلى الله عليه وسلم رأى نيرانا توقد يوم خيبر‏.‏ قال ‏\"‏ على ما توقد هذه النيران ‏\"‏‏.‏ قالوا على الحمر الإنسية‏.‏ قال ‏\"‏ اكسروها، وأهرقوها ‏\"‏‏.‏ قالوا ألا نهريقها ونغسلها قال ‏\"‏ اغسلوا ‏\"‏‏.‏ قال أبو عبد الله كان ابن أبي أويس يقول الحمر الأنسية بنصب الألف والنون",
      "text_en": " Narrated Salama bin Al-Akwa`:                     On the day of Khaibar the Prophet saw fires being lighted. He asked, \"Why are these fires being lighted?\" The people replied that they were cooking the meat of donkeys. He said, \"Break the pots and throw away their contents.\" The people said, \"Shall we throw away their contents and wash the pots (rather than break them)?\" He said, \"Wash them.\"",
      "chain": [
        "20241",
        "11450",
        "237"
      ]
    },
    {
      "hadith_no": "2497",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا عمرو بن علي، حدثنا أبو عاصم، عن عثمان يعني ابن الأسود، قال أخبرني سليمان بن أبي مسلم، قال سألت أبا المنهال عن الصرف، يدا بيد فقال اشتريت أنا وشريك، لي شيئا يدا بيد ونسيئة، فجاءنا البراء بن عازب فسألناه، فقال فعلت أنا وشريكي زيد بن أرقم، وسألنا النبي صلى الله عليه وسلم عن ذلك فقال ‏\"‏ ما كان يدا بيد فخذوه، وما كان نسيئة فذروه ‏\"‏‏.‏",
      "text_en": " Narrated Sulaiman bin Abu Muslim:                     I asked Abu Minhal about money exchange from hand to hand. He said, \"I and a partner of mine bought something partly in cash and partly on credit.\" Al-Bara' bin `Azib passed by us and we asked about it. He replied, \"I and my partner Zaid bin Al-Arqam did the same and then went to the Prophet and asked him about it. He said, 'Take what was from hand to hand and leave what was on credit.' \"",
      "chain": [
        "30153",
        "20241",
        "20197",
        "11247",
        "11290"
      ]
    },
    {
      "hadith_no": "2590",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن ابن أبي مليكة، عن عباد بن عبد الله، عن أسماء  رضى الله عنها  قالت قلت يا رسول الله ما لي مال إلا ما أدخل على الزبير فأتصدق‏.‏ قال ‏\"‏ تصدقي، ولا توعي فيوعى عليك ‏\"‏‏.‏",
      "text_en": " Narrated Asma:                     Once I said, \"O Allah's Apostle! I have no property except what has been given to me by Az-Zubair (i.e. her husband). May I give in charity?\" The Prophet said, \"Give in charity and do not withhold it; otherwise Allah will withhold it back from you . \"",
      "chain": [
        "20241",
        "11070",
        "11090",
        "70"
      ]
    },
    {
      "hadith_no": "2659",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن ابن أبي مليكة، عن عقبة بن الحارث،‏.‏ وحدثنا علي بن عبد الله، حدثنا يحيى بن سعيد، عن ابن جريج، قال سمعت ابن أبي مليكة، قال حدثني عقبة بن الحارث، أو سمعته منه، أنه تزوج أم يحيى بنت أبي إهاب قال فجاءت أمة سوداء فقالت قد أرضعتكما‏.‏ فذكرت ذلك للنبي صلى الله عليه وسلم فأعرض عني، قال فتنحيت فذكرت ذلك له قال ‏\"‏ وكيف وقد زعمت أن قد أرضعتكما ‏\"‏‏.‏ فنهاه عنها‏.‏",
      "text_en": " Narrated `Uqba bin Al-Harith:                     That he had married Um Yahya bint Abu Ihab. He said. \"A black slave-lady came and said, 'I suckled you both.' I then mentioned that to the Prophet who turned his face aside.\" `Uqba further said, \"I went to the other side and told the Prophet about it. He said, 'How can you (keep her as your wife) when the lady has said that she suckled both of you (i.e. you and your wife?)\" So, the Prophet ordered him to divorce her.",
      "chain": [
        "20241",
        "11070",
        "11090",
        "30026",
        "20031",
        "11070",
        "11090",
        "872"
      ]
    },
    {
      "hadith_no": "2660",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا أبو عاصم، عن عمر بن سعيد، عن ابن أبي مليكة، عن عقبة بن الحارث، قال تزوجت امرأة فجاءت امرأة فقالت إني قد أرضعتكما‏.‏ فأتيت النبي صلى الله عليه وسلم فقال ‏\"‏ وكيف وقد قيل دعها عنك ‏\"‏ أو نحوه‏.‏",
      "text_en": " Narrated `Uqba bin Al-Harith:                     I married a woman and later on a woman came and said, \"I suckled you both.\" So, I went to the Prophet (to ask him about it). He said, \"How can you (keep her as a wife) when it has been said (that you were foster brother and sister)? Leave (divorce) her.",
      "chain": [
        "20241",
        "10652",
        "11090",
        "872"
      ]
    },
    {
      "hadith_no": "2773",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو عاصم، حدثنا ابن عون، عن نافع، عن ابن عمر، أن عمر، رضى الله عنه وجد مالا بخيبر، فأتى النبي صلى الله عليه وسلم فأخبره، قال ‏\"‏ إن شئت تصدقت بها ‏\"‏‏.‏ فتصدق بها في الفقراء والمساكين وذي القربى والضيف‏.‏",
      "text_en": " Narrated Ibn `Umar:                     `Umar got some property in Khaibar and he came to the Prophet and informed him about it. The Prophet said to him, \"If you wish you can give it in charity.\" So `Umar gave it in charity (i.e. as an endowment) the yield of which was to be used for the good of the poor, the needy, the kinsmen and the guests.",
      "chain": [
        "20241",
        "11071",
        "11014",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "2984",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عمرو بن علي، حدثنا أبو عاصم، حدثنا عثمان بن الأسود، حدثنا ابن أبي مليكة، عن عائشة  رضى الله عنها  أنها قالت يا رسول الله، يرجع أصحابك بأجر حج وعمرة، ولم أزد على الحج‏.‏ فقال لها ‏\"‏ اذهبي وليردفك عبد الرحمن ‏\"‏‏.‏ فأمر عبد الرحمن أن يعمرها من التنعيم، فانتظرها رسول الله صلى الله عليه وسلم بأعلى مكة حتى جاءت‏.‏",
      "text_en": " Narrated Aisha:                     That she said, \"O Allah's Apostle! Your companions are returning with the reward of both Hajj and `Umra, while I am returning with (the reward of) Hajj only.\" He said to her, \"Go, and let `Abdur- Rahman (i.e. your brother) make you sit behind him (on the animal).\" So, he ordered `AbdurRahman to let her perform `Umra from Al-Tan`im. Then the Prophet waited for her at the higher region of Mecca till she returned.",
      "chain": [
        "30153",
        "20241",
        "20197",
        "11090",
        "53"
      ]
    },
    {
      "hadith_no": "3070",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عمرو بن علي، حدثنا أبو عاصم، أخبرنا حنظلة بن أبي سفيان، أخبرنا سعيد بن ميناء، قال سمعت جابر بن عبد الله  رضى الله عنهما  قال قلت يا رسول الله، ذبحنا بهيمة لنا، وطحنت صاعا من شعير، فتعال أنت ونفر، فصاح النبي صلى الله عليه وسلم فقال ‏\"‏ يا أهل الخندق، إن جابرا قد صنع سؤرا، فحى هلا بكم ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     I said, \"O Allah's Apostle! We have slaughtered a young sheep of ours and have ground one Sa of barley. So, I invite you along with some persons.\" So, the Prophet said in a loud voice, \"O the people of the Trench! Jabir had prepared \"Sur\" so come along.\"",
      "chain": [
        "30153",
        "20241",
        "11243",
        "11510",
        "34"
      ]
    },
    {
      "hadith_no": "3088",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن ابن شهاب، عن عبد الرحمن بن عبد الله بن كعب، عن أبيه، وعمه، عبيد الله بن كعب عن كعب  رضى الله عنه  أن النبي صلى الله عليه وسلم كان إذا قدم من سفر ضحى دخل المسجد، فصلى ركعتين قبل أن يجلس‏.‏",
      "text_en": " Narrated Ka`b:                     Whenever the Prophet returned from a journey in the forenoon, he would enter the Mosque and offer two rak`at before sitting.",
      "chain": [
        "20241",
        "11070",
        "11013",
        "11519",
        "1131"
      ]
    },
    {
      "hadith_no": "3461",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا أبو عاصم الضحاك بن مخلد، أخبرنا الأوزاعي، حدثنا حسان بن عطية، عن أبي كبشة، عن عبد الله بن عمرو، أن النبي صلى الله عليه وسلم قال ‏\"‏ بلغوا عني ولو آية، وحدثوا عن بني إسرائيل ولا حرج، ومن كذب على متعمدا فليتبوأ مقعده من النار ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     The Prophet said, \"Convey (my teachings) to the people even if it were a single sentence, and tell others the stories of Bani Israel (which have been taught to you), for it is not sinful to do so. And whoever tells a lie on me intentionally, will surely take his place in the (Hell) Fire.\"",
      "chain": [
        "20241",
        "20024",
        "11413",
        "5371",
        "29"
      ]
    },
    {
      "hadith_no": "3582",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا أبو عاصم، عن عمر بن سعيد بن أبي حسين، عن ابن أبي مليكة، عن عقبة بن الحارث، قال صلى أبو بكر  رضى الله عنه  العصر، ثم خرج يمشي فرأى الحسن يلعب مع الصبيان، فحمله على عاتقه وقال بأبي شبيه بالنبي لا شبيه بعلي‏.‏ وعلي يضحك‏.‏",
      "text_en": " Narrated `Uqba bin Al-Harith:                     (Once) Abu Bakr offered the `Asr prayer and then went out walking and saw Al-Hasan playing with the boys. He lifted him on to his shoulders and said, \" Let my parents be sacrificed for your sake! (You) resemble the Prophet and not `Ali,\" while `Ali was smiling.",
      "chain": [
        "20241",
        "10652",
        "11090",
        "872"
      ]
    },
    {
      "hadith_no": "3638",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني عبد الله، حدثنا أبو عاصم، أخبرنا سعدان بن بشر، حدثنا أبو مجاهد، حدثنا محل بن خليفة، سمعت عديا، كنت عند النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Adi:                     as above (i.e. Hadith No. 793).",
      "chain": [
        "20025",
        "20241",
        "11651"
      ]
    },
    {
      "hadith_no": "4068",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن الزهري، عن عطاء بن يزيد، عن عبيد الله بن عدي، عن المقداد بن الأسود، حدثني إسحاق، حدثنا يعقوب بن إبراهيم بن سعد، حدثنا ابن أخي ابن شهاب، عن عمه، قال أخبرني عطاء بن يزيد الليثي، ثم الجندعي أن عبيد، الله بن عدي بن الخيار أخبره أن المقداد بن عمرو الكندي، وكان حليفا لبني زهرة، وكان ممن شهد بدرا مع رسول الله صلى الله عليه وسلم أخبره أنه قال لرسول الله صلى الله عليه وسلم أرأيت إن لقيت رجلا من الكفار فاقتتلنا، فضرب إحدى يدى بالسيف فقطعها، ثم لاذ مني بشجرة فقال أسلمت لله‏.‏ آأقتله يا رسول الله بعد أن قالها فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقتله ‏\"‏‏.‏ فقال يا رسول الله، إنه قطع إحدى يدى، ثم قال ذلك بعد ما قطعها‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقتله، فإن قتلته فإنه بمنزلتك قبل أن تقتله، وإنك بمنزلته قبل أن يقول كلمته التي قال ‏\"‏‏.‏",
      "text_en": " Narrated 'Ubaidullah bin `Adi bin Al-Khiyar:                     That Al-Miqdad bin `Amr Al-Kindi, who was an ally of Bani Zuhra and one of those who fought the battle of Badr together with Allah's Apostle told him that he said to Allah's Apostle, \"Suppose I met one of the infidels and we fought, and he struck one of my hands with his sword and cut it off and then took refuge in a tree and said, \"I surrender to Allah (i.e. I have become a Muslim),' could I kill him, O Allah's Apostle, after he had said this?\" Allah's Apostle said, \"You should not kill him.\" Al- Miqdad said, \"O Allah's Apostle! But he had cut off one of my two hands, and then he had uttered those words?\" Allah's Apostle replied, \"You should not kill him, for if you kill him, he would be in your position where you had been before killing him, and you would be in his position where he had been before uttering those words.\"",
      "chain": [
        "20241",
        "11070",
        "11013",
        "11206",
        "163",
        "30312",
        "20184",
        "20176",
        "11206",
        "880"
      ]
    },
    {
      "hadith_no": "4125",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عمرو بن علي، حدثنا أبو عاصم، حدثنا ابن جريج، عن عمرو بن دينار، عن عكرمة، عن ابن عباس، قال اشتد غضب الله على من قتله نبي، اشتد غضب الله على من دمى وجه رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Wrath gets severe on a person killed by a prophet, and Allah's Wrath became severe on him who had caused the face of Allah's Apostle to bleed.",
      "chain": [
        "30153",
        "20241",
        "11070",
        "11081",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4152",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عمرو بن علي، حدثنا أبو عاصم، أخبرنا حنظلة بن أبي سفيان، أخبرنا سعيد بن ميناء، قال سمعت جابر بن عبد الله  رضى الله عنهما  قال لما حفر الخندق رأيت بالنبي صلى الله عليه وسلم خمصا شديدا، فانكفأت إلى امرأتي فقلت هل عندك شىء فإني رأيت برسول الله صلى الله عليه وسلم خمصا شديدا‏.‏ فأخرجت إلى جرابا فيه صاع من شعير، ولنا بهيمة داجن فذبحتها، وطحنت الشعير ففرغت إلى فراغي، وقطعتها في برمتها، ثم وليت إلى رسول الله صلى الله عليه وسلم فقالت لا تفضحني برسول الله صلى الله عليه وسلم وبمن معه‏.‏ فجئته فساررته فقلت يا رسول الله ذبحنا بهيمة لنا وطحنا صاعا من شعير كان عندنا، فتعال أنت ونفر معك‏.‏ فصاح النبي صلى الله عليه وسلم فقال ‏\"‏ يا أهل الخندق، إن جابرا قد صنع سورا فحى هلا بكم ‏\"‏‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تنزلن برمتكم، ولا تخبزن عجينكم حتى أجيء ‏\"‏‏.‏ فجئت وجاء رسول الله صلى الله عليه وسلم يقدم الناس حتى جئت امرأتي، فقالت بك وبك‏.‏ فقلت قد فعلت الذي قلت‏.‏ فأخرجت له عجينا، فبصق فيه وبارك، ثم عمد إلى برمتنا فبصق وبارك ثم قال ‏\"‏ ادع خابزة فلتخبز معي واقدحي من برمتكم ولا تنزلوها‏\"‏، وهم ألف، فأقسم بالله لقد أكلوا حتى تركوه وانحرفوا، وإن برمتنا لتغط كما هي، وإن عجيننا ليخبز كما هو‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     When the Trench was dug, I saw the Prophet in the state of severe hunger. So I returned to my wife and said, \"Have you got anything (to eat), for I have seen Allah's Apostle in a state of severe hunger.\" She brought out for me, a bag containing one Sa of barley, and we had a domestic she animal (i.e. a kid) which I slaughtered then, and my wife ground the barley and she finished at the time I finished my job (i.e. slaughtering the kid). Then I cut the meat into pieces and put it in an earthenware (cooking) pot, and returned to Allah's Apostle . My wife said, \"Do not disgrace me in front of Allah's Apostle and those who are with him.\" So I went to him and said to him secretly, \"O Allah's Apostle! I have slaughtered a she-animal (i.e. kid) of ours, and we have ground a Sa of barley which was with us. So please come, you and another person along with you.\" The Prophet raised his voice and said, \"O people of Trench ! Jabir has prepared a meal so let us go.\" Allah's Apostle said to me, \"Don't put down your earthenware meat pot (from the fireplace) or bake your dough till I come.\" So I came (to my house) and Allah's Apostle too, came, proceeding before the people. When I came to my wife, she said, \"May Allah do so-and-so to you.\" I said, \"I have told the Prophet of what you said.\" Then she brought out to him (i.e. the Prophet the dough, and he spat in it and invoked for Allah's Blessings in it. Then he proceeded towards our earthenware meat-pot and spat in it and invoked for Allah's Blessings in it. Then he said (to my wife). Call a lady-baker to bake along with you and keep on taking out scoops from your earthenware meat-pot, and do not put it down from its fireplace.\" They were onethousand (who took their meals), and by Allah they all ate, and when they left the food and went away, our earthenware pot was still bubbling (full of meat) as if it had not decreased, and our dough was still being baked as if nothing had been taken from it.",
      "chain": [
        "30153",
        "20241",
        "11243",
        "11510",
        "34"
      ]
    },
    {
      "hadith_no": "4317",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو عاصم الضحاك بن مخلد، حدثنا يزيد، عن سلمة بن الأكوع  رضى الله عنه  قال غزوت مع النبي صلى الله عليه وسلم سبع غزوات، وغزوت مع ابن حارثة استعمله علينا‏.‏",
      "text_en": " Narrated Salama bin Al-Akwa`:                     I fought in nine Ghazwa-t along with the Prophet, I also fought along with Ibn Haritha when the Prophet made him our commander.",
      "chain": [
        "20241",
        "20472",
        "237"
      ]
    },
    {
      "hadith_no": "4358",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسحاق، حدثنا أبو عاصم، عن ابن جريج، قال أخبرني حسن بن مسلم، عن مجاهد، أن رسول الله قام يوم الفتح فقال ‏\"‏ إن الله حرم مكة يوم خلق السموات والأرض، فهى حرام بحرام الله إلى يوم القيامة، لم تحل لأحد قبلي، ولا تحل لأحد بعدي، ولم تحلل لي إلا ساعة من الدهر، لا ينفر صيدها، ولا يعضد شوكها، ولا يختلى خلاها ولا تحل لقطتها إلا لمنشد ‏\"‏‏.‏ فقال العباس بن عبد المطلب إلا الإذخر يا رسول الله، فإنه لا بد منه للقين والبيوت، فسكت ثم قال ‏\"‏ إلا الإذخر فإنه حلال ‏\"‏‏.‏ وعن ابن جريج أخبرني عبد الكريم عن عكرمة عن ابن عباس بمثل هذا أو نحو هذا‏.‏ رواه أبو هريرة عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Mujahid:                     Allah's Apostle got up on the day of the Conquest of Mecca and said, \"Allah has made Mecca a sanctuary since the day He created the Heavens and the Earth, and it will remain a sanctuary by virtue of the sanctity Allah has bestowed on it till the Day of Resurrection. It (i.e. fighting in it) was not made lawful to anyone before me!, nor will it be made lawful to anyone after me, and it was not made lawful for me except for a short period of time. Its game should not be chased, nor should its trees be cut, nor its vegetation or grass uprooted, not its Luqata (i.e. Most things) picked up except by one who makes a public announcement about it.\" Al-Abbas bin `Abdul Muttalib said, \"Except the Idhkhir, O Allah's Apostle, as it is indispensable for blacksmiths and houses.\" On that, the Prophet kept quiet and then said, \"Except the Idhkhir as it is lawful to cut.\"",
      "chain": [
        "30312",
        "20241",
        "11070",
        "11028"
      ]
    },
    {
      "hadith_no": "4429",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عمرو بن علي، حدثنا أبو عاصم، حدثنا سفيان، حدثنا أبو صخرة، جامع بن شداد حدثنا صفوان بن محرز المازني، حدثنا عمران بن حصين، قال جاءت بنو تميم إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ أبشروا يا بني تميم ‏\"‏‏.‏ قالوا أما إذ بشرتنا فأعطنا‏.‏ فتغير وجه رسول الله صلى الله عليه وسلم، فجاء ناس من أهل اليمن، فقال النبي صلى الله عليه وسلم ‏\"‏ اقبلوا البشرى إذ لم يقبلها بنو تميم ‏\"‏‏.‏ قالوا قد قبلنا يا رسول الله‏.‏",
      "text_en": " Narrated `Imran bin Husain:                     The people of Banu Tamim came to Allah's Apostle, and he said, \"Be glad (i.e. have good tidings). O Banu Tamim!\" They said, \"As you have given us good tidings then give us (some material things).\" On that the features of Allah's Apostle changed (i.e. he took it ill). Then some people from Yemen came, and the Prophet said (to them) \"Accept good tidings as Banu Tamim have not accepted them.\" They said, \"We accept them, O Allah's Apostle!\"",
      "chain": [
        "30153",
        "20241",
        "20012",
        "11328",
        "11693",
        "123"
      ]
    }
  ],
  "total_hadiths": 232
}