{
  "id": "20248",
  "name": "'Abdul Salam bin Harb bin Salm al-Mala'i عبد السلام بن حرب بن سلم النهدي الملائي",
  "full_name": "'Abdul Salam bin Harb bin Salm al-Mala'i عبد السلام بن حرب بن سلم النهدي الملائي",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "91",
      "date_gregorian": "NA",
      "date_display": [
        "91 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "187",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa",
      "Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة حافظ ]"
    ],
    "tags": [
      "al-Kufi",
      "Basri",
      "Hafiz"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "hadith_no": "5396",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا الفضل بن دكين، حدثنا عبد السلام بن حرب، عن هشام، عن حفصة، عن أم عطية، قالت قال النبي صلى الله عليه وسلم ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد فوق ثلاث، إلا على زوج، فإنها لا تكتحل ولا تلبس ثوبا مصبوغا إلا ثوب عصب ‏\"‏‏.‏",
      "text_en": " Narrated Um 'Atiyya:                     The Prophet said, \"It is not lawful for a lady who believes in Allah and the Last Day, to mourn for more than three days for a dead person, except for her husband, in which case she should neither put kohl in her eyes, nor perfume herself, nor wear dyed clothes, except a garment of 'Asb\" Um 'Atiyya added: The Prophet said, \"She should not use perfume except when she becomes clean from her menses whereupon she can use Qust, and Azfar (two kinds of incense).",
      "chain": [
        "20348",
        "20248",
        "20295",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "202",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يحيى بن معين، وهناد بن السري، وعثمان بن أبي شيبة، عن عبد السلام بن حرب، - وهذا لفظ حديث يحيى - عن أبي خالد الدالاني، عن قتادة، عن أبي العالية، عن ابن عباس، أن رسول الله صلى الله عليه وسلم كان يسجد وينام وينفخ ثم يقوم فيصلي ولا يتوضأ ‏.‏ قال فقلت له صليت ولم تتوضأ وقد نمت فقال ‏\"‏ إنما الوضوء على من نام مضطجعا ‏\"‏ ‏.‏ زاد عثمان وهناد ‏\"‏ فإنه إذا اضطجع استرخت مفاصله ‏\"‏ ‏.‏ قال أبو داود قوله ‏\"‏ الوضوء على من نام مضطجعا ‏\"‏ ‏.‏ هو حديث منكر لم يروه إلا يزيد أبو خالد الدالاني عن قتادة وروى أوله جماعة عن ابن عباس ولم يذكروا شيئا من هذا وقال كان النبي صلى الله عليه وسلم محفوظا وقالت عائشة - رضى الله عنها - قال النبي صلى الله عليه وسلم ‏\"‏ تنام عيناى ولا ينام قلبي ‏\"‏ ‏.‏ وقال شعبة إنما سمع قتادة من أبي العالية أربعة أحاديث حديث يونس بن متى وحديث ابن عمر في الصلاة وحديث القضاة ثلاثة وحديث ابن عباس حدثني رجال مرضيون منهم عمر وأرضاهم عندي عمر ‏.‏ قال أبو داود وذكرت حديث يزيد الدالاني لأحمد بن حنبل فانتهرني استعظاما له وقال ما ليزيد الدالاني يدخل على أصحاب قتادة ولم يعبأ بالحديث ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) used to prostrate and sleep (in prostration) and produce puffing sounds (during sleep). Then he would stand and pray and would not perform ablution. I said to him: you prayed but did not perform ablution though you slept (in prostration). He replied: Ablution is necessary for one who sleeps while he is lying down. Uthman and Hannad added: For when he lies down, his joints are relaxed.Abu Dawud said: The statement \"ablution is necessary for one who sleeps while one is lying down\" is a munkar (rejected) tradition. It has been narrated only by Yazid Abu Khalid al-Dalani, on the authority of Qatadah. And its earlier part has been narrated by a group (of narrators) from Ibn 'Abbas; they did not mention anything about it. He (Ibn 'Abbas) said: The Prophet (ﷺ) was protected (during his sleep). 'Aishah reported: The Prophet (ﷺ) said: My eyes sleep, but my heart does not sleep. Shu'bah said: Qatadah heard from Abu'l-'Aliyah only four traditions: the tradition about Jonah son of Matthew, the tradition reported by Ibn 'Umar about prayer, the tradition stating that the judges are three, and the tradition narrated by Ibn 'Abbas saying: (This tradition) has been narrated to me by reliable persons ; 'Umar is one of them, and the most reliable of them in my opinion is 'Umar. Abu Dawud said: I asked Ahmad b. Hanbal about the tradition narrated by Yazid al-Dalani. He rebuked me out of respect for him. Then he said: Yazid al-Dalani does not add anything to what has been narrated by the teachers of Qatadah. He did not care of this tradition (due to its weakness).",
      "chain": [
        "30020",
        "30480",
        "30203",
        "20248",
        "20728",
        "11019",
        "11618",
        "17"
      ]
    },
    {
      "hadith_no": "776",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حسين بن عيسى، حدثنا طلق بن غنام، حدثنا عبد السلام بن حرب الملائي، عن بديل بن ميسرة، عن أبي الجوزاء، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا استفتح الصلاة قال ‏\"‏ سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدك ولا إله غيرك ‏\"‏ ‏.‏ قال أبو داود وهذا الحديث ليس بالمشهور عن عبد السلام بن حرب لم يروه إلا طلق بن غنام وقد روى قصة الصلاة عن بديل جماعة لم يذكروا فيه شيئا من هذا ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     When the Messenger of Allah (ﷺ) began his prayer, he said: \"Glory be to Thee, O Allah,\" and \"Praise be to Thee\" and \"Blessed is Thy name, and Exalted is Thy greatness, sand there is no god but Allah.\"Abu Dawud said: This tradition is not well known from 'Abd al-Salam b. Harb. No one narrated this except Talq b. Ghannam. A group of narrators reported the description of prayer from (the narrator) Budail; they did not mention therein this supplication.",
      "chain": [
        "30326",
        "30197",
        "20248",
        "10672",
        "11265",
        "53"
      ]
    },
    {
      "hadith_no": "1686",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن سوار المصري، حدثنا عبد السلام بن حرب، عن يونس بن عبيد، عن زياد بن جبير، عن سعد، قال لما بايع رسول الله صلى الله عليه وسلم النساء قامت امرأة جليلة كأنها من نساء مضر فقالت يا نبي الله إنا كل على آبائنا وأبنائنا - قال أبو داود وأرى فيه وأزواجنا - فما يحل لنا من أموالهم فقال ‏\"‏ الرطب تأكلنه وتهدينه ‏\"‏ ‏.‏ قال أبو داود الرطب الخبز والبقل والرطب ‏.‏ قال أبو داود وكذا رواه الثوري عن يونس ‏.‏",
      "text_en": " Sa’d said When the Messenger of Allah (SWAS) took the oath of allegiance from woman, a woman of high rank, who seemed to be one of the women of Mudar, rose and said Prophet of Allah (SWAS), we are dependant on our parents, our sons.  (Abu Dawud said I think (this version) has the word “ and our husbands”. )  So what part of their property can be spent lawfully?  He said Fresh food which you eat and give as a present.  Abu Dawud said The Arabic word ratb means bread, vegetables and fresh dates.  Abu Dawud said Al-Thawri transmitted from Yunus in a similar manner.",
      "chain": [
        "35127",
        "20248",
        "11075",
        "11285",
        "9"
      ]
    },
    {
      "hadith_no": "2211",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن إبراهيم البزاز، حدثنا أبو نعيم، حدثنا عبد السلام، - يعني ابن حرب - عن خالد الحذاء، عن أبي تميمة، عن رجل، من قومه أنه سمع النبي صلى الله عليه وسلم سمع رجلا، يقول لامرأته ‏\"‏ يا أخية ‏\"‏ ‏.‏ فنهاه ‏.‏ قال أبو داود ورواه عبد العزيز بن المختار عن خالد عن أبي عثمان عن أبي تميمة عن النبي صلى الله عليه وسلم ورواه شعبة عن خالد عن رجل عن أبي تميمة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Tamimah reported from a man of his tribe “The Prophet (ﷺ) heard a man say his wife “O my younger sister! So he prohibited him (addressing his wife in this manner)Abu Dawud said “This tradition has also been transmitted by ‘Abd Al Aziz bin Al Mukhtar from Khalid from Abu ‘Uthman from Abu Thamimah from the Prophet (ﷺ). This has also been narrated by Shu’bah from Khalid from a man on the authority of Abu Thamimah from the Prophet (ﷺ).",
      "chain": [
        "11213",
        "20348",
        "20248",
        "11282"
      ]
    },
    {
      "hadith_no": "2472",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، ومحمد بن عيسى، قالا حدثنا عبد السلام بن حرب، أخبرنا الليث بن أبي سليم، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، - قال النفيلي - قالت كان النبي صلى الله عليه وسلم يمر بالمريض وهو معتكف فيمر كما هو ولا يعرج يسأل عنه ‏.‏ وقال ابن عيسى قالت إن كان النبي صلى الله عليه وسلم يعود المريض وهو معتكف ‏.‏",
      "text_en": " According to the version of Al Nufaili, A’ishah said “The Prophet (ﷺ) used to pass by a patient while he was observing I’tikaf(in the mosque) but he passed as usual and did not stay asking about him.”According to the version of Ibn Isa she said “The Prophet (ﷺ) would visit a patient while he was observing I’tikaf.”",
      "chain": [
        "30352",
        "31167",
        "20248",
        "10957",
        "10530",
        "10535",
        "53",
        "30352"
      ]
    },
    {
      "hadith_no": "2696",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عثمان بن أبي شيبة، قال حدثنا إسحاق بن منصور، حدثنا عبد السلام بن حرب، عن يزيد بن عبد الرحمن، عن الحكم، عن ميمون بن أبي شبيب، عن علي، أنه فرق بين جارية وولدها فنهاه النبي صلى الله عليه وسلم عن ذلك ورد البيع ‏.‏ قال أبو داود وميمون لم يدرك عليا قتل بالجماجم والجماجم سنة ثلاث وثمانين ‏.‏ قال أبو داود والحرة سنة ثلاث وستين وقتل ابن الزبير سنة ثلاث وسبعين ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     Ali separated between a slave-girl and her child. The Prophet (ﷺ) prohibited it and made the sale transactions withdrawn.Abu Dawud said: The narrator Maimun (b. Abi Shaib) did not meet 'Ali. He (Maimun) was killed in the battle of Jamajim in 83 A.H.Abu Dawud said: The battle of Harrah took place in 63 A.H., and Ibn al-Zubair was killed in 73 A.H.",
      "chain": [
        "30203",
        "30313",
        "20248",
        "11069",
        "10834",
        "5"
      ]
    },
    {
      "hadith_no": "3756",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا هناد بن السري، عن عبد السلام بن حرب، عن أبي خالد الدالاني، عن أبي العلاء الأودي، عن حميد بن عبد الرحمن الحميري، عن رجل، من أصحاب النبي صلى الله عليه وسلم أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا اجتمع الداعيان فأجب أقربهما بابا فإن أقربهما بابا أقربهما جوارا وإن سبق أحدهما فأجب الذي سبق ‏\"‏ ‏.‏",
      "text_en": " Narrated AbdurRahman al-Himyari:                     A companion of the Prophet (ﷺ) reported him as saying: When two people come together to issue an invitation, accept that of the one whose door is nearer in neighbourhood, but if one of them comes before the other accept the invitation of the one who comes first.",
      "chain": [
        "30480",
        "20248",
        "20728",
        "11280"
      ]
    },
    {
      "hadith_no": "4652",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا هناد بن السري، عن عبد الرحمن بن محمد المحاربي، عن عبد السلام بن حرب، عن أبي خالد الدالاني، عن أبي خالد، مولى آل جعدة عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أتاني جبريل فأخذ بيدي فأراني باب الجنة الذي تدخل منه أمتي ‏\"‏ ‏.‏ فقال أبو بكر يا رسول الله وددت أني كنت معك حتى أنظر إليه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما إنك يا أبا بكر أول من يدخل الجنة من أمتي ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Gabriel came and taking me by the hand showed the gate of Paradise by which my people will enter. AbuBakr then said: Messenger of Allah! I wish I had been with you so that I might have looked at it. The Messenger of Allah (ﷺ) then said: You, AbuBakr, will be the first of my people to enter Paradise.",
      "chain": [
        "30480",
        "20333",
        "20248",
        "20728",
        "13"
      ]
    },
    {
      "hadith_no": "5036",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا مالك بن إسماعيل، حدثنا عبد السلام بن حرب، عن يزيد بن عبد الرحمن، عن يحيى بن إسحاق بن عبد الله بن أبي طلحة، عن أمه، حميدة أو عبيدة بنت عبيد بن رفاعة الزرقي عن أبيها، عن النبي صلى الله عليه وسلم قال ‏\"‏ تشمت العاطس ثلاثا فإن شئت أن تشمته فشمته وإن شئت فكف ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubayd ibn Rifa'ah az-Zuraqi:                     The Prophet (ﷺ) said: Invoke a blessing on one who sneezes three times; (and if he sneezes more often), then if you wish to invoke a blessing on him, you may invoke, and if you wish (to stop), then stop.",
      "chain": [
        "30524",
        "20357",
        "20248",
        "30525"
      ]
    },
    {
      "hadith_no": "14",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد السلام بن حرب الملائي، عن الأعمش، عن أنس، قال كان النبي صلى الله عليه وسلم إذا أراد الحاجة لم يرفع ثوبه حتى يدنو من الأرض ‏.‏ قال أبو عيسى هكذا روى محمد بن ربيعة عن الأعمش عن أنس هذا الحديث ‏.‏ وروى وكيع وأبو يحيى الحماني عن الأعمش قال قال ابن عمر كان النبي صلى الله عليه وسلم إذا أراد الحاجة لم يرفع ثوبه حتى يدنو من الأرض ‏.‏ وكلا الحديثين مرسل ‏.‏ ويقال لم يسمع الأعمش من أنس ولا من أحد من أصحاب النبي صلى الله عليه وسلم وقد نظر إلى أنس بن مالك قال رأيته يصلي ‏.‏ فذكر عنه حكاية في الصلاة ‏.‏ والأعمش اسمه سليمان بن مهران أبو محمد الكاهلي وهو مولى لهم ‏.‏ قال الأعمش كان أبي حميلا فورثه مسروق ‏.‏",
      "text_en": " Anas, may Allah Most High be pleased with him, said:                     \"When the Prophet  wanted to relieve  himself, he would not raise his garment until he was close to the ground.\"",
      "chain": [
        "30367",
        "20248",
        "11060",
        "19"
      ]
    },
    {
      "hadith_no": "77",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا إسماعيل بن موسى، - كوفي - وهناد ومحمد بن عبيد المحاربي المعنى واحد قالوا حدثنا عبد السلام بن حرب الملائي، عن أبي خالد الدالاني، عن قتادة، عن أبي العالية، عن ابن عباس، أنه رأى النبي صلى الله عليه وسلم نام وهو ساجد حتى غط أو نفخ ثم قام يصلي ‏.‏ فقلت يا رسول الله إنك قد نمت قال ‏\"‏ إن الوضوء لا يجب إلا على من نام مضطجعا فإنه إذا اضطجع استرخت مفاصله ‏\"‏ ‏.‏ قال أبو عيسى وأبو خالد اسمه يزيد بن عبد الرحمن ‏.‏ قال وفي الباب عن عائشة وابن مسعود وأبي هريرة ‏.‏",
      "text_en": " Ibn Abbas narrated that :                     he saw the Prophet sleeping, while in the prostration position, until he snored or snorted. Then he stoodup to pray. So I said: \"O Messenger of Allah! You were sleeping?\" He said: \"Wudu is not required except for sleeping while reclining. For when one reclines, joints relax.\"",
      "chain": [
        "35016",
        "20248",
        "20728",
        "11019",
        "11618",
        "17"
      ]
    },
    {
      "hadith_no": "622",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن عبيد المحاربي، وأبو سعيد الأشج قالا حدثنا عبد السلام بن حرب، عن خصيف، عن أبي عبيدة، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ في ثلاثين من البقر تبيع أو تبيعة وفي أربعين مسنة ‏\"‏ ‏.‏ وفي الباب عن معاذ بن جبل ‏.‏ قال أبو عيسى هكذا رواه عبد السلام بن حرب عن خصيف وعبد السلام ثقة حافظ ‏.‏ وروى شريك هذا الحديث عن خصيف عن أبي عبيدة عن أمه عن عبد الله ‏.‏ وأبو عبيدة بن عبد الله لم يسمع من عبد الله ‏.‏",
      "text_en": " Abdullah bin Mas'ud narrated that :                     the Prophet said: \"A Tabi or a Tabi'ah (is due) on thirty cows, and a Musinnah (is due) on every forty.\"",
      "chain": [
        "35135",
        "30200",
        "20248",
        "19908",
        "10",
        "16"
      ]
    },
    {
      "hadith_no": "819",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد السلام بن حرب، عن خصيف، عن سعيد بن جبير، عن ابن عباس، أن النبي صلى الله عليه وسلم أهل في دبر الصلاة ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرف أحدا رواه غير عبد السلام بن حرب ‏.‏ وهو الذي يستحبه أهل العلم أن يحرم الرجل في دبر الصلاة ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Prophet started the Talbiyah after the Salat.\"",
      "chain": [
        "30367",
        "20248",
        "19908",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2968",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا القاسم بن دينار الكوفي، حدثنا إسحاق بن منصور السلولي الكوفي، عن عبد السلام بن حرب، عن يزيد بن عبد الرحمن أبي خالد الدالاني، عن عمر بن إسحاق بن أبي طلحة، عن أمه، عن أبيها، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يشمت العاطس ثلاثا فإن زاد فإن شئت فشمته وإن شئت فلا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب وإسناده مجهول ‏.‏",
      "text_en": " Narrated 'Umar bin Ishaq bin Abi Talhah:                     from his mother, from her father, who said: \"The Messenger of Allah (ﷺ) said: 'Reply three times to the sneezing person. If he (sneezes) more, then if you wish reply and if you do not then do not.'\"",
      "chain": [
        "30313",
        "20248",
        "11895"
      ]
    },
    {
      "hadith_no": "3378",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الحسين بن يزيد الكوفي، حدثنا عبد السلام بن حرب، عن غطيف بن أعين، عن مصعب بن سعد، عن عدي بن حاتم، قال أتيت النبي صلى الله عليه وسلم وفي عنقي صليب من ذهب ‏.‏ فقال ‏\"‏ يا عدي اطرح عنك هذا الوثن ‏\"‏ ‏.‏ وسمعته يقرأ في سورة براءة ‏:‏ ‏(‏ اتخذوا أحبارهم ورهبانهم أربابا من دون الله ‏)‏ قال ‏\"‏ أما إنهم لم يكونوا يعبدونهم ولكنهم كانوا إذا أحلوا لهم شيئا استحلوه وإذا حرموا عليهم شيئا حرموه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث عبد السلام بن حرب ‏.‏ وغطيف بن أعين ليس بمعروف في الحديث ‏.‏",
      "text_en": " Narrated 'Adi bin Hatim:                     \"I came to the Prophet (ﷺ) while I had a cross of gold around my neck. He said: 'O 'Adi! Remove this idol from yourself!' And I heard him reciting from Surah Bara'ah: They took their rabbis and monks as lords besides Allah (9:31). He said: 'As for them, they did not worship them, but when they made something lawful for them, they considered it lawful, and when they made something unlawful for them, they considered it unlawful.'\"",
      "chain": [
        "30190",
        "20248",
        "28477",
        "10556",
        "212"
      ]
    },
    {
      "hadith_no": "3969",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا الحسين بن يزيد الكوفي، حدثنا عبد السلام بن حرب، عن ليث، عن الربيع بن أنس، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنا أول الناس خروجا إذا بعثوا وأنا خطيبهم إذا وفدوا وأنا مبشرهم إذا أيسوا لواء الحمد يومئذ بيدي وأنا أكرم ولد آدم على ربي ولا فخر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     that the Messenger of Allah (ﷺ) said: \"I am the first of the people to appear upon their being resurrected, and I am their spokesman whenever they gather, and I am the one that gives them glad tidings whenever they give up hope. And the Banner of Praise will be in my hand that day, and I am the most noble of the children of Adam with my Lord, and I am not boasting.\"",
      "chain": [
        "30190",
        "20248",
        "20023",
        "19844",
        "19"
      ]
    },
    {
      "hadith_no": "3970",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا الحسين بن يزيد، حدثنا عبد السلام بن حرب، عن يزيد أبي خالد، عن المنهال بن عمرو، عن عبد الله بن الحارث، عن أبي هريرة، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أنا أول من تنشق عنه الأرض فأكسى الحلة من حلل الجنة ثم أقوم عن يمين العرش ليس أحد من الخلائق يقوم ذلك المقام غيري ‏\"‏ ‏.‏ قال هذا حديث حسن غريب صحيح ‏.‏",
      "text_en": " Narrated Abu Hurairah [may Allah be pleased with him]:                     that the Messenger of Allah (ﷺ) said: \"I am the first for whom the earth will be split, and then I will be adorned with garments from the garments of Paradise. Then I will stand at the right of the Throne. No one from the creation will in that place other than I.\"",
      "chain": [
        "20248",
        "11656",
        "912",
        "13"
      ]
    },
    {
      "hadith_no": "4096",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا القاسم بن دينار الكوفي، حدثنا أبو نعيم، عن عبد السلام بن حرب، عن يحيى بن سعيد، عن سعيد بن المسيب، عن سعد بن أبي وقاص، أن النبي صلى الله عليه وسلم قال لعلي ‏\"‏ أنت مني بمنزلة هارون من موسى إلا أنه لا نبي بعدي ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ وقد روي من غير وجه عن سعد عن النبي صلى الله عليه وسلم ويستغرب هذا الحديث من حديث يحيى بن سعيد الأنصاري ‏.‏",
      "text_en": " Narrated Sa'd bin Abi Waqqas:                     that the Prophet (ﷺ) said to 'Ali, \"You are to me, in the position that Harun was to Musa, [except that there is no Prophet after me].\"",
      "chain": [
        "20348",
        "20248",
        "11062",
        "11002",
        "9"
      ]
    },
    {
      "hadith_no": "4248",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا حسين بن يزيد الكوفي، حدثنا عبد السلام بن حرب، عن أبي الجحاف، عن جميع بن عمير التيمي، قال دخلت مع عمتي على عائشة فسئلت أى الناس كان أحب إلى رسول الله صلى الله عليه وسلم قالت فاطمة ‏.‏ فقيل من الرجال قالت زوجها إن كان ما علمت صواما قواما ‏.‏ هذا حديث حسن غريب ‏.‏ قال وأبو الجحاف اسمه داود بن أبي عوف ويروى عن سفيان الثوري حدثنا أبو الجحاف وكان مرضيا ‏.‏",
      "text_en": " Narrated Jumai' bin 'Umair At-Taimi:                     \"I entered along with my uncle upon 'Aishah and she was asked: 'Who among people was the most beloved to the Messenger of Allah (ﷺ)?' She said: 'Fatimah.' So it was said: 'From the men?' She said: 'Her husband, as I knew him to fast much and stand in prayer much.'\"",
      "chain": [
        "20248",
        "18265",
        "19864"
      ]
    },
    {
      "hadith_no": "487",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "قال القطان حدثنا أبو حاتم، حدثنا عبد المؤمن بن علي، حدثنا عبد السلام بن حرب، عن هشام بن عروة، عن أبيه، عن عائشة، قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ويل للأعقاب من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     The Messenger of Allah said: 'Woe to the heels because of Hell-fire.'\"",
      "chain": [
        "20031",
        "38473",
        "20248",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "520",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا عبد السلام بن حرب، عن إسحاق بن أبي فروة، عن الزهري، عن عبد الله بن عبد القاري، عن أبي أيوب، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ من مس فرجه فليتوضأ ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Ayyub said:                     \"I heard the Messenger of Allah say: 'Whoever touches his sexual organ, let him perform ablution.'\"",
      "chain": [
        "35047",
        "20248",
        "12009",
        "11013",
        "3196",
        "33"
      ]
    },
    {
      "hadith_no": "1876",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا عبد السلام بن حرب، عن خصيف، عن أبي عبيدة، عن عبد الله، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ في ثلاثين من البقر تبيع أو تبيعة وفي أربعين مسنة ‏\"‏ ‏.‏",
      "text_en": " Abdullah narrated that:                     the Prophet said: “For every thirty cattle, Tabi or Tabi'ah and for every forty a Musinnah.”",
      "chain": [
        "35047",
        "20248",
        "19908",
        "10",
        "16"
      ]
    },
    {
      "hadith_no": "1879",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أحمد بن عثمان بن حكيم الأودي، حدثنا أبو نعيم، حدثنا عبد السلام بن حرب، عن يزيد بن عبد الرحمن، عن أبي هند، عن نافع، عن ابن عمر، عن النبي  صلى الله عليه وسلم  ‏\"‏ في أربعين شاة شاة إلى عشرين ومائة فإذا زادت واحدة ففيها شاتان إلى مائتين فإذا زادت واحدة ففيها ثلاث شياه إلى ثلاثمائة فإذا زادت ففي كل مائة شاة لا يفرق بين مجتمع ولا يجمع بين متفرق خشية الصدقة وكل خليطين يتراجعان بالسوية وليس للمصدق هرمة ولا ذات عوار ولا تيس إلا أن يشاء المصدق ‏\"‏ ‏.‏",
      "text_en": " Ibn Umar narrated that:                     the Messenger of Allah said: “For forty sheep, one sheep up to one hundred and twenty. If there is one more. Then two sheep, up to two hundred. If there is one more, then three sheep, up to three hundred. If there are more than that, then for every hundred one sheep. Do not separate combined flock and do not combine separate flocks for fear of Sadaqah. Each partner (who has a share in the flock) should pay in proportion to his shares. And the Zakat collector should not accept any decrepit or defective animal, nor any male goat, unless he wishes to.”",
      "chain": [
        "30185",
        "20348",
        "20248",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2026",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد السلام بن حرب، عن إسحاق بن عبد الله بن أبي فروة، عن أبي وهب الجيشاني، عن أبي خراش الرعيني، عن الديلمي، قال قدمت على رسول الله  صلى الله عليه وسلم  وعندي أختان تزوجتهما في الجاهلية ‏.‏ فقال ‏\"‏ إذا رجعت فطلق إحداهما ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Dailami said:                     “I came to the Messenger of  Allah, and I was married to two sisters whom I had married during the Ignorance period. He said: 'When you go back, divorce one of them.' ”",
      "chain": [
        "30201",
        "20248",
        "12009"
      ]
    },
    {
      "hadith_no": "2649",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد السلام بن حرب، عن هشام بن حسان، عن الحسن، عن سلمة بن المحبق، أن رسول الله صلى الله عليه وسلم رفع إليه رجل وطئ جارية امرأته فلم يحده ‏.‏",
      "text_en": " It was narrated from Salamah bin Muhabbiq that:                     the case of a man who had intercourse with the slave woman of his wife was referred to the Messenger of Allah (ﷺ), and he did not stipulate any legal punishment for him.",
      "chain": [
        "30201",
        "20248",
        "11311",
        "11016",
        "5071"
      ]
    }
  ],
  "total_hadiths": 26
}