{
  "id": "20256",
  "name": "'Abdul Wahid bin Ziyad عبد الواحد بن زياد العبدي",
  "full_name": "'Abdul Wahid bin Ziyad عبد الواحد بن زياد العبدي",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "176",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-'Abdi",
      "Client",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11352",
      "name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10766",
      "name": "Sa'd bin Tariq, Abu Malik سعد بن طارق بن أشيم أبو مالك الأشجعي",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11621",
      "name": "Ayoub bin Aa'idh أيوب بن عائذ",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10742",
      "name": "Isma'il bin Smy' إسماعيل بن سميع",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10755",
      "name": "al-Hasan bin 'Ubaidullah الحسن بن عبيد الله بن عروة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "14069",
      "name": "Habib bin Abi Fadalan/Fadala حبيب بن أبي فضلان/ فضالة المالكي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11286",
      "name": "Sa'id bin Iyas al-Jariri سعيد بن إياس الجريري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11431",
      "name": "Salah bin Salah bin Hay صالح بن صالح بن حي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11863",
      "name": "Talha bin Yahya bin Talha طلحة بن يحيى بن طلحة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10931",
      "name": "'Abdullah bin 'Abdullah bin al-Asm عبد الله بن عبد الله بن الأصم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20342",
      "name": "'Utba bin 'Abdullah bin 'Utba عتبة بن عبد الله بن عتبة أبو العميس",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "19476",
      "name": "al-Rbab Jd'h 'Uthman bin الرباب جدة عثمان",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11379",
      "name": "'Ammara bin al-Q'aqa' bin Shabrma عمارة بن القعقاع بن شبرمة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11439",
      "name": "'Amr bin Maymun bin Mahran عمرو بن ميمون بن مهران الجزري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11647",
      "name": "al-'Ala' bin al-Msyb bin Rafa'i العلاء بن المسيب بن رافع",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11534",
      "name": "Klyb bin Wa'il كليب بن وائل",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10613",
      "name": "Muhammad bin Abi Isma'il محمد بن أبي إسماعيل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11653",
      "name": "Muslim bin Salm al-Nahdi, Abu Farwa مسلم بن سالم النهدي أبو فروة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10845",
      "name": "Yazid bin Kysan al-Yshkry يزيد بن كيسان اليشكري أبو إسماعيل",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20115",
      "name": "Ma'mar bin Rashid معمر بن راشد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30106",
      "name": "'Affan bin Muslim عفان بن مسلم بن عبد الله الصفار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20283",
      "name": "Muhammad bin al-Fadl 'Aram محمد بن الفضل السدوسي أبو النعمان عارم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30457",
      "name": "Ma'la bin Asad al-'Ami معلى بن أسد العمي أبو الهيثم البصري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20393",
      "name": "Yonus bin Muhammad bin Muslim يونس بن محمد بن مسلم المؤدب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20040",
      "name": "Musa bin Isma'il al-Munqari al-Tabudhaki موسى بن إسماعيل المنقري - لتبوذكي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30158",
      "name": "Qays bin Hafs قيس بن حفص",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30129",
      "name": "Harmy bin Hafs bin 'Umar حرمي بن حفص",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30145",
      "name": "'Abdullah bin Muhammad bin Abi al-Aswad عبد الله بن محمد بن أبي الأسود",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30399",
      "name": "Yahya bin Yahya bin Bukayr يحيى بن يحيى بن بكير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30189",
      "name": "al-Hasan bin al-Rabi' al-Bajli الحسن بن الربيع",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30559",
      "name": "Fdyl bin Husayn bin Talha فضيل بن حسين بن طلحة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30450",
      "name": "Ibn Abi al-Shuwarab محمد بن عبد الملك بن أبي الشوارب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36523",
      "name": "Ishaq bin Abi Isra'il Kamjar إسحاق بن أبي إسرائيل كامجر",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "36",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا حرمي بن حفص، قال حدثنا عبد الواحد، قال حدثنا عمارة، قال حدثنا أبو زرعة بن عمرو بن جرير، قال سمعت أبا هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ انتدب الله لمن خرج في سبيله لا يخرجه إلا إيمان بي وتصديق برسلي أن أرجعه بما نال من أجر أو غنيمة، أو أدخله الجنة، ولولا أن أشق على أمتي ما قعدت خلف سرية، ولوددت أني أقتل في سبيل الله ثم أحيا، ثم أقتل ثم أحيا، ثم أقتل ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          The Prophet said, \"The person who participates in (Holy battles) in      Allah's cause and nothing compels him to do so except belief in Allah      and His Apostles, will be recompensed by Allah either with a reward,      or booty (if he survives) or will be admitted to Paradise (if he is      killed in the battle as a martyr). Had I not found it difficult for my     followers, then I would not remain behind any sariya going for Jihad      and I would have loved to be martyred in Allah's cause and then made      alive, and then martyred and then made alive, and then again martyred      in His cause.\"",
      "chain": [
        "30129",
        "20256",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "125",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا قيس بن حفص، قال حدثنا عبد الواحد، قال حدثنا الأعمش، سليمان عن إبراهيم، عن علقمة، عن عبد الله، قال بينا أنا أمشي، مع النبي صلى الله عليه وسلم في خرب المدينة، وهو يتوكأ على عسيب معه، فمر بنفر من اليهود، فقال بعضهم لبعض سلوه عن الروح‏.‏ وقال بعضهم لا تسألوه لا يجيء فيه بشىء تكرهونه‏.‏ فقال بعضهم لنسألنه‏.‏ فقام رجل منهم فقال يا أبا القاسم، ما الروح فسكت‏.‏ فقلت إنه يوحى إليه‏.‏ فقمت، فلما انجلى عنه، قال ‏{‏ويسألونك عن الروح قل الروح من أمر ربي وما أوتيتم من العلم إلا قليلا‏}‏‏.‏ قال الأعمش هكذا في قراءتنا‏.‏",
      "text_en": " Narrated `Abdullah:                     While I was going with the Prophet through the ruins of Medina and he was reclining on a date-palm leaf stalk, some Jews passed by. Some of them said to the others: Ask him (the Prophet) about the spirit. Some of them said that they should not ask him that question as he might give a reply which would displease them. But some of them insisted on asking, and so one of them stood up and asked, \"O Abul-Qasim ! What is the spirit?\" The Prophet remained quiet. I thought he was being inspired Divinely. So I stayed till that state of the Prophet (while being inspired) was over. The Prophet then said, \"And they ask you (O Muhammad) concerning the spirit --Say: The spirit -- its knowledge is with my Lord. And of knowledge you (mankind) have been given only a little).\" (17.85)",
      "chain": [
        "30158",
        "20256",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "230",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا قتيبة، قال حدثنا يزيد، قال حدثنا عمرو، عن سليمان، قال سمعت عائشة، ح وحدثنا مسدد، قال حدثنا عبد الواحد، قال حدثنا عمرو بن ميمون، عن سليمان بن يسار، قال سألت عائشة عن المني، يصيب الثوب فقالت كنت أغسله من ثوب رسول الله صلى الله عليه وسلم، فيخرج إلى الصلاة وأثر الغسل في ثوبه بقع الماء‏.‏",
      "text_en": " Narrated `Aisha:                     as above (229).",
      "chain": [
        "30367",
        "20304",
        "11439",
        "11005",
        "53",
        "30175",
        "20256",
        "11439",
        "11005",
        "53"
      ]
    },
    {
      "hadith_no": "231",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا موسى، قال حدثنا عبد الواحد، قال حدثنا عمرو بن ميمون، قال سألت سليمان بن يسار في الثوب تصيبه الجنابة قال قالت عائشة كنت أغسله من ثوب رسول الله صلى الله عليه وسلم، ثم يخرج إلى الصلاة وأثر الغسل فيه بقع الماء‏.‏",
      "text_en": " Narrated Sulaiman bin Yasar:                     I asked `Aisha about the clothes soiled with semen. She replied, \"I used to wash it off the clothes of Allah's Apostle and he would go for the prayer while water spots were still visible. \"",
      "chain": [
        "20040",
        "20256",
        "11439",
        "11005"
      ]
    },
    {
      "hadith_no": "257",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا موسى، قال حدثنا عبد الواحد، عن الأعمش، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس، قال قالت ميمونة وضعت للنبي صلى الله عليه وسلم ماء للغسل، فغسل يديه مرتين أو ثلاثا، ثم أفرغ على شماله فغسل مذاكيره، ثم مسح يده بالأرض، ثم مضمض واستنشق وغسل وجهه ويديه، ثم أفاض على جسده، ثم تحول من مكانه فغسل قدميه‏.‏",
      "text_en": " Narrated Maimuna:                     I placed water for the bath of the Prophet. He washed his hands twice or thrice and then poured water on his left hand and washed his private parts. He rubbed his hands over the earth (and cleaned them), rinsed his mouth, washed his nose by putting water in it and blowing it out, washed his face and both forearms and then poured water over his body. Then he withdrew from that place and washed his feet.",
      "chain": [
        "20040",
        "20256",
        "11060",
        "11342",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "265",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن محبوب، قال حدثنا عبد الواحد، قال حدثنا الأعمش، عن سالم بن أبي الجعد، عن كريب، مولى ابن عباس عن ابن عباس، قال قالت ميمونة وضعت لرسول الله صلى الله عليه وسلم ماء يغتسل به، فأفرغ على يديه، فغسلهما مرتين مرتين أو ثلاثا، ثم أفرغ بيمينه على شماله، فغسل مذاكيره، ثم دلك يده بالأرض، ثم مضمض واستنشق، ثم غسل وجهه ويديه ثم غسل رأسه ثلاثا، ثم أفرغ على جسده، ثم تنحى من مقامه فغسل قدميه‏.‏",
      "text_en": " Narrated Maimuna:                     I placed water for the bath of Allah's Apostle and he poured water over his hands and washed them twice or thrice; then he poured water with his right hand over his left and washed his private parts (with his left hand). He rubbed his hand over the earth and rinsed his mouth and washed his nose by putting water in it and blowing it out. After that he washed his face, both fore arms and head thrice and then poured water over his body. He withdrew from that place and washed his feet.",
      "chain": [
        "30171",
        "20256",
        "11060",
        "11342",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "303",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا عبد الواحد، قال حدثنا الشيباني، قال حدثنا عبد الله بن شداد، قال سمعت ميمونة، كان رسول الله صلى الله عليه وسلم إذا أراد أن يباشر امرأة من نسائه أمرها فاتزرت وهى حائض‏.‏ ورواه سفيان عن الشيباني‏.‏",
      "text_en": " Narrated Maimuna:                     When ever Allah's Apostle wanted to fondle any of his wives during the periods (menses), he used to ask her to wear an Izar.",
      "chain": [
        "20283",
        "20256",
        "11352",
        "169",
        "61"
      ]
    },
    {
      "hadith_no": "452",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا عبد الواحد، قال حدثنا أبو بردة بن عبد الله، قال سمعت أبا بردة، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ من مر في شىء من مساجدنا أو أسواقنا بنبل، فليأخذ على نصالها، لا يعقر بكفه مسلما ‏\"‏‏.‏",
      "text_en": " Narrated Abu Burda bin `Abdullah:                     (on the authority of his father) The Prophet said, \"Whoever passes through our mosques or markets with arrows should hold them by their heads lest he should injure a Muslim.\"",
      "chain": [
        "20040",
        "20256",
        "1820"
      ]
    },
    {
      "hadith_no": "518",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا عبد الواحد بن زياد، قال حدثنا الشيباني، سليمان حدثنا عبد الله بن شداد، قال سمعت ميمونة، تقول كان النبي صلى الله عليه وسلم يصلي وأنا إلى جنبه نائمة، فإذا سجد أصابني ثوبه، وأنا حائض‏.‏ وزاد مسدد عن خالد قال حدثنا سليمان الشيباني، وأنا حائض‏.‏",
      "text_en": " Narrated Maimuna:                     The Prophet used to pray while I used to sleep beside him during my periods (menses) and in prostration his garment used to touch me.",
      "chain": [
        "20283",
        "20256",
        "169"
      ]
    },
    {
      "hadith_no": "592",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا عبد الواحد، قال حدثنا الشيباني، قال حدثنا عبد الرحمن بن الأسود، عن أبيه، عن عائشة، قالت ركعتان لم يكن رسول الله صلى الله عليه وسلم يدعهما سرا ولا علانية ركعتان قبل صلاة الصبح، وركعتان بعد العصر‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle never missed two rak`at before the Fajr prayer and after the `Asr prayer openly and secretly.",
      "chain": [
        "20040",
        "20256",
        "11352",
        "11056",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "647",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا عبد الواحد، قال حدثنا الأعمش، قال سمعت أبا صالح، يقول سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ صلاة الرجل في الجماعة تضعف على صلاته في بيته وفي سوقه خمسا وعشرين ضعفا، وذلك أنه إذا توضأ فأحسن الوضوء، ثم خرج إلى المسجد لا يخرجه إلا الصلاة، لم يخط خطوة إلا رفعت له بها درجة، وحط عنه بها خطيئة، فإذا صلى لم تزل الملائكة تصلي عليه ما دام في مصلاه اللهم صل عليه، اللهم ارحمه‏.‏ ولا يزال أحدكم في صلاة ما انتظر الصلاة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"The reward of the prayer offered by a person in congregation is twenty five times greater than that of the prayer offered in one's house or in the market (alone). And this is because if he performs ablution and does it perfectly and then proceeds to the mosque with the sole intention of praying, then for every step he takes towards the mosque, he is upgraded one degree in reward and his one sin is taken off (crossed out) from his accounts (of deeds). When he offers his prayer, the angels keep on asking Allah's Blessings and Allah's forgiveness for him as long as he is (staying) at his Musalla. They say, 'O Allah! Bestow Your blessings upon him, be Merciful and kind to him.' And one is regarded in prayer as long as one is waiting for the prayer.\"",
      "chain": [
        "20040",
        "20256",
        "11060",
        "19291",
        "13"
      ]
    },
    {
      "hadith_no": "744",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا عبد الواحد بن زياد، قال حدثنا عمارة بن القعقاع، قال حدثنا أبو زرعة، قال حدثنا أبو هريرة، قال كان رسول الله صلى الله عليه وسلم يسكت بين التكبير وبين القراءة إسكاتة  قال أحسبه قال هنية  فقلت بأبي وأمي يا رسول الله، إسكاتك بين التكبير والقراءة ما تقول قال ‏\"‏ أقول اللهم باعد بيني وبين خطاياى كما باعدت بين المشرق والمغرب، اللهم نقني من الخطايا كما ينقى الثوب الأبيض من الدنس، اللهم اغسل خطاياى بالماء والثلج والبرد ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle used to keep silent between the Takbir and the recitation of Qur'an and that interval of silence used to be a short one. I said to the Prophet \"May my parents be sacrificed for you! What do you say in the pause between Takbir and recitation?\" The Prophet said, \"I say, 'Allahumma, baa`id baini wa baina khatayaya kama baa`adta baina l-mashriqi wa l-maghrib. Allahumma, naqqini min khatayaya kama yunaqqa th-thawbu l-abyadu mina d-danas. Allahumma, ighsil khatayaya bi l-maa'i wa th-thalji wa l-barad (O Allah! Set me apart from my sins (faults) as the East and West are set apart from each other and clean me from sins as a white garment is cleaned of dirt (after thorough washing). O Allah! Wash off my sins with water, snow and hail.)\"",
      "chain": [
        "20040",
        "20256",
        "11379",
        "30554",
        "13"
      ]
    },
    {
      "hadith_no": "746",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا موسى، قال حدثنا عبد الواحد، قال حدثنا الأعمش، عن عمارة بن عمير، عن أبي معمر، قال قلنا لخباب أكان رسول الله صلى الله عليه وسلم يقرأ في الظهر والعصر قال نعم‏.‏ قلنا بم كنتم تعرفون ذاك قال باضطراب لحيته‏.‏",
      "text_en": " Narrated Abu Ma`mar:                     We asked Khabbab whether Allah's Apostle used to recite (the Qur'an) in the Zuhr and the `Asr prayers. He replied in the affirmative. We said, \"How did you come to know about it?\" He said, \"By the movement of his beard.\"",
      "chain": [
        "20040",
        "20256",
        "11060",
        "11378",
        "11360"
      ]
    },
    {
      "hadith_no": "1002",
      "source": " Sahih Bukhari ",
      "chapter": "Witr Prayer - كتاب الوتر",
      "chapter_no": "14",
      "text_ar": "حدثنا مسدد، قال حدثنا عبد الواحد، قال حدثنا عاصم، قال سألت أنس بن مالك عن القنوت،‏.‏ فقال قد كان القنوت‏.‏ قلت قبل الركوع أو بعده قال قبله‏.‏ قال فإن فلانا أخبرني عنك أنك قلت بعد الركوع‏.‏ فقال كذب، إنما قنت رسول الله صلى الله عليه وسلم بعد الركوع شهرا  أراه  كان بعث قوما يقال لهم القراء زهاء سبعين رجلا إلى قوم من المشركين دون أولئك، وكان بينهم وبين رسول الله صلى الله عليه وسلم عهد فقنت رسول الله صلى الله عليه وسلم شهرا يدعو عليهم‏.‏",
      "text_en": " Narrated `Asim:                     I asked Anas bin Malik about the Qunut. Anas replied, \"Definitely it was (recited)\". I asked, \"Before bowing or after it?\" Anas replied, \"Before bowing.\" I added, \"So and so has told me that you had informed him that it had been after bowing.\" Anas said, \"He told an untruth (i.e. \"was mistaken,\" according to the Hijazi dialect). Allah's Apostle recited Qunut after bowing for a period of one month.\" Anas added, \"The Prophet sent about seventy men (who knew the Qur'an by heart) towards the pagans (of Najd) who were less than they in number and there was a peace treaty between them and Allah's Apostles (but the Pagans broke the treaty and killed the seventy men). So Allah's Apostle recited Qunut for a period of one month asking Allah to punish them.\"",
      "chain": [
        "30175",
        "20256",
        "11080",
        "19"
      ]
    },
    {
      "hadith_no": "1084",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا قتيبة، قال حدثنا عبد الواحد، عن الأعمش، قال حدثنا إبراهيم، قال سمعت عبد الرحمن بن يزيد، يقول صلى بنا عثمان بن عفان  رضى الله عنه  بمنى أربع ركعات، فقيل ذلك لعبد الله بن مسعود  رضى الله عنه  فاسترجع ثم قال صليت مع رسول الله صلى الله عليه وسلم بمنى ركعتين، وصليت مع أبي بكر  رضى الله عنه  بمنى ركعتين، وصليت مع عمر بن الخطاب  رضى الله عنه  بمنى ركعتين، فليت حظي من أربع ركعات ركعتان متقبلتان‏.‏",
      "text_en": " Narrated `Abdur Rahman bin Yazid:                     We offered a four rak`at prayer at Mina behind Ibn `Affan . `Abdullah bin Mas`ud was informed about it. He said sadly, \"Truly to Allah we belong and truly to Him we shall return.\" And added, \"I prayed two rak`at with Allah's Apostle at Mina and similarly with Abu Bakr and with `Umar (during their caliphates).\" He further said, \"May I be lucky enough to have two of the four rak`at accepted (by Allah).\"",
      "chain": [
        "30367",
        "20256",
        "11060",
        "11051",
        "20395"
      ]
    },
    {
      "hadith_no": "1321",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا الشيباني، عن عامر، عن ابن عباس  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم مر بقبر قد دفن ليلا فقال ‏\"‏ متى دفن هذا ‏\"‏‏.‏ قالوا البارحة‏.‏ قال ‏\"‏ أفلا آذنتموني ‏\"‏‏.‏ قالوا دفناه في ظلمة الليل فكرهنا أن نوقظك‏.‏ فقام فصففنا خلفه‏.‏ قال ابن عباس وأنا فيهم فصلى عليه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle passed by a grave of a deceased who had been buried at night. He said, \"When was this (deceased) buried?\" The people said, \"Yesterday.\" He said, \"Why did you not inform me?\" They said, \"We buried him when it was dark and so we disliked to wake you up.\" He stood up and we lined up behind him. (Ibn `Abbas said): I was one of them, and the Prophet offered the funeral prayer.",
      "chain": [
        "20040",
        "20256",
        "11352",
        "11052",
        "17"
      ]
    },
    {
      "hadith_no": "1440",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا عمارة بن القعقاع، حدثنا أبو زرعة، حدثنا أبو هريرة  رضى الله عنه  قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله أى الصدقة أعظم أجرا قال ‏\"‏ أن تصدق وأنت صحيح شحيح، تخشى الفقر وتأمل الغنى، ولا تمهل حتى إذا بلغت الحلقوم قلت لفلان كذا، ولفلان كذا، وقد كان لفلان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     A man came to the Prophet and asked, \"O Allah's Apostle! Which charity is the most superior in reward?\" He replied, \"The charity which you practice while you are healthy, niggardly and afraid of poverty and wish to become wealthy. Do not delay it to the time of approaching death and then say, 'Give so much to such and such, and so much to such and such.' And it has already belonged to such and such (as it is too late).\"",
      "chain": [
        "20040",
        "20256",
        "11379",
        "30554",
        "13"
      ]
    },
    {
      "hadith_no": "1453",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا أبو بردة بن عبد الله بن أبي بردة، حدثنا أبو بردة بن أبي موسى، عن أبيه  رضى الله عنه  قال كان رسول الله صلى الله عليه وسلم إذا جاءه السائل، أو طلبت إليه حاجة قال ‏\"‏ اشفعوا تؤجروا، ويقضي الله على لسان نبيه صلى الله عليه وسلم ما شاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Burda bin Abu Musa:                     that his father said, \"Whenever a beggar came to Allah's Apostle or he was asked for something, he used to say (to his companions), \"Help and recommend him and you will receive the reward for it; and Allah will bring about what He will through His Prophet's tongue.\"",
      "chain": [
        "20040",
        "20256",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1726",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو النعمان، حدثنا عبد الواحد، حدثنا الأعمش، حدثنا إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  قالت كنت أفتل القلائد للنبي صلى الله عليه وسلم فيقلد الغنم، ويقيم في أهله حلالا‏.‏",
      "text_en": " Narrated `Aisha:                     I used to make the garlands for (the Hadis of) the Prophet and he would garland the sheep (with them) and would stay with his family as a non-Muhrim.",
      "chain": [
        "20283",
        "20256",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "1777",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا مسدد، عن عبد الواحد، حدثنا الأعمش، قال سمعت الحجاج، يقول على المنبر السورة التي يذكر فيها البقرة، والسورة التي يذكر فيها آل عمران، والسورة التي يذكر فيها النساء‏.‏ قال فذكرت ذلك لإبراهيم، فقال حدثني عبد الرحمن بن يزيد أنه كان مع ابن مسعود  رضى الله عنه  حين رمى جمرة العقبة، فاستبطن الوادي، حتى إذا حاذى بالشجرة اعترضها، فرمى بسبع حصيات، يكبر مع كل حصاة، ثم قال من ها هنا والذي لا إله غيره قام الذي أنزلت عليه سورة البقرة صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Al-A`mash:                     I heard Al-Hajjaj saying on the pulpit, \"The Sura in which Al-Baqara (the cow) is mentioned and the Sura in which the family of `Imran is mentioned and the Sura in which the women (An-Nisa) is mentioned.\" I mentioned this to Ibrahim, and he said, `Abdur-Rahman bin Yazid told me, 'I was with Ibn Mas`ud, when he did the Rami of the Jamrat-ul-Aqaba. He went down the middle of the valley, and when he came near the tree (which was near the Jamra) he stood opposite to it and threw seven small pebbles and said: 'Allahu-Akbar' on throwing every pebble.' Then he said, 'By Him, except Whom none has the right to be worshipped, here (at this place) stood the one on whom Surat-al-Baqra was revealed (i.e. Allah's Apostle).' \"",
      "chain": [
        "30175",
        "20256",
        "11060",
        "20381",
        "20395"
      ]
    },
    {
      "hadith_no": "1892",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا مسدد، حدثنا عبد الواحد، حدثنا حبيب بن أبي عمرة، قال حدثتنا عائشة بنت طلحة، عن عائشة أم المؤمنين  رضى الله عنها  قالت قلت يا رسول الله ألا نغزوا ونجاهد معكم فقال ‏\"‏ لكن أحسن الجهاد وأجمله الحج، حج مبرور ‏\"‏‏.‏ فقالت عائشة فلا أدع الحج بعد إذ سمعت هذا من رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Aisha (mother of the faithful believers):                     I said, \"O Allah's Apostle! Shouldn't we participate in Holy battles and Jihad along with you?\" He replied, \"The best and the most superior Jihad (for women) is Hajj which is accepted by Allah.\" `Aisha added: Ever since I heard that from Allah's Apostle I have determined not to miss Hajj.",
      "chain": [
        "30175",
        "20256",
        "14069",
        "10504",
        "53"
      ]
    },
    {
      "hadith_no": "1956",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا مسدد، حدثنا عبد الواحد، حدثنا الشيباني، قال سمعت عبد الله بن أبي أوفى  رضى الله عنه  قال سرنا مع رسول الله صلى الله عليه وسلم وهو صائم، فلما غربت الشمس قال ‏\"‏ انزل، فاجدح لنا ‏\"‏‏.‏ قال يا رسول الله، لو أمسيت‏.‏ قال ‏\"‏ انزل، فاجدح لنا ‏\"‏‏.‏ قال يا رسول الله، إن عليك نهارا‏.‏ قال ‏\"‏ انزل، فاجدح لنا ‏\"‏‏.‏ فنزل، فجدح، ثم قال ‏\"‏ إذا رأيتم الليل أقبل من ها هنا فقد أفطر الصائم ‏\"‏‏.‏ وأشار بإصبعه قبل المشرق‏.‏",
      "text_en": " Narrated `Abdullah bin Abi `Aufa:                     We were traveling with Allah's Apostle and he was fasting, and when the sun set, he said to (someone), \"Get down and mix Sawiq with water for us.\" He replied, \"O Allah's Apostle! (Will you wait) till it is evening?\" The Prophet again said, \"Get down and mix Sawiq with water for us.\" He replied, \"O Allah's Apostle! It is still daytime.\" The Prophet said again, \"Get down and mix Sawiq with water for us.\" So, he got down and carried out that order. The Prophet then said, \"When you see night falling from this side, the fasting person should break his fast,\" and he beckoned with his finger towards the east.",
      "chain": [
        "30175",
        "20256",
        "11352",
        "5115"
      ]
    },
    {
      "hadith_no": "2022",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Night of Qadr - كتاب فضل ليلة القدر",
      "chapter_no": "32",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا عبد الواحد، حدثنا عاصم، عن أبي مجلز، وعكرمة، قال ابن عباس  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ هي في العشر، هي في تسع يمضين أو في سبع يبقين ‏\"‏‏.‏ يعني ليلة القدر‏.‏ قال عبد الوهاب عن أيوب‏.‏ وعن خالد عن عكرمة عن ابن عباس التمسوا في أربع وعشرين‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle said, \"The Night of Qadr is in the last ten nights of the month (Ramadan), either on the first nine or in the last (remaining) seven nights (of Ramadan).\" Ibn `Abbas added, \"Search for it on the twenty-fourth (of Ramadan).",
      "chain": [
        "30145",
        "20256",
        "11080",
        "11313",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2068",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا معلى بن أسد، حدثنا عبد الواحد، حدثنا الأعمش، قال ذكرنا عند إبراهيم الرهن في السلم فقال حدثني الأسود عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم اشترى طعاما من يهودي إلى أجل، ورهنه درعا من حديد‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet purchased food grains from a Jew on credit and mortgaged his iron armor to him.",
      "chain": [
        "30457",
        "20256",
        "11060",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2101",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثني موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا أبو بردة بن عبد الله، قال سمعت أبا بردة بن أبي موسى، عن أبيه  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مثل الجليس الصالح والجليس السوء كمثل صاحب المسك، وكير الحداد، لا يعدمك من صاحب المسك إما تشتريه، أو تجد ريحه، وكير الحداد يحرق بدنك أو ثوبك أو تجد منه ريحا خبيثة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     Allah's Apostle said, \"The example of a good companion (who sits with you) in comparison with a bad one, is I like that of the musk seller and the blacksmith's bellows (or furnace); from the first you would either buy musk or enjoy its good smell while the bellows would either burn your clothes or your house, or you get a bad nasty smell thereof.\"",
      "chain": [
        "20040",
        "20256",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2158",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا الصلت بن محمد، حدثنا عبد الواحد، حدثنا معمر، عن عبد الله بن طاوس، عن أبيه، عن ابن عباس  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تلقوا الركبان ولا يبيع حاضر لباد ‏\"‏‏.‏ قال فقلت لابن عباس ما قوله لا يبيع حاضر لباد قال لا يكون له سمسارا‏.‏",
      "text_en": " Narrated Tawus:                     Ibn `Abbas said, \"Allah's Apostle said, 'Do not go to meet the caravans on the way (for buying their goods without letting them know the market price); a town dweller should not sell the goods of a desert dweller on behalf of the latter.' I asked Ibn `Abbas, 'What does he mean by not selling the goods of a desert dweller by a town dweller?' He said, 'He should not become his broker.' \"",
      "chain": [
        "30140",
        "20256",
        "20115",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2214",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن محبوب، حدثنا عبد الواحد، حدثنا معمر، عن الزهري، عن أبي سلمة بن عبد الرحمن، عن جابر بن عبد الله  رضى الله عنهما  قال قضى النبي صلى الله عليه وسلم بالشفعة في كل مال لم يقسم، فإذا وقعت الحدود وصرفت الطرق فلا شفعة‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Allah's Apostle decided the validity of preemption in every joint undivided property, but if the boundaries were well marked or the ways and streets were fixed, then there was no pre-emption.",
      "chain": [
        "30171",
        "20256",
        "20115",
        "11013",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "2244",
      "source": " Sahih Bukhari ",
      "chapter": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam) - كتاب السلم",
      "chapter_no": "35",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا الشيباني، حدثنا محمد بن أبي المجالد، قال بعثني عبد الله بن شداد وأبو بردة إلى عبد الله بن أبي أوفى  رضى الله عنهما  فقالا سله هل كان أصحاب النبي صلى الله عليه وسلم في عهد النبي صلى الله عليه وسلم يسلفون في الحنطة قال عبد الله كنا نسلف نبيط أهل الشأم في الحنطة، والشعير، والزيت، في كيل معلوم، إلى أجل معلوم‏.‏ قلت إلى من كان أصله عنده قال ما كنا نسألهم عن ذلك‏.‏ ثم بعثاني إلى عبد الرحمن بن أبزى فسألته فقال كان أصحاب النبي صلى الله عليه وسلم يسلفون على عهد النبي صلى الله عليه وسلم ولم نسألهم ألهم حرث أم لا",
      "text_en": " Narrated Muhammad bin Al-Mujalid:                     `Abdullah bin Shaddad and Abu Burda sent me to `Abdullah bin Abi `Aufa and told me to ask `Abdullah whether the people in the lifetime of the Prophet used to pay in advance for wheat (to be delivered later). `Abdullah replied, \"We used to pay in advance to the peasants of Sham for wheat, barley and olive oil of a known specified measure to be delivered in a specified period.\" I asked (him), \"Was the price paid (in advance) to those who had the things to be delivered later?\" `Abdullah bin `Aufa replied, \"We did not use to ask them about that.\" Then they sent me to `Abdur Rahman bin Abza and I asked him. He replied, \"The companions of the Prophet used to practice Salam in the lifetime of the Prophet; and we did not use to ask them whether they had standing crops or not.\"",
      "chain": [
        "20040",
        "20256",
        "11352",
        "11701"
      ]
    },
    {
      "hadith_no": "2252",
      "source": " Sahih Bukhari ",
      "chapter": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam) - كتاب السلم",
      "chapter_no": "35",
      "text_ar": "حدثني محمد بن محبوب، حدثنا عبد الواحد، حدثنا الأعمش، قال تذاكرنا عند إبراهيم الرهن في السلف فقال حدثني الأسود عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم اشترى من يهودي طعاما إلى أجل معلوم، وارتهن منه درعا من حديد‏.‏",
      "text_en": " Narrated Al-A`mash:                     We argued at Ibrahim's dwelling place about mortgaging in Salam. He said, \"Aisha said, 'The Prophet bought some foodstuff from a Jew on credit and the payment was to be made by a definite period, and he mortgaged his iron armor to him.\"",
      "chain": [
        "30171",
        "20256",
        "11060",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2257",
      "source": " Sahih Bukhari ",
      "chapter": "Shuf'a - كتاب الشفعة",
      "chapter_no": "36",
      "text_ar": "حدثنا مسدد، حدثنا عبد الواحد، حدثنا معمر، عن الزهري، عن أبي سلمة بن عبد الرحمن، عن جابر بن عبد الله  رضى الله عنهما  قال قضى رسول الله صلى الله عليه وسلم بالشفعة في كل ما لم يقسم، فإذا وقعت الحدود وصرفت الطرق فلا شفعة‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Allah's Apostle gave a verdict regarding Shuf'a in every undivided joint thing (property). But if the limits are defined (or demarcated) or the ways and streets are fixed, then there is no pre-emption.",
      "chain": [
        "30175",
        "20256",
        "20115",
        "11013",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "2274",
      "source": " Sahih Bukhari ",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا مسدد، حدثنا عبد الواحد، حدثنا معمر، عن ابن طاوس، عن أبيه، عن ابن عباس  رضى الله عنهما  نهى رسول الله صلى الله عليه وسلم أن يتلقى الركبان، ولا يبيع حاضر لباد‏.‏ قلت يا ابن عباس ما قوله لا يبيع حاضر لباد قال لا يكون له سمسارا‏.‏",
      "text_en": " Narrated Tawus:                     Ibn `Abbas said, \"The Prophet forbade the meeting of caravans (on the way) and ordained that no townsman is permitted to sell things on behalf of a bedouin.\" I asked Ibn `Abbas, \"What is the meaning of his saying, 'No townsman is permitted to sell things on behalf of a bedouin.' \" He replied, \"He should not work as a broker for him.\"",
      "chain": [
        "30175",
        "20256",
        "20115",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2358",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد بن زياد، عن الأعمش، قال سمعت أبا صالح، يقول سمعت أبا هريرة  رضى الله عنه  يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاثة لا ينظر الله إليهم يوم القيامة، ولا يزكيهم، ولهم عذاب أليم رجل كان له فضل ماء بالطريق، فمنعه من ابن السبيل، ورجل بايع إماما لا يبايعه إلا لدنيا، فإن أعطاه منها رضي، وإن لم يعطه منها سخط، ورجل أقام سلعته بعد العصر، فقال والله الذي لا إله غيره لقد أعطيت بها كذا وكذا، فصدقه رجل‏\"‏ ثم قرأ هذه الآية ‏{‏إن الذين يشترون بعهد الله وأيمانهم ثمنا قليلا‏}‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"There are three persons whom Allah will not look at on the Day of Resurrection, nor will he purify them and theirs shall be a severe punishment. They are: -1. A man possessed superfluous water, on a way and he withheld it from travelers. -2. A man who gave a pledge of allegiance to a ruler and he gave it only for worldly benefits. If the ruler gives him something he gets satisfied, and if the ruler withholds something from him, he gets dissatisfied. -3. And man displayed his goods for sale after the `Asr prayer and he said, 'By Allah, except Whom None has the right to be worshipped, I have been given so much for my goods,' and somebody believes him (and buys them). The Prophet then recited: \"Verily! Those who purchase a little gain at the cost of Allah's Covenant and their oaths.\" (3.77)",
      "chain": [
        "20040",
        "20256",
        "11060",
        "19291",
        "13"
      ]
    },
    {
      "hadith_no": "2386",
      "source": " Sahih Bukhari ",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا معلى بن أسد، حدثنا عبد الواحد، حدثنا الأعمش، قال تذاكرنا عند إبراهيم الرهن في السلم فقال حدثني الأسود عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم اشترى طعاما من يهودي إلى أجل، ورهنه درعا من حديد‏.‏",
      "text_en": " Narrated Al-A`mash:                     When we were with Ibrahim, we talked about mortgaging in deals of Salam. Ibrahim narrated from Aswad that `Aisha had said, \"The Prophet bought some foodstuff on credit from a Jew and mortgaged an iron armor to him.\"",
      "chain": [
        "30457",
        "20256",
        "11060",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2496",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا مسدد، حدثنا عبد الواحد، حدثنا معمر، عن الزهري، عن أبي سلمة، عن جابر بن عبد الله  رضى الله عنهما  قال قضى النبي صلى الله عليه وسلم بالشفعة في كل ما لم يقسم، فإذا وقعت الحدود وصرفت الطرق فلا شفعة‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet said, \"The right of preemption is valid in every joint property, but when the land is divided and the way is demarcated, then there is no right of pre-emption.\"",
      "chain": [
        "30175",
        "20256",
        "20115",
        "11013",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "2509",
      "source": " Sahih Bukhari ",
      "chapter": "Mortgaging - كتاب الرهن",
      "chapter_no": "48",
      "text_ar": "حدثنا مسدد، حدثنا عبد الواحد، حدثنا الأعمش، قال تذاكرنا عند إبراهيم الرهن، والقبيل في السلف، فقال إبراهيم حدثنا الأسود عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم اشترى من يهودي طعاما إلى أجل ورهنه درعه‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet bought some foodstuff on credit for a limited period and mortgaged his armor for it.",
      "chain": [
        "30175",
        "20256",
        "11060",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2600",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن محبوب، حدثنا عبد الواحد، حدثنا معمر، عن الزهري، عن حميد بن عبد الرحمن، عن أبي هريرة  رضى الله عنه  قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال هلكت‏.‏ فقال ‏\"‏ وما ذاك ‏\"‏‏.‏ قال وقعت بأهلي في رمضان‏.‏ قال ‏\"‏ تجد رقبة ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ فهل تستطيع أن تصوم شهرين متتابعين ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ فتستطيع أن تطعم ستين مسكينا ‏\"‏‏.‏ قال لا‏.‏ قال فجاء رجل من الأنصار بعرق  والعرق المكتل  فيه تمر فقال ‏\"‏ اذهب بهذا فتصدق به ‏\"‏‏.‏ قال على أحوج منا يا رسول الله والذي بعثك بالحق ما بين لابتيها أهل بيت أحوج منا‏.‏ قال ‏\"‏ اذهب فأطعمه أهلك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     A man came to Allah's Apostle and said, \"I am ruined.\" The Prophet asked, \"What do you mean?\" He said, \"I had a sexual intercourse with my wife during Ramadan (while fasting).\" The Prophet asked him, \"Can you manumit a slave?\" He replied in the negative. He then asked him, \"Can you fast for two successive months continuously\" He replied in the negative. The Prophet then asked him, \"Can you feed sixty poor persons?\" He replied in the negative. In the meantime an Ansari came with a basket full of dates. The Prophet said to the man, \"Take it and give it in charity (as an expiation of your sin).\" The man said \"Should I give it to some people who are poorer than we O Allah's Apostle? By Him Who has sent you with the Truth, there is no family between Medina's two mountains poorer than we.\" Allah's Apostle told him to take it and provide his family with it.\"",
      "chain": [
        "30171",
        "20256",
        "20115",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "2673",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، عن الأعمش، عن أبي وائل، عن ابن مسعود  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من حلف على يمين ليقتطع بها مالا لقي الله وهو عليه غضبان ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Mas`ud:                     The Prophet said, \"Whoever takes a (false) oath in order to grab (others) property, then Allah will be angry with him when he will meet Him.\"",
      "chain": [
        "20040",
        "20256",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "2918",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا الأعمش، عن أبي الضحى، مسلم  هو ابن صبيح  عن مسروق، قال حدثني المغيرة بن شعبة، قال انطلق رسول الله صلى الله عليه وسلم لحاجته ثم أقبل، فلقيته بماء، وعليه جبة شأمية، فمضمض واستنشق وغسل وجهه، فذهب يخرج يديه من كميه فكانا ضيقين، فأخرجهما من تحت، فغسلهما ومسح برأسه وعلى خفيه‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     Allah's Apostle went out to answer the call of nature and on his return I brought some water to him. He performed the ablution while he was wearing a Sha'mi cloak. He rinsed his mouth and washed his nose by putting water in it and then blowing it out, and washed his face. Then he tried to take out his hands through his sleeves but they were tight, so he took them out from underneath, washed them and passed wet hands over his head and over his leather socks.",
      "chain": [
        "20040",
        "20256",
        "11060",
        "11018",
        "166"
      ]
    },
    {
      "hadith_no": "3155",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا الشيباني، قال سمعت ابن أبي أوفى  رضى الله عنهما  يقول أصابتنا مجاعة ليالي خيبر، فلما كان يوم خيبر وقعنا في الحمر الأهلية، فانتحرناها فلما غلت القدور، نادى منادي رسول الله صلى الله عليه وسلم اكفئوا القدور، فلا تطعموا من لحوم الحمر شيئا‏.‏ قال عبد الله فقلنا إنما نهى النبي صلى الله عليه وسلم لأنها لم تخمس‏.‏ قال وقال آخرون حرمها البتة‏.‏ وسألت سعيد بن جبير فقال حرمها البتة‏.‏",
      "text_en": " Narrated Ibn Abi `Aufa:                     We were afflicted with hunger during the besiege of Khaibar, and when it was the day of (the battle of) Khaibar, we slaughtered the donkeys and when the pots got boiling (with their meat). Allah's Apostle made an announcement that all the pots should be upset and that nobody should eat anything of the meat of the donkeys. We thought that the Prophet prohibited that because the Khumus had not been taken out of the booty (i.e. donkeys); other people said, \"He prohibited eating them for ever.\" The sub-narrator added, \"I asked Sa`id bin Jubair who said, 'He has made the eating of donkeys' meat illegal for ever.\")",
      "chain": [
        "20040",
        "20256",
        "11352",
        "5115"
      ]
    },
    {
      "hadith_no": "3166",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا قيس بن حفص، حدثنا عبد الواحد، حدثنا الحسن بن عمرو، حدثنا مجاهد، عن عبد الله بن عمرو  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ من قتل معاهدا لم يرح رائحة الجنة، وإن ريحها توجد من مسيرة أربعين عاما ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     The Prophet said, \"Whoever killed a person having a treaty with the Muslims, shall not smell the smell of Paradise though its smell is perceived from a distance of forty years.\"",
      "chain": [
        "30158",
        "20256",
        "11624",
        "11028",
        "29"
      ]
    },
    {
      "hadith_no": "3339",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد بن زياد، حدثنا الأعمش، عن أبي صالح، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يجيء نوح وأمته فيقول الله تعالى هل بلغت فيقول نعم، أى رب‏.‏ فيقول لأمته هل بلغكم فيقولون لا، ما جاءنا من نبي‏.‏ فيقول لنوح من يشهد لك فيقول محمد صلى الله عليه وسلم وأمته، فنشهد أنه قد بلغ، وهو قوله جل ذكره ‏{‏وكذلك جعلناكم أمة وسطا لتكونوا شهداء على الناس‏}‏ والوسط العدل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     Allah's Apostle said, \"Noah and his nation will come (on the Day of Resurrection and Allah will ask (Noah), \"Did you convey (the Message)?' He will reply, 'Yes, O my Lord!' Then Allah will ask Noah's nation, 'Did Noah convey My Message to you?' They will reply, 'No, no prophet came to us.' Then Allah will ask Noah, 'Who will stand a witness for you?' He will reply, 'Muhammad and his followers (will stand witness for me).' So, I and my followers will stand as witnesses for him (that he conveyed Allah's Message).\" That is, (the interpretation) of the Statement of Allah: \"Thus we have made you a just and the best nation that you might be witnesses Over mankind ..\" (2.143)",
      "chain": [
        "20040",
        "20256",
        "11060",
        "11161",
        "38"
      ]
    },
    {
      "hadith_no": "3366",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا الأعمش، حدثنا إبراهيم التيمي، عن أبيه، قال سمعت أبا ذر  رضى الله عنه  قال قلت يا رسول الله، أى مسجد وضع في الأرض أول قال ‏\"‏ المسجد الحرام ‏\"‏‏.‏ قال قلت ثم أى قال ‏\"‏ المسجد الأقصى ‏\"‏‏.‏ قلت كم كان بينهما قال ‏\"‏ أربعون سنة، ثم أينما أدركتك الصلاة بعد فصله، فإن الفضل فيه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhar:                     I said, \"O Allah's Apostle! Which mosque was first built on the surface of the earth?\" He said, \"Al- Masjid-ul-,Haram (in Mecca).\" I said, \"Which was built next?\" He replied \"The mosque of Al-Aqsa ( in Jerusalem) .\" I said, \"What was the period of construction between the two?\" He said, \"Forty years.\" He added, \"Wherever (you may be, and) the prayer time becomes due, perform the prayer there, for the best thing is to do so (i.e. to offer the prayers in time).",
      "chain": [
        "20040",
        "20256",
        "11060",
        "11322",
        "11405",
        "23"
      ]
    },
    {
      "hadith_no": "3370",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا قيس بن حفص، وموسى بن إسماعيل، قالا حدثنا عبد الواحد بن زياد، حدثنا أبو قرة، مسلم بن سالم الهمداني قال حدثني عبد الله بن عيسى، سمع عبد الرحمن بن أبي ليلى، قال لقيني كعب بن عجرة فقال ألا أهدي لك هدية سمعتها من النبي، صلى الله عليه وسلم فقلت بلى، فأهدها لي‏.‏ فقال سألنا رسول الله صلى الله عليه وسلم فقلنا يا رسول الله كيف الصلاة عليكم أهل البيت فإن الله قد علمنا كيف نسلم‏.‏ قال ‏\"‏ قولوا اللهم صل على محمد، وعلى آل محمد، كما صليت على إبراهيم وعلى آل إبراهيم، إنك حميد مجيد، اللهم بارك على محمد، وعلى آل محمد، كما باركت على إبراهيم، وعلى آل إبراهيم، إنك حميد مجيد ‏\"‏‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abi Laila:                     Ka`b bin Ujrah met me and said, \"Shall I not give you a present I got from the Prophet?\" `Abdur- Rahman said, \"Yes, give it to me.\" I said, \"We asked Allah's Apostle saying, 'O Allah's Apostle! How should one (ask Allah to) send blessings on you, the members of the family, for Allah has taught us how to salute you (in the prayer)?' He said, 'Say: O Allah! Send Your Mercy on Muhammad and on the family of Muhammad, as You sent Your Mercy on Abraham and on the family of Abraham, for You are the Most Praise-worthy, the Most Glorious. O Allah! Send Your Blessings on Muhammad and the family of Muhammad, as You sent your Blessings on Abraham and on the family of Abraham, for You are the Most Praise-worthy, the Most Glorious.' \"",
      "chain": [
        "30158",
        "20040",
        "20256",
        "11653",
        "11361",
        "11196"
      ]
    },
    {
      "hadith_no": "3531",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا قيس بن حفص، حدثنا عبد الواحد، حدثنا كليب بن وائل، قال حدثتني ربيبة النبي، صلى الله عليه وسلم زينب ابنة أبي سلمة قال قلت لها أرأيت النبي صلى الله عليه وسلم أكان من مضر قالت فممن كان إلا من مضر من بني النضر بن كنانة‏.‏",
      "text_en": " Narrated Kulaib bin Wail:                     I asked Zainab bint Abi Salama (i.e. daughter of the wife of the Prophet, \"Tell me about the Prophet . Did he belong to the tribe of Mudar?\" She replied, \"Yes, he belonged to the tribe of Mudar and was from the offspring of An-Nadr bin Kinana.\"",
      "chain": [
        "30158",
        "20256",
        "11534"
      ]
    },
    {
      "hadith_no": "3532",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا موسى، حدثنا عبد الواحد، حدثنا كليب، حدثتني ربيبة النبي، صلى الله عليه وسلم وأظنها زينب قالت نهى رسول الله صلى الله عليه وسلم عن الدباء والحنتم والمقير والمزفت‏.‏ وقلت لها أخبريني النبي صلى الله عليه وسلم ممن كان من مضر كان قالت فممن كان إلا من مضر، كان من ولد النضر بن كنانة‏.‏",
      "text_en": " Narrated Kulaib:                     I was told by the Rabiba (i.e. daughter of the wife of the Prophet) who, I think, was Zainab, that the Prophet (forbade the utensils (of wine called) Ad-Dubba, Al-Hantam, Al-Muqaiyar and Al-Muzaffat. I said to her, 'Tell me as to which tribe the Prophet belonged; was he from the tribe of Mudar?'' She replied, \"He belonged to the tribe of Mudar and was from the offspring of An-Nadr bin Kinana. \"",
      "chain": [
        "20040",
        "20256",
        "11534",
        "244"
      ]
    },
    {
      "hadith_no": "4070",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا موسى، حدثنا عبد الواحد، حدثنا معمر، عن الزهري، عن عبيد الله بن عبد الله، حدثني ابن عباس، عن عمر  رضى الله عنهم  لما توفي النبي صلى الله عليه وسلم قلت لأبي بكر انطلق بنا إلى إخواننا من الأنصار‏.‏ فلقينا منهم رجلان صالحان شهدا بدرا‏.‏ فحدثت عروة بن الزبير فقال هما عويم بن ساعدة، ومعن بن عدي‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     `Umar said, \"When the Prophet died I said to Abu Bakr, 'Let us go to our Ansari brethren.' We met two pious men from them, who had fought in the battle of Badr.\" When I mentioned this to `Urwa bin Az-Zubair, he said, \"Those two pious men were 'Uwaim bin Sa`ida and Manbin Adi.\"",
      "chain": [
        "20040",
        "20256",
        "20115",
        "11013",
        "11004",
        "17",
        "3"
      ]
    },
    {
      "hadith_no": "4146",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، حدثنا عاصم الأحول، قال سألت أنس بن مالك  رضى الله عنه  عن القنوت، في الصلاة فقال نعم‏.‏ فقلت كان قبل الركوع أو بعده قال قبله‏.‏ قلت فإن فلانا أخبرني عنك أنك قلت بعده، قال كذب إنما قنت رسول الله صلى الله عليه وسلم بعد الركوع شهرا، أنه كان بعث ناسا يقال لهم القراء، وهم سبعون رجلا إلى ناس من المشركين، وبينهم وبين رسول الله صلى الله عليه وسلم عهد قبلهم، فظهر هؤلاء الذين كان بينهم وبين رسول الله صلى الله عليه وسلم عهد، فقنت رسول الله صلى الله عليه وسلم بعد الركوع شهرا يدعو عليهم‏.‏",
      "text_en": " Narrated `Asim Al-Ahwal:                     I asked Anas bin Malik regarding Al-Qunut during the prayer. Anas replied, \"Yes (Al-Qunut was said by the Prophet in the prayer).\" I said, \"Is it before Bowing or after Bowing?\" Anas replied, \"(It was said) before (Bowing).\" I said, \"So-and-so informed me that you told him that it was said after Bowing.\" Anas replied, \"He was mistaken, for Allah's Apostle said Al-Qunut after Bowing for one month. The Prophet had sent some people called Al-Qurra who were seventy in number, to some pagan people who had concluded a peace treaty with Allah's Apostle . But those who had concluded the treaty with Allah's Apostle violated the treaty (and martyred all the seventy men). So Allah's Apostle said Al-Qunut after Bowing (in the prayer) for one month, invoking evil upon them.",
      "chain": [
        "20040",
        "20256",
        "11080",
        "19"
      ]
    },
    {
      "hadith_no": "4254",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا عبد الواحد، عن عاصم، عن أبي عثمان، عن أبي موسى الأشعري  رضى الله عنه  قال لما غزا رسول الله صلى الله عليه وسلم خيبر  أو قال لما توجه رسول الله صلى الله عليه وسلم  أشرف الناس على واد، فرفعوا أصواتهم بالتكبير الله أكبر الله أكبر، لا إله إلا الله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اربعوا على أنفسكم، إنكم لا تدعون أصم ولا غائبا، إنكم تدعون سميعا قريبا وهو معكم ‏\"‏‏.‏ وأنا خلف دابة رسول الله صلى الله عليه وسلم فسمعني وأنا أقول لا حول ولا قوة إلا بالله، فقال لي ‏\"‏ يا عبد الله بن قيس ‏\"‏‏.‏ قلت لبيك رسول الله‏.‏ قال ‏\"‏ ألا أدلك على كلمة من كنز من كنوز الجنة ‏\"‏‏.‏ قلت بلى يا رسول الله فداك أبي وأمي‏.‏ قال ‏\"‏ لا حول ولا قوة إلا بالله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     When Allah's Apostle fought the battle of Khaibar, or when Allah's Apostle went towards it, (whenever) the people, (passed over a high place overlooking a valley, they raised their voices saying, \"Allahu-Akbar! Allahu-Akbar! None has the right to be worshipped except Allah.\" On that Allah's Apostle said (to them), \"Lower your voices, for you are not calling a deaf or an absent one, but you are calling a Hearer Who is near and is with you.\" I was behind the riding animal of Allah's Apostle and he heard me saying. \"There Is neither might, nor power but with Allah,\" On that he said to me, \"O `Abdullah bin Qais!\" I said, \"Labbaik. O Allah's Apostle!\" He said, \"Shall I tell you a sentence which is one of the treasures of Paradise\" I said, \"Yes, O Allah's Apostle! Let my father and mother be sacrificed for your sake.\" He said, \"It is: There is neither might nor power but with Allah.\"",
      "chain": [
        "20040",
        "20256",
        "11080",
        "11113",
        "41"
      ]
    },
    {
      "hadith_no": "4384",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا مسدد، حدثنا عبد الواحد، حدثنا الأعمش، قال حدثني سعد بن عبيدة، عن أبي عبد الرحمن، عن علي  رضى الله عنه  قال بعث النبي صلى الله عليه وسلم سرية فاستعمل رجلا من الأنصار، وأمرهم أن يطيعوه، فغضب فقال أليس أمركم النبي صلى الله عليه وسلم أن تطيعوني‏.‏ قالوا بلى‏.‏ قال فاجمعوا لي حطبا‏.‏ فجمعوا، فقال أوقدوا نارا‏.‏ فأوقدوها، فقال ادخلوها‏.‏ فهموا، وجعل بعضهم يمسك بعضا، ويقولون فررنا إلى النبي صلى الله عليه وسلم من النار‏.‏ فما زالوا حتى خمدت النار، فسكن غضبه، فبلغ النبي صلى الله عليه وسلم فقال ‏\"‏ لو دخلوها ما خرجوا منها إلى يوم القيامة، الطاعة في المعروف ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     The Prophet sent a Sariya under the command of a man from the Ansar and ordered the soldiers to obey him. He (i.e. the commander) became angry and said \"Didn't the Prophet order you to obey me!\" They replied, \"Yes.\" He said, \"Collect fire-wood for me.\" So they collected it. He said, \"Make a fire.\" When they made it, he said, \"Enter it (i.e. the fire).\" So they intended to do that and started holding each other and saying, \"We run towards (i.e. take refuge with) the Prophet from the fire.\" They kept on saying that till the fire was extinguished and the anger of the commander abated. When that news reached the Prophet he said, \"If they had entered it (i.e. the fire), they would not have come out of it till the Day of Resurrection. Obedience (to somebody) is required when he enjoins what is good.\"",
      "chain": [
        "30175",
        "20256",
        "11060",
        "11344",
        "11359",
        "5"
      ]
    },
    {
      "hadith_no": "4389",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عباس بن الوليد، حدثنا عبد الواحد، عن أيوب بن عائذ، حدثنا قيس بن مسلم، قال سمعت طارق بن شهاب، يقول حدثني أبو موسى الأشعري  رضى الله عنه  قال بعثني رسول الله صلى الله عليه وسلم إلى أرض قومي، فجئت ورسول الله صلى الله عليه وسلم منيخ بالأبطح فقال ‏\"‏ أحججت يا عبد الله بن قيس ‏\"‏‏.‏ قلت نعم يا رسول الله‏.‏ قال ‏\"‏ كيف قلت ‏\"‏‏.‏ قال قلت لبيك إهلالا كإهلالك‏.‏ قال ‏\"‏ فهل سقت معك هديا ‏\"‏‏.‏ قلت لم أسق‏.‏ قال ‏\"‏ فطف بالبيت واسع بين الصفا والمروة ثم حل ‏\"‏‏.‏ ففعلت حتى مشطت لي امرأة من نساء بني قيس، ومكثنا بذلك حتى استخلف عمر‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     Allah's Apostle sent me (as a governor) to the land of my people, and I came while Allah's Apostle was encamping at a place called Al-Abtah. The Prophet said, \"Have you made the intention to perform the Hajj, O `Abdullah bin Qais?\" I replied, \"Yes, O Allah's Apostle!\" He said, \"What did you say?\" I replied, \"I said, 'Labbaik' and expressed the same intention as yours.\" He said, \"Have you driven the Hadi along with you?\" I replied, \"No, I did not drive the Hadi.\" He said, \"So perform the Tawaf of the Ka`ba and then the Sai, between Safa and Marwa and then finish the state of Ihram.\" So I did the same, and one of the women of (the tribe of) Banu-Qais combed my hair. We continued follow in that tradition till the caliphate of `Umar.",
      "chain": [
        "20256",
        "11621",
        "11386",
        "3680",
        "41"
      ]
    }
  ],
  "total_hadiths": 181
}