{
  "id": "20254",
  "name": "Abu Bakr al-Hanfi عبد الكبير بن عبد المجيد- أبو بكر الحنفي",
  "full_name": "Abu Bakr al-Hanfi عبد الكبير بن عبد المجيد- أبو بكر الحنفي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "204",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Hanfi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20156",
      "name": "Aflah bin Hameed bin Nafi' أفلح بن حميد بن نافع",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20500",
      "name": "Usamah bin Zayd al-Lythy أسامة بن زيد الليثي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11504",
      "name": "Khthym bin Arak bin Malik خثيم بن عراك بن مالك",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11073",
      "name": "Sa'id bin Abi 'Aruba سعيد بن أبي عروبة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "22171",
      "name": "Kathir bin Zayd al-'Aslmy كثير بن زيد الأسلمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "19121",
      "name": "al-Hythm bin Rafa'i al-Hnfy الهيثم بن رافع الحنفي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30160",
      "name": "Muhammad bin Bashar Bindar محمد بن بشار بندار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30153",
      "name": "'Amr bin 'Ali bin Bahr al-Bahli عمرو بن علي بن بحر الباهلي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30313",
      "name": "Ishaq bin Mansur al-Kausaj إسحاق بن منصور بن بهرام - الكوسج",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30437",
      "name": "'Abbas bin 'Abdul 'Azeem al-'Anbari عباس بن عبد العظيم العنبري",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30524",
      "name": "Harun bin 'Abdullah al-Hamal هارون بن عبد الله بن مروان الحمال",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30375",
      "name": "Muhammad bin Rafa'i محمد بن رافع",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "34043",
      "name": "Bakr bin Khlf al-Basri بكر بن خلف البصري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "11410",
      "name": "Marthad bin 'Abdullah al-Yazni مرثد بن عبد الله اليزني",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "34121",
      "name": "'Abdullah bin al-Haytham bin 'Uthman عبد الله بن الهيثم بن عثمان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30261",
      "name": "'Ali bin Muslim bin Sa'id علي بن مسلم بن سعيد الطوسي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "34280",
      "name": "Yahya bin Hakeem al-Maquuam يحيى بن حكيم المقوم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30172",
      "name": "Muhammad bin Ma'mar bin Rabi' محمد بن معمر بن ربعي القيسي البحراني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30221",
      "name": "Yahya bin Musa Khat يحيى بن موسى خت",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "34255",
      "name": "Muhammad bin Yonus al-Kadaymi محمد بن يونس بن موسى الكديمي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1585",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن بشار، قال حدثني أبو بكر الحنفي، حدثنا أفلح بن حميد، سمعت القاسم بن محمد، عن عائشة  رضى الله عنها  قالت خرجنا مع رسول الله صلى الله عليه وسلم في أشهر الحج، وليالي الحج وحرم الحج، فنزلنا بسرف قالت فخرج إلى أصحابه فقال ‏\"‏ من لم يكن منكم معه هدى فأحب أن يجعلها عمرة فليفعل، ومن كان معه الهدى فلا ‏\"‏‏.‏ قالت فالآخذ بها والتارك لها من أصحابه قالت فأما رسول الله صلى الله عليه وسلم ورجال من أصحابه فكانوا أهل قوة، وكان معهم الهدى، فلم يقدروا على العمرة قالت فدخل على رسول الله صلى الله عليه وسلم وأنا أبكي فقال ‏\"‏ ما يبكيك يا هنتاه ‏\"‏‏.‏ قلت سمعت قولك لأصحابك فمنعت العمرة‏.‏ قال ‏\"‏ وما شأنك ‏\"‏‏.‏ قلت لا أصلي‏.‏ قال ‏\"‏ فلا يضيرك، إنما أنت امرأة من بنات آدم كتب الله عليك ما كتب عليهن، فكوني في حجتك، فعسى الله أن يرزقكيها ‏\"‏‏.‏ قالت فخرجنا في حجته حتى قدمنا منى فطهرت، ثم خرجت من منى فأفضت بالبيت قالت ثم خرجت معه في النفر الآخر حتى نزل المحصب، ونزلنا معه فدعا عبد الرحمن بن أبي بكر فقال ‏\"‏ اخرج بأختك من الحرم، فلتهل بعمرة ثم افرغا، ثم ائتيا ها هنا، فإني أنظركما حتى تأتياني ‏\"‏‏.‏  قالت  فخرجنا حتى إذا فرغت، وفرغت من الطواف ثم جئته بسحر فقال ‏\"‏ هل فرغتم ‏\"‏‏.‏ فقلت نعم‏.‏ فآذن بالرحيل في أصحابه، فارتحل الناس فمر متوجها إلى المدينة‏.‏ ضير من ضار يضير ضيرا، ويقال ضار يضور ضورا وضر يضر ضرا‏.‏",
      "text_en": " Narrated Al-Qasim bin Muhammad:                     ' Aisha said, \"We set out with Allah's Apostles in the months of Hajj, and (in) the nights of Hajj, and at the time and places of Hajj and in a state of Hajj. We dismounted at Sarif (a village six miles from Mecca). The Prophet then addressed his companions and said, \"Anyone who has not got the Hadi and likes to do Umra instead of Hajj may do so (i.e. Hajj-al-Tamattu`) and anyone who has got the Hadi should not finish the Ihram after performing ' `Umra). (i.e. Hajj-al-Qiran). Aisha added, \"The companions of the Prophet obeyed the above (order) and some of them (i.e. who did not have Hadi) finished their Ihram after Umra.\" Allah's Apostle and some of his companions were resourceful and had the Hadi with them, they could not perform Umra (alone) (but had to perform both Hajj and Umra with one Ihram). Aisha added, \"Allah's Apostle came to me and saw me weeping and said, \"What makes you weep, O Hantah?\" I replied, \"I have heard your conversation with your companions and I cannot perform the Umra.\" He asked, \"What is wrong with you?' I replied, ' I do not offer the prayers (i.e. I have my menses).' He said, ' It will not harm you for you are one of the daughters of Adam, and Allah has written for you (this state) as He has written it for them. Keep on with your intentions for Hajj and Allah may reward you that.\" Aisha further added, \"Then we proceeded for Hajj till we reached Mina and I became clean from my menses. Then I went out from Mina and performed Tawaf round the Ka`ba.\" Aisha added, \"I went along with the Prophet in his final departure (from Hajj) till he dismounted at Al-Muhassab (a valley outside Mecca), and we too, dismounted with him.\" He called ' `Abdur-Rahman bin Abu Bakr and said to him, ' Take your sister outside the sanctuary of Mecca and let her assume Ihram for ' `Umra, and when you had finished ' `Umra, return to this place and I will wait for you both till you both return to me.' \" ' Aisha added, \" So we went out of the sanctuary of Mecca and after finishing from the ' `Umra and the Tawaf we returned to the Prophet at dawn. He said, 'Have you performed the ' `Umra?' We replied in the affirmative. So he announced the departure amongst his companions and the people set out for the journey, and the Prophet: too left for Medina.''",
      "chain": [
        "30160",
        "20254",
        "20156",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "506",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني إسحاق بن إبراهيم، أخبرنا أبو بكر الحنفي، حدثنا الضحاك بن عثمان، حدثنا صدقة بن يسار، قال سمعت ابن عمر، يقول إن رسول الله صلى الله عليه وسلم قال ‏.‏ بمثله ‏.‏",
      "text_en": " This hadith has been narrated by Ibn Umar by another chain of transmitters.",
      "chain": [
        "30123",
        "20254",
        "20504",
        "10641",
        "18"
      ]
    },
    {
      "hadith_no": "1243",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا ليث، ح قال وحدثنا محمد بن المثنى، حدثنا أبو بكر الحنفي، حدثنا عبد الحميد بن جعفر، جميعا عن سعيد المقبري، عن عمرو بن سليم الزرقي، سمع أبا قتادة، يقول بينا نحن في المسجد جلوس خرج علينا رسول الله صلى الله عليه وسلم ‏.‏ بنحو حديثهم غير أنه لم يذكر أنه أم الناس في تلك الصلاة ‏.‏",
      "text_en": " Abu Qatada reported:                      As we were sitting in the mosque, the Messenger of Allah (may peace be upon him) came to us, and the rest of the hadith is the same except that he made no mention that he led people in this prayer.",
      "chain": [
        "30367",
        "20023",
        "30170",
        "20254",
        "11168",
        "1544",
        "391"
      ]
    },
    {
      "hadith_no": "4612",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "وحدثناه محمد بن المثنى، حدثنا أبو بكر، - يعني الحنفي - حدثنا عبد الحميد، بن جعفر حدثنا سعيد المقبري، أنه سمع أبا شريح الخزاعي، يقول سمعت أذناى، وبصر، عيني ووعاه قلبي حين تكلم به رسول الله صلى الله عليه وسلم ‏.‏ فذكر بمثل حديث الليث وذكر فيه ‏\"‏ ولا يحل لأحدكم أن يقيم عند أخيه حتى يؤثمه ‏\"‏ ‏.‏ بمثل ما في حديث وكيع ‏.‏",
      "text_en": " Sa'id al-Maqburi reported:                      I heard Abu Shuraih al-Khuzill saying: My ears heard and my eyes saw and my mind retained it, when Allah's Messenger (may peace be upon him) spok this, and he then narrated the hadith and made mention of this:\" It is not permissible for any one of you to stay with his brother until he makes him sinful.\"",
      "chain": [
        "30170",
        "20254",
        "11875",
        "11168",
        "5355"
      ]
    },
    {
      "hadith_no": "4689",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا أبو بكر الحنفي، حدثني عبد الحميد بن جعفر، حدثني سعيد بن أبي سعيد المقبري، أنه سمع أبا هريرة، يقول بعث رسول الله صلى الله عليه وسلم خيلا له نحو أرض نجد فجاءت برجل يقال له ثمامة بن أثال الحنفي سيد أهل اليمامة ‏.‏ وساق الحديث بمثل حديث الليث إلا أنه قال إن تقتلني تقتل ذا دم ‏.‏",
      "text_en": " The same tradition has been narrated by a different chain of transmitters with a slight difference in the wording.",
      "chain": [
        "30170",
        "20254",
        "11875",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "5254",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا أبو بكر، - يعني الحنفي - حدثنا عبد الحميد، بن جعفر حدثني أبي أنه، سمع أنس بن مالك، يقول لقد أنزل الله الآية التي حرم الله فيها الخمر وما بالمدينة شراب يشرب إلا من تمر ‏.‏",
      "text_en": " Anas b. Malik reported:                      Allah revealed the verse in which Allah prohibited the use of liquor. In those days no other liquor was drunk but that prepared from dates.",
      "chain": [
        "30170",
        "20254",
        "11875",
        "11833",
        "19"
      ]
    },
    {
      "hadith_no": "7484",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثناه محمد بن المثنى، حدثنا أبو بكر، - وهو الحنفي - حدثنا عبد الحميد، بن جعفر بهذا الإسناد نحوه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn Ja'far with the same chain of transmitters.",
      "chain": [
        "30170",
        "20254",
        "11875"
      ]
    },
    {
      "hadith_no": "7621",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا إسحاق بن إبراهيم، وعباس بن عبد العظيم، - واللفظ لإسحاق - قال عباس حدثنا وقال، إسحاق أخبرنا - أبو بكر الحنفي، حدثنا بكير بن مسمار، حدثني  عامر بن سعد، قال كان سعد بن أبي وقاص في إبله فجاءه ابنه عمر فلما رآه سعد قال أعوذ بالله من شر هذا الراكب فنزل فقال له أنزلت في إبلك وغنمك وتركت الناس يتنازعون الملك بينهم فضرب سعد في صدره فقال اسكت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الله يحب العبد التقي الغني الخفي ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Amir b. Sa'd that Sa'd b. Abi Waqqas was in the fold of his camels that his son 'Umar came to him. When Sa'd saw him he said:                      I seek refuge with Allah from the mischief of this rider. And as he got down he said to him: You are busy with your camels and your sheep and you have abandoned people who are contending with one another for kingdom. Sa'd struck his chest and said: Keep quite. I heard Allah's Messenger (may peace be upon him) as saying: Allah loves the servant who is God-conscious and is free from want and is hidden (from the view of people).",
      "chain": [
        "30123",
        "30437",
        "20254",
        "11832",
        "10554",
        "9"
      ]
    },
    {
      "hadith_no": "7663",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "وحدثناه إسحاق بن إبراهيم الحنظلي، حدثنا أبو بكر الحنفي، وعبد الملك بن، الصباح كلاهما عن عبد الحميد بن جعفر، بهذا الإسناد غير أن في، حديثهما ‏\"‏ بنى الله له بيتا في الجنة ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ja'far with the same chain of transmitters with this variation (that the words are):                     \" Allah would build for him a house in Paradise.\"",
      "chain": [
        "30021",
        "20254"
      ]
    },
    {
      "hadith_no": "1641",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن مسلمة، أخبرنا عيسى بن يونس، عن الأخضر بن عجلان، عن أبي بكر الحنفي، عن أنس بن مالك، أن رجلا، من الأنصار أتى النبي صلى الله عليه وسلم يسأله فقال ‏\"‏ أما في بيتك شىء ‏\"‏ ‏.‏ قال بلى حلس نلبس بعضه ونبسط بعضه وقعب نشرب فيه من الماء ‏.‏ قال ‏\"‏ ائتني بهما ‏\"‏ ‏.‏ فأتاه بهما فأخذهما رسول الله صلى الله عليه وسلم بيده وقال ‏\"‏ من يشتري هذين ‏\"‏ ‏.‏ قال رجل أنا آخذهما بدرهم ‏.‏ قال ‏\"‏ من يزيد على درهم ‏\"‏ ‏.‏ مرتين أو ثلاثا قال رجل أنا آخذهما بدرهمين ‏.‏ فأعطاهما إياه وأخذ الدرهمين وأعطاهما الأنصاري وقال ‏\"‏ اشتر بأحدهما طعاما فانبذه إلى أهلك واشتر بالآخر قدوما فأتني به ‏\"‏ ‏.‏ فأتاه به فشد فيه رسول الله صلى الله عليه وسلم عودا بيده ثم قال له ‏\"‏ اذهب فاحتطب وبع ولا أرينك خمسة عشر يوما ‏\"‏ ‏.‏ فذهب الرجل يحتطب ويبيع فجاء وقد أصاب عشرة دراهم فاشترى ببعضها ثوبا وببعضها طعاما ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هذا خير لك من أن تجيء المسألة نكتة في وجهك يوم القيامة إن المسألة لا تصلح إلا لثلاثة لذي فقر مدقع أو لذي غرم مفظع أو لذي دم موجع ‏\"‏ ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     A man of the Ansar came to the Prophet (ﷺ) and begged from him.  He (the Prophet) asked: Have you nothing in your house?  He replied: Yes, a piece of cloth, a part of which we wear and a part of which we spread (on the ground), and a wooden bowl from which we drink water.  He said: Bring them to me. He then brought these articles to him and he (the Prophet) took them in his hands and asked: Who will buy these?  A man said: I shall buy them for one dirham.  He said twice or thrice: Who will offer more than one dirham?  A man said: I shall buy them for two dirhams.  He gave these to him and took the two dirhams and, giving them to the Ansari, he said: Buy food with one of them and hand it to your family, and buy an axe and bring it to me. He then brought it to him. The Messenger of Allah (ﷺ) fixed a handle on it with his own hands and said: Go, gather firewood and sell it, and do not let me see you for a fortnight. The man went away and gathered firewood and sold it. When he had earned ten dirhams, he came to him and bought a garment with some of them and food with the others.  The Messenger of Allah (ﷺ) then said: This is better for you than that begging should come as a spot on your face on the Day of Judgment. Begging is right only for three people: one who is in grinding poverty, one who is seriously in debt, or one who is responsible for compensation and finds it difficult to pay.",
      "chain": [
        "20164",
        "20347",
        "19836",
        "20254",
        "19"
      ]
    },
    {
      "hadith_no": "2006",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو بكر، - يعني الحنفي - حدثنا أفلح، عن القاسم، عن عائشة، قالت خرجت معه - تعني مع النبي صلى الله عليه وسلم - في النفر الآخر فنزل المحصب - قال أبو داود ولم يذكر ابن بشار قصة بعثها إلى التنعيم في هذا الحديث - قالت ثم جئته بسحر فأذن في أصحابه بالرحيل فارتحل فمر بالبيت قبل صلاة الصبح فطاف به حين خرج ثم انصرف متوجها إلى المدينة ‏.‏",
      "text_en": " Narrated 'Aishah:                     I went out along with the Prophet (ﷺ) during his last march, and he alighted at al-Muhassab.Abu Dawud said: Ibn Bashshar did not mention that she was sent to al-Tan'im in this tradition. She said: I then came to him in the morning. He announced to his companions for departure, and he himself departed. He passed the house (the Ka'bah) before the dawn prayer, and went round it when he proceeded. He then went away facing Medina.",
      "chain": [
        "30160",
        "20254",
        "20156",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "3315",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو بكر الحنفي، حدثنا عبد الحميد بن جعفر، عن عمرو بن شعيب، عن ميمونة بنت كردم بن سفيان، عن أبيها، نحوه مختصر منه شىء قال ‏:‏ ‏\"‏ هل بها وثن أو عيد من أعياد الجاهلية ‏\"‏ ‏.‏ قال ‏:‏ لا ‏.‏ قلت ‏:‏ إن أمي هذه عليها نذر ومشى أفأقضيه عنها وربما قال ابن بشار ‏:‏ أنقضيه عنها قال ‏:‏ ‏\"‏ نعم ‏\"‏ ‏.‏",
      "text_en": " A similar tradition has also been transmitted in brief by Maimunah daughter of Kardam son of Sufyan on the authority of her father through a different chain of narrators. This version adds:                      (The Prophet asked): Does it contain an idol or was a festival of pre-Islamic times celebrated there ? He replied: No. I said: This mother of mine has taken a vow and walking (is binding on her). May I fulfill it on her behalf ? Sometimes the narrator Bashshar said: May we fulfill in on her behalf ? He said: Yes.",
      "chain": [
        "30160",
        "20254",
        "11875",
        "19934",
        "4015",
        "4016"
      ]
    },
    {
      "hadith_no": "3759",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا علي بن مسلم الطوسي، حدثنا أبو بكر الحنفي، حدثنا الضحاك بن عثمان، عن عبد الله بن عبيد بن عمير، قال كنت مع أبي في زمان ابن الزبير إلى جنب عبد الله بن عمر فقال عباد بن عبد الله بن الزبير إنا سمعنا أنه، يبدأ بالعشاء قبل الصلاة ‏.‏ فقال عبد الله بن عمر ويحك ما كان عشاؤهم أتراه كان مثل عشاء أبيك ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     Abdullah ibn Ubaydullah ibn Umayr said: I was with my father in the time of Ibn az-Zubayr sitting beside Abdullah ibn Umar. Then Abbad ibn Abdullah ibn az-Zubayr said: We have heard that the evening meal is taken just before the night prayer. Thereupon Abdullah ibn Umar said: Woe to you! what was their evening meal? Do you think it was like the meal of your father?",
      "chain": [
        "30261",
        "20254",
        "20504",
        "10643"
      ]
    },
    {
      "hadith_no": "318",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا بندار، حدثنا أبو بكر الحنفي، حدثنا عبد الحميد بن جعفر، عن أبيه، عن محمود بن لبيد، عن عثمان بن عفان، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ من بنى لله مسجدا بنى الله له مثله في الجنة ‏\"‏ ‏.‏ قال وفي الباب عن أبي بكر وعمر وعلي وعبد الله بن عمرو وأنس وابن عباس وعائشة وأم حبيبة وأبي ذر وعمرو بن عبسة وواثلة بن الأسقع وأبي هريرة وجابر بن عبد الله ‏.‏ قال أبو عيسى حديث عثمان حديث حسن صحيح ‏.‏ ومحمود بن لبيد قد أدرك النبي صلى الله عليه وسلم ومحمود بن الربيع قد رأى النبي صلى الله عليه وسلم وهما غلامان صغيران مدنيان ‏.‏",
      "text_en": " Uthman bin Affan narrated that :                     he heard Allah's Messenger say: \"Whoever builds a Masjid for (the sake of) Allah, then Allah will build a similar house for him in Paradise.\"",
      "chain": [
        "30160",
        "20254",
        "11875",
        "11833",
        "1830",
        "4"
      ]
    },
    {
      "hadith_no": "1373",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو بكر الحنفي، أخبرنا الضحاك بن عثمان، حدثني سالم أبو النضر، عن بسر بن سعيد، عن زيد بن خالد الجهني، أن رسول الله صلى الله عليه وسلم سئل عن اللقطة فقال ‏\"‏ عرفها سنة فإن اعترفت فأدها وإلا فاعرف وعاءها وعفاصها ووكاءها وعددها ثم كلها فإذا جاء صاحبها فأدها ‏\"‏ ‏.‏ قال أبو عيسى حديث زيد بن خالد حديث حسن صحيح غريب من هذا الوجه ‏.‏ قال أحمد أصح شيء في هذا الباب هذا الحديث ‏.‏",
      "text_en": " Zaid bin Khalid Al-Juhni narrated that the Messenger of Allah (ﷺ) was asked about the lost item. He said:                      \"Make a public announcement about it for one year, if it is claimed then give it to him. Otherwise remember its sack, string, and its count. Then use it, and if its owner comes, give it to him.\"",
      "chain": [
        "30160",
        "20254",
        "20504",
        "11164",
        "11153",
        "3625"
      ]
    },
    {
      "hadith_no": "1505",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثني يحيى بن موسى، حدثنا أبو بكر الحنفي، حدثنا الضحاك بن عثمان، حدثني عمارة بن عبد الله، قال سمعت عطاء بن يسار، يقول سألت أبا أيوب الأنصاري كيف كانت الضحايا على عهد رسول الله صلى الله عليه وسلم فقال كان الرجل يضحي بالشاة عنه وعن أهل بيته فيأكلون ويطعمون حتى تباهى الناس فصارت كما ترى ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وعمارة بن عبد الله هو مدني وقد روى عنه مالك بن أنس ‏.‏ والعمل على هذا عند بعض أهل العلم وهو قول أحمد وإسحاق واحتجا بحديث النبي صلى الله عليه وسلم أنه ضحى بكبش فقال ‏\"‏ هذا عمن لم يضح من أمتي ‏\"‏ ‏.‏ وقال بعض أهل العلم لا تجزئ الشاة إلا عن نفس واحدة وهو قول عبد الله بن المبارك وغيره من أهل العلم ‏.‏",
      "text_en": " Narrated 'Ata bin Yasar:                     \"I asked Abu Abyub [Al-Ansari] how the slaughtering was done during the time of the Messenger of Allah (ﷺ). He said: 'A man would sacrifice a sheep for himself and the people in his household. They would eat from it and feed others, until the people (later) would boast about it and it became as you see now.\"",
      "chain": [
        "30221",
        "20254",
        "20504",
        "11020"
      ]
    },
    {
      "hadith_no": "2228",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن بشار العبدي، حدثنا أبو بكر الحنفي، عن عبد الحميد بن جعفر، عن عمر بن الحكم، قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يذهب الليل والنهار حتى يملك رجل من الموالي يقال له جهجاه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah(s.a.w) said:                     \"The night and the day shall not go away until a man called Jahjah among the Mawali reigns.\"",
      "chain": [
        "30160",
        "20254",
        "11875",
        "11897",
        "13"
      ]
    },
    {
      "hadith_no": "3018",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو بكر الحنفي، عن سعيد، عن قتادة، عن الحسن، عن عمران بن حصين، قال قال لي النبي صلى الله عليه وسلم ‏\"‏ إن خير طيب الرجل ما ظهر ريحه وخفي لونه وخير طيب النساء ما ظهر لونه وخفي ريحه ‏\"‏ ‏.‏ ونهى عن ميثرة الأرجوان ‏.‏ هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated 'Imran bin Husain:                     \"The Prophet (ﷺ) said [to me]: 'Indeed the best fragrance for men is what's scent is apparent and its color is hidden, and the best fragrance for women is what's color is visible and its scent is hidden.' And he prohibited Mitharatil-Urjawan (Mitharah was some type of saddle cloth. Some of the people of knowledge say it was a certain kind of cloth made of silk, and it preceded earlier under no. 1760. They disagree over Al-Urjawan, and perhaps it means whatever is red, meaning the Red Mitahrah, see Tuhfat Al-Ahwadhi).\"",
      "chain": [
        "30160",
        "20254",
        "11168",
        "11019",
        "11016",
        "123"
      ]
    },
    {
      "hadith_no": "3158",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو بكر الحنفي، حدثنا الضحاك بن عثمان، عن أيوب بن موسى، قال سمعت محمد بن كعب القرظي، قال سمعت عبد الله بن مسعود، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من قرأ حرفا من كتاب الله فله به حسنة والحسنة بعشر أمثالها لا أقول الم حرف ولكن ألف حرف ولام حرف وميم حرف ‏\"‏ ‏.‏ ويروى هذا الحديث من غير هذا الوجه عن ابن مسعود ورواه أبو الأحوص عن ابن مسعود رفعه بعضهم ووقفه بعضهم عن ابن مسعود ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏ سمعت قتيبة بن سعيد يقول بلغني أن محمد بن كعب القرظي ولد في حياة النبي صلى الله عليه وسلم ومحمد بن كعب القرظي يكنى أبا حمزة ‏.‏",
      "text_en": " Narrated Muhammad bin Ka'b Al-Qurazi:                     \"I heard 'Abdullah bin Mas'ud saying: 'The Messenger of Allah (ﷺ) said: \"[Whoever recites a letter] from Allah's Book, then he receives the reward from it, and the reward of ten the like of it. I do not say that Alif Lam Mim is a letter, but Alif is a letter, Lam is a letter and Mim is a letter.\"",
      "chain": [
        "30160",
        "20254",
        "20504",
        "11241",
        "11221",
        "16"
      ]
    },
    {
      "hadith_no": "2324",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عبد الله بن الهيثم، قال حدثنا أبو بكر الحنفي، قال حدثنا سفيان، عن طلحة بن يحيى، عن مجاهد، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يجيء ويقول ‏\"‏ هل عندكم غداء ‏\"‏ ‏.‏ فنقول لا ‏.‏ فيقول ‏\"‏ إني صائم ‏\"‏ ‏.‏ فأتانا يوما وقد أهدي لنا حيس فقال ‏\"‏ هل عندكم شىء ‏\"‏ ‏.‏ قلنا نعم أهدي لنا حيس ‏.‏ قال ‏\"‏ أما إني قد أصبحت أريد الصوم ‏\"‏ ‏.‏ فأكل خالفه قاسم بن يزيد ‏.‏",
      "text_en": " It was narrated that 'Aishah said the Messenger of Allah would come and say:                     \"Do you have any food for breakfast?\" and we would say no, so he would say: \"I am fasting.\" One day he came to us and we had been given some Hais. He said: \"Do you have anything (to eat)?\" and we said: \"Yes, we have been given some Hais.\" He said: \"I started the day wanting to fast,\" but then he ate.",
      "chain": [
        "34121",
        "20254",
        "20012",
        "11863",
        "11028",
        "53"
      ]
    },
    {
      "hadith_no": "3596",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Endowments - كتاب الإحباس",
      "chapter_no": "29",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا أبو بكر الحنفي، قال حدثنا يونس بن أبي إسحاق، عن أبيه، قال سمعت عمرو بن الحارث، يقول رأيت رسول الله صلى الله عليه وسلم ما ترك إلا بغلته الشهباء وسلاحه وأرضا تركها صدقة ‏.‏",
      "text_en": " Yunus bin Abi Ishaq narrated that his father said:                      \"I heard 'Amr bin Al-Harith say: 'I saw the Messenger of Allah and he left nothing behind except his white mule, his weapon and some land which he left as a charity.'\"",
      "chain": [
        "30153",
        "20254",
        "10846",
        "11049",
        "20377"
      ]
    },
    {
      "hadith_no": "4508",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا المعتمر، وعيسى بن يونس، قالا حدثنا الأخضر بن عجلان، عن أبي بكر الحنفي، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم باع قدحا وحلسا فيمن يزيد ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that:                     the Messenger of Allah sold a drinking bowl and a blanket (for a horse of camel) to the highest bidder '",
      "chain": [
        "30123",
        "20288",
        "20347",
        "19836",
        "20254",
        "19"
      ]
    },
    {
      "hadith_no": "322",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا أبو بكر الحنفي، حدثنا همام بن يحيى، عن ابن جريج، عن الزهري، عن أنس بن مالك، أن النبي  صلى الله عليه وسلم  كان إذا دخل الخلاء وضع خاتمه ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that:                     When the Prophet entered the toilet, he would take off his ring.",
      "chain": [
        "30395",
        "20254",
        "20297",
        "11070",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "570",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو بكر الحنفي، حدثنا أسامة بن زيد، عن عمرو بن شعيب، عن أم كرز، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ بول الغلام ينضح وبول الجارية يغسل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Kurz that:                     The Messenger of Allah said: \"The urine of a boy should be sprinkled over and the urine of a girl should be washed.\"",
      "chain": [
        "30160",
        "20254",
        "50",
        "19934"
      ]
    },
    {
      "hadith_no": "736",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو بكر الحنفي، حدثنا عبد الحميد بن جعفر، عن أبيه، عن محمود بن لبيد، عن عثمان بن عفان، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ من بنى لله مسجدا بنى الله له مثله في الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uthman bin 'Affan said:                     \"I heard the Messenger of Allah say: 'Whoever builds a mosque for the sake of Allah, Allah will build something similar for him in Paradise.'\"",
      "chain": [
        "30160",
        "20254",
        "11875",
        "11833",
        "1830",
        "4"
      ]
    },
    {
      "hadith_no": "773",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو بكر الحنفي، حدثنا الضحاك بن عثمان، حدثني سعيد المقبري، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إذا دخل أحدكم المسجد فليسلم على النبي  صلى الله عليه وسلم  وليقل اللهم افتح لي أبواب رحمتك وإذا خرج فليسلم على النبي وليقل اللهم اعصمني من الشيطان الرجيم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Mesenger of Allah said: \"When anyone of enters the mosque, let him send peace upon the Prophet, then let him say: 'Allahumma aftahli abwaba rahmatik (O Allah, open to me the gates of Your mercy).' And when he leaves, let him send peace upon the Prophet and say: 'Allahumma- simni minash-shaitanir-rajim (O Allah, protect me from the accursed Shaitan).'\"",
      "chain": [
        "30160",
        "20254",
        "20504",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "790",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن معمر، حدثنا أبو بكر الحنفي، حدثنا يونس بن أبي إسحاق، عن أبيه، عن عبد الله بن أبي بصير، عن أبيه، عن أبى بن كعب، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ صلاة الرجل في جماعة تزيد على صلاة الرجل وحده أربعا وعشرين أو خمسا وعشرين درجة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ubayy bin Ka'b said:                     \"The Messenger of Allah said: 'The prayer of a man in congregation is higher than his prayer on his own by twenty-four or twenty-five levels.\"",
      "chain": [
        "30172",
        "20254",
        "10846",
        "11049",
        "39"
      ]
    },
    {
      "hadith_no": "876",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو بكر الحنفي، حدثنا الضحاك بن عثمان، حدثني بكير بن عبد الله بن الأشج، عن سليمان بن يسار، عن أبي هريرة، قال ما رأيت أحدا أشبه صلاة برسول الله  صلى الله عليه وسلم  من فلان ‏.‏ قال وكان يطيل الأوليين من الظهر ويخفف الأخريين ويخفف العصر ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “I have never seen anyonewhoseprayer more closely resembles that of the Messenger of Allah(ﷺ)than so-and-so. He used to lengthen the first two Rak’ah of theZuhr and shorten the last two Rak’ah, and he used to shorten the‘Asr.”",
      "chain": [
        "30160",
        "20254",
        "20504",
        "11154",
        "11005",
        "13"
      ]
    },
    {
      "hadith_no": "1027",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا بكر بن خلف أبو بشر، حدثنا أبو بكر الحنفي، حدثنا الضحاك بن عثمان، حدثنا شرحبيل، قال سمعت جابر بن عبد الله، يقول كان رسول الله  صلى الله عليه وسلم  يصلي المغرب فجئت فقمت عن يساره فأقامني عن يمينه ‏.‏",
      "text_en": " Shurahbilsaid:                      “I heard Jabir bin ‘Abdullah say: ‘The Messenger ofAllah(ﷺ) was performing Maghrib, and I came and stood on his left,buthe made me stand on his right.’”",
      "chain": [
        "34043",
        "20254",
        "20504",
        "34"
      ]
    },
    {
      "hadith_no": "2238",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا يحيى بن حكيم، حدثنا أبو بكر الحنفي، حدثنا الهيثم بن رافع، حدثني أبو يحيى المكي، عن فروخ، مولى عثمان بن عفان عن عمر بن الخطاب، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ من احتكر على المسلمين طعامهم ضربه الله بالجذام والإفلاس ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Umar bin Khattab said:                     \"I heard the Messenger of Allah (ﷺ) say: 'Whoever hoards food (and keeps it from) the Muslims, Allah will afflict him with leprosy and bankruptcy.\"'",
      "chain": [
        "34280",
        "20254",
        "19121",
        "13151",
        "3"
      ]
    },
    {
      "hadith_no": "2282",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا هشام بن عمار، حدثنا عيسى بن يونس، حدثنا الأخضر بن عجلان، حدثنا أبو بكر الحنفي، عن أنس بن مالك، أن رجلا، من الأنصار جاء إلى النبي  صلى الله عليه وسلم  يسأله فقال ‏\"‏ لك في بيتك شىء ‏\"‏ ‏.‏ قال بلى حلس نلبس بعضه ونبسط بعضه وقدح نشرب فيه الماء ‏.‏ قال ‏\"‏ ائتني بهما ‏\"‏ ‏.‏ قال فأتاه بهما فأخذهما رسول الله  صلى الله عليه وسلم  بيده ثم قال ‏\"‏ من يشتري هذين ‏\"‏ ‏.‏ فقال رجل أنا آخذهما بدرهم ‏.‏ قال ‏\"‏ من يزيد على درهم ‏\"‏ ‏.‏ مرتين أو ثلاثا قال رجل أنا آخذهما بدرهمين ‏.‏ فأعطاهما إياه وأخذ الدرهمين فأعطاهما الأنصاري وقال ‏\"‏ اشتر بأحدهما طعاما فانبذه إلى أهلك واشتر بالآخر قدوما فأتني به ‏\"‏ ‏.‏ ففعل فأخذه رسول الله  صلى الله عليه وسلم  فشد فيه عودا بيده وقال ‏\"‏ اذهب فاحتطب ولا أراك خمسة عشر يوما ‏\"‏ ‏.‏ فجعل يحتطب ويبيع فجاء وقد أصاب عشرة دراهم فقال ‏\"‏ اشتر ببعضها طعاما وببعضها ثوبا ‏\"‏ ‏.‏ ثم قال ‏\"‏ هذا خير لك من أن تجيء والمسألة نكتة في وجهك يوم القيامة إن المسألة لا تصلح إلا لذي فقر مدقع أو لذي غرم مفظع أو دم موجع ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that :                     a man from among the Ansar came to the Prophet (ﷺ) and begged from him. He said, \"Do you have anything in your house?\" He said: \"Yes, a blanket, part of which we cover ourselves with and part we spread beneath us, and a bowl from which we drink water.\" He said: \"Givethem to me.\" So he brought them to him, and the Messenger of Allah (ﷺ) took them in his hand and said, \"Who will by these two things?\" A man said: \"I will by them for one Dirham.\" He said: \"Who will offer more than a Dirham?\" two or three times. A man said: \"I will buy them for two Dirham.\" So he gave them to him and took the two Dirham, which he gave to the Ansari and said: \"Buy food with one of them and give it to your family, and buy an axe with the other and bring it to me.\" So he did that, and the Messenger of Allah (ﷺ) took it and fixed a handle to it, and said: \"Go and gather firewood, and I do not want to see you for fifteen days.\" So he went and gathered firewood and sold it, then he came back, and he had earned ten Dirham. (The Prophet (ﷺ)) said: \"Buy food with some of it and clothes with some.\" Then he said: \"This is better for you than coming with begging (appearing)  as a spot on your face on the Day of Resurrection. Begging is only appropriate for one who is extremely poor or who is in severe debt, or one who must pay painful blood money.”[1]",
      "chain": [
        "30288",
        "20347",
        "19836",
        "20254",
        "19"
      ]
    },
    {
      "hadith_no": "2603",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Lost Property - كتاب اللقطة",
      "chapter_no": "18",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو بكر الحنفي، ح وحدثنا حرملة بن يحيى، حدثنا عبد الله بن وهب، قالا حدثنا الضحاك بن عثمان القرشي، حدثني سالم أبو النضر، عن بسر بن سعيد، عن زيد بن خالد الجهني، ‏.‏ أن رسول الله صلى الله عليه وسلم سئل عن اللقطة فقال ‏\"‏ عرفها سنة فإن اعترفت فأدها فإن لم تعرف فاعرف عفاصها ووعاءها ثم كلها فإن جاء صاحبها فأدها إليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Zaid bin Khalid Al-Juhani that the Messenger of Allah (ﷺ) was asked about lost property. :                     He said: “Announce it for a year, then if someone describes it with its features, return it to him. If no one claims it, then remember the features of its leather bag and strap, and consume it (use it). Then if its owner comes along, give it to him.”",
      "chain": [
        "30160",
        "20254",
        "30487",
        "20029",
        "20504",
        "11164",
        "11153",
        "3625"
      ]
    },
    {
      "hadith_no": "3281",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو بكر الحنفي، حدثنا أسامة بن زيد، عن نافع، عن ابن عمر، عن النبي  صلى الله عليه وسلم  أنه كان يذبح بالمصلى ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Umar that the Prophet (ﷺ) used toslaughter atthe prayer place (of the ‘Eid congregation).",
      "chain": [
        "30160",
        "20254",
        "50",
        "11014",
        "18"
      ]
    }
  ],
  "total_hadiths": 33
}