{
  "id": "20255",
  "name": "'Abdul Malik bin al-Sbah al-Msm'y عبد الملك بن الصباح المسمعي",
  "full_name": "'Abdul Malik bin al-Sbah al-Msm'y عبد الملك بن الصباح المسمعي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "200",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Sana'",
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  م  س  ق  -  صدوق ]"
    ],
    "tags": [
      "al-Sana'i",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11071",
      "name": "'Abdullah bin 'Awn bin Artaban عبد الله بن عون بن أرطبان الخزار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11311",
      "name": "Hisham bin Hassan al-Azdi هشام بن حسان الأزدي القردوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11875",
      "name": "'Abdul Hameed bin Ja'far عبد الحميد بن جعفر بن عبد الله",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10709",
      "name": "'Imran bin Hdyr عمران بن حدير",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20415",
      "name": "Thaur bin Yazid al-Rahbi ثور بن يزيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30160",
      "name": "Muhammad bin Bashar Bindar محمد بن بشار بندار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30456",
      "name": "Malik bin Abd al-Wahd مالك بن عبد الواحد أبو غسان المسمعي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38667",
      "name": "Nasayr bin al-Farj نصير بن الفرج",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "34280",
      "name": "Yahya bin Hakeem al-Maquuam يحيى بن حكيم المقوم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "138",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو غسان المسمعي، مالك بن عبد الواحد حدثنا عبد الملك بن الصباح، عن شعبة، عن واقد بن محمد بن زيد بن عبد الله بن عمر، عن أبيه، عن عبد الله بن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأن محمدا رسول الله ويقيموا الصلاة ويؤتوا الزكاة فإذا فعلوا عصموا مني دماءهم وأموالهم إلا بحقها وحسابهم على الله ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abdullah b. 'Umar that the Messenger of Allah said:                      I have been commanded to fight against people till they testify that there is no god but Allah, that Muhammad is the messenger of Allah, and they establish prayer, and pay Zakat and if they do it, their blood and property are guaranteed protection on my behalf except when justified by law, and their affairs rest with Allah.",
      "chain": [
        "30456",
        "20255",
        "20020",
        "11544",
        "11217",
        "18"
      ]
    },
    {
      "hadith_no": "361",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الملك بن الصباح، حدثنا ثور بن يزيد، عن حصين الحميري، عن أبي سعيد الخير، عن أبي هريرة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ من استجمر فليوتر من فعل ذلك فقد أحسن ومن لا فلا حرج ومن تخلل فليلفظ ومن لاك فليبتلع من فعل ذلك فقد أحسن ومن لا فلا حرج ومن أتى الخلاء فليستتر فإن لم يجد إلا كثيبا من رمل فليمدده عليه فإن الشيطان يلعب بمقاعد ابن آدم من فعل فقد أحسن ومن لا فلا حرج ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Prophet said: \"Whoever uses stones to clean himself, let him use an odd number of stones. Whoever does that has done well, and whoever does not, there is no harm in it. Whoever uses a tooth stick should spit out (whatever he removes) and whoever removes (the particle of food) by dislodging it with his tongue should swallow it. Whoever does that has done well, and whoever does not, tere is no harm in it. Whoever goes to the toilet should conceal himself, and if he cannot find anything except a pile of sand (behind which to conceal himself), then he should use that, for the Shaitan plays with the backside of the son of Adam. Whoever does that has done well, and whoever does not, there is no harm in it.\"",
      "chain": [
        "30160",
        "20255",
        "20415",
        "13"
      ]
    },
    {
      "hadith_no": "3627",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا عبد الرحمن بن عمر، حدثنا عبد الملك بن الصباح، عن ثور بن يزيد، عن حصين الحميري، عن أبي سعد الخير، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ من اكتحل فليوتر من فعل فقد أحسن ومن لا فلا حرج ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) said:                     “Whoeverapplies kohl, let him do it an odd number of times. Whoeverdoes thathas done well, and whoever does not, it does not matter.”",
      "chain": [
        "20255",
        "20415",
        "13"
      ]
    }
  ],
  "total_hadiths": 3
}