{
  "id": "20250",
  "name": "'Abdul Samad bin 'Abdul Warith bin Sa'id عبد الصمد بن عبد الوارث بن سعيد",
  "full_name": "'Abdul Samad bin 'Abdul Warith bin Sa'id عبد الصمد بن عبد الوارث بن سعيد",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "207",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-'Anbari",
      "Client",
      "al-Basri"
    ]
  },
  "parents": [
    {
      "id": "20258",
      "name": "'Abdul Warith bin Sa'id bin Dhakwan عبد الوارث بن سعيد بن ذكوان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "30552",
      "name": "'Abdul Warith bin 'Abdul Samad عبد الوارث بن عبد الصمد بن عبد الوارث",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "teachers": [
    {
      "id": "20258",
      "name": "'Abdul Warith bin Sa'id bin Dhakwan عبد الوارث بن سعيد بن ذكوان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "10704",
      "name": "'Ikrama bin 'Ammar عكرمة بن عمار العجلي أبو عمار اليمامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20220",
      "name": "Harb bin Shadaad al-Yashkari حرب بن شداد اليشكري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20236",
      "name": "Sulaiman bin al-Mughira al-Qaysy سليمان بن المغيرة القيسي مولاهم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20253",
      "name": "'Abdul 'Aziz bin Muslim al-Qasimali عبد العزيز بن مسلم القسملي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20295",
      "name": "Hisham bin Abi 'Abdullah al-Dastawa'i هشام بن أبي عبد الله الدستوائي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20297",
      "name": "Hmam bin Yahya bin Dinar همام بن يحيى بن دينار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10716",
      "name": "al-Mstmr bin al-Ryan المستمر بن الريان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20535",
      "name": "Hrb bin Abi al-'Alih حرب بن أبي العالية",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20541",
      "name": "Rabi'a bin Khultum bin Jabir ربيعة بن كلثوم بن جبر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20439",
      "name": "'Abdur Rahman bin 'Abdullah bin Dinar عبد الرحمن بن عبد الله بن دينار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11304",
      "name": "al-Muthna bin Sa'id al-Daba'i المثنى بن سعيد الضبعي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "30552",
      "name": "'Abdul Warith bin 'Abdul Samad عبد الوارث بن عبد الصمد بن عبد الوارث",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30313",
      "name": "Ishaq bin Mansur al-Kausaj إسحاق بن منصور بن بهرام - الكوسج",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38834",
      "name": "Hajjaj bin Yusuf bin al-Sha'ir حجاج بن يوسف الشاعر",
      "grade": "3rd Century AH"
    },
    {
      "id": "30149",
      "name": "'Abdah bin 'Abdullah al-Saffar عبدة بن عبد الله الصفار",
      "grade": "3rd Century AH"
    },
    {
      "id": "30553",
      "name": "'Abd bin Hameed bin Nasr عبد بن حميد بن نصر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30351",
      "name": "'Abdullah bin Muhammad al-Musandi عبد الله بن محمد المسندي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30494",
      "name": "Ahmed bin Ibrahim bin Kathir أحمد بن إبراهيم بن كثير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30524",
      "name": "Harun bin 'Abdullah al-Hamal هارون بن عبد الله بن مروان الحمال",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30160",
      "name": "Muhammad bin Bashar Bindar محمد بن بشار بندار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30261",
      "name": "'Ali bin Muslim bin Sa'id علي بن مسلم بن سعيد الطوسي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "94",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبدة، قال حدثنا عبد الصمد، قال حدثنا عبد الله بن المثنى، قال حدثنا ثمامة بن عبد الله، عن أنس، عن النبي صلى الله عليه وسلم أنه كان إذا سلم سلم ثلاثا، وإذا تكلم بكلمة أعادها ثلاثا‏.‏",
      "text_en": " Narrated Anas:                     Whenever the Prophet asked permission to enter, he knocked the door thrice with greeting and whenever he spoke a sentence (said a thing) he used to repeat it thrice. (See Hadith No. 261, Vol. 8).",
      "chain": [
        "20337",
        "20250",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "95",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبدة بن عبد الله، حدثنا عبد الصمد، قال حدثنا عبد الله بن المثنى، قال حدثنا ثمامة بن عبد الله، عن أنس، عن النبي صلى الله عليه وسلم أنه كان إذا تكلم بكلمة أعادها ثلاثا حتى تفهم عنه، وإذا أتى على قوم فسلم عليهم سلم عليهم ثلاثا‏.‏",
      "text_en": " Narrated Anas:                     Whenever the Prophet spoke a sentence (said a thing), he used to repeat it thrice so that the people could understand it properly from him and whenever he asked permission to enter, (he knocked the door) thrice with greeting.",
      "chain": [
        "30149",
        "20250",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "173",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا إسحاق، أخبرنا عبد الصمد، حدثنا عبد الرحمن بن عبد الله بن دينار، سمعت أبي، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏\"‏ أن رجلا رأى كلبا يأكل الثرى من العطش، فأخذ الرجل خفه فجعل يغرف له به حتى أرواه، فشكر الله له فأدخله الجنة ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          The Prophet said, \"A man saw a dog eating mud from (the severity of)      thirst. So, that man took a shoe (and filled it) with water and kept      on pouring the water for the dog till it quenched its thirst. So Allah     approved of his deed and made him to enter Paradise.\"",
      "chain": [
        "30312",
        "20250",
        "20439",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "251",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثني عبد الصمد، قال حدثني شعبة، قال حدثني أبو بكر بن حفص، قال سمعت أبا سلمة، يقول دخلت أنا وأخو، عائشة على عائشة فسألها أخوها عن غسل النبي، صلى الله عليه وسلم فدعت بإناء نحوا من صاع، فاغتسلت وأفاضت على رأسها، وبيننا وبينها حجاب‏.‏ قال أبو عبد الله قال يزيد بن هارون وبهز والجدي عن شعبة قدر صاع‏.‏",
      "text_en": " Narrated Abu Salama:                     `Aisha's brother and I went to `Aisha and he asked her about the bath of the Prophet. She brought a pot containing about a Sa` of water and took a bath and poured it over her head and at what time there was a screen between her and us.",
      "chain": [
        "30351",
        "20250",
        "20020",
        "11180",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "1110",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا إسحاق، حدثنا عبد الصمد، حدثنا حرب، حدثنا يحيى، قال حدثني حفص بن عبيد الله بن أنس، أن أنسا  رضى الله عنه  حدثه أن رسول الله صلى الله عليه وسلم كان يجمع بين هاتين الصلاتين في السفر‏.‏ يعني المغرب والعشاء‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Whenever the Prophet started a journey before noon, he used to delay the Zuhr prayer till the time of `Asr and then offer them together; and if the sun declined (at noon) he used to offer the Zuhr prayer and then ride (for the journey).",
      "chain": [
        "30021",
        "20250",
        "20220",
        "11449",
        "11686",
        "19"
      ]
    },
    {
      "hadith_no": "1427",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عياش، حدثنا عبد الأعلى، حدثنا الجريري، عن أبي العلاء، عن الأحنف بن قيس، قال جلست‏.‏ وحدثني إسحاق بن منصور، أخبرنا عبد الصمد، قال حدثني أبي، حدثنا الجريري، حدثنا أبو العلاء بن الشخير، أن الأحنف بن قيس، حدثهم قال جلست إلى ملإ من قريش، فجاء رجل خشن الشعر والثياب والهيئة حتى قام عليهم فسلم ثم قال بشر الكانزين برضف يحمى عليه في نار جهنم، ثم يوضع على حلمة ثدى أحدهم حتى يخرج من نغض كتفه، ويوضع على نغض كتفه حتى يخرج من حلمة ثديه يتزلزل، ثم ولى فجلس إلى سارية، وتبعته وجلست إليه، وأنا لا أدري من هو فقلت له لا أرى القوم إلا قد كرهوا الذي قلت‏.‏ قال إنهم لا يعقلون شيئا‏.‏ قال لي خليلي  قال قلت من خليلك قال النبي صلى الله عليه وسلم  ‏\"‏ يا أبا ذر أتبصر أحدا ‏\"‏‏.‏ قال فنظرت إلى الشمس ما بقي من النهار وأنا أرى أن رسول الله صلى الله عليه وسلم يرسلني في حاجة له، قلت نعم‏.‏ قال ‏\"‏ ما أحب أن لي مثل أحد ذهبا أنفقه كله إلا ثلاثة دنانير ‏\"‏‏.‏ وإن هؤلاء لا يعقلون، إنما يجمعون الدنيا‏.‏ لا والله لا أسألهم دنيا، ولا أستفتيهم عن دين حتى ألقى الله‏.‏",
      "text_en": " Narrated Al-Ahnaf bin Qais:                     While I was sitting with some people from Quraish, a man with very rough hair, clothes, and appearance came and stood in front of us, greeted us and said, \"Inform those who hoard wealth, that a stone will be heated in the Hell-fire and will be put on the nipples of their breasts till it comes out from the bones of their shoulders and then put on the bones of their shoulders till it comes through the nipples of their breasts the stone will be moving and hitting.\" After saying that, the person retreated and sat by the side of the pillar, I followed him and sat beside him, and I did not know who he was. I said to him, \"I think the people disliked what you had said.\" He said, \"These people do not understand anything, although my friend told me.\" I asked, \"Who is your friend?\" He said, \"The Prophet said (to me), 'O Abu Dhar! Do you see the mountain of Uhud?' And on that I (Abu Dhar) started looking towards the sun to judge how much remained of the day as I thought that Allah's Apostle wanted to send me to do something for him and I said, 'Yes!' He said, 'I do not love to have gold equal to the mountain of Uhud unless I spend it all (in Allah's cause) except three Dinars (pounds). These people do not understand and collect worldly wealth. No, by Allah, Neither I ask them for worldly benefits nor am I in need of their religious advice till I meet Allah, The Honorable, The Majestic.\" '",
      "chain": [
        "30157",
        "20246",
        "11286",
        "11112",
        "30313",
        "20250",
        "20258",
        "11286",
        "11318",
        "11112"
      ]
    },
    {
      "hadith_no": "1583",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا الحسن بن علي الخلال الهذلي، حدثنا عبد الصمد، حدثنا سليم بن حيان، قال سمعت مروان الأصفر، عن أنس بن مالك  رضى الله عنه  قال قدم علي  رضى الله عنه  على النبي صلى الله عليه وسلم من اليمن فقال ‏\"‏ بما أهللت ‏\"‏‏.‏ قال بما أهل به النبي صلى الله عليه وسلم‏.‏ فقال ‏\"‏ لولا أن معي الهدى لأحللت ‏\"‏‏.‏ وزاد محمد بن بكر عن ابن جريج قال له النبي صلى الله عليه وسلم ‏\"‏ بما أهللت يا علي ‏\"‏‏.‏ قال بما أهل به النبي صلى الله عليه وسلم قال ‏\"‏ فأهد وامكث حراما كما أنت ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     `Ali came to the Prophet (p.b.u.h) from Yemen (to Mecca). The Prophet asked `Ali, \"With what intention have you assumed Ihram?\" `Ali replied, \"I have assumed Ihram with the same intention as that of the Prophet.\" The Prophet said, \"If I had not the Hadi with me I would have finished the Ihram.\" Muhammad bin Bakr narrated extra from Ibn Juraij, \"The Prophet said to `Ali, \"With what intention have you assumed the Ihram, O `Ali?\" He replied, \"With the same (intention) as that of the Prophet.\" The Prophet said, \"Have a Hadi and keep your Ihram as it is.\"",
      "chain": [
        "30",
        "20250",
        "20234",
        "11611",
        "19"
      ]
    },
    {
      "hadith_no": "2774",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا إسحاق، حدثنا عبد الصمد، قال سمعت أبي، حدثنا أبو التياح، قال حدثني أنس بن مالك  رضى الله عنه  لما قدم رسول الله صلى الله عليه وسلم المدينة أمر بالمسجد وقال ‏\"‏ يا بني النجار ثامنوني بحائطكم هذا ‏\"‏‏.‏ قالوا لا والله لا نطلب ثمنه إلا إلى الله‏.‏",
      "text_en": " Narrated Anas bin Malik:                     When Allah's Apostle came to Medina, he ordered that a mosque be built. He said, \"O Bani An- Najjar! Suggest me a price for the garden of yours.\" They replied, \"By Allah, we will not ask its price except from Allah.\"",
      "chain": [
        "30021",
        "20250",
        "20258",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "3382",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا عبد الصمد، حدثنا عبد الرحمن بن عبد الله، عن أبيه، عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ الكريم ابن الكريم ابن الكريم ابن الكريم يوسف ابن يعقوب بن إسحاق بن إبراهيم  عليهم السلام ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"The honorable is the son of the honorable, the son the honorable, i.e. Joseph, the son of Jacob, the son of Isaac, the son of Abraham.",
      "chain": [
        "30313",
        "20250",
        "20439",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "3390",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "أخبرني عبدة، حدثنا عبد الصمد، عن عبد الرحمن، عن أبيه، عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ الكريم ابن الكريم ابن الكريم ابن الكريم يوسف بن يعقوب بن إسحاق بن إبراهيم عليهم السلام ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                      The Prophet said, \"The honorable, the son of the honorable, the son of the honorable, (was) Joseph, the son of Jacob! the son of Isaac, the son of Abraham.\"",
      "chain": [
        "20337",
        "20250",
        "20033",
        "18"
      ]
    },
    {
      "hadith_no": "3836",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "وقال عبد الصمد حدثنا شعبة، حدثنا قتادة، سمعت أنسا، قال أبو أسيد عن النبي صلى الله عليه وسلم بهذا، وقال سعد بن عبادة‏.‏",
      "text_en": " Narrated Abu Usaid:                     That he heard the Prophet saying, \"The best of the Ansar, or the best of the Ansar families (homes) are Banu An-Najjar, Bani `Abdul Ash-hal, Banu Al-Harith and Banu Sai'da.\"",
      "chain": [
        "20250",
        "20020",
        "11019",
        "19",
        "113"
      ]
    },
    {
      "hadith_no": "3854",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا إسحاق، حدثنا عبد الصمد، حدثنا شعبة، حدثنا قتادة، قال سمعت أنس بن مالك  رضى الله عنه  قال أبو أسيد قال رسول الله صلى الله عليه وسلم ‏\"‏ خير دور الأنصار بنو النجار، ثم بنو عبد الأشهل، ثم بنو الحارث بن الخزرج، ثم بنو ساعدة وفي كل دور الأنصار خير ‏\"‏‏.‏ فقال سعد بن عبادة  وكان ذا قدم في الإسلام  أرى رسول الله صلى الله عليه وسلم قد فضل علينا‏.‏ فقيل له قد فضلكم على ناس كثير‏.‏",
      "text_en": " Narrated Abu Usaid:                     Allah's Apostle said, \"The best of the Ansar's houses are those of Bani An-Najjar, then those of Bani `Abdul Ash-hal, then those of Bani Al-Harith bin Al-Khazraj, then those of Bani Saida; but there is goodness in all the houses of the Ansar.\" Sa`d bin Ubada who was one of those who embraced Islam early, said, \"I see that Allah's Apostle is giving others superiority above us.\" Some people said to him, \"But he has given you superiority above many other people.\"",
      "chain": [
        "30021",
        "20250",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "3959",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني محمد، حدثنا عبد الصمد، حدثنا أبي، حدثنا عبد العزيز بن صهيب، حدثنا أنس بن مالك  رضى الله عنه  قال أقبل نبي الله صلى الله عليه وسلم إلى المدينة وهو مردف أبا بكر، وأبو بكر شيخ يعرف، ونبي الله صلى الله عليه وسلم شاب لا يعرف، قال فيلقى الرجل أبا بكر فيقول يا أبا بكر، من هذا الرجل الذي بين يديك فيقول هذا الرجل يهديني السبيل‏.‏ قال فيحسب الحاسب أنه إنما يعني الطريق، وإنما يعني سبيل الخير، فالتفت أبو بكر، فإذا هو بفارس قد لحقهم، فقال يا رسول الله، هذا فارس قد لحق بنا‏.‏ فالتفت نبي الله صلى الله عليه وسلم فقال ‏\"‏ اللهم اصرعه ‏\"‏‏.‏ فصرعه الفرس، ثم قامت تحمحم فقال يا نبي الله مرني بما شئت‏.‏ قال ‏\"‏ فقف مكانك، لا تتركن أحدا يلحق بنا ‏\"‏‏.‏ قال فكان أول النهار جاهدا على نبي الله صلى الله عليه وسلم، وكان آخر النهار مسلحة له، فنزل رسول الله صلى الله عليه وسلم جانب الحرة، ثم بعث إلى الأنصار، فجاءوا إلى نبي الله صلى الله عليه وسلم فسلموا عليهما، وقالوا اركبا آمنين مطاعين‏.‏ فركب نبي الله صلى الله عليه وسلم وأبو بكر، وحفوا دونهما بالسلاح، فقيل في المدينة جاء نبي الله، جاء نبي الله صلى الله عليه وسلم‏.‏ فأشرفوا ينظرون ويقولون جاء نبي الله، جاء نبي الله‏.‏ فأقبل يسير حتى نزل جانب دار أبي أيوب، فإنه ليحدث أهله، إذ سمع به عبد الله بن سلام وهو في نخل لأهله يخترف لهم، فعجل أن يضع الذي يخترف لهم فيها، فجاء وهى معه، فسمع من نبي الله صلى الله عليه وسلم ثم رجع إلى أهله، فقال نبي الله صلى الله عليه وسلم ‏\"‏ أى بيوت أهلنا أقرب ‏\"‏‏.‏ فقال أبو أيوب أنا يا نبي الله، هذه داري، وهذا بابي‏.‏ قال ‏\"‏ فانطلق فهيئ لنا مقيلا ‏\"‏‏.‏ قال قوما على بركة الله‏.‏ فلما جاء نبي الله صلى الله عليه وسلم جاء عبد الله بن سلام فقال أشهد أنك رسول الله، وأنك جئت بحق، وقد علمت يهود أني سيدهم وابن سيدهم، وأعلمهم وابن أعلمهم، فادعهم فاسألهم عني قبل أن يعلموا أني قد أسلمت، فإنهم إن يعلموا أني قد أسلمت قالوا في ما ليس في‏.‏ فأرسل نبي الله صلى الله عليه وسلم فأقبلوا فدخلوا عليه‏.‏ فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ يا معشر اليهود، ويلكم اتقوا الله، فوالله الذي لا إله إلا هو إنكم لتعلمون أني رسول الله حقا، وأني جئتكم بحق فأسلموا ‏\"‏‏.‏ قالوا ما نعلمه‏.‏ قالوا للنبي صلى الله عليه وسلم قالها ثلاث مرار‏.‏ قال ‏\"‏ فأى رجل فيكم عبد الله بن سلام ‏\"‏‏.‏ قالوا ذاك سيدنا وابن سيدنا، وأعلمنا وابن أعلمنا‏.‏ قال ‏\"‏ أفرأيتم إن أسلم ‏\"‏‏.‏ قالوا حاشا لله، ما كان ليسلم‏.‏ قال ‏\"‏ أفرأيتم إن أسلم ‏\"‏‏.‏ قالوا حاشا لله، ما كان ليسلم‏.‏ قال ‏\"‏ يا ابن سلام، اخرج عليهم ‏\"‏‏.‏ فخرج فقال يا معشر اليهود، اتقوا الله، فوالله الذي لا إله إلا هو إنكم لتعلمون أنه رسول الله، وأنه جاء بحق‏.‏ فقالوا كذبت‏.‏ فأخرجهم رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle arrived at Medina with Abu Bakr, riding behind him on the same camel. Abu Bakr was an elderly man known to the people, while Allah's Apostle was a youth that was unknown. Thus, if a man met Abu Bakr, he would day, \"O Abu Bakr! Who is this man in front of you?\" Abu Bakr would say, \"This man shows me the Way,\" One would think that Abu Bakr meant the road, while in fact, Abu Bakr meant the way of virtue and good. Then Abu Bakr looked behind and saw a horse-rider persuing them. He said, \"O Allah's Apostle! This is a horse-rider persuing us.\" The Prophet looked behind and said, \"O Allah! Cause him to fall down.\" So the horse threw him down and got up neighing. After that the rider, Suraqa said, \"O Allah's Prophet! Order me whatever you want.\" The Prophet said, \"Stay where you are and do not allow anybody to reach us.\" So, in the first part of the day Suraqa was an enemy of Allah's Prophet and in the last part of it, he was a protector. Then Allah's Apostle alighted by the side of the Al-Harra and sent a message to the Ansar, and they came to Allah's Prophet and Abu Bakr, and having greeted them, they said, \"Ride (your she-camels) safe and obeyed.\" Allah's Apostle and Abu Bakr rode and the Ansar, carrying their arms, surrounded them. The news that Allah's Prophet had come circulated in Medina. The people came out and were eagerly looking and saying \"Allah's Prophet has come! Allah's Prophet has come! So the Prophet went on till he alighted near the house of Abu Aiyub. While the Prophet was speaking with the family members of Abu Aiyub, `Abdullah bin Salam heard the news of his arrival while he himself was picking the dates for his family from his family garden. He hurried to the Prophet carrying the dates which he had collected for his family from the garden. He listened to Allah's Prophet and then went home. Then Allah's Prophet said, \"Which is the nearest of the houses of our Kith and kin?\" Abu Aiyub replied, \"Mine, O Allah's Prophet! This is my house and this is my gate.\" The Prophet said, \"Go and prepare a place for our midday rest.\" Abu Aiyub said, \"Get up (both of you) with Allah's Blessings.\" So when Allah's Prophet went into the house, `Abdullah bin Salaim came and said \"I testify that you (i.e. Muhammad) are Apostle of Allah and that you have come with the Truth. The Jews know well that I am their chief and the son of their chief and the most learned amongst them and the son of the most learned amongst them. So send for them (i.e. Jews) and ask them about me before they know that I have embraced Islam, for if they know that they will say about me things which are not correct.\" So Allah's Apostle sent for them, and they came and entered. Allah's Apostle said to them, \"O (the group of) Jews! Woe to you: be afraid of Allah. By Allah except Whom none has the right to be worshipped, you people know for certain, that I am Apostle of Allah and that I have come to you with the Truth, so embrace Islam.\" The Jews replied, \"We do not know this.\" So they said this to the Prophet and he repeated it thrice. Then he said, \"What sort of a man is `Abdullah bin Salam amongst you?\" They said, \"He is our chief and the son of our chief and the most learned man, and the son of the most learned amongst us.\" He said, \"What would you think if he should embrace Islam?\" They said, \"Allah forbid! He can not embrace Islam.\" He said, \" What would you think if he should embrace Islam?\" They said, \"Allah forbid! He can not embrace Islam.\" He said, \"What would you think if he should embrace Islam?\" They said, \"Allah forbid! He can not embrace Islam.\" He said, \"O Ibn Salaim! Come out to them.\" He came out and said, \"O (the group of) Jews! Be afraid of Allah except Whom none has the right to be worshipped. You know for certain that he is Apostle of Allah and that he has brought a True Religion!' They said, \"You tell a lie.\" On that Allah's Apostle turned them out.",
      "chain": [
        "30213",
        "20250",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "3980",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا مسدد، حدثنا عبد الوارث،‏.‏ وحدثنا إسحاق بن منصور، أخبرنا عبد الصمد، قال سمعت أبي يحدث، حدثنا أبو التياح، يزيد بن حميد الضبعي قال حدثني أنس بن مالك  رضى الله عنه  قال لما قدم رسول الله صلى الله عليه وسلم المدينة، نزل في علو المدينة في حى يقال لهم بنو عمرو بن عوف  قال  فأقام فيهم أربع عشرة ليلة، ثم أرسل إلى ملإ بني النجار  قال  فجاءوا متقلدي سيوفهم، قال وكأني أنظر إلى رسول الله صلى الله عليه وسلم على راحلته، وأبو بكر ردفه، وملأ بني النجار حوله حتى ألقى بفناء أبي أيوب، قال فكان يصلي حيث أدركته الصلاة، ويصلي في مرابض الغنم، قال ثم إنه أمر ببناء المسجد، فأرسل إلى ملإ بني النجار، فجاءوا فقال ‏\"‏ يا بني النجار، ثامنوني حائطكم هذا ‏\"‏‏.‏ فقالوا لا، والله لا نطلب ثمنه إلا إلى الله‏.‏ قال فكان فيه ما أقول لكم كانت فيه قبور المشركين، وكانت فيه خرب، وكان فيه نخل، فأمر رسول الله صلى الله عليه وسلم بقبور المشركين فنبشت، وبالخرب فسويت، وبالنخل فقطع، قال فصفوا النخل قبلة المسجد  قال  وجعلوا عضادتيه حجارة‏.‏ قال قال جعلوا ينقلون ذاك الصخر وهم يرتجزون، ورسول الله صلى الله عليه وسلم معهم يقولون اللهم إنه لا خير إلا خير الآخره فانصر الأنصار والمهاجره‏.‏",
      "text_en": " Narrated Anas bin Malik:                     When Allah's Apostle arrived at Medina, he alighted at the upper part of Medina among the people called Bani `Amr bin `Auf and he stayed with them for fourteen nights. Then he sent for the chiefs of Bani An-Najjar, and they came, carrying their swords. As if I am just now looking at Allah's Apostle on his she-camel with Abu Bakr riding behind him (on the same camel) and the chiefs of Bani An- Najjar around him till he dismounted in the courtyard of Abu Aiyub's home. The Prophet used to offer the prayer wherever the prayer was due, and he would pray even in sheepfolds. Then he ordered that the mosque be built. He sent for the chiefs of Banu An-Najjar, and when they came, he said, \"O Banu An-Najjar! Suggest to me the price of this garden of yours.\" They replied \"No! By Allah, we do not demand its price except from Allah.\" In that garden there were the (following) things that I will tell you: Graves of pagans, unleveled land with holes and pits etc., and date-palm trees. Allah's Apostle ordered that the graves of the pagans be dug up and, the unleveled land be leveled and the date-palm trees be cut down. The trunks of the trees were arranged so as to form the wall facing the Qibla. The Stone pillars were built at the sides of its gate. The companions of the Prophet were carrying the stones and reciting some lyrics, and Allah's Apostle . . was with them and they were saying, \"O Allah! There is no good Excel the good of the Hereafter, so bestow victory on the Ansar and the Emigrants. \"",
      "chain": [
        "30175",
        "30313",
        "20250",
        "20258",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "4157",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبدة بن عبد الله، حدثنا عبد الصمد، عن عبد الرحمن  هو ابن عبد الله بن دينار  عن أبيه، أن ابن عمر  رضى الله عنهما  قال أول يوم شهدته يوم الخندق‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The first day (i.e. Ghazwa) I participated in, was the day of Al-Khandaq (i.e. Trench).",
      "chain": [
        "30149",
        "20250",
        "20439",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "4271",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق، حدثنا عبد الصمد، حدثنا شعبة، حدثنا عدي بن ثابت، سمعت البراء، وابن أبي أوفى، يحدثان عن النبي صلى الله عليه وسلم أنه قال يوم خيبر وقد نصبوا القدور أكفئوا القدور‏.‏",
      "text_en": " Narrated Al-Bara' and Ibn Abi `Aufa:                     On the day of Khaibar when the cooking pots were put on the fire, the Prophet said, \"Turn the cooking pots upside down.\"",
      "chain": [
        "30021",
        "20250",
        "20020",
        "11372",
        "400",
        "5115"
      ]
    },
    {
      "hadith_no": "4333",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق، حدثنا عبد الصمد، قال حدثني أبي، حدثنا أيوب، عن عكرمة، عن ابن عباس  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم لما قدم مكة أبى أن يدخل البيت وفيه الآلهة، فأمر بها فأخرجت، فأخرج صورة إبراهيم، وإسماعيل في أيديهما من الأزلام، فقال النبي صلى الله عليه وسلم ‏\"‏ قاتلهم الله لقد علموا ما استقسما بها قط ‏\"‏‏.‏ ثم دخل البيت، فكبر في نواحي البيت، وخرج ولم يصل فيه‏.‏ تابعه معمر عن أيوب‏.‏ وقال وهيب حدثنا أيوب عن عكرمة عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When Allah's Apostle arrived in Mecca, he refused to enter the Ka`ba while there were idols in it. So he ordered that they be taken out. The pictures of the (Prophets) Abraham and Ishmael, holding arrows of divination in their hands, were carried out. The Prophet said, \"May Allah ruin them (i.e. the infidels) for they knew very well that they (i.e. Abraham and Ishmael) never drew lots by these (divination arrows). Then the Prophet entered the Ka`ba and said. \"Allahu Akbar\" in all its directions and came out and not offer any prayer therein.",
      "chain": [
        "30312",
        "20250",
        "20258",
        "11015",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4734",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "وقال حدثنا عبد الله بن محمد، حدثنا عبد الصمد، عن عبد الرحمن بن عبد الله بن دينار، عن أبيه، عن عبد الله بن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ الكريم بن الكريم بن الكريم بن الكريم يوسف بن يعقوب بن إسحاق بن إبراهيم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Prophet said, \"The honorable, the son of the honorable the son of the honorable, i.e. Joseph, the son of Jacob, the son of Isaac, the son of Abraham.\"",
      "chain": [
        "30351",
        "20250",
        "20439",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "4973",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق بن منصور، حدثنا عبد الصمد، حدثنا حرب، حدثنا يحيى، قال سألت أبا سلمة أى القرآن أنزل أول فقال ‏{‏يا أيها المدثر‏}‏ فقلت أنبئت أنه ‏{‏اقرأ باسم ربك الذي خلق‏}‏ فقال أبو سلمة سألت جابر بن عبد الله أى القرآن أنزل أول فقال ‏{‏يا أيها المدثر‏}‏ فقلت أنبئت أنه ‏{‏اقرأ باسم ربك‏}‏ فقال لا أخبرك إلا بما قال رسول الله صلى الله عليه وسلم قال رسول الله صلى الله عليه وسلم ‏\"‏ جاورت في حراء فلما قضيت جواري، هبطت فاستبطنت الوادي فنوديت، فنظرت أمامي وخلفي وعن يميني وعن شمالي فإذا هو جالس على عرش بين السماء والأرض، فأتيت خديجة فقلت دثروني وصبوا على ماء باردا، وأنزل على ‏{‏يا أيها المدثر * قم فأنذر * وربك فكبر‏}‏‏\"‏",
      "text_en": " Narrated Yahya:                     I asked Aba Salama, \"Which Sura of the Qur'an was revealed first?\" He replied, \"O you, wrapped-up' (Al-Muddaththir).\" I said, \"I have been informed that it was, 'Read, in the Name of your Lord who created........ (i.e. Surat Al-Alaq).",
      "chain": [
        "30313",
        "20250",
        "20220",
        "11449"
      ]
    },
    {
      "hadith_no": "5447",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الصمد، حدثنا شعبة، عن واقد بن محمد، عن نافع، قال كان ابن عمر لا يأكل حتى يؤتى بمسكين يأكل معه، فأدخلت رجلا يأكل معه فأكل كثيرا فقال يا نافع لا تدخل هذا على سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ المؤمن يأكل في معى واحد والكافر يأكل في سبعة أمعاء ‏\"‏‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar never used to take his meal unless a poor man was called to eat with him. One day I brought a poor man to eat with him, the man ate too much, whereupon Ibn `Umar said, \"O Nafi`! Don't let this man enter my house, for I heard the Prophet saying, \"A believer eats in one intestine (is satisfied with a little food), and a kafir (unbeliever) eats in seven intestines (eats much food).",
      "chain": [
        "30160",
        "20250",
        "20020",
        "11544",
        "11014"
      ]
    },
    {
      "hadith_no": "6148",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا عبد الصمد، قال حدثني أبي قال، حدثني يحيى بن أبي إسحاق، قال قال لي سالم بن عبد الله ما الإستبرق قلت ما غلظ من الديباج وخشن منه‏.‏ قال سمعت عبد الله يقول رأى عمر على رجل حلة من إستبرق فأتى بها النبي صلى الله عليه وسلم فقال يا رسول الله اشتر هذه فالبسها لوفد الناس إذا قدموا عليك‏.‏ فقال ‏\"‏ إنما يلبس الحرير من لا خلاق له ‏\"‏‏.‏ فمضى في ذلك ما مضى، ثم إن النبي صلى الله عليه وسلم بعث إليه بحلة فأتى بها النبي صلى الله عليه وسلم فقال بعثت إلى بهذه، وقد قلت في مثلها ما قلت قال ‏\"‏ إنما بعثت إليك لتصيب بها مالا ‏\"‏‏.‏ فكان ابن عمر يكره العلم في الثوب لهذا الحديث‏.‏",
      "text_en": " Narrated `Abdullah:                     `Umar saw a silken cloak over a man (for sale) so he took it to the Prophet and said, 'O Allah's Apostle! Buy this and wear it when the delegate come to you.' He said, 'The silk is worn by one who will have no share (in the Here-after).' Some time passed after this event, and then the Prophet sent a (similar) cloak to him. `Umar brought that cloak back to the Prophet and said, 'You have sent this to me, and you said about a similar one what you said?' The Prophet said, 'I have sent it to you so that you may get money by selling it.' Because of this, Ibn `Umar used to hate the silken markings on the garments.",
      "chain": [
        "30351",
        "20250",
        "20258",
        "11314",
        "16"
      ]
    },
    {
      "hadith_no": "6316",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا إسحاق، أخبرنا عبد الصمد، حدثنا عبد الله بن المثنى، حدثنا ثمامة بن عبد الله، عن أنس  رضى الله عنه أن رسول الله صلى الله عليه وسلم كان إذا سلم سلم ثلاثا، وإذا تكلم بكلمة أعادها ثلاثا‏.‏",
      "text_en": " Narrated Anas:                     Whenever Allah's Apostle greeted somebody, he used to greet him three times, and if he spoke a sentence, he used to repeat it thrice.",
      "chain": [
        "30021",
        "20250",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "6955",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا إسحاق بن منصور، حدثنا عبد الصمد، حدثنا شعبة، حدثنا عبيد الله بن أبي بكر، سمع أنسا  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الكبائر ‏\"‏‏.‏ وحدثنا عمرو حدثنا شعبة عن ابن أبي بكر عن أنس بن مالك عن النبي صلى الله عليه وسلم قال ‏\"‏ أكبر الكبائر الإشراك بالله وقتل النفس، وعقوق الوالدين، وقول الزور ‏\"‏‏.‏ أو قال ‏\"‏ وشهادة الزور ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"The biggest of Al-Ka`ba'ir (the great sins) are (1) to join others as partners in worship with Allah, (2) to murder a human being, (3) to be undutiful to one's parents (4) and to make a false statement,\" or said, \"to give a false witness.\"",
      "chain": [
        "30313",
        "20250",
        "20020",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "7130",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا علي بن مسلم، حدثنا عبد الصمد، حدثنا عبد الرحمن بن عبد الله بن دينار، مولى ابن عمر عن أبيه، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أفرى الفرى أن يري عينيه ما لم تر ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"The worst lie is that a person claims to have seen a dream which he has not seen.\"",
      "chain": [
        "30261",
        "20250",
        "20439",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "7242",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا إسحاق، أخبرنا عبد الصمد، حدثنا شعبة، حدثنا ثابت البناني، عن أنس بن مالك، يقول لامرأة من أهله تعرفين فلانة قالت نعم‏.‏ قال فإن النبي صلى الله عليه وسلم مر بها وهى تبكي عند قبر فقال ‏\"‏ اتقي الله واصبري ‏\"‏‏.‏ فقالت إليك عني، فإنك خلو من مصيبتي‏.‏ قال فجاوزها ومضى فمر بها رجل فقال ما قال لك رسول الله صلى الله عليه وسلم‏.‏ قالت ما عرفته قال إنه لرسول الله صلى الله عليه وسلم قال فجاءت إلى بابه فلم تجد عليه بوابا فقالت يا رسول الله والله ما عرفتك‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن الصبر عند أول صدمة ‏\"‏‏.‏",
      "text_en": " Narrated Thabit Al-Bunani:                     Anas bin Malik said to a woman of his family, \"Do you know such-and-such a woman?\" She replied, \"Yes.\" He said, \"The Prophet passed by her while she was weeping over a grave, and he said to her, 'Be afraid of Allah and be patient.' The woman said (to the Prophet). 'Go away from me, for you do not know my calamity.'\" Anas added, \"The Prophet left her and proceeded. A man passed by her and asked her, 'What has Allah's Apostle said to you?' She replied, 'I did not recognize him.' The man said, 'He was Allah's Apostle.\"' Anas added, \"So that woman came to the gate of the Prophet and she did not find a gate-keeper there, and she said, 'O Allah's Apostle! By Allah. I did not recognize you!' The Prophet said, 'No doubt, patience is at the first stroke of a calamity.'\"",
      "chain": [
        "30021",
        "20250",
        "20020",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "7452",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا إسحاق، أخبرنا عبد الصمد، حدثنا همام، حدثنا أبو عمران الجوني، عن جندب بن عبد الله، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اقرءوا القرآن ما ائتلفت عليه قلوبكم، فإذا اختلفتم فقوموا عنه ‏\"‏‏.‏ وقال يزيد بن هارون عن هارون الأعور، حدثنا أبو عمران، عن جندب، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Jundab bin `Abdullah:                     Allah's Apostle said, \"Recite (and study) the Qur'an as long as your hearts are in agreement as to its meanings, but if you have differences as regards its meaning, stop reading it then.\"",
      "chain": [
        "30312",
        "20250",
        "20297",
        "11296",
        "4053"
      ]
    },
    {
      "hadith_no": "7576",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثني إسحاق، حدثنا عبد الصمد، حدثنا عبد الرحمن  هو ابن عبد الله بن دينار  عن أبيه، عن أبي صالح، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله تبارك وتعالى إذا أحب عبدا نادى جبريل إن الله قد أحب فلانا فأحبه فيحبه جبريل، ثم ينادي جبريل في السماء إن الله قد أحب فلانا فأحبوه، فيحبه أهل السماء ويوضع له القبول في أهل الأرض ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"If Allah loves a person, He calls Gabriel, saying, 'Allah loves so and so, O Gabriel love him' So Gabriel would love him and then would make an announcement in the Heavens: 'Allah has loved so and-so therefore you should love him also.' So all the dwellers of the Heavens would love him, and then he is granted the pleasure of the people on the earth.\" (See Hadith No. 66, Vol. 8)",
      "chain": [
        "30312",
        "20250",
        "20439",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "226",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني زهير بن حرب، حدثنا عبد الصمد بن عبد الوارث، حدثنا أبي، حدثنا حسين المعلم، عن ابن بريدة، عن يحيى بن يعمر، أن أبا الأسود، حدثه عن أبي ذر، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ليس من رجل ادعى لغير أبيه وهو يعلمه إلا كفر ومن ادعى ما ليس له فليس منا وليتبوأ مقعده من النار ومن دعا رجلا بالكفر أو قال عدو الله ‏.‏ وليس كذلك إلا حار عليه ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Abu Dharr that he heard the Messenger of Allah (may peace and blessings be upon him) saying:                      No person who claimed knowingly anyone else as his father besides (his own) committed nothing but infidelity, and he who made a claim of anything, which (in fact) did not belong to him, is not amongst us; he should make his abode in Fire, and he who labeled anyone with unbelief or called him the enemy of Allah, and he was in fact not so, it rebounded on him.",
      "chain": [
        "30022",
        "20250",
        "20258",
        "11278",
        "11432",
        "11316",
        "11114",
        "23"
      ]
    },
    {
      "hadith_no": "283",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني زهير بن حرب، وأحمد بن خراش، قالا حدثنا عبد الصمد بن عبد الوارث، حدثنا أبي قال، حدثني حسين المعلم، عن ابن بريدة، أن يحيى بن يعمر، حدثه أن أبا الأسود الديلي حدثه أن أبا ذر حدثه قال أتيت النبي صلى الله عليه وسلم وهو نائم عليه ثوب أبيض ثم أتيته فإذا هو نائم ثم أتيته وقد استيقظ فجلست إليه فقال ‏\"‏ ما من عبد قال لا إله إلا الله ثم مات على ذلك إلا دخل الجنة ‏\"‏ ‏.‏ قلت وإن زنى وإن سرق قال ‏\"‏ وإن زنى وإن سرق ‏\"‏ ‏.‏ قلت وإن زنى وإن سرق قال ‏\"‏ وإن زنى وإن سرق ‏\"‏ ‏.‏ ثلاثا ثم قال في الرابعة ‏\"‏ على رغم أنف أبي ذر ‏\"‏ قال فخرج أبو ذر وهو يقول وإن رغم أنف أبي ذر ‏.‏",
      "text_en": " Abu Dharr reported,:                      I came to the Apostle (may peace be upon him ) and he was asleep with a white mantle over him. I again came, he was still asleep, I came again and he had awakened. I sat by his side and (the Holy Prophet) observed: There is none among the bondsmen who affirmed his faith in La illaha ill-Allah there is no God but Allah) and died in this state and did not enter Paradise. I (Abu Dharr) said: Even if he committed adultery and theft? He (the Holy Prophet) replied: (Yes) even though he committed adultery and theft. I (again said): Even if he committed adultery and theft? He replied: (Yes) even though he committed adultery and theft. (Th Holy Prophet repeated it three times) and said for the fourth time: In defiance of Abu Dharr. Abu Dharr then went out and he repeated (these words): In defiance of Abu Dharr.",
      "chain": [
        "30022",
        "20250",
        "20258",
        "11278",
        "11432",
        "11316",
        "11114",
        "23"
      ]
    },
    {
      "hadith_no": "301",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنيه حجاج بن الشاعر، حدثنا عبد الصمد، قال حدثني أبي، حدثنا داود، - يعني ابن أبي هند - حدثنا عاصم، عن صفوان بن محرز، عن أبي موسى، عن النبي صلى الله عليه وسلم ح",
      "text_en": "",
      "chain": [
        "38834",
        "20250",
        "20258",
        "11585",
        "11080",
        "11693",
        "41"
      ]
    },
    {
      "hadith_no": "302",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني الحسن بن علي الحلواني، حدثنا عبد الصمد، أخبرنا شعبة، عن عبد الملك بن عمير، عن ربعي بن حراش، عن أبي موسى، عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏ غير أن في حديث عياض الأشعري قال ‏\"‏ ليس منا ‏\"‏ ‏.‏ ولم يقل ‏\"‏ بريء ‏\"‏ ‏.‏",
      "text_en": "",
      "chain": [
        "30115",
        "20250",
        "20020",
        "11368",
        "11334",
        "41"
      ]
    },
    {
      "hadith_no": "317",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا إسحاق بن إبراهيم، وإسحاق بن منصور، وعبد الوارث بن عبد الصمد، كلهم عن عبد الصمد بن عبد الوارث، عن شعبة، عن أيوب، عن أبي قلابة، عن ثابت بن الضحاك الأنصاري، ح",
      "text_en": " It is narrated on the authority of Thabit b. Dahhak that the Apostle of Allah (may peace be upon him) observed:                      He who took deliberately a false oath on a religion other than Islam would become that which he had professed. And he who killed himself with anything Allah would torment him with that in the Fire of Hell.",
      "chain": [
        "30123",
        "30313",
        "20250",
        "20020",
        "11015",
        "11047"
      ]
    },
    {
      "hadith_no": "547",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني زهير بن حرب، حدثنا عبد الصمد بن عبد الوارث، حدثنا حاجب بن عمر أبو خشينة الثقفي، حدثنا الحكم بن الأعرج، عن عمران بن حصين، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يدخل الجنة من أمتي سبعون ألفا بغير حساب ‏\"‏ ‏.‏ قالوا من هم يا رسول الله قال ‏\"‏ هم الذين لا يسترقون ولا يتطيرون ولا يكتوون وعلى ربهم يتوكلون ‏\"‏ ‏.‏",
      "text_en": " 'Imran b. Husain reported:                      Verily the Messenger of Allah (may peace be upon him) said: Seventy thousand men of my Ummah would enter Paradise without rendering account. They (the companions of the Holy Prophet) said: Who would be those, Messenger of Allah? He (the Holy Prophet) said: They would be those who neither practise charm, not take omens, nor do they cauterise, but they repose their trust in their Lord.",
      "chain": [
        "30022",
        "20250",
        "10674",
        "10677",
        "123"
      ]
    },
    {
      "hadith_no": "347",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني زهير بن حرب، وعبد بن حميد، قالا حدثنا عبد الصمد بن عبد الوارث، ح وحدثنا عبد الوارث بن عبد الصمد، - واللفظ له - حدثني أبي، عن جدي، عن الحسين بن ذكوان، عن يحيى بن أبي كثير، أخبرني أبو سلمة، أن عطاء بن يسار، أخبره أن زيد بن خالد الجهني أخبره أنه، سأل عثمان بن عفان قال قلت أرأيت إذا جامع الرجل امرأته ولم يمن قال عثمان ‏\"‏ يتوضأ كما يتوضأ للصلاة ويغسل ذكره ‏\"‏ ‏.‏ قال عثمان سمعته من رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Zaid b. Khalid al-Jubani reported that he askad Uthman b. 'Affan:                      What is your opinion about the man who has sexual intercourse with his wife, but does not experience orgasm? Uthman said: He should perform ablution as he does for prayer, and wash his organ. 'Uthmin also said: I have heard it from the Messenger of Allah (may peace be upon him).",
      "chain": [
        "30022",
        "30553",
        "20250",
        "20258",
        "11449",
        "10567",
        "11020",
        "3625",
        "4"
      ]
    },
    {
      "hadith_no": "419",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المثنى، وهارون بن عبد الله، قالا حدثنا عبد الصمد، قال سمعت أبي يحدث، قال حدثنا عبد العزيز، عن أنس، قال لم يخرج إلينا نبي الله صلى الله عليه وسلم ثلاثا فأقيمت الصلاة فذهب أبو بكر يتقدم فقال نبي الله صلى الله عليه وسلم بالحجاب فرفعه فلما وضح لنا وجه نبي الله صلى الله عليه وسلم ما نظرنا منظرا قط كان أعجب إلينا من وجه النبي صلى الله عليه وسلم حين وضح لنا - قال - فأومأ نبي الله صلى الله عليه وسلم بيده إلى أبي بكر أن يتقدم وأرخى نبي الله صلى الله عليه وسلم الحجاب فلم نقدر عليه حتى مات ‏.‏",
      "text_en": " Anas reported:                      The Apostle of Allah (may peace be upon him) did not come to us for three days. When the prayer was about to start. Abu Bakr stepped forward (to lead the prayer), and the Apostle of Allah (may peace be upon him) lifted the curtain. When the face of the Apostle of Allah (may peace be upon him) became visible to us, we (found) that no sight was more endearing to us than the face of the Apostle of Allah (may peace be upon him) as it appeared to us. The Apostle of Allah (may peace be upon him) with the gesture of his hand directed Abu Bakr to step forward (and lead the prayer). The Apostle of Allah (may peace be upon him) then drew the curtain, and we could not see him till he died.",
      "chain": [
        "30170",
        "30524",
        "20250",
        "20258",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "1419",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني أحمد بن إبراهيم الدورقي، حدثنا عبد الصمد، حدثنا همام، حدثنا قتادة، عن أبي أيوب، عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ وقت الظهر إذا زالت الشمس وكان ظل الرجل كطوله ما لم يحضر العصر ووقت العصر ما لم تصفر الشمس ووقت صلاة المغرب ما لم يغب الشفق ووقت صلاة العشاء إلى نصف الليل الأوسط ووقت صلاة الصبح من طلوع الفجر ما لم تطلع الشمس فإذا طلعت الشمس فأمسك عن الصلاة فإنها تطلع بين قرنى شيطان ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. 'Amr reported:                      The Messenger of Allah (may peace be upon him) said: The time of the noon prayer is when the sun passes the meridian and a man's shadow is the same (length) as his height, (and it lasts) as long as the time for the afternoon prayer has not come; the time for the afternoon prayer is as long as the sun has not become pale; the time of the evening prayer is as long as the twilight has not ended; the time of the night prayer is up to the middle of the average night and the time of the morning prayer is from the appearance of dawn, as long as the sun has not risen; but when the sun rises, refrain from prayer for it rises between the horns of the devil.",
      "chain": [
        "30494",
        "20250",
        "20297",
        "11019",
        "33",
        "29"
      ]
    },
    {
      "hadith_no": "1551",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الصمد بن عبد الوارث، قال سمعت أبي يحدث، قال حدثني الجريري، عن أبي نضرة، عن جابر بن عبد الله، قال خلت البقاع حول المسجد فأراد بنو سلمة أن ينتقلوا إلى قرب المسجد فبلغ ذلك رسول الله صلى الله عليه وسلم فقال لهم ‏\"‏ إنه بلغني أنكم تريدون أن تنتقلوا قرب المسجد ‏\"‏ ‏.‏ قالوا نعم يا رسول الله قد أردنا ذلك ‏.‏ فقال ‏\"‏ يا بني سلمة دياركم تكتب آثاركم دياركم تكتب آثاركم ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Abdullah reported:                      There were some plots vacant around the mosque. Banu Salama decided to shift (to this land) and come near the mosque. This (news) reached the Messenger of Allah (may peace be upon him) and he said to them (Banu Salama): I have received (information) that you intend to shift near the mosque. They said: Yes, Messenger of Allah, we have taken this decision. Upon this he (the Holy Prophet) said: O Banu Salama, live in your houses, for your steps are recorded; live in your houses, for your steps are recorded.",
      "chain": [
        "30170",
        "20250",
        "20258",
        "11286",
        "10721",
        "34"
      ]
    },
    {
      "hadith_no": "1627",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثناه يحيى بن حبيب، حدثنا خالد يعني ابن الحارث، ح وحدثنا ابن المثنى، قال حدثني عبد الصمد، قالا حدثنا شعبة، بهذا الإسناد ولم يقولا في الحديث بمنى ‏.‏ ولكن قالا صلى في السفر ‏.‏",
      "text_en": " This hadith has been narrated by Shu'ba with the same chain of transmitters but no mention has been made of Mina, but they (the narrators) only said:                      He prayed while travelling.",
      "chain": [
        "20226",
        "20250"
      ]
    },
    {
      "hadith_no": "1795",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني زهير بن حرب، حدثنا عبد الصمد، حدثنا همام، حدثنا قتادة، عن أبي مجلز، قال سألت ابن عباس عن الوتر، فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ركعة من آخر الليل ‏\"‏ ‏.‏ وسألت ابن عمر فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ركعة من آخر الليل ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported:                      A person called (the attention) of the Messenger of Allah (may peace be upon him) as he was in the mosque, and said: Messenger of Allah, how should I make the rak'ahs of the night prayer an odd number? Upon this the Messenger of Allah (way peace he upon him) said: He who prays (night prayer) he should observe it in pairs, but if he apprehends the rise of morning, he should observe one rak'ah; that would make the number odd (for the rak'ahs) observed by him. This was narrated by Abd Kuraib 'Ubaidullah b. 'Abdullah and Ibn 'Umar did not make mention of it.",
      "chain": [
        "30022",
        "20250",
        "20297",
        "11019",
        "11313",
        "17"
      ]
    },
    {
      "hadith_no": "2180",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثناه يحيى بن حبيب الحارثي، حدثنا خالد يعني ابن الحارث، ح وحدثنا عقبة بن مكرم العمي، حدثنا عبد الملك بن عمرو، ح وحدثني أحمد بن إبراهيم الدورقي، حدثنا عبد الصمد، قالوا جميعا حدثنا شعبة، بهذا الإسناد نحو حديث عثمان بن عمر بقصته ‏.‏ وفي حديث عبد الصمد مر النبي صلى الله عليه وسلم بامرأة عند قبر ‏.‏",
      "text_en": " A hadith like this is narrated with the same chain of transmitters but with the addition of these words:                     \" The Apostle of Allah (may peace be upon him) happened to pass by a woman (who was sitting) by the side of a grave.\"",
      "chain": [
        "20226",
        "30441",
        "30494",
        "20250"
      ]
    },
    {
      "hadith_no": "2205",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، ح وحدثني أبو الطاهر، أخبرنا عبد الله بن وهب، عن معاوية بن صالح، ح وحدثني أحمد بن إبراهيم الدورقي، حدثنا عبد الصمد، حدثنا عبد العزيز، - يعني ابن مسلم - كلهم عن يحيى بن سعيد، بهذا   الإسناد ‏.‏ نحوه ‏.‏ وفي حديث عبد العزيز وما تركت رسول الله صلى الله عليه وسلم   من العي ‏.‏",
      "text_en": " This hadith has been narrated by Yahya b. Sa'id with the same chain of transmitters like one narrated by 'Abd al-'Aziz (with the change of these words):                     \" You did not spare the Messenger of Allah (may peace be upon him) the botheration.\"",
      "chain": [
        "30201",
        "20331",
        "20029",
        "20675",
        "30494",
        "20250",
        "11062"
      ]
    },
    {
      "hadith_no": "2477",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا زهير بن حرب، حدثنا عبد الصمد بن عبد الوارث، حدثنا همام، ح وحدثني زهير بن حرب، حدثنا عمر بن يونس، حدثنا عكرمة بن عمار، ح وحدثني سلمة بن شبيب، حدثنا أبو المغيرة، حدثنا الأوزاعي، كلهم عن إسحاق بن عبد الله بن أبي طلحة، عن أنس، بن مالك عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏ وفي حديث عكرمة بن عمار من الزيادة قال ثم جبذه إليه جبذة رجع نبي الله صلى الله عليه وسلم في نحر الأعرابي ‏.‏ وفي حديث همام فجاذبه حتى انشق البرد وحتى بقيت حاشيته في عنق رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Anas b. Malik through another chain of transmitters. And In the hadith transmitted by Ikrima b. 'Ammir there is an addition:                     \" He (the bedouin) pulled his (mantle) so violently that the Apostle of Allah (may peace be upon him) was drifted very close to the bedouin.\" And in the hadith transmitted by Hammam, (the words are):\" He pulled it so violently that the mantle was torn and the border was left around the neck of the Messenger of Allah (may peace be upon him).\"",
      "chain": [
        "30022",
        "20250",
        "20297",
        "30022",
        "20450",
        "10704",
        "30417",
        "20442",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "2945",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه إسحاق بن إبراهيم الحنظلي، حدثنا عبد الصمد بن عبد الوارث، حدثني أبي، حدثنا أيوب بن موسى، حدثني نبيه بن وهب، أن عمر بن عبيد الله بن معمر، رمدت عينه فأراد أن يكحلها، فنهاه أبان بن عثمان وأمره أن يضمدها بالصبر وحدث عن عثمان بن عفان عن النبي صلى الله عليه وسلم أنه فعل ذلك ‏.‏",
      "text_en": " Nubaih b Wahb reported that the eyes of Umar b. Ubaidnllah b. Ma'mar were swollen, and he decided to use antimony. Aban b. 'Uthman forbade him to do so and commanded him to apply aloes on them, and reported on the authority of 'Uthman b. Affan that the Apostle of Allah (may peace be upon him) had done that.",
      "chain": [
        "30021",
        "20250",
        "20258",
        "11241",
        "19965",
        "10582",
        "4"
      ]
    },
    {
      "hadith_no": "3037",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا محمد بن المثنى، حدثني عبد الصمد، حدثنا همام، حدثنا قتادة، عن مطرف، عن عمران بن حصين، - رضى الله عنه - قال تمتعنا مع رسول الله صلى الله عليه وسلم ولم ينزل فيه القرآن ‏.‏ قال رجل برأيه ما شاء ‏.‏ وحدثنيه حجاج بن الشاعر، حدثنا عبيد الله بن عبد المجيد، حدثنا إسماعيل، بن مسلم حدثني محمد بن واسع، عن مطرف بن عبد الله بن الشخير، عن عمران بن حصين، - رضى الله عنه - بهذا الحديث قال تمتع نبي الله صلى الله عليه وسلم وتمتعنا معه ‏.‏",
      "text_en": " 'Imran b. Husain (Allah be pleased with him) reported:                      We performed Tamattu' (Hajj and 'Umra combining together) in the company of Allah's Messenger (may peace be upon him), and nothing was revealed in the Qur'an (concerning the abrogation of this practice), and whatever a person (Hadhrat 'Umar) said was his personal opinion. 'Imran b. Husain narrated this hadith (in these words also):\" Allah's Apostle (may peace be upon him) performed Hajj Tamattu' and we also performed it along with him.\"",
      "chain": [
        "30170",
        "20250",
        "20297",
        "11019",
        "11395",
        "123"
      ]
    },
    {
      "hadith_no": "3086",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنيه حجاج بن الشاعر، حدثنا عبد الصمد، ح وحدثني عبد الله بن هاشم، حدثنا بهز، قالا حدثنا سليم بن حيان، بهذا الإسناد ‏.‏ مثله غير أن في رواية بهز ‏\"‏ لحللت‏\"‏ ‏.‏",
      "text_en": "  This hadith is narrated by Salim b. Hayyin with the same chain of transmitters, but with a slight variation of words.",
      "chain": [
        "20250",
        "20214",
        "20234"
      ]
    },
    {
      "hadith_no": "3093",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن المثنى، حدثني عبد الصمد، حدثنا همام، حدثنا قتادة، قال سألت أنسا كم حج رسول الله صلى الله عليه وسلم قال حجة واحدة واعتمر أربع عمر ‏.‏ ثم ذكر بمثل حديث هداب ‏.‏",
      "text_en": " Qatida said:                      I asked Anas (Allah be pleased with him) as to bow many Pilgrimages had been performed by Allah's Messenger (may peace be upon him), and he replied: One Hajj and four 'Umras were performed by him. The rest of the badith is the same.",
      "chain": [
        "30170",
        "20250",
        "20297",
        "11019"
      ]
    },
    {
      "hadith_no": "3267",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا إسحاق بن منصور، حدثنا عبد الصمد، حدثني أبي، حدثني محمد بن جحادة، عن الحكم، عن إبراهيم، عن الأسود، عن عائشة، قالت كنا نقلد الشاء فنرسل بها ورسول الله صلى الله عليه وسلم حلال لم يحرم عليه منه شىء ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      We used to garland the goats and send them (to Mecca), and Allah's Messenger (may peace be upon him) stayed back in Medina as a non-Muhrim ard nothing was forbidden for him (which is forbidden for a Muhrim).",
      "chain": [
        "30313",
        "20250",
        "20258",
        "18897",
        "11069",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "3404",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا عبيد الله بن موسى، أخبرنا شيبان، ح وحدثني إسحاق بن منصور، أخبرنا عبد الصمد، حدثنا حرب، - يعني ابن شداد - كلاهما عن يحيى بن أبي كثير، بهذا الإسناد ‏.‏ مثله ‏.‏",
      "text_en": " A hadith like this has been narrated by Yabya b. Abu Kathir with the same chain of transmitters.",
      "chain": [
        "30201",
        "20340",
        "20240",
        "30313",
        "20250",
        "20220"
      ]
    },
    {
      "hadith_no": "3474",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا زهير بن حرب، حدثنا عبد الصمد بن عبد الوارث، حدثنا حرب بن أبي، العالية حدثنا أبو الزبير، عن جابر بن عبد الله، أن النبي صلى الله عليه وسلم رأى امرأة ‏.‏ فذكر بمثله غير أنه قال فأتى امرأته زينب وهى تمعس منيئة ‏.‏ ولم يذكر تدبر في صورة شيطان ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported that Allah's Apostle (may peace be upon him) saw a woman; and the rest of the hadith was narrated but (with this exception) that he said he came to his wife Zainab, who was tanning a (piece of) leather, and he made no mention of:                     \" She retires in the shape of satan.\"",
      "chain": [
        "30022",
        "20250",
        "20535",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3528",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني أحمد بن إبراهيم الدورقي، حدثنا عبد الصمد، حدثنا شعبة، عن العلاء، وسهيل عن أبيهما، عن أبي هريرة، عن النبي صلى الله عليه وسلم ح وحدثناه محمد، بن المثنى حدثنا عبد الصمد، حدثنا شعبة، عن الأعمش، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم إلا أنهم قالوا ‏\"‏ على سوم أخيه وخطبة أخيه ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Huraira (Allah be pleased with him) through another chain of transmitters.",
      "chain": [
        "30494",
        "20250",
        "20020",
        "10606",
        "13"
      ]
    }
  ],
  "total_hadiths": 150
}