{
  "id": "20259",
  "name": "'Abdul Wahab bin 'Abdul Majeed al-Thaqaf عبد الوهاب بن عبد المجيد الثقفي",
  "full_name": "'Abdul Wahab bin 'Abdul Majeed al-Thaqaf عبد الوهاب بن عبد المجيد الثقفي",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "biography": {
    "birth": {
      "date_hijri": "108",
      "date_gregorian": "NA",
      "date_display": [
        "108 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "194",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Thaqifi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11071",
      "name": "'Abdullah bin 'Awn bin Artaban عبد الله بن عون بن أرطبان الخزار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11282",
      "name": "Khalid bin Mahran al-Hadha' خالد بن مهران الحذاء",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11585",
      "name": "Da'ud bin Abi Hnd داود بن أبي هند",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11298",
      "name": "'Awf bin Abi Jamila al-A'rabi عوف بن أبي جميلة الأعرابي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11075",
      "name": "Yonus bin 'Ubaid bin Dinar يونس بن عبيد بن دينار العبدي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10898",
      "name": "Ja'far bin Muhammad bin 'Ali جعفر بن محمد بن علي - الصادق",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11575",
      "name": "Ishaq bin Suwayd bin Hubayra إسحاق بن سويد بن هبيرة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11276",
      "name": "Habib al-Ma'lm Abu Muhammad حبيب المعلم أبو محمد البصري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11286",
      "name": "Sa'id bin Iyas al-Jariri سعيد بن إياس الجريري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "20002",
      "name": "Imam Shafi'ee ابو عبد الله محمد بن إدريس الشافعي",
      "grade": "Succ. (Taba' Tabi') [9th generation] [Shafi'ee]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30160",
      "name": "Muhammad bin Bashar Bindar محمد بن بشار بندار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30175",
      "name": "Masdad bin Masrhad مسدد بن مسرهد بن مسربل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30426",
      "name": "Ibrahim bin Muhammad bin 'Ar'ara إبراهيم بن محمد بن عرعرة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30122",
      "name": "Azhar bin Jamil bin Jinah أزهر بن جميل بن جناح",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30024",
      "name": "'Ubaidullah bin 'Umar al-Qawariri عبيد الله بن عمر القواريري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30456",
      "name": "Malik bin Abd al-Wahd مالك بن عبد الواحد أبو غسان المسمعي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20174",
      "name": "Muhammad bin 'Abdullah bin Hasan محمد بن عبد الله بن حسن بن حسن",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "30421",
      "name": "Muhammad bin Yahya bin Abi 'Umar محمد بن يحيى بن أبي عمر العدني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30459",
      "name": "Yahya bin Habib bin Arby يحيى بن حبيب بن عربي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30547",
      "name": "Swyd bin Sa'id سويد بن سعيد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36540",
      "name": "al-Hasan bin Arfh bin Yazid الحسن بن عرفة بن يزيد",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "16",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثنا عبد الوهاب الثقفي، قال حدثنا أيوب، عن أبي قلابة، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاث من كن فيه وجد حلاوة الإيمان أن يكون الله ورسوله أحب إليه مما سواهما، وأن يحب المرء لا يحبه إلا لله، وأن يكره أن يعود في الكفر كما يكره أن يقذف في النار ‏\"‏‏.‏",
      "text_en": "      Narrated Anas:                          The Prophet said, \"Whoever possesses the following three qualities      will have the sweetness (delight) of faith:     1. The one to whom Allah and His Apostle becomes dearer than anything      else.     2. Who loves a person and he loves him only for Allah's sake.     3. Who hates to revert to Atheism (disbelief) as he hates to be thrown     into the fire.\"",
      "chain": [
        "30170",
        "20259",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "182",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا عمرو بن علي، قال حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، قال أخبرني سعد بن إبراهيم، أن نافع بن جبير بن مطعم، أخبره أنه، سمع عروة بن المغيرة بن شعبة، يحدث عن المغيرة بن شعبة، أنه كان مع رسول الله صلى الله عليه وسلم في سفر، وأنه ذهب لحاجة له، وأن مغيرة جعل يصب الماء عليه، وهو يتوضأ، فغسل وجهه ويديه ومسح برأسه ومسح على الخفين‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     I was in the company of Allah's Apostle on one of the journeys and he went out to answer the call of nature (and after he finished) I poured water and he performed ablution; he washed his face, forearms and passed his wet hand over his head and over the two Khuff (socks made from thick fabric or leather).",
      "chain": [
        "30153",
        "20259",
        "11062",
        "11063",
        "11059",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "324",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد  هو ابن سلام  قال أخبرنا عبد الوهاب، عن أيوب، عن حفصة، قالت كنا نمنع عواتقنا أن يخرجن في العيدين، فقدمت امرأة فنزلت قصر بني خلف، فحدثت عن أختها، وكان زوج أختها غزا مع النبي صلى الله عليه وسلم ثنتى عشرة، وكانت أختي معه في ست‏.‏ قالت كنا نداوي الكلمى، ونقوم على المرضى، فسألت أختي النبي صلى الله عليه وسلم أعلى إحدانا بأس إذا لم يكن لها جلباب أن لا تخرج قال ‏\"‏ لتلبسها صاحبتها من جلبابها، ولتشهد الخير ودعوة المسلمين ‏\"‏‏.‏ فلما قدمت أم عطية سألتها أسمعت النبي صلى الله عليه وسلم قالت بأبي نعم  وكانت لا تذكره إلا قالت بأبي  سمعته يقول ‏\"‏ يخرج العواتق وذوات الخدور، أو العواتق ذوات الخدور والحيض، وليشهدن الخير ودعوة المؤمنين، ويعتزل الحيض المصلى ‏\"‏‏.‏ قالت حفصة فقلت الحيض فقالت أليس تشهد عرفة وكذا وكذا",
      "text_en": " Narrated Aiyub:                     Hafsa said, 'We used to forbid our young women to go out for the two `Id prayers. A woman came and stayed at the palace of Bani Khalaf and she narrated about her sister whose husband took part in twelve holy battles along with the Prophet and her sister was with her husband in six (out of these twelve). She (the woman's sister) said, \"We used to treat the wounded, look after the patients and once I asked the Prophet, 'Is there any harm for any of us to stay at home if she doesn't have a veil?' He said, 'She should cover herself with the veil of her companion and should participate in the good deeds and in the religious gathering of the Muslims.' When Um `Atiya came I asked her whether she had heard it from the Prophet. She replied, \"Yes. May my father be sacrificed for him (the Prophet)! (Whenever she mentioned the Prophet she used to say, 'May my father be sacrificed for him) I have heard the Prophet saying, 'The unmarried young virgins and the mature girl who stay often screened or the young unmarried virgins who often stay screened and the menstruating women should come out and participate in the good deeds as well as the religious gathering of the faithful believers but the menstruating women should keep away from the Musalla (praying place).' \" Hafsa asked Um `Atiya surprisingly, \"Do you say the menstruating women?\" She replied, \"Doesn't a menstruating woman attend `Arafat (Hajj) and such and such (other deeds)?\"",
      "chain": [
        "30376",
        "20259",
        "11015",
        "11039"
      ]
    },
    {
      "hadith_no": "568",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن سلام، قال أخبرنا عبد الوهاب الثقفي، قال حدثنا خالد الحذاء، عن أبي المنهال، عن أبي برزة، أن رسول الله صلى الله عليه وسلم كان يكره النوم قبل العشاء والحديث بعدها‏.‏",
      "text_en": " Narrated Abu Barza:                     Allah's Apostle disliked to sleep before the `Isha' prayer and to talk after it.",
      "chain": [
        "30376",
        "20259",
        "11282",
        "11290",
        "227"
      ]
    },
    {
      "hadith_no": "606",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد، قال أخبرنا عبد الوهاب، قال أخبرنا خالد الحذاء، عن أبي قلابة، عن أنس بن مالك، قال لما كثر الناس قال  ذكروا  أن يعلموا وقت الصلاة بشىء يعرفونه، فذكروا أن يوروا نارا أو يضربوا ناقوسا، فأمر بلال أن يشفع الأذان وأن يوتر الإقامة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     When the number of Muslims increased they discussed the question as to how to know the time for the prayer by some familiar means. Some suggested that a fire be lit (at the time of the prayer) and others put forward the proposal to ring the bell. Bilal was ordered to pronounce the wording of Adhan twice and of the Iqama once only.",
      "chain": [
        "30213",
        "20259",
        "11282",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "631",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثنا عبد الوهاب، قال حدثنا أيوب، عن أبي قلابة، قال حدثنا مالك، أتينا إلى النبي صلى الله عليه وسلم ونحن شببة متقاربون، فأقمنا عنده عشرين يوما وليلة، وكان رسول الله صلى الله عليه وسلم رحيما رفيقا، فلما ظن أنا قد اشتهينا أهلنا أو قد اشتقنا سألنا عمن تركنا بعدنا فأخبرناه قال ‏\"‏ ارجعوا إلى أهليكم فأقيموا فيهم وعلموهم ومروهم  وذكر أشياء أحفظها أو لا أحفظها  وصلوا كما رأيتموني أصلي، فإذا حضرت الصلاة فليؤذن لكم أحدكم وليؤمكم أكبركم ‏\"‏‏.‏",
      "text_en": " Narrated Malik:                     We came to the Prophet and stayed with him for twenty days and nights. We were all young and of about the same age. The Prophet was very kind and merciful. When he realized our longing for our families, he asked about our homes and the people there and we told him. Then he asked us to go back to our families and stay with them and teach them (the religion) and to order them to do good things. He also mentioned some other things which I have (remembered or [??] ) forgotten. The Prophet then added, \"Pray as you have seen me praying and when it is the time for the prayer one of you should pronounce the Adhan and the oldest of you should lead the prayer.",
      "chain": [
        "30170",
        "20259",
        "11015",
        "11047"
      ]
    },
    {
      "hadith_no": "656",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن عبد الله بن حوشب، قال حدثنا عبد الوهاب، قال حدثنا حميد، عن أنس، قال قال النبي صلى الله عليه وسلم ‏\"‏ يا بني سلمة ألا تحتسبون آثاركم ‏\"‏‏.‏ وقال مجاهد في قوله ‏{‏ونكتب ما قدموا وآثارهم‏}‏ قال خطاهم‏.‏ وقال ابن أبي مريم أخبرنا يحيى بن أيوب، حدثني حميد، حدثني أنس، أن بني سلمة، أرادوا أن يتحولوا، عن منازلهم، فينزلوا قريبا من النبي صلى الله عليه وسلم قال فكره رسول الله صلى الله عليه وسلم أن يعروا ‏{‏المدينة‏}‏ فقال ‏\"‏ ألا تحتسبون آثاركم ‏\"‏‏.‏ قال مجاهد خطاهم آثارهم أن يمشى في الأرض بأرجلهم‏.‏",
      "text_en": " Narrated Humaid:                     Anas said, \"The Prophet said, 'O Bani Salima! Don't you think that for every step of yours (that you take towards the mosque) there is a reward (while coming for prayer)?\" Mujahid said: \"Regarding Allah's Statement: \"We record that which they have sent before (them), and their traces\" (36.12). 'Their traces' means 'their steps.' \" And Anas said that the people of Bani Salima wanted to shift to a place near the Prophet but Allah's Apostle disliked the idea of leaving their houses uninhabited and said, \"Don't you think that you will get the reward for your footprints.\" Mujahid said, \"Their foot prints mean their foot steps and their going on foot.\"",
      "chain": [
        "20174",
        "20259",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "972",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا عبد الوهاب، قال حدثنا عبيد الله، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم كان تركز الحربة قدامه يوم الفطر والنحر ثم يصلي‏.‏",
      "text_en": " Narrated Ibn `Umar On the day of `Id-ul-Fitr and `Id-ul-Adha a spear used to be planted in front of:                     the Prophet I (as a Sutra for the prayer) and then he would pray.",
      "chain": [
        "30160",
        "20259",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1028",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد، قال أخبرنا عبد الوهاب، قال حدثنا يحيى بن سعيد، قال أخبرني أبو بكر بن محمد، أن عباد بن تميم، أخبره أن عبد الله بن زيد الأنصاري أخبره أن النبي صلى الله عليه وسلم خرج إلى المصلى يصلي، وأنه لما دعا  أو أراد أن يدعو  استقبل القبلة وحول رداءه‏.‏ قال أبو عبد الله ابن زيد هذا مازني، والأول كوفي هو ابن يزيد‏.‏",
      "text_en": " Narrated `Abdullah bin Zaid Al-Ansari:                     The Prophet went out towards the Musalla in order to offer the Istisqa' prayer and when he intended to invoke (Allah) or started invoking, he faced the Qibla and turned his cloak inside out.",
      "chain": [
        "30213",
        "20259",
        "11062",
        "11239",
        "639"
      ]
    },
    {
      "hadith_no": "1254",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد، حدثنا عبد الوهاب الثقفي، عن أيوب، عن محمد، عن أم عطية  رضى الله عنها  قالت دخل علينا رسول الله صلى الله عليه وسلم ونحن نغسل ابنته فقال ‏\"‏ اغسلنها ثلاثا أو خمسا أو أكثر من ذلك بماء وسدر، واجعلن في الآخرة كافورا، فإذا فرغتن فآذنني ‏\"‏‏.‏ فلما فرغنا آذناه، فألقى إلينا حقوه فقال ‏\"‏ أشعرنها إياه ‏\"‏‏.‏ فقال أيوب وحدثتني حفصة بمثل حديث محمد وكان في حديث حفصة ‏\"‏ اغسلنها وترا ‏\"‏‏.‏ وكان فيه ‏:‏ ‏\"‏ ثلاثا أو خمسا أو سبعا ‏\"‏‏.‏ وكان فيه أنه قال ‏\"‏ ابدأن بميامنها ومواضع الوضوء منها ‏\"‏‏.‏ وكان فيه أن أم عطية قالت ومشطناها ثلاثة قرون‏.‏",
      "text_en": " Narrated Um 'Atiyya:                     Allah's Apostle came to us and we were giving a bath to his (dead) daughter and said, \"Wash her three, five or more times with water and Sidr and sprinkle camphor on her at the end; and when you finish, notify me.\" So when we finished, we informed him and he gave us his waist-sheet and told us to shroud her in it. Aiyub said that Hafsa narrated to him a narration similar to that of Muhammad in which it was said that the bath was to be given for an odd number of times, and the numbers 3, 5 or 7 were mentioned. It was also said that they were to start with the right side and with the parts which were washed in ablution, and that Um 'Atiyya also mentioned, \"We combed her hair and divided them in three braids.\"",
      "chain": [
        "30213",
        "20259",
        "11015",
        "20278",
        "71"
      ]
    },
    {
      "hadith_no": "1299",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب، قال سمعت يحيى، قال أخبرتني عمرة، قالت سمعت عائشة  رضى الله عنها  قالت لما جاء النبي صلى الله عليه وسلم قتل ابن حارثة وجعفر وابن رواحة جلس يعرف فيه الحزن، وأنا أنظر من صائر الباب  شق الباب  فأتاه رجل، فقال إن نساء جعفر، وذكر بكاءهن، فأمره أن ينهاهن، فذهب ثم أتاه الثانية، لم يطعنه فقال انههن‏.‏ فأتاه الثالثة قال والله غلبننا يا رسول الله فزعمت أنه قال ‏\"‏ فاحث في أفواههن التراب ‏\"‏‏.‏ فقلت أرغم الله أنفك، لم تفعل ما أمرك رسول الله صلى الله عليه وسلم ولم تترك رسول الله صلى الله عليه وسلم من العناء‏.‏",
      "text_en": " Narrated `Aisha:                     When the Prophet got the news of the death of Ibn Haritha, Ja`far and Ibn Rawaha he sat down and looked sad and I was looking at him through the chink of the door. A man came and told him about the crying of the women of Ja`far. The Prophet ordered him to forbid them. The man went and came back saying that he had told them but they did not listen to him. The Prophet (p.b.u.h) said, \"Forbid them.\" So again he went and came back for the third time and said, \"O Allah's Apostle! By Allah, they did not listen to us at all.\" (`Aisha added): Allah's Apostle ordered him to go and put dust in their mouths. I said, (to that man) \"May Allah stick your nose in the dust (i.e. humiliate you)! You could neither (persuade the women to) fulfill the order of Allah's Apostle nor did you relieve Allah's Apostle from fatigue. \"",
      "chain": [
        "30170",
        "20259",
        "20031",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "1305",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن عبد الله بن حوشب، حدثنا عبد الوهاب، حدثنا يحيى بن سعيد، قال أخبرتني عمرة، قالت سمعت عائشة  رضى الله عنها  تقول لما جاء قتل زيد بن حارثة وجعفر وعبد الله بن رواحة، جلس النبي صلى الله عليه وسلم يعرف فيه الحزن، وأنا أطلع من شق الباب، فأتاه رجل فقال يا رسول الله إن نساء جعفر وذكر بكاءهن فأمره بأن ينهاهن، فذهب الرجل ثم أتى فقال قد نهيتهن، وذكر أنهن لم يطعنه، فأمره الثانية أن ينهاهن، فذهب، ثم أتى، فقال والله لقد غلبنني أو غلبننا الشك من محمد بن حوشب  فزعمت أن النبي صلى الله عليه وسلم قال ‏\"‏ فاحث في أفواههن التراب ‏\"‏‏.‏ فقلت أرغم الله أنفك، فوالله ما أنت بفاعل وما تركت رسول الله صلى الله عليه وسلم من العناء‏.‏",
      "text_en": " Narrated Aisha:                     When the news of the martyrdom of Zaid bin Haritha, Ja`far and `Abdullah bin Rawaha came, the Prophet sat down looking sad, and I was looking through the chink of the door. A man came and said, \"O Allah's Apostle! The women of Ja`far,\" and then he mentioned their crying . The Prophet (p.b.u.h) ordered him to stop them from crying. The man went and came back and said, \"I tried to stop them but they disobeyed.\" The Prophet (p.b.u.h) ordered him for the second time to forbid them. He went again and came back and said, \"They did not listen to me, (or \"us\": the sub-narrator Muhammad bin Haushab is in doubt as to which is right). \" (`Aisha added: The Prophet said, \"Put dust in their mouths.\" I said (to that man), \"May Allah stick your nose in the dust (i.e. humiliate you).\" By Allah, you could not (stop the women from crying) to fulfill the order, besides you did not relieve Allah's Apostle from fatigue.\"",
      "chain": [
        "20174",
        "20259",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "1349",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن عبد الله بن حوشب، حدثنا عبد الوهاب، حدثنا خالد، عن عكرمة، عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ حرم الله مكة، فلم تحل لأحد قبلي ولا لأحد بعدي، أحلت لي ساعة من نهار، لا يختلى خلاها، ولا يعضد شجرها، ولا ينفر صيدها، ولا تلتقط لقطتها إلا لمعرف ‏\"‏‏.‏ فقال العباس  رضى الله عنه  إلا الإذخر لصاغتنا وقبورنا‏.‏ فقال ‏\"‏ إلا الإذخر ‏\"‏‏.‏ وقال أبو هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم ‏\"‏ لقبورنا وبيوتنا ‏\"‏‏.‏   وقال أبان بن صالح عن الحسن بن مسلم، عن صفية بنت شيبة، سمعت النبي صلى الله عليه وسلم مثله‏.‏ وقال مجاهد عن طاوس عن ابن عباس  رضى الله عنهما  لقينهم وبيوتهم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"Allah has made Mecca a sanctuary (sacred place) and it was a sanctuary before me and will be so after me. It was made legal for me (to fight in it) for a few hours of the day. None is allowed to uproot its thorny shrubs or to cut its trees or to chase its game or to pick up its fallen things except by a person who announces it publicly.\" On that Al-Abbas said (to the Prophet), \"Except Al- Idhkhir for our goldsmiths and for our graves.\" And so the Prophet added, \"Except Al-Idhkhir. \" And Abu Huraira narrated that the Prophet said, \"Except Al-Idhkhir for our graves and houses.\" And Ibn `Abbas said, \"For their goldsmiths and houses.\"",
      "chain": [
        "20174",
        "20259",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1470",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب، قال حدثني يحيى بن سعيد، قال أخبرني عمرو، سمع أباه، عن أبي سعيد  رضى الله عنه  سمعت النبي صلى الله عليه وسلم بهذا‏.‏",
      "text_en": " Narrated Abi Sa`id Al-Khudri:                     I heard the Prophet saying (as above--No. 526)",
      "chain": [
        "30170",
        "20259",
        "11062",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "1571",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا قتيبة، حدثنا عبد الوهاب، حدثنا أيوب، عن أبي قلابة، عن أنس بن مالك  رضى الله عنه  أن النبي صلى الله عليه وسلم صلى الظهر بالمدينة أربعا، وصلى العصر بذي الحليفة ركعتين، قال وأحسبه بات بها حتى أصبح‏.‏",
      "text_en": " Narrated Abu Qilaba:                     Anas bin Malik said, \"The Prophet offered four rak`at of the Zuhr prayer in Medina and two rak`at of `Asr prayer at Dhul-Hulaifa.\" I think that the Prophet passed the night there till morning.",
      "chain": [
        "30367",
        "20259",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "1638",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب، حدثنا خالد، عن عكرمة، عن ابن عباس  رضى الله عنهما  قال طاف النبي صلى الله عليه وسلم بالبيت على بعير، كلما أتى على الركن أشار إليه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet performed Tawaf of the Ka`ba while riding a camel, and whenever he came in front of the Corner, he pointed towards it (with something).",
      "chain": [
        "30170",
        "20259",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1677",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب،‏.‏ قال وقال لي خليفة حدثنا عبد الوهاب، حدثنا حبيب المعلم، عن عطاء، عن جابر بن عبد الله  رضى الله عنهما  قال أهل النبي صلى الله عليه وسلم هو وأصحابه بالحج، وليس مع أحد منهم هدى، غير النبي صلى الله عليه وسلم وطلحة، وقدم علي من اليمن، ومعه هدى فقال أهللت بما أهل به النبي صلى الله عليه وسلم‏.‏ فأمر النبي صلى الله عليه وسلم أصحابه أن يجعلوها عمرة، ويطوفوا، ثم يقصروا ويحلوا، إلا من كان معه الهدى، فقالوا ننطلق إلى منى، وذكر أحدنا يقطر، فبلغ النبي صلى الله عليه وسلم فقال ‏\"‏ لو استقبلت من أمري ما استدبرت ما أهديت، ولولا أن معي الهدى لأحللت ‏\"‏‏.‏ وحاضت عائشة  رضى الله عنها  فنسكت المناسك كلها، غير أنها لم تطف بالبيت، فلما طهرت طافت بالبيت‏.‏ قالت يا رسول الله تنطلقون بحجة وعمرة، وأنطلق بحج فأمر عبد الرحمن بن أبي بكر أن يخرج معها إلى التنعيم، فاعتمرت بعد الحج‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet and his companions assumed Ihram for Hajj and none except the Prophet (p.b.u.h) and Talha had the Hadi (sacrifice) with them. `Ali arrived from Yemen and had a Hadi with him. `Ali said, \"I have assumed Ihram for what the Prophet has done.\" The Prophet ordered his companions to perform the `Umra with the lhram which they had assumed, and after finishing Tawaf (of Ka`ba, Safa and Marwa) to cut short their hair, and to finish their lhram except those who had Hadi with them. They (the people) said, \"How can we proceed to Mina (for Hajj) after having sexual relations with our wives?\" When that news reached the Prophet he said, \"If I had formerly known what I came to know lately, I would not have brought the Hadi with me. Had there been no Hadi with me, I would have finished the state of lhram.\" `Aisha got her menses, so she performed all the ceremonies of Hajj except Tawaf of the Ka`ba, and when she got clean (from her menses), she performed Tawaf of the Ka`ba. She said, \"O Allah's Apostle! (All of you) are returning with the Hajj and `Umra, but I am returning after performing Hajj only.\" So the Prophet ordered `Abdur-Rahman bin Abu Bakr to accompany her to Tan`im and thus she performed the `Umra after the Hajj.",
      "chain": [
        "30170",
        "30132",
        "20259",
        "11276",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "1813",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب بن عبد المجيد، عن حبيب المعلم، عن عطاء، حدثني جابر بن عبد الله  رضى الله عنهما  أن النبي صلى الله عليه وسلم أهل وأصحابه بالحج وليس مع أحد منهم هدى، غير النبي صلى الله عليه وسلم وطلحة، وكان علي قدم من اليمن، ومعه الهدى فقال أهللت بما أهل به رسول الله صلى الله عليه وسلم‏.‏ وإن النبي صلى الله عليه وسلم أذن لأصحابه أن يجعلوها عمرة، يطوفوا بالبيت، ثم يقصروا ويحلوا، إلا من معه الهدى، فقالوا ننطلق إلى منى وذكر أحدنا يقطر فبلغ النبي صلى الله عليه وسلم فقال ‏\"‏ لو استقبلت من أمري ما استدبرت ما أهديت، ولولا أن معي الهدى لأحللت ‏\"‏‏.‏ وأن عائشة حاضت فنسكت المناسك كلها، غير أنها لم تطف بالبيت قال فلما طهرت وطافت، قالت يا رسول الله أتنطلقون بعمرة وحجة، وأنطلق بالحج فأمر عبد الرحمن بن أبي بكر أن يخرج معها إلى التنعيم، فاعتمرت بعد الحج في ذي الحجة، وأن سراقة بن مالك بن جعشم لقي النبي صلى الله عليه وسلم وهو بالعقبة، وهو يرميها، فقال ألكم هذه خاصة، يا رسول الله قال ‏\"‏ لا، بل للأبد ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet and his companions assumed Ihram for Hajj and none except the Prophet and Talha had the Hadi with them. `Ali had come from Yemen and he had the Hadi with him. He (`Ali) said, \"I have assumed Ihram with an intention like that of Allah's Apostle has assumed it.\" The Prophet ordered his companions to intend the Ihram with which they had come for `Umra, to perform the Tawaf of the Ka`ba (and between Safa and Marwa), to get their hair cut short and then to finish their Ihram with the exception of those who had the Hadi with them. They asked, \"Shall we go to Mina and the private organs of some of us are dribbling (if we finish Ihram and have sexual relations with our wives)?\" The Prophet heard that and said, \"Had I known what I know now, I would not have brought the Hadi. If I did not have the Hadi with me I would have finished my Ihram.\" `Aisha got her menses and performed all the ceremonies (of Hajj) except the Tawaf . So when she became clean from her menses, and she had performed the Tawaf of the Ka`ba, she said, \"O Allah's Apostle! You (people) are returning with both Hajj and `Umra and I am returning only with Hajj!\" So, he ordered `Abdur Rahman bin Abu Bakr to go with her to at-Tan`im. Thus she performed `Umra after the Hajj in the month of Dhi-l-Hijja. Suraqa bin Malik bin Ju'sham met the Prophet at Al-`Aqaba (Jamrat-ul 'Aqaba) while the latter was stoning it and said, \"O Allah's Apostle! Is this permissible only for you?\" The Prophet replied, \"No, it is for ever (i.e. it is permissible for all Muslims to perform `Umra before Hajj.\"",
      "chain": [
        "30170",
        "20259",
        "11276",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "1864",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب، حدثنا خالد، عن عكرمة، عن ابن عباس  رضى الله عنهما  أن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله حرم مكة، فلم تحل لأحد قبلي، ولا تحل لأحد بعدي، وإنما أحلت لي ساعة من نهار، لا يختلى خلاها، ولا يعضد شجرها، ولا ينفر صيدها، ولا تلتقط لقطتها إلا لمعرف ‏\"‏‏.‏ وقال العباس يا رسول الله‏.‏ إلا الإذخر لصاغتنا وقبورنا‏.‏ فقال ‏\"‏ إلا الإذخر ‏\"‏‏.‏ وعن خالد عن عكرمة قال هل تدري ما لا ينفر صيدها هو أن ينحيه من الظل، ينزل مكانه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     \"The Prophet said, 'Allah has made Mecca, a sanctuary, so it was a sanctuary before me and will continue to be a sanctuary after me. It was made legal for me (i.e. I was allowed to fight in it) for a few hours of a day. It is not allowed to uproot its shrubs or to cut its trees, or to chase (or disturb) its game, or to pick up its luqata (fallen things) except by a person who would announce that (what he has found) publicly.' Al-`Abbas said, 'O Allah's Apostle! Except Al-Idhkhir (a kind of grass) (for it is used) by our goldsmiths and for our graves.' The Prophet then said, 'Except Al-Idhkhir.' \" `Ikrima said, 'Do you know what \"chasing or disturbing\" the game means? It means driving it out of the shade to occupy its place.\"",
      "chain": [
        "30170",
        "20259",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2097",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الوهاب، حدثنا عبيد الله، عن وهب بن كيسان، عن جابر بن عبد الله  رضى الله عنهما  قال كنت مع النبي صلى الله عليه وسلم في غزاة، فأبطأ بي جملي وأعيا، فأتى على النبي صلى الله عليه وسلم فقال ‏\"‏ جابر ‏\"‏‏.‏ فقلت نعم‏.‏ قال ‏\"‏ ما شأنك ‏\"‏‏.‏ قلت أبطأ على جملي وأعيا، فتخلفت‏.‏ فنزل يحجنه بمحجنه، ثم قال ‏\"‏ اركب ‏\"‏‏.‏ فركبت، فلقد رأيته أكفه عن رسول الله صلى الله عليه وسلم قال ‏\"‏ تزوجت ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ بكرا أم ثيبا ‏\"‏‏.‏ قلت بل ثيبا‏.‏ قال ‏\"‏ أفلا جارية تلاعبها وتلاعبك ‏\"‏‏.‏ قلت إن لي أخوات، فأحببت أن أتزوج امرأة تجمعهن، وتمشطهن، وتقوم عليهن‏.‏ قال ‏\"‏ أما إنك قادم، فإذا قدمت فالكيس الكيس ‏\"‏‏.‏ ثم قال ‏\"‏ أتبيع جملك ‏\"‏‏.‏ قلت نعم‏.‏ فاشتراه مني بأوقية، ثم قدم رسول الله صلى الله عليه وسلم قبلي، وقدمت بالغداة، فجئنا إلى المسجد، فوجدته على باب المسجد، قال ‏\"‏ الآن قدمت ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ فدع جملك، فادخل فصل ركعتين ‏\"‏‏.‏ فدخلت فصليت، فأمر بلالا أن يزن له أوقية‏.‏ فوزن لي بلال، فأرجح في الميزان، فانطلقت حتى وليت فقال ‏\"‏ ادع لي جابرا ‏\"‏‏.‏ قلت الآن يرد على الجمل، ولم يكن شىء أبغض إلى منه‏.‏ قال ‏\"‏ خذ جملك ولك ثمنه ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     I was with the Prophet in a Ghazwa (Military Expedition) and my camel was slow and exhausted. The Prophet came up to me and said, \"O Jabir.\" I replied, \"Yes?\" He said, \"What is the matter with you?\" I replied, \"My camel is slow and tired, so I am left behind.\" So, he got down and poked the camel with his stick and then ordered me to ride. I rode the camel and it became so fast that I had to hold it from going ahead of Allah's Apostle . He then asked me, have you got married?\" I replied in the affirmative. He asked, \"A virgin or a matron?\" I replied, \"I married a matron.\" The Prophet said, \"Why have you not married a virgin, so that you may play with her and she may play with you?\" Jabir replied, \"I have sisters (young in age) so I liked to marry a matron who could collect them all and comb their hair and look after them.\" The Prophet said, \"You will reach, so when you have arrived (at home), I advise you to associate with your wife (that you may have an intelligent son).\" Then he asked me, \"Would you like to sell your camel?\" I replied in the affirmative and the Prophet purchased it for one Uqiya of gold. Allah's Apostle reached before me and I reached in the morning, and when I went to the mosque, I found him at the door of the mosque. He asked me, \"Have you arrived just now?\" I replied in the affirmative. He said, \"Leave your camel and come into (the mosque) and pray two rak`at.\" I entered and offered the prayer. He told Bilal to weigh and give me one Uqiya of gold. So Bilal weighed for me fairly and I went away. The Prophet sent for me and I thought that he would return to me my camel which I hated more than anything else. But the Prophet said to me, \"Take your camel as well as its price.\"",
      "chain": [
        "30160",
        "20259",
        "11201",
        "11231",
        "34"
      ]
    },
    {
      "hadith_no": "2107",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا صدقة، أخبرنا عبد الوهاب، قال سمعت يحيى، قال سمعت نافعا، عن ابن عمر، رضى الله عنهما عن النبي صلى الله عليه وسلم قال ‏\"‏ إن المتبايعين بالخيار في بيعهما، ما لم يتفرقا، أو يكون البيع خيارا ‏\"‏‏.‏ قال نافع وكان ابن عمر إذا اشترى شيئا يعجبه فارق صاحبه‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"The buyer and the seller have the option to cancel or confirm the bargain before they separate from each other or if the sale is optional.\" Nafi` said, \"Ibn `Umar used to separate quickly from the seller if he had bought a thing which he liked.\"",
      "chain": [
        "30343",
        "20259",
        "20031",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2145",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا قتيبة، حدثنا عبد الوهاب، حدثنا أيوب، عن محمد، عن أبي هريرة  رضى الله عنه  قال نهي عن لبستين، أن يحتبي الرجل، في الثوب الواحد، ثم يرفعه على منكبه، وعن بيعتين اللماس والنباذ‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet forbade two kinds of dressing; (one of them) is to sit with one's legs drawn up while wrapped in one garment. (The other) is to lift that garment on one's shoulders. And also forbade two kinds of sale: Al-Limais and An-Nibadh.",
      "chain": [
        "30367",
        "20259",
        "11015",
        "20278",
        "13"
      ]
    },
    {
      "hadith_no": "2162",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الوهاب، حدثنا عبيد الله، عن سعيد بن أبي سعيد، عن أبي هريرة  رضى الله عنه  قال نهى النبي صلى الله عليه وسلم عن التلقي، وأن يبيع حاضر لباد‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet forbade the meeting (of caravans) on the way and the selling of goods by an inhabitant of the town on behalf of a desert dweller.",
      "chain": [
        "30160",
        "20259",
        "11201",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "2316",
      "source": " Sahih Bukhari ",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "حدثنا ابن سلام، أخبرنا عبد الوهاب الثقفي، عن أيوب، عن ابن أبي مليكة، عن عقبة بن الحارث، قال جيء بالنعيمان أو ابن النعيمان شاربا، فأمر رسول الله صلى الله عليه وسلم من كان في البيت أن يضربوا قال فكنت أنا فيمن ضربه، فضربناه بالنعال والجريد‏.‏",
      "text_en": " Narrated `Uqba bin Al-Harith:                     When An-Nuaman or his son was brought in a state of drunkenness, Allah's Apostle ordered all those who were present in the house to beat him. I was one of those who beat him. We beat him with shoes and palm-leaf stalks.",
      "chain": [
        "30376",
        "20259",
        "11015",
        "11090",
        "872"
      ]
    },
    {
      "hadith_no": "2634",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الوهاب، حدثنا أيوب، عن عمرو، عن طاوس، قال حدثني أعلمهم، بذاك  يعني ابن عباس  رضى الله عنهما  أن النبي صلى الله عليه وسلم خرج إلى أرض تهتز زرعا فقال ‏\"‏ لمن هذه ‏\"‏‏.‏ فقالوا اكتراها فلان‏.‏ فقال ‏\"‏ أما إنه لو منحها إياه كان خيرا له من أن يأخذ عليها أجرا معلوما ‏\"‏‏.‏",
      "text_en": " Narrated Tawus:                     That he was told by the most learned one amongst them (i.e. Ibn `Abbas) that the Prophet went towards some land which was flourishing with vegetation and asked to whom it belonged. He was told that such and such a person took it on rent. The Prophet said, \"It would have been better (for the owner) if he had given it to him gratis rather than charging him a fixed rent.",
      "chain": [
        "30160",
        "20259",
        "11015",
        "11081",
        "11053"
      ]
    },
    {
      "hadith_no": "2662",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا محمد بن سلام أخبرنا عبد الوهاب حدثنا خالد الحذاء عن عبد الرحمن بن أبي بكرة عن أبيه قال  أثنى رجل على رجل عند النبي صلى الله عليه وسلم فقال ويلك قطعت عنق صاحبك قطعت عنق صاحبك مرارا ثم قال من كان منكم مادحا أخاه لا محالة فليقل أحسب فلانا والله حسيبه ولا أزكي على الله أحدا أحسبه كذا وكذا إن كان يعلم ذلك منه",
      "text_en": " Narrated Abu Bakra:                     A man praised another man in front of the Prophet . The Prophet said to him, \"Woe to you, you have cut off your companion's neck, you have cut off your companion's neck,\" repeating it several times and then added, \"Whoever amongst you has to praise his brother should say, 'I think that he is so and so, and Allah knows exactly the truth, and I do not confirm anybody's good conduct before Allah, but I think him so and so,' if he really knows what he says about him.\"",
      "chain": [
        "30376",
        "20259",
        "11282",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "2709",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثني محمد بن بشار، حدثنا عبد الوهاب، حدثنا عبيد الله، عن وهب بن كيسان، عن جابر بن عبد الله  رضى الله عنهما  قال توفي أبي وعليه دين، فعرضت على غرمائه أن يأخذوا التمر بما عليه، فأبوا ولم يروا أن فيه وفاء، فأتيت النبي صلى الله عليه وسلم فذكرت ذلك له، فقال ‏\"‏ إذا جددته فوضعته في المربد آذنت رسول الله صلى الله عليه وسلم ‏\"‏‏.‏ فجاء ومعه أبو بكر وعمر فجلس عليه، ودعا بالبركة ثم قال ‏\"‏ ادع غرماءك، فأوفهم ‏\"‏‏.‏ فما تركت أحدا له على أبي دين إلا قضيته، وفضل ثلاثة عشر وسقا سبعة عجوة، وستة لون أو ستة عجوة وسبعة لون، فوافيت مع رسول الله صلى الله عليه وسلم المغرب فذكرت ذلك له فضحك فقال ‏\"‏ ائت أبا بكر وعمر فأخبرهما ‏\"‏‏.‏ فقالا لقد علمنا إذ صنع رسول الله صلى الله عليه وسلم ما صنع أن سيكون ذلك‏.‏ وقال هشام عن وهب عن جابر صلاة العصر‏.‏ ولم يذكر أبا بكر ولا ضحك، وقال وترك أبي عليه ثلاثين وسقا دينا‏.‏ وقال ابن إسحاق عن وهب عن جابر صلاة الظهر‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     My father died and was in debt. I suggested that his creditors take the fruits (i.e. dates) of my garden in lieu of the debt of my father, but they refused the offer, as they thought that it would not cover the full debt. So, I went to the Prophet and told him about it. He said (to me), \"When you pluck the dates and collect them in the Mirbad (i.e. a place where dates are dried), call me (Allah's Apostle).\" Finally he came accompanied by Abu Bakr and `Umar and sat on the dates and invoked Allah to bless them. Then he said, \"Call your creditors and give them their full rights.\" So, I paid all my father's creditors in full and yet thirteen extra Wasqs of dates remained, seven of which were 'Ajwa and six were Laun or six of which were Ajwa and seven were Laun. I met Allah's Apostle at sunset and informed him about it. On that he smiled and said, \"Go to Abu Bakr and `Umar and tell them about it.\" They said, \"We perceived that was going to happen, as Allah's Apostle did what he did.\"",
      "chain": [
        "30160",
        "20259",
        "11201",
        "11231",
        "34"
      ]
    },
    {
      "hadith_no": "2812",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا عبد الوهاب، حدثنا خالد، عن عكرمة، أن ابن عباس، قال له ولعلي بن عبد الله ائتيا أبا سعيد فاسمعا من حديثه‏.‏ فأتيناه وهو وأخوه في حائط لهما يسقيانه، فلما رآنا جاء فاحتبى وجلس فقال كنا ننقل لبن المسجد لبنة لبنة، وكان عمار ينقل لبنتين لبنتين، فمر به النبي صلى الله عليه وسلم ومسح عن رأسه الغبار وقال ‏\"‏ ويح عمار، تقتله الفئة الباغية، عمار يدعوهم إلى الله ويدعونه إلى النار ‏\"‏‏.‏",
      "text_en": " Narrated `Ikrima:                     that Ibn `Abbas told him and `Ali bin `Abdullah to go to Abu Sa`id and listen to some of his narrations; So they both went (and saw) Abu Sa`id and his brother irrigating a garden belonging to them. When he saw them, he came up to them and sat down with his legs drawn up and wrapped in his garment and said, \"(During the construction of the mosque of the Prophet) we carried the adobe of the mosque, one brick at a time while `Ammar used to carry two at a time. The Prophet passed by `Ammar and removed the dust off his head and said, \"May Allah be merciful to `Ammar. He will be killed by a rebellious aggressive group. `Ammar will invite them to (obey) Allah and they will invite him to the (Hell) fire.\"",
      "chain": [
        "30309",
        "20259",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2915",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثني محمد بن المثنى، حدثنا عبد الوهاب، حدثنا خالد، عن عكرمة، عن ابن عباس  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم وهو في قبة ‏\"‏ اللهم إني أنشدك عهدك ووعدك، اللهم إن شئت لم تعبد بعد اليوم ‏\"‏‏.‏ فأخذ أبو بكر بيده فقال حسبك يا رسول الله، فقد ألححت على ربك، وهو في الدرع، فخرج وهو يقول ‏{‏سيهزم الجمع ويولون الدبر * بل الساعة موعدهم والساعة أدهى وأمر ‏}‏‏.‏ وقال وهيب حدثنا خالد يوم بدر‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet , while in a tent (on the day of the battle of Badr) said, \"O Allah! I ask you the fulfillment of Your Covenant and Promise. O Allah! If You wish (to destroy the believers) You will never be worshipped after today.\" Abu Bakr caught him by the hand and said, \"This is sufficient, O Allah's Apostle! You have asked Allah pressingly.\" The Prophet was clad in his armor at that time. He went out, saying to me: \"There multitude will be put to flight and they will show their backs. Nay, but the Hour is their appointed time (for their full recompense) and that Hour will be more grievous and more bitter (than their worldly failure).\" (54.45-46) Khalid said that was on the day of the battle of Badr.",
      "chain": [
        "30170",
        "20259",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2981",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب، قال سمعت يحيى، قال أخبرني بشير بن يسار، أن سويد بن النعمان  رضى الله عنه  أخبره أنه، خرج مع النبي صلى الله عليه وسلم عام خيبر، حتى إذا كانوا بالصهباء  وهى من خيبر وهى أدنى خيبر  فصلوا العصر، فدعا النبي صلى الله عليه وسلم بالأطعمة، فلم يؤت النبي صلى الله عليه وسلم إلا بسويق، فلكنا فأكلنا وشربنا، ثم قام النبي صلى الله عليه وسلم فمضمض ومضمضنا، وصلينا‏.‏",
      "text_en": " Narrated Suwaid bin An-Nu`man:                     That he went out in the company o; the Prophet during the year of Khaibar (campaign till they reached a place called As-Sahba', the lower part of Khaibar. They offered the `Asr prayer (there) and the Prophet asked for the food. Nothing but Sawiq was brought to the Prophet. So, they chewed it and ate it and drank water. After that the Prophet got up, washed his mouth, and they too washed their mouths and then offered the prayer.",
      "chain": [
        "30170",
        "20259",
        "20031",
        "11810",
        "1924"
      ]
    },
    {
      "hadith_no": "2986",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد الوهاب، حدثنا أيوب، عن أبي قلابة، عن أنس  رضى الله عنه  قال كنت رديف أبي طلحة، وإنهم ليصرخون بهما جميعا الحج والعمرة‏.‏",
      "text_en": " Narrated Anas:                     I was riding behind Abu Talha (on the same) riding animal and (the Prophet's companions) were reciting Talbiya aloud for both Hajj and `Umra.",
      "chain": [
        "30367",
        "20259",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "3108",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثني محمد بن بشار، حدثنا عبد الوهاب، حدثنا أيوب، عن حميد بن هلال، عن أبي بردة، قال أخرجت إلينا عائشة  رضى الله عنها  كساء ملبدا وقالت في هذا نزع روح النبي صلى الله عليه وسلم‏.‏ وزاد سليمان عن حميد عن أبي بردة قال أخرجت إلينا عائشة إزارا غليظا مما يصنع باليمن، وكساء من هذه التي يدعونها الملبدة‏.‏",
      "text_en": " Narrated Abu Burda:                     `Aisha brought out to us a patched wool Len garment, and she said, \"(It chanced that) the soul of Allah's Apostle was taken away while he was wearing this.\" Abu-Burda added, \"Aisha brought out to us a thick waist sheet like the ones made by the Yemenites, and also a garment of the type called Al- Mulabbada.\"",
      "chain": [
        "30160",
        "20259",
        "11015",
        "11281",
        "11901"
      ]
    },
    {
      "hadith_no": "3197",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب، حدثنا أيوب، عن محمد بن سيرين، عن ابن أبي بكرة، عن أبي بكرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الزمان قد استدار كهيئته يوم خلق السموات والأرض، السنة اثنا عشر شهرا، منها أربعة حرم، ثلاثة متواليات ذو القعدة وذو الحجة والمحرم، ورجب مضر الذي بين جمادى وشعبان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet said. \"(The division of time has turned to its original form which was current when Allah created the Heavens and the Earths. The year is of twelve months, out of which four months are sacred: Three are in succession Dhul-Qa' da, Dhul-Hijja and Muharram, and (the fourth is) Rajab of (the tribe of) Mudar which comes between Jumadi-ath-Thaniyah and Sha ban.\"",
      "chain": [
        "30170",
        "20259",
        "11015",
        "11035",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "3554",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني محمد، أخبرنا عبد الوهاب الثقفي، عن أيوب، عن محمد، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ أسلم سالمها الله، وغفار غفر الله لها ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"May Allah save the tribe of Aslam, and may Allah forgive the tribe of Ghifar!\"",
      "chain": [
        "30213",
        "20259",
        "11015",
        "20278",
        "13"
      ]
    },
    {
      "hadith_no": "3700",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا معلى، وموسى، قالا حدثنا وهيب، عن أيوب، وقال، ‏\"‏ لو كنت متخذا خليلا لاتخذته خليلا، ولكن أخوة الإسلام أفضل ‏\"‏‏.‏ حدثنا قتيبة، حدثنا عبد الوهاب، عن أيوب، مثله‏.‏",
      "text_en": " Narrated Aiyub:                     The Prophet said, \"If I were to take a Khalil, I would have taken him (i.e. Abu Bakr) as a Khalil, but the Islamic brotherhood is better.\"",
      "chain": [
        "30457",
        "20040",
        "20299",
        "11015",
        "30367",
        "20259"
      ]
    },
    {
      "hadith_no": "3771",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني محمد بن المثنى، حدثنا عبد الوهاب، قال سمعت يحيى، قال سمعت سعيد بن المسيب، قال سمعت سعدا، يقول جمع لي النبي صلى الله عليه وسلم أبويه يوم أحد‏.‏",
      "text_en": " Narrated Sa`d:                     On the day of the battle of Uhud the Prophet mentioned for me both his parents (i.e. saying, \"Let my parents be sacrificed for you.\").",
      "chain": [
        "30170",
        "20259",
        "20031",
        "11002",
        "9"
      ]
    },
    {
      "hadith_no": "3817",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني محمد بن بشار، حدثنا عبد الوهاب بن عبد المجيد، حدثنا ابن عون، عن القاسم بن محمد، أن عائشة، اشتكت، فجاء ابن عباس فقال يا أم المؤمنين، تقدمين على فرط صدق على رسول الله صلى الله عليه وسلم وعلى أبي بكر‏.‏",
      "text_en": " Narrated Al-Qasim bin Muhammad:                     Once `Aisha became sick and Ibn `Abbas went to see her and said, \"O mother of the believers! You are leaving for truthful fore-runners i.e. for Allah's Apostle and Abu Bakr.",
      "chain": [
        "30160",
        "20259",
        "11071",
        "10535"
      ]
    },
    {
      "hadith_no": "4001",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن عبد الله بن حوشب، حدثنا عبد الوهاب، حدثنا خالد، عن عكرمة، عن ابن عباس، قال قال النبي صلى الله عليه وسلم يوم بدر ‏\"‏ اللهم أنشدك عهدك ووعدك، اللهم إن شئت لم تعبد ‏\"‏‏.‏ فأخذ أبو بكر بيده فقال حسبك‏.‏ فخرج وهو يقول ‏{‏سيهزم الجمع ويولون الدبر‏}‏",
      "text_en": " Narrated Ibn `Abbas:                     On the day of the battle of Badr, the Prophet said, \"O Allah! I appeal to You (to fulfill) Your Covenant and Promise. O Allah! If Your Will is that none should worship You (then give victory to the pagans).\" Then Abu Bakr took hold of him by the hand and said, \"This is sufficient for you.\" The Prophet came out saying, \"Their multitude will be put to flight and they will show their backs.\" (54.45)",
      "chain": [
        "20174",
        "20259",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4045",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إبراهيم بن موسى، أخبرنا عبد الوهاب، حدثنا خالد، عن عكرمة، عن ابن عباس  رضى الله عنهما  أن النبي صلى الله عليه وسلم قال يوم بدر ‏\"‏ هذا جبريل آخذ برأس فرسه  عليه أداة الحرب ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said on the day (of the battle) of Badr, \"This is Gabriel holding the head of his horse and equipped with arms for the battle.",
      "chain": [
        "30309",
        "20259",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4091",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا عبد الوهاب، حدثنا خالد، عن عكرمة، عن ابن عباس  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم يوم أحد ‏\"‏ هذا جبريل آخذ برأس فرسه عليه أداة الحرب ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     On the day of Uhud. the Prophet said, \"This is Gabriel holding the head of his horse and equipped with war material.'",
      "chain": [
        "30309",
        "20259",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4248",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا عبد الوهاب، حدثنا أيوب، عن محمد، عن أنس بن مالك  رضى الله عنه أن رسول الله صلى الله عليه وسلم جاءه جاء فقال أكلت الحمر‏.‏ فسكت، ثم أتاه الثانية فقال أكلت الحمر‏.‏ فسكت، ثم الثالثة فقال أفنيت الحمر‏.‏ فأمر مناديا فنادى في الناس إن الله ورسوله ينهيانكم عن لحوم الحمر الأهلية‏.‏ فأكفئت القدور، وإنها لتفور باللحم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Someone came to Allah's Apostles and said, \"The donkeys have been eaten (by the Muslims).\" The Prophet kept quiet. Then the man came again and said, \"The donkeys have been eaten.\" The Prophet kept quiet. The man came to him the third time and said, \"The donkeys have been consumed.\" On that the Prophet ordered an announcer to announce to the people, \"Allah and His Apostle forbid you to eat the meat of donkeys.\" Then the cooking pots were upset while the meat was still boiling in them.",
      "chain": [
        "30143",
        "20259",
        "11015",
        "20278",
        "19"
      ]
    },
    {
      "hadith_no": "4308",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا قتيبة، حدثنا عبد الوهاب، قال سمعت يحيى بن سعيد، قال أخبرتني عمرة، قالت سمعت عائشة  رضى الله عنها  تقول لما جاء قتل ابن حارثة وجعفر بن أبي طالب وعبد الله بن رواحة  رضى الله عنهم  جلس رسول الله صلى الله عليه وسلم يعرف فيه الحزن  قالت عائشة  وأنا أطلع من صائر الباب  تعني من شق الباب  فأتاه رجل فقال أى رسول الله إن نساء جعفر قال وذكر بكاءهن، فأمره أن ينهاهن قال فذهب الرجل ثم أتى فقال قد نهيتهن‏.‏ وذكر أنه لم يطعنه قال فأمر أيضا فذهب ثم أتى فقال والله لقد غلبننا‏.‏ فزعمت أن رسول الله صلى الله عليه وسلم قال ‏\"‏ فاحث في أفواههن من التراب ‏\"‏ قالت عائشة فقلت أرغم الله أنفك، فوالله ما أنت تفعل، وما تركت رسول الله صلى الله عليه وسلم من العناء‏.‏",
      "text_en": " Narrated `Amra:                     I heard `Aisha saying, \"When the news of the martyrdom of Ibn Haritha, Ja`far bin Abi Talib and `Abdullah bin Rawaka reached, Allah's Apostle sat with sorrow explicit on his face.\" `Aisha added, \"I was then peeping through a chink in the door. A man came to him and said, \"O Allah's Apostle! The women of Ja`far are crying.' Thereupon the Prophet told him to forbid them to do so. So the man went away and returned saying, \"I forbade them but they did not listen to me.\" The Prophet ordered him again to go (and forbid them). He went again and came saying, 'By Allah, they overpowered me (i.e. did not listen to me).\" `Aisha said that Allah's Apostle said (to him), \"Go and throw dust into their mouths.\" Aisha added, \"I said, May Allah put your nose in the dust! By Allah, neither have you done what you have been ordered, nor have you relieved Allah's Apostle from trouble.\"",
      "chain": [
        "30367",
        "20259",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "4450",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن المثنى، حدثنا عبد الوهاب، حدثنا أيوب، عن محمد، عن ابن أبي بكرة، عن أبي بكرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ الزمان قد استدار كهيئة يوم خلق السموات والأرض، السنة اثنا عشر شهرا منها أربعة حرم ثلاثة متواليات ذو القعدة وذو الحجة والمحرم، ورجب مضر الذي بين جمادى وشعبان، أى شهر هذا ‏\"‏ قلنا الله ورسوله أعلم‏.‏ فسكت حتى ظننا أنه سيسميه بغير اسمه‏.‏ قال ‏\"‏ أليس ذو الحجة ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ فأى بلد هذا ‏\"‏‏.‏ قلنا الله ورسوله أعلم، فسكت حتى ظننا أنه سيسميه بغير اسمه‏.‏ قال ‏\"‏ أليس البلدة ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ فأى يوم هذا ‏\"‏ قلنا الله ورسوله أعلم، فسكت حتى ظننا أنه سيسميه بغير اسمه‏.‏ قال ‏\"‏ أليس يوم النحر ‏\"‏‏.‏ قلنا بلى‏.‏ قال ‏\"‏ فإن دماءكم وأموالكم  قال محمد وأحسبه قال وأعراضكم  عليكم حرام كحرمة يومكم هذا، في بلدكم هذا، في شهركم هذا وستلقون ربكم، فسيسألكم عن أعمالكم، ألا فلا ترجعوا بعدي ضلالا، يضرب بعضكم رقاب بعض، ألا ليبلغ الشاهد الغائب، فلعل بعض من يبلغه أن يكون أوعى له من بعض من سمعه  فكان محمد إذا ذكره يقول صدق محمد صلى الله عليه وسلم ثم قال  ألا هل بلغت‏.‏ مرتين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet said, \"Time has taken its original shape which it had when Allah created the Heavens and the Earth. The year is of twelve months, four of which are sacred, and out of these (four) three are in succession, i.e. Dhul-Qa'da, Dhul-Hijja and Al-Muharram, and the fourth is Rajab which is named after the Mudar tribe, between (the month of) Jumaida (ath-thania) and Sha'ban.\" Then the Prophet asked, \"Which is this month?\" We said, \"Allah and His Apostle know better.\" On that the Prophet kept quiet so long that we thought that he might name it with another name. Then the Prophet said, \"Isn't it the month of Dhul-Hijja?\" We replied, \"Yes.\" Then he said, \"Which town is this?\" \"We replied, \"Allah and His Apostle know better.\" On that he kept quiet so long that we thought that he might name it with another name. Then he said, \"Isn't it the town of Mecca?\" We replied, \"Yes, \" Then he said, \"Which day is today?\" We replied, \"Allah and His Apostle know better.\" He kept quiet so long that we thought that he might name it with another name. Then he said, \"Isn't it the day of An- Nahr (i.e. sacrifice)?\" We replied, \"Yes.\" He said, \"So your blood, your properties, (The sub-narrator Muhammad said, 'I think the Prophet also said: And your honor..) are sacred to one another like the sanctity of this day of yours, in this city of yours, in this month of yours; and surely, you will meet your Lord, and He will ask you about your deeds. Beware! Do not become infidels after me, cutting the throats of one another. It is incumbent on those who are present to convey this message (of mine) to those who are absent. May be that some of those to whom it will be conveyed will understand it better than those who have actually heard it.\" (The sub-narrator, Muhammad, on remembering that narration, used to say, \"Muhammad spoke the truth!\") He (i.e. Prophet) then added twice, \"No doubt! Haven't I conveyed (Allah's Message) to you?\"",
      "chain": [
        "30170",
        "20259",
        "11015",
        "20278",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "4554",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الوهاب، حدثنا عبيد الله، عن نافع، عن ابن عمر  رضى الله عنهما  أتاه رجلان في فتنة ابن الزبير فقالا إن الناس قد ضيعوا، وأنت ابن عمر وصاحب النبي صلى الله عليه وسلم فما يمنعك أن تخرج فقال يمنعني أن الله حرم دم أخي‏.‏ فقالا ألم يقل الله ‏{‏وقاتلوهم حتى لا تكون فتنة ‏}‏ فقال قاتلنا حتى لم تكن فتنة، وكان الدين لله، وأنتم تريدون أن تقاتلوا حتى تكون فتنة، ويكون الدين لغير الله‏.‏       وزاد عثمان بن صالح عن ابن وهب، قال أخبرني فلان، وحيوة بن شريح، عن بكر بن عمرو المعافري، أن بكير بن عبد الله، حدثه عن نافع، أن رجلا، أتى ابن عمر فقال يا أبا عبد الرحمن ما حملك على أن تحج عاما وتعتمر عاما، وتترك الجهاد في سبيل الله عز وجل، وقد علمت ما رغب الله فيه قال يا ابن أخي بني الإسلام على خمس إيمان بالله ورسوله، والصلاة الخمس، وصيام رمضان، وأداء الزكاة، وحج البيت‏.‏ قال يا أبا عبد الرحمن، ألا تسمع ما ذكر الله في كتابه ‏{‏وإن طائفتان من المؤمنين اقتتلوا فأصلحوا بينهما‏}‏ ‏{‏إلى أمر الله‏}‏ ‏{‏قاتلوهم حتى لا تكون فتنة‏}‏ قال فعلنا على عهد رسول الله صلى الله عليه وسلم وكان الإسلام قليلا، فكان الرجل يفتن في دينه إما قتلوه، وإما يعذبوه، حتى كثر الإسلام فلم تكن فتنة‏.‏       قال فما قولك في علي وعثمان قال أما عثمان فكأن الله عفا عنه، وأما أنتم فكرهتم أن تعفوا عنه، وأما علي فابن عم رسول الله صلى الله عليه وسلم وختنه‏.‏ وأشار بيده فقال هذا بيته حيث ترون‏.‏",
      "text_en": " Narrated Nafi`:                     During the affliction of Ibn Az-Zubair, two men came to Ibn `Umar and said, \"The people are lost, and you are the son of `Umar, and the companion of the Prophet, so what forbids you from coming out?\" He said, \"What forbids me is that Allah has prohibited the shedding of my brother's blood.\" They both said, \"Didn't Allah say, 'And fight then until there is no more affliction?\" He said \"We fought until there was no more affliction and the worship is for Allah (Alone while you want to fight until there is affliction and until the worship become for other than Allah.\" Narrated Nafi` (through another group of sub-narrators): A man came to Ibn `Umar and said, \"O Abu `Abdur Rahman! What made you perform Hajj in one year and Umra in another year and leave the Jihad for Allah' Cause though you know how much Allah recommends it?\" Ibn `Umar replied, \"O son of my brother! Islam is founded on five principles, i.e. believe in Allah and His Apostle, the five compulsory prayers, the fasting of the month of Ramadan, the payment of Zakat, and the Hajj to the House (of Allah).\" The man said, \"O Abu `Abdur Rahman! Won't you listen to why Allah has mentioned in His Book: 'If two groups of believers fight each other, then make peace between them, but if one of then transgresses beyond bounds against the other, then you all fight against the one that transgresses. (49.9) and:--\"And fight them till there is no more affliction (i.e. no more worshiping of others along with Allah).\" Ibn `Umar said, \"We did it, during the lifetime of Allah's Apostle when Islam had only a few followers. A man would be put to trial because of his religion; he would either be killed or tortured. But when the Muslims increased, there was no more afflictions or oppressions.\" The man said, \"What is your opinion about `Uthman and `Ali?\" Ibn `Umar said, \"As for `Uthman, it seems that Allah has forgiven him, but you people dislike that he should be forgiven. And as for `Ali, he is the cousin of Allah's Apostle and his son-in-law.\" Then he pointed with his hand and said, \"That is his house which you see.\"",
      "chain": [
        "30160",
        "20259",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4801",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب بن عبد المجيد، حدثنا ابن عون، عن القاسم، أن ابن عباس  رضى الله عنه  استأذن على عائشة نحوه‏.‏ ولم يذكر نسيا منسيا‏.‏",
      "text_en": " Narrated Al-Qasim:                     Ibn `Abbas asked `Aisha's permission to enter. Al-Qasim then narrated the whole Hadith (as in 277) but did not mention: \"Would that I had been forgotten and out of sight.\"",
      "chain": [
        "30170",
        "20259",
        "11071",
        "10535",
        "17"
      ]
    },
    {
      "hadith_no": "4924",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن عبد الله بن حوشب، حدثنا عبد الوهاب، حدثنا خالد، عن عكرمة، عن ابن عباس،‏.‏ وحدثني محمد، حدثنا عفان بن مسلم، عن وهيب، حدثنا خالد، عن عكرمة، عن ابن عباس  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال وهو في قبة يوم بدر ‏\"‏ اللهم إني أنشدك عهدك ووعدك، اللهم إن تشأ لا تعبد بعد اليوم ‏\"‏‏.‏ فأخذ أبو بكر بيده فقال حسبك يا رسول الله، ألححت على ربك‏.‏ وهو يثب في الدرع، فخرج وهو يقول ‏\"‏ ‏{‏سيهزم الجمع ويولون الدبر‏}‏‏.‏‏\"‏",
      "text_en": " Narrated `Abbas:                     Allah's Apostle while in a tent on the day of the Battle of Badr, said, \"O Allah! I request you (to fulfill) Your promise and contract! O Allah! If You wish that you will not be worshipped henceforth..\" On that Abu Bakr held the Prophet by the hand and said, \"That is enough, O Allah's Apostle You have appealed to your Lord too pressingly,\" while the Prophet was putting on his armor. So Allah's Apostle went out, reciting Their multitude will be put to flight, and they will show their backs.' (54.45)",
      "chain": [
        "20174",
        "20259",
        "11282",
        "11023",
        "11035",
        "30106",
        "20299",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "5328",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا أزهر بن جميل، حدثنا عبد الوهاب الثقفي، حدثنا خالد، عن عكرمة، عن ابن عباس،‏.‏ أن امرأة، ثابت بن قيس أتت النبي صلى الله عليه وسلم فقالت يا رسول الله ثابت بن قيس ما أعتب عليه في خلق ولا دين، ولكني أكره الكفر في الإسلام‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أتردين عليه حديقته ‏\"‏‏.‏ قالت نعم‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ اقبل الحديقة وطلقها تطليقة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The wife of Thabit bin Qais came to the Prophet and said, \"O Allah's Apostle! I do not blame Thabit for defects in his character or his religion, but I, being a Muslim, dislike to behave in un-Islamic manner (if I remain with him).\" On that Allah's Apostle said (to her), \"Will you give back the garden which your husband has given you (as Mahr)?\" She said, \"Yes.\" Then the Prophet said to Thabit, \"O Thabit! Accept your garden, and divorce her once.\"",
      "chain": [
        "30122",
        "20259",
        "11282",
        "11023"
      ]
    },
    {
      "hadith_no": "5337",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد الوهاب، عن أيوب، عن عكرمة، عن ابن عباس  رضى الله عنهما  قال كان زوج بريرة عبدا أسود يقال له مغيث، عبدا لبني فلان، كأني أنظر إليه يطوف وراءها في سكك المدينة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Barira's husband was a black slave called Mughith, the slave of Bani so-and-so-- as if I am seeing him now, walking behind her along the streets of Medina.",
      "chain": [
        "30367",
        "20259",
        "11015",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "5338",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا محمد، أخبرنا عبد الوهاب، حدثنا خالد، عن عكرمة، عن ابن عباس، أن زوج، بريرة كان عبدا يقال له مغيث كأني أنظر إليه يطوف خلفها يبكي، ودموعه تسيل على لحيته، فقال النبي صلى الله عليه وسلم لعباس ‏\"‏ يا عباس ألا تعجب من حب مغيث بريرة، ومن بغض بريرة مغيثا ‏\"‏‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لو راجعته ‏\"‏‏.‏ قالت يا رسول الله تأمرني قال ‏\"‏ إنما أنا أشفع ‏\"‏‏.‏ قالت لا حاجة لي فيه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Barira's husband was a slave called Mughith, as if I am seeing him now, going behind Barira and weeping with his tears flowing down his beard. The Prophet said to `Abbas, \"O `Abbas ! are you not astonished at the love of Mughith for Barira and the hatred of Barira for Mughith?\" The Prophet then said to Barira, \"Why don't you return to him?\" She said, \"O Allah's Apostle! Do you order me to do so?\" He said, \"No, I only intercede for him.\" She said, \"I am not in need of him.\"",
      "chain": [
        "30213",
        "20259",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "5384",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثني محمد، أخبرنا عبد الوهاب، حدثنا يونس، عن الحسن، قال زوج معقل أخته فطلقها تطليقة‏.‏",
      "text_en": " Narrated Al-Hasan:                     Ma'qil gave his sister in marriage and later her husband divorced her once.",
      "chain": [
        "30213",
        "20259",
        "20475",
        "11016"
      ]
    }
  ],
  "total_hadiths": 239
}