{
  "id": "20260",
  "name": "'Ubaidullah bin Abd عبيد الله بن عبد المجيد",
  "full_name": "'Ubaidullah bin Abd عبيد الله بن عبد المجيد",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "209",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-Hanfi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "10704",
      "name": "'Ikrama bin 'Ammar عكرمة بن عمار العجلي أبو عمار اليمامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "22025",
      "name": "Isma'il bin Muslima إسماعيل بن مسلمة بن قعنب الحارثي القعنب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "16056",
      "name": "'Abdullah bin Zryr عبد الله بن زرير",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "20234",
      "name": "Saleem bin Hiyyan سليم بن حيان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20439",
      "name": "'Abdur Rahman bin 'Abdullah bin Dinar عبد الرحمن بن عبد الله بن دينار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11301",
      "name": "Qurrah bin Khalid al-Sadusi قرة بن خالد السدوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20358",
      "name": "Malik bin Mghwl مالك بن مغول",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20297",
      "name": "Hmam bin Yahya bin Dinar همام بن يحيى بن دينار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20295",
      "name": "Hisham bin Abi 'Abdullah al-Dastawa'i هشام بن أبي عبد الله الدستوائي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11845",
      "name": "Da'ud bin Qays al-Fra'a داود بن قيس الفراء الدباغ",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30160",
      "name": "Muhammad bin Bashar Bindar محمد بن بشار بندار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30153",
      "name": "'Amr bin 'Ali bin Bahr al-Bahli عمرو بن علي بن بحر الباهلي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30313",
      "name": "Ishaq bin Mansur al-Kausaj إسحاق بن منصور بن بهرام - الكوسج",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30296",
      "name": "Ahmed bin Sa'id bin Sakhar أحمد بن سعيد بن صخر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30142",
      "name": "'Abdullah bin al-Sabah bin 'Abdullah عبد الله بن الصباح بن عبد الله",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30025",
      "name": "'Abdullah bin 'Abdur Rahman al-Daarimi عبد الله بن عبد الرحمن الدارمي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38834",
      "name": "Hajjaj bin Yusuf bin al-Sha'ir حجاج بن يوسف الشاعر",
      "grade": "3rd Century AH"
    },
    {
      "id": "38088",
      "name": "Ibrahim bin Y'aqub bin Ishaq إبراهيم بن يعقوب بن إسحاق",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "34255",
      "name": "Muhammad bin Yonus al-Kadaymi محمد بن يونس بن موسى الكديمي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "600",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن الصباح، قال حدثنا أبو علي الحنفي، حدثنا قرة بن خالد، قال انتظرنا الحسن وراث علينا حتى قربنا من وقت قيامه، فجاء فقال دعانا جيراننا هؤلاء‏.‏ ثم قال قال أنس نظرنا النبي صلى الله عليه وسلم ذات ليلة حتى كان شطر الليل يبلغه، فجاء فصلى لنا، ثم خطبنا فقال ‏\"‏ ألا إن الناس قد صلوا ثم رقدوا، وإنكم لم تزالوا في صلاة ما انتظرتم الصلاة ‏\"‏‏.‏ قال الحسن وإن القوم لا يزالون بخير ما انتظروا الخير‏.‏ قال قرة هو من حديث أنس عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Qurra bin Khalid:                     Once he waited for Al-Hasan and he did not show up till it was about the usual time for him to start his speech; then he came and apologized saying, \"Our neighbors invited us.\" Then he added, \"Narrated Anas, 'Once we waited for the Prophet till it was midnight or about midnight. He came and led the prayer, and after finishing it, he addressed us and said, 'All the people prayed and then slept and you had been in prayer as long as you were waiting for it.\" Al-Hasan said, \"The people are regarded as performing good deeds as long as they are waiting for doing good deeds.\" Al-Hasan's statement is a portion of Anas's [??] Hadith from the Prophet .",
      "chain": [
        "30142",
        "20260",
        "11301"
      ]
    },
    {
      "hadith_no": "1139",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا إسحاق، قال حدثنا عبيد الله، قال أخبرنا إسرائيل، عن أبي حصين، عن يحيى بن وثاب، عن مسروق، قال سألت عائشة  رضى الله عنها  عن صلاة رسول الله صلى الله عليه وسلم بالليل‏.‏ فقالت سبع وتسع وإحدى عشرة سوى ركعتى الفجر‏.‏",
      "text_en": " Narrated Masruq:                     I asked Aisha about the night prayer of Allah's Apostle and she said, \"It was seven, nine or eleven rak`at besides the two rak`at of the Fajr prayer (i.e. Sunna). \"",
      "chain": [
        "30313",
        "20260",
        "20311",
        "11371",
        "11664",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "2159",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثني عبد الله بن صباح، حدثنا أبو علي الحنفي، عن عبد الرحمن بن عبد الله بن دينار، قال حدثني أبي، عن عبد الله بن عمر  رضى الله عنهما  قال نهى رسول الله صلى الله عليه وسلم أن يبيع حاضر لباد‏.‏ وبه قال ابن عباس‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle forbade the selling of the goods of a desert dweller by a town person.",
      "chain": [
        "30142",
        "20260",
        "20439",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "4779",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا هاشم بن القاسم، ح وحدثنا إسحاق بن، إبراهيم أخبرنا أبو عامر العقدي، كلاهما عن عكرمة بن عمار، ح وحدثنا عبد الله بن، عبد الرحمن الدارمي - وهذا حديثه - أخبرنا أبو علي الحنفي، عبيد الله بن عبد المجيد حدثنا عكرمة، - وهو ابن عمار - حدثني إياس بن سلمة، حدثني أبي قال، قدمنا الحديبية مع رسول الله صلى الله عليه وسلم ونحن أربع عشرة مائة وعليها خمسون شاة لا ترويها - قال - فقعد رسول الله صلى الله عليه وسلم على جبا الركية فإما دعا وإما بسق فيها - قال - فجاشت فسقينا واستقينا ‏.‏ قال ثم إن رسول الله صلى الله عليه وسلم دعانا للبيعة في أصل الشجرة ‏.‏ قال فبايعته أول الناس ثم بايع وبايع حتى إذا كان في وسط من الناس قال ‏\"‏ بايع يا سلمة ‏\"‏ ‏.‏ قال قلت قد بايعتك يا رسول الله في أول الناس قال ‏\"‏ وأيضا ‏\"‏ ‏.‏ قال ورآني رسول الله صلى الله عليه وسلم عزلا - يعني ليس معه سلاح - قال فأعطاني رسول الله صلى الله عليه وسلم حجفة أو درقة ثم بايع حتى إذا كان في آخر الناس قال ‏\"‏ ألا تبايعني يا سلمة ‏\"‏ ‏.‏ قال قلت قد بايعتك يا رسول الله في أول الناس وفي أوسط الناس قال ‏\"‏ وأيضا ‏\"‏ ‏.‏ قال فبايعته الثالثة ثم قال لي ‏\"‏ يا سلمة أين حجفتك أو درقتك التي أعطيتك ‏\"‏ ‏.‏ قال قلت يا رسول الله لقيني عمي عامر عزلا فأعطيته إياها - قال - فضحك رسول الله صلى الله عليه وسلم وقال ‏\"‏ إنك كالذي قال الأول اللهم أبغني حبيبا هو أحب إلى من نفسي ‏\"‏ ‏.‏ ثم إن المشركين راسلونا الصلح حتى مشى بعضنا في بعض واصطلحنا ‏.‏ قال وكنت تبيعا لطلحة بن عبيد الله أسقي فرسه وأحسه وأخدمه وآكل من طعامه وتركت أهلي ومالي مهاجرا إلى الله ورسوله صلى الله عليه وسلم قال فلما اصطلحنا نحن وأهل مكة واختلط بعضنا ببعض أتيت شجرة فكسحت شوكها فاضطجعت في أصلها - قال - فأتاني أربعة من المشركين من أهل مكة فجعلوا يقعون في رسول الله صلى الله عليه وسلم فأبغضتهم فتحولت إلى شجرة أخرى وعلقوا سلاحهم واضطجعوا فبينما هم كذلك إذ نادى مناد من أسفل الوادي يا للمهاجرين قتل ابن زنيم ‏.‏ قال فاخترطت سيفي ثم شددت على أولئك الأربعة وهم رقود فأخذت سلاحهم ‏.‏ فجعلته ضغثا في يدي قال ثم قلت والذي كرم وجه محمد لا يرفع أحد منكم رأسه إلا ضربت الذي فيه عيناه ‏.‏ قال ثم جئت بهم أسوقهم إلى رسول الله صلى الله عليه وسلم - قال - وجاء عمي عامر برجل من العبلات يقال له مكرز ‏.‏ يقوده إلى رسول الله صلى الله عليه وسلم على فرس مجفف في سبعين من المشركين فنظر إليهم رسول الله صلى الله عليه وسلم فقال ‏\"‏ دعوهم يكن لهم بدء الفجور وثناه ‏\"‏ فعفا عنهم رسول الله صلى الله عليه وسلم وأنزل الله ‏{‏ وهو الذي كف أيديهم عنكم وأيديكم عنهم ببطن مكة من بعد أن أظفركم عليهم‏}‏ الآية كلها ‏.‏ قال ثم خرجنا راجعين إلى المدينة فنزلنا منزلا بيننا وبين بني لحيان جبل وهم المشركون فاستغفر رسول الله صلى الله عليه وسلم لمن رقي هذا الجبل الليلة كأنه طليعة للنبي صلى الله عليه وسلم وأصحابه - قال سلمة - فرقيت تلك الليلة مرتين أو ثلاثا ثم قدمنا المدينة فبعث رسول الله صلى الله عليه وسلم بظهره مع رباح غلام رسول الله صلى الله عليه وسلم وأنا معه وخرجت معه بفرس طلحة أنديه مع الظهر فلما أصبحنا إذا عبد الرحمن الفزاري قد أغار على ظهر رسول الله صلى الله عليه وسلم فاستاقه أجمع وقتل راعيه قال فقلت يا رباح خذ هذا الفرس فأبلغه طلحة بن عبيد الله وأخبر رسول الله صلى الله عليه وسلم أن المشركين قد أغاروا على سرحه - قال - ثم قمت على أكمة فاستقبلت المدينة فناديت ثلاثا يا صباحاه ‏.‏ ثم خرجت في آثار القوم أرميهم بالنبل وأرتجز أقول أنا ابن الأكوع واليوم يوم الرضع فألحق رجلا منهم فأصك سهما في رحله حتى خلص نصل السهم إلى كتفه - قال - قلت خذها وأنا ابن الأكوع واليوم يوم الرضع قال فوالله ما زلت أرميهم وأعقر بهم فإذا رجع إلى فارس أتيت شجرة فجلست في أصلها ثم رميته فعقرت به حتى إذا تضايق الجبل فدخلوا في تضايقه علوت الجبل فجعلت أرديهم بالحجارة - قال - فما زلت كذلك أتبعهم حتى ما خلق الله من بعير من ظهر رسول الله صلى الله عليه وسلم إلا خلفته وراء ظهري وخلوا بيني وبينه ثم اتبعتهم أرميهم حتى ألقوا أكثر من ثلاثين بردة وثلاثين رمحا يستخفون ولا يطرحون شيئا إلا جعلت عليه آراما من الحجارة يعرفها رسول الله صلى الله عليه وسلم وأصحابه حتى أتوا متضايقا من ثنية فإذا هم قد أتاهم فلان بن بدر الفزاري فجلسوا يتضحون - يعني يتغدون - وجلست على رأس قرن قال الفزاري ما هذا الذي أرى قالوا لقينا من هذا البرح والله ما فارقنا منذ غلس يرمينا حتى انتزع كل شىء في أيدينا ‏.‏ قال فليقم إليه نفر منكم أربعة ‏.‏ قال فصعد إلى منهم أربعة في الجبل - قال - فلما أمكنوني من الكلام - قال - قلت هل تعرفوني قالوا لا ومن أنت قال قلت أنا سلمة بن الأكوع والذي كرم وجه محمد صلى الله عليه وسلم لا أطلب رجلا منكم إلا أدركته ولا يطلبني رجل منكم ‏.‏ فيدركني قال أحدهم أنا أظن ‏.‏ قال فرجعوا فما برحت مكاني حتى رأيت فوارس رسول الله صلى الله عليه وسلم يتخللون الشجر - قال - فإذا أولهم الأخرم الأسدي على إثره أبو قتادة الأنصاري وعلى إثره المقداد بن الأسود الكندي - قال - فأخذت بعنان الأخرم - قال - فولوا مدبرين قلت يا أخرم احذرهم لا يقتطعوك حتى يلحق رسول الله صلى الله عليه وسلم وأصحابه ‏.‏ قال يا سلمة إن كنت تؤمن بالله واليوم الآخر وتعلم أن الجنة حق والنار حق فلا تحل بيني وبين الشهادة ‏.‏ قال فخليته فالتقى هو وعبد الرحمن - قال - فعقر بعبد الرحمن فرسه وطعنه عبد الرحمن فقتله وتحول على فرسه ولحق أبو قتادة فارس رسول الله صلى الله عليه وسلم بعبد الرحمن فطعنه فقتله فوالذي كرم وجه محمد صلى الله عليه وسلم لتبعتهم أعدو على رجلى حتى ما أرى ورائي من أصحاب محمد صلى الله عليه وسلم ولا غبارهم شيئا حتى يعدلوا قبل غروب الشمس إلى شعب فيه ماء يقال له ذو قرد ليشربوا منه وهم عطاش - قال - فنظروا إلى أعدو وراءهم فحليتهم عنه - يعني أجليتهم عنه - فما ذاقوا منه قطرة - قال - ويخرجون فيشتدون في ثنية - قال - فأعدو فألحق رجلا منهم فأصكه بسهم في نغض كتفه ‏.‏ قال قلت خذها وأنا ابن الأكوع واليوم يوم الرضع قال يا ثكلته أمه أكوعه بكرة قال قلت نعم يا عدو نفسه أكوعك بكرة - قال - وأردوا فرسين على ثنية قال فجئت بهما أسوقهما إلى رسول الله صلى الله عليه وسلم - قال - ولحقني عامر بسطيحة فيها مذقة من لبن وسطيحة فيها ماء فتوضأت وشربت ثم أتيت رسول الله صلى الله عليه وسلم وهو على الماء الذي حليتهم عنه فإذا رسول الله صلى الله عليه وسلم قد أخذ تلك الإبل وكل شىء استنقذته من المشركين وكل رمح وبردة وإذا بلال نحر ناقة من الإبل الذي استنقذت من القوم وإذا هو يشوي لرسول الله صلى الله عليه وسلم من كبدها وسنامها - قال - قلت يا رسول الله خلني فأنتخب من القوم مائة رجل فأتبع القوم فلا يبقى منهم مخبر إلا قتلته - قال - فضحك رسول الله صلى الله عليه وسلم حتى بدت نواجذه في ضوء النار فقال ‏\"‏ يا سلمة أتراك كنت فاعلا ‏\"‏ ‏.‏ قلت نعم والذي أكرمك ‏.‏ فقال ‏\"‏ إنهم الآن ليقرون في أرض غطفان ‏\"‏ ‏.‏ قال فجاء رجل من غطفان فقال نحر لهم فلان جزورا فلما كشفوا جلدها رأوا غبارا فقالوا أتاكم القوم فخرجوا هاربين ‏.‏ فلما أصبحنا قال رسول الله صلى الله عليه وسلم ‏\"‏ كان خير فرساننا اليوم أبو قتادة وخير رجالتنا سلمة ‏\"‏ ‏.‏ قال ثم أعطاني رسول الله صلى الله عليه وسلم سهمين سهم الفارس وسهم الراجل فجمعهما لي جميعا ثم أردفني رسول الله صلى الله عليه وسلم وراءه على العضباء راجعين إلى المدينة - قال - فبينما نحن نسير قال وكان رجل من الأنصار لا يسبق شدا - قال - فجعل يقول ألا مسابق إلى المدينة هل من مسابق فجعل يعيد ذلك - قال - فلما سمعت كلامه قلت أما تكرم كريما ولا تهاب شريفا قال لا إلا أن يكون رسول الله صلى الله عليه وسلم قال قلت يا رسول الله بأبي وأمي ذرني فلأسابق الرجل قال ‏\"‏ إن شئت ‏\"‏ ‏.‏ قال قلت اذهب إليك وثنيت رجلى فطفرت فعدوت - قال - فربطت عليه شرفا أو شرفين أستبقي نفسي ثم عدوت في إثره فربطت عليه شرفا أو شرفين ثم إني رفعت حتى ألحقه - قال - فأصكه بين كتفيه - قال - قلت قد سبقت والله قال أنا أظن ‏.‏ قال فسبقته إلى المدينة قال فوالله ما لبثنا إلا ثلاث ليال حتى خرجنا إلى خيبر مع رسول الله صلى الله عليه وسلم قال فجعل عمي عامر يرتجز بالقوم تالله لولا الله ما اهتدينا ولا تصدقنا ولا صلينا ونحن عن فضلك ما استغنينا فثبت الأقدام إن لاقينا وأنزلن سكينة علينا فقال رسول الله صلى الله عليه وسلم ‏\"‏ من هذا ‏\"‏ ‏.‏ قال أنا عامر ‏.‏ قال ‏\"‏ غفر لك ربك ‏\"‏ ‏.‏ قال وما استغفر رسول الله صلى الله عليه وسلم لإنسان يخصه إلا استشهد ‏.‏ قال فنادى عمر بن الخطاب وهو على جمل له يا نبي الله لولا ما متعتنا بعامر ‏.‏ قال فلما قدمنا خيبر قال خرج ملكهم مرحب يخطر بسيفه ويقول قد علمت خيبر أني مرحب شاكي السلاح بطل مجرب إذا الحروب أقبلت تلهب قال وبرز له عمي عامر فقال قد علمت خيبر أني عامر شاكي السلاح بطل مغامر قال فاختلفا ضربتين فوقع سيف مرحب في ترس عامر وذهب عامر يسفل له فرجع سيفه على نفسه فقطع أكحله فكانت فيها نفسه ‏.‏ قال سلمة فخرجت فإذا نفر من أصحاب النبي صلى الله عليه وسلم يقولون بطل عمل عامر قتل نفسه قال فأتيت النبي صلى الله عليه وسلم وأنا أبكي فقلت يا رسول الله بطل عمل عامر قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال ذلك ‏\"‏ ‏.‏ قال قلت ناس من أصحابك ‏.‏ قال ‏\"‏ كذب من قال ذلك بل له أجره مرتين ‏\"‏ ‏.‏ ثم أرسلني إلى علي وهو أرمد فقال ‏\"‏ لأعطين الراية رجلا يحب الله ورسوله أو يحبه الله ورسوله ‏\"‏ ‏.‏ قال فأتيت عليا فجئت به أقوده وهو أرمد حتى أتيت به رسول الله صلى الله عليه وسلم فبسق في عينيه فبرأ وأعطاه الراية وخرج مرحب فقال قد علمت خيبر أني مرحب شاكي السلاح بطل مجرب إذا الحروب أقبلت تلهب فقال علي أنا الذي سمتني أمي حيدره كليث غابات كريه المنظره أوفيهم بالصاع كيل السندره قال فضرب رأس مرحب فقتله ثم كان الفتح على يديه ‏.‏",
      "text_en": " It has been narrated on the authority of Ibn Salama. He heard the tradition from his father who said:                      We arrived at Hudaibiya with the Messenger of Allah (may peace be upon him) and we were fourteen hundred in number. There were fifty goats for them which could not be watered (by the small quantity of water in the local well). So, the Messenger of Allah (may peace be upon him) sat on the brink of the well. Either he prayed or spat into the well The water welled up. We drank and watered (the beasts as well). Then the Messenger of Allah (may peace be upon him) called us to take the vow of allegiance, as he was sitting at the base of a tree. I was the first man to take the vow. Then other people took the vow. When half the number of people had done so, he said to me: You take the vow, Salama. I said: I was one of those who took the vow in the first instance. He said: (You may do) again. Then the Messenger. of Allah (may peace be upon him) saw that I was without weapons. He gave me a big or a small shield. Then he continued to administer vows to the people until it was the last batch of them. He said (to me): Won't you swear allegiance, Salama? I said: Messenger of Allah, I took the oath with the first batch of the people and then again when you were in the middle of the people. He said: (Doesn't matter), you may (do so) again. So I took the oath of allegiance thrice. Then he said to me: Salama, where is the shield which I gave to thee? I said: Messenger of Allah, my uncle 'Amir met me and he was without any weapons. So I gave the shield to him. The Messenger of Allah (may peace be upon him) laughed and said: You are like a person of the days gone by who said: O God. I seek a friend who is dearer to me than myself. (When all Companions had sworn allegiance to the Holy Prophet), the polytheists sent messages of peace, until people could move from our camp to that of the Meccans and vice versa. Finally, the peace treaty was concluded. I was a dependant of Talha b. Ubaidullah. I watered his horse, rubbed its back. I served Talha (doing odd jobs for him) and partook from his food. I had left my family and my property as an emigrant in the cause of Allah and His Messenger (may peace be uron him). When we and the people of Mecca had concluded a peace treaty and the people of one side began to mix with those of the other, I came to a tree, swept away its thorns and lay down (for rest) at its base; (while I lay there), four of the polytheists from the Meccans came to me and began to talk ill of the Messenger of Allah (may peace be upon him). I got enraged with them and moved to another tree. They hung their weapons (to the branches of the tree) and lay down (for rest). (While they lay there), somebody from the lower part of the valley cried out: Run up, O Muhajirs! Ibn Zunaim has been murdered. I drew my sword and attacked these four while they were asleep. I seized their arms and collected them up in my hand, and said: By the Being Who has conferred honour upon Muhammad, none of you shall raise his head, else I will smite his face. (Then) I came driving them along to the Holy Prophet (may peace be upon him). (At the same time). my uncle Amir came (to him) with a man from\" Abalat called Mikraz. Amir was dragging him on a horse with a thick covering on its back along with seventy polytheists. The Messenger of Allah (may peace be upon him) cast a glance at them and said: Let them go (so that) they may prove guilty of breach of trust more than once (before we take action against them). So the Messenger of Allah (may peace be upon him) forgave them. On this occasion. God revealed the Qur'anic verse:\" It is He Who restrained their hands from you and your hands from them in the valley of Mecca after He had granted you a victory over them\" (xlviii. 24). Then we moved returning to Medina, and halted at a place where there was a mountain between us and Banu Lihyan who were polytheists. The Messenaer of Allah (may peace be upon him) asked God's forgiveness for one who ascended the mountain at night to act as a scout for the Messenger of Allah (may peace be upon him) and his Compinions. I ascended (that mountain) twice or thrice that night. (At last) we reached Medina. The Messenger of Allah (may peace be upon him) sent his camels with his slave, Rabah, and I was with him. I (also) went to the pasture with the horse of Talha along with the camels. When the day dawned, Abd al-Rahman al-Fazari made a raid and drove away all the camels of the Messenger of Allah (may peace be upon him), and killed the man who looked after them. I said: Rabah, ride this horse, take it to Talha b. 'Ubaidullah and Inform the Messenger of Allah (may peace be upon him) that the polytheists have made away with his camels. Then I stood upon a hillock and turning my face to Medina, shouted thrice: Come to our help I Then I set out in pursuit of the raiders, shooting at them with arrows and chanting a (self-eulogatory) verse in the Iambic metre: I am the son of al-Akwa' And today is the day of defeat for the mean. I would overtake a man from them, shoot at him an arrow which, piercing through the saddle, would reach his shoulder. and I would say: Take it, chanting at the same time the verse And I am the son of al-Akwa' And tody is the day of defeat for the mean. By God, I continued shooting at them and hamstringing their animals. Whenever a horseman turned upon me, I would come to a tree and (hid myself) sitting at its base. Then I would shoot at him and hamstring his horse. (At last) they entered a narrow mountain gorge. I ascended that mountain and held them at bay throwing stones at them. I continued to chase them in this way until I got all the camels of the Messenger of Allah (may peace be upon him) released and no camel was left with them. They left me; then I followed them shooting at them (continually) until they dropped more than thirty mantles and thirty lances. lightening their burden. On everything they dropped, I put a mark with the help of (a piece of) stone so that the Messenger of Allah (may peace be upon him) and his Companions might recognise them (that it was booty left by the enemy). (They went on) until They came to a narrow valley when so and so, son of Badr al-Fazari joined them. They (now) sat down to take their breakfast and I sat on the top of a tapering rock. Al-Fazari said: Who is that fellow I am seeing? They said: This fellow has harassed us. By God, he has not left us since dusk and has been (continually) shooting at us until he has snatched everything from our hands. He said: Four of you should make a dash at him (and kill him). (Accordingly), four of them ascended the mountain coming towards me. When it became possible for me to talk to them, I said: Do you recognise me? They said: No. Who are thou? I said: I am Salama, son of al-Akwa'. By the Being Who has honoured the countenance of Muhammad (may peace be upon him) I can kill any of you I like but none of you will be able to kill me. One of them said: I think (he is right). So they returned. I did not move from my place until I saw the horsemen of the Messenger of Allah (may peace be upon him), who came riding through the trees. Lo! the foremost among them was Akhram al-Asadi. Behind him was Abu Qatada al-Ansari and behind him was al-Miqdad b. al-Aswad al-Kindi. I caught hold of the rein of Akhram's horse (Seeing this). they (the raiders) fled. I said (to Akhram): Akhram, guard yourself against them until Allah's Messenger (may peace be upon him) and his Companions join you. He said: ) Salama, if you believe In Allah and the Day of Judgment and (if) you kaow that Paradise is a reality and Hell is a reality, you should not stand between me and martyrdom. so I let him go. Akhram and Abd al-Rahman (Fazari) met in combat. Akhram hamstrung Abd al-Rahman's horse and the latter struck him with his lance and killed him. Abd al-Rabman turned about riding Akhram's horse. Abu Qatada, a horse-man of the Messenger of Allah (may peace be upon him), met 'Abd al-Rahman (in combat), smote him with his lance and killed him. By the Being Who honoured the countenance of Muhammad (may peace oe upon him), I followed them running on my feet (so fast) that I couldn't see behind me the Companions of Muhammad (may peace be upon him), nor any dust raised by their horses. (I followed them) until before sunset they reached a valley which had a spring of water, which was called Dhu Qarad, so that they could have a drink, for they were thirsty. They saw me running towards them. I turned them out of the valley before they could drink a drop of its water. They left the valley and ran down a slope. I ran (behind them), overtook a man from them, shot him with an arrow through the shoulder blade and said: Take this. I am the son of al-Akwa'; and today is the day of annihilation for the people who are mean. The fellow (who was wounded) said: May his mother weep over him! Are you the Akwa' who has been chasing us since morning? I said: Yes, O enemy of thyself, the same Akwa'. They left two horses dead tired on the hillock and I came dragging them along to the Messenger of Allah (may peace be upon him). I met 'Amir who had with him a container having milk diluted with water and a container having water. I performed ablution with the water and drank the milk. Then I came to the Messenger of Allah (may peace be upon him) while he was at (the spring of) water from which I had driven them away. The Messenger of Allah (may peace be upon him) had captured those camels and everything else I had captured and all the lances and mantles I had snatched from the polytheists and Bilal had slaughtered a she-camel from the camels I had seized from the people, and was roasting its liver and hump for the Messenger of Allah (may peace be upon him). I said: Messenger of Allah, let me select from our people one hundred men and I will follow the marauders and I will finish them all so that nobody is left to convey the news (of their destruction to their people). (At these words of mine), the Messenger of Allah (may peace be upon him) laughed so much that his molar teeth could be seen in the light of the fire, and he said: Salama, do you think you can do this? I said: Yes, by the Being Who has honoured you. He said: Now they have reached the land of Ghatafan where they are being feted. (At this time) a man from the Ghatafan came along and said: So and so slaughtered a camel for them. When they were exposing its skin, they saw dust (being raised far off). They said: They (Akwa' and his companions) have come. So. they went away fleeing. When it was morning, the Messenger of Allah (may peace be upon him) said: Our best horseman today is Abu Qatada and our best footman today is Salama. Then he gave me two shares of the booty-the share meant for the horseman and the share meant for the footman, and combined both of them for me. Intending to return to Medina, he made me mount behind him on his she-camel named al-Adba'. While we were travelling, a man from the Ansar who could not be beaten in a race said: Is there anyone who could compete (with me) in race to Medina? Is there any competitor? He continued repeating this. When I heard his talk, I said: Don't you show consideration to a dignified person and don't you have awe for a noble man? He said: No, unless he be the Messenger of Allah (may peace be upon him). I said: Messenger of Allah, may my father and mother be thy ransom, let me get down so that I may beat this man (in the race). He said: It you wish, (you may). I said (to the man): I am coming to thee, I then turned my feet. sprang up and tan and gasped (for a while) when one or two elevated places were left and again followed his heel and again gasped (for a while) when one or two elevated places were left and again dashed until I joined him and gave a blow between his shoulders. I said: You have been overtaken, by God. He said: I think so. Thus, I reached Medina ahead of him. By God, we had stayed there only three nights when we set out to Khaibar with the Messenger of Allah (may peace be upon him). (On the way) my uncle, Amir, began to recite the following rajaz verses for the people: By God, if Thou hadst not guided us aright, We would have neither practised charity nor offered prayers. (O God! ) We cannot do without Thy favours; Keep us steadfast when we encounter the enemy, And descend tranquillity upon us. The Messenger of Allah (may peace be upon him) said: Who is this? 'Amir said: it is 'Amir. He said: May thy God forgive thee! The narrator said: Whenever the Messenger of Allah (may peace be upon him) asked forgiveness for a particular person, he was sure to embrace martyrdom. Umar b. Khattab who was riding on his camel called out: Prophet of Allah, I wish you had allowed us to benefit from Amir. Salama continued: When we reached Khaibar, its king named Marhab advanced brandishing his sword and chanting: Khaibar knows that I am Marhab (who behaves like) A fully armed, and well-tried warrior. When the war comes spreading its flames. My uncle, Amir, came out to combat with him, saying: Khaibar certainly knows that I am 'Amir, A fully armed veteran who plunges into battles. They exchanged blows. Marbab's sword struck the shield of 'Amir who bent forward to attack his opponent from below, but his sword recoiled upon him and cut the main artery: in his forearm which caused his death. Salama said: I came out and beard some people among the Companions of the Holy Prophet (may peace be upon him) as saying: Amir's deed has gone waste; he has killed himself. So I came to the Holy Prophet (may peace be upon him) weeping and I said: Messenger of Allah. Amir's deed has gone waste. The Messenger (may peace be upon him) said: Who passed this remark? I said: Some of your Companions. He said: He who has passed that remark has told a lie, for 'Amir there is a double reward. Then he sent me to 'Ali who had tore eyes, and said: I will give the banner to a man who loves Allah and His Messenger or whom Allah and His Messenger love. So I went to 'Ali, brought him beading him along and he had sore eyes, and I took him to the Messenger of Allah (may peace be upon him), who applied his saliva to his eyes and he got well. The Messenger of Allah (may peace be upon him) gave him the banner (and 'Ali went to meet Marhab in a single combat). The latter advanced chanting: Khaibar knows certainly that I am Marhab, A fully armed and well-tried valorous warrior (hero) When war comes spreading its flames. 'Ali chanted in reply: I am the one whose mother named him Haidar, (And am) like a lion of the forest with a terror-striking countenance. I give my opponents the measure of sandara in exchange for sa' (i. e. return thir attack with one that is much more fierce). The narrator said: 'Ali struck at the head of Mirhab and killed him, so the victory (capture of Khaibar) was due to him. This long tradition has also been handed down Through a different chain of transmitters.",
      "chain": [
        "30201",
        "20390",
        "30123",
        "20443",
        "10704",
        "20260",
        "10704"
      ]
    },
    {
      "hadith_no": "6086",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن الدارمي، حدثنا أبو علي الحنفي، حدثنا مالك، - وهو ابن أنس - عن أبي الزبير المكي، أن أبا الطفيل، عامر بن واثلة أخبره أن معاذ بن جبل أخبره قال خرجنا مع رسول الله صلى الله عليه وسلم عام غزوة تبوك فكان يجمع الصلاة فصلى الظهر والعصر جميعا والمغرب والعشاء جميعا حتى إذا كان يوما أخر الصلاة ثم خرج فصلى الظهر والعصر جميعا ثم دخل ثم خرج بعد ذلك فصلى المغرب والعشاء جميعا ثم قال ‏\"‏ إنكم ستأتون غدا إن شاء الله عين تبوك وإنكم لن تأتوها حتى يضحي النهار فمن جاءها منكم فلا يمس من مائها شيئا حتى آتي ‏\"‏ ‏.‏ فجئناها وقد سبقنا إليها رجلان والعين مثل الشراك تبض بشىء من ماء - قال - فسألهما رسول الله صلى الله عليه وسلم ‏\"‏ هل مسستما من مائها شيئا ‏\"‏ ‏.‏ قالا نعم ‏.‏ فسبهما النبي صلى الله عليه وسلم وقال لهما ما شاء الله أن يقول - قال - ثم غرفوا بأيديهم من العين قليلا قليلا حتى اجتمع في شىء - قال - وغسل رسول الله صلى الله عليه وسلم فيه يديه ووجهه ثم أعاده فيها فجرت العين بماء منهمر أو قال غزير - شك أبو علي أيهما قال - حتى استقى الناس ثم قال ‏\"‏ يوشك يا معاذ إن طالت بك حياة أن ترى ما ها هنا قد ملئ جنانا ‏\"‏ ‏.‏",
      "text_en": " Mu'adh b. Jabal reported that he went along with Allah's Apostle (may peace be upon him) in the expedition of Tabuk and he (the Holy Prophet) combined the prayers. He offered the noon and afternoon prayers together and the sunset and night prayers together and on the other day he deferred the prayers; he then came out and offered the noon and afternoon prayers together. He then went in and (later on) came out and then after that offered the sunset and night prayers together and then said:                      God willing, you would reach by tomorrow the fountain of Tabuk and you should not come to that until it is dawn, and he who amongst you happens to go there should not touch its water until I come. We came to that and two persons (amongst) us reached that fountain ahead of us. It was a thin flow of water like the shoelace. Allah's Messenger (may peace be upon him) asked them whether they had touched the water. They said: Yes. Allah's Apostle (may peace be upon him) scolded them, and he said to them what he had to say by the will of God. The people then took water of the fountain in their palms until it became somewhat significant and Allah's Messenger (may peace be upon him) washed his hands and his face too in it, and then, took it again in that (fountain) and there gushed forth abundant water from that fountain, until all the people drank to their fill. He then said: Mu'adh, it is hoped that if you live long you would see its water irrigating well the gardens.",
      "chain": [
        "30025",
        "20260",
        "20001",
        "11263",
        "3660",
        "32"
      ]
    },
    {
      "hadith_no": "19",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا نصر بن علي، عن أبي علي الحنفي، عن همام، عن ابن جريج، عن الزهري، عن أنس، قال كان النبي صلى الله عليه وسلم إذا دخل الخلاء وضع خاتمه ‏.‏ قال أبو داود هذا حديث منكر وإنما يعرف عن ابن جريج عن زياد بن سعد عن الزهري عن أنس أن النبي صلى الله عليه وسلم اتخذ خاتما من ورق ثم ألقاه ‏.‏ والوهم فيه من همام ولم يروه إلا همام ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     When the Prophet (ﷺ) entered the privy, he removed his ring.Abu Dawud said: This is a munkar tradition, i.e. it contradicts the well-known version reported by reliable narrators. On the authority of Anas the well-known version says: The Prophet (ﷺ) had a silver ring made for him. Then he cast it off. The misunderstanding is on the part of Hammam (who is the narrator of the previous tradition mentioned in the text). This is transmitted only by Hammam.",
      "chain": [
        "30395",
        "20260",
        "20297",
        "11070",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "429",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عبد الرحمن العنبري، حدثنا أبو علي الحنفي، عبيد الله بن عبد المجيد حدثنا عمران القطان، حدثنا قتادة، وأبان، كلاهما عن خليد العصري، عن أم الدرداء، عن أبي الدرداء، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خمس من جاء بهن مع إيمان دخل الجنة من حافظ على الصلوات الخمس على وضوئهن وركوعهن وسجودهن ومواقيتهن وصام رمضان وحج البيت إن استطاع إليه سبيلا وأعطى الزكاة طيبة بها نفسه وأدى الأمانة ‏\"‏ ‏.‏ قالوا يا أبا الدرداء وما أداء الأمانة قال الغسل من الجنابة ‏.‏",
      "text_en": " Abu al-Darda' reported the Messenger of Allah (ﷺ) as saying:                      There are five thing, if anyone observe them with faith, he will enter Paradise. He who prays the five times prayer regularly, with the ablution for them, with their bowing, with their prostration and their (right) times ; keeps fast during Ramadan ; performs Hajj (pilgrimage) to the House (Ka'bah), provided he has the ability for its passage; pays Zakat happily ; and fulfills the trust (he will enter Paradise). People said: Abu al-Darda', what is fulfilling the trust ? He replied: Washing because of sexual defilement.",
      "chain": [
        "34217",
        "20260",
        "20718",
        "11019",
        "20577",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "3415",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا أبو علي الحنفي، عن ابن أبي ذئب، عن المقبري، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الحمد لله أم القرآن وأم الكتاب والسبع المثاني ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"Al-Hamdulillah is Umm Al-Qur'an and Umm Al-Kitab and the seven oft-repeated.\"",
      "chain": [
        "30553",
        "20260",
        "20177",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "1118",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا أبو داود، سليمان بن سيف قال حدثنا أبو علي الحنفي، وعثمان بن عمر، قال أبو علي حدثنا وقال، عثمان أنبأنا داود بن قيس، عن إبراهيم بن عبد الله بن حنين، عن أبيه، عن ابن عباس، عن علي بن أبي طالب، - رضى الله عنه - قال نهاني حبي صلى الله عليه وسلم عن ثلاث - لا أقول نهى الناس - نهاني عن تختم الذهب وعن لبس القسي وعن المعصفر المفدمة ولا أقرأ ساجدا ولا راكعا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ali bin Abi Talib said:                     \"My beloved (ﷺ) forbade me from doing three things, but I do not say that he forbade the people. He forbade me from wearing gold rings, wearing Qassi, wearing clothes dyed with safflower Mufaddamah, and from reciting the Quran when prostrating or bowing.",
      "chain": [
        "20260",
        "20262",
        "4",
        "11845",
        "11150",
        "11181",
        "17",
        "5"
      ]
    },
    {
      "hadith_no": "1478",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرنا أبو داود، قال حدثنا أبو علي الحنفي، قال حدثنا هشام، صاحب الدستوائي عن أبي الزبير، عن جابر بن عبد الله، قال كسفت الشمس على عهد رسول الله صلى الله عليه وسلم في يوم شديد الحر فصلى رسول الله صلى الله عليه وسلم بأصحابه فأطال القيام حتى جعلوا يخرون ثم ركع فأطال ثم رفع فأطال ثم ركع فأطال ثم رفع فأطال ثم سجد سجدتين ثم قام فصنع نحوا من ذلك وجعل يتقدم ثم جعل يتأخر فكانت أربع ركعات وأربع سجدات كانوا يقولون إن الشمس والقمر لا يخسفان إلا لموت عظيم من عظمائهم وإنهما آيتان من آيات الله يريكموهما فإذا انخسفت فصلوا حتى تنجلي ‏‏.‏‏",
      "text_en": " It was narrated that Jabir bin 'Abdullah said:                     \"The sun eclipsed during the time of the Messenger of Allah (ﷺ) on a very hot day. The Messenger of Allah (ﷺ) led his companions in prayer, and he stood for so long that they started to fall over. Then he bowed for a long time, then he stood up (and remained standing) for a long time. Then he bowed again for a long time, then he stood up (again) and (remained standing) for a long time. Then he prostrated twice, then he stood up and did the same again. He started to move forward, then he started to step back. He bowed four times and prostrated four times. They used to say that eclipses of the sun and moon only happened when one of their great men died, but they are two of the signs of Allah (SWT) that He shows to you, so when an eclipse happens, pray until it is over.\"",
      "chain": [
        "30002",
        "20260",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "4911",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا عبد الله بن الصباح، قال حدثنا أبو علي الحنفي، قال حدثنا هشام، عن قتادة، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قطع في مجن ‏.‏ قال أبو عبد الرحمن هذا خطأ ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that:                     the Messenger of Allah cut off (a thief's hand) for a shield. (Sahih)Abu 'Abdur-Rahman (An-Nasai) said: This is a mistake.",
      "chain": [
        "30142",
        "20260",
        "20295",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "5172",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أبو داود، قال حدثنا أبو علي الحنفي، وعثمان بن عمر، قال أبو علي حدثنا وقال، عثمان أنبأنا داود بن قيس، عن إبراهيم بن عبد الله بن حنين، عن أبيه، عن ابن عباس، عن علي، قال نهاني حبي صلى الله عليه وسلم عن ثلاث لا أقول نهى الناس نهاني عن تختم الذهب وعن لبس القسي وعن المعصفر المفدمة ولا أقرأ ساجدا ولا راكعا ‏.‏ تابعه الضحاك بن عثمان ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"My beloved, the Messenger of Allah [SAW], forbade me three things but I do not say that he forbade them to the people. He forbade me from wearing rings of gold, from wearing Al-Qassi, and Al-Mu'asfar Al-Mufaddam (garments that are deeply dyed with safflower), and (he forbade me) from reciting Qur'an when prostrating or bowing.\" He was followed (in that narration) by Ad-Dahhak bin 'Uthman.",
      "chain": [
        "30002",
        "20260",
        "20262",
        "4",
        "11845",
        "11150",
        "11181",
        "17",
        "5"
      ]
    }
  ],
  "total_hadiths": 12
}