{
  "id": "20262",
  "name": "'Uthman bin 'Umar bin Fars عثمان بن عمر بن فارس",
  "full_name": "'Uthman bin 'Umar bin Fars عثمان بن عمر بن فارس",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "209",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-'Abdi",
      "Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11071",
      "name": "'Abdullah bin 'Awn bin Artaban عبد الله بن عون بن أرطبان الخزار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11303",
      "name": "Kahmas bin al-Hasan al-Tamimi كهمس بن الحسن التميمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20475",
      "name": "Yonus bin Yazid bin Abi al-Nijad يونس بن يزيد بن أبي النجاد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "24517",
      "name": "Mu'adh bin al-'Ala' bin 'Ammar معاذ بن العلاء بن عمار المازني",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20169",
      "name": "Falayh bin Suliaman فليح بن سليمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20449",
      "name": "'Ali bin al-Mubark al-Hna'iy علي بن المبارك الهنائي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11845",
      "name": "Da'ud bin Qays al-Fra'a داود بن قيس الفراء الدباغ",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "17514",
      "name": "Salah bin Rustam al-Hashimi صالح بن رستم الهاشمي أبو عبد السلام",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "20561",
      "name": "'Uzra bin Thabit عزرة بن ثابت بن أبي زيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11533",
      "name": "'Isa bin Hafs bin 'Asim bin 'Umar عيسى بن حفص بن عاصم بن عمر - رباح",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11311",
      "name": "Hisham bin Hassan al-Azdi هشام بن حسان الأزدي القردوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20189",
      "name": "Ibrahim bin Nafi' al-Makhzumi إبراهيم بن نافع المخزومي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10668",
      "name": "Isma'il bin Muslim al-Bdy إسماعيل بن مسلم العبدي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "14090",
      "name": "Hamad bin Najih al-Iskaf حماد بن نجيح الإسكاف السدوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20505",
      "name": "'Abdullah bin Ja'far bin 'Abdur Rahman عبد الله بن جعفر بن عبد الرحمن - المخرمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20439",
      "name": "'Abdur Rahman bin 'Abdullah bin Dinar عبد الرحمن بن عبد الله بن دينار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "19853",
      "name": "Abd al-Mjyd bin Aby عبد المجيد بن أبي يزيد وهب العقيلي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "25226",
      "name": "'Isa bin Dinar al-Khuza'i عيسى بن دينار الخزاعي أبو علي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11301",
      "name": "Qurrah bin Khalid al-Sadusi قرة بن خالد السدوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10716",
      "name": "al-Mstmr bin al-Ryan المستمر بن الريان",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30160",
      "name": "Muhammad bin Bashar Bindar محمد بن بشار بندار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30351",
      "name": "'Abdullah bin Muhammad al-Musandi عبد الله بن محمد المسندي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30296",
      "name": "Ahmed bin Sa'id bin Sakhar أحمد بن سعيد بن صخر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36522",
      "name": "Ibrahim bin Yonus bin Muhammad إبراهيم بن يونس بن محمد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38834",
      "name": "Hajjaj bin Yusuf bin al-Sha'ir حجاج بن يوسف الشاعر",
      "grade": "3rd Century AH"
    },
    {
      "id": "36514",
      "name": "Ahmed bin Mansur al-Ramadi أحمد بن منصور الرمادي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38247",
      "name": "Sulaiman bin Syf bin Yahya سليمان بن سيف بن يحيى",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30456",
      "name": "Malik bin Abd al-Wahd مالك بن عبد الواحد أبو غسان المسمعي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30153",
      "name": "'Amr bin 'Ali bin Bahr al-Bahli عمرو بن علي بن بحر الباهلي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30521",
      "name": "Mjahd bin Musa مجاهد بن موسى",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30524",
      "name": "Harun bin 'Abdullah al-Hamal هارون بن عبد الله بن مروان الحمال",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "34280",
      "name": "Yahya bin Hakeem al-Maquuam يحيى بن حكيم المقوم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38044",
      "name": "Ahmed bin al-Frat bin Khalid أحمد بن الفرات بن خالد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "31513",
      "name": "al-Harith bin Muhammad bin Abi Usama الحارث بن محمد بن أبي أسامة",
      "grade": "3rd Century AH"
    },
    {
      "id": "34255",
      "name": "Muhammad bin Yonus al-Kadaymi محمد بن يونس بن موسى الكديمي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "275",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا عثمان بن عمر، قال أخبرنا يونس، عن الزهري، عن أبي سلمة، عن أبي هريرة، قال أقيمت الصلاة، وعدلت الصفوف قياما، فخرج إلينا رسول الله صلى الله عليه وسلم فلما قام في مصلاه ذكر أنه جنب فقال لنا ‏:‏ ‏\"‏ مكانكم ‏\"‏‏.‏ ثم رجع فاغتسل، ثم خرج إلينا ورأسه يقطر، فكبر فصلينا معه‏.‏ تابعه عبد الأعلى عن معمر عن الزهري‏.‏ ورواه الأوزاعي عن الزهري‏.‏",
      "text_en": " Narrated Abu Huraira:                     Once the call (Iqama) for the prayer was announced and the rows were straightened. Allah's Apostle came out; and when he stood up at his Musalla, he remembered that he was Junub. Then he ordered us to stay at our places and went to take a bath and then returned with water dropping from his head. He said, \"Allahu-Akbar\", and we all offered the prayer with him.",
      "chain": [
        "30351",
        "20262",
        "20475",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "457",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن محمد، قال حدثنا عثمان بن عمر، قال أخبرنا يونس، عن الزهري، عن عبد الله بن كعب بن مالك، عن كعب، أنه تقاضى ابن أبي حدرد دينا كان له عليه في المسجد، فارتفعت أصواتهما حتى سمعها رسول الله صلى الله عليه وسلم وهو في بيته، فخرج إليهما حتى كشف سجف حجرته فنادى ‏\"‏ يا كعب ‏\"‏‏.‏ قال لبيك يا رسول الله‏.‏ قال ‏\"‏ ضع من دينك هذا ‏\"‏‏.‏ وأومأ إليه أى الشطر قال لقد فعلت يا رسول الله‏.‏ قال ‏\"‏ قم فاقضه ‏\"‏‏.‏",
      "text_en": " Narrated Ka`b:                     In the mosque l asked Ibn Abi Hadrad to pay the debts which he owed to me and our voices grew louder. Allah's Apostle heard that while he was in his house. So he came to us raising the curtain of his room and said, \"O Ka`b!\" I replied, \"Labaik, O Allah's Apostle!\" He said, \"O Ka`b! reduce your debt to one half,\" gesturing with his hand. I said, \"O Allah's Apostle! I have done so.\" Then Allah's Apostle said (to Ibn Abi Hadrad), \"Get up and pay the debt to him.\"",
      "chain": [
        "30351",
        "20262",
        "20475",
        "11013",
        "1131"
      ]
    },
    {
      "hadith_no": "866",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا عثمان بن عمر، أخبرنا يونس، عن الزهري، قال حدثتني هند بنت الحارث، أن أم سلمة، زوج النبي صلى الله عليه وسلم أخبرتها أن النساء في عهد رسول الله صلى الله عليه وسلم كن إذا سلمن من المكتوبة قمن، وثبت رسول الله صلى الله عليه وسلم ومن صلى من الرجال ما شاء الله، فإذا قام رسول الله صلى الله عليه وسلم قام الرجال‏.‏",
      "text_en": " Narrated Um Salama:                     (the wife of the Prophet) In the lifetime of Allah's Apostle the women used to get up when they finished their compulsory prayers with Taslim. The Prophet and the men would stay on at their places as long as Allah will. When the Prophet got up, the men would then get up.",
      "chain": [
        "30351",
        "20262",
        "20475",
        "11013",
        "11734"
      ]
    },
    {
      "hadith_no": "1223",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عثمان بن عمر، قال أخبرني ابن أبي ذئب، عن سعيد المقبري، قال قال أبو هريرة  رضى الله عنه  يقول الناس أكثر أبو هريرة، فلقيت رجلا فقلت بم قرأ رسول الله صلى الله عليه وسلم البارحة في العتمة فقال لا أدري‏.‏ فقلت لم تشهدها قال بلى‏.‏ قلت لكن أنا أدري، قرأ سورة كذا وكذا‏.‏",
      "text_en": " Narrated Abu Huraira:                     People say that I narrate too many narrations of the Prophet; once I met a man (during the lifetime of the Prophet) and asked him, \"Which Sura did Allah's Apostle s recite yesterday in the `Isha' prayer?\" He said, \"I do not know.\" I said, \"Did you not attend the prayer?\" He said, \"Yes, (I did).\" I said, \"I know. He recited such and such Sura.\"",
      "chain": [
        "30170",
        "20262",
        "20177",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "1780",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "وقال محمد حدثنا عثمان بن عمر، أخبرنا يونس، عن الزهري، أن رسول الله صلى الله عليه وسلم كان إذا رمى الجمرة التي تلي مسجد منى يرميها بسبع حصيات، يكبر كلما رمى بحصاة، ثم تقدم أمامها فوقف مستقبل القبلة رافعا يديه يدعو، وكان يطيل الوقوف، ثم يأتي الجمرة الثانية، فيرميها بسبع حصيات، يكبر كلما رمى بحصاة، ثم ينحدر ذات اليسار مما يلي الوادي، فيقف مستقبل القبلة رافعا يديه يدعو، ثم يأتي الجمرة التي عند العقبة فيرميها بسبع حصيات، يكبر عند كل حصاة، ثم ينصرف ولا يقف عندها‏.‏ قال الزهري سمعت سالم بن عبد الله يحدث مثل هذا عن أبيه عن النبي صلى الله عليه وسلم وكان ابن عمر يفعله‏.‏",
      "text_en": " Narrated Az-Zuhri:                      Whenever Allah's Messenger () stoned the Jamra near Mina Mosque, he would do Ramy of it with seven small pebbles and say Takbir on throwing each pebble. Then he would go ahead and stand facing the Qiblah with his hands raised, and invoke (Allah) and he sued to stand for a long period. Then he would come to the second Jamra (Al-Wusta) and stone it will seven small stones, reciting Takbir on throwing each stone. Then he would stand facing the Qiblah with raised hands to invoke (Allah). Then he would come to the Jamra near the 'Aqaba (Jamrat-ul-'Aqaba) and do Ramy of it with seven small pebbles, reciting Takbir on throwing each stone. he then would leave and not stay by it. Narrated Az-Zuhri: I heard Salim bin 'Abdullah saying the same that his father said on the authority of the Prophet (saw). And Ibn 'Umar used to do the same.",
      "chain": [
        "30213",
        "20262",
        "20475",
        "11013"
      ]
    },
    {
      "hadith_no": "2418",
      "source": " Sahih Bukhari ",
      "chapter": "Khusoomaat - كتاب الخصومات",
      "chapter_no": "44",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا عثمان بن عمر، أخبرنا يونس، عن الزهري، عن عبد الله بن كعب بن مالك، عن كعب  رضى الله عنه  أنه تقاضى ابن أبي حدرد دينا كان له عليه في المسجد، فارتفعت أصواتهما حتى سمعها رسول الله صلى الله عليه وسلم وهو في بيته، فخرج إليهما، حتى كشف سجف حجرته فنادى ‏\"‏ يا كعب ‏\"‏‏.‏ قال لبيك يا رسول الله‏.‏ قال ‏\"‏ ضع من دينك هذا ‏\"‏‏.‏ فأومأ إليه، أى الشطر‏.‏ قال لقد فعلت يا رسول الله‏.‏ قال ‏\"‏ قم فاقضه ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Ka`b bin Malik:                     Ka`b demanded his debt back from Ibn Abi Hadrad in the Mosque and their voices grew louder till Allah's Apostle heard them while he was in his house. He came out to them raising the curtain of his room and addressed Ka`b, \"O Ka`b!\" Ka`b replied, \"Labaik, O Allah's Apostle.\" (He said to him), \"Reduce your debt to one half,\" gesturing with his hand. Ka`b said, \"I have done so, O Allah's Apostle!\" On that the Prophet said to Ibn Abi Hadrad, \"Get up and repay the debt, to him.\"",
      "chain": [
        "30351",
        "20262",
        "20475",
        "11013",
        "1131"
      ]
    },
    {
      "hadith_no": "2710",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا عثمان بن عمر، أخبرنا يونس،‏.‏ وقال الليث حدثني يونس، عن ابن شهاب، أخبرني عبد الله بن كعب، أن كعب بن مالك، أخبره أنه، تقاضى ابن أبي حدرد دينا كان له عليه في عهد رسول الله صلى الله عليه وسلم في المسجد، فارتفعت أصواتهما حتى سمعها رسول الله صلى الله عليه وسلم وهو في بيت، فخرج رسول الله صلى الله عليه وسلم إليهما حتى كشف سجف حجرته، فنادى كعب بن مالك فقال ‏\"‏ يا كعب ‏\"‏‏.‏ فقال لبيك يا رسول الله‏.‏ فأشار بيده أن ضع الشطر‏.‏ فقال كعب قد فعلت يا رسول الله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ قم فاقضه ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Ka`b:                     That Ka`b bin Malik told him that in the lifetime of Allah's Apostle he demanded his debt from Ibn Abu Hadrad in the Mosque. Their voices grew louder till Allah's Apostle heard them while he was in his house. So he lifted the curtain of his room and called Ka`b bin Malik saying, \"O Ka`b!\" He replied, \"Labbaik! O Allah's Apostle!\" He beckoned to him with his hand suggesting that he deduct half the debt. Ka`b said, \"I agree, O Allah's Apostle!\" Allah's Apostle then said (to Ibn Abu Hadrad), \"Get up and pay him the rest.\"",
      "chain": [
        "30351",
        "20262",
        "20023",
        "20475",
        "11013",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "4223",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني أحمد بن إسحاق، حدثنا عثمان بن عمر، أخبرنا شعبة، عن قتادة، عن أنس بن مالك  رضى الله عنه ‏{‏إنا فتحنا لك فتحا مبينا‏}‏ قال الحديبية‏.‏ قال أصحابه هنيئا مريئا فما لنا فأنزل الله ‏{‏ليدخل المؤمنين والمؤمنات جنات‏}‏ قال شعبة فقدمت الكوفة فحدثت بهذا كله عن قتادة ثم رجعت فذكرت له فقال أما ‏{‏إنا فتحنا لك‏}‏ فعن أنس، وأما هنيئا مريئا فعن عكرمة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     regarding Allah's Statement: \"Verily! We have granted you (O, Muhammad) Manifest victory.\" (48.1) It refers to the Al-Hudaibiya Pledge. And the companions of the Prophet said (to the Prophet), \"Congratulations and happiness for you; but what reward shall we get?\" So Allah revealed:-- \"That He may admit the believing men and women to gardens beneath which rivers flow.\" (48.5)",
      "chain": [
        "30289",
        "20262",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "4526",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عثمان بن عمر، أخبرنا علي بن المبارك، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  قال كان أهل الكتاب يقرءون التوراة بالعبرانية، ويفسرونها بالعربية لأهل الإسلام، فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تصدقوا أهل الكتاب ولا تكذبوهم، وقولوا ‏{‏آمنا بالله وما أنزل‏}‏ الآية‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The people of the Scripture (Jews) used to recite the Torah in Hebrew and they used to explain it in Arabic to the Muslims. On that Allah's Apostle said, \"Do not believe the people of the Scripture or disbelieve them, but say:-- \"We believe in Allah and what is revealed to us.\" (2.136)",
      "chain": [
        "30160",
        "20262",
        "20449",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "5461",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثني محمد بن المثنى، قال حدثني عثمان بن عمر، حدثنا فليح، حدثنا أبو حازم المدني، حدثنا عبد الله بن أبي قتادة، عن أبيه، قال خرجنا مع النبي صلى الله عليه وسلم نحو مكة‏.‏",
      "text_en": " Narrated Abu Qatada:                     We went out towards Mecca with the Prophet.",
      "chain": [
        "30170",
        "20262",
        "20169",
        "11172",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "5812",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا عثمان بن عمر، حدثنا يونس، عن الزهري، عن سالم، عن ابن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا عدوى ولا طيرة، والشؤم في ثلاث في المرأة، والدار، والدابة ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle said, \"There is neither 'Adha (no contagious disease is conveyed to others without Allah's permission) nor Tiyara, but an evil omen may be in three a woman, a house or an animal.\"",
      "chain": [
        "30351",
        "20262",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "5896",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني محمد بن بشار، حدثنا عثمان بن عمر، حدثنا علي بن المبارك، عن يحيى بن أبي كثير، عن عمران بن حطان، قال سألت عائشة عن الحرير، فقالت ائت ابن عباس فسله‏.‏ قال فسألته فقال سل ابن عمر‏.‏ قال فسألت ابن عمر فقال أخبرني أبو حفص  يعني عمر بن الخطاب  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنما يلبس الحرير في الدنيا من لا خلاق له في الآخرة ‏\"‏‏.‏ فقلت صدق وما كذب أبو حفص على رسول الله صلى الله عليه وسلم‏.‏ وقال عبد الله بن رجاء حدثنا حرب عن يحيى حدثني عمران‏.‏ وقص الحديث‏.‏",
      "text_en": "",
      "chain": [
        "30160",
        "20262",
        "20449",
        "11449",
        "11715",
        "53"
      ]
    },
    {
      "hadith_no": "6116",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عثمان بن عمر، حدثنا علي بن المبارك، عن يحيى بن أبي كثير، عن أبي قلابة، أن ثابت بن الضحاك، وكان، من أصحاب الشجرة حدثه أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من حلف على ملة غير الإسلام فهو كما قال، وليس على ابن آدم نذر فيما لا يملك، ومن قتل نفسه بشىء في الدنيا عذب به يوم القيامة، ومن لعن مؤمنا فهو كقتله، ومن قذف مؤمنا بكفر فهو كقتله ‏\"‏‏.‏",
      "text_en": " Narrated Thabit bin Ad-Dahhak:                     (who was one of the companions who gave the pledge of allegiance to the Prophet underneath the tree (Al-Hudaibiya)) Allah's Apostle said, \"Whoever swears by a religion other than Islam (i.e. if somebody swears by saying that he is a non-Muslim e.g., a Jew or a Christian, etc.) in case he is telling a lie, he is really so if his oath is false, and a person is not bound to fulfill a vow about a thing which he does not possess. And if somebody commits suicide with anything in this world, he will be tortured with that very thing on the Day of Resurrection; And if somebody curses a believer, then his sin will be as if he murdered him; And whoever accuses a believer of Kufr (disbelief), then it is as if he killed him.\"",
      "chain": [
        "30160",
        "20262",
        "20449",
        "11449",
        "11047",
        "1902"
      ]
    },
    {
      "hadith_no": "6170",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد، وأحمد بن سعيد، قالا حدثنا عثمان بن عمر، أخبرنا علي بن المبارك، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا قال الرجل لأخيه يا كافر فقد باء به أحدهما ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          Allah's Apostle said, \"If a man says to his brother, O Kafir      (disbeliever)!' Then surely one of them is such (i.e., a Kafir). \"",
      "chain": [
        "30213",
        "30296",
        "20262",
        "20449",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "6808",
      "source": " Sahih Bukhari ",
      "chapter": "Expiation for Unfulfilled Oaths - كتاب كفارات الأيمان",
      "chapter_no": "84",
      "text_ar": "حدثني محمد بن عبد الله، حدثنا عثمان بن عمر بن فارس، أخبرنا ابن عون، عن الحسن، عن عبد الرحمن بن سمرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تسأل الإمارة، فإنك إن أعطيتها عن غير مسألة أعنت عليها، وإن أعطيتها عن مسألة وكلت إليها، وإذا حلفت على يمين فرأيت غيرها خيرا منها، فأت الذي هو خير، وكفر عن يمينك ‏\"‏‏.‏ تابعه أشهل عن ابن عون‏.‏ وتابعه يونس وسماك بن عطية وسماك بن حرب وحميد وقتادة ومنصور وهشام والربيع‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Samura:                     Allah's Apostle said, \"(O `Abdur-Rahman!) Do not seek to be a ruler, for, if you are given the authority of ruling without your asking for it, then Allah will help you; but if you are given it by your asking, then you will be held responsible for it (i.e. Allah will not help you ) . And if you take an oath to do something and later on find another thing, better than that, then do what is better and make expiation for (the dissolution of) your oath.\"",
      "chain": [
        "30561",
        "20262",
        "11071",
        "11016",
        "955"
      ]
    },
    {
      "hadith_no": "7449",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثني محمد بن بشار، حدثنا عثمان بن عمر، أخبرنا علي بن المبارك، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، قال كان أهل الكتاب يقرءون التوراة بالعبرانية ويفسرونها بالعربية لأهل الإسلام فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تصدقوا أهل الكتاب، ولا تكذبوهم وقولوا ‏{‏آمنا بالله وما أنزل إلينا وما أنزل إليكم‏}‏ ‏\"‏‏.‏ الآية‏.‏",
      "text_en": " Narrated Abu Huraira:                     The people of the Book used to read the Torah in Hebrew and then explain it in Arabic to the Muslims. Allah's Apostle said (to the Muslims). \"Do not believe the people of the Book, nor disbelieve them, but say, 'We believe in Allah and whatever is revealed to us, and whatever is revealed to you.' \"",
      "chain": [
        "30160",
        "20262",
        "20449",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "7637",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عثمان بن عمر، أخبرنا علي بن المبارك، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، قال كان أهل الكتاب يقرءون التوراة بالعبرانية، ويفسرونها بالعربية لأهل الإسلام فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تصدقوا أهل الكتاب، ولا تكذبوهم و‏{‏قولوا آمنا بالله وما أنزل‏}‏ الآية ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The people of the Scripture used to read the Torah in Hebrew and explain it to the Muslims in Arabic. Then Allah's Apostle said, \"Do not believe the people of the Scripture, and do not disbelieve them, but say, 'We believe in Allah and whatever has been revealed...' (3.84)",
      "chain": [
        "30160",
        "20262",
        "20449",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "428",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عثمان بن عمر، أخبرنا علي بن المبارك، عن يحيى بن أبي كثير، بهذا الإسناد وقال ‏\"‏ فإذا هو جالس على عرش بين السماء والأرض ‏\"‏ ‏.‏",
      "text_en": " Yahya b Abi Kathir has reported this hadith with the same chain of transmitters and narrated:                      And there he was sitting on the Throne between the heaven and the earth.",
      "chain": [
        "30170",
        "20262",
        "20449",
        "11449",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "2179",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا عثمان بن عمر، أخبرنا شعبة، عن ثابت البناني، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم أتى على امرأة تبكي على صبي لها فقال لها ‏\"‏ اتقي الله واصبري ‏\"‏ ‏.‏ فقالت وما تبالي بمصيبتي ‏.‏ فلما ذهب قيل لها إنه رسول الله صلى الله عليه وسلم ‏.‏ فأخذها مثل الموت فأتت بابه فلم تجد على بابه بوابين فقالت يا رسول الله لم أعرفك ‏.‏ فقال ‏\"‏ إنما الصبر عند أول صدمة ‏\"‏ ‏.‏ أو قال ‏\"‏ عند أول الصدمة ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported that Allah's Messenger (may peace be upon him) came to a woman who had been weeping for her (dead) child, and said to her:                      Fear Allah and show endurance. She (not recognising him) said: You have not been afflicted as I have been. When he (the Holy Prophet) had departed, it was said to her that he was the Messenger of Allah (may peace be upon him), she was mortally shocked. She came to his door and she did not find doorkeepers at his door. She said: Messenger of Allah. I did not recognise you. He said: Endurance is to be shown at first blow, or at the first blow.",
      "chain": [
        "30170",
        "20262",
        "20020",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3410",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني زهير بن حرب، حدثنا عثمان بن عمر، أخبرنا عيسى بن حفص بن عاصم، حدثنا نافع، عن ابن عمر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من صبر على لأوائها كنت له شفيعا أو شهيدا يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar (Allah be pleased with them) reported Allah's Messenger (may peace be upon him) as saying:                      He who patiently endures the hardships of it (of this city of Medina), I would be an intercessor or a withness on his behalf on the Day of Resurrection.",
      "chain": [
        "30022",
        "20262",
        "11533",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4068",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثناه إسحاق بن إبراهيم، أخبرنا عثمان بن عمر، أخبرنا يونس، عن الزهري،لا عن عبد الله بن كعب بن مالك، أن كعب بن مالك، أخبره أنه، تقاضى دينا له على ابن أبي حدرد بمثل حديث ابن وهب ‏.‏",
      "text_en": "",
      "chain": [
        "30123",
        "20262",
        "20475",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "5115",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا عثمان بن عمر، ح وحدثني محمد بن رافع، حدثنا أبو المنذر القزاز، كلاهما عن داود بن قيس، عن عبيد الله بن مقسم، عن جابر بن، عبد الله قال بعث رسول الله صلى الله عليه وسلم بعثا إلى أرض جهينة واستعمل عليهم رجلا وساق الحديث بنحو حديثهم ‏.‏",
      "text_en": " Jabir b. Abdullah reported that Allah's Messenger (may peace be upon him) sent an expedition to the land of the tribe of Juhaina, and appointed a person as a chief over them.",
      "chain": [
        "38834",
        "20262",
        "30375",
        "11845",
        "11521",
        "34"
      ]
    },
    {
      "hadith_no": "5163",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثني أبو داود، سليمان بن معبد حدثنا عثمان بن عمر، أخبرنا كهمس، بهذا الإسناد نحوه ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Kahmas.",
      "chain": [
        "30545",
        "20262",
        "11303"
      ]
    },
    {
      "hadith_no": "5271",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عثمان بن عمر، أخبرنا علي، - وهو ابن المبارك - عن يحيى، عن أبي سلمة، عن أبي قتادة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تنتبذوا الزهو والرطب جميعا ولا تنتبذوا الرطب والزبيب جميعا ولكن انتبذوا كل واحد على حدته ‏\"‏ ‏.‏ وزعم يحيى أنه لقي عبد الله بن أبي قتادة فحدثه عن أبيه عن النبي صلى الله عليه وسلم بمثل هذا ‏.‏",
      "text_en": " Abu Qatada reported Allah's Messenger (may peace be upon him) as saying:                      Do not prepare Nabidh by mixing nearly ripe and fresh dates and do not prepare Nabidh by mixing together fresh dates and grapes, but prepare Nabidh out of each (one of them) separately. Yahya stated that he had met 'Abdullah b. Abu Qatada and he narrated it on the authority of his father that Allah's Apostle (may peace be upon him) said this. This hadith has been narrated on the authority of Yahya b. Abu Kathir through these two chains of transmitters but with a slight variation of words.",
      "chain": [
        "30170",
        "20262",
        "20449",
        "11449",
        "10567",
        "391"
      ]
    },
    {
      "hadith_no": "6010",
      "source": " Sahih Muslim ",
      "chapter": "The Book Concerning the Use of Correct Words - كتاب الألفاظ من الأدب وغيرها",
      "chapter_no": "41",
      "text_ar": "وحدثنيه زهير بن حرب، حدثنا عثمان بن عمر، حدثنا شعبة، عن سماك، قال سمعت علقمة بن وائل، عن أبيه، أن النبي صلى الله عليه وسلم قال ‏\"‏ لا تقولوا الكرم ‏.‏ ولكن قولوا العنب والحبلة ‏\"‏ ‏.‏",
      "text_en": "",
      "chain": [
        "20262",
        "20020",
        "10770",
        "10801"
      ]
    },
    {
      "hadith_no": "6051",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vision - كتاب الرؤيا",
      "chapter_no": "43",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا عثمان بن عمر، حدثنا علي، - يعني ابن المبارك - ح وحدثنا أحمد بن المنذر، حدثنا عبد الصمد، حدثنا حرب، - يعني ابن شداد - كلاهما عن يحيى بن أبي كثير، بهذا الإسناد ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Yahyi b. Abu Kathir with the same chain of transmitters.",
      "chain": [
        "30170",
        "20262",
        "20449",
        "20250",
        "20220"
      ]
    },
    {
      "hadith_no": "6857",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني أبو غسان المسمعي، حدثنا عثمان بن عمر، حدثنا أبو عامر، - يعني الخزاز - عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قال لي النبي صلى الله عليه وسلم ‏\"‏ لا تحقرن من المعروف شيئا ولو أن تلقى أخاك بوجه طلق ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported:                      Allah's Apostle (may peace be upon him) said to me: Don't consider anything insignificant out of good things even if it is that you meet your brother with a cheerful countenance.",
      "chain": [
        "30456",
        "20262",
        "10690",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "hadith_no": "6909",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Destiny - كتاب القدر",
      "chapter_no": "47",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، حدثنا عثمان بن عمر، حدثنا عزرة بن، ثابت عن يحيى بن عقيل، عن يحيى بن يعمر، عن أبي الأسود الدئلي، قال قال لي عمران بن الحصين أرأيت ما يعمل الناس اليوم ويكدحون فيه أشىء قضي عليهم ومضى عليهم من قدر ما سبق أو فيما يستقبلون به مما أتاهم به نبيهم وثبتت الحجة عليهم فقلت بل شىء قضي عليهم ومضى عليهم قال فقال أفلا يكون ظلما قال ففزعت من ذلك فزعا شديدا وقلت كل شىء خلق الله وملك يده فلا يسأل عما يفعل وهم يسألون ‏.‏ فقال لي يرحمك الله إني لم أرد بما سألتك إلا لأحزر عقلك إن رجلين من مزينة أتيا رسول الله صلى الله عليه وسلم فقالا يا رسول الله أرأيت ما يعمل الناس اليوم ويكدحون فيه أشىء قضي عليهم ومضى فيهم من قدر قد سبق أو فيما يستقبلون به مما أتاهم به نبيهم وثبتت الحجة عليهم فقال ‏\"‏ لا بل شىء قضي عليهم ومضى فيهم وتصديق ذلك في كتاب الله عز وجل ‏{‏ ونفس وما سواها * فألهمها فجورها وتقواها‏}‏ ‏\"‏ ‏.‏",
      "text_en": " Abu al-Aswad reported that 'Imran b Husain asked him:                      What is your view, what the people do today in the world, and strive for, is it something decreed for them or preordained for them or will their fate in the Hereafter be deterrained by the fact that their Prophets brought them teaching which they did not act upon? I said: Of course, it is something which is predetermined for them and preordained for them. He (further) said: Then, would it not be an injustice (to punish them)? I felt greatly disturbed because of that, and said: Everything is created by Allah and lies in His Power. He would not be questioned as to what He does, but they would be questioned; thereupon he said to me: May Allah have mercy upon you, I did not mean to ask you but for testing your intelligence. Two men of the tribe of Muzaina came to Allah's Messenger (may peace be upon him) and said: Allah's Messenger, what is your opinion that the people do in the world and strive for, is something decreed for them; something preordained for them and will their fate in the Hereafter be determined by the fact that their Prophets brought them teachings which they did not act upon. and thus they became deserving of punishment? Thereupon, he said: Of course, it happens as it is decreed by Destiny and preordained for them, and this view is confirmed by this verse of the Book of Allah, the Exalted and Glorious:\" Consider the soul and Him Who made it perfect, then breathed into it its sin and its piety\" (xci. 8).",
      "chain": [
        "30021",
        "20262",
        "20561",
        "10726",
        "11316"
      ]
    },
    {
      "hadith_no": "640",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مجاهد بن موسى، حدثنا عثمان بن عمر، حدثنا عبد الرحمن بن عبد الله، - يعني ابن دينار - عن محمد بن زيد، بهذا الحديث قال عن أم سلمة، أنها سألت النبي صلى الله عليه وسلم أتصلي المرأة في درع وخمار ليس عليها إزار قال ‏\"‏ إذا كان الدرع سابغا يغطي ظهور قدميها ‏\"‏ ‏.‏ قال أبو داود روى هذا الحديث مالك بن أنس وبكر بن مضر وحفص بن غياث وإسماعيل بن جعفر وابن أبي ذئب وابن إسحاق عن محمد بن زيد عن أمه عن أم سلمة لم يذكر أحد منهم النبي صلى الله عليه وسلم قصروا به على أم سلمة رضى الله عنها ‏.‏",
      "text_en": " Umm Salamah said that she asked the prophet (ﷺ); Can a woman pray in a shirt and veil without wearing a lower garment? He replied:                      if the shirt is ample and covers the surface of her feet.Abu Dawud said: This tradition has been transmitted by Malik b. Anas, Bakr b. Mudar, Hafs b. Ghiyaht, Isma'il b. Ja'far, Ibn Abu Dhi'b, and Ibn Ishaq from Muhammad b. Zaid on the authority of his mother who narrated from Umm Salamah. None of these narrators mention the name of the Prophet (ﷺ). They reported it directly from Umm Salamah.",
      "chain": [
        "30521",
        "20262",
        "20439",
        "11217",
        "56"
      ]
    },
    {
      "hadith_no": "654",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي، حدثنا عثمان بن عمر، حدثنا صالح بن رستم أبو عامر، عن عبد الرحمن بن قيس، عن يوسف بن ماهك، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا صلى أحدكم فلا يضع نعليه عن يمينه ولا عن يساره فتكون عن يمين غيره إلا أن لا يكون عن يساره أحد وليضعهما بين رجليه ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: When any of you prays, he should not place his sandals on his right side or on his left so as to be on the right side of someone else, unless no one is at his left, but should place them between his feet.",
      "chain": [
        "30115",
        "20262",
        "17514",
        "11264",
        "13"
      ]
    },
    {
      "hadith_no": "1260",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن الصباح بن سفيان، حدثنا عبد العزيز بن محمد، عن عثمان بن عمر، - يعني ابن موسى - عن أبي الغيث، عن أبي هريرة، أنه سمع النبي صلى الله عليه وسلم يقرأ في ركعتى الفجر ‏{‏ قل آمنا بالله وما أنزل علينا ‏}‏ في الركعة الأولى وفي الركعة الأخرى بهذه الآية ‏{‏ ربنا آمنا بما أنزلت واتبعنا الرسول فاكتبنا مع الشاهدين ‏}‏ أو ‏{‏ إنا أرسلناك بالحق بشيرا ونذيرا ولا تسأل عن أصحاب الجحيم ‏}‏ شك الدراوردي ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     That he heard the Prophet (ﷺ) recite in both rak'ahs of the dawn: \"Say: We believe in Allah, and in the revelation given to us\" (3:84). This is in the first rak'ah. In the second rak'ah he recited this verse: \"Our Lord, we have believed in what You have sent down, and we follow the Messenger, so write us down among those who bear witness.\" or he recited: \"Surely, we have sent you with the truth as a bringer of glad tidings, and a warner. And you will  not be asked about the inhabitants of the Blazing Fire\" (2:119). Al-Darawardi doubted (which of the verse he recited).",
      "chain": [
        "30269",
        "20167",
        "20262",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "1784",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا عثمان بن عمر، أخبرنا يونس، عن الزهري، عن عروة، عن عائشة، أن رسول الله صلى الله عليه وسلم قال لو استقبلت من أمري ما استدبرت لما سقت الهدى ‏\"‏ ‏.‏ قال محمد أحسبه قال ‏\"‏ ولحللت مع الذين أحلوا من العمرة ‏\"‏ ‏.‏ قال أراد أن يكون أمر الناس واحدا ‏.‏",
      "text_en": " A’ishah reported the Apostle of Allaah(ﷺ) as saying “If I had known beforehand about my affair what I have come to know later, I would not have brought the sacrificial animals with me. The narrator Muhammad(bin Yahya) said “ I think he(’Uthman bin ‘Umar) said and I would have taken off my ihram with those who have put their ihram after performing ‘Umrah.He said “By this he intended that all the people might have performed equal rites(of Hajj)",
      "chain": [
        "11222",
        "20262",
        "20475",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1918",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عباس بن عبد العظيم، حدثنا عثمان بن عمر، حدثنا عبد المجيد أبو عمرو، عن العداء، بمعناه ‏.‏",
      "text_en": " This tradition has also been transmitted by Al ‘Adda bin Khalid through a different chain of narrators to the same effect.",
      "chain": [
        "30437",
        "20262"
      ]
    },
    {
      "hadith_no": "1928",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا شبابة، ح وحدثنا مخلد بن خالد، - المعنى - أخبرنا عثمان بن عمر، عن ابن أبي ذئب، عن الزهري، بإسناد ابن حنبل عن حماد، ومعناه، قال بإقامة واحدة لكل صلاة ولم يناد في الأولى ولم يسبح على أثر واحدة منهما ‏.‏ قال مخلد لم يناد في واحدة منهما ‏.‏",
      "text_en": " The aforesaid tradition has also been transmitted to the same effect by by Al Zuhri with a different chain of narrators beginning with Ibn Hanbal on the authority of Hammad. This version adds “With an iqamah for every prayer, he did not call adhan for the first prayer and he did not offer supererogatory prayer after any of them. The narrator Makhlad said “He did not call adhan for any of them.”",
      "chain": [
        "30203",
        "20426",
        "30567",
        "20262",
        "20177",
        "20022"
      ]
    },
    {
      "hadith_no": "2132",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عثمان بن عمر، حدثنا علي، - يعني ابن المبارك - عن يحيى، عن يزيد بن نعيم، عن سعيد بن المسيب، أن رجلا، يقال له بصرة بن أكثم نكح امرأة فذكر معناه ‏.‏ وزاد وفرق بينهما ‏.‏ وحديث ابن جريج أتم ‏.‏",
      "text_en": " Sa'id b. al-Musayyab said:                      A man called Basrah b. Akhtam married a woman. The narrator then reported the rest of the tradition to the same effect. This version added: And he separated them. The tradition narrated by Ibn Juraij is perfect.",
      "chain": [
        "30170",
        "20262",
        "20449",
        "11449",
        "11002"
      ]
    },
    {
      "hadith_no": "2188",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عثمان بن عمر، أخبرنا علي، بإسناده ومعناه بلا إخبار قال ابن عباس بقيت لك واحدة قضى به رسول الله صلى الله عليه وسلم ‏.‏ قال أبو داود سمعت أحمد بن حنبل قال قال عبد الرزاق قال ابن المبارك لمعمر من أبو الحسن هذا لقد تحمل صخرة عظيمة ‏.‏ قال أبو داود أبو الحسن هذا روى عنه الزهري قال الزهري وكان من الفقهاء روى الزهري عن أبي الحسن أحاديث ‏.‏ قال أبو داود أبو الحسن معروف وليس العمل على هذا الحديث ‏.‏",
      "text_en": " The aforesaid tradition (No. 2182) has also been transmitted by Ali (ibn al-Mubarak) through a different chain of narrators to the same effect. This version adds:                      Ibn Abbas said: There remained one more pronouncement of divorce for you. The Messenger of Allah (ﷺ) took the same decision.Abu Dawud said: I heard Ahmad b. Hanbal say: 'Abd al-Razzaq said that Ibn al-Mubarak said to Ma'mar: Who is this Abu al-Hasan ? He bore a big rock.Abu Dawud said: Al-Zuhri has narrated (traditions) on the authority of this Abu al-Hasan. Al-Zuhri said: He was lawyer, and al-Zuhri narrated many traditions from Abu al-Hasan.Abu Dawud said: Abu al-Hasan is well known narrator. This tradition is not practiced.",
      "chain": [
        "30170",
        "20262"
      ]
    },
    {
      "hadith_no": "2665",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا عثمان بن عمر، أخبرنا إسرائيل، عن أبي إسحاق، عن حارثة بن مضرب، عن علي، قال تقدم - يعني عتبة بن ربيعة - وتبعه ابنه وأخوه فنادى من يبارز فانتدب له شباب من الأنصار فقال من أنتم فأخبروه فقال لا حاجة لنا فيكم إنما أردنا بني عمنا ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ قم يا حمزة قم يا علي قم يا عبيدة بن الحارث ‏\"‏ ‏.‏ فأقبل حمزة إلى عتبة وأقبلت إلى شيبة واختلف بين عبيدة والوليد ضربتان فأثخن كل واحد منهما صاحبه ثم ملنا على الوليد فقتلناه واحتملنا عبيدة ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     (At the battle of Badr) Utbah ibn Rabi'ah came forward followed by his son and his brother and cried out: Who will be engaged in single combat?  Some young men of the Helpers responded to his call. He asked: Who are you? They told him. He said: We do not want you; we, in fact, want only our cousins. The Prophet (ﷺ) said: Get up Hamzah get up Ali; get up Ubaydah ibn al-Harith. Hamzah went forward to Utbah, I went forward to Shaybah; and after two blows had been exchanged between Ubaydah and al-Walid, they wounded one another severely; so we turned against al-Walid and killed him, and we carried Ubaydah away.",
      "chain": [
        "30524",
        "20262",
        "20311",
        "11049",
        "19801",
        "5"
      ]
    },
    {
      "hadith_no": "2979",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا عبيد الله بن عمر، حدثنا عثمان بن عمر، أخبرني يونس، عن الزهري، عن سعيد بن المسيب، حدثنا جبير بن مطعم، أن رسول الله صلى الله عليه وسلم لم يقسم لبني عبد شمس ولا لبني نوفل من الخمس شيئا كما قسم لبني هاشم وبني المطلب ‏.‏ قال وكان أبو بكر يقسم الخمس نحو قسم رسول الله صلى الله عليه وسلم غير أنه لم يكن يعطي قربى رسول الله صلى الله عليه وسلم كما كان يعطيهم رسول الله صلى الله عليه وسلم وكان عمر يعطيهم ومن كان بعده منهم ‏.‏",
      "text_en": " Narrated Jubair b. Mu'tim:                     The Messenger of Allah (ﷺ) did not divide the fifth among the Banu 'Abd Shams and Banu Nawfal as he divided among the Banu Hashim and Banu 'Abd al-Muttalib. He said: Abu Bakr used to divide (the fifth) like the division of the Messenger of Allah (ﷺ), except that he did not give the relatives of the Messenger of Allah as the Messenger of Allah (ﷺ) himself gave them. 'Umar used to give them (from the fifth) and those who followed him.",
      "chain": [
        "11201",
        "20262",
        "20475",
        "11013",
        "11002",
        "871"
      ]
    },
    {
      "hadith_no": "3093",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، ح وحدثنا محمد بن بشار، حدثنا عثمان بن عمر، - قال أبو داود وهذا لفظ ابن بشار - عن أبي عامر الخزاز، عن ابن أبي مليكة، عن عائشة، قالت قلت يا رسول الله إني لأعلم أشد آية في القرآن قال ‏\"‏ أية آية يا عائشة ‏\"‏ ‏.‏ قالت قول الله تعالى ‏{‏ من يعمل سوءا يجز به ‏}‏ قال ‏\"‏ أما علمت يا عائشة أن المؤمن تصيبه النكبة أو الشوكة فيكافأ بأسوإ عمله ومن حوسب عذب ‏\"‏ ‏.‏ قالت أليس الله يقول ‏{‏ فسوف يحاسب حسابا يسيرا ‏}‏ قال ‏\"‏ ذاكم العرض يا عائشة من نوقش الحساب عذب ‏\"‏ ‏.‏ قال أبو داود وهذا لفظ ابن بشار قال أخبرنا ابن أبي مليكة ‏.‏",
      "text_en": " Narrated 'Aishah:                     I said: Messenger of Allah, I know the severest verse in the Qur'an. He asked: What is that verse. A'ishah? She replied: Allah's words: \"If anyone does evil, he will be requited for it.\" He said: Do you know A'ishah, that when a believer is afflicted with a calamity or a thorn, it serves as an atonement for his evil deed. He who is called to account will be punished. She said: Does Allah not say: \"He truly will recieve an easy reckoning.\" He said: This is the presentation, A'ishah. If anyone criticized in reckoning, he will be punished.Abu Dawud said: This is the version of Ibn Bashshar. He said: Ibn Abi Mulaikah narrated to us.",
      "chain": [
        "30175",
        "20031",
        "30160",
        "20262",
        "30002",
        "10690",
        "11090",
        "53"
      ]
    },
    {
      "hadith_no": "3124",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عثمان بن عمر، حدثنا شعبة، عن ثابت، عن أنس، قال أتى نبي الله صلى الله عليه وسلم على امرأة تبكي على صبي لها فقال لها ‏\"‏ اتقي الله واصبري ‏\"‏ ‏.‏ فقالت وما تبالي أنت بمصيبتي فقيل لها هذا النبي صلى الله عليه وسلم ‏.‏ فأتته فلم تجد على بابه بوابين فقالت يا رسول الله لم أعرفك فقال ‏\"‏ إنما الصبر عند الصدمة الأولى ‏\"‏ ‏.‏ أو ‏\"‏ عند أول صدمة ‏\"‏ ‏.‏",
      "text_en": " Narrated Anas:                     The Prophet (ﷺ) came upon a woman who was weeping for her child. He said to her: Fear Allah and have patience. She said: What have you to do with my calamity ? She was then told that he was the Prophet (ﷺ). She, therefore, came to him. She did not find doorkeepers at his gate. She said: I did not recognize you, Messenger of Allah. He said: Endurance is shown only at a first blow.",
      "chain": [
        "30170",
        "20262",
        "20020",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3137",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا عباس العنبري، حدثنا عثمان بن عمر، حدثنا أسامة، عن الزهري، عن أنس، أن النبي صلى الله عليه وسلم مر بحمزة وقد مثل به ولم يصل على أحد من الشهداء غيره ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Prophet (ﷺ) passed by Hamzah who was disfigured (after being killed). He did not offer prayer over any martyr except him.",
      "chain": [
        "30437",
        "20262",
        "50",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "4489",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا الحسن بن علي، حدثنا عثمان بن عمر، حدثنا أسامة بن زيد، عن الزهري، عن عبد الرحمن بن أزهر، قال رأيت رسول الله صلى الله عليه وسلم غداة الفتح وأنا غلام شاب يتخلل الناس يسأل عن منزل خالد بن الوليد فأتي بشارب فأمرهم فضربوه بما في أيديهم فمنهم من ضربه بالسوط ومنهم من ضربه بعصا ومنهم من ضربه بنعله وحثى رسول الله صلى الله عليه وسلم التراب فلما كان أبو بكر أتي بشارب فسألهم عن ضرب النبي صلى الله عليه وسلم الذي ضربه فحزروه أربعين فضرب أبو بكر أربعين فلما كان عمر كتب إليه خالد بن الوليد إن الناس قد انهمكوا في الشرب وتحاقروا الحد والعقوبة ‏.‏ قال هم عندك فسلهم ‏.‏ وعنده المهاجرون الأولون فسألهم فأجمعوا على أن يضرب ثمانين ‏.‏ قال وقال علي إن الرجل إذا شرب افترى فأرى أن يجعله كحد الفرية ‏.‏ قال أبو داود أدخل عقيل بن خالد بين الزهري وبين ابن الأزهر في هذا الحديث عبد الله بن عبد الرحمن بن الأزهر عن أبيه ‏.‏",
      "text_en": " Narrated AbdurRahman ibn Azhar:                     I saw the Messenger of Allah (ﷺ) on the morning of the conquest of Mecca when I was a young boy. He was walking among the people, seeking the camp of Khalid ibn al-Walid. A man who had drunk wine was brought (before him) and he ordered them (to beat him). So they beat him with what they had in their hands. Some struck him with whips, some with sticks and some with sandals. The Messenger of Allah (ﷺ) threw some dust on his face.  When a man who had drunk wine was brought before AbuBakr, he asked them (i.e. the people) about the number of beatings which they gave him. They numbered it forty. So AbuBakr gave him forty lashes.  When Umar came to power, Khalid ibn al-Walid wrote to him: The people have become addicted to drinking wine and they look down upon the prescribed punishment and its penalty.  He said: They are with you, ask them. The immigrants who embraced Islam in the beginning were with him. He asked them and they agreed on the fact that (a drunkard) should be given eighty lashes.  Ali said: When a man drinks wine, he tells lies. I, therefore, think that he should be prescribed punishment that is prescribed for telling lies..Abu Dawud said: 'Uqail b. Khalid included in the chain of this tradition: \"Abd Allah b. Abd al-Rahman b. al-Azhar from his father\" between al-Zuhri and Ibn al-Azhar.",
      "chain": [
        "30115",
        "20262",
        "50",
        "11013",
        "2216"
      ]
    },
    {
      "hadith_no": "5217",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا الحسن بن علي، وابن، بشار قالا حدثنا عثمان بن عمر، أخبرنا إسرائيل، عن ميسرة بن حبيب، عن المنهال بن عمرو، عن عائشة بنت طلحة، عن أم المؤمنين، عائشة رضى الله عنها أنها قالت ما رأيت أحدا كان أشبه سمتا وهديا ودلا - وقال الحسن حديثا وكلاما ولم يذكر الحسن السمت والهدى والدل - برسول الله صلى الله عليه وسلم من فاطمة كرم الله وجهها كانت إذا دخلت عليه قام إليها فأخذ بيدها وقبلها وأجلسها في مجلسه وكان إذا دخل عليها قامت إليه فأخذت بيده فقبلته وأجلسته في مجلسها ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     I never saw anyone more like the Messenger of Allah (ﷺ) in respect of gravity, calm deportment, pleasant disposition - according to al-Hasan's version: in respect of talk and speech. Al-Hasan did not mention gravity, calm deportment, pleasant disposition - than Fatimah, may Allah honour her face. When she came to visit him (the Prophet) he got up to (welcome) her, took her by the hand, kissed her and made her sit where he was sitting; and when he went to visit her, she got up to (welcome) him, took him by the hand, kissed him, and made him sit where she was sitting.",
      "chain": [
        "30",
        "30160",
        "20262",
        "20311",
        "25322",
        "11656",
        "10504"
      ]
    },
    {
      "hadith_no": "505",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو حفص، عمرو بن علي الفلاس الصيرفي حدثنا عثمان بن عمر، ويحيى بن كثير أبو غسان العنبري، قالا حدثنا معاذ بن العلاء، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم كان يخطب إلى جذع فلما اتخذ النبي صلى الله عليه وسلم المنبر حن الجذع حتى أتاه فالتزمه فسكن ‏\"‏ ‏.‏ قال وفي الباب عن أنس وجابر وسهل بن سعد وأبى بن كعب وابن عباس وأم سلمة ‏.‏ قال أبو عيسى حديث ابن عمر حديث حسن غريب صحيح ‏.‏ ومعاذ بن العلاء هو بصري وهو أخو أبي عمرو بن العلاء ‏.‏",
      "text_en": " Ibn Umar narrated:                     \"The Prophet would give the Khutbah next to the trunk of a date palm. When he [the Prophet] began using the Minbar the trunk cried out for him until he came to it and held it, so it became quiet.\"",
      "chain": [
        "30286",
        "20262",
        "20302",
        "24517",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "707",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو موسى، محمد بن المثنى حدثنا عثمان بن عمر، أخبرنا ابن أبي ذئب، عن سعيد المقبري، عن أبيه، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ من لم يدع قول الزور والعمل به فليس لله حاجة بأن يدع طعامه وشرابه ‏\"‏ ‏.‏ قال وفي الباب عن أنس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Prophet said: \"Whoever does not leave false speech, and acting according to it, then Allah is not in any need of him leaving his food and his drink.\"",
      "chain": [
        "20262",
        "20177",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "1214",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن بشار، حدثنا ابن أبي عدي، وعثمان بن عمر، عن هشام بن حسان، عن عكرمة، عن ابن عباس، قال توفي النبي صلى الله عليه وسلم ودرعه مرهونة بعشرين صاعا من طعام أخذه لأهله ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"The Prophet (ﷺ) died while his armour was pawned for twenty Sa' of food that he got for his family.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "30160",
        "20276",
        "20262",
        "11311",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1285",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عثمان بن عمر، وأبو عامر العقدي عن ابن أبي ذئب، عن مخلد بن خفاف، عن عروة، عن عائشة، أن رسول الله صلى الله عليه وسلم قضى أن الخراج بالضمان ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد روي هذا الحديث من غير هذا الوجه ‏.‏ والعمل على هذا عند أهل العلم ‏.‏",
      "text_en": " Narrated 'Aishah:                     That the Messenger of Allah (ﷺ) judged: \"The produce is for the responsible one.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. This Hadith has been reported through routes other than this, and this acted upon according to the people of knowledge.",
      "chain": [
        "30170",
        "20262",
        "20443",
        "20177",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1642",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عثمان بن عمر، أخبرنا علي بن المبارك، عن يحيى بن أبي كثير، عن عامر العقيلي، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ عرض على أول ثلاثة يدخلون الجنة شهيد وعفيف متعفف وعبد أحسن عبادة الله ونصح لمواليه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     That the Messenger of Allah (ﷺ) said, \"I was shown the first of (every) three to enter Paradise: A martyr, an 'Atif, who is a Muta'affif, and a slave who perfected his worship of Allah, and was sincere to his masters.\"[Abu 'Eisa said:] This Hadith is Hasan.",
      "chain": [
        "30160",
        "20262",
        "20449",
        "11449",
        "13"
      ]
    },
    {
      "hadith_no": "3414",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا عثمان بن عمر، عن مالك بن مغول، عن جنيد، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ لجهنم سبعة أبواب باب منها لمن سل السيف على أمتي أو قال على أمة محمد صلى الله عليه وسلم - ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث مالك بن مغول ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     that the Prophet (ﷺ) said: \"There are seven gates of Jahannam: Among them a gate for whoever carries a sword against my Ummah.\" Or he said: \"Against the Ummah of Muhammad.\"",
      "chain": [
        "30553",
        "20262",
        "20358",
        "18"
      ]
    },
    {
      "hadith_no": "3509",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا عثمان بن عمر، عن يونس بن يزيد، عن الزهري، عن أبي سلمة، عن عائشة، رضى الله عنها قالت لما أمر رسول الله صلى الله عليه وسلم بتخيير أزواجه بدأ بي فقال ‏\"‏ يا عائشة إني ذاكر لك أمرا فلا عليك أن لا تستعجلي حتى تستأمري أبويك ‏\"‏ ‏.‏ قالت وقد علم أن أبواى لم يكونا ليأمراني بفراقه قالت ثم قال ‏\"‏ إن الله تعالى يقول‏:‏ ‏(‏ يا أيها النبي قل لأزواجك إن كنتن تردن الحياة الدنيا وزينتها فتعالين ‏)‏ حتى بلغ ‏:‏ ‏(‏ للمحسنات منكن أجرا عظيما ‏)‏ فقلت في أى هذا أستأمر أبوى فإني أريد الله ورسوله والدار الآخرة وفعل أزواج النبي صلى الله عليه وسلم مثل ما فعلت ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روي هذا أيضا عن الزهري عن عروة عن عائشة رضى الله عنها ‏.‏",
      "text_en": " Narrated 'Aishah [may Allah be pleased with her]:                     \"When the Messenger of Allah (ﷺ) was ordered to tell his wives to make a choice, he started with me. He said: 'O 'Aishah! I am going to mention something to you, but you should not hasten (to reply) until you have consulted your parents.'\" She said: \"And he knew that my parents would not have ordered me to part from him.'\" She said: \"Then Allah [Most High] revealed: 'O Prophet! Say to your wives: If you desire the life of this world and its glitter then come...' until reaching: '...for the good doers among you an enormous reward (33:28 & 29).' I said: 'For what should I consult my parents? Indeed I want Allah, His Messenger, and the abode of the Hereafter.' The (remaining) wives of the Prophet (ﷺ) did the same as I did.\"",
      "chain": [
        "30553",
        "20262",
        "20475",
        "11013",
        "10567",
        "53"
      ]
    }
  ],
  "total_hadiths": 81
}