{
  "id": "20264",
  "name": "'Ali bin Nasr bin 'Ali al-Jahdami Older علي بن نصر بن علي الجهضمي الكبير",
  "full_name": "'Ali bin Nasr bin 'Ali al-Jahdami Older علي بن نصر بن علي الجهضمي الكبير",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "187",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Azdi",
      "al-Basri"
    ]
  },
  "parents": [
    {
      "id": "20720",
      "name": "Nasr bin 'Ali bin Asbahan نصر بن علي الجهضمي الكبير",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "30395",
      "name": "Nasr bin 'Ali bin Nasr bin 'Ali نصر بن علي بن نصر بن علي الجهضمي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "teachers": [
    {
      "id": "11517",
      "name": "'Abdur Rahman bin Sulaiman ibn al-Ghasil عبد الرحمن بن سليمان - ابن الغسيل",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20739",
      "name": "'Abdul 'Aziz bin Abi Ruwad عبد العزيز بن أبي رواد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11304",
      "name": "al-Muthna bin Sa'id al-Daba'i المثنى بن سعيد الضبعي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "25240",
      "name": "al-Qasim bin Ma'n bin 'Abdur Rahman القاسم بن معن بن عبد الرحمن بن عبد الله",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11307",
      "name": "Mahdi bin Maymun al-Azdi مهدي بن ميمون الأزدي المعولي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20295",
      "name": "Hisham bin Abi 'Abdullah al-Dastawa'i هشام بن أبي عبد الله الدستوائي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20539",
      "name": "Khalid bin Qays al-Hadani خالد بن قيس الحداني",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20189",
      "name": "Ibrahim bin Nafi' al-Makhzumi إبراهيم بن نافع المخزومي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20551",
      "name": "Shadad bin Sa'id شداد بن سعيد أبو طلحة الراسبي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "25174",
      "name": "'Abdul Malik bin Muslim عبد الملك بن مسلم بن سلام الحنفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11301",
      "name": "Qurrah bin Khalid al-Sadusi قرة بن خالد السدوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28165",
      "name": "al-Khlyl bin Ahmed al-Mzny الخليل بن أحمد المزني",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "24008",
      "name": "Ibrahim bin Ata'a bin Abi Maymuna إبراهيم بن عطاء بن أبي ميمونة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20429",
      "name": "Skhr bin Jwyryh Abu صخر بن جويرية أبو نافع مولى بني",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30395",
      "name": "Nasr bin 'Ali bin Nasr bin 'Ali نصر بن علي بن نصر بن علي الجهضمي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20280",
      "name": "Muhammad bin 'Abdullah al-Ansari محمد بن عبد الله بن المثني - الأنصاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30457",
      "name": "Ma'la bin Asad al-'Ami معلى بن أسد العمي أبو الهيثم البصري",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4132",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني نصر بن علي، قال أخبرني أبي، عن قرة بن خالد، عن قتادة، سمعت أنسا  رضى الله عنه  أن النبي صلى الله عليه وسلم قال ‏\"‏ هذا جبل يحبنا ونحبه ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"This is a mountain that loves us and is loved by us.\"",
      "chain": [
        "30395",
        "20264",
        "11301",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "126",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا نصر بن علي الجهضمي، قال أخبرني أبي قالا، جميعا حدثنا قرة بن خالد، عن أبي جمرة، عن ابن عباس، عن النبي صلى الله عليه وسلم بهذا الحديث نحو حديث شعبة ‏.‏ وقال ‏\"‏ أنهاكم عما ينبذ في الدباء والنقير والحنتم والمزفت ‏\"‏ ‏.‏ وزاد ابن معاذ في حديثه عن أبيه قال وقال رسول الله صلى الله عليه وسلم للأشج أشج عبد القيس ‏\"‏ إن فيك خصلتين يحبهما الله الحلم والأناة ‏\"‏ ‏.‏",
      "text_en": " There is another hadith narrated on the authority of Ibn Abbas (the contents of which are similar to the one) narrated by Shu'ba in which the Holy Prophet (may peace be upon him) said:                      I forbid you to prepare nabidh in a gourd, hollowed block of wood, a varnished jar or receptacle. Ibn Mu'adh made this addition on the authority of his father that the Messenger of Allah said to Ashajj, of the tribe of 'Abdul-Qais: You possess two qualities which are liked by Allah: insight and deliberateness.",
      "chain": [
        "30150",
        "20286",
        "30395",
        "20264",
        "11301",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "1601",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا نصر بن علي الجهضمي، حدثني أبي، حدثنا المثنى، عن قتادة، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا رقد أحدكم عن الصلاة أو غفل عنها فليصلها إذا ذكرها فإن الله يقول أقم الصلاة لذكري ‏\"‏ ‏.‏",
      "text_en": " Qatada reported it on the authority of Anas b. Malik that the Messenger of Allah (may peace be upon him) said:                      When any one of you omits the prayer due to sleep or he forgets it, he should observe it when he remembers it, for Allah has said:\" Observe prayer for remembrance of Me.\"",
      "chain": [
        "30395",
        "20264",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "3069",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا أبي، حدثنا شعبة، عن أيوب، عن أبي العالية، البراء أنه سمع ابن عباس، - رضى الله عنهما - يقول أهل رسول الله صلى الله عليه وسلم بالحج فقدم لأربع مضين من ذي الحجة فصلى الصبح وقال لما صلى الصبح ‏\"‏ من شاء أن يجعلها عمرة فليجعلها عمرة ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with them) 'is reported to have said:                      The Messenger of Allah (may peace be upon him) put on Ihigm for Hajj. When four days of Dhu'l-Hijja were over, he led the dawn prayer, and when the prayer was complete, he said: He who wants to change it to Umra may do so.",
      "chain": [
        "30395",
        "20264",
        "20020",
        "11015",
        "11618",
        "17"
      ]
    },
    {
      "hadith_no": "5301",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا نصر بن علي الجهضمي، حدثني أبي، حدثنا المثنى، - يعني ابن سعيد - عن أبي المتوكل، عن أبي سعيد، قال نهى رسول الله صلى الله عليه وسلم عن الشرب في الحنتمة والدباء والنقير ‏.‏",
      "text_en": " Abu Sa'id reported that Allah's Messenger (may peace be upon him) forbade drinking in green pitcher, in gourd and in the hollow stump.",
      "chain": [
        "30395",
        "20264",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "5375",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا نصر بن علي الجهضمي، حدثني أبي، حدثنا ليث بن سعد، بهذا الإسناد ‏.‏ بمثله غير أنه قال ‏\"‏ فإن في السنة يوما ينزل فيه وباء ‏\"‏ ‏.‏ وزاد في آخر الحديث قال الليث فالأعاجم عندنا يتقون ذلك في كانون الأول ‏.‏",
      "text_en": " This hadith is reported on the authority of Laith b. Sa'd with the same chain of transmitters, but with a slight variation in wording (and that is that) he (the Holy Prophet) said:                      There is a day in a year when descends the pestilence; at the end of the hadith Laith said that the non Arabs save themselves from it in Kanun Awwal (this is the month of December).",
      "chain": [
        "30395",
        "20264",
        "20023"
      ]
    },
    {
      "hadith_no": "5475",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثني أبي، حدثنا المثنى بن سعيد، عن طلحة، بن نافع حدثنا جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم أخذ بيده إلى منزله ‏.‏ بمثل حديث ابن علية إلى قوله ‏\"‏ فنعم الأدم الخل ‏\"‏ ‏.‏ ولم يذكر ما بعده ‏.‏",
      "text_en": " This hadith is reported on the authority of Jabir b. 'Abdullah that Allah's Messenger (may peace be upon him) took hold of his hand and led him to his residence as narrated above up to the words:                     \" Vinegar is a good condiment.\" But in the hadith transmitted through this chain of transmitters, there is no mention of the subsequent part.",
      "chain": [
        "30395",
        "20264",
        "34"
      ]
    },
    {
      "hadith_no": "5873",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثني نصر بن علي الجهضمي، حدثني أبي، حدثنا عبد الرحمن بن سليمان، عن عاصم بن عمر بن قتادة، قال جاءنا جابر بن عبد الله في أهلنا ورجل يشتكي خراجا به أو جراحا فقال ما تشتكي قال خراج بي قد شق على ‏.‏ فقال يا غلام ائتني بحجام ‏.‏ فقال له ما تصنع بالحجام يا أبا عبد الله قال أريد أن أعلق فيه محجما ‏.‏ قال والله إن الذباب ليصيبني أو يصيبني الثوب فيؤذيني ويشق على ‏.‏ فلما رأى تبرمه من ذلك قال إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن كان في شىء من أدويتكم خير ففي شرطة محجم أو شربة من عسل أو لذعة بنار ‏\"‏ ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ وما أحب أن أكتوي ‏\"‏ ‏.‏ قال فجاء بحجام فشرطه فذهب عنه ما يجد ‏.‏",
      "text_en": " 'Asim b. 'Umar b. Qatada reported:                      There came to our house 'Abdullah and another person from amongst the members of the household who complained of a wound. Jabir said: What ails you? He said: There is a wound which is very painful for me, whereupon he said: Boy, bring to me a cupper. He said: 'Abdullah, what do you intend to do with the cupper? I said: I would get this wound cupped. He said: By Allah. oven the touch of fly or cloth causes me pain (and cupping) would thus cause me (unbearable) pain. And when he saw him feeling pain (at the idea of cupping), he said: I heard Allah's Messenger (may peace be upon him) as saying: If there is any effective remedy amongst your remedies, these are (three): Cupping, drinking of honey and cauterisation with the help of fire. Allah's Messenger (may peace be upon him) had said: As for myself I do not like cauterisation. The cupper was called and he cupped him and he was all right.",
      "chain": [
        "30395",
        "20264",
        "11517",
        "11103"
      ]
    },
    {
      "hadith_no": "6071",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vision - كتاب الرؤيا",
      "chapter_no": "43",
      "text_ar": "وحدثنا نصر بن علي الجهضمي، أخبرني أبي، حدثنا صخر بن جويرية، عن نافع، أن عبد الله بن عمر، حدثه أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أراني في المنام أتسوك بسواك فجذبني رجلان أحدهما أكبر من الآخر فناولت السواك الأصغر منهما فقيل لي كبر ‏.‏ فدفعته إلى الأكبر ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. 'Umar reported Allah's Messenger (may peace be upon him) as saying:                      I saw in a dream that I was using miswak and the two persons contended to get it from me, the one being older than the other one. I gave the miswak to the younger one. It was said to me to give that to the older one and I gave it to the older one.",
      "chain": [
        "30395",
        "20264",
        "20429",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "6223",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا أبي، حدثنا المثنى بن سعيد، عن قتادة، عن أنس بن مالك، قال يكره أن ينتف الرجل، الشعرة البيضاء من رأسه ولحيته - قال - ولم يختضب رسول الله صلى الله عليه وسلم إنما كان البياض في عنفقته وفي الصدغين وفي الرأس نبذ ‏.‏",
      "text_en": " Anas b. Malik did not like that a person should pick out his white hair from his head or beard, and Allah's Messenger (may peace be upon him) did not dye, and there was some whiteness in his hair at his chin, on his temples and very little on his head. This hadith has been narrated on the authority of Muthanna through the same chain of transmitters.",
      "chain": [
        "30395",
        "20264",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6607",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا أبي، حدثنا شعبة، عن أبي بشر، عن عبد، الرحمن بن أبي بكرة عن أبيه، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ أسلم وغفار ومزينة وجهينة خير من بني تميم ومن بني عامر والحليفين بني أسد وغطفان ‏\"‏ ‏.‏",
      "text_en": " Abu Bakra reported from the Messenger of Allah (may peace be upon him) that Aslam, Ghifar, Muzaina and Juhaina are better than Banu Tamim, Banu Amir and their allies Banu Asad and Ghatfan.",
      "chain": [
        "30395",
        "20264",
        "20020",
        "11419",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "6704",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا الحسن بن علي الحلواني، وعلي بن نصر الجهضمي، قالا حدثنا وهب، بن جرير حدثنا شعبة، عن الأعمش، بهذا الإسناد ‏\"‏ لا تقاطعوا ولا تدابروا ولا تباغضوا ولا تحاسدوا وكونوا إخوانا كما أمركم الله ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of A'mash with the same chain of transmit ters (and the words are):                     \" Don't sever relations of kinship, don't bear enmity against one another, don't bear aversion against one another and don't feel envy against the other and live as fellow-brothers as Allah has commanded you.",
      "chain": [
        "30115",
        "20264",
        "20298",
        "20020"
      ]
    },
    {
      "hadith_no": "6821",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثني أبي، حدثنا المثنى، ح وحدثني محمد بن، حاتم حدثنا عبد الرحمن بن مهدي، عن المثنى بن سعيد، عن قتادة، عن أبي أيوب، عن  أبي هريرة، قال قال رسول الله صلى الله عليه وسلم وفي حديث ابن حاتم عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا قاتل أحدكم أخاه فليجتنب الوجه فإن الله خلق آدم على صورته ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Abu Huraira and in the hadith transmitted on the authority of Ibn Hatim Allah's Apostle (may peace be upon him) is reported to have said:                      When any one of you fights with his brother, he should avoid his face for Allah created Adam in His own image.",
      "chain": [
        "30395",
        "20264",
        "38487",
        "20033",
        "11019",
        "33",
        "13"
      ]
    },
    {
      "hadith_no": "7700",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثني أبي، حدثنا صخر، - يعني ابن جويرية - عن نافع، أن عبد الله بن عمر، حدثه أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أراني في المنام أتسوك بسواك فجذبني رجلان أحدهما أكبر من الآخر فناولت السواك الأصغر منهما فقيل لي كبر ‏.‏ فدفعته إلى الأكبر ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Umar reported that Allah's Messenger (may peace be upon him) said:                      It was shown in a vision that I was rinsing my mouth with miswak and two persons began to contend with one another for getting that miswak. One was older than the other. I gave the miswak to the younger one amongst them, but it was said to me: (Let it be given) to the older one. So I gave it to the older one.",
      "chain": [
        "30395",
        "20264",
        "20429",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "971",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا نصر بن علي، حدثني أبي، حدثنا شعبة، عن أبي بشر، سمعت مجاهدا، يحدث عن ابن عمر، عن رسول الله صلى الله عليه وسلم في التشهد ‏\"‏ التحيات لله الصلوات الطيبات السلام عليك أيها النبي ورحمة الله وبركاته ‏\"‏ ‏.‏ قال قال ابن عمر زدت فيها وبركاته ‏.‏ ‏\"‏ السلام علينا وعلى عباد الله الصالحين أشهد أن لا إله إلا الله ‏\"‏ ‏.‏ قال ابن عمر زدت فيها وحده لا شريك له ‏.‏ ‏\"‏ وأشهد أن محمدا عبده ورسوله ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Umar reported the Messenger of Allah (ﷺ) as saying:                      The adoration of the tongue are due to Allah, and acts of worship, all good things. Peace be upon you, O Prophet, and Allah’s mercy and His blessings. Ibn ‘Umar said: I added: “And Allah’s blessings, peace be upon us, and upon Allah’s upright servants. I testify that there is not god but Allah. “Ibn ‘Umar said: I added to it: He is alone, no one is His associate, and I testify that Muhammad is His servant and His Apostle.",
      "chain": [
        "30395",
        "20264",
        "20020",
        "11419",
        "11028",
        "18"
      ]
    },
    {
      "hadith_no": "1232",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا نصر بن علي، أخبرني أبي، حدثنا شريك، عن ابن الأصبهاني، عن عكرمة، عن ابن عباس، أن رسول الله صلى الله عليه وسلم أقام بمكة سبع عشرة يصلي ركعتين ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     The Messenger of Allah (ﷺ) stayed in Mecca seventeen days and prayed two rak'ahs (at each time of prayer).",
      "chain": [
        "30395",
        "20264",
        "20587",
        "11364",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1625",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا نصر بن علي، أخبرنا أبي، أخبرنا إبراهيم بن عطاء، مولى عمران بن حصين عن أبيه، أن زيادا، أو بعض الأمراء بعث عمران بن حصين على الصدقة فلما رجع قال لعمران أين المال قال وللمال أرسلتني أخذناها من حيث كنا نأخذها على عهد رسول الله صلى الله عليه وسلم ووضعناها حيث كنا نضعها على عهد رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Ibrahim ibn Ata, the client of Imran ibn Husayn, reported on the authority of his father:                      Ziyad, or some other governor, sent Imran ibn Husayn to collect sadaqah (i.e. zakat). When he returned, he asked Imran: Where is the property? He replied: Did you send me to bring the property? We collected it from where we used to collect in the lifetime of the Messenger of Allah (ﷺ), and we spent it where we used to spend during the time of the Messenger of Allah (ﷺ).",
      "chain": [
        "30395",
        "20264"
      ]
    },
    {
      "hadith_no": "1652",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا نصر بن علي، أخبرنا أبي، عن خالد بن قيس، عن قتادة، عن أنس، أن النبي صلى الله عليه وسلم وجد تمرة فقال ‏\"‏ لولا أني أخاف أن تكون صدقة لأكلتها ‏\"‏ ‏.‏ قال أبو داود رواه هشام عن قتادة هكذا ‏.‏",
      "text_en": " Anas said:                      Messenger of Allah (May peace be upon him) found a date and said: Were it not that I fear it may be part of the sadaqah, I would eat it.",
      "chain": [
        "30395",
        "20264",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "2632",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا نصر بن علي، أخبرنا أبي، حدثنا المثنى بن سعيد، عن قتادة، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم إذا غزا قال ‏\"‏ اللهم أنت عضدي ونصيري بك أحول وبك أصول وبك أقاتل ‏\"‏ ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     When the Messenger of Allah (ﷺ) went on an expedition, he said: O Allah, Thou art my aider and helper; by Thee I move, by Thee I attack, and by Thee I fight.",
      "chain": [
        "30395",
        "20264",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "3977",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا نصر بن علي، حدثنا أبي، حدثنا عبد الله بن المبارك، حدثنا يونس بن يزيد، عن أبي علي بن يزيد، عن الزهري، عن أنس بن مالك، رضي الله عنه أن رسول الله صلى الله عليه وسلم قرأ ‏{‏ وكتبنا عليهم فيها أن النفس بالنفس والعين بالعين ‏}‏ ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Prophet (ﷺ) read the verse: \"We ordained therein for them: Life for life and eye for eye (an-nafsa bin-nafsi wal-'aynu bil-'ayn).",
      "chain": [
        "30395",
        "20264",
        "20025",
        "20475",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "4227",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Signet-Rings (Kitab Al-Khatam) - كتاب الخاتم",
      "chapter_no": "36",
      "text_ar": "حدثنا نصر بن علي، حدثني أبي، حدثنا عبد العزيز بن أبي رواد، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم كان يتختم في يساره وكان فصه في باطن كفه ‏.‏ قال أبو داود قال ابن إسحاق وأسامة - يعني ابن زيد - عن نافع بإسناده في يمينه ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ) used to wear the signet-ring on his left hand, and put its stone next the palm of his hand.Abu Dawud said: Ibn Ishaq and Usamah b. Zaid transmitted from Nafi': \"On his right hand\".",
      "chain": [
        "30395",
        "20264",
        "20739",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "413",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا علي بن نصر بن علي الجهضمي، حدثنا سهل بن حماد، حدثنا همام، قال حدثني قتادة، عن الحسن، عن حريث بن قبيصة، قال قدمت المدينة فقلت اللهم يسر لي جليسا صالحا ‏.‏ قال فجلست إلى أبي هريرة فقلت إني سألت الله أن يرزقني جليسا صالحا فحدثني بحديث سمعته من رسول الله صلى الله عليه وسلم لعل الله أن ينفعني به فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن أول ما يحاسب به العبد يوم القيامة من عمله صلاته فإن صلحت فقد أفلح وأنجح وإن فسدت فقد خاب وخسر فإن انتقص من فريضته شيء قال الرب عز وجل انظروا هل لعبدي من تطوع فيكمل بها ما انتقص من الفريضة ثم يكون سائر عمله على ذلك ‏\"‏ ‏.‏ قال وفي الباب عن تميم الداري ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن غريب من هذا الوجه ‏.‏ وقد روي هذا الحديث من غير هذا الوجه عن أبي هريرة وقد روى بعض أصحاب الحسن عن الحسن عن قبيصة بن حريث غير هذا الحديث والمشهور هو قبيصة بن حريث ‏.‏ وروي عن أنس بن حكيم عن أبي هريرة عن النبي صلى الله عليه وسلم نحو هذا ‏.‏",
      "text_en": " Huraith bin Qabisah narrated:                     \"I arrived in Al-Madinah and said: 'O Allah! Facilitate me to be in a righteous gathering.'\" He said: \"I sat with Abu Hurairah and said: 'Indeed I asked Allah to provide me with a righteous gathering. So narrate a hadith to me which you heard from Allah's Messenger (ﷺ) so that perhaps Allah would cause me to benefit from it.' He said: 'I heard Allah's Messenger (ﷺ) say: \"Indeed the first deed by which a servant will be called to account on the Day of Resurrection is his Salat. If it is complete, he is successful and saved, but if it is defective, he has failed and lost. So if something is deficient in his obligatory (prayers) then the Lord, Mighty and Sublime says: 'Look! Are there any voluntary (prayers) for my worshipper?' So with them, what was deficient in his obligatory (prayers) will be completed. Then the rest of his deeds will be treated like that.\"",
      "chain": [
        "20264",
        "20548",
        "20297",
        "11019",
        "11016"
      ]
    },
    {
      "hadith_no": "3584",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا نصر بن علي الجهضمي، أخبرني أبي، عن المثنى بن سعيد، عن قتادة، عن أنس، قال كان النبي صلى الله عليه وسلم إذا غزا قال ‏\"‏ اللهم أنت عضدي وأنت نصيري وبك أقاتل ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ومعنى قوله عضدي ‏.‏ يعني عوني ‏.‏",
      "text_en": " Anas narrated that when the Prophet would go out for an expedition, he would say:                     “O Allah, You are my Adud and You are my Helper, and by You do I fight (Allahumma Anta Adudi, Wa Anta Nasiri, Wa Bika Uqtail).”",
      "chain": [
        "30395",
        "20264",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "4098",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا علي بن جعفر بن محمد بن علي، أخبرني أخي، موسى بن جعفر بن محمد عن أبيه، جعفر بن محمد عن أبيه، محمد بن علي عن أبيه، علي بن الحسين عن أبيه، عن جده، علي بن أبي طالب أن رسول الله صلى الله عليه وسلم أخذ بيد حسن وحسين فقال ‏\"‏ من أحبني وأحب هذين وأباهما وأمهما كان معي في درجتي يوم القيامة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه من حديث جعفر بن محمد إلا من هذا الوجه ‏.‏",
      "text_en": " Narrated 'Ali bin Husain:                     from his father, from his grandfather, 'Ali bin Abi Talib: \"The Prophet (ﷺ) took Hasan and Husain by the hand and said: 'Whoever loves me and loves these two, and their father and mother, he shall be with me in my level on the Day of Judgement.\"",
      "chain": [
        "30395",
        "20264",
        "5"
      ]
    },
    {
      "hadith_no": "2328",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني أبو بكر بن علي، قال حدثنا نصر بن علي، قال أخبرني أبي، عن القاسم بن معن، عن طلحة بن يحيى، عن عائشة بنت طلحة، ومجاهد، عن عائشة، أن رسول الله صلى الله عليه وسلم أتاها فقال ‏\"‏ هل عندكم طعام ‏\"‏ ‏.‏ فقلت لا ‏.‏ قال ‏\"‏ إني صائم ‏\"‏ ‏.‏ ثم جاء يوما آخر فقالت عائشة يا رسول الله إنا قد أهدي لنا حيس فدعا به فقال ‏\"‏ أما إني قد أصبحت صائما ‏\"‏ ‏.‏ فأكل ‏.‏",
      "text_en": " It was narrated from 'Aishah that the Messenger of Allah came to her and said:                     \"Do you have any food?\" and Aishah said: \"O Messenger of Allah, we have been given some Hais.\" So he called for it, and said: \"I started the day fasting,\" then he ate.",
      "chain": [
        "30395",
        "20264",
        "25240",
        "11863",
        "10504",
        "11028",
        "53"
      ]
    },
    {
      "hadith_no": "5605",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا أبو بكر بن علي، قال حدثنا نصر بن علي، قال أخبرني أبي قال، حدثنا إبراهيم بن نافع، عن ابن طاوس، عن أبيه، عن ابن عمر، قال خطب رسول الله صلى الله عليه وسلم فذكر آية الخمر فقال رجل يا رسول الله أرأيت المزر قال ‏\"‏ وما المزر ‏\"‏ ‏.‏ قال حبة تصنع باليمن ‏.‏ فقال ‏\"‏ تسكر ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ كل مسكر حرام ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah [SAW] delivered a Khutbah and quoted the Verse about Khamr. A man said: 'O Messenger of Allah, what do you think about Al-Mizr (beer)?' He said: 'What is beer?' He said: 'A (drink) from grains that is made in Yemen.' He said: 'Does it intoxicate?' He said: 'Yes.' He said: 'Every intoxicant is unlawful.'\"",
      "chain": [
        "30395",
        "20264",
        "20189",
        "11433",
        "11053",
        "18"
      ]
    },
    {
      "hadith_no": "1028",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا نصر بن علي، حدثنا أبي، حدثنا شعبة، عن عبد الله بن المختار، عن موسى بن أنس، عن أنس، قال صلى رسول الله  صلى الله عليه وسلم  بامرأة من أهله وبي فأقامني عن يمينه وصلت المرأة خلفنا ‏.‏",
      "text_en": " It wasnarrated that Anas said:                      “The Messenger of Allah (ﷺ) led awomanof his household and myself in prayer. I stood to his right andthewoman stood behind us.”",
      "chain": [
        "30395",
        "20264",
        "20020",
        "24244",
        "14383",
        "19"
      ]
    },
    {
      "hadith_no": "2531",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثني أبي، حدثنا هشام، عن قتادة، عن أنس، قال لقد رهن رسول الله صلى الله عليه وسلم درعه عند يهودي بالمدينة فأخذ لأهله منه شعيرا ‏.‏",
      "text_en": " It was narrated that Anas said:                     “The Messenger of Allah (ﷺ) pawned his armor to a jew in Al-Madinah, and took barely for his family in return.”",
      "chain": [
        "30395",
        "20264",
        "20295",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "3093",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن بشار، قالا حدثنا محمد بن جعفر، ح وحدثنا نصر بن علي الجهضمي، حدثني أبي قالا، حدثنا شعبة، عن الحكم، عن عمارة بن عمير، عن إبراهيم بن أبي موسى، عن أبي موسى الأشعري، أنه كان يفتي بالمتعة فقال له رجل رويدك بعض فتياك فإنك لا تدري ما أحدث أمير المؤمنين في النسك بعدك ‏.‏ حتى لقيته بعد فسألته فقال عمر قد علمت أن رسول الله  صلى الله عليه وسلم  فعله وأصحابه ولكني كرهت أن يظلوا بهن معرسين تحت الأراك ثم يروحون بالحج تقطر رءوسهم ‏.‏",
      "text_en": " It wasnarrated from Ibrahim bin Abu Musa:                      “Abu Musa Al-Ash’ari usedtoissue rulings concerning Tamattu’. Then a man said to him:‘Withhold some of your rulings, for you do not know what theCommanderof the Believers has introduced into the rites after you.’(Abu Musasaid:) ‘Then when I met him later on, I asked him.’‘Umar said: ‘Iknow that the Messenger of Allah (ﷺ) and hisCompanions did it, butI did not like that people should lie withtheir wives in the shade ofthe Arak trees and then go out for Hajjwith their heads dripping,’(i.e. due to the bath after sexualrelations).”",
      "chain": [
        "30201",
        "30160",
        "20173",
        "30395",
        "20264",
        "20020",
        "11069",
        "11378",
        "41"
      ]
    },
    {
      "hadith_no": "3239",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثني أبي ح، وحدثنا محمد بن بشار، حدثنا محمد بن جعفر، قالا حدثنا شعبة، سمعت قتادة، يحدث عن أنس بن مالك، أن رسول الله  صلى الله عليه وسلم  كان يضحي بكبشين أملحين أقرنين ويسمي ويكبر ولقد رأيته يذبح بيده واضعا قدمه على صفاحهما ‏.‏",
      "text_en": " It wasnarrated from Anas bin Malik:                      “The Messenger of Allah (ﷺ)used tosacrifice two horned, black-and-white rams and he would saythe Nameof Allah and pronounce His greatness. I saw him slaughteringthemwith his own hand, putting his foot on their sides.”",
      "chain": [
        "30395",
        "20264",
        "30160",
        "20173",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "3529",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا نصر بن علي، حدثنا أبي، عن المثنى بن سعيد، عن أبي المتوكل، عن أبي سعيد الخدري، قال نهى رسول الله  صلى الله عليه وسلم  عن الشرب في الحنتم والدباء والنقير ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed Al-Khudri said:                      “The Messenger ofAllah(ﷺ) forbade drinking from Hantam, Dubba’ and Naqir.",
      "chain": [
        "30395",
        "20264",
        "11297",
        "38"
      ]
    }
  ],
  "total_hadiths": 31
}