{
  "id": "20267",
  "name": "'Amr bin 'Asim al-Kalabi عمرو بن عاصم الكلابي",
  "full_name": "'Amr bin 'Asim al-Kalabi عمرو بن عاصم الكلابي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "213",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ع  -  صدوق ]"
    ],
    "tags": [
      "al-Kalabi",
      "al-Basri"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Sadooq] [ ع  -  صدوق ]",
        "ar": "Narrator[Grade:Sadooq] [ ع  -  صدوق ]",
        "ckb": "Narrator[Grade:Sadooq] [ ع  -  صدوق ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Basra",
        "ar": "البصرة",
        "ckb": "بەسرە"
      }
    ],
    "tags_display": [
      {
        "en": "al-Kalabi",
        "ar": "al-Kalabi",
        "ckb": "al-Kalabi"
      },
      {
        "en": "al-Basri",
        "ar": "al-Basri",
        "ckb": "al-Basri"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "24296",
      "name": "'Ubaidullah bin al-Waza' عبيد الله بن الوازع الكلابي البصري",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    }
  ],
  "students": [],
  "hadiths": [
    {
      "id": "sahih-bukhari-575",
      "hadith_no": "575",
      "source": "Sahih Bukhari",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عمرو بن عاصم، قال حدثنا همام، عن قتادة، عن أنس، أن زيد بن ثابت، حدثه أنهم، تسحروا مع النبي صلى الله عليه وسلم ثم قاموا إلى الصلاة‏.‏ قلت كم بينهما قال قدر خمسين أو ستين  يعني آية  ح‏.‏",
      "text_en": " Narrated Anas:                     Zaid bin Thabit said, \"We took the \"Suhur\" (the meal taken before dawn while fasting is observed) with the Prophet and then stood up for the (morning) prayer.\" I asked him how long the interval between the two (Suhur and prayer) was. He replied, 'The interval between the two was just sufficient to recite fifty to Sixth 'Ayat.\"",
      "usc_msa_ref": "549",
      "chain": [
        "20267",
        "20297",
        "11019",
        "19",
        "49"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3464",
      "hadith_no": "3464",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني أحمد بن إسحاق، حدثنا عمرو بن عاصم، حدثنا همام، حدثنا إسحاق بن عبد الله، قال حدثني عبد الرحمن بن أبي عمرة، أن أبا هريرة، حدثه أنه، سمع النبي صلى الله عليه وسلم ح وحدثني محمد، حدثنا عبد الله بن رجاء، أخبرنا همام، عن إسحاق بن عبد الله، قال أخبرني عبد الرحمن بن أبي عمرة، أن أبا هريرة  رضى الله عنه  حدثه أنه، سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن ثلاثة في بني إسرائيل أبرص وأقرع وأعمى بدا لله أن يبتليهم، فبعث إليهم ملكا، فأتى الأبرص‏.‏ فقال أى شىء أحب إليك قال لون حسن وجلد حسن، قد قذرني الناس‏.‏ قال فمسحه، فذهب عنه، فأعطي لونا حسنا وجلدا حسنا‏.‏ فقال أى المال أحب إليك قال الإبل  أو قال البقر هو شك في ذلك، إن الأبرص والأقرع، قال أحدهما الإبل، وقال الآخر البقر  فأعطي ناقة عشراء‏.‏ فقال يبارك لك فيها‏.‏ وأتى الأقرع فقال أى شىء أحب إليك قال شعر حسن، ويذهب عني هذا، قد قذرني الناس‏.‏ قال فمسحه فذهب، وأعطي شعرا حسنا‏.‏ قال فأى المال أحب إليك قال البقر‏.‏ قال فأعطاه بقرة حاملا، وقال يبارك لك فيها‏.‏ وأتى الأعمى فقال أى شىء أحب إليك قال يرد الله إلى بصري، فأبصر به الناس‏.‏ قال فمسحه، فرد الله إليه بصره‏.‏ قال فأى المال أحب إليك قال الغنم‏.‏ فأعطاه شاة والدا، فأنتج هذان، وولد هذا، فكان لهذا واد من إبل، ولهذا واد من بقر، ولهذا واد من الغنم‏.‏ ثم إنه أتى الأبرص في صورته وهيئته فقال رجل مسكين، تقطعت بي الحبال في سفري، فلا بلاغ اليوم إلا بالله ثم بك، أسألك بالذي أعطاك اللون الحسن والجلد الحسن والمال بعيرا أتبلغ عليه في سفري‏.‏ فقال له إن الحقوق كثيرة‏.‏ فقال له كأني أعرفك، ألم تكن أبرص يقذرك الناس فقيرا فأعطاك الله فقال لقد ورثت لكابر عن كابر‏.‏ فقال إن كنت كاذبا فصيرك الله إلى ما كنت، وأتى الأقرع في صورته وهيئته، فقال له مثل ما قال لهذا، فرد عليه مثل ما رد عليه هذا فقال إن كنت كاذبا فصيرك الله إلى ما كنت‏.‏ وأتى الأعمى في صورته فقال رجل مسكين وابن سبيل وتقطعت بي الحبال في سفري، فلا بلاغ اليوم إلا بالله، ثم بك أسألك بالذي رد عليك بصرك شاة أتبلغ بها في سفري‏.‏ فقال قد كنت أعمى فرد الله بصري، وفقيرا فقد أغناني، فخذ ما شئت، فوالله لا أجهدك اليوم بشىء أخذته لله‏.‏ فقال أمسك مالك، فإنما ابتليتم، فقد رضي الله عنك وسخط على صاحبيك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     that he heard Allah's Apostle saying, \"Allah willed to test three Israelis who were a Leper, a blind man and a bald-headed man. So, he sent them an angel who came to the leper and said, 'What thing do you like most?' He replied, \"Good color and good skin, for the people have a strong aversion to me.' The angel touched him and his illness was cured, and he was given a good color and beautiful skin. The angel asked him, 'What kind of property do you like best?' He replied, 'Camels (or cows).' (The narrator is in doubt, for either the leper or the bald-headed man demanded camels and the other demanded cows.) So he (i.e. the leper) was given a pregnant she-camei, and the angel said (to him), 'May Allah bless you in it.' The angel then went to the bald-headed man and said, 'What thing do you like most?' He said, 'I like good hair and wish to be cured of this disease, for the people feel repulsion for me.' The angel touched him and his illness was cured, and he was given good hair. The angel asked (him), 'What kind of property do you like bests' He replied, 'Cows,' The angel gave him a pregnant cow and said, 'May Allah bless you in it.' The angel went to the blind man and asked, 'What thing do you like best?' He said, '(I like) that Allah may restore my eye-sight to me so that I may see the people.' The angel touched his eyes and Allah gave him back his eye-sight. The angel asked him, \"What kind of property do you like best?' He replied, 'Sheep.' The angel gave him a pregnant sheep. Afterwards, all the three pregnant animals gave birth to young ones, and multiplied and brought forth so much that one of the (three) men had a herd of camels filling a valley, and one had a herd of cows filling a valley, and one had a flock of sheep filling a valley. Then the angel, disguised in the shape and appearance of a leper, went to the leper and said, I am a poor man, who has lost all means of livelihood while on a journey. So none will satisfy my need except Allah and then you. In the Name of Him Who has given you such nice color and beautiful skin, and so much property, I ask you to give me a camel so that I may reach my destination. The man replied, 'I have many obligations (so I cannot give you).' The angel said, 'I think I know you; were you not a leper to whom the people had a strong aversion? Weren't you a poor man, and then Allah gave you (all this property).' He replied, '(This is all wrong), I got this property through inheritance from my fore-fathers' The angel said, 'If you are telling a lie, then let Allah make you as you were before. ' Then the angel, disguised in the shape and appearance of a bald man, went to the bald man and said to him the same as he told the first one, and he too answered the same as the first one did. The angel said, 'If you are telling a lie, then let Allah make you as you were before.' The angel, disguised in the shape of a blind man, went to the blind man and said, 'I am a poor man and a traveler, whose means of livelihood have been exhausted while on a journey. I have nobody to help me except Allah, and after Him, you yourself. I ask you in the Name of Him Who has given you back your eye-sight to give me a sheep, so that with its help, I may complete my journey' The man said, 'No doubt, I was blind and Allah gave me back my eye-sight; I was poor and Allah made me rich; so take anything you wish from my property. By Allah, I will not stop you for taking anything (you need) of my property which you may take for Allah's sake.' The angel replied, 'Keep your property with you. You (i.e 3 men) have been tested and Allah is pleased with you and is angry with your two companions.\"",
      "usc_msa_ref": "670",
      "chain": [
        "30289",
        "20267",
        "20297",
        "11151",
        "1238",
        "13"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5100",
      "hadith_no": "5100",
      "source": "Sahih Bukhari",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا عمرو بن عاصم، حدثنا همام، عن قتادة، قال سئل أنس كيف كانت قراءة النبي صلى الله عليه وسلم‏.‏ فقال كانت مدا‏.‏ ثم قرأ بسم الله الرحمن الرحيم، يمد ببسم الله، ويمد بالرحمن، ويمد بالرحيم‏.‏",
      "text_en": " Narrated Qatada:                     Anas was asked, \"How was the recitation (of the Qur'an) of the Prophet?' He replied, \"It was characterized by the prolongation of certain sounds.\" He then recited: In the Name of Allah, the Most Beneficent, the Most Merciful prolonging the pronunciation of 'In the Name of Allah, 'the most Beneficent,' and 'the Most Merciful.",
      "usc_msa_ref": "566",
      "chain": [
        "20267",
        "20297",
        "11019"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5872",
      "hadith_no": "5872",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا عمرو بن عاصم، حدثنا همام، عن قتادة، عن أنس، قال قلت له أى الثياب كان أحب إلى النبي صلى الله عليه وسلم قال الحبرة‏.‏",
      "text_en": " Narrated Qatada:                     I asked Anas, \"What kind of clothes was most beloved to the Prophet?\" He replied, \"The Hibra (a kind of Yemenese cloth).",
      "usc_msa_ref": "703",
      "chain": [
        "20267",
        "20297",
        "11019",
        "19"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6237",
      "hadith_no": "6237",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عمرو بن عاصم، حدثنا همام، عن قتادة، عن أنس، أن رجلا، من أهل البادية أتى النبي صلى الله عليه وسلم فقال يا رسول الله متى الساعة قائمة قال ‏\"‏ ويلك وما أعددت لها ‏\"‏‏.‏ قال ما أعددت لها إلا أني أحب الله ورسوله‏.‏ قال ‏\"‏ إنك مع من أحببت ‏\"‏‏.‏ فقلنا ونحن كذلك‏.‏ قال ‏\"‏ نعم ‏\"‏‏.‏ ففرحنا يومئذ فرحا شديدا، فمر غلام للمغيرة وكان من أقراني فقال ‏\"‏ إن أخر هذا فلن يدركه الهرم حتى تقوم الساعة ‏\"‏‏.‏ واختصره شعبة عن قتادة سمعت أنسا عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas:                     A bedouin came to the Prophet and said, \"O Allah's Apostle! When will The Hour be established?\" The Prophet said, \"Wailaka (Woe to you), What have you prepared for it?\" The bedouin said, \"I have not prepared anything for it, except that I love Allah and H is Apostle.\" The Prophet said, \"You will be with those whom you love.\" We (the companions of the Prophet ) said, \"And will we too be so? The Prophet said, \"Yes.\" So we became very glad on that day. In the meantime, a slave of Al-Mughira passed by, and he was of the same age as I was. The Prophet said. \"If this (slave) should live long, he will not reach the geriatric old age, but the Hour will be established.\"",
      "usc_msa_ref": "188",
      "chain": [
        "20267",
        "20297",
        "11019",
        "19"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6336",
      "hadith_no": "6336",
      "source": "Sahih Bukhari",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا عمرو بن عاصم، حدثنا همام، عن قتادة، قال قلت لأنس أكانت المصافحة في أصحاب النبي صلى الله عليه وسلم قال نعم‏.‏",
      "text_en": " Narrated Qatada:                     I asked Anas, \"Was it a custom of the companions of the Prophet to shake hands with one another?\" He said, \"Yes.\"",
      "usc_msa_ref": "279",
      "chain": [
        "20267",
        "20297",
        "11019"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6734",
      "hadith_no": "6734",
      "source": "Sahih Bukhari",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "وقال عمرو بن عاصم حدثنا همام، حدثنا إسحاق بن عبد الله، حدثنا عبد الرحمن بن أبي عمرة، أن أبا هريرة، حدثه أنه، سمع النبي صلى الله عليه وسلم يقول ‏\"‏ إن ثلاثة في بني إسرائيل أراد الله أن يبتليهم، فبعث ملكا فأتى الأبرص فقال تقطعت بي الحبال، فلا بلاغ لي إلا بالله، ثم بك ‏\"‏‏.‏ فذكر الحديث‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20267",
        "20297",
        "11151",
        "1238",
        "13"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6912",
      "hadith_no": "6912",
      "source": "Sahih Bukhari",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثني عبد القدوس بن محمد، حدثني عمرو بن عاصم الكلابي، حدثنا همام بن يحيى، حدثنا إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك  رضى الله عنه  قال كنت عند النبي صلى الله عليه وسلم فجاءه رجل فقال يا رسول الله إني أصبت حدا فأقمه على‏.‏ قال ولم يسأله عنه‏.‏ قال وحضرت الصلاة فصلى مع النبي صلى الله عليه وسلم فلما قضى النبي صلى الله عليه وسلم الصلاة قام إليه الرجل فقال يا رسول الله إني أصبت حدا، فأقم في كتاب الله‏.‏ قال ‏\"‏ أليس قد صليت معنا ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ فإن الله قد غفر لك ذنبك ‏\"‏‏.‏ أو قال ‏\"‏ حدك ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     While I was with the Prophet a man came and said, \"O Allah's Apostle! I have committed a legally punishable sin; please inflict the legal punishment on me'.' The Prophet did not ask him what he had done. Then the time for the prayer became due and the man offered prayer along with the Prophet , and when the Prophet had finished his prayer, the man again got up and said, \"O Allah's Apostle! I have committed a legally punishable sin; please inflict the punishment on me according to Allah's Laws.\" The Prophet said, \"Haven't you prayed with us?' He said, \"Yes.\" The Prophet said, \"Allah has forgiven your sin.\" or said, \"....your legally punishable sin.\"",
      "usc_msa_ref": "812",
      "chain": [
        "30148",
        "20267",
        "20297",
        "11151",
        "19"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-7599",
      "hadith_no": "7599",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا أحمد بن إسحاق، حدثنا عمرو بن عاصم، حدثنا همام، حدثنا إسحاق بن عبد الله، سمعت عبد الرحمن بن أبي عمرة، قال سمعت أبا هريرة، قال سمعت النبي صلى الله عليه وسلم قال ‏\"‏ إن عبدا أصاب ذنبا  وربما قال أذنب ذنبا  فقال رب أذنبت  وربما قال أصبت  فاغفر لي فقال ربه أعلم عبدي أن له ربا يغفر الذنب ويأخذ به غفرت لعبدي‏.‏ ثم مكث ما شاء الله، ثم أصاب ذنبا أو أذنب ذنبا، فقال رب أذنبت  أو أصبت  آخر فاغفره‏.‏ فقال أعلم عبدي أن له ربا يغفر الذنب ويأخذ به غفرت لعبدي، ثم مكث ما شاء الله ثم أذنب ذنبا  وربما قال أصاب ذنبا  قال قال رب أصبت  أو أذنبت  آخر فاغفره لي‏.‏ فقال أعلم عبدي أن له ربا يغفر الذنب ويأخذ به غفرت لعبدي  ثلاثا  فليعمل ما شاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard the Prophet saying, \"If somebody commits a sin and then says, 'O my Lord! I have sinned, please forgive me!' and his Lord says, 'My slave has known that he has a Lord who forgives sins and punishes for it, I therefore have forgiven my slave (his sins).' Then he remains without committing any sin for a while and then again commits another sin and says, 'O my Lord, I have committed another sin, please forgive me,' and Allah says, 'My slave has known that he has a Lord who forgives sins and punishes for it, I therefore have forgiven my slave (his sin). Then he remains without Committing any another sin for a while and then commits another sin (for the third time) and says, 'O my Lord, I have committed another sin, please forgive me,' and Allah says, 'My slave has known that he has a Lord Who forgives sins and punishes for it I therefore have forgiven My slave (his sin), he can do whatever he likes.\"",
      "usc_msa_ref": "598",
      "chain": [
        "30289",
        "20267",
        "20297",
        "11151",
        "1238",
        "13"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-muslim-289",
      "hadith_no": "289",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن الحسن بن خراش، حدثنا عمرو بن عاصم، حدثنا معتمر، قال سمعت أبي يحدث، أن خالدا الأثبج ابن أخي، صفوان بن محرز حدث عن صفوان بن محرز، أنه حدث أن جندب بن عبد الله البجلي بعث إلى عسعس بن سلامة زمن فتنة ابن الزبير فقال اجمع لي نفرا من إخوانك حتى أحدثهم ‏.‏ فبعث رسولا إليهم فلما اجتمعوا جاء جندب وعليه برنس أصفر فقال تحدثوا بما كنتم تحدثون به ‏.‏ حتى دار الحديث فلما دار الحديث إليه حسر البرنس عن رأسه فقال إني أتيتكم ولا أريد أن أخبركم عن نبيكم إن رسول الله صلى الله عليه وسلم بعث بعثا من المسلمين إلى قوم من المشركين وإنهم التقوا فكان رجل من المشركين إذا شاء أن يقصد إلى رجل من المسلمين قصد له فقتله وإن رجلا من المسلمين قصد غفلته قال وكنا نحدث أنه أسامة بن زيد فلما رفع عليه السيف قال لا إله إلا الله ‏.‏ فقتله فجاء البشير إلى النبي صلى الله عليه وسلم فسأله فأخبره حتى أخبره خبر الرجل كيف صنع فدعاه فسأله فقال ‏\"‏ لم قتلته ‏\"‏ ‏.‏ قال يا رسول الله أوجع في المسلمين وقتل فلانا وفلانا - وسمى له نفرا - وإني حملت عليه فلما رأى السيف قال لا إله إلا الله ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ أقتلته ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فكيف تصنع بلا إله إلا الله إذا جاءت يوم القيامة ‏\"‏ ‏.‏ قال يا رسول الله استغفر لي ‏.‏ قال ‏\"‏ وكيف تصنع بلا إله إلا الله إذا جاءت يوم القيامة ‏\"‏ ‏.‏ قال فجعل لا يزيده على أن يقول ‏\"‏ كيف تصنع بلا إله إلا الله إذا جاءت يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It is narrated by Safwan b. Muhriz that Jundab b. 'Abdullah al-Bajali during the stormy days of Ibn Zubair sent a message to 'As'as b. Salama:                      Gather some men of your family so that I should talk to them. He ('As'as) sent a messenger to them (to the members of his family). When they had assembled, Jundab came there with a yellow hooded cloak on him, He said: Talk what you were busy in talking. The talk went on by turns, till there came his (Jundab's) turn. He took off the hooded cloak from his head and said: I have come to you with no other intention but to narrate to you a hadith of your Apostle: Verily the Messenger of Allah (may peace be upon him) sent a squad of the Muslims to a tribe of the polytheists. Both the armies confronted one another. There was a man among the army of polytheists who (was so dashing that), whenever he intended to kill a man from among the Muslims, he killed him. Amongst the Muslims too was a man looking forward to (an opportunity of) his (the polytheist's) unmindfulness. He (the narrator) said: We talked that he was Usama b, Zaid. When he raised his sword, he (the soldier of the polytheists) uttered:\" There is no god but Allah,\" but he (Usama b. Zaid) killed him. When the messenger of the glad tidings came to the Apostle (may peace be upon him) he asked him (about the events of the battle) and he informed him about the man (Usama) and what he had done He (the Prophet of Allah) called for him and asked him why he had killed him. He (Usama) said: Messenger of Allah, he struck the Muslims and killed such and such of them. And he even named some of them. (He continued): I attacked him and when he saw the sword he said: There is no god but Allah. The Messenger of Allah (may peace be upon him) said: Did you kill him? He (Usama) replied in the affirmative. He (the Holy Prophet) remarked: What would you do with:\" There is no god but Allah,\" when he would come (before you) on the Day of Judgment? He (Usama) said: Messenger of Allah, beg pardon for me (from your Lord). He (the Holy Prophet) said: What would you do with:\" There is no god but Allah\" when he would come (before you) on the Day of Judgment? He (the Holy Prophet) added nothing to it but kept saying: What would you do with:\" There is no god but Allah,\" when he would come (before you) on the Day of Judgment?",
      "usc_msa_ref": "",
      "chain": [
        "30495",
        "20267",
        "20288",
        "11289",
        "11693"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-1471",
      "hadith_no": "1471",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا بشر بن السري، ح قال وحدثنا ابن خراش، حدثنا عمرو بن عاصم، قالا جميعا حدثنا همام، بهذا الإسناد ونسبا أبا بكر فقالا ابن أبي موسى ‏.‏",
      "text_en": " This hadith has been narrated by the same chain of transmitters by Hammam, and said about Abu Bakr that he was Ibn Abu Musa.",
      "usc_msa_ref": "",
      "chain": [
        "30421",
        "20190",
        "20267"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6472",
      "hadith_no": "6472",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا زهير بن حرب، أخبرني عمرو بن عاصم الكلابي، حدثنا سليمان بن المغيرة، عن ثابت، عن أنس، قال قال أبو بكر رضى الله عنه بعد وفاة رسول الله صلى الله عليه وسلم لعمر انطلق بنا إلى أم أيمن نزورها كما كان رسول الله صلى الله عليه وسلم يزورها ‏.‏ فلما انتهينا إليها بكت فقالا لها ما يبكيك ما عند الله خير لرسوله صلى الله عليه وسلم ‏.‏ فقالت ما أبكي أن لا أكون أعلم أن ما عند الله خير لرسوله صلى الله عليه وسلم ولكن أبكي أن الوحى قد انقطع من السماء ‏.‏ فهيجتهما على البكاء فجعلا يبكيان معها ‏.‏",
      "text_en": " Anas reported that after the death of Allah's Messenger (may peace be upon him) Abu Bakr said to 'Umar:                      Let us visit Umm Aiman as Allah's Messenger (may peace be upon him) used to visit her. As we came to her, she wept. They (Abu Bakr and Umar) said to her: What makes you weep? What is in store (in the next world) for Allah's-Messenger (may peace be upon him) is better than (this worldly life). She said: I weep not because I am ignorant of the fact that what is in store for Allah's Messenger (may peace be upon him) (in the next world) is better than (this world), but I weep because the revelation which came from the Heaven has ceased to come. This moved both of them to tears and they began to weep along with her.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20267",
        "20236",
        "11269",
        "19",
        "20436"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6473",
      "hadith_no": "6473",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا حسن الحلواني، حدثنا عمرو بن عاصم، حدثنا همام، عن إسحاق بن عبد، الله عن أنس، قال كان النبي صلى الله عليه وسلم لا يدخل على أحد من النساء إلا على أزواجه إلا أم سليم فإنه كان يدخل عليها فقيل له في ذلك فقال ‏\"‏ إني أرحمها قتل أخوها معي ‏\"‏ ‏.‏",
      "text_en": " Anas reported that Allah's Apostle (may peace be upon him) did not enter the house of any woman except that of his wives and that of Umm Sulaim. He used to visit her. It was said to him why it was so, whereupon he said:                      I feel great compassion for her. Her brother was killed while he was with me.",
      "usc_msa_ref": "",
      "chain": [
        "130115",
        "20267",
        "20297",
        "11151",
        "19"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6477",
      "hadith_no": "6477",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أحمد بن الحسن بن خراش، حدثنا عمرو بن عاصم، حدثنا سليمان بن، المغيرة حدثنا ثابت، حدثني أنس بن مالك، قال مات ابن لأبي طلحة ‏.‏ واقتص الحديث بمثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Anas b. Malik through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30495",
        "20267",
        "20236",
        "11269",
        "19"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6495",
      "hadith_no": "6495",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني أبو داود، سليمان بن معبد حدثنا عمرو بن عاصم، حدثنا همام، حدثنا  قتادة، قال قلت لأنس بن مالك من جمع القرآن على عهد رسول الله صلى الله عليه وسلم قال أربعة كلهم من الأنصار أبى بن كعب ومعاذ بن جبل وزيد بن ثابت ورجل من الأنصار يكنى أبا زيد ‏.‏",
      "text_en": " Hammam said:                      I said to Anas b. Malik: Who collected the Qur'an during the lifetime of Allah's Messenger (may peace be upon him)? He said: Four (persons), all of them belonging to Ansir: Ubayy b. Ka'b, Mu'adh b. Jabal, Zaid b. Thabit and a person from the Ansar whose Kunya was Abu Zaid.",
      "usc_msa_ref": "",
      "chain": [
        "20267",
        "20297",
        "11019"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7182",
      "hadith_no": "7182",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثنا الحسن بن علي الحلواني، حدثنا عمرو بن عاصم، حدثنا همام، عن إسحاق،بن عبد الله بن أبي طلحة عن أنس، قال جاء رجل إلى النبي صلى الله عليه وسلم فقاليا رسول الله أصبت حدا فأقمه على - قال - وحضرت الصلاة فصلى مع رسول اللهصلى الله عليه وسلم فلما قضى الصلاة قال يا رسول الله إني أصبت حدا فأقم فيكتاب الله ‏.‏ قال ‏\"‏ هل حضرت الصلاة معنا ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ قد غفر لك ‏\"‏ ‏.‏",
      "text_en": " Anas reported that a person came to Allah's Apostle (may peace be upon him) said:                      Allah's Messenger, I have committed an offence which deserves imposition of haad, so impose it upon me according to the Book of Allah. Thereupon he said: Were you not present with us at the time of prayer? He said: Yes. Thereupon he said: You have been granted pardon.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20267",
        "20297",
        "19"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-570",
      "hadith_no": "570",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن المثنى، أن عمرو بن عاصم، حدثهم قال حدثنا همام، عن قتادة، عن مورق، عن أبي الأحوص، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ صلاة المرأة في بيتها أفضل من صلاتها في حجرتها وصلاتها في مخدعها أفضل من صلاتها في بيتها ‏\"‏ ‏.‏",
      "text_en": " ‘Abd Allah (b. Mas’ud) reported the prophet (ﷺ) as saying; it is more excellent for a woman to pray in her house than in her courtyard, and more excellent for her to pray in her private chamber than in her house.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20267",
        "20297",
        "11019",
        "11308",
        "20327",
        "18"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-4288",
      "hadith_no": "4288",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Promised Deliverer (Kitab Al-Mahdi) - كتاب المهدى",
      "chapter_no": "38",
      "text_ar": "حدثنا ابن المثنى، حدثنا عمرو بن عاصم، حدثنا أبو العوام، حدثنا قتادة، عن أبي الخليل، عن عبد الله بن الحارث، عن أم سلمة، عن النبي صلى الله عليه وسلم بهذا الحديث وحديث معاذ أتم ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Umm Salamah from the Prophet (ﷺ) through a different chain of narrators. The tradition of Mu'adh is more perfect.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20267",
        "11019",
        "11291",
        "912",
        "56"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-5067",
      "hadith_no": "5067",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا هشيم، عن يعلى بن عطاء، عن عمرو بن عاصم، عن أبي هريرة، أن أبا بكر الصديق، رضى الله عنه قال يا رسول الله مرني بكلمات أقولهن إذا أصبحت وإذا أمسيت ‏.‏ قال ‏\"‏ قل اللهم فاطر السموات والأرض عالم الغيب والشهادة رب كل شىء ومليكه أشهد أن لا إله إلا أنت أعوذ بك من شر نفسي وشر الشيطان وشركه ‏\"‏ ‏.‏ قال ‏\"‏ قلها إذا أصبحت وإذا أمسيت وإذا أخذت مضجعك ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     AbuBakr as-Siddiq said: Messenger of Allah! command me something to say in the morning and in the evening. He said: Say \"O Allah, Creator of the heavens and the earth, Who knowest the unseen and the seen, Lord and Possessor of everything. I testify that there is no god but Thee; I seek refuge in Thee from the evil within myself, from the evil of the devil, and his (incitement to) attributing partners (to Allah).\" He said: Say this in the morning.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "20468",
        "10986",
        "20267",
        "13"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-423",
      "hadith_no": "423",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عقبة بن مكرم العمي البصري، حدثنا عمرو بن عاصم، حدثنا همام، عن قتادة، عن النضر بن أنس، عن بشير بن نهيك، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من لم يصل ركعتى الفجر فليصلهما بعد ما تطلع الشمس ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ وقد روي عن ابن عمر أنه فعله ‏.‏ والعمل على هذا عند بعض أهل العلم وبه يقول سفيان الثوري وابن المبارك والشافعي وأحمد وإسحاق ‏.‏ قال ولا نعلم أحدا روى هذا الحديث عن همام بهذا الإسناد نحو هذا إلا عمرو بن عاصم الكلابي ‏.‏ والمعروف من حديث قتادة عن النضر بن أنس عن بشير بن نهيك عن أبي هريرة عن النبي صلى الله عليه وسلم قال ‏\"‏ من أدرك ركعة من صلاة الصبح قبل أن تطلع الشمس فقد أدرك الصبح ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     Allah's Messenger (S) said: \"Whoever did not pray the two Rak'ah (before) Fajr then let him pray them after the sun has risen.\"",
      "usc_msa_ref": "",
      "chain": [
        "30441",
        "20267",
        "20297",
        "11019",
        "11310",
        "11266",
        "13"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-1008",
      "hadith_no": "1008",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا عمرو بن عاصم، عن همام، عن منصور، وبكر الكوفي، وزياد، وسفيان، كلهم يذكر أنه سمعه من الزهري عن سالم بن عبد الله عن أبيه قال رأيت النبي صلى الله عليه وسلم وأبا بكر وعمر يمشون أمام الجنازة ‏.‏",
      "text_en": " Salim bin Abdullah narrated that his father said:                     \"I saw the Prophet, Abu Bakr, and Umar walking in front of the funeral.\"",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20267",
        "20297",
        "11067",
        "11339",
        "20012",
        "11011",
        "18"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-1206",
      "hadith_no": "1206",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Suckling - كتاب الرضاع",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عمرو بن عاصم، حدثنا همام، عن قتادة، عن مورق، عن أبي الأحوص، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ المرأة عورة فإذا خرجت استشرفها الشيطان ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Abdullah narrated that The Prophet said:                      “The woman is Awrah, so when she goes out, the Shaitan seeks to tempt her.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20267",
        "20297",
        "11019",
        "11308",
        "20327",
        "18"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-1330",
      "hadith_no": "1330",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد القدوس بن محمد أبو بكر العطار، حدثنا عمرو بن عاصم، حدثنا عمران القطان، عن أبي إسحاق الشيباني، عن عبد الله بن أبي أوفى، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله مع القاضي ما لم يجر فإذا جار تخلى عنه ولزمه الشيطان ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث عمران القطان ‏.‏",
      "text_en": " ['Abdullah] Ibn Abi Al-Awfa narrated that the Messenger of Allah (ﷺ) said:                      \"[Indeed] Allah is with the judge as long as he is not unjust. So when he is unjust, He leaves him and he is attended by Shaitan.\"",
      "usc_msa_ref": "",
      "chain": [
        "20267",
        "20718",
        "11352",
        "5115"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-1536",
      "hadith_no": "1536",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Vows and Oaths - كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "20",
      "text_ar": "حدثنا عبد القدوس بن محمد العطار البصري، حدثنا عمرو بن عاصم، عن عمران القطان، عن حميد، عن أنس، قال نذرت امرأة أن تمشي، إلى بيت الله فسئل نبي الله صلى الله عليه وسلم عن ذلك فقال ‏\"‏ إن الله لغني عن مشيها مروها فلتركب ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وعقبة بن عامر وابن عباس ‏.‏ قال أبو عيسى حديث أنس حديث حسن صحيح غريب من هذا الوجه ‏.‏ والعمل على هذا عند بعض أهل العلم وقالوا إذا نذرت امرأة أن تمشي فلتركب ولتهد شاة ‏.‏",
      "text_en": " Narrated Anas:                     \"A Woman vowed to walk to the House of Allah, so the Prophet (ﷺ) asked about that, and he said: 'Verily Allah is in no need of her walking, order her to ride.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20267",
        "20718",
        "11279",
        "19"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2187",
      "hadith_no": "2187",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا عبد القدوس بن محمد، حدثنا عمرو بن عاصم، حدثنا همام، عن قتادة، عن الحسن، عن عمران بن حصين، قال نهينا عن الكى، ‏.‏ قال أبو عيسى وفي الباب عن ابن مسعود، وعقبة بن عامر، وابن، عباس ‏.‏ وهذا حديث حسن صحيح ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30148",
        "20267",
        "20297",
        "11019",
        "11016",
        "123",
        "16",
        "189"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2189",
      "hadith_no": "2189",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا عبد القدوس بن محمد، حدثنا عمرو بن عاصم، حدثنا همام، وجرير بن حازم، قالا حدثنا قتادة، عن أنس، قال كان رسول الله صلى الله عليه وسلم يحتجم في الأخدعين والكاهل وكان يحتجم لسبع عشرة وتسع عشرة وإحدى وعشرين ‏.‏ قال أبو عيسى وفي الباب عن ابن عباس ومعقل بن يسار ‏.‏ وهذا حديث حسن غريب ‏.‏",
      "text_en": " Anas narrated:                     \"The Prophet (S.A.W) would get cupped in his jugular veins and his upper back. And he would get cupped on the seventeenth (of the month), (or) the nineteenth, and (or) the twenty first.\"",
      "usc_msa_ref": "",
      "chain": [
        "30148",
        "20267",
        "20297",
        "11272",
        "11019",
        "19"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2254-2",
      "hadith_no": "2254",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عمرو بن عاصم، حدثنا حماد بن سلمة، عن علي بن زيد، عن الحسن، عن جندب، عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا ينبغي للمؤمن أن يذل نفسه ‏\"‏ ‏.‏ قالوا وكيف يذل نفسه ‏.‏ قال ‏\"‏ يتعرض من البلاء لما لا يطيق ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " It was narrated from Hudhaifah, that the Messenger of Allah(s.a.w) said:                     \"It is not for the believer to humiliate himself.\" They said: \"How does he humiliate himself?\" He said: \"By taking on a trial which he can not bear.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20267",
        "20021",
        "10664",
        "11016",
        "4053",
        "145"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-2757",
      "hadith_no": "2757",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا عمرو بن عاصم، أخبرنا حماد بن سلمة، عن حميد، وثابت، عن أنس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ حفت الجنة بالمكاره وحفت النار بالشهوات ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح من هذا الوجه ‏.‏",
      "text_en": " Anas narrated that the Messenger of Allah (s.a.w) said:                     \"Paradise is surrounded by hardships, and the Fire is surrounded by desires.\"",
      "usc_msa_ref": "",
      "chain": [
        "30025",
        "20267",
        "20021",
        "11279",
        "11269",
        "19"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3507",
      "hadith_no": "3507",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد القدوس بن محمد العطار البصري، حدثنا عمرو بن عاصم، عن إسحاق بن يحيى بن طلحة، عن موسى بن طلحة، قال دخلت على معاوية فقال ألا أبشرك قلت بلى ‏.‏ قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ طلحة ممن قضى نحبه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه من حديث معاوية إلا من هذا الوجه وإنما روي عن موسى بن طلحة عن أبيه ‏.‏",
      "text_en": " Narrated Musa bin Talhah:                     \"I entered upon Mu'awiyah and he said:' Shall I not give you some good news?' I said: 'Of course!' He said: 'I heard the Messenger of Allah (ﷺ) saying: 'Talhah is among those who fulfilled their vow.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20267",
        "18029",
        "579"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3561",
      "hadith_no": "3561",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا عمرو بن عاصم، حدثنا عبيد الله بن الوازع، حدثني شيخ، من بني مرة قال قدمت الكوفة فأخبرت عن بلال بن أبي بردة، فقلت إن فيه لمعتبرا فأتيته وهو محبوس في داره التي قد كان بنى قال وإذا كل شيء منه قد تغير من العذاب والضرب وإذا هو في قشاش فقلت الحمد لله يا بلال لقد رأيتك وأنت تمر بنا تمسك بأنفك من غير غبار وأنت في حالك هذا اليوم فقال ممن أنت فقلت من بني مرة بن عباد ‏.‏ فقال ألا أحدثك حديثا عسى الله أن ينفعك به قلت هات ‏.‏ قال حدثني أبي أبو بردة عن أبيه أبي موسى أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يصيب عبدا نكبة فما فوقها أو دونها إلا بذنب وما يعفو الله عنه أكثر ‏\"‏ ‏.‏ قال وقرأ ‏:‏ ‏(‏وما أصابكم من مصيبة فبما كسبت أيديكم ويعفو عن كثير ‏)‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Narrated 'Ubaidullah bin Al-Wazi':                     \"A Shaikh from Banu Murrah narrated to me, he said: 'I arrived in Al-Kufah and was informed about Bilal bin Abi Burdah so I said: \"Indeed there is a lesson in him\" so I went to him while he was imprisoned in his home, which he had built.' He said: 'After everything that had happened to him he had changed due to the punishment and the beatings, and now he was living in isolation. So I said: \"All praise is due to Allah O Bilal! I have seen you passing you by us holding your nose, and it was not from the dust! And today you are in this state.' So he said: 'Where are you from?' I said: 'From Banu Murrah bin 'Abbad.' So he said: 'Shall I not narrate a Hadith to you, perhaps Allah will benefit you by it?' I said: 'Go ahead.' He said: 'My father, Abu Burdah narrated from his father Abu Musa, that the Messenger of Allah (ﷺ) said: \"No worshiper suffers a calamity nor what is worse than that or less, except due to a sin, and what Allah pardons as a result of it is more.\" He (Abu Musa) said: \"And he recited: And whatever misfortune befalls you, it is because of what your hands have earned (42:30).\"",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20267"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3392-2",
      "hadith_no": "3392",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو داود، قال أنبأنا شعبة، عن يعلى بن عطاء، قال سمعت عمرو بن عاصم الثقفي، يحدث عن أبي هريرة، رضى الله عنه قال قال أبو بكر يا رسول الله مرني بشيء أقوله إذا أصبحت وإذا أمسيت قال ‏\"‏ قل اللهم عالم الغيب والشهادة فاطر السموات والأرض رب كل شيء ومليكه أشهد أن لا إله إلا أنت أعوذ بك من شر نفسي ومن شر الشيطان وشركه قال قله إذا أصبحت وإذا أمسيت وإذا أخذت مضجعك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah, may Allah be pleased with him, said:                     “Abu Bakr said: ‘O Messenger of Allah, command me with something that I may say when I reach morning and evening.’ He said: ‘Say: “O Allah Knower of the Unseen and the Seen, Originator of the heavens and the earth, Lord of everything and its Possessor, I bear witness that there is none worthy of worship except You, I seek refuge from You from the evil of my soul and from the evil of Shaitan and his Shirk (Allahumma `Aalimal-Ghaibi Wash-Shahadati Fatiras-Samawati Wal-Ard, Rabba Kulli Shai’in Wa Malikahu, Ash-hadu An La Ilaha Illa Anta, A’udhu Bika Min Sharri Nafsi Wa Min Sharrish-Shaitani Washirkihi).’” He said: ‘Say it when you reach morning, and evening, and when you go to bed.’”",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20547",
        "20020",
        "10986",
        "20267",
        "13"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3511-2",
      "hadith_no": "3511",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا إبراهيم بن يعقوب، حدثنا عمرو بن عاصم، حدثنا حماد بن سلمة، عن ثابت، عن عمرو بن أبي سلمة، عن أمه أم سلمة، عن أبي سلمة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا أصاب أحدكم مصيبة فليقل ‏:‏ ‏(‏ إنا لله وإنا إليه راجعون ‏)‏ اللهم عندك احتسبت مصيبتي فأجرني فيها وأبدلني منها خيرا ‏\"‏ ‏.‏ فلما احتضر أبو سلمة قال اللهم اخلف في أهلي خيرا مني فلما قبض قالت أم سلمة ‏:‏ ‏(‏ إنا لله وإنا إليه راجعون ‏)‏ عند الله احتسبت مصيبتي فأجرني فيها ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏ وروي هذا الحديث من غير هذا الوجه عن أم سلمة عن النبي صلى الله عليه وسلم وأبو سلمة اسمه عبد الله بن عبد الأسد ‏.‏",
      "text_en": " Umar bin Abu Salamah narrated from his mother, Umm Salamah, that the Messenger of Allah said:                     “When a calamity strikes one of you, then let him say: ‘Indeed, to Allah we belong and to Him we shall return. O Allah, I seek reward with You for my affliction, so reward me for it, and replace it for me with something better (Inna Lillahi Wa Inna Ilaihi Raji’un, Allahumma Indaka Ahtasibu Musibati Fa’jurni Fiha Wa Abdilni Minha Khair).’” When the time of death was near Abu Salamah, he said: ‘O Allah, replace me for my wife, with better than me.” So when he died, Umm Salamah said: “Indeed, to Allah we belong and to Him we shall return. I seek reward with  allah for my affliction, so reward me for it.”",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20267",
        "20021",
        "11269",
        "30286",
        "56",
        "10567"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-4105",
      "hadith_no": "4105",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا عبد القدوس بن محمد العطار البصري، حدثنا عمرو بن عاصم، عن إسحاق بن يحيى بن طلحة، عن عمه، موسى بن طلحة قال دخلت على معاوية فقال ألا أبشرك سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ طلحة ممن قضى نحبه ‏\"‏ ‏.‏ قال هذا حديث غريب لا نعرفه من حديث معاوية إلا من هذا الوجه ‏.‏",
      "text_en": " Narrated Musa bin Talhah:                     \"I entered upon Mu'awiyah and he said: 'Shall I not give you some good news?' I said: 'Of course!' He said: 'I heard the Messenger of Allah (ﷺ) saying: 'Talhah is among those fulfilled their vow (referring to 33:23).'\"",
      "usc_msa_ref": "",
      "chain": [
        "20267",
        "18029",
        "579"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-1486",
      "hadith_no": "1486",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "وأخبرنا إبراهيم بن يعقوب، قال حدثنا عمرو بن عاصم، أن جده، عبيد الله بن الوازع حدثه قال حدثنا أيوب السختياني، عن أبي قلابة، عن قبيصة بن مخارق الهلالي، قال كسفت الشمس ونحن إذ ذاك مع رسول الله صلى الله عليه وسلم بالمدينة فخرج فزعا يجر ثوبه فصلى ركعتين أطالهما فوافق انصرافه انجلاء الشمس فحمد الله وأثنى عليه ثم قال ‏\"‏ إن الشمس والقمر آيتان من آيات الله وإنهما لا ينكسفان لموت أحد ولا لحياته فإذا رأيتم من ذلك شيئا فصلوا كأحدث صلاة مكتوبة صليتموها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Qabisah bin Mukhariq Al-Hilali said:                     \"There was an eclipse of the sun and at the time we were with the Messenger of Allah (ﷺ) in Al-Madinah. He rushed out dragging his garment and prayed two rak'ahs, which he made lengthy. The end of his prayer coincided with the end of the eclipse. He praised and glorified Allah (SWT), then he said: 'The sun and the moon are two of the signs of Allah (SWT), and they do not become eclipsed for the death or birth of anyone. If you see anything of that, then pray like the last obligatory prayer you did before that.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20267",
        "11015",
        "11047"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1552",
      "hadith_no": "1552",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "18",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا عمرو بن عاصم، قال حدثنا حماد بن سلمة، عن قتادة، عن الحسن، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم صلى بطائفة من أصحابه ركعتين ثم سلم ثم صلى بآخرين أيضا ركعتين ثم سلم ‏.‏",
      "text_en": " It was narrated from Jabir bin 'Abdullah that:                     The Prophet (ﷺ) led a group of his companions in praying two rak'ahs, then he said the taslim, then he led some others in praying two rak'ahs, then he said the taslim.",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20267",
        "20021",
        "11019",
        "11016",
        "34"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3094",
      "hadith_no": "3094",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا عمرو بن عاصم، قال حدثنا عمران أبو العوام القطان، قال حدثنا معمر، عن الزهري، عن أنس بن مالك، قال لما توفي رسول الله صلى الله عليه وسلم ارتدت العرب قال عمر يا أبا بكر كيف تقاتل العرب فقال أبو بكر رضي الله عنه إنما قال رسول الله صلى الله عليه وسلم ‏\"‏ أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأني رسول الله ويقيموا الصلاة ويؤتوا الزكاة ‏\"‏ ‏.‏ والله لو منعوني عناقا مما كانوا يعطون رسول الله صلى الله عليه وسلم لقاتلتهم عليه ‏.‏ قال عمر رضى الله عنه فلما رأيت رأى أبي بكر قد شرح علمت أنه الحق ‏.‏ قال أبو عبد الرحمن عمران القطان ليس بالقوي في الحديث وهذا الحديث خطأ والذي قبله الصواب حديث الزهري عن عبيد الله بن عبد الله بن عتبة عن أبي هريرة ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                      \"When the Messenger of Allah (ﷺ) died, some of the 'Arabs apostatized. 'Umar said: 'O Abu Bakr, how can you fight the 'Arabs? Abu Bakr said: 'The Messenger of Allah (ﷺ) said: I have been commanded to fight the people until they testify that La ilaha illallah (there is none worthy of worship except Allah) and that I am the Messenger of Allah, and establish prayer and pay Zakah?' By Allah, if they withhold from me a small she-goat that they used to give to the Messenger of Allah (ﷺ) I will fight them for withholding it.' ('Umar siad) 'By Allah, when I realized that (Abu) Bakr was confident about this idea, then I knew that this was teh truth.'\"Abu 'Abdur-Rahman (An-Nasa'i) said: 'Imran Al Qattan is not strong in Hadith, and this narration is a mistake. The one that is before it is the correct narration of Az-Zuhri, from 'Ubaidullah bin 'Abdullah bin 'Utbah, from Abu Hurairah.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20267",
        "20115",
        "11013",
        "19"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3969",
      "hadith_no": "3969",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا عمرو بن عاصم، قال حدثنا عمران أبو العوام، قال حدثنا معمر، عن الزهري، عن أنس بن مالك، قال لما توفي رسول الله صلى الله عليه وسلم ارتدت العرب فقال عمر يا أبا بكر كيف تقاتل العرب فقال أبو بكر إنما قال رسول الله صلى الله عليه وسلم ‏\"‏ أمرت أن أقاتل الناس حتى يشهدوا أن لا إله إلا الله وأني رسول الله ويقيموا الصلاة ويؤتوا الزكاة ‏\"‏ ‏.‏ والله لو منعوني عناقا مما كانوا يعطون رسول الله صلى الله عليه وسلم لقاتلتهم عليه ‏.‏ قال عمر فلما رأيت رأى أبي بكر قد شرح علمت أنه الحق ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"When the Messenger of Allah [SAW] died, the 'Arabs apostatized, so 'Umar said: 'O Abu Bakr, how can you fight the 'Arabs?' Abu Bakr said: 'The Messenger of Allah [SAW] said: \"I have been commanded to fight the people until they bear witness to La ilaha illallah (there is none worthy of worship except Allah) and that I am the Messenger of Allah, and they establish Salah and pay Zakah.\" By Allah, if they withhold from me a young goat that they used to give to the Messenger of Allah [SAW], I will fight them for it.' 'Umar said: 'By Allah, as soon as I realized how certain Abu Bakr was, I knew that it was the truth.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20267",
        "20115",
        "11013",
        "19"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3997",
      "hadith_no": "3997",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا إبراهيم بن المستمر، قال حدثنا عمرو بن عاصم، قال حدثنا معتمر، عن أبيه، عن الأعمش، عن شقيق بن سلمة، عن عمرو بن شرحبيل، عن عبد الله بن مسعود، عن النبي صلى الله عليه وسلم قال ‏\"‏ يجيء الرجل آخذا بيد الرجل فيقول يا رب هذا قتلني ‏.‏ فيقول الله له لم قتلته فيقول قتلته لتكون العزة لك ‏.‏ فيقول فإنها لي ‏.‏ ويجيء الرجل آخذا بيد الرجل فيقول إن هذا قتلني ‏.‏ فيقول الله له لم قتلته فيقول لتكون العزة لفلان فيقول إنها ليست لفلان فيبوء بإثمه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Mas'ud that:                     The Prophet [SAW] said: \"A man will come, holding another man's hand, and will say: 'O Lord, this man killed me.' Allah will say to him: 'Why did you kill him?' He will say: 'I killed him so that the glory would be to you.' He will say: 'It is to Me.' Then (another) man will come holding another man's hand, and will say: 'This man killed me.' Allah will say to him: 'Why did you kill him?' He will say: 'So that the glory would be to so and so.' He will say: 'It is not to so and so,' and the burden of sin will be upon him.\"",
      "usc_msa_ref": "",
      "chain": [
        "34023",
        "20267",
        "20288",
        "11289",
        "11060",
        "11353",
        "11644",
        "16"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4564",
      "hadith_no": "4564",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن المثنى، ويعقوب بن إبراهيم، قالا حدثنا عمرو بن عاصم، قال حدثنا همام، قال حدثنا قتادة، عن أبي الخليل، عن مسلم المكي، عن أبي الأشعث الصنعاني، عن عبادة بن الصامت، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الذهب بالذهب تبره وعينه وزنا بوزن والفضة بالفضة تبره وعينه وزنا بوزن والملح بالملح والتمر بالتمر والبر بالبر والشعير بالشعير سواء بسواء مثلا بمثل فمن زاد أو ازداد فقد أربى ‏\"‏ ‏.‏ واللفظ لمحمد لم يذكر يعقوب ‏\"‏ والشعير بالشعير ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ubadah bin As-Samit said:                     \"The messenger of Allah said: 'Gold for gold, of equal measure; silver for silver, of equal measure; salt for salt, dates for dates wheat for wheat, barley for barley, like for like. Whoever gives more or  takes more has engaged in Riba.\"' (Sahih)The wording is that of Muhammad Yaqub did not mention - \"Wheat for wheat\".",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20184",
        "20267",
        "11447",
        "11019",
        "11291",
        "13118",
        "10917",
        "40"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5374",
      "hadith_no": "5374",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أبو داود، قال حدثنا عمرو بن عاصم، قال حدثنا همام، وجرير، قالا حدثنا قتادة، عن أنس، قال كان نعل سيف رسول الله صلى الله عليه وسلم من فضة وقبيعة سيفه فضة وما بين ذلك حلق فضة ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"The metallic end of the scabbard of the Messenger of Allah [SAW] was of silver, the pommel of his sword was silver, and in between were rings of silver.\"",
      "usc_msa_ref": "",
      "chain": [
        "30002",
        "20267",
        "20297",
        "20028",
        "11019",
        "19"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-1704",
      "hadith_no": "1704",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا عمرو بن عاصم، حدثنا سليمان بن المغيرة، عن ثابت، عن أنس، قال قال أبو بكر بعد وفاة رسول الله  صلى الله عليه وسلم  لعمر انطلق بنا إلى أم أيمن نزورها كما كان رسول الله  صلى الله عليه وسلم  يزورها ‏.‏ قال فلما انتهينا إليها بكت فقالا لها ما يبكيك فما عند الله خير لرسوله ‏.‏ قالت إني لأعلم أن ما عند الله خير لرسوله ولكن أبكي أن الوحى قد انقطع من السماء ‏.‏ قال فهيجتهما على البكاء فجعلا يبكيان معها ‏.‏",
      "text_en": " It wasnarrated that Anas said:                      “After the Messenger of Allah (ﷺ)haddied, Abu Bakr said to ‘Umar: ‘Let us go and visit Umm Ayman asthe Messenger of Allah (ﷺ) used to visit her.’ He said: ‘Whenwereached her she wept.’ They said: ‘Why are you weeping? Whatis withAllah is better for His Messenger.’ She said: ‘I knowthat what iswith Allah is better for His Messenger, but I am weepingbecause theRevelation from heaven has ceased.’ She moved them totears and theystarted to weep with her.”",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20267",
        "20236",
        "11269",
        "19"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-2774",
      "hadith_no": "2774",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن عبد الله بن عبيد بن عقيل، حدثنا عمرو بن عاصم، حدثنا أبو العوام القطان، عن محمد بن جحادة، عن زياد بن علاقة، عن أسامة بن شريك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تجني نفس على أخرى ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Usamah bin Sharik that the Messenger of Allah (ﷺ) said:                     “No person will be punished because of another's crime.”",
      "usc_msa_ref": "",
      "chain": [
        "34214",
        "20267",
        "18897",
        "11339",
        "4000"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-4152",
      "hadith_no": "4152",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عمرو بن عاصم، حدثنا حماد بن سلمة، عن علي بن زيد، عن الحسن، عن جندب، عن حذيفة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا ينبغي للمؤمن أن يذل نفسه ‏\"‏ ‏.‏ قالوا وكيف يذل نفسه قال ‏\"‏ يتعرض من البلاء لما لا يطيقه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hudhaifah that the Messenger of Allah (ﷺ)said:                      “The believer should not humiliate himself.” They said:“Howcould he humiliate himself?” He said: “By taking on atrial that hecannot deal with.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20267",
        "20021",
        "10664",
        "11016",
        "4053",
        "145"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 43,
  "grade_display": {
    "en": "Successor (Taba' Tabi') [9th Generation]",
    "ar": "تابع التابعين [الجيل التاسع]",
    "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
  }
}