{
  "id": "20278",
  "name": "Muhammad bin Ja'far Ghandar محمد بن جعفر غندر صاحب الكرابيس",
  "full_name": "Muhammad bin Ja'far Ghandar محمد بن جعفر غندر صاحب الكرابيس",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "194",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Hadhli",
      "Client",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11184",
      "name": "'Abdullah bin Sa'id bin Abi Hind عبد الله بن سعيد بن أبي هند",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11298",
      "name": "'Awf bin Abi Jamila al-A'rabi عوف بن أبي جميلة الأعرابي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20115",
      "name": "Ma'mar bin Rashid معمر بن راشد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11073",
      "name": "Sa'id bin Abi 'Aruba سعيد بن أبي عروبة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11278",
      "name": "al-Husain bin Dhakwan al-Mua'lam الحسين بن ذكوان المعلم المكتب",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11311",
      "name": "Hisham bin Hassan al-Azdi هشام بن حسان الأزدي القردوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11600",
      "name": "'Uthman bin Ghyath عثمان بن غياث",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30426",
      "name": "Ibrahim bin Muhammad bin 'Ar'ara إبراهيم بن محمد بن عرعرة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30357",
      "name": "'Abdur Rahman bin 'Abdul Malik bin Shayb عبد الرحمن بن عبد الملك بن شيبة",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30400",
      "name": "Y'aqub bin Ibrahim bin Kathir يعقوب بن إبراهيم بن كثير بن زيد الدورقي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30024",
      "name": "'Ubaidullah bin 'Umar al-Qawariri عبيد الله بن عمر القواريري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30164",
      "name": "Muhammad bin Ziyad - Yu'Yu' محمد بن زياد - يؤيؤ",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30160",
      "name": "Muhammad bin Bashar Bindar محمد بن بشار بندار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30452",
      "name": "Muhammad bin 'Amr bin 'Ubada bin Jabla محمد بن عمرو بن عبادة بن جبلة",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30126",
      "name": "Bashr bin Khalid al-'Askary بشر بن خالد العسكري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30441",
      "name": "'Uqba bin Mukaram bin Aflah al-''Ami عقبة بن مكرم",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "32",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا شعبة، ح‏.‏ قال وحدثني بشر، قال حدثنا محمد، عن شعبة، عن سليمان، عن إبراهيم، عن علقمة، عن عبد الله، قال لما نزلت ‏{‏الذين آمنوا ولم يلبسوا إيمانهم بظلم‏}‏ قال أصحاب رسول الله صلى الله عليه وسلم أينا لم يظلم فأنزل الله ‏{‏إن الشرك لظلم عظيم‏}‏‏.‏",
      "text_en": "      Narrated 'Abdullah:                          When the following Verse was revealed: \"It is those who believe and      confuse not their belief with wrong (worshipping others besides      Allah.)\" (6:83), the companions of Allah's Apostle asked, \"Who is      amongst us who had not done injustice (wrong)?\" Allah revealed: \"No      doubt, joining others in worship with Allah is a great injustice      (wrong) indeed.\" (31.13)",
      "chain": [
        "20296",
        "20020",
        "20212",
        "20278",
        "20020",
        "11005",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "87",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا غندر، قال حدثنا شعبة، عن أبي جمرة، قال كنت أترجم بين ابن عباس وبين الناس فقال إن وفد عبد القيس أتوا النبي صلى الله عليه وسلم فقال ‏\"‏ من الوفد  أو من القوم ‏\"‏‏.‏ قالوا ربيعة‏.‏ فقال ‏\"‏ مرحبا بالقوم  أو بالوفد  غير خزايا ولا ندامى ‏\"‏‏.‏ قالوا إنا نأتيك من شقة بعيدة، وبيننا وبينك هذا الحى من كفار مضر، ولا نستطيع أن نأتيك إلا في شهر حرام فمرنا بأمر نخبر به من وراءنا، ندخل به الجنة‏.‏ فأمرهم بأربع، ونهاهم عن أربع أمرهم بالإيمان بالله عز وجل وحده‏.‏ قال ‏\"‏ هل تدرون ما الإيمان بالله وحده ‏\"‏‏.‏ قالوا الله ورسوله أعلم‏.‏ قال ‏\"‏ شهادة أن لا إله إلا الله وأن محمدا رسول الله، وإقام الصلاة، وإيتاء الزكاة، وصوم رمضان، وتعطوا الخمس من المغنم ‏\"‏‏.‏ ونهاهم عن الدباء والحنتم والمزفت‏.‏ قال شعبة ربما قال النقير، وربما قال المقير‏.‏ قال ‏\"‏ احفظوه وأخبروه من وراءكم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Jamra:                     I was an interpreter between the people and Ibn `Abbas. Once Ibn `Abbas said that a delegation of the tribe of `Abdul Qais came to the Prophet who asked them, \"Who are the people (i.e. you)? (Or) who are the delegates?\" They replied, \"We are from the tribe of Rabi`a.\" Then the Prophet said to them, \"Welcome, O people (or said, \"O delegation (of `Abdul Qais).\") Neither will you have disgrace nor will you regret.\" They said, \"We have come to you from a distant place and there is the tribe of the infidels of Mudar intervening between you and us and we cannot come to you except in the sacred month. So please order us to do something good (religious deeds) and that we may also inform our people whom we have left behind (at home) and that we may enter Paradise (by acting on them.)\" The Prophet ordered them to do four things, and forbade them from four things. He ordered them to believe in Allah Alone, the Honorable the Majestic and said to them, \"Do you know what is meant by believing in Allah Alone?\" They replied, \"Allah and His Apostle know better.\" Thereupon the Prophet said, \"(That means to testify that none has the right to be worshipped but Allah and that Muhammad is His Apostle, to offer prayers perfectly, to pay Zakat, to observe fasts during the month of Ramadan, (and) to pay Al-Khumus (one fifth of the booty to be given in Allah's cause).\" Then he forbade them four things, namely Ad-Dubba.' Hantam, Muzaffat (and) An-Naqir or Muqaiyar (These were the names of pots in which alcoholic drinks used to be prepared). The Prophet further said, \"Memorize them (these instructions) and tell them to the people whom you have left behind.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11309"
      ]
    },
    {
      "hadith_no": "102",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا غندر، قال حدثنا شعبة، عن عبد الرحمن بن الأصبهاني، عن ذكوان، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم بهذا‏.‏ وعن عبد الرحمن بن الأصبهاني، قال سمعت أبا حازم، عن أبي هريرة، قال ‏\"‏ ثلاثة لم يبلغوا الحنث ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     as above (the sub narrators are different). Abu Huraira qualified the three children referred to in the above mentioned Hadith as not having reached the age of committing sins (i.e. age of puberty) .",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11364",
        "11161",
        "38"
      ]
    },
    {
      "hadith_no": "255",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا غندر، قال حدثنا شعبة، عن مخول بن راشد، عن محمد بن علي، عن جابر بن عبد الله، قال كان النبي صلى الله عليه وسلم يفرغ على رأسه ثلاثا‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet used to pour water three times on his head.",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11390",
        "11442",
        "34"
      ]
    },
    {
      "hadith_no": "326",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا قتيبة بن سعيد، قال حدثنا إسماعيل، عن أيوب، عن محمد، عن أم عطية، قالت كنا لا نعد الكدرة والصفرة شيئا‏.‏",
      "text_en": " Narrated Um `Atiya:                     We never considered yellowish discharge as a thing of importance (as menses).",
      "chain": [
        "30367",
        "20208",
        "11015",
        "20278",
        "71"
      ]
    },
    {
      "hadith_no": "343",
      "source": " Sahih Bukhari ",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا غندر، حدثنا شعبة، عن الحكم، عن ذر، عن ابن عبد الرحمن بن أبزى، عن أبيه، قال قال عمار فضرب النبي صلى الله عليه وسلم بيده الأرض، فمسح وجهه وكفيه‏.‏",
      "text_en": " Narrated `Ammar:                     The Prophet stroked the earth with his hands and then passed them over his face and the backs of his hands (while demonstrating Tayammum).",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11069",
        "11423",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "345",
      "source": " Sahih Bukhari ",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا بشر بن خالد، قال حدثنا محمد  هو غندر  عن شعبة، عن سليمان، عن أبي وائل، قال قال أبو موسى لعبد الله بن مسعود إذا لم يجد الماء لا يصلي‏.‏ قال عبد الله لو رخصت لهم في هذا، كان إذا وجد أحدهم البرد قال هكذا  يعني تيمم وصلى  قال قلت فأين قول عمار لعمر قال إني لم أر عمر قنع بقول عمار‏.‏",
      "text_en": " Narrated Abu Wail:                     Abu Musa said to `Abdullah bin Mas`ud, \"If one does not find water (for ablution) can he give up the prayer?\" `Abdullah replied, \"If you give the permission to perform Tayammum they will perform Tayammum even if water was available if one of them found it cold.\" Abu Musa said, \"What about the statement of `Ammar to `Umar?\" `Abdullah replied, \"`Umar was not satisfied by his statement.\"",
      "chain": [
        "30126",
        "20278",
        "20020",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "351",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا يزيد بن إبراهيم، عن محمد، عن أم عطية، قالت أمرنا أن نخرج، الحيض يوم العيدين وذوات الخدور، فيشهدن جماعة المسلمين ودعوتهم، ويعتزل الحيض عن مصلاهن‏.‏ قالت امرأة يا رسول الله، إحدانا ليس لها جلباب‏.‏ قال ‏\"‏ لتلبسها صاحبتها من جلبابها ‏\"‏‏.‏ وقال عبد الله بن رجاء حدثنا عمران، حدثنا محمد بن سيرين، حدثتنا أم عطية، سمعت النبي صلى الله عليه وسلم بهذا‏.‏",
      "text_en": " Narrated Um `Atiya:                     We were ordered to bring out our menstruating women and veiled women in the religious gatherings and invocation of Muslims on the two `Id festivals. These menstruating women were to keep away from their Musalla. A woman asked, \"O Allah's Apostle ' What about one who does not have a veil?\" He said, \"Let her share the veil of her companion.\"",
      "chain": [
        "20040",
        "20303",
        "20278",
        "71"
      ]
    },
    {
      "hadith_no": "365",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا حماد بن زيد، عن أيوب، عن محمد، عن أبي هريرة، قال قام رجل إلى النبي صلى الله عليه وسلم فسأله عن الصلاة في الثوب الواحد فقال ‏\"‏ أوكلكم يجد ثوبين ‏\"‏‏.‏ ثم سأل رجل عمر فقال إذا وسع الله فأوسعوا، جمع رجل عليه ثيابه، صلى رجل في إزار ورداء، في إزار وقميص، في إزار وقباء، في سراويل ورداء، في سراويل وقميص، في سراويل وقباء، في تبان وقباء، في تبان وقميص  قال وأحسبه قال  في تبان ورداء‏.‏",
      "text_en": " Narrated Abu Huraira:                     A man stood up and asked the Prophet about praying in a single garment. The Prophet said, \"Has every one of you two garments?\" A man put a similar question to `Umar on which he replied, \"When Allah makes you wealthier then you should clothe yourself properly during prayers. Otherwise one can pray with an Izar and a Rida' (a sheet covering the upper part of the body.) Izar and a shirt, Izar and a Qaba', trousers and a Rida, trousers and a shirt or trousers and a Qaba', Tubban and a Qaba' or Tubban and a shirt.\" (The narrator added, \"I think that he also said a Tubban and a Rida. \")",
      "chain": [
        "20193",
        "20022",
        "11015",
        "20278",
        "13"
      ]
    },
    {
      "hadith_no": "535",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا ابن بشار، قال حدثنا غندر، قال حدثنا شعبة، عن المهاجر أبي الحسن، سمع زيد بن وهب، عن أبي ذر، قال أذن مؤذن النبي صلى الله عليه وسلم الظهر فقال ‏\"‏ أبرد أبرد  أو قال  انتظر انتظر ‏\"‏‏.‏ وقال ‏\"‏ شدة الحر من فيح جهنم، فإذا اشتد الحر فأبردوا عن الصلاة ‏\"‏‏.‏ حتى رأينا فىء التلول‏.‏",
      "text_en": " Narrated Abu Dhar:                     The Mu'adh-dhin (call-maker) of the Prophet pronounced the Adhan (call) for the Zuhr prayer but the Prophet said, \"Let it be cooler, let it be cooler.\" Or said, 'Wait, wait, because the severity of heat is from the raging of the Hell-fire. In severe hot weather, pray when it becomes (a bit) cooler and the shadows of hillocks appear.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11657",
        "11341",
        "23"
      ]
    },
    {
      "hadith_no": "587",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن أبان، قال حدثنا غندر، قال حدثنا شعبة، عن أبي التياح، قال سمعت حمران بن أبان، يحدث عن معاوية، قال إنكم لتصلون صلاة، لقد صحبنا رسول الله صلى الله عليه وسلم فما رأيناه يصليها، ولقد نهى عنهما، يعني الركعتين بعد العصر‏.‏",
      "text_en": " Narrated Muawiya:                     You offer a prayer which I did not see being offered by Allah's Apostle when we were in his company and he certainly had forbidden it (i.e. two rak`at after the `Asr prayer).",
      "chain": [
        "30369",
        "20278",
        "20020",
        "11317",
        "11421",
        "27"
      ]
    },
    {
      "hadith_no": "625",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا غندر، قال حدثنا شعبة، قال سمعت عمرو بن عامر الأنصاري، عن أنس بن مالك، قال كان المؤذن إذا أذن قام ناس من أصحاب النبي صلى الله عليه وسلم يبتدرون السواري حتى يخرج النبي صلى الله عليه وسلم وهم كذلك يصلون الركعتين قبل المغرب، ولم يكن بين الأذان والإقامة شىء‏.‏ قال عثمان بن جبلة وأبو داود عن شعبة لم يكن بينهما إلا قليل‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"When the Mu'adh-dhin pronounced the Adhan, some of the companions of the Prophet would proceed to the pillars of the mosque (for the prayer) till the Prophet arrived and in this way they used to pray two rak`at before the Maghrib prayer. There used to be a little time between the Adhan and the Iqama.\" Shu`ba said, \"There used to be a very short interval between the two (Adhan and Iqama).",
      "chain": [
        "30160",
        "20278",
        "20020",
        "15406",
        "19"
      ]
    },
    {
      "hadith_no": "696",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن أبان، حدثنا غندر، عن شعبة، عن أبي التياح، أنه سمع أنس بن مالك، قال النبي صلى الله عليه وسلم لأبي ذر ‏\"‏ اسمع وأطع، ولو لحبشي كأن رأسه زبيبة ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said to Abu-Dhar, \"Listen and obey (your chief) even if he is an Ethiopian with a head like a raisin.\"",
      "chain": [
        "30369",
        "20278",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "701",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "وحدثني محمد بن بشار، قال حدثنا غندر، قال حدثنا شعبة، عن عمرو، قال سمعت جابر بن عبد الله، قال كان معاذ بن جبل يصلي مع النبي صلى الله عليه وسلم ثم يرجع فيؤم قومه، فصلى العشاء فقرأ بالبقرة، فانصرف الرجل، فكأن معاذا تناول منه، فبلغ النبي صلى الله عليه وسلم فقال ‏\"‏ فتان فتان فتان ‏\"‏ ثلاث مرار أو قال ‏\"‏ فاتنا فاتنا فاتن ‏\"‏ وأمره بسورتين من أوسط المفصل‏.‏ قال عمرو لا أحفظهما‏.‏",
      "text_en": " Narrated `Amr:                     Jabir bin `Abdullah said, \"Mu`adh bin Jabal used to pray with the Prophet and then go to lead his people in prayer Once he led the `Isha' prayer and recited Surat \"Al-Baqara.\" Somebody left the prayer and Mu`adh criticized him. The news reached the Prophet and he said to Mu`adh, 'You are putting the people to trial,' and repeated it thrice (or said something similar) and ordered him to recite two medium Suras of Mufassal.\" (`Amr said that he had forgotten the names of those Suras).",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11439",
        "34"
      ]
    },
    {
      "hadith_no": "742",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا غندر، قال حدثنا شعبة، قال سمعت قتادة، عن أنس بن مالك، عن النبي صلى الله عليه وسلم قال ‏\"‏ أقيموا الركوع والسجود، فوالله إني لأراكم من بعدي  وربما قال من بعد ظهري  إذا ركعتم وسجدتم ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"Perform the bowing and the prostrations properly. By Allah, I see you from behind me (or from behind my back) when you bow or prostrate.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "857",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا ابن المثنى، قال حدثني غندر، قال حدثنا شعبة، قال سمعت سليمان الشيباني، قال سمعت الشعبي، قال أخبرني من، مر مع النبي صلى الله عليه وسلم على قبر منبوذ، فأمهم وصفوا عليه‏.‏ فقلت يا أبا عمرو من حدثك فقال ابن عباس‏.‏",
      "text_en": " Narrated Sulaiman Ash-Shaibani:                     I heard Ash-Shu`bi saying, \"A person who was accompanying the Prophet passed by a grave that was separated from the other graves told me that the Prophet once led the people in the (funeral) prayer and the people had aligned behind him. I said, \"O Aba `Amr! Who told you about it?\" He said, \"Ibn `Abbas.\"",
      "chain": [
        "20278",
        "20020",
        "11352",
        "11052"
      ]
    },
    {
      "hadith_no": "954",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا مسدد، قال حدثنا إسماعيل، عن أيوب، عن محمد، عن أنس، قال قال النبي صلى الله عليه وسلم ‏\"‏ من ذبح قبل الصلاة فليعد ‏\"‏‏.‏ فقام رجل فقال هذا يوم يشتهى فيه اللحم‏.‏ وذكر من جيرانه فكأن النبي صلى الله عليه وسلم صدقه، قال وعندي جذعة أحب إلى من شاتى لحم، فرخص له النبي صلى الله عليه وسلم فلا أدري أبلغت الرخصة من سواه أم لا‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"Whoever slaughtered (his sacrifice) before the `Id prayer, should slaughter again.\" A man stood up and said, \"This is the day on which one has desire for meat,\" and he mentioned something about his neighbors. It seemed that the Prophet I believed him. Then the same man added, \"I have a young she-goat which is dearer to me than the meat of two sheep.\" The Prophet permitted him to slaughter it as a sacrifice. I do not know whether that permission was valid only for him or for others as well.",
      "chain": [
        "30175",
        "20208",
        "11015",
        "20278",
        "19"
      ]
    },
    {
      "hadith_no": "974",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، قال حدثنا حماد، عن أيوب، عن محمد، عن أم عطية، قالت أمرنا أن نخرج، العواتق وذوات الخدور‏.‏ وعن أيوب عن حفصة بنحوه‏.‏ وزاد في حديث حفصة قال أو قالت العواتق وذوات الخدور، ويعتزلن الحيض المصلى‏.‏",
      "text_en": " Narrated Muhammad:                     Um 'Atiyya said: \"Our Prophet ordered us to come out (on `Id day) with the mature girls and the virgins staying in seclusion.\" Hafsa narrated the above mentioned Hadith and added, \"The mature girls or virgins staying in seclusion but the menstruating women had to keep away from the Musalla.\"",
      "chain": [
        "30143",
        "20022",
        "11015",
        "20278",
        "71",
        "11015"
      ]
    },
    {
      "hadith_no": "984",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا حامد بن عمر، عن حماد بن زيد، عن أيوب، عن محمد، أن أنس بن مالك، قال إن رسول الله صلى الله عليه وسلم صلى يوم النحر، ثم خطب فأمر من ذبح قبل الصلاة أن يعيد ذبحه فقام رجل من الأنصار فقال يا رسول الله، جيران لي  إما قال بهم خصاصة، وإما قال بهم فقر  وإني ذبحت قبل الصلاة وعندي عناق لي أحب إلى من شاتى لحم‏.‏ فرخص له فيها‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle offered the prayer on the day of Nahr and then delivered the Khutba and ordered that whoever had slaughtered his sacrifice before the prayer should repeat it, that is, should slaughter another sacrifice. Then a person from the Ansar stood up and said, \"O Allah's Apostle! because of my neighbors (he described them as being very needy or poor) I slaughtered before the prayer. I have a young she-goat which, in my opinion, is better than two sheep.\" The Prophet gave him the permission for slaughtering it as a sacrifice.",
      "chain": [
        "30128",
        "20022",
        "11015",
        "20278",
        "19"
      ]
    },
    {
      "hadith_no": "1001",
      "source": " Sahih Bukhari ",
      "chapter": "Witr Prayer - كتاب الوتر",
      "chapter_no": "14",
      "text_ar": "حدثنا مسدد، قال حدثنا حماد بن زيد، عن أيوب، عن محمد، قال سئل أنس أقنت النبي صلى الله عليه وسلم في الصبح قال نعم‏.‏ فقيل له أوقنت قبل الركوع قال بعد الركوع يسيرا‏.‏",
      "text_en": " Narrated Muhammad bin Seereen:                     Anas was asked, \"Did the Prophet recite Qunut in the Fajr prayer?\" Anas replied in the affirmative. He was further asked, \"Did he recite Qunut before bowing?\" Anas replied, \"He recited Qunut after bowing for some time (for one month).\"",
      "chain": [
        "30175",
        "20022",
        "11015",
        "20278"
      ]
    },
    {
      "hadith_no": "1067",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا محمد بن بشار، قال حدثنا غندر، قال حدثنا شعبة، عن أبي إسحاق، قال سمعت الأسود، عن عبد الله  رضى الله عنه  قال قرأ النبي صلى الله عليه وسلم النجم بمكة فسجد فيها، وسجد من معه، غير شيخ أخذ كفا من حصى أو تراب فرفعه إلى جبهته وقال يكفيني هذا‏.‏ فرأيته بعد ذلك قتل كافرا‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     The Prophet recited Suratan-Najm (103) at Mecca and prostrated while reciting it and those who were with him did the same except an old man who took a handful of small stones or earth and lifted it to his forehead and said, \"This is sufficient for me.\" Later on, I saw him killed as a non-believer.",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11049",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "1214",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد، حدثنا غندر، حدثنا شعبة، قال سمعت قتادة، عن أنس  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا كان في الصلاة فإنه يناجي ربه، فلا يبزقن بين يديه ولا عن يمينه، ولكن عن شماله تحت قدمه اليسرى ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"Whenever anyone of you is in prayer, he is speaking in private to his Lord and so he should neither spit in front of him nor on his right side but to his left side under his left foot.\"",
      "chain": [
        "30213",
        "20278",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1219",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد، عن أيوب، عن محمد، عن أبي هريرة  رضى الله عنه  قال نهي عن الخصر، في الصلاة‏.‏ وقال هشام وأبو هلال عن ابن سيرين، عن أبي هريرة، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     It was forbidden to keep the hands on the hips during the prayer. (This is narrated by Abu Huraira from the Prophet.)",
      "chain": [
        "20283",
        "20022",
        "11015",
        "20278",
        "13"
      ]
    },
    {
      "hadith_no": "1220",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا عمرو بن علي، حدثنا يحيى، حدثنا هشام، حدثنا محمد، عن أبي هريرة، رضى الله عنه قال نهي أن يصلي الرجل مختصرا‏.‏",
      "text_en": " Narrated Abu Huraira:                     It was forbidden to pray with the hands over one's hips.",
      "chain": [
        "30153",
        "20031",
        "11065",
        "20278",
        "13"
      ]
    },
    {
      "hadith_no": "1229",
      "source": " Sahih Bukhari ",
      "chapter": "Forgetfulness in Prayer - كتاب السهو",
      "chapter_no": "22",
      "text_ar": "حدثنا حفص بن عمر، حدثنا يزيد بن إبراهيم، عن محمد، عن أبي هريرة  رضى الله عنه  قال صلى النبي صلى الله عليه وسلم إحدى صلاتى العشي  قال محمد وأكثر ظني العصر  ركعتين ثم سلم ثم قام إلى خشبة في مقدم المسجد فوضع يده عليها وفيهم أبو بكر وعمر  رضى الله عنهما  فهابا أن يكلماه وخرج سرعان الناس فقالوا أقصرت الصلاة ورجل يدعوه النبي صلى الله عليه وسلم ذو اليدين فقال أنسيت أم قصرت فقال ‏\"‏ لم أنس ولم تقصر ‏\"‏‏.‏ قال بلى قد نسيت‏.‏ فصلى ركعتين ثم سلم ثم كبر فسجد مثل سجوده أو أطول، ثم رفع رأسه فكبر، ثم وضع رأسه فكبر فسجد مثل سجوده أو أطول، ثم رفع رأسه وكبر‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet offered one of the evening prayers (the sub-narrator Muhammad said, \"I think that it was most probably the `Asr prayer\") and he finished it after offering two rak`at only. He then stood near a price of wood in front of the Mosque and put his hand over it. Abu Bakr and `Umar were amongst those who were present, but they dared not talk to him about that (because of excessive respect for him), and those who were in a hurry went out. They said, \"Has the prayer been reduced?\" A man who was called Dhul-Yadain by the Prophet said (to the Prophet), \"Has the prayer been reduced or have you forgotten?\" He said, \"Neither have I forgotten, nor has the prayer been reduced.\" He said, \"Certainly you have forgotten.\" So the Prophet offered two more rak`at and performed Taslim and then said Takbir and performed a prostration of Sahu like his ordinary prostration or a bit longer and then raised his head and said Takbir and then put his head down and performed a prostration like his ordinary prostration or a bit longer, and then raised his head and said Takbir.",
      "chain": [
        "30329",
        "20303",
        "20278",
        "13"
      ]
    },
    {
      "hadith_no": "1244",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، قال سمعت محمد بن المنكدر، قال سمعت جابر بن عبد الله  رضى الله عنهما  قال لما قتل أبي جعلت أكشف الثوب عن وجهه أبكي، وينهوني عنه والنبي صلى الله عليه وسلم لا ينهاني، فجعلت عمتي فاطمة تبكي، فقال النبي صلى الله عليه وسلم ‏\"‏ تبكين أو لا تبكين، ما زالت الملائكة تظله بأجنحتها حتى رفعتموه ‏\"‏‏.‏ تابعه ابن جريج أخبرني ابن المنكدر سمع جابرا  رضى الله عنه ‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     When my father was martyred, I lifted the sheet from his face and wept and the people forbade me to do so but the Prophet did not forbid me. Then my aunt Fatima began weeping and the Prophet said, \"It is all the same whether you weep or not. The angels were shading him continuously with their wings till you shifted him (from the field). \"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "1254",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد، حدثنا عبد الوهاب الثقفي، عن أيوب، عن محمد، عن أم عطية  رضى الله عنها  قالت دخل علينا رسول الله صلى الله عليه وسلم ونحن نغسل ابنته فقال ‏\"‏ اغسلنها ثلاثا أو خمسا أو أكثر من ذلك بماء وسدر، واجعلن في الآخرة كافورا، فإذا فرغتن فآذنني ‏\"‏‏.‏ فلما فرغنا آذناه، فألقى إلينا حقوه فقال ‏\"‏ أشعرنها إياه ‏\"‏‏.‏ فقال أيوب وحدثتني حفصة بمثل حديث محمد وكان في حديث حفصة ‏\"‏ اغسلنها وترا ‏\"‏‏.‏ وكان فيه ‏:‏ ‏\"‏ ثلاثا أو خمسا أو سبعا ‏\"‏‏.‏ وكان فيه أنه قال ‏\"‏ ابدأن بميامنها ومواضع الوضوء منها ‏\"‏‏.‏ وكان فيه أن أم عطية قالت ومشطناها ثلاثة قرون‏.‏",
      "text_en": " Narrated Um 'Atiyya:                     Allah's Apostle came to us and we were giving a bath to his (dead) daughter and said, \"Wash her three, five or more times with water and Sidr and sprinkle camphor on her at the end; and when you finish, notify me.\" So when we finished, we informed him and he gave us his waist-sheet and told us to shroud her in it. Aiyub said that Hafsa narrated to him a narration similar to that of Muhammad in which it was said that the bath was to be given for an odd number of times, and the numbers 3, 5 or 7 were mentioned. It was also said that they were to start with the right side and with the parts which were washed in ablution, and that Um 'Atiyya also mentioned, \"We combed her hair and divided them in three braids.\"",
      "chain": [
        "30213",
        "20259",
        "11015",
        "20278",
        "71"
      ]
    },
    {
      "hadith_no": "1258",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا حامد بن عمر، حدثنا حماد بن زيد، عن أيوب، عن محمد، عن أم عطية، قالت توفيت إحدى بنات النبي صلى الله عليه وسلم فخرج، فقال ‏\"‏ اغسلنها ثلاثا أو خمسا أو أكثر من ذلك إن رأيتن بماء وسدر، واجعلن في الآخرة كافورا أو شيئا من كافور، فإذا فرغتن فآذنني ‏\"‏‏.‏ قالت فلما فرغنا آذناه، فألقى إلينا حقوه فقال ‏\"‏ أشعرنها إياه ‏\"‏‏.‏   وعن أيوب، عن حفصة، عن أم عطية  رضى الله عنهما  بنحوه وقالت إنه قال ‏\"‏ اغسلنها ثلاثا أو خمسا أو سبعا أو أكثر من ذلك إن رأيتن ‏\"‏‏.‏ قالت حفصة قالت أم عطية  رضى الله عنها  وجعلنا رأسها ثلاثة قرون‏.‏",
      "text_en": " Narrated Muhammad:                     Um 'Atiyya said, \"One of the daughters of the Prophet died and he came out and said, 'Wash her three or five times or more, if you think it necessary, with water and Sidr, and last of all put camphor (or some camphor) and when you finish, inform me.' \" Um Atiyya added, \"When we finished we informed him and he gave us his waist-sheet and said, 'Shroud her in it.' \" And Um 'Atiyya (in another narration) added, \"The Prophet said, 'Wash her three, five or seven times or more, if you think it necessary.' \" Hafsa said that Um 'Atiyya had also said, \"We entwined her hair into three braids.\"",
      "chain": [
        "30128",
        "20022",
        "11015",
        "20278",
        "71"
      ]
    },
    {
      "hadith_no": "1302",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن ثابت، قال سمعت أنسا  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الصبر عند الصدمة الأولى ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"The real patience is at the first stroke of a calamity.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "1306",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عبد الله بن عبد الوهاب، حدثنا حماد بن زيد، حدثنا أيوب، عن محمد، عن أم عطية  رضى الله عنها  قالت أخذ علينا النبي صلى الله عليه وسلم عند البيعة أن لا ننوح، فما وفت منا امرأة غير خمس نسوة أم سليم وأم العلاء وابنة أبي سبرة امرأة معاذ وامرأتين أو ابنة أبي سبرة وامرأة معاذ وامرأة أخرى‏.‏",
      "text_en": " Narrated Um 'Atiyya:                     At the time of giving the pledge of allegiance to the Prophet one of the conditions was that we would not wail, but it was not fulfilled except by five women and they are Um Sulaim, Um Al-`Ala', the daughter of Abi Sabra (the wife of Mu`adh), and two other women; or the daughter of Abi Sabra and the wife of Mu`adh and another woman.",
      "chain": [
        "30143",
        "20022",
        "11015",
        "20278",
        "71"
      ]
    },
    {
      "hadith_no": "1335",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن سعد، عن طلحة، قال صليت خلف ابن عباس  رضى الله عنهما ‏.‏ حدثنا محمد بن كثير، أخبرنا سفيان، عن سعد بن إبراهيم، عن طلحة بن عبد الله بن عوف، قال صليت خلف ابن عباس  رضى الله عنهما  على جنازة فقرأ بفاتحة الكتاب قال ليعلموا أنها سنة‏.‏",
      "text_en": " Narrated Talha bin `Abdullah bin `Auf:                     I offered the funeral prayer behind Ibn `Abbas and he recited Al-Fatiha and said, \"You should know that it (i.e. recitation of Al-Fatiha) is the tradition of the Prophet Muhammad.",
      "chain": [
        "30160",
        "20278",
        "20020",
        "9",
        "11356"
      ]
    },
    {
      "hadith_no": "1588",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن الحكم، عن علي بن حسين، عن مروان بن الحكم، قال شهدت عثمان وعليا  رضى الله عنهما  وعثمان ينهى عن المتعة وأن يجمع بينهما‏.‏ فلما رأى علي، أهل بهما لبيك بعمرة وحجة قال ما كنت لأدع سنة النبي صلى الله عليه وسلم لقول أحد‏.‏",
      "text_en": " Narrated Marwan bin Al-Hakam:                     I saw `Uthman and `Ali. `Uthman used to forbid people to perform Hajj-at-Tamattu` and Hajj-al- Qiran (Hajj and `Umra together), and when `Ali saw (this act of `Uthman), he assumed Ihram for Hajj and `Umra together saying, \"Lubbaik for `Umra and Hajj,\" and said, \"I will not leave the tradition of the Prophet on the saying of somebody.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11069",
        "11045",
        "858"
      ]
    },
    {
      "hadith_no": "1590",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا غندر، حدثنا شعبة، عن قيس بن مسلم، عن طارق بن شهاب، عن أبي موسى  رضى الله عنه  قال قدمت على النبي صلى الله عليه وسلم‏.‏ فأمره بالحل‏.‏",
      "text_en": " Narrated Abu Musa:                     came to the Prophet (from Yemen and was assuming Ihram for Hajj) and he ordered me to finish the Ihram (after performing the `Umra).",
      "chain": [
        "30170",
        "20278",
        "20020",
        "11386",
        "3680",
        "41"
      ]
    },
    {
      "hadith_no": "1823",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن قيس بن مسلم، عن طارق بن شهاب، عن أبي موسى الأشعري  رضى الله عنه  قال قدمت على النبي صلى الله عليه وسلم بالبطحاء وهو منيخ فقال ‏\"‏ أحججت ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ بما أهللت ‏\"‏‏.‏ قلت لبيك بإهلال كإهلال النبي صلى الله عليه وسلم قال ‏\"‏ أحسنت‏.‏ طف بالبيت وبالصفا والمروة ثم أحل ‏\"‏‏.‏ فطفت بالبيت، وبالصفا والمروة، ثم أتيت امرأة من قيس، ففلت رأسي، ثم أهللت بالحج‏.‏ فكنت أفتي به، حتى كان في خلافة عمر فقال إن أخذنا بكتاب الله فإنه يأمرنا بالتمام، وإن أخذنا بقول النبي صلى الله عليه وسلم فإنه لم يحل حتى يبلغ الهدى محله‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     I came to the Prophet at Al-Batha' while his camel was kneeling down and he asked me, \"Have you intended to perform the Hajj?\" I replied in the affirmative. He asked me, 'With what intention have you assumed Ihram?\" I replied, \"I have assumed Ihram with the same intention as that of the Prophet. He said, \"You have done well. Perform the Tawaf of the Ka`ba and (the Sai) between As-Safa and Al- Marwa and then finish the Ihram.\" So, I performed the Tawaf around the Ka`ba and the Sai) between As-Safa and Al-Marwa and then went to a woman of the tribe of Qais who cleaned my head from lice. Later I assumed the Ihram for Hajj. I used to give the verdict of doing the same till the caliphate of `Umar who said, \"If you follow the Holy Book then it orders you to remain in the state of Ihram till you finish from Hajj, if you follow the Prophet then he did not finish his Ihram till the Hadi (sacrifice) had reached its place of slaughtering (Hajj-al-Qiran).",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11386",
        "3680",
        "41"
      ]
    },
    {
      "hadith_no": "1978",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن مغيرة، قال سمعت مجاهدا، عن عبد الله بن عمرو  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ صم من الشهر ثلاثة أيام ‏\"‏‏.‏ قال أطيق أكثر من ذلك‏.‏ فما زال حتى قال ‏\"‏ صم يوما وأفطر يوما ‏\"‏ فقال ‏\"‏ اقرإ القرآن في شهر ‏\"‏‏.‏ قال إني أطيق أكثر‏.‏ فما زال حتى قال في ثلاث‏.‏",
      "text_en": " Narrated Mujahid from `Abdullah bin `Amr:                     The Prophet said (to `Abdullah), \"Fast three days a month.\" `Abdullah said, (to the Prophet) \"I am able to fast more than that.\" They kept on arguing on this matter till the Prophet said, \"Fast on alternate days, and recite the whole Qur'an once a month.\" `Abdullah said, \"I can recite more (in a month),\" and the argument went on till the Prophet said, \"Recite the Qur'an once each three days.\" (i.e. you must not recite the whole Qur'an in less than three days).",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11072",
        "11028",
        "29"
      ]
    },
    {
      "hadith_no": "1986",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن شعبة، ح‏.‏ وحدثني محمد، حدثنا غندر، حدثنا شعبة، عن قتادة، عن أبي أيوب، عن جويرية بنت الحارث  رضى الله عنها  أن النبي صلى الله عليه وسلم دخل عليها يوم الجمعة وهى صائمة فقال ‏\"‏ أصمت أمس ‏\"‏‏.‏ قالت لا‏.‏ قال ‏\"‏ تريدين أن تصومي غدا ‏\"‏‏.‏ قالت لا‏.‏ قال ‏\"‏ فأفطري ‏\"‏‏.‏  وقال حماد بن الجعد سمع قتادة حدثني أبو أيوب أن جويرية حدثته فأمرها فأفطرت.",
      "text_en": " Narrated Abu Aiyub from Juwairiya bint Al-Harith:                     The Prophet visited her (Juwairiya) on a Friday and she was fasting. He asked her, \"Did you fast yesterday?\" She said, \"No.\" He said, \"Do you intend to fast tomorrow?\" She said, \"No.\" He said, \"Then break your fast.\" Through another series of narrators, Abu Aiyub is reported to have said, \"He ordered her and she broke her fast.\"",
      "chain": [
        "30175",
        "20031",
        "20020",
        "20278",
        "20278",
        "20020",
        "11019",
        "33",
        "58"
      ]
    },
    {
      "hadith_no": "1997",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، سمعت عبد الله بن عيسى، عن الزهري، عن عروة، عن عائشة،‏.‏ وعن سالم، عن ابن عمر  رضى الله عنهم  قالا لم يرخص في أيام التشريق أن يصمن، إلا لمن لم يجد الهدى‏.‏",
      "text_en": " Narrated `Aisha and Ibn `Umar:                     Nobody was allowed to fast on the days of Tashriq except those who could not afford the Hadi (Sacrifice).",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11361",
        "11013",
        "10511",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "2067",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن أبي يعقوب الكرماني، حدثنا حسان، حدثنا يونس، حدثنا محمد، عن أنس بن مالك  رضى الله عنه  قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من سره أن يبسط له رزقه أو ينسأ له في أثره فليصل رحمه ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     I heard Allah's Apostle saying, \"whoever desires an expansion in his sustenance and age, should keep good relations with his Kith and kin.\"",
      "chain": [
        "30159",
        "20417",
        "20475",
        "20278",
        "19"
      ]
    },
    {
      "hadith_no": "2084",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن منصور، عن أبي الضحى، عن مسروق، عن عائشة  رضى الله عنها  قالت لما نزلت آخر البقرة قرأهن النبي صلى الله عليه وسلم عليهم في المسجد، ثم حرم التجارة في الخمر‏.‏",
      "text_en": " Narrated Aisha:                     When the last Verses of Surat al- Baqara were revealed, the Prophet recited them in the mosque and proclaimed the trade of alcohol as illegal.",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11067",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "2145",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا قتيبة، حدثنا عبد الوهاب، حدثنا أيوب، عن محمد، عن أبي هريرة  رضى الله عنه  قال نهي عن لبستين، أن يحتبي الرجل، في الثوب الواحد، ثم يرفعه على منكبه، وعن بيعتين اللماس والنباذ‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet forbade two kinds of dressing; (one of them) is to sit with one's legs drawn up while wrapped in one garment. (The other) is to lift that garment on one's shoulders. And also forbade two kinds of sale: Al-Limais and An-Nibadh.",
      "chain": [
        "30367",
        "20259",
        "11015",
        "20278",
        "13"
      ]
    },
    {
      "hadith_no": "2212",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثني إسحاق، حدثنا ابن نمير، أخبرنا هشام، وحدثني محمد، قال سمعت عثمان بن فرقد، قال سمعت هشام بن عروة، يحدث عن أبيه، أنه سمع عائشة  رضى الله عنها  تقول ‏{‏ومن كان غنيا فليستعفف ومن كان فقيرا فليأكل بالمعروف‏}‏ أنزلت في والي اليتيم الذي يقيم عليه، ويصلح في ماله، إن كان فقيرا أكل منه بالمعروف‏.‏",
      "text_en": " Narrated Hisham bin `Urwa from his father:                     who heard Aisha saying, \"The Holy Verse; 'Whoever amongst the guardians is rich, he should take no wages (from the property of the orphans) but If he is poor, let him have for himself what is just and reasonable (according to his labors)' (4.6) was revealed concerning the guardian of the orphans who looks after them and manages favorably their financial affairs; If the guardian Is poor, he could have from It what Is just and reasonable, (according to his labors).",
      "chain": [
        "30312",
        "30212",
        "20295",
        "20278",
        "20263",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2219",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن سعد، عن أبيه، قال عبد الرحمن بن عوف  رضى الله عنه  لصهيب اتق الله ولا تدع إلى غير أبيك‏.‏ فقال صهيب ما يسرني أن لي كذا وكذا، وأني قلت ذلك، ولكني سرقت وأنا صبي‏.‏",
      "text_en": " Narrated Sa`d that his father said:                     `Abdur-Rahman bin `Auf said to Suhaib, 'Fear Allah and do not ascribe yourself to somebody other than your father.' Suhaib replied, 'I would not like to say it even if I were given large amounts of money, but I say I was kidnapped in my childhood.' \"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "9",
        "8"
      ]
    },
    {
      "hadith_no": "2250",
      "source": " Sahih Bukhari ",
      "chapter": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam) - كتاب السلم",
      "chapter_no": "35",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن عمرو، عن أبي البختري، سألت ابن عمر  رضى الله عنهما  عن السلم، في النخل فقال نهى النبي صلى الله عليه وسلم عن بيع الثمر حتى يصلح، ونهى عن الورق بالذهب نساء بناجز‏.‏ وسألت ابن عباس فقال نهى النبي صلى الله عليه وسلم عن بيع النخل حتى يأكل أو يؤكل، وحتى يوزن‏.‏ قلت وما يوزن قال رجل عنده حتى يحرز‏.‏",
      "text_en": " Narrated Abu Al-Bakhtari:                     I asked Ibn `Umar about Salam for dates. Ibn `Umar replied, \"The Prophet forbade the sale (the fruits) of date-palms until they were fit for eating and also forbade the sale of silver for gold on credit.\" I also asked Ibn `Abbas about it. Ibn `Abbas replied, \"The Prophet forbade the sale of dates till they were fit for eating, and could be weighed.\" I asked him, \"What is to be weighed (as the dates are on the trees)?\" A man sitting by Ibn `Abbas said, \"It means till they are cut and stored.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11439",
        "11347",
        "18"
      ]
    },
    {
      "hadith_no": "2324",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن سعد، سمعت أبا سلمة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ بينما رجل راكب على بقرة التفتت إليه‏.‏ فقالت لم أخلق لهذا، خلقت للحراثة، قال آمنت به أنا وأبو بكر وعمر، وأخذ الذئب شاة فتبعها الراعي، فقال الذئب من لها يوم السبع، يوم لا راعي لها غيري‏.‏ قال آمنت به أنا وأبو بكر وعمر ‏\"‏‏.‏ قال أبو سلمة ما هما يومئذ في القوم‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"While a man was riding a cow, it turned towards him and said, 'I have not been created for this purpose (i.e. carrying), I have been created for sloughing.\" The Prophet added, \"I, Abu Bakr and `Umar believe in the story.\" The Prophet went on, \"A wolf caught a sheep, and when the shepherd chased it, the wolf said, 'Who will be its guard on the day of wild beasts, when there will be no shepherd for it except me?' \"After narrating it, the Prophet said, \"I, Abu Bakr and `Umar too believe it.\" Abu Salama (a sub-narrator) said, \"Abu Bakr and `Umar were not present then.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "9",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2367",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن محمد بن زياد، سمعت أبا هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ والذي نفسي بيده لأذودن رجالا عن حوضي كما تذاد الغريبة من الإبل عن الحوض ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"By Him in Whose Hands my soul is, I will drive some people out from my (sacred) Fount on the Day of Resurrection as strange camels are expelled from a private trough.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "2426",
      "source": " Sahih Bukhari ",
      "chapter": "Lost Things Picked up by Someone (Luqatah) - كتاب فى اللقطة",
      "chapter_no": "45",
      "text_ar": "حدثنا آدم، حدثنا شعبة،‏.‏ وحدثني محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن سلمة، سمعت سويد بن غفلة، قال لقيت أبى بن كعب  رضى الله عنه  فقال أخذت صرة مائة دينار فأتيت النبي صلى الله عليه وسلم فقال ‏\"‏ عرفها حولا‏\"‏‏.‏ فعرفتها حولها فلم أجد من يعرفها، ثم أتيته فقال ‏\"‏ عرفها حولا ‏\"‏ فعرفتها فلم أجد، ثم أتيته ثلاثا فقال ‏\"‏ احفظ وعاءها وعددها ووكاءها، فإن جاء صاحبها، وإلا فاستمتع بها ‏\"‏‏.‏ فاستمتعت فلقيته بعد بمكة فقال لا أدري ثلاثة أحوال أو حولا واحدا‏.‏",
      "text_en": " Narrated Ubai bin Ka`b:                     I found a purse containing one hundred Diners. So I went to the Prophet (and informed him about it), he said, \"Make public announcement about it for one year\" I did so, but nobody turned up to claim it, so I again went to the Prophet who said, \"Make public announcement for another year.\" I did, but none turned up to claim it. I went to him for the third time and he said, \"Keep the container and the string which is used for its tying and count the money it contains and if its owner comes, give it to him; otherwise, utilize it.\" The sub-narrator Salama said, \"I met him (Suwaid, another sub-narrator) in Mecca and he said, 'I don't know whether Ubai made the announcement for three years or just one year.' \"",
      "chain": [
        "20404",
        "30160",
        "20278",
        "20020",
        "237",
        "11174"
      ]
    },
    {
      "hadith_no": "2459",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا بشر بن خالد، أخبرنا محمد، عن شعبة، عن سليمان، عن عبد الله بن مرة، عن مسروق، عن عبد الله بن عمرو  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ أربع من كن فيه كان منافقا، أو كانت فيه خصلة من أربعة كانت فيه خصلة من النفاق، حتى يدعها إذا حدث كذب، وإذا وعد أخلف، وإذا عاهد غدر، وإذا خاصم فجر ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     The Prophet said, \"Whoever has (the following) four characters will be a hypocrite, and whoever has one of the following four characteristics will have one characteristic of hypocrisy until he gives it up. These are: (1 ) Whenever he talks, he tells a lie; (2) whenever he makes a promise, he breaks it; (3) whenever he makes a covenant he proves treacherous; (4) and whenever he quarrels, he behaves impudently in an evil insulting manner.\" (See Hadith No. 33 Vol. 1)",
      "chain": [
        "30126",
        "20278",
        "20020",
        "11060",
        "11362",
        "11018",
        "29"
      ]
    },
    {
      "hadith_no": "2577",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن قتادة، عن أنس بن مالك  رضى الله عنه  قال أتي النبي صلى الله عليه وسلم بلحم فقيل تصدق على بريرة قال ‏\"‏ هو لها صدقة، ولنا هدية ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Some meat was brought to the Prophet and it was said that the meat had been given in charity to Buraira. He said, \"It was Sadaqa for Buraira but a gift for us.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "2578",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن عبد الرحمن بن القاسم، قال سمعته منه، عن القاسم، عن عائشة  رضى الله عنها  أنها أرادت أن تشتري بريرة، وأنهم اشترطوا ولاءها، فذكر للنبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ اشتريها فأعتقيها، فإنما الولاء لمن أعتق ‏\"‏‏.‏ وأهدي لها لحم، فقيل للنبي صلى الله عليه وسلم هذا تصدق على بريرة‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ هو لها صدقة ولنا هدية ‏\"‏‏.‏ وخيرت‏.‏ قال عبد الرحمن زوجها حر أو عبد قال شعبة سألت عبد الرحمن عن زوجها‏.‏ قال لا أدري أحر أم عبد",
      "text_en": " Narrated `Aisha:                     I intended to buy Buraira but her masters stipulated that her Wala should be for them. When the Prophet was told about it, he said to me, \"Buy and manumit her, as the Wala' is for the liberator.\" Once Buraira was given some meat, and the Prophet asked, \"What is this?\" I said, \"It has been given to Buraira in charity.\" He said, \"It is sadaqa for her but a gift for us.\" Buraira was given the option (to stay with her husband or to part with him). `Abdur-Rahman (a sub-narrator) wondered, \"Was her husband a slave or a free man?\" Shu`ba (another sub-narrator) said, \"I asked `Abdur-Rahman whether her husband was a slave or a free man. He replied that he did not know whether he was a slave or a free man.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "2604",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن محارب، سمعت جابر بن عبد الله  رضى الله عنهما  يقول بعت من النبي صلى الله عليه وسلم بعيرا في سفر، فلما أتينا المدينة قال ‏\"‏ ائت المسجد فصل ركعتين ‏\"‏‏.‏ فوزن  قال شعبة أراه فوزن لي فأرجح، فما زال منها شىء حتى أصابها أهل الشأم يوم الحرة‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     I sold a camel to the Prophet on one of the journeys. When we reached Medina, he ordered me to go to the Mosque and offer two rak`at. Then he weighed for me (the price of the camel in gold) and gave an extra amount over it. A part of it remained with me till it was taken by the army of Sham on the day of Harra.\"",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11389",
        "34"
      ]
    }
  ],
  "total_hadiths": 409
}