{
  "id": "20271",
  "name": "Fdyl bin Sulaiman al-Nmyry فضيل بن سليمان النميري",
  "full_name": "Fdyl bin Sulaiman al-Nmyry فضيل بن سليمان النميري",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "183",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ع  -  صدوق ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "10766",
      "name": "Sa'd bin Tariq, Abu Malik سعد بن طارق بن أشيم أبو مالك الأشجعي",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11172",
      "name": "Abu Hazim, Salma bin Dinar سلمة بن دينار أبو حازم الأعرج",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10644",
      "name": "'Abdullah bin 'Uthman bin Khuthaym عبد الله بن عثمان بن خثيم القاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "28244",
      "name": "Salah bin Khwat bin Salah صالح بن خوات بن صالح بن خوات",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11504",
      "name": "Khthym bin Arak bin Malik خثيم بن عراك بن مالك",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11184",
      "name": "'Abdullah bin Sa'id bin Abi Hind عبد الله بن سعيد بن أبي هند",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10616",
      "name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11106",
      "name": "Musa bin 'Uqba موسى بن عقبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11565",
      "name": "Mansur bin 'Abdur Rahman bin Talha منصور بن عبد الرحمن بن طلحة الحجبي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11540",
      "name": "Muslim bin Abi Maryam مسلم بن أبي مريم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "28479",
      "name": "Fa'id Mwla 'Aabadl فائد مولى عبادل",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10614",
      "name": "Muhammad bin Zayd bin al-Mhajr محمد بن زيد بن المهاجر بن قنفذ",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "24380",
      "name": "Kathir bin Qarwnd Kwfy Skn كثير بن قاروند",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11193",
      "name": "'Abdur Rahman bin Humaid bin 'AR عبد الرحمن بن حميد بن عبد الرحمن",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "12491",
      "name": "Muhammad bin Abi Yahya محمد بن أبي يحيى الأسلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20187",
      "name": "Ibrahim bin Tahman إبراهيم بن طهمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30161",
      "name": "Muhammad bin Abi Bakr bin 'Ali محمد بن أبي بكر بن علي بن عطاء المقدمي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30147",
      "name": "'Abdur Rahman bin al-Mubarak al-'Aishi عبد الرحمن بن المبارك",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20430",
      "name": "'Asim bin 'Ali bin 'Asim عاصم بن علي بن عاصم بن صهيب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30132",
      "name": "Khalifa bin Khayyat bin Khalifa خليفة بن خياط بن خليفة بن خياط",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30423",
      "name": "Ahmed bin 'Ubda bin Musa أحمد بن عبدة بن موسى",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30448",
      "name": "Muhammad bin 'Abdullah محمد بن عبد الله بن بزيع",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30153",
      "name": "'Amr bin 'Ali bin Bahr al-Bahli عمرو بن علي بن بحر الباهلي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30024",
      "name": "'Ubaidullah bin 'Umar al-Qawariri عبيد الله بن عمر القواريري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30164",
      "name": "Muhammad bin Ziyad - Yu'Yu' محمد بن زياد - يؤيؤ",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38603",
      "name": "Muhammad bin Musa al-Harshi محمد بن موسى الحرشي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "34059",
      "name": "al-Husain bin Muhammad al-Dhara' الحسين بن محمد بن أيوب الذارع السعدي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "34125",
      "name": "Abd Rbh bin Khalid عبد ربه بن خالد بن عبد الملك",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20720",
      "name": "Nasr bin 'Ali bin Asbahan نصر بن علي الجهضمي الكبير",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "30121",
      "name": "Ahmed bin al-Miqdam أحمد بن المقدام",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1560",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن أبي بكر، حدثنا فضيل بن سليمان، حدثنا موسى بن عقبة، قال حدثني سالم بن عبد الله، عن أبيه  رضى الله عنه  عن النبي صلى الله عليه وسلم أنه رئي وهو في معرس بذي الحليفة ببطن الوادي قيل له إنك ببطحاء مباركة‏.‏ وقد أناخ بنا سالم، يتوخى بالمناخ الذي كان عبد الله ينيخ، يتحرى معرس رسول الله صلى الله عليه وسلم وهو أسفل من المسجد الذي ببطن الوادي، بينهم وبين الطريق وسط من ذلك‏.‏",
      "text_en": " Narrated Musa bin `Uqba:                     Salim bin `Abdullah's father said, \"The Prophet said that while resting in the bottom of the valley at Muarras in Dhul-Hulaifa, he had been addressed in a dream: 'You are verily in a blessed valley.' \" Salim made us to dismount from our camels at the place where `Abdullah used to dismount, aiming at the place where Allah's Apostle had rested and it was below the Mosque situated in the middle of the valley in between them (the residence) and the road.",
      "chain": [
        "30161",
        "20271",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1569",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا فضيل بن سليمان، قال حدثني موسى بن عقبة، قال أخبرني كريب، عن عبد الله بن عباس  رضى الله عنهما  قال انطلق النبي صلى الله عليه وسلم من المدينة، بعد ما ترجل وادهن ولبس إزاره ورداءه، هو وأصحابه، فلم ينه عن شىء من الأردية والأزر تلبس إلا المزعفرة التي تردع على الجلد، فأصبح بذي الحليفة، ركب راحلته حتى استوى على البيداء، أهل هو وأصحابه وقلد بدنته، وذلك لخمس بقين من ذي القعدة، فقدم مكة لأربع ليال خلون من ذي الحجة، فطاف بالبيت وسعى بين الصفا والمروة، ولم يحل من أجل بدنه لأنه قلدها، ثم نزل بأعلى مكة عند الحجون، وهو مهل بالحج، ولم يقرب الكعبة بعد طوافه بها حتى رجع من عرفة، وأمر أصحابه أن يطوفوا بالبيت وبين الصفا والمروة، ثم يقصروا من رءوسهم ثم يحلوا، وذلك لمن لم يكن معه بدنة قلدها، ومن كانت معه امرأته فهي له حلال، والطيب والثياب‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     The Prophet with his companions started from Medina after combing and oiling his hair and putting on two sheets of lhram (upper body cover and waist cover). He did not forbid anyone to wear any kind of sheets except the ones colored with saffron because they may leave the scent on the skin. And so in the early morning, the Prophet mounted his Mount while in Dhul-Hulaifa and set out till they reached Baida', where he and his companions recited Talbiya, and then they did the ceremony of Taqlid (which means to put the colored garlands around the necks of the Budn (camels for sacrifice). And all that happened on the 25th of Dhul-Qa'da. And when he reached Mecca on the 4th of Dhul-Hijja he performed the Tawaf round the Ka`ba and performed the Tawaf between Safa and Marwa. And as he had a Badana and had garlanded it, he did not finish his Ihram. He proceeded towards the highest places of Mecca near Al-Hujun and he was assuming the Ihram for Hajj and did not go near the Ka`ba after he performed Tawaf (round it) till he returned from `Arafat. Then he ordered his companions to perform the Tawaf round the Ka`ba and then the Tawaf of Safa and Marwa, and to cut short the hair of their heads and to finish their Ihram. And that was only for those people who had not garlanded Budn. Those who had their wives with them were permitted to contact them (have sexual intercourse), and similarly perfume and (ordinary) clothes were permissible for them.",
      "chain": [
        "30161",
        "20271",
        "11106",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "1650",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن أبي بكر، حدثنا فضيل، حدثنا موسى بن عقبة، أخبرني كريب، عن عبد الله بن عباس  رضى الله عنهما  قال قدم النبي صلى الله عليه وسلم مكة، فطاف وسعى بين الصفا والمروة، ولم يقرب الكعبة بعد طوافه بها حتى رجع من عرفة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet arrived at Mecca and performed Tawaf of the Ka`ba and Sa`i between Safa and Marwa, but he did not go near the Ka`ba after his Tawaf till he returned from `Arafat.",
      "chain": [
        "30161",
        "20271",
        "11106",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "1758",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن أبي بكر، حدثنا فضيل بن سليمان، حدثنا موسى بن عقبة، أخبرني كريب، عن ابن عباس  رضى الله عنهما  قال لما قدم النبي صلى الله عليه وسلم مكة أمر أصحابه أن يطوفوا بالبيت، وبالصفا والمروة، ثم يحلوا، ويحلقوا أو يقصروا‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When the Prophet came to Mecca, he ordered his Companions to perform Tawaf round the Ka`ba and between Safa and Marwa, to finish their Ihram and get their hair shaved off or cut short.",
      "chain": [
        "30161",
        "20271",
        "11106",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "2338",
      "source": " Sahih Bukhari ",
      "chapter": "Agriculture - كتاب المزارعة",
      "chapter_no": "41",
      "text_ar": "حدثنا أحمد بن المقدام، حدثنا فضيل بن سليمان، حدثنا موسى، أخبرنا نافع، عن ابن عمر  رضى الله عنهما  قال كان رسول الله صلى الله عليه وسلم‏.‏ وقال عبد الرزاق أخبرنا ابن جريج قال حدثني موسى بن عقبة عن نافع عن ابن عمر أن عمر بن الخطاب  رضى الله عنهما  أجلى اليهود والنصارى من أرض الحجاز، وكان رسول الله صلى الله عليه وسلم لما ظهر على خيبر أراد إخراج اليهود منها، وكانت الأرض حين ظهر عليها لله ولرسوله صلى الله عليه وسلم وللمسلمين، وأراد إخراج اليهود، منها فسألت اليهود رسول الله صلى الله عليه وسلم ليقرهم بها أن يكفوا عملها ولهم نصف الثمر، فقال لهم رسول الله صلى الله عليه وسلم ‏\"‏ نقركم بها على ذلك ما شئنا ‏\"‏‏.‏ فقروا بها حتى أجلاهم عمر إلى تيماء وأريحاء‏.‏",
      "text_en": " Narrated Ibn `Umar:                     `Umar expelled the Jews and the Christians from Hijaz. When Allah's Apostle had conquered Khaibar, he wanted to expel the Jews from it as its land became the property of Allah, His Apostle, and the Muslims. Allah's Apostle intended to expel the Jews but they requested him to let them stay there on the condition that they would do the labor and get half of the fruits. Allah's Apostle told them, \"We will let you stay on thus condition, as long as we wish.\" So, they (i.e. Jews) kept on living there until `Umar forced them to go towards Taima' and Ariha'.",
      "chain": [
        "30121",
        "20271",
        "20040",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2525",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن مقدام، حدثنا الفضيل بن سليمان، حدثنا موسى بن عقبة، أخبرني نافع، عن ابن عمر  رضى الله عنهما  أنه كان يفتي في العبد أو الأمة يكون بين شركاء، فيعتق أحدهم نصيبه منه، يقول قد وجب عليه عتقه كله، إذا كان للذي أعتق من المال ما يبلغ، يقوم من ماله قيمة العدل، ويدفع إلى الشركاء أنصباؤهم، ويخلى سبيل المعتق‏.‏ يخبر ذلك ابن عمر عن النبي صلى الله عليه وسلم‏.‏ ورواه الليث وابن أبي ذئب وابن إسحاق وجويرية ويحيى بن سعيد وإسماعيل بن أمية عن نافع عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم مختصرا‏.‏",
      "text_en": " Narrated Ibn `Umar:                     That he used to give his verdict regarding the male or female slaves owned by more than one master, one of whom may manumit his share of the slave. Ibn `Umar used to say in such a case, \"The manumitted should manumit the slave completely if he has sufficient money to pay the rest of the price of that slave (which is to be justly estimated) and the other shareholders are to take the price of their shares and the slave is freed (released from slavery).\" Ibn `Umar narrated this verdict from the Prophet.",
      "chain": [
        "20271",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2854",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن أبي بكر، حدثنا فضيل بن سليمان، عن أبي حازم، عن عبد الله بن أبي قتادة، عن أبيه، أنه خرج مع النبي صلى الله عليه وسلم فتخلف أبو قتادة مع بعض أصحابه وهم محرمون وهو غير محرم، فرأوا حمارا وحشيا قبل أن يراه، فلما رأوه تركوه حتى رآه أبو قتادة، فركب فرسا له يقال له الجرادة، فسألهم أن يناولوه سوطه فأبوا، فتناوله فحمل فعقره، ثم أكل فأكلوا، فندموا فلما أدركوه قال ‏\"‏ هل معكم منه شىء ‏\"‏‏.‏ قال معنا رجله، فأخذها النبي صلى الله عليه وسلم فأكلها‏.‏",
      "text_en": " Narrated `Abdullah bin Abi Qatada:                     (from his father) Abu Qatada went out (on a journey) with Allah's Apostle but he was left behind with some of his companions who were in the state of Ihram. He himself was not in the state of Ihram. They saw an opener before he could see it. When they saw the opener, they did not speak anything till Abu Qatada saw it. So, he rode over his horse called Al-Jarada and requested them to give him his lash, but they refused. So, he himself took it and then attacked the opener and slaughtered it. He ate of its meat and his companions ate, too, but they regretted their eating. When they met the Prophet (they asked him about it) and he asked, \"Have you some of its meat (left) with you?\" Abu Qatada replied, \"Yes, we have its leg with us.\" So, the Prophet took and ate it.",
      "chain": [
        "30161",
        "20271",
        "11172",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "3152",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثني أحمد بن المقدام، حدثنا الفضيل بن سليمان، حدثنا موسى بن عقبة، قال أخبرني نافع، عن ابن عمر  رضى الله عنهما أن عمر بن الخطاب، أجلى اليهود والنصارى من أرض الحجاز، وكان رسول الله صلى الله عليه وسلم لما ظهر على أهل خيبر أراد أن يخرج اليهود منها، وكانت الأرض لما ظهر عليها لليهود وللرسول وللمسلمين، فسأل اليهود رسول الله صلى الله عليه وسلم أن يتركهم على أن يكفوا العمل، ولهم نصف الثمر فقال رسول الله صلى الله عليه وسلم ‏\"‏ نقركم على ذلك ما شئنا ‏\"‏‏.‏ فأقروا حتى أجلاهم عمر في إمارته إلى تيماء وأريحا‏.‏",
      "text_en": " Narrated Ibn `Umar:                     `Umar bin Al-Khattab expelled all the Jews and Christians from the land of Hijaz. Allah's Apostle after conquering Khaibar, thought of expelling the Jews from the land which, after he conquered it belonged to Allah, Allah's Apostle and the Muslims. But the Jews requested Allah's Apostle to leave them there on the condition that they would do the labor and get half of the fruits (the land would yield). Allah's Apostle said, \"We shall keep you on these terms as long as we wish.\" Thus they stayed till the time of `Umar's Caliphate when he expelled them to Taima and Ariha.",
      "chain": [
        "30121",
        "20271",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3247",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا فضيل بن سليمان، عن أبي حازم، عن سهل بن سعد  رضى الله عنه  عن النبي صلى الله عليه وسلم ‏\"‏ ليدخلن من أمتي سبعون ألفا  أو سبعمائة ألف  لا يدخل أولهم حتى يدخل آخرهم، وجوههم على صورة القمر ليلة البدر ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     The Prophet said, \"Verily! 70,000 or 700,000 of my followers will enter Paradise altogether; so that the first and the last amongst them will enter at the same time, and their faces will be glittering like the bright full moon.\"",
      "chain": [
        "30161",
        "20271",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "3874",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني محمد بن أبي بكر، حدثنا فضيل بن سليمان، حدثنا موسى، حدثنا سالم بن عبد الله، عن عبد الله بن عمر، رضى الله عنهما أن النبي صلى الله عليه وسلم لقي زيد بن عمرو بن نفيل بأسفل بلدح، قبل أن ينزل على النبي صلى الله عليه وسلم الوحى فقدمت إلى النبي صلى الله عليه وسلم سفرة، فأبى أن يأكل منها ثم قال زيد إني لست آكل مما تذبحون على أنصابكم، ولا آكل إلا ما ذكر اسم الله عليه‏.‏ وأن زيد بن عمرو كان يعيب على قريش ذبائحهم، ويقول الشاة خلقها الله، وأنزل لها من السماء الماء، وأنبت لها من الأرض، ثم تذبحونها على غير اسم الله إنكارا لذلك وإعظاما له‏.‏",
      "text_en": "  Narrated 'Abdullah bin 'Umar:                       The Prophet met Zaid bin 'Amr bin Nufail in the bottom of (the valley of) Baldah before any Divine Inspiration came to the Prophet. A meal was presented to the Prophet but he refused to eat from it. (Then it was presented to Zaid) who said, \"I do not eat anything which you slaughter in the name of your stone idols. I eat none but those things on which Allah's Name has been mentioned at the time of slaughtering.\" Zaid bin 'Amr used to criticize the way Quraish used to slaughter their animals, and used to say, \"Allah has created the sheep and He has sent the water for it from the sky, and He has grown the grass for it from the earth; yet you slaughter it in other than the Name of Allah. He used to say so, for he rejected that practice and considered it as something abominable.",
      "chain": [
        "30161",
        "20271",
        "20040",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "4352",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد بن أبي بكر، حدثنا الفضيل بن سليمان، حدثنا عاصم، عن أبي عثمان النهدي، عن مجاشع بن مسعود، انطلقت بأبي معبد إلى النبي صلى الله عليه وسلم ليبايعه على الهجرة، قال ‏\"‏ مضت الهجرة لأهلها، أبايعه على الإسلام والجهاد ‏\"‏‏.‏",
      "text_en": " Narrated Mujashi bin Masud:                     I took Abu Mabad to the Prophet in order that he might give him the pledge of allegiance for migration. The Prophet said, \"Migration has gone to its people, but I take the pledge from him (i.e. Abu Mabad) for Islam and Jihad.\"",
      "chain": [
        "30161",
        "20271",
        "11080",
        "11113"
      ]
    },
    {
      "hadith_no": "4508",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو عاصم الضحاك بن مخلد، عن الفضيل بن سليمان، حدثنا موسى بن عقبة، عن سالم، عن أبيه، استعمل النبي صلى الله عليه وسلم أسامة  فقالوا فيه  فقال النبي صلى الله عليه وسلم ‏\"‏ قد بلغني أنكم قلتم في أسامة، وإنه أحب الناس إلى ‏\"‏‏.‏",
      "text_en": " Narrated Salim's father:                     The Prophet appointed Usama as the commander of the troops (to be sent to Syria). The Muslims spoke about Usama (unfavorably ). The Prophet said, \" I have been informed that you spoke about Usama. (Let it be known that ) he is the most beloved of all people to me.\"",
      "chain": [
        "20241",
        "20271",
        "11106",
        "11011"
      ]
    },
    {
      "hadith_no": "4562",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمد بن أبي بكر، حدثنا فضيل بن سليمان، حدثنا موسى بن عقبة، أخبرني كريب، عن ابن عباس، قال يطوف الرجل بالبيت ما كان حلالا حتى يهل بالحج، فإذا ركب إلى عرفة فمن تيسر له هدية من الإبل أو البقر أو الغنم، ما تيسر له من ذلك أى ذلك شاء، غير إن لم يتيسر له فعليه ثلاثة أيام في الحج، وذلك قبل يوم عرفة، فإن كان آخر يوم من الأيام الثلاثة يوم عرفة فلا جناح عليه، ثم لينطلق حتى يقف بعرفات من صلاة العصر إلى أن يكون الظلام، ثم ليدفعوا من عرفات إذا أفاضوا منها حتى يبلغوا جمعا الذي يتبرر فيه، ثم ليذكروا الله كثيرا، أو أكثروا التكبير والتهليل قبل أن تصبحوا ثم أفيضوا، فإن الناس كانوا يفيضون، وقال الله تعالى ‏{‏ثم أفيضوا من حيث أفاض الناس واستغفروا الله إن الله غفور رحيم‏}‏ حتى ترموا الجمرة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A man who wants to perform the Hajj (from Mecca) can perform the Tawaf around the Ka`ba as long as he is not in the state of Ihram till he assumes the Ihram for Hajj. Then, if he rides and proceeds to `Arafat, he should take a Hadi (i.e. animal for sacrifice), either a camel or a cow or a sheep, whatever he can afford; but if he cannot afford it, he should fast for three days during the Hajj before the day of `Arafat, but if the third day of his fasting happens to be the day of `Arafat (i.e. 9th of Dhul-Hijja) then it is no sin for him (to fast on it). Then he should proceed to `Arafat and stay there from the time of the `Asr prayer till darkness falls. Then the pilgrims should proceed from `Arafat, and when they have departed from it, they reach Jam' (i.e. Al-Muzdalifa) where they ask Allah to help them to be righteous and dutiful to Him, and there they remember Allah greatly or say Takbir (i.e. Allah is Greater) and Tahlil (i.e. None has the right to be worshipped but Allah) repeatedly before dawn breaks. Then, after offering the morning (Fajr) prayer you should pass on (to Mina) for the people used to do so and Allah said:-- \"Then depart from the place whence all the people depart. And ask for Allah's Forgiveness. Truly! Allah is Oft-Forgiving, Most Merciful.\" (2.199) Then you should go on doing so till you throw pebbles over the Jamra.",
      "chain": [
        "30161",
        "20271",
        "11106",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "4986",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أحمد بن المقدام، حدثنا الفضيل بن سليمان، حدثنا أبو حازم، حدثنا سهل بن سعد  رضى الله عنه  قال رأيت رسول الله صلى الله عليه وسلم قال بإصبعيه هكذا بالوسطى والتي تلي الإبهام ‏\"‏ بعثت والساعة كهاتين ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     I saw Allah's Apostle pointing with his index and middle fingers, saying. \"The time of my Advent and the Hour are like these two fingers.\" The Great Catastrophe will overwhelm everything.",
      "chain": [
        "30121",
        "20271",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "5187",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا أحمد بن المقدام، حدثنا فضيل بن سليمان، حدثنا أبو حازم، حدثنا سهل بن سعد، كنا عند النبي صلى الله عليه وسلم جلوسا فجاءته امرأة تعرض نفسها عليه فخفض فيها النظر ورفعه فلم يردها، فقال رجل من أصحابه زوجنيها يا رسول الله‏.‏ قال ‏\"‏ أعندك من شىء ‏\"‏‏.‏ قال ما عندي من شىء‏.‏ قال ‏\"‏ ولا خاتما من حديد ‏\"‏‏.‏ قال ولا خاتما من حديد ولكن أشق بردتي هذه فأعطيها النصف، وآخذ النصف‏.‏ قال ‏\"‏ لا، هل معك من القرآن شىء ‏\"‏‏.‏ قال نعم‏.‏ قال ‏\"‏ اذهب فقد زوجتكها بما معك من القرآن ‏\"‏‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     While we were sitting in the company of the Prophet a woman came to him and presented herself (for marriage) to him. The Prophet looked at her, lowering his eyes and raising them, but did not give a reply. One of his companions said, \"Marry her to me O Allah's Apostle!\" The Prophet asked (him), \"Have you got anything?\" He said, \"I have got nothing.\" The Prophet said, \"Not even an iron ring?\" He Sa`d, \"Not even an iron ring, but I will tear my garment into two halves and give her one half and keep the other half.\" The Prophet; said, \"No. Do you know some of the Qur'an (by heart)?\" He said, \"Yes.\" The Prophet said, \"Go, I have agreed to marry her to you with what you know of the Qur'an (as her Mahr).\" 'And for those who have no courses (i.e. they are still immature). (65.4) And the 'Iddat for the girl before puberty is three months (in the above Verse).",
      "chain": [
        "30121",
        "20271",
        "11172"
      ]
    },
    {
      "hadith_no": "5998",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني أحمد بن المقدام، حدثنا فضيل بن سليمان، حدثنا منصور بن عبد الرحمن، قال حدثتني أمي، عن أسماء بنت أبي بكر  رضى الله عنهما  أن امرأة، جاءت إلى رسول الله صلى الله عليه وسلم فقالت إني أنكحت ابنتي، ثم أصابها شكوى فتمرق رأسها، وزوجها يستحثني بها أفأصل رأسها فسب رسول الله صلى الله عليه وسلم الواصلة والمستوصلة‏.‏",
      "text_en": " Narrated Asma:                     (the daughter of Abu' Bakr) A woman came to Allah's Apostle and said, \"I married my daughter to someone, but she became sick and all her hair fell out, and (because of that) her husband does not like her. May I let her use false hair?\" On that the Prophet cursed such a lady as artificially lengthening (her or someone else's) hair or got her hair lengthened artificially.",
      "chain": [
        "30121",
        "20271",
        "11565",
        "2802",
        "70"
      ]
    },
    {
      "hadith_no": "6490",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني أحمد بن المقدام، حدثنا الفضيل بن سليمان، حدثنا أبو حازم، حدثنا سهل بن سعد الساعدي، كنا مع رسول الله صلى الله عليه وسلم في الخندق وهو يحفر ونحن ننقل التراب ويمر بنا فقال ‏\"‏ اللهم لا عيش إلا عيش الآخره، فاغفر للأنصار والمهاجره ‏\"‏‏.‏ تابعه سهل بن سعد عن النبي صلى الله عليه وسلم مثله‏.‏",
      "text_en": " Narrated Sahl bin Sa`d As-Sa`idi:                     We were in the company of Allah's Apostle in (the battle of) Al-Khandaq, and he was digging the trench while we were carrying the earth away. He looked at us and said, \"O Allah! There is no life worth living except the life of the Hereafter, so (please) forgive the Ansar and the Emigrants.\"",
      "chain": [
        "30121",
        "20271",
        "11172"
      ]
    },
    {
      "hadith_no": "6631",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا معاذ بن أسد، أخبرنا الفضل بن موسى، أخبرنا الفضيل، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ما بين منكبى الكافر مسيرة ثلاثة أيام للراكب المسرع‏\"‏.‏",
      "text_en": "      Narrated Abu Huraira:                          The Prophet said, \"The width between the two shoulders of a Kafir      (disbeliever) will be equal to the distance covered by a fast rider in     three days.\"",
      "chain": [
        "30176",
        "20452",
        "20271",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "6790",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا فضيل بن سليمان، حدثنا موسى بن عقبة، حدثنا حكيم بن أبي حرة الأسلمي، أنه سمع عبد الله بن عمر  رضى الله عنهما  سئل عن رجل، نذر أن لا، يأتي عليه يوم إلا صام، فوافق يوم أضحى أو فطر‏.‏ فقال لقد كان لكم في رسول الله أسوة حسنة، لم يكن يصوم يوم الأضحى والفطر، ولا يرى صيامهما‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     that he was asked about a man who had vowed that he would fast all the days of his life then the day of `Id al Adha or `Id-al-Fitr came. `Abdullah bin `Umar said: You have indeed a good example in Allah's Apostle. He did not fast on the day of `Id al Adha or the day of `Id-al-Fitr, and we do not intend fasting on these two days.",
      "chain": [
        "30161",
        "20271",
        "11106",
        "11687",
        "18"
      ]
    },
    {
      "hadith_no": "6934",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا عمرو بن علي، حدثنا فضيل بن سليمان، حدثنا مسلم بن أبي مريم، حدثني عبد الرحمن بن جابر، عمن سمع النبي صلى الله عليه وسلم قال ‏\"‏ لا عقوبة فوق عشر ضربات إلا في حد من حدود الله ‏\"‏‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Jabir:                     On the authority of others, that the Prophet said, \"No Punishment exceeds the flogging of the ten stripes, except if one is guilty of a crime necessitating a legal punishment prescribed by Allah.\"",
      "chain": [
        "30153",
        "20271",
        "11540",
        "11192"
      ]
    },
    {
      "hadith_no": "7125",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا فضيل بن سليمان، حدثنا موسى، حدثني سالم بن عبد الله، عن عبد الله بن عمر  رضى الله عنهما  في رؤيا النبي صلى الله عليه وسلم في المدينة ‏\"‏ رأيت امرأة سوداء ثائرة الرأس، خرجت من المدينة، حتى نزلت بمهيعة، فتأولتها أن وباء المدينة نقل إلى مهيعة، وهى الجحفة ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     concerning the dream of the Prophet in Medina: The Prophet said, \"I saw (in a dream) a black woman with unkempt hair going out of Medina and settling at Mahai'a. I interpreted that as (a symbol of) the epidemic of Medina being transferred to Mahai'a, namely, Al-Juhfa.\"",
      "chain": [
        "30161",
        "20271",
        "20040",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "7431",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عبد الرحمن بن المبارك، حدثنا الفضيل، حدثنا موسى بن عقبة، حدثني سالم بن عبد الله، عن أبيه، عن النبي صلى الله عليه وسلم أنه أري وهو في معرسه بذي الحليفة فقيل له إنك ببطحاء مباركة‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Prophet had a dream in the last portion of the night when he was sleeping at Dhul-Hulaifa. (I n the dream) it was said to him, \"You are in a blessed Batha' (i.e., valley).",
      "chain": [
        "30147",
        "20271",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "7486",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عبد الله بن مسلمة، حدثنا فضيل، عن منصور، عن إبراهيم، عن همام، عن عدي بن حاتم، قال سألت النبي صلى الله عليه وسلم قلت أرسل كلابي المعلمة‏.‏ قال ‏\"‏ إذا أرسلت كلابك المعلمة وذكرت اسم الله فأمسكن فكل، وإذا رميت بالمعراض فخزق فكل ‏\"‏‏.‏",
      "text_en": " Narrated `Adi bin Hatim:                     I asked the Prophet, \"I send off (for a game) my trained hunting dogs; (what is your verdict concerning the game they hunt?\" He said, \"If you send off your trained hunting dogs and mention the Name of Allah, then, if they catch some game, eat (thereof). And if you hit the game with a mi'rad (a hunting tool) and it wounds it, you can eat (it).",
      "chain": [
        "20164",
        "20271",
        "11067",
        "11051",
        "11447",
        "212"
      ]
    },
    {
      "hadith_no": "26",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "حدثنا حسن بن الربيع، حدثنا حماد بن زيد، عن أيوب، وهشام، عن محمد، وحدثنا فضيل، عن هشام، قال وحدثنا مخلد بن حسين، عن هشام، عن محمد بن سيرين، قال إن هذا العلم دين فانظروا عمن تأخذون دينكم ‏.‏",
      "text_en": "",
      "chain": [
        "20022",
        "11015",
        "11065",
        "11035",
        "20271",
        "11065",
        "11065",
        "11035"
      ]
    },
    {
      "hadith_no": "277",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن بشار، حدثنا أبو داود، حدثنا شعبة، عن أبان بن تغلب، عن فضيل، عن إبراهيم، عن علقمة، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يدخل الجنة من كان في قلبه مثقال ذرة من كبر ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of 'Abdullah that the Apostle of Allah (may peace be upon him) observed:                      He who as in his heart the weight of a mustard seed of pride shall not enter Paradise.",
      "chain": [
        "30160",
        "30002",
        "20020",
        "20577",
        "20271",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "2586",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا عبيد الله بن عمر القواريري، حدثنا فضيل بن سليمان، حدثنا أبو حازم، حدثنا سهل بن سعد، قال لما نزلت هذه الآية ‏{‏ وكلوا واشربوا حتى يتبين لكم الخيط الأبيض من الخيط الأسود‏}‏ قال كان الرجل يأخذ خيطا أبيض وخيطا أسود فيأكل حتى يستبينهما حتى أنزل الله عز وجل ‏{‏ من الفجر‏}‏ فبين ذلك ‏.‏",
      "text_en": " Sahl b. Sa'd said that when this verse was revealed:                     \" Eat and drink till the white streak is distinct from the dark streak,\" a person would take hold of a white thread and a black thread and keep on eating till he could find them distinct (in the light of the dawn). It was then that Allah, the Majestic and Great, reveiled (the words) min al-fajr (from the dawn), and then it became clear (that the word khait refers to the streak of light in the dawn).",
      "chain": [
        "30024",
        "20271",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "2915",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أحمد بن عبدة الضبي، حدثنا فضيل بن سليمان النميري، حدثنا أبو حازم، عن عبد الله بن أبي قتادة، عن أبيه، - رضى الله عنه - أنهم خرجوا مع رسول الله صلى الله عليه وسلم وهم محرمون وأبو قتادة محل ‏.‏ وساق الحديث وفيه فقال ‏\"‏ هل معكم منه شىء ‏\"‏ ‏.‏ قالوا معنا رجله ‏.‏ قال فأخذها رسول الله صلى الله عليه وسلم فأكلها ‏.‏",
      "text_en": " 'Abdullah b. Abu Qatada reported on the authority of his father (Allah be pleased with him) that they went out with the Messenger of Allah (may peace be upon him) and they were Muhrim except Abu Qatada. The rest of the hadith Is the same (but with the exception of these words):                     \" He (the Holy Prophet) said: 15 there any- thing out of it? They said: We have its leg with us. The Messenger of Allah (may peace be upon him) took it and ate it.\"",
      "chain": [
        "30423",
        "20271",
        "11172",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "3026",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا جرير، عن فضيل، عن زبيد، عن إبراهيم التيمي، عن أبيه، قال قال أبو ذر رضى الله عنه لا تصلح المتعتان إلا لنا خاصة ‏.‏ يعني متعة النساء ومتعة الحج ‏.‏",
      "text_en": " Abu Dharr (Allah be pleased with him) said:                      Two are the Mut'as which were not permissible but only for us, i. e. temporary marriage with women and Tamattu' in Hajj.",
      "chain": [
        "30367",
        "20028",
        "20271",
        "11335",
        "11322",
        "11405",
        "23"
      ]
    },
    {
      "hadith_no": "7629",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو بكر بن النضر بن أبي النضر، حدثني أبو النضر، هاشم بن القاسم حدثنا عبيد الله الأشجعي، عن سفيان الثوري، عن عبيد المكتب، عن فضيل، عن الشعبي، عن أنس بن مالك، قال كنا عند رسول الله صلى الله عليه وسلم فضحك فقال ‏\"‏ هل تدرون مم أضحك ‏\"‏ ‏.‏ قال قلنا الله ورسوله أعلم ‏.‏ قال ‏\"‏ من مخاطبة العبد ربه يقول يا رب ألم تجرني من الظلم قال يقول بلى ‏.‏ قال فيقول فإني لا أجيز على نفسي إلا شاهدا مني قال فيقول كفى بنفسك اليوم عليك شهيدا وبالكرام الكاتبين شهودا - قال - فيختم على فيه فيقال لأركانه انطقي ‏.‏ قال فتنطق بأعماله - قال - ثم يخلى بينه وبين الكلام - قال - فيقول بعدا لكن وسحقا ‏.‏ فعنكن كنت أناضل ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported:                      We were in the company of Allah's Messenger (way peace be upon him) that he smiled and said: Do you know why I laughed? We said: Allah and His Messenger, know best. Thereupon he said: It was because of the (fact that there came to my mind the) talk which the servant would have with his Lord. (on the Day of judgment). He would say: My Lord, have you not guaranteed me protection against injustice? He would say: Yes. Then the servant would say: I do not deem valid any witness against me but my own self, and He would say: Well, enough would he the witness of your self against you and that of the two angels who had been appointed to record your deeds. Then the seal would be set upon his mouth and it would be said to his hands and feet to speak and they would speak of his deeds. Then the mouth would be made free to talk, he would say (to the bands and feet): Be away, let there be curse of Allah upon you. It was for your safety that I contended.",
      "chain": [
        "30528",
        "20390",
        "20338",
        "20012",
        "20271",
        "11052",
        "19"
      ]
    },
    {
      "hadith_no": "2732",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا مسدد، ويحيى بن معين، قالا حدثنا يحيى، عن مالك، عن الفضيل، عن عبد الله بن نيار، عن عروة، عن عائشة، قال يحيى أن رجلا، من المشركين لحق بالنبي صلى الله عليه وسلم ليقاتل معه فقال ‏\"‏ ارجع ‏\"‏ ‏.‏ ثم اتفقا فقال ‏\"‏ إنا لا نستعين بمشرك ‏\"‏ ‏.‏",
      "text_en": " A’ishah said (this is the version of narrator Yahya). A man from the polytheists accompanied the Prophet (ﷺ) to fight along with him. He said “Go back. Both the narrators (Musaddad and Yahya) then agreed. The Prophet said “We do not want any help from a polytheist.”",
      "chain": [
        "30175",
        "30020",
        "20031",
        "20001",
        "20271",
        "10511",
        "53",
        "20031"
      ]
    },
    {
      "hadith_no": "3571",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا نصر بن علي، أخبرنا فضيل بن سليمان، حدثنا عمرو بن أبي عمرو، عن سعيد المقبري، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من ولي القضاء فقد ذبح بغير سكين ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Hurayrah:                     The Prophet (ﷺ) said: He who has been appointed a judge has been killed without a knife.",
      "chain": [
        "30395",
        "20271",
        "11209",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "1325",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا الفضيل بن سليمان، عن عمرو بن أبي عمرو، عن سعيد المقبري، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من ولي القضاء أو جعل قاضيا بين الناس فقد ذبح بغير سكين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏ وقد روي أيضا من غير هذا الوجه عن أبي هريرة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (ﷺ) said:                      \"Whoever takes the responsibility of judge, or is appointed as judge between the people, then he has been slaughtered without a knife.\"",
      "chain": [
        "30395",
        "20271",
        "11209",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "3137",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "قال حدثنا هريم، حدثنا فضيل، عن ليث، عن طاوس، قال تفضلان على كل سورة في القرآن بسبعين حسنة ‏.‏",
      "text_en": "",
      "chain": [
        "20271",
        "20023",
        "11053"
      ]
    },
    {
      "hadith_no": "4229",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن عبد الله بن بزيع، حدثنا الفضيل بن سليمان، حدثنا أبو حازم، عن سهل بن سعد، قال كنا مع رسول الله صلى الله عليه وسلم وهو يحفر الخندق ونحن ننقل التراب فيمر بنا فقال ‏\"‏ اللهم لا عيش إلا عيش الآخرة فاغفر للأنصار والمهاجرة ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏ وأبو حازم اسمه سلمة بن دينار الأعرج الزاهد ‏.‏ قال وفي الباب عن أنس بن مالك ‏.‏",
      "text_en": " Narrated Sahl bin Sa'd:                     \"We were with the Messenger of Allah (ﷺ) while he was excavating the trench, and we were transporting the soil. He passed by us and said: 'O Allah! There is no life but the life of the Hereafter! So forgive the Ansar and the Emigrants.'\"",
      "chain": [
        "30448",
        "20271",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "4305",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن موسى البصري، حدثنا الفضيل بن سليمان، عن عبد الله بن عثمان بن خثيم، حدثنا سعيد بن جبير، وأبو الطفيل، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم لمكة ‏\"‏ ما أطيبك من بلد وأحبك إلى ولولا أن قومي أخرجوني منك ما سكنت غيرك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     that the Messenger of Allah (ﷺ) said about Makkah: \"How sweet of a land you are and how dear you are to me, and if it were not that my people expelled me from you, I would not have lived in other than you.\"",
      "chain": [
        "38602",
        "20271",
        "10644",
        "11050",
        "3660",
        "17"
      ]
    },
    {
      "hadith_no": "1027",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الفضيل، عن الأعمش، عن عمارة بن عمير، عن أبي معمر، عن أبي مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تجزئ صلاة لا يقيم الرجل فيها صلبه في الركوع والسجود ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Mas'ud said:                     \"The Messenger of Allah (ﷺ) said: 'The prayer is not valid if a man does not bring his backbone to rest while bowing and prostrating.'\"",
      "chain": [
        "30367",
        "20271",
        "11060",
        "11378",
        "11360",
        "402"
      ]
    },
    {
      "hadith_no": "2521",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا محمد بن معدان بن عيسى، قال حدثنا الحسن، حدثنا زهير، حدثنا موسى، ح قال وأنبأنا محمد بن عبد الله بن بزيع، قال حدثنا الفضيل، قال حدثنا موسى، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم أمر بصدقة الفطر أن تؤدى قبل خروج الناس إلى الصلاة ‏.‏ قال ابن بزيع بزكاة الفطر ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     the Messenger of Allah enjoined that Sadaqatul Fitr should be given before the people go out to pray. (One of the narratorsP: Ibn Bazi'said: \"Zakatul-Fitr.\"",
      "chain": [
        "38591",
        "11016",
        "20321",
        "20040",
        "30448",
        "20271",
        "20040",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3615",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا الفضيل، عن عبيد الله، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما حق امرئ مسلم له شىء يوصى فيه أن يبيت ليلتين إلا ووصيته مكتوبة عنده ‏\"‏‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                      \"The Messenger of Allah said: 'It is not befitting for a Muslim who has anything concerning which a will should be made, to abide for two nights without having a written will with him.'\"",
      "chain": [
        "30367",
        "20271",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3908",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن عبد الله بن بزيع، قال حدثنا فضيل، قال حدثنا موسى بن عقبة، قال أخبرني نافع، أن رافع بن خديج، أخبر عبد الله بن عمر، أن عمومته، جاءوا إلى رسول الله صلى الله عليه وسلم ثم رجعوا فأخبروا أن رسول الله صلى الله عليه وسلم نهى عن كراء المزارع‏.‏‏ فقال عبد الله قد علمنا أنه كان كل صاحب مزرعة يكريها على عهد رسول الله صلى الله عليه وسلم على أن له ما على الربيع الساقي الذي يتفجر منه الماء وطائفة من التبن لا أدري كم هي‏.‏‏ رواه ابن عون عن نافع فقال عن بعض عمومته‏.‏‏",
      "text_en": " Rafi bin Khadij told Abdullah bin Umar that his paternal uncles went to the Messenger of Allah, then they came back and told them that the Messenger of Allah had forbidden leasing arable land. Abdullah said:                      \"We knew that he owned some arable land that he leased at the time of the Messenger of Allah in return for whatever grew on the banks of the streams of water, and for a certain amount of straw, I do not know how much it was.\" Ibn Awn reported it from Nafi but he said: \"From some of his paternal uncles.\"",
      "chain": [
        "30448",
        "20271",
        "11106",
        "11014",
        "1986",
        "18"
      ]
    },
    {
      "hadith_no": "5668",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا أبو بكر بن علي، قال حدثنا سريج بن يونس، قال حدثنا يحيى بن عبد الملك، عن العلاء، - وهو ابن المسيب - عن فضيل، عن مجاهد، عن ابن عمر، قال من شرب الخمر فلم ينتش لم تقبل له صلاة مادام في جوفه أو عروقه منها شىء وإن مات مات كافرا وإن انتشى لم تقبل له صلاة أربعين ليلة وإن مات فيها مات كافرا ‏.‏ خالفه يزيد بن أبي زياد ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"Whoever drinks Khamr and does not get intoxicated, his Salah will not be accepted so long as any trace of it remains in his belly or his veins, and if he dies he will die a Kafir. If he becomes intoxicated his Salah will not be accepted for 40 nights, and if he dies during them, he will die a Kafir.\" (Sahih Mawquf)",
      "chain": [
        "30251",
        "11647",
        "20271",
        "11028",
        "18"
      ]
    },
    {
      "hadith_no": "2298",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا عبد ربه بن خالد النميري أبو المغلس، حدثنا الفضيل بن سليمان، عن موسى بن عقبة، حدثني إسحاق بن يحيى بن الوليد بن عبادة بن الصامت، عن عبادة بن الصامت، قال قضى رسول الله  صلى الله عليه وسلم  أن ثمر النخل لمن أبرها إلا أن يشترط المبتاع وأن مال المملوك لمن باعه إلا أن يشترط المبتاع ‏.‏",
      "text_en": " It was narrated that 'Ubadah bin Samit said:                     \"The Messenger of Allah (ﷺ) ruled that the fruit of a palm tree belongs to the one who pollinated it, and that the wealth of a slave belongs to the one who sold him, unless the purchaser stipulated a condition.\"",
      "chain": [
        "20271",
        "11106",
        "40"
      ]
    },
    {
      "hadith_no": "2340",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا عبد ربه بن خالد النميري أبو المغلس، حدثنا فضيل بن سليمان، حدثنا موسى بن عقبة، حدثنا إسحاق بن يحيى بن الوليد، عن عبادة بن الصامت، أن رسول الله صلى الله عليه وسلم قضى أن ‏\"‏ لا ضرر ولا ضرار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ubadah bin Samit that the Messenger of Allah (ﷺ) ruled:                     “There should be neither harming nor reciprocating harm.”",
      "chain": [
        "20271",
        "11106",
        "40"
      ]
    },
    {
      "hadith_no": "2577",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو المغلس، حدثنا فضيل بن سليمان، حدثنا موسى بن عقبة، عن إسحاق بن يحيى بن الوليد، عن عبادة بن الصامت، أن رسول الله صلى الله عليه وسلم قضى في شرب النخل من السيل أن الأعلى فالأعلى يشرب قبل الأسفل ويترك الماء إلى الكعبين ثم يرسل الماء إلى الأسفل الذي يليه وكذلك حتى تنقضي الحوائط أو يفنى الماء ‏.‏",
      "text_en": " It was narrated from 'Ubadah bin Samit that :                     the Messenger of Allah (ﷺ) ruled concerning the irrigation of palm trees from streams, that the higher ground should be irrigated before the lower, and that the water should be allowed to reach the ankles, then released to flow the nearest lower ground, and so on, until all the fields were watered or until the water ran out.",
      "chain": [
        "20271",
        "11106",
        "40"
      ]
    },
    {
      "hadith_no": "2582",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا عبد ربه بن خالد النميري أبو المغلس، حدثنا الفضيل بن سليمان، حدثنا موسى بن عقبة، أخبرني إسحاق بن يحيى بن الوليد، عن عبادة بن الصامت، أن رسول الله صلى الله عليه وسلم قضى في النخلة والنخلتين والثلاثة للرجل في النخل فيختلفون في حقوق ذلك فقضى أن لكل نخلة من أولئك من الأرض مبلغ جريدها حريم لها ‏.‏",
      "text_en": " It was narrated from 'Ubadah bin Samit that :                     the Messenger of Allah (ﷺ) ruled concerning one, two or three date palms belonging to a man among other palm trees - when they differ concerning entitlement to the surrounding land. He ruled that the land around each of those trees, as far as their leaves reach, measured from the bottom of the tree, belongs to the owner of the tree.",
      "chain": [
        "20271",
        "11106",
        "40"
      ]
    },
    {
      "hadith_no": "2745",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا عبد ربه بن خالد النميري، حدثنا الفضيل بن سليمان، حدثنا موسى بن عقبة، عن إسحاق بن يحيى بن الوليد، عن عبادة بن الصامت، أن النبي صلى الله عليه وسلم قضى لحمل بن مالك الهذلي اللحياني بميراثه من امرأته التي قتلتها امرأته الأخرى ‏.‏",
      "text_en": " It was narrated from 'Ubadah bin Samit:                     That the Prophet (ﷺ) ruled that Hamal bin Malik Hudhali Al-Lihyani should inherit from his wife who was killed by his other wife.",
      "chain": [
        "20271",
        "11106",
        "40"
      ]
    },
    {
      "hadith_no": "2777",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا عبد ربه بن خالد النميري، حدثنا فضيل بن سليمان، حدثني موسى بن عقبة، حدثني إسحاق بن يحيى بن الوليد، عن عبادة بن الصامت، قال قضى رسول الله صلى الله عليه وسلم أن المعدن جبار والبئر جبار والعجماء جرحها جبار ‏.‏ والعجماء البهيمة من الأنعام وغيرها ‏.‏ والجبار هو الهدر الذي لا يغرم ‏.‏",
      "text_en": " It was narrated that 'Ubadah bin Samit said:                     “The Messenger of Allah (ﷺ) ruled that there is no liability for injuries caused by falling into a mines or a well, nor those caused by a beast.”",
      "chain": [
        "20271",
        "11106",
        "40"
      ]
    }
  ],
  "total_hadiths": 46
}