{
  "id": "20280",
  "name": "Muhammad bin 'Abdullah al-Ansari محمد بن عبد الله بن المثني - الأنصاري",
  "full_name": "Muhammad bin 'Abdullah al-Ansari محمد بن عبد الله بن المثني - الأنصاري",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "112",
      "date_gregorian": "NA",
      "date_display": [
        "112 AH"
      ],
      "place": "Basra"
    },
    "death": {
      "date_hijri": "215",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Basra",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Qadhi(Judge)",
      "Fiqh",
      "Hadith"
    ],
    "tags": [
      "Ansar",
      "Khazraj",
      "Judge",
      "al-Basri",
      "Imam"
    ]
  },
  "parents": [
    {
      "id": "11599",
      "name": "'Abdullah bin al-Muthna عبد الله بن المثنى",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11599",
      "name": "'Abdullah bin al-Muthna عبد الله بن المثنى",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11071",
      "name": "'Abdullah bin 'Awn bin Artaban عبد الله بن عون بن أرطبان الخزار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11275",
      "name": "Habib bin al-Shaheed al-Azdi حبيب بن الشهيد الأزدي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20724",
      "name": "'Abdur Rahman bin 'Abdullah bin 'Utba عبد الرحمن بن عبد الله بن عتبة المسعودي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "19838",
      "name": "Ash'th bin 'Abdul Malik أشعث بن عبد الملك الحمراني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11286",
      "name": "Sa'id bin Iyas al-Jariri سعيد بن إياس الجريري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11073",
      "name": "Sa'id bin Abi 'Aruba سعيد بن أبي عروبة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11311",
      "name": "Hisham bin Hassan al-Azdi هشام بن حسان الأزدي القردوسي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30397",
      "name": "Yahya bin Ja'far bin A'yn al-Baykandi يحيى بن جعفر بن أعين الأزدي - البيكندي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30132",
      "name": "Khalifa bin Khayyat bin Khalifa خليفة بن خياط بن خليفة بن خياط",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30160",
      "name": "Muhammad bin Bashar Bindar محمد بن بشار بندار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30245",
      "name": "al-Hasan bin Muhammad al-Za'farani الحسن بن محمد الصباح الزعفراني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "34188",
      "name": "Muhammad bin Isma'il bin Ibrahim محمد بن إسماعيل بن إبراهيم بن مقسم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30270",
      "name": "Muhammad bin 'Abdullah محمد بن عبد الله بن إسماعيل بن أبي الثلج",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38487",
      "name": "Muhammad bin Hatm bin Sulaiman محمد بن حاتم بن سليمان الزمي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38496",
      "name": "Muhammad bin Khalid bin محمد بن خالد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "34278",
      "name": "al-Walid bin 'Amr bin al-Skyn الوليد بن عمرو بن السكين",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "34263",
      "name": "Muslim bin Hatm مسلم بن حاتم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30153",
      "name": "'Amr bin 'Ali bin Bahr al-Bahli عمرو بن علي بن بحر الباهلي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20296",
      "name": "Hisham bin 'Abdul Malik al-Tayalasi هشام بن عبد الملك أبو الوليد الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30212",
      "name": "Muhammad bin 'Abdullah bin Numayr محمد بن عبد الله بن نمير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "39144",
      "name": "Isma'il bin Ishaq bin Isma'il إسماعيل بن إسحاق",
      "grade": "3rd Century AH"
    },
    {
      "id": "34140",
      "name": "'Abdul Malik bin Muhammad bin 'Abdullah عبد الملك بن محمد أبو قلابة الرقاشي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "34137",
      "name": "'Abdul 'Aziz bin Mua'wiya عبد العزيز بن معاوية بن عبد الله",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36621",
      "name": "Muhammad bin Isma'il bin Yusuf محمد بن إسماعيل بن يوسف",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1010",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا الحسن بن محمد، قال حدثنا محمد بن عبد الله الأنصاري، قال حدثني أبي عبد الله بن المثنى، عن ثمامة بن عبد الله بن أنس، عن أنس، أن عمر بن الخطاب  رضى الله عنه  كان إذا قحطوا استسقى بالعباس بن عبد المطلب فقال اللهم إنا كنا نتوسل إليك بنبينا فتسقينا وإنا نتوسل إليك بعم نبينا فاسقنا‏.‏ قال فيسقون‏.‏",
      "text_en": " Narrated Anas:                     Whenever drought threatened them, `Umar bin Al-Khattab, used to ask Al-Abbas bin `Abdul Muttalib to invoke Allah for rain. He used to say, \"O Allah! We used to ask our Prophet to invoke You for rain, and You would bless us with rain, and now we ask his uncle to invoke You for rain. O Allah ! Bless us with rain.\"(1) And so it would rain.",
      "chain": [
        "30245",
        "20280",
        "11270",
        "19",
        "3"
      ]
    },
    {
      "hadith_no": "1473",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عبد الله الأنصاري، قال حدثني أبي قال، حدثني ثمامة، أن أنسا  رضى الله عنه  حدثه أن أبا بكر  رضى الله عنه  كتب له التي فرض رسول الله صلى الله عليه وسلم ‏\"‏ ولا يجمع بين متفرق، ولا يفرق بين مجتمع، خشية الصدقة ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Abu Bakr wrote to me what was made compulsory by Allah's Apostle and that was (regarding the payments of Zakat): Neither the property of different people may be taken together nor the joint property may be split for fear of (paying more, or receiving less) Zakat.",
      "chain": [
        "20280",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "2703",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا محمد بن عبد الله الأنصاري، قال حدثني حميد، أن أنسا، حدثهم أن الربيع  وهى ابنة النضر  كسرت ثنية جارية، فطلبوا الأرش وطلبوا العفو، فأبوا فأتوا النبي صلى الله عليه وسلم فأمرهم بالقصاص‏.‏ فقال أنس بن النضر أتكسر ثنية الربيع يا رسول الله لا والذي بعثك بالحق لا تكسر ثنيتها فقال ‏\"‏ يا أنس كتاب الله القصاص ‏\"‏‏.‏ فرضي القوم وعفوا فقال النبي صلى الله عليه وسلم ‏\"‏ إن من عباد الله من لو أقسم على الله لأبره ‏\"‏‏.‏ زاد الفزاري عن حميد عن أنس فرضي القوم وقبلوا الأرش‏.‏",
      "text_en": " Narrated Anas:                     Ar-Rabi, the daughter of An-Nadr broke the tooth of a girl, and the relatives of Ar-Rabi` requested the girl's relatives to accept the Irsh (compensation for wounds etc.) and forgive (the offender), but they refused. So, they went to the Prophet who ordered them to bring about retaliation. Anas bin An-Nadr asked, \"O Allah\"; Apostle! Will the tooth of Ar-Rabi` be broken? No, by Him Who has sent you with the Truth, her tooth will not be broken.\" The Prophet said, \"O Anas! Allah\"; law ordains retaliation.\" Later the relatives of the girl agreed and forgave her. The Prophet said, \"There are some of Allah's slaves who, if they take an oath by Allah, are responded to by Allah i.e. their oath is fulfilled). Anas added, \"The people agreed and accepted the Irsh.\"",
      "chain": [
        "20280",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "2737",
      "source": " Sahih Bukhari ",
      "chapter": "Conditions - كتاب الشروط",
      "chapter_no": "54",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا محمد بن عبد الله الأنصاري، حدثنا ابن عون، قال أنبأني نافع، عن ابن عمر  رضى الله عنهما  أن عمر بن الخطاب، أصاب أرضا بخيبر، فأتى النبي صلى الله عليه وسلم يستأمره فيها، فقال يا رسول الله، إني أصبت أرضا بخيبر، لم أصب مالا قط أنفس عندي منه، فما تأمر به قال ‏\"‏ إن شئت حبست أصلها، وتصدقت بها ‏\"‏‏.‏ قال فتصدق بها عمر أنه لا يباع ولا يوهب ولا يورث، وتصدق بها في الفقراء وفي القربى، وفي الرقاب، وفي سبيل الله، وابن السبيل، والضيف، لا جناح على من وليها أن يأكل منها بالمعروف، ويطعم غير متمول‏.‏ قال فحدثت به ابن سيرين فقال غير متأثل مالا‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Umar bin Khattab got some land in Khaibar and he went to the Prophet to consult him about it saying, \"O Allah's Apostle I got some land in Khaibar better than which I have never had, what do you suggest that I do with it?\" The Prophet said, \"If you like you can give the land as endowment and give its fruits in charity.\" So `Umar gave it in charity as an endowment on the condition that would not be sold nor given to anybody as a present and not to be inherited, but its yield would be given in charity to the poor people, to the Kith and kin, for freeing slaves, for Allah's Cause, to the travelers and guests; and that there would be no harm if the guardian of the endowment ate from it according to his need with good intention, and fed others without storing it for the future.\"",
      "chain": [
        "30367",
        "20280",
        "11071",
        "18"
      ]
    },
    {
      "hadith_no": "3106",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا محمد بن عبد الله الأنصاري، قال حدثني أبي، عن ثمامة، عن أنس، أن أبا بكر  رضى الله عنه  لما استخلف بعثه إلى البحرين، وكتب له هذا الكتاب وختمه، وكان نقش الخاتم ثلاثة أسطر محمد سطر، ورسول سطر، والله سطر‏.‏",
      "text_en": " Narrated Anas:                     That when Abu Bakr became the Caliph, he sent him to Bahrain and wrote this letter for him, and stamped it with the Ring of the Prophet. Three lines were engraved on the Ring, (the word) 'Muhammad' was in a line, 'Apostle' was in another line, and 'Allah' in a third.",
      "chain": [
        "20280",
        "11599",
        "11270",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "3234",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمد بن عبد الله بن إسماعيل، حدثنا محمد بن عبد الله الأنصاري، عن ابن عون، أنبأنا القاسم، عن عائشة  رضى الله عنها  قالت من زعم أن محمدا رأى ربه فقد أعظم، ولكن قد رأى جبريل في صورته، وخلقه ساد ما بين الأفق‏.‏",
      "text_en": " Narrated Aisha:                     Whoever claimed that (the Prophet) Muhammad saw his Lord, is committing a great fault, for he only saw Gabriel in his genuine shape in which he was created covering the whole horizon.",
      "chain": [
        "20280",
        "11071",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "3280",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا يحيى بن جعفر، حدثنا محمد بن عبد الله الأنصاري، حدثنا ابن جريج، قال أخبرني عطاء، عن جابر  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا استجنح ‏{‏الليل‏}‏  أو كان جنح الليل  فكفوا صبيانكم، فإن الشياطين تنتشر حينئذ، فإذا ذهب ساعة من العشاء فحلوهم وأغلق بابك، واذكر اسم الله، وأطفئ مصباحك، واذكر اسم الله، وأوك سقاءك، واذكر اسم الله، وخمر إناءك، واذكر اسم الله، ولو تعرض عليه شيئا ‏\"‏‏.‏",
      "text_en": " Narrated Jabir:                     The Prophet said, \"When nightfalls, then keep your children close to you, for the devil spread out then. An hour later you can let them free; and close the gates of your house (at night), and mention Allah's Name thereupon, and cover your utensils, and mention Allah's Name thereupon, (and if you don't have something to cover your utensil) you may put across it something (e.g. a piece of wood etc.).",
      "chain": [
        "30397",
        "20280",
        "11070",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "3757",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا الحسن بن محمد، حدثنا محمد بن عبد الله الأنصاري، حدثني أبي عبد الله بن المثنى، عن ثمامة بن عبد الله بن أنس، عن أنس  رضى الله عنه أن عمر بن الخطاب، كان إذا قحطوا استسقى بالعباس بن عبد المطلب، فقال اللهم إنا كنا نتوسل إليك بنبينا صلى الله عليه وسلم فتسقينا، وإنا نتوسل إليك بعم نبينا فاسقنا‏.‏ قال فيسقون‏.‏",
      "text_en": " Narrated Anas:                     Whenever there was drought, `Umar bin Al-Khattab used to ask Allah for rain through Al-`Abbas bin `Abdul Muttalib, saying, \"O Allah! We used to request our Prophet to ask You for rain, and You would give us. Now we request the uncle of our Prophet to ask You for rain, so give us rain.\" And they would be given rain.\"",
      "chain": [
        "30245",
        "20280",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "4046",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني خليفة، حدثنا محمد بن عبد الله الأنصاري، حدثنا سعيد، عن قتادة، عن أنس  رضى الله عنه  قال مات أبو زيد ولم يترك عقبا، وكان بدريا‏.‏",
      "text_en": " Narrated Anas:                     Abu Zaid died and did not leave any offspring, and he was one of the Badr warriors.",
      "chain": [
        "30132",
        "20280",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "4540",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن عبد الله الأنصاري، حدثنا حميد، أن أنسا، حدثهم عن النبي صلى الله عليه وسلم قال ‏\"‏ كتاب الله القصاص ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"The prescribed Law of Allah is the equality in punishment (i.e. Al-Qisas).\" (In cases of murders, etc.)",
      "chain": [
        "20280",
        "11279"
      ]
    },
    {
      "hadith_no": "4597",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن عبد الله الأنصاري، قال حدثني أبي، عن ثمامة، عن أنس  رضى الله عنه  قال فجعلها لحسان وأبي، وأنا أقرب إليه، ولم يجعل لي منها شيئا‏.‏",
      "text_en": " Narrated Anas:                     Abu Talha distributed the garden between Hassan and Ubai, but he did not give me anything thereof although I was a nearer relative to him.",
      "chain": [
        "20280",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "4653",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا محمد بن عبد الله الأنصاري، حدثنا ابن عون، قال حدثني سلمان أبو رجاء، مولى أبي قلابة عن أبي قلابة، أنه كان جالسا خلف عمر بن عبد العزيز، فذكروا وذكروا فقالوا وقالوا قد أقادت بها الخلفاء، فالتفت إلى أبي قلابة وهو خلف ظهره، فقال ما تقول يا عبد الله بن زيد أو قال ما تقول يا أبا قلابة قلت ما علمت نفسا حل قتلها في الإسلام إلا رجل زنى بعد إحصان، أو قتل نفسا بغير نفس، أو حارب الله ورسوله صلى الله عليه وسلم‏.‏ فقال عنبسة حدثنا أنس بكذا وكذا‏.‏ قلت إياى حدث أنس قال قدم قوم على النبي صلى الله عليه وسلم فكلموه فقالوا قد استوخمنا هذه الأرض‏.‏ فقال ‏\"‏ هذه نعم لنا تخرج، فاخرجوا فيها، فاشربوا من ألبانها وأبوالها ‏\"‏‏.‏ فخرجوا فيها فشربوا من أبوالها وألبانها واستصحوا، ومالوا على الراعي فقتلوه، واطردوا النعم، فما يستبطأ من هؤلاء قتلوا النفس وحاربوا الله ورسوله، وخوفوا رسول الله صلى الله عليه وسلم‏.‏ فقال سبحان الله‏.‏ فقلت تتهمني قال حدثنا بهذا أنس‏.‏ قال وقال يا أهل كذا إنكم لن تزالوا بخير ما أبقي هذا فيكم أو مثل هذا‏.‏",
      "text_en": " Narrated Abu Qilaba:                     That he was sitting behind `Umar bin `Abdul `Aziz and the people mentioned and mentioned (about at-Qasama) and they said (various things), and said that the Caliphs had permitted it. `Umar bin `Abdul `Aziz turned towards Abu Qilaba who was behind him and said. \"What do you say, O `Abdullah bin Zaid?\" or said, \"What do you say, O Abu Qilaba?\" Abu Qilaba said, \"I do not know that killing a person is lawful in Islam except in three cases: a married person committing illegal sexual intercourse, one who has murdered somebody unlawfully, or one who wages war against Allah and His Apostle.\" 'Anbasa said, \"Anas narrated to us such-and-such.\" Abu Qilaba said, \"Anas narrated to me in this concern, saying, some people came to the Prophet and they spoke to him saying, 'The climate of this land does not suit us.' The Prophet said, 'These are camels belonging to us, and they are to be taken out to the pasture. So take them out and drink of their milk and urine.' So they took them and set out and drank of their urine and milk, and having recovered, they attacked the shepherd, killed him and drove away the camels.' Why should there be any delay in punishing them as they murdered (a person) and waged war against Allah and His Apostle and frightened Allah's Apostle ?\" Anbasa said, \"I testify the uniqueness of Allah!\" Abu Qilaba said, \"Do you suspect me?\" 'Anbasa said, \"No, Anas narrated that (Hadith) to us.\" Then 'Anbasa added, \"O the people of such-and-such (country), you will remain in good state as long as Allah keeps this (man) and the like of this (man) amongst you.\"",
      "chain": [
        "30026",
        "20280",
        "11071",
        "11592",
        "11047"
      ]
    },
    {
      "hadith_no": "4830",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمد بن بشار، حدثنا محمد بن عبد الله الأنصاري، قال حدثني أبي، عن ثمامة، عن أنس بن مالك  رضى الله عنه  قال نرى هذه الآية نزلت في أنس بن النضر ‏{‏من المؤمنين رجال صدقوا ما عاهدوا الله عليه‏}‏‏.‏",
      "text_en": " Narrated Anas:                     We think that the Verse: 'Among the Believers are men who have been true to their covenant with Allah.' was revealed in favor of Anas bin An-Nadir.",
      "chain": [
        "30160",
        "20280",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "5397",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "وقال الأنصاري حدثنا هشام، حدثتنا حفصة، حدثتني أم عطية، نهى النبي صلى الله عليه وسلم ‏\"‏ ولا تمس طيبا إلا أدنى طهرها إذا طهرت، نبذة من قسط وأظفار ‏\"‏‏.‏",
      "text_en": "",
      "chain": [
        "20280",
        "20295",
        "11039"
      ]
    },
    {
      "hadith_no": "5939",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني محمد بن عبد الله الأنصاري، قال حدثني أبي، عن ثمامة، عن أنس، أن أبا بكر  رضى الله عنه  لما استخلف كتب له، وكان نقش الخاتم ثلاثة أسطر‏.‏ محمد سطر، ورسول سطر، والله سطر‏.‏",
      "text_en": " Narrated Anas:                     that when Abu Bakr became the Caliph, he wrote a letter to him (and stamped it with the Prophet's ring) and the engraving of the ring was in three lines: Muhammad in one line, 'Apostle' in another line, and 'Allah' in a third line. Anas added: 'the ring of the Prophet was in his hand, and after him, in Abu Bakr's hand, and then in `Umar's hand after Abu Bakr. When `Uthman was the Caliph, once he was sitting at the well of Aris. He removed the ring from his hand and while he was trifling with it, dropped into the well. We kept on going to the well with `Uthman for three days looking for the ring, and finally the well was drained, but the ring was not found.",
      "chain": [
        "20280",
        "11599",
        "11270",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "5940",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "وزادني أحمد حدثنا الأنصاري، قال حدثني أبي، عن ثمامة، عن أنس، قال كان خاتم النبي صلى الله عليه وسلم في يده، وفي يد أبي بكر بعده، وفي يد عمر بعد أبي بكر، فلما كان عثمان جلس على بئر أريس  قال  فأخرج الخاتم، فجعل يعبث به فسقط قال فاختلفنا ثلاثة أيام مع عثمان فننزح البئر فلم نجده‏.‏",
      "text_en": "",
      "chain": [
        "20280",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "6355",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا محمد بن عبد الله الأنصاري، قال حدثني أبي، عن ثمامة، عن أنس، أن أم سليم، كانت تبسط للنبي صلى الله عليه وسلم نطعا فيقيل عندها على ذلك النطع  قال  فإذا نام النبي صلى الله عليه وسلم أخذت من عرقه وشعره، فجمعته في قارورة، ثم جمعته في سك  قال  فلما حضر أنس بن مالك الوفاة أوصى أن يجعل في حنوطه من ذلك السك  قال  فجعل في حنوطه‏.‏",
      "text_en": " Narrated Thumama:                     Anas said, \"Um Sulaim used to spread a leather sheet for the Prophet and he used to take a midday nap on that leather sheet at her home.\" Anas added, \"When the Prophet had slept, she would take some of his sweat and hair and collect it (the sweat) in a bottle and then mix it with Suk (a kind of perfume) while he was still sleeping. \"When the death of Anas bin Malik approached, he advised that some of that Suk be mixed with his Hanut (perfume for embalming the dead body), and it was mixed with his Hanut.",
      "chain": [
        "30367",
        "20280",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "6469",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا الأنصاري، حدثنا هشام بن حسان، حدثنا محمد بن سيرين، حدثنا عبيدة، حدثنا علي بن أبي طالب  رضى الله عنه  قال كنا مع النبي صلى الله عليه وسلم يوم الخندق، فقال ‏\"‏ ملأ الله قبورهم وبيوتهم نارا، كما شغلونا عن صلاة الوسطى حتى غابت الشمس ‏\"‏‏.‏ وهى صلاة العصر‏.‏",
      "text_en": " Narrated `Ali bin Abi Talib:                     We were in the company of the Prophet on the day (of the battle) of Al-Khandaq (the Trench). The Prophet said, \"May Allah fill their (the infidels') graves and houses with fire, as they have kept us so busy that we could not offer the middle prayer till the sun had set; and that prayer was the `Asr prayer.\"",
      "chain": [
        "30170",
        "20280",
        "11311",
        "11035",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "6978",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا الأنصاري، حدثنا حميد، عن أنس  رضى الله عنه  أن ابنة النضر، لطمت جارية، فكسرت ثنيتها، فأتوا النبي صلى الله عليه وسلم فأمر بالقصاص‏.‏",
      "text_en": " Narrated Anas:                     The daughter of An-Nadr slapped a girl and broke her incisor tooth. They (the relatives of that girl), came to the Prophet and he gave the order of Qisas (equality in punishment).",
      "chain": [
        "20280",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "7041",
      "source": " Sahih Bukhari ",
      "chapter": "Tricks - كتاب الحيل",
      "chapter_no": "91",
      "text_ar": "حدثنا محمد بن عبد الله الأنصاري، حدثنا أبي، حدثنا ثمامة بن عبد الله بن أنس، أن أنسا، حدثه أن أبا بكر كتب له فريضة الصدقة التي فرض رسول الله صلى الله عليه وسلم ‏\"‏ ولا يجمع بين متفرق ولا يفرق بين مجتمع خشية الصدقة ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     That Abu Bakr wrote for him, Zakat regulations which Allah's Apostle had made compulsory, and wrote that one should neither collect various portions (of the property) nor divide the property into various portions in order to avoid paying Zakat.",
      "chain": [
        "20280",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "349",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا محمد بن عبد الله الأنصاري، حدثنا هشام بن حسان، حدثنا حميد بن هلال، عن أبي بردة، عن أبي موسى الأشعري، ح  وحدثنا محمد بن المثنى، حدثنا عبد الأعلى، - وهذا حديثه - حدثنا هشام، عن حميد بن هلال، قال - ولا أعلمه إلا عن أبي بردة، - عن أبي موسى، قال اختلف في ذلك رهط من المهاجرين والأنصار فقال الأنصاريون لا يجب الغسل إلا من الدفق أو من الماء ‏.‏ وقال المهاجرون بل إذا خالط فقد وجب الغسل ‏.‏ قال قال أبو موسى فأنا أشفيكم من ذلك ‏.‏ فقمت فاستأذنت على عائشة فأذن لي فقلت لها يا أماه - أو يا أم المؤمنين - إني أريد أن أسألك عن شىء وإني أستحييك ‏.‏ فقالت لا تستحيي أن تسألني عما كنت سائلا عنه أمك التي ولدتك فإنما أنا أمك ‏.‏ قلت فما يوجب الغسل قالت على الخبير سقطت قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا جلس بين شعبها الأربع ومس الختان الختان فقد وجب الغسل ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported:                      There cropped up a difference of opinion between a group of Muhajirs (Emigrants and a group of Ansar (Helpers) (and the point of dispute was) that the Ansar said: The bath (because of sexual intercourse) becomes obligatory only-when the semen spurts out or ejaculates. But the Muhajirs said: When a man has sexual intercourse (with the woman), a bath becomes obligatory (no matter whether or not there is seminal emission or ejaculation). Abu Musa said: Well, I satisfy you on this (issue). He (Abu Musa, the narrator) said: I got up (and went) to 'A'isha and sought her permission and it was granted, and I said to her: 0 Mother, or Mother of the Faithful, I want to ask you about a matter on which I feel shy. She said: Don't feel shy of asking me about a thing which you can ask your mother, who gave you birth, for I am too your mother. Upon this I said: What makes a bath obligatory for a person? She replied: You have come across one well informed! The Messenger of Allah (may peace be upon him) said: When anyone sits amidst four parts (of the woman) and the circumcised parts touch each other a bath becomes obligatory.",
      "chain": [
        "30170",
        "20280",
        "11311",
        "11281",
        "11901",
        "41",
        "30170",
        "20246",
        "20295",
        "11281",
        "11901"
      ]
    },
    {
      "hadith_no": "52",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد بن عبد الله الأنصاري، حدثنا عنبسة بن سعيد الكوفي الحاسب، حدثني كثير، عن عائشة، أنها قالت كان نبي الله صلى الله عليه وسلم يستاك فيعطيني السواك لأغسله فأبدأ به فأستاك ثم أغسله وأدفعه إليه ‏.‏",
      "text_en": " 'Aishah narrated:                      \"The Prophet of Allah (ﷺ) would clean his teeth with the Siwak, then he would give me the Siwak in order to wash it. So I would first use it myself, then wash it and return it.",
      "chain": [
        "30160",
        "20280",
        "25221",
        "15476",
        "53"
      ]
    },
    {
      "hadith_no": "1299",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو توبة الربيع بن نافع، حدثنا محمد بن مهاجر، عن عروة بن، رويم حدثني الأنصاري، أن رسول الله صلى الله عليه وسلم قال لجعفر بهذا الحديث فذكر نحوهم قال في السجدة الثانية من الركعة الأولى كما قال في حديث مهدي بن ميمون ‏.‏",
      "text_en": " Narrated 'Urwah b. Ruwaim:                     That an al-Ansari narrated to him: The Messenger of Allah (ﷺ) said to Ja'far. He then narrated the tradition in like manner. This version has the words: \"In the second prostration of the first rak'ah\" in addition to the words transmitted by Mahdi b. Maimun (in the previous tradition).",
      "chain": [
        "30335",
        "20637",
        "20280"
      ]
    },
    {
      "hadith_no": "1561",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن بشار، حدثني محمد بن عبد الله الأنصاري، حدثنا صرد بن أبي المنازل، قال سمعت حبيبا المالكي، قال قال رجل لعمران بن حصين يا أبا نجيد إنكم لتحدثوننا بأحاديث ما نجد لها أصلا في القرآن ‏.‏ فغضب عمران وقال للرجل أوجدتم في كل أربعين درهما درهم ومن كل كذا وكذا شاة شاة ومن كل كذا وكذا بعيرا كذا وكذا أوجدتم هذا في القرآن قال لا ‏.‏ قال فعن من أخذتم هذا أخذتموه عنا وأخذناه عن نبي الله صلى الله عليه وسلم وذكر أشياء نحو هذا ‏.‏",
      "text_en": " Habib al-Maliki said:                      A man said to Imran ibn Husayn: AbuNujayd, you narrate to us traditions whose basis we do not find in the Qur'an. Thereupon, Imran got angry and said to the man: Do you find in the Qur'an that one dirham is due on forty dirhams (as Zakat), and one goat is due on such-and-such number of goats, and one camel will be due on such-and-such number of camels? He replied: No. He said: From whom did you take it? You took it from us, from the Messenger of Allah (ﷺ). He mentioned many similar things.",
      "chain": [
        "30160",
        "20280",
        "24210"
      ]
    },
    {
      "hadith_no": "4634",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا محمد بن عبد الله الأنصاري، حدثنا الأشعث، عن الحسن، عن أبي بكرة، أن النبي صلى الله عليه وسلم قال ذات يوم ‏\"‏ من رأى منكم رؤيا ‏\"‏ ‏.‏ فقال رجل أنا رأيت كأن ميزانا نزل من السماء فوزنت أنت وأبو بكر فرجحت أنت بأبي بكر ووزن عمر وأبو بكر فرجح أبو بكر ووزن عمر وعثمان فرجح عمر ثم رفع الميزان فرأينا الكراهية في وجه رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated AbuBakrah:                     One day the Prophet (ﷺ) said: Which of you had dream? A man said: It is I. I saw as though a scale descended from the sky. You and AbuBakr were weighed and you were heavier; AbuBakr and Umar were weighed and AbuBakr was heavier: Umar and Uthman were weighed and Umar was heavier; than the scale was taken up. we saw signs of dislike on the face of the Messenger of Allah (ﷺ).",
      "chain": [
        "30170",
        "20280",
        "485",
        "11016",
        "3229"
      ]
    },
    {
      "hadith_no": "4662",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا مسدد، ومسلم بن إبراهيم، قالا حدثنا حماد، عن علي بن زيد، عن الحسن، عن أبي بكرة، ح وحدثنا محمد بن المثنى، عن محمد بن عبد الله الأنصاري، قال حدثني الأشعث، عن الحسن، عن أبي بكرة، قال قال رسول الله صلى الله عليه وسلم للحسن بن علي ‏\"‏ إن ابني هذا سيد وإني أرجو أن يصلح الله به بين فئتين من أمتي ‏\"‏ ‏.‏ وقال في حديث حماد ‏\"‏ ولعل الله أن يصلح به بين فئتين من المسلمين عظيمتين ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuBakrah:                     The Messenger of Allah (ﷺ) said to al-Hasan ibn Ali. This son of mine is a Sayyid (chief), and I hope Allah may reconcile two parties of my community by means of him. Hammad's version has: And perhaps Allah may reconcile two large parties of Muslims by means of him.",
      "chain": [
        "30175",
        "20285",
        "20022",
        "10664",
        "11016",
        "3229",
        "30170",
        "20280",
        "485",
        "11016",
        "3229"
      ]
    },
    {
      "hadith_no": "153",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، عن مالك بن أنس، قال وحدثنا الأنصاري، حدثنا معن، حدثنا مالك، عن يحيى بن سعيد، عن عمرة، عن عائشة، قالت إن كان رسول الله صلى الله عليه وسلم ليصلي الصبح فينصرف النساء قال الأنصاري فيمر النساء متلففات بمروطهن ما يعرفن من الغلس ‏.‏ وقال قتيبة متلفعات ‏.‏ قال وفي الباب عن ابن عمر وأنس وقيلة بنت مخرمة ‏.‏ قال أبو عيسى حديث عائشة حديث حسن صحيح ‏.‏ وقد رواه الزهري عن عروة عن عائشة نحوه ‏.‏ وهو الذي اختاره غير واحد من أهل العلم من أصحاب النبي صلى الله عليه وسلم منهم أبو بكر وعمر ومن بعدهم من التابعين وبه يقول الشافعي وأحمد وإسحاق يستحبون التغليس بصلاة الفجر ‏.‏",
      "text_en": " Aishah narrated:                     \"Allah's Messenger would pray Subh (at such time that) the women would leave (after the prayer)\" - AI-AnsarI (one of the narrators) said - the women would pass by wrapped in their Mirts and they would not be recognizable due to the darkness.\" And Qutaibah said: \"covered.\" (instead of \"wrapped.\")",
      "chain": [
        "30367",
        "20001",
        "20280",
        "30112",
        "20001",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "312",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن ابن شهاب، عن ابن أكيمة الليثي، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم انصرف من صلاة جهر فيها بالقراءة فقال ‏\"‏ هل قرأ معي أحد منكم آنفا ‏\"‏ ‏.‏ فقال رجل نعم يا رسول الله ‏.‏ قال ‏\"‏ إني أقول ما لي أنازع القرآن ‏\"‏ ‏.‏ قال فانتهى الناس عن القراءة مع رسول الله صلى الله عليه وسلم فيما جهر فيه رسول الله صلى الله عليه وسلم من الصلوات بالقراءة حين سمعوا ذلك من رسول الله صلى الله عليه وسلم ‏.‏ قال وفي الباب عن ابن مسعود وعمران بن حصين وجابر بن عبد الله ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وابن أكيمة الليثي اسمه عمارة ‏.‏ ويقال عمرو بن أكيمة ‏.‏ وروى بعض أصحاب الزهري هذا الحديث وذكروا هذا الحرف قال قال الزهري فانتهى الناس عن القراءة حين سمعوا ذلك من رسول الله صلى الله عليه وسلم ‏.‏ وليس في هذا الحديث ما يدخل على من رأى القراءة خلف الإمام لأن أبا هريرة هو الذي روى عن النبي صلى الله عليه وسلم هذا الحديث وروى أبو هريرة عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ من صلى صلاة لم يقرأ فيها بأم القرآن فهي خداج فهي خداج غير تمام ‏\"‏ ‏.‏ فقال له حامل الحديث إني أكون أحيانا وراء الإمام قال اقرأ بها في نفسك ‏.‏ وروى أبو عثمان النهدي عن أبي هريرة قال أمرني النبي صلى الله عليه وسلم أن أنادي أن لا صلاة إلا بقراءة فاتحة الكتاب ‏.‏ واختار أكثر أصحاب الحديث أن لا يقرأ الرجل إذا جهر الإمام بالقراءة وقالوا يتتبع سكتات الإمام ‏.‏ وقد اختلف أهل العلم في القراءة خلف الإمام فرأى أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين ومن بعدهم القراءة خلف الإمام وبه يقول مالك بن أنس وعبد الله بن المبارك والشافعي وأحمد وإسحاق ‏.‏ وروي عن عبد الله بن المبارك أنه قال أنا أقرأ خلف الإمام والناس يقرءون إلا قوما من الكوفيين وأرى أن من لم يقرأ صلاته جائزة ‏.‏ وشدد قوم من أهل العلم في ترك قراءة فاتحة الكتاب وإن كان خلف الإمام فقالوا لا تجزئ صلاة إلا بقراءة فاتحة الكتاب وحده كان أو خلف الإمام ‏.‏ وذهبوا إلى ما روى عبادة بن الصامت عن النبي صلى الله عليه وسلم ‏.‏ وقرأ عبادة بن الصامت بعد النبي صلى الله عليه وسلم خلف الإمام وتأول قول النبي صلى الله عليه وسلم ‏\"‏ لا صلاة إلا بقراءة فاتحة الكتاب ‏\"‏ ‏.‏ وبه يقول الشافعي وإسحاق وغيرهما ‏.‏ وأما أحمد بن حنبل فقال معنى قول النبي صلى الله عليه وسلم ‏\"‏ لا صلاة لمن لم يقرأ بفاتحة الكتاب ‏\"‏ ‏.‏ إذا كان وحده ‏.‏ واحتج بحديث جابر بن عبد الله حيث قال من صلى ركعة لم يقرأ فيها بأم القرآن فلم يصل إلا أن يكون وراء الإمام ‏.‏ قال أحمد بن حنبل فهذا رجل من أصحاب النبي صلى الله عليه وسلم تأول قول النبي صلى الله عليه وسلم ‏\"‏ لا صلاة لمن لم يقرأ بفاتحة الكتاب ‏\"‏ ‏.‏ أن هذا إذا كان وحده ‏.‏ واختار أحمد مع هذا القراءة خلف الإمام وأن لا يترك الرجل فاتحة الكتاب وإن كان خلف الإمام ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"Allah's Messenger turned (after praying) from a Salat in which he recited aloud and said: 'Has any one of you recite along with me just now?' A man said: 'Yes, O Messenger of Allah.' He said: 'Indeed I said to myself: Why was I being contended with for the Quran?'\" He (Az-Zuhri one of the narrators) said: \"So when they heard that from Allah's Messenger, the people stopped reciting with Allah's Messenger in the prayers that Allah's Messenger recited aloud.\"",
      "chain": [
        "20280",
        "30112",
        "20001",
        "11013",
        "13"
      ]
    },
    {
      "hadith_no": "325",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك، ح وحدثنا قتيبة، عن مالك، عن زيد بن رباح، وعبيد الله بن أبي عبد الله الأغر، عن أبي عبد الله الأغر، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ صلاة في مسجدي هذا خير من ألف صلاة فيما سواه إلا المسجد الحرام ‏\"‏ ‏.‏ قال أبو عيسى ولم يذكر قتيبة في حديثه عن عبيد الله إنما ذكر عن زيد بن رباح عن أبي عبد الله الأغر عن أبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو عبد الله الأغر اسمه سلمان ‏.‏ وقد روي عن أبي هريرة من غير وجه عن النبي صلى الله عليه وسلم ‏.‏ قال وفي الباب عن علي وميمونة وأبي سعيد وجبير بن مطعم وابن عمر وعبد الله بن الزبير وأبي ذر ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     Allah's Messenger said: \"Salat is this Masjid of mine is better than a thousand Salat in another, except for Masjid Al-Haram.\"",
      "chain": [
        "20280",
        "30112",
        "20001",
        "30367",
        "20001",
        "11508",
        "11707",
        "11171",
        "13"
      ]
    },
    {
      "hadith_no": "373",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن ابن شهاب، عن السائب بن يزيد، عن المطلب بن أبي وداعة السهمي، عن حفصة، زوج النبي صلى الله عليه وسلم أنها قالت ما رأيت رسول الله صلى الله عليه وسلم صلى في سبحته قاعدا حتى كان قبل وفاته صلى الله عليه وسلم بعام فإنه كان يصلي في سبحته قاعدا ويقرأ بالسورة ويرتلها حتى تكون أطول من أطول منها ‏.‏ وفي الباب عن أم سلمة وأنس بن مالك ‏.‏ قال أبو عيسى حديث حفصة حديث حسن صحيح ‏.‏ وقد روي عن النبي صلى الله عليه وسلم أنه كان يصلي من الليل جالسا فإذا بقي من قراءته قدر ثلاثين أو أربعين آية قام فقرأ ثم ركع ثم صنع في الركعة الثانية مثل ذلك ‏.‏ وروي عنه أنه كان يصلي قاعدا فإذا قرأ وهو قائم ركع وسجد وهو قائم وإذا قرأ وهو قاعد ركع وسجد وهو قاعد ‏.‏ قال أحمد وإسحاق والعمل على كلا الحديثين ‏.‏ كأنهما رأيا كلا الحديثين صحيحا معمولا بهما ‏.‏",
      "text_en": " Hafsah, the wife of the Prophet (S), narrated:                     \"I did not see Allah's Messenger (S) praying voluntary prayers sitting until the year before he died. Then he would perform Salat for the voluntary prayers sitting, and he would recite a Surah and prolong it such that it would be longer than the longest of them.\"",
      "chain": [
        "20280",
        "30112",
        "20001",
        "11013",
        "3048",
        "5295"
      ]
    },
    {
      "hadith_no": "374",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك، عن أبي النضر، عن أبي سلمة، عن عائشة، أن النبي صلى الله عليه وسلم كان يصلي جالسا فيقرأ وهو جالس فإذا بقي من قراءته قدر ما يكون ثلاثين أو أربعين آية قام فقرأ وهو قائم ثم ركع وسجد ثم صنع في الركعة الثانية مثل ذلك ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Aishah narrated:                     \"The Prophet (S) would perform Salat while sitting. And he would recite while sitting. When about thirty or forty Ayah of his recitation remained he would standup and recite while he was standing, then he would bow and prostrate. Then he would do the same in the second Rak'ah.\"",
      "chain": [
        "20280",
        "30112",
        "20001",
        "11164",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "395",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن يحيى النيسابوري، حدثنا محمد بن عبد الله الأنصاري، قال أخبرني أشعث، عن ابن سيرين، عن خالد الحذاء، عن أبي قلابة، عن أبي المهلب، عن عمران بن حصين، أن النبي صلى الله عليه وسلم صلى بهم فسها فسجد سجدتين ثم تشهد ثم سلم ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وروى محمد بن سيرين عن أبي المهلب وهو عم أبي قلابة غير هذا الحديث ‏.‏ وروى محمد هذا الحديث عن خالد الحذاء عن أبي قلابة عن أبي المهلب ‏.‏ وأبو المهلب اسمه عبد الرحمن بن عمرو ويقال أيضا معاوية بن عمرو ‏.‏ وقد روى عبد الوهاب الثقفي وهشيم وغير واحد هذا الحديث عن خالد الحذاء عن أبي قلابة بطوله وهو حديث عمران بن حصين أن النبي صلى الله عليه وسلم سلم في ثلاث ركعات من العصر فقام رجل يقال له الخرباق ‏.‏ واختلف أهل العلم في التشهد في سجدتى السهو فقال بعضهم يتشهد فيهما ويسلم ‏.‏ وقال بعضهم ليس فيهما تشهد وتسليم وإذا سجدهما قبل السلام لم يتشهد ‏.‏ وهو قول أحمد وإسحاق قالا إذا سجد سجدتى السهو قبل السلام لم يتشهد ‏.‏",
      "text_en": " Abu Al-Muhallab narrated from Imran bin Husain that :                     the Prophet (S) led them in Salat he forgot (something) so he performed two prostrations, then the Tashah-hud, then the Salam.",
      "chain": [
        "11222",
        "20280",
        "11324",
        "11035",
        "11282",
        "11047",
        "123"
      ]
    },
    {
      "hadith_no": "399",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك، عن أيوب بن أبي تميمة، وهو أيوب السختياني عن محمد بن سيرين، عن أبي هريرة، أن النبي صلى الله عليه وسلم انصرف من اثنتين فقال له ذو اليدين أقصرت الصلاة أم نسيت يا رسول الله فقال رسول الله صلى الله عليه وسلم ‏\"‏ أصدق ذو اليدين ‏\"‏ ‏.‏ فقال الناس نعم ‏.‏ فقام رسول الله صلى الله عليه وسلم فصلى اثنتين أخريين ثم سلم ثم كبر فسجد مثل سجوده أو أطول ثم كبر فرفع ثم سجد مثل سجوده أو أطول ‏.‏ قال أبو عيسى وفي الباب عن عمران بن حصين وابن عمر وذي اليدين ‏.‏ قال أبو عيسى وحديث أبي هريرة حديث حسن صحيح ‏.‏ واختلف أهل العلم في هذا الحديث فقال بعض أهل الكوفة إذا تكلم في الصلاة ناسيا أو جاهلا أو ما كان فإنه يعيد الصلاة واعتلوا بأن هذا الحديث كان قبل تحريم الكلام في الصلاة ‏.‏ قال وأما الشافعي فرأى هذا حديثا صحيحا فقال به وقال هذا أصح من الحديث الذي روي عن النبي صلى الله عليه وسلم في الصائم إذا أكل ناسيا فإنه لا يقضي وإنما هو رزق رزقه الله ‏.‏ قال الشافعي وفرقوا هؤلاء بين العمد والنسيان في أكل الصائم بحديث أبي هريرة ‏.‏ وقال أحمد في حديث أبي هريرة إن تكلم الإمام في شيء من صلاته وهو يرى أنه قد أكملها ثم علم أنه لم يكملها يتم صلاته ومن تكلم خلف الإمام وهو يعلم أن عليه بقية من الصلاة فعليه أن يستقبلها ‏.‏ واحتج بأن الفرائض كانت تزاد وتنقص على عهد رسول الله صلى الله عليه وسلم فإنما تكلم ذو اليدين وهو على يقين من صلاته أنها تمت وليس هكذا اليوم ليس لأحد أن يتكلم على معنى ما تكلم ذو اليدين لأن الفرائض اليوم لا يزاد فيها ولا ينقص ‏.‏ قال أحمد نحوا من هذا الكلام ‏.‏ وقال إسحاق نحو قول أحمد في الباب ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"The Prophet (S) turned (finished the prayer) after two (Rak'ah), so Dhul-Yadain said: 'Has the prayer been shortened or have you forgotten O Messenger of Allah?\" The Prophet (S) said: 'Is what Dhul-Yadain said the truth?' The people said yes,  so Allah's Messenger (S) stood to perform the last two (Rakah) of Salat, then he said the Taslim. Then he said the Takbir and prostrated in a manner the same or longer than his (normal) prostrations.\"",
      "chain": [
        "20280",
        "30112",
        "20001",
        "11015",
        "11015",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "589",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو حاتم، مسلم بن حاتم البصري حدثنا محمد بن عبد الله الأنصاري، عن أبيه، عن علي بن زيد، عن سعيد بن المسيب، قال قال أنس بن مالك قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا بنى إياك والالتفات في الصلاة فإن الالتفات في الصلاة هلكة فإن كان لا بد ففي التطوع لا في الفريضة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Anas narrated:                     \"The Messenger of Allah said to me: 'O my son! Beware of looking around during the Salat, for indeed looking around during Salat is destruction. If you must do so, then in the voluntary (prayers), not in the obligatory (prayers).'\" (Da'if",
      "chain": [
        "20280",
        "11599",
        "10664",
        "11002",
        "19"
      ]
    },
    {
      "hadith_no": "776",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو موسى، محمد بن المثنى حدثنا محمد بن عبد الله الأنصاري، عن حبيب بن الشهيد، عن ميمون بن مهران، عن ابن عباس، أن النبي صلى الله عليه وسلم احتجم وهو صائم ‏.‏ هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Prophet was cupped while he was fasting.\"",
      "chain": [
        "20280",
        "11275",
        "11012",
        "17"
      ]
    },
    {
      "hadith_no": "1060",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا قتيبة، عن مالك بن أنس، ح وحدثنا الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن ابن شهاب، عن سعيد بن المسيب، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يموت لأحد من المسلمين ثلاثة من الولد فتمسه النار إلا تحلة القسم ‏\"‏ ‏.‏ قال وفي الباب عن عمر ومعاذ وكعب بن مالك وعتبة بن عبد وأم سليم وجابر وأنس وأبي ذر وابن مسعود وأبي ثعلبة الأشجعي وابن عباس وعقبة بن عامر وأبي سعيد وقرة بن إياس المزني ‏.‏ قال وأبو ثعلبة الأشجعي له عن النبي صلى الله عليه وسلم حديث واحد هو هذا الحديث وليس هو الخشني ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     The Messenger of Allah said: \"Any Muslim who has lost three of his children will not be touched by the Fire, except for what will fulfill the oath.\"",
      "chain": [
        "30367",
        "20001",
        "20280",
        "30112",
        "20001",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "1063",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك، ح وحدثنا قتيبة، عن مالك، عن سمى، عن أبي صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الشهداء خمس المطعون والمبطون والغرق وصاحب الهدم والشهيد في سبيل الله ‏\"‏ ‏.‏ قال وفي الباب عن أنس وصفوان بن أمية وجابر بن عتيك وخالد بن عرفطة وسليمان بن صرد وأبي موسى وعائشة ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     The Messenger of Allah said: \"The martyrs are five: Those who die of the plague, stomach illness, drowning, being crushed, and the martyr in the cause of Allah\"",
      "chain": [
        "20280",
        "30112",
        "20001",
        "30367",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "1181",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Suckling - كتاب الرضاع",
      "chapter_no": "12",
      "text_ar": "حدثنا قتيبة، حدثنا مالك، ح وحدثنا الأنصاري، حدثنا معن، قال حدثنا مالك بن أنس، عن ابن شهاب، عن عمرو بن الشريد، عن ابن عباس، أنه سئل عن رجل، له جاريتان أرضعت إحداهما جارية والأخرى غلاما أيحل للغلام أن يتزوج بالجارية فقال لا اللقاح واحد ‏.‏ قال أبو عيسى وهذا تفسير لبن الفحل وهذا الأصل في هذا الباب وهو قول أحمد وإسحاق ‏.‏",
      "text_en": " Amr bin Ash-Shariq narrated that Ibn Abbas was asked about the case in which a man had two slave girls, one of them suckled a girl and the other suckled a boy, is it lawful for the boy to marry the girl? She said:                      “No, the semen is the same.”",
      "chain": [
        "30367",
        "20001",
        "20280",
        "30112",
        "20001",
        "11013",
        "10952",
        "17"
      ]
    },
    {
      "hadith_no": "1235",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "حدثنا الأنصاري، حدثنا معن بن عيسى، أنبأنا مالك بن أنس، عن عبد الله بن أبي بكر بن محمد بن عمرو بن حزم، عن حميد بن نافع، عن زينب بنت أبي سلمة، أنها أخبرته بهذه الأحاديث الثلاثة، قال قالت زينب دخلت على أم حبيبة زوج النبي صلى الله عليه وسلم حين توفي أبوها أبو سفيان بن حرب فدعت بطيب فيه صفرة خلوق أو غيره فدهنت به جارية ثم مست بعارضيها ثم قالت والله ما لي بالطيب من حاجة غير أني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد على ميت فوق ثلاثة أيام إلا على زوج أربعة أشهر وعشرا ‏\"‏ ‏.‏",
      "text_en": " Humaid bin Nafi narrated that :                     Zainab bint Abi Salamah said: \"I entered upon Umm Habibah, the wife of the Prophet when her father Sufyan bin Harb died. So she asked for some perfume that had something yellow saffron or something else, so a girl applied it to her and put some on her cheeks. Then she said: 'By Allah! I have no need for perfume except that I heard the Messenger of Allah saying: \"It is not lawful for a woman who believers in Allah and the Last Day to mourn for the dead more than three days, except for her husband (in which case it is) four months and ten days.\"",
      "chain": [
        "20280",
        "30112",
        "20001",
        "11104",
        "11157",
        "244"
      ]
    },
    {
      "hadith_no": "1244",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "حدثنا الأنصاري، أنبأنا معن، أنبأنا مالك، عن سعد بن إسحاق بن كعب بن عجرة، عن عمته، زينب بنت كعب بن عجرة أن الفريعة بنت مالك بن سنان، وهي أخت أبي سعيد الخدري أخبرتها أنها، جاءت رسول الله صلى الله عليه وسلم تسأله أن ترجع إلى أهلها في بني خدرة وأن زوجها خرج في طلب أعبد له أبقوا حتى إذا كان بطرف القدوم لحقهم فقتلوه ‏.‏ قالت فسألت رسول الله صلى الله عليه وسلم أن أرجع إلى أهلي فإن زوجي لم يترك لي مسكنا يملكه ولا نفقة ‏.‏ قالت فقال رسول الله صلى الله عليه وسلم ‏\"‏ نعم ‏\"‏ ‏.‏ قالت فانصرفت حتى إذا كنت في الحجرة أو في المسجد ناداني رسول الله صلى الله عليه وسلم أو أمر بي فنوديت له فقال ‏\"‏ كيف قلت ‏\"‏ ‏.‏ قالت فرددت عليه القصة التي ذكرت له من شأن زوجي قال ‏\"‏ امكثي في بيتك حتى يبلغ الكتاب أجله ‏\"‏ ‏.‏ قالت فاعتددت فيه أربعة أشهر وعشرا ‏.‏ قالت فلما كان عثمان أرسل إلى فسألني عن ذلك فأخبرته فاتبعه وقضى به ‏.‏",
      "text_en": " Zainab bint Ka'b bin Ujrah narrated that :                     Al-Furay'ah bint Malik bin Sinan - the sister of the Abu Sa'eed Al-Khudri - informed her that she went to the Messenger of Allah to ask him if she could return to her family in Banu Khudrah. Her husband had gone out searching for his runaway slaves, and when he was in Turaf Al-Qadum he caught up with them and they killed him. She said: \"So I asked the Messenger of Allah if I could return to my family since my husband had not left me a home that he owned nor any maintenance.\" She said: \"So the Messenger of Allah said: 'Yes.' Then I left. When I was in the courtyard,\" or, \"in the Masjid, the Messenger of Allah called me\" or, \"summoned for me to come back t him and he said: 'What did you say?'\" She said: \"So I repeated the store that I had mentioned to him about the case of my husband. He said: 'Stay in your house until what is written reaches its term.'\" She said: \"So I observed my Iddah there for four months and ten (days).\" She said: \"During the time of Uthman, he sent a message to me asking me about that, so I informed him. He followed it and judged accordingly.\"",
      "chain": [
        "20280",
        "30112",
        "20001",
        "19805"
      ]
    },
    {
      "hadith_no": "1350",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك، عن ابن شهاب، عن أبي سلمة، عن جابر، أن النبي صلى الله عليه وسلم قال ‏\"‏ أيما رجل أعمر عمرى له ولعقبه فإنها للذي يعطاها لا ترجع إلى الذي أعطاها لأنه أعطى عطاء وقعت فيه المواريث ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وهكذا روى معمر وغير واحد عن الزهري مثل رواية مالك ‏.‏ وروى بعضهم عن الزهري ولم يذكر فيه ‏\"‏ ولعقبه ‏\"‏ ‏.‏ والعمل على هذا عند بعض أهل العلم قالوا إذا قال هي لك حياتك ولعقبك ‏.‏ فإنها لمن أعمرها لا ترجع إلى الأول ‏.‏ وإذا لم يقل لعقبك فهي راجعة إلى الأول إذا مات المعمر ‏.‏ وهو قول مالك بن أنس والشافعي ‏.‏ وروي من غير وجه عن النبي صلى الله عليه وسلم قال ‏\"‏ العمرى جائزة لأهلها ‏\"‏ ‏.‏ والعمل على هذا عند بعض أهل العلم قالوا إذا مات المعمر فهي لورثته وإن لم تجعل لعقبه ‏.‏ وهو قول سفيان الثوري وأحمد وإسحاق ‏.‏",
      "text_en": " Jabir narrated that the Prophet (ﷺ) said:                      \"Whichever man is given a lifelong gift for himself and his offspring, then it belongs to the one whom it was given, it does not return to the one who gave it, for he has given a gift which shall be included in the inheritance.\"",
      "chain": [
        "20280",
        "30112",
        "20001",
        "11013",
        "10567",
        "34"
      ]
    },
    {
      "hadith_no": "1550",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثني مالك بن أنس، عن حميد، عن أنس، أن رسول الله صلى الله عليه وسلم حين خرج إلى خيبر أتاها ليلا وكان إذا جاء قوما بليل لم يغر عليهم حتى يصبح فلما أصبح خرجت يهود بمساحيهم ومكاتلهم فلما رأوه قالوا محمد وافق والله محمد الخميس ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ الله أكبر خربت خيبر إنا إذا نزلنا بساحة قوم فساء صباح المنذرين ‏\"‏ ‏.‏",
      "text_en": " Narrated Anas:                     \"When the Messenger of Allah (ﷺ) set out for Khaibar, he approached it at night and when he came to a people during the night, he would not attack them until morning. So when the morning came, the Jews came out with their shovels and baskets, then when they saw him, they said: 'Muhammad! By Allah Muhammad has come with the Khamis (an army).' So the Messenger of Allah (ﷺ) said: 'Allahu Akbar! Khaibar is destroyed, for whenever we approach the land of people - then what an evil morning for those who have been warned.'\"",
      "chain": [
        "20280",
        "30112",
        "20001",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "1558",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن الفضيل بن أبي عبد الله، عن عبد الله بن نيار الأسلمي، عن عروة، عن عائشة، أن رسول الله صلى الله عليه وسلم خرج إلى بدر حتى إذا كان بحرة الوبر لحقه رجل من المشركين يذكر منه جرأة ونجدة فقال له النبي صلى الله عليه وسلم ‏\"‏ ألست تؤمن بالله ورسوله ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ ارجع فلن أستعين بمشرك ‏\"‏ ‏.‏ وفي الحديث كلام أكثر من هذا ‏.‏ هذا حديث حسن غريب ‏.‏ والعمل على هذا عند بعض أهل العلم قالوا لا يسهم لأهل الذمة وإن قاتلوا مع المسلمين العدو ‏.‏ ورأى بعض أهل العلم أن يسهم لهم إذا شهدوا القتال مع المسلمين ‏.‏",
      "text_en": " Narrated 'Aishah:                     That the Messenger of Allah (ﷺ) advanced towards Badr till he reached Harrah Al-Wabr where he was met by a man from the idolaters, about whom it was said he was brave and courageous. The Prophet (ﷺ) said to him: \"Do you believe in Allah and his Messenger?\" He said: \"No.\" He said: \"Then return, because we do not seek aid from an idolater.\"The Hadith has more dialogue than this. And this is a Hasan Gharib Hadith. This is acted upon according to some of the people of knowledge. They say that the people of Adh-Dhimmah do not recieve a share, even it they were to fight along with the Muslims against the enemy.Some of the people of knowledge said that they are given a share when they attend the battle with the Muslims.",
      "chain": [
        "20280",
        "30112",
        "20001",
        "10937",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1562",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك بن أنس، عن يحيى بن سعيد، عن عمر بن كثير بن أفلح، عن أبي محمد، مولى أبي قتادة عن أبي قتادة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قتل قتيلا له عليه بينة فله سلبه ‏\"‏ ‏.‏ قال أبو عيسى وفي الحديث قصة ‏.‏",
      "text_en": " Narrated Abu Qatadah:                     That the Messenger of Allah (ﷺ) said: \"Whoever kills someone in battle, having a proof for that, then his goods are his.\"[Abu 'Eisa said:] There is a story with this Hadith.",
      "chain": [
        "20280",
        "30112",
        "20001",
        "11062",
        "10601",
        "11224",
        "391"
      ]
    },
    {
      "hadith_no": "1730",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك، ح وحدثنا قتيبة، عن مالك، عن نافع، وعبد الله بن دينار، وزيد بن أسلم، كلهم يخبر عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا ينظر الله يوم القيامة إلى من جر ثوبه خيلاء ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن حذيفة وأبي سعيد وأبي هريرة وسمرة وأبي ذر وعائشة وهبيب بن مغفل ‏.‏ وحديث ابن عمر حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Abdullah bin 'Umar:                     That the Messenger of Allah (ﷺ) said: \"On the day of judgement, Allah will not look at one who arrogantly drags his garment.[Abu 'Eisa said:] There are narrations on this topic from Hudhaifah, Abu Sa'eed, Abu Hurairah, Samurah, Abu Dharr, 'Aishah and Hubaib bin Mughfil. The Hadith of Ibn 'Umar is Hasan Sahih.",
      "chain": [
        "20280",
        "30112",
        "20001",
        "30367",
        "20001",
        "11014",
        "11183",
        "11163",
        "18"
      ]
    },
    {
      "hadith_no": "1747",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن عبد الله الأنصاري، حدثنا أبي، عن ثمامة، عن أنس بن مالك، قال كان نقش خاتم النبي صلى الله عليه وسلم محمد سطر ورسول سطر والله سطر ‏.‏ قال أبو عيسى حديث أنس حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"The inscription on the ring of the Prophet (ﷺ) was in three lines: 'Muhammad' on a line, 'Messenger' on a line, and 'Allah' on a line.\"",
      "chain": [
        "11222",
        "20280",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "1748",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن بشار، ومحمد بن يحيى، وغير، واحد، قالوا حدثنا محمد بن عبد الله الأنصاري، حدثني أبي، عن ثمامة، عن أنس بن مالك، قال كان نقش خاتم النبي صلى الله عليه وسلم ثلاثة أسطر محمد سطر ورسول سطر والله سطر ‏.‏ ولم يذكر محمد بن يحيى في حديثه ثلاثة أسطر ‏.‏ وفي الباب عن ابن عمر ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     \"The inscription on the ring of the Prophet (ﷺ) was in three line: 'Muhammad' on a line, 'Messenger' on a line, 'Allah' on a line.\" And Muhammad bin Yahya (one of the two who narrated to him) did not say: \"Three lines\" in his narration.There are narrations on this topic from Ibn 'Umar.[Abu 'Eisa said:] This Hadith of Anas is a Hasan  Sahih Gharib.",
      "chain": [
        "30160",
        "11222",
        "20280",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "1774",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا قتيبة، عن مالك، ح وحدثنا الأنصاري، حدثنا معن، حدثنا مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يمشي أحدكم في نعل واحدة لينعلهما جميعا أو ليحفهما جميعا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال وفي الباب عن جابر ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     That the Messenger of Allah (ﷺ) said: \"Do not walk in one sandal, either wear both sandals, or go barefoot.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.He said: There is something on this topic from Jabir.",
      "chain": [
        "30367",
        "20001",
        "20280",
        "30112",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "1779",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك، ح وحدثنا قتيبة، عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا انتعل أحدكم فليبدأ باليمين وإذا نزع فليبدأ بالشمال فلتكن اليمنى أولهما تنعل وآخرهما تنزع ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     That the Messenger of Allah (ﷺ) said: \"When one of you dons sandals, then let him begin with the right. And when he removes them then let him begin with left, so that the right will be the first to put on and the last of them removed.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "20280",
        "30112",
        "20001",
        "30367",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "1820",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا الأنصاري، حدثنا معن، حدثنا مالك، ح وحدثنا قتيبة، عن مالك، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ طعام الاثنين كافي الثلاثة وطعام الثلاثة كافي الأربعة ‏\"‏ ‏.‏ قال وفي الباب عن جابر وابن عمر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     That the Messenger of Allah (ﷺ) said: \"The food of two is sufficient for three, and the food of three is sufficient for four.\"He said: There are narrations on this topic from Jabir, and Ibn 'Umar.[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "20280",
        "30112",
        "20001",
        "30367",
        "20001",
        "11061",
        "11197",
        "13"
      ]
    }
  ],
  "total_hadiths": 87
}