{
  "id": "20285",
  "name": "Muslim bin Ibrahim al-Azdy مسلم بن إبراهيم الأزدي الفراهيدي",
  "full_name": "Muslim bin Ibrahim al-Azdy مسلم بن إبراهيم الأزدي الفراهيدي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "130",
      "date_gregorian": "NA",
      "date_display": [
        "130 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "222",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Azdi",
      "al-Basri",
      "Hafiz"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "14242",
      "name": "Abd al-Salam bin Aby عبد السلام بن أبي حازم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20205",
      "name": "Aban bin Yazid al-Attar",
      "grade": "Thiqah (Trustworthy)"
    },
    {
      "id": "11273",
      "name": "Abu al-Ashhab al-Atardi جعفر بن حيان أبو الأشهب العطاردي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20539",
      "name": "Khalid bin Qays al-Hadani خالد بن قيس الحداني",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10669",
      "name": "al-Aswad bin Shayban al-Sadusi الأسود بن شيبان السدوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11583",
      "name": "Khalid bin Dinar Abu Khalida خالد بن دينار التميمي السعدي أبو خلدة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10668",
      "name": "Isma'il bin Muslim al-Bdy إسماعيل بن مسلم العبدي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20237",
      "name": "Salam bin Mskyn bin Rabi'ya سلام بن مسكين بن ربيعة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "24207",
      "name": "Salah bin Bashir bin Wada' - al-Mari صالح بن بشير بن وادع - المري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "24209",
      "name": "Sadqa bin Musa al-Daqayqi صدقة بن موسى الدقيقي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20564",
      "name": "al-Qasim bin al-Fadl bin Ma'dan القاسم بن الفضل بن معدان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11301",
      "name": "Qurrah bin Khalid al-Sadusi قرة بن خالد السدوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20297",
      "name": "Hmam bin Yahya bin Dinar همام بن يحيى بن دينار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20295",
      "name": "Hisham bin Abi 'Abdullah al-Dastawa'i هشام بن أبي عبد الله الدستوائي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28625",
      "name": "Wahb bin Khalid al-Hmyry Abu وهب بن خالد الحميري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "19857",
      "name": "Muhammad bin Sulaym محمد بن سليم أبو هلال الراسبي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20449",
      "name": "'Ali bin al-Mubark al-Hna'iy علي بن المبارك الهنائي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30454",
      "name": "Muhammad bin Yahya bin Abi Hazm محمد بن يحيى بن أبي حزم القطعي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30553",
      "name": "'Abd bin Hameed bin Nasr عبد بن حميد بن نصر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30025",
      "name": "'Abdullah bin 'Abdur Rahman al-Daarimi عبد الله بن عبد الرحمن الدارمي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38247",
      "name": "Sulaiman bin Syf bin Yahya سليمان بن سيف بن يحيى",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30535",
      "name": "Ahmed bin Yusuf bin Khalid أحمد بن يوسف بن خالد حمدان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30302",
      "name": "Ahmed bin 'Abdullah أحمد بن عبد الله بن علي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38834",
      "name": "Hajjaj bin Yusuf bin al-Sha'ir حجاج بن يوسف الشاعر",
      "grade": "3rd Century AH"
    },
    {
      "id": "30136",
      "name": "Zayd bin Akhzm زيد بن أخزم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "34121",
      "name": "'Abdullah bin al-Haytham bin 'Uthman عبد الله بن الهيثم بن عثمان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30153",
      "name": "'Amr bin 'Ali bin Bahr al-Bahli عمرو بن علي بن بحر الباهلي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38433",
      "name": "'Amr bin Mnswr al-Nsa'iy عمرو بن منصور النسائي أبو سعيد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30582",
      "name": "Muhammad bin 'Umar bin 'Ali bin 'Ata' محمد بن عمر بن علي بن عطاء المقدمي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38717",
      "name": "Yazid bin Muhammad bin Fadayl يزيد بن محمد بن فضيل الرسعني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30160",
      "name": "Muhammad bin Bashar Bindar محمد بن بشار بندار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30359",
      "name": "'Ubaidullah bin Sa'id عبيد الله بن سعيد أبو قدامة السرخسي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30511",
      "name": "Muhammad bin Ishaq al-Saghani محمد بن إسحاق الصغاني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "31378",
      "name": "al-Fadl bin al-Habab bin Muhammad الفضل بن الحباب",
      "grade": "3rd Century AH"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "44",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا مسلم بن إبراهيم، قال حدثنا هشام، قال حدثنا قتادة، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ يخرج من النار من قال لا إله إلا الله، وفي قلبه وزن شعيرة من خير، ويخرج من النار من قال لا إله إلا الله، وفي قلبه وزن برة من خير، ويخرج من النار من قال لا إله إلا الله، وفي قلبه وزن ذرة من خير ‏\"‏‏.‏ قال أبو عبد الله قال أبان حدثنا قتادة حدثنا أنس عن النبي صلى الله عليه وسلم ‏\"‏ من إيمان ‏\"‏‏.‏ مكان ‏\"‏ من خير ‏\"‏‏.‏",
      "text_en": "      Narrated Anas:                          The Prophet said, \"Whoever said \"None has the right to be worshipped      but Allah and has in his heart good (faith) equal to the weight of a      barley grain will be taken out of Hell. And whoever said: \"None has      the right to be worshipped but Allah and has in his heart good (faith)     equal to the weight of a wheat grain will be taken out of Hell. And      whoever said, \"None has the right to be worshipped but Allah and has      in his heart good (faith) equal to the weight of an atom will be taken     out of Hell.\"",
      "chain": [
        "20285",
        "20295",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "315",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا مسلم، قال حدثنا وهيب، حدثنا منصور، عن أمه، عن عائشة، أن امرأة، من الأنصار قالت للنبي صلى الله عليه وسلم كيف أغتسل من المحيض قال ‏\"‏ خذي فرصة ممسكة، فتوضئي ثلاثا ‏\"‏‏.‏ ثم إن النبي صلى الله عليه وسلم استحيا فأعرض بوجهه أو قال ‏\"‏ توضئي بها ‏\"‏ فأخذتها فجذبتها فأخبرتها بما يريد النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Aisha:                     An Ansari woman asked the Prophet how to take a bath after finishing from the menses. He replied, \"Take a piece a cloth perfumed with musk and clean the private parts with it thrice.\" The Prophet felt shy and turned his face. So pulled her to me and told her what the Prophet meant.",
      "chain": [
        "20285",
        "20299",
        "11067",
        "53"
      ]
    },
    {
      "hadith_no": "342",
      "source": " Sahih Bukhari ",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا مسلم، حدثنا شعبة، عن الحكم، عن ذر، عن ابن عبد الرحمن، عن عبد الرحمن، قال شهدت عمر فقال له عمار‏.‏ وساق الحديث‏.‏",
      "text_en": " Narrated `Ammar:                     As above.",
      "chain": [
        "20285",
        "20020",
        "11069",
        "11423",
        "28446",
        "10530"
      ]
    },
    {
      "hadith_no": "363",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا يحيى، قال حدثنا أبو معاوية، عن الأعمش، عن مسلم، عن مسروق، عن مغيرة بن شعبة، قال كنت مع النبي صلى الله عليه وسلم في سفر فقال ‏\"‏ يا مغيرة، خذ الإداوة ‏\"‏‏.‏ فأخذتها فانطلق رسول الله صلى الله عليه وسلم حتى توارى عني فقضى حاجته، وعليه جبة شأمية، فذهب ليخرج يده من كمها فضاقت، فأخرج يده من أسفلها، فصببت عليه فتوضأ وضوءه للصلاة، ومسح على خفيه، ثم صلى‏.‏",
      "text_en": " Narrated Mughira bin Shu`ba:                     Once I was traveling with the Prophet and he said, \"O Mughira! take this container of water.\" I took it and Allah's Apostle went far away till he disappeared. He answered the call of nature and was wearing a Syrian cloak. He tried to take out his hands from its sleeve but it was very tight so he took out his hands from under it. I poured water and he performed ablution like that for prayers and passed his wet hands over his Khuff (socks made from thick fabric or leather) and then prayed .",
      "chain": [
        "30020",
        "20354",
        "11060",
        "20285",
        "11018"
      ]
    },
    {
      "hadith_no": "388",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إسحاق بن نصر، قال حدثنا أبو أسامة، عن الأعمش، عن مسلم، عن مسروق، عن المغيرة بن شعبة، قال وضأت النبي صلى الله عليه وسلم فمسح على خفيه وصلى‏.‏",
      "text_en": "      Narrated Al-Mughira bin Shu'ba:                          I helped the Prophet in performing ablution and he passed his wet      hands over his Khuffs and prayed.",
      "chain": [
        "30311",
        "20318",
        "11060",
        "20285",
        "11018",
        "166"
      ]
    },
    {
      "hadith_no": "400",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا مسلم، قال حدثنا هشام، قال حدثنا يحيى بن أبي كثير، عن محمد بن عبد الرحمن، عن جابر، قال كان رسول الله صلى الله عليه وسلم يصلي على راحلته حيث توجهت، فإذا أراد الفريضة نزل فاستقبل القبلة‏.‏",
      "text_en": " Narrated Jabir:                     Allah's Apostle used to pray (optional, non-obligatory prayer) while riding on his mount (Rahila) wherever it turned, and whenever he wanted to pray the compulsory prayer he dismounted and prayed facing the Qibla.",
      "chain": [
        "20285",
        "20295",
        "11449",
        "11105",
        "34"
      ]
    },
    {
      "hadith_no": "459",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبدان، عن أبي حمزة، عن الأعمش، عن مسلم، عن مسروق، عن عائشة، قالت لما أنزل الآيات من سورة البقرة في الربا، خرج النبي صلى الله عليه وسلم إلى المسجد، فقرأهن على الناس، ثم حرم تجارة الخمر‏.‏",
      "text_en": " Narrated `Aisha:                     When the verses of Surat \"Al-Baqara\"' about the usury Riba were revealed, the Prophet went to the mosque and recited them in front of the people and then banned the trade of alcohol.",
      "chain": [
        "30349",
        "20458",
        "11060",
        "20285",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "531",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا مسلم بن إبراهيم، قال حدثنا هشام، عن قتادة، عن أنس، قال قال النبي صلى الله عليه وسلم ‏\"‏ إن أحدكم إذا صلى يناجي ربه فلا يتفلن عن يمينه، ولكن تحت قدمه اليسرى ‏\"‏‏.‏ وقال سعيد عن قتادة لا يتفل قدامه أو بين يديه، ولكن عن يساره أو تحت قدميه‏.‏ وقال شعبة لا يبزق بين يديه ولا عن يمينه، ولكن عن يساره أو تحت قدمه‏.‏ وقال حميد عن أنس عن النبي صلى الله عليه وسلم ‏\"‏ لا يبزق في القبلة ولا عن يمينه، ولكن عن يساره أو تحت قدمه ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"Whenever anyone of you offers his prayer he is speaking in private to his Lord. So he should not spit to his right but under his left foot.\" Qatada said, \"He should not spit in front of him but to his left or under his feet.\" And Shu`ba said, \"He should not spit in front of him, nor to his right but to his left or under his foot.\" Anas said: The Prophet said, \"He should neither spit in the direction of his Qibla nor to his right but to his left or under his foot.\"",
      "chain": [
        "20285",
        "20295",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "553",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا مسلم بن إبراهيم، قال حدثنا هشام، قال حدثنا يحيى بن أبي كثير، عن أبي قلابة، عن أبي المليح، قال كنا مع بريدة في غزوة في يوم ذي غيم فقال بكروا بصلاة العصر فإن النبي صلى الله عليه وسلم قال ‏\"‏ من ترك صلاة العصر فقد حبط عمله ‏\"‏‏.‏",
      "text_en": " Narrated Abu Al-Mahh [??]:                     We were with Buraida in a battle on a cloudy day and he said, \"Offer the `Asr prayer early as the Prophet said, \"Whoever leaves the `Asr prayer, all his (good) deeds will be annulled.\"",
      "chain": [
        "20285",
        "20295",
        "11449",
        "11047",
        "11453"
      ]
    },
    {
      "hadith_no": "565",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا مسلم بن إبراهيم، قال حدثنا شعبة، عن سعد بن إبراهيم، عن محمد بن عمرو  هو ابن الحسن بن علي  قال سألنا جابر بن عبد الله عن صلاة النبي، صلى الله عليه وسلم فقال كان يصلي الظهر بالهاجرة، والعصر والشمس حية، والمغرب إذا وجبت، والعشاء إذا كثر الناس عجل، وإذا قلوا أخر، والصبح بغلس‏.‏",
      "text_en": " Narrated Muhammad bin `Amr:                     We asked Jabir bin `Abdullah about the prayers of the Prophet . He said, \"He used to pray Zuhr prayer at midday, the `Asr when the sun was still hot, and the Maghrib after sunset (at its stated time). The `Isha was offered early if the people gathered, and used to be delayed if their number was less; and the morning prayer was offered when it was still dark. \"",
      "chain": [
        "20285",
        "20020",
        "11063",
        "11220",
        "34"
      ]
    },
    {
      "hadith_no": "629",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسلم بن إبراهيم، قال حدثنا شعبة، عن المهاجر أبي الحسن، عن زيد بن وهب، عن أبي ذر، قال كنا مع النبي صلى الله عليه وسلم في سفر فأراد المؤذن أن يؤذن فقال له ‏\"‏ أبرد ‏\"‏‏.‏ ثم أراد أن يؤذن فقال له ‏\"‏ أبرد ‏\"‏‏.‏ ثم أراد أن يؤذن‏.‏ فقال له ‏\"‏ أبرد ‏\"‏‏.‏ حتى ساوى الظل التلول فقال النبي صلى الله عليه وسلم ‏{‏إن شدة الحر من فيح جهنم‏}‏",
      "text_en": " Narrated Abu Dhar:                     We were in the company of the Prophet on a journey and the Mu'adh-dhin wanted to pronounce the Adhan for the (Zuhr) prayer. The Prophet said to him, \"Let it become cooler.\" Then he again wanted to pronounce the Adhan but the Prophet; said to him, \"Let it become cooler.\" The Mu'adh-dhin again wanted to pronounce the Adhan for the prayer but the Prophet said, \"Let it become cooler,\" till the shadows of the hillocks become equal to their sizes. The Prophet added, \"The severity of the heat is from the raging of Hell.\"",
      "chain": [
        "20285",
        "20020",
        "11657",
        "11341",
        "23"
      ]
    },
    {
      "hadith_no": "637",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسلم بن إبراهيم، قال حدثنا هشام، قال كتب إلى يحيى عن عبد الله بن أبي قتادة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أقيمت الصلاة فلا تقوموا حتى تروني ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Abi Qatada:                     My father said. \"Allah's Apostle said, 'If the Iqama is pronounced then do not stand for the prayer till you see me (in front of you).' \"",
      "chain": [
        "20285",
        "20295",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "669",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسلم بن إبراهيم، قال حدثنا هشام، عن يحيى، عن أبي سلمة، قال سألت أبا سعيد الخدري فقال جاءت سحابة فمطرت حتى سال السقف، وكان من جريد النخل، فأقيمت الصلاة، فرأيت رسول الله صلى الله عليه وسلم يسجد في الماء والطين، حتى رأيت أثر الطين في جبهته‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     A cloud came and it rained till the roof started leaking and in those days the roof used to be of the branches of date-palms. Iqama was pronounced and I saw Allah's Apostles prostrating in water and mud and even I saw the mark of mud on his forehead.",
      "chain": [
        "20285",
        "20295",
        "20031",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "700",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسلم، قال حدثنا شعبة، عن عمرو، عن جابر بن عبد الله، أن معاذ بن جبل، كان يصلي مع النبي صلى الله عليه وسلم ثم يرجع فيؤم قومه‏.‏",
      "text_en": " Narrated Mu`adh bin Jabal:                     I used to pray the `Isha prayer with the Prophet and then go to lead my people in the prayer.",
      "chain": [
        "20285",
        "20020",
        "20377",
        "34",
        "32"
      ]
    },
    {
      "hadith_no": "810",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسلم بن إبراهيم، قال حدثنا شعبة، عن عمرو، عن طاوس، عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ أمرنا أن نسجد على سبعة أعظم ولا نكف ثوبا ولا شعرا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"We have been ordered to prostrates on seven bones and not to tuck up the clothes or hair.\"",
      "chain": [
        "20285",
        "20020",
        "20377",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "836",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسلم بن إبراهيم، قال حدثنا هشام، عن يحيى، عن أبي سلمة، قال سألت أبا سعيد الخدري فقال رأيت رسول الله صلى الله عليه وسلم يسجد في الماء والطين حتى رأيت أثر الطين في جبهته‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     I saw Allah's Apostle prostrating in mud and water and saw the mark of mud on his forehead.",
      "chain": [
        "20285",
        "20295",
        "20031",
        "10567"
      ]
    },
    {
      "hadith_no": "897",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا مسلم بن إبراهيم، قال حدثنا وهيب، قال حدثنا ابن طاوس، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ نحن الآخرون السابقون يوم القيامة، أوتوا الكتاب من قبلنا، وأوتيناه من بعدهم، فهذا اليوم الذي اختلفوا فيه فهدانا الله، فغدا لليهود وبعد غد للنصارى ‏\"‏‏.‏ فسكت‏.‏ ثم قال ‏\"‏ حق على كل مسلم أن يغتسل في كل سبعة أيام يوما يغسل فيه رأسه وجسده ‏\"‏‏.‏\tثم قال ‏\"‏ حق على كل مسلم أن يغتسل في كل سبعة أيام يوما يغسل فيه رأسه وجسده ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          Allah's Apostle said \"We are the last (to come amongst the nations)      but (will be) the foremost on the Day of Resurrection. They were given     the Holy Scripture before us and we were given the Quran after them.      And this was the day (Friday) about which they differed and Allah gave     us the guidance (for that). So tomorrow (i.e. Saturday) is the Jews'      (day), and the day after tomorrow (i.e. Sunday) is the Christians'.\"      The Prophet (p.b.u.h) remained silent (for a while) and then said, \"It     is obligatory for every Muslim that he should take a bath once in      seven days, when he should wash his head and body.\"",
      "chain": [
        "20285",
        "20299",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "985",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا مسلم، قال حدثنا شعبة، عن الأسود، عن جندب، قال صلى النبي صلى الله عليه وسلم يوم النحر ثم خطب، ثم ذبح فقال ‏\"‏ من ذبح قبل أن يصلي فليذبح أخرى مكانها، ومن لم يذبح فليذبح باسم الله ‏\"‏‏.‏",
      "text_en": " Narrated Jundab:                     On the day of Nahr the Prophet offered the prayer and delivered the Khutba and then slaughtered the sacrifice and said, \"Anybody who slaughtered (his sacrifice) before the prayer should slaughter another animal in lieu of it, and the one who has not yet slaughtered should slaughter the sacrifice mentioning Allah's name on it.\"",
      "chain": [
        "20285",
        "20020",
        "11323",
        "4053"
      ]
    },
    {
      "hadith_no": "1035",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا مسلم، قال حدثنا شعبة، عن الحكم، عن مجاهد، عن ابن عباس، أن النبي صلى الله عليه وسلم قال ‏\"‏ نصرت بالصبا، وأهلكت عاد بالدبور ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"I was granted victory with As-Saba and the nation of 'Ad was destroyed by Ad- Dabur (westerly wind) .",
      "chain": [
        "20285",
        "20020",
        "11069",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "1074",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا مسلم، ومعاذ بن فضالة، قالا أخبرنا هشام، عن يحيى، عن أبي سلمة، قال رأيت أبا هريرة  رضى الله عنه  قرأ ‏{‏إذا السماء انشقت‏}‏ فسجد بها فقلت يا أبا هريرة، ألم أرك تسجد قال لو لم أر النبي صلى الله عليه وسلم يسجد لم أسجد‏.‏",
      "text_en": " Narrated Abu Salma:                     I saw Abu Huraira reciting Idha-Sama' un-Shaqqat and he prostrated during its recitation. I asked Abu Huraira, \"Didn't I see you prostrating?\" Abu Huraira said, \"Had I not seen the Prophet prostrating, I would not have prostrated.\"",
      "chain": [
        "20285",
        "30177",
        "20295",
        "20031",
        "10567"
      ]
    },
    {
      "hadith_no": "1178",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا مسلم بن إبراهيم، أخبرنا شعبة، حدثنا عباس الجريري  هو ابن فروخ  عن أبي عثمان النهدي، عن أبي هريرة، رضى الله عنه قال أوصاني خليلي بثلاث لا أدعهن حتى أموت صوم ثلاثة أيام من كل شهر، وصلاة الضحى، ونوم على وتر‏.‏",
      "text_en": " Narrated Abu Huraira:                     My friend (the Prophet) advised me to do three things and I shall not leave them till I die, these are: To fast three days every month, to offer the Duha prayer, and to offer witr before sleeping.",
      "chain": [
        "20285",
        "20020",
        "11292",
        "11113",
        "13"
      ]
    },
    {
      "hadith_no": "1249",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا مسلم، حدثنا شعبة، حدثنا عبد الرحمن بن الأصبهاني، عن ذكوان، عن أبي سعيد، رضى الله عنه أن النساء، قلن للنبي صلى الله عليه وسلم اجعل لنا يوما‏.‏ فوعظهن، وقال ‏\"‏ أيما امرأة مات لها ثلاثة من الولد كانوا حجابا من النار ‏\"‏‏.‏ قالت امرأة واثنان‏.‏ قال ‏\"‏ واثنان ‏\"‏‏.‏   وقال شريك عن ابن الأصبهاني، حدثني أبو صالح، عن أبي سعيد، وأبي، هريرة  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال أبو هريرة ‏\"‏ لم يبلغوا الحنث ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id:                     The women requested the Prophet, \"Please fix a day for us.\" So the Prophet preached to them and said, \"A woman whose three children died would be screened from the Hell Fire by them,\" Hearing that, a woman asked, \"If two died?\" The Prophet replied, \"Even two (would screen her from the (Hell) Fire. \" And Abu Huraira added, \"Those children should be below the age of puberty. \"",
      "chain": [
        "20285",
        "20020",
        "11364",
        "11161",
        "38"
      ]
    },
    {
      "hadith_no": "1310",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا مسلم  يعني ابن إبراهيم  حدثنا هشام، حدثنا يحيى، عن أبي سلمة، عن أبي سعيد الخدري  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا رأيتم الجنازة فقوموا، فمن تبعها فلا يقعد حتى توضع ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"When you see a funeral procession, you should stand up, and whoever accompanies it should not sit till the coffin is put down.\"",
      "chain": [
        "20285",
        "20295",
        "20031",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "1319",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا مسلم، حدثنا شعبة، حدثنا الشيباني، عن الشعبي، قال أخبرني من، شهد النبي صلى الله عليه وسلم أنه أتى على قبر منبوذ فصفهم وكبر أربعا‏.‏ قلت من حدثك قال ابن عباس رضى الله عنهما‏.‏",
      "text_en": " Narrated Ash-Shaibani:                     Ash Shu`bi said, \"I was informed by a man who had seen the Prophet going to a grave that was separate from the other graves and he aligned the people in rows and said four Takbir.\" I said, \"O Abu `Amr! who narrated (that) to you\"? He said, \"Ibn `Abbas. \"",
      "chain": [
        "20285",
        "20020",
        "11352",
        "11052"
      ]
    },
    {
      "hadith_no": "1377",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا هشام، حدثنا يحيى، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  قال كان رسول الله صلى الله عليه وسلم يدعو ‏\"‏ اللهم إني أعوذ بك من عذاب القبر، ومن عذاب النار، ومن فتنة المحيا والممات، ومن فتنة المسيح الدجال ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle used to invoke (Allah): \"Allahumma ini a`udhu bika min 'adhabi-l-Qabr, wa min 'adhabi-nnar, wa min fitnati-l-mahya wa-lmamat, wa min fitnati-l-masih ad-dajjal. (O Allah! I seek refuge with you from the punishment in the grave and from the punishment in the Hell fire and from the afflictions of life and death, and the afflictions of Al-Masih Ad-Dajjal.\"",
      "chain": [
        "20285",
        "20295",
        "20031",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1452",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا مسلم، حدثنا شعبة، حدثنا عدي، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال خرج النبي صلى الله عليه وسلم يوم عيد فصلى ركعتين لم يصل قبل ولا بعد، ثم مال على النساء ومعه بلال، فوعظهن وأمرهن أن يتصدقن، فجعلت المرأة تلقي القلب والخرص‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet went out for the `Id prayer on the `Id day and offered a two rak`at prayer; and he neither offered a prayer before it or after it. Then he went towards the women along with Bilal. He preached them and ordered them to give in charity. And some (amongst the women) started giving their forearm bangles and earrings.",
      "chain": [
        "20285",
        "20020",
        "11372",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1467",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا شعبة، حدثنا سعيد بن أبي بردة، عن أبيه، عن جده، عن النبي صلى الله عليه وسلم قال ‏\"‏ على كل مسلم صدقة ‏\"‏‏.‏ فقالوا يا نبي الله فمن لم يجد قال ‏\"‏ يعمل بيده فينفع نفسه ويتصدق ‏\"‏‏.‏ قالوا فإن لم يجد قال ‏\"‏ يعين ذا الحاجة الملهوف ‏\"‏‏.‏ قالوا فإن لم يجد‏.‏ قال ‏\"‏ فليعمل بالمعروف، وليمسك عن الشر فإنها له صدقة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Burda:                     from his father from his grandfather that the Prophet said, \"Every Muslim has to give in charity.\" The people asked, \"O Allah's Prophet! If someone has nothing to give, what will he do?\" He said, \"He should work with his hands and benefit himself and also give in charity (from what he earns).\" The people further asked, \"If he cannot find even that?\" He replied, \"He should help the needy who appeal for help.\" Then the people asked, \"If he cannot do that?\" He replied, \"Then he should perform good deeds and keep away from evil deeds and this will be regarded as charitable deeds.\"",
      "chain": [
        "20285",
        "20020",
        "11345",
        "11901"
      ]
    },
    {
      "hadith_no": "1715",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا هشام، وشعبة، قالا حدثنا قتادة، عن أنس  رضى الله عنه  أن النبي صلى الله عليه وسلم رأى رجلا يسوق بدنة، فقال ‏\"‏ اركبها ‏\"‏‏.‏ قال إنها بدنة‏.‏ قال ‏\"‏ اركبها ‏\"‏‏.‏ قال إنها بدنة‏.‏ قال ‏\"‏ اركبها ‏\"‏‏.‏ ثلاثا‏.‏",
      "text_en": " Narrated Anas:                     The Prophet saw a man driving a Badana. He said, \"Ride on it.\" The man replied, \"It is a Badana.\" The Prophet said (again), \"Ride on it.\" He (the man) said, \"It is a Badana.\" The Prophet said thrice, \"Ride on it.\"",
      "chain": [
        "20285",
        "20295",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1787",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا مسلم، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن ابن عباس  رضى الله عنهما  قال رخص للحائض أن تنفر إذا أفاضت‏.‏   قال وسمعت ابن عمر، يقول إنها لا تنفر‏.‏ ثم سمعته يقول بعد إن النبي صلى الله عليه وسلم رخص لهن‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A menstruating woman was allowed to leave Mecca if she had done Tawaf-al-Ifada. Tawus (a subnarrator) said from his father, \"I heard Ibn `Umar saying that she would not depart. Then later I heard him saying that the Prophet had allowed them (menstruating women) to depart.\"",
      "chain": [
        "20285",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1829",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا شعبة، عن محارب، عن جابر  رضى الله عنه  قال نهى النبي صلى الله عليه وسلم أن يطرق أهله ليلا‏.‏",
      "text_en": " Narrated Jabir:                     The Prophet forbade going to one's family at night (on arrival from a journey).",
      "chain": [
        "20285",
        "20020",
        "11389",
        "34"
      ]
    },
    {
      "hadith_no": "1876",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا مسلم، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن ابن عباس  رضى الله عنهما  أن النبي صلى الله عليه وسلم وقت لأهل المدينة ذا الحليفة، ولأهل نجد قرن المنازل، ولأهل اليمن يلملم، هن لهن ولكل آت أتى عليهن من غيرهم ممن أراد الحج والعمرة، فمن كان دون ذلك فمن حيث أنشأ، حتى أهل مكة من مكة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet fixed Dhul-Hulaifa as the Miqat (the place for assuming Ihram) for the people of Medina, and Qaran-al-Manazil for the people of Najd, and Yalamlam for the people of Yemen. These Mawaqit are for those people and also for those who come through these Mawaqit (from places other than the above-mentioned) with the intention of (performing) Hajj and Umra. And those living inside these Mawaqit can assume Ihram from the place where they start; even the people of Mecca can assume Ihram from Mecca.",
      "chain": [
        "20285",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1901",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا هشام، حدثنا يحيى، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من قام ليلة القدر إيمانا واحتسابا غفر له ما تقدم من ذنبه، ومن صام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever established prayers on the night of Qadr out of sincere faith and hoping for a reward from Allah, then all his previous sins will be forgiven; and whoever fasts in the month of Ramadan out of sincere faith, and hoping for a reward from Allah, then all his previous sins will be forgiven.\"",
      "chain": [
        "20285",
        "20295",
        "20031",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1914",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا هشام، حدثنا يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يتقدمن أحدكم رمضان بصوم يوم أو يومين، إلا أن يكون رجل كان يصوم صومه فليصم ذلك اليوم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"None of you should fast a day or two before the month of Ramadan unless he has the habit of fasting (Nawafil) (and if his fasting coincides with that day) then he can fast that day.\"",
      "chain": [
        "20285",
        "20295",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1921",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا هشام، حدثنا قتادة، عن أنس، عن زيد بن ثابت  رضى الله عنه  قال تسحرنا مع النبي صلى الله عليه وسلم ثم قام إلى الصلاة‏.‏ قلت كم كان بين الأذان والسحور قال قدر خمسين آية‏.‏",
      "text_en": " Narrated Anas:                     Zaid bin Thabit said, \"We took the Suhur with the Prophet . Then he stood for the prayer.\" I asked, \"What was the interval between the Suhur and the Adhan?\" He replied, \"The interval was sufficient to recite fifty verses of the Qur'an.\"",
      "chain": [
        "20285",
        "20295",
        "11019",
        "19",
        "49"
      ]
    },
    {
      "hadith_no": "2069",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا مسلم، حدثنا هشام، حدثنا قتادة، عن أنس، ح‏.‏ حدثني محمد بن عبد الله بن حوشب، حدثنا أسباط أبو اليسع البصري، حدثنا هشام الدستوائي، عن قتادة، عن أنس  رضى الله عنه  أنه مشى إلى النبي صلى الله عليه وسلم بخبز شعير، وإهالة سنخة، ولقد رهن النبي صلى الله عليه وسلم درعا له بالمدينة عند يهودي، وأخذ منه شعيرا لأهله، ولقد سمعته يقول ‏\"‏ ما أمسى عند آل محمد صلى الله عليه وسلم صاع بر ولا صاع حب، وإن عنده لتسع نسوة ‏\"‏‏.‏",
      "text_en": " Narrated Qatada:                     Anas went to the Prophet with barley bread having some dissolved fat on it. The Prophet had mortgaged his armor to a Jew in Medina and took from him some barley for his family. Anas heard him saying, \"The household of Muhammad did not possess even a single Sa of wheat or food grains for the evening meal, although he has nine wives to look after.\" (See Hadith No. 685)",
      "chain": [
        "20285",
        "20295",
        "11019",
        "19",
        "30402",
        "20207",
        "20295",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "2226",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا مسلم، حدثنا شعبة، عن الأعمش، عن أبي الضحى، عن مسروق، عن عائشة  رضى الله عنها  لما نزلت آيات سورة البقرة عن آخرها خرج النبي صلى الله عليه وسلم فقال ‏\"‏ حرمت التجارة في الخمر ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     When the last verses of Surat-al-Baqara were revealed, the Prophet went out (of his house to the Mosque) and said, \"The trade of alcohol has become illegal.\"",
      "chain": [
        "20285",
        "20020",
        "11060",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "2275",
      "source": " Sahih Bukhari ",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، عن مسلم، عن مسروق، حدثنا خباب، قال كنت رجلا قينا فعملت للعاص بن وائل فاجتمع لي عنده فأتيته أتقاضاه فقال لا والله لا أقضيك حتى تكفر بمحمد‏.‏ فقلت أما والله حتى تموت ثم تبعث فلا‏.‏ قال وإني لميت ثم مبعوث قلت نعم‏.‏ قال فإنه سيكون لي ثم مال وولد فأقضيك‏.‏ فأنزل الله تعالى ‏{‏أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا‏}‏",
      "text_en": " Narrated Khabbab:                     I was a blacksmith and did some work for Al-`As bin Wail. When he owed me some money for my work, I went to him to ask for that amount. He said, \"I will not pay you unless you disbelieve in Muhammad.\" I said, \"By Allah! I will never do that till you die and be resurrected.\" He said, \"Will I be dead and then resurrected after my death?\" I said, \"Yes.\" He said, \"There I will have property and offspring and then I will pay you your due.\" Then Allah revealed. 'Have you seen him who disbelieved in Our signs, and yet says: I will be given property and offspring?' (19.77)",
      "chain": [
        "30204",
        "20317",
        "11060",
        "20285",
        "11018",
        "149"
      ]
    },
    {
      "hadith_no": "2283",
      "source": " Sahih Bukhari ",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا شعبة، عن محمد بن جحادة، عن أبي حازم، عن أبي هريرة  رضى الله عنه  قال نهى النبي صلى الله عليه وسلم عن كسب الإماء‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet prohibited the earnings of slave girls (through prostitution).",
      "chain": [
        "20285",
        "20020",
        "18897",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "2391",
      "source": " Sahih Bukhari ",
      "chapter": "Loans; Payment of Loans; Freezing of Property; Bankruptcy - كتاب فى الاستقراض",
      "chapter_no": "43",
      "text_ar": "حدثنا مسلم، حدثنا شعبة، عن عبد الملك، عن ربعي، عن حذيفة  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ مات رجل، فقيل له قال كنت أبايع الناس، فأتجوز عن الموسر، وأخفف عن المعسر، فغفر له ‏\"‏‏.‏ قال أبو مسعود سمعته من النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Hudhaifa:                     I heard the Prophet saying, \"Once a man died and was asked, 'What did you use to say (or do) (in your life time)?' He replied, 'I was a businessman and used to give time to the rich to repay his debt and (used to) deduct part of the debt of the poor.' So he was forgiven (his sins.)\" Abu Mas`ud said, \"I heard the same (Hadith) from the Prophet.\"",
      "chain": [
        "20285",
        "20020",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "2454",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا عبد الله بن المبارك، حدثنا موسى بن عقبة، عن سالم، عن أبيه  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ من أخذ من الأرض شيئا بغير حقه خسف به يوم القيامة إلى سبع أرضين ‏\"‏‏.‏ قال أبو عبد الله هذا الحديث ليس بخراسان في كتاب ابن المبارك، أملاه عليهم بالبصرة‏.‏",
      "text_en": " Narrated Salim's father (i.e. `Abdullah):                     The Prophet said, \"Whoever takes a piece of the land of others unjustly, he will sink down the seven earths on the Day of Resurrection.\"",
      "chain": [
        "20285",
        "20025",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "2470",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا مسلم، حدثنا أبو عقيل، حدثنا أبو المتوكل الناجي، قال أتيت جابر بن عبد الله  رضى الله عنهما  قال دخل النبي صلى الله عليه وسلم المسجد، فدخلت إليه، وعقلت الجمل في ناحية البلاط فقلت هذا جملك‏.‏ فخرج فجعل يطيف بالجمل قال ‏\"‏ الثمن والجمل لك ‏\"‏‏.‏",
      "text_en": " Narrated Jabir:                     The Prophet entered the Mosque, and I too went there after tying the camel at the pavement of the Mosque. I said (to the Prophet ), \"This is your camel.\" He came out and started examining the camel and said, \"Both the camel and its price are for you.\"",
      "chain": [
        "20285",
        "11297"
      ]
    },
    {
      "hadith_no": "2483",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا جرير بن حازم، عن محمد بن سيرين، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كان رجل في بني إسرائيل، يقال له جريج، يصلي، فجاءته أمه فدعته، فأبى أن يجيبها، فقال أجيبها أو أصلي ثم أتته، فقالت اللهم لا تمته حتى تريه المومسات‏.‏ وكان جريج في صومعته، فقالت امرأة لأفتنن جريجا‏.‏ فتعرضت له فكلمته فأبى، فأتت راعيا، فأمكنته من نفسها فولدت غلاما، فقالت هو من جريج‏.‏ فأتوه، وكسروا صومعته فأنزلوه وسبوه، فتوضأ وصلى ثم أتى الغلام، فقال من أبوك يا غلام قال الراعي‏.‏ قالوا نبني صومعتك من ذهب‏.‏ قال لا إلا من طين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"There was an Israeli man called Juraij, while he was praying, his mother came and called him, but he did not respond to her call. He said (to himself) whether he should continue the prayer or reply to his mother. She came to him the second time and called him and said, \"O Allah! Do not let him die until he sees the faces of prostitutes.\" Juraij used to live in a hermitage. A woman said that she would entice Juraij, so she went to him and presented herself (for an evil act) but he refused. She then went to a shepherd and allowed him to commit an illegal sexual intercourse with her and later she gave birth to a boy. She alleged that the baby was from Juraij. The people went to Juraij and broke down his hermitage, pulled him out of it and abused him. He performed ablution and offered the prayer, then he went to the male (baby) and asked him; \"O boy! Who is your father?\" The baby replied that his father was the shepherd. The people said that they would build for him a hermitage of gold but Juraij asked them to make it of mud only.\"",
      "chain": [
        "20285",
        "11272",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "2508",
      "source": " Sahih Bukhari ",
      "chapter": "Mortgaging - كتاب الرهن",
      "chapter_no": "48",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا هشام، حدثنا قتادة، عن أنس  رضى الله عنه  قال ولقد رهن النبي صلى الله عليه وسلم درعه بشعير، ومشيت إلى النبي صلى الله عليه وسلم بخبز شعير وإهالة سنخة، ولقد سمعته يقول ‏\"‏ ما أصبح لآل محمد صلى الله عليه وسلم إلا صاع، ولا أمسى ‏\"‏‏.‏ وإنهم لتسعة أبيات‏.‏",
      "text_en": " Narrated Anas:                     No doubt, the Prophet mortgaged his armor for barley grams. Once I took barley bread with some dissolved fat on it to the Prophet and I heard him saying, \"The household of Muhammad did not possess except a Sa (of food grain, barley, etc.) for both the morning and the evening meals although they were nine houses.\"",
      "chain": [
        "20285",
        "20295",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "2589",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن ابن عباس  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم ‏\"‏ العائد في هبته كالكلب يقيء، ثم يعود في قيئه ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"One who takes back his gift (which he has already given) is like a dog that swallows its vomit.\"",
      "chain": [
        "20285",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2621",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا هشام، وشعبة، قالا حدثنا قتادة، عن سعيد بن المسيب، عن ابن عباس  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم ‏\"‏ العائد في هبته كالعائد في قيئه ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"He who takes back his present is like him who swallows his vomit.\"",
      "chain": [
        "20285",
        "20295",
        "20020",
        "11019",
        "11002",
        "17"
      ]
    },
    {
      "hadith_no": "2645",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا همام، حدثنا قتادة، عن جابر بن زيد، عن ابن عباس  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم في بنت حمزة ‏\"‏ لا تحل لي، يحرم من الرضاع ما يحرم من النسب، هي بنت أخي من الرضاعة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said about Hamza's daughter, \"I am not legally permitted to marry her, as foster relations are treated like blood relations (in marital affairs). She is the daughter of my foster brother.\"",
      "chain": [
        "20285",
        "20297",
        "11019",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "2861",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا مسلم، حدثنا أبو عقيل، حدثنا أبو المتوكل الناجي، قال أتيت جابر بن عبد الله الأنصاري، فقلت له حدثني بما، سمعت من، رسول الله صلى الله عليه وسلم قال سافرت معه في بعض أسفاره  قال أبو عقيل لا أدري غزوة أو عمرة  فلما أن أقبلنا قال النبي صلى الله عليه وسلم ‏\"‏ من أحب أن يتعجل إلى أهله فليعجل ‏\"‏‏.‏ قال جابر فأقبلنا وأنا على جمل لي أرمك ليس فيه شية، والناس خلفي، فبينا أنا كذلك إذ قام على، فقال لي النبي صلى الله عليه وسلم ‏\"‏ يا جابر استمسك ‏\"‏‏.‏ فضربه بسوطه ضربة، فوثب البعير مكانه‏.‏ فقال ‏\"‏ أتبيع الجمل ‏\"‏‏.‏ قلت نعم‏.‏ فلما قدمنا المدينة ودخل النبي صلى الله عليه وسلم المسجد في طوائف أصحابه، فدخلت إليه، وعقلت الجمل في ناحية البلاط‏.‏ فقلت له هذا جملك‏.‏ فخرج، فجعل يطيف بالجمل ويقول ‏\"‏ الجمل جملنا ‏\"‏‏.‏ فبعث النبي صلى الله عليه وسلم أواق من ذهب فقال ‏\"‏ أعطوها جابرا ‏\"‏‏.‏ ثم قال ‏\"‏ استوفيت الثمن ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ الثمن والجمل لك ‏\"‏‏.‏",
      "text_en": " Narrated Muslim from Abu `Aqil from Abu Al-Mutawakkil An-Naji:                     I called on Jabir bin `Abdullah Al-Ansari and said to him, \"Relate to me what you have heard from Allah's Apostle .\" He said, \"I accompanied him on one of the journeys.\" (Abu `Aqil said, \"I do not know whether that journey was for the purpose of Jihad or `Umra.\") \"When we were returning,\" Jabir continued, \"the Prophet said, 'Whoever wants to return earlier to his family, should hurry up.' We set off and I was on a black red tainted camel having no defect, and the people were behind me. While I was in that state the camel stopped suddenly (because of exhaustion). On that the Prophet said to me, 'O Jabir, wait!' Then he hit it once with his lash and it started moving on a fast pace. He then said, 'Will you sell the camel?' I replied in the affirmative when we reached Medina, and the Prophet went to the Mosque along with his companions. I, too, went to him after tying the camel on the pavement at the Mosque gate. Then I said to him, 'This is your camel.' He came out and started examining the camel and saying, 'The camel is ours.' Then the Prophet sent some Awaq (i.e. an amount) of gold saying, 'Give it to Jabir.' Then he asked, 'Have you taken the full price (of the camel)?' I replied in the affirmative. He said, 'Both the price and the camel are for you.' ''",
      "chain": [
        "20285",
        "11297"
      ]
    },
    {
      "hadith_no": "3138",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا قرة، حدثنا عمرو بن دينار، عن جابر بن عبد الله  رضى الله عنهما  قال بينما رسول الله صلى الله عليه وسلم يقسم غنيمة بالجعرانة إذ قال له رجل اعدل‏.‏ فقال له ‏\"‏ شقيت إن لم أعدل ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     While Allah's Apostle was distributing the booty at Al-Ja'rana, somebody said to him \"Be just (in your distribution).\" The Prophet replied, \"Verily I would be miserable if I did not act justly.\"",
      "chain": [
        "20285",
        "11301",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "3347",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ فتح الله من ردم يأجوج ومأجوج مثل هذا ‏\"‏‏.‏ وعقد بيده تسعين‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Allah has made an opening in the wall of the Gog and Magog (people) like this, and he made with his hand (with the help of his fingers).",
      "chain": [
        "20285",
        "20299",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "3436",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا جرير بن حازم، عن محمد بن سيرين، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لم يتكلم في المهد إلا ثلاثة عيسى، وكان في بني إسرائيل رجل يقال له جريج، كان يصلي، فجاءته أمه فدعته، فقال أجيبها أو أصلي‏.‏ فقالت اللهم لا تمته حتى تريه وجوه المومسات‏.‏ وكان جريج في صومعته، فتعرضت له امرأة وكلمته فأبى، فأتت راعيا، فأمكنته من نفسها فولدت غلاما، فقالت من جريج‏.‏ فأتوه فكسروا صومعته، وأنزلوه وسبوه، فتوضأ وصلى ثم أتى الغلام فقال من أبوك يا غلام قال الراعي‏.‏ قالوا نبني صومعتك من ذهب‏.‏ قال لا إلا من طين‏.‏ وكانت امرأة ترضع ابنا لها من بني إسرائيل، فمر بها رجل راكب ذو شارة، فقالت اللهم اجعل ابني مثله‏.‏ فترك ثديها، وأقبل على الراكب فقال اللهم لا تجعلني مثله‏.‏ ثم أقبل على ثديها يمصه  قال أبو هريرة كأني أنظر إلى النبي صلى الله عليه وسلم يمص إصبعه  ثم مر بأمة فقالت اللهم لا تجعل ابني مثل هذه‏.‏ فترك ثديها فقال اللهم اجعلني مثلها‏.‏ فقالت لم ذاك فقال الراكب جبار من الجبابرة، وهذه الأمة يقولون سرقت زنيت‏.‏ ولم تفعل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"None spoke in cradle but three: (The first was) Jesus, (the second was), there a man from Bani Israel called Juraij. While he was offering his prayers, his mother came and called him. He said (to himself), 'Shall I answer her or keep on praying?\" (He went on praying) and did not answer her, his mother said, \"O Allah! Do not let him die till he sees the faces of prostitutes.\" So while he was in his hermitage, a lady came and sought to seduce him, but he refused. So she went to a shepherd and presented herself to him to commit illegal sexual intercourse with her and then later she gave birth to a child and claimed that it belonged to Juraij. The people, therefore, came to him and dismantled his hermitage and expelled him out of it and abused him. Juraij performed the ablution and offered prayer, and then came to the child and said, 'O child! Who is your father?' The child replied, 'The shepherd.' (After hearing this) the people said, 'We shall rebuild your hermitage of gold,' but he said, 'No, of nothing but mud.'(The third was the hero of the following story) A lady from Bani Israel was nursing her child at her breast when a handsome rider passed by her. She said, 'O Allah ! Make my child like him.' On that the child left her breast, and facing the rider said, 'O Allah! Do not make me like him.' The child then started to suck her breast again. (Abu Huraira further said, \"As if I were now looking at the Prophet sucking his finger (in way of demonstration.\") After a while the people passed by, with a lady slave and she (i.e. the child's mother) said, 'O Allah! Do not make my child like this (slave girl)!, On that the child left her breast and said, 'O Allah! Make me like her.' When she asked why, the child replied, 'The rider is one of the tyrants while this slave girl is falsely accused of theft and illegal sexual intercourse.\"",
      "chain": [
        "20285",
        "11272",
        "11035",
        "13"
      ]
    }
  ],
  "total_hadiths": 251
}