{
  "id": "20281",
  "name": "Muhammad bin 'Abdur Rahman al-Tafawi محمد بن عبد الرحمن الطفاوي",
  "full_name": "Muhammad bin 'Abdur Rahman al-Tafawi محمد بن عبد الرحمن الطفاوي",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ خ  ت  س  -  صدوق له أوهام ]"
    ],
    "tags": [
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11298",
      "name": "'Awf bin Abi Jamila al-A'rabi عوف بن أبي جميلة الأعرابي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11585",
      "name": "Da'ud bin Abi Hnd داود بن أبي هند",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "15097",
      "name": "Husayn bin 'Abdur Rahman al-Salmi حصين بن عبد الرحمن السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30160",
      "name": "Muhammad bin Bashar Bindar محمد بن بشار بندار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30153",
      "name": "'Amr bin 'Ali bin Bahr al-Bahli عمرو بن علي بن بحر الباهلي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30400",
      "name": "Y'aqub bin Ibrahim bin Kathir يعقوب بن إبراهيم بن كثير بن زيد الدورقي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30449",
      "name": "Muhammad bin 'Abdul A'la محمد بن عبد الأعلى",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30161",
      "name": "Muhammad bin Abi Bakr bin 'Ali محمد بن أبي بكر بن علي بن عطاء المقدمي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30121",
      "name": "Ahmed bin al-Miqdam أحمد بن المقدام",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "35099",
      "name": "'Ali bin al-Mndhr علي بن المنذر",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2057",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثني أحمد بن المقدام العجلي، حدثنا محمد بن عبد الرحمن الطفاوي، حدثنا هشام بن عروة،، عن أبيه، عن عائشة  رضى الله عنها  أن قوما، قالوا يا رسول الله، إن قوما يأتوننا باللحم لا ندري أذكروا اسم الله عليه أم لا فقال رسول الله صلى الله عليه وسلم ‏\"‏ سموا الله عليه وكلوه ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Some people said, \"O Allah's Apostle! Meat is brought to us by some people and we are not sure whether the name of Allah has been mentioned on it or not (at the time of slaughtering the animals).\" Allah's Apostle said (to them), \"Mention the name of Allah and eat it.\"",
      "chain": [
        "30121",
        "20281",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6492",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا محمد بن عبد الرحمن أبو المنذر الطفاوي، عن سليمان الأعمش، قال حدثني مجاهد، عن عبد الله بن عمر  رضى الله عنهما  قال أخذ رسول الله صلى الله عليه وسلم بمنكبي فقال ‏\"‏ كن في الدنيا كأنك غريب، أو عابر سبيل ‏\"‏‏.‏ وكان ابن عمر يقول إذا أمسيت فلا تنتظر الصباح، وإذا أصبحت فلا تنتظر المساء، وخذ من صحتك لمرضك، ومن حياتك لموتك‏.‏",
      "text_en": " Narrated Mujahid:                     `Abdullah bin `Umar said, \"Allah's Apostle took hold of my shoulder and said, 'Be in this world as if you were a stranger or a traveler.\" The sub-narrator added: Ibn `Umar used to say, \"If you survive till the evening, do not expect to be alive in the morning, and if you survive till the morning, do not expect to be alive in the evening, and take from your health for your sickness, and (take) from your life for your death.\"",
      "chain": [
        "30026",
        "20281",
        "11060",
        "11028",
        "18"
      ]
    },
    {
      "hadith_no": "7084",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا أحمد بن المقدام العجلي، حدثنا محمد بن عبد الرحمن الطفاوي، حدثنا أيوب، عن محمد، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ أعطيت مفاتيح الكلم، ونصرت بالرعب، وبينما أنا نائم البارحة إذ أتيت بمفاتيح خزائن الأرض حتى وضعت في يدي ‏\"‏‏.‏ قال أبو هريرة فذهب رسول الله صلى الله عليه وسلم وأنتم تنتقلونها‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"I have been given the keys of eloquent speech and given victory with awe (cast into the hearts of the enemy), and while I was sleeping last night, the keys of the treasures of the earth were brought to me till they were put in my hand.\" Abu Huraira added: Allah's Apostle left (this world) and now you people are carrying those treasures from place to place.",
      "chain": [
        "30121",
        "20281",
        "11015",
        "20278",
        "13"
      ]
    },
    {
      "hadith_no": "4787",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا محمد بن عبد الرحمن الطفاوي، عن هشام بن عروة، عن أبيه، عن عبد الله، - يعني ابن الزبير - في قوله ‏{‏ خذ العفو ‏}‏ قال أمر نبي الله صلى الله عليه وسلم أن يأخذ العفو من أخلاق الناس ‏.‏",
      "text_en": " EXPLAINING THE QURANIC VERSE “HOLD TO FORGIVENESS”, ABD ALLAH B. AL-ZUBAIR SAID:                      THE PROPHET OF ALLAH (MAY PEACE BE UPON HIM) WAS COMMANDED TO HOLD TO FORGIVENESS FROM THE CONDUCT OF THE PEOPLE.",
      "chain": [
        "20184",
        "20281",
        "11065",
        "10511",
        "106"
      ]
    },
    {
      "hadith_no": "884",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني البصري، حدثنا محمد بن عبد الرحمن الطفاوي، حدثنا هشام بن عروة، عن أبيه، عن عائشة، قالت كانت قريش ومن كان على دينها وهم الحمس يقفون بالمزدلفة يقولون نحن قطين الله ‏.‏ وكان من سواهم يقفون بعرفة فأنزل الله تعالى ‏:‏ ‏(‏ثم أفيضوا من حيث أفاض الناس ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال ومعنى هذا الحديث أن أهل مكة كانوا لا يخرجون من الحرم وعرفة خارج من الحرم وأهل مكة كانوا يقفون بالمزدلفة ويقولون نحن قطين الله يعني سكان الله ومن سوى أهل مكة كانوا يقفون بعرفات ‏.‏ فأنزل الله تعالى‏:‏ ‏(‏ثم أفيضوا من حيث أفاض الناس ‏)‏ ‏.‏ والحمس هم أهل الحرم ‏.‏",
      "text_en": " Aishah narrated:                     \"The Quraish and those who followed their religion - and they were called Al-Hums - would stand at Al-Muzdalifah, and they would say: 'We are the people of Allah.' The others would stand at Arafat, so Allah the Mighty and Sublime revealed: Then depart from where the people depart.\"",
      "chain": [
        "20281",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2310",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو الأشعث، أحمد بن المقدام العجلي حدثنا محمد بن عبد الرحمن الطفاوي، حدثنا هشام بن عروة، عن أبيه، عن عائشة، قالت لما نزلت هذه الآية ‏:‏ ‏(‏ وأنذر عشيرتك الأقربين ‏)‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ يا صفية بنت عبد المطلب يا فاطمة بنت محمد يا بني عبد المطلب إني لا أملك لكم من الله شيئا سلوني من مالي ما شئتم ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وأبي موسى وابن عباس ‏.‏ قال حديث عائشة حديث حسن غريب ‏.‏ هكذا روى بعضهم عن هشام بن عروة نحو هذا وروى بعضهم عن هشام عن أبيه عن النبي صلى الله عليه وسلم مرسلا لم يذكر فيه عن عائشة ‏.‏",
      "text_en": " 'Aishah narrated:                     \"When this Ayah was revealed: And warn your near kindred....(26:214), the Messenger of Allah (s.a.w) said:\"O Safiyyah bint 'Abdul-Muttalib! O Fatimah bint Muhammed! O Banu 'Abdul-Muttalib! I have no authority on your behalf over Allah for anything. Ask me for whatever you want of my wealth.\"",
      "chain": [
        "30121",
        "20281",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3486",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو الأشعث، أحمد بن المقدام العجلي حدثنا محمد بن عبد الرحمن الطفاوي، حدثنا هشام بن عروة، عن أبيه، عن عائشة، قالت لما نزلت هذه الآية ‏:‏ ‏(‏وأنذر عشيرتك الأقربين ‏)‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ يا صفية بنت عبد المطلب يا فاطمة بنت محمد يا بني عبد المطلب إني لا أملك لكم من الله شيئا سلوني من مالي ما شئتم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وهكذا روى وكيع وغير واحد هذا الحديث عن هشام بن عروة عن أبيه عن عائشة نحو حديث محمد بن عبد الرحمن الطفاوي ‏.‏ روى بعضهم عن هشام بن عروة عن أبيه عن النبي صلى الله عليه وسلم مرسلا ولم يذكر فيه عن عائشة ‏.‏ وفي الباب عن علي وابن عباس ‏.‏",
      "text_en": " Narrated 'Aishah:                     \"When this Ayah was revealed: 'And warn your tribe of near kindred (26:214).' The Messenger of Allah (ﷺ) said: 'O Safiyyah bint 'Abdul-Muttalib! O Fatimah bint Muhammad! O Banu 'Abdul-Muttalib! I have no power to help you at all before Allah! Ask of me whatever you want from my wealth.'\"",
      "chain": [
        "30121",
        "20281",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "443",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا محمد بن عبد الرحمن الطفاوي، قال حدثنا أيوب، عن أبي قلابة، عن أنس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا نعس أحدكم في صلاته فلينصرف وليرقد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas that the Messenger of Allah (ﷺ) said:                      \"If anyone of you feels drowsy during his Salah, let him go and take a nap.\"",
      "chain": [
        "20184",
        "20281",
        "11015",
        "11047",
        "19"
      ]
    }
  ],
  "total_hadiths": 8
}