{
  "id": "20283",
  "name": "Muhammad bin al-Fadl 'Aram محمد بن الفضل السدوسي أبو النعمان عارم",
  "full_name": "Muhammad bin al-Fadl 'Aram محمد بن الفضل السدوسي أبو النعمان عارم",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "140",
      "date_gregorian": "NA",
      "date_display": [
        "140 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "224",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-Sadusi",
      "al-Basri",
      "Imam",
      "Hafiz"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11307",
      "name": "Mahdi bin Maymun al-Azdi مهدي بن ميمون الأزدي المعولي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20299",
      "name": "Wahayb bin Khalid bin 'Ajlan al-Bahli وهيب بن خالد بن عجلان الباهلي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "19857",
      "name": "Muhammad bin Sulaym محمد بن سليم أبو هلال الراسبي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20258",
      "name": "'Abdul Warith bin Sa'id bin Dhakwan عبد الوارث بن سعيد بن ذكوان",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20256",
      "name": "'Abdul Wahid bin Ziyad عبد الواحد بن زياد العبدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20424",
      "name": "Da'ud bin Abi al-Frat داود بن أبي الفرات عمرو",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11",
      "name": "Sa'id bin Zayd ( سعيد بن زيد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20469",
      "name": "Wadah bin 'Abdullah al-Yashkari وضاح بن عبد الله اليشكري أبو عوانة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "38204",
      "name": "Khshysh bin Asrm bin al-'Aswad خشيش بن أصرم بن الأسود",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "58",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا أبو عوانة، عن زياد بن علاقة، قال سمعت جرير بن عبد الله، يقول يوم مات المغيرة بن شعبة قام فحمد الله وأثنى عليه وقال عليكم باتقاء الله وحده لا شريك له، والوقار والسكينة حتى يأتيكم أمير، فإنما يأتيكم الآن، ثم قال استعفوا لأميركم، فإنه كان يحب العفو‏.‏ ثم قال أما بعد، فإني أتيت النبي صلى الله عليه وسلم قلت أبايعك على الإسلام‏.‏ فشرط على والنصح لكل مسلم‏.‏ فبايعته على هذا، ورب هذا المسجد إني لناصح لكم‏.‏ ثم استغفر ونزل‏.‏",
      "text_en": "      Narrated Ziyad bin'Ilaqa:                          I heard Jarir bin 'Abdullah (Praising Allah). On the day when      Al-Mughira bin Shu'ba died, he (Jarir) got up (on the pulpit) and      thanked and praised Allah and said, \"Be afraid of Allah alone Who has      none along with Him to be worshipped.(You should) be calm and quiet      till the (new) chief comes to you and he will come to you soon. Ask      Allah's forgiveness for your (late) chief because he himself loved to      forgive others.\" Jarir added, \"Amma badu (now then), I went to the      Prophet and said, 'I give my pledge of allegiance to you for Islam.\"      The Prophet conditioned (my pledge) for me to be sincere and true to      every Muslim so I gave my pledge to him for this. By the Lord of this      mosque! I am sincere and true to you (Muslims). Then Jarir asked for      Allah's forgiveness and came down (from the pulpit).",
      "chain": [
        "20283",
        "20469",
        "11339",
        "4057"
      ]
    },
    {
      "hadith_no": "60",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو النعمان، عارم بن الفضل قال حدثنا أبو عوانة، عن أبي بشر، عن يوسف بن ماهك، عن عبد الله بن عمرو، قال تخلف عنا النبي صلى الله عليه وسلم في سفرة سافرناها، فأدركنا وقد أرهقتنا الصلاة ونحن نتوضأ، فجعلنا نمسح على أرجلنا، فنادى بأعلى صوته ‏\"‏ ويل للأعقاب من النار ‏\"‏‏.‏ مرتين أو ثلاثا‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     Once the Prophet remained behind us in a journey. He joined us while we were performing ablution for the prayer which was over-due. We were just passing wet hands over our feet (and not washing them properly) so the Prophet addressed us in a loud voice and said twice or thrice: \"Save your heels from the fire.\"",
      "chain": [
        "20283",
        "20469",
        "11419",
        "11264",
        "29"
      ]
    },
    {
      "hadith_no": "244",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا حماد بن زيد، عن غيلان بن جرير، عن أبي بردة، عن أبيه، قال أتيت النبي صلى الله عليه وسلم فوجدته يستن بسواك بيده يقول ‏\"‏ أع أع ‏\"‏، والسواك في فيه، كأنه يتهوع‏.‏",
      "text_en": " Narrated Abu Burda:                     My father said, \"I came to the Prophet and saw him carrying a Siwak in his hand and cleansing his teeth, saying, 'U' U',\" as if he was retching while the Siwak was in his mouth.\"",
      "chain": [
        "20283",
        "20022",
        "11300",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "270",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا أبو عوانة، عن إبراهيم بن محمد بن المنتشر، عن أبيه، قال سألت عائشة فذكرت لها قول ابن عمر ما أحب أن أصبح، محرما أنضخ طيبا‏.‏ فقالت عائشة أنا طيبت رسول الله صلى الله عليه وسلم ثم طاف في نسائه ثم أصبح محرما‏.‏",
      "text_en": " Narrated Muhammad bin Al-Muntathir:                     on the authority of his father that he had asked `Aisha about the saying of Ibn `Umar (i.e. he did not like to be a Muhrim while the smell of scent was still coming from his body). `Aisha said, \"I scented Allah's Apostle and he went round (had sexual intercourse with) all his wives, and in the morning he was Muhrim (after taking a bath).",
      "chain": [
        "20283",
        "20469",
        "11321",
        "11388",
        "53"
      ]
    },
    {
      "hadith_no": "303",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا عبد الواحد، قال حدثنا الشيباني، قال حدثنا عبد الله بن شداد، قال سمعت ميمونة، كان رسول الله صلى الله عليه وسلم إذا أراد أن يباشر امرأة من نسائه أمرها فاتزرت وهى حائض‏.‏ ورواه سفيان عن الشيباني‏.‏",
      "text_en": " Narrated Maimuna:                     When ever Allah's Apostle wanted to fondle any of his wives during the periods (menses), he used to ask her to wear an Izar.",
      "chain": [
        "20283",
        "20256",
        "11352",
        "169",
        "61"
      ]
    },
    {
      "hadith_no": "468",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو النعمان، وقتيبة، قالا حدثنا حماد، عن أيوب، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم قدم مكة، فدعا عثمان بن طلحة، ففتح الباب، فدخل النبي صلى الله عليه وسلم وبلال وأسامة بن زيد وعثمان بن طلحة، ثم أغلق الباب، فلبث فيه ساعة ثم خرجوا‏.‏ قال ابن عمر فبدرت فسألت بلالا فقال صلى فيه‏.‏ فقلت في أى قال بين الأسطوانتين‏.‏ قال ابن عمر فذهب على أن أسأله كم صلى‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar said, \"The Prophet arrived at Mecca and sent for `Uthman bin Talha. He opened the gate of the Ka`ba and the Prophet, Bilal, Usama bin Zaid and `Uthman bin Talha entered the Ka`ba and then they closed its door (from inside). They stayed there for an hour, and then came out.\" Ibn `Umar added, \"I quickly went to Bilal and asked him (whether the Prophet had prayed). Bilal replied, 'He prayed in it.' I asked, 'Where?' He replied, 'Between the two pillars.' \"Ibn `Umar added, \"I forgot to ask how many rak`at he (the Prophet) had prayed in the Ka`ba.\"",
      "chain": [
        "20283",
        "30367",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "473",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا حماد، عن أيوب، عن نافع، عن ابن عمر، أن رجلا، جاء إلى النبي صلى الله عليه وسلم وهو يخطب فقال كيف صلاة الليل فقال ‏\"‏ مثنى مثنى، فإذا خشيت الصبح فأوتر بواحدة، توتر لك ما قد صليت ‏\"‏‏.‏ قال الوليد بن كثير حدثني عبيد الله بن عبد الله أن ابن عمر حدثهم أن رجلا نادى النبي صلى الله عليه وسلم وهو في المسجد‏.‏",
      "text_en": " Narrated Ibn `Umar:                     A man came to the Prophet while he was delivering the sermon and asked him how to offer the night prayers. The Prophet replied, 'Pray two rak`at at a time and then two and then two and so on and if you are afraid of dawn (the approach of the time of the Fajr prayer) pray one rak`a and that will be the with for all the rak`at which you have prayed.\" Narrated 'Ubaidullah bin `Abdullah bin `Umar: A man called the Prophet while he was in the mosque.",
      "chain": [
        "20283",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "518",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا عبد الواحد بن زياد، قال حدثنا الشيباني، سليمان حدثنا عبد الله بن شداد، قال سمعت ميمونة، تقول كان النبي صلى الله عليه وسلم يصلي وأنا إلى جنبه نائمة، فإذا سجد أصابني ثوبه، وأنا حائض‏.‏ وزاد مسدد عن خالد قال حدثنا سليمان الشيباني، وأنا حائض‏.‏",
      "text_en": " Narrated Maimuna:                     The Prophet used to pray while I used to sleep beside him during my periods (menses) and in prostration his garment used to touch me.",
      "chain": [
        "20283",
        "20256",
        "169"
      ]
    },
    {
      "hadith_no": "543",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا حماد  هو ابن زيد  عن عمرو بن دينار، عن جابر بن زيد، عن ابن عباس، أن النبي صلى الله عليه وسلم صلى بالمدينة سبعا وثمانيا الظهر والعصر، والمغرب والعشاء‏.‏ فقال أيوب لعله في ليلة مطيرة‏.‏ قال عسى‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     \"The Prophet prayed eight rak`at for the Zuhr and `Asr, and seven for the Maghrib and `Isha prayers in Medina.\" Aiyub said, \"Perhaps those were rainy nights.\" Anas said, \"May be.\"",
      "chain": [
        "20283",
        "20022",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "589",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن أيوب، عن نافع، عن ابن عمر، قال أصلي كما رأيت أصحابي يصلون، لا أنهى أحدا يصلي بليل ولا نهار ما شاء، غير أن لا تحروا طلوع الشمس ولا غروبها‏.‏",
      "text_en": " Narrated Ibn `Umar:                     I pray as I saw my companions praying. I do not forbid praying at any time during the day or night except at sunset and sunrise.",
      "chain": [
        "20283",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "602",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا معتمر بن سليمان، قال حدثنا أبي، حدثنا أبو عثمان، عن عبد الرحمن بن أبي بكر، أن أصحاب الصفة، كانوا أناسا فقراء، وأن النبي صلى الله عليه وسلم قال ‏\"‏ من كان عنده طعام اثنين فليذهب بثالث، وإن أربع فخامس أو سادس ‏\"‏‏.‏ وأن أبا بكر جاء بثلاثة فانطلق النبي صلى الله عليه وسلم بعشرة، قال فهو أنا وأبي وأمي، فلا أدري قال وامرأتي وخادم بيننا وبين بيت أبي بكر‏.‏ وإن أبا بكر تعشى عند النبي صلى الله عليه وسلم ثم لبث حيث صليت العشاء، ثم رجع فلبث حتى تعشى النبي صلى الله عليه وسلم فجاء بعد ما مضى من الليل ما شاء الله، قالت له امرأته وما حبسك عن أضيافك  أو قالت ضيفك  قال أوما عشيتيهم قالت أبوا حتى تجيء، قد عرضوا فأبوا‏.‏ قال فذهبت أنا فاختبأت فقال يا غنثر، فجدع وسب، وقال كلوا لا هنيئا‏.‏ فقال والله لا أطعمه أبدا، وايم الله ما كنا نأخذ من لقمة إلا ربا من أسفلها أكثر منها‏.‏ قال يعني حتى شبعوا وصارت أكثر مما كانت قبل ذلك، فنظر إليها أبو بكر فإذا هي كما هي أو أكثر منها‏.‏ فقال لامرأته يا أخت بني فراس ما هذا قالت لا وقرة عيني لهي الآن أكثر منها قبل ذلك بثلاث مرات‏.‏ فأكل منها أبو بكر وقال إنما كان ذلك من الشيطان  يعني يمينه  ثم أكل منها لقمة، ثم حملها إلى النبي صلى الله عليه وسلم فأصبحت عنده، وكان بيننا وبين قوم عقد، فمضى الأجل، ففرقنا اثنا عشر رجلا، مع كل رجل منهم أناس، الله أعلم كم مع كل رجل فأكلوا منها أجمعون، أو كما قال‏.‏",
      "text_en": " Narrated Abu `Uthman:                     `Abdur Rahman bin Abi Bakr said, \"The Suffa Companions were poor people and the Prophet said, 'Whoever has food for two persons should take a third one from them (Suffa companions). And whosoever has food for four persons he should take one or two from them' Abu Bakr took three men and the Prophet took ten of them.\" `Abdur Rahman added, my father my mother and I were there (in the house). (The sub-narrator is in doubt whether `Abdur Rahman also said, 'My wife and our servant who was common for both my house and Abu Bakr's house). Abu Bakr took his supper with the Prophet and remained there till the `Isha' prayer was offered. Abu Bakr went back and stayed with the Prophet till the Prophet took his meal and then Abu Bakr returned to his house after a long portion of the night had passed. Abu Bakr's wife said, 'What detained you from your guests (or guest)?' He said, 'Have you not served them yet?' She said, 'They refused to eat until you come. The food was served for them but they refused.\" `Abdur Rahman added, \"I went away and hid myself (being afraid of Abu Bakr) and in the meantime he (Abu Bakr) called me, 'O Ghunthar (a harsh word)!' and also called me bad names and abused me and then said (to his family), 'Eat. No welcome for you.' Then (the supper was served). Abu Bakr took an oath that he would not eat that food. The narrator added: By Allah, whenever any one of us (myself and the guests of Suffa companions) took anything from the food, it increased from underneath. We all ate to our fill and the food was more than it was before its serving. Abu Bakr looked at it (the food) and found it as it was before serving or even more than that. He addressed his wife (saying) 'O the sister of Bani Firas! What is this?' She said, 'O the pleasure of my eyes! The food is now three times more than it was before.' Abu Bakr ate from it, and said, 'That (oath) was from Satan' meaning his oath (not to eat). Then he again took a morsel (mouthful) from it and then took the rest of it to the Prophet. So that meal was with the Prophet. There was a treaty between us and some people, and when the period of that treaty had elapsed the Prophet divided us into twelve (groups) (the Prophet's companions) each being headed by a man. Allah knows how many men were under the command of each (leader). So all of them (12 groups of men) ate of that meal.\"",
      "chain": [
        "20283",
        "20288",
        "11289",
        "11113",
        "107"
      ]
    },
    {
      "hadith_no": "711",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا سليمان بن حرب، وأبو النعمان، قالا حدثنا حماد بن زيد، عن أيوب، عن عمرو بن دينار، عن جابر، قال كان معاذ يصلي مع النبي صلى الله عليه وسلم ثم يأتي قومه فيصلي بهم‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Mu`adh used to pray with the Prophet and then go and lead his people (tribe) in the prayer.",
      "chain": [
        "20193",
        "20283",
        "20022",
        "11015",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "758",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو النعمان، حدثنا أبو عوانة، عن عبد الملك بن عمير، عن جابر بن سمرة، قال قال سعد كنت أصلي بهم صلاة رسول الله صلى الله عليه وسلم صلاتى العشي لا أخرم عنها، أركد في الأوليين وأحذف في الأخريين‏.‏ فقال عمر  رضى الله عنه  ذلك الظن بك‏.‏",
      "text_en": " Narrated Jabir bin Samura:                     Sa`d said, \"I used to pray with them a prayer similar to that of Allah's Apostle (the prayer of Zuhr and `Asr) reducing nothing from them. I used to prolong the first two rak`at and shorten the last two rak`at.\" `Umar said to Sa`d \"This was what we thought about you.\"",
      "chain": [
        "20283",
        "20469",
        "11368",
        "393"
      ]
    },
    {
      "hadith_no": "766",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا معتمر، عن أبيه، عن بكر، عن أبي رافع، قال صليت مع أبي هريرة العتمة فقرأ ‏{‏إذا السماء انشقت‏}‏ فسجد فقلت له قال سجدت خلف أبي القاسم صلى الله عليه وسلم فلا أزال أسجد بها حتى ألقاه‏.‏",
      "text_en": " Narrated Abu Rafi`:                     I offered the `Isha' prayer behind Abu Huraira and he recited, \"Idha s-samaa'u n-shaqqat\" (84) and prostrated. On my inquiring, he said, \"I prostrated behind Abul-Qasim (the Prophet) (when he recited that Sura) and I will go on doing it till I meet him.\"",
      "chain": [
        "20283",
        "20288",
        "11289",
        "11267",
        "479"
      ]
    },
    {
      "hadith_no": "786",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا حماد، عن غيلان بن جرير، عن مطرف بن عبد الله، قال صليت خلف علي بن أبي طالب  رضى الله عنه  أنا وعمران بن حصين،، فكان إذا سجد كبر، وإذا رفع رأسه كبر، وإذا نهض من الركعتين كبر، فلما قضى الصلاة أخذ بيدي عمران بن حصين فقال قد ذكرني هذا صلاة محمد صلى الله عليه وسلم‏.‏ أو قال لقد صلى بنا صلاة محمد صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Mutarrif bin `Abdullah:                     `Imran bin Husain and I offered the prayer behind `Ali bin Abi Talib. When `Ali prostrated, he said the Takbir, when he raised his head, he said the Takbir and when he got up for the third rak`a he said the Takbir. On completion of the prayer `Imran took my hand and said, \"This (i.e. `Ali) made me remember the prayer of Muhammad\" Or he said, \"He led us in a prayer like that of Muhammad.\"",
      "chain": [
        "20283",
        "20022",
        "11300",
        "11305"
      ]
    },
    {
      "hadith_no": "815",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا حماد  وهو ابن زيد  عن عمرو بن دينار، عن طاوس، عن ابن عباس، قال أمر النبي صلى الله عليه وسلم أن يسجد على سبعة أعظم، ولا يكف ثوبه ولا شعره‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet was ordered to prostrate on seven bony parts and not to tuck up his clothes or hair.",
      "chain": [
        "20283",
        "20022",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "819",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا حماد، عن أيوب، عن أبي قلابة، أن مالك بن الحويرث، قال لأصحابه ألا أنبئكم صلاة رسول الله صلى الله عليه وسلم قال وذاك في غير حين صلاة، فقام، ثم ركع فكبر ثم رفع رأسه، فقام هنية، ثم سجد ثم رفع رأسه هنية، فصلى صلاة عمرو بن سلمة شيخنا هذا‏.‏ قال أيوب كان يفعل شيئا لم أرهم يفعلونه، كان يقعد في الثالثة والرابعة‏.‏ قال فأتينا النبي صلى الله عليه وسلم فأقمنا عنده فقال ‏\"‏ لو رجعتم إلى أهليكم صلوا صلاة كذا في حين كذا، صلوا صلاة كذا في حين كذا، فإذا حضرت الصلاة فليؤذن أحدكم وليؤمكم أكبركم ‏\"‏",
      "text_en": " Narrated Abu Qilaba:                     Once Malik bin Huwairith said to his friends, \"Shall I show you how Allah's Apostle used to offer his prayers?\" And it was not the time for any of the compulsory congregational prayers. So he stood up (for the prayer) bowed and said the Takbir, then he raised his head and remained standing for a while and then prostrated and raised his head for a while (sat up for a while). He prayed like our Sheikh `Amr Ibn Salama. (Aiyub said, \"The latter used to do a thing which I did not see the people doing i.e. he used to sit between the third and the fourth rak`a). Malik bin Huwairith said, \"We came to the Prophet (after embracing Islam) and stayed with him. He said to us, 'When you go back to your families, pray such and such a prayer at such and such a time, pray such and such a prayer at such and such a time, and when there is the time for the prayer then only of you should pronounce the Adhan for the prayer and the oldest of you should lead the prayer.\"",
      "chain": [
        "20283",
        "20022",
        "11015",
        "11047",
        "5265"
      ]
    },
    {
      "hadith_no": "930",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا حماد بن زيد، عن عمرو بن دينار، عن جابر بن عبد الله، قال جاء رجل والنبي صلى الله عليه وسلم يخطب الناس يوم الجمعة فقال ‏\"‏ أصليت يا فلان ‏\"‏‏.‏ قال لا‏.‏ قال ‏\"‏ قم فاركع ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     A person entered the mosque while the Prophet was delivering the Khutba on a Friday. The Prophet said to him, \"Have you prayed?\" The man replied in the negative. The Prophet said, \"Get up and pray two rak`at.\"",
      "chain": [
        "20283",
        "20022",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "995",
      "source": " Sahih Bukhari ",
      "chapter": "Witr Prayer - كتاب الوتر",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا حماد بن زيد، قال حدثنا أنس بن سيرين، قال قلت لابن عمر أرأيت الركعتين قبل صلاة الغداة أطيل فيهما القراءة فقال كان النبي صلى الله عليه وسلم يصلي من الليل مثنى مثنى، ويوتر بركعة ويصلي الركعتين قبل صلاة الغداة وكأن الأذان بأذنيه‏.‏ قال حماد أى سرعة‏.‏",
      "text_en": " Narrated Anas bin Seereen:                     I asked Ibn `Umar, \"What is your opinion about the two rak`at before the Fajr (compulsory) prayer, as to prolonging the recitation in them?\" He said, \"The Prophet (p.b.u.h) used to pray at night two rak`at followed by two and so on, and end the prayer by one rak`a witr. He used to offer two rak`at before the Fajr prayer immediately after the Adhan.\" (Hammad, the sub-narrator said, \"That meant (that he prayed) quickly.)\"",
      "chain": [
        "20283",
        "20022",
        "11038"
      ]
    },
    {
      "hadith_no": "1069",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا سليمان بن حرب، وأبو النعمان، قالا حدثنا حماد، عن أيوب، عن عكرمة، عن ابن عباس  رضى الله عنهما  قال ‏{‏ص‏}‏ ليس من عزائم السجود، وقد رأيت النبي صلى الله عليه وسلم يسجد فيها‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The prostration of Sa`d is not a compulsory one but I saw the Prophet prostrating while reciting it.",
      "chain": [
        "20193",
        "20283",
        "20022",
        "11015",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1156",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن أيوب، عن نافع، عن ابن عمر، رضى الله عنهما قال رأيت على عهد النبي صلى الله عليه وسلم كأن بيدي قطعة إستبرق، فكأني لا أريد مكانا من الجنة إلا طارت إليه، ورأيت كأن اثنين أتياني أرادا أن يذهبا بي إلى النار فتلقاهما ملك فقال لم ترع خليا عنه‏.‏ فقصت حفصة على النبي صلى الله عليه وسلم إحدى رؤياى فقال النبي صلى الله عليه وسلم ‏\"‏ نعم الرجل عبد الله لو كان يصلي من الليل ‏\"‏‏.‏ فكان عبد الله  رضى الله عنه  يصلي من الليل‏.‏ وكانوا لا يزالون يقصون على النبي صلى الله عليه وسلم الرؤيا أنها في الليلة السابعة من العشر الأواخر، فقال النبي صلى الله عليه وسلم ‏\"‏ أرى رؤياكم قد تواطت في العشر الأواخر، فمن كان متحريها فليتحرها من العشر الأواخر ‏\"‏‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar said, \"In the lifetime of the Prophet I dreamt that a piece of silk cloth was in my hand and it flew with me to whichever part of Paradise I wanted. I also saw as if two persons (i.e. angels) came to me and wanted to take me to Hell. Then an angel met us and told me not to be afraid. He then told them to leave me. Hafsa narrated one of my dreams to the Prophet and the Prophet said, \"Abdullah is a good man. Would that he offer the night prayer (Tahajjud)!\" So after that day `Abdullah (bin `Umar) started offering Tahajjud. The companions of the Prophet (p.b.u.h) used to tell him their dreams that (Laila-tul-Qadr) was on the 27th of the month of Ramadan. The Prophet said, \"I see that your dreams agree on the last ten nights of Ramadan and so whoever is in search of it should seek it in the last ten nights of Ramadan.\"",
      "chain": [
        "20283",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1219",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد، عن أيوب، عن محمد، عن أبي هريرة  رضى الله عنه  قال نهي عن الخصر، في الصلاة‏.‏ وقال هشام وأبو هلال عن ابن سيرين، عن أبي هريرة، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     It was forbidden to keep the hands on the hips during the prayer. (This is narrated by Abu Huraira from the Prophet.)",
      "chain": [
        "20283",
        "20022",
        "11015",
        "20278",
        "13"
      ]
    },
    {
      "hadith_no": "1265",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن أيوب، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهم  قال بينما رجل واقف بعرفة إذ وقع عن راحلته فوقصته  أو قال فأوقصته  قال النبي صلى الله عليه وسلم ‏\"‏ اغسلوه بماء وسدر، وكفنوه في ثوبين، ولا تحنطوه ولا تخمروا رأسه، فإنه يبعث يوم القيامة ملبيا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     While a man was riding (his Mount) in `Arafat, he fell down from it (his Mount) and broke his neck (and died). The Prophet said, \"Wash him with water and Sidr and shroud him in two pieces of cloth, and neither perfume him, nor cover his head, for he will be resurrected on the Day of Resurrection saying, 'Labbaik,' (i.e. like a pilgrim).\"",
      "chain": [
        "20283",
        "20022",
        "11015",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1267",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو النعمان، أخبرنا أبو عوانة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهم  أن رجلا، وقصه بعيره، ونحن مع النبي صلى الله عليه وسلم وهو محرم فقال النبي صلى الله عليه وسلم ‏\"‏ اغسلوه بماء وسدر، وكفنوه في ثوبين، ولا تمسوه طيبا، ولا تخمروا رأسه، فإن الله يبعثه يوم القيامة ملبدا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A man was killed by his camel while we were with the Prophet and he was a Muhrim. So the Prophet said, \"Wash him with water and Sidr and shroud him in two pieces of cloth and neither perfume him nor cover his head, for Allah will resurrect him on the Day of Resurrection and he will be saying 'Labbaik' . \"",
      "chain": [
        "20283",
        "20469",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1323",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو النعمان، حدثنا جرير بن حازم، قال سمعت نافعا، يقول حدث ابن عمر، أن أبا هريرة  رضى الله عنهم  يقول من تبع جنازة فله قيراط‏.‏ فقال أكثر أبو هريرة علينا‏.‏   فصدقت  يعني عائشة  أبا هريرة وقالت سمعت رسول الله صلى الله عليه وسلم يقوله‏.‏ فقال ابن عمر  رضى الله عنهما  لقد فرطنا في قراريط كثيرة‏.‏ ‏{‏فرطت‏}‏ ضيعت من أمر الله‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar was told that Abu Huraira said, \"Whoever accompanies the funeral procession will have a reward equal to one Qirat.\" Ibn `Umar said, \"Abu Huraira talks of a too enormous reward.\" Aisha attested Abu Huraira's narration and said, \"I heard Allah's Apostle saying like that.\" Ibn `Umar said, \"We have lost numerous Qirats.\"",
      "chain": [
        "20283",
        "11272",
        "11014",
        "18",
        "13"
      ]
    },
    {
      "hadith_no": "1337",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن الفضل، حدثنا حماد بن زيد، عن ثابت، عن أبي رافع، عن أبي هريرة  رضى الله عنه  أن أسود  رجلا أو امرأة  كان يقم المسجد فمات، ولم يعلم النبي صلى الله عليه وسلم بموته فذكره ذات يوم فقال ‏\"‏ ما فعل ذلك الإنسان ‏\"‏‏.‏ قالوا مات يا رسول الله‏.‏ قال ‏\"‏ أفلا آذنتموني ‏\"‏‏.‏ فقالوا إنه كان كذا وكذا قصته‏.‏ قال فحقروا شأنه‏.‏ قال ‏\"‏ فدلوني على قبره ‏\"‏‏.‏ فأتى قبره فصلى عليه‏.‏",
      "text_en": " Narrated Abu Huraira:                     A black person, a male or a female used to clean the Mosque and then died. The Prophet (p.b.u.h) did not know about it . One day the Prophet remembered him and said, \"What happened to that person?\" The people replied, \"O Allah's Apostle! He died.\" He said, \"Why did you not inform me?\" They said, \"His story was so and so (i.e. regarded him as insignificant).\" He said, \"Show me his grave.\" He then went to his grave and offered the funeral prayer.",
      "chain": [
        "20283",
        "20022",
        "11269",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "1450",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا حماد بن زيد، عن أيوب، عن نافع، عن ابن عمر  رضى الله عنهما  قال سمعت النبي صلى الله عليه وسلم ح‏.‏ وحدثنا عبد الله بن مسلمة، عن مالك، عن نافع، عن عبد الله بن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال وهو على المنبر، وذكر الصدقة والتعفف والمسألة ‏\"‏ اليد العليا خير من اليد السفلى، فاليد العليا هي المنفقة، والسفلى هي السائلة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     I heard Allah's Apostle (p.b.u.h) while he was on the pulpit speaking about charity, to abstain from asking others for some financial help and about begging others, saying, \"The upper hand is better than the lower hand. The upper hand is that of the giver and the lower (hand) is that of the beggar.\"",
      "chain": [
        "20283",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1536",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد بن زيد، حدثنا أيوب، عن نافع، عن ابن عمر  رضى الله عنهما  قال فرض النبي صلى الله عليه وسلم صدقة الفطر  أو قال رمضان  على الذكر والأنثى، والحر والمملوك، صاعا من تمر أو صاعا من شعير، فعدل الناس به نصف صاع من بر‏.‏ فكان ابن عمر  رضى الله عنهما  يعطي التمر، فأعوز أهل المدينة من التمر فأعطى شعيرا، فكان ابن عمر يعطي عن الصغير والكبير، حتى إن كان يعطي عن بني، وكان ابن عمر  رضى الله عنهما  يعطيها الذين يقبلونها، وكانوا يعطون قبل الفطر بيوم أو يومين‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar said, \"The Prophet made incumbent on every male or female, free man or slave, the payment of one Sa' of dates or barley as Sadaqat-ul-Fitr (or said Sadaqa-Ramadan).\" The people then substituted half Sa' of wheat for that. Ibn `Umar used to give dates (as Sadaqat-ul-Fitr). Once there was scarcity of dates in Medina and Ibn `Umar gave barley. 'And Ibn `Umar used to give Sadaqat-ul- Fitr for every young and old person. He even used to give on behalf of my children. Ibn `Umar used to give Sadaqat-ul-Fitr to those who had been officially appointed for its collection. People used to give Sadaqat-ul-Fitr (even) a day or two before the `Id.",
      "chain": [
        "20283",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1718",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد، عن أيوب، عن نافع، قال قال عبد الله بن عبد الله بن عمر  رضى الله عنهم  لأبيه أقم، فإني لا آمنها أن ستصد عن البيت‏.‏ قال إذا أفعل كما فعل رسول الله صلى الله عليه وسلم وقد قال الله ‏{‏لقد كان لكم في رسول الله أسوة حسنة‏}‏ فأنا أشهدكم أني قد أوجبت على نفسي العمرة‏.‏ فأهل بالعمرة، قال ثم خرج حتى إذا كان بالبيداء أهل بالحج والعمرة، وقال ما شأن الحج والعمرة إلا واحد‏.‏ ثم اشترى الهدى من قديد، ثم قدم فطاف لهما طوافا واحدا، فلم يحل حتى حل منهما جميعا‏.‏",
      "text_en": " Narrated Nafi`:                     `Abdullah (bin `Abdullah) bin `Umar said to his father, \"Stay here, for I am afraid that it (affliction between Ibn Zubair and Al-Hajjaj) might prevent you from reaching the Ka`ba.\" Ibn `Umar said, \"(In this case) I would do the same as Allah's Apostle did, and Allah has said, 'Verily, in Allah's Apostle, you have a good example (to follow).' So, I make you, people, witness that I have made `Umra compulsory for me.\" So he assumed lhram for `Umra. Then he went out and when he reached Al- Baida', he assumed Ihram for Hajj and `Umra (together) and said, \"The conditions (requisites) of Hajj and `Umra are the same.\" He, then brought a Hadi from Qudaid. Then he arrived (at Mecca) and performed Tawaf (between Safa and Marwa) once for both Hajj and `Umra and did not finish the lhram till he had finished both Hajj and `Umra.",
      "chain": [
        "20283",
        "20022",
        "11015",
        "11014",
        "11814"
      ]
    },
    {
      "hadith_no": "1726",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو النعمان، حدثنا عبد الواحد، حدثنا الأعمش، حدثنا إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  قالت كنت أفتل القلائد للنبي صلى الله عليه وسلم فيقلد الغنم، ويقيم في أهله حلالا‏.‏",
      "text_en": " Narrated `Aisha:                     I used to make the garlands for (the Hadis of) the Prophet and he would garland the sheep (with them) and would stay with his family as a non-Muhrim.",
      "chain": [
        "20283",
        "20256",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "1727",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد، حدثنا منصور بن المعتمر،‏.‏ وحدثنا محمد بن كثير، أخبرنا سفيان، عن منصور، عن إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  قالت كنت أفتل قلائد الغنم للنبي صلى الله عليه وسلم فيبعث بها، ثم يمكث حلالا‏.‏",
      "text_en": " Narrated Aisha:                     I used to twist the garlands for the sheep of the Prophet and he would send them (to the Ka`ba), and stay as a non-Muhrim.",
      "chain": [
        "20283",
        "20022",
        "28531",
        "20005",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "1786",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد، عن أيوب، عن عكرمة، أن أهل المدينة، سألوا ابن عباس  رضى الله عنهما  عن امرأة، طافت ثم حاضت، قال لهم تنفر‏.‏ قالوا لا نأخذ بقولك وندع قول زيد‏.‏ قال إذا قدمتم المدينة فسلوا‏.‏ فقدموا المدينة فسألوا، فكان فيمن سألوا أم سليم، فذكرت حديث صفية‏.‏ رواه خالد وقتادة عن عكرمة‏.‏",
      "text_en": " Narrated `Ikrima:                     The people of Medina asked Ibn `Abbas about a woman who got her menses after performing Tawafal- Ifada. He said, \"She could depart (from Mecca).\" They said, \"We will not act on your verdict and ignore the verdict of Zaid.\" Ibn `Abbas said, \"When you reach Medina, inquire about it.\" So, when they reached Medina they asked (about that). One of those whom they asked was Um Sulaim. She told them the narration of Safiya (812).",
      "chain": [
        "20283",
        "20022",
        "11015",
        "11023"
      ]
    },
    {
      "hadith_no": "1789",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو النعمان، حدثنا أبو عوانة، عن منصور، عن إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  قالت خرجنا مع النبي صلى الله عليه وسلم ولا نرى إلا الحج، فقدم النبي صلى الله عليه وسلم فطاف بالبيت وبين الصفا والمروة، ولم يحل وكان معه الهدى، فطاف من كان معه من نسائه وأصحابه، وحل منهم من لم يكن معه الهدى، فحاضت هي، فنسكنا مناسكنا من حجنا، فلما كان ليلة الحصبة ليلة النفر، قالت يا رسول الله كل أصحابك يرجع بحج وعمرة غيري‏.‏ قال ‏\"‏ ما كنت تطوفي بالبيت ليالي قدمنا ‏\"‏‏.‏ قلت لا‏.‏ قال ‏\"‏ فاخرجي مع أخيك إلى التنعيم فأهلي بعمرة، وموعدك مكان كذا وكذا ‏\"‏‏.‏ فخرجت مع عبد الرحمن إلى التنعيم، فأهللت بعمرة، وحاضت صفية بنت حيى، فقال النبي صلى الله عليه وسلم ‏\"‏ عقرى حلقى، إنك لحابستنا، أما كنت طفت يوم النحر ‏\"‏‏.‏ قالت بلى‏.‏ قال ‏\"‏ فلا بأس‏.‏ انفري ‏\"‏‏.‏ فلقيته مصعدا على أهل مكة، وأنا منهبطة، أو أنا مصعدة، وهو منهبط‏.‏ وقال مسدد قلت لا‏.‏ تابعه جرير عن منصور في قوله لا‏.‏",
      "text_en": " Narrated `Aisha:                     We set out with the Prophet with the intention of performing Hajj only. The Prophet reached Mecca and performed Tawaf of the Ka`ba and between Safa and Marwa and did not finish the Ihram, because he had the Hadi with him. His companions and his wives performed Tawaf (of the Ka`ba and between Safa and Marwa), and those who had no Hadi with them finished their Ihram. I got the menses and performed all the ceremonies of Hajj. So, when the Night of Hasba (night of departure) came, I said, \"O Allah's Apostle! All your companions are returning with Hajj and `Umra except me.\" He asked me, \"Didn't you perform Tawaf of the Ka`ba (Umra) when you reached Mecca?\" I said, \"No.\" He said, \"Go to Tan`im with your brother `Abdur-Rahman, and assume Ihram for `Umra and I will wait for you at such and such a place.\" So I went with `Abdur-Rahman to Tan`im and assumed Ihram for `Umra. Then Safiya bint Huyay got menses. The Prophet said, \" 'Aqra Halqa! You will detain us! Didn't you perform Tawaf-al-Ifada on the Day of Nahr (slaughtering)?\" She said, \"Yes, I did.\" He said, \"Then there is no harm, depart.\" So I met the Prophet when he was ascending the heights towards Mecca and I was descending, or vice-versa.",
      "chain": [
        "20283",
        "20469",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "1887",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن عبيد الله بن أبي يزيد، قال سمعت ابن عباس  رضى الله عنهما  يقول بعثني  أو قدمني  النبي صلى الله عليه وسلم في الثقل من جمع بليل‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet sent me (to Mina) with the luggage from Jam' (i.e. Al-Muzdalifa) at night.",
      "chain": [
        "20283",
        "20022",
        "11258",
        "17"
      ]
    },
    {
      "hadith_no": "1893",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن عمرو، عن أبي معبد، مولى ابن عباس عن ابن عباس  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم ‏\"‏ لا تسافر المرأة إلا مع ذي محرم، ولا يدخل عليها رجل إلا ومعها محرم ‏\"‏‏.‏ فقال رجل يا رسول الله إني أريد أن أخرج في جيش كذا وكذا، وامرأتي تريد الحج‏.‏ فقال ‏\"‏ اخرج معها ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"A woman should not travel except with a Dhu-Mahram (her husband or a man with whom that woman cannot marry at all according to the Islamic Jurisprudence), and no man may visit her except in the presence of a Dhu-Mahram.\" A man got up and said, \"O Allah's Apostle! I intend to go to such and such an army and my wife wants to perform Hajj.\" The Prophet said (to him), \"Go along with her (to Hajj).",
      "chain": [
        "20283",
        "20022",
        "11081",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "1900",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو النعمان، حدثنا ثابت بن يزيد، حدثنا عاصم أبو عبد الرحمن الأحول، عن أنس  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ المدينة حرم، من كذا إلى كذا، لا يقطع شجرها، ولا يحدث فيها حدث، من أحدث حدثا فعليه لعنة الله والملائكة والناس أجمعين ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"Medina is a sanctuary from that place to that. Its trees should not be cut and no heresy should be innovated nor any sin should be committed in it, and whoever innovates in it an heresy or commits sins (bad deeds), then he will incur the curse of Allah, the angels, and all the people.\" (See Hadith No. 409, Vol 9).",
      "chain": [
        "20283",
        "20215",
        "11080",
        "19"
      ]
    },
    {
      "hadith_no": "1983",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا الصلت بن محمد، حدثنا مهدي، عن غيلان،‏.‏ وحدثنا أبو النعمان، حدثنا مهدي بن ميمون، حدثنا غيلان بن جرير، عن مطرف، عن عمران بن حصين  رضى الله عنهما  عن النبي صلى الله عليه وسلم‏.‏ أنه سأله  أو سأل رجلا وعمران يسمع  فقال ‏\"‏ يا أبا فلان أما صمت سرر هذا الشهر ‏\"‏‏.‏ قال أظنه قال يعني رمضان‏.‏ قال الرجل لا يا رسول الله‏.‏ قال ‏\"‏ فإذا أفطرت فصم يومين ‏\"‏‏.‏ لم يقل الصلت أظنه يعني رمضان‏.‏ قال أبو عبد الله وقال ثابث عن مطرف عن عمران عن النبي صلى الله عليه وسلم ‏\"‏ من سرر شعبان ‏\"‏‏.‏",
      "text_en": " Narrated Mutarrif from `Imran Ibn Husain:                     That the Prophet asked him (Imran) or asked a man and `Imran was listening, \"O Abu so-and-so! Have you fasted the last days of this month?\" (The narrator thought that he said, \"the month of Ramadan\"). The man replied, \"No, O Allah's Apostle!\" The Prophet said to him, \"When you finish your fasting (of Ramadan) fast two days (in Shawwal).\" Through another series of narrators `Imran said, \"The Prophet said, '(Have you fasted) the last days of Sha'ban?\"",
      "chain": [
        "30140",
        "11307",
        "20283",
        "11307",
        "11300",
        "11395",
        "123"
      ]
    },
    {
      "hadith_no": "2033",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد بن زيد، حدثنا يحيى، عن عمرة، عن عائشة  رضى الله عنها  قالت كان النبي صلى الله عليه وسلم يعتكف في العشر الأواخر من رمضان، فكنت أضرب له خباء فيصلي الصبح ثم يدخله، فاستأذنت حفصة عائشة أن تضرب خباء فأذنت لها، فضربت خباء، فلما رأته زينب ابنة جحش ضربت خباء آخر، فلما أصبح النبي صلى الله عليه وسلم رأى الأخبية فقال ‏\"‏ ما هذا ‏\"‏‏.‏ فأخبر فقال النبي صلى الله عليه وسلم ‏\"‏ آلبر ترون بهن ‏\"‏‏.‏ فترك الاعتكاف ذلك الشهر، ثم اعتكف عشرا من شوال‏.‏",
      "text_en": " Narrated `Amra:                     Aisha said, \"the Prophet used to practice I`tikaf in the last ten days of Ramadan and I used to pitch a tent for him, and after offering the morning prayer, he used to enter the tent.\" Hafsa asked the permission of `Aisha to pitch a tent for her and she allowed her and she pitched her tent. When Zainab bint Jahsh saw it, she pitched another tent. In the morning the Prophet noticed the tents. He said, 'What is this?\" He was told of the whole situation. Then the Prophet said, \"Do you think that they intended to do righteousness by doing this?\" He therefore abandoned the I`tikaf in that month and practiced I`tikaf for ten days in the month of Shawwal.\"",
      "chain": [
        "20283",
        "20022",
        "20031",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "2109",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد بن زيد، حدثنا أيوب، عن نافع، عن ابن عمر  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم ‏\"‏ البيعان بالخيار ما لم يتفرقا، أو يقول أحدهما لصاحبه اختر ‏\"‏‏.‏ وربما قال أو يكون بيع خيار‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"The seller and the buyer have the option of canceling or confirming the deal unless they separate, or one of them says to the other, 'Choose (i.e. decide to cancel or confirm the bargain now).\" Perhaps he said, 'Or if it is an optional sale.' \" Ibn `Umar, Shuraih, Ash-Shu`bi, Tawus, Ata, and Ibn Abu Mulaika agree upon this judgment.",
      "chain": [
        "20283",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2173",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن أيوب، عن نافع، عن ابن عمر  رضى الله عنهما  أن النبي صلى الله عليه وسلم نهى عن المزابنة قال والمزابنة أن يبيع الثمر بكيل، إن زاد فلي وإن نقص فعلى‏.‏   قال وحدثني زيد بن ثابت، أن النبي صلى الله عليه وسلم رخص في العرايا بخرصها‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet forbade Muzabana; and Muzabana is the selling of fresh fruit (without measuring it) for something by measure on the basis that if that thing turns to be more than the fruit, the increase would be for the seller of the fruit, and if it turns to be less, that would be of his lot. Narrated Ibn `Umar from Zaid bin Thabit that the Prophet allowed the selling of the fruits on the trees after estimation (when they are ripe).",
      "chain": [
        "20283",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2216",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو النعمان، حدثنا معتمر بن سليمان، عن أبيه، عن أبي عثمان، عن عبد الرحمن بن أبي بكر  رضى الله عنهما  قال كنا مع النبي صلى الله عليه وسلم ثم جاء رجل مشرك مشعان طويل بغنم يسوقها فقال النبي صلى الله عليه وسلم ‏\"‏ بيعا أم عطية أو قال أم هبة ‏\"‏‏.‏ قال لا بل بيع‏.‏ فاشترى منه شاة‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abu Bakr:                     We were with the Prophet when a tall pagan with long matted unkempt hair came driving his sheep. The Prophet asked him, \"Are those sheep for sale or for gifts?\" The pagan replied, \"They are for sale.\" The Prophet bought one sheep from him.",
      "chain": [
        "20283",
        "20288",
        "11289",
        "11113",
        "107"
      ]
    },
    {
      "hadith_no": "2276",
      "source": " Sahih Bukhari ",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو النعمان، حدثنا أبو عوانة، عن أبي بشر، عن أبي المتوكل، عن أبي سعيد  رضى الله عنه  قال انطلق نفر من أصحاب النبي صلى الله عليه وسلم في سفرة سافروها حتى نزلوا على حى من أحياء العرب فاستضافوهم، فأبوا أن يضيفوهم، فلدغ سيد ذلك الحى، فسعوا له بكل شىء لا ينفعه شىء، فقال بعضهم لو أتيتم هؤلاء الرهط الذين نزلوا لعله أن يكون عند بعضهم شىء، فأتوهم، فقالوا يا أيها الرهط، إن سيدنا لدغ، وسعينا له بكل شىء لا ينفعه، فهل عند أحد منكم من شىء فقال بعضهم نعم والله إني لأرقي، ولكن والله لقد استضفناكم فلم تضيفونا، فما أنا براق لكم حتى تجعلوا لنا جعلا‏.‏ فصالحوهم على قطيع من الغنم، فانطلق يتفل عليه ويقرأ ‏{‏الحمد لله رب العالمين‏}‏ فكأنما نشط من عقال، فانطلق يمشي وما به قلبة، قال فأوفوهم جعلهم الذي صالحوهم عليه، فقال بعضهم اقسموا‏.‏ فقال الذي رقى لا تفعلوا، حتى نأتي النبي صلى الله عليه وسلم فنذكر له الذي كان، فننظر ما يأمرنا‏.‏ فقدموا على رسول الله صلى الله عليه وسلم فذكروا له، فقال ‏\"‏ وما يدريك أنها رقية  ثم قال  قد أصبتم اقسموا واضربوا لي معكم سهما ‏\"‏‏.‏ فضحك رسول الله صلى الله عليه وسلم‏.‏ وقال شعبة حدثنا أبو بشر سمعت أبا المتوكل بهذا‏.‏",
      "text_en": " Narrated Abu Sa`id:                     Some of the companions of the Prophet went on a journey till they reached some of the 'Arab tribes (at night). They asked the latter to treat them as their guests but they refused. The chief of that tribe was then bitten by a snake (or stung by a scorpion) and they tried their best to cure him but in vain. Some of them said (to the others), \"Nothing has benefited him, will you go to the people who resided here at night, it may be that some of them might possess something (as treatment),\" They went to the group of the companions (of the Prophet ) and said, \"Our chief has been bitten by a snake (or stung by a scorpion) and we have tried everything but he has not benefited. Have you got anything (useful)?\" One of them replied, \"Yes, by Allah! I can recite a Ruqya, but as you have refused to accept us as your guests, I will not recite the Ruqya for you unless you fix for us some wages for it.\" They agrees to pay them a flock of sheep. One of them then went and recited (Surat-ul-Fatiha): 'All the praises are for the Lord of the Worlds' and puffed over the chief who became all right as if he was released from a chain, and got up and started walking, showing no signs of sickness. They paid them what they agreed to pay. Some of them (i.e. the companions) then suggested to divide their earnings among themselves, but the one who performed the recitation said, \"Do not divide them till we go to the Prophet and narrate the whole story to him, and wait for his order.\" So, they went to Allah's Apostle and narrated the story. Allah's Apostle asked, \"How did you come to know that Suratul- Fatiha was recited as Ruqya?\" Then he added, \"You have done the right thing. Divide (what you have earned) and assign a share for me as well.\" The Prophet smiled thereupon.",
      "chain": [
        "20283",
        "20469",
        "11419",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "2456",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو النعمان، حدثنا أبو عوانة، عن الأعمش، عن أبي وائل، عن أبي مسعود، أن رجلا، من الأنصار يقال له أبو شعيب كان له غلام لحام فقال له أبو شعيب اصنع لي طعام خمسة لعلي أدعو النبي صلى الله عليه وسلم خامس خمسة‏.‏ وأبصر في وجه النبي صلى الله عليه وسلم الجوع  فدعاه، فتبعهم رجل لم يدع فقال النبي صلى الله عليه وسلم ‏\"‏ إن هذا قد اتبعنا أتأذن له ‏\"‏‏.‏ قال نعم‏.‏",
      "text_en": " Narrated Abu Mas`ud:                     There was an Ansari man called Abu Shu'aib who had a slave butcher. Abu Shu'aib said to him, \"Prepare a meal sufficient for five persons so that I might invite the Prophet besides other four persons.\" Abu Shu'aib had seen the signs of hunger on the face of the Prophet and so he invited him. Another man who was not invited, followed the Prophet. The Prophet said to Abu Shu'aib, \"This man has followed us. Do you allow him to share the meal?\" Abu Shu'aib said, \"Yes.\"",
      "chain": [
        "20283",
        "20469",
        "11060",
        "11353",
        "402"
      ]
    },
    {
      "hadith_no": "2504",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو النعمان، حدثنا جرير بن حازم، عن قتادة، عن النضر بن أنس، عن بشير بن نهيك، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ من أعتق شقصا له في عبد، أعتق كله إن كان له مال، وإلا يستسع غير مشقوق عليه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever manumits his share of a jointly possessed slave, it is essential for him to manumit the slave completely if he has sufficient money. Otherwise he should look for some work for the slave (to earn what would enable him to emancipate himself), without overburdening him with work.\"",
      "chain": [
        "20283",
        "11272",
        "11019",
        "11310",
        "11266",
        "13"
      ]
    },
    {
      "hadith_no": "2505",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد بن زيد، أخبرنا عبد الملك بن جريج، عن عطاء، عن جابر‏.‏وعن طاوس، عن ابن عباس  رضى الله عنهم  قال قدم النبي صلى الله عليه وسلم صبح رابعة من ذي الحجة مهلين بالحج، لا يخلطهم شىء، فلما قدمنا أمرنا فجعلناها عمرة، وأن نحل إلى نسائنا، ففشت في ذلك القالة‏.‏ قال عطاء فقال جابر فيروح أحدنا إلى منى وذكره يقطر منيا‏.‏ فقال جابر بكفه، فبلغ النبي صلى الله عليه وسلم فقام خطيبا فقال ‏\"‏ بلغني أن أقواما يقولون كذا وكذا، والله لأنا أبر وأتقى لله منهم، ولو أني استقبلت من أمري ما استدبرت ما أهديت، ولولا أن معي الهدى لأحللت ‏\"‏‏.‏ فقام سراقة بن مالك بن جعشم فقال يا رسول الله هي لنا أو للأبد فقال ‏\"‏ لا بل للأبد ‏\"‏‏.‏ قال وجاء علي بن أبي طالب  فقال أحدهما يقول لبيك بما أهل به رسول الله صلى الله عليه وسلم‏.‏ وقال وقال الآخر لبيك بحجة رسول الله صلى الله عليه وسلم  فأمر النبي صلى الله عليه وسلم أن يقيم على إحرامه، وأشركه في الهدى‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet (along with his companions) reached Mecca in the morning of the fourth of Dhul-Hijja assuming Ihram for Hajj only. So when we arrived at Mecca, the Prophet ordered us to change our intentions of the Ihram for `Umra and that we could finish our Ihram after performing the `Umra and could go to our wives (for sexual intercourse). The people began talking about that. Jabir said surprisingly, \"Shall we go to Mina while semen is dribbling from our male organs?\" Jabir moved his hand while saying so. When this news reached the Prophet he delivered a sermon and said, \"I have been informed that some peoples were saying so and so; By Allah I fear Allah more than you do, and am more obedient to Him than you. If I had known what I know now, I would not have brought the Hadi (sacrifice) with me and had the Hadi not been with me, I would have finished the Ihram.\" At that Suraqa bin Malik stood up and asked \"O Allah's Apostle! Is this permission for us only or is it forever?\" The Prophet replied, \"It is forever.\" In the meantime `Ali bin Abu Talib came from Yemen and was saying Labbaik for what the Prophet has intended. (According to another man, `Ali was saying Labbaik for Hajj similar to Allah's Apostle's). The Prophet told him to keep on the Ihram and let him share the Hadi with him.",
      "chain": [
        "20283",
        "20022",
        "11070",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "2524",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد، عن أيوب، عن نافع، عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ من أعتق نصيبا له في مملوك أو شركا له في عبد، وكان له من المال ما يبلغ قيمته بقيمة العدل، فهو عتيق ‏\"‏‏.‏ قال نافع وإلا فقد عتق منه ما عتق‏.‏ قال أيوب لا أدري أشىء قاله نافع، أو شىء في الحديث‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"He who manumits his share of a slave and has money sufficient to free the remaining portion of that slave's price (justly estimated) then he should manumit him (by giving the rest of his price to the other co-owners).\" Nafi` added, \"Otherwise the slave is partially free.\" Aiyub is not sure whether the last statement was said by Nafi` or it was a part of the Hadith.",
      "chain": [
        "20283",
        "20022",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2553",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو النعمان، حدثنا جرير بن حازم، عن نافع، عن ابن عمر  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم ‏\"‏ من أعتق نصيبا له من العبد، فكان له من المال ما يبلغ قيمته، يقوم عليه قيمة عدل، وأعتق من ماله، وإلا فقد عتق منه ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said, \"If one manumits his share of a common slave (Abd), and he has money sufficient to free the remaining portion of the price of the slave (justly estimated), then he should free the slave completely by paying the rest of his price; otherwise the slave is freed partly. \"",
      "chain": [
        "20283",
        "11272",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2618",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا أبو النعمان، حدثنا المعتمر بن سليمان، عن أبيه، عن أبي عثمان، عن عبد الرحمن بن أبي بكر  رضى الله عنهما  قال كنا مع النبي صلى الله عليه وسلم ثلاثين ومائة فقال النبي صلى الله عليه وسلم ‏\"‏ هل مع أحد منكم طعام ‏\"‏‏.‏ فإذا مع رجل صاع من طعام أو نحوه، فعجن ثم جاء رجل مشرك مشعان طويل بغنم يسوقها، فقال النبي صلى الله عليه وسلم ‏\"‏ بيعا أم عطية  أو قال  أم هبة ‏\"‏‏.‏ قال لا، بل بيع‏.‏ فاشترى منه شاة، فصنعت وأمر النبي صلى الله عليه وسلم بسواد البطن أن يشوى، وايم الله ما في الثلاثين والمائة إلا قد حز النبي صلى الله عليه وسلم له حزة من سواد بطنها، إن كان شاهدا أعطاها إياه، وإن كان غائبا خبأ له، فجعل منها قصعتين، فأكلوا أجمعون، وشبعنا، ففضلت القصعتان، فحملناه على البعير‏.‏ أو كما قال‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abu Bakr:                     We were one-hundred and thirty persons accompanying the Prophet who asked us whether anyone of us had food. There was a man who had about a Sa of wheat which was mixed with water then. A very tall pagan came driving sheep. The Prophet asked him, \"Will you sell us (a sheep) or give it as a present?\" He said, \"I will sell you (a sheep).\" The Prophet bought a sheep and it was slaughtered. The Prophet ordered that its liver and other Abdominal organs be roasted. By Allah, the Prophet gave every person of the one-hundred-and-thirty a piece of that; he gave all those of them who were present; and kept the shares of those who were absent. The Prophet then put its meat in two huge basins and all of them ate to their fill, and even then more food was left in the two basins which were carried on the camel (or said something like it).",
      "chain": [
        "20283",
        "20288",
        "11289",
        "11113",
        "107"
      ]
    },
    {
      "hadith_no": "2759",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا محمد بن الفضل أبو النعمان، حدثنا أبو عوانة، عن أبي بشر، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال إن ناسا يزعمون أن هذه الآية نسخت، ولا والله ما نسخت، ولكنها مما تهاون الناس، هما واليان وال يرث، وذاك الذي يرزق، ووال لا يرث، فذاك الذي يقول بالمعروف، يقول لا أملك لك أن أعطيك‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Some people claim that the order in the above Verse is cancelled, by Allah, it is not cancelled, but the people have stopped acting on it. There are two kinds of guardians (who are in charge of the inheritance): One is that who inherits; such a person should give (of what he inherits to the relatives, the orphans and the needy, etc.), the other is that who does not inherit (e.g. the guardian of the orphans): such a person should speak kindly and say (to those who are present at the time of distribution), \"I can not give it to you (as the wealth belongs to the orphans).",
      "chain": [
        "20283",
        "20469",
        "11419",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2894",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو النعمان، حدثنا حماد بن زيد، عن يحيى، عن محمد بن يحيى بن حبان، عن أنس بن مالك  رضى الله عنه  قال حدثتني أم حرام، أن النبي صلى الله عليه وسلم قال يوما في بيتها، فاستيقظ وهو يضحك، قالت يا رسول الله، ما يضحكك قال ‏\"‏ عجبت من قوم من أمتي يركبون البحر، كالملوك على الأسرة ‏\"‏‏.‏ فقلت يا رسول الله، ادع الله أن يجعلني منهم‏.‏ فقال ‏\"‏ أنت معهم ‏\"‏‏.‏ ثم نام، فاستيقظ وهو يضحك فقال مثل ذلك مرتين أو ثلاثا‏.‏ قلت يا رسول الله، ادع الله أن يجعلني منهم‏.‏ فيقول ‏\"‏ أنت من الأولين ‏\"‏ فتزوج بها عبادة بن الصامت، فخرج بها إلى الغزو، فلما رجعت قربت دابة لتركبها، فوقعت فاندقت عنقها‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Um Haram told me that the Prophet one day took a midday nap in her house. Then he woke up smiling. Um Haram asked, \"O Allah's Apostle! What makes you smile?\" He replied \"I was astonished to see (in my dream) some people amongst my followers on a sea-voyage looking like kings on the thrones.\" She said, \"O Allah's Apostle! Invoke Allah to make me one of them.\" He replied, \"You are amongst them.\" He slept again and then woke up smiling and said the same as before twice or thrice. And she said, \"O Allah's Apostle! Invoke Allah to make me one of them.\" And he said, \"You are amongst the first batch.\" 'Ubada bin As-Samit married her (i.e. Um Haram) and then he took her for Jihad. When she returned, an animal was presented to her to ride, but she fell down and her neck was broken.",
      "chain": [
        "20283",
        "20022",
        "20031",
        "11222",
        "19"
      ]
    }
  ],
  "total_hadiths": 127
}