{
  "id": "20288",
  "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
  "full_name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان -  الطفيل",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "107",
      "date_gregorian": "NA",
      "date_display": [
        "107 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "187",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "B.Taym",
      "al-Basri"
    ]
  },
  "parents": [
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11303",
      "name": "Kahmas bin al-Hasan al-Tamimi كهمس بن الحسن التميمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11585",
      "name": "Da'ud bin Abi Hnd داود بن أبي هند",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11282",
      "name": "Khalid bin Mahran al-Hadha' خالد بن مهران الحذاء",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11220",
      "name": "Muhammad bin 'Amr bin 'Alqama محمد بن عمرو بن علقمة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11575",
      "name": "Ishaq bin Suwayd bin Hubayra إسحاق بن سويد بن هبيرة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11555",
      "name": "Ayman bin Nabil أيمن بن نابل الحبشي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19839",
      "name": "Bard bin Sinan برد بن سنان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19901",
      "name": "Bahz bin Hakim bin Mu'awiya al-Qushayri بهز بن حكيم بن معاوية",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10763",
      "name": "Rakayn bin al-Rabi' bin 'Amila ركين بن الربيع",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11558",
      "name": "Syf bin Sulaiman سيف بن سليمان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11894",
      "name": "'Amarah bin Ghazya bin al-Harith عمارة بن غزية بن الحارث",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "14316",
      "name": "Fdyl bin Mysrh فضيل بن ميسرة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11311",
      "name": "Hisham bin Hassan al-Azdi هشام بن حسان الأزدي القردوسي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20121",
      "name": "'Abdur-Razzaq عبد الرزاق بن همام",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28280",
      "name": "'Abdullah bin Ja'far عبد الله بن جعفر الرقي المعيطي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20393",
      "name": "Yonus bin Muhammad bin Muslim يونس بن محمد بن مسلم المؤدب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "38423",
      "name": "'Umar bin 'Uthman bin 'Asim عمر بن عثمان بن عاصم بن صهيب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30399",
      "name": "Yahya bin Yahya bin Bukayr يحيى بن يحيى بن بكير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20283",
      "name": "Muhammad bin al-Fadl 'Aram محمد بن الفضل السدوسي أبو النعمان عارم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30175",
      "name": "Masdad bin Masrhad مسدد بن مسرهد بن مسربل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "32047",
      "name": "Yahya bin al-Mughira bin Isma'il يحيى بن المغيرة بن إسماعيل بن أيوب",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30132",
      "name": "Khalifa bin Khayyat bin Khalifa خليفة بن خياط بن خليفة بن خياط",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30150",
      "name": "'Ubaidullah bin Mua'dh عبيد الله بن معاذ بن معاذ بن نصر",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30146",
      "name": "'Abdul A'ala bin Hamad bin Nasr al-Bahli عبد الأعلى بن حماد بن نصر الباهلي النرسي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30124",
      "name": "Umayya bin Bustam أمية بن بسطام",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30128",
      "name": "Hamd bin 'Umar bin Hafs حامد بن عمر بن حفص",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30116",
      "name": "Sa'id bin Mnswr bin Sh'bh سعيد بن منصور بن شعبة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30161",
      "name": "Muhammad bin Abi Bakr bin 'Ali محمد بن أبي بكر بن علي بن عطاء المقدمي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38513",
      "name": "Muhammad bin Salam al-Baykandi محمد بن سلام",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30351",
      "name": "'Abdullah bin Muhammad al-Musandi عبد الله بن محمد المسندي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20164",
      "name": "'Abdullah bin Muslima al-Qa'nabi عبد الله بن مسلمة بن قعنب القعنبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "34126",
      "name": "'Abdur Rahman bin al-'Aswad عبد الرحمن بن الأسود",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30344",
      "name": "al-'Abbas bin al-Walid al-Narsi العباس بن الوليد النرسي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30216",
      "name": "Abu Karayb, Muhammad bin al-'Ala' محمد بن العلاء - أبو كريب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30459",
      "name": "Yahya bin Habib bin Arby يحيى بن حبيب بن عربي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "33006",
      "name": "al-Husain bin al-Hasan bin Harb الحسين بن الحسن بن حرب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36540",
      "name": "al-Hasan bin Arfh bin Yazid الحسن بن عرفة بن يزيد",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "129",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا مسدد، قال حدثنا معتمر، قال سمعت أبي قال، سمعت أنسا، قال ذكر لي أن النبي صلى الله عليه وسلم قال لمعاذ ‏\"‏ من لقي الله لا يشرك به شيئا دخل الجنة ‏\"‏‏.‏ قال ألا أبشر الناس قال ‏\"‏ لا، إني أخاف أن يتكلوا ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     I was informed that the Prophet had said to Mu`adh, \"Whosoever will meet Allah without associating anything in worship with Him will go to Paradise.\" Mu`adh asked the Prophet, \"Should I not inform the people of this good news?\" The Prophet replied, \"No, I am afraid, lest they should depend upon it (absolutely).",
      "chain": [
        "30175",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "311",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا مسدد، قال حدثنا معتمر، عن خالد، عن عكرمة، عن عائشة، أن بعض، أمهات المؤمنين اعتكفت وهى مستحاضة‏.‏",
      "text_en": " Narrated `Aisha:                     One of the mothers of the faithful believers (i.e. the wives of the Prophet ) did I`tikaf while she was having bleeding in between her periods.",
      "chain": [
        "30175",
        "20288",
        "11282",
        "11023",
        "53"
      ]
    },
    {
      "hadith_no": "507",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا معتمر، عن عبيد الله، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم أنه كان يعرض راحلته فيصلي إليها‏.‏ قلت أفرأيت إذا هبت الركاب‏.‏ قال كان يأخذ هذا الرحل فيعدله فيصلي إلى آخرته  أو قال مؤخره  وكان ابن عمر  رضى الله عنه  يفعله‏.‏",
      "text_en": " Narrated Nafi`:                     \"The Prophet used to make his she-camel sit across and he would pray facing it (as a Sutra).\" I asked, \"What would the Prophet do if the she-camel was provoked and moved?\" He said, \"He would take its camel-saddle and put it in front of him and pray facing its back part (as a Sutra). And Ibn `Umar used to do the same.\" (This indicates that one should not pray except behind a Sutra).",
      "chain": [
        "30161",
        "20288",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "602",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا معتمر بن سليمان، قال حدثنا أبي، حدثنا أبو عثمان، عن عبد الرحمن بن أبي بكر، أن أصحاب الصفة، كانوا أناسا فقراء، وأن النبي صلى الله عليه وسلم قال ‏\"‏ من كان عنده طعام اثنين فليذهب بثالث، وإن أربع فخامس أو سادس ‏\"‏‏.‏ وأن أبا بكر جاء بثلاثة فانطلق النبي صلى الله عليه وسلم بعشرة، قال فهو أنا وأبي وأمي، فلا أدري قال وامرأتي وخادم بيننا وبين بيت أبي بكر‏.‏ وإن أبا بكر تعشى عند النبي صلى الله عليه وسلم ثم لبث حيث صليت العشاء، ثم رجع فلبث حتى تعشى النبي صلى الله عليه وسلم فجاء بعد ما مضى من الليل ما شاء الله، قالت له امرأته وما حبسك عن أضيافك  أو قالت ضيفك  قال أوما عشيتيهم قالت أبوا حتى تجيء، قد عرضوا فأبوا‏.‏ قال فذهبت أنا فاختبأت فقال يا غنثر، فجدع وسب، وقال كلوا لا هنيئا‏.‏ فقال والله لا أطعمه أبدا، وايم الله ما كنا نأخذ من لقمة إلا ربا من أسفلها أكثر منها‏.‏ قال يعني حتى شبعوا وصارت أكثر مما كانت قبل ذلك، فنظر إليها أبو بكر فإذا هي كما هي أو أكثر منها‏.‏ فقال لامرأته يا أخت بني فراس ما هذا قالت لا وقرة عيني لهي الآن أكثر منها قبل ذلك بثلاث مرات‏.‏ فأكل منها أبو بكر وقال إنما كان ذلك من الشيطان  يعني يمينه  ثم أكل منها لقمة، ثم حملها إلى النبي صلى الله عليه وسلم فأصبحت عنده، وكان بيننا وبين قوم عقد، فمضى الأجل، ففرقنا اثنا عشر رجلا، مع كل رجل منهم أناس، الله أعلم كم مع كل رجل فأكلوا منها أجمعون، أو كما قال‏.‏",
      "text_en": " Narrated Abu `Uthman:                     `Abdur Rahman bin Abi Bakr said, \"The Suffa Companions were poor people and the Prophet said, 'Whoever has food for two persons should take a third one from them (Suffa companions). And whosoever has food for four persons he should take one or two from them' Abu Bakr took three men and the Prophet took ten of them.\" `Abdur Rahman added, my father my mother and I were there (in the house). (The sub-narrator is in doubt whether `Abdur Rahman also said, 'My wife and our servant who was common for both my house and Abu Bakr's house). Abu Bakr took his supper with the Prophet and remained there till the `Isha' prayer was offered. Abu Bakr went back and stayed with the Prophet till the Prophet took his meal and then Abu Bakr returned to his house after a long portion of the night had passed. Abu Bakr's wife said, 'What detained you from your guests (or guest)?' He said, 'Have you not served them yet?' She said, 'They refused to eat until you come. The food was served for them but they refused.\" `Abdur Rahman added, \"I went away and hid myself (being afraid of Abu Bakr) and in the meantime he (Abu Bakr) called me, 'O Ghunthar (a harsh word)!' and also called me bad names and abused me and then said (to his family), 'Eat. No welcome for you.' Then (the supper was served). Abu Bakr took an oath that he would not eat that food. The narrator added: By Allah, whenever any one of us (myself and the guests of Suffa companions) took anything from the food, it increased from underneath. We all ate to our fill and the food was more than it was before its serving. Abu Bakr looked at it (the food) and found it as it was before serving or even more than that. He addressed his wife (saying) 'O the sister of Bani Firas! What is this?' She said, 'O the pleasure of my eyes! The food is now three times more than it was before.' Abu Bakr ate from it, and said, 'That (oath) was from Satan' meaning his oath (not to eat). Then he again took a morsel (mouthful) from it and then took the rest of it to the Prophet. So that meal was with the Prophet. There was a treaty between us and some people, and when the period of that treaty had elapsed the Prophet divided us into twelve (groups) (the Prophet's companions) each being headed by a man. Allah knows how many men were under the command of each (leader). So all of them (12 groups of men) ate of that meal.\"",
      "chain": [
        "20283",
        "20288",
        "11289",
        "11113",
        "107"
      ]
    },
    {
      "hadith_no": "766",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو النعمان، قال حدثنا معتمر، عن أبيه، عن بكر، عن أبي رافع، قال صليت مع أبي هريرة العتمة فقرأ ‏{‏إذا السماء انشقت‏}‏ فسجد فقلت له قال سجدت خلف أبي القاسم صلى الله عليه وسلم فلا أزال أسجد بها حتى ألقاه‏.‏",
      "text_en": " Narrated Abu Rafi`:                     I offered the `Isha' prayer behind Abu Huraira and he recited, \"Idha s-samaa'u n-shaqqat\" (84) and prostrated. On my inquiring, he said, \"I prostrated behind Abul-Qasim (the Prophet) (when he recited that Sura) and I will go on doing it till I meet him.\"",
      "chain": [
        "20283",
        "20288",
        "11289",
        "11267",
        "479"
      ]
    },
    {
      "hadith_no": "843",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن أبي بكر، قال حدثنا معتمر، عن عبيد الله، عن سمى، عن أبي صالح، عن أبي هريرة  رضى الله عنه  قال جاء الفقراء إلى النبي صلى الله عليه وسلم فقالوا ذهب أهل الدثور من الأموال بالدرجات العلا والنعيم المقيم، يصلون كما نصلي، ويصومون كما نصوم، ولهم فضل من أموال يحجون بها، ويعتمرون، ويجاهدون، ويتصدقون قال ‏\"‏ ألا أحدثكم بأمر إن أخذتم به أدركتم من سبقكم ولم يدرككم أحد بعدكم، وكنتم خير من أنتم بين ظهرانيه، إلا من عمل مثله تسبحون وتحمدون، وتكبرون خلف كل صلاة ثلاثا وثلاثين ‏\"‏‏.‏ فاختلفنا بيننا فقال بعضنا نسبح ثلاثا وثلاثين، ونحمد ثلاثا وثلاثين، ونكبر أربعا وثلاثين‏.‏ فرجعت إليه فقال ‏\"‏ تقول سبحان الله، والحمد لله، والله أكبر، حتى يكون منهن كلهن ثلاثا وثلاثين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Some poor people came to the Prophet and said, \"The wealthy people will get higher grades and will have permanent enjoyment and they pray like us and fast as we do. They have more money by which they perform the Hajj, and `Umra; fight and struggle in Allah's Cause and give in charity.\" The Prophet said, \"Shall I not tell you a thing upon which if you acted you would catch up with those who have surpassed you? Nobody would overtake you and you would be better than the people amongst whom you live except those who would do the same. Say \"Subhana l-lah\", \"Al hamdu li l-lah\" and \"Allahu Akbar\" thirty three times each after every (compulsory) prayer.\" We differed and some of us said that we should say, \"Subhan-al-lah\" thirty three times and \"Al hamdu li l-lah\" thirty three times and \"Allahu Akbar\" thirty four times. I went to the Prophet who said, \"Say, \"Subhan-al-lah\" and \"Al hamdu li l-lah\" and \"Allahu Akbar\" all together [??], thirty three times.\"",
      "chain": [
        "30161",
        "20288",
        "11201",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "1021",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن أبي بكر، حدثنا معتمر، عن عبيد الله، عن ثابت، عن أنس، قال كان النبي صلى الله عليه وسلم يخطب يوم جمعة، فقام الناس فصاحوا فقالوا يا رسول الله، قحط المطر واحمرت الشجر وهلكت البهائم، فادع الله يسقينا‏.‏ فقال ‏\"‏ اللهم اسقنا ‏\"‏‏.‏ مرتين، وايم الله ما نرى في السماء قزعة من سحاب، فنشأت سحابة وأمطرت، ونزل عن المنبر فصلى، فلما انصرف لم تزل تمطر إلى الجمعة التي تليها، فلما قام النبي صلى الله عليه وسلم يخطب صاحوا إليه تهدمت البيوت وانقطعت السبل، فادع الله يحبسها عنا‏.‏ فتبسم النبي صلى الله عليه وسلم ثم قال ‏\"‏ اللهم حوالينا ولا علينا ‏\"‏‏.‏ فكشطت المدينة، فجعلت تمطر حولها ولا تمطر بالمدينة قطرة، فنظرت إلى المدينة وإنها لفي مثل الإكليل‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle I was delivering the Khutba (sermon) on a Friday when the people stood up, shouted and said, \"O Allah's Apostle! There is no rain (drought), the trees have dried and the livestock are destroyed; Please pray to Allah for rain.\" So Allah's Apostle said twice, \"O Allah! Bless us with rain.\" By Allah, there was no trace of cloud in the sky and suddenly the sky became overcast with clouds and it started raining. The Prophet came down the pulpit and offered the prayer. When he came back from the prayer (to his house) it was raining and it rained continuously till the next Friday. When the Prophet started delivering the Friday Khutba (sermon), the people started shouting and said to him, \"The houses have collapsed and the roads are cut off; so please pray to Allah to withhold the rain.\" So the Prophet smiled and said, \"O Allah! Round about us and not on us.\" So the sky became clear over Medina but it kept on raining over the outskirts (of Medina) and not a single drop of rain fell over Median. I looked towards the sky which was as bright and clear as a crown.",
      "chain": [
        "30161",
        "20288",
        "11201",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "1078",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا مسدد، قال حدثنا معتمر، قال سمعت أبي قال، حدثني بكر، عن أبي رافع، قال صليت مع أبي هريرة العتمة فقرأ ‏{‏إذا السماء انشقت‏}‏ فسجد فقلت ما هذه قال سجدت بها خلف أبي القاسم صلى الله عليه وسلم فلا أزال أسجد فيها حتى ألقاه‏.‏",
      "text_en": " Narrated Abu Rafi`:                     I offered the `Isha' prayer behind Abu Huraira and he recited Idhas-Sama' Un-Shaqqat, and prostrated. I said, \"What is this?\" Abu Huraira said, \"I prostrated behind Abul-Qasim and I will do the same till I meet him.\"",
      "chain": [
        "30175",
        "20288",
        "11289",
        "11267",
        "479"
      ]
    },
    {
      "hadith_no": "1912",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا مسدد، حدثنا معتمر، قال سمعت إسحاق، عن عبد الرحمن بن أبي بكرة، عن أبيه، عن النبي صلى الله عليه وسلم‏.‏ وحدثني مسدد، حدثنا معتمر، عن خالد الحذاء، قال أخبرني عبد الرحمن بن أبي بكرة، عن أبيه  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ شهران لا ينقصان شهرا عيد رمضان وذو الحجة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet said, \"The two months of `Id i.e. Ramadan and Dhul-Hijja, do not decrease (in superiority).",
      "chain": [
        "30175",
        "20288",
        "11151",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "2149",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا مسدد، حدثنا معتمر، قال سمعت أبي يقول، حدثنا أبو عثمان، عن عبد الله بن مسعود  رضى الله عنه  قال من اشترى شاة محفلة، فردها فليرد معها صاعا‏.‏ ونهى النبي صلى الله عليه وسلم أن تلقى البيوع‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     Whoever buys a sheep which has not been milked for a long time, has the option of returning it along with one Sa of dates; and the Prophet forbade going to meet the seller on the way (as he has no knowledge of the market price and he may sell his goods at a low price).",
      "chain": [
        "30175",
        "20288",
        "11289",
        "11113",
        "16"
      ]
    },
    {
      "hadith_no": "2216",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو النعمان، حدثنا معتمر بن سليمان، عن أبيه، عن أبي عثمان، عن عبد الرحمن بن أبي بكر  رضى الله عنهما  قال كنا مع النبي صلى الله عليه وسلم ثم جاء رجل مشرك مشعان طويل بغنم يسوقها فقال النبي صلى الله عليه وسلم ‏\"‏ بيعا أم عطية أو قال أم هبة ‏\"‏‏.‏ قال لا بل بيع‏.‏ فاشترى منه شاة‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abu Bakr:                     We were with the Prophet when a tall pagan with long matted unkempt hair came driving his sheep. The Prophet asked him, \"Are those sheep for sale or for gifts?\" The pagan replied, \"They are for sale.\" The Prophet bought one sheep from him.",
      "chain": [
        "20283",
        "20288",
        "11289",
        "11113",
        "107"
      ]
    },
    {
      "hadith_no": "2304",
      "source": " Sahih Bukhari ",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "حدثنا إسحاق بن إبراهيم، سمع المعتمر، أنبأنا عبيد الله، عن نافع، أنه سمع ابن كعب بن مالك، يحدث عن أبيه، أنه كانت لهم غنم ترعى بسلع، فأبصرت جارية لنا بشاة من غنمنا موتا، فكسرت حجرا فذبحتها به، فقال لهم لا تأكلوا حتى أسأل النبي صلى الله عليه وسلم، أو أرسل إلى النبي صلى الله عليه وسلم من يسأله‏.‏ وأنه سأل النبي صلى الله عليه وسلم عن ذاك، أو أرسل، فأمره بأكلها‏.‏ قال عبيد الله فيعجبني أنها أمة، وأنها ذبحت‏.‏ تابعه عبدة عن عبيد الله‏.‏",
      "text_en": " Narrated Ibn Ka`b bin Malik from his father:                     We had some sheep which used to graze at Sala'. One of our slavegirls saw a sheep dying and she broke a stone and slaughtered the sheep with it. My father said to the people, \"Don't eat it till I ask the Prophet about it (or till I send somebody to ask the Prophet).\" So, he asked or sent somebody to ask the Prophet, and the Prophet permitted him to eat it. 'Ubaidullah (a sub-narrator) said, \"I admire that girl, for though she was a slave-girl, she dared to slaughter the sheep . \"",
      "chain": [
        "30123",
        "20288",
        "11201",
        "11014"
      ]
    },
    {
      "hadith_no": "2444",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا مسدد، حدثنا معتمر، عن حميد، عن أنس  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ انصر أخاك ظالما أو مظلوما ‏\"‏‏.‏ قالوا يا رسول الله هذا ننصره مظلوما، فكيف ننصره ظالما قال ‏\"‏ تأخذ فوق يديه ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle said, \"Help your brother, whether he is an oppressor or he is an oppressed one. People asked, \"O Allah's Apostle! It is all right to help him if he is oppressed, but how should we help him if he is an oppressor?\" The Prophet said, \"By preventing him from oppressing others.\"",
      "chain": [
        "30175",
        "20288",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "2618",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا أبو النعمان، حدثنا المعتمر بن سليمان، عن أبيه، عن أبي عثمان، عن عبد الرحمن بن أبي بكر  رضى الله عنهما  قال كنا مع النبي صلى الله عليه وسلم ثلاثين ومائة فقال النبي صلى الله عليه وسلم ‏\"‏ هل مع أحد منكم طعام ‏\"‏‏.‏ فإذا مع رجل صاع من طعام أو نحوه، فعجن ثم جاء رجل مشرك مشعان طويل بغنم يسوقها، فقال النبي صلى الله عليه وسلم ‏\"‏ بيعا أم عطية  أو قال  أم هبة ‏\"‏‏.‏ قال لا، بل بيع‏.‏ فاشترى منه شاة، فصنعت وأمر النبي صلى الله عليه وسلم بسواد البطن أن يشوى، وايم الله ما في الثلاثين والمائة إلا قد حز النبي صلى الله عليه وسلم له حزة من سواد بطنها، إن كان شاهدا أعطاها إياه، وإن كان غائبا خبأ له، فجعل منها قصعتين، فأكلوا أجمعون، وشبعنا، ففضلت القصعتان، فحملناه على البعير‏.‏ أو كما قال‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abu Bakr:                     We were one-hundred and thirty persons accompanying the Prophet who asked us whether anyone of us had food. There was a man who had about a Sa of wheat which was mixed with water then. A very tall pagan came driving sheep. The Prophet asked him, \"Will you sell us (a sheep) or give it as a present?\" He said, \"I will sell you (a sheep).\" The Prophet bought a sheep and it was slaughtered. The Prophet ordered that its liver and other Abdominal organs be roasted. By Allah, the Prophet gave every person of the one-hundred-and-thirty a piece of that; he gave all those of them who were present; and kept the shares of those who were absent. The Prophet then put its meat in two huge basins and all of them ate to their fill, and even then more food was left in the two basins which were carried on the camel (or said something like it).",
      "chain": [
        "20283",
        "20288",
        "11289",
        "11113",
        "107"
      ]
    },
    {
      "hadith_no": "2691",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا مسدد، حدثنا معتمر، قال سمعت أبي أن أنسا  رضى الله عنه  قال قيل للنبي صلى الله عليه وسلم لو أتيت عبد الله بن أبى‏.‏ فانطلق إليه النبي صلى الله عليه وسلم وركب حمارا، فانطلق المسلمون يمشون معه، وهى أرض سبخة، فلما أتاه النبي صلى الله عليه وسلم فقال إليك عني، والله لقد آذاني نتن حمارك‏.‏ فقال رجل من الأنصار منهم والله لحمار رسول الله صلى الله عليه وسلم أطيب ريحا منك‏.‏ فغضب لعبد الله رجل من قومه فشتما، فغضب لكل واحد منهما أصحابه، فكان بينهما ضرب بالجريد والأيدي والنعال، فبلغنا أنها أنزلت ‏{‏وإن طائفتان من المؤمنين اقتتلوا فأصلحوا بينهما‏}‏‏.‏",
      "text_en": " Narrated Anas:                     It was said to the Prophet \"Would that you see `Abdullah bin Ubai.\" So, the Prophet went to him, riding a donkey, and the Muslims accompanied him, walking on salty barren land. When the Prophet reached `Abdullah bin Ubai, the latter said, \"Keep away from me! By Allah, the bad smell of your donkey has harmed me.\" On that an Ansari man said (to `Abdullah), \"By Allah! The smell of the donkey of Allah's Apostle is better than your smell.\" On that a man from `Abdullah's tribe got angry for `Abdullah's sake, and the two men abused each other which caused the friends of the two men to get angry, and the two groups started fighting with sticks, shoes and hands. We were informed that the following Divine Verse was revealed (in this concern):-- \"And if two groups of Believers fall to fighting then, make peace between them.\" (49.9)",
      "chain": [
        "30175",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "2823",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا مسدد، حدثنا معتمر، قال سمعت أبي قال، سمعت أنس بن مالك  رضى الله عنه  قال كان النبي صلى الله عليه وسلم يقول ‏\"‏ اللهم إني أعوذ بك من العجز والكسل والجبن والهرم، وأعوذ بك من فتنة المحيا والممات، وأعوذ بك من عذاب القبر ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet used to say, \"O Allah! I seek refuge with You from helplessness, laziness, cowardice and feeble old age; I seek refuge with You from afflictions of life and death and seek refuge with You from the punishment in the grave.\"",
      "chain": [
        "30175",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "3128",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا معتمر، عن أبيه، قال سمعت أنس بن مالك  رضى الله عنه  يقول كان الرجل يجعل للنبي صلى الله عليه وسلم النخلات حتى افتتح قريظة والنضير، فكان بعد ذلك يرد عليهم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     People used to give some of their datepalms to the Prophet (as a gift), till he conquered Bani Quraiza and Bani An-Nadir, whereupon he started returning their favors.",
      "chain": [
        "30145",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "3159",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا الفضل بن يعقوب، حدثنا عبد الله بن جعفر الرقي، حدثنا المعتمر بن سليمان، حدثنا سعيد بن عبيد الله الثقفي، حدثنا بكر بن عبد الله المزني، وزياد بن جبير، عن جبير بن حية، قال بعث عمر الناس في أفناء الأمصار يقاتلون المشركين، فأسلم الهرمزان فقال إني مستشيرك في مغازي هذه‏.‏ قال نعم، مثلها ومثل من فيها من الناس من عدو المسلمين مثل طائر له رأس وله جناحان وله رجلان، فإن كسر أحد الجناحين نهضت الرجلان بجناح والرأس، فإن كسر الجناح الآخر نهضت الرجلان والرأس، وإن شدخ الرأس ذهبت الرجلان والجناحان والرأس، فالرأس كسرى، والجناح قيصر، والجناح الآخر فارس، فمر المسلمين فلينفروا إلى كسرى‏.‏ وقال بكر وزياد جميعا عن جبير بن حية قال فندبنا عمر واستعمل علينا النعمان بن مقرن، حتى إذا كنا بأرض العدو، وخرج علينا عامل كسرى في أربعين ألفا، فقام ترجمان فقال ليكلمني رجل منكم‏.‏ فقال المغيرة سل عما شئت‏.‏ قال ما أنتم قال نحن أناس من العرب كنا في شقاء شديد وبلاء شديد، نمص الجلد والنوى من الجوع، ونلبس الوبر والشعر، ونعبد الشجر والحجر، فبينا نحن كذلك، إذ بعث رب السموات ورب الأرضين تعالى ذكره وجلت عظمته إلينا نبيا من أنفسنا، نعرف أباه وأمه، فأمرنا نبينا رسول ربنا صلى الله عليه وسلم أن نقاتلكم حتى تعبدوا الله وحده أو تؤدوا الجزية، وأخبرنا نبينا صلى الله عليه وسلم عن رسالة ربنا أنه من قتل منا صار إلى الجنة في نعيم لم ير مثلها قط، ومن بقي منا ملك رقابكم‏.‏ فقال النعمان ربما أشهدك الله مثلها مع النبي صلى الله عليه وسلم فلم يندمك ولم يخزك، ولكني شهدت القتال مع رسول الله صلى الله عليه وسلم كان إذا لم يقاتل في أول النهار انتظر حتى تهب الأرواح وتحضر الصلوات‏.‏",
      "text_en": " Narrated Jubair bin Haiya:                     `Umar sent the Muslims to the great countries to fight the pagans. When Al-Hurmuzan embraced Islam, `Umar said to him. \"I would like to consult you regarding these countries which I intend to invade.\" Al-Hurmuzan said, \"Yes, the example of these countries and their inhabitants who are the enemies. of the Muslims, is like a bird with a head, two wings and two legs; If one of its wings got broken, it would get up over its two legs, with one wing and the head; and if the other wing got broken, it would get up with two legs and a head, but if its head got destroyed, then the two legs, two wings and the head would become useless. The head stands for Khosrau, and one wing stands for Caesar and the other wing stands for Faris. So, order the Muslims to go towards Khosrau.\" So, `Umar sent us (to Khosrau) appointing An-Nu`man bin Muqrin as our commander. When we reached the land of the enemy, the representative of Khosrau came out with forty-thousand warriors, and an interpreter got up saying, \"Let one of you talk to me!\" Al-Mughira replied, \"Ask whatever you wish.\" The other asked, \"Who are you?\" Al-Mughira replied, \"We are some people from the Arabs; we led a hard, miserable, disastrous life: we used to suck the hides and the date stones from hunger; we used to wear clothes made up of fur of camels and hair of goats, and to worship trees and stones. While we were in this state, the Lord of the Heavens and the Earths, Elevated is His Remembrance and Majestic is His Highness, sent to us from among ourselves a Prophet whose father and mother are known to us. Our Prophet, the Messenger of our Lord, has ordered us to fight you till you worship Allah Alone or give Jizya (i.e. tribute); and our Prophet has informed us that our Lord says:-- \"Whoever amongst us is killed (i.e. martyred), shall go to Paradise to lead such a luxurious life as he has never seen, and whoever amongst us remain alive, shall become your master.\" (Al-Mughira, then blamed An-Nu`man for delaying the attack and) An-Nu' man said to Al-Mughira, \"If you had participated in a similar battle, in the company of Allah's Apostle he would not have blamed you for waiting, nor would he have disgraced you. But I accompanied Allah's Apostle in many battles and it was his custom that if he did not fight early by daytime, he would wait till the wind had started blowing and the time for the prayer was due (i.e. after midday).",
      "chain": [
        "30265",
        "30346",
        "20288",
        "11590",
        "11267",
        "11285",
        "3225"
      ]
    },
    {
      "hadith_no": "3374",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا إسحاق بن إبراهيم، سمع المعتمر، عن عبيد الله، عن سعيد بن أبي سعيد المقبري، عن أبي هريرة  رضى الله عنه  قال قيل للنبي صلى الله عليه وسلم من أكرم الناس قال ‏\"‏ أكرمهم أتقاهم ‏\"‏‏.‏ قالوا يا نبي الله، ليس عن هذا نسألك‏.‏ قال ‏\"‏ فأكرم الناس يوسف نبي الله ابن نبي الله ابن نبي الله ابن خليل الله ‏\"‏‏.‏ قالوا ليس عن هذا نسألك‏.‏ قال ‏\"‏ فعن معادن العرب تسألوني ‏\"‏‏.‏ قالوا نعم‏.‏ قال ‏\"‏ فخياركم في الجاهلية خياركم في الإسلام إذا فقهوا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Some people asked the Prophet: \"Who is the most honorable amongst the people?\" He replied, \"The most honorable among them is the one who is the most Allah-fearing.\" They said, \"O Allah's Prophet! We do not ask about this.\" He said, \"Then the most honorable person is Joseph, Allah's Prophet, the son of Allah's Prophet, the son of Allah's Prophet, the son of Allah's Khalil.\" They said, \"We do not ask about this.\" He said, \"Then you want to ask me about the Arabs' descent?\" They said, \"Yes.\" He said, \"Those who were best in the pre-lslamic period, are the best in Islam, if they comprehend (the religious knowledge).",
      "chain": [
        "30123",
        "20288",
        "11201",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "3622",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا معتمر، عن أبيه، حدثنا أبو عثمان، أنه حدثه عبد الرحمن بن أبي بكر  رضى الله عنهما  أن أصحاب، الصفة كانوا أناسا فقراء، وأن النبي  صلى الله عليه وسلم قال مرة ‏\"‏ من كان عنده طعام اثنين فليذهب بثالث، ومن كان عنده طعام أربعة فليذهب بخامس أو سادس ‏\"‏‏.‏ أو كما قال، وأن أبا بكر جاء بثلاثة وانطلق النبي صلى الله عليه وسلم بعشرة، وأبو بكر وثلاثة، قال فهو أنا وأبي وأمي  ولا أدري هل قال امرأتي وخادمي  بين بيتنا وبين بيت أبي بكر، وأن أبا بكر تعشى عند النبي صلى الله عليه وسلم ثم لبث حتى صلى العشاء، ثم رجع فلبث حتى تعشى رسول الله صلى الله عليه وسلم فجاء بعد ما مضى من الليل ما شاء الله، قالت له امرأته ما حبسك عن أضيافك أو ضيفك‏.‏ قال أو عشيتهم قالت أبوا حتى تجيء، قد عرضوا عليهم فغلبوهم، فذهبت فاختبأت، فقال يا غنثر‏.‏ فجدع وسب وقال كلوا وقال لا أطعمه أبدا‏.‏ قال وايم الله ما كنا نأخذ من اللقمة إلا ربا من أسفلها أكثر منها حتى شبعوا، وصارت أكثر مما كانت قبل، فنظر أبو بكر فإذا شىء أو أكثر قال لامرأته يا أخت بني فراس‏.‏ قالت لا وقرة عيني لهى الآن أكثر مما قبل بثلاث مرات‏.‏ فأكل منها أبو بكر، وقال إنما كان الشيطان  يعني يمينه  ثم أكل منها لقمة، ثم حملها إلى النبي صلى الله عليه وسلم فأصبحت عنده‏.‏ وكان بيننا وبين قوم عهد، فمضى الأجل، فتفرقنا اثنا عشر رجلا مع كل رجل منهم أناس‏.‏ الله أعلم كم مع كل رجل، غير أنه بعث معهم، قال أكلوا منها أجمعون‏.‏ أو كما قال‏.‏    وغيره يقول فعرفنا من العرافة",
      "text_en": " Narrated `Abdur-Rahman bin Abi Bakr:                     The companions of Suffa were poor people. The Prophet once said, \"Whoever has food enough for two persons, should take a third one (from among them), and whoever has food enough for four persons, should take a fifth or a sixth (or said something similar).\" Abu Bakr brought three persons while the Prophet took ten. And Abu Bakr with his three family member (who were I, my father and my mother) (the sub-narrator is in doubt whether `Abdur-Rahman said, \"My wife and my servant who was common for both my house and Abu Bakr's house.\") Abu Bakr took his supper with the Prophet and stayed there till he offered the `Isha' prayers. He returned and stayed till Allah's Apostle took his supper. After a part of the night had passed, he returned to his house. His wife said to him, \"What has detained you from your guests?\" He said, \"Have you served supper to them?\" She said, \"They refused to take supper until you come. They (i.e. some members of the household) presented the meal to them but they refused (to eat)\" I went to hide myself and he said, \"O Ghunthar!\" He invoked Allah to cause my ears to be cut and he rebuked me. He then said (to them): Please eat!\" and added, I will never eat the meal.\" By Allah, whenever we took a handful of the meal, the meal grew from underneath more than that handful till everybody ate to his satisfaction; yet the remaining food was more than the original meal. Abu Bakr saw that the food was as much or more than the original amount. He called his wife, \"O sister of Bani Firas!\" She said, \"O pleasure of my eyes. The food has been tripled in quantity.\" Abu Bakr then started eating thereof and said, \"It (i.e. my oath not to eat) was because of Sa all.\" He took a handful from it, and carried the rest to the Prophet. So that food was with the Prophet . There was a treaty between us and some people, and when the period of that treaty had elapsed, he divided US into twelve groups, each being headed by a man. Allah knows how many men were under the command of each leader. Anyhow, the Prophet surely sent a leader with each group. Then all of them ate of that meal.",
      "chain": [
        "20040",
        "20288",
        "11289",
        "11113",
        "107"
      ]
    },
    {
      "hadith_no": "3677",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني عباس بن الوليد النرسي، حدثنا معتمر، قال سمعت أبي، حدثنا أبو عثمان، قال أنبئت أن جبريل  عليه السلام  أتى النبي صلى الله عليه وسلم وعنده أم سلمة، فجعل يحدث ثم قام، فقال النبي صلى الله عليه وسلم لأم سلمة ‏\"‏ من هذا ‏\"‏‏.‏ أو كما قال‏.‏ قال قالت هذا دحية‏.‏ قالت أم سلمة ايم الله ما حسبته إلا إياه حتى سمعت خطبة نبي الله صلى الله عليه وسلم يخبر جبريل أو كما قال‏.‏ قال فقلت لأبي عثمان ممن سمعت هذا قال من أسامة بن زيد‏.‏",
      "text_en": " Narrated Abu `Uthman:                     I got the news that Gabriel came to the Prophet while Um Salama was present. Gabriel started talking (to the Prophet and then left. The Prophet said to Um Salama, \"(Do you know) who it was?\" (or a similar question). She said, \"It was Dihya (a handsome person amongst the companions of the Prophet ).\" Later on Um Salama said, \"By Allah! I thought he was none but Dihya, till I heard the Prophet talking about Gabriel in his sermon.\" (The Sub-narrator asked Abu `Uthman, \"From where have you heard this narration?\" He replied, \"From Usama bin Zaid.\")",
      "chain": [
        "20288",
        "11289",
        "11113"
      ]
    },
    {
      "hadith_no": "3769",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني محمد بن أبي بكر المقدمي، حدثنا معتمر، عن أبيه، عن أبي عثمان، قال لم يبق مع النبي صلى الله عليه وسلم في بعض تلك الأيام التي قاتل فيهن رسول الله صلى الله عليه وسلم غير طلحة وسعد‏.‏ عن حديثهما‏.‏",
      "text_en": " Narrated Abu `Uthman:                     During one of the Ghazawat in which Allah's Apostle was fighting, none remained with the Prophet but Talha and Sa`d.",
      "chain": [
        "30161",
        "20288",
        "11289",
        "11113"
      ]
    },
    {
      "hadith_no": "3781",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا معتمر، قال سمعت أبي، حدثنا أبو عثمان، عن أسامة بن زيد  رضى الله عنهما  حدث عن النبي صلى الله عليه وسلم أنه كان يأخذه والحسن فيقول ‏\"‏ اللهم أحبهما فإني أحبهما ‏\"‏‏.‏",
      "text_en": "      Narrated Usama bin Zaid:                          That the Prophet used to take him (i.e. Usama) and Al-Hassan (in his      lap) and say: \"O Allah! Love them, as I love them.\"",
      "chain": [
        "20040",
        "20288",
        "11289",
        "11113",
        "50"
      ]
    },
    {
      "hadith_no": "3792",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا مسدد، حدثنا المعتمر، قال سمعت أبي قال، حدثنا أبو عثمان، عن أسامة بن زيد  رضى الله عنهما  عن النبي صلى الله عليه وسلم أنه كان يأخذه والحسن ويقول ‏\"‏ اللهم إني أحبهما فأحبهما ‏\"‏‏.‏ أو كما قال‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     That the Prophet used to take him and Al-Hasan, and used to say, \"O Allah! I love them, so please love them,\" or said something similar.",
      "chain": [
        "30175",
        "20288",
        "11289",
        "11113",
        "50"
      ]
    },
    {
      "hadith_no": "3994",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني الحسن بن عمر بن شقيق، حدثنا معتمر، قال أبي وحدثنا أبو عثمان، عن سلمان الفارسي، أنه تداوله بضعة عشر من رب إلى رب‏.‏",
      "text_en": " Narrated Salman Al-Farisi:                     That he was sold (as a slave) by one master to another for more than ten times (i.e between 13 and 19).",
      "chain": [
        "30130",
        "20288",
        "11289",
        "11113",
        "14"
      ]
    },
    {
      "hadith_no": "4014",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن عبد الله الرقاشي، حدثنا معتمر، قال سمعت أبي يقول، حدثنا أبو مجلز، عن قيس بن عباد، عن علي بن أبي طالب  رضى الله عنه  أنه قال أنا أول، من يجثو بين يدى الرحمن للخصومة يوم القيامة‏.‏ وقال قيس بن عباد وفيهم أنزلت ‏{‏هذان خصمان اختصموا في ربهم‏}‏ قال هم الذين تبارزوا يوم بدر حمزة وعلي وعبيدة أو أبو عبيدة بن الحارث وشيبة بن ربيعة وعتبة والوليد بن عتبة‏.‏",
      "text_en": " Narrated Abu Mijlaz:                     From Qais bin Ubad: `Ali bin Abi Talib said, \"I shall be the first man to kneel down before (Allah), the Beneficent to receive His judgment on the day of Resurrection (in my favor).\" Qais bin Ubad also said, \"The following Verse was revealed in their connection:-- \"These two opponents believers and disbelievers) Dispute with each other About their Lord.\" (22.19) Qais said that they were those who fought on the day of Badr, namely, Hamza, `Ali, 'Ubaida or Abu 'Ubaida bin Al-Harith, Shaiba bin Rabi`a, `Utba and Al-Wahd bin `Utba.",
      "chain": [
        "30168",
        "20288",
        "11289",
        "11313",
        "11609",
        "5"
      ]
    },
    {
      "hadith_no": "4080",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن أبي الأسود، حدثنا معتمر، عن أبيه، سمعت أنس بن مالك  رضى الله عنه قال كان الرجل يجعل للنبي صلى الله عليه وسلم النخلات حتى افتتح قريظة والنضير، فكان بعد ذلك يرد عليهم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Some people used to allot some date palm trees to the Prophet as gift till he conquered Banu Quraiza and Bani An-Nadir, where upon he started returning their date palms to them.",
      "chain": [
        "30145",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "4110",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا موسى بن إسماعيل، عن معتمر، عن أبيه، قال زعم أبو عثمان أنه لم يبق مع النبي صلى الله عليه وسلم في بعض تلك الأيام التي يقاتل فيهن غير طلحة وسعد‏.‏ عن حديثهما‏.‏",
      "text_en": " Narrated Mu'tamir's father:                     `Uthman said that on the day of the battle of Uhud, none remained with the Prophet but Talha and Sa`d.",
      "chain": [
        "20040",
        "20288",
        "11289"
      ]
    },
    {
      "hadith_no": "4170",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا ابن أبي الأسود، حدثنا معتمر، وحدثني خليفة، حدثنا معتمر، قال سمعت أبي، عن أنس  رضى الله عنه  قال كان الرجل يجعل للنبي صلى الله عليه وسلم النخلات حتى افتتح قريظة والنضير، وإن أهلي أمروني أن آتي النبي صلى الله عليه وسلم فأسأله الذين كانوا أعطوه أو بعضه‏.‏ وكان النبي صلى الله عليه وسلم قد أعطاه أم أيمن، فجاءت أم أيمن فجعلت الثوب في عنقي تقول كلا والذي لا إله إلا هو لا يعطيكهم وقد أعطانيها، أو كما قالت، والنبي صلى الله عليه وسلم يقول ‏\"‏ لك كذا ‏\"‏‏.‏ وتقول كلا والله‏.‏ حتى أعطاها، حسبت أنه قال ‏\"‏ عشرة أمثاله ‏\"‏‏.‏ أو كما قال‏.‏",
      "text_en": " Narrated Anas:                     Some (of the Ansar) used to present date palm trees to the Prophet till Banu Quraiza and Banu An- Nadir were conquered (then he returned to the people their date palms). My people ordered me to ask the Prophet to return some or all the date palms they had given to him, but the Prophet had given those trees to Um Aiman. On that, Um Aiman came and put the garment around my neck and said, \"No, by Him except Whom none has the right to be worshipped, he will not return those trees to you as he (i.e. the Prophet ) has given them to me.\" The Prophet go said (to her), \"Return those trees and I will give you so much (instead of them).\" But she kept on refusing, saying, \"No, by Allah,\" till he gave her ten times the number of her date palms.",
      "chain": [
        "30145",
        "20288",
        "30132",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "4513",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني أحمد بن الحسن، حدثنا أحمد بن محمد بن حنبل بن هلال، حدثنا معتمر بن سليمان، عن كهمس، عن ابن بريدة، عن أبيه، قال غزا مع رسول الله صلى الله عليه وسلم ست عشرة غزوة‏.‏",
      "text_en": " Narrated Buraida:                     That he fought sixteen Ghazawat with Allah''s Apostle.",
      "chain": [
        "30292",
        "30007",
        "20288",
        "11303",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "4530",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا معتمر، عن أبيه، عن أنس  رضى الله عنه  قال لم يبق ممن صلى القبلتين غيري‏.‏",
      "text_en": " Narrated Anas:                     None remains of those who prayed facing both Qiblas (that is, Jerusalem and Mecca) except myself.",
      "chain": [
        "30026",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "4791",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا معتمر بن سليمان، قال سمعت أبي قال، حدثنا أبو مجلز، عن قيس بن عباد، عن علي بن أبي طالب  رضى الله عنه  قال أنا أول، من يجثو بين يدى الرحمن للخصومة يوم القيامة‏.‏ قال قيس وفيهم نزلت ‏{‏هذان خصمان اختصموا في ربهم‏}‏ قال هم الذين بارزوا يوم بدر علي وحمزة وعبيدة وشيبة بن ربيعة وعتبة بن ربيعة والوليد بن عتبة‏.‏",
      "text_en": " Narrated Qais bin Ubad:                     `Ali said, \"I will be the first to kneel before the Beneficent on the Day of Resurrection because of the dispute.\" Qais said; This Verse: 'These two opponents (believers and disbelievers dispute with each other about their Lord,' (22.19) was revealed in connection with those who came out for the Battle of Badr, i.e. `Ali, Hamza, 'Ubaida, Shaiba bin Rabi`a, `Utba bin Rabi`a and Al-Walid bin `Utba.",
      "chain": [
        "20219",
        "20288",
        "11289",
        "11313",
        "11609",
        "5"
      ]
    },
    {
      "hadith_no": "4838",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن عبد الله الرقاشي، حدثنا معتمر بن سليمان، قال سمعت أبي يقول، حدثنا أبو مجلز، عن أنس بن مالك  رضى الله عنه  قال لما تزوج رسول الله صلى الله عليه وسلم زينب ابنة جحش دعا القوم، فطعموا ثم جلسوا يتحدثون وإذا هو كأنه يتهيأ للقيام فلم يقوموا، فلما رأى ذلك قام، فلما قام قام من قام، وقعد ثلاثة نفر فجاء النبي صلى الله عليه وسلم ليدخل فإذا القوم جلوس ثم إنهم قاموا، فانطلقت فجئت فأخبرت النبي صلى الله عليه وسلم أنهم قد انطلقوا، فجاء حتى دخل، فذهبت أدخل فألقى الحجاب بيني وبينه فأنزل الله ‏{‏يا أيها الذين آمنوا لا تدخلوا بيوت النبي‏}‏ الآية",
      "text_en": " Narrated Anas bin Malik:                     When Allah's Apostle married Zainab bint Jahsh, he invited the people to a meal. They took the meal and remained sitting and talking. Then the Prophet (showed them) as if he is ready to get up, yet they did not get up. When he noticed that (there was no response to his movement), he got up, and the others too, got up except three persons who kept on sitting. The Prophet came back in order to enter his house, but he went away again. Then they left, whereupon I set out and went to the Prophet to tell him that they had departed, so he came and entered his house. I wanted to enter along with him, but he put a screen between me and him. Then Allah revealed: 'O you who believe! Do not enter the houses of the Prophet...' (33.53)",
      "chain": [
        "30168",
        "20288",
        "11289",
        "11313",
        "19"
      ]
    },
    {
      "hadith_no": "5031",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا معتمر، قال سمعت أبي، عن أبي عثمان، قال أنبئت أن جبريل، أتى النبي صلى الله عليه وسلم وعنده أم سلمة فجعل يتحدث فقال النبي صلى الله عليه وسلم لأم سلمة ‏\"‏ من هذا ‏\"‏‏.‏ أو كما قال قالت هذا دحية‏.‏ فلما قام قالت والله ما حسبته إلا إياه حتى سمعت خطبة النبي صلى الله عليه وسلم يخبر خبر جبريل أو كما قال، قال أبي قلت لأبي عثمان ممن سمعت هذا‏.‏ قال من أسامة بن زيد‏.‏",
      "text_en": " Narrated Abu `Uthman:                     I was informed that Gabriel came to the Prophet while Um Salama was with him. Gabriel started talking (to the Prophet). Then the Prophet asked Um Salama, \"Who is this?\" She replied, \"He is Dihya (al-Kalbi).\" When Gabriel had left, Um Salama said, \"By Allah, I did not take him for anybody other than him (i.e. Dihya) till I heard the sermon of the Prophet wherein he informed about the news of Gabriel.\" The subnarrator asked Abu `Uthman: From whom have you heard that? Abu `Uthman said: From Usama bin Zaid.",
      "chain": [
        "20040",
        "20288",
        "11289",
        "11113"
      ]
    },
    {
      "hadith_no": "5281",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا معتمر، عن عبيد الله، عن محمد بن المنكدر، عن جابر بن عبد الله  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ دخلت الجنة  أو أتيت الجنة  فأبصرت قصرا فقلت لمن هذا قالوا لعمر بن الخطاب‏.‏ فأردت أن أدخله فلم يمنعني إلا علمي بغيرتك ‏\"‏‏.‏ قال عمر بن الخطاب يا رسول الله بأبي أنت وأمي يا نبي الله أوعليك أغار‏.‏",
      "text_en": " Narrated Jabir:                     The Prophet, said, \"I entered Paradise and saw a palace and asked whose palace is this? They (the Angels) said, \"This palace belongs to `Umar bin Al-Khattab.' I intended to enter it, and nothing stopped me except my knowledge about your sense of Ghira (self-respect (O `Umar).\" `Umar said, \"O Allah's Apostle! Let my father and mother be sacrificed for you! O Allah's Prophet! How dare I think of my Ghira (self-respect) being offended by you?\"",
      "chain": [
        "30161",
        "20288",
        "11201",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "5436",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا موسى، حدثنا معتمر، عن أبيه، قال وحدث أبو عثمان، أيضا عن عبد الرحمن بن أبي بكر  رضى الله عنهما  قال كنا مع النبي صلى الله عليه وسلم ثلاثين ومائة، فقال النبي صلى الله عليه وسلم ‏\"‏ هل مع أحد منكم طعام ‏\"‏‏.‏ فإذا مع رجل صاع من طعام أو نحوه، فعجن، ثم جاء رجل مشرك مشعان طويل بغنم يسوقها فقال النبي صلى الله عليه وسلم ‏\"‏ أبيع أم عطية أو  قال  هبة ‏\"‏‏.‏ قال لا بل بيع‏.‏ قال فاشترى منه شاة فصنعت، فأمر نبي الله صلى الله عليه وسلم بسواد البطن يشوى، وايم الله ما من الثلاثين ومائة إلا قد حز له حزة من سواد بطنها، إن كان شاهدا أعطاها إياه، وإن كان غائبا خبأها له، ثم جعل فيها قصعتين فأكلنا أجمعون وشبعنا، وفضل في القصعتين، فحملته على البعير‏.‏ أو كما قال‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Abu Bakr:                     We were one hundred and thirty men sitting with the Prophet. The Prophet said, \"Have anyone of you any food with him?\" It happened that one man had one Sa of wheat flour (or so) which was turned into dough then. After a while a tall lanky pagan came, driving some sheep. The Prophet asked, 'Will you sell us (a sheep), or give (it to) us as a gift?\" The pagan said, \"No, but I will sell it \" So the Prophet bought from him a sheep which was slaughtered, and then the Prophet ordered that the liver, the kidneys, lungs and heart, etc., of that sheep be roasted. By Allah, none of those one hundred and thirty men but had his share of those things. The Prophet gave to those who were present, and also kept a share for those who were absent He then served that cooked sheep in two big trays and we all ate together our fill; yet there remained a part of it in those two trays which I carried on the camel.",
      "chain": [
        "20040",
        "20288",
        "11289",
        "107"
      ]
    },
    {
      "hadith_no": "5559",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا محمد بن أبي بكر، حدثنا معتمر، عن عبيد الله، عن نافع، سمع ابن كعب بن مالك، يخبر ابن عمر أن أباه، أخبره أن جارية لهم كانت ترعى غنما بسلع، فأبصرت بشاة من غنمها موتا، فكسرت حجرا فذبحتها، فقال لأهله لا تأكلوا حتى آتي النبي صلى الله عليه وسلم فأسأله، أو حتى أرسل إليه من يسأله‏.‏ فأتى النبي صلى الله عليه وسلم أو بعث إليه فأمر النبي صلى الله عليه وسلم بأكلها‏.‏",
      "text_en": " Narrated Ka`b:                     that a slave girl of theirs used to shepherd some sheep at Si'a (a mountain near Medina). On seeing one of her sheep dying, she broke a stone and slaughtered it. Ka`b said to his family, \"Do not eat (of it) till I go to the Prophet and ask him, or, till I send someone to ask him.\" So he went to the Prophet or sent someone to him The Prophet permitted (them) to eat it.",
      "chain": [
        "30161",
        "20288",
        "11201",
        "11014"
      ]
    },
    {
      "hadith_no": "5642",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا مسدد، حدثنا معتمر، عن أبيه، قال سمعت أنسا، قال كنت قائما على الحى أسقيهم  عمومتي وأنا أصغرهم  الفضيخ، فقيل حرمت الخمر‏.‏ فقالوا أكفئها‏.‏ فكفأتها‏.‏ قلت لأنس ما شرابهم قال رطب وبسر‏.‏ فقال أبو بكر بن أنس وكانت خمرهم‏.‏ فلم ينكر أنس‏.‏ وحدثني بعض أصحابي أنه سمع أنسا يقول كانت خمرهم يومئذ‏.‏",
      "text_en": " Narrated Anas:                     While I was waiting on my uncles and serving them with (wine prepared from) dates----and I was the youngest of them----it was said, \"Alcoholic drinks have been prohibited.\" So they said (to me), \"Throw it away.\" So I threw it away.",
      "chain": [
        "30175",
        "20288",
        "11289",
        "19",
        "19"
      ]
    },
    {
      "hadith_no": "5682",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا مسدد، حدثنا معتمر، عن أبيه، قال سمعت أنسا  رضى الله عنه  قال كنت قائما على الحى أسقيهم  عمومتي وأنا أصغرهم  الفضيخ، فقيل حرمت الخمر‏.‏ فقال أكفئها‏.‏ فكفأنا‏.‏ قلت لأنس ما شرابهم قال رطب وبسر‏.‏ فقال أبو بكر بن أنس وكانت خمرهم‏.‏ فلم ينكر أنس‏.‏ وحدثني بعض أصحابي أنه سمع أنسا يقول كانت خمرهم يومئذ‏.‏",
      "text_en": " Narrated Anas:                     I was waiting on my uncles, serving them with an alcoholic drink prepared from dates, and I was the youngest of them. (Suddenly) it was said that alcoholic drinks had been prohibited. So they said (to me), 'Throw it away.\" And I threw it away The sub-narrator said: I asked Anas what their drink was (made from), He replied, \"(From) ripe dates and unripe dates.\"",
      "chain": [
        "30175",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "5862",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "وقال لي مسدد حدثنا معتمر، سمعت أبي قال، رأيت على أنس برنسا أصفر من خز‏.‏",
      "text_en": "",
      "chain": [
        "30175",
        "20288",
        "11289"
      ]
    },
    {
      "hadith_no": "5890",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا الحسن بن عمر، حدثنا معتمر، حدثنا أبي، حدثنا أبو عثمان،، وأشار أبو عثمان، بإصبعيه المسبحة والوسطى‏.‏",
      "text_en": " Narrated Abu `Uthman:                     (as above, 719)",
      "chain": [
        "30130",
        "20288",
        "11289",
        "11113"
      ]
    },
    {
      "hadith_no": "5922",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني محمد بن أبي بكر، حدثنا معتمر، عن عبيد الله، عن سعيد بن أبي سعيد، عن أبي سلمة بن عبد الرحمن، عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم كان يحتجر حصيرا بالليل فيصلي، ويبسطه بالنهار فيجلس عليه، فجعل الناس يثوبون إلى النبي صلى الله عليه وسلم فيصلون بصلاته حتى كثروا فأقبل فقال ‏\"‏ يا أيها الناس خذوا من الأعمال ما تطيقون، فإن الله لا يمل حتى تملوا، وإن أحب الأعمال إلى الله ما دام وإن قل ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to construct a loom with a Hasir at night m order to pray therein, and during the day he used to spread it out and sit on it. The people started coming to the Prophet at night to offer the prayer behind him When their number increased, the Prophet faced them and said. O people! Do only those good deeds which you can do, for Allah does not get tired (of giving reward) till you get tired, and the best deeds to Allah are the incessant ones though they were few.",
      "chain": [
        "30161",
        "20288",
        "11201",
        "11168",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "5931",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا إسحاق، أخبرنا معتمر، قال سمعت حميدا، يحدث عن أنس  رضى الله عنه  أن النبي صلى الله عليه وسلم كان خاتمه من فضة وكان فصه منه‏.‏ وقال يحيى بن أيوب حدثني حميد سمع أنسا عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas:                     The ring of the Prophet was of silver, and its stone was of silver too.",
      "chain": [
        "30312",
        "20288",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "6069",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا عارم، حدثنا المعتمر بن سليمان، يحدث عن أبيه، قال سمعت أبا تميمة، يحدث عن أبي عثمان النهدي، يحدثه أبو عثمان عن أسامة بن زيد  رضى الله عنهما كان رسول الله صلى الله عليه وسلم يأخذني فيقعدني على فخذه، ويقعد الحسن على فخذه الأخرى، ثم يضمهما ثم يقول ‏\"‏ اللهم ارحمهما فإني أرحمهما ‏\"‏‏.‏",
      "text_en": " Narrated Usama bin Zaid:                     Allah's Apostle used to put me on (one of) his thighs and put Al-Hasan bin `Ali on his other thigh, and then embrace us and say, \"O Allah! Please be Merciful to them, as I am merciful to them. \"",
      "chain": [
        "30351",
        "20283",
        "20288",
        "11289",
        "11597",
        "11113",
        "50"
      ]
    },
    {
      "hadith_no": "6311",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا أبو النعمان، حدثنا معتمر، قال أبي حدثنا أبو مجلز، عن أنس  رضى الله عنه  قال لما تزوج النبي صلى الله عليه وسلم زينب دخل القوم فطعموا، ثم جلسوا يتحدثون فأخذ كأنه يتهيأ للقيام فلم يقوموا، فلما رأى ذلك قام، فلما قام قام من قام من القوم وقعد بقية القوم، وإن النبي صلى الله عليه وسلم جاء ليدخل، فإذا القوم جلوس، ثم إنهم قاموا فانطلقوا فأخبرت النبي صلى الله عليه وسلم فجاء حتى دخل، فذهبت أدخل فألقى الحجاب بيني وبينه، وأنزل الله تعالى ‏{‏يا أيها الذين آمنوا لا تدخلوا بيوت النبي‏}‏ الآية‏.‏",
      "text_en": " Narrated Anas:                     When the Prophet married Zainab, the people came and were offered a meal, and then they sat down (after finishing their meals) and started chatting. The Prophet showed as if he wanted to get up, but they did not get up. When he noticed that, he got up, and some of the people also got up and went away, while some others kept on sitting. When the Prophet returned to enter, he found the people still sitting, but then they got up and left. So I told the Prophet of their departure and he came and went in. I intended to go in but the Prophet put a screen between me and him, for Allah revealed:-- 'O you who believe! Enter not the Prophet's houses..' (33.53)",
      "chain": [
        "20283",
        "20288",
        "11289",
        "11313",
        "19"
      ]
    },
    {
      "hadith_no": "6345",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا الحسن بن عمر، حدثنا معتمر، سمعت أبي يذكر، عن أبي مجلز، عن أنس بن مالك  رضى الله عنه  قال لما تزوج رسول الله صلى الله عليه وسلم زينب ابنة جحش دعا الناس طعموا ثم جلسوا يتحدثون  قال  فأخذ كأنه يتهيأ للقيام فلم يقوموا، فلما رأى ذلك قام، فلما قام قام من قام معه من الناس، وبقي ثلاثة، وإن النبي صلى الله عليه وسلم جاء ليدخل فإذا القوم جلوس، ثم إنهم قاموا فانطلقوا  قال  فجئت فأخبرت النبي صلى الله عليه وسلم أنهم قد انطلقوا، فجاء حتى دخل فذهبت أدخل، فأرخى الحجاب بيني وبينه، وأنزل الله تعالى ‏{‏يا أيها الذين آمنوا لا تدخلوا بيوت النبي إلا أن يؤذن لكم‏}‏ إلى قوله ‏{‏إن ذلكم كان عند الله عظيما‏}‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     When Allah's Apostle married Zainab bint Jahsh, he invited the people who took their meals and then remained sitting and talking. The Prophet pretended to be ready to get up, but the people did not get up. When he noticed that, he got up, and when he had got up, some of those people got up along with him and there remained three (who kept on sitting). Then the Prophet came back and found those people still sitting. Later on those people got up and went away. So I went to the Prophet and informed him that they had left. The Prophet came, and entered (his house). I wanted to enter(along with him) but he dropped a curtain between me and him. Allah then revealed: 'O you who believe! Do not enter the Prophet's Houses until leave is given... (to His statement)... Verily! That shall be an enormity, in Allah's sight.' (33.53)",
      "chain": [
        "30130",
        "20288",
        "11313",
        "19"
      ]
    },
    {
      "hadith_no": "6362",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا عبد الله بن صباح، حدثنا معتمر بن سليمان، قال سمعت أبي قال، سمعت أنس بن مالك، أسر إلى النبي صلى الله عليه وسلم سرا فما أخبرت به أحدا بعده، ولقد سألتني أم سليم فما أخبرتها به‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet confided to me a secret which I did not disclose to anybody after him. And Um Sulaim asked me (about that secret) but I did not tell her.",
      "chain": [
        "30142",
        "20288",
        "11289"
      ]
    },
    {
      "hadith_no": "6378",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "وقال لي خليفة قال معتمر سمعت أبي، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ كل نبي سأل سؤلا  أو قال لكل نبي دعوة قد دعا بها  فاستجيب، فجعلت دعوتي شفاعة لأمتي يوم القيامة ‏\"‏‏.‏",
      "text_en": "      Narrated Anas:                          that the Prophet said, \"For every prophet there is an invocation that      surely will be responded by Allah,\" (or said), \"For every prophet      there was an invocation with which he appealed to Allah, and his      invocation was accepted (in his lifetime), but I kept my (this      special) invocation to intercede for my followers on the Day of      Resurrection.\"",
      "chain": [
        "30132",
        "20288",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "6384",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا مسدد، حدثنا معتمر، قال سمعت منصورا، عن سعد بن عبيدة، قال حدثني البراء بن عازب  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أتيت مضجعك فتوضأ وضوءك للصلاة، ثم اضطجع على شقك الأيمن، وقل اللهم أسلمت نفسي إليك، وفوضت أمري إليك، وألجأت ظهري إليك، رهبة ورغبة إليك، لا ملجأ ولا منجا منك إلا إليك، آمنت بكتابك الذي أنزلت، وبنبيك الذي أرسلت‏.‏ فإن مت مت على الفطرة، فاجعلهن آخر ما تقول ‏\"‏‏.‏ فقلت أستذكرهن وبرسولك الذي أرسلت‏.‏ قال ‏\"‏ لا، وبنبيك الذي أرسلت ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara bin `Azib:                     Allah's Apostle said to me, \"When you want to go to bed, perform ablution as you do for prayer, then lie down on your right side and say: 'Allahumma aslamtu wajhi ilaika, wa fauwadtu `Amri ilaika wa aljatu zahri ilaika, raghbatan wa rahbatan ilaika, lamalja'a wa la manna mink a ill a ilaika. Amantu bikitabi kalladhi anzalta wa bi nabiyyikal-ladhi arsalta'. If you should die then (after reciting this) you will die on the religion of Islam (i.e., as a Muslim); so let these words be the last you say (before going to bed)\" While I was memorizing it, I said, \"Wa birasiulikal-ladhi arsalta (in Your Apostle whom You have sent).' The Prophet said, \"No, but say: Wa binabiyyi-kalladhi arsalta (in Your Prophet whom You have sent).",
      "chain": [
        "30175",
        "20288",
        "11067",
        "11344",
        "400"
      ]
    },
    {
      "hadith_no": "6441",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا مسدد، حدثنا المعتمر، قال سمعت أبي قال، سمعت أنس بن مالك  رضى الله عنه  يقول كان نبي الله صلى الله عليه وسلم يقول ‏\"‏ اللهم إني أعوذ بك من العجز والكسل، والجبن والهرم، وأعوذ بك من عذاب القبر، وأعوذ بك من فتنة المحيا والممات ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Prophet used to say, \"O Allah! I seek refuge with You from incapacity and laziness, from cowardice and geriatric old age, and seek refuge with You from the punishment of the grave, and I seek refuge with You from the afflictions of life and death.\"",
      "chain": [
        "30175",
        "20288",
        "11289",
        "19"
      ]
    }
  ],
  "total_hadiths": 264
}