{
  "id": "20299",
  "name": "Wahayb bin Khalid bin 'Ajlan al-Bahli وهيب بن خالد بن عجلان الباهلي",
  "full_name": "Wahayb bin Khalid bin 'Ajlan al-Bahli وهيب بن خالد بن عجلان الباهلي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "165",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "Client",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11282",
      "name": "Khalid bin Mahran al-Hadha' خالد بن مهران الحذاء",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11585",
      "name": "Da'ud bin Abi Hnd داود بن أبي هند",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11286",
      "name": "Sa'id bin Iyas al-Jariri سعيد بن إياس الجريري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11504",
      "name": "Khthym bin Arak bin Malik خثيم بن عراك بن مالك",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10898",
      "name": "Ja'far bin Muhammad bin 'Ali جعفر بن محمد بن علي - الصادق",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11106",
      "name": "Musa bin 'Uqba موسى بن عقبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11404",
      "name": "Yahya bin Sa'id bin Hiyan يحيى بن سعيد بن حيان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11210",
      "name": "'Amr bin Yahya bin 'Ammara عمرو بن يحيى بن عمارة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10783",
      "name": "'Abdullah bin Shabarma عبد الله بن شبرمة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11295",
      "name": "'Abdul 'Aziz bin Suhaib عبد العزيز بن صهيب البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11173",
      "name": "Suhayl bin Abi Salah سهيل بن أبي صالح",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11172",
      "name": "Abu Hazim, Salma bin Dinar سلمة بن دينار أبو حازم الأعرج",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11894",
      "name": "'Amarah bin Ghazya bin al-Harith عمارة بن غزية بن الحارث",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20364",
      "name": "Yahya bin Aadm bin Sulaiman يحيى بن آدم بن سليمان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20528",
      "name": "Ahmed bin Ishaq bin Zayd أحمد بن إسحاق بن زيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20218",
      "name": "Hiban bin Hilal حبان بن هلال",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20195",
      "name": "'Abdur Rahman bin 'Abdullah bin 'Ubaid عبد الرحمن بن عبد الله بن عبيد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20296",
      "name": "Hisham bin 'Abdul Malik al-Tayalasi هشام بن عبد الملك أبو الوليد الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "11034",
      "name": "al-Mughira bin 'Abdur Rahman المغيرة بن عبد الرحمن بن الحارث",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20193",
      "name": "Sulaiman bin Harb سليمان بن حرب",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20283",
      "name": "Muhammad bin al-Fadl 'Aram محمد بن الفضل السدوسي أبو النعمان عارم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20040",
      "name": "Musa bin Isma'il al-Munqari al-Tabudhaki موسى بن إسماعيل المنقري - لتبوذكي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20285",
      "name": "Muslim bin Ibrahim al-Azdy مسلم بن إبراهيم الأزدي الفراهيدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30106",
      "name": "'Affan bin Muslim عفان بن مسلم بن عبد الله الصفار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30138",
      "name": "Sahl bin Bkar bin Bashr سهل بن بكار بن بشر",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20300",
      "name": "Yahya bin Hsan يحيى بن حسان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30146",
      "name": "'Abdul A'ala bin Hamad bin Nasr al-Bahli عبد الأعلى بن حماد بن نصر الباهلي النرسي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20294",
      "name": "Hadba bin Khalid bin al-Aswad هدبة بن خالد بن الأسود",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "84",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا وهيب، قال حدثنا أيوب، عن عكرمة، عن ابن عباس، أن النبي صلى الله عليه وسلم سئل في حجته فقال ذبحت قبل أن أرمي، فأومأ بيده قال ولا حرج‏.‏ قال حلقت قبل أن أذبح‏.‏ فأومأ بيده ولا حرج‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Somebody said to the Prophet (during his last Hajj), \"I did the slaughtering before doing the Rami.' The Prophet beckoned with his hand and said, \"There is no harm in that.\" Then another person said. \"I got my head shaved before offering the sacrifice.\" The Prophet beckoned with his hand saying, \"There is no harm in that.\"",
      "chain": [
        "20040",
        "20299",
        "11015",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "86",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا وهيب، قال حدثنا هشام، عن فاطمة، عن أسماء، قالت أتيت عائشة وهي تصلي فقلت ما شأن الناس فأشارت إلى السماء، فإذا الناس قيام، فقالت سبحان الله‏.‏ قلت آية فأشارت برأسها، أى نعم، فقمت حتى تجلاني الغشى، فجعلت أصب على رأسي الماء، فحمد الله عز وجل النبي صلى الله عليه وسلم وأثنى عليه، ثم قال ‏\"‏ ما من شىء لم أكن أريته إلا رأيته في مقامي حتى الجنة والنار، فأوحي إلى أنكم تفتنون في قبوركم، مثل  أو قريبا لا أدري أى ذلك قالت أسماء  من فتنة المسيح الدجال، يقال ما علمك بهذا الرجل فأما المؤمن  أو الموقن لا أدري بأيهما قالت أسماء  فيقول هو محمد رسول الله جاءنا بالبينات والهدى، فأجبنا واتبعنا، هو محمد‏.‏ ثلاثا، فيقال نم صالحا، قد علمنا إن كنت لموقنا به، وأما المنافق  أو المرتاب لا أدري أى ذلك قالت أسماء  فيقول لا أدري، سمعت الناس يقولون شيئا فقلته ‏\"‏‏.‏",
      "text_en": " Narrated Asma':                     I came to `Aisha while she was praying, and said to her, \"What has happened to the people?\" She pointed out towards the sky. (I looked towards the mosque), and saw the people offering the prayer. Aisha said, \"Subhan Allah.\" I said to her, \"Is there a sign?\" She nodded with her head meaning, \"Yes.\" I, too, then stood (for the prayer of eclipse) till I became (nearly) unconscious and later on I poured water on my head. After the prayer, the Prophet praised and glorified Allah and then said, \"Just now at this place I have seen what I have never seen before, including Paradise and Hell. No doubt it has been inspired to me that you will be put to trials in your graves and these trials will be like the trials of Masih-ad-Dajjal or nearly like it (the sub narrator is not sure which expression Asma' used). You will be asked, 'What do you know about this man (the Prophet Muhammad)?' Then the faithful believer (or Asma' said a similar word) will reply, 'He is Muhammad Allah's Apostle who had come to us with clear evidences and guidance and so we accepted his teachings and followed him. And he is Muhammad.' And he will repeat it thrice. Then the angels will say to him, 'Sleep in peace as we have come to know that you were a faithful believer.' On the other hand, a hypocrite or a doubtful person will reply, 'I do not know, but I heard the people saying something and so I said it.' (the same). \"",
      "chain": [
        "20040",
        "20299",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "186",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا موسى، قال حدثنا وهيب، عن عمرو، عن أبيه، شهدت عمرو بن أبي حسن سأل عبد الله بن زيد عن وضوء النبي، صلى الله عليه وسلم فدعا بتور من ماء، فتوضأ لهم وضوء النبي صلى الله عليه وسلم فأكفأ على يده من التور، فغسل يديه ثلاثا، ثم أدخل يده في التور، فمضمض واستنشق واستنثر ثلاث غرفات، ثم أدخل يده فغسل وجهه ثلاثا، ثم أدخل يده فغسل يديه مرتين إلى المرفقين مرتين، ثم أدخل يده فمسح رأسه، فأقبل بهما وأدبر مرة واحدة، ثم غسل رجليه إلى الكعبين‏.‏",
      "text_en": " Narrated `Amr:                     My father saw `Amr bin Abi Hasan asking `Abdullah bin Zaid about the ablution of the Prophet. `Abdullah bin Zaid asked for earthenware pot containing water and in front of them performed ablution like that of the Prophet . He poured water from the pot over his hand and washed his hands thrice and then he put his hands in the pot and rinsed his mouth and washed his nose by putting water in it and then blowing it out with three handfuls of water. Again he put his hand in the water and washed his face thrice and washed his forearms up to the elbows twice; and then put his hands in the water and then passed them over his head by bringing them to the front and then to the rear of the head once, and then he washed his feet up to the ankles.",
      "chain": [
        "20040",
        "20299",
        "11210",
        "605"
      ]
    },
    {
      "hadith_no": "192",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا سليمان بن حرب، قال حدثنا وهيب، قال حدثنا عمرو بن يحيى، عن أبيه، قال شهدت عمرو بن أبي حسن سأل عبد الله بن زيد عن وضوء النبي، صلى الله عليه وسلم فدعا بتور من ماء، فتوضأ لهم، فكفأ على يديه فغسلهما ثلاثا، ثم أدخل يده في الإناء، فمضمض واستنشق، واستنثر ثلاثا بثلاث غرفات من ماء، ثم أدخل يده في الإناء، فغسل وجهه ثلاثا، ثم أدخل يده في الإناء، فغسل يديه إلى المرفقين مرتين مرتين، ثم أدخل يده في الإناء، فمسح برأسه فأقبل بيديه وأدبر بهما، ثم أدخل يده في الإناء فغسل رجليه‏.‏ وحدثنا موسى قال حدثنا وهيب قال مسح رأسه مرة‏.‏",
      "text_en": " Narrated `Amr bin Yahya:                     My father said, \"I saw `Amr bin Abi Hasan asking `Abdullah bin Zaid about the ablution of the Prophet. `Abdullah bin Zaid asked for an earthenware pot containing water and performed ablution in front of them. He poured water over his hands and washed them thrice. Then he put his (right) hand in the pot and rinsed his mouth and washed his nose by putting water in it and then blowing it out thrice with three handfuls of water Again he put his hand in the water and washed his face thrice. After that he put his hand in the pot and washed his forearms up to the elbows twice and then again put his hand in the water and passed wet hands over his head by bringing them to the front and then to the back and once more he put his hand in the pot and washed his feet (up to the ankles.)\"Narrated Wuhaib:That he (the Prophet in narration 191 above) had passed his wet hands on the head once only.",
      "chain": [
        "20193",
        "20299",
        "11210",
        "11232",
        "605"
      ]
    },
    {
      "hadith_no": "315",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا مسلم، قال حدثنا وهيب، حدثنا منصور، عن أمه، عن عائشة، أن امرأة، من الأنصار قالت للنبي صلى الله عليه وسلم كيف أغتسل من المحيض قال ‏\"‏ خذي فرصة ممسكة، فتوضئي ثلاثا ‏\"‏‏.‏ ثم إن النبي صلى الله عليه وسلم استحيا فأعرض بوجهه أو قال ‏\"‏ توضئي بها ‏\"‏ فأخذتها فجذبتها فأخبرتها بما يريد النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Aisha:                     An Ansari woman asked the Prophet how to take a bath after finishing from the menses. He replied, \"Take a piece a cloth perfumed with musk and clean the private parts with it thrice.\" The Prophet felt shy and turned his face. So pulled her to me and told her what the Prophet meant.",
      "chain": [
        "20285",
        "20299",
        "11067",
        "53"
      ]
    },
    {
      "hadith_no": "329",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا معلى بن أسد، قال حدثنا وهيب، عن عبد الله بن طاوس، عن أبيه، عن ابن عباس، قال رخص للحائض أن تنفر، إذا حاضت‏.‏   وكان ابن عمر يقول في أول أمره إنها لا تنفر‏.‏ ثم سمعته يقول تنفر إن رسول الله صلى الله عليه وسلم رخص لهن‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A woman is allowed to leave (go back home) if she gets menses (after Tawaf-Al-Ifada). Ibn `Umar formerly used to say that she should not leave but later on I heard him saying, \"She may leave, since Allah's Apostle gave them the permission to leave (after Tawaf-Al-Ifada).\"",
      "chain": [
        "30457",
        "20299",
        "11433",
        "11053",
        "17",
        "18"
      ]
    },
    {
      "hadith_no": "628",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا معلى بن أسد، قال حدثنا وهيب، عن أيوب، عن أبي قلابة، عن مالك بن الحويرث، أتيت النبي صلى الله عليه وسلم في نفر من قومي فأقمنا عنده عشرين ليلة، وكان رحيما رفيقا، فلما رأى شوقنا إلى أهالينا قال ‏\"‏ ارجعوا فكونوا فيهم وعلموهم وصلوا، فإذا حضرت الصلاة فليؤذن لكم أحدكم وليؤمكم أكبركم ‏\"‏‏.‏",
      "text_en": " Narrated Malik bin Huwairith:                     I came to the Prophet with some men from my tribe and stayed with him for twenty nights. He was kind and merciful to us. When he realized our longing for our families, he said to us, \"Go back and stay with your families and teach them the religion, and offer the prayer and one of you should pronounce the Adhan for the prayer when its time is due and the oldest one amongst you should lead the prayer.\"",
      "chain": [
        "30457",
        "20299",
        "11015",
        "11047"
      ]
    },
    {
      "hadith_no": "677",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا وهيب، قال حدثنا أيوب، عن أبي قلابة، قال جاءنا مالك بن الحويرث في مسجدنا هذا فقال إني لأصلي بكم، وما أريد الصلاة، أصلي كيف رأيت النبي صلى الله عليه وسلم يصلي‏.‏ فقلت لأبي قلابة كيف كان يصلي قال مثل شيخنا هذا‏.‏ قال وكان شيخا يجلس إذا رفع رأسه من السجود قبل أن ينهض في الركعة الأولى‏.‏",
      "text_en": " Narrated Aiyub:                     Abu Qilaba said, \"Malik bin Huwairith came to this Mosque of ours and said, 'I pray in front of you and my aim is not to lead the prayer but to show you the way in which the Prophet used to pray.' \" I asked Abu Qilaba, \"How did he use to pray?' \" He replied, \"(The Prophet used to pray) like this Sheikh of ours and the Sheikh used to sit for a while after the prostration, before getting up after the first rak`a. \"",
      "chain": [
        "20040",
        "20299",
        "11015",
        "11047"
      ]
    },
    {
      "hadith_no": "731",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبد الأعلى بن حماد، قال حدثنا وهيب، قال حدثنا موسى بن عقبة، عن سالم أبي النضر، عن بسر بن سعيد، عن زيد بن ثابت، أن رسول الله صلى الله عليه وسلم اتخذ حجرة  قال حسبت أنه قال  من حصير في رمضان فصلى فيها ليالي، فصلى بصلاته ناس من أصحابه، فلما علم بهم جعل يقعد، فخرج إليهم فقال ‏\"‏ قد عرفت الذي رأيت من صنيعكم، فصلوا أيها الناس في بيوتكم، فإن أفضل الصلاة صلاة المرء في بيته إلا المكتوبة ‏\"‏‏.‏ قال عفان حدثنا وهيب، حدثنا موسى، سمعت أبا النضر، عن بسر، عن زيد، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Zaid bin Thabit:                     Allah's Apostle made a small room in the month of Ramadan (Sa`id said, \"I think that Zaid bin Thabit said that it was made of a mat\") and he prayed there for a few nights, and so some of his companions prayed behind him. When he came to know about it, he kept on sitting. In the morning, he went out to them and said, \"I have seen and understood what you did. You should pray in your houses, for the best prayer of a person is that which he prays in his house except the compulsory prayers.\"",
      "chain": [
        "30146",
        "20299",
        "11106",
        "11164",
        "11153",
        "49"
      ]
    },
    {
      "hadith_no": "812",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا معلى بن أسد، قال حدثنا وهيب، عن عبد الله بن طاوس، عن أبيه، عن ابن عباس، رضى الله عنهما قال قال النبي صلى الله عليه وسلم ‏\"‏ أمرت أن أسجد على سبعة أعظم على الجبهة  وأشار بيده على أنفه  واليدين، والركبتين وأطراف القدمين، ولا نكفت الثياب والشعر ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"I have been ordered to prostrate on seven bones i.e. on the forehead along with the tip of the nose and the Prophet pointed towards his nose, both hands, both knees and the toes of both feet and not to gather the clothes or the hair.\"",
      "chain": [
        "30457",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "824",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا معلى بن أسد، قال حدثنا وهيب، عن أيوب، عن أبي قلابة، قال جاءنا مالك بن الحويرث فصلى بنا في مسجدنا هذا فقال إني لأصلي بكم، وما أريد الصلاة، ولكن أريد أن أريكم كيف رأيت النبي صلى الله عليه وسلم يصلي‏.‏ قال أيوب فقلت لأبي قلابة وكيف كانت صلاته قال مثل صلاة شيخنا هذا  يعني عمرو بن سلمة  قال أيوب وكان ذلك الشيخ يتم التكبير، وإذا رفع رأسه عن السجدة الثانية جلس واعتمد على الأرض، ثم قام‏.‏",
      "text_en": " Narrated Aiyub:                     Abu Qilaba said, \"Malik bin Huwairith came to us and led us in the prayer in this mosque of ours and said, 'I lead you in prayer but I do not want to offer the prayer but just to show you how Allah's Apostle performed his prayers.\" I asked Abu Qilaba, \"How was the prayer of Malik bin Huwairith?\" He replied, \"Like the prayer of this Sheikh of ours-- i.e. `Amr bin Salima.\" That Sheikh used to pronounce the Takbir perfectly and when he raised his head from the second prostration he would sit for a while and then support himself on the ground and get up.",
      "chain": [
        "30457",
        "20299",
        "11015",
        "11047"
      ]
    },
    {
      "hadith_no": "897",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا مسلم بن إبراهيم، قال حدثنا وهيب، قال حدثنا ابن طاوس، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ نحن الآخرون السابقون يوم القيامة، أوتوا الكتاب من قبلنا، وأوتيناه من بعدهم، فهذا اليوم الذي اختلفوا فيه فهدانا الله، فغدا لليهود وبعد غد للنصارى ‏\"‏‏.‏ فسكت‏.‏ ثم قال ‏\"‏ حق على كل مسلم أن يغتسل في كل سبعة أيام يوما يغسل فيه رأسه وجسده ‏\"‏‏.‏\tثم قال ‏\"‏ حق على كل مسلم أن يغتسل في كل سبعة أيام يوما يغسل فيه رأسه وجسده ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          Allah's Apostle said \"We are the last (to come amongst the nations)      but (will be) the foremost on the Day of Resurrection. They were given     the Holy Scripture before us and we were given the Quran after them.      And this was the day (Friday) about which they differed and Allah gave     us the guidance (for that). So tomorrow (i.e. Saturday) is the Jews'      (day), and the day after tomorrow (i.e. Sunday) is the Christians'.\"      The Prophet (p.b.u.h) remained silent (for a while) and then said, \"It     is obligatory for every Muslim that he should take a bath once in      seven days, when he should wash his head and body.\"",
      "chain": [
        "20285",
        "20299",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "1085",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا موسى بن إسماعيل، قال حدثنا وهيب، قال حدثنا أيوب، عن أبي العالية البراء، عن ابن عباس  رضى الله عنهما  قال قدم النبي صلى الله عليه وسلم وأصحابه لصبح رابعة يلبون بالحج، فأمرهم أن يجعلوها عمرة إلا من معه الهدى‏.‏ تابعه عطاء عن جابر‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet and his companions reached Mecca in the morning of the 4th Dhul-Hijja reciting Talbiya (O Allah! We are obedient to your orders, we respond 4 to your call) . . . intending to perform Hajj. The Prophet ordered his companions to assume the lhram for Umra instead of Hajj, excepting those who had Hadi (sacrifice) with them.",
      "chain": [
        "20040",
        "20299",
        "11015",
        "11618",
        "17"
      ]
    },
    {
      "hadith_no": "1095",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا عبد الأعلى بن حماد، قال حدثنا وهيب، قال حدثنا موسى بن عقبة، عن نافع، قال وكان ابن عمر  رضى الله عنهما  يصلي على راحلته ويوتر عليها، ويخبر أن النبي صلى الله عليه وسلم كان يفعله‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar (while on a journey) used to offer the prayer and the witr on his mount (Rahila). He said that the Prophet used to do so.",
      "chain": [
        "30146",
        "20299",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1187",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا عبد الأعلى بن حماد، حدثنا وهيب، عن أيوب، وعبيد الله، عن نافع، عن ابن عمر  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اجعلوا فى بيوتكم من صلاتكم ولا تتخذوها قبورا ‏\"‏‏.‏ تابعه عبد الوهاب عن أيوب‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"Offer some of your prayers in your houses and do not make them graves.\"",
      "chain": [
        "30146",
        "20299",
        "11015",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1376",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا معلى، حدثنا وهيب، عن موسى بن عقبة، قال حدثتني ابنة خالد بن سعيد بن العاص، أنها سمعت النبي صلى الله عليه وسلم وهو يتعوذ من عذاب القبر‏.‏",
      "text_en": " Narrated Musa bin `Uqba:                     (From the daughter of Khalid bin Sa id bin Al-`Asi) who said that she had heard the Prophet seeking refuge with Allah from the punishment in the grave.",
      "chain": [
        "30457",
        "20299",
        "11106"
      ]
    },
    {
      "hadith_no": "1387",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا معلى بن أسد، حدثنا وهيب، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت دخلت على أبي بكر  رضى الله عنه  فقال في كم كفنتم النبي صلى الله عليه وسلم قالت في ثلاثة أثواب بيض سحولية، ليس فيها قميص ولا عمامة‏.‏ وقال لها في أى يوم توفي رسول الله صلى الله عليه وسلم قالت يوم الاثنين‏.‏ قال فأى يوم هذا قالت يوم الاثنين‏.‏ قال أرجو فيما بيني وبين الليل‏.‏ فنظر إلى ثوب عليه كان يمرض فيه، به ردع من زعفران فقال اغسلوا ثوبي هذا، وزيدوا عليه ثوبين فكفنوني فيها‏.‏ قلت إن هذا خلق‏.‏ قال إن الحى أحق بالجديد من الميت، إنما هو للمهلة‏.‏ فلم يتوف حتى أمسى من ليلة الثلاثاء ودفن قبل أن يصبح‏.‏",
      "text_en": " Narrated Hisham's father:                     Aisha said, \"I went to Abu Bakr (during his fatal illness) and he asked me, 'In how many garments was the Prophet shrouded?' She replied, 'In three Suhuliya pieces of white cloth of cotton, and there was neither a shirt nor a turban among them.' Abu Bakr further asked her, 'On which day did the Prophet die?' She replied, 'He died on Monday.' He asked, 'What is today?' She replied, 'Today is Monday.' He added, 'I hope I shall die sometime between this morning and tonight.' Then he looked at a garment that he was wearing during his illness and it had some stains of saffron. Then he said, 'Wash this garment of mine and add two more garments and shroud me in them.' I said, 'This is worn out.' He said, 'A living person has more right to wear new clothes than a dead one; the shroud is only for the body's pus.' He did not die till it was the night of Tuesday and was buried before the morning.\"",
      "chain": [
        "30457",
        "20299",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1416",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثني محمد بن عبد الرحيم، حدثنا عفان بن مسلم، حدثنا وهيب، عن يحيى بن سعيد بن حيان، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  أن أعرابيا، أتى النبي صلى الله عليه وسلم فقال دلني على عمل إذا عملته دخلت الجنة‏.‏ قال ‏\"‏ تعبد الله لا تشرك به شيئا، وتقيم الصلاة المكتوبة، وتؤدي الزكاة المفروضة، وتصوم رمضان ‏\"‏‏.‏ قال والذي نفسي بيده لا أزيد على هذا‏.‏ فلما ولى قال النبي صلى الله عليه وسلم ‏\"‏ من سره أن ينظر إلى رجل من أهل الجنة فلينظر إلى هذا ‏\"‏‏.‏ حدثنا مسدد، عن يحيى، عن أبي حيان، قال أخبرني أبو زرعة، عن النبي صلى الله عليه وسلم بهذا‏.‏",
      "text_en": " Narrated Abu Huraira:                     A Bedouin came to the Prophet and said, \"Tell me of such a deed as will make me enter Paradise, if I do it.\" The Prophet (p.b.u.h) said, \"Worship Allah, and worship none along with Him, offer the (five) prescribed compulsory prayers perfectly, pay the compulsory Zakat, and fast the month of Ramadan.\" The Bedouin said, \"By Him, in Whose Hands my life is, I will not do more than this.\" When he (the Bedouin) left, the Prophet said, \"Whoever likes to see a man of Paradise, then he may look at this man.\"Narrated Abu Zur'a:From the Prophet the same as above.",
      "chain": [
        "30272",
        "30106",
        "20299",
        "11062",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "1448",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا هشام، عن أبيه، عن حكيم بن حزام  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ اليد العليا خير من اليد السفلى، وابدأ بمن تعول، وخير الصدقة عن ظهر غنى، ومن يستعفف يعفه الله، ومن يستغن يغنه الله ‏\"‏‏.‏ وعن وهيب، قال أخبرنا هشام، عن أبيه، عن أبي هريرة  رضى الله عنه  بهذا‏.‏",
      "text_en": " Narrated Hakim bin Hizam:                     The Prophet said, \"The upper hand is better than the lower hand (i.e. he who gives in charity is better than him who takes it). One should start giving first to his dependents. And the best object of charity is that which is given by a wealthy person (from the money which is left after his expenses). And whoever abstains from asking others for some financial help, Allah will give him and save him from asking others, Allah will make him self-sufficient.\"",
      "chain": [
        "20040",
        "20299",
        "11065",
        "10511",
        "423"
      ]
    },
    {
      "hadith_no": "1465",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا موسى، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ مثل البخيل والمتصدق كمثل رجلين، عليهما جبتان من حديد ‏\"‏‏.‏ وحدثنا أبو اليمان أخبرنا شعيب حدثنا أبو الزناد أن عبد الرحمن حدثه أنه سمع أبا هريرة  رضى الله عنه  أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ مثل البخيل والمنفق كمثل رجلين، عليهما جبتان من حديد، من ثديهما إلى تراقيهما، فأما المنفق فلا ينفق إلا سبغت  أو وفرت  على جلده حتى تخفي بنانه وتعفو أثره، وأما البخيل فلا يريد أن ينفق شيئا إلا لزقت كل حلقة مكانها، فهو يوسعها ولا تتسع ‏\"‏‏.‏ تابعه الحسن بن مسلم عن طاوس في الجبتين‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The example of a miser and an almsgiver is like the example of two persons wearing iron cloaks.\" Allah's Apostle also said, \"The example of an almsgiver and a miser is like the example of two persons who have two iron cloaks on them from their breasts to their collar bones, and when the almsgiver wants to give in charity, the cloak becomes capacious till it covers his whole body to such an extent that it hides his fingertips and covers his footprints (obliterates his tracks). (1) And when the miser wants to spend, it (the iron cloak) sticks and every ring gets stuck to its place and he tries to widen it, but it did not become wide.",
      "chain": [
        "20040",
        "20299",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "1494",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا موسى، حدثنا وهيب، حدثنا هشام، عن أبيه، عن الزبير بن العوام  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ لأن يأخذ أحدكم حبله فيأتي بحزمة الحطب على ظهره فيبيعها فيكف الله بها وجهه، خير له من أن يسأل الناس أعطوه أو منعوه ‏\"‏‏.‏",
      "text_en": " Narrated Az-Zubair bin Al-`Awwam:                     The Prophet (p.b.u.h) said, \"It is better for anyone of you to take a rope (and cut) and bring a bundle of wood (from the forest) over his back and sell it and Allah will save his face (from the Hell-Fire) because of that, rather than to ask the people who may give him or not.\"",
      "chain": [
        "20040",
        "20299",
        "11065",
        "10511",
        "7"
      ]
    },
    {
      "hadith_no": "1505",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا سهل بن بكار، حدثنا وهيب، عن عمرو بن يحيى، عن عباس الساعدي، عن أبي حميد الساعدي، قال غزونا مع النبي صلى الله عليه وسلم غزوة تبوك فلما جاء وادي القرى إذا امرأة في حديقة لها فقال النبي صلى الله عليه وسلم لأصحابه ‏\"‏ اخرصوا ‏\"‏‏.‏ وخرص رسول الله صلى الله عليه وسلم عشرة أوسق فقال لها ‏\"‏ أحصي ما يخرج منها ‏\"‏‏.‏ فلما أتينا تبوك قال ‏\"‏ أما إنها ستهب الليلة ريح شديدة فلا يقومن أحد، ومن كان معه بعير فليعقله ‏\"‏‏.‏ فعقلناها وهبت ريح شديدة فقام رجل فألقته بجبل طيئ  وأهدى ملك أيلة للنبي صلى الله عليه وسلم بغلة بيضاء، وكساه بردا وكتب له ببحرهم  فلما أتى وادي القرى قال للمرأة ‏\"‏ كم جاء حديقتك ‏\"‏‏.‏ قالت عشرة أوسق خرص رسول الله صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ إني متعجل إلى المدينة، فمن أراد منكم أن يتعجل معي فليتعجل ‏\"‏‏.‏ فلما  قال ابن بكار كلمة معناها  أشرف على المدينة قال ‏\"‏ هذه طابة ‏\"‏‏.‏ فلما رأى أحدا قال ‏\"‏ هذا جبيل يحبنا ونحبه، ألا أخبركم بخير دور الأنصار ‏\"‏‏.‏ قالوا بلى‏.‏ قال ‏\"‏ دور بني النجار، ثم دور بني عبد الأشهل، ثم دور بني ساعدة، أو دور بني الحارث بن الخزرج، وفي كل دور الأنصار  يعني  خيرا ‏\"‏‏.‏ وقال سليمان بن بلال حدثني عمرو، ‏\"‏ ثم دار بني الحارث، ثم بني ساعدة ‏\"‏‏.‏ وقال سليمان عن سعد بن سعيد، عن عمارة بن غزية، عن عباس، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ أحد جبل يحبنا ونحبه ‏\"‏‏.‏ قال أبو عبد الله كل بستان عليه حائط فهو حديقة، وما لم يكن عليه حائط لم يقل حديقة‏.‏",
      "text_en": " Narrated Abu Humaid As-Sa`idi:                     We took part in the holy battle of Tabuk in the company of the Prophet and when we arrived at the Wadi-al-Qura, there was a woman in her garden. The Prophet asked his companions to estimate the amount of the fruits in the garden, and Allah's Apostle estimated it at ten Awsuq (One Wasaq = 60 Sa's) and 1 Sa'= 3 kg. approximately). The Prophet said to that lady, \"Check what your garden will yield.\" When we reached Tabuk, the Prophet said, \"There will be a strong wind tonight and so no one should stand and whoever has a camel, should fasten it.\" So we fastened our camels. A strong wind blew at night and a man stood up and he was blown away to a mountain called Taiy, The King of Aila sent a white mule and a sheet for wearing to the Prophet as a present, and wrote to the Prophet that his people would stay in their place (and will pay Jizya taxation.) (1) When the Prophet reached Wadi-al- Qura he asked that woman how much her garden had yielded. She said, \"Ten Awsuq,\" and that was what Allah's Apostle had estimated. Then the Prophet said, \"I want to reach Medina quickly, and whoever among you wants to accompany me, should hurry up.\" The sub-narrator Ibn Bakkar said something which meant: When the Prophet (p.b.u.h) saw Medina he said, \"This is Taba.\" And when he saw the mountain of Uhud, he said, \"This mountain loves us and we love it. Shall I tell you of the best amongst the Ansar?\" They replied in the affirmative. He said, \"The family of Bani-n-Najjar, and then the family of Bani Sa`ida or Bani Al-Harith bin Al-Khazraj. (The above-mentioned are the best) but there is goodness in all the families of Ansar.\"",
      "chain": [
        "30138",
        "20299",
        "11210",
        "1457"
      ]
    },
    {
      "hadith_no": "1549",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن ابن عباس، قال إن النبي صلى الله عليه وسلم وقت لأهل المدينة ذا الحليفة، ولأهل الشأم الجحفة، ولأهل نجد قرن المنازل، ولأهل اليمن يلملم، هن لهن ولمن أتى عليهن من غيرهن، ممن أراد الحج والعمرة، ومن كان دون ذلك فمن حيث أنشأ، حتى أهل مكة من مكة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle (p.b.u.h) made Dhul-Huiaifa as the Miqat for the people of Medina; Al-Juhfa for the people of Sham; Qarn-al-Manazil for the people of Najd; and Yalamlam for the people of Yemen; and these Mawaqit are for the people at those very places, and besides them for those who come thorough those places with the intention of performing Hajj and `Umra; and whoever is living within these boundaries can assume lhram from the place he starts, and the people of Mecca can assume Ihram from Mecca.",
      "chain": [
        "20040",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1555",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا معلى بن أسد، حدثنا وهيب، عن عبد الله بن طاوس، عن أبيه، عن ابن عباس، رضى الله عنهما أن النبي صلى الله عليه وسلم وقت لأهل المدينة ذا الحليفة، ولأهل الشأم الجحفة، ولأهل نجد قرن المنازل، ولأهل اليمن يلملم، هن لأهلهن ولكل آت أتى عليهن من غيرهم ممن أراد الحج والعمرة فمن كان دون ذلك، فمن حيث أنشأ حتى أهل مكة من مكة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet (p.b.u.h) fixed Dhul-Hulaifa as the Miqat for the people of Medina, Al-Juhfa for the people of Sham, Qarn-al-Manazil for the people of Najd, and Yalamlam for the people of Yemen; and these Mawaqit are for those living at those very places, and besides them for those whom come through them with the intention of performing Hajj and Umra; and whoever is living within these Mawaqit should assume lhram from where he starts, and the people of Mecca can assume Ihram from Mecca.",
      "chain": [
        "30457",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1576",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا أيوب، عن أبي قلابة، عن أنس  رضى الله عنه  قال صلى رسول الله صلى الله عليه وسلم ونحن معه بالمدينة الظهر أربعا، والعصر بذي الحليفة ركعتين، ثم بات بها حتى أصبح، ثم ركب حتى استوت به على البيداء، حمد الله وسبح وكبر، ثم أهل بحج وعمرة، وأهل الناس بهما، فلما قدمنا أمر الناس فحلوا، حتى كان يوم التروية أهلوا بالحج قال ونحر النبي صلى الله عليه وسلم بدنات بيده قياما، وذبح رسول الله صلى الله عليه وسلم بالمدينة كبشين أملحين‏.‏ قال أبو عبد الله قال بعضهم هذا عن أيوب عن رجل عن أنس‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle offered four rak`at of Zuhr prayer at Medina and we were in his company, and two rak`at of the `Asr prayer at Dhul-Hulaifa and then passed the night there till it was dawn; then he rode, and when he reached Al-Baida', he praised and glorified Allah and said Takbir (i.e. Al hamdu-li l-lah and Subhanallah(1) and Allahu-Akbar). Then he and the people along with him recited Talbiya with the intention of performing Hajj and Umra. When we reached (Mecca) he ordered us to finish the lhram (after performing the Umra) (only those who had no Hadi (animal for sacrifice) with them were asked to do so) till the day of Tarwiya that is 8th Dhul-Hijja when they assumed Ihram for Hajj. The Prophet sacrificed many camels (slaughtering them) with his own hands while standing. While Allah's Apostle was in Medina he sacrificed two horned rams black and white in color in the Name of Allah.\"",
      "chain": [
        "20040",
        "20299",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "1589",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن ابن عباس  رضى الله عنهما  قال كانوا يرون أن العمرة في أشهر الحج من أفجر الفجور في الأرض، ويجعلون المحرم صفرا ويقولون إذا برأ الدبر، وعفا الأثر، وانسلخ صفر، حلت العمرة لمن اعتمر‏.‏ قدم النبي صلى الله عليه وسلم وأصحابه صبيحة رابعة مهلين بالحج، فأمرهم أن يجعلوها عمرة فتعاظم ذلك عندهم فقالوا يا رسول الله أى الحل قال ‏\"‏ حل كله ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The people (of the Pre-Islamic Period) used to think that to perform `Umra during the months of Hajj was one of the major sins on earth. And also used to consider the month of Safar as a forbidden (i.e. sacred) month and they used to say, \"When the wounds of the camel's back heal up (after they return from Hajj) and the signs of those wounds vanish and the month of Safar passes away then (at that time) `Umra is permissible for the one who wishes to perform it.\" In the morning of the 4th of Dhul- Hijja, the Prophet and his companions reached Mecca, assuming Ihram for Hajj and he ordered his companions to make their intentions of the Ihram for `Umra only (instead of Hajj) so they considered his order as something great and were puzzled, and said, \"O Allah's Apostle! What kind (of finishing) of Ihram is allowed?\" The Prophet replied, \"Finish the Ihram completely like a non-Muhrim (you are allowed everything).\"",
      "chain": [
        "20040",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1606",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا موسى، حدثنا وهيب، حدثنا هشام، عن أبيه، دخل النبي صلى الله عليه وسلم عام الفتح من كداء‏.‏ وكان عروة يدخل منهما كليهما وأكثر ما يدخل من كداء أقربهما إلى منزله‏.‏ قال أبو عبد الله كداء وكدا موضعان‏.‏",
      "text_en": " Narrated Hisham from his father:                     In the year of the conquest of Mecca, the Prophet entered Mecca from the side of Kada. `Urwa used to enter through both places and he often entered through Kada' which was nearer of the two to his dwelling place.",
      "chain": [
        "20040",
        "20299",
        "11065"
      ]
    },
    {
      "hadith_no": "1737",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا سهل بن بكار، حدثنا وهيب، عن أيوب، عن أبي قلابة، عن أنس  وذكر الحديث  قال ونحر النبي صلى الله عليه وسلم بيده سبع بدن قياما، وضحى بالمدينة كبشين أملحين أقرنين‏.‏ مختصرا‏.‏",
      "text_en": " Narrated Sahl bin Bakkar:                     The narration of Anas abridged, saying, \"The Prophet slaughtered seven Budn (camels) while standing, with his own hands. On the day of `Id-ul-Adha he slaughtered (sacrificed) two horned rams, black and white in color.",
      "chain": [
        "30138",
        "20299",
        "11015",
        "11047"
      ]
    },
    {
      "hadith_no": "1739",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا سهل بن بكار، حدثنا وهيب، عن أيوب، عن أبي قلابة، عن أنس  رضى الله عنه  قال صلى النبي صلى الله عليه وسلم الظهر بالمدينة أربعا، والعصر بذي الحليفة ركعتين، فبات بها، فلما أصبح ركب راحلته، فجعل يهلل ويسبح، فلما علا على البيداء لبى بهما جميعا، فلما دخل مكة أمرهم أن يحلوا‏.‏ ونحر النبي صلى الله عليه وسلم بيده سبع بدن قياما، وضحى بالمدينة كبشين أملحين أقرنين‏.‏",
      "text_en": " Narrated Anas:                     The Prophet offered four rak`at of Zuhr prayer at Medina; and two rak`at of `Asr prayer at Dhil- Hulaifa and spent the night there and when (the day) dawned, he mounted his Mount and started saying, \"None has the right to be worshipped but Allah, and Glorified be Allah.\" When he reached Al- Baida' he recited Talbiya for both Hajj and `Umra. And when he arrived at Mecca, he ordered them (his companions) to finish their Ihram. The Prophet slaughtered seven Budn (camel) with his own hands while the camels were standing He also sacrificed two horned rams (black and white in color) at Medina.",
      "chain": [
        "30138",
        "20299",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "1761",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن ابن عباس  رضى الله عنهما  أن النبي صلى الله عليه وسلم قيل له في الذبح والحلق والرمى والتقديم والتأخير فقال ‏\"‏ لا حرج ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet was asked about the slaughtering, shaving (of the head), and the doing of Rami before or after the due times. He said, \"There is no harm in that.\"",
      "chain": [
        "20040",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1787",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا مسلم، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن ابن عباس  رضى الله عنهما  قال رخص للحائض أن تنفر إذا أفاضت‏.‏   قال وسمعت ابن عمر، يقول إنها لا تنفر‏.‏ ثم سمعته يقول بعد إن النبي صلى الله عليه وسلم رخص لهن‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A menstruating woman was allowed to leave Mecca if she had done Tawaf-al-Ifada. Tawus (a subnarrator) said from his father, \"I heard Ibn `Umar saying that she would not depart. Then later I heard him saying that the Prophet had allowed them (menstruating women) to depart.\"",
      "chain": [
        "20285",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1876",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا مسلم، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن ابن عباس  رضى الله عنهما  أن النبي صلى الله عليه وسلم وقت لأهل المدينة ذا الحليفة، ولأهل نجد قرن المنازل، ولأهل اليمن يلملم، هن لهن ولكل آت أتى عليهن من غيرهم ممن أراد الحج والعمرة، فمن كان دون ذلك فمن حيث أنشأ، حتى أهل مكة من مكة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet fixed Dhul-Hulaifa as the Miqat (the place for assuming Ihram) for the people of Medina, and Qaran-al-Manazil for the people of Najd, and Yalamlam for the people of Yemen. These Mawaqit are for those people and also for those who come through these Mawaqit (from places other than the above-mentioned) with the intention of (performing) Hajj and Umra. And those living inside these Mawaqit can assume Ihram from the place where they start; even the people of Mecca can assume Ihram from Mecca.",
      "chain": [
        "20285",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "1938",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا معلى بن أسد، حدثنا وهيب، عن أيوب، عن عكرمة، عن ابن عباس  رضى الله عنهما  أن النبي صلى الله عليه وسلم احتجم، وهو محرم واحتجم وهو صائم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet was cupped while he was in the state of lhram, and also while he was observing a fast.",
      "chain": [
        "30457",
        "20299",
        "11015",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1991",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا عمرو بن يحيى، عن أبيه، عن أبي سعيد  رضى الله عنه  قال نهى النبي صلى الله عليه وسلم عن صوم يوم الفطر والنحر، وعن الصماء، وأن يحتبي الرجل في ثوب واحد‏.‏ وعن صلاة، بعد الصبح والعصر‏.‏",
      "text_en": " Narrated Abu Sa`id:                     The Prophet forbade the fasting of `Id-ul-Fitr and `Id-ul-Adha (two feast days) and also the wearing of As-Samma' (a single garment covering the whole body), and sitting with one's leg drawn up while being wrapped in one garment. He also forbade the prayers after the Fajr (morning) and the `Asr (afternoon) prayers.",
      "chain": [
        "20040",
        "20299",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "2021",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Night of Qadr - كتاب فضل ليلة القدر",
      "chapter_no": "32",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا أيوب، عن عكرمة، عن ابن عباس  رضى الله عنهما  أن النبي صلى الله عليه وسلم قال ‏\"‏ التمسوها في العشر الأواخر من رمضان ليلة القدر في تاسعة تبقى، في سابعة تبقى، في خامسة تبقى ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"Look for the Night of Qadr in the last ten nights of Ramadan ,' on the night when nine or seven or five nights remain out of the last ten nights of Ramadan (i.e. 21, 23, 25, respectively).",
      "chain": [
        "20040",
        "20299",
        "11015",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2129",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا موسى، حدثنا وهيب، حدثنا عمرو بن يحيى، عن عباد بن تميم الأنصاري، عن عبد الله بن زيد  رضى الله عنه  عن النبي صلى الله عليه وسلم ‏\"‏ أن إبراهيم حرم مكة، ودعا لها، وحرمت المدينة كما حرم إبراهيم مكة، ودعوت لها في مدها وصاعها، مثل ما دعا إبراهيم  عليه السلام  لمكة ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Zaid:                     The Prophet said, \"The Prophet Abraham made Mecca a sanctuary, and asked for Allah's blessing in it. I made Medina a sanctuary as Abraham made Mecca a sanctuary and I asked for Allah's Blessing in its measures the Mudd and the Sa as Abraham did for Mecca.",
      "chain": [
        "20040",
        "20299",
        "11210",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "2132",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، عن ابن طاوس، عن أبيه، عن ابن عباس  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم نهى أن يبيع الرجل طعاما حتى يستوفيه‏.‏ قلت لابن عباس كيف ذاك قال ذاك دراهم بدراهم والطعام مرجأ‏.‏   قال أبو عبد الله  مرجئون  مؤخرون",
      "text_en": " Narrated Tawus:                     Ibn `Abbas said, \"Allah's Apostle forbade the selling of foodstuff before its measuring and transferring into one's possession.\" I asked Ibn `Abbas, \"How is that?\" Ibn `Abbas replied, \"It will be just like selling money for money, as the foodstuff has not been handed over to the first purchaser who is the present seller.\"",
      "chain": [
        "20040",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2278",
      "source": " Sahih Bukhari ",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن ابن عباس  رضى الله عنهما  قال احتجم النبي صلى الله عليه وسلم، وأعطى الحجام أجره‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When the Prophet was cupped, he paid the man who cupped him his wages.",
      "chain": [
        "20040",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2373",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا معلى بن أسد، حدثنا وهيب، عن هشام، عن أبيه، عن الزبير بن العوام  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ لأن يأخذ أحدكم أحبلا، فيأخذ حزمة من حطب فيبيع، فيكف الله به وجهه، خير من أن يسأل الناس أعطي أم منع ‏\"‏‏.‏",
      "text_en": " Narrated Az-Zubair bin Al 'Awwam:                     The Prophet said, \"No doubt, one had better take a rope (and cut) and tie a bundle of wood and sell it whereby Allah will keep his face away (from Hell-fire) rather than ask others who may give him or not.\"",
      "chain": [
        "30457",
        "20299",
        "11065",
        "10511",
        "7"
      ]
    },
    {
      "hadith_no": "2412",
      "source": " Sahih Bukhari ",
      "chapter": "Khusoomaat - كتاب الخصومات",
      "chapter_no": "44",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا عمرو بن يحيى، عن أبيه، عن أبي سعيد الخدري  رضى الله عنه  قال بينما رسول الله صلى الله عليه وسلم جالس جاء يهودي، فقال يا أبا القاسم ضرب وجهي رجل من أصحابك‏.‏ فقال ‏\"‏ من ‏\"‏‏.‏ قال رجل من الأنصار‏.‏ قال ‏\"‏ ادعوه ‏\"‏‏.‏ فقال ‏\"‏ أضربته ‏\"‏‏.‏ قال سمعته بالسوق يحلف والذي اصطفى موسى على البشر‏.‏ قلت أى خبيث، على محمد صلى الله عليه وسلم فأخذتني غضبة ضربت وجهه‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا تخيروا بين الأنبياء، فإن الناس يصعقون يوم القيامة، فأكون أول من تنشق عنه الأرض، فإذا أنا بموسى آخذ بقائمة من قوائم العرش، فلا أدري أكان فيمن صعق، أم حوسب بصعقة الأولى ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     While Allah's Apostle was sitting, a Jew came and said, \"O Abul Qasim! One of your companions has slapped me on my face.\" The Prophet asked who that was. He replied that he was one of the Ansar. The Prophet sent for him, and on his arrival, he asked him whether he had beaten the Jew. He (replied in the affirmative and) said, \"I heard him taking an oath in the market saying, 'By Him Who gave Moses superiority over all the human beings.' I said, 'O wicked man! (Has Allah given Moses superiority) even over Muhammad I became furious and slapped him over his face.\" The Prophet said, \"Do not give a prophet superiority over another, for on the Day of Resurrection all the people will fall unconscious and I will be the first to emerge from the earth, and will see Moses standing and holding one of the legs of the Throne. I will not know whether Moses has fallen unconscious or the first unconsciousness was sufficient for him.\"",
      "chain": [
        "20040",
        "20299",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "2589",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن ابن عباس  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم ‏\"‏ العائد في هبته كالكلب يقيء، ثم يعود في قيئه ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"One who takes back his gift (which he has already given) is like a dog that swallows its vomit.\"",
      "chain": [
        "20285",
        "20299",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2792",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا معلى بن أسد، حدثنا وهيب، حدثنا حميد، عن أنس بن مالك  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ لغدوة في سبيل الله أو روحة خير من الدنيا وما فيها ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"A single endeavor (of fighting) in Allah's Cause in the forenoon or in the afternoon is better than the world and whatever is in it.\"",
      "chain": [
        "30457",
        "20299",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "2917",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ مثل البخيل والمتصدق مثل رجلين عليهما جبتان من حديد، قد اضطرت أيديهما إلى تراقيهما، فكلما هم المتصدق بصدقته اتسعت عليه حتى تعفي أثره، وكلما هم البخيل بالصدقة انقبضت كل حلقة إلى صاحبتها وتقلصت عليه وانضمت يداه إلى تراقيه ‏\"‏‏.‏ فسمع النبي صلى الله عليه وسلم يقول ‏\"‏ فيجتهد أن يوسعها فلا تتسع ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The example of a miser and the one who gives in charity, is like the example of two men wearing iron cloaks so tightly that their arms are raised forcibly towards their collar-bones. So, whenever a charitable person wants to give in charity, his cloak spreads over his body so much so that it wipes out his traces, but whenever the miser wants to give in charity, the rings (of the iron cloak) come closer to each other and press over his body, and his hands gets connected to his collarbones. Abu Huraira heard the Prophet saying. \"The miser then tries to widen it but in vain.\"",
      "chain": [
        "20040",
        "20299",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "2959",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا عمرو بن يحيى، عن عباد بن تميم، عن عبد الله بن زيد  رضى الله عنه  قال لما كان زمن الحرة أتاه آت فقال له إن ابن حنظلة يبايع الناس على الموت‏.‏ فقال لا أبايع على هذا أحدا بعد رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Abdullah bin Zaid:                     that in the time (of the battle) of Al-Harra a person came to him and said, \"Ibn Hanzala is taking the pledge of allegiance from the people for death.\" He said, \"I will never give a pledge of allegiance for such a thing to anyone after Allah's Apostle.\"",
      "chain": [
        "20040",
        "20299",
        "11210",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "3018",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا معلى بن أسد، حدثنا وهيب، عن أيوب، عن أبي قلابة، عن أنس بن مالك  رضى الله عنه  أن رهطا، من عكل ثمانية قدموا على النبي صلى الله عليه وسلم فاجتووا المدينة فقالوا يا رسول الله، ابغنا رسلا‏.‏ قال ‏\"‏ ما أجد لكم إلا أن تلحقوا بالذود ‏\"‏‏.‏ فانطلقوا فشربوا من أبوالها وألبانها حتى صحوا وسمنوا، وقتلوا الراعي، واستاقوا الذود، وكفروا بعد إسلامهم، فأتى الصريخ النبي صلى الله عليه وسلم، فبعث الطلب، فما ترجل النهار حتى أتي بهم، فقطع أيديهم وأرجلهم، ثم أمر بمسامير فأحميت فكحلهم بها، وطرحهم بالحرة، يستسقون فما يسقون حتى ماتوا‏.‏ قال أبو قلابة قتلوا وسرقوا وحاربوا الله ورسوله صلى الله عليه وسلم وسعوا في الأرض فسادا‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A group of eight men from the tribe of 'Ukil came to the Prophet and then they found the climate of Medina unsuitable for them. So, they said, \"O Allah's Apostle! Provide us with some milk.\" Allah's Apostle said, \"I recommend that you should join the herd of camels.\" So they went and drank the urine and the milk of the camels (as a medicine) till they became healthy and fat. Then they killed the shepherd and drove away the camels, and they became unbelievers after whey were Muslims. When the Prophet was informed by a shouter for help, he sent some men in their pursuit, and before the sun rose high, they were brought, and he had their hands and feet cut off. Then he ordered for nails which were heated and passed over their eyes, and whey were left in the Harra (i.e. rocky land in Medina). They asked for water, and nobody provided them with water till they died (Abu Qilaba, a sub-narrator said, \"They committed murder and theft and fought against Allah and His Apostle, and spread evil in the land.\")",
      "chain": [
        "30457",
        "20299",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "hadith_no": "3161",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا سهل بن بكار، حدثنا وهيب، عن عمرو بن يحيى، عن عباس الساعدي، عن أبي حميد الساعدي، قال غزونا مع النبي صلى الله عليه وسلم تبوك، وأهدى ملك أيلة للنبي صلى الله عليه وسلم بغلة بيضاء، وكساه بردا، وكتب له ببحرهم‏.‏",
      "text_en": " Narrated Abu Humaid As-Saidi:                     We accompanied the Prophet in the Ghazwa of Tabuk and the king of 'Aila presented a white mule and a cloak as a gift to the Prophet. And the Prophet wrote to him a peace treaty allowing him to keep authority over his country.",
      "chain": [
        "30138",
        "20299",
        "11210",
        "1457"
      ]
    },
    {
      "hadith_no": "3305",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، عن خالد، عن محمد، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ فقدت أمة من بني إسرائيل لا يدرى ما فعلت، وإني لا أراها إلا الفار إذا وضع لها ألبان الإبل لم تشرب، وإذا وضع لها ألبان الشاء شربت ‏\"‏‏.‏ فحدثت كعبا فقال أنت سمعت النبي صلى الله عليه وسلم يقوله قلت نعم‏.‏ قال لي مرارا‏.‏ فقلت أفأقرأ التوراة",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"A group of Israelites were lost. Nobody knows what they did. But I do not see them except that they were cursed and changed into rats, for if you put the milk of a she-camel in front of a rat, it will not drink it, but if the milk of a sheep is put in front of it, it will drink it.\" I told this to Ka`b who asked me, \"Did you hear it from the Prophet ?\" I said, \"Yes.\" Ka`b asked me the same question several times.; I said to Ka`b. \"Do I read the Torah? (i.e. I tell you this from the Prophet.)\"",
      "chain": [
        "20040",
        "20299",
        "11282",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "3347",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا وهيب، حدثنا ابن طاوس، عن أبيه، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ فتح الله من ردم يأجوج ومأجوج مثل هذا ‏\"‏‏.‏ وعقد بيده تسعين‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Allah has made an opening in the wall of the Gog and Magog (people) like this, and he made with his hand (with the help of his fingers).",
      "chain": [
        "20285",
        "20299",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "3422",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، حدثنا أيوب، عن عكرمة، عن ابن عباس  رضى الله عنهما  قال ليس ‏{‏ص‏}‏ من عزائم السجود، ورأيت النبي صلى الله عليه وسلم يسجد فيها‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The prostration in Sura-Sa`d is not amongst the compulsory prostrations, though I saw the Prophet prostrating on reciting it.",
      "chain": [
        "20040",
        "20299",
        "11015",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3486",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا وهيب، قال حدثني ابن طاوس، عن أبيه، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ نحن الآخرون السابقون يوم القيامة، بيد كل أمة أوتوا الكتاب من قبلنا وأوتينا من بعدهم، فهذا اليوم الذي اختلفوا، فغدا لليهود وبعد غد للنصارى ‏\"‏‏.‏   ‏\"‏على كل مسلم فى كل سبعة أيام يوم يغسل رأسه وجسده‏\"‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"We are the last (to come) but we will be the foremost on the Day of Resurrection, nations were given the Book (i.e. Scripture) before us, and we were given the Holy Book after them. This (i.e. Friday) is the day about which they differed. So the next day (i.e. Saturday) was prescribed for the Jews and the day after it (i.e. Sunday) for the Christians. It is incumbent on every Muslim to wash his head and body on a Day (i.e. Friday) (at least) in every seven days.\"",
      "chain": [
        "20040",
        "20299",
        "11433",
        "11053",
        "13"
      ]
    }
  ],
  "total_hadiths": 226
}