{
  "id": "20298",
  "name": "Wahb bin Jarir bin Hazim bin Zayd وهب بن جرير بن حازم بن زيد",
  "full_name": "Wahb bin Jarir bin Hazim bin Zayd وهب بن جرير بن حازم بن زيد",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "206",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Azdi",
      "al-Basri",
      "Hafiz"
    ]
  },
  "parents": [
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10704",
      "name": "'Ikrama bin 'Ammar عكرمة بن عمار العجلي أبو عمار اليمامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11311",
      "name": "Hisham bin Hassan al-Azdi هشام بن حسان الأزدي القردوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11071",
      "name": "'Abdullah bin 'Awn bin Artaban عبد الله بن عون بن أرطبان الخزار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20295",
      "name": "Hisham bin Abi 'Abdullah al-Dastawa'i هشام بن أبي عبد الله الدستوائي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20429",
      "name": "Skhr bin Jwyryh Abu صخر بن جويرية أبو نافع مولى بني",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20628",
      "name": "Musa bin 'Ali bin Rabah موسى بن علي بن رباح",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11301",
      "name": "Qurrah bin Khalid al-Sadusi قرة بن خالد السدوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20550",
      "name": "Salam bin Abi Mut'ia سلام بن أبي مطيع",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "10669",
      "name": "al-Aswad bin Shayban al-Sadusi الأسود بن شيبان السدوسي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30351",
      "name": "'Abdullah bin Muhammad al-Musandi عبد الله بن محمد المسندي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30524",
      "name": "Harun bin 'Abdullah al-Hamal هارون بن عبد الله بن مروان الحمال",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30295",
      "name": "Ahmed bin Sa'id bin Ibrahim أحمد بن سعيد بن إبراهيم الرباطي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30153",
      "name": "'Amr bin 'Ali bin Bahr al-Bahli عمرو بن علي بن بحر الباهلي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30146",
      "name": "'Abdul A'ala bin Hamad bin Nasr al-Bahli عبد الأعلى بن حماد بن نصر الباهلي النرسي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30161",
      "name": "Muhammad bin Abi Bakr bin 'Ali محمد بن أبي بكر بن علي بن عطاء المقدمي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30115",
      "name": "al-Hasan bin 'Ali al-Halwani الحسن بن علي الخلال الحلواني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30277",
      "name": "Mahmud bin Ghaylan محمود بن غيلان العدوي مولاهم أبو أحمد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30375",
      "name": "Muhammad bin Rafa'i محمد بن رافع",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30359",
      "name": "'Ubaidullah bin Sa'id عبيد الله بن سعيد أبو قدامة السرخسي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20720",
      "name": "Nasr bin 'Ali bin Asbahan نصر بن علي الجهضمي الكبير",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30160",
      "name": "Muhammad bin Bashar Bindar محمد بن بشار بندار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30441",
      "name": "'Uqba bin Mukaram bin Aflah al-''Ami عقبة بن مكرم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38388",
      "name": "'Ali bin Harb bin Muhammad علي بن حرب بن محمد بن علي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38088",
      "name": "Ibrahim bin Y'aqub bin Ishaq إبراهيم بن يعقوب بن إسحاق",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "467",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن محمد الجعفي، قال حدثنا وهب بن جرير، قال حدثنا أبي قال، سمعت يعلى بن حكيم، عن عكرمة، عن ابن عباس، قال خرج رسول الله صلى الله عليه وسلم في مرضه الذي مات فيه عاصب رأسه بخرقة، فقعد على المنبر، فحمد الله وأثنى عليه ثم قال ‏\"‏ إنه ليس من الناس أحد أمن على في نفسه وماله من أبي بكر بن أبي قحافة، ولو كنت متخذا من الناس خليلا لاتخذت أبا بكر خليلا، ولكن خلة الإسلام أفضل، سدوا عني كل خوخة في هذا المسجد غير خوخة أبي بكر ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     \"Allah's Apostle in his fatal illness came out with a piece of cloth tied round his head and sat on the pulpit. After thanking and praising Allah he said, \"There is no one who had done more favor to me with life and property than Abu Bakr bin Abi Quhafa. If I were to take a Khalil, I would certainly have taken Abu- Bakr but the Islamic brotherhood is superior. Close all the small doors in this mosque except that of Abu Bakr.\"",
      "chain": [
        "30351",
        "20298",
        "11272",
        "11567",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "613",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق بن راهويه، قال حدثنا وهب بن جرير، قال حدثنا هشام، عن يحيى، نحوه‏.‏ قال يحيى وحدثني بعض، إخواننا أنه قال لما قال حى على الصلاة‏.‏ قال لا حول ولا قوة إلا بالله‏.‏ وقال هكذا سمعنا نبيكم صلى الله عليه وسلم يقول‏.‏",
      "text_en": " Narrated Yahya as above (586) and added:                     \"Some of my companions told me that Hisham had said, \"When the Mu'adh-dhin said, \"Haiyi `alassala (come for the prayer).\" Muawiya said, \"La hawla wala quwata illa billah (There is neither might nor any power except with Allah)\" and added, \"We heard your Prophet saying the same.\"",
      "chain": [
        "30021",
        "20298",
        "20295",
        "11449"
      ]
    },
    {
      "hadith_no": "1011",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا إسحاق، قال حدثنا وهب، قال أخبرنا شعبة، عن محمد بن أبي بكر، عن عباد بن تميم، عن عبد الله بن زيد، أن النبي صلى الله عليه وسلم استسقى فقلب رداءه‏.‏",
      "text_en": " Narrated `Abdullah bin Zaid:                     The Prophet turned his cloak inside out on Istisqa.",
      "chain": [
        "30312",
        "20298",
        "20020",
        "11214",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "1568",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا وهب بن جرير، حدثنا أبي، عن يونس الأيلي، عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس  رضى الله عنهما  أن أسامة  رضى الله عنه  كان ردف النبي صلى الله عليه وسلم من عرفة إلى المزدلفة، ثم أردف الفضل من المزدلفة إلى منى‏.‏ قال فكلاهما قال لم يزل النبي صلى الله عليه وسلم يلبي، حتى رمى جمرة العقبة‏.‏",
      "text_en": " Narrated 'Ubaidullah bin `Abdullah:                     Ibn `Abbas' said, \"Usama rode behind Allah's Apostle from `Arafat to Al-Muzdalifa; and then Al-Fadl rode behind Allah's Apostle from Al-Muzdalifa to Mina.\" Ibn `Abbas added, \"Both of them said, 'The Prophet kept on reciting Talbiya till he did the Rami of Jamrat-Al-`Aqaba.' \"",
      "chain": [
        "30351",
        "20298",
        "11272",
        "20475",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "1712",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا زهير بن حرب، حدثنا وهب بن جرير، حدثنا أبي، عن يونس الأيلي، عن الزهري، عن عبيد الله بن عبد الله، عن ابن عباس  رضى الله عنهما  أن أسامة بن زيد  رضى الله عنهما  كان ردف النبي صلى الله عليه وسلم من عرفة إلى المزدلفة، ثم أردف الفضل من المزدلفة إلى منى  قال  فكلاهما قالا لم يزل النبي صلى الله عليه وسلم يلبي حتى رمى جمرة العقبة‏.‏",
      "text_en": " Narrated 'Ubaidullah bin `Abdullah:                     Ibn `Abbas said, \"Usama bin Zaid rode behind the Prophet from `Arafat to Al-Muzdalifa; and then from Al-Muzdalifa to Mina, Al-Fadl rode behind him.\" He added, \"Both of them (Usama and Al-Fadl) said, 'The Prophet was constantly reciting Talbiya till he did Rami of the Jamarat-Al-`Aqaba.\"",
      "chain": [
        "30022",
        "20298",
        "11272",
        "20475",
        "11013",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "1918",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا وهب بن جرير، حدثنا أبي، سمعت يونس، عن ابن شهاب، عن أنس  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ اللهم اجعل بالمدينة ضعفى ما جعلت بمكة من البركة ‏\"‏‏.‏ تابعه عثمان بن عمر عن يونس‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"O Allah! Bestow on Medina twice the blessings You bestowed on Mecca.\"",
      "chain": [
        "30351",
        "20298",
        "11272",
        "20475",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "2425",
      "source": " Sahih Bukhari ",
      "chapter": "Khusoomaat - كتاب الخصومات",
      "chapter_no": "44",
      "text_ar": "حدثنا إسحاق، حدثنا وهب بن جرير بن حازم، أخبرنا شعبة، عن الأعمش، عن أبي الضحى، عن مسروق، عن خباب، قال كنت قينا في الجاهلية وكان لي على العاص بن وائل دراهم، فأتيته أتقاضاه فقال لا أقضيك حتى تكفر بمحمد، فقلت لا والله لا أكفر بمحمد صلى الله عليه وسلم حتى يميتك الله ثم يبعثك‏.‏ قال فدعني حتى أموت ثم أبعث فأوتى مالا وولدا، ثم أقضيك‏.‏ فنزلت ‏{‏أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا‏}‏ الآية‏.‏",
      "text_en": " Narrated Khabbab:                     I was a blacksmith In the Pre-Islamic period of ignorance, and 'Asi bin Wail owed me some money. I went to him to demand it, but he said to me, \"I will not pay you unless you reject faith in Muhammad.\" I replied, \"By Allah, I will never disbelieve Muhammad till Allah let you die and then resurrect you.\" He said, \"Then wait till I die and come to life again, for then I will be given property and offspring and will pay your right.\" So, thus revelation came: \"Have you seen him who disbelieved in Our signs and yet says, 'I will be given property and offspring?' \" (19.77)",
      "chain": [
        "30021",
        "20298",
        "20020",
        "11060",
        "11392",
        "11018",
        "149"
      ]
    },
    {
      "hadith_no": "2653",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا عبد الله بن منير، سمع وهب بن جرير، وعبد الملك بن إبراهيم، قالا حدثنا شعبة، عن عبيد الله بن أبي بكر بن أنس، عن أنس  رضى الله عنه  قال سئل النبي صلى الله عليه وسلم عن الكبائر قال ‏\"‏ الإشراك بالله، وعقوق الوالدين، وقتل النفس، وشهادة الزور ‏\"‏‏.‏ تابعه غندر وأبو عامر وبهز وعبد الصمد عن شعبة‏.‏",
      "text_en": " Narrated Anas:                     The Prophet was asked about the great sins He said, \"They are:-- (1 ) To join others in worship with Allah, (2) To be undutiful to one's parents. (3) To kill a person (which Allah has forbidden to kill) (i.e. to commit the crime of murdering). (4) And to give a false witness.\"",
      "chain": [
        "30353",
        "20298",
        "20020",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "3214",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "وحدثنا إسحاق، أخبرنا وهب بن جرير، حدثنا أبي قال، سمعت حميد بن هلال، عن أنس بن مالك  رضى الله عنه  قال كأني أنظر إلى غبار ساطع في سكة بني غنم‏.‏ زاد موسى موكب جبريل‏.‏",
      "text_en": " Narrated Jarir:                     as below.Narrated Humaid bin Hilal:Anas bin Malik said, \"As if I say a cloud of dust swirling up in the lane of Bani Ghanim.\" Musa added, \"That was caused by the procession of Gabriel.\"",
      "chain": [
        "30021",
        "20298",
        "11272",
        "11281",
        "19"
      ]
    },
    {
      "hadith_no": "3381",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني عبد الله، حدثنا وهب، حدثنا أبي، سمعت يونس، عن الزهري، عن سالم، أن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تدخلوا مساكن الذين ظلموا أنفسهم إلا أن تكونوا باكين، أن يصيبكم مثل ما أصابهم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"Do not enter the ruined dwellings of those who were unjust to themselves unless (you enter) weeping, lest you should suffer the same punishment as was inflicted upon them.\"",
      "chain": [
        "20025",
        "20298",
        "11272",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "3362",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني أحمد بن سعيد أبو عبد الله، حدثنا وهب بن جرير، عن أبيه، عن أيوب، عن عبد الله بن سعيد بن جبير، عن أبيه، عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ يرحم الله أم إسماعيل، لولا أنها عجلت لكان زمزم عينا معينا ‏\"‏‏.‏   قال الأنصاري حدثنا ابن جريج، أما كثير بن كثير فحدثني قال إني وعثمان بن أبي سليمان جلوس مع سعيد بن جبير، فقال ما هكذا حدثني ابن عباس، قال أقبل إبراهيم بإسماعيل وأمه عليهم السلام وهى ترضعه، معها شنة  لم يرفعه  ثم جاء بها إبراهيم وبابنها إسماعيل‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"May Allah bestow His Mercy on the mother of Ishmael! Had she not hastened (to fill her water-skin with water from the Zamzam well). Zamzam would have been a stream flowing on the surface of the earth.\" Ibn `Abbas further added, \"(The Prophet) Abraham brought Ishmael and his mother (to Mecca) and she was suckling Ishmael and she had a water-skin with her.'",
      "chain": [
        "30296",
        "20298",
        "11272",
        "11015",
        "11635",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3720",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني أحمد بن سعيد أبو عبد الله، حدثنا وهب بن جرير، حدثنا صخر، عن نافع، أن عبد الله بن عمر  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ بينما أنا على بئر أنزع منها جاءني أبو بكر وعمر، فأخذ أبو بكر الدلو، فنزع ذنوبا أو ذنوبين وفي نزعه ضعف، والله يغفر له، ثم أخذها ابن الخطاب من يد أبي بكر، فاستحالت في يده غربا، فلم أر عبقريا من الناس يفري فريه، فنزع حتى ضرب الناس بعطن ‏\"‏‏.‏ قال وهب العطن مبرك الإبل، يقول حتى رويت الإبل فأناخت‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle said. \"While (in a dream), I was standing by a well, drawing water from it. Abu Bakr and `Umar came to me. Abu Bakr took the bucket (from me) and drew one or two buckets of water, and there was some weakness in his drawing. May Allah forgive him. Then Ibn Al-Khattab took the bucket from Abu Bakr, and the bucket turned into a very large one in his hands. I had never seen such a mighty person amongst the people as him in performing such hard work. He drew so much water that the people drank to their satisfaction and watered their camels.\" (Wahab, a sub-narrator said, \"till their camels drank and knelt down.\")",
      "chain": [
        "30296",
        "20298",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3997",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا وهب، حدثنا شعبة، عن أبي إسحاق، كنت إلى جنب زيد بن أرقم، فقيل له كم غزا النبي صلى الله عليه وسلم من غزوة قال تسع عشرة‏.‏ قيل كم غزوت أنت معه قال سبع عشرة‏.‏ قلت فأيهم كانت أول قال العسيرة أو العشير‏.‏ فذكرت لقتادة فقال العشير‏.‏",
      "text_en": " Narrated Abu 'Is-haq:                     Once, while I was sitting beside Zaid bin Al-Arqam, he was asked, \"How many Ghazwat did the Prophet undertake?\" Zaid replied, \"Nineteen.\" They said, \"In how many Ghazwat did you join him?\" He replied, \"Seventeen.\" I asked, \"Which of these was the first?\" He replied, \"Al-`Ashira or Al- `Ashiru.\"",
      "chain": [
        "30351",
        "20298",
        "20020"
      ]
    },
    {
      "hadith_no": "4004",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمود، حدثنا وهب، عن شعبة، عن أبي إسحاق، عن البراء، قال استصغرت أنا وابن عمر يوم بدر، وكان المهاجرون يوم بدر نيفا على ستين، والأنصار نيفا وأربعين ومائتين‏.‏",
      "text_en": " Narrated Al-Bara:                     I and Ibn `Umar were considered too young (to take part) in the battle of Badr, and the number of the Emigrant warriors were over sixty (men) and the Ansar were over 249.",
      "chain": [
        "30277",
        "20298",
        "20020",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "4263",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أبو الوليد، حدثنا شعبة‏.‏ وحدثني عبد الله بن محمد، حدثنا وهب، حدثنا شعبة، عن حميد بن هلال، عن عبد الله بن مغفل  رضى الله عنه  قال كنا محاصري خيبر فرمى إنسان بجراب فيه شحم، فنزوت لآخذه، فالتفت فإذا النبي صلى الله عليه وسلم، فاستحييت‏.‏",
      "text_en": " Narrated `Abdullah bin Mughaffal:                     While we were besieging Khaibar, a person threw a leather container containing some fat and I ran to take it. Suddenly I looked behind, and behold! The Prophet was there. So I felt shy (to take it then).",
      "chain": [
        "20296",
        "30351",
        "20298",
        "20020",
        "11281",
        "3242"
      ]
    },
    {
      "hadith_no": "4430",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبد الله بن محمد الجعفي، حدثنا وهب بن جرير، حدثنا شعبة، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن أبي مسعود، أن النبي صلى الله عليه وسلم قال ‏\"‏ الإيمان ها هنا ‏\"‏‏.‏ وأشار بيده إلى اليمن ‏\"‏ والجفاء وغلظ القلوب في الفدادين، عند أصول أذناب الإبل من حيث يطلع قرنا الشيطان ربيعة ومضر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Masud:                     The Prophet beckoned with his hand towards Yemen and said, \"Belief is there.\" The harshness and mercilessness are the qualities of those farmers etc, who are busy with their camels and pay no attention to the religion (is towards the east) from where the side of the head of Satan will appear; those are the tribes of Rabi`a and Mudar.",
      "chain": [
        "30351",
        "20298",
        "20020",
        "11418",
        "11046",
        "402"
      ]
    },
    {
      "hadith_no": "4942",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا وهب بن جرير، قال حدثنا أبي قال، سمعت الزبير، عن عكرمة، عن ابن عباس، في قوله تعالى ‏{‏ولا يعصينك في معروف‏}‏ قال إنما هو شرط شرطه الله للنساء‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Regarding the saying of Allah: 'And they will not disobey you in any just matter.' (60.12) That was one of the conditions which Allah imposed on The believing) women (who came to take the oath of allegiance to the Prophet).",
      "chain": [
        "30351",
        "20298",
        "11272",
        "7",
        "11023"
      ]
    },
    {
      "hadith_no": "5058",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثني محمد بن المثنى، حدثنا وهب، حدثنا هشام، عن محمد، عن معبد، عن أبي سعيد الخدري، قال كنا في مسير لنا فنزلنا فجاءت جارية فقالت إن سيد الحى سليم، وإن نفرنا غيب فهل منكم راق فقام معها رجل ما كنا نأبنه برقية فرقاه فبرأ فأمر له بثلاثين شاة وسقانا لبنا فلما رجع قلنا له أكنت تحسن رقية أو كنت ترقي قال لا ما رقيت إلا بأم الكتاب‏.‏ قلنا لا تحدثوا شيئا حتى نأتي  أو نسأل  النبي صلى الله عليه وسلم فلما قدمنا المدينة ذكرناه للنبي صلى الله عليه وسلم فقال ‏\"‏ وما كان يدريه أنها رقية اقسموا واضربوا لي بسهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     While we were on one of our journeys, we dismounted at a place where a slave girl came and said, \"The chief of this tribe has been stung by a scorpion and our men are not present; is there anybody among you who can treat him (by reciting something)?\" Then one of our men went along with her though we did not think that he knew any such treatment. But he treated the chief by reciting something, and the sick man recovered whereupon he gave him thirty sheep and gave us milk to drink (as a reward). When he returned, we asked our friend, \"Did you know how to treat with the recitation of something?\" He said, \"No, but I treated him only with the recitation of the Mother of the Book (i.e., Al-Fatiha).\" We said, \"Do not say anything (about it) till we reach or ask the Prophet so when we reached Medina, we mentioned that to the Prophet (in order to know whether the sheep which we had taken were lawful to take or not). The Prophet said, \"How did he come to know that it (Al-Fatiha) could be used for treatment? Distribute your reward and assign for me one share thereof as well.\"",
      "chain": [
        "30170",
        "20298",
        "20295",
        "20278",
        "38"
      ]
    },
    {
      "hadith_no": "5467",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا وهب بن جرير، حدثنا شعبة، عن إسماعيل، عن قيس، عن سعد، قال رأيتني سابع سبعة مع النبي صلى الله عليه وسلم ما لنا طعام إلا ورق الحبلة  أو الحبلة  حتى يضع أحدنا ما تضع الشاة، ثم أصبحت بنو أسد تعزرني على الإسلام، خسرت إذا وضل سعيي‏.‏",
      "text_en": " Narrated Sa`d:                     I was one of (the first) seven (who had embraced Islam) with Allah's Apostle and we had nothing to eat then, except the leaves of the Habala or Hubula tree, so that our stool used to be similar to that of sheep. Now the tribe of Bani Asad wants to teach me Islam; I would be a loser and all my efforts would be in vain (if I learn Islam anew from them).",
      "chain": [
        "30351",
        "20298",
        "20020",
        "20208",
        "11046",
        "9"
      ]
    },
    {
      "hadith_no": "5850",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا وهب بن جرير، أخبرنا أبي، عن عمه، جرير بن زيد قال كنت مع سالم بن عبد الله بن عمر على باب داره فقال سمعت أبا هريرة، سمع النبي صلى الله عليه وسلم نحوه‏.‏",
      "text_en": " Narrated Abu Huraira:                     that he heard the Prophet (narrating as above No. 680).",
      "chain": [
        "30351",
        "20298",
        "11272",
        "11678",
        "13"
      ]
    },
    {
      "hadith_no": "5898",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا علي، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت ابن أبي نجيح، عن مجاهد، عن ابن أبي ليلى، عن حذيفة  رضى الله عنه  قال نهانا النبي صلى الله عليه وسلم أن نشرب في آنية الذهب والفضة، وأن نأكل فيها، وعن لبس الحرير والديباج، وأن نجلس عليه‏.‏",
      "text_en": " Narrated Hudhaifa:                     The Prophet forbade us to drink out of gold and silver vessels, or eat in it, Ann also forbade the wearing of silk and Dibaj or sitting on it.",
      "chain": [
        "5",
        "20298",
        "11272",
        "11254",
        "11028",
        "11196",
        "145"
      ]
    },
    {
      "hadith_no": "5966",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني عمرو بن علي، حدثنا وهب بن جرير، قال حدثني أبي، عن قتادة، قال سألت أنس بن مالك  رضى الله عنه  عن شعر، رسول الله صلى الله عليه وسلم فقال كان شعر رسول الله صلى الله عليه وسلم رجلا، ليس بالسبط، ولا الجعد، بين أذنيه وعاتقه‏.‏",
      "text_en": " Narrated Qatada:                     l asked Anas bin Malik about the hair of Allah's Apostle. He said, \"The hair of Allah's Apostle was neither much straight, nor much curly, and it used to hang down till between his shoulders and his earlobes.",
      "chain": [
        "30153",
        "20298",
        "11272",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6583",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني عبد الله بن محمد  هو الجعفي  حدثنا وهب بن جرير، حدثنا شعبة، عن قتادة، وأبي التياح، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ بعثت أنا والساعة كهاتين ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle said, \"I have been sent and the Hour (is at hand) as these two (fingers).",
      "chain": [
        "30351",
        "20298",
        "20020",
        "11019",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "6716",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا وهب، حدثنا شعبة، عن محمد بن أبي يعقوب، عن عبد الرحمن بن أبي بكرة، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ أرأيتم إن كان أسلم وغفار ومزينة وجهينة خيرا من تميم وعامر بن صعصعة وغطفان وأسد، خابوا وخسروا ‏\"‏‏.‏ قالوا نعم‏.‏ فقال ‏\"‏ والذي نفسي بيده إنهم خير منهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     The Prophet said, \"Do you think if the tribes of Aslam, Ghifar, Muzaina and Juhaina are better than the tribes of Tamim, 'Amir bin Sa'sa'a, Ghatfan and Asad, they (the second group) are despairing and losing?\" They (the Prophet's companions) said, \"Yes, (they are).\" He said, \"By Him in Whose Hand my soul is, they (the first group) are better than them (the second group).",
      "chain": [
        "30351",
        "20298",
        "20020",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "6726",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا إسحاق، حدثنا وهب بن جرير، أخبرنا شعبة، عن هشام بن زيد، عن أنس بن مالك، أن امرأة، من الأنصار أتت النبي صلى الله عليه وسلم معها أولاد لها فقال النبي صلى الله عليه وسلم ‏\"‏ والذي نفسي بيده إنكم لأحب الناس إلى ‏\"‏‏.‏ قالها ثلاث مرار‏.‏",
      "text_en": " Narrated Anas bin Malik:                     An Ansari woman came to the Prophet in the company of her children, and the Prophet said to her, \"By Him in Whose Hand my soul is, you are the most beloved people to me!\" And he repeated the statement thrice.",
      "chain": [
        "30021",
        "20298",
        "20020",
        "11228",
        "19"
      ]
    },
    {
      "hadith_no": "6913",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثني عبد الله بن محمد الجعفي، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت يعلى بن حكيم، عن عكرمة، عن ابن عباس  رضى الله عنهما  قال لما أتى ماعز بن مالك النبي صلى الله عليه وسلم قال له ‏\"‏ لعلك قبلت أو غمزت أو نظرت ‏\"‏‏.‏ قال لا يا رسول الله‏.‏ قال ‏\"‏ أنكتها ‏\"‏‏.‏ لا يكني‏.‏ قال فعند ذلك أمر برجمه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When Ma'iz bin Malik came to the Prophet (in order to confess), the Prophet said to him, \"Probably you have only kissed (the lady), or winked, or looked at her?\" He said, \"No, O Allah's Apostle!\" The Prophet said, using no euphemism, \"Did you have sexual intercourse with her?\" The narrator added: At that, (i.e. after his confession) the Prophet ordered that he be stoned (to death).",
      "chain": [
        "30351",
        "20298",
        "11272",
        "11567",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "50",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "حدثني ابن قهزاذ، قال سمعت وهبا، يقول عن سفيان، عن ابن المبارك، قال بقية صدوق اللسان ولكنه يأخذ عمن أقبل وأدبر ‏.‏",
      "text_en": "",
      "chain": [
        "20298",
        "20012",
        "20025"
      ]
    },
    {
      "hadith_no": "322",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا محمد بن أبي بكر المقدمي، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت الحسن، يقول حدثنا جندب بن عبد الله البجلي، في هذا المسجد فما نسينا وما نخشى أن يكون جندب كذب على رسول الله صلى الله عليه وسلم قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خرج برجل فيمن كان قبلكم خراج ‏\"‏ ‏.‏ فذكر نحوه ‏.‏",
      "text_en": " It is reported on the authority of Hasan:                      Jundab b. 'Abdullah al-Bajali narrated this hadith in this mosque which we can neither forget and at the same time we have no apprehension that Jundab could attribute a lie to the Messenger of Allah (may peace be upon him). He (the Holy Prophet) observed: A person belonging to the people of the past suffered from a boil, and then the rest of the hadith was narrated.",
      "chain": [
        "30161",
        "20298",
        "11272",
        "11016"
      ]
    },
    {
      "hadith_no": "348",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن عمرو بن عباد بن جبلة، حدثنا محمد بن أبي عدي، ح وحدثنا محمد بن المثنى، حدثني وهب بن جرير، كلاهما عن شعبة، عن قتادة، بهذا الإسناد مثله غير أن في حديث شعبة ‏\"‏ ثم اجتهد ‏\"‏ ولم يقل ‏\"‏ وإن لم ينزل ‏\"‏ ‏.‏",
      "text_en": " This hadith is narrated by Qatida with the same chain of transmitters, but with minor alterations. Here instead of the word - (jahada, (ijtahada) has been used, and the words;\" Even if there is no orgasm\" have been omitted.",
      "chain": [
        "11220",
        "20276",
        "30170",
        "20298",
        "20020"
      ]
    },
    {
      "hadith_no": "510",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا شيبان بن فروخ، حدثنا سليمان بن المغيرة، ح قال وحدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، ح قال وحدثنا إسحاق بن إبراهيم، أخبرنا وهب بن جرير، حدثنا أبي ح، قال وحدثنا إسحاق، أيضا أخبرنا المعتمر بن سليمان، قال سمعت سلم بن أبي الذيال، ح قال وحدثني يوسف بن حماد المعني، حدثنا زياد البكائي، عن عاصم الأحول، كل هؤلاء عن حميد بن هلال، بإسناد يونس كنحو حديثه ‏.‏",
      "text_en": " This hadith has been transmitted by Humaid b. Hilal on the authority of Yunus.",
      "chain": [
        "20656",
        "20236",
        "30170",
        "30160",
        "20173",
        "20020",
        "30123",
        "20298",
        "11272",
        "20288",
        "30573"
      ]
    },
    {
      "hadith_no": "1837",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني هارون بن عبد الله، ومحمد بن رافع، قالا حدثنا وهب بن جرير، أخبرني أبي قال، سمعت قيس بن سعد، يحدث عن عطاء، عن ابن عباس، قال بعثني العباس إلى النبي صلى الله عليه وسلم وهو في بيت خالتي ميمونة فبت معه تلك الليلة فقام يصلي من الليل فقمت عن يساره فتناولني من خلف ظهره فجعلني على يمينه ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      I spent a night in the house of my mother's sister Maimuna, and the rest of the hadith is the same as narrated above.",
      "chain": [
        "30524",
        "30375",
        "20298",
        "11272",
        "172",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "2257",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، وهارون بن عبد الله، جميعا عن وهب بن جرير، عن شعبة، عن إسماعيل بن أبي خالد، ح وحدثني أبو غسان، محمد بن عمرو الرازي حدثنا يحيى بن الضريس، حدثنا إبراهيم بن طهمان، عن أبي حصين، كلاهما عن الشعبي، عن ابن عباس، عن النبي صلى الله عليه وسلم في صلاته على القبر نحو حديث الشيباني ‏.‏ ليس في حديثهم وكبر أربعا ‏.‏",
      "text_en": " The hadith as narrated by Shaibani has been narrated through another chain of transmitters.",
      "chain": [
        "30123",
        "20298",
        "20020",
        "11418",
        "20678",
        "20187",
        "11052",
        "17"
      ]
    },
    {
      "hadith_no": "2858",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا عقبة بن مكرم العمي، ومحمد بن رافع، - واللفظ لابن رافع - قالا حدثنا وهب بن جرير بن حازم، حدثنا أبي قال، سمعت قيسا، يحدث عن عطاء، عن صفوان بن، يعلى بن أمية عن أبيه، رضى الله عنه أن رجلا، أتى النبي صلى الله عليه وسلم وهو بالجعرانة قد أهل بالعمرة وهو مصفر لحيته ورأسه وعليه جبة فقال يا رسول الله إني أحرمت بعمرة وأنا كما ترى ‏.‏ فقال ‏\"‏ انزع عنك الجبة واغسل عنك الصفرة وما كنت صانعا في حجك فاصنعه في عمرتك ‏\"‏ ‏.‏",
      "text_en": " Ya'la b. Umayya (Allah be pleased with him) reported that a person came to the Apostle of Allah (may peace be upon him) as he was staying at Ji'rana and he had put on Ihram for 'Umra and he had dyed his beard and his head with yellow colour and there was a cloak on him. He said:                      I put on Ihram for 'Umra and I am in this state as you see (with dyed beard and head and a cloak over me). He (the Holy Prophet) said: Take off the cloak and wash the yellowness and do in your 'Umra what you do in Hajj.",
      "chain": [
        "30441",
        "30375",
        "20298",
        "11272",
        "11046",
        "11029",
        "11248",
        "897"
      ]
    },
    {
      "hadith_no": "3392",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني زهير بن حرب، وإبراهيم بن محمد السامي، قالا حدثنا وهب بن جرير، حدثنا أبي قال، سمعت يونس، يحدث عن الزهري، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم اجعل بالمدينة ضعفى ما بمكة من البركة ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik (Allah he pleased with him) reported that Allah's Messenger (may peace be upon him) said:                      O Allah, increase in Medina twice the blessings (Thou showered) on Mecca.",
      "chain": [
        "30022",
        "30426",
        "20298",
        "11272",
        "20475",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "3559",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثناه محمد بن المثنى، حدثنا أبو داود، ح وحدثنا محمد بن رافع، وهارون، بن عبد الله قالا حدثنا وهب بن جرير، ح وحدثنا أحمد بن خراش، حدثنا شبابة، كلهم عن شعبة، عن حميد، بهذا الإسناد غير أن في، حديث وهب قال قال عبد الرحمن تزوجت امرأة ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Humaid with the same chain of transmitters except (with this minor alteration of words) that 'Abd al-Rahman said:                     \" I married a woman.\"",
      "chain": [
        "30170",
        "30002",
        "30375",
        "30524",
        "20298",
        "20020"
      ]
    },
    {
      "hadith_no": "3562",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثنيه محمد بن رافع، حدثنا وهب، أخبرنا شعبة، بهذا الإسناد غير أنه قال فقال رجل من ولد عبد الرحمن بن عوف من ذهب ‏.",
      "text_en": "  Shu'ba has narrattd this hadith with the same chain of transmitters except for (this alteration) that he said that a person from among the sons of 'Abd al Rahman said:                     \" from gold\".",
      "chain": [
        "20298"
      ]
    },
    {
      "hadith_no": "3610",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثناه قتيبة بن سعيد، حدثنا أبو عوانة، ح وحدثنا عبد الوارث بن عبد الصمد، حدثني أبي، عن جدي، عن أيوب، ح وحدثنا محمد بن المثنى، حدثني وهب بن جرير، حدثنا شعبة، ح وحدثنا محمد بن المثنى، حدثنا عبد الرحمن، حدثنا سفيان، ح وحدثني عبيد الله، بن سعيد وهارون بن عبد الله وأبو معن الرقاشي قالوا حدثنا وهب بن جرير، حدثنا أبي قال، سمعت النعمان بن راشد، يحدث عن الزهري، ح وحدثني سليمان بن معبد، حدثنا معلى بن أسد، حدثنا عبد العزيز، - وهو ابن المختار - عن سهيل بن أبي صالح، كل هؤلاء عن محمد بن المنكدر، عن جابر، بهذا الحديث وزاد في حديث النعمان عن الزهري إن شاء مجبية وإن شاء غير مجبية غير أن ذلك في صمام واحد ‏.‏",
      "text_en": " This hadith has been reported on the authority of Jabir through another chain of transmitters, but in the hadith transmitted on the authority of Zuhri there is an addition (of these words):                     \" If he likes he may (have intercourse) being on the back or in front of her, but it should be through one opening (vagina).\"",
      "chain": [
        "30367",
        "20469",
        "11015",
        "30170",
        "20298",
        "20020",
        "30170",
        "20033",
        "20005"
      ]
    },
    {
      "hadith_no": "3848",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "حدثني هارون بن عبد الله، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت قتادة، يحدث بهذا الإسناد بمعنى حديث ابن أبي عروبة وذكر في الحديث قوم عليه قيمة عدل.",
      "text_en": " A hadith like this is reported on the authority of the same chain of transmitters but with a slight change of words.",
      "chain": [
        "30524",
        "20298",
        "11272",
        "11019"
      ]
    },
    {
      "hadith_no": "3892",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "وحدثنيه أبو بكر بن نافع، حدثنا غندر، ح وحدثناه محمد بن المثنى، حدثنا وهب، بن جرير ح وحدثنا عبد الوارث بن عبد الصمد، حدثنا أبي قالوا، جميعا حدثنا شعبة، بهذا الإسناد ‏.‏ في حديث غندر ووهب نهي ‏.‏ وفي حديث عبد الصمد أن رسول الله صلى الله عليه وسلم نهى ‏.‏ بمثل حديث معاذ عن شعبة ‏.‏",
      "text_en": "  This hadith has been narrated through another chain of transmitters.",
      "chain": [
        "20278",
        "30170",
        "20298",
        "11272"
      ]
    },
    {
      "hadith_no": "4105",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثنيه يحيى بن حبيب، حدثنا خالد يعني ابن الحارث، ح وحدثني محمد بن، حاتم حدثنا يحيى بن سعيد، ح وحدثني محمد بن الوليد، حدثنا محمد بن جعفر، ح وحدثنا  إسحاق بن إبراهيم، أخبرنا النضر، ح وحدثنا محمد بن المثنى، حدثنا وهب بن جرير، كلهم عن شعبة، بهذا الإسناد ‏.‏ وقال ابن حاتم في حديثه عن يحيى، ورخص، في كلب الغنم والصيد والزرع ‏.‏",
      "text_en": "  In the hadith transmitted on the authority of Yahya, he (the Holy Prophet) permitted the keeping of dogs for (the protection of) herds, for hunting and (the protection of) cultivated land.",
      "chain": [
        "20226",
        "38487",
        "11062",
        "30174",
        "20173",
        "30123",
        "20291",
        "30170",
        "20298",
        "11449"
      ]
    },
    {
      "hadith_no": "4234",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Rules of Inheritance - كتاب الفرائض",
      "chapter_no": "24",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا النضر بن شميل، وأبو عامر العقدي ح وحدثنا محمد بن المثنى، حدثنا وهب بن جرير، كلهم عن شعبة، بهذا الإسناد ‏.‏ في حديث وهب بن جرير فنزلت آية الفرائض ‏.‏ وفي حديث النضر والعقدي فنزلت آية الفرض ‏.‏ وليس في رواية أحد منهم قول شعبة لابن المنكدر ‏.‏",
      "text_en": " This hadith is transmitted on the authority of Shu'ba but with a slight variation of words.",
      "chain": [
        "30123",
        "20291",
        "20443",
        "30170",
        "20298"
      ]
    },
    {
      "hadith_no": "4395",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثناه إسحاق بن إبراهيم، ومحمد بن المثنى، عن وهب بن جرير، أخبرنا شعبة، قال قال لي محمد بن المنكدر ما اسمك فذكر بمثل حديث عبد الصمد ‏.‏",
      "text_en": " Wahb b. Jarir reported:                      Shu'ba informed that Muhammad b. Munkadir said to me: What is your name? The rest of the hadith is the same.",
      "chain": [
        "30123",
        "30170",
        "20298",
        "20020"
      ]
    },
    {
      "hadith_no": "4791",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا وهب بن جرير بن حازم، حدثني أبي قال، سمعت قيسا، يحدث عن يزيد بن هرمز، ح وحدثني محمد بن حاتم، - واللفظ له - قال حدثنا بهز، حدثنا جرير بن حازم، حدثني قيس بن سعد، عن يزيد بن هرمز، قال كتب نجدة بن عامر إلى ابن عباس قال فشهدت ابن عباس حين قرأ كتابه وحين كتب جوابه وقال ابن عباس والله لولا أن أرده عن نتن يقع فيه ما كتبت إليه ولا نعمة عين قال فكتب إليه إنك سألت عن سهم ذي القربى الذي ذكر الله من هم وإنا كنا نرى أن قرابة رسول الله صلى الله عليه وسلم هم نحن فأبى ذلك علينا قومنا وسألت عن اليتيم متى ينقضي يتمه وإنه إذا بلغ النكاح وأونس منه رشد ودفع إليه ماله فقد انقضى يتمه وسألت هل كان رسول الله صلى الله عليه وسلم يقتل من صبيان المشركين أحدا فإن رسول الله صلى الله عليه وسلم لم يكن يقتل منهم أحدا وأنت فلا تقتل منهم أحدا إلا أن تكون تعلم منهم ما علم الخضر من الغلام حين قتله وسألت عن المرأة والعبد هل كان لهما سهم معلوم إذا حضروا البأس فإنهم لم يكن لهم سهم معلوم إلا أن يحذيا من غنائم القوم.",
      "text_en": " It has been narrated on the anthority of Yazid b. Hurmuz who said:                      Najda wrote to Ibn Abbas. I was sitting in the company of Ibn 'Abbas when he read his letter and wrote its reply. Ibn Abbas said: Were it not for preventing him from falling into wickedness. I would not have replied to his letter, may he never be joyful. He wrote in reply to him referring to the share of the close relatives (of the Holy Prophet) (from the booty) whom God has mentioned. (I have to tell you that) we thought we were the close relatives of the Messenger of Allah (may peace be upon him), but our people have refused to recognise us as such. You have asked about the orphan as to when his orphanhood comes to an end. (I have to say that) when he reaches the age of marriage, attains maturity of mind, and his property is returned to him, then he is no longer an orphan. You have inquired whether the Messenger of Allah (may peace be upo him) used to kill anyone from the children of the polytheists in the war. (You should know that) the Messenger of Allah (may peace be upon him) used not to kill any one of their children, and you (too) should not kill any one of them, except when you knew about them what Khadir had known about the boy whom he killed. And you have inquired whether there is a fixed share of the booty for women and slaves when they participate in a battle. (I have to tell you that) there is no fixed share for them except that they will be given some reward from the spoils of war.",
      "chain": [
        "30123",
        "20298",
        "11272",
        "11046",
        "10627",
        "38487",
        "20214",
        "11272",
        "172",
        "10627"
      ]
    },
    {
      "hadith_no": "4966",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن بشار، حدثنا محمد يعني ابن جعفر، ح وحدثنا محمد بن المثنى، حدثني وهب بن جرير، جميعا عن شعبة، عن عبد الله بن يزيد النخعي، عن أبي زرعة، عن أبي هريرة، عن النبي صلى الله عليه وسلم ‏.‏ بمثل حديث وكيع ‏.‏ وفي رواية وهب عن عبد الله بن يزيد ‏.‏ ولم يذكر النخعي ‏.‏",
      "text_en": " The tradition has been handed down through a different chain of transmitters.",
      "chain": [
        "30160",
        "20173",
        "30170",
        "20298",
        "20020",
        "10788",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "5190",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثناه ابن المثنى، حدثني وهب بن جرير، ح وحدثنا إسحاق بن إبراهيم، أخبرنا  أبو عامر العقدي، حدثنا شعبة، بهذا الإسناد ‏.‏ ولم يذكر الشك في قوله هي خير من مسنة ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters, but did not mention tht doubt (expressed in his statement) That is (the goat of less than a year) is better than a goat of more than one year.",
      "chain": [
        "20298",
        "30123",
        "20443"
      ]
    },
    {
      "hadith_no": "5403",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثناه محمد بن بشار، حدثنا محمد بن جعفر، ح وحدثني محمد بن المثنى، حدثنا وهب بن جرير، كلاهما عن شعبة، بهذا الإسناد وفي حديثهما فأتيته بدلو ‏.‏",
      "text_en": " This hadith is reported on the authority of Shu'ba with the same chain of transmitters but with a slight variation of wording.",
      "chain": [
        "30160",
        "20173",
        "30170",
        "20298"
      ]
    },
    {
      "hadith_no": "5443",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا الحسن بن علي الحلواني، حدثنا وهب بن جرير، حدثنا أبي قال، سمعت  جرير بن زيد، يحدث عن عمرو بن عبد الله بن أبي طلحة، عن أنس بن مالك، قال رأى أبو طلحة رسول الله صلى الله عليه وسلم مضطجعا في المسجد يتقلب ظهرا لبطن فأتى أم سليم فقال إني رأيت رسول الله صلى الله عليه وسلم مضطجعا في المسجد يتقلب ظهرا لبطن وأظنه جائعا ‏.‏ وساق الحديث وقال فيه ثم أكل رسول الله صلى الله عليه وسلم وأبو طلحة وأم سليم وأنس بن مالك وفضلت فضلة فأهديناه لجيراننا ‏.‏",
      "text_en": " Anas b. Malik reported:                      Abu Talha saw Allah's Messenger (may peace be upon him) lying down upon his belly in the mosque. He came to Umm Sulaim and said: I saw Allah's Messenger (may peace be upon him) lying down upon the belly in the mosque, and I think he is hungry. The rest of the hadith is the same (but with the addition of these words) that Allah's messenger (may peace be upon him) ate (the food) and so did Abu Talha, Umm Sulaim and Anas b. Malik, but there was left some. thing which we presented to our neighbours.",
      "chain": [
        "30115",
        "20298",
        "11272",
        "11678",
        "10603",
        "19"
      ]
    },
    {
      "hadith_no": "5763",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "وحدثنا إسحاق بن إبراهيم، حدثنا النضر بن شميل، وأبو عامر العقدي ح وحدثنا  محمد بن المثنى، حدثني وهب بن جرير، ح وحدثني عبد الرحمن بن بشر، حدثنا بهز، كلهم عن شعبة، بهذا الإسناد ‏.‏ وفي حديثهم كأنه كره ذلك ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Shu'ba with a slight variation of wording and that is:                      The Holy Prophet (may peace be upon him) uttered these words: It is I. it is I.\" in the manner as if he disapproved of this.",
      "chain": [
        "30123",
        "20291",
        "20443",
        "30170",
        "20298",
        "30356"
      ]
    },
    {
      "hadith_no": "5866",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثني محمد بن المثنى، حدثنا وهب بن جرير، حدثنا هشام، بهذا الإسناد ‏.‏ نحوه غير أنه قال فقام معها رجل منا ما كنا نأبنه برقية ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Hisham with the same chain of transmitters and he said:                      There stood up with her a person amongst us whom we did not know before as an incantator.",
      "chain": [
        "30170",
        "20298"
      ]
    },
    {
      "hadith_no": "5977",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثني محمد بن رافع، حدثنا وهب بن جرير بن حازم، حدثنا أبي قال، سمعت  أسماء بن عبيد، يحدث عن رجل، يقال له السائب - وهو عندنا أبو السائب - قال دخلنا على أبي سعيد الخدري فبينما نحن جلوس إذ سمعنا تحت، سريره حركة فنظرنا فإذا حية ‏.‏ وساق الحديث بقصته نحو حديث مالك عن صيفي وقال فيه فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن لهذه البيوت عوامر فإذا رأيتم شيئا منها فحرجوا عليها ثلاثا فإن ذهب وإلا فاقتلوه فإنه كافر ‏\"‏ ‏.‏ وقال لهم ‏\"‏ اذهبوا فادفنوا صاحبكم ‏\"‏ ‏.‏",
      "text_en": " Asma' b. 'Ubaid reported about a person who was called as-Sa'ib having said:                      We visited Abu Sa'id Khudri. When we had been sitting (with him) we heard a stir under his bed. When we looked we found a big snake, the rest of the hadith is the same. And in this Allah's Messenger (may peace be upon him) is reported to have said: Verily in these houses there live aged (snakes), so when you see one of them, make life hard for it for three days, and if it goes away (well and good), otherwise kill it for (in that case) it would be a nonbeliever. And he (the Holy Prophet) said (to his Companions): Go and bury your companion (who had died by the snake bite).",
      "chain": [
        "30375",
        "20298",
        "11272",
        "10667"
      ]
    }
  ],
  "total_hadiths": 128
}