{
  "id": "20290",
  "name": "Abu Hudhayfa al-Nahdi موسى بن مسعود أبو حذيفة النهدي",
  "full_name": "Abu Hudhayfa al-Nahdi موسى بن مسعود أبو حذيفة النهدي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "130",
      "date_gregorian": "NA",
      "date_display": [
        "130 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "220",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  د  ت  ق  -  صدوق ]"
    ],
    "tags": [
      "al-Nahdi",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "10704",
      "name": "'Ikrama bin 'Ammar عكرمة بن عمار العجلي أبو عمار اليمامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11555",
      "name": "Ayman bin Nabil أيمن بن نابل الحبشي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20187",
      "name": "Ibrahim bin Tahman إبراهيم بن طهمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11559",
      "name": "Shabl bin 'Aabad al-Makki شبل بن عباد المكي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20394",
      "name": "Zuhayr bin Muhammad al-Tamimi زهير بن محمد التميمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30553",
      "name": "'Abd bin Hameed bin Nasr عبد بن حميد بن نصر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30296",
      "name": "Ahmed bin Sa'id bin Sakhar أحمد بن سعيد بن صخر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38719",
      "name": "Y'aqub bin Sufyan يعقوب بن سفيان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "34010",
      "name": "Ahmed bin Muhammad bin al-Mu'alli أحمد بن محمد بن المعلى",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2519",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا موسى بن مسعود، حدثنا زائدة بن قدامة، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر  رضى الله عنهما  قالت أمر النبي صلى الله عليه وسلم بالعتاقة في كسوف الشمس‏.‏ تابعه علي عن الدراوردي عن هشام‏.‏",
      "text_en": " Narrated Asma' bint Abu Bakr:                     The Prophet ordered us to free slaves at the time of solar eclipses.",
      "chain": [
        "20290",
        "20320",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "2700",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "وقال موسى بن مسعود حدثنا سفيان بن سعيد، عن أبي إسحاق، عن البراء بن عازب  رضى الله عنهما  قال صالح النبي صلى الله عليه وسلم المشركين يوم الحديبية على ثلاثة أشياء على أن من أتاه من المشركين رده إليهم، ومن أتاهم من المسلمين لم يردوه، وعلى أن يدخلها من قابل ويقيم بها ثلاثة أيام، ولا يدخلها إلا بجلبان السلاح السيف والقوس ونحوه‏.‏ فجاء أبو جندل يحجل في قيوده فرده إليهم‏.‏ قال لم يذكر مؤمل عن سفيان أبا جندل وقال إلا بجلب السلاح‏.‏",
      "text_en": " Narrated Al-Bara' bin 'Azib (ra):                      On the day of Hudaibiya, the Prophet (), the Prophet () made a peace treaty with the Al-Mushrikun on three conditions:1. The Prophet () would return to them any person from Al-Mushrikun (polytheists, idolaters, pagans).2. Al-Mushrikun pagans would not return any of the Muslims going to them, and 3. The Prophet () and his companions would come to Makkah the following year and would stay there for three days and would enter with their weapons in cases, e.g., swords, arrows, bows, etc.Abu Jandal came hopping, his legs being chained, but the Prophet () returned him to Al-Mushrikun.",
      "chain": [
        "20290",
        "20012",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "6567",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني موسى بن مسعود، حدثنا سفيان، عن منصور، والأعمش، عن أبي وائل، عن عبد الله  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ الجنة أقرب إلى أحدكم من شراك نعله، والنار مثل ذلك ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet said, \"Paradise is nearer to any of you than the Shirak (leather strap) of his shoe, and so is the (Hell) Fire.",
      "chain": [
        "20290",
        "20012",
        "11067",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "6684",
      "source": " Sahih Bukhari ",
      "chapter": "Divine Will (Al-Qadar) - كتاب القدر",
      "chapter_no": "82",
      "text_ar": "حدثنا موسى بن مسعود، حدثنا سفيان، عن الأعمش، عن أبي وائل، عن حذيفة  رضى الله عنه  قال لقد خطبنا النبي صلى الله عليه وسلم خطبة، ما ترك فيها شيئا إلى قيام الساعة إلا ذكره، علمه من علمه، وجهله من جهله، إن كنت لأرى الشىء قد نسيت، فأعرف ما يعرف الرجل إذا غاب عنه فرآه فعرفه‏.‏",
      "text_en": " Narrated Hudhaifa:                     The Prophet once delivered a speech in front of us wherein he left nothing but mentioned (about) everything that would happen till the Hour. Some of us stored that our minds and some forgot it. (After that speech) I used to see events taking place (which had been referred to in that speech) but I had forgotten them (before their occurrence). Then I would recognize such events as a man recognizes another man who has been absent and then sees and recognizes him.",
      "chain": [
        "20290",
        "20012",
        "11060",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "5378",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن الأعمش، عن خيثمة، عن أبي حذيفة، عن حذيفة، قال كنا إذا حضرنا مع النبي صلى الله عليه وسلم طعاما لم نضع أيدينا حتى يبدأ رسول الله صلى الله عليه وسلم فيضع يده وإنا حضرنا معه مرة طعاما فجاءت جارية كأنها تدفع فذهبت لتضع يدها في الطعام فأخذ رسول الله صلى الله عليه وسلم بيدها ثم جاء أعرابي كأنما يدفع فأخذ بيده فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الشيطان يستحل الطعام أن لا يذكر اسم الله عليه وإنه جاء بهذه الجارية ليستحل بها فأخذت بيدها فجاء بهذا الأعرابي ليستحل به فأخذت بيده والذي نفسي بيده إن يده في يدي مع يدها ‏\"‏ ‏.‏",
      "text_en": " Hudhaifa reported:                      When we attended a dinner along with the Messenger of Allah (may peace be upon him) we did not lay our hands on the food until Allah's Messenger (may peace be upon him) had laid his hand and commenced eating (the food). Once we went with him to a dinner when a girl came rushingly as it someone had been pursuing her. She was about to lay her hand on the food, when Allah's Messenger (may peace be upon him) caught her hand. Then a desert Arab came there (rushingly) as if someone had been pursuing him. He (the Holy Prophet) caught his hand; and then Allah's Messenger (may peace be upon him) said: Satan considers that food lawful on which Allah's name is not mentioned. He had brought this girl so that the food might be made lawful for him and I caught her hand. And he had brought a desert Arab so that (the food) might be lawful for him. So I caught his hand. By Him, in Whose hand is my life, it was (Satan's) hand that was in my hand along with her hand.",
      "chain": [
        "30201",
        "30216",
        "20354",
        "11060",
        "11332",
        "20290",
        "145"
      ]
    },
    {
      "hadith_no": "749",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي، حدثنا معاوية، وخالد بن عمرو، وأبو حذيفة قالوا حدثنا سفيان، بإسناده بهذا قال فرفع يديه في أول مرة وقال بعضهم مرة واحدة ‏.‏",
      "text_en": " This tradition has also been transmitted by Sufyan through a different chain of narrators. This version has:                      He raised his hands once in the beginning. Some narrated: (raised his hands) once only.",
      "chain": [
        "30115",
        "27",
        "20290"
      ]
    },
    {
      "hadith_no": "2301",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن محمد المروزي، حدثنا موسى بن مسعود، حدثنا شبل، عن ابن أبي نجيح، قال قال عطاء قال ابن عباس نسخت هذه الآية عدتها عند أهله فتعتد حيث شاءت وهو قول الله تعالى ‏{‏ غير إخراج ‏}‏ قال عطاء إن شاءت اعتدت عند أهله وسكنت في وصيتها وإن شاءت خرجت لقول الله تعالى ‏{‏ فإن خرجن فلا جناح عليكم فيما فعلن ‏}‏ قال عطاء ثم جاء الميراث فنسخ السكنى تعتد حيث شاءت ‏.‏",
      "text_en": " Ibn ‘Abbas said “The following verse abrogated the rule of passing her waiting period with her people. A  year’s maintenance and residence. She may pass her waiting period now anywhere she wishes. ‘Ata said “If she wishes she can pass her waiting period with the people of her husband and live in the house left by her husband by will. Or she may shift if she wishes according to the pronouncement of Allah the Exalted. But if they leave (the residence) there is no blame on you for what they do. Ata’ said “Then the verses regarding inheritance were revealed. The commandment for living in a house (for one year) was repealed. She may pass her waiting period wherever she wishes.",
      "chain": [
        "30304",
        "20290",
        "11559",
        "11254",
        "11029",
        "11029"
      ]
    },
    {
      "hadith_no": "3766",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا أبو معاوية، عن الأعمش، عن خيثمة، عن أبي حذيفة، عن حذيفة، قال كنا إذا حضرنا مع رسول الله صلى الله عليه وسلم طعاما لم يضع أحدنا يده حتى يبدأ رسول الله صلى الله عليه وسلم وإنا حضرنا معه طعاما فجاء أعرابي كأنما يدفع فذهب ليضع يده في الطعام فأخذ رسول الله صلى الله عليه وسلم بيده ثم جاءت جارية كأنما تدفع فذهبت لتضع يدها في الطعام فأخذ رسول الله صلى الله عليه وسلم بيدها وقال ‏\"‏ إن الشيطان ليستحل الطعام الذي لم يذكر اسم الله عليه وإنه جاء بهذا الأعرابي يستحل به فأخذت بيده وجاء بهذه الجارية يستحل بها فأخذت بيدها فوالذي نفسي بيده إن يده لفي يدي مع أيديهما ‏\"‏ ‏.‏",
      "text_en": " When we were at food with the Messenger of Allah(ﷺ) none of us put in his hand till the Messenger of Allah(ﷺ)put his hand first. Once we were at food with him. A nomad Arab came in as though he were being pushed, and he was about to put his hand in food when the Messenger of Allah (ﷺ) seized him by the hand. Then a girl came in as though she were being pushed, and she was about to put her hand in the food when the Messenger of Allah (ﷺ) seized her by the hand, and he said:                      The devil considers the food when Allah’s name is not mentioned over it, and he brought his nomad Arab that it might be lawful by means of him, so I seized his hand: then he brought this girl that it might be lawful by means of her, so I seized her hand. By Him in Whose hand my soul is, His hand is in my hand along with their hands.",
      "chain": [
        "30203",
        "20354",
        "11060",
        "11332",
        "20290",
        "145"
      ]
    },
    {
      "hadith_no": "4414",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن محمد بن ثابت، حدثنا موسى، - يعني ابن مسعود - عن شبل، عن ابن أبي نجيح، عن مجاهد، قال السبيل الحد قال سفيان ‏{‏ فآذوهما ‏}‏ البكران ‏{‏ فأمسكوهن في البيوت ‏}‏ الثيبات ‏.‏",
      "text_en": " Mujahid said:                      “Apponting a way in the verse (iv.15) means prescribed punishment.Sufiyan said: “Punish them “refers to unmarried, and “confine them to houses” refers to the women who are married.",
      "chain": [
        "30304",
        "20290",
        "11559",
        "11254",
        "11028"
      ]
    },
    {
      "hadith_no": "4875",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن سفيان، قال حدثني علي بن الأقمر، عن أبي حذيفة، عن عائشة، قالت قلت للنبي صلى الله عليه وسلم حسبك من صفية كذا وكذا قال غير مسدد تعني قصيرة ‏.‏ فقال ‏\"‏ لقد قلت كلمة لو مزجت بماء البحر لمزجته ‏\"‏ ‏.‏ قالت وحكيت له إنسانا فقال ‏\"‏ ما أحب أني حكيت إنسانا وأن لي كذا وكذا ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     I said to the Prophet (ﷺ): It is enough for you in Safiyyah that she is such and such (the other version than Musaddad's has:) meaning that she was short-statured. He replied; You have said a word which would change the sea if it were mixed in it. She said: I imitated a man before him (out of disgrace). He said: I do not like that I imitate anyone even if I should get such and such.",
      "chain": [
        "30175",
        "20031",
        "20012",
        "11375",
        "20290",
        "53"
      ]
    },
    {
      "hadith_no": "2690",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، وعبد الرحمن بن مهدي، قالا حدثنا سفيان، عن علي بن الأقمر، عن أبي حذيفة، وكان، من أصحاب ابن مسعود عن عائشة، قالت حكيت للنبي صلى الله عليه وسلم رجلا فقال ‏\"‏ ما يسرني أني حكيت رجلا وأن لي كذا وكذا ‏\"‏ ‏.‏ قالت فقلت يا رسول الله إن صفية امرأة وقالت بيدها هكذا كأنها تعني قصيرة ‏.‏ فقال ‏\"‏ لقد مزجت بكلمة لو مزجت بها ماء البحر لمزج ‏\"‏ ‏.‏",
      "text_en": " Abu Hudhaifah narrated - and he was one of the companions of 'Abdullãh bin Mas'üd - from'Aishah who said:                      \"I told theProphet (ﷺ) about a man, so hesaid: 'I do not like to talk about aman, even if I were to get this orthat (for doing so).\" She said: \"Isaid: 'O Messenger of Allah!Safiyyah is a woman who is ...\" andshe used her hand as if to indicatethat she is short - \"So he said:'You have said a statement which,if it were mixed in with the waterof the sea, it would pollute it.\"",
      "chain": [
        "30160",
        "20031",
        "20033",
        "20012",
        "11375",
        "20290",
        "53"
      ]
    },
    {
      "hadith_no": "2691",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن سفيان، عن علي بن الأقمر، عن أبي حذيفة، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ ما أحب أني حكيت أحدا وأن لي كذا وكذا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو حذيفة هو كوفي من أصحاب ابن مسعود ويقال اسمه سلمة بن صهيبة ‏.‏",
      "text_en": " 'Aishah narrated that the Messenger of Allah (s.a.w) said:                     \"I do not like to talk about anyone, even if I were to get this or that.\"",
      "chain": [
        "30480",
        "20032",
        "20012",
        "11375",
        "20290",
        "53"
      ]
    },
    {
      "hadith_no": "2735",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا عبد بن حميد، وغير، واحد، قالوا حدثنا موسى بن مسعود أبو حذيفة، عن سفيان، عن أبي إسحاق، عن مصعب بن سعد، عن عكرمة بن أبي جهل، قال قال رسول الله صلى الله عليه وسلم يوم جئته ‏\"‏ مرحبا بالراكب المهاجر ‏\"‏ ‏.‏ وفي الباب عن بريدة وابن عباس وأبي جحيفة ‏.‏ قال أبو عيسى هذا حديث ليس إسناده بصحيح لا نعرفه مثل هذا إلا من هذا الوجه من حديث موسى بن مسعود عن سفيان ‏.‏ وموسى بن مسعود ضعيف في الحديث ‏.‏ وروى هذا الحديث عبد الرحمن بن مهدي عن سفيان عن أبي إسحاق مرسلا ولم يذكر فيه عن مصعب بن سعد ‏.‏ وهذا أصح ‏.‏ قال سمعت محمد بن بشار يقول موسى بن مسعود ضعيف في الحديث ‏.‏ قال محمد بن بشار وكتبت كثيرا عن موسى بن مسعود ثم تركته ‏.‏ كمل كتاب الاستئذان ويتلوه كتاب الأدب",
      "text_en": " Narrated 'Ikrimah bin Abi Jahl:                     \"The day that I came to him, the Messenger of Allah (ﷺ) said: \"Welcome to the riding emigrant.'\"There are narrations on this topic from Buraidah, Ibn 'Abbas, and Abu Juhaifah.",
      "chain": [
        "30553",
        "20290",
        "20012",
        "11049",
        "10556",
        "147"
      ]
    },
    {
      "hadith_no": "3758",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of 'Umra - كتاب العمرى",
      "chapter_no": "34",
      "text_ar": "أخبرنا هناد بن السري، قال حدثنا أبو بكر بن عياش، عن يحيى بن هانئ، عن أبي حذيفة، عن عبد الملك بن محمد بن بشير، عن عبد الرحمن بن علقمة الثقفي، قال قدم وفد ثقيف على رسول الله صلى الله عليه وسلم ومعهم هدية فقال ‏\"‏ أهدية أم صدقة فإن كانت هدية فإنما يبتغى بها وجه رسول الله صلى الله عليه وسلم وقضاء الحاجة وإن كانت صدقة فإنما يبتغى بها وجه الله عز وجل ‏\"‏ ‏.‏ قالوا لا بل هدية ‏.‏ فقبلها منهم وقعد معهم يسائلهم ويسائلونه حتى صلى الظهر مع العصر ‏.‏",
      "text_en": " It was narrated that 'Abdur-Rahman bin 'Alqamah Ath-Thaqafi said:                      \"The delegation of Thaqif came to the Messenger of Allah, bringing a gift with them. He said: 'Is it a gift or charity?' If it was a gift it would be for the sake of the Messenger of Allah and to have their needs met, and if it was charity then it would be in the cause of Allah. They said: 'It is a gift.' So he accepted it from them, and sat with them, and they asked questions, until he prayed Zuhr with 'Asr.\"",
      "chain": [
        "30480",
        "20373",
        "20290"
      ]
    },
    {
      "hadith_no": "917",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا أبو حذيفة، حدثنا إبراهيم بن طهمان، عن أبي الزبير، أن جابر بن عبد الله، كان إذا افتتح الصلاة رفع يديه وإذا ركع وإذا رفع رأسه من الركوع فعل مثل ذلك ويقول رأيت رسول الله  صلى الله عليه وسلم  فعل مثل ذلك ‏.‏ ورفع إبراهيم بن طهمان يديه إلى أذنيه ‏.‏",
      "text_en": " It wasnarrated from Abu Zubair that Jabir bin ‘Abdullah would raisehishands when he began the prayer, and when he bowed, and when heraised(his head) from Ruku’ he would do likewise, and he said:                      “I sawthe Messenger of Allah (ﷺ) doing that.” (One of the narrators)said:“Ibrahim bin Tahman (one of the narrators) raised his handsto hisears.”",
      "chain": [
        "11222",
        "20290",
        "20187",
        "11263",
        "34"
      ]
    }
  ],
  "total_hadiths": 15
}