{
  "id": "20307",
  "name": "Ahmed bin Ya'qub al-Mas'udi أحمد بن يعقوب المسعودي",
  "full_name": "Ahmed bin Ya'qub al-Mas'udi أحمد بن يعقوب المسعودي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "210",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  -  ثقة ]"
    ],
    "tags": [
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11517",
      "name": "'Abdur Rahman bin Sulaiman ibn al-Ghasil عبد الرحمن بن سليمان - ابن الغسيل",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20309",
      "name": "Ishaq bin Sa'id bin 'Amr bin Sa'id إسحاق بن سعيد بن عمرو بن سعيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "15646",
      "name": "Yazid bin al-Mqdam bin Shryh يزيد بن المقدام بن شريح",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30212",
      "name": "Muhammad bin 'Abdullah bin Numayr محمد بن عبد الله بن نمير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30200",
      "name": "'Abdullah bin Sa'id al-Ashaj عبد الله بن سعيد بن حصين الكندي - الأشج",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-967",
      "hadith_no": "967",
      "source": "Sahih Bukhari",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن يعقوب، قال حدثني إسحاق بن سعيد بن عمرو بن سعيد بن العاص، عن أبيه، قال دخل الحجاج على ابن عمر وأنا عنده، فقال كيف هو فقال صالح‏.‏ فقال من أصابك قال أصابني من أمر بحمل السلاح في يوم لا يحل فيه حمله، يعني الحجاج‏.‏",
      "text_en": " Narrated Sa`id bin `Amr bin Sa`id bin Al-`Aas:                     Al-Hajjaj went to Ibn `Umar while I was present there. Al-Hajjaj asked Ibn `Umar, \"How are you?\" Ibn `Umar replied, \"I am all right,\" Al-Hajjaj asked, \"Who wounded you?\" Ibn `Umar replied, \"The person who allowed arms to be carried on the day on which it was forbidden to carry them (he meant Al-Hajjaj).\"",
      "usc_msa_ref": "84",
      "chain": [
        "20307",
        "20309",
        "11509"
      ]
    },
    {
      "id": "sahih-bukhari-3847",
      "hadith_no": "3847",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا أحمد بن يعقوب، حدثنا ابن الغسيل، سمعت عكرمة، يقول سمعت ابن عباس  رضى الله عنهما  يقول خرج رسول الله صلى الله عليه وسلم وعليه ملحفة، متعطفا بها على منكبيه، وعليه عصابة دسماء حتى جلس على المنبر، فحمد الله وأثنى عليه، ثم قال ‏\"‏ أما بعد، أيها الناس، فإن الناس يكثرون وتقل الأنصار، حتى يكونوا كالملح في الطعام، فمن ولي منكم أمرا يضر فيه أحدا أو ينفعه، فليقبل من محسنهم، ويتجاوز عن مسيئهم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle (in his fatal illness) came out wrapped in a sheet covering his shoulders and his head was tied with an oily tape of cloth till he sat on the pulpit, and after praising and glorifying Allah, he said, \"Then-after, O people! The people will go on increasing, but the Ansar will go on decreasing till they become just like salt in a meal. So whoever amongst you will be the ruler and have the power to harm or benefit others, should accept the good of the good-doers amongst them and excuse the wrongdoers amongst them.\"",
      "usc_msa_ref": "144",
      "chain": [
        "20307",
        "11517",
        "11023",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-5572",
      "hadith_no": "5572",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا أحمد بن يعقوب، أخبرنا إسحاق بن سعيد بن عمرو، عن أبيه، أنه سمعه يحدث، عن ابن عمر  رضى الله عنهما  أنه دخل على يحيى بن سعيد وغلام من بني يحيى رابط دجاجة يرميها، فمشى إليها ابن عمر حتى حلها، ثم أقبل بها وبالغلام معه فقال ازجروا غلامكم عن أن يصبر هذا الطير للقتل، فإني سمعت النبي صلى الله عليه وسلم نهى أن تصبر بهيمة أو غيرها للقتل‏.‏",
      "text_en": " Narrated Ibn `Umar:                     that he entered upon Yahya bin Sa`id while one of Yahya's sons was aiming at a hen after tying it. Ibn `Umar walked to it and untied it. Then he brought it and the boy and said. \"Prevent your boys from tying the birds for the sake of killing them, as I have heard the Prophet forbidding the killing of an animal or other living thing after tying them.\"",
      "usc_msa_ref": "422",
      "chain": [
        "20307",
        "20309",
        "11509",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-6947",
      "hadith_no": "6947",
      "source": "Sahih Bukhari",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثني أحمد بن يعقوب، حدثنا إسحاق، سمعت أبي يحدث، عن عبد الله بن عمر، قال إن من ورطات الأمور التي لا مخرج لمن أوقع نفسه فيها، سفك الدم الحرام بغير حله‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     One of the evil deeds with bad consequence from which there is no escape for the one who is involved in it is to kill someone unlawfully.",
      "usc_msa_ref": "3",
      "chain": [
        "20307",
        "30312",
        "18"
      ]
    }
  ],
  "total_hadiths": 4
}