{
  "id": "20309",
  "name": "Ishaq bin Sa'id bin 'Amr bin Sa'id إسحاق بن سعيد بن عمرو بن سعيد",
  "full_name": "Ishaq bin Sa'id bin 'Amr bin Sa'id إسحاق بن سعيد بن عمرو بن سعيد",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "170",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  ق  -  ثقة ]"
    ],
    "tags": [
      "Qurash",
      "B.Umayya",
      "al-Kufi"
    ]
  },
  "parents": [
    {
      "id": "11509",
      "name": "Sa'id bin 'Amr bin Sa'id bin al-Aas سعيد بن عمرو بن سعيد بن العاص",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "20422",
      "name": "Khalid bin Sa'id bin 'Amr bin Sa'id خالد بن سعيد بن عمرو بن سعيد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "11509",
      "name": "Sa'id bin 'Amr bin Sa'id bin al-Aas سعيد بن عمرو بن سعيد بن العاص",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [],
  "hadiths": [
    {
      "id": "sahih-bukhari-967",
      "hadith_no": "967",
      "source": "Sahih Bukhari",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن يعقوب، قال حدثني إسحاق بن سعيد بن عمرو بن سعيد بن العاص، عن أبيه، قال دخل الحجاج على ابن عمر وأنا عنده، فقال كيف هو فقال صالح‏.‏ فقال من أصابك قال أصابني من أمر بحمل السلاح في يوم لا يحل فيه حمله، يعني الحجاج‏.‏",
      "text_en": " Narrated Sa`id bin `Amr bin Sa`id bin Al-`Aas:                     Al-Hajjaj went to Ibn `Umar while I was present there. Al-Hajjaj asked Ibn `Umar, \"How are you?\" Ibn `Umar replied, \"I am all right,\" Al-Hajjaj asked, \"Who wounded you?\" Ibn `Umar replied, \"The person who allowed arms to be carried on the day on which it was forbidden to carry them (he meant Al-Hajjaj).\"",
      "usc_msa_ref": "84",
      "chain": [
        "20307",
        "20309",
        "11509"
      ]
    },
    {
      "id": "sahih-bukhari-3180",
      "hadith_no": "3180",
      "source": "Sahih Bukhari",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "قال أبو موسى حدثنا هاشم بن القاسم، حدثنا إسحاق بن سعيد، عن أبيه، عن أبي هريرة  رضى الله عنه  قال كيف أنتم إذا لم تجتبوا دينارا ولا درهما فقيل له وكيف ترى ذلك كائنا يا أبا هريرة قال إي والذي نفس أبي هريرة بيده عن قول الصادق المصدوق‏.‏ قالوا عم ذاك قال تنتهك ذمة الله وذمة رسوله صلى الله عليه وسلم، فيشد الله عز وجل قلوب أهل الذمة، فيمنعون ما في أيديهم‏.‏",
      "text_en": " Narrated Sa`id:                      Abu Huraira once said (to the people), \"What will your state be when you can get no Dinar or Dirhan (i.e. taxes from the Dhimmis)?\" on that someone asked him, \"What makes you know that this state will take place, O Abu- Hu raira?\" He said, \"By Him in Whose Hands Abu Huraira's life is, I know it through the statement of the true and truly inspired one (i.e. the Prophet).\" The people asked, \"What does the Statement say?\" He replied, \"Allah and His Apostle's asylum granted to Dhimmis, i.e. non-Muslims living in a Muslim territory) will be outraged, and so Allah will make the hearts of these Dhimmis so daring that they will refuse to pay the Jizya they will be supposed to pay.\"",
      "usc_msa_ref": "404",
      "chain": [
        "30170",
        "20390",
        "20309",
        "11509",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3922",
      "hadith_no": "3922",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا الحميدي، حدثنا سفيان، حدثنا إسحاق بن سعيد السعيدي، عن أبيه، عن أم خالد بنت خالد، قالت قدمت من أرض الحبشة وأنا جويرية، فكساني رسول الله صلى الله عليه وسلم خميصة لها أعلام، فجعل رسول الله صلى الله عليه وسلم يمسح الأعلام بيده ويقول ‏\"‏ سناه، سناه ‏\"‏‏.‏ قال الحميدي يعني حسن حسن‏.‏",
      "text_en": " Narrated Um Khalid bint Khalid:                     When I came from Ethiopia (to Medina), I was a young girl. Allah's Apostle made me wear a sheet having marks on it. Allah's Apostle was rubbing those marks with his hands saying, \"Sanah! Sanah!\" (i.e. good, good).",
      "usc_msa_ref": "214",
      "chain": [
        "30418",
        "20005",
        "20309",
        "11509",
        "740"
      ]
    },
    {
      "id": "sahih-bukhari-5572",
      "hadith_no": "5572",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا أحمد بن يعقوب، أخبرنا إسحاق بن سعيد بن عمرو، عن أبيه، أنه سمعه يحدث، عن ابن عمر  رضى الله عنهما  أنه دخل على يحيى بن سعيد وغلام من بني يحيى رابط دجاجة يرميها، فمشى إليها ابن عمر حتى حلها، ثم أقبل بها وبالغلام معه فقال ازجروا غلامكم عن أن يصبر هذا الطير للقتل، فإني سمعت النبي صلى الله عليه وسلم نهى أن تصبر بهيمة أو غيرها للقتل‏.‏",
      "text_en": " Narrated Ibn `Umar:                     that he entered upon Yahya bin Sa`id while one of Yahya's sons was aiming at a hen after tying it. Ibn `Umar walked to it and untied it. Then he brought it and the boy and said. \"Prevent your boys from tying the birds for the sake of killing them, as I have heard the Prophet forbidding the killing of an animal or other living thing after tying them.\"",
      "usc_msa_ref": "422",
      "chain": [
        "20307",
        "20309",
        "11509",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-5882",
      "hadith_no": "5882",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا أبو نعيم، حدثنا إسحاق بن سعيد، عن أبيه، سعيد بن فلان  هو عمرو بن سعيد بن العاص  عن أم خالد بنت خالد، أتي النبي صلى الله عليه وسلم بثياب فيها خميصة سوداء صغيرة فقال ‏\"‏ من ترون نكسو هذه ‏\"‏‏.‏ فسكت القوم قال ‏\"‏ ائتوني بأم خالد ‏\"‏‏.‏ فأتي بها تحمل فأخذ الخميصة بيده فألبسها وقال ‏\"‏ أبلي وأخلقي ‏\"‏‏.‏ وكان فيها علم أخضر أو أصفر فقال ‏\"‏ يا أم خالد هذا سناه ‏\"‏‏.‏ وسناه بالحبشية حسن‏.‏",
      "text_en": " Narrated Um Khalid bint Khalid:                     The Prophet was given some clothes including a black Khamisa. The Prophet said, \"To whom shall we give this to wear?\" The people kept silent whereupon the Prophet said, \"Fetch Um Khalid for me.\" I (Um Khalid) was brought carried (as I was small girl at that time). The Prophet took the Khamisa in his hands and made me wear it and said, \"May you live so long that your dress will wear out and you will mend it many times.\" On the Khamisa there were some green or pale designs (The Prophet saw these designs) and said, \"O Um Khalid! This is Sanah.\" (Sanah in a Ethiopian word meaning beautiful).",
      "usc_msa_ref": "713",
      "chain": [
        "20348",
        "20309"
      ]
    },
    {
      "id": "sahih-bukhari-5906",
      "hadith_no": "5906",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا أبو الوليد، حدثنا إسحاق بن سعيد بن عمرو بن سعيد بن العاص، قال حدثني أبي قال، حدثتني أم خالد بنت خالد، قالت أتي رسول الله صلى الله عليه وسلم بثياب فيها خميصة سوداء قال ‏\"‏ من ترون نكسوها هذه الخميصة ‏\"‏‏.‏ فأسكت القوم‏.‏ قال ‏\"‏ ائتوني بأم خالد ‏\"‏‏.‏ فأتي بي النبي صلى الله عليه وسلم فألبسها بيده وقال ‏\"‏ أبلي وأخلقي ‏\"‏‏.‏ مرتين فجعل ينظر إلى علم الخميصة، ويشير بيده إلى ويقول ‏\"‏ يا أم خالد هذا سنا ‏\"‏‏.‏ والسنا بلسان الحبشية الحسن‏.‏ قال إسحاق حدثتني امرأة من أهلي أنها رأته على أم خالد‏.‏",
      "text_en": " Narrated Um Khalid bint Khalid:                     Some clothes were presented to Allah's Apostle as a gift and there was a black Khamisa with it. The Prophet asked (his companions), \"To whom do you suggest we give this Khamisa?\" The people kept quiet. Then he said, \"Bring me Um Khalid,\" So I was brought to him and he dressed me with it with his own hands and said twice, \"May you live so long that you will wear out many garments.\" He then started looking at the embroidery of that Khamisa and said, \"O Um Khalid! This is Sana!\" (Sana in Ethiopian language means beautiful.) 'Is-haq, a sub-narrator, said: A woman of my family had told me that she had seen the Khamisa worn by Um Khalid.",
      "usc_msa_ref": "736",
      "chain": [
        "20296",
        "20309",
        "11509",
        "740"
      ]
    },
    {
      "id": "sahih-bukhari-6375",
      "hadith_no": "6375",
      "source": "Sahih Bukhari",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا أبو نعيم، حدثنا إسحاق  هو ابن سعيد  عن سعيد، عن ابن عمر  رضى الله عنهما  قال رأيتني مع النبي صلى الله عليه وسلم بنيت بيدي بيتا، يكنني من المطر، ويظلني من الشمس، ما أعانني عليه أحد من خلق الله‏.‏",
      "text_en": " Narrated Ibn `Umar:                     During the life-time of the Prophet I built a house with my own hands so that it might protect me from the rain and shade me from the sun; and none of Allah's creatures assisted me in building it.",
      "usc_msa_ref": "315",
      "chain": [
        "20348",
        "20309",
        "11168",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-6946",
      "hadith_no": "6946",
      "source": "Sahih Bukhari",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا علي، حدثنا إسحاق بن سعيد بن عمرو بن سعيد بن العاص، عن أبيه، عن ابن عمر  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لن يزال المؤمن في فسحة من دينه، ما لم يصب دما حراما ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"A faithful believer remains at liberty regarding his religion unless he kills somebody unlawfully.\"",
      "usc_msa_ref": "2",
      "chain": [
        "30026",
        "20309",
        "11509",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-4024",
      "hadith_no": "4024",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا إسحاق بن الجراح الأذني، حدثنا أبو النضر، حدثنا إسحاق بن سعيد، عن أبيه، عن أم خالد بنت خالد بن سعيد بن العاص، أن رسول الله صلى الله عليه وسلم أتي بكسوة فيها خميصة صغيرة فقال ‏\"‏ من ترون أحق بهذه ‏\"‏ ‏.‏ فسكت القوم فقال ‏\"‏ ائتوني بأم خالد ‏\"‏ ‏.‏ فأتي بها فألبسها إياها ثم قال ‏\"‏ أبلي وأخلقي ‏\"‏ ‏.‏ مرتين وجعل ينظر إلى علم في الخميصة أحمر أو أصفر ويقول ‏\"‏ سناه سناه يا أم خالد ‏\"‏ ‏.‏ وسناه في كلام الحبشة الحسن ‏.‏",
      "text_en": " Narrated Umm Khalid, daughter of Sa'd b. al-'As:                     Once the Messenger of Allah (ﷺ) was brought some garments among which was a small cloak with a border and black stripes. He said: Whom do you think to be more deserving for it ? The people kept silence. He said: Bring Umm Khalid. The she was carried to him and he put it on her, saying: Wear it out and make it ragged twice. Then he went on looking at red or yellow marks on it, and said: This is sanah, sanah, Umm Khalid. It means \"beautiful\" in the language of the Abyssinians.",
      "usc_msa_ref": "",
      "chain": [
        "20390",
        "20309",
        "11509",
        "740"
      ]
    },
    {
      "id": "sunan-abi-daud-4144",
      "hadith_no": "4144",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا هناد بن السري، عن وكيع، عن إسحاق بن سعيد بن عمرو القرشي، عن أبيه، عن ابن عمر، أنه رأى رفقة من أهل اليمن رحالهم الأدم فقال من أحب أن ينظر إلى أشبه رفقة كانوا بأصحاب النبي صلى الله عليه وسلم فلينظر إلى هؤلاء ‏.‏",
      "text_en": " Sa'id ibn Amr al-Qurashi quoting his father said:                      Ibn Umar (once) saw some fellow travellers of the Yemen. They had their saddles (on camels) of leather. He said: If anyone likes to see the fellow travellers most resembling to the Companions of the Messenger of Allah (ﷺ), he should see them.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20032",
        "20309",
        "11509",
        "18"
      ]
    }
  ],
  "total_hadiths": 10
}