{
  "id": "20302",
  "name": "Yahya bin Kathir bin Darham يحيى بن كثير بن درهم العنبري",
  "full_name": "Yahya bin Kathir bin Darham يحيى بن كثير بن درهم العنبري",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "206",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Khurasan",
      " al-Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-'Anbari",
      "Client",
      "al-Khurasani",
      "al-Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "14265",
      "name": "'Uthman bin Sa'd عثمان بن سعد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "32",
      "name": "Mu'adh ibn Jabal ( معاذ بن جبل بن عمرو بن أوس ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "20266",
      "name": "'Umar bin al-'Ala' bin 'Ammar عمر بن العلاء",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "24019",
      "name": "Isma'il bin Suliaman al-Khal al-Dby إسماعيل بن سليمان الكحال",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "24145",
      "name": "Za'id'h bin Abi al-Rqad زائدة بن أبي الرقاد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "24240",
      "name": "'Abdullah bin 'Uthman al-Basri عبد الله بن عثمان البصري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "24276",
      "name": "'Abdul Malik bin Abd عبد الملك بن عبد الله بن محمد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20449",
      "name": "'Ali bin al-Mubark al-Hna'iy علي بن المبارك الهنائي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30153",
      "name": "'Amr bin 'Ali bin Bahr al-Bahli عمرو بن علي بن بحر الباهلي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30160",
      "name": "Muhammad bin Bashar Bindar محمد بن بشار بندار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30172",
      "name": "Muhammad bin Ma'mar bin Rabi' محمد بن معمر بن ربعي القيسي البحراني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "34121",
      "name": "'Abdullah bin al-Haytham bin 'Uthman عبد الله بن الهيثم بن عثمان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38549",
      "name": "Muhammad bin 'Uthman bin Abi Safwan محمد بن عثمان بن أبي صفوان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "34253",
      "name": "Muhammad bin Yazid bin 'Abdul Malik محمد بن يزيد بن عبد الملك",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38834",
      "name": "Hajjaj bin Yusuf bin al-Sha'ir حجاج بن يوسف الشاعر",
      "grade": "3rd Century AH"
    },
    {
      "id": "34204",
      "name": "Muhammad bin Sa'id bin Yazid محمد بن سعيد بن يزيد بن إبراهيم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "34255",
      "name": "Muhammad bin Yonus al-Kadaymi محمد بن يونس بن موسى الكديمي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3624",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا يحيى بن كثير أبو غسان، حدثنا أبو حفص  واسمه عمر بن العلاء أخو أبي عمرو بن العلاء  قال سمعت نافعا، عن ابن عمر  رضى الله عنهما  كان النبي صلى الله عليه وسلم يخطب إلى جذع فلما اتخذ المنبر تحول إليه، فحن الجذع فأتاه فمسح يده عليه‏.‏   وقال عبد الحميد أخبرنا عثمان بن عمر، أخبرنا معاذ بن العلاء، عن نافع، بهذا‏.‏ ورواه أبو عاصم عن ابن أبي رواد، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet used to deliver his sermons while standing beside a trunk of a datepalm. When he had the pulpit made, he used it instead. The trunk started crying and the Prophet went to it, rubbing his hand over it (to stop its crying).",
      "chain": [
        "30170",
        "20302",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2379",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني أبو بكر بن نافع العبدي، حدثنا يحيى بن كثير، حدثنا علي، - يعني ابن المبارك - حدثنا يحيى، عن زيد بن سلام، عن جده أبي سلام، قال حدثني عبد الله، بن فروخ أنه سمع عائشة، تقول قال رسول الله صلى الله عليه وسلم ‏\"‏ خلق كل إنسان ‏\"‏ ‏.‏ بنحو حديث معاوية عن زيد ‏.‏ وقال ‏\"‏ فإنه يمشي يومئذ ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated by 'A'isha through anothr chain of transmitters in which she reported Allah's Messenger (may peace be ulon him) as saying:                     \" Every man is created\" ; the rest of the hadith is the same and he said:\" He walks on that day.\"",
      "chain": [
        "20302",
        "20449",
        "11449",
        "10912",
        "24242"
      ]
    },
    {
      "hadith_no": "3070",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه إبراهيم بن دينار، حدثنا روح، ح وحدثنا أبو داود المباركي، حدثنا أبو شهاب، ح وحدثنا محمد بن المثنى، حدثنا يحيى بن كثير، كلهم عن شعبة، في هذا الإسناد أما روح ويحيى بن كثير فقالا كما قال نصر أهل رسول الله صلى الله عليه وسلم بالحج ‏.‏ وأما أبو شهاب ففي روايته خرجنا مع رسول الله صلى الله عليه وسلم نهل بالحج ‏.‏ وفي حديثهم جميعا فصلى الصبح بالبطحاء ‏.‏ خلا الجهضمي فإنه لم يقله ‏.‏",
      "text_en": " Rauh and Yahya b. Kathir narrated as Nasr reported that the Messenger of Allah (may peace be upon him) entered into the state of Ihram for Hajj. And in the narration of Abu Shihab (the words are):                      We went out with the Messenger of Allah (may peace be upon him) pronouncing Talbiya for Hajj, And in an the ahadith (narrated in this connection the words are): He led the morning prayer at al-Batha', except al- jahdami who did not make mention of it.",
      "chain": [
        "30496",
        "20229",
        "30544",
        "11613",
        "30170",
        "20302"
      ]
    },
    {
      "hadith_no": "5234",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثني يحيى بن كثير العنبري أبو غسان، حدثنا  شعبة، عن مالك بن أنس، عن عمر بن مسلم، عن سعيد بن المسيب، عن أم سلمة، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا رأيتم هلال ذي الحجة وأراد أحدكم أن يضحي فليمسك عن شعره وأظفاره ‏\"‏ ‏.‏",
      "text_en": " Umm Salama reported (these words) directly from Allah's Messenger (may peace be upon him):                      If anyone has in his possession a sacrificial animal to offer as a sacrifice (on 'Id al-Adha), he should not get his hair cut and nails trimmed after he has entered the first days of Dhu'l Hijja",
      "chain": [
        "38834",
        "20302",
        "20020",
        "20001",
        "11002",
        "56"
      ]
    },
    {
      "hadith_no": "2585",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن بشار، حدثني يحيى بن كثير أبو غسان العنبري، عن عثمان بن سعد، عن أنس بن مالك، قال كانت ‏.‏ فذكر مثله ‏.‏ قال أبو داود أقوى هذه الأحاديث حديث سعيد بن أبي الحسن والباقية ضعاف ‏.‏",
      "text_en": " The tradition mentioned above has also been narrated by Anas bin Malik through a different chain of narrators. He mentioned similar words.Abu Dawud said “the strongest of these traditions is the one of Sa’id bin Abu Al Hasan. The rest are weak.",
      "chain": [
        "30160",
        "20302",
        "19"
      ]
    },
    {
      "hadith_no": "4623",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا ابن المثنى، أن يحيى بن كثير العنبري، حدثهم قال كان قرة بن خالد يقول لنا يا فتيان لا تغلبوا على الحسن فإنه كان رأيه السنة والصواب ‏.‏",
      "text_en": " Yahya b. Kathir al-‘Anbari said:                      Qurrah b. Khalid used to tell us: O young people! Do not think that al-Hasan denied predestination, for his opinion (i.e., belief) was sunnah and sight.",
      "chain": [
        "30170",
        "20302",
        "11301"
      ]
    },
    {
      "hadith_no": "223",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عباس العنبري، حدثنا يحيى بن كثير أبو غسان العنبري، عن إسماعيل الكحال، عن عبد الله بن أوس الخزاعي، عن بريدة الأسلمي، عن النبي صلى الله عليه وسلم قال ‏\"‏ بشر المشائين في الظلم إلى المساجد بالنور التام يوم القيامة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه مرفوع هو صحيح مسند وموقوف إلى أصحاب النبي صلى الله عليه وسلم ولم يسند إلى النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Buraidah Al-Aslami narrated that :                     the Prophet said: \"Give glad tiding to those who walk to the Masajid in the dark; of a complete light on the Day of Resurrection.\"",
      "chain": [
        "30437",
        "20302",
        "18502"
      ]
    },
    {
      "hadith_no": "505",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو حفص، عمرو بن علي الفلاس الصيرفي حدثنا عثمان بن عمر، ويحيى بن كثير أبو غسان العنبري، قالا حدثنا معاذ بن العلاء، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم كان يخطب إلى جذع فلما اتخذ النبي صلى الله عليه وسلم المنبر حن الجذع حتى أتاه فالتزمه فسكن ‏\"‏ ‏.‏ قال وفي الباب عن أنس وجابر وسهل بن سعد وأبى بن كعب وابن عباس وأم سلمة ‏.‏ قال أبو عيسى حديث ابن عمر حديث حسن غريب صحيح ‏.‏ ومعاذ بن العلاء هو بصري وهو أخو أبي عمرو بن العلاء ‏.‏",
      "text_en": " Ibn Umar narrated:                     \"The Prophet would give the Khutbah next to the trunk of a date palm. When he [the Prophet] began using the Minbar the trunk cried out for him until he came to it and held it, so it became quiet.\"",
      "chain": [
        "30286",
        "20262",
        "20302",
        "24517",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2202",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو حفص، عمرو بن علي حدثنا يحيى بن كثير أبو غسان العنبري، حدثنا علي بن المبارك، عن يحيى بن أبي كثير، حدثني حية بن حابس التميمي، حدثني أبي أنه، سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا شىء في الهام والعين حق ‏\"‏ ‏.‏",
      "text_en": " \"Hayyah bin Habis At-Tamimi narrated:                      My father narrated that he heard the Messenger of Allah (s.a.w) saying:\"There is nothing to Al-Ham, and the eye is real.\"",
      "chain": [
        "30286",
        "20302",
        "20449",
        "11449",
        "18235"
      ]
    },
    {
      "hadith_no": "3590",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن عمرو بن نبهان بن صفوان البصري الثقفي، حدثنا يحيى بن كثير العنبري أبو غسان، حدثنا سلم بن جعفر، عن الحكم بن أبان، عن عكرمة، عن ابن عباس، قال رأى محمد ربه ‏.‏ قلت أليس الله يقول ‏:‏ ‏(‏ لا تدركه الأبصار وهو يدرك الأبصار ‏)‏ قال ويحك ذاك إذا تجلى بنوره الذي هو نوره وقد رأى محمد ربه مرتين ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated 'Ikrimah:                     that Ibn 'Abbas said: \"Muhammad saw his Lord.\" I said: \"Did Allah not say: No vision can grasp Him, but He grasps all vision (6:103). He said: \"Woe unto you! That is when He manifests His Light. But Muhammad saw his Lord two times.\"",
      "chain": [
        "11220",
        "20302",
        "22071",
        "19904",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4265",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا عباس العنبري، حدثنا يحيى بن كثير العنبري أبو غسان، حدثنا سلم بن جعفر، وكان، ثقة عن الحكم بن أبان، عن عكرمة، قال قيل لابن عباس بعد صلاة الصبح ماتت فلانة لبعض أزواج النبي صلى الله عليه وسلم فسجد فقيل له أتسجد هذه الساعة فقال أليس قد قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا رأيتم آية فاسجدوا ‏\"‏ ‏.‏ فأى آية أعظم من ذهاب أزواج النبي صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Narrated 'Ikrimah:                     \"After Salat As-Subh, it was said to Ibn 'Abbas that so-and-so - one of the wives of the Prophet (ﷺ) - has died, so he prostrated. So it was said to him: 'Do you prostrate at this hour?' So he said: 'Has not the Messenger of Allah (ﷺ) [already] said: 'If you see a sign then prostrate?' Then which sign is grater than the passing of (one of) the wives of the Prophet (ﷺ)?'\"",
      "chain": [
        "30437",
        "20302",
        "22071",
        "19904",
        "11023"
      ]
    },
    {
      "hadith_no": "2223",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا يحيى بن محمد، - هو ابن السكن أبو عبيد الله - قال حدثنا يحيى بن كثير، قال حدثنا شعبة، عن محمد بن أبي يعقوب الضبي، عن أبي نصر الهلالي، عن رجاء بن حيوة، عن أبي أمامة، قال قلت يا رسول الله مرني بعمل ‏.‏ قال ‏\"‏ عليك بالصوم فإنه لا عدل له ‏\"‏ ‏.‏ قلت يا رسول الله مرني بعمل ‏.‏ قال ‏\"‏ عليك بالصوم فإنه لا عدل له ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Umamah said:                     \"I said: 'O Messenger of Allah, tell me of an action (I should do).' He said: 'Take to fasting, for there is nothing equal to it.\"'",
      "chain": [
        "20302",
        "20020",
        "10910",
        "405"
      ]
    },
    {
      "hadith_no": "2871",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن بشار، عن يحيى بن كثير أبو غسان، قال حدثنا شعبة، عن أيوب، عن أبي العالية البراء، عن ابن عباس، قال قدم رسول الله صلى الله عليه وسلم لأربع مضين من ذي الحجة وقد أهل بالحج فصلى الصبح بالبطحاء وقال ‏\"‏ من شاء أن يجعلها عمرة فليفعل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn Abbas said:                     \"The Messenger of Allah came on the fourth day of Dhul-Hijjah having entered Ihram for Hajj. He prayed Subh in Al-Batha and said: 'Whoever wants to make it Umrah, let him do so.'\"",
      "chain": [
        "30160",
        "20302",
        "20020",
        "11015",
        "11618",
        "17"
      ]
    },
    {
      "hadith_no": "5153",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا يحيى بن كثير، قال حدثنا علي بن المبارك، عن يحيى، حدثني أبو شيخ الهنائي، عن أبي حمان، أن معاوية، عام حج جمع نفرا من أصحاب رسول الله صلى الله عليه وسلم في الكعبة فقال لهم أنشدكم الله أنهى رسول الله صلى الله عليه وسلم عن لبس الذهب قالوا نعم ‏.‏ قال وأنا أشهد ‏.‏ خالفه حرب بن شداد رواه عن يحيى عن أبي شيخ عن أخيه حمان ‏.‏",
      "text_en": " It was narrated from Abu Himman:                     That when Mu'awiyah went on Hajj, he gathered together a group of the Companions of the Messenger of Allah [SAW] at the Ka'bah and said to them: \"I adjure you by Allah, did the Messenger of Allah [SAW] forbid wearing gold?\" They said: \"Yes.\" He said: \"And I bear witness to that.\"",
      "chain": [
        "30170",
        "20302",
        "20449",
        "11449"
      ]
    },
    {
      "hadith_no": "466",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عبد الله بن حفص بن هشام بن زيد بن أنس بن مالك، حدثنا يحيى بن كثير أبو النضر، صاحب البصري عن يزيد الرقاشي، عن أنس بن مالك، قال كان رسول الله  صلى الله عليه وسلم  إذا توضأ خلل لحيته وفرج أصابعه مرتين ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"When the Messenger of Allah performed ablution, he ran his fingers through his beard and separated his fingers (to let water run through them) twice.\"",
      "chain": [
        "20302",
        "14422",
        "19"
      ]
    },
    {
      "hadith_no": "3270",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا حاتم بن بكر الضبي أبو عمرو، حدثنا محمد بن بكر البرساني، ح وحدثنا محمد بن سعيد بن يزيد بن إبراهيم، حدثنا أبو قتيبة، ويحيى بن كثير، قالوا حدثنا شعبة، عن مالك بن أنس، عن عمرو بن مسلم، عن سعيد بن المسيب، عن أم سلمة، قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من رأى منكم هلال ذي الحجة فأراد أن يضحي فلا يقربن له شعرا ولا ظفرا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Umm Salamah that the Messenger of Allah (ﷺ)said:                     “Whoever among you sees the new crescent of Dhul-Hijjah andwantsto offer a sacrifice, let him not take anything from his hair ornails.”",
      "chain": [
        "20277",
        "20233",
        "20302",
        "20020",
        "20001",
        "10953",
        "11002",
        "56"
      ]
    }
  ],
  "total_hadiths": 16
}