{
  "id": "20315",
  "name": "al-Husain bin 'Ali bin al-Walid al-Ja'fi الحسين بن علي بن الوليد الجعفي",
  "full_name": "al-Husain bin 'Ali bin al-Walid al-Ja'fi الحسين بن علي بن الوليد الجعفي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "203",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Recitation/Quran"
    ],
    "tags": [
      "al-Ja'fi",
      "Client",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "15088",
      "name": "al-Hasan bin al-Hr bin al-Hakam الحسن بن الحر بن الحكم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20660",
      "name": "'Abdul Majeed bin 'Abdul 'Aziz عبد المجيد بن عبد العزيز بن أبي رواد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20583",
      "name": "Hamza bin Habib al-Zayat حمزة بن حبيب الزيات",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11576",
      "name": "Isra'il bin Musa Abu Musa إسرائيل بن موسى أبو موسى",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20200",
      "name": "Fadayl bin 'Iyyad bin Mas'ud فضيل بن عياض بن مسعود",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20646",
      "name": "Ja'far bin Brqan جعفر بن برقان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30216",
      "name": "Abu Karayb, Muhammad bin al-'Ala' محمد بن العلاء - أبو كريب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30524",
      "name": "Harun bin 'Abdullah al-Hamal هارون بن عبد الله بن مروان الحمال",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30375",
      "name": "Muhammad bin Rafa'i محمد بن رافع",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30506",
      "name": "Shja' bin Mkhld al-Flas شجاع بن مخلد الفلاس أبو الفضل البغوي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30480",
      "name": "Hanad bin al-Sari bin Mus'ab هناد بن السري بن مصعب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30421",
      "name": "Muhammad bin Yahya bin Abi 'Umar محمد بن يحيى بن أبي عمر العدني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30585",
      "name": "'Abbas bin Muhammad bin Hatm عباس بن محمد بن حاتم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30553",
      "name": "'Abd bin Hameed bin Nasr عبد بن حميد بن نصر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38044",
      "name": "Ahmed bin al-Frat bin Khalid أحمد بن الفرات بن خالد",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3331",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا أبو كريب، وموسى بن حزام، قالا حدثنا حسين بن علي، عن زائدة، عن ميسرة الأشجعي، عن أبي حازم، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ استوصوا بالنساء، فإن المرأة خلقت من ضلع، وإن أعوج شىء في الضلع أعلاه، فإن ذهبت تقيمه كسرته، وإن تركته لم يزل أعوج، فاستوصوا بالنساء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah 's Apostle said, \"Treat women nicely, for a women is created from a rib, and the most curved portion of the rib is its upper portion, so, if you should try to straighten it, it will break, but if you leave it as it is, it will remain crooked. So treat women nicely.\"",
      "chain": [
        "30216",
        "30394",
        "20315",
        "20320",
        "11658",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "3672",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا يحيى بن آدم، حدثنا حسين الجعفي، عن أبي موسى، عن الحسن، عن أبي بكرة  رضى الله عنه  أخرج النبي صلى الله عليه وسلم ذات يوم الحسن فصعد به على المنبر، فقال ‏\"‏ ابني هذا سيد، ولعل الله أن يصلح به بين فئتين من المسلمين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     Once the Prophet brought out Al-Hasan and took him up the pulpit along with him and said, \"This son of mine is a Saiyid (i.e. chief) and I hope that Allah will help him bring about reconciliation between two Muslim groups.\"",
      "chain": [
        "30351",
        "20364",
        "20315",
        "30170",
        "11016",
        "3229"
      ]
    },
    {
      "hadith_no": "5240",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا إسحاق بن نصر، حدثنا حسين الجعفي، عن زائدة، عن ميسرة، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من كان يؤمن بالله واليوم الآخر فلا يؤذي جاره ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever believes in Allah and the Last Day should not hurt (trouble) his neighbor. And I advise you to take care of the women, for they are created from a rib and the most crooked portion of the rib is its upper part; if you try to straighten it, it will break, and if you leave it, it will remain crooked, so I urge you to take care of the women.\"",
      "chain": [
        "30311",
        "20315",
        "20320",
        "11658",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "7239",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا حسين الجعفي، قال زائدة ذكره عن هشام، عن الحسن، قال أتينا معقل بن يسار نعوده فدخل عبيد الله فقال له معقل أحدثك حديثا سمعته من رسول الله صلى الله عليه وسلم فقال ‏\"‏ ما من وال يلي رعية من المسلمين، فيموت وهو غاش لهم، إلا حرم الله عليه الجنة ‏\"‏‏.‏",
      "text_en": " Narrated Ma'qil:                     Allah's Apostle said, \"If any ruler having the authority to rule Muslim subjects dies while he is deceiving them, Allah will forbid Paradise for him.\"",
      "chain": [
        "30313",
        "20315",
        "11065",
        "11016"
      ]
    },
    {
      "hadith_no": "7526",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عبدة بن عبد الله، حدثنا حسين الجعفي، عن زائدة، حدثنا بيان بن بشر، عن قيس بن أبي حازم، حدثنا جرير، قال خرج علينا رسول الله صلى الله عليه وسلم ليلة البدر فقال ‏\"‏ إنكم سترون ربكم يوم القيامة كما ترون هذا، لا تضامون في رؤيته ‏\"‏‏.‏",
      "text_en": " Narrated Jarir:                     Allah's Apostle came out to us on the night of the full moon and said, \"You will see your Lord on the Day of Resurrection as you see this (full moon) and you will have no difficulty in seeing Him.\"",
      "chain": [
        "30149",
        "20315",
        "20320",
        "11326",
        "11046",
        "4057"
      ]
    },
    {
      "hadith_no": "348",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني زهير بن حرب، حدثنا وكيع، حدثنا مسعر، وهشام، ح وحدثني إسحاق بن منصور، أخبرنا الحسين بن علي، عن زائدة، عن شيبان، جميعا عن قتادة، بهذا الإسناد مثله ‏.‏",
      "text_en": " The same hadith has been narrated by Zuhair b. Harb, Waki, Ishaq b. Mansur, Husain b. 'Ali.",
      "chain": [
        "30022",
        "20032",
        "20359",
        "11065",
        "30313",
        "20315",
        "20320"
      ]
    },
    {
      "hadith_no": "369",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثناه إسحاق بن إبراهيم، أخبرنا جرير، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، كلاهما عن المختار، عن أنس، عن النبي صلى الله عليه وسلم بهذا الحديث غير أن إسحاق لم يذكر قال ‏\"‏ قال الله إن أمتك ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated by another chain of transmitters with the exception that Ishaq made no mention of this:                      Allah said: Verily your people.",
      "chain": [
        "20028",
        "30201",
        "20315",
        "19"
      ]
    },
    {
      "hadith_no": "382",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني القاسم بن زكرياء، حدثنا حسين، - يعني الجعفي - عن زائدة، عن هشام، قال قال الحسن كنا عند معقل بن يسار نعوده فجاء عبيد الله بن زياد فقال له معقل إني سأحدثك حديثا سمعته من رسول الله صلى الله عليه وسلم ثم ذكر بمعنى حديثهما ‏.‏",
      "text_en": " Hasan reported:                      We were with Ma'qil b. Yasar inquiring about his health that Ubaidullah b. Ziyad came there. Ma'qil said to him: Verily I am going to narrate to you a hadith which I heard from the Messenger of Allah (may peace be upon him). Then he narrated the hadith like those two (mentioned above).",
      "chain": [
        "20315",
        "20320",
        "11065"
      ]
    },
    {
      "hadith_no": "415",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن عبد الله بن ذكوان، عن عبد الرحمن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم ح",
      "text_en": "",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "506",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن المختار بن فلفل، قال قال أنس بن مالك قال النبي صلى الله عليه وسلم ‏\"‏ أنا أول شفيع في الجنة لم يصدق نبي من الأنبياء ما صدقت وإن من الأنبياء نبيا ما يصدقه من أمته إلا رجل واحد ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik said:                      The Apostle of Allah (may peace be upon him) said: I would be the first intercessor in the Paradise and no apostle amongst the apostles has been testified (by such a large number of people) as I have been testified. And verily there woald be an apostle among the apostles who would be testified to by only one man from his people.",
      "chain": [
        "30201",
        "20315",
        "20320",
        "10962",
        "19"
      ]
    },
    {
      "hadith_no": "224",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، قال أبو بكر ووكيع عن إسرائيل، كلهم عن سماك بن حرب، بهذا الإسناد عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this is narrated from the Apostle (may peace be upon him) with the same chain of transmitters by Muhammad b. Muthanna, Ibn Bashshar, Muhammad b. Ja'far, Shu'ba.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "30201",
        "20315",
        "20320",
        "20311",
        "10770",
        "18"
      ]
    },
    {
      "hadith_no": "297",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن منصور، عن إبراهيم، عن الأسود، عن عائشة، قالت كنت أغسل رأس رسول الله صلى الله عليه وسلم وأنا حائض ‏.‏",
      "text_en": " Al-Aswad narrated it from 'A'isha that she observed:                      I used to wash the head of the Messenger of Allah (may peace be upon him), while I was in a state of menstruation.",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "347",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا عبد الوارث بن عبد الصمد، حدثني أبي، عن جدي، عن الحسين، قال يحيى وأخبرني أبو سلمة، أن عروة بن الزبير، أخبره أن أبا أيوب أخبره أنه، سمع ذلك، من رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Ayyub reported that he had heard like this from the Messenger of Allah (may peace be upon him).",
      "chain": [
        "20315",
        "20031",
        "10567",
        "10511",
        "33"
      ]
    },
    {
      "hadith_no": "402",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد بن حميد، حدثنا حسين الجعفي، عن زائدة، عن منصور، بهذا الإسناد مثل حديثهما وذكر في الحديث ‏\"‏ ثم ليتخير بعد من المسألة ما شاء أو ما أحب ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Mansur with the same chain of transmitters and he made a mention of this:                     \" Then he may choose any supplication which pleases him or which he likes.\"",
      "chain": [
        "30553",
        "20315",
        "20320"
      ]
    },
    {
      "hadith_no": "420",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن عبد الملك بن عمير، عن أبي بردة، عن أبي موسى، قال مرض رسول الله صلى الله عليه وسلم فاشتد مرضه فقال ‏\"‏ مروا أبا بكر فليصل بالناس ‏\"‏ ‏.‏ فقالت عائشة يا رسول الله إن أبا بكر رجل رقيق متى يقم مقامك لا يستطع أن يصلي بالناس فقال ‏\"‏ مري أبا بكر فليصل بالناس فإنكن صواحب يوسف ‏\"‏ ‏.‏ قال فصلى بهم أبو بكر حياة رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Musa reported:                      When the Messenger of Allah (may peace be upon him) became ill and illness became serious he ordered Abu Bakr to lead the people in prayer. Upon this 'A'isha said: Messenger of Allah, Abd Bakr is a man of tenderly feelings: when he would stand in your place (he would be so much overwhelmed -by grief that) he would not be able to lead the people in prayer. He (the Holy Prophet) said: You order Abu Bakr to lead the people in prayer, and added: You are like the female companions of Yusuf. So Abu Bakr led the prayer (during this period of illness) in the life of the Messenger of Allah (may peace be upon him).",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11368",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "458",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، حدثنا سماك بن حرب، عن جابر بن سمرة، قال إن النبي صلى الله عليه وسلم كان يقرأ في الفجر ب ‏{‏ ق والقرآن المجيد‏}‏ وكان صلاته بعد تخفيفا ‏.‏",
      "text_en": " Jabir b. Samura reported:                      The Apostle of Allah (may peace be upon him) used to recite in the morning prayer\" Qaf. By the Glorious Quran.\" and his prayer afterward shortened.",
      "chain": [
        "30201",
        "20315",
        "20320",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "503",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني إسحاق بن منصور، وعبد بن حميد، قالا أخبرنا جعفر بن عون، أخبرنا أبو عميس، ح قال وحدثني القاسم بن زكرياء، حدثنا حسين بن علي، عن زائدة، قال حدثنا مالك بن مغول، كلاهما عن عون بن أبي جحيفة، عن أبيه، عن النبي صلى الله عليه وسلم بنحو حديث سفيان وعمر بن أبي زائدة يزيد بعضهم على بعض وفي حديث مالك بن مغول فلما كان بالهاجرة خرج بلال فنادى بالصلاة ‏.‏",
      "text_en": " 'Aun b. Abu Juhaifa narrated from the Apostle of Allah (may peace be upon him) on the authority of his father a hadith like that of Sufyan, and 'Umar b. Abu Za'ida made this addition:                      Some of them tried to excel the others (in obtaining water), and in the hadith transmitted by Malik b. Mighwal (the words are): When it was noon, Bilal came out and summoned (people) to (noon) prayer.",
      "chain": [
        "30313",
        "30553",
        "20416",
        "20315",
        "20320",
        "20358",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "1315",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني القاسم بن زكرياء، حدثنا حسين بن علي الجعفي، عن زائدة، عن سليمان، عن إبراهيم، عن علقمة، عن عبد الله، قال صلينا مع رسول الله صلى الله عليه وسلم فإما زاد أو نقص - قال إبراهيم وايم الله ما جاء ذاك إلا من قبلي - قال فقلنا يا رسول الله أحدث في الصلاة شىء فقال ‏\"‏ لا ‏\"‏ ‏.‏ قال فقلنا له الذي صنع فقال ‏\"‏ إذا زاد الرجل أو نقص فليسجد سجدتين ‏\"‏ ‏.‏ قال ثم سجد سجدتين ‏.‏",
      "text_en": " Abdullah reported:                      We prayed along with the Messenger of Allah (may peace he upon him) and he committed or omitted (something). Ibrahim said: By Allah, this is a misgiving of mine only. We said: Messenger of Allah, is there something new about the prayer? He (the Holy Prophet) said: No. We told him about what he had done. He (the Holy Prophet) said: When a man commits or omits (something in prayer), he should perform two prostrations, and he then himself performed two prostrations.",
      "chain": [
        "20315",
        "20320",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1688",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، قال حدثني عمرو بن يحيى الأنصاري، حدثني محمد بن يحيى بن حبان، عن عمرو بن سليم بن خلدة الأنصاري، عن أبي قتادة، صاحب رسول الله صلى الله عليه وسلم قال دخلت المسجد ورسول الله صلى الله عليه وسلم جالس بين ظهرانى الناس - قال - فجلست فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما منعك أن تركع ركعتين قبل أن تجلس ‏\"‏ ‏.‏ قال فقلت يا رسول الله رأيتك جالسا والناس جلوس ‏.‏ قال ‏\"‏ فإذا دخل أحدكم المسجد فلا يجلس حتى يركع ركعتين ‏\"‏ ‏.‏",
      "text_en": " Abu Qatada, a Companion of the Messenger of Allah (may peace be upon him), said:                      I entered the mosque, when the Messenger of Allah (may peace be upon him) had been sitting among people, and I also sat down among them. Upon this the Messenger of Allah (may peace be upon him) said: What prevented you from offering two rak'ahs (of Nafl prayer) before sitting down? I said: Messenger of Allah, I saw you sitting and people sitting (around you and I, therefore, sat in your company). He (the Holy Prophet) then said: When anyone among you enters the mosque, he should not sit till he has observed two rak'ahs.",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11210",
        "11222",
        "1544"
      ]
    },
    {
      "hadith_no": "1854",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا ليث، عن عقيل، عن الزهري، عن علي بن حسين، أن الحسين بن علي، حدثه عن علي بن أبي طالب، أن النبي صلى الله عليه وسلم طرقه وفاطمة فقال ‏\"‏ ألا تصلون ‏\"‏ ‏.‏ فقلت يا رسول الله إنما أنفسنا بيد الله فإذا شاء أن يبعثنا بعثنا ‏.‏ فانصرف رسول الله صلى الله عليه وسلم حين قلت له ذلك ثم سمعته وهو مدبر يضرب فخذه ويقول ‏\"‏ وكان الإنسان أكثر شىء جدلا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira transmitted it from the Apostle of Allah (may peace be upon him):                      When any one of you goes to sleep, the devil ties three knots at the back of his neck, sealing every knot with:\" You have a long night, so sleep.\" So if one awakes and mentions Allah, a knot will be loosened; if he performs ablution two knots are loosened; and if he prays (all) knots will be loosened, and in the morning he will be active and in good spirits; otherwise we will be in bad spirits and sluggish in the morning.",
      "chain": [
        "30367",
        "20023",
        "11207",
        "11013",
        "11045",
        "20315",
        "5"
      ]
    },
    {
      "hadith_no": "1949",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا عبد بن حميد، حدثنا حسين بن علي الجعفي، عن زائدة، عن منصور، عن شقيق، قال جاء رجل من بني بجيلة يقال له نهيك بن سنان إلى عبد الله فقال إني أقرأ المفصل في ركعة ‏.‏ فقال عبد الله هذا كهذ الشعر لقد علمت النظائر التي كان رسول الله صلى الله عليه وسلم يقرأ بهن سورتين في ركعة ‏.‏",
      "text_en": " Abu Wa'il reported:                      A person came to 'Abdullah b. Mas'ud and said: I recited all the mufassal surahs in one rak'ah during the night. 'Abdullah said: You must have recited hastily like the recitation of poetry. 'Abdullah said: I remember well the manner in which the Messenger of Allah (may peace be upon him) used to combine them, and he then mentioned twenty of the mufassal surahs, and (their combinations in) two in every rak'ah.",
      "chain": [
        "30553",
        "20315",
        "20320",
        "11067",
        "11353"
      ]
    },
    {
      "hadith_no": "2538",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن سماك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، ح . وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت عبد، الرحمن بن القاسم قال سمعت القاسم، يحدث عن عائشة، عن النبي صلى الله عليه وسلم بمثل ذلك ‏.‏",
      "text_en": " This hadith has been narrated on the authority of A'isha through another chain of transmitters.",
      "chain": [
        "30201",
        "20315",
        "20320",
        "10770",
        "10530",
        "10535",
        "53",
        "30170",
        "20173",
        "20020",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "2740",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني أبو كريب، حدثنا حسين، - يعني الجعفي - عن زائدة، عن هشام، عن ابن سيرين، عن أبي هريرة، - رضى الله عنه - عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تختصوا ليلة الجمعة بقيام من بين الليالي ولا تخصوا يوم الجمعة بصيام من بين الأيام إلا أن يكون في صوم يصومه أحدكم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) as saying:                      Do not single out the night (preceding) Friday among the nights for prayer and do not single out Friday among days for fasting but only when anyone among you is accustomed to fast (on dates) which coincide with this day (Friday).",
      "chain": [
        "30216",
        "20315",
        "20320",
        "11065",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "2750",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني أحمد بن عمر الوكيعي، حدثنا حسين بن علي، عن زائدة، عن سليمان، عن مسلم البطين، عن سعيد بن جبير، عن ابن عباس، - رضى الله عنهما - قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله إن أمي ماتت وعليها صوم شهر أفأقضيه عنها فقال ‏\"‏ لو كان على أمك دين أكنت قاضيه عنها ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فدين الله أحق أن يقضى ‏\"‏ ‏.‏ قال سليمان فقال الحكم وسلمة بن كهيل جميعا ونحن جلوس حين حدث مسلم بهذا الحديث فقالا سمعنا مجاهدا يذكر هذا عن ابن عباس‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with them) reported:                      A man came to the Apostle of Allah (may peace be upon him) and said: Messenger of Allah, my mother has died (in a state) that she had to observe fasts of a month (of Ramadan). Should I complete (them) on her behalf? thereupon he (the Holy Prophet) said: Would you not pay the debt if your mother had died (without paying it)? He said: Yes. He (the Holy Prophet) said: The debt of Allah deserves more that it should he paid.",
      "chain": [
        "39005",
        "20315",
        "20320",
        "11060",
        "11393",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2814",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن عبد الملك، بن عمير بهذا الإسناد في ذكر الصيام عن النبي صلى الله عليه وسلم ‏.‏ بمثله ‏.‏",
      "text_en": " A hadith like this has been reported from the Apostle of Allah (may peace be upon him) by 'Abd al-Malik with the same chain of transmitters in connection with fast.",
      "chain": [
        "30201",
        "20315",
        "20320"
      ]
    },
    {
      "hadith_no": "3396",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي الجعفي، عن زائدة، عن سليمان، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ المدينة حرم فمن أحدث فيها حدثا أو آوى محدثا فعليه لعنة الله والملائكة والناس أجمعين لا يقبل منه يوم القيامة عدل ولا صرف ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) as saying:                      Medina is a sacred territory, so he who made any innovation in it. or gave protection to an innovator, there is upon him the curse of Allah, that of the angels and that of all the people. There would not be accepted on the Day of Resurrection either obligatory acts or supererogatory acts from him.",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3554",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثناه خلف بن هشام، حدثنا حماد بن زيد، ح وحدثنيه زهير بن حرب، حدثنا سفيان بن عيينة، ح وحدثنا إسحاق بن إبراهيم، عن الدراوردي، ح وحدثنا أبو بكر بن، أبي شيبة حدثنا حسين بن علي، عن زائدة، كلهم عن أبي حازم، عن سهل بن سعد، بهذا الحديث يزيد بعضهم على بعض غير أن في حديث زائدة قال ‏\"‏ انطلق فقد زوجتكها فعلمها من القرآن ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Sahl b. Sa'd with a minor alteration of words, but the hadith transmitted through Za'idah (the words are that the Holy Prophet) said:                      Go, I have married her to you, and you teach her something of the Qur'an.",
      "chain": [
        "30503",
        "20022",
        "20005",
        "30123",
        "20167",
        "30201",
        "20315",
        "11349",
        "399"
      ]
    },
    {
      "hadith_no": "3680",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثناه محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، ح وحدثنا عبيد الله بن معاذ، حدثنا أبي قالا، جميعا حدثنا شعبة، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثني زهير بن حرب، حدثنا عبد الرحمن بن مهدي، جميعا عن سفيان، ح وحدثنا عبد بن حميد، حدثنا حسين الجعفي، عن زائدة، كلهم عن أشعث بن أبي الشعثاء، بإسناد أبي الأحوص كمعنى حديثه غير أنهم قالوا ‏\"‏ من المجاعة ‏\".",
      "text_en": " This hadith is narrated on the authority of Abu al-Ahwas with another chain of transmitters and a slight variation of words.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "30150",
        "20286",
        "20020",
        "30201",
        "20032",
        "30022",
        "20005",
        "30553",
        "20315"
      ]
    },
    {
      "hadith_no": "3720",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن ميسرة، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من كان يؤمن بالله واليوم الآخر فإذا شهد أمرا فليتكلم بخير أو ليسكت واستوصوا بالنساء فإن المرأة خلقت من ضلع وإن أعوج شىء في الضلع أعلاه إن ذهبت تقيمه كسرته وإن تركته لم يزل أعوج استوصوا بالنساء خيرا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) as saying:                      He who believes in Allah and the Hereafter, if he witnesses any matter he should talk in good terms about it or keep quiet. Act kindly towards woman, for woman is created from a rib, and the most crooked part of the rib is its top. If you attempt to straighten it, you will break it, and if you leave it, its crookedness will remain there. So act kindly towards women.",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11658",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "3838",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Invoking Curses - كتاب اللعان",
      "chapter_no": "20",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن عبد الملك، بن عمير بهذا الإسناد مثله ‏.‏ وقال غير مصفح ‏.‏ ولم يقل عنه ‏.‏",
      "text_en": " A hadith like this has been transmitted on the authority, of 'Abd al-Malik b. Umair with the same chain of narraters but with a slight change of words.",
      "chain": [
        "30201",
        "20315",
        "20320"
      ]
    },
    {
      "hadith_no": "3855",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن سماك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، ‏.‏ أنها اشترت بريرة من أناس من الأنصار ‏.‏ واشترطوا الولاء فقال رسول الله صلى الله عليه وسلم ‏\"‏ الولاء لمن ولي النعمة ‏\"‏ ‏.‏ وخيرها رسول الله صلى الله عليه وسلم وكان زوجها عبدا وأهدت لعائشة لحما فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو صنعتم لنا من هذا اللحم ‏\"‏ ‏.‏ قالت عائشة تصدق به على بريرة ‏.‏ فقال ‏\"‏ هو لها صدقة ولنا هدية ‏\"‏ ‏.‏",
      "text_en": " 'A'isha (Allah's be pleased with her) reported that she had bought Barira from the people of Ansar, but they laid down the condition that the right of inheritance (would vest in them), whereupon Allah's Messenger (may peace be upon him) said:                      The right of inheritance vests with one who shows favour (who emancipates) and Allah's Messenger (may peacebe upon him) gave her the choice (either to retain) her matrimonial alliance or break it). Her husband was a slave. She (Barira also) gave 'A'isha some meat as gift. Allah's Messenger (may peace be upon him) said: I wish you could prepare (cook) for us out of this meat. 'A'isha said, It has been given as charity to Barira, whereupon he said: That is charity for her and gift for us.",
      "chain": [
        "30201",
        "20315",
        "20320",
        "10770",
        "10530",
        "10535"
      ]
    },
    {
      "hadith_no": "3865",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي الجعفي، عن زائدة، عن سليمان، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من تولى قوما بغير إذن مواليه فعليه لعنة الله والملائكة والناس أجمعين لا يقبل منه يوم القيامة عدل ولا صرف ‏\"‏ ‏.‏ وحدثنيه إبراهيم بن دينار، حدثنا عبيد الله بن موسى، حدثنا شيبان، عن الأعمش، بهذا الإسناد غير أنه قال ‏\"‏ ومن والى غير مواليه بغير إذنهم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) as saying:                      He who took the freed slave as his ally without the consent of his previous master, there is upon him the curse of Allah and that of His angels and that of the whole mankind, and there will not be accepted from him his obligatory acts or supercrogatory acts on the Day of Resurrection. This hadith is narrated through the same chain of transmitters, but with a slight change of words.",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "4301",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Bequests - كتاب الوصية",
      "chapter_no": "26",
      "text_ar": "وحدثني القاسم بن زكرياء، حدثنا حسين بن علي، عن زائدة، عن عبد الملك، بن عمير عن مصعب بن سعد، عن أبيه، قال عادني النبي صلى الله عليه وسلم فقلت أوصي بمالي كله ‏.‏ قال ‏\"‏ لا ‏\"‏ ‏.‏ قلت فالنصف ‏.‏ قال ‏\"‏ لا ‏\"‏ ‏.‏ فقلت أبالثلث فقال ‏\"‏ نعم والثلث كثير ‏\"‏ ‏.‏",
      "text_en": " Ibn Sa'd reported his father as saying:                      Allah's Apostle (may peace be upon him) visited me during my illness. I said: I am willing away the whole of my property. He said: No. I said: Then half? He said: No. I said: Should I will away one-third? He said: Yes, and even one-third is enough.",
      "chain": [
        "20315",
        "20320",
        "11368",
        "10556",
        "9"
      ]
    },
    {
      "hadith_no": "4588",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "وحدثناه يحيى بن يحيى، أخبرنا هشيم، ح وحدثنا شيبان بن فروخ، حدثنا حماد بن سلمة، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، ح وحدثنا محمد، بن المثنى حدثنا محمد بن جعفر، ح وحدثنا عبيد الله بن معاذ، حدثنا أبي كلاهما، عن شعبة، ح وحدثنا أبو كريب، حدثنا حسين بن علي، عن زائدة، كل هؤلاء عن عبد الملك، بن عمير عن عبد الرحمن بن أبي بكرة، عن أبيه، عن النبي صلى الله عليه وسلم ‏.‏ بمثل حديث أبي عوانة ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Abd al-Rahman b. Abu Bakra through another chain of transmitters.",
      "chain": [
        "30399",
        "20468",
        "20656",
        "20021",
        "30201",
        "20032",
        "20012",
        "30170",
        "20173",
        "30150",
        "20020",
        "30216",
        "20315"
      ]
    },
    {
      "hadith_no": "5207",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثنيه القاسم بن زكرياء، حدثنا حسين بن علي، عن زائدة، عن سعيد بن مسروق، بهذا الإسناد الحديث إلى آخره بتمامه وقال فيه وليست معنا مدى أفنذبح بالقصب",
      "text_en": "",
      "chain": [
        "20315",
        "20320",
        "20016"
      ]
    },
    {
      "hadith_no": "6629",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، وعبد الله بن عمر بن أبان، كلهم عن حسين، - قال أبو بكر حدثنا حسين بن علي الجعفي، - عن مجمع بن يحيى، عن سعيد بن أبي بردة، عن أبي بردة، عن أبيه، قال صلينا المغرب مع رسول الله صلى الله عليه وسلم ثم قلنا لو جلسنا حتى نصلي معه العشاء - قال - فجلسنا فخرج علينا فقال ‏\"‏ ما زلتم ها هنا ‏\"‏ ‏.‏ قلنا يا رسول الله صلينا معك المغرب ثم قلنا نجلس حتى نصلي معك العشاء قال ‏\"‏ أحسنتم أو أصبتم ‏\"‏ ‏.‏ قال فرفع رأسه إلى السماء وكان كثيرا مما يرفع رأسه إلى السماء فقال ‏\"‏ النجوم أمنة للسماء فإذا ذهبت النجوم أتى السماء ما توعد وأنا أمنة لأصحابي فإذا ذهبت أتى أصحابي ما يوعدون وأصحابي أمنة لأمتي فإذا ذهب أصحابي أتى أمتي ما يوعدون ‏\"‏ ‏.‏",
      "text_en": " Abu Burda reported on the authority of his father:                      We offered the sunset prayer along with Allah's Apostle (may peace be upon him). We then said: If we sit (along with Allah's Messenger) and observe night prayer with him it would be very good, so we sat down and he came to us and said: You are still sitting here. I said: Allah's Messenger, we observed evening prayer with you, then we said: Let us sit down and observe night prayer along with you, whereupon he said: You have done well or you have done right. He then lifted his head towards the sky and it often happened that as he lifted his head towards the sky, he said: The stars are a source of security for the sky and when the stars disappear there comes to the sky, i. e. (it meets the same fate) as it has been promised (it would plunge into darkness). And I am a source of safety and security to my Companions and when I would go away there would fall to the lot (of my Companions) as they have been promised with and my Companions are a source of security for the Umma and as they would go there would fall to the lot of my Umma as (its people) have been promised.",
      "chain": [
        "30201",
        "30123",
        "11278",
        "20436",
        "20315",
        "10821",
        "11345",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "6641",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وشجاع بن مخلد، - واللفظ لأبي بكر - قالا حدثنا  حسين، - وهو ابن علي الجعفي - عن زائدة، عن السدي، عن عبد الله البهي، عن عائشة، قالت سأل رجل النبي صلى الله عليه وسلم أى الناس خير قال ‏\"‏ القرن الذي أنا فيه ثم الثاني ثم الثالث ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported that a person asked Allah's Apostle (may peace be upon him) as to who amongst the people were the best. He said:                      Of the generation to which I belong, then of the second generation (generation adjacent to my generation), then of the third generation (generation adjacent to the second generation).",
      "chain": [
        "30201",
        "30506",
        "20315",
        "20320",
        "10743",
        "10939",
        "53"
      ]
    },
    {
      "hadith_no": "6670",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو كريب، أخبرنا ابن بشر، عن مسعر، ح وحدثني محمد بن حاتم، حدثنا  معاوية بن عمرو، عن أبي إسحاق، ح وحدثني القاسم بن زكرياء، حدثنا حسين بن علي، الجعفي عن زائدة، كلاهما عن الأعمش، جميعا عن حبيب، بهذا الإسناد مثله ‏.‏",
      "text_en": "",
      "chain": [
        "30216",
        "20359",
        "38487",
        "20389",
        "11049",
        "20315"
      ]
    },
    {
      "hadith_no": "6961",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Knowledge - كتاب العلم",
      "chapter_no": "48",
      "text_ar": "وحدثني القاسم بن زكرياء، حدثنا حسين الجعفي، عن زائدة، عن سليمان، عن  شقيق، قال كنت جالسا مع عبد الله وأبي موسى وهما يتحدثان فقالا قال رسول الله صلى الله عليه وسلم بمثل حديث وكيع وابن نمير ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Abdullah (b. Mas'ud) and Abu Musa (al-Asha'ri) through other chains of transmitters.",
      "chain": [
        "20315",
        "20320",
        "11060",
        "11353"
      ]
    },
    {
      "hadith_no": "7084",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن الحسن بن، عبيد الله عن إبراهيم بن سويد، عن عبد الرحمن بن يزيد، عن عبد الله، قال كان رسول الله صلى الله عليه وسلم إذا أمسى قال ‏\"‏ أمسينا وأمسى الملك لله والحمد لله لا إله إلا الله وحده لا شريك له اللهم إني أسألك من خير هذه الليلة وخير ما فيها وأعوذ بك من شرها وشر ما فيها اللهم إني أعوذ بك من الكسل والهرم وسوء الكبر وفتنة الدنيا وعذاب القبر ‏\"‏ ‏.‏ قال الحسن بن عبيد الله وزادني فيه زبيد عن إبراهيم بن سويد عن عبد الرحمن بن يزيد عن عبد الله رفعه أنه قال ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير ‏\"‏ ‏.‏",
      "text_en": " Abdullah reported that when it was evening Allah's Messenger (may peace be upon him) used to supplicate:                     \" We have entered upon evening and so has the Kingdom of Allah entere d upon evening; praise is due to Allah, there is no god but Allah the One, and there is no partner with Him. O Allah, I beg of Thee the blessing of this night and the blessing of that which lies in it. I seek refuge in Thee from the evil of it and what lies in it. O Allah, I seek refuge in Thee from sloth, from decrepitude, from the evil of vanity, from trial of the world, and from torment of the grave.\" Zubaid, through another chain of transmitters, has narrated on the authority of Abdullah directly this addition:\" There is no god but Allah, the One, there is no partner with Him, His is the Sovereignty and to Him is praise due and He is Potent over everything.\"",
      "chain": [
        "30201",
        "20315",
        "20320",
        "10755",
        "10887",
        "20395",
        "18"
      ]
    },
    {
      "hadith_no": "112",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا الحسن بن علي الحلواني، حدثنا الحسين بن علي الجعفي، عن زائدة، حدثنا خالد بن علقمة الهمداني، عن عبد خير، قال صلى علي رضى الله عنه الغداة ثم دخل الرحبة فدعا بماء فأتاه الغلام بإناء فيه ماء وطست - قال - فأخذ الإناء بيده اليمنى فأفرغ على يده اليسرى وغسل كفيه ثلاثا ثم أدخل يده اليمنى في الإناء فتمضمض ثلاثا واستنشق ثلاثا ‏.‏ ثم ساق قريبا من حديث أبي عوانة قال ثم مسح رأسه مقدمه ومؤخره مرة ‏.‏ ثم ساق الحديث نحوه ‏.‏",
      "text_en": " ‘Abd Khair said :                      ‘All offered the dawn prayer and went to Rahbah (a locality in Kufah). He called for water. A boy brought him a vessel containing water and a wash-basin. He held the vessel with his right hand and poured water over his left hand. He washed both of his hands (to the wrist) three times. He then put his right hand in the vessel ( to take water) and rinsed his mouth three times and snuffed up water three times. He then narrated almost the same tradition as narrated by Abu ‘Awanah. He then wiped his head, both its front and back sides, once. He then narrated the tradition in like manner.",
      "chain": [
        "30115",
        "20315",
        "20320",
        "18243",
        "19874",
        "5"
      ]
    },
    {
      "hadith_no": "375",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد بن مسرهد، والربيع بن نافع أبو توبة، - المعنى - قالا حدثنا أبو الأحوص، عن سماك، عن قابوس، عن لبابة بنت الحارث، قالت كان الحسين بن علي - رضى الله عنه - في حجر رسول الله صلى الله عليه وسلم فبال عليه فقلت البس ثوبا وأعطني إزارك حتى أغسله قال ‏\"‏ إنما يغسل من بول الأنثى وينضح من بول الذكر ‏\"‏ ‏.‏",
      "text_en": " Narrated Lubabah daughter of al-Harith:                     Al-Husayn ibn Ali was (sitting) in the lap of the Messenger of Allah (ﷺ). He passed water on him. I said: Put on (another) clothe, and give me your wrapper to wash. He said: The urine of a female child should be washed (thoroughly) and the urine of a male child should be sprinkled over.",
      "chain": [
        "30175",
        "30335",
        "20327",
        "10770",
        "15453",
        "17635",
        "20315"
      ]
    },
    {
      "hadith_no": "455",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا حسين بن علي، عن زائدة، عن هشام بن عروة، عن أبيه، عن عائشة، قالت أمر رسول الله صلى الله عليه وسلم ببناء المساجد في الدور وأن تنظف وتطيب ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) commanded us to build mosques in different localities (i.e. in the locality of each tribe separately)  and that they should be kept clean and be perfumed.",
      "chain": [
        "30216",
        "20315",
        "20320",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "792",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن سليمان، عن أبي صالح، عن بعض، أصحاب النبي صلى الله عليه وسلم قال قال النبي صلى الله عليه وسلم لرجل ‏\"‏ كيف تقول في الصلاة ‏\"‏ ‏.‏ قال أتشهد وأقول اللهم إني أسألك الجنة وأعوذ بك من النار أما إني لا أحسن دندنتك ولا دندنة معاذ ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ حولها ندندن ‏\"‏ ‏.‏",
      "text_en": " Narrated Some Companions of the Prophet:                     AbuSalih reported on the authority of some Companions of the Prophet (ﷺ): The Prophet (ﷺ) said to a person: what do you say in prayer? He replied: I first recite tashahhud (supplication recited in sitting position), and then I say: O Allah, I ask Thee for Paradise, and I seek refuge in Thee from Hell-Fire, but I do not understand your sound and the sound of Mu'adh (what you say or he says in prayer). The Prophet (ﷺ) said: We too go around it (paradise and Hell-fire).",
      "chain": [
        "30203",
        "20315",
        "20320",
        "11060",
        "11161"
      ]
    },
    {
      "hadith_no": "1047",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا حسين بن علي، عن عبد الرحمن بن يزيد بن جابر، عن أبي الأشعث الصنعاني، عن أوس بن أوس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من أفضل أيامكم يوم الجمعة فيه خلق آدم وفيه قبض وفيه النفخة وفيه الصعقة فأكثروا على من الصلاة فيه فإن صلاتكم معروضة على ‏\"‏ ‏.‏ قال قالوا يا رسول الله وكيف تعرض صلاتنا عليك وقد أرمت يقولون بليت ‏.‏ فقال ‏\"‏ إن الله عز وجل حرم على الأرض أجساد الأنبياء ‏\"‏ ‏.‏",
      "text_en": " Narrated Aws ibn Aws:                     The Prophet (ﷺ) said: Among the most excellent of your days is Friday; on it Adam was created, on it he died, on it the last trumpet will be blown, and on it the shout will be made, so invoke more blessings on me that day, for your blessings will be submitted to me.  The people asked: Messenger of Allah, how can it be that our blessings will be submitted to you while your body is decayed? He replied: Allah, the Exalted, has prohibited the earth from consuming the bodies of Prophets.",
      "chain": [
        "30524",
        "20315",
        "20395",
        "10917",
        "3214"
      ]
    },
    {
      "hadith_no": "1531",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا الحسن بن علي، حدثنا الحسين بن علي الجعفي، عن عبد الرحمن بن يزيد بن جابر، عن أبي الأشعث الصنعاني، عن أوس بن أوس، قال قال النبي صلى الله عليه وسلم ‏\"‏ إن من أفضل أيامكم يوم الجمعة فأكثروا على من الصلاة فيه فإن صلاتكم معروضة على ‏\"‏ ‏.‏ قال فقالوا يا رسول الله وكيف تعرض صلاتنا عليك وقد أرمت قال يقولون بليت ‏.‏ قال ‏\"‏ إن الله تبارك وتعالى حرم على الأرض أجساد الأنبياء صلى الله عليهم ‏\"‏ ‏.‏",
      "text_en": " Aws b. Was reported the Messenger of Allah (ﷺ) as saying:                      Among the most excellent of your days in Friday ; so invoke many blessings on me on that day, for your blessing will be submitted to me. They (the Companions) asked: Messenger of Allah, how can our blessing be submitted to you, when your body is decayed ? He said: Allah has prohibited the earth from consuming the bodies of Prophets.",
      "chain": [
        "30115",
        "20315",
        "20395",
        "10917",
        "3214"
      ]
    },
    {
      "hadith_no": "1614",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا الهيثم بن خالد الجهني، حدثنا حسين بن علي الجعفي، عن زائدة، حدثنا عبد العزيز بن أبي رواد، عن نافع، عن عبد الله بن عمر، قال كان الناس يخرجون صدقة الفطر على عهد رسول الله صلى الله عليه وسلم صاعا من شعير أو تمر أو سلت أو زبيب ‏.‏ قال قال عبد الله فلما كان عمر - رضى الله عنه - وكثرت الحنطة جعل عمر نصف صاع حنطة مكان صاع من تلك الأشياء ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The people during the lifetime of the Messenger of Allah (ﷺ) used to bring forth the sadaqah at the end of Ramadan when closing the fast one sa' of barley whose straw is removed, or of raisins. Abdullah said: When Umar (Allah be pleased with him) succeeded, and the wheat became abundant, Umar prescribed half a sa' of wheat instead of all these things.",
      "chain": [
        "35162",
        "20315",
        "20320",
        "20739",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1665",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، حدثنا مصعب بن محمد بن شرحبيل، حدثني يعلى بن أبي يحيى، عن فاطمة بنت حسين، عن حسين بن علي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ للسائل حق وإن جاء على فرس ‏\"‏ ‏.‏",
      "text_en": " Narrated Ali ibn Abu Talib:                     The Prophet (ﷺ) said: A beggar has the right though he may be riding (a horse).",
      "chain": [
        "28531",
        "20012",
        "13121",
        "20315"
      ]
    },
    {
      "hadith_no": "2234",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا حسين بن علي، والوليد بن عقبة، عن زائدة، عن سماك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، أن بريرة، خيرها رسول الله صلى الله عليه وسلم وكان زوجها عبدا ‏.‏",
      "text_en": " A’ishah said “The Prophet (ﷺ) gave her choice. Her husband was a slave.”",
      "chain": [
        "30203",
        "20315",
        "20320",
        "10770",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "2340",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن بكار بن الريان، حدثنا الوليد، - يعني ابن أبي ثور ح وحدثنا الحسن بن علي، حدثنا الحسين، - يعني الجعفي - عن زائدة، - المعنى - عن سماك، عن عكرمة، عن ابن عباس، قال جاء أعرابي إلى النبي صلى الله عليه وسلم فقال إني رأيت الهلال - قال الحسن في حديثه يعني رمضان - فقال ‏\"‏ أتشهد أن لا إله إلا الله ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ أتشهد أن محمدا رسول الله ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ يا بلال أذن في الناس فليصوموا غدا ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     A bedouin came to the Prophet (ﷺ) and said: I have sighted the moon. Al-Hasan added in his version: that is, of Ramadan. He asked: Do you testify that there is no god but Allah? He replied: Yes. He again asked: Do you testify that Muhammad is the Messenger of Allah? He replied: Yes. and he testified that he had sighted the moon. He said: Bilal, announce to the people that they must fast tomorrow.",
      "chain": [
        "30512",
        "27362",
        "30",
        "20315",
        "10770",
        "11023",
        "17"
      ]
    }
  ],
  "total_hadiths": 99
}