{
  "id": "20318",
  "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
  "full_name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "201",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "Quraish",
      "Client",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11325",
      "name": "Bryd bin 'Abdullah بريد بن عبد الله بن أبي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11303",
      "name": "Kahmas bin al-Hasan al-Tamimi كهمس بن الحسن التميمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11853",
      "name": "Sa'd bin Sa'id bin Qays bin 'Amr سعد بن سعيد بن قيس بن عمرو الأنصاري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11718",
      "name": "Fatr bin Khalifa فطر بن خليفة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11220",
      "name": "Muhammad bin 'Amr bin 'Alqama محمد بن عمرو بن علقمة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11311",
      "name": "Hisham bin Hassan al-Azdi هشام بن حسان الأزدي القردوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "20002",
      "name": "Imam Shafi'ee ابو عبد الله محمد بن إدريس الشافعي",
      "grade": "Succ. (Taba' Tabi') [9th generation] [Shafi'ee]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30498",
      "name": "Ibrahim bin Sa'id al-Juhari إبراهيم بن سعيد الجوهري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30115",
      "name": "al-Hasan bin 'Ali al-Halwani الحسن بن علي الخلال الحلواني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30375",
      "name": "Muhammad bin Rafa'i محمد بن رافع",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30212",
      "name": "Muhammad bin 'Abdullah bin Numayr محمد بن عبد الله بن نمير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30277",
      "name": "Mahmud bin Ghaylan محمود بن غيلان العدوي مولاهم أبو أحمد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30480",
      "name": "Hanad bin al-Sari bin Mus'ab هناد بن السري بن مصعب",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "79",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن العلاء، قال حدثنا حماد بن أسامة، عن بريد بن عبد الله، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ مثل ما بعثني الله به من الهدى والعلم كمثل الغيث الكثير أصاب أرضا، فكان منها نقية قبلت الماء، فأنبتت الكلأ والعشب الكثير، وكانت منها أجادب أمسكت الماء، فنفع الله بها الناس، فشربوا وسقوا وزرعوا، وأصابت منها طائفة أخرى، إنما هي قيعان لا تمسك ماء، ولا تنبت كلأ، فذلك مثل من فقه في دين الله ونفعه ما بعثني الله به، فعلم وعلم، ومثل من لم يرفع بذلك رأسا، ولم يقبل هدى الله الذي أرسلت به ‏\"‏‏.‏ قال أبو عبد الله قال إسحاق وكان منها طائفة قيلت الماء‏.‏ قاع يعلوه الماء، والصفصف المستوي من الأرض‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"The example of guidance and knowledge with which Allah has sent me is like abundant rain falling on the earth, some of which was fertile soil that absorbed rain water and brought forth vegetation and grass in abundance. (And) another portion of it was hard and held the rain water and Allah benefited the people with it and they utilized it for drinking, making their animals drink from it and for irrigation of the land for cultivation. (And) a portion of it was barren which could neither hold the water nor bring forth vegetation (then that land gave no benefits). The first is the example of the person who comprehends Allah's religion and gets benefit (from the knowledge) which Allah has revealed through me (the Prophets and learns and then teaches others. The last example is that of a person who does not care for it and does not take Allah's guidance revealed through me (He is like that barren land.)\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "92",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن العلاء، قال حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، قال سئل النبي صلى الله عليه وسلم عن أشياء كرهها، فلما أكثر عليه غضب، ثم قال للناس ‏\"‏ سلوني عما شئتم ‏\"‏‏.‏ قال رجل من أبي قال ‏\"‏ أبوك حذافة ‏\"‏‏.‏ فقام آخر فقال من أبي يا رسول الله فقال ‏\"‏ أبوك سالم مولى شيبة ‏\"‏‏.‏ فلما رأى عمر ما في وجهه قال يا رسول الله، إنا نتوب إلى الله عز وجل‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet was asked about things which he did not like, but when the questioners insisted, the Prophet got angry. He then said to the people, \"Ask me anything you like.\" A man asked, \"Who is my father?\" The Prophet replied, \"Your father is Hudhafa.\" Then another man got up and said, \"Who is my father, O Allah's Apostle ?\" He replied, \"Your father is Salim, Maula (the freed slave) of Shaiba.\" So when `Umar saw that (the anger) on the face of the Prophet he said, \"O Allah's Apostle! We repent to Allah (Our offending you).",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "147",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا زكرياء، قال حدثنا أبو أسامة، عن هشام بن عروة، عن أبيه، عن عائشة، عن النبي صلى الله عليه وسلم قال ‏\"‏ قد أذن أن تخرجن في حاجتكن ‏\"‏‏.‏ قال هشام يعني البراز‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet said to his wives, \"You are allowed to go out to answer the call of nature. \"",
      "chain": [
        "11338",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "196",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن العلاء، قال حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، أن النبي صلى الله عليه وسلم دعا بقدح فيه ماء، فغسل يديه ووجهه فيه ومج فيه‏.‏",
      "text_en": " Narrated Abu Musa:                     Once the Prophet asked for a tumbler containing water. He washed his hands and face in it and also threw a mouthful of water in it.",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "317",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا عبيد بن إسماعيل، قال حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة، قالت خرجنا موافين لهلال ذي الحجة، فقال رسول الله صلى الله عليه وسلم ‏\"‏ من أحب أن يهل بعمرة فليهلل، فإني لولا أني أهديت لأهللت بعمرة ‏\"‏‏.‏ فأهل بعضهم بعمرة، وأهل بعضهم بحج، وكنت أنا ممن أهل بعمرة، فأدركني يوم عرفة وأنا حائض، فشكوت إلى النبي صلى الله عليه وسلم فقال ‏\"‏ دعي عمرتك، وانقضي رأسك وامتشطي، وأهلي بحج ‏\"‏‏.‏ ففعلت حتى إذا كان ليلة الحصبة أرسل معي أخي عبد الرحمن بن أبي بكر، فخرجت إلى التنعيم، فأهللت بعمرة مكان عمرتي‏.‏ قال هشام ولم يكن في شىء من ذلك هدى ولا صوم ولا صدقة‏.‏",
      "text_en": " Narrated `Aisha:                     On the 1st of Dhul-Hijja we set out with the intention of performing Hajj. Allah's Apostle said, \"Any one who likes to assume the Ihram for `Umra he can do so. Had I not brought the Hadi with me, I would have assumed the Ihram for `Umra. \"Some of us assumed the Ihram for `Umra while the others assumed the Ihram for Hajj. I was one of those who assumed the Ihram for `Umra. I got menses and kept on menstruating until the day of `Arafat and complained of that to the Prophet . He told me to postpone my `Umra, undo and comb my hair, and to assure the Ihram of Hajj and I did so. On the right of Hasba, he sent my brother `Abdur-Rahman bin Abi Bakr with me to at-Tan`im, where I assumed the Ihram for `Umra in lieu of the previous one. Hisham said, \"For that (`Umra) no Hadi, fasting or alms were required.",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "325",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن أبي رجاء، قال حدثنا أبو أسامة، قال سمعت هشام بن عروة، قال أخبرني أبي، عن عائشة،‏.‏ أن فاطمة بنت أبي حبيش، سألت النبي صلى الله عليه وسلم قالت إني أستحاض فلا أطهر، أفأدع الصلاة فقال ‏\"‏ لا، إن ذلك عرق، ولكن دعي الصلاة قدر الأيام التي كنت تحيضين فيها، ثم اغتسلي وصلي ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Fatima bint Abi Hubaish asked the Prophet, \"I got persistent bleeding (in between the periods) and do not become clean. Shall I give up prayers?\" He replied, \"No, this is from a blood vessel. Give up the prayers only for the days on which you usually get the menses and then take a bath and offer your prayers.\"",
      "chain": [
        "30300",
        "20318",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "356",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبيد بن إسماعيل، قال حدثنا أبو أسامة، عن هشام، عن أبيه، أن عمر بن أبي سلمة، أخبره قال رأيت رسول الله صلى الله عليه وسلم يصلي في ثوب واحد مشتملا به في بيت أم سلمة، واضعا طرفيه على عاتقيه‏.‏",
      "text_en": " Narrated `Umar bin Abi Salama:                     In the house of Um-Salama I saw Allah's Apostle offering prayers, wrapped in a single garment around his body with its ends crossed round his shoulders.",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "246"
      ]
    },
    {
      "hadith_no": "388",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إسحاق بن نصر، قال حدثنا أبو أسامة، عن الأعمش، عن مسلم، عن مسروق، عن المغيرة بن شعبة، قال وضأت النبي صلى الله عليه وسلم فمسح على خفيه وصلى‏.‏",
      "text_en": "      Narrated Al-Mughira bin Shu'ba:                          I helped the Prophet in performing ablution and he passed his wet      hands over his Khuffs and prayed.",
      "chain": [
        "30311",
        "20318",
        "11060",
        "20285",
        "11018",
        "166"
      ]
    },
    {
      "hadith_no": "439",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عبيد بن إسماعيل، قال حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة، أن وليدة، كانت سوداء لحى من العرب، فأعتقوها، فكانت معهم قالت فخرجت صبية لهم عليها وشاح أحمر من سيور قالت فوضعته أو وقع منها، فمرت به حدياة وهو ملقى، فحسبته لحما فخطفته قالت فالتمسوه فلم يجدوه قالت فاتهموني به قالت فطفقوا يفتشون حتى فتشوا قبلها قالت والله إني لقائمة معهم، إذ مرت الحدياة فألقته قالت فوقع بينهم قالت فقلت هذا الذي اتهمتموني به  زعمتم  وأنا منه بريئة، وهو ذا هو قالت فجاءت إلى رسول الله صلى الله عليه وسلم فأسلمت‏.‏ قالت عائشة فكان لها خباء في المسجد أو حفش قالت فكانت تأتيني فتحدث عندي قالت فلا تجلس عندي مجلسا إلا قالت ويوم الوشاح من أعاجيب ربنا ألا إنه من بلدة الكفر أنجاني قالت عائشة فقلت لها ما شأنك لا تقعدين معي مقعدا إلا قلت هذا قالت فحدثتني بهذا الحديث‏.‏",
      "text_en": " Narrated `Aisha:                     There was a black slave girl belonging to an 'Arab tribe and they manumitted her but she remained with them. The slave girl said, \"Once one of their girls (of that tribe) came out wearing a red leather scarf decorated with precious stones. It fell from her or she placed it somewhere. A kite passed by that place, saw it Lying there and mistaking it for a piece of meat, flew away with it. Those people searched for it but they did not find it. So they accused me of stealing it and started searching me and even searched my private parts.\" The slave girl further said, \"By Allah! while I was standing (in that state) with those people, the same kite passed by them and dropped the red scarf and it fell amongst them. I told them, 'This is what you accused me of and I was innocent and now this is it.' \" `Aisha added: That slave girl came to Allah's Apostle and embraced Islam. She had a tent or a small room with a low roof in the mosque. Whenever she called on me, she had a talk with me and whenever she sat with me, she would recite the following: \"The day of the scarf (band) was one of the wonders of our Lord, verily He rescued me from the disbelievers' town. `Aisha added: \"Once I asked her, 'What is the matter with you? Whenever you sit with me, you always recite these poetic verses.' On that she told me the whole story. \"",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "558",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو كريب، قال حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم ‏\"‏ مثل المسلمين واليهود والنصارى كمثل رجل استأجر قوما يعملون له عملا إلى الليل، فعملوا إلى نصف النهار، فقالوا لا حاجة لنا إلى أجرك، فاستأجر آخرين فقال أكملوا بقية يومكم، ولكم الذي شرطت، فعملوا حتى إذا كان حين صلاة العصر قالوا لك ما عملنا‏.‏ فاستأجر قوما فعملوا بقية يومهم حتى غابت الشمس، واستكملوا أجر الفريقين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"The example of Muslims, Jews and Christians is like the example of a man who employed laborers to work for him from morning till night. They worked till midday and they said, 'We are not in need of your reward.' SO the man employed another batch and said to them, 'Complete the rest of the day and yours will be the wages I had fixed (for the first batch). They worked Up till the time of the `Asr prayer and said, 'Whatever we have done is for you.' He employed another batch. They worked for the rest of the day till sunset, and they received the wages of the two former batches.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "567",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن العلاء، قال أخبرنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى، قال كنت أنا وأصحابي الذين، قدموا معي في السفينة نزولا في بقيع بطحان، والنبي صلى الله عليه وسلم بالمدينة، فكان يتناوب النبي صلى الله عليه وسلم عند صلاة العشاء كل ليلة نفر منهم، فوافقنا النبي  عليه السلام  أنا وأصحابي وله بعض الشغل في بعض أمره فأعتم بالصلاة حتى ابهار الليل، ثم خرج النبي صلى الله عليه وسلم فصلى بهم، فلما قضى صلاته قال لمن حضره ‏\"‏ على رسلكم، أبشروا إن من نعمة الله عليكم أنه ليس أحد من الناس يصلي هذه الساعة غيركم ‏\"‏‏.‏ أو قال ‏\"‏ ما صلى هذه الساعة أحد غيركم ‏\"‏‏.‏ لا يدري أى الكلمتين قال‏.‏ قال أبو موسى فرجعنا ففرحنا بما سمعنا من رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Musa:                     My companions, who came with me in the boat and I landed at a place called Baqi [??] Buthan [??] . The Prophet was in Medina at that time. One of us used to go to the Prophet by turns every night at the time of the `Isha prayer. Once I along with my companions went to the Prophet and he was busy in some of his affairs, so the `Isha' prayer was delayed to the middle of the night He then came out and led the people (in prayer). After finishing from the prayer, he addressed the people present there saying, \"Be patient! Don't go away. Have the glad tiding. It is from the blessing of Allah upon you that none amongst mankind has prayed at this time save you.\" Or said, \"None except you has prayed at this time.\" Abu Musa added, 'So we returned happily after what we heard from Allah's Apostle .\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "584",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبيد بن إسماعيل، عن أبي أسامة، عن عبيد الله، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم نهى عن بيعتين وعن لبستين وعن صلاتين نهى عن الصلاة بعد الفجر حتى تطلع الشمس، وبعد العصر حتى تغرب الشمس، وعن اشتمال الصماء وعن الاحتباء في ثوب واحد يفضي بفرجه إلى السماء، وعن المنابذة والملامسة‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle forbade two kinds of sales, two kinds of dresses, and two prayers. He forbade offering prayers after the Fajr prayer till the rising of the sun and after the `Asr prayer till its setting. He also forbade \"Ishtimal-Assama [??] \" and \"al-Ihtiba\" in one garment in such a way that one's private parts are exposed towards the sky. He also forbade the sales called \"Munabadha\" and \"Mulamasa.\" (See Hadith No. 354 and 355 Vol. 3).",
      "chain": [
        "30360",
        "20318",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "hadith_no": "623",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق، قال أخبرنا أبو أسامة، قال عبيد الله حدثنا عن القاسم بن محمد، عن عائشة،‏.‏ وعن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال‏.‏ حوحدثني يوسف بن عيسى المروزي، قال حدثنا الفضل، قال حدثنا عبيد الله بن عمر، عن القاسم بن محمد، عن عائشة، عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ إن بلالا يؤذن بليل، فكلوا واشربوا حتى يؤذن ابن أم مكتوم ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet said, \"Bilal pronounces the Adhan at night, so eat and drink (Suhur) till Ibn Um Maktum pronounces the Adhan.\"",
      "chain": [
        "30021",
        "20318",
        "11201",
        "10535",
        "53",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "651",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن العلاء، قال حدثنا أبو أسامة، عن بريد بن عبد الله، عن أبي بردة، عن أبي موسى، قال قال النبي صلى الله عليه وسلم ‏\"‏ أعظم الناس أجرا في الصلاة أبعدهم فأبعدهم ممشى، والذي ينتظر الصلاة حتى يصليها مع الإمام أعظم أجرا من الذي يصلي ثم ينام ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"The people who get tremendous reward for the prayer are those who are farthest away (from the mosque) and then those who are next farthest and so on. Similarly one who waits to pray with the Imam has greater reward than one who prays and goes to bed. \"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "673",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عبيد بن إسماعيل، عن أبي أسامة، عن عبيد الله، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا وضع عشاء أحدكم وأقيمت الصلاة فابدءوا بالعشاء، ولا يعجل حتى يفرغ منه ‏\"‏‏.‏ وكان ابن عمر يوضع له الطعام وتقام الصلاة فلا يأتيها حتى يفرغ، وإنه ليسمع قراءة الإمام‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar said, \"Allah's Apostle said, 'If the supper is served for anyone of you and the Iqama is pronounced, start with the supper and don't be in haste (and carry on eating) till you finish it.\" If food was served for Ibn `Umar and Iqama was pronounced, he never came to the prayer till he finished it (i.e. food) in spite of the fact that he heard the recitation (of the Qur'an) by the Imam (in the prayer).",
      "chain": [
        "30360",
        "20318",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "900",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا يوسف بن موسى، حدثنا أبو أسامة، حدثنا عبيد الله بن عمر، عن نافع، عن ابن عمر، قال كانت امرأة لعمر تشهد صلاة الصبح والعشاء في الجماعة في المسجد، فقيل لها لم تخرجين وقد تعلمين أن عمر يكره ذلك ويغار قالت وما يمنعه أن ينهاني قال يمنعه قول رسول الله صلى الله عليه وسلم ‏\"‏ لا تمنعوا إماء الله مساجد الله ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     One of the wives of `Umar (bin Al-Khattab) used to offer the Fajr and the `Isha' prayer in congregation in the Mosque. She was asked why she had come out for the prayer as she knew that `Umar disliked it, and he has great ghaira (self-respect). She replied, \"What prevents him from stopping me from this act?\" The other replied, \"The statement of Allah's Apostle (p.b.u.h) : 'Do not stop Allah's women-slave from going to Allah s Mosques' prevents him.\"",
      "chain": [
        "30224",
        "20318",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "922",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "وقال محمود حدثنا أبو أسامة، قال حدثنا هشام بن عروة، قال أخبرتني فاطمة بنت المنذر، عن أسماء بنت أبي بكر، قالت دخلت على عائشة  رضى الله عنها  والناس يصلون قلت ما شأن الناس فأشارت برأسها إلى السماء‏.‏ فقلت آية فأشارت برأسها أى نعم‏.‏ قالت فأطال رسول الله صلى الله عليه وسلم جدا حتى تجلاني الغشى وإلى جنبي قربة فيها ماء ففتحتها فجعلت أصب منها على رأسي، فانصرف رسول الله صلى الله عليه وسلم وقد تجلت الشمس، فخطب الناس، وحمد الله بما هو أهله ثم قال ‏\"‏ أما بعد ‏\"‏‏.‏ قالت ولغط نسوة من الأنصار، فانكفأت إليهن لأسكتهن فقلت لعائشة ما قال قالت قال ‏\"‏ ما من شىء لم أكن أريته إلا قد رأيته في مقامي هذا حتى الجنة والنار، وإنه قد أوحي إلى أنكم تفتنون في القبور مثل  أو قريب من  فتنة المسيح الدجال، يؤتى أحدكم، فيقال له ما علمك بهذا الرجل فأما المؤمن  أو قال الموقن شك هشام  فيقول هو رسول الله، هو محمد صلى الله عليه وسلم جاءنا بالبينات والهدى فآمنا وأجبنا واتبعنا وصدقنا‏.‏ فيقال له نم صالحا، قد كنا نعلم إن كنت لتؤمن به‏.‏ وأما المنافق  أو قال المرتاب شك هشام  فيقال له ما علمك بهذا الرجل فيقول لا أدري، سمعت الناس يقولون شيئا فقلته ‏\"‏‏.‏ قال هشام فلقد قالت لي فاطمة فأوعيته، غير أنها ذكرت ما يغلظ عليه‏.‏",
      "text_en": " Narrated Fatima bint Al-Mundhir:                     Asma' bint Abi Bakr As-Siddiq said, \"I went to 'Aishah and the people were offering Salat. I asked her, 'What is wrong with the people ?' She pointed towards the sky with her head. I asked her, 'Is there a sign ?' 'Aishah nodded with her head meaning 'Yes'.\" Asma' added, \"Allah's Messenger () prolonged the Salat to such an extent that I fainted. There was a waterskin by my side and I opened it and poured some water on my head. When Allah's Messenger () finished Salat, and the solar eclipse had cleared, the Prophet () addressed the people and praised Allah as He deserves and said, 'Amma ba'du'.\" Asma' further said, \"Some Ansari women started talking, so I turned to them in order to make them quiet. I asked 'Aishah what the Prophet () had said. 'Aishah said: 'He said, 'I have seen things at this place of mine which were never shown to me before; (I have seen) even Paradise and Hell. And, no doubt it has been revealed to me that you (people) will be put in trial in your graves like or nearly like the trial of Masih Ad-Dajjal. (The angels) will come to everyone of you and ask him, 'What do you know about this man (Prophet Muhammad ()) ?\" The faithful believer or firm believer (Hisham was in doubt which word the Prophet () used), will say, 'He is Allah's Messenger () and he is Muhammad () who came to us with clear evidences and guidance. So we believed him, accepted his teachings and followed and trusted his teaching.' Then the angels will tell him to sleep (in peace) as they have come to know that he was a believer. But the hypocrite or a doubtful person (Hisham is not sure as to which word the Prophet () used), will be asked what he knew about this man (Prophet Muhammed ()). He will say, 'I do not know but I heard the people saying something (about him) so I said the same' \" Hisham added, \"Fatima told me that she remembered that narration completely by heart except that she said about the hypocrite or a doubtful person that he will be punished severely.\"",
      "chain": [
        "30277",
        "20318",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "952",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا عبيد بن إسماعيل، قال حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت دخل أبو بكر وعندي جاريتان من جواري الأنصار تغنيان بما تقاولت الأنصار يوم بعاث  قالت وليستا بمغنيتين  فقال أبو بكر أمزامير الشيطان في بيت رسول الله صلى الله عليه وسلم وذلك في يوم عيد‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا بكر إن لكل قوم عيدا، وهذا عيدنا ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     Abu Bakr came to my house while two small Ansari girls were singing beside me the stories of the Ansar concerning the Day of Buath. And they were not singers. Abu Bakr said protestingly, \"Musical instruments of Satan in the house of Allah's Apostle !\" It happened on the `Id day and Allah's Apostle said, \"O Abu Bakr! There is an `Id for every nation and this is our `Id.\"",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "963",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا يعقوب بن إبراهيم، قال حدثنا أبو أسامة، قال حدثنا عبيد الله، عن نافع، عن ابن عمر، قال كان رسول الله صلى الله عليه وسلم وأبو بكر وعمر  رضى الله عنهما  يصلون العيدين قبل الخطبة‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle, Abu Bakr and `Umar! used to offer the two `Id prayers before delivering the Khutba.",
      "chain": [
        "20184",
        "20318",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1059",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن العلاء، قال حدثنا أبو أسامة، عن بريد بن عبد الله، عن أبي بردة، عن أبي موسى، قال خسفت الشمس، فقام النبي صلى الله عليه وسلم فزعا، يخشى أن تكون الساعة، فأتى المسجد، فصلى بأطول قيام وركوع وسجود رأيته قط يفعله وقال ‏\"‏ هذه الآيات التي يرسل الله لا تكون لموت أحد ولا لحياته، ولكن يخوف الله به عباده، فإذا رأيتم شيئا من ذلك فافزعوا إلى ذكره ودعائه واستغفاره ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The sun eclipsed and the Prophet got up, being afraid that it might be the Hour (i.e. Day of Judgment). He went to the Mosque and offered the prayer with the longest Qiyam, bowing and prostration that I had ever seen him doing. Then he said, \"These signs which Allah sends do not occur because of the life or death of somebody, but Allah makes His worshipers afraid by them. So when you see anything thereof, proceed to remember Allah, invoke Him and ask for His forgiveness.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1061",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "وقال أبو أسامة حدثنا هشام، قال أخبرتني فاطمة بنت المنذر، عن أسماء، قالت فانصرف رسول الله صلى الله عليه وسلم وقد تجلت الشمس فخطب، فحمد الله بما هو أهله ثم قال ‏\"‏ أما بعد ‏\"‏‏.‏",
      "text_en": " And this was narrated by Asma' who said, \"Allah's Messenger () finished the eclipse prayer and by then the sun (eclipse) had cleared. Then he delivered the Khutba (religious talk) and praised Allah as He deserved and then said Amma ba'du.\"",
      "chain": [
        "20318",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "1149",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا إسحاق بن نصر، حدثنا أبو أسامة، عن أبي حيان، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  أن النبي صلى الله عليه وسلم قال لبلال عند صلاة الفجر ‏\"‏ يا بلال حدثني بأرجى عمل عملته في الإسلام، فإني سمعت دف نعليك بين يدى في الجنة ‏\"‏‏.‏ قال ما عملت عملا أرجى عندي أني لم أتطهر طهورا في ساعة ليل أو نهار إلا صليت بذلك الطهور ما كتب لي أن أصلي‏.‏ قال أبو عبد الله دف نعليك يعني تحريك‏.‏",
      "text_en": " Narrated Abu Huraira:                     At the time of the Fajr prayer the Prophet asked Bilal, \"Tell me of the best deed you did after embracing Islam, for I heard your footsteps in front of me in Paradise.\" Bilal replied, \"I did not do anything worth mentioning except that whenever I performed ablution during the day or night, I prayed after that ablution as much as was written for me.\"",
      "chain": [
        "30311",
        "20318",
        "11404",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "1435",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ليأتين على الناس زمان يطوف الرجل فيه بالصدقة من الذهب ثم لا يجد أحدا يأخذها منه، ويرى الرجل الواحد يتبعه أربعون امرأة، يلذن به من قلة الرجال وكثرة النساء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     Thy Prophet (p.b.u.h) said, \"A time will come upon the people when a person will wander about with gold as Zakat and will not find anybody to accept it, and one man will be seen followed by forty women to be their guardian because of scarcity of men and great number of women. \"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1460",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد بن عبد الله، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم قال ‏\"‏ الخازن المسلم الأمين الذي ينفذ  وربما قال يعطي  ما أمر به كاملا موفرا طيب به نفسه، فيدفعه إلى الذي أمر له به، أحد المتصدقين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"An honest Muslim storekeeper who carries out the orders of his master and pays fully what he has been ordered to give with a good heart and pays to that person to whom he was ordered to pay, is regarded as one of the two charitable persons.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1525",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا يوسف بن موسى، حدثنا أبو أسامة، أخبرنا هشام بن عروة، عن أبيه، عن أبي حميد الساعدي  رضى الله عنه  قال استعمل رسول الله صلى الله عليه وسلم رجلا من الأسد على صدقات بني سليم يدعى ابن اللتبية، فلما جاء حاسبه‏.‏",
      "text_en": " Narrated Abu Humaid Al-Sa`idi:                     Allah's Apostle (p.b.u.h) appointed a man called Ibn Al-Lutbiya, from the tribe of Al-Asd to collect Zakat from Bani Sulaim. When he returned, (after collecting the Zakat) the Prophet checked the account with him.",
      "chain": [
        "30224",
        "20318",
        "11065",
        "10511",
        "1457"
      ]
    },
    {
      "hadith_no": "1603",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمود بن غيلان المروزي، حدثنا أبو أسامة، حدثنا هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم دخل عام الفتح من كداء، وخرج من كدا من أعلى مكة‏.‏",
      "text_en": " Narrated `Aisha':                     In the year of the conquest of Mecca, the Prophet entered Mecca from Kada' and left Mecca from Kuda, from the higher part of Mecca.",
      "chain": [
        "30277",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1610",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت قال لي رسول الله صلى الله عليه وسلم ‏\"‏ لولا حداثة قومك بالكفر لنقضت البيت ثم لبنيته على أساس إبراهيم  عليه السلام  فإن قريشا استقصرت بناءه  وجعلت له خلفا ‏\"‏‏.‏ قال أبو معاوية حدثنا هشام خلفا يعني بابا‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle said to me, \"Were your people not close to the Pre-Islamic period of ignorance, I would have demolished the Ka`ba and would have rebuilt it on its original foundations laid by Abraham (for Quraish had curtailed its building), and I would have built a back door (too).\"",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1922",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت لما قدم رسول الله صلى الله عليه وسلم المدينة وعك أبو بكر وبلال، فكان أبو بكر إذا أخذته الحمى يقول كل امرئ مصبح في أهله والموت أدنى من شراك نعله وكان بلال إذا أقلع عنه الحمى يرفع عقيرته يقول ألا ليت شعري هل أبيتن ليلة بواد وحولي إذخر وجليل وهل أردن يوما مياه مجنة وهل يبدون لي شامة وطفيل قال اللهم العن شيبة بن ربيعة، وعتبة بن ربيعة، وأمية بن خلف، كما أخرجونا من أرضنا إلى أرض الوباء ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم حبب إلينا المدينة كحبنا مكة أو أشد، اللهم بارك لنا في صاعنا، وفي مدنا، وصححها لنا وانقل حماها إلى الجحفة ‏\"‏‏.‏ قالت وقدمنا المدينة، وهى أوبأ أرض الله‏.‏ قالت فكان بطحان يجري نجلا‏.‏ تعني ماء آجنا‏.‏",
      "text_en": " Narrated `Aisha:                     When Allah's Apostle reached Medina, Abu Bakr and Bilal became ill. When Abu Bakr's fever got worse, he would recite (this poetic verse): \"Everybody is staying alive with his People, yet Death is nearer to him than His shoe laces.\" And Bilal, when his fever deserted him, would recite: \"Would that I could stay overnight in A valley wherein I would be Surrounded by Idhkhir and Jalil (kinds of goodsmelling grass). Would that one day I could Drink the water of the Majanna, and Would that (The two mountains) Shama and Tafil would appear to me!\" The Prophet said, \"O Allah! Curse Shaiba bin Rabi`a and `Utba bin Rabi`a and Umaiya bin Khalaf as they turned us out of our land to the land of epidemics.\" Allah's Apostle then said, \"O Allah! Make us love Medina as we love Mecca or even more than that. O Allah! Give blessings in our Sa and our Mudd (measures symbolizing food) and make the climate of Medina suitable for us, and divert its fever towards Aljuhfa.\" Aisha added: When we reached Medina, it was the most unhealthy of Allah's lands, and the valley of Bathan (the valley of Medina) used to flow with impure colored water.",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1919",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عبيد بن إسماعيل، عن أبي أسامة، عن عبيد الله، عن نافع، عن ابن عمر‏.‏والقاسم بن محمد عن عائشة  رضى الله عنها  أن بلالا، كان يؤذن بليل فقال رسول الله صلى الله عليه وسلم ‏\"‏ كلوا واشربوا حتى يؤذن ابن أم مكتوم، فإنه لا يؤذن حتى يطلع الفجر ‏\"‏‏.‏ قال القاسم ولم يكن بين أذانهما إلا أن يرقى ذا وينزل ذا‏.‏",
      "text_en": " Narrated `Aisha:                     Bilal used to pronounce the Adhan at night, so Allah's Apostle? said, \"Carry on taking your meals (eat and drink) till Ibn Um Maktum pronounces the Adhan, for he does not pronounce it till it is dawn.",
      "chain": [
        "30360",
        "20318",
        "11201",
        "11014",
        "53"
      ]
    },
    {
      "hadith_no": "1959",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثني عبد الله بن أبي شيبة، حدثنا أبو أسامة، عن هشام بن عروة، عن فاطمة، عن أسماء بنت أبي بكر  رضى الله عنهما  قالت أفطرنا على عهد النبي صلى الله عليه وسلم يوم غيم، ثم طلعت الشمس‏.‏ قيل لهشام فأمروا بالقضاء قال بد من قضاء‏.‏ وقال معمر سمعت هشاما لا أدري أقضوا أم لا‏.‏",
      "text_en": " Narrated Abu Usama from Hisham bin 'Ursa from Fatima:                     Asma bint Abi Bakr said, \"We broke our fast during the lifetime of the Prophet on a cloudy day and then the sun appeared.\" Hisham was asked, \"Were they ordered to fast in lieu of that day?\" He replied, \"It had to be made up for.\" Ma`mar said, \"I heard Hisham saying, \"I don't know whether they fasted in lieu of that day or not.\"",
      "chain": [
        "30201",
        "20318",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "2005",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا أبو أسامة، عن أبي عميس، عن قيس بن مسلم، عن طارق بن شهاب، عن أبي موسى  رضى الله عنه  قال كان يوم عاشوراء تعده اليهود عيدا، قال النبي صلى الله عليه وسلم ‏\"‏ فصوموه أنتم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The day of 'Ashura' was considered as `Id day by the Jews. So the Prophet ordered, \"I recommend you (Muslims) to fast on this day.\"",
      "chain": [
        "30026",
        "20318",
        "11386",
        "3680",
        "41"
      ]
    },
    {
      "hadith_no": "2043",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن عبيد الله، عن نافع، عن ابن عمر، أن عمر  رضى الله عنه  نذر في الجاهلية أن يعتكف في المسجد الحرام  قال أراه قال  ليلة قال له رسول الله صلى الله عليه وسلم ‏\"‏ أوف بنذرك ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     that `Umar had vowed in the Pre-Islamic period to perform I`tikaf in Al-Masjid-al-Haram. (A subnarrator thinks that `Umar vowed to perform I`tikaf for one night.) Allah's Apostle said to `Umar, \"Fulfill your vow.\"",
      "chain": [
        "30360",
        "20318",
        "11201",
        "11014",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "2271",
      "source": " Sahih Bukhari ",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ مثل المسلمين واليهود والنصارى كمثل رجل استأجر قوما يعملون له عملا يوما إلى الليل على أجر معلوم، فعملوا له إلى نصف النهار فقالوا لا حاجة لنا إلى أجرك الذي شرطت لنا، وما عملنا باطل، فقال لهم لا تفعلوا أكملوا بقية عملكم، وخذوا أجركم كاملا، فأبوا وتركوا، واستأجر أجيرين بعدهم فقال لهما أكملا بقية يومكما هذا، ولكما الذي شرطت لهم من الأجر‏.‏ فعملوا حتى إذا كان حين صلاة العصر قالا لك ما عملنا باطل، ولك الأجر الذي جعلت لنا فيه‏.‏ فقال لهما أكملا بقية عملكما، فإن ما بقي من النهار شىء يسير‏.‏ فأبيا، واستأجر قوما أن يعملوا له بقية يومهم، فعملوا بقية يومهم حتى غابت الشمس، واستكملوا أجر الفريقين كليهما، فذلك مثلهم ومثل ما قبلوا من هذا النور ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"The example of Muslims, Jews and Christians is like the example of a man who employed laborers to work for him from morning till night for specific wages. They worked till midday and then said, 'We do not need your money which you have fixed for us and let whatever we have done be annulled.' The man said to them, 'Don't quit the work, but complete the rest of it and take your full wages.' But they refused and went away. The man employed another batch after them and said to them, 'Complete the rest of the day and yours will be the wages I had fixed for the first batch.' So, they worked till the time of `Asr prayer. Then they said, \"Let what we have done be annulled and keep the wages you have promised us for yourself.' The man said to them, 'Complete the rest of the work, as only a little of the day remains,' but they refused. Thereafter he employed another batch to work for the rest of the day and they worked for the rest of the day till the sunset, and they received the wages of the two former batches. So, that was the example of those people (Muslims) and the example of this light (guidance) which they have accepted willingly.",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2292",
      "source": " Sahih Bukhari ",
      "chapter": "Kafalah - كتاب الكفالة",
      "chapter_no": "39",
      "text_ar": "حدثنا الصلت بن محمد، حدثنا أبو أسامة، عن إدريس، عن طلحة بن مصرف، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما – ‏{‏ولكل جعلنا موالي‏}‏ قال ورثة ‏{‏والذين عقدت أيمانكم‏}‏ قال كان المهاجرون لما قدموا المدينة يرث المهاجر الأنصاري دون ذوي رحمه للأخوة التي آخى النبي صلى الله عليه وسلم بينهم، فلما نزلت ‏{‏ولكل جعلنا موالي‏}‏ نسخت، ثم قال ‏{‏والذين عقدت أيمانكم ‏}‏ إلا النصر والرفادة والنصيحة، وقد ذهب الميراث ويوصي له‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     Ibn `Abbas said, \"In the verse: To every one We have appointed ' (Muwaliya Muwaliya means one's) heirs (4.33).' (And regarding the verse) 'And those with whom your right hands have made a pledge.' Ibn `Abbas said, \"When the emigrants came to the Prophet in Medina, the emigrant would inherit the Ansari while the latter's relatives would not inherit him because of the bond of brotherhood which the Prophet established between them (i.e. the emigrants and the Ansar). When the verse: 'And to everyone We have appointed heirs' (4.33) was revealed, it canceled (the bond (the pledge) of brotherhood regarding inheritance).\" Then he said, \"The verse: To those also to whom your right hands have pledged, remained valid regarding cooperation and mutual advice, while the matter of inheritance was excluded and it became permissible to assign something in one's testament to the person who had the right of inheriting before.",
      "chain": [
        "30140",
        "20318",
        "20407",
        "11356",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2319",
      "source": " Sahih Bukhari ",
      "chapter": "Representation; Authorization; Business by Proxy - كتاب الوكالة",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد بن عبد الله، عن أبي بردة، عن أبي موسى  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الخازن الأمين الذي ينفق  وربما قال الذي يعطي  ما أمر به كاملا موفرا، طيب نفسه، إلى الذي أمر به، أحد المتصدقين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"An honest treasurer who gives what he is ordered to give fully, perfectly and willingly to the person to whom he is ordered to give, is regarded as one of the two charitable persons.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2383",
      "source": " Sahih Bukhari ",
      "chapter": "Distribution of Water - كتاب المساقاة",
      "chapter_no": "42",
      "text_ar": "حدثنا زكرياء بن يحيى، أخبرنا أبو أسامة، قال أخبرني الوليد بن كثير، قال أخبرني بشير بن يسار، مولى بني حارثة أن رافع بن خديج، وسهل بن أبي حثمة، حدثاه أن رسول الله صلى الله عليه وسلم نهى عن المزابنة بيع الثمر بالتمر، إلا أصحاب العرايا فإنه أذن لهم‏.‏ قال أبو عبد الله وقال ابن إسحاق حدثني بشير مثله‏.‏",
      "text_en": " Narrated Rafi` 'bin Khadij and Sahl bin Abi Hathma:                     Allah's Apostle forbade the sale of Muzabana, i.e. selling of fruits for fruits, except in the case of 'Araya; he allowed the owners of 'Araya such kind of sale.",
      "chain": [
        "30193",
        "20318",
        "11230",
        "11810",
        "1986",
        "1822"
      ]
    },
    {
      "hadith_no": "2446",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ المؤمن للمؤمن كالبنيان يشد بعضه بعضا ‏\"‏‏.‏ وشبك بين أصابعه‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"A believer to another believer is like a building whose different parts enforce each other.\" The Prophet then clasped his hands with the fingers interlaced (while saying that).",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2486",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا حماد بن أسامة، عن بريد، عن أبي بردة، عن أبي موسى، قال قال النبي صلى الله عليه وسلم ‏\"‏ إن الأشعريين إذا أرملوا في الغزو، أو قل طعام عيالهم بالمدينة جمعوا ما كان عندهم في ثوب واحد، ثم اقتسموه بينهم في إناء واحد بالسوية، فهم مني وأنا منهم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"When the people of Ash`ari tribe ran short of food during the holy battles, or the food of their families in Medina ran short, they would collect all their remaining food in one sheet and then distribute it among themselves equally by measuring it with a bowl. So, these people are from me, and I am from them.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2523",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا عبيد بن إسماعيل، عن أبي أسامة، عن عبيد الله، عن نافع، عن ابن عمر  رضى الله عنهما  قال رسول الله صلى الله عليه وسلم ‏\"‏ من أعتق شركا له في مملوك فعليه عتقه كله، إن كان له مال يبلغ ثمنه، فإن لم يكن له يقوم عليه قيمة عدل، فأعتق منه ما أعتق ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"Whoever manumits his share of a slave, then it is essential for him to get that slave manumitted' completely as long as he has the money to do so. If he has not sufficient money to pay the price of the other shares (after the price of the slave is evaluated justly), the manumitted manumits the slave partially in proportion to his share.",
      "chain": [
        "30360",
        "20318",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2531",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا عبيد الله بن سعيد، حدثنا أبو أسامة، حدثنا إسماعيل، عن قيس، عن أبي هريرة  رضى الله عنه  قال لما قدمت على النبي صلى الله عليه وسلم قلت في الطريق يا ليلة من طولها وعنائها على أنها من دارة الكفر نجت قال وأبق مني غلام لي في الطريق  قال  فلما قدمت على النبي صلى الله عليه وسلم بايعته، فبينا أنا عنده إذ طلع الغلام، فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا هريرة، هذا غلامك ‏\"‏‏.‏ فقلت هو حر لوجه الله‏.‏ فأعتقته‏.‏ لم يقل أبو كريب عن أبي أسامة حر‏.‏",
      "text_en": " Narrated Abu Huraira:                     On my way to the Prophet I was reciting:-- 'What a long tedious tiresome night! Nevertheless, it has saved us From the land of Kufr (disbelief).' I had a slave who ran away from me on the way. When I went to the Prophet and gave the pledge of allegiance for embracing Islam, the slave showed up while I was still with the Prophet who remarked, \"O Abu Huraira! Here is your slave!\" I said, \"I manumit him for Allah's Sake,\" and so I freed him.",
      "chain": [
        "30359",
        "20318",
        "11418",
        "11046",
        "13"
      ]
    },
    {
      "hadith_no": "2538",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، أخبرني أبي أن حكيم بن حزام  رضى الله عنه  أعتق في الجاهلية مائة رقبة، وحمل على مائة بعير، فلما أسلم حمل على مائة بعير وأعتق مائة رقبة، قال فسألت رسول الله صلى الله عليه وسلم فقلت يا رسول الله، أرأيت أشياء كنت أصنعها في الجاهلية، كنت أتحنث بها، يعني أتبرر بها، قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ أسلمت على ما سلف لك من خير ‏\"‏‏.‏",
      "text_en": " Narrated Hisham:                     My father told me that Hakim bin Hizam manumitted one-hundred slaves in the Pre-Islamic period of ignorance and slaughtered one-hundred camels (and distributed them in charity). When he embraced Islam he again slaughtered one-hundred camels and manumitted one-hundred slaves. Hakim said, \"I asked Allah's Apostle, 'O Allah's Apostle! What do you think about some good deeds I used to practice in the Pre-Islamic period of ignorance regarding them as deeds of righteousness?' Allah's Apostle said, \"You have embraced Islam along with all those good deeds you did.\"",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "423"
      ]
    },
    {
      "hadith_no": "2549",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا إسحاق بن نصر، حدثنا أبو أسامة، عن الأعمش، حدثنا أبو صالح، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ نعم ما لأحدهم يحسن عبادة ربه وينصح لسيده ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Goodness and comfort are for him who worships his Lord in a perfect manner and serves his master sincerely.\"",
      "chain": [
        "30311",
        "20318",
        "11060",
        "19291",
        "13"
      ]
    },
    {
      "hadith_no": "2551",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن بريد، عن أبي بردة، عن أبي موسى  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ المملوك الذي يحسن عبادة ربه، ويؤدي إلى سيده الذي له عليه من الحق والنصيحة والطاعة، له أجران ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"The Mamluk (slave) who worships his Lord in a perfect manner, and is dutiful, sincere and obedient to his Saiyid (master), will get a double reward.\"",
      "chain": [
        "30216",
        "20318",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2563",
      "source": " Sahih Bukhari ",
      "chapter": "Makaatib - كتاب المكاتب",
      "chapter_no": "50",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت جاءت بريرة فقالت إني كاتبت أهلي على تسع أواق، في كل عام وقية، فأعينيني‏.‏ فقالت عائشة إن أحب أهلك أن أعدها لهم عدة واحدة، وأعتقك فعلت، ويكون ولاؤك لي‏.‏ فذهبت إلى أهلها، فأبوا ذلك عليها، فقالت إني قد عرضت ذلك عليهم، فأبوا إلا أن يكون الولاء لهم‏.‏ فسمع بذلك رسول الله صلى الله عليه وسلم فسألني فأخبرته، فقال ‏\"‏ خذيها، فأعتقيها، واشترطي لهم الولاء، فإنما الولاء لمن أعتق ‏\"‏‏.‏ قالت عائشة فقام رسول الله صلى الله عليه وسلم في الناس، فحمد الله، وأثنى عليه، ثم قال ‏\"‏ أما بعد، فما بال رجال منكم يشترطون شروطا ليست في كتاب الله فأيما شرط ليس في كتاب الله فهو باطل، وإن كان مائة شرط، فقضاء الله أحق، وشرط الله أوثق، ما بال رجال منكم يقول أحدهم أعتق يا فلان ولي الولاء إنما الولاء لمن أعتق ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     Buraira came (to `Aisha) and said, \"I have made a contract of emancipation with my masters for nine Uqiyas (of gold) to be paid in yearly installments. Therefore, I seek your help.\" `Aisha said, \"If your masters agree, I will pay them the sum at once and free you on condition that your Wala' will be for me.\" Buraira went to her masters but they refused that offer. She (came back) and said, \"I presented to them the offer but they refused, unless the Wala' was for them.\" Allah's Apostle heard of that and asked me about it, and I told him about it. On that he said, \"Buy and manumit her and stipulate that the Wala' should be for you, as Wala' is for the liberator.\" `Aisha added, \"Allah's Apostle then got up amongst the people, Glorified and Praised Allah, and said, 'Then after: What about some people who impose conditions which are not present in Allah's Laws? So, any condition which is not present in Allah's Laws is invalid even if they were one-hundred conditions. Allah's ordinance is the truth, and Allah's condition is stronger and more solid. Why do some men from you say, O so-and-so! manumit the slave but the Wala will be for me? Verily, the Wala is for the liberator.\"",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2620",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن أسماء بنت أبي بكر  رضى الله عنهما  قالت قدمت على أمي وهى مشركة، في عهد رسول الله صلى الله عليه وسلم، فاستفتيت رسول الله صلى الله عليه وسلم قلت ‏{‏إن أمي قدمت‏}‏ وهى راغبة، أفأصل أمي قال ‏\"‏ نعم صلي أمك ‏\"‏‏.‏",
      "text_en": " Narrated Asma' bint Abu Bakr:                     My mother came to me during the lifetime of Allah's Apostle and she was a pagan. I said to Allah's Apostle (seeking his verdict), \"My mother has come to me and she desires to receive a reward from me, shall I keep good relations with her?\" The Prophet said, \"Yes, keep good relation with her. \"",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "70"
      ]
    },
    {
      "hadith_no": "2664",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا عبيد الله بن سعيد، حدثنا أبو أسامة، قال حدثني عبيد الله، قال حدثني نافع، قال حدثني ابن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم عرضه يوم أحد وهو ابن أربع عشرة سنة، فلم يجزني، ثم عرضني يوم الخندق وأنا ابن خمس عشرة فأجازني‏.‏ قال نافع فقدمت على عمر بن عبد العزيز وهو خليفة، فحدثته هذا الحديث، فقال إن هذا لحد بين الصغير والكبير‏.‏ وكتب إلى عماله أن يفرضوا لمن بلغ خمس عشرة‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle called me to present myself in front of him or the eve of the battle of Uhud, while I was fourteen years of age at that time, and he did not allow me to take part in that battle, but he called me in front of him on the eve of the battle of the Trench when I was fifteen years old, and he allowed me (to join the battle).\" Nafi` said, \"I went to `Umar bin `Abdul `Aziz who was Caliph at that time and related the above narration to him, He said, \"This age (fifteen) is the limit between childhood and manhood,\" and wrote to his governors to give salaries to those who reached the age of fifteen.",
      "chain": [
        "30359",
        "20318",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2748",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو أسامة، عن سفيان، عن عمارة، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  قال قال رجل للنبي صلى الله عليه وسلم يا رسول الله، أى الصدقة أفضل قال ‏\"‏ أن تصدق وأنت صحيح حريص‏.‏ تأمل الغنى، وتخشى الفقر، ولا تمهل حتى إذا بلغت الحلقوم قلت لفلان كذا ولفلان كذا، وقد كان لفلان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     A man asked the Prophet, \"O Allah's Apostle! What kind of charity is the best?\" He replied. \"To give in charity when you are healthy and greedy hoping to be wealthy and afraid of becoming poor. Don't delay giving in charity till the time when you are on the death bed when you say, 'Give so much to soand- so and so much to so-and so,' and at that time the property is not yours but it belongs to so-and-so (i.e. your inheritors).",
      "chain": [
        "30216",
        "20318",
        "20012",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "2765",
      "source": " Sahih Bukhari ",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا عبيد بن إسماعيل، حدثنا أبو أسامة، عن هشام، عن أبيه، عن عائشة  رضى الله عنها – ‏{‏ومن كان غنيا فليستعفف ومن كان فقيرا فليأكل بالمعروف‏}‏‏.‏ قالت أنزلت في والي اليتيم أن يصيب من ماله إذا كان محتاجا بقدر ماله بالمعروف‏.‏",
      "text_en": " Narrated `Aisha:                     The following Verse:-- \"If a guardian is well-off, let him claim no remuneration (i.e. wages), but if he is poor, let him have for himself what is just and reasonable.\" (4.6) was revealed in connection with the guardian of an orphan, and it means that if he is poor he can have for himself (from the orphan's wealth) what is just and reasonable according to the orphan's share of the inheritance.",
      "chain": [
        "30360",
        "20318",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2863",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبيد بن إسماعيل، عن أبي أسامة، عن عبيد الله، عن نافع، عن ابن عمر  رضى الله عنهما أن رسول الله صلى الله عليه وسلم جعل للفرس سهمين ولصاحبه سهما‏.‏ وقال مالك يسهم للخيل والبراذين منها لقوله ‏{‏والخيل والبغال والحمير لتركبوها‏}‏ ولا يسهم لأكثر من فرس‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle fixed two shares for the horse and one share for its rider (from the war booty).",
      "chain": [
        "30360",
        "20318",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2865",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثني عبيد بن إسماعيل، عن أبي أسامة، عن عبيد الله، عن نافع، عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم‏.‏ أنه كان إذا أدخل رجله في الغرز واستوت به ناقته قائمة، أهل من عند مسجد ذي الحليفة‏.‏",
      "text_en": " Narrated Ibn'`Umar:                     When the Prophet put his feet in the stirrup and the she-camel got up carrying him he would start reciting Talbiya at the mosque of Dhul-Hulaifa.",
      "chain": [
        "30360",
        "20318",
        "11201",
        "11014",
        "18"
      ]
    }
  ],
  "total_hadiths": 580
}