{
  "id": "20317",
  "name": "Hafs bin Ghyath حفص بن غياث",
  "full_name": "Hafs bin Ghyath حفص بن غياث",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "195",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Qadhi(Judge)"
    ],
    "tags": [
      "al-Nakha'i",
      "Judge",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "30204",
      "name": "'Umar bin Hafs bin Ghyath عمر بن حفص بن غياث",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "teachers": [
    {
      "id": "10777",
      "name": "Talq bin Mua'wiya al-Nakha'i طلق بن معاوية النخعي",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "19837",
      "name": "Asha'th bin 'Abdullah bin Jabir أشعث بن عبد الله بن جابر",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10766",
      "name": "Sa'd bin Tariq, Abu Malik سعد بن طارق بن أشيم أبو مالك الأشجعي",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10827",
      "name": "Mus'ab bin Slym al-Asady مصعب بن سليم الأسدي مولى آل الزبير",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10898",
      "name": "Ja'far bin Muhammad bin 'Ali جعفر بن محمد بن علي - الصادق",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11325",
      "name": "Bryd bin 'Abdullah بريد بن عبد الله بن أبي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10957",
      "name": "al-Lyth bin Abi Sulaym الليث بن أبي سليم",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20668",
      "name": "'Umar bin Sa'd bin 'Ubaid عمر بن سعد بن عبيد أبو داود",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30106",
      "name": "'Affan bin Muslim عفان بن مسلم بن عبد الله الصفار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30399",
      "name": "Yahya bin Yahya bin Bukayr يحيى بن يحيى بن بكير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30263",
      "name": "'Amr bin Muhammad bin Bukayr عمرو بن محمد بن بكير الناقد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30216",
      "name": "Abu Karayb, Muhammad bin al-'Ala' محمد بن العلاء - أبو كريب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30204",
      "name": "'Umar bin Hafs bin Ghyath عمر بن حفص بن غياث",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36540",
      "name": "al-Hasan bin Arfh bin Yazid الحسن بن عرفة بن يزيد",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "259",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا عمر بن حفص بن غياث، قال حدثنا أبي، حدثنا الأعمش، قال حدثني سالم، عن كريب، عن ابن عباس، قال حدثتنا ميمونة، قالت صببت للنبي صلى الله عليه وسلم غسلا، فأفرغ بيمينه على يساره فغسلهما، ثم غسل فرجه، ثم قال بيده الأرض فمسحها بالتراب، ثم غسلها، ثم تمضمض واستنشق، ثم غسل وجهه، وأفاض على رأسه، ثم تنحى فغسل قدميه، ثم أتي بمنديل، فلم ينفض بها‏.‏",
      "text_en": " Narrated Maimuna:                     I placed water for the bath of the Prophet and he poured water with his right hand on his left and washed them. Then he washed his private parts and rubbed his hands on the ground, washed them with water, rinsed his mouth and washed his nose by putting water in it and blowing it out, washed his face and poured water on his head. He withdrew from that place and washed his feet. A piece of cloth (towel) was given to him but he did not use it.",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11011",
        "11211",
        "17",
        "61"
      ]
    },
    {
      "hadith_no": "346",
      "source": " Sahih Bukhari ",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا عمر بن حفص، قال حدثنا أبي قال، حدثنا الأعمش، قال سمعت شقيق بن سلمة، قال كنت عند عبد الله وأبي موسى فقال له أبو موسى أرأيت يا أبا عبد الرحمن إذا أجنب فلم يجد، ماء كيف يصنع فقال عبد الله لا يصلي حتى يجد الماء‏.‏ فقال أبو موسى فكيف تصنع بقول عمار حين قال له النبي صلى الله عليه وسلم ‏\"‏ كان يكفيك ‏\"‏ قال ألم تر عمر لم يقنع بذلك‏.‏ فقال أبو موسى فدعنا من قول عمار، كيف تصنع بهذه الآية فما درى عبد الله ما يقول فقال إنا لو رخصنا لهم في هذا لأوشك إذا برد على أحدهم الماء أن يدعه ويتيمم‏.‏ فقلت لشقيق فإنما كره عبد الله لهذا قال نعم‏.‏",
      "text_en": " Narrated Shaqiq bin Salama:                     I was with `Abdullah and Abu Musa; the latter asked the former, \"O Abu `Abdur-Rahman! What is your opinion if somebody becomes Junub and no water is available?\" `Abdullah replied, \"Do not pray till water is found.\" Abu Musa said, \"What do you say about the statement of `Ammar (who was ordered by the Prophet to perform Tayammum). The Prophet said to him: \"Perform Tayammum and that would be sufficient.\" `Abdullah replied, \"Don't you see that `Umar was not satisfied by `Ammar's statement?\" Abu- Musa said, \"All right, leave `Ammar's statement, but what will you say about this verse (of Tayammum)?\" `Abdullah kept quiet and then said, \"If we allowed it, then they would probably perform Tayammum even if water was available, if one of them found it (water) cold.\" The narrator added, \"I said to Shaqiq, \"Then did `Abdullah dislike to perform Tayammum because of this?\" He replied, \"Yes.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11353"
      ]
    },
    {
      "hadith_no": "514",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا عمر بن حفص، قال حدثنا أبي قال، حدثنا الأعمش، قال حدثنا إبراهيم، عن الأسود، عن عائشة،‏.‏ قال الأعمش وحدثني مسلم، عن مسروق، عن عائشة، ذكر عندها ما يقطع الصلاة الكلب والحمار والمرأة فقالت شبهتمونا بالحمر والكلاب، والله لقد رأيت النبي صلى الله عليه وسلم يصلي، وإني على السرير  بينه وبين القبلة  مضطجعة فتبدو لي الحاجة، فأكره أن أجلس فأوذي النبي صلى الله عليه وسلم فأنسل من عند رجليه‏.‏",
      "text_en": " Narrated `Aisha:                     The things which annual prayer were mentioned before me (and those were): a dog, a donkey and a woman. I said, \"You have compared us (women) to donkeys and dogs. By Allah! I saw the Prophet praying while I used to lie in (my) bed between him and the Qibla. Whenever I was in need of something, I disliked to sit and trouble the Prophet. So, I would slip away by the side of his feet.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11054",
        "11060",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "538",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عمر بن حفص، قال حدثنا أبي قال، حدثنا الأعمش، حدثنا أبو صالح، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أبردوا بالظهر، فإن شدة الحر من فيح جهنم ‏\"‏‏.‏ تابعه سفيان ويحيى وأبو عوانة عن الأعمش‏.‏",
      "text_en": " Narrated Abu Sa`id:                     that Allah's Apostle said, \"Pray Zuhr prayer when it becomes (a bit) cooler as the severity of heat is from the raging of the Hell-fire.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "19291",
        "38"
      ]
    },
    {
      "hadith_no": "650",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عمر بن حفص، قال حدثنا أبي قال، حدثنا الأعمش، قال سمعت سالما، قال سمعت أم الدرداء، تقول دخل على أبو الدرداء وهو مغضب فقلت ما أغضبك فقال والله ما أعرف من أمة محمد صلى الله عليه وسلم شيئا إلا أنهم يصلون جميعا‏.‏",
      "text_en": " Narrated Salim:                     I heard Um Ad-Darda' saying, \"Abu Ad-Darda' entered the house in an angry mood. I said to him. 'What makes you angry?' He replied, 'By Allah! I do not find the followers of Muhammad doing those good things (which they used to do before) except the offering of congregational prayer.\" (This happened in the last days of Abu Ad-Darda' during the rule of `Uthman) .",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11011"
      ]
    },
    {
      "hadith_no": "657",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عمر بن حفص، قال حدثنا أبي قال، حدثنا الأعمش، قال حدثني أبو صالح، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ ليس صلاة أثقل على المنافقين من الفجر والعشاء، ولو يعلمون ما فيهما لأتوهما ولو حبوا، لقد هممت أن آمر المؤذن فيقيم، ثم آمر رجلا يؤم الناس، ثم آخذ شعلا من نار فأحرق على من لا يخرج إلى الصلاة بعد ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"No prayer is harder for the hypocrites than the Fajr and the `Isha' prayers and if they knew the reward for these prayers at their respective times, they would certainly present themselves (in the mosques) even if they had to c awl.\" The Prophet added, \"Certainly I decided to order the Mu'adh-dhin (call-maker) to pronounce Iqama and order a man to lead the prayer and then take a fire flame to burn all those who had not left their houses so far for the prayer along with their houses.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "19291",
        "13"
      ]
    },
    {
      "hadith_no": "664",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عمر بن حفص بن غياث، قال حدثني أبي قال، حدثنا الأعمش، عن إبراهيم، قال الأسود قال كنا عند عائشة  رضى الله عنها  فذكرنا المواظبة على الصلاة والتعظيم لها، قالت لما مرض رسول الله صلى الله عليه وسلم مرضه الذي مات فيه، فحضرت الصلاة فأذن، فقال ‏\"‏ مروا أبا بكر فليصل بالناس ‏\"‏‏.‏ فقيل له إن أبا بكر رجل أسيف، إذا قام في مقامك لم يستطع أن يصلي بالناس، وأعاد فأعادوا له، فأعاد الثالثة فقال ‏\"‏ إنكن صواحب يوسف، مروا أبا بكر فليصل بالناس ‏\"‏‏.‏ فخرج أبو بكر فصلى، فوجد النبي صلى الله عليه وسلم من نفسه خفة، فخرج يهادى بين رجلين كأني أنظر رجليه تخطان من الوجع، فأراد أبو بكر أن يتأخر، فأومأ إليه النبي صلى الله عليه وسلم أن مكانك، ثم أتي به حتى جلس إلى جنبه‏.‏ قيل للأعمش وكان النبي صلى الله عليه وسلم يصلي وأبو بكر يصلي بصلاته، والناس يصلون بصلاة أبي بكر فقال برأسه نعم‏.‏ رواه أبو داود عن شعبة عن الأعمش بعضه‏.‏ وزاد أبو معاوية جلس عن يسار أبي بكر فكان أبو بكر يصلي قائما‏.‏",
      "text_en": " Narrated Al-Aswad:                     \"We were with `Aisha discussing the regularity of offering the prayer and dignifying it. She said, 'When Allah's Apostle fell sick with the fatal illness and when the time of prayer became due and Adhan was pronounced, he said, 'Tell Abu Bakr to lead the people in prayer.' He was told that Abu Bakr was a softhearted man and would not be able to lead the prayer in his place. The Prophet gave the same order again but he was given the same reply. He gave the order for the third time and said, 'You (women) are the companions of Joseph. Tell Abu Bakr to lead the prayer.' So Abu Bakr came out to lead the prayer. In the meantime the condition of the Prophet improved a bit and he came out with the help of two men one on each side. As if I was observing his legs dragging on the ground owing to the disease. Abu Bakr wanted to retreat but the Prophet beckoned him to remain at his place and the Prophet was brought till he sat beside Abu Bakr.\" Al-A`mash was asked, \"Was the Prophet praying and Abu Bakr following him, and were the people following Abu Bakr in that prayer?\" Al- A`mash replied in the affirmative with a nod of his head. Abu Muawiya said, \"The Prophet was sitting on the left side of Abu Bakr who was praying while standing.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11054"
      ]
    },
    {
      "hadith_no": "760",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا عمر بن حفص، قال حدثنا أبي قال، حدثنا الأعمش، حدثني عمارة، عن أبي معمر، قال سألنا خبابا أكان النبي صلى الله عليه وسلم يقرأ في الظهر والعصر قال نعم‏.‏ قلنا بأى شىء كنتم تعرفون قال باضطراب لحيته‏.‏",
      "text_en": " Narrated Abu Ma`mar:                     I asked Khabbab whether the Prophet used to recite the Qur'an in the Zuhr and the `Asr prayers. He replied in the affirmative. We said, \"How did you come to know that?\" He said, \"From the movement of his beard.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11379",
        "11360"
      ]
    },
    {
      "hadith_no": "971",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد، حدثنا عمر بن حفص، قال حدثنا أبي، عن عاصم، عن حفصة، عن أم عطية، قالت كنا نؤمر أن نخرج يوم العيد، حتى نخرج البكر من خدرها، حتى نخرج الحيض فيكن خلف الناس، فيكبرن بتكبيرهم، ويدعون بدعائهم يرجون بركة ذلك اليوم وطهرته‏.‏",
      "text_en": " Narrated Um `Atiya:                     We used to be ordered to come out on the Day of `Id and even bring out the virgin girls from their houses and menstruating women so that they might stand behind the men and say Takbir along with them and invoke Allah along with them and hope for the blessings of that day and for purification from sins.",
      "chain": [
        "30213",
        "30204",
        "20317",
        "11080",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "996",
      "source": " Sahih Bukhari ",
      "chapter": "Witr Prayer - كتاب الوتر",
      "chapter_no": "14",
      "text_ar": "حدثنا عمر بن حفص، قال حدثنا أبي قال، حدثنا الأعمش، قال حدثني مسلم، عن مسروق، عن عائشة، قالت كل الليل أوتر رسول الله صلى الله عليه وسلم وانتهى وتره إلى السحر‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle offered witr prayer at different nights at various hours extending (from the `Isha' prayer) up to the last hour of the night.",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "1238",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثنا شقيق، عن عبد الله  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من مات يشرك بالله شيئا دخل النار ‏\"‏‏.‏ وقلت أنا من مات لا يشرك بالله شيئا دخل الجنة‏.‏",
      "text_en": " Narrated `Abdullah:                     Allah's Apostle said, \"Anyone who dies worshipping others along with Allah will definitely enter the Fire.\" I said, \"Anyone who dies worshipping none along with Allah will definitely enter Paradise.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "1276",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، حدثنا شقيق، حدثنا خباب  رضى الله عنه  قال هاجرنا مع النبي صلى الله عليه وسلم نلتمس وجه الله، فوقع أجرنا على الله، فمنا من مات لم يأكل من أجره شيئا منهم مصعب بن عمير، ومنا من أينعت له ثمرته فهو يهدبها‏.‏ قتل يوم أحد، فلم نجد ما نكفنه إلا بردة إذا غطينا بها رأسه خرجت رجلاه، وإذا غطينا رجليه خرج رأسه، فأمرنا النبي صلى الله عليه وسلم أن نغطي رأسه، وأن نجعل على رجليه من الإذخر‏.‏",
      "text_en": " Narrated Khabbab:                     We emigrated with the Prophet (p.b.u.h) in Allah's cause, and so our reward was then surely incumbent on Allah. Some of us died and they did not take anything from their rewards in this world, and amongst them was Mustab bin `Umar; and the others were those who got their rewards. Mustab bin `Umar was martyred on the day of the Battle of Uhud and we could get nothing except his Burd to shroud him in. And when we covered his head his feet became bare and vice versa. So the Prophet ordered us to cover his head only and to put idhkhir (a kind of shrub) over his feet.",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11353",
        "149"
      ]
    },
    {
      "hadith_no": "1298",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، عن عبد الله بن مرة، عن مسروق، عن عبد الله  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ ليس منا من ضرب الخدود، وشق الجيوب، ودعا بدعوى الجاهلية ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet said, \"He who slaps the cheeks, tears the clothes and follows the traditions of the Days of Ignorance is not from us.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11362",
        "11018",
        "16"
      ]
    },
    {
      "hadith_no": "1394",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثني عمرو بن مرة، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال قال أبو لهب  عليه لعنة الله  للنبي صلى الله عليه وسلم تبا لك سائر اليوم‏.‏ فنزلت ‏{‏تبت يدا أبي لهب وتب‏}‏ ‏.‏",
      "text_en": " Narrated Ibn `Abbas.:                     Abu Lahab, may Allah curse him, once said to the Prophet (p.b.u.h), \"Perish you all the day.\" Then the Divine Inspiration came: \"Perish the hands of Abi Lahab! And perish he!\" (111.1).",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11381",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1462",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، عن شقيق، عن مسروق، عن عائشة  رضى الله عنها  قالت قال النبي صلى الله عليه وسلم ‏\"‏ إذا أطعمت المرأة من بيت زوجها غير مفسدة، لها أجرها، وله مثله، وللخازن مثل ذلك، له بما اكتسب، ولها بما أنفقت ‏\"‏‏.‏",
      "text_en": " Narrate Aisha:                     The Prophet said, \"If a woman gives in charity from her husband's house ..\" The Prophet (p.b.u.h) also said, \"If a lady gives meals (in charity) from her husband's house without spoiling her husband's property, she will get a reward and her husband will also get a reward likewise. The husband will get a reward because of his earnings and the woman because of her spending.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11353",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "1483",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، عن المعرور بن سويد، عن أبي ذر  رضى الله عنه  قال انتهيت إلى النبي صلى الله عليه وسلم قال ‏\"‏ والذي نفسي بيده  أو والذي لا إله غيره، أو كما حلف  ما من رجل تكون له إبل أو بقر أو غنم لا يؤدي حقها إلا أتي بها يوم القيامة أعظم ما تكون وأسمنه، تطؤه بأخفافها، وتنطحه بقرونها، كلما جازت أخراها ردت عليه أولاها، حتى يقضى بين الناس ‏\"‏‏.‏ رواه بكير عن أبي صالح عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Dhar:                     Once I went to him (the Prophet ) and he said, \"By Allah in Whose Hands my life is (or probably said, 'By Allah, except Whom none has the right to be worshipped) whoever had camels or cows or sheep and did not pay their Zakat, those animals will be brought on the Day of Resurrection far bigger and fatter than before and they will tread him under their hooves, and will butt him with their horns, and (those animals will come in circle): When the last does its turn, the first will start again, and this punishment will go on till Allah has finished the judgments amongst the people.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11397",
        "23"
      ]
    },
    {
      "hadith_no": "1489",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، قال حدثني شقيق، عن عمرو بن الحارث، عن زينب، امرأة عبد الله  رضى الله عنهما  قال فذكرته لإبراهيم فحدثني إبراهيم عن أبي عبيدة عن عمرو بن الحارث عن زينب امرأة عبد الله بمثله سواء، قالت كنت في المسجد فرأيت النبي صلى الله عليه وسلم فقال ‏\"‏ تصدقن ولو من حليكن ‏\"‏‏.‏ وكانت زينب تنفق على عبد الله وأيتام في حجرها، قال فقالت لعبد الله سل رسول الله صلى الله عليه وسلم أيجزي عني أن أنفق عليك وعلى أيتامي في حجري من الصدقة فقال سلي أنت رسول الله صلى الله عليه وسلم‏.‏ فانطلقت إلى النبي صلى الله عليه وسلم‏.‏ فوجدت امرأة من الأنصار على الباب، حاجتها مثل حاجتي، فمر علينا بلال فقلنا سل النبي صلى الله عليه وسلم أيجزي عني أن أنفق على زوجي وأيتام لي في حجري وقلنا لا تخبر بنا‏.‏ فدخل فسأله فقال ‏\"‏ من هما ‏\"‏‏.‏ قال زينب قال ‏\"‏ أى الزيانب ‏\"‏‏.‏ قال امرأة عبد الله‏.‏ قال ‏\"‏ نعم لها أجران أجر القرابة وأجر الصدقة ‏\"‏‏.‏",
      "text_en": " Narrated `Amr bin Al-Harith:                     Zainab, the wife of `Abdullah said, \"I was in the Mosque and saw the Prophet (p.b.u.h) saying, 'O women ! Give alms even from your ornaments.' \" Zainab used to provide for `Abdullah and those orphans who were under her protection. So she said to `Abdullah, \"Will you ask Allah's Apostle whether it will be sufficient for me to spend part of the Zakat on you and the orphans who are under my protection?\" He replied \"Will you yourself ask Allah's Apostle ?\" (Zainab added): So I went to the Prophet and I saw there an Ansari woman who was standing at the door (of the Prophet ) with a similar problem as mine. Bilal passed by us and we asked him, 'Ask the Prophet whether it is permissible for me to spend (the Zakat) on my husband and the orphans under my protection.' And we requested Bilal not to inform the Prophet about us. So Bilal went inside and asked the Prophet regarding our problem. The Prophet (p.b.u.h) asked, \"Who are those two?\" Bilal replied that she was Zainab. The Prophet said, \"Which Zainab?\" Bilal said, \"The wife of `Abdullah (bin Mas`ud).\" The Prophet said, \"Yes, (it is sufficient for her) and she will receive a double rewards (for that): One for helping relatives, and the other for giving Zakat.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11353",
        "20377"
      ]
    },
    {
      "hadith_no": "1504",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، حدثنا أبو صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لأن يأخذ أحدكم حبله، ثم يغدو  أحسبه قال  إلى الجبل فيحتطب، فيبيع فيأكل ويتصدق خير له من أن يسأل الناس ‏\"‏‏.‏ قال أبو عبد الله صالح بن كيسان أكبر من الزهري، وهو قد أدرك ابن عمر‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"No doubt, it is better for a person to take a rope and proceed in the morning to the mountains and cut the wood and then sell it, and eat from this income and give alms from it than to ask others for something.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "19291",
        "13"
      ]
    },
    {
      "hadith_no": "1708",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، قال حدثني عمارة، عن عبد الرحمن، عن عبد الله  رضى الله عنه  قال ما رأيت النبي صلى الله عليه وسلم صلى صلاة بغير ميقاتها إلا صلاتين جمع بين المغرب والعشاء، وصلى الفجر قبل ميقاتها‏.‏",
      "text_en": " Narrated `Abdullah:                     I never saw the Prophet offering any prayer not at its stated time except two; he prayed the Maghrib and the `Isha' together and he offered the morning prayer before its usual time.",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11378",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "1798",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثني إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  قالت حاضت صفية ليلة النفر، فقالت ما أراني إلا حابستكم‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ عقرى حلقى أطافت يوم النحر ‏\"‏‏.‏ قيل نعم‏.‏ قال ‏\"‏ فانفري ‏\"‏‏.‏   قال أبو عبد الله وزادني محمد حدثنا محاضر، حدثنا الأعمش، عن إبراهيم، عن الأسود، عن عائشة  رضى الله عنها  قالت خرجنا مع رسول الله صلى الله عليه وسلم لا نذكر إلا الحج، فلما قدمنا أمرنا أن نحل، فلما كانت ليلة النفر حاضت صفية بنت حيى، فقال النبي صلى الله عليه وسلم ‏\"‏ حلقى عقرى، ما أراها إلا حابستكم ‏\"‏‏.‏ ثم قال ‏\"‏ كنت طفت يوم النحر ‏\"‏‏.‏ قالت نعم‏.‏ قال ‏\"‏ فانفري ‏\"‏‏.‏ قلت يا رسول الله‏.‏ إني لم أكن حللت‏.‏ قال ‏\"‏ فاعتمري من التنعيم ‏\"‏‏.‏ فخرج معها أخوها، فلقيناه مدلجا‏.‏ فقال ‏\"‏ موعدك مكان كذا وكذا ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Safiya got her menses on the night of Nafr (departure from Hajj), and she said, \"I see that I will detain you.\" The Prophet said, \"Aqra Halqa! Did she perform the Tawaf on the Day of Nahr (slaughtering)?\" Somebody replied in the affirmative. He said, \"Then depart.\" (Different narrators mentioned that) `Aisha said, \"We set out with Allah''s Apostle (from Medina) with the intention of performing Hajj only. When we reached Mecca, he ordered us to finish the Ihram. When it was the night of Nafr (departure), Safiya bint Huyay got her menses. The Prophet said, \"Halqa Aqra! I think that she will detain you,\" and added, \"Did you perform the Tawaf (Al-Ifada) on the Day of Nahr (slaughtering)?\" She replied, \"Yes.\" He said, \"Then depart.\" I said, \"O Allah''s Apostle! I have not (done the Umra).\" He replied, \"Perform `Umra from Tan`im.\" My brother went with me and we came across the Prophet in the last part of the night. He said, \"Wait at such and such a place.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "1861",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، قال حدثني إبراهيم، عن الأسود، عن عبد الله  رضى الله عنه  قال بينما نحن مع النبي صلى الله عليه وسلم في غار بمنى، إذ نزل عليه ‏{‏والمرسلات‏}‏ وإنه ليتلوها، وإني لأتلقاها من فيه، وإن فاه لرطب بها، إذ وثبت علينا حية فقال النبي صلى الله عليه وسلم ‏\"‏ اقتلوها ‏\"‏‏.‏ فابتدرناها، فذهبت، فقال النبي صلى الله عليه وسلم ‏\"‏ وقيت شركم كما وقيتم شرها ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     While we were in the company of the Prophet in a cave at Mina, when Surat-wal-Mursalat were revealed and he recited it and I heard it (directly) from his mouth as soon as he recited its revelation. Suddenly a snake sprang at us and the Prophet said (ordered us): \"Kill it.\" We ran to kill it but it escaped quickly. The Prophet said, \"It has escaped your evil and you too have escaped its evil.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "1985",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، حدثنا أبو صالح، عن أبي هريرة  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا يصومن أحدكم يوم الجمعة، إلا يوما قبله أو بعده ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard the Prophet saying, \"None of you should fast on Friday unless he fasts a day before or after it.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "19291",
        "13"
      ]
    },
    {
      "hadith_no": "2081",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، قال حدثني شقيق، عن أبي مسعود، قال جاء رجل من الأنصار يكنى أبا شعيب فقال لغلام له قصاب اجعل لي طعاما يكفي خمسة، فإني أريد أن أدعو النبي صلى الله عليه وسلم خامس خمسة، فإني قد عرفت في وجهه الجوع‏.‏ فدعاهم، فجاء معهم رجل فقال النبي صلى الله عليه وسلم ‏\"‏ إن هذا قد تبعنا، فإن شئت أن تأذن له فأذن له، وإن شئت أن يرجع رجع ‏\"‏‏.‏ فقال لا، بل قد أذنت له‏.‏",
      "text_en": " Narrated Abu Mas`ud:                     An Ansari man, called Abu Shu'aib, came and told his butcher slave, \"Prepare meals sufficient for five persons, for I want to invite the Prophet along with four other persons as I saw signs of hunger on his face.\" Abu Shu'aib invited them and another person came along with them. The Prophet said (to Abu Shu'aib), This man followed us, so if you allow him, he will join us, and if you want him to return, he will go back.\" Abu Shu'aib said, \"No, I have allowed him (i.e. he, too, is welcomed to the meal).",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11353",
        "402"
      ]
    },
    {
      "hadith_no": "2200",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، قال ذكرنا عند إبراهيم الرهن في السلف، فقال لا بأس به‏.‏ ثم حدثنا عن الأسود عن عائشة  رضى الله عنها  أن النبي صلى الله عليه وسلم اشترى طعاما من يهودي إلى أجل، فرهنه درعه‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet bought some foodstuff from a Jew on credit and mortgaged his armor to him.",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2275",
      "source": " Sahih Bukhari ",
      "chapter": "Hiring - كتاب الإجارة",
      "chapter_no": "37",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، عن مسلم، عن مسروق، حدثنا خباب، قال كنت رجلا قينا فعملت للعاص بن وائل فاجتمع لي عنده فأتيته أتقاضاه فقال لا والله لا أقضيك حتى تكفر بمحمد‏.‏ فقلت أما والله حتى تموت ثم تبعث فلا‏.‏ قال وإني لميت ثم مبعوث قلت نعم‏.‏ قال فإنه سيكون لي ثم مال وولد فأقضيك‏.‏ فأنزل الله تعالى ‏{‏أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا‏}‏",
      "text_en": " Narrated Khabbab:                     I was a blacksmith and did some work for Al-`As bin Wail. When he owed me some money for my work, I went to him to ask for that amount. He said, \"I will not pay you unless you disbelieve in Muhammad.\" I said, \"By Allah! I will never do that till you die and be resurrected.\" He said, \"Will I be dead and then resurrected after my death?\" I said, \"Yes.\" He said, \"There I will have property and offspring and then I will pay you your due.\" Then Allah revealed. 'Have you seen him who disbelieved in Our signs, and yet says: I will be given property and offspring?' (19.77)",
      "chain": [
        "30204",
        "20317",
        "11060",
        "20285",
        "11018",
        "149"
      ]
    },
    {
      "hadith_no": "2686",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، قال حدثني الشعبي، أنه سمع النعمان بن بشير  رضى الله عنهما  يقول قال النبي صلى الله عليه وسلم ‏\"‏ مثل المدهن في حدود الله والواقع فيها مثل قوم استهموا سفينة، فصار بعضهم في أسفلها وصار بعضهم في أعلاها، فكان الذي في أسفلها يمرون بالماء على الذين في أعلاها، فتأذوا به، فأخذ فأسا، فجعل ينقر أسفل السفينة، فأتوه فقالوا ما لك قال تأذيتم بي، ولا بد لي من الماء، فإن أخذوا على يديه أنجوه ونجوا أنفسهم، وإن تركوه أهلكوه وأهلكوا أنفسهم ‏\"‏‏.‏",
      "text_en": " Narrated An-Nu`man bin Bashir:                     The Prophet said, \"The example of the person abiding by Allah's orders and limits (or the one who abides by the limits and regulations prescribed by Allah) in comparison to the one who do wrong and violate Allah's limits and orders is like the example of people drawing lots for seats in a boat. Some of them got seats in the upper part while the others in the lower part ; those in the, lower part have to pass by those in the upper one to get water, and that troubled the latter. One of them (i.e. the people in the lower part) took an ax and started making a hole in the bottom of the boat. The people of the upper part came and asked him, (saying), 'What is wrong with you?' He replied, \"You have been troubled much by my (coming up to you), and I have to get water.' Now if they prevent him from doing that they will save him and themselves, but if they leave him (to do what he wants), they will destroy him and themselves.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "3191",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، حدثنا جامع بن شداد، عن صفوان بن محرز، أنه حدثه عن عمران بن حصين  رضى الله عنهما  قال دخلت على النبي صلى الله عليه وسلم وعقلت ناقتي بالباب، فأتاه ناس من بني تميم فقال ‏\"‏ اقبلوا البشرى يا بني تميم ‏\"‏‏.‏ قالوا قد بشرتنا فأعطنا‏.‏ مرتين، ثم دخل عليه ناس من أهل اليمن فقال ‏\"‏ اقبلوا البشرى يا أهل اليمن، إذ لم يقبلها بنو تميم ‏\"‏‏.‏ قالوا قد قبلنا يا رسول الله، قالوا جئناك نسألك عن هذا الأمر قال ‏\"‏ كان الله ولم يكن شىء غيره، وكان عرشه على الماء، وكتب في الذكر كل شىء، وخلق السموات والأرض ‏\"‏‏.‏ فنادى مناد ذهبت ناقتك يا ابن الحصين‏.‏ فانطلقت فإذا هي يقطع دونها السراب، فوالله لوددت أني كنت تركتها‏.‏",
      "text_en": "     Narrated Imran bin Husain:                       I went to the Prophet and tied my she-camel at the gate. The people of Bani Tamim came to the Prophet who said \"O Bani Tamim! Accept the good tidings.\" They said twice, 'You have given us the good tidings, now give us something\" Then some Yemenites came to him and he said, \"Accept the good tidings, O people of Yemem, for Bani Tamim refused them.\" They said, \"We accept it, O Allah's Apostle! We have come to ask you about this matter (i.e. the start of creations).\" He said, \"First of all, there was nothing but Allah, and (then He created His Throne). His throne was over the water, and He wrote everything in the Book (in the Heaven) and created the Heavens and the Earth.\" Then a man shouted, \"O Ibn Husain! Your she-camel has gone away!\" So, I went away and could not see the she-camel because of the mirage. By Allah, I wished I had left that she-camel (but not that gathering).",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11328",
        "11693",
        "123"
      ]
    },
    {
      "hadith_no": "3332",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثنا زيد بن وهب، حدثنا عبد الله، حدثنا رسول الله صلى الله عليه وسلم وهو الصادق المصدوق ‏\"‏ إن أحدكم يجمع في بطن أمه أربعين يوما، ثم يكون علقة مثل ذلك، ثم يكون مضغة مثل ذلك، ثم يبعث الله إليه ملكا بأربع كلمات، فيكتب عمله وأجله ورزقه وشقي أو سعيد، ثم ينفخ فيه الروح، فإن الرجل ليعمل بعمل أهل النار حتى ما يكون بينه وبينها إلا ذراع، فيسبق عليه الكتاب فيعمل بعمل أهل الجنة، فيدخل الجنة، وإن الرجل ليعمل بعمل أهل الجنة، حتى ما يكون بينه وبينها إلا ذراع فيسبق عليه الكتاب، فيعمل بعمل أهل النار فيدخل النار ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     Allah's Apostle, the true and truly inspired said, \"(as regards your creation), every one of you is collected in the womb of his mother for the first forty days, and then he becomes a clot for an other forty days, and then a piece of flesh for an other forty days. Then Allah sends an angel to write four words: He writes his deeds, time of his death, means of his livelihood, and whether he will be wretched or blessed (in religion). Then the soul is breathed into his body. So a man may do deeds characteristic of the people of the (Hell) Fire, so much so that there is only the distance of a cubit between him and it, and then what has been written (by the angel) surpasses, and so he starts doing deeds characteristic of the people of Paradise and enters Paradise. Similarly, a person may do deeds characteristic of the people of Paradise, so much so that there is only the distance of a cubit between him and it, and then what has been written (by the angel) surpasses, and he starts doing deeds of the people of the (Hell) Fire and enters the (Hell) Fire.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11341",
        "16"
      ]
    },
    {
      "hadith_no": "3335",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، قال حدثني عبد الله بن مرة، عن مسروق، عن عبد الله  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقتل نفس ظلما إلا كان على ابن آدم الأول كفل من دمها، لأنه أول من سن القتل ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     Allah's Apostle said, \"Whenever a person is murdered unjustly, there is a share from the burden of the crime on the first son of Adam for he was the first to start the tradition of murdering.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11362",
        "11018",
        "16"
      ]
    },
    {
      "hadith_no": "3360",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، قال حدثني إبراهيم، عن علقمة، عن عبد الله  رضى الله عنه  قال لما نزلت ‏{‏الذين آمنوا ولم يلبسوا إيمانهم بظلم‏}‏ قلنا يا رسول الله أينا لا يظلم نفسه قال ‏\"‏ ليس كما تقولون ‏{‏لم يلبسوا إيمانهم بظلم‏}‏ بشرك، أولم تسمعوا إلى قول لقمان لابنه ‏{‏يا بنى لا تشرك بالله إن الشرك لظلم عظيم ‏}‏‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     When the Verse:--\"It is those who believe and do not confuse their belief with wrong ( i.e. joining others in worship with Allah\" (6.83) was revealed, we said, \"O Allah's Apostle! Who is there amongst us who has not done wrong to himself?\" He replied, \"It is not as you say, for 'wrong' in the Verse and 'do not confuse their belief, with wrong means 'SHIRK' (i.e. joining others in worship with Allah). Haven't you heard Luqman's saying to his son, 'O my son! Join not others in worship with Allah, verily joining others in worship with Allah is a great wrong indeed.\" (31.13)",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "3425",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثني عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثنا إبراهيم التيمي، عن أبيه، عن أبي ذر  رضى الله عنه  قال قلت يا رسول الله‏.‏ أى مسجد وضع أول قال ‏\"‏ المسجد الحرام ‏\"‏‏.‏ قلت ثم أى قال ‏\"‏ ثم المسجد الأقصى ‏\"‏‏.‏ قلت كم كان بينهما قال ‏\"‏ أربعون ‏\"‏‏.‏ ثم قال ‏\"‏ حيثما أدركتك الصلاة فصل، والأرض لك مسجد ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhaar:                     I said, \"O Allah's Apostle! Which mosque was built first?\" He replied, \"Al-Masjid-ul-Haram.\" I asked, \"Which (was built) next?\" He replied, \"Al-Masjid-ul-Aqs-a (i.e. Jerusalem).\" I asked, \"What was the period in between them?\" He replied, \"Forty (years).\" He then added, \"Wherever the time for the prayer comes upon you, perform the prayer, for all the earth is a place of worshipping for you.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11322",
        "11405",
        "23"
      ]
    },
    {
      "hadith_no": "3477",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، قال حدثني شقيق، قال عبد الله كأني أنظر إلى النبي صلى الله عليه وسلم يحكي نبيا من الأنبياء ضربه قومه فأدموه، وهو يمسح الدم عن وجهه، ويقول ‏\"‏ اللهم اغفر لقومي فإنهم لا يعلمون ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     As if I saw the Prophet talking about one of the prophets whose nation had beaten him and caused him to bleed, while he was cleaning the blood off his face and saying, \"O Allah! Forgive my nation, for they have no knowledge.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11353"
      ]
    },
    {
      "hadith_no": "3565",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثنا عمرو بن مرة، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال لما نزلت ‏{‏وأنذر عشيرتك الأقربين‏}‏ جعل النبي صلى الله عليه وسلم ينادي ‏\"‏ يا بني فهر، يا بني عدي لبطون قريش ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When the Verse:-- 'And warn your tribe of near kindred.' (26.214) was revealed, the Prophet started calling (the 'Arab tribes), \"O Bani Fihr, O Bani `Adi\" mentioning first the various branch tribes of Quraish.",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11381",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3919",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثنا إبراهيم، عن أبي معمر، عن عبد الله  رضى الله عنه  قال انشق القمر‏.‏",
      "text_en": " Narrated `Abdullah:                     The moon was split (into two pieces).",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11360",
        "16"
      ]
    },
    {
      "hadith_no": "4274",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن أبي الحسين، حدثنا عمر بن حفص، حدثنا أبي، عن عاصم، عن عامر، عن ابن عباس  رضى الله عنهما  قال لا أدري أنهى عنه رسول الله صلى الله عليه وسلم من أجل أنه كان حمولة الناس، فكره أن تذهب حمولتهم، أو حرمه في يوم خيبر، لحم الحمر الأهلية‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I do not know whether the Prophet forbade the eating of donkey-meat (temporarily) because they were the beasts of burden for the people, and he disliked that their means of transportation should be lost, or he forbade it on the day of Khaibar permanently.",
      "chain": [
        "30204",
        "20317",
        "11080",
        "11052",
        "17"
      ]
    },
    {
      "hadith_no": "4280",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق بن إبراهيم، سمع حفص بن غياث، حدثنا بريد بن عبد الله، عن أبي بردة، عن أبي موسى، قال قدمنا على النبي صلى الله عليه وسلم بعد أن افتتح خيبر، فقسم لنا، ولم يقسم لأحد لم يشهد الفتح غيرنا‏.‏",
      "text_en": " Narrated Abu Musa:                     We came upon the Prophet after he had conquered Khaibar. He then gave us a share (from the booty), but apart from us he did not give to anybody else who did not attend the Conquest.",
      "chain": [
        "30123",
        "20317",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "4316",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "وقال عمر بن حفص بن غياث حدثنا أبي، عن يزيد بن أبي عبيد، قال سمعت سلمة، يقول غزوت مع النبي صلى الله عليه وسلم سبع غزوات، وخرجت فيما يبعث من البعث تسع غزوات، علينا مرة أبو بكر، ومرة أسامة‏.‏",
      "text_en": "",
      "chain": [
        "30204",
        "20317",
        "11450",
        "237"
      ]
    },
    {
      "hadith_no": "4582",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، حدثنا مسلم، عن مسروق، عن عائشة  رضى الله عنها  قالت لما نزلت الآيات من آخر سورة البقرة في الربا قرأها رسول الله صلى الله عليه وسلم على الناس، ثم حرم التجارة في الخمر‏.‏",
      "text_en": " Narrated `Aisha:                     When the Verses of Surat-al-Baqara regarding usury (i.e. Riba) were revealed, Allah's Apostle recited them before the people and then he prohibited the trade of alcoholic liquors.",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "4645",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، قال حدثني إبراهيم، عن الأسود، قال كنا في حلقة عبد الله فجاء حذيفة حتى قام علينا، فسلم ثم قال لقد أنزل النفاق على قوم خير منكم‏.‏ قال الأسود سبحان الله، إن الله يقول ‏{‏إن المنافقين في الدرك الأسفل من النار‏}‏ فتبسم عبد الله، وجلس حذيفة في ناحية المسجد، فقام عبد الله فتفرق أصحابه، فرماني بالحصا، فأتيته فقال حذيفة عجبت من ضحكه، وقد عرف ما قلت، لقد أنزل النفاق على قوم كانوا خيرا منكم، ثم تابوا فتاب الله عليهم‏.‏",
      "text_en": " Narrated Al-Aswad:                     While we were sitting in a circle in `Abdullah's gathering, Hudhaifa came and stopped before us, and greeted us and then said, \"People better than you became hypocrites.\" Al-Aswad said: I testify the uniqueness of Allah! Allah says: \"Verily! The hypocrites will be in the lowest depths of the Fire.\" (4.145) On that `Abdullah smiled and Hudhaifa sat somewhere in the Mosque. `Abdullah then got up and his companions (sitting around him) dispersed. Hudhaifa then threw a pebble at me (to attract my attention). I went to him and he said, \"I was surprised at `Abdullah's smile though he understood what I said. Verily, people better than you became hypocrite and then repented and Allah forgave them.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11054"
      ]
    },
    {
      "hadith_no": "4768",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، قال حدثني إبراهيم، عن علقمة، عن عبد الله  رضى الله عنه  قال بينا أنا مع النبي صلى الله عليه وسلم في حرث وهو متكئ على عسيب إذ مر اليهود، فقال بعضهم لبعض سلوه عن الروح، فقال ما رابكم إليه، وقال بعضهم لا يستقبلكم بشىء تكرهونه فقالوا سلوه فسألوه عن الروح فأمسك النبي صلى الله عليه وسلم فلم يرد عليهم شيئا، فعلمت أنه يوحى إليه، فقمت مقامي، فلما نزل الوحى قال ‏{‏ويسألونك عن الروح قل الروح من أمر ربي وما أوتيتم من العلم إلا قليلا‏}‏‏.‏",
      "text_en": " Narrated `Abdullah:                     While I was in the company of the Prophet on a farm and he was reclining on a palm leave stalk, some Jews passed by. Some of them said to the others. \"Ask him (the Prophet about the spirit.\" Some of them said, \"What urges you to ask him about it\" Others said, \"(Don't) lest he should give you a reply which you dislike.\" But they said, \"Ask him.\" So they asked him about the Spirit. The Prophet kept quiet and did not give them any answer. I knew that he was being divinely inspired so I stayed at my place. When the divine inspiration had been revealed, the Prophet said. \"They ask you (O, Muhammad) concerning the Spirit, Say: \"The spirit,\" its knowledge is with my Lord; and of knowledge you (mankind) have been given only a Little.\" (17.85)",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "4777",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، حدثنا أبو صالح، عن أبي سعيد الخدري  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يؤتى بالموت كهيئة كبش أملح فينادي مناد يا أهل الجنة، فيشرئبون وينظرون فيقول هل تعرفون هذا فيقولون نعم هذا الموت، وكلهم قد رآه، ثم ينادي يا أهل النار، فيشرئبون وينظرون، فيقول هل تعرفون هذا فيقولون نعم هذا الموت، وكلهم قد رآه، فيذبح ثم يقول يا أهل الجنة، خلود فلا موت، ويا أهل النار، خلود فلا موت ثم قرأ ‏{‏وأنذرهم يوم الحسرة إذ قضي الأمر وهم في غفلة‏}‏ وهؤلاء في غفلة أهل الدنيا ‏{‏وهم لا يؤمنون‏}‏‏\"‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Allah's Apostle said, \"On the Day of Resurrection Death will be brought forward in the shape of a black and white ram. Then a call maker will call, 'O people of Paradise!' Thereupon they will stretch their necks and look carefully. The caller will say, 'Do you know this?' They will say, 'Yes, this is Death.' By then all of them will have seen it. Then it will be announced again, 'O people of Hell !' They will stretch their necks and look carefully. The caller will say, 'Do you know this?' They will say, 'Yes, this is Death.' And by then all of them will have seen it. Then it (that ram) will be slaughtered and the caller will say, 'O people of Paradise! Eternity for you and no death O people of Hell! Eternity for you and no death.\"' Then the Prophet, recited:-- 'And warn them of the Day of distress when the case has been decided, while (now) they are in a state of carelessness (i.e. the people of the world) and they do not believe.' (19.39)",
      "chain": [
        "30204",
        "20317",
        "11060",
        "19291",
        "38"
      ]
    },
    {
      "hadith_no": "4788",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثنا أبو صالح، عن أبي سعيد الخدري، قال قال النبي صلى الله عليه وسلم ‏\"‏ يقول الله عز وجل يوم القيامة يا آدم‏.‏ يقول لبيك ربنا وسعديك، فينادى بصوت إن الله يأمرك أن تخرج من ذريتك بعثا إلى النار‏.‏ قال يا رب وما بعث النار قال من كل ألف  أراه قال  تسعمائة وتسعة وتسعين فحينئذ تضع الحامل حملها ويشيب الوليد ‏{‏وترى الناس سكارى وما هم بسكارى ولكن عذاب الله شديد‏}‏ ‏\"‏‏.‏ فشق ذلك على الناس حتى تغيرت وجوههم، فقال النبي صلى الله عليه وسلم ‏\"‏ من يأجوج ومأجوج تسعمائة وتسعة وتسعين، ومنكم واحد، ثم أنتم في الناس كالشعرة السوداء في جنب الثور الأبيض، أو كالشعرة البيضاء في جنب الثور الأسود، وإني لأرجو أن تكونوا ربع أهل الجنة ‏\"‏‏.‏ فكبرنا ثم قال ‏\"‏ ثلث أهل الجنة ‏\"‏‏.‏ فكبرنا ثم قال ‏\"‏ شطر أهل الجنة ‏\"‏‏.‏ فكبرنا‏.‏ قال أبو أسامة عن الأعمش ‏{‏ترى الناس سكارى وما هم بسكارى‏}‏ وقال من كل ألف تسعمائة وتسعة وتسعين‏.‏ وقال جرير وعيسى بن يونس وأبو معاوية ‏{‏سكرى وما هم بسكرى‏}‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"On the day of Resurrection Allah will say, 'O Adam!' Adam will reply, 'Labbaik our Lord, and Sa`daik ' Then there will be a loud call (saying), Allah orders you to take from among your offspring a mission for the (Hell) Fire.' Adam will say, 'O Lord! Who are the mission for the (Hell) Fire?' Allah will say, 'Out of each thousand, take out 999.' At that time every pregnant female shall drop her load (have a miscarriage) and a child will have grey hair. And you shall see mankind as in a drunken state, yet not drunk, but severe will be the torment of Allah.\" (22.2) (When the Prophet mentioned this), the people were so distressed (and afraid) that their faces got changed (in color) whereupon the Prophet said, \"From Gog and Magog nine-hundred ninety-nine will be taken out and one from you. You Muslims (compared to the large number of other people) will be like a black hair on the side of a white ox, or a white hair on the side of a black ox, and I hope that you will be onefourth of the people of Paradise.\" On that, we said, \"Allahu-Akbar!\" Then he said, \"I hope that you will be) one-third of the people of Paradise.\" We again said, \"Allahu-Akbar!\" Then he said, \"(I hope that you will be) one-half of the people of Paradise.\" So we said, Allahu Akbar.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "19291",
        "38"
      ]
    },
    {
      "hadith_no": "4814",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، حدثنا مسلم، عن مسروق، قال قال عبد الله خمس قد مضين الدخان والقمر والروم والبطشة واللزام ‏{‏فسوف يكون لزاما‏}‏",
      "text_en": " Narrated `Abdullah:                     Five (great events) have passed: the Smoke, the Moon, the Romans, the Mighty grasp and the constant Punishment which occurs in 'So the torment will be yours forever.' (25.77)",
      "chain": [
        "30204",
        "20317",
        "11060",
        "20285",
        "11018"
      ]
    },
    {
      "hadith_no": "4817",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، قال حدثني عمرو بن مرة، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال لما نزلت ‏{‏وأنذر عشيرتك الأقربين‏}‏ صعد النبي صلى الله عليه وسلم على الصفا فجعل ينادي ‏\"‏ يا بني فهر، يا بني عدي ‏\"‏‏.‏ لبطون قريش حتى اجتمعوا، فجعل الرجل إذا لم يستطع أن يخرج أرسل رسولا لينظر ما هو، فجاء أبو لهب وقريش فقال ‏\"‏ أرأيتكم لو أخبرتكم أن خيلا بالوادي تريد أن تغير عليكم، أكنتم مصدقي ‏\"‏‏.‏ قالوا نعم، ما جربنا عليك إلا صدقا‏.‏ قال ‏\"‏ فإني نذير لكم بين يدى عذاب شديد ‏\"‏‏.‏ فقال أبو لهب تبا لك سائر اليوم، ألهذا جمعتنا فنزلت ‏{‏تبت يدا أبي لهب وتب * ما أغنى عنه ماله وما كسب‏}‏",
      "text_en": " Narrated Ibn `Abbas:                     When the Verse:--'And warn your tribe of near-kindred, was revealed, the Prophet ascended the Safa (mountain) and started calling, \"O Bani Fihr! O Bani `Adi!\" addressing various tribes of Quraish till they were assembled. Those who could not come themselves, sent their messengers to see what was there. Abu Lahab and other people from Quraish came and the Prophet then said, \"Suppose I told you that there is an (enemy) cavalry in the valley intending to attack you, would you believe me?\" They said, \"Yes, for we have not found you telling anything other than the truth.\" He then said, \"I am a warner to you in face of a terrific punishment.\" Abu Lahab said (to the Prophet) \"May your hands perish all this day. Is it for this purpose you have gathered us?\" Then it was revealed: \"Perish the hands of Abu Lahab (one of the Prophet's uncles), and perish he! His wealth and his children will not profit him....\" (111.1-5)",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11381",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "4862",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي قال، حدثنا الأعمش، قال سمعت أبا صالح، قال سمعت أبا هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ بين النفختين أربعون ‏\"‏‏.‏ قالوا يا أبا هريرة أربعون يوما قال أبيت‏.‏ قال أربعون سنة قال أبيت‏.‏ قال أربعون شهرا‏.‏ قال أبيت، ويبلى كل شىء من الإنسان إلا عجب ذنبه، فيه يركب الخلق‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Between the two blowing of the trumpet there will be forty.\" The people said, \"O Abu Huraira! Forty days?\" I refused to reply. They said, \"Forty years?\" I refused to reply and added: Everything of the human body will decay except the coccyx bone (of the tail) and from that bone Allah will reconstruct the whole body.",
      "chain": [
        "30204",
        "20317",
        "11060",
        "19291",
        "13"
      ]
    },
    {
      "hadith_no": "4984",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثني إبراهيم، عن الأسود، عن عبد الله، قال بينما نحن مع النبي صلى الله عليه وسلم في غار إذ نزلت عليه والمرسلات، فإنه ليتلوها وإني لأتلقاها من فيه وإن فاه لرطب بها، إذ وثبت علينا حية فقال النبي صلى الله عليه وسلم ‏\"‏ اقتلوها ‏\"‏‏.‏ فابتدرناها فذهبت فقال النبي صلى الله عليه وسلم ‏\"‏ وقيت شركم، كما وقيتم شرها ‏\"‏‏.‏ قال عمر حفظته من أبي في غار بمنى‏.‏",
      "text_en": " Narrated `Abdullah:                     While we were with the Prophet in a cave, Surat wal-Mursalat was revealed to him and he recited it, and I heard it directly from his mouth as soon as he recited its revelation. Suddenly a snake sprang at us, and the Prophet said, \"Kill it!\" We ran to kill it but it escaped quickly. The Prophet said. \"It has escaped your evil, and you too have escaped its evil.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "5025",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثني عمرو بن مرة، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال أبو لهب تبا لك ألهذا جمعتنا فنزلت ‏{‏تبت يدا أبي لهب‏}‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Abu Lahab said, \"May you perish! Is it' for this that you have gathered us?\" So there was revealed:-- 'Parish the hands of Abu Lahab'.",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11381",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "5051",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثنا شقيق بن سلمة، قال خطبنا عبد الله فقال والله لقد أخذت من في رسول الله صلى الله عليه وسلم بضعا وسبعين سورة، والله لقد علم أصحاب النبي صلى الله عليه وسلم أني من أعلمهم بكتاب الله وما أنا بخيرهم‏.‏ قال شقيق فجلست في الحلق أسمع ما يقولون فما سمعت رادا يقول غير ذلك‏.‏",
      "text_en": " Narrated Shaqiq bin Salama:                     Once `Abdullah bin Mas`ud delivered a sermon before us and said, \"By Allah, I learnt over seventy Suras direct from Allah's Apostle . By Allah, the companions of the Prophet came to know that I am one of those who know Allah's Book best of all of them, yet I am not the best of them.\" Shaqiq added: I sat in his religious gathering and I did not hear anybody opposing him (in his speech).",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11353"
      ]
    },
    {
      "hadith_no": "5053",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثنا مسلم، عن مسروق، قال قال عبد الله  رضى الله عنه  والله الذي لا إله غيره ما أنزلت سورة من كتاب الله إلا أنا أعلم أين أنزلت ولا أنزلت آية من كتاب الله إلا أنا أعلم فيم أنزلت، ولو أعلم أحدا أعلم مني بكتاب الله تبلغه الإبل لركبت إليه‏.‏",
      "text_en": " Narrated `Abdullah (bin Mas`ud):                     By Allah other than Whom none has the right to be worshipped! There is no Sura revealed in Allah's Book but I know at what place it was revealed; and there is no Verse revealed in Allah's Book but I know about whom it was revealed. And if I know that there is somebody who knows Allah's Book better than I, and he is at a place that camels can reach, I would go to him.",
      "chain": [
        "30204",
        "20317",
        "11060",
        "20285",
        "11018",
        "16"
      ]
    },
    {
      "hadith_no": "5067",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثنا إبراهيم، والضحاك المشرقي، عن أبي سعيد الخدري، رضى الله عنه قال قال النبي صلى الله عليه وسلم لأصحابه ‏\"‏ أيعجز أحدكم أن يقرأ ثلث القرآن في ليلة ‏\"‏‏.‏ فشق ذلك عليهم وقالوا أينا يطيق ذلك يا رسول الله فقال ‏\"‏ الله الواحد الصمد ثلث القرآن ‏\"‏‏.‏ قال أبو عبد الله عن إبراهيم مرسل وعن الضحاك المشرقي مسند‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said to his companions, \"Is it difficult for any of you to recite one third of the Qur'an in one night?\" This suggestion was difficult for them so they said, \"Who among us has the power to do so, O Allah's Apostle?\" Allah Apostle replied: \" Allah (the) One, the Self-Sufficient Master Whom all creatures need.' (Surat Al-Ikhlas 112.1--to the End) is equal to one third of the Qur'an.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11694",
        "38"
      ]
    },
    {
      "hadith_no": "5094",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، قال حدثني إبراهيم، عن علقمة، وعبد الرحمن بن يزيد، عن أبي مسعود الأنصاري، قال قال النبي صلى الله عليه وسلم ‏\"‏ الآيتان من آخر سورة البقرة من قرأ بهما في ليلة كفتاه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Mas`ud Al-Ansari:                     The Prophet said, \"If one recites the last two Verses of Surat-al-Baqara at night, it is sufficient for him (for that night).",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11017",
        "20395",
        "402"
      ]
    },
    {
      "hadith_no": "5103",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، عن الأعمش، قال حدثني إبراهيم، عن عبيدة، عن عبد الله، رضى الله عنه قال قال لي النبي صلى الله عليه وسلم ‏\"‏ اقرأ على القرآن ‏\"‏‏.‏ قلت آقرأ عليك وعليك أنزل قال ‏\"‏ إني أحب أن أسمعه من غيري ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     That the Prophet said to him, \"Recite the Qur'an to me.\" `Abdullah said, \"Shall I recite (the Qur'an) to you while it has been revealed to you?\" He said, \"I like to hear it from others.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "5120",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، قال حدثني إبراهيم، عن علقمة، قال كنت مع عبد الله فلقيه عثمان بمنى فقال يا أبا عبد الرحمن إن لي إليك حاجة‏.‏ فخليا فقال عثمان هل لك يا أبا عبد الرحمن في أن نزوجك بكرا، تذكرك ما كنت تعهد، فلما رأى عبد الله أن ليس له حاجة إلى هذا أشار إلى فقال يا علقمة، فانتهيت إليه وهو يقول أما لئن قلت ذلك لقد قال لنا النبي صلى الله عليه وسلم ‏\"‏ يا معشر الشباب من استطاع منكم الباءة فليتزوج، ومن لم يستطع فعليه بالصوم فإنه له وجاء ‏\"‏‏.‏",
      "text_en": " Narrated 'Alqama:                     While I was with `Abdullah, `Uthman met him at Mina and said, \"O Abu `Abdur-Rahman ! I have something to say to you.\" So both of them went aside and `Uthman said, \"O Abu `Abdur-Rah. man! Shall we marry you to a virgin who will make you remember your past days?\" When `Abdullah felt that he was not in need of that, he beckoned me (to join him) saying, \"O 'Alqama!\" Then I heard him saying (in reply to `Uthman), \"As you have said that, (I tell you that) the Prophet once said to us, 'O young people! Whoever among you is able to marry, should marry, and whoever is not able to marry, is recommended to fast, as fasting diminishes his sexual power.",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "5121",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، قال حدثني عمارة، عن عبد الرحمن بن يزيد، قال دخلت مع علقمة والأسود على عبد الله فقال عبد الله كنا مع النبي صلى الله عليه وسلم شبابا لا نجد شيئا فقال لنا رسول الله صلى الله عليه وسلم ‏\"‏ يا معشر الشباب من استطاع الباءة فليتزوج، فإنه أغض للبصر، وأحصن للفرج، ومن لم يستطع فعليه بالصوم، فإنه له وجاء ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     We were with the Prophet while we were young and had no wealth whatever. So Allah's Apostle said, \"O young people! Whoever among you can marry, should marry, because it helps him lower his gaze and guard his modesty (i.e. his private parts from committing illegal sexual intercourse etc.), and whoever is not able to marry, should fast, as fasting diminishes his sexual power.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11379",
        "20395"
      ]
    },
    {
      "hadith_no": "5275",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، عن شقيق، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ ما من أحد أغير من الله، من أجل ذلك حرم الفواحش، وما أحد أحب إليه المدح من الله ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Masud:                     The Prophet, said, \"There is none having a greater sense of Ghira than Allah. And for that He has forbidden the doing of evil actions (illegal sexual intercourse etc.) There is none who likes to be praised more than Allah does.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "5296",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، قال حدثني شقيق، قال سمعت عبد الله، قال قال النبي صلى الله عليه وسلم ‏\"‏ لا تباشر المرأة المرأة فتنعتها لزوجها كأنه ينظر إليها ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet said, \"A woman should not look at or touch another woman to describe her to her husband in such a way as if he was actually looking at her.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "5317",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثنا مسلم، عن مسروق، عن عائشة  رضى الله عنها  قالت خيرنا رسول الله صلى الله عليه وسلم فاخترنا الله ورسوله، فلم يعد ذلك علينا شيئا‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle gave us the option (to remain with him or to be divorced) and we selected Allah and His Apostle . So, giving us that option was not regarded as divorce.",
      "chain": [
        "30204",
        "20317",
        "11060",
        "20285",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "5409",
      "source": " Sahih Bukhari ",
      "chapter": "Supporting the Family - كتاب النفقات",
      "chapter_no": "69",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثنا أبو صالح، قال حدثني أبو هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ أفضل الصدقة ما ترك غنى، واليد العليا خير من اليد السفلى، وابدأ بمن تعول ‏\"‏‏.‏ تقول المرأة إما أن تطعمني وإما أن تطلقني‏.‏ ويقول العبد أطعمني واستعملني‏.‏ ويقول الابن أطعمني، إلى من تدعني فقالوا يا أبا هريرة سمعت هذا من رسول الله صلى الله عليه وسلم‏.‏ قال لا هذا من كيس أبي هريرة‏.‏",
      "text_en": " Narrated Abu Huraira:                     \"The Prophet said, 'The best alms is that which is given when one is rich, and a giving hand is better than a taking one, and you should start first to support your dependents.' A wife says, 'You should either provide me with food or divorce me.' A slave says, 'Give me food and enjoy my service.\" A son says, \"Give me food; to whom do you leave me?\" The people said, \"O Abu Huraira! Did you hear that from Allah's Apostle ?\" He said, \"No, it is from my own self.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "19291",
        "13"
      ]
    },
    {
      "hadith_no": "5500",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، قال حدثني مجاهد، عن عبد الله بن عمر  رضى الله عنهما  قال بينا نحن عند النبي صلى الله عليه وسلم جلوس إذ أتي بجمار نخلة فقال النبي صلى الله عليه وسلم ‏\"‏ إن من الشجر لما بركته كبركة المسلم ‏\"‏‏.‏ فظننت أنه يعني النخلة، فأردت أن أقول هي النخلة يا رسول الله‏.‏ ثم التفت فإذا أنا عاشر عشرة أنا أحدثهم فسكت، فقال النبي صلى الله عليه وسلم ‏\"‏ هي النخلة ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     While we were sitting with the Prophet, fresh dates were brought to him. The Prophet said, \"There is a tree among the trees which is as blessed as a Muslim\" I thought that it was the date palm tree and intended to say, \"It is the date-palm tree, O Allah's Apostle!\" but I looked behind to see that I was the tenth and youngest of ten men present there, so I kept quiet' Then the Prophet said, \"It is the datepalm tree.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11028",
        "18"
      ]
    },
    {
      "hadith_no": "5666",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، قال سمعت أبا صالح، يذكر  أراه  عن جابر  رضى الله عنه  قال جاء أبو حميد  رجل من الأنصار  من النقيع بإناء من لبن إلى النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ ألا خمرته، ولو أن تعرض عليه عودا ‏\"‏‏.‏ وحدثني أبو سفيان عن جابر عن النبي صلى الله عليه وسلم بهذا‏.‏",
      "text_en": " Narrated Jabir:                     Abu Humaid, an Ansari man, came from AnNaqi carrying a cup of milk to the Prophet. The Prophet said, \"Will you not cover it even by placing a stick across it?\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "34"
      ]
    },
    {
      "hadith_no": "6081",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، قال حدثني زيد بن وهب، قال سمعت جرير بن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ من لا يرحم لا يرحم ‏\"‏‏.‏",
      "text_en": " Narrated Jarir bin `Abdullah:                     The Prophet said, \"He who is not merciful to others, will not be treated mercifully.",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11341",
        "4057"
      ]
    },
    {
      "hadith_no": "6104",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، قال حدثني شقيق، عن مسروق، قال كنا جلوسا مع عبد الله بن عمرو يحدثنا إذ قال لم يكن رسول الله صلى الله عليه وسلم فاحشا ولا متفحشا، وإنه كان يقول ‏\"‏ إن خياركم أحاسنكم أخلاقا ‏\"‏‏.‏",
      "text_en": " Narrated Masruq:                     We were sitting with `Abdullah bin `Amr who was narrating to us (Hadith): He said, \"Allah's Apostle was neither a Fahish nor a Mutafahhish, and he used to say, 'The best among you are the best in character (having good manners).\"'",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11353",
        "11018"
      ]
    },
    {
      "hadith_no": "6117",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، قال حدثني عدي بن ثابت، قال سمعت سليمان بن صرد، رجلا من أصحاب النبي صلى الله عليه وسلم قال استب رجلان عند النبي صلى الله عليه وسلم فغضب أحدهما، فاشتد غضبه حتى انتفخ وجهه وتغير، فقال النبي صلى الله عليه وسلم ‏\"‏ إني لأعلم كلمة لو قالها لذهب عنه الذي يجد ‏\"‏‏.‏ فانطلق إليه الرجل فأخبره بقول النبي صلى الله عليه وسلم وقال تعوذ بالله من الشيطان‏.‏ فقال أترى بي بأس أمجنون أنا اذهب‏.‏",
      "text_en": " Narrated Sulaiman bin Surad:                     A man from the companions of the Prophet said, \"Two men abused each other in front of the Prophet and one of them became angry and his anger became so intense that his face became swollen and changed. The Prophet said, \"I know a word the saying of which will cause him to relax if he does say it.\" Then a man went to him and informed him of the statement of the Prophet and said, \"Seek refuge with Allah from Satan.\" On that, angry man said, 'Do you find anything wrong with me? Am I insane? Go away!\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11372"
      ]
    },
    {
      "hadith_no": "6119",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، عن المعرور، عن أبي ذر، قال رأيت عليه بردا وعلى غلامه بردا فقلت لو أخذت هذا فلبسته كانت حلة، وأعطيته ثوبا آخر‏.‏ فقال كان بيني وبين رجل كلام، وكانت أمه أعجمية، فنلت منها فذكرني إلى النبي صلى الله عليه وسلم فقال لي ‏\"‏ أساببت فلانا ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ أفنلت من أمه ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ إنك امرؤ فيك جاهلية ‏\"‏‏.‏ قلت على حين ساعتي هذه من كبر السن قال ‏\"‏ نعم، هم إخوانكم، جعلهم الله تحت أيديكم، فمن جعل الله أخاه تحت يده فليطعمه مما يأكل، وليلبسه مما يلبس، ولا يكلفه من العمل ما يغلبه، فإن كلفه ما يغلبه فليعنه عليه ‏\"‏‏.‏",
      "text_en": " Narrated Ma'rur:                     I saw Abu Dhar wearing a Burd (garment) and his slave too was wearing a Burd, so I said (to Abu Dhar), \"If you take this (Burda of your slave) and wear it (along with yours), you will have a nice suit (costume) and you may give him another garment.\" Abu Dhar said, \"There was a quarrel between me and another man whose mother was a non-Arab and I called her bad names. The man mentioned (complained about) me to the Prophet. The Prophet said, \"Did you abuse so-and-so?\" I said, \"Yes\" He said, \"Did you call his mother bad names?\" I said, \"Yes\". He said, \"You still have the traits of (the Pre-lslamic period of) ignorance.\" I said. \"(Do I still have ignorance) even now in my old age?\" He said, \"Yes, they (slaves or servants) are your brothers, and Allah has put them under your command. So the one under whose hand Allah has put his brother, should feed him of what he eats, and give him dresses of what he wears, and should not ask him to do a thing beyond his capacity. And if at all he asks him to do a hard task, he should help him therein.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11397",
        "23"
      ]
    },
    {
      "hadith_no": "6127",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثنا أبو صالح، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ تجد من شر الناس يوم القيامة عند الله ذا الوجهين، الذي يأتي هؤلاء بوجه وهؤلاء بوجه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The worst people in the Sight of Allah on the Day of Resurrection will be the double faced people who appear to some people with one face and to other people with another face.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "19291",
        "13"
      ]
    },
    {
      "hadith_no": "6167",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، قال سمعت شقيقا، يقول قال عبد الله قسم النبي صلى الله عليه وسلم قسمة كبعض ما كان يقسم، فقال رجل من الأنصار والله إنها لقسمة ما أريد بها وجه الله‏.‏ قلت أما أنا لأقولن للنبي صلى الله عليه وسلم فأتيته وهو في أصحابه فساررته فشق ذلك على النبي صلى الله عليه وسلم وتغير وجهه وغضب، حتى وددت أني لم أكن أخبرته ثم قال ‏\"‏ قد أوذي موسى بأكثر من ذلك فصبر ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet divided and distributed something as he used to do for some of his distributions. A man from the Ansar said, \"By Allah, in this division the pleasure of Allah has not been intended.\" I said, \"I will definitely tell this to the Prophet .\" So I went to him while he was sitting with his companions and told him of it secretly. That was hard upon the Prophet and the color of his face changed, and he became so angry that I wished I had not told him. The Prophet then said, \"Moses was harmed with more than this, yet he remained patient.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11353"
      ]
    },
    {
      "hadith_no": "6168",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثنا مسلم، عن مسروق، قالت عائشة صنع النبي صلى الله عليه وسلم شيئا فرخص فيه فتنزه عنه قوم فبلغ ذلك النبي صلى الله عليه وسلم فخطب فحمد الله ثم قال ‏\"‏ ما بال أقوام يتنزهون عن الشىء أصنعه، فوالله إني لأعلمهم بالله وأشدهم له خشية ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet did something and allowed his people to do it, but some people refrained from doing it. When the Prophet learned of that, he delivered a sermon, and after having sent Praises to Allah, he said, \"What is wrong with such people as refrain from doing a thing that I do? By Allah, I know Allah better than they, and I am more afraid of Him than they.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "20285",
        "11018"
      ]
    },
    {
      "hadith_no": "6225",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، قال سمعت أبا صالح، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لأن يمتلئ جوف رجل قيحا يريه خير من أن يمتلئ شعرا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle; said, \"It is better for anyone of you that the inside of his body be filled with pus which may consume his body, than it be filled with poetry.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "19291",
        "13"
      ]
    },
    {
      "hadith_no": "6302",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، قال حدثني شقيق، عن عبد الله، قال كنا إذا صلينا مع النبي صلى الله عليه وسلم قلنا السلام على الله قبل عباده، السلام على جبريل، السلام على ميكائيل، السلام على فلان، فلما انصرف النبي صلى الله عليه وسلم أقبل علينا بوجهه فقال ‏\"‏ إن الله هو السلام، فإذا جلس أحدكم في الصلاة فليقل التحيات لله، والصلوات والطيبات السلام عليك أيها النبي ورحمة الله وبركاته، السلام علينا وعلى عباد الله الصالحين‏.‏ فإنه إذا قال ذلك أصاب كل عبد صالح في السماء والأرض، أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله‏.‏ ثم يتخير بعد من الكلام ما شاء ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     When we prayed with the Prophet we used to say: As-Salam be on Allah from His worshipers, As- Salam be on Gabriel, As-Salam be on Michael, As-Salam be on so-and-so. When the Prophet finished his prayer, he faced us and said, \"Allah Himself is As-Salam (Peace), so when one sits in the prayer, one should say, 'at-Tahiyatu-li l-lahi Was-Salawatu, Wat-Taiyibatu, As-Salamu 'Alaika aiyuhan- Nabiyyu wa Rah-matul-iahi wa Barakatuhu, As-Salamu 'Alaina wa 'ala 'Ibadillahi assalihin, for if he says so, then it will be for all the pious slave of Allah in the Heavens and the Earth. (Then he should say), 'Ash-hadu an la ilaha illalllahu wa ash-hadu anna Muhammadan `Abduhu wa rasulu-hu,' and then he can choose whatever speech (i.e. invocation) he wishes \" (See Hadith No. 797, Vol. 1).",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "6342",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثنا زيد بن وهب، حدثنا والله أبو ذر، بالربذة كنت أمشي مع النبي صلى الله عليه وسلم في حرة المدينة عشاء استقبلنا أحد فقال ‏\"‏ يا أبا ذر ما أحب أن أحدا لي ذهبا يأتي على ليلة أو ثلاث عندي منه دينار، إلا أرصده لدين، إلا أن أقول به في عباد الله هكذا وهكذا وهكذا ‏\"‏‏.‏ وأرانا بيده‏.‏ ثم قال ‏\"‏ يا أبا ذر ‏\"‏‏.‏ قلت لبيك وسعديك يا رسول الله‏.‏ قال ‏\"‏ الأكثرون هم الأقلون إلا من قال هكذا وهكذا ‏\"‏‏.‏ ثم قال لي ‏\"‏ مكانك لا تبرح يا أبا ذر حتى أرجع ‏\"‏‏.‏ فانطلق حتى غاب عني، فسمعت صوتا فخشيت أن يكون عرض لرسول الله صلى الله عليه وسلم فأردت أن أذهب، ثم ذكرت قول رسول الله صلى الله عليه وسلم ‏\"‏ لا تبرح ‏\"‏‏.‏ فمكثت قلت يا رسول الله سمعت صوتا خشيت أن يكون عرض لك، ثم ذكرت قولك فقمت‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ذاك جبريل أتاني، فأخبرني أنه من مات من أمتي لا يشرك بالله شيئا دخل الجنة ‏\"‏‏.‏ قلت يا رسول الله وإن زنى وإن سرق‏.‏ قال ‏\"‏ وإن زنى وإن سرق ‏\"‏‏.‏ قلت لزيد إنه بلغني أنه أبو الدرداء‏.‏ فقال أشهد لحدثنيه أبو ذر بالربذة‏.‏ قال الأعمش وحدثني أبو صالح عن أبي الدرداء نحوه‏.‏ وقال أبو شهاب عن الأعمش ‏\"‏ يمكث عندي فوق ثلاث ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhar:                     While I was walking with the Prophet at the Hurra of Medina in the evening, the mountain of Uhud appeared before us. The Prophet said, \"O Abu Dhar! I would not like to have gold equal to Uhud (mountain) for me, unless nothing of it, not even a single Dinar remains of it with me, for more than one day or three days, except that single Dinar which I will keep for repaying debts. I will spend all of it (the whole amount) among Allah's slaves like this and like this and like this.\" The Prophet pointed out with his hand to illustrate it and then said, \"O Abu Dhar!\" I replied, \"Labbaik wa Sa`daik, O Allah's Apostle!\" He said, \"Those who have much wealth (in this world) will be the least rewarded (in the Hereafter) except those who do like this and like this (i.e., spend their money in charity).\" Then he ordered me, \"Remain at your place and do not leave it, O Abu Dhar, till I come back.\" He went away till he disappeared from me. Then I heard a voice and feared that something might have happened to Allah's Apostle, and I intended to go (to find out) but I remembered the statement of Allah's Apostle that I should not leave, my place, so I kept on waiting (and after a while the Prophet came), and I said to him, \"O Allah's Apostle, I heard a voice and I was afraid that something might have happened to you, but then I remembered your statement and stayed (there). The Prophet said, \"That was Gabriel who came to me and informed me that whoever among my followers died without joining others in worship with Allah, would enter Paradise.\" I said, \"O Allah's Apostle! Even if he had committed illegal sexual intercourse and theft?\" He said, \"Even if he had committed illegal sexual intercourse and theft.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11341"
      ]
    },
    {
      "hadith_no": "6486",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، قال حدثني شقيق، قال كنا ننتظر عبد الله إذ جاء يزيد بن معاوية فقلنا ألا تجلس قال لا ولكن أدخل فأخرج إليكم صاحبكم، وإلا جئت أنا‏.‏ فجلست فخرج عبد الله وهو آخذ بيده فقام علينا فقال أما إني أخبر بمكانكم، ولكنه يمنعني من الخروج إليكم أن رسول الله صلى الله عليه وسلم كان يتخولنا بالموعظة في الأيام، كراهية السآمة علينا‏.‏",
      "text_en": " Narrated Shaqiq:                     While we were waiting for `Abdullah (bin Mas`ud). Yazid bin Muawiya came. I said (to him), \"Will you sit down?\" He said, \"No, but I will go into the house (of Ibn Mas`ud) and let your companion (Ibn Mas`ud) come out to you; and if he should not (come out), I will come out and sit (with you).\" Then `Abdullah came out, holding the hand of Yazid, addressed us, saying, \"I know that you are assembled here, but the reason that prevents me from coming out to you, is that Allah's Apostle used to preach to us at intervals during the days, lest we should become bored.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11353"
      ]
    },
    {
      "hadith_no": "6518",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني عمر بن حفص، حدثني أبي، حدثنا الأعمش، قال حدثني إبراهيم التيمي، عن الحارث بن سويد، قال عبد الله قال النبي صلى الله عليه وسلم ‏\"‏ أيكم مال وارثه أحب إليه من ماله ‏\"‏‏.‏ قالوا يا رسول الله ما منا أحد إلا ماله أحب إليه‏.‏ قال ‏\"‏ فإن ماله ما قدم، ومال وارثه ما أخر ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet said, \"Who among you considers the wealth of his heirs dearer to him than his own wealth?\" They replied, \"O Allah's Apostle! There is none among us but loves his own wealth more.\" The Prophet said, \"So his wealth is whatever he spends (in Allah's Cause) during his life (on good deeds) while the wealth of his heirs is whatever he leaves after his death.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11322",
        "11330",
        "16"
      ]
    },
    {
      "hadith_no": "6612",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثني شقيق، سمعت عبد الله  رضى الله عنه  قال النبي صلى الله عليه وسلم ‏\"‏ أول ما يقضى بين الناس بالدماء ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet said, \"The cases which will be decided first (on the Day of Resurrection) will be the cases of blood-shedding. \"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "6619",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي قال، حدثني الأعمش، قال حدثني خيثمة، عن عدي بن حاتم، قال قال النبي صلى الله عليه وسلم ‏\"‏ ما منكم من أحد إلا وسيكلمه الله يوم القيامة، ليس بين الله وبينه ترجمان، ثم ينظر فلا يرى شيئا قدامه، ثم ينظر بين يديه فتستقبله النار، فمن استطاع منكم أن يتقي النار ولو بشق تمرة ‏\"‏‏.‏",
      "text_en": " Narrated `Adi bin Hatim:                     The Prophet said, \"There will be none among you but will be talked to by Allah on the Day of Resurrection, without there being an interpreter between him and Him (Allah) . He will look and see nothing ahead of him, and then he will look (again for the second time) in front of him, and the (Hell) Fire will confront him. So, whoever among you can save himself from the Fire, should do so even with one half of a date (to give in charity).",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11332",
        "212"
      ]
    },
    {
      "hadith_no": "6719",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، عن المعرور، عن أبي ذر، قال انتهيت إليه وهو يقول في ظل الكعبة ‏\"‏ هم الأخسرون ورب الكعبة، هم الأخسرون ورب الكعبة ‏\"‏ قلت ما شأني أيرى في شىء ما شأني فجلست إليه وهو يقول، فما استطعت أن أسكت، وتغشاني ما شاء الله، فقلت من هم بأبي أنت وأمي يا رسول الله قال ‏\"‏ الأكثرون أموالا، إلا من قال هكذا وهكذا وهكذا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhar:                     I reached him (the Prophet ) while in the shade of the Ka`ba; he was saying, \"They are the losers, by the Lord of the Ka`ba! They are the losers, by the Lord of the Ka`ba!\" I said (to myself ), \"What is wrong with me? Is anything improper detected in me? What is wrong with me? Then I sat beside him and he kept on saying his statement. I could not remain quiet, and Allah knows in what sorrowful state I was at that time. So I said, ' Who are they (the losers)? Let My father and mother be sacrificed for you, O Allah's Apostle!\" He said, \"They are the wealthy people, except the one who does like this and like this and like this (i.e., spends of his wealth in Allah's Cause).",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11397",
        "23"
      ]
    },
    {
      "hadith_no": "6870",
      "source": " Sahih Bukhari ",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثني أبي، حدثنا الأعمش، قال سمعت أبا صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لعن الله السارق، يسرق البيضة فتقطع يده، ويسرق الحبل فتقطع يده ‏\"‏‏.‏ قال الأعمش كانوا يرون أنه بيض الحديد، والحبل كانوا يرون أنه منها ما يسوى دراهم‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Allah curses a man who steals an egg and gets his hand cut off, or steals a rope and gets his hands cut off.\" Al-A`mash said, \"People used to interpret the Baida as an iron helmet, and they used to think that the rope may cost a few dirhams.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "19291",
        "13"
      ]
    },
    {
      "hadith_no": "6962",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، عن عبد الله بن مرة، عن مسروق، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يحل دم امرئ مسلم يشهد أن لا إله إلا الله وأني رسول الله إلا بإحدى ثلاث النفس بالنفس والثيب الزاني، والمارق من الدين التارك الجماعة ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     Allah's Apostle said, \"The blood of a Muslim who confesses that none has the right to be worshipped but Allah and that I am His Apostle, cannot be shed except in three cases: In Qisas for murder, a married person who commits illegal sexual intercourse and the one who reverts from Islam (apostate) and leaves the Muslims.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11362",
        "11018",
        "16"
      ]
    },
    {
      "hadith_no": "7015",
      "source": " Sahih Bukhari ",
      "chapter": "Dealing with Apostates - كتاب استتابة المرتدين والمعاندين وقتالهم",
      "chapter_no": "89",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، قال حدثني شقيق، قال قال عبد الله كأني أنظر إلى النبي صلى الله عليه وسلم يحكي نبيا من الأنبياء ضربه قومه فأدموه، فهو يمسح الدم عن وجهه ويقول رب اغفر لقومي، فإنهم لا يعلمون‏.‏",
      "text_en": " Narrated `Abdullah:                     As if I am looking at the Prophet while he was speaking about one of the prophets whose people have beaten and wounded him, and he was wiping the blood off his face and saying, \"O Lord! Forgive my, people as they do not know.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11353"
      ]
    },
    {
      "hadith_no": "7016",
      "source": " Sahih Bukhari ",
      "chapter": "Dealing with Apostates - كتاب استتابة المرتدين والمعاندين وقتالهم",
      "chapter_no": "89",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، حدثنا خيثمة، حدثنا سويد بن غفلة، قال علي  رضى الله عنه  إذا حدثتكم عن رسول الله صلى الله عليه وسلم حديثا فوالله، لأن أخر من السماء أحب إلى من أن أكذب عليه، وإذا حدثتكم فيما بيني وبينكم فإن الحرب خدعة، وإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ سيخرج قوم في آخر الزمان، حداث الأسنان، سفهاء الأحلام، يقولون من خير قول البرية، لا يجاوز إيمانهم حناجرهم، يمرقون من الدين كما يمرق السهم من الرمية، فأينما لقيتموهم فاقتلوهم، فإن في قتلهم أجرا لمن قتلهم يوم القيامة ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     Whenever I tell you a narration from Allah's Apostle, by Allah, I would rather fall down from the sky than ascribe a false statement to him, but if I tell you something between me and you (not a Hadith) then it was indeed a trick (i.e., I may say things just to cheat my enemy). No doubt I heard Allah's Apostle saying, \"During the last days there will appear some young foolish people who will say the best words but their faith will not go beyond their throats (i.e. they will have no faith) and will go out from (leave) their religion as an arrow goes out of the game. So, where-ever you find them, kill them, for who-ever kills them shall have reward on the Day of Resurrection.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11332",
        "11174",
        "5"
      ]
    },
    {
      "hadith_no": "7151",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثنا شقيق، قال جلس عبد الله وأبو موسى فتحدثا فقال أبو موسى قال النبي صلى الله عليه وسلم ‏\"‏ إن بين يدى الساعة أياما يرفع فيها العلم، وينزل فيها الجهل، ويكثر فيها الهرج، والهرج القتل ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     The Prophet said, \"Near the establishment of the Hour there will be days during which (religious) knowledge will be taken away (vanish) and general ignorance will spread, and there will be Al-Harj in abundance, and Al-Harj means killing.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11353"
      ]
    },
    {
      "hadith_no": "7163",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا عمر بن حفص، حدثني أبي، حدثنا الأعمش، حدثنا شقيق، قال قال عبد الله قال النبي صلى الله عليه وسلم ‏\"‏ سباب المسلم فسوق، وقتاله كفر ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet, said, \"Abusing a Muslim is Fusuq (evil doing) and killing him is Kufr (disbelief).",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "7185",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، حدثنا شقيق، سمعت حذيفة، يقول بينا نحن جلوس عند عمر قال أيكم يحفظ قول النبي صلى الله عليه وسلم في الفتنة‏.‏ قال ‏\"‏ فتنة الرجل في أهله وماله وولده وجاره، تكفرها الصلاة والصدقة والأمر بالمعروف والنهى عن المنكر ‏\"‏‏.‏ قال ليس عن هذا أسألك، ولكن التي تموج كموج البحر‏.‏ قال ليس عليك منها بأس يا أمير المؤمنين، إن بينك وبينها بابا مغلقا‏.‏ قال عمر أيكسر الباب أم يفتح قال بل يكسر‏.‏ قال عمر إذا لا يغلق أبدا‏.‏ قلت أجل‏.‏ قلنا لحذيفة أكان عمر يعلم الباب قال نعم كما أعلم أن دون غد ليلة، وذلك أني حدثته حديثا ليس بالأغاليط‏.‏ فهبنا أن نسأله من الباب فأمرنا مسروقا فسأله فقال من الباب قال عمر‏.‏",
      "text_en": " Narrated Shaqiq:                     I heard Hudhaifa saying, \"While we were sitting with `Umar, he said, 'Who among you remembers the statement of the Prophet about the afflictions?' Hudhaifa said, \"The affliction of a man in his family, his property, his children and his neighbors are expiated by his prayers, Zakat (and alms) and enjoining good and forbidding evil.\" `Umar said, \"I do not ask you about these afflictions, but about those afflictions which will move like the waves of the sea.\" Hudhaifa said, \"Don't worry about it, O chief of the believers, for there is a closed door between you and them.\" `Umar said, \"Will that door be broken or opened?\" I said, \"No. it will be broken.\" `Umar said, \"Then it will never be closed,\" I said, \"Yes.\" We asked Hudhaifa, \"Did `Umar know what that door meant?\" He replied, \"Yes, as I know that there will be night before tomorrow morning, that is because I narrated to him a true narration free from errors.\" We dared not ask Hudhaifa as to whom the door represented so we ordered Masruq to ask him what does the door stand for? He replied, \"`Umar.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "7232",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، حدثنا سعد بن عبيدة، عن أبي عبد الرحمن، عن علي  رضى الله عنه  قال بعث النبي صلى الله عليه وسلم سرية، وأمر عليهم رجلا من الأنصار وأمرهم أن يطيعوه، فغضب عليهم وقال أليس قد أمر النبي صلى الله عليه وسلم أن تطيعوني قالوا بلى‏.‏ قال عزمت عليكم لما جمعتم حطبا وأوقدتم نارا، ثم دخلتم فيها، فجمعوا حطبا فأوقدوا، فلما هموا بالدخول فقام ينظر بعضهم إلى بعض، قال بعضهم إنما تبعنا النبي صلى الله عليه وسلم فرارا من النار، أفندخلها، فبينما هم كذلك إذ خمدت النار، وسكن غضبه، فذكر للنبي صلى الله عليه وسلم فقال ‏\"‏ لو دخلوها ما خرجوا منها أبدا، إنما الطاعة في المعروف ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     The Prophet sent an army unit (for some campaign) and appointed a man from the Ansar as its commander and ordered them (the soldiers) to obey him. (During the campaign) he became angry with them and said, \"Didn't the Prophet order you to obey me?\" They said, \"Yes.\" He said, \"I order you to collect wood and make a fire and then throw yourselves into it.\" So they collected wood and made a fire, but when they were about to throw themselves into, it they started looking at each other, and some of them said, \"We followed the Prophet to escape from the fire. How should we enter it now?\" So while they were in that state, the fire extinguished and their commander's anger abated. The event was mentioned to the Prophet and he said, \"If they had entered it (the fire) they would never have come out of it, for obedience is required only in what is good.\" (See Hadith No. 629. Vol. 5)",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11344",
        "11359",
        "5"
      ]
    },
    {
      "hadith_no": "7386",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، حدثني إبراهيم التيمي، حدثني أبي قال، خطبنا علي  رضى الله عنه  على منبر من آجر، وعليه سيف فيه صحيفة معلقة فقال والله ما عندنا من كتاب يقرأ إلا كتاب الله وما في هذه الصحيفة‏.‏ فنشرها فإذا فيها أسنان الإبل وإذا فيها ‏\"‏ المدينة حرم من عير إلى كذا، فمن أحدث فيها حدثا فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل الله منه صرفا ولا عدلا ‏\"‏‏.‏ وإذا فيه ‏\"‏ ذمة المسلمين واحدة يسعى بها أدناهم، فمن أخفر مسلما فعليه لعنة الله والملائكة والناس أجمعين، لا يقبل الله منه صرفا ولا عدلا ‏\"‏‏.‏ وإذا فيها ‏\"‏ من والى قوما بغير إذن مواليه فعليه لعنة الله والملائكة والناس أجمعين لا يقبل الله منه صرفا ولا عدلا ‏\"‏‏.‏",
      "text_en": " Narrated Ibrahim At Taimi's father:                     `Ali addressed us while he was standing on a brick pulpit and carrying a sword from which was hanging a scroll He said \"By Allah, we have no book to read except Allah's Book and whatever is on this scroll,\" And then he unrolled it, and behold, in it was written what sort of camels were to be given as blood money, and there was also written in it: 'Medina is a sanctuary form 'Air (mountain) to such and such place so whoever innovates in it an heresy or commits a sin therein, he will incur the curse of Allah, the angels, and all the people and Allah will not accept his compulsory or optional good deeds.' There was also written in it: 'The asylum (pledge of protection) granted by any Muslims is one and the same, (even a Muslim of the lowest status is to be secured and respected by all the other Muslims, and whoever betrays a Muslim in this respect (by violating the pledge) will incur the curse of Allah, the angels, and all the people, and Allah will not accept his compulsory or optional good deeds.' There was also written in it: 'Whoever (freed slave) befriends (takes as masters) other than his real masters (manumitters) without their permission will incur the curse of Allah, the angels, and all the people, and Allah will not accept his compulsory or optional good deeds. ' (See Hadith No. 94, Vol. 3)",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11322",
        "11405"
      ]
    },
    {
      "hadith_no": "7387",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، حدثنا مسلم، عن مسروق، قال قالت عائشة  رضي الله عنها  صنع النبي صلى الله عليه وسلم شيئا ترخص وتنزه عنه قوم، فبلغ ذلك النبي صلى الله عليه وسلم فحمد الله ثم قال ‏\"‏ ما بال أقوام يتنزهون عن الشىء أصنعه، فوالله إني أعلمهم بالله، وأشدهم له خشية ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet did something as it was allowed from the religious point of view but some people refrained from it. When the Prophet heard of that, he, after glorifying and praising Allah, said, \"Why do some people refrain from doing something which I do? By Allah, I know Allah more than they.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "20285",
        "11018"
      ]
    },
    {
      "hadith_no": "7492",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، عن شقيق، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ ما من أحد أغير من الله، من أجل ذلك حرم الفواحش، وما أحد أحب إليه المدح من الله ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet said, \"There is none having a greater sense of Ghira than Allah, and for that reason He has forbidden shameful deeds and sins (illegal sexual intercourse etc.) And there is none who likes to be praised more than Allah does.\" (See Hadith No. 147, Vol. 7)",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "7494",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، سمعت أبا صالح، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ يقول الله تعالى أنا عند ظن عبدي بي، وأنا معه إذا ذكرني، فإن ذكرني في نفسه ذكرته في نفسي، وإن ذكرني في ملأ ذكرته في ملأ خير منهم، وإن تقرب إلى بشبر تقربت إليه ذراعا، وإن تقرب إلى ذراعا تقربت إليه باعا، وإن أتاني يمشي أتيته هرولة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Allah says: 'I am just as My slave thinks I am, (i.e. I am able to do for him what he thinks I can do for him) and I am with him if He remembers Me. If he remembers Me in himself, I too, remember him in Myself; and if he remembers Me in a group of people, I remember him in a group that is better than they; and if he comes one span nearer to Me, I go one cubit nearer to him; and if he comes one cubit nearer to Me, I go a distance of two outstretched arms nearer to him; and if he comes to Me walking, I go to him running.' \"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "19291",
        "13"
      ]
    },
    {
      "hadith_no": "7504",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، سمعت إبراهيم، قال سمعت علقمة، يقول قال عبد الله جاء رجل إلى النبي صلى الله عليه وسلم من أهل الكتاب فقال يا أبا القاسم إن الله يمسك السموات على إصبع، والأرضين على إصبع، والشجر والثرى على إصبع، والخلائق على إصبع، ثم يقول أنا الملك أنا الملك‏.‏ فرأيت النبي صلى الله عليه وسلم ضحك حتى بدت نواجذه ثم قرأ ‏{‏وما قدروا الله حق قدره‏}‏",
      "text_en": " Narrated `Abdullah:                     A man from the people of the scripture came to the Prophet and said, \"O Abal-Qasim! Allah will hold the Heavens upon a Finger, and the Earth on a Finger and the land on a Finger, and all the creation on a Finger, and will say, 'I am the King! I am the King!' \" I saw the Prophet (after hearing that), smiling till his premolar teeth became visible, and he then recited: -- 'No just estimate have they made of Allah such as due to him... (39.67)",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "7574",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، حدثنا أبو صالح، عن أبي سعيد الخدري  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ يقول الله يا آدم‏.‏ فيقول لبيك وسعديك‏.‏ فينادى بصوت إن الله يأمرك أن تخرج من ذريتك بعثا إلى النار ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"Allah will say (on the Day of Resurrection), 'O Adam!' Adam will reply, 'Labbaik wa Sa`daik! ' Then a loud Voice will be heard (Saying) 'Allah Commands you to take out the mission of the Hell Fire from your offspring.' \"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "19291",
        "38"
      ]
    },
    {
      "hadith_no": "136",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن الأعمش، عن أبي سفيان، عن جابر، وعن أبي صالح، عن أبي هريرة، قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ أمرت أن أقاتل الناس ‏\"‏ ‏.‏ بمثل حديث ابن المسيب عن أبي هريرة ح",
      "text_en": "",
      "chain": [
        "30201",
        "20317",
        "11060",
        "116",
        "34",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "238",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن داود، عن الشعبي، عن جرير، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما عبد أبق فقد برئت منه الذمة ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Jarir that the Messenger of Allah (may peace and blessings be upon him) observed:                      The slave who fled from his master, responsibility with regard to him was absolved.",
      "chain": [
        "30201",
        "20317",
        "11052",
        "4057"
      ]
    },
    {
      "hadith_no": "451",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن الشيباني، عن زر، عن عبد الله، قال ‏{‏ ما كذب الفؤاد ما رأى‏}‏ قال رأى جبريل - عليه السلام - له ستمائة جناح ‏.‏",
      "text_en": " Al-Shaibani narrated on the authority of Zirr who narrated it on this authority of Abdullah that the (words of Allah):                     \" The heart belied not what he saw\" (al Qur'an, Iiii. 11) imply that he saw Gabriel (peace be upon him) and he had six hundred wings.",
      "chain": [
        "30201",
        "20317",
        "11352",
        "11337",
        "16"
      ]
    },
    {
      "hadith_no": "456",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن الأعمش، حدثنا أبو جهمة، بهذا الإسناد ‏.‏",
      "text_en": " Abu Bakr b. Abi Shaiba narrated it on the same authorities.",
      "chain": [
        "30201",
        "20317",
        "11060"
      ]
    },
    {
      "hadith_no": "540",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن داود، عن الشعبي، عن مسروق، عن عائشة، قالت قلت يا رسول الله ابن جدعان كان في الجاهلية يصل الرحم ويطعم المسكين فهل ذاك نافعه قال ‏\"‏ لا ينفعه إنه لم يقل يوما رب اغفر لي خطيئتي يوم الدين ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported:                      I said: Messenger of Allah, the son of Jud'an established ties of relationship, fed the poor. Would that be of any avail to him? He said: It would be of no avail to him as he did not ever say: O my Lord, pardon my sins on the Day of Resurrection.",
      "chain": [
        "30201",
        "20317",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "288",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا عمر بن حفص بن غياث، حدثنا أبي، عن الأعمش، عن إبراهيم، عن الأسود، وهمام، عن عائشة، في المني قالت كنت أفركه من ثوب رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Al-Aawad and Hammam reported A'isha as saying:                      I used to scrape off the (drop of) semen from the garment of the Messenger of Allah (may peace be upon him).",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11054",
        "11447"
      ]
    },
    {
      "hadith_no": "308",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، ح وحدثنا أبو كريب، أخبرنا ابن أبي زائدة، ح وحدثني عمرو الناقد، وابن، نمير قالا حدثنا مروان بن معاوية الفزاري، كلهم عن عاصم، عن أبي المتوكل، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أتى أحدكم أهله ثم أراد أن يعود فليتوضأ ‏\"‏ ‏.‏ زاد أبو بكر في حديثه بينهما وضوءا وقال ثم أراد أن يعاود ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      The Messenger of Allah (may peace be upon him) said: When anyone amongst you has sexual intercourse with his wife and then he intends to repeat it, he should perform ablution. In the hadith transmitted by Abu Bakr. (the words are):\" Between the two (acts) there should be an ablution,\" or he (the narrator) said:\" Then he intended that it should be repeated.\"",
      "chain": [
        "30201",
        "20317",
        "30216",
        "20366",
        "30263",
        "30212",
        "20201",
        "11080",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "512",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا عمرو الناقد، وأبو سعيد الأشج قالا حدثنا حفص بن غياث، ح قال وحدثنا عمر بن حفص بن غياث، - واللفظ له - حدثنا أبي، حدثنا الأعمش، حدثني إبراهيم، عن الأسود، عن عائشة، ‏.‏ قال الأعمش وحدثني مسلم، عن مسروق، عن عائشة، وذكر، عندها ما يقطع الصلاة الكلب والحمار والمرأة ‏.‏ فقالت عائشة قد شبهتمونا بالحمير والكلاب ‏.‏ والله لقد رأيت رسول الله صلى الله عليه وسلم يصلي وإني على السرير بينه وبين القبلة مضطجعة فتبدو لي الحاجة فأكره أن أجلس فأوذي رسول الله صلى الله عليه وسلم فأنسل من عند رجليه ‏.‏",
      "text_en": " Masruq reported:                      It was mentioned before'A'isha that prayer is invalidated (in case of passing) of a dog, an ass and a woman (before the worshipper, when he is not screened). Upon this 'A'isha said: You likened us to the asses and the dogs. By Allah I saw the Messenger of Allah (may peace be upon him) saying prayer while I lay on the bedstead interposing between him and the Qibla. When I felt the need, I did not like to wit to front (of the Holy Prophet) and perturb the Messenger of Allah (may peace be upon him) and quietly moved out from under its (i. e. of the bedstead) legs.",
      "chain": [
        "30263",
        "30200",
        "20317",
        "30204",
        "20317",
        "11060",
        "11051",
        "11054",
        "11060",
        "20285",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "1571",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثناه أبو سعيد الأشج، حدثنا حفص، - يعني ابن غياث - حدثنا خالد الحذاء، بهذا الإسناد وزاد قال الحذاء وكانا متقاربين في القراءة ‏.‏",
      "text_en": " This hadith has been narrated with the same chain of transmitters, but al-Hadra' made this addition:                     \" They both were equal in recitation.\"",
      "chain": [
        "30200",
        "20317"
      ]
    },
    {
      "hadith_no": "1720",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وابن، نمير جميعا عن حفص بن غياث، - قال ابن نمير حدثنا حفص، - عن ابن جريج، عن عطاء، عن عبيد بن عمير، عن عائشة، قالت ما رأيت رسول الله صلى الله عليه وسلم في شىء من النوافل أسرع منه إلى الركعتين قبل الفجر ‏.‏",
      "text_en": " 'A'isha reported:                      I have never seen the Messenger of Allah (may peace be upon him) hastening as much in observing supererogatory as two rak'ahs before the (Fard) of the dawn prayer.",
      "chain": [
        "30201",
        "20317",
        "30212",
        "11070",
        "11029",
        "11259",
        "53"
      ]
    },
    {
      "hadith_no": "1903",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب جميعا عن حفص، - قال أبو بكر حدثنا حفص بن غياث، - عن الأعمش، عن إبراهيم، عن عبيدة، عن عبد الله، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ اقرأ على القرآن ‏\"‏ ‏.‏ قال فقلت يا رسول الله أقرأ عليك وعليك أنزل قال ‏\"‏ إني أشتهي أن أسمعه من غيري ‏\"‏ ‏.‏ فقرأت النساء حتى إذا بلغت ‏{‏ فكيف إذا جئنا من كل أمة بشهيد وجئنا بك على هؤلاء شهيدا‏}‏ رفعت رأسي أو غمزني رجل إلى جنبي فرفعت رأسي فرأيت دموعه تسيل ‏.‏",
      "text_en": " This hadith has been narratted by A'mash with the same chain of transmitters but with this addition:                     \" The Messenger of Allah (may peace be upon him) was on the pulpit when he asked me to recite to him.\"",
      "chain": [
        "30201",
        "20436",
        "20317",
        "11060",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "2224",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، وابن، عيينة وابن إدريس وعبدة ووكيع ح وحدثناه يحيى بن يحيى، أخبرنا عبد العزيز بن محمد، كلهم عن هشام، بهذا الإسناد وليس في حديثهم قصة عبد الله بن أبي بكر ‏.‏",
      "text_en": " This hadith is narrated on the authority of Hisham with the same chain of transmitters, but in the hadith narrated by him there is no mention of the story of 'Abdullah b. Abu Bakr.",
      "chain": [
        "30201",
        "20317",
        "30399"
      ]
    },
    {
      "hadith_no": "2289",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن ابن جريج، عن أبي، الزبير عن جابر، قال نهى رسول الله صلى الله عليه وسلم أن يجصص القبر وأن يقعد عليه وأن يبنى عليه ‏.‏",
      "text_en": " Jabir said:                      Allah's Messenger (may peace be upon him) forbade that the graves should be plastered or they be used as sitting places (for the people), or a building should be built over them.",
      "chain": [
        "30201",
        "20317",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "2366",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني أحمد بن يوسف الأزدي، حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، حدثني شقيق، عن عمرو بن الحارث، عن زينب، امرأة عبد الله ‏.‏ قال فذكرت لإبراهيم فحدثني عن أبي عبيدة عن عمرو بن الحارث عن زينب امرأة عبد الله ‏.‏ بمثله سواء قال قالت كنت في المسجد فرآني النبي صلى الله عليه وسلم فقال ‏\"‏ تصدقن ولو من حليكن ‏\"‏ ‏.‏ وساق الحديث بنحو حديث أبي الأحوص ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Zainab the wife of 'Abdullah, and she said:                      I was in the mosque and the Prophet of Allah (may peace be upon him) saw me and said: Give Sadaqa even though it is out of your jewellery. The rest of the hadith is the same.",
      "chain": [
        "30535",
        "30204",
        "20317",
        "11060",
        "11353",
        "20377",
        "10",
        "20377"
      ]
    },
    {
      "hadith_no": "2415",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وابن، نمير وزهير بن حرب جميعا عن حفص، بن غياث - قال ابن نمير حدثنا حفص، - عن محمد بن زيد، عن عمير، مولى آبي اللحم قال كنت مملوكا فسألت رسول الله صلى الله عليه وسلم أأتصدق من مال موالي بشىء قال ‏\"‏ نعم والأجر بينكما نصفان ‏\"‏ ‏.‏",
      "text_en": " Umair, the freed slave of Abi'l-Lahm reported:                      1 was the slave (of Abi'l-Lahm). I asked the Messenger of Allah (may peace be upon him) if I could give some charity out of my master's wealth. He said: Yes, and the reward is half and half between you two.",
      "chain": [
        "30201",
        "20317",
        "30212",
        "11217",
        "3141"
      ]
    },
    {
      "hadith_no": "2422",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص، - يعني ابن غياث - عن هشام، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر، - رضى الله عنها - قالت قال لي رسول الله صلى الله عليه وسلم ‏\"‏ أنفقي - أو انضحي أو انفحي - ولا تحصي فيحصي الله عليك ‏\"‏ ‏.‏",
      "text_en": " Asma', daughter of Abu Bakr (Allah be pleated with him), reported:                      The Messenger of Allah (may peace be upon him) said to me: Spend, and do not calculate, or otherwise Allah would also calculate in your case.",
      "chain": [
        "30201",
        "20317",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "2495",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن الأعمش، عن شقيق، عن عبد الله، قال قسم رسول الله صلى الله عليه وسلم قسما فقال رجل إنها لقسمة ما أريد بها وجه الله - قال - فأتيت النبي صلى الله عليه وسلم فساررته فغضب من ذلك غضبا شديدا واحمر وجهه حتى تمنيت أني لم أذكره له - قال - ثم قال ‏\"‏ قد أوذي موسى بأكثر من هذا فصبر ‏\"‏ ‏.‏",
      "text_en": " Abdullah reported:                      The Messenger of Allah (may peace be upon him) distributed spoils (of war). Upon this a person said: This is a distribution In which the pleasure of Allah has not been sought. I came to the Apostle of Allah (may peace be upon him) and informed him in an undertone. He (the Holy Prophet) was deeply angry at this and his face became red till I wished that I had not made a mention of it to him. He (the Holy Prophet) then said: Moses was tormented more than this, but he showed patience.",
      "chain": [
        "30201",
        "20317",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "2546",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا هشيم، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، وأبو خالد الأحمر ح وحدثنا محمد بن المثنى، حدثنا عبد الوهاب، وابن، أبي عدي وعبد الأعلى كلهم عن داود، ح وحدثني زهير بن حرب، - واللفظ له - قال حدثنا إسماعيل بن إبراهيم، أخبرنا داود، عن الشعبي، عن جرير بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أتاكم المصدق فليصدر عنكم وهو عنكم راض ‏\"‏ ‏.‏",
      "text_en": " Jarir b. 'Abdullah said:                      'When the collector of sadaqat (Zakat) comes to you, (you should see) that he goes away pleased with you.",
      "chain": [
        "30399",
        "20468",
        "30201",
        "20317",
        "20326",
        "30170",
        "20259",
        "20276",
        "30022",
        "20208",
        "11052"
      ]
    },
    {
      "hadith_no": "2840",
      "source": " Sahih Muslim ",
      "chapter": "The Book of I'tikaf - كتاب الاعتكاف",
      "chapter_no": "15",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا أبو معاوية، ح وحدثنا سهل بن عثمان، أخبرنا حفص بن غياث، جميعا عن هشام، ح وحدثنا أبو بكر بن أبي شيبة، وأبو كريب - واللفظ لهما - قالا حدثنا ابن نمير، عن هشام بن عروة، عن أبيه، عن عائشة، - رضى الله عنها - قالت كان رسول الله صلى الله عليه وسلم يعتكف العشر الأواخر من رمضان ‏.‏",
      "text_en": " This hadith has been narrated by 'A'isha (Allah be pleased with her) through another chain of transmitters.",
      "chain": [
        "30399",
        "20354",
        "30546",
        "20317",
        "11065",
        "30201",
        "30212",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3010",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا جعفر بن محمد، حدثني أبي، قال أتيت جابر بن عبد الله فسألته عن حجة، رسول الله صلى الله عليه وسلم وساق الحديث بنحو حديث حاتم بن إسماعيل وزاد في الحديث وكانت العرب يدفع بهم أبو سيارة على حمار عرى فلما أجاز رسول الله صلى الله عليه وسلم من المزدلفة بالمشعر الحرام ‏.‏ لم تشك قريش أنه سيقتصر عليه ويكون منزله ثم فأجاز ولم يعرض له حتى أتى عرفات فنزل ‏.‏",
      "text_en": " Ja'far b. Muhammad narrated on the authority of his father thus:                      I came to Jabir b. Abdullah and asked him about the (Farewell) Pilgrimage of Allah's Messenger (may peace be upon him). The rest of the hadith is the same, but with the addition of this:\" There was one Abu Sayyara among the Arabs, (of pre-Islamic period) who carried (people from Muzdalifa to Mini). As the Messenger of Allah (May peace be upon him) set out from Muzdalifa to al-Mash'ar al-Haram, the Quraish were certain that he would halt there and that would be his station. But he passed on (without staying) there. and paid no heed to it till he came to 'Arafat and there he stayed.\"",
      "chain": [
        "30204",
        "20317",
        "10898",
        "11442"
      ]
    },
    {
      "hadith_no": "3011",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، عن جعفر، حدثني أبي، عن جابر، في حديثه ذلك أن رسول الله صلى الله عليه وسلم قال ‏\"‏ نحرت ها هنا ومنى كلها منحر فانحروا في رحالكم ووقفت ها هنا وعرفة كلها موقف ووقفت ها هنا وجمع كلها موقف ‏\"‏ ‏.‏",
      "text_en": " Jabir reported Allah's Messenger (May peace be upon him) as saying:                      I have sacrificed (the animals) here, and the whole of Mini is a place for sacrifice; so sacrifice your animals at your places. 1 have stayed here (near these rocks), and the whole of Arafat is a place for stay. And I have stayed here (at Muzdalifa near Mash'ar al-Haram and the whole of Muzdalifa) is a place for stay (i. e. one is permitted to spend night in any part of it, as one likes).",
      "chain": [
        "30204",
        "20317",
        "11407"
      ]
    },
    {
      "hadith_no": "3212",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا حفص بن غياث، عن هشام، عن محمد بن سيرين، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم أتى منى فأتى الجمرة فرماها ثم أتى منزله بمنى ونحر ثم قال للحلاق ‏\"‏ خذ ‏\"‏ ‏.‏ وأشار إلى جانبه الأيمن ثم الأيسر ثم جعل يعطيه الناس ‏.‏",
      "text_en": " Anas b. Malik (Allah be pleased wish him) reported that Allah's Messenger (may peace be upon him) came to Mina; he went to the Jamra and threw pebbles at it, after which he went to his lodging in Mina, and sacrificed the animal. He then called for a barber and, turning his right side to him, let him shave him; after which he tiimed his left side. He then gave (these hair) to the people.",
      "chain": [
        "30399",
        "20317",
        "11065",
        "11035",
        "19"
      ]
    },
    {
      "hadith_no": "3213",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وابن، نمير وأبو كريب قالوا أخبرنا حفص بن، غياث عن هشام، بهذا الإسناد أما أبو بكر فقال في روايته للحلاق ‏\"‏ ها ‏\"‏ ‏.‏ وأشار بيده إلى الجانب الأيمن هكذا فقسم شعره بين من يليه - قال - ثم أشار إلى الحلاق وإلى الجانب الأيسر فحلقه فأعطاه أم سليم ‏.‏ وأما في رواية أبي كريب قال فبدأ بالشق الأيمن فوزعه الشعرة والشعرتين بين الناس ثم قال بالأيسر فصنع به مثل ذلك ثم قال ‏\"‏ ها هنا أبو طلحة ‏\"‏ ‏.‏ فدفعه إلى أبي طلحة ‏.‏",
      "text_en": " Abu Bakr reported:                      (He called for) the barber and, pointing towards the right side of his head, said: (Start from) here, and then distributed his hair among those who were near him. He then pointed to the barber (to shave) the left side and he shaved it, and he gave (these hair) to Umm Sulaim (Allah be pleased with her). And in the narration of Abu Kuraib (the words are):\" He started from the right half (of his head), and he distributed a hair or two among the people. and then (asked the barber) to shave the left side and he did similarly, and he (the Holy Prophet) said: Here is Abu Talha and he gave these (hair) to Abu Talha.\"",
      "chain": [
        "30201",
        "20317"
      ]
    },
    {
      "hadith_no": "3230",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، ح وحدثنيه أبو الربيع، الزهراني حدثنا حماد يعني ابن زيد، ح وحدثناه أبو كامل، حدثنا يزيد بن زريع، حدثنا حبيب المعلم، كلهم عن هشام، بهذا الإسناد مثله ‏.‏",
      "text_en": " This hadith is narrated on the authority of Hisham with the same chain of transmitters.",
      "chain": [
        "30201",
        "20317",
        "20022",
        "20304"
      ]
    },
    {
      "hadith_no": "3593",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن هشام، عن ابن سيرين، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا دعي أحدكم فليجب فإن كان صائما فليصل وإن كان مفطرا فليطعم ‏\".",
      "text_en": " Abu Haraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      If any one of you is invited, he should accept (the invitation). In case he is fasting, he should pray (in order to bless the inmates of the house), and if he is not fasting he should eat.",
      "chain": [
        "30201",
        "20317",
        "11065",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "3698",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثني أبو كريب، محمد بن العلاء حدثنا حفص، - يعني ابن غياث - عن عبد، الواحد بن أيمن عن أبي بكر بن عبد الرحمن بن الحارث بن هشام، عن أم سلمة، ذكر أنصلى الله عليه وسلم تزوجها وذكر أشياء هذا فيه قال ‏\"‏ إن شئت أن أسبع لك وأسبع لنسائي وإن سبعت لك سبعت لنسائي ‏\"‏ ‏.‏",
      "text_en": " Umm Salama (Allah be pleased with her) reported that Allah's Messenger (may peace be upon him) married her, and he (the narrator) made mention of so many things in this connection (and one of them was this) that he said:                      If you desire that I spend a week with you, I shall have to spend a week with my (other) wives, and if spend a week with you, I shall have to spend a week with my (other) wives.",
      "chain": [
        "30216",
        "20317",
        "11560",
        "11003",
        "56"
      ]
    },
    {
      "hadith_no": "3791",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا حفص بن غياث، حدثنا هشام، عن أبيه، عن فاطمة، بنت قيس قالت قلت يا رسول الله زوجي طلقني ثلاثا وأخاف أن يقتحم على ‏.‏ قال فأمرها فتحولت ‏.‏",
      "text_en": " Fatima bint Qais (Allah be pleased with her) reported that she said:                      Allah's Messenger, my husband has divorcee me with three pronouncements and I am afraid that I may be put to hardship, and so he commanded her and so she moved (to another house).",
      "chain": [
        "30170",
        "20317",
        "11065",
        "10511",
        "224"
      ]
    },
    {
      "hadith_no": "4054",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، ح وحدثنا أبو كريب، وإسحاق، بن إبراهيم جميعا عن أبي معاوية، ح وحدثنا عمرو الناقد، حدثنا عمار بن محمد، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا ابن فضيل، كل هؤلاء عن الأعمش، عن أبي سفيان، عن جابر، ‏.‏ زاد عمرو في روايته عن عمار، وأبو كريب في روايته عن أبي معاوية، فقالا عن أم مبشر، وفى رواية ابن فضيل عن امرأة، زيد بن حارثة وفي رواية إسحاق عن أبي معاوية، قال ربما قال عن أم مبشر، عن النبي صلى الله عليه وسلم ‏.‏ وربما لم يقل وكلهم قالوا عن النبي صلى الله عليه وسلم بنحو حديث عطاء وأبي الزبير وعمرو بن دينار ‏.‏",
      "text_en": " This hadith is transmitted on the authority of Abu Muawiya (but With a slight change of words).",
      "chain": [
        "30201",
        "20317",
        "30216",
        "30123",
        "20354",
        "30263",
        "20596",
        "30201",
        "11060",
        "116",
        "25"
      ]
    },
    {
      "hadith_no": "4201",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثناه أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن الأعمش، عن إبراهيم، قال حدثني الأسود، عن عائشة، عن النبي صلى الله عليه وسلم مثله ‏.‏ ولم يذكر من حديد‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'A'isha (Allah be pleased with her), through another chain ol transmitters, but no mention was made of (its being made) of iron.",
      "chain": [
        "20317",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "4383",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا أبو سعيد الأشج، حدثنا أبو أسامة، ح وحدثنا محمد بن المثنى، حدثنا عبد الوهاب يعني الثقفي، ح وحدثنا أبو بكر بن أبي شيبة، ومحمد بن العلاء، وإسحاق، بن إبراهيم جميعا عن حفص بن غياث، ح وحدثنا محمد بن عمرو بن جبلة بن أبي رواد، حدثنا محمد بن جعفر، حدثنا شعبة، كلهم عن عبيد الله، عن نافع، عن ابن عمر، وقال، حفص من بينهم عن عمر، بهذا الحديث أما أبو أسامة والثقفي ففي حديثهما اعتكاف ليلة ‏.‏ وأما في حديث شعبة فقال جعل عليه يوما يعتكفه ‏.‏ وليس في حديث حفص ذكر يوم ولا ليلة ‏.‏",
      "text_en": " This hadith is transmitted on the authority of Ibn Umar with a slight variation of words.",
      "chain": [
        "30200",
        "20318",
        "30170",
        "20259",
        "30201",
        "30216",
        "30123",
        "20317",
        "30452",
        "20173",
        "11201"
      ]
    },
    {
      "hadith_no": "4468",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، وأبو معاوية ووكيع عن الأعمش، عن عبد الله بن مرة، عن مسروق، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يحل دم امرئ مسلم يشهد أن لا إله إلا الله وأني رسول الله إلا بإحدى ثلاث الثيب الزان والنفس بالنفس والتارك لدينه المفارق للجماعة ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah (b. Mas'ud) reported Allah's Messenger (may peace be upon him) as saying:                      It is not permissible to take the life of a Muslim who bears testimony (to the fact that there is no god but Allah, and I am the Messenger of Allah, but in one of the three cases: the married adulterer, a life for life, and the deserter of his Din (Islam), abandoning the community.",
      "chain": [
        "30201",
        "20317",
        "11060",
        "11362",
        "11018",
        "16"
      ]
    },
    {
      "hadith_no": "5037",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن رمح بن المهاجر، أخبرنا الليث، ح وحدثنا أبو الربيع العتكي، حدثنا حماد بن زيد، ح وحدثنا محمد بن المثنى، حدثنا عبد الوهاب يعني الثقفي، ح وحدثنا  إسحاق بن إبراهيم، أخبرنا أبو خالد الأحمر، سليمان بن حيان ح وحدثنا محمد بن عبد، الله بن نمير حدثنا حفص، - يعني ابن غياث - ويزيد بن هارون ح وحدثنا محمد بن، العلاء الهمداني حدثنا ابن المبارك، ح وحدثنا ابن أبي عمر، حدثنا سفيان، كلهم عن يحيى، بن سعيد بإسناد مالك ومعنى حديثه وفي حديث سفيان سمعت عمر بن الخطاب على المنبر يخبر عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " It has been narrated through a different chain of transmitters on the authority of Sufyan who said that he heard 'Umar b. al-Khattab relate (this tradition) from the Holy Prophet (may peace be upon him) while he was delivering a sermon from the pulpit.",
      "chain": [
        "30490",
        "20023",
        "20022",
        "30170",
        "20259",
        "30123",
        "20326",
        "30212",
        "20317"
      ]
    },
    {
      "hadith_no": "5128",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنيه أبو سعيد الأشج، حدثنا حفص، - يعني ابن غياث - عن عاصم، بهذا الإسناد نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "20317"
      ]
    },
    {
      "hadith_no": "5129",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثني أحمد بن يوسف الأزدي، حدثنا عمر بن حفص بن غياث، حدثنا أبي، عن عاصم، عن عامر، عن ابن عباس، قال لا أدري إنما نهى عنه رسول الله صلى الله عليه وسلم من أجل أنه كان حمولة الناس فكره أن تذهب حمولتهم أو حرمه في يوم خيبر لحوم الحمر الأهلية ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      I do not know whether Allah's Messenger (may peace be upon him) prohibited (the eating of the domestic ass) due to the fact that they were the beasts of burden for the people, so he (the Holy Prophet) did not like their beasts of burden to be destroyed (as a matter of expediency), or he prohibited the use of the flesh of domestic asses (not as an expediency but as a law of the Shari'ah) on the Day of Khaibar.",
      "chain": [
        "30535",
        "30204",
        "20317",
        "11080",
        "11052",
        "17"
      ]
    },
    {
      "hadith_no": "5452",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو سعيد الأشج كلاهما عن حفص، قال أبو بكر حدثنا حفص بن غياث، عن مصعب بن سليم، حدثنا أنس بن مالك، قال رأيت النبي صلى الله عليه وسلم مقعيا يأكل تمرا ‏.‏",
      "text_en": " Anas b. Malik reported:                      I saw Allah's Apostle (may peace be upon him) squatting and eating dates.",
      "chain": [
        "30201",
        "30200",
        "20436",
        "20317",
        "10827",
        "19"
      ]
    },
    {
      "hadith_no": "5533",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثني زهير بن حرب، حدثنا جرير بن عبد الحميد، ح وحدثنا ابن نمير، حدثنا حفص بن غياث، كلاهما عن عاصم، بهذا الإسناد عن النبي صلى الله عليه وسلم في الحرير‏ بمثله ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of 'Asim.",
      "chain": [
        "30022",
        "20028",
        "30212",
        "20317"
      ]
    },
    {
      "hadith_no": "5974",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا أبو كريب، حدثنا حفص، - يعني ابن غياث - حدثنا الأعمش، عن إبراهيم، عن الأسود، عن عبد الله، أن رسول الله صلى الله عليه وسلم أمر محرما بقتل حية بمنى ‏.‏",
      "text_en": " 'Abdullah reported that Allah's Messenger (may peace be upon him) commanded a Muhrim (one who is in the state of pilgrimage) to kill the snake at Mina.",
      "chain": [
        "30216",
        "20317",
        "11060",
        "11051",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "5975",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، حدثني إبراهيم، عن الأسود، عن عبد الله، قال بينما نحن مع رسول الله صلى الله عليه وسلم في غار ‏.‏ بمثل حديث جرير وأبي معاوية ‏.‏",
      "text_en": " 'Abdullah reported:                      While we were with the Messenger of Allah (may peace be upon him) in the cave, the rest of the hadith is the same as the one narrated above.",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "6172",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا زهير بن حرب، وإسحاق بن إبراهيم، كلاهما عن جرير، ح وحدثنا إسحاق، بن إبراهيم وعلي بن خشرم قالا أخبرنا عيسى بن يونس، ح وحدثنا أبو كريب، محمد بن العلاء حدثنا أبو معاوية، ح وحدثنا أبو سعيد الأشج، حدثنا حفص، - يعني ابن غياث - كلهم عن الأعمش، عن زيد بن وهب، وأبي، ظبيان عن جرير بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من لا يرحم الناس لا يرحمه الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Jabir b. 'Abdullah through different chains of transmitters and the words are:                     \" That the Messenger of Allah (may peace be upon him) said: He who shows no mercy to the people, Allah, the Exalted and Glorious, does not show mercy to him.\"",
      "chain": [
        "30022",
        "30123",
        "20028",
        "30123",
        "20347",
        "30216",
        "20354",
        "30200",
        "20317",
        "11060",
        "11341",
        "19301"
      ]
    },
    {
      "hadith_no": "6256",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا حفص يعني ابن غياث، ح وحدثناه إسحاق، بن إبراهيم وعلي بن خشرم قالا أخبرنا عيسى بن يونس، كلاهما عن الأعمش، بإسناد جرير نحو حديثه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of A'mash through a different chain of transmitters.",
      "chain": [
        "30200",
        "20317",
        "30123",
        "20347"
      ]
    },
    {
      "hadith_no": "6431",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا سهل بن عثمان، حدثنا حفص بن غياث، عن هشام بن عروة، عن أبيه، عن عائشة، قالت ما غرت على نساء النبي صلى الله عليه وسلم إلا على خديجة وإني لم أدركها ‏.‏ قالت وكان رسول الله صلى الله عليه وسلم إذا ذبح الشاة فيقول ‏\"‏ أرسلوا بها إلى أصدقاء خديجة ‏\"‏ ‏.‏ قالت فأغضبته يوما فقلت خديجة فقال رسول الله صلى الله عليه وسلم ‏\"‏ إني قد رزقت حبها ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported:                      Never did I feel jealous of the wives of Allah's Apostle (may peace be upon him) but in case of Khadija, although I did no, (have the privilege to) see her. She further added that whenever Allah's Messenger (may peace be upon him) slaughtered a sheep, he said: Send it to the companions of Khadija I annoyed him one day and said: (It is) Khadija only who always prevails upon your mind. Thereupon Allah's Messenger (may peace be upon him) said: Her love had been nurtured in my heart by Allah Himself.",
      "chain": [
        "30546",
        "20317",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6626",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني أبو جعفر، محمد بن الصباح حدثنا حفص بن غياث، حدثنا عاصم الأحول، قال قيل لأنس بن مالك بلغك أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا حلف في الإسلام ‏\"‏ ‏.‏ فقال أنس قد حالف رسول الله صلى الله عليه وسلم بين قريش والأنصار في داره ‏.‏",
      "text_en": " It was said to Anas b. Malik:                      You must have heard this that Allah's Messenger (may peace be upon him) said: There is no alliance (hilf) of brotherhood in Islam. Anas said: Allah's Messenger (may peace be upon him) established the bond of fraternity between the Quraish and the Ansar in his home.",
      "chain": [
        "20317",
        "11080"
      ]
    },
    {
      "hadith_no": "6764",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو سعيد الأشج ومحمد بن عبد الله بن نمير قالوا حدثنا وكيع، ح وحدثنا أبو كريب، حدثنا أبو معاوية، ح وحدثنا أبو سعيد الأشج، حدثنا حفص، - يعني ابن غياث - كلهم عن الأعمش، ح وحدثنا زهير بن حرب، وإسحاق، بن إبراهيم - واللفظ لهما - قال زهير حدثنا وقال، إسحاق أخبرنا جرير، عن الأعمش، عن تميم بن سلمة، عن عبد الرحمن بن هلال العبسي، قال سمعت جريرا، يقول سمعت  رسول الله صلى الله عليه وسلم يقول ‏\"‏ من يحرم الرفق يحرم الخير ‏\"‏ ‏.‏",
      "text_en": " Jarir reported Allah's Messenger (may peace be upon him) as saying:                      He who is deprived of tenderly feelings is in fact deprived of good.",
      "chain": [
        "30201",
        "30200",
        "20032",
        "30216",
        "20354",
        "30200",
        "20317",
        "11060",
        "30022",
        "30123",
        "20321"
      ]
    },
    {
      "hadith_no": "6814",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن الأعمش، بهذا الإسناد ‏.‏",
      "text_en": " This hadith has been reported on the authority of A'mash with the same chain of transmitters.",
      "chain": [
        "30201",
        "20317"
      ]
    },
    {
      "hadith_no": "6823",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن هشام بن عروة، عن  أبيه، عن هشام بن حكيم بن حزام، قال مر بالشام على أناس وقد أقيموا في الشمس وصب على رءوسهم الزيت فقال ما هذا قيل يعذبون في الخراج ‏.‏ فقال أما إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الله يعذب الذين يعذبون في الدنيا ‏\"‏ ‏.‏",
      "text_en": " 'Urwa reported on the authority of his father that Hisham b. Hakim b. Hizam happened to pass by some people in Syria who had been made to stand in the sun and olive-oil was being poured upon their heads. He said:                      What is this? It was said: They are being punished for (not paying) the Kharaj (the government revenue). Thereupon he said: Allah would punish those who torment people in this world (without any genuine reason).",
      "chain": [
        "30201",
        "20317",
        "11065",
        "10511",
        "434"
      ]
    },
    {
      "hadith_no": "6846",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أحمد بن يوسف الأزدي، حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا  الأعمش، حدثنا أبو إسحاق، عن أبي مسلم الأغر، أنه حدثه عن أبي سعيد الخدري، وأبي، هريرة قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ العز إزاره والكبرياء رداؤه فمن ينازعني عذبته ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id Khudri and Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Allah, the Exalted and Glorious, said: Glory is His lower garment and Majesty is His cloak and (Allah says, ) He who contends with Me in regard to them I shall torment him.",
      "chain": [
        "30535",
        "30204",
        "20317",
        "11060",
        "11049",
        "38",
        "13"
      ]
    },
    {
      "hadith_no": "6858",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، وحفص بن غياث، عن بريد، بن عبد الله عن أبي بردة، عن أبي موسى، قال كان رسول الله صلى الله عليه وسلم إذا أتاه طالب حاجة أقبل على جلسائه فقال ‏\"‏ اشفعوا فلتؤجروا وليقض الله على لسان نبيه ما أحب ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported that when any needy (person) came to Allah's Messenger (may peace be upon him) with a need he commanded him to his Companions, saying:                      Make a recommendation for him, and you would get the reward. Allah, however, gives the verdict through the tongue of His Apostle what He likes most.",
      "chain": [
        "30201",
        "20345",
        "20317",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "6871",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، وأبو سعيد الأشج - واللفظ لأبي بكر - قالوا حدثنا حفص، - يعنون ابن غياث ح وحدثنا عمر بن حفص، بن غياث حدثنا أبي، عن جده، طلق بن معاوية عن أبي زرعة بن عمرو بن جرير، عن  أبي هريرة، قال أتت امرأة النبي صلى الله عليه وسلم بصبي لها فقالت يا نبي الله ادع الله له فلقد دفنت ثلاثة قال ‏\"‏ دفنت ثلاثة ‏\"‏ ‏.‏ قالت نعم ‏.‏ قال ‏\"‏ لقد احتظرت بحظار شديد من النار ‏\"‏ ‏.‏ قال عمر من بينهم عن جده ‏.‏ وقال الباقون عن طلق ‏.‏ ولم يذكروا الجد ‏.‏",
      "text_en": " Abu Huraira reported that a woman came to Allah's Apostle (may peace be upon him) with her child and said:                      Allah's Apostle, invoke Allah's blessing upon him for I have already buried three. He said: You have buried three! She said: Yes. Thereupon he (the Holy Prophet) said: You have, indeed, safeguarded yourself against the torment of Hell with a strong safeguard. 'Umar has made a mention of his father, whereas others have not made a mention of his father.",
      "chain": [
        "30201",
        "30212",
        "30200",
        "30204",
        "20317",
        "10777",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "6955",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Knowledge - كتاب العلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، ويحيى بن سعيد، عن ابن، جريج عن سليمان بن عتيق، عن طلق بن حبيب، عن الأحنف بن قيس، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ هلك المتنطعون ‏\"‏ ‏.‏ قالها ثلاثا ‏.‏",
      "text_en": " Abdullah reported Allah's Messenger (may peace be upon him) as saying:                      Ruined, were those who indulged in hair-splitting. He (the Holy Prophet) repeated this thrice.",
      "chain": [
        "30201",
        "20317",
        "11062",
        "11070",
        "11856",
        "10692",
        "11112",
        "16"
      ]
    },
    {
      "hadith_no": "7036",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد يعني سليمان بن حيان، ح وحدثنا  ابن نمير، حدثنا أبو معاوية، ح وحدثني أبو سعيد الأشج، حدثنا حفص، - يعني ابن غياث - كلهم عن هشام، ح وحدثني أبو خيثمة، زهير بن حرب - واللفظ له - حدثنا إسماعيل، بن إبراهيم عن هشام بن حسان، عن محمد بن سيرين، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من تاب قبل أن تطلع الشمس من مغربها تاب الله عليه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as say- ing:                      He who seeks repentance (from the Lord) before the rising of the sun from the west (before the Day of Resurrection), Allah turns to him with Mercy.",
      "chain": [
        "30201",
        "30212",
        "20354",
        "30200",
        "20317",
        "11065",
        "20208",
        "11311"
      ]
    },
    {
      "hadith_no": "7038",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا ابن نمير، وإسحاق بن إبراهيم، وأبو سعيد الأشج جميعا عن حفص بن، غياث عن عاصم، بهذا الإسناد نحوه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Asim with the same chain of transmitters.",
      "chain": [
        "30212",
        "30123",
        "30200",
        "20317"
      ]
    },
    {
      "hadith_no": "7218",
      "source": " Sahih Muslim ",
      "chapter": "Pertaining To The Charateristics Of The Hypocrites And Command Concerning Them - كتاب صفات المنافقين وأحكامهم",
      "chapter_no": "52",
      "text_ar": "حدثني أبو كريب، محمد بن العلاء حدثنا حفص، - يعني ابن غياث - عن الأعمش، عن أبي سفيان، عن جابر، أن رسول الله صلى الله عليه وسلم قدم من سفر فلما كان قرب المدينة هاجت ريح شديدة تكاد أن تدفن الراكب فزعم أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بعثت هذه الريح لموت منافق ‏\"‏ ‏.‏ فلما قدم المدينة فإذا منافق عظيم من المنافقين قد مات ‏.‏",
      "text_en": " Jabir reported that Allah's Messenger (may peace be upon him) came back from a journey and as he was near Medina, there was such a violent gale that the mountain seemed to be pressed. Allah's Messenger (may peace be upon him) said:                      This wind has perhaps been made to blow for the death of a hypocrite, and as he reached Medina a notorious hypocrite from amongst the hypocrites had died.",
      "chain": [
        "30216",
        "20317",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "7225",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، قال سمعت إبراهيم، يقول سمعت علقمة، يقول قال عبد الله جاء رجل من أهل الكتاب إلى رسول الله صلى الله عليه وسلم فقال يا أبا القاسم إن الله يمسك السموات على إصبع والأرضين على إصبع والشجر والثرى على إصبع والخلائق على إصبع ثم يقول أنا الملك أنا الملك ‏.‏ قال فرأيت النبي صلى الله عليه وسلم ضحك حتى بدت نواجذه ثم قرأ ‏{‏ وما قدروا الله حق قدره‏}‏",
      "text_en": " Abdullah reported that a person from the People of the Book came to Allah's Apostle (may peace he upon him) and said:                      Abu al-Qasim, verify, Allah would carry tho Reavmo upon one finger and the earths upon one finger and the trees and moist earth upon one finger and in fact the whole of the creation upon one finger and then say: I am your Lord. I an your Lord. And he (the narrator) further said: I saw Allah's Massenger (may peace be upon him) fooling so much hppy that his front teeth became visible and then he recited the Yeife:\" And they honour not Allah with the honour due to Him\" (xxxix. 67).",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "7237",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، حدثني إبراهيم، عن علقمة، عن عبد الله، قال بينما أنا أمشي، مع النبي صلى الله عليه وسلم في حرث وهو متكئ على عسيب إذ مر بنفر من اليهود فقال بعضهم لبعض سلوه عن الروح فقالوا ما رابكم إليه لا يستقبلكم بشىء تكرهونه ‏.‏ فقالوا سلوه فقام إليه بعضهم فسأله عن الروح - قال - فأسكت النبي صلى الله عليه وسلم فلم يرد عليه شيئا فعلمت أنه يوحى إليه - قال - فقمت مكاني فلما نزل الوحى قال ‏{‏ ويسألونك عن الروح قل الروح من أمر ربي وما أوتيتم من العلم إلا قليلا‏}‏",
      "text_en": " 'Abdullah (b. Mas'ud) reported:                      As I was going aloog with Allah's Apostle (may peace be upon him) in a cultivable land and he (the Holy Prophet) was walking with the support of a wood, a group of Jews happened to meet him. Some of them said to the others: Ask him about the Soul. They said: Wbat is your doubt about it? There is a possibility that you may ask him about anything (the answer of) which you may not like. They said: Ask him. So one amongst them asked him about the Soul. Allah's Messenger (may peace be upon him) kept quiet and he gave no reply and I came to know that revelation was being sent to him, so I stood at my place and thus this revelation descended upon him:\" They ask thee 'about Soul. Say: The Soul is by the Commandment of my Lord, and of Knowledge you are given but a little\" (xvii. 58).",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "7343",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، عن العلاء بن خالد الكاهلي، عن  شقيق، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يؤتى بجهنم يومئذ لها سبعون ألف زمام مع كل زمام سبعون ألف ملك يجرونها ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The Hell would he brought on that da (the Day of judgment) with seventy bridles and every bridle would be controlled by seventy angels.",
      "chain": [
        "30204",
        "20317",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "7637",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن هشام بن عروة، عن  أبيه، قال قالت عائشة ما شبع آل محمد صلى الله عليه وسلم من خبز البر ثلاثا حتى مضى لسبيله ‏.‏",
      "text_en": " 'A'isha reported:                      Never could the family of Muhammad (may peace. be upon him) (afford to eat) the bread of wheat for three (successive days) until he ran the course of his life.",
      "chain": [
        "30201",
        "20317",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "7667",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثني أبي، عن إسماعيل بن سميع، عن مسلم، البطين عن سعيد بن جبير، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من سمع سمع الله به ومن راءى راءى الله به ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas reported Allah's Messenger (may peace be upon him) as saying:                      If anyone wants to have his deeds widely publicised, Allah will publicise (his humiliation). And if anyone makes a hypocritical display (of his deeds) Allah will make a display of him.",
      "chain": [
        "30204",
        "20317",
        "10742",
        "11393",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "7677",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثني محمد بن عبد الله بن نمير، حدثنا حفص، - وهو ابن غياث - عن سليمان، التيمي عن أنس بن مالك، قال عطس عند النبي صلى الله عليه وسلم رجلان فشمت أحدهما ولم يشمت الآخر فقال الذي لم يشمته عطس فلان فشمته وعطست أنا فلم تشمتني ‏.‏ قال ‏\"‏ إن هذا حمد الله وإنك لم تحمد الله ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported that two persons sneezed in the presence of Allah's Messenger (may peace be upon him). He (the Messenger of Allah) invoked mercy for one, and did not invoke for the other. The one for whom he had not prayed said:                      So and so sneezed and you said: May Allah have mercy upon you. I also sneezed but you did not utter these words for me. Thereupon he (the Holy Prophet) said: That person praised Allah, and you did not praise Allah.",
      "chain": [
        "30212",
        "20317",
        "11289",
        "19"
      ]
    },
    {
      "hadith_no": "162",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا حفص، - يعني ابن غياث - عن الأعمش، عن أبي إسحاق، عن عبد خير، عن علي، - رضى الله عنه - قال لو كان الدين بالرأى لكان أسفل الخف أولى بالمسح من أعلاه وقد رأيت رسول الله صلى الله عليه وسلم يمسح على ظاهر خفيه ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     If the religion were based on opinion, it would be more important to wipe the under part of the shoe than the upper but I have seen the Messenger of Allah (ﷺ) wiping over the upper part of his shoes.",
      "chain": [
        "30216",
        "20317",
        "11060",
        "11049",
        "19874",
        "5"
      ]
    },
    {
      "hadith_no": "164",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا حفص بن غياث، عن الأعمش، بهذا الحديث قال لو كان الدين بالرأى لكان باطن القدمين أحق بالمسح من ظاهرهما وقد مسح النبي صلى الله عليه وسلم على ظهر خفيه ورواه وكيع عن الأعمش بإسناده قال كنت أرى أن باطن القدمين أحق بالمسح من ظاهرهما حتى رأيت رسول الله صلى الله عليه وسلم يمسح على ظاهرهما ‏.‏ قال وكيع يعني الخفين ‏.‏ ورواه عيسى بن يونس عن الأعمش كما رواه وكيع ورواه أبو السوداء عن ابن عبد خير عن أبيه قال رأيت عليا توضأ فغسل ظاهر قدميه وقال لولا أني رأيت رسول الله صلى الله عليه وسلم يفعله ‏.‏ وساق الحديث ‏.‏",
      "text_en": " A ‘mash transmitted this tradition saying:                      If religion were based on opinion, it would be more proper to wipe the under part of the feet than the upper. The Prophet (ﷺ) wiped over the upper part of his shoes. The narrator Waki’ said: I saw ‘ Ali perform ablution and wash the upper part of his feet, and say : Had I not seen the Messenger of Allah(ﷺ) doing like this –and he narrated the tradition in full.",
      "chain": [
        "30216",
        "20317",
        "11060"
      ]
    },
    {
      "hadith_no": "220",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عمرو بن عون، حدثنا حفص بن غياث، عن عاصم الأحول، عن أبي المتوكل، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أتى أحدكم أهله ثم بدا له أن يعاود فليتوضأ بينهما وضوءا ‏\"‏ ‏.‏",
      "text_en": " Abu sa’id al-Khudri reported :                      The Prophet (May peace be upon him) said : When any of you has intercourse with his wife and desire to repeat it, he should perform ablution between them.",
      "chain": [
        "30154",
        "20317",
        "11080",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "323",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا حفص، حدثنا الأعمش، عن سلمة بن كهيل، عن ابن أبزى، عن عمار بن ياسر، في هذا الحديث فقال ‏\"‏ يا عمار إنما كان يكفيك هكذا ‏\"‏ ‏.‏ ثم ضرب بيديه الأرض ثم ضرب إحداهما على الأخرى ثم مسح وجهه والذراعين إلى نصف الساعدين ولم يبلغ المرفقين ضربة واحدة ‏.‏ قال أبو داود ورواه وكيع عن الأعمش عن سلمة بن كهيل عن عبد الرحمن بن أبزى ورواه جرير عن الأعمش عن سلمة بن كهيل عن سعيد بن عبد الرحمن بن أبزى يعني عن أبيه ‏.‏",
      "text_en": " Ibn Abza reported on the authority of 'Ammar b. Yasir in this tradition as saying (from the Prophet):                      'Ammar, it would have been enough for you (to do) so. He then stuck only one stroke on the ground with both his hands; he then stuck one with the other; then wiped his face and both arms up to half the forearms and did not reach the elbows.Abu Dawud said: This is also transmitted by Waki' from al-A'mash from Salamah b. Kuhail from 'Abd al-Rahman b. Abza.It is also transmitted through a different chain by Jarir from al-A'mash from Salamah from Sa'id b. 'Abd al-Rahman b. Abza from his father.",
      "chain": [
        "30216",
        "20317",
        "11060",
        "11350",
        "4046",
        "25"
      ]
    },
    {
      "hadith_no": "702",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حفص بن عمر، حدثنا شعبة، ح وحدثنا عبد السلام بن مطهر، وابن، كثير - المعنى - أن سليمان بن المغيرة، أخبرهم عن حميد بن هلال، عن عبد الله بن الصامت، عن أبي ذر، - قال حفص - قال قال رسول الله صلى الله عليه وسلم وقالا عن سليمان قال أبو ذر ‏\"‏ يقطع صلاة الرجل - إذا لم يكن بين يديه قيد آخرة الرحل الحمار والكلب الأسود والمرأة ‏\"‏ ‏.‏ فقلت ما بال الأسود من الأحمر من الأصفر من الأبيض فقال يا ابن أخي سألت رسول الله صلى الله عليه وسلم كما سألتني فقال ‏\"‏ الكلب الأسود شيطان ‏\"‏ ‏.‏",
      "text_en": " Hafs reported that the Messenger of Allah(ﷺ) as saying, and the other version of this tradition transmitted through a different chain has:                      Abu Dharr said (and not the Prophet): If there is not anything like the back of a saddle in front of a man who is praying, then a donkey, a black dog, and a woman cut off his prayer. I asked him: Why has the black dog been specified, distinguishing it from a red, a yellow and a white dog? He replied: My nephew, I also asked the Messenger of Allah(ﷺ) the same question as you asked me. He said: The black dog is a devil.",
      "chain": [
        "30329",
        "20020",
        "20249",
        "20236",
        "11281",
        "10695",
        "23",
        "20317"
      ]
    },
    {
      "hadith_no": "756",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن محبوب، حدثنا حفص بن غياث، عن عبد الرحمن بن إسحاق، عن زياد بن زيد، عن أبي جحيفة، أن عليا، - رضى الله عنه - قال السنة وضع الكف على الكف في الصلاة تحت السرة ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     AbuJuhayfah said: Ali said that it is a sunnah to place one hand on the other in prayer below the navel.",
      "chain": [
        "30171",
        "20317",
        "11876",
        "4047",
        "5"
      ]
    },
    {
      "hadith_no": "1019",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا حفص بن عمر، ومسلم بن إبراهيم، - المعنى - قال حفص حدثنا شعبة، عن الحكم، عن إبراهيم، عن علقمة، عن عبد الله، قال صلى رسول الله صلى الله عليه وسلم الظهر خمسا ‏.‏ فقيل له أزيد في الصلاة قال ‏\"‏ وما ذاك ‏\"‏ ‏.‏ قال صليت خمسا ‏.‏ فسجد سجدتين بعد ما سلم ‏.‏",
      "text_en": " ‘Abd Allah (b. Mas’ud) said :                      The Messenger of Allah (ﷺ) prayed five rak’ahs in the noon prayer. He was asked whether the prayer had been extended. He asked what they meant by that. The people said : you prayed five rak’ahs. Then he made two prostrations after having given the salutation.",
      "chain": [
        "30329",
        "20285",
        "20317",
        "20020",
        "11069",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1116",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن محبوب، وإسماعيل بن إبراهيم، - المعنى - قالا حدثنا حفص بن غياث، عن الأعمش، عن أبي سفيان، عن جابر، وعن أبي صالح، عن أبي هريرة، قالا جاء سليك الغطفاني ورسول الله صلى الله عليه وسلم يخطب فقال له ‏\"‏ أصليت شيئا ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ صل ركعتين تجوز فيهما ‏\"‏ ‏.‏",
      "text_en": " Jabir and Abu Salih reported on the authority of Abu Hurairah:                      Sulaik al-Ghatafani came (to the mosque) while the Messenger of Allah (ﷺ) was giving the (Friday) sermon. He asked him: Did you pray something ? He said: No. He said: Offer two rak'ahs and make them short.",
      "chain": [
        "30171",
        "20208",
        "20317",
        "11060",
        "11249",
        "34",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "1230",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن العلاء، وعثمان بن أبي شيبة، - المعنى واحد - قالا حدثنا حفص، عن عاصم، عن عكرمة، عن ابن عباس، أن رسول الله صلى الله عليه وسلم أقام سبع عشرة بمكة يقصر الصلاة ‏.‏ قال ابن عباس ومن أقام سبع عشرة قصر ومن أقام أكثر أتم ‏.‏ قال أبو داود قال عباد بن منصور عن عكرمة عن ابن عباس قال أقام تسع عشرة ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Messenger of Allah (ﷺ) had a stop of seventeen days in Mecca and he shortened the prayer (i.e. prayed two rak'ahs at each time of prayer). Ibn Abbas said: He who stays seventeen days should shorten the prayer; and who stays more than that should offer complete prayer.Abu Dawud said: The other version transmitted by Ibn 'Abbas through a different chain adds: He (the Prophet) had a stop of nineteen days (in Mecca).",
      "chain": [
        "30216",
        "30203",
        "20317",
        "11080",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1316",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا حسين بن يزيد الكوفي، حدثنا حفص، عن هشام بن عروة، عن أبيه، عن عائشة، قالت إن كان رسول الله صلى الله عليه وسلم ليوقظه الله عز وجل بالليل فما يجيء السحر حتى يفرغ من حزبه ‏.‏",
      "text_en": " Narrated 'Aishah:                     Allah, the Exalted, would awaken the Messenger of Allah (ﷺ) at night. When the dawn came, he would his finish daily round of recital.",
      "chain": [
        "20317",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1497",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا حفص بن غياث، عن الأعمش، عن حبيب بن أبي ثابت، عن عطاء، عن عائشة، قالت سرقت ملحفة لها فجعلت تدعو على من سرقها فجعل النبي صلى الله عليه وسلم يقول ‏\"‏ لا تسبخي عنه ‏\"‏ ‏.‏ قال أبو داود لا تسبخي أى لا تخففي عنه ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Ata' said: The quilt of Aisha was stolen. She began to curse the person who had stolen it. The Prophet (ﷺ) began to tell her: Do not lighten him.Abu Dawud said: The meaning of the Arabic words la tasbikhi 'anhu means \"do not lessen him or lighten him\".",
      "chain": [
        "30203",
        "20317",
        "11060",
        "11331",
        "11029",
        "53"
      ]
    },
    {
      "hadith_no": "1908",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا مسدد، حدثنا حفص بن غياث، عن جعفر، بإسناده زاد ‏\"‏ فانحروا في رحالكم ‏\"‏ ‏.‏",
      "text_en": " The aforesaid tradition has also been transmitted by Hafs bin Ghiyath from Ja’far with the same chain of narrators. But this version adds “Sacrifice in your dwellings.”",
      "chain": [
        "30175",
        "20317"
      ]
    },
    {
      "hadith_no": "1936",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا مسدد، حدثنا حفص بن غياث، عن جعفر بن محمد، عن أبيه، عن جابر، أن النبي صلى الله عليه وسلم قال ‏\"‏ وقفت ها هنا بعرفة وعرفة كلها موقف ووقفت ها هنا بجمع وجمع كلها موقف ونحرت ها هنا ومنى كلها منحر فانحروا في رحالكم ‏\"‏ ‏.‏",
      "text_en": " Jabir reported the Prophet (ﷺ) as saying “I halted here in ‘Arafah and the whole of ‘Arafah is a place of halting.  I halted here in Al Muzdalifah and the whole of Al Muzdalifah is a place of halting. I sacrificed the animals here and the whole of Mina is a place of sacrifice. So sacrifice in your dwellings.",
      "chain": [
        "30175",
        "20317",
        "10898",
        "11442",
        "34"
      ]
    },
    {
      "hadith_no": "1960",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا مسدد، أن أبا معاوية، وحفص بن غياث، حدثاه - وحديث أبي معاوية، أتم - عن الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، قال صلى عثمان بمنى أربعا فقال عبد الله صليت مع النبي صلى الله عليه وسلم ركعتين ومع أبي بكر ركعتين ومع عمر ركعتين زاد عن حفص ومع عثمان صدرا من إمارته ثم أتمها ‏.‏ زاد من ها هنا عن أبي معاوية ثم تفرقت بكم الطرق فلوددت أن لي من أربع ركعات ركعتين متقبلتين ‏.‏ قال الأعمش فحدثني معاوية بن قرة عن أشياخه أن عبد الله صلى أربعا قال فقيل له عبت على عثمان ثم صليت أربعا قال الخلاف شر ‏.‏",
      "text_en": " Narrated 'Abd al-Rahman b. Zaid:                     'Uthman prayed four rak'ahs at Mina. 'Abd Allah (b. Mas'ud) said: I prayed two rak'ahs along with the Prophet (ﷺ) and two rak'ahs along with 'Umar. The version of Hafs added: And along with 'Uthman during the early period of his caliphate. He ('Uthman) began to offer complete prayer (i.e. four rak'ahs) later on. The version of Abu Mu'awiyah added: Then your modes of action varied. I would like to pray two rak'ahs acceptable to Allah instead of four rak'ahs.Al-A'mash said: Mu'awiyah b. Qurrah reported to me from his teachers: 'Abd Allah (b. Mas'ud) once prayed four rak'ahs. He was told: You criticized 'Uthman but you yourself prayed four ? He replied: Dissension is evil.",
      "chain": [
        "30175",
        "20354",
        "20317",
        "11060",
        "11051",
        "11055"
      ]
    },
    {
      "hadith_no": "1981",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا حفص، عن هشام، عن ابن سيرين، عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم رمى جمرة العقبة يوم النحر ثم رجع إلى منزله بمنى فدعا بذبح فذبح ثم دعا بالحلاق فأخذ بشق رأسه الأيمن فحلقه فجعل يقسم بين من يليه الشعرة والشعرتين ثم أخذ بشق رأسه الأيسر فحلقه ثم قال ‏\"‏ ها هنا أبو طلحة ‏\"‏ ‏.‏ فدفعه إلى أبي طلحة ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Messenger of Allah (ﷺ) threw pebbles at the last jamrah (Jamrat al-'Aqabah) on the day of sacrifice. He then returned to his lodging at Mina. He called for a sacrificial animal which he slaughtered. He then called for a barber. He held the right side of his head and shaved it. He then began to distribute among those who were around him one or two hair each. He then held the left side of his head and shaved it. Again he said: Is Abu Talhah here ? He then gave it (the hair shaved off) to Abu Talhah.",
      "chain": [
        "30216",
        "20317",
        "11065",
        "11035",
        "19"
      ]
    },
    {
      "hadith_no": "2167",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن العلاء، ومسدد، قالا حدثنا حفص، عن الشيباني، عن عبد الله بن شداد، عن خالته، ميمونة بنت الحارث أن رسول الله صلى الله عليه وسلم كان إذا أراد أن يباشر امرأة من نسائه وهي حائض أمرها أن تتزر ثم يباشرها ‏.‏",
      "text_en": " Maimunah daughter of Al Harith said “When the Apostle of Allaah(ﷺ) intended to associate and lie with any of his wives who was menstruating, he ordered her to wrap up the lower garment(loin-cloth) and then he had association with her.",
      "chain": [
        "30216",
        "30175",
        "20317",
        "11352",
        "169",
        "61"
      ]
    },
    {
      "hadith_no": "2796",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن معين، حدثنا حفص، عن جعفر، عن أبيه، عن أبي سعيد، قال كان رسول الله صلى الله عليه وسلم يضحي بكبش أقرن فحيل ينظر في سواد ويأكل في سواد ويمشي في سواد ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     The Messenger of Allah (ﷺ) used to sacrifice a choice, horned ram with black round the eyes, the mouth and the feet.",
      "chain": [
        "30020",
        "20317",
        "11407",
        "38"
      ]
    },
    {
      "hadith_no": "3152",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حفص، عن هشام بن عروة، عن أبيه، عن عائشة، مثله زاد من كرسف ‏.‏ قال فذكر لعائشة قولهم في ثوبين وبرد حبرة فقالت قد أتي بالبرد ولكنهم ردوه ولم يكفنوه فيه ‏.‏",
      "text_en": " A similar tradition has been transmitted by 'Aishah through a different chain of narrators. This version adds:                      \"of cotton\". The narrator said: Aisha was told that the people said that he was shrouded in two garments and one cloak. She replied: A cloak was brought but they returned it and did not shroud him in it.",
      "chain": [
        "30367",
        "20317",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "3226",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا مسدد، وعثمان بن أبي شيبة، قالا حدثنا حفص بن غياث، عن ابن جريج، عن سليمان بن موسى، وعن أبي الزبير، عن جابر، بهذا الحديث قال أبو داود قال عثمان أو يزاد عليه وزاد سليمان بن موسى أو أن يكتب عليه ولم يذكر مسدد في حديثه أو يزاد عليه ‏.‏ قال أبو داود خفي على من حديث مسدد حرف وأن ‏.‏",
      "text_en": " The tradition mentioned above has also been narrated by Jabir through a different chain of transmitters.Abu Dawud said:                      'Uthman said: \"or anything added to it.\" Sulaiman b. Musa said: \"or anything written on it.\" Musaddad did not mention in his version the words \"or anything added to it.\"Abu Dawud said: The word \"and that\" (wa an) remained hidden to me.",
      "chain": [
        "30175",
        "30203",
        "20317",
        "11070",
        "10880",
        "11263",
        "34",
        "30002"
      ]
    },
    {
      "hadith_no": "3260",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا عمر بن حفص، حدثنا أبي، عن محمد بن أبي يحيى، عن يزيد الأعور، عن يوسف بن عبد الله بن سلام، مثله ‏.‏",
      "text_en": " A similar tradition has also been transmitted by Yusuf b. 'Abd Allah b. Salam through a different chain of narrators.",
      "chain": [
        "30524",
        "30204",
        "20317"
      ]
    },
    {
      "hadith_no": "3460",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا يحيى بن معين، حدثنا حفص، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أقال مسلما أقاله الله عثرته ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: If anyone rescinds a sale with a Muslim, Allah will cancel his slip, on the Day of Resurrection.",
      "chain": [
        "30020",
        "20317",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3511",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا عمر بن حفص بن غياث، حدثنا أبي، عن أبي عميس، أخبرني عبد الرحمن بن قيس بن محمد بن الأشعث، عن أبيه، عن جده، قال اشترى الأشعث رقيقا من رقيق الخمس من عبد الله بعشرين ألفا فأرسل عبد الله إليه في ثمنهم فقال إنما أخذتهم بعشرة آلاف ‏.‏ فقال عبد الله فاختر رجلا يكون بيني وبينك ‏.‏ قال الأشعث أنت بيني وبين نفسك ‏.‏ قال عبد الله فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا اختلف البيعان وليس بينهما بينة فهو ما يقول رب السلعة أو يتتاركان ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     Muhammad ibn al-Ash'ath said: Al-Ash'ath bought slaves of booty from Abdullah ibn Mas'ud for twenty thousand (dirhams. Abdullah asked him for payment of their price. He said: I bought them for ten thousand (dirhams). Abdullah said: Appoint a man who may adjudicate between me and you. Al-Ash'ath said: (I appoint) you between me and yourself. Abdullah said: I heard the Messenger of Allah (ﷺ) say: If both parties in a business transaction differ (on the price of an article), and they have witness between them, the statement of the owner of the article will be accepted (as correct) or they may annul the transaction.",
      "chain": [
        "11222",
        "30204",
        "20317"
      ]
    },
    {
      "hadith_no": "3668",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Knowledge (Kitab Al-Ilm) - كتاب العلم",
      "chapter_no": "26",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا حفص بن غياث، عن الأعمش، عن إبراهيم، عن عبيدة، عن عبد الله، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ اقرأ على سورة النساء ‏\"‏ ‏.‏ قال قلت أقرأ عليك وعليك أنزل قال ‏\"‏ إني أحب أن أسمعه من غيري ‏\"‏ ‏.‏ قال فقرأت عليه حتى إذا انتهيت إلى قوله ‏{‏ فكيف إذا جئنا من كل أمة بشهيد ‏}‏ الآية فرفعت رأسي فإذا عيناه تهملان ‏.‏",
      "text_en": " ’Abd  Allah (b. Mas’ud) said:                      The Messenger of Allah (ﷺ)said to me: recite Surat al-Nisa’. I asked: Shail I recite to you  what was sent down to you ? He replied : I like to here it from someone else. So I recite (it) until I reached this verse “How then shall it be when We bring from every people a witness ?”. Then raised my head and saw tears falling from his eyes.",
      "chain": [
        "30203",
        "20317",
        "11060",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "3830",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا عمر بن حفص، حدثنا أبي، عن محمد بن أبي يحيى، عن يزيد الأعور، عن يوسف بن عبد الله بن سلام، قال رأيت النبي صلى الله عليه وسلم أخذ كسرة من خبز شعير فوضع عليها تمرة وقال ‏\"‏ هذه إدام هذه ‏\"‏ ‏.‏",
      "text_en": " Narrated Yusuf ibn Abdullah ibn Salam:                     I saw that the Prophet (ﷺ) took a piece of break of barley and put a date on it and said: This is the condiment of this.",
      "chain": [
        "30524",
        "30204",
        "20317",
        "5335"
      ]
    },
    {
      "hadith_no": "4356",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا حفص، حدثنا الشيباني، عن أبي بردة، بهذه القصة قال فأتي أبو موسى برجل قد ارتد عن الإسلام، فدعاه عشرين ليلة أو قريبا منها فجاء معاذ فدعاه فأبى فضرب عنقه ‏.‏ قال أبو داود ورواه عبد الملك بن عمير عن أبي بردة لم يذكر الاستتابة ورواه ابن فضيل عن الشيباني عن سعيد بن أبي بردة عن أبيه عن أبي موسى ولم يذكر فيه الاستتابة ‏.‏",
      "text_en": " Abu Burdah said:                      A man who turned back from Islam was brought to Abu Musa. He invited him to repent for twenty days or about so. Muadh then came and invited him (to embrace Islam) but he refused. So he was beheaded.",
      "chain": [
        "30216",
        "20317",
        "11352",
        "30002",
        "11368",
        "20356",
        "11352"
      ]
    },
    {
      "hadith_no": "4587",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا حفص، حدثنا عبد العزيز بن عمر بن عبد العزيز، حدثني بعض الوفد الذين، قدموا على أبي قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما طبيب تطبب على قوم لا يعرف له تطبب قبل ذلك فأعنت فهو ضامن ‏\"‏ ‏.‏ قال عبد العزيز أما إنه ليس بالنعت إنما هو قطع العروق والبط والكى ‏.‏",
      "text_en": " Narrated AbdulAziz ibn Umar ibn AbdulAziz:                     Some people of the deputation which came to my father reported the Messenger of Allah (ﷺ) as saying: Any physician who practises medicine when he was not known as a practitioner before that and he harms (the patients) he will be held responsible. AbdulAziz said: Here physician does not refer to a man by qualification. it means opening a vein, incision and cauterisation.",
      "chain": [
        "30216",
        "20317",
        "20166"
      ]
    },
    {
      "hadith_no": "5174",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا حفص، عن الأعمش، عن طلحة، عن هزيل، قال جاء رجل - قال عثمان سعد بن أبي وقاص - فوقف على باب النبي صلى الله عليه وسلم يستأذن فقام على الباب - قال عثمان مستقبل الباب - فقال له النبي صلى الله عليه وسلم ‏\"‏ هكذا عنك أو هكذا فإنما الاستئذان من النظر ‏\"‏ ‏.‏",
      "text_en": " Narrated Huzayl:                     A man came. Uthman's version has: Sa'd ibn AbuWaqqas came. He stood at the door. Uthman's version has: (He stood) facing the door. The Prophet (ﷺ) said to him: Away from it, (stand) this side or that side. Asking permission is meant to escape from the look of an eye.",
      "chain": [
        "30203",
        "20028",
        "30201",
        "20317",
        "11060",
        "11356"
      ]
    },
    {
      "hadith_no": "5235",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مسدد بن مسرهد، حدثنا حفص، عن الأعمش، عن أبي السفر، عن عبد الله بن عمرو، قال مر بي رسول الله صلى الله عليه وسلم وأنا أطين حائطا لي أنا وأمي فقال ‏\"‏ ما هذا يا عبد الله ‏\"‏ ‏.‏ فقلت يا رسول الله شىء أصلحه فقال ‏\"‏ الأمر أسرع من ذاك ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Messenger of Allah (ﷺ) came upon us when my mother and I were plastering a wall of mine. He asked: What is this, Abdullah ? I replied: It is something I am repairing. He said! The matter is quicker for you than that.",
      "chain": [
        "30175",
        "20317",
        "11060",
        "29"
      ]
    },
    {
      "hadith_no": "18",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد، حدثنا حفص بن غياث، عن داود بن أبي هند، عن الشعبي، عن علقمة، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تستنجوا بالروث ولا بالعظام فإنه زاد إخوانكم من الجن ‏\"‏ ‏.‏ وفي الباب عن أبي هريرة وسلمان وجابر وابن عمر ‏.‏ قال أبو عيسى وقد روى هذا الحديث إسماعيل بن إبراهيم وغيره عن داود بن أبي هند عن الشعبي عن علقمة عن عبد الله أنه كان مع النبي صلى الله عليه وسلم ليلة الجن - الحديث بطوله - فقال الشعبي إن النبي صلى الله عليه وسلم قال ‏\"‏ لا تستنجوا بالروث ولا بالعظام فإنه زاد إخوانكم من الجن ‏\"‏ ‏.‏ وكأن رواية إسماعيل أصح من رواية حفص بن غياث ‏.‏ والعمل على هذا الحديث عند أهل العلم ‏.‏ وفي الباب عن جابر وابن عمر رضى الله عنهما ‏.‏",
      "text_en": " Abdullah bin Mas'ud narrated that :                     Allah's Messenger said: \"Do not perform Istinja, with dung, nor with bones. For indeed it is provisions for your brothers among the Jinn.\"",
      "chain": [
        "30480",
        "20317",
        "11585",
        "11052",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "141",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد، حدثنا حفص بن غياث، عن عاصم الأحول، عن أبي المتوكل، عن أبي سعيد الخدري، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا أتى أحدكم أهله ثم أراد أن يعود فليتوضأ بينهما وضوءا ‏\"‏ ‏.‏ قال وفي الباب عن عمر ‏.‏ قال أبو عيسى حديث أبي سعيد حديث حسن صحيح ‏.‏ وهو قول عمر بن الخطاب وقال به غير واحد من أهل العلم قالوا إذا جامع الرجل امرأته ثم أراد أن يعود فليتوضأ قبل أن يعود ‏.‏ وأبو المتوكل اسمه علي بن داود ‏.‏ وأبو سعيد الخدري اسمه سعد بن مالك بن سنان ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated that :                     the Prophet said: When one of you comes to his wife, then he wants to repeat (it), let him perform Wudu between them.\"",
      "chain": [
        "30480",
        "20317",
        "11080",
        "11297",
        "38"
      ]
    },
    {
      "hadith_no": "146",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو سعيد عبد الله بن سعيد الأشج، حدثنا حفص بن غياث، وعقبة بن خالد، قالا حدثنا الأعمش، وابن أبي ليلى، عن عمرو بن مرة، عن عبد الله بن سلمة، عن علي، قال كان رسول الله صلى الله عليه وسلم يقرئنا القرآن على كل حال ما لم يكن جنبا ‏.‏ قال أبو عيسى حديث علي هذا حديث حسن صحيح ‏.‏ وبه قال غير واحد من أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين ‏.‏ قالوا يقرأ الرجل القرآن على غير وضوء ولا يقرأ في المصحف إلا وهو طاهر ‏.‏ وبه يقول سفيان الثوري والشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Ali narrated:                     \"Allah's Messenger would recite the Qur'an in all conditions, as long as he was not Junub.\"",
      "chain": [
        "30200",
        "20317",
        "20344",
        "11060",
        "11196",
        "11381",
        "5"
      ]
    },
    {
      "hadith_no": "271",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا حفص بن غياث، عن الحجاج، عن أبي إسحاق، قال قلت للبراء بن عازب أين كان النبي صلى الله عليه وسلم يضع وجهه إذا سجد فقال بين كفيه ‏.‏ قال وفي الباب عن وائل بن حجر وأبي حميد ‏.‏ قال أبو عيسى حديث البراء حديث حسن صحيح غريب ‏.‏ وهو الذي اختاره بعض أهل العلم أن تكون يداه قريبا من أذنيه ‏.‏",
      "text_en": " Abu Ishaq narrated:                     \"I said to Al-Bara bin Azib: 'Where would the Prophet place his face when he prostrated?' He said: 'Between his hands.'\"",
      "chain": [
        "30367",
        "20317",
        "20381",
        "11049"
      ]
    },
    {
      "hadith_no": "551",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا علي بن حجر، حدثنا حفص بن غياث، عن الحجاج، عن عطية، عن ابن عمر، قال صليت مع النبي صلى الله عليه وسلم الظهر في السفر ركعتين وبعدها ركعتين ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد رواه ابن أبي ليلى عن عطية ونافع عن ابن عمر ‏.‏",
      "text_en": " Ibn Umar narrated:                     \"I prayed Zuhr with the Prophet on a journey as two Rak'ah, and two Rak'ah after it.\"",
      "chain": [
        "20387",
        "20317",
        "20381",
        "18"
      ]
    },
    {
      "hadith_no": "649",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا علي بن سعيد الكندي الكوفي، حدثنا حفص بن غياث، عن أشعث، عن عون بن أبي جحيفة، عن أبيه، قال قدم علينا مصدق النبي صلى الله عليه وسلم فأخذ الصدقة من أغنيائنا فجعلها في فقرائنا وكنت غلاما يتيما فأعطاني منها قلوصا ‏.‏ قال وفي الباب عن ابن عباس ‏.‏ قال أبو عيسى حديث أبي جحيفة حديث حسن ‏.‏",
      "text_en": " Awn bin Abi Jubaitah narrated from his father:                     \"The charity collector of the Prophet came to us. So he took the charity from our rich to our poor. I was a orphan boy, so he came to me and gave me a young she-camel from it.\"",
      "chain": [
        "38401",
        "20317",
        "11324",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "996",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا قتيبة، حدثنا حفص بن غياث، عن هشام بن عروة، عن أبيه، عن عائشة، قالت كفن النبي صلى الله عليه وسلم في ثلاثة أثواب بيض يمانية ليس فيها قميص ولا عمامة ‏.‏ قال فذكروا لعائشة قولهم في ثوبين وبرد حبرة ‏.‏ فقالت قد أتي بالبرد ولكنهم ردوه ولم يكفنوه فيه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Hisham bin Urwah narrated from his father that:                     Aishah said: \"The Prophet was shrouded in three white Yemeni cloths, there was no shirt nor turban among them.\" He said: \"So they mentioned the saying of the others to Aishah, that there were two garments and a Habir Burd. She said: 'A Burd was brought, but they refused it and they did not shroud him in it.'\"",
      "chain": [
        "30367",
        "20317",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1080",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا حفص بن غياث، عن الحجاج، عن مكحول، عن أبي الشمال، عن أبي أيوب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أربع من سنن المرسلين الحياء والتعطر والسواك والنكاح ‏\"‏ ‏.‏ قال وفي الباب عن عثمان وثوبان وابن مسعود وعائشة وعبد الله بن عمرو وأبي نجيح وجابر وعكاف ‏.‏ قال أبو عيسى حديث أبي أيوب حديث حسن غريب ‏.‏ حدثنا محمود بن خداش البغدادي، حدثنا عباد بن العوام، عن الحجاج، عن مكحول، عن أبي الشمال، عن أبي أيوب، عن النبي صلى الله عليه وسلم نحو حديث حفص ‏.‏ قال أبو عيسى وروى هذا الحديث هشيم ومحمد بن يزيد الواسطي وأبو معاوية وغير واحد عن الحجاج عن مكحول عن أبي أيوب ولم يذكروا فيه عن أبي الشمال وحديث حفص بن غياث وعباد بن العوام أصح ‏.‏",
      "text_en": " Abu Ayyub narrated that :                     The Messenger of Allah said: \"Four are from the Sunan of the Messengers: Al-Hayat, using Atar, the Siwak, and marriage.\"",
      "chain": [
        "35047",
        "20317",
        "20381",
        "11066",
        "33"
      ]
    },
    {
      "hadith_no": "1362",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا حفص بن غياث، عن أشعث، عن عدي بن ثابت، عن البراء، قال مر بي خالي أبو بردة بن نيار ومعه لواء فقلت أين تريد قال بعثني رسول الله صلى الله عليه وسلم إلى رجل تزوج امرأة أبيه أن آتيه برأسه ‏.‏ قال وفي الباب عن قرة المزني ‏.‏ قال أبو عيسى حديث البراء حديث حسن غريب ‏.‏ وقد روى محمد بن إسحاق هذا الحديث عن عدي بن ثابت عن عبد الله بن يزيد عن البراء وقد روي هذا الحديث عن أشعث عن عدي عن يزيد بن البراء عن أبيه وروي عن أشعث عن عدي عن يزيد بن البراء عن خاله عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Al-Bara':                     \"My maternal uncle Abu Burdah Ibn Niyar passed  by me and he had a flag with him. I said: 'Where are you going ?' He said: 'the Messenger of Allah (ﷺ) dispatched me to a man who married a woman his father had married to: that I should bring him his head.\"",
      "chain": [
        "30200",
        "20317",
        "11324",
        "11372",
        "400"
      ]
    },
    {
      "hadith_no": "1476",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، عن مجالد، ح قال وحدثنا سفيان بن وكيع، حدثنا حفص بن غياث، عن مجالد، عن أبي الوداك، عن أبي سعيد، عن النبي صلى الله عليه وسلم قال ‏\"‏ ذكاة الجنين ذكاة أمه ‏\"‏ ‏.‏ قال وفي الباب عن جابر وأبي أمامة وأبي الدرداء وأبي هريرة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد روي من غير هذا الوجه عن أبي سعيد ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم وهو قول سفيان الثوري وابن المبارك والشافعي وأحمد وإسحاق ‏.‏ وأبو الوداك اسمه جبر بن نوف ‏.‏",
      "text_en": " Narrated Abu Sa'eed:                     That the Prophet (ﷺ) said: \"Slaughtering the fetus is (achieved by) the slaughtering of its mother.\"",
      "chain": [
        "30160",
        "20031",
        "10820",
        "35047",
        "20317",
        "10820",
        "10752",
        "38"
      ]
    },
    {
      "hadith_no": "1496",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا حفص بن غياث، عن جعفر بن محمد، عن أبيه، عن أبي سعيد الخدري، قال ضحى رسول الله صلى الله عليه وسلم بكبش أقرن فحيل يأكل في سواد ويمشي في سواد وينظر في سواد ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب لا نعرفه إلا من حديث حفص بن غياث ‏.‏",
      "text_en": " Narrated Abu Sa'eed Al-Khudri:                     \"The Messenger of Allah (ﷺ) slaughtered a horned male ram of fine pedigree, (around) his mouth was black, and his legs were black, and (around) his eyes was black.",
      "chain": [
        "30200",
        "20317",
        "10898",
        "11442",
        "38"
      ]
    },
    {
      "hadith_no": "1559",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا حفص بن غياث، حدثنا بريد بن عبد الله بن أبي بردة، عن جده أبي بردة، عن أبي موسى، قال قدمت على رسول الله صلى الله عليه وسلم في نفر من الأشعريين خيبر فأسهم لنا مع الذين افتتحوها ‏.‏ هذا حديث حسن غريب ‏.‏ والعمل على هذا عند بعض أهل العلم قال الأوزاعي من لحق بالمسلمين قبل أن يسهم للخيل أسهم له ‏.‏ وبريد يكنى أبا بريدة وهو ثقة وروى عنه سفيان الثوري وابن عيينة وغيرهما ‏.‏",
      "text_en": " Narrated Abu Musa:                     \"I arrived upon the Messenger of Allah (ﷺ) at Khaibar along with a group of the Ash'ari tribe. He gave us shared along with those that conquered it.\"This Hadith is Hasan Sahih Gharib. This is acted upon according to some of the people of knowledge. Al-Awza'i said: \"Whoever meets up with the Muslims before the horses, share is distributed, then he is given a share.\" And Buraid's (a narrator) Kunyah is Abu Buraidah and he is trustworthy. Sufyan Ath-Thawri, Ibn 'Uyainah and others report from him.",
      "chain": [
        "30200",
        "20317",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1880",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Drinks - كتاب الأشربة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "26",
      "text_ar": "حدثنا أبو السائب، سلم بن جنادة الكوفي حدثنا حفص بن غياث، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، قال كنا نأكل على عهد رسول الله صلى الله عليه وسلم ونحن نمشي ونشرب ونحن قيام ‏.‏ قال أبو عيسى هذا حديث صحيح غريب من حديث عبيد الله بن عمر عن نافع عن ابن عمر ‏.‏ وروى عمران بن حدير هذا الحديث عن أبي البزري عن ابن عمر ‏.‏ وأبو البزري اسمه يزيد بن عطارد ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     \"We would eat during the time of the Messenger of Allah (ﷺ) while we were walking, and we would drink while we were standing.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib as a narration of 'Ubaidullah bin 'Umar, from Nafi', from Ibn 'Umar. 'Imran bin Hudair reported this Hadith from Abu Al-Bazari, from Ibn 'Umar. Abu Al-Bazari's name is Yazid bin 'Utarid.",
      "chain": [
        "20317",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2149",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو هشام الرفاعي، حدثنا حفص بن غياث، عن هشام بن عروة، عن أبيه، عن عائشة، قالت ما غرت على أحد من أزواج النبي صلى الله عليه وسلم ما غرت على خديجة وما بي أن أكون أدركتها وما ذاك إلا لكثرة ذكر رسول الله صلى الله عليه وسلم لها وإن كان ليذبح الشاة فيتتبع بها صدائق خديجة فيهديها لهن ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏",
      "text_en": " Aishah narrated:                     \"I was not jealous of any wife of the Prophet as I was jealous of Khadijah, and it was not because I saw her. It was only because the Messenger of Allah mentioned her so much, and because whenever he would slaughter a sheep, he would look for Khadijah's friends to gift them some of it.\"",
      "chain": [
        "30478",
        "20317",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2316",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا سليمان بن عبد الجبار البغدادي، حدثنا عمر بن حفص بن غياث، حدثنا أبي، عن الأعمش، عن أنس بن مالك، قال توفي رجل من أصحابه فقال يعني رجل أبشر بالجنة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أولا تدري فلعله تكلم فيما لا يعنيه أو بخل بما لا ينقصه ‏\"‏ ‏.‏ قال هذا حديث غريب ‏.‏",
      "text_en": " Anas bin Malik narrated that a man among his companions was dying so he said- meaning a man said to him:                      \"Glad tidings of Paradise.\" To which the Messenger of Allah (s.a.w) said:\"You do not know. Perhaps he spoke of what did not concern him or he was greedy with that which would not decrease him.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "19"
      ]
    },
    {
      "hadith_no": "2386",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو هشام الرفاعي، حدثنا حفص بن غياث، عن أشعث، عن الحسن، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ المرء مع من أحب وله ما اكتسب ‏\"‏ ‏.‏ وفي الباب عن علي وعبد الله بن مسعود وصفوان بن عسال وأبي هريرة وأبي موسى ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث الحسن البصري عن أنس بن مالك عن النبي صلى الله عليه وسلم ‏.‏ وقد روي هذا الحديث من غير وجه عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Anas bin Malik narrated that the Messenger of Allah (s.a.w) said:                     \" A man shall be with whoever he loves, and for him shall be what he has earned.\"",
      "chain": [
        "30478",
        "20317",
        "11324",
        "11016",
        "19"
      ]
    },
    {
      "hadith_no": "2694",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا عمر بن إسماعيل بن مجالد بن سعيد الهمداني، حدثنا حفص بن غياث، ح قال وأخبرنا سلمة بن شبيب، حدثنا أمية بن القاسم الحذاء البصري، حدثنا حفص بن غياث، عن برد بن سنان، عن مكحول، عن واثلة بن الأسقع، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تظهر الشماتة لأخيك فيرحمه الله ويبتليك ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏ ومكحول قد سمع من واثلة بن الأسقع وأنس بن مالك وأبي هند الداري ويقال إنه لم يسمع من أحد من أصحاب النبي صلى الله عليه وسلم إلا من هؤلاء الثلاثة ‏.‏ ومكحول شامي يكنى أبا عبد الله وكان عبدا فأعتق ومكحول الأزدي بصري سمع من عبد الله بن عمر يروي عنه عمارة بن زاذان ‏.‏",
      "text_en": " Wathilah bin Al-Asqa' narrated that the Messenger of Allah (s.a.w) said:                     \"Do not rejoice over the mishaps of your brother so that Allah has mercy on him and subjects you to trials.\"",
      "chain": [
        "20317",
        "30417",
        "20317",
        "19839",
        "11066",
        "4049"
      ]
    },
    {
      "hadith_no": "2773",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Description of Hellfire - كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "39",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا عمر بن حفص بن غياث، حدثنا أبي، عن العلاء بن خالد الكاهلي، عن شقيق بن سلمة، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يؤتى بجهنم يومئذ لها سبعون ألف زمام مع كل زمام سبعون ألف ملك يجرونها ‏\"‏ ‏.‏ قال عبد الله بن عبد الرحمن والثوري لا يرفعه ‏.‏",
      "text_en": " 'Abdullah bin Mas'ud narrated that the Messenger of Allah (s.a.w) said:                     \"Hell will be brought forth on that Day (of Resurrection) having seventy thousand  bridles, and with every handle will be seventy thousand  angels dragging it'\".",
      "chain": [
        "30025",
        "30204",
        "20317",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "2629",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو كريب، حدثنا حفص بن غياث، عن الأعمش، عن أبي إسحاق، عن أبي الأحوص، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الإسلام بدأ غريبا وسيعود غريبا كما بدأ فطوبى للغرباء ‏\"‏ ‏.‏ وفي الباب عن سعد وابن عمر وجابر وأنس وعبد الله بن عمرو ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من حديث ابن مسعود إنما نعرفه من حديث حفص بن غياث عن الأعمش وأبو الأحوص اسمه عوف بن مالك بن نضلة الجشمي تفرد به حفص ‏.‏",
      "text_en": " Narrated 'Abdullah bin Mas'ud:                     that the Messenger of Allah (ﷺ) said: \"Indeed Islam began as something strange and it will return to being strange as it began. So Tuba is for the strangers.\"",
      "chain": [
        "30216",
        "20317",
        "11060",
        "11049",
        "20327",
        "16"
      ]
    },
    {
      "hadith_no": "3616",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الحسن بن محمد الزعفراني، حدثنا عفان بن مسلم، حدثنا حفص بن غياث، حدثنا حبيب بن أبي عمرة، عن سعيد بن جبير، عن ابن عباس، في قول الله عز وجل ‏:‏ ‏(‏ما قطعتم من لينة أو تركتموها قائمة على أصولها ‏)‏ ‏.‏ قال اللينة النخلةيخزي الفاسقين ‏)‏ قال استنزلوهم من حصونهم قال وأمروا بقطع النخل فحك في صدورهم ‏.‏ فقال المسلمون قد قطعنا بعضا وتركنا بعضا فلنسألن رسول الله صلى الله عليه وسلم هل لنا فيما قطعنا من أجر وهل علينا فيما تركنا من وزر فأنزل الله تعالى ‏:‏ ‏(‏ما قطعتم من لينة أو تركتموها قائمة على أصولها ‏)‏ ‏.‏ الآية ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Hafs bin Ghiyath narrated:                     “Habib bin Abi Amrah narrated to us, from Sa’eed bin Jubair, from Ibn Abbas, regarding the saying of Allah, the Mighty and Sublime: What you cut down of the Linah, or you left of them standing on their trunks – he said: ‘The Linah is the date-palms.’ That He might disgrace the rebellious. He said: ‘They were forced from their forts.’ And they were ordered to cut down the date-pals, that caused some hesitation in their chests, so the Muslims said: “We cut some of them, and we left some of them, so let us ask the Messenger of Allah is we are to be rewarded for those that we cut down, and if we will be burdened for what we left?” So Allah [Most High] revealed the Ayah: What you cut down of the Linah, or you left of them standing on their trunks.”",
      "chain": [
        "30245",
        "30106",
        "20317",
        "14069",
        "11050"
      ]
    },
    {
      "hadith_no": "3617",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "وروى بعضهم، هذا الحديث عن حفص بن غياث، عن حبيب بن أبي عمرة، عن سعيد بن جبير، مرسلا ولم يذكر فيه عن ابن عباس، ‏.‏ حدثني بذلك عبد الله بن عبد الرحمن، حدثنا هارون بن معاوية، عن حفص بن غياث، عن حبيب بن أبي عمرة، عن سعيد بن جبير، عن النبي صلى الله عليه وسلم مرسلا ‏.‏ قال أبو عيسى سمع مني محمد بن إسماعيل هذا الحديث ‏.‏",
      "text_en": "",
      "chain": [
        "20317",
        "14069",
        "11050",
        "20317",
        "14069",
        "11050"
      ]
    },
    {
      "hadith_no": "3457",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا حفص بن غياث، وأبو خالد الأحمر عن حجاج بن أرطاة، عن رياح بن عبيدة، قال حفص عن ابن أخي أبي سعيد، وقال أبو خالد، عن مولى، لأبي سعيد عن أبي سعيد، رضى الله عنه قال كان النبي صلى الله عليه وسلم إذا أكل أو شرب قال ‏\"‏ الحمد لله الذي أطعمنا وسقانا وجعلنا مسلمين ‏\"‏ ‏.‏",
      "text_en": " Abu Sa’eed  [may Allah be pleased with him] narrated that:                     When the Prophet used to eat or drink, he would say: “All praise is due to Allah who fed us and gave us drink, and made us Muslims (Al-Hamdulillah, Alladhi At’amana, Wa Saqana, Wa Ja’alana Muslimin).”",
      "chain": [
        "30200",
        "20317",
        "20326",
        "20580",
        "20317",
        "38"
      ]
    },
    {
      "hadith_no": "3499",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن يحيى الثقفي المروزي، حدثنا حفص بن غياث، عن ابن جريج، عن عبد الرحمن بن سابط، عن أبي أمامة، قال قيل يا رسول الله أى الدعاء أسمع قال ‏\"‏ جوف الليل الآخر ودبر الصلوات المكتوبات ‏\"‏ ‏.‏ قال هذا حديث حسن ‏.‏ وقد روي عن أبي ذر وابن عمر عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ جوف الليل الآخر الدعاء فيه أفضل أو أرجى ‏\"‏ ‏.‏ أو نحو هذا ‏.‏",
      "text_en": " Abu Umamah narrated:                     “It was said: ‘O Messenger of Allah, which supplication is most likely to be listened to?’ He said: ‘(During) the last part of the night, and at the end of the obligatory prayers.’”",
      "chain": [
        "11222",
        "20317",
        "11070",
        "10646",
        "405"
      ]
    },
    {
      "hadith_no": "3547",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أحمد بن إبراهيم الدورقي، حدثنا عمر بن حفص بن غياث، حدثنا أبي، عن الحسن بن عبيد الله، عن عطاء بن السائب، عن عبد الله بن أبي أوفى، قال كان رسول الله صلى الله عليه وسلم يقول ‏\"‏ اللهم برد قلبي بالثلج والبرد والماء البارد اللهم نق قلبي من الخطايا كما نقيت الثوب الأبيض من الدنس ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Abdullah bin [Abi] Awfa narrated that the Messenger of Allah used to say:                     “O Allah, cool my heart with snow and hail and cold water. O Allah, cleanse my heart of sins as You cleanse a white garment of filth (Allahumma Barrid Qalbi Bith-Thalji Wal-Baradi Wal-Ma’il-Barid. Allahumma Naqqi Qalbi Min Al-Khataya Kama Naqaitath-Thawbal-Abyada Min Ad-Dannas).”",
      "chain": [
        "30494",
        "30204",
        "20317",
        "10755",
        "11068",
        "5115"
      ]
    },
    {
      "hadith_no": "4249",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو هشام الرفاعي، حدثنا حفص بن غياث، عن هشام بن عروة، عن أبيه، عن عائشة، قالت ما غرت على أحد من أزواج النبي صلى الله عليه وسلم ما غرت على خديجة وما بي أن أكون أدركتها وما ذاك إلا لكثرة ذكر رسول الله صلى الله عليه وسلم لها وإن كان ليذبح الشاة فيتتبع بها صدائق خديجة فيهديها لهن ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated 'Aishah:                     \"I was not jealous of any wife of the Prophet (ﷺ) as I was jealous of Khadijah, and it was not because I did not see her. It was only because the Messenger of Allah (ﷺ) mentioned her so much, and because whenever he would slaughter a sheep, he would look for Khadijah's friends to give them some of it.\"",
      "chain": [
        "30478",
        "20317",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "105",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "وأخبرنا الحسين بن عبد الرحمن الجرجرائي، عن طلق بن غنام، قال حدثنا زائدة، وحفص بن غياث، عن الأعمش، عن الحكم، عن عبد الرحمن بن أبي ليلى، عن البراء بن عازب، عن بلال، قال رأيت رسول الله صلى الله عليه وسلم يمسح على الخفين ‏.‏",
      "text_en": " It was narrated that Bilal said:                      \"I saw the Messenger of Allah (ﷺ) wiping over the Khuff.\"",
      "chain": [
        "30197",
        "20320",
        "20317",
        "11060",
        "11069",
        "11196",
        "400",
        "24"
      ]
    },
    {
      "hadith_no": "118",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة، قال حدثنا حفص، عن الأعمش، عن إبراهيم، عن همام، عن جرير بن عبد الله، أنه توضأ ومسح على خفيه فقيل له أتمسح فقال قد رأيت رسول الله صلى الله عليه وسلم يمسح ‏.‏ وكان أصحاب عبد الله يعجبهم قول جرير وكان إسلام جرير قبل موت النبي صلى الله عليه وسلم بيسير ‏.‏",
      "text_en": " It was narrated from Jarir bin 'Abdullah that he performed Wudu' and wiped over his Khuffs. it was said to him:                      \"Are you wiping (over you Khuffs)?\" He said: \"I saw the Messenger of Allah (ﷺ) wiping (over his Khuffs).\" The companions of 'Abdullah liked what Jarir said, because Jarir became Muslim shortly before the Prophet (ﷺ) died.[1][1]In the narration recorded by At-Tirmidhi Nos. 93,94) this comment is attributed to Ibrahim, one of the narrators.",
      "chain": [
        "30367",
        "20317",
        "11060",
        "11051",
        "11447",
        "4057"
      ]
    },
    {
      "hadith_no": "505",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا إبراهيم بن يعقوب، قال حدثنا عمر بن حفص، قال حدثنا أبي ح، وأنبأنا إبراهيم بن يعقوب، قال حدثنا يحيى بن معين، قال حدثنا حفص، ح وأنبأنا عمرو بن منصور، قال حدثنا عمر بن حفص بن غياث، قال حدثنا أبي، عن الحسن بن عبيد الله، عن إبراهيم، عن يزيد بن أوس، عن ثابت بن قيس، عن أبي موسى، يرفعه قال ‏\"‏ أبردوا بالظهر فإن الذي تجدون من الحر من فيح جهنم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Musa in a Marfu' [1] report:                      \"Wait until it cools down to pray Zuhr, for the heat you experience is a breeze from Hell.\"[1] Meaning he attributed it to the Prophet (ﷺ).",
      "chain": [
        "38088",
        "30204",
        "20317",
        "38088",
        "30020",
        "20317",
        "38433",
        "30204",
        "20317",
        "10755",
        "11051",
        "15634",
        "239"
      ]
    },
    {
      "hadith_no": "646",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال حدثنا حفص، عن عبيد الله، عن القاسم، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أذن بلال فكلوا واشربوا حتى يؤذن ابن أم مكتوم ‏\"‏ ‏.‏ قالت ولم يكن بينهما إلا أن ينزل هذا ويصعد هذا ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"The Messenger of Allah (ﷺ) said: 'Bilal calls the Adhan during the night, so eat and drink until Ibn Umm Maktum calls the Adhan.\" She said: \"And there was no more between then than the time it takes for one to come down and the other to go up.\"",
      "chain": [
        "20184",
        "20317",
        "11201",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "1009",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن آدم، عن حفص بن غياث، عن العلاء بن المسيب، عن عمرو بن مرة، عن طلحة بن يزيد، عن حذيفة، والأعمش، عن سعد بن عبيدة، عن المستورد بن الأحنف، عن صلة بن زفر، عن حذيفة، أن النبي صلى الله عليه وسلم قرأ البقرة وآل عمران والنساء في ركعة لا يمر بآية رحمة إلا سأل ولا بآية عذاب إلا استجار ‏.‏",
      "text_en": " It was narrated from Hudhaifah that:                     The Prophet (ﷺ) recited Surat Al-Baqarah, Al 'Imran and An-Nisa' in one rak'ah, and he did not reach any verse that spoke of mercy but he asked Allah for it, nor any verse that spoke of punishment but he asked Allah for protection therefrom.",
      "chain": [
        "20317",
        "11647",
        "11381",
        "11633",
        "145",
        "11060",
        "11344",
        "10824",
        "11354",
        "145"
      ]
    },
    {
      "hadith_no": "1329",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا محمد بن آدم، عن حفص، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، أن النبي صلى الله عليه وسلم سلم ثم تكلم ثم سجد سجدتى السهو ‏.‏",
      "text_en": " It was narrated from 'Abdullah that:                     The Prophet (ﷺ) said the salam, then he spoke, then he performed two prostrations of forgetfulness.",
      "chain": [
        "20317",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1661",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا أبو داود الحفري، عن حفص، عن حميد، عن عبد الله بن شقيق، عن عائشة، قالت رأيت النبي صلى الله عليه وسلم يصلي متربعا ‏.‏ قال أبو عبد الرحمن لا أعلم أحدا روى هذا الحديث غير أبي داود وهو ثقة ولا أحسب هذا الحديث إلا خطأ والله تعالى أعلم ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"I saw the Prophet (ﷺ) praying while sitting cross-legged.\"",
      "chain": [
        "30524",
        "20668",
        "20317",
        "11279",
        "10694",
        "53"
      ]
    },
    {
      "hadith_no": "1877",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسحاق، قال أنبأنا جرير، قال حدثني طلق بن معاوية، وحفص بن غياث، قال حدثني جدي، طلق بن معاوية عن أبي زرعة، عن أبي هريرة، قال جاءت امرأة إلى رسول الله صلى الله عليه وسلم بابن لها يشتكي فقالت يا رسول الله أخاف عليه وقد قدمت ثلاثة ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لقد احتظرت بحظار شديد من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"A woman came to the Messenger of Allah with a son of hers who was ill and said: 'O Messenger of Allah, I fear for him, and I have already lost three.' The Messenger of Allah said: \"You have a great protection against the Hellfire.\"",
      "chain": [
        "30021",
        "20028",
        "10777",
        "20317",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "1899",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا قتيبة، قال حدثنا حفص، عن هشام، عن أبيه، عن عائشة، قالت كفن رسول الله صلى الله عليه وسلم في ثلاثة أثواب بيض يمانية كرسف ليس فيها قميص ولا عمامة فذكر لعائشة قولهم في ثوبين وبرد من حبرة فقالت قد أتي بالبرد ولكنهم ردوه ولم يكفنوه فيه ‏.‏",
      "text_en": " Hisham narrated from his father, from 'Aishah that:                     the Messenger of Allah was shrouded in three white Yemeni garments of cotton, among which was no shirt and no turban. It was mentioned to 'Aishah that they said: \"He was buried in two garments and a Burd made of Hibrah.\" She said: \"A Burd was brought, but they sent it back and did not shroud him in it.\"",
      "chain": [
        "30367",
        "20317",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1970",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن عبيد، عن حفص بن غياث، عن ابن جريج، عن عطاء، عن جابر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن أخاكم النجاشي قد مات فقوموا فصلوا عليه ‏\"‏ ‏.‏ فقام فصف بنا كما يصف على الجنازة وصلى عليه ‏.‏",
      "text_en": " It was narrated from Jair that:                     the Messenger of Allah said: \"Your brother An-Najashi has died, so get up and offer the funeral prayer for him.\" He stood up and put us in rows as is done for the funeral prayer, and we prayed for him.",
      "chain": [
        "30213",
        "20317",
        "11070",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "2027",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا هارون بن إسحاق، قال حدثنا حفص، عن ابن جريج، عن سليمان بن موسى، وأبي الزبير، عن جابر، قال ‏:‏ نهى رسول الله صلى الله عليه وسلم أن يبنى على القبر، أو يزاد عليه، أو يجصص ‏.‏ زاد سليمان بن موسى ‏:‏ أو يكتب عليه ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"The Messenger of Allah forbade building over graves, making them larger or plastering over them.\" (One of two narrators) Sulaiman bin Musa added: \"Or writing on them.\"",
      "chain": [
        "35158",
        "20317",
        "11070",
        "10880",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "2878",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن إدريس أبو حاتم الرازي، قال حدثنا عمر بن حفص بن غياث، قال حدثنا أبي، عن مسعر، قال أخبرني طلحة بن مصرف، عن أبي مسلم الأغر، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تنتهي البعوث عن غزو هذا البيت حتى يخسف بجيش منهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet said:                     \"Troops will not cease to attack this House until an army of them are swallowed up by the earth.\"",
      "chain": [
        "20002",
        "30204",
        "20317",
        "20359",
        "11356",
        "13"
      ]
    },
    {
      "hadith_no": "2883",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا يحيى بن آدم، عن حفص بن غياث، عن الأعمش، عن إبراهيم، عن الأسود، عن عبد الله، قال كنا مع رسول الله صلى الله عليه وسلم بالخيف من منى حتى نزلت ‏{‏ والمرسلات عرفا ‏}‏ فخرجت حية فقال رسول الله صلى الله عليه وسلم ‏\"‏ اقتلوها ‏\"‏ ‏.‏ فابتدرناها فدخلت في جحرها ‏.‏",
      "text_en": " It was narrated that Abdullah said:                     \"We were with the Messenger of Allah in Al-Khaif, which is in Mina, when the following was revealed: 'By the winds sent forth one after another.' A snake came out, and the Messenger of Allah said: 'Kill it.' So they rushed to kill, but it went back into its hole.\"",
      "chain": [
        "38022",
        "20364",
        "20317",
        "11060",
        "11051",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "3079",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا هارون بن إسحاق الهمداني الكوفي، قال حدثنا حفص، عن جعفر بن محمد، عن أبيه، عن علي بن الحسين، عن ابن عباس، عن أخيه الفضل بن عباس، قال كنت ردف النبي صلى الله عليه وسلم فلم يزل يلبي حتى رمى جمرة العقبة فرماها بسبع حصيات يكبر مع كل حصاة ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that his brother Al-Fadl bin 'Abbas said:                     \"I was riding behind the Prohet and he continued to rectie the Talbiyah until he stoned Jamratul'Aqabah. He stoned it with seven pebbles, saying the Takbir with each throw.\"",
      "chain": [
        "35158",
        "20317",
        "10898",
        "11442",
        "11045",
        "17"
      ]
    },
    {
      "hadith_no": "3178",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا محمد بن إدريس، قال حدثنا عمر بن حفص بن غياث، عن أبيه، عن مسعر، عن طلحة بن مصرف، عن مصعب بن سعد، عن أبيه، أنه ظن أن له، فضلا على من دونه من أصحاب النبي صلى الله عليه وسلم فقال نبي الله صلى الله عليه وسلم ‏\"‏ إنما ينصر الله هذه الأمة بضعيفها بدعوتهم وصلاتهم وإخلاصهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Mus'ab bin Sa'd, from his father, that he thought he was better than other Companions of the Prophet (ﷺ). The Prophet of Allah (ﷺ) said:                      \"Rather, Allah support this Ummah because of their supplication, their Salah, and their sincerity.\"",
      "chain": [
        "20002",
        "30204",
        "20317",
        "20359",
        "11356",
        "10556",
        "9"
      ]
    },
    {
      "hadith_no": "3235",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمد بن عبد العزيز بن أبي رزمة، قال حدثنا حفص بن غياث، قال حدثنا عاصم، عن بكر بن عبد الله المزني، عن المغيرة بن شعبة، قال خطبت امرأة على عهد رسول الله صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ أنظرت إليها ‏\"‏ ‏.‏ قلت لا ‏.‏ قال ‏\"‏ فانظر إليها فإنه أجدر أن يؤدم بينكما ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Mughirah bin Shu'bah:                     It was narrated that Al-Mughirah bin Shu'bah said: \"I proposed marriage to a woman during the time of the Messenger of Allah, and the Prophet said: 'Have you seen her?' I said: 'No.' He said: 'Look at her, for that is more likely to create love between you.'\"",
      "chain": [
        "30379",
        "20317",
        "11080",
        "11267",
        "166"
      ]
    },
    {
      "hadith_no": "3394",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن يحيى بن أيوب، قال حدثنا حفص بن غياث، قال حدثنا الأعمش، عن أبي إسحاق، عن أبي الأحوص، عن عبد الله، أنه قال طلاق السنة تطليقة وهي طاهر في غير جماع فإذا حاضت وطهرت طلقها أخرى فإذا حاضت وطهرت طلقها أخرى ثم تعتد بعد ذلك بحيضة ‏.‏ قال الأعمش سألت إبراهيم فقال مثل ذلك ‏.‏",
      "text_en": " It was narrated from 'Abdullah that he said:                      \"The Sunnah divorce is a divorce issued when she is pure (not menstruating) without having had intercourse with her. If she menstruates and becomes pure again, give her another divorce, and if she menstruates and becomes pure again, give her another divorce, then after that, she should wait for another menstrual cycle.\"  (One of the narrators) Al-A'mash said: \"I asked Ibrahim, and he said something similar.\"",
      "chain": [
        "38617",
        "20317",
        "11060",
        "11049",
        "20327",
        "18",
        "11060"
      ]
    },
    {
      "hadith_no": "3547",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا حفص، قال حدثنا هشام، عن أبيه، عن فاطمة، قالت قلت يا رسول الله زوجي طلقني ثلاثا وأخاف أن يقتحم على ‏.‏ فأمرها فتحولت ‏.‏",
      "text_en": " Hisham narrated from his father that Fatimah said:                      \"I said: 'O Messenger of Allah! My husband has divorced me three times and I am afraid that my house be broken into.' So he told her to move.\"",
      "chain": [
        "30170",
        "20317",
        "11065",
        "10511",
        "63"
      ]
    },
    {
      "hadith_no": "4313",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا قتيبة، قال حدثنا حفص، عن عاصم، وداود، عن الشعبي، عن ابن صفوان، قال أصبت أرنبين فلم أجد ما أذكيهما به فذكيتهما بمروة فسألت النبي صلى الله عليه وسلم عن ذلك فأمرني بأكلهما ‏.‏",
      "text_en": " It was narrated that Ibn Safwan said:                     \"I caught two rabbits but I could not find anything with which to slaughter then, so I slaughtered them with a sharp-edged stone. I asked the Prophet about that and he commanded me to eat them\"",
      "chain": [
        "30367",
        "20317",
        "11080",
        "11052"
      ]
    },
    {
      "hadith_no": "4390",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا عبد الله بن سعيد أبو سعيد الأشج، قال حدثنا حفص بن غياث، عن جعفر بن محمد، عن أبيه، عن أبي سعيد، قال ضحى رسول الله صلى الله عليه وسلم بكبش أقرن فحيل يمشي في سواد ويأكل في سواد وينظر في سواد ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed said:                     \"The Messenger of Allah sacrificed a horned, intact ram, with black feet some black at the stomach and black around its eyes.\" (Sahih )",
      "chain": [
        "20317",
        "10898",
        "11442",
        "38"
      ]
    },
    {
      "hadith_no": "4609",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرني محمد بن آدم، عن حفص بن غياث، عن الأعمش، عن إبراهيم، عن الأسود، عن عائشة، قالت اشترى رسول الله صلى الله عليه وسلم من يهودي طعاما إلى أجل ورهنه درعه ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah bought some food from a Jew with payment to be made later, and he put his shield in pledge for that.\"",
      "chain": [
        "20317",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "4648",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا محمد بن إدريس، قال حدثنا عمر بن حفص بن غياث، قال حدثنا أبي، عن أبي عميس، قال حدثني عبد الرحمن بن محمد بن الأشعث، عن أبيه، عن جده، قال عبد الله سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا اختلف البيعان وليس بينهما بينة فهو ما يقول رب السلعة أو يتركا ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah said:                     \"I heard the Messenger of Allah say: 'If the two parties to a transaction disagree, and neither of them has any proof, then it is as the owner of the goods says, or they may cancel it.'''",
      "chain": [
        "20002",
        "30204",
        "20317",
        "15328",
        "15470",
        "16"
      ]
    },
    {
      "hadith_no": "5254",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن يحيى بن محمد، قال حدثنا عمر بن حفص، قال حدثنا أبي، عن الأعمش، عن إبراهيم، عن أبي عبيدة، عن عبد الله، قال لعن الله المتنمصات والمتفلجات والمتوشمات المغيرات خلق الله ‏.‏ فأتته امرأة فقالت أنت الذي تقول كذا وكذا قال وما لي لا أقول ما قال رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"May Allah curse Al-Mutanammisat and their teeth separated, who have tattoos done, changing the creation of Allah.\" A woman came to him and said: \"Are you the one who said such-and-such?\" He said: \"Why should I not say what the Messenger of Allah [SAW] said?\"",
      "chain": [
        "11222",
        "30204",
        "20317",
        "11060",
        "11051",
        "10",
        "16"
      ]
    },
    {
      "hadith_no": "5470",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا قتيبة، قال حدثنا خلف، عن حفص، عن أنس، أن النبي صلى الله عليه وسلم كان يدعو بهذه الدعوات ‏\"‏ اللهم إني أعوذ بك من علم لا ينفع وقلب لا يخشع ودعاء لا يسمع ونفس لا تشبع ‏\"‏ ‏.‏ ثم يقول ‏\"‏ اللهم إني أعوذ بك من هؤلاء الأربع ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas that :                     The Prophet [SAW] used to say these supplications: \"Allahumma inni a'udhu bika min 'ilmin la yanfa'u, wa qalbin la yakhsha'u, wa du'a'in la yasma'u, wa nafsin la tashba'u. (O Allah, I seek refuge with You from knowledge that is of no benefit, a heart that is not humble, a supplication that is not heard and a soul that is not satisfied.)\" Then he would say: 'Allahumma inni a'udhu bika min ha'ula'il-arba' (O Allah, I seek refuge with You from these four.)'\"",
      "chain": [
        "30367",
        "20317",
        "19"
      ]
    },
    {
      "hadith_no": "620",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، قال حدثنا حفص بن غياث، عن جعفر بن محمد، عن أبيه، عن جابر، قال قلت يا رسول الله أنا في، أرض باردة فكيف الغسل من الجنابة فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ أما أنا فأحثو على رأسي ثلاثا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"I said: 'O Messenger of Allah! I live in a cold land, so how should I have a bath to cleanse myself from sexual impurity?' He said: 'As for me, I pour three handfuls of water over my head.'\"",
      "chain": [
        "30201",
        "20317",
        "10898",
        "11442",
        "34"
      ]
    },
    {
      "hadith_no": "714",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Adhan and the Sunnah Regarding It - كتاب الأذان والسنة فيها",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن أشعث، عن الحسن، عن عثمان بن أبي العاص، قال كان آخر ما عهد إلى النبي  صلى الله عليه وسلم  أن لا أتخذ مؤذنا يأخذ على الأذان أجرا ‏.‏",
      "text_en": " It was narrated that 'Uthman bin Abul-As said:                     \"The last instruction that the Messenger of Allah gave to me was that I should not appoint a Mu'adh-dhin who took payment for the Adhan.\" (sahih)",
      "chain": [
        "30201",
        "20317",
        "11324",
        "11016",
        "3210"
      ]
    },
    {
      "hadith_no": "882",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن بديل، حدثنا حفص بن غياث، حدثنا عبيد الله، عن نافع، عن ابن عمر، قال كان النبي  صلى الله عليه وسلم  يقرأ في المغرب ‏{قل يا أيها الكافرون}‏ و ‏{قل هو الله أحد}‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “The Prophet (ﷺ) used torecitein the Maghrib: ‘Say: O you disbelievers!’[Al-Kafirun (109)]and‘Say: He is Allah, (the) One.’”[Al-Ikhlas (112)]",
      "chain": [
        "35000",
        "20317",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "947",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن محمد، حدثنا حفص بن غياث، حدثنا العلاء بن المسيب، عن عمرو بن مرة، عن طلحة بن يزيد، عن حذيفة، ح وحدثنا علي بن محمد، حدثنا حفص بن غياث، عن الأعمش، عن سعد بن عبيدة، عن المستورد بن الأحنف، عن صلة بن زفر، عن حذيفة، أن النبي  صلى الله عليه وسلم  كان يقول بين السجدتين ‏\"‏ رب اغفر لي رب اغفر لي ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Hudhaifah that the Prophet (ﷺ) used to saybetweenthe two prostrations:                      “Rabbighfir li, Rabbighfir li (O Lordforgiveme, O Lord forgive me).”",
      "chain": [
        "38409",
        "20317",
        "11647",
        "11381",
        "11633",
        "145",
        "38409",
        "20317",
        "11060",
        "11344",
        "10824",
        "11354",
        "145"
      ]
    },
    {
      "hadith_no": "1021",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن الصباح، أنبأنا حفص بن غياث، عن عبد الله بن سعيد المقبري، عن أبيه، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إذا تثاءب أحدكم فليضع يده على فيه ولا يعوي فإن الشيطان يضحك منه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “When anyone of you yawns, let him put his hand over his mouthandnot make a sound, because Satan laughs at him.”",
      "chain": [
        "30269",
        "20317",
        "22096",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "1168",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا داود بن رشيد، حدثنا حفص بن غياث، عن الأعمش، عن أبي صالح، عن أبي هريرة، وعن أبي سفيان، عن جابر، قالا جاء سليك الغطفاني ورسول الله  صلى الله عليه وسلم  يخطب فقال له النبي  صلى الله عليه وسلم  ‏\"‏ أصليت ركعتين قبل أن تجيء ‏\"‏ قال لا ‏.‏ قال ‏\"‏ فصل ركعتين وتجوز فيهما ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Jabir said:                      “Sulaik Al-Ghatafani came while theMessenger of Allah (ﷺ) was delivering the sermon. The Prophet (ﷺ)said to him: ‘Did you perform two Rak’ah before you came?’ Hesaid:‘No.’ He said: ‘Then perform two Rak’ah, but make thembrief.’”",
      "chain": [
        "30248",
        "20317",
        "11060",
        "11161",
        "13",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "1299",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن إدريس، وحفص بن غياث، ويزيد بن هارون، عن أبي مالك الأشجعي، سعد بن طارق قال قلت لأبي يا أبت إنك قد صليت خلف رسول الله  صلى الله عليه وسلم  وأبي بكر وعمر وعثمان وعلي ها هنا بالكوفة نحوا من خمس سنين فكانوا يقنتون في الفجر فقال أى بنى محدث ‏.‏",
      "text_en": " Sa’dbin Taris said:                      “I said to my father: ‘O my father! You prayedbehind the Messenger of Allah (ﷺ) and behind Abu Bakr, ‘Umar and‘Uthman, and behind ‘Ali here in Kufah for about five years. Didtheyrecite Qunut in Fajr?’ He said: ‘O my son! That is aninnovation.’”",
      "chain": [
        "30201",
        "20102",
        "20317",
        "20472",
        "10766"
      ]
    },
    {
      "hadith_no": "1369",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن سعيد، حدثنا حفص بن غياث، حدثنا حجاج بن أرطاة، عن عبد الرحمن بن عابس، عن ابن عباس، أن النبي  صلى الله عليه وسلم  كان يخرج بناته ونساءه في العيدين ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Prophet (ﷺ) used to bringhisdaughters and his wives out on the two ‘Eid.",
      "chain": [
        "11184",
        "20317",
        "20580",
        "11638",
        "17"
      ]
    },
    {
      "hadith_no": "1430",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا حفص بن غياث، وأسباط بن محمد، قالا حدثنا الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، عن علقمة، عن أبي مسعود، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الآيتان من آخر سورة البقرة من قرأهما في ليلة كفتاه ‏\"‏ ‏.‏ قال حفص في حديثه قال عبد الرحمن فلقيت أبا مسعود وهو يطوف فحدثني به ‏.‏",
      "text_en": " It wasnarrated that Abu Mas’ud said:                      The Messenger of Allah (ﷺ)said:“Whoever recites the last two Verses of Surat Al-Baqarah atnight,that will be sufficient for him.”",
      "chain": [
        "30212",
        "20317",
        "20408",
        "11060",
        "11051",
        "11055",
        "11017",
        "402"
      ]
    },
    {
      "hadith_no": "1536",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن هشام بن عروة، عن أبيه، عن عائشة، أن النبي  صلى الله عليه وسلم  كفن في ثلاثة أثواب بيض يمانية ليس فيها قميص ولا عمامة فقيل لعائشة إنهم كانوا يزعمون أنه قد كان كفن في حبرة ‏.‏ فقالت عائشة قد جاءوا ببرد حبرة فلم يكفنوه ‏.‏",
      "text_en": " It wasnarrated from ‘Aishah that the Prophet (ﷺ) was shrouded inthreewhite Yemeni cloths, among which there was no shirt and noturban. Itwas said to ‘Aishah:                      “They used to claim that he wasshrouded inHibarah.” ‘Aishah said: “They brought a Hibarah Burd, buttheydid not shroud him in it.”",
      "chain": [
        "30201",
        "20317",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1568",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن سعيد، حدثنا حفص بن غياث، عن حجاج، عن أبي الزبير، عن جابر، قال ما أباح لنا رسول الله  صلى الله عليه وسلم  ولا أبو بكر ولا عمر في شىء ما أباحوا في الصلاة على الميت ‏.‏ يعني لم يوقت ‏.‏",
      "text_en": " It wasnarrated that Jabir said:                      “The Messenger of Allah (ﷺ), AbuBakrand ‘Umar did not give us so much leeway in anything as they didwith regard to the prayer for the deceased,” meaning that there wasnothing affixed.",
      "chain": [
        "11184",
        "20317",
        "20219",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1630",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن سعيد، حدثنا حفص بن غياث، عن ابن جريج، عن سليمان بن موسى، عن جابر، قال نهى رسول الله  صلى الله عليه وسلم  أن يكتب على القبر شىء ‏.‏",
      "text_en": " It wasnarrated that Jabir said:                      “The Messenger of Allah (ﷺ)forbadewriting anything on graves.”",
      "chain": [
        "11184",
        "20317",
        "11070",
        "10880",
        "34"
      ]
    },
    {
      "hadith_no": "1715",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن عبد الله بن سعيد، عن جده، عن أبي هريرة، قال نهى رسول الله  صلى الله عليه وسلم  عن تعجيل صوم يوم قبل الرؤية ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Messenger of Allah (ﷺ)forbade anticipating the fast by fasting one day before sighting (ofthe crescent).”",
      "chain": [
        "30201",
        "20317",
        "11184",
        "13"
      ]
    },
    {
      "hadith_no": "1746",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا عبيد الله بن عبد الكريم، حدثنا الحكم بن موسى، حدثنا عيسى بن يونس، ح وحدثنا عبيد الله، حدثنا علي بن الحسن بن سليمان أبو الشعثاء، حدثنا حفص بن غياث، جميعا عن هشام، عن ابن سيرين، عن أبي هريرة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ من ذرعه القىء فلا قضاء عليه ومن استقاء فعليه القضاء ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) said:                     “Whoeverunintentionally vomits, he does not have to make up for thefast, butwhoever makes himself vomit, has to make up for the fast.”",
      "chain": [
        "30502",
        "20347",
        "11201",
        "20317",
        "11065",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "1794",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو معاوية، وحفص بن غياث، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال نهى رسول الله  صلى الله عليه وسلم  عن صوم يوم الجمعة إلا بيوم قبله أو يوم بعده ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Messenger of Allah (ﷺ)forbade fasting on a Friday unless it (is joined to) the day beforeorthe day after.”",
      "chain": [
        "30201",
        "20354",
        "20317",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "1908",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن آدم، حدثنا حفص بن غياث، عن هشام بن عروة، عن أبيه، عن زينب بنت أم سلمة، عن أم سلمة، قالت أمرنا رسول الله  صلى الله عليه وسلم  بالصدقة ‏.‏ فقالت زينب امرأة عبد الله أيجزيني من الصدقة أن أتصدق على زوجي وهو فقير وبني أخ لي أيتام وأنا أنفق عليهم هكذا وهكذا وعلى كل حال قال ‏\"‏ نعم ‏\"‏ ‏.‏ قال وكانت صناع اليدين ‏.‏",
      "text_en": " It was narrated that:                     Umm Salmah said: “The Messenger of Allah enjoined charity upon us. Zainab, the wife of Abdullah said: 'Will it accepted as charity on my part if I give charity to my husband who is poor, and to children of a brother of mine who are orphans, spending such and such on them, and in all circumstances?' He said: 'Yes.' ”",
      "chain": [
        "30201",
        "20364",
        "20317",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "1937",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن حجاج، عن محمد بن سليمان، عن عمه، سهل بن أبي حثمة عن محمد بن مسلمة، قال خطبت امرأة فجعلت أتخبأ لها حتى نظرت إليها في نخل لها فقيل له أتفعل هذا وأنت صاحب رسول الله  صلى الله عليه وسلم  فقال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ إذا ألقى الله في قلب امرئ خطبة امرأة فلا بأس أن ينظر إليها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that:                     Muhammad bin Salamah said: “I proposed marriage to a woman, then I hid and waited to see her until I saw her among some date palm trees that belonged to her.” It was said to him: “Do you do such a thing when you are a companion of the Messenger of Allah?” He said: “I heard the Messenger of Allah saying: 'When Allah causes a man to propose to a woman, there is nothing wrong with him looking at her.' ”",
      "chain": [
        "30201",
        "20317",
        "20219",
        "1822",
        "167"
      ]
    },
    {
      "hadith_no": "2099",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا علي بن ميمون الرقي، حدثنا حفص بن غياث، عن الأعمش، عن أبي إسحاق، عن أبي الأحوص، عن عبد الله، قال طلاق السنة يطلقها عند كل طهر تطليقة فإذا طهرت الثالثة طلقها وعليها بعد ذلك حيضة ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"Divorce according to the Sunnah means divorcing her with one divorce in each cycle when she is pure, then when she becomes pure the third time, then he pronounces divorce again, and after that she must wait one more menstrual cycle.\"",
      "chain": [
        "38412",
        "20317",
        "11060",
        "11049",
        "20327",
        "18"
      ]
    },
    {
      "hadith_no": "2111",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن هشام بن عروة، عن أبيه، عن عائشة، قالت قالت فاطمة بنت قيس يا رسول الله إني أخاف أن يقتحم على ‏.‏ فأمرها أن تتحول ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     “Fatimah bint Qais said: 'O Messenger of Allah, (ﷺ) I am afraid that someone may enter upon me by force.' So he told her to move.\"",
      "chain": [
        "30201",
        "20317",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2152",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن الأعمش، عن إبراهيم، عن الأسود بن يزيد، عن عائشة، أنها أعتقت بريرة فخيرها رسول الله  صلى الله عليه وسلم  وكان لها زوج حر ‏.‏",
      "text_en": " It was narrated from Aishah that:                     she freed Barirah and the Messenger of Allah (ﷺ) gave her the choice, and she (Barirah) had a free husband.",
      "chain": [
        "30201",
        "20317",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2210",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، عن عمر بن الخطاب، قال نذرت نذرا في الجاهلية فسألت النبي  صلى الله عليه وسلم  بعد ما أسلمت فأمرني أن أوفي بنذري ‏.‏",
      "text_en": " It was narrated that 'Umar bin Khattab said:                     \"I made a vow during the Ignorance period and I asked the Prophet (ﷺ) (about it) after I became Muslim. He told me to fulfill my vow.\"",
      "chain": [
        "30201",
        "20317",
        "11201",
        "11014",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "2357",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا عبد الله بن سعيد، حدثنا حفص بن غياث، وأبو خالد عن حجاج، عن أبي الزبير، عن جابر، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لا بأس الحيوان بالحيوان واحدا باثنين يدا بيد ‏\"‏ ‏.‏ وكرهه نسيئة ‏.‏",
      "text_en": " It was narrated from Jabir that the Messenger of Allah (ﷺ) said:                     \"There is nothing wrong with selling animals, one for two, hand to hand,\" but he disliked selling them on credit.",
      "chain": [
        "11184",
        "20317",
        "20219",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "2385",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن محمد بن زيد، عن عمير، - مولى آبي اللحم - قال كان مولاى يعطيني الشىء فأطعم منه فمنعني - أو قال فضربني - فسألت النبي  صلى الله عليه وسلم  أو سأله فقلت لا أنتهي أو لا أدعه ‏.‏ فقال ‏\"‏ الأجر بينكما ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Umair, the freed slave of Aabi Lahm, said:                     \"My master used to give me food and I would feed others from it, then he stopped me,\" or he said: \"He beat me. So I asked the Prophet,” -or- \"he asked him and I said: 'I will not stop.' He said: 'Both of you will be rewarded.\"'",
      "chain": [
        "30201",
        "20317",
        "11217",
        "3141"
      ]
    },
    {
      "hadith_no": "2530",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن الأعمش، عن إبراهيم، حدثني الأسود، عن عائشة، أن النبي صلى الله عليه وسلم اشترى من يهودي طعاما إلى أجل وأرهنه درعه ‏.‏",
      "text_en": " It was narrated from 'Aisha that :                     the Messenger of Allah (ﷺ) bought some food from a Jew with payment to be made later, and he pawned his armor for that.",
      "chain": [
        "30201",
        "20317",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2705",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا إسماعيل بن موسى، حدثنا هشيم، ح وحدثنا سهل بن أبي سهل، حدثنا حفص بن غياث، جميعا عن أشعث، عن عدي بن ثابت، عن البراء بن عازب، قال مر بي خالي - سماه هشيم في حديثه الحارث بن عمرو - وقد عقد له النبي صلى الله عليه وسلم لواء فقلت له أين تريد فقال بعثني رسول الله صلى الله عليه وسلم إلى رجل تزوج امرأة أبيه من بعده فأمرني أن أضرب عنقه ‏.‏",
      "text_en": " It was narrated that Bara bin Azib said:                     “My maternal uncle passed by me - (one of the narrators) Hushaim named him in his narration as Harith bin Amr - and the Prophet (ﷺ) had given him a banner to carry. I said to him: 'Where are you going?’ He said: 'The Messenger of Allah (ﷺ) has sent me to a man who married his father's wife after he died, and has commanded me to strike his neck (i.e. execute him).”",
      "chain": [
        "35016",
        "20468",
        "38259",
        "20317",
        "11324",
        "11372",
        "400"
      ]
    },
    {
      "hadith_no": "2927",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن عاصم الأحول، عن أبي عثمان، عن عمر، أنه كان ينهى عن الحرير، والديباج، إلا ما كان هكذا ثم أشار بإصبعه ثم الثانية ثم الثالثة ثم الرابعة وقال كان رسول الله صلى الله عليه وسلم ينهانا عنه ‏.‏",
      "text_en": " It wasnarrated from ‘Umar that he used to forbid silk and brocadeexceptthat which was like that, then he gestured with his finger,then hissecond finger, then his third, then his fourth,* and said:                     “TheMessenger of Allah (ﷺ) used to forbid that to us.”",
      "chain": [
        "30201",
        "20317",
        "11080",
        "11113",
        "3"
      ]
    },
    {
      "hadith_no": "3183",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا هناد بن السري، حدثنا ابن أبي زائدة، وعبدة، ووكيع، وأبو معاوية ح وحدثنا علي بن محمد، حدثنا وكيع، وأبو معاوية ح وحدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، كلهم عن هشام بن عروة، عن أبيه، عن عائشة، قالت إن نزول الأبطح ليس بسنة إنما نزله رسول الله  صلى الله عليه وسلم  ليكون أسمح لخروجه ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “Staying in Abtah is not Sunnah;theMessenger of Allah (ﷺ) only stayed there because it was moreconvenient for his departure.”",
      "chain": [
        "30480",
        "20366",
        "20337",
        "20032",
        "20354",
        "38409",
        "20032",
        "20354",
        "30201",
        "20317",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3248",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا حفص بن غياث، عن جعفر بن محمد، عن أبيه، عن أبي سعيد، قال ضحى رسول الله  صلى الله عليه وسلم  بكبش أقرن فحيل يأكل في سواد ويمشي في سواد وينظر في سواد ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed said:                      “The Messenger of Allah (ﷺ)sacrificed a horned, defectless ram with a black stomach, black feetand black around its eyes.”",
      "chain": [
        "30212",
        "20317",
        "10898",
        "11442",
        "38"
      ]
    },
    {
      "hadith_no": "3426",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو السائب، سلم بن جنادة حدثنا حفص بن غياث، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، قال كنا على عهد رسول الله  صلى الله عليه وسلم  نأكل ونحن نمشي ونشرب ونحن قيام ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “At the time of the Messenger ofAllah (ﷺ) we used to eat while walking, and drink while standingup.”",
      "chain": [
        "20317",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3724",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، عن عاصم، عن أبي عثمان، عن عمر، أنه كان ينهى عن الحرير، والديباج، إلا ما كان هكذا ثم أشار بإصبعه ثم الثانية ثم الثالثة ثم الرابعة فقال كان رسول الله  صلى الله عليه وسلم  ينهانا عنه ‏.‏",
      "text_en": " It wasnarrated from ‘Umar that he used to forbid silk and brocade,exceptfor what was like this:                      Then he gestured with his finger, thenasecond, and a third, and a fourth (i.e., the width of four fingers),and he said: “The Messenger of Allah (ﷺ) used to forbid it.”",
      "chain": [
        "30201",
        "20317",
        "11080",
        "11113",
        "3"
      ]
    },
    {
      "hadith_no": "3759",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا حفص، وأبو معاوية ووكيع عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لأن يمتلئ جوف الرجل قيحا حتى يريه خير له من أن يمتلئ شعرا ‏\"‏ ‏.‏ إلا أن حفصا لم يقل يريه ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah(ﷺ) said:                     \"If a man were to fill his stomach completely with pus until it destroyed him, that would be better for him than filling (his mind) with poetry.\"",
      "chain": [
        "20436",
        "20317",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "4061",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو معاوية، وحفص بن غياث، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فإذا قالوها عصموا مني دماءهم وأموالهم إلا بحقها وحسابهم على الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “I have been commanded to fight the people until they say: Lailaha illallah. If they say it, then their blood and wealth areprotected from me, except for a right that is due from it, and theirreckoning will be with Allah.”",
      "chain": [
        "30201",
        "20354",
        "20317",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "4065",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا إسماعيل بن حفص الأبلي، حدثنا حفص بن غياث، عن عاصم، عن السميط، عن عمران بن الحصين، قال بعثنا رسول الله  صلى الله عليه وسلم  في سرية فحمل رجل من المسلمين على رجل من المشركين فذكر الحديث وزاد فيه فنبذته الأرض فأخبر النبي  صلى الله عليه وسلم  وقال ‏\"‏ إن الأرض لتقبل من هو أشر منه ولكن الله أحب أن يريكم تعظيم حرمة لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sumait, from‘Imran bin Husain who said:                      “TheMessenger of Allah (ﷺ) sent uson a campaign, and a Muslim manattacked an idolater man.” And hementioned the Hadith and added: “Andthe earth cast him out. TheProphet (ﷺ) was told about that and hesaid: ‘The earth acceptsthose who are worse than him, but Allahwanted to show you how greatis the sanctity of La ilaha illallah.’”",
      "chain": [
        "20317",
        "11080"
      ]
    },
    {
      "hadith_no": "4123",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا حفص بن غياث، عن الأعمش، عن أبي إسحاق، عن أبي الأحوص، عن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن الإسلام بدأ غريبا وسيعود غريبا فطوبى للغرباء ‏\"‏ ‏.‏ قال قيل ومن الغرباء قال النزاع من القبائل ‏.‏",
      "text_en": " It was narrated from ‘Abdullah that the Messenger of Allah (ﷺ)said:                      “Islam began as something strange and will go back to beingstrange, so glad tidings to the strangers.” It was said: “Who arethestrangers?’ He said: “Strangers who have left their familiesandtribes.”",
      "chain": [
        "35047",
        "20317",
        "11060",
        "11049",
        "20327",
        "18"
      ]
    }
  ],
  "total_hadiths": 258
}