{
  "id": "20312",
  "name": "Isma'il bin Aban al-Waraq إسماعيل بن أبان الوراق الأزدي",
  "full_name": "Isma'il bin Aban al-Waraq إسماعيل بن أبان الوراق الأزدي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "216",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  صد  ت  -  ثقة ]"
    ],
    "tags": [
      "al-Azdi",
      "Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11517",
      "name": "'Abdur Rahman bin Sulaiman ibn al-Ghasil عبد الرحمن بن سليمان - ابن الغسيل",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "18598",
      "name": "'Abdul Hameed bin Bhram عبد الحميد بن بهرام الفزاري المدائني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20327",
      "name": "Abu al-Ahwus, Salam bin Sulaym al-Hanafi أبو الأحوص سلام بن سليم الحنفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20102",
      "name": "'Abdullah bin Idris bin Yazid al-Audi عبد الله بن إدريس بن يزيد الأودي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30203",
      "name": "'Uthman bin Muhammad عثمان بن محمد بن إبراهيم / بن أبي شيبة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30475",
      "name": "al-Qasim bin Zakaria bin Dinar القاسم بن زكريا بن دينار القرشي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30025",
      "name": "'Abdullah bin 'Abdur Rahman al-Daarimi عبد الله بن عبد الرحمن الدارمي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-927",
      "hadith_no": "927",
      "source": "Sahih Bukhari",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا إسماعيل بن أبان، قال حدثنا ابن الغسيل، قال حدثنا عكرمة، عن ابن عباس  رضى الله عنهما  قال صعد النبي صلى الله عليه وسلم المنبر وكان آخر مجلس جلسه متعطفا ملحفة على منكبيه، قد عصب رأسه بعصابة دسمة، فحمد الله وأثنى عليه ثم قال ‏\"‏ أيها الناس إلى ‏\"‏‏.‏ فثابوا إليه ثم قال ‏\"‏ أما بعد، فإن هذا الحى من الأنصار يقلون، ويكثر الناس، فمن ولي شيئا من أمة محمد صلى الله عليه وسلم فاستطاع أن يضر فيه أحدا أو ينفع فيه أحدا، فليقبل من محسنهم، ويتجاوز عن مسيهم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Once the Prophet ascended the pulpit and it was the last gathering in which he took part. He was covering his shoulder with a big cloak and binding his head with an oily bandage. He glorified and praised Allah and said, \"O people! Come to me.\" So the people came and gathered around him and he then said, \"Amma ba'du.\" \"From now onward the Ansar will decrease and other people will increase. So anybody who becomes a ruler of the followers of Muhammad and has the power to harm or benefit people then he should accept the good from the benevolent amongst them (Ansar) and overlook the faults of their wrong-doers.\"",
      "usc_msa_ref": "49",
      "chain": [
        "20312",
        "11517",
        "11023",
        "17"
      ]
    },
    {
      "id": "sahih-bukhari-1680",
      "hadith_no": "1680",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا علي، سمع أبا بكر بن عياش، حدثنا عبد العزيز، لقيت أنسا‏.‏ وحدثني إسماعيل بن أبان، حدثنا أبو بكر، عن عبد العزيز، قال خرجت إلى منى يوم التروية فلقيت أنسا  رضى الله عنه  ذاهبا على حمار فقلت أين صلى النبي صلى الله عليه وسلم هذا اليوم الظهر فقال انظر حيث يصلي أمراؤك فصل‏.‏",
      "text_en": " Narrated `Abdul `Aziz:                     I went out to Mina on the day of Tarwiya and met Anas going on a donkey. I asked him, \"Where did the Prophet offer the Zuhr prayer on this day?\" Anas replied, \"See where your chiefs pray and pray similarly.\"",
      "usc_msa_ref": "716",
      "chain": [
        "30026",
        "20373",
        "20312",
        "20436",
        "11295"
      ]
    },
    {
      "id": "sahih-bukhari-4765",
      "hadith_no": "4765",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إسماعيل بن أبان، حدثنا أبو الأحوص، عن آدم بن علي، قال سمعت ابن عمر، رضى الله عنهما يقول إن الناس يصيرون يوم القيامة جثا، كل أمة تتبع نبيها، يقولون يا فلان اشفع، حتى تنتهي الشفاعة إلى النبي صلى الله عليه وسلم فذلك يوم يبعثه الله المقام المحمود‏.‏",
      "text_en": " Narrated Ibn `Umar:                     On the Day of Resurrection the people will fall on their knees and every nation will follow their prophet and they will say, \"O so-and-so! Intercede (for us with Allah), \"till (the right) intercession is given to the Prophet (Muhammad) and that will be the day when Allah will raise him into a station of praise and glory (i.e. Al-Maqam -al-Mahmud).",
      "usc_msa_ref": "242",
      "chain": [
        "20312",
        "20327",
        "11675",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-5764",
      "hadith_no": "5764",
      "source": "Sahih Bukhari",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا إسماعيل بن أبان، حدثنا ابن الغسيل، قال حدثني عاصم بن عمر، عن جابر بن عبد الله، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إن كان في شىء من أدويتكم خير ففي شربة عسل أو شرطة محجم أو لذعة من نار، وما أحب أن أكتوي ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     I heard the Prophet saying, \"If there is any good in your medicines, then it is in a gulp of honey, a cupping operation, or branding (cauterization), but I do not like to be (cauterized) branded.",
      "usc_msa_ref": "603",
      "chain": [
        "20312",
        "11517",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-6610",
      "hadith_no": "6610",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا إسماعيل بن أبان، حدثنا عيسى بن يونس، حدثنا ابن عون، عن نافع، عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم‏.‏ ‏{‏يوم يقوم الناس لرب العالمين‏}‏ قال ‏\"‏ يقوم أحدهم في رشحه إلى أنصاف أذنيه ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet said (regarding the Verse), \"A Day when all mankind will stand before the Lord of the Worlds,' (that day) they will stand, drowned in their sweat up to the middle of their ears.\"",
      "usc_msa_ref": "538",
      "chain": [
        "20312",
        "20347",
        "11071",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-6813",
      "hadith_no": "6813",
      "source": "Sahih Bukhari",
      "chapter": "Laws of Inheritance (Al-Faraa'id) - كتاب الفرائض",
      "chapter_no": "85",
      "text_ar": "حدثنا إسماعيل بن أبان، أخبرنا ابن المبارك، عن يونس، عن الزهري، عن عروة، عن عائشة، أن النبي صلى الله عليه وسلم قال ‏\"‏ لا نورث ما تركنا صدقة ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet said, \"Our (Apostles') property should not be inherited, and whatever we leave, is to be spent in charity.\"",
      "usc_msa_ref": "719",
      "chain": [
        "20312",
        "20025",
        "20475",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1077",
      "hadith_no": "1077",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا القاسم بن دينار الكوفي، حدثنا إسماعيل بن أبان الوراق، عن يحيى بن يعلى الأسلمي، عن أبي فروة، يزيد بن سنان عن زيد، وهو ابن أبي أنيسة عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم كبر على جنازة فرفع يديه في أول تكبيرة ووضع اليمنى على اليسرى ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ واختلف أهل العلم في هذا فرأى أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أن يرفع الرجل يديه في كل تكبيرة على الجنازة ‏.‏ وهو قول ابن المبارك والشافعي وأحمد وإسحاق ‏.‏ وقال بعض أهل العلم لا يرفع يديه إلا في أول مرة ‏.‏ وهو قول الثوري وأهل الكوفة ‏.‏ وذكر عن ابن المبارك أنه قال في الصلاة على الجنازة لا يقبض يمينه على شماله ‏.‏ ورأى بعض أهل العلم أن يقبض بيمينه على شماله كما يفعل في الصلاة ‏.‏ قال أبو عيسى يقبض أحب إلى ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"The Messenger of Allah said, 'Allahu Akbar' over the deceased, so he raised his hands with the first Takbir, and he placed his right (hand) over his left.\"",
      "usc_msa_ref": "",
      "chain": [
        "20312",
        "15",
        "11013",
        "11002",
        "13"
      ]
    }
  ],
  "total_hadiths": 7
}