{
  "id": "20315",
  "name": "al-Husain bin 'Ali bin al-Walid al-Ja'fi الحسين بن علي بن الوليد الجعفي",
  "full_name": "al-Husain bin 'Ali bin al-Walid al-Ja'fi الحسين بن علي بن الوليد الجعفي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "203",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Recitation/Quran"
    ],
    "tags": [
      "al-Ja'fi",
      "Client",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "15088",
      "name": "al-Hasan bin al-Hr bin al-Hakam الحسن بن الحر بن الحكم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20660",
      "name": "'Abdul Majeed bin 'Abdul 'Aziz عبد المجيد بن عبد العزيز بن أبي رواد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20583",
      "name": "Hamza bin Habib al-Zayat حمزة بن حبيب الزيات",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11576",
      "name": "Isra'il bin Musa Abu Musa إسرائيل بن موسى أبو موسى",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20200",
      "name": "Fadayl bin 'Iyyad bin Mas'ud فضيل بن عياض بن مسعود",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20646",
      "name": "Ja'far bin Brqan جعفر بن برقان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30216",
      "name": "Abu Karayb, Muhammad bin al-'Ala' محمد بن العلاء - أبو كريب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30524",
      "name": "Harun bin 'Abdullah al-Hamal هارون بن عبد الله بن مروان الحمال",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30375",
      "name": "Muhammad bin Rafa'i محمد بن رافع",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30506",
      "name": "Shja' bin Mkhld al-Flas شجاع بن مخلد الفلاس أبو الفضل البغوي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30480",
      "name": "Hanad bin al-Sari bin Mus'ab هناد بن السري بن مصعب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30421",
      "name": "Muhammad bin Yahya bin Abi 'Umar محمد بن يحيى بن أبي عمر العدني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30585",
      "name": "'Abbas bin Muhammad bin Hatm عباس بن محمد بن حاتم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30553",
      "name": "'Abd bin Hameed bin Nasr عبد بن حميد بن نصر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38044",
      "name": "Ahmed bin al-Frat bin Khalid أحمد بن الفرات بن خالد",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-3331",
      "hadith_no": "3331",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا أبو كريب، وموسى بن حزام، قالا حدثنا حسين بن علي، عن زائدة، عن ميسرة الأشجعي، عن أبي حازم، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ استوصوا بالنساء، فإن المرأة خلقت من ضلع، وإن أعوج شىء في الضلع أعلاه، فإن ذهبت تقيمه كسرته، وإن تركته لم يزل أعوج، فاستوصوا بالنساء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah 's Apostle said, \"Treat women nicely, for a women is created from a rib, and the most curved portion of the rib is its upper portion, so, if you should try to straighten it, it will break, but if you leave it as it is, it will remain crooked. So treat women nicely.\"",
      "usc_msa_ref": "548",
      "chain": [
        "30216",
        "30394",
        "20315",
        "20320",
        "11658",
        "11349",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3672",
      "hadith_no": "3672",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا يحيى بن آدم، حدثنا حسين الجعفي، عن أبي موسى، عن الحسن، عن أبي بكرة  رضى الله عنه  أخرج النبي صلى الله عليه وسلم ذات يوم الحسن فصعد به على المنبر، فقال ‏\"‏ ابني هذا سيد، ولعل الله أن يصلح به بين فئتين من المسلمين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     Once the Prophet brought out Al-Hasan and took him up the pulpit along with him and said, \"This son of mine is a Saiyid (i.e. chief) and I hope that Allah will help him bring about reconciliation between two Muslim groups.\"",
      "usc_msa_ref": "823",
      "chain": [
        "30351",
        "20364",
        "20315",
        "30170",
        "11016",
        "3229"
      ]
    },
    {
      "id": "sahih-bukhari-5240",
      "hadith_no": "5240",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا إسحاق بن نصر، حدثنا حسين الجعفي، عن زائدة، عن ميسرة، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من كان يؤمن بالله واليوم الآخر فلا يؤذي جاره ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever believes in Allah and the Last Day should not hurt (trouble) his neighbor. And I advise you to take care of the women, for they are created from a rib and the most crooked portion of the rib is its upper part; if you try to straighten it, it will break, and if you leave it, it will remain crooked, so I urge you to take care of the women.\"",
      "usc_msa_ref": "114",
      "chain": [
        "30311",
        "20315",
        "20320",
        "11658",
        "11349",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-7239",
      "hadith_no": "7239",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا حسين الجعفي، قال زائدة ذكره عن هشام، عن الحسن، قال أتينا معقل بن يسار نعوده فدخل عبيد الله فقال له معقل أحدثك حديثا سمعته من رسول الله صلى الله عليه وسلم فقال ‏\"‏ ما من وال يلي رعية من المسلمين، فيموت وهو غاش لهم، إلا حرم الله عليه الجنة ‏\"‏‏.‏",
      "text_en": " Narrated Ma'qil:                     Allah's Apostle said, \"If any ruler having the authority to rule Muslim subjects dies while he is deceiving them, Allah will forbid Paradise for him.\"",
      "usc_msa_ref": "265",
      "chain": [
        "30313",
        "20315",
        "11065",
        "11016"
      ]
    },
    {
      "id": "sahih-bukhari-7526",
      "hadith_no": "7526",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عبدة بن عبد الله، حدثنا حسين الجعفي، عن زائدة، حدثنا بيان بن بشر، عن قيس بن أبي حازم، حدثنا جرير، قال خرج علينا رسول الله صلى الله عليه وسلم ليلة البدر فقال ‏\"‏ إنكم سترون ربكم يوم القيامة كما ترون هذا، لا تضامون في رؤيته ‏\"‏‏.‏",
      "text_en": " Narrated Jarir:                     Allah's Apostle came out to us on the night of the full moon and said, \"You will see your Lord on the Day of Resurrection as you see this (full moon) and you will have no difficulty in seeing Him.\"",
      "usc_msa_ref": "531",
      "chain": [
        "30149",
        "20315",
        "20320",
        "11326",
        "11046",
        "4057"
      ]
    },
    {
      "id": "sahih-muslim-348",
      "hadith_no": "348",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني زهير بن حرب، حدثنا وكيع، حدثنا مسعر، وهشام، ح وحدثني إسحاق بن منصور، أخبرنا الحسين بن علي، عن زائدة، عن شيبان، جميعا عن قتادة، بهذا الإسناد مثله ‏.‏",
      "text_en": " The same hadith has been narrated by Zuhair b. Harb, Waki, Ishaq b. Mansur, Husain b. 'Ali.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20032",
        "20359",
        "11065",
        "30313",
        "20315",
        "20320"
      ]
    },
    {
      "id": "sahih-muslim-369",
      "hadith_no": "369",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثناه إسحاق بن إبراهيم، أخبرنا جرير، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، كلاهما عن المختار، عن أنس، عن النبي صلى الله عليه وسلم بهذا الحديث غير أن إسحاق لم يذكر قال ‏\"‏ قال الله إن أمتك ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated by another chain of transmitters with the exception that Ishaq made no mention of this:                      Allah said: Verily your people.",
      "usc_msa_ref": "",
      "chain": [
        "20028",
        "30201",
        "20315",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-382",
      "hadith_no": "382",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني القاسم بن زكرياء، حدثنا حسين، - يعني الجعفي - عن زائدة، عن هشام، قال قال الحسن كنا عند معقل بن يسار نعوده فجاء عبيد الله بن زياد فقال له معقل إني سأحدثك حديثا سمعته من رسول الله صلى الله عليه وسلم ثم ذكر بمعنى حديثهما ‏.‏",
      "text_en": " Hasan reported:                      We were with Ma'qil b. Yasar inquiring about his health that Ubaidullah b. Ziyad came there. Ma'qil said to him: Verily I am going to narrate to you a hadith which I heard from the Messenger of Allah (may peace be upon him). Then he narrated the hadith like those two (mentioned above).",
      "usc_msa_ref": "",
      "chain": [
        "20315",
        "20320",
        "11065"
      ]
    },
    {
      "id": "sahih-muslim-415",
      "hadith_no": "415",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن عبد الله بن ذكوان، عن عبد الرحمن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم ح",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11197",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-506",
      "hadith_no": "506",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن المختار بن فلفل، قال قال أنس بن مالك قال النبي صلى الله عليه وسلم ‏\"‏ أنا أول شفيع في الجنة لم يصدق نبي من الأنبياء ما صدقت وإن من الأنبياء نبيا ما يصدقه من أمته إلا رجل واحد ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik said:                      The Apostle of Allah (may peace be upon him) said: I would be the first intercessor in the Paradise and no apostle amongst the apostles has been testified (by such a large number of people) as I have been testified. And verily there woald be an apostle among the apostles who would be testified to by only one man from his people.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20315",
        "20320",
        "10962",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-224-3",
      "hadith_no": "224",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، قال أبو بكر ووكيع عن إسرائيل، كلهم عن سماك بن حرب، بهذا الإسناد عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this is narrated from the Apostle (may peace be upon him) with the same chain of transmitters by Muhammad b. Muthanna, Ibn Bashshar, Muhammad b. Ja'far, Shu'ba.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "30201",
        "20315",
        "20320",
        "20311",
        "10770",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-297-6",
      "hadith_no": "297",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن منصور، عن إبراهيم، عن الأسود، عن عائشة، قالت كنت أغسل رأس رسول الله صلى الله عليه وسلم وأنا حائض ‏.‏",
      "text_en": " Al-Aswad narrated it from 'A'isha that she observed:                      I used to wash the head of the Messenger of Allah (may peace be upon him), while I was in a state of menstruation.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-347-3",
      "hadith_no": "347",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا عبد الوارث بن عبد الصمد، حدثني أبي، عن جدي، عن الحسين، قال يحيى وأخبرني أبو سلمة، أن عروة بن الزبير، أخبره أن أبا أيوب أخبره أنه، سمع ذلك، من رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Ayyub reported that he had heard like this from the Messenger of Allah (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "20315",
        "20031",
        "10567",
        "10511",
        "33"
      ]
    },
    {
      "id": "sahih-muslim-402-4",
      "hadith_no": "402",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد بن حميد، حدثنا حسين الجعفي، عن زائدة، عن منصور، بهذا الإسناد مثل حديثهما وذكر في الحديث ‏\"‏ ثم ليتخير بعد من المسألة ما شاء أو ما أحب ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Mansur with the same chain of transmitters and he made a mention of this:                     \" Then he may choose any supplication which pleases him or which he likes.\"",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20315",
        "20320"
      ]
    },
    {
      "id": "sahih-muslim-420-2",
      "hadith_no": "420",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن عبد الملك بن عمير، عن أبي بردة، عن أبي موسى، قال مرض رسول الله صلى الله عليه وسلم فاشتد مرضه فقال ‏\"‏ مروا أبا بكر فليصل بالناس ‏\"‏ ‏.‏ فقالت عائشة يا رسول الله إن أبا بكر رجل رقيق متى يقم مقامك لا يستطع أن يصلي بالناس فقال ‏\"‏ مري أبا بكر فليصل بالناس فإنكن صواحب يوسف ‏\"‏ ‏.‏ قال فصلى بهم أبو بكر حياة رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Musa reported:                      When the Messenger of Allah (may peace be upon him) became ill and illness became serious he ordered Abu Bakr to lead the people in prayer. Upon this 'A'isha said: Messenger of Allah, Abd Bakr is a man of tenderly feelings: when he would stand in your place (he would be so much overwhelmed -by grief that) he would not be able to lead the people in prayer. He (the Holy Prophet) said: You order Abu Bakr to lead the people in prayer, and added: You are like the female companions of Yusuf. So Abu Bakr led the prayer (during this period of illness) in the life of the Messenger of Allah (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11368",
        "11901",
        "41"
      ]
    },
    {
      "id": "sahih-muslim-458-2",
      "hadith_no": "458",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، حدثنا سماك بن حرب، عن جابر بن سمرة، قال إن النبي صلى الله عليه وسلم كان يقرأ في الفجر ب ‏{‏ ق والقرآن المجيد‏}‏ وكان صلاته بعد تخفيفا ‏.‏",
      "text_en": " Jabir b. Samura reported:                      The Apostle of Allah (may peace be upon him) used to recite in the morning prayer\" Qaf. By the Glorious Quran.\" and his prayer afterward shortened.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20315",
        "20320",
        "10770",
        "393"
      ]
    },
    {
      "id": "sahih-muslim-503-4",
      "hadith_no": "503",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني إسحاق بن منصور، وعبد بن حميد، قالا أخبرنا جعفر بن عون، أخبرنا أبو عميس، ح قال وحدثني القاسم بن زكرياء، حدثنا حسين بن علي، عن زائدة، قال حدثنا مالك بن مغول، كلاهما عن عون بن أبي جحيفة، عن أبيه، عن النبي صلى الله عليه وسلم بنحو حديث سفيان وعمر بن أبي زائدة يزيد بعضهم على بعض وفي حديث مالك بن مغول فلما كان بالهاجرة خرج بلال فنادى بالصلاة ‏.‏",
      "text_en": " 'Aun b. Abu Juhaifa narrated from the Apostle of Allah (may peace be upon him) on the authority of his father a hadith like that of Sufyan, and 'Umar b. Abu Za'ida made this addition:                      Some of them tried to excel the others (in obtaining water), and in the hadith transmitted by Malik b. Mighwal (the words are): When it was noon, Bilal came out and summoned (people) to (noon) prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "30553",
        "20416",
        "20315",
        "20320",
        "20358",
        "11383",
        "4047"
      ]
    },
    {
      "id": "sahih-muslim-1315",
      "hadith_no": "1315",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني القاسم بن زكرياء، حدثنا حسين بن علي الجعفي، عن زائدة، عن سليمان، عن إبراهيم، عن علقمة، عن عبد الله، قال صلينا مع رسول الله صلى الله عليه وسلم فإما زاد أو نقص - قال إبراهيم وايم الله ما جاء ذاك إلا من قبلي - قال فقلنا يا رسول الله أحدث في الصلاة شىء فقال ‏\"‏ لا ‏\"‏ ‏.‏ قال فقلنا له الذي صنع فقال ‏\"‏ إذا زاد الرجل أو نقص فليسجد سجدتين ‏\"‏ ‏.‏ قال ثم سجد سجدتين ‏.‏",
      "text_en": " Abdullah reported:                      We prayed along with the Messenger of Allah (may peace he upon him) and he committed or omitted (something). Ibrahim said: By Allah, this is a misgiving of mine only. We said: Messenger of Allah, is there something new about the prayer? He (the Holy Prophet) said: No. We told him about what he had done. He (the Holy Prophet) said: When a man commits or omits (something in prayer), he should perform two prostrations, and he then himself performed two prostrations.",
      "usc_msa_ref": "",
      "chain": [
        "20315",
        "20320",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-1688",
      "hadith_no": "1688",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، قال حدثني عمرو بن يحيى الأنصاري، حدثني محمد بن يحيى بن حبان، عن عمرو بن سليم بن خلدة الأنصاري، عن أبي قتادة، صاحب رسول الله صلى الله عليه وسلم قال دخلت المسجد ورسول الله صلى الله عليه وسلم جالس بين ظهرانى الناس - قال - فجلست فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما منعك أن تركع ركعتين قبل أن تجلس ‏\"‏ ‏.‏ قال فقلت يا رسول الله رأيتك جالسا والناس جلوس ‏.‏ قال ‏\"‏ فإذا دخل أحدكم المسجد فلا يجلس حتى يركع ركعتين ‏\"‏ ‏.‏",
      "text_en": " Abu Qatada, a Companion of the Messenger of Allah (may peace be upon him), said:                      I entered the mosque, when the Messenger of Allah (may peace be upon him) had been sitting among people, and I also sat down among them. Upon this the Messenger of Allah (may peace be upon him) said: What prevented you from offering two rak'ahs (of Nafl prayer) before sitting down? I said: Messenger of Allah, I saw you sitting and people sitting (around you and I, therefore, sat in your company). He (the Holy Prophet) then said: When anyone among you enters the mosque, he should not sit till he has observed two rak'ahs.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11210",
        "11222",
        "1544"
      ]
    },
    {
      "id": "sahih-muslim-1854",
      "hadith_no": "1854",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا ليث، عن عقيل، عن الزهري، عن علي بن حسين، أن الحسين بن علي، حدثه عن علي بن أبي طالب، أن النبي صلى الله عليه وسلم طرقه وفاطمة فقال ‏\"‏ ألا تصلون ‏\"‏ ‏.‏ فقلت يا رسول الله إنما أنفسنا بيد الله فإذا شاء أن يبعثنا بعثنا ‏.‏ فانصرف رسول الله صلى الله عليه وسلم حين قلت له ذلك ثم سمعته وهو مدبر يضرب فخذه ويقول ‏\"‏ وكان الإنسان أكثر شىء جدلا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira transmitted it from the Apostle of Allah (may peace be upon him):                      When any one of you goes to sleep, the devil ties three knots at the back of his neck, sealing every knot with:\" You have a long night, so sleep.\" So if one awakes and mentions Allah, a knot will be loosened; if he performs ablution two knots are loosened; and if he prays (all) knots will be loosened, and in the morning he will be active and in good spirits; otherwise we will be in bad spirits and sluggish in the morning.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11207",
        "11013",
        "11045",
        "20315",
        "5"
      ]
    },
    {
      "id": "sahih-muslim-1949",
      "hadith_no": "1949",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا عبد بن حميد، حدثنا حسين بن علي الجعفي، عن زائدة، عن منصور، عن شقيق، قال جاء رجل من بني بجيلة يقال له نهيك بن سنان إلى عبد الله فقال إني أقرأ المفصل في ركعة ‏.‏ فقال عبد الله هذا كهذ الشعر لقد علمت النظائر التي كان رسول الله صلى الله عليه وسلم يقرأ بهن سورتين في ركعة ‏.‏",
      "text_en": " Abu Wa'il reported:                      A person came to 'Abdullah b. Mas'ud and said: I recited all the mufassal surahs in one rak'ah during the night. 'Abdullah said: You must have recited hastily like the recitation of poetry. 'Abdullah said: I remember well the manner in which the Messenger of Allah (may peace be upon him) used to combine them, and he then mentioned twenty of the mufassal surahs, and (their combinations in) two in every rak'ah.",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20315",
        "20320",
        "11067",
        "11353"
      ]
    },
    {
      "id": "sahih-muslim-2538",
      "hadith_no": "2538",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن سماك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، ح . وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت عبد، الرحمن بن القاسم قال سمعت القاسم، يحدث عن عائشة، عن النبي صلى الله عليه وسلم بمثل ذلك ‏.‏",
      "text_en": " This hadith has been narrated on the authority of A'isha through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20315",
        "20320",
        "10770",
        "10530",
        "10535",
        "53",
        "30170",
        "20173",
        "20020",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-2740",
      "hadith_no": "2740",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني أبو كريب، حدثنا حسين، - يعني الجعفي - عن زائدة، عن هشام، عن ابن سيرين، عن أبي هريرة، - رضى الله عنه - عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تختصوا ليلة الجمعة بقيام من بين الليالي ولا تخصوا يوم الجمعة بصيام من بين الأيام إلا أن يكون في صوم يصومه أحدكم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) as saying:                      Do not single out the night (preceding) Friday among the nights for prayer and do not single out Friday among days for fasting but only when anyone among you is accustomed to fast (on dates) which coincide with this day (Friday).",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20315",
        "20320",
        "11065",
        "11035",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-2750",
      "hadith_no": "2750",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني أحمد بن عمر الوكيعي، حدثنا حسين بن علي، عن زائدة، عن سليمان، عن مسلم البطين، عن سعيد بن جبير، عن ابن عباس، - رضى الله عنهما - قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله إن أمي ماتت وعليها صوم شهر أفأقضيه عنها فقال ‏\"‏ لو كان على أمك دين أكنت قاضيه عنها ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فدين الله أحق أن يقضى ‏\"‏ ‏.‏ قال سليمان فقال الحكم وسلمة بن كهيل جميعا ونحن جلوس حين حدث مسلم بهذا الحديث فقالا سمعنا مجاهدا يذكر هذا عن ابن عباس‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with them) reported:                      A man came to the Apostle of Allah (may peace be upon him) and said: Messenger of Allah, my mother has died (in a state) that she had to observe fasts of a month (of Ramadan). Should I complete (them) on her behalf? thereupon he (the Holy Prophet) said: Would you not pay the debt if your mother had died (without paying it)? He said: Yes. He (the Holy Prophet) said: The debt of Allah deserves more that it should he paid.",
      "usc_msa_ref": "",
      "chain": [
        "39005",
        "20315",
        "20320",
        "11060",
        "11393",
        "11050",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-2814",
      "hadith_no": "2814",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن عبد الملك، بن عمير بهذا الإسناد في ذكر الصيام عن النبي صلى الله عليه وسلم ‏.‏ بمثله ‏.‏",
      "text_en": " A hadith like this has been reported from the Apostle of Allah (may peace be upon him) by 'Abd al-Malik with the same chain of transmitters in connection with fast.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20315",
        "20320"
      ]
    },
    {
      "id": "sahih-muslim-3396",
      "hadith_no": "3396",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي الجعفي، عن زائدة، عن سليمان، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ المدينة حرم فمن أحدث فيها حدثا أو آوى محدثا فعليه لعنة الله والملائكة والناس أجمعين لا يقبل منه يوم القيامة عدل ولا صرف ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) as saying:                      Medina is a sacred territory, so he who made any innovation in it. or gave protection to an innovator, there is upon him the curse of Allah, that of the angels and that of all the people. There would not be accepted on the Day of Resurrection either obligatory acts or supererogatory acts from him.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-3554",
      "hadith_no": "3554",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثناه خلف بن هشام، حدثنا حماد بن زيد، ح وحدثنيه زهير بن حرب، حدثنا سفيان بن عيينة، ح وحدثنا إسحاق بن إبراهيم، عن الدراوردي، ح وحدثنا أبو بكر بن، أبي شيبة حدثنا حسين بن علي، عن زائدة، كلهم عن أبي حازم، عن سهل بن سعد، بهذا الحديث يزيد بعضهم على بعض غير أن في حديث زائدة قال ‏\"‏ انطلق فقد زوجتكها فعلمها من القرآن ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Sahl b. Sa'd with a minor alteration of words, but the hadith transmitted through Za'idah (the words are that the Holy Prophet) said:                      Go, I have married her to you, and you teach her something of the Qur'an.",
      "usc_msa_ref": "",
      "chain": [
        "30503",
        "20022",
        "20005",
        "30123",
        "20167",
        "30201",
        "20315",
        "11349",
        "399"
      ]
    },
    {
      "id": "sahih-muslim-3680",
      "hadith_no": "3680",
      "source": "Sahih Muslim",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثناه محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، ح وحدثنا عبيد الله بن معاذ، حدثنا أبي قالا، جميعا حدثنا شعبة، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، ح وحدثني زهير بن حرب، حدثنا عبد الرحمن بن مهدي، جميعا عن سفيان، ح وحدثنا عبد بن حميد، حدثنا حسين الجعفي، عن زائدة، كلهم عن أشعث بن أبي الشعثاء، بإسناد أبي الأحوص كمعنى حديثه غير أنهم قالوا ‏\"‏ من المجاعة ‏\".",
      "text_en": " This hadith is narrated on the authority of Abu al-Ahwas with another chain of transmitters and a slight variation of words.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20173",
        "30150",
        "20286",
        "20020",
        "30201",
        "20032",
        "30022",
        "20005",
        "30553",
        "20315"
      ]
    },
    {
      "id": "sahih-muslim-3720",
      "hadith_no": "3720",
      "source": "Sahih Muslim",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن ميسرة، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من كان يؤمن بالله واليوم الآخر فإذا شهد أمرا فليتكلم بخير أو ليسكت واستوصوا بالنساء فإن المرأة خلقت من ضلع وإن أعوج شىء في الضلع أعلاه إن ذهبت تقيمه كسرته وإن تركته لم يزل أعوج استوصوا بالنساء خيرا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) as saying:                      He who believes in Allah and the Hereafter, if he witnesses any matter he should talk in good terms about it or keep quiet. Act kindly towards woman, for woman is created from a rib, and the most crooked part of the rib is its top. If you attempt to straighten it, you will break it, and if you leave it, its crookedness will remain there. So act kindly towards women.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11658",
        "11349",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-3838",
      "hadith_no": "3838",
      "source": "Sahih Muslim",
      "chapter": "The Book of Invoking Curses - كتاب اللعان",
      "chapter_no": "20",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن عبد الملك، بن عمير بهذا الإسناد مثله ‏.‏ وقال غير مصفح ‏.‏ ولم يقل عنه ‏.‏",
      "text_en": " A hadith like this has been transmitted on the authority, of 'Abd al-Malik b. Umair with the same chain of narraters but with a slight change of words.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20315",
        "20320"
      ]
    },
    {
      "id": "sahih-muslim-3855",
      "hadith_no": "3855",
      "source": "Sahih Muslim",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن سماك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، ‏.‏ أنها اشترت بريرة من أناس من الأنصار ‏.‏ واشترطوا الولاء فقال رسول الله صلى الله عليه وسلم ‏\"‏ الولاء لمن ولي النعمة ‏\"‏ ‏.‏ وخيرها رسول الله صلى الله عليه وسلم وكان زوجها عبدا وأهدت لعائشة لحما فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو صنعتم لنا من هذا اللحم ‏\"‏ ‏.‏ قالت عائشة تصدق به على بريرة ‏.‏ فقال ‏\"‏ هو لها صدقة ولنا هدية ‏\"‏ ‏.‏",
      "text_en": " 'A'isha (Allah's be pleased with her) reported that she had bought Barira from the people of Ansar, but they laid down the condition that the right of inheritance (would vest in them), whereupon Allah's Messenger (may peace be upon him) said:                      The right of inheritance vests with one who shows favour (who emancipates) and Allah's Messenger (may peacebe upon him) gave her the choice (either to retain) her matrimonial alliance or break it). Her husband was a slave. She (Barira also) gave 'A'isha some meat as gift. Allah's Messenger (may peace be upon him) said: I wish you could prepare (cook) for us out of this meat. 'A'isha said, It has been given as charity to Barira, whereupon he said: That is charity for her and gift for us.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20315",
        "20320",
        "10770",
        "10530",
        "10535"
      ]
    },
    {
      "id": "sahih-muslim-3865",
      "hadith_no": "3865",
      "source": "Sahih Muslim",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي الجعفي، عن زائدة، عن سليمان، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من تولى قوما بغير إذن مواليه فعليه لعنة الله والملائكة والناس أجمعين لا يقبل منه يوم القيامة عدل ولا صرف ‏\"‏ ‏.‏ وحدثنيه إبراهيم بن دينار، حدثنا عبيد الله بن موسى، حدثنا شيبان، عن الأعمش، بهذا الإسناد غير أنه قال ‏\"‏ ومن والى غير مواليه بغير إذنهم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) as saying:                      He who took the freed slave as his ally without the consent of his previous master, there is upon him the curse of Allah and that of His angels and that of the whole mankind, and there will not be accepted from him his obligatory acts or supercrogatory acts on the Day of Resurrection. This hadith is narrated through the same chain of transmitters, but with a slight change of words.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-4301",
      "hadith_no": "4301",
      "source": "Sahih Muslim",
      "chapter": "The Book of Bequests - كتاب الوصية",
      "chapter_no": "26",
      "text_ar": "وحدثني القاسم بن زكرياء، حدثنا حسين بن علي، عن زائدة، عن عبد الملك، بن عمير عن مصعب بن سعد، عن أبيه، قال عادني النبي صلى الله عليه وسلم فقلت أوصي بمالي كله ‏.‏ قال ‏\"‏ لا ‏\"‏ ‏.‏ قلت فالنصف ‏.‏ قال ‏\"‏ لا ‏\"‏ ‏.‏ فقلت أبالثلث فقال ‏\"‏ نعم والثلث كثير ‏\"‏ ‏.‏",
      "text_en": " Ibn Sa'd reported his father as saying:                      Allah's Apostle (may peace be upon him) visited me during my illness. I said: I am willing away the whole of my property. He said: No. I said: Then half? He said: No. I said: Should I will away one-third? He said: Yes, and even one-third is enough.",
      "usc_msa_ref": "",
      "chain": [
        "20315",
        "20320",
        "11368",
        "10556",
        "9"
      ]
    },
    {
      "id": "sahih-muslim-4588",
      "hadith_no": "4588",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "وحدثناه يحيى بن يحيى، أخبرنا هشيم، ح وحدثنا شيبان بن فروخ، حدثنا حماد بن سلمة، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، ح وحدثنا محمد، بن المثنى حدثنا محمد بن جعفر، ح وحدثنا عبيد الله بن معاذ، حدثنا أبي كلاهما، عن شعبة، ح وحدثنا أبو كريب، حدثنا حسين بن علي، عن زائدة، كل هؤلاء عن عبد الملك، بن عمير عن عبد الرحمن بن أبي بكرة، عن أبيه، عن النبي صلى الله عليه وسلم ‏.‏ بمثل حديث أبي عوانة ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Abd al-Rahman b. Abu Bakra through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20468",
        "20656",
        "20021",
        "30201",
        "20032",
        "20012",
        "30170",
        "20173",
        "30150",
        "20020",
        "30216",
        "20315"
      ]
    },
    {
      "id": "sahih-muslim-5207",
      "hadith_no": "5207",
      "source": "Sahih Muslim",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثنيه القاسم بن زكرياء، حدثنا حسين بن علي، عن زائدة، عن سعيد بن مسروق، بهذا الإسناد الحديث إلى آخره بتمامه وقال فيه وليست معنا مدى أفنذبح بالقصب",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20315",
        "20320",
        "20016"
      ]
    },
    {
      "id": "sahih-muslim-6629",
      "hadith_no": "6629",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، وعبد الله بن عمر بن أبان، كلهم عن حسين، - قال أبو بكر حدثنا حسين بن علي الجعفي، - عن مجمع بن يحيى، عن سعيد بن أبي بردة، عن أبي بردة، عن أبيه، قال صلينا المغرب مع رسول الله صلى الله عليه وسلم ثم قلنا لو جلسنا حتى نصلي معه العشاء - قال - فجلسنا فخرج علينا فقال ‏\"‏ ما زلتم ها هنا ‏\"‏ ‏.‏ قلنا يا رسول الله صلينا معك المغرب ثم قلنا نجلس حتى نصلي معك العشاء قال ‏\"‏ أحسنتم أو أصبتم ‏\"‏ ‏.‏ قال فرفع رأسه إلى السماء وكان كثيرا مما يرفع رأسه إلى السماء فقال ‏\"‏ النجوم أمنة للسماء فإذا ذهبت النجوم أتى السماء ما توعد وأنا أمنة لأصحابي فإذا ذهبت أتى أصحابي ما يوعدون وأصحابي أمنة لأمتي فإذا ذهب أصحابي أتى أمتي ما يوعدون ‏\"‏ ‏.‏",
      "text_en": " Abu Burda reported on the authority of his father:                      We offered the sunset prayer along with Allah's Apostle (may peace be upon him). We then said: If we sit (along with Allah's Messenger) and observe night prayer with him it would be very good, so we sat down and he came to us and said: You are still sitting here. I said: Allah's Messenger, we observed evening prayer with you, then we said: Let us sit down and observe night prayer along with you, whereupon he said: You have done well or you have done right. He then lifted his head towards the sky and it often happened that as he lifted his head towards the sky, he said: The stars are a source of security for the sky and when the stars disappear there comes to the sky, i. e. (it meets the same fate) as it has been promised (it would plunge into darkness). And I am a source of safety and security to my Companions and when I would go away there would fall to the lot (of my Companions) as they have been promised with and my Companions are a source of security for the Umma and as they would go there would fall to the lot of my Umma as (its people) have been promised.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30123",
        "11278",
        "20436",
        "20315",
        "10821",
        "11345",
        "11901",
        "41"
      ]
    },
    {
      "id": "sahih-muslim-6641",
      "hadith_no": "6641",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وشجاع بن مخلد، - واللفظ لأبي بكر - قالا حدثنا  حسين، - وهو ابن علي الجعفي - عن زائدة، عن السدي، عن عبد الله البهي، عن عائشة، قالت سأل رجل النبي صلى الله عليه وسلم أى الناس خير قال ‏\"‏ القرن الذي أنا فيه ثم الثاني ثم الثالث ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported that a person asked Allah's Apostle (may peace be upon him) as to who amongst the people were the best. He said:                      Of the generation to which I belong, then of the second generation (generation adjacent to my generation), then of the third generation (generation adjacent to the second generation).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30506",
        "20315",
        "20320",
        "10743",
        "10939",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-6670",
      "hadith_no": "6670",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو كريب، أخبرنا ابن بشر، عن مسعر، ح وحدثني محمد بن حاتم، حدثنا  معاوية بن عمرو، عن أبي إسحاق، ح وحدثني القاسم بن زكرياء، حدثنا حسين بن علي، الجعفي عن زائدة، كلاهما عن الأعمش، جميعا عن حبيب، بهذا الإسناد مثله ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20359",
        "38487",
        "20389",
        "11049",
        "20315"
      ]
    },
    {
      "id": "sahih-muslim-6961",
      "hadith_no": "6961",
      "source": "Sahih Muslim",
      "chapter": "The Book of Knowledge - كتاب العلم",
      "chapter_no": "48",
      "text_ar": "وحدثني القاسم بن زكرياء، حدثنا حسين الجعفي، عن زائدة، عن سليمان، عن  شقيق، قال كنت جالسا مع عبد الله وأبي موسى وهما يتحدثان فقالا قال رسول الله صلى الله عليه وسلم بمثل حديث وكيع وابن نمير ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Abdullah (b. Mas'ud) and Abu Musa (al-Asha'ri) through other chains of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "20315",
        "20320",
        "11060",
        "11353"
      ]
    },
    {
      "id": "sahih-muslim-7084",
      "hadith_no": "7084",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن الحسن بن، عبيد الله عن إبراهيم بن سويد، عن عبد الرحمن بن يزيد، عن عبد الله، قال كان رسول الله صلى الله عليه وسلم إذا أمسى قال ‏\"‏ أمسينا وأمسى الملك لله والحمد لله لا إله إلا الله وحده لا شريك له اللهم إني أسألك من خير هذه الليلة وخير ما فيها وأعوذ بك من شرها وشر ما فيها اللهم إني أعوذ بك من الكسل والهرم وسوء الكبر وفتنة الدنيا وعذاب القبر ‏\"‏ ‏.‏ قال الحسن بن عبيد الله وزادني فيه زبيد عن إبراهيم بن سويد عن عبد الرحمن بن يزيد عن عبد الله رفعه أنه قال ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير ‏\"‏ ‏.‏",
      "text_en": " Abdullah reported that when it was evening Allah's Messenger (may peace be upon him) used to supplicate:                     \" We have entered upon evening and so has the Kingdom of Allah entere d upon evening; praise is due to Allah, there is no god but Allah the One, and there is no partner with Him. O Allah, I beg of Thee the blessing of this night and the blessing of that which lies in it. I seek refuge in Thee from the evil of it and what lies in it. O Allah, I seek refuge in Thee from sloth, from decrepitude, from the evil of vanity, from trial of the world, and from torment of the grave.\" Zubaid, through another chain of transmitters, has narrated on the authority of Abdullah directly this addition:\" There is no god but Allah, the One, there is no partner with Him, His is the Sovereignty and to Him is praise due and He is Potent over everything.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20315",
        "20320",
        "10755",
        "10887",
        "20395",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-112",
      "hadith_no": "112",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا الحسن بن علي الحلواني، حدثنا الحسين بن علي الجعفي، عن زائدة، حدثنا خالد بن علقمة الهمداني، عن عبد خير، قال صلى علي رضى الله عنه الغداة ثم دخل الرحبة فدعا بماء فأتاه الغلام بإناء فيه ماء وطست - قال - فأخذ الإناء بيده اليمنى فأفرغ على يده اليسرى وغسل كفيه ثلاثا ثم أدخل يده اليمنى في الإناء فتمضمض ثلاثا واستنشق ثلاثا ‏.‏ ثم ساق قريبا من حديث أبي عوانة قال ثم مسح رأسه مقدمه ومؤخره مرة ‏.‏ ثم ساق الحديث نحوه ‏.‏",
      "text_en": " ‘Abd Khair said :                      ‘All offered the dawn prayer and went to Rahbah (a locality in Kufah). He called for water. A boy brought him a vessel containing water and a wash-basin. He held the vessel with his right hand and poured water over his left hand. He washed both of his hands (to the wrist) three times. He then put his right hand in the vessel ( to take water) and rinsed his mouth three times and snuffed up water three times. He then narrated almost the same tradition as narrated by Abu ‘Awanah. He then wiped his head, both its front and back sides, once. He then narrated the tradition in like manner.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20315",
        "20320",
        "18243",
        "19874",
        "5"
      ]
    },
    {
      "id": "sunan-abi-daud-375",
      "hadith_no": "375",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مسدد بن مسرهد، والربيع بن نافع أبو توبة، - المعنى - قالا حدثنا أبو الأحوص، عن سماك، عن قابوس، عن لبابة بنت الحارث، قالت كان الحسين بن علي - رضى الله عنه - في حجر رسول الله صلى الله عليه وسلم فبال عليه فقلت البس ثوبا وأعطني إزارك حتى أغسله قال ‏\"‏ إنما يغسل من بول الأنثى وينضح من بول الذكر ‏\"‏ ‏.‏",
      "text_en": " Narrated Lubabah daughter of al-Harith:                     Al-Husayn ibn Ali was (sitting) in the lap of the Messenger of Allah (ﷺ). He passed water on him. I said: Put on (another) clothe, and give me your wrapper to wash. He said: The urine of a female child should be washed (thoroughly) and the urine of a male child should be sprinkled over.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "30335",
        "20327",
        "10770",
        "15453",
        "17635",
        "20315"
      ]
    },
    {
      "id": "sunan-abi-daud-455",
      "hadith_no": "455",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا حسين بن علي، عن زائدة، عن هشام بن عروة، عن أبيه، عن عائشة، قالت أمر رسول الله صلى الله عليه وسلم ببناء المساجد في الدور وأن تنظف وتطيب ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) commanded us to build mosques in different localities (i.e. in the locality of each tribe separately)  and that they should be kept clean and be perfumed.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20315",
        "20320",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-792",
      "hadith_no": "792",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن سليمان، عن أبي صالح، عن بعض، أصحاب النبي صلى الله عليه وسلم قال قال النبي صلى الله عليه وسلم لرجل ‏\"‏ كيف تقول في الصلاة ‏\"‏ ‏.‏ قال أتشهد وأقول اللهم إني أسألك الجنة وأعوذ بك من النار أما إني لا أحسن دندنتك ولا دندنة معاذ ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ حولها ندندن ‏\"‏ ‏.‏",
      "text_en": " Narrated Some Companions of the Prophet:                     AbuSalih reported on the authority of some Companions of the Prophet (ﷺ): The Prophet (ﷺ) said to a person: what do you say in prayer? He replied: I first recite tashahhud (supplication recited in sitting position), and then I say: O Allah, I ask Thee for Paradise, and I seek refuge in Thee from Hell-Fire, but I do not understand your sound and the sound of Mu'adh (what you say or he says in prayer). The Prophet (ﷺ) said: We too go around it (paradise and Hell-fire).",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20315",
        "20320",
        "11060",
        "11161"
      ]
    },
    {
      "id": "sunan-abi-daud-1047",
      "hadith_no": "1047",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا حسين بن علي، عن عبد الرحمن بن يزيد بن جابر، عن أبي الأشعث الصنعاني، عن أوس بن أوس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من أفضل أيامكم يوم الجمعة فيه خلق آدم وفيه قبض وفيه النفخة وفيه الصعقة فأكثروا على من الصلاة فيه فإن صلاتكم معروضة على ‏\"‏ ‏.‏ قال قالوا يا رسول الله وكيف تعرض صلاتنا عليك وقد أرمت يقولون بليت ‏.‏ فقال ‏\"‏ إن الله عز وجل حرم على الأرض أجساد الأنبياء ‏\"‏ ‏.‏",
      "text_en": " Narrated Aws ibn Aws:                     The Prophet (ﷺ) said: Among the most excellent of your days is Friday; on it Adam was created, on it he died, on it the last trumpet will be blown, and on it the shout will be made, so invoke more blessings on me that day, for your blessings will be submitted to me.  The people asked: Messenger of Allah, how can it be that our blessings will be submitted to you while your body is decayed? He replied: Allah, the Exalted, has prohibited the earth from consuming the bodies of Prophets.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20315",
        "20395",
        "10917",
        "3214"
      ]
    },
    {
      "id": "sunan-abi-daud-1531",
      "hadith_no": "1531",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا الحسن بن علي، حدثنا الحسين بن علي الجعفي، عن عبد الرحمن بن يزيد بن جابر، عن أبي الأشعث الصنعاني، عن أوس بن أوس، قال قال النبي صلى الله عليه وسلم ‏\"‏ إن من أفضل أيامكم يوم الجمعة فأكثروا على من الصلاة فيه فإن صلاتكم معروضة على ‏\"‏ ‏.‏ قال فقالوا يا رسول الله وكيف تعرض صلاتنا عليك وقد أرمت قال يقولون بليت ‏.‏ قال ‏\"‏ إن الله تبارك وتعالى حرم على الأرض أجساد الأنبياء صلى الله عليهم ‏\"‏ ‏.‏",
      "text_en": " Aws b. Was reported the Messenger of Allah (ﷺ) as saying:                      Among the most excellent of your days in Friday ; so invoke many blessings on me on that day, for your blessing will be submitted to me. They (the Companions) asked: Messenger of Allah, how can our blessing be submitted to you, when your body is decayed ? He said: Allah has prohibited the earth from consuming the bodies of Prophets.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20315",
        "20395",
        "10917",
        "3214"
      ]
    },
    {
      "id": "sunan-abi-daud-1614",
      "hadith_no": "1614",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا الهيثم بن خالد الجهني، حدثنا حسين بن علي الجعفي، عن زائدة، حدثنا عبد العزيز بن أبي رواد، عن نافع، عن عبد الله بن عمر، قال كان الناس يخرجون صدقة الفطر على عهد رسول الله صلى الله عليه وسلم صاعا من شعير أو تمر أو سلت أو زبيب ‏.‏ قال قال عبد الله فلما كان عمر - رضى الله عنه - وكثرت الحنطة جعل عمر نصف صاع حنطة مكان صاع من تلك الأشياء ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The people during the lifetime of the Messenger of Allah (ﷺ) used to bring forth the sadaqah at the end of Ramadan when closing the fast one sa' of barley whose straw is removed, or of raisins. Abdullah said: When Umar (Allah be pleased with him) succeeded, and the wheat became abundant, Umar prescribed half a sa' of wheat instead of all these things.",
      "usc_msa_ref": "",
      "chain": [
        "35162",
        "20315",
        "20320",
        "20739",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-1665",
      "hadith_no": "1665",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، حدثنا مصعب بن محمد بن شرحبيل، حدثني يعلى بن أبي يحيى، عن فاطمة بنت حسين، عن حسين بن علي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ للسائل حق وإن جاء على فرس ‏\"‏ ‏.‏",
      "text_en": " Narrated Ali ibn Abu Talib:                     The Prophet (ﷺ) said: A beggar has the right though he may be riding (a horse).",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "13121",
        "20315"
      ]
    },
    {
      "id": "sunan-abi-daud-2234",
      "hadith_no": "2234",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا حسين بن علي، والوليد بن عقبة، عن زائدة، عن سماك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، أن بريرة، خيرها رسول الله صلى الله عليه وسلم وكان زوجها عبدا ‏.‏",
      "text_en": " A’ishah said “The Prophet (ﷺ) gave her choice. Her husband was a slave.”",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20315",
        "20320",
        "10770",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-2340",
      "hadith_no": "2340",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن بكار بن الريان، حدثنا الوليد، - يعني ابن أبي ثور ح وحدثنا الحسن بن علي، حدثنا الحسين، - يعني الجعفي - عن زائدة، - المعنى - عن سماك، عن عكرمة، عن ابن عباس، قال جاء أعرابي إلى النبي صلى الله عليه وسلم فقال إني رأيت الهلال - قال الحسن في حديثه يعني رمضان - فقال ‏\"‏ أتشهد أن لا إله إلا الله ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ أتشهد أن محمدا رسول الله ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ يا بلال أذن في الناس فليصوموا غدا ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     A bedouin came to the Prophet (ﷺ) and said: I have sighted the moon. Al-Hasan added in his version: that is, of Ramadan. He asked: Do you testify that there is no god but Allah? He replied: Yes. He again asked: Do you testify that Muhammad is the Messenger of Allah? He replied: Yes. and he testified that he had sighted the moon. He said: Bilal, announce to the people that they must fast tomorrow.",
      "usc_msa_ref": "",
      "chain": [
        "30512",
        "27362",
        "30",
        "20315",
        "10770",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-2981",
      "hadith_no": "2981",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا حسين بن علي العجلي، حدثنا وكيع، عن الحسن بن صالح، عن السدي، في ذي القربى قال هم بنو عبد المطلب ‏.‏",
      "text_en": " Explaining the relatives of the Prophet (ﷺ) al-Saddi said:                      They are Banu 'Abd al-Muttalib.",
      "usc_msa_ref": "",
      "chain": [
        "20315",
        "20032",
        "20647"
      ]
    },
    {
      "id": "sunan-abi-daud-2986",
      "hadith_no": "2986",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا عنبسة بن خالد، حدثنا يونس، عن ابن شهاب، أخبرني علي بن حسين، أن حسين بن علي، أخبره أن علي بن أبي طالب قال كانت لي شارف من نصيبي من المغنم يوم بدر وكان رسول الله صلى الله عليه وسلم أعطاني شارفا من الخمس يومئذ فلما أردت أن أبني بفاطمة بنت رسول الله صلى الله عليه وسلم واعدت رجلا صواغا من بني قينقاع أن يرتحل معي فنأتي بإذخر أردت أن أبيعه من الصواغين فأستعين به في وليمة عرسي فبينا أنا أجمع لشارفى متاعا من الأقتاب والغرائر والحبال - وشارفاى مناخان إلى جنب حجرة رجل من الأنصار - أقبلت حين جمعت ما جمعت فإذا بشارفى قد اجتبت أسنمتهما وبقرت خواصرهما وأخذ من أكبادهما فلم أملك عينى حين رأيت ذلك المنظر فقلت من فعل هذا قالوا فعله حمزة بن عبد المطلب وهو في هذا البيت في شرب من الأنصار غنته قينة وأصحابه فقالت في غنائها ألا يا حمز للشرف النواء فوثب إلى السيف فاجتب أسنمتهما وبقر خواصرهما وأخذ من أكبادهما ‏.‏ قال علي فانطلقت حتى أدخل على رسول الله صلى الله عليه وسلم وعنده زيد بن حارثة قال فعرف رسول الله صلى الله عليه وسلم الذي لقيت فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما لك ‏\"‏ ‏.‏ قال قلت يا رسول الله ما رأيت كاليوم عدا حمزة على ناقتى فاجتب أسنمتهما وبقر خواصرهما وها هو ذا في بيت معه شرب فدعا رسول الله صلى الله عليه وسلم بردائه فارتداه ثم انطلق يمشي واتبعته أنا وزيد بن حارثة حتى جاء البيت الذي فيه حمزة فاستأذن فأذن له فإذا هم شرب فطفق رسول الله صلى الله عليه وسلم يلوم حمزة فيما فعل فإذا حمزة ثمل محمرة عيناه فنظر حمزة إلى رسول الله صلى الله عليه وسلم ثم صعد النظر فنظر إلى ركبتيه ثم صعد النظر فنظر إلى سرته ثم صعد النظر فنظر إلى وجهه ثم قال حمزة وهل أنتم إلا عبيد لأبي فعرف رسول الله صلى الله عليه وسلم أنه ثمل فنكص رسول الله صلى الله عليه وسلم على عقبيه القهقرى فخرج وخرجنا معه ‏.‏",
      "text_en": " ‘Ali bin Abi Talib said “I had an old she Camel that I got as my share from the booty on the day of Badr. The Apostle of Allaah(ﷺ) also gave me an old she camel from the fifth that day. When I intended to cohabit with Fathimah daughter of the Apostle of Allaah(ﷺ), I made arrangement with a man who was a goldsmith belonging to Banu Qainuqa’ to go with me so that we may bring grass. I intended to sell it to the goldsmith there by seeking help in my wedding feast. While I was collecting for my old Camels saddles, baskets and ropes both of she Camels were seated in a corner of the apartment of a man of the Ansar. When I collected what I collected (i.e., equipment) I turned (towards them). I suddenly found that the humps of she Camels were cut off and their hips were pierced and their lives were taken out. I could not control my eyes (to weep) when I saw that scene. I said “Who has done this?” They (the people) replied “Hamzah bin ‘Abd Al Muttalib”. He is among the drunkards of the Ansar in this house. A singing girl is singing for him and his Companions. While singing she said “Oh Hamza, rise to these plumpy old she Camels. So he jumped to the sword and cut off their humps, pierced their hips and took out their livers.” ‘Ali said “I went till I entered upon the Apostle of Allaah(ﷺ) while Zaid bin Harithah was with him.” The Apostle of Allaah(ﷺ) realized what I had met with. The Apostle of Allaah(ﷺ) aid “What is the matter with you?” I said Apostle of Allaah(ﷺ), I never saw the thing that happened with me today. Hamzah wronged my she Camels, he cut off their humps, pierced their hips. Lo! He is in a house with drunkards. The Apostle of Allaah(ﷺ) asked for his cloak. It was brought to him. He then went out, I and Zaid bin Harithah followed him until we reached the house where Hamzah was. He asked permission ( to entre). He was permitted. He found drunkards there. The Apostle of Allaah(ﷺ) began to rebuke him (Hamzah) for his action. Hamzah was intoxicated and his eyes were reddish. Hamzah looked at the Apostle of Allaah(ﷺ). He then raised his eyes and looked at his knees, he then raised his eyes and looked at his navel and he then raised his eyes and looked at his face. Hamzah then said “Are you but the salves of my father? Then the Apostle of Allaah(ﷺ) knew that he was intoxicated. So the Apostle of Allaah(ﷺ) moved backward. He then went out and we also went out with him.”",
      "usc_msa_ref": "",
      "chain": [
        "30226",
        "20451",
        "20475",
        "11013",
        "11045",
        "20315",
        "5"
      ]
    },
    {
      "id": "sunan-abi-daud-3011",
      "hadith_no": "3011",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا حسين بن علي بن الأسود، أن يحيى بن آدم، حدثهم عن أبي شهاب، عن يحيى بن سعيد، عن بشير بن يسار، أنه سمع نفرا، من أصحاب النبي صلى الله عليه وسلم قالوا فذكر هذا الحديث قال فكان النصف سهام المسلمين وسهم رسول الله صلى الله عليه وسلم وعزل النصف للمسلمين لما ينوبه من الأمور والنوائب ‏.‏",
      "text_en": " Bashir bin Yasar said that he heard a number of the Companions of the Prophet (ﷺ) say. He then narrated the tradition (mentioned above). He said “One half comprised the portions of the Muslims and the portion of the Apostle of Allaah(ﷺ). He separated the other half for the Muslims for any calamity that befalls him and for emergent needs.”",
      "usc_msa_ref": "",
      "chain": [
        "20315",
        "20364",
        "11062",
        "11810"
      ]
    },
    {
      "id": "sunan-abi-daud-3012",
      "hadith_no": "3012",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا حسين بن علي، حدثنا محمد بن فضيل، عن يحيى بن سعيد، عن بشير بن يسار، مولى الأنصار عن رجال، من أصحاب النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم لما ظهر على خيبر قسمها على ستة وثلاثين سهما جمع كل سهم مائة سهم فكان لرسول الله صلى الله عليه وسلم وللمسلمين النصف من ذلك وعزل النصف الباقي لمن نزل به من الوفود والأمور ونوائب الناس ‏.‏",
      "text_en": " Narrated A Group of Companions of the Prophet:                     Bashir ibn Yasar, the client of the Ansar, reported on the authority of a group of the Companions of the Prophet (ﷺ): When the Messenger of Allah (ﷺ) conquered Khaybar, he divided it into thirty-six lots, each lot comprising one hundred portions. One half of it was for the Messenger of Allah (ﷺ) and for the Muslims; and he separated the remaining half for the deputations which came to him, other matters and emergent needs of the people.",
      "usc_msa_ref": "",
      "chain": [
        "20315",
        "20356",
        "11062",
        "11810"
      ]
    },
    {
      "id": "sunan-abi-daud-3016",
      "hadith_no": "3016",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا حسين بن علي العجلي، حدثنا يحيى، - يعني ابن آدم - حدثنا ابن أبي زائدة، عن محمد بن إسحاق، عن الزهري، وعبد الله بن أبي بكر، وبعض، ولد محمد بن مسلمة قالوا بقيت بقية من أهل خيبر تحصنوا فسألوا رسول الله صلى الله عليه وسلم أن يحقن دماءهم ويسيرهم ففعل فسمع بذلك أهل فدك فنزلوا على مثل ذلك فكانت لرسول الله صلى الله عليه وسلم خاصة لأنه لم يوجف عليها بخيل ولا ركاب ‏.‏",
      "text_en": " Narrated Abdullah ibn AbuBakr:                     Abdullah ibn AbuBakr and some children of Muhammad ibn Maslamah said: There remained some people of Khaybar and they confined themselves to the fortresses. They asked the Messenger of Allah (ﷺ) to protect their lives and let them go. He did so. The people of Fadak heard this; they also adopted a similar way. (Fadak) was, therefore, exclusively reserved for the Messenger of Allah (ﷺ), for it was not captured by the expedition of cavalry and camelry.",
      "usc_msa_ref": "",
      "chain": [
        "20315",
        "20364",
        "20366",
        "11107",
        "11013",
        "11104"
      ]
    },
    {
      "id": "sunan-abi-daud-3069",
      "hadith_no": "3069",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا حسين بن علي، حدثنا يحيى، - يعني ابن آدم - حدثنا أبو بكر بن عياش، عن هشام بن عروة، عن أبيه، عن أسماء بنت أبي بكر، أن رسول الله صلى الله عليه وسلم أقطع الزبير نخلا ‏.‏",
      "text_en": " Narrated Asma' daughter of AbuBakr:                     The Messenger of Allah (ﷺ) assigned to az-Zubayr palm-trees as a fief.",
      "usc_msa_ref": "",
      "chain": [
        "20315",
        "20364",
        "20373",
        "11065",
        "10511",
        "70"
      ]
    },
    {
      "id": "sunan-abi-daud-4032",
      "hadith_no": "4032",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا يزيد بن خالد بن يزيد بن عبد الله بن موهب الرملي، وحسين بن علي، قالا حدثنا ابن أبي زائدة، عن أبيه، عن مصعب بن شيبة، عن صفية بنت شيبة، عن عائشة، رضى الله عنها قالت خرج رسول الله صلى الله عليه وسلم وعليه مرط مرحل من شعر أسود ‏.‏ وقال حسين حدثنا يحيى بن زكريا ‏.‏ - حدثنا إبراهيم بن العلاء الزبيدي حدثنا إسماعيل بن عياش عن عقيل بن مدرك عن لقمان بن عامر عن عتبة بن عبد السلمي قال استكسيت رسول الله صلى الله عليه وسلم فكساني خيشتين فلقد رأيتني وأنا أكسى أصحابي ‏.‏",
      "text_en": " 'Aishah said:                      The Messenger of Allah (ﷺ) went out one morning wearing a variegated garment of black goat hair.Narrated Utbah ibn AbdusSulami:I asked the Messenger of Allah (ﷺ) to clothe me. He clothed me with two coarse clothes of linen.",
      "usc_msa_ref": "",
      "chain": [
        "38715",
        "20315",
        "20366",
        "11338",
        "10658",
        "2802",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-4094",
      "hadith_no": "4094",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا هناد بن السري، حدثنا حسين الجعفي، عن عبد العزيز بن أبي رواد، عن سالم بن عبد الله، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ الإسبال في الإزار والقميص والعمامة من جر منها شيئا خيلاء لم ينظر الله إليه يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ) said: Hanging down is in lower garment, shirt and turban. If anyone trails any of them conceitedly, Allah will not look at him on the Day of Resurrection.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20315",
        "20739",
        "11011",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-114",
      "hadith_no": "114",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عمرو السواق البلخي، حدثنا هشيم، عن يزيد بن أبي زياد، ح قال وحدثنا محمود بن غيلان، حدثنا حسين الجعفي، عن زائدة، عن يزيد بن أبي زياد، عن عبد الرحمن بن أبي ليلى، عن علي، قال سألت النبي صلى الله عليه وسلم عن المذى فقال ‏\"‏ من المذى الوضوء ومن المني الغسل ‏\"‏ ‏.‏ قال وفي الباب عن المقداد بن الأسود وأبى بن كعب ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روي عن علي بن أبي طالب عن النبي صلى الله عليه وسلم من غير وجه ‏\"‏ من المذى الوضوء ومن المني الغسل ‏\"‏ ‏.‏ وهو قول عامة أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين ومن بعدهم وبه يقول سفيان والشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Ali narrated:                     \"I asked the Prophet about Al-Madhi. He said: \"For Al-Madhi is Wudu, and for AI-Mani is Ghusl.\"",
      "usc_msa_ref": "",
      "chain": [
        "11220",
        "20468",
        "10844",
        "30277",
        "20315",
        "20320",
        "10844",
        "11196",
        "5"
      ]
    },
    {
      "id": "jami-al-tirmidhi-150",
      "hadith_no": "150",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "أخبرني أحمد بن محمد بن موسى، أخبرنا عبد الله بن المبارك، أخبرنا حسين بن علي بن حسين، أخبرني وهب بن كيسان، عن جابر بن عبد الله، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ أمني جبريل ‏\"‏ ‏.‏ فذكر نحو حديث ابن عباس بمعناه ‏.‏ ولم يذكر فيه ‏\"‏ لوقت العصر بالأمس ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ وحديث ابن عباس حديث حسن صحيح ‏.‏ وقال محمد أصح شيء في المواقيت حديث جابر عن النبي صلى الله عليه وسلم ‏.‏ قال وحديث جابر في المواقيت قد رواه عطاء بن أبي رباح وعمرو بن دينار وأبو الزبير عن جابر بن عبد الله عن النبي صلى الله عليه وسلم نحو حديث وهب بن كيسان عن جابر عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Jabir bin Abdullah narrated that :                     Allah's Messenger said: \"Jibril let me (in Salat)\". He mentioned something similar to the Hadith of Ibn Abbas (no. 149) in meaning, but he did not mention: \"At the time of Asr the day before.\"",
      "usc_msa_ref": "",
      "chain": [
        "30304",
        "20025",
        "20315",
        "11231",
        "34"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1196",
      "hadith_no": "1196",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Suckling - كتاب الرضاع",
      "chapter_no": "12",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا الحسين بن علي الجعفي، عن زائدة، عن شبيب بن غرقدة، عن سليمان بن عمرو بن الأحوص، قال حدثني أبي أنه، شهد حجة الوداع مع رسول الله صلى الله عليه وسلم فحمد الله وأثنى عليه وذكر ووعظ فذكر في الحديث قصة فقال ‏\"‏ ألا واستوصوا بالنساء خيرا فإنما هن عوان عندكم ليس تملكون منهن شيئا غير ذلك إلا أن يأتين بفاحشة مبينة فإن فعلن فاهجروهن في المضاجع واضربوهن ضربا غير مبرح فإن أطعنكم فلا تبغوا عليهن سبيلا ألا إن لكم على نسائكم حقا ولنسائكم عليكم حقا فأما حقكم على نسائكم ألا يوطئن فرشكم من تكرهون ولا يأذن في بيوتكم لمن تكرهون ألا وحقهن عليكم أن تحسنوا إليهن في كسوتهن وطعامهن ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ ومعنى قوله ‏\"‏ عوان عندكم ‏\"‏ ‏.‏ يعني أسرى في أيديكم ‏.‏",
      "text_en": " Sulaiman bin Amr bin Al-Ahwas said:                      “My father narrated to me that he witnessed the farewell Hajj with the Messenger of Allah. So he thanked and praised Allah and he reminded and gave admonition. He mentioned a story in his narration and he (the Prophet) said: “And indeed I order you to be good to the women, for they are but captives with you over whom you have no power than that, except if they come with manifest Fahishah (evil behavior). If they do that, then abandon their beds and beat them with a beating that is not harmful. And if they obey you then you have no cause against them. Indeed you have rights over your women, and your women have rights over you. As for your rights over your women, then they must not allow anyone whom you dislike to treat on your bedding (furniture), nor to admit anyone in your home that you dislike. And their rights over you are that you treat them well in clothing them and feeding them.”",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20315",
        "20320",
        "11430",
        "19868"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1331",
      "hadith_no": "1331",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا هناد، حدثنا حسين الجعفي، عن زائدة، عن سماك بن حرب، عن حنش، عن علي، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ إذا تقاضى إليك رجلان فلا تقض للأول حتى تسمع كلام الآخر فسوف تدري كيف تقضي ‏\"‏ ‏.‏ قال علي فما زلت قاضيا بعد ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " 'Ali narrated:                      \"The Messenger of Allah (ﷺ) said to me: 'When two men come to you seeking judgement, do not judge for the first until you have heard the statement of the other. Soon you will know how to judge.'\" 'Ali said: \"I did not err since then.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20315",
        "20320",
        "10770",
        "15113",
        "5"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1625",
      "hadith_no": "1625",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا أبو كريب، حدثنا الحسين بن علي الجعفي، عن زائدة، عن الركين بن الربيع، عن أبيه، عن يسير بن عميلة، عن خريم بن فاتك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أنفق نفقة في سبيل الله كتبت له بسبعمائة ضعف ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي هريرة ‏.‏ وهذا حديث حسن إنما نعرفه من حديث الركين بن الربيع ‏.‏",
      "text_en": " Narrated Khuraim bin Fatik:                     That the Messenger of Allah (ﷺ) said: \"Whoever spends a sum in the cause of Allah, it is recorded for him seven-hundred fold.\"[Abu 'Eisa said:] There are something on this topic from Abu Hurairah.This Hadith is Hasan, we only know of it from the narration of Ar-Rukain bin Ar-Rabi' (a narrator in the chain of this Hadith)",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20315",
        "20320",
        "10763",
        "10761",
        "4127"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1795",
      "hadith_no": "1795",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو كريب، حدثنا حسين بن علي الجعفي، عن زائدة، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم حرم يوم خيبر كل ذي ناب من السباع والمجثمة والحمار الإنسي ‏.‏ قال وفي الباب عن علي وجابر والبراء وابن أبي أوفى وأنس والعرباض بن سارية وأبي ثعلبة وابن عمر وأبي سعيد ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وروى عبد العزيز بن محمد وغيره عن محمد بن عمرو هذا الحديث وإنما ذكروا حرفا واحدا نهى رسول الله صلى الله عليه وسلم عن كل ذي ناب من السباع ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"On the day of Khaibar, the Messenger of Allah (ﷺ) prohibited every predator possessing canines, and the Mujath-thamah, and the domestic donkey.\"He said: There are narrations on this topic from 'Ali, Jabir, Al-Bara', Ibn Abi Awfa, Anas, Al-'Irbad bin Sariyah, Abu Tha'labah, Ibn 'Umar and Abu Sa'eed.[Abu 'Eisa said:] This Hadith is Hasan Sahih.'Abdul-'Aziz bin Muhammad and others reported this Hadith from Muhammad bin 'Amr, and they only mentioned one phrase: \"The Messenger of Allah (ﷺ) prohibited every predator possessing canines.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20315",
        "20320",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1833",
      "hadith_no": "1833",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا الحسين بن علي بن الأسود البغدادي، حدثنا عمرو بن محمد العنقزي، حدثنا إسرائيل، عن صالح بن رستم أبي عامر الخزاز، عن أبي عمران الجوني، عن عبد الله بن الصامت، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يحقرن أحدكم شيئا من المعروف وإن لم يجد فليلق أخاه بوجه طليق وإن اشتريت لحما أو طبخت قدرا فأكثر مرقته واغرف لجارك منه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد رواه شعبة عن أبي عمران الجوني ‏.‏",
      "text_en": " Narrated Abu Dharr:                     That the Messenger of Allah (ﷺ) said: \"Let one of you not consider any good to be insignificant. If he has nothing, then let him meet his brother with a smiling face. If you buy some meat or cook something in a pot, then increase its broth, and serve some of it to you neighbor.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih. Shu'bah reported it from Abu 'Imran Al-Jawni.",
      "usc_msa_ref": "",
      "chain": [
        "20315",
        "20597",
        "20311",
        "17514",
        "11296",
        "10695",
        "23"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2776",
      "hadith_no": "2776",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on the Description of Hellfire - كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "39",
      "text_ar": "حدثنا عبد بن حميد، حدثنا حسين بن علي الجعفي، عن فضيل بن عياض، عن هشام، عن الحسن، قال قال عتبة بن غزوان على منبرنا هذا منبر البصرة عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الصخرة العظيمة لتلقى من شفير جهنم فتهوي فيها سبعين عاما وما تفضي إلى قرارها ‏\"‏ ‏.‏ قال وكان عمر يقول أكثروا ذكر النار فإن حرها شديد وإن قعرها بعيد وإن مقامعها حديد ‏.‏ قال أبو عيسى لا نعرف للحسن سماعا من عتبة بن غزوان وإنما قدم عتبة بن غزوان البصرة في زمن عمر وولد الحسن لسنتين بقيتا من خلافة عمر ‏.‏",
      "text_en": " Al-Hasan said:                      \"While he was on the pulpit",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20315",
        "20200",
        "11065",
        "11016",
        "206"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3119",
      "hadith_no": "3119",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا حسين الجعفي، عن زائدة، عن حكيم بن جبير، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لكل شيء سنام وإن سنام القرآن سورة البقرة وفيها آية هي سيدة آى القرآن هي آية الكرسي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث حكيم بن جبير ‏.‏ وقد تكلم شعبة في حكيم بن جبير وضعفه ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ): \"For everything there is a hump (pinnacle) and the hump (pinnacle) of the Qur'an is Surat Al-Baqarah, in it there is an Ayah which is the master of the Ayat in the Qur'an; [it is] Ayat Al-Kursi.\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20315",
        "20320",
        "19866",
        "11161",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3153",
      "hadith_no": "3153",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا عبد بن حميد، حدثنا حسين بن علي الجعفي، قال سمعت حمزة الزيات، عن أبي المختار الطائي، عن ابن أخي الحارث الأعور، عن الحارث، قال مررت في المسجد فإذا الناس يخوضون في الأحاديث فدخلت على علي فقلت يا أمير المؤمنين ألا ترى أن الناس قد خاضوا في الأحاديث ‏.‏ قال وقد فعلوها قلت نعم ‏.‏ قال أما إني قد سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ألا إنها ستكون فتنة ‏\"‏ ‏.‏ فقلت ما المخرج منها يا رسول الله قال ‏\"‏ كتاب الله فيه نبأ ما كان قبلكم وخبر ما بعدكم وحكم ما بينكم هو الفصل ليس بالهزل من تركه من جبار قصمه الله ومن ابتغى الهدى في غيره أضله الله وهو حبل الله المتين وهو الذكر الحكيم وهو الصراط المستقيم هو الذي لا تزيغ به الأهواء ولا تلتبس به الألسنة ولا يشبع منه العلماء ولا يخلق على كثرة الرد ولا تنقضي عجائبه هو الذي لم تنته الجن إذ سمعته حتى قالوا ‏(‏إنا سمعنا قرآنا عجبا * يهدي إلى الرشد ‏)‏ من قال به صدق ومن عمل به أجر ومن حكم به عدل ومن دعا إليه هدي إلى صراط مستقيم ‏\"‏ ‏.‏ خذها إليك يا أعور ‏.‏ قال أبو عيسى هذا حديث لا نعرفه إلا من هذا الوجه وإسناده مجهول ‏.‏ وفي الحارث مقال ‏.‏",
      "text_en": " Narrated Al-Harith Al-A'war:                     \"I passed by the Masjid when the people were absorbed in story-telling. So I entered upon 'Ali and said: 'O Commander of the believers! Do you not see the people are becoming engrossed in story-telling?' He said: 'They have been consumed with it?' I said: \"Yes.' He said: 'As for me, I heard the Messenger of Allah (ﷺ) saying: \"Indeed there comes a Fitnah\" So I said: \"What is the way out from it O Messenger of Allah?\" He said: \"Allah's book. In it is news for what happened before you, and information about what comes after you, and judgement for what happens between you. It is the Criterion (between right and wrong) without jest. Whoever among the oppressive abandons it, Allah crushes him, and whoever seeks guidance from other than it, then Allah leaves him to stray. It is the firm rope of Allah, it is the wise remembrance, it is the straight path, and it is the one that the desires can not distort, nor can the tongues twist it, nor can the scholars ever have enough of it, and it shall not become dull from reciting it much, and the amazement of it does not diminish. It is the one that when the Jinns hear it, they did not hesitate to say about it: 'Verily, we have heard a wonderful Recitation (this Qur'an)! 'It guides to the Right Path, and we have believed therein.' Whoever speaks according to it then he has said the truth, and whoever acts according to it he is rewarded, and whoever judges by it he has judged justly, and whoever invites to it then he guides to the straight path.\" Take this O A'war!'.\"",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20315",
        "20583",
        "15694"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3367",
      "hadith_no": "3367",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا حسين بن علي الجعفي، عن زائدة، عن شبيب بن غرقدة، عن سليمان بن عمرو بن الأحوص، حدثنا أبي أنه، شهد حجة الوداع مع رسول الله صلى الله عليه وسلم فحمد الله وأثنى عليه وذكر ووعظ ثم قال ‏\"‏ أى يوم أحرم أى يوم أحرم أى يوم أحرم ‏\"‏ ‏.‏ قال فقال الناس يوم الحج الأكبر يا رسول الله ‏.‏ قال ‏\"‏ فإن دماءكم وأموالكم وأعراضكم عليكم حرام كحرمة يومكم هذا في بلدكم هذا في شهركم هذا ألا لا يجني جان إلا على نفسه ولا يجني والد على ولده ولا ولد على والده ألا إن المسلم أخو المسلم فليس يحل لمسلم من أخيه شيء إلا ما أحل من نفسه ألا وإن كل ربا في الجاهلية موضوع لكم رءوس أموالكم لا تظلمون ولا تظلمون غير ربا العباس بن عبد المطلب فإنه موضوع كله ألا وإن كل دم كان في الجاهلية موضوع وأول دم أضع من دماء الجاهلية دم الحارث بن عبد المطلب كان مسترضعا في بني ليث فقتلته هذيل ألا واستوصوا بالنساء خيرا فإنما هن عوان عندكم ليس تملكون منهن شيئا غير ذلك إلا أن يأتين بفاحشة مبينة فإن فعلن فاهجروهن في المضاجع واضربوهن ضربا غير مبرح فإن أطعنكم فلا تبغوا عليهن سبيلا ألا إن لكم على نسائكم حقا ولنسائكم عليكم حقا فأما حقكم على نسائكم فلا يوطئن فرشكم من تكرهون ولا يأذن في بيوتكم من تكرهون ألا وإن حقهن عليكم أن تحسنوا إليهن في كسوتهن وطعامهن ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد رواه أبو الأحوص عن شبيب بن غرقدة ‏.‏",
      "text_en": " Narrated Sulaiman bin 'Amr bin Al-Ahwas:                     \"My father narrated to me that he attended the Farewell Hajj with the Messenger of Allah (ﷺ). He (ﷺ) expressed his gratitude to Allah and praised Him, and reminded and exhorted, then he said: 'Which day is most sacred? Which day is most sacred? Which day is most sacred?' He said: \"So the people said: 'The day of Al-Hajj Al-Akbar O Messenger of Allah!' So he said: 'Indeed, your blood, your wealth, your honor, is as sacred for you as the sacredness of this day of yours, in this city of yours, in this month of yours. Behold! None commits a crime but against himself, none offends a father for a son, nor a son for a father. Behold! Indeed the Muslim is the brother of the Muslim, so it is not lawful for the Muslim to do anything to his brother, which is not lawful to be done to himself. Behold! All Riba from Jahiliyyah is invalid, for you is the principle of your wealth, but your are not to wrong nor be wronged - except in the case of Riba of Al-'Abbas bin 'Abdul-Muttalib - otherwise it is all invalid. Behold! All retribution regarding cases of blood during Jahiliyyah are invalid. The first case of blood retribution invalidated among those of Jahiliyyah, is the blood of Al-Harith bin 'Abdul-Muttalib who was nursed among Banu Laith and killed by Hudhail. Behold! I order you to treat women well, for they are but like captives with you, you have no sovereignty beyond this over them, unless they manifest lewdness. If they do that, then abandon their beds, and beat them with a beating that is not painful. Then if they obey you, then there is no cause for you against them beyond that. Behold! There are rights for you upon your women, and rights for your women upon you. As for your rights upon them,then they are not to allow anyone on your bedding whom you dislike, nor to permit anyone whom you dislike in your homes. Behold! Indeed their rights upon you are that you treat them well in clothing them and feeding them.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20315",
        "20320",
        "11430",
        "19868"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3401",
      "hadith_no": "3401",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا حسين الجعفي، عن زائدة، عن عبد الملك بن عمير، عن عبد الرحمن بن أبي ليلى، عن معاذ بن جبل، قال أتى النبي صلى الله عليه وسلم رجل فقال يا رسول الله أرأيت رجلا لقي امرأة وليس بينهما معرفة فليس يأتي الرجل شيئا إلى امرأته إلا قد أتى هو إليها إلا أنه لم يجامعها ‏.‏ قال فأنزل الله ‏:‏ ‏(‏ أقم الصلاة طرفى النهار وزلفا من الليل إن الحسنات يذهبن السيئات ذلك ذكرى للذاكرين ‏)‏ فأمره أن يتوضأ ويصلي ‏.‏ قال معاذ فقلت يا رسول الله أهي له خاصة أم للمؤمنين عامة قال ‏\"‏ بل للمؤمنين عامة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث ليس إسناده بمتصل عبد الرحمن بن أبي ليلى لم يسمع من معاذ ومعاذ بن جبل مات في خلافة عمر وقتل عمر وعبد الرحمن بن أبي ليلى غلام صغير ابن ست سنين وقد روى عن عمر ورآه ‏.‏ وروى شعبة هذا الحديث عن عبد الملك بن عمير عن عبد الرحمن بن أبي ليلى عن النبي صلى الله عليه وسلم مرسل ‏.‏",
      "text_en": " Narrated Mu'adh bin Jabal:                     \"A man came to the Prophet (ﷺ) and said: 'O Messenger of Allah! What do you say about a man who meets a woman and there is no acquaintance between them. So there is nothing that a man who would do with his wife but he does it with her, except that he does not have intercourse with her?'\" He said: \"So Allah revealed: And perform the Salat, at the two ends of the day and in some hours of the night. Verily, the good deeds remove the evil deeds. That is a reminder for the mindful (11:114). So he ordered him to perform Wudu and Salat.\" Then Mu'adh said: \"I said: 'O Messenger of Allah! Is that specifically for him, or for the believers in general?' He said: 'Rather it is for the believers in general.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20315",
        "20320",
        "11368",
        "11196",
        "32"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3546-2",
      "hadith_no": "3546",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا يحيى بن موسى، وزياد بن أيوب، قالا حدثنا أبو عامر العقدي، عن سليمان بن بلال، عن عمارة بن غزية، عن عبد الله بن علي بن حسين بن علي بن أبي طالب، عن أبيه، عن حسين بن علي بن أبي طالب، عن علي بن أبي طالب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ البخيل الذي من ذكرت عنده فلم يصل على ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Ali bin Abi Talib narrated that the Messenger of Allah said:                     “The stingy person is the one before whom I am mentioned, and he does not send Salat upon me.”",
      "usc_msa_ref": "",
      "chain": [
        "30221",
        "30249",
        "20443",
        "20160",
        "11894",
        "6405",
        "20315",
        "5"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3589-2",
      "hadith_no": "3589",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا حسين بن علي بن الأسود البغدادي، حدثنا محمد بن فضيل، عن عبد الرحمن بن إسحاق، عن حفصة بنت أبي كثير، عن أبيها أبي كثير، عن أم سلمة، قالت علمني رسول الله صلى الله عليه وسلم قال ‏\"‏ قولي اللهم هذا استقبال ليلك وإدبار نهارك وأصوات دعاتك وحضور صلواتك أسألك أن تغفر لي ‏\"‏ ‏.‏ قال هذا حديث غريب إنما نعرفه من هذا الوجه ‏.‏ وحفصة بنت أبي كثير لا نعرفها ولا أباها ‏.‏",
      "text_en": " Umm Salamah said:                     “The Messenger of Allah taught me, saying: ‘Say: “O Allah, this is the coming of Your night, and the departing of Your day, the voices of those calling to You, and the time of prayers to You, I ask You to forgive me (Allahumma Hadhastiqbalu Lailika, Wastidbaru Naharika, Wa Aswatu Du’atika Wa Huduru Salawatika, As’aluka An Taghfira Li).”",
      "usc_msa_ref": "",
      "chain": [
        "20315",
        "20356",
        "11876",
        "19467",
        "56"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3590-2",
      "hadith_no": "3590",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا الحسين بن علي بن يزيد الصدائي البغدادي، حدثنا الوليد بن القاسم بن الوليد الهمداني، عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما قال عبد لا إله إلا الله قط مخلصا إلا فتحت له أبواب السماء حتى تفضي إلى العرش ما اجتنب الكبائر ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Abu Hurairah [may Allah be pleased with him] narrated that the Messenger of Allah sai:                     “No worshipper has ever said: None has the right to be worshipped but Allah (La Ilaha Illallah)’ sincerely, except that the gates of heaven are opened for it, until it reaches to the Throne, so long as he avoids the major sins.”",
      "usc_msa_ref": "",
      "chain": [
        "20315",
        "25341",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-91",
      "hadith_no": "91",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا موسى بن عبد الرحمن، قال حدثنا حسين بن علي، عن زائدة، قال حدثنا خالد بن علقمة، عن عبد خير، عن علي، أنه دعا بوضوء فتمضمض واستنشق ونثر بيده اليسرى ففعل هذا ثلاثا ثم قال هذا طهور نبي الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that 'Ali called for (water for) Wudu', then he rinsed his mouth and nose, and he sniffed up water and blew it out using his left hand. He did that three times, then he said:                      \"This is how the Prophet of Allah (ﷺ) purified himself.\"",
      "usc_msa_ref": "",
      "chain": [
        "20315",
        "20320",
        "19874",
        "5"
      ]
    },
    {
      "id": "sunan-an-nasai-95",
      "hadith_no": "95",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا إبراهيم بن الحسن المقسمي، قال أنبأنا حجاج، قال قال ابن جريج حدثني شيبة، أن محمد بن علي، أخبره قال أخبرني أبي علي، أن الحسين بن علي، قال دعاني أبي علي بوضوء فقربته له فبدأ فغسل كفيه ثلاث مرات قبل أن يدخلهما في وضوئه ثم مضمض ثلاثا واستنثر ثلاثا ثم غسل وجهه ثلاث مرات ثم غسل يده اليمنى إلى المرفق ثلاثا ثم اليسرى كذلك ثم مسح برأسه مسحة واحدة ثم غسل رجله اليمنى إلى الكعبين ثلاثا ثم اليسرى كذلك ثم قام قائما فقال ناولني فناولته الإناء الذي فيه فضل وضوئه فشرب من فضل وضوئه قائما فعجبت فلما رآني قال لا تعجب فإني رأيت أباك النبي صلى الله عليه وسلم يصنع مثل ما رأيتني صنعت يقول لوضوئه هذا وشرب فضل وضوئه قائما ‏.‏",
      "text_en": " Al-Husain bin 'Ali said:                      \"My father 'Ali called me to bring (water for) Wudu', so I brought it to him, and he started by washing his hands three times, before putting them into the water. Then he rinsed his mouth three times and sniffed water into his nose and blew it out three times. Then he washed his face three times, then his right hand up to the elbow three times, then his left likewise. Then he wiped his head once then he washed his right foot up to the ankle three times, then the left likewise. Then he stood up and said: 'Pass me the vessel.' So I passed the vessel containing the remaining water for his Wudu' to him, and he drank from it standing up. I was surprised and when he noticed that he said: 'Do not be surprised, for  I saw your father the Prophet (ﷺ) doing,' referring to his Wudu' and drinking the leftover water while standing.\"",
      "usc_msa_ref": "",
      "chain": [
        "38070",
        "20219",
        "11070",
        "11442",
        "20315"
      ]
    },
    {
      "id": "sunan-an-nasai-531",
      "hadith_no": "531",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله بن المبارك، عن حسين بن علي بن حسين، قال أخبرني وهب بن كيسان، قال حدثنا جابر بن عبد الله، قال جاء جبريل عليه السلام إلى النبي صلى الله عليه وسلم حين زالت الشمس فقال قم يا محمد فصل الظهر حين مالت الشمس ثم مكث حتى إذا كان فىء الرجل مثله جاءه للعصر فقال قم يا محمد فصل العصر ‏.‏ ثم مكث حتى إذا غابت الشمس جاءه فقال قم فصل المغرب فقام فصلاها حين غابت الشمس سواء ثم مكث حتى إذا ذهب الشفق جاءه فقال قم فصل العشاء ‏.‏ فقام فصلاها ثم جاءه حين سطع الفجر في الصبح فقال قم يا محمد فصل ‏.‏ فقام فصلى الصبح ثم جاءه من الغد حين كان فىء الرجل مثله فقال قم يا محمد فصل ‏.‏ فصلى الظهر ثم جاءه جبريل عليه السلام حين كان فىء الرجل مثليه فقال قم يا محمد فصل ‏.‏ فصلى العصر ثم جاءه للمغرب حين غابت الشمس وقتا واحدا لم يزل عنه فقال قم فصل ‏.‏ فصلى المغرب ثم جاءه للعشاء حين ذهب ثلث الليل الأول فقال قم فصل ‏.‏ فصلى العشاء ثم جاءه للصبح حين أسفر جدا فقال قم فصل ‏.‏ فصلى الصبح فقال ‏\"‏ ما بين هذين وقت كله ‏\"‏ ‏.‏",
      "text_en": " Jabir bin 'Abdullah said:                      \"Jibril, peace be upon him, came to the Prophet (ﷺ) when the sun had passed its zenith and said: 'Get up, O Muhammad, and pray Zuhr when the sun has passed its zenith.' Then he waited until a man's shadow was equal to his height. Then he came to him for 'Asr and said: 'Get up, O Muhammad, and pray 'Asr.' Then he waited until the sunset, then he came to him and said: 'Get up, O Muhammad, and pray Maghrib.' So he got up and prayed it when the sun had set. Then he waited until the twilight disappeared, then he came to him and said: 'Get up, O Muhammad, and pray 'Isha'.' So he got up and prayed it. Then he came to him when dawn broke and said: 'Get up, O Muhammad, and pray.' So he got up and prayed Subh.' So he got up and prayed Subh. Then he came to him the next day when a man's shadow was equal to his height, and said: 'Get up, O Muhammad, and pray.' So he prayed Zuhr. Then Jibril came to him when a man's shadow was equal to twice his length and said: 'Get up, O Muhammad, and pray.' So he prayed 'Asr. Then he came to him for Maghrib when the sun set, at exactly the same time as the day before, and said: 'Get up, O Muhammad, and pray.' So he prayed Maghrib. Then he came to him for 'Isha' when the first third of the night had passed, and said: 'Get up and pray.' So he prayed 'Isha'. Then he came to him for Subh when it had become very bright, and said: 'Get up and pray.' So he prayed Subh. Then he said: 'The times of prayer one between those two (limits).'\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20315",
        "11231",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-670",
      "hadith_no": "670",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا القاسم بن زكريا بن دينار، قال حدثنا حسين بن علي، عن زائدة، قال حدثنا سعيد بن أبي عروبة، قال حدثنا هشام، أن أبا الزبير المكي، حدثهم عن نافع بن جبير، أن أبا عبيدة بن عبد الله بن مسعود، حدثهم أن عبد الله بن مسعود قال كنا في غزوة فحبسنا المشركون عن صلاة الظهر والعصر والمغرب والعشاء فلما انصرف المشركون أمر رسول الله صلى الله عليه وسلم مناديا فأقام لصلاة الظهر فصلينا وأقام لصلاة العصر فصلينا وأقام لصلاة المغرب فصلينا وأقام لصلاة العشاء فصلينا ثم طاف علينا فقال ‏\"‏ ما على الأرض عصابة يذكرون الله عز وجل غيركم ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin Mas'ud said:                      \"We were fighting a battle and the idolators kept us from praying Zuhr, 'Asr, Maghrib and 'Isha'. When the idolators went away, the Messenger of Allah commanded a caller to say Iqamah for Zuhr prayer, and we prayed. Then he said the Iqamah for 'Asr, and we prayed, and he said the Iqamah for Maghrib and we prayed, and he said the Iqamah for 'Isha' and we prayed. Then we went around among us and said: 'There is no group on Earth who is remembering Allah, the Mighty and Sublime, except you.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30475",
        "20315",
        "20320",
        "11073",
        "11065",
        "11263",
        "11059",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-777",
      "hadith_no": "777",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، وهناد بن السري، عن حسين بن علي، عن زائدة، عن عاصم، عن زر، عن عبد الله، قال لما قبض رسول الله صلى الله عليه وسلم قالت الأنصار منا أمير ومنكم أمير ‏.‏ فأتاهم عمر فقال ألستم تعلمون أن رسول الله صلى الله عليه وسلم قد أمر أبا بكر أن يصلي بالناس فأيكم تطيب نفسه أن يتقدم أبا بكر قالوا نعوذ بالله أن نتقدم أبا بكر ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                      \"When the Messenger of Allah(ﷺ) passed away, the Ansar said: 'Let there be an Amir from among us and an Amir from among you.' Then 'Umar came to them and said: 'Do you not know that the Messenger of Allah(ﷺ) commanded Abu Bakr to lead the people in prayer? Who mong you could accept to put himself ahead of Abu Bakr?' They said: 'We seek refuge with Allah from putting ourselves ahead of Abu Bakr.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "30480",
        "20315",
        "20320",
        "11080",
        "11337",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-789",
      "hadith_no": "789",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا موسى بن عبد الرحمن المسروقي، حدثنا حسين بن علي، عن زائدة، عن سفيان، عن أيوب، قال حدثني عمرو بن سلمة الجرمي، قال كان يمر علينا الركبان فنتعلم منهم القرآن فأتى أبي النبي صلى الله عليه وسلم فقال ‏\"‏ ليؤمكم أكثركم قرآنا ‏\"‏ ‏.‏ فجاء أبي فقال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليؤمكم أكثركم قرآنا ‏\"‏ ‏.‏ فنظروا فكنت أكثرهم قرآنا فكنت أؤمهم وأنا ابن ثمان سنين ‏.‏",
      "text_en": " 'Amr bin Salamah Al-Jarmi said:                      \"Riders used to pass by us and we would leam the Qur'an from them. My father came to the Prophet (ﷺ) and he said: 'Let the one of you who knows most Qur'an leads the prayer.' My father came and said that the Messenger of Allah (ﷺ) had said: 'Let the one of you who knows most Quran lead you in prayer.' They looked and found that I was the one who knew most Qur'an, so I used to lead them in prayer when I was eight years old.'",
      "usc_msa_ref": "",
      "chain": [
        "35153",
        "20315",
        "20320",
        "20005",
        "11015",
        "5206"
      ]
    },
    {
      "id": "sunan-an-nasai-1287",
      "hadith_no": "1287",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا القاسم بن زكريا بن دينار، من كتابه قال حدثنا حسين بن علي، عن زائدة، عن سليمان، عن عمرو بن مرة، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، قال قلنا يا رسول الله السلام عليك قد عرفناه فكيف الصلاة قال ‏\"‏ قولوا اللهم صل على محمد وعلى آل محمد كما صليت على آل إبراهيم إنك حميد مجيد اللهم بارك على محمد وعلى آل محمد كما باركت على آل إبراهيم إنك حميد مجيد ‏\"‏ ‏.‏ قال ابن أبي ليلى ونحن نقول وعلينا معهم ‏.‏ قال أبو عبد الرحمن حدثنا به من كتابه وهذا خطأ ‏.‏",
      "text_en": " It was narrated that Ka'b bin 'Ujrah said:                     \"We said: 'O Messenger of Allah (ﷺ), we know about sending salams upon you, but how should we send salah upon you?' He said: \"Say: 'Alahumma salli 'ala Muhammad wa 'ala ali Muhammad, kama sallaita 'ala Ibrahima wa barik 'ala Muhammad kama barakta 'ala ali Ibrahim fil-'alamin, innaka hamidun majid (O Allah, send salah upon Muhammad and upon the family of Muhammad, as You sent salah upon the family of Ibrahim, and send blessings upon Muhammad and upon the family of Muhammad as You sent blessings upon the family of Ibrahim among the nations. You are indeed Worthy of praise, Full of glory.)'\" (One of the narrators) Ibn Abi Laila said: \"We used to say: 'And also upon us.'\" Abu Abdur-Rahman (An-Nasa'I) said: It was narrated from his book, and this is a mistake.",
      "usc_msa_ref": "",
      "chain": [
        "36617",
        "20315",
        "20320",
        "11060",
        "11381",
        "11196",
        "4052"
      ]
    },
    {
      "id": "sunan-an-nasai-Grade-11",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا إسحاق بن منصور، قال حدثنا حسين الجعفي، عن عبد الرحمن بن يزيد بن جابر، عن أبي الأشعث الصنعاني، عن أوس بن أوس، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن من أفضل أيامكم يوم الجمعة فيه خلق آدم عليه السلام وفيه قبض وفيه النفخة وفيه الصعقة فأكثروا على من الصلاة فإن صلاتكم معروضة على ‏\"‏ ‏.‏ قالوا يا رسول الله وكيف تعرض صلاتنا عليك وقد أرمت أى يقولون قد بليت ‏.‏ قال ‏\"‏ إن الله عز وجل قد حرم على الأرض أن تأكل أجساد الأنبياء عليهم السلام ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Aws bin Aws that :                     The Prophet (ﷺ) said: \"One of the best of your days is Friday. On this day, Adam was created and on this day he died, on this day the Trumpet will be blown, and on this day all creatures will swoon. So send a great deal of salah upon me on this day, for your salah will be presented to me.\" They said: \"O Messenger of Allah (ﷺ), how will our salah be presented to you when you have decomposed (after death)?\" He said: \"Allah (SWT), the Mighty and Sublime, has forbidden the earth to consume the bodies of the prophets, peace be upon them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20315",
        "20395",
        "10917",
        "3214"
      ]
    },
    {
      "id": "sunan-an-nasai-1611",
      "hadith_no": "1611",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا قتيبة، قال حدثنا الليث، عن عقيل، عن الزهري، عن علي بن حسين، أن الحسين بن علي، حدثه عن علي بن أبي طالب، أن النبي صلى الله عليه وسلم طرقه وفاطمة فقال ‏\"‏ ألا تصلون ‏\"‏ ‏.‏ قلت يا رسول الله إنما أنفسنا بيد الله فإذا شاء أن يبعثها بعثها فانصرف رسول الله صلى الله عليه وسلم حين قلت له ذلك ثم سمعته وهو مدبر يضرب فخذه ويقول ‏\"‏ ‏{‏ وكان الإنسان أكثر شىء جدلا ‏}‏ ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ali bin Abi Talib that:                     The Prophet (ﷺ) came to him and Fatimah at night and said: \"Won't you pray?\" I said: \"O Messenger of Allah (ﷺ), our souls are in the hand of Allah and if He wants to make us get up, He will make us get up.\" The Messenger of Allah (ﷺ) went away when I said that to him. Then as he was leaving I heard him striking his thigh and saying: But, man is ever more quarrelsome than anything.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "11207",
        "11013",
        "11045",
        "20315",
        "5"
      ]
    },
    {
      "id": "sunan-an-nasai-1787",
      "hadith_no": "1787",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا حسين بن علي، عن زائدة، عن سليمان، عن حبيب بن أبي ثابت، عن عبدة بن أبي لبابة، عن سويد بن غفلة، عن أبي الدرداء، يبلغ به النبي صلى الله عليه وسلم قال ‏\"‏ من أتى فراشه وهو ينوي أن يقوم يصلي من الليل فغلبته عيناه حتى أصبح كتب له ما نوى وكان نومه صدقة عليه من ربه عز وجل ‏\"‏ ‏.‏ خالفه سفيان ‏.‏",
      "text_en": " It was narrated from Abu Ad-Darda' who attributed it to the Prophet (ﷺ):                     \"Whoever goes to his bed intending to get up and pray qiyam at night, then sleep overwhelms him until morning, will have recorded that which he intended and his sleep is a charity given to him by his Lord, the Mighty and Sublime.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20315",
        "20320",
        "11060",
        "11331",
        "10793",
        "11174"
      ]
    },
    {
      "id": "sunan-an-nasai-3118",
      "hadith_no": "3118",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عبدة بن عبد الله، قال حدثنا حسين بن علي، عن زائدة، عن سفيان، عن أبي حازم، عن سهل بن سعد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الغدوة والروحة في سبيل الله عز وجل أفضل من الدنيا وما فيها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Sahl bin Sa'd said:                      \"The Messenger of Allah (ﷺ) said: 'Going out before noon or after noon, in the cause of Allah, the Mighty and Sublime, is better than this world and everything in it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30149",
        "20315",
        "20320",
        "20005",
        "11172",
        "399"
      ]
    },
    {
      "id": "sunan-an-nasai-3435",
      "hadith_no": "3435",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرني موسى بن عبد الرحمن، قال حدثنا حسين الجعفي، عن زائدة، عن شيبان، عن قتادة، عن زرارة بن أوفى، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله تعالى تجاوز لأمتي عما حدثت به أنفسها ما لم تكلم أو تعمل به ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet said:                      \"Allah, the Most High, has forgiven my Ummah for whatever enters the mind, so long as it is not spoken of or put into action.\"",
      "usc_msa_ref": "",
      "chain": [
        "20315",
        "20320",
        "20240",
        "11019",
        "11284",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-4297",
      "hadith_no": "4297",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا حسين بن علي، عن زائدة، عن سعيد بن مسروق، عن عباية بن رفاعة بن رافع، عن رافع بن خديج، قال بينما نحن مع رسول الله صلى الله عليه وسلم في ذي الحليفة من تهامة فأصابوا إبلا وغنما ورسول الله صلى الله عليه وسلم في أخريات القوم فعجل أولهم فذبحوا ونصبوا القدور فدفع إليهم رسول الله صلى الله عليه وسلم فأمر بالقدور فأكفئت ثم قسم بينهم فعدل عشرا من الشاء ببعير فبينما هم كذلك إذ ند بعير وليس في القوم إلا خيل يسيرة فطلبوه فأعياهم فرماه رجل بسهم فحبسه الله فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن لهذه البهائم أوابد كأوابد الوحش فما غلبكم منها فاصنعوا به هكذا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi bin Khadij said:                     \"While we were with the Messenger of Allah at Dhul-Hulaifah in Tihamanb, they acquired some camels and sheep (as spoils of war). The Messenger of Allah was among the last of the people, and the first of them hastened to slaughter (the animals) and set up pots (For cooking the meat). The Messenger of Allah came and ordered that the pots be came and ordered that the pots be overturned, then he divided it making ten sheep equivalent to one camel. While they were like that, a camel ran away. The people had only a few horses, so they went after fit and it and it got away from them. A man shot an arrow at it and stopped it. The Messenger of Allah said: 'Some of these animals arte untamed like wild animals, so if one of them goes out of your control, do the same.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20315",
        "20320",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sunan-an-nasai-5334",
      "hadith_no": "5334",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن رافع، قال حدثنا حسين بن علي، عن عبد العزيز بن أبي رواد، عن سالم، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الإسبال في الإزار والقميص والعمامة من جر منها شيئا خيلاء لا ينظر الله إليه يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah [SAW] said: 'Al-Isbal may apply to the Izar, the Qamis and the turban. Whoever drags any one of these out of vanity, Allah will not look at him on the Day of Resurrection.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20315",
        "20739",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-506",
      "hadith_no": "506",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا موسى بن عبد الرحمن، حدثنا الحسين بن علي، وزيد بن الحباب، ح وحدثنا محمد بن يحيى، حدثنا أبو نعيم، قالوا حدثنا عمرو بن عبد الله بن وهب أبو سليمان النخعي، قال حدثني زيد العمي، عن أنس بن مالك، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ من توضأ فأحسن الوضوء ثم قال ثلاث مرات أشهد أن لا إله إلا الله وحده لا شريك له وأشهد أن محمدا عبده ورسوله فتح له ثمانية أبواب الجنة من أيها شاء دخل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that :                     The Prophet said: \"Whoever performs ablution and does it well, then says three times: 'Ashhadu an la ilaha illallah wahdahu la sharika lahu, wa ashhadu anna Muhammadan 'abduhu wa rasuluhu (I bear witness that none has the right to be worshipped but Allah alone, with no partner, and I bear witness that Muhammed is His slave and His Messenger),' eight gates of Paradise will be opened for him; whichever one he wants he may enter.\" (Da'if)Another chain with similar wording.",
      "usc_msa_ref": "",
      "chain": [
        "20315",
        "20650",
        "11222",
        "20348",
        "14135",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-1138",
      "hadith_no": "1138",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الحسين بن علي، عن عبد الرحمن بن يزيد بن جابر، عن أبي الأشعث الصنعاني، عن شداد بن أوس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن من أفضل أيامكم يوم الجمعة فيه خلق آدم وفيه النفخة وفيه الصعقة فأكثروا على من الصلاة فيه فإن صلاتكم معروضة على ‏\"‏ ‏.‏ فقال رجل يا رسول الله كيف تعرض صلاتنا عليك وقد أرمت - يعني بليت - ‏.‏ فقال ‏\"‏ إن الله قد حرم على الأرض أن تأكل أجساد الأنبياء ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Shaddad bin Aws said:                      “The Messenger of Allah(ﷺ)said: ‘The best of your days is Friday. On it Adam was created,onit the Trumpet will be blown, on it all creatures will swoon. Sosenda great deal of peace and blessings upon me on that day, for yourpeace and blessings will be presented to me.’ A man said: ‘OMessengerof Allah, how will our peace and blessings be shown to youwhen youwill have disintegrated?’ He said: ‘Allah has forbiddenthe earth toconsume the bodies of the Prophets.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20315",
        "20395",
        "10917",
        "389"
      ]
    },
    {
      "id": "sunan-ibn-majah-1405",
      "hadith_no": "1405",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هارون بن عبد الله الحمال، حدثنا الحسين بن علي الجعفي، عن زائدة، عن سليمان الأعمش، عن حبيب بن أبي ثابت، عن عبدة بن أبي لبابة، عن سويد بن غفلة، عن أبي الدرداء، يبلغ به النبي  صلى الله عليه وسلم  قال ‏\"‏ من أتى فراشه وهو ينوي أن يقوم فيصلي من الليل فغلبته عينه حتى يصبح - كتب له ما نوى وكان نومه صدقة عليه من ربه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Darda’ conveyed that the Prophet (ﷺ) said:                     “Whoever goes to bed intending to wake up and pray during thenight,but is overwhelmed by sleep until morning comes, what heintended willbe recorded for him, and his sleep is a charity givento him by hisLord.”",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20315",
        "20320",
        "11060",
        "11331",
        "10793",
        "11174"
      ]
    },
    {
      "id": "sunan-ibn-majah-1705",
      "hadith_no": "1705",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الحسين بن علي، عن عبد الرحمن بن يزيد بن جابر، عن أبي الأشعث الصنعاني، عن أوس بن أوس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن من أفضل أيامكم يوم الجمعة فيه خلق آدم وفيه النفخة وفيه الصعقة فأكثروا على من الصلاة فيه فإن صلاتكم معروضة على ‏.‏ فقال رجل يا رسول الله كيف تعرض صلاتنا عليك وقد أرمت - يعني بليت - قال ‏\"‏ إن الله حرم على الأرض أن تأكل أجساد الأنبياء ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Aws bin Aws that the Messenger of Allah (ﷺ)said:                     ‘The best of your days is Friday. On it Adam was created; on itshall be the Nafakhah,* on it all creation will swoon. So send agreatdeal of blessing upon me on this day, for your blessing will bepresented to me.’ A man said: “O Messenger of Allah! How will ourblessing be presented to you when you have disintegrated?” He said:“Allah has forbidden the earth to consume the bodies of theProphets.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20315",
        "20395",
        "10917",
        "3214"
      ]
    },
    {
      "id": "sunan-ibn-majah-1814",
      "hadith_no": "1814",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الحسين بن علي، عن زائدة، عن عبد الملك بن عمير، عن محمد بن المنتشر، عن حميد بن عبد الرحمن الحميري، عن أبي هريرة، قال جاء رجل إلى النبي  صلى الله عليه وسلم  فقال أى الصيام أفضل بعد شهر رمضان قال ‏\"‏ شهر الله الذي تدعونه المحرم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “A man came to the Prophet(ﷺ)and said: ‘Which fasting is better after the month of Ramadan?’He said: ‘The month of Allah which is called Muharram.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11368",
        "11388",
        "11280",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1924",
      "hadith_no": "1924",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الحسين بن علي، عن زائدة، عن شبيب بن غرقدة البارقي، عن سليمان بن عمرو بن الأحوص، حدثني أبي أنه، شهد حجة الوداع مع رسول الله  صلى الله عليه وسلم  فحمد الله وأثنى عليه وذكر ووعظ ثم قال ‏\"‏ استوصوا بالنساء خيرا فإنما هن عندكم عوان ‏.‏ ليس تملكون منهن شيئا غير ذلك إلا أن يأتين بفاحشة مبينة فإن فعلن فاهجروهن في المضاجع واضربوهن ضربا غير مبرح فإن أطعنكم فلا تبغوا عليهن سبيلا إن لكم من نسائكم حقا ولنسائكم عليكم حقا فأما حقكم على نسائكم فلا يوطئن فرشكم من تكرهون ولا يأذن في بيوتكم لمن تكرهون ألا وحقهن عليكم أن تحسنوا إليهن في كسوتهن وطعامهن ‏\"‏ ‏.‏",
      "text_en": " It was narrated that:                     Sulaiman bin Amr bin Ahwas said: “My father told me that he was present on the Farewell pilgrimage with the Messenger of Allah. He praised and glorified Allah, and reminder and exhorted (the people). The he said: 'I enjoin good treatment of women, for they are prisoners with you, and you have no right to treat them otherwise, unless they commit clear indecency. If they do that, then forsake them in their beds and hit them, but without causing injury or leaving a mark if they obey you, then do not seek means of annoyance against them. You have rights over your women and you women have rights over you. Your rights over you women are that they are not to allow anyone whom you dislike on treat on your bedding (furniture), not allow anyone whom you dislike to enter your houses. And their right over you are that should treat them kindly with regard to their clothing and food.' ”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11430",
        "19868"
      ]
    },
    {
      "id": "sunan-ibn-majah-2839",
      "hadith_no": "2839",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Shares of Inheritance - كتاب الفرائض",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن محمد بن عبد الرحمن بن أبي ليلى، عن الحكم، عن عبد الله بن شداد، عن بنت حمزة، - قال محمد يعني ابن أبي ليلى وهي أخت ابن شداد لأمه - قالت مات مولاى وترك ابنة فقسم رسول الله صلى الله عليه وسلم ماله بيني وبين ابنته فجعل لي النصف ولها النصف ‏.‏",
      "text_en": " It wasnarrated that the daughter of Hamzah said:                      “My freed slavedied,leaving behind a daughter. The Messenger of Allah (ﷺ) dividedhiswealth between myself and his daughter, giving me half and herhalf.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11069",
        "169"
      ]
    },
    {
      "id": "sunan-ibn-majah-3257",
      "hadith_no": "3257",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا أبو كريب، حدثنا المحاربي، وعبد الرحيم، عن سفيان الثوري، عن سعيد بن مسروق، وحدثنا الحسين بن علي، عن زائدة، عن سعيد بن مسروق، عن عباية بن رفاعة، عن رافع بن خديج، قال كنا مع رسول الله  صلى الله عليه وسلم  ونحن بذي الحليفة من تهامة فأصبنا إبلا وغنما فعجل القوم فأغلينا القدور قبل أن تقسم فأتانا رسول الله  صلى الله عليه وسلم  فأمر بها فأكفئت ثم عدل الجزور بعشرة من الغنم ‏.‏",
      "text_en": " It wasnarrated that Rafi’ bin Khadij said:                      “We were with theMessengerof Allah (ﷺ) in Dhul-Hulaifah in (the land of) Tihamah. Weacquiredsheep and camels and the people hastened to put cooking potson thefires before they had been distributed. The Messenger of Allah(ﷺ)came to us and ordered that they be overturned,* then he madeonecamel equivalent to ten sheep.”",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20333",
        "20334",
        "20012",
        "20016",
        "20315",
        "20320",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sunan-ibn-majah-3421",
      "hadith_no": "3421",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا جبارة بن المغلس، حدثنا عبيد بن وسيم الجمال، حدثني الحسن بن الحسن، عن أمه، فاطمة بنت الحسين عن الحسين بن علي، عن أمه، فاطمة ابنة رسول الله  صلى الله عليه وسلم  قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ألا لا يلومن امرؤ إلا نفسه يبيت وفي يده ريح غمر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Husain bin ‘Ali that his mother, Fatimah thedaughterof the Messenger of Allah (ﷺ), said:                      “The Messenger ofAllah(ﷺ) said: ‘A man has no one to blame but himself, if he goestobed with a smell emanating from his hand.’”",
      "usc_msa_ref": "",
      "chain": [
        "35021",
        "18183",
        "20315"
      ]
    },
    {
      "id": "sunan-ibn-majah-3707",
      "hadith_no": "3707",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الحسين بن علي، عن ابن أبي رواد، عن سالم، عن أبيه، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ الإسبال في الإزار والقميص والعمامة من جر شيئا خيلاء لم ينظر الله إليه يوم القيامة ‏\"‏ ‏.‏ قال أبو بكر ما أغربه ‏.‏",
      "text_en": " It wasnarrated from Salim, from his father, that the Prophet (ﷺ)said:                     “Hanging down may apply to the waist wrap, shirt or turban.Whoeverlets any of these drag out of pride, Allah will not look athim onthe Day of Resurrection.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20315",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-3794",
      "hadith_no": "3794",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا الحسين بن علي، عن حمزة الزيات، عن أبي إسحاق، عن الأغر أبي مسلم، أنه شهد على أبي هريرة وأبي سعيد أنهما شهدا على رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إذا قال العبد لا إله إلا الله والله أكبر ‏.‏ قال يقول الله عز وجل صدق عبدي لا إله إلا أنا وأنا أكبر ‏.‏ وإذا قال العبد لا إله إلا الله وحده ‏.‏ قال صدق عبدي لا إله إلا أنا وحدي ‏.‏ وإذا قال لا إله إلا الله لا شريك له ‏.‏ قال صدق عبدي لا إله إلا أنا ولا شريك لي ‏.‏ وإذا قال لا إله إلا الله له الملك وله الحمد ‏.‏ قال صدق عبدي لا إله إلا أنا لي الملك ولي الحمد ‏.‏ وإذا قال لا إله إلا الله ولا حول ولا قوة إلا بالله ‏.‏ قال صدق عبدي لا إله إلا أنا ولا حول ولا قوة إلا بي ‏\"‏ ‏.‏ قال أبو إسحاق ثم قال الأغر شيئا لم أفهمه ‏.‏ قال فقلت لأبي جعفر ما قال فقال من رزقهن عند موته لم تمسه النار ‏.‏",
      "text_en": " It was narrated from Abu Hurairah and Abu Saeed bore witness that the Messenger of Allah(ﷺ) said:                     \"If a person says: 'La ilaha illallahu wa Allahu Akbar (None has the right to be worshipped but Allah and Allah is the Most Great),'Allah says: 'My slave has spoken the truth; there is none worthy of worship except I, and I am the Most Great.' If a person says: La ilaha Illallah wahdahu (There is none worthy of worship except Allah alone), Allah says: 'My slave has spoken the truth; there is none worthy of worship except I, alone.' If he says, La ilaha illallahu la sharikalahu (There is none worthy of worship except Allah with no partner or associate),' Allah says: 'My slave has spoken the truth; there is none worthy of worship except I, with no partner or associate.' If he says: 'La illah illallah, lahul mulku wa lahul hamdu (There is none worthy of worship except Allah, all dominion is His and all praise is to Him),' Allah says: 'My slave has spoken the truth; there is none of worthy of worship except I, all dominion Mine and all praise is due to Me.' If he says: ' La illaha illallah, la hawla wa la quwwata illa billah (There is none worthy of worship and there is no power and no strength except with Allah),' Allah says: 'My slave has spoken then truth; there is none worthy of worship except I, and tehre is no power and no strength except with Me.' One of the narrators Abu Ishaq said: \"Then Agharr (another narrator) said something that I did not understand. I said to Abu Jafar: 'What did he say?' He said: 'Whoever is blessed with (the ability to say) them (these words) at the time of death, the Fire will not touch him.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "20315",
        "20583",
        "11049"
      ]
    },
    {
      "id": "sunan-ibn-majah-4230",
      "hadith_no": "4230",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الحسين بن علي، عن زائدة، عن عبد الملك بن عمير، عن جابر بن سمرة، عن نافع بن عتبة بن أبي وقاص، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ ستقاتلون جزيرة العرب فيفتحها الله ثم تقاتلون الروم فيفتحها الله ثم تقاتلون الدجال فيفتحها الله ‏\"‏ ‏.‏ قال جابر فما يخرج الدجال حتى تفتح الروم ‏.‏",
      "text_en": " It was narrated from Jabir bin Samurah, that Nafi' bin 'Utbah bin AbuWaqqas narrated that the Prophet (ﷺ) said:                      \"You will fight theArabian Peninsula and victory will be granted by Allah. Then you willfight the Romans and victory will be granted (by Allah). Then youwill fight Dajjal and victory will be granted (by Allah).\"Jabir said: \"Dajjal will not appear until you have fought the Romans.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11368",
        "393"
      ]
    }
  ],
  "total_hadiths": 99
}