{
  "id": "20325",
  "name": "Salmah bin Rja'a سلمة بن رجاء",
  "full_name": "Salmah bin Rja'a سلمة بن رجاء",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  ت  ق  -  صدوق ]"
    ],
    "tags": [
      "B.Taym",
      "al-Tamimi",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11667",
      "name": "Ibrahim bin Abi Ablh إبراهيم بن أبي عبلة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "15196",
      "name": "Sa'id bin al-Mrzban al-Bsy سعيد بن المرزبان العبسي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20580",
      "name": "Hajjaj bin Artah حجاج بن أرطاة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "18935",
      "name": "Muhammad bin 'Urwa bin al-Zubair محمد بن عروة بن الزبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20439",
      "name": "'Abdur Rahman bin 'Abdullah bin Dinar عبد الرحمن بن عبد الله بن دينار",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "34043",
      "name": "Bakr bin Khlf al-Basri بكر بن خلف البصري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30449",
      "name": "Muhammad bin 'Abdul A'la محمد بن عبد الأعلى",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30212",
      "name": "Muhammad bin 'Abdullah bin Numayr محمد بن عبد الله بن نمير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "32048",
      "name": "Y'aqub bin Hmyd bin Kasb يعقوب بن حميد بن كاسب المدني",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-3872",
      "hadith_no": "3872",
      "source": "Sahih Bukhari",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني إسماعيل بن خليل، أخبرنا سلمة بن رجاء، عن هشام بن عروة، عن أبيه، عن عائشة، رضى الله عنها قالت لما كان يوم أحد هزم المشركون هزيمة بينة، فصاح إبليس أى عباد الله أخراكم، فرجعت أولاهم على أخراهم، فاجتلدت أخراهم، فنظر حذيفة، فإذا هو بأبيه فنادى أى عباد الله، أبي أبي‏.‏ فقالت فوالله ما احتجزوا حتى قتلوه، فقال حذيفة غفر الله لكم‏.‏ قال أبي فوالله ما زالت في حذيفة منها بقية خير حتى لقي الله عز وجل‏.‏",
      "text_en": " Narrated `Aisha:                     On the day of the battle of Uhud the pagans were defeated completely. Then Satan shouted loudly, \"O Allah's slaves! Beware the ones behind you!\" So the front files attacked the back ones. Then Hudhaifa looked and saw his father, and said loudly, \"O Allah's slaves! My father! My father!\" By Allah, they did not stop till they killed him (i.e. Hudaifa's father). Hudhaifa said, \"May Allah forgive you!\" The sub-narrator said, \"By Allah, because of what Hudhaifa said, he remained in a good state till he met Allah (i.e. died).",
      "usc_msa_ref": "161",
      "chain": [
        "30186",
        "20325",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1480",
      "hadith_no": "1480",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني، حدثنا سلمة بن رجاء، قال حدثنا عبد الرحمن بن عبد الله بن دينار، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي واقد الليثي، قال قدم النبي صلى الله عليه وسلم المدينة وهم يجبون أسنمة الإبل ويقطعون أليات الغنم قال ‏\"‏ ما قطع من البهيمة وهي حية فهو ميتة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Waqid Al-Laithi:                     \"The Prophet (ﷺ) came to Al-Madinah and they were in the habit of cutting the humps off of the camels and cutting the buttocks from the sheep. He said: 'Whatever is cut from an animal while it is alive, then it is dead flesh.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20325",
        "20439",
        "11163",
        "11020",
        "4044"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2685-2",
      "hadith_no": "2685",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني، حدثنا سلمة بن رجاء، حدثنا الوليد بن جميل، حدثنا القاسم أبو عبد الرحمن، عن أبي أمامة الباهلي، قال ذكر لرسول الله صلى الله عليه وسلم رجلان أحدهما عابد والآخر عالم فقال رسول الله صلى الله عليه وسلم ‏\"‏ فضل العالم على العابد كفضلي على أدناكم ‏\"‏ ‏.‏ ثم قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله وملائكته وأهل السموات والأرض حتى النملة في جحرها وحتى الحوت ليصلون على معلم الناس الخير ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ قال سمعت أبا عمار الحسين بن حريث الخزاعي يقول سمعت الفضيل بن عياض يقول عالم عامل معلم يدعى كبيرا في ملكوت السموات ‏.‏",
      "text_en": " Narrated Abu Umamah Al-Bahili:                     \"Two men were mentioned before the Messenger of Allah (ﷺ). One of them a worshiper, and the other a scholar. So the Messenger of Allah (ﷺ) said: 'The superiority of the scholar over the worshiper is like my superiority over the least of you.' Then the Messenger of Allah (ﷺ) said: 'Indeed Allah, His Angels, the inhabitants of the heavens and the earths - even the ant in his hole, even the fish - say Salat upon the one who teaches the people to do good.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20325",
        "19127",
        "27354",
        "4048"
      ]
    },
    {
      "id": "sunan-ibn-majah-1455",
      "hadith_no": "1455",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بشر، بكر بن خلف حدثنا سلمة بن رجاء، حدثتني شعثاء، عن عبد الله بن أبي أوفى، أن رسول الله  صلى الله عليه وسلم  صلى يوم بشر برأس أبي جهل ركعتين ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Abu Awfa that the Messenger ofAllah(ﷺ) prayed two Rak’ah on the day when he was given the gladtidings of the head (death) of Abu Jahl.",
      "usc_msa_ref": "",
      "chain": [
        "34043",
        "20325",
        "5115"
      ]
    },
    {
      "id": "sunan-ibn-majah-3725-2",
      "hadith_no": "3725",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا يعقوب بن حميد بن كاسب، حدثنا سلمة بن رجاء، عن الوليد بن جميل الدمشقي، أنه سمع القاسم بن عبد الرحمن، يحدث عن أبي أمامة، قال مر النبي  صلى الله عليه وسلم  على رجل نائم في المسجد منبطح على وجهه فضربه برجله وقال ‏\"‏ قم واقعد فإنها نومة جهنمية ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Umamah said:                     \"The Prophet(ﷺ) passed by a man who was sleeping in the masjid, lying on his face. He struck him with his foot and said: 'Get up' or; 'Sit up, fo this is a hellish kind of sleep.'\"",
      "usc_msa_ref": "",
      "chain": [
        "32048",
        "20325",
        "19127",
        "19896",
        "405"
      ]
    }
  ],
  "total_hadiths": 5
}