{
  "id": "20320",
  "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
  "full_name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "160",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-Thaqifi",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11368",
      "name": "'Abdul Malik bin 'Umayr al-Qabti عبد الملك بن عمير بن سويد القبطي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10743",
      "name": "Isma'il bin 'Abdur Rahman al-Saddi إسماعيل بن عبد الرحمن السدي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11339",
      "name": "Ziyad bin 'Alaqa زياد بن علاقة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10770",
      "name": "Smak bin Hrb bin Aws سماك بن حرب بن أوس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11430",
      "name": "Shbyb bin Ghrqd'h شبيب بن غرقدة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10962",
      "name": "Mukhtar bin Falfal مختار بن فلفل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11352",
      "name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11061",
      "name": "Abu al-Zanad أبو الزناد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11311",
      "name": "Hisham bin Hassan al-Azdi هشام بن حسان الأزدي القردوسي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20315",
      "name": "al-Husain bin 'Ali bin al-Walid al-Ja'fi الحسين بن علي بن الوليد الجعفي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20405",
      "name": "Ibrahim bin Muhammad bin al-Harith إبراهيم بن محمد أبو اسحاق الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20296",
      "name": "Hisham bin 'Abdul Malik al-Tayalasi هشام بن عبد الملك أبو الوليد الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30197",
      "name": "Talq bin Ghanam طلق بن غنام",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20389",
      "name": "Mua'wiya bin 'Amr bin al-Mhlb معاوية بن عمرو بن المهلب بن عمرو",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20290",
      "name": "Abu Hudhayfa al-Nahdi موسى بن مسعود أبو حذيفة النهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "269",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا زائدة، عن أبي حصين، عن أبي عبد الرحمن، عن علي، قال كنت رجلا مذاء فأمرت رجلا أن يسأل النبي صلى الله عليه وسلم لمكان ابنته فسأل فقال ‏\"‏ توضأ واغسل ذكرك ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     I used to get emotional urethral discharge frequently. Being the son-in-law of the Prophet I requested a man to ask him about it. So the man asked the Prophet about it. The Prophet replied, \"Perform ablution after washing your organ (penis).",
      "chain": [
        "20296",
        "20320",
        "11371",
        "11359",
        "5"
      ]
    },
    {
      "hadith_no": "572",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الرحيم المحاربي، قال حدثنا زائدة، عن حميد الطويل، عن أنس، قال أخر النبي صلى الله عليه وسلم صلاة العشاء إلى نصف الليل، ثم صلى ثم قال ‏\"‏ قد صلى الناس وناموا، أما إنكم في صلاة ما انتظرتموها ‏\"‏‏.‏ وزاد ابن أبي مريم أخبرنا يحيى بن أيوب حدثني حميد سمع أنسا كأني أنظر إلى وبيص خاتمه ليلتئذ‏.‏",
      "text_en": " Narrated Anas:                     The Prophet delayed the `Isha' prayer till midnight and then he offered the prayer and said, \"The people prayed and slept but you have been in prayer as long as you have been waiting for it (the prayer).\" Anas added: As if I am looking now at the glitter of the ring of the Prophet on that night.",
      "chain": [
        "30202",
        "20320",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "678",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق بن نصر، قال حدثنا حسين، عن زائدة، عن عبد الملك بن عمير، قال حدثني أبو بردة، عن أبي موسى، قال مرض النبي صلى الله عليه وسلم فاشتد مرضه فقال ‏\"‏ مروا أبا بكر فليصل بالناس ‏\"‏‏.‏ قالت عائشة إنه رجل رقيق، إذا قام مقامك لم يستطع أن يصلي بالناس‏.‏ قال ‏\"‏ مروا أبا بكر فليصل بالناس ‏\"‏ فعادت فقال ‏\"‏ مري أبا بكر فليصل بالناس، فإنكن صواحب يوسف ‏\"‏‏.‏ فأتاه الرسول فصلى بالناس في حياة النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Musa:                     \"The Prophet became sick and when his disease became aggravated, he said, \"Tell Abu Bakr to lead the prayer.\" `Aisha said, \"He is a softhearted man and would not be able to lead the prayer in your place.\" The Prophet said again, \"Tell Abu Bakr to lead the people in prayer.\" She repeated the same reply but he said, \"Tell Abu Bakr to lead the people in prayer. You are the companions of Joseph.\" So the messenger went to Abu Bakr (with that order) and he led the people in prayer in the lifetime of the Prophet.",
      "chain": [
        "30311",
        "11278",
        "20320",
        "11368",
        "1820",
        "41"
      ]
    },
    {
      "hadith_no": "687",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن يونس، قال حدثنا زائدة، عن موسى بن أبي عائشة، عن عبيد الله بن عبد الله بن عتبة، قال دخلت على عائشة فقلت ألا تحدثيني عن مرض رسول الله صلى الله عليه وسلم قالت بلى، ثقل النبي صلى الله عليه وسلم فقال ‏\"‏ أصلى الناس ‏\"‏‏.‏ قلنا لا، هم ينتظرونك‏.‏ قال ‏\"‏ ضعوا لي ماء في المخضب ‏\"‏‏.‏ قالت ففعلنا فاغتسل فذهب لينوء فأغمي عليه، ثم أفاق فقال صلى الله عليه وسلم ‏\"‏ أصلى الناس ‏\"‏‏.‏ قلنا لا، هم ينتظرونك يا رسول الله‏.‏ قال ‏\"‏ ضعوا لي ماء في المخضب ‏\"‏‏.‏ قالت فقعد فاغتسل، ثم ذهب لينوء فأغمي عليه، ثم أفاق فقال ‏\"‏ أصلى الناس ‏\"‏‏.‏ قلنا لا، هم ينتظرونك يا رسول الله‏.‏ فقال ‏\"‏ ضعوا لي ماء في المخضب ‏\"‏، فقعد فاغتسل، ثم ذهب لينوء فأغمي عليه، ثم أفاق فقال ‏\"‏ أصلى الناس ‏\"‏‏.‏ فقلنا لا، هم ينتظرونك يا رسول الله  والناس عكوف في المسجد ينتظرون النبي عليه السلام لصلاة العشاء الآخرة  فأرسل النبي صلى الله عليه وسلم إلى أبي بكر بأن يصلي بالناس، فأتاه الرسول فقال إن رسول الله صلى الله عليه وسلم يأمرك أن تصلي بالناس‏.‏ فقال أبو بكر  وكان رجلا رقيقا  يا عمر صل بالناس‏.‏ فقال له عمر أنت أحق بذلك‏.‏ فصلى أبو بكر تلك الأيام، ثم إن النبي صلى الله عليه وسلم وجد من نفسه خفة فخرج بين رجلين أحدهما العباس لصلاة الظهر، وأبو بكر يصلي بالناس، فلما رآه أبو بكر ذهب ليتأخر فأومأ إليه النبي صلى الله عليه وسلم بأن لا يتأخر‏.‏ قال ‏\"‏ أجلساني إلى جنبه ‏\"‏‏.‏ فأجلساه إلى جنب أبي بكر‏.‏ قال فجعل أبو بكر يصلي وهو يأتم بصلاة النبي صلى الله عليه وسلم والناس بصلاة أبي بكر، والنبي صلى الله عليه وسلم قاعد‏.‏ قال عبيد الله فدخلت على عبد الله بن عباس فقلت له ألا أعرض عليك ما حدثتني عائشة عن مرض النبي صلى الله عليه وسلم قال هات‏.‏ فعرضت عليه حديثها، فما أنكر منه شيئا، غير أنه قال أسمت لك الرجل الذي كان مع العباس قلت لا‏.‏ قال هو علي‏.‏",
      "text_en": " Narrated 'Ubaidullah Ibn `Abdullah bin `Utba:                     I went to `Aisha and asked her to describe to me the illness of Allah's Apostle. `Aisha said, \"Yes. The Prophet became seriously ill and asked whether the people had prayed. We replied, 'No. O Allah's Apostle! They are waiting for you.' He added, 'Put water for me in a trough.\" `Aisha added, \"We did so. He took a bath and tried to get up but fainted. When he recovered, he again asked whether the people had prayed. We said, 'No, they are waiting for you. O Allah's Apostle,' He again said, 'Put water in a trough for me.' He sat down and took a bath and tried to get up but fainted again. Then he recovered and said, 'Have the people prayed?' We replied, 'No, they are waiting for you. O Allah's Apostle.' He said, 'Put water for me in the trough.' Then he sat down and washed himself and tried to get up but he fainted. When he recovered, he asked, 'Have the people prayed?' We said, 'No, they are waiting for you. O Allah's Apostle! The people were in the mosque waiting for the Prophet for the `Isha prayer. The Prophet sent for Abu Bakr to lead the people in the prayer. The messenger went to Abu Bakr and said, 'Allah's Apostle orders you to lead the people in the prayer.' Abu Bakr was a softhearted man, so he asked `Umar to lead the prayer but `Umar replied, 'You are more rightful.' So Abu Bakr led the prayer in those days. When the Prophet felt a bit better, he came out for the Zuhr prayer with the help of two persons one of whom was Al-`Abbas. while Abu Bakr was leading the people in the prayer. When Abu Bakr saw him he wanted to retreat but the Prophet beckoned him not to do so and asked them to make him sit beside Abu Bakr and they did so. Abu Bakr was following the Prophet (in the prayer) and the people were following Abu Bakr. The Prophet (prayed) sitting.\" 'Ubaidullah added \"I went to `Abdullah bin `Abbas and asked him, Shall I tell you what Aisha has told me about the fatal illness of the Prophet?' Ibn `Abbas said, 'Go ahead. I told him her narration and he did not deny anything of it but asked whether `Aisha told me the name of the second person (who helped the Prophet ) along with Al-Abbas. I said. 'No.' He said, 'He was `Ali (Ibn Abi Talib).",
      "chain": [
        "30184",
        "20320",
        "11399",
        "11004"
      ]
    },
    {
      "hadith_no": "719",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن أبي رجاء، قال حدثنا معاوية بن عمرو، قال حدثنا زائدة بن قدامة، قال حدثنا حميد الطويل، حدثنا أنس، قال أقيمت الصلاة فأقبل علينا رسول الله صلى الله عليه وسلم بوجهه فقال ‏\"‏ أقيموا صفوفكم وتراصوا، فإني أراكم من وراء ظهري ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Once the Iqama was pronounced and Allah's Apostle faced us and said, \"Straighten your rows and stand closer together, for I see you from behind my back.'",
      "chain": [
        "30300",
        "20389",
        "20320",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "936",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا معاوية بن عمرو، قال حدثنا زائدة، عن حصين، عن سالم بن أبي الجعد، قال حدثنا جابر بن عبد الله، قال بينما نحن نصلي مع النبي صلى الله عليه وسلم إذ أقبلت عير تحمل طعاما، فالتفتوا إليها حتى ما بقي مع النبي صلى الله عليه وسلم إلا اثنا عشر رجلا، فنزلت هذه الآية ‏{‏وإذا رأوا تجارة أو لهوا انفضوا إليها وتركوك قائما‏}‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     While we were praying (Jumua Khutba & prayer) with the Prophet (p.b.u.h), some camels loaded with food, arrived (from Sham). The people diverted their attention towards the camels (and left the mosque), and only twelve persons remained with the Prophet. So this verse was revealed: \"But when they see Some bargain or some amusement, They disperse headlong to it, And leave you standing.\" (62.11)",
      "chain": [
        "20389",
        "20320",
        "15097",
        "11342",
        "34"
      ]
    },
    {
      "hadith_no": "1003",
      "source": " Sahih Bukhari ",
      "chapter": "Witr Prayer - كتاب الوتر",
      "chapter_no": "14",
      "text_ar": "أخبرنا أحمد بن يونس، قال حدثنا زائدة، عن التيمي، عن أبي مجلز، عن أنس، قال قنت النبي صلى الله عليه وسلم شهرا يدعو على رعل وذكوان‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet recited Qunut for one month (in the Fajr prayer) asking Allah to punish the tribes of Ral and Dhakwan.",
      "chain": [
        "30184",
        "20320",
        "11289",
        "11313",
        "19"
      ]
    },
    {
      "hadith_no": "1054",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا ربيع بن يحيى، قال حدثنا زائدة، عن هشام، عن فاطمة، عن أسماء، قالت لقد أمر النبي صلى الله عليه وسلم بالعتاقة في كسوف الشمس‏.‏",
      "text_en": " Narrated Asma:                     No doubt the Prophet ordered people to manumit slaves during the solar eclipse.",
      "chain": [
        "30133",
        "20320",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "1060",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا زائدة، قال حدثنا زياد بن علاقة، قال سمعت المغيرة بن شعبة، يقول انكسفت الشمس يوم مات إبراهيم، فقال الناس انكسفت لموت إبراهيم‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الشمس والقمر آيتان من آيات الله، لا ينكسفان لموت أحد ولا لحياته، فإذا رأيتموهما فادعوا الله وصلوا حتى ينجلي ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     On the day of Ibrahim's death, the sun eclipsed and the people said that the eclipse was due to the death of Ibrahim (the son of the Prophet). Allah's Apostle said, \"The sun and the moon are two signs amongst the signs of Allah. They do not eclipse because of someone's death or life. So when you see them, invoke Allah and pray till the eclipse is clear.\"",
      "chain": [
        "20296",
        "20320",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "1326",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا يحيى بن أبي بكير، حدثنا زائدة، حدثنا أبو إسحاق الشيباني، عن عامر، عن ابن عباس  رضى الله عنهما  قال أتى رسول الله صلى الله عليه وسلم قبرا، فقالوا هذا دفن، أو دفنت البارحة‏.‏ قال ابن عباس  رضى الله عنهما  فصفنا خلفه ثم صلى عليها‏.‏",
      "text_en": " Narrated 'Amir:                     Ibn `Abbas (who was at that time a boy) said, \"Allah's Apostle came to a grave and the people said, 'He or she was buried yesterday.' \" Ibn `Abbas added, \"We aligned behind the Prophet and he led the funeral prayer of the deceased.\"",
      "chain": [
        "20184",
        "20365",
        "20320",
        "11352",
        "11052",
        "17"
      ]
    },
    {
      "hadith_no": "1953",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن عبد الرحيم، حدثنا معاوية بن عمرو، حدثنا زائدة، عن الأعمش، عن مسلم البطين، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله إن أمي ماتت، وعليها صوم شهر، أفأقضيه عنها قال ‏\"‏ نعم  قال  فدين الله أحق أن يقضى ‏\"‏‏.‏ قال سليمان فقال الحكم وسلمة، ونحن جميعا جلوس حين حدث مسلم بهذا الحديث  قالا  سمعنا مجاهدا يذكر هذا عن ابن عباس‏.‏ ويذكر عن أبي خالد، حدثنا الأعمش، عن الحكم، ومسلم البطين، وسلمة بن كهيل، عن سعيد بن جبير، وعطاء، ومجاهد، عن ابن عباس، قالت امرأة للنبي صلى الله عليه وسلم إن أختي ماتت‏.‏ وقال يحيى وأبو معاوية حدثنا الأعمش عن مسلم عن سعيد عن ابن عباس قالت امرأة للنبي صلى الله عليه وسلم إن أمي ماتت‏.‏ وقال عبيد الله عن زيد بن أبي أنيسة عن الحكم عن سعيد بن جبير عن ابن عباس قالت امرأة للنبي صلى الله عليه وسلم إن أمي ماتت وعليها صوم نذر‏.‏ وقال أبو حريز حدثنا عكرمة عن ابن عباس قالت امرأة للنبي صلى الله عليه وسلم ماتت أمي وعليها صوم خمسة عشر يوما‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A man came to the Prophet and said, \"O Allah's Apostle! My mother died and she ought to have fasted one month (for her missed Ramadan). Shall I fast on her behalf?\" The Prophet replied in the affirmative and said, \"Allah's debts have more right to be paid.\" In another narration a woman is reported to have said, \"My sister died...\" Narrated Ibn `Abbas: A woman said to the Prophet \"My mother died and she had vowed to fast but she didn't fast.\" In another narration Ibn `Abbas is reported to have said, \"A woman said to the Prophet, \"My mother died while she ought to have fasted for fifteen days.\"",
      "chain": [
        "30272",
        "20389",
        "20320",
        "11060",
        "11393",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2058",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا طلق بن غنام، حدثنا زائدة، عن حصين، عن سالم، قال حدثني جابر  رضى الله عنه  قال بينما نحن نصلي مع النبي صلى الله عليه وسلم إذ أقبلت من الشأم عير، تحمل طعاما، فالتفتوا إليها، حتى ما بقي مع النبي صلى الله عليه وسلم إلا اثنا عشر رجلا فنزلت ‏{‏وإذا رأوا تجارة أو لهوا انفضوا إليها‏}‏",
      "text_en": " Narrated Jabir:                     While we were offering the prayer with the Prophet a caravan carrying food came from Sham. The people looked towards the caravan (and went to it) and only twelve persons remained with the Prophet. So, the Divine Inspiration came; \"But when they see some bargain or some amusement, they disperse headlong to it.\" (62.11)",
      "chain": [
        "30197",
        "20320",
        "15097",
        "11011",
        "34"
      ]
    },
    {
      "hadith_no": "2519",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا موسى بن مسعود، حدثنا زائدة بن قدامة، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر  رضى الله عنهما  قالت أمر النبي صلى الله عليه وسلم بالعتاقة في كسوف الشمس‏.‏ تابعه علي عن الدراوردي عن هشام‏.‏",
      "text_en": " Narrated Asma' bint Abu Bakr:                     The Prophet ordered us to free slaves at the time of solar eclipses.",
      "chain": [
        "20290",
        "20320",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "3331",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا أبو كريب، وموسى بن حزام، قالا حدثنا حسين بن علي، عن زائدة، عن ميسرة الأشجعي، عن أبي حازم، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ استوصوا بالنساء، فإن المرأة خلقت من ضلع، وإن أعوج شىء في الضلع أعلاه، فإن ذهبت تقيمه كسرته، وإن تركته لم يزل أعوج، فاستوصوا بالنساء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah 's Apostle said, \"Treat women nicely, for a women is created from a rib, and the most curved portion of the rib is its upper portion, so, if you should try to straighten it, it will break, but if you leave it as it is, it will remain crooked. So treat women nicely.\"",
      "chain": [
        "30216",
        "30394",
        "20315",
        "20320",
        "11658",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "3385",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا الربيع بن يحيى البصري، حدثنا زائدة، عن عبد الملك بن عمير، عن أبي بردة بن أبي موسى، عن أبيه، قال مرض النبي صلى الله عليه وسلم فقال ‏\"‏ مروا أبا بكر فليصل بالناس ‏\"‏‏.‏ فقالت إن أبا بكر رجل‏.‏ فقال مثله فقالت مثله‏.‏ فقال ‏\"‏ مروه فإنكن صواحب يوسف ‏\"‏‏.‏ فأم أبو بكر في حياة رسول الله صلى الله عليه وسلم‏.‏ فقال حسين عن زائدة رجل رقيق‏.‏",
      "text_en": " Narrated Abu Musa:                     When the Prophet fell ill, he said, \"Order Abu Bakr to lead the people in prayer.\" `Aisha said, \"Abu Bakr is a soft-hearted person. The Prophet gave the same order again and she again gave the same reply. He again said, \"Order Abu Bakr (to lead the prayer)! You are (like) the female companions of Joseph.\" Consequently Abu Bakr led the people in prayer in the life-time of the Prophet.",
      "chain": [
        "30133",
        "20320",
        "11368",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "3751",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا محمد بن رافع، حدثنا حسين، عن زائدة، عن أبي حصين، عن سعد بن عبيدة، قال جاء رجل إلى ابن عمر، فسأله عن عثمان،، فذكر عن محاسن، عمله، قال لعل ذاك يسوؤك‏.‏ قال نعم‏.‏ قال فأرغم الله بأنفك‏.‏ ثم سأله عن علي، فذكر محاسن عمله قال هو ذاك، بيته أوسط بيوت النبي صلى الله عليه وسلم‏.‏ ثم قال لعل ذاك يسوؤك‏.‏ قال أجل‏.‏ قال فأرغم الله بأنفك، انطلق فاجهد على جهدك‏.‏",
      "text_en": " Narrated Sa`d bin 'Ubaida:                     A man came to Ibn `Umar and asked about `Uthman and Ibn `Umar mentioned his good deeds and said to the questioner. \"Perhaps these facts annoy you?\" The other said, \"Yes.\" Ibn `Umar said, \"May Allah stick your nose in the dust (i.e. degrade you)!' Then the man asked him about `Ali. Ibn `Umar mentioned his good deeds and said, \"It is all true, and that is his house in the midst of the houses of the Prophet. Perhaps these facts have hurt you?\" The questioner said, \"Yes.\" Ibn `Umar said, \"May Allah stick your nose in the dust (i.e. degrade you or make you do things which you hate) ! Go away and do whatever you can against me.\"",
      "chain": [
        "30375",
        "11278",
        "20320",
        "11371",
        "11344"
      ]
    },
    {
      "hadith_no": "4275",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا الحسن بن إسحاق، حدثنا محمد بن سابق، حدثنا زائدة، عن عبيد الله بن عمر، عن نافع، عن ابن عمر  رضى الله عنهما  قال قسم رسول الله صلى الله عليه وسلم يوم خيبر للفرس سهمين، وللراجل سهما‏.‏ قال فسره نافع فقال إذا كان مع الرجل فرس فله ثلاثة أسهم، فإن لم يكن له فرس فله سهم‏.‏",
      "text_en": " Narrated Ibn `Umar:                     On the day of Khaibar, Allah's Apostle divided (the war booty of Khaibar) with the ratio of two shares for the horse and one-share for the foot soldier. (The sub-narrator, Nafi` explained this, saying, \"If a man had a horse, he was given three shares and if he had no horse, then he was given one share.\")",
      "chain": [
        "30323",
        "30209",
        "20320",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4770",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني طلق بن غنام، حدثنا زائدة، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت أنزل ذلك في الدعاء‏.‏",
      "text_en": " Narrated Aisha:                     The (above) verse was revealed in connection with the invocations.",
      "chain": [
        "30197",
        "20320",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4906",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا طلق بن غنام، حدثنا زائدة، عن الشيباني، قال سألت زرا عن قوله تعالى ‏{‏فكان قاب قوسين أو أدنى * فأوحى إلى عبده ما أوحى‏}‏ قال أخبرنا عبد الله أن محمدا صلى الله عليه وسلم رأى جبريل له ستمائة جناح‏.‏",
      "text_en": " Narrated Ash-Shaibani:                     I asked Zirr about the Statement of Allah: 'And was at a distance of but two bow-lengths or (even) nearer. So did Allah convey the Inspiration to His slave (Gabriel) and then he (Gabriel) conveyed that to Muhammad.' (53.10) He said, \"Abdullah (bin Mas`ud) informed us that Muhammad had seen Gabriel with six hundred wings.\"",
      "chain": [
        "30197",
        "20320",
        "11352",
        "11337",
        "16"
      ]
    },
    {
      "hadith_no": "5090",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا ربيع بن يحيى، حدثنا زائدة، حدثنا هشام، عن عروة، عن عائشة  رضى الله عنها  قالت سمع النبي صلى الله عليه وسلم رجلا يقرأ في المسجد فقال ‏\"‏ يرحمه الله لقد أذكرني كذا وكذا آية من سورة كذا ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     The Prophet heard a man reciting the Qur'an in the mosque and said, \"May Allah bestow His Mercy on him, as he has reminded me of such-and-such Verses of such a Surah.\"",
      "chain": [
        "30133",
        "20320",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5179",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "وقال لي طلق حدثنا زائدة، عن منصور، عن مجاهد، عن ابن عباس، ‏{‏فيما عرضتم‏}‏ يقول إني أريد التزويج، ولوددت أنه تيسر لي امرأة صالحة‏.‏ وقال القاسم يقول إنك على كريمة، وإني فيك لراغب، وإن الله لسائق إليك خيرا‏.‏ أو نحو هذا‏.‏ وقال عطاء يعرض ولا يبوح يقول إن لي حاجة وأبشري، وأنت بحمد الله نافقة‏.‏ وتقول هي قد أسمع ما تقول‏.‏ ولا تعد شيئا ولا يواعد وليها بغير علمها، وإن واعدت رجلا في عدتها ثم نكحها بعد لم يفرق بينهما‏.‏ وقال الحسن ‏{‏لا تواعدوهن سرا‏}‏ الزنا‏.‏ ويذكر عن ابن عباس ‏{‏الكتاب أجله‏}‏ تنقضي العدة‏.‏",
      "text_en": "",
      "chain": [
        "20320",
        "11067",
        "11028",
        "10535"
      ]
    },
    {
      "hadith_no": "5240",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا إسحاق بن نصر، حدثنا حسين الجعفي، عن زائدة، عن ميسرة، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من كان يؤمن بالله واليوم الآخر فلا يؤذي جاره ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever believes in Allah and the Last Day should not hurt (trouble) his neighbor. And I advise you to take care of the women, for they are created from a rib and the most crooked portion of the rib is its upper part; if you try to straighten it, it will break, and if you leave it, it will remain crooked, so I urge you to take care of the women.\"",
      "chain": [
        "30311",
        "20315",
        "20320",
        "11658",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "6270",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أبو الوليد، حدثنا زائدة، حدثنا زياد بن علاقة، سمعت المغيرة بن شعبة، قال انكسفت الشمس يوم مات إبراهيم‏.‏ رواه أبو بكرة عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Al-Mughira bin Shuba:                     Solar eclipse occurred on the day of Ibrahim's death (the Prophet's son).",
      "chain": [
        "20296",
        "20320",
        "11339",
        "166",
        "3229"
      ]
    },
    {
      "hadith_no": "6448",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا الحسين، عن زائدة، عن عبد الملك، عن مصعب، عن أبيه، قال تعوذوا بكلمات كان النبي صلى الله عليه وسلم يتعوذ بهن ‏\"‏ اللهم إني أعوذ بك من الجبن، وأعوذ بك من البخل، وأعوذ بك من أن أرد إلى أرذل العمر، وأعوذ بك من فتنة الدنيا، وعذاب القبر ‏\"‏‏.‏",
      "text_en": " Narrated Sa`d:                     Seek refuge with Allah by saying the words which the Prophet used to say while seeking refuge with Allah, \"0 Allah! I seek refuge with You from cowardice, and seek refuge with You from miserliness, and seek refuge with You from reaching a degraded geriatric old age, and seek refuge with You from the afflictions of the world and from the punishment in the grave.\"",
      "chain": [
        "30123",
        "11278",
        "20320",
        "11368",
        "10556",
        "9"
      ]
    },
    {
      "hadith_no": "6994",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثني محمد بن عبد الله، حدثنا محمد بن سابق، حدثنا زائدة، حدثنا هشام بن عروة، عن أبيه، أنه سمع المغيرة بن شعبة، يحدث عن عمر، أنه استشارهم في إملاص المرأة مثله‏.‏",
      "text_en": " Narrated `Urwa:                     I heard Al-Maghira bin Shu`ba narrating that `Umar had consulted them about the case of abortion (similarly as narrated in No. 42).",
      "chain": [
        "30561",
        "30209",
        "20320",
        "11065",
        "10511",
        "166",
        "3"
      ]
    },
    {
      "hadith_no": "7526",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عبدة بن عبد الله، حدثنا حسين الجعفي، عن زائدة، حدثنا بيان بن بشر، عن قيس بن أبي حازم، حدثنا جرير، قال خرج علينا رسول الله صلى الله عليه وسلم ليلة البدر فقال ‏\"‏ إنكم سترون ربكم يوم القيامة كما ترون هذا، لا تضامون في رؤيته ‏\"‏‏.‏",
      "text_en": " Narrated Jarir:                     Allah's Apostle came out to us on the night of the full moon and said, \"You will see your Lord on the Day of Resurrection as you see this (full moon) and you will have no difficulty in seeing Him.\"",
      "chain": [
        "30149",
        "20315",
        "20320",
        "11326",
        "11046",
        "4057"
      ]
    },
    {
      "hadith_no": "54",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا أحمد، - يعني ابن يونس - حدثنا زائدة، عن الأعمش، عن إبراهيم، أن الحارث، قال تعلمت القرآن في ثلاث سنين والوحى في سنتين - أو قال الوحى في ثلاث سنين والقرآن في سنتين ‏.‏",
      "text_en": "",
      "chain": [
        "38834",
        "30184",
        "20320",
        "11060",
        "11051"
      ]
    },
    {
      "hadith_no": "55",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني حجاج، قال حدثني أحمد، - وهو ابن يونس - حدثنا زائدة، عن منصور، والمغيرة، عن إبراهيم، أن الحارث، اتهم ‏.‏",
      "text_en": "",
      "chain": [
        "20219",
        "30184",
        "20320",
        "11067",
        "166",
        "20150"
      ]
    },
    {
      "hadith_no": "155",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا القاسم بن زكرياء، حدثنا حسين، عن زائدة، عن أبي حصين، عن الأسود بن هلال، قال سمعت معاذا، يقول دعاني رسول الله صلى الله عليه وسلم فأجبته فقال ‏\"‏ هل تدري ما حق الله على الناس ‏\"‏ ‏.‏ نحو حديثهم ‏.‏",
      "text_en": " It is narrated on the authority of Aswad b. Hilal that he heard Mu'adh say this:                      The Messenger of Allah (may peace be upon him) called, me and I replied to him. He (the Holy Prophet) said: Do you know the right of Allah upon the people? and then followed the hadith (mentioned above).",
      "chain": [
        "11278",
        "20320",
        "11371",
        "11620",
        "32"
      ]
    },
    {
      "hadith_no": "348",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني زهير بن حرب، حدثنا وكيع، حدثنا مسعر، وهشام، ح وحدثني إسحاق بن منصور، أخبرنا الحسين بن علي، عن زائدة، عن شيبان، جميعا عن قتادة، بهذا الإسناد مثله ‏.‏",
      "text_en": " The same hadith has been narrated by Zuhair b. Harb, Waki, Ishaq b. Mansur, Husain b. 'Ali.",
      "chain": [
        "30022",
        "20032",
        "20359",
        "11065",
        "30313",
        "20315",
        "20320"
      ]
    },
    {
      "hadith_no": "382",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني القاسم بن زكرياء، حدثنا حسين، - يعني الجعفي - عن زائدة، عن هشام، قال قال الحسن كنا عند معقل بن يسار نعوده فجاء عبيد الله بن زياد فقال له معقل إني سأحدثك حديثا سمعته من رسول الله صلى الله عليه وسلم ثم ذكر بمعنى حديثهما ‏.‏",
      "text_en": " Hasan reported:                      We were with Ma'qil b. Yasar inquiring about his health that Ubaidullah b. Ziyad came there. Ma'qil said to him: Verily I am going to narrate to you a hadith which I heard from the Messenger of Allah (may peace be upon him). Then he narrated the hadith like those two (mentioned above).",
      "chain": [
        "20315",
        "20320",
        "11065"
      ]
    },
    {
      "hadith_no": "415",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن عبد الله بن ذكوان، عن عبد الرحمن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم ح",
      "text_en": "",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "506",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن المختار بن فلفل، قال قال أنس بن مالك قال النبي صلى الله عليه وسلم ‏\"‏ أنا أول شفيع في الجنة لم يصدق نبي من الأنبياء ما صدقت وإن من الأنبياء نبيا ما يصدقه من أمته إلا رجل واحد ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik said:                      The Apostle of Allah (may peace be upon him) said: I would be the first intercessor in the Paradise and no apostle amongst the apostles has been testified (by such a large number of people) as I have been testified. And verily there woald be an apostle among the apostles who would be testified to by only one man from his people.",
      "chain": [
        "30201",
        "20315",
        "20320",
        "10962",
        "19"
      ]
    },
    {
      "hadith_no": "526",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني عمرو الناقد، حدثنا معاوية بن عمرو، حدثنا زائدة، حدثنا عبد الله بن ذكوان، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم نحو هذا ‏.‏",
      "text_en": " This hadith is narrated from the Apostle (may peace be upon him) by another chain of narrators, 'Amr al-Naqid, Mu'awiya b. 'Amr, Abdullah b. Dhakwan, A'raj on the authority of Abu Huraira.",
      "chain": [
        "30263",
        "20389",
        "20320",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "224",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، قال أبو بكر ووكيع عن إسرائيل، كلهم عن سماك بن حرب، بهذا الإسناد عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this is narrated from the Apostle (may peace be upon him) with the same chain of transmitters by Muhammad b. Muthanna, Ibn Bashshar, Muhammad b. Ja'far, Shu'ba.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "30201",
        "20315",
        "20320",
        "20311",
        "10770",
        "18"
      ]
    },
    {
      "hadith_no": "297",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن منصور، عن إبراهيم، عن الأسود، عن عائشة، قالت كنت أغسل رأس رسول الله صلى الله عليه وسلم وأنا حائض ‏.‏",
      "text_en": " Al-Aswad narrated it from 'A'isha that she observed:                      I used to wash the head of the Messenger of Allah (may peace be upon him), while I was in a state of menstruation.",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "316",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثناه عمرو الناقد، حدثنا معاوية بن عمرو، حدثنا زائدة، عن هشام، قال أخبرني عروة، عن عائشة، أن رسول الله صلى الله عليه وسلم كان إذا اغتسل من الجنابة بدأ فغسل يديه قبل أن يدخل يده في الإناء ثم توضأ مثل وضوئه للصلاة ‏.‏",
      "text_en": " 'Urwa has narrated it on the authority of 'A'isha that when Allah's Messenger (may peace be upon him) took a bath because of sexual intercourse, he first washed his hands before dipping one of them into the basin, and then performed ablu- tion as is done for prayer.",
      "chain": [
        "30263",
        "20389",
        "20320",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "337",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا موسى القارئ، حدثنا زائدة، عن الأعمش، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس، عن ميمونة، قالت وضعت للنبي صلى الله عليه وسلم ماء وسترته فاغتسل ‏.‏",
      "text_en": " Maimuna reported:                      I placed water for the Apostle (may peace be upon him) and provided privacy for him, and he took a bath.",
      "chain": [
        "30021",
        "20320",
        "11060",
        "11342",
        "11211",
        "17",
        "61"
      ]
    },
    {
      "hadith_no": "360",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا معاوية بن عمرو، حدثنا زائدة، عن سماك، ح وحدثني القاسم بن زكرياء، حدثنا عبيد الله بن موسى، عن شيبان، عن عثمان بن عبد الله بن موهب، وأشعث بن أبي الشعثاء، كلهم عن جعفر بن أبي ثور، عن جابر بن سمرة، عن النبي صلى الله عليه وسلم بمثل حديث أبي كامل عن أبي عوانة ‏.‏",
      "text_en": " This hadith is also narrated by another chain of transmitters.",
      "chain": [
        "30201",
        "20389",
        "20320",
        "10770",
        "20340",
        "20240",
        "11524",
        "10896",
        "393"
      ]
    },
    {
      "hadith_no": "402",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد بن حميد، حدثنا حسين الجعفي، عن زائدة، عن منصور، بهذا الإسناد مثل حديثهما وذكر في الحديث ‏\"‏ ثم ليتخير بعد من المسألة ما شاء أو ما أحب ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Mansur with the same chain of transmitters and he made a mention of this:                     \" Then he may choose any supplication which pleases him or which he likes.\"",
      "chain": [
        "30553",
        "20315",
        "20320"
      ]
    },
    {
      "hadith_no": "418",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن عبد الله بن يونس، حدثنا زائدة، حدثنا موسى بن أبي عائشة، عن عبيد الله بن عبد الله، قال دخلت على عائشة فقلت لها ألا تحدثيني عن مرض رسول الله صلى الله عليه وسلم قالت بلى ثقل النبي صلى الله عليه وسلم فقال ‏\"‏ أصلى الناس ‏\"‏ ‏.‏ قلنا لا وهم ينتظرونك يا رسول الله ‏.‏ قال ‏\"‏ ضعوا لي ماء في المخضب ‏\"‏ ‏.‏ ففعلنا فاغتسل ثم ذهب لينوء فأغمي عليه ثم أفاق فقال ‏\"‏ أصلى الناس ‏\"‏ ‏.‏ قلنا لا وهم ينتظرونك يا رسول الله ‏.‏ فقال ‏\"‏ ضعوا لي ماء في المخضب ‏\"‏ ‏.‏ ففعلنا فاغتسل ثم ذهب لينوء فأغمي عليه ثم أفاق فقال ‏\"‏ أصلى الناس ‏\"‏ ‏.‏ قلنا لا وهم ينتظرونك يا رسول الله ‏.‏ فقال ‏\"‏ ضعوا لي ماء في المخضب ‏\"‏ ‏.‏ ففعلنا فاغتسل ثم ذهب لينوء فأغمي عليه ثم أفاق فقال ‏\"‏ أصلى الناس ‏\"‏ ‏.‏ فقلنا لا وهم ينتظرونك يا رسول الله ‏.‏ قالت والناس عكوف في المسجد ينتظرون رسول الله صلى الله عليه وسلم لصلاة العشاء الآخرة - قالت - فأرسل رسول الله صلى الله عليه وسلم إلى أبي بكر أن يصلي بالناس فأتاه الرسول فقال إن رسول الله صلى الله عليه وسلم يأمرك أن تصلي بالناس ‏.‏ فقال أبو بكر وكان رجلا رقيقا يا عمر صل بالناس ‏.‏ قال فقال عمر أنت أحق بذلك ‏.‏ قالت فصلى بهم أبو بكر تلك الأيام ثم إن رسول الله صلى الله عليه وسلم وجد من نفسه خفة فخرج بين رجلين أحدهما العباس لصلاة الظهر وأبو بكر يصلي بالناس فلما رآه أبو بكر ذهب ليتأخر فأومأ إليه النبي صلى الله عليه وسلم أن لا يتأخر وقال لهما ‏\"‏ أجلساني إلى جنبه ‏\"‏ ‏.‏ فأجلساه إلى جنب أبي بكر وكان أبو بكر يصلي وهو قائم بصلاة النبي صلى الله عليه وسلم والناس يصلون بصلاة أبي بكر والنبي صلى الله عليه وسلم قاعد ‏.‏ قال عبيد الله فدخلت على عبد الله بن عباس فقلت له ألا أعرض عليك ما حدثتني عائشة عن مرض رسول الله صلى الله عليه وسلم قال هات ‏.‏ فعرضت حديثها عليه فما أنكر منه شيئا غير أنه قال أسمت لك الرجل الذي كان مع العباس قلت لا ‏.‏ قال هو علي ‏.‏",
      "text_en": " Ubaidullah b. Abdullah reported:                      I visited 'A'isha and asked her to tell about the illness of the Messenger of Allah (may peace be upon him). She agreed and said: The Apostle (may peace be upon him) was seriously ill and he asked whether the people had prayed. We said: No, they are waiting for you, Messenger of Allah. He (the Holy Prophet) said: Put some water in the tub for me. We did accordingly and he (the Holy Prophet) took a bath;and, when he was about to move with difficulty, he fainted. When he came round, he again said: Have the people said prayer? We said: No, they are waiting for you, Messenger of Allah. He (the Holy Prophet) again said: Put some water for me in the tub. We did accordingly and he took a bag, but when he was about to move with difficultyhe fainted. When he came round, he asked whether the people had prayed. We said: No, they are waiting for you, Messenger of Allah. He said: Put some water for me in the tub. We did accordingly and he took a bath and he was about to move with difficulty when he fainted. When he came roundhe said: Have the people saidprayer? We said: No, they are waiting for you, Messenger of Allah. She ('A'isha) said: The people were staying in the mosque and waiting for the Messenger of Allah (may peace be upon him) to lead the last (night) prayer. She ('A'isha) said: The Messenger of Allah (may peace be upon him) sent (instructions) to Abu Bakr to lead the people in prayer. When the messenger came, he told him (Abd Bakr): The Messenger of Allah (may peace be upon him) has ordered you to lead the people in prayer. Abu Bakr who was a man of very tenderly feelings asked Umar to lead the prayer. 'Umar said: You are more entitled to that. Abu Bakr led the prayers during those days. Afterwards the Messenger of Allah (may peace be upon him) felt some relief and he went out supported by two men, one of them was al-'Abbas, to the noon prayer. Abu Bakr was leading the people in prayer. When Abu Bakr saw him. he began to withdraw, but the Apostle of Allah (may peace be upon him) told him not to withdraw. He told his two (companions) to seat him down beside him (Abu Bakr). They seated him by the side of Abu Bakr. Abu Bakr said the prayer standing while following the prayer of the Apostle (way peace be upon him) and the people Bald prayer (standing) while following the prayer of Abu Bakr. The Apostle (may peace be upon him) was seated. Ubaidullah said: I visited 'Abdullah b. 'Abbas, and said: Should I submit to you what 'A'isha had told about the illness of the Apostle (may peace be upon him)? He said: Go ahead. I submitted to him what had been transmitted by her ('A'isha). He objected to none of it, only asking whether she had named to him the man who accompanied al-'Abbas. I said: No. He said: It was 'Ali.",
      "chain": [
        "30184",
        "20320",
        "11399",
        "11004"
      ]
    },
    {
      "hadith_no": "420",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن عبد الملك بن عمير، عن أبي بردة، عن أبي موسى، قال مرض رسول الله صلى الله عليه وسلم فاشتد مرضه فقال ‏\"‏ مروا أبا بكر فليصل بالناس ‏\"‏ ‏.‏ فقالت عائشة يا رسول الله إن أبا بكر رجل رقيق متى يقم مقامك لا يستطع أن يصلي بالناس فقال ‏\"‏ مري أبا بكر فليصل بالناس فإنكن صواحب يوسف ‏\"‏ ‏.‏ قال فصلى بهم أبو بكر حياة رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Musa reported:                      When the Messenger of Allah (may peace be upon him) became ill and illness became serious he ordered Abu Bakr to lead the people in prayer. Upon this 'A'isha said: Messenger of Allah, Abd Bakr is a man of tenderly feelings: when he would stand in your place (he would be so much overwhelmed -by grief that) he would not be able to lead the people in prayer. He (the Holy Prophet) said: You order Abu Bakr to lead the people in prayer, and added: You are like the female companions of Yusuf. So Abu Bakr led the prayer (during this period of illness) in the life of the Messenger of Allah (may peace be upon him).",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11368",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "458",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، حدثنا سماك بن حرب، عن جابر بن سمرة، قال إن النبي صلى الله عليه وسلم كان يقرأ في الفجر ب ‏{‏ ق والقرآن المجيد‏}‏ وكان صلاته بعد تخفيفا ‏.‏",
      "text_en": " Jabir b. Samura reported:                      The Apostle of Allah (may peace be upon him) used to recite in the morning prayer\" Qaf. By the Glorious Quran.\" and his prayer afterward shortened.",
      "chain": [
        "30201",
        "20315",
        "20320",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "503",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني إسحاق بن منصور، وعبد بن حميد، قالا أخبرنا جعفر بن عون، أخبرنا أبو عميس، ح قال وحدثني القاسم بن زكرياء، حدثنا حسين بن علي، عن زائدة، قال حدثنا مالك بن مغول، كلاهما عن عون بن أبي جحيفة، عن أبيه، عن النبي صلى الله عليه وسلم بنحو حديث سفيان وعمر بن أبي زائدة يزيد بعضهم على بعض وفي حديث مالك بن مغول فلما كان بالهاجرة خرج بلال فنادى بالصلاة ‏.‏",
      "text_en": " 'Aun b. Abu Juhaifa narrated from the Apostle of Allah (may peace be upon him) on the authority of his father a hadith like that of Sufyan, and 'Umar b. Abu Za'ida made this addition:                      Some of them tried to excel the others (in obtaining water), and in the hadith transmitted by Malik b. Mighwal (the words are): When it was noon, Bilal came out and summoned (people) to (noon) prayer.",
      "chain": [
        "30313",
        "30553",
        "20416",
        "20315",
        "20320",
        "20358",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "1315",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني القاسم بن زكرياء، حدثنا حسين بن علي الجعفي، عن زائدة، عن سليمان، عن إبراهيم، عن علقمة، عن عبد الله، قال صلينا مع رسول الله صلى الله عليه وسلم فإما زاد أو نقص - قال إبراهيم وايم الله ما جاء ذاك إلا من قبلي - قال فقلنا يا رسول الله أحدث في الصلاة شىء فقال ‏\"‏ لا ‏\"‏ ‏.‏ قال فقلنا له الذي صنع فقال ‏\"‏ إذا زاد الرجل أو نقص فليسجد سجدتين ‏\"‏ ‏.‏ قال ثم سجد سجدتين ‏.‏",
      "text_en": " Abdullah reported:                      We prayed along with the Messenger of Allah (may peace he upon him) and he committed or omitted (something). Ibrahim said: By Allah, this is a misgiving of mine only. We said: Messenger of Allah, is there something new about the prayer? He (the Holy Prophet) said: No. We told him about what he had done. He (the Holy Prophet) said: When a man commits or omits (something in prayer), he should perform two prostrations, and he then himself performed two prostrations.",
      "chain": [
        "20315",
        "20320",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1688",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، قال حدثني عمرو بن يحيى الأنصاري، حدثني محمد بن يحيى بن حبان، عن عمرو بن سليم بن خلدة الأنصاري، عن أبي قتادة، صاحب رسول الله صلى الله عليه وسلم قال دخلت المسجد ورسول الله صلى الله عليه وسلم جالس بين ظهرانى الناس - قال - فجلست فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما منعك أن تركع ركعتين قبل أن تجلس ‏\"‏ ‏.‏ قال فقلت يا رسول الله رأيتك جالسا والناس جلوس ‏.‏ قال ‏\"‏ فإذا دخل أحدكم المسجد فلا يجلس حتى يركع ركعتين ‏\"‏ ‏.‏",
      "text_en": " Abu Qatada, a Companion of the Messenger of Allah (may peace be upon him), said:                      I entered the mosque, when the Messenger of Allah (may peace be upon him) had been sitting among people, and I also sat down among them. Upon this the Messenger of Allah (may peace be upon him) said: What prevented you from offering two rak'ahs (of Nafl prayer) before sitting down? I said: Messenger of Allah, I saw you sitting and people sitting (around you and I, therefore, sat in your company). He (the Holy Prophet) then said: When anyone among you enters the mosque, he should not sit till he has observed two rak'ahs.",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11210",
        "11222",
        "1544"
      ]
    },
    {
      "hadith_no": "1949",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا عبد بن حميد، حدثنا حسين بن علي الجعفي، عن زائدة، عن منصور، عن شقيق، قال جاء رجل من بني بجيلة يقال له نهيك بن سنان إلى عبد الله فقال إني أقرأ المفصل في ركعة ‏.‏ فقال عبد الله هذا كهذ الشعر لقد علمت النظائر التي كان رسول الله صلى الله عليه وسلم يقرأ بهن سورتين في ركعة ‏.‏",
      "text_en": " Abu Wa'il reported:                      A person came to 'Abdullah b. Mas'ud and said: I recited all the mufassal surahs in one rak'ah during the night. 'Abdullah said: You must have recited hastily like the recitation of poetry. 'Abdullah said: I remember well the manner in which the Messenger of Allah (may peace be upon him) used to combine them, and he then mentioned twenty of the mufassal surahs, and (their combinations in) two in every rak'ah.",
      "chain": [
        "30553",
        "20315",
        "20320",
        "11067",
        "11353"
      ]
    },
    {
      "hadith_no": "2161",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، قالا حدثنا مصعب، - وهو ابن المقدام - حدثنا زائدة، حدثنا زياد بن علاقة، - وفي رواية أبي بكر قال قال زياد بن علاقة - سمعت المغيرة بن شعبة، يقول انكسفت الشمس على عهد رسول الله صلى الله عليه وسلم يوم مات إبراهيم فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الشمس والقمر آيتان من آيات الله لا ينكسفان لموت أحد ولا لحياته فإذا رأيتموهما فادعوا الله وصلوا حتى ينكشف ‏\"‏ ‏.‏",
      "text_en": "  Ziyad b. 'Ilaqa reported:                      I heard Mughira b. Shu'ba saying that the sun eclipsed during the lifetime of the Messenger of Allah (may peace be upon him) on the day when Ibrahim died. Upon this the Messenger of Allah (may peace be upon him) said: Verily the sun and the moon are the two signs among the signs of Allah. They do not eclipse on account of the death of anyone or on account of the birth of anyone. So when you see them, supplicate Allah, and observe prayer till it is over.",
      "chain": [
        "30201",
        "30212",
        "20608",
        "20320",
        "11339",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "2528",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا أبو كريب، حدثنا أبو أسامة، عن زائدة، عن منصور، عن طلحة بن مصرف، حدثنا أنس بن مالك، أن رسول الله صلى الله عليه وسلم مر بتمرة بالطريق فقال ‏\"‏ لولا أن تكون من الصدقة لأكلتها ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported that the Messenger of Allah (may peace be upon him) found a date lying on the path and said:                      If it were not out of Sadaqa, I would have eaten it.",
      "chain": [
        "30216",
        "20318",
        "20320",
        "11067",
        "11356",
        "19"
      ]
    },
    {
      "hadith_no": "2538",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن سماك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، ح . وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت عبد، الرحمن بن القاسم قال سمعت القاسم، يحدث عن عائشة، عن النبي صلى الله عليه وسلم بمثل ذلك ‏.‏",
      "text_en": " This hadith has been narrated on the authority of A'isha through another chain of transmitters.",
      "chain": [
        "30201",
        "20315",
        "20320",
        "10770",
        "10530",
        "10535",
        "53",
        "30170",
        "20173",
        "20020",
        "10530",
        "10535",
        "53"
      ]
    }
  ],
  "total_hadiths": 158
}