{
  "id": "20326",
  "name": "Sulaiman bin Hayan al-Azdi سليمان بن حيان الأزدي",
  "full_name": "Sulaiman bin Hayan al-Azdi سليمان بن حيان الأزدي",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "190",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ ع  -  صدوق يخطئ ]"
    ],
    "tags": [
      "al-Azdi",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11585",
      "name": "Da'ud bin Abi Hnd داود بن أبي هند",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11071",
      "name": "'Abdullah bin 'Awn bin Artaban عبد الله بن عون بن أرطبان الخزار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10616",
      "name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11311",
      "name": "Hisham bin Hassan al-Azdi هشام بن حسان الأزدي القردوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10845",
      "name": "Yazid bin Kysan al-Yshkry يزيد بن كيسان اليشكري أبو إسماعيل",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11274",
      "name": "Hatm bin Abi Sghyrh حاتم بن أبي صغيرة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11278",
      "name": "al-Husain bin Dhakwan al-Mua'lam الحسين بن ذكوان المعلم المكتب",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10766",
      "name": "Sa'd bin Tariq, Abu Malik سعد بن طارق بن أشيم أبو مالك الأشجعي",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11073",
      "name": "Sa'id bin Abi 'Aruba سعيد بن أبي عروبة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10969",
      "name": "Mnswr bin Hyan منصور بن حيان",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "20404",
      "name": "Aadm bin Abi Iyas آدم بن أبي إياس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "28040",
      "name": "Asad bin Musa - Asad al-Sunnah أسد بن موسى بن إبراهيم - أسد السنة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20034",
      "name": "Muhammad bin Yusuf al-Faryabi محمد بن يوسف الفريابي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30216",
      "name": "Abu Karayb, Muhammad bin al-'Ala' محمد بن العلاء - أبو كريب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30200",
      "name": "'Abdullah bin Sa'id al-Ashaj عبد الله بن سعيد بن حصين الكندي - الأشج",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30224",
      "name": "Yusuf bin Musa bin Rashid al-Qatan يوسف بن موسى بن راشد القطان",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30263",
      "name": "'Amr bin Muhammad bin Bukayr عمرو بن محمد بن بكير الناقد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30335",
      "name": "al-Rabi' bin Nafi' Abu Tawba al-Halbi الربيع بن نافع أبو توبة الحلبي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30212",
      "name": "Muhammad bin 'Abdullah bin Numayr محمد بن عبد الله بن نمير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30376",
      "name": "Muhammad bin Salam al-Baykandi محمد بن سلام البيكندي الكبير",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1973",
      "hadith_no": "1973",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثني محمد، أخبرنا أبو خالد الأحمر، أخبرنا حميد، قال سألت أنسا رضى الله عنه عن صيام النبي صلى الله عليه وسلم فقال ما كنت أحب أن أراه من الشهر صائما إلا رأيته ولا مفطرا إلا رأيته، ولا من الليل قائما إلا رأيته، ولا نائما إلا رأيته، ولا مسست خزة ولا حريرة ألين من كف رسول الله صلى الله عليه وسلم، ولا شممت مسكة ولا عبيرة أطيب رائحة من رائحة رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Humaid:                     I asked Anas about the fasting of the Prophet. He said \"Whenever I liked to see the Prophet fasting in any month, I could see that, and whenever I liked to see him not fasting, I could see that too, and if I liked to see him praying in any night, I could see that, and if I liked to see him sleeping, I could see that, too.\" Anas further said, \"I never touched silk or velvet softer than the hand of Allah's Apostle and never smelled musk or perfumed smoke more pleasant than the smell of Allah's Apostle.\"",
      "usc_msa_ref": "194",
      "chain": [
        "30213",
        "20326",
        "11279",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-7487",
      "hadith_no": "7487",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا يوسف بن موسى، حدثنا أبو خالد الأحمر، قال سمعت هشام بن عروة، يحدث عن أبيه، عن عائشة، قالت قالوا يا رسول الله إن هنا أقواما حديثا عهدهم بشرك، يأتونا بلحمان لا ندري يذكرون اسم الله عليها أم لا‏.‏ قال ‏\"‏ اذكروا أنتم اسم الله وكلوا ‏\"‏‏.‏ تابعه محمد بن عبد الرحمن والدراوردي وأسامة بن حفص‏.‏",
      "text_en": " Narrated `Aisha:                     The people said to the Prophet , \"O Allah's Apostle! Here are people who have recently embraced Islam and they bring meat, and we do not know whether they had mentioned Allah's Name while slaughtering the animals or not.\" The Prophet said, \"You should mention Allah's Name and eat.\"",
      "usc_msa_ref": "495",
      "chain": [
        "30224",
        "20326",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-120",
      "hadith_no": "120",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير الهمداني، حدثنا أبو خالد، - يعني سليمان بن حيان الأحمر - عن أبي مالك الأشجعي، عن سعد بن عبيدة، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ بني الإسلام على خمسة على أن يوحد الله وإقام الصلاة وإيتاء الزكاة وصيام رمضان والحج ‏\"‏ ‏.‏ فقال رجل الحج وصيام رمضان قال لا ‏.‏ صيام رمضان والحج ‏.‏ هكذا سمعته من رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It is narrated on the authority of ('Abdullah) son of Umar (may Allah be pleased with them) that the Holy Prophet (may peace of Allah be upon him) said:                      (The superstructure of) al-Islam is raised on five (pillars), i. e. the oneness of Allah, the establishment of prayer, payment of Zakat, the, fast of Ramadan, Pilgrimage (to Mecca). A person said (to 'Abdullah b. Umar the narrator): Which of the two precedes the other-Pilgrimage or the fasts of Rarnadan? Upon this he (the narrator) replied: No (it is not the Pilgrimage first) but the fasts of Ramadan precede the Pilgrimage.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20326",
        "10766",
        "11344",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-140",
      "hadith_no": "140",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، ح وحدثنيه زهير بن حرب، حدثنا يزيد بن هارون، كلاهما عن أبي مالك، عن أبيه، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ من وحد الله ‏\"‏ ثم ذكر بمثله ‏.‏",
      "text_en": " Abu Malik narrated on the authority of his father that he heard the Apostle (may peace be upon him) say:                      He who held belief in the unity of Allah, and then narrated what has been stated above.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "20472",
        "10766",
        "5098"
      ]
    },
    {
      "id": "sahih-muslim-287",
      "hadith_no": "287",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، ح وحدثنا أبو كريب، وإسحاق بن إبراهيم، عن أبي معاوية، كلاهما عن الأعمش، عن أبي ظبيان، عن أسامة بن زيد، وهذا، حديث ابن أبي شيبة قال بعثنا رسول الله صلى الله عليه وسلم في سرية فصبحنا الحرقات من جهينة فأدركت رجلا فقال لا إله إلا الله ‏.‏ فطعنته فوقع في نفسي من ذلك فذكرته للنبي صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ أقال لا إله إلا الله وقتلته ‏\"‏ ‏.‏ قال قلت يا رسول الله إنما قالها خوفا من السلاح ‏.‏ قال ‏\"‏ أفلا شققت عن قلبه حتى تعلم أقالها أم لا ‏\"‏ ‏.‏ فمازال يكررها على حتى تمنيت أني أسلمت يومئذ ‏.‏ قال فقال سعد وأنا والله لا أقتل مسلما حتى يقتله ذو البطين ‏.‏ يعني أسامة قال قال رجل ألم يقل الله ‏{‏ وقاتلوهم حتى لا تكون فتنة ويكون الدين كله لله‏}‏ فقال سعد قد قاتلنا حتى لا تكون فتنة وأنت وأصحابك تريدون أن تقاتلوا حتى تكون فتنة ‏.‏",
      "text_en": " It is narrated on the authority of Usama b. Zaid that the Messenger of Allah (may peace be upon him) sent us in a raiding party. We raided Huraqat of Juhaina in the morning. I caught hold of a man and he said:                      There is no god but Allah, I attacked him with a spear. It once occurred to me and I talked about it to the Apostle (may peace be upon him). The Messenger of Allah (may peace be upon him) said: Did he profess\" There is no god but Allah,\" and even then you killed him? I said: Messenger of Allah, he made a profession of it out of the fear of the weapon. He (the Holy Prophet) observed: Did you tear his heart in order to find out whether it had professed or not? And he went on repeating it to me till I wished I had embraced Islam that day. Sa'd said: By Allah, I would never kill any Muslim so long as a person with a heavy belly, i. e., Usama, would not kill. Upon this a person remarked: Did Allah not say this: And fight them until there is no more mischief and religion is wholly for Allah? Sa'd said: We fought so that there should be no mischief, but you and your companions wish to fight so that there should be mischief.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "30216",
        "30123",
        "11060",
        "19301",
        "50"
      ]
    },
    {
      "id": "sahih-muslim-354",
      "hadith_no": "354",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو كريب، حدثنا أبو خالد الأحمر، عن هشام، عن ابن سيرين، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من هم بحسنة فلم يعملها كتبت له حسنة ومن هم بحسنة فعملها كتبت له عشرا إلى سبعمائة ضعف ومن هم بسيئة فلم يعملها لم تكتب وإن عملها كتبت ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) observed:                      He who intended to do good, but did not do it, one good was recorded for him, and he who intended to do good and also did it, ten to seven hundred good deeds were recorded for him. And he who intended evil, but did not commit it, no entry was made against his name, but if he committed that, it was recorded.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20326",
        "11065",
        "11035",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-445-3",
      "hadith_no": "445",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الوهاب يعني الثقفي، ح قال وحدثنا عمرو الناقد، حدثنا سفيان بن عيينة، ح قال وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، ح قال وحدثنا إسحاق بن إبراهيم، قال أخبرنا عيسى بن يونس، كلهم عن يحيى بن سعيد، بهذا الإسناد ‏.‏ مثله ‏.‏",
      "text_en": " This hadith has been narrated by Yahya b. Sa'id with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20259",
        "30263",
        "20005",
        "30201",
        "20326",
        "30123",
        "20347"
      ]
    },
    {
      "id": "sahih-muslim-498-2",
      "hadith_no": "498",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبو خالد، - يعني الأحمر - عن حسين المعلم، ح قال وحدثنا إسحاق بن إبراهيم، - واللفظ له - قال أخبرنا عيسى بن يونس، حدثنا حسين المعلم، عن بديل بن ميسرة، عن أبي الجوزاء، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يستفتح الصلاة بالتكبير والقراءة ب ‏{‏ الحمد لله رب العالمين‏}‏ وكان إذا ركع لم يشخص رأسه ولم يصوبه ولكن بين ذلك وكان إذا رفع رأسه من الركوع لم يسجد حتى يستوي قائما وكان إذا رفع رأسه من السجدة لم يسجد حتى يستوي جالسا وكان يقول في كل ركعتين التحية وكان يفرش رجله اليسرى وينصب رجله اليمنى وكان ينهى عن عقبة الشيطان وينهى أن يفترش الرجل ذراعيه افتراش السبع وكان يختم الصلاة بالتسليم ‏.‏ وفي رواية ابن نمير عن أبي خالد وكان ينهى عن عقب الشيطان ‏.‏",
      "text_en": " 'A'isha reported:                      The Messenger of Allah (may peace be upon him) used to begin prayer with takbir (saying Allih-o-Akbar) and the recitation:\" Praise be to Allah, the Lord of the Universe.\" When he bowed he neither kept his head up nor bent it down, but kept it between these extremes; when he raised his bead after bow- ing he did not prostrate himself till he had stood erect; when he raised his head after prostration he did not prostrate himself again till he satup. At the end of every two rak'ahs he recited the tahiyya; and he used to place his left foot flat (on the ground) and raise up the right; he prohibited the devil's way of sitting on the heels, and he forbade people to spread out their arms like a wild beast. And he used to finish the prayer with the taslim.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20326",
        "11278",
        "30123",
        "20347",
        "11278",
        "10672",
        "11265",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-502-3",
      "hadith_no": "502",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وابن، نمير قالا حدثنا أبو خالد الأحمر، عن عبيد الله، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم كان يصلي إلى راحلته ‏.‏ وقال ابن نمير إن النبي صلى الله عليه وسلم صلى إلى بعير ‏.‏",
      "text_en": " Ibn 'Umar reported:                      The Apostle of Allah (may peace be upon him) used to say prayer towards his camel. Ibn Numair said: The Apostle of Allah (may peace be upon him) said prayer towards the camel.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30212",
        "20326",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-1336",
      "hadith_no": "1336",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا قتيبة، حدثنا ليث، عن ابن عجلان، ح قال وحدثنا أبو بكر بن أبي شيبة، - واللفظ له - قال حدثنا أبو خالد الأحمر، عن ابن عجلان، عن عامر بن عبد الله بن الزبير، عن أبيه، قال كان رسول الله صلى الله عليه وسلم إذا قعد يدعو وضع يده اليمنى على فخذه اليمنى ويده اليسرى على فخذه اليسرى وأشار بإصبعه السبابة ووضع إبهامه على إصبعه الوسطى ويلقم كفه اليسرى ركبته ‏.‏",
      "text_en": " 'Abdullah b. Zubair narrated on the authority of his father that when the Messenger of Allah (may peace be upon him) sat for supplication, i. e. tashahhud (blessing and supplication), he placed his right hand on his right thigh and his left hand on his left thigh, and pointed with his forefinger, and placed his thumb on his (milddle) finger, and covered his knee with the palm of his left hand..",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20023",
        "10616",
        "20326",
        "10616",
        "11178",
        "106"
      ]
    },
    {
      "id": "sahih-muslim-1364",
      "hadith_no": "1364",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثناه ابن نمير، حدثنا أبو خالد، - يعني الأحمر - عن عاصم، بهذا الإسناد وقال ‏\"‏ يا ذا الجلال والإكرام ‏\"‏ ‏.‏",
      "text_en": " Ibn Numair narrated it with the same chain of transmitters and said:                      O Possessor of Glory and Honour.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20326"
      ]
    },
    {
      "id": "sahih-muslim-1562",
      "hadith_no": "1562",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا شعبة، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن سعيد بن أبي عروبة، ح وحدثني أبو غسان المسمعي، حدثنا معاذ، - وهو ابن هشام - حدثني أبي كلهم، عن قتادة، بهذا الإسناد مثله ‏.‏",
      "text_en": " A hadith like this has been narrated by Qatida with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20031",
        "20020",
        "30201",
        "20326",
        "11073",
        "30456",
        "20287"
      ]
    },
    {
      "id": "sahih-muslim-1564",
      "hadith_no": "1564",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو سعيد الأشج كلاهما عن أبي خالد، - قال أبو بكر حدثنا أبو خالد الأحمر، - عن الأعمش، عن إسماعيل بن رجاء، عن أوس بن ضمعج، عن أبي مسعود الأنصاري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يؤم القوم أقرؤهم لكتاب الله فإن كانوا في القراءة سواء فأعلمهم بالسنة فإن كانوا في السنة سواء فأقدمهم هجرة فإن كانوا في الهجرة سواء فأقدمهم سلما ولا يؤمن الرجل الرجل في سلطانه ولا يقعد في بيته على تكرمته إلا بإذنه ‏\"‏ ‏.‏ قال الأشج في روايته مكان سلما سنا ‏.‏",
      "text_en": " Abu Mas'ud al-Ansari reported Allah's Messenger (may peace be upon him) as saying:                      The one who is most versed in Allah's Book should act as Imam for the people, but If they are equally versed in reciting it, then the one who has most knowledge regarding Sunnah if they are equal regarding the Sunnah, then the earliest one to emigrate; it they emigrated at the same time, then the earliest one to embrace Islam. No man must lead another in prayer where (the latter) has authority, or sit in his place of honour in his house, without his permission. Ashajj in his narration used the word,\" age\" in place of\" Islam\".",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30200",
        "20436",
        "20326",
        "11060",
        "10740",
        "10744",
        "402"
      ]
    },
    {
      "id": "sahih-muslim-1645",
      "hadith_no": "1645",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن عبيد الله، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم كان يصلي على راحلته حيث توجهت به ‏.‏",
      "text_en": " Ibn 'Umar reported that the Apostle (may peace be upon him) used to pray on (the back of) his camel in whatever direction it took him.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-1725",
      "hadith_no": "1725",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن عثمان بن حكيم، عن سعيد بن يسار، عن ابن عباس، قال كان رسول الله صلى الله عليه وسلم يقرأ في ركعتى الفجر ‏{‏ قولوا آمنا بالله وما أنزل إلينا‏}‏ والتي في آل عمران ‏{‏ تعالوا إلى كلمة سواء بيننا وبينكم‏}‏",
      "text_en": " Ibn 'Abbas reported that the Messenger of Allah (may peace be upon him) used to recite in the two (supererogatory) rak'ahs of the dawn prayer:                     \" Say: We believed in Allah and what was revealed to us\" and that which is found in Surah Al-i-'lmran:\" Come to that word (creed) which is common between you and us\" (iii. 64).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "11889",
        "11170",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-1876",
      "hadith_no": "1876",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا زهير بن حرب، ومحمد بن المثنى، وعبيد الله بن سعيد، قالوا حدثنا يحيى، وهو القطان ح وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، ح وحدثنا ابن نمير، حدثنا أبي كلهم، عن عبيد الله، ح وحدثنا ابن أبي عمر، حدثنا عبد الرزاق، أخبرنا معمر، عن أيوب، ح وحدثنا قتيبة بن سعيد، حدثنا يعقوب يعني ابن عبد الرحمن، ح وحدثنا محمد بن إسحاق المسيبي حدثنا أنس، - يعني ابن عياض - جميعا عن موسى بن عقبة، كل هؤلاء عن نافع، عن ابن عمر، عن النبي ‏.‏ بمعنى حديث مالك وزاد في حديث موسى بن عقبة ‏\"‏ وإذا قام صاحب القرآن فقرأه بالليل والنهار ذكره وإذا لم يقم به نسيه ‏\"‏",
      "text_en": " 'Abdullah reported Allah's Messenger (may peace be upon him) as saying:                      What a wretched person is he amongst them who says: I have forgotten such and such a verse. (He should instead of using this expression say): I have been made to forget it. Try to remember the Qur'an for it is more apt to escape from men's minds than a hobbled camel.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30170",
        "30359",
        "20031",
        "20031",
        "30201",
        "20326",
        "30212",
        "11201",
        "30421",
        "20121",
        "20115",
        "11015",
        "30367"
      ]
    },
    {
      "id": "sahih-muslim-2164",
      "hadith_no": "2164",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا أبو بكر، وعثمان، ابنا أبي شيبة ح وحدثني عمرو الناقد، قالوا جميعا حدثنا أبو خالد الأحمر، عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لقنوا موتاكم لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Exhort to recite\" There is no god but Allah\" to those of you who are dying.",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "30263",
        "20326",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-2546",
      "hadith_no": "2546",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا هشيم، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا حفص بن غياث، وأبو خالد الأحمر ح وحدثنا محمد بن المثنى، حدثنا عبد الوهاب، وابن، أبي عدي وعبد الأعلى كلهم عن داود، ح وحدثني زهير بن حرب، - واللفظ له - قال حدثنا إسماعيل بن إبراهيم، أخبرنا داود، عن الشعبي، عن جرير بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أتاكم المصدق فليصدر عنكم وهو عنكم راض ‏\"‏ ‏.‏",
      "text_en": " Jarir b. 'Abdullah said:                      'When the collector of sadaqat (Zakat) comes to you, (you should see) that he goes away pleased with you.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20468",
        "30201",
        "20317",
        "20326",
        "30170",
        "20259",
        "20276",
        "30022",
        "20208",
        "11052"
      ]
    },
    {
      "id": "sahih-muslim-2594",
      "hadith_no": "2594",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا ابن نمير، حدثنا أبو خالد، - يعني الأحمر - عن سليمان التيمي، بهذا الإسناد غير أنه قال ‏\"‏ إن الفجر ليس الذي يقول هكذا ‏\"‏ ‏.‏ وجمع أصابعه ثم نكسها إلى الأرض ‏\"‏ ولكن الذي يقول هكذا ‏\"‏ ‏.‏ ووضع المسبحة على المسبحة ومد يديه ‏.‏",
      "text_en": " This hadith has been narrated by Sulaiman al-Taimi with the same chain of transmitters (but with a slight variation of words) that he (the Holy Prophet) said:                      The dawn is not like it as it is said; he then gathered his fingers and lowered them. But he said, it is like this (and he placed the index finger upon the other one and spread his hand).",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20326"
      ]
    },
    {
      "id": "sahih-muslim-2677",
      "hadith_no": "2677",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن حميد، قال خرجت فصمت فقالوا لي أعد ‏.‏ قال فقلت إن أنسا أخبرني أن أصحاب رسول الله صلى الله عليه وسلم كانوا يسافرون فلا يعيب الصائم على المفطر ولا المفطر على الصائم ‏.‏ فلقيت ابن أبي مليكة فأخبرني عن عائشة - رضى الله عنها - بمثله ‏.‏",
      "text_en": " Abu Khalid al-Ahmar narrated from Humaid who said:                      I went out and was fasting; they said to me: Break (lit go back, repeat). He said that Anas reported that the Companions of the Messenger of Allah (may peace be upon him) used to set out on a journey and neither the observer of the fast found fault with the breaker of the fast, nor the breaker of the fast found fault with the observer of the fast. (One of the narrators Humaid said): I met Ibn Abi Mulaika who informed me the same thing on the authority of 'A'isha.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "11279",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-2751",
      "hadith_no": "2751",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا أبو سعيد الأشج، حدثنا أبو خالد الأحمر، حدثنا الأعمش، عن سلمة، بن كهيل والحكم بن عتيبة ومسلم البطين عن سعيد بن جبير، ومجاهد، وعطاء، عن ابن، عباس - رضى الله عنهما - عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn 'Abbas (Allah be pleased with them) from the Apostle of Allah (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30200",
        "20326",
        "11060",
        "11350",
        "11050",
        "11028",
        "11029",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-3124",
      "hadith_no": "3124",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وابن، نمير جميعا عن أبي خالد، - قال أبو بكر حدثنا أبو خالد الأحمر، - عن عبيد الله، عن نافع، قال رأيت ابن عمر يستلم الحجر بيده ثم قبل يده وقال ما تركته منذ رأيت رسول الله صلى الله عليه وسلم يفعله ‏.‏",
      "text_en": " NAfi' (Allah be pleased with him) reported:                      I saw'lbn 'Umar (Allah be pleased with them) touching the Stone with his hand and then kissing his hand. and he said: I have never abandoned it since I saw Allah's Messenger (way peace be upon him) doing It.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20436",
        "20326",
        "11201",
        "11014"
      ]
    },
    {
      "id": "sahih-muslim-3201",
      "hadith_no": "3201",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، وابن، إدريس عن ابن، جريج عن أبي الزبير، عن جابر، قال رمى رسول الله صلى الله عليه وسلم الجمرة يوم النحر ضحى وأما بعد فإذا زالت الشمس ‏.‏",
      "text_en": " Jabir (Allah be pleased with him) reported that Allah's Messenger (may peace be upon him) flung pebbles at jamra on the Day of Nahr after sunrise, and after that (i. e. on the 11th, 12th and 13th of Dhu'l-Hijja when the sun had declined.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "20102",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-3537",
      "hadith_no": "3537",
      "source": "Sahih Muslim",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا يحيى بن أيوب، حدثنا هشيم، ح وحدثنا ابن نمير، حدثنا وكيع، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، ح وحدثنا محمد بن المثنى، حدثنا يحيى، - وهو القطان - عن عبد الحميد بن جعفر، عن يزيد بن أبي حبيب، عن مرثد بن عبد، الله اليزني عن عقبة بن عامر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أحق الشرط أن يوفى به ما استحللتم به الفروج ‏\"‏ ‏.‏ هذا لفظ حديث أبي بكر وابن المثنى ‏.‏ غير أن ابن المثنى قال ‏\"‏ الشروط ‏\"‏ ‏.‏",
      "text_en": " 'Uqba b. Amir (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      The most worthy condition which must be fulfilled is that which makes sexual intercourse lawful. In the narration transmitted by Ibn Muthanna (instead of the word\" condition\" ) it is\" conditions\".",
      "usc_msa_ref": "",
      "chain": [
        "20379",
        "20468",
        "30212",
        "20032",
        "30201",
        "20326",
        "30170",
        "20031",
        "11875",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "id": "sahih-muslim-4079",
      "hadith_no": "4079",
      "source": "Sahih Muslim",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا أبو خالد الأحمر، عن سعد بن طارق، عن ربعي، بن حراش عن حذيفة، قال ‏\"‏ أتي الله بعبد من عباده آتاه الله مالا فقال له ماذا عملت في الدنيا - قال ولا يكتمون الله حديثا - قال يا رب آتيتني مالك فكنت أبايع الناس وكان من خلقي الجواز فكنت أتيسر على الموسر وأنظر المعسر ‏.‏ فقال الله أنا أحق بذا منك تجاوزوا عن عبدي ‏\"‏ ‏.‏ فقال عقبة بن عامر الجهني وأبو مسعود الأنصاري هكذا سمعناه من في رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Hudhaifa (Allah be pleased with him) reported:                      A servant from amongst the servants of Allah was brought to Him whom Allah had endowed with riches. He (Allah) said to him: What (did you do) in the world? (They cannot conceal anything from Allah) He (the person) said: O my Lord, You endowed me with Your riches. I used to enter into transactions with people. It was my nature to be lenient to (my debtors). I showed leniency to the solvent and gave respite to the insolvent, whereupon Allah said: I have more right than you to do this to connive at My servant. 'Uqba b. 'Amir al-Juhani and Abu Mas'ud said: This is what we heard from Allah's Messenger (may peace be upon him).",
      "usc_msa_ref": "",
      "chain": [
        "30200",
        "20326",
        "10766",
        "11334",
        "145"
      ]
    },
    {
      "id": "sahih-muslim-4975",
      "hadith_no": "4975",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن شعبة، عن قتادة، وحميد، عن أنس بن مالك، عن النبي صلى الله عليه وسلم قال ‏\"‏ ما من نفس تموت لها عند الله خير يسرها أنها ترجع إلى الدنيا ولا أن لها الدنيا وما فيها إلا الشهيد فإنه يتمنى أن يرجع فيقتل في الدنيا لما يرى من فضل الشهادة ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Anas b. Malik that the Messenger of Allah (may peace be upon him) said:                     \" Nobody who dies and has something good for him with Allah will (ever like to) return to this world even though he were offered the whole world and all that is in its (as an inducement), except the martyr who desires to return and be killed in the world for the (great) merit of martyrdom that he has seen.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "20020",
        "11019",
        "11279",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-5037",
      "hadith_no": "5037",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن رمح بن المهاجر، أخبرنا الليث، ح وحدثنا أبو الربيع العتكي، حدثنا حماد بن زيد، ح وحدثنا محمد بن المثنى، حدثنا عبد الوهاب يعني الثقفي، ح وحدثنا  إسحاق بن إبراهيم، أخبرنا أبو خالد الأحمر، سليمان بن حيان ح وحدثنا محمد بن عبد، الله بن نمير حدثنا حفص، - يعني ابن غياث - ويزيد بن هارون ح وحدثنا محمد بن، العلاء الهمداني حدثنا ابن المبارك، ح وحدثنا ابن أبي عمر، حدثنا سفيان، كلهم عن يحيى، بن سعيد بإسناد مالك ومعنى حديثه وفي حديث سفيان سمعت عمر بن الخطاب على المنبر يخبر عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " It has been narrated through a different chain of transmitters on the authority of Sufyan who said that he heard 'Umar b. al-Khattab relate (this tradition) from the Holy Prophet (may peace be upon him) while he was delivering a sermon from the pulpit.",
      "usc_msa_ref": "",
      "chain": [
        "30490",
        "20023",
        "20022",
        "30170",
        "20259",
        "30123",
        "20326",
        "30212",
        "20317"
      ]
    },
    {
      "id": "sahih-muslim-5240",
      "hadith_no": "5240",
      "source": "Sahih Muslim",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، سليمان بن حيان عن منصور، بن حيان عن أبي الطفيل، قال قلنا لعلي بن أبي طالب أخبرنا بشىء، أسره إليك رسول الله صلى الله عليه وسلم فقال ما أسر إلى شيئا كتمه الناس ولكني سمعته يقول ‏\"‏ لعن الله من ذبح لغير الله ولعن الله من آوى محدثا ولعن الله من لعن والديه ولعن الله من غير المنار ‏\"‏ ‏.‏",
      "text_en": " Abu Tufail reported:                      We said to 'Ali b. Abi Talib: Inform us about something which Allah's Messenger (may peace be upon him) told you in secret, whereupon he said: He told me nothing in secret which he bid from people, but I heard him say: Allah cursed him who sacrificed for anyone besides Allah; and cursed him who accommodated an innovator; and Allah cursed him who cursed his parents and Allah cursed him who changed the boundary lines (of the land possessed by him).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "10969",
        "3660"
      ]
    },
    {
      "id": "sahih-muslim-5744",
      "hadith_no": "5744",
      "source": "Sahih Muslim",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن هشام، عن أبيه، عن  عائشة، قالت جئنا بعبد الله بن الزبير إلى النبي صلى الله عليه وسلم يحنكه فطلبنا تمرة فعز علينا طلبها ‏.‏",
      "text_en": " 'A'isha reported:                      We took 'Abdullah b. Zubair to Allah's Apostle (may peace be upon him) so that he should put saliva in his mouth and we had to make a good deal of effort in order to procure them.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-5997",
      "hadith_no": "5997",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن هشام، عن محمد، عن  أبي هريرة، عن النبي صلى الله عليه وسلم ‏\"‏ أن امرأة بغيا رأت كلبا في يوم حار يطيف ببئر قد أدلع لسانه من العطش فنزعت له بموقها فغفر لها ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may pace be upon him) as saying:                      A prostitute saw a dog moving around a well on a hot day and hanging out its tongue because of thirst. She drew water for it in her shoe and she was pardoned (for this act of hers).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "11065",
        "20278",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-6178",
      "hadith_no": "6178",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا أبو معاوية، ووكيع، ح وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا أبو سعيد الأشج، حدثنا أبو خالد، - يعني الأحمر - كلهم عن الأعمش، بهذا الإسناد مثله ‏.‏",
      "text_en": " This hadith had been narrated on the authority of al-A'mash through another chain of transmitters also.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20354",
        "20032",
        "30212",
        "20331",
        "30200",
        "20326"
      ]
    },
    {
      "id": "sahih-muslim-7123",
      "hadith_no": "7123",
      "source": "Sahih Muslim",
      "chapter": "The Book of Heart-Melting Traditions - كتاب الرقاق",
      "chapter_no": "50",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وابن، نمير قالا حدثنا أبو خالد الأحمر، ح وحدثنا  يحيى بن يحيى، أخبرنا هشيم، ح وحدثنا إسحاق بن إبراهيم، أخبرنا جرير، كلهم عن  سليمان التيمي، بهذا الإسناد مثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Sulaiman Taimi with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30212",
        "20326",
        "30399",
        "20468",
        "30123"
      ]
    },
    {
      "id": "sahih-muslim-7378",
      "hadith_no": "7378",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وابن، نمير قالا حدثنا أبو خالد الأحمر، عن حاتم، بن أبي صغيرة بهذا الإسناد ولم يذكر في حديثه ‏\"‏ غرلا ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Hatim b. Abi Saghira with the same chain of transmitters and there is no mention of the word\" uncircum- cised.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30212",
        "20326"
      ]
    },
    {
      "id": "sahih-muslim-7383",
      "hadith_no": "7383",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا محمد بن إسحاق المسيبي، حدثنا أنس يعني ابن عياض، ح وحدثني  سويد بن سعيد، حدثنا حفص بن ميسرة، كلاهما عن موسى بن عقبة، ح وحدثنا أبو بكر، بن أبي شيبة حدثنا أبو خالد الأحمر، وعيسى بن يونس، عن ابن عون، ح وحدثني عبد، الله بن جعفر بن يحيى حدثنا معن، حدثنا مالك، ح وحدثني أبو نصر التمار، حدثنا حماد، بن سلمة عن أيوب، ح وحدثنا الحلواني، وعبد بن حميد، عن يعقوب بن إبراهيم بن سعد، حدثنا أبي، عن صالح، كل هؤلاء عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ‏.‏ بمعنى حديث عبيد الله عن نافع ‏.‏ غير أن في حديث موسى بن عقبة وصالح ‏\"‏ حتى يغيب أحدهم في رشحه إلى أنصاف أذنيه ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Ibn 'Umar but with a slight variation of wording (and the words are):                     \" One of them would be completely submerged in perspiration up to half of his ears.\"",
      "usc_msa_ref": "",
      "chain": [
        "30413",
        "20157",
        "30547",
        "20421",
        "11106",
        "30201",
        "20326",
        "20347",
        "11071",
        "30112",
        "20001"
      ]
    },
    {
      "id": "sahih-muslim-7678",
      "hadith_no": "7678",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "وحدثنا أبو كريب، حدثنا أبو خالد، - يعني الأحمر - عن سليمان التيمي، عن  أنس، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Anas through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20326",
        "11289",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-1393",
      "hadith_no": "1393",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا مسدد، أخبرنا قران بن تمام، ح وحدثنا عبد الله بن سعيد، أخبرنا أبو خالد، - وهذا لفظه - عن عبد الله بن عبد الرحمن بن يعلى، عن عثمان بن عبد الله بن أوس، عن جده، - قال عبد الله بن سعيد في حديثه أوس بن حذيفة - قال قدمنا على رسول الله صلى الله عليه وسلم في وفد ثقيف - قال - فنزلت الأحلاف على المغيرة بن شعبة وأنزل رسول الله صلى الله عليه وسلم بني مالك في قبة له ‏.‏ قال مسدد وكان في الوفد الذين قدموا على رسول الله صلى الله عليه وسلم من ثقيف قال كان كل ليلة يأتينا بعد العشاء يحدثنا ‏.‏ قال أبو سعيد قائما على رجليه حتى يراوح بين رجليه من طول القيام وأكثر ما يحدثنا ما لقي من قومه من قريش ثم يقول لا سواء كنا مستضعفين مستذلين - قال مسدد بمكة - فلما خرجنا إلى المدينة كانت سجال الحرب بيننا وبينهم ندال عليهم ويدالون علينا فلما كانت ليلة أبطأ عن الوقت الذي كان يأتينا فيه فقلنا لقد أبطأت عنا الليلة ‏.‏ قال إنه طرأ على جزئي من القرآن فكرهت أن أجيء حتى أتمه ‏.‏ قال أوس سألت أصحاب رسول الله صلى الله عليه وسلم كيف يحزبون القرآن قالوا ثلاث وخمس وسبع وتسع وإحدى عشرة وثلاث عشرة وحزب المفصل وحده ‏.‏ قال أبو داود وحديث أبي سعيد أتم ‏.‏",
      "text_en": " Narrated Aws ibn Hudhayfah:                     We came upon the Messenger of Allah (ﷺ) in a deputation of Thaqif. The signatories of the pact came to al-Mughirah ibn Shu'bah as his guests. The Messenger of Allah (ﷺ) made Banu-Malik stay in a tent of his.  Musaddad's version says: He was in the deputation of Thaqif which came to the Messenger of Allah (ﷺ). He used to visit and have a talk with us every day after the night prayer.  The version of AbuSa'id says: He remained standing for such a long time (talking to us) that he put his weight sometimes on one leg and sometimes on the other due to his long stay. He mostly told us how his people, the Quraysh, behaved with him.  He would say: We were not equal; we were weak and degraded at Mecca (according to Musaddad's version). When we came over to Medina the fighting began between us; sometimes we overcome them and at other times they overcome us. One night he came late and did not come at the time he used to come.  We asked him: You came late tonight?  He said: I could not recite the fixed part of the Qur'an that I used to recite every day. I disliked to come till I had completed it.  Aws said: I asked the companions of the Messenger of Allah (ﷺ): How do you divide the Qur'an for daily recitation?  They said: Three surahs, five surahs, eleven surahs, thirteen surahs' mufassal surahs.Abu Dawud said: The version of Abu Sa'id is complete.",
      "usc_msa_ref": "",
      "chain": [
        "30175",
        "25244",
        "30200",
        "20326",
        "20658",
        "18713",
        "3219"
      ]
    },
    {
      "id": "sunan-abi-daud-1729",
      "hadith_no": "1729",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا أبو خالد، - يعني سليمان بن حيان الأحمر - عن ابن جريج، عن عمر بن عطاء، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا صرورة في الإسلام ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: Islam does not allow for failure to perform the hajj.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20326",
        "11070",
        "13541",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-abi-daud-1767",
      "hadith_no": "1767",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا أبو خالد الأحمر، عن ابن جريج، عن أبي الزبير، عن جابر، وأخبرني عبد الرحمن بن سابط، أن النبي صلى الله عليه وسلم وأصحابه كانوا ينحرون البدنة معقولة اليسرى قائمة على ما بقي من قوائمها ‏.‏",
      "text_en": " `Abd al Rahman bin Thabit said:                      The Prophet (SWAS) and his companions used to sacrifice the camel with its left leg tied and it remained standing on the rest of his legs.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20326",
        "11070",
        "11263",
        "34",
        "10646"
      ]
    },
    {
      "id": "sunan-abi-daud-1973",
      "hadith_no": "1973",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا علي بن بحر، وعبد الله بن سعيد، - المعنى - قالا حدثنا أبو خالد الأحمر، عن محمد بن إسحاق، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت أفاض رسول الله صلى الله عليه وسلم من آخر يومه حين صلى الظهر ثم رجع إلى منى فمكث بها ليالي أيام التشريق يرمي الجمرة إذا زالت الشمس كل جمرة بسبع حصيات يكبر مع كل حصاة ويقف عند الأولى والثانية فيطيل القيام ويتضرع ويرمي الثالثة ولا يقف عندها ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Messenger of Allah (ﷺ) performed the obligatory circumambulation of the Ka'bah at the end of the day of sacrifice after he had offered the noon prayer. He hen returned to Mina and stayed there during the tashriq days and he threw pebbles at the jamrahs when the sun declined. He threw seven pebbles at each of the jamrahs, uttering the takbir (Allah is most great) at the time of the throwing the pebble. He stood at the first and the second jamrah, and prolonged his standing there, making supplications with humilation. He threw pebbles at the third jamrah but did not stand there.",
      "usc_msa_ref": "",
      "chain": [
        "36596",
        "20326",
        "11107",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-2334",
      "hadith_no": "2334",
      "source": "Sunan Abi Da'ud",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبو خالد الأحمر، عن عمرو بن قيس، عن أبي إسحاق، عن صلة، قال كنا عند عمار في اليوم الذي يشك فيه فأتي بشاة فتنحى بعض القوم فقال عمار من صام هذا اليوم فقد عصى أبا القاسم صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Ammar:                     AbuIshaq reported on the authority of Silah: We were with Ammar on the day when the appearance of the moon was doubtful. (The meat of) goat was brought to him. Some people kept aloof from (eating) it. Ammar said: He who keeps fast on this day disobeys AbulQasim (i.e. the Prophet) (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20326",
        "213",
        "11049"
      ]
    },
    {
      "id": "sunan-abi-daud-5209",
      "hadith_no": "5209",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن أبي غفار، عن أبي تميمة الهجيمي، عن أبي جرى الهجيمي، قال أتيت النبي صلى الله عليه وسلم فقلت عليك السلام يا رسول الله ‏.‏ قال ‏\"‏ لا تقل عليك السلام فإن عليك السلام تحية الموتى ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuJurayy al-Hujaymi:                     I came to the Prophet (ﷺ) and said: Upon you be peace, Messenger of Allah! He said: Do not say: Upon you be peace, for \"Upon you be peace\" is the salutation to the dead.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "11597"
      ]
    },
    {
      "id": "jami-al-tirmidhi-274",
      "hadith_no": "274",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو خالد الأحمر، عن داود بن قيس، عن عبيد الله بن عبد الله بن الأقرم الخزاعي، عن أبيه، قال كنت مع أبي بالقاع من نمرة فمرت ركبة فإذا رسول الله صلى الله عليه وسلم قائم يصلي ‏.‏ قال فكنت أنظر إلى عفرتى إبطيه إذا سجد أى بياضه ‏.‏ قال وفي الباب عن ابن عباس وابن بحينة وجابر وأحمر بن جزء وميمونة وأبي حميد وأبي مسعود وأبي أسيد وسهل بن سعد ومحمد بن مسلمة والبراء بن عازب وعدي بن عميرة وعائشة ‏.‏ قال أبو عيسى وأحمر بن جزء هذا رجل من أصحاب النبي صلى الله عليه وسلم له حديث واحد ‏.‏ قال أبو عيسى حديث عبد الله بن أقرم حديث حسن لا نعرفه إلا من حديث داود بن قيس ولا نعرف لعبد الله بن أقرم الخزاعي عن النبي صلى الله عليه وسلم غير هذا الحديث ‏.‏ والعمل عليه عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم ‏.‏ قال وعبد الله بن أقرم الخزاعي إنما له هذا الحديث عن النبي صلى الله عليه وسلم ‏.‏ وعبد الله بن أرقم الزهري صاحب النبي صلى الله عليه وسلم ‏.‏ وهو كاتب أبي بكر الصديق ‏.‏",
      "text_en": " Ubaidallah bin Abdullah bin Arqam Al-Khuza'I narrated from his father (Abdullah bin Arqam), who said:                     \"I was with my father at the plains of Namirah. I passed by a mount and saw Allah's Messenger standing in Salat.\" He said: \"I was looking at the earthiness of his armpits when he prostrated.\" [That is]: \"Whiteness.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20326",
        "11845"
      ]
    },
    {
      "id": "jami-al-tirmidhi-352",
      "hadith_no": "352",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا أبو خالد الأحمر، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم صلى إلى بعيره أو راحلته وكان يصلي على راحلته حيثما توجهت به ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وهو قول بعض أهل العلم لا يرون بالصلاة إلى البعير بأسا أن يستتر به ‏.‏",
      "text_en": " Ibn Umar narrated:                     \"The Prophet performed Salat towards his she-camel, or his mount, and he would perform Salat while on his mount, whichever direction it was facing.\"",
      "usc_msa_ref": "",
      "chain": [
        "35047",
        "20326",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-526",
      "hadith_no": "526",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا عبدة بن سليمان، وأبو خالد الأحمر عن محمد بن إسحاق، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا نعس أحدكم يوم الجمعة فليتحول من مجلسه ذلك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Ibn Umar narrated that :                     the Prophet said: \"When one of you becomes sleepy during the Friday prayer, then let him move from where he is sitting.\"",
      "usc_msa_ref": "",
      "chain": [
        "30200",
        "20337",
        "20326",
        "11107",
        "11014",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-686",
      "hadith_no": "686",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو سعيد عبد الله بن سعيد الأشج، حدثنا أبو خالد الأحمر، عن عمرو بن قيس الملائي، عن أبي إسحاق، عن صلة بن زفر، قال كنا عند عمار بن ياسر فأتي بشاة مصلية فقال كلوا ‏.‏ فتنحى بعض القوم فقال إني صائم ‏.‏ فقال عمار من صام اليوم الذي يشك فيه الناس فقد عصى أبا القاسم صلى الله عليه وسلم ‏.‏ قال وفي الباب عن أبي هريرة وأنس ‏.‏ قال أبو عيسى حديث عمار حديث حسن صحيح ‏.‏ والعمل على هذا عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم من التابعين وبه يقول سفيان الثوري ومالك بن أنس وعبد الله بن المبارك والشافعي وأحمد وإسحاق كرهوا أن يصوم الرجل اليوم الذي يشك فيه ورأى أكثرهم إن صامه فكان من شهر رمضان أن يقضي يوما مكانه ‏.‏",
      "text_en": " Silah bin Zufar said:                     \"We were with Ammar bin Yasir when a roasted sheep was brought and he said: 'Eat.' Someone among the people said: 'I am fasting.' So Ammar said: 'Whoever fasts on a day in which there is doubt, then he has disobeyed Abul-Qasim (pbuh).\"",
      "usc_msa_ref": "",
      "chain": [
        "30200",
        "20326",
        "10803",
        "11049",
        "11354"
      ]
    },
    {
      "id": "jami-al-tirmidhi-716",
      "hadith_no": "716",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا أبو خالد الأحمر، عن الأعمش، عن سلمة بن كهيل، ومسلم البطين، عن سعيد بن جبير، وعطاء، ومجاهد، عن ابن عباس، قال جاءت امرأة إلى النبي صلى الله عليه وسلم فقالت إن أختي ماتت وعليها صوم شهرين متتابعين ‏.‏ قال ‏\"‏ أرأيت لو كان على أختك دين أكنت تقضينه ‏\"‏ ‏.‏ قالت نعم ‏.‏ قال ‏\"‏ فحق الله أحق ‏\"‏ ‏.‏ قال وفي الباب عن بريدة وابن عمر وعائشة ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"A woman came to the Prophet and said: 'My sister died while she had two consecutive months of fasting due.' So he said: 'Do you not see that if there was a debt due from your sister then you would have to pay it?' She said: 'Yes.' He said: 'Then the right of Allah is more appropriate.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30200",
        "20326",
        "11060",
        "11350",
        "11393",
        "11050",
        "11029",
        "11028",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-717",
      "hadith_no": "717",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو خالد الأحمر، عن الأعمش، بهذا الإسناد نحوه ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح ‏.‏ قال وسمعت محمدا، يقول جود أبو خالد الأحمر هذا الحديث عن الأعمش، ‏.‏ قال محمد وقد روى غير أبي خالد، عن الأعمش، مثل رواية أبي خالد ‏.‏ قال أبو عيسى وروى أبو معاوية، وغير، واحد، هذا الحديث عن الأعمش، عن مسلم البطين، عن سعيد بن جبير، عن ابن عباس، عن النبي صلى الله عليه وسلم ‏.‏ ولم يذكروا فيه سلمة بن كهيل ولا عن عطاء ولا عن مجاهد ‏.‏ واسم أبي خالد سليمان بن حيان ‏.‏",
      "text_en": " Ibn Abbas narrated:                     (A Hadith similar to no. 716 with a different chain.)",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20326",
        "11060",
        "11035"
      ]
    },
    {
      "id": "jami-al-tirmidhi-721",
      "hadith_no": "721",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا أبو خالد الأحمر، عن حجاج بن أرطاة، عن قتادة، عن ابن سيرين، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أكل أو شرب ناسيا فلا يفطر فإنما هو رزق رزقه الله ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Messenger of Allah said: \"Whoever eats or drinks forgetfully, then he has not broken (the fast), for it was only a provision hat Allah provided for him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30200",
        "20326",
        "20580",
        "11019",
        "11035",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-810",
      "hadith_no": "810",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا قتيبة بن سعيد، وأبو سعيد الأشج قالا حدثنا أبو خالد الأحمر، عن عمرو بن قيس، عن عاصم، عن شقيق، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تابعوا بين الحج والعمرة فإنهما ينفيان الفقر والذنوب كما ينفي الكير خبث الحديد والذهب والفضة وليس للحجة المبرورة ثواب إلا الجنة ‏\"‏ ‏.‏ قال وفي الباب عن عمر وعامر بن ربيعة وأبي هريرة وعبد الله بن حبشي وأم سلمة وجابر ‏.‏ قال أبو عيسى حديث ابن مسعود حديث حسن صحيح غريب من حديث عبد الله بن مسعود ‏.‏",
      "text_en": " Abdullah (bin Mas'ud) narrated that:                     The Messenger of Allah said: \"Alternate between Hajj and Umrah; for those two remove poverty and sins just as the bellows removes filth from iron, gold, and silver - and there is no reward for Al-Hajj Al-Mabrur except for Paradise.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30200",
        "20326",
        "213",
        "11080",
        "11353",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-895",
      "hadith_no": "895",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا قتيبة، حدثنا أبو خالد الأحمر، عن الأعمش، عن الحكم، عن مقسم، عن ابن عباس، أن النبي صلى الله عليه وسلم أفاض قبل طلوع الشمس ‏.‏ قال وفي الباب عن عمر ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن صحيح ‏.‏ وإنما كان أهل الجاهلية ينتظرون حتى تطلع الشمس ثم يفيضون ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Prophet departed before the rising of the sun.\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20326",
        "11060",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1046",
      "hadith_no": "1046",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا أبو خالد الأحمر، حدثنا الحجاج، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم كان إذا أدخل الميت القبر - وقال أبو خالد مرة إذا وضع الميت في لحده قال مرة ‏\"‏ بسم الله وبالله وعلى ملة رسول الله ‏\"‏ ‏.‏ وقال مرة ‏\"‏ بسم الله وبالله وعلى سنة رسول الله صلى الله عليه وسلم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏ وقد روي هذا الحديث من غير هذا الوجه عن ابن عمر عن النبي صلى الله عليه وسلم ‏.‏ ورواه أبو الصديق الناجي عن ابن عمر عن النبي صلى الله عليه وسلم وقد روي عن أبي الصديق الناجي عن ابن عمر موقوفا أيضا ‏.‏",
      "text_en": " Ibn Umar narrated:                     \"When he Prophet put the deceased in the grave\" He said: And Abu Khalid (one of the narrators) said [one time]: \"When he placed the deceased in the Lahd\" - \"He said one time: 'In the Name of Allah, by His command and upon the Millah of the Messenger of Allah.' and one time he said: 'In the Name of Allah, by His command and upon the Sunnah of the Messenger of Allah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30200",
        "20326",
        "20381",
        "11014",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1198",
      "hadith_no": "1198",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Suckling - كتاب الرضاع",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا أبو خالد الأحمر، عن الضحاك بن عثمان، عن مخرمة بن سليمان، عن كريب، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا ينظر الله إلى رجل أتى رجلا أو امرأة في الدبر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وروى وكيع هذا الحديث ‏.‏",
      "text_en": " Ibn Abbas narrated that The Messenger of Allah said:                      “Allah will not look at a man who enters a man or a woman in the behind.”",
      "usc_msa_ref": "",
      "chain": [
        "30200",
        "20326",
        "20504",
        "11223",
        "11211",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1400",
      "hadith_no": "1400",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا الأحمر، عن الحجاج بن أرطاة، عن عمرو بن شعيب، عن أبيه، عن جده، عن عمر بن الخطاب، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يقاد الوالد بالولد ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Umar bin Al-Khattab:                     that the Messenger of Allah (ﷺ) said: \"The father does not suffer retaliation for [killing] the son.\"",
      "usc_msa_ref": "",
      "chain": [
        "30200",
        "20326",
        "20580",
        "19934",
        "19911",
        "3"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1440",
      "hadith_no": "1440",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا أبو خالد الأحمر، حدثنا الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا زنت أمة أحدكم فليجلدها ثلاثا بكتاب الله فإن عادت فليبعها ولو بحبل من شعر ‏\"‏ ‏.‏ قال وفي الباب عن علي وأبي هريرة وزيد بن خالد وشبل عن عبد الله بن مالك الأوسي ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح وقد روي عنه من غير وجه ‏.‏ والعمل على هذا عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم رأوا أن يقيم الرجل الحد على مملوكه دون السلطان وهو قول أحمد وإسحاق ‏.‏ وقال بعضهم يرفع إلى السلطان ولا يقيم الحد هو بنفسه ‏.‏ والقول الأول أصح ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     That the Messenger of Allah (ﷺ) said: \"If one of your slave girl commits illegal sexual intercourse, then whip her three times according to the Book of Allah, and if she does it again then sell her, even if it is for a rope made of hair.\"",
      "usc_msa_ref": "",
      "chain": [
        "30200",
        "20326",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1535",
      "hadith_no": "1535",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Vows and Oaths - كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "20",
      "text_ar": "حدثنا قتيبة، حدثنا أبو خالد الأحمر، عن الحسن بن عبيد الله، عن سعد بن عبيدة، أن ابن عمر، سمع رجلا، يقول لا والكعبة ‏.‏ فقال ابن عمر لا يحلف بغير الله فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من حلف بغير الله فقد كفر أو أشرك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وفسر هذا الحديث عند بعض أهل العلم أن قوله ‏\"‏ فقد كفر أو أشرك ‏\"‏ على التغليظ ‏.‏ والحجة في ذلك حديث ابن عمر أن النبي صلى الله عليه وسلم سمع عمر يقول وأبي وأبي ‏.‏ فقال ‏\"‏ ألا إن الله ينهاكم أن تحلفوا بآبائكم ‏\"‏ ‏.‏ وحديث أبي هريرة عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ من قال في حلفه واللات والعزى فليقل لا إله إلا الله ‏\"‏ ‏.‏ قال أبو عيسى هذا مثل ما روي عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ إن الرياء شرك ‏\"‏ ‏.‏ وقد فسر بعض أهل العلم هذه الآية ‏:‏ ‏(‏ ومن كان يرجو لقاء ربه فليعمل عملا صالحا ‏)‏ الآية قال لا يرائي ‏.‏",
      "text_en": " Narrated Sa'd bin 'Ubaidah:                     That Ibn 'Umar heard a man saying: \"No by the Ka'bah\" so Ibn 'Umar said: \"Nothing is sworn by other than Allah, for I heard the Messenger of Allah (ﷺ) say: 'Whoever swears by other than Allah, he has committed disbelief or shirk.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20326",
        "10755",
        "11344",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1649",
      "hadith_no": "1649",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا أبو خالد الأحمر، عن ابن عجلان، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم والحجاج عن الحكم، عن مقسم، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ غدوة في سبيل الله أو روحة خير من الدنيا وما فيها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وأبو حازم الذي روى عن سهل بن سعد هو أبو حازم الزاهد وهو مدني واسمه سلمة بن دينار ‏.‏ وأبو حازم هذا الذي روى عن أبي هريرة هو أبو حازم الأشجعي الكوفي واسمه سلمان وهو مولى عزة الأشجعية ‏.‏",
      "text_en": " Narrated Abu Hurairah and Ibn 'Abbas:                     That the Prophet (ﷺ) said: \"Going out in the morning in the cause of Allah, or in the afternoon, is better than the world and what is in it.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. The Abu Hazim who reported from Ashl bin Sa'd is Abu Hazim Az-Zahid. He is from Al-Madinah, and his name is Salamah bin Dinar. While [this] Abu Hazim who reported from Abu Hurairah is Abu Hazim Al-Ashja'i Al-Kufi, whose name is Salman, and he is the freed slave of 'Azzah Al-Ashja'iyyah.",
      "usc_msa_ref": "",
      "chain": [
        "30200",
        "20326",
        "10616",
        "11349",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2409",
      "hadith_no": "2409",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا أبو خالد الأحمر، عن ابن عجلان، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من وقاه الله شر ما بين لحييه وشر ما بين رجليه دخل الجنة ‏\"‏ ‏.‏ قال أبو عيسى أبو حازم الذي روى عن أبي هريرة اسمه سلمان مولى عزة الأشجعية وهو كوفي وأبو حازم الذي روى عن سهل بن سعد هو أبو حازم الزاهد مدني واسمه سلمة بن دينار ‏.‏ وهذا حديث حسن غريب ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:                     \"For whomever Allah protects against the evil of what is between his jaws and the evil of what is between his legs, he shall enter Paradise.\"",
      "usc_msa_ref": "",
      "chain": [
        "30200",
        "20326",
        "10616",
        "11349",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3672",
      "hadith_no": "3672",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد الله بن سعيد أبو سعيد الأشج، حدثنا أبو خالد الأحمر، عن داود بن أبي هند، عن عكرمة، عن ابن عباس، قال كان النبي صلى الله عليه وسلم يصلي فجاء أبو جهل فقال ألم أنهك عن هذا ألم أنهك عن هذا ألم أنهك عن هذا فانصرف النبي صلى الله عليه وسلم فزبره فقال أبو جهل إنك لتعلم ما بها ناد أكثر مني فأنزل الله ‏:‏ ‏(‏ فليدع ناديه * سندع الزبانية ‏)‏ فقال ابن عباس فوالله لو دعا ناديه لأخذته زبانية الله ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏ وفيه عن أبي هريرة رضى الله عنه ‏.‏",
      "text_en": " Ibn Abbas narrated:                     “The Prophet was performing Salat when Abu Jahl came to him and said: ‘Have I not forbidden you from this? Have I not forbidden you from this? Have I not forbidden you from this?’ The Prophet turned and scolded him. So Abu Jahl said: ‘You know that no one has more to call for assistance than me.’ So Allah, Blessed is He and Most High, revealed: Then let him call upon his council. We will call out the guards of Hell.” So Ibn Abbas said: “By Allah, if he had called his council, then the guards of Hell would have seized him.”",
      "usc_msa_ref": "",
      "chain": [
        "20326",
        "11585",
        "11023",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3457-2",
      "hadith_no": "3457",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا حفص بن غياث، وأبو خالد الأحمر عن حجاج بن أرطاة، عن رياح بن عبيدة، قال حفص عن ابن أخي أبي سعيد، وقال أبو خالد، عن مولى، لأبي سعيد عن أبي سعيد، رضى الله عنه قال كان النبي صلى الله عليه وسلم إذا أكل أو شرب قال ‏\"‏ الحمد لله الذي أطعمنا وسقانا وجعلنا مسلمين ‏\"‏ ‏.‏",
      "text_en": " Abu Sa’eed  [may Allah be pleased with him] narrated that:                     When the Prophet used to eat or drink, he would say: “All praise is due to Allah who fed us and gave us drink, and made us Muslims (Al-Hamdulillah, Alladhi At’amana, Wa Saqana, Wa Ja’alana Muslimin).”",
      "usc_msa_ref": "",
      "chain": [
        "30200",
        "20317",
        "20326",
        "20580",
        "20317",
        "38"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3601-2",
      "hadith_no": "3601",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو خالد الأحمر، عن هشام بن الغاز، عن مكحول، عن أبي هريرة، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ أكثر من قول لا حول ولا قوة إلا بالله فإنها كنز من كنوز الجنة ‏\"‏ ‏.‏ قال مكحول فمن قال لا حول ولا قوة إلا بالله ولا منجا من الله إلا إليه ‏.‏ كشف عنه سبعين بابا من الضر أدناهن الفقر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث ليس إسناده بمتصل ‏.‏ مكحول لم يسمع من أبي هريرة ‏.‏",
      "text_en": " Abu Hurairah said:                     “The Messenger of Allah said to me: ‘Be frequent in saying: “There is no might or power except by Allah, (La Hawla Wa La Quwwata Illa Billah).” For verily, it is a treasure from the treasures of Paradise.’”",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20326",
        "20729",
        "11066",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4140",
      "hadith_no": "4140",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا أبو خالد الأحمر، حدثنا رزين، قال حدثتني سلمى، قالت دخلت على أم سلمة وهي تبكي فقلت ما يبكيك قالت رأيت رسول الله صلى الله عليه وسلم - تعني في المنام - وعلى رأسه ولحيته التراب فقلت ما لك يا رسول الله ‏.‏ قال ‏\"‏ شهدت قتل الحسين آنفا ‏\"‏ ‏.‏ قال هذا حديث غريب ‏.‏",
      "text_en": " Narrated Salma:                     \"I entered upon Umm Salamah while she was crying, so I said: 'What causes you to cry?' She said: 'I saw the Messenger of Allah - that is, in a dream - and there was was dirt on his head and his beard. so I said: \"What is wrong with you, O Messenger of Allah?\" He said: 'I just witnessed the killing of Al-Husain.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30200",
        "20326"
      ]
    },
    {
      "id": "sunan-an-nasai-921",
      "hadith_no": "921",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا الجارود بن معاذ الترمذي، قال حدثنا أبو خالد الأحمر، عن محمد بن عجلان، عن زيد بن أسلم، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما جعل الإمام ليؤتم به فإذا كبر فكبروا وإذا قرأ فأنصتوا وإذا قال سمع الله لمن حمده فقولوا اللهم ربنا لك الحمد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah (ﷺ) said: 'The Imam is appointed to be followed, so when he says the takbir, say the takbir, and when he recites, be silent, and when he says: \"Sami' Allahu liman hamidah (Allah hears those who praise Him),\" say: \"Allahumma rabbana lakal-hamd (Our Lord, to You be praise).\"",
      "usc_msa_ref": "",
      "chain": [
        "38130",
        "20326",
        "10616",
        "11163",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2001",
      "hadith_no": "2001",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا هارون بن إسحاق، قال حدثنا أبو خالد الأحمر، عن عمرو بن قيس، عن المنهال بن عمرو، عن زاذان، عن البراء، قال ‏:‏ خرجنا مع رسول الله صلى الله عليه وسلم في جنازة، فلما انتهينا إلى القبر ولم يلحد، فجلس وجلسنا حوله كأن على رءوسنا الطير ‏.‏",
      "text_en": " It was narrated that Al-Bark' said:                     \"We went out with the Messenger of Allah for a funeral, and when we reached the grave the Lahd had not yet been prepared. He sat, and we sat around him, as if there were birds on our heads.\"",
      "usc_msa_ref": "",
      "chain": [
        "35158",
        "20326",
        "213",
        "11656",
        "10911",
        "400"
      ]
    },
    {
      "id": "sunan-ibn-majah-11",
      "hadith_no": "11",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو سعيد عبد الله بن سعيد، حدثنا أبو خالد الأحمر، قال سمعت مجالدا، يذكر عن الشعبي، عن جابر بن عبد الله، قال كنا عند النبي  صلى الله عليه وسلم  فخط خطا وخط خطين عن يمينه وخط خطين عن يساره ثم وضع يده في الخط الأوسط فقال ‏\"‏ هذا سبيل الله ‏\"‏ ‏.‏ ثم تلا هذه الآية {وأن هذا صراطي مستقيما فاتبعوه ولا تتبعوا السبل فتفرق بكم عن سبيله}‏ ‏.‏",
      "text_en": " Jabir bin 'Abdullah said that:                     We were with the Prophet (ﷺ), and he drew a line (in the sand), then he drew two lines to its right and two to its left. Then he put his hand on the middle line and said : 'This is the path of Allah. Then he recited the Verse: And verily, this (i.e. Allah's Commandments) is My straight path, so follow it and follow not (other) paths, for they will separate you from His path...\"",
      "usc_msa_ref": "",
      "chain": [
        "20326",
        "11052",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-60",
      "hadith_no": "60",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن ابن عجلان، ح وحدثنا عمرو بن رافع، حدثنا جرير، عن سهيل، جميعا عن عبد الله بن دينار، عن أبي صالح، عن أبي هريرة، عن النبي  صلى الله عليه وسلم  نحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "10616",
        "18792",
        "4057",
        "11183",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-258",
      "hadith_no": "258",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن ابن عجلان، عن سعيد بن أبي سعيد، عن أبي هريرة، قال كان من دعاء النبي  صلى الله عليه وسلم  ‏\"‏ اللهم إني أعوذ بك من علم لا ينفع ومن دعاء لا يسمع ومن قلب لا يخشع ومن نفس لا تشبع ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"One of the supplications that the Prophet used to say was: 'Allahumma, inni a'udhu bika min 'ilmin la yanfa'u, wa mindu'a'in la yusma'u, wa min qalbin la yakhsha'u, wa min nafsin la tashba'u [O Allah, I seek refuge with You from knowledge that is of no benefit, from a supplication that is not heard, from a heart that does not fear (You) and from a soul that is not satisfied].'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "10616",
        "11168",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-370",
      "hadith_no": "370",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن ابن عجلان، عن أبيه، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يبولن أحدكم في الماء الراكد ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'No one among you should urinate into standing water.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "10616",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-488",
      "hadith_no": "488",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن الصباح، حدثنا عبد الله بن رجاء المكي، عن ابن عجلان، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن سعيد، وأبو خالد الأحمر عن محمد بن عجلان، عن سعيد بن أبي سعيد، عن أبي سلمة، قال رأت عائشة عبد الرحمن وهو يتوضأ فقالت أسبغ الوضوء فإني سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ ويل للعراقيب من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Salamah said:                     \"Aishah saw 'Abdur-Rahman performing abluti0on, and she said: Perform ablution properly, for I heard the Messenger of Allah say: 'Woe to the Achilles' tendon because of Hell-fire.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "23027",
        "10616",
        "30201",
        "20031",
        "20326",
        "10616",
        "11168",
        "10567"
      ]
    },
    {
      "id": "sunan-ibn-majah-621",
      "hadith_no": "621",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن ابن عجلان، عن سعيد بن أبي سعيد، عن أبي هريرة، سأله رجل كم أفيض على رأسي وأنا جنب قال كان رسول الله  صلى الله عليه وسلم  يحثو على رأسه ثلاث حثيات ‏.‏ قال الرجل إن شعري طويل ‏.‏ قال كان رسول الله  صلى الله عليه وسلم  أكثر شعرا منك وأطيب ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     A man asked him: \"How much water should I pour over my head when I m sexually impure?\" He said: \"the messenger of Allah used to pour three handfuls of water over his head.\" The man said: \"My hair is long.\" He said: \"The Messenger of Allah had more hair than you and he was cleaner.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "10616",
        "11168"
      ]
    },
    {
      "id": "sunan-ibn-majah-672",
      "hadith_no": "672",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر الصديق، قالت سئل رسول الله  صلى الله عليه وسلم  عن دم الحيض يكون في الثوب قال ‏\"‏ اقرصيه واغسليه وصلي فيه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Asma' bint Abi Bakr said:                     \"The Messenger of Allah was asked about menstrual blood that gets on clothing. He said: 'Rub it off, wash it and perform prayer in (the garment).'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "id": "sunan-ibn-majah-749",
      "hadith_no": "749",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا عبد الله بن سعيد الكندي، حدثنا أبو خالد الأحمر، عن ابن عجلان، عن عمرو بن شعيب، عن أبيه، عن جده، قال نهى رسول الله  صلى الله عليه وسلم  عن البيع والابتياع وعن تناشد الأشعار في المساجد ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib from his father that his grandfather said:                     \"The Messenger of Allah forbade buying and selling in the mosque, and reciting poetry in the mosque.\"",
      "usc_msa_ref": "",
      "chain": [
        "30200",
        "20326",
        "10616",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-ibn-majah-895",
      "hadith_no": "895",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن ابن عجلان، عن زيد بن أسلم، عن أبي صالح، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إنما جعل الإمام ليؤتم به فإذا كبر فكبروا وإذا قرأ فأنصتوا وإذا قال ‏{غير المغضوب عليهم ولا الضالين}‏ فقولوا آمين وإذا ركع فاركعوا وإذا قال سمع الله لمن حمده ‏.‏ فقولوا اللهم ربنا ولك الحمد وإذا سجد فاسجدوا وإذا صلى جالسا فصلوا جلوسا أجمعين ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Messenger of Allah (ﷺ)said: ‘The Imam has been appointed to be followed, so when he saysAllahu Akbar, then say Allahu Akbar, when he recites, then listenattentively; when he says: Not (the way) of those who earned Youranger, nor of those who went astray,[1:7] then say Amin; when he bowsthen bow; when he says Sami’ Allahu liman hamidah (Allah hearsthosewho praise Him), then say Allahumma Rabbana wa lakal-hamd (OAllah,our Lord, to You is the praise);” when he prostrates thenprostrate;and if he prays sitting down then all of you pray sittingdown.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "10616",
        "11163",
        "11161",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1007",
      "hadith_no": "1007",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو خالد الأحمر، عن ابن عجلان، عن زيد بن أسلم، عن عبد الرحمن بن أبي سعيد، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا صلى أحدكم فليصل إلى سترة وليدن منها ولا يدع أحدا يمر بين يديه فإن جاء أحد يمر فليقاتله فإنه شيطان ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdur-Rahman bin Abu Sa’eed that his fathersaid:                     “The Messenger of Allah (ﷺ) said: ‘When anyone of you performsprayer, let him pray facing towards a Sutrah, and let him get closetoit, and not let anyone pass in front of him. If someone comes andwants to pass in front of him, let him fight him, for he is a Shaitan(satan).’”",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20326",
        "10616",
        "11163",
        "11879",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-1189",
      "hadith_no": "1189",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا يوسف بن موسى القطان، حدثنا جرير، ح وحدثنا عبد الله بن سعيد، حدثنا أبو خالد الأحمر، جميعا عن محمد بن إسحاق، عن الزهري، عن السائب بن يزيد، قال ما كان لرسول الله  صلى الله عليه وسلم  إلا مؤذن واحد فإذا خرج أذن وإذا نزل أقام وأبو بكر وعمر كذلك فلما كان عثمان وكثر الناس زاد النداء الثالث على دار في السوق يقال لها الزوراء فإذا خرج أذن وإذا نزل أقام ‏.‏",
      "text_en": " It wasnarrated that Sa’ib bin Yazid said:                      “The Messenger of Allah(ﷺ)had only one Mu’adh-dhin. When he came out he would give theAdhanand when he came down (from the pulpit) he would give theIqamah. AbuBakr and ‘Umar did likewise, but when ‘Uthman (becamecaliph) thenumbers of people had increased, he added the third callfrom atop ahouse in the marketplace that was called Zawra’. When hecame out(the Mu’adh-dhin) would call the Adhan, and when he came downfromthe pulpit, he would call the Iqamah.",
      "usc_msa_ref": "",
      "chain": [
        "30224",
        "20028",
        "11184",
        "20326",
        "11107",
        "11013",
        "3048"
      ]
    },
    {
      "id": "sunan-ibn-majah-1264",
      "hadith_no": "1264",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا ابن نمير، وابن، فضيل ويزيد بن هارون ح وحدثنا عثمان بن أبي شيبة، حدثنا أبو خالد الأحمر، ويزيد بن هارون، وأبو معاوية كلهم عن يحيى بن سعيد، عن عبد الرحمن الأعرج، أن ابن بحينة، أخبره أن النبي  صلى الله عليه وسلم  قام في ثنتين من الظهر نسي الجلوس حتى إذا فرغ من صلاته إلا أن يسلم سجد سجدتى السهو وسلم ‏.‏",
      "text_en": " It wasnarrated from ‘Abdur-Rahman Al-A’raj that Ibn Buhainah toldhimthat the Prophet (ﷺ) stood up in the second Rak’ah of Zuhr andforgot to sit. When he had finished his prayer, and before he saidtheSalam, he performed the two prostrations for forgetfulness (Sahw)andsaid the Salam.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30212",
        "30203",
        "20326",
        "20472",
        "20354",
        "11062",
        "11197",
        "932"
      ]
    },
    {
      "id": "sunan-ibn-majah-1267",
      "hadith_no": "1267",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو خالد الأحمر، عن ابن عجلان، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا شك أحدكم في صلاته فليلغ الشك وليبن على اليقين فإذا استيقن التمام سجد سجدتين فإن كانت صلاته تامة كانت الركعة نافلة وإن كانت ناقصة كانت الركعة لتمام صلاته وكانت السجدتان رغم أنف الشيطان ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed Al-Khudri said:                      “The Messenger ofAllah(ﷺ) said: ‘If anyone of you is uncertain about his prayer, lethim put aside uncertainty and act upon that which is certain. When hehas made sure his prayer is complete, then let him prostrate twice.Then if his prayer was complete, that (extra) Rak’ah will becountedas voluntary, and if his prayer was lacking, that Rak’ahwill completehis prayer, and the two prostrations will rub theSatan’s nose in thedust.’”",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20326",
        "10616",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-1406",
      "hadith_no": "1406",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن عبد الله بن عبد الرحمن بن يعلى الطائفي، عن عثمان بن عبد الله بن أوس، عن جده، أوس بن حذيفة قال قدمنا على رسول الله  صلى الله عليه وسلم  في وفد ثقيف فنزلوا الأحلاف على المغيرة بن شعبة وأنزل رسول الله  صلى الله عليه وسلم  بني مالك في قبة له فكان يأتينا كل ليلة بعد العشاء فيحدثنا قائما على رجليه حتى يراوح بين رجليه وأكثر ما يحدثنا ما لقي من قومه من قريش ويقول ‏\"‏ ولا سواء كنا مستضعفين مستذلين فلما خرجنا إلى المدينة كانت سجال الحرب بيننا وبينهم ندال عليهم ويدالون علينا ‏\"‏ ‏.‏ فلما كان ذات ليلة أبطأ عن الوقت الذي كان يأتينا فيه فقلت يا رسول الله لقد أبطأت علينا الليلة ‏.‏ قال ‏\"‏ إنه طرأ على حزبي من القرآن فكرهت أن أخرج حتى أتمه ‏\"‏ ‏.‏ قال أوس فسألت أصحاب رسول الله  صلى الله عليه وسلم  كيف تحزبون القرآن قالوا ثلاث وخمس وسبع وتسع وإحدى عشرة وثلاث عشرة وحزب المفصل ‏.‏",
      "text_en": " It wasnarrated from ‘Uthman bin ‘Abdullah bin Aws that hisgrandfatherAws bin Hudhaifah said:                      “We came to the Messenger of Allah(ﷺ) inthe delegation of Thaqif. The allies of Quraish stayed at thehouseof Mughirah bin Shu’bah, and the Messenger of Allah (ﷺ) campedBani Malik in a tent belonging to him. He used to come to us everynight after the ‘Isha’ and speak to us standing on his two feet,untilhe started to shift his weight from one foot to the other. Mostofwhat he told us was what he had suffered from his people, theQuraish.He said: ‘(The two sides) were not equal. We were weak andoppressedand humiliated, and when we went out to Al-Madinah, theoutcome of thebattles between us varied; sometimes we would defeatthem andsometimes they would defeat us.’ One night he was laterthan heusually was, and I said: ‘O Messenger of Allah, you havecome to uslate tonight.’ He said: ‘It occurred to me that I hadnot read mydaily portion of Qur’an and I did not want to come outuntil I hadcompleted it.’” Aws said: “I asked the Companionsof the Messenger ofAllah (ﷺ): ‘How did you used to divide up theQur’an?’ They said: ‘Athird, a fifth, a seventh, a ninth, aneleventh, a thirteenth, andHizbul-Mufassal.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "18713"
      ]
    },
    {
      "id": "sunan-ibn-majah-1511",
      "hadith_no": "1511",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لقنوا موتاكم لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah that the Messenger of Allah (ﷺ)said:                     ‘urge your dying ones to say La ilaha illallah.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1616",
      "hadith_no": "1616",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو خالد الأحمر، عن عمرو بن قيس، عن المنهال بن عمرو، عن زاذان، عن البراء بن عازب، قال خرجنا مع رسول الله  صلى الله عليه وسلم  في جنازة فانتهينا إلى القبر فجلس وجلسنا كأن على رءوسنا الطير ‏.‏",
      "text_en": " It wasnarrated that Bara’ bin ‘Azib said:                      “We went out with theMessenger of Allah (ﷺ) for a funeral, and we came to a grave. Hesatdown and we sat down, as if there were birds on our heads.”",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20326",
        "213",
        "11656",
        "10911",
        "400"
      ]
    },
    {
      "id": "sunan-ibn-majah-1714",
      "hadith_no": "1714",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبو خالد الأحمر، عن عمرو بن قيس، عن أبي إسحاق، عن صلة بن زفر، قال كنا عند عمار في اليوم الذي يشك فيه فأتي بشاة فتنحى بعض القوم فقال عمار من صام هذا اليوم فقد عصى أبا القاسم  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It wasnarrated that Silah bin Zufar said:                      “We were with ‘Ammar ontheday concerning which there was some doubt. A (roasted) sheep wasbrought and some of the people moved away. ‘Ammar said: ‘Whoeverisfasting on this day has disobeyed Abu Qasim (ﷺ).’”",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20326",
        "213",
        "11049",
        "11354"
      ]
    },
    {
      "id": "sunan-ibn-majah-1830",
      "hadith_no": "1830",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا عبد الله بن سعيد، حدثنا أبو خالد الأحمر، عن الأعمش، عن مسلم البطين، والحكم، وسلمة بن كهيل، عن سعيد بن جبير، وعطاء، ومجاهد، عن ابن عباس، قال جاءت امرأة إلى النبي  صلى الله عليه وسلم  فقالت يا رسول الله إن أختي ماتت وعليها صيام شهرين متتابعين قال ‏\"‏ أرأيت لو كان على أختك دين أكنت تقضينه ‏\"‏ ‏.‏ قالت بلى ‏.‏ قال ‏\"‏ فحق الله أحق ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “A woman came to the Prophet(ﷺ)and said: ‘O Messenger of Allah, my sister has died and she owedafast of two consecutive months.’ He said: ‘Do you not think thatifyour sister owed a debt, you would pay it off for her?’ Shesaid: ‘Ofcourse.’ He said: ‘The right of Allah is greater.’”",
      "usc_msa_ref": "",
      "chain": [
        "11184",
        "20326",
        "11060",
        "11393",
        "11069",
        "11350",
        "11050",
        "11029",
        "11028",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-2109",
      "hadith_no": "2109",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، سليمان بن حيان عن سعد بن إسحاق بن كعب بن عجرة، عن زينب بنت كعب بن عجرة، وكانت، تحت أبي سعيد الخدري أن أخته الفريعة بنت مالك، قالت خرج زوجي في طلب أعلاج له فأدركهم بطرف القدوم فقتلوه فجاء نعى زوجي وأنا في دار من دور الأنصار شاسعة عن دار أهلي فأتيت النبي  صلى الله عليه وسلم  فقلت يا رسول الله إنه جاء نعى زوجي وأنا في دار شاسعة عن دار أهلي ودار إخوتي ولم يدع مالا ينفق على ولا مالا ورثته ‏.‏ ولا دارا يملكها فإن رأيت أن تأذن لي فألحق بدار أهلي ودار إخوتي فإنه أحب إلى وأجمع لي في بعض أمري ‏.‏ قال ‏\"‏ فافعلي إن شئت ‏\"‏ ‏.‏ قالت فخرجت قريرة عيني لما قضى الله لي على لسان رسول الله  صلى الله عليه وسلم  حتى إذا كنت في المسجد - أو في بعض الحجرة - دعاني فقال ‏\"‏ كيف زعمت ‏\"‏ ‏.‏ قالت فقصصت عليه فقال ‏\"‏ امكثي في بيتك الذي جاء فيه نعى زوجك حتى يبلغ الكتاب أجله ‏\"‏ ‏.‏ قالت فاعتددت فيه أربعة أشهر وعشرا ‏.‏",
      "text_en": " It was narrated from Zainab bint Ka'b bin 'Ujrah, who was married to Abu Sa'eed Al-Khudri,:                     that his sister Furai'ah bint Malik said: \"My husband went out to pursue some slaves of his. He caught up with them at the edge of Qadumttl and they killed him. News of his death reached me when I was in one of the houses of the Ansar, far away from the house of my family and my brothers. I went to the Prophet (ﷺ) and said: 'O Messenger of Allah (ﷺ), there has come to me news of my husband's death and I am in a house far away from the house of my people and the house of my brothers. He did not leave any money that could be spent on me, or any inheritance, or any house I may take possession of. If you think that you could give me permission to join my family and my brothers, then that is what I prefer and is better for me in some ways.' He said: 'Do that if you wish.' Then I went out, feeling happy with the ruling of Allah given upon the lips of the Messenger of Allah (ﷺ), until, when I was in the mosque, or, in one of the apartments, he called me and said: 'What did you say?' I told him the story, and he said: 'Stay in the house in which the news of your husband's death came to you, until your waiting period is ever.\"' She said: \"So I observed the waiting period there for four months and ten (days).\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "19805"
      ]
    },
    {
      "id": "sunan-ibn-majah-2135",
      "hadith_no": "2135",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو خالد الأحمر، عن حجاج، عن عمرو بن شعيب، عن أبيه، عن جده، قال كانت حبيبة بنت سهل تحت ثابت بن قيس بن شماس وكان رجلا دميما ‏.‏ فقالت يا رسول الله والله لولا مخافة الله إذا دخل على لبصقت في وجهه فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ أتردين عليه حديقته ‏\"‏ ‏.‏ قالت نعم ‏.‏ قال فردت عليه حديقته ‏.‏ قال ففرق بينهما رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:                     \"Habibah bint Sahl was married to Thabit bin Qais bin Shammas, who was an ugly man. She said: 'O Messenger of Allah, (ﷺ)  by Allah, were it not for fear of Allah when he enters upon me I would spit in his face.' The Messenger of Allah  (ﷺ) said: 'Will you give him back his garden?' She :said: 'Yes.' So she gave him back his garden and the Messenger of Allah (ﷺ) separated them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20326",
        "20219",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-ibn-majah-2337",
      "hadith_no": "2337",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا عبد الله بن سعيد، حدثنا أبو خالد الأحمر، عن ابن عجلان، عن عمرو بن شعيب، عن أبيه، عن جده، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا اشترى أحدكم الجارية فليقل اللهم إني أسألك خيرها وخير ما جبلتها عليه وأعوذ بك من شرها وشر ما جبلتها عليه وليدع بالبركة وإذا اشترى أحدكم بعيرا فليأخذ بذروة سنامه وليدع بالبركة وليقل مثل ذلك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib from his father that his grandfather told that the Messenger of Allah (ﷺ) said:                     \"When anyone of you buys a slave woman let him say: 'Allahumma inni as'aluka khairaha wa khaira ma jabaltaha alaihi, wa a'udhu bika min sharriha wa sharri ma jabaltaha alaihi (O Allah, I ask You for the goodness within her and the goodness that You have made her inclined towards, and I seek refuge with You from the evil within her and the evil that You have made her inclined towards).' And he should pray for blessing. And if anyone of you buys a camel then he should take hold of its hump and pray for. blessing and say similar words.\"",
      "usc_msa_ref": "",
      "chain": [
        "11184",
        "20326",
        "10616",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-ibn-majah-2374-2",
      "hadith_no": "2374",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا محمد بن طريف، حدثنا أبو خالد الأحمر، عن مجالد، عن عامر، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم أجاز شهادة أهل الكتاب بعضهم على بعض ‏.‏ ‏",
      "text_en": " It was narrated from Jabir bin 'Abdullah that :                     the Messenger of Allah (ﷺ) allowed the People of the Book to testify against one another.",
      "usc_msa_ref": "",
      "chain": [
        "30476",
        "20326",
        "10820",
        "11052",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-2614",
      "hadith_no": "2614",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Manumission (of Slaves) - كتاب العتق",
      "chapter_no": "19",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعبد الله بن سعيد، قالا حدثنا أبو خالد الأحمر، عن ابن عجلان، عن سعيد بن أبي سعيد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاثة كلهم حق على الله عونه الغازي في سبيل الله والمكاتب الذي يريد الأداء والناكح الذي يريد التعفف ‏\"‏ ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "11184",
        "20326",
        "10616",
        "11168",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2724",
      "hadith_no": "2724",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا عثمان، وأبو بكر ابنا أبي شيبة قالا حدثنا أبو خالد الأحمر، ح وحدثنا عثمان بن أبي شيبة، قال حدثنا جرير، وعبد الرحيم بن سليمان، جميعا عن محمد بن إسحاق، عن الحارث بن فضيل، أظنه عن ابن أبي العوجاء، واسمه، سفيان عن أبي شريح الخزاعي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أصيب بدم أو خبل - والخبل الجرح - فهو بالخيار بين إحدى ثلاث فإن أراد الرابعة فخذوا على يديه أن يقتل أو يعفو أو يأخذ الدية فمن فعل شيئا من ذلك فعاد فإن له نار جهنم خالدا مخلدا فيها أبدا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sharaih Al-Khuzai that the Messenger of Allah (ﷺ) said:                     “Whoever suffers from killing or wounding, has the choice of three things, and if he wants the fourth then restrain him. He may kill (the killer), or forgive him, or take the blood money. Whoever accepts any of these (options), then kills (the killer) after that will have the fire of hell to abide therein forever.”",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20326",
        "30203",
        "20028",
        "20334",
        "11107",
        "11835",
        "5355"
      ]
    },
    {
      "id": "sunan-ibn-majah-2726",
      "hadith_no": "2726",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن محمد بن إسحاق، حدثني محمد بن جعفر، عن زيد بن ضميرة، حدثني أبي وعمي، وكانا، شهدا حنينا مع رسول الله صلى الله عليه وسلم قالا صلى النبي صلى الله عليه وسلم الظهر ثم جلس تحت شجرة فقام إليه الأقرع بن حابس - وهو سيد خندف يرد - عن دم محلم بن جثامة وقام عيينة بن حصن يطلب بدم عامر بن الأضبط وكان أشجعيا فقال لهم النبي صلى الله عليه وسلم ‏\"‏ تقبلون الدية ‏\"‏ ‏.‏ فأبوا فقام رجل من بني ليث يقال له مكيتل فقال يا رسول الله والله ما شبهت هذا القتيل في غرة الإسلام إلا كغنم وردت فرميت فنفر آخرها ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لكم خمسون في سفرنا وخمسون إذا رجعنا ‏\"‏ ‏.‏ فقبلوا الدية ‏.‏",
      "text_en": " It was narrated that Ziyad bin Sa'd bin Dumairah (said):                     “My father and my paternal uncle, who were present at Hunain with the Messenger of Allah (ﷺ) narrated to me: 'The Prophet (ﷺ) prayed Zuhr, then he sat beneath a tree. Aqra' bin Habis, who was the chief of Khindaf, came to him arguing in defense of Muhallim bin Jaththamah. Uyainah bin Hisn came to him demanding vengeance for 'Amir bin Adbat who was from the tribe of Ashja. The Prophet (ﷺ) said to them: “Will you accept the blood money?'” But they refused. Then a man from Banu Laith, whose name was Mukaital, stood up and said: 'O Messenger of Allah (ﷺ)! By Allah (SWT)! This man who was killed in the early days of Islam is like Sheep that come to drink but stones are thrown at them, so the last of them runs away (i.e. ,the murderer should be killed).' The Prophet (ﷺ) said: 'You will have fifty (camels) while we are traveling and fifty (camels) when we return.' So they accepted the blood money.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "11107",
        "20173"
      ]
    },
    {
      "id": "sunan-ibn-majah-2748",
      "hadith_no": "2748",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو كريب، وعبد الله بن سعيد الكندي، قالا حدثنا أبو خالد الأحمر، عن يحيى بن سعيد، عن عمرو بن شعيب، أن أبا قتادة، - رجل من بني مدلج - قتل ابنه فأخذ منه عمر مائة من الإبل ثلاثين حقة وثلاثين جذعة وأربعين خلفة ‏.‏ فقال أين أخو المقتول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ليس لقاتل ميراث ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib that :                     Abu Qatadah, a man from Banu Mudlij, killed his son, and 'Umar took one hundred camels from him, thirty Hiqqah, thirty Jadha'ah  and forty Khalifah. Then he said: “Where is the brother of slain? I heard the Messenger of Allah (ﷺ) say: 'The killer does not inherit.'”",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "30200",
        "20326",
        "11062",
        "19934"
      ]
    },
    {
      "id": "sunan-ibn-majah-2764",
      "hadith_no": "2764",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن حجاج، عن عمرو بن شعيب، عن أبيه، عن جده، عن عمر بن الخطاب، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يقتل الوالد بالولد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that 'Umar bin Khattab said:                     “I heard the Messenger of Allah (ﷺ) say: 'A father should not be killed for his son.'”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "20219",
        "19934",
        "19911",
        "3"
      ]
    },
    {
      "id": "sunan-ibn-majah-2780",
      "hadith_no": "2780",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا عبد الله بن سعيد، حدثنا أبو خالد الأحمر، عن حجاج، عن عمرو بن شعيب، عن أبيه، عن جده، أن حويصة، ومحيصة، ابنى مسعود وعبد الله وعبد الرحمن ابنى سهل خرجوا يمتارون بخيبر فعدي على عبد الله فقتل فذكر ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ تقسمون وتستحقون ‏\"‏ ‏.‏ فقالوا يا رسول الله كيف نقسم ولم نشهد قال ‏\"‏ فتبرئكم يهود ‏\"‏ ‏.‏ قالوا يا رسول الله إذا تقتلنا ‏.‏ قال فوداه رسول الله صلى الله عليه وسلم من عنده ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from his father, from his grandfather, that :                     Huwayyisah and Muhayyisah , the sons of Mas'ud, and 'Abdullah and 'Abdur-Rahman the sons of Sahl, went out to search for food in Khaibar. 'Abdullah was attacked and killed, and mention of that was made to the Messenger of Allah (ﷺ). He said: “Will you swear an oath and establish your right to blood money?” They said: “O Messenger of Allah (ﷺ), how can we swear an oath when we did not witness anything?” He said: “Do you want the Jews to swear that they are innocent?” They said: “O Messenger of Allah (ﷺ), then they will kill us too.” So the Messenger of Allah (ﷺ) paid the blood money himself.",
      "usc_msa_ref": "",
      "chain": [
        "11184",
        "20326",
        "20219",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-ibn-majah-2860",
      "hadith_no": "2860",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعبد الله بن سعيد، قالا حدثنا أبو خالد الأحمر، عن ابن عجلان، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ غدوة أو روحة في سبيل الله خير من الدنيا وما فيها ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “Going out in the morning in the cause of Allah, or in theevening,is more virtuous than the world and what is in it.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "11184",
        "20326",
        "10616",
        "11349",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3020",
      "hadith_no": "3020",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبو خالد الأحمر، حدثنا محمد بن كريب، عن أبيه، عن ابن عباس، قال أخبرني حصين بن عوف، قال قلت يا رسول الله إن أبي أدركه الحج ولا يستطيع أن يحج إلا معترضا ‏.‏ فصمت ساعة ثم قال ‏\"‏ حج عن أبيك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      Husain bin ‘Awf told me: Isaid:“O Messenger of Allah, the command for Hajj has come but myfathercannot perform Hajj unless he is tied to a saddle.” Some timepassed, then he said: “Perform Hajj on behalf of your father.”",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20326",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3137",
      "hadith_no": "3137",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن حجاج، عن أبي إسحاق، عن عمرو بن ميمون، قال حججنا مع عمر بن الخطاب فلما أردنا أن نفيض، من المزدلفة قال إن المشركين كانوا يقولون أشرق ثبير كيما نغير ‏.‏ وكانوا لا يفيضون حتى تطلع الشمس فخالفهم رسول الله  صلى الله عليه وسلم  فأفاض قبل طلوع الشمس ‏.‏",
      "text_en": " It wasnarrated that ‘Amr bin Maimun said:                      “We performed Hajj with‘Umarbin Khattab, and when we wanted to depart from Muzdalifah, hesaid:‘The idolators used to say: “May the sun rise over you, OThabir!* So that we may begin our journey (to Mina),” and they didnotdepart until the sun had risen.’ So the Messenger of Allah(ﷺ)differed from them by departing before the sun rose.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "20219",
        "11049",
        "11382"
      ]
    },
    {
      "id": "sunan-ibn-majah-3150",
      "hadith_no": "3150",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن حجاج، عن الحكم، عن مقسم، عن ابن عباس، أن النبي  صلى الله عليه وسلم  رمى الجمرة على راحلته ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Prophet (ﷺ) stoned thePillarfrom atop his mount.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "20219",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3273",
      "hadith_no": "3273",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن يحيى بن سعيد، عن عباد بن تميم، عن عويمر بن أشقر، أنه ذبح قبل الصلاة فذكره للنبي  صلى الله عليه وسلم  فقال ‏\"‏ أعد أضحيتك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Uwaimir bin Ashqar that he slaughtered beforetheprayer, and he mentioned that to the Prophet (ﷺ) who said:                     “Repeatyour sacrifice.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "11062",
        "639",
        "5215"
      ]
    },
    {
      "id": "sunan-ibn-majah-3320",
      "hadith_no": "3320",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو كريب، حدثنا عبد الله بن المبارك، وأبو خالد الأحمر وعبدة بن سليمان عن مجالد، عن أبي الوداك، عن أبي سعيد، قال سألنا رسول الله  صلى الله عليه وسلم  عن الجنين فقال ‏\"‏ كلوه إن شئتم فإن ذكاة الجنين ذكاة أمه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed said:                      “We asked the Messenger ofAllah(ﷺ) about the fetus. He said: ‘Eat it if you wish, for it isconsidered legally slaughtered with the slaughtering of its mother.’”",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20025",
        "20326",
        "10820",
        "10752",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-3408",
      "hadith_no": "3408",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، عن حجاج، عن رياح بن عبيدة، عن مولى، لأبي سعيد عن أبي سعيد، قال كان النبي  صلى الله عليه وسلم  إذا أكل طعاما قال ‏\"‏ الحمد لله الذي أطعمنا وسقانا وجعلنا مسلمين ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed said:                      “Whenever the Prophet (ﷺ)ate,he would say: Al-hamdu lillahil-ladhi at’amana wa saqana waja’alana Muslimin (Praise is to Allah Who has fed us, given us todrink, and made us Muslims).”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "20219",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-3700-2",
      "hadith_no": "3700",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا أبو خالد الأحمر، عن حميد، عن أنس، قال أتانا رسول الله  صلى الله عليه وسلم  ونحن صبيان فسلم علينا ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"The Messenger of Allah(ﷺ) came to us, and we were young boys, and he greeted us with (the greeting of) peace\".",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "20326",
        "11279",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-3703-2",
      "hadith_no": "3703",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو خالد الأحمر، وعبد الله بن نمير، عن الأجلح، عن أبي إسحاق، عن البراء بن عازب، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ما من مسلمين يلتقيان فيتصافحان إلا غفر لهما قبل أن يتفرقا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Bara bin Azib that the Messenger of Allah(ﷺ) said:                     \"There are no two Muslims who meet and shake hands, but they will be forgiven before they part.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20326",
        "20331",
        "11049",
        "400"
      ]
    }
  ],
  "total_hadiths": 100
}