{
  "id": "20327",
  "name": "Abu al-Ahwus, Salam bin Sulaym al-Hanafi أبو الأحوص سلام بن سليم الحنفي",
  "full_name": "Abu al-Ahwus, Salam bin Sulaym al-Hanafi أبو الأحوص سلام بن سليم الحنفي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "179",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Hanfi",
      "Client",
      "al-Kufi",
      "Hafiz"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10770",
      "name": "Smak bin Hrb bin Aws سماك بن حرب بن أوس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11430",
      "name": "Shbyb bin Ghrqd'h شبيب بن غرقدة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11339",
      "name": "Ziyad bin 'Alaqa زياد بن علاقة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11675",
      "name": "Aadm bin 'Ali al-Jly آدم بن علي العجلي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11323",
      "name": "al-Aswad bin Qays al-Bdy الأسود بن قيس العبدي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11326",
      "name": "Byan bin Bashr al-Ahmsi بيان بن بشر الأحمسي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11324",
      "name": "Ash'ath bin Abi al-Ash'atha أشعث بن أبي الشعثاء",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10739",
      "name": "Ibrahim bin Mhajr bin Jabir إبراهيم بن مهاجر بن جابر",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "15097",
      "name": "Husayn bin 'Abdur Rahman al-Salmi حصين بن عبد الرحمن السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20016",
      "name": "Sa'id bin Masrooq Ath-Thawri سعيد بن مسروق الثوري",
      "grade": "Succ. (Taba' Tabi') [6th generation]"
    },
    {
      "id": "10778",
      "name": "'Asim bin Kulayb bin Shahab عاصم بن كليب بن شهاب بن المجنون",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11257",
      "name": "'Abdul 'Aziz bin Rafi' عبد العزيز بن رفيع",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11371",
      "name": "'Uthman bin 'Asim bin Husayn عثمان بن عاصم بن حصين أبو حصين",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20618",
      "name": "Yonus bin Abi Y'fwr يونس بن أبي يعفور",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20595",
      "name": "'Ammar bin Razayq عمار بن رزيق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "20364",
      "name": "Yahya bin Aadm bin Sulaiman يحيى بن آدم بن سليمان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30399",
      "name": "Yahya bin Yahya bin Bukayr يحيى بن يحيى بن بكير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30116",
      "name": "Sa'id bin Mnswr bin Sh'bh سعيد بن منصور بن شعبة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30189",
      "name": "al-Hasan bin al-Rabi' al-Bajli الحسن بن الربيع",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20312",
      "name": "Isma'il bin Aban al-Waraq إسماعيل بن أبان الوراق الأزدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30184",
      "name": "Ahmad bin Yunus",
      "grade": "Thiqah (Trustworthy)"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30376",
      "name": "Muhammad bin Salam al-Baykandi محمد بن سلام البيكندي الكبير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30175",
      "name": "Masdad bin Masrhad مسدد بن مسرهد بن مسربل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30480",
      "name": "Hanad bin al-Sari bin Mus'ab هناد بن السري بن مصعب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30461",
      "name": "Ahmed bin Jwas أحمد بن جواس",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30503",
      "name": "Khlf bin Hisham bin Th'lb خلف بن هشام بن ثعلب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30547",
      "name": "Swyd bin Sa'id سويد بن سعيد",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "751",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا مسدد، قال حدثنا أبو الأحوص، قال حدثنا أشعث بن سليم، عن أبيه، عن مسروق، عن عائشة، قالت سألت رسول الله صلى الله عليه وسلم عن الالتفات في الصلاة فقال ‏\"‏ هو اختلاس يختلسه الشيطان من صلاة العبد ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     I asked Allah's Apostle about looking hither and thither in prayer. He replied, \"It is a way of stealing by which Satan takes away (a portion) from the prayer of a person.\"",
      "chain": [
        "30175",
        "20327",
        "11324",
        "11351",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "983",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا مسدد، قال حدثنا أبو الأحوص، قال حدثنا منصور بن المعتمر، عن الشعبي، عن البراء بن عازب، قال خطبنا رسول الله صلى الله عليه وسلم يوم النحر بعد الصلاة فقال ‏\"‏ من صلى صلاتنا ونسك نسكنا فقد أصاب النسك، ومن نسك قبل الصلاة فتلك شاة لحم ‏\"‏‏.‏ فقام أبو بردة بن نيار فقال يا رسول الله والله لقد نسكت قبل أن أخرج إلى الصلاة، وعرفت أن اليوم يوم أكل وشرب فتعجلت وأكلت وأطعمت أهلي وجيراني‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ تلك شاة لحم ‏\"‏‏.‏ قال فإن عندي عناق جذعة، هي خير من شاتى لحم، فهل تجزي عني قال ‏\"‏ نعم، ولن تجزي عن أحد بعدك ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara' bin `Azib:                     On the day of Nahr Allah's Apostle delivered the Khutba after the `Id prayer and said, \"Anyone who prayed like us and slaughtered the sacrifice like we did then he acted according to our (Nusuk) tradition of sacrificing, and whoever slaughtered the sacrifice before the prayer, then that was just mutton (i.e. not sacrifice).\" Abu Burda bin Naiyar stood up and said, \"O Allah's Apostle! By Allah, I slaughtered my sacrifice before I offered the (Id) prayer and thought that today was the day of eating and drinking (nonalcoholic drinks) and so I made haste (in slaughtering) and ate and also fed my family and neighbors.\" Allah's Apostle said, \"That was just mutton (not a sacrifice).\" Then Abu Burda said, \"I have a young she-goat and no doubt, it is better than two sheep. Will that be sufficient as a sacrifice for me?\" The Prophet replied, \"Yes. But it will not be sufficient for anyone else (as a sacrifice), after you.\"",
      "chain": [
        "30175",
        "20327",
        "11067",
        "11052",
        "400"
      ]
    },
    {
      "hadith_no": "1132",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا محمد بن سلام قال أخبرنا أبو الأحوص عن الأشعث قال إذا سمع الصارخ قام فصلى‏.",
      "text_en": " Narrated Al-Ashath:                     He (the Prophet (p.b.u.h) ) used to get up for the prayer on hearing the crowing of a cock.",
      "chain": [
        "30376",
        "20327",
        "485"
      ]
    },
    {
      "hadith_no": "1144",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا مسدد، قال حدثنا أبو الأحوص، قال حدثنا منصور، عن أبي وائل، عن عبد الله  رضى الله عنه  قال ذكر عند النبي صلى الله عليه وسلم رجل فقيل ما زال نائما حتى أصبح ما قام إلى الصلاة‏.‏ فقال ‏\"‏ بال الشيطان في أذنه ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     A person was mentioned before the Prophet (p.b.u.h) and he was told that he had kept on sleeping till morning and had not got up for the prayer. The Prophet said, \"Satan urinated in his ears.\"",
      "chain": [
        "30175",
        "20327",
        "11067",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "1609",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا أشعث، عن الأسود بن يزيد، عن عائشة  رضى الله عنها  قالت سألت النبي صلى الله عليه وسلم عن الجدر أمن البيت هو قال ‏\"‏ نعم ‏\"‏‏.‏ قلت فما لهم لم يدخلوه في البيت قال ‏\"‏ إن قومك قصرت بهم النفقة ‏\"‏‏.‏ قلت فما شأن بابه مرتفعا قال ‏\"‏ فعل ذلك قومك ليدخلوا من شاءوا ويمنعوا من شاءوا، ولولا أن قومك حديث عهدهم بالجاهلية فأخاف أن تنكر قلوبهم أن أدخل الجدر في البيت وأن ألصق بابه بالأرض ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     I asked the Prophet whether the round wall (near Ka`ba) was part of the Ka`ba. The Prophet replied in the affirmative. I further said, \"What is wrong with them, why have they not included it in the building of the Ka`ba?\" He said, \"Don't you see that your people (Quraish) ran short of money (so they could not include it inside the building of Ka`ba)?\" I asked, \"What about its gate? Why is it so high?\" He replied, \"Your people did this so as to admit into it whomever they liked and prevent whomever they liked. Were your people not close to the Pre-Islamic Period of ignorance (i.e. they have recently embraced Islam) and were I not afraid that they would dislike it, surely I would have included the (area of the) wall inside the building of the Ka`ba and I would have lowered its gate to the level of the ground.\"",
      "chain": [
        "30175",
        "20327",
        "11324",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2856",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثني إسحاق بن إبراهيم، سمع يحيى بن آدم، حدثنا أبو الأحوص، عن أبي إسحاق، عن عمرو بن ميمون، عن معاذ  رضى الله عنه  قال كنت ردف النبي صلى الله عليه وسلم على حمار يقال له عفير، فقال ‏\"‏ يا معاذ، هل تدري حق الله على عباده وما حق العباد على الله ‏\"‏‏.‏ قلت الله ورسوله أعلم‏.‏ قال ‏\"‏ فإن حق الله على العباد أن يعبدوه ولا يشركوا به شيئا، وحق العباد على الله أن لا يعذب من لا يشرك به شيئا ‏\"‏‏.‏ فقلت يا رسول الله، أفلا أبشر به الناس قال ‏\"‏ لا تبشرهم فيتكلوا ‏\"‏‏.‏",
      "text_en": " Narrated Mu`adh:                     I was a companion rider of the Prophet on a donkey called 'Ufair. The Prophet asked, \"O Mu`adh! Do you know what Allah's right on His slaves is, and what the right of His slaves on Him is?\" I replied, \"Allah and His Apostle know better.\" He said, \"Allah's right on His slaves is that they should worship Him (Alone) and should not worship any besides Him. And slave's right on Allah is that He should not punish him who worships none besides Him.\" I said, \"O Allah's Apostle! Should I not inform the people of this good news?\" He said, \"Do not inform them of it, lest they should depend on it (absolutely).",
      "chain": [
        "30123",
        "20364",
        "20327",
        "11049",
        "11382",
        "32"
      ]
    },
    {
      "hadith_no": "3034",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا أبو إسحاق، عن البراء  رضى الله عنه  قال رأيت النبي صلى الله عليه وسلم يوم الخندق وهو ينقل التراب حتى وارى التراب شعر صدره، وكان رجلا كثير الشعر وهو يرتجز برجز عبد الله اللهم لولا أنت ما اهتدينا ولا تصدقنا ولا صلينا فأنزلن سكينة علينا وثبت الأقدام إن لاقينا إن الأعداء قد بغوا علينا إذا أرادوا فتنة أبينا يرفع بها صوته‏.‏",
      "text_en": " Narrated Al-Bara:                     I saw Allah's Apostle on the day (of the battle) of the Trench carrying earth till the hair of his chest were covered with dust and he was a hairy man. He was reciting the following verses of `Abdullah (bin Rawaha): \"O Allah, were it not for You, We would not have been guided, Nor would we have given in charity, nor prayed. So, bestow on us calmness, and when we meet the enemy. Then make our feet firm, for indeed, Yet if they want to put us in affliction, (i.e. want to fight against us) we would not (flee but withstand them).\" The Prophet used to raise his voice while reciting these verses. (See Hadith No. 432, Vol. 5).",
      "chain": [
        "30175",
        "20327",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "3208",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا الحسن بن الربيع، حدثنا أبو الأحوص، عن الأعمش، عن زيد بن وهب، قال عبد الله حدثنا رسول الله صلى الله عليه وسلم وهو الصادق المصدوق قال ‏\"‏ إن أحدكم يجمع خلقه في بطن أمه أربعين يوما، ثم يكون علقة مثل ذلك، ثم يكون مضغة مثل ذلك، ثم يبعث الله ملكا، فيؤمر بأربع كلمات، ويقال له اكتب عمله ورزقه وأجله وشقي أو سعيد‏.‏ ثم ينفخ فيه الروح، فإن الرجل منكم ليعمل حتى ما يكون بينه وبين الجنة إلا ذراع، فيسبق عليه كتابه، فيعمل بعمل أهل النار، ويعمل حتى ما يكون بينه وبين النار إلا ذراع، فيسبق عليه الكتاب، فيعمل بعمل أهل الجنة ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Mus'ud:                     Allah's Apostle, the true and truly inspired said, \"(The matter of the Creation of) a human being is put together in the womb of the mother in forty days, and then he becomes a clot of thick blood for a similar period, and then a piece of flesh for a similar period. Then Allah sends an angel who is ordered to write four things. He is ordered to write down his (i.e. the new creature's) deeds, his livelihood, his (date of) death, and whether he will be blessed or wretched (in religion). Then the soul is breathed into him. So, a man amongst you may do (good deeds till there is only a cubit between him and Paradise and then what has been written for him decides his behavior and he starts doing (evil) deeds characteristic of the people of the (Hell) Fire. And similarly a man amongst you may do (evil) deeds till there is only a cubit between him and the (Hell) Fire, and then what has been written for him decides his behavior, and he starts doing deeds characteristic of the people of Paradise.\"",
      "chain": [
        "30189",
        "20327",
        "11060",
        "11341",
        "16"
      ]
    },
    {
      "hadith_no": "3291",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا الحسن بن الربيع، حدثنا أبو الأحوص، عن أشعث، عن أبيه، عن مسروق، قال قالت عائشة  رضى الله عنها  سألت النبي صلى الله عليه وسلم عن التفات الرجل في الصلاة‏.‏ فقال ‏\"‏ هو اختلاس يختلس الشيطان من صلاة أحدكم ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     I asked the Prophet about one's looking here and there during the prayer. He replied, \"It is what Satan steals from the prayer of any one of you.\"",
      "chain": [
        "30189",
        "20327",
        "11324",
        "11351",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "4502",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا قتيبة، حدثنا أبو الأحوص، عن أبي إسحاق، عن عمرو بن الحارث، قال ما ترك رسول الله صلى الله عليه وسلم دينارا ولا درهما ولا عبدا ولا أمة، إلا بغلته البيضاء التي كان يركبها، وسلاحه، وأرضا جعلها لابن السبيل صدقة‏.‏",
      "text_en": " Narrated 'Amir bin Al-Harith:                     Allah's Apostle did not leave a Dinar or a Dirham or a male or a female slave. He left only his white mule on which he used to ride, and his weapons, and a piece of land which he gave in charity for the needy travelers.",
      "chain": [
        "30367",
        "20327",
        "11049",
        "20377"
      ]
    },
    {
      "hadith_no": "4765",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إسماعيل بن أبان، حدثنا أبو الأحوص، عن آدم بن علي، قال سمعت ابن عمر، رضى الله عنهما يقول إن الناس يصيرون يوم القيامة جثا، كل أمة تتبع نبيها، يقولون يا فلان اشفع، حتى تنتهي الشفاعة إلى النبي صلى الله عليه وسلم فذلك يوم يبعثه الله المقام المحمود‏.‏",
      "text_en": " Narrated Ibn `Umar:                     On the Day of Resurrection the people will fall on their knees and every nation will follow their prophet and they will say, \"O so-and-so! Intercede (for us with Allah), \"till (the right) intercession is given to the Prophet (Muhammad) and that will be the day when Allah will raise him into a station of praise and glory (i.e. Al-Maqam -al-Mahmud).",
      "chain": [
        "20312",
        "20327",
        "11675",
        "18"
      ]
    },
    {
      "hadith_no": "5019",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا الحسن بن الربيع، حدثنا أبو الأحوص، عن الأعمش، عن أبي الضحى، عن مسروق، عن عائشة  رضى الله عنها  قالت ما صلى النبي صلى الله عليه وسلم صلاة بعد أن نزلت عليه ‏{‏إذا جاء نصر الله والفتح‏}‏ إلا يقول فيها ‏\"‏ سبحانك ربنا وبحمدك، اللهم اغفر لي ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     \"When the \"Surat-An-Nasr\", 'When comes the Help of Allah and the conquest,' had been revealed to the Prophet he did not offer any prayer except that he said therein, \"Subhanka Rabbana wa bihamdika; Allahumma ighfirli (I testify the Uniqueness of our Lord, and all the praises are for Him: O Allah, forgive me!\")",
      "chain": [
        "30189",
        "20327",
        "11060",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "5230",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا الحسن بن الربيع، حدثنا أبو الأحوص، عن الأشعث، عن معاوية بن سويد، قال البراء بن عازب  رضى الله عنهما  أمرنا النبي صلى الله عليه وسلم بسبع، ونهانا عن سبع، أمرنا بعيادة المريض، واتباع الجنازة، وتشميت العاطس، وإبرار القسم، ونصر المظلوم، وإفشاء السلام، وإجابة الداعي، ونهانا عن خواتيم الذهب، وعن آنية الفضة، وعن المياثر، والقسية، والإستبرق والديباج‏.‏ تابعه أبو عوانة والشيباني عن أشعث في إفشاء السلام‏.‏",
      "text_en": " Narrated Al-Bara' bin `Azib:                     The Prophet ordered us to do seven (things) and forbade us from seven. He ordered us to visit the patients, to follow the funeral procession, to reply to the sneezer (i.e., say to him, 'Yarhamuka-l-lah (May Allah bestow His Mercy upon you), if he says 'Al-hamduli l-lah' (Praise be to Allah), to help others to fulfill their oaths, to help the oppressed, to greet (whomever one should meet), and to accept the invitation (to a wedding banquet). He forbade us to wear golden rings, to use silver utensils, to use Maiyathir (cushions of silk stuffed with cotton and placed under the rider on the saddle), the Qasiyya (linen clothes containing silk brought from an Egyptian town), the Istibraq (thick silk) and the Dibaj (another kind of silk). (See Hadith No. 539 and 753).",
      "chain": [
        "30189",
        "20327",
        "485",
        "400"
      ]
    },
    {
      "hadith_no": "5601",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا سعيد بن مسروق، عن عباية بن رفاعة، عن أبيه، عن جده، رافع بن خديج قال قلت للنبي صلى الله عليه وسلم إننا نلقى العدو غدا، وليس معنا مدى‏.‏ فقال ‏\"‏ ما أنهر الدم وذكر اسم الله فكلوا، ما لم يكن سن ولا ظفر، وسأحدثكم عن ذلك، أما السن فعظم، وأما الظفر فمدى الحبشة ‏\"‏‏.‏ وتقدم سرعان الناس فأصابوا من الغنائم والنبي صلى الله عليه وسلم في آخر الناس فنصبوا قدورا فأمر بها فأكفئت وقسم بينهم وعدل بعيرا بعشر شياه، ثم ند بعير من أوائل القوم ولم يكن معهم خيل فرماه رجل بسهم فحبسه الله‏.‏ فقال ‏\"‏ إن لهذه البهائم أوابد كأوابد الوحش فما فعل منها هذا فافعلوا مثل هذا ‏\"‏‏.‏",
      "text_en": " Narrated Rait' bin Khadij:                     I said to the Prophet, \"We will be facing the enemy tomorrow and we have no knives (for slaughtering)' He said, \"If you slaughter the animal with anything that causes its blood to flow out, and if Allah's Name is mentioned on slaughtering it, eat of it, unless the killing instrument is a tooth or nail. I will tell you why: As for the tooth, it is a bone; and as for the nail, it is the knife of Ethiopians.\" The quick ones among the people got the war booty while the Prophet was behind the people. So they placed the cooking pots on the fire, but the Prophet ordered the cooking pots to be turned upside down. Then he distributed (the war booty) among them, considering one camel as equal to ten sheep. Then a camel belonging to the first party of people ran away and they had no horses with them, so a man shot it with an arrow whereby Allah stopped it. The Prophet said, \"Of these animals there are some which are as wild as wild beasts. So, if anyone of them runs away like this, do like this (shoot it with an arrow).",
      "chain": [
        "30175",
        "20327",
        "20016",
        "11179",
        "11506",
        "1986"
      ]
    },
    {
      "hadith_no": "5785",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا سعيد بن مسروق، عن عباية بن رفاعة، عن جده، رافع بن خديج قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ الحمى من فوح جهنم، فابردوها بالماء ‏\"‏‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     I heard Allah's Apostle saying, \"Fever is from the heat of Hell, so abate fever with water.\"",
      "chain": [
        "30175",
        "20327",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "6087",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا أبو الأحوص، عن أبي حصين، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كان يؤمن بالله واليوم الآخر فلا يؤذ جاره، ومن كان يؤمن بالله واليوم الآخر فليكرم ضيفه، ومن كان يؤمن بالله واليوم الآخر فليقل خيرا أو ليصمت ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Anybody who believes in Allah and the Last Day should not harm his neighbor, and anybody who believes in Allah and the Last Day should entertain his guest generously and anybody who believes in Allah and the Last Day should talk what is good or keep quiet. (i.e. abstain from all kinds of evil and dirty talk).",
      "chain": [
        "30367",
        "20327",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "6467",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا الحسن بن الربيع، حدثنا أبو الأحوص، عن عاصم، عن أنس  رضى الله عنه  قال بعث النبي صلى الله عليه وسلم سرية يقال لهم القراء فأصيبوا، فما رأيت النبي صلى الله عليه وسلم وجد على شىء ما وجد عليهم، فقنت شهرا في صلاة الفجر ويقول ‏\"‏ إن عصية عصوا الله ورسوله ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet sent a Sariya (an army detachment) consisting of men called Al-Qurra', and all of them were martyred. I had never seen the Prophet so sad over anything as he was over them. So he said Qunut (invocation in the prayer) for one month in the Fajr prayer, invoking for Allah's wrath upon the tribe of 'Usaiya, and he used to say, \"The people of 'Usaiya have disobeyed Allah and His Apostle.\"",
      "chain": [
        "30189",
        "20327",
        "11080",
        "19"
      ]
    },
    {
      "hadith_no": "6521",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا الحسن بن الربيع، حدثنا أبو الأحوص، عن الأعمش، عن زيد بن وهب، قال قال أبو ذر كنت أمشي مع النبي صلى الله عليه وسلم في حرة المدينة فاستقبلنا أحد فقال ‏\"‏ يا أبا ذر ‏\"‏‏.‏ قلت لبيك يا رسول الله‏.‏ قال ‏\"‏ ما يسرني أن عندي مثل أحد هذا ذهبا، تمضي على ثالثة وعندي منه دينار، إلا شيئا أرصده لدين، إلا أن أقول به في عباد الله هكذا وهكذا وهكذا ‏\"‏‏.‏ عن يمينه وعن شماله ومن خلفه‏.‏ ثم مشى فقال ‏\"‏ إن الأكثرين هم الأقلون يوم القيامة إلا من قال هكذا وهكذا وهكذا  عن يمينه وعن شماله ومن خلفه  وقليل ما هم ‏\"‏‏.‏ ثم قال لي ‏\"‏ مكانك لا تبرح حتى آتيك ‏\"‏‏.‏ ثم انطلق في سواد الليل حتى توارى فسمعت صوتا قد ارتفع، فتخوفت أن يكون قد عرض للنبي صلى الله عليه وسلم فأردت أن آتيه فذكرت قوله لي ‏\"‏ لا تبرح حتى آتيك ‏\"‏ فلم أبرح حتى أتاني، قلت يا رسول الله لقد سمعت صوتا تخوفت، فذكرت له فقال ‏\"‏ وهل سمعته ‏\"‏‏.‏ قلت نعم‏.‏ قال ‏\"‏ ذاك جبريل أتاني فقال من مات من أمتك لا يشرك بالله شيئا دخل الجنة ‏\"‏‏.‏ قلت وإن زنى وإن سرق قال ‏\"‏ وإن زنى وإن سرق ‏\"‏‏.‏",
      "text_en": " Narrated Abu Dhar:                     While I was walking with the Prophet in the Harra of Medina, Uhud came in sight. The Prophet said, \"O Abu Dhar!\" I said, \"Labbaik, O Allah's Apostle!\" He said, \"I would not like to have gold equal to this mountain of Uhud, unless nothing of it, not even a single Dinar of it remains with me for more than three days, except something which I will keep for repaying debts. I would have spent all of it (distributed it) amongst Allah's Slaves like this, and like this, and like this.\" The Prophet pointed out with his hand towards his right, his left and his back (while illustrating it). He proceeded with his walk and said, \"The rich are in fact the poor (little rewarded) on the Day of Resurrection except those who spend their wealth like this, and like this, and like this, to their right, left and back, but such people are few in number.\" Then he said to me, \"Stay at your place and do not leave it till I come back.\" Then he proceeded in the darkness of the night till he went out of sight, and then I heard a loud voice, and was afraid that something might have happened to the Prophet .1 intended to go to him, but I remembered what he had said to me, i.e. 'Don't leave your place till I come back to you,' so I remained at my place till he came back to me. I said, \"O Allah's Apostle! I heard a voice and I was afraid.\" So I mentioned the whole story to him. He said, \"Did you hear it?\" I replied, \"Yes.\" He said, \"It was Gabriel who came to me and said, 'Whoever died without joining others in worship with Allah, will enter Paradise.' I asked (Gabriel), 'Even if he had committed theft or committed illegal sexual intercourse? Gabriel said, 'Yes, even if he had committed theft or committed illegal sexual intercourse.\"",
      "chain": [
        "30189",
        "20327",
        "11060",
        "11341"
      ]
    },
    {
      "hadith_no": "6721",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا محمد، حدثنا أبو الأحوص، عن أبي إسحاق، عن البراء بن عازب، قال أهدي إلى النبي صلى الله عليه وسلم سرقة من حرير، فجعل الناس يتداولونها بينهم، ويعجبون من حسنها ولينها، فقال رسول الله صلى الله عليه وسلم ‏\"‏ أتعجبون منها ‏\"‏‏.‏ قالوا نعم يا رسول الله‏.‏ قال ‏\"‏ والذي نفسي بيده لمناديل سعد في الجنة خير منها ‏\"‏‏.‏ لم يقل شعبة وإسرائيل عن أبي إسحاق ‏\"‏ والذي نفسي بيده ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara 'bin `Azib:                     A piece of silken cloth was given to the Prophet as a present and the people handed it over amongst themselves and were astonished at its beauty and softness. Allah's Apostle said, \"Are you astonished at it?\" They said, \"Yes, O Allah's Apostle!\" He said, \"By Him in Whose Hand my soul is, the handkerchiefs of Sa`d in Paradise are better than it.\"",
      "chain": [
        "30213",
        "20327",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "7319",
      "source": " Sahih Bukhari ",
      "chapter": "Wishes - كتاب التمنى",
      "chapter_no": "95",
      "text_ar": "حدثنا حسن بن الربيع، حدثنا أبو الأحوص، عن عاصم، عن النضر بن أنس، قال قال أنس  رضى الله عنه  لولا أني سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا تتمنوا الموت ‏\"‏ لتمنيت‏.‏",
      "text_en": " Narrated Anas:                     If I had not heard the Prophet saying, \"You should not long for death,\" I would have longed (for it).",
      "chain": [
        "20327",
        "11080",
        "11310",
        "19"
      ]
    },
    {
      "hadith_no": "7330",
      "source": " Sahih Bukhari ",
      "chapter": "Wishes - كتاب التمنى",
      "chapter_no": "95",
      "text_ar": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا أشعث، عن الأسود بن يزيد، عن عائشة، قالت سألت النبي صلى الله عليه وسلم عن الجدر أمن البيت هو قال ‏\"‏ نعم ‏\"‏‏.‏ قلت فما لهم لم يدخلوه في البيت قال ‏\"‏ إن قومك قصرت بهم النفقة ‏\"‏‏.‏ قلت فما شأن بابه مرتفعا قال ‏\"‏ فعل ذاك قومك، ليدخلوا من شاءوا، ويمنعوا من شاءوا، لولا أن قومك حديث عهدهم بالجاهلية، فأخاف أن تنكر قلوبهم أن أدخل الجدر في البيت، وأن ألصق بابه في الأرض ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     I asked the Prophet about the wall (outside the Ka`ba). \"Is it regarded as part of the Ka`ba?\" He replied, \"Yes.\" I said, \"Then why didn't the people include it in the Ka`ba?\" He said, \"(Because) your people ran short of money.\" I asked, \"Then why is its gate so high?\" He replied, ''Your people did so in order to admit to it whom they would and forbid whom they would. Were your people not still close to the period of ignorance, and were I not afraid that their hearts might deny my action, then surely I would include the wall in the Ka`ba and make its gate touch the ground.\"",
      "chain": [
        "30175",
        "20327",
        "11324",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "7579",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا مسدد، حدثنا أبو الأحوص، حدثنا أبو إسحاق الهمداني، عن البراء بن عازب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يا فلان إذا أويت إلى فراشك فقل اللهم أسلمت نفسي إليك، ووجهت وجهي إليك وفوضت أمري إليك، وألجأت ظهري إليك، رغبة ورهبة إليك، لا ملجأ ولا منجا منك إلا إليك، آمنت بكتابك الذي أنزلت، وبنبيك الذي أرسلت‏.‏ فإنك إن مت في ليلتك مت على الفطرة، وإن أصبحت أصبت أجرا ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara' bin `Azib:                     Allah's Apostle said, \"O so-and-so, whenever you go to your bed (for sleeping) say, 'O Allah! I have surrendered myself over to you and have turned my face towards You, and leave all my affairs to You and depend on You and put my trust in You expecting Your reward and fearing Your punishment. There is neither fleeing from You nor refuge but with You. I believe in the Book (Qur'an) which You have revealed and in Your Prophet (Muhammad) whom You have sent.' If you then die on that night, then you will die as a Muslim, and if you wake alive in the morning then you will receive the reward.\" (See Hadith No. 323, Vol. 8)",
      "chain": [
        "30175",
        "20327",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "11",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن المثنى، قال حدثنا عبد الرحمن، قال حدثنا سفيان، عن أبي إسحاق، عن أبي الأحوص، عن عبد الله، قال بحسب المرء من الكذب أن يحدث بكل ما سمع ‏.‏",
      "text_en": "",
      "chain": [
        "30170",
        "20033",
        "20012",
        "11049",
        "20327",
        "18"
      ]
    },
    {
      "hadith_no": "115",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، أخبرنا أبو الأحوص، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو الأحوص، عن أبي إسحاق، عن موسى بن طلحة، عن أبي أيوب، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال دلني على عمل أعمله يدنيني من الجنة ويباعدني من النار ‏.‏ قال ‏\"‏ تعبد الله لا تشرك به شيئا وتقيم الصلاة وتؤتي الزكاة وتصل ذا رحمك ‏\"‏ فلما أدبر قال رسول الله صلى الله عليه وسلم ‏\"‏ إن تمسك بما أمر به دخل الجنة ‏\"‏ ‏.‏ وفي رواية ابن أبي شيبة ‏\"‏ إن تمسك به ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Ayyub that a man came to the Prophet (may peace be upon him) and said:                      Direct me to a deed which draws me near to Paradise and takes me away from the Fire (of Hell). Upon this he (the Holy Prophet) said: You worship Allah and never associate anything with Him, establish prayer, and pay Zakat, and do good to your kin. When he turned his back, the Messenger of Allah (may peace be upon him) remarked: If he adheres to what he has been ordered to do, he would enter Paradise.",
      "chain": [
        "30399",
        "20327",
        "30201",
        "20327",
        "11049",
        "579",
        "33"
      ]
    },
    {
      "hadith_no": "183",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو الأحوص، عن أبي حصين، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كان يؤمن بالله واليوم الآخر فلا يؤذي جاره ومن كان يؤمن بالله واليوم الآخر فليكرم ضيفه ومن كان يؤمن بالله واليوم الآخر فليقل خيرا أو ليسكت ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Abu Huraira that the Messenger of Allah (may peace and blessings be upon him) observed:                      He who believes in Allah and the Last Day does not harm is neighbour, and he who believes in Allah and the Last Day shows hospitality to his guest and he who believes in Allah and the Last Day speaks good or remains silent.",
      "chain": [
        "30201",
        "20327",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "375",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، وأبو بكر بن أبي شيبة وهناد بن السري وأبو عاصم الحنفي - واللفظ لقتيبة - قالوا حدثنا أبو الأحوص، عن سماك، عن علقمة بن وائل، عن أبيه، قال جاء رجل من حضرموت ورجل من كندة إلى النبي صلى الله عليه وسلم فقال الحضرمي يا رسول الله إن هذا قد غلبني على أرض لي كانت لأبي ‏.‏ فقال الكندي هي أرضي في يدي أزرعها ليس له فيها حق ‏.‏ فقال رسول الله صلى الله عليه وسلم للحضرمي ‏\"‏ ألك بينة ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فلك يمينه ‏\"‏ ‏.‏ قال يا رسول الله إن الرجل فاجر لا يبالي على ما حلف عليه وليس يتورع من شىء ‏.‏ فقال ‏\"‏ ليس لك منه إلا ذلك ‏\"‏ فانطلق ليحلف فقال رسول الله صلى الله عليه وسلم لما أدبر ‏\"‏ أما لئن حلف على ماله ليأكله ظلما ليلقين الله وهو عنه معرض ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Wa'il that there came a person from Hadramaut and another one from Kinda to the Apostle (may peace be upon him). One who had come from Hadramaut said:                      Messenger of Allah, only this man has appropriated my land which belonged to my father. The one who had came from Kinda contended. This is my land and is in my possession: I cultivate it. There is no right for him in it. The Messenger of Allah said to the Hadramite: Have you any evidence (to support you)? He replied in the negative. He (the Apostle of Allah) said: Then your case is to be decided on his oath. He (the Hadramite) said: Messenger of Allah, he is a liar and cares not what he swears and has no regard for anything. Upon this he (the Messenger of Allah) remarked: For you then there is no other help to it. He (the man from Kinda) set out to take an oath. When he turned his back the Messenger of Allah (may peace be upon him) observed: If he took an oath on his property with a view to usurping it, he would certainly meet his Lord in a state that He would turn away from him.",
      "chain": [
        "30367",
        "20327",
        "10770",
        "10801"
      ]
    },
    {
      "hadith_no": "551",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا هناد بن السري، حدثنا أبو الأحوص، عن أبي إسحاق، عن عمرو بن ميمون، عن عبد الله، قال قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ أما ترضون أن تكونوا ربع أهل الجنة ‏\"‏ قال فكبرنا ‏.‏ ثم قال ‏\"‏ أما ترضون أن تكونوا ثلث أهل الجنة ‏\"‏ قال فكبرنا ‏.‏ ثم قال ‏\"‏ إني لأرجو أن تكونوا شطر أهل الجنة وسأخبركم عن ذلك ما المسلمون في الكفار إلا كشعرة بيضاء في ثور أسود أو كشعرة سوداء في ثور أبيض ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Mas'ud reported:                      The Messenger of Allah (may peace be upon him) addressing us said: Aren't you pleased that you should constitute one-fourth of the inhabitants of Paradise? He (the narrator) said: We glorified (our Lord, i. e. we called aloud Allah-o Akbar, Allah is the Greatest). He, then, again said: Aren't you pleased that you should constitute one-third of the inhabitants of Paradise? He (the narrator) said: We glorified (our Lord) and he (the Holy Prophet) then again said: I hope that you would constitute half of the inhabitants of Paradise and I shall explain to you its (reason). The believers among the unbelievers would not be more than a white hair on (the body of a) black ox or a black hair on (the body of a) white ox.",
      "chain": [
        "30480",
        "20327",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "hadith_no": "268",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا يحيى بن يحيى التميمي، أخبرنا أبو الأحوص، عن أشعث، عن أبيه، عن مسروق، عن عائشة، قالت إن كان رسول الله صلى الله عليه وسلم ليحب التيمن في طهوره إذا تطهر وفي ترجله إذا ترجل وفي انتعاله إذا انتعل ‏.‏",
      "text_en": " 'A'isha reported:                      The Messenger of Allah (way peace be upon him) loved to start from the right-hand side for performing ablution, for combing (the hair) and wearing the shoes.",
      "chain": [
        "30399",
        "20327",
        "11324",
        "11351",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "274",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا يحيى بن يحيى التميمي، أخبرنا أبو الأحوص، عن أشعث، عن الأسود بن هلال، عن المغيرة بن شعبة، قال بينا أنا مع، رسول الله صلى الله عليه وسلم ذات ليلة إذ نزل فقضى حاجته ثم جاء فصببت عليه من إداوة كانت معي فتوضأ ومسح على خفيه ‏.‏",
      "text_en": " Mughira b. Shu'ba reported:                      I was with the Messenger of Allah (may peace be upon him) one night. He came down (from the ride) and relieved himself. He then came and I poured water upon him from the jar that I carried with me. He performed ablution and wiped over his socks.",
      "chain": [
        "30399",
        "20327",
        "11324",
        "11620",
        "166"
      ]
    },
    {
      "hadith_no": "290",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا أحمد بن جواس الحنفي أبو عاصم، حدثنا أبو الأحوص، عن شبيب بن غرقدة، عن عبد الله بن شهاب الخولاني، قال كنت نازلا على عائشة فاحتلمت في ثوبى فغمستهما في الماء فرأتني جارية لعائشة فأخبرتها فبعثت إلى عائشة فقالت ما حملك على ما صنعت بثوبيك قال قلت رأيت ما يرى النائم في منامه ‏.‏ قالت هل رأيت فيهما شيئا ‏.‏ قلت لا ‏.‏ قالت فلو رأيت شيئا غسلته لقد رأيتني وإني لأحكه من ثوب رسول الله صلى الله عليه وسلم يابسا بظفري ‏.‏",
      "text_en": " Abdullah b. Shihab al-Khaulani reported:                      I stayed in the house of 'A'isha and had a wet dream (and perceived its effect on my garment), so (in the morning) I dipped both (the clothes) in water. This (act of mine) was watched by a maid-servant of A'isha and she informed her. She (Hadrat A'isha) sent me a message: Whatprompted you to act like this with your clothes? He (the narrator) said: I told that I saw in a dream what a sleeper sees. She said: Did you find (any mark of the fluid) on your clothes? I said: No. She said: Had you found anything you should have washed it. Incase I found that (semen) on the garment of the Messenger of Allah (may peace be upon him) dried up, I scraped it off with my nails.",
      "chain": [
        "30461",
        "20327",
        "11430",
        "10784"
      ]
    },
    {
      "hadith_no": "327",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا يحيى بن يحيى، وقتيبة بن سعيد، وأبو بكر بن أبي شيبة قال يحيى أخبرنا وقال الآخران، حدثنا أبو الأحوص، عن أبي إسحاق، عن سليمان بن صرد، عن جبير بن مطعم، قال تماروا في الغسل عند رسول الله صلى الله عليه وسلم فقال بعض القوم أما أنا فإني أغسل رأسي كذا وكذا فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما أنا فإني أفيض على رأسي ثلاث أكف ‏\"‏ ‏.‏",
      "text_en": " Jubair b. Mut'im reported:                      The people contended amongst themselves in the presence of the Messenger of Allah (may peace be upon him) with regard to bathing. Some of them said: We wash our heads like this and this. Upon this the Messenger (may peace be upon him) said: As for me I pour three handfuls of water upon my head.",
      "chain": [
        "30399",
        "30367",
        "30201",
        "20031",
        "20327",
        "11049",
        "383",
        "871"
      ]
    },
    {
      "hadith_no": "332",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة كلاهما عن أبي الأحوص، عن إبراهيم بن مهاجر، عن صفية بنت شيبة، عن عائشة، قالت دخلت أسماء بنت شكل على رسول الله صلى الله عليه وسلم فقالت يا رسول الله كيف تغتسل إحدانا إذا طهرت من الحيض وساق الحديث ولم يذكر فيه غسل الجنابة ‏.‏",
      "text_en": " 'A'isha reported:                      Asma' b. Shakal came to the Messenger of Allah (may peace be upon him) and said: Messenger of Allah, how one amongst us should take a bath after the menstruation, and the rest of the hadith is the same and there is no mention of bathing because of sexual intercourse.",
      "chain": [
        "30399",
        "20327",
        "10739",
        "2802",
        "53"
      ]
    },
    {
      "hadith_no": "436",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا حسن بن الربيع، وأبو بكر بن أبي شيبة قالا حدثنا أبو الأحوص، ح وحدثنا قتيبة بن سعيد، حدثنا أبو عوانة، بهذا الإسناد نحوه ‏.‏",
      "text_en": " Abu 'Awana reported this hadith with the same chain of transmitters.",
      "chain": [
        "30201",
        "20327",
        "30367"
      ]
    },
    {
      "hadith_no": "499",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى، وقتيبة بن سعيد، وأبو بكر بن أبي شيبة قال يحيى أخبرنا وقال الآخران، حدثنا أبو الأحوص، عن سماك، عن موسى بن طلحة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا وضع أحدكم بين يديه مثل مؤخرة الرحل فليصل ولا يبال من مر وراء ذلك ‏\"‏ ‏.‏",
      "text_en": " Musa b. Talha reported it on the authority of his father:                      The Messenger of Allah (may peace be upon him) said: When one of you places in front of him so me. thing such as the back of a saddle, he should pray without caring who passes on the other side of it.",
      "chain": [
        "30399",
        "30367",
        "30201",
        "20031",
        "20327",
        "10770",
        "579",
        "6"
      ]
    },
    {
      "hadith_no": "1204",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو الأحوص، عن أبي إسحاق، عن البراء بن عازب، قال صليت مع النبي صلى الله عليه وسلم إلى بيت المقدس ستة عشر شهرا حتى نزلت الآية التي في البقرة ‏{‏ وحيثما كنتم فولوا وجوهكم شطره‏}‏ فنزلت بعد ما صلى النبي صلى الله عليه وسلم فانطلق رجل من القوم فمر بناس من الأنصار وهم يصلون فحدثهم فولوا وجوههم قبل البيت ‏.‏",
      "text_en": " Al-Bara' b. 'Azib reported:                      I said prayer with the Apostle (may peace be upon him) turning towards Bait-ul-Maqdis for sixteen months till this verse of Surah Baqara wis revealed:\" And wherever you are turn your faces towards it\" (ii. 144). This verse was revealed when the Apostle (may peace be upon him) had said prayer. A person amongst his people passed by the people of Ansar as they were engaged in prayer. He narrated to them (this command of Allah) and they turned their faces towards the Ka'ba.",
      "chain": [
        "30201",
        "20327",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "1223",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا خلف بن هشام، حدثنا أبو الأحوص، ح قال وحدثنا ابن أبي عمر، حدثنا سفيان، كلاهما عن أبي يعفور، بهذا الإسناد إلى قوله فنهينا عنه ‏.‏ ولم يذكرا ما بعده ‏.‏",
      "text_en": " This hadith has been narrated by Abu Ya'fur with the same chain of transmitters up to these words:                      We have been forbidden from it and no mention of that has been made what follows it.",
      "chain": [
        "30503",
        "20327",
        "30421"
      ]
    },
    {
      "hadith_no": "1350",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا هناد بن السري، حدثنا أبو الأحوص، عن أشعث، عن أبيه، عن مسروق، عن عائشة، بهذا الحديث وفيه قالت وما صلى صلاة بعد ذلك إلا سمعته يتعوذ من عذاب القبر ‏.‏",
      "text_en": " Masruq reported this hadith on the authority of 'A'isha who said:                      Never did he (the Holy Prophet) say prayer after this in which I did not hear him seeking refuge from the torment of the grave.",
      "chain": [
        "30480",
        "20327",
        "11324",
        "11351",
        "11018"
      ]
    },
    {
      "hadith_no": "1485",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن يحيى، وقتيبة بن سعيد، وأبو بكر بن أبي شيبة قال يحيى أخبرنا وقال الآخران، حدثنا أبو الأحوص، عن سماك، عن جابر بن سمرة، قال كان رسول الله صلى الله عليه وسلم يؤخر صلاة العشاء الآخرة ‏.‏",
      "text_en": " Jabir b. Samura reported that the Messenger of Allah (may peace be upon him) postponed the last 'Isha' prayer.",
      "chain": [
        "30399",
        "30367",
        "30201",
        "20031",
        "20327",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1517",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أحمد بن عبد الله بن يونس، حدثنا زهير، حدثنا أبو إسحاق، عن أبي الأحوص، سمعه منه، عن عبد الله، أن النبي صلى الله عليه وسلم قال لقوم يتخلفون عن الجمعة ‏\"‏ لقد هممت أن آمر رجلا يصلي بالناس ثم أحرق على رجال يتخلفون عن الجمعة بيوتهم ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah reported Allah's Messenger (may peace be upon him) as saying about people who are absent from Jumu'a prayer:                      I intend that I should command a person to lead people in prayer, and then burn those persons who absent themselves from Jumu'a prayer in their houses.",
      "chain": [
        "30184",
        "20321",
        "11049",
        "20327",
        "18"
      ]
    },
    {
      "hadith_no": "1519",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر العبدي، حدثنا زكرياء بن أبي زائدة، حدثنا عبد الملك بن عمير، عن أبي الأحوص، قال قال عبد الله لقد رأيتنا وما يتخلف عن الصلاة إلا منافق قد علم نفاقه أو مريض إن كان المريض ليمشي بين رجلين حتى يأتي الصلاة - وقال - إن رسول الله صلى الله عليه وسلم علمنا سنن الهدى وإن من سنن الهدى الصلاة في المسجد الذي يؤذن فيه ‏.‏",
      "text_en": " 'Abdullah (b. Mas'ud) reported:                      I have seen the time when no one stayed away from prayer except a hypocrite, whose hypocrisy was well known, or a sick man, but it a sick man could walk between two persons (i. e. with the help of two persons with one on each side) he would come to prayer. And (further) said: The Messenger of Allah (may peace be upon him) taught us the paths of right guidance. among which is prayer in the mosque in which the Adzan is called.",
      "chain": [
        "30201",
        "20352",
        "11338",
        "11368",
        "20327"
      ]
    },
    {
      "hadith_no": "1520",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الفضل بن دكين، عن أبي العميس، عن علي بن الأقمر، عن أبي الأحوص، عن عبد الله، قال من سره أن يلقى الله غدا مسلما فليحافظ على هؤلاء الصلوات حيث ينادى بهن فإن الله شرع لنبيكم صلى الله عليه وسلم سنن الهدى وإنهن من سنن الهدى ولو أنكم صليتم في بيوتكم كما يصلي هذا المتخلف في بيته لتركتم سنة نبيكم ولو تركتم سنة نبيكم لضللتم وما من رجل يتطهر فيحسن الطهور ثم يعمد إلى مسجد من هذه المساجد إلا كتب الله له بكل خطوة يخطوها حسنة ويرفعه بها درجة ويحط عنه بها سيئة ولقد رأيتنا وما يتخلف عنها إلا منافق معلوم النفاق ولقد كان الرجل يؤتى به يهادى بين الرجلين حتى يقام في الصف ‏.‏",
      "text_en": " Abdullah (b. Mas'ud) reported:                      He who likes to meet Allah tomorrow as Muslim, he should persevere in observing these prayers, when a call is announced for them, for Allah has laid down for your Prophet the paths of right guidance, and these (prayers) are among the paths of right guidance. If you were to pray in your houses as this man why stays away (from the mosque) prays in his house, you would abandon the practice of your Prophet, and if you were to abandon the practice of your Prophet, you would go astray. No man purifies himself, doing it well, then makes for one of those mosques without Allah recording a blessing for him for every step he takes raising him a degree for it, and effacing a sin from him for it. I have seen the time when no one stayed away from it, except a hypocrite, who was well known for his hypocrisy, whereas a man would be brought swaying (due to weakness) between two men till he was set up in a row.",
      "chain": [
        "30201",
        "20348",
        "20342",
        "11375",
        "20327",
        "18"
      ]
    },
    {
      "hadith_no": "1521",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو الأحوص، عن إبراهيم بن المهاجر، عن أبي الشعثاء، قال كنا قعودا في المسجد مع أبي هريرة فأذن المؤذن فقام رجل من المسجد يمشي فأتبعه أبو هريرة بصره حتى خرج من المسجد فقال أبو هريرة أما هذا فقد عصى أبا القاسم صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Sha'tha' reported:                      While we were sitting with Abu Huraira in a mosque a man went out of the mosque after the call to prayer had been announced. (A man stood up in the mosque and set off.) Abu Huraira's eyes followed him till he went out of the mosque. Upon this Abu Huraira said: This man has disobeyed Abu'l- Qasim (Muhammad) (may peace be upon him).",
      "chain": [
        "30201",
        "20327",
        "11351"
      ]
    },
    {
      "hadith_no": "1559",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا قتيبة، وأبو بكر بن أبي شيبة قالا حدثنا أبو الأحوص، ح قال وحدثنا ابن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، كلاهما عن سماك، بهذا الإسناد ‏.‏ ولم يقولا حسنا ‏.‏",
      "text_en": " This hadith has been narrated by Simak with the same chain of transmitters, but no mention has been made of, enough\".",
      "chain": [
        "30367",
        "30201",
        "20327",
        "30160",
        "20173"
      ]
    },
    {
      "hadith_no": "1630",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا يحيى بن يحيى، وقتيبة، قال يحيى أخبرنا وقال، قتيبة حدثنا أبو الأحوص، عن أبي إسحاق، عن حارثة بن وهب، قال صليت مع رسول الله صلى الله عليه وسلم بمنى - آمن ما كان الناس وأكثره - ركعتين ‏.‏",
      "text_en": " Haritha b. Wahb reported:                      I prayed with the Messenger of Allah (may peace be upon him) two rak'abs and most of them offered two rak'ahs only in Mina, while the people felt secure.",
      "chain": [
        "30399",
        "30367",
        "20031",
        "30367",
        "20327",
        "11049",
        "4109"
      ]
    },
    {
      "hadith_no": "1764",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني هناد بن السري، حدثنا أبو الأحوص، عن أشعث، عن أبيه، عن مسروق، قال سألت عائشة عن عمل، رسول الله صلى الله عليه وسلم فقالت كان يحب الدائم ‏.‏ قال قلت أى حين كان يصلي فقالت كان إذا سمع الصارخ قام فصلى ‏.‏",
      "text_en": " 'A'isha reported:                      Never did the earlier part of the dawn find the Messenger of Allah (may peace be upon him) but sleeping in my house or near me.",
      "chain": [
        "30480",
        "20327",
        "11324",
        "11351",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "1832",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وهناد بن السري، قالا حدثنا أبو الأحوص، عن سعيد بن مسروق، عن سلمة بن كهيل، عن أبي رشدين، مولى ابن عباس عن ابن عباس، قال بت عند خالتي ميمونة ‏.‏ واقتص الحديث ولم يذكر غسل الوجه والكفين غير أنه قال ثم أتى القربة فحل شناقها فتوضأ وضوءا بين الوضوءين ثم أتى فراشه فنام ثم قام قومة أخرى فأتى القربة فحل شناقها ثم توضأ وضوءا هو الوضوء وقال ‏\"‏ أعظم لي نورا ‏\"‏ ‏.‏ ولم يذكر ‏\"‏ واجعلني نورا ‏\"‏ ‏.‏",
      "text_en": " Kuraib reported that Ibn 'Abbas spent a night in the house of the Messenger of Allah (may peace be upon him) and he said:                      The Messenger of Allah may peace be upon him) stood near the water-skin and poured water out of that and performed ablution in which he neither used excess of water nor too little of it, and the rest of the hadith is the same, and in this mention is also made (of the fact) that on that night the Messenger of Allah (may peace be upon him) made supplication before Allah in nineteen words. Kuraib reported: I remember twelve words out of these, bux have forgotten the rest. The Messenger of Allah said:\" Place light in my heart, light in my tongue, light in my hearing, light in my sight, light above me, light below me, light on my right, light on my left, light in front of me, light behind me, place light in my soul, and make light abundant for me.\"",
      "chain": [
        "30201",
        "30480",
        "20327",
        "20016",
        "11350",
        "17"
      ]
    },
    {
      "hadith_no": "1913",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا حسن بن الربيع، وأحمد بن جواس الحنفي، قالا حدثنا أبو الأحوص، عن عمار بن رزيق، عن عبد الله بن عيسى، عن سعيد بن جبير، عن ابن عباس، قال بينما جبريل قاعد عند النبي صلى الله عليه وسلم سمع نقيضا من فوقه فرفع رأسه فقال هذا باب من السماء فتح اليوم لم يفتح قط إلا اليوم فنزل منه ملك فقال هذا ملك نزل إلى الأرض لم ينزل قط إلا اليوم فسلم وقال أبشر بنورين أوتيتهما لم يؤتهما نبي قبلك فاتحة الكتاب وخواتيم سورة البقرة لن تقرأ بحرف منهما إلا أعطيته ‏.‏",
      "text_en": " 'Abd al-Rahman b. Yazid reported:                      I met Abu Mas'ud near the House (Ka'ba) and said to him: A hadith has been conveyed to me on your authority about the two (concluding verses of Surah al-Baqara. He said: Yes. The Messenger of Allah (may peace be upon him) (in fact) said: Anyone who recites the two verses at the end of Surah al-Baqara at night, they would suffice for him.",
      "chain": [
        "30461",
        "20327",
        "20595",
        "11361",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2032",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا يحيى بن يحيى، وحسن بن الربيع، وأبو بكر بن أبي شيبة قال يحيى أخبرنا وقال الآخران، حدثنا أبو الأحوص، عن سماك، عن جابر بن سمرة، قال كانت للنبي صلى الله عليه وسلم خطبتان يجلس بينهما يقرأ القرآن ويذكر الناس ‏.‏",
      "text_en": " Jabir b. Samura said:                      The Apostle of Allah (may peace be upon him) gave two sermons between which he sat, recited the Qur'an and exhorted the people.",
      "chain": [
        "30399",
        "30201",
        "20031",
        "20327",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "2040",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "حدثنا حسن بن الربيع، وأبو بكر بن أبي شيبة قالا حدثنا أبو الأحوص، عن سماك، عن جابر بن سمرة، قال كنت أصلي مع رسول الله صلى الله عليه وسلم فكانت صلاته قصدا وخطبته قصدا ‏.‏",
      "text_en": " Jabir b. Samura reported:                      I used to pray with the Messenger of Allah (may peace be upon him) and both his prayer and sermon were of moderate length.",
      "chain": [
        "30201",
        "20327",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "2088",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Two Eids) - كتاب صلاة العيدين",
      "chapter_no": "9",
      "text_ar": "وحدثنا يحيى بن يحيى، وحسن بن الربيع، وقتيبة بن سعيد، وأبو بكر بن أبي شيبة قال يحيى أخبرنا وقال الآخرون، حدثنا أبو الأحوص، عن سماك، عن جابر بن، سمرة قال صليت مع رسول الله صلى الله عليه وسلم العيدين غير مرة ولا مرتين بغير أذان ولا إقامة ‏.‏",
      "text_en": " Jabir b. Samura said:                      I prayed with the Messenger of Allah (may peace be upon him) prayers on two I'ds wore than once or twice without there being Adhan and Iqama.",
      "chain": [
        "30399",
        "30367",
        "30201",
        "20031",
        "20327",
        "10770",
        "393"
      ]
    }
  ],
  "total_hadiths": 317
}