{
  "id": "20328",
  "name": "Shuja' bin al-Walid bin Qays al-Sakuni شجاع بن الوليد بن قيس",
  "full_name": "Shuja' bin al-Walid bin Qays al-Sakuni شجاع بن الوليد بن قيس",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "204",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Baghdad",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa",
      "Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ع  -  صدوق ]",
      "Hadith"
    ],
    "tags": [
      "al-Sakuni",
      "al-Kufi",
      "Hafiz",
      "Imam"
    ]
  },
  "parents": [
    {
      "id": "15612",
      "name": "al-Walid bin Qays al-Sakuni الوليد بن قيس السكوني",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "30482",
      "name": "al-Walid bin Shuja' bin al-Sakuni الوليد بن شجاع بن الوليد بن قيس السكوني",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "teachers": [],
  "students": [
    {
      "id": "30482",
      "name": "al-Walid bin Shuja' bin al-Sakuni الوليد بن شجاع بن الوليد بن قيس السكوني",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1842",
      "hadith_no": "1842",
      "source": "Sahih Bukhari",
      "chapter": "Pilgrims Prevented from Completing the Pilgrimage - كتاب المحصر",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن عبد الرحيم، أخبرنا أبو بدر، شجاع بن الوليد عن عمر بن محمد العمري، قال وحدث نافع، أن عبد الله، وسالما، كلما عبد الله بن عمر  رضى الله عنهما  فقال خرجنا مع النبي صلى الله عليه وسلم معتمرين، فحال كفار قريش دون البيت، فنحر رسول الله صلى الله عليه وسلم بدنه، وحلق رأسه‏.‏",
      "text_en": " Narrated Nafi`:                     That `Abdullah and Salim said to `Abdullah bin `Umar, \"(You should not go for Hajj this year).\" `Abdullah bin `Umar replied, \"We set out with the Prophet (to Mecca for performing `Umra) and e infidels of Quraish prevented us from reaching the Ka`ba. Allah's Apostle slaughtered his Budn (camels for sacrifice) and got his head shaved.\"",
      "usc_msa_ref": "39",
      "chain": [
        "30272",
        "20328",
        "11530",
        "16"
      ]
    },
    {
      "id": "sahih-bukhari-4235",
      "hadith_no": "4235",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني شجاع بن الوليد، سمع النضر بن محمد، حدثنا صخر، عن نافع، قال إن الناس يتحدثون أن ابن عمر، أسلم قبل عمر، وليس كذلك، ولكن عمر يوم الحديبية أرسل عبد الله إلى فرس له عند رجل من الأنصار يأتي به ليقاتل عليه، ورسول الله صلى الله عليه وسلم يبايع عند الشجرة، وعمر لا يدري بذلك، فبايعه عبد الله، ثم ذهب إلى الفرس، فجاء به إلى عمر، وعمر يستلئم للقتال، فأخبره أن رسول الله صلى الله عليه وسلم يبايع تحت الشجرة  قال  فانطلق فذهب معه حتى بايع رسول الله صلى الله عليه وسلم، فهي التي يتحدث الناس أن ابن عمر أسلم قبل عمر‏.‏",
      "text_en": " Narrated Nafi`:                     The people used to say that Ibn `Umar had embraced Islam before `Umar. This is not true. What happened is that `Umar sent `Abdullah to bring his horse from an Ansari man so as to fight on it. At that time the people were giving the Pledge of allegiance to Allah's Apostle near the Tree, and `Umar was not aware of that. So `Abdullah (bin `Umar) gave the Pledge of Allegiance (to the Prophet) and went to take the horse and brought it to `Umar. While `Umar was putting on the armor to get ready for fighting, `Abdullah informed him that the people were giving the Pledge of allegiance to Allah's Apostle beneath the Tree. So `Umar set out and `Abdullah accompanied him till he gave the Pledge of allegiance to Allah's Apostle, and it was this event that made people say that Ibn `Umar had embraced Islam before `Umar. \"Abdullah bin `Umar added, \"The people were along with the Prophet on the day of Al-Hudaibiya spreading in the shade of the trees. Suddenly the people surrounded the Prophet and started looking at him.\" `Umar said, \"O `Abdullah! Go and see why the people are encircling Allah's Apostle and looking at him.\" `Abdullah bin `Umar then saw the people giving the Pledge o allegiance to the Prophet. So he also gave the Pledge of allegiance and returned to `Umar who went out in his turn and gave the Pledge of allegiance to the Prophet.'",
      "usc_msa_ref": "500",
      "chain": [
        "20328",
        "28603",
        "11014"
      ]
    },
    {
      "id": "sahih-muslim-5143",
      "hadith_no": "5143",
      "source": "Sahih Muslim",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثناه أبو الربيع، وقتيبة، قالا حدثنا حماد، ح وحدثني زهير بن حرب، حدثنا  إسماعيل، كلاهما عن أيوب، ح وحدثنا ابن نمير، حدثنا أبي، حدثنا مالك بن مغول، ح وحدثني  هارون بن عبد الله، أخبرنا محمد بن بكر، أخبرنا ابن جريج، ح وحدثنا هارون بن عبد، الله حدثنا شجاع بن الوليد، قال سمعت موسى بن عقبة، ح وحدثنا هارون بن سعيد، الأيلي حدثنا ابن وهب، أخبرني أسامة، كلهم عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم في الضب بمعنى حديث الليث عن نافع غير أن حديث أيوب أتي رسول الله صلى الله عليه وسلم بضب فلم يأكله ولم يحرمه وفي حديث أسامة قال قام رجل في المسجد ورسول الله صلى الله عليه وسلم على المنبر ‏.‏",
      "text_en": " A hadith pertaining to the eating of the lizard is transmitted from the Holy Prophet (may peace be upon him) on the authority of Ibn 'Umar, but in this very hadith narrated through a different chain of transmitters there is a slight variation of wording (and the words are):                     \" A lizard was brought to Allah's Messenger (may peace be upon him) but he neither ate that nor declared it unlawful.\" And in the hadith transmitted through Usama (the words are):\" The man (inquirer) was standing in the mosque and Allah's Messenger (may peace be upon him) was sitting on the pulpit.\"",
      "usc_msa_ref": "",
      "chain": [
        "30137",
        "30367",
        "20022",
        "30022",
        "11015",
        "30212",
        "20331",
        "20358",
        "30524",
        "20277",
        "11070",
        "30524",
        "20328",
        "11106"
      ]
    },
    {
      "id": "sunan-abi-daud-460",
      "hadith_no": "460",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن إسحاق أبو بكر، - يعني الصاغاني - حدثنا أبو بدر، شجاع بن الوليد حدثنا شريك، حدثنا أبو حصين، عن أبي صالح، عن أبي هريرة، - قال أبو بدر - أراه قد رفعه إلى النبي صلى الله عليه وسلم قال ‏\"‏ إن الحصاة لتناشد الذي يخرجها من المسجد ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported (Abu Bakr said that in his opinion he narrated this tradition from the Prophet):                      The gravels adjure the person when removes them from the mosque.",
      "usc_msa_ref": "",
      "chain": [
        "11107",
        "20328",
        "20587",
        "11371",
        "11161",
        "13",
        "36577"
      ]
    },
    {
      "id": "jami-al-tirmidhi-139",
      "hadith_no": "139",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا شجاع بن الوليد أبو بدر، عن علي بن عبد الأعلى، عن أبي سهل، عن مسة الأزدية، عن أم سلمة، قالت كانت النفساء تجلس على عهد رسول الله صلى الله عليه وسلم أربعين يوما فكنا نطلي وجوهنا بالورس من الكلف ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث أبي سهل عن مسة الأزدية عن أم سلمة ‏.‏ واسم أبي سهل كثير بن زياد ‏.‏ قال محمد بن إسماعيل علي بن عبد الأعلى ثقة وأبو سهل ثقة ‏.‏ ولم يعرف محمد هذا الحديث إلا من حديث أبي سهل ‏.‏ وقد أجمع أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين ومن بعدهم على أن النفساء تدع الصلاة أربعين يوما إلا أن ترى الطهر قبل ذلك فإنها تغتسل وتصلي ‏.‏ فإذا رأت الدم بعد الأربعين فإن أكثر أهل العلم قالوا لا تدع الصلاة بعد الأربعين وهو قول أكثر الفقهاء ‏.‏ وبه يقول سفيان الثوري وابن المبارك والشافعي وأحمد وإسحاق ‏.‏ ويروى عن الحسن البصري أنه قال إنها تدع الصلاة خمسين يوما إذا لم تر الطهر ‏.‏ ويروى عن عطاء بن أبي رباح والشعبي ستين يوما ‏.‏",
      "text_en": " Umm Salamah narrated:                     \"The time of waiting for Nifas during the time of AIlah's Messenger was forty days. We used to cover our faces with reddish-brown Wars.\"",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20328",
        "19877",
        "14330",
        "19523",
        "56"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3524-2",
      "hadith_no": "3524",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن حاتم المكتب، حدثنا أبو بدر، شجاع بن الوليد عن الرحيل بن معاوية، أخي زهير بن معاوية عن الرقاشي، عن أنس بن مالك، قال كان النبي صلى الله عليه وسلم إذا كربه أمر قال ‏\"‏ يا حى يا قيوم برحمتك أستغيث ‏\"‏ ‏.‏ وبإسناده قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألظوا بيا ذا الجلال والإكرام ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وقد روي هذا الحديث عن أنس من غير هذا الوجه ‏.‏",
      "text_en": " Anas bin Malik said:                     “Whenever a matter would distress him, the Prophet would say: ‘O Living, O Self-Sustaining Sustainer! Inr Your Mercy do I seek relief (Ya Hayyu Ya Qayyum, Bi-Rahmatika Astaghith).’”And with this chain, that he said: “The Messenger of Allah said: ‘Be constant with: “O Possessor of Majesty and Honor. (Ya Dhal-Jalali Wal-Ikram).’”",
      "usc_msa_ref": "",
      "chain": [
        "30514",
        "20328",
        "19"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4306",
      "hadith_no": "4306",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن يحيى الأزدي، وأحمد بن منيع، وغير، واحد، قالوا حدثنا أبو بدر، شجاع بن الوليد عن قابوس بن أبي ظبيان، عن أبيه، عن سلمان، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا سلمان لا تبغضني فتفارق دينك ‏\"‏ ‏.‏ قلت يا رسول الله كيف أبغضك وبك هدانا الله قال ‏\"‏ تبغض العرب فتبغضني ‏\"‏ ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من حديث أبي بدر شجاع بن الوليد ‏.‏ وسمعت محمد بن إسماعيل يقول أبو ظبيان لم يدرك سلمان مات سلمان قبل علي ‏.‏",
      "text_en": " Narrated Salman:                     \"The Messenger of Allah (ﷺ) said to me: 'O Salman! Do not detest me and thereby leave your religion.' I said: 'O Messenger of Allah! How could I detest you while Allah guided us by you.' He said: 'You will detest the Arabs and thereby detest me.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34251",
        "30242",
        "20328",
        "15452",
        "14"
      ]
    },
    {
      "id": "sunan-an-nasai-4375",
      "hadith_no": "4375",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا شجاع بن الوليد، قال حدثني زياد بن خيثمة، قال حدثنا أبو إسحاق، عن شريح بن النعمان، عن علي بن أبي طالب، رضى الله عنه أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يضحى بمقابلة ولا مدابرة ولا شرقاء ولا خرقاء ولا عوراء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Ali bin Abi Talib, may Allah be please wityh him, that the messenger of Allah said:                     \"Do not sacrifice and animal with its ears slit from the front, and animal with its ears slit from the back, an animals with its ears slit lengthwise, and animal with a round hole in its ears, or an animal with one bad eye.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20328",
        "20585",
        "11049",
        "5"
      ]
    },
    {
      "id": "sunan-ibn-majah-692",
      "hadith_no": "692",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا شجاع بن الوليد، عن علي بن عبد الأعلى، عن أبي سهل، عن مسة الأزدية، عن أم سلمة، قالت كانت النفساء على عهد رسول الله  صلى الله عليه وسلم  تجلس أربعين يوما وكنا نطلي وجوهنا بالورس من الكلف ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                     \"At the time of the Messenger of Allah, women in postnatal bleeding (after childbirth) used to wait for forty days, and we used to put Wars on our faces because of freckles.\"",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20328",
        "19877",
        "14330",
        "19523",
        "56"
      ]
    },
    {
      "id": "sunan-ibn-majah-1015",
      "hadith_no": "1015",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبو بدر، شجاع بن الوليد عن زياد بن خيثمة، عن أبي إسحاق، عن دارم، عن سعيد بن أبي بردة، عن أبي بردة، عن أبي موسى، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إني قد بدنت فإذا ركعت فاركعوا وإذا رفعت فارفعوا وإذا سجدت فاسجدوا ولا ألفين رجلا يسبقني إلى الركوع ولا إلى السجود ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Musa said:                      “The Messenger of Allah (ﷺ)said: ‘Ihave gained weight, so when I bow, then bow, and when I standup,then stand up, and when I prostrate, then prostrate. I shouldneverfind anyone preceding me in bowing or prostration.’”",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20328",
        "20585",
        "11049",
        "11345",
        "11901",
        "41"
      ]
    },
    {
      "id": "sunan-ibn-majah-1864",
      "hadith_no": "1864",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters Regarding Zakat - كتاب الزكاة",
      "chapter_no": "8",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا شجاع بن الوليد، حدثنا حارثة بن محمد، عن عمرة، عن عائشة، قالت سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ لا زكاة في مال حتى يحول عليه الحول ‏\"‏ ‏.‏",
      "text_en": " It was narrated that  :                     Aishah said: “I heard the Messenger of Allah(ﷺ) say: 'There is not Zakat on wealth until Hawl (one year) has passed.' ”",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20328",
        "11455",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-2370",
      "hadith_no": "2370",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا شجاع بن الوليد، حدثنا زياد بن خيثمة، عن سعد، عن عطية، عن أبي سعيد، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا أسلفت في شىء فلا تصرفه إلى غيره ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed that the Messenger of Allah (ﷺ) said:                     \"When you have paid in advance for something, do not exchange it for something else.\" (Da'if)Another chain with similar wording.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20328",
        "20585",
        "9",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-2371",
      "hadith_no": "2371",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا عبد الله بن سعيد، حدثنا شجاع بن الوليد، عن زياد بن خيثمة، عن عطية، عن أبي سعيد، قال قال رسول الله  صلى الله عليه وسلم  فذكر مثله ولم يذكر سعدا ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "11184",
        "20328",
        "20585",
        "38"
      ]
    }
  ],
  "total_hadiths": 13
}