{
  "id": "20320",
  "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
  "full_name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "160",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-Thaqifi",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11368",
      "name": "'Abdul Malik bin 'Umayr al-Qabti عبد الملك بن عمير بن سويد القبطي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10743",
      "name": "Isma'il bin 'Abdur Rahman al-Saddi إسماعيل بن عبد الرحمن السدي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11339",
      "name": "Ziyad bin 'Alaqa زياد بن علاقة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10770",
      "name": "Smak bin Hrb bin Aws سماك بن حرب بن أوس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11430",
      "name": "Shbyb bin Ghrqd'h شبيب بن غرقدة",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10962",
      "name": "Mukhtar bin Falfal مختار بن فلفل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11352",
      "name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11061",
      "name": "Abu al-Zanad أبو الزناد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11311",
      "name": "Hisham bin Hassan al-Azdi هشام بن حسان الأزدي القردوسي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20315",
      "name": "al-Husain bin 'Ali bin al-Walid al-Ja'fi الحسين بن علي بن الوليد الجعفي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20005",
      "name": "Sufyan bin 'Uyaynah سفيان بن عيينة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20405",
      "name": "Ibrahim bin Muhammad bin al-Harith إبراهيم بن محمد أبو اسحاق الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20296",
      "name": "Hisham bin 'Abdul Malik al-Tayalasi هشام بن عبد الملك أبو الوليد الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30197",
      "name": "Talq bin Ghanam طلق بن غنام",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20389",
      "name": "Mua'wiya bin 'Amr bin al-Mhlb معاوية بن عمرو بن المهلب بن عمرو",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20290",
      "name": "Abu Hudhayfa al-Nahdi موسى بن مسعود أبو حذيفة النهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30184",
      "name": "Ahmad bin Yunus",
      "grade": "Thiqah (Trustworthy)"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "269",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا زائدة، عن أبي حصين، عن أبي عبد الرحمن، عن علي، قال كنت رجلا مذاء فأمرت رجلا أن يسأل النبي صلى الله عليه وسلم لمكان ابنته فسأل فقال ‏\"‏ توضأ واغسل ذكرك ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     I used to get emotional urethral discharge frequently. Being the son-in-law of the Prophet I requested a man to ask him about it. So the man asked the Prophet about it. The Prophet replied, \"Perform ablution after washing your organ (penis).",
      "chain": [
        "20296",
        "20320",
        "11371",
        "11359",
        "5"
      ]
    },
    {
      "hadith_no": "572",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الرحيم المحاربي، قال حدثنا زائدة، عن حميد الطويل، عن أنس، قال أخر النبي صلى الله عليه وسلم صلاة العشاء إلى نصف الليل، ثم صلى ثم قال ‏\"‏ قد صلى الناس وناموا، أما إنكم في صلاة ما انتظرتموها ‏\"‏‏.‏ وزاد ابن أبي مريم أخبرنا يحيى بن أيوب حدثني حميد سمع أنسا كأني أنظر إلى وبيص خاتمه ليلتئذ‏.‏",
      "text_en": " Narrated Anas:                     The Prophet delayed the `Isha' prayer till midnight and then he offered the prayer and said, \"The people prayed and slept but you have been in prayer as long as you have been waiting for it (the prayer).\" Anas added: As if I am looking now at the glitter of the ring of the Prophet on that night.",
      "chain": [
        "30202",
        "20320",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "678",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق بن نصر، قال حدثنا حسين، عن زائدة، عن عبد الملك بن عمير، قال حدثني أبو بردة، عن أبي موسى، قال مرض النبي صلى الله عليه وسلم فاشتد مرضه فقال ‏\"‏ مروا أبا بكر فليصل بالناس ‏\"‏‏.‏ قالت عائشة إنه رجل رقيق، إذا قام مقامك لم يستطع أن يصلي بالناس‏.‏ قال ‏\"‏ مروا أبا بكر فليصل بالناس ‏\"‏ فعادت فقال ‏\"‏ مري أبا بكر فليصل بالناس، فإنكن صواحب يوسف ‏\"‏‏.‏ فأتاه الرسول فصلى بالناس في حياة النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Musa:                     \"The Prophet became sick and when his disease became aggravated, he said, \"Tell Abu Bakr to lead the prayer.\" `Aisha said, \"He is a softhearted man and would not be able to lead the prayer in your place.\" The Prophet said again, \"Tell Abu Bakr to lead the people in prayer.\" She repeated the same reply but he said, \"Tell Abu Bakr to lead the people in prayer. You are the companions of Joseph.\" So the messenger went to Abu Bakr (with that order) and he led the people in prayer in the lifetime of the Prophet.",
      "chain": [
        "30311",
        "11278",
        "20320",
        "11368",
        "1820",
        "41"
      ]
    },
    {
      "hadith_no": "687",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن يونس، قال حدثنا زائدة، عن موسى بن أبي عائشة، عن عبيد الله بن عبد الله بن عتبة، قال دخلت على عائشة فقلت ألا تحدثيني عن مرض رسول الله صلى الله عليه وسلم قالت بلى، ثقل النبي صلى الله عليه وسلم فقال ‏\"‏ أصلى الناس ‏\"‏‏.‏ قلنا لا، هم ينتظرونك‏.‏ قال ‏\"‏ ضعوا لي ماء في المخضب ‏\"‏‏.‏ قالت ففعلنا فاغتسل فذهب لينوء فأغمي عليه، ثم أفاق فقال صلى الله عليه وسلم ‏\"‏ أصلى الناس ‏\"‏‏.‏ قلنا لا، هم ينتظرونك يا رسول الله‏.‏ قال ‏\"‏ ضعوا لي ماء في المخضب ‏\"‏‏.‏ قالت فقعد فاغتسل، ثم ذهب لينوء فأغمي عليه، ثم أفاق فقال ‏\"‏ أصلى الناس ‏\"‏‏.‏ قلنا لا، هم ينتظرونك يا رسول الله‏.‏ فقال ‏\"‏ ضعوا لي ماء في المخضب ‏\"‏، فقعد فاغتسل، ثم ذهب لينوء فأغمي عليه، ثم أفاق فقال ‏\"‏ أصلى الناس ‏\"‏‏.‏ فقلنا لا، هم ينتظرونك يا رسول الله  والناس عكوف في المسجد ينتظرون النبي عليه السلام لصلاة العشاء الآخرة  فأرسل النبي صلى الله عليه وسلم إلى أبي بكر بأن يصلي بالناس، فأتاه الرسول فقال إن رسول الله صلى الله عليه وسلم يأمرك أن تصلي بالناس‏.‏ فقال أبو بكر  وكان رجلا رقيقا  يا عمر صل بالناس‏.‏ فقال له عمر أنت أحق بذلك‏.‏ فصلى أبو بكر تلك الأيام، ثم إن النبي صلى الله عليه وسلم وجد من نفسه خفة فخرج بين رجلين أحدهما العباس لصلاة الظهر، وأبو بكر يصلي بالناس، فلما رآه أبو بكر ذهب ليتأخر فأومأ إليه النبي صلى الله عليه وسلم بأن لا يتأخر‏.‏ قال ‏\"‏ أجلساني إلى جنبه ‏\"‏‏.‏ فأجلساه إلى جنب أبي بكر‏.‏ قال فجعل أبو بكر يصلي وهو يأتم بصلاة النبي صلى الله عليه وسلم والناس بصلاة أبي بكر، والنبي صلى الله عليه وسلم قاعد‏.‏ قال عبيد الله فدخلت على عبد الله بن عباس فقلت له ألا أعرض عليك ما حدثتني عائشة عن مرض النبي صلى الله عليه وسلم قال هات‏.‏ فعرضت عليه حديثها، فما أنكر منه شيئا، غير أنه قال أسمت لك الرجل الذي كان مع العباس قلت لا‏.‏ قال هو علي‏.‏",
      "text_en": " Narrated 'Ubaidullah Ibn `Abdullah bin `Utba:                     I went to `Aisha and asked her to describe to me the illness of Allah's Apostle. `Aisha said, \"Yes. The Prophet became seriously ill and asked whether the people had prayed. We replied, 'No. O Allah's Apostle! They are waiting for you.' He added, 'Put water for me in a trough.\" `Aisha added, \"We did so. He took a bath and tried to get up but fainted. When he recovered, he again asked whether the people had prayed. We said, 'No, they are waiting for you. O Allah's Apostle,' He again said, 'Put water in a trough for me.' He sat down and took a bath and tried to get up but fainted again. Then he recovered and said, 'Have the people prayed?' We replied, 'No, they are waiting for you. O Allah's Apostle.' He said, 'Put water for me in the trough.' Then he sat down and washed himself and tried to get up but he fainted. When he recovered, he asked, 'Have the people prayed?' We said, 'No, they are waiting for you. O Allah's Apostle! The people were in the mosque waiting for the Prophet for the `Isha prayer. The Prophet sent for Abu Bakr to lead the people in the prayer. The messenger went to Abu Bakr and said, 'Allah's Apostle orders you to lead the people in the prayer.' Abu Bakr was a softhearted man, so he asked `Umar to lead the prayer but `Umar replied, 'You are more rightful.' So Abu Bakr led the prayer in those days. When the Prophet felt a bit better, he came out for the Zuhr prayer with the help of two persons one of whom was Al-`Abbas. while Abu Bakr was leading the people in the prayer. When Abu Bakr saw him he wanted to retreat but the Prophet beckoned him not to do so and asked them to make him sit beside Abu Bakr and they did so. Abu Bakr was following the Prophet (in the prayer) and the people were following Abu Bakr. The Prophet (prayed) sitting.\" 'Ubaidullah added \"I went to `Abdullah bin `Abbas and asked him, Shall I tell you what Aisha has told me about the fatal illness of the Prophet?' Ibn `Abbas said, 'Go ahead. I told him her narration and he did not deny anything of it but asked whether `Aisha told me the name of the second person (who helped the Prophet ) along with Al-Abbas. I said. 'No.' He said, 'He was `Ali (Ibn Abi Talib).",
      "chain": [
        "30184",
        "20320",
        "11399",
        "11004"
      ]
    },
    {
      "hadith_no": "719",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن أبي رجاء، قال حدثنا معاوية بن عمرو، قال حدثنا زائدة بن قدامة، قال حدثنا حميد الطويل، حدثنا أنس، قال أقيمت الصلاة فأقبل علينا رسول الله صلى الله عليه وسلم بوجهه فقال ‏\"‏ أقيموا صفوفكم وتراصوا، فإني أراكم من وراء ظهري ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Once the Iqama was pronounced and Allah's Apostle faced us and said, \"Straighten your rows and stand closer together, for I see you from behind my back.'",
      "chain": [
        "30300",
        "20389",
        "20320",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "936",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا معاوية بن عمرو، قال حدثنا زائدة، عن حصين، عن سالم بن أبي الجعد، قال حدثنا جابر بن عبد الله، قال بينما نحن نصلي مع النبي صلى الله عليه وسلم إذ أقبلت عير تحمل طعاما، فالتفتوا إليها حتى ما بقي مع النبي صلى الله عليه وسلم إلا اثنا عشر رجلا، فنزلت هذه الآية ‏{‏وإذا رأوا تجارة أو لهوا انفضوا إليها وتركوك قائما‏}‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     While we were praying (Jumua Khutba & prayer) with the Prophet (p.b.u.h), some camels loaded with food, arrived (from Sham). The people diverted their attention towards the camels (and left the mosque), and only twelve persons remained with the Prophet. So this verse was revealed: \"But when they see Some bargain or some amusement, They disperse headlong to it, And leave you standing.\" (62.11)",
      "chain": [
        "20389",
        "20320",
        "15097",
        "11342",
        "34"
      ]
    },
    {
      "hadith_no": "1003",
      "source": " Sahih Bukhari ",
      "chapter": "Witr Prayer - كتاب الوتر",
      "chapter_no": "14",
      "text_ar": "أخبرنا أحمد بن يونس، قال حدثنا زائدة، عن التيمي، عن أبي مجلز، عن أنس، قال قنت النبي صلى الله عليه وسلم شهرا يدعو على رعل وذكوان‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet recited Qunut for one month (in the Fajr prayer) asking Allah to punish the tribes of Ral and Dhakwan.",
      "chain": [
        "30184",
        "20320",
        "11289",
        "11313",
        "19"
      ]
    },
    {
      "hadith_no": "1054",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا ربيع بن يحيى، قال حدثنا زائدة، عن هشام، عن فاطمة، عن أسماء، قالت لقد أمر النبي صلى الله عليه وسلم بالعتاقة في كسوف الشمس‏.‏",
      "text_en": " Narrated Asma:                     No doubt the Prophet ordered people to manumit slaves during the solar eclipse.",
      "chain": [
        "30133",
        "20320",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "1060",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو الوليد، قال حدثنا زائدة، قال حدثنا زياد بن علاقة، قال سمعت المغيرة بن شعبة، يقول انكسفت الشمس يوم مات إبراهيم، فقال الناس انكسفت لموت إبراهيم‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الشمس والقمر آيتان من آيات الله، لا ينكسفان لموت أحد ولا لحياته، فإذا رأيتموهما فادعوا الله وصلوا حتى ينجلي ‏\"‏‏.‏",
      "text_en": " Narrated Al-Mughira bin Shu`ba:                     On the day of Ibrahim's death, the sun eclipsed and the people said that the eclipse was due to the death of Ibrahim (the son of the Prophet). Allah's Apostle said, \"The sun and the moon are two signs amongst the signs of Allah. They do not eclipse because of someone's death or life. So when you see them, invoke Allah and pray till the eclipse is clear.\"",
      "chain": [
        "20296",
        "20320",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "1326",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا يحيى بن أبي بكير، حدثنا زائدة، حدثنا أبو إسحاق الشيباني، عن عامر، عن ابن عباس  رضى الله عنهما  قال أتى رسول الله صلى الله عليه وسلم قبرا، فقالوا هذا دفن، أو دفنت البارحة‏.‏ قال ابن عباس  رضى الله عنهما  فصفنا خلفه ثم صلى عليها‏.‏",
      "text_en": " Narrated 'Amir:                     Ibn `Abbas (who was at that time a boy) said, \"Allah's Apostle came to a grave and the people said, 'He or she was buried yesterday.' \" Ibn `Abbas added, \"We aligned behind the Prophet and he led the funeral prayer of the deceased.\"",
      "chain": [
        "20184",
        "20365",
        "20320",
        "11352",
        "11052",
        "17"
      ]
    },
    {
      "hadith_no": "1953",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن عبد الرحيم، حدثنا معاوية بن عمرو، حدثنا زائدة، عن الأعمش، عن مسلم البطين، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله إن أمي ماتت، وعليها صوم شهر، أفأقضيه عنها قال ‏\"‏ نعم  قال  فدين الله أحق أن يقضى ‏\"‏‏.‏ قال سليمان فقال الحكم وسلمة، ونحن جميعا جلوس حين حدث مسلم بهذا الحديث  قالا  سمعنا مجاهدا يذكر هذا عن ابن عباس‏.‏ ويذكر عن أبي خالد، حدثنا الأعمش، عن الحكم، ومسلم البطين، وسلمة بن كهيل، عن سعيد بن جبير، وعطاء، ومجاهد، عن ابن عباس، قالت امرأة للنبي صلى الله عليه وسلم إن أختي ماتت‏.‏ وقال يحيى وأبو معاوية حدثنا الأعمش عن مسلم عن سعيد عن ابن عباس قالت امرأة للنبي صلى الله عليه وسلم إن أمي ماتت‏.‏ وقال عبيد الله عن زيد بن أبي أنيسة عن الحكم عن سعيد بن جبير عن ابن عباس قالت امرأة للنبي صلى الله عليه وسلم إن أمي ماتت وعليها صوم نذر‏.‏ وقال أبو حريز حدثنا عكرمة عن ابن عباس قالت امرأة للنبي صلى الله عليه وسلم ماتت أمي وعليها صوم خمسة عشر يوما‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A man came to the Prophet and said, \"O Allah's Apostle! My mother died and she ought to have fasted one month (for her missed Ramadan). Shall I fast on her behalf?\" The Prophet replied in the affirmative and said, \"Allah's debts have more right to be paid.\" In another narration a woman is reported to have said, \"My sister died...\" Narrated Ibn `Abbas: A woman said to the Prophet \"My mother died and she had vowed to fast but she didn't fast.\" In another narration Ibn `Abbas is reported to have said, \"A woman said to the Prophet, \"My mother died while she ought to have fasted for fifteen days.\"",
      "chain": [
        "30272",
        "20389",
        "20320",
        "11060",
        "11393",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2058",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا طلق بن غنام، حدثنا زائدة، عن حصين، عن سالم، قال حدثني جابر  رضى الله عنه  قال بينما نحن نصلي مع النبي صلى الله عليه وسلم إذ أقبلت من الشأم عير، تحمل طعاما، فالتفتوا إليها، حتى ما بقي مع النبي صلى الله عليه وسلم إلا اثنا عشر رجلا فنزلت ‏{‏وإذا رأوا تجارة أو لهوا انفضوا إليها‏}‏",
      "text_en": " Narrated Jabir:                     While we were offering the prayer with the Prophet a caravan carrying food came from Sham. The people looked towards the caravan (and went to it) and only twelve persons remained with the Prophet. So, the Divine Inspiration came; \"But when they see some bargain or some amusement, they disperse headlong to it.\" (62.11)",
      "chain": [
        "30197",
        "20320",
        "15097",
        "11011",
        "34"
      ]
    },
    {
      "hadith_no": "2519",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا موسى بن مسعود، حدثنا زائدة بن قدامة، عن هشام بن عروة، عن فاطمة بنت المنذر، عن أسماء بنت أبي بكر  رضى الله عنهما  قالت أمر النبي صلى الله عليه وسلم بالعتاقة في كسوف الشمس‏.‏ تابعه علي عن الدراوردي عن هشام‏.‏",
      "text_en": " Narrated Asma' bint Abu Bakr:                     The Prophet ordered us to free slaves at the time of solar eclipses.",
      "chain": [
        "20290",
        "20320",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "3331",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا أبو كريب، وموسى بن حزام، قالا حدثنا حسين بن علي، عن زائدة، عن ميسرة الأشجعي، عن أبي حازم، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ استوصوا بالنساء، فإن المرأة خلقت من ضلع، وإن أعوج شىء في الضلع أعلاه، فإن ذهبت تقيمه كسرته، وإن تركته لم يزل أعوج، فاستوصوا بالنساء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah 's Apostle said, \"Treat women nicely, for a women is created from a rib, and the most curved portion of the rib is its upper portion, so, if you should try to straighten it, it will break, but if you leave it as it is, it will remain crooked. So treat women nicely.\"",
      "chain": [
        "30216",
        "30394",
        "20315",
        "20320",
        "11658",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "3385",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا الربيع بن يحيى البصري، حدثنا زائدة، عن عبد الملك بن عمير، عن أبي بردة بن أبي موسى، عن أبيه، قال مرض النبي صلى الله عليه وسلم فقال ‏\"‏ مروا أبا بكر فليصل بالناس ‏\"‏‏.‏ فقالت إن أبا بكر رجل‏.‏ فقال مثله فقالت مثله‏.‏ فقال ‏\"‏ مروه فإنكن صواحب يوسف ‏\"‏‏.‏ فأم أبو بكر في حياة رسول الله صلى الله عليه وسلم‏.‏ فقال حسين عن زائدة رجل رقيق‏.‏",
      "text_en": " Narrated Abu Musa:                     When the Prophet fell ill, he said, \"Order Abu Bakr to lead the people in prayer.\" `Aisha said, \"Abu Bakr is a soft-hearted person. The Prophet gave the same order again and she again gave the same reply. He again said, \"Order Abu Bakr (to lead the prayer)! You are (like) the female companions of Joseph.\" Consequently Abu Bakr led the people in prayer in the life-time of the Prophet.",
      "chain": [
        "30133",
        "20320",
        "11368",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "3751",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا محمد بن رافع، حدثنا حسين، عن زائدة، عن أبي حصين، عن سعد بن عبيدة، قال جاء رجل إلى ابن عمر، فسأله عن عثمان،، فذكر عن محاسن، عمله، قال لعل ذاك يسوؤك‏.‏ قال نعم‏.‏ قال فأرغم الله بأنفك‏.‏ ثم سأله عن علي، فذكر محاسن عمله قال هو ذاك، بيته أوسط بيوت النبي صلى الله عليه وسلم‏.‏ ثم قال لعل ذاك يسوؤك‏.‏ قال أجل‏.‏ قال فأرغم الله بأنفك، انطلق فاجهد على جهدك‏.‏",
      "text_en": " Narrated Sa`d bin 'Ubaida:                     A man came to Ibn `Umar and asked about `Uthman and Ibn `Umar mentioned his good deeds and said to the questioner. \"Perhaps these facts annoy you?\" The other said, \"Yes.\" Ibn `Umar said, \"May Allah stick your nose in the dust (i.e. degrade you)!' Then the man asked him about `Ali. Ibn `Umar mentioned his good deeds and said, \"It is all true, and that is his house in the midst of the houses of the Prophet. Perhaps these facts have hurt you?\" The questioner said, \"Yes.\" Ibn `Umar said, \"May Allah stick your nose in the dust (i.e. degrade you or make you do things which you hate) ! Go away and do whatever you can against me.\"",
      "chain": [
        "30375",
        "11278",
        "20320",
        "11371",
        "11344"
      ]
    },
    {
      "hadith_no": "4275",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا الحسن بن إسحاق، حدثنا محمد بن سابق، حدثنا زائدة، عن عبيد الله بن عمر، عن نافع، عن ابن عمر  رضى الله عنهما  قال قسم رسول الله صلى الله عليه وسلم يوم خيبر للفرس سهمين، وللراجل سهما‏.‏ قال فسره نافع فقال إذا كان مع الرجل فرس فله ثلاثة أسهم، فإن لم يكن له فرس فله سهم‏.‏",
      "text_en": " Narrated Ibn `Umar:                     On the day of Khaibar, Allah's Apostle divided (the war booty of Khaibar) with the ratio of two shares for the horse and one-share for the foot soldier. (The sub-narrator, Nafi` explained this, saying, \"If a man had a horse, he was given three shares and if he had no horse, then he was given one share.\")",
      "chain": [
        "30323",
        "30209",
        "20320",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4770",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني طلق بن غنام، حدثنا زائدة، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت أنزل ذلك في الدعاء‏.‏",
      "text_en": " Narrated Aisha:                     The (above) verse was revealed in connection with the invocations.",
      "chain": [
        "30197",
        "20320",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4906",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا طلق بن غنام، حدثنا زائدة، عن الشيباني، قال سألت زرا عن قوله تعالى ‏{‏فكان قاب قوسين أو أدنى * فأوحى إلى عبده ما أوحى‏}‏ قال أخبرنا عبد الله أن محمدا صلى الله عليه وسلم رأى جبريل له ستمائة جناح‏.‏",
      "text_en": " Narrated Ash-Shaibani:                     I asked Zirr about the Statement of Allah: 'And was at a distance of but two bow-lengths or (even) nearer. So did Allah convey the Inspiration to His slave (Gabriel) and then he (Gabriel) conveyed that to Muhammad.' (53.10) He said, \"Abdullah (bin Mas`ud) informed us that Muhammad had seen Gabriel with six hundred wings.\"",
      "chain": [
        "30197",
        "20320",
        "11352",
        "11337",
        "16"
      ]
    },
    {
      "hadith_no": "5090",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا ربيع بن يحيى، حدثنا زائدة، حدثنا هشام، عن عروة، عن عائشة  رضى الله عنها  قالت سمع النبي صلى الله عليه وسلم رجلا يقرأ في المسجد فقال ‏\"‏ يرحمه الله لقد أذكرني كذا وكذا آية من سورة كذا ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     The Prophet heard a man reciting the Qur'an in the mosque and said, \"May Allah bestow His Mercy on him, as he has reminded me of such-and-such Verses of such a Surah.\"",
      "chain": [
        "30133",
        "20320",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5179",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "وقال لي طلق حدثنا زائدة، عن منصور، عن مجاهد، عن ابن عباس، ‏{‏فيما عرضتم‏}‏ يقول إني أريد التزويج، ولوددت أنه تيسر لي امرأة صالحة‏.‏ وقال القاسم يقول إنك على كريمة، وإني فيك لراغب، وإن الله لسائق إليك خيرا‏.‏ أو نحو هذا‏.‏ وقال عطاء يعرض ولا يبوح يقول إن لي حاجة وأبشري، وأنت بحمد الله نافقة‏.‏ وتقول هي قد أسمع ما تقول‏.‏ ولا تعد شيئا ولا يواعد وليها بغير علمها، وإن واعدت رجلا في عدتها ثم نكحها بعد لم يفرق بينهما‏.‏ وقال الحسن ‏{‏لا تواعدوهن سرا‏}‏ الزنا‏.‏ ويذكر عن ابن عباس ‏{‏الكتاب أجله‏}‏ تنقضي العدة‏.‏",
      "text_en": "",
      "chain": [
        "20320",
        "11067",
        "11028",
        "10535"
      ]
    },
    {
      "hadith_no": "5240",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا إسحاق بن نصر، حدثنا حسين الجعفي، عن زائدة، عن ميسرة، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من كان يؤمن بالله واليوم الآخر فلا يؤذي جاره ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Whoever believes in Allah and the Last Day should not hurt (trouble) his neighbor. And I advise you to take care of the women, for they are created from a rib and the most crooked portion of the rib is its upper part; if you try to straighten it, it will break, and if you leave it, it will remain crooked, so I urge you to take care of the women.\"",
      "chain": [
        "30311",
        "20315",
        "20320",
        "11658",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "6270",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا أبو الوليد، حدثنا زائدة، حدثنا زياد بن علاقة، سمعت المغيرة بن شعبة، قال انكسفت الشمس يوم مات إبراهيم‏.‏ رواه أبو بكرة عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Al-Mughira bin Shuba:                     Solar eclipse occurred on the day of Ibrahim's death (the Prophet's son).",
      "chain": [
        "20296",
        "20320",
        "11339",
        "166",
        "3229"
      ]
    },
    {
      "hadith_no": "6448",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا الحسين، عن زائدة، عن عبد الملك، عن مصعب، عن أبيه، قال تعوذوا بكلمات كان النبي صلى الله عليه وسلم يتعوذ بهن ‏\"‏ اللهم إني أعوذ بك من الجبن، وأعوذ بك من البخل، وأعوذ بك من أن أرد إلى أرذل العمر، وأعوذ بك من فتنة الدنيا، وعذاب القبر ‏\"‏‏.‏",
      "text_en": " Narrated Sa`d:                     Seek refuge with Allah by saying the words which the Prophet used to say while seeking refuge with Allah, \"0 Allah! I seek refuge with You from cowardice, and seek refuge with You from miserliness, and seek refuge with You from reaching a degraded geriatric old age, and seek refuge with You from the afflictions of the world and from the punishment in the grave.\"",
      "chain": [
        "30123",
        "11278",
        "20320",
        "11368",
        "10556",
        "9"
      ]
    },
    {
      "hadith_no": "6994",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثني محمد بن عبد الله، حدثنا محمد بن سابق، حدثنا زائدة، حدثنا هشام بن عروة، عن أبيه، أنه سمع المغيرة بن شعبة، يحدث عن عمر، أنه استشارهم في إملاص المرأة مثله‏.‏",
      "text_en": " Narrated `Urwa:                     I heard Al-Maghira bin Shu`ba narrating that `Umar had consulted them about the case of abortion (similarly as narrated in No. 42).",
      "chain": [
        "30561",
        "30209",
        "20320",
        "11065",
        "10511",
        "166",
        "3"
      ]
    },
    {
      "hadith_no": "7526",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عبدة بن عبد الله، حدثنا حسين الجعفي، عن زائدة، حدثنا بيان بن بشر، عن قيس بن أبي حازم، حدثنا جرير، قال خرج علينا رسول الله صلى الله عليه وسلم ليلة البدر فقال ‏\"‏ إنكم سترون ربكم يوم القيامة كما ترون هذا، لا تضامون في رؤيته ‏\"‏‏.‏",
      "text_en": " Narrated Jarir:                     Allah's Apostle came out to us on the night of the full moon and said, \"You will see your Lord on the Day of Resurrection as you see this (full moon) and you will have no difficulty in seeing Him.\"",
      "chain": [
        "30149",
        "20315",
        "20320",
        "11326",
        "11046",
        "4057"
      ]
    },
    {
      "hadith_no": "54",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا أحمد، - يعني ابن يونس - حدثنا زائدة، عن الأعمش، عن إبراهيم، أن الحارث، قال تعلمت القرآن في ثلاث سنين والوحى في سنتين - أو قال الوحى في ثلاث سنين والقرآن في سنتين ‏.‏",
      "text_en": "",
      "chain": [
        "38834",
        "30184",
        "20320",
        "11060",
        "11051"
      ]
    },
    {
      "hadith_no": "55",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني حجاج، قال حدثني أحمد، - وهو ابن يونس - حدثنا زائدة، عن منصور، والمغيرة، عن إبراهيم، أن الحارث، اتهم ‏.‏",
      "text_en": "",
      "chain": [
        "20219",
        "30184",
        "20320",
        "11067",
        "166",
        "20150"
      ]
    },
    {
      "hadith_no": "155",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا القاسم بن زكرياء، حدثنا حسين، عن زائدة، عن أبي حصين، عن الأسود بن هلال، قال سمعت معاذا، يقول دعاني رسول الله صلى الله عليه وسلم فأجبته فقال ‏\"‏ هل تدري ما حق الله على الناس ‏\"‏ ‏.‏ نحو حديثهم ‏.‏",
      "text_en": " It is narrated on the authority of Aswad b. Hilal that he heard Mu'adh say this:                      The Messenger of Allah (may peace be upon him) called, me and I replied to him. He (the Holy Prophet) said: Do you know the right of Allah upon the people? and then followed the hadith (mentioned above).",
      "chain": [
        "11278",
        "20320",
        "11371",
        "11620",
        "32"
      ]
    },
    {
      "hadith_no": "348",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني زهير بن حرب، حدثنا وكيع، حدثنا مسعر، وهشام، ح وحدثني إسحاق بن منصور، أخبرنا الحسين بن علي، عن زائدة، عن شيبان، جميعا عن قتادة، بهذا الإسناد مثله ‏.‏",
      "text_en": " The same hadith has been narrated by Zuhair b. Harb, Waki, Ishaq b. Mansur, Husain b. 'Ali.",
      "chain": [
        "30022",
        "20032",
        "20359",
        "11065",
        "30313",
        "20315",
        "20320"
      ]
    },
    {
      "hadith_no": "382",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني القاسم بن زكرياء، حدثنا حسين، - يعني الجعفي - عن زائدة، عن هشام، قال قال الحسن كنا عند معقل بن يسار نعوده فجاء عبيد الله بن زياد فقال له معقل إني سأحدثك حديثا سمعته من رسول الله صلى الله عليه وسلم ثم ذكر بمعنى حديثهما ‏.‏",
      "text_en": " Hasan reported:                      We were with Ma'qil b. Yasar inquiring about his health that Ubaidullah b. Ziyad came there. Ma'qil said to him: Verily I am going to narrate to you a hadith which I heard from the Messenger of Allah (may peace be upon him). Then he narrated the hadith like those two (mentioned above).",
      "chain": [
        "20315",
        "20320",
        "11065"
      ]
    },
    {
      "hadith_no": "415",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن عبد الله بن ذكوان، عن عبد الرحمن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم ح",
      "text_en": "",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "506",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن المختار بن فلفل، قال قال أنس بن مالك قال النبي صلى الله عليه وسلم ‏\"‏ أنا أول شفيع في الجنة لم يصدق نبي من الأنبياء ما صدقت وإن من الأنبياء نبيا ما يصدقه من أمته إلا رجل واحد ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik said:                      The Apostle of Allah (may peace be upon him) said: I would be the first intercessor in the Paradise and no apostle amongst the apostles has been testified (by such a large number of people) as I have been testified. And verily there woald be an apostle among the apostles who would be testified to by only one man from his people.",
      "chain": [
        "30201",
        "20315",
        "20320",
        "10962",
        "19"
      ]
    },
    {
      "hadith_no": "526",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني عمرو الناقد، حدثنا معاوية بن عمرو، حدثنا زائدة، حدثنا عبد الله بن ذكوان، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم نحو هذا ‏.‏",
      "text_en": " This hadith is narrated from the Apostle (may peace be upon him) by another chain of narrators, 'Amr al-Naqid, Mu'awiya b. 'Amr, Abdullah b. Dhakwan, A'raj on the authority of Abu Huraira.",
      "chain": [
        "30263",
        "20389",
        "20320",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "224",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، قال أبو بكر ووكيع عن إسرائيل، كلهم عن سماك بن حرب، بهذا الإسناد عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this is narrated from the Apostle (may peace be upon him) with the same chain of transmitters by Muhammad b. Muthanna, Ibn Bashshar, Muhammad b. Ja'far, Shu'ba.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "30201",
        "20315",
        "20320",
        "20311",
        "10770",
        "18"
      ]
    },
    {
      "hadith_no": "297",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن منصور، عن إبراهيم، عن الأسود، عن عائشة، قالت كنت أغسل رأس رسول الله صلى الله عليه وسلم وأنا حائض ‏.‏",
      "text_en": " Al-Aswad narrated it from 'A'isha that she observed:                      I used to wash the head of the Messenger of Allah (may peace be upon him), while I was in a state of menstruation.",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "316",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثناه عمرو الناقد، حدثنا معاوية بن عمرو، حدثنا زائدة، عن هشام، قال أخبرني عروة، عن عائشة، أن رسول الله صلى الله عليه وسلم كان إذا اغتسل من الجنابة بدأ فغسل يديه قبل أن يدخل يده في الإناء ثم توضأ مثل وضوئه للصلاة ‏.‏",
      "text_en": " 'Urwa has narrated it on the authority of 'A'isha that when Allah's Messenger (may peace be upon him) took a bath because of sexual intercourse, he first washed his hands before dipping one of them into the basin, and then performed ablu- tion as is done for prayer.",
      "chain": [
        "30263",
        "20389",
        "20320",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "337",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا موسى القارئ، حدثنا زائدة، عن الأعمش، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس، عن ميمونة، قالت وضعت للنبي صلى الله عليه وسلم ماء وسترته فاغتسل ‏.‏",
      "text_en": " Maimuna reported:                      I placed water for the Apostle (may peace be upon him) and provided privacy for him, and he took a bath.",
      "chain": [
        "30021",
        "20320",
        "11060",
        "11342",
        "11211",
        "17",
        "61"
      ]
    },
    {
      "hadith_no": "360",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا معاوية بن عمرو، حدثنا زائدة، عن سماك، ح وحدثني القاسم بن زكرياء، حدثنا عبيد الله بن موسى، عن شيبان، عن عثمان بن عبد الله بن موهب، وأشعث بن أبي الشعثاء، كلهم عن جعفر بن أبي ثور، عن جابر بن سمرة، عن النبي صلى الله عليه وسلم بمثل حديث أبي كامل عن أبي عوانة ‏.‏",
      "text_en": " This hadith is also narrated by another chain of transmitters.",
      "chain": [
        "30201",
        "20389",
        "20320",
        "10770",
        "20340",
        "20240",
        "11524",
        "10896",
        "393"
      ]
    },
    {
      "hadith_no": "402",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد بن حميد، حدثنا حسين الجعفي، عن زائدة، عن منصور، بهذا الإسناد مثل حديثهما وذكر في الحديث ‏\"‏ ثم ليتخير بعد من المسألة ما شاء أو ما أحب ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Mansur with the same chain of transmitters and he made a mention of this:                     \" Then he may choose any supplication which pleases him or which he likes.\"",
      "chain": [
        "30553",
        "20315",
        "20320"
      ]
    },
    {
      "hadith_no": "418",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن عبد الله بن يونس، حدثنا زائدة، حدثنا موسى بن أبي عائشة، عن عبيد الله بن عبد الله، قال دخلت على عائشة فقلت لها ألا تحدثيني عن مرض رسول الله صلى الله عليه وسلم قالت بلى ثقل النبي صلى الله عليه وسلم فقال ‏\"‏ أصلى الناس ‏\"‏ ‏.‏ قلنا لا وهم ينتظرونك يا رسول الله ‏.‏ قال ‏\"‏ ضعوا لي ماء في المخضب ‏\"‏ ‏.‏ ففعلنا فاغتسل ثم ذهب لينوء فأغمي عليه ثم أفاق فقال ‏\"‏ أصلى الناس ‏\"‏ ‏.‏ قلنا لا وهم ينتظرونك يا رسول الله ‏.‏ فقال ‏\"‏ ضعوا لي ماء في المخضب ‏\"‏ ‏.‏ ففعلنا فاغتسل ثم ذهب لينوء فأغمي عليه ثم أفاق فقال ‏\"‏ أصلى الناس ‏\"‏ ‏.‏ قلنا لا وهم ينتظرونك يا رسول الله ‏.‏ فقال ‏\"‏ ضعوا لي ماء في المخضب ‏\"‏ ‏.‏ ففعلنا فاغتسل ثم ذهب لينوء فأغمي عليه ثم أفاق فقال ‏\"‏ أصلى الناس ‏\"‏ ‏.‏ فقلنا لا وهم ينتظرونك يا رسول الله ‏.‏ قالت والناس عكوف في المسجد ينتظرون رسول الله صلى الله عليه وسلم لصلاة العشاء الآخرة - قالت - فأرسل رسول الله صلى الله عليه وسلم إلى أبي بكر أن يصلي بالناس فأتاه الرسول فقال إن رسول الله صلى الله عليه وسلم يأمرك أن تصلي بالناس ‏.‏ فقال أبو بكر وكان رجلا رقيقا يا عمر صل بالناس ‏.‏ قال فقال عمر أنت أحق بذلك ‏.‏ قالت فصلى بهم أبو بكر تلك الأيام ثم إن رسول الله صلى الله عليه وسلم وجد من نفسه خفة فخرج بين رجلين أحدهما العباس لصلاة الظهر وأبو بكر يصلي بالناس فلما رآه أبو بكر ذهب ليتأخر فأومأ إليه النبي صلى الله عليه وسلم أن لا يتأخر وقال لهما ‏\"‏ أجلساني إلى جنبه ‏\"‏ ‏.‏ فأجلساه إلى جنب أبي بكر وكان أبو بكر يصلي وهو قائم بصلاة النبي صلى الله عليه وسلم والناس يصلون بصلاة أبي بكر والنبي صلى الله عليه وسلم قاعد ‏.‏ قال عبيد الله فدخلت على عبد الله بن عباس فقلت له ألا أعرض عليك ما حدثتني عائشة عن مرض رسول الله صلى الله عليه وسلم قال هات ‏.‏ فعرضت حديثها عليه فما أنكر منه شيئا غير أنه قال أسمت لك الرجل الذي كان مع العباس قلت لا ‏.‏ قال هو علي ‏.‏",
      "text_en": " Ubaidullah b. Abdullah reported:                      I visited 'A'isha and asked her to tell about the illness of the Messenger of Allah (may peace be upon him). She agreed and said: The Apostle (may peace be upon him) was seriously ill and he asked whether the people had prayed. We said: No, they are waiting for you, Messenger of Allah. He (the Holy Prophet) said: Put some water in the tub for me. We did accordingly and he (the Holy Prophet) took a bath;and, when he was about to move with difficulty, he fainted. When he came round, he again said: Have the people said prayer? We said: No, they are waiting for you, Messenger of Allah. He (the Holy Prophet) again said: Put some water for me in the tub. We did accordingly and he took a bag, but when he was about to move with difficultyhe fainted. When he came round, he asked whether the people had prayed. We said: No, they are waiting for you, Messenger of Allah. He said: Put some water for me in the tub. We did accordingly and he took a bath and he was about to move with difficulty when he fainted. When he came roundhe said: Have the people saidprayer? We said: No, they are waiting for you, Messenger of Allah. She ('A'isha) said: The people were staying in the mosque and waiting for the Messenger of Allah (may peace be upon him) to lead the last (night) prayer. She ('A'isha) said: The Messenger of Allah (may peace be upon him) sent (instructions) to Abu Bakr to lead the people in prayer. When the messenger came, he told him (Abd Bakr): The Messenger of Allah (may peace be upon him) has ordered you to lead the people in prayer. Abu Bakr who was a man of very tenderly feelings asked Umar to lead the prayer. 'Umar said: You are more entitled to that. Abu Bakr led the prayers during those days. Afterwards the Messenger of Allah (may peace be upon him) felt some relief and he went out supported by two men, one of them was al-'Abbas, to the noon prayer. Abu Bakr was leading the people in prayer. When Abu Bakr saw him. he began to withdraw, but the Apostle of Allah (may peace be upon him) told him not to withdraw. He told his two (companions) to seat him down beside him (Abu Bakr). They seated him by the side of Abu Bakr. Abu Bakr said the prayer standing while following the prayer of the Apostle (way peace be upon him) and the people Bald prayer (standing) while following the prayer of Abu Bakr. The Apostle (may peace be upon him) was seated. Ubaidullah said: I visited 'Abdullah b. 'Abbas, and said: Should I submit to you what 'A'isha had told about the illness of the Apostle (may peace be upon him)? He said: Go ahead. I submitted to him what had been transmitted by her ('A'isha). He objected to none of it, only asking whether she had named to him the man who accompanied al-'Abbas. I said: No. He said: It was 'Ali.",
      "chain": [
        "30184",
        "20320",
        "11399",
        "11004"
      ]
    },
    {
      "hadith_no": "420",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن عبد الملك بن عمير، عن أبي بردة، عن أبي موسى، قال مرض رسول الله صلى الله عليه وسلم فاشتد مرضه فقال ‏\"‏ مروا أبا بكر فليصل بالناس ‏\"‏ ‏.‏ فقالت عائشة يا رسول الله إن أبا بكر رجل رقيق متى يقم مقامك لا يستطع أن يصلي بالناس فقال ‏\"‏ مري أبا بكر فليصل بالناس فإنكن صواحب يوسف ‏\"‏ ‏.‏ قال فصلى بهم أبو بكر حياة رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Musa reported:                      When the Messenger of Allah (may peace be upon him) became ill and illness became serious he ordered Abu Bakr to lead the people in prayer. Upon this 'A'isha said: Messenger of Allah, Abd Bakr is a man of tenderly feelings: when he would stand in your place (he would be so much overwhelmed -by grief that) he would not be able to lead the people in prayer. He (the Holy Prophet) said: You order Abu Bakr to lead the people in prayer, and added: You are like the female companions of Yusuf. So Abu Bakr led the prayer (during this period of illness) in the life of the Messenger of Allah (may peace be upon him).",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11368",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "458",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، حدثنا سماك بن حرب، عن جابر بن سمرة، قال إن النبي صلى الله عليه وسلم كان يقرأ في الفجر ب ‏{‏ ق والقرآن المجيد‏}‏ وكان صلاته بعد تخفيفا ‏.‏",
      "text_en": " Jabir b. Samura reported:                      The Apostle of Allah (may peace be upon him) used to recite in the morning prayer\" Qaf. By the Glorious Quran.\" and his prayer afterward shortened.",
      "chain": [
        "30201",
        "20315",
        "20320",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "503",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني إسحاق بن منصور، وعبد بن حميد، قالا أخبرنا جعفر بن عون، أخبرنا أبو عميس، ح قال وحدثني القاسم بن زكرياء، حدثنا حسين بن علي، عن زائدة، قال حدثنا مالك بن مغول، كلاهما عن عون بن أبي جحيفة، عن أبيه، عن النبي صلى الله عليه وسلم بنحو حديث سفيان وعمر بن أبي زائدة يزيد بعضهم على بعض وفي حديث مالك بن مغول فلما كان بالهاجرة خرج بلال فنادى بالصلاة ‏.‏",
      "text_en": " 'Aun b. Abu Juhaifa narrated from the Apostle of Allah (may peace be upon him) on the authority of his father a hadith like that of Sufyan, and 'Umar b. Abu Za'ida made this addition:                      Some of them tried to excel the others (in obtaining water), and in the hadith transmitted by Malik b. Mighwal (the words are): When it was noon, Bilal came out and summoned (people) to (noon) prayer.",
      "chain": [
        "30313",
        "30553",
        "20416",
        "20315",
        "20320",
        "20358",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "1315",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني القاسم بن زكرياء، حدثنا حسين بن علي الجعفي، عن زائدة، عن سليمان، عن إبراهيم، عن علقمة، عن عبد الله، قال صلينا مع رسول الله صلى الله عليه وسلم فإما زاد أو نقص - قال إبراهيم وايم الله ما جاء ذاك إلا من قبلي - قال فقلنا يا رسول الله أحدث في الصلاة شىء فقال ‏\"‏ لا ‏\"‏ ‏.‏ قال فقلنا له الذي صنع فقال ‏\"‏ إذا زاد الرجل أو نقص فليسجد سجدتين ‏\"‏ ‏.‏ قال ثم سجد سجدتين ‏.‏",
      "text_en": " Abdullah reported:                      We prayed along with the Messenger of Allah (may peace he upon him) and he committed or omitted (something). Ibrahim said: By Allah, this is a misgiving of mine only. We said: Messenger of Allah, is there something new about the prayer? He (the Holy Prophet) said: No. We told him about what he had done. He (the Holy Prophet) said: When a man commits or omits (something in prayer), he should perform two prostrations, and he then himself performed two prostrations.",
      "chain": [
        "20315",
        "20320",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1688",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، قال حدثني عمرو بن يحيى الأنصاري، حدثني محمد بن يحيى بن حبان، عن عمرو بن سليم بن خلدة الأنصاري، عن أبي قتادة، صاحب رسول الله صلى الله عليه وسلم قال دخلت المسجد ورسول الله صلى الله عليه وسلم جالس بين ظهرانى الناس - قال - فجلست فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما منعك أن تركع ركعتين قبل أن تجلس ‏\"‏ ‏.‏ قال فقلت يا رسول الله رأيتك جالسا والناس جلوس ‏.‏ قال ‏\"‏ فإذا دخل أحدكم المسجد فلا يجلس حتى يركع ركعتين ‏\"‏ ‏.‏",
      "text_en": " Abu Qatada, a Companion of the Messenger of Allah (may peace be upon him), said:                      I entered the mosque, when the Messenger of Allah (may peace be upon him) had been sitting among people, and I also sat down among them. Upon this the Messenger of Allah (may peace be upon him) said: What prevented you from offering two rak'ahs (of Nafl prayer) before sitting down? I said: Messenger of Allah, I saw you sitting and people sitting (around you and I, therefore, sat in your company). He (the Holy Prophet) then said: When anyone among you enters the mosque, he should not sit till he has observed two rak'ahs.",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11210",
        "11222",
        "1544"
      ]
    },
    {
      "hadith_no": "1949",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا عبد بن حميد، حدثنا حسين بن علي الجعفي، عن زائدة، عن منصور، عن شقيق، قال جاء رجل من بني بجيلة يقال له نهيك بن سنان إلى عبد الله فقال إني أقرأ المفصل في ركعة ‏.‏ فقال عبد الله هذا كهذ الشعر لقد علمت النظائر التي كان رسول الله صلى الله عليه وسلم يقرأ بهن سورتين في ركعة ‏.‏",
      "text_en": " Abu Wa'il reported:                      A person came to 'Abdullah b. Mas'ud and said: I recited all the mufassal surahs in one rak'ah during the night. 'Abdullah said: You must have recited hastily like the recitation of poetry. 'Abdullah said: I remember well the manner in which the Messenger of Allah (may peace be upon him) used to combine them, and he then mentioned twenty of the mufassal surahs, and (their combinations in) two in every rak'ah.",
      "chain": [
        "30553",
        "20315",
        "20320",
        "11067",
        "11353"
      ]
    },
    {
      "hadith_no": "2161",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Eclipse) - كتاب الكسوف",
      "chapter_no": "11",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، قالا حدثنا مصعب، - وهو ابن المقدام - حدثنا زائدة، حدثنا زياد بن علاقة، - وفي رواية أبي بكر قال قال زياد بن علاقة - سمعت المغيرة بن شعبة، يقول انكسفت الشمس على عهد رسول الله صلى الله عليه وسلم يوم مات إبراهيم فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن الشمس والقمر آيتان من آيات الله لا ينكسفان لموت أحد ولا لحياته فإذا رأيتموهما فادعوا الله وصلوا حتى ينكشف ‏\"‏ ‏.‏",
      "text_en": "  Ziyad b. 'Ilaqa reported:                      I heard Mughira b. Shu'ba saying that the sun eclipsed during the lifetime of the Messenger of Allah (may peace be upon him) on the day when Ibrahim died. Upon this the Messenger of Allah (may peace be upon him) said: Verily the sun and the moon are the two signs among the signs of Allah. They do not eclipse on account of the death of anyone or on account of the birth of anyone. So when you see them, supplicate Allah, and observe prayer till it is over.",
      "chain": [
        "30201",
        "30212",
        "20608",
        "20320",
        "11339",
        "11339",
        "166"
      ]
    },
    {
      "hadith_no": "2528",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا أبو كريب، حدثنا أبو أسامة، عن زائدة، عن منصور، عن طلحة بن مصرف، حدثنا أنس بن مالك، أن رسول الله صلى الله عليه وسلم مر بتمرة بالطريق فقال ‏\"‏ لولا أن تكون من الصدقة لأكلتها ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported that the Messenger of Allah (may peace be upon him) found a date lying on the path and said:                      If it were not out of Sadaqa, I would have eaten it.",
      "chain": [
        "30216",
        "20318",
        "20320",
        "11067",
        "11356",
        "19"
      ]
    },
    {
      "hadith_no": "2538",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن سماك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، ح . وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، قال سمعت عبد، الرحمن بن القاسم قال سمعت القاسم، يحدث عن عائشة، عن النبي صلى الله عليه وسلم بمثل ذلك ‏.‏",
      "text_en": " This hadith has been narrated on the authority of A'isha through another chain of transmitters.",
      "chain": [
        "30201",
        "20315",
        "20320",
        "10770",
        "10530",
        "10535",
        "53",
        "30170",
        "20173",
        "20020",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "2740",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني أبو كريب، حدثنا حسين، - يعني الجعفي - عن زائدة، عن هشام، عن ابن سيرين، عن أبي هريرة، - رضى الله عنه - عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تختصوا ليلة الجمعة بقيام من بين الليالي ولا تخصوا يوم الجمعة بصيام من بين الأيام إلا أن يكون في صوم يصومه أحدكم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) as saying:                      Do not single out the night (preceding) Friday among the nights for prayer and do not single out Friday among days for fasting but only when anyone among you is accustomed to fast (on dates) which coincide with this day (Friday).",
      "chain": [
        "30216",
        "20315",
        "20320",
        "11065",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "2750",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني أحمد بن عمر الوكيعي، حدثنا حسين بن علي، عن زائدة، عن سليمان، عن مسلم البطين، عن سعيد بن جبير، عن ابن عباس، - رضى الله عنهما - قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله إن أمي ماتت وعليها صوم شهر أفأقضيه عنها فقال ‏\"‏ لو كان على أمك دين أكنت قاضيه عنها ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فدين الله أحق أن يقضى ‏\"‏ ‏.‏ قال سليمان فقال الحكم وسلمة بن كهيل جميعا ونحن جلوس حين حدث مسلم بهذا الحديث فقالا سمعنا مجاهدا يذكر هذا عن ابن عباس‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with them) reported:                      A man came to the Apostle of Allah (may peace be upon him) and said: Messenger of Allah, my mother has died (in a state) that she had to observe fasts of a month (of Ramadan). Should I complete (them) on her behalf? thereupon he (the Holy Prophet) said: Would you not pay the debt if your mother had died (without paying it)? He said: Yes. He (the Holy Prophet) said: The debt of Allah deserves more that it should he paid.",
      "chain": [
        "39005",
        "20315",
        "20320",
        "11060",
        "11393",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2814",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن عبد الملك، بن عمير بهذا الإسناد في ذكر الصيام عن النبي صلى الله عليه وسلم ‏.‏ بمثله ‏.‏",
      "text_en": " A hadith like this has been reported from the Apostle of Allah (may peace be upon him) by 'Abd al-Malik with the same chain of transmitters in connection with fast.",
      "chain": [
        "30201",
        "20315",
        "20320"
      ]
    },
    {
      "hadith_no": "3396",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي الجعفي، عن زائدة، عن سليمان، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ المدينة حرم فمن أحدث فيها حدثا أو آوى محدثا فعليه لعنة الله والملائكة والناس أجمعين لا يقبل منه يوم القيامة عدل ولا صرف ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) as saying:                      Medina is a sacred territory, so he who made any innovation in it. or gave protection to an innovator, there is upon him the curse of Allah, that of the angels and that of all the people. There would not be accepted on the Day of Resurrection either obligatory acts or supererogatory acts from him.",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3720",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن ميسرة، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من كان يؤمن بالله واليوم الآخر فإذا شهد أمرا فليتكلم بخير أو ليسكت واستوصوا بالنساء فإن المرأة خلقت من ضلع وإن أعوج شىء في الضلع أعلاه إن ذهبت تقيمه كسرته وإن تركته لم يزل أعوج استوصوا بالنساء خيرا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) as saying:                      He who believes in Allah and the Hereafter, if he witnesses any matter he should talk in good terms about it or keep quiet. Act kindly towards woman, for woman is created from a rib, and the most crooked part of the rib is its top. If you attempt to straighten it, you will break it, and if you leave it, its crookedness will remain there. So act kindly towards women.",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11658",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "3838",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Invoking Curses - كتاب اللعان",
      "chapter_no": "20",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن عبد الملك، بن عمير بهذا الإسناد مثله ‏.‏ وقال غير مصفح ‏.‏ ولم يقل عنه ‏.‏",
      "text_en": " A hadith like this has been transmitted on the authority, of 'Abd al-Malik b. Umair with the same chain of narraters but with a slight change of words.",
      "chain": [
        "30201",
        "20315",
        "20320"
      ]
    },
    {
      "hadith_no": "3855",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن سماك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، ‏.‏ أنها اشترت بريرة من أناس من الأنصار ‏.‏ واشترطوا الولاء فقال رسول الله صلى الله عليه وسلم ‏\"‏ الولاء لمن ولي النعمة ‏\"‏ ‏.‏ وخيرها رسول الله صلى الله عليه وسلم وكان زوجها عبدا وأهدت لعائشة لحما فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو صنعتم لنا من هذا اللحم ‏\"‏ ‏.‏ قالت عائشة تصدق به على بريرة ‏.‏ فقال ‏\"‏ هو لها صدقة ولنا هدية ‏\"‏ ‏.‏",
      "text_en": " 'A'isha (Allah's be pleased with her) reported that she had bought Barira from the people of Ansar, but they laid down the condition that the right of inheritance (would vest in them), whereupon Allah's Messenger (may peace be upon him) said:                      The right of inheritance vests with one who shows favour (who emancipates) and Allah's Messenger (may peacebe upon him) gave her the choice (either to retain) her matrimonial alliance or break it). Her husband was a slave. She (Barira also) gave 'A'isha some meat as gift. Allah's Messenger (may peace be upon him) said: I wish you could prepare (cook) for us out of this meat. 'A'isha said, It has been given as charity to Barira, whereupon he said: That is charity for her and gift for us.",
      "chain": [
        "30201",
        "20315",
        "20320",
        "10770",
        "10530",
        "10535"
      ]
    },
    {
      "hadith_no": "3865",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي الجعفي، عن زائدة، عن سليمان، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من تولى قوما بغير إذن مواليه فعليه لعنة الله والملائكة والناس أجمعين لا يقبل منه يوم القيامة عدل ولا صرف ‏\"‏ ‏.‏ وحدثنيه إبراهيم بن دينار، حدثنا عبيد الله بن موسى، حدثنا شيبان، عن الأعمش، بهذا الإسناد غير أنه قال ‏\"‏ ومن والى غير مواليه بغير إذنهم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) as saying:                      He who took the freed slave as his ally without the consent of his previous master, there is upon him the curse of Allah and that of His angels and that of the whole mankind, and there will not be accepted from him his obligatory acts or supercrogatory acts on the Day of Resurrection. This hadith is narrated through the same chain of transmitters, but with a slight change of words.",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "4301",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Bequests - كتاب الوصية",
      "chapter_no": "26",
      "text_ar": "وحدثني القاسم بن زكرياء، حدثنا حسين بن علي، عن زائدة، عن عبد الملك، بن عمير عن مصعب بن سعد، عن أبيه، قال عادني النبي صلى الله عليه وسلم فقلت أوصي بمالي كله ‏.‏ قال ‏\"‏ لا ‏\"‏ ‏.‏ قلت فالنصف ‏.‏ قال ‏\"‏ لا ‏\"‏ ‏.‏ فقلت أبالثلث فقال ‏\"‏ نعم والثلث كثير ‏\"‏ ‏.‏",
      "text_en": " Ibn Sa'd reported his father as saying:                      Allah's Apostle (may peace be upon him) visited me during my illness. I said: I am willing away the whole of my property. He said: No. I said: Then half? He said: No. I said: Should I will away one-third? He said: Yes, and even one-third is enough.",
      "chain": [
        "20315",
        "20320",
        "11368",
        "10556",
        "9"
      ]
    },
    {
      "hadith_no": "4547",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا سليمان أبو داود، حدثنا زائدة، عن السدي، عن سعد بن عبيدة، عن أبي عبد الرحمن، قال خطب علي فقال يا أيها الناس أقيموا على أرقائكم الحد من أحصن منهم ومن لم يحصن فإن أمة لرسول الله صلى الله عليه وسلم زنت فأمرني أن أجلدها فإذا هي حديث عهد بنفاس فخشيت إن أنا جلدتها أن أقتلها فذكرت ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ أحسنت ‏\"‏ ‏.‏",
      "text_en": " Abd al-Rahman reported that 'Ali, while delivering the address said:                      O people, impose the prescribed punishment upon your slaves, those who are married and those not married, for a slave-woman belonging to Allah's Messenger (may peace be upon him) had committed adultery, and he committed me to flog her. But she had recently given birth to a child and I was afraid that if I flogged her I might kill her. So I mentioned that to Allah's Apostle (may peace be upon him) and he said: You have done well.",
      "chain": [
        "30161",
        "20320",
        "10743",
        "11344",
        "11359"
      ]
    },
    {
      "hadith_no": "4792",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثني أبو كريب، حدثنا أبو أسامة، حدثنا زائدة، حدثنا سليمان الأعمش، عن المختار بن صيفي، عن يزيد بن هرمز، قال كتب نجدة إلى ابن عباس ‏.‏ فذكر بعض الحديث ولم يتم القصة كإتمام من ذكرنا حديثهم ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Yazid b. Hurmuz. but not complete (as we find in the above mentioned ahadith).",
      "chain": [
        "30216",
        "20318",
        "20320",
        "11060",
        "10627"
      ]
    },
    {
      "hadith_no": "5006",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن زائدة، ح وحدثني بشر بن، خالد حدثنا محمد، - يعني ابن جعفر - حدثنا شعبة، كلاهما عن الأعمش، بهذا الإسناد ‏.‏",
      "text_en": " A similar tradition has been narrated on the authority of al-A'mash.",
      "chain": [
        "30201",
        "20318",
        "20320",
        "30126",
        "20173"
      ]
    },
    {
      "hadith_no": "5207",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "وحدثنيه القاسم بن زكرياء، حدثنا حسين بن علي، عن زائدة، عن سعيد بن مسروق، بهذا الإسناد الحديث إلى آخره بتمامه وقال فيه وليست معنا مدى أفنذبح بالقصب",
      "text_en": "",
      "chain": [
        "20315",
        "20320",
        "20016"
      ]
    },
    {
      "hadith_no": "6027",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Poetry - كتاب الشعر",
      "chapter_no": "42",
      "text_ar": "وحدثني ابن أبي عمر، حدثنا سفيان، عن زائدة، عن عبد الملك بن عمير، عن  أبي سلمة بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أصدق بيت قاله الشاعر ألا كل شىء ما خلا الله باطل وكاد ابن أبي الصلت أن يسلم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The truest verse recited by a poet is: Beliold! apart from Allah everything is vain,\" and Ibn Abu Salt was almost a Muslim.",
      "chain": [
        "30421",
        "20005",
        "20320",
        "11368",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "6106",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثني أحمد بن عبد الله بن يونس، حدثنا زائدة، حدثنا عبد الملك بن عمير، قال سمعت جندبا، يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ أنا فرطكم، على الحوض ‏\"‏ ‏.‏",
      "text_en": " Jundab reported:                      I heard Allah's Messenger (may peace be upon him) as saying: I shall be there at the Cistern before you.",
      "chain": [
        "30184",
        "20320",
        "11368",
        "4053"
      ]
    },
    {
      "hadith_no": "6641",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وشجاع بن مخلد، - واللفظ لأبي بكر - قالا حدثنا  حسين، - وهو ابن علي الجعفي - عن زائدة، عن السدي، عن عبد الله البهي، عن عائشة، قالت سأل رجل النبي صلى الله عليه وسلم أى الناس خير قال ‏\"‏ القرن الذي أنا فيه ثم الثاني ثم الثالث ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported that a person asked Allah's Apostle (may peace be upon him) as to who amongst the people were the best. He said:                      Of the generation to which I belong, then of the second generation (generation adjacent to my generation), then of the third generation (generation adjacent to the second generation).",
      "chain": [
        "30201",
        "30506",
        "20315",
        "20320",
        "10743",
        "10939",
        "53"
      ]
    },
    {
      "hadith_no": "6961",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Knowledge - كتاب العلم",
      "chapter_no": "48",
      "text_ar": "وحدثني القاسم بن زكرياء، حدثنا حسين الجعفي، عن زائدة، عن سليمان، عن  شقيق، قال كنت جالسا مع عبد الله وأبي موسى وهما يتحدثان فقالا قال رسول الله صلى الله عليه وسلم بمثل حديث وكيع وابن نمير ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Abdullah (b. Mas'ud) and Abu Musa (al-Asha'ri) through other chains of transmitters.",
      "chain": [
        "20315",
        "20320",
        "11060",
        "11353"
      ]
    },
    {
      "hadith_no": "7084",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن الحسن بن، عبيد الله عن إبراهيم بن سويد، عن عبد الرحمن بن يزيد، عن عبد الله، قال كان رسول الله صلى الله عليه وسلم إذا أمسى قال ‏\"‏ أمسينا وأمسى الملك لله والحمد لله لا إله إلا الله وحده لا شريك له اللهم إني أسألك من خير هذه الليلة وخير ما فيها وأعوذ بك من شرها وشر ما فيها اللهم إني أعوذ بك من الكسل والهرم وسوء الكبر وفتنة الدنيا وعذاب القبر ‏\"‏ ‏.‏ قال الحسن بن عبيد الله وزادني فيه زبيد عن إبراهيم بن سويد عن عبد الرحمن بن يزيد عن عبد الله رفعه أنه قال ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير ‏\"‏ ‏.‏",
      "text_en": " Abdullah reported that when it was evening Allah's Messenger (may peace be upon him) used to supplicate:                     \" We have entered upon evening and so has the Kingdom of Allah entere d upon evening; praise is due to Allah, there is no god but Allah the One, and there is no partner with Him. O Allah, I beg of Thee the blessing of this night and the blessing of that which lies in it. I seek refuge in Thee from the evil of it and what lies in it. O Allah, I seek refuge in Thee from sloth, from decrepitude, from the evil of vanity, from trial of the world, and from torment of the grave.\" Zubaid, through another chain of transmitters, has narrated on the authority of Abdullah directly this addition:\" There is no god but Allah, the One, there is no partner with Him, His is the Sovereignty and to Him is praise due and He is Potent over everything.\"",
      "chain": [
        "30201",
        "20315",
        "20320",
        "10755",
        "10887",
        "20395",
        "18"
      ]
    },
    {
      "hadith_no": "112",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا الحسن بن علي الحلواني، حدثنا الحسين بن علي الجعفي، عن زائدة، حدثنا خالد بن علقمة الهمداني، عن عبد خير، قال صلى علي رضى الله عنه الغداة ثم دخل الرحبة فدعا بماء فأتاه الغلام بإناء فيه ماء وطست - قال - فأخذ الإناء بيده اليمنى فأفرغ على يده اليسرى وغسل كفيه ثلاثا ثم أدخل يده اليمنى في الإناء فتمضمض ثلاثا واستنشق ثلاثا ‏.‏ ثم ساق قريبا من حديث أبي عوانة قال ثم مسح رأسه مقدمه ومؤخره مرة ‏.‏ ثم ساق الحديث نحوه ‏.‏",
      "text_en": " ‘Abd Khair said :                      ‘All offered the dawn prayer and went to Rahbah (a locality in Kufah). He called for water. A boy brought him a vessel containing water and a wash-basin. He held the vessel with his right hand and poured water over his left hand. He washed both of his hands (to the wrist) three times. He then put his right hand in the vessel ( to take water) and rinsed his mouth three times and snuffed up water three times. He then narrated almost the same tradition as narrated by Abu ‘Awanah. He then wiped his head, both its front and back sides, once. He then narrated the tradition in like manner.",
      "chain": [
        "30115",
        "20315",
        "20320",
        "18243",
        "19874",
        "5"
      ]
    },
    {
      "hadith_no": "168",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا نصر بن المهاجر، حدثنا معاوية بن عمرو، حدثنا زائدة، عن منصور، عن مجاهد، عن الحكم، أو ابن الحكم عن أبيه، أن رسول الله صلى الله عليه وسلم بال ثم توضأ ونضح فرجه ‏.‏",
      "text_en": " Hakam or Ibn al-Hakam on the authority of his father reported:                      The Prophet (ﷺ) urinated; then he performed ablution and sprinkled water on the private parts of his body.",
      "chain": [
        "20389",
        "20320",
        "11067",
        "11028"
      ]
    },
    {
      "hadith_no": "241",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا عبد الرحمن، - يعني ابن مهدي - عن زائدة بن قدامة، عن صدقة، حدثنا جميع بن عمير، - أحد بني تيم الله بن ثعلبة - قال دخلت مع أمي وخالتي على عائشة فسألتها إحداهما كيف كنتم تصنعون عند الغسل فقالت عائشة كان رسول الله صلى الله عليه وسلم يتوضأ وضوءه للصلاة ثم يفيض على رأسه ثلاث مرات ونحن نفيض على رءوسنا خمسا من أجل الضفر ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Jumay' ibn Umayr, one of the sons of Banu Taym Allah ibn Tha'labah, said: Accompanied by my mother and aunt I entered upon Aisha. One of them asked her: How did you do while taking a bath? Aisha replied: The Messenger of Allah (ﷺ) performed ablution (in the beginning) as he did for prayer. He then poured (water) upon his head three times. But we poured water upon our heads five times due to plaits.",
      "chain": [
        "20184",
        "20033",
        "20320",
        "30343",
        "19864"
      ]
    },
    {
      "hadith_no": "455",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا حسين بن علي، عن زائدة، عن هشام بن عروة، عن أبيه، عن عائشة، قالت أمر رسول الله صلى الله عليه وسلم ببناء المساجد في الدور وأن تنظف وتطيب ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) commanded us to build mosques in different localities (i.e. in the locality of each tribe separately)  and that they should be kept clean and be perfumed.",
      "chain": [
        "30216",
        "20315",
        "20320",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "547",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زائدة، حدثنا السائب بن حبيش، عن معدان بن أبي طلحة اليعمري، عن أبي الدرداء، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من ثلاثة في قرية ولا بدو لا تقام فيهم الصلاة إلا قد استحوذ عليهم الشيطان فعليك بالجماعة فإنما يأكل الذئب القاصية ‏\"‏ ‏.‏ قال زائدة قال السائب يعني بالجماعة الصلاة في الجماعة ‏.‏",
      "text_en": " Narrated AbudDarda':                     I heard the Messenger of Allah (ﷺ) say: If there are three men in a village or in the desert among whom prayer is not offered (in congregation), the devil has got the mastery over them. So observe (prayer) in congregation), for the wolf eats only the straggling animal. Sa'ib said: By the word Jama'ah he meant saying prayer in company or in congregation.",
      "chain": [
        "30184",
        "20320",
        "18336",
        "10878",
        "37"
      ]
    },
    {
      "hadith_no": "624",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا حفص بن بغيل المرهبي، حدثنا زائدة، عن المختار بن فلفل، عن أنس، أن النبي صلى الله عليه وسلم حضهم على الصلاة ونهاهم أن ينصرفوا قبل انصرافه من الصلاة ‏.‏",
      "text_en": " Anas said:                      The prophet (ﷺ) persuaded them to say prayer in congregation and prohibited them to leave before he goes away from the prayer.",
      "chain": [
        "30216",
        "20320",
        "10962",
        "19"
      ]
    },
    {
      "hadith_no": "631",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو الوليد الطيالسي، حدثنا زائدة، عن أبي حصين، عن أبي صالح، عن عائشة، رضى الله عنها أن النبي صلى الله عليه وسلم صلى في ثوب واحد بعضه على ‏.‏",
      "text_en": " ‘A’ishah said; the prophet (ﷺ) prayed in a single (piece of) cloth whose one part was upon me.",
      "chain": [
        "20296",
        "20320",
        "11371",
        "11161",
        "53"
      ]
    },
    {
      "hadith_no": "727",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن علي، حدثنا أبو الوليد، حدثنا زائدة، عن عاصم بن كليب، بإسناده ومعناه قال فيه ثم وضع يده اليمنى على ظهر كفه اليسرى والرسغ والساعد وقال فيه ثم جئت بعد ذلك في زمان فيه برد شديد فرأيت الناس عليهم جل الثياب تحرك أيديهم تحت الثياب ‏.‏",
      "text_en": " The above tradition has been transmitted by ‘Asim b. Kulaib through a different chain of narrators and to the same effect. This version has:                      “He then placed his right hand on the back of his left palm and his wrist and forearm.” This also adds: “I then came back afterwards in a season when it was severe cold. I saw the people putting on heavy clothes moving their hands under the clothes (i.e. raised their hands before and after bowing).”",
      "chain": [
        "30115",
        "20296",
        "20320",
        "10778"
      ]
    },
    {
      "hadith_no": "792",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن سليمان، عن أبي صالح، عن بعض، أصحاب النبي صلى الله عليه وسلم قال قال النبي صلى الله عليه وسلم لرجل ‏\"‏ كيف تقول في الصلاة ‏\"‏ ‏.‏ قال أتشهد وأقول اللهم إني أسألك الجنة وأعوذ بك من النار أما إني لا أحسن دندنتك ولا دندنة معاذ ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ حولها ندندن ‏\"‏ ‏.‏",
      "text_en": " Narrated Some Companions of the Prophet:                     AbuSalih reported on the authority of some Companions of the Prophet (ﷺ): The Prophet (ﷺ) said to a person: what do you say in prayer? He replied: I first recite tashahhud (supplication recited in sitting position), and then I say: O Allah, I ask Thee for Paradise, and I seek refuge in Thee from Hell-Fire, but I do not understand your sound and the sound of Mu'adh (what you say or he says in prayer). The Prophet (ﷺ) said: We too go around it (paradise and Hell-fire).",
      "chain": [
        "30203",
        "20315",
        "20320",
        "11060",
        "11161"
      ]
    },
    {
      "hadith_no": "996",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، ح وحدثنا أحمد بن يونس، حدثنا زائدة، ح وحدثنا مسدد، حدثنا أبو الأحوص، ح وحدثنا محمد بن عبيد المحاربي، وزياد بن أيوب، قالا حدثنا عمر بن عبيد الطنافسي، ح وحدثنا تميم بن المنتصر، أخبرنا إسحاق، - يعني ابن يوسف - عن شريك، ح وحدثنا أحمد بن منيع، حدثنا حسين بن محمد، حدثنا إسرائيل، كلهم عن أبي إسحاق، عن أبي الأحوص، عن عبد الله، وقال، إسرائيل عن أبي الأحوص، والأسود، عن عبد الله، أن النبي صلى الله عليه وسلم كان يسلم عن يمينه وعن شماله حتى يرى بياض خده ‏\"‏ السلام عليكم ورحمة الله السلام عليكم ورحمة الله ‏\"‏ ‏.‏ قال أبو داود وهذا لفظ حديث سفيان وحديث إسرائيل لم يفسره ‏.‏ قال أبو داود ورواه زهير عن أبي إسحاق ويحيى بن آدم عن إسرائيل عن أبي إسحاق عن عبد الرحمن بن الأسود عن أبيه وعلقمة عن عبد الله ‏.‏ قال أبو داود شعبة كان ينكر هذا الحديث - حديث أبي إسحاق - أن يكون مرفوعا ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Prophet (ﷺ) used to give the salutation to his left and right sides until the whiteness of his cheek was seen, (saying: \"Peace be upon you, and mercy of Allah\" twice.  AbuDawud said: This is a version of the tradition reported by AbuSufyan. The version of Isra'il did not explain it. AbuDawud said: This tradition has been narrated by Zubayr from AbuIshaq and Yahya ibn Adam from Isra'il from AbuIshaq from AbdurRahman ibn al-Aswad from his father from Alqamah on the authority of Abdullah ibn Mas'ud. AbuDawud said: Shu'bah used to reject this tradition, the tradition narrated by AbuIshaq as coming from the Prophet (ﷺ).",
      "chain": [
        "28531",
        "20012",
        "30184",
        "20320",
        "30175",
        "20327",
        "35135",
        "30249",
        "20346",
        "20411",
        "20587"
      ]
    },
    {
      "hadith_no": "1104",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زائدة، عن حصين بن عبد الرحمن، قال رأى عمارة بن رؤيبة بشر بن مروان وهو يدعو في يوم جمعة فقال عمارة قبح الله هاتين اليدين ‏.‏ قال زائدة قال حصين حدثني عمارة قال لقد رأيت رسول الله صلى الله عليه وسلم وهو على المنبر ما يزيد على هذه يعني السبابة التي تلي الإبهام ‏.‏",
      "text_en": " 'Umarah b. Ruwaibah said that he saw Bishr b. Marwan (on the pulpit) praying on Friday (by raising his hands). 'Umarah said:                      May Allah reject these hands! I have seen the Messenger of Allah (ﷺ) on the pulpit gesturing no more than this pointing with his forefinger.",
      "chain": [
        "30184",
        "20320",
        "15097",
        "20320",
        "15097",
        "11379"
      ]
    },
    {
      "hadith_no": "1192",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا زهير بن حرب، حدثنا معاوية بن عمرو، حدثنا زائدة، عن هشام، عن فاطمة، عن أسماء، قالت كان النبي صلى الله عليه وسلم يأمر بالعتاقة في صلاة الكسوف ‏.‏",
      "text_en": " Narrated Asma:                     The Prophet (peace be upon him) used to command us to free slaves on the occasion of an eclipse",
      "chain": [
        "30022",
        "20389",
        "20320",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "1614",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا الهيثم بن خالد الجهني، حدثنا حسين بن علي الجعفي، عن زائدة، حدثنا عبد العزيز بن أبي رواد، عن نافع، عن عبد الله بن عمر، قال كان الناس يخرجون صدقة الفطر على عهد رسول الله صلى الله عليه وسلم صاعا من شعير أو تمر أو سلت أو زبيب ‏.‏ قال قال عبد الله فلما كان عمر - رضى الله عنه - وكثرت الحنطة جعل عمر نصف صاع حنطة مكان صاع من تلك الأشياء ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The people during the lifetime of the Messenger of Allah (ﷺ) used to bring forth the sadaqah at the end of Ramadan when closing the fast one sa' of barley whose straw is removed, or of raisins. Abdullah said: When Umar (Allah be pleased with him) succeeded, and the wheat became abundant, Umar prescribed half a sa' of wheat instead of all these things.",
      "chain": [
        "35162",
        "20315",
        "20320",
        "20739",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2234",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا حسين بن علي، والوليد بن عقبة، عن زائدة، عن سماك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، أن بريرة، خيرها رسول الله صلى الله عليه وسلم وكان زوجها عبدا ‏.‏",
      "text_en": " A’ishah said “The Prophet (ﷺ) gave her choice. Her husband was a slave.”",
      "chain": [
        "30203",
        "20315",
        "20320",
        "10770",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "2327",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا الحسن بن علي، حدثنا حسين، عن زائدة، عن سماك، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقدموا الشهر بصيام يوم ولا يومين إلا أن يكون شىء يصومه أحدكم ولا تصوموا حتى تروه ثم صوموا حتى تروه فإن حال دونه غمامة فأتموا العدة ثلاثين ثم أفطروا و الشهر تسع وعشرون ‏\"‏ ‏.‏ قال أبو داود رواه حاتم بن أبي صغيرة وشعبة والحسن بن صالح عن سماك بمعناه لم يقولوا ‏\"‏ ثم أفطروا ‏\"‏ ‏.‏ قال أبو داود وهو حاتم بن مسلم بن أبي صغيرة وأبو صغيرة زوج أمه ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: Do not fast one day or two days just before Ramadan except in the case of a man who has been in the habit or observing a fast (on that day); and do not fast until you sight it (the moon). Then fast until you sight it. If a cloud appears on that day (i.e. 29th of Ramadan) then complete the number thirty (days) and then end the fasting: a month consists of twenty-nine days.",
      "chain": [
        "30115",
        "11278",
        "20320",
        "10770",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2405",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زائدة، عن حميد الطويل، عن أنس، قال سافرنا مع رسول الله صلى الله عليه وسلم في رمضان فصام بعضنا وأفطر بعضنا فلم يعب الصائم على المفطر ولا المفطر على الصائم ‏.‏",
      "text_en": " Narrated Anas :                     We travelled along with the Prophet (ﷺ) during Ramadan. Some of us were fasting and other broke their fast. Those who fasted did not find fault with those who broke, and those who broke their fast did not find fault with those who fasted.",
      "chain": [
        "30184",
        "20320",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "2727",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محبوب بن موسى أبو صالح، حدثنا أبو إسحاق الفزاري، عن زائدة، عن الأعمش، عن المختار بن صيفي، عن يزيد بن هرمز، قال كتب نجدة إلى ابن عباس يسأله عن كذا، وكذا، وذكر، أشياء وعن المملوك، أله في الفىء شىء وعن النساء، هل كن يخرجن مع النبي صلى الله عليه وسلم وهل لهن نصيب فقال ابن عباس لولا أن يأتي أحموقة ما كتبت إليه أما المملوك فكان يحذى وأما النساء فقد كن يداوين الجرحى ويسقين الماء ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     Yazid ibn Hurmuz said: Najdah wrote to Ibn Abbas asking him about such-and-such, and such-and-such, and he mentioned some things; he (asked) about a slave whether he would get something from the spoils; and he (asked) about women whether they used to go out (on expeditions) along with the Messenger of Allah (ﷺ), and whether they would be allotted a share, Ibn Abbas said: Had I not apprehended a folly, I would not have written (a reply) to him. As for the slave, he was given a little of the spoils (as a reward from the booty); as to the women, they would treat the wounded and supply water.",
      "chain": [
        "38625",
        "20405",
        "20320",
        "11060",
        "10627"
      ]
    },
    {
      "hadith_no": "3643",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Knowledge (Kitab Al-Ilm) - كتاب العلم",
      "chapter_no": "26",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زائدة، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من رجل يسلك طريقا يطلب فيه علما إلا سهل الله له به طريق الجنة ومن أبطأ به عمله لم يسرع به نسبه ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Prophet (ﷺ) as saying:                      If anyone pursues a path in search of knowledge, Allah will thereby make easy for him a path to paradise; and he who is made slow by his actions will not be speeded by his genealogy.",
      "chain": [
        "30184",
        "20320",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "4282",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Promised Deliverer (Kitab Al-Mahdi) - كتاب المهدى",
      "chapter_no": "38",
      "text_ar": "حدثنا مسدد، أن عمر بن عبيد، حدثهم ح، وحدثنا محمد بن العلاء، حدثنا أبو بكر، - يعني ابن عياش ح وحدثنا مسدد، حدثنا يحيى، عن سفيان، ح وحدثنا أحمد بن إبراهيم، حدثنا عبيد الله بن موسى، أخبرنا زائدة، ح وحدثنا أحمد بن إبراهيم، حدثني عبيد الله بن موسى، عن فطر، - المعنى واحد - كلهم عن عاصم، عن زر، عن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ لو لم يبق من الدنيا إلا يوم ‏\"‏ ‏.‏ قال زائدة في حديثه ‏\"‏ لطول الله ذلك اليوم ‏\"‏ ‏.‏ ثم اتفقوا ‏\"‏ حتى يبعث فيه رجلا مني ‏\"‏ ‏.‏ أو ‏\"‏ من أهل بيتي يواطئ اسمه اسمي واسم أبيه اسم أبي ‏\"‏ ‏.‏ زاد في حديث فطر ‏\"‏ يملأ الأرض قسطا وعدلا كما ملئت ظلما وجورا ‏\"‏ ‏.‏ وقال في حديث سفيان ‏\"‏ لا تذهب أو لا تنقضي الدنيا حتى يملك العرب رجل من أهل بيتي يواطئ اسمه اسمي ‏\"‏ ‏.‏ قال أبو داود لفظ عمر وأبي بكر بمعنى سفيان ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Prophet (ﷺ) said: If only one day of this world remained. Allah would lengthen that day (according to the version of Za'idah), till He raised up in it a man who belongs to me or to my family whose father's name is the same as my father's, who will fill the earth with equity and justice as it has been filled with oppression and tyranny (according to the version of Fitr). Sufyan's version says: The world will not pass away before the Arabs are ruled by a man of my family whose name will be the same as mine.Abu Dawud said: The version of 'Umar and Abu Bakr is the same as that of Sufyan.",
      "chain": [
        "30175",
        "30216",
        "20373",
        "30175",
        "20031",
        "20012",
        "30494",
        "20340",
        "20320",
        "30494",
        "20340"
      ]
    },
    {
      "hadith_no": "4659",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا زائدة بن قدامة الثقفي، حدثنا عمر بن قيس الماصر، عن عمرو بن أبي قرة، قال كان حذيفة بالمدائن فكان يذكر أشياء قالها رسول الله صلى الله عليه وسلم لأناس من أصحابه في الغضب فينطلق ناس ممن سمع ذلك من حذيفة فيأتون سلمان فيذكرون له قول حذيفة فيقول سلمان حذيفة أعلم بما يقول فيرجعون إلى حذيفة فيقولون له قد ذكرنا قولك لسلمان فما صدقك ولا كذبك ‏.‏ فأتى حذيفة سلمان وهو في مبقلة فقال يا سلمان ما يمنعك أن تصدقني بما سمعت من رسول الله صلى الله عليه وسلم فقال سلمان إن رسول الله صلى الله عليه وسلم كان يغضب فيقول في الغضب لناس من أصحابه ويرضى فيقول في الرضا لناس من أصحابه أما تنتهي حتى تورث رجالا حب رجال ورجالا بغض رجال وحتى توقع اختلافا وفرقة ولقد علمت أن رسول الله صلى الله عليه وسلم خطب فقال ‏\"‏ أيما رجل من أمتي سببته سبة أو لعنته لعنة في غضبي - فإنما أنا من ولد آدم أغضب كما يغضبون وإنما بعثني رحمة للعالمين - فاجعلها عليهم صلاة يوم القيامة ‏\"‏ ‏.‏ والله لتنتهين أو لأكتبن إلى عمر ‏.‏",
      "text_en": " ‘Amr b. Abl Qurrah said :                      Hudhaifah was in al-Mada’in. He used to mention things which the Messenger of Allah (May peace be upon him) said to some people from among his Companions in anger. The people who heard from Hudhaifah would go to Salman and tell him what Hudhaifah said. Salman would say: Hudhaifah knows best what he says. Then they would come to Hudhaifah and tell him: We mentioned Salman what you said, but he neither testified you nor falsified you. So Hudhaifah came to salman who was in his vegetable farm, and said : Salman, what prevents you from testifying me of what I heard from the Messenger of Allah (May peace be upon him) ? Salman said: The Messenger of Allah (May peace be upon him) sometimes would be angry, and said in anger something to some of his Companions; he would be sometimes pleased and said in pleasure something to some of his Companions. Would you not stop until you create love of some people in the hearts of some people, and hatred of some people in the hearts of some people, and until you generate disagreement and dissension? You know that the Messenger of Allah (May peace be upon him) addressed, saying : If I abused any person of my people, or cursed him in my anger. I am one of the children of Adam : I become angry as they become angry. He (Allah) has sent me as a mercy for all worlds. (O Allah!) make them (Abuse or curse) blessing for them on the day of judgment! I swear by Allah. You should stop (mentioning these traditions), otherwise I shall writ to ‘Umar.",
      "chain": [
        "30184",
        "20320",
        "15398"
      ]
    },
    {
      "hadith_no": "5114",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا حجاج بن أبي يعقوب، حدثنا معاوية، - يعني ابن عمرو - حدثنا زائدة، عن الأعمش، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من تولى قوما بغير إذن مواليه فعليه لعنة الله والملائكة والناس أجمعين لا يقبل منه يوم القيامة عدل ولا صرف ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Prophet (May peace be upon him) as saying :                      if a man becomes the client of any people without the permission of his patrons (i.e. those who have freed him), on him will be the curse of Allah, of angels and of all people; no obligatory or supererogatory worship will be accepted from him.",
      "chain": [
        "20389",
        "20320",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "114",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عمرو السواق البلخي، حدثنا هشيم، عن يزيد بن أبي زياد، ح قال وحدثنا محمود بن غيلان، حدثنا حسين الجعفي، عن زائدة، عن يزيد بن أبي زياد، عن عبد الرحمن بن أبي ليلى، عن علي، قال سألت النبي صلى الله عليه وسلم عن المذى فقال ‏\"‏ من المذى الوضوء ومن المني الغسل ‏\"‏ ‏.‏ قال وفي الباب عن المقداد بن الأسود وأبى بن كعب ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روي عن علي بن أبي طالب عن النبي صلى الله عليه وسلم من غير وجه ‏\"‏ من المذى الوضوء ومن المني الغسل ‏\"‏ ‏.‏ وهو قول عامة أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين ومن بعدهم وبه يقول سفيان والشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Ali narrated:                     \"I asked the Prophet about Al-Madhi. He said: \"For Al-Madhi is Wudu, and for AI-Mani is Ghusl.\"",
      "chain": [
        "11220",
        "20468",
        "10844",
        "30277",
        "20315",
        "20320",
        "10844",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "997",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا بشر بن السري، عن زائدة، عن عبد الله بن محمد بن عقيل، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم كفن حمزة بن عبد المطلب في نمرة في ثوب واحد ‏.‏ قال وفي الباب عن علي وابن عباس وعبد الله بن مغفل وابن عمر ‏.‏ قال أبو عيسى حديث عائشة حديث حسن صحيح ‏.‏ وقد روي في كفن النبي صلى الله عليه وسلم روايات مختلفة وحديث عائشة أصح الأحاديث التي رويت في كفن النبي صلى الله عليه وسلم ‏.‏ والعمل على حديث عائشة عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم ‏.‏ قال سفيان الثوري يكفن الرجل في ثلاث أثواب إن شئت في قميص ولفافتين وإن شئت في ثلاث لفائف ويجزئ ثوب واحد إن لم يجدوا ثوبين والثوبان يجزيان والثلاثة لمن وجدها أحب إليهم ‏.‏ وهو قول الشافعي وأحمد وإسحاق ‏.‏ قالوا تكفن المرأة في خمسة أثواب ‏.‏",
      "text_en": " Jabir bin Abdullah narrated:                     \"The Messenger of Allah shrouded Hamzah bin Abdul-Muttalib in one cloth of Namirah.\"",
      "chain": [
        "30421",
        "20190",
        "20320",
        "12246",
        "34"
      ]
    },
    {
      "hadith_no": "1196",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Suckling - كتاب الرضاع",
      "chapter_no": "12",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا الحسين بن علي الجعفي، عن زائدة، عن شبيب بن غرقدة، عن سليمان بن عمرو بن الأحوص، قال حدثني أبي أنه، شهد حجة الوداع مع رسول الله صلى الله عليه وسلم فحمد الله وأثنى عليه وذكر ووعظ فذكر في الحديث قصة فقال ‏\"‏ ألا واستوصوا بالنساء خيرا فإنما هن عوان عندكم ليس تملكون منهن شيئا غير ذلك إلا أن يأتين بفاحشة مبينة فإن فعلن فاهجروهن في المضاجع واضربوهن ضربا غير مبرح فإن أطعنكم فلا تبغوا عليهن سبيلا ألا إن لكم على نسائكم حقا ولنسائكم عليكم حقا فأما حقكم على نسائكم ألا يوطئن فرشكم من تكرهون ولا يأذن في بيوتكم لمن تكرهون ألا وحقهن عليكم أن تحسنوا إليهن في كسوتهن وطعامهن ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ ومعنى قوله ‏\"‏ عوان عندكم ‏\"‏ ‏.‏ يعني أسرى في أيديكم ‏.‏",
      "text_en": " Sulaiman bin Amr bin Al-Ahwas said:                      “My father narrated to me that he witnessed the farewell Hajj with the Messenger of Allah. So he thanked and praised Allah and he reminded and gave admonition. He mentioned a story in his narration and he (the Prophet) said: “And indeed I order you to be good to the women, for they are but captives with you over whom you have no power than that, except if they come with manifest Fahishah (evil behavior). If they do that, then abandon their beds and beat them with a beating that is not harmful. And if they obey you then you have no cause against them. Indeed you have rights over your women, and your women have rights over you. As for your rights over your women, then they must not allow anyone whom you dislike to treat on your bedding (furniture), nor to admit anyone in your home that you dislike. And their rights over you are that you treat them well in clothing them and feeding them.”",
      "chain": [
        "30115",
        "20315",
        "20320",
        "11430",
        "19868"
      ]
    },
    {
      "hadith_no": "1331",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا هناد، حدثنا حسين الجعفي، عن زائدة، عن سماك بن حرب، عن حنش، عن علي، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ إذا تقاضى إليك رجلان فلا تقض للأول حتى تسمع كلام الآخر فسوف تدري كيف تقضي ‏\"‏ ‏.‏ قال علي فما زلت قاضيا بعد ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " 'Ali narrated:                      \"The Messenger of Allah (ﷺ) said to me: 'When two men come to you seeking judgement, do not judge for the first until you have heard the statement of the other. Soon you will know how to judge.'\" 'Ali said: \"I did not err since then.\"",
      "chain": [
        "30480",
        "20315",
        "20320",
        "10770",
        "15113",
        "5"
      ]
    },
    {
      "hadith_no": "1441",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا أبو داود الطيالسي، حدثنا زائدة بن قدامة، عن السدي، عن سعد بن عبيدة، عن أبي عبد الرحمن السلمي، قال خطب علي فقال يا أيها الناس أقيموا الحدود على أرقائكم من أحصن منهم ومن لم يحصن وإن أمة لرسول الله صلى الله عليه وسلم زنت فأمرني أن أجلدها فإذا هي حديثة عهد بنفاس فخشيت إن أنا جلدتها أن أقتلها - أو قال تموت - فأتيت رسول الله صلى الله عليه وسلم فذكرت ذلك له فقال ‏\"‏ أحسنت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والسدي اسمه إسماعيل بن عبد الرحمن وهو من التابعين قد سمع من أنس بن مالك ورأى حسين بن علي بن أبي طالب رضى الله عنه ‏.‏",
      "text_en": " Narrated Abu 'Abdur-Rahman As-Sulami:                     \"Ali gave a Khutbah, and said: 'O people, establish the penalties upon your slaves, those married from them and those unmarried. A slave girl of the Prophet (ﷺ) committed illegal sexual intercourse so he ordered me to whip her. I went to her and she was just experiencing her post-natal bleeding, so I feared that if I were to whip her I would kill her' - or he said: 'She would die' - 'so I went to the Messenger of Allah (ﷺ) and I told that to him. So he said: 'You did well.'\"",
      "chain": [
        "30115",
        "20547",
        "20320",
        "10743",
        "11344",
        "11359"
      ]
    },
    {
      "hadith_no": "1625",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا أبو كريب، حدثنا الحسين بن علي الجعفي، عن زائدة، عن الركين بن الربيع، عن أبيه، عن يسير بن عميلة، عن خريم بن فاتك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أنفق نفقة في سبيل الله كتبت له بسبعمائة ضعف ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي هريرة ‏.‏ وهذا حديث حسن إنما نعرفه من حديث الركين بن الربيع ‏.‏",
      "text_en": " Narrated Khuraim bin Fatik:                     That the Messenger of Allah (ﷺ) said: \"Whoever spends a sum in the cause of Allah, it is recorded for him seven-hundred fold.\"[Abu 'Eisa said:] There are something on this topic from Abu Hurairah.This Hadith is Hasan, we only know of it from the narration of Ar-Rukain bin Ar-Rabi' (a narrator in the chain of this Hadith)",
      "chain": [
        "30216",
        "20315",
        "20320",
        "10763",
        "10761",
        "4127"
      ]
    },
    {
      "hadith_no": "1795",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو كريب، حدثنا حسين بن علي الجعفي، عن زائدة، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم حرم يوم خيبر كل ذي ناب من السباع والمجثمة والحمار الإنسي ‏.‏ قال وفي الباب عن علي وجابر والبراء وابن أبي أوفى وأنس والعرباض بن سارية وأبي ثعلبة وابن عمر وأبي سعيد ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وروى عبد العزيز بن محمد وغيره عن محمد بن عمرو هذا الحديث وإنما ذكروا حرفا واحدا نهى رسول الله صلى الله عليه وسلم عن كل ذي ناب من السباع ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     \"On the day of Khaibar, the Messenger of Allah (ﷺ) prohibited every predator possessing canines, and the Mujath-thamah, and the domestic donkey.\"He said: There are narrations on this topic from 'Ali, Jabir, Al-Bara', Ibn Abi Awfa, Anas, Al-'Irbad bin Sariyah, Abu Tha'labah, Ibn 'Umar and Abu Sa'eed.[Abu 'Eisa said:] This Hadith is Hasan Sahih.'Abdul-'Aziz bin Muhammad and others reported this Hadith from Muhammad bin 'Amr, and they only mentioned one phrase: \"The Messenger of Allah (ﷺ) prohibited every predator possessing canines.\"",
      "chain": [
        "30216",
        "20315",
        "20320",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3119",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا حسين الجعفي، عن زائدة، عن حكيم بن جبير، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لكل شيء سنام وإن سنام القرآن سورة البقرة وفيها آية هي سيدة آى القرآن هي آية الكرسي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث حكيم بن جبير ‏.‏ وقد تكلم شعبة في حكيم بن جبير وضعفه ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ): \"For everything there is a hump (pinnacle) and the hump (pinnacle) of the Qur'an is Surat Al-Baqarah, in it there is an Ayah which is the master of the Ayat in the Qur'an; [it is] Ayat Al-Kursi.\"",
      "chain": [
        "30277",
        "20315",
        "20320",
        "19866",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3141",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا قتيبة، ومحمد بن بشار، قالا حدثنا عبد الرحمن بن مهدي، حدثنا زائدة، عن منصور، عن هلال بن يساف، عن ربيع بن خثيم، عن عمرو بن ميمون، عن عبد الرحمن بن أبي ليلى، عن امرأة، وهي امرأة أبي أيوب عن أبي أيوب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيعجز أحدكم أن يقرأ في ليلة ثلث القرآن من قرأ الله الواحد الصمد فقد قرأ ثلث القرآن ‏\"‏ ‏.‏ وفي الباب عن أبي الدرداء وأبي سعيد وقتادة بن النعمان وأبي هريرة وأنس وابن عمر وأبي مسعود ‏.‏ قال أبو عيسى هذا حديث حسن ولا نعرف أحدا روى هذا الحديث أحسن من رواية زائدة وتابعه على روايته إسرائيل والفضيل بن عياض وقد روى شعبة وغير واحد من الثقات هذا الحديث عن منصور واضطربوا فيه ‏.‏",
      "text_en": " Narrated Abu Ayyub:                     that the Messenger of Allah (ﷺ) said: \"Would one of you like to recite a third of the Qur'an during a night? Whoever recited: Allaahu Al-Wahid As-Samad then he has recited a third of the Qur'an.\"",
      "chain": [
        "30367",
        "30160",
        "20033",
        "20320",
        "11067",
        "10835",
        "11382",
        "11196",
        "33"
      ]
    },
    {
      "hadith_no": "3365",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، أخبرني معاوية بن عمرو، عن زائدة، عن الأعمش، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لم تحل الغنائم لأحد سود الرءوس من قبلكم كانت تنزل نار من السماء فتأكلها ‏\"‏ ‏.‏ قال سليمان الأعمش فمن يقول هذا إلا أبو هريرة الآن فلما كان يوم بدر وقعوا في الغنائم قبل أن تحل لهم فأنزل الله تعالى ‏:‏ ‏(‏لولا كتاب من الله سبق لمسكم فيما أخذتم عذاب عظيم ‏)‏ قال أبو عيسى هذا حديث حسن صحيح غريب من حديث الأعمش ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Prophet (ﷺ) said: \"None of the black heads (meaning the Children of Adam since (most of) their heads are black) before you partook of spoils of war, but fire from the heavens would be sent down upon them, consuming them.\" Sulaiman (one of the narrators) said \"No one says this except for Abu Hurairah now. \"So on the day of Badr when they had the spoils of war before it was made lawful for them, Allah [Most High] revealed: Were it not a previous ordainment from Allah, a severe torment would have touched you for what you took.\"",
      "chain": [
        "30553",
        "20389",
        "20320",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3367",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا حسين بن علي الجعفي، عن زائدة، عن شبيب بن غرقدة، عن سليمان بن عمرو بن الأحوص، حدثنا أبي أنه، شهد حجة الوداع مع رسول الله صلى الله عليه وسلم فحمد الله وأثنى عليه وذكر ووعظ ثم قال ‏\"‏ أى يوم أحرم أى يوم أحرم أى يوم أحرم ‏\"‏ ‏.‏ قال فقال الناس يوم الحج الأكبر يا رسول الله ‏.‏ قال ‏\"‏ فإن دماءكم وأموالكم وأعراضكم عليكم حرام كحرمة يومكم هذا في بلدكم هذا في شهركم هذا ألا لا يجني جان إلا على نفسه ولا يجني والد على ولده ولا ولد على والده ألا إن المسلم أخو المسلم فليس يحل لمسلم من أخيه شيء إلا ما أحل من نفسه ألا وإن كل ربا في الجاهلية موضوع لكم رءوس أموالكم لا تظلمون ولا تظلمون غير ربا العباس بن عبد المطلب فإنه موضوع كله ألا وإن كل دم كان في الجاهلية موضوع وأول دم أضع من دماء الجاهلية دم الحارث بن عبد المطلب كان مسترضعا في بني ليث فقتلته هذيل ألا واستوصوا بالنساء خيرا فإنما هن عوان عندكم ليس تملكون منهن شيئا غير ذلك إلا أن يأتين بفاحشة مبينة فإن فعلن فاهجروهن في المضاجع واضربوهن ضربا غير مبرح فإن أطعنكم فلا تبغوا عليهن سبيلا ألا إن لكم على نسائكم حقا ولنسائكم عليكم حقا فأما حقكم على نسائكم فلا يوطئن فرشكم من تكرهون ولا يأذن في بيوتكم من تكرهون ألا وإن حقهن عليكم أن تحسنوا إليهن في كسوتهن وطعامهن ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وقد رواه أبو الأحوص عن شبيب بن غرقدة ‏.‏",
      "text_en": " Narrated Sulaiman bin 'Amr bin Al-Ahwas:                     \"My father narrated to me that he attended the Farewell Hajj with the Messenger of Allah (ﷺ). He (ﷺ) expressed his gratitude to Allah and praised Him, and reminded and exhorted, then he said: 'Which day is most sacred? Which day is most sacred? Which day is most sacred?' He said: \"So the people said: 'The day of Al-Hajj Al-Akbar O Messenger of Allah!' So he said: 'Indeed, your blood, your wealth, your honor, is as sacred for you as the sacredness of this day of yours, in this city of yours, in this month of yours. Behold! None commits a crime but against himself, none offends a father for a son, nor a son for a father. Behold! Indeed the Muslim is the brother of the Muslim, so it is not lawful for the Muslim to do anything to his brother, which is not lawful to be done to himself. Behold! All Riba from Jahiliyyah is invalid, for you is the principle of your wealth, but your are not to wrong nor be wronged - except in the case of Riba of Al-'Abbas bin 'Abdul-Muttalib - otherwise it is all invalid. Behold! All retribution regarding cases of blood during Jahiliyyah are invalid. The first case of blood retribution invalidated among those of Jahiliyyah, is the blood of Al-Harith bin 'Abdul-Muttalib who was nursed among Banu Laith and killed by Hudhail. Behold! I order you to treat women well, for they are but like captives with you, you have no sovereignty beyond this over them, unless they manifest lewdness. If they do that, then abandon their beds, and beat them with a beating that is not painful. Then if they obey you, then there is no cause for you against them beyond that. Behold! There are rights for you upon your women, and rights for your women upon you. As for your rights upon them,then they are not to allow anyone on your bedding whom you dislike, nor to permit anyone whom you dislike in your homes. Behold! Indeed their rights upon you are that you treat them well in clothing them and feeding them.'\"",
      "chain": [
        "30115",
        "20315",
        "20320",
        "11430",
        "19868"
      ]
    },
    {
      "hadith_no": "3401",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا حسين الجعفي، عن زائدة، عن عبد الملك بن عمير، عن عبد الرحمن بن أبي ليلى، عن معاذ بن جبل، قال أتى النبي صلى الله عليه وسلم رجل فقال يا رسول الله أرأيت رجلا لقي امرأة وليس بينهما معرفة فليس يأتي الرجل شيئا إلى امرأته إلا قد أتى هو إليها إلا أنه لم يجامعها ‏.‏ قال فأنزل الله ‏:‏ ‏(‏ أقم الصلاة طرفى النهار وزلفا من الليل إن الحسنات يذهبن السيئات ذلك ذكرى للذاكرين ‏)‏ فأمره أن يتوضأ ويصلي ‏.‏ قال معاذ فقلت يا رسول الله أهي له خاصة أم للمؤمنين عامة قال ‏\"‏ بل للمؤمنين عامة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث ليس إسناده بمتصل عبد الرحمن بن أبي ليلى لم يسمع من معاذ ومعاذ بن جبل مات في خلافة عمر وقتل عمر وعبد الرحمن بن أبي ليلى غلام صغير ابن ست سنين وقد روى عن عمر ورآه ‏.‏ وروى شعبة هذا الحديث عن عبد الملك بن عمير عن عبد الرحمن بن أبي ليلى عن النبي صلى الله عليه وسلم مرسل ‏.‏",
      "text_en": " Narrated Mu'adh bin Jabal:                     \"A man came to the Prophet (ﷺ) and said: 'O Messenger of Allah! What do you say about a man who meets a woman and there is no acquaintance between them. So there is nothing that a man who would do with his wife but he does it with her, except that he does not have intercourse with her?'\" He said: \"So Allah revealed: And perform the Salat, at the two ends of the day and in some hours of the night. Verily, the good deeds remove the evil deeds. That is a reminder for the mindful (11:114). So he ordered him to perform Wudu and Salat.\" Then Mu'adh said: \"I said: 'O Messenger of Allah! Is that specifically for him, or for the believers in general?' He said: 'Rather it is for the believers in general.'\"",
      "chain": [
        "30553",
        "20315",
        "20320",
        "11368",
        "11196",
        "32"
      ]
    },
    {
      "hadith_no": "3667",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا زائدة بن قدامة، عن منصور بن المعتمر، عن سعد بن عبيدة، عن أبي عبد الرحمن السلمي، عن علي، رضى الله عنه قال كنا في جنازة في البقيع فأتى النبي صلى الله عليه وسلم فجلس وجلسنا معه ومعه عود ينكت به في الأرض فرفع رأسه إلى السماء فقال ‏\"‏ ما من نفس منفوسة إلا قد كتب مدخلها ‏\"‏ ‏.‏ فقال القوم يا رسول الله أفلا نتكل على كتابنا فمن كان من أهل السعادة فإنه يعمل للسعادة ومن كان من أهل الشقاء فإنه يعمل للشقاء قال ‏\"‏ بل اعملوا فكل ميسر أما من كان من أهل السعادة فإنه ييسر لعمل السعادة وأما من كان من أهل الشقاء فإنه ييسر لعمل الشقاء ‏\"‏ ‏.‏ ثم قرأ ‏:‏ ‏(‏فأما من أعطى واتقى * وصدق بالحسنى * فسنيسره لليسرى * وأما من بخل واستغنى * وكذب بالحسنى * فسنيسره للعسرى ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Ali [may Allah be pleased with him] said:                     “We were at a funeral at Al-Baqi when the Prophet came and sat. So we sat with him. He had a stick with which he was scratching his head toward the heavens, and said: ‘There is not a single soul except that his place of entry has been decreed.’ The people said: ‘O Messenger of Allah! Shall we not then rely upon what has been written upon us? For whoever is t be among the people of bliss, then he shall do that acts that lead to bliss, and whoever is to be among the people of misery, then he shall do the acts that lead to misery?’ He said: ‘Rather, do the deeds, for everyone is facilitated. As for the one who shall be among the people of bliss; then verily he is facilitated  to do the acts that lead to bliss. And as for the one who shall be among the people of misery.’ Then he recited: As for him who has Taqwa, And believes in Al-Husna. We will make smooth for him the patch of ease. But he who is greedy and thinks himself sel-sufficient, and denies Al-Husna. We will make smooth for him the path to evil. And what will he wealth avail him when he goes down?”",
      "chain": [
        "30160",
        "20033",
        "20320",
        "11067",
        "11344",
        "11359",
        "5"
      ]
    },
    {
      "hadith_no": "4023",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا الحسن بن الصباح البزار، حدثنا سفيان بن عيينة، عن زائدة، عن عبد الملك بن عمير، عن ربعي، هو ابن حراش عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اقتدوا باللذين من بعدي أبي بكر وعمر ‏\"‏ ‏.‏",
      "text_en": " Narrated Hudhaifah:                     that the Messenger of Allah (ﷺ) said: \"Stick to the two after me, Abu Bakr and 'Umar.\"",
      "chain": [
        "30244",
        "20005",
        "20320",
        "11368",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "4024",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن منيع، وغير، واحد، قالوا حدثنا سفيان بن عيينة، عن عبد الملك بن عمير، نحوه وكان سفيان بن عيينة يدلس في هذا الحديث فربما ذكره عن زائدة عن عبد الملك بن عمير وربما لم يذكر فيه عن زائدة ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وفيه عن ابن مسعود ‏.‏ وروى سفيان الثوري هذا الحديث عن عبد الملك بن عمير عن مولى لربعي عن ربعي عن حذيفة عن النبي صلى الله عليه وسلم ‏.‏ وقد روي هذا الحديث من غير هذا الوجه أيضا عن ربعي عن حذيفة عن النبي صلى الله عليه وسلم ‏.‏ ورواه سالم الأنعمي كوفي عن ربعي بن حراش عن حذيفة عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": "",
      "chain": [
        "30242",
        "20005",
        "11368",
        "20005",
        "20320"
      ]
    },
    {
      "hadith_no": "4109",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا معاوية بن عمرو، حدثنا زائدة، عن عاصم، عن زر، عن علي بن أبي طالب، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن لكل نبي حواريا وإن حواري الزبير بن العوام ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ ويقال الحواري هو الناصر ‏.‏ سمعت ابن أبي عمر يقول قال سفيان بن عيينة الحواري هو الناصر ‏.‏",
      "text_en": " Narrated 'Ali bin Abi Talib [may Allah be pleased with him]:                     that the Messenger of Allah (ﷺ) said: \"Indeed, every Prophet has a Hawari, and my Hawari is Az-Zubair bin Al-'Awwam.\"",
      "chain": [
        "30242",
        "20389",
        "20320",
        "11080",
        "11337",
        "5"
      ]
    },
    {
      "hadith_no": "4191",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا معاوية بن عمرو الأزدي، حدثنا زائدة، عن بيان، عن قيس بن أبي حازم، عن جرير بن عبد الله، قال ما حجبني رسول الله صلى الله عليه وسلم منذ أسلمت ولا رآني إلا ضحك ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Jarir bin 'Abdullah:                     \"The Messenger of Allah (ﷺ) never screened me since I accepted Islam, nor did he look at me except that he laughed.\"",
      "chain": [
        "30242",
        "20389",
        "20320",
        "11326",
        "11046",
        "4057"
      ]
    },
    {
      "hadith_no": "4192",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا معاوية بن عمرو، حدثنا زائدة، عن إسماعيل بن أبي خالد، عن قيس، عن جرير، قال ما حجبني رسول الله صلى الله عليه وسلم منذ أسلمت ولا رآني إلا تبسم ‏.‏ قال هذا حديث حسن ‏.‏",
      "text_en": " Narrated Jarir:                     \"The Messenger of Allah (ﷺ) never screened me since I accepted Islam, nor did he look at me except that he smiled.\"",
      "chain": [
        "30242",
        "20389",
        "20320",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "hadith_no": "4258",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا القاسم بن دينار الكوفي، حدثنا معاوية بن عمرو، عن زائدة، عن عبد الملك بن عمير، عن موسى بن طلحة، قال ما رأيت أحدا أفصح من عائشة ‏.‏ قال هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Musa bin Talhah:                     \"I have not seen anyone clearer (in speech) than 'Aishah.\"",
      "chain": [
        "20389",
        "20320",
        "11368",
        "579"
      ]
    },
    {
      "hadith_no": "91",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا موسى بن عبد الرحمن، قال حدثنا حسين بن علي، عن زائدة، قال حدثنا خالد بن علقمة، عن عبد خير، عن علي، أنه دعا بوضوء فتمضمض واستنشق ونثر بيده اليسرى ففعل هذا ثلاثا ثم قال هذا طهور نبي الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that 'Ali called for (water for) Wudu', then he rinsed his mouth and nose, and he sniffed up water and blew it out using his left hand. He did that three times, then he said:                      \"This is how the Prophet of Allah (ﷺ) purified himself.\"",
      "chain": [
        "20315",
        "20320",
        "19874",
        "5"
      ]
    },
    {
      "hadith_no": "105",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "وأخبرنا الحسين بن عبد الرحمن الجرجرائي، عن طلق بن غنام، قال حدثنا زائدة، وحفص بن غياث، عن الأعمش، عن الحكم، عن عبد الرحمن بن أبي ليلى، عن البراء بن عازب، عن بلال، قال رأيت رسول الله صلى الله عليه وسلم يمسح على الخفين ‏.‏",
      "text_en": " It was narrated that Bilal said:                      \"I saw the Messenger of Allah (ﷺ) wiping over the Khuff.\"",
      "chain": [
        "30197",
        "20320",
        "20317",
        "11060",
        "11069",
        "11196",
        "400",
        "24"
      ]
    },
    {
      "hadith_no": "195",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عبيد الله بن سعيد، قال أنبأنا عبد الرحمن، عن زائدة، ح وأخبرنا إسحاق بن إبراهيم، - واللفظ له - أنبأنا أبو الوليد، حدثنا زائدة، عن الركين بن الربيع بن عميلة الفزاري، عن حصين بن قبيصة، عن علي، - رضى الله عنه - قال كنت رجلا مذاء فسألت النبي صلى الله عليه وسلم فقال ‏\"‏ إذا رأيت المذى فتوضأ واغسل ذكرك وإذا رأيت فضخ الماء فاغتسل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ali said:                      \"I was one who had a lot of prostatic discharge, so I asked the Prophet (ﷺ) and he said: 'If you see Madhi (prostatic fluid) then perform Wudu' and wash your penis, but if you see semen ejaculated, then perform Ghusl.'\"",
      "chain": [
        "30359",
        "20033",
        "20320",
        "30123",
        "20296",
        "20320",
        "10763",
        "15100",
        "5"
      ]
    },
    {
      "hadith_no": "245",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا حسين، عن زائدة، قال حدثنا عطاء بن السائب، قال حدثني أبو سلمة بن عبد الرحمن، قال حدثتني عائشة، رضى الله عنها أن رسول الله صلى الله عليه وسلم كان إذا اغتسل من الجنابة وضع له الإناء فيصب على يديه قبل أن يدخلهما الإناء حتى إذا غسل يديه أدخل يده اليمنى في الإناء ثم صب باليمنى وغسل فرجه باليسرى حتى إذا فرغ صب باليمنى على اليسرى فغسلهما ثم تمضمض واستنشق ثلاثا ثم يصب على رأسه ملء كفيه ثلاث مرات ثم يفيض على جسده ‏.‏",
      "text_en": " 'Aishah narrated that when the Messenger of Allah (ﷺ) performed Ghusl from Janabah, the vessel (of water) would be placed before him, and he would pour water over his hands before putting then into the vessel. When he had washed his hands, he would put his right hand in the vessel then pour water with his right hand and wash his private parts with his left hand. When he had finished, he would pour water with his right hand over his left hand and wash them both. Then he would rinse his mouth and nose three times, then he would pour water filling both of his hands over his head three times, then he would pour water over his body.",
      "chain": [
        "38022",
        "11278",
        "20320",
        "11068",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "670",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا القاسم بن زكريا بن دينار، قال حدثنا حسين بن علي، عن زائدة، قال حدثنا سعيد بن أبي عروبة، قال حدثنا هشام، أن أبا الزبير المكي، حدثهم عن نافع بن جبير، أن أبا عبيدة بن عبد الله بن مسعود، حدثهم أن عبد الله بن مسعود قال كنا في غزوة فحبسنا المشركون عن صلاة الظهر والعصر والمغرب والعشاء فلما انصرف المشركون أمر رسول الله صلى الله عليه وسلم مناديا فأقام لصلاة الظهر فصلينا وأقام لصلاة العصر فصلينا وأقام لصلاة المغرب فصلينا وأقام لصلاة العشاء فصلينا ثم طاف علينا فقال ‏\"‏ ما على الأرض عصابة يذكرون الله عز وجل غيركم ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin Mas'ud said:                      \"We were fighting a battle and the idolators kept us from praying Zuhr, 'Asr, Maghrib and 'Isha'. When the idolators went away, the Messenger of Allah commanded a caller to say Iqamah for Zuhr prayer, and we prayed. Then he said the Iqamah for 'Asr, and we prayed, and he said the Iqamah for Maghrib and we prayed, and he said the Iqamah for 'Isha' and we prayed. Then we went around among us and said: 'There is no group on Earth who is remembering Allah, the Mighty and Sublime, except you.'\"",
      "chain": [
        "30475",
        "20315",
        "20320",
        "11073",
        "11065",
        "11263",
        "11059",
        "16"
      ]
    },
    {
      "hadith_no": "777",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، وهناد بن السري، عن حسين بن علي، عن زائدة، عن عاصم، عن زر، عن عبد الله، قال لما قبض رسول الله صلى الله عليه وسلم قالت الأنصار منا أمير ومنكم أمير ‏.‏ فأتاهم عمر فقال ألستم تعلمون أن رسول الله صلى الله عليه وسلم قد أمر أبا بكر أن يصلي بالناس فأيكم تطيب نفسه أن يتقدم أبا بكر قالوا نعوذ بالله أن نتقدم أبا بكر ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                      \"When the Messenger of Allah(ﷺ) passed away, the Ansar said: 'Let there be an Amir from among us and an Amir from among you.' Then 'Umar came to them and said: 'Do you not know that the Messenger of Allah(ﷺ) commanded Abu Bakr to lead the people in prayer? Who mong you could accept to put himself ahead of Abu Bakr?' They said: 'We seek refuge with Allah from putting ourselves ahead of Abu Bakr.\"'",
      "chain": [
        "30123",
        "30480",
        "20315",
        "20320",
        "11080",
        "11337",
        "16"
      ]
    },
    {
      "hadith_no": "789",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا موسى بن عبد الرحمن المسروقي، حدثنا حسين بن علي، عن زائدة، عن سفيان، عن أيوب، قال حدثني عمرو بن سلمة الجرمي، قال كان يمر علينا الركبان فنتعلم منهم القرآن فأتى أبي النبي صلى الله عليه وسلم فقال ‏\"‏ ليؤمكم أكثركم قرآنا ‏\"‏ ‏.‏ فجاء أبي فقال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليؤمكم أكثركم قرآنا ‏\"‏ ‏.‏ فنظروا فكنت أكثرهم قرآنا فكنت أؤمهم وأنا ابن ثمان سنين ‏.‏",
      "text_en": " 'Amr bin Salamah Al-Jarmi said:                      \"Riders used to pass by us and we would leam the Qur'an from them. My father came to the Prophet (ﷺ) and he said: 'Let the one of you who knows most Qur'an leads the prayer.' My father came and said that the Messenger of Allah (ﷺ) had said: 'Let the one of you who knows most Quran lead you in prayer.' They looked and found that I was the one who knew most Qur'an, so I used to lead them in prayer when I was eight years old.'",
      "chain": [
        "35153",
        "20315",
        "20320",
        "20005",
        "11015",
        "5206"
      ]
    },
    {
      "hadith_no": "834",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا العباس بن عبد العظيم العنبري، قال حدثنا عبد الرحمن بن مهدي، قال حدثنا زائدة، عن موسى بن أبي عائشة، عن عبيد الله بن عبد الله، قال دخلت على عائشة فقلت ألا تحدثيني عن مرض رسول الله صلى الله عليه وسلم ‏.‏ قالت لما ثقل رسول الله صلى الله عليه وسلم فقال ‏\"‏ أصلى الناس ‏\"‏ ‏.‏ فقلنا لا وهم ينتظرونك يا رسول الله ‏.‏ فقال ‏\"‏ ضعوا لي ماء في المخضب ‏\"‏ ‏.‏ ففعلنا فاغتسل ثم ذهب لينوء فأغمي عليه ثم أفاق فقال ‏\"‏ أصلى الناس ‏\"‏ ‏.‏ قلنا لا هم ينتظرونك يا رسول الله ‏.‏ فقال ‏\"‏ ضعوا لي ماء في المخضب ‏\"‏ ‏.‏ ففعلنا فاغتسل ثم ذهب لينوء ثم أغمي عليه ثم قال في الثالثة مثل قوله قالت والناس عكوف في المسجد ينتظرون رسول الله صلى الله عليه وسلم لصلاة العشاء فأرسل رسول الله صلى الله عليه وسلم إلى أبي بكر ‏\"‏ أن صل بالناس ‏\"‏ ‏.‏ فجاءه الرسول فقال إن رسول الله صلى الله عليه وسلم يأمرك أن تصلي بالناس وكان أبو بكر رجلا رقيقا فقال يا عمر صل بالناس ‏.‏ فقال أنت أحق بذلك ‏.‏ فصلى بهم أبو بكر تلك الأيام ثم إن رسول الله صلى الله عليه وسلم وجد من نفسه خفة فجاء يهادى بين رجلين أحدهما العباس لصلاة الظهر فلما رآه أبو بكر ذهب ليتأخر فأومأ إليه رسول الله صلى الله عليه وسلم أن لا يتأخر وأمرهما فأجلساه إلى جنبه فجعل أبو بكر يصلي قائما والناس يصلون بصلاة أبي بكر ورسول الله صلى الله عليه وسلم يصلي قاعدا ‏.‏ فدخلت على ابن عباس فقلت ألا أعرض عليك ما حدثتني عائشة عن مرض رسول الله صلى الله عليه وسلم قال نعم ‏.‏ فحدثته فما أنكر منه شيئا غير أنه قال أسمت لك الرجل الذي كان مع العباس قلت لا ‏.‏ قال هو علي كرم الله وجهه ‏.‏",
      "text_en": " It was narrated that 'Ubaidullah bin 'Abdullah said:                      \"I entered upon Aisha and said: 'Will you not tell me about the sickness of the Messenger of Allah (ﷺ)?' She said: 'When the Messenger of Allah (ﷺ), became seriously ill, he said: \"Have the people prayed?\" We said: \"No, they are waiting for you, 0 Messenger of Allah (ﷺ)\" He said: \"Put some water in a tub for me.\" We did that and he performed Ghusl, then he tried to  get up but he fainted. Then he came to us and said: \"Have the people prayed?\" We said: \"No, they are waiting for you, 0 Messenger ofAllah (ﷺ).\" He said: \"Put some water ina tub for me.\" We did that and he performed Ghusl, then he tried to get up but he fainted. Then for the third time he said the same thing. She said: The people were in the Masjid, waiting for the Messenger of Allah (ﷺ) to lead the prayer. The Messenger of Allah (ﷺ) sent word to Abu Bakr, telling him to lead the people in prayer, so the messenger came to him and said: \"The Messenger of Allah (ﷺ) is telling you  to lead the people in prayer.\" Abu Bakr was a tenderhearted man, he said: \"0 'Umar. lead the in prayer.\" But ('Umar) said: \"You have more right to that.\" So Abu Bakr led them in prayer during those days. When the Messenger of Allah (ﷺ) felt a little better, he came withthe help of two men, one of whom was Al-'Abbas, to pray Zuhr. When Abu Bakr saw him, he wanted to step back, but the Messenger of Allah (ﷺ) gestured to him not to step back. He told them (the two men) to seat him beside Abu Bakr, and Abu Bakr started to pray standing. The people were following the prayer of Abu Bakr and the Messenger of Allah (ﷺ) was praying sitting.\"'\"I ('Ubaidullah) entered upon Ibn Abbas and said 'Shall I not tell you what Aisha narrated to me about the sickness of the Messenger of Allah (ﷺ)?' He said: 'Yes.' So I told him and he did not deny any of it, but he said: 'Did she tell you the name of the man who was with Al-'Abbas?' I said: 'No.' He said: 'Thatwas Ali, may Allah honor his face.\"'",
      "chain": [
        "30437",
        "20033",
        "20320",
        "11399",
        "11004"
      ]
    },
    {
      "hadith_no": "847",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله بن المبارك، عن زائدة بن قدامة، قال حدثنا السائب بن حبيش الكلاعي، عن معدان بن أبي طلحة اليعمري، قال قال لي أبو الدرداء أين مسكنك قلت في قرية دوين حمص ‏.‏ فقال أبو الدرداء سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من ثلاثة في قرية ولا بدو لا تقام فيهم الصلاة إلا قد استحوذ عليهم الشيطان فعليكم بالجماعة فإنما يأكل الذئب القاصية ‏\"‏ ‏.‏ قال السائب يعني بالجماعة الجماعة في الصلاة ‏.‏",
      "text_en": " It was narrated that Ma'din bin Abi Talhah Al-Ya'muri said:                      \"Abu Ad-Darda said to me: 'Where do you live?' I said: 'In a town near Hims.' Abu Ad-Darda said: 'I heard the Messenger of Allah (ﷺ) say: \"There are no three people in a town or encampment among whom prayer is not established, but the Shaitan takes control of them. Therefore, stick to the congregation, for the wolf eats the sheep that strays off on its own.\" (One of the narrators (As Sa'ib) said: \"The congregation means the congregational prayer.\"",
      "chain": [
        "38265",
        "20025",
        "20320",
        "18336",
        "10878"
      ]
    },
    {
      "hadith_no": "889",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله بن المبارك، عن زائدة، قال حدثنا عاصم بن كليب، قال حدثني أبي أن وائل بن حجر، أخبره قال قلت لأنظرن إلى صلاة رسول الله صلى الله عليه وسلم كيف يصلي فنظرت إليه فقام فكبر ورفع يديه حتى حاذتا بأذنيه ثم وضع يده اليمنى على كفه اليسرى والرسغ والساعد فلما أراد أن يركع رفع يديه مثلها - قال - ووضع يديه على ركبتيه ثم لما رفع رأسه رفع يديه مثلها ثم سجد فجعل كفيه بحذاء أذنيه ثم قعد وافترش رجله اليسرى ووضع كفه اليسرى على فخذه وركبته اليسرى وجعل حد مرفقه الأيمن على فخذه اليمنى ثم قبض اثنتين من أصابعه وحلق حلقة ثم رفع إصبعه فرأيته يحركها يدعو بها ‏.‏",
      "text_en": " Wa'il bin Hujr said:                     \"I said: 'I am going to watch how the Messenger of Allah (ﷺ) prays.' So I watched him and he stood and said the takbir, and raised his hands until they were in the level with his ears, then he placed his right hand over his left hand, wrist and lower forearm. When he wanted to bow he raised his hands likewise. Then he prostrated and placed his hands in level with his ears. Then he sat up and placed his left leg under him; he put his left hand on his left thigh and knee, and he put the edge of his right elbow on his right thigh, then he held two of his fingers together and made a circle, and raised his forefinger, and I saw him moving it and supplicating with it.\"",
      "chain": [
        "38265",
        "20025",
        "20320",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "996",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا عبد الرحمن، قال حدثنا زائدة، عن منصور، عن هلال بن يساف، عن ربيع بن خثيم، عن عمرو بن ميمون، عن ابن أبي ليلى، عن امرأة، عن أبي أيوب، عن النبي صلى الله عليه وسلم قال ‏\"‏ ‏{‏ قل هو الله أحد ‏}‏ ثلث القرآن ‏\"‏ ‏.‏ قال أبو عبد الرحمن ما أعرف إسنادا أطول من هذا ‏.‏",
      "text_en": " It was narrated from Abu Ayyub that:                     The Prophet (ﷺ) said: \"Say: He is Allah, (the) One\" is one-third of the Quran.\"",
      "chain": [
        "30160",
        "20033",
        "20320",
        "11067",
        "10835",
        "11382",
        "11196",
        "33"
      ]
    },
    {
      "hadith_no": "1037",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا أحمد بن سليمان الرهاوي، قال حدثنا حسين، عن زائدة، عن عطاء، عن سالم أبي عبد الله، عن عقبة بن عمرو، قال ألا أصلي لكم كما رأيت رسول الله صلى الله عليه وسلم يصلي فقلنا بلى ‏.‏ فقام فلما ركع وضع راحتيه على ركبتيه وجعل أصابعه من وراء ركبتيه وجافى إبطيه حتى استقر كل شىء منه ثم رفع رأسه فقام حتى استوى كل شىء منه ثم سجد فجافى إبطيه حتى استقر كل شىء منه ثم قعد حتى استقر كل شىء منه ثم سجد حتى استقر كل شىء منه ثم صنع كذلك أربع ركعات ثم قال هكذا رأيت رسول الله صلى الله عليه وسلم يصلي وهكذا كان يصلي بنا ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin 'Amir said:                     \"Shall I not show you how I saw the Messenger of Allah (ﷺ) pray?\" We said: \"Yes.\" So he stood up and when he bowed, he placed his palms on his knees and put his fingers behind his knees, and held his arms out from his sides, until every part of him settled. Then he raised his head and stood up until every part of him settled. Then he prostrated and held his arms out from his sides, until every part of him settled. Then he sat up until every part of him settled. Then he prostrated again until every part of him settled. Then he did four rak'ahs like that. Then he said: \"This is how I saw the Messenger of Allah (ﷺ) pray, and this is how he used to lead us in prayer.\"",
      "chain": [
        "38022",
        "11278",
        "20320",
        "11029"
      ]
    },
    {
      "hadith_no": "1196",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا عمرو بن علي، قال حدثنا عبد الرحمن، قال حدثنا زائدة، عن أشعث بن أبي الشعثاء، عن أبيه، عن مسروق، عن عائشة، - رضى الله عنها - قالت سألت رسول الله صلى الله عليه وسلم عن الالتفات في الصلاة فقال ‏\"‏ اختلاس يختلسه الشيطان من الصلاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah, may Allah (SWT) be pleased with her, said:                     X\"I asked the Messenger of Allah (ﷺ) about looking here and there during prayer. He said: 'That is something that the Shaitan snatches from one's prayer.'\"",
      "chain": [
        "30153",
        "20033",
        "20320",
        "11324",
        "11351",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "1268",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله بن المبارك، عن زائدة، قال حدثنا عاصم بن كليب، قال حدثني أبي أن وائل بن حجر، قال قلت لأنظرن إلى صلاة رسول الله صلى الله عليه وسلم كيف يصلي فنظرت إليه فوصف قال ثم قعد وافترش رجله اليسرى ووضع كفه اليسرى على فخذه وركبته اليسرى وجعل حد مرفقه الأيمن على فخذه اليمنى ثم قبض اثنتين من أصابعه وحلق حلقة ثم رفع أصبعه فرأيته يحركها يدعو بها ‏.‏ مختصر ‏.‏",
      "text_en": " Wa'il bin Hujr said:                     \"I am going to watch the Messenger of Allah (ﷺ) and see how he prays. So, I watched him.\" And he described (his prayer): \"Then he sat and lay his left foot on the ground, and placed his left hand on his left thigh and knee. He put his right elbow on his right thigh, then he made a circle with two fingers of his (right) hand, then he raised his finger and I saw him moving it, supplicating with it.\"",
      "chain": [
        "38265",
        "20025",
        "20320",
        "10778",
        "19941",
        "3045"
      ]
    },
    {
      "hadith_no": "1287",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا القاسم بن زكريا بن دينار، من كتابه قال حدثنا حسين بن علي، عن زائدة، عن سليمان، عن عمرو بن مرة، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، قال قلنا يا رسول الله السلام عليك قد عرفناه فكيف الصلاة قال ‏\"‏ قولوا اللهم صل على محمد وعلى آل محمد كما صليت على آل إبراهيم إنك حميد مجيد اللهم بارك على محمد وعلى آل محمد كما باركت على آل إبراهيم إنك حميد مجيد ‏\"‏ ‏.‏ قال ابن أبي ليلى ونحن نقول وعلينا معهم ‏.‏ قال أبو عبد الرحمن حدثنا به من كتابه وهذا خطأ ‏.‏",
      "text_en": " It was narrated that Ka'b bin 'Ujrah said:                     \"We said: 'O Messenger of Allah (ﷺ), we know about sending salams upon you, but how should we send salah upon you?' He said: \"Say: 'Alahumma salli 'ala Muhammad wa 'ala ali Muhammad, kama sallaita 'ala Ibrahima wa barik 'ala Muhammad kama barakta 'ala ali Ibrahim fil-'alamin, innaka hamidun majid (O Allah, send salah upon Muhammad and upon the family of Muhammad, as You sent salah upon the family of Ibrahim, and send blessings upon Muhammad and upon the family of Muhammad as You sent blessings upon the family of Ibrahim among the nations. You are indeed Worthy of praise, Full of glory.)'\" (One of the narrators) Ibn Abi Laila said: \"We used to say: 'And also upon us.'\" Abu Abdur-Rahman (An-Nasa'I) said: It was narrated from his book, and this is a mistake.",
      "chain": [
        "36617",
        "20315",
        "20320",
        "11060",
        "11381",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "1288",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا القاسم بن زكريا، قال حدثنا حسين، عن زائدة، عن سليمان، عن الحكم، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، قال قلنا يا رسول الله السلام عليك قد عرفناه فكيف الصلاة عليك قال ‏\"‏ قولوا اللهم صل على محمد وعلى آل محمد كما صليت على إبراهيم وآل إبراهيم إنك حميد مجيد وبارك على محمد وعلى آل محمد كما باركت على إبراهيم وآل إبراهيم إنك حميد مجيد ‏\"‏ ‏.‏ قال عبد الرحمن ونحن نقول وعلينا معهم ‏.‏ قال أبو عبد الرحمن وهذا أولى بالصواب من الذي قبله ولا نعلم أحدا قال فيه عمرو بن مرة غير هذا والله تعالى أعلم ‏.‏",
      "text_en": " It was narrated that Ka'b bin 'Ujrah said:                     'We said: \"O Messenger of Allah (ﷺ), we know about sending salams upon you, but how should we send salah upon you?\" He said: 'Say: Alahumma salli 'ala Muhammad wa 'ala ali Muhammad, kama sallaita 'ala Ibrahima wa barik 'ala Muhammad kama barakta 'ala ali Ibrahim fil-'alamin, innaka hamidun majid (O Allah, send salah upon Muhammad and upon the family of Muhammad, as You sent salah upon the family of Ibrahim, and send blessings upon Muhammad and upon the family of Muhammad as You sent blessings upon the family of Ibrahim among the nations. You are indeed Worthy of praise, Full of glory.)'\" (One of the narrators) 'abdur Rahman said: \"We used to say: 'And also upon us.'\" Abu Abdur-rahman (An Nasa'i) said: This is more worthy of being correct than the one that is before it. And we do not know of anyone who said \"Amr bin Murrah\" in it other than in this case. And Allah (SWT) knows best.",
      "chain": [
        "36617",
        "11278",
        "20320",
        "11060",
        "11069",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "1705",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا حسين، عن زائدة، عن حصين، عن حبيب بن أبي ثابت، عن محمد بن علي بن عبد الله بن عباس، عن أبيه، عن جده، قال كنت عند النبي صلى الله عليه وسلم فقام فتوضأ واستاك وهو يقرأ هذه الآية حتى فرغ منها ‏{‏ إن في خلق السموات والأرض واختلاف الليل والنهار لآيات لأولي الألباب ‏}‏ ثم صلى ركعتين ثم عاد فنام حتى سمعت نفخه ثم قام فتوضأ واستاك ثم صلى ركعتين ثم نام ثم قام فتوضأ واستاك وصلى ركعتين وأوتر بثلاث ‏.‏",
      "text_en": " Husain narrated from Habib bin Abi Thabit, from Muhammad bin 'Ali bin 'Abdullah bin Abbas, from his father, that his grandfather said:                     \"I was with the Prophet (ﷺ) and he got up and performed wudu, cleaned his teeth while reciting this verse until he finished: 'Verily, in the creation of the heavens and the Earth, and in the alternation of night and day, there are indeed signs for men of understanding.' Then he prayed two rak'ahs, then he went back and slept until I heard him breathing deeply. Then he got up and performed wudu and cleaned his teeth. Then he prayed two rak'ahs, then he slept, then he got up and performed wudu and cleaned his teeth and prayed two rak'ahs and prayed witr with three rak'ahs.\"",
      "chain": [
        "38022",
        "11278",
        "20320",
        "15097",
        "11331",
        "10961",
        "10949"
      ]
    },
    {
      "hadith_no": "1709",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا حسين، عن زائدة، عن سليمان، عن عمارة بن عمير، عن يحيى بن الجزار، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصلي من الليل تسعا فلما أسن وثقل صلى سبعا ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah (ﷺ) used to pray nine (rak'ahs) at night, then when he grew older and put on weight he prayed seven.\"",
      "chain": [
        "38022",
        "11278",
        "20320",
        "11060",
        "11378",
        "10839",
        "53"
      ]
    },
    {
      "hadith_no": "1787",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا حسين بن علي، عن زائدة، عن سليمان، عن حبيب بن أبي ثابت، عن عبدة بن أبي لبابة، عن سويد بن غفلة، عن أبي الدرداء، يبلغ به النبي صلى الله عليه وسلم قال ‏\"‏ من أتى فراشه وهو ينوي أن يقوم يصلي من الليل فغلبته عيناه حتى أصبح كتب له ما نوى وكان نومه صدقة عليه من ربه عز وجل ‏\"‏ ‏.‏ خالفه سفيان ‏.‏",
      "text_en": " It was narrated from Abu Ad-Darda' who attributed it to the Prophet (ﷺ):                     \"Whoever goes to his bed intending to get up and pray qiyam at night, then sleep overwhelms him until morning, will have recorded that which he intended and his sleep is a charity given to him by his Lord, the Mighty and Sublime.\"",
      "chain": [
        "30524",
        "20315",
        "20320",
        "11060",
        "11331",
        "10793",
        "11174"
      ]
    },
    {
      "hadith_no": "2113",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا موسى بن عبد الرحمن، قال حدثنا حسين، عن زائدة، عن سماك، عن عكرمة، عن ابن عباس، قال جاء أعرابي إلى النبي صلى الله عليه وسلم فقال أبصرت الهلال الليلة ‏.‏ قال ‏\"‏ أتشهد أن لا إله إلا الله وأن محمدا عبده ورسوله ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ يا بلال أذن في الناس فليصوموا غدا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"A Bedouin come to the Prophet and said; 'I have sighted the crescent tonight.' He said: 'Do you bear witness that there is none worthy of worship except Allah, and that Messenger?' He said: 'Yes.' He said: 'O Bilal, announce to the people that they should fast tomorrow. \"'",
      "chain": [
        "11278",
        "20320",
        "10770",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2160",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا حسين، عن زائدة، عن الأعمش، عن عمارة، عن أبي عطية، قال دخلت أنا ومسروق، على عائشة فقال لها مسروق رجلان من أصحاب رسول الله صلى الله عليه وسلم كلاهما لا يألو عن الخير أحدهما يؤخر الصلاة والفطر والآخر يعجل الصلاة والفطر ‏.‏ فقالت عائشة أيهما الذي يعجل الصلاة والفطر قال مسروق عبد الله بن مسعود ‏.‏ فقالت عائشة هكذا كان يصنع رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Abu 'Atiyyah said:                     \"Masruq and I came to 'Aishah, and Masruq said to her: 'There are two men from among the Companions of the Messenger of Allah both of whom are good; one of them delays the prayer and Ifar, and the other hastens the prayer and Iftar.' 'Aishah said: 'Which of them is the one who hastens the prayer and Iftar?' Masruq said: 'That is what the Messenger of Allah  used to do.\"'",
      "chain": [
        "38022",
        "11278",
        "20320",
        "11060",
        "11379"
      ]
    },
    {
      "hadith_no": "2367",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا القاسم بن زكريا بن دينار، قال حدثنا حسين، عن زائدة، عن عاصم، عن المسيب، عن حفصة، قالت كان رسول الله صلى الله عليه وسلم إذا أخذ مضجعه جعل كفه اليمنى تحت خده الأيمن وكان يصوم الاثنين والخميس ‏.‏",
      "text_en": " It was narrated that Hafsah said:                     \"When the Messenger of Allah would lie down, he would place his right hand under his right cheek, and he used to fast on Mondays and Thursday.\"",
      "chain": [
        "30475",
        "11278",
        "20320",
        "11080",
        "11039"
      ]
    },
    {
      "hadith_no": "2516",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا موسى بن عبد الرحمن، قال حدثنا حسين، عن زائدة، قال حدثنا عبد العزيز بن أبي رواد، عن نافع، عن ابن عمر، قال كان الناس يخرجون عن صدقة الفطر، في عهد النبي صلى الله عليه وسلم صاعا من شعير أو تمر أو سلت أو زبيب ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"At the time of the Messenger of Allah, the people used to give as Sadaqatul Fitr a Sa' of barely or dates or rye or raising.\"",
      "chain": [
        "11278",
        "20320",
        "20739",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2720",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا مصعب بن المقدام، عن زائدة، عن منصور، عن شقيق، قال أنبأنا الصبى، فذكر مثله قال فأتيت عمر فقصصت عليه القصة إلا قوله يا هناه ‏.‏",
      "text_en": " (Another chain) that shaqiq said;a \"As-Subai told us something similar, and he said:                      'I came to 'Umar and told him the story, apart from the words: 'Hey you!'''",
      "chain": [
        "30123",
        "20608",
        "20320",
        "11067",
        "11353"
      ]
    },
    {
      "hadith_no": "3118",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عبدة بن عبد الله، قال حدثنا حسين بن علي، عن زائدة، عن سفيان، عن أبي حازم، عن سهل بن سعد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الغدوة والروحة في سبيل الله عز وجل أفضل من الدنيا وما فيها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Sahl bin Sa'd said:                      \"The Messenger of Allah (ﷺ) said: 'Going out before noon or after noon, in the cause of Allah, the Mighty and Sublime, is better than this world and everything in it.'\"",
      "chain": [
        "30149",
        "20315",
        "20320",
        "20005",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "3354",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا عبد الله بن محمد بن عبد الرحمن، قال حدثنا أبو سعيد عبد الرحمن بن عبد الله، عن زائدة بن قدامة، عن منصور، عن إبراهيم، عن علقمة، والأسود، قالا أتي عبد الله في رجل تزوج امرأة ولم يفرض لها فتوفي قبل أن يدخل بها فقال عبد الله سلوا هل تجدون فيها أثرا قالوا يا أبا عبد الرحمن ما نجد فيها يعني أثرا ‏.‏ قال أقول برأيي فإن كان صوابا فمن الله لها كمهر نسائها لا وكس ولا شطط ولها الميراث وعليها العدة فقام رجل من أشجع فقال في مثل هذا قضى رسول الله صلى الله عليه وسلم فينا في امرأة يقال لها بروع بنت واشق تزوجت رجلا فمات قبل أن يدخل بها فقضى لها رسول الله صلى الله عليه وسلم بمثل صداق نسائها ولها الميراث وعليها العدة ‏.‏ فرفع عبد الله يديه وكبر ‏.‏ قال أبو عبد الرحمن لا أعلم أحدا قال في هذا الحديث الأسود غير زائدة ‏.‏",
      "text_en": " It was narrated that 'Alqamah and Al-Aswad said:                      \"A man was brought to 'Abdullah who had married a woman without naming a dowry for her, then he died before consummating the marriage with her. 'Abdullah said: 'Ask whether they can find any report about that.' They said: 'O Abu 'Abdur-Rahman, we cannot find any report about that.' He said: 'I will say what I think, and if it is correct then it is from Allah. She should have a dowry like that of her peers and no less, with no injustice, and she may inherit from him, and she has to observe the 'Iddah.' A man from Ashja' stood up and said: \"The Messenger of Allah passed a similar judgment among us concerning a woman called Birwa' bint Washiq. She married a man who died before consummating the marriage with her, and the Messenger of Allah ruled that she should be given a dowry like that of her peers, and she could inherit, and she had to observe the 'Iddah.' 'Abdullah raised his hands and said the Takbir.\"",
      "chain": [
        "20320",
        "11067",
        "11051",
        "11017",
        "11054"
      ]
    },
    {
      "hadith_no": "3384",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا نصير بن الفرج، قال حدثنا أبو أسامة، عن زائدة، قال حدثنا عطاء بن السائب، عن أبيه، عن علي، رضى الله عنه قال جهز رسول الله صلى الله عليه وسلم فاطمة في خميل وقربة ووسادة حشوها إذخر ‏.‏",
      "text_en": " It was narrated that 'Ali, may Allah be pleased with him, said:                      \"The Messenger of Allah fitted out Fatimah with a velvet dress, a water-skin and a pillow stuffed with Idhkhar.\"",
      "chain": [
        "38667",
        "20318",
        "20320",
        "11068",
        "19867",
        "5"
      ]
    },
    {
      "hadith_no": "3435",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرني موسى بن عبد الرحمن، قال حدثنا حسين الجعفي، عن زائدة، عن شيبان، عن قتادة، عن زرارة بن أوفى، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله تعالى تجاوز لأمتي عما حدثت به أنفسها ما لم تكلم أو تعمل به ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet said:                      \"Allah, the Most High, has forgiven my Ummah for whatever enters the mind, so long as it is not spoken of or put into action.\"",
      "chain": [
        "20315",
        "20320",
        "20240",
        "11019",
        "11284",
        "13"
      ]
    },
    {
      "hadith_no": "3453",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا القاسم بن زكريا بن دينار، قال حدثنا حسين، عن زائدة، عن سماك، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، أنها اشترت بريرة من أناس من الأنصار فاشترطوا الولاء فقال رسول الله صلى الله عليه وسلم ‏\"‏ الولاء لمن ولي النعمة ‏\"‏ ‏.‏ وخيرها رسول الله صلى الله عليه وسلم وكان زوجها عبدا وأهدت لعائشة لحما فقال رسول الله صلى الله عليه وسلم ‏\"‏ لو وضعتم لنا من هذا اللحم ‏\"‏ ‏.‏ قالت عائشة تصدق به على بريرة ‏.‏ فقال ‏\"‏ هو عليها صدقة وهو لنا هدية ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that she bought Barirah from some of the Ansar who stipulated that her Wala' should go to them. The Messenger of Allah said:                      \"Al-Wala' is to the one who did the favor (of setting the slave free).\" The Messenger of Allah gave her the choice, as her husband was a slave. And she gave some meat to 'Aishah as a gift, and the Messenger of Allah said: \"Why don't you give me some of this meat?\" 'Aishah said: \"It was given in charity to Barirah.\" He said: \"It is a charity for her, and a gift for us.\"",
      "chain": [
        "30475",
        "11278",
        "20320",
        "10770",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "3542",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا العباس بن محمد، - هو الدوري - قال حدثنا الأسود بن عامر، عن زائدة، عن هشام، عن حفصة، عن أم عطية، عن النبي صلى الله عليه وسلم أنه رخص للمتوفى عنها عند طهرها في القسط والأظفار ‏.‏",
      "text_en": " It was narrated from Hafsah, from Umm 'Atiyyah, from the Prophet, that he granted a concession to the woman whose husband has died, allowing her to use Qust and Azfar when purifying herself following her menses.",
      "chain": [
        "20380",
        "20320",
        "11065",
        "54",
        "71"
      ]
    },
    {
      "hadith_no": "3850",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرني علي بن محمد بن علي، قال حدثنا خلف بن تميم، قال حدثنا زائدة، قال حدثنا علي بن زيد بن جدعان، عن الحسن، عن عبد الرحمن بن سمرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا نذر في معصية ولا فيما لا يملك ابن آدم ‏\"‏ ‏.‏ قال أبو عبد الرحمن علي بن زيد ضعيف وهذا الحديث خطأ والصواب عمران بن حصين ‏.‏ وقد روي هذا الحديث عن عمران بن حصين من وجه آخر ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin Samurah that the Prophet said:                      \"There is no vow to commit an act of disobedience or with regard to that which the son of Adam does not possess.\"",
      "chain": [
        "38409",
        "25082",
        "20320",
        "10664",
        "11016",
        "955"
      ]
    },
    {
      "hadith_no": "4120",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا علي بن محمد بن علي المصيصي، قال حدثنا خلف، عن زائدة، عن هشام، عن الحسن، عن أبي بكرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا تواجه المسلمان بسيفيهما كل واحد منهما يريد قتل صاحبه فهما في النار ‏\"‏ ‏.‏ قيل له يا رسول الله هذا القاتل فما بال المقتول قال ‏\"‏ إنه كان حريصا على قتل صاحبه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Bakrah that :                     The Prophet [SAW] said: \"If two Muslims confront each other with swords, each of them wanting to kill the other, they will both be in Hell.\" It was said to him: \"O Messenger of Allah, (we understand about) the killer, but what about the one who is killed?\" He said: \"He was determined to kill his companion.\"",
      "chain": [
        "38410",
        "20320",
        "11065",
        "11016",
        "3229"
      ]
    },
    {
      "hadith_no": "4142",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Distribution of Al-Fay' - كتاب قسم الفىء",
      "chapter_no": "38",
      "text_ar": "أخبرنا عمرو بن يحيى، قال حدثنا محبوب، قال أنبأنا أبو إسحاق، عن زائدة، عن عبد الملك بن أبي سليمان، عن عطاء، في قوله عز وجل ‏{‏ واعلموا أنما غنمتم من شىء فأن لله خمسه وللرسول ولذي القربى ‏}‏ قال خمس الله وخمس رسوله واحد كان رسول الله صلى الله عليه وسلم يحمل منه ويعطي منه ويضعه حيث شاء ويصنع به ما شاء ‏.‏",
      "text_en": " It was narrated that 'Ata' said concerning the saying of Allah, the Mighty and Sublime:                     \"And know that whatever of  spoils of war that you may gain, verily, (1/5th) of it is assigned to Allah, and to the Messenger, and to the near relatives (of the Messenger (Muhammad)\" \"The Khumus (one-fifth)  of Allah and of His Messenger is the same. The Messenger of Allah used to provide mounts (for jihad) with it, and give some (to the poor), and distribute it however he wanted, and do with it whatever he wanted.\"",
      "chain": [
        "11210",
        "11049",
        "20320",
        "10945"
      ]
    },
    {
      "hadith_no": "4297",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا حسين بن علي، عن زائدة، عن سعيد بن مسروق، عن عباية بن رفاعة بن رافع، عن رافع بن خديج، قال بينما نحن مع رسول الله صلى الله عليه وسلم في ذي الحليفة من تهامة فأصابوا إبلا وغنما ورسول الله صلى الله عليه وسلم في أخريات القوم فعجل أولهم فذبحوا ونصبوا القدور فدفع إليهم رسول الله صلى الله عليه وسلم فأمر بالقدور فأكفئت ثم قسم بينهم فعدل عشرا من الشاء ببعير فبينما هم كذلك إذ ند بعير وليس في القوم إلا خيل يسيرة فطلبوه فأعياهم فرماه رجل بسهم فحبسه الله فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن لهذه البهائم أوابد كأوابد الوحش فما غلبكم منها فاصنعوا به هكذا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rafi bin Khadij said:                     \"While we were with the Messenger of Allah at Dhul-Hulaifah in Tihamanb, they acquired some camels and sheep (as spoils of war). The Messenger of Allah was among the last of the people, and the first of them hastened to slaughter (the animals) and set up pots (For cooking the meat). The Messenger of Allah came and ordered that the pots be came and ordered that the pots be overturned, then he divided it making ten sheep equivalent to one camel. While they were like that, a camel ran away. The people had only a few horses, so they went after fit and it and it got away from them. A man shot an arrow at it and stopped it. The Messenger of Allah said: 'Some of these animals arte untamed like wild animals, so if one of them goes out of your control, do the same.\"",
      "chain": [
        "38022",
        "20315",
        "20320",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "4821",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا علي بن محمد بن علي، قال حدثنا خلف، - وهو ابن تميم - قال حدثنا زائدة، عن منصور، عن إبراهيم، عن عبيد بن نضيلة، عن المغيرة بن شعبة، أن امرأة، ضربت ضرتها بعمود فسطاط فقتلتها وهي حبلى فأتي فيها النبي صلى الله عليه وسلم فقضى رسول الله صلى الله عليه وسلم على عصبة القاتلة بالدية وفي الجنين غرة ‏.‏ فقال عصبتها أدي من لا طعم ولا شرب ولا صاح فاستهل فمثل هذا يطل فقال النبي صلى الله عليه وسلم ‏\"‏ أسجع كسجع الأعراب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Al-Mughirah bin Shu'bah that:                     a woman struck her co-wife with a tent pole and killed her, and she (the slain woman) was pregnant. She was brought to the Prophet, and the Messenger of Allah ruled that the 'Asabah of the killer should pay the Diyah , and a slavae (should be paid) for the fetus. Her 'Asabah said: \"Should Diyah be paid for one who neither ate nor drank, or shouted or cried (at the moment of birth)? Such a one should be overlooked.\" The prophet said: \"Rhyming verse like the verse of the Bedouins.\"",
      "chain": [
        "38409",
        "25082",
        "20320",
        "11067",
        "11051",
        "166"
      ]
    },
    {
      "hadith_no": "5495",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا موسى بن عبد الرحمن، قال حدثنا حسين، عن زائدة، عن حميد، عن أنس، قال كان رسول الله صلى الله عليه وسلم يتعوذ بهؤلاء الكلمات كان يقول ‏\"‏ اللهم إني أعوذ بك من الكسل والهرم والجبن والبخل وسوء الكبر وفتنة الدجال وعذاب القبر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"The Messenger of Allah [SAW] used to seek refuge by saying these words: 'Allahumma inni a'udhu bika minal-kasali, wal-harami, wal-jubni, wal-bukhli, wa suw'il-kibari, wa fitnatid-dajjali wa 'adhabil-qabr (O Allah, I seek refuge with You from laziness, old age, cowardice, miserliness, a bad old age, the tribulation of the Dajjal and the torment of the grave.)'\"",
      "chain": [
        "11278",
        "20320",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "155",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أحمد بن سعيد الدارمي، حدثنا يحيى بن أبي بكير، حدثنا زائدة بن قدامة، عن عاصم بن أبي النجود، عن زر بن حبيش، عن عبد الله بن مسعود، قال كان أول من أظهر إسلامه سبعة رسول الله  صلى الله عليه وسلم  وأبو بكر وعمار وأمه سمية وصهيب وبلال والمقداد فأما رسول الله  صلى الله عليه وسلم  فمنعه الله بعمه أبي طالب وأما أبو بكر فمنعه الله بقومه وأما سائرهم فأخذهم المشركون وألبسوهم أدراع الحديد وصهروهم في الشمس فما منهم من أحد إلا وقد واتاهم على ما أرادوا إلا بلالا فإنه قد هانت عليه نفسه في الله وهان على قومه فأخذوه فأعطوه الولدان فجعلوا يطوفون به في شعاب مكة وهو يقول أحد أحد ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Mas'ud said:                     \"The first people to declare their Islam publicly were seven: The Messenger of Allah, Abu Bakr, 'Ammar and his mother Sumayyah, Suhaib, Bilal and Miqdad. With regard to the Messenger of Allah, Allah protected him through his paternal uncle Abu Talib. With regard to Abu Bakr, Allah protected him through his people. As for the rest, the idolators seized them and made them wear coats of chain-mail and exposed them to the intense heat of the sun. There was none of them who did not do what they wanted them to do, except for Bilal. He did not care what happened to him for the sake of Allah, and his people did not care what happened to him. Then they gave him to the children who took him around in the streets of Makkah while he was saying, 'Ahad, Ahad (One, One).'\"",
      "chain": [
        "30296",
        "20365",
        "20320",
        "11358",
        "11337",
        "16"
      ]
    },
    {
      "hadith_no": "534",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الرحمن بن مهدي، حدثنا زائدة، وإسرائيل، عن أشعث بن أبي الشعثاء، عن جعفر بن أبي ثور، عن جابر بن سمرة، قال أمرنا رسول الله  صلى الله عليه وسلم  أن نتوضأ من لحوم الإبل ولا نتوضأ من لحوم الغنم ‏.‏",
      "text_en": " It was narrated that Jabir bin Samurah said:                     \"The Messenger of Allah commanded us to perform ablution after eating camel meat but not to perform ablution after eating the mutton.\"",
      "chain": [
        "30160",
        "20033",
        "20320",
        "20311",
        "11324",
        "10896",
        "393"
      ]
    },
    {
      "hadith_no": "759",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا رزق الله بن موسى، حدثنا يعقوب بن إسحاق الحضرمي، حدثنا زائدة بن قدامة، عن هشام بن عروة، عن أبيه، عن عائشة، قالت أمر رسول الله  صلى الله عليه وسلم  أن تتخذ المساجد في الدور وأن تطهر وتطيب ‏.‏",
      "text_en": " It was narrated from 'Aishah that:                     The Messenger of Allah commanded that places of prayer be established in villages, and that they be purified and perfumed.",
      "chain": [
        "36556",
        "20679",
        "20320",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "792",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، عن زائدة، عن عاصم، عن أبي رزين، عن ابن أم مكتوم، قال قلت للنبي  صلى الله عليه وسلم  إني كبير ضرير شاسع الدار وليس لي قائد يلاومني فهل تجد لي من رخصة قال ‏\"‏ هل تسمع النداء ‏\"‏ ‏.‏ قلت نعم ‏.‏ قال ‏\"‏ ما أجد لك رخصة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn Umm Maktum said:                     \"I said to the Prophet: 'I am an old man and blind; my house is far away, and I have no one to lead me. Is there any concession (for me not to have to attend the prayer in the mosque)?' He said: 'Can you hear the call?' I said: 'Yes.' He said: 'Then I do not find any concession for you.'\"",
      "chain": [
        "30201",
        "20318",
        "20320",
        "11080",
        "10826"
      ]
    },
    {
      "hadith_no": "1258",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو داود، سليمان بن توبة حدثنا يحيى بن أبي بكير، حدثنا زائدة، عن عبد الله بن محمد بن عقيل، عن جابر بن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  لأبي بكر ‏\"‏ أى حين توتر ‏\"‏ قال أول الليل بعد العتمة ‏.‏ قال ‏\"‏ فأنت يا عمر ‏\"‏ ‏.‏ فقال آخر الليل ‏.‏ فقال النبي  صلى الله عليه وسلم  ‏\"‏ أما أنت يا أبا بكر فأخذت بالوثقى وأما أنت يا عمر فأخذت بالقوة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Jabir bin ‘Abdullah said:                      “The Messenger ofAllah(ﷺ) said to Abu Bakr: ‘When do you pray Witr?’ He said: ‘Atthe beginning of the night, after ‘Isha’.’ He said: ‘And you,O‘Umar?’ He said: ‘At the end of the night.’ The Prophet(ﷺ) said:‘As for you, O Abu Bakr, you have seized thetrustworthy handhold(i.e., you want to be on the safe side), and asfor you, O ‘Umar, youhave seized strength (i.e., you are confidentthat you have theresolve to get up and pray Witr).’”",
      "chain": [
        "20365",
        "20320",
        "12246",
        "34"
      ]
    },
    {
      "hadith_no": "1405",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هارون بن عبد الله الحمال، حدثنا الحسين بن علي الجعفي، عن زائدة، عن سليمان الأعمش، عن حبيب بن أبي ثابت، عن عبدة بن أبي لبابة، عن سويد بن غفلة، عن أبي الدرداء، يبلغ به النبي  صلى الله عليه وسلم  قال ‏\"‏ من أتى فراشه وهو ينوي أن يقوم فيصلي من الليل فغلبته عينه حتى يصبح - كتب له ما نوى وكان نومه صدقة عليه من ربه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Darda’ conveyed that the Prophet (ﷺ) said:                     “Whoever goes to bed intending to wake up and pray during thenight,but is overwhelmed by sleep until morning comes, what heintended willbe recorded for him, and his sleep is a charity givento him by hisLord.”",
      "chain": [
        "30524",
        "20315",
        "20320",
        "11060",
        "11331",
        "10793",
        "11174"
      ]
    },
    {
      "hadith_no": "1721",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا عمرو بن عبد الله الأودي، ومحمد بن إسماعيل، قالا حدثنا أبو أسامة، حدثنا زائدة بن قدامة، حدثنا سماك بن حرب، عن عكرمة، عن ابن عباس، قال جاء أعرابي إلى النبي  صلى الله عليه وسلم  فقال أبصرت الهلال الليلة ‏.‏ فقال ‏\"‏ أتشهد أن لا إله إلا الله وأن محمدا رسول الله ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ قم يا بلال فأذن في الناس أن يصوموا غدا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “A Bedouin came to the Prophet(ﷺ) and said: ‘I have seen the new crescent tonight.’ He said:‘Doyou bear witness that none has the right to be worshipped butAllahand that Muhammad is the Messenger of Allah (ﷺ)?’ He said:‘Yes.’ Hesaid: ‘Get up, O Bilal, and announce to the peoplethat they shouldfast tomorrow.’”",
      "chain": [
        "34188",
        "20318",
        "20320",
        "10770",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1814",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الحسين بن علي، عن زائدة، عن عبد الملك بن عمير، عن محمد بن المنتشر، عن حميد بن عبد الرحمن الحميري، عن أبي هريرة، قال جاء رجل إلى النبي  صلى الله عليه وسلم  فقال أى الصيام أفضل بعد شهر رمضان قال ‏\"‏ شهر الله الذي تدعونه المحرم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “A man came to the Prophet(ﷺ)and said: ‘Which fasting is better after the month of Ramadan?’He said: ‘The month of Allah which is called Muharram.’”",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11368",
        "11388",
        "11280",
        "13"
      ]
    },
    {
      "hadith_no": "1924",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الحسين بن علي، عن زائدة، عن شبيب بن غرقدة البارقي، عن سليمان بن عمرو بن الأحوص، حدثني أبي أنه، شهد حجة الوداع مع رسول الله  صلى الله عليه وسلم  فحمد الله وأثنى عليه وذكر ووعظ ثم قال ‏\"‏ استوصوا بالنساء خيرا فإنما هن عندكم عوان ‏.‏ ليس تملكون منهن شيئا غير ذلك إلا أن يأتين بفاحشة مبينة فإن فعلن فاهجروهن في المضاجع واضربوهن ضربا غير مبرح فإن أطعنكم فلا تبغوا عليهن سبيلا إن لكم من نسائكم حقا ولنسائكم عليكم حقا فأما حقكم على نسائكم فلا يوطئن فرشكم من تكرهون ولا يأذن في بيوتكم لمن تكرهون ألا وحقهن عليكم أن تحسنوا إليهن في كسوتهن وطعامهن ‏\"‏ ‏.‏",
      "text_en": " It was narrated that:                     Sulaiman bin Amr bin Ahwas said: “My father told me that he was present on the Farewell pilgrimage with the Messenger of Allah. He praised and glorified Allah, and reminder and exhorted (the people). The he said: 'I enjoin good treatment of women, for they are prisoners with you, and you have no right to treat them otherwise, unless they commit clear indecency. If they do that, then forsake them in their beds and hit them, but without causing injury or leaving a mark if they obey you, then do not seek means of annoyance against them. You have rights over your women and you women have rights over you. Your rights over you women are that they are not to allow anyone whom you dislike on treat on your bedding (furniture), not allow anyone whom you dislike to enter your houses. And their right over you are that should treat them kindly with regard to their clothing and food.' ”",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11430",
        "19868"
      ]
    },
    {
      "hadith_no": "2839",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Shares of Inheritance - كتاب الفرائض",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن محمد بن عبد الرحمن بن أبي ليلى، عن الحكم، عن عبد الله بن شداد، عن بنت حمزة، - قال محمد يعني ابن أبي ليلى وهي أخت ابن شداد لأمه - قالت مات مولاى وترك ابنة فقسم رسول الله صلى الله عليه وسلم ماله بيني وبين ابنته فجعل لي النصف ولها النصف ‏.‏",
      "text_en": " It wasnarrated that the daughter of Hamzah said:                      “My freed slavedied,leaving behind a daughter. The Messenger of Allah (ﷺ) dividedhiswealth between myself and his daughter, giving me half and herhalf.”",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11069",
        "169"
      ]
    },
    {
      "hadith_no": "3257",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا أبو كريب، حدثنا المحاربي، وعبد الرحيم، عن سفيان الثوري، عن سعيد بن مسروق، وحدثنا الحسين بن علي، عن زائدة، عن سعيد بن مسروق، عن عباية بن رفاعة، عن رافع بن خديج، قال كنا مع رسول الله  صلى الله عليه وسلم  ونحن بذي الحليفة من تهامة فأصبنا إبلا وغنما فعجل القوم فأغلينا القدور قبل أن تقسم فأتانا رسول الله  صلى الله عليه وسلم  فأمر بها فأكفئت ثم عدل الجزور بعشرة من الغنم ‏.‏",
      "text_en": " It wasnarrated that Rafi’ bin Khadij said:                      “We were with theMessengerof Allah (ﷺ) in Dhul-Hulaifah in (the land of) Tihamah. Weacquiredsheep and camels and the people hastened to put cooking potson thefires before they had been distributed. The Messenger of Allah(ﷺ)came to us and ordered that they be overturned,* then he madeonecamel equivalent to ten sheep.”",
      "chain": [
        "30216",
        "20333",
        "20334",
        "20012",
        "20016",
        "20315",
        "20320",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "3469",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا معاوية بن عمرو، حدثنا زائدة، عن منصور، عن إبراهيم، عن الأسود، عن عائشة، قالت ما شبع آل محمد  صلى الله عليه وسلم  منذ قدموا المدينة ثلاث ليال تباعا من خبز بر حتى توفي  صلى الله عليه وسلم  ‏.‏",
      "text_en": " it wasnarrated that ‘Aishah said:                      “The family of Muhammad (ﷺ)neverate their fill of wheat bread for three nights in a row, fromthetime they came to Al-Madinah until he passed away.”",
      "chain": [
        "11222",
        "20389",
        "20320",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "3756",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا أبو أسامة، عن زائدة، عن سماك، عن عكرمة، عن ابن عباس، أن النبي  صلى الله عليه وسلم  كان يقول ‏\"‏ إن من الشعر حكما ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Abbas that the Prophet(ﷺ) said:                     \"In some poetry there is wisdom.\"",
      "chain": [
        "20436",
        "20318",
        "20320",
        "10770",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4230",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا الحسين بن علي، عن زائدة، عن عبد الملك بن عمير، عن جابر بن سمرة، عن نافع بن عتبة بن أبي وقاص، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ ستقاتلون جزيرة العرب فيفتحها الله ثم تقاتلون الروم فيفتحها الله ثم تقاتلون الدجال فيفتحها الله ‏\"‏ ‏.‏ قال جابر فما يخرج الدجال حتى تفتح الروم ‏.‏",
      "text_en": " It was narrated from Jabir bin Samurah, that Nafi' bin 'Utbah bin AbuWaqqas narrated that the Prophet (ﷺ) said:                      \"You will fight theArabian Peninsula and victory will be granted by Allah. Then you willfight the Romans and victory will be granted (by Allah). Then youwill fight Dajjal and victory will be granted (by Allah).\"Jabir said: \"Dajjal will not appear until you have fought the Romans.\"",
      "chain": [
        "30201",
        "20315",
        "20320",
        "11368",
        "393"
      ]
    }
  ],
  "total_hadiths": 158
}