{
  "id": "20331",
  "name": "'Abdullah bin Numayr عبد الله بن نمير",
  "full_name": "'Abdullah bin Numayr عبد الله بن نمير",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "115",
      "date_gregorian": "NA",
      "date_display": [
        "115 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "199",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hamadan",
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Hamdani",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "30212",
      "name": "Muhammad bin 'Abdullah bin Numayr محمد بن عبد الله بن نمير",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "teachers": [
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "28270",
      "name": "'Aabad bin Musa al-Jhny عباد بن موسى الجهني",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11338",
      "name": "Zakaria bin Abi Za'idah زكريا بن أبي زائدة خالد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11853",
      "name": "Sa'd bin Sa'id bin Qays bin 'Amr سعد بن سعيد بن قيس بن عمرو الأنصاري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11243",
      "name": "Hanzala bin Abi Sufyan bin 'Abdur Rahman حنظلة بن أبي سفيان بن عبد الرحمن",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11558",
      "name": "Syf bin Sulaiman سيف بن سليمان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11645",
      "name": "'Amr bin 'Uthman bin 'Abdullah bin Muhab عمرو بن عثمان بن عبد الله بن موهب",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10820",
      "name": "Mujalid bin Sa'id bin 'Umayr مجالد بن سعيد الهمداني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20335",
      "name": "'Abdul 'Aziz bin Syah al-'Asady عبد العزيز بن سياه",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20358",
      "name": "Malik bin Mghwl مالك بن مغول",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20349",
      "name": "Fadayl bin Ghazwan bin Jarir فضيل بن غزوان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30212",
      "name": "Muhammad bin 'Abdullah bin Numayr محمد بن عبد الله بن نمير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30359",
      "name": "'Ubaidullah bin Sa'id عبيد الله بن سعيد أبو قدامة السرخسي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30216",
      "name": "Abu Karayb, Muhammad bin al-'Ala' محمد بن العلاء - أبو كريب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30200",
      "name": "'Abdullah bin Sa'id al-Ashaj عبد الله بن سعيد بن حصين الكندي - الأشج",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30480",
      "name": "Hanad bin al-Sari bin Mus'ab هناد بن السري بن مصعب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38044",
      "name": "Ahmed bin al-Frat bin Khalid أحمد بن الفرات بن خالد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38388",
      "name": "'Ali bin Harb bin Muhammad علي بن حرب بن محمد بن علي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "35029",
      "name": "al-Hasan bin 'Ali bin 'Affan الحسن بن علي بن عفان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30399",
      "name": "Yahya bin Yahya bin Bukayr يحيى بن يحيى بن بكير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30203",
      "name": "'Uthman bin Muhammad عثمان بن محمد بن إبراهيم / بن أبي شيبة",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "336",
      "source": " Sahih Bukhari ",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا زكرياء بن يحيى، قال حدثنا عبد الله بن نمير، قال حدثنا هشام بن عروة، عن أبيه، عن عائشة، أنها استعارت من أسماء قلادة فهلكت، فبعث رسول الله صلى الله عليه وسلم رجلا، فوجدها فأدركتهم الصلاة وليس معهم ماء فصلوا، فشكوا ذلك إلى رسول الله صلى الله عليه وسلم فأنزل الله آية التيمم‏.‏ فقال أسيد بن حضير لعائشة جزاك الله خيرا، فوالله ما نزل بك أمر تكرهينه إلا جعل الله ذلك لك وللمسلمين فيه خيرا‏.‏",
      "text_en": " Narrated `Urwa's father:                     Aisha said, \"I borrowed a necklace from Asma' and it was lost. So Allah's Apostle sent a man to search for it and he found it. Then the time of the prayer became due and there was no water. They prayed (without ablution) and informed Allah's Apostle about it, so the verse of Tayammum was revealed.\" Usaid bin Hudair said to `Aisha, \"May Allah reward you. By Allah, whenever anything happened which you did not like, Allah brought good for you and for the Muslims in that.\" Al-Jurf and the time for the `Asr prayer became due while he was at Marbad-An-Na`am (sheepfold), so he (performed Tayammum) and prayed there and then entered Medina when the sun was still high but he did not repeat that prayer.",
      "chain": [
        "30193",
        "20331",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "463",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا زكرياء بن يحيى، قال حدثنا عبد الله بن نمير، قال حدثنا هشام، عن أبيه، عن عائشة، قالت أصيب سعد يوم الخندق في الأكحل، فضرب النبي صلى الله عليه وسلم خيمة في المسجد ليعوده من قريب، فلم يرعهم  وفي المسجد خيمة من بني غفار  إلا الدم يسيل إليهم فقالوا يا أهل الخيمة، ما هذا الذي يأتينا من قبلكم فإذا سعد يغذو جرحه دما، فمات فيها‏.‏",
      "text_en": " Narrated `Aisha:                     On the day of Al-Khandaq (battle of the Trench' the medial arm vein of Sa`d bin Mu`ad [??] was injured and the Prophet pitched a tent in the mosque to look after him. There was another tent for Banu Ghaffar in the mosque and the blood started flowing from Sa`d's tent to the tent of Bani Ghaffar. They shouted, \"O occupants of the tent! What is coming from you to us?\" They found that Sa`d' wound was bleeding profusely and Sa`d died in his tent.",
      "chain": [
        "30193",
        "20331",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "494",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إسحاق، قال حدثنا عبد الله بن نمير، قال حدثنا عبيد الله، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم كان إذا خرج يوم العيد أمر بالحربة فتوضع بين يديه، فيصلي إليها والناس وراءه، وكان يفعل ذلك في السفر، فمن ثم اتخذها الأمراء‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Whenever Allah's Apostle came out on `Id day, he used to order that a Harba [??] (a short spear) to be planted in front of him (as a Sutra for his prayer) and then he used to pray facing it with the people behind him and used to do the same while on a journey. After the Prophet , this practice was adopted by the Muslim rulers (who followed his traditions).",
      "chain": [
        "30313",
        "20331",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1421",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا ابن نمير، قال حدثني أبي، حدثنا إسماعيل، عن قيس، قال قال جرير بن عبد الله بايعت النبي صلى الله عليه وسلم على إقام الصلاة، وإيتاء الزكاة، والنصح لكل مسلم‏.‏",
      "text_en": " Narrated Jarir bin `Abdullah:                     I gave the pledge of allegiance to the Prophet for offering prayer perfectly, giving Zakat, and giving good advice to every Muslim.",
      "chain": [
        "30212",
        "20331",
        "20208",
        "11046"
      ]
    },
    {
      "hadith_no": "1556",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثني علي بن مسلم، حدثنا عبد الله بن نمير، حدثنا عبيد الله، عن نافع، عن ابن عمر  رضى الله عنهما  قال لما فتح هذان المصران أتوا عمر فقالوا يا أمير المؤمنين، إن رسول الله صلى الله عليه وسلم حد لأهل نجد قرنا، وهو جور عن طريقنا، وإنا إن أردنا قرنا شق علينا‏.‏ قال فانظروا حذوها من طريقكم‏.‏ فحد لهم ذات عرق‏.‏",
      "text_en": " Narrated Ibn `Umar:                     When these two towns (Basra and Kufa) were captured, the people went to `Umar and said, \"O the Chief of the faithful believers! The Prophet fixed Qarn as the Miqat for the people of Najd, it is beyond our way and it is difficult for us to pass through it.\" He said, \"Take as your Miqat a place situated opposite to Qarn on your usual way. So, he fixed Dhatu-Irq (as their Miqat).\"",
      "chain": [
        "30261",
        "20331",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1772",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا عبيد الله، قال حدثني نافع، عن ابن عمر  رضى الله عنهما  أن العباس  رضى الله عنه  استأذن النبي صلى الله عليه وسلم ليبيت بمكة ليالي منى، من أجل سقايته، فأذن له‏.‏ تابعه أبو أسامة وعقبة بن خالد وأبو ضمرة‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Al-Abbas asked the permission from the Prophet to stay at Mecca during the nights of Mina in order to provide water to the people, so the Prophet allowed him.",
      "chain": [
        "30212",
        "20331",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2591",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا عبيد الله بن سعيد، حدثنا عبد الله بن نمير، حدثنا هشام بن عروة، عن فاطمة، عن أسماء، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أنفقي ولا تحصي فيحصي الله عليك، ولا توعي فيوعي الله عليك ‏\"‏‏.‏",
      "text_en": " Narrated Asma:                     Allah's Apostle said, \"Give (in charity) and do not give reluctantly lest Allah should give you in a limited amount; and do not withhold your money lest Allah should withhold it from you.\"",
      "chain": [
        "30359",
        "20331",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "4172",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا زكرياء بن يحيى، حدثنا عبد الله بن نمير، حدثنا هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت أصيب سعد يوم الخندق، رماه رجل من قريش يقال له حبان ابن العرقة، رماه في الأكحل، فضرب النبي صلى الله عليه وسلم خيمة في المسجد ليعوده من قريب، فلما رجع رسول الله صلى الله عليه وسلم من الخندق وضع السلاح واغتسل، فأتاه جبريل  عليه السلام  وهو ينفض رأسه من الغبار فقال قد وضعت السلاح والله ما وضعته، اخرج إليهم‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ فأين ‏\"‏‏.‏ فأشار إلى بني قريظة، فأتاهم رسول الله صلى الله عليه وسلم فنزلوا على حكمه، فرد الحكم إلى سعد، قال فإني أحكم فيهم أن تقتل المقاتلة، وأن تسبى النساء والذرية، وأن تقسم أموالهم‏.‏ قال هشام فأخبرني أبي عن عائشة أن سعدا قال اللهم إنك تعلم أنه ليس أحد أحب إلى أن أجاهدهم فيك من قوم كذبوا رسولك صلى الله عليه وسلم وأخرجوه، اللهم فإني أظن أنك قد وضعت الحرب بيننا وبينهم، فإن كان بقي من حرب قريش شىء، فأبقني له حتى أجاهدهم فيك، وإن كنت وضعت الحرب فافجرها، واجعل موتتي فيها‏.‏ فانفجرت من لبته، فلم يرعهم وفي المسجد خيمة من بني غفار إلا الدم يسيل إليهم فقالوا يا أهل الخيمة ما هذا الذي يأتينا من قبلكم فإذا سعد يغذو جرحه دما، فمات منها رضى الله عنه‏.‏",
      "text_en": " Narrated `Aisha:                     Sa`d was wounded on the day of Khandaq (i.e. Trench) when a man from Quraish, called Hibban bin Al-`Araqa hit him (with an arrow). The man was Hibban bin Qais from (the tribe of) Bani Mais bin 'Amir bin Lu'ai who shot an arrow at Sa`d's medial arm vein (or main artery of the arm). The Prophet pitched a tent (for Sa`d) in the Mosque so that he might be near to the Prophet to visit. When the Prophet returned from the (battle) of Al-Khandaq (i.e. Trench) and laid down his arms and took a bath Gabriel came to him while he (i.e. Gabriel) was shaking the dust off his head, and said, \"You have laid down the arms?\" By Allah, I have not laid them down. Go out to them (to attack them).\" The Prophet said, \"Where?\" Gabriel pointed towards Bani Quraiza. So Allah's Apostle went to them (i.e. Banu Quraiza) (i.e. besieged them). They then surrendered to the Prophet's judgment but he directed them to Sa`d to give his verdict concerning them. Sa`d said, \"I give my judgment that their warriors should be killed, their women and children should be taken as captives, and their properties distributed.\" Narrated Hisham: My father informed me that `Aisha said, \"Sa`d said, \"O Allah! You know that there is nothing more beloved to me than to fight in Your Cause against those who disbelieved Your Apostle and turned him out (of Mecca). O Allah! I think you have put to an end the fight between us and them (i.e. Quraish infidels). And if there still remains any fight with the Quraish (infidels), then keep me alive till I fight against them for Your Sake. But if you have brought the war to an end, then let this wound burst and cause my death thereby.' So blood gushed from the wound. There was a tent in the Mosque belonging to Banu Ghifar who were surprised by the blood flowing towards them . They said, 'O people of the tent! What is this thing which is coming to us from your side?' Behold! Blood was flowing profusely out of Sa`d's wound. Sa`d then died because of that.\"",
      "chain": [
        "30193",
        "20331",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4618",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إسحاق، أخبرنا عبد الله بن نمير، حدثنا هشام، عن أبيه، عن عائشة  رضى الله عنها  في قوله تعالى ‏{‏ومن كان غنيا فليستعفف ومن كان فقيرا فليأكل بالمعروف‏}‏ أنها نزلت في مال اليتيم إذا كان فقيرا، أنه يأكل منه مكان قيامه عليه، بمعروف‏.‏",
      "text_en": " Narrated Aisha:                     regarding the Statement of Allah: \"And whoever amongst the guardian is rich, he should take no wages, but if he is poor, let him have for himself what is just and reasonable (according to his work). This Verse was revealed regarding the orphan's property. If the guardian is poor, he can take from the property of the orphan, what is just and reasonable according to his work and the time he spends on managing it.",
      "chain": [
        "30312",
        "20331",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5934",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني محمد بن سلام، أخبرنا عبد الله بن نمير، عن عبيد الله، عن نافع، عن ابن عمر  رضى الله عنهما  قال اتخذ رسول الله صلى الله عليه وسلم خاتما من ورق، وكان في يده، ثم كان بعد في يد أبي بكر، ثم كان بعد في يد عمر، ثم كان بعد في يد عثمان، حتى وقع بعد في بئر أريس، نقشه محمد رسول الله‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle had a silver ring made for himself and it was worn by him on his hand. Afterwards it was worn by Abu Bakr, and then by `Umar, and then by `Uthman till it fell in the Aris well. (On that ring) was engraved: 'Muhammad, the Apostle of Allah.\"",
      "chain": [
        "30376",
        "20331",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "6324",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا عبد الله بن نمير، حدثنا عبيد الله، عن سعيد بن أبي سعيد المقبري، عن أبي هريرة  رضى الله عنه أن رجلا، دخل المسجد ورسول الله صلى الله عليه وسلم جالس في ناحية المسجد فصلى، ثم جاء فسلم عليه فقال له رسول الله صلى الله عليه وسلم ‏\"‏ وعليك السلام ارجع فصل فإنك لم تصل ‏\"‏‏.‏ فرجع فصلى، ثم جاء فسلم‏.‏ فقال ‏\"‏ وعليك السلام فارجع فصل، فإنك لم تصل ‏\"‏‏.‏ فقال في الثانية أو في التي بعدها علمني يا رسول الله‏.‏ فقال ‏\"‏ إذا قمت إلى الصلاة فأسبغ الوضوء، ثم استقبل القبلة فكبر، ثم اقرأ بما تيسر معك من القرآن، ثم اركع حتى تطمئن راكعا، ثم ارفع حتى تستوي قائما، ثم اسجد حتى تطمئن ساجدا، ثم ارفع حتى تطمئن جالسا، ثم اسجد حتى تطمئن ساجدا، ثم ارفع حتى تطمئن جالسا، ثم افعل ذلك في صلاتك كلها ‏\"‏‏.‏ وقال أبو أسامة في الأخير ‏\"‏ حتى تستوي قائما ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     A man entered the mosque while Allah's Apostle was sitting in one side of the mosque. The man prayed, came, and greeted the Prophet. Allah's Apostle said to him, \"Wa 'Alaikas Salam (returned his greeting). Go back and pray as you have not prayed (properly).\" The man returned, repeated his prayer, came back and greeted the Prophet. The Prophet said, \"Wa alaika-s-Salam (returned his greeting). Go back and pray again as you have not prayed (properly).\" The man said at the second or third time, \"O Allah's Apostle! Kindly teach me how to pray\". The Prophet said, \"When you stand for prayer, perform ablution properly and then face the Qibla and say Takbir (Allahu-Akbar), and then recite what you know from the Qur'an, and then bow with calmness till you feel at ease then rise from bowing, till you stand straight, and then prostrate calmly (and remain in prostration) till you feel at ease, and then raise (your head) and sit with calmness till you feel at ease and then prostrate with calmness (and remain in prostration) till you feel at ease, and then raise (your head) and sit with calmness till you feel at ease in the sitting position, and do likewise in whole of your prayer.\" And Abu Usama added, \"Till you stand straight.\" (See Hadith No. 759, Vol.1)",
      "chain": [
        "30313",
        "20331",
        "11201",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "5",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا سعيد بن عبيد، حدثنا علي بن ربيعة، قال أتيت المسجد والمغيرة أمير الكوفة قال فقال المغيرة سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن كذبا على ليس ككذب على أحد فمن كذب على متعمدا فليتبوأ مقعده من النار ‏\"‏ ‏.‏",
      "text_en": "",
      "chain": [
        "30212",
        "20331",
        "11629",
        "11376"
      ]
    },
    {
      "hadith_no": "113",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا عمرو بن عثمان، حدثنا موسى بن طلحة، قال حدثني أبو أيوب، أن أعرابيا، عرض لرسول الله صلى الله عليه وسلم وهو في سفر ‏.‏ فأخذ بخطام ناقته أو بزمامها ثم قال يا رسول الله - أو يا محمد - أخبرني بما يقربني من الجنة وما يباعدني من النار ‏.‏ قال فكف النبي صلى الله عليه وسلم ثم نظر في أصحابه ثم قال ‏\"‏ لقد وفق - أو لقد هدي - قال كيف قلت ‏\"‏ ‏.‏ قال فأعاد ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ تعبد الله لا تشرك به شيئا وتقيم الصلاة وتؤتي الزكاة وتصل الرحم دع الناقة ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Ayyub Ansari that once during the journey of the Holy Prophet (may peace of Allah be upon him) a bedouin appeared before him and caught hold of the nosestring of his she-camel and then said, Messenger of Allah (or Muhammad), inform me about that which takes me near to Paradise and draws me away from the Fire (of Hell). He (the narrator) said:                      The Prophet (may peace be upon him) stopped for a while and cast a glance upon his companions and then said: He was afforded a good opportunity (or he had been guided well). He (the Holy Prophet) addressing the bedouin said: (Repeat) whatever you have uttered. He (the bedouin) repeated that. Upon this the Apostle (may peace be upon him) remarked: The deed which can draw you near to Paradise and take you away from Hell is, that you worship Allah and associate none with Him, and you establish prayer and pay Zakat, and do good to your kin. After having uttered these words, the Holy Prophet asked the bedouin to release the nosestring of his she-camel.",
      "chain": [
        "30212",
        "20331",
        "10581",
        "579",
        "33"
      ]
    },
    {
      "hadith_no": "123",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني ابن نمير، حدثنا أبي، حدثنا حنظلة، قال سمعت عكرمة بن خالد، يحدث طاوسا أن رجلا، قال لعبد الله بن عمر ألا تغزو فقال إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الإسلام بني على خمس شهادة أن لا إله إلا الله وإقام الصلاة وإيتاء الزكاة وصيام رمضان وحج البيت ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Ta'us that a man said to 'Abdullah son of 'Umar (may Allah be pleased with him). Why don't you carry out a military expedition? Upon which he replied:                      I heard the messenger of Allah (may peace be upon him) say: Verily, al-Islam is founded on five (pillars): testifying the fact that there is no god but Allah, establishment of prayer, payment of Zakat, fast of Ramadan and Pilgrimage to the House.",
      "chain": [
        "30212",
        "20331",
        "11243",
        "11709",
        "11053"
      ]
    },
    {
      "hadith_no": "190",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، ح وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا أبو كريب، حدثنا ابن إدريس، كلهم عن إسماعيل بن أبي خالد، ح وحدثنا يحيى بن حبيب الحارثي، - واللفظ له - حدثنا معتمر، عن إسماعيل، قال سمعت قيسا، يروي عن أبي مسعود، قال أشار النبي صلى الله عليه وسلم بيده نحو اليمن فقال ‏\"‏ ألا إن الإيمان ها هنا وإن القسوة وغلظ القلوب في الفدادين عند أصول أذناب الإبل حيث يطلع قرنا الشيطان في ربيعة ومضر ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Ibn Mas'ud that the Apostle of Allah (may peace and blessings be upon him) pointed towards Yemen with his hand and said:                      Verily Iman is towards this side, and harshness and callousness of the hearts is found amongst the rude owners of the camels who drive them behind their tails (to the direction) where emerge the two horns of Satan, they are the tribes of Rabi'a and Mudar.",
      "chain": [
        "30201",
        "20318",
        "30212",
        "20331",
        "30216",
        "11418",
        "20288",
        "11418",
        "402"
      ]
    },
    {
      "hadith_no": "208",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، وأبو أسامة عن إسماعيل بن أبي خالد، عن قيس، عن جرير، قال بايعت رسول الله صلى الله عليه وسلم على إقام الصلاة وإيتاء الزكاة والنصح لكل مسلم ‏.‏",
      "text_en": " It is narrated on the authority of Jarir that he observed I gave pledge of allegiance to the Messenger of Allah (may peace and blessings be upon him) on the observance of prayer, payment of Zakat, and sincerity and well-wishing for every Muslim.",
      "chain": [
        "30201",
        "20331",
        "20318",
        "11418",
        "11046",
        "4057"
      ]
    },
    {
      "hadith_no": "219",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، ح وحدثنا ابن نمير، حدثنا أبي، حدثنا الأعمش، ح وحدثني زهير بن حرب، حدثنا وكيع، حدثنا سفيان، عن الأعمش، عن عبد الله بن مرة، عن مسروق، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أربع من كن فيه كان منافقا خالصا ومن كانت فيه خلة منهن كانت فيه خلة من نفاق حتى يدعها إذا حدث كذب وإذا عاهد غدر وإذا وعد أخلف وإذا خاصم فجر ‏\"‏ ‏.‏ غير أن في حديث سفيان ‏\"‏ وإن كانت فيه خصلة منهن كانت فيه خصلة من النفاق ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abdullah b. 'Amr that the Prophet observed:                      Four characteristics made anyone who possessed them, a sheer hypocrite; anyone who possessed one of them possessed a characteristic of hypocrisy till be abandons it: when he talked he lied, when he made a covenant he acted treacherously, and when he quarreled he deviated from the truth.",
      "chain": [
        "30201",
        "20331",
        "30212",
        "20331",
        "11060",
        "30022",
        "20032",
        "20012",
        "11060",
        "11362",
        "11018",
        "29"
      ]
    },
    {
      "hadith_no": "224",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، وعبد الله بن نمير، قالا حدثنا عبيد الله بن عمر، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا كفر الرجل أخاه فقد باء بها أحدهما ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Ibn 'Umar that the Apostle (may peace and blessings be upon him) observed:                      When a man calls his brother an unbeliever, it returns (at least) to one of them.",
      "chain": [
        "30201",
        "20352",
        "20331",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "341",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، عن هشام بن عروة، عن أبيه، أن حكيم بن حزام، أعتق في الجاهلية مائة رقبة وحمل على مائة بعير ثم أعتق في الإسلام مائة رقبة وحمل على مائة بعير ثم أتى النبي صلى الله عليه وسلم فذكر نحو حديثهم ‏.‏",
      "text_en": " Hisham b. Urwa narrated it on the authority of his father:                      Hakim b. Hizam freed one hundred slave and donated one hundred camels (for the sake of Allah) during the state of ignorance. Then he freed one hundred slaves and donated one hundred camel (for the sake of Allah) after) he had embraced Islam. He subsequently came to the Apostle (may peace be upon him). The rest of the hadith is the same as narrated above.",
      "chain": [
        "30201",
        "20331",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "391",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، وأبو أسامة عن عبيد الله بن عمر، ح وحدثنا ابن نمير، حدثنا أبي، حدثنا عبيد الله، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الإيمان ليأرز إلى المدينة كما تأرز الحية إلى جحرها ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      Verily the faith would recede to Medina just as the serpent crawls back into its hole.",
      "chain": [
        "30201",
        "20331",
        "20318",
        "11201",
        "30212",
        "20331",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "hadith_no": "445",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن نمير، حدثنا أبي، حدثنا حنظلة، عن سالم، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ رأيت عند الكعبة رجلا آدم سبط الرأس واضعا يديه على رجلين ‏.‏ يسكب رأسه - أو يقطر رأسه - فسألت من هذا فقالوا عيسى ابن مريم أو المسيح ابن مريم - لا ندري أى ذلك قال - ورأيت وراءه رجلا أحمر جعد الرأس أعور العين اليمنى أشبه من رأيت به ابن قطن فسألت من هذا فقالوا المسيح الدجال ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Ibn 'Umar that the Messenger of Allah (may peace be upon him) said:                      I saw near the Ka'bah a man of fair complexion with straight hair, placing his hands on two persons. Water was flowing from his head or it was trickling from his head. I asked: Who is he? They said: He is Jesus son of Mary or al-Masih son of Mary. The narrator) says: I do not remember which word it was. He (the Holy Prophet) said: And I saw behind him a man with red complexion and thick curly hair, blind in the right eye. I saw in him the greatest resemblance with Ibn Qitan I asked: Who is he? They replied: It is al-Masih al-Dajjal.",
      "chain": [
        "30212",
        "20331",
        "11243",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "449",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، حدثنا مالك بن مغول، ح وحدثنا ابن نمير، وزهير بن حرب، جميعا عن عبد الله بن نمير، - وألفاظهم متقاربة - قال ابن نمير حدثنا أبي، حدثنا مالك بن مغول، عن الزبير بن عدي، عن طلحة، عن مرة، عن عبد الله، قال لما أسري برسول الله صلى الله عليه وسلم انتهي به إلى سدرة المنتهى وهي في السماء السادسة إليها ينتهي ما يعرج به من الأرض فيقبض منها وإليها ينتهي ما يهبط به من فوقها فيقبض منها قال ‏{‏ إذ يغشى السدرة ما يغشى‏}‏ قال فراش من ذهب ‏.‏ قال فأعطي رسول الله صلى الله عليه وسلم ثلاثا أعطي الصلوات الخمس وأعطي خواتيم سورة البقرة وغفر لمن لم يشرك بالله من أمته شيئا المقحمات ‏.‏",
      "text_en": " It is narrated on the authority of Abdullah (b. Umar) that when the Messenger of Allah (may peace be upon him) was taken for the Night journey, he was taken to Sidrat-ul-Muntaha, which is situated on the sixth heaven, where terminates everything that ascends from the earth and is held there, and where terminates every- thing that descends from above it and is held there. (It is with reference to this that) Allah said:                     \" When that which covers covered the lote-tree\" (al-Qur'an, Iiii. 16). He (the narrator) said: (It was) gold moths. He (the narrator further) said: The Messenger of Allah (may peace be upon him) was given three (things): he was given five prayers, be was given the concluding verses of Sura al-Baqara, and remission of serious Sins for those among his Ummah who associate not anything with Allah",
      "chain": [
        "30201",
        "20318",
        "20358",
        "30212",
        "30022",
        "30212",
        "20331",
        "20358",
        "11336",
        "11356",
        "16"
      ]
    },
    {
      "hadith_no": "459",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن نمير، حدثنا أبي، حدثنا إسماعيل، عن الشعبي، عن مسروق، قال سألت عائشة هل رأى محمد صلى الله عليه وسلم ربه فقالت سبحان الله لقد قف شعري لما قلت ‏.‏ وساق الحديث بقصته ‏.‏ وحديث داود أتم وأطول ‏.‏",
      "text_en": " Masruq reported:                      I asked 'A'isha if Muhammad (may peace be upon him) had seen his Lord. She replied: Hallowed be Allah, my hair stood on end when you said this, and he (Masruq) narrated the hadith as narrated above. The hadith reported by Diwud is more complete and longer.",
      "chain": [
        "30212",
        "20331",
        "20208",
        "11052",
        "11018"
      ]
    },
    {
      "hadith_no": "487",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا الأعمش، عن المعرور بن سويد، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إني لأعلم آخر أهل الجنة دخولا الجنة وآخر أهل النار خروجا منها رجل يؤتى به يوم القيامة فيقال اعرضوا عليه صغار ذنوبه وارفعوا عنه كبارها ‏.‏ فتعرض عليه صغار ذنوبه فيقال عملت يوم كذا وكذا كذا وكذا وعملت يوم كذا وكذا كذا وكذا ‏.‏ فيقول نعم ‏.‏ لا يستطيع أن ينكر وهو مشفق من كبار ذنوبه أن تعرض عليه ‏.‏ فيقال له فإن لك مكان كل سيئة حسنة ‏.‏ فيقول رب قد عملت أشياء لا أراها ها هنا ‏\"‏ ‏.‏ فلقد رأيت رسول الله صلى الله عليه وسلم ضحك حتى بدت نواجذه ‏.‏",
      "text_en": " Abu Dharr reported that Allah's Messenger (may peace be upon him) said:                      I know the last of the inhabitants of Paradise to enter it and the last of the inhabitants of Hell to come out of it. He is a man who would be brought on the Day of Resurrection and it will be said: Present his minor sins to him, and withhold from him his serious Sins. Then the minor sins would be placed before him, and it would be said: On such and such a day you did so and so and on such and such a day you did so and so. He would say: Yes. It will not be possible for him to deny, while he would be afraid lest serious sins chould be presented before him. It would be said to him: In place of every evil deed you will have good deed He will say: My Lord! I have done things I do not see here. I indeed saw the Messenger of Allah laugh till his front teeth were exposed.",
      "chain": [
        "30212",
        "20331",
        "11060",
        "11397",
        "23"
      ]
    },
    {
      "hadith_no": "553",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا مالك، - وهو ابن مغول - عن أبي إسحاق، عن عمرو بن ميمون، عن عبد الله، قال خطبنا رسول الله صلى الله عليه وسلم فأسند ظهره إلى قبة أدم فقال ‏\"‏ ألا لا يدخل الجنة إلا نفس مسلمة اللهم هل بلغت اللهم اشهد ‏.‏ أتحبون أنكم ربع أهل الجنة ‏\"‏ ‏.‏ فقلنا نعم يا رسول الله ‏.‏ فقال ‏\"‏ أتحبون أن تكونوا ثلث أهل الجنة ‏\"‏ ‏.‏ قالوا نعم يا رسول الله ‏.‏ قال ‏\"‏ إني لأرجو أن تكونوا شطر أهل الجنة ما أنتم في سواكم من الأمم إلا كالشعرة السوداء في الثور الأبيض أو كالشعرة البيضاء في الثور الأسود ‏\"‏ ‏.‏",
      "text_en": " Abdullah b Mas'ud reported:                      The Messenger of Allah (may peace be upon him) addressed us and then supported his back (by reclining) against a leather tent and said: Behold, no one but a believing person would enter Paradise. O Allah, (see) have I conveyed (it not)? 0 Allah, be witness (to it that I have conveyed it). (Then addressing the companions) he said: Don't you like that you should constitute one-fourth of the inhabitants of Paradise? We said: Yes, Messenger of Allah. He again said: Don't you like that you should constitute one-third of the inhabitants of Paradise? They said: Yes, Messenger of Allah. He said: I hope that you would constitute one- half of the inhabitants of Paradise and you would be among the peoples of the world, like a black hair on (the body of) a white ox or like a white hair on the body of a black ox.",
      "chain": [
        "30212",
        "20331",
        "20358",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "hadith_no": "274",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا زكرياء، عن عامر، قال أخبرني عروة بن المغيرة، عن أبيه، قال كنت مع النبي صلى الله عليه وسلم ذات ليلة في مسير فقال لي ‏\"‏ أمعك ماء ‏\"‏ ‏.‏ قلت نعم ‏.‏ فنزل عن راحلته فمشى حتى توارى في سواد الليل ثم جاء فأفرغت عليه من الإداوة فغسل وجهه وعليه جبة من صوف فلم يستطع أن يخرج ذراعيه منها حتى أخرجهما من أسفل الجبة فغسل ذراعيه ومسح برأسه ثم أهويت لأنزع خفيه فقال ‏\"‏ دعهما فإني أدخلتهما طاهرتين ‏\"‏ ‏.‏ ومسح عليهما ‏.‏",
      "text_en": " 'Urwa b. Mughira reported his father having said:                      I was one night with the Apostle of Allah (may peace be upon him) on a journey. He said to me: Have you any water with you? I said: Yes. He (the Holy Prophet) came down from his ride and went on till he disappeared in the darkness of night. He then came back and I poured water for him from the jar. He washed his face, He had a woollen gown on him and he could not bring out his forearms from it (i. e. from its sleeves) and consequently he brought them out from under his gown. He washed his forearms, wiped over his head. I then bent down to take off his socks. But he said: Leave them, for my feet were clean when I put them in, and he only wiped over them.",
      "chain": [
        "30212",
        "20331",
        "11338",
        "11052",
        "11373",
        "166"
      ]
    },
    {
      "hadith_no": "277",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا سفيان، عن علقمة بن مرثد، ح وحدثني محمد بن حاتم، - واللفظ له - حدثنا يحيى بن سعيد، عن سفيان، قال حدثني علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، أن النبي صلى الله عليه وسلم صلى الصلوات يوم الفتح بوضوء واحد ومسح على خفيه فقال له عمر لقد صنعت اليوم شيئا لم تكن تصنعه ‏.‏ قال ‏\"‏ عمدا صنعته يا عمر ‏\"‏ ‏.‏",
      "text_en": " Sulaiman b. Buraida narrated it from his father that the Apostle of Allah (may peace be upon him) offered prayers with one ablution on the day of the Conquest (of Mecca) and wiped over the socks. 'Umar said to him:                      You have today done something that you have not been accustomed to before. He (the Holy Prophet) said: 0 'Umar, I have done that on purpose.",
      "chain": [
        "30212",
        "20331",
        "20012",
        "11374",
        "38487",
        "20031",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "286",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا عبد الله بن نمير، حدثنا هشام، عن أبيه، عن عائشة، زوج النبي صلى الله عليه وسلم أن رسول الله صلى الله عليه وسلم كان يؤتى بالصبيان فيبرك عليهم ويحنكهم فأتي بصبي فبال عليه فدعا بماء فأتبعه بوله ولم يغسله ‏.‏",
      "text_en": " A'isha, the wife of the Apostle (may peace be upon him) said:                      Babies were brought to the Messenger of Allah (may peace be upon him) and he blessed them, and after having chewed (something, e. g. dates or any other sweet thing) he rubbed there with their soft palates. A baby was brought to him and he passed water over him (over his garment), so he asked water to be brought and sprinkled it, but he did not wash it.",
      "chain": [
        "30201",
        "30216",
        "20331",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "306",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني محمد بن أبي بكر المقدمي، وزهير بن حرب، قالا حدثنا يحيى، - وهو ابن سعيد - عن عبيد الله، ح وحدثنا أبو بكر بن أبي شيبة، وابن، نمير - واللفظ لهما - قال ابن نمير حدثنا أبي وقال أبو بكر، حدثنا أبو أسامة، - قالا حدثنا عبيد الله، عن نافع، عن ابن عمر، أن عمر، قال يا رسول الله أيرقد أحدنا وهو جنب قال ‏\"‏ نعم إذا توضأ ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported:                      Umar said: Is one amongst us permitted to sleep in a state of impurity (i. e. after having sexual intercourse)? He (the Holy Prophet) said: Yes, after performing ablution.",
      "chain": [
        "30161",
        "30022",
        "20031",
        "11201",
        "30201",
        "30212",
        "20331",
        "20436",
        "20318",
        "11201",
        "11014",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "333",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا عبد العزيز بن محمد، وأبو معاوية ح وحدثنا قتيبة بن سعيد، حدثنا جرير، ح وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا خلف بن هشام، حدثنا حماد بن زيد، كلهم عن هشام بن عروة، بمثل حديث وكيع وإسناده ‏.‏ وفي حديث قتيبة عن جرير جاءت فاطمة بنت أبي حبيش بن عبد المطلب بن أسد وهي امرأة منا ‏.‏ قال وفي حديث حماد بن زيد زيادة حرف تركنا ذكره ‏.‏",
      "text_en": " The hadith narrated by Waki' and with its chain of narrators has been transmitted on the authority of Hisham b. 'Urwa, but in the hadith narrated by Qutaiba on the authority of Jarir, the words are:                     \" There came Fatimah b. Abu Hubaish, b. 'Abd al-Muttalib b. Asad, and she was a woman amongst us,\" and in the hadith of Hammid b. Zaid there is an addition of these words:\" We abandoned mentioning him.\"",
      "chain": [
        "30399",
        "20167",
        "20354",
        "30367",
        "20028",
        "30212",
        "20331",
        "30503",
        "20022",
        "11065"
      ]
    },
    {
      "hadith_no": "370",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا سفيان، عن الضحاك بن عثمان، عن نافع، عن ابن عمر، أن رجلا، مر ورسول الله صلى الله عليه وسلم يبول فسلم فلم يرد عليه ‏.‏",
      "text_en": " Ibn Umar reported:                      A person happened to pass by the Messenger of Allah (may peace be upon him) when he was making water and saluted him, but he did not respond to his salutation.",
      "chain": [
        "30212",
        "20331",
        "20012",
        "20504",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "380",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا ابن نمير، حدثنا أبي، حدثنا عبيد الله، عن نافع، عن ابن عمر، قال كان لرسول الله صلى الله عليه وسلم مؤذنان بلال وابن أم مكتوم الأعمى ‏.‏",
      "text_en": " Ibn Umar reported:                      The Messenger of Allah (may peace be upon him) had two Mu'adhdhins, Bilal and 'Abdullah b. Umm Maktum, who (latter) was blind.",
      "chain": [
        "30212",
        "20331",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "380",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا ابن نمير، حدثنا أبي، حدثنا عبيد الله، حدثنا القاسم، عن عائشة، مثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'A'isha by another chain of transmitters.",
      "chain": [
        "30212",
        "20331",
        "11201",
        "10535"
      ]
    },
    {
      "hadith_no": "397",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، وعبد الله بن نمير، ح وحدثنا ابن نمير، حدثنا أبي قالا، حدثنا عبيد الله، عن سعيد بن أبي سعيد، عن أبي هريرة، أن رجلا، دخل المسجد فصلى ورسول الله صلى الله عليه وسلم في ناحية وساقا الحديث بمثل هذه القصة وزادا فيه ‏\"‏ إذا قمت إلى الصلاة فأسبغ الوضوء ثم استقبل القبلة فكبر ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      A person entered the mosque and said prayer while the Messenger of Allah (may peace be upon him) was sitting in a nook (of the mosque), and the rest of the hadith is the same as mentioned above, but with this addition:\" When you get up to pray, perform the ablution completely, and then turn towards the Qibla and recite takbir (Allah o Akbar =Allah is the Most Great).\"",
      "chain": [
        "30201",
        "20318",
        "20331",
        "30212",
        "20331",
        "11201",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "442",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا ابن نمير، حدثنا أبي، حدثنا حنظلة، قال سمعت سالما، يقول سمعت ابن عمر، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا استأذنكم نساؤكم إلى المساجد فأذنوا لهن ‏\"‏ ‏.‏",
      "text_en": " lbn Umar reported:                      I heard the Messeinger of Allah (may peace be upon him) say: When your women seek your permission for going to the mosque, you grant them (permission).",
      "chain": [
        "30212",
        "20331",
        "11243",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "464",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا مسعر، عن عدي بن ثابت، قال سمعت البراء بن عازب، قال سمعت النبي صلى الله عليه وسلم قرأ في العشاء بالتين والزيتون ‏.‏ فما سمعت أحدا أحسن صوتا منه ‏.‏",
      "text_en": " Al-Bara' b. 'Azib reported:                      I heard the Apostle of Allah (may peace be upon him) reciting in the night prayer:\" By the Fig and the Olive,\" and I have never heard anyone with a sweeter voice than he.",
      "chain": [
        "30212",
        "20331",
        "20359",
        "11372",
        "400"
      ]
    },
    {
      "hadith_no": "466",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا هشيم، ووكيع، ح قال وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا ابن أبي عمر، حدثنا سفيان، كلهم عن إسماعيل، في هذا الإسناد بمثل حديث هشيم ‏.‏",
      "text_en": " This hadith like one narrated by Hashalm has been narrated from Isma'il with the same chain of transmitters.",
      "chain": [
        "30201",
        "20468",
        "20032",
        "30212",
        "20331",
        "30421"
      ]
    },
    {
      "hadith_no": "468",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا عمرو بن عثمان، حدثنا موسى بن طلحة، حدثني عثمان بن أبي العاص الثقفي، أن النبي صلى الله عليه وسلم قال له ‏\"‏ أم قومك ‏\"‏ ‏.‏ قال قلت يا رسول الله إني أجد في نفسي شيئا ‏.‏ قال ‏\"‏ ادنه ‏\"‏ ‏.‏ فجلسني بين يديه ثم وضع كفه في صدري بين ثديى ثم قال ‏\"‏ تحول ‏\"‏ ‏.‏ فوضعها في ظهري بين كتفى ثم قال ‏\"‏ أم قومك فمن أم قوما فليخفف فإن فيهم الكبير وإن فيهم المريض وإن فيهم الضعيف وإن فيهم ذا الحاجة وإذا صلى أحدكم وحده فليصل كيف شاء ‏\"‏ ‏.‏",
      "text_en": " Uthman b. Abu'l-'As at-Thaqafi reported:                      The Apostle of Allah (may peace be upon him) said to him: Lead your people in prayer. I said: Messenger of Allah. I perceive something (disturbing) in my soul. He (the Holy Prophet) asked me to draw near him and making me sit down in front of him he placed his hand on my breast between my nipples. and then, telling me to turn round, he placed it on my back between my shoulders. He then said: Act as an Imam for your people. He who acts as Imam of the people, he must be brief, for among them are the aged, among them are the sick, among them are the weak, and among them are the people who have business to attend. But when any of you prays alone, he may pray as he likes.",
      "chain": [
        "30212",
        "20331",
        "10581",
        "579",
        "3210"
      ]
    },
    {
      "hadith_no": "501",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الله بن نمير، ح وحدثنا ابن نمير، - واللفظ له - حدثنا أبي، حدثنا عبيد الله، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم كان إذا خرج يوم العيد أمر بالحربة فتوضع بين يديه فيصلي إليها والناس وراءه وكان يفعل ذلك في السفر فمن ثم اتخذها الأمراء ‏.‏",
      "text_en": " Ibn Umar reported:                      When the Messenger of Allah (may peace he upon him) went out on the 'Id day, he ordered to carry a spear-and it was fixed in front of him, and he said prayer towards its (direction), and the people were behind him. And he did it in the journey, and that is the reason why the Amirs carried it.",
      "chain": [
        "30170",
        "20331",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "518",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا سفيان، ح قال وحدثنا محمد بن المثنى، حدثنا عبد الرحمن، عن سفيان، جميعا بهذا الإسناد وفي حديث ابن نمير قال دخلت على رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " This hadith has been narrated by Sufyan with the same chain of transmitters and in the hadith transmitted by Numair the words are:                      I called upon the Messenger of Allah (may peace be upon him).\"",
      "chain": [
        "30212",
        "20331",
        "20012",
        "30170",
        "20033"
      ]
    },
    {
      "hadith_no": "1232",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، ووكيع، ح قال وحدثنا إسحاق بن إبراهيم، أخبرنا عيسى بن يونس، كلهم عن إسماعيل بن أبي خالد، بهذا الإسناد نحوه ‏.‏",
      "text_en": " A hadith like this has been transmitted by Isma'il b. Abu Khalid.",
      "chain": [
        "30201",
        "20331",
        "20032",
        "30123",
        "20347"
      ]
    },
    {
      "hadith_no": "1252",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، وأبو أسامة ح وحدثنا ابن نمير، حدثنا أبي جميعا، عن عبيد الله، ح وحدثنا قتيبة، ومحمد بن رمح، عن الليث بن سعد، ح وحدثني زهير بن حرب، حدثنا إسماعيل، - يعني ابن علية - عن أيوب، ح وحدثنا ابن رافع، حدثنا ابن أبي فديك، أخبرنا الضحاك، - يعني ابن عثمان ح وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني موسى بن عقبة، كلهم عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم أنه رأى نخامة في قبلة المسجد ‏.‏ إلا الضحاك فإن في حديثه نخامة في القبلة ‏.‏ بمعنى حديث مالك ‏.‏",
      "text_en": " Ibn Umar reported that the Messenger of Allah (may peace be upon him) saw sputum sticking to the Qibla wall of the mosque, the rest of the hadith is the same.",
      "chain": [
        "30201",
        "20331",
        "20318",
        "30212",
        "11201",
        "30367",
        "30490",
        "20023",
        "30022",
        "20208",
        "11015",
        "20172"
      ]
    },
    {
      "hadith_no": "1272",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا ابن نمير، حدثنا أبي ح، قال وحدثنا أبو بكر بن أبي شيبة، - واللفظ له - حدثنا أبو أسامة، قالا حدثنا عبيد الله، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا وضع عشاء أحدكم وأقيمت الصلاة فابدءوا بالعشاء ولا يعجلن حتى يفرغ منه ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported:                      The Messenger of Allah (may peace be upon him) said: When the supper is served to any one of you and the prayer also begins. (in such a case) first take supper, and do not make haste (for prayer) till you have (taken the food).",
      "chain": [
        "30212",
        "20331",
        "20318",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1277",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا ابن نمير، ح قال وحدثنا محمد بن عبد الله بن نمير، - واللفظ له - حدثنا أبي قال، حدثنا عبيد الله، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أكل من هذه البقلة فلا يقربن مساجدنا حتى يذهب ريحها ‏\"‏ ‏.‏ يعني الثوم ‏.‏",
      "text_en": " Ibn 'Umar reported:                      The Messenuer of Allah (may peace be upon him) said: He who eats of this (offensive) plant must not approach our mosque, till its odour dies: (plant signifies) garlic.",
      "chain": [
        "30201",
        "30212",
        "20331",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1371",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا هشام، عن أبي الزبير، قال كان ابن الزبير يقول في دبر كل صلاة حين يسلم ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير لا حول ولا قوة إلا بالله لا إله إلا الله ولا نعبد إلا إياه له النعمة وله الفضل وله الثناء الحسن لا إله إلا الله مخلصين له الدين ولو كره الكافرون ‏\"‏ ‏.‏ وقال كان رسول الله صلى الله عليه وسلم يهلل بهن دبر كل صلاة ‏.‏",
      "text_en": " Abu Zubair reported:                      Ibn Zubair uttered at the end of every prayer after pronouncing salutation (these words):\" There is no god but Allah. He is alone. There is no partner with Him. Sovereignty belongs to Him and He is Potent over everything. There is no might or power except with Allah. There is no god but Allah and we do not worship but Him alone. To Him belong all bounties, to Him belongs all Grace, and to Him is worthy praise accorded. There is no god but Allah, to Whom we are sincere in devotion, even though the unbelievers should disapprove it.\" (The narrator said): He (the Holy Prophet) uttered it at the end of every (obligatory) prayer.",
      "chain": [
        "30212",
        "20331",
        "20295",
        "11263",
        "106"
      ]
    },
    {
      "hadith_no": "1403",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وزهير بن حرب، قالوا حدثنا ابن عيينة، ح قال وحدثنا أبو كريب، أخبرنا ابن المبارك، عن معمر، والأوزاعي، ومالك بن أنس، ويونس، ح قال وحدثنا ابن نمير، حدثنا أبي ح، قال وحدثنا ابن المثنى، حدثنا عبد الوهاب، جميعا عن عبيد الله، كل هؤلاء عن الزهري، عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثل حديث يحيى عن مالك وليس في حديث أحد منهم ‏\"‏ مع الإمام ‏\"‏ ‏.‏ وفي حديث عبيد الله قال ‏\"‏ فقد أدرك الصلاة كلها ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Malik and there is no mention of\" along with the Imam\" and In the hadith transmitted by Abdullah the words are:                     \" he in fact finds the entire prayer\".",
      "chain": [
        "30201",
        "30263",
        "30022",
        "20005",
        "30216",
        "20025",
        "20115",
        "20024",
        "20001",
        "20475",
        "30212",
        "20331",
        "11013"
      ]
    },
    {
      "hadith_no": "1424",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أبي، حدثنا بدر بن عثمان، حدثنا أبو بكر بن أبي موسى، عن أبيه، عن رسول الله صلى الله عليه وسلم أنه أتاه سائل يسأله عن مواقيت الصلاة فلم يرد عليه شيئا - قال - فأقام الفجر حين انشق الفجر والناس لا يكاد يعرف بعضهم بعضا ثم أمره فأقام بالظهر حين زالت الشمس والقائل يقول قد انتصف النهار وهو كان أعلم منهم ثم أمره فأقام بالعصر والشمس مرتفعة ثم أمره فأقام بالمغرب حين وقعت الشمس ثم أمره فأقام العشاء حين غاب الشفق ثم أخر الفجر من الغد حتى انصرف منها والقائل يقول قد طلعت الشمس أو كادت ثم أخر الظهر حتى كان قريبا من وقت العصر بالأمس ثم أخر العصر حتى انصرف منها والقائل يقول قد احمرت الشمس ثم أخر المغرب حتى كان عند سقوط الشفق ثم أخر العشاء حتى كان ثلث الليل الأول ثم أصبح فدعا السائل فقال ‏\"‏ الوقت بين هذين ‏\"‏ ‏.‏",
      "text_en": " Abu Musa narrated on the authority of his father that a person came to the Messenger of Allah (may peace be upon him) for inquiring about the times of prayers. He (the Holy Prophet) gave him no reply (because he wanted to explain to him the times by practically observing these prayers). He then said the morning player when it was daybreak, but the people could hardly recognise one another. He then commanded and the Iqama for the noon prayer was pronounced when the tan had passed the meridian and one would say that it was midday but he (the Holy Prophet) knew batter than them. He then again commanded and the Iqama for the afternoon prayer was pronounced when the sun was high. He then commanded and Iqama for the evening prayer was pronounced when the sun had sunk. He then commanded and Iqama for the night prayer was pronounced when the twilight had disappeared. He then delayed the morning prayer on the next day (so much so) that after returning from it one would say that the sun had risen or it was about to rise. He then delayed the noon prayer till it was near the time of afternoon prayer (as it was observed yesterday). He then delayed the afternoon prayer till one after returning from it would say that the sun had become red. He then delayed the evening prayer till the twilight was about to disappear. He then delayed the night prayer till it was one-third of the night. He then called the inquirer in the morning and said:                      The time for prayers is between these two (extremes).",
      "chain": [
        "30212",
        "20331",
        "10745"
      ]
    },
    {
      "hadith_no": "1467",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، وأبو أسامة ووكيع بهذا الإسناد وقال ‏\"‏ أما إنكم ستعرضون على ربكم فترونه كما ترون هذا القمر ‏\"‏ ‏.‏ وقال ثم قرأ ‏.‏ ولم يقل جرير ‏.‏",
      "text_en": " Waki' reported (this hadith) with the same chain of transmitters (that the Holy Prophet) said:                      You will be soon presented before your Lord, and you will see Him as you are seeing this moon, and then recited (the above-mentioned verse). But (in this hadith) no mention is made of Jarir.",
      "chain": [
        "30201",
        "20331"
      ]
    },
    {
      "hadith_no": "1511",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، وابن، نمير ح قال وحدثنا ابن نمير، حدثنا أبي قالا، حدثنا عبيد الله، بهذا الإسناد ‏.‏ قال ابن نمير عن أبيه، ‏\"‏ بضعا وعشرين ‏\"‏ ‏.‏ وقال أبو بكر في روايته ‏\"‏ سبعا وعشرين درجة ‏\"‏ ‏.‏",
      "text_en": " Ibn Numair reported it on the authority of his father (a preference of) more than twenty (degrees) and Abu Bakr in his narration (has narrated it) twenty- seven degrees.",
      "chain": [
        "30201",
        "20318",
        "30212",
        "30212",
        "20331",
        "30212"
      ]
    },
    {
      "hadith_no": "1514",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا ابن نمير، حدثنا أبي، حدثنا الأعمش، ح وحدثنا أبو بكر بن أبي شيبة، وأبو كريب - واللفظ لهما - قالا حدثنا أبو معاوية، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أثقل صلاة على المنافقين صلاة العشاء وصلاة الفجر ولو يعلمون ما فيهما لأتوهما ولو حبوا ولقد هممت أن آمر بالصلاة فتقام ثم آمر رجلا فيصلي بالناس ثم أنطلق معي برجال معهم حزم من حطب إلى قوم لا يشهدون الصلاة فأحرق عليهم بيوتهم بالنار ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The most burdensome prayers for the hypocrites are the night prayer and the morning prayer. If they were to know the blessings they have in store, they would have come to them, even though crawling, and I thought that I should order the prayer to be commenced and command a person to lead people in prayer, and I should then go along with some persons having a fagot of fuel with them to the people who have not attended the prayer (in congregation) and would burn their houses with fire.",
      "chain": [
        "30212",
        "20331",
        "11060",
        "30201",
        "20354",
        "11060",
        "11161",
        "13"
      ]
    }
  ],
  "total_hadiths": 347
}