{
  "id": "20334",
  "name": "'Abdul Rahim bin Sulaiman عبد الرحيم بن سليمان الكناني",
  "full_name": "'Abdul Rahim bin Sulaiman عبد الرحيم بن سليمان الكناني",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "187",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Kanani",
      "al-Tai'i",
      "Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11311",
      "name": "Hisham bin Hassan al-Azdi هشام بن حسان الأزدي القردوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10844",
      "name": "Yazid bin Abi Ziyad يزيد بن أبي زياد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11404",
      "name": "Yahya bin Sa'id bin Hiyan يحيى بن سعيد بن حيان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "18864",
      "name": "Qnan bin 'Abdullah al-Nhmy قنان بن عبد الله النهمي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11338",
      "name": "Zakaria bin Abi Za'idah زكريا بن أبي زائدة خالد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10644",
      "name": "'Abdullah bin 'Uthman bin Khuthaym عبد الله بن عثمان بن خثيم القاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10613",
      "name": "Muhammad bin Abi Isma'il محمد بن أبي إسماعيل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "32008",
      "name": "Da'ud bin 'Abdullah داود بن عبد الله بن أبي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "students": [
    {
      "id": "30309",
      "name": "Ibrahim bin Musa al-Razi al-Fara' إبراهيم بن موسى الرازي الفراء",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30465",
      "name": "Sa'id bin 'Amr bin Sahl al-Kundi سعيد بن عمرو بن سهل الكندي الأشعثي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38474",
      "name": "Muhammad bin Aadm bin Sulaiman محمد بن آدم بن سليمان الجهني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30480",
      "name": "Hanad bin al-Sari bin Mus'ab هناد بن السري بن مصعب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30216",
      "name": "Abu Karayb, Muhammad bin al-'Ala' محمد بن العلاء - أبو كريب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "35093",
      "name": "'Ali bin Sa'id bin Msrwq علي بن سعيد بن مسروق الكندي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30468",
      "name": "'Abdullah bin 'Umar عبد الله بن عمر",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30200",
      "name": "'Abdullah bin Sa'id al-Ashaj عبد الله بن سعيد بن حصين الكندي - الأشج",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30482",
      "name": "al-Walid bin Shuja' bin al-Sakuni الوليد بن شجاع بن الوليد بن قيس السكوني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30294",
      "name": "Ahmed bin Hameed al-Trythythy أحمد بن حميد الطريثيثي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-4861",
      "hadith_no": "4861",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني الحسن، حدثنا إسماعيل بن خليل، أخبرنا عبد الرحيم، عن زكرياء بن أبي زائدة، عن عامر، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إني أول من يرفع رأسه بعد النفخة الآخرة، فإذا أنا بموسى متعلق بالعرش فلا أدري أكذلك كان أم بعد النفخة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"I will be the first to raise my head after the second blowing of the trumpet and will see Moses hanging the Throne, and I will not know whether he had been in that state all the time or after the blowing of the trumpet.\"",
      "usc_msa_ref": "337",
      "chain": [
        "11016",
        "30186",
        "20334",
        "11338",
        "11052",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-365-2",
      "hadith_no": "365",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن عبد الملك بن أبي سليمان، عن عطاء، عن ابن عباس، أن النبي صلى الله عليه وسلم مر بشاة لمولاة لميمونة فقال ‏\"‏ ألا انتفعتم بإهابها ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      The Apostle of Allah (may peace be upon him) happened to pass by (the dead body) of the goat which belonged to the freed slave-girl of Maimuna and said: Why did you not make use of its skin?",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20334",
        "10945",
        "11029",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-2346",
      "hadith_no": "2346",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، ح وحدثنا محمد، بن بشار حدثنا يحيى بن سعيد، ح وحدثنا إسحاق، أخبرنا أبو أسامة، كلهم عن محمد، بن أبي إسماعيل بهذا الإسناد نحوه ‏.‏",
      "text_en": " This hadith has been narrated by Muhammad b. Isma'il with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20334",
        "30160",
        "20031",
        "30312"
      ]
    },
    {
      "id": "sahih-muslim-4499",
      "hadith_no": "4499",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثنا عثمان بن أبي شيبة، أخبرنا عبدة بن سليمان، وحميد بن عبد الرحمن، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، ح وحدثنا أبو كريب، حدثنا أبو أسامة، كلهم عن هشام، بهذا الإسناد ‏.‏ نحو حديث ابن نمير عن حميد بن عبد الرحمن، الرؤاسي وفي حديث عبد الرحيم وأبي أسامة وهو يومئذ ذو ثمن ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Hisham through another chain of transmitters, and in the hadith narrated by 'Abd al-Rahim and Abu Usama (the words are):                     \" That (the shield) was valuable those days.\"",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20337",
        "10561",
        "30201",
        "20334",
        "30216"
      ]
    },
    {
      "id": "sahih-muslim-4658",
      "hadith_no": "4658",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، وعبد الرحيم بن سليمان، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، قال بعث رسول الله صلى الله عليه وسلم سرية إلى نجد فخرجت فيها فأصبنا إبلا وغنما فبلغت سهماننا اثنى عشر بعيرا ونفلنا رسول الله صلى الله عليه وسلم بعيرا بعيرا ‏.‏",
      "text_en": " It has been narrated by Ibn 'Umar that the Messenger of Allah (may peace be upon him) sent an expedition to Najd, and I (also) went with the troops. We got camels and goats as spoils of war, and our share amounted to twelve camels per head, and the Messenger of Allah (may peace be upon him) gave an extra camel to each of us.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20345",
        "20334",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-4750",
      "hadith_no": "4750",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا عبد الله بن عمر بن محمد بن أبان الجعفي، حدثنا عبد الرحيم، - يعني ابن سليمان - عن زكرياء، عن أبي إسحاق، عن عمرو بن ميمون الأودي، عن ابن مسعود، قال بينما رسول الله صلى الله عليه وسلم يصلي عند البيت وأبو جهل وأصحاب له جلوس وقد نحرت جزور بالأمس فقال أبو جهل أيكم يقوم إلى سلا جزور بني فلان فيأخذه فيضعه في كتفى محمد إذا سجد فانبعث أشقى القوم فأخذه فلما سجد النبي صلى الله عليه وسلم وضعه بين كتفيه قال فاستضحكوا وجعل بعضهم يميل على بعض وأنا قائم أنظر ‏.‏ لو كانت لي منعة طرحته عن ظهر رسول الله صلى الله عليه وسلم والنبي صلى الله عليه وسلم ساجد ما يرفع رأسه حتى انطلق إنسان فأخبر فاطمة فجاءت وهي جويرية فطرحته عنه ‏.‏ ثم أقبلت عليهم تشتمهم فلما قضى النبي صلى الله عليه وسلم صلاته رفع صوته ثم دعا عليهم وكان إذا دعا دعا ثلاثا ‏.‏ وإذا سأل سأل ثلاثا ثم قال ‏\"‏ اللهم عليك بقريش ‏\"‏ ‏.‏ ثلاث مرات فلما سمعوا صوته ذهب عنهم الضحك وخافوا دعوته ثم قال ‏\"‏ اللهم عليك بأبي جهل بن هشام وعتبة بن ربيعة وشيبة بن ربيعة والوليد بن عقبة وأمية بن خلف وعقبة بن أبي معيط ‏\"‏ ‏.‏ وذكر السابع ولم أحفظه فوالذي بعث محمدا صلى الله عليه وسلم بالحق لقد رأيت الذين سمى صرعى يوم بدر ثم سحبوا إلى القليب قليب بدر ‏.‏ قال أبو إسحاق الوليد بن عقبة غلط في هذا الحديث ‏.‏",
      "text_en": " It has been narrated on the authority of Ibn Mas'ud who said:                      While the Messenger of Allah (may peace be upon him) was saying his prayer near the Ka'ba and Abu Jahl with his companions was sitting (near by), Abu Jahl said, referring to the she-camel that had been slaughtered the previous day: Who will rise to fetch the foetus of the she-camel of so and so, and place it between the shoulders of Muhammad when he goes down in prostration (a posture in prayer). The one most accursed among the people got up, brought the foetus and, when the Prophet (may peace be upon him) went down in prostration, placed it between his shoulders. Then they laughed at him and some of them leaned upon the others with laughter. And I stood looking. If I had the power, I would have thrown it away from the back of the Messenger of Allah (may peace be upon him). The Prophet (may peace be upon him) had bent down his head in prostration and did not raise it, until a man went (to his house) and informed (his daughter) Fatima, who was a young girl (at that time) (about this ugly incident). She came and removed (the filthy thing) from him. Then she turned towards them rebuking them (the mischief-mongers). When the Prophet (may peace be upon him) had finished his prayer, he invoked God's imprecations upon them in a loud voice. When he prayed, he prayed thrice, and when he asked for God's blessings, he asked thrice. Then he said thrice: O Allah, it is for Thee to deal with the Quraish. When they heard his voice, laughter vanished from them and they feared his malediction. Then he said: O God, it is for Thee to deal with Abu Jahl b. Hisham, 'Utba b. Rabi'a, Shaiba b. Rabi'a. Walid b. Uqba, Umayya b. Khalaf, Uqba b. Abu Mu'ait (and he mentioned the name of the seventh person. which I did not remember). By One Who sent Muhammad with truth, I saw (all) those he had named lying slain on the Day of Badr. Their dead bodies were dragged to be thrown into a pit near the battlefield. Abu Ishiq had said that the name of Walid b. 'Uqba has been wrongly mentioned in this tradition.",
      "usc_msa_ref": "",
      "chain": [
        "20334",
        "11338",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "id": "sahih-muslim-4793",
      "hadith_no": "4793",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن هشام، عن حفصة، بنت سيرين عن أم عطية الأنصارية، قالت غزوت مع رسول الله صلى الله عليه وسلم سبع غزوات أخلفهم في رحالهم فأصنع لهم الطعام وأداوي الجرحى وأقوم على المرضى.",
      "text_en": " It has been narrated on the authority of Umm 'Atiyya, the Ansarite, who said:                      I took part with the Messenger of Allah (may peace be upon him) in seven battles. I would stay behind in the camp of men, cook their food, treat the wounded and nurse the sick.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20334",
        "11065",
        "11039",
        "71"
      ]
    },
    {
      "id": "sahih-muslim-4840",
      "hadith_no": "4840",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن أبي حيان، ح وحدثني زهير بن حرب، حدثنا جرير، عن أبي حيان، وعمارة بن القعقاع، جميعا عن أبي زرعة، عن أبي هريرة، بمثل حديث إسماعيل عن أبي حيان، ‏.‏",
      "text_en": " The above tradition has been narrated on the same authority through different chains of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20334",
        "11404",
        "30022",
        "4057",
        "11404",
        "11379",
        "11406"
      ]
    },
    {
      "id": "sahih-muslim-4846",
      "hadith_no": "4846",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا أبو كريب، حدثنا عبدة، وابن، نمير وأبو معاوية ح وحدثنا أبو بكر بن، أبي شيبة حدثنا عبد الرحيم بن سليمان، ح وحدثنا ابن أبي عمر، حدثنا سفيان، كلهم عن هشام، بهذا الإسناد ‏.‏ وفي حديث عبدة وابن نمير فلما جاء حاسبه ‏.‏ كما قال أبو أسامة ‏.‏ وفي حديث ابن نمير ‏\"‏ تعلمن والله والذي نفسي بيده لا يأخذ أحدكم منها شيئا ‏\"‏ ‏.‏ وزاد في حديث سفيان قال بصر عيني وسمع أذناى ‏.‏ وسلوا زيد بن ثابت فإنه كان حاضرا معي ‏.‏",
      "text_en": " This tradition has been hanoed down through a different chain of transmitters on the authority of Hisham with aslight variation in the wording.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20337",
        "30201",
        "20334",
        "30421"
      ]
    },
    {
      "id": "sahih-muslim-4945",
      "hadith_no": "4945",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا عبد الله بن إدريس، وعبد الرحيم بن، سليمان ح وحدثنا محمد بن المثنى، حدثنا عبد الوهاب، - يعني الثقفي - جميعا عن عبيد، الله بهذا الإسناد غير أن في حديثهم وأنا ابن أربع عشرة سنة فاستصغرني ‏.‏",
      "text_en": " This tradition has been handed down through a different chain Of transmitters with the following change in the wording:                     \" I was fourteen years old and he thought me too young (to participate in the fight).\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20102",
        "20334",
        "30170",
        "20259"
      ]
    },
    {
      "id": "sahih-muslim-6422",
      "hadith_no": "6422",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن عاصم، حدثني  مورق، حدثني عبد الله بن جعفر، قال كان النبي صلى الله عليه وسلم إذا قدم من سفر تلقي بنا - قال - فتلقي بي وبالحسن أو بالحسين - قال - فحمل أحدنا بين يديه والآخر خلفه حتى دخلنا المدينة ‏.‏",
      "text_en": " Abdullah b. Ja'a'far reported that when Allah's Messenger (may peace be upon him) came back from a journey he met us. Once he met me, Hasan or Husain, and he mounted one of us before him and the other one behind him until we entered Medina.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20334",
        "11080",
        "11308",
        "108"
      ]
    },
    {
      "id": "sahih-muslim-6454",
      "hadith_no": "6454",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، ويعلى بن عبيد، عن زكرياء، عن الشعبي، عن أبي سلمة، عن عائشة، أنها حدثته أن النبي صلى الله عليه وسلم قال لها ‏\"‏ إن جبريل يقرأ عليك السلام ‏\"‏ ‏.‏ قالت فقلت وعليه السلام ورحمة الله ‏.‏",
      "text_en": " 'A'isha reported that Allah's Messenger (may peace be upon him) said to her:                      Gabriel offered you greetings and I said: So there should be peace and mercy of Allah upon him.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20334",
        "20372",
        "11338",
        "11052",
        "10567",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-724",
      "hadith_no": "724",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن الحسن بن عبيد الله النخعي، عن عبد الجبار بن وائل، عن أبيه، أنه أبصر النبي صلى الله عليه وسلم حين قام إلى الصلاة رفع يديه حتى كانتا بحيال منكبيه وحاذى بإبهاميه أذنيه ثم كبر ‏.‏",
      "text_en": " Wa’il b.Hujr said that he saw the Messenger of Allah(ﷺ) raise his hands when he uttered the takbir (Allah is most great).",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20334",
        "10755",
        "10940"
      ]
    },
    {
      "id": "sunan-abi-daud-1589",
      "hadith_no": "1589",
      "source": "Sunan Abi Da'ud",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو كامل، حدثنا عبد الواحد يعني ابن زياد، ح وحدثنا عثمان بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، - وهذا حديث أبي كامل - عن محمد بن أبي إسماعيل، حدثنا عبد الرحمن بن هلال العبسي، عن جرير بن عبد الله، قال جاء ناس - يعني من الأعراب - إلى رسول الله صلى الله عليه وسلم فقالوا إن ناسا من المصدقين يأتونا فيظلمونا ‏.‏ قال فقال ‏\"‏ أرضوا مصدقيكم ‏\"‏ ‏.‏ قالوا يا رسول الله وإن ظلمونا قال ‏\"‏ أرضوا مصدقيكم ‏\"‏ ‏.‏ زاد عثمان ‏\"‏ وإن ظلمتم ‏\"‏ ‏.‏ قال أبو كامل في حديثه قال جرير ما صدر عني مصدق بعد ما سمعت هذا من رسول الله صلى الله عليه وسلم إلا وهو عني راض ‏.‏",
      "text_en": " Jabir bin ‘Abdallah told of some people, meaning nomadic Arabs, who came to the Messenger of Allah (ﷺ) and said Collectors of zakat come to us and act unjustly. He said please those who collect the sadaqah from you. They asked Even if they wrong us, Messenger of Allah? He replied Please those who collect sadaqah from you. The version of ‘Uthman adds “Even if you are wronged”. Abu Kamil said in this version “Jarir said No collector of zakat returned from me since I heard this from the Messenger of Allah(ﷺ), but  he was pleased with me.”",
      "usc_msa_ref": "",
      "chain": [
        "30559",
        "20256",
        "30203",
        "20334",
        "10613",
        "10791",
        "4057"
      ]
    },
    {
      "id": "sunan-abi-daud-2936",
      "hadith_no": "2936",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن إبراهيم الأسباطي، حدثنا عبد الرحيم بن سليمان، عن محمد بن إسحاق، عن عاصم بن عمر بن قتادة، عن محمود بن لبيد، عن رافع بن خديج، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ العامل على الصدقة بالحق كالغازي في سبيل الله حتى يرجع إلى بيته ‏\"‏ ‏.‏",
      "text_en": " Narrated Rafi' ibn Khadij:                     I heard the Messenger of Allah (ﷺ) say: The official who collects sadaqah (zakat) in a just manner is like him who fights in Allah's path till he returns home.",
      "usc_msa_ref": "",
      "chain": [
        "11213",
        "20334",
        "11107",
        "11103",
        "1830",
        "1986"
      ]
    },
    {
      "id": "sunan-abi-daud-3614",
      "hadith_no": "3614",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا الحسن بن علي، حدثنا يحيى بن آدم، حدثنا عبد الرحيم بن سليمان، عن سعيد، بإسناده ومعناه ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted by Sa'id through a different chain of narrators to the same effect.",
      "usc_msa_ref": "",
      "chain": [
        "30115",
        "20364",
        "20334"
      ]
    },
    {
      "id": "sunan-abi-daud-5232",
      "hadith_no": "5232",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن زكريا، عن الشعبي، عن أبي سلمة، أن عائشة، رضى الله عنها حدثته أن النبي صلى الله عليه وسلم قال لها ‏\"‏ إن جبريل يقرأ عليك السلام ‏\"‏ ‏.‏ فقالت وعليه السلام ورحمة الله ‏.‏",
      "text_en": " ‘A’ishah told that the Prophet(ﷺ) said to her:                      Gabriel gives you a greeting. Replying she said: Upon him be peace and grace of Allah.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20334",
        "11338",
        "11052",
        "10567",
        "53"
      ]
    },
    {
      "id": "jami-al-tirmidhi-653",
      "hadith_no": "653",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا علي بن سعيد الكندي، حدثنا عبد الرحيم بن سليمان، عن مجالد، عن عامر الشعبي، عن حبشي بن جنادة السلولي، قال سمعت رسول الله صلى الله عليه وسلم في حجة الوداع وهو واقف بعرفة أتاه أعرابي فأخذ بطرف ردائه فسأله إياه فأعطاه وذهب فعند ذلك حرمت المسألة فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن المسألة لا تحل لغني ولا لذي مرة سوي إلا لذي فقر مدقع أو غرم مفظع ومن سأل الناس ليثري به ماله كان خموشا في وجهه يوم القيامة ورضفا يأكله من جهنم فمن شاء فليقل ومن شاء فليكثر ‏\"‏ ‏.‏",
      "text_en": " Hubshi bin Junadah As-Saluli narrated:                     \"During the Farewell Hajj, while the Messener of allah was standing at Arafat, a Bedouin came to him begging while pulling on the edge of his Rida. He gave him something and he left. With that, begging was made unlawful, so the Messenger of Allah said: 'Begging is not lawful for the rich nor for the physically fit, except for the one who is severely poor or in perilous debt. And whoever begs the people (merely) to increase his wealth, then on the Day of Judgment (the wealth he begged for) will be lacerations on his face and heated coals from Hell will be provided for him to eat. Whoever wishes, let him take a little, and whoever wishes, then let him take a lot.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38401",
        "20334",
        "10820",
        "11052",
        "4112"
      ]
    },
    {
      "id": "jami-al-tirmidhi-654",
      "hadith_no": "654",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا يحيى بن آدم، عن عبد الرحيم بن سليمان، نحوه ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏",
      "text_en": " Narrator mentioned in hadith:                     There is another chain with a similar narration.",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20364",
        "20334"
      ]
    },
    {
      "id": "jami-al-tirmidhi-807",
      "hadith_no": "807",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا هناد، حدثنا عبد الرحيم بن سليمان، عن عبد الملك بن أبي سليمان، عن عطاء، عن زيد بن خالد الجهني، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من فطر صائما كان له مثل أجره غير أنه لا ينقص من أجر الصائم شيئا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Zaid bin Khalid Al-Juhani narrated that:                     The Messenger of Allah said: \"Whoever provides the food for a fasting person to break his fast with, then for his is the same reward as his (the fasting person's), without anything being diminished from the reward of the fasting person.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20334",
        "10945",
        "11029",
        "3625"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1473",
      "hadith_no": "1473",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا أبو كريب، حدثنا عبد الرحيم بن سليمان، عن أبي أيوب الأفريقي، عن صفوان بن سليم، عن سعيد بن المسيب، عن أبي الدرداء، قال نهى رسول الله صلى الله عليه وسلم عن أكل المجثمة وهي التي تصبر بالنبل ‏.‏ قال وفي الباب عن عرباض بن سارية وأنس وابن عمر وابن عباس وجابر وأبي هريرة ‏.‏ قال أبو عيسى حديث أبي الدرداء حديث غريب ‏.‏",
      "text_en": " Narrated Abu Ad-Darda':                     \"The Messenger of Allah (ﷺ) prohibited eating the Mujath-thamah, and it is what is trapped and killed by arrows.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20334",
        "11177",
        "11002",
        "37"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1576",
      "hadith_no": "1576",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا علي بن سعيد الكندي، حدثنا عبد الرحيم بن سليمان، عن إسرائيل، عن ثوير، عن أبيه، عن علي، عن النبي صلى الله عليه وسلم أن كسرى أهدى إليه فقبل منه وأن الملوك أهدوا إليه فقبل منهم ‏.‏ قال وفي الباب عن جابر ‏.‏ وهذا حديث حسن غريب ‏.‏ وثوير هو ابن أبي فاختة وأبو فاختة اسمه سعيد بن علاقة وثوير يكنى أبا جهم ‏.‏",
      "text_en": " Narrated 'Ali:                     From the Prophet (ﷺ), that Kisra sent him a gift so he accepted, and that kings gave him gifts and he accepted them.There is something about this from Jabir. This is a Hasan Gharib Hadith. Thuwair (a narrator in the chain) is Ibn Abi Fakhitah, whose name was Sa'eed bin 'Illaqah, and Thuwair's Kunyah was Abu Jahm.",
      "usc_msa_ref": "",
      "chain": [
        "38401",
        "20334",
        "20311",
        "10846",
        "5"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2140",
      "hadith_no": "2140",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو كريب، حدثنا عبدة بن سليمان، وعبد الرحيم، ومحمد بن بشر، عن محمد بن عمرو، حدثنا أبو سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الحياء من الإيمان والإيمان في الجنة والبذاء من الجفاء والجفاء في النار ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن ابن عمر وأبي بكرة وأبي أمامة وعمران بن حصين ‏.‏ هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah said:                     \"Al-Haya is from faith, and faith is in Paradise. Obscenity is from rudeness, and rudeness is in the Fire.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20337",
        "20334",
        "20352",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2995",
      "hadith_no": "2995",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو كريب، حدثنا عبدة بن سليمان، وعبد الرحيم، عن محمد بن عمرو، حدثنا أبو سلمة، عن أبي هريرة، قال رأى رسول الله صلى الله عليه وسلم رجلا مضطجعا على بطنه فقال ‏\"‏ إن هذه ضجعة لا يحبها الله ‏\"‏ ‏.‏ وفي الباب عن طهفة وابن عمر ‏.‏ قال أبو عيسى وروى يحيى بن أبي كثير هذا الحديث عن أبي سلمة عن يعيش بن طهفة عن أبيه ويقال طخفة والصحيح طهفة ‏.‏ وقال بعض الحفاظ الصحيح طخفة ويقال طغفة ‏.‏ يعيش هو من الصحابة ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) saw a man laying on his stomach so he said: \"Indeed such laying is not loved by Allah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20337",
        "20334",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3405",
      "hadith_no": "3405",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو كريب، حدثنا عبدة، وعبد الرحيم، عن محمد بن عمرو، نحو حديث الفضل بن موسى إلا أنه قال ‏\"‏ ما بعث الله بعده نبيا إلا في ثروة من قومه ‏\"‏ ‏.‏ قال محمد بن عمرو الثروة الكثرة والمنعة ‏.‏ قال أبو عيسى وهذا أصح من رواية الفضل بن موسى وهذا حديث حسن ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20337",
        "20334",
        "11220",
        "11220"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3603",
      "hadith_no": "3603",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو كريب، حدثنا عبدة بن سليمان، وعبد الرحيم بن سليمان، عن محمد بن عمرو، حدثنا أبو سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يقول الله أعددت لعبادي الصالحين ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر واقرءوا إن شئتم ‏:‏ ‏(‏ وما تعلم نفس ما أخفي لهم من قرة أعين جزاء بما كانوا يعملون ‏)‏ وفي الجنة شجرة يسير الراكب في ظلها مائة عام لا يقطعها واقرءوا إن شئتم ‏:‏ ‏(‏ وظل ممدود ‏)‏ وموضع سوط في الجنة خير من الدنيا وما فيها واقرءوا إن شئتم ‏:‏ ‏(‏ فمن زحزح عن النار وأدخل الجنة فقد فاز وما الحياة الدنيا إلا متاع الغرور ‏)‏ ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah said:                     “Allah said: ‘I have prepared for My righteous worshippers, what no eye has seen, nor ear has hear, and no human heart has conceived.’ So recite if you wish: No person knows what is kept hidden for them of delights of the eyes as a reward for what they used to do. And in Paradise there is a tree under whose shade a rider can travel for one hundred years without stopping. Recite if you wish: And in shade extended. And the space occupied by a whip in Paradise is better than the world and whatever is in it. Recite if you wish: And whoever is removed away from the Fire and admitted to Paradise, he indeed is successful. The life of this world is only the enjoyment of deception.”",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20337",
        "20334",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2409",
      "hadith_no": "2409",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا علي بن الحسن اللاني، بالكوفة عن عبد الرحيم، - وهو ابن سليمان - عن عاصم الأحول، عن أبي عثمان، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صام ثلاثة أيام من الشهر فقد صام الدهر كله ‏\"‏ ‏.‏ ثم قال ‏\"‏ صدق الله في كتابه ‏{‏ من جاء بالحسنة فله عشر أمثالها ‏}‏ ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"The Messenger of Allah said: 'Whoever fasts for three days of each month, he has fasted for a whole lifetime.' Then he said: Allah has spoken the truth in His book: Whoever brings a good deed shall have ten times the like thereof to his credit.",
      "usc_msa_ref": "",
      "chain": [
        "20334",
        "11080",
        "11113",
        "23"
      ]
    },
    {
      "id": "sunan-an-nasai-3049",
      "hadith_no": "3049",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن آدم بن سليمان، قال حدثنا عبد الرحيم بن سليمان، عن عبيد الله، عن عبد الرحمن بن القاسم، عن أبيه، عن أم المؤمنين، عائشة قالت وددت أني استأذنت رسول الله صلى الله عليه وسلم كما استأذنته سودة فصليت الفجر بمنى قبل أن يأتي الناس وكانت سودة امرأة ثقيلة ثبطة فاستأذنت رسول الله صلى الله عليه وسلم فأذن لها فصلت الفجر بمنى ورمت قبل أن يأتي الناس ‏.‏",
      "text_en": " It was narrated that the Mother of the Belivers Aishah said:                     \"I wished that I had asked the Messenger of Allah for permission as Sawdha did, so that I could pray Fajir in Mina before the people came. Sawdah was heavyset woman, so she asked the Messenger of Allah for permission, and he gave her permission to pray Fajir in Mina and stone the before the people came.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20334",
        "11201",
        "10530",
        "10535"
      ]
    },
    {
      "id": "sunan-an-nasai-3074",
      "hadith_no": "3074",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني محمد بن آدم، عن عبد الرحيم، عن عبيد الله بن عمر، وذكر، آخر عن أبي الزبير، عن جابر، أن رسول الله صلى الله عليه وسلم رمى الجمرة بمثل حصى الخذف ‏.‏",
      "text_en": " It was narrated from Jabir:                     That the Messenger of Allah stoned the Jamarat with pebbles like date sones or fingertips.",
      "usc_msa_ref": "",
      "chain": [
        "20334",
        "11201",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-3885",
      "hadith_no": "3885",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا يحيى، - وهو ابن آدم - قال حدثنا عبد الرحيم، عن محمد بن عمرو، عن أبي سلمة، عن أبي سعيد الخدري، قال نهى رسول الله صلى الله عليه وسلم عن المحاقلة والمزابنة‏.‏‏ خالفهم الأسود بن العلاء فقال عن أبي سلمة عن رافع بن خديج‏.‏‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                      \"The Messenger of Allah forbade Al-Muhaqalah and Al-Muzabanah.\"",
      "usc_msa_ref": "",
      "chain": [
        "20364",
        "20334",
        "11220",
        "10567",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-4372",
      "hadith_no": "4372",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرني محمد بن آدم، عن عبد الرحيم، - وهو ابن سليمان - عن زكريا بن أبي زائدة، عن أبي إسحاق، عن شريح بن النعمان، عن علي، رضى الله عنه قال أمرنا رسول الله صلى الله عليه وسلم أن نستشرف العين والأذن وأن لا نضحي بمقابلة ولا مدابرة ولا بتراء ولا خرقاء ‏.‏",
      "text_en": " It was narrated that 'Ali, may Allah be pleased with him, said:                     \"The Messenger of Allah commanded us to examine the eyes and ears (of animals), and no0t to sacrifice and animals with its ears slit from the front, and animal with its ears slit form the back, a animal with its tail cut, nor an animals with a round hole in its ear.\"",
      "usc_msa_ref": "",
      "chain": [
        "20334",
        "11338",
        "11049",
        "5"
      ]
    },
    {
      "id": "sunan-an-nasai-5166",
      "hadith_no": "5166",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرني محمد بن آدم، عن عبد الرحيم، عن زكريا، عن أبي إسحاق، عن هبيرة، عن علي، قال نهى رسول الله صلى الله عليه وسلم عن خاتم الذهب وعن القسي وعن المياثر الحمر ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"The Prophet [SAW] forbade me to wear gold rings, and Al-Qassi, red Al-Miyathir.\"",
      "usc_msa_ref": "",
      "chain": [
        "20334",
        "11338",
        "11049",
        "5"
      ]
    },
    {
      "id": "sunan-an-nasai-5559",
      "hadith_no": "5559",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا محمد بن آدم، وعلي بن سعيد، قالا حدثنا عبد الرحيم، عن حبيب بن أبي عمرة، عن سعيد بن جبير، عن ابن عباس، قال نهى رسول الله صلى الله عليه وسلم عن خليط التمر والزبيب وعن التمر والبسر‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah [SAW] forbade mixing dried dates and raisins, and dried dates and Al-Busr.\"",
      "usc_msa_ref": "",
      "chain": [
        "38401",
        "20334",
        "14069",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-5669",
      "hadith_no": "5669",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرني محمد بن آدم بن سليمان، عن عبد الرحيم، عن يزيد، ح وأنبأنا واصل بن عبد الأعلى، حدثنا ابن فضيل، عن يزيد بن أبي زياد، عن مجاهد، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم وقال محمد بن آدم عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من شرب الخمر فجعلها في بطنه لم يقبل الله منه صلاة سبعا إن مات فيها ‏\"‏ ‏.‏ وقال ابن آدم ‏\"‏ فيهن مات كافرا فإن أذهبت عقله عن شىء من الفرائض ‏\"‏ ‏.‏ وقال ابن آدم ‏\"‏ القرآن لم تقبل له صلاة أربعين يوما إن مات فيها ‏\"‏ ‏.‏ وقال ابن آدم ‏\"‏ فيهن مات كافرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Amr that:                     The Prophet [SAW] said: \"Whoever drinks Khamr and puts it in his belly, Allah will not accept his Salah for seven (days), if he dies during them\" - Muhammad bin Adam (One of the narrators) said: \"he will die a Kafir. If he was too intoxicated to offer any of the obligatory\" - Ibn Adam said: \"or recite Qur'an, his Salah will not be accepted for 40 days, and if he dies during them,\" And Ibn Adam said: \"He will die a Kafir.\"",
      "usc_msa_ref": "",
      "chain": [
        "20334",
        "20472",
        "20356",
        "10844",
        "11028",
        "29"
      ]
    },
    {
      "id": "sunan-ibn-majah-1769",
      "hadith_no": "1769",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، ومحمد بن فضيل، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن فضيل، عن عاصم الأحول، عن حفصة بنت سيرين، عن الرباب أم الرائح بنت صليع، عن عمها، سلمان بن عامر قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا أفطر أحدكم فليفطر على تمرة فإن لم يجد فليفطر على الماء فإنه طهور ‏\"‏ ‏.‏",
      "text_en": " Salmanbin ‘Amr narrated that the Messenger of Allah (ﷺ) said:                     \"Whenany one of you breaks his fast, let him break it with dates. Ifhecannot find dates, then let him break it with water, for it is ameans of purification.\"",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20334",
        "20356",
        "30201",
        "20356",
        "11080",
        "11039",
        "19958"
      ]
    },
    {
      "id": "sunan-ibn-majah-1790",
      "hadith_no": "1790",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أيام منى أيام أكل وشرب ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “The days of Mina (11th, 12th, and 13thof Dhul-Hijjah) are daysof eating and drinking.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20334",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2724",
      "hadith_no": "2724",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا عثمان، وأبو بكر ابنا أبي شيبة قالا حدثنا أبو خالد الأحمر، ح وحدثنا عثمان بن أبي شيبة، قال حدثنا جرير، وعبد الرحيم بن سليمان، جميعا عن محمد بن إسحاق، عن الحارث بن فضيل، أظنه عن ابن أبي العوجاء، واسمه، سفيان عن أبي شريح الخزاعي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أصيب بدم أو خبل - والخبل الجرح - فهو بالخيار بين إحدى ثلاث فإن أراد الرابعة فخذوا على يديه أن يقتل أو يعفو أو يأخذ الدية فمن فعل شيئا من ذلك فعاد فإن له نار جهنم خالدا مخلدا فيها أبدا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sharaih Al-Khuzai that the Messenger of Allah (ﷺ) said:                     “Whoever suffers from killing or wounding, has the choice of three things, and if he wants the fourth then restrain him. He may kill (the killer), or forgive him, or take the blood money. Whoever accepts any of these (options), then kills (the killer) after that will have the fire of hell to abide therein forever.”",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20326",
        "30203",
        "20028",
        "20334",
        "11107",
        "11835",
        "5355"
      ]
    },
    {
      "id": "sunan-ibn-majah-2758",
      "hadith_no": "2758",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن محمد بن إسحاق، عن عطاء، عن صفوان بن عبد الله، عن عميه، يعلى وسلمة ابنى أمية قالا خرجنا مع رسول الله صلى الله عليه وسلم في غزوة تبوك ومعنا صاحب لنا فاقتتل هو ورجل آخر ونحن بالطريق ‏.‏ قال فعض الرجل يد صاحبه فجذب صاحبه يده من فيه فطرح ثنيته فأتى رسول الله صلى الله عليه وسلم يلتمس عقل ثنيته ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ يعمد أحدكم إلى أخيه فيعضه كعضاض الفحل ثم يأتي يلتمس العقل لا عقل لها ‏\"‏ ‏.‏ قال فأبطلها رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Ya'la and Salamah the sons of Ummayah said:                     “We went out with the Messenger of Allah (ﷺ) on the military expedition of Tabuk, and with us was a friend of ours. He fought with another man while we were on the road. The man bit the hand on his opponent, who pulled away his hand and the man's tooth fell out. He came to Messenger of Allah (ﷺ) demanding compensatory money for his tooth, and the Messenger of Allah (ﷺ) said: 'Would anyone of you go and bite his brother like a stallion, then come demanding compensatory money? There is no compensatory for this.'” Hence, The Messenger of Allah (ﷺ) invalidated it (i.e compensatory in such case).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20334",
        "11107",
        "11029",
        "10920"
      ]
    },
    {
      "id": "sunan-ibn-majah-2926",
      "hadith_no": "2926",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن حجاج، عن أبي عمر، - مولى أسماء - عن أسماء بنت أبي بكر، أنها أخرجت جبة مزررة بالديباج فقالت كان النبي صلى الله عليه وسلم يلبس هذه إذا لقي العدو ‏.‏",
      "text_en": " It wasnarrated from Abu ‘Umar, the freed slave of Asma’, from Asma’bint Abi Bakr, that she brought out a cloak edged with brocade andsaid:                      “The Prophet (ﷺ) used to wear this when he met the enemy.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20334",
        "20219",
        "70"
      ]
    },
    {
      "id": "sunan-ibn-majah-2965",
      "hadith_no": "2965",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن هشام، عن حفصة بنت سيرين، عن أم عطية الأنصارية، قالت غزوت مع رسول الله صلى الله عليه وسلم سبع غزوات أخلفهم في رحالهم وأصنع لهم الطعام وأداوي الجرحى وأقوم على المرضى ‏.‏",
      "text_en": " It wasnarrated that Umm ‘Atiyyah Al-Ansariyyah said:                      “I foughtalongside the Messenger of Allah (ﷺ) in seven campaigns, lookingafter their goods, making food for them, tending the wounded andlooking after the sick.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20334",
        "11065",
        "11039",
        "71"
      ]
    },
    {
      "id": "sunan-ibn-majah-3147",
      "hadith_no": "3147",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن يزيد بن أبي زياد، عن سليمان بن عمرو بن الأحوص، عن أم جندب، عن النبي  صلى الله عليه وسلم  بنحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20334",
        "10844",
        "19868"
      ]
    },
    {
      "id": "sunan-ibn-majah-3257",
      "hadith_no": "3257",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا أبو كريب، حدثنا المحاربي، وعبد الرحيم، عن سفيان الثوري، عن سعيد بن مسروق، وحدثنا الحسين بن علي، عن زائدة، عن سعيد بن مسروق، عن عباية بن رفاعة، عن رافع بن خديج، قال كنا مع رسول الله  صلى الله عليه وسلم  ونحن بذي الحليفة من تهامة فأصبنا إبلا وغنما فعجل القوم فأغلينا القدور قبل أن تقسم فأتانا رسول الله  صلى الله عليه وسلم  فأمر بها فأكفئت ثم عدل الجزور بعشرة من الغنم ‏.‏",
      "text_en": " It wasnarrated that Rafi’ bin Khadij said:                      “We were with theMessengerof Allah (ﷺ) in Dhul-Hulaifah in (the land of) Tihamah. Weacquiredsheep and camels and the people hastened to put cooking potson thefires before they had been distributed. The Messenger of Allah(ﷺ)came to us and ordered that they be overturned,* then he madeonecamel equivalent to ten sheep.”",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20333",
        "20334",
        "20012",
        "20016",
        "20315",
        "20320",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sunan-ibn-majah-3295",
      "hadith_no": "3295",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن هشام بن عروة، عن أبيه، عن عائشة أم المؤمنين، أن قوما، قالوا يا رسول الله إن قوما يأتونا بلحم لا ندري ذكر اسم الله عليه أم لا قال ‏\"‏ سموا أنتم وكلوا ‏\"‏ ‏.‏ وكانوا حديث عهد بالكفر ‏.‏",
      "text_en": " It wasnarrated from ‘Aishah, the Mother of the Believers, that somepeople said:                      “O Messenger of Allah, some people bring us meat, andwedo not know whether the Name of Allah has been mentioned over itornot.” He said: “Say: Bismillah and eat.’ They were new inIslam.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20334",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-3363",
      "hadith_no": "3363",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو كريب، حدثنا عبد الرحيم بن سليمان، عن داود بن أبي هند، عن أبي نضرة، عن أبي سعيد الخدري، قال نادى رسول الله  صلى الله عليه وسلم  رجل من أهل الصفة حين انصرف من الصلاة فقال يا رسول الله إن أرضنا أرض مضبة فما ترى في الضباب قال ‏\"‏ بلغني أنه أمة مسخت ‏\"‏ ‏.‏ فلم يأمر به ولم ينه عنه ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed Al-Khudri said:                      “A man from amongAhlus-Suffah called the Messenger of Allah (ﷺ) when he had finishedthe prayer, saying: ‘O Messenger of Allah! Our land is a landinfestedwith mastigures. What do you think of (eating) mastigures?’He said:‘I have heard that a nation was transformed.’ He did nottell us toeat them, and he did not forbid that.”",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20334",
        "11585",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-ibn-majah-3625",
      "hadith_no": "3625",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن إسماعيل بن مسلم، عن محمد بن المنكدر، عن جابر، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ عليكم بالإثمد عند النوم فإنه يجلو البصر وينبت الشعر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Jabir said:                      “I heard the Messenger of Allah(ﷺ)say: ‘You should use antimony when you go to sleep, for itimprovesthe eyesight and makes the hair (eyelashes) grow.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20334",
        "22025",
        "11048",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-3662",
      "hadith_no": "3662",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن يزيد بن أبي زياد، عن سليمان بن عمرو بن الأحوص، عن أم جندب، قالت رأيت رسول الله  صلى الله عليه وسلم  رمى جمرة العقبة من بطن الوادي يوم النحر ثم انصرف وتبعته امرأة من خثعم ومعها صبي لها به بلاء لا يتكلم فقالت يا رسول الله إن هذا ابني وبقية أهلي وإن به بلاء لا يتكلم ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ ائتوني بشىء من ماء ‏\"‏ ‏.‏ فأتي بماء فغسل يديه ومضمض فاه ثم أعطاها فقال ‏\"‏ اسقيه منه وصبي عليه منه واستشفي الله له ‏\"‏ ‏.‏ قالت فلقيت المرأة فقلت لو وهبت لي منه ‏.‏ فقالت إنما هو لهذا المبتلى ‏.‏ قالت فلقيت المرأة من الحول فسألتها عن الغلام فقالت برأ وعقل عقلا ليس كعقول الناس ‏.‏",
      "text_en": " It wasnarrated from ‘Ali that the Messenger of Allah (ﷺ) said:                     “Thebest remedy is the Qur’an.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20334",
        "10844",
        "19868"
      ]
    },
    {
      "id": "sunan-ibn-majah-3722",
      "hadith_no": "3722",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن عبيد الله بن عمر، عن نافع، أن عبد الله بن عمر، أخبره أن عمر بن الخطاب رأى حلة سيراء من حرير فقال يا رسول الله لو ابتعت هذه الحلة للوفد وليوم الجمعة ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ إنما يلبس هذا من لا خلاق له في الآخرة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin ‘Umar that ‘Umar bin Khattab saw asilken two piece suit (being offered for sale). He said:                      “OMessengerof Allah, why don’t you buy this two piece suit (to wearfor meeting)the delegations, and on Fridays?” The Messenger ofAllah (ﷺ) said:“This is only worn by one who has no share in theHereafter.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20334",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-3726",
      "hadith_no": "3726",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا عبد الرحيم بن سليمان، عن محمد بن إسحاق، عن يزيد بن أبي حبيب، عن عبد العزيز بن أبي الصعبة، عن أبي الأفلح الهمداني، عن عبد الله بن زرير الغافقي، سمعته يقول سمعت علي بن أبي طالب، يقول أخذ رسول الله  صلى الله عليه وسلم  حريرا بشماله وذهبا بيمينه ثم رفع بهما يديه فقال ‏\"‏ إن هذين حرام على ذكور أمتي حل لإناثهم ‏\"‏ ‏.‏",
      "text_en": " ‘Alibin Abu Talib said:                      “The Messenger of Allah (ﷺ) took hold ofsomesilk in his left hand and some gold in his right, then he raisedhishands and said: ‘These two are forbidden for the males of mynation, and permitted to the females.’”",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "20334",
        "11107",
        "11411",
        "12310",
        "5"
      ]
    },
    {
      "id": "sunan-ibn-majah-3727",
      "hadith_no": "3727",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن يزيد بن أبي زياد، عن أبي فاختة، حدثني هبيرة بن يريم، عن علي، أنه أهدي لرسول الله  صلى الله عليه وسلم  حلة مكفوفة بحرير إما سداؤها وإما لحمتها فأرسل بها إلى فأتيته فقلت يا رسول الله ما أصنع بها ألبسها قال ‏\"‏ لا ولكن اجعلها خمرا بين الفواطم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Ali that a two-piece suit hemmed with silk,eitheron the wrap or the weft,* was given to the Messenger of Allah(ﷺ),and he sent them to me (‘Ali). I came to him and said:                      “OMessenger of Allah, what should I do with these? Shall I wear them?”He said: “No, rather make them into head-cloths and give them totheFatimahs.”**",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20334",
        "10844",
        "19883",
        "5"
      ]
    },
    {
      "id": "sunan-ibn-majah-3728",
      "hadith_no": "3728",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا عبد الرحيم بن سليمان، عن الإفريقي، عن عبد الرحمن بن رافع، عن عبد الله بن عمرو، قال خرج علينا رسول الله  صلى الله عليه وسلم  وفي إحدى يديه ثوب من حرير وفي الأخرى ذهب فقال ‏\"‏ إن هذين محرم على ذكور أمتي حل لإناثهم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin ‘Umar said:                      “The Messenger ofAllah(ﷺ) came out to us, and in one of his hands was a garment ofsilkand in the other was some gold. He said: ‘These are forbidden tothe males of my nation and permitted to the females.’”",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "20334",
        "29"
      ]
    },
    {
      "id": "sunan-ibn-majah-3742",
      "hadith_no": "3742",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن ليث، عن شهر بن حوشب، عن سلمان، قال كان لبعض أمهات المؤمنين شاة فماتت فمر رسول الله  صلى الله عليه وسلم  عليها فقال ‏\"‏ ما ضر أهل هذه لو انتفعوا بإهابها ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Salman said:                      “One of the Mothers of theBelievers hada sheep that died. The Messenger of Allah (ﷺ) passedby it andsaid: ‘It would not have harmed its owners if they had madeuse ofits hide.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20334",
        "20023",
        "11044",
        "14"
      ]
    },
    {
      "id": "sunan-ibn-majah-3696-2",
      "hadith_no": "3696",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن زكريا، عن الشعبي، عن أبي سلمة، أن عائشة، حدثته أن رسول الله  صلى الله عليه وسلم  قال لها ‏\"‏ إن جبرائيل يقرأ عليك السلام ‏\"‏ ‏.‏ قالت وعليه السلام ورحمة الله ‏.‏",
      "text_en": " It was narrated from Abu Salamah that 'Aishah told him that the Messenger of Allah(ﷺ) said to her:                     \"Jibrail send (greetings of) Salam to you.\" She said: \"Wa 'alahisalam wa rahmatullah (and upon him be peace and mercy of Allah).\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20334",
        "11338",
        "11052",
        "10567",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-3707-2",
      "hadith_no": "3707",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن واصل بن السائب، عن أبي سورة، عن أبي أيوب الأنصاري، قال قلنا يا رسول الله هذا السلام فما الاستئناس قال ‏\"‏ يتكلم الرجل تسبيحة وتكبيرة وتحميدة ويتنحنح ويؤذن أهل البيت ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Ayyub Ansari said:                     \"We said: 'O Messenger of Allah(ﷺ), (we know) this (greeting of) Salam, but what does seeking permission to enter mean?' He said: 'It means a man saying SubhanAllah, and Allahu Akbar and Al Hamdulillah, and clearing his throat, announcing his arrival to the people in the house.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20334",
        "33"
      ]
    },
    {
      "id": "sunan-ibn-majah-3762-2",
      "hadith_no": "3762",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، وأبو أسامة عن عبيد الله بن عمر، عن نافع، عن سعيد بن أبي هند، عن أبي موسى، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من لعب بالنرد فقد عصى الله ورسوله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Musa said:                     \"The Messenger of Allah(ﷺ) said: 'Whoever plays backgammon has disobeyed Allah and His Messenger.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20334",
        "20318",
        "11201",
        "11014",
        "11427",
        "41"
      ]
    },
    {
      "id": "sunan-ibn-majah-3773-2",
      "hadith_no": "3773",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الرحيم بن سليمان، عن عاصم، حدثنا مورق العجلي، حدثني عبد الله بن جعفر، قال كان رسول الله  صلى الله عليه وسلم  إذا قدم من سفر تلقي بنا ‏.‏ قال فتلقي بي وبالحسن أو بالحسين ‏.‏ قال فحمل أحدنا بين يديه والآخر خلفه حتى قدمنا المدينة ‏\"‏ ‏.‏",
      "text_en": " Abdullah bin Ja'far said:                     \"Whenever the Messenger of Allah(ﷺ) came back from a journey, he would be met by us(children). (One day) he was met by me and Hasan or Husain. He made one of us ride in front of him and the other behind him, until we came to Al-Madinah.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20334",
        "11080",
        "11308",
        "108"
      ]
    },
    {
      "id": "sunan-ibn-majah-3888",
      "hadith_no": "3888",
      "source": "Sunan Ibn Majah",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر، حدثنا عبد الرحيم بن سليمان، وأبو معاوية عن عاصم، عن عبد الله بن سرجس، قال كان رسول الله  صلى الله عليه وسلم  يقول - وقال عبد الرحيم يتعوذ - إذا سافر ‏\"‏ اللهم إني أعوذ بك من وعثاء السفر وكآبة المنقلب والحور بعد الكور ودعوة المظلوم وسوء المنظر في الأهل والمال ‏\"‏ ‏.‏ وزاد أبو معاوية فإذا رجع قال مثلها ‏.‏",
      "text_en": " It was narrated that ‘Abdullah bin Sarjis said:                      “The Messenger of Allah (ﷺ) used to say” – and (one of the narrators) ‘Abdur-Rahim said: “he used to seek refuge” – “when he traveled: ‘Allahumma inni a’udhu bika min wa’tha’is-safar, wa ka’abatil-munqalab, wal-hawri ba’dal-kawr, wa da’watil-mazlum, wa su’il-manzari fil-ahli wal-mal (O Allah, I seek refuge with You from the hardships of travel and the sorrows of return, from decrease after increase, from the prayer of the one who has been wronged, and seeing some calamity befall my family or wealth).’”(One of the narrators) Abu Mu’awiyah added: “And when he returned he said likewise.”",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "20334",
        "20354",
        "11080",
        "3245"
      ]
    }
  ],
  "total_hadiths": 56
}