{
  "id": "20333",
  "name": "'Abdur Rahman bin Muhammad al-Maharbi عبد الرحمن بن محمد بن زياد المحاربي",
  "full_name": "'Abdur Rahman bin Muhammad al-Maharbi عبد الرحمن بن محمد بن زياد المحاربي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "195",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ع  -  لا بأس به ]"
    ],
    "tags": [
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "18010",
      "name": "Ibrahim bin Muslim al-'Abdi إبراهيم بن مسلم العبدي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20580",
      "name": "Hajjaj bin Artah حجاج بن أرطاة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28232",
      "name": "Salam al-Tawayl سلام الطويل المدائني",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "24224",
      "name": "'Aabad bin Kathir al-Thaqifi عباد بن كثير الثقفي البصري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "22096",
      "name": "'Abdullah bin Sa'id al-Maqbari عبد الله بن سعيد بن أبي سعيد المقبري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11718",
      "name": "Fatr bin Khalifa فطر بن خليفة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11387",
      "name": "Muhammad bin Suqah محمد بن سوقة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11352",
      "name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11068",
      "name": "Ata'a bin al-Sa'ib al-Thaqifi عطاء بن السائب الثقفي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20349",
      "name": "Fadayl bin Ghazwan bin Jarir فضيل بن غزوان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30480",
      "name": "Hanad bin al-Sari bin Mus'ab هناد بن السري بن مصعب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30200",
      "name": "'Abdullah bin Sa'id al-Ashaj عبد الله بن سعيد بن حصين الكندي - الأشج",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38011",
      "name": "Ahmed bin Harb bin Muhammad أحمد بن حرب بن محمد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38409",
      "name": "'Ali bin Muhammad bin Ishaq al-Tanafasi علي بن محمد بن إسحاق الطنافسي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30376",
      "name": "Muhammad bin Salam al-Baykandi محمد بن سلام البيكندي الكبير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30216",
      "name": "Abu Karayb, Muhammad bin al-'Ala' محمد بن العلاء - أبو كريب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "35157",
      "name": "Nsr bin 'Abdur Rahman نصر بن عبد الرحمن بن بكار الناجي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "35158",
      "name": "Harun bin Ishaq bin Muhammad هارون بن إسحاق بن محمد بن مالك",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36540",
      "name": "al-Hasan bin Arfh bin Yazid الحسن بن عرفة بن يزيد",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "97",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "أخبرنا محمد  هو ابن سلام  حدثنا المحاربي، قال حدثنا صالح بن حيان، قال قال عامر الشعبي حدثني أبو بردة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاثة لهم أجران رجل من أهل الكتاب آمن بنبيه، وآمن بمحمد صلى الله عليه وسلم والعبد المملوك إذا أدى حق الله وحق مواليه، ورجل كانت عنده أمة ‏{‏يطؤها‏}‏ فأدبها، فأحسن تأديبها، وعلمها فأحسن تعليمها، ثم أعتقها فتزوجها، فله أجران ‏\"‏‏.‏ثم قال عامر أعطيناكها بغير شىء، قد كان يركب فيما دونها إلى المدينة‏.‏",
      "text_en": "      Narrated Abu Burda's father:                          Allah's Apostle said \"Three persons will have a double reward:     1. A Person from the people of the scriptures who believed in his      prophet (Jesus or Moses) and then believed in the Prophet Muhammad (i      .e. has embraced Islam).     2. A slave who discharges his duties to Allah and his master.     3. A master of a woman-slave who teaches her good manners and educates     her in the best possible way (the religion) and manumits her and then      marries her.\"",
      "chain": [
        "30376",
        "20333",
        "15239",
        "11052",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "966",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا زكرياء بن يحيى أبو السكين، قال حدثنا المحاربي، قال حدثنا محمد بن سوقة، عن سعيد بن جبير، قال كنت مع ابن عمر حين أصابه سنان الرمح في أخمص قدمه، فلزقت قدمه بالركاب، فنزلت فنزعتها وذلك بمنى، فبلغ الحجاج فجعل يعوده فقال الحجاج لو نعلم من أصابك‏.‏ فقال ابن عمر أنت أصبتني‏.‏ قال وكيف قال حملت السلاح في يوم لم يكن يحمل فيه، وأدخلت السلاح الحرم ولم يكن السلاح يدخل الحرم‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     I was with Ibn `Umar when a spear head pierced the sole of his foot and his foot stuck to the paddle of the saddle and I got down and pulled his foot out, and that happened in Mina. Al-Hajjaj got the news and came to inquire about his health and said, \"Alas! If we could only know the man who wounded you!\" Ibn `Umar said, \"You are the one who wounded me.\" Al-Hajjaj said, \"How is that?\" Ibn `Umar said, \"You have allowed the arms to be carried on a day on which nobody used to carry them and you allowed arms to be carried in the Haram even though it was not allowed before.\"",
      "chain": [
        "30193",
        "20333",
        "11387",
        "11050"
      ]
    },
    {
      "hadith_no": "4151",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثنيه أبو سعيد الأشج، حدثنا المحاربي، عن فضيل بن غزوان، بهذا الإسناد ‏.‏ ولم يذكر ‏\"‏ يدا بيد ‏\"‏ ‏.‏",
      "text_en": "  This hadith has been narrated on the authority of Fudail b. Ghazwan with the same chain of transmitters, but he made no mention of (payment being) made on the spot.",
      "chain": [
        "20333"
      ]
    },
    {
      "hadith_no": "2031",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الرحمن بن محمد المحاربي، عن الشيباني، عن واصل الأحدب، عن شقيق، عن شيبة، - يعني ابن عثمان - قال قعد عمر بن الخطاب - رضى الله عنه - في مقعدك الذي أنت فيه فقال لا أخرج حتى أقسم مال الكعبة ‏.‏ قال قلت ما أنت بفاعل ‏.‏ قال بلى لأفعلن ‏.‏ قال قلت ما أنت بفاعل ‏.‏ قال لم قلت لأن رسول الله صلى الله عليه وسلم قد رأى مكانه وأبو بكر - رضى الله عنه - وهما أحوج منك إلى المال فلم يخرجاه ‏.‏ فقام فخرج ‏.‏",
      "text_en": " Shaibah bin ‘Uthman said “‘Umar bin Al Khattab was sitting in the place where you are sitting. He said I shall not go out until I distribute the property of The Ka’bah. I said “You will not do it.” He asked “Why?” I said “For the Apostle of Allaah(ﷺ) and Abu Bakr had seen its place and they were more in need of the property than you, but they did not take it out. He (‘Umar) stood up and went out.”",
      "chain": [
        "30007",
        "20333",
        "11352",
        "11353",
        "2801"
      ]
    },
    {
      "hadith_no": "2903",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا عبد الله بن سعيد الكندي، حدثنا المحاربي، عن جبريل بن أحمر، عن عبد الله بن بريدة، عن أبيه، قال أتى النبي صلى الله عليه وسلم رجل فقال إن عندي ميراث رجل من الأزد ولست أجد أزديا أدفعه إليه ‏.‏ قال ‏\"‏ اذهب فالتمس أزديا حولا ‏\"‏ ‏.‏ قال فأتاه بعد الحول فقال يا رسول الله لم أجد أزديا أدفعه إليه ‏.‏ قال ‏\"‏ فانطلق فانظر أول خزاعي تلقاه فادفعه إليه ‏\"‏ ‏.‏ فلما ولى قال ‏\"‏ على الرجل ‏\"‏ ‏.‏ فلما جاء قال ‏\"‏ انظر كبر خزاعة فادفعه إليه ‏\"‏ ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     A man came to the Messenger of Allah (ﷺ) and said: I have property left by a man of Azd. I do not find any man of Azd to give it to him. He said: Go and look for man of Azd for a year. He then came to him after one year and said: Messenger of Allah, I did not find any man of Azd to give it to him. He said: Look for a man of Khuza'ah whom you meet first and give it to him. When he turned away, he said; Call the man to me. When he came to him, he said: Look for the leading man of Khuza'ah and give it to him.",
      "chain": [
        "30200",
        "20333",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "4652",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا هناد بن السري، عن عبد الرحمن بن محمد المحاربي، عن عبد السلام بن حرب، عن أبي خالد الدالاني، عن أبي خالد، مولى آل جعدة عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أتاني جبريل فأخذ بيدي فأراني باب الجنة الذي تدخل منه أمتي ‏\"‏ ‏.‏ فقال أبو بكر يا رسول الله وددت أني كنت معك حتى أنظر إليه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما إنك يا أبا بكر أول من يدخل الجنة من أمتي ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Gabriel came and taking me by the hand showed the gate of Paradise by which my people will enter. AbuBakr then said: Messenger of Allah! I wish I had been with you so that I might have looked at it. The Messenger of Allah (ﷺ) then said: You, AbuBakr, will be the first of my people to enter Paradise.",
      "chain": [
        "30480",
        "20333",
        "20248",
        "20728",
        "13"
      ]
    },
    {
      "hadith_no": "218",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "قال مجاهد وسئل ابن عباس عن رجل، يصوم النهار ويقوم الليل لا يشهد جمعة ولا جماعة قال هو في النار ‏.‏ قال حدثنا بذلك هناد حدثنا المحاربي عن ليث عن مجاهد ‏.‏ قال ومعنى الحديث أن لا يشهد الجماعة والجمعة رغبة عنها واستخفافا بحقها وتهاونا بها ‏.‏",
      "text_en": " Mujahid said:                     \"Ibn Abbas was asked about a man who fasted during the day and stood (in prayers) during the night, but he did not attend the Friday prayer nor congregational prayer. He replied: 'He is in the Fire.'\"",
      "chain": [
        "20333",
        "20023"
      ]
    },
    {
      "hadith_no": "591",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا هشام بن يونس الكوفي، حدثنا المحاربي، عن الحجاج بن أرطاة، عن أبي إسحاق، عن هبيرة بن يريم، عن علي، وعن عمرو بن مرة، عن ابن أبي ليلى، عن معاذ بن جبل، قالا قال النبي صلى الله عليه وسلم ‏\"‏ إذا أتى أحدكم الصلاة والإمام على حال فليصنع كما يصنع الإمام ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعلم أحدا أسنده إلا ما روي من هذا الوجه ‏.‏ والعمل على هذا عند أهل العلم ‏.‏ قالوا إذا جاء الرجل والإمام ساجد فليسجد ولا تجزئه تلك الركعة إذا فاته الركوع مع الإمام واختار عبد الله بن المبارك أن يسجد مع الإمام وذكر عن بعضهم فقال لعله لا يرفع رأسه في تلك السجدة حتى يغفر له ‏.‏",
      "text_en": " Mu'adh bin Jabal narrated that :                     the Messenger of Allah said: \"When one of you comes to the Salat and (finds) the Imam is in a position, then do as the Imam is doing.\"",
      "chain": [
        "20333",
        "20580",
        "11049",
        "19883",
        "5",
        "11381",
        "11196",
        "32"
      ]
    },
    {
      "hadith_no": "683",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا هناد، حدثنا عبدة، والمحاربي، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صام رمضان وقامه إيمانا واحتسابا غفر له ما تقدم من ذنبه ومن قام ليلة القدر إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏ هذا حديث صحيح ‏.‏ قال أبو عيسى حديث أبي هريرة الذي رواه أبو بكر بن عياش حديث غريب لا نعرفه من رواية أبي بكر بن عياش عن الأعمش عن أبي صالح عن أبي هريرة إلا من حديث أبي بكر ‏.‏  قال وسألت محمد بن إسماعيل عن هذا الحديث، فقال حدثنا الحسن بن الربيع، حدثنا أبو الأحوص، عن الأعمش، عن مجاهد، قوله ‏\"‏ إذا كان أول ليلة من شهر رمضان ‏\"‏ ‏.‏ فذكر الحديث ‏.‏ قال محمد وهذا أصح عندي من حديث أبي بكر بن عياش ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Messenger of Allah said: \"Whoever fasts Ramadan and stands (in the night prayer) for it out of faith and seeking a reward (from Allah), he will be forgiven what preceded of his sins. Whoever stands (in the night prayer) on the Night of Al-Qadr out of faith and seeking a reward (from Allah), he will be forgiven what preceded of his sins.\"",
      "chain": [
        "30480",
        "20337",
        "20333",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "946",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا نصر بن عبد الرحمن الكوفي، حدثنا المحاربي، عن الحجاج بن أرطاة، عن عبد الملك بن المغيرة، عن عبد الرحمن بن البيلماني، عن عمرو بن أوس، عن الحارث بن عبد الله بن أوس، قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ من حج هذا البيت أو اعتمر فليكن آخر عهده بالبيت ‏\"‏ ‏.‏ فقال له عمر خررت من يديك سمعت هذا من رسول الله صلى الله عليه وسلم ولم تخبرنا به ‏.‏ قال وفي الباب عن ابن عباس ‏.‏ قال أبو عيسى حديث الحارث بن عبد الله بن أوس حديث غريب ‏.‏ وهكذا روى غير واحد عن الحجاج بن أرطاة مثل هذا وقد خولف الحجاج في بعض هذا الإسناد ‏.‏",
      "text_en": " Al-Harith bin Abdullah bin Aws said:                     \"I heard the Prophet saying: 'Whoever performs Hajj to this House, or Umrah, then let the last of his acts be at the House'\" So Umar said: \"May your hand be humiliated! You heard this from the Messenger of Allah but did not inform us of it?\"",
      "chain": [
        "20333",
        "20580",
        "18666",
        "19813",
        "11437"
      ]
    },
    {
      "hadith_no": "1542",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Vows and Oaths - كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "20",
      "text_ar": "حدثنا أبو كريب، حدثنا المحاربي، عن شعبة، عن حصين، عن هلال بن يساف، عن سويد بن مقرن المزني، قال لقد رأيتنا سبعة إخوة ما لنا خادم إلا واحدة فلطمها أحدنا فأمرنا النبي صلى الله عليه وسلم أن نعتقها ‏.‏ قال وفي الباب عن ابن عمر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد روى غير واحد هذا الحديث عن حصين بن عبد الرحمن فذكر بعضهم في الحديث قال لطمها على وجهها ‏.‏",
      "text_en": " Narrated Suwaid bin Muqarrin Al-Muzani:                     \"We were seven brothers without a servant except one, and one of us slapped her, so the Prophet (ﷺ) ordered us to free her.\"",
      "chain": [
        "30216",
        "20333",
        "20020",
        "15097",
        "10835",
        "3123"
      ]
    },
    {
      "hadith_no": "2126",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا زياد بن أيوب البغدادي، حدثنا المحاربي، عن الليث، وهو ابن أبي سليم عن عبد الملك، عن عكرمة، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تمار أخاك ولا تمازحه ولا تعده موعدة فتخلفه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏ وعبد الملك عندي هو ابن أبي بشير ‏.‏",
      "text_en": " Ibn Abbas narrated that the Messenger of Allah said:                     \"Do not argue with your brother, do not joke with him, and do not make a promise, only to not fulfill it.\"",
      "chain": [
        "30249",
        "20333",
        "20023",
        "11368",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2354",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو كريب، حدثنا المحاربي، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يدخل فقراء المسلمين الجنة قبل أغنيائهم بنصف يوم وهو خمسمائة عام ‏\"‏ ‏.‏ وهذا حديث صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:                     \"The poor Muslims are admitted into Paradise before their rich by half a day. And that is five hundred years.\"",
      "chain": [
        "30216",
        "20333",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2358",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا المحاربي، حدثنا يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، قال ما شبع رسول الله صلى الله عليه وسلم وأهله ثلاثا تباعا من خبز البر حتى فارق الدنيا ‏.‏ هذا حديث صحيح حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"Neither the Messenger of Allah (s.a.w) nor his family, ate their fill of wheat bread for three consecutive days until he parted the world.\"",
      "chain": [
        "30216",
        "20333",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "2383",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو كريب، حدثني المحاربي، عن عمار بن سيف الضبي، عن أبي معان البصري، عن ابن سيرين، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تعوذوا بالله من جب الحزن ‏\"‏ ‏.‏ قالوا يا رسول الله وما جب الحزن قال ‏\"‏ واد في جهنم تتعوذ منه جهنم كل يوم مائة مرة ‏\"‏ ‏.‏ قلنا يا رسول الله ومن يدخله قال ‏\"‏ القراء المراءون بأعمالهم ‏\"‏ ‏.‏ قال هذا حديث حسن غريب.",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:                     \"Seek refuge in Allah from the Pit of Sorrows.\" They said: \"O Messenger of Allah! What is the Pit of Sorrows?\" He said: \"gorge in Hell from which Hell seeks Allah's refuge a Hundred times every day.\" It was said: \"O Messenger of Allah! Who shall enter it?\" He said: \"The reciters who were showing off with their deeds.\"",
      "chain": [
        "30216",
        "20333",
        "25203",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "2604",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا هناد، ونصر بن عبد الرحمن الكوفي، قال حدثنا المحاربي، عن أبي خالد، يزيد بن عبد الرحمن عن زيد بن أبي أنيسة، عن سعيد المقبري، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ رحم الله عبدا كانت لأخيه عنده مظلمة في عرض أو مال فجاءه فاستحله قبل أن يؤخذ وليس ثم دينار ولا درهم فإن كانت له حسنات أخذ من حسناته وإن لم تكن له حسنات حملوا عليه من سيئاتهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من حديث سعيد المقبري ‏.‏ وقد رواه مالك بن أنس عن سعيد المقبري عن أبي هريرة عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:                     \"May Allah have mercy upon a servant who has wronged his brother in his honor of his wealth, then he comes to him to seek his pattern before (his right) is taken, when he has no Dinar nor Dirham. Then if he has any rewards, it will be taken from his rewards, and if he have no rewards, Then some of his (brothers) bad deeds will be levied upon him.\"",
      "chain": [
        "30480",
        "20333",
        "11340",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "3404",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا هشام بن يونس الكوفي، حدثنا المحاربي، عن ليث، عن أبي الزبير، عن جابر، رضى الله عنه قال كان النبي صلى الله عليه وسلم لا ينام حتى يقرأ بتنزيل السجدة وبتبارك ‏.‏ قال أبو عيسى هكذا روى سفيان وغير واحد هذا الحديث عن ليث عن أبي الزبير عن جابر عن النبي صلى الله عليه وسلم نحوه ‏.‏ وروى زهير هذا الحديث عن أبي الزبير قال قلت له سمعته من جابر قال لم أسمعه من جابر إنما سمعته من صفوان أو ابن صفوان ‏.‏ وروى شبابة عن مغيرة بن مسلم عن أبي الزبير عن جابر نحو حديث ليث ‏.‏",
      "text_en": " Jabir said:                     “The Prophet would not sleep until he reached Tanzil as-Sajdah and Tabarak.”",
      "chain": [
        "20333",
        "20023",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3434",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا نصر بن عبد الرحمن الكوفي، حدثنا المحاربي، عن مالك بن مغول، عن محمد بن سوقة، عن نافع، عن ابن عمر، قال كان يعد لرسول الله صلى الله عليه وسلم في المجلس الواحد مائة مرة من قبل أن يقوم ‏\"‏ رب اغفر لي وتب على إنك أنت التواب الغفور ‏\"‏ ‏.‏ حدثنا ابن أبي عمر، حدثنا سفيان، عن محمد بن سوقة، بهذا الإسناد نحوه بمعناه ‏.‏ قال هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Ibn Umar said:                     “In one sitting of the Messenger of Allah, one could county that he said a hundred time, before he would get up: ‘O my Lord, forgive me, and accept my repentance. Verily, You are the Oft-Returning, the Most Forgiving (Rabbighfirli Watub Alayya Innaka Antat-Tawwabul-Ghaffur).’”",
      "chain": [
        "20333",
        "20358",
        "11387",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3466",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا نصر بن عبد الرحمن الكوفي، حدثنا المحاربي، عن مالك بن أنس، عن سمى، عن أبي صالح، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قال سبحان الله وبحمده مائة مرة غفرت له ذنوبه وإن كانت مثل زبد البحر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Messenger of Allah said: “Whoever says: ‘Glory is to Allah, and with His Praise (Subhan Allah, Wa Bihamdih)’ a hundred times, his sins are forgiven, even if they were like the foam of the sea.”",
      "chain": [
        "20333",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2224",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن إسماعيل بن سمرة، قال حدثنا المحاربي، عن فطر، أخبرني حبيب بن أبي ثابت، عن الحكم بن عتيبة، عن ميمون بن أبي شبيب، عن معاذ بن جبل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الصوم جنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Muadh bin Jabal said:                     \"The Messenger of Allah said: 'Fasting is a shield.\"'",
      "chain": [
        "38475",
        "20333",
        "11331",
        "11069",
        "10834",
        "32"
      ]
    },
    {
      "hadith_no": "2241",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا هارون بن إسحاق، قال حدثنا المحاربي، عن الأعمش، عن إبراهيم، عن علقمة، والأسود، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من استطاع منكم الباءة فليتزوج ومن لم يجد فعليه بالصوم فإنه له وجاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"The Messenger of Allah said: 'Whoever among you can afford to get married, let him do so, and whoever cannot afford it should fast, for it will be a restraint (Wija) for him.\"'",
      "chain": [
        "35158",
        "20333",
        "11060",
        "11051",
        "11017",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "3208",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرني هارون بن إسحاق الهمداني الكوفي، قال حدثنا عبد الرحمن بن محمد المحاربي، عن الأعمش، عن إبراهيم، عن علقمة، والأسود، عن عبد الله، قال قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ من استطاع منكم الباءة فليتزوج ومن لم يستطع فعليه بالصوم فإنه له وجاء ‏\"‏ ‏.‏ قال أبو عبد الرحمن الأسود في هذا الحديث ليس بمحفوظ ‏.‏",
      "text_en": " Narrated 'Alqamah:                     It was narrated from 'Alqamah and Al-Aswad that 'Abdullah said: \"The Messenger of Allah said to us: 'Whoever among you can afford it, let him get married, and whoever cannot then he should fast, for it will be a restraint (wija') for him.'\"  Abu Abdur-Rahman said: (The mention of) Al-Aswad in this hadith is not preserved.",
      "chain": [
        "35158",
        "20333",
        "11060",
        "11051",
        "11017",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "265",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن محمد، ومحمد بن إسماعيل، قالا حدثنا عبد الرحمن بن محمد المحاربي، حدثنا عمار بن سيف، عن أبي معاذ البصري، ح وحدثنا علي بن محمد، حدثنا إسحاق بن منصور، عن عمار بن سيف، عن أبي معاذ، عن ابن سيرين، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ تعوذوا بالله من جب الحزن ‏\"‏ ‏.‏ قالوا يا رسول الله وما جب الحزن قال ‏\"‏ واد في جهنم يتعوذ منه جهنم كل يوم أربعمائة مرة ‏\"‏ ‏.‏ قالوا يا رسول الله ومن يدخله قال ‏\"‏ أعد للقراء المرائين بأعمالهم وإن من أبغض القراء إلى الله الذين يزورون الأمراء ‏\"‏ ‏.‏ قال المحاربي الجورة ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'Seek refuge with Allah from the pit of grief.' They said: 'o Messenger of Allah, what is the pit of grief?' He said: 'A valley in Hell from which Hell itself seeks refuge four hundred times each day.' It was said: 'O Messenger of Allah, who will enter it?' He said: 'It has been prepared for reciters of the Qur'an who want to show off their deeds. The most hateful of reciters of the Qur'an to Allah are those who visit the rulers.'\" (Da'if)Other chains of narrators.",
      "chain": [
        "38409",
        "34188",
        "20333",
        "25203",
        "38409",
        "30313",
        "25203",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "320",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا هارون بن إسحاق، حدثنا عبد الرحمن المحاربي، عن إسماعيل بن مسلم، عن الحسن، وقتادة، عن أنس بن مالك، قال كان النبي  صلى الله عليه وسلم  إذا خرج من الخلاء قال ‏\"‏ الحمد لله الذي أذهب عني الأذى وعافاني ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"Whenever the Prophet exited the toilet, he would say: 'Al-hamdu lillahilladhi adhhaba 'annial-adha wa 'afani (Praise is to Allah Who has relieved me of impurity and given me good health).'\"",
      "chain": [
        "35158",
        "20333",
        "22025",
        "11016",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "554",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو كريب، حدثنا المحاربي، عن معمر بن راشد، عن الزهري، أنبأنا سعيد بن المسيب، عن أبي سعيد الخدري، قال سئل النبي  صلى الله عليه وسلم  عن التشبه في الصلاة فقال ‏\"‏ لا ينصرف حتى يسمع صوتا أو يجد ريحا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"The Prophet was asked about doubts (concerning ablution) during prayer. He said: 'he should not leave until he hears a sound or detects an odor.'\"",
      "chain": [
        "30216",
        "20333",
        "20115",
        "11013",
        "11002",
        "38"
      ]
    },
    {
      "hadith_no": "693",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن سعيد، حدثنا المحاربي، عن سلام بن سليم، - أو سلم شك أبو الحسن وأظنه هو أبو الأحوص - عن حميد، عن أنس، قال كان رسول الله  صلى الله عليه وسلم  وقت للنفساء أربعين يوما إلا أن ترى الطهر قبل ذلك ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"The Messenger of Allah set the time for postnatal bleeding at forty days, except for one who becomes pure before that.\"",
      "chain": [
        "11184",
        "20333",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "1169",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو كريب، حدثنا عبد الرحمن المحاربي، عن إسماعيل بن مسلم، عن الحسن، عن جابر بن عبد الله، أن رجلا، دخل المسجد يوم الجمعة ورسول الله  صلى الله عليه وسلم  يخطب فجعل يتخطى الناس فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ اجلس فقد آذيت وآنيت ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Jabir bin ‘Abdullah that a man entered themosque oneFriday when the Messenger of Allah (ﷺ) was delivering thesermon.He started stepping over the people’s shoulders, and theMessengerof Allah (ﷺ) said:                      ‘Sit down, for you have annoyed(people) andyou are late.’”",
      "chain": [
        "30216",
        "20333",
        "22025",
        "11016",
        "34"
      ]
    },
    {
      "hadith_no": "1499",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا إسحاق بن إبراهيم بن حبيب، ومحمد بن إسماعيل، قالا حدثنا عبد الرحمن المحاربي، عن عبد الله بن سعيد بن أبي سعيد، عن أبيه، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ألزم نعليك قدميك فإن خلعتهما فاجعلهما بين رجليك ولا تجعلهما عن يمينك ولا عن يمين صاحبك ولا وراءك فتؤذي من خلفك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Messenger of Allah (ﷺ)said: ‘Keep your shoes on your feet. If you take them off thenplacethem between your two feet; do not place them to your right, orto theright of your companions, or behind you, for they may annoywhoever isbehind you.’”",
      "chain": [
        "34027",
        "34188",
        "20333",
        "13"
      ]
    },
    {
      "hadith_no": "1516",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا يزيد بن هارون، ح وحدثنا محمد بن إسماعيل، حدثنا المحاربي، جميعا عن محمد بن إسحاق، عن الحارث بن فضيل، عن الزهري، عن عبد الرحمن بن كعب بن مالك، عن أبيه، قال لما حضرت كعبا الوفاة أتته أم بشر بنت البراء بن معرور فقالت يا أبا عبد الرحمن إن لقيت فلانا فاقرأ عليه مني السلام ‏.‏ قال غفر الله لك يا أم بشر نحن أشغل من ذلك ‏.‏ قالت يا أبا عبد الرحمن أما سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ إن أرواح المؤمنين في طير خضر تعلق في شجر الجنة ‏\"‏ ‏.‏ قال بلى ‏.‏ قالت فهو ذاك ‏.‏",
      "text_en": " It wasnarrated from ‘Abdur-Rahman bin Ka’b bin Malik, about Ka’b:                     “When Ka’b was dying, Umm Bishr bint Bara’ bin Ma’rur came tohim andsaid: ‘O Abu ‘Abdur-Rahman! If you meet so-and-so, conveySalam to himfrom me.’ He said: ‘May Allah forgive you, O UmmBishr! We are toobusy to think of that.’ She said: ‘O Abu‘Abdur-Rahman! Did you nothear the Messenger of Allah (ﷺ) say:“The souls of the believers arein green birds, eating from thetrees of Paradise”?’ He said: ‘Yes.’She said: ‘That iswhat I mean.’”",
      "chain": [
        "11222",
        "20472",
        "34188",
        "20333",
        "11107",
        "11835",
        "11013",
        "1134",
        "390"
      ]
    },
    {
      "hadith_no": "1529",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا علي بن محمد، حدثنا عبد الرحمن المحاربي، حدثنا عباد بن كثير، عن عمرو بن خالد، عن حبيب بن أبي ثابت، عن عاصم بن ضمرة، عن علي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من غسل ميتا وكفنه وحنطه وحمله وصلى عليه ولم يفش عليه ما رأى خرج من خطيئته مثل يوم ولدته أمه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Ali that the Messenger of Allah (ﷺ) said:                     “Whoeverwashes a deceased person, shrouds him, embalms him, carrieshim andoffers the funeral prayer for him, and does not disclose whathe hasseen, he will emerge from his sins as on the day his motherborehim.”",
      "chain": [
        "38409",
        "20333",
        "24224",
        "30237",
        "11331",
        "19871",
        "5"
      ]
    },
    {
      "hadith_no": "1570",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا علي بن محمد، حدثنا عبد الرحمن المحاربي، حدثنا الهجري، قال صليت مع عبد الله بن أبي أوفى الأسلمي صاحب رسول الله  صلى الله عليه وسلم  على جنازة ابنة له فكبر عليها أربعا فمكث بعد الرابعة شيئا ‏.‏ قال فسمعت القوم يسبحون به من نواحي الصفوف فسلم ثم قال أكنتم ترون أني مكبر خمسا قالوا تخوفنا ذلك ‏.‏ قال لم أكن لأفعل ‏.‏ ولكن سمعت رسول الله  صلى الله عليه وسلم  كان يكبر أربعا ثم يمكث ساعة فيقول ما شاء الله أن يقول ثم يسلم ‏.‏",
      "text_en": " Al-Hajari said:                      “I prayed with ‘Abdullah bin Abi Awfa Al-Aslami,theCompanion of the Messenger of Allah (ﷺ), offering the funeralprayerfor a daughter of his. He said Takbir over her four times, andhepaused for a while after the fourth. I heard the people sayingSubhan-Allah to him throughout the rows. Then he said the Salam andsaid:‘Did you think that I was going to say a fifth Takbir?’They said: ‘Wewere afraid of that.’ He said: ‘I was not goingto do that, but theMessenger of Allah (ﷺ) used to say four Takbir,then pause for awhile, and he would say whatever Allah willed heshould say, then hewould say the Salam.’”",
      "chain": [
        "38409",
        "20333"
      ]
    },
    {
      "hadith_no": "1608",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا عبد الله بن سعيد، حدثنا عبد الرحمن المحاربي، عن حجاج بن أرطاة، عن عدي بن ثابت، عن زر بن حبيش، عن أبى بن كعب، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من صلى على جنازة فله قيراط ومن شهدها حتى تدفن فله قيراطان والذي نفس محمد بيده القيراط أعظم من أحد هذا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ubayy bin Ka’b that the Messenger of Allah (ﷺ)said:                      ‘Whoever offers the funeral prayer will have one Qirat; andwhoever attends until the burial is over, will have two Qirat. By theOne in Whose Hand is the soul of Muhammad! The Qirat is greater thanthis (mountain of) Uhud.”",
      "chain": [
        "11184",
        "20333",
        "20580",
        "11372",
        "11337",
        "39"
      ]
    },
    {
      "hadith_no": "1619",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا هارون بن إسحاق، حدثنا المحاربي، عن عمرو بن قيس، عن عطية، عن أبي سعيد، أن رسول الله  صلى الله عليه وسلم  أخذ من قبل القبلة واستقبل استقبالا واستل استلالا ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed that the Messenger of Allah (ﷺ) wasbrought into his grave from the direction of the Qiblah, and he wasplaced in his grave gently.",
      "chain": [
        "35158",
        "20333",
        "213",
        "38"
      ]
    },
    {
      "hadith_no": "1634",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن إسماعيل بن سمرة، حدثنا المحاربي، عن الليث بن سعد، عن يزيد بن أبي حبيب، عن أبي الخير، مرثد بن عبد الله اليزني عن عقبة بن عامر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لأن أمشي على جمرة أو سيف أو أخصف نعلي برجلي أحب إلى من أن أمشي على قبر مسلم وما أبالي أوسط القبور قضيت حاجتي أو وسط السوق ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Uqbah bin ‘Amir that the Messenger of Allah(ﷺ)said:                      ‘If I were to walk on a live coal or a sword, or if I weretosew shows to my feet, that would be better for me than walking onthegrave of a Muslim. And I see no difference between relievingmyselfin the midst of graves or in the middle of the marketplace.”",
      "chain": [
        "38475",
        "20333",
        "20023",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "hadith_no": "1932",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو كريب، حدثنا عبد الرحمن المحاربي، وجعفر بن عون، عن الإفريقي، عن عبد الله بن يزيد، عن عبد الله بن عمرو، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا تزوجوا النساء لحسنهن فعسى حسنهن أن يرديهن ولا تزوجوهن لأموالهن فعسى أموالهن أن تطغيهن ولكن تزوجوهن على الدين ولأمة خرماء سوداء ذات دين أفضل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abdullah bin Amr that:                     the Prophet said: “Do not marry women for their beauty for it may lead to their doom. Do not marry them for their wealth, for it may lead them to fall into sin. Rather, marry them for her religion. A black slave woman with piercings who is religious is better.”",
      "chain": [
        "30216",
        "20333",
        "20416",
        "1945",
        "29"
      ]
    },
    {
      "hadith_no": "2529",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو كريب، حدثنا رشدين بن سعد، وعبد الرحمن المحاربي، وأبو أسامة وجعفر بن عون عن ابن أنعم، قال أبو كريب وحدثنا وكيع، عن سفيان، عن ابن أنعم، عن عمران بن عبد المعافري، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الدين يقضى من صاحبه يوم القيامة إذا مات إلا من يدين في ثلاث خلال الرجل تضعف قوته في سبيل الله فيستدين يتقوى به لعدو الله وعدوه ورجل يموت عنده مسلم لا يجد ما يكفنه ويواريه إلا بدين ورجل خاف الله على نفسه العزبة فينكح خشية على دينه فإن الله يقضي عن هؤلاء يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Amr that the Messenger of Allah (ﷺ) said:                     “A debt will be settled on the Day of Resurrection if the one who owes it dies, apart from three: A man who lost his strength fighting in the cause of Allah (SWT), so he borrows in order to become strong again to fighting in the cause of Allah (SWT), so he borrows in order to become strong again to fight the enemy of Allah (SWT) and his enemy. A man who sees a Muslims die and he cannot find anything with which to shroud him except by taking a loan. A man who sees a Muslim die and he cannot find anything with which to shroud him except, by taking a loan. A man who fears Allah (SWT) if he stays single, so he gets married for fear of (losing) his religious commitment. Allah will pay off the debt for these people on the Day of Resurrection.”",
      "chain": [
        "30216",
        "26012",
        "20333",
        "30216",
        "20032",
        "20012",
        "16081",
        "29"
      ]
    },
    {
      "hadith_no": "2672",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا المحاربي، عن محمد بن إسحاق، عن يعقوب بن عبد الله، عن أبي أمامة بن سهل، عن سعد بن عبادة، عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "35047",
        "20333",
        "11107",
        "405",
        "35"
      ]
    },
    {
      "hadith_no": "2888",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا المحاربي، عن عطاء بن السائب، عن أبيه، عن عبد الله بن عمرو، قال أتى رجل رسول الله صلى الله عليه وسلم فقال يا رسول الله إني جئت أريد الجهاد معك أبتغي وجه الله والدار الآخرة ولقد أتيت وإن والدى ليبكيان ‏.‏ قال ‏\"‏ فارجع إليهما فأضحكهما كما أبكيتهما ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin ‘Amr said:                      “A man came to theMessenger of Allah (ﷺ) and said: ‘O Messenger of Allah, I havecomeseeking to go out in Jihad with you, seeking thereby the Face ofAllahand the Hereafter. I have come even though my parents areweeping.’ Hesaid: ‘Go back to them and make them smile as youhave made themweep.’”",
      "chain": [
        "30216",
        "20333",
        "11068",
        "19867",
        "29"
      ]
    },
    {
      "hadith_no": "3235",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا المحاربي، عن الشيباني، عن واصل الأحدب، عن شقيق، قال بعث رجل معي بدراهم هدية إلى البيت ‏.‏ قال فدخلت البيت وشيبة جالس على كرسي فناولته إياها ‏.‏ فقال ألك هذه قلت لا ولو كانت لي لم آتك بها ‏.‏ قال أما لئن قلت ذلك لقد جلس عمر بن الخطاب مجلسك الذي جلست فيه فقال لا أخرج حتى أقسم مال الكعبة بين فقراء المسلمين ‏.‏ قلت ما أنت بفاعل ‏.‏ قال لأفعلن ‏.‏ قال ولم ذاك قلت لأن النبي  صلى الله عليه وسلم  قد رأى مكانه ‏.‏ وأبو بكر وهما أحوج منك إلى المال فلم يحركاه ‏.‏ فقام كما هو فخرج ‏.‏",
      "text_en": " It wasnarrated that Shaqiq said:                      “A man sent some Dirham through metothe House.” He said: “I entered the House and Shaibah was sittingon a chair. I handed it (the money) to him and he said: ‘Is thisyours?’ I said: ‘No, if it were mine I would not have given it toyou.’ He said: ‘Since you say that, ‘Umar was sitting in theplacewhere you are sitting now and said: “I will not go out untilIdistribute the wealth of the poor Muslims.” I said: “You willnot dothat.” He said: “I will certainly do that.” He said:“Why is that?” Isaid: “Because, the Prophet (ﷺ) and Abu Bakrsaw where it was, andthey had more need of the money than you do.But, they did not moveit. Then, he stood up just as he was and wentout.”",
      "chain": [
        "30201",
        "20333",
        "11352",
        "11353"
      ]
    },
    {
      "hadith_no": "3257",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا أبو كريب، حدثنا المحاربي، وعبد الرحيم، عن سفيان الثوري، عن سعيد بن مسروق، وحدثنا الحسين بن علي، عن زائدة، عن سعيد بن مسروق، عن عباية بن رفاعة، عن رافع بن خديج، قال كنا مع رسول الله  صلى الله عليه وسلم  ونحن بذي الحليفة من تهامة فأصبنا إبلا وغنما فعجل القوم فأغلينا القدور قبل أن تقسم فأتانا رسول الله  صلى الله عليه وسلم  فأمر بها فأكفئت ثم عدل الجزور بعشرة من الغنم ‏.‏",
      "text_en": " It wasnarrated that Rafi’ bin Khadij said:                      “We were with theMessengerof Allah (ﷺ) in Dhul-Hulaifah in (the land of) Tihamah. Weacquiredsheep and camels and the people hastened to put cooking potson thefires before they had been distributed. The Messenger of Allah(ﷺ)came to us and ordered that they be overturned,* then he madeonecamel equivalent to ten sheep.”",
      "chain": [
        "30216",
        "20333",
        "20334",
        "20012",
        "20016",
        "20315",
        "20320",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "hadith_no": "3302",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا علي بن محمد، حدثنا عبد الرحمن المحاربي، عن يحيى بن عبيد الله، عن أبيه، عن أبي هريرة، قال حدثني أبو بكر بن أبي قحافة، أن رسول الله  صلى الله عليه وسلم  قال له ولعمر ‏\"‏ انطلقوا بنا إلى الواقفي ‏\"‏ ‏.‏ قال فانطلقنا في القمر حتى أتينا الحائط فقال مرحبا وأهلا ‏.‏ ثم أخذ الشفرة ثم جال في الغنم فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ إياك والحلوب ‏\"‏ ‏.‏ أو قال ‏\"‏ ذات الدر ‏\"‏ ‏.‏",
      "text_en": " AbuHurairah narrated that Abu Bakr bin Abu Quhafah narrated that theMessenger of Allah (ﷺ) said to him and to ‘Umar:                      “Let us go outtoWaqifi.” He said: “So we went out in the moonlight until wecame tothe garden and he (the owner of the garden) said: ‘Welcome.’Then hetook up the knife and went among the sheep (to choose one forslaughter), and the Messenger of Allah (ﷺ) said: ‘Avoid thosethatare lactating.’”",
      "chain": [
        "38409",
        "20333",
        "10841",
        "13"
      ]
    },
    {
      "hadith_no": "3482",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا جبارة بن المغلس، حدثنا المحاربي، حدثنا عبد الرحمن بن نهشل، عن الضحاك بن مزاحم، عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الخير أسرع إلى البيت الذي يؤكل فيه من الشفرة إلى سنام البعير ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)said:                     “Goodness comes more quickly to a house where food is eaten thanaknife to a camel’s hump.”",
      "chain": [
        "35021",
        "20333",
        "19912",
        "17"
      ]
    },
    {
      "hadith_no": "3812",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا نصر بن عبد الرحمن الوشاء، حدثنا عبد الرحمن المحاربي، عن مالك بن أنس، عن سمى، عن أبي صالح، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من قال سبحان الله وبحمده مائة مرة غفرت له ذنوبه ولو كانت مثل زبد البحر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     the Messenger of Allah (ﷺ) said: \"Whoever says: Subhan Allahi wa bi hamdihi (Glory and praise is to Allah) one hundred times, his sins will be forgiven even if they were like the foam of the sea.'\"",
      "chain": [
        "35157",
        "20333",
        "20001",
        "11428",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3814",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو أسامة، والمحاربي، عن مالك بن مغول، عن محمد بن سوقة، عن نافع، عن ابن عمر، قال إن كنا لنعد لرسول الله  صلى الله عليه وسلم  في المجلس يقول ‏\"‏ رب اغفر لي وتب على إنك أنت التواب الغفور ‏\"‏ ‏.‏ مائة مرة ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"We used to count that the Messenger of Allah (saas) said one hundred times in a gathering: 'Rabbighfirli wa tub 'alayya innaka Antat-Tawwabur-Rahim (O Allah forgive me and accept my repentance, for You are the Accepter of repentance, the Most Merciful).'\"",
      "chain": [
        "38409",
        "20318",
        "20333",
        "20358",
        "11387",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4091",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو معاوية، وعبد الرحمن المحاربي، ووكيع، عن الأعمش، عن زيد بن وهب، عن عبد الرحمن بن عبد رب الكعبة، قال انتهيت إلى عبد الله بن عمرو بن العاص وهو جالس في ظل الكعبة والناس مجتمعون عليه فسمعته يقول بينا نحن مع رسول الله  صلى الله عليه وسلم  في سفر إذ نزل منزلا فمنا من يضرب خباءه ومنا من ينتضل ومنا من هو في جشره إذ نادى مناديه الصلاة جامعة فاجتمعنا فقام رسول الله  صلى الله عليه وسلم  فخطبنا فقال ‏\"‏ إنه لم يكن نبي قبلي إلا كان حقا عليه أن يدل أمته على ما يعلمه خيرا لهم وينذرهم ما يعلمه شرا لهم وإن أمتكم هذه جعلت عافيتها في أولها وإن آخرهم يصيبهم بلاء وأمور تنكرونها ثم تجيء فتن يرقق بعضها بعضا فيقول المؤمن هذه مهلكتي ثم تنكشف ثم تجيء فتنة فيقول المؤمن هذه مهلكتي ‏.‏ ثم تنكشف فمن سره أن يزحزح عن النار ويدخل الجنة فلتدركه موتته وهو يؤمن بالله واليوم الآخر وليأت إلى الناس الذي يحب أن يأتوا إليه ومن بايع إماما فأعطاه صفقة يمينه وثمرة قلبه فليطعه ما استطاع فإن جاء آخر ينازعه فاضربوا عنق الآخر ‏\"‏ ‏.‏ قال فأدخلت رأسي من بين الناس فقلت أنشدك الله أنت سمعت هذا من رسول الله  صلى الله عليه وسلم  قال فأشار بيده إلى أذنيه فقال سمعته أذناى ووعاه قلبي ‏.‏",
      "text_en": " It was narrated that ‘Abdur-Rahman bin ‘Abd Rabbil-Ka’bah said:                     “I came to ‘Abdullah bin ‘Amr bin ‘As when he was sitting inthe shade of the Ka’bah, and the people were gathered around him,and I heard him say: ‘While we were with the Messenger of Allah(ﷺ) on a journey, he stopped to camp and some of us were pitchingtents, some were competing in shooting arrows and some were takingthe animals out to graze them. Then his caller called out: “As-SalatuJami’ah (prayer is about to begin).” So we gathered, and theMessenger of Allah (ﷺ) stood up and addressed us. He said: “Therehas never been a Prophet before me who was not obliged to tell hisnation of what he knew was good for them, and to warn against what heknew was bad for them. With regard to this nation of yours, soundness(of religious commitment) and well-being has been placed in itsearlier generations and the last of them will be afflicted withcalamities and things that you dislike. Then there will cometribulations which will make the earlier ones pale into significance,and the believer will say: ‘This will be the end of me,’ thenrelief will come. Then (more) tribulations will come and the believerwill say: ‘This will be the end of me,’ then relief will come.Whoever would like to be taken far away from Hell and admitted toParadise, let him die believing in Allah and the Last Day, and lethim treat people as he would like to be treated. Whoever gives hisoath of allegiance to a ruler and gives a sincere promise, let himobey him as much as he can, and if another comes and challenges him,let them strike the neck (i.e., kill) the second one.’” He the narrator said: “I raised my head among the people and said: 'I adjure you by Allah, did you hear that from the Messenger of Allah (ﷺ)?' He ('Abdullah bin 'Amr bin Al-'As) pointed with his hand to his ears and said: I heard it directly from him and memorized it.'”",
      "chain": [
        "30216",
        "20354",
        "20333",
        "20032",
        "11060",
        "11341"
      ]
    },
    {
      "hadith_no": "4215",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا علي بن محمد، حدثنا عبد الرحمن المحاربي، عن إسماعيل بن رافع أبي رافع، عن أبي زرعة السيباني، يحيى بن أبي عمرو عن أبي أمامة الباهلي، قال خطبنا رسول الله  صلى الله عليه وسلم  فكان أكثر خطبته حديثا حدثناه عن الدجال وحذرناه فكان من قوله أن قال ‏\"‏ إنه لم تكن فتنة في الأرض منذ ذرأ الله ذرية آدم أعظم من فتنة الدجال وإن الله لم يبعث نبيا إلا حذر أمته الدجال وأنا آخر الأنبياء وأنتم آخر الأمم وهو خارج فيكم لا محالة وإن يخرج وأنا بين ظهرانيكم فأنا حجيج لكل مسلم وإن يخرج من بعدي فكل امرئ حجيج نفسه والله خليفتي على كل مسلم وإنه يخرج من خلة بين الشام والعراق فيعيث يمينا ويعيث شمالا ‏.‏ يا عباد الله أيها الناس فاثبتوا فإني سأصفه لكم صفة لم يصفها إياه نبي قبلي إنه يبدأ فيقول أنا نبي ولا نبي بعدي ثم يثني فيقول أنا ربكم ‏.‏ ولا ترون ربكم حتى تموتوا وإنه أعور وإن ربكم ليس بأعور وإنه مكتوب بين عينيه كافر يقرؤه كل مؤمن كاتب أو غير كاتب وإن من فتنته أن معه جنة ونارا فناره جنة وجنته نار فمن ابتلي بناره فليستغث بالله وليقرأ فواتح الكهف فتكون عليه بردا وسلاما كما كانت النار على إبراهيم وإن من فتنته أن يقول لأعرابي أرأيت إن بعثت لك أباك وأمك أتشهد أني ربك فيقول نعم ‏.‏ فيتمثل له شيطانان في صورة أبيه وأمه فيقولان يا بنى اتبعه فإنه ربك ‏.‏ وإن من فتنته أن يسلط على نفس واحدة فيقتلها وينشرها بالمنشار حتى يلقى شقتين ثم يقول انظروا إلى عبدي هذا فإني أبعثه الآن ثم يزعم أن له ربا غيري ‏.‏ فيبعثه الله ويقول له الخبيث من ربك فيقول ربي الله وأنت عدو الله أنت الدجال والله ما كنت بعد أشد بصيرة بك مني اليوم ‏\"‏ ‏.‏ قال أبو الحسن الطنافسي فحدثنا المحاربي حدثنا عبيد الله بن الوليد الوصافي عن عطية عن أبي سعيد قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ذلك الرجل أرفع أمتي درجة في الجنة ‏\"‏ ‏.‏ قال قال أبو سعيد والله ما كنا نرى ذلك الرجل إلا عمر بن الخطاب حتى مضى لسبيله ‏.‏ قال المحاربي ثم رجعنا إلى حديث أبي رافع قال ‏\"‏ وإن من فتنته أن يأمر السماء أن تمطر فتمطر ويأمر الأرض أن تنبت فتنبت وإن من فتنته أن يمر بالحى فيكذبونه فلا تبقى لهم سائمة إلا هلكت وإن من فتنته أن يمر بالحى فيصدقونه فيأمر السماء أن تمطر فتمطر ويأمر الأرض أن تنبت فتنبت حتى تروح مواشيهم من يومهم ذلك أسمن ما كانت وأعظمه وأمده خواصر وأدره ضروعا وإنه لا يبقى شىء من الأرض إلا وطئه وظهر عليه إلا مكة والمدينة لا يأتيهما من نقب من نقابهما إلا لقيته الملائكة بالسيوف صلتة حتى ينزل عند الظريب الأحمر عند منقطع السبخة فترجف المدينة بأهلها ثلاث رجفات فلا يبقى منافق ولا منافقة إلا خرج إليه فتنفي الخبث منها كما ينفي الكير خبث الحديد ويدعى ذلك اليوم يوم الخلاص ‏\"‏ ‏.‏ فقالت أم شريك بنت أبي العكر يا رسول الله فأين العرب يومئذ قال ‏\"‏ هم يومئذ قليل وجلهم ببيت المقدس وإمامهم رجل صالح فبينما إمامهم قد تقدم يصلي بهم الصبح إذ نزل عليهم عيسى ابن مريم الصبح فرجع ذلك الإمام ينكص يمشي القهقرى ليتقدم عيسى يصلي بالناس فيضع عيسى يده بين كتفيه ثم يقول له تقدم فصل فإنها لك أقيمت ‏.‏ فيصلي بهم إمامهم فإذا انصرف قال عيسى عليه السلام افتحوا الباب ‏.‏ فيفتح ووراءه الدجال معه سبعون ألف يهودي كلهم ذو سيف محلى وساج فإذا نظر إليه الدجال ذاب كما يذوب الملح في الماء وينطلق هاربا ويقول عيسى عليه السلام إن لي فيك ضربة لن تسبقني بها ‏.‏ فيدركه عند باب اللد الشرقي فيقتله فيهزم الله اليهود فلا يبقى شىء مما خلق الله يتوارى به يهودي إلا أنطق الله ذلك الشىء لا حجر ولا شجر ولا حائط ولا دابة - إلا الغرقدة فإنها من شجرهم لا تنطق - إلا قال يا عبد الله المسلم هذا يهودي فتعال اقتله ‏\"‏ ‏.‏ قال رسول الله  صلى الله عليه وسلم  ‏\"‏ وإن أيامه أربعون سنة السنة كنصف السنة والسنة كالشهر والشهر كالجمعة وآخر أيامه كالشررة يصبح أحدكم على باب المدينة فلا يبلغ بابها الآخر حتى يمسي ‏\"‏ ‏.‏ فقيل له يا رسول الله كيف نصلي في تلك الأيام القصار قال ‏\"‏ تقدرون فيها الصلاة كما تقدرونها في هذه الأيام الطوال ثم صلوا ‏\"‏ ‏.‏ قال رسول الله  صلى الله عليه وسلم  ‏\"‏ فيكون عيسى ابن مريم عليه السلام في أمتي حكما عدلا وإماما مقسطا يدق الصليب ويذبح الخنزير ويضع الجزية ويترك الصدقة فلا يسعى على شاة ولا بعير وترفع الشحناء والتباغض وتنزع حمة كل ذات حمة حتى يدخل الوليد يده في في الحية فلا تضره وتفر الوليدة الأسد فلا يضرها ويكون الذئب في الغنم كأنه كلبها وتملأ الأرض من السلم كما يملأ الإناء من الماء وتكون الكلمة واحدة فلا يعبد إلا الله وتضع الحرب أوزارها وتسلب قريش ملكها وتكون الأرض كفاثور الفضة تنبت نباتها بعهد آدم حتى يجتمع النفر على القطف من العنب فيشبعهم ويجتمع النفر على الرمانة فتشبعهم ويكون الثور بكذا وكذا من المال وتكون الفرس بالدريهمات ‏\"‏ ‏.‏ قالوا يا رسول الله وما يرخص الفرس قال ‏\"‏ لا تركب لحرب أبدا ‏\"‏ ‏.‏ قيل له فما يغلي الثور قال ‏\"‏ تحرث الأرض كلها وإن قبل خروج الدجال ثلاث سنوات شداد يصيب الناس فيها جوع شديد يأمر الله السماء في السنة الأولى أن تحبس ثلث مطرها ويأمر الأرض فتحبس ثلث نباتها ثم يأمر السماء في السنة الثانية فتحبس ثلثى مطرها ويأمر الأرض فتحبس ثلثى نباتها ثم يأمر الله السماء في السنة الثالثة فتحبس مطرها كله فلا تقطر قطرة ويأمر الأرض فتحبس نباتها كله فلا تنبت خضراء فلا تبقى ذات ظلف إلا هلكت إلا ما شاء الله ‏\"‏ ‏.‏ قيل فما يعيش الناس في ذلك الزمان قال ‏\"‏ التهليل والتكبير والتسبيح والتحميد ويجرى ذلك عليهم مجرى الطعام ‏\"‏ ‏.‏ قال أبو عبد الله سمعت أبا الحسن الطنافسي يقول سمعت عبد الرحمن المحاربي يقول ينبغي أن يدفع هذا الحديث إلى المؤدب حتى يعلمه الصبيان في الكتاب ‏.‏",
      "text_en": " It was narrated that Abu Umamah Al-Bahili said:                      \"The Messengerof Allah (ﷺ) addressed us, and most of his speech had to do withtelling us about Dajjal. He warned about him, and among the things hesaid was: 'There will not be any tribulation on earth, since the timeAllah created the offspring of Adam, that will be greater than thetribulation of Dajjal. Allah has not sent any Prophet but he warnedhis nation about Dajjal. I am the last of the Prophets, and you arethe last of the nations. He will undoubtedly appear among you. If heappears while I am among you, I will contend with him on behalf ofevery Muslim, and if he appears while I am not among you, then eachman must fend for himself and Allah will take care of every Muslim onmy behalf. He will emerge from Al-Khallah, between Sham and Iraq, andwill wreak havoc right and left. O slaves of Allah, remain steadfast.I will describe him to you in a manner in which none of the Prophetshas described him before me. He will start by saying \"I am aProphet,\" and there is no Prophet after me. Then a second timehe will say: \"I am your Lord.\" But you will not see yourLord until you die. He is one-eyed, and your Lord is not one-eyed,and written between his eyes is Kafir. Every believer will read it,whether he is literate or illiterate. Part of his Fitnah will be thathe will have with him Paradise and Hell, but his Hell will be aParadise and his Paradise a Hell. Whoever is tested with his fire(hell), let him seek the help of Allah and recite the first Verses ofAl-Kahf, then it will be cool and safe for him, as the fire was forIbrahim. Part of his Fitnah will be that he will say to a Bedouin:\"What do you think, if I resurrect your father and mother foryou, will you bear witness that I am your Lord?\" He will say:\"Yes.\" Then two devils will appear to him in the form ofhis father and mother and will say: \"O my son, follow him, forhe is your Lord.\" And part of his Fitnah will be that he willoverpower a single soul and kill him, then he will cut him with a sawuntil he falls in two pieces. Then he will say: \"Look at thisslave of mine; I will resurrect him now, then he will claim that hehas a Lord other than me.\" Then Allah will resurrect him and theevil one will say to him: \"Who is your Lord?\" and he willsay: \"Allah is my Lord, and you are the enemy of Allah, you areDajjal. By Allah, I have never had more insight about you than I havetoday.\"(An addition) Abul-Hasan Tanafisi said: \"Muharibi told us: 'Ubaidullah bin al-Walid Al-Wassafi told us, from 'Atiyyah, that Abu Sa'eed said: \"The Messenger of Allah (ﷺ) said: 'That man will be the highest in status in my nation in Paradise'\" - He said: \"Abu Sa'eed said: 'By Allah, we did not think that man would be anyone other than 'Umar bin Khattab, until he passed away. -  Muharibi said: \"Then we went back to the narration of Abu Rafi'.\" He said: - 'Part of his Fitnah will be that he will command the sky to rain, and it will rain, and he will command the earth to bring forth vegetation and it will do so. And part of his Fitnah will be that he will pass by a clan and they will disbelieve in him, so all their flocks will perish and none will be left. And part of his Fitnah will be that he will pass by a clan who will believe in him, so he will command the sky to rain, and it will rain, and he will command the earth to bring forth vegetation and it will do so, until their flocks will come back in the evening of that day, bigger and fatter than they have ever been, with their flanks stretched and their udders full of milk. There will be no part of the earth left that he does not enter and prevail over, except for Makkah and Al-Madinah, for he will not approach them on any of their mountain paths but he will be met by angels with unsheathed swords, until he will stop at the red hill at the end of the marsh. Then Al-Madinah will be shaken with its people three times, and no hypocrite, male or female, will be left, all will come out to him. Thus it will be cleansed of impurity just as the bellows cleanses the iron of dross. And that day will be called the Day of Deliverance.'\"Umm Sharik bint Abi 'akar said: 'O Messenger of Allah, where will the Arabs be that day?' He said: 'On that day they will be few, and most of them will be in Baitul-Maqdis (Jerusalem), and their leader will be a righteous man. When their leader has stepped forward to lead them in subh prayer, 'Eisa bin Maryam will come down to them. Their leader will step backwards so that 'Eisa can come forward and lead the people in prayer, but 'Eisa will place his hand between his shoulders and say to him: \"Go forward and pray, for the Iqamah was given for you.\" Then their leader will lead them in prayer. When he has finished, 'Eisa (as), will say: \"Open the gate.\" So they will open it and behind it will be Dajjal with seventy thousand Jews, each of them carrying an adorned sword and wearing a greenish cloak. When Dajjal looks at him, he will start to melt as salt melts in water. He will run away, and 'Eisa (as), will say: \"I have only one blow for you, which you will not be able to escape!\" He will catch up with him at the eastern gate of Ludd, and will kill him. Then Allah will defeat the Jews, and there will be nothing left that Allah has created which the Jews will be able to hide behind, except that Allah will cause it to speak - no stone, no tree, no wall, no animal - except for Al-Gharqad (the box-thorn), for it is one of their trees, and will not speak - except that it will say: \"O Muslim slave of Allah, here is a Jews, come and kill him!\"\"The Messenger of Allah (ﷺ) said: 'His (Dajjal's) days will number forty years: a year like half a year, a year like a month, a month like a week, and the rest of his days will be like sparks from a fire (i.e., they will pass quickly). One of you will enter the gate of Al-Madinah in the morning and not reach its other gate until evening comes.' It was said: 'O Messenger of Allah, how should we pray on those short days?' He said: 'Estimate (the times of) the prayer, as you do on these long days, then pray.' The Messenger of Allah (ﷺ) said: \"Eisa bin Maryam (as), will be a just judge and a just ruler among my nation. He will break the cross, slaughter the pigs, abolish the Jizyah and charity will be left. No one will be appointed to (collect the Zakah of) sheep and camels. Grudges and mutual hatred will disappear and the venom of every venomous creature will be removed, so that a baby boy will but his hand in a snake and it will not harm him, and a baby girl will make a lion run away, and it will not harm her; and the wolf will be among the sheep like their sheepdog. The earth will be filled with peace just as a vessel is filled with water. The people will be united and none will be worshipped except Allah. War will cease and Quraish will no longer be in power. The earth will be like a silver platter, with its vegetation growing as it did at the time of Adam, until a group of people will gather around one bunch of grapes and it will suffice them, and a group will gather around a single pomegranate and it will suffice them. An ox will be sold for such and such amount of money, and a horse will be sold for a few Dirham.' They said: 'O Messenger of Allah, why will horses be so cheap?' He said: 'They will never be ridden in war again.' It was said to him: 'Why will oxen be so expensive?' He said: 'Because all the land will be tilled. Before Dajjal appears there will be three difficult years in which the people will suffer severe famine. In the first year, Allah will command the sky to withhold one third of its rain and the earth to withhold one third of its produce. In the second year, He will command the sky to withhold two thirds of its rain and the earth to withhold two-thirds of its produce. In the third year, he will command the sky to withhold all of its rain, and not a single drop will fall, and the earth to withhold all of its produce, and nothing will grow. All cloven-hoofed animals will die, except those that Allah wills.' It was said: 'What will the people live on at that time?' He said: 'Tahlil, Takbir, Tasbih and Tahmid. That will take the place of food for them.'\"Abu 'Abdullah (Ibn Majah) said: \"I heard Abul-Hasan Tanafisi say: 'I heard 'Abdur-Rahman Al-Muharibi say: \"This Hadith should be sent to every teacher so that they can teach it to the children in the schools.\"",
      "chain": [
        "38409",
        "20333",
        "22024",
        "4048"
      ]
    }
  ],
  "total_hadiths": 46
}