{
  "id": "20337",
  "name": "'Abdah bin Sulaiman al-Klabi عبدة بن سليمان الكلابي أبو محمد الكوفي",
  "full_name": "'Abdah bin Sulaiman al-Klabi عبدة بن سليمان الكلابي أبو محمد الكوفي",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "187",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-Kalabi",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11863",
      "name": "Talha bin Yahya bin Talha طلحة بن يحيى بن طلحة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11073",
      "name": "Sa'id bin Abi 'Aruba سعيد بن أبي عروبة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20166",
      "name": "'Abdul 'Aziz bin 'Umar bin 'Abdul-'Aziz عبد العزيز بن عمر بن عبد العزيز",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11220",
      "name": "Muhammad bin 'Amr bin 'Alqama محمد بن عمرو بن علقمة",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30309",
      "name": "Ibrahim bin Musa al-Razi al-Fara' إبراهيم بن موسى الرازي الفراء",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30263",
      "name": "'Amr bin Muhammad bin Bukayr عمرو بن محمد بن بكير الناقد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30470",
      "name": "'Ali bin al-Hasan bin Sulaiman علي بن الحسن بن سليمان الحضرمي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30376",
      "name": "Muhammad bin Salam al-Baykandi محمد بن سلام البيكندي الكبير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30216",
      "name": "Abu Karayb, Muhammad bin al-'Ala' محمد بن العلاء - أبو كريب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30212",
      "name": "Muhammad bin 'Abdullah bin Numayr محمد بن عبد الله بن نمير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30480",
      "name": "Hanad bin al-Sari bin Mus'ab هناد بن السري بن مصعب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30200",
      "name": "'Abdullah bin Sa'id al-Ashaj عبد الله بن سعيد بن حصين الكندي - الأشج",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "20",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سلام، قال أخبرنا عبدة، عن هشام، عن أبيه، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا أمرهم أمرهم من الأعمال بما يطيقون قالوا إنا لسنا كهيئتك يا رسول الله، إن الله قد غفر لك ما تقدم من ذنبك وما تأخر‏.‏ فيغضب حتى يعرف الغضب في وجهه ثم يقول ‏\"‏ إن أتقاكم وأعلمكم بالله أنا ‏\"‏‏.‏",
      "text_en": "      Narrated 'Aisha:                          Whenever Allah's Apostle ordered the Muslims to do something, he used      to order them deeds which were easy for them to do, (according to      their strength endurance). They said, \"O Allah's Apostle! We are not      like you. Allah  has forgiven your past and future sins.\" So Allah's      Apostle became angry and it was apparent on his face. He said, \"I am      the most Allah fearing, and know Allah better than all of you do.\"",
      "chain": [
        "30376",
        "20337",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "94",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا عبدة، قال حدثنا عبد الصمد، قال حدثنا عبد الله بن المثنى، قال حدثنا ثمامة بن عبد الله، عن أنس، عن النبي صلى الله عليه وسلم أنه كان إذا سلم سلم ثلاثا، وإذا تكلم بكلمة أعادها ثلاثا‏.‏",
      "text_en": " Narrated Anas:                     Whenever the Prophet asked permission to enter, he knocked the door thrice with greeting and whenever he spoke a sentence (said a thing) he used to repeat it thrice. (See Hadith No. 261, Vol. 8).",
      "chain": [
        "20337",
        "20250",
        "11599",
        "11270",
        "19"
      ]
    },
    {
      "hadith_no": "434",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد، قال أخبرنا عبدة، عن هشام بن عروة، عن أبيه، عن عائشة، أن أم سلمة، ذكرت لرسول الله صلى الله عليه وسلم كنيسة رأتها بأرض الحبشة يقال لها مارية، فذكرت له ما رأت فيها من الصور، فقال رسول الله صلى الله عليه وسلم ‏\"‏ أولئك قوم إذا مات فيهم العبد الصالح  أو الرجل الصالح  بنوا على قبره مسجدا، وصوروا فيه تلك الصور، أولئك شرار الخلق عند الله ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Um Salama told Allah's Apostle about a church which she had seen in Ethiopia and which was called Mariya. She told him about the pictures which she had seen in it. Allah's Apostle said, \"If any righteous pious man dies amongst them, they would build a place of worship at his grave and make these pictures in it; they are the worst creatures in the sight of Allah.\"",
      "chain": [
        "30213",
        "20337",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "588",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن سلام، قال حدثنا عبدة، عن عبيد الله، عن خبيب، عن حفص بن عاصم، عن أبي هريرة، قال نهى رسول الله صلى الله عليه وسلم عن صلاتين بعد الفجر حتى تطلع الشمس، وبعد العصر حتى تغرب الشمس‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle forbade the offering of two prayers: -1. after the morning prayer till the sunrises. -2. after the `Asr prayer till the sun sets.",
      "chain": [
        "30376",
        "20337",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "hadith_no": "729",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد، قال أخبرنا عبدة، عن يحيى بن سعيد الأنصاري، عن عمرة، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصلي من الليل في حجرته، وجدار الحجرة قصير، فرأى الناس شخص النبي صلى الله عليه وسلم فقام أناس يصلون بصلاته، فأصبحوا فتحدثوا بذلك، فقام ليلة الثانية، فقام معه أناس يصلون بصلاته، صنعوا ذلك ليلتين أو ثلاثة، حتى إذا كان بعد ذلك جلس رسول الله صلى الله عليه وسلم فلم يخرج، فلما أصبح ذكر ذلك الناس فقال ‏\"‏ إني خشيت أن تكتب عليكم صلاة الليل ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle used to pray in his room at night. As the wall of the room was LOW, the people saw him and some of them stood up to follow him in the prayer. In the morning they spread the news. The following night the Prophet stood for the prayer and the people followed him. This went on for two or three nights. Thereupon Allah's Apostle did not stand for the prayer the following night, and did not come out. In the morning, the people asked him about it. He replied, that he way afraid that the night prayer might become compulsory.",
      "chain": [
        "30213",
        "20337",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "1454",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا صدقة بن الفضل، أخبرنا عبدة، عن هشام، عن فاطمة، عن أسماء  رضى الله عنها  قالت قال لي النبي صلى الله عليه وسلم ‏\"‏ لا توكي فيوكى عليك ‏\"‏‏.‏ حدثنا عثمان بن أبي شيبة، عن عبدة، وقال، ‏\"‏ لا تحصي فيحصي الله عليك ‏\"‏",
      "text_en": " Narrated Asma:                     The Prophet said to me, \"Do not withhold your money, (for if you did so) Allah would withhold His blessings from you.\"Narrated `Abda:The Prophet said, \"Do not withhold your money by counting it (i.e. hoarding it), (for if you did so), Allah would also withhold His blessings from you.\"",
      "chain": [
        "30343",
        "20337",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "1490",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا عبدة، عن هشام، عن أبيه، عن زينب ابنة أم سلمة، ‏{‏عن أم سلمة،‏}‏ قالت قلت يا رسول الله ألي أجر أن أنفق على بني أبي سلمة إنما هم بني‏.‏ فقال ‏\"‏ أنفقي عليهم، فلك أجر ما أنفقت عليهم ‏\"‏‏.‏",
      "text_en": " Narrated Zainab:                     (the daughter of Um Salama) My mother said, \"O Allah's Apostle! Shall I receive a reward if I spend for the sustenance of Abu Salama's offspring, and in fact they are also my sons?\" The Prophet replied, \"Spend on them and you will get a reward for what you spend on them.\"",
      "chain": [
        "30203",
        "20337",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "1964",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عثمان بن أبي شيبة، ومحمد، قالا أخبرنا عبدة، عن هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  قالت نهى رسول الله صلى الله عليه وسلم عن الوصال، رحمة لهم فقالوا إنك تواصل‏.‏ قال ‏\"‏ إني لست كهيئتكم، إني يطعمني ربي ويسقين ‏\"‏‏.‏ قال أبو عبد الله لم يذكر عثمان رحمة لهم‏.‏",
      "text_en": " Narrated Aisha:                     Allah's Apostle forbade Al-Wisal out of mercy to them. They said to him, \"But you practice Al- Wisal?\" He said, \"I am not similar to you, for my Lord gives me food and drink. \"",
      "chain": [
        "30203",
        "30213",
        "20337",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2020",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Night of Qadr - كتاب فضل ليلة القدر",
      "chapter_no": "32",
      "text_ar": "حدثني محمد، أخبرنا عبدة، عن هشام بن عروة، عن أبيه، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يجاور في العشر الأواخر من رمضان، ويقول ‏\"‏ تحروا ليلة القدر في العشر الأواخر من رمضان ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle used to practice I`tikaf in the last ten nights of Ramadan and used to say, \"Look for the Night of Qadr in the last ten nights of the month of Ramadan.\"",
      "chain": [
        "30213",
        "20337",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2574",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا إبراهيم بن موسى، حدثنا عبدة، حدثنا هشام، عن أبيه، عن عائشة  رضى الله عنها  أن الناس، كانوا يتحرون بهداياهم يوم عائشة، يبتغون بها  أو يبتغون بذلك  مرضاة رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Aisha:                     The people used to look forward for the days of my (`Aisha's) turn to send gifts to Allah's Apostle in order to please him.",
      "chain": [
        "30309",
        "20337",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2813",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد، أخبرنا عبدة، عن هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها أن رسول الله صلى الله عليه وسلم لما رجع يوم الخندق ووضع السلاح واغتسل، فأتاه جبريل وقد عصب رأسه الغبار فقال وضعت السلاح، فوالله ما وضعته‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فأين ‏\"‏‏.‏ قال ها هنا‏.‏ وأومأ إلى بني قريظة‏.‏ قالت فخرج إليهم رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Aisha:                     When Allah's Apostle returned on the day (of the battle) of Al-Khandaq (i.e. Trench), he put down his arms and took a bath. Then Gabriel whose head was covered with dust, came to him saying, \"You have put down your arms! By Allah, I have not put down my arms yet.\" Allah's Apostle said, \"Where (to go now)?\" Gabriel said, \"This way,\" pointing towards the tribe of Bani Quraiza. So Allah's Apostle went out towards them .",
      "chain": [
        "30213",
        "20337",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2983",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا صدقة بن الفضل، أخبرنا عبدة، عن هشام، عن وهب بن كيسان، عن جابر  رضى الله عنه  قال خرجنا ونحن ثلاثمائة نحمل زادنا على رقابنا، ففني زادنا، حتى كان الرجل منا يأكل في كل يوم تمرة‏.‏ قال رجل يا أبا عبد الله، وأين كانت التمرة تقع من الرجل قال لقد وجدنا فقدها حين فقدناها، حتى أتينا البحر فإذا حوت قد قذفه البحر، فأكلنا منها ثمانية عشر يوما ما أحببنا‏.‏",
      "text_en": " Narrated Wahb bin Kaisan:                     Jabir bin `Abdullah said, \"We set out, and we were three-hundred men carrying our journey-food on our shoulders. Then we began to eat a single date each per day.\" A man asked (Jabir), \"O Abu `Abdullah! How could a person be satisfied with a single date?\" Jabir replied, \"We realized the value of that one date when we could not even have that much till we reached the sea-shore, when all of a sudden we saw a huge fish cast by the sea. So, we ate of it as much as we wished for eighteen days.\"",
      "chain": [
        "30343",
        "20337",
        "11065",
        "11231",
        "34"
      ]
    },
    {
      "hadith_no": "3273",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمد، أخبرنا عبدة، عن هشام بن عروة، عن أبيه، عن ابن عمر  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا طلع حاجب الشمس فدعوا الصلاة حتى تبرز، وإذا غاب حاجب الشمس فدعوا الصلاة حتى تغيب ‏\"‏‏.‏ ‏\"‏ ولا تحينوا بصلاتكم طلوع الشمس ولا غروبها، فإنها تطلع بين قرنى شيطان ‏\"‏‏.‏ أو الشيطان‏.‏ لا أدري أى ذلك قال هشام‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"When the (upper) edge of the sun appears (in the morning), don't perform a prayer till the sun appears in full, and when the lower edge of the sun sets, don't perform a prayer till it sets completely. And you should not seek to pray at sunrise or sunset for the sun rises between two sides of the head of the devil (or Satan).",
      "chain": [
        "30213",
        "20337",
        "11065",
        "10511",
        "18"
      ]
    },
    {
      "hadith_no": "3390",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "أخبرني عبدة، حدثنا عبد الصمد، عن عبد الرحمن، عن أبيه، عن ابن عمر  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ الكريم ابن الكريم ابن الكريم ابن الكريم يوسف بن يعقوب بن إسحاق بن إبراهيم عليهم السلام ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                      The Prophet said, \"The honorable, the son of the honorable, the son of the honorable, (was) Joseph, the son of Jacob! the son of Isaac, the son of Abraham.\"",
      "chain": [
        "20337",
        "20250",
        "20033",
        "18"
      ]
    },
    {
      "hadith_no": "3571",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني عثمان بن أبي شيبة، حدثنا عبدة، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت استأذن حسان النبي صلى الله عليه وسلم في هجاء المشركين، قال ‏\"‏ كيف بنسبي ‏\"‏‏.‏ فقال حسان لأسلنك منهم كما تسل الشعرة من العجين‏.‏ وعن أبيه قال ذهبت أسب حسان عند عائشة فقالت لا تسبه فإنه كان ينافح عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Aisha:                     Once Hassan bin Thabit asked the permission of the Prophet to lampoon (i.e. compose satirical poetry defaming) the infidels. The Prophet said, \"What about the fact that I have common descent with them?\" Hassan replied, \"I shall take you out of them as a hair is taken out of dough.\" Narrated `Urwa: I started abusing Hassan in front of `Aisha, whereupon she said. \"Don't abuse him, for he used to defend the Prophet (with his poetry).",
      "chain": [
        "30203",
        "20337",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3863",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني محمد، أخبرنا عبدة، عن هشام بن عروة، عن أبيه، قال سمعت عبد الله بن جعفر، قال سمعت عليا  رضى الله عنه  يقول سمعت رسول الله صلى الله عليه وسلم يقول حدثني صدقة أخبرنا عبدة عن هشام عن أبيه قال سمعت عبد الله بن جعفر عن علي  رضى الله عنهم  عن النبي صلى الله عليه وسلم قال ‏\"‏ خير نسائها مريم، وخير نسائها خديجة ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     The Prophet said, \"The best of the world's women is Mary (at her lifetime), and the best of the world's women is Khadija (at her lifetime).",
      "chain": [
        "30213",
        "20337",
        "11065",
        "10511",
        "108",
        "5"
      ]
    },
    {
      "hadith_no": "4029",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عثمان، حدثنا عبدة، عن هشام، عن أبيه، عن ابن عمر  رضى الله عنهما  قال وقف النبي صلى الله عليه وسلم على قليب بدر فقال ‏{‏هل وجدتم ما وعد ربكم حقا ثم قال إنهم الآن يسمعون ما أقول‏}‏  فذكر لعائشة فقالت إنما قال النبي صلى الله عليه وسلم ‏\"‏ إنهم الآن ليعلمون أن الذي كنت أقول لهم هو الحق ‏\"‏‏.‏ ثم قرأت ‏{‏إنك لا تسمع الموتى‏}‏ حتى قرأت الآية‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet stood at the well of Badr (which contained the corpses of the pagans) and said, \"Have you found true what your lord promised you?\" Then he further said, \"They now hear what I say.\" This was mentioned before `Aisha and she said, \"But the Prophet said, 'Now they know very well that what I used to tell them was the truth.' Then she recited (the Holy Verse):-- \"You cannot make the dead hear... ...till the end of Verse).\" (30.52)",
      "chain": [
        "30203",
        "20337",
        "11065",
        "10511",
        "18"
      ]
    },
    {
      "hadith_no": "4153",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عثمان بن أبي شيبة، حدثنا عبدة، عن هشام، عن أبيه، عن عائشة، رضى الله عنها ‏{‏إذ جاءوكم من فوقكم ومن أسفل منكم وإذ زاغت الأبصار‏}‏ قالت كان ذاك يوم الخندق‏.‏",
      "text_en": " Narrated `Aisha:                     As regards the following Qur'anic Verse:-- \"When they came on you from above and from below you (from east and west of the valley) and when the eyes grew wild and the hearts reached up to the throats.....\" (33.10) That happened on the day of Al-Khandaq (i.e. Trench).",
      "chain": [
        "30203",
        "20337",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4165",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد، أخبرنا الفزاري، وعبدة، عن إسماعيل بن أبي خالد، قال سمعت عبد الله بن أبي أوفى  رضى الله عنهما  يقول دعا رسول الله صلى الله عليه وسلم على الأحزاب فقال ‏\"‏ اللهم منزل الكتاب، سريع الحساب، اهزم الأحزاب، اللهم اهزمهم وزلزلهم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Abi `Aufa:                     Allah's Apostle invoked evil upon the clans saying, \"Allah, the Revealer of the Holy Book (i.e. the Qur'an), the Quick Taker of the accounts! Please defeat the clans. O Allah! Defeat them and shake them.\"",
      "chain": [
        "30213",
        "20405",
        "20337",
        "11418",
        "5115"
      ]
    },
    {
      "hadith_no": "4197",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا عبدة، عن هشام، عن أبيه، قال ذهبت أسب حسان عند عائشة فقالت لا تسبه، فإنه كان ينافح عن رسول الله صلى الله عليه وسلم‏.‏ وقالت عائشة استأذن النبي صلى الله عليه وسلم في هجاء المشركين قال ‏\"‏ كيف بنسبي ‏\"‏‏.‏ قال لأسلنك منهم كما تسل الشعرة من العجين‏.‏",
      "text_en": " Narrated Hisham's father:                     I started abusing Hassan in front of `Aisha. She said, \"Do not abuse him as he used to defend Allah's Apostle (against the infidels). `Aisha added, \"Once Hassan took the permission from the Prophet to say poetic verses against the infidels. On that the Prophet said, 'How will you exclude my forefathers (from that)? Hassan replied, 'I will take you out of them as one takes a hair out of the dough.\" Hisham's father added, \"I abused Hassan as he was one of those who spoke against `Aisha.\"",
      "chain": [
        "30203",
        "20337",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "4626",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد، أخبرنا عبدة، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت هلكت قلادة لأسماء فبعث النبي صلى الله عليه وسلم في طلبها، رجالا فحضرت الصلاة وليسوا على وضوء‏.‏ ولم يجدوا ماء، فصلوا وهم على غير وضوء، فأنزل الله‏.‏ يعني آية التيمم‏.‏",
      "text_en": " Narrated `Aisha:                     The necklace of Asma' was lost, so the Prophet sent some men to look for it. The time for the prayer became due and they had not performed ablution and could not find water, so they offered the prayer without ablution. Then Allah revealed (the Verse of Tayammum).",
      "chain": [
        "30213",
        "20337",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4735",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمد، أخبرنا عبدة، عن عبيد الله، عن سعيد بن أبي سعيد، عن أبي هريرة  رضى الله عنه  قال سئل رسول الله صلى الله عليه وسلم أى الناس أكرم قال ‏\"‏ أكرمهم عند الله أتقاهم ‏\"‏‏.‏ قالوا ليس عن هذا نسألك‏.‏ قال ‏\"‏ فأكرم الناس يوسف نبي الله ابن نبي الله ابن نبي الله ابن خليل الله ‏\"‏‏.‏ قالوا ليس عن هذا نسألك‏.‏ قال ‏\"‏ فعن معادن العرب تسألوني ‏\"‏‏.‏ قالوا نعم‏.‏ قال ‏\"‏ فخياركم في الجاهلية خياركم في الإسلام إذا فقهوا ‏\"‏‏.‏ تابعه أبو أسامة عن عبيد الله‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle was asked, \"Who are the most honorable of the people?\" The Prophet said, \"The most honorable of them in Allah's Sight are those who keep their duty to Allah and fear Him. They said, \"We do not ask you about that.\" He said, \"Then the most honorable of the people is Joseph, Allah's prophet, the son of Allah's prophet, the son of Allah's prophet, the son of Allah's Khalil i.e. Abraham) They said, \"We do not ask you about that.\" The Prophet said, Do you ask about (the virtues of the ancestry of the Arabs?\" They said, \"Yes,\" He said, \"Those who were the best amongst you in the Prelslamic Period are the best amongst you in Islam if they comprehend (the Islamic religion).",
      "chain": [
        "30213",
        "20337",
        "11201",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "5028",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا سفيان، عن عاصم، وعبدة، عن زر بن حبيش، قال سألت أبى بن كعب عن المعوذتين، فقال سألت رسول الله صلى الله عليه وسلم فقال قيل لي فقلت فنحن نقول كما قال رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Zirr bin Hubaish:                     I asked Ubai bin Ka`b regarding the two Muwwidhat (Surats of taking refuge with Allah). He said, \"I asked the Prophet about them, He said, 'These two Surats have been recited to me and I have recited them (and are present in the Qur'an).' So, we say as Allah's Apostle said (i.e., they are part of the Qur'an.\"",
      "chain": [
        "30367",
        "20005",
        "11080",
        "20337",
        "11337",
        "39"
      ]
    },
    {
      "hadith_no": "5085",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا عثمان، حدثنا جرير، عن منصور، مثله‏.‏ تابعه بشر عن ابن المبارك، عن شعبة،‏.‏ وتابعه ابن جريج عن عبدة، عن شقيق، سمعت عبد الله، سمعت النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Abdullah:                     I heard the Prophet saying... (as above, no. 550).",
      "chain": [
        "30203",
        "20028",
        "20025",
        "20337",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "5154",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا محمد، أخبرنا عبدة، عن هشام، عن أبيه، عن عائشة، ‏{‏وإن خفتم أن لا، تقسطوا في اليتامى‏}‏‏.‏ قالت اليتيمة تكون عند الرجل وهو وليها، فيتزوجها على مالها، ويسيء صحبتها، ولا يعدل في مالها، فليتزوج ما طاب له من النساء سواها مثنى وثلاث ورباع‏.‏",
      "text_en": " Narrated Aisha\":                     (regarding) the Verse: 'And if you fear that you shall not be able to deal justly with the orphans...' (4.3) It is about the orphan girl who is in the custody of a man who is her guardian, and he intends to marry her because of her wealth, but he treats her badly and does not manage her property fairly and honestly. Such a man should marry women of his liking other than her, two or three or four. 'Prohibited to you (for marriage) are: ...your foster-mothers (who suckled you).' (4.23) Marriage is prohibited between persons having a foster suckling relationship corresponding to a blood relationship which renders marriage unlawful.",
      "chain": [
        "30213",
        "20337",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "5290",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا عبدة، عن هشام بن عروة، عن أبيه، عن زينب ابنة أم سلمة، عن أم سلمة، أن النبي صلى الله عليه وسلم كان عندها وفي البيت مخنث، فقال المخنث لأخي أم سلمة عبد الله بن أبي أمية إن فتح الله عليكم الطائف غدا أدلك على ابنة غيلان، فإنها تقبل بأربع وتدبر بثمان‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا يدخلن هذا عليكن ‏\"‏‏.‏",
      "text_en": " Narrated Um Salama:                     that while the Prophet was with her, there was an effeminate man in the house. The effeminate man said to Um Salama's brother, `Abdullah bin Abi Umaiyya, \"If Allah should make you conquer Ta'if tomorrow, I recommend that you take the daughter of Ghailan (in marriage) for (she is so fat) that she shows four folds of flesh when facing you and eight when she turns her back.\" Thereupon the Prophet said (to us), \"This (effeminate man) should not enter upon you (anymore).",
      "chain": [
        "30203",
        "20337",
        "11065",
        "10511",
        "244",
        "56"
      ]
    },
    {
      "hadith_no": "5448",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا محمد بن سلام، أخبرنا عبدة، عن عبيد الله، عن نافع، عن ابن عمر  رضى الله عنهما  قال رسول الله صلى الله عليه وسلم ‏\"‏ إن المؤمن يأكل في معى واحد، وإن الكافر  أو المنافق فلا أدري أيهما قال عبيد الله  يأكل في سبعة أمعاء ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"A believer eats in one intestine (is satisfied with a little food), and a kafir (unbeliever) or a hypocrite eats in seven intestines (eats too much).",
      "chain": [
        "30376",
        "20337",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5562",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا صدقة، أخبرنا عبدة، عن عبيد الله، عن نافع، عن ابن لكعب بن مالك، عن أبيه، أن امرأة، ذبحت شاة بحجر، فسئل النبي صلى الله عليه وسلم عن ذلك، فأمر بأكلها‏.‏ وقال الليث حدثنا نافع أنه سمع رجلا من الأنصار يخبر عبد الله عن النبي صلى الله عليه وسلم أن جارية لكعب بهذا‏.‏",
      "text_en": " Narrated Ka`b bin Malik:                     A lady slaughtered a sheep with a stone and then the Prophet was asked about it and he permitted it to be eaten.",
      "chain": [
        "30343",
        "20337",
        "11201",
        "11014"
      ]
    },
    {
      "hadith_no": "5569",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا إسحاق، سمع عبدة، عن هشام، عن فاطمة، عن أسماء، قالت ذبحنا على عهد رسول الله صلى الله عليه وسلم فرسا ونحن بالمدينة فأكلناه‏.‏",
      "text_en": " Narrated Asma':                     We slaughtered a horse (by Dhabh) during the lifetime of Allah's Apostle while we were at Medina, and we ate it.",
      "chain": [
        "30021",
        "20337",
        "11065",
        "10526",
        "70"
      ]
    },
    {
      "hadith_no": "5580",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا صدقة، أخبرنا عبدة، عن عبيد الله، عن سالم، ونافع، عن ابن عمر  رضى الله عنهما  نهى النبي صلى الله عليه وسلم عن لحوم الحمر الأهلية يوم خيبر‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet made the meat of donkeys unlawful on the day of the battle of Khaibar.",
      "chain": [
        "30343",
        "20337",
        "11201",
        "11011",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5943",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا إسحاق بن إبراهيم، حدثنا عبدة، حدثنا هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  قالت هلكت قلادة لأسماء، فبعث النبي صلى الله عليه وسلم في طلبها رجالا، فحضرت الصلاة وليسوا على وضوء ولم يجدوا ماء، فصلوا وهم على غير وضوء، فذكروا ذلك للنبي صلى الله عليه وسلم فأنزل الله آية التيمم‏.‏ زاد ابن نمير عن هشام عن أبيه عن عائشة استعارت من أسماء‏.‏",
      "text_en": " Narrated `Aisha:                     A necklace belonging to Asma' was lost, and the Prophet sent men in its search. The time for the prayer became due and they were without ablution and they could not find water; therefore they prayed without ablution, They mentioned that to the Prophet . Then Allah revealed the Verse of Tayammum. (`Aisha added: that she had borrowed (the necklace) from Asma').",
      "chain": [
        "30123",
        "20337",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5954",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني محمد، أخبرنا عبدة، أخبرنا عبيد الله بن عمر، عن نافع، عن ابن عمر  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ انهكوا الشوارب، وأعفوا اللحى ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"Cut the moustaches short and leave the beard (as it is).",
      "chain": [
        "30213",
        "20337",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "6003",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني محمد، حدثنا عبدة، عن عبيد الله، عن نافع، عن ابن عمر  رضى الله عنهما  قال لعن النبي صلى الله عليه وسلم الواصلة والمستوصلة، والواشمة والمستوشمة‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet has cursed the lady who lengthens her hair artificially and the one who gets her hair lengthened, and also the lady who tattoos (herself or others) and the one who gets herself tattooed.",
      "chain": [
        "30213",
        "20337",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "6145",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد، أخبرنا عبدة، عن هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إني لأعرف غضبك ورضاك ‏\"‏‏.‏ قالت قلت وكيف تعرف ذاك يا رسول الله قال ‏\"‏ إنك إذا كنت راضية قلت بلى ورب محمد‏.‏ وإذا كنت ساخطة قلت لا ورب إبراهيم ‏\"‏‏.‏ قالت قلت أجل لست أهاجر إلا اسمك‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle said, \" I know whether you are angry or pleased.\" I said, \"How do you know that, Allah's Apostle?\" He said, \"When you are pleased, you say, \"Yes, by the Lord of Muhammad,' but when you are angry, you say, 'No, by the Lord of Abraham!' \" I said, \"Yes, I do not leave, except your name.\"",
      "chain": [
        "30213",
        "20337",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6220",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد، حدثنا عبدة، أخبرنا هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  قالت استأذن حسان بن ثابت رسول الله صلى الله عليه وسلم في هجاء المشركين فقال رسول الله صلى الله عليه وسلم ‏\"‏ فكيف بنسبي ‏\"‏‏.‏ فقال حسان لأسلنك منهم كما تسل الشعرة من العجين‏.‏ وعن هشام بن عروة عن أبيه قال ذهبت أسب حسان عند عائشة فقالت لا تسبه فإنه كان ينافح عن رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Aisha:                     Hassan bin Thabit asked the permission of Allah's Apostle to lampoon the pagans (in verse). Allah's Apostle said, \"What about my fore-fathers (ancestry)?' Hassan said (to the Prophet) \"I will take you out of them as a hair is taken out of dough.\" Narrated Hisham bin `Urwa that his father said, \"I called Hassan with bad names in front of `Aisha.\" She said, \"Don't call him with bad names because he used to defend Allah's Apostle (against the pagans).",
      "chain": [
        "30213",
        "20337",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6409",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا عبدة، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت سمع النبي صلى الله عليه وسلم رجلا يقرأ في المسجد فقال ‏\"‏ رحمه الله، لقد أذكرني كذا وكذا آية أسقطتها في سورة كذا وكذا ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet heard a man reciting (the Qur'an) in the mosque. He said,\" May Allah bestow His Mercy on him, as he made me remember such and-such Verse which I had missed in such-and-such Sura.\"",
      "chain": [
        "30203",
        "20337",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6590",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني صدقة، أخبرنا عبدة، عن هشام، عن أبيه، عن عائشة، قالت كان رجال من الأعراب جفاة يأتون النبي صلى الله عليه وسلم فيسألونه متى الساعة، فكان ينظر إلى أصغرهم فيقول ‏\"‏ إن يعش هذا لا يدركه الهرم حتى تقوم عليكم ساعتكم ‏\"‏‏.‏ قال هشام يعني موتهم‏.‏",
      "text_en": " Narrated `Aisha:                     Some rough bedouins used to visit the Prophet and ask him, \"When will the Hour be?\" He would look at the youngest of all of them and say, \"If this should live till he is very old, your Hour (the death of the people addressed) will take place.\" Hisham said that he meant (by the Hour), their death.",
      "chain": [
        "30343",
        "20337",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6713",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثني محمد، أخبرنا عبدة، عن هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ يا أمة محمد والله لو تعلمون ما أعلم لبكيتم كثيرا، ولضحكتم قليلا ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet said, \"O followers of Muhammad! By Allah, if you knew what I know, you would weep much and laugh little.\"",
      "chain": [
        "30213",
        "20337",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6879",
      "source": " Sahih Bukhari ",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا عبدة، عن هشام، عن أبيه، قال أخبرتني عائشة، أن يد السارق، لم تقطع على عهد النبي صلى الله عليه وسلم إلا في ثمن مجن حجفة أو ترس‏.‏",
      "text_en": " Narrated `Aisha:                     The hand of a thief was not cut off during the lifetime of the Prophet except for stealing something equal to a shield in value.",
      "chain": [
        "30203",
        "20337",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "7283",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا محمد، أخبرنا عبدة، حدثنا هشام بن عروة، عن أبيه، عن أبي حميد الساعدي، أن النبي صلى الله عليه وسلم استعمل ابن الأتبية على صدقات بني سليم، فلما جاء إلى رسول الله صلى الله عليه وسلم وحاسبه قال هذا الذي لكم، وهذه هدية أهديت لي‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ فهلا جلست في بيت أبيك وبيت أمك حتى تأتيك هديتك، إن كنت صادقا ‏\"‏‏.‏ ثم قام رسول الله صلى الله عليه وسلم فخطب الناس وحمد الله وأثنى عليه ثم قال ‏\"‏ أما بعد فإني أستعمل رجالا منكم على أمور مما ولاني الله، فيأتي أحدكم فيقول هذا لكم وهذه هدية أهديت لي فهلا جلس في بيت أبيه وبيت أمه حتى تأتيه هديته إن كان صادقا، فوالله لا يأخذ أحدكم منها شيئا  قال هشام  بغير حقه إلا جاء الله يحمله يوم القيامة، ألا فلأعرفن ما جاء الله رجل ببعير له رغاء، أو ببقرة لها خوار، أو شاة تيعر ‏\"‏‏.‏ ثم رفع يديه حتى رأيت بياض إبطيه ‏\"‏ ألا هل بلغت ‏\"‏‏.‏",
      "text_en": " Narrated Abu Humaid As-Sa`idi:                     The Prophet employed Ibn Al-Utbiyya to collect Zakat from Bani Sulaim, and when he returned (with the money) to Allah's Apostle the Prophet called him to account, and he said, \"This (amount) is for you, and this was given to me as a present.\" Allah's Apostle said, \"Why don't you stay at your father's house or your mother's house to see whether you will be given gifts or not, if you are telling the truth?\" Then Allah's Apostle stood up and addressed the people, and after glorifying and praising Allah, he said: Amma Ba'du (then after) I employ some men from among you for some job which Allah has placed in my charge, and then one of you comes to me and says, 'This (amount) is for you and this is a gift given to me.' Why doesn't he stay at the house of his father or the house of his mother and see whether he will be given gifts or not if he was telling the truth by Allah, none of you takes anything of it (i.e., Zakat) for himself (Hisham added: unlawfully) but he will meet Allah on the Day of Resurrection carrying it on his neck! I do not want to see any of you carrying a grunting camel or a mooing cow or a bleating sheep on meeting Allah.\" Then the Prophet raised both his hands till I saw the whiteness of his armpits, and said, \"(No doubt)! Haven't I conveyed Allah's Message!\"",
      "chain": [
        "30213",
        "20337",
        "11065",
        "10511",
        "1457"
      ]
    },
    {
      "hadith_no": "7320",
      "source": " Sahih Bukhari ",
      "chapter": "Wishes - كتاب التمنى",
      "chapter_no": "95",
      "text_ar": "حدثنا محمد، حدثنا عبدة، عن ابن أبي خالد، عن قيس، قال أتينا خباب بن الأرت نعوده وقد اكتوى سبعا فقال لولا أن رسول الله صلى الله عليه وسلم نهانا أن ندعو بالموت لدعوت به‏.‏",
      "text_en": " Narrated Qais:                     We went to pay a visit to Khabbab bin Al-Art and he had got himself branded at seven spots over his body. He said, \"If Allah's Apostle had not forbidden us to invoke Allah for death, I would have invoked for it.\"",
      "chain": [
        "30213",
        "20337",
        "11418",
        "11046"
      ]
    },
    {
      "hadith_no": "347",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو الناقد، وزهير بن حرب، قالا حدثنا إسماعيل بن إبراهيم، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، وعبدة بن سليمان، ح وحدثنا ابن المثنى، وابن، بشار قالا حدثنا ابن أبي عدي، كلهم عن سعيد بن أبي عروبة، عن قتادة، عن زرارة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله عز وجل تجاوز لأمتي عما حدثت به أنفسها ما لم تعمل أو تكلم به ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) observed:                      Verily the Great and Mighty Allah forgave my people the evil promptings arising in their minds, but they neither talked about them nor acted upon them.",
      "chain": [
        "30263",
        "30022",
        "20208",
        "30201",
        "20345",
        "20337",
        "30160",
        "20276",
        "11073",
        "11019",
        "13"
      ]
    },
    {
      "hadith_no": "405",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبدة بن سليمان، ح وحدثنا ابن أبي عمر، حدثنا سفيان، ح وحدثنا عبيد الله بن معاذ، حدثنا أبي، حدثنا شعبة، كلهم عن صالح بن صالح، بهذا الإسناد نحوه ‏.‏",
      "text_en": " This hadith has been narrated by another chain of transmitters like Abu Bakr b. Abi Shaiba, 'Abda b. Sulaiman Ibn Abi 'Umar Sufyan, 'Ubaidullah b. Mu'adh, Shu'ba; all of them heard it from Salih b. Salih.",
      "chain": [
        "30201",
        "20337",
        "30421",
        "20005",
        "30150",
        "20286"
      ]
    },
    {
      "hadith_no": "288",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حماد، - يعني ابن زيد - عن هشام بن حسان، ح وحدثنا إسحاق بن إبراهيم، أخبرنا عبدة بن سليمان، حدثنا ابن أبي عروبة، جميعا عن أبي معشر، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا هشيم، عن مغيرة، ح وحدثني محمد بن حاتم، حدثنا عبد الرحمن بن مهدي، عن مهدي بن ميمون، عن واصل الأحدب، ح وحدثني ابن حاتم، حدثنا إسحاق بن منصور، حدثنا إسرائيل، عن منصور، ومغيرة، كل هؤلاء عن إبراهيم، عن الأسود، عن عائشة، في حت المني من ثوب رسول الله صلى الله عليه وسلم نحو حديث خالد عن أبي معشر ‏.‏",
      "text_en": " Qutaiba b. Sa'id, Ishaq b. Ibrahim, Ibn Abi 'Aruba, Abu Ma'shar, Abu Bakr b. Abu Shaiba, Mansur and Mughira have all transmitted from Ibrahim, who transmitted it on the authority of A'isha's narration pertaining to the scraping off of the (drop) of semen from the garment of the Messenger of Allah (may peace be upon him) like the hadith of Khalid on the authority of Abu Ma'shar.",
      "chain": [
        "30367",
        "20022",
        "11311",
        "30123",
        "20337",
        "11073",
        "19825",
        "30201",
        "20468",
        "11072",
        "38487",
        "20033",
        "11307"
      ]
    },
    {
      "hadith_no": "387",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا عبدة، عن طلحة بن يحيى، عن عمه، قال كنت عند معاوية بن أبي سفيان فجاءه المؤذن يدعوه إلى الصلاة فقال معاوية سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ المؤذنون أطول الناس أعناقا يوم القيامة ‏\"‏ ‏.‏  وحدثنيه إسحاق بن منصور، أخبرنا أبو عامر، حدثنا سفيان، عن طلحة بن يحيى، عن عيسى بن طلحة، قال سمعت معاوية، يقول قال رسول الله صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " Yahya narrated it on the authority of his uncle that he had been sitting in the company of Mu'awiya b. Abu Sufyan when the Mu'adhdhin called (Muslims) to prayer. Mu'awiya said:                      I heard the Messenger of Allah (may peace be upon him) saying The Mu'adhdhins will have the longest necks on the Day of Resurrection.",
      "chain": [
        "30212",
        "20337",
        "11863"
      ]
    },
    {
      "hadith_no": "399",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن مهران الرازي، حدثنا الوليد بن مسلم، حدثنا الأوزاعي، عن عبدة، أن عمر بن الخطاب، كان يجهر بهؤلاء الكلمات يقول سبحانك اللهم وبحمدك تبارك اسمك وتعالى جدك ولا إله غيرك ‏.‏ وعن قتادة أنه كتب إليه يخبره عن أنس بن مالك أنه حدثه قال صليت خلف النبي صلى الله عليه وسلم وأبي بكر وعمر وعثمان فكانوا يستفتحون ب ‏{‏ الحمد لله رب العالمين‏}‏ لا يذكرون بسم الله الرحمن الرحيم في أول قراءة ولا في آخرها ‏.‏",
      "text_en": " 'Abda reported:                      'Umar b. al-Khattab used to recite loudly these words: Subhanak Allahumma wa bi hamdika wa tabarakasmuka wa ta'ala jadduka wa la ilaha ghairuka [Glory to Thee,0 Allah, and Thine is the Praise, and Blessed is Thy Name. and Exalted is Thy Majesty. and there is no other object of worship beside Thee]. Qatada informed in writing that Anas b. Malik had narrated to him: I observed prayer behind the Apostle of Allah (may peace be upon him) and Abu Bakr and Umar and 'Uthman. They started (loud recitation) with: AI-hamdu lillahi Rabb al-'Alamin [All Praise is due to Allah, the Lord of the worlds] and did not recite Bismillah ir- Rahman-ir-Rahim (loudly) at the beginning of the recitation or at the end of it.",
      "chain": [
        "30383",
        "20733",
        "20024",
        "20337",
        "3",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "412",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبدة بن سليمان، عن هشام، عن أبيه، عن عائشة، قالت اشتكى رسول الله صلى الله عليه وسلم فدخل عليه ناس من أصحابه يعودونه فصلى رسول الله صلى الله عليه وسلم جالسا فصلوا بصلاته قياما فأشار إليهم أن اجلسوا ‏.‏ فجلسوا فلما انصرف قال ‏\"‏ إنما جعل الإمام ليؤتم به فإذا ركع فاركعوا وإذا رفع فارفعوا وإذا صلى جالسا فصلوا جلوسا ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported:                      The Messenger of Allah (may peace be upon him) fell ill and some of his Companions came to inquire after his health. The Messenger of Allah (may peace he upon him) said prayer sitting, while (his Companions) said it (behind him) standing. He (the Holy Prophet) directed them by his gesture to sit down, and they sat down (in prayer). After finishing the (prayer) lie (the Holy Prophet) said: The Imam is appointed so that be should be followed, so bow down when lie bows down, and rise rip when he rises up and say (prayer) sitting when he (the Imam) says (it) sitting.",
      "chain": [
        "30201",
        "20337",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1372",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا عبدة بن سليمان، عن هشام بن عروة، عن أبي الزبير، مولى لهم أن عبد الله بن الزبير، كان يهلل دبر كل صلاة ‏.‏ بمثل حديث ابن نمير وقال في آخره ثم يقول ابن الزبير كان رسول الله صلى الله عليه وسلم يهلل بهن دبر كل صلاة ‏.‏",
      "text_en": " Abu Zubair reported:                      Abdullah b Zubair used to say La ilaha il-Allah at the end of every prayer like the hadith narrated by Ibn Numair and he reported it in the end, and then reported Ibn Zubair saying: The Messenger of Allah (may peace be upon him) uttered La ilaha il-Allah at the end of every prayer.",
      "chain": [
        "30201",
        "20337",
        "11065",
        "106",
        "106"
      ]
    },
    {
      "hadith_no": "1714",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا عمرو الناقد، حدثنا عبدة بن سليمان، حدثنا هشام بن عروة، عن أبيه، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصلي ركعتى الفجر إذا سمع الأذان ويخففهما ‏.‏",
      "text_en": " 'A'isha reported:                      The Messenger of Allah (may peace be upon him) used to observe two rak'ahs of Sunnah (prayer) when he heard the Adhin and shortened them.",
      "chain": [
        "30263",
        "20337",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1755",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا عبدة بن سليمان، ح وحدثناه أبو كريب، حدثنا وكيع، وأبو أسامة كلهم عن هشام، بهذا الإسناد ‏.‏",
      "text_en": " 'A'isha reported that the Messenger of Allah (may peace be upon him) used to pray thirteen rak'ahs during the night including the two rak'ahs (Sunan) of the dawn prayer.",
      "chain": [
        "30201",
        "20337",
        "30216",
        "20032"
      ]
    }
  ],
  "total_hadiths": 282
}