{
  "id": "20338",
  "name": "'Ubaidullah bin 'Ubaidur Rahman عبيد الله بن عبيد الرحمن الأشجعي",
  "full_name": "'Ubaidullah bin 'Ubaidur Rahman عبيد الله بن عبيد الرحمن الأشجعي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "182",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  ت  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Ashja'i",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20358",
      "name": "Malik bin Mghwl مالك بن مغول",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10792",
      "name": "'Abdul Malik bin Sa'id عبد الملك بن سعيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11220",
      "name": "Muhammad bin 'Amr bin 'Alqama محمد بن عمرو بن علقمة",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "20390",
      "name": "Hashim bin al-Qasim bin Muslim هاشم بن القاسم أبو النضر - قيصر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20364",
      "name": "Yahya bin Aadm bin Sulaiman يحيى بن آدم بن سليمان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20632",
      "name": "'Ali bin Hafs al-Mada'ini علي بن حفص المدائني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30203",
      "name": "'Uthman bin Muhammad عثمان بن محمد بن إبراهيم / بن أبي شيبة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30461",
      "name": "Ahmed bin Jwas أحمد بن جواس",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30216",
      "name": "Abu Karayb, Muhammad bin al-'Ala' محمد بن العلاء - أبو كريب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30294",
      "name": "Ahmed bin Hameed al-Trythythy أحمد بن حميد الطريثيثي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38107",
      "name": "Isma'il bin Bhram bin Yahya إسماعيل بن بهرام بن يحيى",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30400",
      "name": "Y'aqub bin Ibrahim bin Kathir يعقوب بن إبراهيم بن كثير بن زيد الدورقي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4619",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أحمد بن حميد، أخبرنا عبيد الله الأشجعي، عن سفيان، عن الشيباني، عن عكرمة، عن ابن عباس  رضى الله عنهما  ‏{‏وإذا حضر القسمة أولو القربى واليتامى والمساكين‏}‏ قال هي محكمة وليست بمنسوخة‏.‏ تابعه سعيد عن ابن عباس‏.‏",
      "text_en": " Narrated Ikrama:                     Ibn `Abbas said ( regarding the verse), \"And when the relatives and the orphans and the poor are present at the time of division, \"this verse and its order is valid and not abrogated.\"",
      "chain": [
        "30294",
        "20338",
        "20012",
        "11352",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "147",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن النضر بن أبي النضر، قال حدثني أبو النضر، هاشم بن القاسم حدثنا عبيد الله الأشجعي، عن مالك بن مغول، عن طلحة بن مصرف، عن أبي صالح، عن أبي هريرة، قال كنا مع النبي صلى الله عليه وسلم في مسير - قال - فنفدت أزواد القوم قال حتى هم بنحر بعض حمائلهم - قال - فقال عمر يا رسول الله لو جمعت ما بقي من أزواد القوم فدعوت الله عليها ‏.‏ قال ففعل - قال - فجاء ذو البر ببره وذو التمر بتمره - قال وقال مجاهد وذو النواة بنواه - قلت وما كانوا يصنعون بالنوى قال كانوا يمصونه ويشربون عليه الماء ‏.‏ قال فدعا عليها - قال - حتى ملأ القوم أزودتهم - قال - فقال عند ذلك ‏\"‏ أشهد أن لا إله إلا الله وأني رسول الله لا يلقى الله بهما عبد غير شاك فيهما إلا دخل الجنة ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira:                      We were accompanying the Apostle (may peace be upon him) in a march (towards Tabuk). He (the narrator) said: The provisions with the people were almost depleted. He (the narrator) said: (And the situation became so critical) that they (the men of the army) decided to slaughter some of their camels. He (the narrator) said: Upon this Umar said: Messenger of Allah, I wish that you should pool together what has been left out of the provisions with the people and then invoke (the blessings of) Allah upon it. He (the narrator) said: He (the Holy Prophet) did it accordingly. He (the narrator) said: The one who had wheat in his possession came there with wheat. He who had dates with him came there with dates. And Mujahid said: He who possessed stones of dates came there with stones. I (the narrator) said: What did they do with the date-stones. They said: They (the people) sucked them and then drank water over them. He (the narrator said): He (the Holy Prophet) invoked the blessings (of Allah) upon them (provisions). He (the narrator) said: (And there was such a miraculous increase in the stocks) that the people replenished their provisions fully. He (the narrator) said: At that time he (the Holy Prophet) said: I bear testimony to the fact that there is no god but Allah, and I am His messenger. The bondsman who would meet Allah without entertaining any doubt about these (two fundamentals) would enter heaven.",
      "chain": [
        "30528",
        "20390",
        "20338",
        "20358",
        "11356",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "486",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو كريب، حدثنا عبيد الله الأشجعي، عن عبد الملك بن أبجر، قال سمعت الشعبي، يقول سمعت المغيرة بن شعبة، يقول على المنبر إن موسى - عليه السلام - سأل الله عز وجل عن أخس أهل الجنة منها حظا ‏.‏ وساق الحديث بنحوه ‏.‏",
      "text_en": " Sha'bi reported he had heard al-Mughira b. Shu'ba say on the pulpit that Moses (peace be upon him) had asked Allah, Exalted and Great, about the reward of the lowest of the inhabitants of Paradise, and the remaining part of hadith is the same (as narrated) above.",
      "chain": [
        "30216",
        "20338",
        "11052",
        "166"
      ]
    },
    {
      "hadith_no": "1689",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن جواس الحنفي أبو عاصم، حدثنا عبيد الله الأشجعي، عن سفيان، عن محارب بن دثار، عن جابر بن عبد الله، قال كان لي على النبي صلى الله عليه وسلم دين فقضاني وزادني ودخلت عليه المسجد فقال لي ‏\"‏ صل ركعتين ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      The Apostle of Allah (may peace be upon him) owed me a debt; he paid me back and made an addition (of this). I entered the mosque and he (the Holy Prophet) said to me: Observe two rak'ahs of prayer.",
      "chain": [
        "30461",
        "20338",
        "20012",
        "11389",
        "34"
      ]
    },
    {
      "hadith_no": "3397",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو بكر بن النضر بن أبي النضر، حدثني أبو النضر، حدثني عبيد الله، الأشجعي عن سفيان، عن الأعمش، بهذا الإسناد ‏.‏ مثله ولم يقل ‏\"‏ يوم القيامة ‏\"‏ وزاد ‏\"‏ وذمة المسلمين واحدة يسعى بها أدناهم فمن أخفر مسلما فعليه لعنة الله والملائكة والناس أجمعين لا يقبل منه يوم القيامة عدل ولا صرف ‏\"‏ ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of A'mash with the same chain of transmitters, but no mention has been made of the Day of Resurrection. But this addition is made:                     \" The protection granted by Muslims is one and must be respected by the humblest of them. And he who broke the covenant made by a Muslim, there is a curse of Allah, of his angels, and of the whole people upon him, and neither an obligatory act nor a supererogatory act would be accepted from him as recompense on the Day of Resurrection.\"",
      "chain": [
        "30528",
        "20390",
        "20338",
        "20012"
      ]
    },
    {
      "hadith_no": "6159",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا أبو كريب، حدثنا الأشجعي، ح وحدثني محمد بن المثنى، حدثنا عبد الرحمن، - يعني ابن مهدي - كلاهما عن سفيان، عن محمد بن المنكدر، قال سمعت جابر بن عبد، الله يقول مثله سواء ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Jabir b. 'Abdullah through another chain of transmitters.",
      "chain": [
        "30216",
        "20338",
        "30170",
        "20005",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "6960",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Knowledge - كتاب العلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أبو بكر بن النضر بن أبي النضر، حدثنا أبو النضر، حدثنا عبيد الله الأشجعي، عن سفيان، عن الأعمش، عن أبي وائل، عن عبد الله، وأبي، موسى الأشعري قالا قال رسول الله صلى الله عليه وسلم ح",
      "text_en": "",
      "chain": [
        "30528",
        "20390",
        "20338",
        "20012",
        "11060",
        "11353",
        "16",
        "41"
      ]
    },
    {
      "hadith_no": "7629",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا أبو بكر بن النضر بن أبي النضر، حدثني أبو النضر، هاشم بن القاسم حدثنا عبيد الله الأشجعي، عن سفيان الثوري، عن عبيد المكتب، عن فضيل، عن الشعبي، عن أنس بن مالك، قال كنا عند رسول الله صلى الله عليه وسلم فضحك فقال ‏\"‏ هل تدرون مم أضحك ‏\"‏ ‏.‏ قال قلنا الله ورسوله أعلم ‏.‏ قال ‏\"‏ من مخاطبة العبد ربه يقول يا رب ألم تجرني من الظلم قال يقول بلى ‏.‏ قال فيقول فإني لا أجيز على نفسي إلا شاهدا مني قال فيقول كفى بنفسك اليوم عليك شهيدا وبالكرام الكاتبين شهودا - قال - فيختم على فيه فيقال لأركانه انطقي ‏.‏ قال فتنطق بأعماله - قال - ثم يخلى بينه وبين الكلام - قال - فيقول بعدا لكن وسحقا ‏.‏ فعنكن كنت أناضل ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported:                      We were in the company of Allah's Messenger (way peace be upon him) that he smiled and said: Do you know why I laughed? We said: Allah and His Messenger, know best. Thereupon he said: It was because of the (fact that there came to my mind the) talk which the servant would have with his Lord. (on the Day of judgment). He would say: My Lord, have you not guaranteed me protection against injustice? He would say: Yes. Then the servant would say: I do not deem valid any witness against me but my own self, and He would say: Well, enough would he the witness of your self against you and that of the two angels who had been appointed to record your deeds. Then the seal would be set upon his mouth and it would be said to his hands and feet to speak and they would speak of his deeds. Then the mouth would be made free to talk, he would say (to the bands and feet): Be away, let there be curse of Allah upon you. It was for your safety that I contended.",
      "chain": [
        "30528",
        "20390",
        "20338",
        "20012",
        "20271",
        "11052",
        "19"
      ]
    },
    {
      "hadith_no": "7647",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "وحدثنا أبو كريب، حدثنا الأشجعي، ح وحدثنا نصر بن علي، حدثنا أبو أحمد، كلاهما عن سفيان، بهذا الإسناد غير أن في، حديثهما عن سفيان وما شبعنا من الأسودين ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Sufyan and the words are:                     \" We could not afford to eat to the fill even dates and water.\"",
      "chain": [
        "30216",
        "20338",
        "30395"
      ]
    },
    {
      "hadith_no": "289",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يعقوب بن إبراهيم الدورقي، حدثنا عبيد الله الأشجعي، عن سفيان الثوري، عن أبي إسحاق، عن الأسود بن يزيد، عن عبد الله بن مسعود، قال علمنا رسول الله صلى الله عليه وسلم إذا قعدنا في الركعتين أن نقول التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة الله وبركاته السلام علينا وعلى عباد الله الصالحين أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله ‏.‏ قال وفي الباب عن ابن عمر وجابر وأبي موسى وعائشة ‏.‏ قال أبو عيسى حديث ابن مسعود قد روي عنه من غير وجه ‏.‏ وهو أصح حديث روي عن النبي صلى الله عليه وسلم في التشهد ‏.‏ والعمل عليه عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم من التابعين ‏.‏ وهو قول سفيان الثوري وابن المبارك وأحمد وإسحاق ‏.‏ حدثنا أحمد بن محمد بن موسى أخبرنا عبد الله بن المبارك عن معمر عن خصيف قال رأيت النبي صلى الله عليه وسلم في المنام فقلت يا رسول الله إن الناس قد اختلفوا في التشهد فقال ‏\"‏ عليك بتشهد ابن مسعود ‏\"‏ ‏.‏",
      "text_en": " Abdullah bin Mas'ud narrated:                     \"Allah's Messenger taught us, that when we sit for every two Rak'ah we should say: (At-Tahyyatulillah, was-salawatu wattayybaat. As-salamu alaika ayyuhannabiyyu wa rahmatullahi wa barakatuhu, as-salamu alaina wa ala ibadillahis-salihin. Ashhadu an la ilaha illallah wa ashadu anna Muhammadan abduhu wa Rasuluh.) 'All greetings, prayers, and pure words are Allah. Peace be upon you O Prophet, and Allah's mercy and His blessings. Peace be upon us and all of the righteous worshippers of Allah. I testify that nne has the right to be worshipped but Allah, and I testify that Muhammad is Allah's servant and Messenger.'\"",
      "chain": [
        "30400",
        "20338",
        "20012",
        "11049",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "2751",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "وروى عبيد الله الأشجعي، عن سفيان، عن ثوير، عن مجاهد، عن ابن عمر، قوله ولم يرفعه حدثنا بذلك أبو كريب، محمد بن العلاء حدثنا عبيد الله الأشجعي، عن سفيان، عن ثوير، عن مجاهد، عن ابن عمر، نحوه ولم يرفعه ‏.‏",
      "text_en": "",
      "chain": [
        "20012",
        "11028",
        "20338",
        "20012",
        "11028",
        "18"
      ]
    },
    {
      "hadith_no": "3613",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا يحيى بن آدم، حدثنا عبيد الله الأشجعي، عن الثوري، عن عثمان بن المغيرة الثقفي، عن سالم بن أبي الجعد، عن علي بن علقمة الأنماري، عن علي بن أبي طالب، قال لما نزلت ‏:‏ ‏(‏يا أيها الذين آمنوا إذا ناجيتم الرسول فقدموا بين يدى نجواكم صدقة ‏)‏ ‏.‏ قال لي النبي صلى الله عليه وسلم ‏\"‏ ما ترى دينارا ‏\"‏ ‏.‏ قلت لا يطيقونه ‏.‏ قال ‏\"‏ فنصف دينار ‏\"‏ ‏.‏ قلت لا يطيقونه ‏.‏ قال ‏\"‏ فكم ‏\"‏ ‏.‏ قلت شعيرة ‏.‏ قال ‏\"‏ إنك لزهيد ‏\"‏ ‏.‏ قال فنزلت  ‏:‏ ‏(‏أأشفقتم أن تقدموا بين يدى نجواكم صدقات ‏)‏ الآية ‏.‏ قال فبي خفف الله عن هذه الأمة ‏.‏ قال هذا حديث حسن غريب إنما نعرفه من هذا الوجه ‏.‏ ومعنى قوله شعيرة يعني وزن شعيرة من ذهب وأبو الجعد اسمه رافع ‏.‏",
      "text_en": " Ali bin Abi Talib said:                     “When (the following) was revealed: ‘O you who believe! When you consult the Messenger in private, spend something in charity before your private consultation.’ The Prophet said to me: ‘What do you think? A dinar?’ I said: ‘They will not be able to.’ He said: ‘Then half a Dinar?’ I said: ‘They will not be able.’ He said: ‘Then how much?’ I said ‘A barely corn.’ He said: ‘You made it too little.’” He said: “So the Ayah was revealed: ‘Are you afraid of spending in charity before your private consultation?’ He said: “It was about my case for which Allah lightened the burden upon this Ummah.”",
      "chain": [
        "35047",
        "20364",
        "20338",
        "20012",
        "11640",
        "11342",
        "5"
      ]
    },
    {
      "hadith_no": "3650",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "وروى الأشجعي، عن سفيان، عن ثوير، عن مجاهد، عن ابن عمر، قوله ولم يرفعه ولا نعلم أحدا ذكر فيه عن مجاهد غير الثوري ‏.‏ حدثنا بذلك أبو كريب حدثنا عبيد الله الأشجعي عن سفيان ‏.‏ ثوير يكنى أبا جهم وأبو فاختة اسمه سعيد بن علاقة ‏.‏",
      "text_en": "",
      "chain": [
        "20012",
        "11028",
        "20338"
      ]
    },
    {
      "hadith_no": "1162",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا يعقوب بن إبراهيم الدورقي، عن الأشجعي، عن سفيان، عن أبي إسحاق، عن الأسود، عن عبد الله، قال علمنا رسول الله صلى الله عليه وسلم أن نقول إذا جلسنا في الركعتين ‏\"‏ التحيات لله والصلوات والطيبات السلام عليك أيها النبي ورحمة الله وبركاته السلام علينا وعلى عباد الله الصالحين أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"The Messenger of Allah (ﷺ) taught us to say when we sat following two rak'ahs: 'At-tahiyyatu lillahi was-salawatu wat-tayyibat, as-salamu 'alaika ayyuhan-Nabiyyu wa rahmatAllahi wa baraktuhu. As-salamu 'alaina wa 'ala 'ibad illahis-salihin, ashahdu an la illaha ill-Allah wa ashhadu anna Muhammadan 'abduhu wa rasuluhu (Allah compliments, prayers and pure words are due to Allah. Peace be upon you, O Prophet, and the mercy of Allah (SWT) and his blessings. Peace be upon us and upon the righteous slaves of Allah (SWT). I bear witness that none has the right to be worshipped except Allah and I bear witness that Muhammad is His slave and Messenger).'\"",
      "chain": [
        "30400",
        "20338",
        "20012",
        "11049",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "3186",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا أبو بكر بن أبي النضر، قال حدثنا أبو النضر، قال حدثنا عبيد الله الأشجعي، عن سفيان الثوري، عن الركين الفزاري، عن أبيه، عن يسير بن عميلة، عن خريم بن فاتك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أنفق نفقة في سبيل الله كتبت له بسبعمائة ضعف ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Khuraim bin Fatik said:                      \"The Messenger of Allah (ﷺ) said: 'Whoever spends in the cause of Allah, it will be recorded for him seven hundred fold.'\"",
      "chain": [
        "30528",
        "20390",
        "20338",
        "20012",
        "20016",
        "4127"
      ]
    },
    {
      "hadith_no": "3647",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا إسماعيل بن بهرام، حدثنا عبيد الله الأشجعي، عن سفيان، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال لدغت عقرب رجلا فلم ينم ليلته فقيل للنبي  صلى الله عليه وسلم  إن فلانا لدغته عقرب فلم ينم ليلته ‏.‏ فقال ‏\"‏ أما إنه لو قال حين أمسى أعوذ بكلمات الله التامات من شر ما خلق - ما ضره لدغ عقرب حتى يصبح ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “A scorpion stung a man andhe didnot sleep all the night. It was said to the Prophet (ﷺ): ‘So-and-sowas stung by a scorpion and he did not sleep all the night.’ Hesaid: ‘If he had said, last night: A’udhubikalimatil-lahit-tammatimin sharri ma khalaq (I seek refuge in thePerfect Words of Allah fromthe evil of that which He has created),the scorpion sting would nothave harmed him, until morning.’”",
      "chain": [
        "38107",
        "20338",
        "20012",
        "11173",
        "11161",
        "13"
      ]
    }
  ],
  "total_hadiths": 16
}