{
  "id": "20346",
  "name": "'Umar bin 'Ubaid bin Abi Umayya عمر بن عبيد بن أبي أمية الطنافسي",
  "full_name": "'Umar bin 'Ubaid bin Abi Umayya عمر بن عبيد بن أبي أمية الطنافسي",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Sadooq",
  "biography": {
    "birth": {
      "date_hijri": "104",
      "date_gregorian": "NA",
      "date_display": [
        "104 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "185",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ع  -  صدوق ]"
    ],
    "tags": [
      "Client",
      "al-Ayadi",
      "al-Hanfi",
      "al-Tanafasi",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [
    {
      "id": "30213",
      "name": "Muhammad bin 'Ubaid al-Tanafasi محمد بن عبيد بن أبي أمية الطنافسي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "20372",
      "name": "Ya'la bin 'Ubaid bin Umayya al-Tanafasi يعلى بن عبيد بن أبي أمية الطنافسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "children": [
    {
      "id": "35034",
      "name": "Hafs bin 'Umar bin 'Ubaid حفص بن عمر بن عبيد",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "teachers": [
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "20443",
      "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20016",
      "name": "Sa'id bin Masrooq Ath-Thawri سعيد بن مسروق الثوري",
      "grade": "Succ. (Taba' Tabi') [6th generation]"
    },
    {
      "id": "10770",
      "name": "Smak bin Hrb bin Aws سماك بن حرب بن أوس",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11324",
      "name": "Ash'ath bin Abi al-Ash'atha أشعث بن أبي الشعثاء",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "28437",
      "name": "'Umar bin al-Mthna al-'Ashj'y عمر بن المثنى الأشجعي الرقي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "20372",
      "name": "Ya'la bin 'Ubaid bin Umayya al-Tanafasi يعلى بن عبيد بن أبي أمية الطنافسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30263",
      "name": "'Amr bin Muhammad bin Bukayr عمرو بن محمد بن بكير الناقد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30376",
      "name": "Muhammad bin Salam al-Baykandi محمد بن سلام البيكندي الكبير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30212",
      "name": "Muhammad bin 'Abdullah bin Numayr محمد بن عبد الله بن نمير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30216",
      "name": "Abu Karayb, Muhammad bin al-'Ala' محمد بن العلاء - أبو كريب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "35134",
      "name": "Muhammad bin 'Ubaid bin Muhammad محمد بن عبيد بن محمد بن ثعلبة",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "35135",
      "name": "Muhammad bin 'Ubaid bin Muhammad محمد بن عبيد بن محمد بن واقد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38474",
      "name": "Muhammad bin Aadm bin Sulaiman محمد بن آدم بن سليمان الجهني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "35047",
      "name": "Sufyan bin Wky' bin al-Jrah سفيان بن وكيع بن الجراح",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30249",
      "name": "Ziyad bin Ayoub - Dulwiyya زياد بن أيوب بن زياد دلويه",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-5602",
      "hadith_no": "5602",
      "source": "Sahih Bukhari",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا ابن سلام، أخبرنا عمر بن عبيد الطنافسي، عن سعيد بن مسروق، عن عباية بن رفاعة، عن جده، رافع بن خديج  رضى الله عنه  قال كنا مع النبي صلى الله عليه وسلم في سفر فند بعير من الإبل  قال  فرماه رجل بسهم فحبسه، قال ثم قال ‏\"‏ إن لها أوابد كأوابد الوحش فما غلبكم منها فاصنعوا به هكذا ‏\"‏‏.‏ قال قلت يا رسول الله إنا نكون في المغازي والأسفار فنريد أن نذبح فلا تكون مدى قال ‏\"‏ أرن ما نهر  أو أنهر  الدم وذكر اسم الله فكل، غير السن والظفر، فإن السن عظم، والظفر مدى الحبشة ‏\"‏‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     While we were with the Prophet. on a journey, one of the camels ran away. A man shot it with an arrow and stopped it. The Prophet said, \"Of these camels some are as wild as wild beasts, so if one of them runs away and you cannot catch it, then do like this (shoot it with an arrow).\" I said, \"O Allah's Apostle! Sometimes when we are in battles or on a journey we want to slaughter (animals) but we have no knives.\" He said, \"Listen! If you slaughter the animal with anything that causes its blood to flow out, and if Allah's Name is mentioned on slaughtering it, eat of it, provided that the slaughtering instrument is not a tooth or a nail, as the tooth is a bone and the nail is the knife of Ethiopians.\"",
      "usc_msa_ref": "452",
      "chain": [
        "30376",
        "20346",
        "20016",
        "11179",
        "1986"
      ]
    },
    {
      "id": "sahih-muslim-499-3",
      "hadith_no": "499",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا محمد بن عبد الله بن نمير، وإسحاق بن إبراهيم، قال إسحاق أخبرنا وقال ابن نمير، حدثنا عمر بن عبيد الطنافسي، عن سماك بن حرب، عن موسى بن طلحة، عن أبيه، قال كنا نصلي والدواب تمر بين أيدينا فذكرنا ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ مثل مؤخرة الرحل تكون بين يدى أحدكم ثم لا يضره ما مر بين يديه ‏\"‏ ‏.‏ وقال ابن نمير ‏\"‏ فلا يضره من مر بين يديه ‏\"‏ ‏.‏",
      "text_en": " Musa b. Talha reported on the authority of his father:                      We used to say prayer and the animals moved in front of us. We mentioned it to the Messenger of Allah (may peace be upon him) and he said: If anything equal to the back of a saddle is in front of you, then what walks in front, no harm would come to him. Ibn Numair said: No harm would come whosoever walks in front.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "30123",
        "30312",
        "30212",
        "20346",
        "10770",
        "579",
        "6"
      ]
    },
    {
      "id": "sunan-abi-daud-996",
      "hadith_no": "996",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، ح وحدثنا أحمد بن يونس، حدثنا زائدة، ح وحدثنا مسدد، حدثنا أبو الأحوص، ح وحدثنا محمد بن عبيد المحاربي، وزياد بن أيوب، قالا حدثنا عمر بن عبيد الطنافسي، ح وحدثنا تميم بن المنتصر، أخبرنا إسحاق، - يعني ابن يوسف - عن شريك، ح وحدثنا أحمد بن منيع، حدثنا حسين بن محمد، حدثنا إسرائيل، كلهم عن أبي إسحاق، عن أبي الأحوص، عن عبد الله، وقال، إسرائيل عن أبي الأحوص، والأسود، عن عبد الله، أن النبي صلى الله عليه وسلم كان يسلم عن يمينه وعن شماله حتى يرى بياض خده ‏\"‏ السلام عليكم ورحمة الله السلام عليكم ورحمة الله ‏\"‏ ‏.‏ قال أبو داود وهذا لفظ حديث سفيان وحديث إسرائيل لم يفسره ‏.‏ قال أبو داود ورواه زهير عن أبي إسحاق ويحيى بن آدم عن إسرائيل عن أبي إسحاق عن عبد الرحمن بن الأسود عن أبيه وعلقمة عن عبد الله ‏.‏ قال أبو داود شعبة كان ينكر هذا الحديث - حديث أبي إسحاق - أن يكون مرفوعا ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Prophet (ﷺ) used to give the salutation to his left and right sides until the whiteness of his cheek was seen, (saying: \"Peace be upon you, and mercy of Allah\" twice.  AbuDawud said: This is a version of the tradition reported by AbuSufyan. The version of Isra'il did not explain it. AbuDawud said: This tradition has been narrated by Zubayr from AbuIshaq and Yahya ibn Adam from Isra'il from AbuIshaq from AbdurRahman ibn al-Aswad from his father from Alqamah on the authority of Abdullah ibn Mas'ud. AbuDawud said: Shu'bah used to reject this tradition, the tradition narrated by AbuIshaq as coming from the Prophet (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "30184",
        "20320",
        "30175",
        "20327",
        "35135",
        "30249",
        "20346",
        "20411",
        "20587"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2209",
      "hadith_no": "2209",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو كريب، حدثنا عمر بن عبيد الطنافسي، عن عبد الملك بن عمير، ح وحدثنا محمد بن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، عن عبد الملك بن عمير، عن عمرو بن حريث، عن سعيد بن زيد، عن النبي صلى الله عليه وسلم قال ‏\"‏ الكمأة من المن وماؤها شفاء للعين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " \"Sa'eed bin Zaid narrated that the Prophet (S.A.W) said:                     \"Truffles are a form of manna, and its liquid is a cure for the eye.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20346",
        "11368",
        "30170",
        "20173",
        "20020",
        "11368",
        "5202",
        "11"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2223-2",
      "hadith_no": "2223",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا عمر بن عبيد الطنافسي، عن سماك بن حرب، عن جابر بن سمرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يكون من بعدي اثنا عشر أميرا ‏\"‏ ‏.‏ قال ثم تكلم بشيء لم أفهمه فسألت الذي يليني فقال قال ‏\"‏ كلهم من قريش ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح  ‏.‏ حدثنا أبو كريب، حدثنا عمر بن عبيد، عن أبيه، عن أبي بكر بن أبي موسى، عن جابر بن سمرة، عن النبي صلى الله عليه وسلم مثل هذا الحديث وقد روي من غير وجه عن جابر بن سمرة ‏.‏ قال أبو عيسى هذا حديث حسن غريب يستغرب من حديث أبي بكر بن أبي موسى عن جابر بن سمرة ‏.‏ وفي الباب عن ابن مسعود وعبد الله بن عمرو ‏.‏",
      "text_en": " Simak bin Harb narrated from Jabir bin Samurah who said \" The Messenger of Allah(s.a.w) said:                     'There will be twelve Amir after me.\"' He said: \"Then he said something that I did not understand. So I asked the one who was next to me, who said that he(s.a.w) had said: 'All of them are from Quraish.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20346",
        "10770",
        "393"
      ]
    },
    {
      "id": "sunan-ibn-majah-434",
      "hadith_no": "434",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد بن السري، حدثنا أبو الأحوص، عن أشعث بن أبي الشعثاء، ح وحدثنا سفيان بن وكيع، حدثنا عمر بن عبيد الطنافسي، عن أشعث بن أبي الشعثاء، عن أبيه، عن مسروق، عن عائشة، أن رسول الله  صلى الله عليه وسلم  كان يحب التيمن في الطهور إذا تطهر وفي ترجله إذا ترجل وفي انتعاله إذا انتعل ‏.‏",
      "text_en": " It was narrated from 'Aishah that:                     The Messenger of Allah liked to start on the right when purifying himself, when combing his hair and when putting on his footwear.",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20327",
        "11324",
        "35047",
        "20346",
        "11324",
        "11351",
        "11018",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-591",
      "hadith_no": "591",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا عمر بن عبيد الطنافسي، حدثنا عمر بن المثنى، عن عطاء الخراساني، عن أنس بن مالك، قال كنت مع رسول الله  صلى الله عليه وسلم  في سفر فقال ‏\"‏ هل من ماء ‏\"‏ ‏.‏ فتوضأ ومسح على خفيه ثم لحق بالجيش فأمهم ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"I was with the Messenger of Allah on a journey, and he said: 'Is there any water?' He performed ablution and wiped over his leather socks, then he joined the army and led them (in prayer).\"",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20346",
        "10947",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-2347",
      "hadith_no": "2347",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا إسحاق بن إبراهيم بن حبيب، وسفيان بن وكيع، ومحمد بن عبيد بن ثعلبة الحماني، قالوا حدثنا عمر بن عبيد الطنافسي، حدثنا عطاء بن السائب، أو سماك - ولا أعلمه إلا سماكا - عن سعيد بن جبير عن ابن عمر قال كنت أبيع الإبل فكنت آخذ الذهب من الفضة والفضة من الذهب والدنانير من الدراهم والدراهم من الدنانير ‏.‏ فسألت النبي  صلى الله عليه وسلم  فقال ‏\"‏ إذا أخذت أحدهما وأعطيت الآخر فلا تفارق صاحبك وبينك وبينه لبس ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"I used to sell camels, and I used to buy gold for silver and silver for gold, Dinar for Dirham and Dirham for Dinar. I asked the Prophet (ﷺ) about that, and he said: 'If you take one of them and give the other, then you and your companion should not separate until everything is clear (i.e., the exchange is completed).’” (Hasan) Another chain with similar wording.",
      "usc_msa_ref": "",
      "chain": [
        "34027",
        "35047",
        "30213",
        "20346",
        "11068",
        "11050",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-3299",
      "hadith_no": "3299",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا عمر بن عبيد الطنافسي، عن سعيد بن مسروق، عن عباية بن رفاعة، عن جده، رافع بن خديج قال كنا مع رسول الله  صلى الله عليه وسلم  في سفر فقلت يا رسول الله إنا نكون في المغازي فلا يكون معنا مدى فقال ‏\"‏ ما أنهر الدم وذكر اسم الله عليه فكل غير السن والظفر فإن السن عظم والظفر مدى الحبشة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Rafi’ bin Khadij said:                      “We were with the Prophet(ﷺ) on a journey, and I said: ‘O Messenger of Allah, we are(sometimes) on military campaigns, and we have no knife with us.’Hesaid: ‘(Use) whatever causes the blood to flow, mention the NameofAllah and eat, but (do not use) teeth or nails, for the tooth is abone and the nail is the knife of the Ethiopians.”",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20346",
        "20016",
        "11179",
        "1986"
      ]
    }
  ],
  "total_hadiths": 9
}