{
  "id": "20349",
  "name": "Fadayl bin Ghazwan bin Jarir فضيل بن غزوان",
  "full_name": "Fadayl bin Ghazwan bin Jarir فضيل بن غزوان",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "140",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Dabi",
      "Client",
      "al-Kufi",
      "Imam"
    ]
  },
  "parents": [
    {
      "id": "15442",
      "name": "Ghzwan bin Jryr al-Dby غزوان بن جرير الضبي مولاهم الكوفي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "20356",
      "name": "Muhammad bin Fadayl bin Ghazwan محمد بن فضيل بن غزوان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "teachers": [
    {
      "id": "11349",
      "name": "Salman Abu Hazam al-Ashja'i سلمان أبو حازم الأشجعي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11011",
      "name": "Salim bin 'Abdullah bin 'Umar سالم بن عبد الله بن عمر بن الخطاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11406",
      "name": "Abu Zara' bin 'Amr /Harm أبو زرعة بن عمرو/هرم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18679",
      "name": "'Ubaidullah bin Talha عبيد الله بن طلحة بن عبيد الله",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11366",
      "name": "'Abdur Rahman bin Abi Na'm عبد الرحمن بن أبي نعم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11379",
      "name": "'Ammara bin al-Q'aqa' bin Shabrma عمارة بن القعقاع بن شبرمة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11335",
      "name": "Zubayd bin al-Harith زبيد بن الحارث اليامي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11874",
      "name": "'Abdullah bin Waqd عبد الله بن واقد بن عبد الله",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20356",
      "name": "Muhammad bin Fadayl bin Ghazwan محمد بن فضيل بن غزوان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20317",
      "name": "Hafs bin Ghyath حفص بن غياث",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20331",
      "name": "'Abdullah bin Numayr عبد الله بن نمير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20452",
      "name": "al-Fadl bin Musa al-Synany الفضل بن موسى السيناني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20608",
      "name": "Mus'ab bin al-Mqdam al-Khth'my مصعب بن المقدام الخثعمي مولاهم أبو عبد",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20411",
      "name": "Ishaq bin Yusuf bin Mrdas إسحاق بن يوسف بن مرداس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20333",
      "name": "'Abdur Rahman bin Muhammad al-Maharbi عبد الرحمن بن محمد بن زياد المحاربي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20372",
      "name": "Ya'la bin 'Ubaid bin Umayya al-Tanafasi يعلى بن عبيد بن أبي أمية الطنافسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "442",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا يوسف بن عيسى، قال حدثنا ابن فضيل، عن أبيه، عن أبي حازم، عن أبي هريرة، قال رأيت سبعين من أصحاب الصفة، ما منهم رجل عليه رداء، إما إزار وإما كساء، قد ربطوا في أعناقهم، فمنها ما يبلغ نصف الساقين، ومنها ما يبلغ الكعبين، فيجمعه بيده، كراهية أن ترى عورته‏.‏",
      "text_en": " Narrated Abu Huraira:                     I saw seventy of As-Suffa men and none of them had a Rida' (a garment covering the upper part of the body). They had either Izars (only) or sheets which they tied round their necks. Some of these sheets reached the middle of their legs and some reached their heels and they used to gather them with their hands lest their private parts should become naked.",
      "chain": [
        "30401",
        "20356",
        "20349",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "1766",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا علي بن عبد الله، حدثني يحيى بن سعيد، حدثنا فضيل بن غزوان، حدثنا عكرمة، عن ابن عباس  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم خطب الناس يوم النحر فقال ‏\"‏ يا أيها الناس‏.‏ أى يوم هذا ‏\"‏‏.‏ قالوا يوم حرام‏.‏ قال ‏\"‏ فأى بلد هذا ‏\"‏‏.‏ قالوا بلد حرام‏.‏ قال ‏\"‏ فأى شهر هذا ‏\"‏‏.‏ قالوا شهر حرام‏.‏ قال ‏\"‏ فإن دماءكم وأموالكم وأعراضكم عليكم حرام، كحرمة يومكم هذا، في بلدكم هذا في شهركم هذا ‏\"‏‏.‏ فأعادها مرارا، ثم رفع رأسه فقال ‏\"‏ اللهم هل بلغت اللهم هل بلغت ‏\"‏‏.‏ قال ابن عباس  رضى الله عنهما  فوالذي نفسي بيده إنها لوصيته إلى أمته  ‏\"‏ فليبلغ الشاهد الغائب، لا ترجعوا بعدي كفارا يضرب بعضكم رقاب بعض ‏\"‏‏.‏",
      "text_en": " Narrated `Ikrima:                     Ibn `Abbas said: \"Allah's Apostle delivered a sermon on the Day of Nahr, and said, 'O people! (Tell me) what is the day today?' The people replied, 'It is the forbidden (sacred) day.' He asked again, 'What town is this?' They replied, 'It is the forbidden (Sacred) town.' He asked, 'Which month is this?' They replied, 'It is the forbidden (Sacred) month.' He said, 'No doubt! Your blood, your properties, and your honor are sacred to one another like the sanctity of this day of yours, in this (sacred) town (Mecca) of yours, in this month of yours.' The Prophet repeated his statement again and again. After that he raised his head and said, 'O Allah! Haven't conveyed (Your Message) to them'. Haven't I conveyed Your Message to them?' \" Ibn `Abbas added, \"By Him in Whose Hand my soul is, the following was his will (Prophet's will) to his followers:--It is incumbent upon those who are present to convey this information to those who are absent Beware don't renegade (as) disbelievers (turn into infidels) after me, Striking the necks (cutting the throats) of one another.' \"",
      "chain": [
        "30026",
        "20031",
        "20349",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2613",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن جعفر أبو جعفر، حدثنا ابن فضيل، عن أبيه، عن نافع، عن ابن عمر  رضى الله عنهما  قال أتى النبي صلى الله عليه وسلم بيت فاطمة فلم يدخل عليها، وجاء علي فذكرت له ذلك فذكره للنبي صلى الله عليه وسلم قال ‏\"‏ إني رأيت على بابها سترا موشيا ‏\"‏‏.‏ فقال ‏\"‏ ما لي وللدنيا ‏\"‏‏.‏ فأتاها علي فذكر ذلك لها فقالت ليأمرني فيه بما شاء‏.‏ قال ترسل به إلى فلان‏.‏ أهل بيت بهم حاجة‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Once the Prophet went to the house of Fatima but did not enter it. `Ali came and she told him about that. When 'All asked the Prophet about it, he said, \"I saw a (multicolored) decorated curtain on her door. I am not interested in worldly things.\" `Ali went to Fatima and told her about it. Fatima said, \"I am ready to dispense with it in the way he suggests.\" The Prophet ordered her to send it to such-andsuch needy people. \"",
      "chain": [
        "20173",
        "20356",
        "20349",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3845",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا مسدد، حدثنا عبد الله بن داود، عن فضيل بن غزوان، عن أبي حازم، عن أبي هريرة  رضى الله عنه  أن رجلا، أتى النبي صلى الله عليه وسلم فبعث إلى نسائه فقلن ما معنا إلا الماء‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ من يضم، أو يضيف هذا ‏\"‏‏.‏ فقال رجل من الأنصار أنا‏.‏ فانطلق به إلى امرأته، فقال أكرمي ضيف رسول الله صلى الله عليه وسلم فقالت ما عندنا إلا قوت صبياني‏.‏ فقال هيئي طعامك، وأصبحي سراجك، ونومي صبيانك إذا أرادوا عشاء‏.‏ فهيأت طعامها وأصبحت سراجها، ونومت صبيانها، ثم قامت كأنها تصلح سراجها فأطفأته، فجعلا يريانه أنهما يأكلان، فباتا طاويين، فلما أصبح، غدا إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ ضحك الله الليلة  أو عجب  من فعالكما ‏\"‏ فأنزل الله ‏{‏ويؤثرون على أنفسهم ولو كان بهم خصاصة ومن يوق شح نفسه فأولئك هم المفلحون‏}‏",
      "text_en": " Narrated Abu Huraira:                     A man came to the Prophet. The Prophet sent a messenger to his wives (to bring something for that man to eat) but they said that they had nothing except water. Then Allah's Apostle said, \"Who will take this (person) or entertain him as a guest?\" An Ansar man said, \"I.\" So he took him to his wife and said to her, \"Entertain generously the guest of Allah's Apostle \" She said, \"We have got nothing except the meals of my children.\" He said, \"Prepare your meal, light your lamp and let your children sleep if they ask for supper.\" So she prepared her meal, lighted her lamp and made her children sleep, and then stood up pretending to mend her lamp, but she put it off. Then both of them pretended to be eating, but they really went to bed hungry. In the morning the Ansari went to Allah's Apostle who said, \"Tonight Allah laughed or wondered at your action.\" Then Allah revealed: \"But give them (emigrants) preference over themselves even though they were in need of that And whosoever is saved from the covetousness Such are they who will be successful.\" (59.9)",
      "chain": [
        "30175",
        "20330",
        "20349",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "4938",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني يعقوب بن إبراهيم بن كثير، حدثنا أبو أسامة، حدثنا فضيل بن غزوان، حدثنا أبو حازم الأشجعي، عن أبي هريرة  رضى الله عنه  قال أتى رجل رسول الله صلى الله عليه وسلم فقال يا رسول الله أصابني الجهد فأرسل إلى نسائه فلم يجد عندهن شيئا، فقال رسول الله صلى الله عليه وسلم ‏\"‏ ألا رجل يضيف هذه الليلة يرحمه الله ‏\"‏‏.‏ فقام رجل من الأنصار فقال أنا يا رسول الله‏.‏ فذهب إلى أهله فقال لامرأته ضيف رسول الله صلى الله عليه وسلم لا تدخريه شيئا‏.‏ قالت والله ما عندي إلا قوت الصبية‏.‏ قال فإذا أراد الصبية العشاء فنوميهم، وتعالى فأطفئي السراج ونطوي بطوننا الليلة‏.‏ ففعلت ثم غدا الرجل على رسول الله صلى الله عليه وسلم فقال ‏\"‏ لقد عجب الله عز وجل  أو ضحك  من فلان وفلانة ‏\"‏‏.‏ فأنزل الله عز وجل ‏{‏ويؤثرون على أنفسهم ولو كان بهم خصاصة‏}‏",
      "text_en": " Narrated Abu Huraira:                     A man came to Allah's Apostle and said, \"O Allah's Apostle! I am suffering from fatigue and hunger.\" The Prophet sent (somebody) to his wives (to get something), but the messenger found nothing with them. Then Allah's Apostle said (to his companions). \"Isn't there anybody who can entertain this man tonight so that Allah may be merciful to him?\" An Ansari man got up and said, \"I (will, entertain him), O Allah's Apostle!\" So he went to his wife and said to her, \"This is the guest of Allah's Apostle, so do not keep anything away from him.\" She said. \"By Allah, I have nothing but the children's food.\" He said, \"When the children ask for their dinner, put them to bed and put out the light; we shall not take our meals tonight,\" She did so. In the morning the Ansari man went to Allah's Apostle who said, \"Allah was pleased with (or He bestowed His Mercy) on so-and-so and his wife (because of their good deed).\" Then Allah revealed: 'But give them preference over themselves even though they were in need of that.' (59.9)",
      "chain": [
        "20184",
        "20318",
        "20349",
        "13"
      ]
    },
    {
      "hadith_no": "5428",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا يوسف بن عيسى، حدثنا محمد بن فضيل، عن أبيه، عن أبي حازم، عن أبي هريرة، قال ما شبع آل محمد صلى الله عليه وسلم من طعام ثلاثة أيام حتى قبض‏.‏",
      "text_en": "      Narrated Abu Huraira:                          The family of Muhammad did not eat their fill for three successive      days till he died.",
      "chain": [
        "30401",
        "20356",
        "20349",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "6537",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا محمد بن فضيل، عن أبيه، عن عمارة، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم ارزق آل محمد قوتا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"O Allah! Give food to the family of Muhammad.\"",
      "chain": [
        "30351",
        "20356",
        "20349",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "6869",
      "source": " Sahih Bukhari ",
      "chapter": "Limits and Punishments set by Allah (Hudood) - كتاب الحدود",
      "chapter_no": "86",
      "text_ar": "حدثني عمرو بن علي، حدثنا عبد الله بن داود، حدثنا فضيل بن غزوان، عن عكرمة، عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يزني الزاني حين يزني وهو مؤمن، ولا يسرق حين يسرق وهو مؤمن ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"When (a person) an adulterer commits illegal sexual intercourse then he is not a believer at the time he is doing it; and when somebody steals, then he is not a believer at the time he is stealing.\"",
      "chain": [
        "30153",
        "20330",
        "20349",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "6897",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا محمد بن المثنى، أخبرنا إسحاق بن يوسف، أخبرنا الفضيل بن غزوان، عن عكرمة، عن ابن عباس  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يزني العبد حين يزني وهو مؤمن، ولا يسرق حين يسرق وهو مؤمن، ولا يشرب حين يشرب وهو مؤمن، ولا يقتل وهو مؤمن ‏\"‏‏.‏ قال عكرمة قلت لابن عباس كيف ينزع الإيمان منه قال هكذا  وشبك بين أصابعه ثم أخرجها  فإن تاب عاد إليه هكذا وشبك بين أصابعه",
      "text_en": "      Narrated 'Ikrima from Ibn 'Abbas:                          Allah's Apostles said, \"When a slave (of Allah) commits illegal sexual     intercourse, he is not a believer at the time of committing it; and if     he steals, he is not a believer at the time of stealing; and if he      drinks an alcoholic drink, when he is not a believer at the time of      drinking it; and he is not a believer when he commits a murder,\"      'Ikrima said: I asked Ibn Abbas, \"How is faith taken away from him?\"      He said, Like this,\" by clasping his hands and then separating them,      and added, \"But if he repents, faith returns to him like this, by      clasping his hands again.",
      "chain": [
        "30170",
        "20411",
        "20349",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "6943",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا مسدد، حدثنا يحيى بن سعيد، عن فضيل بن غزوان، عن ابن أبي نعم، عن أبي هريرة  رضى الله عنه  قال سمعت أبا القاسم، صلى الله عليه وسلم يقول ‏\"‏ من قذف مملوكه وهو بريء مما قال، جلد يوم القيامة، إلا أن يكون كما قال ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard Abu-l-Qasim (the Prophet) saying, \"If somebody slanders his slave and the slave is free from what he says, he will be flogged on the Day of Resurrection unless the slave is really as he has described him.\"",
      "chain": [
        "30175",
        "20031",
        "20349",
        "11366",
        "13"
      ]
    },
    {
      "hadith_no": "7166",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا أحمد بن إشكاب، حدثنا محمد بن فضيل، عن أبيه، عن عكرمة، عن ابن عباس  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم ‏\"‏ لا ترتدوا بعدي كفارا، يضرب بعضكم رقاب بعض ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"Beware! Do not renegade as (disbelievers) after me by striking (cutting) the necks of one another.\"",
      "chain": [
        "30290",
        "20356",
        "20349",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "417",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، قالا حدثنا وكيع، ح وحدثنيه زهير بن حرب، حدثنا إسحاق بن يوسف الأزرق، جميعا عن فضيل بن غزوان، ح وحدثنا أبو كريب، محمد بن العلاء - واللفظ له - حدثنا ابن فضيل، عن أبيه، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاث إذا خرجن لا ينفع نفسا إيمانها لم تكن آمنت من قبل أو كسبت في إيمانها خيرا طلوع الشمس من مغربها والدجال ودابة الأرض ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) observed:                      When three things appear faith will not benefit one who has not previously believed or has derived no good from his faith: the rising of the sun in its place of setting, the Dajjal, and the beast of the earth.",
      "chain": [
        "30201",
        "30022",
        "20032",
        "20411",
        "20349",
        "20356",
        "20349",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "2388",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا واصل بن عبد الأعلى، وأبو كريب ومحمد بن يزيد الرفاعي - واللفظ لواصل - قالوا حدثنا محمد بن فضيل، عن أبيه، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تقيء الأرض أفلاذ كبدها أمثال الأسطوان من الذهب والفضة فيجيء القاتل فيقول في هذا قتلت ‏.‏ ويجيء القاطع فيقول في هذا قطعت رحمي ‏.‏ ويجيء السارق فيقول في هذا قطعت يدي ثم يدعونه فلا يأخذون منه شيئا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenaer (may peace be upon him) as saying:                      The earth will vomit long pieces of its liver like columns of gold and silver, and the murderer will come and say: It was for this that I committed murder. The breaker of family ties will come and say: It was for this that I broke the family ties; and the thief will come and say: It is for this that my hands were cut off. They will then leave it and will not take anything out of it.",
      "chain": [
        "30481",
        "20356",
        "20349",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "3954",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثني أبو كريب، محمد بن العلاء حدثنا محمد بن فضيل، عن أبيه، عن ابن أبي، نعم عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تبتاعوا الثمار حتى يبدو صلاحها ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      Do not sell the fruits until their good condition becomes evident.\"",
      "chain": [
        "30216",
        "20356",
        "20349",
        "11366",
        "13"
      ]
    },
    {
      "hadith_no": "4150",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء وواصل بن عبد الأعلى قالا حدثنا ابن فضيل، عن أبيه، عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ التمر بالتمر والحنطة بالحنطة والشعير بالشعير والملح بالملح مثلا بمثل يدا بيد فمن زاد أو استزاد فقد أربى إلا ما اختلفت ألوانه ‏\"‏ ‏.‏",
      "text_en": "  Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      Dates are to be paid for by dates, wheat by wheat, barley by barley, salt by salt, like for like, payment being made on the spot. He who made an addition or demanded an addition, in fact, dealt in usury except in case where their classes differ.",
      "chain": [
        "20356",
        "20349",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "4152",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو كريب، وواصل بن عبد الأعلى، قالا حدثنا ابن فضيل، عن أبيه، عن ابن أبي نعم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الذهب بالذهب وزنا بوزن مثلا بمثل والفضة بالفضة وزنا بوزن مثلا بمثل فمن زاد أو استزاد فهو ربا‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Mess-., nger (may peace be upon him) as saying:                      Gold is to be paid for by gold with equal weight, like for like, and silver is to be paid for by silver with equal weight, like for like. He who made an addition to it or demanded an addition dealt in usury.",
      "chain": [
        "30216",
        "30481",
        "20356",
        "20349",
        "11366",
        "13"
      ]
    },
    {
      "hadith_no": "4401",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا ابن نمير، ح وحدثنا محمد بن عبد الله بن، نمير حدثنا أبي، حدثنا فضيل بن غزوان، قال سمعت عبد الرحمن بن أبي نعم، حدثني أبو هريرة، قال قال أبو القاسم صلى الله عليه وسلم ‏\"‏ من قذف مملوكه بالزنا يقام عليه الحد يوم القيامة إلا أن يكون كما قال ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that Abu'l-Qasim (one of the names of Allah's Messenger [may peace be upon him]) said:                      He who accused his slave of adultery, punishment would be imposed upon him on the Day of Resurrection, except in case the accusation was as he had said.",
      "chain": [
        "30201",
        "30212",
        "30212",
        "20331",
        "20349",
        "11366",
        "13"
      ]
    },
    {
      "hadith_no": "4402",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثناه أبو كريب، حدثنا وكيع، ح وحدثني زهير بن حرب، حدثنا إسحاق بن، يوسف الأزرق كلاهما عن فضيل بن غزوان، بهذا الإسناد ‏.‏ وفي حديثهما سمعت أبا، القاسم صلى الله عليه وسلم نبي التوبة ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn Ghazwan (and the words are):                     \" I heard Abu'l-Qasim (may peace be upon him) as the Prophet of repentance.\"",
      "chain": [
        "30216",
        "20032",
        "30022",
        "20411",
        "20349"
      ]
    },
    {
      "hadith_no": "5480",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثني زهير بن حرب، حدثنا جرير بن عبد الحميد، عن فضيل بن غزوان، عن  أبي حازم الأشجعي، عن أبي هريرة، قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال إني مجهود ‏.‏ فأرسل إلى بعض نسائه فقالت والذي بعثك بالحق ما عندي إلا ماء ‏.‏ ثم أرسل إلى أخرى فقالت مثل ذلك حتى قلن كلهن مثل ذلك لا والذي بعثك بالحق ما عندي إلا ماء ‏.‏ فقال ‏\"‏ من يضيف هذا الليلة رحمه الله ‏\"‏ ‏.‏ فقام رجل من الأنصار فقال أنا يا رسول الله ‏.‏ فانطلق به إلى رحله فقال لامرأته هل عندك شىء ‏.‏ قالت لا إلا قوت صبياني ‏.‏ قال فعلليهم بشىء فإذا دخل ضيفنا فأطفئي السراج وأريه أنا نأكل فإذا أهوى ليأكل فقومي إلى السراج حتى تطفئيه ‏.‏ قال فقعدوا وأكل الضيف ‏.‏ فلما أصبح غدا على النبي صلى الله عليه وسلم فقال ‏\"‏ قد عجب الله من صنيعكما بضيفكما الليلة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that a person came to Allah's Messenger (may peace be upon him) and said:                      I am hard pressed by hunger. He sent (message) to one of his wives (to procure food for him). but she said: By Him Who has sent you with Truth, thrre is nothing with me (to serve him) but only water. He (the Holy Prophet) then sent the (same) message to another, and she gave the same reply, until all of them gave the same reply: By Him Who has sent thee with the Truth, there is nothing with me but only water, whereupon he (the Holy Prophet) said: Allah would show mercy to him who will entertain this guest tonight. A person from the Ansar stood up and said: Messenger of Allah, I (am ready to entertain). He took him to his house and said to his wife: Is there anything with you (to serve the gdest)? She said: No, but only a subsistence for our children. He said: Distract their attention with something, and when the guest enters extinguish the lamp and give him the impression that we are eating. So they sat down. and the guest had his meal. When it was morning he went to Allah's Apostle (may peace be upon him) who said: Allah was well pleased with what you both did for your guest this night.",
      "chain": [
        "30022",
        "20028",
        "20349",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "5481",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا وكيع، عن فضيل بن غزوان، عن أبي، حازم عن أبي هريرة، ‏.‏ أن رجلا، من الأنصار بات به ضيف فلم يكن عنده إلا قوته وقوت صبيانه فقال لامرأته نومي الصبية وأطفئي السراج وقربي للضيف ما عندك - قال - فنزلت هذه الآية ‏{‏ ويؤثرون على أنفسهم ولو كان بهم خصاصة‏}‏",
      "text_en": " Abu Huraira reported that a guest spent the night with a person from the Ansar who had nothing with him but food (sufficient) for his own self and his children. He said to his wife:                      (Lull) the children to sleep, and put out the lamp, and serve the guest with what you have with you. It was on this occasion that this verse was revealed:\" Those who prefer the needy to their own selves in spite of the fact that they are themselves in pressing need\" (Lix. 9).",
      "chain": [
        "30216",
        "20032",
        "20349",
        "11349"
      ]
    },
    {
      "hadith_no": "5482",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثناه أبو كريب، حدثنا ابن فضيل، عن أبيه، عن أبي حازم، عن أبي هريرة، قال جاء رجل إلى رسول الله صلى الله عليه وسلم ليضيفه فلم يكن عنده ما يضيفه فقال ‏\"‏ ألا رجل يضيف هذا رحمه الله ‏\"‏ ‏.‏ فقام رجل من الأنصار يقال له أبو طلحة فانطلق به إلى رحله ‏.‏ وساق الحديث بنحو حديث جرير وذكر فيه نزول الآية كما ذكره وكيع ‏.‏",
      "text_en": " Abu Huraira reported that a man came to Allah's Messenger (may peace be upon him) so that he should entertain him as a guest, but he had nothing with which he could entertain him. He, therefore, asked if there was any person who would entertain him (assuring the audience) that Allah would show mercy to him. A person from the Ansar who was called Abu Talha stood up and he took him to his house. The rest of the hadith is the same and mention is (also) made in that about the revelation of the verse as narrated by Waki'.",
      "chain": [
        "30216",
        "20356",
        "20349",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "6665",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء الهمداني حدثنا ابن فضيل، عن أبيه، عن عمارة، بن القعقاع عن أبي زرعة، عن أبي هريرة، قال قال رجل يا رسول الله من أحق بحسن الصحبة قال ‏\"‏ أمك ثم أمك ثم أمك ثم أبوك ثم أدناك أدناك ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that a person said:                      Allah's Messenger, who amongst the people is most deserving of my good treatment? He said: Your mother, again your mother, again your mother, then your father, then your nearest relatives according to the order (of nearness).",
      "chain": [
        "20356",
        "20349",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "7103",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثني أحمد بن عمر بن حفص الوكيعي، حدثنا محمد بن فضيل، حدثنا أبي، عن  طلحة بن عبيد الله بن كريز، عن أم الدرداء، عن أبي الدرداء، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما من عبد مسلم يدعو لأخيه بظهر الغيب إلا قال الملك ولك بمثل ‏\"‏ ‏.‏",
      "text_en": " Abu Dharr reported that Allah's Messenger (may peace be upon him) said:                      There is no believing servant who supplicates for his brother behind his back (in his absence) that the Angels do not say: The same be for you too.",
      "chain": [
        "20356",
        "20349",
        "18679",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "7365",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا أبو كريب، وأحمد بن عمر الوكيعي، قالا حدثنا ابن فضيل، عن أبيه، عن  أبي حازم، عن أبي هريرة، يرفعه قال ‏\"‏ ما بين منكبى الكافر في النار مسيرة ثلاثة أيام للراكب المسرع ‏\"‏ ‏.‏ ولم يذكر الوكيعي ‏\"‏ في النار ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported directly from Allah's Messenger (may peace be upon him) that he said:                      The distance of the two shoulders of the non-believer in Hell will be a three-day journey for a swift rider.",
      "chain": [
        "30216",
        "39005",
        "20356",
        "20349",
        "11172"
      ]
    },
    {
      "hadith_no": "7481",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا عبد الله بن عمر بن أبان، وواصل بن عبد الأعلى، وأحمد بن عمر الوكيعي، - واللفظ لابن أبان - قالوا حدثنا ابن فضيل، عن أبيه، قال سمعت سالم بن عبد الله، بن عمر يقول يا أهل العراق ما أسألكم عن الصغيرة وأركبكم للكبيرة سمعت أبي عبد الله بن عمر يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الفتنة تجيء من ها هنا ‏\"‏ ‏.‏ وأومأ بيده نحو المشرق ‏\"‏ من حيث يطلع قرنا الشيطان ‏\"‏ ‏.‏ وأنتم يضرب بعضكم رقاب بعض وإنما قتل موسى الذي قتل من آل فرعون خطأ فقال الله عز وجل له ‏{‏ وقتلت نفسا فنجيناك من الغم وفتناك فتونا‏}‏ قال أحمد بن عمر في روايته عن سالم لم يقل سمعت ‏.‏",
      "text_en": " Ibn Fudail reported on the authority of his father that he heard Salim b. 'Abdullah b. 'Umar as saying:                      O people of Iraq, how strange it is that you ask about the minor sins but commit major sins? I heard from my father 'Abdullah b. 'Umar, narrating that he heard Allah's Messenger (may peace be upon him) as saying while pointing his hand towards the east: Verily. the turmoil would come from this side, from where appear the horns of Satan and you would strike the necks of one another; and Moses killed a person from among the people of Pharaoh unintentionally and Allah, the Exalted and Glorious, said:\" You killed a person but We relieved you from the grief and tried you with (many a) trial\" (xx. 40). Ahmad b. Umar reported this hadith from Salim, but he did not make a mention of the words:\" I heard\".",
      "chain": [
        "30468",
        "30481",
        "20356",
        "20349",
        "11011"
      ]
    },
    {
      "hadith_no": "7630",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثني زهير بن حرب، حدثنا محمد بن فضيل، عن أبيه، عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم اجعل رزق آل محمد قوتا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      O Allah, make for the family of Muhammad the provision which is a bare subsistence.",
      "chain": [
        "30022",
        "20356",
        "20349",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "1212",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن عبيد المحاربي، حدثنا محمد بن فضيل، عن أبيه، عن نافع، وعبد الله بن واقد، أن مؤذن ابن عمر، قال الصلاة ‏.‏ قال سر سر ‏.‏ حتى إذا كان قبل غيوب الشفق نزل فصلى المغرب ثم انتظر حتى غاب الشفق وصلى العشاء ثم قال إن رسول الله صلى الله عليه وسلم كان إذا عجل به أمر صنع مثل الذي صنعت فسار في ذلك اليوم والليلة مسيرة ثلاث ‏.‏ قال أبو داود رواه ابن جابر عن نافع نحو هذا بإسناده ‏.‏",
      "text_en": " Narrated Abdullah ibn Waqid:                     The mu'adhdhin of Ibn Umar said: prayer (i.e. the time of prayer has come). He said: Go ahead. He then alighted before the disappearance. He then offered the night prayer. He then said: When the Messenger of Allah (ﷺ) was in a hurry about something, he would do as I did. Then he travelled and covered a distance of three days' journey on the day.Abu Dawud said: A similar tradition has been transmitted by Ibn Jabir from Nafi' with the same chain.",
      "chain": [
        "35135",
        "20356",
        "20349",
        "11014"
      ]
    },
    {
      "hadith_no": "4149",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا ابن نمير، حدثنا فضيل بن غزوان، عن نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم أتى فاطمة رضى الله عنها فوجد على بابها سترا فلم يدخل قال وقلما كان يدخل إلا بدأ بها فجاء علي رضي الله عنه فرآها مهتمة فقال ما لك قالت جاء النبي صلى الله عليه وسلم إلى فلم يدخل فأتاه علي رضى الله عنه فقال يا رسول الله إن فاطمة اشتد عليها أنك جئتها فلم تدخل عليها ‏.‏ قال ‏\"‏ وما أنا والدنيا وما أنا والرقم ‏\"‏ ‏.‏ فذهب إلى فاطمة فأخبرها بقول رسول الله صلى الله عليه وسلم فقالت قل لرسول الله صلى الله عليه وسلم ما يأمرني به ‏.‏ قال ‏\"‏ قل لها فلترسل به إلى بني فلان ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Messenger of Allah (ﷺ) came to Fatimah and found a curtain hanging at her door, so he did not enter. Whenever he entered (the house), he would visit her first. Then Ali came and found that Fatimah was grieved.  He asked: What is the matter with you?  She replied: The Messenger of Allah (ﷺ) came to me but did not enter (the house).  Ali then came to him and said: Messenger of Allah, Fatimah felt it keenly that you came to visit her but did not go in. He replied: What have I to do with this world? What have I to do with prints and figures (on the curtain)? He (Ali) then went to Fatimah and informed her of what the Messenger of Allah (ﷺ) had said.  She said: Ask the Messenger of Allah (ﷺ) what he me to do about it.  He (the Prophet) said: Tell her that she must send it to so-and-so.",
      "chain": [
        "30203",
        "30212",
        "20349",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4150",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا واصل بن عبد الأعلى الأسدي، حدثنا ابن فضيل، عن أبيه، بهذا الحديث قال وكان سترا موشيا ‏.‏",
      "text_en": " The tradition mentioned above has also been transmitted through a different chain of narrators by Ibn Fudail on his father's authority. This version has:                      \"The curtain was embellished.\"",
      "chain": [
        "20356",
        "20349"
      ]
    },
    {
      "hadith_no": "4687",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن فضيل بن غزوان، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما رجل مسلم أكفر رجلا مسلما فإن كان كافرا وإلا كان هو الكافر ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Umar reported the Messenger of Allah (May peace be upon him) as saying :                      If any believing man calls another believing man an unbeliever, if he is actually an infidel, it is all right ; if not, he will become an infidel.",
      "chain": [
        "30203",
        "20028",
        "20349",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5165",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا إبراهيم بن موسى الرازي، قال أخبرنا ح، وحدثنا مؤمل بن الفضل الحراني، قال أخبرنا عيسى، حدثنا فضيل، - يعني ابن غزوان - عن ابن أبي نعم، عن أبي هريرة، قال حدثني أبو القاسم، نبي التوبة صلى الله عليه وسلم قال ‏\"‏ من قذف مملوكه وهو بريء مما قال جلد له يوم القيامة حدا ‏\"‏ ‏.‏ قال مؤمل حدثنا عيسى عن الفضيل يعني ابن غزوان ‏.‏",
      "text_en": " Abu Hurairah said:                      Abu al-Qasim, the Prophet of Atonement (ﷺ) said to me: If anyone reviles his slave when he is innocent of what he said, he will be beaten on the Day of Resurrection.The transmitter Mu'ammal said: 'Isa narrated it to us from al-Fudial, that is, Ibn Ghazwan.",
      "chain": [
        "30309",
        "38659",
        "20347",
        "20349",
        "11366",
        "13"
      ]
    },
    {
      "hadith_no": "2073",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن محمد، أخبرنا عبد الله بن المبارك، عن فضيل بن غزوان، عن ابن أبي نعم، عن أبي هريرة، قال قال أبو القاسم صلى الله عليه وسلم نبي التوبة ‏\"‏ من قذف مملوكه بريئا مما قال له أقام عليه الحد يوم القيامة إلا أن يكون كما قال ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وابن أبي نعم هو عبد الرحمن بن أبي نعم البجلي يكنى أبا الحكم ‏.‏ وفي الباب عن سويد بن مقرن وعبد الله بن عمر ‏.‏",
      "text_en": " Abu Hurairah narrated that Abul-Qasim, the Prophet of Repentance, said :                     \"If somebody slanders his slave (by accusing him of committing illegal sexual intercourse) and the slave is innocent from what he says, Allah will impose the punishment upon him on the Day of Resurrection, unless it is as he said about him.\"",
      "chain": [
        "30304",
        "20025",
        "20349",
        "11366",
        "13"
      ]
    },
    {
      "hadith_no": "2193",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو حفص، عمرو بن علي حدثنا يحيى بن سعيد، حدثنا فضيل بن غزوان، حدثنا عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا ترجعوا بعدي كفارا يضرب بعضكم رقاب بعض ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عبد الله بن مسعود وجرير وابن عمر وكرز بن علقمة وواثلة بن الأسقع والصنابحي ‏.‏ وهذا حديث حسن صحيح ‏.‏",
      "text_en": " Ibn 'Abbas narrated that the Messenger of Allah(s.a.w) said:                     \"Do not revert to disbelief after me, some of you striking the necks of others.\"'",
      "chain": [
        "30286",
        "20031",
        "20349",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2208",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا واصل بن عبد الأعلى الكوفي، حدثنا محمد بن فضيل، عن أبيه، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تقيء الأرض أفلاذ كبدها أمثال الأسطوان من الذهب والفضة قال فيجيء السارق فيقول في مثل هذا قطعت يدي ويجيء القاتل فيقول في هذا قتلت ويجيء القاطع فيقول في هذا قطعت رحمي ثم يدعونه فلا يأخذون منه شيئا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah(s.a.w) said:                     \" The earth will throw out pieces of its liver(in sides): liver; gold and silver will come out like columns.\" He said: \"A thief will come and say: 'For this my hands were amputated?' A murderer will come and say: 'For this I killed?' One who severed ties of kinship will come and say: 'For this I severed the ties of kinship?' Then they will leave it without taking anything from it.\"'",
      "chain": [
        "20356",
        "20349",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "2780",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Description of Hellfire - كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "39",
      "text_ar": "حدثنا أبو كريب، حدثنا مصعب بن المقدام، عن فضيل بن غزوان، عن أبي حازم، عن أبي هريرة، رفعه قال ‏\"‏ ضرس الكافر مثل أحد ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وأبو حازم هو الأشجعي اسمه سلمان مولى عزة الأشجعية ‏.‏",
      "text_en": " Abu Hurairah narrated a Marfu' narration:                     \"The molar teeth of the disbeleiver will be like Uhud (mountain).\"",
      "chain": [
        "30216",
        "20608",
        "20349",
        "11349"
      ]
    },
    {
      "hadith_no": "3351",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا يعلى بن عبيد، عن فضيل بن غزوان، عن أبي حازم، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ ثلاث إذا خرجن ‏:‏ ‏(‏لم ينفع نفسا إيمانها لم تكن آمنت من قبل ‏)‏ الآية الدجال والدابة وطلوع الشمس من المغرب أو من مغربها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو حازم هو الأشجعي الكوفي واسمه سلمان مولى عزة الأشجعية ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Prophet (ﷺ) said: \"There are three, for which when they appear, a soul will not benefit by its faith, if it did not believe before the Signs: Ad-Dajjal, the Beast, and the rising of the sun from its setting place\" - or \"from the west.\"",
      "chain": [
        "30553",
        "20372",
        "20349",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "3586",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو هشام الرفاعي، حدثنا محمد بن فضيل، عن رشدين بن كريب، عن أبيه، عن ابن عباس، عن النبي صلى الله عليه وسلم قال ‏\"‏ إدبار النجوم الركعتان قبل الفجر وإدبار السجود الركعتان بعد المغرب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه مرفوعا إلا من هذا الوجه من حديث محمد بن فضيل عن رشدين بن كريب ‏.‏ قال أبو عيسى وسألت محمد بن إسماعيل عن محمد ورشدين ابنى كريب أيهما أوثق قال ما أقربهما ومحمد عندي أرجح ‏.‏ قال وسألت عبد الله بن عبد الرحمن عن هذا فقال ما أقربهما عندي ورشدين بن كريب أرجحهما عندي ‏.‏ قال والقول عندي ما قال أبو محمد ورشدين أرجح من محمد وأقدم وقد أدرك رشدين ابن عباس ورآه ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     that the Prophet (ﷺ) said: \"And at the setting of the stars (52:49) (about) the two Rak'ah before Fajr. And after the prostrations (50:40) 'The two Rak'at after Al-Maghrib.'\"",
      "chain": [
        "30478",
        "20356",
        "20349",
        "17"
      ]
    },
    {
      "hadith_no": "3618",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو كريب، حدثنا وكيع، عن فضيل بن غزوان، عن أبي حازم، عن أبي هريرة، أن رجلا، من الأنصار بات به ضيف فلم يكن عنده إلا قوته وقوت صبيانه فقال لامرأته نومي الصبية وأطفئي السراج وقربي للضيف ما عندك فنزلت هذه الآية ‏:‏ ‏(‏ ويؤثرون على أنفسهم ولو كان بهم خصاصة ‏)‏ هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated:                     That a man from the Ansar had a guest spend the night with him, but he did not have anything to eat but his meal and the meal for his children, so he said to his wife: ‘Put the children to sleep, extinguish the torches, and give me whatever you have with you for the guest.’ So this Ayah was revealed: And they give preference over themselves even though they were in need of that.”",
      "chain": [
        "30216",
        "20032",
        "20349",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "4559",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا واصل بن عبد الأعلى، قال حدثنا ابن فضيل، عن أبيه، عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ التمر بالتمر والحنطة بالحنطة والشعير بالشعير والملح بالملح يدا بيد فمن زاد أو ازداد فقد أربى إلا ما اختلفت ألوانه ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                     \"The Messenger of Allah said: 'Dates for dates, wheat for wheat, barley for barley, salt for salt, exchanged hand to hand. Whoever gives more or takes more has engaged in Riba unless they are of different types.\"",
      "chain": [
        "20356",
        "20349",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "4569",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا واصل بن عبد الأعلى، قال حدثنا محمد بن فضيل، عن أبيه، عن ابن أبي نعم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الذهب بالذهب وزنا بوزن مثلا بمثل والفضة بالفضة وزنا بوزن مثلا بمثل فمن زاد أو ازداد فقد أربى ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'Gold for god, weight for weight, like for like; and silver for silver, weight for weight, like for like. Whoever gives more or takes more has engaged in Riba.\"'",
      "chain": [
        "20356",
        "20349",
        "11366",
        "13"
      ]
    },
    {
      "hadith_no": "4869",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا عبد الرحمن بن محمد بن سلام، قال حدثنا إسحاق الأزرق، عن الفضيل بن غزوان، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يزني العبد حين يزني وهو مؤمن ولا يشرب الخمر حين يشربها وهو مؤمن ولا يسرق وهو مؤمن ولا يقتل وهو مؤمن ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah said: 'No one who commits Zina is a believer at the moment when he is committing Zina, and no one who drinks wine is a believer at the moment when he is drinking it, and no thief is a believer at the moment when he is stealing, and no killer is a believer at the moment he is killing",
      "chain": [
        "36587",
        "20411",
        "20349",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2340",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يعلى بن عبيد، حدثنا فضيل بن غزوان، عن ابن أبي نعم، عن أبي هريرة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ الفضة بالفضة والذهب بالذهب والشعير بالشعير والحنطة بالحنطة مثلا بمثل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet (ﷺ) said:                     '(Sell) silver for silver, gold for gold, barley for barley, wheat for wheat, like for like.\"",
      "chain": [
        "30201",
        "20372",
        "20349",
        "11366",
        "13"
      ]
    }
  ],
  "total_hadiths": 42
}