{
  "id": "20341",
  "name": "'Ubaid'h bin Hameed عبيدة بن حميد",
  "full_name": "'Ubaid'h bin Hameed عبيدة بن حميد",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "190",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  4  -  صدوق ]"
    ],
    "tags": [
      "B.Taym",
      "al-Laithi",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11368",
      "name": "'Abdul Malik bin 'Umayr al-Qabti عبد الملك بن عمير بن سويد القبطي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11257",
      "name": "'Abdul 'Aziz bin Rafi' عبد العزيز بن رفيع",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11323",
      "name": "al-Aswad bin Qays al-Bdy الأسود بن قيس العبدي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11067",
      "name": "Mansur bin al-Ma'tamar al-Salmi منصور بن المعتمر بن عبد الله السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10844",
      "name": "Yazid bin Abi Ziyad يزيد بن أبي زياد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11395",
      "name": "Matruf bin Tarayf al-Harithi مطرف بن طريف",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10763",
      "name": "Rakayn bin al-Rabi' bin 'Amila ركين بن الربيع",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11068",
      "name": "Ata'a bin al-Sa'ib al-Thaqifi عطاء بن السائب الثقفي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10802",
      "name": "'Ammar bin Mua'wiya bin Aslam al-Dahni عمار بن معاوية الدهني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11894",
      "name": "'Amarah bin Ghazya bin al-Harith عمارة بن غزية بن الحارث",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11399",
      "name": "Musa bin Abi Aa'isha موسى بن أبي عائشة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10766",
      "name": "Sa'd bin Tariq, Abu Malik سعد بن طارق بن أشيم أبو مالك الأشجعي",
      "grade": "Follower(Tabi')"
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30376",
      "name": "Muhammad bin Salam al-Baykandi محمد بن سلام البيكندي الكبير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30207",
      "name": "Frwh bin Abi al-Mghra'a فروة بن أبي المغراء",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30245",
      "name": "al-Hasan bin Muhammad al-Za'farani الحسن بن محمد الصباح الزعفراني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38072",
      "name": "Abu Thaur al-Kalbi إبراهيم بن خالد أبو ثور الكلبي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30242",
      "name": "Ahmed bin Manay' أحمد بن منيع",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20387",
      "name": "'Ali bin Hujr bin Iyas bin Maqatil علي بن حجر بن إياس بن مقاتل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30480",
      "name": "Hanad bin al-Sari bin Mus'ab هناد بن السري بن مصعب",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1655",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثني الحسن بن محمد  هو الزعفراني  حدثنا عبيدة بن حميد، حدثني عبد العزيز بن رفيع، قال رأيت عبد الله بن الزبير  رضى الله عنهما  يطوف بعد الفجر، ويصلي ركعتين‏.‏   قال عبد العزيز ورأيت عبد الله بن الزبير يصلي ركعتين بعد العصر، ويخبر أن عائشة  رضى الله عنها  حدثته أن النبي صلى الله عليه وسلم لم يدخل بيتها إلا صلاهما‏.‏",
      "text_en": " Narrated Abida bin Humaid:                     `Abdul, `Aziz bin Rufa`i said, \"I saw `Abdullah bin Az-Zubair performing Tawaf of the Ka`ba after the morning prayer then offering the two rak`at prayer.\" `Abdul `Aziz added, \"I saw `Abdullah bin Az-Zubair offering a two rak`at prayer after the `Asr prayer.\" He informed me that Aisha told him that the Prophet used to offer those two rak`at whenever he entered her house.\"",
      "chain": [
        "30245",
        "20341",
        "11257"
      ]
    },
    {
      "hadith_no": "6124",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا ابن سلام، أخبرنا عبيدة بن حميد أبو عبد الرحمن، عن منصور، عن مجاهد، عن ابن عباس، قال خرج النبي صلى الله عليه وسلم من بعض حيطان المدينة، فسمع صوت إنسانين يعذبان في قبورهما فقال ‏\"‏ يعذبان، وما يعذبان في كبيرة، وإنه لكبير، كان أحدهما لا يستتر من البول، وكان الآخر يمشي بالنميمة ‏\"‏‏.‏ ثم دعا بجريدة فكسرها بكسرتين أو ثنتين، فجعل كسرة في قبر هذا، وكسرة في قبر هذا، فقال ‏\"‏ لعله يخفف عنهما ما لم ييبسا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Once the Prophet went through the grave-yards of Medina and heard the voices of two humans who were being tortured in their graves. The Prophet said, \"They are being punished, but they are not being punished because of a major sin, yet their sins are great. One of them used not to save himself from (being soiled with) the urine, and the other used to go about with calumnies (Namima).\" Then the Prophet asked for a green palm tree leaf and split it into two pieces and placed one piece on each grave, saying, \"I hope that their punishment may be abated as long as these pieces of the leaf are not dried.\"",
      "chain": [
        "30376",
        "20341",
        "11067",
        "11028",
        "17"
      ]
    },
    {
      "hadith_no": "6463",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا فروة بن أبي المغراء، حدثنا عبيدة بن حميد، عن عبد الملك بن عمير، عن مصعب بن سعد بن أبي وقاص، عن أبيه  رضى الله عنه  قال كان النبي صلى الله عليه وسلم يعلمنا هؤلاء الكلمات كما تعلم الكتابة ‏\"‏ اللهم إني أعوذ بك من البخل، وأعوذ بك من الجبن، وأعوذ بك أن نرد إلى أرذل العمر، وأعوذ بك من فتنة الدنيا، وعذاب القبر ‏\"‏‏.‏",
      "text_en": " Narrated Sa`d bin Abi Waqqas:                     The Prophet used to teach us these words as he used to teach us the Book (Qur'an): \"O Allah! seek refuge with You from miserliness, and seek refuge with You from cowardice, and seek refuge with You from being brought back to (senile) geriatric old age, and seek refuge with You from the affliction of the world and from the punishment in the Hereafter.\"",
      "chain": [
        "30207",
        "20341",
        "11368",
        "10556",
        "9"
      ]
    },
    {
      "hadith_no": "206",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبيدة بن حميد الحذاء، عن الركين بن الربيع، عن حصين بن قبيصة، عن علي، - رضى الله عنه - قال كنت رجلا مذاء فجعلت أغتسل حتى تشقق ظهري فذكرت ذلك للنبي صلى الله عليه وسلم - أو ذكر له - فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تفعل إذا رأيت المذى فاغسل ذكرك وتوضأ وضوءك للصلاة فإذا فضخت الماء فاغتسل ‏\"‏ ‏.‏",
      "text_en": " ‘Ali said:                      My prostatic fluid flowed excessively. I used to take a bath until my back cracked (because of frequent washing). I mentioned it to the prophet (May peace be upon him), or the fact was mentioned to him (by someone else). The Messenger of Allah (May peace be upon him) said; Do not do so. When you find prostatic fluid, wash your penis and perform ablution as you do for your prayer, but when you have seminal emission, you should take a bath.",
      "chain": [
        "30367",
        "20341",
        "10763",
        "15100",
        "5"
      ]
    },
    {
      "hadith_no": "400",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا عبيدة بن حميد، عن أبي مالك الأشجعي، سعد بن طارق عن كثير بن مدرك، عن الأسود، أن عبد الله بن مسعود، قال كانت قدر صلاة رسول الله صلى الله عليه وسلم في الصيف ثلاثة أقدام إلى خمسة أقدام وفي الشتاء خمسة أقدام إلى سبعة أقدام ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The extent of the shadow when the Messenger of Allah prayed (the noon prayer) was three to five feet in summer and five to seven feet in winter.",
      "chain": [
        "30203",
        "20341",
        "10766",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "1649",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبيدة بن حميد التيمي، حدثني أبو الزعراء، عن أبي الأحوص، عن أبيه، مالك بن نضلة قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الأيدي ثلاثة فيد الله العليا ويد المعطي التي تليها ويد السائل السفلى فأعط الفضل ولا تعجز عن نفسك ‏\"‏ ‏.‏",
      "text_en": " Narrated Malik ibn Nadlah:                     The Prophet (ﷺ) said: Hands are of three types: Allah's hand is the upper one; the bestower's hand is the one near it; the beggar's hand is the lower one. So bestow what is surplus, and do not submit yourself to the demand of your soul.",
      "chain": [
        "30007",
        "20341",
        "20327"
      ]
    },
    {
      "hadith_no": "2534",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا عبيدة بن حميد، عن الأسود بن قيس، عن نبيح العنزي، عن جابر بن عبد الله، حدث عن رسول الله صلى الله عليه وسلم أنه أراد أن يغزو فقال ‏:‏ ‏\"‏ يا معشر المهاجرين والأنصار، إن من إخوانكم قوما ليس لهم مال ولا عشيرة فليضم أحدكم إليه الرجلين أو الثلاثة فما لأحدنا من ظهر يحمله إلا عقبة كعقبة ‏\"‏ ‏.‏ يعني أحدهم ‏.‏ فضممت إلى اثنين أو ثلاثة، قال ‏:‏ ما لي إلا عقبة كعقبة أحدهم من جملي ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     Once the Messenger of Allah (ﷺ) intended to go on an expedition. He said: O group of the emigrants (Muhajirun) and the helpers (Ansar), among your brethren there are people who have neither property nor family. So one of you should take with him two or three persons; with me. I also rode on my camel by turns like one of them.",
      "chain": [
        "31160",
        "20341",
        "11323",
        "34"
      ]
    },
    {
      "hadith_no": "134",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة، حدثنا عبيدة بن حميد، عن الأعمش، عن ثابت بن عبيد، عن القاسم بن محمد، قال قالت لي عائشة قال لي رسول الله صلى الله عليه وسلم ‏\"‏ ناوليني الخمرة من المسجد ‏\"‏ ‏.‏ قالت قلت إني حائض ‏.‏ قال ‏\"‏ إن حيضتك ليست في يدك ‏\"‏ ‏.‏ قال وفي الباب عن ابن عمر وأبي هريرة ‏.‏ قال أبو عيسى حديث عائشة حديث حسن صحيح ‏.‏ وهو قول عامة أهل العلم لا نعلم بينهم اختلافا في ذلك بأن لا بأس أن تتناول الحائض شيئا من المسجد ‏.‏",
      "text_en": " Aishah narrated:                     \"Allah's Messenger said to me: 'Bring me the Khumrah from the Masjid.' She said: \"I said: 'I am menstruating.' He said: 'Indeed your menstruation is not in your hand.'\"",
      "chain": [
        "30367",
        "20341",
        "11060",
        "10751",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "2178",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا عبيدة بن حميد، عن الأعمش، عن أبي صالح، عن أبي هريرة، أراه رفعه قال ‏\"‏ من قتل نفسه بحديدة جاء يوم القيامة وحديدته في يده يتوجأ بها في بطنه في نار جهنم خالدا مخلدا أبدا ومن قتل نفسه بسم فسمه في يده يتحساه في نار جهنم خالدا مخلدا أبدا ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated (from the Messenger of Allah (s.a.w)):                     \"Whoever kills himself with (an instrument of)iron, he will come on the Day Of Judgment with his iron in his hand, to continually stab himself in his stomach with it, in the fire of Jahannam, dwelling in that state eternally. And whoever kills himself with poison, then his poison will be in his hand, to continually take it in the Fire of Jahannam, dwelling in that state eternally.\"",
      "chain": [
        "30242",
        "20341",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2726",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، حدثنا فروة بن أبي المغراء، أخبرنا عبيدة بن حميد، عن عطاء بن السائب، عن عمرو بن ميمون، عن عبد الله بن مسعود، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن المرأة من نساء أهل الجنة ليرى بياض ساقها من وراء سبعين حلة حتى يرى مخها وذلك بأن الله يقول‏:‏ ‏(‏كأنهن الياقوت والمرجان ‏)‏ فأما الياقوت فإنه حجر لو أدخلت فيه سلكا ثم استصفيته لأريته من ورائه ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin Mas'ud narrated that the Prophet (s.a.w) said:                     \"Indeed, a woman from the wives of the people of Paradise, the whiteness of her shin is visible through seventy garments until her marrow is seen, and that is because Allah, he Exalted, says: As if they are corundum and Marjan. So, as for the corundum, it is a stone that if you were to enter a wire through it, then you polished its cloudiness away, you would surely be able to see it through it.\"",
      "chain": [
        "30025",
        "30207",
        "20341",
        "11068",
        "11382",
        "16"
      ]
    },
    {
      "hadith_no": "2727",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا هناد، حدثنا عبيدة بن حميد، عن عطاء بن السائب، عن عمرو بن ميمون، عن عبد الله بن مسعود، عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "30480",
        "20341",
        "11068",
        "11382",
        "16"
      ]
    },
    {
      "hadith_no": "2625",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا عبيدة بن حميد، عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يزني الزاني حين يزني وهو مؤمن ولا يسرق السارق حين يسرق وهو مؤمن ولكن التوبة معروضة ‏\"‏ ‏.‏ وفي الباب عن ابن عباس وعائشة وعبد الله بن أبي أوفى ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح غريب من هذا الوجه ‏.‏ - وقد روي عن أبي هريرة عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا زنى العبد خرج منه الإيمان فكان فوق رأسه كالظلة فإذا خرج من ذلك العمل عاد إليه الإيمان ‏\"‏ ‏.‏ وقد روي عن أبي جعفر محمد بن علي أنه قال في هذا خرج من الإيمان إلى الإسلام ‏.‏ وقد روي من غير وجه عن النبي صلى الله عليه وسلم أنه قال في الزنا والسرقة ‏\"‏ من أصاب من ذلك شيئا فأقيم عليه الحد فهو كفارة ذنبه ومن أصاب من ذلك شيئا فستر الله عليه فهو إلى الله إن شاء عذبه يوم القيامة وإن شاء غفر له ‏\"‏ ‏.‏ روى ذلك علي بن أبي طالب وعبادة بن الصامت وخزيمة بن ثابت عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Messenger of Allah (ﷺ) said: \"The adulterer is not a believer while he is committing adultery, and the thief is not a believer while he is stealing, but there is a chance for repentance; (if he repents, Allah will accept the repentance).\"",
      "chain": [
        "30242",
        "20341",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2986",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا عبيدة بن حميد، عن يوسف بن صهيب، عن حبيب بن يسار، عن زيد بن أرقم، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من لم يأخذ من شاربه فليس منا ‏\"‏ ‏.‏ وفي الباب عن المغيرة بن شعبة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Zaid bin Arqam:                     that the Messenger of Allah (ﷺ) said: \"Whoever does not take from his mustache, then he is not from us.\"",
      "chain": [
        "30242",
        "20341",
        "15649",
        "15082",
        "384"
      ]
    },
    {
      "hadith_no": "3010",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا عبيدة بن حميد، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، أن النبي صلى الله عليه وسلم لعن الواشمات والمستوشمات والمتنمصات مبتغيات للحسن مغيرات خلق الله ‏.‏ قال هذا حديث حسن صحيح ‏.‏ وقد رواه شعبة وغير واحد من الأئمة عن منصور ‏.‏",
      "text_en": " Narrated 'Abdullah:                     that the Prophet (ﷺ) cursed the women who practice tattooing and those who seek to be tattooed, the women who remove hair from their faces seeking beautification by changing the creation of Allah.",
      "chain": [
        "30242",
        "20341",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "3514",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا عبيدة بن حميد، عن يزيد بن أبي زياد، عن عبد الله بن الحارث، عن العباس بن عبد المطلب، قال قلت يا رسول الله علمني شيئا أسأله الله عز وجل ‏.‏ قال ‏\"‏ سل الله العافية ‏\"‏ ‏.‏ فمكثت أياما ثم جئت فقلت يا رسول الله علمني شيئا أسأله الله ‏.‏ فقال لي ‏\"‏ يا عباس يا عم رسول الله سل الله العافية في الدنيا والآخرة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏ وعبد الله بن الحارث بن نوفل قد سمع من العباس بن عبد المطلب ‏.‏",
      "text_en": " Al-Abbas bin Abdul-Muttalib said:                     “I said: ‘O Messenger of Allah, teach me something that I may ask Allah, [Mighty and Sublime] for.’ He said: ‘Ask Allah for Al-Afiyah.’ Then I remained for a day, then I came and said: ‘O Messenger of Allah, teach me something that I may ask Allah for.’ So he said to me: “O Abbas, O uncle of the Messenger of Allah! Ask Allah for Al-Afiyah in the world and in the Hereafter.”",
      "chain": [
        "30242",
        "20341",
        "10844",
        "912",
        "100"
      ]
    },
    {
      "hadith_no": "13",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا عبيدة بن حميد، عن يوسف بن صهيب، عن حبيب بن يسار، عن زيد بن أرقم، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من لم يأخذ شاربه فليس منا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Zaid bin Arqam said:                      \"The Messenger of Allah (ﷺ) said: 'Whoever does not trim his mustache, he is not from one of us.'\"",
      "chain": [
        "20387",
        "20341",
        "15649",
        "15082",
        "384"
      ]
    },
    {
      "hadith_no": "194",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة بن سعيد، وعلي بن حجر، - واللفظ لقتيبة - قال حدثنا عبيدة بن حميد، عن الركين بن الربيع، عن حصين بن قبيصة، عن علي، - رضى الله عنه - قال كنت رجلا مذاء فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ إذا رأيت المذى فاغسل ذكرك وتوضأ وضوءك للصلاة وإذا فضخت الماء فاغتسل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ali said:                      \"I was one who had a lot of prostatic discharge, and the Messenger of Allah (ﷺ) said to me: 'If you see Madhi (prostatic fluid) then wash your penis and perform Wudu' like that for Salah, but if you ejaculate semen, then perform Ghusl.'\"",
      "chain": [
        "30367",
        "20387",
        "20341",
        "10763",
        "15100",
        "5"
      ]
    },
    {
      "hadith_no": "236",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا قتيبة بن سعيد، حدثنا عبيدة بن حميد، عن منصور، عن إبراهيم، عن الأسود، عن عائشة، - رضى الله عنها - قالت لقد رأيتني أنازع رسول الله صلى الله عليه وسلم الإناء أغتسل أنا وهو منه ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"I remember competing over the vessel with the Messenger of Allah (ﷺ), when he and I were using it to perform Ghusl.\"",
      "chain": [
        "30367",
        "20341",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "413",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا عبيدة بن حميد، عن منصور، عن إبراهيم، عن الأسود، عن عائشة، قالت لقد رأيتني أنازع رسول الله صلى الله عليه وسلم الإناء أغتسل أنا وهو منه ‏‏.‏‏",
      "text_en": " It was narrated that 'Aishah said:                      \"I remember competing over the vessel [1] with the Messenger of Allah (ﷺ), when he and I were performing Ghusl from it.\"[1] See the following narration and no. 240.",
      "chain": [
        "30367",
        "20341",
        "11067",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "507",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا أبو عبد الرحمن عبد الله بن محمد الأذرمي، قال حدثنا عبيدة بن حميد، عن أبي مالك الأشجعي، سعد بن طارق عن كثير بن مدرك، عن الأسود بن يزيد، عن عبد الله بن مسعود، قال كان قدر صلاة رسول الله صلى الله عليه وسلم الظهر في الصيف ثلاثة أقدام إلى خمسة أقدام وفي الشتاء خمسة أقدام إلى سبعة أقدام ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Mas'ud said:                      \"The Prophet (ﷺ) prayed Zuhr when the length of (a person's shadow) was between three and five feet in summer, and between five and seven feet in winter.\"",
      "chain": [
        "20341",
        "10766",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "1677",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا علي بن هاشم بن مرزوق، حدثنا عبيدة بن حميد، حدثنا يحيى بن عبيد الله، عن عبيد الله بن مسلم الحضرمي، عن معاذ بن جبل، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ والذي نفسي بيده إن السقط ليجر أمه بسرره إلى الجنة إذا احتسبته ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Mu’adh bin Jabal that the Prophet (ﷺ) said:                     “Bythe One in Whose Hand is my soul! The miscarried fetus will draghismother by his umbilical cord to Paradise, if she (was patient and)sought reward (for her loss).”",
      "chain": [
        "20341",
        "10841",
        "5162",
        "32"
      ]
    },
    {
      "hadith_no": "2500",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبيدة بن حميد، عن منصور، عن زياد بن عمرو بن هند، عن ابن حذيفة، - هو عمران - عن أم المؤمنين، ميمونة قال كانت تدان دينا فقال لها بعض أهلها لا تفعلي وأنكر ذلك عليها قالت بلى إني سمعت نبيي وخليلي صلى الله عليه وسلم يقول ‏\"‏ ما من مسلم يدان دينا يعلم الله منه أنه يريد أداءه إلا أداه الله عنه في الدنيا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that :                     the Mother of the Believers Maimunah used to take out loans frequently, and some of her family said: “Do not that,” and they denounced her for that. She said: “No. I heard my Prophet (ﷺ)  and my close friend say: ‘There is no Muslim who takes out a loan and Allah(SWT) knows that he intends to pay it back, but Allah(SWT) will pay it back for him in this world.'”",
      "chain": [
        "30201",
        "20341",
        "11067"
      ]
    },
    {
      "hadith_no": "3427",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا أحمد بن منيع، أنبأنا عبيدة بن حميد، عن حميد، عن أنس، قال كان النبي  صلى الله عليه وسلم  يحب القرع ‏.‏",
      "text_en": " It wasnarrated that Anas said:                      “The Prophet (ﷺ) like gourd.”",
      "chain": [
        "30242",
        "20341",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "3884",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبيدة بن حميد، عن منصور، عن الشعبي، عن أم سلمة، ‏.‏ أن النبي  صلى الله عليه وسلم  كان إذا خرج من منزله قال ‏\"‏ اللهم إني أعوذ بك أن أضل أو أزل أو أظلم أو أظلم أو أجهل أو يجهل على ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Salamah that whenever he left his house, the Prophet (ﷺ) would say:                      “Allahumma inni a’udhu bika an adilla aw azilla, aw azlima aw uzlama, aw ajhala aw yujhala ‘alayya (O Allah, I seek refuge with You from going astray or stumbling, from wronging others or being wronged, and from behaving or being treated in an ignorant manner).”",
      "chain": [
        "30201",
        "20341",
        "11067",
        "11052"
      ]
    }
  ],
  "total_hadiths": 24
}