{
  "id": "20344",
  "name": "'Uqba bin Khalid bin 'Uqba - al-Majdar عقبة بن خالد بن عقبة السكوني المجدر",
  "full_name": "'Uqba bin Khalid bin 'Uqba - al-Majdar عقبة بن خالد بن عقبة السكوني المجدر",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "188",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ع  -  صدوق ]"
    ],
    "tags": [
      "al-Sakuni",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "35035",
      "name": "Khalid bin 'Uqba خالد بن عقبة",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "teachers": [
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "15196",
      "name": "Sa'id bin al-Mrzban al-Bsy سعيد بن المرزبان العبسي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20727",
      "name": "Muhammad bin 'Abdur Rahman bin Abi Layla محمد بن عبد الرحمن بن أبي ليلى",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "11073",
      "name": "Sa'id bin Abi 'Aruba سعيد بن أبي عروبة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "12532",
      "name": "Musa bin Muhammad bin Ibrahim موسى بن محمد بن إبراهيم بن الحارث",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "30213",
      "name": "Muhammad bin 'Ubaid al-Tanafasi محمد بن عبيد بن أبي أمية الطنافسي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "20348",
      "name": "al-Fadl bin Dakayn, Abu Na'eem الفضل بن دكين أبو نعيم الملائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30546",
      "name": "Sahl bin 'Uthman bin Fars سهل بن عثمان بن فارس",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30376",
      "name": "Muhammad bin Salam al-Baykandi محمد بن سلام البيكندي الكبير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30212",
      "name": "Muhammad bin 'Abdullah bin Numayr محمد بن عبد الله بن نمير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30200",
      "name": "'Abdullah bin Sa'id al-Ashaj عبد الله بن سعيد بن حصين الكندي - الأشج",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "7204",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا عبد الله بن سعيد الكندي، حدثنا عقبة بن خالد، حدثنا عبيد الله، عن خبيب بن عبد الرحمن، عن جده، حفص بن عاصم عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يوشك الفرات أن يحسر عن كنز من ذهب، فمن حضره فلا يأخذ منه شيئا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"Soon the river \"Euphrates\" will disclose the treasure (the mountain) of gold, so whoever will be present at that time should not take anything of it.\" Al-A'raj narrated from Abii Huraira that the Prophet said the same but he said, \"It (Euphrates) will uncover a mountain of gold (under it).",
      "chain": [
        "20344",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "hadith_no": "1625",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثناه ابن المثنى، وعبيد الله بن سعيد، قالا حدثنا يحيى، وهو القطان ح وحدثناه أبو كريب، أخبرنا ابن أبي زائدة، ح وحدثناه ابن نمير، حدثنا عقبة بن خالد، كلهم عن عبيد الله، بهذا الإسناد نحوه ‏.‏",
      "text_en": " A hadith like this has been narrated by the same chain of transmitters.",
      "chain": [
        "30359",
        "20031",
        "20031",
        "30216",
        "20366",
        "30212",
        "20344"
      ]
    },
    {
      "hadith_no": "2839",
      "source": " Sahih Muslim ",
      "chapter": "The Book of I'tikaf - كتاب الاعتكاف",
      "chapter_no": "15",
      "text_ar": "وحدثنا سهل بن عثمان، حدثنا عقبة بن خالد السكوني، عن عبيد الله بن عمر، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، - رضى الله عنها - قالت كان رسول الله صلى الله عليه وسلم يعتكف العشر الأواخر من رمضان ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported that the Messenger of Allah (may peace be upon him) used to observe i'tikaf in the last ten days of Ramadan.",
      "chain": [
        "30546",
        "20344",
        "11201",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "3703",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عقبة بن خالد، ح وحدثنا عمرو الناقد، حدثنا الأسود بن عامر، حدثنا زهير، ح وحدثنا مجاهد بن موسى، حدثنا يونس بن محمد، حدثنا شريك، كلهم عن هشام، بهذا الإسناد أن سودة، لما كبرت ‏.‏ بمعنى حديث جرير وزاد في حديث شريك قالت وكانت أول امرأة تزوجها بعدي ‏.‏",
      "text_en": " A hadith like this has been transmitted on the authority of Hisham with the same chain of narrators (and the words are):                      When Sauda became old (the rest of the hadith is the same) and in the narration of Sharik there is an addition (of these words:\" She was the first woman whom he (Allah's Apostle) married after me.\"",
      "chain": [
        "30201",
        "20344",
        "30263",
        "20380",
        "20321",
        "30521",
        "20393"
      ]
    },
    {
      "hadith_no": "4652",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا سهل بن عثمان، أخبرني عقبة بن خالد السكوني، عن عبيد الله، عن  نافع، عن عبد الله بن عمر، قال حرق رسول الله صلى الله عليه وسلم نخل بني النضير‏.‏",
      "text_en": " 'Abdullah b. Umar reported that Allah's Apostle (may peace be upon him) burnt the date-palms of Banu Nadir.",
      "chain": [
        "30546",
        "20344",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5595",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، ح وحدثنيه زهير بن حرب،حدثنا يحيى بن سعيد، ح وحدثنا ابن المثنى، حدثنا خالد بن الحارث، ح وحدثنا سهل،بن عثمان حدثنا عقبة بن خالد، كلهم عن عبيد الله، عن نافع، عن ابن عمر، عن النبي صلىالله عليه وسلم بهذا الحديث في خاتم الذهب وزاد في حديث عقبة بن خالد وجعله فييده اليمنى ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn 'Umar through other chains of transmitters but with a slight variation of wording.",
      "chain": [
        "30201",
        "20352",
        "20226",
        "20344",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "7456",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو مسعود، سهل بن عثمان حدثنا عقبة بن خالد السكوني، عن عبيد، الله عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يوشك الفرات أن يحسر عن كنز من ذهب فمن حضره فلا يأخذ منه شيئا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The Last Hour would not come unless the Euphrates would uncover a treasure of gold, so he who finds it should not take anything out of that.",
      "chain": [
        "20344",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "hadith_no": "7457",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا سهل بن عثمان، حدثنا عقبة بن خالد، عن عبيد الله، عن أبي الزناد، عن  عبد الرحمن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يوشك الفرات أن يحسر عن جبل من ذهب فمن حضره فلا يأخذ منه شيئا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      The Euphrates would soon uncover a mountain of gold but he who is present there should not take anything from that.",
      "chain": [
        "30546",
        "20344",
        "11201",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2577",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عقبة بن خالد، عن عبيد الله، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم سبق بين الخيل وفضل القرح في الغاية ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Prophet (ﷺ) used to hold a race between horses and kept the one in the fifth year at a long distance.",
      "chain": [
        "30007",
        "20344",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4313",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا عبد الله بن سعيد الكندي، حدثني عقبة بن خالد السكوني، حدثنا عبيد الله، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يوشك الفرات أن يحسر عن كنز من ذهب فمن حضره فلا يأخذ منه شيئا ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      The Euphrates is soon to uncover a treasure of the gold, but those who are present must not take any of it.",
      "chain": [
        "30200",
        "20344",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "hadith_no": "4314",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا عبد الله بن سعيد الكندي، حدثني عقبة، - يعني ابن خالد - حدثني عبيد الله، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم مثله إلا أنه قال ‏\"‏ يحسر عن جبل من ذهب ‏\"‏ ‏.‏",
      "text_en": " A similar tradition has also been transmitted by Abu Hurairah from the Prophet (ﷺ) through a different chain of narrators. But this version has:                      “Uncover a mountain of gold”.",
      "chain": [
        "30200",
        "20344",
        "11201",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "146",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو سعيد عبد الله بن سعيد الأشج، حدثنا حفص بن غياث، وعقبة بن خالد، قالا حدثنا الأعمش، وابن أبي ليلى، عن عمرو بن مرة، عن عبد الله بن سلمة، عن علي، قال كان رسول الله صلى الله عليه وسلم يقرئنا القرآن على كل حال ما لم يكن جنبا ‏.‏ قال أبو عيسى حديث علي هذا حديث حسن صحيح ‏.‏ وبه قال غير واحد من أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين ‏.‏ قالوا يقرأ الرجل القرآن على غير وضوء ولا يقرأ في المصحف إلا وهو طاهر ‏.‏ وبه يقول سفيان الثوري والشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Ali narrated:                     \"Allah's Messenger would recite the Qur'an in all conditions, as long as he was not Junub.\"",
      "chain": [
        "30200",
        "20317",
        "20344",
        "11060",
        "11196",
        "11381",
        "5"
      ]
    },
    {
      "hadith_no": "194",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا عقبة بن خالد، عن ابن أبي ليلى، عن عمرو بن مرة، عن عبد الرحمن بن أبي ليلى، عن عبد الله بن زيد، قال كان أذان رسول الله صلى الله عليه وسلم شفعا شفعا في الأذان والإقامة ‏\"‏ ‏.‏ قال أبو عيسى حديث عبد الله بن زيد رواه وكيع عن الأعمش عن عمرو بن مرة عن عبد الرحمن بن أبي ليلى قال حدثنا أصحاب محمد صلى الله عليه وسلم أن عبد الله بن زيد رأى الأذان في المنام ‏.‏ وقال شعبة عن عمرو بن مرة عن عبد الرحمن بن أبي ليلى أن عبد الله بن زيد رأى الأذان في المنام ‏.‏ وهذا أصح من حديث ابن أبي ليلى ‏.‏ وعبد الرحمن بن أبي ليلى لم يسمع من عبد الله بن زيد ‏.‏ وقال بعض أهل العلم الأذان مثنى مثنى والإقامة مثنى مثنى ‏.‏ وبه يقول سفيان الثوري وابن المبارك وأهل الكوفة ‏.‏ قال أبو عيسى ابن أبي ليلى هو محمد بن عبد الرحمن بن أبي ليلى كان قاضي الكوفة ولم يسمع من أبيه شيئا إلا أنه يروي عن رجل عن أبيه ‏.‏",
      "text_en": " Abdullah bin Zaid said:                     \"Allah's Messenger would say each phrase of the call (for prayer) two times, for the Adhan and the Iqamah.\"",
      "chain": [
        "30200",
        "20344",
        "11196",
        "11381",
        "11196",
        "605"
      ]
    },
    {
      "hadith_no": "2231",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا عبد الله بن سعيد الأشج، حدثنا عقبة بن خالد السكوني، عن موسى بن محمد بن إبراهيم التيمي، عن أبيه، عن أبي سعيد الخدري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا دخلتم على المريض فنفسوا له في أجله فإن ذلك لا يرد شيئا ويطيب نفسه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
      "text_en": " Abu Sa'eed Al-Khudri narrated that the Messenger of Allah (S.A.W) said:                     \"When one of you visits the ill, then reassure him regarding his lifespan. Indeed that will not repel anything, but it will comfort his soul.\"",
      "chain": [
        "20344",
        "12532",
        "38"
      ]
    },
    {
      "hadith_no": "2769",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا عقبة بن خالد، حدثنا عبيد الله بن عمر، عن خبيب بن عبد الرحمن، عن جده، حفص بن عاصم عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يوشك الفرات يحسر عن كنز من ذهب فمن حضره فلا يأخذ منه شيئا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah(s.a.w) said:                     \"The Euphrates shall soon uncover a treasure of gold, so whoever witnesses it, let him not take anything from it.\"",
      "chain": [
        "30200",
        "20344",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "hadith_no": "2770",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا عقبة بن خالد، حدثنا عبيد الله بن عمر، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم مثله إلا أنه قال ‏\"‏ يحسر عن جبل من ذهب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that the Prophet(s.a.w) said similar to it, except that he said,:                     \"uncover a pot of gold.\"",
      "chain": [
        "30200",
        "20344",
        "11201",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "3389",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا عقبة بن خالد، عن أبي سعد، سعيد بن المرزبان عن أبي سلمة، عن ثوبان، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال حين يمسي رضيت بالله ربا وبالإسلام دينا وبمحمد نبيا كان حقا على الله أن يرضيه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Thawban, may Allah be pleased with him, said:                     “The Messenger of Allah said: ‘Whoever says when he reaches the evening: “I am pleased with Allah as (my) Lord, with Islam as (my) religion, and with Muhammad (pbuh) as (my) Prophet  (Raditu Billahi Rabban Wabil-Islami Deenan Wa Bi-Muhammadan Nabiyyan) it is a duty upon Allah to please him.’” (Hasan Gharib)",
      "chain": [
        "30200",
        "20344",
        "10567",
        "130"
      ]
    },
    {
      "hadith_no": "4029",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا عقبة بن خالد، حدثنا شعبة، عن الجريري، عن أبي نضرة، عن أبي سعيد، قال قال أبو بكر ألست أحق الناس بها ألست أول من أسلم ألست صاحب كذا ألست صاحب كذا ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
      "text_en": " Narrated Abu Sa'eed Al-Khudri:                     that Abu Bakr said: \"Am I not the most deserving of it among the people, am I not the first to become Muslim, am I not the person of such and such, am I not the person of such and such.\"",
      "chain": [
        "30200",
        "20344",
        "20020",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "4141",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا عقبة بن خالد، حدثني يوسف بن إبراهيم، أنه سمع أنس بن مالك، يقول سئل رسول الله صلى الله عليه وسلم أى أهل بيتك أحب إليك قال ‏\"‏ الحسن والحسين ‏\"‏ ‏.‏ وكان يقول لفاطمة ‏\"‏ ادعي لي ابنى ‏\"‏ ‏.‏ فيشمهما ويضمهما إليه ‏.‏ قال هذا حديث غريب من هذا الوجه من حديث أنس",
      "text_en": " Narrated Anas bin Malik:                     that the Messenger of Allah (ﷺ) was asked: \"Which of the people of your house are most beloved to you?\" He said: \"Al-Hasan and Al-Husain.\" And he used to say to Fatimah: \"Call my two sons for me so that I may smell them.\" And he would hug them.",
      "chain": [
        "30200",
        "20344",
        "19"
      ]
    },
    {
      "hadith_no": "907",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا عبد الله بن سعيد أبو سعيد الأشج، قال حدثني عقبة بن خالد، قال حدثنا شعبة، وابن أبي عروبة، عن قتادة، عن أنس، قال صليت خلف رسول الله صلى الله عليه وسلم وأبي بكر وعمر وعثمان - رضى الله عنهم - فلم أسمع أحدا منهم يجهر ب ‏{‏ بسم الله الرحمن الرحيم ‏}‏ ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"I prayed behind the Messenger of Allah (ﷺ), Abu Bakr, Umar and Uthman, may Allah be pleased with them, and I did not hear any of them say out loud: In the Name of Allah, The Most Gracious, The Most Merciful.\"",
      "chain": [
        "20344",
        "20020",
        "11073",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1505",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عقبة بن خالد السكوني، عن موسى بن محمد بن إبراهيم التيمي، عن أبيه، عن أبي سعيد الخدري، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا دخلتم على المريض فنفسوا له في الأجل فإن ذلك لا يرد شيئا وهو يطيب بنفس المريض ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed Al-Khudri that the Messenger of Allah(ﷺ) said:                      “When you enter upon one who is sick, cheer him up andgive him hope of a long life, for that does not change anything (ofthe Divine Decree), but it will cheer the heart of the one who issick.”",
      "chain": [
        "30201",
        "20344",
        "12532",
        "38"
      ]
    },
    {
      "hadith_no": "2048",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عقبة بن خالد، ح وحدثنا محمد بن الصباح، أنبأنا عبد العزيز بن محمد، جميعا عن هشام بن عروة، عن أبيه، عن عائشة، قالت لما أن كبرت، سودة بنت زمعة وهبت يومها لعائشة فكان رسول الله  صلى الله عليه وسلم  يقسم لعائشة بيوم سودة ‏.‏",
      "text_en": " 'Urwah narrated from 'Aishah:                     that when Saudah bint Zam'ah grew old, she gave her day to 'Aishah, and the Messenger of Allah went to 'Aishah on Saudah's day.",
      "chain": [
        "30201",
        "20344",
        "30269",
        "20167",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2953",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا عبد الله بن سعيد، حدثنا عقبة بن خالد، عن عبيد الله، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم حرق نخل بني النضير وقطع ‏.‏ وفيه يقول شاعرهم فهان على سراة بني لؤى حريق بالبويرة مستطير",
      "text_en": " It wasnarrated from Ibn ‘Umar that the Prophet (ﷺ) burned the palmtrees of Banu Nadir and cut them down. Concerning that, their poetsaid:                      “It is easy forthe elite of Banu Luai – To burn Al-Buwairahin a Frightening manner.”",
      "chain": [
        "11184",
        "20344",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3291",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عقبة بن خالد، عن موسى بن محمد بن إبراهيم التيمي، أخبرني أبي، عن أبي سعيد الخدري، قال مر النبي  صلى الله عليه وسلم  برجل وهو يجر شاة بأذنها فقال ‏\"‏ دع أذنها وخذ بسالفتها ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed Al-Khudri said:                      “The Prophet (ﷺ)passed by a man who was dragging a sheep by its ear. He said: ‘Leaveits ear alone and hold it by the sides of its neck.’”",
      "chain": [
        "30201",
        "20344",
        "12532",
        "38"
      ]
    },
    {
      "hadith_no": "3306",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعبد الله بن سعيد، قالا حدثنا عقبة بن خالد، عن موسى بن محمد بن إبراهيم التيمي، عن أبيه، عن أبي سعيد الخدري، قال نهى رسول الله  صلى الله عليه وسلم  أن يمثل بالبهائم ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed Al-Khudri said:                      “The Messenger ofAllah(ﷺ) forbade mutilating animals.”",
      "chain": [
        "30201",
        "11184",
        "20344",
        "12532",
        "38"
      ]
    }
  ],
  "total_hadiths": 25
}