{
  "id": "20345",
  "name": "'Ali bin Ms'hr علي بن مسهر",
  "full_name": "'Ali bin Ms'hr علي بن مسهر",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "189",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "Judge",
      "al-Kufa"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "28270",
      "name": "'Aabad bin Musa al-Jhny عباد بن موسى الجهني",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10945",
      "name": "'Abdul Malik bin Aby عبد الملك بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11395",
      "name": "Matruf bin Tarayf al-Harithi مطرف بن طريف",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11352",
      "name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10766",
      "name": "Sa'd bin Tariq, Abu Malik سعد بن طارق بن أشيم أبو مالك الأشجعي",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11404",
      "name": "Yahya bin Sa'id bin Hiyan يحيى بن سعيد بن حيان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11585",
      "name": "Da'ud bin Abi Hnd داود بن أبي هند",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11901",
      "name": "Abu Barda bin Abi Musa al-Asha'ari أبو بردة / الحارث بن أبي موسى الأشعري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10962",
      "name": "Mukhtar bin Falfal مختار بن فلفل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11338",
      "name": "Zakaria bin Abi Za'idah زكريا بن أبي زائدة خالد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11073",
      "name": "Sa'id bin Abi 'Aruba سعيد بن أبي عروبة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10785",
      "name": "'Abdullah bin Ata'a عبد الله بن عطاء الطائفي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19476",
      "name": "al-Rbab Jd'h 'Uthman bin الرباب جدة عثمان",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "20605",
      "name": "Muhammad bin Qays al-'Asady محمد بن قيس الأسدي الوالبي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30463",
      "name": "Khalid bin Mukhallad al-Qatwani خالد بن مخلد القطواني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30125",
      "name": "Bashr bin Adam al-Dareer بشر بن آدم الضرير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30464",
      "name": "Zakaria bin 'Ady bin Zarayn زكريا بن عدي بن زريق",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30522",
      "name": "Mhrz bin Awn محرز بن عون",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30482",
      "name": "al-Walid bin Shuja' bin al-Sakuni الوليد بن شجاع بن الوليد بن قيس السكوني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30546",
      "name": "Sahl bin 'Uthman bin Fars سهل بن عثمان بن فارس",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30547",
      "name": "Swyd bin Sa'id سويد بن سعيد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20387",
      "name": "'Ali bin Hujr bin Iyas bin Maqatil علي بن حجر بن إياس بن مقاتل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30480",
      "name": "Hanad bin al-Sari bin Mus'ab هناد بن السري بن مصعب",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "302",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا إسماعيل بن خليل، قال أخبرنا علي بن مسهر، قال أخبرنا أبو إسحاق  هو الشيباني  عن عبد الرحمن بن الأسود، عن أبيه، عن عائشة، قالت كانت إحدانا إذا كانت حائضا، فأراد رسول الله صلى الله عليه وسلم أن يباشرها، أمرها أن تتزر في فور حيضتها ثم يباشرها‏.‏ قالت وأيكم يملك إربه كما كان النبي صلى الله عليه وسلم يملك إربه‏.‏ تابعه خالد وجرير عن الشيباني‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Al-Aswad:                     (on the authority of his father) `Aisha said: \"Whenever Allah's Apostle wanted to fondle anyone of us during her periods (menses), he used to order her to put on an Izar and start fondling her.\" `Aisha added, \"None of you could control his sexual desires as the Prophet could.\"",
      "chain": [
        "30186",
        "20345",
        "11352",
        "11056",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "511",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا إسماعيل بن خليل، حدثنا علي بن مسهر، عن الأعمش، عن مسلم  يعني ابن صبيح  عن مسروق، عن عائشة، أنه ذكر عندها ما يقطع الصلاة فقالوا يقطعها الكلب والحمار والمرأة‏.‏ قالت قد جعلتمونا كلابا، لقد رأيت النبي  عليه السلام  يصلي، وإني لبينه وبين القبلة، وأنا مضطجعة على السرير، فتكون لي الحاجة، فأكره أن أستقبله فأنسل انسلالا‏.‏ وعن الأعمش عن إبراهيم عن الأسود عن عائشة نحوه‏.‏",
      "text_en": " Narrated `Aisha:                     The things which annul the prayers were mentioned before me. They said, \"Prayer is annulled by a dog, a donkey and a woman (if they pass in front of the praying people).\" I said, \"You have made us (i.e. women) dogs. I saw the Prophet praying while I used to lie in my bed between him and the Qibla. Whenever I was in need of something, I would slip away. for I disliked to face him.\"",
      "chain": [
        "30186",
        "20345",
        "11060",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "1076",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا بشر بن آدم، قال حدثنا علي بن مسهر، قال أخبرنا عبيد الله، عن نافع، عن ابن عمر، قال كان النبي صلى الله عليه وسلم يقرأ السجدة ونحن عنده فيسجد ونسجد معه فنزدحم حتى ما يجد أحدنا لجبهته موضعا يسجد عليه‏.‏",
      "text_en": " Narrated Ibn `Umar:                     When the Prophet recited Surat As-Sajda and we were with him, he would prostrate and we also would prostrate with him and some of us (because of the heavy rush) would not find a place (for our foreheads) to prostrate on.",
      "chain": [
        "30125",
        "20345",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1290",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا إسماعيل بن خليل، حدثنا علي بن مسهر، حدثنا أبو إسحاق  وهو الشيباني  عن أبي بردة، عن أبيه، قال لما أصيب عمر  رضى الله عنه  جعل صهيب يقول واأخاه‏.‏ فقال عمر أما علمت أن النبي صلى الله عليه وسلم قال ‏\"‏ إن الميت ليعذب ببكاء الحى ‏\"‏‏.‏",
      "text_en": " Narrated Abu Burda:                     That his father said, \"When `Umar was stabbed, Suhaib started crying: O my brother! `Umar said, 'Don't you know that the Prophet said: The deceased is tortured for the weeping of the living'?\"",
      "chain": [
        "30186",
        "20345",
        "11352",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1691",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا فروة بن أبي المغراء، حدثنا علي بن مسهر، عن هشام بن عروة، قال عروة كان الناس يطوفون في الجاهلية عراة إلا الحمس، والحمس قريش وما ولدت، وكانت الحمس يحتسبون على الناس يعطي الرجل الرجل الثياب يطوف فيها، وتعطي المرأة المرأة الثياب تطوف فيها، فمن لم يعطه الحمس طاف بالبيت عريانا، وكان يفيض جماعة الناس من عرفات، ويفيض الحمس من جمع‏.‏ قال وأخبرني أبي عن عائشة  رضى الله عنها  أن هذه الآية نزلت في الحمس ‏{‏ثم أفيضوا من حيث أفاض الناس‏}‏ قال كانوا يفيضون من جمع فدفعوا إلى عرفات‏.‏",
      "text_en": " Narrated `Urwa:                     During the Pre-Islamic period of Ignorance, the people used to perform Tawaf of the Ka`ba naked except the Hums; and the Hums were Quraish and their offspring. The Hums used to give clothes to the men who would perform the Tawaf wearing them; and women (of the Hums) used to give clothes to the women who would perform the Tawaf wearing them. Those to whom the Hums did not give clothes would perform Tawaf round the Ka`ba naked. Most of the people used to go away (disperse) directly from `Arafat but they (Hums) used to depart after staying at Al-Muzdalifa. `Urwa added, \"My father narrated that `Aisha had said, 'The following verses were revealed about the Hums: Then depart from the place whence all the people depart--(2.199) `Urwa added, \"They (the Hums) used to stay at Al-Muzdalifa and used to depart from there (to Mina) and so they were sent to `Arafat (by Allah's order).\"",
      "chain": [
        "30207",
        "20345",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "2138",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا فروة بن أبي المغراء، أخبرنا علي بن مسهر، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت لقل يوم كان يأتي على النبي صلى الله عليه وسلم إلا يأتي فيه بيت أبي بكر أحد طرفى النهار، فلما أذن له في الخروج إلى المدينة لم يرعنا إلا وقد أتانا ظهرا، فخبر به أبو بكر فقال ما جاءنا النبي صلى الله عليه وسلم في هذه الساعة، إلا لأمر حدث، فلما دخل عليه قال لأبي بكر ‏\"‏ أخرج من عندك ‏\"‏‏.‏ قال يا رسول الله إنما هما ابنتاى‏.‏ يعني عائشة وأسماء‏.‏ قال ‏\"‏ أشعرت أنه قد أذن لي في الخروج ‏\"‏‏.‏ قال الصحبة يا رسول الله‏.‏ قال ‏\"‏ الصحبة ‏\"‏‏.‏ قال يا رسول الله إن عندي ناقتين أعددتهما للخروج، فخذ إحداهما‏.‏ قال ‏\"‏ قد أخذتها بالثمن ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     Rarely did the Prophet fail to visit Abu Bakr's house everyday, either in the morning or in the evening. When the permission for migration to Medina was granted, all of a sudden the Prophet came to us at noon and Abu Bakr was informed, who said, \"Certainly the Prophet has come for some urgent matter.\" The Prophet said to Abu Bark, when the latter entered \"Let nobody stay in your home.\" Abu Bakr said, \"O Allah's Apostle! There are only my two daughters (namely `Aisha and Asma') present.\" The Prophet said, \"I feel (am informed) that I have been granted the permission for migration.\" Abu Bakr said, \"I will accompany you, O Allah's Apostle!\" The Prophet said, \"You will accompany me.\" Abu Bakr then said \"O Allah's Apostle! I have two she-camels I have prepared specially for migration, so I offer you one of them. The Prophet said, \"I have accepted it on the condition that I will pay its price.\"",
      "chain": [
        "30207",
        "20345",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2885",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إسماعيل بن خليل، أخبرنا علي بن مسهر، أخبرنا يحيى بن سعيد، أخبرنا عبد الله بن عامر بن ربيعة، قال سمعت عائشة  رضى الله عنها  تقول كان النبي صلى الله عليه وسلم سهر فلما قدم المدينة قال ‏\"‏ ليت رجلا من أصحابي صالحا يحرسني الليلة ‏\"‏‏.‏ إذ سمعنا صوت سلاح فقال ‏\"‏ من هذا ‏\"‏‏.‏ فقال أنا سعد بن أبي وقاص، جئت لأحرسك‏.‏ ونام النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet was vigilant one night and when he reached Medina, he said, \"Would that a pious man from my companions guard me tonight!\" Suddenly we heard the clatter of arms. He said, \"Who is that? \" He (The new comer) replied, \" I am Sa`d bin Abi Waqqas and have come to guard you.\" So, the Prophet slept (that night).",
      "chain": [
        "30186",
        "20345",
        "11062",
        "709",
        "53"
      ]
    },
    {
      "hadith_no": "3215",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا فروة، حدثنا علي بن مسهر، عن هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  أن الحارث بن هشام، سأل النبي صلى الله عليه وسلم كيف يأتيك الوحى قال ‏\"‏ كل ذاك يأتي الملك أحيانا في مثل صلصلة الجرس، فيفصم عني وقد وعيت ما قال، وهو أشده على، ويتمثل لي الملك أحيانا رجلا، فيكلمني فأعي ما يقول ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     Al Harith bin Hisham asked the Prophet, \"How does the divine inspiration come to you?\" He replied, \"In all these ways: The Angel sometimes comes to me with a voice which resembles the sound of a ringing bell, and when this state abandons me, I remember what the Angel has said, and this type of Divine Inspiration is the hardest on me; and sometimes the Angel comes to me in the shape of a man and talks to me, and I understand and remember what he says.\"",
      "chain": [
        "30207",
        "20345",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3465",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا إسماعيل بن خليل، أخبرنا علي بن مسهر، عن عبيد الله بن عمر، عن نافع، عن ابن عمر  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بينما ثلاثة نفر ممن كان قبلكم يمشون إذ أصابهم مطر، فأووا إلى غار، فانطبق عليهم، فقال بعضهم لبعض إنه والله يا هؤلاء لا ينجيكم إلا الصدق، فليدع كل رجل منكم بما يعلم أنه قد صدق فيه‏.‏ فقال واحد منهم اللهم إن كنت تعلم أنه كان لي أجير عمل لي على فرق من أرز، فذهب وتركه، وأني عمدت إلى ذلك الفرق فزرعته، فصار من أمره أني اشتريت منه بقرا، وأنه أتاني يطلب أجره فقلت اعمد إلى تلك البقر‏.‏ فسقها، فقال لي إنما لي عندك فرق من أرز‏.‏ فقلت له اعمد إلى تلك البقر فإنها من ذلك الفرق، فساقها، فإن كنت تعلم أني فعلت ذلك من خشيتك، ففرج عنا‏.‏ فانساحت عنهم الصخرة‏.‏ فقال الآخر اللهم إن كنت تعلم أنه كان لي أبوان شيخان كبيران، فكنت آتيهما كل ليلة بلبن غنم لي، فأبطأت عليهما ليلة فجئت وقد رقدا وأهلي وعيالي يتضاغون من الجوع، فكنت لا أسقيهم حتى يشرب أبواى، فكرهت أن أوقظهما، وكرهت أن أدعهما، فيستكنا لشربتهما، فلم أزل أنتظر حتى طلع الفجر، فإن كنت تعلم أني فعلت ذلك من خشيتك، ففرج عنا‏.‏ فانساحت عنهم الصخرة، حتى نظروا إلى السماء‏.‏ فقال الآخر اللهم إن كنت تعلم أنه كان لي ابنة عم من أحب الناس إلى، وأني راودتها عن نفسها فأبت إلا أن آتيها بمائة دينار، فطلبتها حتى قدرت، فأتيتها بها فدفعتها إليها، فأمكنتني من نفسها، فلما قعدت بين رجليها، فقالت اتق الله ولا تفض الخاتم إلا بحقه‏.‏ فقمت وتركت المائة دينار، فإن كنت تعلم أني فعلت ذلك من خشيتك ففرج عنا‏.‏ ففرج الله عنهم فخرجوا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"Once three persons (from the previous nations) were traveling, and suddenly it started raining and they took shelter in a cave. The entrance of the cave got closed while they were inside. They said to each other, 'O you! Nothing can save you except the truth, so each of you should ask Allah's Help by referring to such a deed as he thinks he did sincerely (i.e. just for gaining Allah's Pleasure).' So one of them said, 'O Allah! You know that I had a laborer who worked for me for one Faraq (i.e. three Sas) of rice, but he departed, leaving it (i.e. his wages). I sowed that Faraq of rice and with its yield I bought cows (for him). Later on when he came to me asking for his wages, I said (to him), 'Go to those cows and drive them away.' He said to me, 'But you have to pay me only a Faraq of rice,' I said to him, 'Go to those cows and take them, for they are the product of that Faraq (of rice).' So he drove them. O Allah! If you consider that I did that for fear of You, then please remove the rock.' The rock shifted a bit from the mouth of the cave. The second one said, 'O Allah, You know that I had old parents whom I used to provide with the milk of my sheep every night. One night I was delayed and when I came, they had slept, while my wife and children were crying with hunger. I used not to let them (i.e. my family) drink unless my parents had drunk first. So I disliked to wake them up and also disliked that they should sleep without drinking it, I kept on waiting (for them to wake) till it dawned. O Allah! If You consider that I did that for fear of you, then please remove the rock.' So the rock shifted and they could see the sky through it. The (third) one said, 'O Allah! You know that I had a cousin (i.e. my paternal uncle's daughter) who was most beloved to me and I sought to seduce her, but she refused, unless I paid her one-hundred Dinars (i.e. gold pieces). So I collected the amount and brought it to her, and she allowed me to sleep with her. But when I sat between her legs, she said, 'Be afraid of Allah, and do not deflower me but legally. 'I got up and left the hundred Dinars (for her). O Allah! If You consider that I did that for fear of you than please remove the rock. So Allah saved them and they came out (of the cave).\" [It has been flasely argued that \"This Hadith indicates that one can ONLY ask Allah for help directly or through his performed good deeds.\" [In fact this hadith does account the request of those three men based on their good deeds, but nowhere within this hadith's text is it mentioned - as claimed - that this is the ONLY way that Allah may be asked. The reader is requested to review our holy Prophets words for himself, and not to allow others to falsely interject their own opinions in them. [It has also been wrongly (and vehemently) added that \"But to ask Allah through dead or absent prophets, saints, spirits, holy men, angels etc. is absolutely forbidden in Islam and it is a kind of disbelief.\" Such statements are extremely inflamatory and un-islamically accusative. They purport to deny intercession, even though it was affirmed by the majority of Muslim scholars. The authentis hadeeth where one of the the Companions asks the Prophet: \"I ask you to be in your company in Jannah\" is enough proof for the wise. As for debative persons who prefer their own opinions, they will not accept even volumes of proofs. Addition by Dar Al Hadeeth]",
      "chain": [
        "30186",
        "20345",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3764",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا خالد بن مخلد، حدثنا علي بن مسهر، عن هشام بن عروة، عن أبيه، قال أخبرني مروان بن الحكم، قال أصاب عثمان بن عفان رعاف شديد سنة الرعاف، حتى حبسه عن الحج وأوصى، فدخل عليه رجل من قريش قال استخلف‏.‏ قال وقالوه قال نعم‏.‏ قال ومن فسكت، فدخل عليه رجل آخر  أحسبه الحارث  فقال استخلف‏.‏ فقال عثمان وقالوا فقال نعم‏.‏ قال ومن هو فسكت قال فلعلهم قالوا الزبير قال نعم‏.‏ قال أما والذي نفسي بيده إنه لخيرهم ما علمت، وإن كان لأحبهم إلى رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Marwan bin Al-Hakam:                     `Uthman bin `Affan was afflicted with severe nose-bleeding in the year when such illness was prevelant and that prevented him from performing Hajj, and (because of it) he made his will. A man from Quraish came to him and said, \"Appoint your successor.\" `Uthman asked, \"Did the people name him? (i.e. the successor) the man said, \"Yes.\" `Uthman asked, \"Who is that?\" The man remained silent. Another man came to `Uthman and I think it was Al-Harith. He also said, \"Appoint your successor.\" `Uthman asked, \"Did the people name him?\" The man replied \"Yes.\" `Uthman said, \"Who is that?\" The man remained silent. `Uthman said, \"Perhaps they have mentioned Az-Zubair?\" The man said, \"Yes.\" `Uthman said, \"By Him in Whose Hands my life is, he is the best of them as I know, and the dearest of them to Allah's Apostle .\"",
      "chain": [
        "30463",
        "20345",
        "11065",
        "10511",
        "858"
      ]
    },
    {
      "hadith_no": "3869",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "وقال إسماعيل بن خليل أخبرنا علي بن مسهر، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت استأذنت هالة بنت خويلد أخت خديجة على رسول الله صلى الله عليه وسلم، فعرف استئذان خديجة فارتاع لذلك، فقال ‏\"‏ اللهم هالة ‏\"‏‏.‏ قالت فغرت فقلت ما تذكر من عجوز من عجائز قريش، حمراء الشدقين، هلكت في الدهر، قد، أبدلك الله خيرا منها",
      "text_en": "      Narrated 'Aisha:                      Once Hala bint Khuwailid, Khadija's sister, asked the permission of the Prophet to enter. On that, the Prophet remembered the way Khadija used to ask permission, and that upset him. He said, \"O Allah! Hala!\" So I became jealous and said, \"What makes you remember an old woman amongst the old women of Quraish an old woman (with a teethless mouth) of red gums who died long ago, and in whose place Allah has given you somebody better than her?\"",
      "chain": [
        "30186",
        "20345",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3883",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني فروة بن أبي المغراء، أخبرنا علي بن مسهر، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت أسلمت امرأة سوداء لبعض العرب، وكان لها حفش في المسجد قالت فكانت تأتينا فتحدث عندنا فإذا فرغت من حديثها قالت ويوم الوشاح من تعاجيب ربنا ألا إنه من بلدة الكفر أنجاني فلما أكثرت قالت لها عائشة وما يوم الوشاح قالت خرجت جويرية لبعض أهلي، وعليها وشاح من أدم فسقط منها، فانحطت عليه الحديا وهى تحسبه لحما، فأخذت فاتهموني به فعذبوني، حتى بلغ من أمري أنهم طلبوا في قبلي، فبينا هم حولي وأنا في كربي إذ أقبلت الحديا حتى وازت برءوسنا ثم ألقته، فأخذوه فقلت لهم هذا الذي اتهمتموني به وأنا منه بريئة‏.‏",
      "text_en": " Narrated `Aisha:                     A black lady slave of some of the 'Arabs embraced Islam and she had a hut in the mosque. She used to visit us and talk to us, and when she finished her talk, she used to say: \"The day of the scarf was one of our Lord's wonders: Verily! He has delivered me from the land of Kufr.\" When she said the above verse many times, I (i.e. `Aisha) asked her, \"What was the day of the scarf?\" She replied, \"Once the daughter of some of my masters went out and she was wearing a leather scarf (round her neck) and the leather scarf fell from her and a kite descended and picked it up, mistaking it for a piece of meat. They (i.e. my masters) accused me of stealing it and they tortured me to such an extent that they even looked for it in my private parts. So, while they all were around me, and I was in my great distress, suddenly the kite came over our heads and threw the scarf, and they took it. I said to them 'This is what you accused me of stealing, though I was innocent.\"",
      "chain": [
        "30207",
        "20345",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3942",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثني فروة بن أبي المغراء، حدثنا علي بن مسهر، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت تزوجني النبي صلى الله عليه وسلم وأنا بنت ست سنين، فقدمنا المدينة فنزلنا في بني الحارث بن خزرج، فوعكت فتمرق شعري فوفى جميمة، فأتتني أمي أم رومان وإني لفي أرجوحة ومعي صواحب لي، فصرخت بي فأتيتها لا أدري ما تريد بي فأخذت بيدي حتى أوقفتني على باب الدار، وإني لأنهج، حتى سكن بعض نفسي، ثم أخذت شيئا من ماء فمسحت به وجهي ورأسي ثم أدخلتني الدار فإذا نسوة من الأنصار في البيت فقلن على الخير والبركة، وعلى خير طائر‏.‏ فأسلمتني إليهن فأصلحن من شأني، فلم يرعني إلا رسول الله صلى الله عليه وسلم ضحى، فأسلمتني إليه، وأنا يومئذ بنت تسع سنين‏.‏",
      "text_en": " Narrated Aisha:                     The Prophet engaged me when I was a girl of six (years). We went to Medina and stayed at the home of Bani-al-Harith bin Khazraj. Then I got ill and my hair fell down. Later on my hair grew (again) and my mother, Um Ruman, came to me while I was playing in a swing with some of my girl friends. She called me, and I went to her, not knowing what she wanted to do to me. She caught me by the hand and made me stand at the door of the house. I was breathless then, and when my breathing became Allright, she took some water and rubbed my face and head with it. Then she took me into the house. There in the house I saw some Ansari women who said, \"Best wishes and Allah's Blessing and a good luck.\" Then she entrusted me to them and they prepared me (for the marriage). Unexpectedly Allah's Apostle came to me in the forenoon and my mother handed me over to him, and at that time I was a girl of nine years of age.",
      "chain": [
        "30207",
        "20345",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5096",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا بشر بن آدم، أخبرنا علي بن مسهر، أخبرنا هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت سمع النبي صلى الله عليه وسلم قارئا يقرأ من الليل في المسجد فقال ‏\"‏ يرحمه الله لقد أذكرني كذا وكذا آية، أسقطتها من سورة كذا وكذا ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet heard a reciter reciting, the Qur'an in the mosque at night. The Prophet said, \"May Allah bestow His Mercy on him, as he has remind ed me of such-and-such Verses of such and-such Suras, which I missed!\"",
      "chain": [
        "30125",
        "20345",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5211",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا فروة، حدثنا علي بن مسهر، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  تزوجني النبي صلى الله عليه وسلم فأتتني أمي فأدخلتني الدار، فإذا نسوة من الأنصار في البيت فقلن على الخير والبركة، وعلى خير طائر‏.‏",
      "text_en": " Narrated `Aisha:                     When the Prophet married me, my mother came to me and made me enter the house where I saw some women from the Ansar who said, \"May you prosper and have blessings and have good omen.\"",
      "chain": [
        "30207",
        "20345",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5215",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثني فروة بن أبي المغراء، حدثنا علي بن مسهر، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  قالت تزوجني النبي صلى الله عليه وسلم فأتتني أمي فأدخلتني الدار، فلم يرعني إلا رسول الله صلى الله عليه وسلم ضحى‏.‏",
      "text_en": " Narrated Aisha:                     When the Prophet married me, my mother came to me and made me enter the house (of the Prophet) and nothing surprised me but the coming of Allah's Apostle to me in the forenoon.",
      "chain": [
        "30207",
        "20345",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5271",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا فروة، حدثنا علي بن مسهر، عن هشام، عن أبيه، عن عائشة  رضى الله عنها  كان رسول الله صلى الله عليه وسلم إذا انصرف من العصر دخل على نسائه، فيدنو من إحداهن، فدخل على حفصة، فاحتبس أكثر ما كان يحتبس‏.‏",
      "text_en": " Narrated `Aisha:                     Whenever Allah's Apostle finished his `Asr prayer, he would enter upon his wives and stay with one of them. One day he went to Hafsa and stayed with her longer than usual.",
      "chain": [
        "30207",
        "20345",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5292",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا فروة بن أبي المغراء، حدثنا علي بن مسهر، عن هشام، عن أبيه، عن عائشة، قالت خرجت سودة بنت زمعة ليلا فرآها عمر فعرفها فقال إنك والله يا سودة ما تخفين علينا، فرجعت إلى النبي صلى الله عليه وسلم فذكرت ذلك له، وهو في حجرتي يتعشى، وإن في يده لعرقا، فأنزل عليه فرفع عنه وهو يقول ‏\"‏ قد أذن لكن أن تخرجن لحوائجكن ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     Once Sa`da bint Zam`a went out at night for some need, and `Umar saw her, and recognizing her, he said (to her), \"By Allah, O Sa`da! You cannot hide yourself from us.\" So she returned to the Prophet and mentioned that to him while he was sitting in my dwelling taking his supper and holding a bone covered with meat in his hand. Then the Divine Inspiration was revealed to him and when that state was over, he (the Prophet was saying: \"O women! You have been allowed by Allah to go out for your needs.\"",
      "chain": [
        "30207",
        "20345",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5323",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا فروة بن أبي المغراء، حدثنا علي بن مسهر، عن هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  قالت كان رسول الله صلى الله عليه وسلم يحب العسل والحلواء، وكان إذا انصرف من العصر دخل على نسائه، فيدنو من إحداهن، فدخل على حفصة بنت عمر، فاحتبس أكثر ما كان يحتبس، فغرت فسألت عن ذلك فقيل لي أهدت لها امرأة من قومها عكة من عسل، فسقت النبي صلى الله عليه وسلم منه شربة، فقلت أما والله لنحتالن له‏.‏ فقلت لسودة بنت زمعة إنه سيدنو منك، فإذا دنا منك فقولي أكلت مغافير فإنه سيقول لك لا‏.‏ فقولي له ما هذه الريح التي أجد منك فإنه سيقول لك سقتني حفصة شربة عسل فقولي له جرست نحله العرفط‏.‏ وسأقول ذلك، وقولي أنت يا صفية ذاك‏.‏ قالت تقول سودة فوالله ما هو إلا أن قام على الباب، فأردت أن أباديه بما أمرتني به فرقا منك، فلما دنا منها قالت له سودة يا رسول الله أكلت مغافير قال ‏\"‏ لا ‏\"‏‏.‏ قالت فما هذه الريح التي أجد منك‏.‏ قال ‏\"‏ سقتني حفصة شربة عسل ‏\"‏‏.‏ فقالت جرست نحله العرفط فلما دار إلى قلت له نحو ذلك، فلما دار إلى صفية قالت له مثل ذلك فلما دار إلى حفصة قالت يا رسول الله ألا أسقيك منه‏.‏ قال ‏\"‏ لا حاجة لي فيه ‏\"‏‏.‏ قالت تقول سودة والله لقد حرمناه‏.‏ قلت لها اسكتي‏.‏",
      "text_en": " Narrated `Aisha:                     Allah's Apostle was fond of honey and sweet edible things and (it was his habit) that after finishing the `Asr prayer he would visit his wives and stay with one of them at that time. Once he went to Hafsa, the daughter of `Umar and stayed with her more than usual. I got jealous and asked the reason for that. I was told that a lady of her folk had given her a skin filled with honey as a present, and that she made a syrup from it and gave it to the Prophet to drink (and that was the reason for the delay). I said, \"By Allah we will play a trick on him (to prevent him from doing so).\" So I said to Sa`da bint Zam`a \"The Prophet will approach you, and when he comes near you, say: 'Have you taken Maghafir (a bad-smelling gum)?' He will say, 'No.' Then say to him: 'Then what is this bad smell which i smell from you?' He will say to you, 'Hafsa made me drink honey syrup.' Then say: Perhaps the bees of that honey had sucked the juice of the tree of Al-`Urfut.' I shall also say the same. O you, Safiyya, say the same.\" Later Sa`da said, \"By Allah, as soon as he (the Prophet ) stood at the door, I was about to say to him what you had ordered me to say because I was afraid of you.\" So when the Prophet came near Sa`da, she said to him, \"O Allah's Apostle! Have you taken Maghafir?\" He said, \"No.\" She said. \"Then what is this bad smell which I detect on you?\" He said, \"Hafsa made me drink honey syrup.\" She said, \"Perhaps its bees had sucked the juice of Al-`Urfut tree.\" When he came to me, I also said the same, and when he went to Safiyya, she also said the same. And when the Prophet again went to Hafsa, she said, 'O Allah's Apostle! Shall I give you more of that drink?\" He said, \"I am not in need of it.\" Sa`da said, \"By Allah, we deprived him (of it).\" I said to her, \"Keep quiet.\" '",
      "chain": [
        "30207",
        "20345",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5752",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا فروة بن أبي المغراء، حدثنا علي بن مسهر، عن هشام، عن أبيه، عن عائشة، أنها كانت تأمر بالتلبينة وتقول هو البغيض النافع‏.‏",
      "text_en": " Narrated Hisham's father:                     `Aisha used to recommend at-Talbina and used to say, \"It is disliked (by the patient) although it is beneficial.''",
      "chain": [
        "30207",
        "20345",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6749",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا فروة بن أبي المغراء، حدثنا علي بن مسهر، عن هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  قالت هزم المشركون يوم أحد هزيمة تعرف فيهم، فصرخ إبليس أى عباد الله أخراكم، فرجعت أولاهم فاجتلدت هي وأخراهم، فنظر حذيفة بن اليمان فإذا هو بأبيه فقال أبي أبي‏.‏ قالت فوالله ما انحجزوا حتى قتلوه، فقال حذيفة غفر الله لكم‏.‏ قال عروة فوالله ما زالت في حذيفة منها بقية حتى لقي الله‏.‏",
      "text_en": " Narrated `Aisha:                     When the pagans were defeated during the (first stage) of the battle of Uhud, Satan shouted, \"O Allah's slaves! Beware of what is behind you!\" So the front files of the Muslims attacked their own back files. Hudhaifa bin Al-Yaman looked and on seeing his father he shouted: \"My father! My father!\" By Allah! The people did not stop till they killed his father. Hudhaifa then said, \"May Allah forgive you.\" `Urwa (the sub-narrator) added, \"Hudhaifa continued asking Allah forgiveness for the killers of his father till he met Allah (till he died).",
      "chain": [
        "30207",
        "20345",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6967",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا فروة، حدثنا علي بن مسهر، عن هشام، عن أبيه، عن عائشة، هزم المشركون يوم أحد‏.‏ وحدثني محمد بن حرب، حدثنا أبو مروان، يحيى بن أبي زكرياء عن هشام، عن عروة، عن عائشة  رضى الله عنها  قالت صرخ إبليس يوم أحد في الناس يا عباد الله أخراكم‏.‏ فرجعت أولاهم على أخراهم حتى قتلوا اليمان فقال حذيفة أبي أبي‏.‏ فقتلوه، فقال حذيفة غفر الله لكم‏.‏ قال وقد كان انهزم منهم قوم حتى لحقوا بالطائف‏.‏",
      "text_en": " Narrated `Aisha:                     The pagans were defeated on the day (of the battle) of Uhud. Satan shouted among the people on the day of Uhud, \"O Allah's worshippers! Beware of what is behind you!\" So the front file of the army attacked the back files (mistaking them for the enemy) till they killed Al-Yaman. Hudhaifa (bin Al- Yaman) shouted, \"My father!\" My father! But they killed him. Hudhaifa said, \"May Allah forgive you.\" (The narrator added: Some of the defeated pagans fled till they reached Taif.)",
      "chain": [
        "30207",
        "20345",
        "11065",
        "10511",
        "30373",
        "20397",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني علي بن حجر السعدي، حدثنا علي بن مسهر، أخبرنا محمد بن قيس الأسدي، عن علي بن ربيعة الأسدي، عن المغيرة بن شعبة، عن النبي صلى الله عليه وسلم بمثله ولم يذكر ‏\"‏ إن كذبا على ليس ككذب على أحد ‏\"‏ ‏.‏",
      "text_en": "",
      "chain": [
        "20387",
        "20345",
        "20605",
        "11376",
        "166"
      ]
    },
    {
      "hadith_no": "88",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثنا سويد بن سعيد، حدثنا علي بن مسهر، قال سمعت أنا وحمزة الزيات، من أبان بن أبي عياش نحوا من ألف حديث ‏.‏ قال علي فلقيت حمزة فأخبرني أنه رأى النبي صلى الله عليه وسلم في المنام فعرض عليه ما سمع من أبان فما عرف منها إلا شيئا يسيرا خمسة أو ستة ‏.‏",
      "text_en": "",
      "chain": [
        "30547",
        "20345"
      ]
    },
    {
      "hadith_no": "262",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن الشيباني، عن الوليد بن العيزار، عن سعد بن إياس أبي عمرو الشيباني، عن عبد الله بن مسعود، قال سألت رسول الله صلى الله عليه وسلم أى العمل أفضل قال ‏\"‏ الصلاة لوقتها ‏\"‏ ‏.‏ قال قلت ثم أى قال ‏\"‏ بر الوالدين ‏\"‏ ‏.‏ قال قلت ثم أى قال ‏\"‏ الجهاد في سبيل الله ‏\"‏ ‏.‏ فما تركت أستزيده إلا إرعاء عليه ‏.‏",
      "text_en": " It is narrated on the authority of 'Abdullah b. Mas'ud that he observed. I asked the Messenger of Allah (may peace be upon him) which deed was the best. He (the Holy Prophet) replied:                      Prayer at its appointed hour. I (again) said: Then what? He (the Holy Prophet) replied: Kindness to the parents. I (again) said: Then what? He replied: Earnest endeavour (Jihad) in the cause of Allah. And I would have not ceased asking more questions but out of regard (for his feelings).",
      "chain": [
        "30201",
        "20345",
        "11352",
        "11663",
        "16"
      ]
    },
    {
      "hadith_no": "276",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا منجاب بن الحارث التميمي، وسويد بن سعيد، كلاهما عن علي بن مسهر، - قال منجاب أخبرنا ابن مسهر، - عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يدخل النار أحد في قلبه مثقال حبة خردل من إيمان ولا يدخل الجنة أحد في قلبه مثقال حبة خردل من كبرياء ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of 'Abdullah b. Mas'ud that the Messenger of Allah (may peace be upon him) observed:                      None shall enter the Fire (of Hell) who has in his heart the weight of a mustard seed of Iman and none shall enter Paradise who has in his heart the weight of a mustard seed of pride.",
      "chain": [
        "30479",
        "30547",
        "20345",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "335",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا منجاب بن الحارث التميمي، أخبرنا علي بن مسهر، عن الأعمش، بهذا الإسناد مثله ‏.‏",
      "text_en": " This hadith has been transmitted by Minjab b. al-Harith Tamimi with the same chain of transmitters.",
      "chain": [
        "30479",
        "20345"
      ]
    },
    {
      "hadith_no": "347",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عمرو الناقد، وزهير بن حرب، قالا حدثنا إسماعيل بن إبراهيم، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، وعبدة بن سليمان، ح وحدثنا ابن المثنى، وابن، بشار قالا حدثنا ابن أبي عدي، كلهم عن سعيد بن أبي عروبة، عن قتادة، عن زرارة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله عز وجل تجاوز لأمتي عما حدثت به أنفسها ما لم تعمل أو تكلم به ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) observed:                      Verily the Great and Mighty Allah forgave my people the evil promptings arising in their minds, but they neither talked about them nor acted upon them.",
      "chain": [
        "30263",
        "30022",
        "20208",
        "30201",
        "20345",
        "20337",
        "30160",
        "20276",
        "11073",
        "11019",
        "13"
      ]
    },
    {
      "hadith_no": "453",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن عبد الملك، عن عطاء، عن أبي هريرة، ‏{‏ ولقد رآه نزلة أخرى‏}‏ قال رأى جبريل ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the (words of Allah):                     \" And certainly he saw him in another descent\" (al-Qur'an, Iiii. 13) imply that he saw Gabriel.",
      "chain": [
        "30201",
        "20345",
        "11368",
        "11029"
      ]
    },
    {
      "hadith_no": "248",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا عثمان بن أبي شيبة، حدثنا علي بن مسهر، عن سعد بن طارق، عن ربعي بن حراش، عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن حوضي لأبعد من أيلة من عدن والذي نفسي بيده إني لأذود عنه الرجال كما يذود الرجل الإبل الغريبة عن حوضه ‏\"‏ ‏.‏ قالوا يا رسول الله وتعرفنا قال ‏\"‏ نعم تردون على غرا محجلين من آثار الوضوء ليست لأحد غيركم ‏\"‏ ‏.‏",
      "text_en": " Hudhaifa reported:                      The Messenger of Allah (may peace be upon him) said: My Cistern is bigger than the space between Aila and Aden. By Him in Whose Hand is my life, I will drive away persons (from it) just as a person drives away unknown camels from his cistern. They (the companions) said: Messenger of Allab, would you recognise us? He said: Yes, you would come to me with white faces, and white hands and feet on account of the traces of ablution. None but you would have (this mark).",
      "chain": [
        "30203",
        "20345",
        "10766",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "279",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني علي بن حجر السعدي، حدثنا علي بن مسهر، أخبرنا الأعمش، عن أبي رزين، وأبي، صالح عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا ولغ الكلب في إناء أحدكم فليرقه ثم ليغسله سبع مرار ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported the Messenger of Allah (may peace be upon him) to have said:                      When a dog licks a utensil belonging to any one of you, (the thing contained in it) should be thrown away and then (the utensil) should be washed seven times.",
      "chain": [
        "20387",
        "20345",
        "11060",
        "10826",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "293",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن الشيباني، ح وحدثني علي بن حجر السعدي، - واللفظ له - أخبرنا علي بن مسهر، أخبرنا أبو إسحاق، عن عبد الرحمن بن الأسود، عن أبيه، عن عائشة، قالت كان إحدانا إذا كانت حائضا أمرها رسول الله صلى الله عليه وسلم أن تأتزر في فور حيضتها ثم يباشرها ‏.‏ قالت وأيكم يملك إربه كما كان رسول الله صلى الله عليه وسلم يملك إربه ‏.‏",
      "text_en": " 'A'isha reported:                      When anyone amongst us was menstruating the Messenger of Allah (may peace be upon him) asked her to tie waist-wrapper daring the time when the menstrual blood profusely flowed and then embraced her; and she ('A'isha) observed: And who amongst you can have control over his desires as the Messenger of Allah (may peace be upon him) had over his desires.",
      "chain": [
        "30201",
        "20345",
        "11352",
        "20387",
        "20345",
        "11049",
        "11056",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "316",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثناه قتيبة بن سعيد، وزهير بن حرب، قالا حدثنا جرير، ح وحدثنا علي بن حجر، حدثنا علي بن مسهر، ح وحدثنا أبو كريب، حدثنا ابن نمير، كلهم عن هشام، في هذا الإسناد وليس في حديثهم غسل الرجلين ‏.‏",
      "text_en": " This hadith is narrated by Abu Kuraib. Ibn Numair and others, all on the authority of Hisham with the same chain of transmitters, but in their narration these words are not there:                     \" washed his feet.\"",
      "chain": [
        "30367",
        "30022",
        "20028",
        "20387",
        "20345",
        "30216"
      ]
    },
    {
      "hadith_no": "400",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن حجر السعدي، حدثنا علي بن مسهر، أخبرنا المختار بن فلفل، عن أنس بن مالك، ح  وحدثنا أبو بكر بن أبي شيبة، - واللفظ له - حدثنا علي بن مسهر، عن المختار، عن أنس، قال بينا رسول الله صلى الله عليه وسلم ذات يوم بين أظهرنا إذ أغفى إغفاءة ثم رفع رأسه متبسما فقلنا ما أضحكك يا رسول الله قال ‏\"‏ أنزلت على آنفا سورة ‏\"‏ ‏.‏ فقرأ ‏\"‏ بسم الله الرحمن الرحيم ‏{‏ إنا أعطيناك الكوثر * فصل لربك وانحر * إن شانئك هو الأبتر‏}‏ ‏\"‏ ‏.‏ ثم قال ‏\"‏ أتدرون ما الكوثر ‏\"‏ ‏.‏ فقلنا الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإنه نهر وعدنيه ربي عز وجل عليه خير كثير هو حوض ترد عليه أمتي يوم القيامة آنيته عدد النجوم فيختلج العبد منهم فأقول رب إنه من أمتي ‏.‏ فيقول ما تدري ما أحدثت بعدك ‏\"‏ ‏.‏ زاد ابن حجر في حديثه بين أظهرنا في المسجد ‏.‏ وقال ‏\"‏ ما أحدث بعدك ‏\"‏ ‏.‏",
      "text_en": " Anas reported:                      One day the Messenger of Allah (may peace be upon him) was sitting amongst us that he dozed off. He then raised his head smilingly. We said: What makes you smile. Messenger of Allah? He said: A Sura has just been revealed to me, and then recited: In the name of Allah, the Compassionate, the Merciful. Verily We have given thee Kauthar (fount of abundance). Therefore turn to thy Lord for prayer and offer sacrifice, and surely thy enemy is cut off (from the good). Then he (the Holy Prophet) said: Do you know what Kauthar is? We said: Allah and His Messenger know best. The Holy Prophet (may peace be upon him) said: It (Kauthar) is a canal which my Lord, the Exalted and Glorious has promised me, and there is an abundance of good in it. It is a cistern and my people would come to it on the Day of Resurrection, and tumblers there would be equal to the number of stars. A servant would be turned away from (among the people gathered there). Upon this I would say: My Lord, he is one of my people, and He (the Lord) would say: You do not know that he innovated new things (in Islam) after you. Ibn Hujr made this addition in the hadith:\" He (the Holy Prophet) was sitting amongst us in the mosque, and He (Allah) said: (You don't know) what he innovated after you\"",
      "chain": [
        "20387",
        "20345",
        "10962",
        "19",
        "20436",
        "20345",
        "19"
      ]
    },
    {
      "hadith_no": "426",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن حجر، واللفظ، لأبي بكر قال ابن حجر أخبرنا وقال أبو بكر، حدثنا علي بن مسهر، عن المختار بن فلفل، عن أنس، قال صلى بنا رسول الله صلى الله عليه وسلم ذات يوم فلما قضى الصلاة أقبل علينا بوجهه فقال ‏\"‏ أيها الناس إني إمامكم فلا تسبقوني بالركوع ولا بالسجود ولا بالقيام ولا بالانصراف فإني أراكم أمامي ومن خلفي - ثم قال - والذي نفس محمد بيده لو رأيتم ما رأيت لضحكتم قليلا ولبكيتم كثيرا ‏\"‏ ‏.‏ قالوا وما رأيت يا رسول الله قال ‏\"‏ رأيت الجنة والنار ‏\"‏ ‏.‏",
      "text_en": " Anas reported:                      The Messenger of Allah (may peace be upon him) one day led us in the prayer. and when he completed the Prayer he turned his face towards us and said: 0 People, I am your Imam, so do not precede me in bowing and prostration and in standing and turning (faces, i. e. In pronouncing salutation), for I see you in front of me and behind me, and then said: By Him in Whose hand Is the life of Muhammad, if you could see what I see, you would have laughed little and wept much more. They said: What did you see, Messenger of Allah? He replied: (I saw) Paradise and Hell.",
      "chain": [
        "30201",
        "20387",
        "20436",
        "20345",
        "10962",
        "19"
      ]
    },
    {
      "hadith_no": "519",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، ح قال وحدثنيه سويد بن سعيد، حدثنا علي بن مسهر، كلاهما عن الأعمش، بهذا الإسناد ‏.‏ وفي رواية أبي كريب واضعا طرفيه على عاتقيه ‏.‏ ورواية أبي بكر وسويد متوشحا به ‏.‏",
      "text_en": " This hadith has been narrated by A'mash with the came chain of transmitters, and in the narration of Abu Karaib the words are:                     \" Placing its (mantle's) ends on his shoulders\" ; and the narration transmitted by Abu Bakr and Suwaid (the words are):\" the ends crossing with each other\".",
      "chain": [
        "30201",
        "30216",
        "20354",
        "20345"
      ]
    },
    {
      "hadith_no": "1190",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني علي بن حجر السعدي، أخبرنا علي بن مسهر، حدثنا الأعمش، عن إبراهيم بن يزيد التيمي، قال كنت أقرأ على أبي القرآن في السدة فإذا قرأت السجدة سجد فقلت له يا أبت أتسجد في الطريق قال إني سمعت أبا ذر يقول سألت رسول الله صلى الله عليه وسلم عن أول مسجد وضع في الأرض قال ‏\"‏ المسجد الحرام ‏\"‏ ‏.‏ قلت ثم أى قال ‏\"‏ المسجد الأقصى ‏\"‏ ‏.‏ قلت كم بينهما قال ‏\"‏ أربعون عاما ثم الأرض لك مسجد فحيثما أدركتك الصلاة فصل ‏\"‏ ‏.‏",
      "text_en": " Ibrahim b. Yazid al-Tayml reported:                      I used to read the Qur'an with my father in the vestibule (before the door of the mosque). When I recited the ayat (verses) concerning prostration, he prostrated himself. I said to him: Father, do you prostrate yourself in the path? He said: I heard Abu Dharr saying: I asked the Messenger of Allah (may peace be upon him) about the mosque that was first set up on the earth. He said: Masjid Harim. I said: Then which next? He said: The Masjid al-Aqsa. I said: How long is the space of time between the two? He said: Forty years. He (then) further said: The earth is a mosque for you, so wherever you are at the time of prayer, pray there.",
      "chain": [
        "20387",
        "20345",
        "11060",
        "11322",
        "23"
      ]
    },
    {
      "hadith_no": "1537",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، ح وحدثني سويد بن سعيد، قال حدثنا علي بن مسهر، جميعا عن الأعمش، ح وحدثنا إسحاق بن إبراهيم، - واللفظ له - أخبرنا عيسى بن يونس، حدثنا الأعمش، عن أبي سفيان، عن جابر، قال حدثنا أبو سعيد الخدري، أنه دخل على رسول الله صلى الله عليه وسلم فوجده يصلي على حصير يسجد عليه ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported that he went to the Messenger of Allah (may peace be upon him) and found him observing prayer on a mat and prostrating on that.",
      "chain": [
        "30201",
        "30216",
        "20354",
        "30547",
        "20345",
        "11060",
        "30123",
        "20347",
        "11060",
        "116",
        "34",
        "38"
      ]
    },
    {
      "hadith_no": "1715",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنيه علي بن حجر، حدثنا علي يعني ابن مسهر، ح وحدثناه أبو كريب، حدثنا أبو أسامة، ح وحدثناه أبو بكر، وأبو كريب وابن نمير عن عبد الله بن نمير، ح وحدثناه عمرو الناقد، حدثنا وكيع، كلهم عن هشام، بهذا الإسناد وفي حديث أبي أسامة إذا طلع الفجر ‏.‏",
      "text_en": " This hadith has been narrated by the same chain of transmitters and in the hadith narrated by Usama the words are:                     \" When it was dawn\".",
      "chain": [
        "20345",
        "30216",
        "20318",
        "20436",
        "20331",
        "30263"
      ]
    },
    {
      "hadith_no": "1852",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثناه إسماعيل بن الخليل، وسويد بن سعيد، عن علي بن مسهر، عن الأعمش، بهذا الإسناد ‏.‏ مثله ‏.‏",
      "text_en": " 'Abdullah (b. Mas'ud) reported that a mention was made of a man who slept the whole night till morning. He (the Holy Prophet) remarked:                      That is a man in whose ears (or in whose ear) the devil urinated.",
      "chain": [
        "30186",
        "30547",
        "20345"
      ]
    },
    {
      "hadith_no": "1904",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا هناد بن السري، ومنجاب بن الحارث التميمي، جميعا عن علي بن مسهر، عن الأعمش، بهذا الإسناد ‏.‏ وزاد هناد في روايته قال لي رسول الله صلى الله عليه وسلم وهو على المنبر ‏\"‏ اقرأ على ‏\"‏ ‏.‏",
      "text_en": " Ibrahim reported that the Apostle of Allah (may peace be upon him) asked 'Abdullah b. Mas'ud to recite to him (the Qur'an). He said:                      Should I recite it to you while it has been sent down or revealed to you? He (the Holy Prophet) said: I love to hear it from someone else. So he ('Abdullah b. Mas'ud) recited to him (from the beginning of Surat al Nisa' up to the verse:\" How shall then it be when We bring from every people a witness and bring you as a witness against them?\" He (the Holy Prophet) wept (on listening to it). It is narrated on the authority of Ibn Mas'ud through another chain of transmitters that the Apostle of Allah (may peace be upon him) also said that he had been a witness to his people as long as (said he): I lived among them or I had been among them.",
      "chain": [
        "30480",
        "30479",
        "20345"
      ]
    },
    {
      "hadith_no": "1973",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، ح وحدثنا علي بن حجر، - واللفظ له - أخبرنا علي بن مسهر، أخبرنا أبو إسحاق الشيباني، عن عبد الرحمن، بن الأسود عن أبيه، عن عائشة، قالت صلاتان ما تركهما رسول الله صلى الله عليه وسلم في بيتي قط سرا ولا علانية ركعتين قبل الفجر وركعتين بعد العصر ‏.‏",
      "text_en": " Aswad and Masruq reported:                      We bear testimony to the fact that 'A'isha said: Never was there a day that he (the Holy Prophet) was with me and he did not observe two rak'ahs of prayer in my house, i. e. two rak'ahs after the Asr.",
      "chain": [
        "30201",
        "20345",
        "20387",
        "20345",
        "11352",
        "11056",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2184",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني علي بن حجر السعدي، حدثنا علي بن مسهر، عن الأعمش، عن أبي، صالح عن ابن عمر، قال لما طعن عمر أغمي عليه فصيح عليه فلما أفاق قال أما علمتم أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الميت ليعذب ببكاء الحى ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported:                      When 'Umar was wounded he fainted, and there was a loud lamentation over him. When he regained consciousness he said: Didn't you know that the Messenger of Allah (may peace be upon him) said:\" The dead is punished because of the weeping of the living\"?",
      "chain": [
        "20387",
        "20345",
        "11060",
        "11161",
        "18"
      ]
    },
    {
      "hadith_no": "2185",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثني علي بن حجر، حدثنا علي بن مسهر، عن الشيباني، عن أبي بردة، عن أبيه، قال لما أصيب عمر جعل صهيب يقول واأخاه ‏.‏ فقال له عمر يا صهيب أما علمت أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الميت ليعذب ببكاء الحى ‏\"‏ ‏.‏",
      "text_en": " Abu Burda narrated on the authority of his father that when 'Umar was wounded Suhaib uttered (loudly in lamentation):                      O brother! Upon this 'Umar said: Suhaib, did you not know that the Messenger of Allah (may peace be upon him) said:\" The dead is punished because of the lamentation of the living\"?",
      "chain": [
        "20387",
        "20345",
        "11352",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2201",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني علي بن حجر السعدي، حدثنا علي بن مسهر، أخبرنا محمد بن قيس، الأسدي عن علي بن ربيعة الأسدي، عن المغيرة بن شعبة، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " A hadith like this has been narrated by Mughira b. Shu'ba from the Apostle of Allah (may peace be upon him).",
      "chain": [
        "20387",
        "20345",
        "20605",
        "11376",
        "166"
      ]
    },
    {
      "hadith_no": "2221",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا عثمان بن أبي شيبة، حدثنا جرير، ح وحدثنا إسحاق بن إبراهيم، أخبرنا عيسى بن يونس، ح وحدثنا منجاب بن الحارث التميمي، أخبرنا علي بن مسهر، ح وحدثنا إسحاق بن إبراهيم، وابن أبي عمر، جميعا عن ابن عيينة، عن الأعمش، بهذا الإسناد ‏.‏ نحوه ‏.‏",
      "text_en": " A hadith like this has been narrated by 'Uyaina on the authority of A'mash with the same chain of transmitters.",
      "chain": [
        "30203",
        "20028",
        "30123",
        "20347",
        "30479",
        "20345",
        "30123",
        "30421",
        "20005"
      ]
    },
    {
      "hadith_no": "2223",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني علي بن حجر السعدي، أخبرنا علي بن مسهر، حدثنا هشام بن عروة، عن أبيه، عن عائشة، قالت أدرج رسول الله صلى الله عليه وسلم في حلة يمنية كانت لعبد الله بن أبي بكر ثم نزعت عنه وكفن في ثلاثة أثواب سحول يمانية ليس فيها عمامة ولا قميص فرفع عبد الله الحلة فقال أكفن فيها ‏.‏ ثم قال لم يكفن فيها رسول الله صلى الله عليه وسلم وأكفن فيها ‏.‏ فتصدق بها ‏.",
      "text_en": " 'A'isha reported that the Messenger of Allah (may peace be upon him) was wrapped in a Yamani wrapper which belonged to 'Abdullah b Abu Bakr; then it was removed from him, and he was shrouded in three cotton sheets of white Yamani stuff from Sahul among which was neither a shirt nor a turban. 'Abdullah took up the Hullah and said:                      I would be shrouded in it, but then said: How is it that I should be shrouded in it in which the Messenger of Allah (may peace be upon him) was not shrouded! So he gave it in charity.",
      "chain": [
        "20387",
        "20345",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2368",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني سويد بن سعيد، حدثنا علي بن مسهر، ح وحدثناه إسحاق بن إبراهيم، وعبد بن حميد قالا أخبرنا عبد الرزاق، أخبرنا معمر، جميعا عن هشام بن عروة، في هذا الإسناد بمثله ‏.‏",
      "text_en": " This hadith has been narrated by Ibn 'Urwa with the same chain of transmitters.",
      "chain": [
        "30547",
        "20345",
        "30123",
        "30553",
        "20121",
        "11065"
      ]
    },
    {
      "hadith_no": "2374",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنيه زهير بن حرب، حدثنا يحيى بن سعيد، ح وحدثنا أبو كريب، حدثنا أبو أسامة، ح وحدثني علي بن حجر، أخبرنا علي بن مسهر، ح حدثنا الحكم بن موسى، حدثنا شعيب بن إسحاق، كلهم عن هشام، بهذا الإسناد ‏.‏ وفي حديث أبي أسامة ولم توص ‏.‏ كما قال ابن بشر ولم يقل ذلك الباقون ‏.‏",
      "text_en": "  This hadith has been narrated on the authority of Hisham with the same chain of transmitters. And in the hadith transmitted by Abu Usama the words are:                     \" She did not make any will,\" as it has been reported by Ibn Bishr, but it was not reported by the rest of the narrators.",
      "chain": [
        "20031",
        "30216",
        "20318",
        "20387",
        "20345",
        "30502",
        "20239"
      ]
    },
    {
      "hadith_no": "2466",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني سويد بن سعيد، حدثنا علي بن مسهر، عن داود، عن أبي حرب بن أبي، الأسود عن أبيه، قال بعث أبو موسى الأشعري إلى قراء أهل البصرة فدخل عليه ثلاثمائة رجل قد قرءوا القرآن فقال أنتم خيار أهل البصرة وقراؤهم فاتلوه ولا يطولن عليكم الأمد فتقسو قلوبكم كما قست قلوب من كان قبلكم وإنا كنا نقرأ سورة كنا نشبهها في الطول والشدة ببراءة فأنسيتها غير أني قد حفظت منها لو كان لابن آدم واديان من مال لابتغى واديا ثالثا ولا يملأ جوف ابن آدم إلا التراب ‏.‏ وكنا نقرأ سورة كنا نشبهها بإحدى المسبحات فأنسيتها غير أني حفظت منها ‏{‏ يا أيها الذين آمنوا لم تقولون ما لا تفعلون‏}‏ فتكتب شهادة في أعناقكم فتسألون عنها يوم القيامة ‏.‏",
      "text_en": " Abu Harb b. Abu al-Aswad reported on the authority of his father that Abu Musa al-Ash'ari sent for the reciters of Basra. They came to him and they were three hundred in number. They recited the Qur'an and he said:                      You are the best among the inhabitants of Basra, for you are the reciters among them. So continue to recite it. (But bear in mind) that your reciting for a long time may not harden your hearts as were hardened the hearts of those before you. We used to recite a surah which resembled in length and severity to (Surah) Bara'at. I have, however, forgotten it with the exception of this which I remember out of it:\" If there were two valleys full of riches, for the son of Adam, he would long for a third valley, and nothing would fill the stomach of the son of Adam but dust.\" And we used so recite a slirah which resembled one of the surahs of Musabbihat, and I have forgotten it, but remember (this much) out of it:\" Oh people who believe, why do you say that which you do not practise\" (lxi 2.) and\" that is recorded in your necks as a witness (against you) and you would be asked about it on the Day of Resurrection\" (xvii. 13).",
      "chain": [
        "30547",
        "20345",
        "10729"
      ]
    },
    {
      "hadith_no": "2519",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن الشيباني، عن يسير بن، عمرو قال سألت سهل بن حنيف هل سمعت النبي صلى الله عليه وسلم يذكر الخوارج فقال سمعته - وأشار بيده نحو المشرق ‏\"‏ قوم يقرءون القرآن بألسنتهم لا يعدو تراقيهم يمرقون من الدين كما يمرق السهم من الرمية ‏\"‏ ‏.‏",
      "text_en": " Yusair b. 'Amr reported that he inquired of Sahl b. Hunaif:                      Did you hear the Apostle of Allah (may peace be upon him) making a mention of the Khwarij? He said: I heard him say (and he pointed with his hand towards the east) that these would be a people who would recite the Qur'an with their tongues and it would not go beyond their collar bones. They would pass clean through their religion just as the arrow passes through the prey.",
      "chain": [
        "30201",
        "20345",
        "11352",
        "11570",
        "403"
      ]
    },
    {
      "hadith_no": "2614",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، وعباد بن العوام، عن الشيباني، عن ابن أبي أوفى، - رضى الله عنه - قال كنا مع رسول الله صلى الله عليه وسلم في سفر فلما غابت الشمس قال لرجل ‏\"‏ انزل فاجدح لنا ‏\"‏ ‏.‏ فقال يا رسول الله لو أمسيت ‏.‏ قال ‏\"‏ انزل فاجدح لنا ‏\"‏ ‏.‏ قال إن علينا نهارا ‏.‏ فنزل فجدح له فشرب ثم قال ‏\"‏ إذا رأيتم الليل قد أقبل من ها هنا - وأشار بيده نحو المشرق - فقد أفطر الصائم ‏\"‏ ‏.‏",
      "text_en": " Ibn Abi Aufa (Allah be pleased with him) reported:                      We were with the Messenger of Allah (may peace be upon him) on a journey. When the sun sank he said to a person: Get down and prepare barley meal for us. Upon this he said: Messenger of Allah, let there be dusk. (He the Holy Prophet) said: Get down and prepare barley meal for us. He (the person) said: There is still (the light of) day upon us. (But) he got down (in obedience to the command of the Holy Prophet) and prepared a barley meal for him and he (the Holy Prophet) drank that (liquid meal) and then said: When you see the night approaching from that side (west) (and he pointed towards the east with his hand), then the observer of the fast should break it.",
      "chain": [
        "30201",
        "20345",
        "20431",
        "11352",
        "5115"
      ]
    },
    {
      "hadith_no": "2630",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن عبيد الله بن عمر، عن القاسم، عن عائشة، - رضى الله عنها - قالت كان رسول الله صلى الله عليه وسلم يقبلني وهو صائم وأيكم يملك إربه كما كان رسول الله صلى الله عليه وسلم يملك إربه .",
      "text_en": " 'A'isha reported:                      Allah's Messenger (may peace be upon him) used to kiss me while observing fast; and who among you can control his desire as the Messenger of Allah (may peace be upon him) could control his desire.",
      "chain": [
        "30201",
        "20345",
        "11201",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "2753",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني علي بن حجر السعدي، حدثنا علي بن مسهر أبو الحسن، عن عبد الله، بن عطاء عن عبد الله بن بريدة، عن أبيه، - رضى الله عنه - قال بينا أنا جالس، عند رسول الله صلى الله عليه وسلم إذ أتته امرأة فقالت إني تصدقت على أمي بجارية وإنها ماتت - قال - فقال ‏\"‏ وجب أجرك وردها عليك الميراث ‏\"‏ ‏.‏ قالت يا رسول الله إنه كان عليها صوم شهر أفأصوم عنها قال ‏\"‏ صومي عنها ‏\"‏ ‏.‏ قالت إنها لم تحج قط أفأحج عنها قال ‏\"‏ حجي عنها ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Buraida (Allah be pleased with him) reported on the authority of his father:                      When we were sitting with the Messenger of Allah (may peace be upon him), a woman came to him and said: I had gifted to my mother a maid-servant, and now she (the mother) has died. Thereupon he (the Holy Prophet) said: There is a definite reward for you and she (the maid-servant) has been returned to you as an inheritance. She (that woman) again said: Fasts of a month (of Ramadan) are due upon her; should I observe them on her behalf? He (the Holy Prophet) said: Observe fasts on her behalf. She (again) said: She did not perform Hajj, should I perform it on her behalf? He (the Holy Prophet) said: Perform Hajj on her behalf.",
      "chain": [
        "20387",
        "20345",
        "10785",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "2783",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنيه علي بن حجر، حدثنا علي بن مسهر، ح وحدثني إبراهيم بن موسى، أخبرنا عيسى بن يونس، كلاهما عن عثمان بن حكيم، في هذا الإسناد ‏.‏ بمثله ‏.‏",
      "text_en": "",
      "chain": [
        "20345",
        "30309",
        "20347",
        "11889"
      ]
    },
    {
      "hadith_no": "2824",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن الشيباني، عن جبلة، ومحارب عن ابن عمر، - رضى الله عنهما - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تحينوا ليلة القدر في العشر الأواخر ‏\"‏ ‏.‏ أو قال ‏\"‏ في التسع الأواخر ‏\"‏ ‏.‏",
      "text_en": " 'Ibn 'Umar (Allah be pleased with both of them) reported Allah's Messenger (may peace be upon him) as saying:                      Seek the time of Lailat-ul-Qadr in the last (ten nights), or he said: in the last nine (nights).",
      "chain": [
        "30201",
        "20345",
        "11352",
        "11389",
        "18"
      ]
    },
    {
      "hadith_no": "2877",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن عبيد الله، عن نافع، عن ابن عمر، - رضى الله عنهما - قال كان رسول الله صلى الله عليه وسلم إذا وضع رجله في الغرز وانبعثت به راحلته قائمة أهل من ذي الحليفة ‏.‏",
      "text_en": " Ibn 'Umar (Allah be pleased with them) reported that the Messenger of Allah (may peace be upon him) pronounced Talbiya in Dhu'l-Hulaifa as he put his feet in the stirrup and his camel stood up and proceeded.",
      "chain": [
        "30201",
        "20345",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2931",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه قتيبة، وابن، رمح عن الليث بن سعد، ح وحدثنا شيبان بن فروخ، حدثنا جرير، - يعني ابن حازم - جميعا عن نافع، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا علي، بن مسهر ح وحدثنا ابن نمير، حدثنا أبي جميعا، عن عبيد الله، ح وحدثني أبو كامل، حدثنا حماد، حدثنا أيوب، ح وحدثنا ابن المثنى، حدثنا يزيد بن هارون، أخبرنا يحيى بن سعيد، كل هؤلاء عن نافع، عن ابن عمر، - رضى الله عنهما - عن النبي صلى الله عليه وسلم ‏.‏ بمثل حديث مالك وابن جريج ولم يقل أحد منهم عن نافع عن ابن عمر - رضى الله عنهما - سمعت النبي صلى الله عليه وسلم ‏.‏ إلا ابن جريج وحده وقد تابع ابن جريج على ذلك ابن إسحاق ‏.‏ وحدثنيه فضل بن سهل، حدثنا يزيد بن هارون، أخبرنا محمد بن إسحاق، عن نافع، وعبيد الله بن عبد الله، عن ابن عمر، - رضى الله عنهما - قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ خمس لا جناح في قتل ما قتل منهن في الحرم ‏\"‏ ‏.‏ فذكر بمثله‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn 'Umar through be upon him) as saying:                      Five (are the beasts) in killing which or their being killed in the precinct of the Ka'ba there is no sin.\" The rest of the hadith is the same.",
      "chain": [
        "30367",
        "30490",
        "20023",
        "20656",
        "11272",
        "11014",
        "30201",
        "20345",
        "30212",
        "11201",
        "20022",
        "11015"
      ]
    },
    {
      "hadith_no": "2989",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه سويد بن سعيد، عن علي بن مسهر، عن الأعمش، عن إبراهيم، عن الأسود، عن عائشة، - رضى الله عنها - قالت خرجنا مع رسول الله صلى الله عليه وسلم نلبي لا نذكر حجا ولا عمرة ‏.‏ وساق الحديث بمعنى حديث منصور ‏.‏",
      "text_en": " 'A'isha (Allah be pleased, with her) reported:                      We went out with the Mes. senger of Allah (may peace be upon him) pronouncing Talbiya having no explicit inten- tion of Pilgrimage or 'Umra. The rest of the hadith is the same.",
      "chain": [
        "30547",
        "20345",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "3133",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، قال حدثنا علي بن مسهر، عن ابن جريج، عن أبي، الزبير عن جابر، قال طاف رسول الله صلى الله عليه وسلم بالبيت في حجة الوداع على راحلته يستلم الحجر بمحجنه لأن يراه الناس وليشرف وليسألوه فإن الناس غشوه‏.‏",
      "text_en": " Jabir (Allah be pleased with him) reported that Allah's Messenger (may peace be upon him) circumambulated the House on the back of his riding camel on the occasion of the Farewell Pilgrimage and touched the Stone with his stick so that the people should see him, and he should be conspicuous, and they should be able to ask him (questions pertaining to religion) as the people had crowded round him.",
      "chain": [
        "30201",
        "20345",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3394",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني علي بن حجر السعدي، أخبرنا علي بن مسهر، ح وحدثني أبو سعيد، الأشج حدثنا وكيع، جميعا عن الأعمش، بهذا الإسناد ‏.‏ نحو حديث أبي كريب عن أبي، معاوية إلى آخره وزاد في الحديث ‏\"‏ فمن أخفر مسلما فعليه لعنة الله والملائكة والناس أجمعين لا يقبل منه يوم القيامة صرف ولا عدل ‏\"‏ ‏.‏ وليس في حديثهما ‏\"‏ من ادعى إلى غير أبيه ‏\"‏ ‏.‏ وليس في رواية وكيع ذكر يوم القيامة ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of A'mash with the same chain of transmitters (but at the end) these words are added:                     \" He who violated the covenant with a Muslim, there is upon him the curse of Allah, of angels and of all people. Neither an obligatory act nor a supererogatory act would be accepted from him as recompense on the Day of Resurrection; and in the hadith transmitted by two other narrators these words are not found:\" He who claimed false paternity.\" And in the hadith transmitted by Waki' there is no mention of the Day of Resurrection.",
      "chain": [
        "20387",
        "20345",
        "30200"
      ]
    },
    {
      "hadith_no": "3407",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن الشيباني، عن يسير، بن عمرو عن سهل بن حنيف، قال أهوى رسول الله صلى الله عليه وسلم بيده إلى المدينة فقال ‏\"‏ إنها حرم آمن ‏\"‏ ‏.‏",
      "text_en": " Sahl b. Hunif reported that Allah's Messenger (may peace be upon him) pointed with his hands towards Medina and said:                      That is a sacred territory and a place of safety.",
      "chain": [
        "30201",
        "20345",
        "11352",
        "11570",
        "403"
      ]
    },
    {
      "hadith_no": "3509",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني محرز بن عون بن أبي عون، حدثنا علي بن مسهر، عن داود بن أبي، هند عن ابن سيرين، عن أبي هريرة، قال نهى رسول الله صلى الله عليه وسلم أن تنكح المرأة على عمتها أو خالتها أو أن تسأل المرأة طلاق أختها لتكتفئ ما في صحفتها فإن الله عز وجل رازقها ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported that Allah's Messenger (may peace be upon him) forbade the combining of a woman in marriage with her father's sister, or with her mother's sister, or that a woman should ask for divorce for her sister in order to deprive her of what belongs to her. Allah, the Exalted'and Majestic, is her Sustainer too.",
      "chain": [
        "20345",
        "11585",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "3522",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن عبيد الله، بهذا الإسناد.",
      "text_en": "",
      "chain": [
        "30201",
        "20345"
      ]
    },
    {
      "hadith_no": "3604",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن عبيد الله بن عمر، عن القاسم بن محمد، عن عائشة، قالت طلق رجل امرأته ثلاثا فتزوجها رجل ثم طلقها قبل أن يدخل بها فأراد زوجها الأول أن يتزوجها فسئل رسول الله صلى الله عليه وسلم عن ذلك فقال ‏\"‏ لا حتى يذوق الآخر من عسيلتها ما ذاق الأول ‏\"‏ ‏.‏",
      "text_en": " 'A'Asha (Allah be pleased with her) reported:                      A person divorced his wife by three pronouncements; then another person married her and he also divorced her without having sexual intercourse with her. Then the first husband of her intended to remarry her. It was about such a case that Allah's Messenger (may peace be upon him) was asked, whereupon he said: No, until the second one has tasted her sweetness as the first one had tasted.",
      "chain": [
        "30201",
        "20345",
        "11201",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "3657",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "وحدثناه زهير بن حرب، حدثنا يحيى، وهو القطان ح وحدثنا محمد بن يحيى، بن مهران القطعي حدثنا بشر بن عمر، جميعا عن شعبة، ح وحدثناه أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن سعيد بن أبي عروبة، كلاهما عن قتادة، بإسناد همام سواء غير أن حديث شعبة انتهى عند قوله ‏\"‏ ابنة أخي من الرضاعة ‏\"‏ ‏.‏ وفي حديث سعيد ‏\"‏ وإنه يحرم من الرضاعة ما يحرم من النسب ‏\"‏ ‏.‏ وفي رواية بشر بن عمر سمعت جابر بن زيد ‏.‏",
      "text_en": " A hadith like this is narrated on the authority of Hammam, Sa'id, Bishr b 'Umar, but with a small variation of words.",
      "chain": [
        "30022",
        "20031",
        "20031",
        "11222",
        "20211",
        "20020",
        "30201",
        "20345"
      ]
    },
    {
      "hadith_no": "3753",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "قال أبو إسحاق إبراهيم حدثنا الحسن بن بشر بن القاسم، حدثنا أبو أسامة، بهذا سواء وحدثنيه سويد بن سعيد، حدثنا علي بن مسهر، عن هشام بن عروة، بهذا الإسناد نحوه ‏.‏",
      "text_en": "  This hadith has been narrated on the authority of 'Urwa with the same chain of transmitters.",
      "chain": [
        "30188",
        "20345",
        "11065"
      ]
    },
    {
      "hadith_no": "3758",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن إسماعيل بن أبي، خالد عن الشعبي، عن مسروق، قال ما أبالي خيرت امرأتي واحدة أو مائة أو ألفا بعد أن تختارني ولقد سألت عائشة فقالت قد خيرنا رسول الله صلى الله عليه وسلم أفكان طلاقا.",
      "text_en": " Masruq reported:                      I do not mind if I give option to my wife (to get divorce) once, hundred times, or thousand times after (knowing it) that she has chosen me (and would never seek divorce). I asked 'A'isha (Allah be pleased with her) (about it) and she said: Allah's Messenger (may peace be upon him) gave us the option, but did it imply divorce? (It was in fact not a divorce; it is effective when women actually avail themselves of it.)",
      "chain": [
        "30201",
        "20345",
        "11418",
        "11052",
        "11018"
      ]
    },
    {
      "hadith_no": "3919",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن عبيد الله، ح وحدثنا محمد بن عبد الله بن نمير، - واللفظ له - حدثنا أبي، حدثنا عبيد الله، عن نافع، عن ابن، عمر أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من اشترى طعاما فلا يبعه حتى يستوفيه‏\"‏ ‏.‏ قال وكنا نشتري الطعام من الركبان جزافا فنهانا رسول الله صلى الله عليه وسلم أن نبيعه حتى ننقله من مكانه ‏.",
      "text_en": " Ibn Umar (Allah be pleased with them) reported Allah's Messenger (may peace be upon him) as saying:                      He who buys foodgrain should not sell that before taking possession of it. He (the narrator) said: We used to buy foodgrain from the caravans in bulk, but Allah's Messenger (may peace be upon him) forbade us to re-sell that until we had shifted it to some other place.",
      "chain": [
        "30201",
        "20345",
        "11201",
        "11905",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4037",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا عبد الواحد بن زياد، ح وحدثنا أبو بكر بن أبي، شيبة حدثنا علي بن مسهر، كلاهما عن الشيباني، عن عبد الله بن السائب، قال سألت عبد الله بن معقل عن المزارعة، فقال أخبرني ثابت بن الضحاك، أن رسول الله صلى الله عليه وسلم نهى عن المزارعة ‏.‏ وفي رواية ابن أبي شيبة نهى عنها ‏.‏ وقال سألت ابن معقل ‏.‏ ولم يسم عبد الله ‏.‏",
      "text_en": " Abdullah b. al Sa'ib reported:                      I asked Abdullah b. Ma'qil about Muzara'a (cultivating land on share basis in the produce). He said: Thabit b. Dahhak informed me that Allah's Messenger (may peace be upon him) forbade Muzara'a as Ibn Abu Shaiba forbade it with a slight change of words. He (the narrator) said: I asked Ibn Ma'qil but he did not name 'Abdullah.",
      "chain": [
        "30399",
        "20256",
        "30201",
        "20345",
        "11352",
        "2065",
        "18580",
        "1902"
      ]
    },
    {
      "hadith_no": "4045",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثني علي بن حجر السعدي، حدثنا علي، - وهو ابن مسهر - أخبرنا عبيد، الله عن نافع، عن ابن عمر، قال أعطى رسول الله صلى الله عليه وسلم خيبر بشطر ما يخرج من ثمر أو زرع فكان يعطي أزواجه كل سنة مائة وسق ثمانين وسقا من تمر وعشرين وسقا من شعير فلما ولي عمر قسم خيبر خير أزواج النبي صلى الله عليه وسلم أن يقطع لهن الأرض والماء أو يضمن لهن الأوساق كل عام فاختلفن فمنهن من اختار الأرض والماء ومنهن من اختار الأوساق كل عام فكانت عائشة وحفصة ممن اختارتا الأرض والماء ‏.‏",
      "text_en": " Ibn Umar (Allah be pleased with them) reported:                      Allah's Messenger (may peace be upon him) handed over the land of Khaibar (on the condition) of the share of produce of fruits and harvest, and he also gave to his wives every year one hundred wasqs: eighty wasqs of dates and twenty wasqs of barley. When 'Umar became the caliph he distributed the (lands and trees) of Khaibar, and gave option to the wives of Allah's Apostle (may peace be upon him) to earmark for themselves the land and water or stick to the wasqs (that they got) every year. They differed in this matter. Some of them opted for land and water, and some of them opted for wasqs every year. 'A'isha and Hafsa were among those who opted for land and water.",
      "chain": [
        "20387",
        "20345",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4268",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Gifts - كتاب الهبات",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن أبي حيان، عن الشعبي، عن النعمان بن بشير، ح. وحدثنا محمد بن عبد الله بن نمير، - واللفظ له - حدثنا محمد بن بشر، حدثنا أبو حيان التيمي، عن الشعبي، حدثني النعمان بن بشير، أن أمه بنت رواحة، سألت أباه بعض الموهبة من ماله لابنها فالتوى بها سنة ثم بدا له فقالت لا أرضى حتى تشهد رسول الله صلى الله عليه وسلم على ما وهبت لابني ‏.‏ فأخذ أبي بيدي وأنا يومئذ غلام فأتى رسول الله صلى الله عليه وسلم فقال يا رسول الله إن أم هذا بنت رواحة أعجبها أن أشهدك على الذي وهبت لابنها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا بشير ألك ولد سوى هذا ‏\"‏ ‏.‏ قال نعم ‏.‏ فقال ‏\"‏ أكلهم وهبت له مثل هذا ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فلا تشهدني إذا فإني لا أشهد على جور ‏\"‏ ‏.‏",
      "text_en": " Nu'man b. Bashir reported that his mother bint Rawaha asked his (Nu'man's) father about donating some gifts from his property to his son. He deferred the matter by one year, and then set forth to do that. She (Nu'man's mother) said:                      I shall not be pleased unless you call Allah's Messenger (may peace be upon him) as witness to what you confer as a gift on your son. (Nu'man said): So father took hold of my hand and I was at that time a boy, and came to Allah's Messenger (may peace be upon him). and said: Allah's Messenger, the mother of this son (of mine), daughter of Rawaha wishes that I should call you witness to what I confer as gift to her son. Allah's Messenger (may pease be upon him) said: Bashir, have you any other son besides this (son of yours)? He said: Yes. He (the Holy Prophet) said: Have you given gifts to all of them like this? He said: No. Thereupon he (the Holy Prophet) said: Then call me not as witness, for I cannot be witness to an injustice.",
      "chain": [
        "30201",
        "20345",
        "11404",
        "11052",
        "274",
        "20352",
        "11404",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "4424",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، ومحمد بن بشر، ح وحدثنا إسحاق بن إبراهيم، وعلي بن خشرم، قالا أخبرنا عيسى بن يونس، جميعا عن ابن أبي، عروبة بهذا الإسناد ‏.‏ وفي حديث عيسى ‏\"‏ ثم يستسعى في نصيب الذي لم يعتق غير مشقوق عليه ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated through another chain of transmitters (and the words are):                     \" He will be required to work (in order to secure freedom) for that por- tion in which he has not been emancipated, without overburdening him.\"",
      "chain": [
        "30201",
        "20345",
        "20352",
        "30123",
        "30556",
        "20347"
      ]
    },
    {
      "hadith_no": "4501",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "حدثنا قتيبة بن سعيد، وابن، رمح عن الليث بن سعد، ح وحدثنا زهير بن حرب، وابن المثنى قالا حدثنا يحيى، وهو القطان ح وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، كلهم عن عبيد الله، ح وحدثني زهير بن حرب، حدثنا إسماعيل يعني ابن علية، ح وحدثنا أبو الربيع، وأبو كامل قالا حدثنا حماد، ح وحدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا سفيان، عن أيوب السختياني، وأيوب، بن موسى وإسماعيل بن أمية ح.",
      "text_en": " This hadith has been narrated on the authority of Ibn 'Umar through some other chains of transmitters but with a slight variation of words.",
      "chain": [
        "30367",
        "30490",
        "20023",
        "30022",
        "20031",
        "20031",
        "30212",
        "20331",
        "30201",
        "20345",
        "11201",
        "30022",
        "20208"
      ]
    },
    {
      "hadith_no": "4541",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، - واللفظ له - حدثنا علي بن مسهر، عن أبي، إسحاق الشيباني قال سألت عبد الله بن أبي أوفى هل رجم رسول الله صلى الله عليه وسلم قال نعم ‏.‏ قال قلت بعد ما أنزلت سورة النور أم قبلها قال لا أدري ‏.‏",
      "text_en": " Abu Ishaq Shaibani said:                      I asked 'Abdullah b. Abu Aufi if Allah's Messenger (may peace be upon him) awarded (the punishment) of stoning (to death). He said: Yes. I said: After Sura al-Nur was revealed or before that? He said: I do not know.",
      "chain": [
        "20345",
        "11352"
      ]
    },
    {
      "hadith_no": "4574",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "حدثني علي بن حجر السعدي، حدثنا علي بن مسهر، عن هشام بن عروة، عن أبيه، عن عائشة، قالت دخلت هند بنت عتبة امرأة أبي سفيان على رسول الله صلى الله عليه وسلم فقالت يا رسول الله إن أبا سفيان رجل شحيح لا يعطيني من النفقة ما يكفيني ويكفي بني إلا ما أخذت من ماله بغير علمه ‏.‏ فهل على في ذلك من جناح فقال رسول الله صلى الله عليه وسلم ‏\"‏ خذي من ماله بالمعروف ما يكفيك ويكفي بنيك ‏\"‏ ‏.‏",
      "text_en": " A'isha reported:                      Hind. the daughter of 'Utba, wife of Abu Sufyan, came to Allah's Messenger (may peace be upon him) and said: Abu Sufyan is a miserly person. He does not give adequate maintenance for me and my children, but (I am constrained) to take from his wealth (some part of it) without his knowledge. Is there any sin for me? Thereupon Allah's Messenger (may peace be upon him) said: Take from his property what is customary which may suffice you and your children.",
      "chain": [
        "20387",
        "20345",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4609",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Luqatah - كتاب اللقطة",
      "chapter_no": "32",
      "text_ar": "وحدثنا قتيبة بن سعيد، ومحمد بن رمح، جميعا عن الليث بن سعد، ح وحدثناه أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، ح وحدثنا ابن نمير، حدثني أبي كلاهما، عن عبيد الله، ح وحدثني أبو الربيع، وأبو كامل قالا حدثنا حماد، ح وحدثني زهير بن حرب، حدثنا إسماعيل، - يعني ابن علية - جميعا عن أيوب، ح وحدثنا ابن أبي عمر، حدثنا سفيان، عن إسماعيل بن أمية، ح وحدثنا محمد بن رافع، حدثنا عبد الرزاق، عن معمر،عن أيوب، وابن، جريج عن موسى، كل هؤلاء عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ‏.‏ نحو حديث مالك غير أن في حديثهم جميعا ‏\"‏ فينتثل ‏\"‏ ‏.‏ إلا الليث بن سعد فإن في حديثه ‏\"‏ فينتقل طعامه ‏\"‏ ‏.‏ كرواية مالك ‏.‏",
      "text_en": " This hadith has been narrated through another chain of transmitters with a slight variation of words.",
      "chain": [
        "30367",
        "30490",
        "20023",
        "30201",
        "20345",
        "30212",
        "11201",
        "30137",
        "20022",
        "30022",
        "20208"
      ]
    },
    {
      "hadith_no": "4658",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، وعبد الرحيم بن سليمان، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، قال بعث رسول الله صلى الله عليه وسلم سرية إلى نجد فخرجت فيها فأصبنا إبلا وغنما فبلغت سهماننا اثنى عشر بعيرا ونفلنا رسول الله صلى الله عليه وسلم بعيرا بعيرا ‏.‏",
      "text_en": " It has been narrated by Ibn 'Umar that the Messenger of Allah (may peace be upon him) sent an expedition to Najd, and I (also) went with the troops. We got camels and goats as spoils of war, and our share amounted to twelve camels per head, and the Messenger of Allah (may peace be upon him) gave an extra camel to each of us.",
      "chain": [
        "30201",
        "20345",
        "20334",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "4727",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، ووكيع، عن زكرياء، عن الشعبي، قال أخبرني عبد الله بن مطيع، عن أبيه، قال سمعت النبي صلى الله عليه وسلم يقول يوم فتح مكة ‏\"‏ لا يقتل قرشي صبرا بعد هذا اليوم إلى يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abdullah b. Muti' who heard from his father and said:                      I heard the Holy Prophet (may peace be upon him) say on the day of the Conquest of Mecca: No Quraishite will be killed hound hand and foot from this day until the Day of judgment.",
      "chain": [
        "30201",
        "20345",
        "20032",
        "11338",
        "11052",
        "30509"
      ]
    },
    {
      "hadith_no": "4934",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني سويد بن سعيد، حدثنا علي بن مسهر، عن عاصم، عن أبي عثمان، قال أخبرني مجاشع بن مسعود السلمي، قال جئت بأخي أبي معبد إلى رسول الله صلى الله عليه وسلم بعد الفتح فقلت يا رسول الله بايعه على الهجرة ‏.‏ قال ‏\"‏ قد مضت الهجرة بأهلها ‏\"‏ ‏.‏ قلت فبأى شىء تبايعه قال ‏\"‏ على الإسلام والجهاد والخير ‏\"‏ ‏.‏ قال أبو عثمان فلقيت أبا معبد فأخبرته بقول مجاشع فقال صدق ‏.‏",
      "text_en": " It has been reported on the authority of Mujashi' b. Mas'ud who said:                      I brought my brother Abu Ma'bad to the Messenger of Allah (may peace he upon him) after the conquest of Mecca and said: Messenger of Allah, allow him to swear his pledge of migration at your hand. He said: The period of migration is over with those who had to do it (and now nobody can get this meritorious distinctions) I said: For what actions will you allow him to bind himself in oath? He said: (He can do so) for serving the cause of Islam, for fighting in the way of Allah and for fighting in the cause of virtue. Abd Uthman said: I met Abd Ma'bad and told him what I had heard from Mujashi'. He said: He has told the truth.",
      "chain": [
        "30547",
        "20345",
        "11080",
        "11113",
        "5271"
      ]
    },
    {
      "hadith_no": "4954",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا قتيبة، وابن، رمح عن الليث بن سعد، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، وعبد الله بن نمير، ح وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا عبيد، الله بن سعيد حدثنا يحيى، كلهم عن عبيد الله، ح وحدثنا هارون بن سعيد الأيلي، حدثنا  ابن وهب، حدثني أسامة، كلهم عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ‏.‏ بمثل حديث مالك عن نافع ‏.‏",
      "text_en": " The same tradition has been handed down through a different chain of transmitters.",
      "chain": [
        "30367",
        "30490",
        "20023",
        "30201",
        "20345",
        "20331",
        "30212",
        "20331",
        "30359",
        "11201",
        "30492",
        "20029"
      ]
    },
    {
      "hadith_no": "5054",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثناه الوليد بن شجاع، حدثنا علي بن مسهر، عن عاصم، في هذا الإسناد بمثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Asim through the same chain of transmitters.",
      "chain": [
        "30482",
        "20345"
      ]
    },
    {
      "hadith_no": "5090",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثني الوليد بن شجاع السكوني، حدثنا علي بن مسهر، عن عاصم، عن الشعبي، عن عدي بن حاتم، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ إذا أرسلت كلبك فاذكر اسم الله فإن أمسك عليك فأدركته حيا فاذبحه وإن أدركته قد قتل ولم يأكل منه فكله وإن وجدت مع كلبك كلبا غيره وقد قتل فلا تأكل فإنك لا تدري أيهما قتله وإن رميت سهمك فاذكر اسم الله فإن غاب عنك يوما فلم تجد فيه إلا أثر سهمك فكل إن شئت وإن وجدته غريقا في الماء فلا تأكل ‏\"‏ ‏.‏",
      "text_en": " Adi b. Hatim reported:                      Allah's Messenger (way peace be upon him) said to me: When you let off your dog, recite the name of Allah, and if it catches (game for you) and you find it alive, then slaughter it; if you find it killed and that (your dog) has eaten nothing out of that, (even then) you may eat it; but if you find along with your dog another dog, and (the game an) dead, then don't eat, for you do not know which of the two has killed it. And if you shoot your arrow, recite the name of Allah, but if it (game) goes out of your sight for a day and you do not find on that but the mark of your arrow, then eat that it you so like, but if you find it drowned in water, then don't eat that.",
      "chain": [
        "30482",
        "20345",
        "11080",
        "11052",
        "212"
      ]
    },
    {
      "hadith_no": "5122",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن الشيباني، قال سألت عبد الله بن أبي أوفى عن لحوم الحمر الأهلية، فقال أصابتنا مجاعة يوم خيبر ونحن مع رسول الله صلى الله عليه وسلم وقد أصبنا للقوم حمرا خارجة من المدينة فنحرناها فإن قدورنا لتغلي إذ نادى منادي رسول الله صلى الله عليه وسلم أن اكفئوا القدور ولا تطعموا من لحوم الحمر شيئا فقلت حرمها تحريم ماذا قال تحدثنا بيننا فقلنا حرمها ألبتة وحرمها من أجل أنها لم تخمس ‏.‏",
      "text_en": " Shaibani reported:                      I asked 'Abdullah b. Abu Aufa about (the lawfulness or unlawfulness of) the flesh of the domestic asses. He said: We experienced hunger on the Day of Khaibar as we were with the Messenger of Allah (may peace be upon him). We found domestic asses in the exterior of Medina. We slaughtered them and our earthen pots were boiling when the announcer of the Messenger of Allah (may peace be upon him) made an announcement that the earthen pots should be turned upside down and nothing of the flesh of the domestic asses should be eaten. I said: What kind of prohibition is it that he (the Holy Prophet) has made? He said: We discussed it amongst -ourselves. Some of us aaid that it has been declared unlawful for ever, (whereas others said) it has been declared unlawful since one-fifth (of the booty) has not been given (to the treasury, as is legally required).",
      "chain": [
        "30201",
        "20345",
        "11352",
        "5115"
      ]
    },
    {
      "hadith_no": "5152",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن الشيباني، عن يزيد بن، الأصم قال دعانا عروس بالمدينة فقرب إلينا ثلاثة عشر ضبا فآكل وتارك فلقيت ابن عباس من الغد فأخبرته فأكثر القوم حوله حتى قال بعضهم قال رسول الله صلى الله عليه وسلم ‏\"‏ لا آكله ولا أنهى عنه ولا أحرمه ‏\"‏ ‏.‏ فقال ابن عباس بئس ما قلتم ما بعث نبي الله صلى الله عليه وسلم إلا محلا ومحرما إن رسول الله صلى الله عليه وسلم بينما هو عند ميمونة وعنده الفضل بن عباس وخالد بن الوليد وامرأة أخرى إذ قرب إليهم خوان عليه لحم فلما أراد النبي صلى الله عليه وسلم أن يأكل قالت له ميمونة إنه لحم ضب ‏.‏ فكف يده وقال ‏\"‏ هذا لحم لم آكله قط ‏\"‏ ‏.‏ وقال لهم ‏\"‏ كلوا ‏\"‏ ‏.‏ فأكل منه الفضل وخالد بن الوليد والمرأة ‏.‏ وقالت ميمونة لا آكل من شىء إلا شىء يأكل منه رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Yazid b. al-Asamm reported:                      A newly wedded person of Medina invited us to a wedding feast, and he served us thirteen lizards. There were those who ate it and those who abandoned it. I met Ibn 'Abbas the next day, and informed him (about this) in the presence of many persons. Some of them said that the Messenger of Allah (may peace be upon him) had observed: I neither eat it nor forbid (anyone) from eating it, nor declare it to be unlawful. Thereupon Ibn 'Abbas said: Sad it is what you say! Allah's Apostle (may peace be upon him) has not been sent, but (to declare in clear words) the lawful and the unlawful (things). We were once with Allah's Messenger (may peace be. upon him) as he was with Maimuna, and there were with him al-Fadl b. 'Abbas, Khalid b. Walid and some women (also) when a tray of food containing flesh was presented to him. As Allah's Apostle (may peace be upon him) was about to eat that, Maimuna said: It is the flesh of the lizard. He withdrew his hand saying: That is the flesh which I never eat; but he said to them (those who were present there): You may eat. Al-Fadl ate out of that, so did Khalid b Walid, and the women. Maimuna (however) said: I do not eat anything but that which Allah's Messenger (may peace be upon him) eats.",
      "chain": [
        "30201",
        "20345",
        "11352",
        "10842"
      ]
    },
    {
      "hadith_no": "5217",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، ح وحدثنا يحيى بن أيوب، حدثنا ابن علية، كلاهما عن ابن جريج، عن عطاء، عن جابر، ح وحدثني محمد بن حاتم، - واللفظ له - حدثنا يحيى بن سعيد، عن ابن جريج، حدثنا عطاء، قال سمعت جابر بن، عبد الله يقول كنا لا نأكل من لحوم بدننا فوق ثلاث منى فأرخص لنا رسول الله صلى الله عليه وسلم فقال ‏\"‏ كلوا وتزودوا ‏\"‏ ‏.‏ قلت لعطاء قال جابر حتى جئنا المدينة قال نعم ‏.‏",
      "text_en": " Jabir b. Abdullah reported:                      We did not eat the flesh of our sacrificial animals beyond three days in Mina. Then Allah's Messenger (may peace be upon him) permitted us saying: Eat and make it a provision (for journey). I asked 'Ata' whether Jabir had also said: Till we came to Medina. He said: Yes.",
      "chain": [
        "30201",
        "20345",
        "20379",
        "11070",
        "11029",
        "34",
        "38487",
        "20031",
        "11070",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "5277",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن الشيباني، عن حبيب، عن سعيد بن جبير، عن ابن عباس، قال نهى النبي صلى الله عليه وسلم أن يخلط التمر والزبيب جميعا وأن يخلط البسر والتمر جميعا وكتب إلى أهل جرش ينهاهم عن خليط التمر والزبيب ‏.‏",
      "text_en": " Ibn 'Abbas reported that Allah's Apostle (may peace be upon him) forbade the mixing of dates and grapes together, and mixing of unripe dates and ripe dates together (for preparing Nabidh), and he wrote to the people of Jurash (in Yemen) forbidding them to prepare the mixture of dates and grapes. This hadith has been narrated through another chain of transmitters with a slight variation of words.",
      "chain": [
        "30201",
        "20345",
        "11352",
        "11276",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "5294",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن الشيباني، عن حبيب، عن سعيد بن جبير، عن ابن عباس، قال نهى رسول الله صلى الله عليه وسلم عن الدباء والحنتم والمزفت والنقير ‏.‏",
      "text_en": " Ibn 'Abbas reported that there came to Allah's Messenger (may peace be upon him) a group of people from the tribe of 'Abd al-Qais. Allah's Messenger (may peace be upon him) said to them:                      I forbid you to prepare Nabidh in gourd, in pitcher besmeared with pitch, in hollow stump and in waterskin (meant for preserving wine). In the hadith transmitted on the authority of Hammad the word.\" gourd\" has been used in place of\" waterskin\".",
      "chain": [
        "30201",
        "20345",
        "11352",
        "11276",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "5507",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثناه قتيبة، ومحمد بن رمح، عن الليث بن سعد، ح وحدثنيه علي بن حجر، السعدي حدثنا إسماعيل، - يعني ابن علية - عن أيوب، ح وحدثنا ابن نمير، حدثنا محمد، بن بشر ح وحدثنا محمد بن المثنى، حدثنا يحيى بن سعيد، ح وحدثنا أبو بكر بن أبي، شيبة والوليد بن شجاع قالا حدثنا علي بن مسهر، عن عبيد الله، ح وحدثنا محمد بن، أبي بكر المقدمي حدثنا الفضيل بن سليمان، حدثنا موسى بن عقبة، ح .",
      "text_en": "",
      "chain": [
        "30367",
        "30490",
        "20023",
        "20208",
        "11015",
        "30212",
        "20352",
        "30170",
        "20031",
        "20345"
      ]
    },
    {
      "hadith_no": "5512",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، ح وحدثنا عثمان بن أبي، شيبة حدثنا جرير، كلاهما عن الشيباني، عن أشعث بن أبي الشعثاء، بهذا الإسناد ‏.‏ مثل حديث زهير وقال إبرار القسم من غير شك وزاد في الحديث وعن الشرب في الفضة فإنه من شرب فيها في الدنيا لم يشرب فيها في الآخرة ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ash'ath b. Abu ashSha'tha' with the same chain of transmitters (and with these words):                      There is no doubt about the words: To fulfil the vows were mentioned and this addition had been made in the. hadith: (The Holy Prophet) forbade drinking in silver vessels, for one who drinks (in them) in this world would not drink (in them) in the Hereafter.",
      "chain": [
        "30201",
        "20345",
        "30203",
        "11352"
      ]
    },
    {
      "hadith_no": "5568",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثني علي بن حجر السعدي، أخبرنا علي بن مسهر، عن هشام بن عروة،عن أبيه، عن عائشة، قالت إنما كان فراش رسول الله صلى الله عليه وسلم الذي ينامعليه أدما حشوه ليف ‏.‏",
      "text_en": " A'isha reported that the bedding on which. Allah's Messenger (may peace be upon him) slept was made of leather stuffed with palm fibre.",
      "chain": [
        "20387",
        "20345",
        "53"
      ]
    },
    {
      "hadith_no": "5577",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن الشيباني، ح وحدثنا ابن المثنى، حدثنا محمد بن جعفر، حدثنا شعبة، كلاهما عن محارب بن دثار، وجبلة بن،سحيم عن ابن عمر، عن النبي صلى الله عليه وسلم بمثل حديثهم ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn 'Umar through another chain of transmitters.",
      "chain": [
        "30201",
        "20345",
        "11352",
        "20173",
        "11389",
        "18"
      ]
    },
    {
      "hadith_no": "5619",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثنيه علي بن حجر السعدي، أخبرنا علي بن مسهر، أخبرنا الأعمش، عن أبي رزين، وأبي، صالح عن أبي هريرة، عن النبي صلى الله عليه وسلم بهذا المعنى ‏.‏",
      "text_en": "",
      "chain": [
        "20345",
        "11060",
        "10826",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "5657",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، ح وحدثنا ابن المثنى، حدثنا يحيى، - وهو القطان - جميعا عن عبيد الله، ح وحدثنا ابن نمير، - واللفظ له - حدثنا أبي، حدثنا عبيد الله، عن نافع، أن ابن عمر، أخبره أن رسول الله صلى الله عليه وسلمقال ‏\"‏ الذين يصنعون الصور يعذبون يوم القيامة يقال لهم أحيوا ما خلقتم ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported Allah's Messenger (may peace be upon him) having said:                      Those who paint pictures would be punished on the Day of Resurrection and it would be said to them: Breathe soul into what you. have created.",
      "chain": [
        "30201",
        "20345",
        "11201",
        "11905",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "5663",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن سعيد بن أبي عروبة، عن النضر بن أنس بن مالك، قال كنت جالسا عند ابن عباس فجعل يفتي ولا يقول قال رسول الله صلى الله عليه وسلم حتى سأله رجل فقال إني رجل أصور هذه الصور ‏.‏ فقال له ابن عباس ادنه ‏.‏ فدنا الرجل فقال ابن عباس سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من صور صورة في الدنيا كلف أن ينفخ فيها الروح يوم القيامة وليس بنافخ ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik said:                      I was sitting with Ibn 'Abbas when he gave religious verdicts but he did not say that it was Allah's Messenger (may peace be upon him) who had said that. However when a man said to him (Ibn 'Abbas): I am the painter of these pictures. Ibn 'Abbas said: I heard Allah's Messenger (may peace be upon him) as saying: He who painted pictures in the world would be compelled to breathe soul in them on the Day of Resurrection, but he would not be able to breathe soul (in them).",
      "chain": [
        "30201",
        "20345",
        "11073",
        "11310"
      ]
    },
    {
      "hadith_no": "5672",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن ابن جريج، عن أبي الزبير، عن جابر، قال نهى رسول الله صلى الله عليه وسلم عن الضرب في الوجه وعن الوسم في الوجه ‏.‏",
      "text_en": " Jabir reported that Allah's Messenger (may peace be upon him) forbade (the animals to be beaten) on the face or cauterisation on the face.",
      "chain": [
        "30201",
        "20345",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "5742",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا خالد بن مخلد، عن علي بن مسهر، عن هشام، بن عروة عن أبيه، عن أسماء بنت أبي بكر، أنها هاجرت إلى رسول الله صلى الله عليه وسلم وهي حبلى بعبد الله بن الزبير ‏.‏ فذكر نحو حديث أبي أسامة ‏.‏",
      "text_en": " Asma', daughter of Abu Bakr, reported that when she migrated to Allah's Messenger (may peace be upon him) in Medina she was in the family way with Abdullah b. Zubair in her womb.",
      "chain": [
        "30201",
        "30463",
        "20345",
        "11065",
        "10511",
        "70"
      ]
    },
    {
      "hadith_no": "5798",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنيه سويد بن سعيد، حدثنا علي بن مسهر، عن هشام، بهذا الإسناد ‏.‏",
      "text_en": "",
      "chain": [
        "20345"
      ]
    },
    {
      "hadith_no": "5846",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن الشيباني، عن عبد الرحمن، بن الأسود عن أبيه، قال سألت عائشة عن الرقية، فقالت رخص رسول الله صلى الله عليه وسلم لأهل بيت من الأنصار في الرقية من كل ذي حمة ‏.‏",
      "text_en": " 'Abd al-Rahman b. al-Aswad reported on the authority of his father:                      I asked 'A'isha about incantation. She said: Allah's Messenger (may peace be upon him) had granted its sanction to the members of a family of the Ansir for incantation in curing every type of poison.",
      "chain": [
        "30201",
        "20345",
        "11352",
        "11056",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "6049",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vision - كتاب الرؤيا",
      "chapter_no": "43",
      "text_ar": "وحدثنا إسماعيل بن الخليل، أخبرنا علي بن مسهر، عن الأعمش، ح وحدثنا  ابن نمير، حدثنا أبي، حدثنا الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ رؤيا المسلم يراها أو ترى له ‏\"‏ ‏.‏ وفي حديث ابن مسهر ‏\"‏ الرؤيا الصالحة جزء من ستة وأربعين جزءا من النبوة ‏\"‏ ‏.‏",
      "text_en": " Allah's Messenger (may peace; be upon him) said:                      The vision of a Muslim which he sees or which is shown to him, and in the hadith transmitted on the authority of Ibn Alushir (the words are):\" The pious dream is the forty-sixth part of Prophecy.\"",
      "chain": [
        "30186",
        "20345",
        "11060",
        "30212",
        "20331",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "6137",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وعلي بن حجر، قالا حدثنا علي بن مسهر، ح وحدثنا أبو كريب، حدثنا ابن فضيل، جميعا عن المختار بن فلفل، عن أنس، عن النبي صلى الله عليه وسلم بهذا المعنى وزاد ‏\"‏ آنيته عدد النجوم ‏\"‏ ‏.‏",
      "text_en": " Anas reported a hadith like this from Allah's Apostle (may peace be upon him) and he made this addition:                     \" The vessels would be as numerous as the number of stars.",
      "chain": [
        "30201",
        "20387",
        "20345",
        "30216",
        "10962",
        "19"
      ]
    },
    {
      "hadith_no": "6287",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، وابن، فضيل عن المختار، ح وحدثني علي بن حجر السعدي، - واللفظ له - حدثنا علي بن مسهر، أخبرنا المختار، بن فلفل عن أنس بن مالك، قال جاء رجل إلى رسول الله صلى الله عليه وسلم فقال يا خير البرية ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ذاك إبراهيم عليه السلام ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported that a person came to Allah's Messenger (may peace be upon him) and said:                      O, the best of creation; thereupon Allah's Messenger (may peace be upon him) said: He is Ibrahim (peace be upon him).",
      "chain": [
        "30201",
        "20345",
        "20356",
        "20387",
        "20345",
        "10962",
        "19"
      ]
    },
    {
      "hadith_no": "6398",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا إسماعيل بن الخليل، وسويد بن سعيد، كلاهما عن ابن مسهر، قال إسماعيل أخبرنا علي بن مسهر، عن هشام بن عروة، عن أبيه، عن عبد الله بن الزبير، قال كنت أنا وعمر بن أبي سلمة، يوم الخندق مع النسوة في أطم حسان فكان يطأطئ لي مرة فأنظر وأطأطئ له مرة فينظر فكنت أعرف أبي إذا مر على فرسه في السلاح إلى بني قريظة ‏.‏ قال وأخبرني عبد الله بن عروة عن عبد الله بن الزبير قال فذكرت ذلك لأبي فقال ورأيتني يا بنى قلت نعم ‏.‏ قال أما والله لقد جمع لي رسول الله صلى الله عليه وسلم يومئذ أبويه فقال ‏\"‏ فداك أبي وأمي ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Zubair reported on the Day of the Battle of the Trench:                      I and Umar b. Abu Salama were with women folk in the fort of Hassan (b. Thabit). He at one time leaned for me and I cast a glance and at anothertime I leaned for him and he would see and I recognised my father as he rode on his horse with his arms towards the tribe of Quraizah. 'Abdullah b. 'Urwa reported from Abdullah b. Zubair: I made a mention of that to my father, whereupon he said: My son, did you see me (on that occasion)? He said: Yes. Thereupon he said: By Allah, Allah's Messenger (may peace be upon him) addressed me saying: I would sacrifice for thee my father and my mother.",
      "chain": [
        "30186",
        "30547",
        "20208",
        "20345",
        "11065",
        "10511",
        "106"
      ]
    },
    {
      "hadith_no": "6435",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن هشام، عن أبيه، عن عائشة، قالت استأذنت هالة بنت خويلد أخت خديجة على رسول الله صلى الله عليه وسلم فعرف استئذان خديجة فارتاح لذلك فقال ‏\"‏ اللهم هالة بنت خويلد ‏\"‏ ‏.‏ فغرت فقلت وما تذكر من عجوز من عجائز قريش حمراء الشدقين هلكت في الدهر فأبدلك الله خيرا منها ‏.‏",
      "text_en": " A'isha reported that Hala b. Khuwailid (sister of Khadija) sought permission from Allah's Messenger (may peace be upon him) to see him and he was reminded of Khadija's (manner of) asking leave to enter and (was overwhelmed) with emotions thereby and said:                      O Allah, it is Hala, daughter of Khuwailid, and I felt jealous and said: Why do you remember one of those old women of the Quraish with gums red and who is long dead-while Allah has given you a better one in her stead?",
      "chain": [
        "30547",
        "20345",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6479",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا منجاب بن الحارث التميمي، وسهل بن عثمان، وعبد الله بن عامر بن، زرارة الحضرمي وسويد بن سعيد والوليد بن شجاع قال سهل ومنجاب أخبرنا وقال، الآخرون حدثنا علي بن مسهر، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال لما نزلت هذه الآية ‏{‏ ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا إذا ما اتقوا وآمنوا‏}‏ إلى آخر الآية قال لي رسول الله صلى الله عليه وسلم ‏\"‏ قيل لي أنت منهم ‏\"‏ ‏.‏",
      "text_en": " Abdullah reported that when this verse was revealed:                     \" There is no harm on persons who believe and perform good acts, what they had eaten (formerly) when they avoided it (now) and they affirmed their faith\" (v. 93) up to the end. Allah's Messenger (may peace be upon him) said to me: You are one amongst them.",
      "chain": [
        "30479",
        "30546",
        "20345",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "6858",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، وحفص بن غياث، عن بريد، بن عبد الله عن أبي بردة، عن أبي موسى، قال كان رسول الله صلى الله عليه وسلم إذا أتاه طالب حاجة أقبل على جلسائه فقال ‏\"‏ اشفعوا فلتؤجروا وليقض الله على لسان نبيه ما أحب ‏\"‏ ‏.‏",
      "text_en": " Abu Musa reported that when any needy (person) came to Allah's Messenger (may peace be upon him) with a need he commanded him to his Companions, saying:                      Make a recommendation for him, and you would get the reward. Allah, however, gives the verdict through the tongue of His Apostle what He likes most.",
      "chain": [
        "30201",
        "20345",
        "20317",
        "11325",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "7000",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن زكرياء، عن الشعبي، عن شريح بن هانئ، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ من أحب لقاء الله أحب الله لقاءه ومن كره لقاء الله كره الله لقاءه والموت قبل لقاء الله ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported Allah's Messenger (may peace be upon him) as saying:                      He who loves to meet Allah, Allah also loves to meet him, and who dislikes to meet Allah, Allah abhors to meet him. There is death before (one is able to) meet Allah.",
      "chain": [
        "30201",
        "20345",
        "11338",
        "11052",
        "10774",
        "53"
      ]
    },
    {
      "hadith_no": "7023",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، وابن، نمير عن موسى الجهني، ح وحدثنا محمد بن عبد الله بن نمير، - واللفظ له - حدثنا أبي، حدثنا موسى الجهني، عن مصعب بن سعد، عن أبيه، قال جاء أعرابي إلى رسول الله صلى الله عليه وسلم فقال علمني كلاما أقوله قال ‏\"‏ قل لا إله إلا الله وحده لا شريك له الله أكبر كبيرا والحمد لله كثيرا سبحان الله رب العالمين لا حول ولا قوة إلا بالله العزيز الحكيم ‏\"‏ ‏.‏ قال فهؤلاء لربي فما لي قال ‏\"‏ قل اللهم اغفر لي وارحمني واهدني وارزقني ‏\"‏ ‏.‏ قال موسى أما عافني فأنا أتوهم وما أدري ‏.‏ ولم يذكر ابن أبي شيبة في حديثه قول موسى ‏.‏",
      "text_en": " Mu'sab b. Sa'd reported on the authority of his father that a desert Arab came to Allah's Messenger (may peace be upon him) and said to him:                      Teach me the words which I should (often) utter. He said: Utter,\" There is no god but Allah, the One, having no partner with Him. Allah is the Greatest of the great and all praise is due to Him. Hallowed be Allah, the Lord of the worlds, there is no Might and Power but that of Allah, the All-Powerful and the Wise.\" He (that desert Arab) said: These all (glorify) my Lord. But what about me? Thereupon he (the Holy Prophet) said: You should say:\" O Allah, grant me pardon, have mercy upon me, direct me to righteousness and provide me sustenance.\" Musa (one of the narrators) said: I think he also said:\" Grant me safety.\" But I cannot say for certain whether he said this or not. Ibn Abi Shaiba has not made a mention of the words of Musa in his narration.",
      "chain": [
        "30201",
        "20345",
        "30212",
        "28270",
        "28270",
        "10556",
        "9"
      ]
    },
    {
      "hadith_no": "7027",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا مروان، وعلي بن مسهر، عن موسى الجهني، ح وحدثنا محمد بن عبد الله بن نمير، - واللفظ له - حدثنا أبي، حدثنا موسى الجهني، عن مصعب بن سعد، حدثني أبي قال، كنا عند رسول الله صلى الله عليه وسلم فقال ‏\"‏ أيعجز أحدكم أن يكسب كل يوم ألف حسنة ‏\"‏ ‏.‏ فسأله سائل من جلسائه كيف يكسب أحدنا ألف حسنة قال ‏\"‏ يسبح مائة تسبيحة فيكتب له ألف حسنة أو يحط عنه ألف خطيئة ‏\"‏ ‏.‏",
      "text_en": " Mus'ab b. Sa'd reported that his father told him that he had been in the company of Allah's Messenger (may peace be upon him) that he said:                      Is one amongst you powerless to get one thousand virtues every day. Amongst those who had been sitting there, one asked: How one amongst us can get one thousand virtues every day? He said: Recite:\" Hallowed be Allah\" one hundred times for (by reciting them) one thousand virtues are recorded (to your credit) and one tbousand vices are blotted out.",
      "chain": [
        "30201",
        "20201",
        "20345",
        "28270",
        "28270",
        "10556",
        "9"
      ]
    },
    {
      "hadith_no": "7126",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Heart-Melting Traditions - كتاب الرقاق",
      "chapter_no": "50",
      "text_ar": "وحدثنا إسحاق بن منصور، وعبد بن حميد، قالا أخبرنا أبو عاصم، عن ابن، جريج أخبرني موسى بن عقبة، ح وحدثني سويد بن سعيد، حدثنا علي بن مسهر، عن  عبيد الله، ح وحدثني أبو كريب، ومحمد بن طريف البجلي، قالا حدثنا ابن فضيل، حدثنا  أبي ورقبة بن مسقلة، ح وحدثني زهير بن حرب، وحسن الحلواني، وعبد بن حميد، قالوا حدثنا يعقوب، - يعنون ابن إبراهيم بن سعد - حدثنا أبي، عن صالح بن كيسان، كلهم عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمعنى حديث أبي ضمرة عن موسى بن عقبة وزادوا في حديثهم ‏\"‏ وخرجوا يمشون ‏\"‏ ‏.‏ وفي حديث صالح ‏\"‏ يتماشون ‏\"‏ ‏.‏ إلا عبيد الله فإن في حديثه ‏\"‏ وخرجوا ‏\"‏ ‏.‏ ولم يذكر بعدها شيئا ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Musa b. 'Uqba but with a slight variation of wording.",
      "chain": [
        "30313",
        "30553",
        "20241",
        "11070",
        "11106",
        "30547",
        "20345",
        "11201",
        "30216",
        "30476",
        "20356",
        "30022"
      ]
    },
    {
      "hadith_no": "7234",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن داود، عن الشعبي، عن  مسروق، عن عائشة، قالت سألت رسول الله صلى الله عليه وسلم عن قوله عز وجل ‏{‏ يوم تبدل الأرض غير الأرض والسموات‏}‏ فأين يكون الناس يومئذ يا رسول الله فقال ‏\"‏ على الصراط ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported:                      I asked Allah's Messenger (may peace be upon him) about the words of Allah, the Exalted and Glorious:\" The day when the earth would be changed for another earth and Heaven would be changed for another Heaven (XiV. 48), (and inquired: ) (Allah's Messenger), where would the people be on tnat day? He said: They would be on the Sirit.",
      "chain": [
        "30201",
        "20345",
        "11052",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "7340",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، وعبد الله بن نمير، وعلي بن مسهر، عن عبيد الله بن عمر، ح وحدثنا محمد بن عبد الله بن نمير، حدثنا محمد بن بشر، حدثنا  عبيد الله، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ سيحان وجيحان والفرات والنيل كل من أنهار الجنة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Saihan, Jaihan, Euphrates and Nile are all among the rivers of Paradise.",
      "chain": [
        "30201",
        "20318",
        "20331",
        "20345",
        "11201",
        "30212",
        "20352",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "hadith_no": "7744",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Commentary - كتاب التفسير",
      "chapter_no": "57",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن أبي حيان، عن الشعبي، عن ابن عمر، قال خطب عمر على منبر رسول الله صلى الله عليه وسلم فحمد الله وأثنى عليه ثم قال أما بعد ألا وإن الخمر نزل تحريمها يوم نزل وهى من خمسة أشياء من الحنطة والشعير والتمر والزبيب والعسل ‏.‏ والخمر ما خامر العقل وثلاثة أشياء وددت أيها الناس أن رسول الله صلى الله عليه وسلم كان عهد إلينا فيها الجد والكلالة وأبواب من أبواب الربا ‏.‏",
      "text_en": " Ibn 'Umar reported that Umar delivered a sermon on the pulpit of Allah's Messenger (may peace be upon him) and he praised Allah and lauded Him and then said:                      Now coming to the point. Behold I when the command pertaining to the prohibition of wine was revealed, it was prepared from five things: from wheat, barley, date, grape, honey; and wine is that which clouds the intellect; and O people, I wish Allah's Messenger (may peace be upon him) could have explained to us in (more) detail the laws pertaining to the inheritance of the grandfather, about one who dies leaving no issue, and some of the problems pertaining to interest.",
      "chain": [
        "30201",
        "20345",
        "11404",
        "11052",
        "18"
      ]
    },
    {
      "hadith_no": "309",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا إبراهيم بن خالد، حدثنا معلى بن منصور، عن علي بن مسهر، عن الشيباني، عن عكرمة، قال كانت أم حبيبة تستحاض فكان زوجها يغشاها ‏.‏ قال أبو داود وقال يحيى بن معين معلى ثقة ‏.‏ وكان أحمد بن حنبل لا يروي عنه لأنه كان ينظر في الرأى ‏.‏",
      "text_en": " 'Ikrimah said:                      Umm Habibah had a prolonged flow of blood ; her husband used to cohabit with her.Abu Dawud said: Yahya b. Ma'in has pronounced Mu'alla (a narrator of this tradition) as trustworthy. But Ahmad b. Hanbal would not report (traditions) from him because he exercised personal opinion.",
      "chain": [
        "38072",
        "30278",
        "20345",
        "11352",
        "11023",
        "72"
      ]
    },
    {
      "hadith_no": "526",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إبراهيم بن مهدي، حدثنا علي بن مسهر، عن هشام بن عروة، عن أبيه، عن عائشة، أن رسول الله صلى الله عليه وسلم كان إذا سمع المؤذن يتشهد قال ‏\"‏ وأنا وأنا ‏\"‏ ‏.‏",
      "text_en": " ‘A’ishah said that when the Messenger of Allah (ﷺ) heard the MU’ADHDHIN uttering the testimony, he would say:                      “And I too, and  I too”.",
      "chain": [
        "20345",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1966",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا إبراهيم بن مهدي، حدثني علي بن مسهر، عن يزيد بن أبي زياد، أخبرنا سليمان بن عمرو بن الأحوص، عن أمه، قالت رأيت رسول الله صلى الله عليه وسلم يرمي الجمرة من بطن الوادي وهو راكب يكبر مع كل حصاة ورجل من خلفه يستره فسألت عن الرجل فقالوا الفضل بن العباس وازدحم الناس فقال النبي صلى الله عليه وسلم ‏\"‏ يا أيها الناس لا يقتل بعضكم بعضا وإذا رميتم الجمرة فارموا بمثل حصى الخذف ‏\"‏ ‏.‏",
      "text_en": " Narrated Sulaiman b. 'Amr b. al-Ahwas:                     On the authority of his mother: I saw the Messenger of Allah (ﷺ) throwing pebbles at the jamrah from the botton of wadi (valley) while he was riding (on a camel). He was uttering the takbir (Allah is most great) with each pebble. A man behind him was shading him. I asked about the man. They (the people) said: He is al-Fadl b. al-'Abbas. The people crowded. The Prophet (ﷺ) said: 'O people, do not kill each other ; when you throw pebbled at the jamrah, throw small pebbles.",
      "chain": [
        "20345",
        "10844",
        "19868"
      ]
    },
    {
      "hadith_no": "2890",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا عبد الله بن عامر بن زرارة، حدثنا علي بن مسهر، عن الأعمش، عن أبي قيس الأودي، عن هزيل بن شرحبيل الأودي، قال جاء رجل إلى أبي موسى الأشعري وسلمان بن ربيعة فسألهما عن ابنة وابنة ابن وأخت، لأب وأم فقالا لابنته النصف وللأخت من الأب والأم النصف ولم يورثا ابنة الابن شيئا وأت ابن مسعود فإنه سيتابعنا فأتاه الرجل فسأله وأخبره بقولهما فقال لقد ضللت إذا وما أنا من المهتدين ولكني سأقضي فيها بقضاء النبي صلى الله عليه وسلم لابنته النصف ولابنة الابن سهم تكملة الثلثين وما بقي فللأخت من الأب والأم ‏.‏",
      "text_en": " Narrated Huzail b. Shurahbil al-Awadi:                     A man came to Abu Musa al-Ash'ari and Salman b. Rabi'ah, and asked about a case where there were a daughter, a son's daughter and full sister. They replied: The daughter gets half and the full gets half. The son's daughter gets nothing. Go to Ibn Mas'ud and you will find that he agrees with me. So the man came to him and informed him about their opinion. He said: I would then be in error and not be one of those who are rightly guided. But I decide concerning the matter as the Messenger of Allah (ﷺ) did: The daughter gets half, and the son's daughter gets a share which complete thirds (i.e. gets a sixth), and what remain to the full sister.\"",
      "chain": [
        "30467",
        "20345",
        "11060",
        "11660"
      ]
    },
    {
      "hadith_no": "3662",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Knowledge (Kitab Al-Ilm) - كتاب العلم",
      "chapter_no": "26",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ حدثوا عن بني إسرائيل ولا حرج ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: relate traditions from the children of Isra'il; there is no harm.",
      "chain": [
        "30201",
        "20345",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3887",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا إبراهيم بن مهدي المصيصي، حدثنا علي بن مسهر، عن عبد العزيز بن عمر بن عبد العزيز، عن صالح بن كيسان، عن أبي بكر بن سليمان بن أبي حثمة، عن الشفاء بنت عبد الله، قالت دخل على رسول الله صلى الله عليه وسلم وأنا عند حفصة فقال لي ‏\"‏ ألا تعلمين هذه رقية النملة كما علمتيها الكتابة ‏\"‏ ‏.‏",
      "text_en": " Narrated Ash-Shifa', daughter of Abdullah,:                     The Messenger of Allah (ﷺ) entered when I was with Hafsah, and he said to me: Why do you not teach this one the spell for skin eruptions as you taught her writing.",
      "chain": [
        "20345",
        "20166",
        "11176",
        "11547"
      ]
    },
    {
      "hadith_no": "5220",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن أجلح، عن الشعبي، أن النبي صلى الله عليه وسلم تلقى جعفر بن أبي طالب فالتزمه وقبل ما بين عينيه ‏.‏",
      "text_en": " Narrated Ash-Sha'bi:                     The Prophet (ﷺ) received Ja'far ibn AbuTalib, embraced him and kissed him between both of his eyes (forehead).",
      "chain": [
        "30201",
        "20345",
        "11052"
      ]
    },
    {
      "hadith_no": "101",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا هناد، حدثنا علي بن مسهر، عن الأعمش، عن الحكم، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، عن بلال، أن النبي صلى الله عليه وسلم مسح على الخفين والخمار ‏.‏",
      "text_en": " BilaI narrated:                     \"The Prophet wiped over the Khuff and the Khimar.\"",
      "chain": [
        "30480",
        "20345",
        "11060",
        "11069",
        "11196",
        "4052",
        "24"
      ]
    },
    {
      "hadith_no": "667",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Zakat - كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "7",
      "text_ar": "حدثنا علي بن حجر، حدثنا علي بن مسهر، عن عبد الله بن عطاء، عن عبد الله بن بريدة، عن أبيه، قال كنت جالسا عند النبي صلى الله عليه وسلم إذ أتته امرأة فقالت يا رسول الله إني كنت تصدقت على أمي بجارية وإنها ماتت ‏.‏ قال ‏\"‏ وجب أجرك وردها عليك الميراث ‏\"‏ ‏.‏ قالت يا رسول الله إنها كان عليها صوم شهر أفأصوم عنها قال ‏\"‏ صومي عنها ‏\"‏ ‏.‏ قالت يا رسول الله إنها لم تحج قط أفأحج عنها قال ‏\"‏ نعم حجي عنها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ولا يعرف هذا من حديث بريدة إلا من هذا الوجه ‏.‏ وعبد الله بن عطاء ثقة عند أهل الحديث ‏.‏ والعمل على هذا عند أكثر أهل العلم أن الرجل إذا تصدق بصدقة ثم ورثها حلت له ‏.‏ وقال بعضهم إنما الصدقة شيء جعلها لله فإذا ورثها فيجب أن يصرفها في مثله ‏.‏ وروى سفيان الثوري وزهير بن معاوية هذا الحديث عن عبد الله بن عطاء ‏.‏",
      "text_en": " Abdullah bin Buraidah narrated from his father:                     \"I was sitting with the Prophet when a woman came to him and said: 'O Messenger of Allah! I gave a slave girl to my mother in charity and she died.' He said: 'Your reward is already established, and your right to inherit her has returned it (that Sadaqah) to you.' She said: 'O Messenger of Allah! There was a month of fasting due on her, shall I perform the fast for her?' He said: 'Fast on her behalf.' She said: 'O Messenger of Allah! She never performed Hajj, shall I perform Hajj for her?' He said: 'Yes, perform Hajj on her behalf.'\"",
      "chain": [
        "20387",
        "20345",
        "10785",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "741",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا علي بن حجر، قال أخبرنا علي بن مسهر، عن عبد الرحمن بن إسحاق، عن النعمان بن سعد، عن علي، قال سأله رجل فقال أى شهر تأمرني أن أصوم بعد شهر رمضان قال له ما سمعت أحدا يسأل عن هذا إلا رجلا سمعته يسأل رسول الله صلى الله عليه وسلم وأنا قاعد فقال يا رسول الله أى شهر تأمرني أن أصوم بعد شهر رمضان قال ‏\"‏ إن كنت صائما بعد شهر رمضان فصم المحرم فإنه شهر الله فيه يوم تاب الله فيه على قوم ويتوب فيه على قوم آخرين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " An-Nu'man bin Sa'd narrated:                     \"A man asked Ali: \"Which month do you order me to fast after the month of Ramadan?' He said to him, 'I have not heard anyone ask this except for a man whom I heard asking the Messenger of Allah while I was sitting with him. He said: \"O Messenger of Allah! Which month do you order me to fast after the month of Ramadan?\" He said: \"If you will fast after the month of Ramadan, then fast Al-Muharram, for indeed it is Allah's month in which there is a day that Allah accepted the repentance of a people, and in which He accepts the repentance of other people.\"",
      "chain": [
        "20387",
        "20345",
        "11876",
        "5"
      ]
    },
    {
      "hadith_no": "787",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا علي بن حجر، أخبرنا علي بن مسهر، عن عبيدة، عن إبراهيم، عن الأسود، عن عائشة، قالت كنا نحيض على عهد رسول الله صلى الله عليه وسلم ثم نطهر فيأمرنا بقضاء الصيام ولا يأمرنا بقضاء الصلاة ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد روي عن معاذة عن عائشة أيضا ‏.‏ والعمل على هذا عند أهل العلم لا نعلم بينهم اختلافا أن الحائض تقضي الصيام ولا تقضي الصلاة ‏.‏ قال أبو عيسى وعبيدة هو ابن معتب الضبي الكوفي يكنى أبا عبد الكريم ‏.‏",
      "text_en": " Aishah narrated:                     \"We would menstruate during the time of the Messenger of Allah, then when we became pure we were ordered to make up the fasts but we were not ordered to make up the Salat.\"",
      "chain": [
        "20387",
        "20345",
        "11370",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "929",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن عبد الأعلى، حدثنا عبد الرزاق، عن سفيان الثوري، عن عبد الله بن عطاء، ‏.‏ قال وحدثنا علي بن حجر، حدثنا علي بن مسهر، عن عبد الله بن عطاء، عن عبد الله بن بريدة، عن أبيه، قال جاءت امرأة إلى النبي صلى الله عليه وسلم فقالت إن أمي ماتت ولم تحج أفأحج عنها قال ‏\"‏ نعم حجي عنها ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث حسن صحيح ‏.‏",
      "text_en": " Abdullah bin Buraidah narrated from his father who said:                     \"A woman came to the Prophet and said: 'My mother died and she did not perform Hajj should I perform Hajj on her behalf?' He said: 'Yes, perform Hajj on her behalf.'\"",
      "chain": [
        "30449",
        "20121",
        "20012",
        "20387",
        "20345",
        "10785",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "1017",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا علي بن حجر، أخبرنا علي بن مسهر، عن مسلم الأعور، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم يعود المريض ويشهد الجنازة ويركب الحمار ويجيب دعوة العبد وكان يوم بني قريظة على حمار مخطوم بحبل من ليف عليه إكاف ليف ‏.‏ قال أبو عيسى هذا حديث لا نعرفه إلا من حديث مسلم عن أنس ‏.‏ ومسلم الأعور يضعف وهو مسلم بن كيسان الملائي تكلم فيه وقد روى عنه شعبة وسفيان ‏.‏",
      "text_en": " Anas bin Malik narrated:                     \"The Messenger of Allah would visit the sick, attend the funerals, ride a donkey, accept the invitation of a slave, and on the Day of Banu Quraizah he was on a donkey muzzled with a cord of fibers and a pack-saddle made of fibers.\"",
      "chain": [
        "20387",
        "20345",
        "19"
      ]
    },
    {
      "hadith_no": "1116",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا هناد، حدثنا علي بن مسهر، عن الفضل بن يزيد، عن الشعبي، عن أبي بردة بن أبي موسى، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاثة يؤتون أجرهم مرتين عبد أدى حق الله وحق مواليه فذلك يؤتى أجره مرتين ورجل كانت عنده جارية وضيئة فأدبها فأحسن أدبها ثم أعتقها ثم تزوجها يبتغي بذلك وجه الله فذلك يؤتى أجره مرتين ورجل آمن بالكتاب الأول ثم جاء الكتاب الآخر فآمن به فذلك يؤتى أجره مرتين ‏\"‏ ‏.‏ حدثنا ابن أبي عمر، حدثنا سفيان، عن صالح بن صالح، وهو ابن حى عن الشعبي، عن أبي بردة، عن أبي موسى، عن النبي صلى الله عليه وسلم نحوه ‏.‏ قال أبو عيسى حديث أبي موسى حديث حسن صحيح ‏.‏ وأبو بردة بن أبي موسى اسمه عامر بن عبد الله بن قيس ‏.‏ وروى شعبة وسفيان الثوري هذا الحديث عن صالح بن صالح بن حى ‏.‏ وصالح بن صالح بن حى هو والد الحسن بن صالح بن حى ‏.‏",
      "text_en": " Abu Burdah bin Abi Musa narrated from his father that the Messenger of Allah said:                     \"Three will receive their reward twice: A slave who fulfills the rights of Allah and the rights of his owners, then he will be given his reward twice. And a man who has a beautiful slave girl, so he teaches her good manners, then he frees her, then he married her seeking the Face of Allah by that; then he will be given his reward twice. And a man who believed in an earlier Book, then another Book came to him and he believed in it; then he will be given his reward twice.\"",
      "chain": [
        "30480",
        "20345",
        "11052",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "1341",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا علي بن حجر، أنبأنا علي بن مسهر، وغيره، عن محمد بن عبيد الله، عن عمرو بن شعيب، عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال في خطبته ‏\"‏ البينة على المدعي واليمين على المدعى عليه ‏\"‏ ‏.‏ هذا حديث في إسناده مقال ‏.‏ ومحمد بن عبيد الله العرزمي يضعف في الحديث من قبل حفظه ضعفه ابن المبارك وغيره ‏.‏",
      "text_en": " 'Amr bin Shu'aib narrated from his father, from his grandfather, that during a Khutbah, the Prophet (ﷺ) said:                      \"The proof is due from the claimant, and the oath is due from the one the claim is made against.\"",
      "chain": [
        "20387",
        "20345",
        "30213",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1522",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا علي بن حجر، أخبرنا علي بن مسهر، عن إسماعيل بن مسلم، عن الحسن، عن سمرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الغلام مرتهن بعقيقته يذبح عنه يوم السابع ويسمى ويحلق رأسه ‏\"‏ ‏.‏",
      "text_en": " Narrated Samurah:                     That the Messenger of Allah (ﷺ) said: \"The boy is mortgaged by his 'Aqiqah; slaughtering should be done for him on the seventh day, he should be given a name, and his head should be shaved.\"",
      "chain": [
        "20387",
        "20345",
        "22025",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "1760",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا علي بن حجر، أخبرنا علي بن مسهر، حدثنا أبو إسحاق الشيباني، عن أشعث بن أبي الشعثاء، عن معاوية بن سويد بن مقرن، عن البراء بن عازب، قال نهانا رسول الله صلى الله عليه وسلم عن ركوب المياثر ‏.‏ قال وفي الحديث قصة ‏.‏ قال وفي الباب عن علي ومعاوية ‏.‏ وحديث البراء حديث حسن صحيح ‏.‏ وقد روى شعبة عن أشعث بن أبي الشعثاء نحوه وفي الحديث قصة ‏.‏",
      "text_en": " Narrated Al-Bara' bin 'Azib:                     \"The Messenger of Allah (ﷺ) prohibited riding (while sitting on) Miyathir.\"[Abu 'Eisa said:] There are narrations on this topic from 'Ali and Mu'awiyah. The Hadith if Al-Bara' is Hasan Sahih. Shu'bah reported similarly from Ash'ath bin Abi Ash-Sha'tha' in the lengthy Hadith.",
      "chain": [
        "20387",
        "20345",
        "11352",
        "11324",
        "3117",
        "400"
      ]
    },
    {
      "hadith_no": "1761",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا علي بن حجر، أخبرنا علي بن مسهر، عن هشام بن عروة، عن أبيه، عن عائشة، قالت إنما كان فراش النبي صلى الله عليه وسلم الذي ينام عليه أدم حشوه ليف ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ قال وفي الباب عن حفصة وجابر ‏.‏",
      "text_en": " Narrated 'Aishah:                     \"The only bed that the Messenger of Allah had which he slept was [made of a tanned skin] stuffed with palm-fibres.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.He Said: There are narrations on thus topic from Hafsah and Jabir.",
      "chain": [
        "20387",
        "20345",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2112",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا علي بن حجر، حدثنا علي بن مسهر، عن عبد الرحمن بن إسحاق، عن النعمان بن سعد، عن علي، قال قال النبي صلى الله عليه وسلم ‏\"‏ إن في الجنة غرفا ترى ظهورها من بطونها وبطونها من ظهورها ‏\"‏ ‏.‏ فقام أعرابي فقال لمن هي يا رسول الله قال ‏\"‏ لمن أطاب الكلام وأطعم الطعام وأدام الصيام وصلى لله بالليل والناس نيام ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث عبد الرحمن بن إسحاق ‏.‏ وقد تكلم بعض أهل الحديث في عبد الرحمن بن إسحاق هذا من قبل حفظه وهو كوفي وعبد الرحمن بن إسحاق القرشي مدني وهو أثبت من هذا وكلاهما كانا في عصر واحد ‏.‏",
      "text_en": " 'Ali narrated that the Messenger of Allah said:                     \"Indeed in Paradise there are chambers, whose outside can be seen from their inside, and their inside can be seen from their outside.\" A Bedouin stood and said : 'Who are they for, O Messenger of Allah?\" He said: \"For those who speak well, feed others, fast regularly, and perform salat [for Allah] during the night while the people sleep.\"",
      "chain": [
        "20387",
        "20345",
        "11876",
        "5"
      ]
    },
    {
      "hadith_no": "2619",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا علي بن حجر، أخبرنا علي بن مسهر، عن عبد الرحمن بن إسحاق، عن النعمان بن سعد، عن المغيرة بن شعبة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ شعار المؤمن على الصراط رب سلم سلم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من حديث المغيرة بن شعبة لا نعرفه إلا من حديث عبد الرحمن بن إسحاق ‏.‏ وفي الباب عن أبي هريرة ‏.‏",
      "text_en": " Al-Mughirah bin Shu'bah narrated that The Messenger of Allah (s.a.w) said:                     \"The sign of the  believers upon the Sirat is: O lord, protect (us), protect (us).'\"",
      "chain": [
        "20387",
        "20345",
        "11876",
        "166"
      ]
    },
    {
      "hadith_no": "2718",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of Paradise - كتاب صفة الجنة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "38",
      "text_ar": "حدثنا علي بن حجر، حدثنا علي بن مسهر، عن عبد الرحمن بن إسحاق، عن النعمان بن سعد، عن علي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن في الجنة لغرفا يرى ظهورها من بطونها وبطونها من ظهورها ‏\"‏ ‏.‏ فقام إليه أعرابي فقال لمن هي يا رسول الله قال ‏\"‏ هي لمن أطاب الكلام وأطعم الطعام وأدام الصيام وصلى لله بالليل والناس نيام ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وقد تكلم بعض أهل العلم في عبد الرحمن بن إسحاق هذا من قبل حفظه وهو كوفي وعبد الرحمن بن إسحاق القرشي مدني وهو أثبت من هذا ‏.‏",
      "text_en": " 'Ali narrated that the Messenger of Allah (s.a.w) said:                     \"Indeed in Paradise there are chambers whose outside can be seen from their inside, and their inside can be seen fom their outside.\" A Bedouin stood and said: \"Who are they for O Prophet of Allah?\" he said: \"For those who speak well, feed others, fast regularly, and perform Salat for Allah during the night while the people sleep.\"",
      "chain": [
        "20387",
        "20345",
        "11876",
        "5"
      ]
    },
    {
      "hadith_no": "2781",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Description of Hellfire - كتاب صفة جهنم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "39",
      "text_ar": "حدثنا هناد، حدثنا علي بن مسهر، عن الفضل بن يزيد، عن أبي المخارق، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الكافر ليسحب لسانه الفرسخ والفرسخين يتوطؤه الناس ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب إنما نعرفه من هذا الوجه ‏.‏ والفضل بن يزيد هو كوفي قد روى عنه غير واحد من الأئمة وأبو المخارق ليس بمعروف ‏.‏",
      "text_en": " Ibn 'Umar narrated that the Messenger of Allah (s.a.w) said:                     'Indeed the disbeliever's tongue will be stretched a Farsakh or two Farsakh, such that the people will walk upon it.\"",
      "chain": [
        "30480",
        "20345",
        "18"
      ]
    },
    {
      "hadith_no": "3330",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا خالد بن مخلد، عن علي بن مسهر، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال لما نزلت ‏:‏ ‏(‏ ليس على الذين آمنوا وعملوا الصالحات جناح فيما طعموا إذا ما اتقوا وآمنوا وعملوا الصالحات ‏)‏ قال لي رسول الله صلى الله عليه وسلم ‏\"‏ أنت منهم ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Abdullah:                     \"When (the following) was revealed: Those who believe and do righteous good deeds, there is no sin on them for what they ate, if they have Taqwa and perform good (5:93). The Messenger of Allah (ﷺ) said to me: 'You are among them.'\"",
      "chain": [
        "35047",
        "30463",
        "20345",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "3596",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا علي بن حجر، أخبرنا علي بن مسهر، عن الأعمش، عن إبراهيم، عن أبي معمر، عن ابن مسعود، رضي الله عنه قال بينما نحن مع رسول الله صلى الله عليه وسلم بمنى فانشق القمر فلقتين فلقة من وراء الجبل وفلقة دونه فقال لنا رسول الله صلى الله عليه وسلم ‏\"‏ اشهدوا ‏\"‏ ‏.‏ يعني ‏:‏ ‏(‏اقتربت الساعة وانشق القمر ‏)‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Ibn Mas'ud, may Allah be pleased with him:                     \"We were with the Messenger of Allah (ﷺ) in Mina, when the moon was cleft asunder into two parts. Part of it was behind the mountain, and part of it before it. The Messenger of Allah (ﷺ) said to us: 'Bear witness' meaning: The house has drawn near, and the moon has been cleft asunder (54:1).\"",
      "chain": [
        "20387",
        "20345",
        "11060",
        "11051",
        "11360"
      ]
    },
    {
      "hadith_no": "3676",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا علي بن حجر، حدثنا علي بن مسهر، عن المختار بن فلفل، عن أنس، نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "20387",
        "20345",
        "10962",
        "19"
      ]
    },
    {
      "hadith_no": "4185",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا الجراح بن مخلد البصري، وغير، واحد، قالوا حدثنا محمد بن عمر بن الرومي، حدثنا علي بن مسهر، عن إسماعيل بن أبي خالد، عن أبي عمرو الشيباني، قال أخبرني جبلة بن حارثة، أخو زيد قال قدمت على رسول الله صلى الله عليه وسلم فقلت يا رسول الله ابعث معي أخي زيدا ‏.‏ قال ‏\"‏ هو ذا ‏\"‏ ‏.‏ قال ‏\"‏ فإن انطلق معك لم أمنعه ‏\"‏ ‏.‏ قال زيد يا رسول الله والله لا أختار عليك أحدا ‏.‏ قال فرأيت رأى أخي أفضل من رأيي ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من حديث ابن الرومي عن علي بن مسهر ‏.‏",
      "text_en": " Narrated Jabalah bin Harithah, the brother of Zaid:                     \"I came to the Messenger of Allah (ﷺ) and said: 'O Messenger of Allah, send my brother Zaid with me.' He said: 'Here he is.' He said: \"'If he goes with you, I will not prevent him.' Zaid said: 'O Messenger of Allah, by Allah, I will not choose anyone over you.'\" He said: \"So I considered the view of my brother to be better than my own view.\"",
      "chain": [
        "34044",
        "20345",
        "11418",
        "11343",
        "2280"
      ]
    },
    {
      "hadith_no": "66",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا علي بن مسهر، عن الأعمش، عن أبي رزين، وأبي، صالح عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا ولغ الكلب في إناء أحدكم فليرقه ثم ليغسله سبع مرات ‏\"‏ ‏.‏ قال أبو عبد الرحمن لا أعلم أحدا تابع علي بن مسهر على قوله فليرقه ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah (ﷺ) said: 'If a dog licks the vessel of any one of you, let him throw (the contents) away and wash it seven times.'\"Abu 'Abdur-Rahman (An-Nasa'i) said: I do not know any one who followed 'Ali bin Mushir in narrating it with: \"Let him throw it away.\"",
      "chain": [
        "20387",
        "20345",
        "11060",
        "10826",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "335",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Water - كتاب المياه",
      "chapter_no": "2",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا علي بن مسهر، عن الأعمش، عن أبي رزين، وأبي، صالح عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا ولغ الكلب في إناء أحدكم فليرقه ثم ليغسله سبع مرات ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah (ﷺ) said: 'If a dog licks the vessel of any one of you, let him throw (the contents) away and wash it seven times.'\"",
      "chain": [
        "20387",
        "20345",
        "11060",
        "10826",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "423",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Ghusl and Tayammum - كتاب الغسل والتيمم",
      "chapter_no": "4",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا علي بن مسهر، عن هشام بن عروة، عن أبيه، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا اغتسل من الجنابة غسل يديه ثم توضأ وضوءه للصلاة ثم يخلل رأسه بأصابعه حتى إذا خيل إليه أنه قد استبرأ البشرة غرف على رأسه ثلاثا ثم غسل سائر جسده ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"When the Messenger of Allah (ﷺ0 performed Ghusl from Janabah, he would wash his hands, then perform Wudu' as for prayer, then run his fingers through his hair until he was sure the water had reached the scalp, then he would pour water over his head three times, then wash the rest of his body.\"",
      "chain": [
        "20387",
        "20345",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "584",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا علي بن مسهر، عن أبي إسحاق، عن عبد الرحمن بن الأسود، عن أبيه، عن عائشة، قالت صلاتان ما تركهما رسول الله صلى الله عليه وسلم في بيتي سرا ولا علانية ركعتان قبل الفجر وركعتان بعد العصر ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"There are two prayers that the Messenger of Allah (ﷺ) never neglected to pray them in my house secretly nor publicly: Two Rak'ahs before Fajr and two Rak'ahs after 'Asr.\"",
      "chain": [
        "20387",
        "20345",
        "11049",
        "11056",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "690",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا علي بن مسهر، عن الأعمش، عن إبراهيم، قال كنت أقرأ على أبي القرآن في السكة فإذا قرأت السجدة سجد فقلت يا أبت أتسجد في الطريق فقال إني سمعت أبا ذر يقول سألت رسول الله صلى الله عليه وسلم أى مسجد وضع أولا قال ‏\"‏ المسجد الحرام ‏\"‏ ‏.‏ قلت ثم أى قال ‏\"‏ المسجد الأقصى ‏\"‏ ‏.‏ قلت وكم بينهما قال ‏\"‏ أربعون عاما والأرض لك مسجد فحيثما أدركت الصلاة فصل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibrahim said:                      \"I used to recite Qur'an to my father on the road, and if I recited a verse in which prostration was required, he would prostrate. I said: 'O my father, do you prostrate on the street?' He said: 'I heard Abu Dharr say: \"I asked the Messenger of Allah (ﷺ): 'Which Masjid was built first?' He said: 'Al-Masjid Al-Haram.' [1] I said: 'Then which?' He said: 'Al-Masjid Al-Aqsa.' [2] I said: 'How long was there between them?' He said: 'Forty years. And the earth is a Masjid (or a place of prostration) for you, so wherever you are when the time for prayer comes, pray.'\"[1] In Makkah.[2] \"Furthest Masjid\", meaning the Masjid in Jerulsalem.",
      "chain": [
        "20387",
        "20345",
        "11060",
        "11051",
        "23"
      ]
    },
    {
      "hadith_no": "904",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا علي بن مسهر، عن المختار بن فلفل، عن أنس بن مالك، قال بينما ذات يوم بين أظهرنا - يريد النبي صلى الله عليه وسلم - إذ أغفى إغفاءة ثم رفع رأسه متبسما فقلنا له ما أضحكك يا رسول الله قال ‏\"‏ نزلت على آنفا سورة بسم الله الرحمن الرحيم ‏{‏ إنا أعطيناك الكوثر * فصل لربك وانحر * إن شانئك هو الأبتر ‏}‏ ‏\"‏ ‏.‏ ثم قال ‏\"‏ هل تدرون ما الكوثر ‏\"‏ ‏.‏ قلنا الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإنه نهر وعدنيه ربي في الجنة آنيته أكثر من عدد الكواكب ترده على أمتي فيختلج العبد منهم فأقول يا رب إنه من أمتي ‏.‏ فيقول لي إنك لا تدري ما أحدث بعدك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas in Malik said:                     \"One day when he-the Prophet (ﷺ)- was still among us, he took a nap, then he raised his head, smiling. We said to him: 'Why are you smiling, O Messenger of Allah?' He said: 'Just now this Surah was revealed to me: In the Name of Allah, the Most Gracious, the Most Merciful. Verily, We have granted you (O Muahmmad) Al-Kawthar. Therefore turn in prayer to your Lord and sacrifice (to Him only). For he who hates you, he will be cut off.' Then he said: 'Do you know what Al-Kawthar is?' We said: 'Allah and His Messenger know best.' He said: 'It is a river that my Lord has promised me in Paradise. Its vessels are more than the number of the stars. My Ummah will come to me, then a man among them will be pulled away and I will say: \"O Lord, he is one of my Ummah\" and He will say to me: 'You do not know what he did after you were gone.\"",
      "chain": [
        "20387",
        "20345",
        "10962",
        "19"
      ]
    },
    {
      "hadith_no": "1363",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا علي بن مسهر، عن المختار بن فلفل، عن أنس بن مالك، قال صلى بنا رسول الله صلى الله عليه وسلم ذات يوم ثم أقبل علينا بوجهه فقال ‏\"‏ إني إمامكم فلا تبادروني بالركوع ولا بالسجود ولا بالقيام ولا بالانصراف فإني أراكم من أمامي ومن خلفي ‏\"‏ ‏.‏ ثم قال ‏\"‏ والذي نفسي بيده لو رأيتم ما رأيت لضحكتم قليلا ولبكيتم كثيرا ‏\"‏ ‏.‏ قلنا ما رأيت يا رسول الله قال ‏\"‏ رأيت الجنة والنار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The Messenger of Allah (ﷺ) led us in prayer one day, then he turned to face us and said: 'I am now your imam, so do not hasten to bow or prostrate or stand or leave before I do. I can see you in front of me and behind me.' Then he said: 'By the One in Whose Hand is my soul, if you had seen what I have seen, you would laugh little and weep much.' We said: 'What have you seen, O Messenger of Allah (ﷺ)?' He said: 'Paradise and Hell.'\"",
      "chain": [
        "20387",
        "20345",
        "10962",
        "19"
      ]
    },
    {
      "hadith_no": "2318",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا علي بن حجر، قال أنبأنا علي، - يعني ابن مسهر - عن سعيد، عن قتادة، عن معاذة العدوية، أن امرأة، سألت عائشة أتقضي الحائض الصلاة إذا طهرت قالت أحرورية أنت كنا نحيض على عهد رسول الله صلى الله عليه وسلم ثم نطهر فيأمرنا بقضاء الصوم ولا يأمرنا بقضاء الصلاة ‏.‏",
      "text_en": " It was narrated from Muadhah Al-Adawiyyah that a woman asked 'Aishah:                     \"Should a menstruating woman make up the prayers when she becomes pure?\" she said: \"Are youa Haruri? We used to menstruate at the time of the Messenger of Allah then we would become pure. He told us to make up the fast, but he did not tell us to make up the prayers.\"",
      "chain": [
        "20387",
        "20345",
        "11168",
        "11019",
        "11456"
      ]
    },
    {
      "hadith_no": "3358",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا علي بن مسهر، عن داود بن أبي هند، عن الشعبي، عن علقمة، عن عبد الله، أنه أتاه قوم فقالوا إن رجلا منا تزوج امرأة ولم يفرض لها صداقا ولم يجمعها إليه حتى مات ‏.‏ فقال عبد الله ما سئلت منذ فارقت رسول الله صلى الله عليه وسلم أشد على من هذه فأتوا غيري ‏.‏ فاختلفوا إليه فيها شهرا ثم قالوا له في آخر ذلك من نسأل إن لم نسألك وأنت من جلة أصحاب محمد صلى الله عليه وسلم بهذا البلد ولا نجد غيرك ‏.‏ قال سأقول فيها بجهد رأيي فإن كان صوابا فمن الله وحده لا شريك له وإن كان خطأ فمني ومن الشيطان والله ورسوله منه برآء أرى أن أجعل لها صداق نسائها لا وكس ولا شطط ولها الميراث وعليها العدة أربعة أشهر وعشرا ‏.‏ قال وذلك بسمع أناس من أشجع فقاموا فقالوا نشهد أنك قضيت بما قضى به رسول الله صلى الله عليه وسلم في امرأة منا يقال لها بروع بنت واشق ‏.‏ قال فما رئي عبد الله فرح فرحة يومئذ إلا بإسلامه ‏.‏",
      "text_en": " It was narrated from 'Abdullah that some people came to him and said:                      \"A man among us married a woman, but he did not name a dowry for her, and he did not have intercourse with her before he died.\" 'Abdullah said: 'Since I left the Messenger of Allah I have never been asked a more difficult question than this. Go to someone else.' They kept coming to him for a month, then at the end of that they said: 'Who shall we ask if we do not ask you? You are one of the most prominent Companions of Muhammad in this land and we cannot find anyone else.' He said: 'I will say what I think, and if it is correct then it is from Allah alone, with no partner, and if it is wrong then it is from me and from the Shaitan, and Allah and His Messenger have nothing to do with it. I think she should be given a dowry like that of her peers and no less, with no injustice, and she may inherit from him, and she has to observe the 'Iddah, four months and ten days.'\" He said: \"And that was heard by some people from Ashja', who stood up and said: 'We bear witness that you have passed the same judgment as the Messenger of Allah did concerning a woman from among us who was called Birwa' bint Washiq.'\" He said: \"Abdullah was never seen looking so happy as he did on that day, except with having accepted Islam.\"",
      "chain": [
        "20387",
        "20345",
        "11585",
        "11052",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "3489",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا علي بن حجر، قال حدثنا علي بن مسهر، عن الأجلح، عن الشعبي، قال أخبرني عبد الله بن أبي الخليل الحضرمي، عن زيد بن أرقم، قال بينا نحن عند رسول الله صلى الله عليه وسلم إذ جاءه رجل من اليمن فجعل يخبره ويحدثه وعلي بها فقال يا رسول الله أتى عليا ثلاثة نفر يختصمون في ولد وقعوا على امرأة في طهر ‏.‏ وساق الحديث ‏.‏",
      "text_en": " It was narrated that Zaid bin Arqam said:                      \"While we were with the Messenger of Allah, a man came to him from Yemen and started telling him (about an incident) while 'Ali was still in Yemen. He said: 'O Messenger of Allah, three men were brought to 'Ali who were disputing about a child, and they all had intercourse with a woman during a single menstrual cycle.'\" And he quoted the same Hadith.",
      "chain": [
        "20387",
        "20345",
        "11052",
        "384"
      ]
    },
    {
      "hadith_no": "38",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن مطرف، عن عطية، عن أبي سعيد، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من كذب على متعمدا فليتبوأ مقعده من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed said:                     \"The Messenger of Allah (ﷺ) said: 'Whoever tells lies about me deliberately, let him take his place in Hell.\"",
      "chain": [
        "30547",
        "20345",
        "11395",
        "38"
      ]
    },
    {
      "hadith_no": "54",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا عبد الله بن إدريس، وعبدة، وأبو معاوية وعبد الله بن نمير ومحمد بن بشر ح وحدثنا سويد بن سعيد، حدثنا علي بن مسهر، ومالك بن أنس، وحفص بن ميسرة، وشعيب بن إسحاق، عن هشام بن عروة، عن أبيه، عن عبد الله بن عمرو بن العاص، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إن الله لا يقبض العلم انتزاعا ينتزعه من الناس ولكن يقبض العلم بقبض العلماء فإذا لم يبق عالما اتخذ الناس رءوسا جهالا فسئلوا فأفتوا بغير علم فضلوا وأضلوا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Amr bin 'As that:                     the Messenger of Allah (ﷺ) said: 'Allah will not take away knowledge by removing it from people (from their hearts). Rather He will take away knowledge by taking away the scholars, then when there are no scholars left, the people will take the ignorant as their leaders. They will be asked questions and they will issue verdicts without knowledge, thus they will go astray and lead others astray.'\"",
      "chain": [
        "30216",
        "20102",
        "20337",
        "30547",
        "20345",
        "20001",
        "20421",
        "20239",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "62",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن الأعمش، ح وحدثنا علي بن ميمون الرقي، حدثنا سعيد بن مسلمة، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يدخل الجنة من كان في قلبه مثقال حبة من خردل من كبر ولا يدخل النار من كان في قلبه مثقال حبة من خردل من إيمان ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abdullah said:                     \"The Messenger of Allah (ﷺ) said: 'No one will enter Paradise who has even a mustard-seed's weight of arrogance in his heart, and no one will enter Hell who has even a mustard-seed's weight of faith in his heart.'\"",
      "chain": [
        "30547",
        "20345",
        "11060",
        "38412",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "289",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن أبي سفيان، طريف السعدي ح وحدثنا أبو كريب، محمد بن العلاء حدثنا أبو معاوية، عن أبي سفيان السعدي، عن أبي نضرة، عن أبي سعيد الخدري، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ مفتاح الصلاة الطهور وتحريمها التكبير وتحليلها التسليم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Al-Khudri that:                     The Messenger of Allah said: \"The key to prayer is purification, its opening is to say Allahu Akbar and its closing is to say As-salamu 'alaikum.\"",
      "chain": [
        "30547",
        "20345",
        "30216",
        "20354",
        "14190",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "531",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن يحيى بن سعيد، عن بشير بن يسار، أنبأنا سويد بن النعمان الأنصاري، أنهم خرجوا مع رسول الله  صلى الله عليه وسلم  إلى خيبر حتى إذا كانوا بالصهباء صلى العصر ثم دعا بأطعمة فلم يؤت إلا بسويق فأكلوا وشربوا ثم دعا بماء فمضمض فاه ثم قام فصلى بنا المغرب ‏.‏",
      "text_en": " Suwaid bin Nu'man Ansari narrated that :                     They went out with the Messenger of Allah to Khaibar. When they reached As-Sahba' (a place near Khaibar), he performed 'Asr (Afternoon prayer), then he called for food, but no food was brought except for Sawiq. So they ate that and drank, and then he called for water and rinsed his mouth, then he stood up and led us for Maghrib (Sunset) prayer.\"",
      "chain": [
        "30201",
        "20345",
        "11062",
        "11810"
      ]
    },
    {
      "hadith_no": "572",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال دخل أعرابي المسجد ورسول الله  صلى الله عليه وسلم  جالس فقال اللهم اغفر لي ولمحمد ولا تغفر لأحد معنا ‏.‏ فضحك رسول الله  صلى الله عليه وسلم  وقال ‏\"‏ لقد احتظرت واسعا ‏\"‏ ‏.‏ ثم ولى حتى إذا كان في ناحية المسجد فشج يبول ‏.‏ فقال الأعرابي بعد أن فقه فقام إلى بأبي وأمي ‏.‏ فلم يؤنب ولم يسب ‏.‏ فقال ‏\"‏ إن هذا المسجد لا يبال فيه وإنما بني لذكر الله وللصلاة ‏\"‏ ‏.‏ ثم أمر بسجل من ماء فأفرغ على بوله ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"A Bedouin entered the mosque when the Messenger of Allah was sitting there, and (the man) said: 'O Allah, forgive me and Muhammed, and do not forgive anyone else with us.' The Messenger of Allah smiled and said: 'You have placed restrictions on something that is vast.' Then the Bedouin turned away, went to a corner of the mosque, spread his legs and began to urinate. After he had a better understanding, the Bedouin said: 'He got up and came to me, and may my father and mother be ransomed for him, he did not rebuke me nor revile me. He said: \"This mosque is not for urinating in. Rather it is built for the remembrance of Allah and prayer.'\" Then he called for a large vessel of water and poured it over the place where he had urinated.\"",
      "chain": [
        "30201",
        "20345",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "674",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن سعيد بن أبي عروبة، عن قتادة، عن معاذة العدوية، عن عائشة، أن امرأة، سألتها أتقضي الحائض الصلاة قالت لها عائشة أحرورية أنت قد كنا نحيض عند النبي  صلى الله عليه وسلم  ثم نطهر ولم يأمرنا بقضاء الصلاة ‏.‏",
      "text_en": " It was narrated from 'Aishah that:                     A woman asked her: \"Does a woman who menstruates have to make up for the prayers she misses?\" 'Aisha said to her: \"Are you a Haruriyyah? We used to menstruate with the Prophet and then become pure, and he did not tell us to make up for the prayers we missed.\"",
      "chain": [
        "30201",
        "20345",
        "11073",
        "11019",
        "11456",
        "53"
      ]
    },
    {
      "hadith_no": "678",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن الجراح، حدثنا أبو الأحوص، عن عبد الكريم، ح وحدثنا أبو سلمة، يحيى بن خلف حدثنا عبد الأعلى، عن محمد بن إسحاق، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن الشيباني، جميعا عن عبد الرحمن بن الأسود، عن أبيه، عن عائشة، قالت كانت إحدانا إذا كانت حائضا أمرها النبي  صلى الله عليه وسلم  أن تأتزر في فور حيضتها ثم يباشرها وأيكم يملك إربه كما كان رسول الله  صلى الله عليه وسلم  يملك إربه",
      "text_en": " It was narrated that 'Aishah said:                     \"If one of us was menstruating, the Messenger of Allah would tell her to tie her waist-wrapper around herself if the bleeding was heavy, then he would embrace her. And who among you can control his desire as the Messenger of Allah used to control his desire?\"",
      "chain": [
        "20327",
        "18655",
        "20246",
        "11107",
        "30201",
        "20345",
        "11352",
        "11056",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "888",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو كريب، حدثنا محمد بن الفضيل، ح وحدثنا سويد بن سعيد، حدثنا علي بن مسهر، جميعا عن أبي سفيان السعدي، عن أبي نضرة، عن أبي سعيد، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا صلاة لمن لم يقرأ في كل ركعة ب ‏{الحمد لله‏}‏ وسورة في فريضة أو غيرها ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Sa’eed said:                      “The Messenger of Allah (ﷺ)said: ‘There is no prayer for the one who does not recite in everyRak’ah: Al-Hamd (Al-Fatihah) and a Surah whether in an obligatoryprayer or another.’”",
      "chain": [
        "30216",
        "30547",
        "20345",
        "14190",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "1260",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن عامر بن زرارة، حدثنا علي بن مسهر، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال صلى رسول الله  صلى الله عليه وسلم  فزاد أو نقص - قال إبراهيم والوهم مني - فقيل له يا رسول الله أزيد في الصلاة شىء قال ‏\"‏ إنما أنا بشر أنسى كما تنسون فإذا نسي أحدكم فليسجد سجدتين وهو جالس ‏\"‏ ‏.‏ ثم تحول النبي  صلى الله عليه وسلم  فسجد سجدتين ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah said:                      “The Messenger of Allah (ﷺ)prayed, and he added or omitted something.” (One of the narrators)Ibrahim said: “The confusion stems from me (i.e., he was not surewhich it was).” “It was said to him: ‘O Messenger of Allah! Hassomething been added to the prayer?’ He said: ‘I am only human, Iforget just as you forget. If anyone forgets, let him perform twoprostrations when he is sitting (at the end).’ Then the Prophet(ﷺ)turned and prostrated twice.”",
      "chain": [
        "30467",
        "20345",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1365",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن عبيد الله، عن نافع، عن ابن عمر، قال كان النبي  صلى الله عليه وسلم  إذا صلى يوم عيد أو غيره نصبت الحربة بين يديه فيصلي إليها والناس من خلفه ‏.‏ قال نافع فمن ثم اتخذها الأمراء ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “When the Prophet (ﷺ) prayedonthe day of ‘Eid or on another occasion, a small spear was set up infront of him, and he prayed facing it, and the people were behindhim.”",
      "chain": [
        "30547",
        "20345",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1483",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الله بن عامر بن زرارة، وسويد بن سعيد، قالا حدثنا علي بن مسهر، عن الأعمش، عن أبي وائل، عن عبد الله، قال صليت ذات ليلة مع رسول الله  صلى الله عليه وسلم  فلم يزل قائما حتى هممت بأمر سوء ‏.‏ قلت وما ذاك الأمر قال هممت أن أجلس وأتركه ‏.‏",
      "text_en": " It wasnarrated from Abu Wa’il that ‘Abdullah said:                      “I prayed onenight with the Messenger of Allah (ﷺ) and he kept standing until Ithought of doing something bad.” I said: “What was that?”Hesaid: “Ithought of sitting down and leaving him.”",
      "chain": [
        "30467",
        "30547",
        "20345",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "1559",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال مر على النبي  صلى الله عليه وسلم  بجنازة - فأثني عليها خيرا في مناقب الخير فقال ‏\"‏ وجبت ‏\"‏ ‏.‏ ثم مروا عليه بأخرى فأثني عليها شرا في مناقب الشر فقال ‏\"‏ وجبت إنكم شهداء الله في الأرض ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “A funeral passed by theProphet(ﷺ) and they praised (the deceased) and spoke well of himandmentioned his good characteristics. He said: ‘(Paradise is)guaranteed for him.’ Then another funeral passed by and they spokebadly of him and mentioned his bad characteristics, and he (theProphet (ﷺ)) said: ‘(Hell is) guaranteed for him. You are thewitnesses of Allah on earth.’”",
      "chain": [
        "30201",
        "20345",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1565",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن محمد بن إسحاق، عن محمد بن إبراهيم، عن أبي سلمة، عن أبي هريرة، قال كان رسول الله  صلى الله عليه وسلم  إذا صلى على جنازة يقول ‏\"‏ اللهم اغفر لحينا وميتنا وشاهدنا وغائبنا وصغيرنا وكبيرنا وذكرنا وأنثانا اللهم من أحييته منا فأحيه على الإسلام ومن توفيته منا فتوفه على الإيمان اللهم لا تحرمنا أجره ولا تضلنا بعده ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “When the Messenger of Allah(ﷺ)offered the funeral prayer he would say: ‘Allahummaghfirlihayyinawa mayyitina, wa shahidina wa gha’ibina, wa saghirina wakabirina,wa dhakarina wa unthana. Allahumma man ahyaitahu minnafaahyihi‘alal-Islam, wa man tawaffaytahu minna fa tawaffahu ‘alal-iman.Allahumma la tahrimna ajrahu wa la tudillana ba’dah. [O Allah,forgive our living and our dead, those who are present and those whoare absent, our young and our old, our males and our females. OAllah,whomever of us You cause to live, let him live in Islam, andwhomeverof us You cause to die, let him die in (a state of) faith. OAllah, donot deprive us of his reward, and do not let us go astrayafterhim].’”",
      "chain": [
        "30547",
        "20345",
        "11107",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1754",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن عبيد الله، عن القاسم، عن عائشة، قالت كان رسول الله  صلى الله عليه وسلم  يقبل وهو صائم وأيكم يملك إربه كما كان رسول الله  صلى الله عليه وسلم  يملك إربه",
      "text_en": " It wasnarrated that ‘Aishah said:                      “The Messenger of Allah (ﷺ) usedtokiss when he was fasting, and who among you can control his desireasthe Messenger of Allah (ﷺ) used to control his desire?”",
      "chain": [
        "30201",
        "20345",
        "11201",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "1918",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا عبد الله بن عامر بن زرارة، حدثنا علي بن مسهر، عن الأعمش، عن إبراهيم، عن علقمة بن قيس، قال كنت مع عبد الله بن مسعود بمنى فخلا به عثمان فجلست قريبا منه فقال له عثمان هل لك أن أزوجك جارية بكرا تذكرك من نفسك بعض ما قد مضى فلما رأى عبد الله أنه ليس له حاجة سوى هذا أشار إلى بيده فجئت وهو يقول لئن قلت ذلك لقد قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يا معشر الشباب من استطاع منكم الباءة فليتزوج فإنه أغض للبصر وأحصن للفرج ومن لم يستطع فعليه بالصوم فإنه له وجاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that:                     Alqamah bin Qais said: “I was with Abdullah bin Masud in Mina, and Uthman took him aside. I was sitting near him. Uthman said to him: 'Would you like that I marry you to a young virgin who will remind you of how you were in the past?' When Abdullah saw that he did not say anything to him apart from that, he gestured to me, so I came and he said: 'As you say that the Messenger of Allah said “O young men, whoever among you can afford it, let him get married, for it is more effective in lowering the gaze and guarding one's chastity. Whoever cannot afford it, let him fast, for it will diminish his desire.” ' ”",
      "chain": [
        "30467",
        "20345",
        "11060",
        "11051",
        "11017"
      ]
    },
    {
      "hadith_no": "1950",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، حدثنا هشام بن عروة، عن أبيه، عن عائشة، قالت تزوجني رسول الله  صلى الله عليه وسلم  وأنا بنت ست سنين فقدمنا المدينة فنزلنا في بني الحارث بن الخزرج فوعكت فتمرق شعري حتى وفى له جميمة فأتتني أمي أم رومان وإني لفي أرجوحة ومعي صواحبات لي فصرخت بي فأتيتها وما أدري ما تريد فأخذت بيدي فأوقفتني على باب الدار وإني لأنهج حتى سكن بعض نفسي ثم أخذت شيئا من ماء فمسحت به على وجهي ورأسي ثم أدخلتني الدار فإذا نسوة من الأنصار في بيت فقلن على الخير والبركة وعلى خير طائر ‏.‏ فأسلمتني إليهن فأصلحن من شأني فلم يرعني إلا رسول الله  صلى الله عليه وسلم  ضحى ‏.‏ فأسلمتني إليه وأنا يومئذ بنت تسع سنين ‏.‏",
      "text_en": " It was narrated that:                     Aishah said: “The Messenger of Allah married me when I was six years old. Then we came to Al-Madinah and settled among Banu Harith bin Khazraj. I became ill and my hair fell out, then it grew back and became abundant. My mother Umm Ruman came to me while I was on an Urjuhah with some of my friends, and called for me. I went to her, and I did not know what she wanted. She took me by the hand and made me stand at the door of the house, and I was panting. When I got my breath back, she took some water and wiped my face and head, and led me into the house. There were some woman of the Ansar inside the house, and they said: 'With blessings and good fortune (from Allah).' (My mother) handed me over to them and they tidied me up. And suddenly I saw the Messenger of Allah in the morning. And she handed me over to him and I was at that time, nine years old.”",
      "chain": [
        "30547",
        "20345",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2106",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن داود بن أبي هند، عن الشعبي، عن مسروق، وعمرو بن عتبة، أنهما كتبا إلى سبيعة بنت الحارث يسألانها عن أمرها، فكتبت إليهما إنها وضعت بعد وفاة زوجها بخمسة وعشرين فتهيأت تطلب الخير فمر بها أبو السنابل بن بعكك فقال قد أسرعت اعتدي آخر الأجلين أربعة أشهر وعشرا ‏.‏ فأتيت النبي  صلى الله عليه وسلم  فقلت يا رسول الله استغفر لي ‏.‏ قال ‏\"‏ ومم ذاك ‏\"‏ ‏.‏ فأخبرته ‏.‏ فقال ‏\"‏ إن وجدت زوجا صالحا فتزوجي ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Masruq and 'Amr bin 'Utbah wrote to Subai'ah bint Harith, asking about her case.:                     She wrote to them saying that she gave birth twenty-five days after her husband died. Then she prepared herself, seeking to remarry. Abu Sanabil bin Ba'kak passed by her and said: \"You are in a hurry; observe waiting period for the longer period, four months and ten days.\" \"So I went to the Prophet (ﷺ) and said: 'O Messenger of Allah, (ﷺ) pray for forgiveness for me.' He said: 'Why is that.” I told him (what had happened). He said: 'If you find a righteous husband then marry him.\"'",
      "chain": [
        "30201",
        "20345",
        "11585",
        "11052",
        "11018"
      ]
    },
    {
      "hadith_no": "2118",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، وعبدة بن سليمان، ح وحدثنا حميد بن مسعدة، حدثنا خالد بن الحارث، جميعا عن سعيد بن أبي عروبة، عن قتادة، عن زرارة بن أوفى، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن الله تجاوز لأمتي عما حدثت به أنفسها ما لم تعمل به أو تكلم به ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     the Messenger of  Allah (ﷺ) said: \"Allah has forgiven my nation for what they think of to themselves, so long as they do not act upon it or speak of it.\"",
      "chain": [
        "30201",
        "20345",
        "20337",
        "30430",
        "20226",
        "11073",
        "11019",
        "11284",
        "13"
      ]
    },
    {
      "hadith_no": "2623",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Manumission (of Slaves) - كتاب العتق",
      "chapter_no": "19",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، ومحمد بن بشر، عن سعيد بن أبي عروبة، عن قتادة، عن النضر بن أنس، عن بشير بن نهيك، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أعتق نصيبا له في مملوك أو شقصا فعليه خلاصه من ماله إن كان له مال فإن لم يكن له مال استسعي العبد في قيمته غير مشقوق عليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     “Whoever frees his share of a slave or part of his share, must pay from his wealth if he has any wealth if he has any wealth (in order to buy the rest of the slave's freedom). If he does not have wealth, then the slave should be asked to work for the price (of his freedom), without that causing him too much hardship.”",
      "chain": [
        "30201",
        "20345",
        "20352",
        "11073",
        "11019",
        "11310",
        "11266",
        "13"
      ]
    },
    {
      "hadith_no": "2682",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن عبيد الله، عن نافع، عن ابن عمر، قال قطع النبي صلى الله عليه وسلم في مجن قيمته ثلاثة دراهم ‏.‏",
      "text_en": " It was narrated that Ibn Umar said:                     “The Prophet (S.A.W.) cut off (the hand of a thief) for a shield worth three Dirham.”",
      "chain": [
        "30201",
        "20345",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2697",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، ح وحدثنا الحسن بن عرفة، حدثنا أبو حفص الأبار، جميعا عن إسماعيل بن مسلم، عن عمرو بن دينار، عن طاوس، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تقام الحدود في المساجد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Abbas that the Messenger of Allah (ﷺ) said:                     “Do not carry out the legal punishment in the mosque.”",
      "chain": [
        "30547",
        "20345",
        "36540",
        "25208",
        "22025",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "2763",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن إسماعيل بن مسلم، عن عمرو بن دينار، عن طاوس، عن ابن عباس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يقتل بالولد الوالد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that the Messenger of Allah (ﷺ) said:                     “A father should not be killed for his son.”",
      "chain": [
        "30547",
        "20345",
        "22025",
        "11081",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "3143",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن يزيد بن أبي زياد، عن سليمان بن عمرو بن الأحوص، عن أمه، قالت رأيت النبي  صلى الله عليه وسلم  يوم النحر عند جمرة العقبة وهو راكب على بغلة فقال ‏\"‏ يا أيها الناس إذا رميتم الجمرة فارموا بمثل حصى الخذف ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Sulaiman bin ‘Amr bin Ahwas that his mothersaid:                      “Isaw the Prophet (saw0 on the Day of Sacrifice, at ‘AqabahPillar,riding a mule. He said: ‘O people! When you stone the Pillar,throwsmall pebbles.’”",
      "chain": [
        "30201",
        "20345",
        "10844",
        "19868"
      ]
    },
    {
      "hadith_no": "3146",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن يزيد بن أبي زياد، عن سليمان بن عمرو بن الأحوص، عن أمه، قالت رأيت النبي  صلى الله عليه وسلم  يوم النحر عند جمرة العقبة استبطن الوادي فرمى الجمرة بسبع حصيات يكبر مع كل حصاة ثم انصرف ‏.‏",
      "text_en": " It wasnarrated from Sulaiman bin ‘Amr bin Ahwas that his mothersaid:                      “Isaw the Prophet (ﷺ) on the Day of Sacrifice, at ‘AqabahPillar.He went to the interior of the valley and threw seven pebbles,sayingTakbir with each pebble, then he departed.”",
      "chain": [
        "30201",
        "20345",
        "10844",
        "19868"
      ]
    },
    {
      "hadith_no": "3149",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن الحجاج، عن الحكم بن عتيبة، عن مقسم، عن ابن عباس، قال كان رسول الله  صلى الله عليه وسلم  إذا رمى جمرة العقبة مضى ولم يقف ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “When the Messenger of Allah(ﷺ)had stoned ‘Aqabah Pillar, he would continue on, and would notstaythere.”",
      "chain": [
        "30547",
        "20345",
        "20381",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "3229",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، وابن الفضيل، عن يزيد بن أبي زياد، أنبأنا عبد الرحمن بن سابط، عن عياش بن أبي ربيعة المخزومي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا تزال هذه الأمة بخير ما عظموا هذه الحرمة حق تعظيمها فإذا ضيعوا ذلك هلكوا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Ayyash bin Abu Rabi’ah (Makhzumi) that theMessenger of Allah (ﷺ) said:                      ‘The goodness of this nation willnotcease as long as they revere this sanctuary* as it is due. Butwhenthey lose that reverence, they will be doomed.”",
      "chain": [
        "30201",
        "20345",
        "10844",
        "10646"
      ]
    },
    {
      "hadith_no": "3313",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن أبي إسحاق الشيباني، قال سألت عبد الله بن أبي أوفى عن لحوم الحمر الأهلية، فقال أصابتنا مجاعة يوم خيبر ونحن مع النبي  صلى الله عليه وسلم  وقد أصاب القوم حمرا خارجا من المدينة فنحرناها وإن قدورنا لتغلي إذ نادى منادي النبي  صلى الله عليه وسلم  أن اكفئوا القدور ولا تطعموا من لحوم الحمر شيئا ‏.‏ فأكفأناها ‏.‏ فقلت لعبد الله بن أبي أوفى حرمها تحريما قال تحدثنا أنما حرمها رسول الله  صلى الله عليه وسلم  ألبتة من أجل أنها تأكل العذرة ‏.‏",
      "text_en": " It wasnarrated that Abu Ishaq Shaibani said:                      “I asked ‘Abdullah binAbuAwfa about the flesh of domesticated donkeys and he said: ‘We werestarving on the Day of Khaibar, when we were with the Prophet (ﷺ).The people had gotten some donkeys as spoils of war on the way outfrom Al-Madinah, so we slaughtered them and our cooking pots wereboiling when the caller of the Messenger of Allah (ﷺ) cried out,telling us to overturn out pots and not to eat anything of the fleshof donkeys. So we overturned them.’ I said to ‘Abdullah bin AbuAwfa:‘Was it made unlawful?’ He said: ‘We think that theMessenger of Allah(ﷺ) forbade it altogether because it eatsexcrement.’”",
      "chain": [
        "30547",
        "20345",
        "11352",
        "5115"
      ]
    },
    {
      "hadith_no": "3315",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن عاصم، عن الشعبي، عن البراء بن عازب، قال أمرنا رسول الله  صلى الله عليه وسلم  أن نلقي لحوم الحمر الأهلية نيئة ونضيجة ثم لم يأمرنا به بعد ‏.‏",
      "text_en": " It wasnarrated that Bara’ bin ‘Azib said:                      “The Messenger of Allah(ﷺ) commanded us to throw away the meat of domesticated donkeys,rawor cooked, then he did not say anything to us about it afterthat.”",
      "chain": [
        "30547",
        "20345",
        "11080",
        "11052",
        "400"
      ]
    },
    {
      "hadith_no": "3548",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن عاصم، عن الشعبي، عن ابن عباس، قال سقيت النبي  صلى الله عليه وسلم  من زمزم فشرب قائما ‏.‏ فذكرت ذلك لعكرمة فحلف بالله ما فعل ‏.‏",
      "text_en": " ‘Asimnarrated from Sha’bi, from Ibn ‘Abbas who said:                      “I drew waterfrom Zamzam for the Prophet (ﷺ) and he drank standing up.”",
      "chain": [
        "30547",
        "20345",
        "11080",
        "11052",
        "17"
      ]
    },
    {
      "hadith_no": "3611",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن سعد الإسكاف، عن الأصبغ بن نباتة، عن علي، قال نزل جبريل على النبي  صلى الله عليه وسلم  بحجامة الأخدعين والكاهل ‏.‏",
      "text_en": " It wasnarrated that ‘Ali said:                      “Jibra’il came down to the Prophet(ﷺ) with (the recommendation of) cupping in the two veins at theside of the neck and the base of the neck.”",
      "chain": [
        "30547",
        "20345",
        "15020",
        "5"
      ]
    },
    {
      "hadith_no": "3670",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يورد الممرض على المصح ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “Aman with sick camels should not let them graze or drinkalongsidehealthy ones.”",
      "chain": [
        "30201",
        "20345",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3720",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن الشيباني، عن أشعث بن أبي الشعثاء، عن معاوية بن سويد، عن البراء، قال نهى رسول الله  صلى الله عليه وسلم  عن الديباج والحرير والإستبرق ‏.‏",
      "text_en": " It wasnarrated that Bara’ bin ‘Azib said:                      “The Messenger of Allah(ﷺ) forbade brocade, silk, and embroidered brocade.”",
      "chain": [
        "30201",
        "20345",
        "11352",
        "11324",
        "400"
      ]
    },
    {
      "hadith_no": "3732",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن يزيد بن أبي زياد، عن الحسن بن سهيل، عن ابن عمر، قال نهى رسول الله  صلى الله عليه وسلم  عن المفدم ‏.‏ قال يزيد قلت للحسن ما المفدم قال المشبع بالعصفر ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “The Messenger of Allah (ﷺ)forbade Al-Mufaddam.”",
      "chain": [
        "30201",
        "20345",
        "10844",
        "18"
      ]
    },
    {
      "hadith_no": "3744",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا جرير، عن منصور، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن الشيباني، ح وحدثنا أبو بكر، حدثنا غندر، عن شعبة، كلهم عن الحكم، عن عبد الرحمن بن أبي ليلى، عن عبد الله بن عكيم، قال أتانا كتاب النبي  صلى الله عليه وسلم  ‏\"‏ أن لا تنتفعوا من الميتة بإهاب ولا عصب ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin ‘Ukaym said:                      “There came to us aletter from the Prophet (ﷺ) (saying): ‘No not make use of theuntanned skin and sinew of dead animals.’”",
      "chain": [
        "20436",
        "20028",
        "11067",
        "30201",
        "20345",
        "11352",
        "20436",
        "20278",
        "20020",
        "11069",
        "11196",
        "10786"
      ]
    },
    {
      "hadith_no": "3774",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا علي بن مسهر، عن يزيد بن أبي زياد، عن الحسن بن سهيل، عن ابن عمر، قال نهى رسول الله  صلى الله عليه وسلم  عن خاتم الذهب ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “The Messenger of Allah (ﷺ)forbade gold rings.”",
      "chain": [
        "20436",
        "20345",
        "10844",
        "18"
      ]
    },
    {
      "hadith_no": "3782",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن محمد بن عمرو، عن أبي سلمة، عن عائشة، قالت واعد رسول الله  صلى الله عليه وسلم  جبريل عليه السلام في ساعة يأتيه فيها فراث عليه فخرج النبي  صلى الله عليه وسلم  فإذا هو بجبريل قائم على الباب فقال ‏\"‏ ما منعك أن تدخل ‏\"‏ ‏.‏ قال إن في البيت كلبا وإنا لا ندخل بيتا فيه كلب ولا صورة ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “Jibril (as) promised theMessengerof Allah (ﷺ) that he would come to him at a certain hour,but hewas late. The Prophet (ﷺ) went out and there was Jibrilstanding atthe door. He said: ‘What kept you from entering?’ He said:‘Thereis a dog in the house, and we do not enter a house in whichthere isa dog or an image.’”",
      "chain": [
        "30201",
        "20345",
        "11220",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "3715",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن ابن أبي ليلى، عن عيسى، عن عبد الرحمن بن أبي ليلى، عن علي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا عطس أحدكم فليقل الحمد لله ‏.‏ وليرد عليه من حوله يرحمك الله ‏.‏ وليرد عليهم يهديكم الله ويصلح بالكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ali that the Messenger of Allah(ﷺ) said:                     \"If anyone of you sneezes, let him say: Alhamdulillah (praise be to Allah). Those around him should respond by saying: Yarhamkullah (may Allah have mercy on you). And he should respond by saying: \"Yahdikum Allah wa yuslaha balakum (may Allah Guide you and set right your state).\"",
      "chain": [
        "30201",
        "20345",
        "11196",
        "20347",
        "11196",
        "5"
      ]
    },
    {
      "hadith_no": "4062",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن الأعمش، عن أبي سفيان، عن جابر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أمرت أن أقاتل الناس حتى يقولوا لا إله إلا الله فإذا قالوا لا إله إلا الله عصموا مني دماءهم وأموالهم إلا بحقها وحسابهم على الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir that the Messenger of Allah (ﷺ) said:                      “Ihave been commanded to fight the people until they say: La ilahaillallah. If they say: La ilaha illallah, then their blood and wealthare protected from me, except for a right that is due from it, andtheir reckoning will be with Allah.”",
      "chain": [
        "30547",
        "20345",
        "11060",
        "11249",
        "34"
      ]
    },
    {
      "hadith_no": "4064",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن عاصم، عن السميط بن السمير، عن عمران بن الحصين، قال أتى نافع بن الأزرق وأصحابه فقالوا هلكت يا عمران ‏.‏ قال ما هلكت ‏.‏ قالوا بلى ‏.‏ قال ما الذي أهلكني قالوا قال الله ‏{وقاتلوهم حتى لا تكون فتنة ويكون الدين كله لله}‏ ‏.‏ قال قد قاتلناهم حتى نفيناهم فكان الدين كله لله إن شئتم حدثتكم حديثا سمعته من رسول الله  صلى الله عليه وسلم  ‏.‏ قالوا وأنت سمعته من رسول الله  صلى الله عليه وسلم  ‏.‏ قال نعم شهدت رسول الله  صلى الله عليه وسلم  وقد بعث جيشا من المسلمين إلى المشركين فلما لقوهم قاتلوهم قتالا شديدا فمنحوهم أكتافهم فحمل رجل من لحمتي على رجل من المشركين بالرمح فلما غشيه قال أشهد أن لا إله إلا الله إني مسلم فطعنه فقتله فأتى رسول الله  صلى الله عليه وسلم  فقال يا رسول الله هلكت قال ‏\"‏ وما الذي صنعت ‏\"‏ ‏.‏ مرة أو مرتين فأخبره بالذي صنع فقال له رسول الله  صلى الله عليه وسلم  ‏\"‏ فهلا شققت عن بطنه فعلمت ما في قلبه ‏\"‏ ‏.‏ قال يا رسول الله لو شققت بطنه أكنت أعلم ما في قلبه قال ‏\"‏ فلا أنت قبلت ما تكلم به ولا أنت تعلم ما في قلبه ‏\"‏ ‏.‏ قال فسكت عنه رسول الله  صلى الله عليه وسلم  فلم يلبث إلا يسيرا حتى مات فدفناه فأصبح على ظهر الأرض فقالوا لعل عدوا نبشه فدفناه ثم أمرنا غلماننا يحرسونه فأصبح على ظهر الأرض فقلنا لعل الغلمان نعسوا فدفناه ثم حرسناه بأنفسنا فأصبح على ظهر الأرض فألقيناه في بعض تلك الشعاب ‏.‏",
      "text_en": " It was narrated from Sumait bin Sumair, that ‘Imran bin Husainsaid:                      “Nafi’ bin Azraq and his companions came and said: ‘Youare doomed, O ‘Imran!’ He (‘Imran) said: ‘I am not doomed.’They said: ‘Yes you are.’ I said: ‘Why am I doomed?’ Theysaid: ‘Allah says: “And fight them until there is no more Fitnah(disbelief and polytheism, i.e., worshipping others besides Allah),and the religion (worship) will be all for Allah Alone.”[8:39] Hesaid: ‘We fought them until they were defeated and the religion wasall for Allah Alone. If you wish, I will tell you a Hadith that Iheard from the Messenger of Allah (ﷺ).’ They said: ‘Did you(really) hear it from the Messenger of Allah (ﷺ)?’ He said: ‘Yes.I was with the Messenger of Allah (ﷺ) and he had sent an army ofthe Muslims to the idolaters. When they met them they fought themfiercely, and they (the idolaters) gave them their shoulders (i.e.,turned and fled). A man among my kin attacked an idolator man with aspear, and when he was defeated he said: “I bear witness that nonehas the right to be worshipped but Allah, I am a Muslim.” But hestabbed him and killed him. He came to the Messenger of Allah (ﷺ)and said: “O Messenger of Allah, I am doomed.” He said “What isit that you have done?” one or two times. He told him what he haddone and the Messenger of Allah (ﷺ) said to him: “Why didn’tyou cut open his belly and find out what was in his heart?” Hesaid: “O Messenger of Allah, I wish I had cut open his belly andcould have known what was in his heart.” He said: “You did notaccept what he said, and you could not have known what was in hisheart!” The Messenger of Allah (ﷺ) remained silent concerning him(that man), and a short while later he died. We buried him, but thefollowing morning he was on the surface of the earth. They said:“Perhaps an enemy of his disinterred him.” So we buried him(again) and told our slaves to stand guard. But the following morninghe was on the surface of the earth again then we said: ‘Perhaps theslaves dozed off.’ So we buried him (again) and stood guardourselves, but the following morning he was on the surface of theearth (again). So we threw him into one of these mountain passes.’”",
      "chain": [
        "30547",
        "20345",
        "11080"
      ]
    }
  ],
  "total_hadiths": 189
}