{
  "id": "20356",
  "name": "Muhammad bin Fadayl bin Ghazwan محمد بن فضيل بن غزوان",
  "full_name": "Muhammad bin Fadayl bin Ghazwan محمد بن فضيل بن غزوان",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "195",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ع  -  صدوق ]"
    ],
    "tags": [
      "al-Dabi",
      "Client",
      "al-Kufi"
    ]
  },
  "parents": [
    {
      "id": "20349",
      "name": "Fadayl bin Ghazwan bin Jarir فضيل بن غزوان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20349",
      "name": "Fadayl bin Ghazwan bin Jarir فضيل بن غزوان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10962",
      "name": "Mukhtar bin Falfal مختار بن فلفل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11352",
      "name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10766",
      "name": "Sa'd bin Tariq, Abu Malik سعد بن طارق بن أشيم أبو مالك الأشجعي",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11326",
      "name": "Byan bin Bashr al-Ahmsi بيان بن بشر الأحمسي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "14069",
      "name": "Habib bin Abi Fadalan/Fadala حبيب بن أبي فضلان/ فضالة المالكي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "15097",
      "name": "Husayn bin 'Abdur Rahman al-Salmi حصين بن عبد الرحمن السلمي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11626",
      "name": "Rqbh bin Msqlh bin Abd رقبة بن مسقلة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10776",
      "name": "Darar bin Marra, Abu Sinan ضرار بن مرة الكوفي أبو سنان الشيباني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11379",
      "name": "'Ammara bin al-Q'aqa' bin Shabrma عمارة بن القعقاع بن شبرمة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11647",
      "name": "al-'Ala' bin al-Msyb bin Rafa'i العلاء بن المسيب بن رافع",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30290",
      "name": "Ahmed bin Ishkab أحمد بن إشكاب",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "39005",
      "name": "Ahmed bin 'Umar al-Wky'y Abu أحمد بن عمر الوكيعي",
      "grade": "3rd Century AH"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30468",
      "name": "'Abdullah bin 'Umar عبد الله بن عمر",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "18572",
      "name": "Abu 'Amir al-Huzani أبو عامر الهوزني",
      "grade": "Follower(Tabi') [1st Generation]"
    },
    {
      "id": "30153",
      "name": "'Amr bin 'Ali bin Bahr al-Bahli عمرو بن علي بن بحر الباهلي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30200",
      "name": "'Abdullah bin Sa'id al-Ashaj عبد الله بن سعيد بن حصين الكندي - الأشج",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30156",
      "name": "'Imran bin Mysrh عمران بن ميسرة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30157",
      "name": "Ayash bin al-Walid al-Rqam عياش بن الوليد الرقام",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38513",
      "name": "Muhammad bin Salam al-Baykandi محمد بن سلام",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30216",
      "name": "Abu Karayb, Muhammad bin al-'Ala' محمد بن العلاء - أبو كريب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30478",
      "name": "Muhammad bin Yazid Abu Hisham al-Rafa'i محمد بن يزيد أبو هشام الرفاعي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30481",
      "name": "Wasl bin Abd al-A'la واصل بن عبد الأعلى بن هلال الأسدي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30212",
      "name": "Muhammad bin 'Abdullah bin Numayr محمد بن عبد الله بن نمير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30297",
      "name": "Ahmed bin Snan bin Asad أحمد بن سنان بن أسد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "33021",
      "name": "Muhammad bin Znbwr محمد بن زنبور",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38388",
      "name": "'Ali bin Harb bin Muhammad علي بن حرب بن محمد بن علي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "35099",
      "name": "'Ali bin al-Mndhr علي بن المنذر",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "35004",
      "name": "Ahmed bin Abd al-Jabbar أحمد بن عبد الجبار بن محمد",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "38",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا ابن سلام، قال أخبرنا محمد بن فضيل، قال حدثنا يحيى بن سعيد، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          Allah's Apostle said, \"Whoever observes fasts during the month of      Ramadan out of sincere faith, and hoping to attain Allah's rewards,      then all his past sins will be forgiven.\"",
      "chain": [
        "30376",
        "20356",
        "11062",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "442",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا يوسف بن عيسى، قال حدثنا ابن فضيل، عن أبيه، عن أبي حازم، عن أبي هريرة، قال رأيت سبعين من أصحاب الصفة، ما منهم رجل عليه رداء، إما إزار وإما كساء، قد ربطوا في أعناقهم، فمنها ما يبلغ نصف الساقين، ومنها ما يبلغ الكعبين، فيجمعه بيده، كراهية أن ترى عورته‏.‏",
      "text_en": " Narrated Abu Huraira:                     I saw seventy of As-Suffa men and none of them had a Rida' (a garment covering the upper part of the body). They had either Izars (only) or sheets which they tied round their necks. Some of these sheets reached the middle of their legs and some reached their heels and they used to gather them with their hands lest their private parts should become naked.",
      "chain": [
        "30401",
        "20356",
        "20349",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "595",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا عمران بن ميسرة، قال حدثنا محمد بن فضيل، قال حدثنا حصين، عن عبد الله بن أبي قتادة، عن أبيه، قال سرنا مع النبي صلى الله عليه وسلم ليلة فقال بعض القوم لو عرست بنا يا رسول الله‏.‏ قال ‏\"‏ أخاف أن تناموا عن الصلاة ‏\"‏‏.‏ قال بلال أنا أوقظكم‏.‏ فاضطجعوا وأسند بلال ظهره إلى راحلته، فغلبته عيناه فنام، فاستيقظ النبي صلى الله عليه وسلم وقد طلع حاجب الشمس فقال ‏\"‏ يا بلال أين ما قلت ‏\"‏‏.‏ قال ما ألقيت على نومة مثلها قط‏.‏ قال ‏\"‏ إن الله قبض أرواحكم حين شاء، وردها عليكم حين شاء، يا بلال قم فأذن بالناس بالصلاة ‏\"‏‏.‏ فتوضأ فلما ارتفعت الشمس وابياضت قام فصلى‏.‏",
      "text_en": " Narrated `Abdullah bin Abi Qatada:                     My father said, \"One night we were traveling with the Prophet and some people said, 'We wish that Allah's Apostle would take a rest along with us during the last hours of the night.' He said, 'I am afraid that you will sleep and miss the (Fajr) prayer.' Bilal said, 'I will make you get up.' So all slept and Bilal rested his back against his Rahila and he too was overwhelmed (by sleep) and slept. The Prophet got up when the edge of the sun had risen and said, 'O Bilal! What about your statement?' He replied, 'I have never slept such a sleep.' The Prophet said, 'Allah captured your souls when He wished, and released them when He wished. O Bilal! Get up and pronounce the Adhan for the prayer.' The Prophet performed ablution and when the sun came up and became bright, he stood up and prayed.\"",
      "chain": [
        "30156",
        "20356",
        "15097",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "1199",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا ابن نمير، حدثنا ابن فضيل، حدثنا الأعمش، عن إبراهيم، عن علقمة، عن عبد الله  رضى الله عنه  قال كنا نسلم على النبي صلى الله عليه وسلم وهو في الصلاة فيرد علينا، فلما رجعنا من عند النجاشي سلمنا عليه فلم يرد علينا وقال ‏\"‏ إن في الصلاة شغلا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     We used to greet the Prophet while he was praying and he used to answer our greetings. When we returned from An-Najashi (the ruler of Ethiopia), we greeted him, but he did not answer us (during the prayer) and (after finishing the prayer) he said, \"In the prayer one is occupied (with a more serious matter).\"",
      "chain": [
        "30212",
        "20356",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1216",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا عبد الله بن أبي شيبة، حدثنا ابن فضيل، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال كنت أسلم على النبي صلى الله عليه وسلم وهو في الصلاة فيرد على، فلما رجعنا سلمت عليه فلم يرد على وقال ‏\"‏ إن في الصلاة شغلا ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     I used to greet the Prophet while he was in prayer and he would return my greeting, but when we returned (from Ethiopia) I greeted the Prophet (while he was praying) but he did not return the greeting, and (after finishing the prayer) he said, \"In the prayer one is occupied (with a more serious matter).\"",
      "chain": [
        "30201",
        "20356",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1300",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عمرو بن علي، حدثنا محمد بن فضيل، حدثنا عاصم الأحول، عن أنس  رضى الله عنه  قال قنت رسول الله صلى الله عليه وسلم شهرا حين قتل القراء، فما رأيت رسول الله صلى الله عليه وسلم حزن حزنا قط أشد منه‏.‏",
      "text_en": " Narrated Anas:                     When the reciters of Qur'an were martyred, Allah's Apostle recited Qunut for one month and I never saw him (i.e. Allah's Apostle) so sad as he was on that day.",
      "chain": [
        "30153",
        "20356",
        "11080",
        "19"
      ]
    },
    {
      "hadith_no": "1755",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عياش بن الوليد، حدثنا محمد بن فضيل، حدثنا عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم اغفر للمحلقين ‏\"‏‏.‏ قالوا وللمقصرين‏.‏ قال ‏\"‏ اللهم اغفر للمحلقين ‏\"‏‏.‏ قالوا وللمقصرين‏.‏ قالها ثلاثا‏.‏ قال ‏\"‏ وللمقصرين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"O Allah! Forgive those who get their heads shaved.\" The people asked. \"Also those who get their hair cut short?\" The Prophet said, \"O Allah! Forgive those who have their heads shaved.\" The people said, \"Also those who get their hair cut short?\" The Prophet (invoke Allah for those who have their heads shaved and) at the third time said, \"also (forgive) those who get their hair cut short.\"",
      "chain": [
        "30157",
        "20356",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "2041",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا محمد، أخبرنا محمد بن فضيل بن غزوان، عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، عن عائشة  رضى الله عنها  قالت كان رسول الله صلى الله عليه وسلم يعتكف في كل رمضان، وإذا صلى الغداة دخل مكانه الذي اعتكف فيه  قال  فاستأذنته عائشة أن تعتكف فأذن لها فضربت فيه قبة، فسمعت بها حفصة، فضربت قبة، وسمعت زينب بها، فضربت قبة أخرى، فلما انصرف رسول الله صلى الله عليه وسلم من الغد أبصر أربع قباب، فقال ‏\"‏ ما هذا ‏\"‏‏.‏ فأخبر خبرهن، فقال ‏\"‏ ما حملهن على هذا آلبر انزعوها فلا أراها ‏\"‏‏.‏ فنزعت، فلم يعتكف في رمضان حتى اعتكف في آخر العشر من شوال‏.‏",
      "text_en": " Narrated `Amra bint `Abdur-Rahman from `Aisha:                     Allah's Apostle used to practice I`tikaf every year in the month of Ramadan. And after offering the morning prayer, he used to enter the place of his I`tikaf. `Aisha asked his permission to let her practice I`tikaf and he allowed her, and so she pitched a tent in the mosque. When Hafsa heard of that, she also pitched a tent (for herself), and when Zainab heard of that, she too pitched another tent. When, in the morning, Allah's Apostle had finished the morning prayer, he saw four tents and asked, \"What is this?\" He was informed about it. He then said, \"What made them do this? Is it righteousness? Remove the tents, for I do not want to see them.\" So, the tents were removed. The Prophet did not perform I`tikaf that year in the month of Ramadan, but did it in the last ten days of Shawwal.",
      "chain": [
        "30213",
        "20356",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "2064",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثني محمد، قال حدثني محمد بن فضيل، عن حصين، عن سالم بن أبي الجعد، عن جابر  رضى الله عنه  قال أقبلت عير، ونحن نصلي مع النبي صلى الله عليه وسلم الجمعة، فانفض الناس إلا اثنى عشر رجلا، فنزلت هذه الآية ‏{‏وإذا رأوا تجارة أو لهوا انفضوا إليها وتركوك قائما ‏}‏",
      "text_en": " Narrated Jabir:                     A caravan arrived (at Medina) while we were offering the Jumua prayer with the Prophet. The people left out for the caravan, with the exception of twelve persons. Then this Verse was revealed: 'But when they see some bargain or some amusement, they disperse headlong to it and leave you standing.\" (62.11)",
      "chain": [
        "30213",
        "20356",
        "15097",
        "11342",
        "34"
      ]
    },
    {
      "hadith_no": "2544",
      "source": " Sahih Bukhari ",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا إسحاق بن إبراهيم، سمع محمد بن فضيل، عن مطرف، عن الشعبي، عن أبي بردة، عن أبي موسى  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من كانت له جارية فعالها، فأحسن إليها ثم أعتقها وتزوجها، كان له أجران ‏\"‏‏.‏",
      "text_en": " Narrated Abu Musa:                     Allah's Apostle said, \"He who has a slave-girl and educates and treats her nicely and then manumits and marries her, will get a double reward.\"",
      "chain": [
        "30123",
        "20356",
        "11395",
        "11052",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2613",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن جعفر أبو جعفر، حدثنا ابن فضيل، عن أبيه، عن نافع، عن ابن عمر  رضى الله عنهما  قال أتى النبي صلى الله عليه وسلم بيت فاطمة فلم يدخل عليها، وجاء علي فذكرت له ذلك فذكره للنبي صلى الله عليه وسلم قال ‏\"‏ إني رأيت على بابها سترا موشيا ‏\"‏‏.‏ فقال ‏\"‏ ما لي وللدنيا ‏\"‏‏.‏ فأتاها علي فذكر ذلك لها فقالت ليأمرني فيه بما شاء‏.‏ قال ترسل به إلى فلان‏.‏ أهل بيت بهم حاجة‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Once the Prophet went to the house of Fatima but did not enter it. `Ali came and she told him about that. When 'All asked the Prophet about it, he said, \"I saw a (multicolored) decorated curtain on her door. I am not interested in worldly things.\" `Ali went to Fatima and told her about it. Fatima said, \"I am ready to dispense with it in the way he suggests.\" The Prophet ordered her to send it to such-andsuch needy people. \"",
      "chain": [
        "20173",
        "20356",
        "20349",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2963",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا إسحاق بن إبراهيم، سمع محمد بن فضيل، عن عاصم، عن أبي عثمان، عن مجاشع  رضى الله عنه  قال أتيت النبي صلى الله عليه وسلم أنا وأخي فقلت بايعنا على الهجرة‏.‏ فقال ‏\"‏ مضت الهجرة لأهلها ‏\"‏‏.‏ فقلت علام تبايعنا قال ‏\"‏ على الإسلام والجهاد ‏\"‏‏.‏",
      "text_en": " Narrated Mujashi:                     My brother and I came to the Prophet and I requested him to take the pledge of allegiance from us for migration. He said, \"Migration has passed away with its people.\" I asked, \"For what will you take the pledge of allegiance from us then?\" He said, \"I will take (the pledge) for Islam and Jihad.\"",
      "chain": [
        "30123",
        "20356",
        "11080",
        "11113"
      ]
    },
    {
      "hadith_no": "3388",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا محمد بن سلام، أخبرنا ابن فضيل، حدثنا حصين، عن شقيق، عن مسروق، قال سألت أم رومان، وهى أم عائشة، عما قيل فيها ما قيل قالت بينما أنا مع عائشة جالستان، إذ ولجت علينا امرأة من الأنصار، وهى تقول فعل الله بفلان وفعل‏.‏ قالت فقلت لم قالت إنه نما ذكر الحديث‏.‏ فقالت عائشة أى حديث فأخبرتها‏.‏ قالت فسمعه أبو بكر ورسول الله صلى الله عليه وسلم قالت نعم‏.‏ فخرت مغشيا عليها، فما أفاقت إلا وعليها حمى بنافض، فجاء النبي صلى الله عليه وسلم فقال ‏\"‏ ما لهذه ‏\"‏‏.‏ قلت حمى أخذتها من أجل حديث تحدث به، فقعدت فقالت والله لئن حلفت لا تصدقوني، ولئن اعتذرت لا تعذروني، فمثلي ومثلكم كمثل يعقوب وبنيه، فالله المستعان على ما تصفون‏.‏ فانصرف النبي صلى الله عليه وسلم فأنزل الله ما أنزل، فأخبرها فقالت بحمد الله لا بحمد أحد‏.‏",
      "text_en": " Narrated Masruq:                     I asked Um Ruman, `Aisha's mother about the accusation forged against `Aisha. She said, \"While I was sitting with `Aisha, an Ansari woman came to us and said, 'Let Allah condemn such-and-such person.' I asked her, 'Why do you say so?' She replied, 'For he has spread the (slanderous) story.' `Aisha said, 'What story?' The woman then told her the story. `Aisha asked, 'Have Abu Bakr and Allah's Apostle heard about it ?' She said, 'Yes.' `Aisha fell down senseless (on hearing that), and when she came to her senses, she got fever and shaking of the body. The Prophet came and asked, 'What is wrong with her?' I said, 'She has got fever because of a story which has been rumored.' `Aisha got up and said, 'By Allah! Even if I took an oath, you would not believe me, and if I put forward an excuse, You would not excuse me. My example and your example is just like that example of Jacob and his sons. Against that which you assert, it is Allah (Alone) Whose Help can be sought.' (12.18) The Prophet left and then Allah revealed the Verses (concerning the matter), and on that `Aisha said, 'Thanks to Allah (only) and not to anybody else.\"",
      "chain": [
        "30376",
        "20356",
        "15097",
        "11353",
        "11018"
      ]
    },
    {
      "hadith_no": "3584",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني عمرو بن علي، حدثنا ابن فضيل، حدثنا إسماعيل بن أبي خالد، قال سمعت أبا جحيفة  رضى الله عنه  قال رأيت النبي صلى الله عليه وسلم وكان الحسن بن علي  عليهما السلام  يشبهه قلت لأبي جحيفة صفه لي‏.‏ قال كان أبيض قد شمط‏.‏ وأمر لنا النبي صلى الله عليه وسلم بثلاث عشرة قلوصا قال فقبض النبي صلى الله عليه وسلم قبل أن نقبضها‏.‏",
      "text_en": " Narrated Isma`il bin Abi Khalid:                     I heard Abii Juhaifa saying, \"I saw the Prophet, and Al-Hasan bin `Ali resembled him.\" I said to Abu- Juhaifa, \"Describe him for me.\" He said, \"He was white and his beard was black with some white hair. He promised to give us 13 young she-camels, but he expired before we could get them.\"",
      "chain": [
        "30153",
        "20356",
        "11418",
        "4047"
      ]
    },
    {
      "hadith_no": "3868",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا محمد بن فضيل، عن عمارة، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  قال أتى جبريل النبي صلى الله عليه وسلم فقال يا رسول الله هذه خديجة قد أتت معها إناء فيه إدام أو طعام أو شراب، فإذا هي أتتك فاقرأ عليها السلام من ربها ومني، وبشرها ببيت في الجنة من قصب، لا صخب فيه ولا نصب‏.‏",
      "text_en": "      Narrated Abu Huraira:                           Gabriel came to the Prophet and said, \"O Allah's Apostle! This is Khadija coming to you with a dish having meat soup (or some food or drink). When she reaches you, greet her on behalf of her Lord (i.e. Allah) and on my behalf, and give her the glad tidings of having a Qasab palace in Paradise wherein there will be neither any noise nor any fatigue (trouble) . \"",
      "chain": [
        "30367",
        "20356",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "4071",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسحاق بن إبراهيم، سمع محمد بن فضيل، عن إسماعيل، عن قيس، كان عطاء البدريين خمسة آلاف خمسة آلاف‏.‏ وقال عمر لأفضلنهم على من بعدهم‏.‏",
      "text_en": " Narrated Qais:                     The Badr warriors were given five thousand (Dirhams) each, yearly. `Umar said, \"I will surely give them more than what I will give to others.\"",
      "chain": [
        "30123",
        "20356",
        "11418",
        "11046"
      ]
    },
    {
      "hadith_no": "4205",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يوسف بن عيسى، حدثنا ابن فضيل، حدثنا حصين، عن سالم، عن جابر  رضى الله عنه  قال عطش الناس يوم الحديبية ورسول الله صلى الله عليه وسلم بين يديه ركوة، فتوضأ منها، ثم أقبل الناس نحوه فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما لكم ‏\"‏‏.‏ قالوا يا رسول الله ليس عندنا ماء نتوضأ به، ولا نشرب إلا ما في ركوتك‏.‏ قال فوضع النبي صلى الله عليه وسلم يده في الركوة، فجعل الماء يفور من بين أصابعه كأمثال العيون، قال فشربنا وتوضأنا‏.‏ فقلت لجابر كم كنتم يومئذ قال لو كنا مائة ألف لكفانا، كنا خمس عشرة مائة‏.‏",
      "text_en": " Narrated Salim:                     Jabir said \"On the day of Al-Hudaibiya, the people felt thirsty and Allah's Apostle had a utensil containing water. He performer ablution from it and then the people came towards him. Allah's Apostle said, 'What is wrong with you?' The people said, 'O Allah's Apostle! We haven't got any water to perform ablution with or to drink, except what you have in your utensil.' So the Prophet put his hand in the utensil and the water started spouting out between his fingers like springs. So we drank and performed ablution.\" I said to Jabir, \"What was your number on that day?\" He replied, \"Even if we had been one hundred thousand, that water would have been sufficient for us. Anyhow, we were 1500.'",
      "chain": [
        "30401",
        "20356",
        "15097",
        "11011",
        "34"
      ]
    },
    {
      "hadith_no": "4221",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني أحمد بن إشكاب، حدثنا محمد بن فضيل، عن العلاء بن المسيب، عن أبيه، قال لقيت البراء بن عازب  رضى الله عنهما  فقلت طوبى لك صحبت النبي صلى الله عليه وسلم وبايعته تحت الشجرة‏.‏ فقال يا ابن أخي إنك لا تدري ما أحدثنا بعده‏.‏",
      "text_en": " Narrated Al-Musaiyab:                     I met Al-Bara bin `Azib and said (to him). \"May you live prosperously! You enjoyed the company of the Prophet and gave him the Pledge of allegiance (of Al-Hudaibiya) under the Tree.\" On that, Al- Bara' said, \"O my nephew! You do not know what we have done after him (i.e. his death).",
      "chain": [
        "30290",
        "20356",
        "11647",
        "11394"
      ]
    },
    {
      "hadith_no": "4312",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عمران بن ميسرة، حدثنا محمد بن فضيل، عن حصين، عن عامر، عن النعمان بن بشير  رضى الله عنهما  قال أغمي على عبد الله بن رواحة، فجعلت أخته عمرة تبكي واجبلاه واكذا واكذا‏.‏ تعدد عليه فقال حين أفاق ما قلت شيئا إلا قيل لي آنت كذلك‏.‏",
      "text_en": " Narrated An-Nu`man bin Bashir:                     `Abdullah bin Rawaha fell down unconscious and his sister `Amra started crying and was saying loudly, \"O Jabala! Oh so-and-so! Oh so-and-so! and went on calling him by his (good ) qualities one by one). When he came to his senses, he said (to his sister), \"When-ever you said something, I was asked, 'Are you really so (i.e. as she says)?\"",
      "chain": [
        "30156",
        "20356",
        "15097",
        "11052",
        "274"
      ]
    },
    {
      "hadith_no": "5169",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا محمد بن سلام، حدثنا ابن فضيل، حدثنا هشام، عن أبيه، قال كانت خولة بنت حكيم من اللائي وهبن أنفسهن للنبي صلى الله عليه وسلم فقالت عائشة أما تستحي المرأة أن تهب نفسها للرجل فلما نزلت ‏{‏ترجئ من تشاء منهن‏}‏ قلت يا رسول الله ما أرى ربك إلا يسارع في هواك‏.‏ رواه أبو سعيد المؤدب ومحمد بن بشر وعبدة عن هشام عن أبيه عن عائشة يزيد بعضهم على بعض‏.‏",
      "text_en": " Narrated Hisham's father:                     Khaula bint Hakim was one of those ladies who presented themselves to the Prophet for marriage. `Aisha said, \"Doesn't a lady feel ashamed for presenting herself to a man?\" But when the Verse: \"(O Muhammad) You may postpone (the turn of) any of them (your wives) that you please,' (33.51) was revealed, \" `Aisha said, 'O Allah's Apostle! I do not see, but, that your Lord hurries in pleasing you.' \"",
      "chain": [
        "30376",
        "20356",
        "11065",
        "10511"
      ]
    },
    {
      "hadith_no": "5428",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا يوسف بن عيسى، حدثنا محمد بن فضيل، عن أبيه، عن أبي حازم، عن أبي هريرة، قال ما شبع آل محمد صلى الله عليه وسلم من طعام ثلاثة أيام حتى قبض‏.‏",
      "text_en": "      Narrated Abu Huraira:                          The family of Muhammad did not eat their fill for three successive      days till he died.",
      "chain": [
        "30401",
        "20356",
        "20349",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "5541",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا محمد بن فضيل، عن بيان، عن الشعبي، عن عدي بن حاتم، قال سألت رسول الله صلى الله عليه وسلم قلت إنا قوم نصيد بهذه الكلاب‏.‏ فقال ‏\"‏ إذا أرسلت كلابك المعلمة وذكرت اسم الله، فكل مما أمسكن عليكم، وإن قتلن إلا أن يأكل الكلب، فإني أخاف أن يكون إنما أمسكه على نفسه، وإن خالطها كلاب من غيرها فلا تأكل ‏\"‏‏.‏",
      "text_en": " Narrated Adi bin Hatim:                     I asked Allah's Apostle. \"We hunt with the help of these hounds.\" He said, \"If you let loose your trained hounds after a game, and mention the name of Allah, then you can eat what the hounds catch for you, even if they killed the game. But you should not eat of it if the hound has eaten of it, for then it is likely that the hound has caught the game for itself. And if other hounds join your hound in hunting the game, then do not eat of it.\"",
      "chain": [
        "30367",
        "20356",
        "11326",
        "11052",
        "212"
      ]
    },
    {
      "hadith_no": "5545",
      "source": " Sahih Bukhari ",
      "chapter": "Hunting; Slaughtering - كتاب الذبائح والصيد",
      "chapter_no": "72",
      "text_ar": "حدثني محمد، أخبرني ابن فضيل، عن بيان، عن عامر، عن عدي بن حاتم  رضى الله عنه  قال سألت رسول الله صلى الله عليه وسلم فقلت إنا قوم نتصيد بهذه الكلاب‏.‏ فقال ‏\"‏ إذا أرسلت كلابك المعلمة وذكرت اسم الله، فكل مما أمسكن عليك، إلا أن يأكل الكلب، فلا تأكل فإني أخاف أن يكون إنما أمسك على نفسه، وإن خالطها كلب من غيرها، فلا تأكل ‏\"‏‏.‏",
      "text_en": " Narrated Adi Bin Hatim:                     I asked Allah's Apostle, \"We hunt with these hounds.\" He said, \"If you send your trained hounds after a game and mention Allah's Name on sending, you can eat of what they catch for you. But if the hound eats of the game, then you must not eat of it, for I am afraid that the hound caught it for itself, and if another hound joins your hounds (during the hunt), you should not eat of the game.\"",
      "chain": [
        "30213",
        "20356",
        "11326",
        "11052",
        "212"
      ]
    },
    {
      "hadith_no": "5767",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا عمران بن ميسرة، حدثنا ابن فضيل، حدثنا حصين، عن عامر، عن عمران بن حصين  رضى الله عنهما  قال لا رقية إلا من عين أو حمة‏.‏ فذكرته لسعيد بن جبير فقال حدثنا ابن عباس قال رسول الله صلى الله عليه وسلم ‏\"‏ عرضت على الأمم، فجعل النبي والنبيان يمرون معهم الرهط، والنبي ليس معه أحد، حتى رفع لي سواد عظيم، قلت ما هذا أمتي هذه قيل هذا موسى وقومه‏.‏ قيل انظر إلى الأفق‏.‏ فإذا سواد يملأ الأفق، ثم قيل لي انظر ها هنا وها هنا في آفاق السماء فإذا سواد قد ملأ الأفق قيل هذه أمتك ويدخل الجنة من هؤلاء سبعون ألفا بغير حساب، ثم دخل ولم يبين لهم فأفاض القوم وقالوا نحن الذين آمنا بالله، واتبعنا رسوله، فنحن هم أو أولادنا الذين ولدوا في الإسلام فإنا ولدنا في الجاهلية‏.‏ فبلغ النبي صلى الله عليه وسلم فخرج فقال هم الذين لا يسترقون، ولا يتطيرون، ولا يكتوون وعلى ربهم يتوكلون ‏\"‏‏.‏ فقال عكاشة بن محصن أمنهم أنا يا رسول الله قال ‏\"‏ نعم ‏\"‏‏.‏ فقام آخر فقال أمنهم أنا قال ‏\"‏ سبقك عكاشة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle said, 'Nations were displayed before me; one or two prophets would pass by along with a few followers. A prophet would pass by accompanied by nobody. Then a big crowd of people passed in front of me and I asked, Who are they Are they my followers?\" It was said, 'No. It is Moses and his followers It was said to me, 'Look at the horizon.'' Behold! There was a multitude of people filling the horizon. Then it was said to me, 'Look there and there about the stretching sky! Behold! There was a multitude filling the horizon,' It was said to me, 'This is your nation out of whom seventy thousand shall enter Paradise without reckoning.' \"Then the Prophet entered his house without telling his companions who they (the 70,000) were. So the people started talking about the issue and said, \"It is we who have believed in Allah and followed His Apostle; therefore those people are either ourselves or our children who are born m the Islamic era, for we were born in the Pre-lslamic Period of Ignorance.'' When the Prophet heard of that, he came out and said. \"Those people are those who do not treat themselves with Ruqya, nor do they believe in bad or good omen (from birds etc.) nor do they get themselves branded (Cauterized). but they put their trust (only) in their Lord \" On that 'Ukasha bin Muhsin said. \"Am I one of them, O Allah's Apostle?' The Prophet said, \"Yes.\" Then another person got up and said, \"Am I one of them?\" The Prophet said, 'Ukasha has anticipated you.\"",
      "chain": [
        "30156",
        "20356",
        "15097",
        "11052",
        "123"
      ]
    },
    {
      "hadith_no": "6481",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا زهير بن حرب، حدثنا ابن فضيل، عن عمارة، عن أبي زرعة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ كلمتان خفيفتان على اللسان، ثقيلتان في الميزان، حبيبتان إلى الرحمن، سبحان الله العظيم، سبحان الله وبحمده ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"There are two expressions which are very easy for the tongue to say, but they are very heavy in the balance and are very dear to The Beneficent (Allah), and they are, 'Subhan Allah Al- `Azim and 'Subhan Allah wa bihamdihi.'\"",
      "chain": [
        "30022",
        "20356",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "6537",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا محمد بن فضيل، عن أبيه، عن عمارة، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم ارزق آل محمد قوتا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"O Allah! Give food to the family of Muhammad.\"",
      "chain": [
        "30351",
        "20356",
        "20349",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "6621",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عمران بن ميسرة، حدثنا ابن فضيل، حدثنا حصين،‏.‏ وحدثني أسيد بن زيد، حدثنا هشيم، عن حصين، قال كنت عند سعيد بن جبير فقال حدثني ابن عباس، قال قال النبي صلى الله عليه وسلم ‏\"‏ عرضت على الأمم، فأخذ النبي يمر معه الأمة، والنبي يمر معه النفر، والنبي يمر معه العشرة، والنبي يمر معه الخمسة، والنبي يمر وحده، فنظرت فإذا سواد كثير قلت يا جبريل هؤلاء أمتي قال لا ولكن انظر إلى الأفق‏.‏ فنظرت فإذا سواد كثير‏.‏ قال هؤلاء أمتك، وهؤلاء سبعون ألفا قدامهم، لا حساب عليهم ولا عذاب‏.‏ قلت ولم قال كانوا لا يكتوون، ولا يسترقون، ولا يتطيرون، وعلى ربهم يتوكلون ‏\"‏‏.‏ فقام إليه عكاشة بن محصن فقال ادع الله أن يجعلني منهم‏.‏ قال ‏\"‏ اللهم اجعله منهم ‏\"‏‏.‏ ثم قام إليه رجل آخر قال ادع الله أن يجعلني منهم‏.‏ قال ‏\"‏ سبقك بها عكاشة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"The people were displayed in front of me and I saw one prophet passing by with a large group of his followers, and another prophet passing by with only a small group of people, and another prophet passing by with only ten (persons), and another prophet passing by with only five (persons), and another prophet passed by alone. And then I looked and saw a large multitude of people, so I asked Gabriel, \"Are these people my followers?' He said, 'No, but look towards the horizon.' I looked and saw a very large multitude of people. Gabriel said. 'Those are your followers, and those are seventy thousand (persons) in front of them who will neither have any reckoning of their accounts nor will receive any punishment.' I asked, 'Why?' He said, 'For they used not to treat themselves with branding (cauterization) nor with Ruqya (get oneself treated by the recitation of some Verses of the Qur'an) and not to see evil omen in things, and they used to put their trust (only) in their Lord.\" On hearing that, 'Ukasha bin Mihsan got up and said (to the Prophet), \"Invoke Allah to make me one of them.\" The Prophet said, \"O Allah, make him one of them.\" Then another man got up and said (to the Prophet), \"Invoke Allah to make me one of them.\" The Prophet said, 'Ukasha has preceded you.\"",
      "chain": [
        "30156",
        "20356",
        "20468",
        "15097",
        "17"
      ]
    },
    {
      "hadith_no": "6763",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا محمد بن فضيل، حدثنا عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كلمتان خفيفتان على اللسان، ثقيلتان في الميزان، حبيبتان إلى الرحمن سبحان الله وبحمده، سبحان الله العظيم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"(Following are) two words (sentences or utterances that are very easy for the tongue to say, and very heavy in the balance (of reward,) and the must beloved to the Gracious Almighty (And they are): Subhan Allah wa bi-hamdihi; Subhan Allahi-l-'Azim,\"",
      "chain": [
        "30367",
        "20356",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "7166",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا أحمد بن إشكاب، حدثنا محمد بن فضيل، عن أبيه، عن عكرمة، عن ابن عباس  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم ‏\"‏ لا ترتدوا بعدي كفارا، يضرب بعضكم رقاب بعض ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet said, \"Beware! Do not renegade as (disbelievers) after me by striking (cutting) the necks of one another.\"",
      "chain": [
        "30290",
        "20356",
        "20349",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "7589",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا زهير بن حرب، حدثنا ابن فضيل، عن عمارة، عن أبي زرعة، عن أبي هريرة، فقال ‏\"‏ هذه خديجة أتتك بإناء فيه طعام أو إناء فيه شراب فأقرئها من ربها السلام وبشرها ببيت من قصب لا صخب فيه ولا نصب ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said that Gabriel said, \"Here is Khadija coming to you with a dish of food or a tumbler containing something to drink. Convey to her a greeting from her Lord (Allah) and give her the glad tidings that she will have a palace in Paradise built of Qasab wherein there will be neither any noise nor any fatigue (trouble).\" (See Hadith No. 168, Vol. 5)",
      "chain": [
        "30022",
        "20356",
        "11379",
        "11406"
      ]
    },
    {
      "hadith_no": "7654",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا ابن فضيل، عن عمارة، عن أبي زرعة، سمع أبا هريرة  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ قال الله عز وجل ومن أظلم ممن ذهب يخلق كخلقي، فليخلقوا ذرة، أو ليخلقوا حبة أو شعيرة ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     I heard the Prophet saying, \"Allah said, 'Who are most unjust than those who try to create something like My creation? I challenge them to create even a smallest ant, a wheat grain or a barley grain.' \"",
      "chain": [
        "30216",
        "20356",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "7658",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثني أحمد بن إشكاب، حدثنا محمد بن فضيل، عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ كلمتان حبيبتان إلى الرحمن، خفيفتان على اللسان، ثقيلتان في الميزان سبحان الله وبحمده، سبحان الله العظيم ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"(There are) two words which are dear to the Beneficent (Allah) and very light (easy) for the tongue (to say), but very heavy in weight in the balance. They are: ''Subhan Allah wa-bi hamdihi'' and ''Subhan Allah Al-`Azim.\" (See Hadith No. 673, Vol. 8).",
      "chain": [
        "30290",
        "20356",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "368",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الله بن عامر بن زرارة الحضرمي، حدثنا محمد بن فضيل، عن مختار بن فلفل، عن أنس بن مالك، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ قال الله عز وجل إن أمتك لا يزالون يقولون ما كذا ما كذا حتى يقولوا هذا الله خلق الخلق فمن خلق الله ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik transmitted it from the Messenger of Allah (may peace be upon him) that the Great and Glorious Allah said:                      Verily your people would constantly question about this and that till they would say: Well, it is Allah Who created the creation, but who created Allah?",
      "chain": [
        "20356",
        "19"
      ]
    },
    {
      "hadith_no": "414",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وابن، نمير وأبو كريب قالوا حدثنا ابن فضيل، ح وحدثني زهير بن حرب، حدثنا جرير، كلاهما عن عمارة بن القعقاع، عن أبي زرعة، عن أبي هريرة، عن النبي صلى الله عليه وسلم ح",
      "text_en": " This hadith has been narrated by another chain of transmitters, Abu Bakr b. Abi Shaiba, Ibn Numair, Abu Kuraib, Ibn Fudail.",
      "chain": [
        "30201",
        "20356",
        "30022",
        "11379",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "417",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، قالا حدثنا وكيع، ح وحدثنيه زهير بن حرب، حدثنا إسحاق بن يوسف الأزرق، جميعا عن فضيل بن غزوان، ح وحدثنا أبو كريب، محمد بن العلاء - واللفظ له - حدثنا ابن فضيل، عن أبيه، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاث إذا خرجن لا ينفع نفسا إيمانها لم تكن آمنت من قبل أو كسبت في إيمانها خيرا طلوع الشمس من مغربها والدجال ودابة الأرض ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) observed:                      When three things appear faith will not benefit one who has not previously believed or has derived no good from his faith: the rising of the sun in its place of setting, the Dajjal, and the beast of the earth.",
      "chain": [
        "30201",
        "30022",
        "20032",
        "20411",
        "20349",
        "20356",
        "20349",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "503",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن طريف بن خليفة البجلي، حدثنا محمد بن فضيل، حدثنا أبو مالك الأشجعي، عن أبي حازم، عن أبي هريرة، وأبو مالك عن ربعي، عن حذيفة، قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ يجمع الله تبارك وتعالى الناس فيقوم المؤمنون حتى تزلف لهم الجنة فيأتون آدم فيقولون يا أبانا استفتح لنا الجنة ‏.‏ فيقول وهل أخرجكم من الجنة إلا خطيئة أبيكم آدم لست بصاحب ذلك اذهبوا إلى ابني إبراهيم خليل الله - قال - فيقول إبراهيم لست بصاحب ذلك إنما كنت خليلا من وراء وراء اعمدوا إلى موسى صلى الله عليه وسلم الذي كلمه الله تكليما ‏.‏ فيأتون موسى صلى الله عليه وسلم فيقول لست بصاحب ذلك اذهبوا إلى عيسى كلمة الله وروحه ‏.‏ فيقول عيسى صلى الله عليه وسلم لست بصاحب ذلك ‏.‏ فيأتون محمدا صلى الله عليه وسلم فيقوم فيؤذن له وترسل الأمانة والرحم فتقومان جنبتى الصراط يمينا وشمالا فيمر أولكم كالبرق ‏\"‏ ‏.‏ قال قلت بأبي أنت وأمي أى شىء كمر البرق قال ‏\"‏ ألم تروا إلى البرق كيف يمر ويرجع في طرفة ‎03:43 م ‎19/‎01/‎2003ين ثم كمر الريح ثم كمر الطير وشد الرجال تجري بهم أعمالهم ونبيكم قائم على الصراط يقول رب سلم سلم حتى تعجز أعمال العباد حتى يجيء الرجل فلا يستطيع السير إلا زحفا - قال - وفي حافتى الصراط كلاليب معلقة مأمورة بأخذ من أمرت به فمخدوش ناج ومكدوس في النار ‏\"‏ ‏.‏ والذي نفس أبي هريرة بيده إن قعر جهنم لسبعون خريفا ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira and Hudhaifa that the Messenger of Allah (may peace be upon him) said:                      Allah, the Blessed and Exalted, would gather people. The believers would stand till the Paradise would be brought near them. They would come to Adam and say: O our father, open for us the Paradise. He would say: What turned ye out from the Paradise was the sin of your father Adam. I am not in a position to do that; better go to my son Ibrahim, the Friend of Allah. He (the Holy Prophet) said: He (Ibrahim) would say: I am not in a position to do that. Verily I had been the Friend (of Allah) from beyond, beyond; you better approach Moses (peace be upon him) with whom Allah conversed. They would come to Moses (peace be upon him), but he would say: I am not in a position to do that; you better go to Jesus, the Word of Allah and His Spirit. Jesus (peace be upon him) would say: I am not in a position to do that. So they would come to Mubammad (may peace be upon him). He would then be permitted (to open the door of Paradise). Trust worthiness and kinship would be despatched, and these would stand on the right and left of the Path and the first of you would pass with (the swiftness) of lightning. He (the narrator) said: I said, O thou who art far dearer to me than my father and my mother I which thing is like the passing of lightning? He said: Have you not seen lightning, how it passes and then comes back within the twinkling of an eye? Then (they would pass) like the passing of the wind, then like the passing of a bird, and the hastening of persons would be according to their deeds, and your Apostle would be standing on the Path saying: Save, O my Lord, save. (The people would go on passing) till the deeds of the servants would be failing in strength, till a man would come who would find it hard to go along (that Path) but crawlingly. He (the narrator) said: And on the sides of the Path hooks would be suspended ready to catch anyone whom these would be required (to catch). There would be those who would somehow or other succeed in trasversing that Path and some would be piled up in Hell. By Him in Whose Hand is the life of Abu Huraira it would take one seventy years to fathom the depth of Hell.",
      "chain": [
        "30476",
        "20356",
        "10766",
        "11349",
        "13",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "550",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن فضيل، عن حصين، عن سعيد بن جبير، حدثنا ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ عرضت على الأمم ‏\"‏ ‏.‏ ثم ذكر باقي الحديث نحو حديث هشيم ولم يذكر أول حديثه ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      The Messenger of Allah (may peace be upon him) said: Peoples would be presented to me (on the Day of Resurrection), and then the remaining part of the hadith was narrated like the one transmitted by Hushaim, but he made no mention of the first portion.",
      "chain": [
        "30201",
        "20356",
        "15097",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "247",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو كريب، وواصل بن عبد الأعلى، - واللفظ لواصل - قالا حدثنا ابن فضيل، عن أبي مالك الأشجعي، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ترد على أمتي الحوض وأنا أذود الناس عنه كما يذود الرجل إبل الرجل عن إبله ‏\"‏ ‏.‏ قالوا يا نبي الله أتعرفنا قال ‏\"‏ نعم لكم سيما ليست لأحد غيركم تردون على غرا محجلين من آثار الوضوء وليصدن عني طائفة منكم فلا يصلون فأقول يا رب هؤلاء من أصحابي فيجيبني ملك فيقول وهل تدري ما أحدثوا بعدك ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported the Messenger of Allah (may peace be upon him) said:                      My people would come to me on the Cistern and I would drive away persons (from it) just as a person drives away other people's camels from his camels. They (the hearers) said: Apostle of Allah, would you recognize us? He replied: Yea, you would have a mark which other people will not have. You would come to me with a white blaze on your foreheads and white marks on your feet because of the traces of ablution. A group among you would be prevented from coming to me, and they would not meet me, and I would say: O my Lord, they are my companions. Upon this an angel would reply to me saying: Do you know what these people did after you.",
      "chain": [
        "30216",
        "30481",
        "20356",
        "10766",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "400",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء أخبرنا ابن فضيل، عن مختار بن فلفل، قال سمعت أنس بن مالك، يقول أغفى رسول الله صلى الله عليه وسلم إغفاءة ‏.‏ بنحو حديث ابن مسهر غير أنه قال ‏\"‏ نهر وعدنيه ربي عز وجل في الجنة عليه حوض ‏\"‏ ‏.‏ ولم يذكر ‏\"‏ آنيته عدد النجوم ‏\"‏ ‏.‏",
      "text_en": " Mukhtar b. Fulful reported that he had heard Anas b. Malik say that the Messenger of Allah (may peace be upon him) dozed off, and the rest of the hadith is the same as transmitted by Mus-hir except for the words that he (the Holy Prophet) said:                      It (Kauthar) is a canal which my Lord the Exalted and the Glorious has promised me in Paradise. There is a tank over it, but he made no mention of the tumblers like the number of the stars.",
      "chain": [
        "30216",
        "20356",
        "19"
      ]
    },
    {
      "hadith_no": "1193",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن فضيل، عن أبي مالك الأشجعي، عن ربعي، عن حذيفة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ فضلنا على الناس بثلاث جعلت صفوفنا كصفوف الملائكة وجعلت لنا الأرض كلها مسجدا وجعلت تربتها لنا طهورا إذا لم نجد الماء ‏\"‏ ‏.‏ وذكر خصلة أخرى ‏.‏",
      "text_en": " Hudhaifa reported:                      The Messenger of Allah (may peace be npon him) said: We have been made to excel (other) people in three (things): Our rows have been made like the rows of the angels and the whole earth has been made a mosque for us, and its dust has been made a purifier for us in case water is not available. And he mentioned another characteristic too",
      "chain": [
        "30201",
        "20356",
        "10766",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "1229",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، وابن، نمير وأبو سعيد الأشج - وألفاظهم متقاربة - قالوا حدثنا ابن فضيل، حدثنا الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، قال كنا نسلم على رسول الله صلى الله عليه وسلم وهو في الصلاة فيرد علينا فلما رجعنا من عند النجاشي سلمنا عليه فلم يرد علينا فقلنا يا رسول الله كنا نسلم عليك في الصلاة فترد علينا ‏.‏ فقال ‏\"‏ إن في الصلاة شغلا ‏\"‏ ‏.‏",
      "text_en": " Abdullah (b. Masu'd) reported:                      We used to greet the Messenger of Allah (may peace be upon him) while he was engaged in prayer and he would respond to our greeting. But when we returned from the Negus we greeted him and he did not respond to us; so we said: Messenger of Allah. we used to greet you when you were engaged in prayer and you would respond to us. He replied: Prayer demands whole attention.",
      "chain": [
        "30201",
        "30022",
        "20356",
        "11060",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "1565",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو كريب، حدثنا أبو معاوية، ح وحدثنا إسحاق، أخبرنا جرير، وأبو معاوية ح وحدثنا الأشج، حدثنا ابن فضيل، ح وحدثنا ابن أبي عمر، حدثنا سفيان، كلهم عن الأعمش، بهذا الإسناد مثله ‏.‏",
      "text_en": " A hadith like this has been narrated by A'mash by the same chain of transmitters",
      "chain": [
        "30216",
        "20354",
        "30312",
        "20028",
        "20354",
        "30200",
        "20356",
        "30421"
      ]
    },
    {
      "hadith_no": "1583",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو كريب، حدثنا حفص، وابن، فضيل ح وحدثنا ابن أبي عمر، حدثنا مروان، كلهم عن عاصم، عن أنس، عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏ يزيد بعضهم على بعض ‏.‏",
      "text_en": " This hadith has been narrated by Anas with another chain of transmitters and with minor additions.",
      "chain": [
        "30216",
        "20356",
        "30421",
        "11080",
        "19"
      ]
    },
    {
      "hadith_no": "1835",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا واصل بن عبد الأعلى، حدثنا محمد بن فضيل، عن حصين بن عبد الرحمن، عن حبيب بن أبي ثابت، عن محمد بن علي بن عبد الله بن عباس، عن أبيه، عن عبد الله بن عباس، أنه رقد عند رسول الله صلى الله عليه وسلم فاستيقظ فتسوك وتوضأ وهو يقول ‏{‏ إن في خلق السموات والأرض واختلاف الليل والنهار لآيات لأولي الألباب‏}‏ فقرأ هؤلاء الآيات حتى ختم السورة ثم قام فصلى ركعتين فأطال فيهما القيام والركوع والسجود ثم انصرف فنام حتى نفخ ثم فعل ذلك ثلاث مرات ست ركعات كل ذلك يستاك ويتوضأ ويقرأ هؤلاء الآيات ثم أوتر بثلاث فأذن المؤذن فخرج إلى الصلاة وهو يقول ‏\"‏ اللهم اجعل في قلبي نورا وفي لساني نورا واجعل في سمعي نورا واجعل في بصري نورا واجعل من خلفي نورا ومن أمامي نورا واجعل من فوقي نورا ومن تحتي نورا ‏.‏ اللهم أعطني نورا ‏\"‏",
      "text_en": " Ibn Abbas reported:                      I spent a night in the house of my mother's sister Maimuna. The Apostle of Allah (way peace be upon him) got up for observing voluntary prayer (Tahajjud) at night. The Apostle of Allah (may peace be upon him) stood by the water-skin and performed ablution and then stood up and prayed. I also got up when I saw him doing that. I also performed ablution from the water-skin and then stood at his left side. He took hold of my hand from behind his back and then turned me from his back to his right side. I ('Ata', one of the narrators) said: Did it concern the voluntary prayer (at night)? He ('Ibn 'Abbas) said: Yes.",
      "chain": [
        "30481",
        "20356",
        "15097",
        "11331",
        "10961",
        "10949",
        "17"
      ]
    },
    {
      "hadith_no": "1925",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا واصل بن عبد الأعلى، حدثنا ابن فضيل، عن بشير أبي إسماعيل، عن أبي حازم، عن أبي هريرة، قال خرج إلينا رسول الله صلى الله عليه وسلم فقال ‏\"‏ أقرأ عليكم ثلث القرآن ‏\"‏ ‏.‏ فقرأ ‏{‏ قل هو الله أحد * الله الصمد‏}‏ حتى ختمها ‏.‏",
      "text_en": " 'A'isha reported:                      The Messenger of Allah (may peace be upon him) sent a man in charge of an expedition and he would recite for his Companions during their prayer, ending (recitation) with:\" Say, He is God, One.\" When they returned mention was made of it to the Messenger of Allah (may peace be upon him). He (the Holy Prophet) told them to ask him why he had done like that. So they asked him and he said: Verily, it is an attribute of the Compassionate One, and (for this reason) I love to recite it. The Messenger of Allah (may peace be upon him) thereupon said: Inform him that Allah loves him.",
      "chain": [
        "30481",
        "20356",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "1975",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب جميعا عن ابن فضيل، - قال أبو بكر حدثنا محمد بن فضيل، - عن مختار بن فلفل، قال سألت أنس بن مالك عن التطوع، بعد العصر فقال كان عمر يضرب الأيدي على صلاة بعد العصر وكنا نصلي على عهد النبي صلى الله عليه وسلم ركعتين بعد غروب الشمس قبل صلاة المغرب ‏.‏ فقلت له أكان رسول الله صلى الله عليه وسلم صلاهما قال كان يرانا نصليهما ‏.‏ فلم يأمرنا ولم ينهنا.",
      "text_en": " Anas b. Malik reported:                      When we were in Medina, the moment the Mu'adhdhin made the call to the sunset prayer, the people hastened to the pillars of the mosque and prayed two rak'ahs with the result that any stranger coming into the mosque would think that the obligatory prayer had been observed owing to the number who were praying then.",
      "chain": [
        "30201",
        "20356",
        "20436",
        "20356",
        "19"
      ]
    },
    {
      "hadith_no": "2019",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا أبو كريب، وواصل بن عبد الأعلى، قالا حدثنا ابن فضيل، عن أبي مالك، الأشجعي عن أبي حازم، عن أبي هريرة، وعن ربعي بن حراش، عن حذيفة، قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ أضل الله عن الجمعة من كان قبلنا فكان لليهود يوم السبت وكان للنصارى يوم الأحد فجاء الله بنا فهدانا الله ليوم الجمعة فجعل الجمعة والسبت والأحد وكذلك هم تبع لنا يوم القيامة نحن الآخرون من أهل الدنيا والأولون يوم القيامة المقضي لهم قبل الخلائق ‏\"‏ ‏.‏ وفي رواية واصل المقضي بينهم ‏.‏",
      "text_en": " It is narrated by Abu Huraira and Huraira that the Messenger of Allah (may peace be upon him) said:                      It was Friday from which Allah diverted those who were before us. For the Jews (the day set aside for prayer) was Sabt (Saturday), and for the Christians it was Sunday. And Allah turned towards us and guided us to Friday (as the day of prayer) for us. In fact, He (Allah) made Friday, Saturday and Sunday (as days of prayer). In this order would they (Jews and Christians) come after us on the Day of Resurrection. We are the last of (the Ummahs) among the people in this world and the first among the created to be judged on the Day of Resurrection. In one narration it is: ', to be judged among them\".",
      "chain": [
        "30216",
        "30481",
        "20356",
        "10766",
        "11349",
        "13",
        "11334",
        "145"
      ]
    },
    {
      "hadith_no": "2175",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا محمد بن عبد الله بن نمير، حدثنا ابن فضيل، ح وحدثنا أبو بكر بن أبي، شيبة حدثنا أبو معاوية، جميعا عن عاصم الأحول، بهذا الإسناد ‏.‏ غير أن حديث حماد أتم وأطول ‏.‏",
      "text_en": " This hadith has been narrated by another chain of transmitters on the authority of 'Asim al-Ahwal.",
      "chain": [
        "30212",
        "20356",
        "30201"
      ]
    },
    {
      "hadith_no": "2305",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، ومحمد بن المثنى، - واللفظ لأبي بكر وابن نمير - قالوا حدثنا محمد بن فضيل، عن أبي سنان، - وهو ضرار بن مرة - عن محارب بن دثار، عن ابن بريدة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ نهيتكم عن زيارة القبور فزوروها ونهيتكم عن لحوم الأضاحي فوق ثلاث فأمسكوا ما بدا لكم ونهيتكم عن النبيذ إلا في سقاء فاشربوا في الأسقية كلها ولا تشربوا مسكرا ‏\"‏ ‏.‏ قال ابن نمير في روايته عن عبد الله بن بريدة عن أبيه ‏.‏",
      "text_en": " Ibn Buraida reported on the authority of his father that the Messenger of Allah (may peace be upon him) said:                      I forbade you to visit graves, but you may now visit them; I forbade you to eat the flesh of sacrificial animals after three days, but you way now keep it as along as you feel inclined; and I forbade you nabidh except in a water-skin, you may drink it from all kinds of water-skins, but you must not drink anything intoxicating.",
      "chain": [
        "30201",
        "30212",
        "30170",
        "20356",
        "10776",
        "11389",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "2388",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا واصل بن عبد الأعلى، وأبو كريب ومحمد بن يزيد الرفاعي - واللفظ لواصل - قالوا حدثنا محمد بن فضيل، عن أبيه، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تقيء الأرض أفلاذ كبدها أمثال الأسطوان من الذهب والفضة فيجيء القاتل فيقول في هذا قتلت ‏.‏ ويجيء القاطع فيقول في هذا قطعت رحمي ‏.‏ ويجيء السارق فيقول في هذا قطعت يدي ثم يدعونه فلا يأخذون منه شيئا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenaer (may peace be upon him) as saying:                      The earth will vomit long pieces of its liver like columns of gold and silver, and the murderer will come and say: It was for this that I committed murder. The breaker of family ties will come and say: It was for this that I broke the family ties; and the thief will come and say: It is for this that my hands were cut off. They will then leave it and will not take anything out of it.",
      "chain": [
        "30481",
        "20356",
        "20349",
        "11172",
        "13"
      ]
    }
  ],
  "total_hadiths": 217
}