{
  "id": "20352",
  "name": "Muhammad bin Bashr bin al-Farafsa محمد بن بشر بن الفرافصة العبدي",
  "full_name": "Muhammad bin Bashr bin al-Farafsa محمد بن بشر بن الفرافصة العبدي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "203",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة حافظ ]"
    ],
    "tags": [
      "al-'Abdi",
      "al-Kufi",
      "Hafiz"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "25362",
      "name": "Yazid bin Ziyad bin Aby يزيد بن زياد بن أبي الجعد الأشجعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11338",
      "name": "Zakaria bin Abi Za'idah زكريا بن أبي زائدة خالد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11073",
      "name": "Sa'id bin Abi 'Aruba سعيد بن أبي عروبة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20166",
      "name": "'Abdul 'Aziz bin 'Umar bin 'Abdul-'Aziz عبد العزيز بن عمر بن عبد العزيز",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11277",
      "name": "Hjaj bin Abi 'Uthman حجاج بن أبي عثمان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11404",
      "name": "Yahya bin Sa'id bin Hiyan يحيى بن سعيد بن حيان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11718",
      "name": "Fatr bin Khalifa فطر بن خليفة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11220",
      "name": "Muhammad bin 'Amr bin 'Alqama محمد بن عمرو بن علقمة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11439",
      "name": "'Amr bin Maymun bin Mahran عمرو بن ميمون بن مهران الجزري",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30216",
      "name": "Abu Karayb, Muhammad bin al-'Ala' محمد بن العلاء - أبو كريب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30212",
      "name": "Muhammad bin 'Abdullah bin Numayr محمد بن عبد الله بن نمير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30394",
      "name": "Musa bin Hzam موسى بن حزام",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30524",
      "name": "Harun bin 'Abdullah al-Hamal هارون بن عبد الله بن مروان الحمال",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "35153",
      "name": "Musa bin 'Abdur Rahman موسى بن عبد الرحمن بن سعيد بن مسروق",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30149",
      "name": "'Abdah bin 'Abdullah al-Saffar عبدة بن عبد الله الصفار",
      "grade": "3rd Century AH"
    },
    {
      "id": "34188",
      "name": "Muhammad bin Isma'il bin Ibrahim محمد بن إسماعيل بن إبراهيم بن مقسم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "34069",
      "name": "Huthara bin Muhammad حوثرة بن محمد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30553",
      "name": "'Abd bin Hameed bin Nasr عبد بن حميد بن نصر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "35029",
      "name": "al-Hasan bin 'Ali bin 'Affan الحسن بن علي بن عفان",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-2530",
      "hadith_no": "2530",
      "source": "Sahih Bukhari",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، عن محمد بن بشر، عن إسماعيل، عن قيس، عن أبي هريرة  رضى الله عنه  أنه لما أقبل يريد الإسلام ومعه غلامه، ضل كل واحد منهما من صاحبه، فأقبل بعد ذلك وأبو هريرة جالس مع النبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ يا أبا هريرة، هذا غلامك قد أتاك ‏\"‏‏.‏ فقال أما إني أشهدك أنه حر‏.‏ قال فهو حين يقول يا ليلة من طولها وعنائها على أنها من دارة الكفر نجت",
      "text_en": " Narrated Qais:                     When Abu Huraira accompanied by his slave set out intending to embrace Islam they lost each other on the way. The slave then came while Abu Huraira was sitting with the Prophet. The Prophet said, \"O Abu Huraira! Your slave has come back.\" Abu Huraira said, \"Indeed, I would like you to witness that I have manumitted him.\" That happened at the time when Abu Huraira recited (the following poetic verse):-- 'What a long tedious tiresome night! Nevertheless, it has delivered us From the land of Kufr (disbelief).",
      "usc_msa_ref": "707",
      "chain": [
        "30212",
        "20352",
        "11418",
        "11046",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-3726",
      "hadith_no": "3726",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا محمد بن بشر، حدثنا عبيد الله، قال حدثني أبو بكر بن سالم، عن سالم، عن عبد الله بن عمر  رضى الله عنهما  أن النبي صلى الله عليه وسلم قال ‏\"‏ أريت في المنام أني أنزع بدلو بكرة على قليب، فجاء أبو بكر فنزع ذنوبا أو ذنوبين نزعا ضعيفا، والله يغفر له، ثم جاء عمر بن الخطاب فاستحالت غربا، فلم أر عبقريا يفري فريه حتى روي الناس وضربوا بعطن ‏\"‏‏.‏ قال ابن جبير العبقري عتاق الزرابي‏.‏ وقال يحيى الزرابي الطنافس لها خمل رقيق ‏{‏مبثوثة‏}‏ كثيرة‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Prophet said, \"In a dream I saw myself drawing water from a well with a bucket. Abu Bakr came and drew a bucket or two weakly. May Allah forgive him. Then `Umar bin Al-Khattab came and the bucket turned into a very large one in his hands. I had never seen such a mighty person as he in doing such hard work till all the people drank to their satisfaction and watered their camels that knelt down there.",
      "usc_msa_ref": "31",
      "chain": [
        "30212",
        "20352",
        "11201",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-4659",
      "hadith_no": "4659",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق بن إبراهيم، أخبرنا محمد بن بشر، حدثنا عبد العزيز بن عمر بن عبد العزيز، قال حدثني نافع، عن ابن عمر  رضى الله عنهما  قال نزل تحريم الخمر وإن في المدينة يومئذ لخمسة أشربة، ما فيها شراب العنب‏.‏",
      "text_en": " Narrated Ibn `Umar:                     (The Verse of) prohibiting alcoholic drinks was revealed when there were in Medina five kinds of (alcoholic) drinks none of which was produced from grapes.",
      "usc_msa_ref": "140",
      "chain": [
        "30123",
        "20352",
        "20166",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-bukhari-5885",
      "hadith_no": "5885",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، أخبرنا محمد بن بشر، حدثنا مسعر، عن سعد بن إبراهيم، عن أبيه، عن سعد، قال رأيت بشمال النبي صلى الله عليه وسلم وبيمينه رجلين عليهما ثياب بيض يوم أحد، ما رأيتهما قبل ولا بعد‏.‏",
      "text_en": " Narrated Sa`d:                     On the day of the battle of Uhud, on the right and on the left of the Prophet were two men wearing white clothes, and I had neither seen them before, nor did I see them afterwards.",
      "usc_msa_ref": "716",
      "chain": [
        "30021",
        "20352",
        "20359",
        "11063",
        "584",
        "9"
      ]
    },
    {
      "id": "sahih-bukhari-6265",
      "hadith_no": "6265",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا ابن نمير، حدثنا محمد بن بشر، حدثنا إسماعيل، قلت لابن أبي أوفى رأيت إبراهيم ابن النبي صلى الله عليه وسلم قال مات صغيرا، ولو قضي أن يكون بعد محمد صلى الله عليه وسلم نبي عاش ابنه، ولكن لا نبي بعده‏.‏",
      "text_en": " Narrated Isma`il:                     I asked Abi `Aufa, \"Did you see Ibrahim, the son of the Prophet ?\" He said, \"Yes, but he died in his early childhood. Had there been a Prophet after Muhammad then his son would have lived, but there is no Prophet after him.\"",
      "usc_msa_ref": "214",
      "chain": [
        "30212",
        "20352",
        "11418"
      ]
    },
    {
      "id": "sahih-bukhari-7212",
      "hadith_no": "7212",
      "source": "Sahih Bukhari",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا محمد بن بشر، حدثنا مسعر، حدثنا سعد بن إبراهيم، عن أبيه، عن أبي بكرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يدخل المدينة رعب المسيح، لها يومئذ سبعة أبواب، على كل باب ملكان ‏\"‏‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30026",
        "20352",
        "20359",
        "11063",
        "584",
        "3229"
      ]
    },
    {
      "id": "sahih-bukhari-7273",
      "hadith_no": "7273",
      "source": "Sahih Bukhari",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا ابن نمير، حدثنا محمد بن بشر، حدثنا إسماعيل، حدثنا سلمة بن كهيل، عن عطاء، عن جابر، قال بلغ النبي صلى الله عليه وسلم أن رجلا من أصحابه أعتق غلاما عن دبر، لم يكن له مال غيره، فباعه بثمانمائة درهم، ثم أرسل بثمنه إليه‏.‏",
      "text_en": " Narrated Jabir:                     The Prophet came to know that one of his companions had given the promise of freeing his slave after his death, but as he had no other property than that slave, the Prophet sold that slave for 800 dirhams and sent the price to him.",
      "usc_msa_ref": "296",
      "chain": [
        "30212",
        "20352",
        "11418",
        "11350",
        "11029",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-107",
      "hadith_no": "107",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا محمد بن بشر، حدثنا أبو حيان التيمي، بهذا الإسناد مثله غير أن في روايته ‏\"‏ إذا ولدت الأمة بعلها ‏\"‏ يعني السراري ‏.‏",
      "text_en": " This hadith is narrated to us on the authority of Muhammad b. 'Abdullah b. Numair, on the authority of Muhammad b. Bishr, on the authority of Abd Hayyan al-Taymi with the exception that in this narration (instead of the words (Iza Waladat al'amah rabbaha), the words are (Iza Waladat al'amah Ba'laha), i, e, when slave-girl gives birth to her master.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20352",
        "11404"
      ]
    },
    {
      "id": "sahih-muslim-224",
      "hadith_no": "224",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، وعبد الله بن نمير، قالا حدثنا عبيد الله بن عمر، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا كفر الرجل أخاه فقد باء بها أحدهما ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Ibn 'Umar that the Apostle (may peace and blessings be upon him) observed:                      When a man calls his brother an unbeliever, it returns (at least) to one of them.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "20331",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-501",
      "hadith_no": "501",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، - واتفقا في سياق الحديث إلا ما يزيد أحدهما من الحرف بعد الحرف - قالا حدثنا محمد بن بشر حدثنا أبو حيان عن أبي زرعة عن أبي هريرة قال أتي رسول الله صلى الله عليه وسلم يوما بلحم فرفع إليه الذراع وكانت تعجبه فنهس منها نهسة فقال ‏\"‏ أنا سيد الناس يوم القيامة وهل تدرون بم ذاك يجمع الله يوم القيامة الأولين والآخرين في صعيد واحد فيسمعهم الداعي وينفذهم البصر وتدنو الشمس فيبلغ الناس من الغم والكرب ما لا يطيقون وما لا يحتملون فيقول بعض الناس لبعض ألا ترون ما أنتم فيه ألا ترون ما قد بلغكم ألا تنظرون من يشفع لكم إلى ربكم فيقول بعض الناس لبعض ائتوا آدم ‏.‏ فيأتون آدم فيقولون يا آدم أنت أبو البشر خلقك الله بيده ونفخ فيك من روحه وأمر الملائكة فسجدوا لك اشفع لنا إلى ربك ألا ترى إلى ما نحن فيه ألا ترى إلى ما قد بلغنا فيقول آدم إن ربي غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله وإنه نهاني عن الشجرة فعصيته نفسي نفسي اذهبوا إلى غيري اذهبوا إلى نوح ‏.‏ فيأتون نوحا فيقولون يا نوح أنت أول الرسل إلى الأرض وسماك الله عبدا شكورا اشفع لنا إلى ربك ألا ترى ما نحن فيه ألا ترى ما قد بلغنا فيقول لهم إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله وإنه قد كانت لي دعوة دعوت بها على قومي نفسي نفسي اذهبوا إلى إبراهيم صلى الله عليه وسلم ‏.‏ فيأتون إبراهيم فيقولون أنت نبي الله وخليله من أهل الأرض اشفع لنا إلى ربك ألا ترى إلى ما نحن فيه ألا ترى إلى ما قد بلغنا فيقول لهم إبراهيم إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولا يغضب بعده مثله ‏.‏ وذكر كذباته نفسي نفسي اذهبوا إلى غيري اذهبوا إلى موسى ‏.‏ فيأتون موسى صلى الله عليه وسلم فيقولون يا موسى أنت رسول الله فضلك الله برسالاته وبتكليمه على الناس اشفع لنا إلى ربك ألا ترى إلى ما نحن فيه ألا ترى ما قد بلغنا فيقول لهم موسى صلى الله عليه وسلم إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله وإني قتلت نفسا لم أومر بقتلها نفسي نفسي اذهبوا إلى عيسى صلى الله عليه وسلم ‏.‏ فيأتون عيسى فيقولون يا عيسى أنت رسول الله وكلمت الناس في المهد وكلمة منه ألقاها إلى مريم وروح منه فاشفع لنا إلى ربك ألا ترى ما نحن فيه ألا ترى ما قد بلغنا فيقول لهم عيسى صلى الله عليه وسلم إن ربي قد غضب اليوم غضبا لم يغضب قبله مثله ولن يغضب بعده مثله - ولم يذكر له ذنبا - نفسي نفسي اذهبوا إلى غيري اذهبوا إلى محمد صلى الله عليه وسلم فيأتوني فيقولون يا محمد أنت رسول الله وخاتم الأنبياء وغفر الله لك ما تقدم من ذنبك وما تأخر اشفع لنا إلى ربك ألا ترى ما نحن فيه ألا ترى ما قد بلغنا فأنطلق فآتي تحت العرش فأقع ساجدا لربي ثم يفتح الله على ويلهمني من محامده وحسن الثناء عليه شيئا لم يفتحه لأحد قبلي ثم يقال يا محمد ارفع رأسك سل تعطه اشفع تشفع ‏.‏ فأرفع رأسي فأقول يا رب أمتي أمتي ‏.‏ فيقال يا محمد أدخل الجنة من أمتك من لا حساب عليه من الباب الأيمن من أبواب الجنة وهم شركاء الناس فيما سوى ذلك من الأبواب والذي نفس محمد بيده إن ما بين المصراعين من مصاريع الجنة لكما بين مكة وهجر أو كما بين مكة وبصرى ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      Meat was one day brought to the Messenger of Allah (may peace be upon him) and a foreleg was offered to him, a part which he liked. He sliced with his teeth a piece out of it and said: I shall be the leader of mankind on the Day of Resurrection. Do you know why? Allah would gather in one plain the earlier and the later (of the human race) on the Day of Resurrection. Then the voice of the proclaimer would be heard by all of them and the eyesight would penetrate through all of them and the sun would come near. People would then experience a degree of anguish, anxiety and agony which they shall not be able to bear and they shall not be able to stand. Some people would say to the others: Don you see in which trouble you are? Don't you see what (misfortune) has overtaken you? Why don't you find one who should intercede for you with your Lord? Some would say to the others: Go to Adam. And they would go to Adam and say: O Adam, thou art the father of mankind. Allah created thee by His own Hand and breathed in thee of His spirit and ordered the angels to prostrate before thee. Intercede for us with thy Lord Don't you see in what (trouble) we are? Don't you see what (misfortune) has overtaken us? Adam would say: Verily, my Lord is angry, to an extent to which He had never been angry before nor would He be angry afterward. Verily, He forbade me (to go near) that tree and I disobeyed Him. I am concerned with my own self. Go to someone else; go to Noah. They would come to Noah and would say: O Noah, thou art the first of the Messengers (sent) on the earth (after Adam), and Allah named thee as a\" Grateful Servant,\" intercede for us with thy Lord. Don't you see in what (trouble) we are? Don't you see what (misfortune) has overtaken us? He would say: Verily, my Lord is angry today as He had never been angry before, and would never be angry afterwards. There had emanated a curse from me with which I cursed my people. I am concerned with only myself, I am concerned only with myself; you better go to Ibrahim (peace be upon him). They would go to Ibrahim and say: Thou art the apostle of Allah and His Friend amongst the inhabitants of the earth; intercede for us with thy Lord. Don't you see in which (trouble) we are? Don't you see what (misfortune) has overtaken us? Ibrahim would say to them: Verily, my Lord is today angry as He had never been angry before and would never be angry afterwards. and (Ibrahim) would mention his lies (and then say): I am concerned only with myself, I am concerned only with myself. You better go to someone else: go to Moses. They would come to Moses (peace be upon him) and say: O Moses, thou art Allah's messenger, Allah blessed thee with His messengership and His conversation amongst people. Intercede for us with thy Lord. Don't you see in what (trouble) we are? Don't you see what (misfortune) has overtaken us? Moses (peace be upon him) would say to them: Verily. my Lord is angry as He had never been angry before and would never be angry afterwards. I, in fact, killed a person whom I had not been ordered to kill. I am concerned with myself, I am concerned with myself. You better go to Jesus (peace be upon him). They would come to Jesus and would say: O Jesus, thou art the messenger of Allah and thou conversed with people in the cradle, (thou art) His Word which I-Ie sent down upon Mary. and (thou art) the Spirit from Him; so intercede for us with thy Lord. Don't you see (the trouble) in which we are? Don't you see (the misfortune) that has overtaken us? Jesus (peace be upon him) would say: Verily, my Lord is angry today as He had never been angry before or would ever be angry afterwards. He mentioned no sin of his. (He simply said: ) I am concerned with myself, I am concerned with myself; you go to someone else: better go to Muhammad (may peace be upon him). They would come to me and say: O Mahammad, thou art the messenger of Allah and the last of the apostles. Allah has pardoned thee all thy previous and later sins. Intercede for us with thy Lord; don't you see in which (trouble) we are? Don't you see what (misfortune) has overtaken us? I shall then set off and come below the Throne and fall down prostrate before my Lord; then Allah would reveal to me and inspire me with some of His Praises and Glorifications which He had not revealed to anyone before me. He would then say: Muhammad, raise thy head; ask and it would be granted; intercede and intercession would be accepted I would then raise my head and say: O my Lord, my people, my people. It would be said: O Muhammad, bring in by the right gate of Paradise those of your people who would have no account to render. They would share with the people some other door besides this door. The Holy Prophet then said: By Him in Whose Hand is the life of Muhammad, verify the distance between two door leaves of the Paradise is as great as between Mecca and Hajar, or as between Mecca and Busra.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11404",
        "11406",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-266-3",
      "hadith_no": "266",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر العبدي، حدثنا عبيد الله بن عمر، عن محمد بن يحيى بن حبان، عن عمه، واسع بن حبان، عن ابن عمر، قال رقيت على بيت أختي حفصة فرأيت رسول الله صلى الله عليه وسلم قاعدا لحاجته مستقبل الشام مستدبر القبلة ‏.‏",
      "text_en": " Abdullah b. Umar said:                      I went up to the roof of the house of my sister Hafsa and saw the Messenger of Allah (may peace be upon him) relieving himself facing Syria. with his back to the Qibla.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11201",
        "11222",
        "1321",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-289-2",
      "hadith_no": "289",
      "source": "Sahih Muslim",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، عن عمرو بن ميمون، قال سألت سليمان بن يسار عن المني، يصيب ثوب الرجل أيغسله أم يغسل الثوب فقال أخبرتني عائشة أن رسول الله صلى الله عليه وسلم كان يغسل المني ثم يخرج إلى الصلاة في ذلك الثوب وأنا أنظر إلى أثر الغسل فيه ‏.‏",
      "text_en": " 'Amr b. Maimun said:                      I asked Sulaiman b. Yasar whether the semen that gets on to the garment of a person should be washed or not. He replied: A'isha told me: The Messenger of Allah (may peace be upon him) washed the semen, and then went out for prayer in that very garment and I saw the mark of washing on it.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11439",
        "11005",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-487-2",
      "hadith_no": "487",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر العبدي، حدثنا سعيد بن أبي عروبة، عن قتادة، عن مطرف بن عبد الله بن الشخير، أن عائشة، نبأته أن رسول الله صلى الله عليه وسلم كان يقول في ركوعه وسجوده ‏\"‏ سبوح قدوس رب الملائكة والروح ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported that the Messenger of Allah (way peace he upon him) used to pronounce while bowing and prostrating himself:                      All Glorious, All Holy, Lord of the Angels and the Spirit.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11073",
        "11019",
        "11305"
      ]
    },
    {
      "id": "sahih-muslim-501-3",
      "hadith_no": "501",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وابن، نمير قالا حدثنا محمد بن بشر، حدثنا عبيد الله، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم كان يركز - وقال أبو بكر يغرز - العنزة ويصلي إليها ‏.‏ زاد ابن أبي شيبة قال عبيد الله وهى الحربة ‏.‏",
      "text_en": " Ibn Umar reported:                      The Apostle of Allah (may peace be upon him) set up (sutra), and Abu Bakr said: He implanted iron-tipped spear and said prayer towards its direction. Ibn Abu Shaiba made this addition to it:\" Ubaidullah said that it was a spear.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30212",
        "20352",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-1324",
      "hadith_no": "1324",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا عبيد الله بن عمر، عن نافع، عن ابن عمر، قال ربما قرأ رسول الله صلى الله عليه وسلم القرآن فيمر بالسجدة فيسجد بنا حتى ازدحمنا عنده حتى ما يجد أحدنا مكانا ليسجد فيه في غير صلاة ‏.‏",
      "text_en": " Ibn 'Umar reported:                      Sometimes the Messenger of Allah (may peace be upon him) recited the Qur'an, and would pass by (recite) the verse of sajda and performed prostration and he did this along with us, but we were so crowded in his company that none of us could find a place for performing prostration. (and it was done on occasions) other than prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-1519",
      "hadith_no": "1519",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر العبدي، حدثنا زكرياء بن أبي زائدة، حدثنا عبد الملك بن عمير، عن أبي الأحوص، قال قال عبد الله لقد رأيتنا وما يتخلف عن الصلاة إلا منافق قد علم نفاقه أو مريض إن كان المريض ليمشي بين رجلين حتى يأتي الصلاة - وقال - إن رسول الله صلى الله عليه وسلم علمنا سنن الهدى وإن من سنن الهدى الصلاة في المسجد الذي يؤذن فيه ‏.‏",
      "text_en": " 'Abdullah (b. Mas'ud) reported:                      I have seen the time when no one stayed away from prayer except a hypocrite, whose hypocrisy was well known, or a sick man, but it a sick man could walk between two persons (i. e. with the help of two persons with one on each side) he would come to prayer. And (further) said: The Messenger of Allah (may peace be upon him) taught us the paths of right guidance. among which is prayer in the mosque in which the Adzan is called.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11338",
        "11368",
        "20327"
      ]
    },
    {
      "id": "sahih-muslim-1558",
      "hadith_no": "1558",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، قال أبو بكر وحدثنا محمد بن بشر، عن زكرياء، كلاهما عن سماك، عن جابر بن سمرة، أن النبي صلى الله عليه وسلم كان إذا صلى الفجر جلس في مصلاه حتى تطلع الشمس حسنا ‏.‏",
      "text_en": " Simak narrated on the authority of Jabir b. Samura that when the Apostle of Allah (may peace be upon him) observed the dawn prayer, he sat at the place of worship till the sun had risen enough.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "20012",
        "20436",
        "20352",
        "10770",
        "393"
      ]
    },
    {
      "id": "sahih-muslim-1741",
      "hadith_no": "1741",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا ابن نمير، حدثنا محمد بن بشر، حدثنا محمد بن عمرو، حدثني محمد بن إبراهيم، عن علقمة بن وقاص، قال قلت لعائشة كيف كان يصنع رسول الله صلى الله عليه وسلم في الركعتين وهو جالس قالت كان يقرأ فيهما فإذا أراد أن يركع قام فركع ‏.‏",
      "text_en": " 'Abdullah b. Shaqiq reported:                      I asked 'A'isha whether the Apostle of Allah (may peace be upon him) observed (Nafl) sitting. She said: Yes, when the people had made him old.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20352",
        "11220",
        "11213",
        "11042"
      ]
    },
    {
      "id": "sahih-muslim-1775",
      "hadith_no": "1775",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا سعيد بن أبي عروبة، حدثنا قتادة، عن زرارة بن أوفى، عن سعد بن هشام، أنه قال انطلقت إلى عبد الله بن عباس فسألته عن الوتر ‏.‏ وساق الحديث بقصته وقال فيه قالت من هشام قلت ابن عامر ‏.‏ قالت نعم المرء كان عامر أصيب يوم أحد ‏.‏",
      "text_en": " Zurara b. Aufa reported that Sa'd b. Hisham was his neighbour and he informed him that he had divorced his wife and he narrated the hadith like the one transmitted by Sa'd. She ('A'isha) said:                      Who is Hisham? He said: The son of 'Amir. She said: What a fine man he was; he participated in the Battle of Uhud along with the Messenger of Allah (may peace be upon him). Hakim b. Aflah said: If I ever knew that you do not go to 'A'isha, I would not have informed you about her hadith (So that you would have gone to her and heard it from her orally).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11073",
        "11019",
        "11284",
        "11166"
      ]
    },
    {
      "id": "sahih-muslim-1942",
      "hadith_no": "1942",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثني إسماعيل بن أبي، خالد حدثني عبد الله بن عيسى، عن عبد الرحمن بن أبي ليلى، أخبرني أبى بن كعب، أنه كان جالسا في المسجد إذ دخل رجل فصلى فقرأ قراءة واقتص الحديث بمثل حديث ابن نمير ‏.‏",
      "text_en": " Ubayy b. Ka'b reported that the Apostle of Allah (may peace be upon him) was near the tank of Banu Ghifar that Gabriel came to him and said:                      Allah has commanded you to recite to your people the Qur'an in one dialect. Upon this he said: I ask from Allah pardon and forgiveness. My people are not capable of doing it. He then came for the second time and said: Allah has commanded you that you should recite the Qur'an to your people in two dialects. Upon this he (the Holy prophet) again said: I seek pardon and forgiveness from Allah, my people would not be able to do so. He (Gabriel) came for the third time and said: Allah has commanded you to recite the Qur'an to your people in three dialects. Upon this he said: I ask pardon and forgiveness from Allah. My people would not be able to do it. He then came to him for the fourth time and said: Allah has commanded you to recite the Qur'an to your people in seven dialects, and in whichever dialect they would recite, they would be right.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11418",
        "11361",
        "11196",
        "39"
      ]
    },
    {
      "id": "sahih-muslim-2041",
      "hadith_no": "2041",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وابن، نمير قالا حدثنا محمد بن بشر، حدثنا زكرياء، حدثني سماك بن حرب، عن جابر بن سمرة، قال كنت أصلي مع النبي صلى الله عليه وسلم الصلوات فكانت صلاته قصدا وخطبته قصدا ‏.‏ وفي رواية أبي بكر زكرياء عن سماك.",
      "text_en": " Jabir b. Samura reported:                      I used to observe prayer with the Apostle of Allah (may peace be upon him) and his prayer was of moderate length and his sermon too was of moderate length.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30212",
        "20352",
        "11338",
        "10770",
        "393"
      ]
    },
    {
      "id": "sahih-muslim-2104",
      "hadith_no": "2104",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Two Eids) - كتاب صلاة العيدين",
      "chapter_no": "9",
      "text_ar": "وحدثنا يحيى بن يحيى، أخبرنا يحيى بن زكرياء بن أبي زائدة، ح وحدثنا ابن، نمير حدثنا محمد بن بشر، كلاهما عن هشام، بهذا الإسناد ولم يذكرا في المسجد ‏.‏",
      "text_en": " This hadith has been narrated by Hisham with the same chain of transmitters but (the narrators) did not make mention of the mosque.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "30212",
        "20352"
      ]
    },
    {
      "id": "sahih-muslim-2181",
      "hadith_no": "2181",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، جميعا عن ابن بشر، - قال أبو بكر حدثنا محمد بن بشر العبدي، - عن عبيد الله بن عمر، قال حدثنا نافع، عن عبد الله، أن حفصة، بكت على عمر فقال مهلا يا بنية ألم تعلمي أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الميت يعذب ببكاء أهله عليه ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. 'Umar reported that Hafsa wept for 'Umar (when he was about to die). He ('Umar) said:                      Be quiet, my daughter. Don't you know that the Messenger of Allah (may peace be upon him) had said:\" The deceased is punished because of his family's weeping over the death\"?",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20436",
        "20352",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-2373",
      "hadith_no": "2373",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا محمد بن عبد الله بن نمير، حدثنا محمد بن بشر، حدثنا هشام، عن أبيه، عن عائشة، أن رجلا، أتى النبي صلى الله عليه وسلم فقال يا رسول الله إن أمي افتلتت نفسها ولم توص وأظنها لو تكلمت تصدقت أفلها أجر إن تصدقت عنها قال ‏\"‏ نعم ‏\"‏.‏",
      "text_en": "  'A'isha said that a person came to the Apostle of Allah (may peace be upon him) and said:                      My mother died suddenly without having made any will. I think she would have definitely given Sadaqa if she had been able to speak. Would she have a reward if I gave Sadaqa on her behalf? He (the Holy Prophet) said: Yes.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20352",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-2424",
      "hadith_no": "2424",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنا ابن نمير، حدثنا محمد بن بشر، حدثنا هشام، عن عباد بن حمزة، عن أسماء، أن النبي صلى الله عليه وسلم قال لها نحو حديثهم ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Asma' through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20352",
        "11065",
        "70"
      ]
    },
    {
      "id": "sahih-muslim-2569",
      "hadith_no": "2569",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر العبدي، حدثنا عبيد الله بن، عمر عن أبي الزناد، عن الأعرج، عن أبي هريرة، - رضى الله عنه - قال ذكر رسول الله صلى الله عليه وسلم الهلال فقال ‏\"‏ إذا رأيتموه فصوموا وإذا رأيتموه فأفطروا فإن أغمي عليكم فعدوا ثلاثين ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) narrated that the Messenger of Allah (may peace he upon him) made a mention of the new moon and (in this connection) said:                      Observe fast when you see it (the new moon) and break fast when you see it (the new moon of Shawwal), but when (the actual position of the month is) concealed from you (on account of cloudy sky), then count thirty days.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11201",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-2577",
      "hadith_no": "2577",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا إسماعيل بن أبي خالد، حدثني محمد بن سعد، عن سعد بن أبي وقاص، - رضى الله عنه - قال ضرب رسول الله صلى الله عليه وسلم بيده على الأخرى فقال ‏\"‏ الشهر هكذا وهكذا ‏\"‏ ‏.‏ ثم نقص في الثالثة إصبعا ‏.‏",
      "text_en": " Sa'd b. Abi Waqqas (Allah be pleased with him) said that the Messenger of Allah (may peace be upon him) struck his hand against the other and (then with the gesture of his two hands) said:                      The month is thus, thus (two times). He then withdrew (one of) his fingers at the third turn.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11418",
        "30008",
        "9"
      ]
    },
    {
      "id": "sahih-muslim-2672",
      "hadith_no": "2672",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا محمد بن أبي بكر المقدمي، حدثنا يحيى بن سعيد، عن التيمي، ح وحدثناه محمد بن المثنى، حدثنا ابن مهدي، حدثنا شعبة، وقال ابن المثنى، حدثنا أبو عامر، حدثنا هشام، وقال ابن المثنى، حدثنا سالم بن نوح، حدثنا عمر يعني ابن عامر، ح وحدثنا أبو بكر بن أبي شيبة حدثنا محمد بن بشر، عن سعيد، كلهم عن قتادة، بهذا الإسناد ‏.‏ نحو حديث همام غير أن في حديث التيمي وعمر بن عامر وهشام لثمان عشرة خلت وفي حديث سعيد في ثنتى عشرة ‏.‏ وشعبة لسبع عشرة أو تسع عشرة ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Qatada with the same chain of transmitters by different narrators (except this difference) that in the hadith transmitted by Taimi and Umar b. Amir and Hisham (the date of setting out is) 18th, and in the hadith transmitted by Sa'id it is the 12th, and in the one transmitted by Shu'ba it is the 17th or 19th.",
      "usc_msa_ref": "",
      "chain": [
        "30161",
        "20031",
        "11289",
        "30170",
        "20033",
        "20020",
        "20443",
        "20295",
        "20542",
        "30201",
        "20352"
      ]
    },
    {
      "id": "sahih-muslim-3666",
      "hadith_no": "3666",
      "source": "Sahih Muslim",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا سعيد بن أبي عروبة، عن قتادة، عن أبي الخليل، عن عبد الله بن الحارث، أن أم الفضل، حدثت أن نبي الله صلى الله عليه وسلم قال ‏\"‏ لا تحرم الرضعة أو الرضعتان أو المصة أو المصتان ‏\"‏ ‏.‏",
      "text_en": " Umm Fadl (Allah be pleased with her) reported that Allah's Apostle (may peace be upon him) said:                      Being suckled once or twice, or one suckling or two, do not make marriage unlawful.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11073",
        "11019",
        "11291",
        "912"
      ]
    },
    {
      "id": "sahih-muslim-3774",
      "hadith_no": "3774",
      "source": "Sahih Muslim",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وابن، حجر قالوا حدثنا إسماعيل، - يعنون ابن جعفر - عن محمد بن عمرو، عن أبي سلمة، عن فاطمة بنت قيس، ح وحدثناه أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا محمد بن عمرو، حدثنا أبو سلمة، عن فاطمة بنت قيس، قال كتبت ذلك من فيها كتابا قالت كنت عند رجل من بني مخزوم فطلقني البتة فأرسلت إلى أهله أبتغي النفقة ‏.‏ واقتصوا الحديث بمعنى حديث يحيى بن أبي كثير عن أبي سلمة ‏.‏ غير أن في حديث محمد بن عمرو ‏\"‏ لا تفوتينا بنفسك ‏\"‏ ‏.‏",
      "text_en": " Fatima bint Qais reported:                      I had been married to a person from Banu Makhzum and he divorced me with irrevocable divorce. I sent a message to his family asking for maintenance allowance, and the rest of the hadith has been transmitted with a slight change of words.",
      "usc_msa_ref": "",
      "chain": [
        "20379",
        "30367",
        "11220",
        "10567",
        "224",
        "30201",
        "20352",
        "11220",
        "10567",
        "224"
      ]
    },
    {
      "id": "sahih-muslim-3931",
      "hadith_no": "3931",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا زهير بن حرب، ومحمد بن المثنى، قالا حدثنا يحيى، وهو القطان ح وحدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، ح وحدثنا ابن نمير، حدثنا أبي كلهم، عن عبيد، الله عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ح. وحدثني زهير بن حرب، وعلي بن حجر، قالا حدثنا إسماعيل، ح وحدثنا أبو الربيع وأبو كامل قالا حدثنا حماد، - وهو ابن زيد - جميعا عن أيوب، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ح. وحدثنا ابن المثنى، وابن أبي عمر، قالا حدثنا عبد الوهاب، قال سمعت يحيى، بن سعيد ح وحدثنا ابن رافع، حدثنا ابن أبي فديك، أخبرنا الضحاك، كلاهما عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم ‏.‏ نحو حديث مالك عن نافع ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn 'Umar (Allah be pleased with them) through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "30170",
        "20031",
        "20031",
        "30201",
        "20352",
        "30212",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-3975",
      "hadith_no": "3975",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، قالا حدثنا محمد بن، بشر حدثنا عبيد الله، عن نافع، أن عبد الله، أخبره أن النبي صلى الله عليه وسلم نهى عن المزابنة بيع ثمر النخل بالتمر كيلا وبيع العنب بالزبيب كيلا وبيع الزرع بالحنطة كيلا ‏.‏",
      "text_en": " 'Abdullah (b. Umar) reported that Allah's Apostle (may peace be upon him) forbade Muzabana, i. e. buying of fresh dates (on) the trees for dry dates by measure, and the buying of grapes for raisins by measure and the selling of field of corn for corn by measure.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30212",
        "20352",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-3983",
      "hadith_no": "3983",
      "source": "Sahih Muslim",
      "chapter": "The Book of Transactions - كتاب البيوع",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا يحيى بن سعيد، ح وحدثنا ابن نمير، حدثنا أبي، جميعا عن عبيد الله، ح وحدثنا أبو بكر بن أبي شيبة، - واللفظ له - حدثنا محمد بن بشر، حدثنا عبيد الله، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أيما نخل اشتري أصولها وقد أبرت فإن ثمرها للذي أبرها إلا أن يشترط الذي اشتراها‏\"‏ ‏.‏",
      "text_en": " Nafi reported on the authority of Ibn Umar (Allah be pleased with them) that the Messenger of Allah (may peace be upon him) said:                      Whichever tree is bought with its roots, and if it is fecundatedits fruit would belong to one who has grafted it except when the provision is laid down by the buyer.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20031",
        "30212",
        "11201",
        "20352",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-4268",
      "hadith_no": "4268",
      "source": "Sahih Muslim",
      "chapter": "The Book of Gifts - كتاب الهبات",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن أبي حيان، عن الشعبي، عن النعمان بن بشير، ح. وحدثنا محمد بن عبد الله بن نمير، - واللفظ له - حدثنا محمد بن بشر، حدثنا أبو حيان التيمي، عن الشعبي، حدثني النعمان بن بشير، أن أمه بنت رواحة، سألت أباه بعض الموهبة من ماله لابنها فالتوى بها سنة ثم بدا له فقالت لا أرضى حتى تشهد رسول الله صلى الله عليه وسلم على ما وهبت لابني ‏.‏ فأخذ أبي بيدي وأنا يومئذ غلام فأتى رسول الله صلى الله عليه وسلم فقال يا رسول الله إن أم هذا بنت رواحة أعجبها أن أشهدك على الذي وهبت لابنها ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا بشير ألك ولد سوى هذا ‏\"‏ ‏.‏ قال نعم ‏.‏ فقال ‏\"‏ أكلهم وهبت له مثل هذا ‏\"‏ ‏.‏ قال لا ‏.‏ قال ‏\"‏ فلا تشهدني إذا فإني لا أشهد على جور ‏\"‏ ‏.‏",
      "text_en": " Nu'man b. Bashir reported that his mother bint Rawaha asked his (Nu'man's) father about donating some gifts from his property to his son. He deferred the matter by one year, and then set forth to do that. She (Nu'man's mother) said:                      I shall not be pleased unless you call Allah's Messenger (may peace be upon him) as witness to what you confer as a gift on your son. (Nu'man said): So father took hold of my hand and I was at that time a boy, and came to Allah's Messenger (may peace be upon him). and said: Allah's Messenger, the mother of this son (of mine), daughter of Rawaha wishes that I should call you witness to what I confer as gift to her son. Allah's Messenger (may pease be upon him) said: Bashir, have you any other son besides this (son of yours)? He said: Yes. He (the Holy Prophet) said: Have you given gifts to all of them like this? He said: No. Thereupon he (the Holy Prophet) said: Then call me not as witness, for I cannot be witness to an injustice.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20345",
        "11404",
        "11052",
        "274",
        "20352",
        "11404",
        "11052",
        "274"
      ]
    },
    {
      "id": "sahih-muslim-4284",
      "hadith_no": "4284",
      "source": "Sahih Muslim",
      "chapter": "The Book of Gifts - كتاب الهبات",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا حجاج بن أبي عثمان، ح وحدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، عن وكيع، عن سفيان، ح وحدثنا عبد الوارث بن عبد الصمد، حدثني أبي، عن جدي، عن أيوب، كل هؤلاء عن أبي الزبير، عن جابر، عن النبي صلى الله عليه وسلم بمعنى حديث أبي خيثمة وفي حديث أيوب من الزيادة قال جعل الأنصار يعمرون المهاجرين فقال رسول الله صلى الله عليه وسلم ‏\"‏ أمسكوا عليكم أموالكم ‏\"‏ ‏.‏",
      "text_en": " This hadith is narrated on the authority of Jabir through other chains of transmitters, but (with this addition of words) that thehadith transmitted on the authority of Ayyub (these words are found):                     \" The Helpers (Ansar) conferred the benefit of 'Umra, upon the Emigrants (Muhajirin), whereupon Allah's Messenger (may peace be upon him) said: Keep your property to yourselves.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11277",
        "30201",
        "30123",
        "20032",
        "20012",
        "20016",
        "11263",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-4308",
      "hadith_no": "4308",
      "source": "Sahih Muslim",
      "chapter": "The Book of Bequests - كتاب الوصية",
      "chapter_no": "26",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا محمد بن بشر، حدثنا هشام، عن أبيه، عن عائشة، أن رجلا، أتى النبي صلى الله عليه وسلم فقال يا رسول الله إن أمي افتلتت نفسها ولم توص وأظنها لو تكلمت تصدقت أفلها أجر إن تصدقت عنها قال ‏\"‏ نعم ‏\"‏.",
      "text_en": " A'isha (Allah be pleased with her) reported that a man came to Allah's Apostle (may peace be upon him) and said:                      Allah's Messenger, my mother died all of a sudden without making any will. I think if (she could have the opportunity) to speak she would have made a Sadaqa. Would there be any reward for her if I give charity on her behalf? He (the Holy Prophet) said: Yes.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20352",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-4424",
      "hadith_no": "4424",
      "source": "Sahih Muslim",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، ومحمد بن بشر، ح وحدثنا إسحاق بن إبراهيم، وعلي بن خشرم، قالا أخبرنا عيسى بن يونس، جميعا عن ابن أبي، عروبة بهذا الإسناد ‏.‏ وفي حديث عيسى ‏\"‏ ثم يستسعى في نصيب الذي لم يعتق غير مشقوق عليه ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated through another chain of transmitters (and the words are):                     \" He will be required to work (in order to secure freedom) for that por- tion in which he has not been emancipated, without overburdening him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20345",
        "20352",
        "30123",
        "30556",
        "20347"
      ]
    },
    {
      "id": "sahih-muslim-4568",
      "hadith_no": "4568",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، عن نافع بن عمر، عن ابن، أبي مليكة عن ابن عباس، أن رسول الله صلى الله عليه وسلم قضى باليمين على المدعى عليه ‏.‏",
      "text_en": " Ibn 'Abbas reported that Allah's Messenger (may peace be upon him) pronounced judgment on the basis of oath by the defendant.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "20203",
        "11090",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-4627",
      "hadith_no": "4627",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، وأبو أسامة ح وحدثني زهير، بن حرب وعبيد الله بن سعيد - يعني أبا قدامة السرخسي - قالا حدثنا يحيى، - وهو القطان - كلهم عن عبيد الله، ح وحدثنا محمد بن عبد الله بن نمير، - واللفظ له - حدثنا أبي، حدثنا عبيد الله، عن نافع، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا جمع الله الأولين والآخرين يوم القيامة يرفع لكل غادر لواء فقيل هذه غدرة فلان بن فلان ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Ibn 'Umar that the Messenger of Allah (may peace be upon him) said:                      When Allah will gather together, on the Day of Judgment, all the earlier and later generations of mankind, a flag will be raised (to mark off) every person guilty of breach of faith, and it will be announced that this is the perfidy of so and so, son of so and so (to attract the attention of people to his guilt).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "20318",
        "30022",
        "11201",
        "11905",
        "11201",
        "11014"
      ]
    },
    {
      "id": "sahih-muslim-4646",
      "hadith_no": "4646",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، وأبو أسامة قالا حدثنا عبيد، الله بن عمر عن نافع، عن ابن عمر، قال وجدت امرأة مقتولة في بعض تلك المغازي فنهى رسول الله صلى الله عليه وسلم عن قتل النساء والصبيان ‏.‏",
      "text_en": " It is narrated by Ibn 'Umar that a woman was found killed in one of these battles; so the Messenger of Allah (may peace be upon him) forbade the killing of women and children.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "20318",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-4748",
      "hadith_no": "4748",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، ومحمد بن بشر، عن الأعمش، بهذا الإسناد غير أنه قال فهو ينضح الدم عن جبينه ‏.‏",
      "text_en": " A version of the tradition with a slightly different wording has been narrated by another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20032",
        "20352"
      ]
    },
    {
      "id": "sahih-muslim-4829",
      "hadith_no": "4829",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، ح وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا ابن المثنى، حدثنا خالد يعني ابن الحارث، ح وحدثنا عبيد الله بن سعيد، حدثنا يحيى، - يعني القطان - كلهم عن عبيد الله بن عمر، ح وحدثنا أبو الربيع، وأبو كامل قالا حدثنا حماد بن زيد، ح وحدثني زهير بن حرب، حدثنا إسماعيل، جميعا عن أيوب، ح وحدثني محمد بن رافع، حدثنا ابن أبي فديك، أخبرنا الضحاك، - يعني ابن عثمان - ح وحدثنا هارون بن سعيد الأيلي، حدثنا ابن وهب، حدثني أسامة، كل هؤلاء عن نافع، عن ابن عمر، مثل حديث الليث عن نافع، ‏.‏",
      "text_en": " This tradition has been narrated through more; than one chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "30212",
        "20331",
        "20226",
        "30359",
        "11201",
        "30137",
        "20022"
      ]
    },
    {
      "id": "sahih-muslim-5270",
      "hadith_no": "5270",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر العبدي، عن حجاج بن أبي، عثمان عن يحيى بن أبي كثير، بهذا الإسناد مثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Yahya b. Abu Kathir with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11277"
      ]
    },
    {
      "id": "sahih-muslim-5507",
      "hadith_no": "5507",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثناه قتيبة، ومحمد بن رمح، عن الليث بن سعد، ح وحدثنيه علي بن حجر، السعدي حدثنا إسماعيل، - يعني ابن علية - عن أيوب، ح وحدثنا ابن نمير، حدثنا محمد، بن بشر ح وحدثنا محمد بن المثنى، حدثنا يحيى بن سعيد، ح وحدثنا أبو بكر بن أبي، شيبة والوليد بن شجاع قالا حدثنا علي بن مسهر، عن عبيد الله، ح وحدثنا محمد بن، أبي بكر المقدمي حدثنا الفضيل بن سليمان، حدثنا موسى بن عقبة، ح .",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "30490",
        "20023",
        "20208",
        "11015",
        "30212",
        "20352",
        "30170",
        "20031",
        "20345"
      ]
    },
    {
      "id": "sahih-muslim-5551",
      "hadith_no": "5551",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا سعيد، بهذا الإسناد ولم يذكر في السفر ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Sa'd with the same chain of transmitters but there is no mention of the word\" journey\".",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352"
      ]
    },
    {
      "id": "sahih-muslim-5595",
      "hadith_no": "5595",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، ح وحدثنيه زهير بن حرب،حدثنا يحيى بن سعيد، ح وحدثنا ابن المثنى، حدثنا خالد بن الحارث، ح وحدثنا سهل،بن عثمان حدثنا عقبة بن خالد، كلهم عن عبيد الله، عن نافع، عن ابن عمر، عن النبي صلىالله عليه وسلم بهذا الحديث في خاتم الذهب وزاد في حديث عقبة بن خالد وجعله فييده اليمنى ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn 'Umar through other chains of transmitters but with a slight variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "20226",
        "20344",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-5813",
      "hadith_no": "5813",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا يحيى بن يحيى، أخبرنا عبد الله بن نمير، ح وحدثنا ابن نمير، حدثنا أبي، ح وحدثنا زهير بن حرب، حدثنا يحيى، - وهو القطان - ح وحدثنا ابن المثنى، حدثنا  عبد الوهاب، - يعني الثقفي - كلهم عن عبيد الله، ح وحدثنا أبو بكر بن أبي شيبة، - واللفظ له - حدثنا محمد بن بشر، وأبو أسامة وابن نمير قالوا حدثنا عبيد الله، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يقيم الرجل الرجل من مقعده ثم يجلس فيه ولكن تفسحوا وتوسعوا ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported Allah's Messenger (may peace be upon him) as saying:                      No person should ask another person to stand at his place and then he should himself sit there, but he should simply say: Make room and accommodate.",
      "usc_msa_ref": "",
      "chain": [
        "30399",
        "20331",
        "30212",
        "20331",
        "30022",
        "20031",
        "20259",
        "11201",
        "20352"
      ]
    },
    {
      "id": "sahih-muslim-5824",
      "hadith_no": "5824",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، وابن، نمير ح وحدثنا ابن، نمير حدثنا أبي ح، وحدثنا محمد بن المثنى، وعبيد الله بن سعيد، قالا حدثنا يحيى، - وهو ابن سعيد - كلهم عن عبيد الله، ح وحدثنا قتيبة، وابن، رمح عن الليث بن سعد، ح وحدثنا  أبو الربيع، وأبو كامل قالا حدثنا حماد، عن أيوب، ح وحدثنا ابن المثنى، حدثنا محمد، بن جعفر حدثنا شعبة، قال سمعت أيوب بن موسى، كل هؤلاء عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بمعنى حديث مالك ‏.‏",
      "text_en": " This hadith has been reported on the authority of lbn 'Umar through two different chains of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "30212",
        "30212",
        "20331",
        "30170",
        "30359",
        "20031",
        "11201",
        "30367",
        "30490",
        "20023",
        "30137"
      ]
    },
    {
      "id": "sahih-muslim-5849",
      "hadith_no": "5849",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب وإسحاق بن إبراهيم - قال إسحاق أخبرنا وقال أبو بكر، وأبو كريب - واللفظ لهما - حدثنا محمد بن بشر، عن مسعر، حدثنا  معبد بن خالد، عن ابن شداد، عن عائشة، أن رسول الله صلى الله عليه وسلم كان يأمرها أن تسترقي من العين ‏.‏",
      "text_en": " 'A'isha reported that Allah's Messenger (may peace be upon him) commanded the use of incantation for curing the influence of an evil eye.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30312",
        "20436",
        "20352",
        "20359",
        "11396",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-5882",
      "hadith_no": "5882",
      "source": "Sahih Muslim",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثنا ابن نمير، حدثنا أبي ومحمد بن بشر، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، ومحمد بن بشر، قالا حدثنا عبيد الله، عن نافع، عن ابن عمر، عن  النبي صلى الله عليه وسلم قال ‏\"‏ إن شدة الحمى من فيح جهنم فابردوها بالماء ‏\"‏ ‏.‏",
      "text_en": " Ibn Umar reported Allah's Apostle (may peace be upon him) as saying:                      Fever is due to vehemence of the heat of Hell, so cool it with water.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "30201",
        "20331",
        "20352",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-6126",
      "hadith_no": "6126",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا ابن نمير، حدثنا أبي ح، وحدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن، بشر قالا حدثنا عبيد الله، بهذا الإسناد ‏.‏ مثله وزاد قال عبيد الله فسألته فقال قريتين بالشام بينهما مسيرة ثلاث ليال ‏.‏ وفي حديث ابن بشر ‏.‏ ثلاثة أيام ‏.‏",
      "text_en": " A hadith like this has been transmitted on the authority, of 'Ubaidullah with this addition:                      Ubaidullah was asked (about these two names, i. e. Jarba' and Adhruh). He said: These are the two towns of Syria and there is between them the distance which can be covered in three nights, and the hadith transmitted on the authority of Ibn Bishr (the words are).\" Three days.\"",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20331",
        "30201",
        "20352"
      ]
    },
    {
      "id": "sahih-muslim-6144",
      "hadith_no": "6144",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، وأبو أسامة عن مسعر، عن  سعد بن إبراهيم، عن أبيه، عن سعد، قال رأيت عن يمين، رسول الله صلى الله عليه وسلم وعن شماله يوم أحد رجلين عليهما ثياب بياض ما رأيتهما قبل ولا بعد ‏.‏ يعني جبريل وميكائيل عليهما السلام ‏.‏",
      "text_en": " Sa'd reported that on the Day of Ubud I saw on the right side of Allah's Messenger (may peace be upon him) and on his left side two persons dressed in white clothes and whom I did not see before nor after that, and they were Gabriel and Michael (Allah be pleased with both of them).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "20318",
        "20359",
        "11063",
        "584",
        "9"
      ]
    },
    {
      "id": "sahih-muslim-6154",
      "hadith_no": "6154",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وابن، نمير قالا حدثنا محمد بن بشر، حدثنا زكرياء، حدثني سعيد، - وهو ابن أبي بردة - عن أنس، قال خدمت رسول الله صلى الله عليه وسلم تسع سنين فما أعلمه قال لي قط لم فعلت كذا وكذا ولا عاب على شيئا قط ‏.‏",
      "text_en": " Anas reported Allah's Messenger (may peace be upon him) as saying:                      I served the Messenger of Allah (may peace be upon him) for nine years, and I do not know (of any instance) when he said to me: Why you have done this and that, and he never found fault with me in anything.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30212",
        "20352",
        "11338",
        "11345",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-6205",
      "hadith_no": "6205",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، ح وحدثنا أبو كريب، حدثنا  أبو أسامة، وابن، بشر جميعا عن هشام، ح وحدثنا محمد بن عبد الله بن نمير، - واللفظ له - حدثنا محمد بن بشر، حدثنا هشام، عن أبيه، عن عائشة، أن الحارث بن هشام، سأل النبي صلى الله عليه وسلم كيف يأتيك الوحى فقال ‏\"‏ أحيانا يأتيني في مثل صلصلة الجرس وهو أشده على ثم يفصم عني وقد وعيته وأحيانا ملك في مثل صورة الرجل فأعي ما يقول ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported that Harith b. Hisham asked Allah's Apostle (may peace be upon him):                      How does the the wahi (inspiration) come to you? He said: At times it comes to me like the ringing of a bell and that is most severe for me and when it is over I retain that (what I had received in the form of wahi), and at times an Angel in the form of a human being comes to me (and speaks) and I retain whatever he speaks.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20005",
        "30216",
        "20318",
        "11065",
        "20352",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-6228",
      "hadith_no": "6228",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثنا سعيد بن منصور، حدثنا سفيان، وخالد بن عبد الله، ح وحدثنا ابن نمير، حدثنا محمد بن بشر، كلهم عن إسماعيل، عن أبي جحيفة، بهذا ولم يقولوا أبيض قد شاب ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Abu Juhaifa with a slight variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30116",
        "20005",
        "20423",
        "30212",
        "20352",
        "11418"
      ]
    },
    {
      "id": "sahih-muslim-6347",
      "hadith_no": "6347",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، - واللفظ لأبي بكر - قالا حدثنا محمد بن بشر، حدثنا عبيد الله بن عمر، حدثني أبو بكر بن سالم، عن سالم، بن عبد الله عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أريت كأني أنزع بدلو بكرة على قليب فجاء أبو بكر فنزع ذنوبا أو ذنوبين فنزع نزعا ضعيفا والله تبارك وتعالى يغفر له ثم جاء عمر فاستقى فاستحالت غربا فلم أر عبقريا من الناس يفري فريه حتى روي الناس وضربوا العطن ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. 'Umar reported Allah's Messenger (may peace be upon him) as saying:                      I saw (in a dream) as if I was drawing water with a leathern bucket on a wooden pulley. There came Abu Bakr and he drew out a bucketful or two and as he drew out, some weakness (was perceived in it) (may Allah, the Exalted and Glorious, forgive him). Then Umar came in order to serve water -and the bucket was changed into a large leather bucket and I did not see such a wonderful man amongst persons (drawing water) and he went on serving water to the people until they were fully satisfied and then went to their resting places.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11201",
        "11011",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-6387",
      "hadith_no": "6387",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، ح وحدثنا أبو بكر بن أبي شيبة، ح حدثنا وكيع، ح وحدثنا أبو كريب، وإسحاق الحنظلي، عن محمد بن بشر، عن مسعر، ح وحدثنا ابن أبي عمر، حدثنا سفيان، عن مسعر، كلهم عن  سعد بن إبراهيم، عن عبد الله بن شداد، عن علي، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Ali through another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "30201",
        "20032",
        "30216",
        "20352",
        "20359",
        "30421",
        "20005",
        "11063",
        "169"
      ]
    },
    {
      "id": "sahih-muslim-6414",
      "hadith_no": "6414",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، - واللفظ لأبي بكر - قالا حدثنا محمد بن بشر، عن زكرياء، عن مصعب بن شيبة، عن صفية بنت شيبة، قالت قالت عائشة خرج النبي صلى الله عليه وسلم غداة وعليه مرط مرحل من شعر أسود فجاء الحسن بن علي فأدخله ثم جاء الحسين فدخل معه ثم جاءت فاطمة فأدخلها ثم جاء علي فأدخله ثم قال ‏{‏ إنما يريد الله ليذهب عنكم الرجس أهل البيت ويطهركم تطهيرا‏}‏",
      "text_en": " 'A'isha reported that Allah's Apostle (may peace be upon him) went out one norning wearing a striped cloak of the black camel's hair that there came Hasan b. 'Ali. He wrapped hitn under it, then came Husain and he wrapped him under it along with the other one (Hasan). Then came Fatima and he took her under it, then came 'Ali and he also took him under it and then said:                      Allah only desires to take away any uncleanliness from you, O people of the household, and purify you (thorough purifying)",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11338",
        "10658",
        "2802"
      ]
    },
    {
      "id": "sahih-muslim-6441",
      "hadith_no": "6441",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثناه أبو كريب، حدثنا أبو أسامة، ح وحدثنا زهير بن حرب، حدثنا جرير، ح وحدثنا ابن نمير، حدثنا محمد بن بشر، كلهم عن هشام، بهذا الإسناد وقال في حديث جرير كنت ألعب بالبنات في بيته وهن اللعب ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Hisham with the same chain of transmitters with a slight variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "20318",
        "30022",
        "20028",
        "30212",
        "20352"
      ]
    },
    {
      "id": "sahih-muslim-6728",
      "hadith_no": "6728",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا محمد بن بشر، حدثنا هشام، عن أبيه، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تصيب المؤمن شوكة فما فوقها إلا قص الله بها من خطيئته ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported Allah's Messenger (may peace be upon him) as saying:                      A believer does not undergo (the trouble) of running a thorn or more than that when Allah effaces his sins.",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20352",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-muslim-6958",
      "hadith_no": "6958",
      "source": "Sahih Muslim",
      "chapter": "The Book of Knowledge - كتاب العلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، ح وحدثنا أبو كريب، حدثنا  عبدة، وأبو أسامة كلهم عن سعيد بن أبي عروبة، عن قتادة، عن أنس بن مالك، عن النبي صلى الله عليه وسلم ‏.‏ وفي حديث ابن بشر وعبدة لا يحدثكموه أحد بعدي سمعت رسول الله صلى الله عليه وسلم يقول فذكر بمثله ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Anas b. Malik through another chain of narrators, but with a slight variation of wording.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "30216",
        "20337",
        "11073",
        "11019",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-7089",
      "hadith_no": "7089",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب وإسحاق عن محمد بن بشر، عن مسعر، عن محمد بن عبد الرحمن، عن أبي رشدين، عن ابن عباس، عن جويرية، قالت مر بها رسول الله صلى الله عليه وسلم حين صلى صلاة الغداة أو بعد ما صلى الغداة ‏.‏ فذكر نحوه غير أنه قال ‏\"‏ سبحان الله عدد خلقه سبحان الله رضا نفسه سبحان الله زنة عرشه سبحان الله مداد كلماته ‏\"‏ ‏.‏",
      "text_en": " Juwairiya reported that Allah's Messenger (may peace be upon him) happened to pass by her as she was observing her dawn prayer; or after she had observed her dawn prayer. The rest of the hadith is the same but with this variation that he said:                     \" Hallowed be Allah according to the number of His creation, hallowed be Allah according to the pleasure of His Self, hallowed be Allah according to the weight of His Throne, hallowed be Allah according to the ink used in recording His words.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "20359",
        "11105",
        "17",
        "20216"
      ]
    },
    {
      "id": "sahih-muslim-7099",
      "hadith_no": "7099",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "وحدثنا عبد بن حميد، أخبرنا محمد بن بشر العبدي، حدثنا سعيد بن أبي عروبة، عن قتادة، أن أبا العالية الرياحي، حدثهم عن ابن عباس، أن رسول الله صلى الله عليه وسلم كان يدعو بهن ويقولهن عند الكرب فذكر بمثل حديث معاذ بن هشام عن أبيه عن قتادة غير أنه قال ‏\"‏ رب السموات والأرض ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas reported that Allah's Messenger (may peace be upon him) used to supplicate (with these words) and he (uttered these words) at the time of trouble; the rest of the hadith is the same except with this difference that insted of saying:                     \" The Lord of heaven and the earth,\" he said:\" The Lord of the heaven and that of the earth.\"",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20352",
        "11073",
        "11019",
        "11424",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-7272",
      "hadith_no": "7272",
      "source": "Sahih Muslim",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، ومحمد بن بشر، قالا حدثنا  زكرياء بن أبي زائدة، عن سعد بن إبراهيم، حدثني ابن كعب بن مالك، عن أبيه، كعب قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مثل المؤمن كمثل الخامة من الزرع تفيئها الريح وتصرعها مرة وتعدلها أخرى حتى تهيج ومثل الكافر كمثل الأرزة المجذية على أصلها لا يفيئها شىء حتى يكون انجعافها مرة واحدة ‏\"‏ ‏.‏",
      "text_en": " Ka'b reported that Allah's Messenger (may peace be upon him) said that the similitude of a believer is that of a standing crop in a field which is shaken by wind and then it comes to its original position but it stands at its roots. The similitude of a non-believer is that of a cypress tree which stands on its roots and nothing shakes it but it is uprooted (with) one (violent stroke).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20331",
        "20352",
        "11338",
        "11063"
      ]
    },
    {
      "id": "sahih-muslim-7340",
      "hadith_no": "7340",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، وعبد الله بن نمير، وعلي بن مسهر، عن عبيد الله بن عمر، ح وحدثنا محمد بن عبد الله بن نمير، حدثنا محمد بن بشر، حدثنا  عبيد الله، عن خبيب بن عبد الرحمن، عن حفص بن عاصم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ سيحان وجيحان والفرات والنيل كل من أنهار الجنة ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Saihan, Jaihan, Euphrates and Nile are all among the rivers of Paradise.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20318",
        "20331",
        "20345",
        "11201",
        "30212",
        "20352",
        "11201",
        "11159",
        "11420",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-7519",
      "hadith_no": "7519",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا عبيد الله، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ لتقاتلن اليهود فلتقتلنهم حتى يقول الحجر يا مسلم هذا يهودي فتعال فاقتله ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported Allah's Messenger (may peace be upon him) as saying:                      You will fight against the Jews and you will kill them until even a stone would say: Come here, Muslim, there is a Jew (hiding himself behind me) ; kill him.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-7545",
      "hadith_no": "7545",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو أسامة، ومحمد بن بشر، قالا حدثنا عبيد، الله عن نافع، عن ابن عمر، ح   وحدثنا ابن نمير، - واللفظ له - حدثنا محمد بن بشر، حدثنا عبيد الله، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم ذكر الدجال بين ظهرانى الناس فقال ‏\"‏ إن الله تعالى ليس بأعور ‏.‏ ألا وإن المسيح الدجال أعور العين اليمنى كأن عينه عنبة طافئة ‏\"‏ ‏.‏",
      "text_en": " Ibn Umar reported that Allah's Messenger (may peace be upon him). made a mention of Dajjal in the presence of the people and said:                      Allah is not one-eyed and behold that Dajjal is blind of the right eye and his eye would be like a floating grape.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20318",
        "20352",
        "11201",
        "11014",
        "18",
        "30212",
        "20352",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sahih-muslim-7570",
      "hadith_no": "7570",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، عن أبي حيان، عن أبي زرعة، عن عبد الله بن عمرو، قال حفظت من رسول الله صلى الله عليه وسلم حديثا لم أنسه بعد سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن أول الآيات خروجا طلوع الشمس من مغربها وخروج الدابة على الناس ضحى وأيهما ما كانت قبل صاحبتها فالأخرى على إثرها قريبا ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. 'Amr reported:                      I committed to memory a hadith from Allah's Messenger (may peace be upon him) and I did not forget it after I had heard Allah's Messenger (may peace be upon him) as saying: The first sign (nut of the signs of the appearance of the Dajjal) would be the appearance of the sun from the west, the appearance of the beast before the people in the forenoon and whkch of the two hap- pens first, the second one would follow immediately after that.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11404",
        "11406",
        "29"
      ]
    },
    {
      "id": "sunan-abi-daud-137",
      "hadith_no": "137",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا محمد بن بشر، حدثنا هشام بن سعد، حدثنا زيد، عن عطاء بن يسار، قال قال لنا ابن عباس أتحبون أن أريكم، كيف كان رسول الله صلى الله عليه وسلم يتوضأ فدعا بإناء فيه ماء فاغترف غرفة بيده اليمنى فتمضمض واستنشق ثم أخذ أخرى فجمع بها يديه ثم غسل وجهه ثم أخذ أخرى فغسل بها يده اليمنى ثم أخذ أخرى فغسل بها يده اليسرى ثم قبض قبضة من الماء ثم نفض يده ثم مسح بها رأسه وأذنيه ثم قبض قبضة أخرى من الماء فرش على رجله اليمنى وفيها النعل ثم مسحها بيديه يد فوق القدم ويد تحت النعل ثم صنع باليسرى مثل ذلك ‏.‏",
      "text_en": " ‘Ata’ b. Yasar quoting Ibn ‘Abbas said:                      Do you like that I should show you how the Messenger of Allah (ﷺ) performed ablution? He then called for a vessel of water and took out a handful of water with his right hand. He then rinsed his mouth and snuffed up water. He then took out another handful of water and washed his face by both his hands together. He then took out another handful of water and washed his right hand and then washed his left hand by taking out another. He then took out some water and shook off his hand and wiped his head and ears with it. He then took out a handful of water and sprinkled it over his right foot in his shoe and wiped the upper part of the foot with his one hand, and beneath the shoe with his other hand. He then did the same with his left foot.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20352",
        "20519",
        "15",
        "11020"
      ]
    },
    {
      "id": "sunan-abi-daud-348",
      "hadith_no": "348",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا محمد بن بشر، حدثنا زكريا، حدثنا مصعب بن شيبة، عن طلق بن حبيب العنزي، عن عبد الله بن الزبير، عن عائشة، أنها حدثته أن النبي صلى الله عليه وسلم كان يغتسل من أربع من الجنابة ويوم الجمعة ومن الحجامة ومن غسل الميت ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Prophet (ﷺ) would take a bath because of sexual defilement on Friday, after opening a vein and after washing a dead body.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20352",
        "11338",
        "10658",
        "10692",
        "106",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-714",
      "hadith_no": "714",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا محمد بن بشر، ح قال أبو داود وحدثنا القعنبي، حدثنا عبد العزيز، - يعني ابن محمد وهذا لفظه - عن محمد بن عمرو، عن أبي سلمة، عن عائشة، أنها قالت كنت أنام وأنا معترضة، في قبلة رسول الله صلى الله عليه وسلم فيصلي رسول الله صلى الله عليه وسلم وأنا أمامه فإذا أراد أن يوتر ‏.‏ زاد عثمان غمزني ثم اتفقا فقال ‏\"‏ تنحى ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     I used to sleep lying between the Messenger of Allah (ﷺ) and the qiblah. The Messenger of Allah (ﷺ) used to pray when I (was lying) in front of him. When he wanted to offer the witr prayer - added by the narrator Uthman - he pinched me - then the narrators are agreed - and said: Set aside.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20352",
        "30002",
        "20164",
        "20167",
        "11220",
        "10567",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-1344",
      "hadith_no": "1344",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا محمد بن بشر، حدثنا سعيد، بهذا الحديث قال ‏:‏ يسلم تسليما يسمعنا كما قال يحيى بن سعيد ‏.‏",
      "text_en": " The above tradition has also been transmitted by Yahya b. Sa'id to the same effect. The version adds the words:                      \"He uttered the salutation so loudly that we could hear it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20352",
        "11168"
      ]
    },
    {
      "id": "sunan-abi-daud-2925",
      "hadith_no": "2925",
      "source": "Sunan Abi Da'ud",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا محمد بن بشر، وابن، نمير وأبو أسامة عن زكريا، عن سعد بن إبراهيم، عن أبيه، عن جبير بن مطعم، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا حلف في الإسلام وأيما حلف كان في الجاهلية لم يزده الإسلام إلا شدة ‏\"‏ ‏.‏",
      "text_en": " Narrated Jubair b. Mu'tim:                     The Messenger of Allah (ﷺ) as saying: There is no alliance in Islam, and Islam strengthened the alliance made during pre-Islamic days.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20352",
        "11338",
        "11063",
        "584",
        "871"
      ]
    },
    {
      "id": "sunan-abi-daud-3077",
      "hadith_no": "3077",
      "source": "Sunan Abi Da'ud",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا محمد بن بشر، حدثنا سعيد، عن قتادة، عن الحسن، عن سمرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من أحاط حائطا على أرض فهي له ‏\"‏ ‏.‏",
      "text_en": " Narrated Samurah:                     The Prophet (ﷺ) said: If anyone surrounds a land with a wall, it belongs to him.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20352",
        "11168",
        "11019",
        "11016",
        "394"
      ]
    },
    {
      "id": "sunan-abi-daud-3160",
      "hadith_no": "3160",
      "source": "Sunan Abi Da'ud",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا محمد بن بشر، حدثنا زكريا، حدثنا مصعب بن شيبة، عن طلق بن حبيب العنزي، عن عبد الله بن الزبير، عن عائشة، أنها حدثته أن النبي صلى الله عليه وسلم كان يغتسل من أربع من الجنابة ويوم الجمعة ومن الحجامة وغسل الميت ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Prophet (ﷺ) used to take a bath on account of sexual defilement, on Friday, for cupping and washing the dead.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20352",
        "11338",
        "10658",
        "10692",
        "106",
        "53"
      ]
    },
    {
      "id": "sunan-abi-daud-3870",
      "hadith_no": "3870",
      "source": "Sunan Abi Da'ud",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا محمد بن بشر، حدثنا يونس بن أبي إسحاق، عن مجاهد، عن أبي هريرة، قال نهى رسول الله صلى الله عليه وسلم عن الدواء الخبيث ‏.‏",
      "text_en": " Narrated Abu Hurayrah:                     The Messenger of Allah (ﷺ) prohibited unclean medicine.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20352",
        "10846",
        "11028",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-3938",
      "hadith_no": "3938",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا نصر بن علي، أخبرنا يزيد، - يعني ابن زريع - ح وحدثنا علي بن عبد الله، حدثنا محمد بن بشر، - وهذا لفظه - عن سعيد بن أبي عروبة، عن قتادة، عن النضر بن أنس، عن بشير بن نهيك، عن أبي هريرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أعتق شقصا له - أو شقيصا له - في مملوك فخلاصه عليه في ماله إن كان له مال فإن لم يكن له مال قوم العبد قيمة عدل ثم استسعي لصاحبه في قيمته غير مشقوق عليه ‏\"‏ ‏.‏ قال أبو داود في حديثهما جميعا ‏\"‏ فاستسعي غير مشقوق عليه ‏\"‏ ‏.‏ وهذا لفظ علي ‏.‏",
      "text_en": " Abu Hurairah reported the Prophet (ﷺ) as saying:                      If anyone emancipates his share in a slave, he is to be completely emancipated by his money if he has money. But if he has no money, a fair price for the slave should be fixed, and the slave is required to work for his master according to the proportion of his price, but he must not be overburdened.Abu Dawud said: In the version of both the narrators the words are \"he will be required to work and must not be overburdened\". This is the version of 'Ali.",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20304",
        "30026",
        "20352",
        "11073",
        "11019",
        "11310",
        "11266",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-4838",
      "hadith_no": "4838",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا محمد بن بشر، عن مسعر، قال سمعت شيخا، في المسجد يقول سمعت جابر بن عبد الله، يقول كان في كلام رسول الله صلى الله عليه وسلم ترتيل أو ترسيل ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Messenger of Allah (ﷺ) spoke in a distinct and leisurely manner.",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20352",
        "20359",
        "34"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1770-3",
      "hadith_no": "1770",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Clothing - كتاب اللباس",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو كريب، حدثنا ابن المبارك، ومحمد بن بشر، وعبد الله بن إسماعيل بن أبي خالد، عن سعيد بن أبي عروبة، عن قتادة، عن أبي المليح، عن أبيه، أن النبي صلى الله عليه وسلم نهى عن جلود السباع أن تفترش ‏.‏",
      "text_en": " Narrated Abu Al-Malih:                     From his father: \"The Prophet (ﷺ) prohibited using predator skins as a spread.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20025",
        "20352",
        "11073",
        "11019",
        "11453",
        "4001"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2140",
      "hadith_no": "2140",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو كريب، حدثنا عبدة بن سليمان، وعبد الرحيم، ومحمد بن بشر، عن محمد بن عمرو، حدثنا أبو سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الحياء من الإيمان والإيمان في الجنة والبذاء من الجفاء والجفاء في النار ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن ابن عمر وأبي بكرة وأبي أمامة وعمران بن حصين ‏.‏ هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah said:                     \"Al-Haya is from faith, and faith is in Paradise. Obscenity is from rudeness, and rudeness is in the Fire.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20337",
        "20334",
        "20352",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2302",
      "hadith_no": "2302",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Al-Qadar - كتاب القدر عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "32",
      "text_ar": "حدثنا محمد بن رافع، حدثنا محمد بن بشر، حدثنا سلام بن أبي عمرة، عن عكرمة، عن ابن عباس، عن النبي صلى الله عليه وسلم ‏.‏ قال محمد بن رافع وأخبرنا محمد بن بشر أخبرنا علي بن نزار عن نزار عن عكرمة عن ابن عباس عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20352",
        "11023",
        "17"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3562",
      "hadith_no": "3562",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا محمد بن بشر، ويعلى بن عبيد، عن حجاج بن دينار، عن أبي غالب، عن أبي أمامة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما ضل قوم بعد هدى كانوا عليه إلا أوتوا الجدل ‏\"‏ ‏.‏ ثم تلا رسول الله صلى الله عليه وسلم هذه الآية ‏:‏ ‏(‏ما ضربوه لك إلا جدلا بل هم قوم خصمون ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح إنما نعرفه من حديث حجاج بن دينار ‏.‏ وحجاج ثقة مقارب الحديث وأبو غالب اسمه حزور ‏.‏",
      "text_en": " Narrated Abu Umamah:                     that the Messenger of Allah (ﷺ) said: \"No people go astray after having been guided, but they resort to arguing.\" Then the Messenger of Allah (ﷺ) recited this Ayah: '...They quoted not the above example except for argument. Nay! But they are quarrelsome people... (43:58)'",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20352",
        "20372",
        "20737",
        "405"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3583-2",
      "hadith_no": "3583",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا موسى بن حزام، وعبد بن حميد، وغير، واحد، قالوا حدثنا محمد بن بشر، فقال سمعت هانئ بن عثمان، عن أمه، حميضة بنت ياسر عن جدتها، يسيرة وكانت من المهاجرات قالت قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ عليكن بالتسبيح والتهليل والتقديس واعقدن بالأنامل فإنهن مسئولات مستنطقات ولا تغفلن فتنسين الرحمة ‏\"‏ ‏.‏ قال هذا حديث غريب إنما نعرفه من حديث هانئ بن عثمان وقد روى محمد بن ربيعة عن هانئ بن عثمان ‏.‏",
      "text_en": " Humaidah bint Yasir narrated from her grandmother Yusairah - and she was one of those who emigrated - she said:                     “The Messenger of Allah said to us: ‘Hold fast to At-Tasbih, At-Tahlil, and At-Taqdis,  and count them upon the fingertips, for indeed they shall be questioned, and they will be made to speak. And do not become heedless, so that you forget about the Mercy (of Allah).”",
      "usc_msa_ref": "",
      "chain": [
        "30394",
        "30553",
        "20352"
      ]
    },
    {
      "id": "jami-al-tirmidhi-4307",
      "hadith_no": "4307",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا عبد بن حميد، حدثنا محمد بن بشر العبدي، حدثنا عبد الله بن عبد الله بن الأسود، عن حصين بن عمر الأحمسي، عن مخارق بن عبد الله، عن طارق بن شهاب، عن عثمان بن عفان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من غش العرب لم يدخل في شفاعتي ولم تنله مودتي ‏\"‏ ‏.‏ قال هذا حديث غريب لا نعرفه إلا من حديث حصين بن عمر الأحمسي عن مخارق ‏.‏ وليس حصين عند أهل الحديث بذاك القوي ‏.‏",
      "text_en": " Narrated 'Uthman bin 'Affan:                     that the Messenger of Allah (ﷺ) said: \"Whoever cheats the Arabs, he will not be included in my intercession, and my love shall not reach him.\"",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20352",
        "25146",
        "25062",
        "11652",
        "3680",
        "4"
      ]
    },
    {
      "id": "sunan-an-nasai-882",
      "hadith_no": "882",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا محمد بن رافع، قال حدثنا محمد بن بشر، قال حدثنا فطر بن خليفة، عن عبد الجبار بن وائل، عن أبيه، أنه رأى النبي صلى الله عليه وسلم إذا افتتح الصلاة رفع يديه حتى تكاد إبهاماه تحاذي شحمة أذنيه ‏.‏",
      "text_en": " It was narrated from Abdul-Jabbar bin Wa'il, from his father, that:                     He saw the Prophet (ﷺ), when he started to pray, raise his hands until his thumbs were almost level with his earlobes.",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20352",
        "11718",
        "10940"
      ]
    },
    {
      "id": "sunan-an-nasai-1290",
      "hadith_no": "1290",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا محمد بن بشر، قال حدثنا مجمع بن يحيى، عن عثمان بن موهب، عن موسى بن طلحة، عن أبيه، قال قلنا يا رسول الله كيف الصلاة عليك قال ‏\"‏ قولوا اللهم صل على محمد وعلى آل محمد كما صليت على إبراهيم وآل إبراهيم إنك حميد مجيد وبارك على محمد وعلى آل محمد كما باركت على إبراهيم وآل إبراهيم إنك حميد مجيد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Musa bin Talha that:                     His father said: \"We said: 'O Messenger of Allah, how should we send salah upon you?' He said: 'Say: Alahumma salli 'ala Muhammad wa 'ala ali Muhammad, kama sallaita 'ala Ibrahima wa barik 'ala Muhammad kama barakta 'ala ali Ibrahim fil-'alamin, innaka hamidun majid (O Allah, send salah upon Muhammad and upon the family of Muhammad, as You sent salah upon the family of Ibrahim, and send blessings upon Muhammad and upon the family of Muhammad as You sent blessings upon the family of Ibrahim among the nations. You are indeed Worthy of praise, Full of glory.)'\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20352",
        "10821",
        "18716",
        "579",
        "6"
      ]
    },
    {
      "id": "sunan-an-nasai-1795",
      "hadith_no": "1795",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أحمد بن يحيى، قال حدثنا محمد بن بشر، قال حدثنا أبو يحيى، إسحاق بن سليمان الرازي عن المغيرة بن زياد، عن عطاء بن أبي رباح، عن عائشة، رضى الله عنها عن النبي صلى الله عليه وسلم قال ‏\"‏ من ثابر على اثنتى عشرة ركعة بنى الله عز وجل له بيتا في الجنة أربعا قبل الظهر وركعتين بعد الظهر وركعتين بعد المغرب وركعتين بعد العشاء وركعتين قبل الفجر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Aishah that:                     The Messenger of Allah (ﷺ) said: \"Whoever persists in praying twelve rak'ahs each day and night, Allah, the Mighty and Sublime, will build for him a house in Paradise: Four before Zuhr and two after Zuhr, two rak'ahs after Maghrib, two rak'ahs after Isha' and two rak'ahs of Fajr.\"",
      "usc_msa_ref": "",
      "chain": [
        "20352",
        "19947",
        "11029",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-2123",
      "hadith_no": "2123",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أبو بكر بن علي، صاحب حمص قال حدثنا أبو بكر بن أبي شيبة، قال حدثنا محمد بن بشر، قال حدثنا عبيد الله، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال ذكر رسول الله صلى الله عليه وسلم الهلال فقال ‏\"‏ إذا رأيتموه فصوموا وإذا رأيتموه فأفطروا فإن غم عليكم فعدوا ثلاثين ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah mentioned the crescent and said: 'When you see it, fast and when you see it, stop fasting, and if it is obscured from you (too cloudy), then count thirty days.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11201",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2135",
      "hadith_no": "2135",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا محمد بن بشر، عن إسماعيل بن أبي خالد، عن محمد بن سعد بن أبي وقاص، عن أبيه، عن النبي صلى الله عليه وسلم أنه ضرب بيده على الأخرى وقال ‏\"‏ الشهر هكذا وهكذا وهكذا ‏\"‏ ‏.‏ ونقص في الثالثة إصبعا ‏.‏",
      "text_en": " It was narrated form Muhammad bin Sad Abi Waqqas, from his father, that:                     the Prophet struck one hand with the other and said: \"The month is like this and like this and like this,\" retaining one finger the third time.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20352",
        "11418",
        "30008"
      ]
    },
    {
      "id": "sunan-an-nasai-2304",
      "hadith_no": "2304",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، عن محمد بن بشر، عن هشام بن عروة، عن أبيه، عن حمزة بن عمرو الأسلمي، أنه سأل رسول الله صلى الله عليه وسلم أصوم في السفر قال ‏\"‏ إن شئت فصم وإن شئت فأفطر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hamzah bin 'Amr Al-Aslami that he asked the Messenger of Allah:                     \"Should I fast while traveling?\" He said: \"If you wish then fast, and if you wish then do not fast.\"",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "20352",
        "11065",
        "10511",
        "4123"
      ]
    },
    {
      "id": "sunan-an-nasai-2599",
      "hadith_no": "2599",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا محمد بن بشر، قال أنبأنا شعبة، عن عبد الملك، عن زيد بن عقبة، عن سمرة بن جندب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن المسائل كدوح يكدح بها الرجل وجهه فمن شاء كدح وجهه ومن شاء ترك إلا أن يسأل الرجل ذا سلطان أو شيئا لا يجد منه بدا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Samurah bin Jundab said:                     \"The Messenger of Allah said: \"Every time a man begs, it will turn into lacerations on his face (on the Day of Resurrection). So whoever wants his face to be lacerated (let him ask), and whoever does not want that (let him not ask): except in the case of a man who asks a Sultan, or he asks when he can find no alternative.\"'",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20352",
        "20020",
        "11368",
        "15166",
        "394"
      ]
    },
    {
      "id": "sunan-an-nasai-3713",
      "hadith_no": "3713",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ar-Ruqba - كتاب الرقبى",
      "chapter_no": "33",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا محمد بن بشر، قال حدثنا حجاج، عن أبي الزبير، عن طاوس، عن ابن عباس، قال لا تصلح العمرى ولا الرقبى فمن أعمر شيئا أو أرقبه فإنه لمن أعمره وأرقبه حياته وموته ‏.‏ أرسله حنظلة ‏.‏",
      "text_en": " (A different chain) from Hajjaj, from Abu Az-Zubair, from Tawus, from Ibn 'Abbas, who said:                      \"'Umra and Ruqba are not proper. Whoever gives something on the basis of 'Umra or Ruqba, it belongs to the one to whom he gave it on that basis, both during his lifetime and after his death.\" Hanzalah narrated it in Mursal form.",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20352",
        "20219",
        "11263",
        "11053",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-3761",
      "hadith_no": "3761",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا أحمد بن سليمان الرهاوي، وموسى بن عبد الرحمن، قالا حدثنا محمد بن بشر، قال حدثنا سفيان، عن موسى بن عقبة، عن سالم بن عبد الله بن عمر، عن ابن عمر، قال كانت يمين يحلف عليها رسول الله صلى الله عليه وسلم ‏\"‏ لا ومقلب القلوب ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                      \"The oath by which the Messenger of Allah used to swear was: 'No, by the Controller of the hearts.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20352",
        "20012",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-4027",
      "hadith_no": "4027",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا محمد بن بشر، قال حدثنا سفيان، عن أيوب، عن أبي قلابة، عن أنس، قال أتى النبي صلى الله عليه وسلم نفر من عكل أو عرينة فأمر لهم - واجتووا المدينة - بذود أو لقاح يشربون ألبانها وأبوالها فقتلوا الراعي واستاقوا الإبل فبعث في طلبهم فقطع أيديهم وأرجلهم وسمل أعينهم ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"A group of men from 'Ukl, or 'Uraynah, came to the Prophet [SAW], and when the climate of Al-Madinah did not suit them, he told them to go to some camels and drink their milk and urine. Then they killed the herdsman and stole the camels. He sent (men) after them, and had their hands and feet cut off, and their eyes gouged out.\"",
      "usc_msa_ref": "",
      "chain": [
        "38022",
        "20352",
        "20012",
        "11015",
        "11047",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-4063",
      "hadith_no": "4063",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا موسى بن عبد الرحمن، قال حدثنا محمد بن بشر، قال حدثنا سعيد، عن قتادة، عن الحسن، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من بدل دينه فاقتلوه ‏\"‏ ‏.‏ قال أبو عبد الرحمن وهذا أولى بالصواب من حديث عباد ‏.‏",
      "text_en": " It was narrated that Al-Hasan said:                     \"The Messenger of Allah [SAW] said: 'Whoever changes his religion, kill him.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20352",
        "11168",
        "11019",
        "11016"
      ]
    },
    {
      "id": "sunan-an-nasai-4336",
      "hadith_no": "4336",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا محمد بن بشر، قال أنبأنا عبيد الله، ح وأنبأنا عمرو بن علي، قال حدثنا يحيى، عن عبيد الله، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم نهى عن الحمر الأهلية يوم خيبر ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     the Messenger of Allah forbade (the flesh of) domesticated donkeys on the Day of Khaibar.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20352",
        "11201",
        "30153",
        "20031",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-5059",
      "hadith_no": "5059",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن معمر، قال حدثنا أبو عاصم، عن محمد بن بشر، عن أشعث بن أبي الشعثاء، عن الأسود بن يزيد، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يحب التيامن يأخذ بيمينه ويعطي بيمينه ويحب التيمن في جميع أموره ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah [SAW] used to like to start in the right. He would accept with his right hand and give with his right hand, and he liked to start on the right in all his affairs.\"",
      "usc_msa_ref": "",
      "chain": [
        "30172",
        "20241",
        "20352",
        "11324",
        "11054",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-5095",
      "hadith_no": "5095",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا محمد بن بشر، قال حدثنا عبيد الله، عن نافع، عن ابن عمر، قال لعن رسول الله صلى الله عليه وسلم الواصلة والمستوصلة والواشمة والموتشمة ‏.‏ أرسله الوليد بن أبي هشام ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah [SAW] cursed the woman who affixes hair extensions and the woman who has that done, the woman who does tattoos and the woman who has that done.\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20352",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-5230",
      "hadith_no": "5230",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا محمد بن بشر، قال حدثنا عبيد الله، عن عمر بن نافع، عن نافع، عن ابن عمر، قال نهى رسول الله صلى الله عليه وسلم عن القزع ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah [SAW] forbade Al-Qaza' (shaving part of the head and leaving part).\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20352",
        "11201",
        "11713",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-5251",
      "hadith_no": "5251",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا محمد بن بشر، قال حدثنا عبيد الله، عن نافع، عن ابن عمر، قال لعن رسول الله صلى الله عليه وسلم الواصلة والموتصلة والواشمة والموتشمة ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah [SAW] cursed the woman who affixes hair extensions and the one who has that done, and the woman who does tattoos and the one who has that done.\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20352",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-5276",
      "hadith_no": "5276",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا محمد بن بشر، قال حدثنا عبيد الله، عن نافع، عن ابن عمر، قال كان نقش خاتم رسول الله صلى الله عليه وسلم محمد رسول الله ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The inscription on the ring of the Messenger of Allah [SAW] was: Muhammad Rasul Allah (Muhammad the Messenger of Allah).'\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20352",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-5293",
      "hadith_no": "5293",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا محمد بن بشر، عن عبيد الله، عن نافع، عن ابن عمر، قال اتخذ رسول الله صلى الله عليه وسلم خاتما من ذهب وجعل فصه مما يلي بطن كفه فاتخذ الناس الخواتيم فألقاه رسول الله صلى الله عليه وسلم فقال ‏\"‏ لا ألبسه أبدا ‏\"‏ ‏.‏ ثم اتخذ رسول الله صلى الله عليه وسلم خاتما من ورق فأدخله في يده ثم كان في يد أبي بكر ثم كان في يد عمر ثم كان في يد عثمان حتى هلك في بئر أريس ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     The Messenger of Allah [SAW] put on a ring of gold and he used to wear its stone (Fass) next to his palm. Then the people started to wear rings too. Then the Messenger of Allah [SAW] threw it away and said: \"I will never wear it again.\" Then the Messenger of Allah [SAW] took a ring of silver, and wore it on his hand. Then it was on the hand of Abu Bakr, then on the hand of 'Umar, then on the hand of 'Uthman, until it was lost in the well of Aris.",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20352",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-35",
      "hadith_no": "35",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من تقول على ما لم أقل فليتبوأ مقعده من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah (ﷺ) said: 'Whoever attributes to me something that I have not said, let him take his place in Hell.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-50",
      "hadith_no": "50",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا علي بن المنذر، حدثنا محمد بن فضيل، ح وحدثنا حوثرة بن محمد، حدثنا محمد بن بشر، قالا حدثنا حجاج بن دينار، عن أبي غالب، عن أبي أمامة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ما ضل قوم بعد هدى كانوا عليه إلا أوتوا الجدل ‏\"‏ ‏.‏ ثم تلا هذه الآية {بل هم قوم خصمون}‏ ‏.‏",
      "text_en": " It was narrated that Abu Umamah said:                     \"The Messenger of Allah (ﷺ) said: 'No people go astray after having followed right guidance, but those who indulge in disputes.' Then he recited the Verse: \"Nay! But they are a quarrelsome people.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20356",
        "20352",
        "20737",
        "405"
      ]
    },
    {
      "id": "sunan-ibn-majah-497",
      "hadith_no": "497",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا زكريا بن أبي زائدة، قال قال منصور حدثنا مجاهد، عن الحكم بن سفيان الثقفي، أنه رأى رسول الله  صلى الله عليه وسلم  توضأ ثم أخذ كفا من ماء فنضح به فرجه ‏.‏",
      "text_en": " It was narrated from Hakam bin Sufyan Ath-Thawri that:                     He saw the Messenger of Allah perform ablution then take a handful of water and sprinkle it over his private area to remove any doubts about urine drippings.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11338",
        "11067",
        "11028"
      ]
    },
    {
      "id": "sunan-ibn-majah-546",
      "hadith_no": "546",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا مسعر، عن مصعب بن شيبة، عن أبي حبيب بن يعلى بن منية، عن ابن عباس، أنه أتى أبى بن كعب ومعه عمر فخرج عليهما فقال إني وجدت مذيا فغسلت ذكري وتوضأت ‏.‏ فقال عمر أو يجزئ ذلك قال نعم ‏.‏ قال أسمعته من رسول الله  صلى الله عليه وسلم  قال نعم ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that:                     He came to Ubayy bin Ka'b accompanied by 'Umar. Ubayy came out to them and said: \"I noticed some prostatic fluid, so I washed my penis and performed ablution. 'Umar said: \"Is that sufficient?\" He said: \"Yes.\" He ('Umar) asked: \"Did you hear that from the messenger of Allah?\" He said: \"Yes.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "20359",
        "10658",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-680",
      "hadith_no": "680",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا محمد بن عمرو، حدثنا أبو سلمة، عن أم سلمة، قالت كنت مع رسول الله  صلى الله عليه وسلم  في لحافه فوجدت ما تجد النساء من الحيضة فانسللت من اللحاف فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ أنفست ‏\"‏ ‏.‏ قلت وجدت ما تجد النساء من الحيضة ‏.‏ قال ‏\"‏ ذلك ما كتب الله على بنات آدم ‏\"‏ ‏.‏ قالت فانسللت فأصلحت من شأني ثم رجعت فقال لي رسول الله  صلى الله عليه وسلم  ‏\"‏ تعالى فادخلي معي في اللحاف ‏\"‏ ‏.‏ قالت فدخلت معه ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                     \"I was with the Messenger of Allah under his blanket, then I felt that I was menstruating as women do, so I slipped out from under the cover. The Messenger of Allah said: 'Are you menstruating?' I said: 'I feel that I am menstruating as women do.' He said: 'That is what Allah has decreed for the daughters of Adam.' So I slipped out and sorted myself out, then I came back, and the Messenger of Allah said to me: 'Come under the cover with me,' so I went in with him.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11220",
        "10567",
        "56"
      ]
    },
    {
      "id": "sunan-ibn-majah-922",
      "hadith_no": "922",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا محمد بن بشر، حدثنا إسماعيل بن أبي خالد، عن الزبير بن عدي، عن مصعب بن سعد، قال ركعت إلى جنب أبي فطبقت فضرب يدي وقال قد كنا نفعل هذا ثم أمرنا أن نرفع إلى الركب ‏.‏",
      "text_en": " It wasnarrated that Mus’ab bin Sa’d said:                      “I bowed (in prayer)besidemy father, and I put my hands between my knees. He struck myhand andsaid: ‘We used to do that, then we were commanded to put themonthe knees.’”",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20352",
        "11418",
        "11336",
        "10556"
      ]
    },
    {
      "id": "sunan-ibn-majah-995",
      "hadith_no": "995",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، عن عبيد الله بن عمر، حدثني سعيد بن أبي سعيد، عن أبي سلمة بن عبد الرحمن، عن عائشة، قالت كان لرسول الله  صلى الله عليه وسلم  حصير يبسط بالنهار ويحتجره بالليل يصلي إليه ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “The Messenger of Allah had a reedmat that he would spread out during the day, and make into acompartment at night, towards which he would perform prayer.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11201",
        "11168",
        "10567",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-1104",
      "hadith_no": "1104",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا عمرو بن كثير، حدثنا ابن كيسان، عن أبيه، قال رأيت النبي  صلى الله عليه وسلم  يصلي الظهر والعصر في ثوب واحد متلببا به ‏.‏",
      "text_en": " IbnKaisan narrated that his father said:                      “I saw the Prophet (ﷺ)performing the Zuhr and the ‘Asr in a single garment, wrapping itaround his chest.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352"
      ]
    },
    {
      "id": "sunan-ibn-majah-1117",
      "hadith_no": "1117",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا محمد بن بشر، أنبأنا يزيد بن زياد بن أبي الجعد، عن زبيد، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، عن عمر، قال صلاة السفر ركعتان وصلاة الجمعة ركعتان والفطر والأضحى ركعتان تمام غير قصر على لسان محمد  صلى الله عليه وسلم  ‏.‏",
      "text_en": " ‘Umarsaid:                      “The prayer when traveling is two Rak’ah, and Friday istwoRak’ah, and Al-Fitr and Al-Adha are two Rak’ah, complete, notshortened, as told by Muhammad (ﷺ).”",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20352",
        "25362",
        "11335",
        "11196",
        "4052",
        "3"
      ]
    },
    {
      "id": "sunan-ibn-majah-1179",
      "hadith_no": "1179",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن إدريس، ويزيد بن هارون، ومحمد بن بشر، قالوا حدثنا محمد بن عمرو، حدثني عبيدة بن سفيان الحضرمي، عن أبي الجعد الضمري، - وكان له صحبة - قال قال النبي  صلى الله عليه وسلم  ‏\"‏ من ترك الجمعة ثلاث مرات تهاونا بها طبع على قلبه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Ja’d Ad-Damri who was a Companion said thattheProphet (ﷺ) said:                      “Whoever abandons Friday (prayer) three times,neglecting it, a seal will be placed over his heart.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20102",
        "20472",
        "20352",
        "11220",
        "11888"
      ]
    },
    {
      "id": "sunan-ibn-majah-1247",
      "hadith_no": "1247",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا سعيد بن أبي عروبة، عن قتادة، عن زرارة بن أوفى، عن سعد بن هشام، قال سألت عائشة قلت يا أم المؤمنين أفتني عن وتر رسول الله  صلى الله عليه وسلم  ‏.‏ قالت كنا نعد له سواكه وطهوره فيبعثه الله فيما شاء أن يبعثه من الليل فيتسوك ويتوضأ ثم يصلي تسع ركعات لا يجلس فيها إلا عند الثامنة فيدعو ربه فيذكر الله ويحمده ويدعوه ثم ينهض ولا يسلم ثم يقوم فيصلي التاسعة ثم يقعد فيذكر الله ويحمده ويدعو ربه ويصلي على نبيه ثم يسلم تسليما يسمعنا ثم يصلي ركعتين بعد ما يسلم وهو قاعد فتلك إحدى عشرة ركعة فلما أسن رسول الله  صلى الله عليه وسلم  وأخذ اللحم أوتر بسبع وصلى ركعتين بعد ما سلم ‏.‏",
      "text_en": " It wasnarrated that Sa’d bin Hisham said:                      “I asked ‘Aishah: ‘OMother of the Believers! Tell me about the Witr of the Messenger ofAllah (ﷺ).’ She said: ‘We used to keep his tooth stick andwater forablution ready for him. Allah would wake him as He willedto duringthe night, and he would use the tooth stick and performablution, thenhe would pray nine Rak’ah, during which he would notsit until theeighth Rak’ah. Then he would call upon his Lord andremember Allah andpraise Him and supplicate to Him. Then he wouldget up without sayingthe Salam. Then he would stand up and pray theninth Rak’ah. Then hewould sit and remember Allah and praise Him,and supplicate to hisLord and send blessing upon His Prophet. Thenhe would say Salam thatwe could hear. Then he would pray two Rak’ahafter the Salam, while hewas sitting down. That was eleven Rak’ah.When the Messenger of Allah(ﷺ) grew older and had gained weight,he would pray Witr with sevenRak’ah and then pray two more Rak’ahafter he had said the Salam.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11073",
        "11019",
        "11284",
        "11166",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-1387",
      "hadith_no": "1387",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من صام رمضان وقامه إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Messenger of Allah (ﷺ)said: ‘Whoever fasts Ramadan and spends its nights in prayer, outoffaith and in hope of reward, his previous sins will be forgiven.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1409",
      "hadith_no": "1409",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا سعيد بن أبي عروبة، حدثنا قتادة، عن زرارة بن أوفى، عن سعد بن هشام، عن عائشة، قالت لا أعلم نبي الله  صلى الله عليه وسلم  قرأ القرآن كله حتى الصباح ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “I did not know of the Prophet ofAllah (ﷺ) reciting the entire Qur’an until morning.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11073",
        "11019",
        "11284",
        "11166",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-1502",
      "hadith_no": "1502",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ خمس من حق المسلم على المسلم رد التحية وإجابة الدعوة وشهود الجنازة وعيادة المريض وتشميت العاطس إذا حمد الله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “Five are the rights of the Muslim: Returning his greeting,accepting his invitation; attending his funeral; visiting the sich;and answering (saying Yarhamuk-Allah) to the one who sneezes, if hepraises Allah (says Al-Hamdu Lillah).”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-1577",
      "hadith_no": "1577",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا محمد بن بشر، حدثنا إسماعيل بن أبي خالد، قال قلت لعبد الله بن أبي أوفى رأيت إبراهيم ابن رسول الله  صلى الله عليه وسلم  قال مات وهو صغير ولو قضي أن يكون بعد محمد  صلى الله عليه وسلم  نبي لعاش ابنه ولكن لا نبي بعده ‏.‏",
      "text_en": " Isma’ilbin Abu Khalid said:                      “I said to ‘Abdullah bin Abi Awfa: ‘Didyou see Ibrahim, the son of the Messenger of Allah (ﷺ)?’ He said:‘He died when he was small, and if it had been decreed that thereshould be any Prophet after Muhammad (ﷺ), his son would have lived.But there is no Prophet after him.’”",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20352",
        "11418"
      ]
    },
    {
      "id": "sunan-ibn-majah-1726",
      "hadith_no": "1726",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا محمد بن بشر، عن إسماعيل بن أبي خالد، عن محمد بن سعد بن أبي وقاص، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الشهر هكذا وهكذا وهكذا ‏\"‏ ‏.‏ وعقد تسعا وعشرين في الثالثة ‏.‏",
      "text_en": " It wasnarrated from Muhammad bin Sa’d bin Abu Waqqas that his fathersaid:                      “The Messenger of Allah (ﷺ) said: ‘The month is like thatandlike that and like that,’ and he showed nine fingers on thethird timeto indicate twenty-nine.”",
      "usc_msa_ref": "",
      "chain": [
        "30212",
        "20352",
        "11418",
        "30008"
      ]
    },
    {
      "id": "sunan-ibn-majah-1768",
      "hadith_no": "1768",
      "source": "Sunan Ibn Majah",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يزال الناس بخير ما عجلوا الفطر عجلوا الفطر فإن اليهود يؤخرون ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     \"The people will remain upon goodness so long as they hasten tobreak the fast. Hasten to break the fast, for the Jews delay it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2016",
      "hadith_no": "2016",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا ابن أبي عروبة، عن قتادة، عن أبي الخليل، عن عبد الله بن الحارث، أن أم الفضل، حدثته أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ لا تحرم الرضعة ولا الرضعتان أو المصة والمصتان ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Umm Fadl said:                     that the Messenger of Allah said: “Breastfeeding once or twice, or suckling once or twice, does not make (marriage) unlawful.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11073",
        "11019",
        "11291",
        "912"
      ]
    },
    {
      "id": "sunan-ibn-majah-2057",
      "hadith_no": "2057",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، عن زكريا، عن خالد بن سلمة، عن البهي، عن عروة بن الزبير، قال قالت عائشة ما علمت حتى دخلت على زينب بغير إذن وهي غضبى ‏.‏ ثم قالت يا رسول الله أحسبك إذا قلبت لك بنية أبي بكر ذريعتيها ‏.‏ ثم أقبلت على فأعرضت عنها حتى قال النبي  صلى الله عليه وسلم  ‏\"‏ دونك فانتصري ‏\"‏ ‏.‏ فأقبلت عليها حتى رأيتها وقد يبس ريقها في فيها ما ترد على شيئا فرأيت النبي  صلى الله عليه وسلم  يتهلل وجهه ‏.‏",
      "text_en": " Urwah bin Zubair narrated that 'Aishah said:                     \"I did not know until Zainab burst in on me without permission and she was angry. Then she said: 'O Messenger of Allah, is it enough for you that the young daughter of Abu Bakr waves her hands in front of you?' Then she turned to me, but I ignored her until the Prophet said: 'You should say something to defend yourself.' So I turned on her, (and replied to her) until I saw that her mouth had become dry, and she did not say anything back to me. And I saw the Prophet with his face shining.\" (Hasan).",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11338",
        "10680",
        "10511"
      ]
    },
    {
      "id": "sunan-ibn-majah-2318-2",
      "hadith_no": "2318",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا محمد بن عمرو، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إنما أنا بشر ولعل بعضكم أن يكون ألحن بحجته من بعض فمن قطعت له من حق أخيه قطعة فإنما أقطع له قطعة من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     “I am only human, and some of you may be more eloquent in presenting your case than others. If I pass a judgement in his favor that detracts from his brother's rights, I am giving him a piece of fire.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2623",
      "hadith_no": "2623",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Manumission (of Slaves) - كتاب العتق",
      "chapter_no": "19",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، ومحمد بن بشر، عن سعيد بن أبي عروبة، عن قتادة، عن النضر بن أنس، عن بشير بن نهيك، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أعتق نصيبا له في مملوك أو شقصا فعليه خلاصه من ماله إن كان له مال فإن لم يكن له مال استسعي العبد في قيمته غير مشقوق عليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     “Whoever frees his share of a slave or part of his share, must pay from his wealth if he has any wealth if he has any wealth (in order to buy the rest of the slave's freedom). If he does not have wealth, then the slave should be asked to work for the price (of his freedom), without that causing him too much hardship.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20345",
        "20352",
        "11073",
        "11019",
        "11310",
        "11266",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2741",
      "hadith_no": "2741",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قضى رسول الله صلى الله عليه وسلم في الجنين بغرة عبد أو أمة فقال الذي قضي عليه أنعقل من لا شرب ولا أكل ولا صاح ولا استهل ومثل ذلك يطل فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن هذا ليقول بقول شاعر فيه غرة عبد أو أمة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     “The Messenger of Allah (ﷺ) ruled concerning a fetus that (the blood money) was a slave, male and female. The one against whom this verdict was passed said: ' Should we pay blood money for one who neither ate, drunk, shouted, nor cried, (at the moment of birth)? One such as this should be overlooked .' The Messenger of Allah (ﷺ) said: 'This man speaks like a poet. (But the blood money for a fetus is) a slave, male, or female.'”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-2999",
      "hadith_no": "2999",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا عبيد الله بن عمر، عن عاصم بن عبيد الله، عن عبد الله بن عامر بن ربيعة، عن أبيه، عن عمر بن الخطاب، عن النبي  صلى الله عليه وسلم  نحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11201",
        "19808",
        "709",
        "708",
        "3"
      ]
    },
    {
      "id": "sunan-ibn-majah-3191",
      "hadith_no": "3191",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر العبدي، عن محمد بن عمرو، حدثني يحيى بن عبد الرحمن بن حاطب، عن عائشة، قالت خرجنا مع رسول الله  صلى الله عليه وسلم  للحج على أنواع ثلاثة فمنا من أهل بحج وعمرة معا ومنا من أهل بحج مفرد ومنا من أهل بعمرة مفردة ‏.‏ فمن كان أهل بحج وعمرة معا لم يحلل من شىء مما حرم منه حتى يقضي مناسك الحج ومن أهل بالحج مفردا لم يحلل من شىء مما حرم منه حتى يقضي مناسك الحج ومن أهل بعمرة مفردة فطاف بالبيت وبين الصفا والمروة حل ما حرم منه حتى يستقبل حجا ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “We went out with the Messenger ofAllah (ﷺ) for Hajj in three ways. Some of us began the Talbiyah forHajj and ‘Umrah together, some of us began the Talbiyah for Hajj onits own, and some of us began the Talbiyah for ‘Umrah on its own.Those who began the Talbiyah for Hajj and ‘Umrah together did notexitIhram at all until they had completed the rites of Hajj. Thosewhobegan the Talbiyah for Hajj on its own did not exit ihram at alluntilthey had completed the rites of Hajj. And those who began theTalbiyahfor ‘Umrah on its own circumambulated the House and ranbetween Safaand Marwah, then whatever had been forbidden to thembecamepermissible until the time for Hajj came.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11220",
        "10625",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-3224",
      "hadith_no": "3224",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر العبدي، حدثنا سعيد بن أبي عروبة، عن قتادة، عن سنان بن سلمة، عن ابن عباس، أن ذؤيبا الخزاعي، حدث أن النبي  صلى الله عليه وسلم  كان يبعث معه بالبدن ثم يقول ‏\"‏ إذا عطب منها شىء فخشيت عليه موتا فانحرها ثم اغمس نعلها في دمها ثم اضرب صفحتها ولا تطعم منها أنت ولا أحد من أهل رفقتك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that Dhu’aib Al-Khuza’i narrated thatthe Prophet (ﷺ) used to send the sacrificial animals with him, thenhe would say:                      “If any of them becomes unfit and you are afraid thatitwill die, then slaughter it, dip the sandal (tied around its neck)inits blood and place it on its side, but neither you nor any ofyourcompanions should eat anything from it.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11073",
        "11019",
        "17"
      ]
    },
    {
      "id": "sunan-ibn-majah-3432",
      "hadith_no": "3432",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر العبدي، ح وحدثنا علي بن محمد، حدثنا محمد بن فضيل، قالا حدثنا أبو حيان التيمي، عن أبي زرعة، عن أبي هريرة، قال أتي رسول الله  صلى الله عليه وسلم  ذات يوم بلحم فرفع إليه الذراع وكانت تعجبه فنهس منها ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “One day some meat wasbrought tothe Messenger of Allah (ﷺ) and the foreleg was offered tohim whichhe liked, so he bit it with his front teeth.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "38409",
        "20356",
        "11404",
        "11406",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3527",
      "hadith_no": "3527",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، عن محمد بن عمرو، حدثنا أبو سلمة، عن أبي هريرة، قال نهى رسول الله  صلى الله عليه وسلم  أن ينبذ في النقير والمزفت والدباء والحنتمة وقال ‏\"‏ كل مسكر حرام ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah said:                      “The Messenger of Allah (ﷺ)forbade making Nabidh in Naqir, Muzaffat, Dubba’, and Hantamah. Andhesaid: ‘Every intoxicant is unlawful.”*",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3701",
      "hadith_no": "3701",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال مر بأبي هريرة فتى من قريش يجر سبله فقال يا ابن أخي إني سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ من جر ثوبه من الخيلاء لم ينظر الله إليه يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that a young man of Quriash passed by Abu Hurairahwith hiscloak dragging. He said:                      “O my nephew! I heard the MessengerofAllah (ﷺ) saying ‘Whoever let his garment drag out of pride,Allah will not look at him on the Day of Resurrection.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3723",
      "hadith_no": "3723",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا سعيد بن أبي عروبة، عن قتادة، ‏.‏ أن أنس بن مالك، نبأهم أن رسول الله  صلى الله عليه وسلم  رخص للزبير بن العوام ولعبد الرحمن بن عوف في قميصين من حرير من وجع كان بهما حكة ‏.‏",
      "text_en": " It wasnarrated from Anas bin Malik that the Messenger of Allah (ﷺ)granted a concession to Zubair bin ‘Awwam and ‘Abdur-Rahman bin‘Auf,allowing them to wear silk shirts, because of a rash theyweresuffering from.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11073",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-3668-2",
      "hadith_no": "3668",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، عن مسعر، أخبرني سعد بن إبراهيم، عن الحسن، عن صعصعة، عم الأحنف قال دخلت على عائشة امرأة معها ابنتان لها فأعطتها ثلاث تمرات فأعطت كل واحدة منهما تمرة ثم صدعت الباقية بينهما ‏.‏ قالت فأتى النبي  صلى الله عليه وسلم  فحدثته فقال ‏\"‏ ما عجبك لقد دخلت به الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Sa'sa'ah the paternal uncle of Ahnaf, said:                     \"A woman entered upon Aisha with her two daughters, and she gave her three dates. (The woman) gave each of her daughters a date, then she split the last one between them. She (Aisha) said: 'Then the Prophet(ﷺ) came and I told him about that.' He said:' Why are you surprised? She will enter Paradise because of that.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "20359",
        "11063",
        "11016"
      ]
    },
    {
      "id": "sunan-ibn-majah-3697-2",
      "hadith_no": "3697",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا عبدة بن سليمان، ومحمد بن بشر، عن سعيد، عن قتادة، عن أنس بن مالك، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا سلم عليكم أحد من أهل الكتاب فقولوا وعليكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said \"the Messenger of Allah(ﷺ) said\":                     \"When any of the People of the Book greets you with Salam (peace), then say, Wa 'alaikum(and also upon you).\"",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "20337",
        "20352",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "id": "sunan-ibn-majah-3808",
      "hadith_no": "3808",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا مسعر، حدثني محمد بن عبد الرحمن، عن أبي رشدين، عن ابن عباس، عن جويرية، قالت مر بها رسول الله  صلى الله عليه وسلم  حين صلى الغداة أو بعد ما صلى الغداة وهي تذكر الله فرجع حين ارتفع النهار - أو قال انتصف - وهي كذلك فقال ‏\"‏ لقد قلت منذ قمت عنك أربع كلمات ثلاث مرات هي أكثر وأرجح - أو أوزن - مما قلت سبحان الله عدد خلقه سبحان الله رضا نفسه سبحان الله زنة عرشه سبحان الله مداد كلماته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Juwairiyah said:                     \"The Messenger of Allah (ﷺ) passed by her when he prayed the morning prayer, or after he prayed the morning prayer, and she was remembering Allah.  He came back when the sun had risen\" - or he (one of the narrators) said, \"at midday - and she was still doing that. He said: 'I have said four words, three times, since I left you, and they are greater and weigh more heavily than what you have said.  They are: Subhan-Allahi 'adada khalqiha, Subhan-Allahi rida nafsihi, Subhan-Allahi zinata 'arshihi, Subhan-Allah midada kalimatihi (Glory is to Allah, as much as the number of His creation, glory is to Allah as much as pleases Him, glory is to Allah as much as the weight of His Throne, glory is to Allah as much as the ink of His words'.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "20359",
        "11105",
        "17",
        "20216"
      ]
    },
    {
      "id": "sunan-ibn-majah-3815",
      "hadith_no": "3815",
      "source": "Sunan Ibn Majah",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إني لأستغفر الله وأتوب إليه في اليوم مائة مرة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     the Messenger of Allah (saas) said: 'I seek the forgiveness of Allah and repent to Him one hundred times each day.'",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-3870",
      "hadith_no": "3870",
      "source": "Sunan Ibn Majah",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا مسعر، حدثنا أبو عقيل، عن سابق، عن أبي سلام، خادم النبي  صلى الله عليه وسلم  عن النبي  صلى الله عليه وسلم  قال ‏\"‏ ما من مسلم أو إنسان أو عبد يقول حين يمسي وحين يصبح رضيت بالله ربا وبالإسلام دينا وبمحمد نبيا - إلا كان حقا على الله أن يرضيه يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Salam, the servant of the Prophet (saas), that :                     the Prophet (saas) said: \"There is no Muslim - or no person, or slave (of Allah) - who says, in the morning and evening: 'Radaytu billahi Rabban wa bil-Islami dinan wa bi Muhammadin nabiyyan (I am content with Allah as my Lord, Islam as my religion and Muhammad as my Prophet),' but he will have a promise from Allah to make him pleased on the Day of Resurrection.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "20359"
      ]
    },
    {
      "id": "sunan-ibn-majah-3882",
      "hadith_no": "3882",
      "source": "Sunan Ibn Majah",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر، حدثنا محمد بن بشر، ح وحدثنا علي بن محمد، حدثنا وكيع، جميعا عن عبد العزيز بن عمر بن عبد العزيز، حدثني هلال، مولى عمر بن عبد العزيز عن عمر بن عبد العزيز، عن عبد الله بن جعفر، عن أمه، أسماء ابنة عميس قالت علمني رسول الله  صلى الله عليه وسلم  كلمات أقولهن عند الكرب ‏\"‏ الله الله ربي لا أشرك به شيئا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Asma’ bint ‘Umais said:                      “The Messenger of Allah (ﷺ) taught me some words to say at times of distress: Allah! Allahu Rabbi la ushriku bihi shay’an (Allah, Allah is my Lord, I do not associate anything with Him).”",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "20352",
        "38409",
        "20032",
        "20166",
        "11010",
        "108",
        "69"
      ]
    },
    {
      "id": "sunan-ibn-majah-3922",
      "hadith_no": "3922",
      "source": "Sunan Ibn Majah",
      "chapter": "Interpretation of Dreams - كتاب تعبير الرؤيا",
      "chapter_no": "35",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ رأيت في يدي سوارين من ذهب فنفختهما ‏.‏ فأولتهما هذين الكذابين مسيلمة والعنسي ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “Isaw wristbands of gold on my arms, so I blew into them, and Iinterpreted them as being these two liars, Musailimah and ‘Ansi.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-4104",
      "hadith_no": "4104",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا محمد بن عمرو، حدثني أبي، عن أبيه، علقمة بن وقاص قال مر به رجل له شرف فقال له علقمة إن لك رحما وإن لك حقا وإني رأيتك تدخل على هؤلاء الأمراء وتتكلم عندهم بما شاء الله أن تتكلم به وإني سمعت بلال بن الحارث المزني صاحب رسول الله  صلى الله عليه وسلم  يقول قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن أحدكم ليتكلم بالكلمة من رضوان الله ما يظن أن تبلغ ما بلغت فيكتب الله عز وجل له بها رضوانه إلى يوم القيامة وإن أحدكم ليتكلم بالكلمة من سخط الله ما يظن أن تبلغ ما بلغت فيكتب الله عز وجل عليه بها سخطه إلى يوم يلقاه ‏\"‏ ‏.‏ قال علقمة فانظر ويحك ماذا تقول وماذا تكلم به فرب كلام - قد - منعني أن أتكلم به ما سمعت من بلال بن الحارث ‏.‏",
      "text_en": " It was narrated that ‘Alqamah bin Waqqas said that a man passed byhim, who held a prominent position, and ‘Alqamah said to him:                      “Youhave kinship and rights, and I see you entering upon these rulers andspeaking to them as Allah wills you should speak. But i heard Bilalbin Harith Al-Muzani, the Companion of the Messenger of Allah (ﷺ),say that the Messenger of Allah (ﷺ) said: ‘One of you may speak aword that pleases Allah, and not know how far it reaches, but Allahwill record for him as pleasure, until the Day of Resurrection due tothat word. And one of you may speak a word that angers Allah, and notknow how far it reaches, but Allah will record against him his anger,until the Day he meets Him due to that word.”'Alqamah said: \"So look, woe to you, at what you say and what you speak about, for there is something that I wanted to say but I refrained because of what I heard from Bilal bin Harith.\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11220",
        "12404"
      ]
    },
    {
      "id": "sunan-ibn-majah-4126",
      "hadith_no": "4126",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، حدثنا محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ تفرقت اليهود على إحدى وسبعين فرقة وتفترق أمتي على ثلاث وسبعين فرقة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “The Jews split into seventy-one sects and my nation willsplitinto seventy-three sects.”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-ibn-majah-4182",
      "hadith_no": "4182",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا محمد بن بشر، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا تقوم الساعة حتى يحسر الفرات عن جبل من ذهب فيقتتل الناس عليه فيقتل من كل عشرة تسعة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “The Hour will not begin until the Euphrates uncovers amountainof gold and people fight over it, and out of every ten, ninewill bekilled.’”",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20352",
        "11220",
        "10567",
        "13"
      ]
    }
  ],
  "total_hadiths": 141
}