{
  "id": "20357",
  "name": "Malik bin Isma'il, Abu Ghasan al-Nahdi مالك بن إسماعيل أبو غسان النهدي",
  "full_name": "Malik bin Isma'il, Abu Ghasan al-Nahdi مالك بن إسماعيل أبو غسان النهدي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "217",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Nahdi",
      "al-Kufi",
      "Client"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Kufa",
        "ar": "الكوفة",
        "ckb": "كوفە"
      }
    ],
    "tags_display": [
      {
        "en": "al-Nahdi",
        "ar": "al-Nahdi",
        "ckb": "al-Nahdi"
      },
      {
        "en": "al-Kufi",
        "ar": "al-Kufi",
        "ckb": "al-Kufi"
      },
      {
        "en": "Client (Mawla)",
        "ar": "مولى",
        "ckb": "مەولا"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20321",
      "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-170",
      "hadith_no": "170",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا مالك بن إسماعيل، قال حدثنا إسرائيل، عن عاصم، عن ابن سيرين، قال قلت لعبيدة عندنا من شعر النبي صلى الله عليه وسلم أصبناه من قبل أنس، أو من قبل أهل أنس فقال لأن تكون عندي شعرة منه أحب إلى من الدنيا وما فيها‏.‏",
      "text_en": " Narrated Ibn Seereen:                     I said to `Abida, \"I have some of the hair of the Prophet which I got from Anas or from his family.\" `Abida replied. \"No doubt if I had a single hair of that it would have been dearer to me than the whole world and whatever is in it.\"",
      "usc_msa_ref": "",
      "chain": [
        "20357",
        "20311",
        "11080",
        "11035"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-417",
      "hadith_no": "417",
      "source": "Sahih Bukhari",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا مالك بن إسماعيل، قال حدثنا زهير، قال حدثنا حميد، عن أنس، أن النبي صلى الله عليه وسلم رأى نخامة في القبلة فحكها بيده، ورئي منه كراهية  أو رئي كراهيته لذلك وشدته عليه  وقال ‏\"‏ إن أحدكم إذا قام في صلاته فإنما يناجي ربه  أو ربه بينه وبين قبلته  فلا يبزقن في قبلته، ولكن عن يساره أو تحت قدمه ‏\"‏‏.‏ ثم أخذ طرف ردائه فبزق فيه، ورد بعضه على بعض، قال ‏\"‏ أو يفعل هكذا ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet saw expectoration (on the wall of the mosque) in the direction of the Qibla and scraped it off with his hand. It seemed that he disliked it and the sign of disgust was apparent from his face. He said, \"If anyone of you stands for the prayer, he is speaking in private to his Lord, (or) his Lord is between him and his Qibla, therefore he should not spit towards his Qibla, but he could spit either on his left or under his foot.\" Then he took the corner of his sheet and spat in it, folded it and said, \"Or do this.\"",
      "usc_msa_ref": "",
      "chain": [
        "20357",
        "20321",
        "11279",
        "19"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-1270",
      "hadith_no": "1270",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا ابن عيينة، عن عمرو، سمع جابرا  رضى الله عنه  قال أتى النبي صلى الله عليه وسلم عبد الله بن أبى بعد ما دفن فأخرجه، فنفث فيه من ريقه وألبسه قميصه‏.‏",
      "text_en": " Narrated Jabir:                     The Prophet came to (the grave of) `Abdullah bin Ubai after his body was buried. The body was brought out and then the Prophet put his saliva over the body and clothed it in his shirt.",
      "usc_msa_ref": "360",
      "chain": [
        "20357",
        "20005",
        "11081",
        "34"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-1547",
      "hadith_no": "1547",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا زهير، قال حدثني زيد بن جبير، أنه أتى عبد الله بن عمر  رضى الله عنهما  في منزله وله فسطاط وسرادق، فسألته من أين يجوز أن أعتمر قال فرضها رسول الله صلى الله عليه وسلم لأهل نجد قرنا، ولأهل المدينة ذا الحليفة، ولأهل الشأم الجحفة‏.‏",
      "text_en": " Narrated Zaid bin Jubair:                     I went to visit `Abdullah bin `Umar at his house which contained many tents made of cotton cloth and these were encircled with Suradik (part of the tent). I asked him from where, should one assume Ihram for Umra. He said, \"Allah's Apostle had fixed as Miqat (singular of Mawaqit) Qarn for the people of Najd, Dhul-Hulaifa for the people of Medina, and Al-Juhfa for the people of Sham.\"",
      "usc_msa_ref": "597",
      "chain": [
        "20357",
        "20321",
        "22061"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2121",
      "hadith_no": "2121",
      "source": "Sahih Bukhari",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا زهير، عن حميد، عن أنس  رضى الله عنه  دعا رجل بالبقيع يا أبا القاسم‏.‏ فالتفت إليه النبي صلى الله عليه وسلم فقال لم أعنك‏.‏ قال ‏\"‏ سموا باسمي، ولا تكتنوا بكنيتي ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     A man at Al-Baqi' called, \"O Abul-Qasim!\" The Prophet turned to him and the man said (to the Prophet ), \"I did not intend to call you.\" The prophet said, \"Name yourselves by my name but not by my Kunya (name).",
      "usc_msa_ref": "",
      "chain": [
        "20357",
        "20321",
        "11279",
        "19"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2555",
      "hadith_no": "2555",
      "source": "Sahih Bukhari",
      "chapter": "Manumission of Slaves - كتاب العتق",
      "chapter_no": "49",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا سفيان، عن الزهري، حدثني عبيد الله، سمعت أبا هريرة، وزيد بن خالد، رضى الله عنهما عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا زنت الأمة فاجلدوها، ثم إذا زنت فاجلدوها، ثم إذا زنت فاجلدوها، في الثالثة أو الرابعة بيعوها ولو بضفير ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira and Zaid bin Khalid:                     The Prophet said, \"If a slave-girl (Ama) commits illegal sexual intercourse, scourge her; if she does it again, scourge her again; if she repeats it, scourge her again.\" The narrator added that on the third or the fourth offense, the Prophet said, \"Sell her even for a hair rope.\"",
      "usc_msa_ref": "",
      "chain": [
        "20357",
        "20012",
        "11013",
        "11201",
        "13",
        "3625"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2656",
      "hadith_no": "2656",
      "source": "Sahih Bukhari",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا عبد العزيز بن أبي سلمة، أخبرنا ابن شهاب، عن سالم بن عبد الله، عن عبد الله بن عمر  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم ‏\"‏ إن بلالا يؤذن بليل فكلوا واشربوا حتى يؤذن  أو قال حتى تسمعوا  أذان ابن أم مكتوم ‏\"‏‏.‏ وكان ابن أم مكتوم رجلا أعمى، لا يؤذن حتى يقول له الناس أصبحت‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     The Prophet said, \"Bilal pronounces the Adhan when it is still night (before dawn), so eat and drink till the next Adhan is pronounced (or till you hear Ibn Um Maktum's Adhan).\" Ibn Um Maktum was a blind man who would not pronounce the Adhan till he was told that it was dawn.",
      "usc_msa_ref": "824",
      "chain": [
        "20357",
        "32017",
        "11013",
        "11011",
        "18"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2722",
      "hadith_no": "2722",
      "source": "Sahih Bukhari",
      "chapter": "Conditions - كتاب الشروط",
      "chapter_no": "54",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا ابن عيينة، حدثنا يحيى بن سعيد، قال سمعت حنظلة الزرقي، قال سمعت رافع بن خديج  رضى الله عنه  يقول كنا أكثر الأنصار حقلا، فكنا نكري الأرض، فربما أخرجت هذه ولم تخرج ذه، فنهينا عن ذلك، ولم ننه عن الورق‏.‏",
      "text_en": " Narrated Rafi` bin Khadij:                     We used to work on the fields more than the other Ansar, and we used to rent the land (for the yield of a specific portion of it). But sometimes that portion or the rest of the land did not give any yield, so we were forbidden (by the Prophet ) to follow such a system, but we were allowed to rent the land for money.",
      "usc_msa_ref": "883",
      "chain": [
        "20357",
        "20005",
        "11062",
        "1986"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2872",
      "hadith_no": "2872",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا زهير، عن حميد، عن أنس  رضى الله عنه  قال كان للنبي صلى الله عليه وسلم ناقة تسمى العضباء لا تسبق  قال حميد أو لا تكاد تسبق  فجاء أعرابي على قعود فسبقها، فشق ذلك على المسلمين، حتى عرفه فقال ‏\"‏ حق على الله أن لا يرتفع شىء من الدنيا إلا وضعه ‏\"‏‏.‏ طوله موسى عن حماد عن ثابت عن أنس عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas:                     The Prophet had a she camel called Al Adba which could not be excelled in a race. (Humaid, a subnarrator said, \"Or could hardly be excelled.\") Once a bedouin came riding a camel below six years of age which surpasses it (i.e. Al-`Adba') in the race. The Muslims felt it so much that the Prophet noticed their distress. He then said, \"It is Allah's Law that He brings down whatever rises high in the world.\"",
      "usc_msa_ref": "124",
      "chain": [
        "20357",
        "20321",
        "11279",
        "19"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3083",
      "hadith_no": "3083",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا ابن عيينة، عن الزهري، قال قال السائب بن يزيد  رضى الله عنه ذهبنا نتلقى رسول الله صلى الله عليه وسلم مع الصبيان إلى ثنية الوداع‏.‏",
      "text_en": " Narrated As-Sa'ib bin Yazid:                     I along with some boys went out to receive Allah's Apostle at Thaniyatal-Wada`.",
      "usc_msa_ref": "316",
      "chain": [
        "20357",
        "20005",
        "11013",
        "3048"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3263",
      "hadith_no": "3263",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا زهير، حدثنا هشام، عن عروة، عن عائشة  رضى الله عنها  عن النبي صلى الله عليه وسلم قال ‏\"‏ الحمى من فيح جهنم، فأبردوها بالماء ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     The Prophet said, \"Fever is from the heat of the (Hell) Fire, so cool it with water.\"",
      "usc_msa_ref": "485",
      "chain": [
        "20357",
        "20321",
        "11065",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3287",
      "hadith_no": "3287",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا إسرائيل، عن المغيرة، عن إبراهيم، عن علقمة، قال قدمت الشأم ‏{‏فقلت من ها هنا‏}‏ قالوا أبو الدرداء قال أفيكم الذي أجاره الله من الشيطان على لسان نبيه صلى الله عليه وسلم حدثنا سليمان بن حرب حدثنا شعبة عن مغيرة وقال الذي أجاره الله على لسان نبيه صلى الله عليه وسلم يعني عمارا‏.‏",
      "text_en": " Narrated Alqama:                     I went to Sham (and asked. \"Who is here?\"), The people said, \"Abu Ad-Darda.\" Abu Darda said, \"Is the person whom Allah has protected against Satan, (as Allah's Apostle said) amongst you\". The subnarrator, Mughira said that the person who was given Allah's Refuge through the tongue of the Prophet was `Ammar (bin Yasir).",
      "usc_msa_ref": "507",
      "chain": [
        "20357",
        "20311",
        "166",
        "11051",
        "11017"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3312",
      "hadith_no": "3312",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا جرير بن حازم، عن نافع، عن ابن عمر، أنه كان يقتل الحيات‏.‏ فحدثه أبو لبابة، أن النبي صلى الله عليه وسلم نهى عن قتل جنان البيوت، فأمسك عنها‏.‏",
      "text_en": " Narrated Nafi`:                     Ibn `Umar used to kill snakes but when Abu Lubaba informed him that the Prophet had forbidden the killing of snakes living in houses, he gave up killing them.",
      "usc_msa_ref": "530",
      "chain": [
        "20357",
        "11272",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3618",
      "hadith_no": "3618",
      "source": "Sahih Bukhari",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا إسرائيل، عن أبي إسحاق، عن البراء  رضى الله عنه  قال كنا يوم الحديبية أربع عشرة مائة، والحديبية بئر فنزحناها حتى لم نترك فيها قطرة، فجلس النبي صلى الله عليه وسلم على شفير البئر، فدعا بماء فمضمض ومج في البئر، فمكثنا غير بعيد ثم استقينا حتى روينا وروت  أو صدرت  ركائبنا‏.‏",
      "text_en": " Narrated Al-Bara:                     We were one-thousand-and-four-hundred persons on the day of Al-Hudaibiya (Treaty), and (at) Al- Hudaibiya (there) was a well. We drew out its water not leaving even a single drop. The Prophet sat at the edge of the well and asked for some water with which he rinsed his mouth and then he threw it out into the well. We stayed for a short while and then drew water from the well and quenched our thirst, and even our riding animals drank water to their satisfaction.",
      "usc_msa_ref": "",
      "chain": [
        "20357",
        "20311",
        "11049",
        "400"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3766",
      "hadith_no": "3766",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا عبد العزيز  هو ابن أبي سلمة  عن محمد بن المنكدر، عن جابر  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ إن لكل نبي حواريا، وإن حواري الزبير بن العوام ‏\"‏‏.‏",
      "text_en": " Narrated Jabir:                     The Prophet said, \"Every prophet used to have a Hawari (i.e. disciple), and my Hawari is Az-Zubair bin Al-`Awwam.\"",
      "usc_msa_ref": "65",
      "chain": [
        "20357",
        "32017",
        "11048",
        "34"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3787",
      "hadith_no": "3787",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا إسرائيل، عن المغيرة، عن إبراهيم، عن علقمة،، قال قدمت الشأم فصليت ركعتين، ثم قلت اللهم يسر لي جليسا صالحا، فأتيت قوما فجلست إليهم، فإذا شيخ قد جاء حتى جلس إلى جنبي، قلت من هذا قالوا أبو الدرداء‏.‏ فقلت إني دعوت الله أن ييسر لي جليسا صالحا فيسرك لي، قال ممن أنت قلت من أهل الكوفة‏.‏ قال أوليس عندكم ابن أم عبد صاحب النعلين والوساد والمطهرة وفيكم الذي أجاره الله من الشيطان على لسان نبيه صلى الله عليه وسلم أوليس فيكم صاحب سر النبي صلى الله عليه وسلم الذي لا يعلم أحد غيره ثم قال كيف يقرأ عبد الله ‏{‏والليل إذا يغشى‏}‏، فقرأت عليه ‏{‏والليل إذا يغشى * والنهار إذا تجلى * والذكر والأنثى‏}‏‏.‏ قال والله لقد أقرأنيها رسول الله صلى الله عليه وسلم من فيه إلى في‏.‏",
      "text_en": " Narrated 'Alqama:                     I went to Sham and offered a two-rak`at prayer and then said, \"O Allah! Bless me with a good pious companion.\" So I went to some people and sat with them. An old man came and sat by my side. I asked, \"Who is he?\" They replied, \"(He is) Abu-Ad-Darda.' I said (to him), \"I prayed to Allah to bless me with a pious companion and He sent you to me.\" He asked me, \"From where are you?\" I replied, \"From the people of Al-Kufa.\" He said, \"Isn't there amongst you Ibn Um `Abd, the one who used to carry the shoes, the cushion(or pillow) and the water for ablution? Is there amongst you the one whom Allah gave Refuge from Satan through the request of His Prophet. Is there amongst you the one who keeps the secrets of the Prophet which nobody knows except him?\" Abu Darda further asked, \"How does `Abdullah (bin Mas`ud) recite the Sura starting with, 'By the Night as it conceals (the light).\" (92.1) Then I recited before him: 'By the Night as it envelops: And by the Day as it appears in brightness; And by male and female.' (91.1-3) On this Abu Ad-Darda' said, \"By Allah, the Prophet made me recite the Sura in this way while I was listening to him (reciting it).",
      "usc_msa_ref": "85",
      "chain": [
        "20357",
        "20311",
        "166",
        "11051",
        "11017"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4606",
      "hadith_no": "4606",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا إسرائيل، عن أبي حصين، عن أبي الضحى، عن ابن عباس، قال كان آخر قول إبراهيم حين ألقي في النار حسبي الله ونعم الوكيل‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The last statement of Abraham when he was thrown into the fire was:--\"Allah is Sufficient for us and He is the Best Disposer (of affairs for us).\" (3.173)",
      "usc_msa_ref": "",
      "chain": [
        "20357",
        "20311",
        "11371",
        "11392",
        "17"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5170",
      "hadith_no": "5170",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا مالك بن إسماعيل، أخبرنا ابن عيينة، أخبرنا عمرو، حدثنا جابر بن زيد، قال أنبأنا ابن عباس  رضى الله عنهما  تزوج النبي صلى الله عليه وسلم وهو محرم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet got married while he was in the state of Ihram.",
      "usc_msa_ref": "49",
      "chain": [
        "20357",
        "20005",
        "11081",
        "11271",
        "17"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5171",
      "hadith_no": "5171",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا ابن عيينة، أنه سمع الزهري، يقول أخبرني الحسن بن محمد بن علي، وأخوه عبد الله، عن أبيهما، أن عليا  رضى الله عنه  قال لابن عباس إن النبي صلى الله عليه وسلم نهى عن المتعة وعن لحوم الحمر الأهلية زمن خيبر‏.‏",
      "text_en": " Narrated `Ali:                     I said to Ibn `Abbas, \"During the battle of Khaibar the Prophet forbade (Nikah) Al-Mut'a and the eating of donkey's meat.\"",
      "usc_msa_ref": "50",
      "chain": [
        "20357",
        "20005",
        "11013",
        "11156",
        "5"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5225",
      "hadith_no": "5225",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا زهير، عن بيان، قال سمعت أنسا، يقول بنى النبي صلى الله عليه وسلم بامرأة فأرسلني فدعوت رجالا إلى الطعام‏.‏",
      "text_en": " Narrated Anas:                     The Prophet consummated his marriage with a woman (Zainab), so he sent me to invite men to the meals.",
      "usc_msa_ref": "99",
      "chain": [
        "20357",
        "20321",
        "11326",
        "19"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5267",
      "hadith_no": "5267",
      "source": "Sahih Bukhari",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا زهير، عن هشام، عن أبيه، عن عائشة، أن سودة بنت زمعة، وهبت، يومها لعائشة، وكان النبي صلى الله عليه وسلم يقسم لعائشة بيومها ويوم سودة‏.‏",
      "text_en": " Narrated `Aisha:                     Sauda bint Zam`a gave up her turn to me (`Aisha), and so the Prophet used to give me (`Aisha) both my day and the day of Sauda.",
      "usc_msa_ref": "",
      "chain": [
        "20357",
        "20321",
        "11065",
        "10511",
        "53",
        "52"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5678",
      "hadith_no": "5678",
      "source": "Sahih Bukhari",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا عبد العزيز بن أبي سلمة، أخبرنا أبو النضر، عن عمير، مولى ابن عباس عن أم الفضل بنت الحارث، أنها أرسلت إلى النبي صلى الله عليه وسلم بقدح لبن، وهو واقف عشية عرفة، فأخذ بيده فشربه‏.‏ زاد مالك عن أبي النضر على بعيره‏.‏",
      "text_en": " Narrated Um Al-Fadl:                     (daughter of Al-Harith) that she sent a bowl of milk to the Prophet while he was standing (at `Arafat) in the afternoon of the Day of `Arafat. He took it in his hands and drank it. Narrated Abu Nadr: The Prophet was on the back of his camel.",
      "usc_msa_ref": "",
      "chain": [
        "20357",
        "32017",
        "20390",
        "11532",
        "156"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5948",
      "hadith_no": "5948",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا زهير، حدثنا هشام بن عروة، أن عروة، أخبره أن زينب ابنة أبي سلمة أخبرته أن أم سلمة أخبرتها أن النبي صلى الله عليه وسلم كان عندها وفي البيت مخنث، فقال لعبد الله أخي أم سلمة يا عبد الله إن فتح لكم غدا الطائف، فإني أدلك على بنت غيلان، فإنها تقبل بأربع وتدبر بثمان‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ لا يدخلن هؤلاء عليكن ‏\"‏‏.‏ قال أبو عبد الله تقبل بأربع وتدبر بثمان يعني أربع عكن بطنها، فهى تقبل بهن، وقوله وتدبر بثمان‏.‏ يعني أطراف هذه العكن الأربع، لأنها محيطة بالجنبين حتى لحقت وإنما قال بثمان‏.‏ ولم يقل بثمانية‏.‏ وواحد الأطراف وهو ذكر، لأنه لم يقل ثمانية أطراف‏.‏",
      "text_en": " Narrated Um Salama:                     that once the Prophet was in her house, and an effeminate man was there too. The effeminate man said to `Abdullah, (Um Salama's brother) \"0 `Abdullah! If Ta'if should be conquered tomorrow, I recommend you the daughter of Ghailan, for she is so fat that she has four curves in the front (of her belly) and eight at the back.\" So the Prophet said (to his wives) \"These effeminate (men) should not enter upon you (your houses).",
      "usc_msa_ref": "775",
      "chain": [
        "20357",
        "20321",
        "11065",
        "10511",
        "244",
        "56"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5957",
      "hadith_no": "5957",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا إسرائيل، عن عثمان بن عبد الله بن موهب، قال أرسلني أهلي إلى أم سلمة بقدح من ماء  وقبض إسرائيل ثلاث أصابع  من فضة فيه شعر من شعر النبي صلى الله عليه وسلم وكان إذا أصاب الإنسان عين أو شىء بعث إليها مخضبه، فاطلعت في الجلجل فرأيت شعرات حمرا‏.‏",
      "text_en": " Narrated IsraiI:                     `Uthman bin `Abdullah bin Mauhab said, \"My people sent me with a bowl of water to Um Salama.\" Isra'il approximated three fingers ('indicating the small size of the container in which there was some hair of the Prophet. `Uthman added, \"If any person suffered from evil eye or some other disease, he would send a vessel (containing water) to Um Salama. I looked into the container (that held the hair of the Prophet) and saw a few red hairs in it,\"",
      "usc_msa_ref": "784",
      "chain": [
        "20357",
        "20311",
        "11524"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5962",
      "hadith_no": "5962",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا إسرائيل، عن أبي إسحاق، سمعت البراء، يقول ما رأيت أحدا أحسن في حلة حمراء من النبي صلى الله عليه وسلم‏.‏ قال بعض أصحابي عن مالك إن جمته لتضرب قريبا من منكبيه‏.‏ قال أبو إسحاق سمعته يحدثه غير مرة، ما حدث به قط إلا ضحك‏.‏ تابعه شعبة شعره يبلغ شحمة أذنيه‏.‏",
      "text_en": " Narrated Al-Bara':                     I did not see anybody in a red cloak looking more handsome than the Prophet Narrated Malik: The hair of the Prophet used to hang near his shoulders. Narrated Shu`ba: The hair of the Prophet used to hang down to the earlobes.",
      "usc_msa_ref": "",
      "chain": [
        "20357",
        "20311",
        "11049",
        "400"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6296",
      "hadith_no": "6296",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا عبد العزيز بن أبي سلمة، أخبرنا عبد الله بن دينار، عن أبي صالح، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا عطس أحدكم فليقل الحمد لله‏.‏ وليقل له أخوه أو صاحبه يرحمك الله‏.‏ فإذا قال له يرحمك الله‏.‏ فليقل يهديكم الله ويصلح بالكم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \" If anyone of you sneezes, he should say 'Al-Hamduli l-lah' (Praise be to Allah), and his (Muslim) brother or companion should say to him, 'Yar-hamuka-l-lah' (May Allah bestow his Mercy on you). When the latter says 'Yar-hamuka-llah\", the former should say, 'Yahdikumul-lah wa Yuslih balakum' (May Allah give you guidance and improve your condition).",
      "usc_msa_ref": "",
      "chain": [
        "20357",
        "32017",
        "11183",
        "11161",
        "13"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6580",
      "hadith_no": "6580",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا زهير، حدثنا حميد، عن أنس  رضى الله عنه  كان للنبي صلى الله عليه وسلم ناقة‏.‏ قال وحدثني محمد أخبرنا الفزاري وأبو خالد الأحمر عن حميد الطويل عن أنس قال كانت ناقة لرسول الله صلى الله عليه وسلم تسمى العضباء، وكانت لا تسبق، فجاء أعرابي على قعود له فسبقها، فاشتد ذلك على المسلمين وقالوا سبقت العضباء، فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن حقا على الله أن لا يرفع شيئا من الدنيا إلا وضعه ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet had a she-camel called Al-`Adba' and it was too fast to surpass in speed. There came a bedouin riding a camel of his, and that camel outstripped it (i.e. Al-Aqba'). That result was hard on the Muslims who said sorrowfully, \"Al- Adba has been outstripped.\" Allah's Apostle said, \"It is due from Allah that nothing would be raised high in this world except that He lowers or puts it down.\"",
      "usc_msa_ref": "508",
      "chain": [
        "20357",
        "20321",
        "11279",
        "19"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6682",
      "hadith_no": "6682",
      "source": "Sahih Bukhari",
      "chapter": "Divine Will (Al-Qadar) - كتاب القدر",
      "chapter_no": "82",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا إسرائيل، عن عاصم، عن أبي عثمان، عن أسامة، قال كنت عند النبي صلى الله عليه وسلم إذ جاءه رسول إحدى بناته وعنده سعد وأبى بن كعب ومعاذ أن ابنها يجود بنفسه‏.‏ فبعث إليها ‏\"‏ لله ما أخذ، ولله ما أعطى، كل بأجل، فلتصبر ولتحتسب ‏\"‏‏.‏",
      "text_en": " Narrated Usama:                     Once while I was with the Prophet and Sa`d, Ubai bin Ka`b and Mu`adh were also sitting with him, there came to him a messenger from one of his daughters, telling him that her child was on the verge of death. The Prophet told the messenger to tell her, \"It is for Allah what He takes, and it is for Allah what He gives, and everything has its fixed time (limit). So (she should) be patient and look for Allah's reward.\"",
      "usc_msa_ref": "599",
      "chain": [
        "20357",
        "20311",
        "11080",
        "11113",
        "50"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6919",
      "hadith_no": "6919",
      "source": "Sahih Bukhari",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا عبد العزيز، أخبرنا ابن شهاب، عن عبيد الله بن عبد الله بن عتبة، عن زيد بن خالد الجهني، قال سمعت النبي صلى الله عليه وسلم يأمر فيمن زنى ولم يحصن جلد مائة وتغريب عام‏.‏   قال ابن شهاب وأخبرني عروة بن الزبير، أن عمر بن الخطاب، غرب، ثم لم تزل تلك السنة‏.‏",
      "text_en": " Narrated Zaid bin Khalid Al-Juhani:                     I heard the Prophet ordering that an unmarried person guilty of illegal sexual intercourse be flogged one-hundred stripes and be exiled for one year. `Umar bin Al-Khattab also exiled such a person, and this tradition is still valid.",
      "usc_msa_ref": "818",
      "chain": [
        "20357",
        "20167",
        "11013",
        "11004",
        "3625"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-7146",
      "hadith_no": "7146",
      "source": "Sahih Bukhari",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا مالك بن إسماعيل، حدثنا ابن عيينة، أنه سمع الزهري، عن عروة، عن زينب بنت أم سلمة، عن أم حبيبة، عن زينب ابنة جحش  رضى الله عنهن  أنها قالت استيقظ النبي صلى الله عليه وسلم من النوم محمرا وجهه يقول ‏\"‏ لا إله إلا الله، ويل للعرب من شر قد اقترب، فتح اليوم من ردم ياجوج وماجوج مثل هذه ‏\"‏‏.‏ وعقد سفيان تسعين أو مائة‏.‏ قيل أنهلك وفينا الصالحون قال ‏\"‏ نعم، إذا كثر الخبث ‏\"‏‏.‏",
      "text_en": " Narrated Zainab bint Jahsh:                     The Prophet got up from his sleep with a flushed red face and said, \"None has the right to be worshipped but Allah. Woe to the Arabs, from the Great evil that is nearly approaching them. Today a gap has been made in the wall of Gog and Magog like this.\" (Sufyan illustrated by this forming the number 90 or 100 with his fingers.) It was asked, \"Shall we be destroyed though there are righteous people among us?\" The Prophet said, \"Yes, if evil increased.\"",
      "usc_msa_ref": "181",
      "chain": [
        "20357",
        "20005",
        "11013",
        "10511",
        "244",
        "59",
        "57"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-muslim-4450",
      "hadith_no": "4450",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Oath; for Establishing the Responsibility of Murders; Fighting; Requital - كتاب القسامة والمحاربين والقصاص والديات",
      "chapter_no": "29",
      "text_ar": "وحدثنا هارون بن عبد الله، حدثنا مالك بن إسماعيل، حدثنا زهير، حدثنا سماك، بن حرب عن معاوية بن قرة، عن أنس، قال أتى رسول الله صلى الله عليه وسلم نفر من عرينة فأسلموا وبايعوه وقد وقع بالمدينة الموم - وهو البرسام - ثم ذكر نحو حديثهم وزاد وعنده شباب من الأنصار قريب من عشرين فأرسلهم إليهم وبعث معهم قائفا يقتص أثرهم ‏.‏",
      "text_en": " Anas reported:                      There came to Allah's Messenger (may peace be upon him) some ponple from 'Uraina. They embraced Islam and swore allegiance to him and there had spread at that time pleurisy. The rest of the hadith is the same (but with this addition):\" There were by his (the Prophet's) side about twenty young men of the Ansar; he sent them (behind) them (culprits), and he also sent along with them one expert in following the track so that he might trace their footprints.\"",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20357",
        "20321",
        "10770",
        "11306",
        "19"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-5036",
      "hadith_no": "5036",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا مالك بن إسماعيل، حدثنا عبد السلام بن حرب، عن يزيد بن عبد الرحمن، عن يحيى بن إسحاق بن عبد الله بن أبي طلحة، عن أمه، حميدة أو عبيدة بنت عبيد بن رفاعة الزرقي عن أبيها، عن النبي صلى الله عليه وسلم قال ‏\"‏ تشمت العاطس ثلاثا فإن شئت أن تشمته فشمته وإن شئت فكف ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubayd ibn Rifa'ah az-Zuraqi:                     The Prophet (ﷺ) said: Invoke a blessing on one who sneezes three times; (and if he sneezes more often), then if you wish to invoke a blessing on him, you may invoke, and if you wish (to stop), then stop.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20357",
        "20248",
        "30525"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-7",
      "hadith_no": "7",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا مالك بن إسماعيل، عن إسرائيل بن يونس، عن يوسف بن أبي بردة، عن أبيه، عن عائشة، رضى الله عنها قالت كان النبي صلى الله عليه وسلم إذا خرج من الخلاء قال ‏\"‏ غفرانك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث إسرائيل عن يوسف بن أبي بردة ‏.‏ وأبو بردة بن أبي موسى اسمه عامر بن عبد الله بن قيس الأشعري ‏.‏ ولا نعرف في هذا الباب إلا حديث عائشة رضى الله عنها عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " 'Aishah, [may Allah be pleased with her] said:                     \"When the Prophet would exit the toilet he would say: 'Ghufranak.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "20357",
        "20311",
        "19951",
        "11901",
        "53"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-4033",
      "hadith_no": "4033",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا يوسف بن موسى القطان البغدادي، حدثنا مالك بن إسماعيل، عن منصور بن أبي الأسود، حدثني كثير أبو إسماعيل، عن جميع بن عمير التيمي، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال لأبي بكر ‏\"‏ أنت صاحبي على الحوض وصاحبي في الغار ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     that the Messenger of Allah (ﷺ) said to Abu Bakr: \"You are my companion at the Hawd, and my companion in the cave.\"",
      "usc_msa_ref": "",
      "chain": [
        "30224",
        "20357",
        "15551",
        "19864",
        "18"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-4247",
      "hadith_no": "4247",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا مالك بن إسماعيل، قال حدثنا إسرائيل، عن الأعمش، عن إبراهيم، عن الأسود، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ ذكاة الميتة دباغها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Prophet said: 'The dead animal is purified by tanning it.\"'",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20357",
        "20311",
        "11060",
        "11051",
        "11054",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-88",
      "hadith_no": "88",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، قال حدثنا مالك بن إسماعيل، حدثنا يحيى بن عثمان، مولى أبي بكر حدثنا يحيى بن عبد الله بن أبي مليكة، عن أبيه، أنه دخل على عائشة فذكر لها شيئا من القدر فقالت سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ من تكلم في شىء من القدر سئل عنه يوم القيامة ومن لم يتكلم فيه لم يسأل عنه ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin Abi Mulaikah narrated that his father entered upon 'Aishah and said something to her about the Divine Decree:                      She said:\"I heard The Messenger of Allah (ﷺ) say: 'Whoever says anything about the Divine decree will be questioned about that on the Day of Resurrection, and whoever does not say anything about it will not be questioned about it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20357"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-266",
      "hadith_no": "266",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا إبراهيم بن نصر، حدثنا أبو غسان، مالك بن إسماعيل حدثنا عمار بن سيف، عن أبي معاذ، ‏.‏ قال مالك بن إسماعيل قال عمار لا أدري محمد أو أنس بن سيرين ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20357",
        "25203",
        "20357"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-319",
      "hadith_no": "319",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "قال أبو الحسن بن سلمة وأخبرنا أبو حاتم، حدثنا أبو غسان النهدي، حدثنا إسرائيل، نحوه ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "38473",
        "20357",
        "20311"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-2036",
      "hadith_no": "2036",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن يحيى، وصالح بن محمد بن يحيى بن سعيد، قالا حدثنا أبو غسان، مالك بن إسماعيل حدثنا مندل، عن ابن جريج، عن موسى بن عقبة، عن نافع، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أيما عبد تزوج بغير إذن مواليه فهو زان ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar:                     that the Messenger of Allah said : \"Any slave who gets married without his master's permission, is a fornicator.\"",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "19807",
        "20357",
        "11070",
        "11106",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 39,
  "grade_display": {
    "en": "Successor (Taba' Tabi') [9th Generation]",
    "ar": "تابع التابعين [الجيل التاسع]",
    "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
  }
}