{
  "id": "20355",
  "name": "Muhammad bin 'Abdullah bin al-Zubair محمد بن عبد الله أبو أحمد الزبيري",
  "full_name": "Muhammad bin 'Abdullah bin al-Zubair محمد بن عبد الله أبو أحمد الزبيري",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "203",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-Asadi",
      "Client",
      "al-Kufi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "39542",
      "name": "Tahr bin Abi Ahmed al-Zubairy طاهر بن أبي",
      "grade": "3rd Century AH"
    }
  ],
  "teachers": [
    {
      "id": "11555",
      "name": "Ayman bin Nabil أيمن بن نابل الحبشي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "15631",
      "name": "Yahya bin Abi al-Haythum al-Atar يحيى بن أبي الهيثم العطار",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11607",
      "name": "'Isa bin Thman عيسى بن طهمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11718",
      "name": "Fatr bin Khalifa فطر بن خليفة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20358",
      "name": "Malik bin Mghwl مالك بن مغول",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20187",
      "name": "Ibrahim bin Tahman إبراهيم بن طهمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20583",
      "name": "Hamza bin Habib al-Zayat حمزة بن حبيب الزيات",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10639",
      "name": "Sa'id bin Hsan al-Mkhzwmy سعيد بن حسان المخزومي المكي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20240",
      "name": "Shayban bin 'Abdur Rahman شيبان بن عبد الرحمن النحوي أبو معاوية",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20595",
      "name": "'Ammar bin Razayq عمار بن رزيق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "10652",
      "name": "'Umar bin Sa'id bin Abi Hussain عمر بن سعيد بن أبي حسين النوفلي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20566",
      "name": "Muhammad bin 'Abdul 'Aziz al-Jarmi محمد بن عبد العزيز الجرمي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20600",
      "name": "Qays bin Sulaim قيس بن سليم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10659",
      "name": "al-Walid bin 'Abdullah bin Jmy' الوليد بن عبد الله بن جميع الزهري",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "39542",
      "name": "Tahr bin Abi Ahmed al-Zubairy طاهر بن أبي",
      "grade": "3rd Century AH"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30160",
      "name": "Muhammad bin Bashar Bindar محمد بن بشار بندار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30170",
      "name": "Muhammad bin al-Muthna - al-Zaman محمد بن المثنى أبو موسى - الزمن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30242",
      "name": "Ahmed bin Manay' أحمد بن منيع",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30498",
      "name": "Ibrahim bin Sa'id al-Juhari إبراهيم بن سعيد الجوهري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30351",
      "name": "'Abdullah bin Muhammad al-Musandi عبد الله بن محمد المسندي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30024",
      "name": "'Ubaidullah bin 'Umar al-Qawariri عبيد الله بن عمر القواريري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30263",
      "name": "'Amr bin Muhammad bin Bukayr عمرو بن محمد بن بكير الناقد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30452",
      "name": "Muhammad bin 'Amr bin 'Ubada bin Jabla محمد بن عمرو بن عبادة بن جبلة",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30272",
      "name": "Muhammad bin 'Abdul Rahim bin Abi Zuhayr محمد بن عبد الرحيم بن أبي زهير البزاز",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30297",
      "name": "Ahmed bin Snan bin Asad أحمد بن سنان بن أسد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30277",
      "name": "Mahmud bin Ghaylan محمود بن غيلان العدوي مولاهم أبو أحمد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30224",
      "name": "Yusuf bin Musa bin Rashid al-Qatan يوسف بن موسى بن راشد القطان",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20720",
      "name": "Nasr bin 'Ali bin Asbahan نصر بن علي الجهضمي الكبير",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "38044",
      "name": "Ahmed bin al-Frat bin Khalid أحمد بن الفرات بن خالد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38834",
      "name": "Hajjaj bin Yusuf bin al-Sha'ir حجاج بن يوسف الشاعر",
      "grade": "3rd Century AH"
    },
    {
      "id": "34255",
      "name": "Muhammad bin Yonus al-Kadaymi محمد بن يونس بن موسى الكديمي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "820",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن عبد الرحيم، قال حدثنا أبو أحمد، محمد بن عبد الله الزبيري قال حدثنا مسعر، عن الحكم، عن عبد الرحمن بن أبي ليلى، عن البراء، قال كان سجود النبي صلى الله عليه وسلم وركوعه، وقعوده بين السجدتين قريبا من السواء‏.‏",
      "text_en": " Narrated Al-Bara':                     The time taken by the Prophet in prostrations, bowing, and the sitting interval between the two prostrations was about the same.",
      "chain": [
        "30272",
        "20355",
        "20359",
        "11069",
        "11196",
        "400"
      ]
    },
    {
      "hadith_no": "1064",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا محمود، قال حدثنا أبو أحمد، قال حدثنا سفيان، عن يحيى، عن عمرة، عن عائشة  رضى الله عنها أن النبي صلى الله عليه وسلم صلى بهم في كسوف الشمس أربع ركعات في سجدتين، الأول الأول أطول‏.‏",
      "text_en": " Narrated Aisha:                     The Prophet led us and performed four bowing in two rak`at during the solar eclipse and the first rak`a was longer.",
      "chain": [
        "30277",
        "20355",
        "20012",
        "20031",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "2730",
      "source": " Sahih Bukhari ",
      "chapter": "Conditions - كتاب الشروط",
      "chapter_no": "54",
      "text_ar": "حدثنا أبو أحمد، حدثنا محمد بن يحيى أبو غسان الكناني، أخبرنا مالك، عن نافع، عن ابن عمر  رضى الله عنهما  قال لما فدع أهل خيبر عبد الله بن عمر، قام عمر خطيبا فقال إن رسول الله صلى الله عليه وسلم كان عامل يهود خيبر على أموالهم، وقال ‏\"‏ نقركم ما أقركم الله ‏\"‏‏.‏ وإن عبد الله بن عمر خرج إلى ماله هناك فعدي عليه من الليل، ففدعت يداه ورجلاه، وليس لنا هناك عدو غيرهم، هم عدونا وتهمتنا، وقد رأيت إجلاءهم، فلما أجمع عمر على ذلك أتاه أحد بني أبي الحقيق، فقال يا أمير المؤمنين، أتخرجنا وقد أقرنا محمد صلى الله عليه وسلم وعاملنا على الأموال، وشرط ذلك لنا فقال عمر أظننت أني نسيت قول رسول الله صلى الله عليه وسلم ‏\"‏ كيف بك إذا أخرجت من خيبر تعدو بك قلوصك، ليلة بعد ليلة ‏\"‏‏.‏ فقال كانت هذه هزيلة من أبي القاسم‏.‏ قال كذبت يا عدو الله‏.‏ فأجلاهم عمر وأعطاهم قيمة ما كان لهم من الثمر مالا وإبلا وعروضا، من أقتاب وحبال وغير ذلك‏.‏ رواه حماد بن سلمة عن عبيد الله، أحسبه عن نافع، عن ابن عمر، عن عمر، عن النبي صلى الله عليه وسلم، اختصره‏.‏",
      "text_en": " Narrated Ibn `Umar:                     When the people of Khaibar dislocated `Abdullah bin `Umar's hands and feet, `Umar got up delivering a sermon saying, \"No doubt, Allah's Apostle made a contract with the Jews concerning their properties, and said to them, 'We allow you (to stand in your land) as long as Allah allows you.' Now `Abdullah bin `Umar went to his land and was attacked at night, and his hands and feet were dislocated, and as we have no enemies there except those Jews, they are our enemies and the only people whom we suspect, I have made up my mind to exile them.\" When `Umar decided to carry out his decision, a son of Abu Al-Haqiq's came and addressed `Umar, \"O chief of the believers, will you exile us although Muhammad allowed us to stay at our places, and made a contract with us about our properties, and accepted the condition of our residence in our land?\" `Umar said, \"Do you think that I have forgotten the statement of Allah's Apostle, i.e.: What will your condition be when you are expelled from Khaibar and your camel will be carrying you night after night?\" The Jew replied, \"That was joke from Abul-Qasim.\" `Umar said, \"O the enemy of Allah! You are telling a lie.\" `Umar then drove them out and paid them the price of their properties in the form of fruits, money, camel saddles and ropes, etc.\"",
      "chain": [
        "20355",
        "11222",
        "20001",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3341",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا نصر بن علي بن نصر، أخبرنا أبو أحمد، عن سفيان، عن أبي إسحاق، عن الأسود بن يزيد، عن عبد الله  رضى الله عنه أن رسول الله صلى الله عليه وسلم قرأ ‏{‏فهل من مدكر‏}‏ مثل قراءة العامة‏.‏",
      "text_en": " Narrated `Abdullah:                     Allah's Apostle recited the following Verse) in the usual tone: 'Fahal-Min-Muddalkir.' (54.15)",
      "chain": [
        "30395",
        "20355",
        "20012",
        "11049",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "3376",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا محمود، حدثنا أبو أحمد، حدثنا سفيان، عن أبي إسحاق، عن الأسود، عن عبد الله  رضى الله عنه  قال قرأ النبي صلى الله عليه وسلم ‏{‏فهل من مدكر ‏}‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet recited:-- 'Hal-min-Muddakir' (54.15) (Is there any that will remember) (and avoid evil).",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11049",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "3620",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني محمد بن المثنى، حدثنا أبو أحمد الزبيري، حدثنا إسرائيل، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، قال كنا نعد الآيات بركة وأنتم تعدونها تخويفا، كنا مع رسول الله صلى الله عليه وسلم في سفر فقل الماء فقال ‏\"‏ اطلبوا فضلة من ماء ‏\"‏‏.‏ فجاءوا بإناء فيه ماء قليل، فأدخل يده في الإناء، ثم قال ‏\"‏ حى على الطهور المبارك، والبركة من الله ‏\"‏ فلقد رأيت الماء ينبع من بين أصابع رسول الله صلى الله عليه وسلم، ولقد كنا نسمع تسبيح الطعام وهو يؤكل‏.‏",
      "text_en": " Narrated `Abdullah:                     We used to consider miracles as Allah's Blessings, but you people consider them to be a warning. Once we were with Allah's Apostle on a journey, and we ran short of water. He said, \"Bring the water remaining with you.\" The people brought a utensil containing a little water. He placed his hand in it and said, \"Come to the blessed water, and the Blessing is from Allah.\" I saw the water flowing from among the fingers of Allah's Apostle , and no doubt, we heard the meal glorifying Allah, when it was being eaten (by him).",
      "chain": [
        "30170",
        "20355",
        "20311",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "4033",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبد الله بن محمد الجعفي، حدثنا أبو أحمد الزبيري، حدثنا عبد الرحمن بن الغسيل، عن حمزة بن أبي أسيد، والزبير بن المنذر بن أبي أسيد، عن أبي أسيد  رضى الله عنه  قال قال لنا رسول الله صلى الله عليه وسلم يوم بدر ‏\"‏ إذا أكثبوكم فارموهم واستبقوا نبلكم ‏\"‏‏.‏",
      "text_en": " Narrated Usaid:                     On the day of Badr, Allah's Apostle said to us, \"When the enemy comes near to you, shoot at them but use your arrows sparingly (so that your arrows should not be wasted).",
      "chain": [
        "30351",
        "20355",
        "11517",
        "1461",
        "11689",
        "113"
      ]
    },
    {
      "hadith_no": "4034",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن عبد الرحيم، حدثنا أبو أحمد الزبيري، حدثنا عبد الرحمن بن الغسيل، عن حمزة بن أبي أسيد، والمنذر بن أبي أسيد، عن أبي أسيد  رضى الله عنه  قال قال لنا رسول الله صلى الله عليه وسلم يوم بدر ‏\"‏ إذا أكثبوكم  يعني كثروكم  فارموهم، واستبقوا نبلكم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Usaid:                     On the day of (the battle of) Badr, Allah's Apostle said to us, \"When your enemy comes near to you (i.e. overcome you by sheer number), shoot at them but use your arrows sparingly.\"",
      "chain": [
        "30272",
        "20355",
        "11517",
        "1461",
        "1462",
        "113"
      ]
    },
    {
      "hadith_no": "4912",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا نصر بن علي، أخبرني أبو أحمد، حدثنا إسرائيل، عن أبي إسحاق، عن الأسود بن يزيد، عن عبد الله  رضى الله عنه  قال أول سورة أنزلت فيها سجدة ‏{‏والنجم‏}‏‏.‏ قال فسجد رسول الله صلى الله عليه وسلم وسجد من خلفه، إلا رجلا رأيته أخذ كفا من تراب فسجد عليه، فرأيته بعد ذلك قتل كافرا، وهو أمية بن خلف‏.‏",
      "text_en": " Narrated `Abdullah:                     The first Sura in which a prostration was mentioned, was Sura An-Najm (The Star). Allah's Apostle prostrated (while reciting it), and everybody behind him prostrated except a man whom I saw taking a hand-full of dust in his hand and prostrated on it. Later I saw that man killed as an infidel, and he was Umaiya bin Khalaf.",
      "chain": [
        "30395",
        "20355",
        "20311",
        "11049",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "5740",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا أبو أحمد الزبيري، حدثنا عمر بن سعيد بن أبي حسين، قال حدثني عطاء بن أبي رباح، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ما أنزل الله داء إلا أنزل له شفاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"There is no disease that Allah has created, except that He also has created its treatment.\"",
      "chain": [
        "30170",
        "20355",
        "10652",
        "11029",
        "13"
      ]
    },
    {
      "hadith_no": "492",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا حجاج بن الشاعر، حدثنا أبو أحمد الزبيري، حدثنا قيس بن سليم العنبري، قال حدثني يزيد الفقير، حدثنا جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن قوما يخرجون من النار يحترقون فيها إلا دارات وجوههم حتى يدخلون الجنة ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah repotted:                      The Messenger of Allah (may peace be upon him) said: Verily people would be brought out from the Fire, and they would be burnt except the exterior (surfaces, fronts) of their faces; and they would enter Paradise.",
      "chain": [
        "38834",
        "20355",
        "20600",
        "11665",
        "34"
      ]
    },
    {
      "hadith_no": "1378",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا أبو أحمد، حدثنا حمزة الزيات، عن الحكم، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ معقبات لا يخيب قائلهن - أو فاعلهن - ثلاث وثلاثون تسبيحة وثلاث وثلاثون تحميدة وأربع وثلاثون تكبيرة في دبر كل صلاة ‏\"‏ ‏.‏  حدثني محمد بن حاتم، حدثنا أسباط بن محمد، حدثنا عمرو بن قيس الملائي، عن الحكم، بهذا الإسناد مثله ‏.‏",
      "text_en": " Ka'b b. 'Ujra reported Allah's Messenger (may peace be upon him) as saying:                      There are certain ejaculations, the repeaters of which or the performers of which at the end of every prayer will never be caused disappointment:\" Glory be to Allah\" thirty-three times,\" Praise be to Allah\" thirty-three times, and\" Allah is most Great\" thirty-four times.",
      "chain": [
        "30395",
        "20355",
        "20583",
        "11069",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "2293",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثناه قتيبة بن سعيد، حدثنا عبد العزيز، - يعني الدراوردي ح وحدثنيه عمرو، الناقد حدثنا أبو أحمد الزبيري، حدثنا سفيان، كلاهما عن سهيل، بهذا الإسناد ‏.‏ نحوه.‏",
      "text_en": " A hadith like this has been narrated by Suhail with the same chain of transmitters.",
      "chain": [
        "30367",
        "20167",
        "20355"
      ]
    },
    {
      "hadith_no": "2843",
      "source": " Sahih Muslim ",
      "chapter": "The Book of I'tikaf - كتاب الاعتكاف",
      "chapter_no": "15",
      "text_ar": "وحدثناه ابن أبي عمر، حدثنا سفيان، ح وحدثني عمرو بن سواد، أخبرنا ابن، وهب أخبرنا عمرو بن الحارث، ح وحدثني محمد بن رافع، حدثنا أبو أحمد، حدثنا سفيان، ح وحدثني سلمة بن شبيب، حدثنا أبو المغيرة، حدثنا الأوزاعي، ح وحدثني زهير بن حرب، حدثنا يعقوب بن إبراهيم بن سعد، حدثنا أبي، عن ابن إسحاق، كل هؤلاء عن يحيى بن، سعيد عن عمرة، عن عائشة، - رضى الله عنها - عن النبي صلى الله عليه وسلم ‏.‏ بمعنى حديث أبي معاوية ‏.‏ وفي حديث ابن عيينة وعمرو بن الحارث وابن إسحاق ذكر عائشة وحفصة وزينب - رضى الله عنهن - أنهن ضربن الأخبية للاعتكاف ‏.‏",
      "text_en": " This hadith has been reported through another chain of transmitters, and there it is mentioned that. 'A'isha, Hafsa and Zainab (Allah be pleased with them) pitched the tents for i'tikaf.",
      "chain": [
        "30421",
        "20005",
        "30443",
        "20377",
        "30375",
        "20355",
        "20012",
        "30417",
        "20442",
        "20024",
        "30022",
        "20184",
        "20150"
      ]
    },
    {
      "hadith_no": "3030",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني عمرو الناقد، حدثنا أبو أحمد الزبيري، حدثنا سفيان، ح وحدثني محمد، بن أبي خلف حدثنا روح بن عبادة، حدثنا شعبة، جميعا عن سليمان التيمي، بهذا الإسناد ‏.‏ مثل حديثهما وفي حديث سفيان المتعة في الحج ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Sulaiman (but with a slight modification of words).",
      "chain": [
        "30263",
        "20355",
        "20012",
        "20229"
      ]
    },
    {
      "hadith_no": "3631",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثنا حجاج بن الشاعر، حدثنا أبو أحمد الزبيري، حدثنا سعيد بن حسان، قاص أهل مكة أخبرني عروة بن عياض بن عدي بن الخيار النوفلي، عن جابر بن عبد، الله قال جاء رجل إلى النبي صلى الله عليه وسلم بمعنى حديث سفيان ‏.‏",
      "text_en": " Jabir b. 'Abdullah (Allah be pleased with them) reported:                      A person came to Allah's Apostle (the rest of the hadith is the same).",
      "chain": [
        "38834",
        "20355",
        "10639",
        "10650",
        "34"
      ]
    },
    {
      "hadith_no": "3783",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثناه محمد بن عمرو بن جبلة، حدثنا أبو أحمد، حدثنا عمار بن رزيق، عن أبي إسحاق، قال كنت مع الأسود بن يزيد جالسا في المسجد الأعظم ومعنا الشعبي فحدث الشعبي بحديث فاطمة بنت قيس أن رسول الله صلى الله عليه وسلم لم يجعل لها سكنى ولا نفقة ثم أخذ الأسود كفا من حصى فحصبه به ‏.‏ فقال ويلك تحدث بمثل هذا قال عمر لا نترك كتاب الله وسنة نبينا صلى الله عليه وسلم لقول امرأة لا ندري لعلها حفظت أو نسيت لها السكنى والنفقة قال الله عز وجل ‏{‏ لا تخرجوهن من بيوتهن ولا يخرجن إلا أن يأتين بفاحشة مبينة‏}‏ ‏.‏",
      "text_en": " Abu Ishaq reported:                      I was with al-Aswad b. Yazid sitting in the great mosque, and there was with us al-Sha'bi, and he narrated the narration of Fatima bint Qais (Allah be pleased with her) that Allah's Messenger (may peace be upon him) did not make any provision for lodging and maintenance allowance for her. Al-Aswad caught hold of some pebbles in his fist and he threw them towards him saying: Woe be to thee, you narrate like it, whereas Umar said: We cannot abandon the Book of Allah and the Sunnah of our Apostle (may peace be upon him) for the words of a woman. We do not know whether she remembers that or she forgets. For her, there is a provision of lodging and maintenance allowance. Allah, the Exalted and Majestic, said:\" Turn them not from their houses nor should they themselves go forth unless they commit an open indecency\" (lxv. 1).",
      "chain": [
        "38562",
        "20355",
        "20595",
        "11049"
      ]
    },
    {
      "hadith_no": "3873",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Emancipating Slaves - كتاب العتق",
      "chapter_no": "21",
      "text_ar": "وحدثناه أبو كريب، حدثنا وكيع، ح وحدثنا ابن نمير، حدثنا أبي ح، وحدثني عمرو الناقد، حدثنا أبو أحمد الزبيري، كلهم عن سفيان، عن سهيل، بهذا الإسناد مثله وقالوا ‏\"‏ ولد والده ‏\"‏ ‏.‏",
      "text_en": " A hadith like this has been narrated on the authority of Suhail with the same chain of transmitters.",
      "chain": [
        "30216",
        "20032",
        "30212",
        "20331",
        "30263",
        "20355",
        "20012"
      ]
    },
    {
      "hadith_no": "4241",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Rules of Inheritance - كتاب الفرائض",
      "chapter_no": "24",
      "text_ar": "حدثنا عمرو الناقد، حدثنا أبو أحمد الزبيري، حدثنا مالك بن مغول، عن أبي، السفر عن البراء، قال آخر آية أنزلت يستفتونك ‏.‏",
      "text_en": " Al-Bara' (Allah be pleased with him) reported that the last verse revealed was:                     \" They ask of thee religious verdict..\" (iv. 177).",
      "chain": [
        "30263",
        "20355",
        "20358",
        "400"
      ]
    },
    {
      "hadith_no": "5888",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثناه أبو كريب، حدثنا ابن نمير، وأبو أسامة عن هشام، بهذا الإسناد ‏.‏ وفي حديث ابن نمير صبت الماء بينها وبين جيبها ‏.‏ ولم يذكر في حديث أبي أسامة ‏\"‏ أنها من فيح جهنم ‏\"‏ ‏.‏ قال أبو أحمد قال إبراهيم حدثنا الحسن بن بشر حدثنا أبو أسامة بهذا الإسناد ‏.‏",
      "text_en": " Hisham reported this hadith with the same chain of transmitters. In the hadith transmitted on the authority of Ibn Numair (the words are):                     \" She poured water on her sides and in the opening of the shirt at the uppermost part of the chest.\" There is no mention of these words:\" It is from the vehemence of the heat of the Hell.\" This hadith has been narrated on the authority of Abu Usama with the same chain of transmitters.",
      "chain": [
        "30216",
        "30212",
        "20318",
        "20355",
        "11051",
        "30188"
      ]
    },
    {
      "hadith_no": "6304",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني عمرو الناقد، حدثنا أبو أحمد الزبيري، حدثنا سفيان، عن عمرو بن، يحيى عن أبيه، عن أبي سعيد الخدري، قال جاء يهودي إلى النبي صلى الله عليه وسلم قد لطم وجهه ‏.‏ وساق الحديث بمعنى حديث الزهري غير أنه قال ‏\"‏ فلا أدري أكان ممن صعق فأفاق قبلي أو اكتفى بصعقة الطور ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id Khudri reported that a Jew who had received a blow at his face came to Allah's Messenger (may peace be upon him) ; the rest of the hadith is the same, up to the hand (where the words are):                      That he (the Holy Prophet) said: I do not know whether he would be one who would fall into swoon and would recover before me or he would be compensated for his swooning at Tur (and thus he would not swoon on this occasion) of Resurrection.",
      "chain": [
        "30263",
        "20355",
        "20012",
        "11210",
        "11232",
        "38"
      ]
    },
    {
      "hadith_no": "6864",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني عمرو الناقد، حدثنا أبو أحمد الزبيري، حدثنا محمد بن عبد العزيز، عن  عبيد الله بن أبي بكر بن أنس، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من عال جاريتين حتى تبلغا جاء يوم القيامة أنا وهو ‏\"‏ ‏.‏ وضم أصابعه ‏.‏",
      "text_en": " Malik reported Allah's Messenger (may peace be upon him) as saying:                      He, who brought up two girls properly till they grew up, he and I would come (together) (very closely) on the Day of Resurrection, and he interlaced his fingers (for explaining the point of nearness between him and that person).",
      "chain": [
        "30263",
        "20355",
        "30380",
        "11436",
        "19"
      ]
    },
    {
      "hadith_no": "7163",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "قال أبو أحمد حدثني محمد بن زنجويه القرشي القشيري، حدثنا عبد الأعلى، بن حماد النرسي بهذا الإسناد ‏.‏",
      "text_en": "",
      "chain": [
        "20355"
      ]
    },
    {
      "hadith_no": "7572",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا نصر بن علي الجهضمي، حدثنا أبو أحمد، حدثنا سفيان، عن أبي حيان، عن أبي زرعة، قال تذاكروا الساعة عند مروان فقال عبد الله بن عمرو سمعت رسول الله صلى الله عليه وسلم يقول ‏.‏ بمثل حديثهما ولم يذكر ضحى ‏.‏",
      "text_en": " Abu Zur'a reported that there was a discussion in the presence of Marwan about the Last Hour, and Abdullah b. 'Amr said:                      I heard Allah's Messenger (may peace be upon him) as saying. The rest of the hadith is the same, but there is no mention of forenoon.",
      "chain": [
        "30395",
        "20355",
        "20012",
        "11404",
        "11406"
      ]
    },
    {
      "hadith_no": "615",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن رافع، حدثنا أبو أحمد الزبيري، حدثنا مسعر، عن ثابت بن عبيد، عن عبيد بن البراء، عن البراء بن عازب، قال كنا إذا صلينا خلف رسول الله صلى الله عليه وسلم أحببنا أن نكون عن يمينه فيقبل علينا بوجهه صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Al-Bara' ibn Azib:                     When we would pray behind the Messenger of Allah (ﷺ), we liked to be on his right side. He (the Prophet) would sit turning his face towards us (and back towards the Ka'bah) (ﷺ).",
      "chain": [
        "30375",
        "20355",
        "20359",
        "10751",
        "10795",
        "400"
      ]
    },
    {
      "hadith_no": "659",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، وعثمان بن أبي شيبة، - بمعنى الإسناد والحديث - قالا حدثنا أبو أحمد الزبيري، عن يونس بن الحارث، عن أبي عون، عن أبيه، عن المغيرة بن شعبة، قال كان رسول الله صلى الله عليه وسلم يصلي على الحصير والفروة المدبوغة ‏.‏",
      "text_en": " Narrated Al-Mughirah ibn Shu'bah:                     The Messenger of Allah (ﷺ) used to pray on a mat and on a tanned skin.",
      "chain": [
        "30024",
        "20355",
        "11649",
        "15346",
        "166"
      ]
    },
    {
      "hadith_no": "699",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن أبي سريج الرازي، أخبرنا أبو أحمد الزبيري، أخبرنا مسرة بن معبد اللخمي، - لقيته بالكوفة - قال حدثني أبو عبيد، حاجب سليمان قال رأيت عطاء بن يزيد الليثي قائما يصلي فذهبت أمر بين يديه فردني ثم قال حدثني أبو سعيد الخدري أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من استطاع منكم أن لا يحول بينه وبين قبلته أحد فليفعل ‏\"‏ ‏.‏",
      "text_en": " Abu 'Ubaid said:                      I saw 'Ata b. Yazid al-Laithi praying in a standing posture. So I went to him passing in front of him; he, therefore, turned me away. He then said to me: Abu Sa'id al-Khudri reported the Messenger of Allah (ﷺ) as saying: If anyone of you can do that he should not let anyone pass between him and the qiblah, he should do it.",
      "chain": [
        "30298",
        "20355",
        "28561",
        "10993",
        "38"
      ]
    },
    {
      "hadith_no": "754",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا نصر بن علي، أخبرنا أبو أحمد، عن العلاء بن صالح، عن زرعة بن عبد الرحمن، قال سمعت ابن الزبير، يقول صف القدمين ووضع اليد على اليد من السنة ‏.‏",
      "text_en": " Zur’ah b. ‘Abd al-Rahman said:                      I heard Ibn al-Zubair say: Setting the feet right and placing one hand on the other is a sunnah.",
      "chain": [
        "30395",
        "20355",
        "25224",
        "106"
      ]
    },
    {
      "hadith_no": "1728",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا نصر بن علي، حدثنا أبو أحمد، حدثنا سفيان، عن عبيد الله، عن نافع، أن ابن عمر، كان يردف مولاة له يقال لها صفية تسافر معه إلى مكة ‏.‏",
      "text_en": " Nafi` said :                      Ibn `Umr used to seat his slave girl called Safiyyah behind him(on the Camel) and thus she travelled to Makkah in his company.",
      "chain": [
        "30395",
        "20355",
        "20012",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2239",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا نصر بن علي، أخبرني أبو أحمد، عن إسرائيل، عن سماك، عن عكرمة، عن ابن عباس، قال أسلمت امرأة على عهد رسول الله صلى الله عليه وسلم فتزوجت فجاء زوجها إلى النبي صلى الله عليه وسلم فقال يا رسول الله إني قد كنت أسلمت وعلمت بإسلامي فانتزعها رسول الله صلى الله عليه وسلم من زوجها الآخر وردها إلى زوجها الأول ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     A woman embraced Islam during the time of the Messenger of Allah (ﷺ); she then married. Her (former) husband then came to the Prophet (ﷺ) and said: Messenger of Allah, I have already embraced Islam, and she had the knowledge about my Islam. The Messenger of Allah (ﷺ) took her away from her latter husband and restored her to her former husband.",
      "chain": [
        "30395",
        "20355",
        "20311",
        "10770",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2291",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا نصر بن علي، أخبرني أبو أحمد، حدثنا عمار بن رزيق، عن أبي إسحاق، قال كنت في المسجد الجامع مع الأسود فقال أتت فاطمة بنت قيس عمر بن الخطاب - رضى الله عنه - فقال ما كنا لندع كتاب ربنا وسنة نبينا صلى الله عليه وسلم لقول امرأة لا ندري أحفظت ذلك أم لا ‏.‏",
      "text_en": " Abu Ishaq said “I was with Al Aswad in the congregational mosque. He said “Fathimah daughter of Qais came to ‘Umar bin Al Khattab(may Allaah be pleased with him). (When she narrated the tradition about her divorce) he said “We are not to leave the Book of our Lord and the Sunnah of our Prophet (ﷺ) for the statement of a woman, we do not know whether she remembered it or not.”",
      "chain": [
        "30395",
        "20355",
        "20595",
        "11049"
      ]
    },
    {
      "hadith_no": "2314",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا نصر بن علي بن نصر الجهضمي، أخبرنا أبو أحمد، أخبرنا إسرائيل، عن إسحاق، عن البراء، قال كان الرجل إذا صام فنام لم يأكل إلى مثلها وإن صرمة بن قيس الأنصاري أتى امرأته وكان صائما فقال عندك شىء قالت لا لعلي أذهب فأطلب لك شيئا ‏.‏ فذهبت وغلبته عينه فجاءت فقالت خيبة لك ‏.‏ فلم ينتصف النهار حتى غشي عليه وكان يعمل يومه في أرضه فذكر ذلك للنبي صلى الله عليه وسلم فنزلت ‏{‏ أحل لكم ليلة الصيام الرفث إلى نسائكم ‏}‏ قرأ إلى قوله ‏{‏ من الفجر ‏}‏ ‏.‏",
      "text_en": " Al Bara’ (bin Azib) said “When a man fasted and slept, he could not eat till (another nigh) like it.” Sarmah bin Qais Al Ansari came to his wife while he was fasting and asked her Do you have something (to eat)? She replied “No”. Let me go and seek something for you. So, she went out and sleep overcame him. She came (back) and said (to him) .You are deprived (of food). He fainted before noon. He used to work all day long at his land. This was mentioned to the Prophet (ﷺ). So the following verse was revealed. “Permitted to you on the nights of the fasts, is the approach to your wives. They are your garments and ye are their garments. Allah knoweth what yes used to do secretly amongst yourselves. But he turned to you and forgave you. So now associate with them and seek what Allaah hath ordained for you. And eat and drink until the white thread of dawn appears to you. He recited up to the words “of dawn”.",
      "chain": [
        "30395",
        "20355",
        "20311",
        "30021",
        "400"
      ]
    },
    {
      "hadith_no": "2387",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا نصر بن علي، حدثنا أبو أحمد، - يعني الزبيري - أخبرنا إسرائيل، عن أبي العنبس، عن الأغر، عن أبي هريرة، أن رجلا، سأل النبي صلى الله عليه وسلم عن المباشرة للصائم فرخص له وأتاه آخر فسأله فنهاه ‏.‏ فإذا الذي رخص له شيخ والذي نهاه شاب ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     A man  asked the Prophet (ﷺ) whether one who was fasting could embrace (his wife) and he gave him permission; but when another man came to him, and asked him, he forbade him. The one to whom he gave permission was an old man and the one whom he forbade was a youth.",
      "chain": [
        "30395",
        "20355",
        "20311",
        "15022",
        "13"
      ]
    },
    {
      "hadith_no": "2663",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن سنان، حدثنا أبو أحمد الزبيري، حدثنا عبد الرحمن بن سليمان بن الغسيل، عن حمزة بن أبي أسيد، عن أبيه، قال قال رسول الله صلى الله عليه وسلم حين اصطففنا يوم بدر ‏\"‏ إذا أكثبوكم - يعني إذا غشوكم - فارموهم بالنبل واستبقوا نبلكم ‏\"‏ ‏.‏",
      "text_en": " Abu Usaid reported the Apostle of Allaah(ﷺ) as saying to us at the battle of Badr when he drew up in rows. When they came near you, shoot arrows at them, but do not use all your arrows.",
      "chain": [
        "30297",
        "20355",
        "11517",
        "1461",
        "113"
      ]
    },
    {
      "hadith_no": "2994",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا نصر بن علي، حدثنا أبو أحمد، أخبرنا سفيان، عن هشام بن عروة، عن أبيه، عن عائشة، قالت كانت صفية من الصفي ‏.‏",
      "text_en": " A’ishah said “Safiyyah was called after the word safi (a special portion of the Prophet).”",
      "chain": [
        "30395",
        "20355",
        "20012",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3256",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا عمرو بن محمد الناقد، حدثنا أبو أحمد الزبيري، حدثنا إسرائيل، عن إبراهيم بن عبد الأعلى، عن جدته، عن أبيها، سويد بن حنظلة قال خرجنا نريد رسول الله ومعنا وائل بن حجر فأخذه عدو له فتحرج القوم أن يحلفوا وحلفت أنه أخي فخلى سبيله فأتينا رسول الله صلى الله عليه وسلم فأخبرته أن القوم تحرجوا أن يحلفوا وحلفت أنه أخي قال ‏\"‏ صدقت المسلم أخو المسلم ‏\"‏ ‏.‏",
      "text_en": " Narrated Suwayd ibn Hanzalah:                     We went out intending (to visit) the Messenger of Allah (ﷺ) and Wa'il ibn Hujr was with us. His enemy caught him. The people desisted from swearing an oath, but I took an oath that he was my brother. So he left him. We then came to the Messenger of Allah (ﷺ), and I informed him that the people desisted from taking the oath, but I swore that he was my brother. He said: You spoke the truth: A Muslim is a brother of a Muslim.",
      "chain": [
        "30263",
        "20355",
        "20311"
      ]
    },
    {
      "hadith_no": "3647",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Knowledge (Kitab Al-Ilm) - كتاب العلم",
      "chapter_no": "26",
      "text_ar": "حدثنا نصر بن علي، أخبرنا أبو أحمد، حدثنا كثير بن زيد، عن المطلب بن عبد الله بن حنطب، قال دخل زيد بن ثابت على معاوية فسأله عن حديث، فأمر إنسانا يكتبه فقال له زيد إن رسول الله صلى الله عليه وسلم أمرنا أن لا نكتب شيئا من حديثه فمحاه ‏.‏",
      "text_en": " Narrated Al-Muttalib bin 'Abd Allah bin Hantab:                     Al-Muttalib ibn Abdullah ibn Hantab said: Zayd ibn Thabit entered upon Mu'awiyah and asked him about a tradition. He ordered a man to write it. Zayd said: The Messenger of Allah (ﷺ) ordered us not to write any of his traditions. So he erased it.",
      "chain": [
        "30395",
        "20355",
        "22171",
        "19944"
      ]
    },
    {
      "hadith_no": "3696",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو أحمد، حدثنا سفيان، عن علي بن بذيمة، حدثني قيس بن حبتر النهشلي، عن ابن عباس، أن وفد عبد القيس، قالوا يا رسول الله فيم نشرب قال ‏\"‏ لا تشربوا في الدباء ولا في المزفت ولا في النقير وانتبذوا في الأسقية ‏\"‏ ‏.‏ قالوا يا رسول الله فإن اشتد في الأسقية قال ‏\"‏ فصبوا عليه الماء ‏\"‏ ‏.‏ قالوا يا رسول الله ‏.‏ فقال لهم في الثالثة أو الرابعة ‏\"‏ أهريقوه ‏\"‏ ‏.‏ ثم قال ‏\"‏ إن الله حرم على أو حرم الخمر والميسر والكوبة ‏\"‏ ‏.‏ قال ‏\"‏ وكل مسكر حرام ‏\"‏ ‏.‏ قال سفيان فسألت علي بن بذيمة عن الكوبة قال الطبل ‏.‏",
      "text_en": " Ibn ‘Abbas said :                      The deputation of ‘Abd al-Qais asked (the prophet):From which(vessels)should we drink ? He (the prophet) replied: Do not drink from the pumpkins, vessels smeared with pitch, and hollow stumps , and steep dates in skins. They asked: Messenger of Allah, if it ferments?  He replied: infuse water in it. They asked: Messenger of Allah...” (repeating the same words). He replied to them third or fourth time: Pour it away. He then said: Allah has forbidden me, or  he said: He has forbidden me wine, game of chance and kubah(drums). He said: Every intoxicant is unlawful. Sufyan said: I asked ‘All b. Badhimah about kubah\t. He replied: Drum.",
      "chain": [
        "30160",
        "20355",
        "20012",
        "19929",
        "15467",
        "17"
      ]
    },
    {
      "hadith_no": "3853",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو أحمد، حدثنا سفيان، عن يزيد أبي خالد الدالاني، عن رجل، عن جابر بن عبد الله، قال صنع أبو الهيثم بن التيهان للنبي صلى الله عليه وسلم طعاما فدعا النبي صلى الله عليه وسلم وأصحابه فلما فرغوا قال ‏\"‏ أثيبوا أخاكم ‏\"‏ ‏.‏ قالوا يا رسول الله وما إثابته قال ‏\"‏ إن الرجل إذا دخل بيته فأكل طعامه وشرب شرابه فدعوا له فذلك إثابته ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     AbulHaytham ibn at-Tayhan prepared food for the Messenger of Allah (ﷺ), and he invited the Prophet (ﷺ) and his Companions. When they finished (food), the said: If some people enter the house of a man, his food is eaten and his drink is drunk, and they supplicate (to Allah) for him, this is his reward.",
      "chain": [
        "30160",
        "20355",
        "20012",
        "34"
      ]
    },
    {
      "hadith_no": "3993",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا نصر بن علي، أخبرنا أبو أحمد، أخبرنا إسرائيل، عن أبي إسحاق، عن عبد الرحمن بن يزيد، عن عبد الله، قال أقرأني رسول الله صلى الله عليه وسلم ‏{‏ إني أنا الرزاق ذو القوة المتين ‏}‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Messenger of Allah (ﷺ) made me read the verse \"It is I who give (all) sustenance, Lord of power, steadfast (for ever).",
      "chain": [
        "30395",
        "20355",
        "20311",
        "11049",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "4059",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا نصر بن علي، حدثنا أبو أحمد، - يعني الزبيري - حدثنا مسعر، عن عبد الملك بن ميسرة، عن عمرو بن دينار، عن جابر، قال كنا ننزعه عن الغلمان، ونتركه، على الجواري ‏.‏ قال مسعر فسألت عمرو بن دينار عنه فلم يعرفه ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     We used to take it away (i.e. silk) from boys, and leave it for girls. Mis'ar said: I asked Amr ibn Dinar about it, but he did not know it.",
      "chain": [
        "30395",
        "20355",
        "20359",
        "11369",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "4135",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن عبد الرحيم أبو يحيى، أخبرنا أبو أحمد الزبيري، حدثنا إبراهيم بن طهمان، عن أبي الزبير، عن جابر، قال نهى رسول الله صلى الله عليه وسلم أن ينتعل الرجل قائما ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Messenger of Allah (ﷺ) forbade that a man should put on sandals while standing.",
      "chain": [
        "20355",
        "20187",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "4162",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا نصر بن علي، حدثنا أبو أحمد، عن شيبان بن عبد الرحمن، عن عبد الله بن المختار، عن موسى بن أنس، عن أنس بن مالك، قال كانت للنبي صلى الله عليه وسلم سكة يتطيب منها ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Prophet (ﷺ)  had sikkah with which he perfumed himself.",
      "chain": [
        "30395",
        "20355",
        "20240",
        "24244",
        "14383",
        "19"
      ]
    },
    {
      "hadith_no": "4426",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا نصر بن علي، أخبرنا أبو أحمد، أخبرنا إسرائيل، عن سماك بن حرب، عن سعيد بن جبير، عن ابن عباس، قال جاء ماعز بن مالك إلى النبي صلى الله عليه وسلم فاعترف بالزنا مرتين فطرده ثم جاء فاعترف بالزنا مرتين فقال ‏\"‏ شهدت على نفسك أربع مرات اذهبوا به فارجموه ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     Ma'iz ibn Malik came to the Prophet (ﷺ) and admitted fornication twice. But he drove him away. He then came and admitted fornication twice. But he drove him away. He then came and admitted fornication twice. He (the Prophet) said: You have testified to yourself four times. Take him away and stone him to death.",
      "chain": [
        "30395",
        "20355",
        "20311",
        "10770",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "4434",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن إسحاق الأهوازي، حدثنا أبو أحمد، حدثنا بشير بن المهاجر، حدثني عبد الله بن بريدة، عن أبيه، قال كنا أصحاب رسول الله نتحدث أن الغامدية وماعز بن مالك لو رجعا بعد اعترافهما أو قال لو لم يرجعا بعد اعترافهما لم يطلبهما وإنما رجمهما عند الرابعة ‏.‏",
      "text_en": " Narrated Buraydah ibn al-Hasib:                     We, the Companions of the Messenger of Allah (ﷺ), used to talk mutually: Would that al-Ghamidiyyah and Ma'iz ibn Malik had withdrawn after their confession; or he said: Had they not withdrawn after their confession, he would not have pursued them (for punishment). He had them stoned after the fourth (confession).",
      "chain": [
        "30289",
        "20355",
        "10747",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "4790",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا نصر بن علي، قال أخبرني أبو أحمد، حدثنا سفيان، عن الحجاج بن فرافصة، عن رجل، عن أبي سلمة، عن أبي هريرة، ح وحدثنا محمد بن المتوكل العسقلاني، حدثنا عبد الرزاق، أخبرنا بشر بن رافع، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، رفعاه جميعا قال قال رسول الله صلى الله عليه وسلم ‏\"‏ المؤمن غر كريم والفاجر خب لئيم ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuSalamah ; AbuHurayrah:                     The Prophet (ﷺ) said: The believer is simple and generous, but the profligate is deceitful and ignoble.",
      "chain": [
        "30395",
        "20355",
        "20012",
        "14075",
        "10567",
        "13",
        "38581",
        "20121",
        "28061",
        "11449",
        "10567"
      ]
    },
    {
      "hadith_no": "90",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا نصر بن علي، ومحمد بن بشار، قالا حدثنا أبو أحمد، محمد بن عبد الله الزبيري عن سفيان، عن الضحاك بن عثمان، عن نافع، عن ابن عمر، أن رجلا، سلم على النبي صلى الله عليه وسلم وهو يبول فلم يرد عليه ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وإنما يكره هذا عندنا إذا كان على الغائط والبول ‏.‏ وقد فسر بعض أهل العلم ذلك ‏.‏ وهذا أحسن شيء روي في هذا الباب ‏.‏ قال أبو عيسى وفي الباب عن المهاجر بن قنفذ وعبد الله بن حنظلة وعلقمة بن الفغواء وجابر والبراء ‏.‏",
      "text_en": " Ibn Umar narrated:                     \"A man greeted the Prophet (with Salam), and he was urinating, so he did not respond to him.\"",
      "chain": [
        "30395",
        "30160",
        "20355",
        "20012",
        "20504",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "124",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، ومحمود بن غيلان، قالا حدثنا أبو أحمد الزبيري، حدثنا سفيان، عن خالد الحذاء، عن أبي قلابة، عن عمرو بن بجدان، عن أبي ذر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الصعيد الطيب طهور المسلم وإن لم يجد الماء عشر سنين فإذا وجد الماء فليمسه بشرته فإن ذلك خير ‏\"‏ ‏.‏ وقال محمود في حديثه ‏\"‏ إن الصعيد الطيب وضوء المسلم ‏\"‏ ‏.‏ قال وفي الباب عن أبي هريرة وعبد الله بن عمرو وعمران بن حصين ‏.‏ قال أبو عيسى وهكذا روى غير واحد عن خالد الحذاء عن أبي قلابة عن عمرو بن بجدان عن أبي ذر ‏.‏ وقد روى هذا الحديث أيوب عن أبي قلابة عن رجل من بني عامر عن أبي ذر ولم يسمه ‏.‏ قال وهذا حديث حسن صحيح ‏.‏ وهو قول عامة الفقهاء أن الجنب والحائض إذا لم يجدا الماء تيمما وصليا ‏.‏ ويروى عن ابن مسعود أنه كان لا يرى التيمم للجنب وإن لم يجد الماء ‏.‏ ويروى عنه أنه رجع عن قوله فقال يتيمم إذا لم يجد الماء ‏.‏ وبه يقول سفيان الثوري ومالك والشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Abu Dharr narrated that :                     AlIah's Messenger said: \"Pure clean earth is a purifier for the Muslim; even if he did not find water for ten years. Then if he finds water, then let him use it (for purification) on his skin. For, that is better.\"",
      "chain": [
        "30160",
        "30277",
        "20355",
        "20012",
        "11282",
        "11047",
        "19856",
        "23"
      ]
    },
    {
      "hadith_no": "140",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا بندار، محمد بن بشار حدثنا أبو أحمد، حدثنا سفيان، عن معمر، عن قتادة، عن أنس، أن النبي صلى الله عليه وسلم كان يطوف على نسائه في غسل واحد ‏.‏ قال وفي الباب عن أبي رافع ‏.‏ قال أبو عيسى حديث أنس حديث حسن صحيح أن النبي صلى الله عليه وسلم كان يطوف على نسائه بغسل واحد ‏.‏ وهو قول غير واحد من أهل العلم منهم الحسن البصري أن لا بأس أن يعود قبل أن يتوضأ ‏.‏ وقد روى محمد بن يوسف هذا عن سفيان فقال عن أبي عروة عن أبي الخطاب عن أنس ‏.‏ وأبو عروة هو معمر بن راشد ‏.‏ وأبو الخطاب قتادة بن دعامة ‏.‏ قال أبو عيسى ورواه بعضهم عن محمد بن يوسف عن سفيان عن ابن أبي عروة عن أبي الخطاب ‏.‏ وهو خطأ والصحيح عن أبي عروة ‏.‏",
      "text_en": " Anas narrated:                     \"Allah's Messenger would go around to his women with one Ghusl.\"",
      "chain": [
        "30160",
        "20355",
        "20012",
        "20115",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "198",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو أحمد الزبيري، حدثنا أبو إسرائيل، عن الحكم، عن عبد الرحمن بن أبي ليلى، عن بلال، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ لا تثوبن في شيء من الصلوات إلا في صلاة الفجر ‏\"‏ ‏.‏ قال وفي الباب عن أبي محذورة ‏.‏ قال أبو عيسى حديث بلال لا نعرفه إلا من حديث أبي إسرائيل الملائي ‏.‏ وأبو إسرائيل لم يسمع هذا الحديث من الحكم بن عتيبة قال إنما رواه عن الحسن بن عمارة عن الحكم بن عتيبة ‏.‏ وأبو إسرائيل اسمه إسماعيل بن أبي إسحاق وليس هو بذاك القوي عند أهل الحديث ‏.‏ وقد اختلف أهل العلم في تفسير التثويب فقال بعضهم التثويب أن يقول في أذان الفجر الصلاة خير من النوم وهو قول ابن المبارك وأحمد ‏.‏ وقال إسحاق في التثويب غير هذا قال التثويب المكروه هو شيء أحدثه الناس بعد النبي صلى الله عليه وسلم إذا أذن المؤذن فاستبطأ القوم قال بين الأذان والإقامة قد قامت الصلاة حى على الصلاة حى على الفلاح ‏.‏ قال وهذا الذي قال إسحاق هو التثويب الذي قد كرهه أهل العلم والذي أحدثوه بعد النبي صلى الله عليه وسلم ‏.‏ والذي فسر ابن المبارك وأحمد أن التثويب أن يقول المؤذن في أذان الفجر الصلاة خير من النوم وهو قول صحيح ويقال له التثويب أيضا وهو الذي اختاره أهل العلم ورأوه ‏.‏ وروي عن عبد الله بن عمر أنه كان يقول في صلاة الفجر الصلاة خير من النوم ‏.‏ وروي عن مجاهد قال دخلت مع عبد الله بن عمر مسجدا وقد أذن فيه ونحن نريد أن نصلي فيه فثوب المؤذن فخرج عبد الله بن عمر من المسجد وقال اخرج بنا من عند هذا المبتدع ‏.‏ ولم يصل فيه ‏.‏ قال وإنما كره عبد الله التثويب الذي أحدثه الناس بعد ‏.‏",
      "text_en": " BilaI narrated:                     \"Allah's Messenger said [to me]: 'Do not say the Tathwlb for any prayer except the Fair prayer.'\"",
      "chain": [
        "30242",
        "20355",
        "11069",
        "11196",
        "24"
      ]
    },
    {
      "hadith_no": "417",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن غيلان، وأبو عمار قالا حدثنا أبو أحمد الزبيري، حدثنا سفيان، عن أبي إسحاق، عن مجاهد، عن ابن عمر، قال رمقت النبي صلى الله عليه وسلم شهرا فكان يقرأ في الركعتين قبل الفجر ب ‏:‏ ‏(‏يا أيها الكافرون ‏)‏ و  ‏(‏قل هو الله أحد‏)‏ قال وفي الباب عن ابن مسعود وأنس وأبي هريرة وابن عباس وحفصة وعائشة ‏.‏ قال أبو عيسى حديث ابن عمر حديث حسن ولا نعرفه من حديث الثوري عن أبي إسحاق إلا من حديث أبي أحمد والمعروف عند الناس حديث إسرائيل عن أبي إسحاق ‏.‏ وقد روي عن أبي أحمد عن إسرائيل هذا الحديث أيضا ‏.‏ وأبو أحمد الزبيري ثقة حافظ ‏.‏ قال سمعت بندارا يقول ما رأيت أحدا أحسن حفظا من أبي أحمد الزبيري ‏.‏ وأبو أحمد اسمه محمد بن عبد الله بن الزبير الكوفي الأسدي ‏.‏",
      "text_en": " Ibn Umar narrated:                     \"I watched the Prophet (S) for a month. In the two Rak'ah before Fajr he would recite: Say: \"O you disbelievers!\" and Say: \"Allah is One\".\"",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11049",
        "11028",
        "18"
      ]
    },
    {
      "hadith_no": "746",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد، ومعاوية بن هشام، قالا حدثنا سفيان، عن منصور، عن خيثمة، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يصوم من الشهر السبت والأحد والاثنين ومن الشهر الآخر الثلاثاء والأربعاء والخميس ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وروى عبد الرحمن بن مهدي هذا الحديث عن سفيان ولم يرفعه ‏.‏",
      "text_en": " Aishah narrated:                     \"The Messenger of Allah would fast Saturdays, Sundays, and Mondays in one months, and Tuesdays, Wednesdays and Thursdays in the next month.\"",
      "chain": [
        "30277",
        "20355",
        "20609",
        "20012",
        "11067",
        "11332",
        "53"
      ]
    },
    {
      "hadith_no": "885",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو أحمد الزبيري، حدثنا سفيان، عن عبد الرحمن بن الحارث بن عياش بن أبي ربيعة، عن زيد بن علي، عن أبيه، عن عبيد الله بن أبي رافع، عن علي بن أبي طالب، رضى الله عنه قال وقف رسول الله صلى الله عليه وسلم بعرفة فقال ‏\"‏ هذه عرفة وهذا هو الموقف وعرفة كلها موقف ‏\"‏ ‏.‏ ثم أفاض حين غربت الشمس وأردف أسامة بن زيد وجعل يشير بيده على هيئته والناس يضربون يمينا وشمالا يلتفت إليهم ويقول ‏\"‏ يا أيها الناس عليكم السكينة ‏\"‏ ‏.‏ ثم أتى جمعا فصلى بهم الصلاتين جميعا فلما أصبح أتى قزح فوقف عليه وقال ‏\"‏ هذا قزح وهو الموقف وجمع كلها موقف ‏\"‏ ‏.‏ ثم أفاض حتى انتهى إلى وادي محسر فقرع ناقته فخبت حتى جاوز الوادي فوقف وأردف الفضل ثم أتى الجمرة فرماها ثم أتى المنحر فقال ‏\"‏ هذا المنحر ومنى كلها منحر ‏\"‏ ‏.‏ واستفتته جارية شابة من خثعم فقالت إن أبي شيخ كبير قد أدركته فريضة الله في الحج أفيجزئ أن أحج عنه قال ‏\"‏ حجي عن أبيك ‏\"‏ ‏.‏ قال ولوى عنق الفضل فقال العباس يا رسول الله لم لويت عنق ابن عمك قال ‏\"‏ رأيت شابا وشابة فلم آمن الشيطان عليهما ‏\"‏ ‏.‏ ثم أتاه رجل فقال يا رسول الله إني أفضت قبل أن أحلق ‏.‏ قال ‏\"‏ احلق أو قصر ولا حرج ‏\"‏ ‏.‏ قال وجاء آخر فقال يا رسول الله إني ذبحت قبل أن أرمي ‏.‏ قال ‏\"‏ ارم ولا حرج ‏\"‏ ‏.‏ قال ثم أتى البيت فطاف به ثم أتى زمزم فقال ‏\"‏ يا بني عبد المطلب لولا أن يغلبكم الناس عنه لنزعت ‏\"‏ ‏.‏ قال وفي الباب عن جابر ‏.‏ قال أبو عيسى حديث علي حديث حسن صحيح لا نعرفه من حديث علي إلا من هذا الوجه من حديث عبد الرحمن بن الحارث بن عياش ‏.‏ وقد رواه غير واحد عن الثوري مثل هذا ‏.‏ والعمل على هذا عند أهل العلم رأوا أن يجمع بين الظهر والعصر بعرفة في وقت الظهر ‏.‏ وقال بعض أهل العلم إذا صلى الرجل في رحله ولم يشهد الصلاة مع الإمام إن شاء جمع هو بين الصلاتين مثل ما صنع الإمام ‏.‏ قال وزيد بن علي هو ابن حسين بن علي بن أبي طالب عليه السلام ‏.‏",
      "text_en": " Ali bin Abi Talib, may Allah be pleased with him, narrated:                     \"The Messenger of Allah stopped at Arafat and said: 'This is Arafah and it is a place of standing. And all of Arafat is a place for standing.' Then he departed when the sun had set and took Usamah bin Zaid as a companion rider, and he was motioning with his hand as was his custom, and the people were striking (their camels) on the right and the left to try and catch them, so he said: 'O you people! Be calmm.' Then he came to Jama and performed the two Salat there combined. When the morning came, he went to Quzah and stood there and said: 'This is Quzah, and it is a place of standing, and all of Jama is a place for standing.' Then he departed until he arrived at Wadi Muhassir. Then he stuck his she-camel and she trotted until he passed the valley. Then he stopped and took Al-Fadl as a companion rider and went to the Jamrah to stone it. Then he went to Al-Manhar and said: 'This is Al-Manhar, and all of Mina is a place for sacrifice.' A young girl from Khath'am came to ask him for a verdict, she said: 'Indeed my father is an elderly man who has lived until Allah has made Hajj obligatory, so would he be rewarded if I perform Hajj for him? He said: 'Perform Hajj for your father.'\" He said: \"And he turned the neck of Al Fadl. So Al-Abbas said: 'O Messenger of Allah! Why did you turn the neck of your cousin?' He said: 'I saw a young man and a young woman, and they were not safe from Shaitan.' A man came to him and said, 'O Messenger of Allah! I performed (Tawaf) Al-Ifadah before shaving.' He said: 'Shave, and there is no harm'\" - or: 'Clip and there is no harm'\" He said: \"Someone else came and said: 'O Messenger of Allah! I did the sacrifice before stoning.' So he said: 'Stone, and there is no harm.'\" He said: \"Then he went to the House (Ka'bah) to perform Tawaf around it, then he went to Zamzam and said: 'O tribe of Abdul-Muttalib! If it were not that the people would rush upon you then I would remove it.'\"",
      "chain": [
        "30160",
        "20355",
        "20012",
        "20701",
        "19700",
        "11199",
        "5"
      ]
    },
    {
      "hadith_no": "939",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا نصر بن علي، حدثنا أبو أحمد الزبيري، حدثنا إسرائيل، عن أبي إسحاق، عن الأسود بن يزيد، عن ابن أم معقل، عن أم معقل، عن النبي صلى الله عليه وسلم قال ‏\"‏ عمرة في رمضان تعدل حجة ‏\"‏ ‏.‏ وفي الباب عن ابن عباس وجابر وأبي هريرة وأنس ووهب بن خنبش ‏.‏ قال أبو عيسى ويقال هرم بن خنبش ‏.‏ قال بيان وجابر عن الشعبي عن وهب بن خنبش ‏.‏ وقال داود الأودي عن الشعبي عن هرم بن خنبش ‏.‏ ووهب أصح ‏.‏ وحديث أم معقل حديث حسن غريب من هذا الوجه ‏.‏ وقال أحمد وإسحاق قد ثبت عن النبي صلى الله عليه وسلم أن عمرة في رمضان تعدل حجة ‏.‏ قال إسحاق معنى هذا الحديث مثل ما روي عن النبي صلى الله عليه وسلم أنه قال ‏\"‏ من قرأ ‏:‏ ‏(‏ قل هو الله أحد ‏)‏ فقد قرأ ثلث القرآن ‏\"‏ ‏.‏",
      "text_en": " Umm Ma'qil narrated that:                     The Prophet said: \"Umrah during Ramadan is equal to Hajj.\"",
      "chain": [
        "30395",
        "20355",
        "20311",
        "11049",
        "11054",
        "3185"
      ]
    },
    {
      "hadith_no": "1081",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد الزبيري، حدثنا سفيان، عن الأعمش، عن عمارة بن عمير، عن عبد الرحمن بن يزيد، عن عبد الله بن مسعود، قال خرجنا مع النبي صلى الله عليه وسلم ونحن شباب لا نقدر على شيء فقال ‏\"‏ يا معشر الشباب عليكم بالباءة فإنه أغض للبصر وأحصن للفرج فمن لم يستطع منكم الباءة فعليه بالصوم فإن الصوم له وجاء ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ حدثنا الحسن بن علي الخلال، حدثنا عبد الله بن نمير، حدثنا الأعمش، عن عمارة، نحوه ‏.‏ قال أبو عيسى وقد روى غير، واحد، عن الأعمش، بهذا الإسناد مثل هذا ‏.‏ وروى أبو معاوية، والمحاربي، عن الأعمش، عن إبراهيم، عن علقمة، عن عبد الله، عن النبي صلى الله عليه وسلم نحوه ‏.‏ قال أبو عيسى كلاهما صحيح ‏.‏",
      "text_en": " Abdullah bin Mas'ud narrated:                     \"We went with Allah's Messenger, while we were young men who had nothing. He said: 'O young men! You should marry, for indeed it helps in lowering the gaze and protecting the private parts. Whoever among you is not able to marry, then let him fast, for indeed fasting will diminish his sexual desire.\"",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11060",
        "11378",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "1120",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد الزبيري، حدثنا سفيان، عن أبي قيس، عن هزيل بن شرحبيل، عن عبد الله بن مسعود، قال لعن رسول الله صلى الله عليه وسلم المحل والمحلل له ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو قيس الأودي اسمه عبد الرحمن بن ثروان ‏.‏ وقد روي هذا الحديث عن النبي صلى الله عليه وسلم من غير وجه ‏.‏ والعمل على هذا الحديث عند أهل العلم من أصحاب النبي صلى الله عليه وسلم منهم عمر بن الخطاب وعثمان بن عفان وعبد الله بن عمر وغيرهم وهو قول الفقهاء من التابعين وبه يقول سفيان الثوري وابن المبارك والشافعي وأحمد وإسحاق ‏.‏ قال وسمعت الجارود بن معاذ يذكر عن وكيع أنه قال بهذا وقال ينبغي أن يرمى بهذا الباب من قول أصحاب الرأى ‏.‏ قال جارود قال وكيع وقال سفيان إذا تزوج الرجل المرأة ليحللها ثم بدا له أن يمسكها فلا يحل له أن يمسكها حتى يتزوجها بنكاح جديد ‏.‏",
      "text_en": " Abdullah bin Mas'ud narrated:                     \"The Messenger of Allah cursed the Muhill and the one the Muhallal was done for.\"",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11660",
        "16"
      ]
    },
    {
      "hadith_no": "1248",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا نصر بن علي، حدثنا أبو أحمد، حدثنا يحيى بن أيوب، وهو البجلي الكوفي قال سمعت أبا زرعة بن عمرو بن جرير، يحدث عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا يتفرقن عن بيع إلا عن تراض ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     That the Prophet (ﷺ) said: \"They (the two) are not separate from a sale except in agreement.[Abu 'Eisa said:] This Hadith is Gharib.",
      "chain": [
        "30395",
        "20355",
        "20379",
        "11406",
        "13"
      ]
    },
    {
      "hadith_no": "1617",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو أحمد، عن سفيان، عن علقمة بن مرثد، نحوه بمعناه وزاد فيه ‏\"‏ فإن أبوا فخذ منهم الجزية فإن أبوا فاستعن بالله عليهم ‏\"‏ ‏.‏ قال أبو عيسى هكذا رواه وكيع وغير واحد عن سفيان، ‏.‏ وروى غير، محمد بن بشار عن عبد الرحمن بن مهدي، وذكر، فيه أمر الجزية ‏.‏",
      "text_en": " Muhammad bin Bash-shar narrated to us (he said):                      \"Abu Ahmad narrated to us from Sufyan (who said): \"Alqamah bin Marthad narrated to us' - and it is similar in its meaning, but he added in it: \"if they refuse, then take the Jizyah from them, and it they refuse then seek aid from Allah against them.\"[Abu 'Eisa said:] This is how it was reported from Waki' and others from Sufyan. And other than Muhammad bin Bash-shar reported it from 'Abdur-Rahman bin Mahdi, and he mentioned the matter of the Jizyah in it.",
      "chain": [
        "30160",
        "20355",
        "20012",
        "11374",
        "20033"
      ]
    },
    {
      "hadith_no": "1715",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد، حدثنا سفيان، عن ابن أبي ليلى، عن الحكم، عن مقسم، عن ابن عباس، أن المشركين، أرادوا أن يشتروا، جسد رجل من المشركين فأبى النبي صلى الله عليه وسلم أن يبيعهم إياه ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث الحكم ‏.‏ ورواه الحجاج بن أرطاة أيضا عن الحكم ‏.‏ وقال أحمد بن الحسن سمعت أحمد بن حنبل يقول ابن أبي ليلى لا يحتج بحديثه ‏.‏ وقال محمد بن إسماعيل ابن أبي ليلى صدوق ولكن لا يعرف صحيح حديثه من سقيمه ولا أروي عنه شيئا ‏.‏ وابن أبي ليلى صدوق فقيه وإنما يهم في الإسناد ‏.‏ حدثنا نصر بن علي قال حدثنا عبد الله بن داود عن سفيان الثوري قال فقهاؤنا ابن أبي ليلى وعبد الله بن شبرمة ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"The idolaters wanted to purchase the body of a man who was from the idolaters. But the Prophet (ﷺ) refused to trade with them [for him].\"[Abu 'Eisa said:] This Hadith is Hasan Gharib, we do not know of it except from a narration of Al-Hakam. Al-Hajjaj bin Artah also reported it from Al-Ahkam. Ahmad bin Al-Hasan said: \"I heard Ahmad bin Hanbal saying: 'Ibn Abi Laila's narrations are not used as proof.\" Muhammad bin Isma'il said: \"Ibn Abi Laila is truthful, but his correct Ahadith are not recognizable from his weak ones. And I do not report anything from him.\" Ibn Abi Laila is truthful, and Faqih, the problem is only in the chain.Nasr bin 'Ali narrated to us, [he said:] \"Abdullah bin Dawud narrated us, from Sufyan Ath-Thawri who said: 'Our Fuqaha' are Ibn Abi Laila and 'Abdullah bin Shubrumah.'\"",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11196",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "1814",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد الزبيري، وعبيد الله، عن الثوري، عن جبلة بن سحيم، عن ابن عمر، قال نهى رسول الله صلى الله عليه وسلم أن يقرن بين التمرتين حتى يستأذن صاحبه ‏.‏ قال وفي الباب عن سعد مولى أبي بكر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     \"The Messenger of Allah (ﷺ) prohibited taking two dates at a time until seeking permission from one's companion.\"He said: There is something on this topic from Sa'd the freed slave of Abu Bakr.[Abu 'Eisa said:] This Hadith is Hasan Sahih.",
      "chain": [
        "30277",
        "20355",
        "11201",
        "20012",
        "11329",
        "18"
      ]
    },
    {
      "hadith_no": "1822",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد، والمؤمل، قالا حدثنا سفيان، عن أبي يعفور، عن ابن أبي أوفى، قال غزونا مع رسول الله صلى الله عليه وسلم سبع غزوات نأكل الجراد ‏.‏  قال أبو عيسى وروى شعبة، هذا الحديث عن أبي يعفور، عن ابن أبي أوفى، قال غزوت مع رسول الله صلى الله عليه وسلم غزوات نأكل الجراد ‏.‏ حدثنا بذلك محمد بن بشار حدثنا محمد بن جعفر حدثنا شعبة بهذا ‏.‏",
      "text_en": " Narrated Abu Ya'fur:                     That Ibn Abi Awfa said: \"We participated in seven military expeditions with the Messenger of Allah (ﷺ), (and) we ate locust.\"[Abu 'Eisa said:] Shu'bah reported this Hadith from Abu Ya'fur, from Ibn Awfa and said: \"We participated in military expeditions with the Messenger of Allah (ﷺ) (and) we ate locust.\"This was narrated to us by Muhammad bin Bash-shar (who said): \"Muhammad bin Ja'far narrated to us from Shu'bah.\"",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11403",
        "5115"
      ]
    },
    {
      "hadith_no": "1852",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد الزبيري، وأبو نعيم قالا حدثنا سفيان، عن عبد الله بن عيسى، عن رجل، يقال له عطاء من أهل الشام عن أبي أسيد قال قال النبي صلى الله عليه وسلم ‏\"‏ كلوا الزيت وادهنوا به فإنه من شجرة مباركة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه إنما نعرفه من حديث سفيان الثوري عن عبد الله بن عيسى ‏.‏",
      "text_en": " Narrated Abu Asid:                     \"The Prophet (ﷺ) said: Eat of its oil and use it (the olives), for indeed it is from a blessed tree.\"[Abu 'Eisa said:] This Hadith is Gharib from this route. We only know of it from the narration of Sufyan At-Thawri, from 'Abdullah bin 'Eisa.",
      "chain": [
        "30277",
        "20355",
        "20348",
        "20012",
        "11361",
        "113"
      ]
    },
    {
      "hadith_no": "2064",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو أحمد الزبيري، حدثنا سفيان، ح قال وحدثنا محمود بن غيلان، حدثنا بشر بن السري، وأبو أحمد قالا حدثنا سفيان، عن عبد الله بن عثمان بن خثيم، عن شهر بن حوشب، عن أسماء بنت يزيد، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يحل الكذب إلا في ثلاث يحدث الرجل امرأته ليرضيها والكذب في الحرب والكذب ليصلح بين الناس ‏\"‏ ‏.‏ وقال محمود في حديثه ‏\"‏ لا يصلح الكذب إلا في ثلاث ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن لا نعرفه من حديث أسماء إلا من حديث ابن خثيم ‏.‏",
      "text_en": " Asma bint Yazid  narrated that the  Messenger of Allah said:                     \"it is not lawful to lie except in three cases: Something the man tells his wife to please her, to lie during war, and to lie in order to bring peace between the people.\"",
      "chain": [
        "30160",
        "20355",
        "20012",
        "30277",
        "20190",
        "20355",
        "20012",
        "10644",
        "11044",
        "84"
      ]
    },
    {
      "hadith_no": "2116",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد، وأبو نعيم عن سفيان، عن حبيب، بهذا الإسناد نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "30277",
        "20355",
        "20348",
        "20012",
        "11276"
      ]
    },
    {
      "hadith_no": "2137",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا بندار، وأحمد بن منيع، ومحمود بن غيلان، قالوا حدثنا أبو أحمد الزبيري، عن سفيان، عن أبي إسحاق، عن أبي الأحوص، عن أبيه، قال قلت يا رسول الله الرجل أمر به فلا يقريني ولا يضيفني فيمر بي أفأجزيه قال ‏\"‏ لا أقره ‏\"‏ ‏.‏ قال ورآني رث الثياب فقال ‏\"‏ هل لك من مال ‏\"‏ ‏.‏ قلت من كل المال قد أعطاني الله من الإبل والغنم ‏.‏ قال ‏\"‏ فلير عليك ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عائشة وجابر وأبي هريرة ‏.‏ وهذا حديث حسن صحيح وأبو الأحوص اسمه عوف بن مالك بن نضلة الجشمي ‏.‏ ومعنى قوله ‏\"‏ أقره ‏\"‏ أضفه والقرى هو الضيافة ‏.‏",
      "text_en": " Abu Al-Ahwas narrated from his father who said:                     \"I said: 'O Messenger of Allah! I stayed with a man who did not entertain me nor behave hospitably with me. Then he came to stay with me, shall I reciprocate the same to him?' He (ﷺ said: 'No, entertain him.\" He said: 'He (ﷺ saw me wearing tattered clothes and said:'(Do you have any wealth?' I said: 'Allah has given me various kinds of wealth through camels and goats.' He said: 'Then let it be seen on you.'\"",
      "chain": [
        "30160",
        "30242",
        "30277",
        "20355",
        "20012",
        "11049",
        "20327"
      ]
    },
    {
      "hadith_no": "2249",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Inheritance - كتاب الفرائض عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "29",
      "text_ar": "حدثنا بندار، حدثنا أبو أحمد الزبيري، حدثنا سفيان، عن عبد الرحمن بن الحارث، عن حكيم بن حكيم بن عباد بن حنيف، عن أبي أمامة بن سهل بن حنيف، قال كتب عمر بن الخطاب إلى أبي عبيدة أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الله ورسوله مولى من لا مولى له والخال وارث من لا وارث له ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن عائشة والمقدام بن معديكرب ‏.‏ وهذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Umamah bin Sahl bin Hunaif said:                     \" 'Umar bin Al-Khattab sent me with a letter to Abu'Ubaidah (saying) that The Messenger of Allah(S.A.W) said : 'Allah and His Messenger are responsible for the one who has no patron. And the maternal uncle inherits from the one who has no heirs.'\"",
      "chain": [
        "30160",
        "20355",
        "20012",
        "448",
        "19803",
        "405"
      ]
    },
    {
      "hadith_no": "2450",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Dreams - كتاب الرؤيا عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "34",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد الزبيري، حدثنا سفيان، عن عبد الأعلى، عن أبي عبد الرحمن السلمي، عن علي، قال أراه عن النبي صلى الله عليه وسلم قال ‏\"‏ من كذب في حلمه كلف يوم القيامة عقد شعيرة ‏\"‏ ‏.‏",
      "text_en": " Abu 'Abdur-Rahman(As-Sulami) narrated from 'Ali and I think he said:                      \" From the Prophet(s.a.w), who said:\"Whoever lies about his dream, he will be required to knot barely kernels on the Day of Judgement.\"",
      "chain": [
        "30277",
        "20355",
        "20012",
        "20246",
        "11359",
        "5"
      ]
    },
    {
      "hadith_no": "2312",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو أحمد الزبيري، حدثنا إسرائيل، عن إبراهيم بن المهاجر، عن مجاهد، عن مورق، عن أبي ذر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إني أرى ما لا ترون وأسمع ما لا تسمعون أطت السماء وحق لها أن تئط ما فيها موضع أربع أصابع إلا وملك واضع جبهته ساجدا لله لو تعلمون ما أعلم لضحكتم قليلا ولبكيتم كثيرا وما تلذذتم بالنساء على الفرش ولخرجتم إلى الصعدات تجأرون إلى الله ‏\"‏ ‏.‏ لوددت أني كنت شجرة تعضد ‏.‏ قال أبو عيسى وفي الباب عن أبي هريرة وعائشة وابن عباس وأنس ‏.‏ قال هذا حديث حسن غريب ‏.‏ ويروى من غير هذا الوجه أن أبا ذر قال لوددت أني كنت شجرة تعضد ‏.‏",
      "text_en": " Abu Dharr narrated that the Messenger of Allah (s.a.w) said:",
      "chain": [
        "30242",
        "20355",
        "20311",
        "11028",
        "11308",
        "23"
      ]
    },
    {
      "hadith_no": "2333",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد، حدثنا سفيان، عن ليث، عن مجاهد، عن ابن عمر، قال أخذ رسول الله صلى الله عليه وسلم بمنكبي فقال ‏\"‏ كن في الدنيا كأنك غريب أو عابر سبيل وعد نفسك في أهل القبور ‏\"‏ ‏.‏ فقال لي ابن عمر إذا أصبحت فلا تحدث نفسك بالمساء وإذا أمسيت فلا تحدث نفسك بالصباح وخذ من صحتك قبل سقمك ومن حياتك قبل موتك فإنك لا تدري يا عبد الله ما اسمك غدا ‏\"‏ ‏.‏ قال أبو عيسى وقد روى هذا الحديث الأعمش عن مجاهد عن ابن عمر نحوه ‏.‏  حدثنا أحمد بن عبدة الضبي البصري، حدثنا حماد بن زيد، عن ليث، عن مجاهد، عن ابن عمر، عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " Mujahid narrated that Ibn 'Umar said:                     \"The Messenger of Allah (s.a.w) grabbed me on part of my body and said: 'Be in the world like a stranger or a passerby, and count   yourself among the inhabitants of the grave.'\" Ibn 'Umar said to me: \"When you wake up in the morning, then  do not concern  yourself  with the evening. And when you reach the evening, then do not concern yourself with the morning. Take from your health before your illness, and from your life before your death, for indeed O slave of Allah! You do not know  what your description shall be tomorrow.\" (sahih)",
      "chain": [
        "30277",
        "20355",
        "20012",
        "20023",
        "11028",
        "18"
      ]
    },
    {
      "hadith_no": "2609",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد الزبيري، حدثنا سفيان، عن المغيرة بن النعمان، عن سعيد بن جبير، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يحشر الناس يوم القيامة حفاة عراة غرلا كما خلقوا ثم قرأ ‏(‏كما بدأنا أول خلق نعيده وعدا علينا إنا كنا فاعلين ‏)‏ وأول من يكسى من الخلائق إبراهيم ويؤخذ من أصحابي برجال ذات اليمين وذات الشمال فأقول يا رب أصحابي ‏.‏ فيقال إنك لا تدري ما أحدثوا بعدك إنهم لم يزالوا مرتدين على أعقابهم منذ فارقتهم ‏.‏ فأقول كما قال العبد الصالح‏:‏ ‏(‏إن تعذبهم فإنهم عبادك وإن تغفر لهم فإنك أنت العزيز الحكيم‏)‏ ‏\"‏‏.‏",
      "text_en": " Ibn 'Abbas narrated that the Messenger of Allah (s.a.w) said:                     \"The people will be gathered on the Day of Resurrection bare-foot, naked and uncircumcised as they were created.\" Then he recited: \"As we begin the first creation, we shall repeat it: A promise binding upon Us. Truly We shall do it. And the first of people to be clothed will be Ibrahim. Among my companions will be some men who are taken to the right and to the left. I will say: 'O my Lord! My companions!' It will be said: 'You do not know what they innovated after you, they continued to be apostates since you parted from them.' So I will say as the righteous worshipper said: If you punish them, they are your slaves, and if You forgive them, indeed You, only You are the Almighty, the All-Wise.\"",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11655",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "2672",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد الزبيري، حدثنا خالد بن طهمان أبو العلاء، حدثنا حصين، قال جاء سائل فسأل ابن عباس فقال ابن عباس للسائل أتشهد أن لا، إله إلا الله قال نعم ‏.‏ قال أتشهد أن محمدا رسول الله قال نعم ‏.‏ قال وتصوم رمضان قال نعم ‏.‏ قال سألت وللسائل حق إنه لحق علينا أن نصلك ‏.‏ فأعطاه ثوبا ثم قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من مسلم كسا مسلما ثوبا إلا كان في حفظ الله ما دام منه عليه خرقة ‏\"‏ ‏.‏ قال هذا حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Husain said:                     \"A beggar came to Ibn 'Abbas to beg from him. Ibn 'Abbas said to the beggar: 'Do you testify to La Ilaha Illallah?' He said: 'Yes.' He said: 'Do you testify that Muhammad is the Messenfger of Allah?' He said: 'Yes.' He said: 'You fast(the month of) Ramadan?' He said: 'Yes?' He said: 'You asked, and the one who asked has a right, so you have a right upon us that we give you.' So he gave him a garment then  said: 'I heard the Messenger of Allah (s.a.w) saying: \"No Muslim clothes a Muslim with a garment except that he is under the protection of Allah as long as a shred from it remains upon him.\"",
      "chain": [
        "30277",
        "20355",
        "15097"
      ]
    },
    {
      "hadith_no": "2643",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد، حدثنا سفيان، عن أبي إسحاق، عن عمرو بن ميمون، عن معاذ بن جبل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أتدري ما حق الله على العباد ‏\"‏ ‏.‏ قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإن حقه عليهم أن يعبدوه ولا يشركوا به شيئا ‏\"‏ ‏.‏ قال ‏\"‏ فتدري ما حقهم عليه إذا فعلوا ذلك ‏\"‏ ‏.‏ قلت الله ورسوله أعلم ‏.‏ قال ‏\"‏ أن لا يعذبهم ‏\"‏ ‏.‏ هذا حديث حسن صحيح ‏.‏ وقد روي من غير وجه عن معاذ بن جبل ‏.‏",
      "text_en": " Narrated Mu'adh bin Jabal:                     that the Messenger of Allah (ﷺ) said: \"Do you know what Allah's right upon His slaves is?\" I said: \"Allah and His Messenger know best.\" He said: \"His right upon them is that they worship Him alone and do not associate any partners with Him.\" He said: \"And do you know what their right over Allah is if they do that?\" I said: \"Allah and His Messenger know best.\" He said: \"That He will not punish them.\"",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11049",
        "11382",
        "32"
      ]
    },
    {
      "hadith_no": "2720",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Seeking Permission - كتاب الاستئذان والآداب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن بشار، ونصر بن علي، قالا حدثنا أبو أحمد، عن سفيان، عن الضحاك بن عثمان، عن نافع، عن ابن عمر، أن رجلا، سلم على النبي صلى الله عليه وسلم وهو يبول فلم يرد عليه يعني السلام ‏.‏ حدثنا محمد بن يحيى النيسابوري، حدثنا محمد بن يوسف، عن سفيان، عن الضحاك بن عثمان، بهذا الإسناد نحوه ‏.‏ وفي الباب عن علقمة بن الفغواء، وجابر، والبراء، والمهاجر بن قنفذ، ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     that a man gave the Salam to the Prophet (ﷺ) while he was urinating, but the Prophet (ﷺ) did not return the Salam to him.\"",
      "chain": [
        "30160",
        "30395",
        "20355",
        "20012",
        "20504",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2959",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد الزبيري، حدثنا سفيان، عن منصور، عن هلال بن يساف، عن سالم بن عبيد، أنه كان مع القوم في سفر فعطس رجل من القوم فقال السلام عليكم ‏.‏ فقال عليك وعلى أمك فكأن الرجل وجد في نفسه فقال أما إني لم أقل إلا ما قال النبي صلى الله عليه وسلم عطس رجل عند النبي صلى الله عليه وسلم فقال السلام عليكم ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ عليك وعلى أمك إذا عطس أحدكم فليقل الحمد لله رب العالمين وليقل له من يرد عليه يرحمك الله وليقل يغفر الله لنا ولكم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث اختلفوا في روايته عن منصور وقد أدخلوا بين هلال بن يساف وسالم رجلا ‏.‏",
      "text_en": " Narrated Salim bin 'Ubaid:                     that he was with some people on a journey, and a man among the people sneezed and he said: \"As-Salamu Alaikum (peace be upon you).\" So he (Salim) said: \"'Alaika Wa 'Ala Ummik (upon you and upon your mother).\" It seemed as if that bothered the man, so he said: \"Indeed I have not said except what the Prophet (ﷺ) said; a man sneezed in the presence of the Prophet (ﷺ) and said: 'As-Salamu 'Alaikum (peace be upon you)' so the Prophet (ﷺ) said: ''Alaika Wa 'Ala Ummik (upon you and upon your mother). When one of you sneezes let him say: \"Al-Hamdulillahi Rabbil-'Alamin (All praise is due to the Lord of all that exists)\" and let the one responding to him say: Yarhamukallah (May Allah have mercy upon you)\" and let him reply: Yaghfirullah Li Walakum (May Allah forgive me and you both).\"",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11067",
        "10835",
        "5045"
      ]
    },
    {
      "hadith_no": "3069",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو أحمد، حدثنا سفيان، عن أبي الزبير، عن جابر، عن عمر بن الخطاب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لأنهين أن يسمى رافع وبركة ويسار ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ هكذا رواه أبو أحمد عن سفيان عن أبي الزبير عن جابر عن عمر ورواه غيره عن سفيان عن أبي الزبير عن جابر عن النبي صلى الله عليه وسلم ‏.‏ وأبو أحمد ثقة حافظ والمشهور عند الناس هذا الحديث عن جابر عن النبي صلى الله عليه وسلم وليس فيه عن عمر ‏.‏",
      "text_en": " Narrated 'Umar [bin Al-Khattab]:                     that the Messenger of Allah (ﷺ) said: \"I forbid naming with Rafi, Barakah and Yasar.\"",
      "chain": [
        "30160",
        "20355",
        "20012",
        "11263",
        "34",
        "3"
      ]
    },
    {
      "hadith_no": "3092",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد، حدثنا سفيان، عن الأعمش، عن أبي وائل، عن عبد الله، قال كان رسول الله صلى الله عليه وسلم يتخولنا بالموعظة في الأيام مخافة السآمة علينا ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Abdullah:                     \"The Messenger of Allah (ﷺ) used to take care of us by preaching during the days fearing that we may get bored.\"",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "3121",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو أحمد، حدثنا سفيان، عن ابن أبي ليلى، عن أخيه، عيسى عن عبد الرحمن بن أبي ليلى، عن أبي أيوب الأنصاري، أنه كانت له سهوة فيها تمر فكانت تجيء الغول فتأخذ منه قال فشكا ذلك إلى النبي صلى الله عليه وسلم قال ‏\"‏ فاذهب فإذا رأيتها فقل بسم الله أجيبي رسول الله صلى الله عليه وسلم ‏\"‏ ‏.‏ قال فأخذها فحلفت أن لا تعود فأرسلها فجاء إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ ما فعل أسيرك ‏\"‏ ‏.‏ قال حلفت أن لا تعود فقال ‏\"‏ كذبت وهي معاودة للكذب ‏\"‏ ‏.‏ قال فأخذها مرة أخرى فحلفت أن لا تعود فأرسلها فجاء إلى النبي صلى الله عليه وسلم فقال ‏\"‏ ما فعل أسيرك ‏\"‏ ‏.‏ قال حلفت أن لا تعود ‏.‏ فقال ‏\"‏ كذبت وهي معاودة للكذب ‏\"‏ ‏.‏ فأخذها فقال ما أنا بتاركك حتى أذهب بك إلى النبي صلى الله عليه وسلم ‏.‏ فقالت إني ذاكرة لك شيئا آية الكرسي اقرأها في بيتك فلا يقربك شيطان ولا غيره ‏.‏ قال فجاء إلى النبي صلى الله عليه وسلم فقال ‏\"‏ ما فعل أسيرك ‏\"‏ ‏.‏ قال فأخبره بما قالت ‏.‏ قال ‏\"‏ صدقت وهي كذوب ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏ وفي الباب عن أبى بن كعب ‏.‏",
      "text_en": " Narrated 'Abdur-Rahman bin Abi Laila:                     that Abu Ayyub Al-Ansari had a store house in which he kept dates. A ghoul would come and take from it, so he complained about that to the Prophet (ﷺ). So he said: \"Go, and when you see her say: 'In the Name of Allah, answer to the Messenger of Allah (ﷺ).'\" He said: \"So I caught her, and she swore that she would not return, so I released her.\" He went to the Prophet (ﷺ) and he said: \"What did your captive do?\" He said: \"She swore not to return.\" He said: \"She has lied, and she will come again to lie.\" He said: \"I caught her another time and she swore that she would not return, so I released her, and went to the Prophet (ﷺ).\" He said: \"What did your captive do?\" He said: \"She swore that she would not return.\" So he said: \"She lied and she will come again to lie.\" So he caught her and said: \"I shall not let you go until you accompany me to the Prophet (ﷺ).\" She said: \"I shall tell you something: If you recite Ayat Al-Kursi in your home, then no Shaitan, nor any other shall come near you.\" So he went to the Prophet (ﷺ) and he said: \"What did your captive do?\" He said: \"I informed him of what she said, and he said: 'She told the truth and she is a continuous liar.'\"",
      "chain": [
        "30160",
        "20355",
        "20012",
        "11196",
        "11196",
        "33"
      ]
    },
    {
      "hadith_no": "3167",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد، حدثنا سفيان، عن الأعمش، عن خيثمة، عن الحسن، عن عمران بن حصين، أنه مر على قاص يقرأ ثم سأل فاسترجع ثم قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من قرأ القرآن فليسأل الله به فإنه سيجيء أقوام يقرءون القرآن يسألون به الناس ‏\"‏ ‏.‏ وقال محمود وهذا خيثمة البصري الذي روى عنه جابر الجعفي وليس هو خيثمة بن عبد الرحمن وخيثمة هذا شيخ بصري يكنى أبا نصر قد روى عن أنس بن مالك أحاديث وقد روى جابر الجعفي عن خيثمة هذا أيضا أحاديث ‏.‏ قال أبو عيسى هذا حديث حسن ليس إسناده بذاك ‏.‏",
      "text_en": " Narrated Al-Hasan:                     that 'Imran bin Husain passed by a reciter reciting then he began begging. So he ('Imran) said: 'Indeed we are from Allah and to Him shall we return.' Then he said: 'I heard the Messenger of Allah (ﷺ) saying: 'Whoever recites the Qur'an, then let him ask Allah by it. For indeed there will come a people, who will recite the Qur'an, asking from the people because of it.'\"",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11060",
        "11332",
        "11016",
        "123"
      ]
    },
    {
      "hadith_no": "3172",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on The Virtues of the Qur'an - كتاب فضائل القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد الزبيري، حدثنا خالد بن طهمان أبو العلاء الخفاف، حدثني نافع بن أبي نافع، عن معقل بن يسار، عن النبي صلى الله عليه وسلم قال ‏\"‏ من قال حين يصبح ثلاث مرات أعوذ بالله السميع العليم من الشيطان الرجيم وقرأ ثلاث آيات من آخر سورة الحشر وكل الله به سبعين ألف ملك يصلون عليه حتى يمسي وإن مات في ذلك اليوم مات شهيدا ومن قالها حين يمسي كان بتلك المنزلة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Narrated Ma'qil bin Yasar:                     that the Prophet (ﷺ) said: \"Whoever says three times when he gets up in the morning: 'A'udhu Billahis-Sami Al-'Alim Min Ash-Shaitanir-Rajim' and he recites three Ayat from the end of Surah Al-Hashr - Allah appoints seventy-thousand angels who say Salat upon him until the evening. If he dies on that day, he dies a martyr, and whoever reaches the evening, he holds the same status.\"",
      "chain": [
        "30277",
        "20355",
        "19066",
        "3120"
      ]
    },
    {
      "hadith_no": "3189",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Recitation - كتاب القراءات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "46",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد الزبيري، حدثنا سفيان، عن أبي إسحاق، عن الأسود بن يزيد، عن عبد الله بن مسعود، أن رسول الله صلى الله عليه وسلم كان يقرأ  ‏(‏فهل من مدكر ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Abdullah bin Mas'ud:                     that the Messenger of Allah (ﷺ) would recite: \"Then is there anyone who would remember? (54:17)",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11049",
        "11054",
        "16"
      ]
    },
    {
      "hadith_no": "3263",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد، حدثنا سفيان، عن أبيه، عن أبي الضحى، عن مسروق، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن لكل نبي ولاة من النبيين وإن وليي أبي وخليل ربي ‏\"‏ ‏.‏ ثم قرأ ‏:‏ ‏(‏إن أولى الناس بإبراهيم للذين اتبعوه وهذا النبي والذين آمنوا والله ولي المؤمنين ‏)‏‏.‏",
      "text_en": " Narrated 'Abdullah:                     that the Messenger of Allah (ﷺ) said: \"Every Prophet had a Wali among the Prophets. My Wali is my father Ibrahim the Khalil of my Lord.\" Then he recited: Verily among mankind who have the best claim to Ibrahim, are those who followed him, and this Prophet and those who have believed. And Allah is the Wali (protector) of the believers (3:68).",
      "chain": [
        "30277",
        "20355",
        "20012",
        "20016",
        "11392",
        "11018",
        "16"
      ]
    },
    {
      "hadith_no": "3471",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو أحمد الزبيري، حدثنا سفيان، عن الأعمش، عن مسلم البطين، عن سعيد بن جبير، قال لما أخرج النبي صلى الله عليه وسلم من مكة قال رجل أخرجوا نبيهم فنزلت ‏:‏ ‏(‏ أذن للذين يقاتلون بأنهم ظلموا وإن الله على نصرهم لقدير * الذين أخرجوا من ديارهم بغير حق ‏)‏ النبي صلى الله عليه وسلم وأصحابه ‏.‏",
      "text_en": " Narrated Sa'eed bin Jubair:                     \"When the Prophet (ﷺ) was expelled from Makkah a man said: 'They have driven out their Prophet' so (the following) was revealed: \"Permission (to fight) is given to those who are fought against, because they have been wronged; and surely, Allah is able to give them victory. Those who have been expelled from their homes unjustly (22:39).\" [Those who were expelled were the Prophet (ﷺ) and his Companions.]",
      "chain": [
        "30160",
        "20355",
        "20012",
        "11060",
        "11393",
        "11050"
      ]
    },
    {
      "hadith_no": "3539",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمود بن غيلان، وعبد بن حميد، - المعنى واحد قالا حدثنا أبو أحمد، حدثنا سفيان، عن الأعمش، عن يحيى، قال عبد هو ابن عباد عن سعيد بن جبير، عن ابن عباس، قال مرض أبو طالب فجاءته قريش وجاءه النبي صلى الله عليه وسلم وعند أبي طالب مجلس رجل فقام أبو جهل كى يمنعه وشكوه إلى أبي طالب فقال يا ابن أخي ما تريد من قومك قال ‏\"‏ إني أريد منهم كلمة واحدة تدين لهم بها العرب وتؤدي إليهم العجم الجزية ‏\"‏ ‏.‏ قال كلمة واحدة قال ‏\"‏ كلمة واحدة ‏\"‏ ‏.‏ قال ‏\"‏ يا عم قولوا لا إله إلا الله ‏\"‏ ‏.‏ فقالوا‏:‏ إلها واحدا‏؟‏ ‏(‏ ما سمعنا بهذا في الملة الآخرة إن هذا إلا اختلاق ‏)‏ قال فنزل فيهم القرآن ‏:‏ ‏(‏ص* والقرآن ذي الذكر * بل الذين كفروا في عزة وشقاق ‏)‏ إلى قوله ‏:‏ ‏(‏ما سمعنا بهذا في الملة الآخرة إن هذا إلا اختلاق ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"Abu Talib fell ill, so the Quraish went to see him, and the Prophet (ﷺ) went to see him. There was a gathering there with Abu Talib, so Abu Jahl stood up enraged, to prevent him (the Prophet (ﷺ) from entering).\" He said: \"He complained to Abu Talib. So he (Abu Talib) said: 'O my nephew! What is it that you want from your people?' He said: 'I only want one word from them, for which, if they were to say it, then the Arabs will become their followers, and the non-Arabs will pay Jizyah to them.' He said: 'One word?' He replied: 'One word.' So he said: 'O uncle! Let them say La Ilaha Illallah' so they replied: 'One God? We have not heard (the like) of this in the religion of these later days. This is nothing but an invention.'\" He said: \"So the (following) was revealed in the Qur'an about them: 'Sad. By the Qur'an full of reminding. Those who disbelieve are in false pride and opposition...' up to His saying: 'We have not heard (the like) of this in the religion of these later days. This is nothing but an invention (38:1-7).'\"",
      "chain": [
        "30277",
        "30553",
        "20355",
        "20012",
        "11060",
        "11449",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3407",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد الزبيري، حدثنا سفيان، عن الجريري، عن أبي العلاء بن الشخير، عن رجل، من بني حنظلة قال صحبت شداد بن أوس رضى الله عنه في سفر فقال ألا أعلمك ما كان رسول الله صلى الله عليه وسلم يعلمنا أن نقول اللهم إني أسألك الثبات في الأمر وأسألك عزيمة الرشد وأسألك شكر نعمتك وحسن عبادتك وأسألك لسانا صادقا وقلبا سليما وأعوذ بك من شر ما تعلم وأسألك من خير ما تعلم وأستغفرك مما تعلم إنك أنت علام الغيوب ‏.‏ قال وكان رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما من مسلم يأخذ مضجعه يقرأ سورة من كتاب الله إلا وكل الله به ملكا فلا يقربه شيء يؤذيه حتى يهب متى هب ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث إنما نعرفه من هذا الوجه والجريري هو سعيد بن إياس أبو مسعود الجريري وأبو العلاء اسمه يزيد بن عبد الله بن الشخير ‏.‏",
      "text_en": " A man from Banu Hanzalah said:                     “I accompanied Shaddad bin Aws [may Allah be pleased with him] on a journey, so he said: ‘Should I not teach you what the Messenger of Allah used to teach us? That you say: “O Allah, I ask You for steadfastness in the affair and I ask You for determination upon guidance, and I ask You  to make me grateful for Your favor, and excellence in worshipping You, and I ask You for a truthful tongue and a sound heart, and I seek refuge in You from the evil of what You know, and I ask You for the good of what You know, and I seek Your forgiveness for that which You know. Verily, You are the Knower of all that is hidden (Allahumma Inna As’alukath-Thabata Fil-amri Wa As’aluka Shukra Ni’matika, Wa Husna Ibadika, Wa As’aluka Lisanan Sadiqan Wa Qalban Saliman, Wa A’udhu Bika Min Sharri Ma Ta’lamu, Wa As’aluka Min Khairi Ma Ta’lamu, Wastaghfiruka Mimma Ta’lamu Innaka Anta Allamul-ghuyub).’” He said: ‘The Messenger of Allah said: “There is no Muslim who lays down to sleep while reciting a Surat from Allah’s Book, except that Allah entrusts an angel, so that nothing approaches him to harm him until he awakens, whenever he awakens.”",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11286",
        "11318"
      ]
    },
    {
      "hadith_no": "3492",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو أحمد الزبيري، حدثنا سعد بن أوس، عن بلال بن يحيى العبسي، عن شتير بن شكل، عن أبيه، شكل بن حميد قال أتيت النبي صلى الله عليه وسلم فقلت يا رسول الله علمني تعوذا أتعوذ به ‏.‏ قال فأخذ بكتفي فقال ‏\"‏ قل اللهم إني أعوذ بك من شر سمعي ومن شر بصري ومن شر لساني ومن شر قلبي ومن شر منيي ‏\"‏ ‏.‏ يعني فرجه ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه من حديث سعد بن أوس عن بلال بن يحيى ‏.‏",
      "text_en": " Shakal bin Humaid said:                      \"I came to the Prophetand said: 'O Messenger of Allah, teach me away of seeking refuge so that I may seek refuge by it.\" He said: \"So he took my hand and said: 'Say: O Allah, indeed I seek refuge in Youfrom the evil of my hearing and the evil of my sight, and the evil of my tongue and the evil of my heart, and the evil of my semen (Allahumma inni a`udhu bika min sharri sam`i wa min sharri basari, wa min sharri lisani, wa min sharri qalbi, wa min sharri maniyyi.'\"",
      "chain": [
        "30242",
        "20355",
        "20722",
        "19863",
        "10773"
      ]
    },
    {
      "hadith_no": "3532",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمود بن غيلان حدثنا أبو أحمد حدثنا سفيان عن يزيد بن أبي زياد عن عبد الله بن الحارث عن المطلب بن أبي وداعة قال  جاء العباس إلى رسول الله صلى الله عليه وسلم فكأنه سمع شيئا فقام النبي صلى الله عليه وسلم على المنبر فقال من أنا فقالوا أنت رسول الله عليك السلام قال أنا محمد بن عبد الله بن عبد المطلب إن الله خلق الخلق فجعلني في خيرهم فرقة ثم جعلهم فرقتين فجعلني في خيرهم فرقة ثم جعلهم قبائل فجعلني في خيرهم قبيلة ثم جعلهم بيوتا فجعلني في خيرهم بيتا وخيرهم نسبا  قال أبو عيسى هذا حديث حسن",
      "text_en": " Al-Muttalib bin Abi Wada’ah said:                     “Al-Abbas came to the Messenger of Allah and it is as if he heard something, so the Prophet stood upon the Minbar and said: ‘Who am I?’ They said: ‘You are the Messenger of Allah, upon you be peace.’ He said: ‘I am Muhammad bin Abdullah bin Abdul-Muttalib, indeed Allah created the creation, and He put me in the best group of them, then He made them into two groups, so He put me in the best group of them, the He made them into tribes, so He put me in the best of tribe, then He made them into houses, so He put me in the best of them in tribe and lineage.’”",
      "chain": [
        "30277",
        "20355",
        "20012",
        "10844",
        "912",
        "5295"
      ]
    },
    {
      "hadith_no": "3967",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد، حدثنا سفيان، عن يزيد بن أبي زياد، عن عبد الله بن الحارث، عن المطلب بن أبي وداعة، قال جاء العباس إلى رسول الله صلى الله عليه وسلم فكأنه سمع شيئا فقام النبي صلى الله عليه وسلم على المنبر فقال ‏\"‏ من أنا ‏\"‏ ‏.‏ قالوا أنت رسول الله عليك السلام ‏.‏ قال ‏\"‏ أنا محمد بن عبد الله بن عبد المطلب إن الله خلق الخلق فجعلني في خيرهم ثم جعلهم فرقتين فجعلني في خيرهم فرقة ثم جعلهم قبائل فجعلني في خيرهم قبيلة ثم جعلهم بيوتا فجعلني في خيرهم بيتا وخيرهم نفسا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وروي عن سفيان الثوري عن يزيد بن أبي زياد نحو حديث إسماعيل بن أبي خالد عن يزيد بن أبي زياد عن عبد الله بن الحارث عن العباس بن عبد المطلب ‏.‏",
      "text_en": " Narrated Al-Muttalib bin Abi Wada'ah:                     \"Al-Abbas came to the Messenger of Allah (ﷺ), and it is as if he heard something, so the Prophet (ﷺ) stood upon the Minbar and said: 'Who am I?' They said: 'You are the Messenger of Allah, upon you be peace.' He said: 'I am Muhammad bin 'Abdullah bin 'Abdul-Muttalib, indeed Allah created the creation, and He put me in the best [group] of them, then He made them into two groups, so He put me in the best group of them, then He made them into tribes, so He put me in the best of them in tribe, then He made them into houses, so He put me in the best of them in tribe and lineage.'\"",
      "chain": [
        "30277",
        "20355",
        "20012",
        "10844",
        "912",
        "5295"
      ]
    },
    {
      "hadith_no": "3993",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو أحمد الزبيري، حدثنا إسرائيل، عن منصور، عن إبراهيم، عن علقمة، عن عبد الله، قال إنكم تعدون الآيات عذابا وإنا كنا نعدها على عهد رسول الله صلى الله عليه وسلم بركة لقد كنا نأكل الطعام مع النبي صلى الله عليه وسلم ونحن نسمع تسبيح الطعام ‏.‏ قال وأتي النبي صلى الله عليه وسلم بإناء فوضع يده فيه فجعل الماء ينبع من بين أصابعه فقال النبي صلى الله عليه وسلم ‏\"‏ حى على الوضوء المبارك والبركة من السماء ‏\"‏ ‏.‏ حتى توضأنا كلنا ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated 'Abdullah:                     \"You consider the signs to be punishment, whereas we used to think of them as a blessing during the time of the Messenger of Allah (ﷺ). We used to eat food with the Prophet (ﷺ) and we would hear the food's Tasbih.\" He said: \"And the Prophet (ﷺ) was brought a container, so he put his hand it in, and the water began to spring from between his fingers. So the Prophet (ﷺ) said: 'Hasten to the blessed Wudu and the blessing from the heavens' until all of had performed Wudu.\"",
      "chain": [
        "30160",
        "20355",
        "20311",
        "11067",
        "11051",
        "11017",
        "16"
      ]
    },
    {
      "hadith_no": "4095",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد الزبيري، حدثنا شريك، عن عبد الله بن محمد بن عقيل، عن جابر بن عبد الله، أن النبي صلى الله عليه وسلم قال لعلي ‏\"‏ أنت مني بمنزلة هارون من موسى إلا أنه لا نبي بعدي ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏ وفي الباب عن سعد وزيد بن أرقم وأبي هريرة وأم سلمة ‏.‏",
      "text_en": " Narrated Jabir bin 'Abdullah:                     that the Prophet (ﷺ) said to 'Ali: \"You are to me in the position that Harun was to Musa, except that there is no Prophet after me.\"",
      "chain": [
        "30277",
        "20355",
        "20587",
        "12246",
        "34"
      ]
    },
    {
      "hadith_no": "4193",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، ومحمود بن غيلان، قالا حدثنا أبو أحمد، عن سفيان، عن ليث، عن أبي جهضم، عن ابن عباس، أنه رأى جبريل عليه السلام مرتين ودعا له النبي صلى الله عليه وسلم مرتين ‏.‏ قال أبو عيسى هذا حديث مرسل ‏.‏ ولا نعرف لأبي جهضم سماعا من ابن عباس ‏.‏ وقد روي عن عبيد الله بن عبد الله بن عباس عن ابن عباس ‏.‏ وأبو جهضم اسمه موسى بن سالم ‏.‏",
      "text_en": " Narrated Abu Jahdam:                     from Ibn 'Abbas that he saw Jibra'il (AS), two times and the Prophet (ﷺ) supplicated for him two times.",
      "chain": [
        "30160",
        "30277",
        "20355",
        "20012",
        "20023",
        "17"
      ]
    },
    {
      "hadith_no": "4225",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد، حدثنا سفيان، عن الأعمش، عن أبي وائل، عن خباب، قال هاجرنا مع رسول الله صلى الله عليه وسلم نبتغي وجه الله فوقع أجرنا على الله فمنا من مات ولم يأكل من أجره شيئا ومنا من أينعت له ثمرته فهو يهدبها وإن مصعب بن عمير مات ولم يترك إلا ثوبا كانوا إذا غطوا به رأسه خرجت رجلاه وإذا غطي بها رجلاه خرج رأسه فقال رسول الله صلى الله عليه وسلم ‏\"‏ غطوا رأسه واجعلوا على رجليه الإذخر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Khabbab:                     \"We emigrated with the Messenger of Allah (ﷺ), seeking the Face of Allah. So our reward is with Allah. Among us were those who died and did not consume any of the rewards (in this life), and among us were those who lived to see its fruits and tend to them. Verily, Musab bin 'Umair died without leaving anything behind but a garment. When they covered his head with it, his feet would become exposed. And when they covered his feet with it, his head will become exposed. So the Messenger of Allah (ﷺ) said: 'Cover his head and place Al-Idhkir over his feet.\"",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11060",
        "11353",
        "149"
      ]
    },
    {
      "hadith_no": "4245",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد الزبيري، حدثنا سفيان، عن زبيد، عن شهر بن حوشب، عن أم سلمة، أن النبي صلى الله عليه وسلم جلل على الحسن والحسين وعلي وفاطمة كساء ثم قال ‏\"‏ اللهم هؤلاء أهل بيتي وخاصتي أذهب عنهم الرجس وطهرهم تطهيرا ‏\"‏ ‏.‏ فقالت أم سلمة وأنا معهم يا رسول الله قال ‏\"‏ إنك إلى خير ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح وهو أحسن شيء روي في هذا الباب ‏.‏ وفي الباب عن عمر بن أبي سلمة وأنس بن مالك وأبي الحمراء ومعقل بن يسار وعائشة ‏.‏",
      "text_en": " Narrated Umm Salamah:                     \"The Prophet (ﷺ) put a garment over Al-Hasan, Al-Hussain, 'Ali and Fatimah, then he said: 'O Allah, these are the people of my house and the close ones, so remove the Rijs from them and purify them thoroughly.\" So Umm Salamah said: 'And am I with them, O Messenger of Allah?' He said: \"You are upon good.\"'",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11335",
        "11044",
        "56"
      ]
    },
    {
      "hadith_no": "4333",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمود بن غيلان، حدثنا أبو أحمد، حدثنا سفيان، عن عبد الملك بن عمير، عن عبد الرحمن بن أبي بكرة، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أسلم وغفار ومزينة خير من تميم وأسد وغطفان وبني عامر بن صعصعة ‏\"‏ ‏.‏ يمد بها صوته فقال القوم قد خابوا وخسروا ‏.‏ قال ‏\"‏ فهم خير منهم ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Abu Bakrah:                     that the Messenger of Allah (ﷺ) said: \"Aslam, Ghifar, and Muzainah are better than Tamim, Asad, Ghatafan, and Banu 'Amir bin Sa'sa'ah,\" prolonging his voice when saying it. So the people said: \"They have been treacherous and have lost.\" He said: \"So these are better than them.\"",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11368",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "1361",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا بقية، قال حدثنا الزبيري، أن مكحولا، حدثه أن مسروق بن الأجدع حدثه عن عائشة، قالت رأيت رسول الله صلى الله عليه وسلم يشرب قائما وقاعدا ويصلي حافيا ومنتعلا وينصرف عن يمينه وعن شماله ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"I saw the Messenger of Allah (ﷺ) drink standing and sitting, and he prayed barefoot and with sandals, and he left (after prayer) to the right and to the left.\"",
      "chain": [
        "30123",
        "20644",
        "20355",
        "11066",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "2239",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا أبو أحمد، قال حدثنا سفيان، عن الأعمش، عن عمارة بن عمير، عن عبد الرحمن بن يزيد، عن عبد الله، قال خرجنا مع رسول الله صلى الله عليه وسلم ونحن شباب لا نقدر على شىء قال ‏\"‏ يا معشر الشباب عليكم بالباءة فإنه أغض للبصر وأحصن للفرج ومن لم يستطع فعليه بالصوم فإنه له وجاء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"We went out with the Messenger of Allah and we were young men who could not afford anything. He said: 'O young men, you should get married, for it is more effective in lowering the gaze and protecting one's chastity. Whoever cannot afford it should fast, for it will be a restraint Wija, for him.\"'",
      "chain": [
        "30277",
        "20355",
        "20012",
        "11060",
        "11378",
        "11055",
        "16"
      ]
    },
    {
      "hadith_no": "4126",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا محمد بن رافع، قال حدثنا أبو أحمد الزبيري، قال حدثنا شريك، عن الأعمش، عن أبي الضحى، عن مسروق، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا ترجعوا بعدي كفارا يضرب بعضكم رقاب بعض لا يؤخذ الرجل بجناية أبيه ولا جناية أخيه ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذا خطأ والصواب مرسل ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah [SAW] said: 'Do not revert to disbelievers after I am gone, striking the necks of one another (killing one another). No man is to be punished for the sins of his father, or for the sins of his brother.'\"",
      "chain": [
        "30375",
        "20355",
        "20587",
        "11060",
        "11392",
        "11018",
        "18"
      ]
    },
    {
      "hadith_no": "5656",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا محمود بن غيلان، قال حدثنا أبو داود الحفري، وأبو أحمد الزبيري عن سفيان، عن منصور، عن سالم، عن جابر، أن رسول الله صلى الله عليه وسلم لما نهى عن الظروف شكت الأنصار فقالت يا رسول الله ليس لنا وعاء ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ فلا إذا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir that :                     When the Messenger of Allah [SAW] forbade large water skins that are cut from the top and can no longer be closed, Ansar complained and said: \"O Messenger of Allah, we do not have any vessels.\" The Prophet [SAW] said: \"Then there is no harm.\"",
      "chain": [
        "30277",
        "20668",
        "20355",
        "20012",
        "11067",
        "11011",
        "34"
      ]
    },
    {
      "hadith_no": "73",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا أبو أحمد، حدثنا أبو جعفر الرازي، عن الربيع بن أنس، عن أنس بن مالك، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من فارق الدنيا على الإخلاص لله وحده وعبادته لا شريك له وإقام الصلاة وإيتاء الزكاة مات والله عنه راض ‏\"‏ ‏.‏ قال أنس وهو دين الله الذي جاءت به الرسل وبلغوه عن ربهم قبل هرج الأحاديث واختلاف الأهواء وتصديق ذلك في كتاب الله في آخر ما نزل يقول الله {فإن تابوا}‏ قال خلعوا الأوثان وعبادتها {وأقاموا الصلاة وآتوا الزكاة}‏ وقال في آية أخرى ‏{فإن تابوا وأقاموا الصلاة وآتوا الزكاة فإخوانكم في الدين}‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The Messenger of Allah (ﷺ) said: 'Whoever departs this wold with sincerity towards Allah, worshipping Him alone with no partner, establishing regular prayer and paying Zakat, he dies while Allah is pleased with him.'\" Anas said: \"This is the religion of Allah which was brought by the Messengers, and which they conveyed from their Lord before there arose the confusion of people's chattering and conflicting desires.This is confirmed in the Book of Allah, in one of the Last Verses to be revealed, where Allah says: \"But if they repent.\" Renounce their idols and worshipping them; \"And establish Salat and give Zakat.\" And Allah says in another Verse.\" But if they repent, perform Salat and give Zakat, then they are your brethren in religion.\" (Da'if)Another chain with similar wording.",
      "chain": [
        "30395",
        "20355",
        "20746",
        "19844",
        "19"
      ]
    },
    {
      "hadith_no": "429",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا زيد بن الحباب، ح وحدثنا محمد بن بشار، حدثنا أبو عامر العقدي، ح وحدثنا أحمد بن منيع، حدثنا أبو أحمد الزبيري، قالوا حدثنا كثير بن زيد، عن ربيح بن عبد الرحمن بن أبي سعيد، عن أبيه، عن أبي سعيد، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ لا وضوء لمن لم يذكر اسم الله عليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed that:                     The Messenger of Allah said: \"There is no ablution for one who does not mention the Name of Allah (before doing it).\"",
      "chain": [
        "30216",
        "20650",
        "30160",
        "20443",
        "30242",
        "20355",
        "22171",
        "22055",
        "11879",
        "38"
      ]
    },
    {
      "hadith_no": "631",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن المثنى أبو موسى، حدثنا عبد الرحمن بن مهدي، وأبو أحمد عن سفيان، عن معمر، عن قتادة، عن أنس، أن النبي  صلى الله عليه وسلم  كان يطوف على نسائه في غسل واحد ‏.‏",
      "text_en": " It was narrated from Anas that:                     The Prophet used to go round to all his wives with one bath.",
      "chain": [
        "30170",
        "20033",
        "20355",
        "20012",
        "20115",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1203",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن سنان، ومحمد بن عبادة الواسطيان، قالا حدثنا أبو أحمد، حدثنا سفيان، عن أبي إسحاق، عن مجاهد، عن ابن عمر، قال رمقت النبي  صلى الله عليه وسلم  شهرا فكان يقرأ في الركعتين قبل الفجر ‏{قل يا أيها الكافرون}‏ و ‏{قل هو الله أحد}‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “I watched the Prophet (ﷺ) foramonth, and in the two Rak’ah before Fajr he used to recite: “Say:Oyou disbelievers!” [Al-Kafirun (109)] and “Say: Allah is One.”[Al-Ikhlas (112)]",
      "chain": [
        "30297",
        "30378",
        "20355",
        "20012",
        "11049",
        "11028",
        "18"
      ]
    },
    {
      "hadith_no": "1227",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا أبو أحمد، حدثنا يونس بن أبي إسحاق، عن أبيه، عن سعيد بن جبير، عن ابن عباس، أن رسول الله  صلى الله عليه وسلم  كان يوتر ب ‏{سبح اسم ربك الأعلى ‏}‏ و ‏{قل يا أيها الكافرون }‏ و ‏{قل هو الله أحد }‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Abbas that the Messenger of Allah (ﷺ)used toperform Witr and recite:                      “Glorify the Name of your Lord theMostHigh,” [Al-A’la (87)] “Say: O you disbelievers!” [Al-Kafirun(109)] and ‘Say: Allah is One.”. [Al-Ikhlas (112)]",
      "chain": [
        "30395",
        "20355",
        "10846",
        "11049",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1315",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو أحمد، حدثنا سفيان، عن منصور، عن هلال بن يساف، عن أبي المثنى، عن أبي أبى ابن امرأة، عبادة بن الصامت يعني عن عبادة بن الصامت، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ سيكون أمراء تشغلهم أشياء يؤخرون الصلاة عن وقتها فاجعلوا صلاتكم معهم تطوعا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Ubadah bin Samit that the Prophet (ﷺ) said:                     “Therewill be leaders who will be distracted by matters and they willdelaythe prayer until after its proper time. So make your prayer withthemvoluntary.”",
      "chain": [
        "30160",
        "20355",
        "20012",
        "11067",
        "10835",
        "40"
      ]
    },
    {
      "hadith_no": "1370",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا أبو أحمد، حدثنا إسرائيل، عن عثمان بن المغيرة، عن إياس بن أبي رملة الشامي، قال سمعت رجلا، سأل زيد بن أرقم هل شهدت مع رسول الله  صلى الله عليه وسلم  عيدين في يوم قال نعم ‏.‏ قال فكيف كان يصنع قال صلى العيد ثم رخص في الجمعة ثم قال ‏\"‏ من شاء أن يصلي فليصل ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Iyas bin Abi Ramlah Ash-Shami said:                      “I heard amanasking Zaid bin Arqam: ‘Were you present with the Messenger ofAllah (ﷺ) when there were two ‘Eid on one day?’ He said: ‘Yes.’Hesaid: ‘What did he do?’ He said: ‘he prayed the ‘Eidprayer, then hegranted a concession not to pray the Friday, then hesaid: “Whoeverwants to pray (Friday), let him do so.”",
      "chain": [
        "30395",
        "20355",
        "20311",
        "11640"
      ]
    },
    {
      "hadith_no": "1614",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا محمد بن عباد بن آدم، حدثنا أبو أحمد، حدثنا سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال كان رسول الله  صلى الله عليه وسلم  يعلمهم إذا خرجوا إلى المقابر كان قائلهم يقول السلام عليكم أهل الديار من المؤمنين والمسلمين وإنا إن شاء الله بكم لاحقون نسأل الله لنا ولكم العافية ‏.‏",
      "text_en": " It wasnarrated from Sulaiman bin Buraidah that his father said:                      “TheMessenger of Allah (ﷺ) used to teach them, when they went out tothegraveyard, to say: As-salamu ‘alaykum ahlad-diyarminal-mu’minina wal-muslimin, wa inna insha’ Allah bikum lahiqun,nas’alul-laha lana walakumul-‘afiyah (Peace be upon you, Oinhabitants of the abodes,believers and Muslims, and we will joinyou soon if Allah wills. Weask Allah for well-being for us and foryou).’”",
      "chain": [
        "34211",
        "20355",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "1951",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن سنان، حدثنا أبو أحمد، حدثنا إسرائيل، عن أبي إسحاق، عن أبي عبيدة، عن عبد الله، قال تزوج النبي  صلى الله عليه وسلم  عائشة وهي بنت سبع وبنى بها وهي بنت تسع وتوفي عنها وهي بنت ثماني عشرة سنة ‏.‏",
      "text_en": " It was narrated that:                     Abdullah said: “The Prophet married Aishah when she was seven years old, and consummated the marriage with her when she was nine, and he passed away when she was eighteen.”",
      "chain": [
        "30297",
        "20355",
        "20311",
        "11049",
        "10",
        "16"
      ]
    },
    {
      "hadith_no": "2236",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا أبو أحمد، حدثنا إسرائيل، عن علي بن سالم بن ثوبان، عن علي بن زيد بن جدعان، عن سعيد بن المسيب، عن عمر بن الخطاب، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الجالب مرزوق والمحتكر ملعون ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Umar bin Khattab that the Messenger of Allah (ﷺ) said:                     \"The importer is blessed with provision and the hoarder is cursed.\"",
      "chain": [
        "30395",
        "20355",
        "20311",
        "10664",
        "11002",
        "3"
      ]
    },
    {
      "hadith_no": "2606",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Lost Property - كتاب اللقطة",
      "chapter_no": "18",
      "text_ar": "حدثنا نصر بن عليى الجهضمي، حدثنا أبو أحمد، عن إسرائيل، عن سماك، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ في الركاز الخمس ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn`Abbas that the Messenger of Allah (ﷺ) said:                     “One fifth is due on buried treasure.”",
      "chain": [
        "20355",
        "20311",
        "10770",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3565",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإبراهيم بن سعيد الجوهري، قالا حدثنا أبو أحمد، عن عمر بن سعيد بن أبي حسين، حدثنا عطاء، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ما أنزل الله داء إلا أنزل له شفاء ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “Allah does not send down any disease, but He also sends downthecure.”",
      "chain": [
        "30201",
        "30498",
        "20355",
        "10652",
        "11029",
        "13"
      ]
    },
    {
      "hadith_no": "3729",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا نصر بن علي، حدثنا أبو أحمد، حدثنا سفيان، عن أبي الزبير، عن جابر، عن عمر بن الخطاب، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لئن عشت إن شاء الله لأنهين أن يسمى رباح ونجيح وأفلح ونافع ويسار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Umar ibn Al-Khattab that the Prophet(ﷺ) said:                     \"If I live- if Allah wills - I will forbid the names Rabah(profit), Najih(saved), Aflah (Successful), Nafi (beneficial) and Yasar(prosperity).\"",
      "chain": [
        "30395",
        "20355",
        "20012",
        "11263",
        "34",
        "3"
      ]
    },
    {
      "hadith_no": "4118",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عثمان بن أبي شيبة، قال حدثنا أبو أحمد الزبيري، حدثنا زمعة بن صالح، عن الزهري، عن سالم، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يلدغ المؤمن من جحر مرتين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn ‘Umar that the Messenger of Allah (ﷺ)said:                      ‘The believer should not be stung from the same hole twice.’”",
      "chain": [
        "30203",
        "20355",
        "10636",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "4196",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا أبو أحمد، حدثنا بشير بن سلمان، عن سيار، عن طارق، عن عبد الله، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ بين يدى الساعة مسخ وخسف وقذف ‏\"‏ ‏.‏",
      "text_en": " It was narrated from ‘Abdullah that the Prophet (ﷺ) said:                      “Justbefore the Hour comes there will be transformations, the earthcollapsing, and Qadhf. (i.e. the throwing of stones perhaps as ameansof punishment – maybe it refers to landslides).”",
      "chain": [
        "30395",
        "20355",
        "11429",
        "11355",
        "16"
      ]
    }
  ],
  "total_hadiths": 112
}