{
  "id": "20374",
  "name": "Bakr bin Madr bin Muhammad بكر بن مضر بن محمد",
  "full_name": "Bakr bin Madr bin Muhammad بكر بن مضر بن محمد",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "100",
      "date_gregorian": "NA",
      "date_display": [
        "100 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "174",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  ت  س  -  ثقة ثبت ]",
      "Hadith",
      "Fiqh"
    ],
    "tags": [
      "Clinet",
      "al-Masri",
      "Imam"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "30486",
      "name": "Ishaq bin Bakr bin Madr إسحاق بن بكر بن مضر",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "teachers": [],
  "students": [
    {
      "id": "30486",
      "name": "Ishaq bin Bakr bin Madr إسحاق بن بكر بن مضر",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "390",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "أخبرنا يحيى بن بكير، حدثنا بكر بن مضر، عن جعفر، عن ابن هرمز، عن عبد الله بن مالك ابن بحينة، أن النبي صلى الله عليه وسلم كان إذا صلى فرج بين يديه حتى يبدو بياض إبطيه‏.‏ وقال الليث حدثني جعفر بن ربيعة نحوه‏.‏",
      "text_en": "      Narrated 'Abdullah bin Malik:                          Ibn Buhaina, \"When the Prophet prayed, he used to separate his arms      from his body so widely that the whiteness of his armpits was      visible.\"",
      "chain": [
        "30399",
        "20374",
        "11407",
        "11197",
        "932"
      ]
    },
    {
      "hadith_no": "807",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا يحيى بن بكير، قال حدثني بكر بن مضر، عن جعفر، عن ابن هرمز، عن عبد الله بن مالك ابن بحينة، أن النبي صلى الله عليه وسلم كان إذا صلى فرج بين يديه حتى يبدو بياض إبطيه‏.‏ وقال الليث حدثني جعفر بن ربيعة نحوه‏.‏",
      "text_en": " Narrated `Abdullah bin Malik bin Buhaina:                     Whenever the Prophet used to offer prayer he used to keep arms away (from the body) so that the whiteness of his armpits was visible.",
      "chain": [
        "30399",
        "20374",
        "11407",
        "11197",
        "932"
      ]
    },
    {
      "hadith_no": "3605",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر بن مضر، عن جعفر بن ربيعة، عن الأعرج، عن عبد الله بن مالك ابن بحينة الأسدي، قال كان النبي صلى الله عليه وسلم إذا سجد فرج بين يديه حتى نرى إبطيه‏.‏ قال وقال ابن بكير حدثنا بكر بياض إبطيه‏.‏",
      "text_en": " Narrated `Abdullah bin Malik bin Buhaina Al-Asdi:                     When the Prophet prostrated, he used to keep his arms so widely apart that we used to see his armpits. (The sub-narrator, Ibn Bukair said, \"The whiteness of his armpits.\")",
      "chain": [
        "30367",
        "20374",
        "11407",
        "11197"
      ]
    },
    {
      "hadith_no": "3681",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني خلف بن خالد القرشي، حدثنا بكر بن مضر، عن جعفر بن ربيعة، عن عراك بن مالك، عن عبيد الله بن عبد الله بن مسعود، عن ابن عباس  رضى الله عنهما أن القمر، انشق في زمان النبي صلى الله عليه وسلم‏.",
      "text_en": " Narrated Ibn `Abbas:                     The moon was split into two parts during the lifetime of the Prophet.",
      "chain": [
        "20374",
        "11407",
        "11204",
        "17"
      ]
    },
    {
      "hadith_no": "3918",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا عثمان بن صالح، حدثنا بكر بن مضر، قال حدثني جعفر بن ربيعة، عن عراك بن مالك، عن عبيد الله بن عبد الله بن عتبة بن مسعود، عن عبد الله بن عباس  رضى الله عنهما أن القمر، انشق على زمان رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Abdullah bin `Abbas:                     During the lifetime of Allah's Apostle the moon was split (into two places).",
      "chain": [
        "30236",
        "20374",
        "11407",
        "11204",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "4413",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يحيى بن سليمان، حدثني ابن وهب، أخبرني عمرو،‏.‏ وقال بكر بن مضر عن عمرو بن الحارث، عن بكير، أن كريبا، مولى ابن عباس حدثه أن ابن عباس وعبد الرحمن بن أزهر والمسور بن مخرمة أرسلوا إلى عائشة  رضى الله عنها  فقالوا اقرأ عليها السلام منا جميعا، وسلها عن الركعتين بعد العصر، وإنا أخبرنا أنك تصليها، وقد بلغنا أن النبي صلى الله عليه وسلم نهى عنها، قال ابن عباس وكنت أضرب مع عمر الناس عنهما‏.‏ قال كريب فدخلت عليها، وبلغتها ما أرسلوني، فقالت سل أم سلمة‏.‏ فأخبرتهم، فردوني إلى أم سلمة بمثل ما أرسلوني إلى عائشة، فقالت أم سلمة سمعت النبي صلى الله عليه وسلم ينهى عنهما، وإنه صلى العصر ثم دخل على وعندي نسوة من بني حرام من الأنصار، فصلاهما، فأرسلت إليه الخادم فقلت قومي إلى جنبه فقولي تقول أم سلمة يا رسول الله ألم أسمعك تنهى عن هاتين الركعتين فأراك تصليهما‏.‏ فإن أشار بيده فاستأخري‏.‏ ففعلت الجارية، فأشار بيده، فاستأخرت عنه، فلما انصرف قال ‏\"‏ يا بنت أبي أمية، سألت عن الركعتين بعد العصر، إنه أتاني أناس من عبد القيس بالإسلام من قومهم، فشغلوني عن الركعتين اللتين بعد الظهر، فهما هاتان ‏\"‏‏.‏",
      "text_en": " Narrated Bukair:                     That Kuraib, the freed slave of Ibn `Abbas told him that Ibn `Abbas, `Abdur-Rahman bin Azhar and Al-Miswar bin Makhrama sent him to `Aisha saying, \"Pay her our greetings and ask her about our offering of the two-rak`at after `Asr Prayer, and tell her that we have been informed that you offer these two rak`at while we have heard that the Prophet had forbidden their offering.\" Ibn `Abbas said, \"I and `Umar used to beat the people for their offering them.\" Kuraib added, \"I entered upon her and delivered their message to her.' She said, 'Ask Um Salama.' So, I informed them (of `Aisha's answer) and they sent me to Um Salama for the same purpose as they sent me to `Aisha. Um Salama replied, 'I heard the Prophet forbidding the offering of these two rak`at. Once the Prophet offered the `Asr prayer, and then came to me. And at that time some Ansari women from the Tribe of Banu Haram were with me. Then (the Prophet ) offered those two rak`at, and I sent my (lady) servant to him, saying, 'Stand beside him and say (to him): Um Salama says, 'O Allah's Apostle! Didn't I hear you forbidding the offering of these two rak`at (after the `Asr prayer yet I see you offering them?' And if he beckons to you with his hand, then wait behind.' So the lady slave did that and the Prophet beckoned her with his hand, and she stayed behind, and when the Prophet finished his prayer, he said, 'O the daughter of Abu Umaiya (i.e. Um Salama), You were asking me about these two rak`at after the `Asr prayer. In fact, some people from the tribe of `Abdul Qais came to me to embrace Islam and busied me so much that I did not offer the two rak`at which were offered after Zuhr compulsory prayer, and these two rak`at (you have seen me offering) make up for those.\"",
      "chain": [
        "30220",
        "20029",
        "20374",
        "20377",
        "11154"
      ]
    },
    {
      "hadith_no": "4548",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا قتيبة، حدثنا بكر بن مضر، عن عمرو بن الحارث، عن بكير بن عبد الله، عن يزيد، مولى سلمة بن الأكوع عن سلمة، قال لما نزلت ‏{‏وعلى الذين يطيقونه فدية طعام مسكين‏}‏ كان من أراد أن يفطر ويفتدي حتى نزلت الآية التي بعدها فنسختها‏.‏ مات بكير قبل يزيد‏.‏",
      "text_en": " Narrated Salama:                     When the Divine Revelation: \"For those who can fast, they had a choice either fast, or feed a poor for every day,\" (2.184) was revealed, it was permissible for one to give a ransom and give up fasting, till the Verse succeeding it was revealed and abrogated it.",
      "chain": [
        "30367",
        "20374",
        "20377",
        "11154",
        "237"
      ]
    },
    {
      "hadith_no": "4740",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا سعيد بن تليد، حدثنا عبد الرحمن بن القاسم، عن بكر بن مضر، عن عمرو بن الحارث، عن يونس بن يزيد، عن ابن شهاب، عن سعيد بن المسيب، وأبي، سلمة بن عبد الرحمن عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يرحم الله لوطا، لقد كان يأوي إلى ركن شديد، ولو لبثت في السجن ما لبث يوسف لأجبت الداعي، ونحن أحق من إبراهيم إذ قال له ‏{‏أولم تؤمن قال بلى ولكن ليطمئن قلبي‏}‏‏\"‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"May Allah bestow His Mercy on (Prophet) Lot. (When his nation troubled him) he wished if he could betake himself to some powerful support; and if I were to remain in prison for the period Joseph had remained, I would surely respond to the call; and we shall have more right (to be in doubt) than Abraham: When Allah said to him, \"Don't you believe?' Abraham said, 'Yes, (I do believe) but to be stronger in faith; (2.260)",
      "chain": [
        "27421",
        "10530",
        "20374",
        "20377",
        "20475",
        "11013",
        "11002",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "251",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنيه أبو الطاهر، أخبرنا ابن وهب، عن بكر بن مضر، عن ابن الهاد، بهذا الإسناد مثله ‏.‏",
      "text_en": "",
      "chain": [
        "20029",
        "20374"
      ]
    },
    {
      "hadith_no": "334",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثني موسى بن قريش التميمي، حدثنا إسحاق بن بكر بن مضر، حدثني أبي، حدثني جعفر بن ربيعة، عن عراك بن مالك، عن عروة بن الزبير، عن عائشة، زوج النبي صلى الله عليه وسلم أنها قالت إن أم حبيبة بنت جحش التي كانت تحت عبد الرحمن بن عوف شكت إلى رسول الله صلى الله عليه وسلم الدم فقال لها ‏\"‏ امكثي قدر ما كانت تحبسك حيضتك ثم اغتسلي ‏\"‏ ‏.‏ فكانت تغتسل عند كل صلاة ‏.‏",
      "text_en": " 'A'isha, the wife of the Apostle (may peace be upon him), said:                      Umm Habiba b. Jahsh who was the spouse of Abd al- Rahman b. Auf made a complaint to the Messenger of Allah (may peace be upon him) about blood (which flows beyond the menstrual period). He said to her: Remain away (from prayer) equal (to the length of time) that your menstruation holds you back. After this, bathe yourself. And she washed herself before every prayer.",
      "chain": [
        "30568",
        "30486",
        "20374",
        "11407",
        "11204",
        "10511"
      ]
    },
    {
      "hadith_no": "491",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر، - وهو ابن مضر - عن ابن الهاد، عن محمد بن إبراهيم، عن عامر بن سعد، عن العباس بن عبد المطلب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا سجد العبد سجد معه سبعة أطراف وجهه وكفاه وركبتاه وقدماه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Al-'Abbas bin 'Abdul Muttalib that he heard the Messenger of Allah () say:                      \"When a person prostates, he prostates on seven part of the body: His face, his hands, his knees and his feet.\"",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10554",
        "100"
      ]
    },
    {
      "hadith_no": "495",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر، - وهو ابن مضر - عن جعفر بن ربيعة، عن الأعرج، عن عبد الله بن مالك ابن بحينة، أن رسول الله صلى الله عليه وسلم كان إذا صلى فرج بين يديه حتى يبدو بياض إبطيه ‏.‏",
      "text_en": " 'Abdullah b. Malik ibn Bujainah reported:                      When the Prophet (may peace be upon him) prostrated, lie spread out his arms so that the whiteness of his armpits was visible.",
      "chain": [
        "30367",
        "20374",
        "11407",
        "11197",
        "932"
      ]
    },
    {
      "hadith_no": "1554",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا ليث، ح وقال قتيبة حدثنا بكر، - يعني ابن مضر - كلاهما عن ابن الهاد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال وفي حديث بكر أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ أرأيتم لو أن نهرا بباب أحدكم يغتسل منه كل يوم خمس مرات هل يبقى من درنه شىء ‏\"‏ ‏.‏ قالوا لا يبقى من درنه شىء ‏.‏ قال ‏\"‏ فذلك مثل الصلوات الخمس يمحو الله بهن الخطايا ‏\"‏ ‏.‏",
      "text_en": " In the hadith narrated of the authority of Abd Huraira the Messenger of Allah (may peace be upon him) is reported to have said. while in the hadith narrated by Bakr (the words are like this):                      He heard the Messenger of Allah (may peace be upon him) as saying: just see, can anything of his filthiness remain (on the body of) any one of you if there were a river at his door in which he washed himself five times daily? They, said: Nothing of his filthiness will remain (on his body). He said: That is like the five prayers by which Allah obliterates sins.",
      "chain": [
        "30367",
        "20023",
        "30367",
        "20374",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2741",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر، - يعني ابن مضر - عن عمرو بن الحارث، عن بكير، عن يزيد، مولى سلمة عن سلمة بن الأكوع، - رضى الله عنه - قال لما نزلت هذه الآية ‏{‏ وعلى الذين يطيقونه فدية طعام مسكين‏}‏ كان من أراد أن يفطر ويفتدي ‏.‏ حتى نزلت الآية التي بعدها فنسختها ‏.‏",
      "text_en": " Salama b. Akwa' (Allah be pleased with him) reported that when this verse was revealed:                     \" And as for those who can fast (but do not) expiation is the feeding of a needy person\" (ii. 183), (he who liked to observe fast did observe it) and he who felt reluctant to observe it ate and expiated till the verse was revealed which abro- gated it.",
      "chain": [
        "30367",
        "20374",
        "20377",
        "11154",
        "237"
      ]
    },
    {
      "hadith_no": "2826",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر، - وهو ابن مضر - عن ابن الهاد، عن محمد، بن إبراهيم عن أبي سلمة بن عبد الرحمن، عن أبي سعيد الخدري، - رضى الله عنه - قال كان رسول الله صلى الله عليه وسلم يجاور في العشر التي في وسط الشهر فإذا كان من حين تمضي عشرون ليلة ويستقبل إحدى وعشرين يرجع إلى مسكنه ورجع من كان يجاور معه ثم إنه أقام في شهر جاور فيه تلك الليلة التي كان يرجع فيها فخطب الناس فأمرهم بما شاء الله ثم قال ‏\"‏ إني كنت أجاور هذه العشر ثم بدا لي أن أجاور هذه العشر الأواخر فمن كان اعتكف معي فليبت في معتكفه وقد رأيت هذه الليلة فأنسيتها فالتمسوها في العشر الأواخر في كل وتر وقد رأيتني أسجد في ماء وطين ‏\"‏ ‏.‏ قال أبو سعيد الخدري مطرنا ليلة إحدى وعشرين فوكف المسجد في مصلى رسول الله صلى الله عليه وسلم فنظرت إليه وقد انصرف من صلاة الصبح ووجهه مبتل طينا وماء ‏.‏",
      "text_en": " Abu Sa'id al-Khudri (Allah be pleased with him) reported that Allah's Messenger (may peace be upon him) spent in devotion (in i'tikaf) the middle ten nights of the month of Ramadan, and when twenty nights were over and it was the twenty-first night, he went back to his residence and those who were along with him also returned (to their respective residences). He spent one month in devotion. Then he addressed the people on the night he came back (to his residence) and commanded them as Allah desired (him to command) and then said:                      I used to devote myself (observe i'tikaf) during these ten (nights). Then I started devoting myself in the last ten (nights). And he who desires to observe i'tikaf along with me should spend the night) at his place of i'tikaf. And I saw this night (Lailat-ul-Qadr) but I forgot it (the exact night) ; so seek it;In the last ten nights on odd numbers. I saw (the glimpses of that dream) that I was prostrating in water and mud. Abu Sa'id al-Khudri said: It rained on the twenty-first night and the water dripped (from the roof) of the mosque at the place where the Messenger of Allah (may peace be upon him) observed prayer. I looked at him and as he completed the dawn prayer, (I found) his face was wet with mud and water.",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "3381",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا بكر، - يعني ابن مضر - عن ابن الهاد، عن أبي، بكر بن محمد عن عبد الله بن عمرو بن عثمان، عن رافع بن خديج، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن إبراهيم حرم مكة وإني أحرم ما بين لابتيها ‏\"‏ ‏.‏ يريد المدينة ‏.‏",
      "text_en": " Rafi' b. Khadij reported Allah's Messenger (may peace be upon him) as saying:                      Ibrahim declared Mecca as sacred and I declare sacred the area between its two stony grounds (lava lands by which he meant Medina).",
      "chain": [
        "30367",
        "20374",
        "11234",
        "10933",
        "1986"
      ]
    },
    {
      "hadith_no": "5057",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثناه داود بن رشيد، حدثنا الوليد، عن بكر بن مضر، عن عمرو بن الحارث، عن أبي علي الهمداني، قال سمعت عقبة بن عامر، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This tradition has also been narrated on the same authority through another chain of transmitters.",
      "chain": [
        "30248",
        "20733",
        "20374",
        "20377",
        "189"
      ]
    },
    {
      "hadith_no": "6863",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر، - يعني ابن مضر - عن ابن الهاد، أن زياد، بن أبي زياد مولى ابن عياش حدثه عن عراك بن مالك، سمعته يحدث، عمر بن عبد العزيز عن عائشة، أنها قالت جاءتني مسكينة تحمل ابنتين لها فأطعمتها ثلاث تمرات فأعطت كل واحدة منهما تمرة ورفعت إلى فيها تمرة لتأكلها فاستطعمتها ابنتاها فشقت التمرة التي كانت تريد أن تأكلها بينهما فأعجبني شأنها فذكرت الذي صنعت لرسول الله صلى الله عليه وسلم فقال ‏\"‏ إن الله قد أوجب لها بها الجنة أو أعتقها بها من النار ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported:                      A poor woman came to me along with her daughters. I gave her three dates. She gave a date to each of them and then she took up one date and brought that to her mouth in order to eat that, but her daughters expressed desire to eat it. She then divided the date that she intended to eat between them. This (kind) treatment of her impressed me and I mentioned that which she did to Allah's Messenger (may peace be upon him). Thereupon he said: Verily Allah has assured Paradise for her, because of (this act) of her, or He has rescued her from Hell-Fire.",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11204",
        "11010",
        "53"
      ]
    },
    {
      "hadith_no": "7257",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثنا موسى بن قريش التميمي، حدثنا إسحاق بن بكر بن مضر، حدثني أبي، حدثنا جعفر بن ربيعة، عن عراك بن مالك، عن عبيد الله بن عبد الله بن عتبة بن مسعود، عن ابن عباس، قال إن القمر انشق على زمان رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Ibn 'Abbas reported that the moon was split up during the lifetime of Allah's Messenger (may peace he upon him).",
      "chain": [
        "30568",
        "30486",
        "20374",
        "11407",
        "11204",
        "11004",
        "17"
      ]
    },
    {
      "hadith_no": "7672",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر، - يعني ابن مضر - عن ابن الهاد، عن محمد، بن إبراهيم عن عيسى بن طلحة، عن أبي هريرة، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن العبد ليتكلم بالكلمة ينزل بها في النار أبعد ما بين المشرق والمغرب ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that he heard Allah's Messenger (may peace be upon him) as saying:                      The servant speaks words for which he is sent down to the Hell-Fire farther than the distance between the east and the west.",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "129",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر، - يعني ابن مضر - عن ابن عجلان، عن عبد الله بن محمد بن عقيل، أن ربيع بنت معوذ ابن عفراء، أخبرته قالت، رأيت رسول الله صلى الله عليه وسلم يتوضأ - قالت - فمسح رأسه ومسح ما أقبل منه وما أدبر وصدغيه وأذنيه مرة واحدة ‏.‏",
      "text_en": " Al-Rubayyi’ daughter of Mu’awwidh b. ‘Afra’ said:                      I saw the Messenger of Allah (ﷺ) performing ablution. He wiped his head front and back, his temples and his ears once.",
      "chain": [
        "30367",
        "20374",
        "10616",
        "12246",
        "617"
      ]
    },
    {
      "hadith_no": "464",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، - يعني ابن سعيد - حدثنا بكر، - يعني ابن مضر - عن عمرو بن الحارث، عن بكير، عن نافع، أن عمر بن الخطاب، كان ينهى أن يدخل، من باب النساء ‏.‏",
      "text_en": " Nafi said :                      ‘Umar b. al-Khattab used to prohibit (men) to enter through the door reserved for women.",
      "chain": [
        "30367",
        "20374",
        "20377",
        "11154",
        "11014",
        "3"
      ]
    },
    {
      "hadith_no": "796",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، عن بكر، - يعني ابن مضر - عن ابن عجلان، عن سعيد المقبري، عن عمر بن الحكم، عن عبد الله بن عنمة المزني، عن عمار بن ياسر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الرجل لينصرف وما كتب له إلا عشر صلاته تسعها ثمنها سبعها سدسها خمسها ربعها ثلثها نصفها ‏\"‏ ‏.‏",
      "text_en": " ‘Ammar b. Yasir said:                      I heard the apostle of Allah (ﷺ) say: A man returns after saying his prayer while a tenth part of his prayer, or a ninth part, or an eight part, or a seventh part, or a sixth part, or a fifth part, or a third part, or half of it, is recorded for him.",
      "chain": [
        "30367",
        "20374",
        "10616",
        "11168",
        "11897",
        "5133",
        "25"
      ]
    },
    {
      "hadith_no": "891",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر، - يعني ابن مضر - عن ابن الهاد، عن محمد بن إبراهيم، عن عامر بن سعد، عن العباس بن عبد المطلب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا سجد العبد سجد معه سبعة آراب وجهه وكفاه وركبتاه وقدماه ‏\"‏ ‏.‏",
      "text_en": " ‘Abbas b. ‘Abd al-Muttalib said that he heard the Messenger of Allah (ﷺ) as saying:                      when a servant (of Allah) prostrates himself, the seven limbs, i.e, his face, his palms, his knees and his feet prostrate along with him.",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10554",
        "100"
      ]
    },
    {
      "hadith_no": "2315",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر، - يعني ابن مضر - عن عمرو بن الحارث، عن بكير، عن يزيد، مولى سلمة عن سلمة بن الأكوع، قال لما نزلت هذه الآية ‏{‏ وعلى الذين يطيقونه فدية طعام مسكين ‏}‏ كان من أراد منا أن يفطر ويفتدي فعل حتى نزلت الآية التي بعدها فنسختها ‏.‏",
      "text_en": " Salamah bin Al Akwa said “After the revelation of the verse “For those who can do it(with hardship) is a ransom, the feeding of one, that is indigent, is one of us intended to leave fast and pay ransom, he could do so.” until the verse following it was revealed and abrogated the (previous) verse.”",
      "chain": [
        "30367",
        "20374",
        "20377",
        "11154",
        "237"
      ]
    },
    {
      "hadith_no": "2361",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة بن سعيد، أن بكر بن مضر، حدثهم عن ابن الهاد، عن عبد الله بن خباب، عن أبي سعيد الخدري، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تواصلوا فأيكم أراد أن يواصل فليواصل حتى السحر ‏\"‏ ‏.‏ قالوا فإنك تواصل ‏.‏ قال ‏\"‏ إني لست كهيئتكم إن لي مطعما يطعمني وساقيا يسقيني ‏\"‏ ‏.‏",
      "text_en": " Narrated Abu Sa'id al-Khudri:                     The Messenger of Allah (ﷺ) as saying: Do not observe perpetual fasting. If any of you wants to observe perpetual fast, he should observe it until the dawn. They (the people) asked: You observe perpetual fast ? He replied: My position is not like that of yours. There is One Who gives me to eat, and there is One who gives me to drink.",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11182",
        "38"
      ]
    },
    {
      "hadith_no": "4679",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا ابن وهب، عن بكر بن مضر، عن ابن الهاد، عن عبد الله بن دينار، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ما رأيت من ناقصات عقل ولا دين أغلب لذي لب منكن ‏\"‏ ‏.‏ قالت وما نقصان العقل والدين قال ‏\"‏ أما نقصان العقل فشهادة امرأتين شهادة رجل وأما نقصان الدين فإن إحداكن تفطر رمضان وتقيم أياما لا تصلي ‏\"‏ ‏.‏",
      "text_en": " 'Abd Allah b. 'Umar reported the Messenger of Allah (ﷺ) as saying:                      I did not see more defective in respect of reason and religion than the wise of you (women). A woman asked: What is the defect of reason and religion ? He replied: The defect of reason is the testimony of two women for one man, and the defect of faith is that one of you does not fast during Ramadan (when one is menstruating), and keep away from prayer for some days.",
      "chain": [
        "30485",
        "20029",
        "20374",
        "11234",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "34",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا قتيبة، حدثنا بكر بن مضر، عن ابن عجلان، عن عبد الله بن محمد بن عقيل، عن الربيع بنت معوذ بن عفراء، أنها رأت النبي صلى الله عليه وسلم يتوضأ قالت مسح رأسه ومسح ما أقبل منه وما أدبر وصدغيه وأذنيه مرة واحدة ‏\"‏ ‏.‏ قال وفي الباب عن علي وجد طلحة بن مصرف بن عمرو ‏.‏ قال أبو عيسى وحديث الربيع حديث حسن صحيح ‏.‏ وقد روي من غير وجه عن النبي صلى الله عليه وسلم أنه مسح برأسه مرة ‏.‏ والعمل على هذا عند أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم ومن بعدهم ‏.‏ وبه يقول جعفر بن محمد وسفيان الثوري وابن المبارك والشافعي وأحمد وإسحاق رأوا مسح الرأس مرة واحدة ‏.‏ حدثنا محمد بن منصور المكي قال سمعت سفيان بن عيينة يقول سألت جعفر بن محمد عن مسح الرأس أيجزئ مرة فقال إي والله ‏.‏",
      "text_en": " Ar-Rubayy bint Mu'awidh bin Afra narrated that :                     she saw the Prophet performing Wudu. She  said: \"He wiped his head, and  what is in the front of it and what is in its rear, and his temples and his ears one time.\"",
      "chain": [
        "30367",
        "20374",
        "10616",
        "12246",
        "617"
      ]
    },
    {
      "hadith_no": "272",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا بكر بن مضر، عن ابن الهاد، عن محمد بن إبراهيم، عن عامر بن سعد بن أبي وقاص، عن العباس بن عبد المطلب، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا سجد العبد سجد معه سبعة آراب وجهه وكفاه وركبتاه وقدماه ‏\"‏ ‏.‏ قال وفي الباب عن ابن عباس وأبي هريرة وجابر وأبي سعيد ‏.‏ قال أبو عيسى حديث العباس حديث حسن صحيح وعليه العمل عند أهل العلم ‏.‏",
      "text_en": " Al-Abbas bin Abdul-Muttalib narrated that he heard :                     Allah's Messenger Saying: \"When the worshipper prostrates with him: His face, his hands, his knees, and his feet.\"",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10554",
        "100"
      ]
    },
    {
      "hadith_no": "798",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا قتيبة، حدثنا بكر بن مضر، عن عمرو بن الحارث، عن بكير بن عبد الله بن الأشج، عن يزيد، مولى سلمة بن الأكوع عن سلمة بن الأكوع، قال لما نزلت ‏:‏ ‏(‏وعلى الذين يطيقونه فدية طعام مسكين ‏)‏ كان من أراد منا أن يفطر ويفتدي حتى نزلت الآية التي بعدها فنسختها ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب ‏.‏ ويزيد هو ابن أبي عبيد مولى سلمة بن الأكوع ‏.‏",
      "text_en": " Salamah bin Al-Akwa said:                     \"When the following was revealed: 'And for those upon whom it is difficult, (they may) feed a poor person' - if one of us wanted we would not fast, and pay the ransom, until the Ayah after it was revealed abrogating it.\"",
      "chain": [
        "30367",
        "20374",
        "20377",
        "11154",
        "237"
      ]
    },
    {
      "hadith_no": "1282",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا قتيبة، أخبرنا بكر بن مضر، عن عبيد الله بن زحر، عن علي بن يزيد، عن القاسم، عن أبي أمامة، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تبيعوا القينات ولا تشتروهن ولا تعلموهن ولا خير في تجارة فيهن وثمنهن حرام في مثل هذا أنزلت هذه الآية ‏:‏ ‏(‏ ومن الناس من يشتري لهو الحديث ليضل عن سبيل الله ‏)‏ إلى آخر الآية ‏\"‏ ‏.‏ قال وفي الباب عن عمر بن الخطاب ‏.‏ قال أبو عيسى حديث أبي أمامة إنما نعرفه مثل هذا من هذا الوجه ‏.‏ وقد تكلم بعض أهل العلم في علي بن يزيد وضعفه وهو شامي ‏.‏",
      "text_en": " Narrated Abu Umamah:                     That the Messenger of Allah (ﷺ) said: \"Do not sell the (slave) female singers, not purchase them, nor teach them (to sing). And there is no good in trading in them, and their prices are unlawful. It was about the likes of this that this Ayah was revealed: And among mankind is he who purchases idle talk to divert from the way of Allah.\"[He said:] There is narration about this from 'Umar bin Al-Khattab.[Abu 'Eisa said:] We only know of the Hadith of Abu Umamah, like this, from this route. Some of the people of knowledge have criticized 'Ali bin Yazid (one of the narrators) and graded him weak, and he is from Ash-Sham.",
      "chain": [
        "30367",
        "20374",
        "19927",
        "10535",
        "405"
      ]
    },
    {
      "hadith_no": "3108",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Parables - كتاب الأمثال عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "44",
      "text_ar": "حدثنا قتيبة، حدثنا بكر بن مضر القرشي، عن ابن الهاد، نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "30367",
        "20374",
        "11234"
      ]
    },
    {
      "hadith_no": "3499",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا قتيبة، حدثنا بكر بن مضر، عن عبيد الله بن زحر، عن علي بن يزيد، عن القاسم بن عبد الرحمن، وهو عبد الرحمن مولى عبد الرحمن عن أبي أمامة عن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تبيعوا القينات ولا تشتروهن ولا تعلموهن ولا خير في تجارة فيهن وثمنهن حرام ‏\"‏ ‏.‏ في مثل ذلك أنزلت عليه هذه الآية ‏:‏ ‏(‏ومن الناس من يشتري لهو الحديث ليضل عن سبيل الله ‏)‏ إلى آخر الآية ‏.‏ قال أبو عيسى هذا حديث غريب إنما يروى من حديث القاسم عن أبي أمامة ‏.‏ والقاسم ثقة وعلي بن يزيد يضعف في الحديث قال سمعت محمد بن إسماعيل يقول القاسم ثقة وعلي بن يزيد يضعف ‏.‏",
      "text_en": " Narrated Abu Umamah:                     that the Messenger of Allah (ﷺ) said: \"Do not sell the female singers, nor purchase them, nor teach them (to sing). And there is no good in trade in them, and their prices are unlawful. It was about the likes of this that this Ayah was revealed: 'And among mankind is he who purchases idle talk to divert from the way of Allah (31:6).'\"",
      "chain": [
        "30367",
        "20374",
        "19927",
        "19896",
        "405"
      ]
    },
    {
      "hadith_no": "3453",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا بكر بن مضر، عن ابن الهاد، عن عبد الله بن خباب، عن أبي سعيد الخدري، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا رأى أحدكم الرؤيا يحبها فإنما هي من الله فليحمد الله عليها وليحدث بما رأى وإذا رأى غير ذلك مما يكره فإنما هي من الشيطان فليستعذ بالله من شرها ولا يذكرها لأحد فإنها لا تضره ‏\"‏ ‏.‏ قال وفي الباب عن أبي قتادة ‏.‏ قال وهذا حديث حسن صحيح غريب من هذا الوجه ‏.‏ وابن الهاد اسمه يزيد بن عبد الله بن أسامة بن الهاد المدني وهو ثقة روى عنه مالك والناس ‏.‏",
      "text_en": " Abu Sa’eed Al-Khudri narrated that:                     He heard the Prophet saying: “When one of you sees a dream that he likes, then it is from Allah, so let him praise Allah for it, and speak concerning what he saw. And when he sees other than that of what he dislikes, then it is from Shaitan, so let him seek refuge in Allah from its evil, and not mention it to anyone for, surely, it shall not harm him.”",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11182",
        "38"
      ]
    },
    {
      "hadith_no": "4115",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة، حدثنا بكر بن مضر، عن صخر بن عبد الله، عن أبي سلمة، عن عائشة، أن رسول الله صلى الله عليه وسلم كان يقول ‏\"‏ إن أمركن مما يهمني بعدي ولن يصبر عليكن إلا الصابرون ‏\"‏ ‏.‏ قال ثم تقول عائشة فسقى الله أباك من سلسبيل الجنة ‏.‏ تريد عبد الرحمن بن عوف وقد كان وصل أزواج النبي صلى الله عليه وسلم بمال بيعت بأربعين ألفا ‏.‏ قال هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Abu Salamah:                     from 'Aishah that the Messenger of Allah (ﷺ) used to say: \"Indeed your [feminine plural: referring to the wives of the Prophet (ﷺ)] affair is from that which concerns me after me, and none shall be able to be patient concerning you except the patient ones.\" He said: \"Then 'Aishah said: 'So may Allah give your father drink from the Salsabil of Paradise\" intending 'Abdur-Rahman bin 'Awf (Abu Salamah is the son of 'Abdur-Rahman bin 'Awf). And he had maintained ties with the wives of the Prophet (ﷺ) with property that had been sold for forty-thousand.",
      "chain": [
        "30367",
        "20374",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "174",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا الربيع بن سليمان، قال حدثنا إسحاق بن بكر، - وهو ابن مضر - قال حدثني أبي، عن جعفر بن ربيعة، عن بكر بن سوادة، عن محمد بن مسلم، عن عمر بن عبد العزيز، عن عبد الله بن إبراهيم بن قارظ، قال رأيت أبا هريرة يتوضأ على ظهر المسجد فقال أكلت أثوار أقط فتوضأت منها إني سمعت رسول الله صلى الله عليه وسلم يأمر بالوضوء مما مست النار ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Ibrahim bin Qariz said:                      \"I saw Abu Hurairah performing Wudu' on the roof of the Masjid ans he said: 'I ate some tough cheese, so I performed Wudu' because of that. I heard the Messenger of Allah (ﷺ) commanding us to do Wudu' from that which has been touched by fire.'\"",
      "chain": [
        "30583",
        "30486",
        "20374",
        "11407",
        "10849",
        "167",
        "11010",
        "10888"
      ]
    },
    {
      "hadith_no": "182",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا الربيع بن سليمان بن داود، قال حدثنا إسحاق بن بكر بن مضر، قال حدثني بكر بن مضر، عن جعفر بن ربيعة، عن بكر بن سوادة، عن محمد بن مسلم بن شهاب، عن أبي سلمة بن عبد الرحمن، عن أبي سفيان بن سعيد بن الأخنس، أن أم حبيبة، زوج النبي صلى الله عليه وسلم قالت له وشرب سويقا يا ابن أختي توضأ فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ توضئوا مما مست النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sufyan bin Sa'eed bin Al-Akhnas that Umm Habibah, the wife of the Prophet (ﷺ), said to him, when he had drunk some Sawiq:                      \"O son of my sister, perform Wudu', for I heard the Messenger of Allah (ﷺ) say: 'Perform Wudu' from that which has been touched by fire.'\"",
      "chain": [
        "30583",
        "30486",
        "20374",
        "11407",
        "10849",
        "167",
        "10567"
      ]
    },
    {
      "hadith_no": "356",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Menstruation and Istihadah - كتاب الحيض والاستحاضة",
      "chapter_no": "3",
      "text_ar": "أخبرنا الربيع بن سليمان بن داود بن إبراهيم، قال حدثنا إسحاق، - وهو ابن بكر بن مضر - قال حدثني أبي، عن يزيد بن عبد الله، - وهو ابن أسامة بن الهاد - عن أبي بكر، - وهو ابن محمد بن عمرو بن حزم - عن عمرة، عن عائشة، قالت إن أم حبيبة بنت جحش التي كانت تحت عبد الرحمن بن عوف وأنها استحيضت لا تطهر فذكر شأنها لرسول الله صلى الله عليه وسلم قال ‏\"‏ ليست بالحيضة ولكنها ركضة من الرحم لتنظر قدر قرئها التي كانت تحيض لها فلتترك الصلاة ثم تنظر ما بعد ذلك فلتغتسل عند كل صلاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that Umm Habibah bint Jahsh who was married to 'Abdur-Rahman bin 'Awf suffered from Istihadah and did not become pure. Her situation was mentioned to the Messenger of Allah (ﷺ) and he said:                      \"That is not menstruation, rather it is a kick in the womb, so let her work out the length of the menses that she used to have, and stop praying (for that period of time), then after that let her perform Ghusl for every for every prayer.\"",
      "chain": [
        "30583",
        "30486",
        "20374",
        "11239",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "589",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا علي بن عثمان بن محمد بن سعيد بن عبد الله بن نفيل، قال حدثنا سعيد بن عيسى، قال حدثنا عبد الرحمن بن القاسم، قال حدثنا بكر بن مضر، عن عمرو بن الحارث، عن يزيد بن أبي حبيب، أن أبا الخير، حدثه أن أبا تميم الجيشاني قام ليركع ركعتين قبل المغرب فقلت لعقبة بن عامر انظر إلى هذا أى صلاة يصلي فالتفت إليه فرآه فقال هذه صلاة كنا نصليها على عهد رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Yazid bin Abi Habib that Abu Al-Khair told him:                      \"Abu Tamim Al-Jaishani stood up to pray two Rak'ahs before Maghrib, and I said to 'Uqbah bin 'Amir: 'Look at this man, what prayer is he praying?' He turned and looked at him, and said: 'This is a prayer that we used to pray at the time of the Messenger of Allah (ﷺ).'\"",
      "chain": [
        "10530",
        "20374",
        "20377",
        "11411",
        "10863"
      ]
    },
    {
      "hadith_no": "734",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Masjids - كتاب المساجد",
      "chapter_no": "8",
      "text_ar": "أخبرنا قتيبة، قال حدثنا بكر بن مضر، عن عياش بن عقبة، أن يحيى بن ميمون، حدثه قال سمعت سهلا الساعدي، - رضى الله عنه - يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من كان في المسجد ينتظر الصلاة فهو فى الصلاة ‏\"‏ ‏.‏",
      "text_en": " Sahl As-Sa'idi, may Allah be pleased with him, said:                      \"I heard the Messenger of Allah (ﷺ) say: 'Whoever is in the Masjid waiting for the prayer, he is in a state of prayer.'\"",
      "chain": [
        "30367",
        "20374",
        "26033",
        "24500"
      ]
    },
    {
      "hadith_no": "1053",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا قتيبة، قال حدثنا بكر بن مضر، عن ابن عجلان، عن علي بن يحيى الزرقي، عن أبيه، عن عمه، رفاعة بن رافع وكان بدريا قال كنا مع رسول الله صلى الله عليه وسلم إذ دخل رجل المسجد فصلى ورسول الله صلى الله عليه وسلم يرمقه ولا يشعر ثم انصرف فأتى رسول الله صلى الله عليه وسلم فسلم عليه فرد عليه السلام ثم قال ‏\"‏ ارجع فصل فإنك لم تصل ‏\"‏ ‏.‏ قال لا أدري في الثانية أو في الثالثة قال والذي أنزل عليك الكتاب لقد جهدت فعلمني وأرني ‏.‏ قال ‏\"‏ إذا أردت الصلاة فتوضأ فأحسن الوضوء ثم قم فاستقبل القبلة ثم كبر ثم اقرأ ثم اركع حتى تطمئن راكعا ثم ارفع حتى تعتدل قائما ثم اسجد حتى تطمئن ساجدا ثم ارفع رأسك حتى تطمئن قاعدا ثم اسجد حتى تطمئن ساجدا فإذا صنعت ذلك فقد قضيت صلاتك وما انتقصت من ذلك فإنما تنقصه من صلاتك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Rifa'ah bin Rafi'- who had been present at Badr- said:                     \"We were with the Messenger of Allah (ﷺ) when a man entered the Masjid and prayed. The Messenger of Allah (ﷺ) watched him without him realizing, then he finished, came to the Messenger of Allah (ﷺ) and greeted him with salam. He returned the salam and said: \"Go back and pray, for you have not prayed.'\" He (the narrator) said: \"I do not know if it was the second or third time,- \"(the man) said: 'By the One Who revealed the Book to you, I have tried my best. Teach me and show me.' He said: 'When you want to pray, perform wudu' and do it well, then stand up and face the qiblah. Then say the takbir, then recite, then bow until you are at ease in bowing. Then stand up until you are standing up straight. Then prostrate until you are at ease in prostration, then raise your head until you are at ease in sitting, then prostrate until you are at ease in prostration. If you do that then you will have done your prayer properly, and whatever you failed to do properly is going to detract from your prayer.\"",
      "chain": [
        "30367",
        "20374",
        "10616",
        "11710",
        "325",
        "323"
      ]
    },
    {
      "hadith_no": "1158",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of The At-Tatbiq (Clasping One's Hands Together) - كتاب التطبيق",
      "chapter_no": "12",
      "text_ar": "أخبرنا الربيع بن سليمان بن داود، قال حدثنا إسحاق بن بكر بن مضر، قال حدثني أبي، عن عمرو بن الحارث، عن يحيى، أن القاسم، حدثه عن عبد الله، - وهو ابن عبد الله بن عمر - عن أبيه، قال من سنة الصلاة أن تنصب، القدم اليمنى واستقباله بأصابعها القبلة والجلوس على اليسرى ‏.‏",
      "text_en": " It was narrated from Al-Qasim who narrated from 'Abdullah-he is Ibn Abdullah bin 'Umar- that:                     His father (Ibn 'Umar) said: \"One of the sunnahs of the prayer is to hold the right foot upright and point its toes toward the Qiblah, and to sit on the left foot.\"",
      "chain": [
        "30583",
        "30486",
        "20374",
        "20377",
        "11449",
        "10535",
        "11814",
        "18"
      ]
    },
    {
      "hadith_no": "1293",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا قتيبة، قال حدثنا بكر، - وهو ابن مضر - عن ابن الهاد، عن عبد الله بن خباب، عن أبي سعيد الخدري، قال قلنا يا رسول الله السلام عليك قد عرفناه فكيف الصلاة عليك قال ‏\"‏ قولوا اللهم صل على محمد عبدك ورسولك كما صليت على إبراهيم وبارك على محمد وآل محمد كما باركت على إبراهيم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that abu Sa'eed Al-Khudri said:                     \"We said: 'O Messenger of Allah (ﷺ), we know how to send salams upon you, but how should we send salah upon you?' He said: 'Say: \"Allahumma salli 'ala Muhammadin 'abdika wa rasulika kama salaita 'ala Ibrahim wa barik 'ala Muhammadin wa 'ala ali Muhammadin kama barakta 'ala Ibrahim (O Allah, send salah upon Muhammad, Your slave and Messenger , as You sent Salah upon Ibrahim, and send blessings upon Muhammad and upon the family of Muhammad as You sent blessings upon Ibrahim).\"",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11182",
        "38"
      ]
    },
    {
      "hadith_no": "1356",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Forgetfulness (In Prayer) - كتاب السهو",
      "chapter_no": "13",
      "text_ar": "أخبرنا قتيبة بن سعيد، قال حدثنا بكر، - وهو ابن مضر - عن ابن الهاد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن أبي سعيد الخدري، قال كان رسول الله صلى الله عليه وسلم يجاور في العشر الذي في وسط الشهر فإذا كان من حين يمضي عشرون ليلة ويستقبل إحدى وعشرين يرجع إلى مسكنه ويرجع من كان يجاور معه ثم إنه أقام في شهر جاور فيه تلك الليلة التي كان يرجع فيها فخطب الناس فأمرهم بما شاء الله ثم قال ‏\"‏ إني كنت أجاور هذه العشر ثم بدا لي أن أجاور هذه العشر الأواخر فمن كان اعتكف معي فليثبت في معتكفه وقد رأيت هذه الليلة فأنسيتها فالتمسوها في العشر الأواخر في كل وتر وقد رأيتني أسجد في ماء وطين ‏\"‏ ‏.‏ قال أبو سعيد مطرنا ليلة إحدى وعشرين فوكف المسجد في مصلى رسول الله صلى الله عليه وسلم فنظرت إليه وقد انصرف من صلاة الصبح ووجهه مبتل طينا وماء ‏.‏",
      "text_en": " It was narrated that Abu Sa'eed Al-Khudri said:                     \"The Messenger of Allah (ﷺ) used to observe I'tikaf during the middle ten days of the month, and after the twentieth (day of the month), he would come out on the twenty-first and go back to his home, and those who were observing I'tikaf with him would go back like him. Then he stayed one month on the night when he used to go back home, and he addressed the people and enjoined upon them whatever Allah (SWT) willed. Then he said: 'I used to observe I'tikaf during these ten days, then I decided to spend the last ten days in I'tikaf. So whoever was observing I'tikaf with me, let him stay in his place of I'tikaf, for I was shown this night (Lailatul Qadr), then I was caused to forget it, so seek it during the last ten nights on the odd-numbered nights. And I saw myself prostrating in water and mud.'\" Abu Sa'eed said: \"It rained on the night of the twenty-first, and the roof of the Masjid leaked over the place where the Messenger of Allah (ﷺ) used to pray. I looked at him when he had finished praying subh and his face was wet with water and mud.\"",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا قتيبة، قال حدثنا بكر، - يعني ابن مضر - عن ابن الهاد، عن محمد بن إبراهيم، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة، قال أتيت الطور فوجدت ثم كعبا فمكثت أنا وهو يوما أحدثه عن رسول الله صلى الله عليه وسلم ويحدثني عن التوراة فقلت له قال رسول الله صلى الله عليه وسلم ‏\"‏ خير يوم طلعت فيه الشمس يوم الجمعة فيه خلق آدم وفيه أهبط وفيه تيب عليه وفيه قبض وفيه تقوم الساعة ما على الأرض من دابة إلا وهي تصبح يوم الجمعة مصيخة حتى تطلع الشمس شفقا من الساعة إلا ابن آدم وفيه ساعة لا يصادفها مؤمن وهو في الصلاة يسأل الله فيها شيئا إلا أعطاه إياه ‏\"‏ ‏.‏ فقال كعب ذلك يوم في كل سنة ‏.‏ فقلت بل هي في كل جمعة ‏.‏ فقرأ كعب التوراة ثم قال صدق رسول الله صلى الله عليه وسلم هو في كل جمعة ‏.‏ فخرجت فلقيت بصرة بن أبي بصرة الغفاري فقال من أين جئت قلت من الطور ‏.‏ قال لو لقيتك من قبل أن تأتيه لم تأته ‏.‏ قلت له ولم قال إني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تعمل المطي إلا إلى ثلاثة مساجد المسجد الحرام ومسجدي ومسجد بيت المقدس ‏\"‏ ‏.‏ فلقيت عبد الله بن سلام فقلت لو رأيتني خرجت إلى الطور فلقيت كعبا فمكثت أنا وهو يوما أحدثه عن رسول الله صلى الله عليه وسلم ويحدثني عن التوراة فقلت له قال رسول الله صلى الله عليه وسلم ‏\"‏ خير يوم طلعت فيه الشمس يوم الجمعة فيه خلق آدم وفيه أهبط وفيه تيب عليه وفيه قبض وفيه تقوم الساعة ما على الأرض من دابة إلا وهي تصبح يوم الجمعة مصيخة حتى تطلع الشمس شفقا من الساعة إلا ابن آدم وفيه ساعة لا يصادفها عبد مؤمن وهو في الصلاة يسأل الله شيئا إلا أعطاه إياه ‏\"‏ ‏.‏ قال كعب ذلك يوم في كل سنة ‏.‏ فقال عبد الله بن سلام كذب كعب ‏.‏ قلت ثم قرأ كعب فقال صدق رسول الله صلى الله عليه وسلم هو في كل جمعة ‏.‏ فقال عبد الله صدق كعب إني لأعلم تلك الساعة فقلت يا أخي حدثني بها ‏.‏ قال هي آخر ساعة من يوم الجمعة قبل أن تغيب الشمس فقلت أليس قد سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يصادفها مؤمن وهو في الصلاة ‏\"‏ ‏.‏ وليست تلك الساعة صلاة قال أليس قد سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من صلى وجلس ينتظر الصلاة لم يزل في صلاته حتى تأتيه الصلاة التي تلاقيها ‏\"‏ ‏.‏ قلت بلى ‏.‏ قال فهو كذلك ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"I went out to At-Tur and met Ka'b. He and I spent a day together, when I narrated things to him from the Messenger of Allah (ﷺ) and he narrated things to me from the Tawrah. I said to him: The Messenger of Allah (ﷺ) said: The best day on which the sun rises is Friday. On this day, Adam was created, on this day he was sent down, on it repentance was accepted, on this day he died, and on this day the Hour will begin. There is no living creature on Earth that does not listen out from Friday morning until the sun rises, fearing the onset of the Hour, except the son of Adam. On (Friday) there is an hour in which, if a believer prays and asks Allah (SWT) for something, He will give it to him. Ka'b said: Is than one day in every year? I said: No, it is every Friday.' Then Ka'b read in the Tawrah and said: The Messenger of Allah (ﷺ) spoke the truth; it is every Friday. Then I went out and met Basrah bin Abi Basrah Al-Ghifari. He said: From where have you come? I said: From At-Tur. He said: If I had met you before you went there, you would not have gone. I said to him: Why? He said: I heard the Messenger of Allah (ﷺ) say: Do not travel especially to visit a masjid except three: Al Masjid Al Haram (in Makkah), my masjid (in Al-Madinah) and the Masjid of Bait Al-Maqdis (in Jerusalem). Then I met 'Abdullah bin Salam and said: 'If you had only seen me, I went to At-Tur and met Ka'b, and he and I spent the day together, when I narrated things to him from the Messenger of Allah (ﷺ) and he narrated things to me from the Tawrah. I said to him: The Messenger of Allah (ﷺ) said: The best day on which the sun rises is Friday. On this day, Adam was created, on this day he was sent down, on it repentance was accepted, on this day he died, and on this day the Hour will begin. There is no living creature on Earth that does not listen out from Friday morning until the sun rises, fearing the onset of the Hour, except the son of Adam. On (Friday) there is an hour in which, if a believer prays and asks Allah (SWT) for something, He will give it to him. Ka'b said: That is one day in every year. 'Abdullah bin Salam said: Ka'b is not telling the truth. I said: Then Ka'b read (in the Tawrah) and said: The Messenger of Allah (ﷺ) spoke the truth; it is every Friday. 'Abdullah said: Ka'b spoke the truth; I know when that time is. I said: O my brother, tell me about it. He said: It is the last hour of Friday, before the sun sets. I said: Did you hear the Messenger of Allah (ﷺ) say: If a believer prays, but that is not a time for prayer. He said: Did you not hear the Messenger of Allah (ﷺ) say: Whoever prays and sits waiting for the (next) prayer, is in a state of prayer until the next prayer comes? I said: Of course. He said: That is what it is.\"",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1801",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا الربيع بن سليمان، قال أنبأنا أبو الأسود، قال حدثني بكر بن مضر، عن ابن عجلان، عن أبي إسحاق الهمداني، عن عمرو بن أوس، عن عنبسة بن أبي سفيان، عن أم حبيبة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اثنتا عشرة ركعة من صلاهن بنى الله له بيتا في الجنة أربع ركعات قبل الظهر وركعتين بعد الظهر وركعتين قبل العصر وركعتين بعد المغرب وركعتين قبل صلاة الصبح ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Umm Habibah that:                     The Messenger of Allah (ﷺ) said: \"Twelve rak'ahs, whoever prays them Allah will build for him a house in Paradise: four rak'ahs before Zuhr and two rak'ahs after Zuhr, two rak'ahs before Asr, two rak'ahs after Maghrib and two rak'ahs before Subh prayer.\"",
      "chain": [
        "30583",
        "11114",
        "20374",
        "10616",
        "11049",
        "11437",
        "846",
        "59"
      ]
    },
    {
      "hadith_no": "2316",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا قتيبة، قال أنبأنا بكر، - وهو ابن مضر - عن عمرو بن الحارث، عن بكير، عن يزيد، مولى سلمة بن الأكوع عن سلمة بن الأكوع، قال لما نزلت هذه الآية ‏{‏ وعلى الذين يطيقونه فدية طعام مسكين ‏}‏ كان من أراد منا أن يفطر ويفتدي حتى نزلت الآية التي بعدها فنسختها ‏.‏",
      "text_en": " It was narrated that salamah bin Al-Akwa said:                     \"When this verse was revealed 'And as for those who can fast with difficulty, (e.g. an old man), they have (a choice either to fast or) to feed a miskin (poor person) (for every day). Those among us who did not want to fast would pay the fidyah, until the verse after it was revealed and abrogated this.\"",
      "chain": [
        "30367",
        "20374",
        "20377",
        "11154",
        "237"
      ]
    },
    {
      "hadith_no": "3318",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا الربيع بن سليمان بن داود، قال حدثنا أبو الأسود، وإسحاق بن بكر، قالا حدثنا بكر بن مضر، عن جعفر بن ربيعة، عن عراك بن مالك، عن عروة، عن عائشة، قالت جاء أفلح أخو أبي القعيس يستأذن فقلت لا آذن له حتى أستأذن نبي الله صلى الله عليه وسلم فلما جاء نبي الله صلى الله عليه وسلم قلت له جاء أفلح أخو أبي القعيس يستأذن فأبيت أن آذن له ‏.‏ فقال ‏\"‏ ائذني له فإنه عمك ‏\"‏ ‏.‏ قلت إنما أرضعتني امرأة أبي القعيس ولم يرضعني الرجل ‏.‏ قال ‏\"‏ ائذني له فإنه عمك ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"Aflah, the brother of Abu Al-Qu'ais, came and asked permission to enter, and I said: 'I will not let him in until I seek the permission of the Prophet of Allah.' When the Prophet of Allah came, I said to him: 'Aflah, the brother of Abu Al-Qu'ais, came and asked permission to enter, but I refused to let him in.' He said: 'Let him in, for he is your paternal uncle.' I said: 'The wife of Abu Al-Qu'ais breast-fed me; the man did not breast-feed me.' He said: 'Let him in, for he is your paternal uncle.'\"",
      "chain": [
        "30583",
        "11114",
        "20374",
        "11407",
        "11204",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4242",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرني الربيع بن سليمان بن داود، قال حدثنا إسحاق بن بكر، - وهو ابن مضر - قال حدثني أبي، عن جعفر بن ربيعة، أنه سمع أبا الخير، عن ابن وعلة، أنه سأل ابن عباس فقال إنا نغزو هذا المغرب وإنهم أهل وثن ولهم قرب يكون فيها اللبن والماء فقال ابن عباس الدباغ طهور ‏.‏ قال ابن وعلة عن رأيك أو شىء سمعته من رسول الله صلى الله عليه وسلم قال بل عن رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated from Ibn Wa'lah that he asked Ibn 'Abbas:                     \"We are attacking the Maghrib, and they are people who worship idols, and they have waterskins in which they keep milk and water.\" Ibn 'Abbas said: \"Tanning is purification.\" Ibn Wa'lah said: \"Is this your own opinion, or something that you heard from the Messenger of Allah?\" He said: \"No, (I heard it) from the Messneger of Allah.\"",
      "chain": [
        "30583",
        "30486",
        "20374",
        "11407"
      ]
    },
    {
      "hadith_no": "4344",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا قتيبة، قال حدثنا بكر، - هو ابن مضر - عن ابن الهاد، عن محمد بن إبراهيم، عن عيسى بن طلحة، عن عمير بن سلمة الضمري، قال بينا نحن نسير مع رسول الله صلى الله عليه وسلم ببعض أثايا الروحاء وهم حرم إذا حمار وحش معقور فقال رسول الله صلى الله عليه وسلم ‏\"‏ دعوه فيوشك صاحبه أن يأتيه ‏\"‏ ‏.‏ فجاء رجل من بهز هو الذي عقر الحمار فقال يا رسول الله شأنكم هذا الحمار ‏.‏ فأمر رسول الله صلى الله عليه وسلم أبا بكر يقسمه بين الناس ‏.‏",
      "text_en": " It was narrated that 'Umair bin Salamah Ad-Damri said:                     \"While we were traveling with the Prophet in part of Athaya Ar-Rawha and they were in Ihram, we saw a wounded onager, the Messenger of Allah said: \"Leave it, for soon the one who wounded it will come,' then a man from Bahz came, and he was the one who had wounded the onager. He said: 'O Messenger of Allah, it is up to you what you do with this onager,' The Messenger of Allah ordered Abu Bakr to distribute it among the people.\"",
      "chain": [
        "30367",
        "20374",
        "11234",
        "11213",
        "10573"
      ]
    }
  ],
  "total_hadiths": 50
}