{
  "id": "20378",
  "name": "al-Mufadl bin Fadala bin 'Ubaid المفضل بن فضالة بن عبيد بن ثمامة",
  "full_name": "al-Mufadl bin Fadala bin 'Ubaid المفضل بن فضالة بن عبيد بن ثمامة",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "181",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Qadhi(Judge)"
    ],
    "tags": [
      "al-Qabani",
      "Judge",
      "al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "31131",
      "name": "Fdalh bin Mfdl bin Fdalh فضالة بن مفضل",
      "grade": "3rd Century AH"
    }
  ],
  "teachers": [
    {
      "id": "11411",
      "name": "Yazid bin Abi Habib يزيد بن أبي حبيب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10616",
      "name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20623",
      "name": "'Abdullah bin 'Ayyash bin 'Abbas عبد الله بن عياش بن عباس القتباني",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11207",
      "name": "'Aqil bin Khalid bin 'Aqil عقيل بن خالد بن عقيل الأيلي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "18277",
      "name": "Rabi'ya bin Syf bin Mat' ربيعة بن سيف بن ماتع",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "20519",
      "name": "Hisham bin Sa'd al-Madni هشام بن سعد المدني أبو عباد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20475",
      "name": "Yonus bin Yazid bin Abi al-Nijad يونس بن يزيد بن أبي النجاد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "14213",
      "name": "'Abdullah bin Sulaiman عبد الله بن سليمان بن زرعة الحميري",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "31131",
      "name": "Fdalh bin Mfdl bin Fdalh فضالة بن مفضل",
      "grade": "3rd Century AH"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "30229",
      "name": "Hassan bin 'Abdullah al-Wasti حسان بن عبد الله بن سهل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36060",
      "name": "al-Nadr bin 'Abdul Jabbar al-Muradi النضر بن عبد الجبار المرادي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30338",
      "name": "Sa'id bin 'Isa سعيد بن عيسى",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36029",
      "name": "Sa'id bin Zakaria al-Adm سعيد بن زكريا الأدم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30488",
      "name": "Zakaria bin Yahya bin Salah al-Quda'i زكريا بن يحيى بن صالح القضاعي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36055",
      "name": "Muhammad bin 'Asim bin Ja'far محمد بن عاصم بن جعفر",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38715",
      "name": "Yazid bin Khalid bin Yazid يزيد بن خالد بن يزيد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30490",
      "name": "Muhammad bin Rmh bin al-Mhajr محمد بن رمح بن المهاجر",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1111",
      "hadith_no": "1111",
      "source": "Sahih Bukhari",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا حسان الواسطي، قال حدثنا المفضل بن فضالة، عن عقيل، عن ابن شهاب، عن أنس بن مالك  رضى الله عنه  قال كان النبي صلى الله عليه وسلم إذا ارتحل قبل أن تزيغ الشمس أخر الظهر إلى وقت العصر، ثم يجمع بينهما، وإذا زاغت صلى الظهر ثم ركب‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Whenever the Prophet started the journey before noon, he used to delay the Zuhr prayer till the time for the `Asr prayer and then he would dismount and pray them together; and whenever the sun declined before he started the journey he used to offer the Zuhr prayer and then ride (for the journey).",
      "usc_msa_ref": "213",
      "chain": [
        "30229",
        "20378",
        "11207",
        "11013",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-1112",
      "hadith_no": "1112",
      "source": "Sahih Bukhari",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا قتيبة، قال حدثنا المفضل بن فضالة، عن عقيل، عن ابن شهاب، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم إذا ارتحل قبل أن تزيغ الشمس أخر الظهر إلى وقت العصر، ثم نزل فجمع بينهما، فإن زاغت الشمس قبل أن يرتحل صلى الظهر ثم ركب‏.‏",
      "text_en": " Narrated Anas bin Malik:                      Whenever the Prophet () started on a journey before noon, he used to delay the Zuhr prayers till the time for the 'Asr prayer and then he would dismount and offer them together; and whenever the sun declined before he started on a journey he used to offer the Zuhr prayers and then ride (for journey).",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20378",
        "11207",
        "11013",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-1659",
      "hadith_no": "1659",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا قتيبة بن سعيد، حدثنا المفضل، - يعني ابن فضالة - عن عقيل، عن ابن شهاب، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم إذا ارتحل قبل أن تزيغ الشمس أخر الظهر إلى وقت العصر ثم نزل فجمع بينهما فإن زاغت الشمس قبل أن يرتحل صلى الظهر ثم ركب ‏.‏",
      "text_en": " Anas b. Malik reported:                      When the Messenger of Allah (may peace be upon him) set out on a journey before the sun declined (from the meridian), he delayed the noon prayer till the afternoon prayer, and then dismounted (his ride) and combined them (noon and afternoon prayers), but if the sun had declined before his setting out on a journey, he observed the noon prayer and then mounted (the ride).",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20378",
        "11207",
        "11013",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-4339",
      "hadith_no": "4339",
      "source": "Sahih Muslim",
      "chapter": "The Book of Vows - كتاب النذر",
      "chapter_no": "27",
      "text_ar": "وحدثنا زكرياء بن يحيى بن صالح المصري، حدثنا المفضل، - يعني ابن فضالة - حدثني عبد الله بن عياش، عن يزيد بن أبي حبيب، عن أبي الخير، عن عقبة بن عامر، أنه قال نذرت أختي أن تمشي، إلى بيت الله حافية فأمرتني أن أستفتي لها رسول الله صلى الله عليه وسلم فاستفتيته فقال ‏\"‏ لتمش ولتركب ‏\"‏ ‏.‏",
      "text_en": " 'Uqba b. Amir reported:                      My sister took a vow that she would walk bare foot to the house of Allah (Ka'ba). She asked me to inquire from Allah's Messenger (may peace be upon him) about it. I sought his decision and he said: She should walk on foot and ride also.",
      "usc_msa_ref": "",
      "chain": [
        "30193",
        "20378",
        "778",
        "11411",
        "11410",
        "189"
      ]
    },
    {
      "id": "sahih-muslim-4991",
      "hadith_no": "4991",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا زكرياء بن يحيى بن صالح المصري، حدثنا المفضل، - يعني ابن فضالة - عن عياش، - وهو ابن عباس القتباني - عن عبد الله بن يزيد أبي عبد الرحمن الحبلي، عن عبد الله بن عمرو بن العاص، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يغفر للشهيد كل ذنب إلا الدين ‏\"‏ ‏.‏",
      "text_en": " It has been reported on the authority of 'Amr b. al-'As that the Messenger of Allah (may peace be upon him) said:                      All the sins of a Shahid (martyr) are forgiven except debt.",
      "usc_msa_ref": "",
      "chain": [
        "30193",
        "20378",
        "10871",
        "29"
      ]
    },
    {
      "id": "sunan-abi-daud-36",
      "hadith_no": "36",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يزيد بن خالد بن عبد الله بن موهب الهمداني، حدثنا المفضل، - يعني ابن فضالة المصري - عن عياش بن عباس القتباني، أن شييم بن بيتان، أخبره عن شيبان القتباني، قال إن مسلمة بن مخلد استعمل رويفع بن ثابت، على أسفل الأرض ‏.‏ قال شيبان فسرنا معه من كوم شريك إلى علقماء أو من علقماء إلى كوم شريك - يريد علقام - فقال رويفع إن كان أحدنا في زمن رسول الله صلى الله عليه وسلم ليأخذ نضو أخيه على أن له النصف مما يغنم ولنا النصف وإن كان أحدنا ليطير له النصل والريش وللآخر القدح ‏.‏ ثم قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا رويفع لعل الحياة ستطول بك بعدي فأخبر الناس أنه من عقد لحيته أو تقلد وترا أو استنجى برجيع دابة أو عظم فإن محمدا صلى الله عليه وسلم منه بريء ‏\"‏ ‏.‏",
      "text_en": " Narrated Ruwayfi' ibn Thabit:                     Shayban al-Qatbani reported that Maslamah ibn Mukhallad made Ruwayfi' ibn Thabit the governor of the lower parts (of Egypt). He added: We travelled with him from Kum Sharik to Alqamah or from Alqamah to Kum Sharik (the narrator doubts) for Alqam. Ruwayfi' said: Any one of us would borrow a camel during the lifetime of the Prophet (ﷺ) from the other, on condition that he would give him half the booty, and the other half he would retain himself. Further, one of us received an arrowhead and a feather, and the other an arrow-shaft as a share from the booty. He then reported: The Messenger of Allah (ﷺ) said: You may live for a long time after I am gone, Ruwayfi', so, tell people that if anyone ties his beard or wears round his neck a string to ward off the evil eye, or cleanses himself with animal dung or bone, Muhammad has nothing to do with him.",
      "usc_msa_ref": "",
      "chain": [
        "38715",
        "20378",
        "10871",
        "16050",
        "1455"
      ]
    },
    {
      "id": "sunan-abi-daud-37",
      "hadith_no": "37",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يزيد بن خالد، حدثنا مفضل، عن عياش، أن شييم بن بيتان، أخبره بهذا الحديث، أيضا عن أبي سالم الجيشاني، عن عبد الله بن عمرو، يذكر ذلك وهو معه مرابط بحصن باب أليون ‏.‏ قال أبو داود حصن أليون على جبل بالفسطاط ‏.‏ قال أبو داود وهو شيبان بن أمية يكنى أبا حذيفة ‏.‏",
      "text_en": " This tradition has also been narrated by Abu Salim al-Jaishani on the authority of 'Abd Allaah b. 'Amr. He narrated this tradition at the time when he besieged the fort  at the gate of Alyun.Abu Dawud said:                      The fort of Alyun lies at the mountain in Fustat. Abu Dawud said: The kunyah (surname) of Shaiban b. Umayyah is Abu Hudhaifah.",
      "usc_msa_ref": "",
      "chain": [
        "38715",
        "20378",
        "30157",
        "16050",
        "10858"
      ]
    },
    {
      "id": "sunan-abi-daud-209",
      "hadith_no": "209",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا عبد الله بن مسلمة القعنبي، قال حدثنا أبي، عن هشام بن عروة، عن أبيه، عن حديث، حدثه عن علي بن أبي طالب، قال قلت للمقداد ‏.‏ فذكر معناه ‏.‏ قال أبو داود ورواه المفضل بن فضالة وجماعة والثوري وابن عيينة عن هشام عن أبيه عن علي بن أبي طالب ورواه ابن إسحاق عن هشام بن عروة عن أبيه عن المقداد عن النبي صلى الله عليه وسلم لم يذكر ‏\"‏ أنثييه ‏\"‏ ‏.‏",
      "text_en": " ‘Urwah reported on the Authority of his father a tradition from ‘Ali b. Abi Talib who said :                      I Asked al-Miqdad (to consult the prophet). He then narrated the tradition bearing the same meaning.Abu Dawud said; this tradition has been reported with another chain of narrators. This version does not mention the word “testicles”.",
      "usc_msa_ref": "",
      "chain": [
        "20164",
        "24428",
        "11065",
        "10511",
        "5",
        "30002",
        "20378",
        "11065",
        "10511",
        "5",
        "11107"
      ]
    },
    {
      "id": "sunan-abi-daud-342",
      "hadith_no": "342",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يزيد بن خالد الرملي، أخبرنا المفضل، - يعني ابن فضالة - عن عياش بن عباس، عن بكير، عن نافع، عن ابن عمر، عن حفصة، عن النبي صلى الله عليه وسلم قال ‏\"‏ على كل محتلم رواح الجمعة وعلى كل من راح إلى الجمعة الغسل ‏\"‏ ‏.‏ قال أبو داود إذا اغتسل الرجل بعد طلوع الفجر أجزأه من غسل الجمعة وإن أجنب ‏.‏",
      "text_en": " Narrated Hafsah, Ummul Mu'minin:                     The Prophet (ﷺ) said: It is necessary for every adult (person) to go for (saying) Friday (prayer), and for everyone who goes for Friday (prayer) washing is necessary.Abu Dawud said: If one takes bath after sunrise, even though he washes because of seminal emission, that will be enough for him for his washing on Friday.",
      "usc_msa_ref": "",
      "chain": [
        "38715",
        "20378",
        "10871",
        "11154",
        "11014",
        "18",
        "54"
      ]
    },
    {
      "id": "sunan-abi-daud-1208",
      "hadith_no": "1208",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا يزيد بن خالد بن يزيد بن عبد الله بن موهب الرملي الهمداني، حدثنا المفضل بن فضالة، والليث بن سعد، عن هشام بن سعد، عن أبي الزبير، عن أبي الطفيل، عن معاذ بن جبل، أن رسول الله صلى الله عليه وسلم كان في غزوة تبوك إذا زاغت الشمس قبل أن يرتحل جمع بين الظهر والعصر وإن يرتحل قبل أن تزيغ الشمس أخر الظهر حتى ينزل للعصر وفي المغرب مثل ذلك إن غابت الشمس قبل أن يرتحل جمع بين المغرب والعشاء وإن يرتحل قبل أن تغيب الشمس أخر المغرب حتى ينزل للعشاء ثم جمع بينهما ‏.‏ قال أبو داود رواه هشام بن عروة عن حسين بن عبد الله عن كريب عن ابن عباس عن النبي صلى الله عليه وسلم نحو حديث المفضل والليث ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     On the expedition to Tabuk if the sun had passed the meridian before the apostle of Allah (ﷺ) moved off, he combined the noon and the afternoon prayers; but if he moved off before the sun had passed the meridian, he delayed the noon prayer till he halted for the afternoon prayer. He acted similarly for the sunset prayer; if the sun set before he moved off, he combined the sunset and the night prayers, but if he moved off before sunset, he delayed the sunset prayer till he halted for the night prayer and then combined them.Abu Dawud said: Hisham b. 'Urwah narrated this tradition from Husain b. 'Abd Allah, from Kuraib on the authority of Ibn 'Abbas from the Prophet (ﷺ) like the tradition narrated by Mufaddal and al-Laith.",
      "usc_msa_ref": "",
      "chain": [
        "38715",
        "20378",
        "20023",
        "20519",
        "11263",
        "3660",
        "32"
      ]
    },
    {
      "id": "sunan-abi-daud-3925",
      "hadith_no": "3925",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur) - كتاب الكهانة و التطير",
      "chapter_no": "30",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا يونس بن محمد، حدثنا مفضل بن فضالة، عن حبيب بن الشهيد، عن محمد بن المنكدر، عن جابر، أن رسول الله صلى الله عليه وسلم أخذ بيد مجذوم فوضعها معه في القصعة وقال ‏\"‏ كل ثقة بالله وتوكلا عليه ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Messenger of Allah (ﷺ) took a man who was suffering from tubercular leprosy by the hand; he then put it along with his own hand in the dish and said: Eat with confidence in Allah and trust in Him.",
      "usc_msa_ref": "",
      "chain": [
        "30203",
        "20393",
        "20378",
        "11275",
        "11048",
        "34"
      ]
    },
    {
      "id": "sunan-abi-daud-4049",
      "hadith_no": "4049",
      "source": "Sunan Abi Da'ud",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا يزيد بن خالد بن عبد الله بن موهب الهمداني، أخبرنا المفضل، - يعني ابن فضالة - عن عياش بن عباس القتباني، عن أبي الحصين، - يعني الهيثم بن شفي - قال خرجت أنا وصاحب، لي يكنى أبا عامر - رجل من المعافر - لنصلي بإيلياء وكان قاصهم رجل من الأزد يقال له أبو ريحانة من الصحابة قال أبو الحصين فسبقني صاحبي إلى المسجد ثم ردفته فجلست إلى جنبه فسألني هل أدركت قصص أبي ريحانة قلت لا ‏.‏ قال سمعته يقول نهى رسول الله صلى الله عليه وسلم عن عشر عن الوشر والوشم والنتف وعن مكامعة الرجل الرجل بغير شعار وعن مكامعة المرأة المرأة بغير شعار وأن يجعل الرجل في أسفل ثيابه حريرا مثل الأعاجم أو يجعل على منكبيه حريرا مثل الأعاجم وعن النهبى وركوب النمور ولبوس الخاتم إلا لذي سلطان ‏.‏ قال أبو داود الذي تفرد به من هذا الحديث ذكر الخاتم ‏.‏",
      "text_en": " Narrated Abul Husayn, that is al-Haytham ibn Shafi I and a companion of mine called Abu 'Amir, a man from al-Ma'afir went to perform prayer in Bayt al-Maqdis (Jerusalem). Their preacher was a man of Azd called AbuRayhanah, who was a companion of the Prophet (ﷺ).  Abul Husayn said:                      my companion went to the mosque before me. I went there after him and sat beside him.  He asked me: Did you hear the preaching of AbuRayhanah?  I said: No.  He said: I heard him say: The Messenger of Allah (ﷺ) forbade ten things: Sharpening the ends of the teeth, tattooing, plucking hair, men sleeping together without an under garment, women sleeping together without an under-garment, men putting silk at the hem of their garments like the Persians, or putting silk on their shoulders like the Persians, plundering, riding on panther skins, wearing signet rings, except in the case of one in authority.Abu Dawud said: The solitary point in this tradition (not supported by other traditions) is the report about the signet-ring.",
      "usc_msa_ref": "",
      "chain": [
        "38715",
        "20378",
        "10871"
      ]
    },
    {
      "id": "sunan-abi-daud-4257",
      "hadith_no": "4257",
      "source": "Sunan Abi Da'ud",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا يزيد بن خالد الرملي، حدثنا مفضل، عن عياش، عن بكير، عن بسر بن سعيد، عن حسين بن عبد الرحمن الأشجعي، أنه سمع سعد بن أبي وقاص، عن النبي صلى الله عليه وسلم في هذا الحديث قال فقلت يا رسول الله أرأيت إن دخل على بيتي وبسط يده ليقتلني قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ كن كابنى آدم ‏\"‏ ‏.‏ وتلا يزيد ‏{‏ لئن بسطت إلى يدك ‏}‏ الآية ‏.‏",
      "text_en": " Narrated Sa'd ibn AbuWaqqas:                     I asked: Messenger of Allah! tell me if someone enters my house and extends his hands to kill me (what should I do?) The Messenger of Allah (ﷺ) replied: Be like the two sons of Adam. The narrator Yazid (ibn Khalid) then recited the verse: \"If thou dost stretch they hand against me to slay me.\" [5:28]",
      "usc_msa_ref": "",
      "chain": [
        "38715",
        "20378",
        "30157",
        "11154",
        "11153",
        "9"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1817",
      "hadith_no": "1817",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن سعيد الأشقر، وإبراهيم بن يعقوب، قالا حدثنا يونس بن محمد، حدثنا المفضل بن فضالة، عن حبيب بن الشهيد، عن محمد بن المنكدر، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم أخذ بيد مجذوم فأدخله معه في القصعة ثم قال ‏\"‏ كل بسم الله ثقة بالله وتوكلا عليه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث يونس بن محمد عن المفضل بن فضالة ‏.‏ والمفضل بن فضالة هذا شيخ بصري والمفضل بن فضالة شيخ آخر مصري أوثق من هذا وأشهر ‏.‏ وقد روى شعبة هذا الحديث عن حبيب بن الشهيد عن ابن بريدة أن ابن عمر أخذ بيد مجذوم وحديث شعبة أثبت عندي وأصح ‏.‏",
      "text_en": " Narrated Jabir bin ‘Abdullah :                     \"The Messenger of Allah (ﷺ) took the hand of a leper and put it in the Qas'ah. Then he said: 'Eat in Allah's Name, trusting in Allah and relying upon Him.'\"[Abu 'Eisa said:] This is a Gharib Hadith, we do not know of it except through the report of Yunus bin Muhammad, from Al-Mufaddal bin Fadalah, a Shaikh from Al-Basrah. There is another Shaikh from Al-Basrah named Al-Mufaddal bin Fadalah, who is more reliable han this one and more popular. Shu'bah reported this Hadith from Habib bin Ash-Shahid, from Ibn Buraidah: \"That Ibn 'Umar took the hand of a leper\" and the narration of Shu'bah is more appropriate to me and more correct.",
      "usc_msa_ref": "",
      "chain": [
        "30296",
        "38088",
        "20393",
        "20378",
        "11275",
        "11048",
        "34"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3402-2",
      "hadith_no": "3402",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا قتيبة، حدثنا المفضل بن فضالة، عن عقيل، عن ابن شهاب، عن عروة، عن عائشة، أن النبي صلى الله عليه وسلم كان إذا أوى إلى فراشه كل ليلة جمع كفيه ثم نفث فيهما فقرأ فيهما ‏:‏ ‏(‏ قل هو الله أحد ‏)‏ و ‏:‏ ‏(‏ قل أعوذ برب الفلق ‏)‏ و ‏:‏ ‏(‏ قل أعوذ برب الناس ‏)‏ ثم يمسح بهما ما استطاع من جسده يبدأ بهما على رأسه ووجهه وما أقبل من جسده يفعل ذلك ثلاث مرات ‏.‏ قال هذا حديث حسن غريب صحيح ‏.‏",
      "text_en": " Aishah narrated that:                     Every night, when the Prophet would go to his bed, he would join his hands, then blow in them, as he recited in them: “Say: He is Allah, the One.” And “Say: I seek refuge in the Lord of Al-Falaq” and “Say: I seek refuge in the Lord of mankind.” Then he would wipe as much as he was able to off his body with them, beginning with them first of his head and face, and the front of his body. He would do this three times.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20378",
        "11207",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-593",
      "hadith_no": "593",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا قتيبة، قال حدثنا مفضل، عن عقيل، عن ابن شهاب، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم إذا ارتحل قبل أن تزيغ الشمس أخر الظهر إلى وقت العصر ثم نزل فجمع بينهما فإن زاغت الشمس قبل أن يرتحل صلى الظهر ثم ركب ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                      \"If the Messenger of Allah (ﷺ) was setting out on a journey before the sun passed its zenith, he would delay Zuhr until the time of 'Asr, then he would stop and combine the prayer. If the sun passed its zenith before he set out, he would pray Zuhr and then set off.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20378",
        "11207",
        "11013",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-Grade-7",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرني محمود بن غيلان، قال حدثنا الوليد بن مسلم، قال حدثني المفضل بن فضالة، عن عياش بن عباس، عن بكير بن الأشج، عن نافع، عن ابن عمر، عن حفصة، زوج النبي صلى الله عليه وسلم أن النبي صلى الله عليه وسلم قال ‏\"‏ رواح الجمعة واجب على كل محتلم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Hafsah, the wife of the Prophet (ﷺ) that:                     The Prophet (ﷺ) said: \"Going to jumu'ah is obligatory for everyone who has reached the age of puberty.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20733",
        "20378",
        "10871",
        "11154",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-2314",
      "hadith_no": "2314",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن رافع، قال حدثنا يحيى بن آدم، قال حدثنا مفضل، عن منصور، عن مجاهد، عن طاوس، عن ابن عباس، قال سافر رسول الله صلى الله عليه وسلم فصام حتى بلغ عسفان ثم دعا بإناء فشرب نهارا ليراه الناس ثم أفطر حتى دخل مكة فافتتح مكة في رمضان قال ابن عباس فصام رسول الله صلى الله عليه وسلم في السفر وأفطر فمن شاء صام ومن شاء أفطر ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah traveled and fasted until he reached 'Usfan, then he called for a cup and drank durink the day when the people could see him. Hen he did not fast until he reached Makkah, and he conquered Makkah during Ramadan.\" Ibn 'Abbas said: \"And the Messenger of Allah fasted until  he reach Makkah, and he conquered Makkah during Ramadan.\" Ibn 'Abbas said: \"And the Messenger of Allah fasted and broke his fast while traveling, so whoever wishes may fast, and whoever wishes may not fast.\"",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20364",
        "20378",
        "11067",
        "11028",
        "11053",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-2875",
      "hadith_no": "2875",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن رافع، قال حدثنا يحيى بن آدم، قال حدثنا مفضل، عن منصور، عن مجاهد، عن طاوس، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم يوم فتح مكة ‏\"‏ إن هذا البلد حرام حرمه الله عز وجل لم يحل فيه القتال لأحد قبلي وأحل لي ساعة من نهار فهو حرام بحرمة الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn Abbas said:                     \"The Messenger of Allah said on the day of the conquest of Makkah: 'Allah, the Might and Sublime, has made this land sacred, and it was not permissible to fight therein for anyone before me. It was permitted for me for a few hours of a day, and it is sacred by the decree of Allah, the Might and Sublime.\"",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20364",
        "20378",
        "11067",
        "11028",
        "11053",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-3621",
      "hadith_no": "3621",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا محمد بن رافع، قال حدثنا يحيى بن آدم، قال حدثنا مفضل، عن الأعمش، وأنبأنا محمد بن العلاء، وأحمد بن حرب، قالا حدثنا أبو معاوية، عن الأعمش، عن شقيق، عن مسروق، عن عائشة، قالت ما ترك رسول الله صلى الله عليه وسلم دينارا ولا درهما ولا شاة ولا بعيرا ولا أوصى بشىء‏.‏",
      "text_en": " It was narrated that 'Aishah said:                      \"The Messenger of Allah did not leave behind a Dinar or a Dirham, or a sheep or a camel, and he did not leave any will.\"",
      "usc_msa_ref": "",
      "chain": [
        "30375",
        "20364",
        "20378",
        "11060",
        "30216",
        "38011",
        "20354",
        "11060",
        "11353",
        "11018",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-4343",
      "hadith_no": "4343",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا قتيبة، قال حدثنا المفضل، - هو ابن فضالة - عن ابن جريج، عن أبي الزبير، عن جابر، قال أكلنا يوم خيبر لحوم الخيل والوحش ونهانا النبي صلى الله عليه وسلم عن الحمار ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"On the Day of Khaibar we ate the flesh of horses, and onagers, but the Prophet forbade us (from eating) donkeys.\"(sahih)",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20378",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-4367",
      "hadith_no": "4367",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا علي بن عثمان النفيلي، قال حدثنا سعيد بن عيسى، قال حدثنا المفضل بن فضالة، قال حدثني عبد الله بن سليمان، قال حدثني نافع، عن عبد الله بن عمر، أن رسول الله صلى الله عليه وسلم نحر يوم الأضحى بالمدينة - قال - وقد كان إذا لم ينحر يذبح بالمصلى ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Umar that:                     the Messenger of Allah offered the sacrifice obn the Day of Sacrifice in Al-Madinah. He said: \"if he did not offer the Nahr (sacrifice a camel) he would have offered Dhabihah (Sacrificed a sheep) at the prayer place.\"",
      "usc_msa_ref": "",
      "chain": [
        "38405",
        "20378",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-4667",
      "hadith_no": "4667",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا عبد الرحمن بن عبد الله بن عبد الحكم، قال حدثنا سعيد بن عيسى، قال أنبأنا المفضل بن فضالة، عن ابن جريج، عن عطاء بن أبي رباح، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم في أشياء حرمها ‏\"‏ وثمن الكلب ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah said - among the things that be forbade - 'And the price of a dog.\"",
      "usc_msa_ref": "",
      "chain": [
        "36039",
        "20378",
        "11070",
        "11029",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-4984",
      "hadith_no": "4984",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرني عمرو بن منصور، قال حدثنا حسان بن عبد الله، قال حدثنا المفضل بن فضالة، عن يونس بن يزيد، قال سمعت سعد بن إبراهيم، يحدث عن المسور بن إبراهيم، عن عبد الرحمن بن عوف، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يغرم صاحب سرقة إذا أقيم عليه الحد ‏\"‏ ‏.‏ قال أبو عبد الرحمن وهذا مرسل وليس بثابت ‏.‏",
      "text_en": " It was narrated from 'Abdur-Rahman bin 'Awf that the Messenger of Allah said:                     \"The thief is not to be penalized (financially) if the Hadd punishment is carried out on him.\" (Daif)Abu 'Abdur-Rahman (An-Nasai) said: This is Mursal and it is not confirmed.",
      "usc_msa_ref": "",
      "chain": [
        "38433",
        "20378",
        "20475",
        "11063",
        "8"
      ]
    },
    {
      "id": "sunan-an-nasai-5091",
      "hadith_no": "5091",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عبد الرحمن بن عبد الله بن عبد الحكم، قال حدثنا أبي وأبو الأسود النضر بن عبد الجبار، قالا حدثنا المفضل بن فضالة، عن عياش بن عباس القتباني، عن أبي الحصين الهيثم بن شفى، - وقال أبو الأسود شفي - إنه سمعه يقول خرجت أنا وصاحب، لي يسمى أبا عامر - رجل من المعافر - لنصلي بإيلياء وكان قاصهم رجلا من الأزد يقال له أبو ريحانة من الصحابة قال أبو الحصين فسبقني صاحبي إلى المسجد ثم أدركته فجلست إلى جنبه فقال هل أدركت قصص أبي ريحانة فقلت لا ‏.‏ فقال سمعته يقول نهى رسول الله صلى الله عليه وسلم عن عشر عن الوشر والوشم والنتف وعن مكامعة الرجل الرجل بغير شعار وعن مكامعة المرأة المرأة بغير شعار وأن يجعل الرجل أسفل ثيابه حريرا مثل الأعاجم أو يجعل على منكبيه حريرا أمثال الأعاجم وعن النهبى وعن ركوب النمور ولبوس الخواتيم إلا لذي سلطان ‏.‏",
      "text_en": " It was narrated from Abu Al-Husain Al-Haitham bin Shufayy that he said:                     \"A friend of mine who was called Abu 'Amir, from Al-Ma'afir, and I went out to pray in Jerusalem. Their preacher was a man from (the tribe of) Azd who was called Abu Raihanah, one of the Companions.\" Abu Al-Husain said: \"My companion reached the Masjid before I did, then I caught up with him, and sat beside him. He said: 'Have you heard the preaching of Abu Raihanah?' I said: 'No.' He said: 'I heard him say: 'The Messenger of Allah [SAW] forbade ten things: Filing (the teeth), tattoos, plucking (hair), for two men to lie under one cover with no barrier between them, for two women to lie under one cover with no barrier between them, for a man to add more than four fingers' width of silk to the bottom of his garment like the foreigners (Persians), (and he forbade) plundering, riding (while sitting on) leopard skins and wearing rings- except for rulers.\"",
      "usc_msa_ref": "",
      "chain": [
        "36039",
        "20378",
        "10871"
      ]
    },
    {
      "id": "sunan-ibn-majah-2690",
      "hadith_no": "2690",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن عاصم بن جعفر المصري، حدثنا المفضل بن فضالة، عن يونس بن يزيد، عن ابن شهاب، عن إبراهيم بن عبد الرحمن بن عوف، عن أبيه، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ليس على المختلس قطع ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibrahim bin Abdur-Rahman bin Awf that his father said:                     “I heard the Messenger of Allah (ﷺ) say: 'The hand of the pilferer is not to be cut off”.",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "38520",
        "20378",
        "20475",
        "11013",
        "584",
        "8"
      ]
    },
    {
      "id": "sunan-ibn-majah-3671",
      "hadith_no": "3671",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر، ومجاهد بن موسى، ومحمد بن خلف العسقلاني، قالوا حدثنا يونس بن محمد، حدثنا مفضل بن فضالة، عن حبيب بن الشهيد، عن محمد بن المنكدر، عن جابر بن عبد الله، أن رسول الله  صلى الله عليه وسلم  أخذ بيد رجل مجذوم فأدخلها معه في القصعة ثم قال ‏\"‏ كل ثقة بالله وتوكلا على الله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Jabir bin ‘Abdullah that the Messenger of Allah(ﷺ)took the hand of a leper and made him eat with him, and said:                     “Eat,with trust in Allah and reliance upon Allah.”",
      "usc_msa_ref": "",
      "chain": [
        "20436",
        "30521",
        "38502",
        "20393",
        "20378",
        "11275",
        "11048",
        "34"
      ]
    }
  ],
  "total_hadiths": 27
}