{
  "id": "20375",
  "name": "Sa'id bin Abi Ayoub سعيد بن أبي أيوب الخزاعي",
  "full_name": "Sa'id bin Abi Ayoub سعيد بن أبي أيوب الخزاعي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "161",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-Khuza'i",
      "Client",
      "al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "10850",
      "name": "Bakr bin 'Amr al-Ma'fari بكر بن عمرو المعافري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10853",
      "name": "al-Harith bin Yazid al-Hdrmy الحارث بن يزيد الحضرمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10856",
      "name": "Hameed bin Han'i Abu حميد بن هانئ أبو هانئ",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10861",
      "name": "Shrahyl bin Yazid شراحيل بن يزيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10862",
      "name": "Shrhbyl bin Shryk al-Ma'afry شرحبيل بن شريك المعافري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10872",
      "name": "Ka'b bin 'Alqama bin Ka'b كعب بن علقمة بن كعب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11105",
      "name": "Muhammad bin 'Abdur Rahman محمد بن عبد الرحمن بن نوفل",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11207",
      "name": "'Aqil bin Khalid bin 'Aqil عقيل بن خالد بن عقيل الأيلي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11407",
      "name": "Ja'far bin Rabi'ya bin Shrhbyl جعفر بن ربيعة بن شرحبيل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11408",
      "name": "Khalid bin Yazid خالد بن يزيد الجمحي الإسكندراني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11409",
      "name": "'Ubaidullah bin Abi Ja'far عبيد الله بن أبي جعفر المصري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11411",
      "name": "Yazid bin Abi Habib يزيد بن أبي حبيب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11841",
      "name": "Hameed bin Ziyad حميد بن زياد أبو صخر",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "12293",
      "name": "'Abdur Rahman bin Ata'a عبد الرحمن بن عطاء بن كعب",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "12497",
      "name": "Muhsin bin 'Ali al-Fihri al-Madni محصن بن علي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "14213",
      "name": "'Abdullah bin Sulaiman عبد الله بن سليمان بن زرعة الحميري",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "16016",
      "name": "al-Hasan bin Thwban bin 'Amir الحسن بن ثوبان بن عامر",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "16031",
      "name": "Zban bin Fa'id زبان بن فائد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "16052",
      "name": "al-Dhak bin Shrhbyl الضحاك بن شرحبيل",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "16080",
      "name": "'Amr bin Jabir al-Hdrmy عمرو بن جابر الحضرمي أبو زرعة المصري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "16116",
      "name": "Yazid bin 'Abdul 'Aziz al-Ra'ayni يزيد بن عبد العزيز الرعيني",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "17024",
      "name": "Zayd bin Abi Atab زيد بن أبي عتاب",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "17514",
      "name": "Salah bin Rustam al-Hashimi صالح بن رستم الهاشمي أبو عبد السلام",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "18277",
      "name": "Rabi'ya bin Syf bin Mat' ربيعة بن سيف بن ماتع",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "18282",
      "name": "Razayq bin Hakeem Abu Hakeem رزيق بن حكيم أبو حكيم الأيلي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "18649",
      "name": "'Abdur Rahman bin Mrzwq عبد الرحمن بن مرزوق",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "19309",
      "name": "Abu 'Abdullah al-Qarshi أبو عبد الله القرشي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20465",
      "name": "Musa bin A'ayn al-Jazri موسى بن أعين الجزري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "26002",
      "name": "Bashyr bin Abi 'Amr بشير بن أبي عمرو الخولاني",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "26040",
      "name": "Ma'rwf bin Suwayd al-Jdhamy معروف بن سويد الجذامي أبو سلمة المصري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "23033",
      "name": "'Abdullah bin Yazid al-'Advi عبد الله بن يزيد العدوي المقري القصير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1159",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا عبد الله بن يزيد، حدثنا سعيد  هو ابن أبي أيوب  قال حدثني جعفر بن ربيعة، عن عراك بن مالك، عن أبي سلمة، عن عائشة  رضى الله عنها  قالت صلى النبي صلى الله عليه وسلم العشاء ثم صلى ثمان ركعات وركعتين جالسا وركعتين بين النداءين، ولم يكن يدعهما أبدا‏.‏",
      "text_en": " Narrated `Aisha;:                     Allah's Apostle offered the `Isha' prayer (and then got up at the Tahajjud time) and offered eight rak`at and then offered two rak`at while sitting. He then offered two rak`at in between the Adhan and Iqama (of the Fajr prayer) and he never missed them.",
      "chain": [
        "1945",
        "20375",
        "11407",
        "11204",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "1160",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا عبد الله بن يزيد، حدثنا سعيد بن أبي أيوب، قال حدثني أبو الأسود، عن عروة بن الزبير، عن عائشة  رضى الله عنها  قالت كان النبي صلى الله عليه وسلم إذا صلى ركعتى الفجر اضطجع على شقه الأيمن‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to lie down on his right side, after offering two rak`at (Sunna) of the Fajr prayer.",
      "chain": [
        "1945",
        "20375",
        "11114",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1184",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا عبد الله بن يزيد، قال حدثنا سعيد بن أبي أيوب، قال حدثني يزيد بن أبي حبيب، قال سمعت مرثد بن عبد الله اليزني، قال أتيت عقبة بن عامر الجهني فقلت ألا أعجبك من أبي تميم يركع ركعتين قبل صلاة المغرب‏.‏ فقال عقبة إنا كنا نفعله على عهد رسول الله صلى الله عليه وسلم‏.‏ قلت فما يمنعك الآن قال الشغل‏.‏",
      "text_en": " Narrated Marthad bin `Abdullah Al-Yazani:                     I went to `Uqba bin 'Amir Al-Juhani and said, \"Is it not surprising that Abi Tamim offers two rak`at before the Maghrib prayer?\" `Uqba said, \"We used to do so in the lifetime of Allah's Apostle.\" I asked him, \"What prevents you from offering it now?\" He replied, \"Business.\"",
      "chain": [
        "1945",
        "20375",
        "11411",
        "11410"
      ]
    },
    {
      "hadith_no": "1899",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، عن يحيى بن أيوب، عن يزيد، عن أبي الخير، عن عقبة،، فذكر الحديث‏.‏   حدثنا إبراهيم بن موسى، أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني سعيد بن أبي أيوب، أن يزيد بن أبي حبيب، أخبره أن أبا الخير حدثه عن عقبة بن عامر، قال نذرت أختي أن تمشي، إلى بيت الله، وأمرتني أن أستفتي لها النبي صلى الله عليه وسلم فاستفتيته، فقال عليه السلام ‏\"‏ لتمش ولتركب ‏\"‏‏.‏ قال وكان أبو الخير لا يفارق عقبة‏.‏",
      "text_en": " Narrated `Uqba bin 'Amir:                     My sister vowed to go on foot to the Ka`ba, and she asked me to take the verdict of the Prophet about it. So, I did and the Prophet said, \"She should walk and also should ride.\"Narrated Abul-Khair from `Uqba as above.:",
      "chain": [
        "20241",
        "11070",
        "20379",
        "20304",
        "11410",
        "30309",
        "20467",
        "11070",
        "20375",
        "11411",
        "189"
      ]
    },
    {
      "hadith_no": "2480",
      "source": " Sahih Bukhari ",
      "chapter": "Oppressions - كتاب المظالم",
      "chapter_no": "46",
      "text_ar": "حدثنا عبد الله بن يزيد، حدثنا سعيد  هو ابن أبي أيوب  قال حدثني أبو الأسود، عن عكرمة، عن عبد الله بن عمرو  رضى الله عنهما  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ من قتل دون ماله فهو شهيد ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr bin Al-`As:                     I heard the Prophet saying, \"Whoever is killed while protecting his property then he is a martyr.\"",
      "chain": [
        "1945",
        "20375",
        "11114",
        "11023",
        "29"
      ]
    },
    {
      "hadith_no": "3118",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا عبد الله بن يزيد، حدثنا سعيد بن أبي أيوب، قال حدثني أبو الأسود، عن ابن أبي عياش  واسمه نعمان  عن خولة الأنصارية  رضى الله عنها  قالت سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إن رجالا يتخوضون في مال الله بغير حق، فلهم النار يوم القيامة ‏\"‏‏.‏",
      "text_en": " Narrated Khaula Al-Ansariya:                     I heard Allah's Apostle saying, \"Some people spend Allah's Wealth (i.e. Muslim's wealth) in an unjust manner; such people will be put in the (Hell) Fire on the Day of Resurrection.\"",
      "chain": [
        "1945",
        "20375",
        "11114"
      ]
    },
    {
      "hadith_no": "6427",
      "source": " Sahih Bukhari ",
      "chapter": "Invocations - كتاب الدعوات",
      "chapter_no": "80",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا ابن وهب، حدثنا سعيد بن أبي أيوب، عن أبي عقيل، أنه كان يخرج به جده عبد الله بن هشام من السوق أو إلى السوق فيشتري الطعام، فيلقاه ابن الزبير وابن عمر فيقولان أشركنا فإن النبي صلى الله عليه وسلم قد دعا لك بالبركة‏.‏ فربما أصاب الراحلة كما هي، فيبعث بها إلى المنزل‏.‏",
      "text_en": " Narrated Abu `Aqil:                     that his grandfather. `Abdullah bin Hisham used to take him from the market or to the market (the narrator is in doubt) and used to buy grain and when Ibn Az-Zubair and Ibn `Umar met him, they would say to him, \"Let us be your partners (in trading) as the Prophet invoked for Allah's blessing upon you.\" He would then take them as partners and he would Sometimes gain a whole load carried by an animal which he would send home.",
      "chain": [
        "30355",
        "20029",
        "20375"
      ]
    },
    {
      "hadith_no": "7296",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا عبد الله بن يزيد، حدثنا سعيد  هو ابن أبي أيوب  قال حدثني أبو عقيل، زهرة بن معبد عن جده عبد الله بن هشام، وكان، قد أدرك النبي صلى الله عليه وسلم وذهبت به أمه زينب ابنة حميد إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله بايعه‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ هو صغير ‏\"‏ فمسح رأسه ودعا له، وكان يضحي بالشاة الواحدة عن جميع أهله‏.‏",
      "text_en": " Narrated `Abdullah bin Hisham:                     who was born during the lifetime of the Prophet that his mother, Zainab bint Humaid had taken him to Allah's Apostle and said, \"O Allah's Apostle! Take his Pledge of allegiance (for Islam).\" The Prophet said, \"He (`Abdullah bin Hisham) is a little child,\" and passed his hand over his head and invoked Allah for him. `Abdullah bin Hisham used to slaughter one sheep as a sacrifice on behalf of all of his family.",
      "chain": [
        "30026",
        "1945",
        "20375",
        "11507",
        "5141"
      ]
    },
    {
      "hadith_no": "15",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني محمد بن عبد الله بن نمير، وزهير بن حرب، قالا حدثنا عبد الله بن يزيد، قال حدثني سعيد بن أبي أيوب، قال حدثني أبو هانئ، عن أبي عثمان، مسلم بن يسار عن أبي هريرة، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ سيكون في آخر أمتي أناس يحدثونكم ما لم تسمعوا أنتم ولا آباؤكم فإياكم وإياهم ‏\"‏ ‏.‏",
      "text_en": "",
      "chain": [
        "30212",
        "30022",
        "1945",
        "20375",
        "13"
      ]
    },
    {
      "hadith_no": "384",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن سلمة المرادي، حدثنا عبد الله بن وهب، عن حيوة، وسعيد بن أبي أيوب، وغيرهما، عن كعب بن علقمة، عن عبد الرحمن بن جبير، عن عبد الله بن عمرو بن العاص، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ إذا سمعتم المؤذن فقولوا مثل ما يقول ثم صلوا على فإنه من صلى على صلاة صلى الله عليه بها عشرا ثم سلوا الله لي الوسيلة فإنها منزلة في الجنة لا تنبغي إلا لعبد من عباد الله وأرجو أن أكون أنا هو فمن سأل لي الوسيلة حلت له الشفاعة ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Amr b. al-As reported Allah's Messenger (may peace be upon him) as saying:                      When you hear the Mu'adhdhin, repeat what he says, then invoke a blessing on me, for everyone who invokes a blessing on me will receive ten blessings from Allah; then beg from Allah al-Wasila for me, which is a rank in Paradise fitting for only one of Allah's servants, and I hope that I may be that one. If anyone who asks that I be given the Wasila, he will be assured of my intercession.",
      "chain": [
        "30491",
        "20029",
        "26010",
        "20375",
        "10872",
        "10865",
        "29"
      ]
    },
    {
      "hadith_no": "442",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا عبد الله بن يزيد المقرئ، حدثنا سعيد، - يعني ابن أبي أيوب - حدثنا كعب بن علقمة، عن بلال بن عبد الله بن عمر، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تمنعوا النساء حظوظهن من المساجد إذا استأذنوكم ‏\"‏ فقال بلال والله لنمنعهن ‏.‏ فقال له عبد الله أقول قال رسول الله صلى الله عليه وسلم وتقول أنت لنمنعهن ‏.‏",
      "text_en": " Ibn Umar reported:                      The Messenger of Allah (may peace be upon him) said: Do not deprive women of their share of the mosques, when they seek permission from you. Bilal said: By Allah, we would certainly prevent them. 'Abdullah said: I say that the Messenger of Allah (may peace be upon him) said it and you say: We would certainly prevent them!",
      "chain": [
        "30524",
        "23033",
        "20375",
        "10872",
        "11816",
        "18"
      ]
    },
    {
      "hadith_no": "500",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا زهير بن حرب، حدثنا عبد الله بن يزيد، أخبرنا سعيد بن أبي أيوب، عن أبي الأسود، عن عروة، عن عائشة، أنها قالت سئل رسول الله صلى الله عليه وسلم عن سترة المصلي فقال ‏\"‏ مثل مؤخرة الرحل ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported:                      The Messenger of Allah (may peace be upon him) was asked about sutra of a worshipper; he said: Equal to the back of the saddle.",
      "chain": [
        "30022",
        "1945",
        "20375",
        "11105",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2473",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو عبد الرحمن المقرئ، عن سعيد بن أبي، أيوب حدثني شرحبيل، - وهو ابن شريك - عن أبي عبد الرحمن الحبلي، عن عبد الله، بن عمرو بن العاص أن رسول الله صلى الله عليه وسلم قال ‏\"‏ قد أفلح من أسلم ورزق كفافا وقنعه الله بما آتاه ‏\"‏ ‏.‏",
      "text_en": " 'Amr b. al-'As reported Allah's Messenger (may peace be upon him) as saying:                      He Is successful who has accepted Islam, who has been provided with sufficient for his want and been made contented by Allah with what He has given him.",
      "chain": [
        "30201",
        "20375",
        "10862",
        "10938",
        "29"
      ]
    },
    {
      "hadith_no": "3638",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا عبيد الله بن سعيد، ومحمد بن أبي عمر، قالا حدثنا المقرئ، حدثنا سعيد، بن أبي أيوب حدثني أبو الأسود، عن عروة، عن عائشة، عن جدامة بنت وهب، أخت عكاشة قالت حضرت رسول الله صلى الله عليه وسلم في أناس وهو يقول ‏\"‏ لقد هممت أن أنهى عن الغيلة فنظرت في الروم وفارس فإذا هم يغيلون أولادهم فلا يضر أولادهم ذلك شيئا ‏\"‏ ‏.‏ ثم سألوه عن العزل فقال رسول الله صلى الله عليه وسلم ‏\"‏ ذلك الوأد الخفي ‏\"‏ ‏.‏ زاد عبيد الله في حديثه عن المقرئ وهى ‏{‏ وإذا الموءودة سئلت‏}‏",
      "text_en": " Judama daughter of Wahb, sister of Ukkasha (Allah be pleased with her). reported:                      I went to Allah's Messenger (may peace be upon him) along with some persons and he was saying: I intended to prohibit cohabitation with the suckling women, but I considered the Greeks and Persians, and saw that they suckle their children and this thing (cohabitation) does not do any harm to them (to the suckling women). Then they asked him about 'azl, whereupon he said. That is the secret (way of) burying alive, and Ubaidullah has made this addition in the hadith transmitted by al-Muqri and that is:\" When the one buried alive is asked.\"",
      "chain": [
        "30359",
        "20375",
        "11114",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "4340",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Vows - كتاب النذر",
      "chapter_no": "27",
      "text_ar": "وحدثني محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرنا سعيد، بن أبي أيوب أن يزيد بن أبي حبيب، أخبره أن أبا الخير حدثه عن عقبة بن عامر الجهني، أنه قال نذرت أختي ‏.‏ فذكر بمثل حديث مفضل ولم يذكر في الحديث حافية ‏.‏ وزاد وكان أبو الخير لا يفارق عقبة ‏.‏ وحدثنيه محمد بن حاتم، وابن أبي خلف، قالا حدثنا روح بن عبادة، حدثنا ابن، جريج أخبرني يحيى بن أيوب، أن يزيد بن أبي حبيب، أخبره بهذا الإسناد، ‏.‏ مثل حديث عبد الرزاق ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Uqba b. Amir Juhani. but in this no mention has been made of\" barefoot\".",
      "chain": [
        "30375",
        "20121",
        "11070",
        "20375",
        "11411",
        "189"
      ]
    },
    {
      "hadith_no": "4824",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا زهير بن حرب، وإسحاق بن إبراهيم، كلاهما عن المقرئ، قال زهير حدثنا عبد الله بن يزيد، حدثنا سعيد بن أبي أيوب، عن عبيد الله بن أبي جعفر القرشي، عن سالم، بن أبي سالم الجيشاني عن أبيه، عن أبي ذر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يا أبا ذر إني أراك ضعيفا وإني أحب لك ما أحب لنفسي لا تأمرن على اثنين ولا تولين مال يتيم ‏\"‏ ‏.‏",
      "text_en": " It has been reported on the authority of Abu Dharr that the Messenger of of Allah (may peace be upon him) said:                      Abu Dharr, I find that thou art weak and I like for thee what I like for myself. Do not rule over (even) two persons and do not manage the property of an orphan.",
      "chain": [
        "30022",
        "30123",
        "20321",
        "1945",
        "20375",
        "10913",
        "23"
      ]
    },
    {
      "hadith_no": "4985",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، وزهير بن حرب، - واللفظ لأبي بكر وإسحاق - قال إسحاق أخبرنا وقال الآخران حدثنا المقرئ عبد الله بن يزيد عن سعيد بن أبي أيوب حدثني شرحبيل بن شريك المعافري عن أبي عبد الرحمن الحبلي قال سمعت أبا أيوب يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ غدوة في سبيل الله أو روحة خير مما طلعت عليه الشمس وغربت ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Ayyub that the Messenger of Allah (may peace be upon him) said:                      A journey undertaken in the morning or evening (for Jihad) in the way of Allah is better than (anything) on which the sun rises or sets.",
      "chain": [
        "30201",
        "30123",
        "30022",
        "30312",
        "20375",
        "10862",
        "10938",
        "33"
      ]
    },
    {
      "hadith_no": "4986",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثني محمد بن عبد الله بن قهزاذ، حدثنا علي بن الحسن، عن عبد الله بن المبارك، أخبرنا سعيد بن أبي أيوب، وحيوة بن شريح، قال كل واحد منهما حدثني شرحبيل بن، شريك عن أبي عبد الرحمن الحبلي، أنه سمع أبا أيوب الأنصاري، يقول قال رسول الله صلى الله عليه وسلم بمثله سواء ‏.‏",
      "text_en": " This tradition has been narrated on the authority of Abu Ayyub through a different chain of transmitters having the same wording.",
      "chain": [
        "30561",
        "20025",
        "20375",
        "26010",
        "10862",
        "10938",
        "33"
      ]
    },
    {
      "hadith_no": "4992",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني زهير بن حرب، حدثنا عبد الله بن يزيد المقرئ، حدثنا سعيد بن أبي، أيوب حدثني عياش بن عباس القتباني، عن أبي عبد الرحمن الحبلي، عن عبد الله بن، عمرو بن العاص أن النبي صلى الله عليه وسلم قال ‏\"‏ القتل في سبيل الله يكفر كل شىء إلا الدين ‏\"‏ ‏.‏",
      "text_en": " It has been reported on the authority of Amr b. al-'As through a different chain of transmitters that the Messenger of Allah (may peace be upon him) said:                      Death in the way of Allah blots out everything except debt.",
      "chain": [
        "30022",
        "23033",
        "20375",
        "10871",
        "10938",
        "29"
      ]
    },
    {
      "hadith_no": "6020",
      "source": " Sahih Muslim ",
      "chapter": "The Book Concerning the Use of Correct Words - كتاب الألفاظ من الأدب وغيرها",
      "chapter_no": "41",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، كلاهما عن المقرئ، قال أبو بكر حدثنا أبو عبد الرحمن المقرئ، عن سعيد بن أبي أيوب، حدثني عبيد الله بن أبي جعفر، عن عبد الرحمن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من عرض عليه ريحان فلا يرده فإنه خفيف المحمل طيب الريح ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      He who is presented with a flower should not reject it, for it is light to carry and pleasant in odour.",
      "chain": [
        "30201",
        "30022",
        "20436",
        "20375",
        "11409",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "6677",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني أبو الطاهر، أحمد بن عمرو بن سرح أخبرنا عبد الله بن وهب، أخبرني  سعيد بن أبي أيوب، عن الوليد بن أبي الوليد، عن عبد الله بن دينار، عن عبد الله بن عمر، أن رجلا، من الأعراب لقيه بطريق مكة فسلم عليه عبد الله وحمله على حمار كان يركبه وأعطاه عمامة كانت على رأسه فقال ابن دينار فقلنا له أصلحك الله إنهم الأعراب وإنهم يرضون باليسير ‏.‏ فقال عبد الله إن أبا هذا كان ودا لعمر بن الخطاب وإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن أبر البر صلة الولد أهل ود أبيه ‏\"‏ ‏.‏",
      "text_en": " Ibn Dinar reported that a desert Arab met Abdullah b. 'Umar on the way to Mecca. 'Abdullah greeted him and mounted him upon the donkey on which he had been riding and gave him the turban that he had on his head. Ibn Dinar (further) reported:                      We said to him ('Abdullah b. 'Umar): May Allah do good to you, these are desert Arabs and they are satisfied even with meagre (things). Thereupon Abdullah said: His father was loved dearly by 'Umar b. Khattib and I heard Allah's Messenger (may peace be upon him) as saying: The finest act of goodness on the part of a son is to treat kindly the loved ones of his father.",
      "chain": [
        "20029",
        "20375",
        "10623",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "523",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سلمة، حدثنا ابن وهب، عن ابن لهيعة، وحيوة، وسعيد بن أبي أيوب، عن كعب بن علقمة، عن عبد الرحمن بن جبير، عن عبد الله بن عمرو بن العاص، أنه سمع النبي صلى الله عليه وسلم يقول ‏\"‏ إذا سمعتم المؤذن فقولوا مثل ما يقول ثم صلوا على فإنه من صلى على صلاة صلى الله عليه بها عشرا ثم سلوا الله عز وجل لي الوسيلة فإنها منزلة في الجنة لا تنبغي إلا لعبد من عباد الله تعالى وأرجو أن أكون أنا هو فمن سأل الله لي الوسيلة حلت عليه الشفاعة ‏\"‏ ‏.‏",
      "text_en": " ‘Abd Allah b. ‘Amr b. al-As reported the Messenger of Allah (May peace be upon him) as saying:                      when you hear the mu'adhdhin repeat what he says, invoke a blessing on me, for everyone who invoke one blessing on me will receive ten blessings from Allah. Then ask Allah to give me the wasilah, which is a rank in paradise fitting for only one of Allah’s servants, and I hope that I may be the one. If anyone asks Allah that I be given the wasilah, he will be assured of my intercession.",
      "chain": [
        "20672",
        "20029",
        "20624",
        "26010",
        "20375",
        "10872",
        "10865",
        "29"
      ]
    },
    {
      "hadith_no": "1110",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عوف، حدثنا المقرئ، حدثنا سعيد بن أبي أيوب، عن أبي مرحوم، عن سهل بن معاذ بن أنس، عن أبيه، أن رسول الله صلى الله عليه وسلم نهى عن الحبوة يوم الجمعة والإمام يخطب ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Messenger of Allah (ﷺ) prohibited to sit on hips by erecting feet, sticking them to the stomach and holding them with hands on Friday while the imam is delivering the sermon.",
      "chain": [
        "38566",
        "20375",
        "19814",
        "16045"
      ]
    },
    {
      "hadith_no": "1361",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا نصر بن علي، وجعفر بن مسافر، أن عبد الله بن يزيد المقرئ، أخبرهما عن سعيد بن أبي أيوب، عن جعفر بن ربيعة، عن عراك بن مالك، عن أبي سلمة، عن عائشة، ‏:‏ أن رسول الله صلى الله عليه وسلم صلى العشاء، ثم صلى ثماني ركعات قائما، وركعتين بين الأذانين ولم يكن يدعهما ‏.‏ قال جعفر بن مسافر في حديثه ‏:‏ وركعتين جالسا بين الأذانين، زاد ‏:‏ جالسا ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Messenger of Allah (ﷺ) offered the night prayer and then prayed eight rak'ahs standing, and two rak'ahs between the two adhans (i.e. the adhan for the dawn prayer and the iqamah). He never left them.Jaf'ar b. Musafir said in his version: (He prayed) the two rak'ahs sitting between the two adhans. He added the word \"sitting\".",
      "chain": [
        "30395",
        "38132",
        "20375",
        "11407",
        "11204",
        "10567"
      ]
    },
    {
      "hadith_no": "1399",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Ramadan - كتاب شهر رمضان",
      "chapter_no": "6",
      "text_ar": "حدثنا يحيى بن موسى البلخي، وهارون بن عبد الله، قالا أخبرنا عبد الله بن يزيد، أخبرنا سعيد بن أبي أيوب، حدثني عياش بن عباس القتباني، عن عيسى بن هلال الصدفي، عن عبد الله بن عمرو، قال أتى رجل رسول الله صلى الله عليه وسلم فقال أقرئني يا رسول الله ‏.‏ فقال ‏\"‏ اقرأ ثلاثا من ذوات الراء ‏\"‏ ‏.‏ فقال كبرت سني واشتد قلبي وغلظ لساني ‏.‏ قال ‏\"‏ فاقرأ ثلاثا من ذوات حم ‏\"‏ ‏.‏ فقال مثل مقالته ‏.‏ فقال ‏\"‏ اقرأ ثلاثا من المسبحات ‏\"‏ ‏.‏ فقال مثل مقالته فقال الرجل يا رسول الله أقرئني سورة جامعة ‏.‏ فأقرأه النبي صلى الله عليه وسلم ‏{‏ إذا زلزلت الأرض ‏}‏ حتى فرغ منها ‏.‏ فقال الرجل والذي بعثك بالحق لا أزيد عليها أبدا ثم أدبر الرجل فقال النبي صلى الله عليه وسلم ‏\"‏ أفلح الرويجل ‏\"‏ ‏.‏ مرتين ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr:                     A man came to the Messenger of Allah (ﷺ) and said: Teach me to read the Qur'an, Messenger of Allah.  He said: Read three surahs which begin with A.L.R.  He said: My age is advanced, my mind has become dull (i.e. memory has grown weak), and my tongue has grown heavy). So he said: Then read three surahs which begin with H.M. He repeated the same words.  So he said: Read three surahs which begin with the \"Glorification of Allah\". But he repeated the same excuse.  The man then said: Teach me a comprehensive surah, Messenger of Allah. The Prophet (ﷺ) taught him Surah (99). \"When the Earth is shaken with her earthquake\". When he finished it, the man said: By Him Who sent you with truth, I shall never add anything to it. Then man then went away.  The Prophet (ﷺ) said twice:  The man received salvation.",
      "chain": [
        "30221",
        "30524",
        "23033",
        "20375",
        "10871",
        "16083",
        "29"
      ]
    },
    {
      "hadith_no": "2412",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا عبيد الله بن عمر، حدثني عبد الله بن يزيد، ح وحدثنا جعفر بن مسافر، حدثنا عبد الله بن يحيى، - المعنى - حدثني سعيد بن أبي أيوب، وزاد، جعفر والليث حدثني يزيد بن أبي حبيب، أن كليب بن ذهل الحضرمي، أخبره عن عبيد، - قال جعفر ابن جبر - قال كنت مع أبي بصرة الغفاري صاحب النبي صلى الله عليه وسلم في سفينة من الفسطاط في رمضان فرفع ثم قرب غداه - قال جعفر في حديثه - فلم يجاوز البيوت حتى دعا بالسفرة قال اقترب ‏.‏ قلت ألست ترى البيوت قال أبو بصرة أترغب عن سنة رسول الله صلى الله عليه وسلم قال جعفر في حديثه فأكل ‏.‏",
      "text_en": " Narrated AbuBusrah al-Ghifari,:                     Ja'far ibn Jubayr said: I accompanied AbuBusrah al-Ghifari, a Companion of the Messenger of Allah (ﷺ), in a boat proceeding from al-Fustat (Cairo) during Ramadan. He was lifted (to the boat), then his meal was brought to him. The narrator Ja'far said in his version: He did not go beyond the houses (of the city) but he called for the dining sheet. He said (to me): Come near. I said: Do you not see the houses? AbuBusrah said: Do you detest the sunnah (practice) of the Messenger of Allah (ﷺ)? The narrator Ja'far said in his version: He then ate (it).",
      "chain": [
        "11201",
        "1945",
        "38132",
        "20375",
        "11411",
        "16090"
      ]
    },
    {
      "hadith_no": "2498",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح، حدثنا ابن وهب، عن يحيى بن أيوب، وسعيد بن أبي أيوب، عن زبان بن فائد، عن سهل بن معاذ، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الصلاة والصيام والذكر تضاعف على النفقة في سبيل الله بسبعمائة ضعف ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     The Messenger of Allah (ﷺ) said: (The reward of) prayer, fasting and remembrance of Allah is enhanced seven hundred times over (the reward of) spending in Allah's path.",
      "chain": [
        "30485",
        "20029",
        "20379",
        "20375",
        "16031"
      ]
    },
    {
      "hadith_no": "2789",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Sacrifice (Kitab Al-Dahaya) - كتاب الضحايا",
      "chapter_no": "16",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا عبد الله بن يزيد، حدثني سعيد بن أبي أيوب، حدثني عياش بن عباس القتباني، عن عيسى بن هلال الصدفي، عن عبد الله بن عمرو بن العاص، أن النبي صلى الله عليه وسلم قال ‏\"‏ أمرت بيوم الأضحى عيدا جعله الله عز وجل لهذه الأمة ‏\"‏ ‏.‏ قال الرجل أرأيت إن لم أجد إلا أضحية أنثى أفأضحي بها قال ‏\"‏ لا ولكن تأخذ من شعرك وأظفارك وتقص شاربك وتحلق عانتك فتلك تمام أضحيتك عند الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: I have been commanded to celebrate festival ('Id) on the day of sacrifice, which Allah, Most High, has appointed for this community. A man said: If I do not find except a she-goat or a she-camel borrowed for milk or other benefits, should I sacrifice it? He said: No, but you should clip your hair , and nails, trim your moustaches, and shave your pubes. This is all your sacrifice in the eyes of Allah, Most High.",
      "chain": [
        "30524",
        "1945",
        "20375",
        "10871",
        "16083",
        "29"
      ]
    },
    {
      "hadith_no": "2868",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wills (Kitab Al-Wasaya) - كتاب الوصايا",
      "chapter_no": "18",
      "text_ar": "حدثنا الحسن بن علي، حدثنا أبو عبد الرحمن المقرئ، حدثنا سعيد بن أبي أيوب، عن عبيد الله بن أبي جعفر، عن سالم بن أبي سالم الجيشاني، عن أبيه، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ذر إني أراك ضعيفا وإني أحب لك ما أحب لنفسي فلا تأمرن على اثنين ولا تولين مال يتيم ‏\"‏ ‏.‏ قال أبو داود تفرد به أهل مصر ‏.‏",
      "text_en": " Narrated Abu Dharr:                     The Messenger of Allah (ﷺ) said to me: Abu Dharr, I see you weak, and I like for you what I like for myself. Do not be a leader of two (persons), and do not be a guardian of an orphan.Abu Dawud said: This has been narrated only by the people of Egypt.",
      "chain": [
        "30115",
        "20375",
        "11409",
        "10913",
        "23"
      ]
    },
    {
      "hadith_no": "2942",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، حدثنا عبد الله بن يزيد، حدثنا سعيد بن أبي أيوب، حدثني أبو عقيل، زهرة بن معبد عن جده عبد الله بن هشام، قال وكان قد أدرك النبي صلى الله عليه وسلم وذهبت به أمه زينب بنت حميد إلى رسول الله صلى الله عليه وسلم فقالت يا رسول الله بايعه ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ هو صغير ‏\"‏ ‏.‏ فمسح رأسه ‏.‏",
      "text_en": " Narrated 'Abd Alla b. Hisham, :                     who was a Companion, reported that his mother Zainab daughter of Humain went to the Messenger of Allah (ﷺ) and said: Messenger of Allah,  receive the oath of allegiance from him. The Messenger of Allah (ﷺ) said: He is Minor. He then wiped his head.",
      "chain": [
        "30024",
        "1945",
        "20375",
        "11507",
        "5141"
      ]
    },
    {
      "hadith_no": "3299",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا مخلد بن خالد، حدثنا عبد الرزاق، أخبرنا ابن جريج، أخبرني سعيد بن أبي أيوب، أن يزيد بن أبي حبيب، أخبره أن أبا الخير حدثه عن عقبة بن عامر الجهني، قال ‏:‏ نذرت أختي أن تمشي، إلى بيت الله، فأمرتني أن أستفتي لها رسول الله صلى الله عليه وسلم فاستفتيت النبي صلى الله عليه وسلم فقال ‏:‏ ‏\"‏ لتمش ولتركب ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Uqbah bin 'Amir al-Juhani:                     My sister took a vow to walk on foot to the House of Allah (i.e. Ka'bah). She asked me to consult the Prophet (ﷺ) about her. So I consulted the Prophet (ﷺ). He said: Let her walk and ride.",
      "chain": [
        "30567",
        "20121",
        "11070",
        "20375",
        "11411",
        "189"
      ]
    },
    {
      "hadith_no": "3342",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، حدثني سعيد بن أبي أيوب، أنه سمع أبا عبد الله القرشي، يقول سمعت أبا بردة بن أبي موسى الأشعري، يقول عن أبيه، عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ إن أعظم الذنوب عند الله أن يلقاه بها عبد - بعد الكبائر التي نهى الله عنها - أن يموت رجل وعليه دين لا يدع له قضاء ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuMusa al-Ash'ari:                     The Prophet (ﷺ) said: After the grave sins which Allah has prohibited the greatest sin is that a man dies while he has debt due from him and does not leave anything to pay it off, and meets Him with it.",
      "chain": [
        "30584",
        "20029",
        "20375",
        "30184",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "3657",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Knowledge (Kitab Al-Ilm) - كتاب العلم",
      "chapter_no": "26",
      "text_ar": "حدثنا الحسن بن علي، حدثنا أبو عبد الرحمن المقرئ، حدثنا سعيد، - يعني ابن أبي أيوب - عن بكر بن عمرو، عن مسلم بن يسار أبي عثمان، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أفتى ‏\"‏ ‏.‏ ح وحدثنا سليمان بن داود أخبرنا ابن وهب حدثني يحيى بن أيوب عن بكر بن عمرو عن عمرو بن أبي نعيمة عن أبي عثمان الطنبذي - رضيع عبد الملك بن مروان - قال سمعت أبا هريرة يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من أفتي بغير علم كان إثمه على من أفتاه ‏\"‏ ‏.‏ زاد سليمان المهري في حديثه ‏\"‏ ومن أشار على أخيه بأمر يعلم أن الرشد في غيره فقد خانه ‏\"‏ ‏.‏ وهذا لفظ سليمان ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: If anyone is given a legal decision ignorantly, the sin rests on the one who gave it. Sulayman al-Mahri added in his version: If anyone advises his brother, knowing that guidance lies in another direction, he has deceived him. These are the wordings of Sulayman.",
      "chain": [
        "30115",
        "20375",
        "10850",
        "13118",
        "13"
      ]
    },
    {
      "hadith_no": "3851",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا أحمد بن صالح، حدثنا ابن وهب، أخبرني سعيد بن أبي أيوب، عن أبي عقيل القرشي، عن أبي عبد الرحمن الحبلي، عن أبي أيوب الأنصاري، قال كان رسول الله صلى الله عليه وسلم إذا أكل أو شرب قال ‏\"‏ الحمد لله الذي أطعم وسقى وسوغه وجعل له مخرجا ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuAyyub al-Ansari:                     When the Messenger of Allah (ﷺ) ate or drank, he said: \"Praise be to Allah Who has given food and drink and made it easy to swallow, and provided an exit for it.",
      "chain": [
        "30226",
        "20029",
        "20375",
        "10938",
        "33"
      ]
    },
    {
      "hadith_no": "3869",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Medicine (Kitab Al-Tibb) - كتاب الطب",
      "chapter_no": "29",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، حدثنا عبد الله بن يزيد، حدثنا سعيد بن أبي أيوب، حدثنا شرحبيل بن يزيد المعافري، عن عبد الرحمن بن رافع التنوخي، قال سمعت عبد الله بن عمرو، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ ما أبالي ما أتيت إن أنا شربت ترياقا أو تعلقت تميمة أو قلت الشعر من قبل نفسي ‏\"‏ ‏.‏ قال أبو داود هذا كان للنبي صلى الله عليه وسلم خاصة وقد رخص فيه قوم يعني الترياق ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     I heard the Messenger of Allah (ﷺ) say: If I drink an antidote, or tie an amulet, or compose poetry, I am the type who does not care what he does.Abu Dawud said: THis was peculiar to the Prophet (ﷺ), but some people have allowed to use it, i.e. antidote.",
      "chain": [
        "30024",
        "1945",
        "20375",
        "16064",
        "29"
      ]
    },
    {
      "hadith_no": "4023",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا نصير بن الفرج، حدثنا عبد الله بن يزيد، حدثنا سعيد، - يعني ابن أبي أيوب - عن أبي مرحوم، عن سهل بن معاذ بن أنس، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أكل طعاما ثم قال الحمد لله الذي أطعمني هذا الطعام ورزقنيه من غير حول مني ولا قوة غفر له ما تقدم من ذنبه وما تأخر ومن لبس ثوبا فقال الحمد لله الذي كساني هذا الثوب ورزقنيه من غير حول مني ولا قوة غفر له ما تقدم من ذنبه وما تأخر ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'adh ibn Anas:                     The Prophet (ﷺ) said: If anyone eats food and then says: \"Praise be to Allah Who has fed me with this food and provided me with it through no might and power on my part,\" he will be forgiven his former and later sins. If anyone puts on a garment and says: \"Praise be to Allah Who has clothed me with this and provided me with it through no might and power on my part,\" he will be forgiven his former and later sins.",
      "chain": [
        "38667",
        "1945",
        "20375",
        "19814",
        "16045"
      ]
    },
    {
      "hadith_no": "4172",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا الحسن بن علي، وهارون بن عبد الله، - المعنى - أن أبا عبد الرحمن المقرئ، حدثهم عن سعيد بن أبي أيوب، عن عبيد الله بن أبي جعفر، عن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من عرض عليه طيب فلا يرده فإنه طيب الريح خفيف المحمل ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (ﷺ) as saying:                      If anyone is presented some perfume, he should not return it, for it is a thing of good fragrance and light to bear.",
      "chain": [
        "30",
        "20375",
        "11409",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "4291",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا سليمان بن داود المهري، أخبرنا ابن وهب، أخبرني سعيد بن أبي أيوب، عن شراحيل بن يزيد المعافري، عن أبي علقمة، عن أبي هريرة، فيما أعلم عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الله يبعث لهذه الأمة على رأس كل مائة سنة من يجدد لها دينها ‏\"‏ ‏.‏ قال أبو داود رواه عبد الرحمن بن شريح الإسكندراني لم يجز به شراحيل ‏.‏",
      "text_en": " Narrated Abu Hurayrah:                     The Prophet (ﷺ) said: Allah will raise for this community at the end of every hundred years the one who will renovate its religion for it.Abu Dawud said: 'Abd al-Rahman bin Shuriah al-Iskandarani has also transmitted this tradition, but he did not exceed Shrahil.",
      "chain": [
        "30584",
        "20029",
        "20375",
        "10861"
      ]
    },
    {
      "hadith_no": "4613",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن حنبل، قال حدثنا عبد الله بن يزيد، قال حدثنا سعيد، - يعني ابن أبي أيوب - قال أخبرني أبو صخر، عن نافع، قال كان لابن عمر صديق من أهل الشام يكاتبه فكتب إليه عبد الله بن عمر إنه بلغني أنك تكلمت في شىء من القدر فإياك أن تكتب إلى فإني سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنه سيكون في أمتي أقوام يكذبون بالقدر ‏\"‏ ‏.‏",
      "text_en": " Nafi said:                      Ibn ‘Umar had a friend from the people of Syria who used to correspond with him. ‘Abd Allah b. ‘Umar wrote to him: I have been informed that you have talked something about Divine decree. You should write it to me, for I heard the Messenger of Allah (ﷺ) say: Among my community there will be people who will falsify Divine decree.",
      "chain": [
        "30007",
        "1945",
        "20375",
        "11014"
      ]
    },
    {
      "hadith_no": "4710",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا عبد الله بن يزيد المقرئ أبو عبد الرحمن، قال حدثني سعيد بن أبي أيوب، قال حدثني عطاء بن دينار، عن حكيم بن شريك الهذلي، عن يحيى بن ميمون الحضرمي، عن ربيعة الجرشي، عن أبي هريرة، عن عمر بن الخطاب، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تجالسوا أهل القدر ولا تفاتحوهم ‏\"‏ ‏.‏",
      "text_en": " ‘Umar reported the Prophet (May peace be upon him) was asked :                      Do not sit which those who believe in free will and do not address them before they address you.",
      "chain": [
        "30007",
        "20375",
        "16075",
        "26009",
        "16112",
        "14894",
        "13",
        "3"
      ]
    },
    {
      "hadith_no": "4720",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن سعيد الهمداني، أخبرنا ابن وهب، قال أخبرني ابن لهيعة، وعمرو بن الحارث، وسعيد بن أبي أيوب، عن عطاء بن دينار، عن حكيم بن شريك الهذلي، عن يحيى بن ميمون، عن ربيعة الجرشي، عن أبي هريرة، عن عمر بن الخطاب، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تجالسوا أهل القدر ولا تفاتحوهم الحديث ‏\"‏ ‏.‏",
      "text_en": " ‘Umar b. al-Khattab reported the Messenger of Allah (May peace be upon him) as saying :                      Do not sit with those who believe in free will and do not address them before they address you.",
      "chain": [
        "30296",
        "20029",
        "20624",
        "20377",
        "20375",
        "16075",
        "26009",
        "24500",
        "14894",
        "13",
        "3"
      ]
    },
    {
      "hadith_no": "4777",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن السرح، حدثنا ابن وهب، عن سعيد، - يعني ابن أبي أيوب - عن أبي مرحوم، عن سهل بن معاذ، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من كظم غيظا - وهو قادر على أن ينفذه - دعاه الله عز وجل على رءوس الخلائق يوم القيامة حتى يخيره الله من الحور ما شاء ‏\"‏ ‏.‏ قال أبو داود اسم أبي مرحوم عبد الرحمن بن ميمون ‏.‏",
      "text_en": " Narrated Mu'adh ibn Jabal:                     The Messenger of Allah (ﷺ) said: if anyone suppresses anger when he is in a position to give vent to it, Allah, the Exalted, will call him on the Day of Resurrection over the heads of all creatures, and ask him to choose any of the bright and large eyed maidens he wishes.Abu Dawud said: The name if the transmitter Abu Marhum is 'Abd al-Rahman b. Maimun",
      "chain": [
        "30485",
        "20029",
        "20375",
        "19814"
      ]
    },
    {
      "hadith_no": "5061",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا حامد بن يحيى، حدثنا أبو عبد الرحمن، حدثنا سعيد، - يعني ابن أبي أيوب - قال حدثني عبد الله بن الوليد، عن سعيد بن المسيب، عن عائشة، رضى الله عنها أن رسول الله صلى الله عليه وسلم كان إذا استيقظ من الليل قال ‏\"‏ لا إله إلا أنت سبحانك اللهم أستغفرك لذنبي وأسألك رحمتك اللهم زدني علما ولا تزغ قلبي بعد إذ هديتني وهب لي من لدنك رحمة إنك أنت الوهاب ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     When the Messenger of Allah (ﷺ) awake at night, he said: There is no god but thou, glory be to Thee, O Allah, I ask Thy pardon for my sin and I ask Thee for Thy mercy. O Allah! advance me in knowledge: do not cause my heart to deviate (from guidance) after Thou hast guided me, and grant me mercy from thyself; verily thou art the grantor.",
      "chain": [
        "20375",
        "11002",
        "53"
      ]
    },
    {
      "hadith_no": "5121",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن السرح، حدثنا ابن وهب، عن سعيد بن أبي أيوب، عن محمد بن عبد الرحمن المكي، - يعني ابن أبي لبيبة - عن عبد الله بن أبي سليمان، عن جبير بن مطعم، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس منا من دعا إلى عصبية وليس منا من قاتل على عصبية وليس منا من مات على عصبية ‏\"‏ ‏.‏",
      "text_en": " Jubair b. Mut’im reported the Messenger of Allah (May peace be upon him) as saying:                      he who summons others to party-spirit does not belong to us; and he who dies upholding party spirit does not belong to us.’",
      "chain": [
        "30485",
        "20029",
        "20375",
        "18524",
        "871"
      ]
    },
    {
      "hadith_no": "514",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن حميد الرازي، وعباس بن محمد الدوري، قالا حدثنا أبو عبد الرحمن المقرئ، عن سعيد بن أبي أيوب، حدثني أبو مرحوم، عن سهل بن معاذ، عن أبيه، أن النبي صلى الله عليه وسلم نهى عن الحبوة يوم الجمعة والإمام يخطب ‏.‏ قال أبو عيسى وهذا حديث حسن ‏.‏ وأبو مرحوم اسمه عبد الرحيم بن ميمون ‏.‏ وقد كره قوم من أهل العلم الحبوة يوم الجمعة والإمام يخطب ورخص في ذلك بعضهم منهم عبد الله بن عمر وغيره وبه يقول أحمد وإسحاق لا يريان بالحبوة والإمام يخطب بأسا ‏.‏",
      "text_en": " Sahl bin Ma'adh narrated from his father:                     \"The Prophet prohibited Al-Habwah on Friday while the Imam is delivering the Khutbah.\"",
      "chain": [
        "38495",
        "30585",
        "20375"
      ]
    },
    {
      "hadith_no": "2153",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا عباس الدوري، وغير، واحد، قالوا حدثنا عبد الله بن يزيد المقرئ، حدثنا سعيد بن أبي أيوب، حدثني أبو مرحوم عبد الرحيم بن ميمون، عن سهل بن معاذ بن أنس الجهني، عن أبيه، عن النبي صلى الله عليه وسلم قال ‏\"‏ من كظم غيظا وهو يستطيع أن ينفذه دعاه الله يوم القيامة على رءوس الخلائق حتى يخيره في أى الحور شاء ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏",
      "text_en": " Sahl bim Mu'adh bin Anas Al-Juhani narrated that the Messenger of Allah said:                     \"Whoever suppresses his rage while he is able to unleash it, Allah will call him before the heads (leaders) of creation on the Day of Judgement, so that he can inform Him of which of the Hur he would like.\"",
      "chain": [
        "30585",
        "23033",
        "20375",
        "19814"
      ]
    },
    {
      "hadith_no": "2348",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا العباس بن محمد الدوري، حدثنا عبد الله بن يزيد المقرئ، حدثنا سعيد بن أبي أيوب، عن شرحبيل بن شريك، عن أبي عبد الرحمن الحبلي، عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ قد أفلح من أسلم وكان رزقه كفافا وقنعه الله ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " 'Abdullah bin 'Amr narrated that the Messenger of Allah (s.a.w) said:                     \"He has succeeded who accepts Islam, and is provided with what is sufficient and is made content by Allah.\"",
      "chain": [
        "23033",
        "20375",
        "10862",
        "10938",
        "29"
      ]
    },
    {
      "hadith_no": "2355",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا العباس بن محمد الدوري، حدثنا عبد الله بن يزيد المقرئ، حدثنا سعيد بن أبي أيوب، عن عمرو بن جابر الحضرمي، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يدخل فقراء المسلمين الجنة قبل أغنيائهم بأربعين خريفا ‏\"‏ ‏.‏ هذا حديث حسن ‏.‏",
      "text_en": " Jabir bin 'Abdullah narrated that the Messenger of Allah (s.a.w) said:                     \"The poor Muslims are admitted into Paradise before their rich by forty autumns.\"",
      "chain": [
        "23033",
        "20375",
        "16080",
        "34"
      ]
    },
    {
      "hadith_no": "2616",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا سويد بن نصر، أخبرنا عبد الله بن المبارك، أخبرنا سعيد بن أبي أيوب، حدثنا يحيى بن أبي سليمان، عن سعيد المقبري، عن أبي هريرة، قال قرأ رسول الله صلى الله عليه وسلم ‏(‏يومئذ تحدث أخبارها ‏)‏ قال ‏\"‏ أتدرون ما أخبارها ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإن أخبارها أن تشهد على كل عبد أو أمة بما عمل على ظهرها أن تقول عمل كذا وكذا يوم كذا وكذا قال فهذه أخبارها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " \"Abu Hurairah narrated:                      \"The Messenger of Allah (s.a.w) recited:That Day it will declare its information. And said: 'Do you know what its information is?' they said: 'Allah and His Messenger know best.' He said: 'Indeed its information is that it will testify against every servant, male and female, It will say that he did such and such, on such and such a day.' He said: 'With this it shall be ordered.'\"",
      "chain": [
        "38265",
        "20025",
        "20375",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "2669",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا عباس بن محمد الدوري، حدثنا عبد الله بن يزيد المقرئ، حدثنا سعيد بن أبي أيوب، عن أبي مرحوم عبد الرحيم بن ميمون، عن سهل بن معاذ بن أنس الجهني، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من ترك اللباس تواضعا لله وهو يقدر عليه دعاه الله يوم القيامة على رءوس الخلائق حتى يخيره من أى حلل الإيمان شاء يلبسها ‏\"‏ ‏.‏ هذا حديث حسن ‏.‏ ومعنى قوله ‏\"‏ حلل الإيمان ‏\"‏ ‏.‏ يعني ما يعطى أهل الإيمان من حلل الجنة ‏.‏",
      "text_en": " Sahl bin Mu'adh bin Anas Al-Juhani narrated from his father, that the Messenger of Allah (s.a.w)said:                     \"Whoever leaves(valuable) dress out of humility to Allah while he is able to (afford it), Allah will call him before the heads of creation on the Day of Judgement so that he can chose whichever Hulal of faith he wishes to wear.\"",
      "chain": [
        "30585",
        "23033",
        "20375",
        "19814"
      ]
    },
    {
      "hadith_no": "2681",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا عبد بن حميد، وعباس بن محمد الدوري، قالا حدثنا عبد الله بن يزيد المقرئ، حدثنا سعيد بن أبي أيوب، حدثني أبو مرحوم عبد الرحيم بن ميمون، عن سهل بن معاذ بن أنس، عن أبيه، أن النبي صلى الله عليه وسلم قال ‏\"‏ من كظم غيظا وهو يقدر على أن ينفذه دعاه الله على رءوس الخلائق يوم القيامة حتى يخيره في أى الحور شاء ‏\"‏ ‏.‏ قال هذا حديث حسن غريب ‏.‏",
      "text_en": " Sahl bin Mu'ad bin Anas narrated from his father, that the Prophet (s.a.w) said:                     \"Whoever suppresses his rage, while he is able to exact it, Allah will call him before the heads of creation [on the Day of Judgement] so that he can chose whichever of the Hur he wishes.\"",
      "chain": [
        "30553",
        "30585",
        "23033",
        "20375",
        "19814",
        "16045"
      ]
    },
    {
      "hadith_no": "2713",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا عباس بن محمد الدوري، حدثنا عبد الله بن يزيد، حدثنا سعيد بن أبي أيوب، عن أبي مرحوم عبد الرحيم بن ميمون، عن سهل بن معاذ بن أنس الجهني، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أعطى لله ومنع لله وأحب لله وأبغض لله وأنكح لله فقد استكمل إيمانه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Sahl bin Mu'adh[bin Anas] Al-Juhni narrated from his father that the Prophet (s.a.w) said:                     \"Whoever gives for the sake of Allah, withholds for the sake of Allah, loves for the sake of Allah, hates for the sake of Allah, and marries for the sake of Allah, he has indeed perfected his faith.\"",
      "chain": [
        "30585",
        "1945",
        "20375",
        "19814"
      ]
    },
    {
      "hadith_no": "3677",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا سويد بن نصر، أخبرنا عبد الله بن المبارك، أخبرنا سعيد بن أبي أيوب، عن يحيى بن أبي سليمان، عن سعيد المقبري، عن أبي هريرة، رضي الله عنه قال قرأ رسول الله صلى الله عليه وسلم هذه الآية ‏:‏ ‏(‏ يومئذ تحدث أخبارها ‏)‏ قال ‏\"‏ أتدرون ما أخبارها ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإن أخبارها أن تشهد على كل عبد أو أمة بما عمل على ظهرها تقول عمل يوم كذا كذا وكذا فهذه أخبارها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah, may Allah be pleased with him, said:                     “The Messenger of Allah recited this Ayah: ‘That Day it will declare its information.’ He said: “Do you know what its information is?” They said: “Allah and His Messenger know better.” He said: “That it testifies about what every male or female slave (of Allah) did upon its surface. It says: ‘He did this and that on this day.’ This is its information.”",
      "chain": [
        "38265",
        "20025",
        "20375",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "3458",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن إسماعيل، حدثنا عبد الله بن يزيد المقرئ، حدثنا سعيد بن أبي أيوب، حدثني أبو مرحوم، عن سهل بن معاذ بن أنس، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أكل طعاما فقال الحمد لله الذي أطعمني هذا ورزقنيه من غير حول مني ولا قوة ‏.‏ غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏ قال هذا حديث حسن غريب وأبو مرحوم اسمه عبد الرحيم بن ميمون ‏.‏",
      "text_en": " Sahl bin Mu’adh bin Anas narrated from his father that:                     The Messenger of Allah said: “Whoever eats food and then says: ‘All praise is due to Allah who fed me this and granted it as provision to me, without any effort from me nor power, (Al-Hamdulillah, Alladhi At’amani Hadha Wa Razaqanihi Min Ghairi Hawlin Minni, Wa La Quwwatin)’ his past sins shall be forgiven.”",
      "chain": [
        "34188",
        "23033",
        "20375",
        "16045"
      ]
    },
    {
      "hadith_no": "3119",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا محمد بن عبد الله بن يزيد، قال حدثنا أبي قال، حدثنا سعيد بن أبي أيوب، قال حدثني شرحبيل بن شريك المعافري، عن أبي عبد الرحمن الحبلي، أنه سمع أبا أيوب الأنصاري، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ غدوة في سبيل الله أو روحة خير مما طلعت عليه الشمس وغربت ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu 'Abdur-Rahman Al-Hubuli that he heard Abu Ayyub Al-Ansari say:                      \"The Messenger of Allah (ﷺ) said: 'Going out before noon and after noon, in the cause of Allah, is better than everything on which the sun rises and sets.'\"",
      "chain": [
        "20375",
        "10862",
        "10938",
        "33"
      ]
    },
    {
      "hadith_no": "3282",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا عبد الله بن محمد بن تميم، قال سمعت حجاجا، يقول قال ابن جريج أخبرني سعيد بن أبي أيوب، عن يزيد بن أبي حبيب، أن أبا الخير، حدثه عن عقبة بن عامر، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن أحق الشروط أن يوفى به ما استحللتم به الفروج ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Utbah bin 'Amir that the Messenger of Allah said:                      \"The conditions that are most deserving of fulfillment are those by means of which the private parts become permitted to you.\"",
      "chain": [
        "20219",
        "11070",
        "20375",
        "11411",
        "189"
      ]
    },
    {
      "hadith_no": "3667",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا العباس بن محمد، قال حدثنا عبد الله بن يزيد، عن سعيد بن أبي أيوب، عن عبيد الله بن أبي جعفر، عن سالم بن أبي سالم الجيشاني، عن أبيه، عن أبي ذر، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا ذر إني أراك ضعيفا وإني أحب لك ما أحب لنفسي لا تأمرن على اثنين ولا تولين على مال يتيم ‏\"‏‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                      \"The Messenger of Allah said to me: 'O Abu Dharr, I think that you are weak, and I like for you what I like for myself. Do not accept a position of Amir over two people, and do not agree to be the guardian of an orphan's property.'\"",
      "chain": [
        "1945",
        "20375",
        "11409",
        "10913",
        "23"
      ]
    },
    {
      "hadith_no": "3814",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرني يوسف بن سعيد، قال حدثنا حجاج، عن ابن جريج، قال حدثني سعيد بن أبي أيوب، عن يزيد بن أبي حبيب، أخبره أن أبا الخير حدثه عن عقبة بن عامر، قال نذرت أختي أن تمشي، إلى بيت الله فأمرتني أن أستفتي لها رسول الله صلى الله عليه وسلم فاستفتيت لها النبي صلى الله عليه وسلم فقال ‏\"‏ لتمش ولتركب ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Uqbah bin 'Amir said:                      \"My sister vowed to walk to the House of Allah, and she told me to ask the Messenger of Allah about that. So I asked the Prophet for her and he said: 'Let her walk, and let her ride.'\"",
      "chain": [
        "20219",
        "11070",
        "20375",
        "11411",
        "189"
      ]
    },
    {
      "hadith_no": "4365",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of ad-Dahaya (Sacrifices) - كتاب الضحايا",
      "chapter_no": "43",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا ابن وهب، قال أخبرني سعيد بن أبي أيوب، وذكر، آخرين عن عياش بن عباس القتباني، عن عيسى بن هلال الصدفي، عن عبد الله بن عمرو بن العاص، أن رسول الله صلى الله عليه وسلم قال لرجل ‏\"‏ أمرت بيوم الأضحى عيدا جعله الله عز وجل لهذه الأمة ‏\"‏ ‏.‏ فقال الرجل أرأيت إن لم أجد إلا منيحة أنثى أفأضحي بها قال ‏\"‏ لا ولكن تأخذ من شعرك وتقلم أظفارك وتقص شاربك وتحلق عانتك فذلك تمام أضحيتك عند الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Amr bin al-As that the Messenger of Allah said to a man:                     \"I have been instructed to take the Day of Sacrifice as an 'Id which Allah, the Might and Sublime, has ordained for this Ummah.\" The man said: \"What do you think if I cannot find anything but a female sheep that has been loaned to me so that I may benefit from its milk - should I sacrifice it?\" He said: \"No. Rather cut something from your hair and your nails, trim your mustache and shave your pubic hairs, and you will have a complete reward with Allah, the Might and Sublime, as if you had offered the sacrifice.\"",
      "chain": [
        "30493",
        "20029",
        "20375",
        "10871",
        "16083",
        "29"
      ]
    },
    {
      "hadith_no": "55",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن يزيد، عن سعيد بن أبي أيوب، حدثني أبو هانئ، حميد بن هانئ الخولاني عن أبي عثمان، مسلم بن يسار عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من أفتي بفتيا غير ثبت فإنما إثمه على من أفتاه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah (ﷺ) said: 'Whoever is given a Fatwa (verdict) that has no basis, then his sin will be upon the one who issued that Fatwa.'\"",
      "chain": [
        "30201",
        "1945",
        "20375",
        "13"
      ]
    },
    {
      "hadith_no": "2538",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن المصفى الحمصي، حدثنا بقية بن الوليد، عن مسلمة بن على، عن سعيد بن أبي أيوب، عن الحارث بن يزيد، عن على بن رباح، قال سمعت عتبة بن الندر، يقول كنا عند رسول الله صلى الله عليه وسلم فقرأ طسم حتى إذا بلغ قصة موسى قال ‏\"‏ إن موسى صلى الله عليه وسلم أجر نفسه ثماني سنين أو عشرا على عفة فرجه وطعام بطنه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ali bin Rabah said:                     “I heard 'Utbah bin Nuddar say: 'We were with the Messenger of Allah (ﷺ) and he recited Ta-Sin. When he reached the story of Musa, he said: 'Musa (A.S) hired himself out for eight years, or ten, in return for his chastity and food in his stomach.' ”",
      "chain": [
        "20644",
        "20375"
      ]
    },
    {
      "hadith_no": "3410",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا حرملة بن يحيى، حدثنا عبد الله بن وهب، أخبرني سعيد بن أبي أيوب، عن أبي مرحوم عبد الرحيم، عن سهل بن معاذ بن أنس الجهني، عن أبيه، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ من أكل طعاما فقال الحمد لله الذي أطعمني هذا ورزقنيه من غير حول مني ولا قوة غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Sahl bin Mu’adh bin Anas Al-Juhani, from hisfather,that the Prophet (ﷺ) said:                      “Whoever eats food and said: Al-hamdulillahil-ladhi at’amani hadha wa razaqanihi min ghayri hawlinminniwa la quwwatin (Praise is to Allah Who has fed me this andprovidedit for me without any strength or power on my part), - hisprevioussins will be forgiven.”",
      "chain": [
        "30487",
        "20029",
        "20375"
      ]
    },
    {
      "hadith_no": "3679",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا علي بن محمد، حدثنا يحيى بن آدم، حدثنا ابن المبارك، عن سعيد بن أبي أيوب، عن يحيى بن أبي سليمان، عن زيد بن أبي عتاب، عن أبي هريرة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ خير بيت في المسلمين بيت فيه يتيم يحسن إليه وشر بيت في المسلمين بيت فيه يتيم يساء إليه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah(ﷺ) said:                     \"The best house among the Muslims is a house in which there is an orphan who is treated well. And the worst house among the Muslims is a house in which there is an orphan who is treated badly.\"",
      "chain": [
        "38409",
        "20364",
        "20025",
        "20375",
        "17024",
        "13"
      ]
    }
  ],
  "total_hadiths": 63
}