{
  "id": "20385",
  "name": "Sa'd bin Ibrahim bin Sa'd سعد بن إبراهيم بن سعد",
  "full_name": "Sa'd bin Ibrahim bin Sa'd سعد بن إبراهيم بن سعد",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "138",
      "date_gregorian": "NA",
      "date_display": [
        "138 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "201",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Baghdad",
      "Wasit"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  س  -  ثقة ]"
    ],
    "tags": [
      "B.Zuhrah",
      "al-Baghdadi",
      "Wasit"
    ]
  },
  "parents": [
    {
      "id": "20150",
      "name": "Ibrahim bin Sa'd bin Ibrahim إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "20184",
      "name": "Ya'qub bin Ibrahim bin Sa'd يعقوب بن إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "children": [
    {
      "id": "30348",
      "name": "'Abdullah bin Sa'd bin Ibrahim bin Sa'd عبد الله بن سعد بن إبراهيم بن سعد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30258",
      "name": "'Ubaidullah bin Sa'd bin Ibrahim b. Sa'd عبيد الله بن سعد بن إبراهيم بن سعد",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "teachers": [
    {
      "id": "20150",
      "name": "Ibrahim bin Sa'd bin Ibrahim إبراهيم بن سعد بن إبراهيم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "25185",
      "name": "'Ubaid'h bin Abi Ra'ith عبيدة بن أبي رائطة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30348",
      "name": "'Abdullah bin Sa'd bin Ibrahim bin Sa'd عبد الله بن سعد بن إبراهيم بن سعد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30258",
      "name": "'Ubaidullah bin Sa'd bin Ibrahim b. Sa'd عبيد الله بن سعد بن إبراهيم بن سعد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30008",
      "name": "Ibn Sa'd محمد بن سعد البغدادي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38207",
      "name": "Khalaf bin Salm al-Makharrami خلف بن سالم المخرمي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "37584",
      "name": "Muhammad bin al-Husain al-Barjlani محمد بن الحسين البرجلاني",
      "grade": "3rd Century AH"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-7531",
      "hadith_no": "7531",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا عبيد الله بن سعد بن إبراهيم، حدثني عمي، حدثنا أبي، عن صالح، عن ابن شهاب، قال حدثني أنس بن مالك، أن رسول الله صلى الله عليه وسلم أرسل إلى الأنصار فجمعهم في قبة وقال لهم ‏\"‏ اصبروا حتى تلقوا الله ورسوله، فإني على الحوض ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle sent for the Ansar and gathered them in a tent and said to them, \"Be patient till you meet Allah and His Apostle, and I will be on the lake-Tank (Al-Kauthar).",
      "usc_msa_ref": "533",
      "chain": [
        "30258",
        "20385",
        "11176",
        "11013",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-1280",
      "hadith_no": "1280",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا عبيد الله بن سعد، حدثنا عمي، حدثنا أبي، عن ابن إسحاق، عن محمد بن عمرو بن عطاء، عن ذكوان، مولى عائشة أنها حدثته أن رسول الله صلى الله عليه وسلم كان يصلي بعد العصر وينهى عنها ويواصل وينهى عن الوصال ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Dhakwan, the client of Aisha, reported on the authority of Aisha: The Messenger of Allah (ﷺ) used to pray after the afternoon prayer but prohibited others from it; and he would fast continuously but forbid others to do so.",
      "usc_msa_ref": "",
      "chain": [
        "30258",
        "20385",
        "11107",
        "11220",
        "11505"
      ]
    },
    {
      "id": "sunan-abi-daud-1369",
      "hadith_no": "1369",
      "source": "Sunan Abi Da'ud",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا عبيد الله بن سعد، حدثنا عمي، حدثنا أبي، عن ابن إسحاق، عن هشام بن عروة، عن أبيه، عن عائشة، ‏:‏ أن النبي صلى الله عليه وسلم بعث إلى عثمان بن مظعون فجاءه فقال ‏:‏ ‏\"‏ يا عثمان أرغبت عن سنتي ‏\"‏ ‏.‏ قال ‏:‏ لا والله يا رسول الله، ولكن سنتك أطلب ‏.‏ قال ‏:‏ ‏\"‏ فإني أنام وأصلي، وأصوم وأفطر، وأنكح النساء، فاتق الله يا عثمان، فإن لأهلك عليك حقا، وإن لضيفك عليك حقا، وإن لنفسك عليك حقا، فصم وأفطر، وصل ونم ‏\"‏ ‏.‏",
      "text_en": " Narrated 'Aishah:                     The Prophet (ﷺ) called 'Uthman b. Maz'un. When he came to him, he said: 'Uthman, did you dislike my practice ? He said: No, by Allah, but I seek your practice. He said: I sleep, I pray, I keep fast, I (sometimes) leave fast, and I marry women. Fear Allah, 'Uthman, your wife has a right on you, your guest has a right on you, your self has a right on you ; you should keep fast and (sometimes) leave fast, and pray and sleep.",
      "usc_msa_ref": "",
      "chain": [
        "30258",
        "20385",
        "11107",
        "11065",
        "10511"
      ]
    },
    {
      "id": "sunan-abi-daud-3632",
      "hadith_no": "3632",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Office of the Judge (Kitab Al-Aqdiyah) - كتاب الأقضية",
      "chapter_no": "25",
      "text_ar": "حدثنا عبيد الله بن سعد بن إبراهيم، حدثنا عمي، حدثنا أبي، عن ابن إسحاق، عن أبي نعيم، وهب بن كيسان عن جابر بن عبد الله، أنه سمعه يحدث، قال أردت الخروج إلى خيبر فأتيت رسول الله صلى الله عليه وسلم فسلمت عليه وقلت له إني أردت الخروج إلى خيبر ‏.‏ فقال ‏\"‏ إذا أتيت وكيلي فخذ منه خمسة عشر وسقا فإن ابتغى منك آية فضع يدك على ترقوته ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     I intended to go (on expedition) to Khaybar. So I came to the Holy Prophet (ﷺ), greeted him and said: I am intending to go to Khaybar. He said: When you come to my agent, you should take from him fifteen wasqs (of dates). If he asks you for a sign, then place your hand on his collar-bone.",
      "usc_msa_ref": "",
      "chain": [
        "30258",
        "20385",
        "11107",
        "20348",
        "11231",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-1535",
      "hadith_no": "1535",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "18",
      "text_ar": "أخبرنا عبيد الله بن سعد بن إبراهيم، قال حدثنا عمي، قال حدثنا أبي، عن ابن إسحاق، قال حدثني داود بن الحصين، عن عكرمة، عن ابن عباس، قال ما كانت صلاة الخوف إلا سجدتين كصلاة أحراسكم هؤلاء اليوم خلف أئمتكم هؤلاء إلا أنها كانت عقبا قامت طائفة منهم وهم جميعا مع رسول الله صلى الله عليه وسلم وسجدت معه طائفة منهم ثم قام رسول الله صلى الله عليه وسلم وقاموا معه جميعا ثم ركع وركعوا معه جميعا ثم سجد فسجد معه الذين كانوا قياما أول مرة فلما جلس رسول الله صلى الله عليه وسلم والذين سجدوا معه في آخر صلاتهم سجد الذين كانوا قياما لأنفسهم ثم جلسوا فجمعهم رسول الله صلى الله عليه وسلم بالتسليم ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The fear prayer was no more than two prostrations like the prayer of these guards of yours today behind the Imams of yours, except that it was one group after another. One group stood, although they were all behind the Messenger of Allah (ﷺ), and one group prostrated with him, then the Messenger of Allah (ﷺ) stood up and they all stood with him. Then he bowed and they all bowed with him, then he prostrated and those who had been standing the first time prostrated with him. When the Messenger of Allah (ﷺ) and those who had prostrated with him at the end of their prayer sat, those who had been standing prostrated by themselves, then they sat and the Messenger of Allah (ﷺ) said the taslim with all of them.",
      "usc_msa_ref": "",
      "chain": [
        "30258",
        "20385",
        "11107",
        "11160",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-2099",
      "hadith_no": "2099",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عبيد الله بن سعد بن إبراهيم، قال حدثنا عمي، قال حدثنا أبي، عن صالح، عن ابن شهاب، قال أخبرني نافع بن أنس، أن أباه، حدثه أنه، سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا دخل رمضان فتحت أبواب الجنة وغلقت أبواب جهنم وسلسلت الشياطين ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said;'The Messenger of Allah said:                      'When Ramadan begins, the gates of Paradise are opened, the gates of Hell are closed, and the devils are chained up.\"",
      "usc_msa_ref": "",
      "chain": [
        "30258",
        "20385",
        "11176",
        "11013",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2102",
      "hadith_no": "2102",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عبيد الله بن سعد، قال حدثنا عمي، قال حدثنا أبي، عن ابن إسحاق، عن الزهري، عن ابن أبي أنس، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا دخل شهر رمضان فتحت أبواب الجنة وغلقت أبواب النار وسلسلت الشياطين ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذا - يعني حديث ابن إسحاق - خطأ ولم يسمعه ابن إسحاق من الزهري والصواب ما تقدم ذكرنا له ‏.‏",
      "text_en": " It was narrated form Abu Hurairah that the Prophet said:                     \"When the month of Ramadan beings, the gates of Paradise are opened. The gates of the Fire are closed and the devils are chained up.\" (Sahih)Abu 'Abdur-Rahman (An-Nasai) said: This meaning, the narration of Ibn Ishaq - is a mistake. Ibn Ishaq did not hear from Az-Zuhri. What is correct is what we mentioned it previously.",
      "usc_msa_ref": "",
      "chain": [
        "30258",
        "20385",
        "11107",
        "11013",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2103",
      "hadith_no": "2103",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عبيد الله بن سعد، قال حدثنا عمي، قال حدثنا أبي، عن ابن إسحاق، قال وذكر محمد بن مسلم عن أويس بن أبي أويس، عديد بني تيم عن أنس بن مالك، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ هذا رمضان قد جاءكم تفتح فيه أبواب الجنة وتغلق فيه أبواب النار وتسلسل فيه الشياطين ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذا الحديث خطأ ‏.‏",
      "text_en": " It was narrated form Anas bin Malik that the Messenger of Allah said:                     \" There has come to you Ramadan in which the gates of Paradise are opened, the gates of the fire are closed and the devils are chained up.\" (Sahih)Abu 'Abdur-Rahman said: this narration is a mistake.",
      "usc_msa_ref": "",
      "chain": [
        "30258",
        "20385",
        "11107",
        "167",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-2132",
      "hadith_no": "2132",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عبيد الله بن سعد بن إبراهيم، قال حدثنا عمي، قال حدثني أبي، عن صالح، عن ابن شهاب، أن عبيد الله بن عبد الله بن أبي ثور، حدثه ح، وأخبرنا عمرو بن منصور، قال حدثنا الحكم بن نافع، قال أنبأنا شعيب، عن الزهري، قال أخبرني عبيد الله بن عبد الله بن أبي ثور، عن ابن عباس، قال لم أزل حريصا أن أسأل عمر بن الخطاب عن المرأتين من أزواج رسول الله صلى الله عليه وسلم اللتين قال الله لهما ‏{‏ إن تتوبا إلى الله فقد صغت قلوبكما ‏}‏ وساق الحديث وقال فيه فاعتزل رسول الله صلى الله عليه وسلم نساءه من أجل ذلك الحديث حين أفشته حفصة إلى عائشة تسعا وعشرين ليلة ‏.‏ قالت عائشة وكان قال ‏\"‏ ما أنا بداخل عليهن شهرا ‏\"‏ ‏.‏ من شدة موجدته عليهن حين حدثه الله عز وجل حديثهن فلما مضت تسع وعشرون ليلة دخل على عائشة فبدأ بها فقالت له عائشة إنك قد كنت آليت يا رسول الله أن لا تدخل علينا شهرا وإنا أصبحنا من تسع وعشرين ليلة نعدها عددا فقال رسول الله صلى الله عليه وسلم ‏\"‏ الشهر تسع وعشرون ليلة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"I was very keen to ask 'Umar bin Al-Khattab about the two wives of the Messenger of Allah to whom Allah said: If you two turn in repentance to Allah, (it will be better for you), your hearts are indeed so inclined.\" And he quoted the Hadith. He said concerning it:' \"The from his wives for twenty-nine days because of that, when Hafsah had made her disclosure to Aishah. He had said: 'I will not enter upon them for a month,' because he was so upset with them when Allah, the Mighty and Sublime, informed him of what they had said. When twenty-nine days had passed, he entered upon 'Aishah, so he started with her. Aishah, said to him: 'O Messenger of Allah, you swore not to enter upon us for a month, and now twenty-nine days have passed; we have been counting them.' The Messenger of Allah said; 'The month is twenty-nine days.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30258",
        "20385",
        "11176",
        "11013",
        "11200",
        "38433",
        "30330",
        "20428",
        "11013",
        "11200",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-2301",
      "hadith_no": "2301",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عبيد الله بن سعد بن إبراهيم، قال حدثنا عمي، قال حدثنا أبي، عن ابن إسحاق، عن عمران بن أبي أنس، عن حنظلة بن علي، عن حمزة، قال قلت يا نبي الله إني رجل أسرد الصيام أفأصوم في السفر قال ‏\"‏ إن شئت فصم وإن شئت فأفطر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hamzah said:                     \"I said: 'O Prophet of Allah, I am a man who fasts continually, so should I fast while traveling?' He said: 'If you wish then fast, and if you wish then do not fast.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30258",
        "20385",
        "11107",
        "10605"
      ]
    },
    {
      "id": "sunan-an-nasai-2302",
      "hadith_no": "2302",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عبيد الله بن سعد، قال حدثنا عمي، قال حدثنا أبي، عن ابن إسحاق، قال حدثني عمران بن أبي أنس، أن سليمان بن يسار، حدثه أن أبا مراوح حدثه أن حمزة بن عمرو حدثه أنه، سأل رسول الله صلى الله عليه وسلم وكان رجلا يصوم في السفر فقال ‏\"‏ إن شئت فصم وإن شئت فأفطر ‏\"‏ ‏.‏",
      "text_en": " Hamzah bin 'Amr narrated that he asked the Messenger of Allah, and he wsa a man who used to fast while traveling. He said:                     \"If you wish then fast, and if you wish then fast, and if you wish then do not fast.\"",
      "usc_msa_ref": "",
      "chain": [
        "30258",
        "20385",
        "11107",
        "10605",
        "11005",
        "11551",
        "4123"
      ]
    },
    {
      "id": "sunan-an-nasai-2354",
      "hadith_no": "2354",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا عبيد الله بن سعد بن إبراهيم، قال حدثنا عمي، قال حدثنا أبي، عن ابن إسحاق، قال حدثني محمد بن إبراهيم، عن أبي سلمة، عن عائشة، قالت لم يكن رسول الله صلى الله عليه وسلم لشهر أكثر صياما منه لشعبان كان يصومه أو عامته ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"The Messenger of Allah did not fast any month more than Shaban; he used to fast (all of) it, or most of it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30258",
        "20385",
        "11107",
        "11213",
        "10567",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-3135",
      "hadith_no": "3135",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عبيد الله بن سعد بن إبراهيم، قال حدثنا عمي، قال حدثنا أبي، عن صالح، عن ابن شهاب، أن حميد بن عبد الرحمن، أخبره أن أبا هريرة كان يحدث أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أنفق زوجين في سبيل الله نودي في الجنة يا عبد الله هذا خير فمن كان من أهل الصلاة دعي من باب الصلاة ومن كان من أهل الجهاد دعي من باب الجهاد ومن كان من أهل الصدقة دعي من باب الصدقة ومن كان من أهل الصيام دعي من باب الريان ‏\"‏ ‏.‏ فقال أبو",
      "text_en": " Abu Hurairah used to narrate that the Messenger of Allah (ﷺ) said:                      \"Whoever spends on a pair (of things) in the cause of Allah, he will be called in Paradise: 'O slave of Allah, here is prosperity.' Whoever is one of those who pray, he will be called from the gate of Paradise. Whoever is one of those who participated in Jihad, he will be called from the gate of Paradise. Whoever is one of those who fast, he will be called from the gate of Ar-Rayyan.\" Abu Bakr As-Siddiq said: \"O Messenger of Allah! No distress, or need will befall the one who is called from those gates. Will there be anyone who will be called from all these gates? The Messenger of Allah (ﷺ) said: \"Yes, and I hope that you will be one of them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30258",
        "20385",
        "11176",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3894",
      "hadith_no": "3894",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عبيد الله بن سعد بن إبراهيم، قال حدثني عمي، قال حدثنا أبي، عن محمد بن عكرمة، عن محمد بن عبد الرحمن بن لبيبة، عن سعيد بن المسيب، عن سعد بن أبي وقاص، قال كان أصحاب المزارع يكرون في زمان رسول الله صلى الله عليه وسلم مزارعهم بما يكون على الساقي من الزرع فجاءوا رسول الله صلى الله عليه وسلم فاختصموا في بعض ذلك فنهاهم رسول الله صلى الله عليه وسلم أن يكروا بذلك وقال ‏‏\"‏‏ أكروا بالذهب والفضة ‏‏\"‏‏‏.‏‏ وقد روى هذا الحديث سليمان عن رافع فقال عن رجل من عمومته‏.‏‏",
      "text_en": " It was narrated that Sa'd bin Abi Waqqas said:                      \"At the time of the Messenger of Allah landowners used to lease their arable land in return for whatever grew on the banks of the streams for irrigation. They came to the Messenger of Allah and referred a dispute concerning such matters to him, and the Messenger of Allah forbade them to lease land on such terms, and said: 'Lease it for gold or silver.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30258",
        "20385",
        "13112",
        "11002",
        "9"
      ]
    },
    {
      "id": "sunan-an-nasai-4733",
      "hadith_no": "4733",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا عبيد الله بن سعد، قال حدثنا عمي، قال حدثنا أبي، عن ابن إسحاق، أخبرني داود بن الحصين، عن عكرمة، عن ابن عباس، أن الآيات التي، في المائدة التي قالها الله عز وجل ‏{‏ فاحكم بينهم أو أعرض عنهم ‏}‏ إلى ‏{‏ المقسطين ‏}‏ إنما نزلت في الدية بين النضير وبين قريظة وذلك أن قتلى النضير كان لهم شرف يودون الدية كاملة وأن بني قريظة كانوا يودون نصف الدية فتحاكموا في ذلك إلى رسول الله صلى الله عليه وسلم فأنزل الله عز وجل ذلك فيهم فحملهم رسول الله صلى الله عليه وسلم على الحق في ذلك فجعل الدية سواء ‏.‏",
      "text_en": " It was narrated from Dawud hin Al-Husain, from 'Ikrimah, from Ibn 'Abbas, that the Verses in AL-Ma'idah, in which Allah, the Mighty and Sublime, says:                     \"Either judge between them, or turn away from them. If you turn away from then up to: those who act justly.\"[1] - were revealed concerning the matter of blood money between An-Nadir and Quraizah. That was because the slain of An-Nadir were of noble status, so the blood money would be paid in full for them, but for Banu Quraizah only half of the blood money would be paid. They referred the matter to the Messenger of Allah for judgment, then Allah, the Mighty and Sublime, revealed that concerning them, so the Messenger of Allah told them to do the right thing and he made the blood money equal.",
      "usc_msa_ref": "",
      "chain": [
        "30258",
        "20385",
        "11107",
        "11160",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-5069",
      "hadith_no": "5069",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عبيد الله بن سعد بن إبراهيم، قال حدثنا عمي، قال حدثنا أبي، عن صالح، عن ابن شهاب، قال قال أبو سلمة إن أبا هريرة قال إن رسول الله صلى الله عليه وسلم ح وأخبرنا يونس بن عبد الأعلى قال أنبأنا ابن وهب قال أخبرني يونس عن ابن شهاب عن أبي سلمة بن عبد الرحمن أخبره عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اليهود والنصارى لا تصبغ فخالفوهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Messenger of Allah [SAW] said: \"The Jews and Christians do not dye their hair, so be different from them.\"",
      "usc_msa_ref": "",
      "chain": [
        "30258",
        "20385",
        "11176",
        "11013",
        "10567",
        "13"
      ]
    }
  ],
  "total_hadiths": 16
}