{
  "id": "20386",
  "name": "'Ali bin al-J'ad al-Jauhri علي بن الجعد بن عبيد الجوهري",
  "full_name": "'Ali bin al-J'ad al-Jauhri علي بن الجعد بن عبيد الجوهري",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "230",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  د  -  ثقة ثبت ]"
    ],
    "tags": [
      "Ally B.Hahim",
      "Client",
      "al-Baghdadi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11684",
      "name": "Huraiz bin 'Uthman bin Jabir حريز بن عثمان بن جبر الرحبي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10828",
      "name": "Ma'raf bin Wasal معرف بن واصل",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20240",
      "name": "Shayban bin 'Abdur Rahman شيبان بن عبد الرحمن النحوي أبو معاوية",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20429",
      "name": "Skhr bin Jwyryh Abu صخر بن جويرية أبو نافع مولى بني",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20731",
      "name": "'Abdur Rahman bin Thabit عبد الرحمن بن ثابت بن ثوبان العنسي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20724",
      "name": "'Abdur Rahman bin 'Abdullah bin 'Utba عبد الرحمن بن عبد الله بن عتبة المسعودي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "25246",
      "name": "Qays bin al-Rabi' al-'Asady Abu قيس بن الربيع الأسدي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20363",
      "name": "Wrqa'a bin 'Umar ورقاء بن عمر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20303",
      "name": "Yazid bin Ibrahim al-Tstry يزيد بن إبراهيم التستري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20405",
      "name": "Ibrahim bin Muhammad bin al-Harith إبراهيم بن محمد أبو اسحاق الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20719",
      "name": "Muhammad bin Rashid al-Mkhwly محمد بن راشد المكحولي الخزاعي الدمشقي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30002",
      "name": "Abu Da'ud أبو داود السجستاني الأزدي",
      "grade": "3rd Century AH [11th generation] [Hanafi]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "34140",
      "name": "'Abdul Malik bin Muhammad bin 'Abdullah عبد الملك بن محمد أبو قلابة الرقاشي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30249",
      "name": "Ziyad bin Ayoub - Dulwiyya زياد بن أيوب بن زياد دلويه",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38207",
      "name": "Khalaf bin Salm al-Makharrami خلف بن سالم المخرمي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30245",
      "name": "al-Hasan bin Muhammad al-Za'farani الحسن بن محمد الصباح الزعفراني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36523",
      "name": "Ishaq bin Abi Isra'il Kamjar إسحاق بن أبي إسرائيل كامجر",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30218",
      "name": "Musa bin Harun bin Bashyr موسى بن هارون بن بشير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30013",
      "name": "Ibn Abi Dunya ابن أبي الدنيا",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "38042",
      "name": "Ahmed bin 'Ali bin Sa'id أحمد بن علي بن سعيد",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "53",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا علي بن الجعد، قال أخبرنا شعبة، عن أبي جمرة، قال كنت أقعد مع ابن عباس، يجلسني على سريره فقال أقم عندي حتى أجعل لك سهما من مالي، فأقمت معه شهرين، ثم قال إن وفد عبد القيس لما أتوا النبي صلى الله عليه وسلم قال ‏\"‏ من القوم أو من الوفد ‏\"‏‏.‏ قالوا ربيعة‏.‏ قال ‏\"‏ مرحبا بالقوم  أو بالوفد  غير خزايا ولا ندامى ‏\"‏‏.‏ فقالوا يا رسول الله، إنا لا نستطيع أن نأتيك إلا في شهر الحرام، وبيننا وبينك هذا الحى من كفار مضر، فمرنا بأمر فصل، نخبر به من وراءنا، وندخل به الجنة‏.‏ وسألوه عن الأشربة‏.‏ فأمرهم بأربع، ونهاهم عن أربع، أمرهم بالإيمان بالله وحده‏.‏ قال ‏\"‏ أتدرون ما الإيمان بالله وحده ‏\"‏‏.‏ قالوا الله ورسوله أعلم‏.‏ قال ‏\"‏ شهادة أن لا إله إلا الله وأن محمدا رسول الله، وإقام الصلاة، وإيتاء الزكاة، وصيام رمضان، وأن تعطوا من المغنم الخمس ‏\"‏‏.‏ ونهاهم عن أربع عن الحنتم والدباء والنقير والمزفت‏.‏ وربما قال المقير‏.‏ وقال ‏\"‏ احفظوهن وأخبروا بهن من وراءكم ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Jamra:                          I used to sit with Ibn 'Abbas and he made me sit on his sitting place.     He requested me to stay with him in order that he might give me a      share from his property. So I stayed with him for two months. Once he      told (me) that when the delegation of the tribe of 'Abdul Qais came to     the Prophet, the Prophet asked them, \"Who are the people (i.e. you)?      (Or) who are the delegate?\" They replied, \"We are from the tribe of      Rabi'a.\" Then the Prophet said to them, \"Welcome! O people (or O      delegation of 'Abdul Qais)! Neither will you have disgrace nor will      you regret.\" They said, \"O Allah's Apostle! We cannot come to you      except in the sacred month and there is the infidel tribe of Mudar      intervening between you and us. So please order us to do something      good (religious deeds) so that we may inform our people whom we have      left behind (at home), and that we may enter Paradise (by acting on      them).\" Then they asked about drinks (what is legal and what is      illegal). The Prophet ordered them to do four things and forbade them      from four things. He ordered them to believe in Allah Alone and asked      them, \"Do you know what is meant by believing in Allah Alone?\" They      replied, \"Allah and His Apostle know better.\" Thereupon the Prophet      said, \"It means:     1. To testify that none has the right to be worshipped but Allah and      Muhammad is Allah's Apostle.      2. To offer prayers perfectly     3. To pay the Zakat (obligatory charity)      4. To observe fast during the month of Ramadan.     5. And to pay Al-Khumus (one fifth of the booty to be given in Allah's     Cause).     Then he forbade them four things, namely, Hantam, Dubba,' Naqir Ann      Muzaffat or Muqaiyar; (These were the names of pots in which Alcoholic     drinks were prepared) (The Prophet mentioned the container of wine and     he meant the wine itself). The Prophet further said (to them):      \"Memorize them (these instructions) and convey them to the people whom     you have left behind.\"",
      "chain": [
        "20386",
        "20020",
        "11309",
        "17"
      ]
    },
    {
      "hadith_no": "106",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا علي بن الجعد، قال أخبرنا شعبة، قال أخبرني منصور، قال سمعت ربعي بن حراش، يقول سمعت عليا، يقول قال النبي صلى الله عليه وسلم ‏\"‏ لا تكذبوا على، فإنه من كذب على فليلج النار ‏\"‏‏.‏",
      "text_en": " Narrated `Ali:                     The Prophet said, \"Do not tell a lie against me for whoever tells a lie against me (intentionally) then he will surely enter the Hell-fire.\"",
      "chain": [
        "20386",
        "20020",
        "11067",
        "11334",
        "5"
      ]
    },
    {
      "hadith_no": "1179",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا علي بن الجعد، أخبرنا شعبة، عن أنس بن سيرين، قال سمعت أنس بن مالك الأنصاري، قال قال رجل من الأنصار  وكان ضخما  للنبي صلى الله عليه وسلم إني لا أستطيع الصلاة معك‏.‏ فصنع للنبي صلى الله عليه وسلم طعاما، فدعاه إلى بيته، ونضح له طرف حصير بماء فصلى عليه ركعتين‏.‏ وقال فلان بن فلان بن جارود لأنس  رضى الله عنه  أكان النبي صلى الله عليه وسلم يصلي الضحى فقال ما رأيته صلى غير ذلك اليوم‏.‏",
      "text_en": "      Narrated Anas bin Sirin:                          I heard Anas bin Malik al-Ansari saying, \"An Ansari man, who was very      fat, said to the Prophet, 'I am unable to present myself for the      prayer with you.' He prepared a meal for the Prophet and invited him      to his house. He washed one side of a mat with water and the Prophet      offered two Rakat on it.\" So and so, the son of so and so, the son of      Al-Jarud asked Anas, \"Did the Prophet use to offer the Duha prayer?\"      Anas replied, \"I never saw him praying (the Duha prayer) except on      that day.\"",
      "chain": [
        "20386",
        "20020",
        "11038",
        "19"
      ]
    },
    {
      "hadith_no": "1445",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا علي بن الجعد، أخبرنا شعبة، قال أخبرني معبد بن خالد، قال سمعت حارثة بن وهب الخزاعي  رضى الله عنه  يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ تصدقوا، فسيأتي عليكم زمان يمشي الرجل بصدقته فيقول الرجل لو جئت بها بالأمس لقبلتها منك، فأما اليوم فلا حاجة لي فيها ‏\"‏‏.‏",
      "text_en": " Narrated Haritha bin Wahab Al-Khuza`i:                     I heard the Prophet (p.b.u.h) saying, \"(O people!) Give in charity (for Allah's cause) because a time will come when a person will carry his object of charity from place to place (and he will not find any person to take it) and any person whom he shall request to take it, I will reply, 'If you had brought it yesterday I would have taken it, but today I am not in need of it.\"",
      "chain": [
        "20386",
        "20020",
        "11396",
        "4109"
      ]
    },
    {
      "hadith_no": "2938",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا علي بن الجعد، أخبرنا شعبة، عن قتادة، قال سمعت أنسا  رضى الله عنه  يقول لما أراد النبي صلى الله عليه وسلم أن يكتب إلى الروم، قيل له إنهم لا يقرءون كتابا إلا أن يكون مختوما‏.‏ فاتخذ خاتما من فضة، فكأني أنظر إلى بياضه في يده، ونقش فيه محمد رسول الله‏.‏",
      "text_en": " Narrated Anas:                     When the Prophet intended to write a letter to the ruler of the Byzantines, he was told that those people did not read any letter unless it was stamped with a seal. So, the Prophet got a silver ring-- as if I were just looking at its white glitter on his hand ---- and stamped on it the expression \"Muhammad, Apostle of Allah\".",
      "chain": [
        "20386",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "3604",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني علي بن الجعد، أخبرنا شعبة، عن الأعمش، عن أبي حازم، عن أبي هريرة  رضى الله عنه  قال ما عاب النبي صلى الله عليه وسلم طعاما قط، إن اشتهاه أكله، وإلا تركه‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet never criticized any food (presented him), but he would eat it if he liked it; otherwise, he would leave it (without expressing his dislike).",
      "chain": [
        "20386",
        "20020",
        "11060",
        "11349",
        "13"
      ]
    },
    {
      "hadith_no": "3754",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا علي بن الجعد، أخبرنا شعبة، عن أيوب، عن ابن سيرين، عن عبيدة، عن علي  رضى الله عنه  قال اقضوا كما كنتم تقضون، فإني أكره الاختلاف حتى يكون للناس جماعة، أو أموت كما مات أصحابي‏.‏ فكان ابن سيرين يرى أن عامة ما يروى على علي الكذب‏.‏",
      "text_en": "  Narrated Ubaida:                       Ali said (to the people of 'Iraq), \"Judge as you used to judge, for I hate differences (and I do my best ) till the people unite as one group, or I die as my companions have died.\"",
      "chain": [
        "20386",
        "20020",
        "11015",
        "11035",
        "11370",
        "5"
      ]
    },
    {
      "hadith_no": "5402",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا علي بن الجعد، أخبرنا شعبة، عن محمد بن جحادة، عن أبي حازم، عن أبي هريرة، نهى النبي صلى الله عليه وسلم عن كسب الإماء‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet forbade taking the earnings of a slave girl by prostitution.",
      "chain": [
        "20386",
        "20020",
        "18897",
        "11349"
      ]
    },
    {
      "hadith_no": "5894",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا علي بن الجعد، أخبرنا شعبة، عن أبي ذبيان، خليفة بن كعب قال سمعت ابن الزبير، يقول سمعت عمر، يقول قال النبي صلى الله عليه وسلم ‏\"‏ من لبس الحرير في الدنيا لم يلبسه في الآخرة ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Az-Zubair:                     I heard `Umar saying, \"The Prophet said, 'Whoever wears silk in this world, shall not wear it in the Hereafter.\"",
      "chain": [
        "20386",
        "20020",
        "11584",
        "106",
        "3"
      ]
    },
    {
      "hadith_no": "6187",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا علي بن الجعد، أخبرنا شعبة، عن قتادة، عن مولى، أنس  قال أبو عبد الله اسمه عبد الله بن أبي عتبة  سمعت أبا سعيد، يقول كان النبي صلى الله عليه وسلم أشد حياء من العذراء في خدرها‏.‏",
      "text_en": " Narrated Abu Sa`id:                     The Prophet was more shy (from Haya': pious shyness from committing religeous indiscretions) than a veiled virgin girl. (See Hadith No. 762, Vol. 4)",
      "chain": [
        "20386",
        "20020",
        "11019",
        "30184",
        "38"
      ]
    },
    {
      "hadith_no": "6320",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا علي بن الجعد، أخبرنا شعبة، عن سيار، عن ثابت البناني، عن أنس بن مالك  رضى الله عنه أنه مر على صبيان فسلم عليهم وقال كان النبي صلى الله عليه وسلم يفعله‏.‏",
      "text_en": " Narrated Anas bin Malik:                     that he passed by a group of boys and greeted them and said, \"The Prophet used to do so.\"",
      "chain": [
        "20386",
        "20020",
        "11429",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "6595",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا علي بن الجعد، أخبرنا شعبة، عن الأعمش، عن مجاهد، عن عائشة، قالت قال النبي صلى الله عليه وسلم ‏\"‏ لا تسبوا الأموات، فإنهم قد أفضوا إلى ما قدموا ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet said, \"Do not abuse the dead, for they have reached the result of what they have done.\"",
      "chain": [
        "20386",
        "20020",
        "11060",
        "11028",
        "53"
      ]
    },
    {
      "hadith_no": "7352",
      "source": " Sahih Bukhari ",
      "chapter": "Accepting Information Given by a Truthful Person - كتاب أخبار الآحاد",
      "chapter_no": "96",
      "text_ar": "حدثنا علي بن الجعد، أخبرنا شعبة،‏.‏ وحدثني إسحاق، أخبرنا النضر، أخبرنا شعبة، عن أبي جمرة، قال كان ابن عباس يقعدني على سريره فقال إن وفد عبد القيس لما أتوا رسول الله صلى الله عليه وسلم قال ‏\"‏ من الوفد ‏\"‏‏.‏ قالوا ربيعة‏.‏ قال ‏\"‏ مرحبا بالوفد والقوم، غير خزايا ولا ندامى ‏\"‏‏.‏ قالوا يا رسول الله إن بيننا وبينك كفار مضر، فمرنا بأمر ندخل به الجنة، ونخبر به من وراءنا فسألوا عن الأشربة، فنهاهم عن أربع وأمرهم بأربع أمرهم بالإيمان بالله قال ‏\"‏ هل تدرون ما الإيمان بالله ‏\"‏‏.‏ قالوا الله ورسوله أعلم‏.‏ قال ‏\"‏ شهادة أن لا إله إلا الله وحده لا شريك له وأن محمدا رسول الله، وإقام الصلاة، وإيتاء الزكاة  وأظن فيه  صيام رمضان، وتؤتوا من المغانم الخمس ‏\"‏‏.‏ ونهاهم عن الدباء، والحنتم، والمزفت، والنقير، وربما قال المقير‏.‏ قال ‏\"‏ احفظوهن، وأبلغوهن من وراءكم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     When the delegate of `Abd Al-Qais came to Allah's Apostle, he said, \"Who are the delegate?\" They said, \"The delegate are from the tribe of Rabi`a.\" The Prophet said, \"Welcome, O the delegate, and welcome! O people! Neither you will have any disgrace nor will you regret.\" They said, \"O Allah's Apostle! Between you and us there are the infidels of the tribe of Mudar, so please order us to do something good (religious deeds) that by acting on them we may enter Paradise, and that we may inform (our people) whom we have left behind, about it.\" They also asked (the Prophet) about drinks. He forbade them from four things and ordered them to do four things. He ordered them to believe in Allah, and asked them, \"Do you know what is meant by belief in Allah?\" They said, \"Allah and His Apostle know best.\" He said, ''To testify that none has the right to be worshipped except Allah, the One, Who has no partners with Him, and that Muhammad is Allah's Apostle; and to offer prayers perfectly and to pay Zakat.\" (the narrator thinks that fasting in Ramadan is included), \"and to give one-fifth of the war booty (to the state).\" Then he forbade four (drinking utensils): Ad-Duba', Al56 Hantam, Al-Mazaffat and An-Naqir, or probably, Al-Muqaiyar. And then the Prophet said, \"Remember all these things by heart and preach it to those whom you have left behind.\"",
      "chain": [
        "20386",
        "30312",
        "20291",
        "20020",
        "11309"
      ]
    },
    {
      "hadith_no": "874",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو الوليد الطيالسي، وعلي بن الجعد، قالا حدثنا شعبة، عن عمرو بن مرة، عن أبي حمزة، مولى الأنصار عن رجل، من بني عبس عن حذيفة، أنه رأى رسول الله صلى الله عليه وسلم يصلي من الليل فكان يقول ‏\"‏ الله أكبر - ثلاثا - ذو الملكوت والجبروت والكبرياء والعظمة ‏\"‏ ‏.‏ ثم استفتح فقرأ البقرة ثم ركع فكان ركوعه نحوا من قيامه وكان يقول في ركوعه ‏\"‏ سبحان ربي العظيم سبحان ربي العظيم ‏\"‏ ‏.‏ ثم رفع رأسه من الركوع فكان قيامه نحوا من ركوعه يقول ‏\"‏ لربي الحمد ‏\"‏ ‏.‏ ثم سجد فكان سجوده نحوا من قيامه فكان يقول في سجوده ‏\"‏ سبحان ربي الأعلى ‏\"‏ ‏.‏ ثم رفع رأسه من السجود وكان يقعد فيما بين السجدتين نحوا من سجوده وكان يقول ‏\"‏ رب اغفر لي رب اغفر لي ‏\"‏ ‏.‏ فصلى أربع ركعات فقرأ فيهن البقرة وآل عمران والنساء والمائدة أو الأنعام شك شعبة ‏.‏",
      "text_en": " Narrated Hudhayfah:                     Hudhayfah saw the Messenger of Allah (ﷺ) praying at night. He said: Allah is most great\" three times, \"Possessor of kingdom, grandeur, greatness and majesty.\" He then began (his prayer) and recited Surah al-Baqarah; then he bowed and he paused in bowing as long as he stood up; he said while bowing, \"Glory be to my mighty Lord,\" \"Glory be to my mighty Lord\" ; then he raised his head, after bowing: then he stood up and he paused as long as he paused in bowing and said, \"Praise be to my Lord\" ; then he prostrated and paused in prostration as long as he paused in the standing position; he said while prostrating: \"Glory be to my most high Lord\"; then he raised his head after prostration, and sat as long as he prostrated, and said while sitting: \"O my Lord forgive me.\" He offered four rak'ahs of prayer and recited in them Surah al-Baqarah, Aal Imran, an-Nisa, al-Ma'idah, or al-An'am. The narrator Shu'bah doubted.",
      "chain": [
        "20296",
        "20386",
        "20020",
        "11381",
        "11633",
        "145"
      ]
    },
    {
      "hadith_no": "3477",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا علي بن الجعد اللؤلؤي، أخبرنا حريز بن عثمان، عن حبان بن زيد الشرعبي، عن رجل، من قرن ح وحدثنا مسدد، حدثنا عيسى بن يونس، حدثنا حريز بن عثمان، حدثنا أبو خداش، - وهذا لفظ علي - عن رجل، من المهاجرين من أصحاب النبي صلى الله عليه وسلم قال غزوت مع النبي صلى الله عليه وسلم ثلاثا أسمعه يقول ‏\"‏ المسلمون شركاء في ثلاث في الكلإ والماء والنار ‏\"‏ ‏.‏",
      "text_en": " Narrated A man:                     A man from the immigrants of the Companions of the Prophet (ﷺ) said: I participated in battle three times along with the Prophet (ﷺ). I heard him say: Muslims have common share in three (things). grass, water and fire.",
      "chain": [
        "20386",
        "11684",
        "4111",
        "30175",
        "20347",
        "11684"
      ]
    },
    {
      "hadith_no": "4515",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا علي بن الجعد، حدثنا شعبة، ح وحدثنا موسى بن إسماعيل، حدثنا حماد، عن قتادة، عن الحسن، عن سمرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ من قتل عبده قتلناه ومن جدع عبده جدعناه ‏\"‏ ‏.‏",
      "text_en": " Narrated Samurah:                     The Prophet (ﷺ) Said: If anyone kills his slave, we shall kill him, and if anyone cuts off the nose of his slave, we shall cut off his nose.",
      "chain": [
        "20386",
        "20020",
        "20040",
        "20022",
        "11019",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "23",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "قال أبو الحسن حدثنا يحيى بن عبد الله الكرابيسي، حدثنا علي بن الجعد، عن شعبة، عن عمرو بن مرة، مثل حديث علي رضى الله تعالى عنه ‏.‏",
      "text_en": "",
      "chain": [
        "20386",
        "20020",
        "11381"
      ]
    }
  ],
  "total_hadiths": 17
}