{
  "id": "20381",
  "name": "Hajjaj bin Muhammad al-Musaysi حجاج بن محمد المصيصي الأعور",
  "full_name": "Hajjaj bin Muhammad al-Musaysi حجاج بن محمد المصيصي الأعور",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "206",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Tirmidh",
      "al-Musaysa",
      "Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "Clinet",
      "al-Musaysi",
      "Baghdad"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11684",
      "name": "Huraiz bin 'Uthman bin Jabir حريز بن عثمان بن جبر الرحبي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10846",
      "name": "Yonus bin Abi Ishaq يونس بن أبي إسحاق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20583",
      "name": "Hamza bin Habib al-Zayat حمزة بن حبيب الزيات",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30399",
      "name": "Yahya bin Yahya bin Bukayr يحيى بن يحيى بن بكير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36618",
      "name": "al-Qasim bin Salam القاسم بن سلام",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30315",
      "name": "Isma'il bin Ibrahim,Abu Ma'mar al-Hadhli إسماعيل بن إبراهيم بن معمر أبو معمر",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "19231",
      "name": "Abu Ja'far أبو جعفر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30272",
      "name": "Muhammad bin 'Abdul Rahim bin Abi Zuhayr محمد بن عبد الرحيم بن أبي زهير البزاز",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30273",
      "name": "Muhammad bin 'Ubaidullah محمد بن عبيد الله بن يزيد البغدادي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30585",
      "name": "'Abbas bin Muhammad bin Hatm عباس بن محمد بن حاتم",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1456",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، وحدثني محمد بن عبد الرحيم، عن حجاج بن محمد، عن ابن جريج، قال أخبرني ابن أبي مليكة، عن عباد بن عبد الله بن الزبير، أخبره عن أسماء بنت أبي بكر  رضى الله عنهما  أنها جاءت إلى النبي صلى الله عليه وسلم فقال ‏\"‏ لا توعي فيوعي الله عليك، ارضخي ما استطعت ‏\"‏‏.‏",
      "text_en": " Narrated Asma' bint Abu Bakr:                     that she had gone to the Prophet and he said, \"Do not shut your money bag; otherwise Allah too will withhold His blessings from you. Spend (in Allah's Cause) as much as you can afford. \"",
      "chain": [
        "20241",
        "11070",
        "30272",
        "20381",
        "11070",
        "11090",
        "11250",
        "70"
      ]
    },
    {
      "hadith_no": "1594",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حجاج بن محمد الأعور، عن شعبة، عن عمرو بن مرة، عن سعيد بن المسيب، قال اختلف علي وعثمان  رضى الله عنهما  وهما بعسفان في المتعة، فقال علي ما تريد إلا أن تنهى عن أمر فعله النبي صلى الله عليه وسلم‏.‏ فلما رأى ذلك علي أهل بهما جميعا‏.‏",
      "text_en": " Narrated Sa`id bin Al-Musaiyab:                     `Ali and `Uthman differed regarding Hajj-at-Tamattu` while they were at 'Usfan (a familiar place near Mecca). `Ali said, \"I see you want to forbid people to do a thing that the Prophet did?\" When `Ali saw that, he assumed Ihram for both Hajj and `Umra.",
      "chain": [
        "30367",
        "20381",
        "20020",
        "11381",
        "11002"
      ]
    },
    {
      "hadith_no": "1777",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا مسدد، عن عبد الواحد، حدثنا الأعمش، قال سمعت الحجاج، يقول على المنبر السورة التي يذكر فيها البقرة، والسورة التي يذكر فيها آل عمران، والسورة التي يذكر فيها النساء‏.‏ قال فذكرت ذلك لإبراهيم، فقال حدثني عبد الرحمن بن يزيد أنه كان مع ابن مسعود  رضى الله عنه  حين رمى جمرة العقبة، فاستبطن الوادي، حتى إذا حاذى بالشجرة اعترضها، فرمى بسبع حصيات، يكبر مع كل حصاة، ثم قال من ها هنا والذي لا إله غيره قام الذي أنزلت عليه سورة البقرة صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Al-A`mash:                     I heard Al-Hajjaj saying on the pulpit, \"The Sura in which Al-Baqara (the cow) is mentioned and the Sura in which the family of `Imran is mentioned and the Sura in which the women (An-Nisa) is mentioned.\" I mentioned this to Ibrahim, and he said, `Abdur-Rahman bin Yazid told me, 'I was with Ibn Mas`ud, when he did the Rami of the Jamrat-ul-Aqaba. He went down the middle of the valley, and when he came near the tree (which was near the Jamra) he stood opposite to it and threw seven small pebbles and said: 'Allahu-Akbar' on throwing every pebble.' Then he said, 'By Him, except Whom none has the right to be worshipped, here (at this place) stood the one on whom Surat-al-Baqra was revealed (i.e. Allah's Apostle).' \"",
      "chain": [
        "30175",
        "20256",
        "11060",
        "20381",
        "20395"
      ]
    },
    {
      "hadith_no": "3593",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا الحسن بن منصور أبو علي، حدثنا حجاج بن محمد الأعور، بالمصيصة حدثنا شعبة، عن الحكم، قال سمعت أبا جحيفة، قال خرج رسول الله صلى الله عليه وسلم بالهاجرة إلى البطحاء فتوضأ ثم صلى الظهر ركعتين، والعصر ركعتين، وبين يديه عنزة‏.‏ ‏{‏قال شعبة‏}‏ وزاد فيه عون عن أبيه أبي جحيفة قال كان يمر من ورائها المرأة، وقام الناس فجعلوا يأخذون يديه، فيمسحون بها وجوههم، قال فأخذت بيده، فوضعتها على وجهي، فإذا هي أبرد من الثلج، وأطيب رائحة من المسك‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     Once Allah's Apostle went to Al-Batha' at noon, performed the ablution and offered' a two rak`at Zuhr prayer and a two-rak`at `Asr prayer while a spearheaded stick was planted before him and the passersby were passing in front of it. (After the prayer), the people got up and held the hands of the Prophet and passed them on their faces. I also took his hand and kept it on my face and noticed that it was colder than ice, and its smell was nicer than musk.",
      "chain": [
        "20381",
        "20020",
        "11069",
        "4047"
      ]
    },
    {
      "hadith_no": "4611",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا ابن مقاتل، أخبرنا الحجاج، عن ابن جريج، أخبرني ابن أبي مليكة، عن حميد بن عبد الرحمن بن عوف، أنه أخبره أن مروان بهذا‏.‏",
      "text_en": " Narrated Humaid bin `Abdur-Rahman bin `Auf:                     That Marwan had told him (the above narration No. 91).",
      "chain": [
        "30118",
        "20381",
        "11070",
        "11090",
        "10561"
      ]
    },
    {
      "hadith_no": "4627",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا صدقة بن الفضل، أخبرنا حجاج بن محمد، عن ابن جريج، عن يعلى بن مسلم، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  ‏{‏أطيعوا الله وأطيعوا الرسول وأولي الأمر منكم‏}‏‏.‏ قال نزلت في عبد الله بن حذافة بن قيس بن عدي، إذ بعثه النبي صلى الله عليه وسلم في سرية‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Verse: \"Obey Allah and Obey the Apostle and those of you (Muslims) who are in authority.\" (4.59) was revealed in connection with `Abdullah bin Hudhafa bin Qais bin `Adi' when the Prophet appointed him as the commander of a Sariyya (army detachment).",
      "chain": [
        "30343",
        "20381",
        "11070",
        "11568",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "4736",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب،‏.‏ قال وحدثنا الحجاج، حدثنا عبد الله بن عمر النميري، حدثنا يونس بن يزيد الأيلي، قال سمعت الزهري، سمعت عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله، عن حديث، عائشة زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا فبرأها الله، كل حدثني طائفة من الحديث قال النبي صلى الله عليه وسلم ‏\"‏ إن كنت بريئة فسيبرئك الله، وإن كنت ألممت بذنب فاستغفري الله وتوبي إليه ‏\"‏‏.‏ قلت إني والله لا أجد مثلا إلا أبا يوسف ‏{‏فصبر جميل والله المستعان على ما تصفون‏}‏ وأنزل الله ‏{‏إن الذين جاءوا بالإفك‏}‏ العشر الآيات‏.‏",
      "text_en": " Narrated Az-Zuhri:                     `Urwa bin Az-Zubair, Sa`id bin Al-Musaiyab, 'Al-Qama bin Waqqas and 'Ubaidullah bin `Abdullah related the narration of `Aisha, the wife the Prophet, when the slanderers had said about her what they had said and Allah later declared her innocence. Each of them related a part of the narration (wherein) the Prophet said (to `Aisha). \"If you are innocent, then Allah will declare your innocence: but if you have committed a sin, then ask for Allah's Forgiveness and repent to him.\" `Aisha said, \"By Allah, I find no example for my case except that of Joseph's father (when he said), 'So (for me) patience is most fitting.' \" Then Allah revealed the ten Verses:-- \"Verily those who spread the slander are a gang amongst you..\" (24.11)",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "20381",
        "20434",
        "20475",
        "11013",
        "10511",
        "11002",
        "11042",
        "11004"
      ]
    },
    {
      "hadith_no": "6760",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا عبد العزيز، حدثنا إبراهيم، عن صالح، عن ابن شهاب، ح وحدثنا الحجاج، حدثنا عبد الله بن عمر النميري، حدثنا يونس بن يزيد الأيلي، قال سمعت الزهري، قال سمعت عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله بن عتبة، عن حديث، عائشة زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا، فبرأها الله مما قالوا  كل حدثني طائفة من الحديث  فأنزل الله ‏{‏إن الذين جاءوا بالإفك‏}‏ العشر الآيات كلها في براءتي‏.‏ فقال أبو بكر الصديق  وكان ينفق على مسطح لقرابته منه  والله لا أنفق على مسطح شيئا أبدا، بعد الذي قال لعائشة‏.‏ فأنزل الله ‏{‏ولا يأتل أولو الفضل منكم والسعة أن يؤتوا أولي القربى‏}‏ الآية‏.‏ قال أبو بكر بلى والله إني لأحب أن يغفر الله لي‏.‏ فرجع إلى مسطح النفقة التي كان ينفق عليه وقال والله لا أنزعها عنه أبدا‏.‏",
      "text_en": " Narrated Az-Zuhri:                     I heard `Urwa bin Az-Zubair, Sa`id bin Al-Musaiyab, 'Alqama bin Waqqas and 'Ubaidullah bin `Abdullah bin `Uqba relating from `Aisha, the wife of the Prophet the narration of the people (i.e. the liars) who spread the slander against her and they said what they said, and how Allah revealed her innocence. Each of them related to me a portion of that narration. (They said that `Aisha said), ''Then Allah revealed the ten Verses starting with:--'Verily! Those who spread the slander..' (24.11-21) All these verses were in proof of my innocence. Abu Bakr As-Siddiq who used to provide for Mistah some financial aid because of his relation to him, said, \"By Allah, I will never give anything (in charity) to Mistah, after what he has said about `Aisha\" Then Allah revealed:-- 'And let not those among you who are good and are wealthy swear not to give (any sort of help) to their kins men....' (24.22) On that, Abu Bakr said, \"Yes, by Allah, I like that Allah should forgive me.\" and then resumed giving Mistah the aid he used to give him and said, \"By Allah! I will never withhold it from him.\"",
      "chain": [
        "20167",
        "20150",
        "11176",
        "11013",
        "20381",
        "20434",
        "20475",
        "11013",
        "10511",
        "11002",
        "11042",
        "11004"
      ]
    },
    {
      "hadith_no": "6773",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا الحسن بن محمد، حدثنا الحجاج، عن ابن جريج، قال زعم عطاء أنه سمع عبيد بن عمير، يقول سمعت عائشة، تزعم أن النبي صلى الله عليه وسلم كان يمكث عند زينب بنت جحش، ويشرب عندها عسلا، فتواصيت أنا وحفصة أن أيتنا دخل عليها النبي صلى الله عليه وسلم فلتقل إني أجد منك ريح مغافير، أكلت مغافير فدخل على إحداهما فقالت ذلك له‏.‏ فقال ‏\"‏ لا بل شربت عسلا عند زينب بنت جحش، ولن أعود له ‏\"‏‏.‏ فنزلت ‏{‏يا أيها النبي لم تحرم ما أحل الله لك‏}‏، ‏{‏إن تتوبا إلى الله‏}‏، لعائشة وحفصة، ‏{‏وإذ أسر النبي إلى بعض أزواجه حديثا‏}‏ لقوله ‏\"‏ بل شربت عسلا ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to stay (for a period) in the house of Zainab bint Jahsh (one of the wives of the Prophet ) and he used to drink honey in her house. Hafsa and I decided that when the Prophet entered upon either of us, she would say, \"I smell in you the bad smell of Maghafir (a bad smelling raisin). Have you eaten Maghafir?\" When he entered upon one of us, she said that to him. He replied (to her), \"No, but I have drunk honey in the house of Zainab bint Jahsh, and I will never drink it again.\" Then the following verse was revealed: 'O Prophet ! Why do you ban (for you) that which Allah has made lawful for you?. ..(up to) If you two (wives of the Prophet turn in repentance to Allah.' (66.1-4) The two were `Aisha and Hafsa And also the Statement of Allah: 'And (Remember) when the Prophet disclosed a matter in confidence to one of his wives!' (66.3) i.e., his saying, \"But I have drunk honey.\" Hisham said: It also meant his saying, \"I will not drink anymore, and I have taken an oath, so do not inform anybody of that.\"",
      "chain": [
        "30245",
        "20381",
        "11070",
        "11259"
      ]
    },
    {
      "hadith_no": "337",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني محمد بن حاتم بن ميمون، وإبراهيم بن دينار، - واللفظ لإبراهيم - قالا حدثنا حجاج، - وهو ابن محمد - عن ابن جريج، قال أخبرني يعلى بن مسلم، أنه سمع سعيد بن جبير، يحدث عن ابن عباس، أن ناسا، من أهل الشرك قتلوا فأكثروا وزنوا فأكثروا ثم أتوا محمدا صلى الله عليه وسلم فقالوا إن الذي تقول وتدعو لحسن ولو تخبرنا أن لما عملنا كفارة فنزل ‏{‏ والذين لا يدعون مع الله إلها آخر ولا يقتلون النفس التي حرم الله إلا بالحق ولا يزنون ومن يفعل ذلك يلق أثاما‏}‏ ونزل ‏{‏ يا عبادي الذين أسرفوا على أنفسهم لا تقنطوا من رحمة الله‏{‏ ‏.‏",
      "text_en": " It is narrated on the authority of Ibn 'Abbas that some persons amongst the polytheist had committed a large number of murders and had excessively indulged in fornication. Then they came to Muhammad (may peace be upon him) and said:                      Whatever you assert and whatever you call to is indeed good. But if you inform us that there is atonement of our past deeds (then we would embrace Islam). Then it was revealed: And those who call not unto another god along with Allah and slay not any soul which Allah has forbidden except in the cause of justice, nor commit fornication; and he who does this shall meet the requital of sin. Multiplied for him shall be the torment on the Day of Resurrection, and he shall therein abide disgraced, except him who repents a believes and does good deeds. Then these! for the Allah shall change their vices into virtues. Verily Allah is Ever Forgiving, Merciful (xxv. 68-70). Say thou: O my bondsmen woo have committed extravagance against themselves despair not of the Mercy of Allah I Verily Allah will forgive the sins altogether. He is indeed the Forgiving, the Merciful (xxxix. 53).",
      "chain": [
        "30514",
        "30496",
        "20381",
        "11070",
        "11568",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "412",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا الوليد بن شجاع، وهارون بن عبد الله، وحجاج بن الشاعر، قالوا حدثنا حجاج، - وهو ابن محمد - عن ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا تزال طائفة من أمتي يقاتلون على الحق ظاهرين إلى يوم القيامة - قال - فينزل عيسى ابن مريم صلى الله عليه وسلم فيقول أميرهم تعال صل لنا ‏.‏ فيقول لا ‏.‏ إن بعضكم على بعض أمراء ‏.‏ تكرمة الله هذه الأمة ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      I heard the Messenger of Allah (may peace be upon him) say: A section of my people will not cease fighting for the Truth and will prevail till the Day of Resurrection. He said: Jesus son of Mary would then descend and their (Muslims') commander would invite him to come and lead them in prayer, but he would say: No, some amongst you are commanders over some (amongst you). This is the honour from Allah for this Ummah.",
      "chain": [
        "30482",
        "30524",
        "38834",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "377",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، حدثنا محمد بن بكر، ح وحدثنا محمد بن رافع، حدثنا عبد الرزاق، قالا أخبرنا ابن جريج، ح وحدثني هارون بن عبد الله، - واللفظ له - قال حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني نافع، مولى ابن عمر عن عبد الله بن عمر، أنه قال كان المسلمون حين قدموا المدينة يجتمعون فيتحينون الصلوات وليس ينادي بها أحد فتكلموا يوما في ذلك فقال بعضهم اتخذوا ناقوسا مثل ناقوس النصارى وقال بعضهم قرنا مثل قرن اليهود فقال عمر أولا تبعثون رجلا ينادي بالصلاة قال رسول الله صلى الله عليه وسلم ‏\"‏ يا بلال قم فناد بالصلاة ‏\"‏ ‏.‏",
      "text_en": " Ibn Umar reported:                      When the Muslims came to Medina, they gathered and sought to know the time of prayer but no one summoned them. One day they discussed the matter, and some of them said: Use something like the bell of the Christians and some of them said: Use horn like that of the Jews. Umar said: Why may not a be appointed who should call (people) to prayer? The Messenger of Allah (may peace be upon him) said: O Bilal, get up and summon (the people) to prayer.",
      "chain": [
        "30021",
        "20277",
        "30375",
        "20121",
        "11070",
        "20381",
        "11070",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "455",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا هارون بن عبد الله، حدثنا حجاج بن محمد، عن ابن جريج، ح قال وحدثني محمد بن رافع، - وتقاربا في اللفظ - حدثنا عبد الرزاق، أخبرنا ابن جريج، قال سمعت محمد بن عباد بن جعفر، يقول أخبرني أبو سلمة بن سفيان، وعبد الله بن عمرو بن العاص، وعبد الله بن المسيب العابدي، عن عبد الله بن السائب، قال صلى لنا النبي صلى الله عليه وسلم الصبح بمكة فاستفتح سورة المؤمنين حتى جاء ذكر موسى وهارون أو ذكر عيسى - محمد بن عباد يشك أو اختلفوا عليه - أخذت النبي صلى الله عليه وسلم سعلة فركع وعبد الله بن السائب حاضر ذلك ‏.‏ وفي حديث عبد الرزاق فحذف فركع ‏.‏ وفي حديثه وعبد الله بن عمرو ‏.‏ ولم يقل ابن العاص ‏.‏",
      "text_en": " Abdullah b. Sa'id reported:                      The Apostle of Allah (may peace be upon him) led us in the morning prayer in Mecca and began Sarat al-Mu'minin (xxiii ) but when he came to the mention of Moses and Aaron (verse. 45) or to the mention of Jesus (verse 50), a cough got the better of him, and he bowed. 'Abdullah b. Sa'ib was present there, and in the hadith narrated by Abd al-Razzaq (the words are): He cut short (the recitation) and bowed.",
      "chain": [
        "30524",
        "20381",
        "11070",
        "30375",
        "20121",
        "11070",
        "11262",
        "29"
      ]
    },
    {
      "hadith_no": "1477",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني إسحاق بن إبراهيم، ومحمد بن حاتم، كلاهما عن محمد بن بكر، ح قال وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، ح قال وحدثني حجاج بن الشاعر، ومحمد بن رافع، قالا حدثنا عبد الرزاق، - وألفاظهم متقاربة - قالوا جميعا عن ابن جريج، قال أخبرني المغيرة بن حكيم، عن أم كلثوم بنت أبي بكر، أنها أخبرته عن عائشة، قالت أعتم النبي صلى الله عليه وسلم ذات ليلة حتى ذهب عامة الليل وحتى نام أهل المسجد ثم خرج فصلى فقال ‏\"‏ إنه لوقتها لولا أن أشق على أمتي ‏\"‏ ‏.‏ وفي حديث عبد الرزاق ‏\"‏ لولا أن يشق على أمتي ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported:                      The Apostle of Allah (may peace be upon him) one night delayed (observing the 'Isya' prayer) till a great part of the night was over and the people in the mosque had gone to sleep. He (the Holy Prophet) then came out and observed prayer and said: This is the proper time for it; were it not that I would impose a burden on my people (I would normally pray at this time). In the hadith transmitters by 'Abd al-Razzaq (the words are):\" Were it not that it would impose burden on my people.\"",
      "chain": [
        "30123",
        "38487",
        "20277",
        "30524",
        "20381",
        "38834",
        "30375",
        "11070",
        "10966",
        "10500"
      ]
    },
    {
      "hadith_no": "1508",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني هارون بن عبد الله، ومحمد بن حاتم، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني عمر بن عطاء بن أبي الخوار، أنه بينا هو جالس مع نافع بن جبير بن مطعم إذ مر بهم أبو عبد الله ختن زيد بن زبان مولى الجهنيين فدعاه نافع فقال سمعت أبا هريرة يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ صلاة مع الإمام أفضل من خمس وعشرين صلاة يصليها وحده ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (way peace be upon him) said: Prayer along with the Imam is twenty-five times more excellent than prayer said by a single person.",
      "chain": [
        "30524",
        "38487",
        "20381",
        "11070",
        "10654",
        "13"
      ]
    },
    {
      "hadith_no": "1744",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني محمد بن حاتم، وهارون بن عبد الله، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني عثمان بن أبي سليمان، أن أبا سلمة بن عبد الرحمن، أخبره أن عائشة أخبرته أن النبي صلى الله عليه وسلم لم يمت حتى كان كثير من صلاته وهو جالس ‏.‏",
      "text_en": " 'A'isha reported:                      When the Messenger of Allah (may peace be upon him) grew bulky and heavy he would observe (most of his Nafl) prayers sitting.",
      "chain": [
        "38487",
        "30524",
        "20381",
        "11070",
        "10649",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "1792",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني نافع، أن ابن عمر، كان يقول من صلى من الليل فليجعل آخر صلاته وترا قبل الصبح كذلك كان رسول الله صلى الله عليه وسلم يأمرهم ‏.‏",
      "text_en": " Ibn 'Umar reported Allah's Messenger (way peace be upon him) as saying:                      Witr is a rak'ah at the end of the prayer.",
      "chain": [
        "30524",
        "20381",
        "11070",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2080",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني عمر بن عطاء، أن نافع بن جبير، أرسله إلى السائب بن يزيد ابن أخت نمر ‏.‏ وساق الحديث بمثله غير أنه قال فلما سلم قمت في مقامي ولم يذكر الإمام ‏.‏",
      "text_en": " The same hadith is narrated on the authority of 'Umar b. Ata' but with this modification:                      When he (the Imam) pronounced salutation I stood up at my place. No mention was made of the Imam in it.",
      "chain": [
        "30524",
        "20381",
        "11070",
        "13541",
        "11059"
      ]
    },
    {
      "hadith_no": "2228",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا هارون بن عبد الله، وحجاج بن الشاعر، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يحدث أن النبي صلى الله عليه وسلم خطب يوما فذكر رجلا من أصحابه قبض فكفن في كفن غير طائل وقبر ليلا فزجر النبي صلى الله عليه وسلم أن يقبر الرجل بالليل حتى يصلى عليه إلا أن يضطر إنسان إلى ذلك وقال النبي صلى الله عليه وسلم ‏\"‏ إذا كفن أحدكم أخاه فليحسن كفنه ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      Allah's Messenger (may peace be upon him) one day in the course of his sermon made mention of a person among his Companions who had died and had been wrapped in a shroud not long (enough to cover his whole body) and was buried during the night. The Apostle of Allah (may peace be upon him) reprimanded (the audience) that a person was buried during the night (in a state that) funeral prayer could not be offered (over him by the Messenger of Allah). (And this is permissible only) when it becomes a dire necessity for a man. The Apostle of Allah (may peace be upon him) also said: When any one of you shrouds his brother, he should shroud him well.",
      "chain": [
        "30524",
        "38834",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "2290",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، ح وحدثني محمد بن رافع، حدثنا عبد الرزاق، جميعا عن ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابر بن عبد، الله يقول سمعت النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been transmitted on the authority of Jabir b. 'Abdullah.",
      "chain": [
        "30524",
        "20381",
        "30375",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "2425",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني محمد بن حاتم، وهارون بن عبد الله، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني ابن أبي مليكة، أن عباد بن عبد الله بن الزبير، أخبره عن أسماء، بنت أبي بكر أنها جاءت النبي صلى الله عليه وسلم فقالت يا نبي الله ليس لي شىء إلا ما أدخل على الزبير فهل على جناح أن أرضخ مما يدخل على فقال ‏\"‏ ارضخي ما استطعت ولا توعي فيوعي الله عليك ‏\"‏ ‏.‏",
      "text_en": " Asma', daughter of Abu Bakr, reported that abe came to the Apostle of Allah (may peace he upon him) and said:                      Apostle of Allah, I have nothing with me, but only, that which is given to me by Zubair (for household expenses). Is there any sin for me if I spend out of that which is given to me (by Zabair)? Upon this he (the Holy Prophet) said: Spend according to your means; and do not hoard, for Allah will withhold from you.",
      "chain": [
        "38487",
        "30524",
        "20381",
        "11070",
        "11090",
        "11250",
        "70"
      ]
    },
    {
      "hadith_no": "2465",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني زهير بن حرب، وهارون بن عبد الله، قالا حدثنا حجاج بن محمد، عن ابن جريج، قال سمعت عطاء، يقول سمعت ابن عباس، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لو أن لابن آدم ملء واد مالا لأحب أن يكون إليه مثله ولا يملأ نفس ابن آدم إلا التراب والله يتوب على من تاب ‏\"‏ ‏.‏ قال ابن عباس فلا أدري أمن القرآن هو أم لا ‏.‏ وفي رواية زهير قال فلا أدري أمن القرآن ‏.‏ لم يذكر ابن عباس ‏.‏",
      "text_en": " Ibn Abbas reported Allah's Messenger (may peace be upon him) as saying:                      If there were for the son of Adam a valley full of riches, he would long to possess another one like it. and Ibn Adam does not feel satiated but with dust. 1413 And Allah returns to him who returns (to HiM). 1414 Ibn Abbas said: I do not know whether it is from the Qur'an or not; and in the narration transmitted by Zuhair it was said: I do not know whether it is from the Qur'an, and he made no mention of Ibn Abbas.",
      "chain": [
        "30022",
        "30524",
        "20381",
        "11070",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "2574",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني هارون بن عبد الله، وحجاج بن الشاعر، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، - رضى الله عنهما - يقول اعتزل النبي صلى الله عليه وسلم نساءه شهرا فخرج إلينا صباح تسع وعشرين فقال بعض القوم يا رسول الله إنما أصبحنا لتسع وعشرين ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن الشهر يكون تسعا وعشرين ‏\"‏ ‏.‏ ثم طبق النبي صلى الله عليه وسلم بيديه ثلاثا مرتين بأصابع يديه كلها والثالثة بتسع منها ‏.‏",
      "text_en": " Abu Zubair is reported to have heard Jabir b. 'Abdullah (Allah be pleased with both of them) as saying:                      The Apostle of Allah (may peace be upon him) separated himself from his wives for a month. (His wives said: ) He came to us on the morning of the twenty-ninth. Upon this some, of the people said: It is the morning of twenty- ninth (according to our calculation). Upon this the Apostle of Allah (may peace be upon him) said: The month. may also consist of twenty-nine days. The Apostle of Allah (may peace be upon him) then flapped his bands thrice, twice with all the fingers of both his hand (to indicate twenty-nine) and by the third time with nine (fingers).",
      "chain": [
        "30524",
        "38834",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "2575",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني يحيى بن عبد الله بن محمد بن صيفي، أن عكرمة بن عبد الرحمن بن الحارث، أخبره أن أم سلمة - رضى الله عنها - أخبرته أن النبي صلى الله عليه وسلم حلف أن لا يدخل على بعض أهله شهرا فلما مضى تسعة وعشرون يوما غدا عليهم - أو راح - فقيل له حلفت يا نبي الله أن لا تدخل علينا شهرا ‏.‏ قال ‏\"‏ إن الشهر يكون تسعة وعشرين يوما ‏\"‏ ‏.‏",
      "text_en": " Umm Salama (Allah be pleased with him) reported that the Apostle of Allah (may peace be upon him) took an oath that he would not go to some of his wives for the whole of the month. When twenty-nine days bad passed he (the Holy Prophet) went to them in the morning or in the evening. Upon this it was said to him:                      Apostle of Allah, you took an oath that you would not come to us for a month, whereupon he said: The month may also consist of twenty-nine days.",
      "chain": [
        "30524",
        "20381",
        "11070",
        "11448",
        "56"
      ]
    },
    {
      "hadith_no": "2878",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني صالح بن كيسان، عن نافع، عن ابن عمر، - رضى الله عنهما - أنه كان يخبر أن النبي صلى الله عليه وسلم أهل حين استوت به ناقته قائمة ‏.‏",
      "text_en": " Ibn 'Umar (Allah be pleased with them) reported that the Apostle of Allah (may peace be upon him) pronounced Talbiya as his camel stood up.",
      "chain": [
        "30524",
        "20381",
        "11070",
        "11176",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3193",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني يعقوب الدورقي، حدثنا ابن أبي زائدة، ح وحدثنا ابن أبي عمر، حدثنا سفيان، كلاهما عن الأعمش، قال سمعت الحجاج، يقول لا تقولوا سورة البقرة ‏.‏ واقتصا الحديث بمثل حديث ابن مسهر ‏.‏",
      "text_en": " A'mash reported:                      I heard Hajjaj saying I Do not say Surah al-Baqara. The rest of the hadith is the same.",
      "chain": [
        "30400",
        "20366",
        "30421",
        "11060",
        "20381"
      ]
    },
    {
      "hadith_no": "3339",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أن عليا الأزدي، أخبره أن ابن عمر علمهم أن رسول الله صلى الله عليه وسلم كان إذا استوى على بعيره خارجا إلى سفر كبر ثلاثا ثم قال ‏\"‏ سبحان الذي سخر لنا هذا وما كنا له مقرنين وإنا إلى ربنا لمنقلبون اللهم إنا نسألك في سفرنا هذا البر والتقوى ومن العمل ما ترضى اللهم هون علينا سفرنا هذا واطو عنا بعده اللهم أنت الصاحب في السفر والخليفة في الأهل اللهم إني أعوذ بك من وعثاء السفر وكآبة المنظر وسوء المنقلب في المال والأهل ‏\"‏ ‏.‏ وإذا رجع قالهن ‏.‏ وزاد فيهن ‏\"‏ آيبون تائبون عابدون لربنا حامدون ‏\"‏ ‏.‏",
      "text_en": " Ibn Umar (Allah be pleased with them) reported that whenever Allah's Messenger (may peace be upon him) mounted his camel while setting out on a journey, he glorified Allah (uttered Allah-o-Akbar) thrice, and then said:                      Hallowed is He Who subdued for us this (ride) and we were not ourselves powerful enough to use It as a ride, and we are going to return to our Lord. O Allah, we seek virtue and piety from Thee in this journey of ours and the act which pleaseth Thee. O Allah, lighten this journey of ours, and make its distance easy for us. O Allah, Thou art (our) companion during the journey, and guardian of (our) family. O Allah, I seek refuge with Thee from hardships of the journey, gloominess of the sights, and finding of evil changes in property and family on return. And he (the Holy Prophet) uttered (these words), and made this addition to them: We are returning, repentant, worshipping our Lord. and praising Him.",
      "chain": [
        "30524",
        "20381",
        "11070",
        "11263"
      ]
    },
    {
      "hadith_no": "3424",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني محمد بن حاتم، وإبراهيم بن دينار، قالا حدثنا حجاج بن محمد، ح وحدثني محمد بن رافع، حدثنا عبد الرزاق، كلاهما عن ابن جريج، أخبرني عبد الله بن عبد الرحمن، بن يحنس عن أبي عبد الله القراظ، أنه قال أشهد على أبي هريرة أنه قال قال أبو القاسم صلى الله عليه وسلم ‏\"‏ من أراد أهل هذه البلدة بسوء - يعني المدينة - أذابه الله كما يذوب الملح في الماء ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported that Abu'I-Qasim (Mubammad, may peace be upon him) said:                      He who intends to do harm to the people of this city (that is, Medina). Allah would efface him as salt is dissolved in water.",
      "chain": [
        "38487",
        "30496",
        "20381",
        "30375",
        "11070",
        "10663",
        "11846"
      ]
    },
    {
      "hadith_no": "3536",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج ح وحدثناه إسحاق بن إبراهيم، ومحمد بن رافع، عن عبد الرزاق، أخبرنا ابن جريج، أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول نهى رسول الله صلى الله عليه وسلم عن الشغار ‏.‏",
      "text_en": " Jabir b. Abdullah (Allah be pleased with him) reported that Allah's Messenger (may peace be upon him) prohibited Shighar.",
      "chain": [
        "30524",
        "20381",
        "11070",
        "30123",
        "30375",
        "20121",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3589",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، عن ابن جريج، أخبرني موسى بن عقبة، عن نافع، قال سمعت عبد الله بن عمر، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ أجيبوا هذه الدعوة إذا دعيتم لها ‏\"‏ ‏.‏ قال وكان عبد الله بن عمر يأتي الدعوة في العرس وغير العرس ويأتيها وهو صائم ‏.‏",
      "text_en": " Nafil reported:                      I heard Abdullah b. Umar (Allah be pleased with them) narrating that Allah's Messenger (may peace be upon him) said: Accept the feast when you are invited to it. And Abdullah (b. Umar) used to come to the feast, whether it was a wedding feast or other than that, and he would come there even in the state of fasting.",
      "chain": [
        "30524",
        "20381",
        "11070",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3743",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع عبد الرحمن بن أيمن، مولى عزة يسأل ابن عمر وأبو الزبير يسمع ذلك كيف ترى في رجل طلق امرأته حائضا فقال طلق ابن عمر امرأته وهى حائض على عهد رسول الله صلى الله عليه وسلم فسأل عمر رسول الله صلى الله عليه وسلم فقال إن عبد الله بن عمر طلق امرأته وهى حائض ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ ليراجعها ‏\"‏ ‏.‏ فردها وقال ‏\"‏ إذا طهرت فليطلق أو ليمسك ‏\"‏ ‏.‏ قال ابن عمر وقرأ النبي صلى الله عليه وسلم يا أيها النبي إذا طلقتم النساء فطلقوهن في قبل عدتهن ‏.‏",
      "text_en": " Abu Zubair reported that he heard 'Abd al-Rahman b. Aiman (the freed slave of 'Azza) say that he asked Ibn 'Umar (Allah be pleased with them) and Abu Zubair heard:                      What is your opinion about the person who divorced his wife in the state of menses? Thereupon he said: Ibn Umar (Allah be pleased with them) divorced his wife during the lifetime of Allah's Messenger (may peace be upon him) while she was in the state of menses. Upon this Allah's Messenger (may peace be upon him) told him to take her back and so he took her back and he (further) said: When she is pure, then either divorce her or retain her. Ibn 'Umar (Allah be pleased with them) said that Allah's Apostle (may peace be upon him) then recited this verse:\" O Apostle, when you divorce women, divorce them at the commencement of their prescribed period\" (Ixv 1).",
      "chain": [
        "30524",
        "20381",
        "11070",
        "11263"
      ]
    },
    {
      "hadith_no": "3751",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا حجاج بن محمد، أخبرنا ابن جريج، أخبرني عطاء، أنه سمع عبيد بن عمير، يخبر أنه سمع عائشة، تخبر أن النبي صلى الله عليه وسلم كان يمكث عند زينب بنت جحش فيشرب عندها عسلا قالت فتواطأت أنا وحفصة أن أيتنا ما دخل عليها النبي صلى الله عليه وسلم فلتقل إني أجد منك ريح مغافير أكلت مغافير فدخل على إحداهما فقالت ذلك له ‏.‏ فقال ‏\"‏ بل شربت عسلا عند زينب بنت جحش ولن أعود له ‏\"‏ ‏.‏ فنزل ‏{‏ لم تحرم ما أحل الله لك‏}‏ إلى قوله ‏{‏ إن تتوبا‏}‏ لعائشة وحفصة ‏{‏ وإذ أسر النبي إلى بعض أزواجه حديثا‏}‏ لقوله ‏\"‏ بل شربت عسلا ‏\"‏ ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) narrated that Allah's Apostle (may peace be upon him) used to spend time with Zainab daughter of Jahsh and drank honey at her house. She ('A'isha further) said:                      I and Hafsa agreed that one whom Allah's Apostle (may peace be upon him) would visit first should say: I notice that you have an odour of the Maghafir (gum of mimosa). He (the Holy Prophet) visited one of them and she said to him like this, whereupon he said: I have taken honey in the house of Zainab bint Jabsh and I will never do it again. It was at this (that the following verse was revealed): 'Why do you hold to be forbidden what Allah has made lawful for you... (up to). If you both ('A'isha and Hafsa) turn to Allah\" up to:\" And when the Holy Prophet confided an information to one of his wives\" (lxvi. 3). This refers to his saying: But I have taken honey.",
      "chain": [
        "38487",
        "20381",
        "11070",
        "11029",
        "11259"
      ]
    },
    {
      "hadith_no": "3794",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثني محمد بن حاتم بن ميمون، حدثنا يحيى بن سعيد، عن ابن جريج، ح وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، ح وحدثني هارون بن عبد الله، - واللفظ له - حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول طلقت خالتي فأرادت أن تجد نخلها فزجرها رجل أن تخرج فأتت النبي صلى الله عليه وسلم فقال ‏\"‏ بلى فجدي نخلك فإنك عسى أن تصدقي أو تفعلي معروفا ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah (Allah be pleased with them) reported:                      My maternal aunt was divorced, and she intended to pluck her dates. A person scolded her for having come out (during the period of 'Idda). She came to Allah's Prophet (may peace be upon him.) and he said: Certainly you can pluck (dates) from your palm trees, for perhaps you may give charity or do an act of kindness.",
      "chain": [
        "30514",
        "20031",
        "11070",
        "30375",
        "20121",
        "11070",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "4231",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Rules of Inheritance - كتاب الفرائض",
      "chapter_no": "24",
      "text_ar": "حدثني محمد بن حاتم بن ميمون، حدثنا حجاج بن محمد، حدثنا ابن جريج، قال أخبرني ابن المنكدر، عن جابر بن عبد الله، قال عادني النبي صلى الله عليه وسلم وأبو بكر في بني سلمة يمشيان فوجدني لا أعقل فدعا بماء فتوضأ ثم رش على منه فأفقت فقلت كيف أصنع في مالي يا رسول الله فنزلت ‏{‏يوصيكم الله في أولادكم للذكر مثل حظ الأنثيين‏}‏",
      "text_en": " Jabir b. 'Abdullah (Allah be pleased with him) reported:                      Allah's Apostle (may peace be upon him) and Abi Bakr (Allah be pleased with him) visited me on foot in Banu Salama, and found me unconscious. He (the Holy Prophet) called for water and performed ablution and sprinkled out of it (the water) over me. I felt relieved. I said: Allah's Messenger, what should I do with my property? And this verse was revealed:\" Allah enjoins you concerning your children: for the male is equal of the portion of two females.\"",
      "chain": [
        "30514",
        "20381",
        "11070",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "4538",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول رجم النبي صلى الله عليه وسلم رجلا من أسلم ورجلا من اليهود وامرأته ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported that Allah's Apostle (may peace be upon him) stoned (to death) a person from Banu Aslam, and a Jew and his wife.",
      "chain": [
        "30524",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "4851",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثني زهير بن حرب، وهارون بن عبد الله، قالا حدثنا حجاج بن محمد، قال قال ابن جريج نزل ‏{‏ يا أيها الذين آمنوا أطيعوا الله وأطيعوا الرسول وأولي الأمر منكم‏}‏ في عبد الله بن حذافة بن قيس بن عدي السهمي بعثه النبي صلى الله عليه وسلم في سرية ‏.‏ أخبرنيه يعلى بن مسلم عن سعيد بن جبير عن ابن عباس ‏.‏",
      "text_en": " It has been narrated on the authority of Ibn Juraij that the Qur'anic injunction:                     \" 0 you who believe, obey Allah, His Apostle and those in authority from amongst You\" (iv. 59) -was revealed in respect of 'Abdullah b. Hudhafa b. Qais b. Adi al-Sahmi who was despatched by the Holy Prophet (may peace be upon him) as leader of a military campaign. The narrator said: He was informed of this fact by Ya'la b. Muslim who was informed by Sa'id b. Jubair who in turn was informed by Ibn Abbas.",
      "chain": [
        "30022",
        "30524",
        "20381"
      ]
    },
    {
      "hadith_no": "4917",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني إبراهيم بن دينار، حدثنا حجاج بن محمد الأعور، مولى سليمان بن مجالد قال قال ابن جريج وأخبرني أبو الزبير، أنه سمع جابرا، يسأل هل بايع النبي صلى الله عليه وسلم بذي الحليفة فقال لا ولكن صلى بها ولم يبايع عند شجرة إلا الشجرة التي بالحديبية ‏.‏ قال ابن جريج وأخبرني أبو الزبير أنه سمع جابر بن عبد الله يقول دعا النبي صلى الله عليه وسلم على بئر الحديبية ‏.‏",
      "text_en": " It has been narrated (through a different chain of transmitters) on the authority of Abu Zubair who heard Jabir being questioned as to whether the Holy Prophet (may peace be upon him) took the oath of fealty at Dhu'l-Hulaifa. He said:                      No! But he offered his prayers at that place, and he administered the oath of fealty nowhere except near the tree in (the plain oo Hudaibiya. Ibn Juraij said that he was informed by Abu Zabair who heard Jabir b. Abdullah say: The Holy Prophet (may peace be upon him) prayed over the well at Hudaibiya (as a result of which its scanty water rose up and increased so as to be sufficient for the 1400 or 1500 men who had encamped at the place).",
      "chain": [
        "30496",
        "20381",
        "11070",
        "11263"
      ]
    },
    {
      "hadith_no": "5063",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثني هارون بن عبد الله، وحجاج بن الشاعر، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تزال طائفة من أمتي يقاتلون على الحق ظاهرين إلى يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Jabir b. 'Abdullah who said:                      I heard the Messenger of Allah (may peace be upon him) say: A group of people from my Umma will continue to fight In defence of truth and remain triumphant until the Day of judgment.",
      "chain": [
        "30524",
        "38834",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "5175",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثني محمد بن حاتم، حدثنا يحيى بن سعيد، عن ابن جريج، ح وحدثنا عبد، بن حميد أخبرنا محمد بن بكر، أخبرنا ابن جريج، ح وحدثني هارون بن عبد الله، حدثنا  حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول نهى رسول الله صلى الله عليه وسلم أن يقتل شىء من الدواب صبرا ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported that Allah's Messenger (may peace be upon him) forbade that any beast should be killed after it has been tied.",
      "chain": [
        "38487",
        "20031",
        "11070",
        "30553",
        "20277",
        "11070",
        "30524",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "5242",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، أخبرنا حجاج بن محمد، عن ابن جريج، حدثني  ابن شهاب، عن علي بن حسين بن علي، عن أبيه، حسين بن علي عن علي بن أبي طالب، قال أصبت شارفا مع رسول الله صلى الله عليه وسلم في مغنم يوم بدر وأعطاني رسول الله صلى الله عليه وسلم شارفا أخرى فأنختهما يوما عند باب رجل من الأنصار وأنا أريد أن أحمل عليهما إذخرا لأبيعه ومعي صائغ من بني قينقاع فأستعين به على وليمة فاطمة وحمزة بن عبد المطلب يشرب في ذلك البيت معه قينة تغنيه فقالت ألا يا حمز للشرف النواء فثار إليهما حمزة بالسيف فجب أسنمتهما وبقر خواصرهما ثم أخذ من أكبادهما ‏.‏ قلت لابن شهاب ومن السنام قال قد جب أسنمتهما فذهب بها ‏.‏ قال ابن شهاب قال علي فنظرت إلى منظر أفظعني فأتيت نبي الله صلى الله عليه وسلم وعنده زيد بن حارثة فأخبرته الخبر فخرج ومعه زيد وانطلقت معه فدخل على حمزة فتغيظ عليه فرفع حمزة بصره فقال هل أنتم إلا عبيد لآبائي فرجع رسول الله صلى الله عليه وسلم يقهقر حتى خرج عنهم ‏.‏",
      "text_en": " 'Ali b. Abu Talib reported; There fell to my lot along with Allah's Messenger (may peace be upon him) an old she-camel from the spoils of Badr. Allah's Messenger (may peace be upon him) granted me another camel. I made them kneel down one day at the door of an Ansari, and I wanted to carry on them Idhkhir (a kind of grass) in order to sell that. There was with me a goldsmith of the tribe of Qainuqa'. I saught to give a wedding feast (on the occasion of marriage with) Fatima with the help of that (the price accrued from the sale of this grass). And Hamza b. 'Abd al-Muttalib was busy in drinking in that house in the company of a singing girl who was singing to him. She said:                      Hamza, get up for slaughtering the fat she-camels. Hamza attacked them with the sword and cut off their humps and ripped their haunches, and then took out their livers. I said to Ibn Shihab: Did he take out anything from the hump? He said: He cut off the humps altogether. Ibn Shihab reported 'Ali having said: I saw this (horrible) sight and it shocked me, and I came to Allah's Apostle (may peace be upon him) and there was Zaid b, Haritha with him and communicated to him this news. He came in the company of Zaid and I also went along with him and he went to Hamza and he expressed anger with him. Hamza raised his eyes and said: Are you (not) but the servants of my father? Allah's Messenger (may peace be upon him) turned back on his heels (on hearing this) until he went away from them.",
      "chain": [
        "30399",
        "20381",
        "11070",
        "11013",
        "11045",
        "5"
      ]
    },
    {
      "hadith_no": "5415",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثني هارون بن عبد الله، حدثنا حجاج بن محمد، ح وحدثنا عبد بن حميد، أخبرني أبو عاصم، جميعا عن ابن جريج، ح وحدثنا زهير بن حرب، - واللفظ له - حدثنا  روح بن عبادة، حدثنا ابن جريج، قال سمعت عطاء، يقول سمعت ابن عباس، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أكل أحدكم من الطعام فلا يمسح يده حتى يلعقها أو يلعقها ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas reported Allah's Messenger (may peace be upon him) as saying:                      When any one of you eats food he should not wipe his hand until he has licked it or got it licked by (someone else).",
      "chain": [
        "30524",
        "20381",
        "30553",
        "11070",
        "30022",
        "20229",
        "11070",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "5673",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، ح وحدثنا عبد بن حميد، أخبرنا محمد بن بكر، ‏.‏ كلاهما عن ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابر، بن عبد الله يقول نهى رسول الله صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This hadith has been reported on the authority of Jabir b. 'Abdullah through another chain of transmitters.",
      "chain": [
        "30524",
        "20381",
        "30553",
        "20277",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "5788",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثني هارون بن عبد الله، وحجاج بن الشاعر، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول سلم ناس من يهود على رسول الله صلى الله عليه وسلم فقالوا السام عليك يا أبا القاسم ‏.‏ فقال ‏\"‏ وعليكم ‏\"‏ ‏.‏ فقالت عائشة وغضبت ألم تسمع ما قالوا قال ‏\"‏ بلى قد سمعت فرددت عليهم وإنا نجاب عليهم ولا يجابون علينا ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Abdullah reported that some people from amongst the Jews said to Allah's Messenger (may peace be upon him) Abu'l-Qasim. as-Sam-u-'Alaikum, whereupon he said:                      Wa 'Alaikum, A'isha was enraged and asked him (Allah's Apostle) whether he had not heard what they had said. He said, I did hear and I retorted to them (and the curse that I invoked upon them would receive response from Allah), but (the curse that they invoked upon us) would not be responded.",
      "chain": [
        "30524",
        "38834",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "6560",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني  أبو الزبير، أنه سمع جابر بن عبد الله، يقول أخبرتني أم مبشر، أنها سمعت النبي صلى الله عليه وسلم يقول عند حفصة ‏\"‏ لا يدخل النار إن شاء الله من أصحاب الشجرة أحد ‏.‏ الذين بايعوا تحتها ‏\"‏ ‏.‏ قالت بلى يا رسول الله ‏.‏ فانتهرها فقالت حفصة ‏{‏ وإن منكم إلا واردها‏}‏ فقال النبي صلى الله عليه وسلم ‏\"‏ قد قال الله عز وجل ‏{‏ ثم ننجي الذين اتقوا ونذر الظالمين فيها جثيا‏}‏",
      "text_en": " Umm Mubashshir reported that she heard Allah's Apostle (may peace be upon him) as saying in presence of Hafsa:                      God willing, the people of the Tree would never enter the fire of Hell one amongst those who owed allegiance under that. She said: Allah's Messenger, why not? He scolded her. Hafsa said: And there is none amongst you but shall have to pass over that (narrow Bridge). Thereupon Allah's Apostle (may peace be upon him) said: Allah, the Exalted and Glorious, has said: We would rescue those persons who are God-conscious and we would leave the tyrants to their fate there (xix. 72).",
      "chain": [
        "30524",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "6644",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني هارون بن عبد الله، وحجاج بن الشاعر، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول سمعت النبي صلى الله عليه وسلم يقول قبل أن يموت بشهر ‏\"‏ تسألوني عن الساعة وإنما علمها عند الله وأقسم بالله ما على الأرض من نفس منفوسة تأتي عليها مائة سنة ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      I heard Allah's Messenger (may peace be upon him) as saying this one month before his death: You asked me about the Last Hour whereas its knowledge is with Allah. I, however, take an oath and say that none upon the earth, the created beings (from amongst my Companions), would survive at the end of one hundred years. This hadith has been narrated on the authority of Ibn Juraij with the same chain of transmitters, but there is no mention of the words:\" one month before his death\".",
      "chain": [
        "30524",
        "38834",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "6790",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني هارون بن عبد الله، وحجاج بن الشاعر، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنما أنا بشر وإني اشترطت على ربي عز وجل أى عبد من المسلمين سببته أو شتمته أن يكون ذلك له زكاة وأجرا ‏\"‏ ‏.‏  حدثنيه ابن أبي خلف، حدثنا روح، ح وحدثناه عبد بن حميد، حدثنا أبو عاصم، جميعا عن ابن جريج، بهذا الإسناد مثله ‏.‏",
      "text_en": " Jabir b. Abdullah reported Allah's Messenger (may peace be upon him) as saying:                      I am a human being and I have made this term with my Lord, the Exalted and Glorious: For any servant amongst Muslims whom I curse or scold, make that a source of purity and reward. This hadith has been narrated on the authority of Ibn Juraij with the same chain of transmitters.",
      "chain": [
        "30524",
        "38834",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "7211",
      "source": " Sahih Muslim ",
      "chapter": "Pertaining To The Charateristics Of The Hypocrites And Command Concerning Them - كتاب صفات المنافقين وأحكامهم",
      "chapter_no": "52",
      "text_ar": "حدثنا زهير بن حرب، وهارون بن عبد الله، - واللفظ لزهير - قالا حدثنا حجاج، بن محمد عن ابن جريج، أخبرني ابن أبي مليكة، أن حميد بن عبد الرحمن بن عوف، أخبره  أن مروان قال اذهب يا رافع - لبوابه - إلى ابن عباس فقل لئن كان كل امرئ منا فرح بما أتى وأحب أن يحمد بما لم يفعل معذبا لنعذبن أجمعون ‏.‏ فقال ابن عباس ما لكم ولهذه الآية إنما أنزلت هذه الآية في أهل الكتاب ‏.‏ ثم تلا ابن عباس ‏{‏ وإذ أخذ الله ميثاق الذين أوتوا الكتاب لتبيننه للناس ولا تكتمونه‏}‏ هذه الآية وتلا ابن عباس ‏{‏ لا تحسبن الذين يفرحون بما أتوا ويحبون أن يحمدوا بما لم يفعلوا‏}‏ وقال ابن عباس سألهم النبي صلى الله عليه وسلم عن شىء فكتموه إياه وأخبروه بغيره فخرجوا قد أروه أن قد أخبروه بما سألهم عنه واستحمدوا بذلك إليه وفرحوا بما أتوا من كتمانهم إياه ما سألهم عنه ‏.‏",
      "text_en": " Humaid b. 'Abd al-Rahman b. 'Auf reported that Marwan said to Rafi', his chamberlain, that he should go to Ibn 'Abbas and ask him:                      If every one of us be punished for his being happy upon his deed and for his being praised for what he has not done, nobody would be saved from the torment. Ibn 'Abbas said: What you have to do with this verse? It has been in fact revealed in connection with the people of the Book.\" Then Ibn Abbas recited this verse:\" When Allah took a covenant from those who had been given the Book: You shall explain it to people and shall not conceal this\" (iii. 186), and then Ibn 'Abbas recited this verse:\" Think not that those who exult in what they have done and love to be praised for what they have not done\" (iii. 186). Ibn 'Abbas (further) said: Allah's Apostle (may peace be upon him) asked them about something and then they concealed that and they told him something else and they went out and they thought that they had informed him as lie had asked them and they felt happy of what they had concealed.",
      "chain": [
        "30022",
        "20381",
        "11070",
        "11090",
        "10561",
        "20201"
      ]
    },
    {
      "hadith_no": "7231",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثني سريج بن يونس، وهارون بن عبد الله، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني إسماعيل بن أمية، عن أيوب بن خالد، عن عبد الله بن رافع، مولى أم سلمة عن أبي هريرة، قال أخذ رسول الله صلى الله عليه وسلم بيدي فقال ‏\"‏ خلق الله عز وجل التربة يوم السبت وخلق فيها الجبال يوم الأحد وخلق الشجر يوم الاثنين وخلق المكروه يوم الثلاثاء وخلق النور يوم الأربعاء وبث فيها الدواب يوم الخميس وخلق آدم عليه السلام بعد العصر من يوم الجمعة في آخر الخلق وفي آخر ساعة من ساعات الجمعة فيما بين العصر إلى الليل ‏\"‏ ‏.‏",
      "text_en": " Abu Haraira reported that Allah's Messenger (may peace be upon him) took hold of my hands and said:                      Allah, the Exalted and Glorious, created the clay on Saturday and He created the mountains on Sunday and He created the trees on Monday and He created the things entailing labour on Tuesday and created light on Wednesday and lie caused the animals to spread on Thursday and created Adam (peace be upon him) after 'Asr on Friday;the last creation at the last hour of the hours of Friday, i. e. between afternoon and night.",
      "chain": [
        "30251",
        "30524",
        "20381",
        "11070",
        "11417",
        "11831",
        "11864",
        "13"
      ]
    },
    {
      "hadith_no": "7580",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج حدثني  أبو الزبير، أنه سمع جابر بن عبد الله، يقول أخبرتني أم شريك، أنها سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ ليفرن الناس من الدجال في الجبال ‏\"‏ ‏.‏ قالت أم شريك يا رسول الله فأين العرب يومئذ قال ‏\"‏ هم قليل ‏\"‏ ‏.‏",
      "text_en": " Umm Sharik reported:                      I heard Allah's Messenger (may peace be upon him) as saying: The people would run away from the Dajjal seeking shelter in the mountains. She said: Where would be the Arabs then in that day? He said: They would be small in number.",
      "chain": [
        "30524",
        "20381",
        "11070",
        "11263",
        "34",
        "187"
      ]
    },
    {
      "hadith_no": "299",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن سنان القطان الواسطي، حدثنا يزيد، عن أيوب بن أبي مسكين، عن الحجاج، عن أم كلثوم، عن عائشة، في المستحاضة تغتسل - تعني مرة واحدة - ثم توضأ إلى أيام أقرائها ‏.‏",
      "text_en": " 'Aishah said about the woman who has a prolonged flow of blood:                      She should take bath, i.e. only once; then she should perform ablution until he next menstrual period.",
      "chain": [
        "30297",
        "20472",
        "20381",
        "10500"
      ]
    }
  ],
  "total_hadiths": 124
}