{
  "id": "20389",
  "name": "Mua'wiya bin 'Amr bin al-Mhlb معاوية بن عمرو بن المهلب بن عمرو",
  "full_name": "Mua'wiya bin 'Amr bin al-Mhlb معاوية بن عمرو بن المهلب بن عمرو",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "214",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Azdi",
      "al-Baghdadi"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "al-Baghdad",
        "ar": "al-Baghdad",
        "ckb": "al-Baghdad"
      }
    ],
    "tags_display": [
      {
        "en": "al-Azdi",
        "ar": "al-Azdi",
        "ckb": "al-Azdi"
      },
      {
        "en": "al-Baghdadi",
        "ar": "al-Baghdadi",
        "ckb": "al-Baghdadi"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20320",
      "name": "Za'ida bin Qadama al-Thaqifi زائدة بن قدامة الثقفي",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20724",
      "name": "'Abdur Rahman bin 'Abdullah bin 'Utba عبد الرحمن بن عبد الله بن عتبة المسعودي",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [6th Generation]",
        "ar": "تابعي [الجيل السادس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی شەشەم]"
      }
    },
    {
      "id": "20321",
      "name": "Zuhayr bin Mua'wiya bin Hudayj زهير بن معاوية بن حديج",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20405",
      "name": "Ibrahim bin Muhammad bin al-Harith إبراهيم بن محمد أبو اسحاق الفزاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20598",
      "name": "Fdyl bin Mrzwq al-Aghr al-Rqashy فضيل بن مرزوق الأغر الرقاشي",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]",
      "grade_display": {
        "en": "3rd Century AH [11th Generation]",
        "ar": "القرن الثالث الهجري [الجيل الحادي عشر]",
        "ckb": "سەدەی سێیەمی كۆچی [نەوەی یازدەیەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-719",
      "hadith_no": "719",
      "source": "Sahih Bukhari",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا أحمد بن أبي رجاء، قال حدثنا معاوية بن عمرو، قال حدثنا زائدة بن قدامة، قال حدثنا حميد الطويل، حدثنا أنس، قال أقيمت الصلاة فأقبل علينا رسول الله صلى الله عليه وسلم بوجهه فقال ‏\"‏ أقيموا صفوفكم وتراصوا، فإني أراكم من وراء ظهري ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Once the Iqama was pronounced and Allah's Apostle faced us and said, \"Straighten your rows and stand closer together, for I see you from behind my back.'",
      "usc_msa_ref": "687",
      "chain": [
        "30300",
        "20389",
        "20320",
        "11279",
        "19"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-936",
      "hadith_no": "936",
      "source": "Sahih Bukhari",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا معاوية بن عمرو، قال حدثنا زائدة، عن حصين، عن سالم بن أبي الجعد، قال حدثنا جابر بن عبد الله، قال بينما نحن نصلي مع النبي صلى الله عليه وسلم إذ أقبلت عير تحمل طعاما، فالتفتوا إليها حتى ما بقي مع النبي صلى الله عليه وسلم إلا اثنا عشر رجلا، فنزلت هذه الآية ‏{‏وإذا رأوا تجارة أو لهوا انفضوا إليها وتركوك قائما‏}‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     While we were praying (Jumua Khutba & prayer) with the Prophet (p.b.u.h), some camels loaded with food, arrived (from Sham). The people diverted their attention towards the camels (and left the mosque), and only twelve persons remained with the Prophet. So this verse was revealed: \"But when they see Some bargain or some amusement, They disperse headlong to it, And leave you standing.\" (62.11)",
      "usc_msa_ref": "58",
      "chain": [
        "20389",
        "20320",
        "15097",
        "11342",
        "34"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-1953",
      "hadith_no": "1953",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن عبد الرحيم، حدثنا معاوية بن عمرو، حدثنا زائدة، عن الأعمش، عن مسلم البطين، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله إن أمي ماتت، وعليها صوم شهر، أفأقضيه عنها قال ‏\"‏ نعم  قال  فدين الله أحق أن يقضى ‏\"‏‏.‏ قال سليمان فقال الحكم وسلمة، ونحن جميعا جلوس حين حدث مسلم بهذا الحديث  قالا  سمعنا مجاهدا يذكر هذا عن ابن عباس‏.‏ ويذكر عن أبي خالد، حدثنا الأعمش، عن الحكم، ومسلم البطين، وسلمة بن كهيل، عن سعيد بن جبير، وعطاء، ومجاهد، عن ابن عباس، قالت امرأة للنبي صلى الله عليه وسلم إن أختي ماتت‏.‏ وقال يحيى وأبو معاوية حدثنا الأعمش عن مسلم عن سعيد عن ابن عباس قالت امرأة للنبي صلى الله عليه وسلم إن أمي ماتت‏.‏ وقال عبيد الله عن زيد بن أبي أنيسة عن الحكم عن سعيد بن جبير عن ابن عباس قالت امرأة للنبي صلى الله عليه وسلم إن أمي ماتت وعليها صوم نذر‏.‏ وقال أبو حريز حدثنا عكرمة عن ابن عباس قالت امرأة للنبي صلى الله عليه وسلم ماتت أمي وعليها صوم خمسة عشر يوما‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A man came to the Prophet and said, \"O Allah's Apostle! My mother died and she ought to have fasted one month (for her missed Ramadan). Shall I fast on her behalf?\" The Prophet replied in the affirmative and said, \"Allah's debts have more right to be paid.\" In another narration a woman is reported to have said, \"My sister died...\" Narrated Ibn `Abbas: A woman said to the Prophet \"My mother died and she had vowed to fast but she didn't fast.\" In another narration Ibn `Abbas is reported to have said, \"A woman said to the Prophet, \"My mother died while she ought to have fasted for fifteen days.\"",
      "usc_msa_ref": "",
      "chain": [
        "30272",
        "20389",
        "20320",
        "11060",
        "11393",
        "11050",
        "17"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2795",
      "hadith_no": "2795",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، عن حميد، قال سمعت أنس بن مالك  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ ما من عبد يموت له عند الله خير، يسره أن يرجع إلى الدنيا، وأن له الدنيا وما فيها، إلا الشهيد، لما يرى من فضل الشهادة، فإنه يسره أن يرجع إلى الدنيا فيقتل مرة أخرى ‏\"‏‏.‏",
      "text_en": "      Narrated Anas bin Malik:                          The Prophet said, \"Nobody who dies and finds good from Allah (in the      Hereafter) would wish to come back to this world even if he were given     the whole world and whatever is in it, except the martyr who, on      seeing the superiority of martyrdom, would like to come back to the      world and get killed again (in Allah's Cause).\"",
      "usc_msa_ref": "",
      "chain": [
        "30351",
        "20389",
        "11049",
        "11279",
        "19"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2818",
      "hadith_no": "2818",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، عن موسى بن عقبة، عن سالم أبي النضر، مولى عمر بن عبيد الله وكان كاتبه قال كتب إليه عبد الله بن أبي أوفى  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ واعلموا أن الجنة تحت ظلال السيوف ‏\"‏‏.‏ تابعه الأويسي عن ابن أبي الزناد عن موسى بن عقبة‏.‏",
      "text_en": " Narrated `Abdullah bin Abi `Aufa:                     Allah's Apostle said, \"Know that Paradise is under the shades of swords.\"",
      "usc_msa_ref": "73",
      "chain": [
        "30351",
        "20389",
        "11049",
        "11106",
        "11164"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2833",
      "hadith_no": "2833",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، عن موسى بن عقبة، عن سالم أبي النضر، أن عبد الله بن أبي أوفى، كتب فقرأته أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا لقيتموهم فاصبروا ‏\"‏‏.‏",
      "text_en": " Narrated Salim Abu-An-Nadr:                     `Abdullah bin Abi `Aufa wrote and I read what he wrote that Allah's Apostle said, \"When you face them ( i.e. your enemy) then be patient.\"",
      "usc_msa_ref": "86",
      "chain": [
        "30351",
        "20389",
        "11049",
        "11106",
        "11164"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2834",
      "hadith_no": "2834",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، عن حميد، قال سمعت أنسا  رضى الله عنه  يقول خرج رسول الله صلى الله عليه وسلم إلى الخندق فإذا المهاجرون والأنصار يحفرون في غداة باردة، فلم يكن لهم عبيد يعملون ذلك لهم، فلما رأى ما بهم من النصب والجوع قال اللهم إن العيش عيش الآخره فاغفر للأنصار والمهاجره‏.‏ فقالوا مجيبين له نحن الذين بايعوا محمدا على الجهاد ما بقينا أبدا",
      "text_en": " Narrated Anas:                     Allah's Apostle went towards the Khandaq (i.e. Trench) and saw the Emigrants and the Ansar digging in a very cold morning as they did not have slaves to do that for them. When he noticed their fatigue and hunger he said, \"O Allah! The real life is that of the Here-after, (so please) forgive the Ansar and the Emigrants.\" In its reply the Emigrants and the Ansar said, \"We are those who have given a pledge of allegiance to Muhammad that we will carry on Jihad as long as we live.\"",
      "usc_msa_ref": "87",
      "chain": [
        "30351",
        "20389",
        "11049",
        "11279",
        "19"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2877",
      "hadith_no": "2877",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، عن عبد الله بن عبد الرحمن الأنصاري، قال سمعت أنسا  رضى الله عنه  يقول دخل رسول الله صلى الله عليه وسلم على ابنة ملحان فاتكأ عندها، ثم ضحك فقالت لم تضحك يا رسول الله فقال ‏\"‏ ناس من أمتي يركبون البحر الأخضر في سبيل الله، مثلهم مثل الملوك على الأسرة ‏\"‏‏.‏ فقالت يا رسول الله، ادع الله أن يجعلني منهم‏.‏ قال ‏\"‏ اللهم اجعلها منهم ‏\"‏‏.‏ ثم عاد فضحك، فقالت له مثل أو مم ذلك فقال لها مثل ذلك، فقالت ادع الله أن يجعلني منهم‏.‏ قال ‏\"‏ أنت من الأولين، ولست من الآخرين ‏\"‏‏.‏ قال قال أنس فتزوجت عبادة بن الصامت، فركبت البحر مع بنت قرظة، فلما قفلت ركبت دابتها فوقصت بها، فسقطت عنها فماتت‏.‏",
      "text_en": " Narrated Anas:                     Allah's Apostle went to the daughter of Milhan and reclined there (and slept) and then (woke up) smiling. She asked, \"O Allah's Apostle! What makes you smile?\" He replied, (I dreamt that) some people amongst my followers were sailing on the green sea in Allah's Cause, resembling kings on thrones.\" She said, \"O Allah's Apostle! Invoke Allah to make me one of them.\" He said, \"O Allah! Let her be one of them.\" Then he (slept again and woke up and) smiled. She asked him the same question and he gave the same reply. She said, \"Invoke Allah to make me one of them.\" He replied, ''You will be amongst the first group of them; you will not be amongst the last.\" Later on she married 'Ubada bin As-Samit and then she sailed on the sea with bint Qaraza, Mu'awiya's wife (for Jihad). On her return, she mounted her riding animal, which threw her down breaking her neck, and she died on falling down.",
      "usc_msa_ref": "129",
      "chain": [
        "30351",
        "20389",
        "11049",
        "19"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2943",
      "hadith_no": "2943",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، عن حميد، قال سمعت أنسا  رضى الله عنه  يقول كان رسول الله صلى الله عليه وسلم إذا غزا قوما لم يغر حتى يصبح، فإن سمع أذانا أمسك، وإن لم يسمع أذانا أغار بعد ما يصبح، فنزلنا خيبر ليلا‏.‏",
      "text_en": " Narrated Anas:                     Whenever Allah's Apostle attacked some people, he would never attack them till it was dawn. If he heard the Adhan (i.e. call for prayer) he would delay the fight, and if he did not hear the Adhan, he would attack them immediately after dawn. We reached Khaibar at night.",
      "usc_msa_ref": "193",
      "chain": [
        "30351",
        "20389",
        "11049",
        "11279",
        "19"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2966",
      "hadith_no": "2966",
      "source": "Sahih Bukhari",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، عن موسى بن عقبة، عن سالم أبي النضر، مولى عمر بن عبيد الله وكان كاتبا له قال كتب إليه عبد الله بن أبي أوفى  رضى الله عنهما  فقرأته أن رسول الله صلى الله عليه وسلم في بعض أيامه التي لقي فيها انتظر حتى مالت الشمس‏.‏   ثم قام في الناس قال ‏\"‏ أيها الناس، لا تتمنوا لقاء العدو، وسلوا الله العافية، فإذا لقيتموهم فاصبروا، واعلموا أن الجنة تحت ظلال السيوف، ثم قال اللهم منزل الكتاب ومجري السحاب وهازم الأحزاب، اهزمهم وانصرنا عليهم ‏\"‏‏.‏",
      "text_en": " Narrated Salim Abu An-Nadr:                     The freed slave of `Umar bin 'Ubaidullah who was `Umar's clerk: `Abdullah bin Abi `Aufa wrote him (i.e. `Umar) a letter that contained the following:-- \"Once Allah's Apostle (during a holy battle), waited till the sun had declined and then he got up among the people and said, \"O people! Do not wish to face the enemy (in a battle) and ask Allah to save you (from calamities) but if you should face the enemy, then be patient and let it be known to you that Paradise is under the shades of swords.\" He then said,, \"O Allah! The Revealer of the (Holy) Book, the Mover of the clouds, and Defeater of Al-Ahzab (i.e. the clans of infidels), defeat them infidels and bestow victory upon us.\"",
      "usc_msa_ref": "210",
      "chain": [
        "30351",
        "20389",
        "11049",
        "11106",
        "11164"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4031",
      "hadith_no": "4031",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، عن حميد، قال سمعت أنسا  رضى الله عنه  يقول أصيب حارثة يوم بدر وهو غلام، فجاءت أمه إلى النبي صلى الله عليه وسلم فقالت يا رسول الله، قد عرفت منزلة حارثة مني، فإن يكن في الجنة أصبر وأحتسب، وإن تك الأخرى ترى ما أصنع فقال ‏\"‏ ويحك أوهبلت أوجنة واحدة هي إنها جنان كثيرة، وإنه في جنة الفردوس ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Haritha was martyred on the day (of the battle) of Badr, and he was a young boy then. His mother came to the Prophet and said, \"O Allah's Apostle! You know how dear Haritha is to me. If he is in Paradise, I shall remain patient, and hope for reward from Allah, but if it is not so, then you shall see what I do?\" He said, \"May Allah be merciful to you! Have you lost your senses? Do you think there is only one Paradise? There are many Paradises and your son is in the (most superior) Paradise of Al- Firdaus.\"",
      "usc_msa_ref": "",
      "chain": [
        "30351",
        "20389",
        "11049",
        "11279",
        "19"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4149",
      "hadith_no": "4149",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، عن حميد، سمعت أنسا  رضى الله عنه  يقول خرج رسول الله صلى الله عليه وسلم إلى الخندق، فإذا المهاجرون والأنصار يحفرون في غداة باردة، فلم يكن لهم عبيد يعملون ذلك لهم، فلما رأى ما بهم من النصب والجوع قال ‏\"‏ اللهم إن العيش عيش الآخره فاغفر للأنصار والمهاجره ‏\"‏ فقالوا مجيبين له نحن الذين بايعوا محمدا على الجهاد ما بقينا أبدا",
      "text_en": " Narrated Anas:                     Allah's Apostle went out towards the Khandaq (i.e. Trench) and saw the Emigrants and the Ansar digging the trench in the cold morning. They had no slaves to do that (work) for them. When the Prophet saw their hardship and hunger, he said, 'O Allah! The real life is the life of the Hereafter, so please forgive Ansar and the Emigrants.\" They said in reply to him, \"We are those who have given the Pledge of allegiances to Muhammad for to observe Jihad as long as we live.\"",
      "usc_msa_ref": "425",
      "chain": [
        "30351",
        "20389",
        "11049",
        "11279",
        "19"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4281",
      "hadith_no": "4281",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، عن مالك بن أنس، قال حدثني ثور، قال حدثني سالم، مولى ابن مطيع أنه سمع أبا هريرة  رضى الله عنه  يقول افتتحنا خيبر، ولم نغنم ذهبا ولا فضة، إنما غنمنا البقر والإبل والمتاع والحوائط، ثم انصرفنا مع رسول الله صلى الله عليه وسلم إلى وادي القرى، ومعه عبد له يقال له مدعم، أهداه له أحد بني الضباب، فبينما هو يحط رحل رسول الله صلى الله عليه وسلم إذ جاءه سهم عائر حتى أصاب ذلك العبد، فقال الناس هنيئا له الشهادة‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ بلى والذي نفسي بيده، إن الشملة التي أصابها يوم خيبر من المغانم لم تصبها المقاسم لتشتعل عليه نارا ‏\"‏‏.‏ فجاء رجل حين سمع ذلك من النبي صلى الله عليه وسلم بشراك أو بشراكين، فقال هذا شىء كنت أصبته‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ شراك أو شراكان من نار ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     When we conquered Khaibar, we gained neither gold nor silver as booty, but we gained cows, camels, goods and gardens. Then we departed with Allah's Apostle to the valley of Al-Qira, and at that time Allah's Apostle had a slave called Mid`am who had been presented to him by one of Banu Ad-Dibbab. While the slave was dismounting the saddle of Allah's Apostle an arrow the thrower of which was unknown, came and hit him. The people said, \"Congratulations to him for the martyrdom.\" Allah's Apostle said, \"No, by Him in Whose Hand my soul is, the sheet (of cloth) which he had taken (illegally) on the day of Khaibar from the booty before the distribution of the booty, has become a flame of Fire burning him.\" On hearing that, a man brought one or two leather straps of shoes to the Prophet and said, \"These are things I took (illegally).\" On that Allah's Apostle said, \"This is a strap, or these are two straps of Fire.\"",
      "usc_msa_ref": "541",
      "chain": [
        "30351",
        "20389",
        "11049",
        "20001",
        "11155",
        "13"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6630",
      "hadith_no": "6630",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، عن حميد، قال سمعت أنسا، يقول أصيب حارثة يوم بدر وهو غلام، فجاءت أمه إلى النبي صلى الله عليه وسلم فقالت يا رسول الله قد عرفت منزلة حارثة مني، فإن يك في الجنة أصبر وأحتسب، وإن تكن الأخرى ترى ما أصنع‏.‏ فقال ‏\"‏ ويحك  أوهبلت  أوجنة واحدة هي جنان كثيرة، وإنه لفي جنة الفردوس ‏\"‏‏.‏",
      "text_en": "      Narrated Anas:                          Haritha was martyred on the day (of the battle) of Badr while he was      young. His mother came to the Prophet saying, \"O Allah's Apostle! You      know the relation of Haritha to me (how fond of him I was); so, if he      is in Paradise, I will remain patient and wish for Allah's reward, but     if he is not there, then you will see what I will do.\" The Prophet      replied, \"May Allah be merciful upon you! Have you gone mad? (Do you      think) it is one Paradise? There are many Paradises and he is in the      (most superior) Paradise of Al-Firdaus.\"",
      "usc_msa_ref": "558",
      "chain": [
        "30351",
        "20389",
        "11049",
        "11279",
        "19"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-7323",
      "hadith_no": "7323",
      "source": "Sahih Bukhari",
      "chapter": "Wishes - كتاب التمنى",
      "chapter_no": "95",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، عن موسى بن عقبة، عن سالم أبي النضر، مولى عمر بن عبيد الله  وكان كاتبا له  قال كتب إليه عبد الله بن أبي أوفى فقرأته فإذا فيه أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تتمنوا لقاء العدو، وسلوا الله العافية ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Abi `Aufa:                     Allah's Apostle said, \"Do not long for meeting your enemy, and ask Allah for safety (from all sorts of evil).\" (See Hadith No. 266, Vol. 4)",
      "usc_msa_ref": "343",
      "chain": [
        "30351",
        "20389",
        "11049",
        "11106",
        "11164"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-muslim-526",
      "hadith_no": "526",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني عمرو الناقد، حدثنا معاوية بن عمرو، حدثنا زائدة، حدثنا عبد الله بن ذكوان، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم نحو هذا ‏.‏",
      "text_en": " This hadith is narrated from the Apostle (may peace be upon him) by another chain of narrators, 'Amr al-Naqid, Mu'awiya b. 'Amr, Abdullah b. Dhakwan, A'raj on the authority of Abu Huraira.",
      "usc_msa_ref": "",
      "chain": [
        "30263",
        "20389",
        "20320",
        "11197",
        "13"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-316-5",
      "hadith_no": "316",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثناه عمرو الناقد، حدثنا معاوية بن عمرو، حدثنا زائدة، عن هشام، قال أخبرني عروة، عن عائشة، أن رسول الله صلى الله عليه وسلم كان إذا اغتسل من الجنابة بدأ فغسل يديه قبل أن يدخل يده في الإناء ثم توضأ مثل وضوئه للصلاة ‏.‏",
      "text_en": " 'Urwa has narrated it on the authority of 'A'isha that when Allah's Messenger (may peace be upon him) took a bath because of sexual intercourse, he first washed his hands before dipping one of them into the basin, and then performed ablu- tion as is done for prayer.",
      "usc_msa_ref": "",
      "chain": [
        "30263",
        "20389",
        "20320",
        "11065",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-360-3",
      "hadith_no": "360",
      "source": "Sahih Muslim",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا معاوية بن عمرو، حدثنا زائدة، عن سماك، ح وحدثني القاسم بن زكرياء، حدثنا عبيد الله بن موسى، عن شيبان، عن عثمان بن عبد الله بن موهب، وأشعث بن أبي الشعثاء، كلهم عن جعفر بن أبي ثور، عن جابر بن سمرة، عن النبي صلى الله عليه وسلم بمثل حديث أبي كامل عن أبي عوانة ‏.‏",
      "text_en": " This hadith is also narrated by another chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20389",
        "20320",
        "10770",
        "20340",
        "20240",
        "11524",
        "10896",
        "393"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2169",
      "hadith_no": "2169",
      "source": "Sahih Muslim",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثني زهير بن حرب، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق الفزاري، عن خالد الحذاء، عن أبي قلابة، عن قبيصة بن ذؤيب، عن أم سلمة، قالت دخل رسول الله صلى الله عليه وسلم على أبي سلمة وقد شق بصره فأغمضه ثم قال ‏\"‏ إن الروح إذا قبض تبعه البصر ‏\"‏ ‏.‏ فضج ناس من أهله فقال ‏\"‏ لا تدعوا على أنفسكم إلا بخير فإن الملائكة يؤمنون على ما تقولون ‏\"‏ ‏.‏ ثم قال ‏\"‏ اللهم اغفر لأبي سلمة وارفع درجته في المهديين واخلفه في عقبه في الغابرين واغفر لنا وله يا رب العالمين وافسح له في قبره ‏.‏ ونور له فيه ‏\"‏ ‏.‏",
      "text_en": " Umm Salama reported:                      The Messenger of Allah (may peace be upon came to Abu Salama (as he died). His eyes were fixedly open. He closed them, and then said: When the soul is taken away the sight follows it. Some of the people of his family wept and wailed. So he said: Do not supplicate for yourselves anything but good, for angels say\" Amen\" to what you say. He then said: O Allah, forgive Abu Salama, raise his degree among those who are rightly guided, grant him a successor in his descendants who remain. Forgive us and him, O Lord of the Universe, and make his grave spacious, and grant him light in it.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20389",
        "20405",
        "11282",
        "11047",
        "56"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-2721",
      "hadith_no": "2721",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا يحيى بن سعيد القطان، عن معاوية بن عمرو، حدثني الحكم بن الأعرج، قال سألت ابن عباس - رضى الله عنهما - وهو متوسد رداءه عند زمزم عن صوم عاشوراء ‏.‏ بمثل حديث حاجب بن عمر ‏.‏",
      "text_en": " Hakam b. 'Araj reported:                      I asked Ibn Abbas (Allah be pleased with them) as he was reclining using his cloak as a pillow near Zamzam about fasting on 'Ashura. The rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "38487",
        "20031",
        "20389",
        "10677",
        "17"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6670",
      "hadith_no": "6670",
      "source": "Sahih Muslim",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو كريب، أخبرنا ابن بشر، عن مسعر، ح وحدثني محمد بن حاتم، حدثنا  معاوية بن عمرو، عن أبي إسحاق، ح وحدثني القاسم بن زكرياء، حدثنا حسين بن علي، الجعفي عن زائدة، كلاهما عن الأعمش، جميعا عن حبيب، بهذا الإسناد مثله ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20359",
        "38487",
        "20389",
        "11049",
        "20315"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-168",
      "hadith_no": "168",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا نصر بن المهاجر، حدثنا معاوية بن عمرو، حدثنا زائدة، عن منصور، عن مجاهد، عن الحكم، أو ابن الحكم عن أبيه، أن رسول الله صلى الله عليه وسلم بال ثم توضأ ونضح فرجه ‏.‏",
      "text_en": " Hakam or Ibn al-Hakam on the authority of his father reported:                      The Prophet (ﷺ) urinated; then he performed ablution and sprinkled water on the private parts of his body.",
      "usc_msa_ref": "",
      "chain": [
        "20389",
        "20320",
        "11067",
        "11028"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-1192",
      "hadith_no": "1192",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا زهير بن حرب، حدثنا معاوية بن عمرو، حدثنا زائدة، عن هشام، عن فاطمة، عن أسماء، قالت كان النبي صلى الله عليه وسلم يأمر بالعتاقة في صلاة الكسوف ‏.‏",
      "text_en": " Narrated Asma:                     The Prophet (peace be upon him) used to command us to free slaves on the occasion of an eclipse",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20389",
        "20320",
        "11065",
        "10526",
        "70"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-abi-daud-5114",
      "hadith_no": "5114",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا حجاج بن أبي يعقوب، حدثنا معاوية، - يعني ابن عمرو - حدثنا زائدة، عن الأعمش، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من تولى قوما بغير إذن مواليه فعليه لعنة الله والملائكة والناس أجمعين لا يقبل منه يوم القيامة عدل ولا صرف ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Prophet (May peace be upon him) as saying :                      if a man becomes the client of any people without the permission of his patrons (i.e. those who have freed him), on him will be the curse of Allah, of angels and of all people; no obligatory or supererogatory worship will be accepted from him.",
      "usc_msa_ref": "",
      "chain": [
        "20389",
        "20320",
        "11060",
        "11161",
        "13"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-3365",
      "hadith_no": "3365",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، أخبرني معاوية بن عمرو، عن زائدة، عن الأعمش، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لم تحل الغنائم لأحد سود الرءوس من قبلكم كانت تنزل نار من السماء فتأكلها ‏\"‏ ‏.‏ قال سليمان الأعمش فمن يقول هذا إلا أبو هريرة الآن فلما كان يوم بدر وقعوا في الغنائم قبل أن تحل لهم فأنزل الله تعالى ‏:‏ ‏(‏لولا كتاب من الله سبق لمسكم فيما أخذتم عذاب عظيم ‏)‏ قال أبو عيسى هذا حديث حسن صحيح غريب من حديث الأعمش ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     that the Prophet (ﷺ) said: \"None of the black heads (meaning the Children of Adam since (most of) their heads are black) before you partook of spoils of war, but fire from the heavens would be sent down upon them, consuming them.\" Sulaiman (one of the narrators) said \"No one says this except for Abu Hurairah now. \"So on the day of Badr when they had the spoils of war before it was made lawful for them, Allah [Most High] revealed: Were it not a previous ordainment from Allah, a severe torment would have touched you for what you took.\"",
      "usc_msa_ref": "",
      "chain": [
        "30553",
        "20389",
        "20320",
        "11060",
        "11161",
        "13"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-3497",
      "hadith_no": "3497",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الحسين بن حريث، حدثنا معاوية بن عمرو، عن أبي إسحاق الفزاري، عن سفيان الثوري، عن حبيب بن أبي عمرة، عن سعيد بن جبير، عن ابن عباس، في قول الله تعالى ‏:‏ ‏(‏ الم * غلبت الروم * في أدنى الأرض ‏)‏ قال غلبت وغلبت كان المشركون يحبون أن يظهر أهل فارس على الروم لأنهم وإياهم أهل أوثان وكان المسلمون يحبون أن يظهر الروم على فارس لأنهم أهل كتاب فذكروه لأبي بكر فذكره أبو بكر لرسول الله صلى الله عليه وسلم قال ‏\"‏ أما إنهم سيغلبون ‏\"‏ ‏.‏ فذكره أبو بكر لهم فقالوا اجعل بيننا وبينك أجلا فإن ظهرنا كان لنا كذا وكذا وإن ظهرتم كان لكم كذا وكذا فجعل أجل خمس سنين فلم يظهروا فذكروا ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ ألا جعلته إلى دون - قال أراه العشر ‏\"‏ ‏.‏ قال سعيد والبضع ما دون العشر قال ثم ظهرت الروم بعد ‏.‏ قال فذلك قوله تعالى ‏:‏ ‏(‏ الم * غلبت الروم ‏)‏ إلى قوله ‏:‏ ‏(‏يفرح المؤمنون * بنصر الله ينصر من يشاء ‏)‏ قال سفيان سمعت أنهم ظهروا عليهم يوم بدر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب إنما نعرفه من حديث سفيان الثوري عن حبيب بن أبي عمرة ‏.‏",
      "text_en": " Narrated Sa'eed bin Jubair:                     from Ibn 'Abbas, regarding the saying of Allah, Most High: Alif Lam Mim. The Romans have been defeated. In the nearest land (30:1-3)\" he said: \"Ghulibat wa Ghalabat (defeated and then victorious).\" He said: \"The idolaters wanted the Persians to be victorious over the Romans because they too were people who worshiped idols, while the Muslims wanted the Romans to be victorious over the Persians because they were people of the Book. This was mentioned to Abu Bakr, so Abu Bakr mentioned that to the Messenger of Allah (ﷺ) and he said: 'They will certainly prevail.' Abu Bakr mentioned that to them, and they said: 'Make a wager between us and you; if we win, we shall get this and that, and if you win, you shall get this or that.' He made the term five years, but they (the Romans) were not victorious. They mentioned that to the Prophet (ﷺ) and he said: \"Why did you not make it less (than)\" - He (one of the narrators said): I think he said: \"ten?\" He said: Sa'eed said: \"Al-Bid' is what is less than then\" - he said: \"Afterwards the Romans have been victorious.\" He said: \"That is what Allah Most High said: 'Alif Lam Mim. The Romans have been defeated' up to His saying: 'And on the day, the believers will rejoice - with the help of Allah. He helps whom He wills (30:1-5).' Sufyan said: \"I heard that they were victorious over them on the Day of Badr.\"",
      "usc_msa_ref": "",
      "chain": [
        "30325",
        "20389",
        "20405",
        "20012",
        "14069",
        "11050"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-4109",
      "hadith_no": "4109",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا معاوية بن عمرو، حدثنا زائدة، عن عاصم، عن زر، عن علي بن أبي طالب، رضى الله عنه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن لكل نبي حواريا وإن حواري الزبير بن العوام ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏ ويقال الحواري هو الناصر ‏.‏ سمعت ابن أبي عمر يقول قال سفيان بن عيينة الحواري هو الناصر ‏.‏",
      "text_en": " Narrated 'Ali bin Abi Talib [may Allah be pleased with him]:                     that the Messenger of Allah (ﷺ) said: \"Indeed, every Prophet has a Hawari, and my Hawari is Az-Zubair bin Al-'Awwam.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20389",
        "20320",
        "11080",
        "11337",
        "5"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-4191",
      "hadith_no": "4191",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا معاوية بن عمرو الأزدي، حدثنا زائدة، عن بيان، عن قيس بن أبي حازم، عن جرير بن عبد الله، قال ما حجبني رسول الله صلى الله عليه وسلم منذ أسلمت ولا رآني إلا ضحك ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Jarir bin 'Abdullah:                     \"The Messenger of Allah (ﷺ) never screened me since I accepted Islam, nor did he look at me except that he laughed.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20389",
        "20320",
        "11326",
        "11046",
        "4057"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-4192",
      "hadith_no": "4192",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا معاوية بن عمرو، حدثنا زائدة، عن إسماعيل بن أبي خالد، عن قيس، عن جرير، قال ما حجبني رسول الله صلى الله عليه وسلم منذ أسلمت ولا رآني إلا تبسم ‏.‏ قال هذا حديث حسن ‏.‏",
      "text_en": " Narrated Jarir:                     \"The Messenger of Allah (ﷺ) never screened me since I accepted Islam, nor did he look at me except that he smiled.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20389",
        "20320",
        "11418",
        "11046",
        "4057"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-4258",
      "hadith_no": "4258",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا القاسم بن دينار الكوفي، حدثنا معاوية بن عمرو، عن زائدة، عن عبد الملك بن عمير، عن موسى بن طلحة، قال ما رأيت أحدا أفصح من عائشة ‏.‏ قال هذا حديث حسن صحيح غريب ‏.‏",
      "text_en": " Narrated Musa bin Talhah:                     \"I have not seen anyone clearer (in speech) than 'Aishah.\"",
      "usc_msa_ref": "",
      "chain": [
        "20389",
        "20320",
        "11368",
        "579"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-863",
      "hadith_no": "863",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Leading the Prayer (Al-Imamah) - كتاب الإمامة",
      "chapter_no": "10",
      "text_ar": "أخبرنا هارون بن عبد الله، قال حدثنا معاوية بن عمرو، قال حدثنا أبو إسحاق، عن ابن جريج، قال أخبرني منبوذ، - رجل من آل أبي رافع - عن الفضل بن عبيد الله بن أبي رافع، عن أبي رافع، نحوه ‏.‏",
      "text_en": " (Another chain) with similar from  Abu Rafi.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20389",
        "11049",
        "11070",
        "479"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3598",
      "hadith_no": "3598",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Endowments - كتاب الإحباس",
      "chapter_no": "29",
      "text_ar": "أخبرني هارون بن عبد الله، قال حدثنا معاوية بن عمرو، عن أبي إسحاق الفزاري، عن ابن عون، عن نافع، عن ابن عمر، عن عمر، رضى الله عنه عن النبي صلى الله عليه وسلم نحوه ‏.‏",
      "text_en": " A similar report was narrated from Abu Ishaq Al-Fazari, from (Ayyub) bin 'Awn, from Nafi', from Ibn 'Umar, from 'Umar, may Allah be pleased with him, from the Prophet.",
      "usc_msa_ref": "",
      "chain": [
        "30524",
        "20389",
        "20405",
        "11071",
        "11014",
        "18",
        "3"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-5670",
      "hadith_no": "5670",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا القاسم بن زكريا بن دينار، قال حدثنا معاوية بن عمرو، حدثنا أبو إسحاق، قال حدثنا الأوزاعي، قال حدثني ربيعة بن يزيد، ح وأخبرني عمرو بن عثمان بن سعيد، عن بقية، عن أبي عمرو، - وهو الأوزاعي - عن ربيعة بن يزيد، عن عبد الله بن الديلمي، قال دخلت على عبد الله بن عمرو بن العاص وهو في حائط له بالطائف يقال له الوهط وهو مخاصر فتى من قريش يزن ذلك الفتى بشرب الخمر فقال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من شرب الخمر شربة لم تقبل له توبة أربعين صباحا فإن تاب تاب الله عليه فإن عاد لم تقبل توبته أربعين صباحا فإن تاب تاب الله عليه فإن عاد كان حقا على الله أن يسقيه من طينة الخبال يوم القيامة ‏\"‏ ‏.‏ اللفظ لعمرو ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Ad-Dailami said:                     \"I entered upon 'Abdullah bin 'Amr bin Al-'As when he was in a garden of his in At-Ta'if called Al-Waht. He was walking and holding hands with a young man of Quraish who was suspected of drinking Khamr. He said: 'I heard the Messenger of Allah [SAW] say: Whoever drinks Khamr once, his repentance will not be accepted for 40 days, then if he repents, Allah will accept his repentance. If he does it again, his repentance will not be accepted for 40 days, then if he repents, Allah will accept his repentance. If he does it again, his repentance will not be accepted for 40 days, then if he repents, Allah will accept his repentance. If he does it again (a fourth time), then it is a right upon Allah to make him drink from the mud of Khibal on the Day of Resurrection.\" This is the wording of 'Amr.",
      "usc_msa_ref": "",
      "chain": [
        "30475",
        "20389",
        "11049",
        "20024",
        "11414",
        "10581",
        "20644",
        "11414",
        "5136"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-1521",
      "hadith_no": "1521",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا إسماعيل بن أسد، حدثنا معاوية بن عمرو، حدثنا أبو إسحاق الفزاري، عن خالد الحذاء، عن أبي قلابة، عن قبيصة بن ذؤيب، عن أم سلمة، قالت دخل رسول الله  صلى الله عليه وسلم  على أبي سلمة وقد شق بصره فأغمضه ثم قال ‏\"‏ إن الروح إذا قبض تبعه البصر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Umm Salamah said:                      “The Messenger of Allah (ﷺ)entered upon Abu Salamah (after he had died), and his eyes were wideopen. He closed his eyes, then he said: ‘When the soul is taken,thesight follows it.’”",
      "usc_msa_ref": "",
      "chain": [
        "20389",
        "20405",
        "11282",
        "11047",
        "56"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    },
    {
      "id": "sunan-ibn-majah-3469",
      "hadith_no": "3469",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا معاوية بن عمرو، حدثنا زائدة، عن منصور، عن إبراهيم، عن الأسود، عن عائشة، قالت ما شبع آل محمد  صلى الله عليه وسلم  منذ قدموا المدينة ثلاث ليال تباعا من خبز بر حتى توفي  صلى الله عليه وسلم  ‏.‏",
      "text_en": " it wasnarrated that ‘Aishah said:                      “The family of Muhammad (ﷺ)neverate their fill of wheat bread for three nights in a row, fromthetime they came to Al-Madinah until he passed away.”",
      "usc_msa_ref": "",
      "chain": [
        "11222",
        "20389",
        "20320",
        "11067",
        "11051",
        "11054",
        "53"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 35,
  "grade_display": {
    "en": "Successor (Taba' Tabi') [9th Generation]",
    "ar": "تابع التابعين [الجيل التاسع]",
    "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی نۆیەم]"
  }
}