{
  "id": "20387",
  "name": "'Ali bin Hujr bin Iyas bin Maqatil علي بن حجر بن إياس بن مقاتل",
  "full_name": "'Ali bin Hujr bin Iyas bin Maqatil علي بن حجر بن إياس بن مقاتل",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "154",
      "date_gregorian": "NA",
      "date_display": [
        "154 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "244",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Baghdad",
      "Merv"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ خ  م  ت  س  -  ثقة حافظ ]"
    ],
    "tags": [
      "al-Sa'di",
      "Baghdad",
      "Merv"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20584",
      "name": "Khlf bin Khlyfh خلف بن خليفة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20155",
      "name": "Isma'il bin Ja'far bin Abi Kathir إسماعيل بن جعفر بن أبي كثير الأنصاري",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20028",
      "name": "Jarir bin 'Abdul Hameed al-Razi جرير بن عبد الحميد أبو عبد الله الضبي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20167",
      "name": "'Abdul 'Aziz bin Muhammad al-Daruradi عبد العزيز بن محمد الدراوردي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20445",
      "name": "'Ubaidullah bin 'Amr bin Abi Walid عبيد الله بن عمرو بن أبي الوليد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20452",
      "name": "al-Fadl bin Musa al-Synany الفضل بن موسى السيناني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20345",
      "name": "'Ali bin Ms'hr علي بن مسهر",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20644",
      "name": "Baqiyya bin al-Walid bin Sa'aid بقية بن الوليد بن صائد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20736",
      "name": "Isma'il bin Ayyash bin Saleem إسماعيل بن عياش بن سليم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20324",
      "name": "Sa'id bin Yahya bin Salah, Sa'dan سعيد بن يحيى بن صالح سعدان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20639",
      "name": "'Abdullah bin 'Abdur Rahman bin Yazid عبد الله بن عبد الرحمن بن يزيد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20165",
      "name": "'Abdul 'Aziz bin Abi Hazim عبد العزيز بن أبي حازم",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20446",
      "name": "'Atab bin Bashayr عتاب بن بشير",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30003",
      "name": "Imam Muslim أبو الحسين مسلم بن الحجاج بن مسلم",
      "grade": "3rd Century AH [Shafi'ee]"
    },
    {
      "id": "30005",
      "name": "Imam Tirmidhi الترمذي محمد بن عيسى بن سورة",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "30006",
      "name": "Imam Nasa'i أحمد بن شعيب بن علي بن سنان النسائي",
      "grade": "3rd Century AH [12th generation]"
    },
    {
      "id": "38032",
      "name": "Ahmed bin Abi al-Hawari أحمد بن عبد الله بن ميمون",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "5244",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا سليمان بن عبد الرحمن، وعلي بن حجر، قالا أخبرنا عيسى بن يونس، حدثنا هشام بن عروة، عن عبد الله بن عروة، عن عروة، عن عائشة، قالت جلس إحدى عشرة امرأة، فتعاهدن وتعاقدن أن لا يكتمن من أخبار أزواجهن شيئا‏.‏ قالت الأولى زوجي لحم جمل، غث على رأس جبل، لا سهل فيرتقى، ولا سمين فينتقل‏.‏ قالت الثانية زوجي لا أبث خبره، إني أخاف أن لا أذره، إن أذكره أذكر عجره وبجره‏.‏ قالت الثالثة زوجي العشنق، إن أنطق أطلق وإن أسكت أعلق‏.‏ قالت الرابعة زوجي كليل تهامة، لا حر، ولا قر، ولا مخافة، ولا سآمة‏.‏ قالت الخامسة زوجي إن دخل فهد، وإن خرج أسد، ولا يسأل عما عهد‏.‏ قالت السادسة زوجي إن أكل لف، وإن شرب اشتف، وإن اضطجع التف، ولا يولج الكف ليعلم البث، قالت السابعة زوجي غياياء أو عياياء طباقاء، كل داء له داء، شجك أو فلك أو جمع كلا لك‏.‏ قالت الثامنة زوجي المس مس أرنب، والريح ريح زرنب‏.‏ قالت التاسعة زوجي رفيع العماد، طويل النجاد، عظيم الرماد، قريب البيت من الناد‏.‏ قالت العاشرة زوجي مالك وما مالك، مالك خير من ذلك، له إبل كثيرات المبارك قليلات المسارح، وإذا سمعن صوت المزهر أيقن أنهن هوالك‏.‏ قالت الحادية عشرة زوجي أبو زرع فما أبو زرع أناس من حلي أذنى، وملأ من شحم عضدى، وبجحني فبجحت إلى نفسي، وجدني في أهل غنيمة بشق، فجعلني في أهل صهيل وأطيط ودائس ومنق، فعنده أقول فلا أقبح وأرقد فأتصبح، وأشرب فأتقنح، أم أبي زرع فما أم أبي زرع عكومها رداح، وبيتها فساح، ابن أبي زرع، فما ابن أبي زرع مضجعه كمسل شطبة، ويشبعه ذراع الجفرة، بنت أبي زرع فما بنت أبي زرع طوع أبيها، وطوع أمها، وملء كسائها، وغيظ جارتها، جارية أبي زرع، فما جارية أبي زرع لا تبث حديثنا تبثيثا، ولا تنقث ميرتنا تنقيثا، ولا تملأ بيتنا تعشيشا، قالت خرج أبو زرع والأوطاب تمخض، فلقي امرأة معها ولدان لها كالفهدين يلعبان من تحت خصرها برمانتين، فطلقني ونكحها، فنكحت بعده رجلا سريا، ركب شريا وأخذ خطيا وأراح على نعما ثريا، وأعطاني من كل رائحة زوجا وقال كلي أم زرع، وميري أهلك‏.‏ قالت فلو جمعت كل شىء أعطانيه ما بلغ أصغر آنية أبي زرع‏.‏ قالت عائشة قال رسول الله صلى الله عليه وسلم ‏\"‏ كنت لك كأبي زرع لأم زرع ‏\"‏‏.‏ قال أبو عبد الله قال سعيد بن سلمة عن هشام ولا تعشش بيتنا تعشيشا‏.‏ قال أبو عبد الله قال بعضهم فأتقمح‏.‏ بالميم، وهذا أصح‏.‏",
      "text_en": " Narrated `Aisha:                     Eleven women sat (at a place) and promised and contracted that they would not conceal anything of the news of their husbands. The first one said, \"My husband is like the meat of a slim weak camel which is kept on the top of a mountain which is neither easy to climb, nor is the meat fat, so that one might put up with the trouble of fetching it.\" The second one said, \"I shall not relate my husband's news, for I fear that I may not be able to finish his story, for if I describe him, I will mention all his defects and bad traits.\" The third one said, \"My husband, the \"too-tall\"! if I describe him (and he hears of that) he will divorce me, and if I keep quiet, he will keep me hanging (neither divorcing me nor treating me as a wife).\" The fourth one said, \"My husband is (moderate in temper) like the night of Tihama: neither hot nor cold; I am neither afraid of him, nor am I discontented with him.\" The fifth one said, \"My husband, when entering (the house) is a leopard (sleeps a lot), and when going out, is a lion (boasts a lot). He does not ask about whatever is in the house.\" The sixth one said, \"If my husband eats, he eats too much (leaving the dishes empty), and if he drinks he leaves nothing; if he sleeps he sleeps he rolls himself (alone in our blankets); and he does not insert his palm to inquire about my feelings.\" The seventh one said, \"My husband is a wrong-doer or weak and foolish. All the defects are present in him. He may injure your head or your body or may do both.\" The eighth one said, \"My husband is soft to touch like a rabbit and smells like a Zarnab (a kind of good smelling grass).\" The ninth one said, \"My husband is a tall generous man wearing a long strap for carrying his sword. His ashes are abundant (i.e. generous to his guests) and his house is near to the people (who would easily consult him).\" The tenth one said, \"My husband is Malik (possessor), and what is Malik? Malik is greater than whatever I say about him. (He is beyond and above all praises which can come to my mind). Most of his camels are kept at home (ready to be slaughtered for the guests) and only a few are taken to the pastures. When the camels hear the sound of the lute (or the tambourine) they realize that they are going to be slaughtered for the guests.\" The eleventh one said, \"My husband is Abu Zar` and what is Abu Zar` (i.e., what should I say about him)? He has given me many ornaments and my ears are heavily loaded with them and my arms have become fat (i.e., I have become fat). And he has pleased me, and I have become so happy that I feel proud of myself. He found me with my family who were mere owners of sheep and living in poverty, and brought me to a respected family having horses and camels and threshing and purifying grain. Whatever I say, he does not rebuke or insult me. When I sleep, I sleep till late in the morning, and when I drink water (or milk), I drink my fill. The mother of Abu Zar and what may one say in praise of the mother of Abu Zar? Her saddle bags were always full of provision and her house was spacious. As for the son of Abu Zar, what may one say of the son of Abu Zar? His bed is as narrow as an unsheathed sword and an arm of a kid (of four months) satisfies his hunger. As for the daughter of Abu Zar, she is obedient to her father and to her mother. She has a fat well-built body and that arouses the jealousy of her husband's other wife. As for the (maid) slave girl of Abu Zar, what may one say of the (maid) slavegirl of Abu Zar? She does not uncover our secrets but keeps them, and does not waste our provisions and does not leave the rubbish scattered everywhere in our house.\" The eleventh lady added, \"One day it so happened that Abu Zar went out at the time when the milk was being milked from the animals, and he saw a woman who had two sons like two leopards playing with her two breasts. (On seeing her) he divorced me and married her. Thereafter I married a noble man who used to ride a fast tireless horse and keep a spear in his hand. He gave me many things, and also a pair of every kind of livestock and said, Eat (of this), O Um Zar, and give provision to your relatives.\" She added, \"Yet, all those things which my second husband gave me could not fill the smallest utensil of Abu Zar's.\" `Aisha then said: Allah's Apostle said to me, \"I am to you as Abu Zar was to his wife Um Zar.\"",
      "chain": [
        "30587",
        "20387",
        "20347",
        "11065",
        "11699",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6806",
      "source": " Sahih Bukhari ",
      "chapter": "Expiation for Unfulfilled Oaths - كتاب كفارات الأيمان",
      "chapter_no": "84",
      "text_ar": "حدثنا علي بن حجر، حدثنا إسماعيل بن إبراهيم، عن أيوب، عن القاسم التميمي، عن زهدم الجرمي، قال كنا عند أبي موسى وكان بيننا وبين هذا الحى من جرم إخاء ومعروف  قال  فقدم طعام  قال  وقدم في طعامه لحم دجاج  قال  وفي القوم رجل من بني تيم الله أحمر كأنه مولى  قال  فلم يدن فقال له أبو موسى ادن، فإني قد رأيت رسول الله صلى الله عليه وسلم يأكل منه‏.‏ قال إني رأيته يأكل شيئا قذرته، فحلفت أن لا أطعمه أبدا‏.‏ فقال ادن أخبرك عن ذلك، أتينا رسول الله صلى الله عليه وسلم في رهط من الأشعريين أستحمله، وهو يقسم نعما من نعم الصدقة  قال أيوب أحسبه قال وهو غضبان  قال ‏\"‏ والله لا أحملكم، وما عندي ما أحملكم ‏\"‏‏.‏ قال فانطلقنا فأتي رسول الله صلى الله عليه وسلم بنهب إبل، فقيل أين هؤلاء الأشعريون فأتينا فأمر لنا بخمس ذود غر الذرى، قال فاندفعنا فقلت لأصحابي أتينا رسول الله صلى الله عليه وسلم نستحمله، فحلف أن لا يحملنا، ثم أرسل إلينا فحملنا، نسي رسول الله صلى الله عليه وسلم يمينه، والله لئن تغفلنا رسول الله صلى الله عليه وسلم يمينه لا نفلح أبدا، ارجعوا بنا إلى رسول الله صلى الله عليه وسلم فلنذكره يمينه‏.‏ فرجعنا فقلنا يا رسول الله أتيناك نستحملك، فحلفت أن لا تحملنا ثم حملتنا فظننا  أو فعرفنا  أنك نسيت يمينك‏.‏ قال ‏\"‏ انطلقوا، فإنما حملكم الله، إني والله إن شاء الله لا أحلف على يمين، فأرى غيرها خيرا منها، إلا أتيت الذي هو خير وتحللتها ‏\"‏‏.‏ تابعه حماد بن زيد عن أيوب عن أبي قلابة والقاسم بن عاصم الكليبي‏.‏",
      "text_en": " Narrated Zahdam al-Jarmi:                     We were sitting with Abu Musa Al-Ash'sari, and as there were ties of friendship and mutual favors between us and his tribe. His meal was presented before him and there was chicken meat in it. Among those who were present there was a man from Bani Taimillah having a red complexion as a non-Arab freed slave, and that man did not approach the meal. Abu Musa said to him, \"Come along! I have seen Allah's Apostle eating of that (i.e., chicken).\" The man said, \"I have seen it (chickens) eating something I regarded as dirty, and so I have taken an oath that I shall not eat (its meat) chicken.\" Abu Musa said, \"Come along! I will inform you about it (i.e., your oath). Once we went to Allah's Apostle in company with a group of Ash'airiyin, asking him for mounts while he was distributing some camels from the camels of Zakat. (Aiyub said, \"I think he said that the Prophet was in an angry mood at the time.\") The Prophet said, 'By Allah! I will not give you mounts, and I have nothing to mount you on.' After we had left, some camels of booty were brought to Allah's Apostle and he said, \"Where are those Ash`ariyin? Where are those Ash`ariyin?\" So we went (to him) and he gave us five very fat good-looking camels. We mounted them and went away, and then I said to my companions, 'We went to Allah's Apostle to give us mounts, but he took an oath that he would not give us mounts, and then later on he sent for us and gave us mounts, perhaps Allah's Apostle forgot his oath. By Allah, we will never be successful, for we have taken advantage of the fact that Allah's Apostle forgot to fulfill his oath. So let us return to Allah's Apostle to remind him of his oath.' We returned and said, 'O Allah's Apostle! We came to you and asked you for mounts, but you took an oath that you would not give us mounts) but later on you gave us mounts, and we thought or considered that you have forgotten your oath.' The Prophet said, 'Depart, for Allah has given you Mounts. By Allah, Allah willing, if I take an oath and then later find another thing better than that, I do what is better, and make expiation for the oath.' \"",
      "chain": [
        "20387",
        "20208",
        "11015",
        "11719",
        "11589"
      ]
    },
    {
      "hadith_no": "7605",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا علي بن حجر، أخبرنا عيسى بن يونس، عن الأعمش، عن خيثمة، عن عدي بن حاتم، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما منكم أحد إلا سيكلمه ربه، ليس بينه وبينه ترجمان، فينظر أيمن منه فلا يرى إلا ما قدم من عمله، وينظر أشأم منه فلا يرى إلا ما قدم، وينظر بين يديه فلا يرى إلا النار تلقاء وجهه، فاتقوا النار ولو بشق تمرة ‏\"‏‏.‏ قال الأعمش وحدثني عمرو بن مرة عن خيثمة مثله وزاد فيه ‏\"‏ ولو بكلمة طيبة ‏\"‏‏.‏",
      "text_en": " Narrated `Adi bin Hatim:                     Allah's Apostle said, \"There will be none among you but his Lord will talk to him, and there will be no interpreter between him and Allah. He will look to his right and see nothing but his deeds which he has sent forward, and will look to his left and see nothing but his deeds which he has sent forward, and will look in front of him and see nothing but the (Hell) Fire facing him. So save yourself from the (Hell) Fire even with half a date (given in charity).\" Al-A`mash said: `Amr bin Murra said, Khaithama narrated the same and added, '..even with a good word.' \"",
      "chain": [
        "20387",
        "20347",
        "11060",
        "11332",
        "212"
      ]
    },
    {
      "hadith_no": "6",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني علي بن حجر السعدي، حدثنا علي بن مسهر، أخبرنا محمد بن قيس الأسدي، عن علي بن ربيعة الأسدي، عن المغيرة بن شعبة، عن النبي صلى الله عليه وسلم بمثله ولم يذكر ‏\"‏ إن كذبا على ليس ككذب على أحد ‏\"‏ ‏.‏",
      "text_en": "",
      "chain": [
        "20387",
        "20345",
        "20605",
        "11376",
        "166"
      ]
    },
    {
      "hadith_no": "181",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، جميعا عن إسماعيل بن جعفر، - قال ابن أيوب حدثنا إسماعيل، - قال أخبرني العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يدخل الجنة من لا يأمن جاره بوائقه ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace and blessing be upon him) observed:                      He will not enter Paradise whose neighbour is not secure from his wrongful conduct.",
      "chain": [
        "20379",
        "30367",
        "20387",
        "20155",
        "11418",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "225",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا يحيى بن يحيى التميمي، ويحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، جميعا عن إسماعيل بن جعفر، قال يحيى بن يحيى أخبرنا إسماعيل بن جعفر، عن عبد الله بن دينار، أنه سمع ابن عمر، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما امرئ قال لأخيه يا كافر ‏.‏ فقد باء بها أحدهما إن كان كما قال وإلا رجعت عليه ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Ibn 'Umar that the Messenger of Allah (may peace and blessings be upon him) said:                      Any person who called his brother: or unbeliever (has in fact done an act by which this unbelief) would return to one of them. If it were so, as he asserted (then the unbelief of man was confirmed but if it was not true), then it returned to him (to the man who labeled it on his brother Muslim).",
      "chain": [
        "30399",
        "20379",
        "30367",
        "20387",
        "20155",
        "30399",
        "20155",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "237",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا علي بن حجر السعدي، حدثنا إسماعيل، - يعني ابن علية - عن منصور بن عبد الرحمن، عن الشعبي، عن جرير، أنه سمعه يقول ‏\"‏ أيما عبد أبق من مواليه فقد كفر حتى يرجع إليهم ‏\"‏ ‏.‏ قال منصور قد والله روي عن النبي صلى الله عليه وسلم ولكني أكره أن يروى عني ها هنا بالبصرة ‏.‏",
      "text_en": " It is narrated on the authority of Jarir that he heard (the Holy Prophet) saying, The slave who fled from his master committed an act of infidelity as long as he would not return to him. Mansur observed:                      By God, this hadith was narrated from the Apostle (may peace and blessings be upon him), but I do not like that this should be narrated on my authority here in Basra.",
      "chain": [
        "20387",
        "20208",
        "11565",
        "11052",
        "4057"
      ]
    },
    {
      "hadith_no": "304",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا علي بن حجر السعدي، وإسحاق بن إبراهيم، قال إسحاق أخبرنا جرير، عن منصور، عن إبراهيم، عن همام بن الحارث، قال كان رجل ينقل الحديث إلى الأمير فكنا جلوسا في المسجد فقال القوم هذا ممن ينقل الحديث إلى الأمير ‏.‏ قال فجاء حتى جلس إلينا ‏.‏ فقال حذيفة سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يدخل الجنة قتات ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Hammam b, al-Harith that a man used to carry tales to the governor. We were sitting in the mosque. the people said:                      He is one who carries tales to the governor. He (the narrator) said: Then he came and sat with us. Thereupon Hudhaifa remarked: I heard the Messenger of Allah (may peace be upon him) saying: The beater of false tales would never enter heaven.",
      "chain": [
        "20387",
        "30123",
        "30312",
        "20028",
        "11067",
        "11051",
        "11400"
      ]
    },
    {
      "hadith_no": "370",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، جميعا عن إسماعيل بن جعفر، - قال ابن أيوب حدثنا إسماعيل بن جعفر، - قال أخبرنا العلاء، - وهو ابن عبد الرحمن مولى الحرقة - عن معبد بن كعب السلمي، عن أخيه عبد الله بن كعب، عن أبي أمامة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من اقتطع حق امرئ مسلم بيمينه فقد أوجب الله له النار وحرم عليه الجنة ‏\"‏ ‏.‏ فقال له رجل وإن كان شيئا يسيرا يا رسول الله قال ‏\"‏ وإن قضيبا من أراك ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Umama that the Messenger of Allah (may peace be upon him) observed:                      He who appropriated the right of a Muslim by (swearing a false) oath, Allah would make Hell-fire necessary for him and would declare Paradise forbidden for him. A person said to him: Messenger of Allah, even if it is something insignificant? He (the Holy Prophet) replied: (Yes) even if it is the twig of the arak tree.",
      "chain": [
        "20379",
        "30367",
        "20387",
        "20155",
        "20155",
        "1131",
        "405"
      ]
    },
    {
      "hadith_no": "413",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، قالوا حدثنا إسماعيل، - يعنون ابن جعفر - عن العلاء، - وهو ابن عبد الرحمن - عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تقوم الساعة حتى تطلع الشمس من مغربها فإذا طلعت من مغربها آمن الناس كلهم أجمعون فيومئذ لا ينفع نفسا إيمانها لم تكن آمنت من قبل أو كسبت في إيمانها خيرا ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      The (Last) Hour shall not came till the sun rises from the place of its setting And on the day when it rises from the place of its setting even if all the people together affirmed their faith, it would not be of any avail to one who did not believe previously and derived no good out of his belief.",
      "chain": [
        "20379",
        "30367",
        "20387",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "233",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، كلهم عن إسماعيل، - قال ابن أيوب حدثنا إسماعيل بن جعفر، - أخبرني العلاء بن عبد الرحمن بن يعقوب، مولى الحرقة عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ الصلاة الخمس والجمعة إلى الجمعة كفارة لما بينهن ما لم تغش الكبائر ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: Five prayers and from one Friday prayer to (the next) Friday prayer is an expiation (of the sins committed in between their intervals) if major sins are not committed.",
      "chain": [
        "20379",
        "30367",
        "20387",
        "20208",
        "20155",
        "29225",
        "13"
      ]
    },
    {
      "hadith_no": "249",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا يحيى بن أيوب، وسريج بن يونس، وقتيبة بن سعيد، وعلي بن حجر، جميعا عن إسماعيل بن جعفر، - قال ابن أيوب حدثنا إسماعيل، - أخبرني العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم أتى المقبرة فقال ‏\"‏ السلام عليكم دار قوم مؤمنين وإنا إن شاء الله بكم لاحقون وددت أنا قد رأينا إخواننا ‏\"‏ ‏.‏ قالوا أولسنا إخوانك يا رسول الله قال ‏\"‏ أنتم أصحابي وإخواننا الذين لم يأتوا بعد ‏\"‏ ‏.‏ فقالوا كيف تعرف من لم يأت بعد من أمتك يا رسول الله فقال ‏\"‏ أرأيت لو أن رجلا له خيل غر محجلة بين ظهرى خيل دهم بهم ألا يعرف خيله ‏\"‏ ‏.‏ قالوا بلى يا رسول الله ‏.‏ قال ‏\"‏ فإنهم يأتون غرا محجلين من الوضوء وأنا فرطهم على الحوض ألا ليذادن رجال عن حوضي كما يذاد البعير الضال أناديهم ألا هلم ‏.‏ فيقال إنهم قد بدلوا بعدك ‏.‏ فأقول سحقا سحقا ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) came to the graveyard and said: Peace be upon you! the abode of the believing people and we, if God so wills, are about to join you. I love to see my brothers. They (the hearers) said: Arn't we your brothers-Messenger of Allah? He said: You are my companions, and our brothers are those who have, so far, not come into the world. They said: Messenger of Allah, how would you recognise those persons of your Ummah who have not yet been born? He said: Supposing a man had horses with white blazes on fore- heads and legs among horses which were all black, tell me, would he not recognise his own horses? They said: Certainly. Messenger of Allah. He said: They would come with white faces and arms and legs owing to ablution, and I would arrive at the Cistern before them. Some people would be driven away from my Cistern as the stray camel is driven away. I would call out. Come. come. Then it would be said (to me): These people changed themselves after you, and I would say: Be off, be off.",
      "chain": [
        "20379",
        "30251",
        "30367",
        "20387",
        "20155",
        "11418",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "251",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة، وابن، حجر جميعا عن إسماعيل بن جعفر، - قال ابن أيوب حدثنا إسماعيل، - أخبرني العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ألا أدلكم على ما يمحو الله به الخطايا ويرفع به الدرجات ‏\"‏ ‏.‏ قالوا بلى يا رسول الله ‏.‏ قال ‏\"‏ إسباغ الوضوء على المكاره وكثرة الخطا إلى المساجد وانتظار الصلاة بعد الصلاة فذلكم الرباط ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said: Should I not suggest to you that by which Allah obliterates the sins and elevates the ranks (of a man). They (the hearers) said: Yes, Messenger of Allah. He said: Performing the ablution thoroughly despite odds, tranverside of more paces towards the mosque, and waiting for the next prayer after observing a prayer, and that is mindfulness.",
      "chain": [
        "30526",
        "30367",
        "20387",
        "20155",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "279",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثني علي بن حجر السعدي، حدثنا علي بن مسهر، أخبرنا الأعمش، عن أبي رزين، وأبي، صالح عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا ولغ الكلب في إناء أحدكم فليرقه ثم ليغسله سبع مرار ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported the Messenger of Allah (may peace be upon him) to have said:                      When a dog licks a utensil belonging to any one of you, (the thing contained in it) should be thrown away and then (the utensil) should be washed seven times.",
      "chain": [
        "20387",
        "20345",
        "11060",
        "10826",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "293",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن الشيباني، ح وحدثني علي بن حجر السعدي، - واللفظ له - أخبرنا علي بن مسهر، أخبرنا أبو إسحاق، عن عبد الرحمن بن الأسود، عن أبيه، عن عائشة، قالت كان إحدانا إذا كانت حائضا أمرها رسول الله صلى الله عليه وسلم أن تأتزر في فور حيضتها ثم يباشرها ‏.‏ قالت وأيكم يملك إربه كما كان رسول الله صلى الله عليه وسلم يملك إربه ‏.‏",
      "text_en": " 'A'isha reported:                      When anyone amongst us was menstruating the Messenger of Allah (may peace be upon him) asked her to tie waist-wrapper daring the time when the menstrual blood profusely flowed and then embraced her; and she ('A'isha) observed: And who amongst you can have control over his desires as the Messenger of Allah (may peace be upon him) had over his desires.",
      "chain": [
        "30201",
        "20345",
        "11352",
        "20387",
        "20345",
        "11049",
        "11056",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "316",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثناه قتيبة بن سعيد، وزهير بن حرب، قالا حدثنا جرير، ح وحدثنا علي بن حجر، حدثنا علي بن مسهر، ح وحدثنا أبو كريب، حدثنا ابن نمير، كلهم عن هشام، في هذا الإسناد وليس في حديثهم غسل الرجلين ‏.‏",
      "text_en": " This hadith is narrated by Abu Kuraib. Ibn Numair and others, all on the authority of Hisham with the same chain of transmitters, but in their narration these words are not there:                     \" washed his feet.\"",
      "chain": [
        "30367",
        "30022",
        "20028",
        "20387",
        "20345",
        "30216"
      ]
    },
    {
      "hadith_no": "317",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني علي بن حجر السعدي، حدثني عيسى بن يونس، حدثنا الأعمش، عن سالم بن أبي الجعد، عن كريب، عن ابن عباس، قال حدثتني خالتي، ميمونة قالت أدنيت لرسول الله صلى الله عليه وسلم غسله من الجنابة فغسل كفيه مرتين أو ثلاثا ثم أدخل يده في الإناء ثم أفرغ به على فرجه وغسله بشماله ثم ضرب بشماله الأرض فدلكها دلكا شديدا ثم توضأ وضوءه للصلاة ثم أفرغ على رأسه ثلاث حفنات ملء كفه ثم غسل سائر جسده ثم تنحى عن مقامه ذلك فغسل رجليه ثم أتيته بالمنديل فرده ‏.‏",
      "text_en": " Ibn 'Abbas reported it on the authority of Maimuna, his mother's sister, that she said:                      I placed water near the Messenger of Allah (may peace be upon him) to take a bath because of sexual intercourse. He washed the palms of his bands twice or thrice and then put his hand In the basin and poured water over his private parts and washed them with his left hand. He then struck his hand against the earth and rubbed it with force and then performed ablution for the prayer and then poured three handfuls of water on his head and then washed his whole body after which he moved aside from that place and washed his feet, and then I brought a towel (so that he may wipe his body). but he returned it.",
      "chain": [
        "20387",
        "20347",
        "11060",
        "11342",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "326",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا ابن علية، ح وحدثني علي بن حجر، حدثنا إسماعيل، عن أبي ريحانة، عن سفينة، - قال أبو بكر - صاحب رسول الله صلى الله عليه وسلم قال كان رسول الله صلى الله عليه وسلم يغتسل بالصاع ويتطهر بالمد ‏.‏ وفي حديث ابن حجر أو قال ويطهره المد ‏.‏ وقال وقد كان كبر وما كنت أثق بحديثه ‏.‏",
      "text_en": " Safina reported that Abu Bakr, the Companion of the Messenger of Allah (way peace be upon him), observed:                      The Messenger of Allah (may peace be upon him) took a bath with one Sa' of water and performed ablution with one Mudd (of water) ; and in the hadith narrated by Ibn Hujr the words are: One Mudd sufficed for his (Holy Prophet's) ablution. And Ibn Hujr said that (his Shaikh) Isma'il was much advanced in age, and it was because of this that he could not fully rely on him for this tradition.",
      "chain": [
        "30201",
        "20208",
        "20387",
        "20208",
        "10696",
        "438"
      ]
    },
    {
      "hadith_no": "359",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني علي بن حجر، حدثنا إسماعيل بن جعفر، حدثنا محمد بن عمرو بن حلحلة، عن محمد بن عمرو بن عطاء، عن ابن عباس، أن رسول الله صلى الله عليه وسلم جمع عليه ثيابه ثم خرج إلى الصلاة فأتي بهدية خبز ولحم فأكل ثلاث لقم ثم صلى بالناس وما مس ماء ‏.‏",
      "text_en": " Ibn Abbas reported:                      The Messenger of Allah (may peace be upon him) dressed himself, and then went out for prayer, when he was presented with bread and meat. He took three morsels out of that, and then offered prayer along with other people and did not touch water.",
      "chain": [
        "20387",
        "20155",
        "11537",
        "11220",
        "17"
      ]
    },
    {
      "hadith_no": "400",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن حجر السعدي، حدثنا علي بن مسهر، أخبرنا المختار بن فلفل، عن أنس بن مالك، ح  وحدثنا أبو بكر بن أبي شيبة، - واللفظ له - حدثنا علي بن مسهر، عن المختار، عن أنس، قال بينا رسول الله صلى الله عليه وسلم ذات يوم بين أظهرنا إذ أغفى إغفاءة ثم رفع رأسه متبسما فقلنا ما أضحكك يا رسول الله قال ‏\"‏ أنزلت على آنفا سورة ‏\"‏ ‏.‏ فقرأ ‏\"‏ بسم الله الرحمن الرحيم ‏{‏ إنا أعطيناك الكوثر * فصل لربك وانحر * إن شانئك هو الأبتر‏}‏ ‏\"‏ ‏.‏ ثم قال ‏\"‏ أتدرون ما الكوثر ‏\"‏ ‏.‏ فقلنا الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإنه نهر وعدنيه ربي عز وجل عليه خير كثير هو حوض ترد عليه أمتي يوم القيامة آنيته عدد النجوم فيختلج العبد منهم فأقول رب إنه من أمتي ‏.‏ فيقول ما تدري ما أحدثت بعدك ‏\"‏ ‏.‏ زاد ابن حجر في حديثه بين أظهرنا في المسجد ‏.‏ وقال ‏\"‏ ما أحدث بعدك ‏\"‏ ‏.‏",
      "text_en": " Anas reported:                      One day the Messenger of Allah (may peace be upon him) was sitting amongst us that he dozed off. He then raised his head smilingly. We said: What makes you smile. Messenger of Allah? He said: A Sura has just been revealed to me, and then recited: In the name of Allah, the Compassionate, the Merciful. Verily We have given thee Kauthar (fount of abundance). Therefore turn to thy Lord for prayer and offer sacrifice, and surely thy enemy is cut off (from the good). Then he (the Holy Prophet) said: Do you know what Kauthar is? We said: Allah and His Messenger know best. The Holy Prophet (may peace be upon him) said: It (Kauthar) is a canal which my Lord, the Exalted and Glorious has promised me, and there is an abundance of good in it. It is a cistern and my people would come to it on the Day of Resurrection, and tumblers there would be equal to the number of stars. A servant would be turned away from (among the people gathered there). Upon this I would say: My Lord, he is one of my people, and He (the Lord) would say: You do not know that he innovated new things (in Islam) after you. Ibn Hujr made this addition in the hadith:\" He (the Holy Prophet) was sitting amongst us in the mosque, and He (Allah) said: (You don't know) what he innovated after you\"",
      "chain": [
        "20387",
        "20345",
        "10962",
        "19",
        "20436",
        "20345",
        "19"
      ]
    },
    {
      "hadith_no": "426",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن حجر، واللفظ، لأبي بكر قال ابن حجر أخبرنا وقال أبو بكر، حدثنا علي بن مسهر، عن المختار بن فلفل، عن أنس، قال صلى بنا رسول الله صلى الله عليه وسلم ذات يوم فلما قضى الصلاة أقبل علينا بوجهه فقال ‏\"‏ أيها الناس إني إمامكم فلا تسبقوني بالركوع ولا بالسجود ولا بالقيام ولا بالانصراف فإني أراكم أمامي ومن خلفي - ثم قال - والذي نفس محمد بيده لو رأيتم ما رأيت لضحكتم قليلا ولبكيتم كثيرا ‏\"‏ ‏.‏ قالوا وما رأيت يا رسول الله قال ‏\"‏ رأيت الجنة والنار ‏\"‏ ‏.‏",
      "text_en": " Anas reported:                      The Messenger of Allah (may peace be upon him) one day led us in the prayer. and when he completed the Prayer he turned his face towards us and said: 0 People, I am your Imam, so do not precede me in bowing and prostration and in standing and turning (faces, i. e. In pronouncing salutation), for I see you in front of me and behind me, and then said: By Him in Whose hand Is the life of Muhammad, if you could see what I see, you would have laughed little and wept much more. They said: What did you see, Messenger of Allah? He replied: (I saw) Paradise and Hell.",
      "chain": [
        "30201",
        "20387",
        "20436",
        "20345",
        "10962",
        "19"
      ]
    },
    {
      "hadith_no": "469",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا يحيى بن يحيى، ويحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، قال يحيى بن يحيى أخبرنا وقال الآخرون، حدثنا إسماعيل، - يعنون ابن جعفر - عن شريك بن عبد الله بن أبي نمر، عن أنس بن مالك، أنه قال ما صليت وراء إمام قط أخف صلاة ولا أتم صلاة من رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Anas reported:                      I never prayed behind an Imam who was more brief and more perfect in prayer than the Messenger of Allah (may peace be upon him).",
      "chain": [
        "30399",
        "20379",
        "30367",
        "20387",
        "30399",
        "11858",
        "19"
      ]
    },
    {
      "hadith_no": "1190",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني علي بن حجر السعدي، أخبرنا علي بن مسهر، حدثنا الأعمش، عن إبراهيم بن يزيد التيمي، قال كنت أقرأ على أبي القرآن في السدة فإذا قرأت السجدة سجد فقلت له يا أبت أتسجد في الطريق قال إني سمعت أبا ذر يقول سألت رسول الله صلى الله عليه وسلم عن أول مسجد وضع في الأرض قال ‏\"‏ المسجد الحرام ‏\"‏ ‏.‏ قلت ثم أى قال ‏\"‏ المسجد الأقصى ‏\"‏ ‏.‏ قلت كم بينهما قال ‏\"‏ أربعون عاما ثم الأرض لك مسجد فحيثما أدركتك الصلاة فصل ‏\"‏ ‏.‏",
      "text_en": " Ibrahim b. Yazid al-Tayml reported:                      I used to read the Qur'an with my father in the vestibule (before the door of the mosque). When I recited the ayat (verses) concerning prostration, he prostrated himself. I said to him: Father, do you prostrate yourself in the path? He said: I heard Abu Dharr saying: I asked the Messenger of Allah (may peace be upon him) about the mosque that was first set up on the earth. He said: Masjid Harim. I said: Then which next? He said: The Masjid al-Aqsa. I said: How long is the space of time between the two? He said: Forty years. He (then) further said: The earth is a mosque for you, so wherever you are at the time of prayer, pray there.",
      "chain": [
        "20387",
        "20345",
        "11060",
        "11322",
        "23"
      ]
    },
    {
      "hadith_no": "1195",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا يحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، قالوا حدثنا إسماعيل، - وهو ابن جعفر - عن العلاء، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ فضلت على الأنبياء بست أعطيت جوامع الكلم ونصرت بالرعب وأحلت لي الغنائم وجعلت لي الأرض طهورا ومسجدا وأرسلت إلى الخلق كافة وختم بي النبيون ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported that the Messenger of Allah (may peace be upon hlmg) said:                      I have been given superiority over the other prophets in six respects: I have been given words which are concise but comprehensive in meaning; I have been helped by terror (in the hearts of enemies): spoils have been made lawful to me: the earth has been made for me clean and a place of worship; I have been sent to all mankind and the line of prophets is closed with me.",
      "chain": [
        "20379",
        "30367",
        "20387",
        "20155",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "1637",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني علي بن حجر السعدي، حدثنا إسماعيل، عن عبد الحميد، صاحب الزيادي عن عبد الله بن الحارث، عن عبد الله بن عباس، أنه قال لمؤذنه في يوم مطير إذا قلت أشهد أن لا إله إلا الله أشهد أن محمدا رسول الله فلا تقل حى على الصلاة قل صلوا في بيوتكم - قال - فكأن الناس استنكروا ذاك فقال أتعجبون من ذا قد فعل ذا من هو خير مني إن الجمعة عزمة وإني كرهت أن أحرجكم فتمشوا في الطين والدحض ‏.‏",
      "text_en": " 'Abdullah b. 'Abbas reported that he said to the Mu'adhdhin on a rainy day:                      When you have announced\" I testify that there is no god but Allah; I testify that Muhammad is the Messenger of Allah,\" do not say:\" Come to the prayer,\" but make this announcement:\" Say prayer in your houses.\" He (the narrator) said that the people disapproved of it. Ibn 'Abbas said: Are you astonished at it? He (the Holy Prophet), who is better than I, did it. Jumu'a prayer is no doubt obligatory, but I do not like that I should (force you) to come out and walk in mud and slippery ground.",
      "chain": [
        "20387",
        "20208",
        "11703",
        "912",
        "17"
      ]
    },
    {
      "hadith_no": "1772",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني علي بن حجر، حدثنا حسان، - قاضي كرمان - عن سعيد بن مسروق، عن أبي الضحى، عن مسروق، عن عائشة، قالت كل الليل قد أوتر رسول الله صلى الله عليه وسلم فانتهى وتره إلى آخر الليل ‏.‏",
      "text_en": " Sa'd b. Hisham b. 'Amir decided to participate in the expedition for the sake of Allah, so he came to Medina and he decided to dispose of his property there and buy arms and horses instead and fight against the Romans to the end of his life. When he came to Medina, he met the people of Medina. They dissuaded him to do such a thing, and informed him that a group of six men had decided to do so during the lifetime of the Apostle of Allah (may peace be upon him) and the Apostle of Allah (may peace be upon him) forbade them to do it, and said:                      Is there not for you a model pattern in me? And when they narrated this to him (Sa'd b. Hisham), he returned to his wife, though he had divorced her and made (people) witness to his reconciliation. He then came to Ibn 'Abbas and asked him about the Witr of the Messenger of Allah (may peace be upon him). Ibn 'Abbas said: Should I not lead you to one who knows best amongst the people of the world about the Witr of the Messenger of Allah (may peace be upon him)? He said: Who is it? He (Ibn 'Abbas) said: It is 'A'isha. So go to her and ask her (about Witr) and then come to me and inform me about her answer that she would give you. So I came to Hakim b. Aflah and requested him to take me to her. He said: I would not go to her, for I forbade her to speak anything (about the conflict) between the two groupS, but she refused (to accept my advice) and went (to participate in that corflict). I (requested) him (Hakim) with an oath to lead me to her. So we went to 'A'isha and we begged permission to meet her. She granted us permission and we went in. She said: Are you Hakim? (She recognised him.) He replied: Yes. She said: Who is there with you? He said: He is Sa'd b. Hisham. She said: Which Hisham? He said: He is Hisham b. 'Amir. She blessed him ('Amir) with mercy from Allah and spoke good of him (Qatada said that he died as a martyr in Uhud). I said: Mother of the Faithful, tell me about the character of the Messenger of Allah (may peace be upon him). She said: Don't you read the Qur'an? I said: Yes. Upon this she said: The character of the Apostle of Allah (may peace be upon him) was the Qur'an. He said: I felt inclined to get up and not ask anything (further) till death. But then I changed my mind and said: Inform me about the observance (of the night prayer) of the Messenger of Allah (may peace be upon him). She said: Did you not recite:\" O thou wrapped up\"? He said: Yes. She said: Allah, the Exalted and the Glorious, made the observance of the night prayer at the beginning of this Surah obligatory. So the Apostle of Allah (may peace be upon him and his Companions around him observed this (night prayer) for one year. Allah held back the concluding portion of this Surah for twelve months in the Heaven till (at the end of this period) Allah revealed the concluding verses of this Surah which lightened (the burden of this prayer), and the night prayer became a supererogatory prayer after being an obligatory one. I said: Mother of the Faithful, inform me about the Witr of the Messenger of Allah (may peace be upon him). She said: I used to prepare tooth stick for him and water for his ablution, and Allah would rouse him to the extent He wished during the night. He would use the tooth stick, and perform ablution, and would offer nine rak'ahs, and would not sit but in the eighth one and would remember Allah, and praise Him and supplicate Him, then he would get up without uttering the salutation and pray the ninth rak'ah. He would then sit, remember, praise Him and supplicate Him and then utter a salutation loud enough for us to hear. He would then pray two rak'ahs sitting after uttering the salutation, and that made eleven rak'ahs. O my son, but when the Apostle of Allah (may peace be upon him) grew old and put on flesh, he observed Witr of seven, doing in the two rak'ahs as he had done formerly, and that made nine. O my son, and when the Apostle of Allah (may peace be upon him) observed prayer, he liked to keep on observing it, and when sleep or pain overpowered him and made it impossible (for him) to observe prayer in the night, he prayed twelve rak'ahs daring the day. I am not aware of Allah's Prophet (may peace be upon him) having recited the whole Qur'an during one single night, or praying through the night till morning, or fasting a complete month, except Ramadan. He (the narrator) said: I then went to Ibn 'Abbas and narrated to him the hadith (transmitted from her), and he said: She says the truth If I went to her and got into her presence, I would have listened to it orally from her. He said: If I were to know that you do not go to her. I would not have transmitted this hadith to you narrated by her.",
      "chain": [
        "20387",
        "20016",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "1955",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا علي بن حجر السعدي، حدثنا إسماعيل بن إبراهيم، عن داود بن أبي، هند عن الشعبي، عن علقمة، قال لقيت أبا الدرداء فقال لي ممن أنت قلت من أهل العراق ‏.‏ قال من أيهم قلت من أهل الكوفة ‏.‏ قال هل تقرأ على قراءة عبد الله بن مسعود قال قلت نعم ‏.‏ قال فاقرأ ‏{‏ والليل إذا يغشى‏}‏ قال فقرأت ‏{‏ والليل إذا يغشى * والنهار إذا تجلى * والذكر والأنثى‏}‏ ‏.‏ قال فضحك ثم قال هكذا سمعت رسول الله صلى الله عليه وسلم يقرؤها ‏.‏",
      "text_en": " This hadith has been narrated by another chain of transmitters.",
      "chain": [
        "20387",
        "20208",
        "11585",
        "11052",
        "11017"
      ]
    },
    {
      "hadith_no": "1971",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة، وعلي بن حجر، قال ابن أيوب حدثنا إسماعيل، - وهو ابن جعفر - أخبرني محمد، - وهو ابن أبي حرملة - قال أخبرني أبو سلمة، أنه سأل عائشة عن السجدتين اللتين، كان رسول الله صلى الله عليه وسلم يصليهما بعد العصر فقالت كان يصليهما قبل العصر ثم إنه شغل عنهما أو نسيهما فصلاهما بعد العصر ثم أثبتهما وكان إذا صلى صلاة أثبتها ‏.‏ قال يحيى بن أيوب قال إسماعيل تعني داوم عليها ‏.‏",
      "text_en": " 'A'isha reported:                      The Messenger of Allah (may peace be upon him) did not abandon at all observing two rak'ahs after the 'Asr in my house.",
      "chain": [
        "20379",
        "30367",
        "20387",
        "20155",
        "11535",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "1973",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، ح وحدثنا علي بن حجر، - واللفظ له - أخبرنا علي بن مسهر، أخبرنا أبو إسحاق الشيباني، عن عبد الرحمن، بن الأسود عن أبيه، عن عائشة، قالت صلاتان ما تركهما رسول الله صلى الله عليه وسلم في بيتي قط سرا ولا علانية ركعتين قبل الفجر وركعتين بعد العصر ‏.‏",
      "text_en": " Aswad and Masruq reported:                      We bear testimony to the fact that 'A'isha said: Never was there a day that he (the Holy Prophet) was with me and he did not observe two rak'ahs of prayer in my house, i. e. two rak'ahs after the Asr.",
      "chain": [
        "30201",
        "20345",
        "20387",
        "20345",
        "11352",
        "11056",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "2028",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا عبد الله بن مسلمة بن قعنب، ويحيى بن يحيى، وعلي بن حجر، قال يحيى أخبرنا وقال الآخران، حدثنا عبد العزيز بن أبي حازم، عن أبيه، عن سهل، قال ما كنا نقيل ولا نتغدى إلا بعد الجمعة - زاد ابن حجر - في عهد رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Sahl b. Said said:                      We did not have a siesta or lunch till after the Friday prayer. (Ibn Hajr added: ) \"During the lifetime of the Messenger of Allah (may peace be upon him).\"",
      "chain": [
        "30399",
        "20387",
        "20031",
        "20165",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "2184",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني علي بن حجر السعدي، حدثنا علي بن مسهر، عن الأعمش، عن أبي، صالح عن ابن عمر، قال لما طعن عمر أغمي عليه فصيح عليه فلما أفاق قال أما علمتم أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الميت ليعذب ببكاء الحى ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported:                      When 'Umar was wounded he fainted, and there was a loud lamentation over him. When he regained consciousness he said: Didn't you know that the Messenger of Allah (may peace be upon him) said:\" The dead is punished because of the weeping of the living\"?",
      "chain": [
        "20387",
        "20345",
        "11060",
        "11161",
        "18"
      ]
    },
    {
      "hadith_no": "2185",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثني علي بن حجر، حدثنا علي بن مسهر، عن الشيباني، عن أبي بردة، عن أبيه، قال لما أصيب عمر جعل صهيب يقول واأخاه ‏.‏ فقال له عمر يا صهيب أما علمت أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الميت ليعذب ببكاء الحى ‏\"‏ ‏.‏",
      "text_en": " Abu Burda narrated on the authority of his father that when 'Umar was wounded Suhaib uttered (loudly in lamentation):                      O brother! Upon this 'Umar said: Suhaib, did you not know that the Messenger of Allah (may peace be upon him) said:\" The dead is punished because of the lamentation of the living\"?",
      "chain": [
        "20387",
        "20345",
        "11352",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2186",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني علي بن حجر، أخبرنا شعيب بن صفوان أبو يحيى، عن عبد الملك بن، عمير عن أبي بردة بن أبي موسى، عن أبي موسى، قال لما أصيب عمر أقبل صهيب من منزله حتى دخل على عمر فقام بحياله يبكي فقال عمر علام تبكي أعلى تبكي قال إي والله لعليك أبكي يا أمير المؤمنين ‏.‏ قال والله لقد علمت أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من يبكى عليه يعذب ‏\"‏ ‏.‏ قال فذكرت ذلك لموسى بن طلحة فقال كانت عائشة تقول إنما كان أولئك اليهود ‏.‏",
      "text_en": " Abu Musa reported that when 'Umar was wounded, there came Suhaib from his house and went to 'Umar and stood by his side, and began to wail. Upon this 'Umar said:                      What are you weeping for? Are you weeping for me? He said: By Allah, it is for you that I weep, O Commander of the believers. He said: By Allah, you already know that the Messenger of Allah (may peace be upon him) had said: He who is lamented upon is punished. I made a mention of it to Musa b. Talha, and he said that 'A'isha told that it concerned the Jews (only).",
      "chain": [
        "20387",
        "20588",
        "11368",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "2201",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني علي بن حجر السعدي، حدثنا علي بن مسهر، أخبرنا محمد بن قيس، الأسدي عن علي بن ربيعة الأسدي، عن المغيرة بن شعبة، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " A hadith like this has been narrated by Mughira b. Shu'ba from the Apostle of Allah (may peace be upon him).",
      "chain": [
        "20387",
        "20345",
        "20605",
        "11376",
        "166"
      ]
    },
    {
      "hadith_no": "2223",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني علي بن حجر السعدي، أخبرنا علي بن مسهر، حدثنا هشام بن عروة، عن أبيه، عن عائشة، قالت أدرج رسول الله صلى الله عليه وسلم في حلة يمنية كانت لعبد الله بن أبي بكر ثم نزعت عنه وكفن في ثلاثة أثواب سحول يمانية ليس فيها عمامة ولا قميص فرفع عبد الله الحلة فقال أكفن فيها ‏.‏ ثم قال لم يكفن فيها رسول الله صلى الله عليه وسلم وأكفن فيها ‏.‏ فتصدق بها ‏.",
      "text_en": " 'A'isha reported that the Messenger of Allah (may peace be upon him) was wrapped in a Yamani wrapper which belonged to 'Abdullah b Abu Bakr; then it was removed from him, and he was shrouded in three cotton sheets of white Yamani stuff from Sahul among which was neither a shirt nor a turban. 'Abdullah took up the Hullah and said:                      I would be shrouded in it, but then said: How is it that I should be shrouded in it in which the Messenger of Allah (may peace be upon him) was not shrouded! So he gave it in charity.",
      "chain": [
        "20387",
        "20345",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2254",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني زهير بن حرب، وعلي بن حجر، قالا حدثنا إسماعيل، ح وحدثنا يحيى، بن أيوب حدثنا ابن علية، عن أيوب، عن أبي قلابة، عن أبي المهلب، عن عمران بن حصين، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أخا لكم قد مات فقوموا فصلوا عليه ‏\"‏ ‏.‏ يعني النجاشي وفي رواية زهير ‏\"‏ إن أخاكم ‏\"‏ ‏.‏",
      "text_en": " 'Imran b. Husain reported Allah's Messenger (may peace be upon him) as saying:                      A brother of yours has died; so stand up and offer prayer for him, i. e. Negus. And in the hadith transmitted by Zubair (the words are):\" Your brother.\"",
      "chain": [
        "30022",
        "20387",
        "20208",
        "20379",
        "20208",
        "11015",
        "11047",
        "123"
      ]
    },
    {
      "hadith_no": "2265",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني سريج بن يونس، وعلي بن حجر، قالا حدثنا إسماعيل، - وهو ابن علية - عن هشام الدستوائي، ح وحدثنا محمد بن المثنى، - واللفظ له - حدثنا معاذ بن، هشام حدثني أبي، عن يحيى بن أبي كثير، قال حدثنا أبو سلمة بن عبد الرحمن، عن أبي، سعيد الخدري أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا رأيتم الجنازة فقوموا فمن تبعها فلا يجلس حتى توضع ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Sa'id al-Khudri that the Holy Prophet (may peace be upon him) said:                      Whenever you come across a bier you should stand up, and he who follows it should not sit down till it is placed on the ground.",
      "chain": [
        "30251",
        "20387",
        "20208",
        "20295",
        "30170",
        "20287",
        "20295",
        "11449",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "2266",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني سريج بن يونس، وعلي بن حجر، قالا حدثنا إسماعيل، - وهو ابن علية - عن هشام الدستوائي، عن يحيى بن أبي كثير، عن عبيد الله بن مقسم، عن جابر، بن عبد الله قال مرت جنازة فقام لها رسول الله صلى الله عليه وسلم وقمنا معه فقلنا يا رسول الله إنها يهودية ‏.‏ فقال ‏\"‏ إن الموت فزع فإذا رأيتم الجنازة فقوموا ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Jabir ibn 'Abdullah:                      There passed a bier and the Holy Prophet (may peace be upon him) stood up for it and we also stood up along with him. We said: Messenger of Allah, that was the bier of a Jewess. Upon this he remarked: Verily, death is a matter of consternation, so whenever you come across a bier stand up.",
      "chain": [
        "30251",
        "20387",
        "20208",
        "20295",
        "11449",
        "11521",
        "34"
      ]
    },
    {
      "hadith_no": "2280",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا ابن المبارك، ويزيد بن هارون، ح وحدثني علي بن حجر، أخبرنا ابن المبارك، والفضل بن موسى، كلهم عن حسين، بهذا الإسناد ولم يذكروا أم كعب ‏.‏",
      "text_en": " This hadith has been narrated by Husain with the same chain of transmitters, but no mention is made of Umm Ka'b.",
      "chain": [
        "30201",
        "20025",
        "20472",
        "20387",
        "20025",
        "20452"
      ]
    },
    {
      "hadith_no": "2294",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني علي بن حجر السعدي، حدثنا الوليد بن مسلم، عن ابن جابر، عن بسر، بن عبيد الله عن واثلة، عن أبي مرثد الغنوي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تجلسوا على القبور ولا تصلوا إليها ‏\"‏ ‏.‏",
      "text_en": " Abu Marthad al-Ghanawi reported Allah's Messenger (may peace be upon him) as saying:                      Do not sit on the graves and do not pray facing towards them.",
      "chain": [
        "20387",
        "20733",
        "11412",
        "4049"
      ]
    },
    {
      "hadith_no": "2296",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني علي بن حجر السعدي، وإسحاق بن إبراهيم الحنظلي، - واللفظ لإسحاق - قال علي حدثنا وقال، إسحاق أخبرنا عبد العزيز بن محمد، عن عبد الواحد بن حمزة، عن عباد بن عبد الله بن الزبير، أن عائشة، أمرت أن يمر، بجنازة سعد بن أبي وقاص في المسجد فتصلي عليه فأنكر الناس ذلك عليها فقالت ما أسرع ما نسي الناس ما صلى رسول الله صلى الله عليه وسلم على سهيل ابن البيضاء إلا في المسجد ‏.‏",
      "text_en": " 'Abbad b. 'Abdullah b. Zubair reported that 'A'isha ordered the bier of Sa'd b. Abu Waqqas to be brought into the mosque so that she should pray for him. The people disapproved this (act) of hers. She said:                      How soon the people have forgotten that the Messenger of Allah (may peace be upon him) offered not the funeral prayer of Suhail b al-Baida' but in a mosque.",
      "chain": [
        "20387",
        "30123",
        "30026",
        "30312",
        "20167",
        "11886",
        "11250"
      ]
    },
    {
      "hadith_no": "2374",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثنيه زهير بن حرب، حدثنا يحيى بن سعيد، ح وحدثنا أبو كريب، حدثنا أبو أسامة، ح وحدثني علي بن حجر، أخبرنا علي بن مسهر، ح حدثنا الحكم بن موسى، حدثنا شعيب بن إسحاق، كلهم عن هشام، بهذا الإسناد ‏.‏ وفي حديث أبي أسامة ولم توص ‏.‏ كما قال ابن بشر ولم يقل ذلك الباقون ‏.‏",
      "text_en": "  This hadith has been narrated on the authority of Hisham with the same chain of transmitters. And in the hadith transmitted by Abu Usama the words are:                     \" She did not make any will,\" as it has been reported by Ibn Bishr, but it was not reported by the rest of the narrators.",
      "chain": [
        "20031",
        "30216",
        "20318",
        "20387",
        "20345",
        "30502",
        "20239"
      ]
    },
    {
      "hadith_no": "2395",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا علي بن حجر السعدي، وإسحاق بن إبراهيم، وعلي بن خشرم، قال ابن حجر حدثنا وقال الآخران، أخبرنا عيسى بن يونس، حدثنا الأعمش، عن خيثمة، عن عدي، بن حاتم قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ما منكم من أحد إلا سيكلمه الله ليس بينه وبينه ترجمان فينظر أيمن منه فلا يرى إلا ما قدم وينظر أشأم منه فلا يرى إلا ما قدم وينظر بين يديه فلا يرى إلا النار تلقاء وجهه فاتقوا النار ولو بشق تمرة ‏\"‏ ‏.‏ زاد ابن حجر قال الأعمش وحدثني عمرو بن مرة عن خيثمة مثله وزاد فيه ‏\"‏ ولو بكلمة طيبة ‏\"‏ ‏.‏ وقال إسحاق قال الأعمش عن عمرو بن مرة عن خيثمة ‏.‏",
      "text_en": " 'Adi b. Hatim reported Allah's Messenger (may peace be upon him) as saying:                      Allah will speak with everyone amongst you without any interpreter between them. He (the man) would see towards his right and would not find anything but (the deeds) which he had done before, and he would see towards the left and would not find anything but (the deeds) which he had done before. He would see in front of him and would find nothing but Fire just before his face. So protect (yourselves) against Fire even if it is with the help of half a date. A hadith like this has been transmitted by Khaithama and addition has been made in this of (these words) ;\" Even if it is with a good word.\"",
      "chain": [
        "20387",
        "30123",
        "30556",
        "20347",
        "11060",
        "11332",
        "212"
      ]
    },
    {
      "hadith_no": "2470",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثني علي بن حجر، أخبرنا إسماعيل بن إبراهيم، عن هشام، صاحب الدستوائي عن يحيى بن أبي كثير، عن هلال بن أبي ميمونة، عن عطاء بن يسار، عن أبي سعيد الخدري، قال جلس رسول الله صلى الله عليه وسلم على المنبر وجلسنا حوله فقال ‏\"‏ إن مما أخاف عليكم بعدي ما يفتح عليكم من زهرة الدنيا وزينتها ‏\"‏ ‏.‏ فقال رجل أويأتي الخير بالشر يا رسول الله قال فسكت عنه رسول الله صلى الله عليه وسلم فقيل له ما شأنك تكلم رسول الله صلى الله عليه وسلم ولا يكلمك قال ورئينا أنه ينزل عليه فأفاق يمسح عنه الرحضاء وقال ‏\"‏ إن هذا السائل - وكأنه حمده فقال - إنه لا يأتي الخير بالشر وإن مما ينبت الربيع يقتل أو يلم إلا آكلة الخضر فإنها أكلت حتى إذا امتلأت خاصرتاها استقبلت عين الشمس فثلطت وبالت ثم رتعت وإن هذا المال خضر حلو ونعم صاحب المسلم هو لمن أعطى منه المسكين واليتيم وابن السبيل أو كما قال رسول الله صلى الله عليه وسلم وإنه من يأخذه بغير حقه كان كالذي يأكل ولا يشبع ويكون عليه شهيدا يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Abu Said al-Khudri reported:                      The Messenger of Allah (may peace be upon him) was sitting on the pulpit and we were sitting around him, and he said: What I am afraid of in regard to you after my death is that there would be opened for you the adornments of the world and its beauties. A person said: Messenger of Allah, does good produce evil? The Messenger of Allah (may peace be upon him) remained silent. And it was said to him (the man who had asked the question from the Holy Prophet): What Is the matter with you, that you speak with the Messenger of Allah (may peace be upon him) but he does not speak with you? We thought as if revelation was descending upon him. He regained himself and wiped the sweat from him and said: He was the inquirer (and his style of expression showed as if he praised him and then added): Verily good does not produce evil. Whatever the spring rainfall causes to grow kills or is about to kill, but that (animal) which feeds on vegetation. It eats till its flanks are filled; it faces the sun and dungs and urinates. and then returns to eat. And this Wealth is a sweet vegetation, and it is a good companion for a Muslim who gives out of it to the needy, to the orphan. to the wayfarer, or something like that as the Messenger of Allah (may peace be upon him) said: He who takes it without his right is like one who eats but does not feel satisfied, and it would stand witness against him on the Day of judgment.",
      "chain": [
        "20387",
        "20208",
        "11449",
        "11229",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "2628",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني علي بن حجر، حدثنا سفيان، عن هشام بن عروة، عن أبيه، عن عائشة، - رضى الله عنها - قالت كان رسول الله صلى الله عليه وسلم يقبل إحدى نسائه وهو صائم ‏.‏ ثم تضحك ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) said that the Messenger of Allah (may peace be upon him) kissed one of his wives while he was fasting, and then she ('A'isha) smiled (as she narrated).",
      "chain": [
        "20387",
        "20012",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2629",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني علي بن حجر السعدي، وابن أبي عمر، قالا حدثنا سفيان، قال قلت لعبد الرحمن بن القاسم أسمعت أباك يحدث عن عائشة، - رضى الله عنها - أن النبي صلى الله عليه وسلم كان يقبلها وهو صائم فسكت ساعة ثم قال نعم ‏.‏",
      "text_en": " Sufyan reported:                      I said to 'Abd al-Rahman b. Qasim: Have you heard from your father narrating from 'A'isha (Allah be pleased with her) that he kissed her while observing fast? He ('Abd al-Rahman b. Qasim) kept silence for a short while and then said:\" Yes.\"",
      "chain": [
        "20387",
        "30421",
        "20005",
        "53"
      ]
    },
    {
      "hadith_no": "2633",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني علي بن حجر، وزهير بن حرب، قالا حدثنا سفيان، عن منصور، عن إبراهيم، عن علقمة، عن عائشة، - رضى الله عنها أن رسول الله صلى الله عليه وسلم كان يقبل وهو صائم وكان أملككم لإربه ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported:                      The Messenger of Allah (may peace be upon him) used to kiss (his wives) while fasting; and he had the greatest control over his desire (as compared with you).",
      "chain": [
        "20387",
        "30022",
        "20005",
        "11067",
        "11051",
        "11017",
        "53"
      ]
    },
    {
      "hadith_no": "2753",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني علي بن حجر السعدي، حدثنا علي بن مسهر أبو الحسن، عن عبد الله، بن عطاء عن عبد الله بن بريدة، عن أبيه، - رضى الله عنه - قال بينا أنا جالس، عند رسول الله صلى الله عليه وسلم إذ أتته امرأة فقالت إني تصدقت على أمي بجارية وإنها ماتت - قال - فقال ‏\"‏ وجب أجرك وردها عليك الميراث ‏\"‏ ‏.‏ قالت يا رسول الله إنه كان عليها صوم شهر أفأصوم عنها قال ‏\"‏ صومي عنها ‏\"‏ ‏.‏ قالت إنها لم تحج قط أفأحج عنها قال ‏\"‏ حجي عنها ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Buraida (Allah be pleased with him) reported on the authority of his father:                      When we were sitting with the Messenger of Allah (may peace be upon him), a woman came to him and said: I had gifted to my mother a maid-servant, and now she (the mother) has died. Thereupon he (the Holy Prophet) said: There is a definite reward for you and she (the maid-servant) has been returned to you as an inheritance. She (that woman) again said: Fasts of a month (of Ramadan) are due upon her; should I observe them on her behalf? He (the Holy Prophet) said: Observe fasts on her behalf. She (again) said: She did not perform Hajj, should I perform it on her behalf? He (the Holy Prophet) said: Perform Hajj on her behalf.",
      "chain": [
        "20387",
        "20345",
        "10785",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "2815",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا يحيى بن أيوب، وقتيبة بن سعيد، وعلي بن حجر، جميعا عن إسماعيل، - قال ابن أيوب حدثنا إسماعيل بن جعفر، - أخبرني سعد بن سعيد بن قيس، عن عمر، بن ثابت بن الحارث الخزرجي عن أبي أيوب الأنصاري، - رضى الله عنه - أنه حدثه أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من صام رمضان ثم أتبعه ستا من شوال كان كصيام الدهر ‏\"‏ ‏.‏",
      "text_en": " Abu Ayyub al-Ansari (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      He who observed the fast of Ramadan and then followed it with six (fasts) of Shawwal. it would be as if he fasted perpetually.",
      "chain": [
        "20379",
        "30367",
        "20387",
        "20208",
        "20155",
        "11896",
        "33"
      ]
    },
    {
      "hadith_no": "2853",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا سفيان بن عيينة، ح وحدثنا يحيى بن يحيى، أخبرنا هشيم، ح وحدثنا أبو كريب، حدثنا وكيع، عن سفيان، ح وحدثنا علي بن خشرم، أخبرنا عيسى بن يونس، عن ابن جريج، ح وحدثني علي بن حجر، حدثنا إسماعيل، عن أيوب، كل هؤلاء عن عمرو بن دينار، بهذا الإسناد ولم يذكر أحد منهم يخطب بعرفات ‏.‏ غير شعبة وحده ‏.‏",
      "text_en": " This hadith has been narrated on the authority of 'Amr b. Dinar with the same chain of transmitters, but none of them (the narrators) made a mention that he (the Holy Prophet) was delivering address at 'Arafia except Shu'ba.",
      "chain": [
        "30201",
        "20005",
        "30399",
        "20468",
        "30216",
        "20032",
        "20012",
        "30556",
        "20347",
        "11070",
        "20387",
        "20208"
      ]
    }
  ],
  "total_hadiths": 410
}