{
  "id": "20381",
  "name": "Hajjaj bin Muhammad al-Musaysi حجاج بن محمد المصيصي الأعور",
  "full_name": "Hajjaj bin Muhammad al-Musaysi حجاج بن محمد المصيصي الأعور",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "206",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Tirmidh",
      "al-Musaysa",
      "Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "Clinet",
      "al-Musaysi",
      "Baghdad"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11684",
      "name": "Huraiz bin 'Uthman bin Jabir حريز بن عثمان بن جبر الرحبي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10846",
      "name": "Yonus bin Abi Ishaq يونس بن أبي إسحاق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20583",
      "name": "Hamza bin Habib al-Zayat حمزة بن حبيب الزيات",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30399",
      "name": "Yahya bin Yahya bin Bukayr يحيى بن يحيى بن بكير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36618",
      "name": "al-Qasim bin Salam القاسم بن سلام",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30315",
      "name": "Isma'il bin Ibrahim,Abu Ma'mar al-Hadhli إسماعيل بن إبراهيم بن معمر أبو معمر",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "19231",
      "name": "Abu Ja'far أبو جعفر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30272",
      "name": "Muhammad bin 'Abdul Rahim bin Abi Zuhayr محمد بن عبد الرحيم بن أبي زهير البزاز",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30273",
      "name": "Muhammad bin 'Ubaidullah محمد بن عبيد الله بن يزيد البغدادي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30585",
      "name": "'Abbas bin Muhammad bin Hatm عباس بن محمد بن حاتم",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1456",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو عاصم، عن ابن جريج، وحدثني محمد بن عبد الرحيم، عن حجاج بن محمد، عن ابن جريج، قال أخبرني ابن أبي مليكة، عن عباد بن عبد الله بن الزبير، أخبره عن أسماء بنت أبي بكر  رضى الله عنهما  أنها جاءت إلى النبي صلى الله عليه وسلم فقال ‏\"‏ لا توعي فيوعي الله عليك، ارضخي ما استطعت ‏\"‏‏.‏",
      "text_en": " Narrated Asma' bint Abu Bakr:                     that she had gone to the Prophet and he said, \"Do not shut your money bag; otherwise Allah too will withhold His blessings from you. Spend (in Allah's Cause) as much as you can afford. \"",
      "chain": [
        "20241",
        "11070",
        "30272",
        "20381",
        "11070",
        "11090",
        "11250",
        "70"
      ]
    },
    {
      "hadith_no": "1594",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا حجاج بن محمد الأعور، عن شعبة، عن عمرو بن مرة، عن سعيد بن المسيب، قال اختلف علي وعثمان  رضى الله عنهما  وهما بعسفان في المتعة، فقال علي ما تريد إلا أن تنهى عن أمر فعله النبي صلى الله عليه وسلم‏.‏ فلما رأى ذلك علي أهل بهما جميعا‏.‏",
      "text_en": " Narrated Sa`id bin Al-Musaiyab:                     `Ali and `Uthman differed regarding Hajj-at-Tamattu` while they were at 'Usfan (a familiar place near Mecca). `Ali said, \"I see you want to forbid people to do a thing that the Prophet did?\" When `Ali saw that, he assumed Ihram for both Hajj and `Umra.",
      "chain": [
        "30367",
        "20381",
        "20020",
        "11381",
        "11002"
      ]
    },
    {
      "hadith_no": "1777",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا مسدد، عن عبد الواحد، حدثنا الأعمش، قال سمعت الحجاج، يقول على المنبر السورة التي يذكر فيها البقرة، والسورة التي يذكر فيها آل عمران، والسورة التي يذكر فيها النساء‏.‏ قال فذكرت ذلك لإبراهيم، فقال حدثني عبد الرحمن بن يزيد أنه كان مع ابن مسعود  رضى الله عنه  حين رمى جمرة العقبة، فاستبطن الوادي، حتى إذا حاذى بالشجرة اعترضها، فرمى بسبع حصيات، يكبر مع كل حصاة، ثم قال من ها هنا والذي لا إله غيره قام الذي أنزلت عليه سورة البقرة صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Al-A`mash:                     I heard Al-Hajjaj saying on the pulpit, \"The Sura in which Al-Baqara (the cow) is mentioned and the Sura in which the family of `Imran is mentioned and the Sura in which the women (An-Nisa) is mentioned.\" I mentioned this to Ibrahim, and he said, `Abdur-Rahman bin Yazid told me, 'I was with Ibn Mas`ud, when he did the Rami of the Jamrat-ul-Aqaba. He went down the middle of the valley, and when he came near the tree (which was near the Jamra) he stood opposite to it and threw seven small pebbles and said: 'Allahu-Akbar' on throwing every pebble.' Then he said, 'By Him, except Whom none has the right to be worshipped, here (at this place) stood the one on whom Surat-al-Baqra was revealed (i.e. Allah's Apostle).' \"",
      "chain": [
        "30175",
        "20256",
        "11060",
        "20381",
        "20395"
      ]
    },
    {
      "hadith_no": "3593",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا الحسن بن منصور أبو علي، حدثنا حجاج بن محمد الأعور، بالمصيصة حدثنا شعبة، عن الحكم، قال سمعت أبا جحيفة، قال خرج رسول الله صلى الله عليه وسلم بالهاجرة إلى البطحاء فتوضأ ثم صلى الظهر ركعتين، والعصر ركعتين، وبين يديه عنزة‏.‏ ‏{‏قال شعبة‏}‏ وزاد فيه عون عن أبيه أبي جحيفة قال كان يمر من ورائها المرأة، وقام الناس فجعلوا يأخذون يديه، فيمسحون بها وجوههم، قال فأخذت بيده، فوضعتها على وجهي، فإذا هي أبرد من الثلج، وأطيب رائحة من المسك‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     Once Allah's Apostle went to Al-Batha' at noon, performed the ablution and offered' a two rak`at Zuhr prayer and a two-rak`at `Asr prayer while a spearheaded stick was planted before him and the passersby were passing in front of it. (After the prayer), the people got up and held the hands of the Prophet and passed them on their faces. I also took his hand and kept it on my face and noticed that it was colder than ice, and its smell was nicer than musk.",
      "chain": [
        "20381",
        "20020",
        "11069",
        "4047"
      ]
    },
    {
      "hadith_no": "4611",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا ابن مقاتل، أخبرنا الحجاج، عن ابن جريج، أخبرني ابن أبي مليكة، عن حميد بن عبد الرحمن بن عوف، أنه أخبره أن مروان بهذا‏.‏",
      "text_en": " Narrated Humaid bin `Abdur-Rahman bin `Auf:                     That Marwan had told him (the above narration No. 91).",
      "chain": [
        "30118",
        "20381",
        "11070",
        "11090",
        "10561"
      ]
    },
    {
      "hadith_no": "4627",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا صدقة بن الفضل، أخبرنا حجاج بن محمد، عن ابن جريج، عن يعلى بن مسلم، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  ‏{‏أطيعوا الله وأطيعوا الرسول وأولي الأمر منكم‏}‏‏.‏ قال نزلت في عبد الله بن حذافة بن قيس بن عدي، إذ بعثه النبي صلى الله عليه وسلم في سرية‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Verse: \"Obey Allah and Obey the Apostle and those of you (Muslims) who are in authority.\" (4.59) was revealed in connection with `Abdullah bin Hudhafa bin Qais bin `Adi' when the Prophet appointed him as the commander of a Sariyya (army detachment).",
      "chain": [
        "30343",
        "20381",
        "11070",
        "11568",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "4736",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب،‏.‏ قال وحدثنا الحجاج، حدثنا عبد الله بن عمر النميري، حدثنا يونس بن يزيد الأيلي، قال سمعت الزهري، سمعت عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله، عن حديث، عائشة زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا فبرأها الله، كل حدثني طائفة من الحديث قال النبي صلى الله عليه وسلم ‏\"‏ إن كنت بريئة فسيبرئك الله، وإن كنت ألممت بذنب فاستغفري الله وتوبي إليه ‏\"‏‏.‏ قلت إني والله لا أجد مثلا إلا أبا يوسف ‏{‏فصبر جميل والله المستعان على ما تصفون‏}‏ وأنزل الله ‏{‏إن الذين جاءوا بالإفك‏}‏ العشر الآيات‏.‏",
      "text_en": " Narrated Az-Zuhri:                     `Urwa bin Az-Zubair, Sa`id bin Al-Musaiyab, 'Al-Qama bin Waqqas and 'Ubaidullah bin `Abdullah related the narration of `Aisha, the wife the Prophet, when the slanderers had said about her what they had said and Allah later declared her innocence. Each of them related a part of the narration (wherein) the Prophet said (to `Aisha). \"If you are innocent, then Allah will declare your innocence: but if you have committed a sin, then ask for Allah's Forgiveness and repent to him.\" `Aisha said, \"By Allah, I find no example for my case except that of Joseph's father (when he said), 'So (for me) patience is most fitting.' \" Then Allah revealed the ten Verses:-- \"Verily those who spread the slander are a gang amongst you..\" (24.11)",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "20381",
        "20434",
        "20475",
        "11013",
        "10511",
        "11002",
        "11042",
        "11004"
      ]
    },
    {
      "hadith_no": "6760",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا عبد العزيز، حدثنا إبراهيم، عن صالح، عن ابن شهاب، ح وحدثنا الحجاج، حدثنا عبد الله بن عمر النميري، حدثنا يونس بن يزيد الأيلي، قال سمعت الزهري، قال سمعت عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله بن عتبة، عن حديث، عائشة زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا، فبرأها الله مما قالوا  كل حدثني طائفة من الحديث  فأنزل الله ‏{‏إن الذين جاءوا بالإفك‏}‏ العشر الآيات كلها في براءتي‏.‏ فقال أبو بكر الصديق  وكان ينفق على مسطح لقرابته منه  والله لا أنفق على مسطح شيئا أبدا، بعد الذي قال لعائشة‏.‏ فأنزل الله ‏{‏ولا يأتل أولو الفضل منكم والسعة أن يؤتوا أولي القربى‏}‏ الآية‏.‏ قال أبو بكر بلى والله إني لأحب أن يغفر الله لي‏.‏ فرجع إلى مسطح النفقة التي كان ينفق عليه وقال والله لا أنزعها عنه أبدا‏.‏",
      "text_en": " Narrated Az-Zuhri:                     I heard `Urwa bin Az-Zubair, Sa`id bin Al-Musaiyab, 'Alqama bin Waqqas and 'Ubaidullah bin `Abdullah bin `Uqba relating from `Aisha, the wife of the Prophet the narration of the people (i.e. the liars) who spread the slander against her and they said what they said, and how Allah revealed her innocence. Each of them related to me a portion of that narration. (They said that `Aisha said), ''Then Allah revealed the ten Verses starting with:--'Verily! Those who spread the slander..' (24.11-21) All these verses were in proof of my innocence. Abu Bakr As-Siddiq who used to provide for Mistah some financial aid because of his relation to him, said, \"By Allah, I will never give anything (in charity) to Mistah, after what he has said about `Aisha\" Then Allah revealed:-- 'And let not those among you who are good and are wealthy swear not to give (any sort of help) to their kins men....' (24.22) On that, Abu Bakr said, \"Yes, by Allah, I like that Allah should forgive me.\" and then resumed giving Mistah the aid he used to give him and said, \"By Allah! I will never withhold it from him.\"",
      "chain": [
        "20167",
        "20150",
        "11176",
        "11013",
        "20381",
        "20434",
        "20475",
        "11013",
        "10511",
        "11002",
        "11042",
        "11004"
      ]
    },
    {
      "hadith_no": "6773",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا الحسن بن محمد، حدثنا الحجاج، عن ابن جريج، قال زعم عطاء أنه سمع عبيد بن عمير، يقول سمعت عائشة، تزعم أن النبي صلى الله عليه وسلم كان يمكث عند زينب بنت جحش، ويشرب عندها عسلا، فتواصيت أنا وحفصة أن أيتنا دخل عليها النبي صلى الله عليه وسلم فلتقل إني أجد منك ريح مغافير، أكلت مغافير فدخل على إحداهما فقالت ذلك له‏.‏ فقال ‏\"‏ لا بل شربت عسلا عند زينب بنت جحش، ولن أعود له ‏\"‏‏.‏ فنزلت ‏{‏يا أيها النبي لم تحرم ما أحل الله لك‏}‏، ‏{‏إن تتوبا إلى الله‏}‏، لعائشة وحفصة، ‏{‏وإذ أسر النبي إلى بعض أزواجه حديثا‏}‏ لقوله ‏\"‏ بل شربت عسلا ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet used to stay (for a period) in the house of Zainab bint Jahsh (one of the wives of the Prophet ) and he used to drink honey in her house. Hafsa and I decided that when the Prophet entered upon either of us, she would say, \"I smell in you the bad smell of Maghafir (a bad smelling raisin). Have you eaten Maghafir?\" When he entered upon one of us, she said that to him. He replied (to her), \"No, but I have drunk honey in the house of Zainab bint Jahsh, and I will never drink it again.\" Then the following verse was revealed: 'O Prophet ! Why do you ban (for you) that which Allah has made lawful for you?. ..(up to) If you two (wives of the Prophet turn in repentance to Allah.' (66.1-4) The two were `Aisha and Hafsa And also the Statement of Allah: 'And (Remember) when the Prophet disclosed a matter in confidence to one of his wives!' (66.3) i.e., his saying, \"But I have drunk honey.\" Hisham said: It also meant his saying, \"I will not drink anymore, and I have taken an oath, so do not inform anybody of that.\"",
      "chain": [
        "30245",
        "20381",
        "11070",
        "11259"
      ]
    },
    {
      "hadith_no": "337",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثني محمد بن حاتم بن ميمون، وإبراهيم بن دينار، - واللفظ لإبراهيم - قالا حدثنا حجاج، - وهو ابن محمد - عن ابن جريج، قال أخبرني يعلى بن مسلم، أنه سمع سعيد بن جبير، يحدث عن ابن عباس، أن ناسا، من أهل الشرك قتلوا فأكثروا وزنوا فأكثروا ثم أتوا محمدا صلى الله عليه وسلم فقالوا إن الذي تقول وتدعو لحسن ولو تخبرنا أن لما عملنا كفارة فنزل ‏{‏ والذين لا يدعون مع الله إلها آخر ولا يقتلون النفس التي حرم الله إلا بالحق ولا يزنون ومن يفعل ذلك يلق أثاما‏}‏ ونزل ‏{‏ يا عبادي الذين أسرفوا على أنفسهم لا تقنطوا من رحمة الله‏{‏ ‏.‏",
      "text_en": " It is narrated on the authority of Ibn 'Abbas that some persons amongst the polytheist had committed a large number of murders and had excessively indulged in fornication. Then they came to Muhammad (may peace be upon him) and said:                      Whatever you assert and whatever you call to is indeed good. But if you inform us that there is atonement of our past deeds (then we would embrace Islam). Then it was revealed: And those who call not unto another god along with Allah and slay not any soul which Allah has forbidden except in the cause of justice, nor commit fornication; and he who does this shall meet the requital of sin. Multiplied for him shall be the torment on the Day of Resurrection, and he shall therein abide disgraced, except him who repents a believes and does good deeds. Then these! for the Allah shall change their vices into virtues. Verily Allah is Ever Forgiving, Merciful (xxv. 68-70). Say thou: O my bondsmen woo have committed extravagance against themselves despair not of the Mercy of Allah I Verily Allah will forgive the sins altogether. He is indeed the Forgiving, the Merciful (xxxix. 53).",
      "chain": [
        "30514",
        "30496",
        "20381",
        "11070",
        "11568",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "412",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا الوليد بن شجاع، وهارون بن عبد الله، وحجاج بن الشاعر، قالوا حدثنا حجاج، - وهو ابن محمد - عن ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ لا تزال طائفة من أمتي يقاتلون على الحق ظاهرين إلى يوم القيامة - قال - فينزل عيسى ابن مريم صلى الله عليه وسلم فيقول أميرهم تعال صل لنا ‏.‏ فيقول لا ‏.‏ إن بعضكم على بعض أمراء ‏.‏ تكرمة الله هذه الأمة ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      I heard the Messenger of Allah (may peace be upon him) say: A section of my people will not cease fighting for the Truth and will prevail till the Day of Resurrection. He said: Jesus son of Mary would then descend and their (Muslims') commander would invite him to come and lead them in prayer, but he would say: No, some amongst you are commanders over some (amongst you). This is the honour from Allah for this Ummah.",
      "chain": [
        "30482",
        "30524",
        "38834",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "377",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا إسحاق بن إبراهيم الحنظلي، حدثنا محمد بن بكر، ح وحدثنا محمد بن رافع، حدثنا عبد الرزاق، قالا أخبرنا ابن جريج، ح وحدثني هارون بن عبد الله، - واللفظ له - قال حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني نافع، مولى ابن عمر عن عبد الله بن عمر، أنه قال كان المسلمون حين قدموا المدينة يجتمعون فيتحينون الصلوات وليس ينادي بها أحد فتكلموا يوما في ذلك فقال بعضهم اتخذوا ناقوسا مثل ناقوس النصارى وقال بعضهم قرنا مثل قرن اليهود فقال عمر أولا تبعثون رجلا ينادي بالصلاة قال رسول الله صلى الله عليه وسلم ‏\"‏ يا بلال قم فناد بالصلاة ‏\"‏ ‏.‏",
      "text_en": " Ibn Umar reported:                      When the Muslims came to Medina, they gathered and sought to know the time of prayer but no one summoned them. One day they discussed the matter, and some of them said: Use something like the bell of the Christians and some of them said: Use horn like that of the Jews. Umar said: Why may not a be appointed who should call (people) to prayer? The Messenger of Allah (may peace be upon him) said: O Bilal, get up and summon (the people) to prayer.",
      "chain": [
        "30021",
        "20277",
        "30375",
        "20121",
        "11070",
        "20381",
        "11070",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "455",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا هارون بن عبد الله، حدثنا حجاج بن محمد، عن ابن جريج، ح قال وحدثني محمد بن رافع، - وتقاربا في اللفظ - حدثنا عبد الرزاق، أخبرنا ابن جريج، قال سمعت محمد بن عباد بن جعفر، يقول أخبرني أبو سلمة بن سفيان، وعبد الله بن عمرو بن العاص، وعبد الله بن المسيب العابدي، عن عبد الله بن السائب، قال صلى لنا النبي صلى الله عليه وسلم الصبح بمكة فاستفتح سورة المؤمنين حتى جاء ذكر موسى وهارون أو ذكر عيسى - محمد بن عباد يشك أو اختلفوا عليه - أخذت النبي صلى الله عليه وسلم سعلة فركع وعبد الله بن السائب حاضر ذلك ‏.‏ وفي حديث عبد الرزاق فحذف فركع ‏.‏ وفي حديثه وعبد الله بن عمرو ‏.‏ ولم يقل ابن العاص ‏.‏",
      "text_en": " Abdullah b. Sa'id reported:                      The Apostle of Allah (may peace be upon him) led us in the morning prayer in Mecca and began Sarat al-Mu'minin (xxiii ) but when he came to the mention of Moses and Aaron (verse. 45) or to the mention of Jesus (verse 50), a cough got the better of him, and he bowed. 'Abdullah b. Sa'ib was present there, and in the hadith narrated by Abd al-Razzaq (the words are): He cut short (the recitation) and bowed.",
      "chain": [
        "30524",
        "20381",
        "11070",
        "30375",
        "20121",
        "11070",
        "11262",
        "29"
      ]
    },
    {
      "hadith_no": "1477",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني إسحاق بن إبراهيم، ومحمد بن حاتم، كلاهما عن محمد بن بكر، ح قال وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، ح قال وحدثني حجاج بن الشاعر، ومحمد بن رافع، قالا حدثنا عبد الرزاق، - وألفاظهم متقاربة - قالوا جميعا عن ابن جريج، قال أخبرني المغيرة بن حكيم، عن أم كلثوم بنت أبي بكر، أنها أخبرته عن عائشة، قالت أعتم النبي صلى الله عليه وسلم ذات ليلة حتى ذهب عامة الليل وحتى نام أهل المسجد ثم خرج فصلى فقال ‏\"‏ إنه لوقتها لولا أن أشق على أمتي ‏\"‏ ‏.‏ وفي حديث عبد الرزاق ‏\"‏ لولا أن يشق على أمتي ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported:                      The Apostle of Allah (may peace be upon him) one night delayed (observing the 'Isya' prayer) till a great part of the night was over and the people in the mosque had gone to sleep. He (the Holy Prophet) then came out and observed prayer and said: This is the proper time for it; were it not that I would impose a burden on my people (I would normally pray at this time). In the hadith transmitters by 'Abd al-Razzaq (the words are):\" Were it not that it would impose burden on my people.\"",
      "chain": [
        "30123",
        "38487",
        "20277",
        "30524",
        "20381",
        "38834",
        "30375",
        "11070",
        "10966",
        "10500"
      ]
    },
    {
      "hadith_no": "1508",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني هارون بن عبد الله، ومحمد بن حاتم، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني عمر بن عطاء بن أبي الخوار، أنه بينا هو جالس مع نافع بن جبير بن مطعم إذ مر بهم أبو عبد الله ختن زيد بن زبان مولى الجهنيين فدعاه نافع فقال سمعت أبا هريرة يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ صلاة مع الإمام أفضل من خمس وعشرين صلاة يصليها وحده ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (way peace be upon him) said: Prayer along with the Imam is twenty-five times more excellent than prayer said by a single person.",
      "chain": [
        "30524",
        "38487",
        "20381",
        "11070",
        "10654",
        "13"
      ]
    },
    {
      "hadith_no": "1744",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني محمد بن حاتم، وهارون بن عبد الله، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني عثمان بن أبي سليمان، أن أبا سلمة بن عبد الرحمن، أخبره أن عائشة أخبرته أن النبي صلى الله عليه وسلم لم يمت حتى كان كثير من صلاته وهو جالس ‏.‏",
      "text_en": " 'A'isha reported:                      When the Messenger of Allah (may peace be upon him) grew bulky and heavy he would observe (most of his Nafl) prayers sitting.",
      "chain": [
        "38487",
        "30524",
        "20381",
        "11070",
        "10649",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "1792",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني نافع، أن ابن عمر، كان يقول من صلى من الليل فليجعل آخر صلاته وترا قبل الصبح كذلك كان رسول الله صلى الله عليه وسلم يأمرهم ‏.‏",
      "text_en": " Ibn 'Umar reported Allah's Messenger (way peace be upon him) as saying:                      Witr is a rak'ah at the end of the prayer.",
      "chain": [
        "30524",
        "20381",
        "11070",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2080",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني عمر بن عطاء، أن نافع بن جبير، أرسله إلى السائب بن يزيد ابن أخت نمر ‏.‏ وساق الحديث بمثله غير أنه قال فلما سلم قمت في مقامي ولم يذكر الإمام ‏.‏",
      "text_en": " The same hadith is narrated on the authority of 'Umar b. Ata' but with this modification:                      When he (the Imam) pronounced salutation I stood up at my place. No mention was made of the Imam in it.",
      "chain": [
        "30524",
        "20381",
        "11070",
        "13541",
        "11059"
      ]
    },
    {
      "hadith_no": "2228",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا هارون بن عبد الله، وحجاج بن الشاعر، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يحدث أن النبي صلى الله عليه وسلم خطب يوما فذكر رجلا من أصحابه قبض فكفن في كفن غير طائل وقبر ليلا فزجر النبي صلى الله عليه وسلم أن يقبر الرجل بالليل حتى يصلى عليه إلا أن يضطر إنسان إلى ذلك وقال النبي صلى الله عليه وسلم ‏\"‏ إذا كفن أحدكم أخاه فليحسن كفنه ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      Allah's Messenger (may peace be upon him) one day in the course of his sermon made mention of a person among his Companions who had died and had been wrapped in a shroud not long (enough to cover his whole body) and was buried during the night. The Apostle of Allah (may peace be upon him) reprimanded (the audience) that a person was buried during the night (in a state that) funeral prayer could not be offered (over him by the Messenger of Allah). (And this is permissible only) when it becomes a dire necessity for a man. The Apostle of Allah (may peace be upon him) also said: When any one of you shrouds his brother, he should shroud him well.",
      "chain": [
        "30524",
        "38834",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "2290",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، ح وحدثني محمد بن رافع، حدثنا عبد الرزاق، جميعا عن ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابر بن عبد، الله يقول سمعت النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " A hadith like this has been transmitted on the authority of Jabir b. 'Abdullah.",
      "chain": [
        "30524",
        "20381",
        "30375",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "2425",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني محمد بن حاتم، وهارون بن عبد الله، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني ابن أبي مليكة، أن عباد بن عبد الله بن الزبير، أخبره عن أسماء، بنت أبي بكر أنها جاءت النبي صلى الله عليه وسلم فقالت يا نبي الله ليس لي شىء إلا ما أدخل على الزبير فهل على جناح أن أرضخ مما يدخل على فقال ‏\"‏ ارضخي ما استطعت ولا توعي فيوعي الله عليك ‏\"‏ ‏.‏",
      "text_en": " Asma', daughter of Abu Bakr, reported that abe came to the Apostle of Allah (may peace he upon him) and said:                      Apostle of Allah, I have nothing with me, but only, that which is given to me by Zubair (for household expenses). Is there any sin for me if I spend out of that which is given to me (by Zabair)? Upon this he (the Holy Prophet) said: Spend according to your means; and do not hoard, for Allah will withhold from you.",
      "chain": [
        "38487",
        "30524",
        "20381",
        "11070",
        "11090",
        "11250",
        "70"
      ]
    },
    {
      "hadith_no": "2465",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني زهير بن حرب، وهارون بن عبد الله، قالا حدثنا حجاج بن محمد، عن ابن جريج، قال سمعت عطاء، يقول سمعت ابن عباس، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لو أن لابن آدم ملء واد مالا لأحب أن يكون إليه مثله ولا يملأ نفس ابن آدم إلا التراب والله يتوب على من تاب ‏\"‏ ‏.‏ قال ابن عباس فلا أدري أمن القرآن هو أم لا ‏.‏ وفي رواية زهير قال فلا أدري أمن القرآن ‏.‏ لم يذكر ابن عباس ‏.‏",
      "text_en": " Ibn Abbas reported Allah's Messenger (may peace be upon him) as saying:                      If there were for the son of Adam a valley full of riches, he would long to possess another one like it. and Ibn Adam does not feel satiated but with dust. 1413 And Allah returns to him who returns (to HiM). 1414 Ibn Abbas said: I do not know whether it is from the Qur'an or not; and in the narration transmitted by Zuhair it was said: I do not know whether it is from the Qur'an, and he made no mention of Ibn Abbas.",
      "chain": [
        "30022",
        "30524",
        "20381",
        "11070",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "2574",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني هارون بن عبد الله، وحجاج بن الشاعر، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، - رضى الله عنهما - يقول اعتزل النبي صلى الله عليه وسلم نساءه شهرا فخرج إلينا صباح تسع وعشرين فقال بعض القوم يا رسول الله إنما أصبحنا لتسع وعشرين ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن الشهر يكون تسعا وعشرين ‏\"‏ ‏.‏ ثم طبق النبي صلى الله عليه وسلم بيديه ثلاثا مرتين بأصابع يديه كلها والثالثة بتسع منها ‏.‏",
      "text_en": " Abu Zubair is reported to have heard Jabir b. 'Abdullah (Allah be pleased with both of them) as saying:                      The Apostle of Allah (may peace be upon him) separated himself from his wives for a month. (His wives said: ) He came to us on the morning of the twenty-ninth. Upon this some, of the people said: It is the morning of twenty- ninth (according to our calculation). Upon this the Apostle of Allah (may peace be upon him) said: The month. may also consist of twenty-nine days. The Apostle of Allah (may peace be upon him) then flapped his bands thrice, twice with all the fingers of both his hand (to indicate twenty-nine) and by the third time with nine (fingers).",
      "chain": [
        "30524",
        "38834",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "2575",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني يحيى بن عبد الله بن محمد بن صيفي، أن عكرمة بن عبد الرحمن بن الحارث، أخبره أن أم سلمة - رضى الله عنها - أخبرته أن النبي صلى الله عليه وسلم حلف أن لا يدخل على بعض أهله شهرا فلما مضى تسعة وعشرون يوما غدا عليهم - أو راح - فقيل له حلفت يا نبي الله أن لا تدخل علينا شهرا ‏.‏ قال ‏\"‏ إن الشهر يكون تسعة وعشرين يوما ‏\"‏ ‏.‏",
      "text_en": " Umm Salama (Allah be pleased with him) reported that the Apostle of Allah (may peace be upon him) took an oath that he would not go to some of his wives for the whole of the month. When twenty-nine days bad passed he (the Holy Prophet) went to them in the morning or in the evening. Upon this it was said to him:                      Apostle of Allah, you took an oath that you would not come to us for a month, whereupon he said: The month may also consist of twenty-nine days.",
      "chain": [
        "30524",
        "20381",
        "11070",
        "11448",
        "56"
      ]
    },
    {
      "hadith_no": "2878",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني صالح بن كيسان، عن نافع، عن ابن عمر، - رضى الله عنهما - أنه كان يخبر أن النبي صلى الله عليه وسلم أهل حين استوت به ناقته قائمة ‏.‏",
      "text_en": " Ibn 'Umar (Allah be pleased with them) reported that the Apostle of Allah (may peace be upon him) pronounced Talbiya as his camel stood up.",
      "chain": [
        "30524",
        "20381",
        "11070",
        "11176",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3193",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني يعقوب الدورقي، حدثنا ابن أبي زائدة، ح وحدثنا ابن أبي عمر، حدثنا سفيان، كلاهما عن الأعمش، قال سمعت الحجاج، يقول لا تقولوا سورة البقرة ‏.‏ واقتصا الحديث بمثل حديث ابن مسهر ‏.‏",
      "text_en": " A'mash reported:                      I heard Hajjaj saying I Do not say Surah al-Baqara. The rest of the hadith is the same.",
      "chain": [
        "30400",
        "20366",
        "30421",
        "11060",
        "20381"
      ]
    },
    {
      "hadith_no": "3339",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أن عليا الأزدي، أخبره أن ابن عمر علمهم أن رسول الله صلى الله عليه وسلم كان إذا استوى على بعيره خارجا إلى سفر كبر ثلاثا ثم قال ‏\"‏ سبحان الذي سخر لنا هذا وما كنا له مقرنين وإنا إلى ربنا لمنقلبون اللهم إنا نسألك في سفرنا هذا البر والتقوى ومن العمل ما ترضى اللهم هون علينا سفرنا هذا واطو عنا بعده اللهم أنت الصاحب في السفر والخليفة في الأهل اللهم إني أعوذ بك من وعثاء السفر وكآبة المنظر وسوء المنقلب في المال والأهل ‏\"‏ ‏.‏ وإذا رجع قالهن ‏.‏ وزاد فيهن ‏\"‏ آيبون تائبون عابدون لربنا حامدون ‏\"‏ ‏.‏",
      "text_en": " Ibn Umar (Allah be pleased with them) reported that whenever Allah's Messenger (may peace be upon him) mounted his camel while setting out on a journey, he glorified Allah (uttered Allah-o-Akbar) thrice, and then said:                      Hallowed is He Who subdued for us this (ride) and we were not ourselves powerful enough to use It as a ride, and we are going to return to our Lord. O Allah, we seek virtue and piety from Thee in this journey of ours and the act which pleaseth Thee. O Allah, lighten this journey of ours, and make its distance easy for us. O Allah, Thou art (our) companion during the journey, and guardian of (our) family. O Allah, I seek refuge with Thee from hardships of the journey, gloominess of the sights, and finding of evil changes in property and family on return. And he (the Holy Prophet) uttered (these words), and made this addition to them: We are returning, repentant, worshipping our Lord. and praising Him.",
      "chain": [
        "30524",
        "20381",
        "11070",
        "11263"
      ]
    },
    {
      "hadith_no": "3424",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني محمد بن حاتم، وإبراهيم بن دينار، قالا حدثنا حجاج بن محمد، ح وحدثني محمد بن رافع، حدثنا عبد الرزاق، كلاهما عن ابن جريج، أخبرني عبد الله بن عبد الرحمن، بن يحنس عن أبي عبد الله القراظ، أنه قال أشهد على أبي هريرة أنه قال قال أبو القاسم صلى الله عليه وسلم ‏\"‏ من أراد أهل هذه البلدة بسوء - يعني المدينة - أذابه الله كما يذوب الملح في الماء ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported that Abu'I-Qasim (Mubammad, may peace be upon him) said:                      He who intends to do harm to the people of this city (that is, Medina). Allah would efface him as salt is dissolved in water.",
      "chain": [
        "38487",
        "30496",
        "20381",
        "30375",
        "11070",
        "10663",
        "11846"
      ]
    },
    {
      "hadith_no": "3536",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج ح وحدثناه إسحاق بن إبراهيم، ومحمد بن رافع، عن عبد الرزاق، أخبرنا ابن جريج، أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول نهى رسول الله صلى الله عليه وسلم عن الشغار ‏.‏",
      "text_en": " Jabir b. Abdullah (Allah be pleased with him) reported that Allah's Messenger (may peace be upon him) prohibited Shighar.",
      "chain": [
        "30524",
        "20381",
        "11070",
        "30123",
        "30375",
        "20121",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3589",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، عن ابن جريج، أخبرني موسى بن عقبة، عن نافع، قال سمعت عبد الله بن عمر، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ أجيبوا هذه الدعوة إذا دعيتم لها ‏\"‏ ‏.‏ قال وكان عبد الله بن عمر يأتي الدعوة في العرس وغير العرس ويأتيها وهو صائم ‏.‏",
      "text_en": " Nafil reported:                      I heard Abdullah b. Umar (Allah be pleased with them) narrating that Allah's Messenger (may peace be upon him) said: Accept the feast when you are invited to it. And Abdullah (b. Umar) used to come to the feast, whether it was a wedding feast or other than that, and he would come there even in the state of fasting.",
      "chain": [
        "30524",
        "20381",
        "11070",
        "11106",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3743",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع عبد الرحمن بن أيمن، مولى عزة يسأل ابن عمر وأبو الزبير يسمع ذلك كيف ترى في رجل طلق امرأته حائضا فقال طلق ابن عمر امرأته وهى حائض على عهد رسول الله صلى الله عليه وسلم فسأل عمر رسول الله صلى الله عليه وسلم فقال إن عبد الله بن عمر طلق امرأته وهى حائض ‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ ليراجعها ‏\"‏ ‏.‏ فردها وقال ‏\"‏ إذا طهرت فليطلق أو ليمسك ‏\"‏ ‏.‏ قال ابن عمر وقرأ النبي صلى الله عليه وسلم يا أيها النبي إذا طلقتم النساء فطلقوهن في قبل عدتهن ‏.‏",
      "text_en": " Abu Zubair reported that he heard 'Abd al-Rahman b. Aiman (the freed slave of 'Azza) say that he asked Ibn 'Umar (Allah be pleased with them) and Abu Zubair heard:                      What is your opinion about the person who divorced his wife in the state of menses? Thereupon he said: Ibn Umar (Allah be pleased with them) divorced his wife during the lifetime of Allah's Messenger (may peace be upon him) while she was in the state of menses. Upon this Allah's Messenger (may peace be upon him) told him to take her back and so he took her back and he (further) said: When she is pure, then either divorce her or retain her. Ibn 'Umar (Allah be pleased with them) said that Allah's Apostle (may peace be upon him) then recited this verse:\" O Apostle, when you divorce women, divorce them at the commencement of their prescribed period\" (Ixv 1).",
      "chain": [
        "30524",
        "20381",
        "11070",
        "11263"
      ]
    },
    {
      "hadith_no": "3751",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا حجاج بن محمد، أخبرنا ابن جريج، أخبرني عطاء، أنه سمع عبيد بن عمير، يخبر أنه سمع عائشة، تخبر أن النبي صلى الله عليه وسلم كان يمكث عند زينب بنت جحش فيشرب عندها عسلا قالت فتواطأت أنا وحفصة أن أيتنا ما دخل عليها النبي صلى الله عليه وسلم فلتقل إني أجد منك ريح مغافير أكلت مغافير فدخل على إحداهما فقالت ذلك له ‏.‏ فقال ‏\"‏ بل شربت عسلا عند زينب بنت جحش ولن أعود له ‏\"‏ ‏.‏ فنزل ‏{‏ لم تحرم ما أحل الله لك‏}‏ إلى قوله ‏{‏ إن تتوبا‏}‏ لعائشة وحفصة ‏{‏ وإذ أسر النبي إلى بعض أزواجه حديثا‏}‏ لقوله ‏\"‏ بل شربت عسلا ‏\"‏ ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) narrated that Allah's Apostle (may peace be upon him) used to spend time with Zainab daughter of Jahsh and drank honey at her house. She ('A'isha further) said:                      I and Hafsa agreed that one whom Allah's Apostle (may peace be upon him) would visit first should say: I notice that you have an odour of the Maghafir (gum of mimosa). He (the Holy Prophet) visited one of them and she said to him like this, whereupon he said: I have taken honey in the house of Zainab bint Jabsh and I will never do it again. It was at this (that the following verse was revealed): 'Why do you hold to be forbidden what Allah has made lawful for you... (up to). If you both ('A'isha and Hafsa) turn to Allah\" up to:\" And when the Holy Prophet confided an information to one of his wives\" (lxvi. 3). This refers to his saying: But I have taken honey.",
      "chain": [
        "38487",
        "20381",
        "11070",
        "11029",
        "11259"
      ]
    },
    {
      "hadith_no": "3794",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثني محمد بن حاتم بن ميمون، حدثنا يحيى بن سعيد، عن ابن جريج، ح وحدثنا محمد بن رافع، حدثنا عبد الرزاق، أخبرنا ابن جريج، ح وحدثني هارون بن عبد الله، - واللفظ له - حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول طلقت خالتي فأرادت أن تجد نخلها فزجرها رجل أن تخرج فأتت النبي صلى الله عليه وسلم فقال ‏\"‏ بلى فجدي نخلك فإنك عسى أن تصدقي أو تفعلي معروفا ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah (Allah be pleased with them) reported:                      My maternal aunt was divorced, and she intended to pluck her dates. A person scolded her for having come out (during the period of 'Idda). She came to Allah's Prophet (may peace be upon him.) and he said: Certainly you can pluck (dates) from your palm trees, for perhaps you may give charity or do an act of kindness.",
      "chain": [
        "30514",
        "20031",
        "11070",
        "30375",
        "20121",
        "11070",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "4231",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Rules of Inheritance - كتاب الفرائض",
      "chapter_no": "24",
      "text_ar": "حدثني محمد بن حاتم بن ميمون، حدثنا حجاج بن محمد، حدثنا ابن جريج، قال أخبرني ابن المنكدر، عن جابر بن عبد الله، قال عادني النبي صلى الله عليه وسلم وأبو بكر في بني سلمة يمشيان فوجدني لا أعقل فدعا بماء فتوضأ ثم رش على منه فأفقت فقلت كيف أصنع في مالي يا رسول الله فنزلت ‏{‏يوصيكم الله في أولادكم للذكر مثل حظ الأنثيين‏}‏",
      "text_en": " Jabir b. 'Abdullah (Allah be pleased with him) reported:                      Allah's Apostle (may peace be upon him) and Abi Bakr (Allah be pleased with him) visited me on foot in Banu Salama, and found me unconscious. He (the Holy Prophet) called for water and performed ablution and sprinkled out of it (the water) over me. I felt relieved. I said: Allah's Messenger, what should I do with my property? And this verse was revealed:\" Allah enjoins you concerning your children: for the male is equal of the portion of two females.\"",
      "chain": [
        "30514",
        "20381",
        "11070",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "4538",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول رجم النبي صلى الله عليه وسلم رجلا من أسلم ورجلا من اليهود وامرأته ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported that Allah's Apostle (may peace be upon him) stoned (to death) a person from Banu Aslam, and a Jew and his wife.",
      "chain": [
        "30524",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "4851",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثني زهير بن حرب، وهارون بن عبد الله، قالا حدثنا حجاج بن محمد، قال قال ابن جريج نزل ‏{‏ يا أيها الذين آمنوا أطيعوا الله وأطيعوا الرسول وأولي الأمر منكم‏}‏ في عبد الله بن حذافة بن قيس بن عدي السهمي بعثه النبي صلى الله عليه وسلم في سرية ‏.‏ أخبرنيه يعلى بن مسلم عن سعيد بن جبير عن ابن عباس ‏.‏",
      "text_en": " It has been narrated on the authority of Ibn Juraij that the Qur'anic injunction:                     \" 0 you who believe, obey Allah, His Apostle and those in authority from amongst You\" (iv. 59) -was revealed in respect of 'Abdullah b. Hudhafa b. Qais b. Adi al-Sahmi who was despatched by the Holy Prophet (may peace be upon him) as leader of a military campaign. The narrator said: He was informed of this fact by Ya'la b. Muslim who was informed by Sa'id b. Jubair who in turn was informed by Ibn Abbas.",
      "chain": [
        "30022",
        "30524",
        "20381"
      ]
    },
    {
      "hadith_no": "4917",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني إبراهيم بن دينار، حدثنا حجاج بن محمد الأعور، مولى سليمان بن مجالد قال قال ابن جريج وأخبرني أبو الزبير، أنه سمع جابرا، يسأل هل بايع النبي صلى الله عليه وسلم بذي الحليفة فقال لا ولكن صلى بها ولم يبايع عند شجرة إلا الشجرة التي بالحديبية ‏.‏ قال ابن جريج وأخبرني أبو الزبير أنه سمع جابر بن عبد الله يقول دعا النبي صلى الله عليه وسلم على بئر الحديبية ‏.‏",
      "text_en": " It has been narrated (through a different chain of transmitters) on the authority of Abu Zubair who heard Jabir being questioned as to whether the Holy Prophet (may peace be upon him) took the oath of fealty at Dhu'l-Hulaifa. He said:                      No! But he offered his prayers at that place, and he administered the oath of fealty nowhere except near the tree in (the plain oo Hudaibiya. Ibn Juraij said that he was informed by Abu Zabair who heard Jabir b. Abdullah say: The Holy Prophet (may peace be upon him) prayed over the well at Hudaibiya (as a result of which its scanty water rose up and increased so as to be sufficient for the 1400 or 1500 men who had encamped at the place).",
      "chain": [
        "30496",
        "20381",
        "11070",
        "11263"
      ]
    },
    {
      "hadith_no": "5063",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثني هارون بن عبد الله، وحجاج بن الشاعر، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تزال طائفة من أمتي يقاتلون على الحق ظاهرين إلى يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Jabir b. 'Abdullah who said:                      I heard the Messenger of Allah (may peace be upon him) say: A group of people from my Umma will continue to fight In defence of truth and remain triumphant until the Day of judgment.",
      "chain": [
        "30524",
        "38834",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "5175",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "حدثني محمد بن حاتم، حدثنا يحيى بن سعيد، عن ابن جريج، ح وحدثنا عبد، بن حميد أخبرنا محمد بن بكر، أخبرنا ابن جريج، ح وحدثني هارون بن عبد الله، حدثنا  حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول نهى رسول الله صلى الله عليه وسلم أن يقتل شىء من الدواب صبرا ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported that Allah's Messenger (may peace be upon him) forbade that any beast should be killed after it has been tied.",
      "chain": [
        "38487",
        "20031",
        "11070",
        "30553",
        "20277",
        "11070",
        "30524",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "5242",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا يحيى بن يحيى التميمي، أخبرنا حجاج بن محمد، عن ابن جريج، حدثني  ابن شهاب، عن علي بن حسين بن علي، عن أبيه، حسين بن علي عن علي بن أبي طالب، قال أصبت شارفا مع رسول الله صلى الله عليه وسلم في مغنم يوم بدر وأعطاني رسول الله صلى الله عليه وسلم شارفا أخرى فأنختهما يوما عند باب رجل من الأنصار وأنا أريد أن أحمل عليهما إذخرا لأبيعه ومعي صائغ من بني قينقاع فأستعين به على وليمة فاطمة وحمزة بن عبد المطلب يشرب في ذلك البيت معه قينة تغنيه فقالت ألا يا حمز للشرف النواء فثار إليهما حمزة بالسيف فجب أسنمتهما وبقر خواصرهما ثم أخذ من أكبادهما ‏.‏ قلت لابن شهاب ومن السنام قال قد جب أسنمتهما فذهب بها ‏.‏ قال ابن شهاب قال علي فنظرت إلى منظر أفظعني فأتيت نبي الله صلى الله عليه وسلم وعنده زيد بن حارثة فأخبرته الخبر فخرج ومعه زيد وانطلقت معه فدخل على حمزة فتغيظ عليه فرفع حمزة بصره فقال هل أنتم إلا عبيد لآبائي فرجع رسول الله صلى الله عليه وسلم يقهقر حتى خرج عنهم ‏.‏",
      "text_en": " 'Ali b. Abu Talib reported; There fell to my lot along with Allah's Messenger (may peace be upon him) an old she-camel from the spoils of Badr. Allah's Messenger (may peace be upon him) granted me another camel. I made them kneel down one day at the door of an Ansari, and I wanted to carry on them Idhkhir (a kind of grass) in order to sell that. There was with me a goldsmith of the tribe of Qainuqa'. I saught to give a wedding feast (on the occasion of marriage with) Fatima with the help of that (the price accrued from the sale of this grass). And Hamza b. 'Abd al-Muttalib was busy in drinking in that house in the company of a singing girl who was singing to him. She said:                      Hamza, get up for slaughtering the fat she-camels. Hamza attacked them with the sword and cut off their humps and ripped their haunches, and then took out their livers. I said to Ibn Shihab: Did he take out anything from the hump? He said: He cut off the humps altogether. Ibn Shihab reported 'Ali having said: I saw this (horrible) sight and it shocked me, and I came to Allah's Apostle (may peace be upon him) and there was Zaid b, Haritha with him and communicated to him this news. He came in the company of Zaid and I also went along with him and he went to Hamza and he expressed anger with him. Hamza raised his eyes and said: Are you (not) but the servants of my father? Allah's Messenger (may peace be upon him) turned back on his heels (on hearing this) until he went away from them.",
      "chain": [
        "30399",
        "20381",
        "11070",
        "11013",
        "11045",
        "5"
      ]
    },
    {
      "hadith_no": "5415",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثني هارون بن عبد الله، حدثنا حجاج بن محمد، ح وحدثنا عبد بن حميد، أخبرني أبو عاصم، جميعا عن ابن جريج، ح وحدثنا زهير بن حرب، - واللفظ له - حدثنا  روح بن عبادة، حدثنا ابن جريج، قال سمعت عطاء، يقول سمعت ابن عباس، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أكل أحدكم من الطعام فلا يمسح يده حتى يلعقها أو يلعقها ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas reported Allah's Messenger (may peace be upon him) as saying:                      When any one of you eats food he should not wipe his hand until he has licked it or got it licked by (someone else).",
      "chain": [
        "30524",
        "20381",
        "30553",
        "11070",
        "30022",
        "20229",
        "11070",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "5673",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثني هارون بن عبد الله، حدثنا حجاج بن محمد، ح وحدثنا عبد بن حميد، أخبرنا محمد بن بكر، ‏.‏ كلاهما عن ابن جريج، قال أخبرني أبو الزبير، أنه سمع جابر، بن عبد الله يقول نهى رسول الله صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This hadith has been reported on the authority of Jabir b. 'Abdullah through another chain of transmitters.",
      "chain": [
        "30524",
        "20381",
        "30553",
        "20277",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "5788",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثني هارون بن عبد الله، وحجاج بن الشاعر، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول سلم ناس من يهود على رسول الله صلى الله عليه وسلم فقالوا السام عليك يا أبا القاسم ‏.‏ فقال ‏\"‏ وعليكم ‏\"‏ ‏.‏ فقالت عائشة وغضبت ألم تسمع ما قالوا قال ‏\"‏ بلى قد سمعت فرددت عليهم وإنا نجاب عليهم ولا يجابون علينا ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Abdullah reported that some people from amongst the Jews said to Allah's Messenger (may peace be upon him) Abu'l-Qasim. as-Sam-u-'Alaikum, whereupon he said:                      Wa 'Alaikum, A'isha was enraged and asked him (Allah's Apostle) whether he had not heard what they had said. He said, I did hear and I retorted to them (and the curse that I invoked upon them would receive response from Allah), but (the curse that they invoked upon us) would not be responded.",
      "chain": [
        "30524",
        "38834",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "6560",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني  أبو الزبير، أنه سمع جابر بن عبد الله، يقول أخبرتني أم مبشر، أنها سمعت النبي صلى الله عليه وسلم يقول عند حفصة ‏\"‏ لا يدخل النار إن شاء الله من أصحاب الشجرة أحد ‏.‏ الذين بايعوا تحتها ‏\"‏ ‏.‏ قالت بلى يا رسول الله ‏.‏ فانتهرها فقالت حفصة ‏{‏ وإن منكم إلا واردها‏}‏ فقال النبي صلى الله عليه وسلم ‏\"‏ قد قال الله عز وجل ‏{‏ ثم ننجي الذين اتقوا ونذر الظالمين فيها جثيا‏}‏",
      "text_en": " Umm Mubashshir reported that she heard Allah's Apostle (may peace be upon him) as saying in presence of Hafsa:                      God willing, the people of the Tree would never enter the fire of Hell one amongst those who owed allegiance under that. She said: Allah's Messenger, why not? He scolded her. Hafsa said: And there is none amongst you but shall have to pass over that (narrow Bridge). Thereupon Allah's Apostle (may peace be upon him) said: Allah, the Exalted and Glorious, has said: We would rescue those persons who are God-conscious and we would leave the tyrants to their fate there (xix. 72).",
      "chain": [
        "30524",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "6644",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثني هارون بن عبد الله، وحجاج بن الشاعر، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول سمعت النبي صلى الله عليه وسلم يقول قبل أن يموت بشهر ‏\"‏ تسألوني عن الساعة وإنما علمها عند الله وأقسم بالله ما على الأرض من نفس منفوسة تأتي عليها مائة سنة ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      I heard Allah's Messenger (may peace be upon him) as saying this one month before his death: You asked me about the Last Hour whereas its knowledge is with Allah. I, however, take an oath and say that none upon the earth, the created beings (from amongst my Companions), would survive at the end of one hundred years. This hadith has been narrated on the authority of Ibn Juraij with the same chain of transmitters, but there is no mention of the words:\" one month before his death\".",
      "chain": [
        "30524",
        "38834",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "6790",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني هارون بن عبد الله، وحجاج بن الشاعر، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إنما أنا بشر وإني اشترطت على ربي عز وجل أى عبد من المسلمين سببته أو شتمته أن يكون ذلك له زكاة وأجرا ‏\"‏ ‏.‏  حدثنيه ابن أبي خلف، حدثنا روح، ح وحدثناه عبد بن حميد، حدثنا أبو عاصم، جميعا عن ابن جريج، بهذا الإسناد مثله ‏.‏",
      "text_en": " Jabir b. Abdullah reported Allah's Messenger (may peace be upon him) as saying:                      I am a human being and I have made this term with my Lord, the Exalted and Glorious: For any servant amongst Muslims whom I curse or scold, make that a source of purity and reward. This hadith has been narrated on the authority of Ibn Juraij with the same chain of transmitters.",
      "chain": [
        "30524",
        "38834",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "7211",
      "source": " Sahih Muslim ",
      "chapter": "Pertaining To The Charateristics Of The Hypocrites And Command Concerning Them - كتاب صفات المنافقين وأحكامهم",
      "chapter_no": "52",
      "text_ar": "حدثنا زهير بن حرب، وهارون بن عبد الله، - واللفظ لزهير - قالا حدثنا حجاج، بن محمد عن ابن جريج، أخبرني ابن أبي مليكة، أن حميد بن عبد الرحمن بن عوف، أخبره  أن مروان قال اذهب يا رافع - لبوابه - إلى ابن عباس فقل لئن كان كل امرئ منا فرح بما أتى وأحب أن يحمد بما لم يفعل معذبا لنعذبن أجمعون ‏.‏ فقال ابن عباس ما لكم ولهذه الآية إنما أنزلت هذه الآية في أهل الكتاب ‏.‏ ثم تلا ابن عباس ‏{‏ وإذ أخذ الله ميثاق الذين أوتوا الكتاب لتبيننه للناس ولا تكتمونه‏}‏ هذه الآية وتلا ابن عباس ‏{‏ لا تحسبن الذين يفرحون بما أتوا ويحبون أن يحمدوا بما لم يفعلوا‏}‏ وقال ابن عباس سألهم النبي صلى الله عليه وسلم عن شىء فكتموه إياه وأخبروه بغيره فخرجوا قد أروه أن قد أخبروه بما سألهم عنه واستحمدوا بذلك إليه وفرحوا بما أتوا من كتمانهم إياه ما سألهم عنه ‏.‏",
      "text_en": " Humaid b. 'Abd al-Rahman b. 'Auf reported that Marwan said to Rafi', his chamberlain, that he should go to Ibn 'Abbas and ask him:                      If every one of us be punished for his being happy upon his deed and for his being praised for what he has not done, nobody would be saved from the torment. Ibn 'Abbas said: What you have to do with this verse? It has been in fact revealed in connection with the people of the Book.\" Then Ibn Abbas recited this verse:\" When Allah took a covenant from those who had been given the Book: You shall explain it to people and shall not conceal this\" (iii. 186), and then Ibn 'Abbas recited this verse:\" Think not that those who exult in what they have done and love to be praised for what they have not done\" (iii. 186). Ibn 'Abbas (further) said: Allah's Apostle (may peace be upon him) asked them about something and then they concealed that and they told him something else and they went out and they thought that they had informed him as lie had asked them and they felt happy of what they had concealed.",
      "chain": [
        "30022",
        "20381",
        "11070",
        "11090",
        "10561",
        "20201"
      ]
    },
    {
      "hadith_no": "7231",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثني سريج بن يونس، وهارون بن عبد الله، قالا حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني إسماعيل بن أمية، عن أيوب بن خالد، عن عبد الله بن رافع، مولى أم سلمة عن أبي هريرة، قال أخذ رسول الله صلى الله عليه وسلم بيدي فقال ‏\"‏ خلق الله عز وجل التربة يوم السبت وخلق فيها الجبال يوم الأحد وخلق الشجر يوم الاثنين وخلق المكروه يوم الثلاثاء وخلق النور يوم الأربعاء وبث فيها الدواب يوم الخميس وخلق آدم عليه السلام بعد العصر من يوم الجمعة في آخر الخلق وفي آخر ساعة من ساعات الجمعة فيما بين العصر إلى الليل ‏\"‏ ‏.‏",
      "text_en": " Abu Haraira reported that Allah's Messenger (may peace be upon him) took hold of my hands and said:                      Allah, the Exalted and Glorious, created the clay on Saturday and He created the mountains on Sunday and He created the trees on Monday and He created the things entailing labour on Tuesday and created light on Wednesday and lie caused the animals to spread on Thursday and created Adam (peace be upon him) after 'Asr on Friday;the last creation at the last hour of the hours of Friday, i. e. between afternoon and night.",
      "chain": [
        "30251",
        "30524",
        "20381",
        "11070",
        "11417",
        "11831",
        "11864",
        "13"
      ]
    },
    {
      "hadith_no": "7580",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثني هارون بن عبد الله، حدثنا حجاج بن محمد، قال قال ابن جريج حدثني  أبو الزبير، أنه سمع جابر بن عبد الله، يقول أخبرتني أم شريك، أنها سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ ليفرن الناس من الدجال في الجبال ‏\"‏ ‏.‏ قالت أم شريك يا رسول الله فأين العرب يومئذ قال ‏\"‏ هم قليل ‏\"‏ ‏.‏",
      "text_en": " Umm Sharik reported:                      I heard Allah's Messenger (may peace be upon him) as saying: The people would run away from the Dajjal seeking shelter in the mountains. She said: Where would be the Arabs then in that day? He said: They would be small in number.",
      "chain": [
        "30524",
        "20381",
        "11070",
        "11263",
        "34",
        "187"
      ]
    },
    {
      "hadith_no": "299",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن سنان القطان الواسطي، حدثنا يزيد، عن أيوب بن أبي مسكين، عن الحجاج، عن أم كلثوم، عن عائشة، في المستحاضة تغتسل - تعني مرة واحدة - ثم توضأ إلى أيام أقرائها ‏.‏",
      "text_en": " 'Aishah said about the woman who has a prolonged flow of blood:                      She should take bath, i.e. only once; then she should perform ablution until he next menstrual period.",
      "chain": [
        "30297",
        "20472",
        "20381",
        "10500"
      ]
    },
    {
      "hadith_no": "325",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا علي بن سهل الرملي، حدثنا حجاج، - يعني الأعور - حدثني شعبة، بإسناده بهذا الحديث قال ثم نفخ فيها ومسح بها وجهه وكفيه إلى المرفقين أو إلى الذراعين ‏.‏ قال شعبة كان سلمة يقول الكفين والوجه والذراعين فقال له منصور ذات يوم انظر ما تقول فإنه لا يذكر الذراعين غيرك ‏.‏",
      "text_en": " This is transmitted by Shu'bah through a different chain of narrators. This version adds:                      He ('Ammar) said: He (the Prophet) then blew it and wiped with it his face and hands up to elbows or up to the forearms. Shu'bah said: Salamah used to narrate (the words) \"the hands and the face and the forearms\". One day Mansur said to him: Look, what are you saying, because no one except you mentions the (word) \"forearms\".",
      "chain": [
        "38403",
        "20381",
        "20020",
        "237"
      ]
    },
    {
      "hadith_no": "445",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إبراهيم بن الحسن، حدثنا حجاج، - يعني ابن محمد - حدثنا حريز، ح وحدثنا عبيد بن أبي الوزير، حدثنا مبشر، - يعني الحلبي - حدثنا حريز، - يعني ابن عثمان - حدثني يزيد بن صالح، عن ذي، مخبر الحبشي وكان يخدم النبي صلى الله عليه وسلم في هذا الخبر قال فتوضأ - يعني النبي صلى الله عليه وسلم - وضوءا لم يلث منه التراب ثم أمر بلالا فأذن ثم قام النبي صلى الله عليه وسلم فركع ركعتين غير عجل ثم قال لبلال ‏\"‏ أقم الصلاة ‏\"‏ ‏.‏ ثم صلى الفرض وهو غير عجل ‏.‏ قال عن حجاج عن يزيد بن صليح حدثني ذو مخبر رجل من الحبشة وقال عبيد يزيد بن صالح ‏.‏",
      "text_en": " \t\t\t\t\t\t\t\t\t\t\tDhu Mikhbar al-Habashi, who used to serve the Prophet (ﷺ), reported a version of the previous tradition. The Prophet (ﷺ) performed ablution in such a way that there is no mud on the earth. He then commanded Bilal (to call for prayer). He called for prayer. The Prophet (ﷺ) stood and offered two rak'ahs of prayer unhurriedly.This is narrated by Hajjaj on the authority of Yazid b. Sulaih from Dhu Mikhbar from a person of al-Habashah (Ethiopia). 'Ubaid (a narrator) said:                      Yazid b. Salih (instead of Yazid b. Sulaih).",
      "chain": [
        "20381",
        "11684",
        "5021"
      ]
    },
    {
      "hadith_no": "798",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسدد، حدثنا يحيى، عن هشام بن أبي عبد الله، ح وحدثنا ابن المثنى، حدثنا ابن أبي عدي، عن الحجاج، - وهذا لفظه - عن يحيى، عن عبد الله بن أبي قتادة، - قال ابن المثنى وأبي سلمة ثم اتفقا - عن أبي قتادة، قال كان رسول الله صلى الله عليه وسلم يصلي بنا فيقرأ في الظهر والعصر في الركعتين الأوليين بفاتحة الكتاب وسورتين ويسمعنا الآية أحيانا وكان يطول الركعة الأولى من الظهر ويقصر الثانية وكذلك في الصبح ‏.‏ قال أبو داود لم يذكر مسدد فاتحة الكتاب وسورة ‏.‏",
      "text_en": " Abu Qatadah said:                      The apostle of Allah (ﷺ) used to lead us in prayer and recite in the first two rak’ahs of the noon prayers Fatihat al-kitab and two surahs, and he would sometimes recite loud enough for us to hear the verse. He would prolong the first rak’ah of the noon prayer and shorten the second; and he did so in the morning prayer.Abu Dawud said: Musaddad did not mention the words fatihat al-kitab and surah.",
      "chain": [
        "30175",
        "20031",
        "30170",
        "20276",
        "20381",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "845",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يحيى بن معين، حدثنا حجاج بن محمد، عن ابن جريج، أخبرني أبو الزبير، أنه سمع طاوسا، يقول قلنا لابن عباس في الإقعاء على القدمين في السجود ‏.‏ فقال هي السنة ‏.‏ قال قلنا إنا لنراه جفاء بالرجل ‏.‏ فقال ابن عباس هي سنة نبيك صلى الله عليه وسلم ‏.‏",
      "text_en": " Tawus said:                      we asked Ibn ‘Abbas about sitting on heels between the two prostrations. He said: It is the sunnah. We said: We look upon it as a pressure on the foot. He said: This is the sunnah of your  Prophet(ﷺ)",
      "chain": [
        "30020",
        "20381",
        "11070",
        "11263",
        "11053"
      ]
    },
    {
      "hadith_no": "1133",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إبراهيم بن الحسن، حدثنا حجاج بن محمد، عن ابن جريج، أخبرني عطاء، أنه رأى ابن عمر يصلي بعد الجمعة فينماز عن مصلاه الذي، صلى فيه الجمعة قليلا غير كثير قال فيركع ركعتين قال ثم يمشي أنفس من ذلك فيركع أربع ركعات قلت لعطاء كم رأيت ابن عمر يصنع ذلك قال مرارا قال أبو داود ورواه عبد الملك بن أبي سليمان ولم يتمه ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     Ibn Jurayj said: Ata' told me that he saw Ibn Umar pray after the Friday prayer. He moved a little from the place where he offered the Friday prayer. Then he would pray two rak'ahs. He then walked far away from that place and would offer four rak'ahs. I asked Ata': How many times did you see Ibn Umar do that? He replied: Many times. AbuDawud said: This has been narrated by AbdulMalik ibn AbuSulayman, but did not narrate it completely.",
      "chain": [
        "20381",
        "11070",
        "11029"
      ]
    },
    {
      "hadith_no": "1820",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا أبو عوانة، عن أبي بشر، عن عطاء، عن يعلى بن أمية، وهشيم، عن الحجاج، عن عطاء، عن صفوان بن يعلى، عن أبيه، بهذه القصة قال فيه فقال له النبي صلى الله عليه وسلم ‏\"‏ اخلع جبتك ‏\"‏ ‏.‏ فخلعها من رأسه وساق الحديث ‏.‏",
      "text_en": " This tradition has also been narrated by Ya’la bin Umayyah through a different chain of narrators. This version adds The Prophet (ﷺ) said to him “Take off your tunic”. He then took it off from his head. The narrator then narrated the rest of the tradition.",
      "chain": [
        "31167",
        "20469",
        "11419",
        "11029",
        "20468",
        "20381",
        "11029",
        "11248"
      ]
    },
    {
      "hadith_no": "1978",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا مسدد، حدثنا عبد الواحد بن زياد، حدثنا الحجاج، عن الزهري، عن عمرة بنت عبد الرحمن، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا رمى أحدكم جمرة العقبة فقد حل له كل شىء إلا النساء ‏\"‏ ‏.‏ قال أبو داود هذا حديث ضعيف الحجاج لم ير الزهري ولم يسمع منه ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) said: When one of you throws pebbles at the last jamrah (Jamrat al-Aqabah), everything becomes lawful for him except women (sexual intercourse).Abu Dawud said: This is a weak tradition. The narrator al-Hajjaj neither saw al-Zuhri nor heard tradition from him.",
      "chain": [
        "30175",
        "20256",
        "20381",
        "11013",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "2488",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عبد الرحمن بن سلام، حدثنا حجاج بن محمد، عن فرج بن فضالة، عن عبد الخبير بن ثابت بن قيس بن شماس، عن أبيه، عن جده، قال جاءت امرأة إلى النبي صلى الله عليه وسلم يقال لها أم خلاد وهي منتقبة تسأل عن ابنها وهو مقتول فقال لها بعض أصحاب النبي صلى الله عليه وسلم جئت تسألين عن ابنك وأنت منتقبة فقالت إن أرزإ ابني فلن أرزأ حيائي ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ابنك له أجر شهيدين ‏\"‏ ‏.‏ قالت ولم ذاك يا رسول الله قال ‏\"‏ لأنه قتله أهل الكتاب ‏\"‏ ‏.‏",
      "text_en": " Narrated Thabit ibn Qays:                     A woman called Umm Khallad came to the Prophet (ﷺ) while she was veiled. She was searching for her son who had been killed (in the battle) Some of the Companions of the Prophet (ﷺ) said to her: You have come here asking for your son while veiling your face? She said: If I am afflicted with the loss of my son, I shall not suffer the loss of my modesty. The Messenger of Allah (ﷺ) said: You will get the reward of two martyrs for your son. She asked: Why is that so, Messenger of Allah? He replied: Because the people of the Book have killed him.",
      "chain": [
        "20381",
        "27031"
      ]
    },
    {
      "hadith_no": "2526",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا إبراهيم بن الحسن المصيصي، حدثنا حجاج، - يعني ابن محمد - ح وحدثنا عبد الملك بن شعيب، حدثنا ابن وهب، عن الليث بن سعد، عن حيوة بن شريح، عن ابن شفى، عن أبيه، عن عبد الله بن عمرو، أن رسول الله صلى الله عليه وسلم قال ‏:‏ ‏\"‏ للغازي أجره، وللجاعل أجره وأجر الغازي ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: The warrior gets his reward, and the one who equips him gets his own reward and that of the warrior.",
      "chain": [
        "20381",
        "30489",
        "20029",
        "20023",
        "26010",
        "29"
      ]
    },
    {
      "hadith_no": "2595",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا يزيد بن هارون، عن الحجاج، عن قتادة، عن الحسن، عن سمرة بن جندب، قال كان شعار المهاجرين عبد الله وشعار الأنصار عبد الرحمن ‏.‏",
      "text_en": " Samurah bin Jundub said “The war-cry of the Emigrants was ‘Abd Allah and that of the helpers ‘Abd Al Rahman.”",
      "chain": [
        "30116",
        "20472",
        "20381",
        "11019",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "3102",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Funerals (Kitab Al-Jana'iz) - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "حدثنا عبد الله بن محمد النفيلي، حدثنا حجاج بن محمد، عن يونس بن أبي إسحاق، عن أبيه، عن زيد بن أرقم، قال عادني رسول الله صلى الله عليه وسلم من وجع كان بعينى ‏.‏",
      "text_en": " Narrated Zayd ibn Arqam:                     The Messenger of Allah (ﷺ) visited me while I was suffering from pain in my eyes.",
      "chain": [
        "30352",
        "20381",
        "10846",
        "11049",
        "384"
      ]
    },
    {
      "hadith_no": "3714",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا حجاج بن محمد، قال قال ابن جريج عن عطاء، أنه سمع عبيد بن عمير، قال سمعت عائشة، - رضى الله عنها - زوج النبي صلى الله عليه وسلم تخبر أن النبي صلى الله عليه وسلم كان يمكث عند زينب بنت جحش فيشرب عندها عسلا فتواصيت أنا وحفصة أيتنا ما دخل عليها النبي صلى الله عليه وسلم فلتقل إني أجد منك ريح مغافير فدخل على إحداهن فقالت له ذلك فقال ‏\"‏ بل شربت عسلا عند زينب بنت جحش ولن أعود له ‏\"‏ ‏.‏ فنزلت ‏{‏ لم تحرم ما أحل الله لك تبتغي ‏}‏ إلى ‏{‏ إن تتوبا إلى الله ‏}‏ لعائشة وحفصة رضى الله عنهما ‏{‏ وإذ أسر النبي إلى بعض أزواجه حديثا ‏}‏ لقوله ‏\"‏ بل شربت عسلا ‏\"‏ ‏.‏",
      "text_en": " A’ishah said that the prophet (ﷺ) used to stay with Zainab, daughter of Jahsh, and drink honey. I and Hafsah counseled each other that if the Prophet (ﷺ) enters upon any of us, she must say :                      I find the smell of gum (maghafir) from you. He then entered upon one of them; she said that to him. Thereupon he said : No, I drank honey at (the house of) Zainab daughter of jahsh, and I will not do it again. Then the following verse came down :’’O Prophet !why holdest thou to be forbidden that which Allah has made lawful to thee ? ‘’Thou seekest. . . If you two turn in repentance to Allah ‘’ refers to Hafsah and A’ishah , and the verse: ‘’When the Prophet disclosed a matter in confidence to one of his consorts’’ refers to the statements of the Prophet (ﷺ) disclosed a matter in confidence to one of his consorts’’ refers to the statement of the Prophet (ﷺ) :No, I drank honey.",
      "chain": [
        "30007",
        "20381",
        "11070",
        "11029",
        "11259",
        "53"
      ]
    },
    {
      "hadith_no": "3975",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Dialects and Readings of the Qur'an (Kitab Al-Huruf Wa Al-Qira'at) - كتاب الحروف والقراءات",
      "chapter_no": "32",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا ابن أبي الزناد، ح وحدثنا محمد بن سليمان الأنباري، حدثنا حجاج بن محمد، عن ابن أبي الزناد، - وهو أشبع - عن أبيه، عن خارجة بن زيد بن ثابت، عن أبيه، أن النبي صلى الله عليه وسلم كان يقرأ ‏{‏ غير أولي الضرر ‏}‏ ولم يقل سعيد كان يقرأ ‏.‏",
      "text_en": " Narrated Zayd ibn Thabit:                     The Prophet (ﷺ) used to read: \"Not equal are those believers who sit (at home) and receive no hurt (ghayru ulid-darari) but the narrator Sa'id did not say the words \"used to read\"",
      "chain": [
        "30116",
        "20509",
        "31160",
        "20381",
        "20509",
        "11061",
        "11006",
        "49"
      ]
    },
    {
      "hadith_no": "4263",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا إبراهيم بن الحسن المصيصي، حدثنا حجاج، - يعني ابن محمد - حدثنا الليث بن سعد، قال حدثني معاوية بن صالح، أن عبد الرحمن بن جبير، حدثه عن أبيه، عن المقداد بن الأسود، قال ايم الله لقد سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن السعيد لمن جنب الفتن إن السعيد لمن جنب الفتن إن السعيد لمن جنب الفتن ولمن ابتلي فصبر فواها ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-Miqdad ibn al-Aswad:                     I swear by Allah, I heard the Messenger of Allah (ﷺ) say: The happy man is he who avoids dissensions: happy is the man who avoids dissensions; happy is the man who avoids dissensions: but how fine is the man who is afflicted and shows endurance.",
      "chain": [
        "20381",
        "20023",
        "20675",
        "10865",
        "163"
      ]
    },
    {
      "hadith_no": "4411",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عمر بن علي، حدثنا الحجاج، عن مكحول، عن عبد الرحمن بن محيريز، قال سألنا فضالة بن عبيد عن تعليق اليد، في العنق للسارق أمن السنة هو قال أتي رسول الله صلى الله عليه وسلم بسارق فقطعت يده ثم أمر بها فعلقت في عنقه ‏.‏",
      "text_en": " 'Abd al-Rahman b. Muhariz said:                     We asked Fadalah b. 'Ubaid about the hanging the (amputated) hand on the neck of a thief whether it was a sunnan. He said: A thief was brought to the Messenger of Allah (ﷺ) and his hand was cut off. Thereafter he commanded for it, and it was hung on his neck.",
      "chain": [
        "30367",
        "20265",
        "20381",
        "11066",
        "19926",
        "1935"
      ]
    },
    {
      "hadith_no": "4455",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prescribed Punishments (Kitab Al-Hudud) - كتاب الحدود",
      "chapter_no": "40",
      "text_ar": "حدثنا إبراهيم بن حسن المصيصي، حدثنا حجاج بن محمد، قال حدثنا ابن جريج، أنه سمع أبا الزبير، سمع جابر بن عبد الله، يقول رجم النبي صلى الله عليه وسلم رجلا من اليهود وامرأة زنيا ‏.‏",
      "text_en": " Jabir bin ‘Abd Allah said:                      The Prophet (ﷺ) had a man and a woman of the Jews who had committed fornication stoned to death.",
      "chain": [
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "4545",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا مسدد، حدثنا عبد الواحد، حدثنا الحجاج، عن زيد بن جبير، عن خشف بن مالك الطائي، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ في دية الخطإ عشرون حقة وعشرون جذعة وعشرون بنت مخاض وعشرون بنت لبون وعشرون بني مخاض ذكر ‏\"‏ ‏.‏ وهو قول عبد الله ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Prophet (ﷺ) said: The blood-wit for accidental killing should be twenty she-camels which had entered their fourth year, twenty she-camels which had entered their fifth year, twenty she-camels which had entered their second year, twenty she-camels which had entered their third year, and twenty male camels which had entered their second year. It does not beyond Ibn Mas'ud.",
      "chain": [
        "30175",
        "20256",
        "20381",
        "22061",
        "19907",
        "16"
      ]
    },
    {
      "hadith_no": "4643",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو بكر، عن عاصم، قال سمعت الحجاج، وهو على المنبر يقول اتقوا الله ما استطعتم ليس فيها مثنوية واسمعوا وأطيعوا ليس فيها مثنوية لأمير المؤمنين عبد الملك والله لو أمرت الناس أن يخرجوا من باب من أبواب المسجد فخرجوا من باب آخر لحلت لي دماؤهم وأموالهم والله لو أخذت ربيعة بمضر لكان ذلك لي من الله حلالا ويا عذيري من عبد هذيل يزعم أن قراءته من عند الله والله ما هي إلا رجز من رجز الأعراب ما أنزلها الله على نبيه عليه السلام وعذيري من هذه الحمراء يزعم أحدهم أنه يرمي بالحجر فيقول إلى أن يقع الحجر قد حدث أمر فوالله لأدعنهم كالأمس الدابر ‏.‏ قال فذكرته للأعمش فقال أنا والله سمعته منه ‏.‏",
      "text_en": " ‘Asim said:                      I heard al-Hajjaj say on the pulpit: Fear Allah as much as possible; there is no exception in it. Hear and obey the Commander of the Faithful ‘Abd al-Malik; there is no exception in it. I swear by Allah, if order people to come but from a certain gate of the mosque, and they come out from another gate, their blood and their properties will be lawful for me. I swear by Allah, if I seize the tribe of Rabi’ah for the tribe of Mudar, it is lawful for me from Allah. Who will apologies to me for the slave of Hudhail (i.e. ‘Abd Allah b. Mas’ud) who thinks that his reading of the Quran is from Allah. I swear by Allah, it is a rhymed prose of the Bedouins. Allah did not reveal it to his Prophet (ﷺ). Who will apologies to me for these clients (non-Arab). One of them thinks that he will throw a stone and when it falls (on the ground) he says: Something new has happened. I swear by Allah, I shall leave them (ruined and perished) like the day that passes away.He said: I mentioned it to al-A’mash. He said: I swear by Allah, I heard it from him.",
      "chain": [
        "30216",
        "20436",
        "11080",
        "20381"
      ]
    },
    {
      "hadith_no": "4644",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا ابن إدريس، عن الأعمش، قال سمعت الحجاج، يقول على المنبر هذه الحمراء هبر هبر أما والله لقد قرعت عصا بعصا لأذرنهم كالأمس الذاهب يعني الموالي ‏.‏",
      "text_en": " Al-A’mash said:                      These clients (i.e., non-Arabs) are to be struck and cut off. I swear by Allah, if I strike a stick with a stick, I would annihilate them like the day that passed away. Al-hamra means clients or non-Arabs.",
      "chain": [
        "30203",
        "20102",
        "11060",
        "20381"
      ]
    },
    {
      "hadith_no": "4895",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن حفص، قال حدثني أبي، حدثني إبراهيم بن طهمان، عن الحجاج، عن قتادة، عن يزيد بن عبد الله، عن عياض بن حمار، أنه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الله أوحى إلى أن تواضعوا حتى لا يبغي أحد على أحد ولا يفخر أحد على أحد ‏\"‏ ‏.‏",
      "text_en": " Narrated Iyad ibn Himar (al-Mujashi'i):                     The Prophet (ﷺ) said: Allah has revealed to me that you must be humble, so that no one oppresses another and boasts over another.",
      "chain": [
        "30293",
        "20420",
        "20187",
        "20381",
        "11019",
        "11318",
        "5217"
      ]
    },
    {
      "hadith_no": "4999",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا يحيى بن معين، حدثنا حجاج بن محمد، حدثنا يونس بن أبي إسحاق، عن أبي إسحاق، عن العيزار بن حريث، عن النعمان بن بشير، قال استأذن أبو بكر رحمة الله عليه على النبي صلى الله عليه وسلم فسمع صوت عائشة عاليا فلما دخل تناولها ليلطمها وقال لا أراك ترفعين صوتك على رسول الله صلى الله عليه وسلم فجعل النبي صلى الله عليه وسلم يحجزه وخرج أبو بكر مغضبا فقال النبي صلى الله عليه وسلم حين خرج أبو بكر ‏\"‏ كيف رأيتني أنقذتك من الرجل ‏\"‏ ‏.‏ قال فمكث أبو بكر أياما ثم استأذن على رسول الله صلى الله عليه وسلم فوجدهما قد اصطلحا فقال لهما أدخلاني في سلمكما كما أدخلتماني في حربكما ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ قد فعلنا قد فعلنا ‏\"‏ ‏.‏",
      "text_en": " Narrated An-Nu'man ibn Bashir:                     When AbuBakr asked the permission of the Prophet (ﷺ) to come in, he heard Aisha speaking in a loud voice.  So when he entered, he caught hold of her in order to slap her, and said: Do I see you raising your voice to the Messenger of Allah? The Prophet (ﷺ) began to prevent him and AbuBakr went out angry. The Prophet (ﷺ) said when AbuBakr went out: You see I rescued you from the man.  AbuBakr waited for some days, then asked permission of the Messenger of Allah (ﷺ) to enter, and found that they had made peace with each other. He said to them: Bring me into your peace as you brought me into your war.  The Prophet (ﷺ) said: We have done so: we have done so.",
      "chain": [
        "30020",
        "20381",
        "10846",
        "11049",
        "10808",
        "274"
      ]
    },
    {
      "hadith_no": "5095",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا إبراهيم بن الحسن الخثعمي، حدثنا حجاج بن محمد، عن ابن جريج، عن إسحاق بن عبد الله بن أبي طلحة، عن أنس بن مالك، أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا خرج الرجل من بيته فقال بسم الله توكلت على الله لا حول ولا قوة إلا بالله ‏\"‏ ‏.‏ قال ‏\"‏ يقال حينئذ هديت وكفيت ووقيت فتتنحى له الشياطين فيقول له شيطان آخر كيف لك برجل قد هدي وكفي ووقي ‏\"‏ ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Prophet (ﷺ) said: When a man goes out of his house and says: \"In the name of Allah, I trust in Allah; there is no might and no power but in Allah,\" the following will be said to him at that time: \"You are guided, defended and protected.\" The devils will go far from him and another devil will say: How can you deal with a man who has been guided, defended and protected?",
      "chain": [
        "20381",
        "11070",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "190",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن النضر بن أبي النضر، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرنا نافع، عن ابن عمر، قال كان المسلمون حين قدموا المدينة يجتمعون فيتحينون الصلوات وليس ينادي بها أحد فتكلموا يوما في ذلك فقال بعضهم اتخذوا ناقوسا مثل ناقوس النصارى ‏.‏ وقال بعضهم اتخذوا قرنا مثل قرن اليهود ‏.‏ قال فقال عمر بن الخطاب أولا تبعثون رجلا ينادي بالصلاة قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا بلال قم فناد بالصلاة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من حديث ابن عمر ‏.‏",
      "text_en": " Ibn Umar narrated:                     \"When the Muslims arrived in AI-Madinah, they used to assemble for the Salat, and guess the time for it there was no one who called for it (the prayer). One day they discussed that and some of them said that they should use a bell like the bell the Christians use. Others said they should use a trumpet like the horn the Jews use. But Umar [bin Al-Khattab] said: 'Wouldn't it better if we had a man call for the prayer?'\" He said: \"So Allah's Messenger said: 'O Bilal! Stand up and call for the Salat.'\"",
      "chain": [
        "30528",
        "20381",
        "11070",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "271",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا قتيبة، حدثنا حفص بن غياث، عن الحجاج، عن أبي إسحاق، قال قلت للبراء بن عازب أين كان النبي صلى الله عليه وسلم يضع وجهه إذا سجد فقال بين كفيه ‏.‏ قال وفي الباب عن وائل بن حجر وأبي حميد ‏.‏ قال أبو عيسى حديث البراء حديث حسن صحيح غريب ‏.‏ وهو الذي اختاره بعض أهل العلم أن تكون يداه قريبا من أذنيه ‏.‏",
      "text_en": " Abu Ishaq narrated:                     \"I said to Al-Bara bin Azib: 'Where would the Prophet place his face when he prostrated?' He said: 'Between his hands.'\"",
      "chain": [
        "30367",
        "20317",
        "20381",
        "11049"
      ]
    },
    {
      "hadith_no": "527",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on the Day of Friday - كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
      "chapter_no": "4",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أبو معاوية، عن الحجاج، عن الحكم، عن مقسم، عن ابن عباس، قال بعث النبي صلى الله عليه وسلم عبد الله بن رواحة في سرية فوافق ذلك يوم الجمعة فغدا أصحابه فقال أتخلف فأصلي مع رسول الله صلى الله عليه وسلم ثم ألحقهم ‏.‏ فلما صلى مع النبي صلى الله عليه وسلم رآه فقال ‏\"‏ ما منعك أن تغدو مع أصحابك ‏\"‏ ‏.‏ فقال أردت أن أصلي معك ثم ألحقهم ‏.‏ قال ‏\"‏ لو أنفقت ما في الأرض جميعا ما أدركت فضل غدوتهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ قال علي بن المديني قال يحيى بن سعيد قال شعبة لم يسمع الحكم من مقسم إلا خمسة أحاديث ‏.‏ وعدها شعبة وليس هذا الحديث فيما عد شعبة فكأن هذا الحديث لم يسمعه الحكم من مقسم ‏.‏ وقد اختلف أهل العلم في السفر يوم الجمعة فلم ير بعضهم بأسا بأن يخرج يوم الجمعة في السفر ما لم تحضر الصلاة ‏.‏ وقال بعضهم إذا أصبح فلا يخرج حتى يصلي الجمعة ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Prophet sent Abdullah bin Rawahah to lead a military detachment, and that corresponded to a Friday. So his companions left early in the day, and he said: 'I will remain behind to pray with Allah's Messenger then meet up with them.' When he prayed with the Prophet, he saw him and said: 'What prevented you from leaving earlier with your companions?' He said: 'I wanted to pray with you then meet up with them.' He said: 'If you have spent [all of] what is in the earth, you would not have achieved the virtue you have had you left early in the day with them.'\"",
      "chain": [
        "30242",
        "20354",
        "20381",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "551",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Traveling - أَبْوَابُ السَّفَرِ",
      "chapter_no": "6",
      "text_ar": "حدثنا علي بن حجر، حدثنا حفص بن غياث، عن الحجاج، عن عطية، عن ابن عمر، قال صليت مع النبي صلى الله عليه وسلم الظهر في السفر ركعتين وبعدها ركعتين ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وقد رواه ابن أبي ليلى عن عطية ونافع عن ابن عمر ‏.‏",
      "text_en": " Ibn Umar narrated:                     \"I prayed Zuhr with the Prophet on a journey as two Rak'ah, and two Rak'ah after it.\"",
      "chain": [
        "20387",
        "20317",
        "20381",
        "18"
      ]
    },
    {
      "hadith_no": "898",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن عبدة الضبي البصري، حدثنا زياد بن عبد الله، عن الحجاج، عن الحكم، عن مقسم، عن ابن عباس، قال كان رسول الله صلى الله عليه وسلم يرمي الجمار إذا زالت الشمس ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Messenger of Allah stoned the Jimar when the sun had passed the zenith.\"",
      "chain": [
        "30423",
        "20381",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "899",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يحيى بن زكريا بن أبي زائدة، أخبرنا الحجاج، عن الحكم، عن مقسم، عن ابن عباس، أن النبي صلى الله عليه وسلم رمى الجمرة يوم النحر راكبا ‏.‏ قال وفي الباب عن جابر وقدامة بن عبد الله وأم سليمان بن عمرو بن الأحوص ‏.‏ قال أبو عيسى حديث ابن عباس حديث حسن ‏.‏ والعمل على هذا عند بعض أهل العلم واختار بعضهم أن يمشي إلى الجمار ‏.‏ وقد روي عن ابن عمر عن النبي صلى الله عليه وسلم أنه كان يمشي إلى الجمار ‏.‏ ووجه هذا الحديث عندنا أنه ركب في بعض الأيام ليقتدى به في فعله وكلا الحديثين مستعمل عند أهل العلم ‏.‏",
      "text_en": " Ibn Abbas narrated:                     \"The Prophet stoned the Jamrah on the Day of An-Nahr while riding.\"",
      "chain": [
        "30242",
        "20366",
        "20381",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "931",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا محمد بن عبد الأعلى الصنعاني، حدثنا عمر بن علي، عن الحجاج، عن محمد بن المنكدر، عن جابر، أن النبي صلى الله عليه وسلم سئل عن العمرة أواجبة هي قال ‏\"‏ لا وأن تعتمروا هو أفضل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وهو قول بعض أهل العلم قالوا العمرة ليست بواجبة ‏.‏ وكان يقال هما حجان الحج الأكبر يوم النحر والحج الأصغر العمرة ‏.‏ وقال الشافعي العمرة سنة لا نعلم أحدا رخص في تركها وليس فيها شيء ثابت بأنها تطوع وقد روي عن النبي صلى الله عليه وسلم بإسناد وهو ضعيف لا تقوم بمثله الحجة وقد بلغنا عن ابن عباس أنه كان يوجبها ‏.‏ قال أبو عيسى كله كلام الشافعي ‏.‏",
      "text_en": " Jabir narrated that:                     The Prophet was asked about whether Umrah was obligatory? He said: \"No. But if you perform Umrah it is more virtuous.\"",
      "chain": [
        "20265",
        "20381",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "947",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا ابن أبي عمر، حدثنا أبو معاوية، عن الحجاج، عن أبي الزبير، عن جابر، أن رسول الله صلى الله عليه وسلم قرن الحج والعمرة فطاف لهما طوافا واحدا ‏.‏ قال وفي الباب عن ابن عمر وابن عباس ‏.‏ قال أبو عيسى حديث جابر حديث حسن ‏.‏ والعمل على هذا عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم قالوا القارن يطوف طوافا واحدا ‏.‏ وهو قول الشافعي وأحمد وإسحاق ‏.‏ وقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم يطوف طوافين ويسعى سعيين ‏.‏ وهو قول الثوري وأهل الكوفة ‏.‏",
      "text_en": " Jabir narrated:                     \"The Messenger of Allah performed Qaran for Hajj and Umrah, so he performed one Tawaf for both of them.\"",
      "chain": [
        "30421",
        "20354",
        "20381",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1046",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا أبو سعيد الأشج، حدثنا أبو خالد الأحمر، حدثنا الحجاج، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم كان إذا أدخل الميت القبر - وقال أبو خالد مرة إذا وضع الميت في لحده قال مرة ‏\"‏ بسم الله وبالله وعلى ملة رسول الله ‏\"‏ ‏.‏ وقال مرة ‏\"‏ بسم الله وبالله وعلى سنة رسول الله صلى الله عليه وسلم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏ وقد روي هذا الحديث من غير هذا الوجه عن ابن عمر عن النبي صلى الله عليه وسلم ‏.‏ ورواه أبو الصديق الناجي عن ابن عمر عن النبي صلى الله عليه وسلم وقد روي عن أبي الصديق الناجي عن ابن عمر موقوفا أيضا ‏.‏",
      "text_en": " Ibn Umar narrated:                     \"When he Prophet put the deceased in the grave\" He said: And Abu Khalid (one of the narrators) said [one time]: \"When he placed the deceased in the Lahd\" - \"He said one time: 'In the Name of Allah, by His command and upon the Millah of the Messenger of Allah.' and one time he said: 'In the Name of Allah, by His command and upon the Sunnah of the Messenger of Allah.\"",
      "chain": [
        "30200",
        "20326",
        "20381",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1080",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا حفص بن غياث، عن الحجاج، عن مكحول، عن أبي الشمال، عن أبي أيوب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أربع من سنن المرسلين الحياء والتعطر والسواك والنكاح ‏\"‏ ‏.‏ قال وفي الباب عن عثمان وثوبان وابن مسعود وعائشة وعبد الله بن عمرو وأبي نجيح وجابر وعكاف ‏.‏ قال أبو عيسى حديث أبي أيوب حديث حسن غريب ‏.‏ حدثنا محمود بن خداش البغدادي، حدثنا عباد بن العوام، عن الحجاج، عن مكحول، عن أبي الشمال، عن أبي أيوب، عن النبي صلى الله عليه وسلم نحو حديث حفص ‏.‏ قال أبو عيسى وروى هذا الحديث هشيم ومحمد بن يزيد الواسطي وأبو معاوية وغير واحد عن الحجاج عن مكحول عن أبي أيوب ولم يذكروا فيه عن أبي الشمال وحديث حفص بن غياث وعباد بن العوام أصح ‏.‏",
      "text_en": " Abu Ayyub narrated that :                     The Messenger of Allah said: \"Four are from the Sunan of the Messengers: Al-Hayat, using Atar, the Siwak, and marriage.\"",
      "chain": [
        "35047",
        "20317",
        "20381",
        "11066",
        "33"
      ]
    },
    {
      "hadith_no": "1142",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن منيع، وهناد، قالا حدثنا أبو معاوية، عن الحجاج، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم رد ابنته زينب على أبي العاصي بن الربيع بمهر جديد ونكاح جديد ‏.‏ قال أبو عيسى هذا حديث في إسناده مقال ‏.‏ والعمل على هذا الحديث عند أهل العلم أن المرأة إذا أسلمت قبل زوجها ثم أسلم زوجها وهي في العدة أن زوجها أحق بها ما كانت في العدة ‏.‏ وهو قول مالك بن أنس والأوزاعي والشافعي وأحمد وإسحاق ‏.‏",
      "text_en": " Amr bin Shu'aib narrated from his father, from his grandfather:                     \"The Messenger of Allah returned his daughter Zainab to Abul-As bin Ar-Rabi with a new dowry and a new wedding.\"",
      "chain": [
        "30242",
        "30480",
        "20354",
        "20381",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "1238",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو عمار الحسين بن حريث، حدثنا عبد الله بن نمير، عن الحجاج، وهو ابن أرطاة عن أبي الزبير، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الحيوان اثنان بواحد لا يصلح نسيئا ولا بأس به يدا بيد ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Jabir:                     That the Messenger of Allah (ﷺ) said: \"Animals [two for one] are not proper on credit, and there is no harm in a hand to hand (exchange).\"The Hadith is Hasan Sahih.",
      "chain": [
        "30325",
        "20331",
        "20381",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "1284",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا الحسن بن قزعة، أخبرنا عبد الرحمن بن مهدي، عن حماد بن سلمة، عن الحجاج، عن الحكم، عن ميمون بن أبي شبيب، عن علي، قال وهب لي رسول الله صلى الله عليه وسلم غلامين أخوين فبعت أحدهما فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا علي ما فعل غلامك ‏\"‏ ‏.‏ فأخبرته فقال ‏\"‏ رده رده ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ وقد كره بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم التفريق بين السبى في البيع ويكره أن يفرق بين الوالدة وولدها وبين الوالد والولد وبين الإخوة والأخوات في البيع ‏.‏ ورخص بعض أهل العلم في التفريق بين المولدات الذين ولدوا في أرض الإسلام ‏.‏ والقول الأول أصح ‏.‏ وروي عن إبراهيم النخعي أنه فرق بين والدة وولدها في البيع فقيل له في ذلك فقال إني قد استأذنتها بذلك فرضيت ‏.‏",
      "text_en": " Narrated 'Ali :                     \"The Messenger of Allah (ﷺ) gave me two boys who were brothers, so I sold one of them, and the Messenger of Allah (ﷺ) said to me: 'O, 'Ali! What happened to your boy?' So I informed him, and he said: 'Return him, return him.'\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. Some of the people of knowledge among the Companions of the Prophet (ﷺ) and others, disliked separating between the captives when selling them.Some of the people of knowledge permitted separating the children that were born in the land of Islam, but the first view is more correct. It has been related that Ibrahim An-Nakha'i seperated a mother and her child in a sale, so he was asked about that. He said: \"I sought her permission for that and she approved.\"",
      "chain": [
        "34055",
        "20033",
        "20021",
        "20381",
        "11069",
        "10834",
        "5",
        "20298"
      ]
    },
    {
      "hadith_no": "1386",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Blood Money - كتاب الديات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "16",
      "text_ar": "حدثنا علي بن سعيد الكندي الكوفي، أخبرنا ابن أبي زائدة، عن الحجاج، عن زيد بن جبير، عن خشف بن مالك، قال سمعت ابن مسعود، قال قضى رسول الله صلى الله عليه وسلم في دية الخطإ عشرين بنت مخاض وعشرين بني مخاض ذكورا وعشرين بنت لبون وعشرين جذعة وعشرين حقة ‏.‏ قال وفي الباب عن عبد الله بن عمرو ‏.‏  حدثنا أبو هشام الرفاعي، أخبرنا ابن أبي زائدة، وأبو خالد الأحمر عن الحجاج بن أرطاة، نحوه ‏.‏ قال أبو عيسى حديث ابن مسعود لا نعرفه مرفوعا إلا من هذا الوجه وقد روي عن عبد الله موقوفا ‏.‏ وقد ذهب بعض أهل العلم إلى هذا وهو قول أحمد وإسحاق ‏.‏ وقد أجمع أهل العلم على أن الدية تؤخذ في ثلاث سنين في كل سنة ثلث الدية ورأوا أن دية الخطإ على العاقلة ‏.‏ ورأى بعضهم أن العاقلة قرابة الرجل من قبل أبيه ‏.‏ وهو قول مالك والشافعي ‏.‏ وقال بعضهم إنما الدية على الرجال دون النساء والصبيان من العصبة يحمل كل رجل منهم ربع دينار ‏.‏ وقد قال بعضهم إلى نصف دينار فإن تمت الدية وإلا نظر إلى أقرب القبائل منهم فألزموا ذلك ‏.‏",
      "text_en": " Narrated Ibn Mas'ud:                     \"The Messenger of Allah (ﷺ) judged for the accidental blood-Money: Twenty Bint Makhad, twenty make Ibn Makhad, twenty Bint Labunm twenty Jadha'ah, and twenty Hiqqah.(Another chain) with similar meaning.",
      "chain": [
        "38401",
        "20366",
        "20381",
        "22061",
        "19907",
        "16"
      ]
    },
    {
      "hadith_no": "1447",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا قتيبة، حدثنا عمر بن علي المقدمي، حدثنا الحجاج، عن مكحول، عن عبد الرحمن بن محيريز، قال سألت فضالة بن عبيد عن تعليق اليد، في عنق السارق أمن السنة هو قال أتي رسول الله صلى الله عليه وسلم بسارق فقطعت يده ثم أمر بها فعلقت في عنقه ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث عمر بن علي المقدمي عن الحجاج بن أرطاة ‏.‏ وعبد الرحمن بن محيريز هو أخو عبد الله بن محيريز شامي ‏.‏",
      "text_en": " 'Abdur-Rahman bin Muhariz said:                      \"I asked Fadalah bin 'Ubaid about hanging the hand around the neck of the thief: 'Is this from the Sunnah?' He said: 'A man came to the Messenger of Allah (ﷺ) with a thief so his hand was cut off, and then he ordered that it be hung around his neck.'\"",
      "chain": [
        "30367",
        "20265",
        "20381",
        "11066",
        "19926",
        "1935"
      ]
    },
    {
      "hadith_no": "1464",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا يزيد بن هارون، حدثنا الحجاج، عن مكحول، عن أبي ثعلبة، والحجاج، عن الوليد بن أبي مالك، عن عائذ الله بن عبد الله، أنه سمع أبا ثعلبة الخشني، قال قلت يا رسول الله إنا أهل صيد ‏.‏ قال ‏\"‏ إذا أرسلت كلبك وذكرت اسم الله عليه فأمسك عليك فكل ‏\"‏ ‏.‏ قلت وإن قتل قال ‏\"‏ وإن قتل ‏\"‏ ‏.‏ قلت إنا أهل رمى ‏.‏ قال ‏\"‏ ما ردت عليك قوسك فكل ‏\"‏ ‏.‏ قال قلت إنا أهل سفر نمر باليهود والنصارى والمجوس فلا نجد غير آنيتهم ‏.‏ قال ‏\"‏ فإن لم تجدوا غيرها فاغسلوها بالماء ثم كلوا فيها واشربوا ‏\"‏ ‏.‏ قال وفي الباب عن عدي بن حاتم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وعائذ الله بن عبد الله هو أبو إدريس الخولاني واسم أبي ثعلبة الخشني جرثوم ويقال جرثم بن ناشر ويقال ابن قيس ‏.‏",
      "text_en": " Narrated Abu Tha'labah Al-Khushani:                     \"I said: 'O Messenger of Allah! We are a people who hunt.' He said: 'If you send your dog and you mentioned the Name of Allah upon it, and he catches something for you, then eat it.' I said: 'Even if he kills it?' He said: 'Even if he kills it.' I said: 'We are a people who shoot (at game).' He said: 'What you catch with your bow, then eat it.'\" He said: \"Then I said:'Indeed we are a people who travel. We come across Jews, Christians, and Zoroastrians, and we do not find vessels other than theirs.' He said: 'If you do not find other than them, then wash them with water, then eat and drink from it.'\"",
      "chain": [
        "30242",
        "20472",
        "20381",
        "11066",
        "4056",
        "20381"
      ]
    },
    {
      "hadith_no": "1466",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Hunting - كتاب الصيد والذبائح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "18",
      "text_ar": "حدثنا يوسف بن عيسى، حدثنا وكيع، حدثنا شريك، عن الحجاج، عن القاسم بن أبي بزة، عن سليمان اليشكري، عن جابر بن عبد الله، قال نهينا عن صيد، كلب المجوس ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من هذا الوجه ‏.‏ والعمل على هذا عند أكثر أهل العلم لا يرخصون في صيد كلب المجوس ‏.‏ والقاسم بن أبي بزة هو القاسم بن نافع المكي ‏.‏",
      "text_en": " Narrated Jabir bin 'Abdullah:                     \"We have been forbidden from the game caught by a Zoroastrian's dog.\"",
      "chain": [
        "30401",
        "20032",
        "20587",
        "20381",
        "11261",
        "34"
      ]
    },
    {
      "hadith_no": "1829",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا الحسن بن محمد الزعفراني، حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني محمد بن يوسف، أن عطاء بن يسار، أخبره أن أم سلمة أخبرته أنها، قربت إلى رسول الله صلى الله عليه وسلم جنبا مشويا فأكل منه ثم قام إلى الصلاة وما توضأ ‏.‏ قال وفي الباب عن عبد الله بن الحارث والمغيرة وأبي رافع ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏",
      "text_en": " Narrated Umm Salamah:                     That she brought a side of roasted meat to the Messenger of Allah (ﷺ), so he ate it from it and stood for Salat, and did not perform Wudu'He said: There are narrations on this topic from 'Abdullah bin Al-Harith, Al-Mughirah, and Abu Rafi'[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib from this route.",
      "chain": [
        "30245",
        "20381",
        "11070",
        "30388",
        "11020",
        "56"
      ]
    },
    {
      "hadith_no": "2626",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو عبيدة بن أبي السفر، - واسمه أحمد بن عبد الله الهمداني الكوفي قال حدثنا حجاج بن محمد، عن يونس بن أبي إسحاق، عن أبي إسحاق الهمداني، عن أبي جحيفة، عن علي، عن النبي صلى الله عليه وسلم قال ‏\"‏ من أصاب حدا فعجل عقوبته في الدنيا فالله أعدل من أن يثني على عبده العقوبة في الآخرة ومن أصاب حدا فستره الله عليه وعفا عنه فالله أكرم من أن يعود في شيء قد عفا عنه ‏\"‏ ‏.‏ قال أبو عيسى وهذا حديث حسن غريب صحيح ‏.‏ وهذا قول أهل العلم لا نعلم أحدا كفر أحدا بالزنا أو السرقة وشرب الخمر ‏.‏",
      "text_en": " Narrated Ali bin Abu Talib:                     that the Prophet (ﷺ) said: \"Whoever is penalized (for a crime) then his punishment has been hastened for him in the world, for Allah is more just than to double the punishment upon His slave in the Hereafter. And whoever does a punishable act and then Allah covers it for him and forgives him, then Allah is more kind than to recount something which He has already forgiven.\"",
      "chain": [
        "20381",
        "10846",
        "11049",
        "4047",
        "5"
      ]
    },
    {
      "hadith_no": "3680",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو كريب، حدثنا حكام بن سلم الرازي، عن عمرو بن أبي قيس، عن الحجاج، عن المنهال بن عمرو، عن زر بن حبيش، عن علي، رضى الله عنه قال ما زلنا نشك في عذاب القبر حتى نزلت ‏:‏ ‏(‏ألهاكم التكاثر ‏)‏ قال أبو كريب مرة عن عمرو بن أبي قيس هو رازي وعمرو بن قيس الملائي كوفي عن ابن أبي ليلى عن المنهال بن عمرو ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
      "text_en": " Zirr bin Jubaish reported from Ali [may Allah be pleased with him] that he said:                     “We were still in doubt concerning the torment of the grave, until ‘the mutual rivalry diverts you” was revealed’.”",
      "chain": [
        "30216",
        "20649",
        "20726",
        "20381",
        "11656",
        "11337",
        "5"
      ]
    },
    {
      "hadith_no": "3433",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أبو عبيدة بن أبي السفر الكوفي، - واسمه أحمد بن عبد الله الهمداني حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني موسى بن عقبة، عن سهيل بن أبي صالح، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من جلس في مجلس فكثر فيه لغطه فقال قبل أن يقوم من مجلسه ذلك سبحانك اللهم وبحمدك أشهد أن لا إله إلا أنت أستغفرك وأتوب إليك ‏.‏ إلا غفر له ما كان في مجلسه ذلك ‏\"‏ ‏.‏ وفي الباب عن أبي برزة وعائشة ‏.‏ قال هذا حديث حسن غريب صحيح من هذا الوجه لا نعرفه من حديث سهيل إلا من هذا الوجه ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     The Messenger of Allah said: “Whoever sits in a sitting and engages in much empty, meaningless speech and then says before getting from that sitting of his: ‘Glory is to You, O Allah, and praise, I bear witness that there is none worthy of worship except You, I seek You forgiveness, and I repent to You, (Subhanaka Allahumma Wa Bihamdika Wa Ashhadu An La Ilaha Illa Anta, Astaghfiruka Wa Atubu Ilaik)’ whatever occurred in that sitting would be forgiven to him.”",
      "chain": [
        "20381",
        "11070",
        "11106",
        "11173",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "4309",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن يحيى الأزدي، حدثنا حجاج بن محمد، عن ابن جريج، أخبرني أبو الزبير، أنه سمع جابر بن عبد الله، يقول حدثتني أم شريك، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليفرن الناس من الدجال حتى يلحقوا بالجبال ‏\"‏ ‏.‏ قالت أم شريك يا رسول الله فأين العرب يومئذ قال ‏\"‏ هم قليل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏",
      "text_en": " Narrated Umm Sharik:                     that the Messenger of Allah (ﷺ) said: \"The people will flee from the Dajjal such that they will go to the mountains.\" Umm Sharik said: \"O Messenger of Allah! Where will the Arabs be that day?\" He said: \"They will be few.\"",
      "chain": [
        "34251",
        "20381",
        "11070",
        "11263",
        "34",
        "187"
      ]
    },
    {
      "hadith_no": "457",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا يوسف بن سعيد، قال حدثنا حجاج بن محمد، قال حدثنا محمد بن عبد الله الشعيثي، عن عبد الله بن أبي بكر بن الحارث بن هشام، عن أمية بن عبد الله بن خالد بن أسيد، أنه قال لابن عمر كيف تقصر الصلاة وإنما قال الله عز وجل ‏{‏ فليس عليكم جناح أن تقصروا من الصلاة إن خفتم ‏}‏ فقال ابن عمر يا ابن أخي إن رسول الله صلى الله عليه وسلم أتانا ونحن ضلال فعلمنا فكان فيما علمنا أن الله عز وجل أمرنا أن نصلي ركعتين في السفر ‏.‏ قال الشعيثي وكان الزهري يحدث بهذا الحديث عن عبد الله بن أبي بكر ‏.‏",
      "text_en": " It was narrated that Umayyah bin 'Abdullah bin Khalid bin Asid said to Ibn 'Umar:                      \"How can the Salah be shortened as Allah says: There is no sin on you if you shorten As-Salah (the prayer) if you are in fear?\" [1] Ibn 'Umar said: \"O son of my brother! The Messenger of Allah (ﷺ) came to us when we had gone astray and he taught us. One of the things that he taught us was that Allah, the Mighty and Sublime, has commanded us to pray two Rak'ahs when traveling.\"[1] An-Nisa' 4:101.",
      "chain": [
        "20381",
        "20741"
      ]
    },
    {
      "hadith_no": "591",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرني الحسن بن إسماعيل بن سليمان، وأيوب بن محمد، قالا حدثنا حجاج بن محمد، قال أيوب حدثنا وقال، حسن أخبرني شعبة، عن يعلى بن عطاء، عن يزيد بن طلق، عن عبد الرحمن بن البيلماني، عن عمرو بن عبسة، قال أتيت رسول الله صلى الله عليه وسلم فقلت يا رسول الله من أسلم معك قال ‏\"‏ حر وعبد ‏\"‏ ‏.‏ قلت هل من ساعة أقرب إلى الله عز وجل من أخرى قال ‏\"‏ نعم جوف الليل الآخر فصل ما بدا لك حتى تصلي الصبح ثم انته حتى تطلع الشمس وما دامت ‏\"‏ ‏.‏ وقال أيوب فما دامت ‏\"‏ كأنها حجفة حتى تنتشر ثم صل ما بدا لك حتى يقوم العمود على ظله ثم انته حتى تزول الشمس فإن جهنم تسجر نصف النهار ثم صل ما بدا لك حتى تصلي العصر ثم انته حتى تغرب الشمس فإنها تغرب بين قرنى شيطان وتطلع بين قرنى شيطان ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Amr bin 'Abasah said:                      \"I came to the Messenger of Allah, who became Muslim with you?' He said: 'Free men and slaves.' I said: 'Is there any moment which brings one closer to Allah than another?' He said: 'Yes, the last part of the night, so pray as much as you want until you pray Subh, then stop until the sun has risen until and it looks like a shield and (its shinning)spreads. Then pray as much as you want until an object's shadow is at its shortest, then stop until the sun passes its zenith, for Hell is stoked at midday. Then pray 'Asr, then stop until you pray 'Asr, then stop until the sun has set, for it sets between the horns of a Shaitan and rises between the horns of a Shaitan.'\" [1][1] Similar has been recorded by Muslim.",
      "chain": [
        "20381",
        "11015",
        "20020",
        "10986",
        "19175",
        "19813",
        "4002"
      ]
    },
    {
      "hadith_no": "957",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرني إبراهيم بن الحسن المقسمي، قال حدثنا حجاج بن محمد، عن عمر بن ذر، عن أبيه، عن سعيد بن جبير، عن ابن عباس، أن النبي صلى الله عليه وسلم سجد في ‏{‏ ص ‏}‏ وقال ‏\"‏ سجدها داود توبة ونسجدها شكرا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Abbas that:                     The Prophet (ﷺ) prostrated in Sad and said: \"Dawud did this prostration in repentance and we do it in thanksgiving.\"",
      "chain": [
        "38070",
        "20381",
        "11642",
        "11423",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "1545",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "18",
      "text_ar": "أخبرنا إبراهيم بن الحسن، عن حجاج بن محمد، عن شعبة، عن الحكم، عن يزيد الفقير، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم صلى بهم صلاة الخوف فقام صف بين يديه وصف خلفه صلى بالذين خلفه ركعة وسجدتين ثم تقدم هؤلاء حتى قاموا في مقام أصحابهم وجاء أولئك فقاموا مقام هؤلاء وصلى بهم رسول الله صلى الله عليه وسلم ركعة وسجدتين ثم سلم فكانت للنبي صلى الله عليه وسلم ركعتان ولهم ركعة ‏.‏",
      "text_en": " It was narrated from Jabir bin 'Abdullah that:                     The Messenger of Allah (ﷺ) led them in offering the fear prayer. One row stood in front of him and another row stood behind him. He led those who were behind in prayer, bowing once and prostrating twice, then they moved forward until they took the place of their companions, and the others came and took their place, and the Messenger of Allah (ﷺ) led them in prayer, bowing once and prostrating twice, then he said the taslim, so the Prophet (ﷺ) had prayed two rak'ahs and they had prayed one.",
      "chain": [
        "38070",
        "20381",
        "20020",
        "11069",
        "11665",
        "34"
      ]
    },
    {
      "hadith_no": "1797",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرني إبراهيم بن الحسن، قال حدثنا حجاج بن محمد، قال قال ابن جريج قلت لعطاء بلغني أنك تركع قبل الجمعة اثنتى عشرة ركعة ما بلغك في ذلك قال أخبرت أم حبيبة عنبسة بن أبي سفيان أن النبي صلى الله عليه وسلم قال ‏\"‏ من ركع اثنتى عشرة ركعة في اليوم والليلة سوى المكتوبة بنى الله عز وجل له بيتا في الجنة ‏\"‏ ‏.‏",
      "text_en": " Ibn Juraij said:                     \"I said to Ata: 'I heard that you pray twelve rak'ahs before Jumu'ah. What did you hear concerning that?' He said: 'I was told that Umm Habibah bin Abi Sufyan said: \"I heard the Messenger of Allah (ﷺ) say: 'Whoever prays twelve rak'ahs during the day and night, apart from the prescribed prayers, Allah (SWT), the Mighty and Sublime, will build for him a house in Paradise.'\"",
      "chain": [
        "38070",
        "20381",
        "11070"
      ]
    },
    {
      "hadith_no": "2378",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرني إبراهيم بن الحسن، قال حدثنا حجاج بن محمد، قال قال ابن جريج سمعت عطاء، أن أبا العباس الشاعر، أخبره أنه، سمع عبد الله بن عمرو بن العاص، قال بلغ النبي صلى الله عليه وسلم أني أصوم أسرد الصوم وساق الحديث ‏.‏ قال قال عطاء لا أدري كيف ذكر صيام الأبد لا صام من صام الأبد ‏.‏",
      "text_en": " 'Abdullah bin 'Amr bin Al-As said:                     \"The Prophet heard that I was fasting continually,\" and he quoted this Hadith. 'Ata said: \"I am not sure how he put it, but I think he said: 'There is no fast for one who fats continually.\" 'Ata said: \"someone who heard him told me that Ibn 'Umar (said) that the Prophet said: 'Whoever fasts every day of his life, then he has not fasted.\"",
      "chain": [
        "38070",
        "20381",
        "11070",
        "11029",
        "29"
      ]
    },
    {
      "hadith_no": "2403",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا إبراهيم بن الحسن، قال حدثنا حجاج بن محمد، قال حدثني شعبة، عن زياد بن فياض، قال سمعت أبا عياض، قال قال عبد الله بن عمرو قال لي رسول الله صلى الله عليه وسلم ‏\"‏ صم من الشهر يوما ولك أجر ما بقي ‏\"‏ ‏.‏ قلت إني أطيق أكثر من ذلك ‏.‏ قال ‏\"‏ فصم يومين ولك أجر ما بقي ‏\"‏ ‏.‏ قلت إني أطيق أكثر من ذلك ‏.‏ قال ‏\"‏ فصم ثلاثة أيام ولك أجر ما بقي ‏\"‏ ‏.‏ قلت إني أطيق أكثر من ذلك ‏.‏ قال ‏\"‏ صم أربعة أيام ولك أجر ما بقي ‏\"‏ ‏.‏ قلت إني أطيق أكثر من ذلك ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أفضل الصوم صوم داود كان يصوم يوما ويفطر يوما ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin Amr said:                     \"The Messenger of Allah said to me: 'Fast one day of the month and you will have the reward of what is left.' I said: 'I am able to do more than that.' He said: 'Fast two days and you will have the reward of what is left.' I said: 'I am able to do more than that.' He said: 'Fast three days and you will have the reward of what is left.' I said: 'I am able to do more than that.' He said: 'Fast four days and you will have the reward of what is left.' I said: ' I am able to do more than that.' The messenger of Allah said: 'The best fasting is the fast of Dawud; he used to fast one day and not the next.\"'   2406. It was narrated that Abu Dharr said: \"My beloved Prophet advised me to do three things which I will never give up, if Allah wills. He advised me to pray Duha to pray Witr before sleeping, and to fast three days of each month.\"",
      "chain": [
        "38070",
        "20381",
        "20020",
        "10764",
        "29"
      ]
    },
    {
      "hadith_no": "3073",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا يعقوب بن إبراهيم، قال أنبأنا ابن أبي زائدة، قال حدثنا الأعمش، سمعت الحجاج، يقول لا تقولوا سورة البقرة قولوا السورة التي يذكر فيها البقرة ‏.‏ فذكرت ذلك لإبراهيم فقال أخبرني عبد الرحمن بن يزيد أنه كان مع عبد الله حين رمى جمرة العقبة فاستبطن الوادي واستعرضها يعني الجمرة فرماها بسبع حصيات وكبر مع كل حصاة فقلت إن أناسا يصعدون الجبل ‏.‏ فقال ها هنا والذي لا إله غيره رأيت الذي أنزلت عليه سورة البقرة رمى ‏.‏",
      "text_en": " Al-A 'mash said :                     \"I head Al-Hajjaj say: 'Do not say Surat Al-Baqarah, say: 'The Surah in which the cow (Al-Baqarah) is mentioned.\"' I mentioned that to Ibrahim, and he said: \"Abdur-Rahman bi Yazdi told me, that he was with 'Abdullah when he stoned Jamratul 'Aqabah. He went down the middle of the valley, stood opposite it - meaning the Jamrah - and throew seven pebbiles at it, saying the Takbir with each pebble. I said; \"Some people climbed the mountain.\" He said: \"Here - by the One beside Whom there is no other God -  is the place where the one to whom Surat Al-Baqarah was revelated stoned.\"",
      "chain": [
        "20184",
        "20366",
        "11060",
        "20381",
        "11055"
      ]
    },
    {
      "hadith_no": "3424",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا يوسف بن سعيد، قال حدثنا حجاج بن محمد، قال حدثنا الليث بن سعد، قال حدثني عقيل، عن ابن شهاب، قال أخبرني عبد الرحمن بن عبد الله بن كعب، أن عبد الله بن كعب، قال سمعت كعبا، يحدث حديثه حين تخلف عن رسول الله صلى الله عليه وسلم في غزوة تبوك وقال فيه إذا رسول رسول الله صلى الله عليه وسلم يأتيني ويقول إن رسول الله صلى الله عليه وسلم يأمرك أن تعتزل امرأتك ‏.‏ فقلت أطلقها أم ماذا أفعل قال بل اعتزلها ولا تقربها ‏.‏ وأرسل إلى صاحبى بمثل ذلك فقلت لامرأتي الحقي بأهلك وكوني عندهم حتى يقضي الله عز وجل في هذا الأمر ‏.‏ خالفهم معقل بن عبيد الله ‏.‏",
      "text_en": " 'Abdur-Rahman bin 'Abdullah bin Ka'b bin Malik narrated that 'Abdullah bin Ka'b said:                      \"I heard Ka'b narrate the Hadith about when he stayed behind and did not join the Messenger of Allah on the expedition to Tabuk. He said: 'The envoy of the Messenger of Allah came to me and said: \"The Messenger of Allah commands you to keep away from your wife.\" I said: \"Shall I divorce her, or what should I do?\" He said: \"No, just keep away from her and do not approach her.\" And he sent similar instructions to my two companions. I said to my wife: \"Go to your family and stay with them until Allah, the Mighty and Sublime, decides concerning this matter.\"'\"",
      "chain": [
        "20381",
        "20023",
        "11207",
        "11013",
        "11519",
        "1131"
      ]
    },
    {
      "hadith_no": "3433",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا إبراهيم بن الحسن، وعبد الرحمن بن محمد بن سلام، قالا حدثنا حجاج بن محمد، عن ابن جريج، عن عطاء، عن أبي هريرة، أن النبي صلى الله عليه وسلم - قال عبد الرحمن عن رسول الله صلى الله عليه وسلم - قال ‏\"‏ إن الله تعالى تجاوز عن أمتي كل شىء حدثت به أنفسها ما لم تكلم به أو تعمل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that -(one of the narrators) 'Abdur-Rahman said:                      \"The Messenger of Allah -said: 'Allah, the Most High, has forgiven my Ummah for everything that enters the mind, so long as it is not spoken of or put into action.'\"",
      "chain": [
        "38070",
        "36587",
        "20381",
        "11070",
        "11029",
        "13"
      ]
    },
    {
      "hadith_no": "3825",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا يوسف بن سعيد، قال حدثنا حجاج بن محمد، قال حدثنا ليث بن سعد، قال حدثني عقيل، عن ابن شهاب، قال حدثني عبد الرحمن بن عبد الله بن كعب، أن عبد الله بن كعب بن مالك، قال سمعت كعب بن مالك، يحدث حديثه حين تخلف عن رسول الله صلى الله عليه وسلم في غزوة تبوك قلت يا رسول الله إن من توبتي أن أنخلع من مالي صدقة إلى الله وإلى رسوله ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ أمسك عليك مالك فهو خير لك ‏\"‏ ‏.‏ قلت فإني أمسك على سهمي الذي بخيبر ‏.‏",
      "text_en": " 'Abdullah bin Ka'b bin Malik said:                      \"I heard Ka'b bin Malik narrating his Hadith about when he stayed behind and did not join the Messenger of Allah on the campaign to Tabuk. (he said) I said: 'As part of my repentance I want to give my wealth in charity for Allah and His Messenger.' The Messenger of Allah said: 'Keep some of your wealth for yourself; that is better for you.' I said: 'I will keep for myself my share that is in Khaibar.'\"",
      "chain": [
        "20381",
        "20023",
        "11207",
        "11013",
        "11519",
        "1131",
        "390"
      ]
    },
    {
      "hadith_no": "4004",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا الحسن بن محمد الزعفراني، قال حدثنا حجاج بن محمد، قال ابن جريج أخبرني يعلى، عن سعيد بن جبير، عن ابن عباس، أن ناسا، من أهل الشرك أتوا محمدا فقالوا إن الذي تقول وتدعو إليه لحسن لو تخبرنا أن لما عملنا كفارة ‏.‏ فنزلت ‏{‏ والذين لا يدعون مع الله إلها آخر ‏}‏ ونزلت ‏{‏ قل يا عبادي الذين أسرفوا على أنفسهم ‏}‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Abbas that :                     Some of the people of Shirk came to Muhammad [SAW] and said: \"What you say and call people to is good, if only you could tell us that there is any expiation for what we have done.\" Then the Verses: \"And those who invoke not any other ilah (god) along with Allah, or kill such a person as Allah has forbidden, except by right.\" And \"Say: O 'Ibadi (My slaves) who have transgressed against themselves (by committing evil deeds and sins)\" were revealed.",
      "chain": [
        "30245",
        "20381",
        "11070",
        "20372",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "4246",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Fara' and al-'Atirah - كتاب الفرع والعتيرة",
      "chapter_no": "41",
      "text_ar": "أخبرنا أيوب بن محمد الوزان، قال حدثنا حجاج بن محمد، قال حدثنا شريك، عن الأعمش، عن إبراهيم، عن الأسود، عن عائشة، عن النبي صلى الله عليه وسلم قال ‏\"‏ ذكاة الميتة دباغها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah that the Prophet said:                     \"The dead animal is purified by tanning it.\"",
      "chain": [
        "38120",
        "20381",
        "20587",
        "11060",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "4295",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرني إبراهيم بن الحسن المقسمي، قال حدثنا حجاج بن محمد، عن حماد بن سلمة، عن أبي الزبير، عن جابر، أن رسول الله صلى الله عليه وسلم نهى عن ثمن السنور والكلب إلا كلب صيد ‏.‏ قال أبو عبد الرحمن وحديث حجاج عن حماد بن سلمة ليس هو بصحيح ‏.‏",
      "text_en": " It was narrated from Jabir that:                     the Prophet forbade the price of cats and dogs, except hunting. (Da if)Abu Abdur-Rahman (An-Nasa I) said: The Hadith of Hajjaj from Hammad bin Salamah is not authentic:",
      "chain": [
        "38070",
        "20381",
        "20021",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "4501",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا إبراهيم بن الحسن، قال حدثنا حجاج بن محمد، قال أنبأنا ابن جريج، قال أنبأنا هشام بن حسان القردوسي، أنه سمع ابن سيرين، يقول سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تلقوا الجلب فمن تلقاه فاشترى منه فإذا أتى سيده السوق فهو بالخيار ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                     \"The Messenger of Allah said: 'Do and whoever meets any of them and buys from him the vendor has the choice of annulling the transaction when he comes to the marketplace.\"'",
      "chain": [
        "38070",
        "20381",
        "11070",
        "11311",
        "11035",
        "13"
      ]
    },
    {
      "hadith_no": "4601",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرني إبراهيم بن الحسن، عن حجاج بن محمد، قال قال ابن جريج أخبرني عطاء، عن صفوان بن موهب، أنه أخبره عن عبد الله بن محمد بن صيفي، عن حكيم بن حزام، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تبع طعاما حتى تشتريه وتستوفيه ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hakim bin Hizam said:                     \"The Messenger of Allah said: \"Do not sell food until you have bought it and taken possession of it.\"'",
      "chain": [
        "38070",
        "20381",
        "11070",
        "11029",
        "13520",
        "423"
      ]
    },
    {
      "hadith_no": "4668",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرني إبراهيم بن الحسن، قال أنبأنا حجاج بن محمد، عن حماد بن سلمة، عن أبي الزبير، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم نهى عن ثمن الكلب والسنور إلا كلب صيد ‏.‏ قال أبو عبد الرحمن هذا منكر ‏.‏",
      "text_en": " It was narrated from Jabir bin 'Adbullah that:                     the Messenger of Allah forbade the price of dogs and cats, except hunting dogs. (Da'if)Abu 'Abdur-Rahman  (An-Nasa'i) said: This is Munkar.",
      "chain": [
        "38070",
        "20381",
        "20021",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "4677",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرني عبد الرحمن بن خالد، وإبراهيم بن الحسن، - واللفظ له - قال حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني ابن أبي حسين، أن أبا بكر بن محمد بن عمرو بن حزم، أخبره أن عمر بن عبد العزيز حدثه عن أبي بكر بن عبد الرحمن، عن حديث أبي هريرة، عن النبي صلى الله عليه وسلم عن الرجل، يعدم إذا وجد عنده المتاع بعينه وعرفه أنه لصاحبه الذي باعه ‏.‏",
      "text_en": " It was narrated from Abu Hurairah from the Prophet, that:                     if a man becomes bankrupt, then a specific item is found with him, and is recognized, then it belongs to the one who sold it to him.",
      "chain": [
        "20376",
        "38070",
        "20381",
        "11070",
        "11239",
        "11010",
        "11003"
      ]
    },
    {
      "hadith_no": "4739",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا يوسف بن سعيد، قال حدثنا حجاج بن محمد، عن ابن جريج، قال أخبرني عمرو بن دينار، أنه سمع طاوسا، يحدث عن ابن عباس، عن عمر، رضى الله عنه أنه نشد قضاء رسول الله صلى الله عليه وسلم في ذلك فقام حمل بن مالك فقال كنت بين حجرتى امرأتين فضربت إحداهما الأخرى بمسطح فقتلتها وجنينها فقضى النبي صلى الله عليه وسلم في جنينها بغرة وأن تقتل بها ‏.‏",
      "text_en": " 'Amr bin Dinar narrated that:                     he heard Tawus narrate from Ibn 'Abbas, from 'Umar, may Allah be pleased with him, that he asked about the ruling of the Messenger of Allah concerning that. Hamal bin Malik stood up and said: \"I was married to two women, and one of them struck the other with a tent pole and killed her and her fetus. The Prophet ruled that a slave be given (as Diyah) for her fetus and that she be killed (for killing the other woman).\"",
      "chain": [
        "20381",
        "11070",
        "11081",
        "11053",
        "17",
        "3"
      ]
    },
    {
      "hadith_no": "4982",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن أبي بكر بن علي، عن الحجاج، عن مكحول، عن ابن محيريز، قال سألت فضالة بن عبيد عن تعليق، يد السارق في عنقه قال سنة قطع رسول الله صلى الله عليه وسلم يد سارق وعلق يده في عنقه ‏.‏",
      "text_en": " It was narrated that Ibn Muhairiz said;\"I asked Fadalah bin 'Ubaid about hanging the hand (of the thief) from his neck, and he said:                      'It is Sunnah. The Messenger of Allah cut off a thief's hand then hung it from his neck.\"'(Daif)",
      "chain": [
        "38265",
        "20025",
        "20381",
        "11066",
        "1935"
      ]
    },
    {
      "hadith_no": "4983",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثني عمر بن علي المقدمي، قال حدثنا الحجاج، عن مكحول، عن عبد الرحمن بن محيريز، قال قلت لفضالة بن عبيد أرأيت تعليق اليد في عنق السارق من السنة هو قال نعم أتي رسول الله صلى الله عليه وسلم بسارق فقطع يده وعلقه في عنقه ‏.‏ قال أبو عبد الرحمن الحجاج بن أرطاة ضعيف ولا يحتج بحديثه ‏.‏",
      "text_en": " It was narrated that 'Abdur-Rahman bin Muhairiz said:                     \"I said to Fadalah bin 'Ubaid: 'Do you think that hanging the hand from the thief's neck is Sunnah?' He said: 'Yes; a thief was brought to the Messenger of Allah and he cut off his hand and hung it from his neck.\"' (Daif)Abu 'Abdur-Rahman (An-Nasai) said; Al-Hajjaj bin Artah is weak, his narrations are not used as proof.",
      "chain": [
        "30160",
        "20265",
        "20381",
        "11066",
        "19926"
      ]
    },
    {
      "hadith_no": "1683",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن يوسف، قال حدثنا عبد الرزاق، قال أنبأنا ابن جريج، ح وحدثنا أبو عبيدة بن أبي السفر، قال حدثنا حجاج بن محمد، قال قال ابن جريج أخبرني إبراهيم بن محمد بن أبي عطاء، عن موسى بن وردان، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من مات مريضا مات شهيدا ووقي فتنة القبر وغدي وريح عليه برزقه من الجنة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “Whoever dies from a sickness dies as a martyr. He is protectedfrom the torment of the grave and he is granted provision fromParadise morning and evening.”",
      "chain": [
        "30535",
        "20121",
        "11070",
        "35002",
        "20381",
        "11070",
        "13"
      ]
    },
    {
      "hadith_no": "2012",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن نمير، عن الحجاج، عن الحكم، عن عراك بن مالك، عن عروة، عن عائشة، قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يحرم من الرضاع ما يحرم من النسب ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah:                     that the Messenger of Allah said: 'Breast-feeding makes unlawful (for marriages) the same things that blood tie make unlawful.”",
      "chain": [
        "30201",
        "20331",
        "20381",
        "11069",
        "11204",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2112",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Divorce - كتاب الطلاق",
      "chapter_no": "10",
      "text_ar": "حدثنا سفيان بن وكيع، حدثنا روح، ح وحدثنا أحمد بن منصور، حدثنا حجاج بن محمد، جميعا عن ابن جريج، أخبرني أبو الزبير، عن جابر بن عبد الله، قال طلقت خالتي فأرادت أن تجد نخلها فزجرها رجل أن تخرج إليه فأتت النبي  صلى الله عليه وسلم  فقال ‏\"‏ بلى فجدي نخلك فإنك عسى أن تصدقي أو تفعلي معروفا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir bin 'Abdullah said:                     \"My maternal aunt was divorced, and she wanted to collect the harvest from her date-palm trees. A man rebuked her for going out to the trees. She went to the Prophet (ﷺ), who said: 'No, go and collect the harvest from your trees, for perhaps you will give some in charity or do a good deed with it.'\"",
      "chain": [
        "35047",
        "20229",
        "20381",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "2233",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا محمد بن عبد الله الخزاعي، والحجاج، والهيثم بن جميل، قالوا حدثنا حماد، عن ثابت، عن أبي رافع، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ كان زكريا نجارا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     \"Zakariyya was a carpenter.\"",
      "chain": [
        "11222",
        "37563",
        "20381",
        "20391",
        "20022",
        "11269",
        "479",
        "13"
      ]
    },
    {
      "hadith_no": "2334",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا عفان، عن حماد، أنبأنا الحجاج، عن الحكم، عن ميمون بن أبي شبيب، عن علي، قال وهب لي رسول الله  صلى الله عليه وسلم  غلامين أخوين فبعت أحدهما فقال ‏\"‏ ما فعل الغلامان ‏\"‏ ‏.‏ قلت بعت أحدهما قال ‏\"‏ رده ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Ali said:                     \"The Messenger of Allah (ﷺ) gave me two slaves who were brothers, and I sold one of them. He said: 'What happened with the two slaves?' I said: 'I sold one of them.' He said: 'Take him back.\"'",
      "chain": [
        "11222",
        "30106",
        "20022",
        "20381",
        "11069",
        "10834",
        "5",
        "20298"
      ]
    },
    {
      "hadith_no": "2702",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Legal Punishments - كتاب الحدود",
      "chapter_no": "20",
      "text_ar": "حدثنا هارون بن عبد الله الحمال، حدثنا حجاج بن محمد، حدثنا يونس بن أبي إسحاق، عن أبي إسحاق، عن أبي جحيفة، عن علي، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أصاب في الدنيا ذنبا فعوقب به فالله أعدل من أن يثني عقوبته على عبده ومن أذنب ذنبا في الدنيا فستره الله عليه فالله أكرم من أن يعود في شىء قد عفا عنه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ali that the Messenger of Allah (ﷺ) said:                     “Whoever commits a sin in this world and is punished for it, Allah (STW) is too just to repeat the punishment for his slave (in the hereafter). And whoever commits a sin in this world and Allah conceals him, Allah is too generous to go back to something that He has pardoned.”",
      "chain": [
        "30524",
        "20381",
        "10846",
        "11049",
        "4047",
        "5"
      ]
    },
    {
      "hadith_no": "2887",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا هارون بن عبد الله الحمال، حدثنا حجاج بن محمد، حدثنا ابن جريج، أخبرني محمد بن طلحة بن عبد الله بن عبد الرحمن بن أبي بكر الصديق، عن أبيه، طلحة عن معاوية بن جاهمة السلمي، أن جاهمة، أتى النبي صلى الله عليه وسلم فذكر نحوه ‏.‏ قال أبو عبد الله بن ماجه هذا جاهمة بن عباس بن مرداس السلمي الذي عاتب النبي صلى الله عليه وسلم يوم حنين ‏.‏",
      "text_en": "",
      "chain": [
        "30524",
        "20381",
        "11070",
        "20604",
        "5299"
      ]
    },
    {
      "hadith_no": "3149",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا سويد بن سعيد، حدثنا علي بن مسهر، عن الحجاج، عن الحكم بن عتيبة، عن مقسم، عن ابن عباس، قال كان رسول الله  صلى الله عليه وسلم  إذا رمى جمرة العقبة مضى ولم يقف ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “When the Messenger of Allah(ﷺ)had stoned ‘Aqabah Pillar, he would continue on, and would notstaythere.”",
      "chain": [
        "30547",
        "20345",
        "20381",
        "11069",
        "11725",
        "17"
      ]
    },
    {
      "hadith_no": "3375",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا محمد بن يحيى الأزدي، حدثنا حجاج بن محمد، عن ابن جريج، قال سليمان بن موسى حدثنا عن نافع، أن عبد الله بن عمر، كان يقول إن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ أفشوا السلام وأطعموا الطعام وكونوا إخوانا كما أمركم الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " ‘Abdullah bin ‘Umar used to say that the Messenger of Allah (ﷺ)said:                      “Spread (the greeting og) Salam, offer food (to the needy),andbe brothers as Allah, the Mighty and Sublime, has honored you.”",
      "chain": [
        "34251",
        "20381",
        "11070",
        "10880",
        "11014",
        "18"
      ]
    }
  ],
  "total_hadiths": 124
}