{
  "id": "20384",
  "name": "Abu Ahmed al-Mu'dab الحسين بن محمد بن بهرام - أبو علي المؤدب",
  "full_name": "Abu Ahmed al-Mu'dab الحسين بن محمد بن بهرام - أبو علي المؤدب",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "213",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "Baghdad",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Merv",
      "Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Tamimi",
      "al-Mervazi",
      "Baghdad"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20179",
      "name": "Muhammad bin Matraf محمد بن مطرف",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20240",
      "name": "Shayban bin 'Abdur Rahman شيبان بن عبد الرحمن النحوي أبو معاوية",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "18068",
      "name": "Ayoub bin 'Utba أيوب بن عتبة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20584",
      "name": "Khlf bin Khlyfh خلف بن خليفة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20506",
      "name": "Abu Uvais al-Madni أبو أويس المدني الأصبحي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30242",
      "name": "Ahmed bin Manay' أحمد بن منيع",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30498",
      "name": "Ibrahim bin Sa'id al-Juhari إبراهيم بن سعيد الجوهري",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30375",
      "name": "Muhammad bin Rafa'i محمد بن رافع",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30585",
      "name": "'Abbas bin Muhammad bin Hatm عباس بن محمد بن حاتم",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2809",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن عبد الله، حدثنا حسين بن محمد أبو أحمد، حدثنا شيبان، عن قتادة، حدثنا أنس بن مالك، أن أم الربيع بنت البراء، وهى أم حارثة بن سراقة أتت النبي صلى الله عليه وسلم فقالت يا نبي الله، ألا تحدثني عن حارثة وكان قتل يوم بدر أصابه سهم غرب، فإن كان في الجنة، صبرت، وإن كان غير ذلك اجتهدت عليه في البكاء‏.‏ قال ‏\"‏ يا أم حارثة، إنها جنان في الجنة، وإن ابنك أصاب الفردوس الأعلى ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Um Ar-Rubai'bint Al-Bara', the mother of Hartha bin Suraqa came to the Prophet and said, \"O Allah's Prophet! Will you tell me about Hartha?\" Hartha has been killed (i.e. martyred) on the day of Badr with an arrow thrown by an unidentified person. She added, \"If he is in Paradise, I will be patient; otherwise, I will weep bitterly for him.\" He said, \"O mother of Hartha! There are Gardens in Paradise and your son got the Firdausal-ala (i.e. the best place in Paradise).",
      "chain": [
        "30561",
        "20384",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "2969",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا الفضل بن سهل، حدثنا حسين بن محمد، حدثنا جرير بن حازم، عن محمد، عن أنس بن مالك  رضى الله عنه  قال فزع الناس فركب رسول الله صلى الله عليه وسلم فرسا لأبي طلحة بطيئا، ثم خرج يركض وحده، فركب الناس يركضون خلفه، فقال ‏\"‏ لم تراعوا، إنه لبحر ‏\"‏‏.‏ فما سبق بعد ذلك اليوم‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Once the people got frightened, so Allah's Apostle rode a slow horse belonging to Abu Talha, and he set out all alone, making the horse gallop. Then the people rode, making their horses gallop after him. On his return he said, \"Don't be afraid (there is nothing to be afraid of) (and I have found) this horse a very fast one.\" That horse was never excelled in running hence forward. (Qastalani Vol. 5)",
      "chain": [
        "30264",
        "20384",
        "11272",
        "11035",
        "19"
      ]
    },
    {
      "hadith_no": "3793",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني محمد بن الحسين بن إبراهيم، قال حدثني حسين بن محمد، حدثنا جرير، عن محمد، عن أنس بن مالك  رضى الله عنه  أتي عبيد الله بن زياد برأس الحسين  عليه السلام  فجعل في طست، فجعل ينكت، وقال في حسنه شيئا‏.‏ فقال أنس كان أشبههم برسول الله صلى الله عليه وسلم، وكان مخضوبا بالوسمة‏.‏",
      "text_en": " Narrated Muhammad:                     Anas bin Malik said, \"The head of Al-Husain was brought to 'Ubaidullah bin Ziyad and was put in a tray, and then Ibn Ziyad started playing with a stick at the nose and mouth of Al-Husain's head and saying something about his handsome features.\" Anas then said (to him), \"Al-Husain resembled the Prophet more than the others did.\" Anas added, \"His (i.e. Al-Husain's) hair was dyed with Wasma (i.e. a kind of plant used as a dye).",
      "chain": [
        "30267",
        "20384",
        "20028",
        "20278",
        "19"
      ]
    },
    {
      "hadith_no": "4604",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق بن إبراهيم بن عبد الرحمن أبو يعقوب، حدثنا حسين بن محمد، حدثنا شيبان، عن قتادة، حدثنا أنس، أن أبا طلحة، قال غشينا النعاس ونحن في مصافنا يوم أحد  قال  فجعل سيفي يسقط من يدي وآخذه، ويسقط وآخذه‏.‏",
      "text_en": " Narrated Abu Talha:                     Slumber overtook us during the battle of Uhud while we were in the front files. My sword would fall from my hand and I would pick it up, and again it would fall down and I would pick it up again.",
      "chain": [
        "30123",
        "20384",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "1575",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني زهير بن حرب، حدثنا حسين بن محمد، حدثنا شيبان، عن يحيى، عن أبي سلمة، أن أبا هريرة، أخبره أن رسول الله صلى الله عليه وسلم بينما هو يصلي العشاء إذ قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ثم قال قبل أن يسجد ‏\"‏ اللهم نج عياش بن أبي ربيعة ‏\"‏ ‏.‏ ثم ذكر بمثل حديث الأوزاعي إلى قوله ‏\"‏ كسني يوسف ‏\"‏ ‏.‏ ولم يذكر ما بعده ‏.‏",
      "text_en": " Abu Salama narrated that Abu Huraira told him that when the Messenger of Allah (may peace be upon him) pronounced:                     \" Allah listened to him who praised Him.\" and before prostration, he would recite this in the 'Isya' prayer: O Allah! rescue 'Ayyash b. Abu Rabi'a, and the rest of the hadith is the same as narrated by Auza'i to the words:\" Like the famine (at the time) if Joseph.\" but he made no mention of that which follows afterwards.",
      "chain": [
        "30022",
        "20384",
        "20240",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1759",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني زهير بن حرب، حدثنا حسين بن محمد، حدثنا شيبان، عن يحيى، قال سمعت أبا سلمة، ح وحدثني يحيى بن بشر الحريري، حدثنا معاوية، - يعني ابن سلام - عن يحيى بن أبي كثير، قال أخبرني أبو سلمة، أنه سأل عائشة عن صلاة، رسول الله صلى الله عليه وسلم ‏.‏ بمثله غير أن في حديثهما تسع ركعات قائما يوتر منهن ‏.‏",
      "text_en": " Abu Salama is reported to have said. I came to 'A'isha. I said:                      O mother, inform me about the prayer of the Messenger of Allah (may peace be upon him). She said: His (night prayer) in Ramadan and (during other months) was thirteen rak'ahs at night including two rak'ahs of fajr.",
      "chain": [
        "30022",
        "20384",
        "20240",
        "11449",
        "10567",
        "30483",
        "20401",
        "11449",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "2571",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثناه يحيى بن بشر الحريري، حدثنا معاوية، - يعني ابن سلام ح وحدثنا ابن المثنى، حدثنا أبو عامر، حدثنا هشام، ح وحدثنا ابن المثنى، وابن أبي عمر، قالا حدثنا عبد الوهاب بن عبد المجيد، حدثنا أيوب، ح وحدثني زهير بن حرب، حدثنا حسين بن، محمد حدثنا شيبان، كلهم عن يحيى بن أبي كثير، بهذا الإسناد نحوه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Yahya b. Abi Kathir with the same chain of transmitters.",
      "chain": [
        "30483",
        "20401",
        "20443",
        "20295",
        "30421",
        "20259",
        "11015",
        "30022",
        "20384"
      ]
    },
    {
      "hadith_no": "3539",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني زهير بن حرب، حدثنا إسماعيل بن إبراهيم، حدثنا الحجاج بن أبي، عثمان ح وحدثني إبراهيم بن موسى، أخبرنا عيسى، - يعني ابن يونس - عن الأوزاعي، ح وحدثني زهير بن حرب، حدثنا حسين بن محمد، حدثنا شيبان، ح وحدثني عمرو الناقد، ومحمد بن رافع قالا حدثنا عبد الرزاق، عن معمر، ح وحدثنا عبد الله بن عبد الرحمن، الدارمي أخبرنا يحيى بن حسان، حدثنا معاوية، كلهم عن يحيى بن أبي كثير، ‏.‏ بمثل معنى حديث هشام وإسناده ‏.‏ واتفق لفظ حديث هشام وشيبان ومعاوية بن سلام في هذا الحديث‏.‏",
      "text_en": " This hadith has been narrated through another chain of transmitters.",
      "chain": [
        "30022",
        "20208",
        "30309",
        "20347",
        "20024",
        "30022",
        "20384",
        "20240",
        "30263",
        "30375",
        "20121",
        "20115"
      ]
    },
    {
      "hadith_no": "3773",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثني محمد بن رافع، حدثنا حسين بن محمد، حدثنا شيبان، عن يحيى، - وهو ابن أبي كثير - أخبرني أبو سلمة، أن فاطمة بنت قيس، أخت الضحاك بن قيس أخبرته أن أبا حفص بن المغيرة المخزومي طلقها ثلاثا ثم انطلق إلى اليمن فقال لها أهله ليس لك علينا نفقة ‏.‏ فانطلق خالد بن الوليد في نفر فأتوا رسول الله صلى الله عليه وسلم في بيت ميمونة فقالوا إن أبا حفص طلق امرأته ثلاثا فهل لها من نفقة فقال رسول الله صلى الله عليه وسلم ‏\"‏ ليست لها نفقة وعليها العدة ‏\"‏ ‏.‏ وأرسل إليها ‏\"‏ أن لا تسبقيني بنفسك ‏\"‏ ‏.‏ وأمرها أن تنتقل إلى أم شريك ثم أرسل إليها ‏\"‏ أن أم شريك يأتيها المهاجرون الأولون فانطلقي إلى ابن أم مكتوم الأعمى فإنك إذا وضعت خمارك لم يرك ‏\"‏ ‏.‏ فانطلقت إليه فلما مضت عدتها أنكحها رسول الله صلى الله عليه وسلم أسامة بن زيد بن حارثة.",
      "text_en": " Abu Salama reported that Fatima bint Qais, the sister of al-Dahhak b. Qais informed him that Abu Hafs b. Mughira al-Makhzumi divorced her three times and then he proceeded on to the Yemen. The members of his family said to her:                      There is no maintenance allowance due to you from us. Khalid b. Walid along with a group of persons visited Allah's Messenger (may peace be upon him) in the house of Maimuna and they said: Abu Hafs has divorced his wife with three pronouncements; is there any maintenance allowance due to her? Thereupon Allah's Messenger (may peace be upon him) said: No maintenance allowance is due to her, but she is required to spend the 'Idda; and he sent her the message that she should not be hasty in making a decision about herself and commanded her to move to the house of Umm Sharik, and then sent her the message that as the first immigrants (frequently) visit the house of Umm Sharik, she should better go to the house of Ibn Umm Maktum, the blind, (and further said: In case you put off your head-dress, he (Ibn Umm Makhtum) will not see you. So she went to his house, and when the 'Idda was over, Allah's Messenger (may peace be upon him) married her to Usama b. Zaid b. Haritha.",
      "chain": [
        "30375",
        "20384",
        "20240",
        "11449",
        "10567",
        "224"
      ]
    },
    {
      "hadith_no": "7558",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثني محمد بن رافع، حدثنا حسين بن محمد، حدثنا شيبان، عن يحيى، عن أبي، سلمة قال سمعت أبا هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا أخبركم عن الدجال حديثا ما حدثه نبي قومه إنه أعور وإنه يجيء معه مثل الجنة والنار فالتي يقول إنها الجنة هي النار وإني أنذرتكم به كما أنذر به نوح قومه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      May I not inform you about the Dajjal what no Apostle of Allah narrated to his people? He would be blind and he would bring along with him an Image of Paradise and Hell-Fire and what he would call as Paradise that would be Hell-Fire and I warn you as Noah warned his people.",
      "chain": [
        "30375",
        "20384",
        "20240",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2096",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا حسين بن محمد، حدثنا جرير بن حازم، عن أيوب، عن عكرمة، عن ابن عباس، أن جارية، بكرا أتت النبي صلى الله عليه وسلم فذكرت أن أباها زوجها وهي كارهة فخيرها النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     A virgin came to the Prophet (ﷺ) and mentioned that her father had married her against her will, so the Prophet (ﷺ) allowed her to exercise her choice.",
      "chain": [
        "30203",
        "20384",
        "11272",
        "11015",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2545",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا يحيى بن معين، حدثنا حسين بن محمد، عن شيبان، عن عيسى بن علي، عن أبيه، عن جده ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ يمن الخيل في شقرها ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     The Prophet (ﷺ) said: The most favoured horses are the sorrel.",
      "chain": [
        "30020",
        "20384",
        "20240",
        "17"
      ]
    },
    {
      "hadith_no": "4860",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا محمد بن يحيى بن فارس، حدثنا الفريابي، عن إسرائيل، عن الوليد، - قال أبو داود ونسبه لنا زهير بن حرب - عن حسين بن محمد، عن إسرائيل، في هذا الحديث - قال الوليد بن أبي هشام - عن زيد بن زائد، عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يبلغني أحد من أصحابي عن أحد شيئا فإني أحب أن أخرج إليكم وأنا سليم الصدر ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Prophet (ﷺ) said: None of my Companions must tell me anything about anyone, for I like to come out to you with no ill-feelings.",
      "chain": [
        "30023",
        "20034",
        "20311",
        "20733",
        "30022",
        "20384",
        "10622",
        "18322",
        "16"
      ]
    },
    {
      "hadith_no": "1232",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا حسين بن محمد، حدثنا شيبان، عن منصور، عن إبراهيم، عن الأسود، عن أبي السنابل بن بعكك، قال وضعت سبيعة بعد وفاة زوجها بثلاثة وعشرين أو خمسة وعشرين يوما فلما تعلت تشوفت للنكاح فأنكر عليها ذلك فذكر ذلك للنبي صلى الله عليه وسلم فقال ‏\"‏ إن تفعل فقد حل أجلها ‏\"‏ ‏.‏",
      "text_en": " Al-Aswad narrated from Abu As-Sanabil bin Ba'kak who said:                     \"Subai'ah delivered twenty-three or twenty-five days after her husband had died. So when she was ready (finished post-natal bleeding) she adorned herself for marriage, but she was rebuked for doing that, so it was mentioned to the Prophet and he said: \"If she has done that then her time has come.'\"",
      "chain": [
        "30242",
        "20384",
        "20240",
        "11067",
        "11051",
        "11054",
        "863"
      ]
    },
    {
      "hadith_no": "1241",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Business - كتاب البيوع عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "14",
      "text_ar": "حدثنا أحمد بن منيع، أخبرنا حسين بن محمد، أخبرنا شيبان، عن يحيى بن أبي كثير، عن نافع، قال انطلقت أنا وابن، عمر إلى أبي سعيد فحدثنا أن رسول الله صلى الله عليه وسلم قال سمعته أذناى هاتان يقول ‏\"‏ لا تبيعوا الذهب بالذهب إلا مثلا بمثل والفضة بالفضة إلا مثلا بمثل لا يشف بعضه على بعض ولا تبيعوا منه غائبا بناجز ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن أبي بكر وعمر وعثمان وأبي هريرة وهشام بن عامر والبراء وزيد بن أرقم وفضالة بن عبيد وأبي بكرة وابن عمر وأبي الدرداء وبلال ‏.‏ قال وحديث أبي سعيد عن النبي صلى الله عليه وسلم في الربا حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم إلا ما روي عن ابن عباس أنه كان لا يرى بأسا أن يباع الذهب بالذهب متفاضلا والفضة بالفضة متفاضلا إذا كان يدا بيد ‏.‏ وقال إنما الربا في النسيئة ‏.‏ وكذلك روي عن بعض أصحابه شيء من هذا وقد روي عن ابن عباس أنه رجع عن قوله حين حدثه أبو سعيد الخدري عن النبي صلى الله عليه وسلم ‏.‏ والقول الأول أصح ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم وهو قول سفيان الثوري وابن المبارك والشافعي وأحمد وإسحاق ‏.‏ وروي عن ابن المبارك أنه قال ليس في الصرف اختلاف ‏.‏",
      "text_en": " Narrated Nafi':                     \"Ibn 'Umar and I went to Abu Sa'eed and he narrated to us: 'the Messenger of Allah (ﷺ) said - and I heard him with these [two] ears: \"Do not sell gold for gold except kind for kind, nor sliver for silver except kind for kind, do not exchange more of one than the other, and do not sell what is not present from them for what is present.\"[Abu 'Eisa said:] There are narrations on this topic from Abu Bakr, 'Umar, 'Uthman, Abu Hurairah, Hisham bin 'Amir, Al-Bara', Zaid bin Arqam, Fadalah bin 'Ubaid, Abu Bakrah, Ibn 'Umar, Abu Ad-Darda', and Bilal.[He said:] The Hadith of Abu Sa'eed, from the Prophet (ﷺ) [about Riba] is a Hasan Sahih Hadith.This is acted upon according to the people of knowledge among the Companions of the Prophet (ﷺ) and others, except for what has been related from Ibn 'Abbas; he did not see any harm in exchanging gold for gold or silver for silver, more for less, when it is done hand in hand, and he said: \"Riba' is only in credit.\" Similar it has been related from some of his companions. It has been related that Ibn 'Abbas changed his opinion when Abu Sa'eed narrated it to him from the Prophet (ﷺ). The first view is more correct.And this is acted upon according to the people of knowledge [among the Companions of the Prophet (ﷺ) and others]. It is the view of Sufyan Ath-Thawri, Ibn Al-Mubarak, Ash-Shafi'i, Ahmad, and Ishaq. It has been reported that Ibn Al-Mubarak said: \"There is no difference over exchange.\"",
      "chain": [
        "30242",
        "20384",
        "20240",
        "11449",
        "11014"
      ]
    },
    {
      "hadith_no": "2217",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا حسين بن محمد البغدادي، حدثنا شيبان، عن يحيى بن أبي كثير، عن أبي قلابة، عن سالم بن عبد الله بن عمر، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ستخرج نار من حضرموت أو من نحو حضرموت قبل يوم القيامة تحشر الناس ‏\"‏ ‏.‏ قالوا يا رسول الله فما تأمرنا قال ‏\"‏ عليكم بالشام ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن حذيفة بن أسيد وأنس وأبي هريرة وأبي ذر ‏.‏ وهذا حديث حسن غريب صحيح من حديث ابن عمر ‏.‏",
      "text_en": " Salim bin 'Abdullas [bin 'Umar] narrated from his father, that the Messenger of Allah(s.a.w) said:                     \"A fire is coming from Hadramawt- before the Day of Judgement- to gather the people.\" They said: \"O Messenger of Allah! What do you order us?\" He said: \"Stick to Ash-Sham.\"",
      "chain": [
        "30242",
        "20384",
        "20240",
        "11449",
        "11047",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "2227",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا حسين بن محمد البصري، حدثنا خالد بن الحارث، حدثنا شعبة، عن حبيب بن الزبير، قال سمعت عبد الله بن أبي الهذيل، يقول كان ناس من ربيعة عند عمرو بن العاصي فقال رجل من بكر بن وائل لتنتهين قريش أو ليجعلن الله هذا الأمر في جمهور من العرب غيرهم ‏.‏ فقال عمرو بن العاصي كذبت سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ قريش ولاة الناس في الخير والشر إلى يوم القيامة ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن ابن مسعود وابن عمر وجابر ‏.‏ وهذا حديث حسن غريب صحيح ‏.‏",
      "text_en": " 'Abdullah bin Abi Al-Hudhail said:                     \" There were some people from(the tribe of) Rabiah with 'Amr bin Al-'As, so a man from(the tribe of) Bakr bin Wa'il said: \"Either the Quraish will stop, or Allah will place this matter among the masses of the Arabs other than them.' So 'Amr bin Al-'As said: 'You have lied, I heard the Messenger of Allah(s.a.w) saying: \"The Quraish are the leaders of the people, in the good and the bad, until the Day of Judgement.\"",
      "chain": [
        "20384",
        "20226",
        "20020",
        "14067",
        "10787"
      ]
    },
    {
      "hadith_no": "3534",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا حسين بن محمد، قال حدثنا خالد، قال حدثنا هشام، عن حفصة، عن أم عطية، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تحد امرأة على ميت فوق ثلاث إلا على زوج فإنها تحد عليه أربعة أشهر وعشرا ولا تلبس ثوبا مصبوغا ولا ثوب عصب ولا تكتحل ولا تمتشط ولا تمس طيبا إلا عند طهرها حين تطهر نبذا من قسط وأظفار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Umm 'Atiyyah said:                      \"The Messenger of Allah said: 'No woman should mourn for anyone who dies for more than three days, except for a husband, for whom she should mourn for four months and ten days. She should not wear garments that are dyed or patterned, or put on kohl or comb her hair, and she should not put on any perfume except when purifying herself after her period, when she may use a little of Qust or Azfar.'\"",
      "chain": [
        "20384",
        "20423",
        "20295",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "2890",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن محمد، حدثنا جرير بن حازم، عن محمد بن إسحاق، عن داود بن الحصين، عن عبد الرحمن بن أبي عقبة، عن أبي عقبة، - وكان مولى لأهل فارس - قال شهدت مع النبي صلى الله عليه وسلم يوم أحد فضربت رجلا من المشركين فقلت خذها مني وأنا الغلام الفارسي ‏.‏ فبلغت النبي صلى الله عليه وسلم فقال ‏\"‏ ألا قلت خذها مني وأنا الغلام الأنصاري ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu ‘Uqbah, who was the freed slave of somePersianpeople, said:                      “I was present with the Prophet (ﷺ) on the DayofUhud. I struck a man from among the idolaters and said: ‘Take that!And I am a Persian slave!’ News of that reached the Prophet (ﷺ)andhe said: ‘Why did you not say: “Take that! And I am an Ansarislave!?”",
      "chain": [
        "30201",
        "20384",
        "11272",
        "11107",
        "11160"
      ]
    }
  ],
  "total_hadiths": 19
}