{
  "id": "20399",
  "name": "'Abdullah bin al-'Ala' عبد الله بن العلاء بن زبر",
  "full_name": "'Abdullah bin al-'Ala' عبد الله بن العلاء بن زبر",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "164",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Damascus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  4  -  ثقة ]"
    ],
    "tags": [
      "al-Damashqi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [
    {
      "id": "20650",
      "name": "Zayd bin al-Habab al-'Akli زيد بن الحباب أبو الحسين العكلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "246",
      "name": "'Umar bin Abi Salamah ( عمر بن أبي سلمة بن عبد الأسد ( رضي الله عنه",
      "grade": "Comp.(RA) [1st Generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20732",
      "name": "Muhammad bin Shu'aib bin Shabur محمد بن شعيب بن شابور",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20640",
      "name": "Mrwan bin Muhammad bin Hsan مروان بن محمد بن حسان الأسدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20426",
      "name": "Shababa bin Sawar شبابة بن سوار الفزاري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30284",
      "name": "'Abdul A'ala bin Mushir al-Ghasani عبد الأعلى بن مسهر أبو مسهر الغساني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20442",
      "name": "'Abdul Quddus bin al-Hajjaj al-Khulani عبد القدوس بن الحجاج الخولاني",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "3176",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا الحميدي، حدثنا الوليد بن مسلم، حدثنا عبد الله بن العلاء بن زبر، قال سمعت بسر بن عبيد الله، أنه سمع أبا إدريس، قال سمعت عوف بن مالك، قال أتيت النبي صلى الله عليه وسلم في غزوة تبوك، وهو في قبة من أدم فقال ‏\"‏ اعدد ستا بين يدى الساعة، موتي، ثم فتح بيت المقدس، ثم موتان يأخذ فيكم كقعاص الغنم، ثم استفاضة المال حتى يعطى الرجل مائة دينار فيظل ساخطا، ثم فتنة لا يبقى بيت من العرب إلا دخلته، ثم هدنة تكون بينكم وبين بني الأصفر فيغدرون، فيأتونكم تحت ثمانين غاية، تحت كل غاية اثنا عشر ألفا ‏\"‏‏.‏",
      "text_en": " Narrated `Auf bin Mali:                     I went to the Prophet during the Ghazwa of Tabuk while he was sitting in a leather tent. He said, \"Count six signs that indicate the approach of the Hour: my death, the conquest of Jerusalem, a plague that will afflict you (and kill you in great numbers) as the plague that afflicts sheep, the increase of wealth to such an extent that even if one is given one hundred Dinars, he will not be satisfied; then an affliction which no Arab house will escape, and then a truce between you and Bani Al-Asfar (i.e. the Byzantines) who will betray you and attack you under eighty flags. Under each flag will be twelve thousand soldiers.",
      "chain": [
        "30418",
        "20733",
        "20399",
        "11412",
        "11027",
        "10805"
      ]
    },
    {
      "hadith_no": "4685",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله، حدثنا سليمان بن عبد الرحمن، وموسى بن هارون، قالا حدثنا الوليد بن مسلم، حدثنا عبد الله بن العلاء بن زبر، قال حدثني بسر بن عبيد الله، قال حدثني أبو إدريس الخولاني، قال سمعت أبا الدرداء، يقول كانت بين أبي بكر وعمر محاورة، فأغضب أبو بكر عمر، فانصرف عنه عمر مغضبا، فاتبعه أبو بكر يسأله أن يستغفر له، فلم يفعل حتى أغلق بابه في وجهه، فأقبل أبو بكر إلى رسول الله صلى الله عليه وسلم فقال أبو الدرداء ونحن عنده فقال رسول الله صلى الله عليه وسلم ‏\"‏ أما صاحبكم هذا فقد غامر ‏\"‏‏.‏ قال وندم عمر على ما كان منه فأقبل حتى سلم وجلس إلى النبي صلى الله عليه وسلم وقص على رسول الله صلى الله عليه وسلم الخبر‏.‏ قال أبو الدرداء وغضب رسول الله صلى الله عليه وسلم وجعل أبو بكر يقول والله يا رسول الله لأنا كنت أظلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ هل أنتم تاركو لي صاحبي هل أنتم تاركو لي صاحبي إني قلت يا أيها الناس إني رسول الله إليكم جميعا فقلتم كذبت‏.‏ وقال أبو بكر صدقت ‏\"‏‏.‏",
      "text_en": " Narrated Abu Ad-Darda:                     There was a dispute between Abu Bakr and `Umar, and Abu Bakr made `Umar angry. So `Umar left angrily. Abu Bakr followed him, requesting him to ask forgiveness (of Allah) for him, but `Umar refused to do so and closed his door in Abu Bakr's face. So Abu Bakr went to Allah's Apostle while we were with him. Allah's Apostle said, \"This friend of yours must have quarrelled (with somebody).\" In the meantime `Umar repented and felt sorry for what he had done, so he came, greeted (those who were present) and sat with the Prophet and related the story to him. Allah's Apostle became angry and Abu Bakr started saying, \"O Allah's Apostle! By Allah, I was more at fault (than `Umar).\" Allah's Apostle said, \"Are you (people) leaving for me my companion? (Abu Bakr), Are you (people) leaving for me my companion? When I said, 'O people I am sent to you all as the Apostle of Allah,' you said, 'You tell a lie.' while Abu Bakr said, 'You have spoken the truth .\"",
      "chain": [
        "20025",
        "30587",
        "30218",
        "20733",
        "20399",
        "11412",
        "11027"
      ]
    },
    {
      "hadith_no": "124",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا مؤمل بن الفضل الحراني، حدثنا الوليد بن مسلم، حدثنا عبد الله بن العلاء، حدثنا أبو الأزهر المغيرة بن فروة، ويزيد بن أبي مالك، أن معاوية، توضأ للناس كما رأى رسول الله صلى الله عليه وسلم يتوضأ فلما بلغ رأسه غرف غرفة من ماء فتلقاها بشماله حتى وضعها على وسط رأسه حتى قطر الماء أو كاد يقطر ثم مسح من مقدمه إلى مؤخره ومن مؤخره إلى مقدمه ‏.‏",
      "text_en": " AbulAzhar al-Mughirah ibn Farwah and Yazid ibn AbuMalik reported:                      Mu'awiyah performed ablution before the people, as he saw the Messenger of Allah (ﷺ) performed ablution. When he reached the stage of wiping his head, he took a handful of water and poured it with his left hand over the middle of his head so much so that drops of water came down or almost came down.  Then he wiped (his head) from its front to its back and from its back to its front.",
      "chain": [
        "38659",
        "20733",
        "20399"
      ]
    },
    {
      "hadith_no": "825",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا علي بن سهل الرملي، حدثنا الوليد، عن ابن جابر، وسعيد بن عبد العزيز، وعبد الله بن العلاء، عن مكحول، عن عبادة، نحو حديث الربيع بن سليمان قالوا فكان مكحول يقرأ في المغرب والعشاء والصبح بفاتحة الكتاب في كل ركعة سرا ‏.‏ قال مكحول اقرأ بها فيما جهر به الإمام إذا قرأ بفاتحة الكتاب وسكت سرا فإن لم يسكت اقرأ بها قبله ومعه وبعده لا تتركها على حال ‏.‏",
      "text_en": " The above mentioned tradition has been transmitted through a different chain of narrators by 'Ubadah b. al-samit like the version of al-Rabi’b Sulaiman. This version adds:                      Makhul used to recite Surah al Fatihah al-kitab quietly in the prayer in which the imam recites the Qur’an loudly when he observes the period of silence. If he does not observe the period of silence, recite it before him(i.e before his recitation), or along with him or after him; do not give it up in any case.",
      "chain": [
        "38403",
        "20733",
        "20638",
        "20399",
        "11066"
      ]
    },
    {
      "hadith_no": "0",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا يزيد بن محمد الدمشقي، حدثنا هشام بن إسماعيل، حدثنا محمد بن شعيب، أخبرنا عبد الله بن العلاء بن زبر، عن سالم بن عبد الله، عن عبد الله بن عمر، أن النبي صلى الله عليه وسلم صلى صلاة فقرأ فيها فلبس عليه فلما انصرف قال لأبى ‏\"‏ أصليت معنا ‏\"‏ ‏.‏ قال نعم ‏.‏ قال ‏\"‏ فما منعك ‏\"‏ ‏.‏",
      "text_en": " Ibn ‘Umar said :                      The Prophet (ﷺ) prayed and recited the Qur’an in it. He wa then confused in it (in his recitation). When he finished (his prayer), he said to Ubayy(b. Ka’b): Did you pray along with us? He said: yes. He said: What prevented you(from correcting me)?",
      "chain": [
        "37539",
        "20732",
        "20399",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1213",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا إبراهيم بن موسى الرازي، أخبرنا عيسى، عن ابن جابر، بهذا المعنى ‏.‏ قال أبو داود ورواه عبد الله بن العلاء عن نافع، قال حتى إذا كان عند ذهاب الشفق نزل فجمع بينهما ‏.‏",
      "text_en": " This tradition has also been transmitted by Ibrahim b. Musa al-Razi, from 'Isa, on the authority of Ibn Jabir to the same effect.Abu Dawud said:                      'Abd Allah b. al-'Ala' narrated on the authority of Nafi' saying: When the twilight was about to disappear, he alighted and combined both (the prayers).",
      "chain": [
        "30309",
        "20347",
        "30002",
        "20399",
        "11014"
      ]
    },
    {
      "hadith_no": "1257",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا أبو المغيرة، حدثنا عبد الله بن العلاء، حدثني أبو زيادة، عبيد الله بن زياد الكندي عن بلال، أنه حدثه أنه، أتى رسول الله صلى الله عليه وسلم ليؤذنه بصلاة الغداة فشغلت عائشة - رضى الله عنها - بلالا بأمر سألته عنه حتى فضحه الصبح فأصبح جدا قال فقام بلال فآذنه بالصلاة وتابع أذانه فلم يخرج رسول الله صلى الله عليه وسلم فلما خرج صلى بالناس وأخبره أن عائشة شغلته بأمر سألته عنه حتى أصبح جدا وأنه أبطأ عليه بالخروج فقال ‏\"‏ إني كنت ركعت ركعتى الفجر ‏\"‏ ‏.‏ فقال يا رسول الله إنك أصبحت جدا ‏.‏ قال ‏\"‏ لو أصبحت أكثر مما أصبحت لركعتهما وأحسنتهما وأجملتهما ‏\"‏ ‏.‏",
      "text_en": " Narrated Bilal:                     Ziyadah al-Kindi reported on the authority of Bilal that he (Bilal) came to the Messenger of Allah (ﷺ) to inform him about the dawn prayer. Aisha kept Bilal engaged in a matter which she asked him till the day was bright and it became fairly light. Bilal then stood up and called him to prayer and called him repeatedly. The Messenger of Allah (ﷺ) did not yet come out. When he came out, he led the people in prayer and he (Bilal) informed him that Aisha had kept him engaged in a matter which she asked him till it became fairly light; hence he became late in reaching him (in time). He (Bilal) said: Messenger of Allah, the dawn became fairly bright. He said: If the dawn became brighter than it is now, I would pray them (the two rak'ahs of the sunnah prayer), offer them well and in a more beautiful manner.",
      "chain": [
        "30007",
        "20442",
        "20399",
        "24"
      ]
    },
    {
      "hadith_no": "2329",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا إبراهيم بن العلاء الزبيدي، من كتابه حدثنا الوليد بن مسلم، حدثنا عبد الله بن العلاء، عن أبي الأزهر المغيرة بن فروة، قال قام معاوية في الناس بدير مسحل الذي على باب حمص فقال يا أيها الناس إنا قد رأينا الهلال يوم كذا وكذا وأنا متقدم بالصيام فمن أحب أن يفعله فليفعله ‏.‏ قال فقام إليه مالك بن هبيرة السبئي فقال يا معاوية أشىء سمعته من رسول الله صلى الله عليه وسلم أم شىء من رأيك قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ صوموا الشهر وسره ‏\"‏ ‏.‏",
      "text_en": " Narrated Mu'awiyah:                     AbulAzhar al-Mughirah ibn Farwah said: Mu'awiyah stood among the people at Dayr Mustahill lying at the gate of Hims. He said: O people, we sighted the moon on such-and-such day. We shall fast in advance. Anyone who likes to do so may do it. Malik ibn Hubayrah as-Saba'i stood up and asked: Mu'awiyah, did you hear the Messenger of Allah (ﷺ) say something (about this matter), or is this something on the basis of your opinion? He replied: I heard the Messenger of Allah (ﷺ) as saying: Fast the month (in the beginning) and in the last.",
      "chain": [
        "20733",
        "20399"
      ]
    },
    {
      "hadith_no": "2628",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا عمرو بن عثمان الحمصي، ويزيد بن قبيس، - من أهل جبلة ساحل حمص وهذا لفظ يزيد - قالا حدثنا الوليد بن مسلم عن عبد الله بن العلاء أنه سمع مسلم بن مشكم أبا عبيد الله يقول حدثنا أبو ثعلبة الخشني قال كان الناس إذا نزلوا منزلا - قال عمرو كان الناس إذا نزل رسول الله صلى الله عليه وسلم منزلا - تفرقوا في الشعاب والأودية فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن تفرقكم في هذه الشعاب والأودية إنما ذلكم من الشيطان ‏\"‏ ‏.‏ فلم ينزل بعد ذلك منزلا إلا انضم بعضهم إلى بعض حتى يقال لو بسط عليهم ثوب لعمهم ‏.‏",
      "text_en": " Narrated AbuTha'labah al-Khushani:                     When the people encamped, (the narrator Amr ibn Uthman al-Himsi) said: When the Messenger of Allah (ﷺ) encamped, the people scattered in the glens and wadis. The Messenger of Allah (ﷺ) said: Your scattering in these glens and wadis is only of the devil. They afterwards kept close together when they encamped to such an extent that it used to be said that if a cloth were spread over them, it would cover them all.",
      "chain": [
        "38429",
        "10725",
        "20399",
        "17540",
        "11081"
      ]
    },
    {
      "hadith_no": "2755",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا الوليد بن عتبة، حدثنا الوليد، حدثنا عبد الله بن العلاء، أنه سمع أبا سلام الأسود، قال سمعت عمرو بن عبسة، قال صلى بنا رسول الله صلى الله عليه وسلم إلى بعير من المغنم فلما سلم أخذ وبرة من جنب البعير ثم قال ‏\"‏ ولا يحل لي من غنائمكم مثل هذا إلا الخمس والخمس مردود فيكم ‏\"‏ ‏.‏",
      "text_en": " Narrated Amr ibn Abasah:                     The Messenger of Allah (ﷺ) led us in prayer facing a camel which had been taken in booty, and when he had given the salutation, he took a hair from the camel's side and said: I have no right as much as this of your booty, but only to the fifth. and the fifth is returned to you.",
      "chain": [
        "20733",
        "20399",
        "10968",
        "4002"
      ]
    },
    {
      "hadith_no": "3839",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا نصر بن عاصم، حدثنا محمد بن شعيب، أخبرنا عبد الله بن العلاء بن زبر، عن أبي عبيد الله، مسلم بن مشكم عن أبي ثعلبة الخشني، أنه سأل رسول الله صلى الله عليه وسلم قال إنا نجاور أهل الكتاب وهم يطبخون في قدورهم الخنزير ويشربون في آنيتهم الخمر ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن وجدتم غيرها فكلوا فيها واشربوا وإن لم تجدوا غيرها فارحضوها بالماء وكلوا واشربوا ‏\"‏ ‏.‏",
      "text_en": " Abu  Tha’labah al-khushani said that he asked the Messenger of Allah(ﷺ):                      We live in the neighbourhood of the People of the Book and they cook in their pots(the flesh of) swine and drink wine in their vessels. The Messenger of Allah(ﷺ) said: If you find any other pots, then eat in them and drink. But if you do not find any others, then wash them with water and eat and drink (In them).",
      "chain": [
        "10724",
        "20732",
        "20399",
        "4056"
      ]
    },
    {
      "hadith_no": "4639",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا موسى بن عامر المري، حدثنا الوليد، حدثنا عبد الله بن العلاء، أنه سمع أبا الأعيس عبد الرحمن بن سلمان، يقول سيأتي ملك من ملوك العجم يظهر على المدائن كلها إلا دمشق ‏.‏",
      "text_en": " Abu al-A’yas ‘Abd al-Rahman b. Salam said:                      A king of the foreigners will come and prevail over all the cities except Damascus.",
      "chain": [
        "37537",
        "20733",
        "20399"
      ]
    },
    {
      "hadith_no": "5000",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا مؤمل بن الفضل، حدثنا الوليد بن مسلم، عن عبد الله بن العلاء، عن بسر بن عبيد الله، عن أبي إدريس الخولاني، عن عوف بن مالك الأشجعي، قال أتيت رسول الله صلى الله عليه وسلم في غزوة تبوك وهو في قبة من أدم فسلمت فرد وقال ‏\"‏ ادخل ‏\"‏ ‏.‏ فقلت أكلي يا رسول الله قال ‏\"‏ كلك ‏\"‏ ‏.‏ فدخلت ‏.‏",
      "text_en": " ‘Awf b. Malik al-Ashja’i said :                      I came to the Messenger of Allah (May peace be upon him) at the expedition to Tabuk when he was in a small skin tent. I gave him a salutation and he returned it, saying: come in. I asked : the whole of me Messenger of Allah? He replied : The whole of you. So I entered.",
      "chain": [
        "38659",
        "20733",
        "20399",
        "11412",
        "11027",
        "3051"
      ]
    },
    {
      "hadith_no": "3683",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا شبابة، عن عبد الله بن العلاء، عن الضحاك بن عبد الرحمن بن عرزم الأشعري، قال سمعت أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إن أول ما يسأل عنه يوم القيامة يعني العبد من النعيم أن يقال له ألم نصح لك جسمك ونرويك من الماء البارد ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ والضحاك هو ابن عبد الرحمن بن عرزب ويقال ابن عرزم وابن عرزم أصح ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Messenger of Allah said: “Indeed the first of what will be asked about on the Day of Judgment – meaning the slave (of Allah) being questioned about the favors – is that it will be said to him: ‘Did We not make your body, health, and give you of cool water to drink?’”",
      "chain": [
        "30553",
        "20426",
        "20399",
        "13"
      ]
    },
    {
      "hadith_no": "Grade",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا محمود بن خالد، عن الوليد، قال حدثنا عبد الله بن العلاء، أنه سمع القاسم بن محمد بن أبي بكر، أنهم ذكروا غسل يوم الجمعة عند عائشة فقالت إنما كان الناس يسكنون العالية فيحضرون الجمعة وبهم وسخ فإذا أصابهم الروح سطعت أرواحهم فيتأذى بها الناس فذكر ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ أولا يغتسلون ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah bin Al-'Ala narrated that:                     He heard Al-Qasim bin Muhammad bin Abi Bakr (say) that they mentioned Ghusl on Fridays in the presence of 'Aishah and she said: \"Some people used to live in Al-'Aliyah and they would come to Jumu'ah with dirt on them (because of their work). When a breeze came it would carry their smell to the people which annoyed them. Mention of that was made to the Messenger of Allah (ﷺ) and he said: \"Why don't you perform ghusl?\"",
      "chain": [
        "37534",
        "20733",
        "20399",
        "10535"
      ]
    },
    {
      "hadith_no": "4172",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا عيسى بن مساور، قال حدثنا الوليد، عن عبد الله بن العلاء بن زبر، عن بسر بن عبيد الله، عن أبي إدريس الخولاني، عن عبد الله بن واقد السعدي، قال وفدت إلى رسول الله صلى الله عليه وسلم في وفد كلنا يطلب حاجة وكنت آخرهم دخولا على رسول الله صلى الله عليه وسلم فقلت يا رسول الله إني تركت من خلفي وهم يزعمون أن الهجرة قد انقطعت ‏.‏ قال ‏\"‏ لا تنقطع الهجرة ما قوتل الكفار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin Waqdan As-Sa'di said:                     \"We came in a delegation to the messenger of Allah, each of us with a question to ask him. I was the last of them to come in to the Messenger of Allah, and I said: 'O Messenger of Allah, I have left people behind me, and they are saying that emigration (Hijrah) has ceased.' He said: 'Emigration will not cease so long as the disbelievers are being fought.\"'",
      "chain": [
        "36610",
        "20733",
        "20399",
        "11412",
        "11027"
      ]
    },
    {
      "hadith_no": "4173",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا محمود بن خالد، قال حدثنا مروان بن محمد، قال حدثنا عبد الله بن العلاء بن زبر، قال حدثني بسر بن عبيد الله، عن أبي إدريس الخولاني، عن حسان بن عبد الله الضمري، عن عبد الله بن السعدي، قال وفدنا على رسول الله صلى الله عليه وسلم فدخل أصحابي فقضى حاجتهم وكنت آخرهم دخولا فقال ‏\"‏ حاجتك ‏\"‏ ‏.‏ فقلت يا رسول الله متى تنقطع الهجرة قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تنقطع الهجرة ما قوتل الكفار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin As-Sa'di said:                     \"We came in a delegation to the Messenger of Allah and my companions entered and asked their questions. I was the last of them to enter, and he said: 'What is you question?' I said: 'O Messenger of Allah, when will emigration end?' The Messenger of Allah said: 'Emigration will not cease so long as the disbelievers are being fought.\"'",
      "chain": [
        "37534",
        "20640",
        "20399",
        "11412",
        "11027",
        "2605"
      ]
    },
    {
      "hadith_no": "44",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا عبد الله بن أحمد بن بشير بن ذكوان الدمشقي، حدثنا الوليد بن مسلم، حدثنا عبد الله بن العلاء، - يعني ابن زبر - حدثني يحيى بن أبي المطاع، قال سمعت العرباض بن سارية، يقول قام فينا رسول الله  صلى الله عليه وسلم  ذات يوم فوعظنا موعظة بليغة وجلت منها القلوب وذرفت منها العيون فقيل يا رسول الله وعظتنا موعظة مودع فاعهد إلينا بعهد فقال ‏\"‏ عليكم بتقوى الله والسمع والطاعة وإن عبدا حبشيا وسترون من بعدي اختلافا شديدا فعليكم بسنتي وسنة الخلفاء الراشدين المهديين عضوا عليها بالنواجذ وإياكم والأمور المحدثات فإن كل بدعة ضلالة ‏\"‏ ‏.‏",
      "text_en": " Yahya bin Abu Muta' said:                     I heard 'Irbad bin Sariyah say: 'One day, the Messenger of Allah (ﷺ) stood up among us and delivered a deeply moving speech to us that melted our hearts and caused our eyes to overflow with tears. It was said to him: 'O Messenger of Allah, you have delivered a speech of farewell, so enjoin something upon us.' He said: 'I urge you to fear Allah, and to listen and obey, even if (your leader) is an Abyssinian slave. After I am gone, you will see great conflict. I urge you to adhere to my Sunnah and the path of the Rightly-Guided Caliphs, and cling stubbornly to it. And beware of newly-invented matters, for every innovation is a going astray.'\"",
      "chain": [
        "20733",
        "20399",
        "19159",
        "5172"
      ]
    },
    {
      "hadith_no": "3856",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا عمرو بن أبي سلمة، عن عبد الله بن العلاء، عن القاسم، قال اسم الله الأعظم الذي إذا دعي به أجاب في سور ثلاث البقرة وآل عمران وطه ‏.‏ حدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا عمرو بن أبي سلمة، قال ذكرت ذلك لعيسى بن موسى فحدثني أنه، سمع غيلان بن أنس، يحدث عن القاسم، عن أبي أمامة، عن النبي  صلى الله عليه وسلم  نحوه ‏.‏",
      "text_en": " It was narrated that Al-Qasim said:                     The Greatest Name of Allah, if He is called by which He will respond, is in three Surah: Al-Baqarah, Al 'Imran and Ta-Ha. (Hasan)Another chain for something similar from Al-Qasim, from Abu Umamah, from the Prophet (saas).",
      "chain": [
        "30285",
        "30286",
        "20399",
        "10535",
        "30285",
        "30286"
      ]
    },
    {
      "hadith_no": "4178",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، حدثنا الوليد بن مسلم، حدثنا عبد الله بن العلاء، حدثني بسر بن عبيد الله، حدثني أبو إدريس الخولاني، حدثني عوف بن مالك الأشجعي، قال أتيت رسول الله  صلى الله عليه وسلم  وهو في غزوة تبوك وهو في خباء من أدم فجلست بفناء الخباء فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ ادخل يا عوف ‏\"‏ ‏.‏ فقلت بكلي يا رسول الله قال ‏\"‏ بكلك ‏\"‏ ‏.‏ ثم قال ‏\"‏ يا عوف احفظ خلالا ستا بين يدى الساعة إحداهن موتي ‏\"‏ ‏.‏ قال فوجمت عندها وجمة شديدة ‏.‏ فقال ‏\"‏ قل إحدى ثم فتح بيت المقدس ثم داء يظهر فيكم يستشهد الله به ذراريكم وأنفسكم ويزكي به أموالكم ثم تكون الأموال فيكم حتى يعطى الرجل مائة دينار فيظل ساخطا وفتنة تكون بينكم لا يبقى بيت مسلم إلا دخلته ثم تكون بينكم وبين بني الأصفر هدنة فيغدرون بكم فيسيرون إليكم في ثمانين غاية تحت كل غاية اثنا عشر ألفا ‏\"‏ ‏.‏",
      "text_en": " ‘Awf bin Malik Al-Ashja’i said:                      “I came to the Messenger ofAllah(ﷺ) during the campaign of Tabuk, when he was in a tent madeofleather, so I sat in front of the tent. The Messenger of Allah(ﷺ)said: ‘Enter, O ‘Awf.’ I said, ‘All of me, O Messengerof Allah?’ Hesaid: ‘All of you.’ Then he said: ‘O ‘Awf,remember six things (thatwill occur) before the Hour comes, one ofwhich is my death.’ I wasvery shocked and saddened at that. Hesaid: ‘Count that as the first.Then (will come) the conquest ofBaitul-Maqdis (Jerusalem); then adisease which will appear among youand cause you and your offspringto die as martyrs and will purifyyour deeds; then there will be(much) wealth among you, so that if aman were to be given one hundredDinar he would still bedissatisfied; and there will be tribulationamong you that will notleave any Muslim house untouched;* then therewill be a treatybetween you and the Romans, then they will betray youand marchagainst you with eighty banners, under each of which will betwelvethousand (troops).’”",
      "chain": [
        "30285",
        "20733",
        "20399",
        "11412",
        "11027",
        "3051"
      ]
    },
    {
      "hadith_no": "4234",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، حدثنا الوليد بن مسلم، حدثنا عبد الله بن العلاء، حدثني بسر بن عبيد الله، حدثني أبو إدريس الخولاني، حدثني عوف بن مالك الأشجعي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ تكون بينكم وبين بني الأصفر هدنة فيغدرون بكم فيسيرون إليكم في ثمانين غاية تحت كل غاية اثنا عشر ألفا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from ‘Awf bin Malik Al-Ashja’i that the MessengerofAllah (ﷺ) said:                      “There will be a treaty between you and BanuAsfar(The Romans), but they will betray you and will march againstyou witheighty banners, under each of which there will be twelvethousandtroops.”",
      "chain": [
        "30285",
        "20733",
        "20399",
        "11412",
        "11027",
        "3051"
      ]
    }
  ],
  "total_hadiths": 21
}