{
  "id": "20392",
  "name": "al-Walid bin Salah al-Nakhas/al-Nahas الوليد بن صالح النخاس",
  "full_name": "al-Walid bin Salah al-Nakhas/al-Nahas الوليد بن صالح النخاس",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  -  ثقة ]"
    ],
    "tags": [
      "Baghdad"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11272",
      "name": "Jarir bin Hazim bin Zayd جرير بن حازم بن زيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20317",
      "name": "Hafs bin Ghyath حفص بن غياث",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20445",
      "name": "'Ubaidullah bin 'Amr bin Abi Walid عبيد الله بن عمرو بن أبي الوليد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20509",
      "name": "'Abdur Rahman bin Abi al-Zanad عبد الرحمن بن أبي الزناد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "19857",
      "name": "Muhammad bin Sulaym محمد بن سليم أبو هلال الراسبي",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30514",
      "name": "Muhammad bin Hatim Al-Samayn محمد بن حاتم البغدادي - السمين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30335",
      "name": "al-Rabi' bin Nafi' Abu Tawba al-Halbi الربيع بن نافع أبو توبة الحلبي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30400",
      "name": "Y'aqub bin Ibrahim bin Kathir يعقوب بن إبراهيم بن كثير بن زيد الدورقي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30272",
      "name": "Muhammad bin 'Abdul Rahim bin Abi Zuhayr محمد بن عبد الرحيم بن أبي زهير البزاز",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38727",
      "name": "Yusuf bin Yazid bin Kamil al-Qarataysi يوسف بن يزيد بن كامل القراطيسي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-3721",
      "hadith_no": "3721",
      "source": "Sahih Bukhari",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني الوليد بن صالح، حدثنا عيسى بن يونس، حدثنا عمر بن سعيد بن أبي الحسين المكي، عن ابن أبي مليكة، عن ابن عباس  رضى الله عنهما  قال إني لواقف في قوم، فدعوا الله لعمر بن الخطاب وقد وضع على سريره، إذا رجل من خلفي قد وضع مرفقه على منكبي، يقول رحمك الله، إن كنت لأرجو أن يجعلك الله مع صاحبيك، لأني كثيرا مما كنت أسمع رسول الله صلى الله عليه وسلم يقول كنت وأبو بكر وعمر، وفعلت وأبو بكر وعمر، وانطلقت وأبو بكر وعمر‏.‏ فإن كنت لأرجو أن يجعلك الله معهما‏.‏ فالتفت فإذا هو علي بن أبي طالب‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     While I was standing amongst the people who were invoking Allah for `Umar bin Al-Khattab who was lying (dead) on his bed, a man behind me rested his elbows on my shoulder and said, \"(O `Umar!) May Allah bestow His Mercy on you. I always hoped that Allah will keep you with your two companions, for I often heard Allah's Apostle saying, \"I, Abu Bakr and `Umar were (somewhere). I, Abu Bakr and `Umar did (something). I, Abu Bakr and `Umar set out.' So I hoped that Allah will keep you with both of them.\" I turned back to see that the speaker was `Ali bin Abi Talib.",
      "usc_msa_ref": "26",
      "chain": [
        "20392",
        "20347",
        "10652",
        "11090",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-97",
      "hadith_no": "97",
      "source": "Sahih Muslim",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني الفضل بن سهل، حدثنا وليد بن صالح، قال قال عبيد الله بن عمرو قال زيد يعني ابن أبي أنيسة لا تأخذوا عن أخي، ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30264",
        "20392",
        "30024",
        "11340"
      ]
    },
    {
      "id": "sahih-muslim-7424",
      "hadith_no": "7424",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثني محمد بن حاتم بن ميمون، حدثنا الوليد بن صالح، حدثنا عبيد الله بن، عمرو حدثنا زيد بن أبي أنيسة، عن عبد الملك العامري، عن يوسف بن ماهك، أخبرني  عبد الله بن صفوان، عن أم المؤمنين، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ سيعوذ بهذا البيت - يعني الكعبة - قوم ليست لهم منعة ولا عدد ولا عدة يبعث إليهم جيش حتى إذا كانوا ببيداء من الأرض خسف بهم ‏\"‏ ‏.‏ قال يوسف وأهل الشأم يومئذ يسيرون إلى مكة فقال عبد الله بن صفوان أما والله ما هو بهذا الجيش ‏.‏   قال زيد وحدثني عبد الملك العامري، عن عبد الرحمن بن سابط، عن الحارث، بن أبي ربيعة عن أم المؤمنين، ‏.‏ بمثل حديث يوسف بن ماهك غير أنه لم يذكر فيه الجيش الذي ذكره عبد الله بن صفوان ‏.‏",
      "text_en": " Abdullah b. Safwan reported the Mother of the Faithful as saying that Allah's Messenger (may peace be upon him) said:                      They would soon seek protection in this House, viz. Ka'ba (the defenceless), people who would have nothing to protect themselves in the shape of weapons or the strength of the people. An army would be sent to fight (and kill) them and when they would enter a plain ground the army would be sunk in it. Yiisuf (one of the narrators) said: It was a people of Syria (hordes of Hajjaj) who had been on that day comin. towards Mecca for an attack (on 'Abdulllah b. Zubair) and Abdullah b. Safwan said: By God, it does not imply this army.",
      "usc_msa_ref": "",
      "chain": [
        "30514",
        "20392",
        "30024",
        "11340",
        "11264",
        "487",
        "53"
      ]
    }
  ],
  "total_hadiths": 3
}