{
  "id": "20393",
  "name": "Yonus bin Muhammad bin Muslim يونس بن محمد بن مسلم المؤدب",
  "full_name": "Yonus bin Muhammad bin Muslim يونس بن محمد بن مسلم المؤدب",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "207",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Baghdad"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-Baghdadi",
      "Hafiz"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20424",
      "name": "Da'ud bin Abi al-Frat داود بن أبي الفرات عمرو",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "13039",
      "name": "Sufyan bin 'Abdur Rahman سفيان بن عبد الرحمن",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "24207",
      "name": "Salah bin Bashir bin Wada' - al-Mari صالح بن بشير بن وادع - المري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20169",
      "name": "Falayh bin Suliaman فليح بن سليمان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20022",
      "name": "Hammad bin Zayd حماد بن زيد بن درهم الأزدي الأزرق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20550",
      "name": "Salam bin Abi Mut'ia سلام بن أبي مطيع",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20506",
      "name": "Abu Uvais al-Madni أبو أويس المدني الأصبحي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20256",
      "name": "'Abdul Wahid bin Ziyad عبد الواحد بن زياد العبدي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20378",
      "name": "al-Mufadl bin Fadala bin 'Ubaid المفضل بن فضالة بن عبيد بن ثمامة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20288",
      "name": "Ma'tmar bin Sulaiman-al-Taufayl معتمر بن سليمان - الطفيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30351",
      "name": "'Abdullah bin Muhammad al-Musandi عبد الله بن محمد المسندي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38834",
      "name": "Hajjaj bin Yusuf bin al-Sha'ir حجاج بن يوسف الشاعر",
      "grade": "3rd Century AH"
    },
    {
      "id": "30521",
      "name": "Mjahd bin Musa مجاهد بن موسى",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30326",
      "name": "al-Husain bin 'Isa bin Hamran الحسين بن عيسى بن حمران",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30553",
      "name": "'Abd bin Hameed bin Nasr عبد بن حميد بن نصر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38001",
      "name": "Ahmed bin al-Azhar bin Mny' أحمد بن الأزهر بن منيع",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "10534",
      "name": "'Abdullah bin Sa'd ibn Abi Waqqas عبد الله بن سعد بن أبي وقاص الزهرى",
      "grade": "Follower(Tabi')"
    },
    {
      "id": "30295",
      "name": "Ahmed bin Sa'id bin Ibrahim أحمد بن سعيد بن إبراهيم الرباطي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30272",
      "name": "Muhammad bin 'Abdul Rahim bin Abi Zuhayr محمد بن عبد الرحيم بن أبي زهير البزاز",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "31742",
      "name": "Abu Bakr bin Abi Khuthama أبو بكر بن أبي خيثمة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30273",
      "name": "Muhammad bin 'Ubaidullah محمد بن عبيد الله بن يزيد البغدادي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30585",
      "name": "'Abbas bin Muhammad bin Hatm عباس بن محمد بن حاتم",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "158",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا حسين بن عيسى، قال حدثنا يونس بن محمد، قال حدثنا فليح بن سليمان، عن عبد الله بن أبي بكر بن عمرو بن حزم، عن عباد بن تميم، عن عبد الله بن زيد، أن النبي صلى الله عليه وسلم توضأ مرتين مرتين‏.‏",
      "text_en": " Narrated `Abdullah bin Zaid:                     The Prophet performed ablution by washing the body parts twice.",
      "chain": [
        "30326",
        "20393",
        "20169",
        "11104",
        "639",
        "605"
      ]
    },
    {
      "hadith_no": "2615",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا يونس بن محمد، حدثنا شيبان، عن قتادة، حدثنا أنس  رضى الله عنه  قال أهدي للنبي صلى الله عليه وسلم جبة سندس، وكان ينهى عن الحرير، فعجب الناس منها فقال ‏\"‏ والذي نفس محمد بيده لمناديل سعد بن معاذ في الجنة أحسن من هذا ‏\"‏‏.‏ وقال سعيد عن قتادة، عن أنس، إن أكيدر دومة أهدى إلى النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Anas:                     A Jubba (i.e. cloak) made of thick silken cloth was presented to the Prophet. The Prophet used to forbid people to wear silk. So, the people were pleased to see it. The Prophet said, \"By Him in Whose Hands Muhammad's soul is, the handkerchiefs of Sa`d bin Mu`adh in Paradise are better than this.\" Anas added, \"The present was sent to the Prophet by Ukaidir (a Christian) from Dauma.\"",
      "chain": [
        "30351",
        "20393",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "3248",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا عبد الله بن محمد الجعفي، حدثنا يونس بن محمد، حدثنا شيبان، عن قتادة، حدثنا أنس  رضى الله عنه  قال أهدي للنبي صلى الله عليه وسلم جبة سندس، وكان ينهى عن الحرير، فعجب الناس منها، فقال ‏\"‏ والذي نفس محمد بيده، لمناديل سعد بن معاذ في الجنة أحسن من هذا ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A silken cloak was presented to the Prophet and he used to forbid the usage of silk (by men). When the people were fascinated by the cloak. he said, \"By Allah in Whose Hands the life of Muhammad is, the handkerchiefs of Sa`d bin Mu`adh in Paradise are better than this.\"",
      "chain": [
        "30351",
        "20393",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "4807",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا يونس بن محمد البغدادي، حدثنا شيبان، عن قتادة، حدثنا أنس بن مالك  رضى الله عنه ‏.‏ أن رجلا، قال يا نبي الله يحشر الكافر على وجهه يوم القيامة قال ‏\"‏ أليس الذي أمشاه على الرجلين في الدنيا قادرا على أن يمشيه على وجهه يوم القيامة ‏\"‏‏.‏ قال قتادة بلى وعزة ربنا‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A man said, \"O Allah's Prophet! Will Allah gather the non-believers on their faces on the Day of Resurrection?\" He said, \"Will not the One Who made him walk on his feet in this world, be able to make him walk on his face on the Day of Resurrection?\" (Qatada, a subnarrator, said: Yes, By the Power of Our Lord!)",
      "chain": [
        "30351",
        "20393",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "4916",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا يونس بن محمد، حدثنا شيبان، عن قتادة، عن أنس  رضى الله عنه  قال سأل أهل مكة أن يريهم آية فأراهم انشقاق القمر‏.‏",
      "text_en": " Narrated Anas:                     The people of Mecca asked the Prophet to show them a sign (miracle). So he showed them (the miracle) of the cleaving of the moon.",
      "chain": [
        "30351",
        "20393",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "5996",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "وقال ابن أبي شيبة حدثنا يونس بن محمد، حدثنا فليح، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ لعن الله الواصلة والمستوصلة، والواشمة والمستوشمة ‏\"‏‏.‏",
      "text_en": "",
      "chain": [
        "30201",
        "20393",
        "20169",
        "11163",
        "11020",
        "13"
      ]
    },
    {
      "hadith_no": "6602",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا يونس بن محمد البغدادي، حدثنا شيبان، عن قتادة، حدثنا أنس بن مالك  رضى الله عنه أن رجلا، قال يا نبي الله كيف يحشر الكافر على وجهه قال ‏\"‏ أليس الذي أمشاه على الرجلين في الدنيا قادرا على أن يمشيه على وجهه يوم القيامة ‏\"‏‏.‏ قال قتادة بلى وعزة ربنا‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A man said, \"O Allah's Prophet! Will a Kafir (disbeliever) be gathered (driven prone) on his face?\" The Prophet said, \"Is not He Who made him walk with his legs in this world, able to make him walk on his face on the Day of Resurrection?\" (Qatada, a sub-narrator said: Yes, (He can), by the Power of Our Lord!\")",
      "chain": [
        "30351",
        "20393",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "105",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا يونس بن محمد، حدثنا المعتمر، عن أبيه، عن يحيى بن يعمر، عن ابن عمر، عن عمر، عن النبي صلى الله عليه وسلم بنحو حديثهم ‏.‏",
      "text_en": "",
      "chain": [
        "38834",
        "20393",
        "20288",
        "11289",
        "11316",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "437",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا عبد بن حميد، أخبرنا يونس بن محمد، حدثنا شيبان بن عبد الرحمن، عن قتادة، عن أبي العالية، حدثنا ابن عم، نبيكم صلى الله عليه وسلم ابن عباس قال قال رسول الله صلى الله عليه وسلم ‏\"‏ مررت ليلة أسري بي على موسى بن عمران - عليه السلام - رجل آدم طوال جعد كأنه من رجال شنوءة ورأيت عيسى ابن مريم مربوع الخلق إلى الحمرة والبياض سبط الرأس ‏\"‏ ‏.‏ وأري مالكا خازن النار والدجال ‏.‏ في آيات أراهن الله إياه فلا تكن في مرية من لقائه ‏.‏ قال كان قتادة يفسرها أن نبي الله صلى الله عليه وسلم قد لقي موسى عليه السلام ‏.‏",
      "text_en": " Abu al-'Aliya reported:                      Ibn Abbas, the son of your Prophet's uncle, told us that the Messenger of Allah (may peace be upon him) had observed: On the night of my night journey I passed by Moses b. 'Imran (peace be upon him), a man light brown in complexion, tall. well-built as if he was one of the men of the Shanu'a, and saw Jesus son of Mary as a medium-statured man with white and red complexion and crisp hair, and I was shown Malik the guardian of Fire, and Dajjal amongst the signs which were shown to me by Allah. He (the narrator) observed: Then do not doubt his (i. e. of the Holy Prophet) meeting with him (Moses). Qatada elucidated it thus: Verily the Apostle of Allah (may peace be upon him), met Moses (peace be upon him).",
      "chain": [
        "30553",
        "20393",
        "20240",
        "11019",
        "11618"
      ]
    },
    {
      "hadith_no": "1338",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا عبد بن حميد، حدثنا يونس بن محمد، حدثنا حماد بن سلمة، عن أيوب، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم كان إذا قعد في التشهد وضع يده اليسرى على ركبته اليسرى ووضع يده اليمنى على ركبته اليمنى وعقد ثلاثة وخمسين وأشار بالسبابة ‏.‏",
      "text_en": " Another version on the authority of Ibn Umar says:                      When the Messenger of Allah (may peace be upon him) sat for tashahhud, he placed his left hand on his left knee and placed his right hand on his right knee, and he formed a ring like (fifty-three) and pointed with his finger of attestation.",
      "chain": [
        "30553",
        "20393",
        "20021",
        "11015",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3484",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يونس بن محمد، حدثنا عبد الواحد بن زياد، حدثنا أبو عميس، عن إياس بن سلمة، عن أبيه، قال رخص رسول الله صلى الله عليه وسلم عام أوطاس في المتعة ثلاثا ثم نهى عنها ‏.‏",
      "text_en": " Iyas b. Salama reported on the authority of his father that Allah's Messenger (may peace be upon him) gave sanction for contracting temporary marriage for three nights in the year of Autas 1847 and then forbade it.",
      "chain": [
        "30201",
        "20393",
        "20256"
      ]
    },
    {
      "hadith_no": "3703",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عقبة بن خالد، ح وحدثنا عمرو الناقد، حدثنا الأسود بن عامر، حدثنا زهير، ح وحدثنا مجاهد بن موسى، حدثنا يونس بن محمد، حدثنا شريك، كلهم عن هشام، بهذا الإسناد أن سودة، لما كبرت ‏.‏ بمعنى حديث جرير وزاد في حديث شريك قالت وكانت أول امرأة تزوجها بعدي ‏.‏",
      "text_en": " A hadith like this has been transmitted on the authority of Hisham with the same chain of narrators (and the words are):                      When Sauda became old (the rest of the hadith is the same) and in the narration of Sharik there is an addition (of these words:\" She was the first woman whom he (Allah's Apostle) married after me.\"",
      "chain": [
        "30201",
        "20344",
        "30263",
        "20380",
        "20321",
        "30521",
        "20393"
      ]
    },
    {
      "hadith_no": "4738",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا عاصم بن النضر التيمي، حدثنا معتمر، قال سمعت أبي، حدثنا قتادة، قال سمعت أنس بن مالك، ح وحدثنا ابن المثنى، حدثنا أبو داود، حدثنا همام، ح وحدثنا عبد بن حميد، حدثنا يونس بن محمد، حدثنا شيبان، جميعا عن قتادة، عن أنس، نحو حديث ابن أبي عروبة ‏.‏",
      "text_en": " This tradition has been narrated through a different chain of transmitters.",
      "chain": [
        "20288",
        "11289",
        "11019",
        "19",
        "30002",
        "20297",
        "30553",
        "20393",
        "11019"
      ]
    },
    {
      "hadith_no": "5445",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا يونس بن محمد، حدثنا حرب بن ميمون، عن  النضر بن أنس، عن أنس بن مالك، عن النبي صلى الله عليه وسلم في طعام أبي طلحة نحو حديثهم ‏.‏",
      "text_en": " Anas b. Malik reported this hadith pertaining to the entertainment of Allah's Messenger (may peace be upon him) by Abu Talha through another chain of transmitters.",
      "chain": [
        "38834",
        "20393",
        "24075",
        "11310",
        "19"
      ]
    },
    {
      "hadith_no": "6505",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا زهير بن حرب، حدثنا يونس بن محمد، حدثنا شيبان، عن قتادة، حدثنا  أنس بن مالك، أنه أهدي لرسول الله صلى الله عليه وسلم جبة من سندس وكان ينهى عن الحرير فعجب الناس منها فقال ‏\"‏ والذي نفس محمد بيده إن مناديل سعد بن معاذ في الجنة أحسن من هذا ‏\"‏ ‏.‏",
      "text_en": " This hadith has been reported on the authority of Shu'ba combining the two chains of transmitters. Anas b Malik reported that Allah's Messenger (may peace be upon him) was presented a garment of sundus and he prohibited the use of silk. The persons admired it, whereupon he said:                      By Him in Whose Hand is the life of Muhammad, the kerchiefs of Sa'd b. Mu'adh in Paradise are better than this.",
      "chain": [
        "30022",
        "20393",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "6815",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يونس بن محمد، عن حماد بن سلمة، عن  ثابت، عن أنس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لما صور الله آدم في الجنة تركه ما شاء الله أن يتركه فجعل إبليس يطيف به ينظر ما هو فلما رآه أجوف عرف أنه خلق خلقا لا يتمالك ‏\"‏ ‏.‏",
      "text_en": " Anas reported Allah's Messenger (may peace be upon him) as saying:                      When Allah fashioned Adam in Paradise, He left him as He liked him to leave. Then Iblis roamed round him to see what actually that was and when he found him hollow from within, he recognised that he had been created with a disposition that he would not have control over himself.",
      "chain": [
        "30201",
        "20393",
        "20021",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "7254",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثني زهير بن حرب، وعبد بن حميد، قالا حدثنا يونس بن محمد، حدثنا شيبان، حدثنا قتادة، عن أنس، أن أهل، مكة سألوا رسول الله صلى الله عليه وسلم أن يريهم آية فأراهم انشقاق القمر مرتين ‏.‏  وحدثنيه محمد بن رافع، حدثنا عبد الرزاق، أخبرنا معمر، عن قتادة، عن أنس، بمعنى حديث شيبان ‏.‏",
      "text_en": " Anas reported that the people of Mecca demanded from Allah's Messenger (may peace be upon him) that he should show them (some) signs (miracles) and he showed tlicin the splitting of the moon. This hadlth has been narrated on the authority of Anas through another chain of transmitters.",
      "chain": [
        "30022",
        "30553",
        "20393",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "7265",
      "source": " Sahih Muslim ",
      "chapter": "The Book Giving Description of the Day of Judgement; Paradise and Hell - كتاب صفة القيامة والجنة والنار",
      "chapter_no": "53",
      "text_ar": "حدثني زهير بن حرب، وعبد بن حميد، - واللفظ لزهير - قالا حدثنا يونس، بن محمد حدثنا شيبان، عن قتادة، حدثنا أنس بن مالك، أن رجلا، قال يا رسول الله كيف يحشر الكافر على وجهه يوم القيامة قال ‏\"‏ أليس الذي أمشاه على رجليه في الدنيا قادرا على أن يمشيه على وجهه يوم القيامة ‏\"‏ ‏.‏ قال قتادة بلى وعزة ربنا ‏.‏",
      "text_en": " Anas b. Malik reported that a person said:                      Allah's Messenger, how the non-believers would be made to assemble on the Day of Resurrection (by crawling) on their faces? Thereupon he said: Is He Who is powerfnl to make them walk on their feet is not powerful enough to make them (crawl) upon their faces on the Day of Resurrection? Qatada said: Of conrse, it is so. (He adjured): By the might of our Lord.",
      "chain": [
        "30022",
        "30553",
        "20393",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "7348",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يونس بن محمد، حدثنا شيبان بن عبد الرحمن، قال قال قتادة سمعت أبا نضرة، يحدث عن سمرة، أنه سمع نبي الله صلى الله عليه وسلم يقول ‏\"‏ إن منهم من تأخذه النار إلى كعبيه ومنهم من تأخذه إلى حجزته ومنهم من تأخذه إلى عنقه ‏\"‏ ‏.‏",
      "text_en": " Samura b. Jundub reported Allah's Apostle (may peace -be upon him) as saying:                      There will be some to whose ankels the fire will reach, some to whose knees, some to whose waist the fire will reach, and some to whose collar-bone the fire will reach.",
      "chain": [
        "30201",
        "20393",
        "20240",
        "11019",
        "10721",
        "394"
      ]
    },
    {
      "hadith_no": "7356",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا عبد بن حميد، حدثنا يونس بن محمد، حدثنا شيبان، عن قتادة، حدثنا  أنس بن مالك، أن نبي الله صلى الله عليه وسلم قال ‏\"‏ لا تزال جهنم تقول هل من مزيد ‏.‏ حتى يضع فيها رب العزة تبارك وتعالى قدمه فتقول قط قط وعزتك ‏.‏ ويزوى بعضها إلى بعض ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported that Allah's Apostle (may peace be upon him) said that the Hell would continue to say:                      Is there anything more, until Allah, the Exalted and High, would place His foot therein and that would say: Enough, enough, by Your Honour, and some parts of it would draw close to the other.",
      "chain": [
        "30553",
        "20393",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "7395",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا عبد بن حميد، حدثنا يونس بن محمد، حدثنا شيبان بن عبد الرحمن، عن  قتادة، حدثنا أنس بن مالك، قال قال نبي الله صلى الله عليه وسلم ‏\"‏ إن العبد إذا وضع في قبره وتولى عنه أصحابه إنه ليسمع قرع نعالهم ‏\"‏ ‏.‏ قال ‏\"‏ يأتيه ملكان فيقعدانه فيقولان له ما كنت تقول في هذا الرجل ‏\"‏ ‏.‏ قال ‏\"‏ فأما المؤمن فيقول أشهد أنه عبد الله ورسوله ‏\"‏ ‏.‏ قال ‏\"‏ فيقال له انظر إلى مقعدك من النار قد أبدلك الله به مقعدا من الجنة ‏\"‏ ‏.‏ قال نبي الله صلى الله عليه وسلم ‏\"‏ فيراهما جميعا ‏\"‏ ‏.‏ قال قتادة وذكر لنا أنه يفسح له في قبره سبعون ذراعا ويملأ عليه خضرا إلى يوم يبعثون ‏.‏",
      "text_en": " Anas b. Malik reported Allah's Apostle (may peace be upon him) having said:                      When the servant is placed in his grave and his companions retrace their steps arid he hears the noise of the footsteps, then two angels come to him and make him sit and say to him: What you have to say about this person (the Holy Prophet)? If he is d believer, lie would say: I bear testimony to the fact that he is a servant of Allah and His Messenger. Then it would be said to him: Look to your seat in the Hell- Fire, for Allah has substituted (the seat of yours) with a seat in Paradise. Allah's Messenger (may peace be upon him) said: He would be shown both the seats. Qatada said: It was mentioned to us that his grave (the grave of a believer) expands to seventy cubits and is full with verdure until the Day when they would be resurrected.",
      "chain": [
        "30553",
        "20393",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "7426",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا يونس بن محمد، حدثنا القاسم بن الفضل، الحداني عن محمد بن زياد، عن عبد الله بن الزبير، أن عائشة، قالت عبث رسول الله صلى الله عليه وسلم في منامه فقلنا يا رسول الله صنعت شيئا في منامك لم تكن تفعله ‏.‏ فقال ‏\"‏ العجب إن ناسا من أمتي يؤمون بالبيت برجل من قريش قد لجأ بالبيت حتى إذا كانوا بالبيداء خسف بهم ‏\"‏ ‏.‏ فقلنا يا رسول الله إن الطريق قد يجمع الناس ‏.‏ قال ‏\"‏ نعم فيهم المستبصر والمجبور وابن السبيل يهلكون مهلكا واحدا ويصدرون مصادر شتى يبعثهم الله على نياتهم ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported that Allah's Messenger (may peace be upon him) was startled in the state of sleep. We said:                      Allah's Messenger, you have done something in the state of your sleep which you never did before, Thereupon he said: Strange it is that some, people of my Ummah would attack the House (Ka'ba) (for killing) a person who would belong to the tribe of the Quraish and he would try to seek protection in the House. And when they would reach the plain ground they would be sunk. We said: Allah's Messenger, all sorts of people throng the path. Thereupon he said: Yes, there would be amongst them people who would come with definite designs and those who would come under duress and there would be travellers also, but they would all be destroyed through one (stroke) of destruction. though they would be raised in different states (on the Day of Resurrection). Allah would, however, raise them according to their intention.",
      "chain": [
        "30201",
        "20393",
        "20564",
        "11216",
        "106",
        "53"
      ]
    },
    {
      "hadith_no": "7578",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا يونس بن محمد، عن حماد بن سلمة، عن  إسحاق بن عبد الله بن أبي طلحة، عن أنس، أن رسول الله صلى الله عليه وسلم قال ‏.‏ فذكر نحوه غير أنه قال فيأتي سبخة الجرف فيضرب رواقه وقال فيخرج إليه كل منافق ومنافقة ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Anas that Allah's Messenger (may peace be upon him) said this but with this addition that (the Dajjal would come) and pitch his tent in the waste-land of Juruf and thus there would come out of (the city) every hypocrite, man and woman.",
      "chain": [
        "30201",
        "20393",
        "20021",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "7599",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا يونس بن محمد، عن حماد بن سلمة، عن  ثابت، عن أنس، أن رجلا، سأل رسول الله صلى الله عليه وسلم متى تقوم الساعة وعنده غلام من الأنصار يقال له محمد فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن يعش هذا الغلام فعسى أن لا يدركه الهرم حتى تقوم الساعة ‏\"‏ ‏.‏",
      "text_en": " Anas reported that a person asked Allah's Messenger (may peace be upon him) as to when the Last Hour would come. He had in his presence a young boy of the Ansar who was called Mabammad. Allah's Messenger (may peace be upon bion) said:                      If this young boy lives. he may not grow very old till (he would see) the Last Hour coming to you.",
      "chain": [
        "30201",
        "20393",
        "20021",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3724",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Drinks (Kitab Al-Ashribah) - كتاب الأشربة",
      "chapter_no": "27",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا يونس بن محمد، حدثني فليح، عن سعيد بن الحارث، عن جابر بن عبد الله، قال دخل النبي صلى الله عليه وسلم ورجل من أصحابه على رجل من الأنصار وهو يحول الماء في حائطه فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن كان عندك ماء بات هذه الليلة في شن وإلا كرعنا ‏\"‏ ‏.‏ قال بل عندي ماء بات في شن ‏.‏",
      "text_en": " Jabir b. ‘abd Allah said:                      The Prophet (ﷺ) went to visit a man of the Ansar accompanied by one of his Companions who was watering his garden. The Messenger of Allah(ﷺ) said: If you have any water which has remained over night in a skin (we should like it), or shall sip (from a streamlet).",
      "chain": [
        "30203",
        "20393",
        "20169",
        "11167",
        "34"
      ]
    },
    {
      "hadith_no": "3925",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divination and Omens (Kitab Al-Kahanah Wa Al-Tatayyur) - كتاب الكهانة و التطير",
      "chapter_no": "30",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا يونس بن محمد، حدثنا مفضل بن فضالة، عن حبيب بن الشهيد، عن محمد بن المنكدر، عن جابر، أن رسول الله صلى الله عليه وسلم أخذ بيد مجذوم فوضعها معه في القصعة وقال ‏\"‏ كل ثقة بالله وتوكلا عليه ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     The Messenger of Allah (ﷺ) took a man who was suffering from tubercular leprosy by the hand; he then put it along with his own hand in the dish and said: Eat with confidence in Allah and trust in Him.",
      "chain": [
        "30203",
        "20393",
        "20378",
        "11275",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "4575",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Types of Blood-Wit (Kitab Al-Diyat) - كتاب الديات",
      "chapter_no": "41",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا يونس بن محمد، حدثنا عبد الواحد بن زياد، حدثنا مجالد، قال حدثنا الشعبي، عن جابر بن عبد الله، أن امرأتين، من هذيل قتلت إحداهما الأخرى ولكل واحدة منهما زوج وولد فجعل رسول الله صلى الله عليه وسلم دية المقتولة على عاقلة القاتلة وبرأ زوجها وولدها ‏.‏ قال فقال عاقلة المقتولة ميراثها لنا قال فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا ميراثها لزوجها وولدها ‏\"‏ ‏.‏",
      "text_en": " Narrated Jabir ibn Abdullah:                     One of the two women of Hudhayl killed the other, Each of them had husband and sons. The Messenger of Allah (ﷺ) fixed the blood-wit for the slain woman to be paid by the woman's relatives on the father's side. He declared her husband and the child innocent. The relatives of the woman who killed said: We shall inherit from her. The Messenger of Allah (ﷺ) said: No, her sons and her husband should inherit from her.",
      "chain": [
        "30203",
        "20393",
        "20256",
        "11052",
        "34"
      ]
    },
    {
      "hadith_no": "196",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد بن حميد، حدثنا يونس بن محمد، عن عبد المنعم، نحوه ‏.‏ قال أبو عيسى حديث جابر هذا حديث لا نعرفه إلا من هذا الوجه من حديث عبد المنعم وهو إسناد مجهول وعبد المنعم شيخ بصري ‏.‏",
      "text_en": " Jabir [bin Abdullah] narrated:                     (Another chain for) a similar narration (as no. 195).",
      "chain": [
        "30553",
        "20393",
        "24282"
      ]
    },
    {
      "hadith_no": "1076",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا محمد بن حاتم المؤدب، حدثنا يونس بن محمد، قال حدثتنا أم الأسود، عن منية بنت عبيد بن أبي برزة، عن جدها أبي برزة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من عزى ثكلى كسي بردا في الجنة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب وليس إسناده بالقوي ‏.‏",
      "text_en": " Abu Barzah narrated that :                     The Messenger of Allah said: \"Whoever consoles a bereaved mother, he will be clothes with a Burd in Paradise.\"",
      "chain": [
        "38487",
        "20393",
        "19527"
      ]
    },
    {
      "hadith_no": "1817",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن سعيد الأشقر، وإبراهيم بن يعقوب، قالا حدثنا يونس بن محمد، حدثنا المفضل بن فضالة، عن حبيب بن الشهيد، عن محمد بن المنكدر، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم أخذ بيد مجذوم فأدخله معه في القصعة ثم قال ‏\"‏ كل بسم الله ثقة بالله وتوكلا عليه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث يونس بن محمد عن المفضل بن فضالة ‏.‏ والمفضل بن فضالة هذا شيخ بصري والمفضل بن فضالة شيخ آخر مصري أوثق من هذا وأشهر ‏.‏ وقد روى شعبة هذا الحديث عن حبيب بن الشهيد عن ابن بريدة أن ابن عمر أخذ بيد مجذوم وحديث شعبة أثبت عندي وأصح ‏.‏",
      "text_en": " Narrated Jabir bin ‘Abdullah :                     \"The Messenger of Allah (ﷺ) took the hand of a leper and put it in the Qas'ah. Then he said: 'Eat in Allah's Name, trusting in Allah and relying upon Him.'\"[Abu 'Eisa said:] This is a Gharib Hadith, we do not know of it except through the report of Yunus bin Muhammad, from Al-Mufaddal bin Fadalah, a Shaikh from Al-Basrah. There is another Shaikh from Al-Basrah named Al-Mufaddal bin Fadalah, who is more reliable han this one and more popular. Shu'bah reported this Hadith from Habib bin Ash-Shahid, from Ibn Buraidah: \"That Ibn 'Umar took the hand of a leper\" and the narration of Shu'bah is more appropriate to me and more correct.",
      "chain": [
        "30296",
        "38088",
        "20393",
        "20378",
        "11275",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "2170",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا عباس بن محمد الدوري، حدثنا يونس بن محمد، حدثنا فليح بن سليمان، عن عثمان بن عبد الرحمن التيمي، عن يعقوب بن أبي يعقوب، عن أم المنذر، قالت دخل على رسول الله صلى الله عليه وسلم ومعه علي ولنا دوال معلقة قالت فجعل رسول الله صلى الله عليه وسلم يأكل وعلي معه يأكل ‏.‏ فقال رسول الله صلى الله عليه وسلم لعلي ‏\"‏ مه مه يا علي فإنك ناقه ‏\"‏ ‏.‏ قال فجلس علي والنبي صلى الله عليه وسلم يأكل ‏.‏ قالت فجعلت لهم سلقا وشعيرا فقال النبي صلى الله عليه وسلم ‏\"‏ يا علي من هذا فأصب فإنه أوفق لك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه إلا من حديث فليح ‏.‏ ويروى عن فليح عن أيوب بن عبد الرحمن ‏.‏",
      "text_en": " Umm Al-Mundhir said:                     The Messenger of Allah (s.a.w) entered upon me, while 'Ali was with him, and we had a cluster of unripe dates hanging.\" She said: \"The Messenger of Allah (s.a.w) said to 'Ali: 'Stop, stop, for you are still recovering.' So 'Ali sat and the Prophet ate.\" She said: 'I made some chard and barley for them, so the Prophet said: 'O 'Ali eat from this, for indeed it will be more suitable for you.\"",
      "chain": [
        "30585",
        "20393",
        "20169",
        "11525",
        "12604"
      ]
    },
    {
      "hadith_no": "2266",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Al-Fitan - كتاب الفتن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "33",
      "text_ar": "حدثنا أحمد بن سعيد الأشقر، حدثنا يونس بن محمد، وهاشم بن القاسم، قالا حدثنا صالح المري، عن سعيد الجريري، عن أبي عثمان النهدي، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا كان أمراؤكم خياركم وأغنياؤكم سمحاءكم وأموركم شورى بينكم فظهر الأرض خير لكم من بطنها وإذا كان أمراؤكم شراركم وأغنياؤكم بخلاءكم وأموركم إلى نسائكم فبطن الأرض خير لكم من ظهرها ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث صالح المري ‏.‏ وصالح المري في حديثه غرائب ينفرد بها لا يتابع عليها وهو رجل صالح ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah(s.a.w) said:                     \"When your leaders are the best of you, the richest are the most generous among you, and your affairs are consulted among you, then the surface of the earth is better for you than its belly. And when your leaders are the worst of you, the richest are the stingiest among you, and your affairs are referred to your women, then the belly of the earth is better for you than its surface.\"",
      "chain": [
        "30296",
        "20393",
        "20390",
        "24207",
        "11286",
        "11113",
        "13"
      ]
    },
    {
      "hadith_no": "3293",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا يونس بن محمد، حدثنا الليث بن سعد، عن هشام بن سعد، عن محمد بن زيد بن مهاجر بن قنفذ التيمي، عن أبي أمامة الأنصاري، عن عبد الله بن أنيس الجهني، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من أكبر الكبائر الشرك بالله وعقوق الوالدين واليمين الغموس وما حلف حالف بالله يمين صبر فأدخل فيها مثل جناح بعوضة إلا جعلت نكتة في قلبه إلى يوم القيامة ‏\"‏ ‏.‏ قال أبو عيسى وأبو أمامة الأنصاري هو ابن ثعلبة ولا نعرف اسمه وقد روى عن النبي صلى الله عليه وسلم أحاديث ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Narrated Abu Umamah Al-Ansari:                     from 'Abdullah bin Unais Al-Juhni who said: \"The Messenger of Allah (ﷺ) said: 'Indeed among the worst of the major sins is Shirk with Allah, disobeying the parents, the false oath, and none insists on taking an oath in which he swears, including the like of a wing of a mosquito (of falsehood) in it - except that a spot is placed in his heart until the Day of Judgement.'\"",
      "chain": [
        "30553",
        "20393",
        "20023",
        "20519",
        "11217",
        "1048"
      ]
    },
    {
      "hadith_no": "3582",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا الفضل بن سهل الأعرج البغدادي، وغير، واحد، قالوا حدثنا يونس بن محمد، عن سلام بن أبي مطيع، عن قتادة، عن الحسن، عن سمرة بن جندب، عن النبي صلى الله عليه وسلم قال ‏\"‏ الحسب المال والكرم التقوى ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من حديث سمرة ‏.‏ لا نعرفه إلا من هذا الوجه من حديث سلام بن أبي مطيع وهو ثقة ‏.‏",
      "text_en": " Narrated Al-Hasan:                     from Samurah that the Prophet (ﷺ) said: \"Al-Hasab is wealth and Al-Karam is Taqwa.\"",
      "chain": [
        "30264",
        "20393",
        "20550",
        "11019",
        "11016",
        "394"
      ]
    },
    {
      "hadith_no": "3583",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا يونس بن محمد، حدثنا شيبان، عن قتادة، حدثنا أنس بن مالك، أن نبي الله صلى الله عليه وسلم قال ‏\"‏ لا تزال جهنم تقول هل من مزيد حتى يضع فيها رب العزة قدمه فتقول قط قط وعزتك ويزوى بعضها إلى بعض ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏ وفيه عن أبي هريرة ‏.‏",
      "text_en": " Narrated Anas bin Malik:                     that Allah's Prophet (ﷺ) said: \"Jahannam will continue saying: 'Are there any more' until the Might Lord puts His Foot over it. It will say: 'Enough! Enough! By Your Might.' And one side of it will close in on the other.\"",
      "chain": [
        "30553",
        "20393",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "3611",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، وغير، واحد، - المعنى واحد قالوا حدثنا يونس بن محمد، حدثنا شيبان بن عبد الرحمن، عن قتادة، حدثنا الحسن، عن أبي هريرة، قال بينما نبي الله صلى الله عليه وسلم جالس وأصحابه إذ أتى عليهم سحاب فقال نبي الله صلى الله عليه وسلم ‏\"‏ هل تدرون ما هذا ‏\"‏ ‏.‏ فقالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ هذا العنان هذه روايا الأرض يسوقه الله تبارك وتعالى إلى قوم لا يشكرونه ولا يدعونه ‏\"‏ ‏.‏ ثم قال ‏\"‏ هل تدرون ما فوقكم ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإنها الرقيع سقف محفوظ وموج مكفوف ‏\"‏ ‏.‏ ثم قال ‏\"‏ هل تدرون كم بينكم وبينها ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ بينكم وبينها مسيرة خمسمائة سنة ‏\"‏ ‏.‏ ثم قال ‏\"‏ هل تدرون ما فوق ذلك ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإن فوق ذلك سماءين وما بينهما مسيرة خمسمائة عام ‏\"‏ ‏.‏ حتى عد سبع سموات ما بين كل سماءين كما بين السماء والأرض ‏.‏ ثم قال ‏\"‏ هل تدرون ما فوق ذلك ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإن فوق ذلك العرش وبينه وبين السماء بعد ما بين السماءين ‏\"‏ ‏.‏ ثم قال ‏\"‏ هل تدرون ما الذي تحتكم ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإنها الأرض ‏\"‏ ‏.‏ ثم قال ‏\"‏ هل تدرون ما الذي تحت ذلك ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإن تحتها الأرض الأخرى بينهما مسيرة خمسمائة سنة ‏\"‏ ‏.‏ حتى عد سبع أرضين بين كل أرضين مسيرة خمسمائة سنة ثم قال ‏\"‏ والذي نفس محمد بيده لو أنكم دليتم رجلا بحبل إلى الأرض السفلى لهبط على الله ‏\"‏ ‏.‏ ثم قرأ ‏(‏ هو الأول والآخر والظاهر والباطن وهو بكل شيء عليم ‏)‏ ‏.‏ قال أبو عيسى هذا حديث غريب من هذا الوجه ‏.‏ قال ويروى عن أيوب ويونس بن عبيد وعلي بن زيد قالوا لم يسمع الحسن من أبي هريرة ‏.‏ وفسر بعض أهل العلم هذا الحديث فقالوا إنما هبط على علم الله وقدرته وسلطانه ‏.‏ علم الله وقدرته وسلطانه في كل مكان وهو على العرش كما وصف في كتابه ‏.‏",
      "text_en": " Al-Hasan narrated that:                     Abu Hurairah said: “Once when the Prophet of Allah was sitting with his Companions, a cloud came above them, so the Prophet of Allah said: ‘Do you know what this is?’ They said: ‘Allah and His Messenger know better.’ He said: ‘These are the clouds that are to drench the earth, which Allah [Blessed and Most High] dispatches to people who are not grateful to Him, nor supplicate to Him.’ Then he said: ‘Do you know what is above you?’ They said: ‘Allah and His Messenger know better.’ He said: ‘Indeed it is a preserved canopy of the firmament whose surge is restrained.’ Then he said: ‘Do you know how much is between you and between it?’ They said: ‘Allah and His Messenger know better.’ He said: ‘Between you and it [is the distance] of five-hundred year.’ Then he said: ‘Do you know what is above that.’ They said: ‘Allah and His Messenger know better.’ He said: ‘Verily, above that are two Heavens, between the two of them there is a distance of five-hundred years’ – until he enumerated seven Heavens – ‘What is between each of the two Heavens is what is between the heavens and the earth.’ Then he said: ‘Do you know what is above that?’ They said: ‘Allah and His Messenger know better.’ He said: ‘Verily, above that is the Throne between it and the heavens is a distance [like] what is between two of the heavens.’ Then he said: ‘Do you know what is under you?’ They said: ‘Allah and His Messenger know better.’ He said: ‘Indeed it is the earth.’ Then he said: ‘Do you know what is under that?’ They said: ‘Allah and His Messenger know better.’ He said: ‘Verily, below it is another earth, between the two of which is a distance of five-hundred years.’ Until he enumerated seven earths: ‘Between every two earths is a distance of five-hundred years.’ Then he said: ‘By the One in Whose Hand is the soul of Muhammad! If you were to send [a man] down with a rope to the lowest earth, then he would descend upon Allah.’ Then he recited: He is Al-Awwal, Al-Akhir, Az-Zahir Al-Batin, and He has knowledge over all things.”",
      "chain": [
        "30553",
        "20393",
        "20240",
        "11019",
        "11016",
        "13"
      ]
    },
    {
      "hadith_no": "3544",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن عبد الله بن أبي الثلج، - رجل من أهل بغداد أبو عبد الله صاحب أحمد بن حنبل حدثنا يونس بن محمد، حدثنا سعيد بن زربي، عن عاصم الأحول، وثابت، عن أنس، قال دخل النبي صلى الله عليه وسلم المسجد ورجل قد صلى وهو يدعو ويقول في دعائه اللهم لا إله إلا أنت المنان بديع السموات والأرض ذا الجلال والإكرام ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ تدرون بم دعا الله دعا الله باسمه الأعظم الذي إذا دعي به أجاب وإذا سئل به أعطى ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب من حديث ثابت عن أنس ‏.‏ وقد روي من غير هذا الوجه عن أنس ‏.‏",
      "text_en": " Anas said that:                     the Prophet entered the Masjid and there was a man who had performed Salat and was supplicating. He was saying in his supplication: “O Allah, none has the right to be worshipped but Allah, You are the One Who gives blessings, Originator of the heavens and the earth, POssessor of glory and generosity (Allahumma La Ilaha Illallah, Antal-Mannan, Badi’as-Samawati Wal-Ard, Dhal-Jalali Wal Ikram).” So the Prophet said: “Do you know what he has supplicated Allah with? He has supplicated to Allah  by His Greatest Name, the one which if He Is called upon by it, He responds, and when He is asked by it, He gives.”",
      "chain": [
        "20393",
        "11080",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "1632",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا العباس بن محمد، قال حدثنا يونس بن محمد، قال حدثنا حماد بن سلمة، عن سليمان التيمي، وثابت، عن أنس، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أتيت على موسى عليه السلام عند الكثيب الأحمر وهو قائم يصلي ‏\"‏ ‏.‏ قال أبو عبد الرحمن هذا أولى بالصواب عندنا من حديث معاذ بن خالد والله تعالى أعلم ‏.‏",
      "text_en": " It was narrated from Anas that :                     The Messenger of Allah (ﷺ) said: \"I came to Musa at the red dune and he was standing and praying.\"",
      "chain": [
        "20393",
        "20021",
        "11289",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "1802",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا أبو الأزهر، أحمد بن الأزهر النيسابوري قال حدثنا يونس بن محمد، قال حدثنا فليح، عن سهيل بن أبي صالح، عن أبي إسحاق، عن المسيب، عن عنبسة بن أبي سفيان، عن أم حبيبة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ من صلى اثنتى عشرة ركعة بنى الله له بيتا في الجنة أربعا قبل الظهر واثنتين بعدها واثنتين قبل العصر واثنتين بعد المغرب واثنتين قبل الصبح ‏\"‏ ‏.‏ قال أبو عبد الرحمن فليح بن سليمان ليس بالقوي ‏.‏",
      "text_en": " It was narrated that Umm Habibah said:                     \"The Messenger of Allah (ﷺ) said: 'Whoever prays twelve rak'ahs, Allah (SWT) will build for him a house in paradise: four before Zuhr and two after, two before Asr, two after Maghrib, and two before Subh.'\"",
      "chain": [
        "20393",
        "20169",
        "11173",
        "11049",
        "846",
        "59"
      ]
    },
    {
      "hadith_no": "2050",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، وإبراهيم بن يعقوب بن إسحاق، قالا حدثنا يونس بن محمد، عن شيبان، عن قتادة، أنبأنا أنس بن مالك، قال قال نبي الله صلى الله عليه وسلم ‏\"‏ إن العبد إذا وضع في قبره وتولى عنه أصحابه إنه ليسمع قرع نعالهم ‏\"‏ ‏.‏ قال ‏\"‏ فيأتيه ملكان فيقعدانه فيقولان له ما كنت تقول في هذا الرجل فأما المؤمن فيقول أشهد أنه عبد الله ورسوله فيقال له انظر إلى مقعدك من النار قد أبدلك الله به مقعدا من الجنة ‏\"‏ ‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ فيراهما جميعا ‏\"‏ ‏.‏",
      "text_en": " Anas bin Malik said:                     \"The Prophet of Allah said: 'When a person is placed in his grave and his companions depart from him, he hears the sound of their sandals. Then two angles came to him and make him sit up, and they say to him: What did you say about this man? As for the believer, he says: \"I bear witness that he is the slave of Allah and His Messenger. Then it is said to him: Look at your place in Hell, Which Allah has replaced for you with a place in Paradise. The prophet said: 'And he sees them both.\"'",
      "chain": [
        "38088",
        "20393",
        "20240",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "77",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن إسماعيل الرازي، أنبأنا يونس بن محمد، حدثنا عبد الله بن محمد الليثي، حدثنا نزار بن حيان، عن عكرمة، عن ابن عباس، وعن جابر بن عبد الله، قالا قال رسول الله  صلى الله عليه وسلم  ‏\"‏ صنفان من أمتي ليس لهما في الإسلام نصيب أهل الإرجاء وأهل القدر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas and Jabir bin 'Abdullah said:                     \"The Messenger of Allah (ﷺ) said: 'There are two types among my Ummah who have no share of Islam: the people of Irja' and the people of Qadar.'\"",
      "chain": [
        "34188",
        "20393",
        "28305",
        "19075",
        "11023",
        "17",
        "34"
      ]
    },
    {
      "hadith_no": "260",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يونس بن محمد، وسريج بن النعمان، قالا حدثنا فليح بن سليمان، عن عبد الله بن عبد الرحمن بن معمر أبي طوالة، عن سعيد بن يسار، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من تعلم علما مما يبتغى به وجه الله لا يتعلمه إلا ليصيب به عرضا من الدنيا لم يجد عرف الجنة يوم القيامة ‏\"‏ ‏.‏ يعني ريحها ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: 'Whoever acquires knowledge by which the pleasure of Allah is sought, but he only acquires it for the purpose of worldly gain, will not smell the fragrance of Paradise on the Day of Resurrection.'\" (Hasan)Another chain with similar wording.",
      "chain": [
        "30201",
        "20393",
        "30250",
        "20169",
        "11170",
        "13"
      ]
    },
    {
      "hadith_no": "606",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يونس بن محمد، عن داود بن أبي الفرات، عن محمد بن زيد، عن أبي شريح، عن أبي مسلم، مولى زيد بن صوحان قال كنت مع سلمان فرأى رجلا ينزع خفيه للوضوء فقال له سلمان امسح على خفيك وعلى خمارك وبناصيتك فإني رأيت رسول الله  صلى الله عليه وسلم  يمسح على الخفين والخمار ‏.‏",
      "text_en": " It was narrated that Abu Muslim, the freed slave of Zaid bin Suhan, said:                     \"I was with Salman, and he saw a man removing his leather socks for ablution. Salman said to him\" 'Wipe over your leather socks and your head cover, and your forehead, for I saw the Messenger of Allah wiping over his leather socks and head cover.'\"",
      "chain": [
        "30201",
        "20393",
        "20424",
        "11217",
        "5355"
      ]
    },
    {
      "hadith_no": "735",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يونس بن محمد، حدثنا ليث بن سعد، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا داود بن عبد الله الجعفري، عن عبد العزيز بن محمد، جميعا عن يزيد بن عبد الله بن أسامة بن الهاد، عن الوليد بن أبي الوليد، عن عثمان بن عبد الله بن سراقة العدوي، عن عمر بن الخطاب، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ من بنى مسجدا يذكر فيه اسم الله بنى الله له بيتا في الجنة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Umar bin Khattab said:                     \"I heard the Messenger of Allah say: 'Whoever builds a mosque in which the Name of Allah is mentioned, Allah will build a house for him in Paradise.'\"",
      "chain": [
        "30201",
        "20393",
        "20023",
        "30201",
        "20167",
        "10623"
      ]
    },
    {
      "hadith_no": "1585",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يونس بن محمد، حدثنا فليح بن سليمان، عن صالح بن عجلان، عن عباد بن عبد الله بن الزبير، عن عائشة، قالت والله ما صلى رسول الله  صلى الله عليه وسلم  على سهيل ابن بيضاء إلا في المسجد ‏.‏ قال ابن ماجه حديث عائشة أقوى ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “By Allah! The Messenger of Allah(ﷺ) did not offer the funeral prayer for Suhail bin Baida’anywherebut in the mosque.”",
      "chain": [
        "30201",
        "20393",
        "20169",
        "23507",
        "11250",
        "53"
      ]
    },
    {
      "hadith_no": "1691",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يونس بن محمد، حدثنا ليث بن سعد، عن يزيد بن أبي حبيب، عن موسى بن سرجس، عن القاسم بن محمد، عن عائشة، قالت رأيت رسول الله  صلى الله عليه وسلم  وهو يموت وعنده قدح فيه ماء فيدخل يده في القدح ثم يمسح وجهه بالماء ثم يقول ‏\"‏ اللهم أعني على سكرات الموت ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Aishah said:                      “I saw the Messenger of Allah(ﷺ)when he was dying, and there was a bowl of water next to him. Heputhis hand in the vessel and wiped his face with the water, andsaid:‘O Allah, help me to bear the agonies of death.’”",
      "chain": [
        "30201",
        "20393",
        "20023",
        "11411",
        "12524",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "1849",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أحمد بن منصور أبو بكر، حدثنا يونس بن محمد، حدثنا الهياج الخراساني، حدثنا عنبسة بن عبد الرحمن، عن عبد الخالق، عن أنس بن مالك، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ المعتكف يتبع الجنازة ويعود المريض ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Anas bin Malik said:                      “The Messenger of Allah(ﷺ)said: ‘The person observing I’tikaf may attend funerals andvisitthe sick.’”",
      "chain": [
        "20393",
        "28459",
        "19"
      ]
    },
    {
      "hadith_no": "2034",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا حبيش بن مبشر، حدثنا يونس بن محمد، حدثنا حماد بن زيد، عن أيوب، عن عكرمة، عن عائشة، ‏.‏ أن رسول الله  صلى الله عليه وسلم  أعتق صفية وجعل عتقها صداقها وتزوجها ‏.‏",
      "text_en": " It was narrated from 'Aishah:                     that the Messenger of Allah (ﷺ) set Safiyyah free, and made her ransom her dowry, and he married her.",
      "chain": [
        "38139",
        "20393",
        "20022",
        "11015",
        "11023"
      ]
    },
    {
      "hadith_no": "2863",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يونس بن محمد، حدثنا ليث بن سعد، عن يزيد بن عبد الله بن الهاد، عن الوليد بن أبي الوليد، عن عثمان بن عبد الله بن سراقة، عن عمر بن الخطاب، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من جهز غازيا في سبيل الله حتى يستقل كان له مثل أجره حتى يموت أو يرجع ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Umar bin Khattab said:                      “I heard the MessengerofAllah (ﷺ) say: ‘Whoever equips a warrior in the cause of Allahuntil he is fully equipped, he will have a reward like his, until hedies or returns.”",
      "chain": [
        "30201",
        "20393",
        "20023",
        "11234",
        "10623",
        "11523",
        "3"
      ]
    },
    {
      "hadith_no": "3353",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hunting - كتاب الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يونس بن محمد، عن جرير بن حازم، عن نافع، عن سائبة، - مولاة الفاكه بن المغيرة - أنها دخلت على عائشة فرأت في بيتها رمحا موضوعا فقالت يا أم المؤمنين ما تصنعين بهذا قالت نقتل به هذه الأوزاغ فإن نبي الله  صلى الله عليه وسلم  أخبرنا أن إبراهيم لما ألقي في النار لم تكن في الأرض دابة إلا أطفأت النار غير الوزغ فإنها كانت تنفخ عليه فأمر رسول الله  صلى الله عليه وسلم  بقتله ‏.‏",
      "text_en": " It wasnarrated from Sa’ibah, the freed slave woman of Fakih binMughirah,that she entered upon ‘Aishah and saw a spear in her house.Shesaid:                      “O Mother of the Believers, what do you do with this?” Shesaid: “We kill these house lizards with it, for the Prophet ofAllah(ﷺ) told us that when Ibrahim was thrown into the fire, therewas nobeast on earth that did not try to put it out, apart from thehouselizard that blew on it. So the Messenger of Allah (ﷺ)commanded thatthey should be killed.”",
      "chain": [
        "30201",
        "20393",
        "11272",
        "11014"
      ]
    }
  ],
  "total_hadiths": 56
}