{
  "id": "20397",
  "name": "Yahya bin Abi Zakaria يحيى بن أبي زكريا",
  "full_name": "Yahya bin Abi Zakaria يحيى بن أبي زكريا",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "190",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Wasit",
      "al-Syria"
    ],
    "area_of_interest": [
      "Narrator[Grade:Weak] [ خ  -  ضعيف ]"
    ],
    "tags": [
      "al-Wasti",
      "al-Sham"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11311",
      "name": "Hisham bin Hassan al-Azdi هشام بن حسان الأزدي القردوسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10644",
      "name": "'Abdullah bin 'Uthman bin Khuthaym عبد الله بن عثمان بن خثيم القاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11075",
      "name": "Yonus bin 'Ubaid bin Dinar يونس بن عبيد بن دينار العبدي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "30373",
      "name": "Muhammad bin Harb al-Wasti محمد بن حرب بن حرمان النشائي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1389",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا إسماعيل، حدثني سليمان، عن هشام، وحدثني محمد بن حرب، حدثنا أبو مروان، يحيى بن أبي زكرياء عن هشام، عن عروة، عن عائشة، قالت إن كان رسول الله صلى الله عليه وسلم ليتعذر في مرضه ‏\"‏ أين أنا اليوم أين أنا غدا ‏\"‏ استبطاء ليوم عائشة، فلما كان يومي قبضه الله بين سحري ونحري، ودفن في بيتي‏.‏",
      "text_en": " Narrated `Aisha:                     During his sickness, Allah's Apostle was asking repeatedly, \"Where am I today? Where will I be tomorrow?\" And I was waiting for the day of my turn (impatiently). Then, when my turn came, Allah took his soul away (in my lap) between my chest and arms and he was buried in my house.",
      "chain": [
        "30103",
        "20160",
        "11065",
        "30373",
        "20397",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "6967",
      "source": " Sahih Bukhari ",
      "chapter": "Blood Money (Ad-Diyat) - كتاب الديات",
      "chapter_no": "88",
      "text_ar": "حدثنا فروة، حدثنا علي بن مسهر، عن هشام، عن أبيه، عن عائشة، هزم المشركون يوم أحد‏.‏ وحدثني محمد بن حرب، حدثنا أبو مروان، يحيى بن أبي زكرياء عن هشام، عن عروة، عن عائشة  رضى الله عنها  قالت صرخ إبليس يوم أحد في الناس يا عباد الله أخراكم‏.‏ فرجعت أولاهم على أخراهم حتى قتلوا اليمان فقال حذيفة أبي أبي‏.‏ فقتلوه، فقال حذيفة غفر الله لكم‏.‏ قال وقد كان انهزم منهم قوم حتى لحقوا بالطائف‏.‏",
      "text_en": " Narrated `Aisha:                     The pagans were defeated on the day (of the battle) of Uhud. Satan shouted among the people on the day of Uhud, \"O Allah's worshippers! Beware of what is behind you!\" So the front file of the army attacked the back files (mistaking them for the enemy) till they killed Al-Yaman. Hudhaifa (bin Al- Yaman) shouted, \"My father!\" My father! But they killed him. Hudhaifa said, \"May Allah forgive you.\" (The narrator added: Some of the defeated pagans fled till they reached Taif.)",
      "chain": [
        "30207",
        "20345",
        "11065",
        "10511",
        "30373",
        "20397",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "7458",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثني محمد بن حرب، حدثنا يحيى بن أبي زكرياء الغساني، عن هشام، عن عروة، عن عائشة، أن رسول الله صلى الله عليه وسلم خطب الناس فحمد الله وأثنى عليه وقال ‏\"‏ ما تشيرون على في قوم يسبون أهلي ما علمت عليهم من سوء قط ‏\"‏‏.‏ وعن عروة قال لما أخبرت عائشة بالأمر قالت يا رسول الله أتأذن لي أن أنطلق إلى أهلي‏.‏ فأذن لها وأرسل معها الغلام‏.‏ وقال رجل من الأنصار سبحانك ما يكون لنا أن نتكلم بهذا، سبحانك هذا بهتان عظيم‏.‏",
      "text_en": " Narrated Aisha:                     Allah's Apostle addressed the people, and after praising and glorifying Allah, he said, \"What do you suggest me regarding those people who are abusing my wife? I have never known anything bad about her.\" The sub-narrator, `Urwa, said: When `Aisha was told of the slander, she said, \"O Allah's Apostle! Will you allow me to go to my parents' home?\" He allowed her and sent a slave along with her. An Ansari man said, \"Subhanaka! It is not right for us to speak about this. Subhanaka! This is a great lie!\"",
      "chain": [
        "30373",
        "20397",
        "11065",
        "10511",
        "53"
      ]
    }
  ],
  "total_hadiths": 3
}