{
  "id": "20394",
  "name": "Zuhayr bin Muhammad al-Tamimi زهير بن محمد التميمي",
  "full_name": "Zuhayr bin Muhammad al-Tamimi زهير بن محمد التميمي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "162",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Khurasan",
      "al-Syria",
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]",
      "Hadith"
    ],
    "tags": [
      "al-Tamimi",
      "al-Khurasni",
      "al-Sham",
      "Hafiz"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11163",
      "name": "Zayd bin Aslam زيد بن أسلم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11858",
      "name": "Sharayk bin 'Abdullah bin Abi Namr شريك بن عبد الله بن أبي نمر",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "12246",
      "name": "'Abdullah bin Muhammad bin 'Aqil عبد الله بن محمد بن عقيل بن أبي طالب",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11048",
      "name": "Muhammad bin al-Munkdar bin 'Abdullah محمد بن المنكدر بن عبد الله بن الهدير",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11106",
      "name": "Musa bin 'Uqba موسى بن عقبة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19823",
      "name": "Musa bin Wardan موسى بن وردان القرشي العامري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10898",
      "name": "Ja'far bin Muhammad bin 'Ali جعفر بن محمد بن علي - الصادق",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11172",
      "name": "Abu Hazim, Salma bin Dinar سلمة بن دينار أبو حازم الأعرج",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11176",
      "name": "Salah bin Kaysan al-Madni صالح بن كيسان المدني أبو محمد",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10602",
      "name": "'Amr bin Sa'id bin al-As عمرو بن سعيد بن العاص- الأشدق",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "20547",
      "name": "Sulaiman bin Da'ud bin al-Jarud سليمان بن داود أبو داود الطيالسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20229",
      "name": "Ruh bin 'Ubada bin al-'Ala' روح بن عبادة بن العلاء",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20443",
      "name": "Abu 'Amir al-'Aqdi عبد الملك بن عمرو القيسي أبو عامر العقدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20365",
      "name": "Yahya bin Abi Bkyr يحيى بن أبي بكير واسمه نسر",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20290",
      "name": "Abu Hudhayfa al-Nahdi موسى بن مسعود أبو حذيفة النهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "5701",
      "source": " Sahih Bukhari ",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا عبد الملك بن عمرو، حدثنا زهير بن محمد، عن محمد بن عمرو بن حلحلة، عن عطاء بن يسار، عن أبي سعيد الخدري، وعن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ ما يصيب المسلم من نصب ولا وصب ولا هم ولا حزن ولا أذى ولا غم حتى الشوكة يشاكها، إلا كفر الله بها من خطاياه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri and Abu Huraira:                     The Prophet said, \"No fatigue, nor disease, nor sorrow, nor sadness, nor hurt, nor distress befalls a Muslim, even if it were the prick he receives from a thorn, but that Allah expiates some of his sins for that.\"",
      "chain": [
        "30351",
        "20394",
        "11537",
        "11020",
        "38",
        "13"
      ]
    },
    {
      "hadith_no": "482",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن أبي بكير، حدثنا زهير بن محمد، عن سهيل بن أبي صالح، عن النعمان بن أبي عياش، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن أدنى أهل الجنة منزلة رجل صرف الله وجهه عن النار قبل الجنة ومثل له شجرة ذات ظل فقال أى رب قدمني إلى هذه الشجرة أكون في ظلها ‏\"‏ ‏.‏ وساق الحديث بنحو حديث ابن مسعود ولم يذكر ‏\"‏ فيقول يا ابن آدم ما يصريني منك ‏\"‏ ‏.‏ إلى آخر الحديث وزاد فيه ‏\"‏ ويذكره الله سل كذا وكذا فإذا انقطعت به الأماني قال الله هو لك وعشرة أمثاله - قال - ثم يدخل بيته فتدخل عليه زوجتاه من الحور العين فتقولان الحمد لله الذي أحياك لنا وأحيانا لك - قال - فيقول ما أعطي أحد مثل ما أعطيت ‏\"‏ ‏.‏",
      "text_en": " It is transmitted from Abu Sa'id al-Khudri that, verily, the Messenger of Allah (may peace be upon him) said:                      Amongst the inhabitants of Paradise the lowest in rank will be the person whose face Allah would turn away from the Fire towards the Paradise, and make a shady tree appear before him. He would say: O my Lord! direct my steps to this tree so that I (should enjoy) its shade; and the rest of the hadith is like that narrated by Ibn Mas'ud, but he did not mention:\" He (Allah) would say: O son of Adam! what will bring an end to your making requests to Me\" to the end of the tradition. In it, he added: Allah will remind him: Ask such and such, and when his expectations would be realised, Allah would say: That is for you, and ten times as much. He said that he would then enter his house and his two wives with large and dark eyes would enter after him. They will say: Praise be to Allah, Who has created you for us and us for you. He will say: No one has been given the like of what I have been given.",
      "chain": [
        "30201",
        "20365",
        "20394",
        "11173",
        "11542",
        "38"
      ]
    },
    {
      "hadith_no": "536",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن أبي بكير، حدثنا زهير بن محمد، عن سهيل بن أبي صالح، عن النعمان بن أبي عياش، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن أدنى أهل النار عذابا ينتعل بنعلين من نار يغلي دماغه من حرارة نعليه ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported:                      Verily, the Messenger of Allah (may peace be upon him) said: The least tormented of the inhabitants of the Fire would be he who would wear two shoes of Fire and his brain would boil on account of the heat of the shoes.",
      "chain": [
        "30201",
        "20365",
        "20394",
        "11173",
        "11542",
        "38"
      ]
    },
    {
      "hadith_no": "0",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا زهير بن حرب، وغيره، قالا حدثنا عبد الملك بن عمرو، حدثنا زهير بن محمد، عن عبد الله بن محمد بن عقيل، عن إبراهيم بن محمد بن طلحة، عن عمه، عمران بن طلحة عن أمه، حمنة بنت جحش قالت كنت أستحاض حيضة كثيرة شديدة فأتيت رسول الله صلى الله عليه وسلم أستفتيه وأخبره فوجدته في بيت أختي زينب بنت جحش فقلت يا رسول الله إني امرأة أستحاض حيضة كثيرة شديدة فما ترى فيها قد منعتني الصلاة والصوم فقال ‏\"‏ أنعت لك الكرسف فإنه يذهب الدم ‏\"‏ ‏.‏ قالت هو أكثر من ذلك ‏.‏ قال ‏\"‏ فاتخذي ثوبا ‏\"‏ ‏.‏ فقالت هو أكثر من ذلك إنما أثج ثجا ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ سآمرك بأمرين أيهما فعلت أجزأ عنك من الآخر وإن قويت عليهما فأنت أعلم ‏\"‏ ‏.‏ فقال لها ‏\"‏ إنما هذه ركضة من ركضات الشيطان فتحيضي ستة أيام أو سبعة أيام في علم الله ثم اغتسلي حتى إذا رأيت أنك قد طهرت واستنقأت فصلي ثلاثا وعشرين ليلة أو أربعا وعشرين ليلة وأيامها وصومي فإن ذلك يجزئك وكذلك فافعلي في كل شهر كما تحيض النساء وكما يطهرن ميقات حيضهن وطهرهن وإن قويت على أن تؤخري الظهر وتعجلي العصر فتغتسلين وتجمعين بين الصلاتين الظهر والعصر وتؤخرين المغرب وتعجلين العشاء ثم تغتسلين وتجمعين بين الصلاتين فافعلي وتغتسلين مع الفجر فافعلي وصومي إن قدرت على ذلك ‏\"‏ ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ وهذا أعجب الأمرين إلى ‏\"‏ ‏.1قال أبو داود ورواه عمرو بن ثابت عن ابن عقيل قال فقالت حمنة فقلت هذا أعجب الأمرين إلى ‏.‏2 لم يجعله من قول النبي صلى الله عليه وسلم جعله كلام حمنة ‏.‏ قال أبو داود وعمرو بن ثابت رافضي رجل سوء ولكنه كان صدوقا في الحديث وثابت بن المقدام رجل ثقة وذكره عن يحيى بن معين ‏.‏ قال أبو داود سمعت أحمد يقول حديث ابن عقيل في نفسي منه شىء ‏.‏",
      "text_en": " Narrated Hamnah daughter of Jahsh:                     Hamnah said my menstruation was great in quantity and severe. So I came to the Messenger of Allah (ﷺ) for a decision and told him. I found him in the house of my sister, Zaynab, daughter of Jahsh.  I said: Messenger of Allah, I am a woman who menstruates in great quantity and it is severe, so what do you think about it? It has prevented me from praying and fasting.  He said: I suggest that you should use cotton, for it absorbs the blood.  She replied: It is too copious for that.  He said: Then take a cloth.  She replied: It is too copious for that, for my blood keeps flowing.  The Messenger of Allah (ﷺ) said: I shall give you two commands; whichever of them you follow, that will be sufficient for you without the other, but you know best whether you are strong enough to follow both of them.  He added: This is a stroke of the Devil, so observe your menses for six or seven days, Allah alone knows which it should be; then wash. And when you see that you are purified and quite clean, pray during twenty-three or twenty-four days and nights and fast, for that will be enough for you, and do so every month, just as women menstruate and are purified at the time of their menstruation and their purification.  But if you are strong enough to delay the noon (Zuhr) prayer and advance the afternoon ('Asr) prayer, to wash, and then combine the noon and the afternoon prayer; to delay the sunset prayer and advance the night prayer, to wash, and then combine the two prayers, do so: and to wash at dawn, do so: and fast if you are able to do so if possible.The Messenger of Allah (ﷺ) said: Of the two commands this is more to my liking.1Abu Dawud said: 'Amr b. Thabit narrated from Ibn 'Aqil: Hamnah said: Of the two commands this is the one which is more to my liking.2 In this version these words were not quoted as the statement of the Prophet (ﷺ); it gives it as a statement of Hamnah.Abu Dawud said: 'Amr b. Thabit was a Rafidi. This has been said by Yahya b. Ma'in.Abu Dawud said: I heard Ahmad (b. Hanbal) say: I am doubtful about the tradition transmitted by Ibn 'Aqil.",
      "chain": [
        "30022",
        "20443",
        "20394",
        "12246",
        "11827",
        "578",
        "72"
      ]
    },
    {
      "hadith_no": "1355",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عاصم، حدثنا زهير بن محمد، عن شريك بن عبد الله بن أبي نمر، عن كريب، عن الفضل بن عباس، قال ‏:‏ بت ليلة عند النبي صلى الله عليه وسلم لأنظر كيف يصلي فقام فتوضأ ثم صلى ركعتين قيامه مثل ركوعه، وركوعه مثل سجوده، ثم نام، ثم استيقظ فتوضأ واستن ثم قرأ بخمس آيات من آل عمران ‏{‏ إن في خلق السموات والأرض واختلاف الليل والنهار ‏}‏ فلم يزل يفعل هذا حتى صلى عشر ركعات، ثم قام فصلى سجدة واحدة فأوتر بها، ونادى المنادي عند ذلك، فقام رسول الله صلى الله عليه وسلم بعد ما سكت المؤذن فصلى سجدتين خفيفتين، ثم جلس حتى صلى الصبح ‏.‏ قال أبو داود ‏:‏ خفي على من ابن بشار بعضه ‏.‏",
      "text_en": " Narrated Fadl b. 'Abbas:                     I spent a night with the Prophet (ﷺ) to see how he prayed. He got up, performed ablution and prayed two rak'ahs. His standing was like his bowing (i.e. equal in duration), and his bowing was like his prostration (equal in length). Then he slept. Afterwards he awoke, performed ablution, and used tooth-stick. He then recited five verses from Surah Al-'Imran : \"In the creation of the heavens and the earth and the alternation of night and day\". He went on doing so till he prayed ten rak'ahs. He then stood up and prayed one rak'ah observing witr with it. In the meantime the mu'adhdhin called to prayer. The Messenger of Allah (ﷺ) stood up after the mu'adhdhin had kept silent. He prayed two light rak'ahs and remained sitting till he offered the dawn prayer.Abu Dawud said: A part of the tradition transmitted by Ibn Bashshar remained hidden from me.",
      "chain": [
        "30160",
        "20241",
        "20394",
        "11858",
        "11211",
        "135"
      ]
    },
    {
      "hadith_no": "2715",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن عوف، قال حدثنا موسى بن أيوب، قال حدثنا الوليد بن مسلم، قال حدثنا زهير بن محمد، عن عمرو بن شعيب، عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم وأبا بكر وعمر حرقوا متاع الغال وضربوه ‏.‏ قال أبو داود وزاد فيه علي بن بحر عن الوليد - ولم أسمعه منه - ومنعوه سهمه ‏.‏ قال أبو داود وحدثنا به الوليد بن عتبة وعبد الوهاب بن نجدة قالا حدثنا الوليد عن زهير بن محمد عن عمرو بن شعيب قوله ولم يذكر عبد الوهاب بن نجدة الحوطي منع سهمه ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Messenger of Allah (ﷺ), AbuBakr and Umar burned the belongings of anyone who had been dishonest about booty and beat him.Abu Dawud said: 'Ali b. Bahr added on the authority of al-Walid, and I did not hear (a tradition) from him: And they denied him his share.\"Abu Dawud said: This tradition has also been transmitted by al-Walid b. 'Utbah from 'Abd al-Wahhab b. Najdah; They said: This has been transmitted by al-Walid, from Zuhair b. Muhammad, from 'Amr b. Shu'aib. 'Abd al-Wahhab b. Najdah al-Huti did not mention the words \"He denied him his share\" (as narrated by 'Ali b. Bahr from al-Walid).",
      "chain": [
        "38566",
        "20733",
        "20394",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "2932",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا موسى بن عامر المري، حدثنا الوليد، حدثنا زهير بن محمد، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أراد الله بالأمير خيرا جعل له وزير صدق إن نسي ذكره وإن ذكر أعانه وإذا أراد الله به غير ذلك جعل له وزير سوء إن نسي لم يذكره وإن ذكر لم يعنه ‏\"‏ ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) said: When Allah has a good purpose for a ruler, He appoints for him a sincere minister who reminds him if he forgets and helps him if he remembers; but when Allah has a different purpose from that for him. He appoints for him an evil minister who does not remind him if he forgets and does not help him if he remembers.",
      "chain": [
        "37537",
        "20733",
        "20394",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "4309",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا القاسم بن أحمد البغدادي، حدثنا أبو عامر، عن زهير بن محمد، عن موسى بن جبير، عن أبي أمامة بن سهل بن حنيف، عن عبد الله بن عمرو، عن النبي صلى الله عليه وسلم قال ‏\"‏ اتركوا الحبشة ما تركوكم فإنه لا يستخرج كنز الكعبة إلا ذو السويقتين من الحبشة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: Leave the Abyssinians alone as long as they leave you alone, for it is only the Abyssinian with short legs who will seek to take out the treasure of the Ka'bah.",
      "chain": [
        "20443",
        "20394",
        "21181",
        "405",
        "29"
      ]
    },
    {
      "hadith_no": "4833",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن بشار، حدثنا أبو عامر، وأبو داود قالا حدثنا زهير بن محمد، قال حدثني موسى بن وردان، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ الرجل على دين خليله فلينظر أحدكم من يخالل ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: A man follows the religion of his friend; so each one should consider whom he makes his friend.",
      "chain": [
        "30160",
        "20443",
        "30002",
        "20394",
        "13"
      ]
    },
    {
      "hadith_no": "128",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، حدثنا زهير بن محمد، عن عبد الله بن محمد بن عقيل، عن إبراهيم بن محمد بن طلحة، عن عمه، عمران بن طلحة عن أمه، حمنة بنت جحش قالت كنت أستحاض حيضة كثيرة شديدة فأتيت النبي صلى الله عليه وسلم أستفتيه وأخبره فوجدته في بيت أختي زينب بنت جحش فقلت يا رسول الله إني أستحاض حيضة كثيرة شديدة فما تأمرني فيها قد منعتني الصيام والصلاة قال ‏\"‏ أنعت لك الكرسف فإنه يذهب الدم ‏\"‏ ‏.‏ قالت هو أكثر من ذلك قال ‏\"‏ فتلجمي ‏\"‏ ‏.‏ قالت هو أكثر من ذلك قال ‏\"‏ فاتخذي ثوبا ‏\"‏ ‏.‏ قالت هو أكثر من ذلك إنما أثج ثجا فقال النبي صلى الله عليه وسلم ‏\"‏ سآمرك بأمرين أيهما صنعت أجزأ عنك فإن قويت عليهما فأنت أعلم ‏\"‏ ‏.‏ فقال ‏\"‏ إنما هي ركضة من الشيطان فتحيضي ستة أيام أو سبعة أيام في علم الله ثم اغتسلي فإذا رأيت أنك قد طهرت واستنقأت فصلي أربعا وعشرين ليلة أو ثلاثا وعشرين ليلة وأيامها وصومي وصلي فإن ذلك يجزئك وكذلك فافعلي كما تحيض النساء وكما يطهرن لميقات حيضهن وطهرهن فإن قويت على أن تؤخري الظهر وتعجلي العصر ثم تغتسلين حين تطهرين وتصلين الظهر والعصر جميعا ثم تؤخرين المغرب وتعجلين العشاء ثم تغتسلين وتجمعين بين الصلاتين فافعلي وتغتسلين مع الصبح وتصلين وكذلك فافعلي وصومي إن قويت على ذلك ‏\"‏ ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ وهو أعجب الأمرين إلى ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ ورواه عبيد الله بن عمرو الرقي وابن جريج وشريك عن عبد الله بن محمد بن عقيل عن إبراهيم بن محمد بن طلحة عن عمه عمران عن أمه حمنة إلا أن ابن جريج يقول عمر بن طلحة والصحيح عمران بن طلحة ‏.‏ قال وسألت محمدا عن هذا الحديث فقال هو حديث حسن صحيح ‏.‏ وهكذا قال أحمد بن حنبل هو حديث حسن صحيح ‏.‏ وقال أحمد وإسحاق في المستحاضة إذا كانت تعرف حيضها بإقبال الدم وإدباره وإقباله أن يكون أسود ‏.‏ وإدباره أن يتغير إلى الصفرة فالحكم لها على حديث فاطمة بنت أبي حبيش وإن كانت المستحاضة لها أيام معروفة قبل أن تستحاض فإنها تدع الصلاة أيام أقرائها ثم تغتسل وتتوضأ لكل صلاة وتصلي وإذا استمر بها الدم ولم يكن لها أيام معروفة ولم تعرف الحيض بإقبال الدم وإدباره فالحكم لها على حديث حمنة بنت جحش ‏.‏ وكذلك قال أبو عبيد ‏.‏ وقال الشافعي المستحاضة إذا استمر بها الدم في أول ما رأت فدامت على ذلك فإنها تدع الصلاة ما بينها وبين خمسة عشر يوما فإذا طهرت في خمسة عشر يوما أو قبل ذلك فإنها أيام حيض فإذا رأت الدم أكثر من خمسة عشر يوما فإنها تقضي صلاة أربعة عشر يوما ثم تدع الصلاة بعد ذلك أقل ما تحيض النساء وهو يوم وليلة ‏.‏ قال أبو عيسى واختلف أهل العلم في أقل الحيض وأكثره فقال بعض أهل العلم أقل الحيض ثلاثة وأكثره عشرة ‏.‏ وهو قول سفيان الثوري وأهل الكوفة وبه يأخذ ابن المبارك وروي عنه خلاف هذا ‏.‏ وقال بعض أهل العلم منهم عطاء بن أبي رباح أقل الحيض يوم وليلة وأكثره خمسة عشر يوما ‏.‏ وهو قول مالك والأوزاعي والشافعي وأحمد وإسحاق وأبي عبيد ‏.‏",
      "text_en": " Hamnah bint Jahsh narrated:                     \"I had a case of blood flow that was severe and excessive. So I went to the Prophet to inform him and ask him about it. I found him in the house of my sister Zainab bint Jahsh. I said, 'O Messenger of Allah! I suffer from a case of severe and excessive blood flow. So what do you order me to do for it, and does this prevent me from fasting and performing Salat?' He said: 'Tie a cotton rag around yourself and the bIood will go away.' I said, 'It is more than that.' He said: 'Make it tight.' I said, 'It is more than that.' He said: 'Then use a cloth (to bind it).' I said, it is more than that. It flows too much.' So the Prophet said: 'I will order you to do one of two things, which ever of them you do, it will be acceptable for you. You should know which of them you are able to do.' Then he said: 'This is only a blow from Shaitan. Menstruate for six or seven days, which Allah knows, then perform Ghusl. When you see that you have become pure and clean, then perform Salat for twenty-three or twenty-four nights and their days. Perform Salat and fast, and that will be acceptable for you. So do this (if you can) just as (other) women who menstruate and become pure during their periods of menstruation and purity. If (not, and) you are able to delay Zuhr and hasten Asr then perform Ghusl when you have become pure, and pray Zuhr and Asr together. Then delay Maghrib and hasten Isha, then perform Ghusl and combine the two prayers. So do this (if you are able). Then perform Ghusl with the dawn and pray. Do this, and fast if you are able to do so.' Then Allah's Messenger said: 'That is what is preferable to me of the two.'\"",
      "chain": [
        "30160",
        "20443",
        "20394",
        "12246",
        "11827",
        "578",
        "72"
      ]
    },
    {
      "hadith_no": "296",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن يحيى النيسابوري، حدثنا عمرو بن أبي سلمة أبو حفص التنيسي، عن زهير بن محمد، عن هشام بن عروة، عن أبيه، عن عائشة، أن رسول الله صلى الله عليه وسلم كان يسلم في الصلاة تسليمة واحدة تلقاء وجهه يميل إلى الشق الأيمن شيئا ‏.‏ قال وفي الباب عن سهل بن سعد ‏.‏ قال أبو عيسى وحديث عائشة لا نعرفه مرفوعا إلا من هذا الوجه ‏.‏ قال محمد بن إسماعيل زهير بن محمد أهل الشأم يروون عنه مناكير ورواية أهل العراق عنه أشبه وأصح ‏.‏ قال محمد وقال أحمد بن حنبل كأن زهير بن محمد الذي كان وقع عندهم ليس هو هذا الذي يروى عنه بالعراق كأنه رجل آخر قلبوا اسمه ‏.‏ قال أبو عيسى وقد قال به بعض أهل العلم في التسليم في الصلاة وأصح الروايات عن النبي صلى الله عليه وسلم تسليمتان وعليه أكثر أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين ومن بعدهم ‏.‏ ورأى قوم من أصحاب النبي صلى الله عليه وسلم وغيرهم تسليمة واحدة في المكتوبة ‏.‏ قال الشافعي إن شاء سلم تسليمة واحدة وإن شاء سلم تسليمتين ‏.‏",
      "text_en": " Aishah narrated:                     \"Allah's Messenger would say one Taslim for the Salat while facing forward and turning to his right side a little.\"",
      "chain": [
        "11222",
        "20394",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1111",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا علي بن حجر، أخبرنا الوليد بن مسلم، عن زهير بن محمد، عن عبد الله بن محمد بن عقيل، عن جابر بن عبد الله، عن النبي صلى الله عليه وسلم قال ‏\"‏ أيما عبد تزوج بغير إذن سيده فهو عاهر ‏\"‏ ‏.‏ قال وفي الباب عن ابن عمر ‏.‏ قال أبو عيسى حديث جابر حديث حسن ‏.‏ وروى بعضهم هذا الحديث عن عبد الله بن محمد بن عقيل عن ابن عمر عن النبي صلى الله عليه وسلم ‏.‏ ولا يصح والصحيح عن عبد الله بن محمد بن عقيل عن جابر ‏.‏ والعمل على هذا عند أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم أن نكاح العبد بغير إذن سيده لا يجوز ‏.‏ وهو قول أحمد وإسحاق وغيرهما ‏بلا اختلاف.",
      "text_en": " Jabir bin Abdullah narrated that:                     The Prophet said: \"Whichever slave gets married without the permission of his owner, then he is a fornicator.\"",
      "chain": [
        "20387",
        "20733",
        "20394",
        "12246",
        "34"
      ]
    },
    {
      "hadith_no": "2378",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر، وأبو داود قالا حدثنا زهير بن محمد، حدثني موسى بن وردان، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الرجل على دين خليله فلينظر أحدكم من يخالل ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah(s.a.w) said:                     \"A man is upon the religion of his friend, so let one of you look at whom he befriends.\"",
      "chain": [
        "30160",
        "20443",
        "20547",
        "20394",
        "13"
      ]
    },
    {
      "hadith_no": "3536",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا علي بن حجر، أخبرنا الوليد بن مسلم، عن زهير بن محمد، عن رجل، عن أبي العالية، عن أبى بن كعب، قال سألت رسول الله صلى الله عليه وسلم عن قول الله تعالى ‏:‏ ‏(‏ وأرسلناه إلى مائة ألف أو يزيدون ‏)‏ قال ‏\"‏ عشرون ألفا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏",
      "text_en": " Narrated Ubayy bin Ka'b:                     \"I asked the Messenger of Allah (ﷺ) about the saying of Allah, Most High: 'And We sent him to a hundred thousand, or even more (37:147). He said: 'Twenty thousand (more).'\"",
      "chain": [
        "20387",
        "20733",
        "20394",
        "11618",
        "39"
      ]
    },
    {
      "hadith_no": "3602",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد الرحمن بن واقد أبو مسلم السعدي، حدثنا الوليد بن مسلم، عن زهير بن محمد، عن محمد بن المنكدر، عن جابر، رضى الله عنه قال خرج رسول الله صلى الله عليه وسلم على أصحابه فقرأ عليهم سورة الرحمن من أولها إلى آخرها فسكتوا فقال ‏\"‏ لقد قرأتها على الجن ليلة الجن فكانوا أحسن مردودا منكم كنت كلما أتيت على قوله ‏:‏ ‏(‏ فبأى آلاء ربكما تكذبان ‏)‏ قالوا لا بشيء من نعمك ربنا نكذب فلك الحمد ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب لا نعرفه إلا من حديث الوليد بن مسلم عن زهير بن محمد ‏.‏ قال أحمد بن حنبل كأن زهير بن محمد الذي وقع بالشام ليس هو الذي يروى عنه بالعراق كأنه رجل آخر قلبوا اسمه يعني لما يروون عنه من المناكير ‏.‏ وسمعت محمد بن إسماعيل البخاري يقول أهل الشام يروون عن زهير بن محمد مناكير وأهل العراق يروون عنه أحاديث مقاربة ‏.‏",
      "text_en": " Muhammad bin Al Munkadir narrated that:                     Jabir [may Allah be pleased with him] said: “The Messenger of Allah came out to his Companions, and recited Surat Ar-Rahman from its beginning to its end for them, and they were silent. So he said: ‘I recited it to the Jinns on the ‘Night of the Jinns,’ and they had a better response to it than you did. Each time I came to Allah’s saying: ‘Which of your Lords favor do you deny.’ They said: “We do not deny any of Your favors our Lord! And Yours is praise.”",
      "chain": [
        "20733",
        "20394",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "3972",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، حدثنا زهير بن محمد، عن عبد الله بن محمد بن عقيل، عن الطفيل بن أبى بن كعب، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ مثلي في النبيين كمثل رجل بنى دارا فأحسنها وأكملها وأجملها وترك منها موضع لبنة فجعل الناس يطوفون بالبناء ويعجبون منه ويقولون لو تم موضع تلك اللبنة وأنا في النبيين موضع تلك اللبنة ‏\"‏ ‏.‏",
      "text_en": " Narrated At-Tufail bin Ubayy bin Ka'b:                     from his father that the Messenger of Allah (ﷺ) said: \"The parable of me and the Prophets is that of a man who built a house, and he built it well, completing it, and beautifying it, but he left a space for one brick. So the people began going around the house amazed at it, saying \"If only the space for that brick was filled.' And I am, with regards to the Prophets, in the position of that brick.\"And with this chain, from the Prophet (ﷺ) that he said: \"Upon the Day of Judgement I will be the leader of the Prophets and their spokesman, and the bearer of their intercession, without bragging.\"",
      "chain": [
        "30160",
        "20443",
        "20394",
        "12246",
        "18938"
      ]
    },
    {
      "hadith_no": "4273",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن بشار، حدثنا أبو عامر، عن زهير بن محمد، عن عبد الله بن محمد بن عقيل، عن الطفيل بن أبى بن كعب، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لولا الهجرة لكنت امرأ من الأنصار ‏\"‏ ‏.‏",
      "text_en": " Narrated Ubayy bin Ka'b:                     Ubayy bin Ka'bthat the Messenger of Allah (ﷺ) said: \"If it were not for the Hijrah, I would be a man from the Ansar.\"",
      "chain": [
        "30160",
        "20443",
        "20394",
        "12246",
        "18938"
      ]
    },
    {
      "hadith_no": "462",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن أبي بكير، حدثنا زهير بن محمد، عن عبد الله بن محمد بن عقيل، عن سعيد بن المسيب، عن أبي سعيد الخدري، أنه سمع رسول الله  صلى الله عليه وسلم  قال ‏\"‏ ألا أدلكم على ما يكفر الله به الخطايا ويزيد به في الحسنات ‏\"‏ ‏.‏ قالوا بلى يا رسول الله ‏.‏ قال ‏\"‏ إسباغ الوضوء على المكاره وكثرة الخطا إلى المساجد وانتظار الصلاة بعد الصلاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Khudri that he heard :                     The Messenger of Allah say: \"Shall I not tell you of something by means of which Allah expiates for sins and increases good deeds?\" They said: \"Yes, O Messenger of Allah.\" He said: \"Perform ablution properly despite difficulties, increasing the number of steps one takes towards the mosque and waiting for the next prayer after prayer.'\"",
      "chain": [
        "30201",
        "20365",
        "20394",
        "12246",
        "11002",
        "38"
      ]
    },
    {
      "hadith_no": "776",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن أبي بكير، حدثنا زهير بن محمد، عن عبد الله بن محمد بن عقيل، عن سعيد بن المسيب، عن أبي سعيد الخدري، أنه سمع رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ ألا أدلكم على ما يكفر الله به الخطايا ويزيد به في الحسنات ‏\"‏ ‏.‏ قالوا بلى يا رسول الله ‏.‏ قال ‏\"‏ إسباغ الوضوء عند المكاره وكثرة الخطى إلى المساجد وانتظار الصلاة بعد الصلاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Sa'eed Al-Khudri that :                     He heard the Messenger of Allah say: 'Shall I not tell you of something by means of which Allah expiates for sins and increases good deeds?' They said: 'Yes, O Messenger of Allah.' He said: 'Performing ablution properly despite difficulties, increasing the number of steps one takes towards the mosque and waiting for the next prayer after prayer.'",
      "chain": [
        "30201",
        "20365",
        "20394",
        "12246",
        "11002",
        "38"
      ]
    },
    {
      "hadith_no": "780",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book On The Mosques And The Congregations - كتاب المساجد والجماعات",
      "chapter_no": "4",
      "text_ar": "حدثنا إبراهيم بن محمد الحلبي، حدثنا يحيى بن الحارث الشيرازي، حدثنا زهير بن محمد التميمي، عن أبي حازم، عن سهل بن سعد الساعدي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ليبشر المشاءون في الظلم إلى المساجد بنور تام يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Sahl bin Sa'd As-Sa'idi said:                     \"The Messenger of Allah said: 'Give glad tidings, to those who walk to the mosques in the dark, of perfect light on the Day of Resurrection.'\"",
      "chain": [
        "28626",
        "20394",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "926",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن أبي بكير، حدثنا زهير بن محمد، عن عبد الله بن محمد بن عقيل، عن سعيد بن المسيب، عن أبي سعيد الخدري، أنه سمع رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ إذا قال الإمام سمع الله لمن حمده ‏.‏ فقولوا اللهم ربنا ولك الحمد ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed Al-Khudri that he heard the MessengerofAllah (ﷺ) say:                      “When the Imam says: ‘Sami’ Allahu limanhamidah(Allah hears those who praise Him),’ say: ‘Allahumma,Rabbana walakal-hamd (O Allah! O our Lord! To You is the praise).’”",
      "chain": [
        "30201",
        "20365",
        "20394",
        "12246",
        "11002",
        "38"
      ]
    },
    {
      "hadith_no": "972",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا هشام بن عمار، حدثنا عبد الملك بن محمد الصنعاني، حدثنا زهير بن محمد، عن هشام بن عروة، عن أبيه، عن عائشة، أن رسول الله  صلى الله عليه وسلم  كان يسلم تسليمة واحدة تلقاء وجهه ‏.‏",
      "text_en": " It wasnarrated from Hisham bin ‘Urwah, from his father, from‘Aishah,that the Messenger of Allah (saW) used to say one Salam, tothefront.",
      "chain": [
        "30288",
        "28372",
        "20394",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1137",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن أبي بكير، حدثنا زهير بن محمد، عن عبد الله بن محمد بن عقيل، عن عبد الرحمن بن يزيد الأنصاري، عن أبي لبابة بن عبد المنذر، قال قال النبي  صلى الله عليه وسلم  ‏\"‏ إن يوم الجمعة سيد الأيام وأعظمها عند الله وهو أعظم عند الله من يوم الأضحى ويوم الفطر فيه خمس خلال خلق الله فيه آدم وأهبط الله فيه آدم إلى الأرض وفيه توفى الله آدم وفيه ساعة لا يسأل الله فيها العبد شيئا إلا أعطاه ما لم يسأل حراما وفيه تقوم الساعة ما من ملك مقرب ولا سماء ولا أرض ولا رياح ولا جبال ولا بحر إلا وهن يشفقن من يوم الجمعة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Lubabah bin ‘Abdul-Mundhir said:                      “TheProphet(ﷺ) said: ‘Friday is the chief of days, the greatest daybeforeAllah. It is greater before Allah then the Day of Adha and theDay ofFitr. It has five characteristics: On it Allah created Adam; onitAllah sent down Adam to this earth; on it there is a time duringwhich a person does not ask Allah for anything but He will give it tohim, so long as he does not ask for anything that is forbidden; on itthe Hour will begin. There is no angel who is close to Allah, noheaven, no earth, no wind, no mountain, and no sea that does not fearFriday.’”",
      "chain": [
        "30201",
        "20365",
        "20394",
        "12246",
        "115"
      ]
    },
    {
      "hadith_no": "1393",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا زهير بن محمد، والحسن بن محمد بن الصباح، والعباس بن جعفر، ومحمد بن عمرو الحدثاني، قالوا حدثنا سنيد بن داود، حدثنا يوسف بن محمد بن المنكدر، عن أبيه، عن جابر بن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ قالت أم سليمان بن داود لسليمان يا بنى لا تكثر النوم بالليل فإن كثرة النوم بالليل تترك الرجل فقيرا يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Jabir bin ‘Abdullah said:                      “The Messenger ofAllah(ﷺ) said: ‘The mother of Sulaiman bin Dawud said to Sulaiman:“Omy son, do not sleep too much at night, for sleeping too much atnight will leave a man poor on the Day of Resurrection.”",
      "chain": [
        "20394",
        "30245",
        "11220",
        "38257",
        "28659",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "1831",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا زهير بن محمد، حدثنا عبد الرزاق، عن سفيان، عن عبد الله بن عطاء، عن ابن بريدة، عن أبيه، قال جاءت امرأة إلى النبي  صلى الله عليه وسلم  فقالت يا رسول الله إن أمي ماتت وعليها صوم أفأصوم عنها قال ‏\"‏ نعم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn Buraidah that his father said:                      “A woman cametothe Prophet (ﷺ) and said: ‘O Messenger of Allah, my mother hasdied and she owed a fast. Should I fast on her behalf?’ He said:‘Yes.’”",
      "chain": [
        "20394",
        "20121",
        "20012",
        "10785",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "1938",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا الحسن بن علي الخلال، وزهير بن محمد، ومحمد بن عبد الملك، قالوا حدثنا عبد الرزاق، عن معمر، عن ثابت، عن أنس بن مالك، أن المغيرة بن شعبة، أراد أن يتزوج، امرأة فقال له النبي  صلى الله عليه وسلم  ‏\"‏ اذهب فانظر إليها فإنه أحرى أن يؤدم بينكما ‏\"‏ ‏.‏ ففعل فتزوجها فذكر من موافقتها ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that:                     Mughirah bin Shubah wanted to marry a woman. The Prophet (ﷺ) said to him: “Go and look at her, for that is more likely to create love between you.” So he did that, and married her, and mentioned how well he got along with her.",
      "chain": [
        "30115",
        "20394",
        "20121",
        "20115",
        "11269",
        "19",
        "166"
      ]
    },
    {
      "hadith_no": "2330",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Rulings - كتاب الأحكام",
      "chapter_no": "13",
      "text_ar": "حدثنا إسحاق بن منصور، ومحمد بن معمر، وزهير بن محمد، قالوا حدثنا روح بن عبادة، حدثنا سعيد، عن قتادة، عن سعيد بن أبي بردة، عن أبيه، عن أبي موسى، أن رسول الله صلى الله عليه وسلم اختصم إليه رجلان بينهما دابة وليس لواحد منهما بينة فجعلها بينهما نصفين ‏.‏",
      "text_en": " It was narrated from Abu Musa that :                     two men referred a dispute to the Messenger of Allah (ﷺ) concerning an animal, and neither of them had proof, so he ruled that it should be divided in half.",
      "chain": [
        "30313",
        "30172",
        "20394",
        "20229",
        "11168",
        "11019",
        "11345",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "3651",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر، حدثنا يحيى بن أبي بكير، حدثنا زهير بن محمد، عن يزيد بن خصيفة، عن عمرو بن عبد الله بن كعب، عن نافع بن جبير، عن عثمان بن أبي العاص الثقفي، أنه قال قدمت على النبي  صلى الله عليه وسلم  وبي وجع قد كاد يبطلني فقال لي النبي  صلى الله عليه وسلم  ‏\"‏ اجعل يدك اليمنى عليه وقل بسم الله أعوذ بعزة الله وقدرته من شر ما أجد وأحاذر سبع مرات ‏\"‏ ‏.‏ فقلت ذلك فشفاني الله ‏.‏",
      "text_en": " It wasnarrated that ‘Uthman bin Abul-‘As Thaqafi said:                      “I came totheProphet (ﷺ) and I was suffering pain that was killing me. TheProphet (ﷺ) said to me: ‘Put your right hand on it and say:Bismillah, a’udhu bi’izzatil-lahi wa qudratihi min sharri maajidu wauhadhiru. (In the Name of Allah, I seek refuge in the mightand powerof Allah from the evil of what I feel and what I fear),”seven times.’I said that, and Allah healed me.”",
      "chain": [
        "20436",
        "20365",
        "20394",
        "11235",
        "19819",
        "11059",
        "3210"
      ]
    },
    {
      "hadith_no": "3738",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يحيى بن أبي بكير، حدثنا زهير بن محمد، عن عبد الله بن محمد بن عقيل، عن حمزة بن صهيب، أن عمر، قال لصهيب ما لك تكتني بأبي يحيى وليس لك ولد ‏.‏ قال كناني رسول الله  صلى الله عليه وسلم  بأبي يحيى ‏.‏",
      "text_en": " It was narrated from Hamzah bin Suhaib that Umar said to Suhaib:                     \"Why are you called Abu Yahya when you do not have a son?\" He said: \"The Messenger of Allah(ﷺ) gave me the Kunya of Abu Yahya.\"",
      "chain": [
        "30201",
        "20365",
        "20394",
        "12246",
        "18217",
        "3"
      ]
    },
    {
      "hadith_no": "3803",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا هشام بن خالد الأزرق أبو مروان، حدثنا الوليد بن مسلم، حدثنا زهير بن محمد، عن منصور بن عبد الرحمن، عن أمه، صفية بنت شيبة عن عائشة، قالت كان رسول الله  صلى الله عليه وسلم  إذا رأى ما يحب قال ‏\"‏ الحمد لله الذي بنعمته تتم الصالحات ‏\"‏ ‏.‏ وإذا رأى ما يكره قال ‏\"‏ الحمد لله على كل حال ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Aishah said:                     \"When the Messenger of Allah (ﷺ) saw something he liked, he would say: 'Al-hamdu lillahil-ladhi bi ni'matihi tatimmus-salihat (Praise is to Allah by Whose grace good deeds are completed).' And if he saw something that he disliked, he would say: 'Al-hamdu lillahi 'ala kulli hal (Praise is to Allah in all circumstances).'\"",
      "chain": [
        "37540",
        "20733",
        "20394",
        "11565",
        "2802",
        "53"
      ]
    }
  ],
  "total_hadiths": 30
}