{
  "id": "20395",
  "name": "'Abdur Rahman bin Yazid bin Jabir عبد الرحمن بن يزيد بن جابر الأزدي",
  "full_name": "'Abdur Rahman bin Yazid bin Jabir عبد الرحمن بن يزيد بن جابر الأزدي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "154",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Syria"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Azdi",
      "al-Shami"
    ]
  },
  "parents": [
    {
      "id": "17252",
      "name": "Yazid bin Jabir al-Azdi يزيد بن جابر الأزدي",
      "grade": "Follower(Tabi')"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "10885",
      "name": "Yazid bin Yazid bin Jabir يزيد بن يزيد بن جابر",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "children": [
    {
      "id": "20639",
      "name": "'Abdullah bin 'Abdur Rahman bin Yazid عبد الله بن عبد الرحمن بن يزيد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "teachers": [
    {
      "id": "11066",
      "name": "Makhul al-Shami/al-Damashiqi مكحول الشامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10877",
      "name": "Atyh bin Qays al-Klaby عطية بن قيس الكلابي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11415",
      "name": "'Umayr bin Han'i al-Ansi عمير بن هانئ العنسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10915",
      "name": "Sulaym bin 'Amir al-Kula'i al-Khaba'ri سليم بن عامر الكلاعي الخبائري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11670",
      "name": "Isma'il bin 'Ubaidullah bin Abi Muhajir إسماعيل بن عبيد الله بن أبي المهاجر",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11163",
      "name": "Zayd bin Aslam زيد بن أسلم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11168",
      "name": "Sa'id bin Abi Sa'id سعيد بن أبي سعيد كيسان المقبري",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "19896",
      "name": "al-Qasim bin 'Abdur Rahman القاسم بن عبد الرحمن",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10812",
      "name": "al-Qasim bin Mukhaymara القاسم بن مخيمرة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10978",
      "name": "Yahya bin Jabir al-Tai'i يحيى بن جابر الطائي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10968",
      "name": "Mamtur Abu Salam al-Aswad ممطور أبو سلام الأسود الحبشي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10917",
      "name": "Shrahyl bin Aadah, Abu al-Ash'ath شراحيل بن آدة أبو الأشعث الصنعاني",
      "grade": "Follower(Tabi') [2nd Generation]"
    },
    {
      "id": "10947",
      "name": "'Ata' bin Abi Muslim عطاء بن أبي مسلم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19929",
      "name": "'Ali bin Bdhymh علي بن بذيمة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10882",
      "name": "'Abdullah bin 'Amir عبد الله بن عامر بن يزيد بن تميم",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11014",
      "name": "Nafie' نافع مولى ابن عمر",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20639",
      "name": "'Abdullah bin 'Abdur Rahman bin Yazid عبد الله بن عبد الرحمن بن يزيد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "27536",
      "name": "'Umar bin Abd al-Wahd عمر بن عبد الواحد بن قيس السلمي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20413",
      "name": "Bashr bin Bakr al-Tunisi بشر بن بكر التنيسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20732",
      "name": "Muhammad bin Shu'aib bin Shabur محمد بن شعيب بن شابور",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20402",
      "name": "Yahya bin Hamza bin Waqd يحيى بن حمزة بن واقد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "24481",
      "name": "al-Walid bin Yazid al-Hadadi الوليد بن يزيد الهدادي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1084",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا قتيبة، قال حدثنا عبد الواحد، عن الأعمش، قال حدثنا إبراهيم، قال سمعت عبد الرحمن بن يزيد، يقول صلى بنا عثمان بن عفان  رضى الله عنه  بمنى أربع ركعات، فقيل ذلك لعبد الله بن مسعود  رضى الله عنه  فاسترجع ثم قال صليت مع رسول الله صلى الله عليه وسلم بمنى ركعتين، وصليت مع أبي بكر  رضى الله عنه  بمنى ركعتين، وصليت مع عمر بن الخطاب  رضى الله عنه  بمنى ركعتين، فليت حظي من أربع ركعات ركعتان متقبلتان‏.‏",
      "text_en": " Narrated `Abdur Rahman bin Yazid:                     We offered a four rak`at prayer at Mina behind Ibn `Affan . `Abdullah bin Mas`ud was informed about it. He said sadly, \"Truly to Allah we belong and truly to Him we shall return.\" And added, \"I prayed two rak`at with Allah's Apostle at Mina and similarly with Abu Bakr and with `Umar (during their caliphates).\" He further said, \"May I be lucky enough to have two of the four rak`at accepted (by Allah).\"",
      "chain": [
        "30367",
        "20256",
        "11060",
        "11051",
        "20395"
      ]
    },
    {
      "hadith_no": "1701",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عمرو بن خالد، حدثنا زهير، حدثنا أبو إسحاق، قال سمعت عبد الرحمن بن يزيد، يقول حج عبد الله  رضى الله عنه  فأتينا المزدلفة حين الأذان بالعتمة، أو قريبا من ذلك، فأمر رجلا فأذن وأقام، ثم صلى المغرب، وصلى بعدها ركعتين، ثم دعا بعشائه فتعشى، ثم أمر  أرى رجلا  فأذن وأقام  قال عمرو لا أعلم الشك إلا من زهير  ثم صلى العشاء ركعتين، فلما طلع الفجر قال إن النبي صلى الله عليه وسلم كان لا يصلي هذه الساعة إلا هذه الصلاة، في هذا المكان، من هذا اليوم‏.‏ قال عبد الله هما صلاتان تحولان عن وقتهما صلاة المغرب بعد ما يأتي الناس المزدلفة، والفجر حين يبزغ الفجر‏.‏ قال رأيت النبي صلى الله عليه وسلم يفعله‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Yazid:                     `Abdullah;- performed the Hajj and we reached Al-Muzdalifa at or about the time of the `Isha' prayer. He ordered a man to pronounce the Adhan and Iqama and then he offered the Maghrib prayer and offered two rak`at after it. Then he asked for his supper and took it, and then, I think, he ordered a man to pronounce the Adhan and Iqama (for the `Isha' prayer). (`Amr, a sub-narrator said: The intervening statement 'I think', was said by the sub-narrator Zuhair) (i.e. not by `Abdur-Rahman). Then `Abdullah offered two rak`at of `Isha' prayer. When the day dawned, `Abdullah said, \"The Prophet never offered any prayer at this hour except this prayer at this time and at this place and on this day.\" `Abdullah added, \"These two prayers are shifted from their actual times -- the Maghrib prayer (is offered) when the people reached Al-Muzdalifa and the Fajr (morning) prayer at the early dawn.\" `Abdullah added, \"I saw the Prophet doing that.\"",
      "chain": [
        "30237",
        "20321",
        "11049",
        "20395"
      ]
    },
    {
      "hadith_no": "1709",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن رجاء، حدثنا إسرائيل، عن أبي إسحاق، عن عبد الرحمن بن يزيد، قال خرجنا مع عبد الله  رضى الله عنه  إلى مكة، ثم قدمنا جمعا، فصلى الصلاتين، كل صلاة وحدها بأذان وإقامة، والعشاء بينهما، ثم صلى الفجر حين طلع الفجر، قائل يقول طلع الفجر‏.‏ وقائل يقول لم يطلع الفجر‏.‏ ثم قال إن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن هاتين الصلاتين حولتا عن وقتهما في هذا المكان المغرب والعشاء، فلا يقدم الناس جمعا حتى يعتموا، وصلاة الفجر هذه الساعة ‏\"‏‏.‏ ثم وقف حتى أسفر، ثم قال لو أن أمير المؤمنين أفاض الآن أصاب السنة‏.‏ فما أدري أقوله كان أسرع أم دفع عثمان  رضى الله عنه  فلم يزل يلبي حتى رمى جمرة العقبة يوم النحر‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Yazid:                     I went out with `Abdullah , to Mecca and when we proceeded to am' he offered the two prayers (the Maghrib and the `Isha') together, making the Adhan and Iqama separately for each prayer. He took his supper in between the two prayers. He offered the Fajr prayer as soon as the day dawned. Some people said, \"The day had dawned (at the time of the prayer),\" and others said, \"The day had not dawned.\" `Abdullah then said, \"Allah's Apostle said, 'These two prayers have been shifted from their stated times at this place only (at Al-Muzdalifa); first: The Maghrib and the `Isha'. So the people should not arrive at Al-Muzdalifa till the time of the `Isha' prayer has become due. The second prayer is the morning prayer which is offered at this hour.' \" Then `Abdullah stayed there till it became a bit brighter. He then said, \"If the chief of the believers hastened onwards to Mina just now, then he had indeed followed the Sunna.\" I do not know which proceeded the other, his (`Abdullah's) statement or the departure of `Uthman . `Abdullah was reciting Talbiya till he threw pebbles at the Jamrat-Al- `Aqaba on the Day of Nahr (slaughtering) (that is the 10th of Dhul-Hijja).",
      "chain": [
        "20245",
        "20311",
        "11049",
        "20395"
      ]
    },
    {
      "hadith_no": "1776",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا الحكم، عن إبراهيم، عن عبد الرحمن بن يزيد، أنه حج مع ابن مسعود  رضى الله عنه  فرآه يرمي الجمرة الكبرى بسبع حصيات، فجعل البيت عن يساره، ومنى عن يمينه، ثم قال هذا مقام الذي أنزلت عليه سورة البقرة‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Yazid:                     I performed Hajj with Ibn Mas`ud , and saw him doing Rami of the big Jamra (Jamrat-ul-Aqaba) with seven small pebbles, keeping the Ka`ba on his left side and Mina on his right. He then said, \"This is the place where the one on whom Surat-al-Baqara was revealed (i.e. Allah's Apostle ) stood.\"",
      "chain": [
        "20404",
        "20020",
        "11069",
        "11051",
        "20395"
      ]
    },
    {
      "hadith_no": "1777",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا مسدد، عن عبد الواحد، حدثنا الأعمش، قال سمعت الحجاج، يقول على المنبر السورة التي يذكر فيها البقرة، والسورة التي يذكر فيها آل عمران، والسورة التي يذكر فيها النساء‏.‏ قال فذكرت ذلك لإبراهيم، فقال حدثني عبد الرحمن بن يزيد أنه كان مع ابن مسعود  رضى الله عنه  حين رمى جمرة العقبة، فاستبطن الوادي، حتى إذا حاذى بالشجرة اعترضها، فرمى بسبع حصيات، يكبر مع كل حصاة، ثم قال من ها هنا والذي لا إله غيره قام الذي أنزلت عليه سورة البقرة صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Al-A`mash:                     I heard Al-Hajjaj saying on the pulpit, \"The Sura in which Al-Baqara (the cow) is mentioned and the Sura in which the family of `Imran is mentioned and the Sura in which the women (An-Nisa) is mentioned.\" I mentioned this to Ibrahim, and he said, `Abdur-Rahman bin Yazid told me, 'I was with Ibn Mas`ud, when he did the Rami of the Jamrat-ul-Aqaba. He went down the middle of the valley, and when he came near the tree (which was near the Jamra) he stood opposite to it and threw seven small pebbles and said: 'Allahu-Akbar' on throwing every pebble.' Then he said, 'By Him, except Whom none has the right to be worshipped, here (at this place) stood the one on whom Surat-al-Baqra was revealed (i.e. Allah's Apostle).' \"",
      "chain": [
        "30175",
        "20256",
        "11060",
        "20381",
        "20395"
      ]
    },
    {
      "hadith_no": "1945",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا عبد الله بن يوسف، حدثنا يحيى بن حمزة، عن عبد الرحمن بن يزيد بن جابر، أن إسماعيل بن عبيد الله، حدثه عن أم الدرداء، عن أبي الدرداء  رضى الله عنه  قال خرجنا مع النبي صلى الله عليه وسلم في بعض أسفاره في يوم حار حتى يضع الرجل يده على رأسه من شدة الحر، وما فينا صائم إلا ما كان من النبي صلى الله عليه وسلم وابن رواحة‏.‏",
      "text_en": " Narrated Abu Ad-Darda:                     We set out with Allah's Apostle on one of his journeys on a very hot day, and it was so hot that one had to put his hand over his head because of the severity of heat. None of us was fasting except the Prophet and Ibn Rawaha.",
      "chain": [
        "30355",
        "20402",
        "20395",
        "11457",
        "37"
      ]
    },
    {
      "hadith_no": "3808",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا سليمان بن حرب، حدثنا شعبة، عن أبي إسحاق، عن عبد الرحمن بن يزيد،، قال سألنا حذيفة عن رجل، قريب السمت والهدى من النبي صلى الله عليه وسلم حتى نأخذ عنه فقال ما أعرف أحدا أقرب سمتا وهديا ودلا بالنبي صلى الله عليه وسلم من ابن أم عبد‏.‏",
      "text_en": " Narrated `Abdur-Rahman bin Yazid:                     We asked Hudhaifa to tell us of a person resembling (to some extent) the Prophet in good appearance and straight forward behavior so that we may learn from him (good manners and acceptable conduct). Hudhaifa replied, \"I do not know anybody resembling the Prophet (to some extent) in appearance and conduct more than Ibn Um `Abd.",
      "chain": [
        "20193",
        "20020",
        "11049",
        "20395",
        "145"
      ]
    },
    {
      "hadith_no": "4755",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا آدم، حدثنا شعبة، عن أبي إسحاق، قال سمعت عبد الرحمن بن يزيد، قال سمعت ابن مسعود  رضى الله عنه  قال في بني إسرائيل والكهف ومريم إنهن من العتاق الأول، وهن من تلادي‏.‏ قال ابن عباس ‏{‏فسينغضون‏}‏ يهزون‏.‏ وقال غيره نغضت سنك أى تحركت‏.‏",
      "text_en": " Narrated Ibn Mas`ud:                     Surat Bani Israel and Al-Kahf and Mary are among my first old property.",
      "chain": [
        "20404",
        "20020",
        "11049",
        "20395",
        "16"
      ]
    },
    {
      "hadith_no": "4786",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن بشار، حدثنا غندر، حدثنا شعبة، عن أبي إسحاق، قال سمعت عبد الرحمن بن يزيد، عن عبد الله، قال بني إسرائيل والكهف ومريم وطه والأنبياء هن من العتاق الأول، وهن من تلادي‏.‏ وقال قتادة ‏{‏جذاذا‏}‏ قطعهن‏.‏ وقال الحسن ‏{‏في فلك‏}‏ مثل فلكة المغزل ‏{‏يسبحون‏}‏ يدورون‏.‏ قال ابن عباس ‏{‏نفشت‏}‏ رعت ‏{‏يصحبون‏}‏ يمنعون‏.‏ ‏{‏أمتكم أمة واحدة‏}‏ قال دينكم دين واحد‏.‏ وقال عكرمة‏.‏ ‏{‏حصب‏}‏ حطب بالحبشية‏.‏ وقال غيره ‏{‏أحسوا‏}‏ توقعوه من أحسست‏.‏ ‏{‏خامدين‏}‏ هامدين‏.‏ حصيد مستأصل يقع على الواحد والاثنين والجميع‏.‏ ‏{‏لا يستحسرون‏}‏ لا يعيون، ومنه حسير، وحسرت بعيري‏.‏ عميق بعيد‏.‏ ‏{‏نكسوا‏}‏ ردوا‏.‏ ‏{‏صنعة لبوس‏}‏ الدروع‏.‏ ‏{‏تقطعوا أمرهم‏}‏ اختلفوا، الحسيس والحس والجرس والهمس واحد، وهو من الصوت الخفي ‏{‏آذناك‏}‏ أعلمناك ‏{‏آذنتكم‏}‏ إذا أعلمته فأنت وهو على سواء لم تغدر‏.‏ وقال مجاهد ‏{‏لعلكم تسألون‏}‏ تفهمون ‏{‏ارتضى‏}‏ رضي‏.‏ ‏{‏التماثيل‏}‏ الأصنام، السجل الصحيفة‏.‏",
      "text_en": " Narrated `Abdullah:                     The Suras of Bani Israel, Al-Kahf, Mariyam, Taha and Al-Anbiya are from the very old Suras which I learnt by heart, and they are my first property.",
      "chain": [
        "30160",
        "20278",
        "20020",
        "11049",
        "20395",
        "18"
      ]
    },
    {
      "hadith_no": "5045",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا آدم، حدثنا شعبة، عن أبي إسحاق، قال سمعت عبد الرحمن بن يزيد، سمعت ابن مسعود، يقول في بني إسرائيل والكهف ومريم وطه والأنبياء إنهن من العتاق الأول وهن من تلادي‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     Surat Bani-lsrael, Al-Kahf (The Cave), Maryam, Taha, Al-Anbiya' (The prophets) are amongst my first earnings and my old property, and (in fact) they are my old property.",
      "chain": [
        "20404",
        "20020",
        "11049",
        "20395",
        "16"
      ]
    },
    {
      "hadith_no": "5061",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا أبو نعيم، حدثنا سفيان، عن منصور، عن إبراهيم، عن عبد الرحمن بن يزيد، عن أبي مسعود  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ من قرأ بالآيتين من آخر سورة البقرة في ليلة كفتاه‏\"‏‏.‏",
      "text_en": "     Narrated Abu Mas'ud:                       The Prophet said, \"If somebody recited the last two Verses of Surat Al-Baqara at night, that will be sufficient for him.\"",
      "chain": [
        "20348",
        "20012",
        "11067",
        "11051",
        "20395",
        "402"
      ]
    },
    {
      "hadith_no": "5094",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا عمر بن حفص، حدثنا أبي، حدثنا الأعمش، قال حدثني إبراهيم، عن علقمة، وعبد الرحمن بن يزيد، عن أبي مسعود الأنصاري، قال قال النبي صلى الله عليه وسلم ‏\"‏ الآيتان من آخر سورة البقرة من قرأ بهما في ليلة كفتاه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Mas`ud Al-Ansari:                     The Prophet said, \"If one recites the last two Verses of Surat-al-Baqara at night, it is sufficient for him (for that night).",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11051",
        "11017",
        "20395",
        "402"
      ]
    },
    {
      "hadith_no": "5121",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا عمر بن حفص بن غياث، حدثنا أبي، حدثنا الأعمش، قال حدثني عمارة، عن عبد الرحمن بن يزيد، قال دخلت مع علقمة والأسود على عبد الله فقال عبد الله كنا مع النبي صلى الله عليه وسلم شبابا لا نجد شيئا فقال لنا رسول الله صلى الله عليه وسلم ‏\"‏ يا معشر الشباب من استطاع الباءة فليتزوج، فإنه أغض للبصر، وأحصن للفرج، ومن لم يستطع فعليه بالصوم، فإنه له وجاء ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     We were with the Prophet while we were young and had no wealth whatever. So Allah's Apostle said, \"O young people! Whoever among you can marry, should marry, because it helps him lower his gaze and guard his modesty (i.e. his private parts from committing illegal sexual intercourse etc.), and whoever is not able to marry, should fast, as fasting diminishes his sexual power.\"",
      "chain": [
        "30204",
        "20317",
        "11060",
        "11379",
        "20395"
      ]
    },
    {
      "hadith_no": "5649",
      "source": " Sahih Bukhari ",
      "chapter": "Drinks - كتاب الأشربة",
      "chapter_no": "74",
      "text_ar": "وقال هشام بن عمار حدثنا صدقة بن خالد، حدثنا عبد الرحمن بن يزيد بن جابر، حدثنا عطية بن قيس الكلابي، حدثنا عبد الرحمن بن غنم الأشعري، قال حدثني أبو عامر  أو أبو مالك  الأشعري والله ما كذبني سمع النبي صلى الله عليه وسلم يقول ‏\"‏ ليكونن من أمتي أقوام يستحلون الحر والحرير والخمر والمعازف، ولينزلن أقوام إلى جنب علم يروح عليهم بسارحة لهم، يأتيهم  يعني الفقير  لحاجة فيقولوا ارجع إلينا غدا‏.‏ فيبيتهم الله ويضع العلم، ويمسخ آخرين قردة وخنازير إلى يوم القيامة ‏\"‏‏.‏",
      "text_en": "      Narrated Abu 'Amir or Abu Malik Al-Ash'ari:                          that he heard the Prophet saying, \"From among my followers there will      be some people who will consider illegal sexual intercourse, the      wearing of silk, the drinking of alcoholic drinks and the use of      musical instruments, as lawful. And there will be some people who will     stay near the side of a mountain and in the evening their shepherd      will come to them with their sheep and ask them for something, but      they will say to him, 'Return to us tomorrow.' Allah will destroy them     during the night and will let the mountain fall on them, and He will      transform the rest of them into monkeys and pigs and they will remain      so till the Day of Resurrection.\"",
      "chain": [
        "30288",
        "20398",
        "20395",
        "10877",
        "5152"
      ]
    },
    {
      "hadith_no": "298",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا الحكم بن موسى القنطري، حدثنا يحيى بن حمزة، عن عبد الرحمن بن يزيد بن جابر، أن القاسم بن مخيمرة، حدثه قال حدثني أبو بردة بن أبي موسى، قال وجع أبو موسى وجعا فغشي عليه ورأسه في حجر امرأة من أهله فصاحت امرأة من أهله فلم يستطع أن يرد عليها شيئا فلما أفاق قال أنا بريء مما برئ منه رسول الله صلى الله عليه وسلم فإن رسول الله صلى الله عليه وسلم برئ من الصالقة والحالقة والشاقة ‏.‏",
      "text_en": " It is narrated on the authority of Abu Burda b. Abu Musa that Abu Musa was afflicted with grave pain and he became unconscious and his head was in the lap of a lady of his household. One of the women of his household walled. He (Abu Musa) was unable (because of weakness) to say anything to her. But when he was a bit recovered he said:                      I have no concern with one with whom the Messenger of Allah (may peace be upon him) has no concern, Verily the Messenger of Allah (may peace be upon him) has no concern with that woman who wails loudly, shaves her hair and tears (her garment in grief).",
      "chain": [
        "30502",
        "20402",
        "20395",
        "10812",
        "11901"
      ]
    },
    {
      "hadith_no": "299",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد بن حميد، وإسحاق بن منصور، قالا أخبرنا جعفر بن عون، أخبرنا أبو عميس، قال سمعت أبا صخرة، يذكر عن عبد الرحمن بن يزيد، وأبي، بردة بن أبي موسى قالا أغمي على أبي موسى وأقبلت امرأته أم عبد الله تصيح برنة ‏.‏ قالا ثم أفاق قال ألم تعلمي - وكان يحدثها - أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أنا بريء ممن حلق وسلق وخرق ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Burda that Abu Musa fell unconscious and his wife Umm Abdullah came there and wailed loudly. When he felt relief he said:                      Don't you know? -and narrated to her: Verily the Messenger of Allah (may peace be upon him) said: I have no concern with one who shaved her hair, lamented loudly and tore (her clothes in grief).",
      "chain": [
        "30553",
        "30313",
        "20416",
        "20395",
        "11901"
      ]
    },
    {
      "hadith_no": "262",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا أبو معاوية، ووكيع، عن الأعمش، ح وحدثنا يحيى بن يحيى، - واللفظ له - أخبرنا أبو معاوية، عن الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، عن سلمان، قال قيل له قد علمكم نبيكم صلى الله عليه وسلم كل شىء حتى الخراءة ‏.‏ قال فقال أجل لقد نهانا أن نستقبل القبلة لغائط أو بول أو أن نستنجي باليمين أو أن نستنجي بأقل من ثلاثة أحجار أو أن نستنجي برجيع أو بعظم ‏.‏",
      "text_en": " Salman reported that it was said to him:                      Your Apostle (may peace be upon him) teaches you about everything, even about excrement. He replied: Yes, he has forbidden us to face the Qibla at the time of excretion or urination, or cleansing with right hand or with less than three pebbles, or with dung or bone.",
      "chain": [
        "30201",
        "20354",
        "20032",
        "11060",
        "30399",
        "20354",
        "11060",
        "11051",
        "20395"
      ]
    },
    {
      "hadith_no": "262",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عبد الرحمن، حدثنا سفيان، عن الأعمش، ومنصور، عن إبراهيم، عن عبد الرحمن بن يزيد، عن سلمان، قال قال لنا المشركون إني أرى صاحبكم يعلمكم حتى يعلمكم الخراءة ‏.‏ فقال أجل إنه نهانا أن يستنجي أحدنا بيمينه أو يستقبل القبلة ونهى عن الروث والعظام وقال ‏\"‏ لا يستنجي أحدكم بدون ثلاثة أحجار ‏\"‏ ‏.‏",
      "text_en": " Salman said that (one among) the polytheists remarked:                      I see that your friend even teaches you about the excrement. He replied; Yes, he has in fact forbidden us that anyone amongst us should cleanse himself with his right hand, or face the Qibla. He has forbidden the use of dung or bone for it, and he has also instructed us not to use less than three pebbles (for this purpose).",
      "chain": [
        "30170",
        "20033",
        "20012",
        "11060",
        "11067",
        "11051",
        "20395"
      ]
    },
    {
      "hadith_no": "1628",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد الواحد، عن الأعمش، حدثنا إبراهيم، قال سمعت عبد الرحمن بن يزيد، يقول صلى بنا عثمان بمنى أربع ركعات فقيل ذلك لعبد الله بن مسعود فاسترجع ثم قال صليت مع رسول الله صلى الله عليه وسلم بمنى ركعتين وصليت مع أبي بكر الصديق بمنى ركعتين وصليت مع عمر بن الخطاب بمنى ركعتين فليت حظي من أربع ركعات ركعتان متقبلتان ‏.‏",
      "text_en": " Ibrahim reported:                      I heard 'Abd al-Rahman as saying; 'Uthman led us four rak'ahs of prayer at Mina. It was reported to Abdullah b. Mas'ud and he recited:\" Surely we are Allah's and to Him shall we return,\" and then said: I prayed with the Messenger of Allah (may peace be upon him) at Mina two rak'ahs of prayer. I prayed along with Abu Bakr al-Siddiq two rak'ahs of prayer at Mina. I prayed along with 'Umar b. Khattab two rak'ahs of prayer at Mina. I wish I had my share of the two rak'ahs acceptable (to God) for the four rak'ahs.",
      "chain": [
        "30367",
        "20256",
        "11060",
        "11051",
        "20395"
      ]
    },
    {
      "hadith_no": "1914",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أحمد بن يونس، حدثنا زهير، حدثنا منصور، عن إبراهيم، عن عبد الرحمن، بن يزيد قال لقيت أبا مسعود عند البيت فقلت حديث بلغني عنك في الآيتين في سورة البقرة ‏.‏ فقال نعم ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ الآيتان من آخر سورة البقرة من قرأهما في ليلة كفتاه ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated by Mansur with the same chain of transmitters.",
      "chain": [
        "30184",
        "20321",
        "11067",
        "11051",
        "20395"
      ]
    },
    {
      "hadith_no": "1916",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا منجاب بن الحارث التميمي، أخبرنا ابن مسهر، عن الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، عن علقمة بن قيس، عن أبي مسعود الأنصاري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قرأ هاتين الآيتين من آخر سورة البقرة في ليلة كفتاه ‏\"‏ ‏.‏ قال عبد الرحمن فلقيت أبا مسعود وهو يطوف بالبيت فسألته فحدثني به عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " A hadith like this has been narrated by Abu Mas'ud from the Apostle of Allah (may peace be upon him) through another chain of transmitters.",
      "chain": [
        "30479",
        "11060",
        "11051",
        "20395",
        "11017",
        "402"
      ]
    },
    {
      "hadith_no": "1917",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني علي بن خشرم، أخبرنا عيسى يعني ابن يونس، ح وحدثنا أبو بكر، بن أبي شيبة حدثنا عبد الله بن نمير، جميعا عن الأعمش، عن إبراهيم، عن علقمة، وعبد، الرحمن بن يزيد عن أبي مسعود، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " It is through another chain of transmitters that this hadith has been reported by Abu Mas'ud from the Apostle of Allah (may peace be upon him).",
      "chain": [
        "30556",
        "20347",
        "30201",
        "11060",
        "11051",
        "11017",
        "20395",
        "402"
      ]
    },
    {
      "hadith_no": "1918",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا حفص، وأبو معاوية عن الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، عن أبي مسعود، عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " Abu Darda' reported Allah's Apostle (may peace be upon him) as saying:                      If anyone learns by heart the first ten verses of the Surah al-Kahf, he will be protected from the Dajjal.",
      "chain": [
        "30201",
        "20354",
        "11060",
        "11051",
        "20395",
        "402"
      ]
    },
    {
      "hadith_no": "2295",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا حسن بن الربيع البجلي، حدثنا ابن المبارك، عن عبد الرحمن بن يزيد، عن بسر بن عبيد الله، عن أبي إدريس الخولاني، عن واثلة بن الأسقع، عن أبي مرثد الغنوي، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تصلوا إلى القبور ولا تجلسوا عليها‏\"‏ ‏.‏",
      "text_en": " Abu Marthad al-Ghanawi reported Allah's Messenger (may peace be upon him) as saying:                      Do not pray facing towards the graves, and do not sit on them.",
      "chain": [
        "20025",
        "20395",
        "11412",
        "11027",
        "4049"
      ]
    },
    {
      "hadith_no": "2704",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب جميعا عن أبي معاوية، قال أبو بكر حدثنا أبو معاوية، عن الأعمش، عن عمارة، عن عبد الرحمن بن يزيد، قال دخل الأشعث بن قيس على عبد الله وهو يتغدى فقال يا أبا محمد ادن إلى الغداء ‏.‏ فقال أوليس اليوم يوم عاشوراء قال وهل تدري ما يوم عاشوراء قال وما هو قال إنما هو يوم كان رسول الله صلى الله عليه وسلم يصومه قبل أن ينزل شهر رمضان فلما نزل شهر رمضان ترك ‏.‏ وقال أبو كريب تركه ‏.‏",
      "text_en": " Abd al-Rahman b. Yazid said:                      When al-Ash'ath b. Qais entered the house of 'Abdullah he was having his breakfast. He ('Abdullah b. Umar) said: Abd Muhammad (al-Asha'th), come near to the breakfast. Thereupon he said: Is not today the day of 'Ashura? He ('Abd al-Rahman) said: Do you know what the day of 'Ashura is? He said: What is it? He said: It is a day on which the Messenger of Allah (may peace be upon him) used to observe fast before the (fasting) in the month of Ramadan (became) obligatory. But when it became obligatory the (fasting of 'Ashura) was abandoned (as compulsory). Abu Kuraib said: He (the Holy Prophet) abandoned it.",
      "chain": [
        "30201",
        "20354",
        "20436",
        "20354",
        "11060",
        "11379",
        "20395"
      ]
    },
    {
      "hadith_no": "3151",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو الأحوص، عن حصين، عن كثير بن مدرك، عن عبد الرحمن بن يزيد، قال قال عبد الله ونحن بجمع سمعت الذي أنزلت عليه سورة البقرة يقول في هذا المقام ‏\"‏ لبيك اللهم لبيك ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah narrated to us as we had gathered (at Muzdalifa):                      I have heard from one upon whom Surah al-Baqara was revealed (the Holy Prophet) pronouncing Talbiya at this place.",
      "chain": [
        "30201",
        "20327",
        "15097",
        "20395"
      ]
    },
    {
      "hadith_no": "3152",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا سريج بن يونس، حدثنا هشيم، أخبرنا حصين، عن كثير بن مدرك الأشجعي، عن عبد الرحمن بن يزيد، أن عبد الله، لبى حين أفاض من جمع فقيل أعرابي هذا فقال عبد الله أنسي الناس أم ضلوا سمعت الذي أنزلت عليه سورة البقرة يقول في هذا المكان ‏\"‏ لبيك اللهم لبيك ‏\"‏ ‏. وحدثناه حسن الحلواني، حدثنا يحيى بن آدم، حدثنا سفيان، عن حصين، بهذا الإسناد ‏.",
      "text_en": " 'Abd al-Rahman b. Yazid reported that 'Abdullah (b. Mas'ud) pronounced Talbiya as he returned from the gathering of the people (at Muzdalifa). It was said:                      He might be a Bedouin (not knowing correctly the rituals of Hajj and, therefore, pronouncing Talbia at this stage), whereupon Abdullah said: Hive the people forgotten (this Sunnah of the Holy Prophet) or have they gone astray? I heard him, upon whom Sibrah al-Baqara was revealed, pronouncing Talbiya at the very place.",
      "chain": [
        "30251",
        "20468",
        "15097",
        "20395",
        "130115"
      ]
    },
    {
      "hadith_no": "3154",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنيه يوسف بن حماد المعني، حدثنا زياد، - يعني البكائي - عن حصين، عن كثير بن مدرك الأشجعي، عن عبد الرحمن بن يزيد، والأسود بن يزيد، قالا سمعنا عبد، الله بن مسعود يقول بجمع سمعت الذي، أنزلت عليه سورة البقرة ها هنا يقول ‏\"‏ لبيك اللهم لبيك ‏\"‏ ‏.‏ ثم لبى ولبينا معه ‏.‏",
      "text_en": " 'Abd al-Rahman b. Yazid and al-Aswad b. Yazid reported:                      We heard 'Abdullah b. Mas'ud saying to the gathering of people (at Muzdalifa) that he had heard Talbiya from him, upon whom Surah al-Baqara was revealed, at this very place. And so he ('Abdullah b. Mas'ud) pronounced Talbiya and we also pronounced it with him.",
      "chain": [
        "20322",
        "15097",
        "20395",
        "11054"
      ]
    },
    {
      "hadith_no": "3176",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة وأبو كريب جميعا عن أبي معاوية، - قال يحيى أخبرنا أبو معاوية، - عن الأعمش، عن عمارة، عن عبد الرحمن بن يزيد، عن عبد الله، قال ما رأيت رسول الله صلى الله عليه وسلم صلى صلاة إلا لميقاتها إلا صلاتين صلاة المغرب والعشاء بجمع وصلى الفجر يومئذ قبل ميقاتها ‏.‏",
      "text_en": " A'bdullah (b. 'Umar) reported:                      I have never seen Allah's Messenger, (may peace be upon him) but observing the prayers at their appointed times except two players, sunset and 'Isha, ' at Muzdalifa (where he deferred the sunset prayer to combine it with 'Isha' and he observed the dawn prayer before its stipulated time on that day (10th of Dhu'l-Hijja).",
      "chain": [
        "30399",
        "20354",
        "20031",
        "20354",
        "11060",
        "11379",
        "20395",
        "18"
      ]
    },
    {
      "hadith_no": "3191",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، قال رمى عبد الله بن مسعود جمرة العقبة من بطن الوادي بسبع حصيات يكبر مع كل حصاة ‏.‏ قال فقيل له إن أناسا يرمونها من فوقها ‏.‏ فقال عبد الله بن مسعود هذا والذي لا إله غيره مقام الذي أنزلت عليه سورة البقرة.",
      "text_en": " 'Abd al-Rahman b. Yazid reported that 'Abdullah b. Mas'ud (Allah be pleased with them) threw seven pebbles at Jamrat al-'Aqaba from the heart of the valley. He pronounced Takbir with every pebble. It was said to him that people fling stones from the upper side (of the valley), whereupon 'Abdullah b. Mas'ud (Allah he pleased with them) said:                      By him, besides Whom there is no other god, that is the place (of flinging stones) of one upon whom Surah al-Baqara was revealed (the Holy Prophet).",
      "chain": [
        "30201",
        "30216",
        "20354",
        "11060",
        "11051",
        "20395"
      ]
    },
    {
      "hadith_no": "3192",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا منجاب بن الحارث التميمي، أخبرنا ابن مسهر، عن الأعمش، قال سمعت الحجاج بن يوسف، يقول وهو يخطب على المنبر ألفوا القرآن كما ألفه جبريل السورة التي يذكر فيها البقرة والسورة التي يذكر فيها النساء والسورة التي يذكر فيها آل عمران ‏.‏ قال فلقيت إبراهيم فأخبرته بقوله فسبه وقال حدثني عبد الرحمن بن يزيد أنه كان مع عبد الله بن مسعود فأتى جمرة العقبة فاستبطن الوادي فاستعرضها فرماها من بطن الوادي بسبع حصيات يكبر مع كل حصاة - قال - فقلت يا أبا عبد الرحمن إن الناس يرمونها من فوقها ‏.‏ فقال هذا والذي لا إله غيره مقام الذي أنزلت عليه سورة البقرة ‏.‏",
      "text_en": " A'mash reported:                      I heard Hajjaj b. Yusuf saying as he was delivering sermon on the pulpit: Observe the order of the (Holy) Qur'an which has been observed by Gabriel. (Thus state the surahs in this manner)\" one in which mention has been made of al-Baqara,\"\" one in which mention has been made of women (Surah al-Nisa')\" and then the surah in which mention has been made of the Family of 'Imrin. He (the (narrator) said: I met Ibrahim and informed him about these words of his (the statement of Hajjaj b. Yusuf). He cursed him and said: Abd al-Rahman b. Yazid has narrated to me that when he was in the company of 'Abdullah b. Mas'udd (Allah be pleased with them) he came to Jamrat al-'Aqaba and then entered the heart of the valley and faced towards it (the Jamra) and then flung seven pebbles at it from the heart of the valley pronouncing Takbir with every pebble. I said: Abu 'Abd al-Rahman, people fling pebbles at it (Jamra) from the upper side, whereupon he said: By Him besides Whom there is no god, that is the place (of flinging pebbles of one) upon whom Surah al-Baqara was revealed;",
      "chain": [
        "30479",
        "11060",
        "20395"
      ]
    },
    {
      "hadith_no": "3194",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا غندر، عن شعبة، ح وحدثنا محمد بن المثنى، وابن بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن الحكم، عن إبراهيم، عن عبد الرحمن، بن يزيد أنه حج مع عبد الله قال فرمى الجمرة بسبع حصيات وجعل البيت عن يساره ومنى عن يمينه وقال هذا مقام الذي أنزلت عليه سورة البقرة ‏.‏",
      "text_en": " Abd al-Rahman b. Yazid reported that he performed Hajj along with 'Abdullah (Allah be pleased with him) and he flung seven pebbles at al-Jamra (from a position) that the House was on his left and Mina was on his right and said:                      That is the place (of flinging pebbles of one) upon whom Surah al-Baqara was revealed.",
      "chain": [
        "30201",
        "20278",
        "20020",
        "30170",
        "30160",
        "20173",
        "20020",
        "11069",
        "11051",
        "20395"
      ]
    },
    {
      "hadith_no": "3196",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا أبو المحياة، ح وحدثنا يحيى بن يحيى، - واللفظ له - أخبرنا يحيى بن يعلى أبو المحياة، عن سلمة بن كهيل، عن عبد الرحمن، بن يزيد قال قيل لعبد الله إن ناسا يرمون الجمرة من فوق العقبة - قال - فرماها عبد الله من بطن الوادي ثم قال من ها هنا والذي لا إله غيره رماها الذي أنزلت عليه سورة البقرة ‏.‏",
      "text_en": " Abd al-Rahman b. Yazid reported:                      It was said to 'Abdullah (Allah be pleased with bird) that people threw pebbles at the Jamra from the upper side of 'Aqaba, whereas he threw stones at it from the heart of the valley, whereupon he said: By Him besides Whom there is no god, it is at this very place that one upon whom was revealed Surah al-Baqara threw stones at it.",
      "chain": [
        "30201",
        "30399",
        "11350",
        "20395"
      ]
    },
    {
      "hadith_no": "3466",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا أبو معاوية، عن الأعمش، عن عمارة بن عمير، عن عبد الرحمن بن يزيد، عن عبد الله، قال قال لنا رسول الله صلى الله عليه وسلم ‏\"‏ يا معشر الشباب من استطاع منكم الباءة فليتزوج فإنه أغض للبصر وأحصن للفرج ومن لم يستطع فعليه بالصوم فإنه له وجاء ‏\"‏ ‏.‏",
      "text_en": " Abdullah (b. Mas'ud) (Allah be pleased with him) reported that Allah's Messenger (may peace be upon him) said to us:                      0 young men, those among you who can support a wife should marry, for it restrains eyes (from casting evil glances) and preserves one from immorality; but he who cannot afford It should observe fast for it is a means of controlling the sexual desire.",
      "chain": [
        "30201",
        "30216",
        "20354",
        "11060",
        "11378",
        "20395",
        "18"
      ]
    },
    {
      "hadith_no": "3467",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الأعمش، عن عمارة بن عمير، عن عبد الرحمن بن يزيد، قال دخلت أنا وعمي، علقمة والأسود على عبد الله بن مسعود قال وأنا شاب، يومئذ فذكر حديثا رئيت أنه حدث به، من أجلي قال قال رسول الله صلى الله عليه وسلم ‏.‏ بمثل حديث أبي معاوية وزاد قال فلم ألبث حتى تزوجت ‏.‏",
      "text_en": " Abu al-Rahman b. Yazid said:                      I and my uncle 'Alqama and al-Aswad went to 'Abdullah b. Mas'ud (Allah be pleased with him). He (the narrator further) said: I was at that time young, and he narrated a hadith which it seemed he narrated for me that Allah's Messenger (may peace be upon him) said like one transmitted by Mu'awiya, and further added: I lost no time in marrying.",
      "chain": [
        "30203",
        "20028",
        "11060",
        "11378",
        "20395"
      ]
    },
    {
      "hadith_no": "3468",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثني عبد الله بن سعيد الأشج، حدثنا وكيع، حدثنا الأعمش، عن عمارة بن، عمير عن عبد الرحمن بن يزيد، عن عبد الله، قال دخلنا عليه وأنا أحدث القوم، بمثل حديثهم ولم يذكر فلم ألبث حتى تزوجت ‏.‏",
      "text_en": " 'Abd al-Rahman b. Yazid reported on the authority of Abdullah:                      We went to him, and I was the youngest of all (of us), but he did not mention:\" I lost no time in marrying.\"",
      "chain": [
        "20032",
        "11060",
        "11378",
        "20395",
        "18"
      ]
    },
    {
      "hadith_no": "4890",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثني محمد بن المثنى، حدثنا الوليد بن مسلم، حدثنا عبد الرحمن بن يزيد بن، جابر حدثني بسر بن عبيد الله الحضرمي، أنه سمع أبا إدريس الخولاني، يقول سمعت حذيفة بن اليمان، يقول كان الناس يسألون رسول الله صلى الله عليه وسلم عن الخير وكنت أسأله عن الشر مخافة أن يدركني فقلت يا رسول الله إنا كنا في جاهلية وشر فجاءنا الله بهذا الخير فهل بعد هذا الخير شر قال ‏\"‏ نعم ‏\"‏ فقلت هل بعد ذلك الشر من خير قال ‏\"‏ نعم وفيه دخن ‏\"‏ ‏.‏ قلت وما دخنه قال ‏\"‏ قوم يستنون بغير سنتي ويهدون بغير هديي تعرف منهم وتنكر ‏\"‏ ‏.‏ فقلت هل بعد ذلك الخير من شر قال ‏\"‏ نعم دعاة على أبواب جهنم من أجابهم إليها قذفوه فيها ‏\"‏ ‏.‏ فقلت يا رسول الله صفهم لنا ‏.‏ قال ‏\"‏ نعم قوم من جلدتنا ويتكلمون بألسنتنا ‏\"‏ ‏.‏ قلت يا رسول الله فما ترى إن أدركني ذلك قال ‏\"‏ تلزم جماعة المسلمين وإمامهم ‏\"‏ ‏.‏ فقلت فإن لم تكن لهم جماعة ولا إمام قال ‏\"‏ فاعتزل تلك الفرق كلها ولو أن تعض على أصل شجرة حتى يدركك الموت وأنت على ذلك ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Hudhaifa b. al-Yaman who said:                      People used to ask the Messenger of Allah (may peace be upon him) about the good times, but I used to ask him about bad times fearing lest they overtake me. I said: Messenger of Allah, we were in the midst of ignorance and evil, and then God brought us this good (time through Islam). Is there any bad time after this good one? He said: Yes. I asked: Will there be a good time again after that bad time? He said: Yes, but therein will be a hidden evil. I asked: What will be the evil hidden therein? He said: (That time will witness the rise of) the people who will adopt ways other than mine and seek guidance other than mine. You will know good points as well as bad points. I asked: Will there be a bad time after this good one? He said: Yes. (A time will come) when there will be people standing and inviting at the gates of Hell. Whoso responds to their call they will throw them into the fire. I said: Messenger of Allah, describe them for us. He said: All right. They will be a people having the same complexion as ours and speaking our language. I said: Messenger of Allah, what do you suggest if I happen to live in that time? He said: You should stick to the main body of the Muslims and their leader. I said: If they have no (such thing as the) main body and have no leader? He said: Separate yourself from all these factions, though you may have to eat the roots of trees (in a jungle) until death comes to you and you are in this state.",
      "chain": [
        "30170",
        "20733",
        "20395",
        "11412",
        "11027",
        "145"
      ]
    },
    {
      "hadith_no": "4911",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا داود بن رشيد، حدثنا الوليد، - يعني ابن مسلم - حدثنا عبد الرحمن بن، يزيد بن جابر أخبرني مولى بني فزارة، - وهو رزيق بن حيان - أنه سمع مسلم بن، قرظة ابن عم عوف بن مالك الأشجعي يقول سمعت عوف بن مالك الأشجعي، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ خيار أئمتكم الذين تحبونهم ويحبونكم وتصلون عليهم ويصلون عليكم وشرار أئمتكم الذين تبغضونهم ويبغضونكم وتلعنونهم ويلعنونكم ‏\"‏ ‏.‏ قالوا قلنا يا رسول الله أفلا ننابذهم عند ذلك قال ‏\"‏ لا ما أقاموا فيكم الصلاة لا ما أقاموا فيكم الصلاة ألا من ولي عليه وال فرآه يأتي شيئا من معصية الله فليكره ما يأتي من معصية الله ولا ينزعن يدا من طاعة ‏\"‏ ‏.‏ قال ابن جابر فقلت - يعني لرزيق - حين حدثني بهذا الحديث آلله يا أبا المقدام لحدثك بهذا أو سمعت هذا من مسلم بن قرظة يقول سمعت عوفا يقول سمعت رسول الله صلى الله عليه وسلم قال فجثا على ركبتيه واستقبل القبلة فقال إي والله الذي لا إله إلا هو لسمعته من مسلم بن قرظة يقول سمعت عوف بن مالك يقول سمعت رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It has been narrated on the authority of Auf b. Malik al-Ashja'i who said that he heard the Messenger of Allah (may peace be upon him) say:                      The best of your rulers are those whom you love and who love you, upon whom you invoke God's blessings and who invoke His blessing upon you. And the worst of your rulers are those whom you hate and who hate you, who curse you and whom you curse. (Those present) said: Shouldn't we overthrow them at this? He said: No, as long as they establish prayer among you. No, as long as they establish prayer among you. Mind you! One who has a governor appointed over him and he finds that the governor indulges in an act of disobedience to God, he should condemn the governor's act, in disobedience to God, but should not withdraw himself from his obedience. Ibn Jabir said: Ruzaiq narrated to me this hadith. I asked him: Abu Miqdam, have you heard it from Muslim b. Qaraza or did he describe it to you and he heard it from 'Auf (b. Malik) and he transmitted this tradition of Allah's Messenger (may peace be upon him)? Upon this Ruzaiq sat upon his knees and facing the Qibla said: By Allah, besides Whom there is no other God, I heard it from Muslim b. Qaraza and he said that te had heard it from Auf (b. Malik) and he said that he had heard it from the Messenger of Allah (may peace be upon him).",
      "chain": [
        "30248",
        "20733",
        "20395",
        "10963",
        "3051"
      ]
    },
    {
      "hadith_no": "5064",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا منصور بن أبي مزاحم، حدثنا يحيى بن حمزة، عن عبد الرحمن بن يزيد، بن جابر أن عمير بن هانئ، حدثه قال سمعت معاوية، على المنبر يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا تزال طائفة من أمتي قائمة بأمر الله لا يضرهم من خذلهم أو خالفهم حتى يأتي أمر الله وهم ظاهرون على الناس ‏\"‏ ‏.‏",
      "text_en": " It his been narrated on the authority of Umair b. Umm Hani who said:                      I heard Mu'awiya say (while delivering a sermon from the pulpit) that he heard the Messenger of Allah (may peace be upon him) say: A group of people from my Umma will continue to obey Allah's Command, and those who desert or oppose them shall not be able to do them any harm. They will be dominating the peeple until Allah's Command is executed (i. e. Resurrection is established).",
      "chain": [
        "30523",
        "20402",
        "20395",
        "11415"
      ]
    },
    {
      "hadith_no": "5794",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو كامل الجحدري، وقتيبة بن سعيد، كلاهما عن عبد الواحد، - واللفظ لقتيبة - حدثنا عبد الواحد بن زياد، حدثنا الحسن بن عبيد الله، حدثنا إبراهيم بن سويد، قال سمعت عبد الرحمن بن يزيد، قال سمعت ابن مسعود، يقول قال لي رسول الله صلى الله عليه وسلم ‏\"‏ إذنك على أن يرفع الحجاب وأن تستمع سوادي حتى أنهاك ‏\"‏ ‏.‏",
      "text_en": " Ibn Mas'ud reported:                      The Messenger of Allah (may peace be upon him) said to me: The sign that you have been permitted to come in is that the curtain is raised or that you hear me speaking quietly until I forbid you.",
      "chain": [
        "30559",
        "30367",
        "20256",
        "10755",
        "10887",
        "20395",
        "16"
      ]
    },
    {
      "hadith_no": "7082",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة بن سعيد، حدثنا عبد الواحد بن زياد، عن الحسن بن عبيد الله، حدثنا  إبراهيم بن سويد النخعي، حدثنا عبد الرحمن بن يزيد، عن عبد الله بن مسعود، قال كان رسول الله صلى الله عليه وسلم إذا أمسى قال ‏\"‏ أمسينا وأمسى الملك لله والحمد لله لا إله إلا الله وحده لا شريك له ‏\"‏ ‏.‏ قال الحسن فحدثني الزبيد أنه حفظ عن إبراهيم في هذا ‏\"‏ له الملك وله الحمد وهو على كل شىء قدير اللهم أسألك خير هذه الليلة وأعوذ بك من شر هذه الليلة وشر ما بعدها اللهم إني أعوذ بك من الكسل وسوء الكبر اللهم إني أعوذ بك من عذاب في النار وعذاب في القبر ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Mas'ud reported that when it was evening Allah's Messenger (may peace be upon him) used to supplicate:                     \" We entered upon evening and the whole Kingdom of Allah also entered upon evening and praise is due to Allah. There is no god but Allah, the One Who has no partner with Him.\" Hasan said that Zubaid reported to him that he memorised it from Ibrahim in these very words.\" His is the Sovereignty and Praise is due to Him, and He is Potent over everything. O Allah, I beg of Thee the good of this night and I seek refuge in Thee from the evil of this night and the evil which follows it. O Allah, I seek refuge in Thee from sloth, from the evil of vanity. O Allah, I seek refuge in Thee from torment in the Hell-Fire and from torment in the grave.\"",
      "chain": [
        "30367",
        "20256",
        "10755",
        "10887",
        "20395",
        "16"
      ]
    },
    {
      "hadith_no": "7083",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا جرير، عن الحسن بن عبيد الله، عن إبراهيم، بن سويد عن عبد الرحمن بن يزيد، عن عبد الله، قال كان نبي الله صلى الله عليه وسلم إذا أمسى قال ‏\"‏ أمسينا وأمسى الملك لله والحمد لله لا إله إلا الله وحده لا شريك له ‏\"‏ ‏.‏ قال أراه قال فيهن ‏\"‏ له الملك وله الحمد وهو على كل شىء قدير رب أسألك خير ما في هذه الليلة وخير ما بعدها وأعوذ بك من شر ما في هذه الليلة وشر ما بعدها رب أعوذ بك من الكسل وسوء الكبر رب أعوذ بك من عذاب في النار وعذاب في القبر ‏\"‏ ‏.‏ وإذا أصبح قال ذلك أيضا ‏\"‏ أصبحنا وأصبح الملك لله ‏\"‏ ‏.‏",
      "text_en": " Abdullah reported that when it was evening Allah's Messenger (may peace be upon him) used to supplicate:                     \" We have entered upon evening and so, too, the whole Kingdom of Allah has entered upon evening. Praise is due to Allah. There is no god but Allah, the One having no partner with Him.\" He (the narrator) said: I think that he also uttered (in this supplication these words):\" His is tne Sovercignty and to Him is praise due and He is Potent over everything. My Lord, I beg of Thee good that lies in this night and good that follows it and I seek refuge in Thee from the evil that lies in this night and from the evil of that which follows it. My Lord, I seek refuge in Thee from sloth, from the evil of vanity. My Lord, I seek refuge in Thee from torment of the Hell-Fire and from torment of the grave.\" And when it was morning he said like this:\" We entered upon morning and the whole Kingdom of Allah enter ed upon morning.\"",
      "chain": [
        "30203",
        "20028",
        "10755",
        "10887",
        "20395",
        "18"
      ]
    },
    {
      "hadith_no": "7084",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا حسين بن علي، عن زائدة، عن الحسن بن، عبيد الله عن إبراهيم بن سويد، عن عبد الرحمن بن يزيد، عن عبد الله، قال كان رسول الله صلى الله عليه وسلم إذا أمسى قال ‏\"‏ أمسينا وأمسى الملك لله والحمد لله لا إله إلا الله وحده لا شريك له اللهم إني أسألك من خير هذه الليلة وخير ما فيها وأعوذ بك من شرها وشر ما فيها اللهم إني أعوذ بك من الكسل والهرم وسوء الكبر وفتنة الدنيا وعذاب القبر ‏\"‏ ‏.‏ قال الحسن بن عبيد الله وزادني فيه زبيد عن إبراهيم بن سويد عن عبد الرحمن بن يزيد عن عبد الله رفعه أنه قال ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير ‏\"‏ ‏.‏",
      "text_en": " Abdullah reported that when it was evening Allah's Messenger (may peace be upon him) used to supplicate:                     \" We have entered upon evening and so has the Kingdom of Allah entere d upon evening; praise is due to Allah, there is no god but Allah the One, and there is no partner with Him. O Allah, I beg of Thee the blessing of this night and the blessing of that which lies in it. I seek refuge in Thee from the evil of it and what lies in it. O Allah, I seek refuge in Thee from sloth, from decrepitude, from the evil of vanity, from trial of the world, and from torment of the grave.\" Zubaid, through another chain of transmitters, has narrated on the authority of Abdullah directly this addition:\" There is no god but Allah, the One, there is no partner with Him, His is the Sovereignty and to Him is praise due and He is Potent over everything.\"",
      "chain": [
        "30201",
        "20315",
        "20320",
        "10755",
        "10887",
        "20395",
        "18"
      ]
    },
    {
      "hadith_no": "7170",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثنا عثمان بن أبي شيبة، وزهير بن حرب، وإسحاق بن إبراهيم، قال إسحاق أخبرنا وقال الآخران، حدثنا جرير، عن الأعمش، عن مالك بن الحارث، عن عبد الرحمن، بن يزيد عن عبد الله بن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ليس أحد أحب إليه المدح من الله عز وجل من أجل ذلك مدح نفسه وليس أحد أغير من الله من أجل ذلك حرم الفواحش وليس أحد أحب إليه العذر من الله من أجل ذلك أنزل الكتاب وأرسل الرسل ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. Mas'ud reported that Allah's Messenger (may peace be upon him) said:                      None loves one's own praise more than Allah, the Exalted and Glurious, does. It is because of this that He has praised Himself, and none is more self-respecting than Allah and it is because of this that He has prohibited abominable acts and there is none who is more anxious to accept the apologies of the people than Allah Himself and it is because of this that He has revealed the Book and sent the Messengers.",
      "chain": [
        "30203",
        "30022",
        "30123",
        "30312",
        "4057",
        "11060",
        "11041",
        "20395",
        "16"
      ]
    },
    {
      "hadith_no": "7559",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا أبو خيثمة، زهير بن حرب حدثنا الوليد بن مسلم، حدثني عبد الرحمن، بن يزيد بن جابر حدثني يحيى بن جابر الطائي، قاضي حمص حدثني عبد الرحمن بن، جبير عن أبيه، جبير بن نفير الحضرمي أنه سمع النواس بن سمعان الكلابي، ح   وحدثني محمد بن مهران الرازي، - واللفظ له - حدثنا الوليد بن مسلم، حدثنا  عبد الرحمن بن يزيد بن جابر، عن يحيى بن جابر الطائي، عن عبد الرحمن بن جبير بن، نفير عن أبيه، جبير بن نفير عن النواس بن سمعان، قال ذكر رسول الله صلى الله عليه وسلم الدجال ذات غداة فخفض فيه ورفع حتى ظنناه في طائفة النخل فلما رحنا إليه عرف ذلك فينا فقال ‏\"‏ ما شأنكم ‏\"‏ ‏.‏ قلنا يا رسول الله ذكرت الدجال غداة فخفضت فيه ورفعت حتى ظنناه في طائفة النخل ‏.‏ فقال ‏\"‏ غير الدجال أخوفني عليكم إن يخرج وأنا فيكم فأنا حجيجه دونكم وإن يخرج ولست فيكم فامرؤ حجيج نفسه والله خليفتي على كل مسلم إنه شاب قطط عينه طافئة كأني أشبهه بعبد العزى بن قطن فمن أدركه منكم فليقرأ عليه فواتح سورة الكهف إنه خارج خلة بين الشأم والعراق فعاث يمينا وعاث شمالا يا عباد الله فاثبتوا ‏\"‏ ‏.‏ قلنا يا رسول الله وما لبثه في الأرض قال ‏\"‏ أربعون يوما يوم كسنة ويوم كشهر ويوم كجمعة وسائر أيامه كأيامكم ‏\"‏ ‏.‏ قلنا يا رسول الله فذلك اليوم الذي كسنة أتكفينا فيه صلاة يوم قال ‏\"‏ لا اقدروا له قدره ‏\"‏ ‏.‏ قلنا يا رسول الله وما إسراعه في الأرض قال ‏\"‏ كالغيث استدبرته الريح فيأتي على القوم فيدعوهم فيؤمنون به ويستجيبون له فيأمر السماء فتمطر والأرض فتنبت فتروح عليهم سارحتهم أطول ما كانت ذرا وأسبغه ضروعا وأمده خواصر ثم يأتي القوم فيدعوهم فيردون عليه قوله فينصرف عنهم فيصبحون ممحلين ليس بأيديهم شىء من أموالهم ويمر بالخربة فيقول لها أخرجي كنوزك ‏.‏ فتتبعه كنوزها كيعاسيب النحل ثم يدعو رجلا ممتلئا شبابا فيضربه بالسيف فيقطعه جزلتين رمية الغرض ثم يدعوه فيقبل ويتهلل وجهه يضحك فبينما هو كذلك إذ بعث الله المسيح ابن مريم فينزل عند المنارة البيضاء شرقي دمشق بين مهرودتين واضعا كفيه على أجنحة ملكين إذا طأطأ رأسه قطر وإذا رفعه تحدر منه جمان كاللؤلؤ فلا يحل لكافر يجد ريح نفسه إلا مات ونفسه ينتهي حيث ينتهي طرفه فيطلبه حتى يدركه بباب لد فيقتله ثم يأتي عيسى ابن مريم قوم قد عصمهم الله منه فيمسح عن وجوههم ويحدثهم بدرجاتهم في الجنة فبينما هو كذلك إذ أوحى الله إلى عيسى إني قد أخرجت عبادا لي لا يدان لأحد بقتالهم فحرز عبادي إلى الطور ‏.‏ ويبعث الله يأجوج ومأجوج وهم من كل حدب ينسلون فيمر أوائلهم على بحيرة طبرية فيشربون ما فيها ويمر آخرهم فيقولون لقد كان بهذه مرة ماء ‏.‏ ويحصر نبي الله عيسى وأصحابه حتى يكون رأس الثور لأحدهم خيرا من مائة دينار لأحدكم اليوم فيرغب نبي الله عيسى وأصحابه فيرسل الله عليهم النغف في رقابهم فيصبحون فرسى كموت نفس واحدة ثم يهبط نبي الله عيسى وأصحابه إلى الأرض فلا يجدون في الأرض موضع شبر إلا ملأه زهمهم ونتنهم فيرغب نبي الله عيسى وأصحابه إلى الله فيرسل الله طيرا كأعناق البخت فتحملهم فتطرحهم حيث شاء الله ثم يرسل الله مطرا لا يكن منه بيت مدر ولا وبر فيغسل الأرض حتى يتركها كالزلفة ثم يقال للأرض أنبتي ثمرتك وردي بركتك ‏.‏ فيومئذ تأكل العصابة من الرمانة ويستظلون بقحفها ويبارك في الرسل حتى أن اللقحة من الإبل لتكفي الفئام من الناس واللقحة من البقر لتكفي القبيلة من الناس واللقحة من الغنم لتكفي الفخذ من الناس فبينما هم كذلك إذ بعث الله ريحا طيبة فتأخذهم تحت آباطهم فتقبض روح كل مؤمن وكل مسلم ويبقى شرار الناس يتهارجون فيها تهارج الحمر فعليهم تقوم الساعة ‏\"‏ ‏.‏",
      "text_en": " An-Nawwas b. Sam'an reported that Allah's Messenger (may peace be upon him) made a mention of the Dajjal one day in the morning. He sometimes described him to be insignificant and sometimes described (his turmoil) as very significant rand we felt) as if he were in the cluster of the date-palm trees. When we went to him (to the Holy Prophet) in the evening and he read (the signs of fear) in our faces, he said:                      What is the matter with you? We said: Allah's Messenger, you made a mention of the Dajjal in the morning (sometimes describing him) to be insignificant and sometimes very important, until we began to think as if he were present in some (near) part of the cluster of the datpalm trees. Thereupon he said: I harbour fear in regard to you in so many other things besides the Dajjal. If he comes forth while I am among on, I shall contend with him on your behalf, but if he comes forth while I am not amongst you, a man must contend on his own behalf and Allah would take care of every Muslim on my behalf (and safeguard him against his evil). He (Dajjal) would be a young man with twisted, contracted hair, and a blind eye. I compare him to 'Abd-ul-'Uzza b. Qatan. He who amongst you would survive to see him should recite over him the opening verses of Sura Kahf (xviii.). He would appear on the way between Syria and Iraq and would spread mischief right and left. O servant of Allah! adhere (to the path of Truth). We said: Allah's Messenger, how long would he stay on the earth? He said.. For forty days, one day like a year and one day like a month and one day like a week and the rest of the days would be like your days. We said: Allah's Messenger, would one day's prayer suffice for the prayers of day equal to one year? Thereupon he said: No, but you must make an estimate of time (and then observe prayer). We said: Allah's Messenger, how quickly would he walk upon the earth? Thereupon he said: Like cloud driven by the wind. He would come to the people and invite them (to a wrong religion) and they would affirm their faith in him and respond to him. He would then give command to the sky and there would be rainfall upon the earth and it would grow crops. Then in the evening, their posturing animals would come to them with their humps very high and their udders full of milk and their flanks stretched. He would then come to another people and invite them. But they would reject him and he would go away from them and there would be drought for them and nothing would be lef t with them in the form of wealth. He would then walk through the waste, land and say to it: Bring forth your treasures, and the treasures would come out and collect (themselves) before him like the swarm of bees. He would then call a person brimming with youth and strike him with the sword and cut him into two pieces and (make these pieces lie at a distance which is generally) between the archer and his target. He would then call (that young man) and he will come forward laughing with his face gleaming (with happiness) and it would at this very time that Allah would send Christ, son of Mary, and he will descend at the white minaret in the eastern side of Damscus wearing two garments lightly dyed with saffron and placing his hands on the wings of two Angels. When he would lower his head, there would fall beads of perspiration from his head, and when he would raise it up, beads like pearls would scatter from it. Every non-believer who would smell the odour of his self would die and his breath would reach as far as he would be able to see. He would then search for him (Dajjal) until he would catch hold of him at the gate of Ludd and would kill him. Then a people whom Allah had protected would come to Jesus, son of Mary, and he would wipe their faces and would inform them of their ranks in Paradise and it would be under such conditions that Allah would reveal to Jesus these words: I have brought forth from amongst My servants such people against whom none would be able to fight; you take these people safely to Tur, and then Allah would send Gog and Magog and they would swarm down from every slope. The first of them would pass the lake of Tibering and drink out of it. And when the last of them would pass, he would say: There was once water there. Jesus and his companions would then be besieged here (at Tur, and they would be so much hard pressed) that the head of the ox would be dearer to them than one hundred dinirs and Allah's Apostle, Jesus, and his companions would supplicate Allah, Who would send to them insects (which would attack their necks) and in the morning they would perish like one single person. Allah's Apostle, Jesus, and his companions would then come down to the earth and they would not find in the earth as much space as a single span which is not filled with their putrefaction and stench. Allah's Apostle, Jesus, and his companions would then again beseech Allah, Who would send birds whose necks would be like those of bactrin camels and they would carry them and throw them where God would will. Then Allah would send rain which no house of clay or (the tent of) camels' hairs would keep out and it would wash away the earth until it could appear to be a mirror. Then the earth would be told to bring forth its fruit and restore its blessing and, as a result thereof, there would grow (such a big) pomegranate that a group of persons would be able to eat that, and seek shelter under its skin and milch cow would give so much milk that a whole party would be able to drink it. And the milch camel would give such (a large quantity of) milk that the whole tribe would be able to drink out of that and the milch sheep would give so much milk that the whole family would be able to drink out of that and at that time Allah would send a pleasant wind which would soothe (people) even under their armpits, and would take the life of every Muslim and only the wicked would survive who would commit adultery like asses and the Last Hour would come to them.",
      "chain": [
        "30022",
        "20733",
        "20395",
        "10978",
        "10865",
        "3600",
        "20733"
      ]
    },
    {
      "hadith_no": "7635",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن المثنى، ومحمد بن بشار، قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن أبي إسحاق، قال سمعت عبد الرحمن بن يزيد، يحدث عن الأسود، عن عائشة، أنها قالت ما شبع آل محمد صلى الله عليه وسلم من خبز شعير يومين متتابعين حتى قبض رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " 'A'isha reported:                      Never did the family of Muhammad (may peace be upon him) eat to the fill the bread of barley for two successive days until Allah's Messenger (may peace be upon him) died.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "11049",
        "20395",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "1047",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا هارون بن عبد الله، حدثنا حسين بن علي، عن عبد الرحمن بن يزيد بن جابر، عن أبي الأشعث الصنعاني، عن أوس بن أوس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من أفضل أيامكم يوم الجمعة فيه خلق آدم وفيه قبض وفيه النفخة وفيه الصعقة فأكثروا على من الصلاة فيه فإن صلاتكم معروضة على ‏\"‏ ‏.‏ قال قالوا يا رسول الله وكيف تعرض صلاتنا عليك وقد أرمت يقولون بليت ‏.‏ فقال ‏\"‏ إن الله عز وجل حرم على الأرض أجساد الأنبياء ‏\"‏ ‏.‏",
      "text_en": " Narrated Aws ibn Aws:                     The Prophet (ﷺ) said: Among the most excellent of your days is Friday; on it Adam was created, on it he died, on it the last trumpet will be blown, and on it the shout will be made, so invoke more blessings on me that day, for your blessings will be submitted to me.  The people asked: Messenger of Allah, how can it be that our blessings will be submitted to you while your body is decayed? He replied: Allah, the Exalted, has prohibited the earth from consuming the bodies of Prophets.",
      "chain": [
        "30524",
        "20315",
        "20395",
        "10917",
        "3214"
      ]
    },
    {
      "hadith_no": "1051",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إبراهيم بن موسى، أخبرنا عيسى، حدثنا عبد الرحمن بن يزيد بن جابر، قال حدثني عطاء الخراساني، عن مولى، امرأته أم عثمان قال سمعت عليا، - رضى الله عنه - على منبر الكوفة يقول ‏\"‏ إذا كان يوم الجمعة غدت الشياطين براياتها إلى الأسواق فيرمون الناس بالترابيث أو الربائث ويثبطونهم عن الجمعة وتغدو الملائكة فيجلسون على أبواب المسجد فيكتبون الرجل من ساعة والرجل من ساعتين حتى يخرج الإمام فإذا جلس الرجل مجلسا يستمكن فيه من الاستماع والنظر فأنصت ولم يلغ كان له كفلان من أجر فإن نأى وجلس حيث لا يسمع فأنصت ولم يلغ كان له كفل من أجر وإن جلس مجلسا يستمكن فيه من الاستماع والنظر فلغا ولم ينصت كان له كفل من وزر ومن قال يوم الجمعة لصاحبه صه ‏.‏ فقد لغا ومن لغا فليس له في جمعته تلك شىء ‏\"‏ ‏.‏ ثم يقول في آخر ذلك سمعت رسول الله صلى الله عليه وسلم يقول ذلك ‏.‏ قال أبو داود رواه الوليد بن مسلم عن ابن جابر قال بالربائث وقال مولى امرأته أم عثمان بن عطاء ‏.‏",
      "text_en": " Narrated Ali ibn AbuTalib:                     Ali said on the pulpit in the mosque of Kufah: When Friday comes, the devils go to the markets with their flags, and involve people in their needs and prevent them from the Friday prayer. The angels come early in the morning, sit at the door of the mosque, and record that so-and-so came at the first hour, and so-and-so came at the second hour until the imam comes out (for preaching).  When a man sits in a place where he can listen (to the sermon) and look (at the imam), where he remains silent and does not interrupt, he will receive a double reward. If he stays away, sits in a place where he cannot listen (to the sermon), silent, and does not interrupt, he will receive the reward only once. If he sits in a place where he can listen (to the sermon) and look (at the imam), and he does not remain silent, he will have the burden of it. If anyone says to his companion sitting besides him to be silent (while the imam is preaching), he is guilty of idle talk. Anyone who interrupts (during the sermon) will receive nothing (no reward) on that Friday.  Then he (the narrator) says in the end of this tradition: I heard the Messenger of Allah (ﷺ) say so.Abu Dawud said: This tradition has been narrated by al-Walid b. Muslim from Ibn Jabir. This version adds: bi'l-raba'ith (instead of al-raba'ith, needs preventing the people from prayer). Further, this adds: Freed slave of his wife Umm 'Uthman b. 'Ata.",
      "chain": [
        "30309",
        "20347",
        "20395",
        "10947",
        "5"
      ]
    },
    {
      "hadith_no": "1531",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا الحسن بن علي، حدثنا الحسين بن علي الجعفي، عن عبد الرحمن بن يزيد بن جابر، عن أبي الأشعث الصنعاني، عن أوس بن أوس، قال قال النبي صلى الله عليه وسلم ‏\"‏ إن من أفضل أيامكم يوم الجمعة فأكثروا على من الصلاة فيه فإن صلاتكم معروضة على ‏\"‏ ‏.‏ قال فقالوا يا رسول الله وكيف تعرض صلاتنا عليك وقد أرمت قال يقولون بليت ‏.‏ قال ‏\"‏ إن الله تبارك وتعالى حرم على الأرض أجساد الأنبياء صلى الله عليهم ‏\"‏ ‏.‏",
      "text_en": " Aws b. Was reported the Messenger of Allah (ﷺ) as saying:                      Among the most excellent of your days in Friday ; so invoke many blessings on me on that day, for your blessing will be submitted to me. They (the Companions) asked: Messenger of Allah, how can our blessing be submitted to you, when your body is decayed ? He said: Allah has prohibited the earth from consuming the bodies of Prophets.",
      "chain": [
        "30115",
        "20315",
        "20395",
        "10917",
        "3214"
      ]
    },
    {
      "hadith_no": "2513",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا عبد الله بن المبارك، حدثني عبد الرحمن بن يزيد بن جابر، حدثني أبو سلام، عن خالد بن زيد، عن عقبة بن عامر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏:‏ ‏\"‏ إن الله عز وجل يدخل بالسهم الواحد ثلاثة نفر الجنة ‏:‏ صانعه يحتسب في صنعته الخير، والرامي به، ومنبله، وارموا واركبوا، وأن ترموا أحب إلى من أن تركبوا، ليس من اللهو إلا ثلاث ‏:‏ تأديب الرجل فرسه وملاعبته أهله ورميه بقوسه ونبله، ومن ترك الرمى بعد ما علمه رغبة عنه فإنها نعمة تركها ‏\"‏ ‏.‏ أو قال ‏:‏ ‏\"‏ كفرها ‏\"‏ ‏.‏",
      "text_en": " Narrated Uqbah ibn Amir:                     I heard the Messenger of Allah (ﷺ) say: Allah, Most High, will cause three persons to enter Paradise for one arrow: the maker when he has a good motive in making it, the one who shoots it, and the one who hands it; so shoot and ride, but your shooting is dearer to me than your riding. Everything with which a man amuses himself is vain except three (things): a man's training of his horse, his playing with his wife, and his shooting with his bow and arrow. If anyone abandons archery after becoming an adept through distaste for it, it is a blessing he has abandoned; or he said: for which he has been ungrateful.",
      "chain": [
        "30116",
        "20025",
        "20395",
        "189"
      ]
    }
  ],
  "total_hadiths": 75
}