{
  "id": "20407",
  "name": "Idris bin Yazid bin 'Abdur Rahman al-Awd إدريس بن يزيد بن عبد الرحمن الأودي",
  "full_name": "Idris bin Yazid bin 'Abdur Rahman al-Awd إدريس بن يزيد بن عبد الرحمن الأودي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kufa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Awdi",
      "al-Kufi"
    ]
  },
  "parents": [
    {
      "id": "19176",
      "name": "Yazid bin 'Abdur Rahman يزيد بن عبد الرحمن بن الأسود",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "15129",
      "name": "Da'ud bin Yazid bin Abd داود بن يزيد",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "children": [
    {
      "id": "20102",
      "name": "'Abdullah bin Idris bin Yazid al-Audi عبد الله بن إدريس بن يزيد الأودي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    }
  ],
  "teachers": [
    {
      "id": "19176",
      "name": "Yazid bin 'Abdur Rahman يزيد بن عبد الرحمن بن الأسود",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11381",
      "name": "'Amr bin Murrah bin 'Abdullah عمرو بن مرة بن عبد الله بن طارق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11356",
      "name": "Talha bin Msrf bin 'Amr طلحة بن مصرف بن عمرو بن كعب",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10770",
      "name": "Smak bin Hrb bin Aws سماك بن حرب بن أوس",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20318",
      "name": "Hammad bin Usamah حماد بن أسامة - أبو أسامة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20372",
      "name": "Ya'la bin 'Ubaid bin Umayya al-Tanafasi يعلى بن عبيد بن أبي أمية الطنافسي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2292",
      "source": " Sahih Bukhari ",
      "chapter": "Kafalah - كتاب الكفالة",
      "chapter_no": "39",
      "text_ar": "حدثنا الصلت بن محمد، حدثنا أبو أسامة، عن إدريس، عن طلحة بن مصرف، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما – ‏{‏ولكل جعلنا موالي‏}‏ قال ورثة ‏{‏والذين عقدت أيمانكم‏}‏ قال كان المهاجرون لما قدموا المدينة يرث المهاجر الأنصاري دون ذوي رحمه للأخوة التي آخى النبي صلى الله عليه وسلم بينهم، فلما نزلت ‏{‏ولكل جعلنا موالي‏}‏ نسخت، ثم قال ‏{‏والذين عقدت أيمانكم ‏}‏ إلا النصر والرفادة والنصيحة، وقد ذهب الميراث ويوصي له‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     Ibn `Abbas said, \"In the verse: To every one We have appointed ' (Muwaliya Muwaliya means one's) heirs (4.33).' (And regarding the verse) 'And those with whom your right hands have made a pledge.' Ibn `Abbas said, \"When the emigrants came to the Prophet in Medina, the emigrant would inherit the Ansari while the latter's relatives would not inherit him because of the bond of brotherhood which the Prophet established between them (i.e. the emigrants and the Ansar). When the verse: 'And to everyone We have appointed heirs' (4.33) was revealed, it canceled (the bond (the pledge) of brotherhood regarding inheritance).\" Then he said, \"The verse: To those also to whom your right hands have pledged, remained valid regarding cooperation and mutual advice, while the matter of inheritance was excluded and it became permissible to assign something in one's testament to the person who had the right of inheriting before.",
      "chain": [
        "30140",
        "20318",
        "20407",
        "11356",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "4623",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني الصلت بن محمد، حدثنا أبو أسامة، عن إدريس، عن طلحة بن مصرف، عن سعيد بن جبير، عن ابن عباس   رضى الله عنهما  ‏{‏ولكل جعلنا موالي‏}‏ قال ورثة‏.‏ ‏{‏والذين عاقدت أيمانكم‏}‏ كان المهاجرون لما قدموا المدينة يرث المهاجر الأنصاري دون ذوي رحمه للأخوة التي آخى النبي صلى الله عليه وسلم بينهم فلما نزلت ‏{‏ولكل جعلنا موالي‏}‏ نسخت، ثم قال ‏{‏والذين عاقدت أيمانكم ‏}‏ من النصر، والرفادة والنصيحة، وقد ذهب الميراث ويوصي له‏.‏ سمع أبو أسامة إدريس، وسمع إدريس طلحة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Regarding the Verse: \"To everyone, We have appointed heirs.\" (4.33) 'Mawali' means heirs. And regarding:-- \"And those to whom your right hands have pledged.\" When the Emigrants came to Medina, an Emigrant used to be the heir of an Ansari with the exclusion of the latter's relatives, and that was because of the bond of brotherhood which the Prophet had established between them (i.e. the Emigrants and the Ansar). So when the Verses:-- \"To everyone We have appointed heirs.\" was revealed, (the inheritance through bond of brotherhood) was cancelled. Ibn `Abbas then said: \"And those to whom your right hands have pledged.\" is concerned with the covenant of helping and advising each other. So allies are no longer to be the heir of each other, but they can bequeath each other some of their property by means of a will.",
      "chain": [
        "30140",
        "20318",
        "20407",
        "11356",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "6373",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "وقال ابن إدريس عن أبيه، عن أبي إسحاق، عن سعيد بن جبير، عن ابن عباس، قبض النبي صلى الله عليه وسلم وأنا ختين‏.‏",
      "text_en": "",
      "chain": [
        "20102",
        "20407",
        "11049",
        "11050"
      ]
    },
    {
      "hadith_no": "6833",
      "source": " Sahih Bukhari ",
      "chapter": "Laws of Inheritance (Al-Faraa'id) - كتاب الفرائض",
      "chapter_no": "85",
      "text_ar": "حدثني إسحاق بن إبراهيم، قال قلت لأبي أسامة حدثكم إدريس، حدثنا طلحة، عن سعيد بن جبير، عن ابن عباس، ‏{‏ولكل جعلنا موالي‏}‏ ‏{‏والذين عقدت أيمانكم‏}‏ قال كان المهاجرون حين قدموا المدينة يرث الأنصاري المهاجري دون ذوي رحمه للأخوة التي آخى النبي صلى الله عليه وسلم بينهم فلما نزلت ‏{‏جعلنا موالي‏}‏ قال نسختها ‏{‏والذين عقدت أيمانكم‏}‏",
      "text_en": " Narrated Ibn `Abbas:                     Regarding the Holy Verse:--'And to everyone, We have appointed heirs..' And:-- (4.33) 'To those also to Whom your right hands have pledged.' (4.33) When the emigrants came to Medina, the Ansar used to be the heir of the emigrants (and vice versa) instead of their own kindred by blood (Dhawl-l-arham), and that was because of the bond of brotherhood which the Prophet had established between them, i.e. the Ansar and the emigrants. But when the Divine Verse:-- 'And to everyone We have appointed heirs,' (4.33) was revealed, it cancelled the other, order i.e. 'To those also, to whom Your right hands have pledged.'",
      "chain": [
        "30123",
        "20407",
        "11356",
        "11050"
      ]
    },
    {
      "hadith_no": "2074",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، قالا حدثنا عبد الله بن إدريس، عن سهيل، عن أبيه، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا صليتم بعد الجمعة فصلوا أربعا ‏\"‏ ‏.‏ - زاد عمرو في روايته قال ابن إدريس قال سهيل فإن عجل بك شىء فصل ركعتين في المسجد وركعتين إذا رجعت ‏\"‏ ‏.‏",
      "text_en": " Suhail reported on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) said:                      When you observe prayer after (the two obligatory raklabs) of Jumu'a, you should observe four rak'ahs (and 'Amr in his narration has made this addition that Ibn Idris said this on the authority of Suhail): And if you are in a hurry on account of something, you should observe two rak'ahs in the mosque and two when you return (to your house).",
      "chain": [
        "30201",
        "30263",
        "20102",
        "20407",
        "13"
      ]
    },
    {
      "hadith_no": "5721",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، وأبو سعيد الأشج ومحمد بن المثنى العنزي - واللفظ لابن نمير - قالوا حدثنا ابن إدريس، عن أبيه، عن  سماك بن حرب، عن علقمة بن وائل، عن المغيرة بن شعبة، قال لما قدمت نجران سألوني فقالوا إنكم تقرءون يا أخت هارون وموسى قبل عيسى بكذا وكذا ‏.‏ فلما قدمت على رسول الله صلى الله عليه وسلم سألته عن ذلك فقال ‏\"‏ إنهم كانوا يسمون بأنبيائهم والصالحين قبلهم ‏\"‏ ‏.‏",
      "text_en": " Mughira b. Shu'ba reported:                      When I came to Najran, they (the Christians of Najran) asked me: You read\" O sister of Harun\" (i. e. Hadrat Maryam) in the Qur'an, whereas Moses was born much before Jesus. When I came back to Allah's Messenger (may peace be upon him) I asked him about that, whereupon he said: The (people of the old age) used to give names (to their persons) after the names of Apostles and pious persons who had gone before them.",
      "chain": [
        "30201",
        "30212",
        "30200",
        "20102",
        "20407",
        "10770",
        "10801",
        "166"
      ]
    },
    {
      "hadith_no": "7711",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Commentary - كتاب التفسير",
      "chapter_no": "57",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب - واللفظ لأبي بكر - قال حدثنا عبد، الله بن إدريس عن أبيه، عن قيس بن مسلم، عن طارق بن شهاب، قال قالت اليهود لعمر لو علينا معشر يهود نزلت هذه الآية ‏{‏ اليوم أكملت لكم دينكم وأتممت عليكم نعمتي ورضيت لكم الإسلام دينا‏}‏ نعلم اليوم الذي أنزلت فيه لاتخذنا ذلك اليوم عيدا ‏.‏ قال فقال عمر فقد علمت اليوم الذي أنزلت فيه والساعة وأين رسول الله صلى الله عليه وسلم حين نزلت نزلت ليلة جمع ونحن مع رسول الله صلى الله عليه وسلم بعرفات ‏.‏",
      "text_en": " Tariq b. Shihab reported that a Jew said to 'Umar:                      If this verse were revealed in relation to the Jews (i e. \"This day I have perfected your religion for you and have completed My favours for you and have chosen for you al-Islam as religion\") we would have taken the day of rejoicing on which this verse was revealed. Thereupon 'Umar said: I know the day on which it was revealed and the hour when it was revealed and where Allah's Messenger (may peace be upon him) had been when it was revealed. It was revealed on the night of Friday and we were in 'Arafat with Allah's Messenger (may peace be upon him) at that time.",
      "chain": [
        "30201",
        "20102",
        "20407",
        "11386",
        "3680"
      ]
    },
    {
      "hadith_no": "1559",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أيوب بن محمد الرقي، حدثنا محمد بن عبيد، حدثنا إدريس بن يزيد الأودي، عن عمرو بن مرة الجملي، عن أبي البختري الطائي، عن أبي سعيد الخدري، يرفعه إلى النبي صلى الله عليه وسلم قال ‏\"‏ ليس فيما دون خمسة أوسق زكاة ‏\"‏ ‏.‏ والوسق ستون مختوما ‏.‏ قال أبو داود أبو البختري لم يسمع من أبي سعيد ‏.‏",
      "text_en": " Narrated AbuSa'id al-Khudri:                     The Prophet (ﷺ) said: There is no zakat payable (on grain or dates) on less than five camel-loads. The wasq (one camel-load) measures sixty sa' in weight.",
      "chain": [
        "38120",
        "30213",
        "20407",
        "11381",
        "11347"
      ]
    },
    {
      "hadith_no": "2135",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا عبد الله بن إدريس، حدثني أبي، عن جدي، عن أبي هريرة، قال سئل رسول الله صلى الله عليه وسلم عن أكثر ما يدخل الناس الجنة فقال ‏\"‏ تقوى الله وحسن الخلق ‏\"‏ ‏.‏ وسئل عن أكثر ما يدخل الناس النار فقال ‏\"‏ الفم والفرج ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح غريب وعبد الله بن إدريس هو ابن يزيد بن عبد الرحمن الأودي ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah was asked about that for which people are admitted into Paradise the most, so he said:                     \"Taqwa of Allah, and good character.\" And  he was asked about that for which people are admitted into the Fire the most, and he said: \" The mouth and the private parts.\"",
      "chain": [
        "30216",
        "20102",
        "20407",
        "13"
      ]
    },
    {
      "hadith_no": "3449",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو سعيد الأشج، وأبو موسى محمد بن المثنى قالا حدثنا ابن إدريس، عن أبيه، عن سماك بن حرب، عن علقمة بن وائل، عن المغيرة بن شعبة، قال بعثني رسول الله صلى الله عليه وسلم إلى نجران فقالوا لي ألستم تقرءون ‏:‏ ‏(‏ يا أخت هارون ‏)‏ وقد كان بين عيسى وموسى ما كان فلم أدر ما أجيبهم ‏.‏ فرجعت إلى رسول الله صلى الله عليه وسلم فأخبرته فقال ‏\"‏ ألا أخبرتهم أنهم كانوا يسمون بأنبيائهم والصالحين قبلهم ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب لا نعرفه إلا من حديث ابن إدريس ‏.‏",
      "text_en": " Narrated Al-Mughirah bin Shu'bah:                     \"The Messenger of Allah (ﷺ) sent me to Najran. They said to me: 'Do you people not recite: O sister of Harun (19:28) - while between Musa and 'Eisa there is such (gap) as there is?' I did not know how to respond to them. So when I returned to the Prophet (ﷺ), I told him about that, and he said: 'Why didn't you tell them that they were named after their Prophets and righteous people before them.'\"",
      "chain": [
        "30200",
        "20102",
        "20407",
        "10770",
        "10801",
        "166"
      ]
    },
    {
      "hadith_no": "3002",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا عبد الله بن إدريس، عن أبيه، عن قيس بن مسلم، عن طارق بن شهاب، قال قال يهودي لعمر لو علينا نزلت هذه الآية لاتخذناه عيدا ‏{‏ اليوم أكملت لكم دينكم ‏}‏ قال عمر قد علمت اليوم الذي أنزلت فيه والليلة التي أنزلت ليلة الجمعة ونحن مع رسول الله صلى الله عليه وسلم بعرفات ‏.‏",
      "text_en": " It was narrated that Tariq bin Shihab said:                     A Jew said to Umar: 'If this Verse had been revealed to us, we would have taken it as a festival (Eid): This day, I have perfected your religion for you. Umar said: 'I know the day when it was reveled and the night of which it was raveled; a Friday night when we were with Messenger of Allah in Arafat.'\"",
      "chain": [
        "30123",
        "20102",
        "20407",
        "11386",
        "3680"
      ]
    },
    {
      "hadith_no": "2981",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الله بن إدريس، عن حسن بن فرات، عن أبيه، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن بني إسرائيل كانت تسوسهم أنبياؤهم كلما ذهب نبي خلفه نبي وأنه ليس كائن بعدي نبي فيكم ‏\"‏ ‏.‏ قالوا فما يكون يا رسول الله قال ‏\"‏ تكون خلفاء فيكثروا ‏\"‏ ‏.‏ قالوا فكيف نصنع قال ‏\"‏ أوفوا ببيعة الأول فالأول أدوا الذي عليكم فسيسألهم الله عز وجل عن الذي عليهم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “The affairs of the Children of Israel were administered bytheirProphets. Every time a Prophet left, he was followed by another,butthere will be no Prophet among you after I am gone.” They said:“What will happen, O Messenger of Allah?” He said: “There willbecaliphs and there will be many of them.” They said: “Whatshould wedo?” He said: “Fulfill your pledge to the first one,then the one whocomes after him, and do the duties required of you,for Allah willquestion them about the duties upon them.”",
      "chain": [
        "30201",
        "20102",
        "20407",
        "11172",
        "13"
      ]
    }
  ],
  "total_hadiths": 12
}