{
  "id": "20408",
  "name": "Asbat bin Muhammad أسباط بن محمد",
  "full_name": "Asbat bin Muhammad أسباط بن محمد",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "200",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "Quraish",
      "Client"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11395",
      "name": "Matruf bin Tarayf al-Harithi مطرف بن طريف",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11352",
      "name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10616",
      "name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "35074",
      "name": "'Ubaid bin Asbat bin Muhammad عبيد بن أسباط بن محمد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30212",
      "name": "Muhammad bin 'Abdullah bin Numayr محمد بن عبد الله بن نمير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38388",
      "name": "'Ali bin Harb bin Muhammad علي بن حرب بن محمد بن علي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "35029",
      "name": "al-Hasan bin 'Ali bin 'Affan الحسن بن علي بن عفان",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "4622",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن مقاتل، حدثنا أسباط بن محمد، حدثنا الشيباني، عن عكرمة، عن ابن عباس،‏.‏ قال الشيباني وذكره أبو الحسن السوائي ولا أظنه ذكره إلا عن ابن عباس، ‏{‏يا أيها الذين آمنوا لا يحل لكم أن ترثوا النساء كرها ولا تعضلوهن لتذهبوا ببعض ما آتيتموهن‏}‏ قال كانوا إذا مات الرجل كان أولياؤه أحق بامرأته، إن شاء بعضهم تزوجها، وإن شاءوا زوجوها، وإن شاءوا لم يزوجوها، فهم أحق بها من أهلها، فنزلت هذه الآية في ذلك‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     regarding the Divine Verse: \"O you who believe! You are forbidden to inherit women against their will, and you should not treat them with harshness that you may take back part of the (Mahr) dower you have given them.\" (4.19) (Before this revelation) if a man died, his relatives used to have the right to inherit his wife, and one of them could marry her if he would, or they would give her in marriage if they wished, or, if they wished, they would not give her in marriage at all, and they would be more entitled to dispose her, than her own relatives. So the above Verse was revealed in this connection.",
      "chain": [
        "30118",
        "20408",
        "11352",
        "11023"
      ]
    },
    {
      "hadith_no": "7034",
      "source": " Sahih Bukhari ",
      "chapter": "Saying Something under Compulsion (Ikraah) - كتاب الإكراه",
      "chapter_no": "90",
      "text_ar": "حدثنا حسين بن منصور، حدثنا أسباط بن محمد، حدثنا الشيباني، سليمان بن فيروز عن عكرمة، عن ابن عباس،‏.‏ قال الشيباني وحدثني عطاء أبو الحسن السوائي،، ولا أظنه إلا ذكره عن ابن عباس  رضى الله عنهما  ‏{‏يا أيها الذين آمنوا لا يحل لكم أن ترثوا النساء كرها‏}‏ الآية قال كانوا إذا مات الرجل كان أولياؤه أحق بامرأته، إن شاء بعضهم تزوجها، وإن شاءوا زوجها، وإن شاءوا لم يزوجها، فهم أحق بها من أهلها، فنزلت هذه الآية بذلك‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Regarding the Qur'anic Verse: 'O you who believe! You are forbidden to inherit women against their will.' (4.19) The custom (in the Pre-lslamic Period) was that if a man died, his relatives used to have the right to inherit his wife, and if one of them wished, he could marry her, or they could marry her to somebody else, or prevent her from marrying if they wished, for they had more right to dispose of her than her own relatives. Therefore this Verse was revealed concerning this matter.",
      "chain": [
        "20408",
        "11023",
        "11352",
        "17"
      ]
    },
    {
      "hadith_no": "6456",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثناه إسحاق بن إبراهيم، أخبرنا أسباط بن محمد، عن زكرياء، بهذا الإسناد مثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Zakriyya' through another chain of transmitters.",
      "chain": [
        "30123",
        "20408"
      ]
    },
    {
      "hadith_no": "1330",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو حصين بن يحيى الرازي، حدثنا أسباط بن محمد، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم بهذه القصة لم يذكر فقال لأبي بكر ‏:‏ ‏\"‏ ارفع من صوتك شيئا ‏\"‏ ‏.‏ ولعمر ‏:‏ ‏\"‏ اخفض شيئا ‏\"‏ ‏.‏ زاد ‏:‏ ‏\"‏ وقد سمعتك يا بلال وأنت تقرأ من هذه السورة ومن هذه السورة ‏\"‏ ‏.‏ قال ‏:‏ كلام طيب يجمع الله تعالى بعضه إلى بعض ‏.‏ فقال النبي صلى الله عليه وسلم ‏:‏ ‏\"‏ كلكم قد أصاب ‏\"‏ ‏.‏",
      "text_en": " This tradition has also been transmitted by Abu Hurairah through a different chain of narrators. This version dies not mention that the Prophet (ﷺ) said to Abu Bakr:                      Raise your voice a litte ; or he said to 'Umar: Lower your voice a little. But this version adds: (The Prophet said:) I heard you, Bilal, (reciting) ; you were reciting partly from this surah and partly from that surah. He said: This is all good speech ; Allah has combined one part with the other; The Prophet (ﷺ) said: All of you were correct.",
      "chain": [
        "20408",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2089",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا أسباط بن محمد، حدثنا الشيباني، عن عكرمة، عن ابن عباس، - قال الشيباني وذكره عطاء أبو الحسن السوائي ولا أظنه إلا عن ابن عباس، - في هذه الآية ‏{‏ لا يحل لكم أن ترثوا النساء كرها ولا تعضلوهن ‏}‏ قال كان الرجل إذا مات كان أولياؤه أحق بامرأته من ولي نفسها إن شاء بعضهم زوجها أو زوجوها وإن شاءوا لم يزوجوها فنزلت هذه الآية في ذلك ‏.‏",
      "text_en": " Narrated Abdullah ibn Abbas:                     About the Qur'anic verse: \"It is not lawful for you forcibly to inherit the woman (of your deceased kinsmen), nor (that) ye should put constraint upon them. When a man died, his relatives had more right to his wife then her own guardian. If any one of them wanted to marry her, he did so; or they married her (to some other person), and if they did not want to marry her, they did so. So this verse was revealed about the matter.",
      "chain": [
        "30242",
        "20408",
        "11352",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4882",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا واصل بن عبد الأعلى، حدثنا أسباط بن محمد، عن هشام بن سعد، عن زيد بن أسلم، عن أبي صالح، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ كل المسلم على المسلم حرام ماله وعرضه ودمه حسب امرئ من الشر أن يحقر أخاه المسلم ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Messenger of Allah (May peace be upon him) as saying :                      Everything of a Muslim is sacred to a Muslim : his property, honour and blood. It is enough evil for any man to despise his brother Muslim.",
      "chain": [
        "20408",
        "20519",
        "11163",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "1553",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا محمد بن عبيد المحاربي الكوفي، حدثنا أسباط بن محمد، عن سليمان التيمي، عن سيار، عن أبي أمامة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله فضلني على الأنبياء أو قال أمتي على الأمم وأحل لنا الغنائم ‏\"‏ ‏.‏ وفي الباب عن علي وأبي ذر وعبد الله بن عمرو وأبي موسى وابن عباس ‏.‏ قال أبو عيسى حديث أبي أمامة حديث حسن صحيح ‏.‏ وسيار هذا يقال له سيار مولى بني معاوية ‏.‏ وروى عنه سليمان التيمي وعبد الله بن بحير وغير واحد ‏.‏",
      "text_en": " Narrated Abu Umamah:                     That the Prophet (ﷺ) said: \"Verily, Allah has honored me over the (other) Prophets\" - or he said: \"My nation over the nations, and He has made the spoils of war lawful for us.\"",
      "chain": [
        "30213",
        "20408",
        "11289",
        "11429",
        "405"
      ]
    },
    {
      "hadith_no": "2619",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا هناد، حدثنا أسباط بن محمد، عن الأعمش، بهذا الإسناد نحوه وقال ‏\"‏ بين العبد وبين الشرك أو الكفر ترك الصلاة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح وأبو سفيان اسمه طلحة بن نافع ‏.‏",
      "text_en": " Narrated Al-A'mash:                     Similar to the previous chain and said: \"Between a slave and Shirk or disbelief is abandoning the Salat.\"",
      "chain": [
        "30480",
        "20408",
        "11060"
      ]
    },
    {
      "hadith_no": "3412",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن إسماعيل بن سمرة الأحمسي الكوفي، حدثنا أسباط بن محمد، حدثنا عمرو بن قيس الملائي، عن الحكم بن عتيبة، عن عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ معقبات لا يخيب قائلهن يسبح الله في دبر كل صلاة ثلاثا وثلاثين ويحمده ثلاثا وثلاثين ويكبره أربعا وثلاثين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ وعمرو بن قيس الملائي ثقة حافظ ‏.‏ وروى شعبة هذا الحديث عن الحكم ولم يرفعه ‏.‏ ورواه منصور بن المعتمر عن الحكم ورفعه ‏.‏",
      "text_en": " Ka’b bin Ujrah narrated that:                     The Prophet said: “There are Mu’aqqibat, he who says them shall not be miserable. Glorify Allah at the end of every prayer thirty-three times, and praise him thirty-three times, and extol His greatness thirty-four times.”",
      "chain": [
        "34188",
        "20408",
        "10803",
        "11069",
        "11196",
        "4052"
      ]
    },
    {
      "hadith_no": "93",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أسباط بن محمد، حدثنا الأعمش، عن يزيد الرقاشي، عن غنيم بن قيس، عن أبي موسى الأشعري، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ مثل القلب مثل الريشة تقلبها الرياح بفلاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Musa Al-Ash'ari said:                     \"The Messenger of Allah (ﷺ) said: 'The likeness of the heart is that of a feather blown about by the wind in the desert.'\"",
      "chain": [
        "30212",
        "20408",
        "11060",
        "14422",
        "10710",
        "41"
      ]
    },
    {
      "hadith_no": "1430",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا حفص بن غياث، وأسباط بن محمد، قالا حدثنا الأعمش، عن إبراهيم، عن عبد الرحمن بن يزيد، عن علقمة، عن أبي مسعود، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الآيتان من آخر سورة البقرة من قرأهما في ليلة كفتاه ‏\"‏ ‏.‏ قال حفص في حديثه قال عبد الرحمن فلقيت أبا مسعود وهو يطوف فحدثني به ‏.‏",
      "text_en": " It wasnarrated that Abu Mas’ud said:                      The Messenger of Allah (ﷺ)said:“Whoever recites the last two Verses of Surat Al-Baqarah atnight,that will be sufficient for him.”",
      "chain": [
        "30212",
        "20317",
        "20408",
        "11060",
        "11051",
        "11055",
        "11017",
        "402"
      ]
    },
    {
      "hadith_no": "2179",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Expiation - كتاب الكفارات",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن إسماعيل بن سمرة، حدثنا أسباط بن محمد، عن محمد بن عجلان، عن نافع، عن ابن عمر، قال سمع النبي  صلى الله عليه وسلم  رجلا يحلف بأبيه فقال ‏\"‏ لا تحلفوا بآبائكم من حلف بالله فليصدق ومن حلف له بالله فليرض ومن لم يرض بالله فليس من الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Umar said:                     \"The Messenger of Allah (ﷺ) heard a man taking an oath by his father and said: 'Do not make oaths by your forefathers. Whoever makes an oath by Allah, let him fulfill his oath, and if an oath is sworn for a person by Allah, let him accept it. Whoever is not content with Allah has nothing to do with Allah.'",
      "chain": [
        "38475",
        "20408",
        "10616",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3579",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، حدثنا أسباط بن محمد، حدثنا الأعمش، عن جعفر بن إياس، عن شهر بن حوشب، عن أبي سعيد، وجابر، قالا قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الكمأة من المن وماؤها شفاء للعين والعجوة من الجنة وهي شفاء من السم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed and Jabir that the Messenger of Allah(ﷺ) said:                      “Truffles are a type of manna, and their water is ahealing for eye (diseases). And the ‘Ajwah* are from Paradise, andthey are healing for possession.”**",
      "chain": [
        "30212",
        "20408",
        "11060",
        "11419",
        "11044",
        "38",
        "34"
      ]
    }
  ],
  "total_hadiths": 13
}