{
  "id": "20406",
  "name": "Ibrahim bin Yusuf bin Ishaq إبراهيم بن يوسف بن إسحاق",
  "full_name": "Ibrahim bin Yusuf bin Ishaq إبراهيم بن يوسف بن إسحاق",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "198",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ خ  م  د  س  ق  -  صدوق له أوهام ]"
    ],
    "tags": []
  },
  "parents": [
    {
      "id": "20473",
      "name": "Yusuf bin Ishaq bin Abi Ishaq يوسف بن إسحاق بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20473",
      "name": "Yusuf bin Ishaq bin Abi Ishaq يوسف بن إسحاق بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11049",
      "name": "Abu Ishaq al-Sabay'ai' أبو إسحاق السبيعي عمرو بن عبد الله",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "25154",
      "name": "'Abdul Jabbar bin al-'Abbas عبد الجبار بن العباس الشبامي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30216",
      "name": "Abu Karayb, Muhammad bin al-'Ala' محمد بن العلاء - أبو كريب",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20410",
      "name": "Ishaq bin Mnswr al-Slwly إسحاق بن منصور السلولي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1809",
      "source": " Sahih Bukhari ",
      "chapter": "`Umrah (Minor pilgrimage) - كتاب العمرة",
      "chapter_no": "26",
      "text_ar": "حدثنا أحمد بن عثمان، حدثنا شريح بن مسلمة، حدثنا إبراهيم بن يوسف، عن أبيه، عن أبي إسحاق، قال سألت مسروقا وعطاء ومجاهدا‏.‏ فقالوا اعتمر رسول الله صلى الله عليه وسلم في ذي القعدة قبل أن يحج‏.‏ وقال سمعت البراء بن عازب  رضى الله عنهما  يقول اعتمر رسول الله صلى الله عليه وسلم في ذي القعدة، قبل أن يحج مرتين‏.‏",
      "text_en": " Narrated Abu 'Is-haq:                     I asked Masruq, `Ata' and Mujahid (about the `Umra of Allah's Apostle). They said, \"Allah's Apostle had performed `Umra in Dhi-l-Qa'da before he performed Hajj.\" I heard Al-Bara' bin `Azib saying, \"Allah's Apostle had performed `Umra in Dhi-l-Qa'da twice before he performed Hajj.\"",
      "chain": [
        "30185",
        "20427",
        "20406",
        "20473",
        "11049"
      ]
    },
    {
      "hadith_no": "3184",
      "source": " Sahih Bukhari ",
      "chapter": "Jizyah and Mawaada'ah - كتاب الجزية والموادعة",
      "chapter_no": "58",
      "text_ar": "حدثنا أحمد بن عثمان بن حكيم، حدثنا شريح بن مسلمة، حدثنا إبراهيم بن يوسف بن أبي إسحاق، قال حدثني أبي، عن أبي إسحاق، قال حدثني البراء  رضى الله عنه أن النبي صلى الله عليه وسلم لما أراد أن يعتمر أرسل إلى أهل مكة يستأذنهم ليدخل مكة، فاشترطوا عليه أن لا يقيم بها إلا ثلاث ليال، ولا يدخلها إلا بجلبان السلاح، ولا يدعو منهم أحدا، قال فأخذ يكتب الشرط بينهم علي بن أبي طالب، فكتب هذا ما قاضى عليه محمد رسول الله‏.‏ فقالوا لو علمنا أنك رسول الله لم نمنعك ولبايعناك، ولكن اكتب هذا ما قاضى عليه محمد بن عبد الله‏.‏ فقال ‏\"‏ أنا والله محمد بن عبد الله وأنا والله رسول الله ‏\"‏‏.‏ قال وكان لا يكتب قال فقال لعلي ‏\"‏ امح رسول الله ‏\"‏‏.‏ فقال علي والله لا أمحاه أبدا‏.‏ قال ‏\"‏ فأرنيه ‏\"‏‏.‏ قال فأراه إياه، فمحاه النبي صلى الله عليه وسلم بيده، فلما دخل ومضى الأيام أتوا عليا فقالوا مر صاحبك فليرتحل‏.‏ فذكر ذلك لرسول الله صلى الله عليه وسلم فقال ‏\"‏ نعم ‏\"‏ ثم ارتحل‏.‏",
      "text_en": " Narrated Al-Bara:                     When the Prophet intended to perform the `Umra he sent a person to the people of Mecca asking their permission to enter Mecca. They stipulated that he would not stay for more than three days and would not enter it except with sheathed arms and would not preach (Islam) to any of them. So `Ali bin Abi- Talib started writing the treaty between them. He wrote, \"This is what Muhammad, Apostle of Allah has agreed to.\" The (Meccans) said, \"If we knew that you (Muhammad) are the Apostle of Allah, then we would not have prevented you and would have followed you. But write, 'This is what Muhammad bin `Abdullah has agreed to..' \" On that Allah's Apostle said, \"By Allah, I am Muhammad bin `Abdullah, and, by Allah, I am Apostle of 'Allah.\" Allah's Apostle used not to write; so he asked `Ali to erase the expression of Apostle of Allah. On that `Ali said, \"By Allah I will never erase it.\" Allah's Apostle said (to `Ali), \"Let me see the paper.\" When `Ali showed him the paper, the Prophet erased the expression with his own hand. When Allah's Apostle had entered Mecca and three days had elapsed, the Meccans came to `Ali and said, \"Let your friend (i.e. the Prophet) quit Mecca.\" `Ali informed Allah's Apostle about it and Allah's Apostle said, \"Yes,\" and then he departed.",
      "chain": [
        "30185",
        "20427",
        "20406",
        "20473",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "3589",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا أحمد بن سعيد أبو عبد الله، حدثنا إسحاق بن منصور، حدثنا إبراهيم بن يوسف، عن أبيه، عن أبي إسحاق، قال سمعت البراء، يقول كان رسول الله صلى الله عليه وسلم أحسن الناس وجها وأحسنه خلقا، ليس بالطويل البائن ولا بالقصير‏.‏",
      "text_en": " Narrated Al-Bara:                     Allah's Apostle was the handsomest of all the people, and had the best appearance. He was neither very tall nor short.",
      "chain": [
        "30296",
        "30313",
        "20406",
        "20473",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "3809",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثني محمد بن العلاء، حدثنا إبراهيم بن يوسف بن أبي إسحاق، قال حدثني أبي، عن أبي إسحاق، قال حدثني الأسود بن يزيد، قال سمعت أبا موسى الأشعري  رضى الله عنه  يقول قدمت أنا وأخي من اليمن، فمكثنا حينا ما نرى إلا أن عبد الله بن مسعود رجل من أهل بيت النبي صلى الله عليه وسلم، لما نرى من دخوله ودخول أمه على النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Musa Al-Ash`ari:                     My brother and I came from Yemen, and for some time we continued to consider `Abdullah bin Mas`ud as one of the members of the family of the Prophet because we used to see him and his mother going in the house of the Prophet very often.",
      "chain": [
        "30216",
        "20406",
        "20473",
        "11049",
        "11054",
        "41"
      ]
    },
    {
      "hadith_no": "3965",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا أحمد بن عثمان، حدثنا شريح بن مسلمة، حدثنا إبراهيم بن يوسف، عن أبيه، عن أبي إسحاق، قال سمعت البراء، يحدث قال ابتاع أبو بكر من عازب رحلا فحملته معه قال فسأله عازب عن مسير رسول الله صلى الله عليه وسلم قال أخذ علينا بالرصد، فخرجنا ليلا، فأحثثنا ليلتنا ويومنا حتى قام قائم الظهيرة، ثم رفعت لنا صخرة، فأتيناها ولها شىء من ظل قال ففرشت لرسول الله صلى الله عليه وسلم فروة معي، ثم اضطجع عليها النبي صلى الله عليه وسلم فانطلقت أنفض ما حوله، فإذا أنا براع قد أقبل في غنيمة يريد من الصخرة مثل الذي أردنا فسألته لمن أنت يا غلام فقال أنا لفلان‏.‏ فقلت له هل في غنمك من لبن قال نعم‏.‏ قلت له هل أنت حالب قال نعم‏.‏ فأخذ شاة من غنمه فقلت له انفض الضرع‏.‏ قال فحلب كثبة من لبن، ومعي إداوة من ماء عليها خرقة قد روأتها لرسول الله صلى الله عليه وسلم فصببت على اللبن حتى برد أسفله، ثم أتيت به النبي صلى الله عليه وسلم فقلت اشرب يا رسول الله‏.‏ فشرب رسول الله صلى الله عليه وسلم حتى رضيت، ثم ارتحلنا والطلب في إثرنا‏.‏",
      "text_en": " Narrated Al-Bara:                     Abu Bakr bought a (camel's) saddle from `Azib, and I carried it for him. `Azib (i.e. my father) asked Abu Bakr regarding the journey of the migration of Allah's Apostle. Abu Bakr said, \"Close observers were appointed by our enemies to watch us. So we went out at night and travelled throughout the night and the following day till it was noon, then we perceived a rock and went towards it, and there was some shade under it. I spread a cloak I had with me for Allah's Apostle and then the Prophet layed on it. I went out to guard him and all of a sudden I saw a shepherd coming with his sheep looking for the same, the shade of the rock as we did, I asked him, 'O boy, to whom do you belong?' He replied, 'I belong to so-and-so.' I asked him, 'Is there some milk in your sheep?' He replied in the affirmative. I asked him, 'Will you milk?' He replied in the affirmative. Then he got hold of one of his sheep. I said to him, 'Remove the dust from its udder.' Then he milked a little milk. I had a water-skin with me which was tied with a piece of cloth. I had prepared the water-skin for Allah's Apostle . So I poured some water over the milk (container) till its bottom became cold. Then I brought the milk to the Prophet and said, 'Drink, O Allah's Apostle.' Allah's Apostle drank till I became pleased. Then we departed and the pursuers were following us.\" Al-Bara added: I then went with Abu Bakr into his home (carrying that saddle) and there I saw his daughter `Aisha Lying in a bed because of heavy fever and I saw her father Abu Bakr kissing her cheek and saying, \"How are you, little daughter?\"",
      "chain": [
        "30185",
        "20427",
        "20406",
        "20473",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "3998",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني أحمد بن عثمان، حدثنا شريح بن مسلمة، حدثنا إبراهيم بن يوسف، عن أبيه، عن أبي إسحاق، قال حدثني عمرو بن ميمون، أنه سمع عبد الله بن مسعود  رضى الله عنه  حدث عن سعد بن معاذ، أنه قال كان صديقا لأمية بن خلف، وكان أمية إذا مر بالمدينة نزل على سعد، وكان سعد إذا مر بمكة نزل على أمية، فلما قدم رسول الله صلى الله عليه وسلم المدينة انطلق سعد معتمرا، فنزل على أمية بمكة، فقال لأمية انظر لي ساعة خلوة لعلي أن أطوف بالبيت‏.‏ فخرج به قريبا من نصف النهار فلقيهما أبو جهل فقال يا أبا صفوان، من هذا معك فقال هذا سعد‏.‏ فقال له أبو جهل ألا أراك تطوف بمكة آمنا، وقد أويتم الصباة، وزعمتم أنكم تنصرونهم وتعينونهم، أما والله لولا أنك مع أبي صفوان ما رجعت إلى أهلك سالما‏.‏ فقال له سعد ورفع صوته عليه أما والله لئن منعتني هذا لأمنعنك ما هو أشد عليك منه طريقك على المدينة‏.‏ فقال له أمية لا ترفع صوتك يا سعد على أبي الحكم سيد أهل الوادي‏.‏ فقال سعد دعنا عنك يا أمية، فوالله لقد سمعت رسول الله صلى الله عليه وسلم يقول إنهم قاتلوك‏.‏ قال بمكة قال لا أدري‏.‏ ففزع لذلك أمية فزعا شديدا، فلما رجع أمية إلى أهله قال يا أم صفوان، ألم ترى ما قال لي سعد قالت وما قال لك قال زعم أن محمدا أخبرهم أنهم قاتلي، فقلت له بمكة قال لا أدري‏.‏ فقال أمية والله لا أخرج من مكة، فلما كان يوم بدر استنفر أبو جهل الناس قال أدركوا عيركم‏.‏ فكره أمية أن يخرج، فأتاه أبو جهل فقال يا أبا صفوان، إنك متى ما يراك الناس قد تخلفت وأنت سيد أهل الوادي تخلفوا معك، فلم يزل به أبو جهل حتى قال أما إذ غلبتني، فوالله لأشترين أجود بعير بمكة ثم قال أمية يا أم صفوان جهزيني‏.‏ فقالت له يا أبا صفوان وقد نسيت ما قال لك أخوك اليثربي قال لا، ما أريد أن أجوز معهم إلا قريبا‏.‏ فلما خرج أمية أخذ لا ينزل منزلا إلا عقل بعيره، فلم يزل بذلك حتى قتله الله عز وجل ببدر‏.‏",
      "text_en": " Narrated `Abdullah bin Mas`ud:                     From Sa`d bin Mu`adh: Sa`d bin Mu`adh was an intimate friend of Umaiya bin Khalaf and whenever Umaiya passed through Medina, he used to stay with Sa`d, and whenever Sa`d went to Mecca, he used to stay with Umaiya. When Allah's Apostle arrived at Medina, Sa`d went to perform `Umra and stayed at Umaiya's home in Mecca. He said to Umaiya, \"Tell me of a time when (the Mosque) is empty so that I may be able to perform Tawaf around the Ka`ba.\" So Umaiya went with him about midday. Abu Jahl met them and said, \"O Abu Safwan! Who is this man accompanying you?\" He said, \"He is Sa`d.\" Abu Jahl addressed Sa`d saying, \"I see you wandering about safely in Mecca inspite of the fact that you have given shelter to the people who have changed their religion (i.e. became Muslims) and have claimed that you will help them and support them. By Allah, if you were not in the company of Abu Safwan, you would not be able to go your family safely.\" Sa`d, raising his voice, said to him, \"By Allah, if you should stop me from doing this (i.e. performing Tawaf) I would certainly prevent you from something which is more valuable for you, that is, your passage through Medina.\" On this, Umaiya said to him, \"O Sa`d do not raise your voice before Abu-l-Hakam, the chief of the people of the Valley (of Mecca).\" Sa`d said, \"O Umaiya, stop that! By Allah, I have heard Allah's Apostle predicting that the Muslim will kill you.\" Umaiya asked, \"In Mecca?\" Sa`d said, \"I do not know.\" Umaiya was greatly scared by that news. When Umaiya returned to his family, he said to his wife, \"O Um Safwan! Don't you know what Sa`d told me? \"She said, \"What has he told you?\" He replied, \"He claims that Muhammad has informed them (i.e. companions that they will kill me. I asked him, 'In Mecca?' He replied, 'I do not know.\" Then Umaiya added, \"By Allah, I will never go out of Mecca.\" But when the day of (the Ghazwa of) Badr came, Abu Jahl called the people to war, saying, \"Go and protect your caravan.\" But Umaiya disliked to go out (of Mecca). Abu Jahl came to him and said, \"O Abu Safwan! If the people see you staying behind though you are the chief of the people of the Valley, then they will remain behind with you.\" Abu Jahl kept on urging him to go until he (i.e. Umaiya) said, \"As you have forced me to change my mind, by Allah, I will buy the best camel in Mecca. Then Umaiya said (to his wife). \"O Um Safwan, prepare what I need (for the journey).\" She said to him, \"O Abu Safwan! Have you forgotten what your Yathribi brother told you?\" He said, \"No, but I do not want to go with them but for a short distance.\" So when Umaiya went out, he used to tie his camel wherever he camped. He kept on doing that till Allah caused him to be killed at Badr.",
      "chain": [
        "30185",
        "20427",
        "20406",
        "20473",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "hadith_no": "4019",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني أحمد بن سعيد أبو عبد الله، حدثنا إسحاق بن منصور، حدثنا إبراهيم بن يوسف، عن أبيه، عن أبي إسحاق، سأل رجل البراء وأنا أسمع، قال أشهد علي بدرا قال بارز وظاهر‏.‏",
      "text_en": " Narrated Abu 'Is-haq:                     A man asked Al-Bara' and I was listening, \"Did `Ali take part in (the battle of) Badr?\" Al-Bara' said, \"(Yes). he even met (his enemies) in a duel and was clad in two armors (one over the other).",
      "chain": [
        "30296",
        "30313",
        "20406",
        "20473",
        "11049"
      ]
    },
    {
      "hadith_no": "4090",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا أحمد بن عثمان، حدثنا شريح  هو ابن مسلمة  حدثنا إبراهيم بن يوسف، عن أبيه، عن أبي إسحاق، قال سمعت البراء  رضى الله عنه  قال بعث رسول الله صلى الله عليه وسلم إلى أبي رافع عبد الله بن عتيك وعبد الله بن عتبة في ناس معهم، فانطلقوا حتى دنوا من الحصن، فقال لهم عبد الله بن عتيك امكثوا أنتم حتى أنطلق أنا فأنظر‏.‏ قال فتلطفت أن أدخل الحصن، ففقدوا حمارا لهم  قال  فخرجوا بقبس يطلبونه  قال  فخشيت أن أعرف  قال  فغطيت رأسي كأني أقضي حاجة، ثم نادى صاحب الباب من أراد أن يدخل فليدخل قبل أن أغلقه‏.‏ فدخلت ثم اختبأت في مربط حمار عند باب الحصن، فتعشوا عند أبي رافع وتحدثوا حتى ذهبت ساعة من الليل، ثم رجعوا إلى بيوتهم، فلما هدأت الأصوات ولا أسمع حركة خرجت  قال  ورأيت صاحب الباب حيث وضع مفتاح الحصن، في كوة فأخذته ففتحت به باب الحصن‏.‏ قال قلت إن نذر بي القوم انطلقت على مهل، ثم عمدت إلى أبواب بيوتهم، فغلقتها عليهم من ظاهر، ثم صعدت إلى أبي رافع في سلم، فإذا البيت مظلم قد طفئ سراجه، فلم أدر أين الرجل، فقلت يا أبا رافع‏.‏ قال من هذا قال فعمدت نحو الصوت فأضربه، وصاح فلم تغن شيئا  قال  ثم جئت كأني أغيثه فقلت ما لك يا أبا رافع وغيرت صوتي‏.‏ فقال ألا أعجبك لأمك الويل، دخل على رجل فضربني بالسيف‏.‏ قال فعمدت له أيضا فأضربه أخرى فلم تغن شيئا، فصاح وقام أهله، قال ثم جئت وغيرت صوتي كهيئة المغيث، فإذا هو مستلق على ظهره، فأضع السيف في بطنه ثم أنكفئ عليه حتى سمعت صوت العظم، ثم خرجت دهشا حتى أتيت السلم أريد أن أنزل، فأسقط منه فانخلعت رجلي فعصبتها، ثم أتيت أصحابي أحجل فقلت انطلقوا فبشروا رسول الله صلى الله عليه وسلم فإني لا أبرح حتى أسمع الناعية، فلما كان في وجه الصبح صعد الناعية فقال أنعى أبا رافع‏.‏ قال فقمت أمشي ما بي قلبة، فأدركت أصحابي قبل أن يأتوا النبي صلى الله عليه وسلم فبشرته‏.‏",
      "text_en": " Narrated Al-Bara:                     Allah's Apostle sent `Abdullah bin 'Atik and `Abdullah bin `Utba with a group of men to Abu Rafi` (to kill him). They proceeded till they approached his castle, whereupon `Abdullah bin Atik said to them, \"Wait (here), and in the meantime I will go and see.\" `Abdullah said later on, \"I played a trick in order to enter the castle. By chance, they lost a donkey of theirs and came out carrying a flaming light to search for it. I was afraid that they would recognize me, so I covered my head and legs and pretended to answer the call to nature. The gatekeeper called, 'Whoever wants to come in, should come in before I close the gate.' So I went in and hid myself in a stall of a donkey near the gate of the castle. They took their supper with Abu Rafi` and had a chat till late at night. Then they went back to their homes. When the voices vanished and I no longer detected any movement, I came out. I had seen where the gate-keeper had kept the key of the castle in a hole in the wall. I took it and unlocked the gate of the castle, saying to myself, 'If these people should notice me, I will run away easily.' Then I locked all the doors of their houses from outside while they were inside, and ascended to Abu Rafi` by a staircase. I saw the house in complete darkness with its light off, and I could not know where the man was. So I called, 'O Abu Rafi`!' He replied, 'Who is it?' I proceeded towards the voice and hit him. He cried loudly but my blow was futile. Then I came to him, pretending to help him, saying with a different tone of my voice, ' What is wrong with you, O Abu Rafi`?' He said, 'Are you not surprised? Woe on your mother! A man has come to me and hit me with a sword!' So again I aimed at him and hit him, but the blow proved futile again, and on that Abu Rafi` cried loudly and his wife got up. I came again and changed my voice as if I were a helper, and found Abu Rafi` lying straight on his back, so I drove the sword into his belly and bent on it till I heard the sound of a bone break. Then I came out, filled with astonishment and went to the staircase to descend, but I fell down from it and got my leg dislocated. I bandaged it and went to my companions limping. I said (to them), 'Go and tell Allah's Apostle of this good news, but I will not leave (this place) till I hear the news of his (i.e. Abu Rafi`'s) death.' When dawn broke, an announcer of death got over the wall and announced, 'I convey to you the news of Abu Rafi`'s death.' I got up and proceeded without feeling any pain till I caught up with my companions before they reached the Prophet to whom I conveyed the good news.\"",
      "chain": [
        "30185",
        "20427",
        "20406",
        "20473",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "4156",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني أحمد بن عثمان، حدثنا شريح بن مسلمة، قال حدثني إبراهيم بن يوسف، قال حدثني أبي، عن أبي إسحاق، قال سمعت البراء، يحدث قال لما كان يوم الأحزاب، وخندق رسول الله صلى الله عليه وسلم رأيته ينقل من تراب الخندق حتى وارى عني الغبار جلدة بطنه، وكان كثير الشعر، فسمعته يرتجز بكلمات ابن رواحة، وهو ينقل من التراب يقول اللهم لولا أنت ما اهتدينا ولا تصدقنا ولا صلينا فأنزلن سكينة علينا وثبت الأقدام إن لاقينا إن الألى قد بغوا علينا وإن أرادوا فتنة أبينا قال ثم يمد صوته بآخرها‏.‏",
      "text_en": " Narrated Al-Bara:                     When it was the day of Al-Ahzab (i.e. the clans) and Allah's Apostle dug the trench, I saw him carrying earth out of the trench till dust made the skin of his `Abdomen out of my sight and he was a hairy man. I heard him reciting the poetic verses composed by Ibn Rawaha while he was carrying the earth, \"O Allah! Without You we would not have been guided, nor would we have given in charity, nor would we have prayed. So, (O Allah), please send Sakina (i.e. calmness) upon us and make our feet firm if we meet the enemy, as they have rebelled against us. And if they intend affliction (i.e. want to frighten us, and fight against us) then we would not (flee but withstand them).\" The Prophet would then prolong his voice at the last words.",
      "chain": [
        "30185",
        "20427",
        "20406",
        "20473",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "4392",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني أحمد بن عثمان، حدثنا شريح بن مسلمة، حدثنا إبراهيم بن يوسف بن إسحاق بن أبي إسحاق، حدثني أبي، عن أبي إسحاق، سمعت البراء  رضى الله عنه ‏.‏ بعثنا رسول الله صلى الله عليه وسلم مع خالد بن الوليد إلى اليمن، قال ثم بعث عليا بعد ذلك مكانه فقال مر أصحاب خالد، من شاء منهم أن يعقب معك فليعقب، ومن شاء فليقبل‏.‏ فكنت فيمن عقب معه، قال فغنمت أواق ذوات عدد‏.‏",
      "text_en": " Narrated Al-Bara:                     Allah's Apostle sent us to Yemen along with Khalid bin Al-Walid. Later on he sent `Ali bin Abi Talib in his place. The Prophet said to `Ali, \"Give Khalid's companions the choice of either staying with you (in Yemen) or returning to Medina.\" I was one of those who stayed with him (i.e. `Ali) and got several Awaq (of gold from the war booty.",
      "chain": [
        "30185",
        "20427",
        "20406",
        "20473",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "4549",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبيد الله، عن إسرائيل، عن أبي إسحاق، عن البراء، وحدثنا أحمد بن عثمان، حدثنا شريح بن مسلمة، قال حدثني إبراهيم بن يوسف، عن أبيه، عن أبي إسحاق، قال سمعت البراء  رضى الله عنه ‏.‏ لما نزل صوم رمضان كانوا لا يقربون النساء رمضان كله، وكان رجال يخونون أنفسهم، فأنزل الله ‏{‏علم الله أنكم كنتم تختانون أنفسكم فتاب عليكم وعفا عنكم‏}‏‏.‏",
      "text_en": " Narrated Al-Bara:                     When the order of compulsory fasting of Ramadan was revealed, the people did not have sexual relations with their wives for the whole month of Ramadan, but some men cheated themselves (by violating that restriction). So Allah revealed:-- \"Allah is aware that you were deceiving yourselves but He accepted your repentance and for gave you..\" (3.187)",
      "chain": [
        "11201",
        "20311",
        "11049",
        "400",
        "30185",
        "20427",
        "20406",
        "20473",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "2895",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني محمد بن حاتم، حدثني إسحاق بن منصور، - وهو السلولي - حدثنا إبراهيم بن يوسف، - وهو ابن إسحاق بن أبي إسحاق السبيعي - عن أبيه، عن أبي، إسحاق سمع ابن الأسود، يذكر عن أبيه، عن عائشة، - رضى الله عنها - قالت كان رسول الله صلى الله عليه وسلم إذا أراد أن يحرم يتطيب بأطيب ما يجد ثم أرى وبيص الدهن في رأسه ولحيته بعد ذلك ‏.‏",
      "text_en": " 'A'isha (Allah be pleased with her) reported that when the Messenger of Allah (may peace be upon him) intended to enter upon the state of Ihram he perfumed himself with the best of perfumes which he could find and after that I saw the glisten- ing of oil on his head and beard.",
      "chain": [
        "38487",
        "20410",
        "20406",
        "20473",
        "11049",
        "53"
      ]
    },
    {
      "hadith_no": "6212",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا أبو كريب، محمد بن العلاء حدثنا إسحاق بن منصور، عن إبراهيم بن، يوسف عن أبيه، عن أبي إسحاق، قال سمعت البراء، يقول كان رسول الله صلى الله عليه وسلم أحسن الناس وجها وأحسنهم خلقا ليس بالطويل الذاهب ولا بالقصير ‏.‏",
      "text_en": " Al-Bara' reported that Allah's Messenger (may peace be upon him) had the most handsome face amongst men and he had the best disposition and he was neither very tall nor short-statured.",
      "chain": [
        "30216",
        "30313",
        "20406",
        "20473",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "6481",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنيه محمد بن حاتم، حدثنا إسحاق بن منصور، حدثنا إبراهيم بن يوسف، عن أبيه، عن أبي إسحاق، أنه سمع الأسود، يقول سمعت أبا موسى، يقول لقد قدمت أنا  وأخي، من اليمن ‏.‏ فذكر بمثله ‏.‏",
      "text_en": " Abu Musa. reported:                      I came to Allah's Messenger (may peace be upon him) and thought that 'Abdullah was amongst the members of the family, or like that.",
      "chain": [
        "30313",
        "20406",
        "20473",
        "11049",
        "11054",
        "30170"
      ]
    },
    {
      "hadith_no": "2709",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن العلاء، قال أخبرنا إبراهيم، - يعني ابن يوسف بن إسحاق بن أبي إسحاق السبيعي - عن أبيه، عن أبي إسحاق السبيعي، حدثني أبو عبيدة، عن أبيه، قال مررت فإذا أبو جهل صريع قد ضربت رجله فقلت يا عدو الله يا أبا جهل قد أخزى الله الأخر ‏.‏ قال ولا أهابه عند ذلك ‏.‏ فقال أبعد من رجل قتله قومه فضربته بسيف غير طائل فلم يغن شيئا حتى سقط سيفه من يده فضربته به حتى برد ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     I passed when AbuJahl had fallen as his foot was struck (with the swords). I said: O enemy of Allah, AbuJahl, Allah has disgraced a man who was far away from His mercy. I did not fear him at that moment. He replied: It is most strange that a man has been killed by his people. I struck him with a blunt sword. But it did not work, and then his sword fell down from his hand, I struck him with it until he became dead.",
      "chain": [
        "30216",
        "20406",
        "20473",
        "11049"
      ]
    },
    {
      "hadith_no": "5222",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عبد الله بن سالم، حدثنا إبراهيم بن يوسف، عن أبيه، عن أبي إسحاق، عن البراء، قال دخلت مع أبي بكر أول ما قدم المدينة فإذا عائشة ابنته مضطجعة قد أصابتها حمى فأتاها أبو بكر فقال لها كيف أنت يا بنية وقبل خدها ‏.‏",
      "text_en": " Narrated Al-Bara' ibn Azib:                     I went in with AbuBakr when he had newly come to Medina and he found his daughter Aisha lying down afflicted with fever. AbuBakr went to her, and saying: How are you, girlie? kissed her on the cheek.",
      "chain": [
        "35061",
        "20406",
        "20473",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "2084",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Righteousness And Maintaining Good Relations With Relatives - كتاب البر والصلة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "27",
      "text_ar": "حدثنا أبو كريب، حدثنا إبراهيم بن يوسف بن أبي إسحاق، عن أبيه، عن أبي إسحاق، عن طلحة بن مصرف، قال سمعت عبد الرحمن بن عوسجة، يقول سمعت البراء بن عازب، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من منح منيحة لبن أو ورق أو هدى زقاقا كان له مثل عتق رقبة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من حديث أبي إسحاق عن طلحة بن مصرف لا نعرفه إلا من هذا الوجه ‏.‏ وقد روى منصور بن المعتمر وشعبة عن طلحة بن مصرف هذا الحديث ‏.‏ وفي الباب عن النعمان بن بشير ‏.‏ ومعنى قوله ‏\"‏ من منح منيحة ورق ‏\"‏ ‏.‏ إنما يعني به قرض الدراهم قوله ‏\"‏ أو هدى زقاقا ‏\"‏ ‏.‏ يعني به هداية الطريق ‏.‏",
      "text_en": " Al-Bara bin Azib narrated that the Messenger of Allah said :                     \"Whoever gives someone some milk or silver, or guides him through a strait, then he will have the reward similar to freeing a slave.\"",
      "chain": [
        "30216",
        "20406",
        "20473",
        "11049",
        "11356",
        "19875",
        "400"
      ]
    },
    {
      "hadith_no": "3399",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا أبو كريب، أخبرنا إسحاق بن منصور، - هو السلولي عن إبراهيم بن يوسف بن أبي إسحاق، عن أبيه، عن أبي إسحاق، عن أبي بردة، عن البراء بن عازب، رضى الله عنهما قال كان رسول الله صلى الله عليه وسلم يتوسد يمينه عند المنام ثم يقول ‏\"‏ رب قني عذابك يوم تبعث عبادك ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه ‏.‏ وروى الثوري هذا الحديث عن أبي إسحاق عن البراء لم يذكر بينهما أحدا وروى شعبة عن أبي إسحاق عن أبي عبيدة ورجل آخر عن البراء ‏.‏ وروى إسرائيل عن أبي إسحاق عن عبد الله بن يزيد عن البراء وعن أبي إسحاق عن أبي عبيدة عن عبد الله عن النبي صلى الله عليه وسلم مثله ‏.‏",
      "text_en": " Al-Bara bin Azib [may Allah be pleased with him] narrated that:                     The Messenger ofAllah used to lay his head upon his right hand when doing to sleep, then say: “My Lord, safeguard me from Your punishment the Day You resurrect Your slaves (Rabbi Qini Adhabaka Yawma Tab’athu Ibadak).”",
      "chain": [
        "30216",
        "20410",
        "20406",
        "20473",
        "11049",
        "11901",
        "400"
      ]
    },
    {
      "hadith_no": "4176",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو كريب، حدثنا إبراهيم بن يوسف بن أبي إسحاق، عن أبيه، عن أبي إسحاق، عن الأسود بن يزيد، أنه سمع أبا موسى، يقول لقد قدمت أنا وأخي، من اليمن وما نرى حينا إلا أن عبد الله بن مسعود رجل من أهل بيت النبي صلى الله عليه وسلم لما نرى من دخوله ودخول أمه على النبي صلى الله عليه وسلم ‏.‏ قال أبو عيسى هذا حديث حسن صحيح غريب من هذا الوجه ‏.‏ وقد رواه سفيان الثوري عن أبي إسحاق ‏.‏",
      "text_en": " Narrated Abu Musa:                     \"My brother and I arrived from Yemen, and we did not see a period except that we thought 'Abdullah bin Mas'ud was a man from the people of the house of the Prophet (ﷺ), due to what we would see of him entering, and his mother's entering, upon the Prophet (ﷺ).\"",
      "chain": [
        "30216",
        "20406",
        "20473",
        "11049",
        "11054",
        "30170"
      ]
    }
  ],
  "total_hadiths": 19
}