{
  "id": "20400",
  "name": "'Abdur Rahman bin Namr al-Yahasbi عبد الرحمن بن نمر اليحصبي",
  "full_name": "'Abdur Rahman bin Namr al-Yahasbi عبد الرحمن بن نمر اليحصبي",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Damascus"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  س  -  ثقة ]"
    ],
    "tags": [
      "al-Damashqi"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ خ  م  د  س  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ خ  م  د  س  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ خ  م  د  س  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Damascus",
        "ar": "دمشق",
        "ckb": "دیمەشق"
      }
    ],
    "tags_display": [
      {
        "en": "al-Damashqi",
        "ar": "al-Damashqi",
        "ckb": "al-Damashqi"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "11066",
      "name": "Makhul al-Shami/al-Damashiqi مكحول الشامي",
      "grade": "Follower(Tabi') [5th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [5th Generation]",
        "ar": "تابعي [الجيل الخامس]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی پێنجەم]"
      }
    }
  ],
  "students": [
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1066",
      "hadith_no": "1066",
      "source": "Sahih Bukhari",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن مهران، قال حدثنا الوليد، قال أخبرنا ابن نمر، سمع ابن شهاب، عن عروة، عن عائشة  رضى الله عنها  جهر النبي صلى الله عليه وسلم في صلاة الخسوف بقراءته، فإذا فرغ من قراءته كبر فركع، وإذا رفع من الركعة قال سمع الله لمن حمده، ربنا ولك الحمد‏.‏ ثم يعاود القراءة في صلاة الكسوف، أربع ركعات في ركعتين وأربع سجدات‏.‏ وقال الأوزاعي وغيره سمعت الزهري، عن عروة، عن عائشة  رضى الله عنها  أن الشمس، خسفت على عهد رسول الله صلى الله عليه وسلم فبعث مناديا بالصلاة جامعة، فتقدم فصلى أربع ركعات في ركعتين وأربع سجدات‏.‏ وأخبرني عبد الرحمن بن نمر سمع ابن شهاب مثله‏.‏ قال الزهري فقلت ما صنع أخوك ذلك، عبد الله بن الزبير ما صلى إلا ركعتين مثل الصبح إذ صلى بالمدينة‏.‏ قال أجل، إنه أخطأ السنة‏.‏ تابعه سفيان بن حسين وسليمان بن كثير عن الزهري في الجهر‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet (p.b.u.h) recited (the Qur'an) aloud during the eclipse prayer and when he had finished the eclipse prayer he said the Takbir and bowed. When he stood straight from bowing he would say \"Sami 'al-l-ahu Lyman hamidah Rabbana wa laka l-hamd.\" And he would again start reciting. In the eclipse prayer there are four bowing and four prostrations in two rak`at. Al-Auza'i and others said that they had heard Az-Zuhi from 'Ursa from `Aisha saying, \"In the lifetime of Allah's Apostle the sun eclipsed, and he made a person to announce: 'Prayer in congregation.' He led the prayer and performed four bowing and four prostrations in two rak`at.\" Narrated Al-Walid that `Abdur-Rahman bin Namir had informed him that he had heard the same. Ibn Shihab heard the same. Az-Zuhri said, \"I asked ('Ursa), 'What did your brother `Abdullah bin Az-Zubair do? He prayed two rak`at (of the eclipse prayer) like the morning prayer, when he offered the (eclipse) prayer in Median.' 'Ursa replied that he had missed (i.e. did not pray according to) the Prophet's tradition.\" Sulaiman bin Kathir and Sufyan bin Husain narrated from Az-Zuhri that the prayer for the eclipse used to be offered with loud recitation.",
      "usc_msa_ref": "",
      "chain": [
        "30383",
        "20733",
        "20400",
        "11013",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sunan-abi-daud-1190",
      "hadith_no": "1190",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Book Of The Prayer For Rain (Kitab al-Istisqa') - كتاب الاستسقاء",
      "chapter_no": "3",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا الوليد، حدثنا عبد الرحمن بن نمر، أنه سأل الزهري فقال الزهري أخبرني عروة، عن عائشة، قالت كسفت الشمس فأمر رسول الله صلى الله عليه وسلم رجلا فنادى أن الصلاة جامعة ‏.‏",
      "text_en": " Narrated A'ishah (May Allah be pleased with her):                     There was an eclipse of the sun.  The Messenger of Allah (ﷺ) commanded a man who summoned: \"The prayer will be held in congregation\"",
      "usc_msa_ref": "",
      "chain": [
        "38429",
        "20733",
        "20400",
        "11013",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "sunan-an-nasai-573",
      "hadith_no": "573",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرني محمود بن غيلان، حدثنا الوليد، قال أخبرني عبد الرحمن بن نمر، عن ابن شهاب، عن عطاء بن يزيد، عن أبي سعيد الخدري، عن رسول الله صلى الله عليه وسلم بنحوه ‏.‏",
      "text_en": " (Another chain) from Abu Sa'eed Al-Khudri, from the Messenger of Allah (ﷺ) with a similar report.",
      "usc_msa_ref": "",
      "chain": [
        "30277",
        "20733",
        "20400",
        "11013",
        "11206",
        "38"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1494",
      "hadith_no": "1494",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا الوليد، قال حدثنا عبد الرحمن بن نمر، أنه سمع الزهري، يحدث عن عروة، عن عائشة، عن رسول الله صلى الله عليه وسلم أنه صلى أربع ركعات في أربع سجدات وجهر فيها بالقراءة كلما رفع رأسه قال ‏\"‏ سمع الله لمن حمده ربنا ولك الحمد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Aishah that:                     The Messenger of Allah (ﷺ) prayed, bowing four times, and he recited loudly, and every time he raised his head he said: \"Sami Allahu liman hamidah. Rabbana wa lakal-hamd (Allah hears those who praise Him, Our Lord to You be praise.).\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20733",
        "20400",
        "11013",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-1497",
      "hadith_no": "1497",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرني عمرو بن عثمان بن سعيد بن كثير، عن الوليد، عن عبد الرحمن بن نمر، أنه سأل الزهري عن سنة، صلاة الكسوف فقال أخبرني عروة بن الزبير، عن عائشة، قالت كسفت الشمس فأمر رسول الله صلى الله عليه وسلم رجلا فنادى أن الصلاة جامعة فاجتمع الناس فصلى بهم رسول الله صلى الله عليه وسلم فكبر ثم قرأ قراءة طويلة ثم كبر فركع ركوعا طويلا مثل قيامه أو أطول ثم رفع رأسه وقال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ثم قرأ قراءة طويلة هي أدنى من القراءة الأولى ثم كبر فركع ركوعا طويلا هو أدنى من الركوع الأول ثم رفع رأسه فقال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ثم كبر فسجد سجودا طويلا مثل ركوعه أو أطول ثم كبر فرفع رأسه ثم كبر فسجد ثم كبر فقام فقرأ قراءة طويلة هي أدنى من الأولى ثم كبر ثم ركع ركوعا طويلا هو أدنى من الركوع الأول ثم رفع رأسه فقال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ثم قرأ قراءة طويلة وهي أدنى من القراءة الأولى في القيام الثاني ثم كبر فركع ركوعا طويلا دون الركوع الأول ثم كبر فرفع رأسه فقال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ثم كبر فسجد أدنى من سجوده الأول ثم تشهد ثم سلم فقام فيهم فحمد الله وأثنى عليه ثم قال ‏\"‏ إن الشمس والقمر لا ينخسفان لموت أحد ولا لحياته ولكنهما آيتان من آيات الله فأيهما خسف به أو بأحدهما فافزعوا إلى الله عز وجل بذكر الصلاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Aishah said:                     \"There was an eclipse of the sun and the Messenger of Allah (ﷺ) ordered a man to call out: As-salatu jami'ah (prayer is about to begin in congregation). The people gathered and the Messenger of Allah (ﷺ) led them in prayer. He said the takbir, then he recited at length. Then he said the takbir and bowed for a long time, as long as he had recited or longer. Then he raised his head and said: Sami Allahu liman hamidah (Allah hears those who praise Him) Then he recited at length, but it was shorter than the first time, then he said the takbir and bowed for a long time, but it was shorter than the first time. Then he raised his head and said: 'Sami Allahu liman hamidah (Allah hears those who praise Him). Then he said the takbir and prostrated for a long time, as long as he had bowed or longer. Then he said the takbir and raised his head, then he said the takbir and prostrated. Then he said the takbir and stood up, and recited for a long time that was shorter than the first time. Then he said the takbir and bowed for a long time that was shorter than the first time. Then he raised his head and said: Sami' Allahu liman hamidah. (Allah hears those who praise Him). Then he recited for a long time that was shorter than the first recitation in the second standing. Then he said the takbir and bowed for a long time that was shorter than the first time. Then he raised his head and said: Sami Allahu liman hamidah (Allah hears those who praise Him). Then he said the takbir and prostrated for a long time that was shorter than the first time. Then he recited the tashahhud, then he said the taslim. Then he stood before them and praised and glorified Allah, then he said: 'The sun and the moon do not become eclipsed for the death or birth of anyone, but they are two of the signs of Allah (SWT). Whichever of them becomes eclipsed, turn to Allah (SWT), the Mighty and Sublime, and pray.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38429",
        "20733",
        "20400",
        "11013",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    }
  ],
  "total_hadiths": 5,
  "grade_display": {
    "en": "Successor (Taba' Tabi') [8th Generation]",
    "ar": "تابع التابعين [الجيل الثامن]",
    "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
  }
}