{
  "id": "20404",
  "name": "Aadm bin Abi Iyas آدم بن أبي إياس",
  "full_name": "Aadm bin Abi Iyas آدم بن أبي إياس",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "132",
      "date_gregorian": "NA",
      "date_display": [
        "132 AH"
      ],
      "place": "Kuurasan"
    },
    "death": {
      "date_hijri": "221",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "'Asqalan",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Khurasan",
      "'Asqalan",
      "Merv",
      "Baghdad",
      "Syria",
      "Hijaz"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  خد  ت  س  ق  -  ثقة ]"
    ],
    "tags": [
      "'Asqalani",
      "Khurasani"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20240",
      "name": "Shayban bin 'Abdur Rahman شيبان بن عبد الرحمن النحوي أبو معاوية",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20021",
      "name": "Hammad bin Salama حماد بن سلمة",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20363",
      "name": "Wrqa'a bin 'Umar ورقاء بن عمر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30025",
      "name": "'Abdullah bin 'Abdur Rahman al-Daarimi عبد الله بن عبد الرحمن الدارمي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38375",
      "name": "'Ubaid bin Aadm bin Aby عبيد بن آدم بن أبي إياس العسقلاني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38473",
      "name": "Abu Hatim al-Razi أبو حاتم الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "37518",
      "name": "'Abdur Rahman bin 'Amr عبد الرحمن بن عمرو",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "37544",
      "name": "Yazid bin Muhammad يزيد بن محمد بن عبد الصمد",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "10",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا آدم بن أبي إياس، قال حدثنا شعبة، عن عبد الله بن أبي السفر، وإسماعيل، عن الشعبي، عن عبد الله بن عمرو  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ المسلم من سلم المسلمون من لسانه ويده، والمهاجر من هجر ما نهى الله عنه ‏\"‏‏.‏ قال أبو عبد الله وقال أبو معاوية حدثنا داود عن عامر قال سمعت عبد الله عن النبي صلى الله عليه وسلم‏.‏ وقال عبد الأعلى عن داود عن عامر عن عبد الله عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": "      Narrated 'Abdullah bin 'Amr:                          The Prophet said, \"A Muslim is the one who avoids harming Muslims with     his tongue and hands. And a Muhajir (emigrant) is the one who gives up     (abandons) all what Allah has forbidden.\"",
      "chain": [
        "20404",
        "20020",
        "11636",
        "20208",
        "11052",
        "29"
      ]
    },
    {
      "hadith_no": "101",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، قال حدثني ابن الأصبهاني، قال سمعت أبا صالح، ذكوان يحدث عن أبي سعيد الخدري،‏.‏ قالت النساء للنبي صلى الله عليه وسلم غلبنا عليك الرجال، فاجعل لنا يوما من نفسك‏.‏ فوعدهن يوما لقيهن فيه، فوعظهن وأمرهن، فكان فيما قال لهن ‏\"‏ ما منكن امرأة تقدم ثلاثة من ولدها إلا كان لها حجابا من النار ‏\"‏‏.‏ فقالت امرأة واثنين فقال ‏\"‏ واثنين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     Some women requested the Prophet to fix a day for them as the men were taking all his time. On that he promised them one day for religious lessons and commandments. Once during such a lesson the Prophet said, \"A woman whose three children die will be shielded by them from the Hell fire.\" On that a woman asked, \"If only two die?\" He replied, \"Even two (will shield her from the Hell-fire).",
      "chain": [
        "20404",
        "20020",
        "11364",
        "11161"
      ]
    },
    {
      "hadith_no": "117",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، قال حدثنا الحكم، قال سمعت سعيد بن جبير، عن ابن عباس، قال بت في بيت خالتي ميمونة بنت الحارث زوج النبي صلى الله عليه وسلم وكان النبي صلى الله عليه وسلم عندها في ليلتها، فصلى النبي صلى الله عليه وسلم العشاء، ثم جاء إلى منزله، فصلى أربع ركعات، ثم نام، ثم قام، ثم قال ‏\"‏ نام الغليم ‏\"‏‏.‏ أو كلمة تشبهها، ثم قام فقمت عن يساره، فجعلني عن يمينه، فصلى خمس ركعات ثم صلى ركعتين، ثم نام حتى سمعت غطيطه  أو خطيطه  ثم خرج إلى الصلاة‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     I stayed overnight in the house of my aunt Maimuna bint Al-Harith (the wife of the Prophet ) while the Prophet was there with her during her night turn. The Prophet offered the `Isha' prayer (in the mosque), returned home and after having prayed four rak`at, he slept. Later on he got up at night and then asked whether the boy (or he used a similar word) had slept? Then he got up for the prayer and I stood up by his left side but he made me stand to his right and offered five rak`at followed by two more rak`at. Then he slept and I heard him snoring and then (after a while) he left for the (Fajr) prayer.",
      "chain": [
        "20404",
        "20020",
        "11069",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "134",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا آدم، قال حدثنا ابن أبي ذئب، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم‏.‏ وعن الزهري، عن سالم، عن ابن عمر، عن النبي صلى الله عليه وسلم أن رجلا سأله ما يلبس المحرم فقال ‏\"‏ لا يلبس القميص ولا العمامة ولا السراويل ولا البرنس ولا ثوبا مسه الورس أو الزعفران، فإن لم يجد النعلين فليلبس الخفين وليقطعهما حتى يكونا تحت الكعبين ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     A man asked the Prophet : \"What (kinds of clothes) should a Muhrim (a Muslim intending to perform `Umra or Hajj) wear? He replied, \"He should not wear a shirt, a turban, trousers, a head cloak or garment scented with saffron or Wars (kinds of perfumes). And if he has no slippers, then he can use Khuffs (socks made from thick fabric or leather) but the socks should be cut short so as to make the ankles bare.\" (See Hadith No. 615, Vol. 2).",
      "chain": [
        "20404",
        "20177",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "142",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، عن عبد العزيز بن صهيب، قال سمعت أنسا، يقول كان النبي صلى الله عليه وسلم إذا دخل الخلاء قال ‏\"‏ اللهم إني أعوذ بك من الخبث والخبائث ‏\"‏‏.‏ تابعه ابن عرعرة عن شعبة‏.‏ وقال غندر عن شعبة إذا أتى الخلاء‏.‏ وقال موسى عن حماد إذا دخل‏.‏ وقال سعيد بن زيد حدثنا عبد العزيز إذا أراد أن يدخل‏.‏",
      "text_en": " Narrated Anas:                     Whenever the Prophet went to answer the call of nature, he used to say, \"Allah-umma inni a`udhu bika minal khubuthi wal khaba'ith i.e. O Allah, I seek Refuge with You from all offensive and wicked things (evil deeds and evil spirits).",
      "chain": [
        "20404",
        "20020",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "144",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا آدم، قال حدثنا ابن أبي ذئب، قال حدثنا الزهري، عن عطاء بن يزيد الليثي، عن أبي أيوب الأنصاري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أتى أحدكم الغائط فلا يستقبل القبلة ولا يولها ظهره، شرقوا أو غربوا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Aiyub Al-Ansari:                     Allah's Apostle said, \"If anyone of you goes to an open space for answering the call of nature he should neither face nor turn his back towards the Qibla; he should either face the east or the west.\"",
      "chain": [
        "20404",
        "20177",
        "11013",
        "11206",
        "33"
      ]
    },
    {
      "hadith_no": "165",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا آدم بن أبي إياس، قال حدثنا شعبة، قال حدثنا محمد بن زياد، قال سمعت أبا هريرة  وكان يمر بنا والناس يتوضئون من المطهرة  قال أسبغوا الوضوء فإن أبا القاسم صلى الله عليه وسلم قال ‏\"‏ ويل للأعقاب من النار ‏\"‏‏.‏",
      "text_en": " Narrated Muhammad Ibn Ziyad:                     I heard Abu Huraira saying as he passed by us while the people were performing ablution from a utensil containing water, \"Perform ablution perfectly and thoroughly for Abul-Qasim (the Prophet) said, 'Save your heels from the Hell-fire.' \"",
      "chain": [
        "20404",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "176",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا آدم بن أبي إياس، قال حدثنا ابن أبي ذئب، عن سعيد المقبري، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ لا يزال العبد في صلاة ما كان في المسجد ينتظر الصلاة، ما لم يحدث ‏\"‏‏.‏ فقال رجل أعجمي ما الحدث يا أبا هريرة قال الصوت‏.‏ يعني الضرطة‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"A person is considered in prayer as long as he is waiting for the prayer in the mosque as long as he does not do Hadath.\" A non-Arab man asked, \"O Abu Huraira! What is Hadath?\" I replied, \"It is the passing of wind (from the anus) (that is one of the types of Hadath).",
      "chain": [
        "20404",
        "20177",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "187",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، قال حدثنا الحكم، قال سمعت أبا جحيفة، يقول خرج علينا رسول الله صلى الله عليه وسلم بالهاجرة، فأتي بوضوء فتوضأ، فجعل الناس يأخذون من فضل وضوئه فيتمسحون به، فصلى النبي صلى الله عليه وسلم الظهر ركعتين والعصر ركعتين، وبين يديه عنزة‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     Allah's Apostle came to us at noon and water for ablution was brought to him. After he had performed ablution, the remaining water was taken by the people and they started smearing their bodies with it (as a blessed thing). The Prophet offered two rak`at of the Zuhr prayer and then two rak`at of the `Asr prayer while a short spear (or stick) was there (as a Sutra) in front of him.",
      "chain": [
        "20404",
        "20020",
        "11069",
        "4047"
      ]
    },
    {
      "hadith_no": "224",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، عن الأعمش، عن أبي وائل، عن حذيفة، قال أتى النبي صلى الله عليه وسلم سباطة قوم فبال قائما، ثم دعا بماء، فجئته بماء فتوضأ‏.‏",
      "text_en": " Narrated Hudhaifa:                     Once the Prophet went to the dumps of some people and passed urine while standing. He then asked for water and so I brought it to him and he performed ablution.",
      "chain": [
        "20404",
        "20020",
        "11060",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "234",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، قال أخبرنا أبو التياح، يزيد بن حميد عن أنس، قال كان النبي صلى الله عليه وسلم يصلي قبل أن يبنى المسجد في مرابض الغنم‏.‏",
      "text_en": " Narrated Anas:                     Prior to the construction of the mosque, the Prophet offered the prayers at sheep-folds.",
      "chain": [
        "20404",
        "20020",
        "11317",
        "19"
      ]
    },
    {
      "hadith_no": "250",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا آدم بن أبي إياس، قال حدثنا ابن أبي ذئب، عن الزهري، عن عروة، عن عائشة، قالت كنت أغتسل أنا والنبي، صلى الله عليه وسلم من إناء واحد من قدح يقال له الفرق‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet and I used to take a bath from a single pot called 'Faraq'.",
      "chain": [
        "20404",
        "20177",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "271",
      "source": " Sahih Bukhari ",
      "chapter": "Bathing (Ghusl) - كتاب الغسل",
      "chapter_no": "5",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، قال حدثنا الحكم، عن إبراهيم، عن الأسود، عن عائشة، قالت كأني أنظر إلى وبيص الطيب في مفرق النبي صلى الله عليه وسلم وهو محرم‏.‏",
      "text_en": " Narrated `Aisha:                     It is as if I am just looking at the glitter of scent in the parting of the Prophet's head hair while he was a Muhrim.",
      "chain": [
        "20404",
        "20020",
        "11069",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "hadith_no": "338",
      "source": " Sahih Bukhari ",
      "chapter": "Rubbing hands and feet with dust (Tayammum) - كتاب التيمم",
      "chapter_no": "7",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، حدثنا الحكم، عن ذر، عن سعيد بن عبد الرحمن بن أبزى، عن أبيه، قال جاء رجل إلى عمر بن الخطاب فقال إني أجنبت فلم أصب الماء‏.‏ فقال عمار بن ياسر لعمر بن الخطاب أما تذكر أنا كنا في سفر أنا وأنت فأما أنت فلم تصل، وأما أنا فتمعكت فصليت، فذكرت للنبي صلى الله عليه وسلم فقال النبي صلى الله عليه وسلم ‏\"‏ إنما كان يكفيك هكذا ‏\"‏‏.‏ فضرب النبي صلى الله عليه وسلم بكفيه الأرض، ونفخ فيهما ثم مسح بهما وجهه وكفيه‏.‏",
      "text_en": " Narrated `Abdur Rahman bin Abza [??]:                     A man came to `Umar bin Al-Khattab and said, \"I became Junub but no water was available.\" `Ammar bin Yasir said to `Umar, \"Do you remember that you and I (became Junub while both of us) were together on a journey and you didn't pray but I rolled myself on the ground and prayed? I informed the Prophet about it and he said, 'It would have been sufficient for you to do like this.' The Prophet then stroked lightly the earth with his hands and then blew off the dust and passed his hands over his face and hands.\"",
      "chain": [
        "20404",
        "20020",
        "11069",
        "11423",
        "11346",
        "4046"
      ]
    },
    {
      "hadith_no": "386",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا آدم بن أبي إياس، قال حدثنا شعبة، قال أخبرنا أبو مسلمة، سعيد بن يزيد الأزدي قال سألت أنس بن مالك أكان النبي صلى الله عليه وسلم يصلي في نعليه قال نعم‏.‏",
      "text_en": " Narrated Abu Maslama:                     Sa`id bin Yazid Al-Azdi: I asked Anas bin Malik whether the Prophet had ever, prayed with his shoes on. He replied \"Yes.\"",
      "chain": [
        "20404",
        "20020",
        "11288"
      ]
    },
    {
      "hadith_no": "387",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، عن الأعمش، قال سمعت إبراهيم، يحدث عن همام بن الحارث، قال رأيت جرير بن عبد الله بال ثم توضأ، ومسح على خفيه، ثم قام فصلى، فسئل فقال رأيت النبي صلى الله عليه وسلم صنع مثل هذا‏.‏ قال إبراهيم فكان يعجبهم، لأن جريرا كان من آخر من أسلم‏.‏",
      "text_en": " Narrated Ibrahim:                     Hammam bin Al-Harith said, \"I saw Jarir bin `Abdullah urinating. Then he performed ablution and passed his (wet) hands over his Khuffs (socks made from thick fabric or leather), stood up and prayed. He was asked about it. He replied that he had seen the Prophet doing the same.\" They approved of this narration as Jarir was one of those who embraced Islam very late.",
      "chain": [
        "20404",
        "20020",
        "11060",
        "11051",
        "11400"
      ]
    },
    {
      "hadith_no": "413",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، قال حدثنا قتادة، قال سمعت أنس بن مالك، قال قال النبي صلى الله عليه وسلم ‏\"‏ إن المؤمن إذا كان في الصلاة فإنما يناجي ربه، فلا يبزقن بين يديه ولا عن يمينه، ولكن عن يساره أو تحت قدمه ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"A faithful believer while in prayer is speaking in private to his Lord, so he should neither spit in front of him nor to his right side but he could spit either on his left or under his foot.\"",
      "chain": [
        "20404",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "415",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، قال حدثنا قتادة، قال سمعت أنس بن مالك، قال قال النبي صلى الله عليه وسلم ‏\"‏ البزاق في المسجد خطيئة، وكفارتها دفنها ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet said, \"Spitting in the mosque is a sin and its expiation is to bury it.\"",
      "chain": [
        "20404",
        "20020",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "499",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، قال حدثنا عون بن أبي جحيفة، قال سمعت أبي قال، خرج علينا رسول الله صلى الله عليه وسلم بالهاجرة، فأتي بوضوء فتوضأ فصلى بنا الظهر والعصر وبين يديه عنزة، والمرأة والحمار يمرون من ورائها‏.‏",
      "text_en": " Narrated `Aun bin Abi Juhaifa:                     that he had heard his father saying, \"Allah's Apostle came to us at midday and water was brought for his ablution. He performed ablution and led us in Zuhr and `Asr prayers with a short stpear (or stick) planted in front of him (as a Sutra), while women and donkeys were passing beyond it.\"",
      "chain": [
        "20404",
        "20020",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "539",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا آدم بن أبي إياس، قال حدثنا شعبة، قال حدثنا مهاجر أبو الحسن، مولى لبني تيم الله قال سمعت زيد بن وهب، عن أبي ذر الغفاري، قال كنا مع النبي صلى الله عليه وسلم في سفر، فأراد المؤذن أن يؤذن للظهر فقال النبي صلى الله عليه وسلم ‏\"‏ أبرد ‏\"‏‏.‏ ثم أراد أن يؤذن فقال له ‏\"‏ أبرد ‏\"‏‏.‏ حتى رأينا فىء التلول، فقال النبي صلى الله عليه وسلم ‏\"‏ إن شدة الحر من فيح جهنم، فإذا اشتد الحر فأبردوا بالصلاة ‏\"‏‏.‏ وقال ابن عباس تتفيأ تتميل‏.‏",
      "text_en": " Narrated Abu Dhar Al-Ghifar:                     We were with the Prophet on a journey and the Mu'adh-dhin (call maker for the prayer) wanted to pronounce the Adhan (call) for the Zuhr prayer. The Prophet said, 'Let it become cooler.\" He again (after a while) wanted to pronounce the Adhan but the Prophet said to him, \"Let it become cooler till we see the shadows of hillocks.\" The Prophet added, \"The severity of heat is from the raging of the Hell-fire, and in very hot weather pray (Zuhr) when it becomes cooler.\"",
      "chain": [
        "20404",
        "20020",
        "11657",
        "11341",
        "23"
      ]
    },
    {
      "hadith_no": "562",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، قال حدثنا عمرو بن دينار، قال سمعت جابر بن زيد، عن ابن عباس، قال صلى النبي صلى الله عليه وسلم سبعا جميعا وثمانيا جميعا‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet prayed seven rak`at together and eight rak`at together.",
      "chain": [
        "20404",
        "20020",
        "11081",
        "11271",
        "17"
      ]
    },
    {
      "hadith_no": "636",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا آدم، قال حدثنا ابن أبي ذئب، قال حدثنا الزهري، عن سعيد بن المسيب، عن أبي هريرة، عن النبي صلى الله عليه وسلم‏.‏ وعن الزهري، عن أبي سلمة، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا سمعتم الإقامة فامشوا إلى الصلاة، وعليكم بالسكينة والوقار ولا تسرعوا، فما أدركتم فصلوا وما فاتكم فأتموا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"When you hear the Iqama, proceed to offer the prayer with calmness and solemnity and do not make haste. And pray whatever you are able to pray and complete whatever you have missed.",
      "chain": [
        "20404",
        "20177",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "670",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، قال حدثنا أنس بن سيرين، قال سمعت أنسا، يقول قال رجل من الأنصار إني لا أستطيع الصلاة معك‏.‏ وكان رجلا ضخما، فصنع للنبي صلى الله عليه وسلم طعاما فدعاه إلى منزله، فبسط له حصيرا ونضح طرف الحصير، صلى عليه ركعتين‏.‏ فقال رجل من آل الجارود لأنس أكان النبي صلى الله عليه وسلم يصلي الضحى قال ما رأيته صلاها إلا يومئذ‏.‏",
      "text_en": " Narrated Anas bin Seereen:                     I heard Anas saying, \"A man from Ansar said to the Prophet, 'I cannot pray with you (in congregation).' He was a very fat man and he prepared a meal for the Prophet and invited him to his house. He spread out a mat for the Prophet, and washed one of its sides with water, and the Prophet prayed two rak`at on it.\" A man from the family of Al-Jaruid [??] asked, \"Did the Prophet used to pray the Duha (forenoon) prayer?\" Anas said, \"I did not see him praying the Duha prayer except on that day.\"",
      "chain": [
        "20404",
        "20020",
        "11038",
        "19"
      ]
    },
    {
      "hadith_no": "676",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، قال حدثنا الحكم، عن إبراهيم، عن الأسود، قال سألت عائشة ما كان النبي صلى الله عليه وسلم يصنع في بيته قالت كان يكون في مهنة أهله  تعني خدمة أهله  فإذا حضرت الصلاة خرج إلى الصلاة‏.‏",
      "text_en": " Narrated Al-Aswad:                     That he asked `Aisha \"What did the Prophet use to do in his house?\" She replied, \"He used to keep himself busy serving his family and when it was the time for prayer he would go for it.\"",
      "chain": [
        "20404",
        "20020",
        "11069",
        "11051",
        "11054"
      ]
    },
    {
      "hadith_no": "705",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا آدم بن أبي إياس، قال حدثنا شعبة، قال حدثنا محارب بن دثار، قال سمعت جابر بن عبد الله الأنصاري، قال أقبل رجل بناضحين وقد جنح الليل، فوافق معاذا يصلي، فترك ناضحه وأقبل إلى معاذ، فقرأ بسورة البقرة أو النساء، فانطلق الرجل، وبلغه أن معاذا نال منه، فأتى النبي صلى الله عليه وسلم فشكا إليه معاذا، فقال النبي صلى الله عليه وسلم ‏\"‏ يا معاذ أفتان أنت  أو فاتن ثلاث مرار  فلولا صليت بسبح اسم ربك، والشمس وضحاها، والليل إذا يغشى، فإنه يصلي وراءك الكبير والضعيف وذو الحاجة ‏\"‏‏.‏ أحسب هذا في الحديث‏.‏ قال أبو عبد الله وتابعه سعيد بن مسروق ومسعر والشيباني‏.‏ قال عمرو وعبيد الله بن مقسم وأبو الزبير عن جابر قرأ معاذ في العشاء بالبقرة‏.‏ وتابعه الأعمش عن محارب‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah Al-Ansari:                     Once a man was driving two Nadihas (camels used for agricultural purposes) and night had fallen. He found Mu`adh praying so he made his camel kneel and joined Mu`adh in the prayer. The latter recited Surat 'Al-Baqara\" or Surat \"An-Nisa\", (so) the man left the prayer and went away. When he came to know that Mu`adh had criticized him, he went to the Prophet, and complained against Mu`adh. The Prophet said thrice, \"O Mu`adh ! Are you putting the people to trial?\" It would have been better if you had recited \"Sabbih Isma Rabbika-l-A`la (87)\", Wash-shamsi wa duhaha (91)\", or \"Wal-laili idha yaghsha (92)\", for the old, the weak and the needy pray behind you.\" Jabir said that Mu`adh recited Sura Al-Baqara in the `Isha' prayer.",
      "chain": [
        "20404",
        "20020",
        "11389",
        "34"
      ]
    },
    {
      "hadith_no": "771",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، قال حدثنا سيار بن سلامة، قال دخلت أنا وأبي، على أبي برزة الأسلمي فسألناه عن وقت الصلوات، فقال كان النبي صلى الله عليه وسلم يصلي الظهر حين تزول الشمس، والعصر ويرجع الرجل إلى أقصى المدينة والشمس حية، ونسيت ما قال في المغرب، ولا يبالي بتأخير العشاء إلى ثلث الليل ولا يحب النوم قبلها، ولا الحديث بعدها، ويصلي الصبح فينصرف الرجل فيعرف جليسه، وكان يقرأ في الركعتين أو إحداهما ما بين الستين إلى المائة‏.‏",
      "text_en": " Narrated Saiyar bin Salama:                     My father and I went to Abu Barza-al-Aslami to ask him about the stated times for the prayers. He replied, \"The Prophet used to offer the Zuhr prayer when the sun just declined from its highest position at noon; the `Asr at a time when if a man went to the farthest place in Medina (after praying) he would find the sun still hot (bright). (The sub narrator said: I have forgotten what Abu Barza said about the Maghrib prayer). The Prophet never found any harm in delaying the `Isha' prayer to the first third of the night and he never liked to sleep before it and to talk after it. He used to offer the morning prayer at a time when after finishing it one could recognize the person sitting beside him and used to recite between 60 to 100 verses in one or both the rak`at.\"",
      "chain": [
        "20404",
        "20020",
        "11290"
      ]
    },
    {
      "hadith_no": "775",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، عن عمرو بن مرة، قال سمعت أبا وائل، قال جاء رجل إلى ابن مسعود فقال قرأت المفصل الليلة في ركعة‏.‏ فقال هذا كهذ الشعر لقد عرفت النظائر التي كان النبي صلى الله عليه وسلم يقرن بينهن فذكر عشرين سورة من المفصل سورتين في كل ركعة‏.‏",
      "text_en": " Narrated Abu Wa'il:                     A man came to Ibn Mas`ud and said, \"I recited the Mufassal (Suras) at night in one rak`a.\" Ibn Mas`ud said, \"This recitation is (too quick) like the recitation of poetry. I know the identical Suras which the Prophet used to recite in pairs.\" Ibn Mas`ud then mentioned 20 Mufassal Suras including two Suras from the family of (i.e. those verses which begin with) Ha, Meem [??] (which the Prophet used to recite) in each rak`a.",
      "chain": [
        "20404",
        "20020",
        "11381",
        "11353"
      ]
    },
    {
      "hadith_no": "795",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا آدم، قال حدثنا ابن أبي ذئب، عن سعيد المقبري، عن أبي هريرة، قال كان النبي صلى الله عليه وسلم إذا قال ‏\"‏ سمع الله لمن حمده ‏\"‏‏.‏ قال ‏\"‏ اللهم ربنا ولك الحمد ‏\"‏‏.‏ وكان النبي صلى الله عليه وسلم إذا ركع وإذا رفع رأسه يكبر، وإذا قام من السجدتين قال ‏\"‏ الله أكبر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     When the Prophet said, \"Sami`a l-lahu liman hamidah,\" (Allah heard those who sent praises to Him), he would say, \"Rabbana wa laka l-hamd.\" On bowing and raising his head from it the Prophet used to say Takbir. He also used to say Takbir on rising after the two prostrations. (See Hadith No. 656).",
      "chain": [
        "20404",
        "20177",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "811",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا آدم، حدثنا إسرائيل، عن أبي إسحاق، عن عبد الله بن يزيد الخطمي، حدثنا البراء بن عازب  وهو غير كذوب  قال كنا نصلي خلف النبي صلى الله عليه وسلم فإذا قال سمع الله لمن حمده‏.‏ لم يحن أحد منا ظهره حتى يضع النبي صلى الله عليه وسلم جبهته على الأرض‏.‏",
      "text_en": " Narrated Al-Bara' bin `Azib:                     (He was not a liar) We used to pray behind the Prophet and when he said, \"Sami`a l-lahu liman hamidah\", none of us would bend his back (to go for prostration) till the Prophet had placed his, forehead on the ground.",
      "chain": [
        "20404",
        "20311",
        "11049",
        "1945",
        "400"
      ]
    },
    {
      "hadith_no": "848",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "وقال لنا آدم حدثنا شعبة، عن أيوب، عن نافع، قال كان ابن عمر يصلي في مكانه الذي صلى فيه الفريضة‏.‏ وفعله القاسم‏.‏ ويذكر عن أبي هريرة رفعه لا يتطوع الإمام في مكانه‏.‏ ولم يصح‏.‏",
      "text_en": " Narrated Nafi:                      Ibn Umar used to offer prayers (Nawafil) at the place where he had offered the compulsory prayer. Al-Qasim (bin Muhammad bin Abi Bakr) did the same. The narration coming from Abu Hurairah (from the Prophet ()) forbidding the Imam from offering prayers (optional prayer) at the same place where he was offered the compulsory prayer is incorrect.",
      "chain": [
        "20404",
        "20020",
        "11015",
        "11014"
      ]
    },
    {
      "hadith_no": "883",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا آدم، قال حدثنا ابن أبي ذئب، عن سعيد المقبري، قال أخبرني أبي، عن ابن وديعة، عن سلمان الفارسي، قال قال النبي صلى الله عليه وسلم ‏\"‏ لا يغتسل رجل يوم الجمعة، ويتطهر ما استطاع من طهر، ويدهن من دهنه، أو يمس من طيب بيته ثم يخرج، فلا يفرق بين اثنين، ثم يصلي ما كتب له، ثم ينصت إذا تكلم الإمام، إلا غفر له ما بينه وبين الجمعة الأخرى ‏\"‏‏.‏",
      "text_en": " Narrated Salman-Al-Farsi:                     The Prophet (p.b.u.h) said, \"Whoever takes a bath on Friday, purifies himself as much as he can, then uses his (hair) oil or perfumes himself with the scent of his house, then proceeds (for the Jumua prayer) and does not separate two persons sitting together (in the mosque), then prays as much as (Allah has) written for him and then remains silent while the Imam is delivering the Khutba, his sins in-between the present and the last Friday would be forgiven.\"",
      "chain": [
        "20404",
        "20177",
        "11168",
        "11212",
        "14"
      ]
    },
    {
      "hadith_no": "908",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا آدم، قال حدثنا ابن أبي ذئب، قال الزهري عن سعيد، وأبي، سلمة عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم‏.‏ وحدثنا أبو اليمان، قال أخبرنا شعيب، عن الزهري، قال أخبرني أبو سلمة بن عبد الرحمن، أن أبا هريرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إذا أقيمت الصلاة فلا تأتوها تسعون، وأتوها تمشون عليكم السكينة، فما أدركتم فصلوا، وما فاتكم فأتموا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     heard Allah's Apostles (p.b.u.h) saying, \"If the prayer is started do not run for it but just walk for it calmly and pray whatever you get, and complete whatever is missed. \"",
      "chain": [
        "20404",
        "20177",
        "11013",
        "11168",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "912",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا آدم، قال حدثنا ابن أبي ذئب، عن الزهري، عن السائب بن يزيد، قال كان النداء يوم الجمعة أوله إذا جلس الإمام على المنبر على عهد النبي صلى الله عليه وسلم وأبي بكر وعمر  رضى الله عنهما  فلما كان عثمان  رضى الله عنه  وكثر الناس زاد النداء الثالث على الزوراء‏.‏",
      "text_en": " Narrated As-Saib bin Yazid:                     In the lifetime of the Prophet, Abu Bakr and `Umar, the Adhan for the Jumua prayer used to be pronounced when the Imam sat on the pulpit. But during the Caliphate of `Uthman when the Muslims increased in number, a third Adhan at Az-Zaura' was added. Abu `Abdullah said, \"Az-Zaura' is a place in the market of Medina.\"",
      "chain": [
        "20404",
        "20177",
        "11013",
        "3048"
      ]
    },
    {
      "hadith_no": "919",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا آدم، قال حدثنا ابن أبي ذئب، عن الزهري، عن سالم، عن أبيه، قال سمعت النبي صلى الله عليه وسلم يخطب على المنبر فقال ‏\"‏ من جاء إلى الجمعة فليغتسل ‏\"‏‏.‏",
      "text_en": " Narrated Salim:                     My father said , \"I heard the Prophet delivering the Khutba on the pulpit and he said, 'Whoever comes for the Jumua prayer should take a bath (before coming).' \"",
      "chain": [
        "20404",
        "20177",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "929",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا آدم، قال حدثنا ابن أبي ذئب، عن الزهري، عن أبي عبد الله الأغر، عن أبي هريرة، قال قال النبي صلى الله عليه وسلم ‏\"‏ إذا كان يوم الجمعة، وقفت الملائكة على باب المسجد يكتبون الأول فالأول، ومثل المهجر كمثل الذي يهدي بدنة، ثم كالذي يهدي بقرة، ثم كبشا، ثم دجاجة، ثم بيضة، فإذا خرج الإمام طووا صحفهم، ويستمعون الذكر ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"When it is a Friday, the angels stand at the gate of the mosque and keep on writing the names of the persons coming to the mosque in succession according to their arrivals. The example of the one who enters the mosque in the earliest hour is that of one offering a camel (in sacrifice). The one coming next is like one offering a cow and then a ram and then a chicken and then an egg respectively. When the Imam comes out (for Jumua prayer) they (i.e. angels) fold their papers and listen to the Khutba.\"",
      "chain": [
        "20404",
        "20177",
        "11013",
        "11171",
        "13"
      ]
    },
    {
      "hadith_no": "965",
      "source": " Sahih Bukhari ",
      "chapter": "The Two Festivals (Eids) - كتاب العيدين",
      "chapter_no": "13",
      "text_ar": "حدثنا آدم، قال حدثنا شعبة، قال حدثنا زبيد، قال سمعت الشعبي، عن البراء بن عازب، قال قال النبي صلى الله عليه وسلم ‏\"‏ إن أول ما نبدأ في يومنا هذا أن نصلي، ثم نرجع فننحر، فمن فعل ذلك فقد أصاب سنتنا، ومن نحر قبل الصلاة فإنما هو لحم قدمه لأهله، ليس من النسك في شىء ‏\"‏‏.‏ فقال رجل من الأنصار يقال له أبو بردة بن نيار يا رسول الله، ذبحت وعندي جذعة خير من مسنة‏.‏ فقال ‏\"‏ اجعله مكانه، ولن توفي أو تجزي عن أحد بعدك ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara' bin `Azib:                     The Prophet (p.b.u.h) said, \"The first thing that we should do on this day of ours is to pray and then return to slaughter the sacrifice. So anyone who does so, he acted according to our Sunna (tradition), and whoever slaughtered the sacrifice before the prayer, it was just meat which he presented to his family and would not be considered as Nusuk.\" A person from the Ansar named Abu Burda bin Niyyar said, \"O Allah's Apostle! I slaughtered the Nusuk (before the prayer) but I have a young shegoat which is better than an older sheep.\" The Prophet I said, \"Sacrifice it in lieu of the first, but it will be not sufficient (as a sacrifice) for anybody else after you.\"",
      "chain": [
        "20404",
        "20020",
        "11335",
        "11052",
        "400"
      ]
    },
    {
      "hadith_no": "1025",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "حدثنا آدم، قال حدثنا ابن أبي ذئب، عن الزهري، عن عباد بن تميم، عن عمه، قال رأيت النبي صلى الله عليه وسلم يوم خرج يستسقي قال فحول إلى الناس ظهره، واستقبل القبلة يدعو، ثم حول رداءه، ثم صلى لنا ركعتين جهر فيهما بالقراءة‏.‏",
      "text_en": " Narrated `Abbas bin Tamim from his uncle:                     \"I saw the Prophet on the day when he went out to offer the Istisqa' prayer. He turned his back towards the people and faced the Qibla and asked Allah for rain. Then he turned his cloak inside out and led us in a two rak`at prayer and recited the Qur'an aloud in them.\"",
      "chain": [
        "20404",
        "20177",
        "11013",
        "639"
      ]
    },
    {
      "hadith_no": "1073",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا آدم بن أبي إياس، قال حدثنا ابن أبي ذئب، قال حدثنا يزيد بن عبد الله بن قسيط، عن عطاء بن يسار، عن زيد بن ثابت، قال قرأت على النبي صلى الله عليه وسلم ‏{‏والنجم‏}‏ فلم يسجد فيها‏.‏",
      "text_en": " Narrated Zaid bin Thabit:                     I recited An-Najm before the Prophet, yet he did not perform a prostration.",
      "chain": [
        "20404",
        "20177",
        "11236",
        "11020",
        "49"
      ]
    },
    {
      "hadith_no": "1088",
      "source": " Sahih Bukhari ",
      "chapter": "Shortening the Prayers (At-Taqseer) - كتاب التقصير",
      "chapter_no": "18",
      "text_ar": "حدثنا آدم، قال حدثنا ابن أبي ذئب، قال حدثنا سعيد المقبري، عن أبيه، عن أبي هريرة  رضى الله عنهما  قال قال النبي صلى الله عليه وسلم ‏\"‏ لا يحل لامرأة تؤمن بالله واليوم الآخر أن تسافر مسيرة يوم وليلة ليس معها حرمة ‏\"‏‏.‏ تابعه يحيى بن أبي كثير وسهيل ومالك عن المقبري عن أبي هريرة  رضى الله عنه‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet (p.b.u.h) said, \"It is not permissible for a woman who believes in Allah and the Last Day to travel for one day and night except with a Mahram.\"",
      "chain": [
        "20404",
        "20177",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "1170",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا آدم، قال أخبرنا شعبة، أخبرنا عمرو بن دينار، قال سمعت جابر بن عبد الله  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم وهو يخطب ‏\"‏ إذا جاء أحدكم والإمام يخطب  أو قد خرج  فليصل ركعتين ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     While delivering a sermon, Allah's Apostle said, \"If anyone of you comes while the Imam is delivering the sermon or has come out for it, he should offer a two rak`at prayer.\"",
      "chain": [
        "20404",
        "20020",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "1176",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا عمرو بن مرة، قال سمعت عبد الرحمن بن أبي ليلى، يقول ما حدثنا أحد، أنه رأى النبي صلى الله عليه وسلم يصلي الضحى غير أم هانئ فإنها قالت إن النبي صلى الله عليه وسلم دخل بيتها يوم فتح مكة فاغتسل وصلى ثماني ركعات فلم أر صلاة قط أخف منها، غير أنه يتم الركوع والسجود‏.‏",
      "text_en": " Narrated `Abdur Rahman bin Abi Laila:                     Only Um Hani narrated to me that she had seen the Prophet offering the Duha prayer. She said, \"On the day of the conquest of Mecca, the Prophet entered my house, took a bath and offered eight rak`at (of Duha prayers. I had never seen the Prophet offering such a light prayer but he performed bowing and prostrations perfectly .",
      "chain": [
        "20404",
        "20020",
        "11381",
        "11196"
      ]
    },
    {
      "hadith_no": "1177",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا آدم، قال حدثنا ابن أبي ذئب، عن الزهري، عن عروة، عن عائشة  رضى الله عنها  قالت ما رأيت رسول الله صلى الله عليه وسلم سبح سبحة الضحى، وإني لأسبحها‏.‏",
      "text_en": " Narrated `Aisha:                     I never saw the Prophet offering the Duha prayer but I always offer it.",
      "chain": [
        "20404",
        "20177",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "1211",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا الأزرق بن قيس، قال كنا بالأهواز نقاتل الحرورية، فبينا أنا على جرف نهر إذا رجل يصلي، وإذا لجام دابته بيده فجعلت الدابة تنازعه، وجعل يتبعها  قال شعبة  هو أبو برزة الأسلمي  فجعل رجل من الخوارج يقول اللهم افعل بهذا الشيخ‏.‏ فلما انصرف الشيخ قال إني سمعت قولكم، وإني غزوت مع رسول الله صلى الله عليه وسلم ست غزوات أو سبع غزوات وثمانيا، وشهدت تيسيره، وإني أن كنت أن أراجع مع دابتي أحب إلى من أن أدعها ترجع إلى مألفها فيشق على‏.‏",
      "text_en": " Narrated Al-Azraq bin Qais:                     We were at Al-Ahwaz fighting the Al-Haruriya (tribe). While I was at the bank of a river a man was praying and the reins of his animal were in his hands and the animal was struggling and he was following the animal. (Shu`ba, a sub-narrator, said that man was Abu Barza Al-Aslami). A man from the Khawarij said, \"O Allah! Be harsh to this sheik.\" And when the sheik (Abu Barza) finished his prayer, he said, \"I heard your remark. No doubt, I participated with Allah's Apostle in six or seven or eight holy battles and saw his leniency, and no doubt, I would rather retain my animal than let it return to its stable, as it would cause me much trouble. \"",
      "chain": [
        "20404",
        "20020",
        "11574"
      ]
    },
    {
      "hadith_no": "1227",
      "source": " Sahih Bukhari ",
      "chapter": "Forgetfulness in Prayer - كتاب السهو",
      "chapter_no": "22",
      "text_ar": "حدثنا آدم، حدثنا شعبة، عن سعد بن إبراهيم، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  قال صلى بنا النبي صلى الله عليه وسلم الظهر أو العصر فسلم، فقال له ذو اليدين الصلاة يا رسول الله أنقصت فقال النبي صلى الله عليه وسلم لأصحابه ‏\"‏ أحق ما يقول ‏\"‏‏.‏ قالوا نعم‏.‏ فصلى ركعتين أخريين ثم سجد سجدتين‏.‏ قال سعد ورأيت عروة بن الزبير صلى من المغرب ركعتين فسلم وتكلم ثم صلى ما بقي وسجد سجدتين وقال هكذا فعل النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet led us in the `Asr or the Zuhr prayer and finished it with Taslim. Dhul-Yadain said to him, \"O Allah's Apostle! Has the prayer been reduced?\" The Prophet asked his companions in the affirmative. So Allah's Apostle I offered two more rak`at and then performed two prostrations (of Sahu). Sa`d said, \"I saw that 'Ursa bin Az-Zubair had offered two rak`at in the Maghrib prayer and finished it with Taslim. He then talked (and when he was informed about it) he completed the rest of his prayer and performed two prostrations, and said, 'The Prophet prayed like this.' \"",
      "chain": [
        "20404",
        "20020",
        "11063",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1252",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا ثابت، عن أنس بن مالك  رضى الله عنه  قال مر النبي صلى الله عليه وسلم بامرأة عند قبر وهي تبكي فقال ‏\"‏ اتقي الله واصبري ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet passed by a woman who was sitting and weeping beside a grave and said to her, \"Fear Allah and be patient.\"",
      "chain": [
        "20404",
        "20020",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "1283",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا ثابت، عن أنس بن مالك  رضى الله عنه  قال مر النبي صلى الله عليه وسلم بامرأة تبكي عند قبر فقال ‏\"‏ اتقي الله واصبري ‏\"‏‏.‏ قالت إليك عني، فإنك لم تصب بمصيبتي، ولم تعرفه‏.‏ فقيل لها إنه النبي صلى الله عليه وسلم‏.‏ فأتت باب النبي صلى الله عليه وسلم فلم تجد عنده بوابين فقالت لم أعرفك‏.‏ فقال ‏\"‏ إنما الصبر عند الصدمة الأولى ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet passed by a woman who was weeping beside a grave. He told her to fear Allah and be patient. She said to him, \"Go away, for you have not been afflicted with a calamity like mine.\" And she did not recognize him. Then she was informed that he was the Prophet . so she went to the house of the Prophet and there she did not find any guard. Then she said to him, \"I did not recognize you.\" He said, \"Verily, the patience is at the first stroke of a calamity.\"",
      "chain": [
        "20404",
        "20020",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "1312",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا عمرو بن مرة، قال سمعت عبد الرحمن بن أبي ليلى، قال كان سهل بن حنيف وقيس بن سعد قاعدين بالقادسية، فمروا عليهما بجنازة فقاما‏.‏ فقيل لهما إنها من أهل الأرض، أى من أهل الذمة فقالا إن النبي صلى الله عليه وسلم مرت به جنازة فقام فقيل له إنها جنازة يهودي‏.‏ فقال ‏\"‏ أليست نفسا ‏\"‏‏.‏   وقال أبو حمزة عن الأعمش، عن عمرو، عن ابن أبي ليلى، قال كنت مع قيس وسهل  رضى الله عنهما  فقالا كنا مع النبي صلى الله عليه وسلم‏.‏ وقال زكرياء عن الشعبي عن ابن أبي ليلى كان أبو مسعود وقيس يقومان للجنازة‏.‏",
      "text_en": " Narrated `Abdur Rahman bin Abi Laila:                     Sahl bin Hunaif and Qais bin Sa`d were sitting in the city of Al-Qadisiya. A funeral procession passed in front of them and they stood up. They were told that funeral procession was of one of the inhabitants of the land i.e. of a non-believer, under the protection of Muslims. They said, \"A funeral procession passed in front of the Prophet and he stood up. When he was told that it was the coffin of a Jew, he said, \"Is it not a living being (soul)?\"",
      "chain": [
        "20404",
        "20020",
        "11381",
        "11196",
        "403"
      ]
    },
    {
      "hadith_no": "1367",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا آدم، حدثنا شعبة، حدثنا عبد العزيز بن صهيب، قال سمعت أنس بن مالك  رضى الله عنه  يقول مروا بجنازة فأثنوا عليها خيرا، فقال النبي صلى الله عليه وسلم ‏\"‏ وجبت ‏\"‏‏.‏ ثم مروا بأخرى فأثنوا عليها شرا فقال ‏\"‏ وجبت ‏\"‏‏.‏ فقال عمر بن الخطاب  رضى الله عنه  ما وجبت قال ‏\"‏ هذا أثنيتم عليه خيرا فوجبت له الجنة، وهذا أثنيتم عليه شرا فوجبت له النار، أنتم شهداء الله في الأرض ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A funeral procession passed and the people praised the deceased. The Prophet said, \"It has been affirmed to him.\" Then another funeral procession passed and the people spoke badly of the deceased. The Prophet said, \"It has been affirmed to him\". `Umar bin Al-Khattab asked (Allah's Apostle (p.b.u.h) ), \"What has been affirmed?\" He replied, \"You praised this, so Paradise has been affirmed to him; and you spoke badly of this, so Hell has been affirmed to him. You people are Allah's witnesses on earth.\"",
      "chain": [
        "20404",
        "20020",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "1385",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا آدم، حدثنا ابن أبي ذئب، عن الزهري، عن أبي سلمة بن عبد الرحمن، عن أبي هريرة  رضى الله عنه  قال قال النبي صلى الله عليه وسلم ‏\"‏ كل مولود يولد على الفطرة، فأبواه يهودانه أو ينصرانه أو يمجسانه، كمثل البهيمة تنتج البهيمة، هل ترى فيها جدعاء ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Every child is born with a true faith of Islam (i.e. to worship none but Allah Alone) and his parents convert him to Judaism or Christianity or Magianism, as an animal delivers a perfect baby animal. Do you find it mutilated?\"",
      "chain": [
        "20404",
        "20177",
        "11013",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "1393",
      "source": " Sahih Bukhari ",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا آدم، حدثنا شعبة، عن الأعمش، عن مجاهد، عن عائشة  رضى الله عنها  قالت قال النبي صلى الله عليه وسلم ‏\"‏ لا تسبوا الأموات فإنهم قد أفضوا إلى ما قدموا ‏\"‏‏.‏ ورواه عبد الله بن عبد القدوس عن الأعمش، ومحمد بن أنس عن الأعمش‏.‏ تابعه علي بن الجعد وابن عرعرة وابن أبي عدي عن شعبة‏.‏",
      "text_en": " Narrated `Aisha:                     The Prophet (p.b.u.h) said, \"Don't abuse the dead, because they have reached the result of what they forwarded.\"",
      "chain": [
        "20404",
        "20020",
        "11060",
        "11028",
        "53"
      ]
    }
  ],
  "total_hadiths": 192
}