{
  "id": "20409",
  "name": "Ishaq bin Rashid al-Juzri إسحاق بن راشد الجزري",
  "full_name": "Ishaq bin Rashid al-Juzri إسحاق بن راشد الجزري",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Hiran",
      " Raqqa"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  4  -  ثقة ]"
    ],
    "tags": [
      "Client",
      "Ally B.Umayya",
      "al-Juzri",
      "al-Raqqi"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ خ  4  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ خ  4  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ خ  4  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "Hiran",
        "ar": "Hiran",
        "ckb": "Hiran"
      },
      {
        "en": " Raqqa",
        "ar": " Raqqa",
        "ckb": " Raqqa"
      }
    ],
    "tags_display": [
      {
        "en": "Client (Mawla)",
        "ar": "مولى",
        "ckb": "مەولا"
      },
      {
        "en": "Ally B.Umayya",
        "ar": "Ally B.Umayya",
        "ckb": "Ally B.Umayya"
      },
      {
        "en": "al-Juzri",
        "ar": "al-Juzri",
        "ckb": "al-Juzri"
      },
      {
        "en": "al-Raqqi",
        "ar": "al-Raqqi",
        "ckb": "al-Raqqi"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    },
    {
      "id": "11012",
      "name": "Maymun bin Mahran ميمون بن مهران",
      "grade": "Follower(Tabi') [4th generation]",
      "grade_display": {
        "en": "Follower (Tabi') [4th Generation]",
        "ar": "تابعي [الجيل الرابع]",
        "ckb": "شوێنكەوتوو (تابعی) [نەوەی چوارەم]"
      }
    }
  ],
  "students": [
    {
      "id": "20446",
      "name": "'Atab bin Bashayr عتاب بن بشير",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20465",
      "name": "Musa bin A'ayn al-Jazri موسى بن أعين الجزري",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    },
    {
      "id": "20115",
      "name": "Ma'mar bin Rashid معمر بن راشد",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [7th Generation]",
        "ar": "تابع التابعين [الجيل السابع]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
      }
    },
    {
      "id": "20111",
      "name": "Ibrahim bin al-Mukhtar al-Tamimi إبراهيم بن المختار التميمي حبويه",
      "grade": "Succ. (Taba' Tabi') [8th generation]",
      "grade_display": {
        "en": "Successor (Taba' Tabi') [8th Generation]",
        "ar": "تابع التابعين [الجيل الثامن]",
        "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
      }
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-4723",
      "hadith_no": "4723",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمد، حدثنا أحمد بن أبي شعيب، حدثنا موسى بن أعين، حدثنا إسحاق بن راشد، أن الزهري، حدثه قال أخبرني عبد الرحمن بن عبد الله بن كعب بن مالك، عن أبيه، قال سمعت أبي كعب بن مالك،، وهو أحد الثلاثة الذين تيب عليهم أنه لم يتخلف عن رسول الله صلى الله عليه وسلم في غزوة غزاها قط غير غزوتين غزوة العسرة وغزوة بدر‏.‏ قال فأجمعت صدق رسول الله صلى الله عليه وسلم ضحى، وكان قلما يقدم من سفر سافره إلا ضحى وكان يبدأ بالمسجد، فيركع ركعتين، ونهى النبي صلى الله عليه وسلم عن كلامي وكلام صاحبى، ولم ينه عن كلام أحد من المتخلفين غيرنا، فاجتنب الناس كلامنا، فلبثت كذلك حتى طال على الأمر، وما من شىء أهم إلى من أن أموت فلا يصلي على النبي صلى الله عليه وسلم أو يموت رسول الله صلى الله عليه وسلم فأكون من الناس بتلك المنزلة، فلا يكلمني أحد منهم، ولا يصلي على، فأنزل الله توبتنا على نبيه صلى الله عليه وسلم حين بقي الثلث الآخر من الليل، ورسول الله صلى الله عليه وسلم عند أم سلمة، وكانت أم سلمة محسنة في شأني معنية في أمري، فقال رسول الله صلى الله عليه وسلم ‏\"‏ يا أم سلمة تيب على كعب ‏\"‏‏.‏ قالت أفلا أرسل إليه فأبشره قال ‏\"‏ إذا يحطمكم الناس فيمنعونكم النوم سائر الليلة ‏\"‏‏.‏ حتى إذا صلى رسول الله صلى الله عليه وسلم صلاة الفجر آذن بتوبة الله علينا، وكان إذا استبشر استنار وجهه حتى كأنه قطعة من القمر، وكنا أيها الثلاثة الذين خلفوا عن الأمر الذي قبل من هؤلاء الذين اعتذروا حين أنزل الله لنا التوبة، فلما ذكر الذين كذبوا رسول الله صلى الله عليه وسلم من المتخلفين، واعتذروا بالباطل، ذكروا بشر ما ذكر به أحد قال الله سبحانه ‏{‏يعتذرون إليكم إذا رجعتم إليهم قل لا تعتذروا لن نؤمن لكم قد نبأنا الله من أخباركم وسيرى الله عملكم ورسوله‏}‏ الآية‏.‏",
      "text_en": " Narrated `Abdullah bin Ka`b:                     I heard Ka`b bin Malik who was one of the three who were forgiven, saying that he had never remained behind Allah's Apostle in any Ghazwa which he had fought except two Ghazwat Ghazwat- Al-`Usra (Tabuk) and Ghazwat-Badr. He added. \"I decided to tell the truth to Allah's Apostle in the forenoon, and scarcely did he return from a journey he made, except in the forenoon, he would go first to the mosque and offer a two-rak`at prayer. The Prophet forbade others to speak to me or to my two companions, but he did not prohibit speaking to any of those who had remained behind excepting us. So the people avoided speaking to us, and I stayed in that state till I could no longer bear it, and the only thing that worried me was that I might die and the Prophet would not offer the funeral prayer for me, or Allah's Apostle might die and I would be left in that social status among the people that nobody would speak to me or offer the funeral prayer for me. But Allah revealed His Forgiveness for us to the Prophet in the last third of the night while Allah's Apostle was with Um Salama. Um Salama sympathized with me and helped me in my disaster. Allah's Apostle said, 'O Um Salama! Ka`b has been forgiven!' She said, 'Shall I send someone to him to give him the good tidings?' He said, 'If you did so, the people would not let you sleep the rest of the night.' So when the Prophet had offered the Fajr prayer, he announced Allah's Forgiveness for us. His face used to look as bright as a piece of the (full) moon whenever he was pleased. When Allah revealed His Forgiveness for us, we were the three whose case had been deferred while the excuse presented by those who had apologized had been accepted. But when there were mentioned those who had told the Prophet lies and remained behind (the battle of Tabuk) and had given false excuses, they were described with the worse description one may be described with. Allah said: 'They will present their excuses to you (Muslims) when you return to them. Say: Present no excuses; we shall not believe you. Allah has already informed us of the true state of matters concerning you. Allah and His Apostle will observe your actions.\" (9.94)",
      "usc_msa_ref": "",
      "chain": [
        "30213",
        "30301",
        "20465",
        "20409",
        "11013",
        "11519",
        "1131"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5778",
      "hadith_no": "5778",
      "source": "Sahih Bukhari",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثني محمد، أخبرنا عتاب بن بشير، عن إسحاق، عن الزهري، قال أخبرني عبيد الله بن عبد الله، أن أم قيس بنت محصن،، وكانت، من المهاجرات الأول اللاتي بايعن رسول الله صلى الله عليه وسلم وهى أخت عكاشة بن محصن أخبرته أنها أتت رسول الله صلى الله عليه وسلم بابن لها قد علقت عليه من العذرة فقال ‏\"‏ اتقوا الله، على ما تدغرون أولادكم بهذه الأعلاق عليكم بهذا العود الهندي، فإن فيه سبعة أشفية، منها ذات الجنب ‏\"‏‏.‏ يريد الكست يعني القسط، قال وهى لغة‏.‏",
      "text_en": " Narrated Um Oais:                     that she took to Allah's Apostle one of her sons whose palate and tonsils she had pressed to treat a throat trouble. The Prophet said, \"Be afraid of Allah! Why do you pain your children by having their tonsils pressed like that? Use the Ud Al-Hindi (a certain Indian incense) for it cures seven diseases, one of which is pleurisy.\"",
      "usc_msa_ref": "616",
      "chain": [
        "30376",
        "20446",
        "20409",
        "11013",
        "11004",
        "827"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sunan-abi-daud-4258",
      "hadith_no": "4258",
      "source": "Sunan Abi Da'ud",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا أبي، حدثنا شهاب بن خراش، عن القاسم بن غزوان، عن إسحاق بن راشد الجزري، عن سالم، حدثني عمرو بن وابصة الأسدي، عن أبيه، وابصة، عن ابن مسعود، قال سمعت رسول الله صلى الله عليه وسلم يقول فذكر بعض حديث أبي بكرة قال ‏\"‏ قتلاها كلهم في النار ‏\"‏ ‏.‏ قال فيه قلت متى ذلك يا ابن مسعود قال تلك أيام الهرج حيث لا يأمن الرجل جليسه ‏.‏ قلت فما تأمرني إن أدركني ذلك الزمان قال تكف لسانك ويدك وتكون حلسا من أحلاس بيتك ‏.‏ فلما قتل عثمان طار قلبي مطاره فركبت حتى أتيت دمشق فلقيت خريم بن فاتك فحدثته فحلف بالله الذي لا إله إلا هو لسمعه من رسول الله صلى الله عليه وسلم كما حدثنيه ابن مسعود ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud ; Khuraym ibn Fatik:                     The tradition mentioned above (No. 4243) has also been transmitted by Ibn Mas'ud through a different chain of narrators.  Ibn Mas'ud said: I heard the Prophet (ﷺ) say: He then mentioned a portion of the tradition narrated by AbuBakrah (No. 4243).  This version adds: He (the Prophet) said: All their slain will go to Hell.  I (Wabisah) asked: When will this happen Ibn Mas'ud?  He replied: This is the period of turmoil (harj) when a man will not be safe from his associates.  I asked: What do you command me (to do) if I happen to live during that period?  He replied: You should restrain your tongue and hand and stay at home.  When Uthman was slain, I recollected this tradition. I then rode (on a camel) and came to Damascus. There I met Khuraym ibn Fatik and mentioned this tradition to him. He swore by Allah, there was no god but He, he had heard it from the Messenger of Allah (ﷺ), as Ibn Mas'ud transmitted it to me (Wabisah).",
      "usc_msa_ref": "",
      "chain": [
        "10581",
        "4",
        "25124",
        "28486",
        "20409",
        "11011",
        "18",
        "16"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-4042",
      "hadith_no": "4042",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا محمد بن حميد، حدثنا إبراهيم بن المختار، عن إسحاق بن راشد، عن الزهري، عن عروة، عن عائشة، أن النبي صلى الله عليه وسلم أمر بسد الأبواب إلا باب أبي بكر ‏.‏ هذا حديث غريب من هذا الوجه ‏.‏ وفي الباب عن أبي سعيد ‏.‏",
      "text_en": " Narrated 'Aishah:                     that the Prophet (ﷺ) ordered the closing of all the gates, except for the gate of Abu Bakr. And there is a nation on this topic from Abu Sa'eed.",
      "usc_msa_ref": "",
      "chain": [
        "38495",
        "20111",
        "20409",
        "11013",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-2192",
      "hadith_no": "2192",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن جبلة، قال حدثنا المعافى، قال حدثنا موسى، عن إسحاق بن راشد، عن الزهري، قال أخبرني عروة بن الزبير، أن عائشة، زوج النبي صلى الله عليه وسلم أخبرته أن رسول الله صلى الله عليه وسلم كان يرغب الناس في قيام رمضان من غير أن يأمرهم بعزيمة أمر فيه فيقول ‏\"‏ من قام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه ‏\"‏ ‏.‏",
      "text_en": " 'Urwah bin Az-Zubair narrated that Aishah told him that:                     the Messenger of Allah used to encourage the people to pray Qiyam in Ramadan, without insisting on that. He said: \"Whoever spends the nights of Ramadan in prayer out of faith and in the hope of reward, he will be forgiven his previous sins.\" '",
      "usc_msa_ref": "",
      "chain": [
        "38485",
        "20040",
        "20409",
        "11013",
        "10511"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-3423",
      "hadith_no": "3423",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرني محمد بن جبلة، ومحمد بن يحيى بن محمد، قالا حدثنا محمد بن موسى بن أعين، قال حدثنا أبي، عن إسحاق بن راشد، عن الزهري، أخبرني عبد الرحمن بن عبد الله بن كعب بن مالك، عن أبيه، قال سمعت أبي كعب بن مالك، - قال وهو أحد الثلاثة الذين تيب عليهم - يحدث قال أرسل إلى رسول الله صلى الله عليه وسلم وإلى صاحبى أن رسول الله صلى الله عليه وسلم يأمركم أن تعتزلوا نساءكم ‏.‏ فقلت للرسول أطلق امرأتي أم ماذا أفعل قال لا بل تعتزلها فلا تقربها ‏.‏ فقلت لامرأتي الحقي بأهلك فكوني فيهم فلحقت بهم ‏.‏",
      "text_en": " 'Abdur-Rahman bin 'Abdullah bin Ka'b bin Malik narrated that his father said:                      \"I heard my father Ka'b bin Malik -who was one of the three whose repentance was accepted- say: 'The Messenger of Allah sent word to me and to my two companions saying: The Messenger of Allah commands you to keep away from your wives. I said to his envoy: Shall I divorce my wife, or what should I do? He said: No, just keep away from her, and do not approach her. I said to my wife: Go to your family and stay with them. So she went to them.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38485",
        "11222",
        "30384",
        "20409",
        "11013",
        "11519",
        "1131"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-an-nasai-4901",
      "hadith_no": "4901",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "أخبرنا محمد بن جبلة، قال حدثنا محمد بن موسى بن أعين، قال حدثنا أبي، عن إسحاق بن راشد، عن الزهري، عن عروة، عن عائشة، أن قريشا، أهمهم شأن المخزومية التي سرقت فقالوا من يكلم فيها قالوا من يجترئ عليه إلا أسامة بن زيد حب رسول الله صلى الله عليه وسلم ‏.‏ فكلمه أسامة فقال رسول الله صلى الله عليه وسلم ‏\"‏ إنما هلك الذين من قبلكم أنهم كانوا إذا سرق فيهم الشريف تركوه وإذا سرق فيهم الضعيف أقاموا عليه الحد وايم الله لو سرقت فاطمة بنت محمد لقطعت يدها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Aishah the Quraish were worried about the case of the Makhzumi woman who stole, and they said:                     \"Who will speak concerning her?\" They said: \"Who would dare to do that except Usamah bin Zaid, the beloved of the Messenger of Allah?\" said: \"Those who came before you were destroyed because whenever a noble person among them stole they would let him go. But if a person who was weak stole, they would carry out the Hadd punishment. By Allah, if Fatimah, the daughter of Muhammad, were to steal, I would ct off her hand.\"",
      "usc_msa_ref": "",
      "chain": [
        "38485",
        "30384",
        "20409",
        "11013",
        "10511",
        "53"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-2535",
      "hadith_no": "2535",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Pawning - كتاب الرهون",
      "chapter_no": "16",
      "text_ar": "حدثنا محمد بن حميد، حدثنا إبراهيم بن المختار، عن إسحاق بن راشد، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا يغلق الرهن ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said:                     “Do not forfeit items held in pledge.”",
      "usc_msa_ref": "",
      "chain": [
        "38495",
        "20111",
        "20409",
        "11013",
        "11002",
        "13"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 8,
  "grade_display": {
    "en": "Successor (Taba' Tabi') [7th Generation]",
    "ar": "تابع التابعين [الجيل السابع]",
    "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
  }
}