{
  "id": "20413",
  "name": "Bashr bin Bakr al-Tunisi بشر بن بكر التنيسي",
  "full_name": "Bashr bin Bakr al-Tunisi بشر بن بكر التنيسي",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "124",
      "date_gregorian": "NA",
      "date_display": [
        "124 AH"
      ],
      "place": "Damascus"
    },
    "death": {
      "date_hijri": "205",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Damascus",
      "Tunis"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  د  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Bajli",
      "al-Damashiqi",
      "al-Tunisi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11684",
      "name": "Huraiz bin 'Uthman bin Jabir حريز بن عثمان بن جبر الرحبي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20638",
      "name": "Sa'id bin 'Abdul 'Aziz al-Tanuqi سعيد بن عبد العزيز التنوخي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30285",
      "name": "'Abdur Rahman bin Ibrahim عبد الرحمن بن إبراهيم - دحيم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30485",
      "name": "Ahmed bin 'Amr bin al-Sarh أحمد بن عمرو بن السرح أبو الطاهر",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30418",
      "name": "'Abdullah bin al-Zubair bin 'Isa عبد الله بن الزبير بن عيسى الحميدي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30275",
      "name": "Muhammad bin Mskyn bin Nmylh محمد بن مسكين بن نميلة",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20002",
      "name": "Imam Shafi'ee ابو عبد الله محمد بن إدريس الشافعي",
      "grade": "Succ. (Taba' Tabi') [9th generation] [Shafi'ee]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1559",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا الحميدي، حدثنا الوليد، وبشر بن بكر التنيسي، قالا حدثنا الأوزاعي، قال حدثني يحيى، قال حدثني عكرمة، أنه سمع ابن عباس  رضى الله عنهما  يقول إنه سمع عمر  رضى الله عنه  يقول سمعت النبي صلى الله عليه وسلم بوادي العقيق يقول ‏\"‏ أتاني الليلة آت من ربي فقال صل في هذا الوادي المبارك وقل عمرة في حجة ‏\"‏‏.‏",
      "text_en": " Narrated `Umar:                     In the valley of Al-`Aqiq I heard Allah's Apostle saying, \"To night a messenger came to me from my Lord and asked me to pray in this blessed valley and to assume Ihram for Hajj and `Umra together. \"",
      "chain": [
        "30418",
        "20733",
        "20413",
        "20024",
        "11449",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "789",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، حدثنا عمر بن عبد الواحد، وبشر بن بكر، عن الأوزاعي، عن يحيى بن أبي كثير، عن عبد الله بن أبي قتادة، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إني لأقوم إلى الصلاة وأنا أريد أن أطول فيها فأسمع بكاء الصبي فأتجوز كراهية أن أشق على أمه ‏\"‏ ‏.‏",
      "text_en": " Abu Qatadah reported the Messenger of Allah (ﷺ) as saying:                      I stand up to pray and intend to prolong it; but when I hear the cry of a boy I shorten if for fear that his mother  might be distressed.",
      "chain": [
        "30285",
        "27536",
        "20413",
        "20024",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "847",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مؤمل بن الفضل الحراني، حدثنا الوليد، ح وحدثنا محمود بن خالد، حدثنا أبو مسهر، ح وحدثنا ابن السرح، حدثنا بشر بن بكر، ح وحدثنا محمد بن مصعب، حدثنا عبد الله بن يوسف، كلهم عن سعيد بن عبد العزيز، عن عطية بن قيس، عن قزعة بن يحيى، عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم كان يقول حين يقول سمع الله لمن حمده ‏\"‏ اللهم ربنا لك الحمد ملء السماء ‏\"‏ ‏.‏ قال مؤمل ملء السموات وملء الأرض وملء ما شئت من شىء بعد أهل الثناء والمجد أحق ما قال العبد وكلنا لك عبد لا مانع لما أعطيت ‏\"‏ ‏.‏ زاد محمود ‏\"‏ ولا معطي لما منعت ‏\"‏ ‏.‏ ثم اتفقوا - ‏\"‏ ولا ينفع ذا الجد منك الجد ‏\"‏ ‏.‏ قال بشر ‏\"‏ ربنا لك الحمد ‏\"‏ ‏.‏ لم يقل محمود ‏\"‏ اللهم ‏\"‏ ‏.‏ قال ‏\"‏ ربنا ولك الحمد ‏\"‏ ‏.‏",
      "text_en": " Abu sa’id al-Khuri said:                      When the Messenger of Allah (ﷺ) said: “ Allah listens to him who praises Him,” he also said: O Allah, our Lord, to thee be the praise in all heavens. Mu’ammil said( in his version); “ In all the heavens, and in all the earth, and in all that it pleases Thee to create afterwards. O thou Who art worthy of praise and glory, most worthy of what a servant says, and we are all thy servants, no one can withhold what thou givest or give what Thou withholdest. “The narrators then were agreed on the words: “And riches cannot avail a wealthy person with Thee.”",
      "chain": [
        "38659",
        "20733",
        "37534",
        "30284",
        "30485",
        "20413",
        "28536",
        "30355",
        "20638",
        "10877",
        "11302",
        "38"
      ]
    },
    {
      "hadith_no": "2218",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "قال أبو داود قرأت على محمد بن وزير المصري قلت له حدثكم بشر بن بكر، حدثنا الأوزاعي، حدثنا عطاء، عن أوس، أخي عبادة بن الصامت أن النبي صلى الله عليه وسلم أعطاه خمسة عشر صاعا من شعير إطعام ستين مسكينا ‏.‏ قال أبو داود وعطاء لم يدرك أوسا وهو من أهل بدر قديم الموت والحديث مرسل وإنما رووه عن الأوزاعي عن عطاء أن أوسا ‏.‏",
      "text_en": " Abu Dawud said “I recited to Muhammad bin Wazir Al Misri and said to him Bishr bin Bakr narrated it to you and Al Auza’i narrated it to us. And he said “At’a narrated it to us on the authority of Aus brother of ‘Ubadah bin Al Samit. The Prophet (ﷺ) gave him fifteen sa’s of wheat to feed sixty poor people.Abu Dawud said At’a did not meet Aws (bin Al Samit) who was one of the people of Badr and died in the early days of Islam. This version is therefore, mursal (i.e., a successor narrated it directly from the Prophet (ﷺ), the link of the Companions is missing). This has been narrated by Al Auza’i from At’a from Aus.",
      "chain": [
        "30002",
        "20413",
        "20024",
        "11029"
      ]
    },
    {
      "hadith_no": "3956",
      "source": " Sunan Abi Da'ud ",
      "chapter": "The Book of Manumission of Slaves - كتاب العتق",
      "chapter_no": "31",
      "text_ar": "حدثنا جعفر بن مسافر، حدثنا بشر بن بكر، أخبرنا الأوزاعي، حدثني عطاء بن أبي رباح، حدثني جابر بن عبد الله، بهذا زاد وقال - يعني النبي صلى الله عليه وسلم - ‏\"‏ أنت أحق بثمنه والله أغنى عنه ‏\"‏ ‏.‏",
      "text_en": " The tradition mentioned above also has been transmitted by Jabir b. 'Abd Allah through a different chain of narrators. This version added:                      The Prophet (ﷺ) said: You are more entitled to his price, and Allah has no need of it.",
      "chain": [
        "38132",
        "20413",
        "20024",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "4039",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Clothing (Kitab Al-Libas) - كتاب اللباس",
      "chapter_no": "34",
      "text_ar": "حدثنا عبد الوهاب بن نجدة، حدثنا بشر بن بكر، عن عبد الرحمن بن يزيد بن جابر، حدثنا عطية بن قيس، قال سمعت عبد الرحمن بن غنم الأشعري، قال حدثني أبو عامر، أو أبو مالك - والله يمين أخرى ما كذبني - أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ ليكونن من أمتي أقوام يستحلون الخز والحرير ‏\"‏ ‏.‏ وذكر كلاما قال ‏\"‏ يمسخ منهم آخرون قردة وخنازير إلى يوم القيامة ‏\"‏ ‏.‏ قال أبو داود وعشرون نفسا من أصحاب رسول الله صلى الله عليه وسلم أو أكثر لبسوا الخز منهم أنس والبراء بن عازب ‏.‏",
      "text_en": " Narrated Abdur Rahman ibn Ghanam al-Ash'ari:                     Abu Amir or Abu Malik told me--I swear by Allah another oath that he did not believe me that he heard the Messenger of Allah (ﷺ) say: There will be among my community people who will make lawful (the use of) khazz and silk. Some of them will be transformed into apes and swine.Abu Dawud said: Twenty Companions of the Messenger of Allah (ﷺ) or more put on khazz. Anas and al-Bara' b. 'Azib were among them.",
      "chain": [
        "38363",
        "20413",
        "20395",
        "10877",
        "5152"
      ]
    },
    {
      "hadith_no": "4297",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم الدمشقي، حدثنا بشر بن بكر، حدثنا ابن جابر، حدثني أبو عبد السلام، عن ثوبان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يوشك الأمم أن تداعى عليكم كما تداعى الأكلة إلى قصعتها ‏\"‏ ‏.‏ فقال قائل ومن قلة نحن يومئذ قال ‏\"‏ بل أنتم يومئذ كثير ولكنكم غثاء كغثاء السيل ولينزعن الله من صدور عدوكم المهابة منكم وليقذفن الله في قلوبكم الوهن ‏\"‏ ‏.‏ فقال قائل يا رسول الله وما الوهن قال ‏\"‏ حب الدنيا وكراهية الموت ‏\"‏ ‏.‏",
      "text_en": " Narrated Thawban:                     The Prophet (ﷺ) said: The people will soon summon one another to attack you as people when eating invite others to share their dish. Someone asked: Will that be because of our small numbers at that time? He replied: No, you will be numerous at that time: but you will be scum and rubbish like that carried down by a torrent, and Allah will take fear of you from the breasts of your enemy and last enervation into your hearts.  Someone asked: What is wahn (enervation). Messenger of Allah (ﷺ): He replied: Love of the world and dislike of death.",
      "chain": [
        "20413",
        "130"
      ]
    },
    {
      "hadith_no": "1764",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا الحارث بن أسد، قال حدثنا بشر بن بكر، قال حدثني الأوزاعي، قال حدثني يحيى بن أبي كثير، عن عمر بن الحكم بن ثوبان، قال حدثني أبو سلمة بن عبد الرحمن، عن عبد الله بن عمرو، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تكن يا عبد الله مثل فلان كان يقوم الليل فترك قيام الليل ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     \"The Messenger of Allah (ﷺ) said to me: 'O Abdullah do not be like so-and-so; he used to pray Qiyam Al-Lail and then he stopped.'\"",
      "chain": [
        "20413",
        "20024",
        "11449",
        "11897",
        "10567",
        "29"
      ]
    },
    {
      "hadith_no": "1044",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، حدثنا عمر بن عبد الواحد، وبشر بن بكر، عن الأوزاعي، عن يحيى بن أبي كثير، عن عبد الله بن أبي قتادة، عن أبيه، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إني لأقوم في الصلاة وأنا أريد أن أطول فيها فأسمع بكاء الصبي فأتجوز كراهية أن أشق على أمه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Abu Qatadah that his father said:                     “TheMessenger of Allah (ﷺ) said: ‘I get up to perform prayer and Iintend to make it long, but then I hear an infant crying, so I makeitshort, because I do not like to cause distress to his mother.’”",
      "chain": [
        "30285",
        "27536",
        "20413",
        "20024",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "3917",
      "source": " Sunan Ibn Majah ",
      "chapter": "Interpretation of Dreams - كتاب تعبير الرؤيا",
      "chapter_no": "35",
      "text_ar": "حدثنا أحمد بن عمرو بن السرح المصري، حدثنا بشر بن بكر، حدثنا الأوزاعي، عن ابن سيرين، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا قرب الزمان لم تكد رؤيا المؤمن تكذب وأصدقهم رؤيا أصدقهم حديثا ورؤيا المسلم جزء من ستة وأربعين جزءا من النبوة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “When the end of time draws near, hardly any believer will see afalse dream, and the ones who see the truest dreams will be the oneswho are truest in speech. And the dream of the believer is one of theforty-six parts of prophecy.’”",
      "chain": [
        "20413",
        "20024",
        "11035",
        "13"
      ]
    }
  ],
  "total_hadiths": 10
}