{
  "id": "20415",
  "name": "Thaur bin Yazid al-Rahbi ثور بن يزيد",
  "full_name": "Thaur bin Yazid al-Rahbi ثور بن يزيد",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "155",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Hims"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-Kula'i",
      "al-Himsi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11066",
      "name": "Makhul al-Shami/al-Damashiqi مكحول الشامي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10910",
      "name": "Rja'a bin Hywh رجاء بن حيوة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "17038",
      "name": "Salah bin Yahya bin al-Mqdam صالح بن يحيى بن المقدام",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11029",
      "name": "'Ata' bin Abi Rabah عطاء بن أبي رباح",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11023",
      "name": "'Ikrama عكرمة",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11263",
      "name": "Muhammad bin Muslim bin Tadras محمد بن مسلم بن تدرس أبو الزبير",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "17060",
      "name": "Mt'm bin al-Mqdam bin Ghnym مطعم بن المقدام",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11070",
      "name": "Ibn Jurayj ابن جريج",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11061",
      "name": "Abu al-Zanad أبو الزناد",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11422",
      "name": "Khalid bin Ma'dan خالد بن معدان",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "10899",
      "name": "Habib bin 'Ubaid al-Rhby حبيب بن عبيد الرحبي",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11013",
      "name": "al-Zuhri ابن شهاب الزهري‎, محمد بن مسلم",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20644",
      "name": "Baqiyya bin al-Walid bin Sa'aid بقية بن الوليد بن صائد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20330",
      "name": "'Abdullah bin Da'ud al-Kharaybi عبد الله بن داود أبو عبد الرحمن الخريبي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20553",
      "name": "Safwan bin 'Isa al-Zhry صفوان بن عيسى الزهري أبو محمد البصري",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "2005",
      "name": "Umm Harith bint 'Ayyash bin Abi Rabi'a ( أم الحارث بنت عياش بن أبي ربيعة ( رضي الله عنها",
      "grade": "Comp.(RA)"
    },
    {
      "id": "20347",
      "name": "'Isa bin Yonus bin Abi Ishaq عيسى بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "11107",
      "name": "Ibn Ishaq محمد بن إسحاق بن يسار‎",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20733",
      "name": "al-Walid bin Muslim al-Quraishi الوليد بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20402",
      "name": "Yahya bin Hamza bin Waqd يحيى بن حمزة بن واقد",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20241",
      "name": "al-Dahhak bin Mukhlad Abu 'Asim al-Nabil الضحاك بن مخلد أبو عاصم النبيل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2924",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثني إسحاق بن يزيد الدمشقي، حدثنا يحيى بن حمزة، قال حدثني ثور بن يزيد، عن خالد بن معدان، أن عمير بن الأسود العنسي، حدثه أنه، أتى عبادة بن الصامت وهو نازل في ساحل حمص، وهو في بناء له ومعه أم حرام، قال عمير فحدثتنا أم حرام أنها سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ أول جيش من أمتي يغزون البحر قد أوجبوا ‏\"‏‏.‏ قالت أم حرام قلت يا رسول الله أنا فيهم‏.‏ قال ‏\"‏ أنت فيهم ‏\"‏‏.‏ ثم قال النبي صلى الله عليه وسلم ‏\"‏ أول جيش من أمتي يغزون مدينة قيصر مغفور لهم ‏\"‏‏.‏ فقلت أنا فيهم يا رسول الله‏.‏ قال ‏\"‏ لا ‏\"‏‏.‏",
      "text_en": " Narrated Khalid bin Madan:                     That 'Umair bin Al-Aswad Al-Anasi told him that he went to 'Ubada bin As-Samit while he was staying in his house at the sea-shore of Hims with (his wife) Um Haram. 'Umair said. Um Haram informed us that she heard the Prophet saying, \"Paradise is granted to the first batch of my followers who will undertake a naval expedition.\" Um Haram added, I said, 'O Allah's Apostle! Will I be amongst them?' He replied, 'You are amongst them.' The Prophet then said, 'The first army amongst' my followers who will invade Caesar's City will be forgiven their sins.' I asked, 'Will I be one of them, O Allah's Apostle?' He replied in the negative.\"",
      "chain": [
        "20402",
        "20415",
        "11422",
        "11714"
      ]
    },
    {
      "hadith_no": "5515",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا أبو عاصم، عن ثور بن يزيد، عن خالد بن معدان، عن أبي أمامة، أن النبي صلى الله عليه وسلم كان إذا فرغ من طعامه  وقال مرة إذا رفع مائدته  قال ‏\"‏ الحمد لله الذي كفانا وأروانا، غير مكفي، ولا مكفور  وقال مرة الحمد لله ربنا، غير مكفي، ولا مودع  ولا مستغنى، ربنا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Umama:                     Whenever the Prophet finished his meals (or when his dining sheet was taken away), he used to say. \"Praise be to Allah Who has satisfied our needs and quenched our thirst. Your favor cannot by compensated or denied.\" Once he said, upraise be to You, O our Lord! Your favor cannot be compensated, nor can be left, nor can be dispensed with, O our Lord!\"",
      "chain": [
        "20241",
        "20415",
        "11422",
        "405"
      ]
    },
    {
      "hadith_no": "165",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا موسى بن مروان، ومحمود بن خالد الدمشقي، - المعنى - قالا حدثنا الوليد، - قال محمود - أخبرنا ثور بن يزيد، عن رجاء بن حيوة، عن كاتب المغيرة بن شعبة، عن المغيرة بن شعبة، قال وضأت النبي صلى الله عليه وسلم في غزوة تبوك فمسح أعلى الخفين وأسفلهما ‏.‏ قال أبو داود وبلغني أنه لم يسمع ثور هذا الحديث من رجاء ‏.‏",
      "text_en": " Narrated Al-Mughirah ibn Shu'bah:                     I poured water while the Prophet (ﷺ)  performed ablution in the battle of Tabuk. He wiped over the upper part of the socks and their lower part.Abu Dawud said: I have been told that Thawr did not hear this tradition from Raja'.",
      "chain": [
        "35154",
        "37534",
        "20733",
        "30277",
        "20415",
        "10910",
        "166"
      ]
    },
    {
      "hadith_no": "2193",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا عبيد الله بن سعد الزهري، أن يعقوب بن إبراهيم، حدثهم قال حدثنا أبي، عن ابن إسحاق، عن ثور بن يزيد الحمصي، عن محمد بن عبيد الله بن أبي صالح الذي، كان يسكن إيليا قال خرجت مع عدي بن عدي الكندي حتى قدمنا مكة فبعثني إلى صفية بنت شيبة وكانت قد حفظت من عائشة قالت سمعت عائشة تقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا طلاق ولا عتاق في غلاق ‏\"‏ ‏.‏ قال أبو داود الغلاق أظنه في الغضب ‏.‏",
      "text_en": " Muhammad ibn Ubayd ibn Abu Salih who lived in Ayliya said:                      I went out with Adi ibn Adi al-Kindi till we came to Mecca. He sent me to Safiyyah daughter of Shaybah who remembered a tradition (that she had heard) from Aisha. She said: I heard Aisha say: I heard the Messenger of Allah (ﷺ) say: There is no divorce or emancipation in case of constraint or duress (ghalaq).Abu Dawud said: I think ghalaq means anger.",
      "chain": [
        "30258",
        "20184",
        "20150",
        "11107",
        "20415",
        "30213"
      ]
    },
    {
      "hadith_no": "2421",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Fasting (Kitab Al-Siyam) - كتاب الصوم",
      "chapter_no": "14",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا سفيان بن حبيب، ح وحدثنا يزيد بن قبيس، - من أهل جبلة - حدثنا الوليد، جميعا عن ثور بن يزيد، عن خالد بن معدان، عن عبد الله بن بسر السلمي، عن أخته، - وقال يزيد الصماء - أن النبي صلى الله عليه وسلم قال ‏\"‏ لا تصوموا يوم السبت إلا فيما افترض عليكم وإن لم يجد أحدكم إلا لحاء عنبة أو عود شجرة فليمضغه ‏\"‏ ‏.‏ قال أبو داود وهذا حديث منسوخ ‏.‏",
      "text_en": " Narrated As-Samma' sister of Abdullah ibn Busr:                     The Prophet (ﷺ) said: Do not fast on Saturday except what has been made obligatory on you; and if one of you can get nothing but a grape skin or a piece of wood from a tree, he should chew it.",
      "chain": [
        "30430",
        "20711",
        "20733",
        "20415",
        "11422"
      ]
    },
    {
      "hadith_no": "2542",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو توبة، عن الهيثم بن حميد، ح وحدثنا خشيش بن أصرم، حدثنا أبو عاصم، جميعا عن ثور بن يزيد، عن نصر الكناني، عن رجلوقال أبو توبة ‏:‏ عن ثور بن يزيد، عن شيخ، من بني سليم عن عتبة بن عبد السلمي، - وهذا لفظه - أنه سمع رسول الله صلى الله عليه وسلم يقول ‏:‏ ‏\"‏ لا تقصوا نواصي الخيل ولا معارفها ولا أذنابها، فإن أذنابها مذابها، ومعارفها دفاؤها، ونواصيها معقود فيها الخير ‏\"‏ ‏.‏",
      "text_en": " Narrated Utbah ibn AbdusSulami:                     Utbah heard the Messenger of Allah (ﷺ) say: Do not cut the forelocks, manes, or tails of horse, for their tails are their means of driving flies, their manes provide them with warmth, and blessing is tide to their forelocks.",
      "chain": [
        "30335",
        "20744",
        "38204",
        "20241",
        "20415",
        "20415",
        "5166"
      ]
    },
    {
      "hadith_no": "3790",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Foods (Kitab Al-At'imah) - كتاب الأطعمة",
      "chapter_no": "28",
      "text_ar": "حدثنا سعيد بن شبيب، وحيوة بن شريح الحمصي، قال حيوة حدثنا بقية، عن ثور بن يزيد، عن صالح بن يحيى بن المقدام بن معديكرب، عن أبيه، عن جده، عن خالد بن الوليد، أن رسول الله صلى الله عليه وسلم نهى عن أكل لحوم الخيل والبغال والحمير - زاد حيوة - وكل ذي ناب من السباع ‏.‏ قال أبو داود وهو قول مالك ‏.‏ قال أبو داود لا بأس بلحوم الخيل وليس العمل عليه ‏.‏ قال أبو داود وهذا منسوخ قد أكل لحوم الخيل جماعة من أصحاب النبي صلى الله عليه وسلم منهم ابن الزبير وفضالة بن عبيد وأنس بن مالك وأسماء ابنة أبي بكر وسويد بن غفلة وعلقمة وكانت قريش في عهد رسول الله صلى الله عليه وسلم تذبحها ‏.‏",
      "text_en": " Narrated Khalid ibn al-Walid:                     The Messenger of Allah (ﷺ) forbade us to eat horse-flesh, the flesh of mules and of asses. The narrator Haywah added: Every beast of prey with a fang.Abu Dawud said: This view is held by Malik.Abu Dawud said: There is no harm in (eating) horse-flesh and this tradition is not practised.Abu Dawud said: This tradition has been abrogated. A body of Companions of the Prophet (ﷺ) had eaten horse-flesh. OF them are: Ibn al-Zubair, Fudalah bin 'Ubaid, Anas bin Malik, Asma' daughter of Abu Bakr, Suwaid bin Ghaflah, 'Alqamah; the Quraish used to slaughter them (horses) during the time of the Messenger of Allah (ﷺ).",
      "chain": [
        "26010",
        "26010",
        "20644",
        "20415",
        "22"
      ]
    },
    {
      "hadith_no": "4607",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا الوليد بن مسلم، حدثنا ثور بن يزيد، قال حدثني خالد بن معدان، قال حدثني عبد الرحمن بن عمرو السلمي، وحجر بن حجر، قالا أتينا العرباض بن سارية وهو ممن نزل فيه ‏{‏ ولا على الذين إذا ما أتوك لتحملهم قلت لا أجد ما أحملكم عليه ‏}‏ فسلمنا وقلنا أتيناك زائرين وعائدين ومقتبسين ‏.‏ فقال العرباض صلى بنا رسول الله صلى الله عليه وسلم ذات يوم ثم أقبل علينا فوعظنا موعظة بليغة ذرفت منها العيون ووجلت منها القلوب فقال قائل يا رسول الله كأن هذه موعظة مودع فماذا تعهد إلينا فقال ‏\"‏ أوصيكم بتقوى الله والسمع والطاعة وإن عبدا حبشيا فإنه من يعش منكم بعدي فسيرى اختلافا كثيرا فعليكم بسنتي وسنة الخلفاء المهديين الراشدين تمسكوا بها وعضوا عليها بالنواجذ وإياكم ومحدثات الأمور فإن كل محدثة بدعة وكل بدعة ضلالة ‏\"‏ ‏.‏",
      "text_en": " Narrated Irbad ibn Sariyah:                     AbdurRahman ibn Amr as-Sulami and Hujr ibn Hujr said: We came to Irbad ibn Sariyah who was among those about whom the following verse was revealed: \"Nor (is there blame) on those who come to thee to be provided with mounts, and when thou saidst: \"I can find no mounts for you.\"  We greeted him and said: We have come to see you to give healing and obtain benefit from you.  Al-Irbad said: One day the Messenger of Allah (ﷺ) led us in prayer, then faced us and gave us a lengthy exhortation at which the eyes shed tears and the hearts were afraid.  A man said: Messenger of Allah! It seems as if it were a farewell exhortation, so what injunction do you give us?  He then said: I enjoin you to fear Allah, and to hear and obey even if it be an Abyssinian slave, for those of you who live after me will see great disagreement. You must then follow my sunnah and that of the rightly-guided caliphs. Hold to it and stick fast to it. Avoid novelties, for every novelty is an innovation, and every innovation is an error.",
      "chain": [
        "30007",
        "20733",
        "20415",
        "11422",
        "17046"
      ]
    },
    {
      "hadith_no": "97",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Purification - كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو الوليد الدمشقي، حدثنا الوليد بن مسلم، أخبرني ثور بن يزيد، عن رجاء بن حيوة، عن كاتب المغيرة، عن المغيرة بن شعبة، أن النبي صلى الله عليه وسلم مسح أعلى الخف وأسفله ‏.‏ قال أبو عيسى وهذا قول غير واحد من أصحاب النبي صلى الله عليه وسلم والتابعين ومن بعدهم من الفقهاء وبه يقول مالك والشافعي وإسحاق ‏.‏ وهذا حديث معلول لم يسنده عن ثور بن يزيد غير الوليد بن مسلم ‏.‏ قال أبو عيسى وسألت أبا زرعة ومحمد بن إسماعيل عن هذا الحديث فقالا ليس بصحيح لأن ابن المبارك روى هذا عن ثور عن رجاء بن حيوة قال حدثت عن كاتب المغيرة مرسل عن النبي صلى الله عليه وسلم ولم يذكر فيه المغيرة ‏.‏",
      "text_en": " AI-Mughirah bin Shu'bah narrated:                     \"The Prophet wiped over the Khuff and its bottom.\"",
      "chain": [
        "20733",
        "20415",
        "10910",
        "166"
      ]
    },
    {
      "hadith_no": "744",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا حميد بن مسعدة، حدثنا سفيان بن حبيب، عن ثور بن يزيد، عن خالد بن معدان، عن عبد الله بن بسر، عن أخته، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تصوموا يوم السبت إلا فيما افترض الله عليكم فإن لم يجد أحدكم إلا لحاء عنبة أو عود شجرة فليمضغه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ ومعنى كراهته في هذا أن يخص الرجل يوم السبت بصيام لأن اليهود تعظم يوم السبت ‏.‏",
      "text_en": " Abdullah bin Busr narrated from his sister that :                     the Messenger of Allah said: \"Do not fast on Saturday except for what has been made obligatory upon you (by Allah). If one of you does not find but a grape peal or a tree's twig, then let him chew it.\"",
      "chain": [
        "30430",
        "20711",
        "20415",
        "11422",
        "3650"
      ]
    },
    {
      "hadith_no": "745",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا أبو حفص، عمرو بن علي الفلاس حدثنا عبد الله بن داود، عن ثور بن يزيد، عن خالد بن معدان، عن ربيعة الجرشي، عن عائشة، قالت كان النبي صلى الله عليه وسلم يتحرى صوم الاثنين والخميس ‏.‏ قال وفي الباب عن حفصة وأبي قتادة وأبي هريرة وأسامة بن زيد ‏.‏ قال أبو عيسى حديث عائشة حديث حسن غريب من هذا الوجه ‏.‏",
      "text_en": " Aishah narrated:                     \"The Prophet used to try to fast on Mondays and Thursdays.\"",
      "chain": [
        "30286",
        "20330",
        "20415",
        "11422",
        "14894",
        "53"
      ]
    },
    {
      "hadith_no": "2392",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا بندار، أخبرنا يحيى بن سعيد القطان، أخبرنا ثور بن يزيد، عن حبيب بن عبيد، عن المقدام بن معديكرب، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا أحب أحدكم أخاه فليعلمه إياه ‏\"‏ ‏.‏ وفي الباب عن أبي ذر وأنس ‏.‏ قال أبو عيسى حديث المقدام حديث حسن صحيح غريب ‏.‏ والمقدام يكنى أبا كريمة ‏.‏",
      "text_en": " Al-Miqdam bin Ma'dikarib narrated that the Messenger of Allah (s.a.w) said:                     \"When one of you loves his brother,then let him inform him of it.\"",
      "chain": [
        "30160",
        "20031",
        "20415",
        "10899"
      ]
    },
    {
      "hadith_no": "2693",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on the description of the Day of Judgement, Ar-Riqaq, and Al-Wara' - كتاب صفة القيامة والرقائق والورع عن رسول الله صلى الله",
      "chapter_no": "37",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا محمد بن الحسن بن أبي يزيد الهمداني، عن ثور بن يزيد، عن خالد بن معدان، عن معاذ بن جبل، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من عير أخاه بذنب لم يمت حتى يعمله ‏\"‏ ‏.‏ قال أحمد من ذنب قد تاب منه ‏.‏ قال أبو عيسى هذا حديث غريب وليس إسناده بمتصل ‏.‏ وخالد بن معدان لم يدرك معاذ بن جبل وروي عن خالد بن معدان أنه أدرك سبعين من أصحاب النبي صلى الله عليه وسلم ‏.‏ ومات معاذ بن جبل في خلافة عمر بن الخطاب وخالد بن معدان روى عن غير واحد من أصحاب معاذ عن معاذ غير حديث ‏.‏",
      "text_en": " Khalid bin Ma'dan narrated from Mu'adh bin Jabal that the Messenger of Allah (s.a.w) said:                     \"Whoever shames his brother for a sin, he shall not die until he (himself) commits it.\" (One of the narrators) Ahmad said: They said: 'From a sin he has repented from.\"",
      "chain": [
        "30242",
        "25260",
        "20415",
        "11422",
        "32"
      ]
    },
    {
      "hadith_no": "2989",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "قال سمعت قتيبة، حدثنا وكيع بن الجراح، عن رجل، عن ثور بن يزيد، أن النبي صلى الله عليه وسلم نصب المنجنيق على أهل الطائف ‏.‏ قال قتيبة قلت لوكيع من هذا قال صاحبكم عمر بن هارون ‏.‏",
      "text_en": "",
      "chain": [
        "30367",
        "20032",
        "20415"
      ]
    },
    {
      "hadith_no": "3456",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن بشار، حدثنا يحيى بن سعيد، حدثنا ثور بن يزيد، حدثنا خالد بن معدان، عن أبي أمامة، قال كان رسول الله صلى الله عليه وسلم إذا رفعت المائدة من بين يديه يقول ‏\"‏ الحمد لله حمدا كثيرا طيبا مباركا فيه غير مودع ولا مستغنى عنه ربنا ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Umamah narrated that :                     when the table spread would be lifted from in front of him, the Messenger of Allah would say: “All praise is due to Allah, abundant, good, blessed praise, without being left off, nor being without need of it, O our Lord (Al-Hamdulillahi Hamdan Kathiran Tayyiban Mabarakan Fihi, Ghaira Muwwadda’in, Wa La Mustaghnan Anhu Rabbana).”",
      "chain": [
        "30160",
        "20031",
        "20415",
        "11422",
        "405"
      ]
    },
    {
      "hadith_no": "4129",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا إبراهيم بن سعيد الجوهري، حدثنا عبد الوهاب بن عطاء، عن ثور بن يزيد، عن مكحول، عن كريب، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم للعباس ‏\"‏ إذا كان غداة الاثنين فأتني أنت وولدك حتى أدعو لهم بدعوة ينفعك الله بها وولدك ‏\"‏ ‏.‏ فغدا وغدونا معه وألبسنا كساء ثم قال ‏\"‏ اللهم اغفر للعباس وولده مغفرة ظاهرة وباطنة لا تغادر ذنبا اللهم احفظه في ولده ‏\"‏ ‏.‏ قال هذا حديث حسن غريب لا نعرفه إلا من هذا الوجه ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     \"The Messenger of Allah (ﷺ) said to Al-'Abbas: 'On the night of Monday, come to me, you and your offspring, so that I may supplicate for them with a supplication that Allah will benefit you and your children by.' So he went, and we went with at night, so he (ﷺ) covered us in a Kisah (shawl), then said: 'O Allah, forgive Al-'Abbas and his offspring, for what is open and what is secret, with a forgiveness that does not leave any sins. O Allah! Take care of him concerning the affair of his offspring.'\"",
      "chain": [
        "30498",
        "20557",
        "20415",
        "11066",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "4331",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا بقية بن الوليد، قال حدثني ثور بن يزيد، عن صالح بن يحيى بن المقدام بن معديكرب، عن أبيه، عن جده، عن خالد بن الوليد، أنه سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا يحل أكل لحوم الخيل والبغال والحمير ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Khalid bin al-walid that he heard the Messe4nger of Allah say:                     \"It is not permissible to eat the flesh of horses, mules or donkeys.\"",
      "chain": [
        "30123",
        "20644",
        "20415",
        "22"
      ]
    },
    {
      "hadith_no": "4332",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hunting and Slaughtering - كتاب الصيد والذبائح",
      "chapter_no": "42",
      "text_ar": "أخبرنا كثير بن عبيد، قال حدثنا بقية، عن ثور بن يزيد، عن صالح بن يحيى بن المقدام بن معديكرب، عن أبيه، عن جده، عن خالد بن الوليد، أن رسول الله صلى الله عليه وسلم نهى عن أكل لحوم الخيل والبغال والحمير وكل ذي ناب من السباع ‏.‏",
      "text_en": " It was narrated from Khalid bin Al-Walid that:                     the Messenger of Allah forbade eating the flesh of horses, mules and donkeys, and any predator that has fangs.",
      "chain": [
        "38462",
        "20644",
        "20415",
        "22"
      ]
    },
    {
      "hadith_no": "4528",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Financial Transactions - كتاب البيوع",
      "chapter_no": "44",
      "text_ar": "أخبرنا هشام بن عمار، قال حدثنا يحيى بن حمزة، قال حدثنا ثور بن يزيد، أنه سمع ابن جريج، يحدث عن أبي الزبير المكي، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من باع ثمرا فأصابته جائحة فلا يأخذ من أخيه - وذكر شيئا - على ما يأكل أحدكم مال أخيه المسلم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir bin 'Abdullah that the Messenger of Allah said:                     \"Whoever sells fruit then his crop fails, he should not take (anything) from his brother.\" (And he said something along the lines of) \"Why would anyone of you consume the wealth of his Muslim brother?\"",
      "chain": [
        "30288",
        "20402",
        "20415",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "46",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا يحيى بن حكيم، حدثنا عبد الملك بن الصباح المسمعي، حدثنا ثور بن يزيد، عن خالد بن معدان، عن عبد الرحمن بن عمرو، عن العرباض بن سارية، قال صلى بنا رسول الله  صلى الله عليه وسلم  صلاة الصبح ثم أقبل علينا بوجهه فوعظنا موعظة بليغة ‏.‏ فذكر نحوه ‏.‏",
      "text_en": " It was narrated from 'Irbad bin Sariyah said:                     \"The Messenger of Allah (ﷺ) led us in Fajr (morning) prayer, then he turned to us and delivered an eloquent speech\". And he mentioned something similar (as no.43)",
      "chain": [
        "34280",
        "20415",
        "11422",
        "5172"
      ]
    },
    {
      "hadith_no": "361",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عبد الملك بن الصباح، حدثنا ثور بن يزيد، عن حصين الحميري، عن أبي سعيد الخير، عن أبي هريرة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ من استجمر فليوتر من فعل ذلك فقد أحسن ومن لا فلا حرج ومن تخلل فليلفظ ومن لاك فليبتلع من فعل ذلك فقد أحسن ومن لا فلا حرج ومن أتى الخلاء فليستتر فإن لم يجد إلا كثيبا من رمل فليمدده عليه فإن الشيطان يلعب بمقاعد ابن آدم من فعل فقد أحسن ومن لا فلا حرج ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     The Prophet said: \"Whoever uses stones to clean himself, let him use an odd number of stones. Whoever does that has done well, and whoever does not, there is no harm in it. Whoever uses a tooth stick should spit out (whatever he removes) and whoever removes (the particle of food) by dislodging it with his tongue should swallow it. Whoever does that has done well, and whoever does not, tere is no harm in it. Whoever goes to the toilet should conceal himself, and if he cannot find anything except a pile of sand (behind which to conceal himself), then he should use that, for the Shaitan plays with the backside of the son of Adam. Whoever does that has done well, and whoever does not, there is no harm in it.\"",
      "chain": [
        "30160",
        "20255",
        "20415",
        "13"
      ]
    },
    {
      "hadith_no": "593",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا هشام بن عمار، حدثنا الوليد بن مسلم، حدثنا ثور بن يزيد، عن رجاء بن حيوة، عن وراد، كاتب المغيرة بن شعبة عن المغيرة بن شعبة، أن رسول الله  صلى الله عليه وسلم  مسح أعلى الخف وأسفله ‏.‏",
      "text_en": " It was narrated from Mughirah bin Shu'bah that:                     The Messenger of Allah wiped over the top and the bottom of the leather socks.",
      "chain": [
        "30288",
        "20733",
        "20415",
        "10910",
        "166"
      ]
    },
    {
      "hadith_no": "1472",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا إسماعيل بن عبد الله الرقي، حدثنا عيسى بن يونس، حدثنا ثور بن يزيد، عن زياد بن أبي سودة، عن أخيه، عثمان بن أبي سودة عن ميمونة، مولاة النبي  صلى الله عليه وسلم  قالت قلت يا رسول الله أفتنا في بيت المقدس ‏.‏ قال ‏\"‏ أرض المحشر والمنشر ائتوه فصلوا فيه فإن صلاة فيه كألف صلاة في غيره ‏\"‏ ‏.‏ قلت أرأيت إن لم أستطع أن أتحمل إليه قال ‏\"‏ فتهدي له زيتا يسرج فيه فمن فعل ذلك فهو كمن أتاه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Maimunah the freed (female) slave of the Prophet(ﷺ)said:                      I said: “O Messenger of Allah, tell us about Baitil-Maqdis.”He said: “It is the land of the Resurrection and theGathering. Goand pray there, for one prayer there is like onethousand prayerselsewhere.” I said: “What if I cannot travel and gothere?” Hesaid: “Then send a gift of oil to light its lamps, forwhoever doesthat is like one who goes there.”",
      "chain": [
        "38111",
        "20347",
        "20415",
        "18312"
      ]
    },
    {
      "hadith_no": "1718",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا هشام بن عمار، حدثنا يحيى بن حمزة، حدثني ثور بن يزيد، عن خالد بن معدان، عن ربيعة بن الغاز، أنه سأل عائشة عن صيام، رسول الله  صلى الله عليه وسلم  فقالت كان يصوم شعبان كله حتى يصله برمضان ‏.‏",
      "text_en": " It wasnarrated that Rabi’ah bin Ghaz asked ‘Aishah about the fastingofthe Messenger of Allah (ﷺ). She said:                      “He used to fast all ofSha’ban, until he joined it to Ramadan.”",
      "chain": [
        "30288",
        "20402",
        "20415",
        "11422",
        "53"
      ]
    },
    {
      "hadith_no": "1797",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عيسى بن يونس، عن ثور بن يزيد، عن خالد بن معدان، عن عبد الله بن بسر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا تصوموا يوم السبت إلا فيما افترض عليكم فإن لم يجد أحدكم إلا عود عنب أو لحاء شجرة فليمصه ‏\"‏ ‏.‏  حدثنا حميد بن مسعدة، حدثنا سفيان بن حبيب، عن ثور بن يزيد، عن خالد بن معدان، عن عبد الله بن بسر، عن أخته، قالت قال رسول الله  صلى الله عليه وسلم  فذكر نحوه ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah bin Busr that the Messenger of Allah(ﷺ)said:                      “Do not fast on Saturdays apart from days when you areobliged to fast. If anyone of you cannot find anything other thangrape stalks or the bark of a tree, let him suck on it.”",
      "chain": [
        "30201",
        "20347",
        "20415",
        "11422",
        "3650"
      ]
    },
    {
      "hadith_no": "1811",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا هشام بن عمار، حدثنا يحيى بن حمزة، حدثني ثور بن يزيد، عن خالد بن معدان، عن ربيعة بن الغاز، أنه سأل عائشة عن صيام، رسول الله  صلى الله عليه وسلم  فقالت كان يتحرى صيام الاثنين والخميس ‏.‏",
      "text_en": " It wasnarrated from Rabi’ah bin Ghaz that he asked ‘Aishah about thefasting of the Messenger of Allah (ﷺ). She said:                      “He used to makesure he fasted on Mondays and Thursdays.”",
      "chain": [
        "30288",
        "20402",
        "20415",
        "11422",
        "53"
      ]
    },
    {
      "hadith_no": "1854",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو أحمد المرار بن حمويه، حدثنا محمد بن المصفى، حدثنا بقية بن الوليد، عن ثور بن يزيد، عن خالد بن معدان، عن أبي أمامة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ من قام ليلتى العيدين لله محتسبا لم يمت قلبه يوم تموت القلوب ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Umamah that the Prophet (ﷺ) said:                      “Whoeverspends the nights of the two ‘Eid in praying voluntary prayers,seeking reward from Allah, his heart will not die on the Day whenhearts will die.”",
      "chain": [
        "20644",
        "20415",
        "11422",
        "405"
      ]
    },
    {
      "hadith_no": "2242",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا سهل بن أبي سهل، حدثنا يحيى بن سعيد، عن ثور بن يزيد، حدثنا خالد بن معدان، حدثني عبد الرحمن بن سلم، عن عطية الكلاعي، عن أبى بن كعب، قال علمت رجلا القرآن فأهدى إلى قوسا فذكرت ذلك لرسول الله  صلى الله عليه وسلم  فقال ‏\"‏ إن أخذتها أخذت قوسا من نار ‏\"‏ ‏.‏ فرددتها ‏.‏",
      "text_en": " It was narrated that Ubayy bin Ka'b said:                     \"I taught a man the Qur'an, and he gave me a bow. I mentioned that to the Messenger of Allah (ﷺ) and he said: 'If you accept it you will be accepting a bow of fire.' So I returned it.\"",
      "chain": [
        "38259",
        "20031",
        "20415",
        "11422",
        "39"
      ]
    },
    {
      "hadith_no": "2304",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Business Transactions - كتاب التجارات",
      "chapter_no": "12",
      "text_ar": "حدثنا هشام بن عمار، حدثنا يحيى بن حمزة، حدثنا ثور بن يزيد، عن ابن جريج، عن أبي الزبير، عن جابر بن عبد الله، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ من باع ثمرا فأصابته جائحة فلا يأخذ من مال أخيه شيئا علام يأخذ أحدكم مال أخيه المسلم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir bin 'Abdullah that the Messenger of Allah (ﷺ) said:                     \"Whoever sells fruits then the crop fails, should not take any of his brother's money. Why would any of you take the money of his Muslim brother?\"",
      "chain": [
        "30288",
        "20402",
        "20415",
        "11070",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3319",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Slaughtering - كتاب الذبائح",
      "chapter_no": "27",
      "text_ar": "حدثنا محمد بن المصفى، حدثنا بقية، حدثني ثور بن يزيد، عن صالح بن يحيى بن المقدام بن معديكرب، عن أبيه، عن جده، عن خالد بن الوليد، قال نهى رسول الله  صلى الله عليه وسلم  عن لحوم الخيل والبغال والحمير ‏.‏",
      "text_en": " It wasnarrated that Khalid bin Walid said:                      “The Messenger of Allah(ﷺ)forbade the flesh of horses, mules and donkeys.”",
      "chain": [
        "20644",
        "20415",
        "22"
      ]
    },
    {
      "hadith_no": "3409",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا عبد الرحمن بن إبراهيم، حدثنا الوليد بن مسلم، حدثنا ثور بن يزيد، عن خالد بن معدان، عن أبي أمامة الباهلي، عن النبي  صلى الله عليه وسلم  أنه كان يقول إذا رفع طعامه أو ما بين يديه قال ‏\"‏ الحمد لله حمدا كثيرا طيبا مباركا غير مكفي ولا مودع ولا مستغنى عنه ربنا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Umamah Al-Bahili that when his food, orwhateverwas in front of him was cleared away, the Prophet (ﷺ) usedto say:                     “Al-hamdu lillahi hamdan kathiran tayyiban mubarakan ghairamakfiyyin wa la muwadda’in wa la mustaghnan ‘anhu, Rabbana(Praise isto Allah, abundant good and blessed praise, a never-endingpraise, apraise that we will never bid farewell to and anindispensible praise,He is our Lord).”",
      "chain": [
        "30285",
        "20733",
        "20415",
        "11422",
        "4048"
      ]
    },
    {
      "hadith_no": "3509",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا العباس بن الوليد الدمشقي، حدثنا عبد السلام بن عبد القدوس، حدثنا ثور بن يزيد، عن خالد بن معدان، عن أبي أمامة الباهلي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا تذهب الليالي والأيام حتى تشرب طائفة من أمتي الخمر يسمونها بغير اسمها ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Umamah Al-Bahili that the Messenger of Allah(ﷺ)said:                      “Night and day will not cease until a group among mynationdrinks wine, calling it by some other name.”",
      "chain": [
        "27529",
        "20415",
        "11422",
        "4048"
      ]
    },
    {
      "hadith_no": "3627",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا عبد الرحمن بن عمر، حدثنا عبد الملك بن الصباح، عن ثور بن يزيد، عن حصين الحميري، عن أبي سعد الخير، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ من اكتحل فليوتر من فعل فقد أحسن ومن لا فلا حرج ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Prophet (ﷺ) said:                     “Whoeverapplies kohl, let him do it an odd number of times. Whoeverdoes thathas done well, and whoever does not, it does not matter.”",
      "chain": [
        "20255",
        "20415",
        "13"
      ]
    }
  ],
  "total_hadiths": 33
}