{
  "id": "20411",
  "name": "Ishaq bin Yusuf bin Mrdas إسحاق بن يوسف بن مرداس",
  "full_name": "Ishaq bin Yusuf bin Mrdas إسحاق بن يوسف بن مرداس",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "195",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Wasit"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "B.Makhzum",
      "al-Wasti"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11071",
      "name": "'Abdullah bin 'Awn bin Artaban عبد الله بن عون بن أرطبان الخزار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20587",
      "name": "Sharayk bin 'Abdullah شريك بن عبد الله النخعي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20359",
      "name": "Mas'ar bin Kadam مسعر بن كدام",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11642",
      "name": "'Umar bin Dhar bin 'Abdullah al-Hamdani عمر بن ذر بن عبد الله بن زرارة",
      "grade": "Follower(Tabi') [6th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30285",
      "name": "'Abdur Rahman bin Ibrahim عبد الرحمن بن إبراهيم - دحيم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30263",
      "name": "'Amr bin Muhammad bin Bukayr عمرو بن محمد بن بكير الناقد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-1679",
      "hadith_no": "1679",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثني عبد الله بن محمد، حدثنا إسحاق الأزرق، حدثنا سفيان، عن عبد العزيز بن رفيع، قال سألت أنس بن مالك  رضى الله عنه  قلت أخبرني بشىء، عقلته عن النبي صلى الله عليه وسلم أين صلى الظهر والعصر يوم التروية قال بمنى‏.‏ قلت فأين صلى العصر يوم النفر قال بالأبطح‏.‏ ثم قال افعل كما يفعل أمراؤك‏.‏",
      "text_en": " Narrated `Abdul `Aziz bin Rufai:                     I asked Anas bin Malik, \"Tell me what you remember from Allah's Apostle (regarding these questions): Where did he offer the Zuhr and `Asr prayers on the day of Tarwiya (8th day of Dhul- Hijja)?\" He relied, \"(He offered these prayers) at Mina.\" I asked, \"Where did he offer the `Asr prayer on the day of Nafr (i.e. departure from Mina on the 12th or 13th of Dhul-Hijja)?\" He replied, \"At Al- Abtah,\" and then added, \"You should do as your chiefs do.\"",
      "usc_msa_ref": "",
      "chain": [
        "30351",
        "20411",
        "20012",
        "11257",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-1790",
      "hadith_no": "1790",
      "source": "Sahih Bukhari",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا إسحاق بن يوسف، حدثنا سفيان الثوري، عن عبد العزيز بن رفيع، قال سألت أنس بن مالك أخبرني بشىء، عقلته عن النبي صلى الله عليه وسلم أين صلى الظهر يوم التروية قال بمنى‏.‏ قلت فأين صلى العصر يوم النفر قال بالأبطح‏.‏ افعل كما يفعل أمراؤك‏.‏",
      "text_en": " Narrated `Abdul-Aziz bin Rufai:                     I asked Anas bin Malik, \"Tell me something you have observed about the Prophet concerning where he offered the Zuhr prayer on the Day of Tarwiya (8th Dhul-Hijja).\" Anas replied, \"He offered it at Mina.\" I said, \"Where did he offer the `Asr prayer on the Day of Nafr (day of departure from Mina)?\" He replied, \"At Al-Abtah,\" and added, \"You should do as your leaders do.\"",
      "usc_msa_ref": "816",
      "chain": [
        "30170",
        "20411",
        "20012",
        "11257",
        "19"
      ]
    },
    {
      "id": "sahih-bukhari-3321",
      "hadith_no": "3321",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا الحسن بن الصباح، حدثنا إسحاق الأزرق، حدثنا عوف، عن الحسن، وابن، سيرين عن أبي هريرة  رضى الله عنه  عن رسول الله صلى الله عليه وسلم قال ‏\"‏ غفر لامرأة مومسة مرت بكلب على رأس ركي يلهث، قال كاد يقتله العطش، فنزعت خفها، فأوثقته بخمارها، فنزعت له من الماء، فغفر لها بذلك ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"A prostitute was forgiven by Allah, because, passing by a panting dog near a well and seeing that the dog was about to die of thirst, she took off her shoe, and tying it with her head-cover she drew out some water for it. So, Allah forgave her because of that.\"",
      "usc_msa_ref": "538",
      "chain": [
        "30244",
        "20411",
        "11298",
        "11016",
        "11035",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-4211",
      "hadith_no": "4211",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا الحسن بن خلف، قال حدثنا إسحاق بن يوسف، عن أبي بشر، ورقاء، عن ابن أبي نجيح، عن مجاهد، قال حدثني عبد الرحمن بن أبي ليلى، عن كعب بن عجرة، أن رسول الله صلى الله عليه وسلم رآه وقمله يسقط على وجهه فقال ‏\"‏ أيؤذيك هوامك ‏\"‏‏.‏ قال نعم‏.‏ فأمره رسول الله صلى الله عليه وسلم أن يحلق وهو بالحديبية، لم يبين لهم أنهم يحلون بها، وهم على طمع أن يدخلوا مكة، فأنزل الله الفدية، فأمره رسول الله صلى الله عليه وسلم أن يطعم فرقا بين ستة مساكين، أو يهدي شاة، أو يصوم ثلاثة أيام‏.‏",
      "text_en": " Narrated Ka`b bin Ujra:                     That Allah's Apostle saw him with the lice falling (from his head) on his face. Allah's Apostle said, \"Are your lice troubling you? Ka`b said, \"Yes.\" Allah's Apostle thus ordered him to shave his head while he was at Al-Hudaibiya. Up to then there was no indication that all of them would finish their state of Ihram and they hoped that they would enter Mecca. Then the order of Al-Fidya was revealed, so Allah's Apostle ordered Ka`b to feed six poor persons with one Faraq of food or slaughter a sheep or fast for three days.",
      "usc_msa_ref": "478",
      "chain": [
        "30324",
        "20411",
        "11419",
        "11254",
        "11028",
        "11196",
        "4052"
      ]
    },
    {
      "id": "sahih-bukhari-6532",
      "hadith_no": "6532",
      "source": "Sahih Bukhari",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني إسحاق بن إبراهيم بن عبد الرحمن، حدثنا إسحاق  هو الأزرق  عن مسعر بن كدام، عن هلال، عن عروة، عن عائشة  رضى الله عنها  قالت ما أكل آل محمد صلى الله عليه وسلم أكلتين في يوم، إلا إحداهما تمر‏.‏",
      "text_en": " Narrated `Aisha:                     The family of Muhammad did not eat two meals on one day, but one of the two was of dates.",
      "usc_msa_ref": "462",
      "chain": [
        "30123",
        "20411",
        "20359",
        "11229",
        "10511",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-6897",
      "hadith_no": "6897",
      "source": "Sahih Bukhari",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثنا محمد بن المثنى، أخبرنا إسحاق بن يوسف، أخبرنا الفضيل بن غزوان، عن عكرمة، عن ابن عباس  رضى الله عنهما  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يزني العبد حين يزني وهو مؤمن، ولا يسرق حين يسرق وهو مؤمن، ولا يشرب حين يشرب وهو مؤمن، ولا يقتل وهو مؤمن ‏\"‏‏.‏ قال عكرمة قلت لابن عباس كيف ينزع الإيمان منه قال هكذا  وشبك بين أصابعه ثم أخرجها  فإن تاب عاد إليه هكذا وشبك بين أصابعه",
      "text_en": "      Narrated 'Ikrima from Ibn 'Abbas:                          Allah's Apostles said, \"When a slave (of Allah) commits illegal sexual     intercourse, he is not a believer at the time of committing it; and if     he steals, he is not a believer at the time of stealing; and if he      drinks an alcoholic drink, when he is not a believer at the time of      drinking it; and he is not a believer when he commits a murder,\"      'Ikrima said: I asked Ibn Abbas, \"How is faith taken away from him?\"      He said, Like this,\" by clasping his hands and then separating them,      and added, \"But if he repents, faith returns to him like this, by      clasping his hands again.",
      "usc_msa_ref": "800",
      "chain": [
        "30170",
        "20411",
        "20349",
        "11023",
        "17"
      ]
    },
    {
      "id": "sahih-muslim-192",
      "hadith_no": "192",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا ابن أبي عدي، ح وحدثني عمرو الناقد، حدثنا إسحاق بن يوسف الأزرق، كلاهما عن ابن عون، عن محمد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " Abu Huraira reported the same hadith which is transmitted to us by another chain of transmitters, e. g. Muhammad b. al-Muthanna, Ishaq b. Yusuf Azraq, Ibn 'Aun, etc.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20276",
        "30263",
        "20411",
        "11071",
        "11035",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-417",
      "hadith_no": "417",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، قالا حدثنا وكيع، ح وحدثنيه زهير بن حرب، حدثنا إسحاق بن يوسف الأزرق، جميعا عن فضيل بن غزوان، ح وحدثنا أبو كريب، محمد بن العلاء - واللفظ له - حدثنا ابن فضيل، عن أبيه، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ثلاث إذا خرجن لا ينفع نفسا إيمانها لم تكن آمنت من قبل أو كسبت في إيمانها خيرا طلوع الشمس من مغربها والدجال ودابة الأرض ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Huraira that the Messenger of Allah (may peace be upon him) observed:                      When three things appear faith will not benefit one who has not previously believed or has derived no good from his faith: the rising of the sun in its place of setting, the Dajjal, and the beast of the earth.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30022",
        "20032",
        "20411",
        "20349",
        "20356",
        "20349",
        "11172",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-1422",
      "hadith_no": "1422",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثني زهير بن حرب، وعبيد الله بن سعيد، كلاهما عن الأزرق، - قال زهير حدثنا إسحاق بن يوسف الأزرق، - حدثنا سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، عن النبي صلى الله عليه وسلم أن رجلا سأله عن وقت الصلاة فقال له ‏\"‏ صل معنا هذين ‏\"‏ ‏.‏ يعني اليومين فلما زالت الشمس أمر بلالا فأذن ثم أمره فأقام الظهر ثم أمره فأقام العصر والشمس مرتفعة بيضاء نقية ثم أمره فأقام المغرب حين غابت الشمس ثم أمره فأقام العشاء حين غاب الشفق ثم أمره فأقام الفجر حين طلع الفجر فلما أن كان اليوم الثاني أمره فأبرد بالظهر فأبرد بها فأنعم أن يبرد بها وصلى العصر والشمس مرتفعة أخرها فوق الذي كان وصلى المغرب قبل أن يغيب الشفق وصلى العشاء بعد ما ذهب ثلث الليل وصلى الفجر فأسفر بها ثم قال ‏\"‏ أين السائل عن وقت الصلاة ‏\"‏ ‏.‏ فقال الرجل أنا يا رسول الله ‏.‏ قال ‏\"‏ وقت صلاتكم بين ما رأيتم ‏\"‏ ‏.‏",
      "text_en": " Sulaiman b. Buraida narrated it on the authority of his father that a person asked the Apostle of Allah (may peace be upon him) about the time of prayer. Upon this he said:                      Pray with us these two, meaning two days. When the sun passed the meridian. he gave command to Bilal who uttered the call to prayer. then lie commanded him and pronounced Iqama for noon prayer (Then at the tine of the afternoon prayer) he again commanded and Iqama for the afternoon prayer was pronounced when the sun was high, white and clear. He then commanded and Iqama for the evening prayer was pronounced, when the sun had set. He then commanded him and the Iqama for the night prayer was pronounced When the twilight had disappeared. He then commanded him and the Iqama for the morning prayer was pronounced, when the dawn had appeared. When it was the next day, he commanded him to delay the noon prayer till the extreme heat had passed and he did so, and he allowed it to be delayed till the extreme heat had passed. He observed the afternoon prayer when the sun was high, delaying it beyond the time he had previously observed it. He observed the evening prayer before the twilight had vanished; he observed the night prayer when a third of the night had passed; and he observed the dawn prayer when there was clear daylight. He (the Holy Prophet) then said: Where is the man who inquired about the time of prayer? He (the inquirer) said: Messenger of Allah I here I am. He (the Holy Prophet) said: The time for your prayer is within the limits of what you have seen.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20321",
        "20411",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sahih-muslim-2757",
      "hadith_no": "2757",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثني ابن أبي خلف، حدثنا إسحاق بن يوسف، حدثنا عبد الملك بن أبي سليمان، عن عبد الله بن عطاء المكي، عن سليمان بن بريدة، عن أبيه، - رضى الله عنه - قال أتت امرأة إلى النبي صلى الله عليه وسلم ‏.‏ بمثل حديثهم وقال صوم شهر ‏.‏",
      "text_en": " Buraida (Allah be pleased with him) reported a similar hadith on the authority of his father that a woman came to the Apostle of Allah (may peace be upon him) and he said:                     \" Fasting for one month.\"",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "10945",
        "10785",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sahih-muslim-3226",
      "hadith_no": "3226",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني زهير بن حرب، حدثنا إسحاق بن يوسف الأزرق، أخبرنا سفيان، عن عبد العزيز بن رفيع، قال سألت أنس بن مالك قلت أخبرني عن شىء، عقلته عن رسول الله صلى الله عليه وسلم أين صلى الظهر يوم التروية قال بمنى ‏.‏ قلت فأين صلى العصر يوم النفر قال بالأبطح - ثم قال - افعل ما يفعل أمراؤك ‏.‏",
      "text_en": " Abd al-'Aziz b. Rufai' (Allah be pleased with him) said:                      I asked Anas b. Malik to tell me about something he knew about Allah's Messenger (may peace be upon him), viz. where he observed the noon prayer on Yaum al-Tarwiya. He said: At Mina. I said: Where did he observe the afternoon prayer on the Yaum an-Nafr? and he said: It was at al-Abtah. He then said: Do as your rulers do.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20411",
        "20012",
        "11257",
        "19"
      ]
    },
    {
      "id": "sahih-muslim-4402",
      "hadith_no": "4402",
      "source": "Sahih Muslim",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثناه أبو كريب، حدثنا وكيع، ح وحدثني زهير بن حرب، حدثنا إسحاق بن، يوسف الأزرق كلاهما عن فضيل بن غزوان، بهذا الإسناد ‏.‏ وفي حديثهما سمعت أبا، القاسم صلى الله عليه وسلم نبي التوبة ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn Ghazwan (and the words are):                     \" I heard Abu'l-Qasim (may peace be upon him) as the Prophet of repentance.\"",
      "usc_msa_ref": "",
      "chain": [
        "30216",
        "20032",
        "30022",
        "20411",
        "20349"
      ]
    },
    {
      "id": "sahih-muslim-7109",
      "hadith_no": "7109",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "وحدثنيه زهير بن حرب، حدثنا إسحاق بن يوسف الأزرق، حدثنا زكرياء، بهذا الإسناد ‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "20411"
      ]
    },
    {
      "id": "sunan-abi-daud-555",
      "hadith_no": "555",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا إسحاق بن يوسف، حدثنا سفيان، عن أبي سهل، - يعني عثمان بن حكيم - حدثنا عبد الرحمن بن أبي عمرة، عن عثمان بن عفان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من صلى العشاء في جماعة كان كقيام نصف ليلة ومن صلى العشاء والفجر في جماعة كان كقيام ليلة ‏\"‏ ‏.‏",
      "text_en": " ‘Uthman b. ‘Affan reported the Messenger of Allah (may peace be him) as saying; if anyone says the night prayer in congregation, he is like one who keeps vigil (in prayer) till midnight; and he who says both the night and dawn prayer in congregation is like one who keeps vigil (in prayer) the whole night.",
      "usc_msa_ref": "",
      "chain": [
        "30007",
        "20411",
        "20012",
        "1238",
        "4"
      ]
    },
    {
      "id": "sunan-abi-daud-969",
      "hadith_no": "969",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا تميم بن المنتصر، أخبرنا إسحاق، - يعني ابن يوسف - عن شريك، عن أبي إسحاق، عن أبي الأحوص، عن عبد الله، قال كنا لا ندري ما نقول إذا جلسنا في الصلاة وكان رسول الله صلى الله عليه وسلم قد علم فذكر نحوه ‏.‏  قال شريك وحدثنا جامع، - يعني ابن شداد - عن أبي وائل، عن عبد الله، بمثله قال وكان يعلمنا كلمات ولم يكن يعلمناهن كما يعلمنا التشهد ‏\"‏ اللهم ألف بين قلوبنا وأصلح ذات بيننا واهدنا سبل السلام ونجنا من الظلمات إلى النور وجنبنا الفواحش ما ظهر منها وما بطن وبارك لنا في أسماعنا وأبصارنا وقلوبنا وأزواجنا وذرياتنا وتب علينا إنك أنت التواب الرحيم واجعلنا شاكرين لنعمتك مثنين بها قابليها وأتمها علينا ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     We did not know what we should say when we sat during prayer. The Messenger of Allah (ﷺ) was taught (by Allah). He then narrated the tradition to the same effect. Sharik reported from Jami', from AbuWa'il on the authority of Abdullah ibn Mas'ud something similar.  He said: He used to teach us also some other words, but he did not teach them as he taught us the tashahhud: O Allah, join our hearts, mend our social relationship, guide us to the path of peace, bring us from darkness to light, save us from obscenities, outward or inward, and bless our ears, our eyes, our hearts, our wives, our children, and relent toward us; Thou art the Relenting, the Merciful. And make us grateful for Thy blessing and make us praise it while accepting it and give it to us in full.",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "20587",
        "11049",
        "20327",
        "18"
      ]
    },
    {
      "id": "sunan-abi-daud-996",
      "hadith_no": "996",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن كثير، أخبرنا سفيان، ح وحدثنا أحمد بن يونس، حدثنا زائدة، ح وحدثنا مسدد، حدثنا أبو الأحوص، ح وحدثنا محمد بن عبيد المحاربي، وزياد بن أيوب، قالا حدثنا عمر بن عبيد الطنافسي، ح وحدثنا تميم بن المنتصر، أخبرنا إسحاق، - يعني ابن يوسف - عن شريك، ح وحدثنا أحمد بن منيع، حدثنا حسين بن محمد، حدثنا إسرائيل، كلهم عن أبي إسحاق، عن أبي الأحوص، عن عبد الله، وقال، إسرائيل عن أبي الأحوص، والأسود، عن عبد الله، أن النبي صلى الله عليه وسلم كان يسلم عن يمينه وعن شماله حتى يرى بياض خده ‏\"‏ السلام عليكم ورحمة الله السلام عليكم ورحمة الله ‏\"‏ ‏.‏ قال أبو داود وهذا لفظ حديث سفيان وحديث إسرائيل لم يفسره ‏.‏ قال أبو داود ورواه زهير عن أبي إسحاق ويحيى بن آدم عن إسرائيل عن أبي إسحاق عن عبد الرحمن بن الأسود عن أبيه وعلقمة عن عبد الله ‏.‏ قال أبو داود شعبة كان ينكر هذا الحديث - حديث أبي إسحاق - أن يكون مرفوعا ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Prophet (ﷺ) used to give the salutation to his left and right sides until the whiteness of his cheek was seen, (saying: \"Peace be upon you, and mercy of Allah\" twice.  AbuDawud said: This is a version of the tradition reported by AbuSufyan. The version of Isra'il did not explain it. AbuDawud said: This tradition has been narrated by Zubayr from AbuIshaq and Yahya ibn Adam from Isra'il from AbuIshaq from AbdurRahman ibn al-Aswad from his father from Alqamah on the authority of Abdullah ibn Mas'ud. AbuDawud said: Shu'bah used to reject this tradition, the tradition narrated by AbuIshaq as coming from the Prophet (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "28531",
        "20012",
        "30184",
        "20320",
        "30175",
        "20327",
        "35135",
        "30249",
        "20346",
        "20411",
        "20587"
      ]
    },
    {
      "id": "sunan-abi-daud-1054",
      "hadith_no": "1054",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا محمد بن يزيد، وإسحاق بن يوسف، عن أيوب أبي العلاء، عن قتادة، عن قدامة بن وبرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من فاتته الجمعة من غير عذر فليتصدق بدرهم أو نصف درهم أو صاع حنطة أو نصف صاع ‏\"‏ ‏.‏ قال أبو داود رواه سعيد بن بشير عن قتادة هكذا إلا أنه قال ‏\"‏ مدا أو نصف مد ‏\"‏ ‏.‏ وقال عن سمرة ‏.‏ قال أبو داود سمعت أحمد بن حنبل يسأل عن اختلاف هذا الحديث فقال همام عندي أحفظ من أيوب يعني أبا العلاء ‏.‏",
      "text_en": " Narrated Qudamah ibn Wabirah:                     The Prophet (ﷺ) said: If anyone omits the Friday prayer without excuse, he must give one dirham or half a dirham, or one sa' or half a sa' of wheat, in alms.Abu Dawud said: Sa'id b. Bashir reported this tradition in a like manner, except that he narrated \"one mudd or half mudd\" (instead of sa'). He narrated it from Samurah.Abu Dawud said: I heard Ahmad bin Hanbal being asked about the differences over the narration of this Hadith. He said: \"Hammam has a stronger memory - in my opinion - than Ayyub.\"",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "34204",
        "20411",
        "11019"
      ]
    },
    {
      "id": "sunan-abi-daud-1245",
      "hadith_no": "1245",
      "source": "Sunan Abi Da'ud",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا تميم بن المنتصر، أخبرنا إسحاق، - يعني ابن يوسف - عن شريك، عن خصيف، بإسناده ومعناه ‏.‏ قال فكبر نبي الله صلى الله عليه وسلم وكبر الصفان جميعا ‏.‏ قال أبو داود رواه الثوري بهذا المعنى عن خصيف وصلى عبد الرحمن بن سمرة هكذا إلا أن الطائفة التي صلى بهم ركعة ثم سلم مضوا إلى مقام أصحابهم وجاء هؤلاء فصلوا لأنفسهم ركعة ثم رجعوا إلى مقام أولئك فصلوا لأنفسهم ركعة ‏.‏ قال أبو داود حدثنا بذلك مسلم بن إبراهيم حدثنا عبد الصمد بن حبيب قال أخبرني أبي أنهم غزوا مع عبد الرحمن بن سمرة كابل فصلى بنا صلاة الخوف ‏.‏",
      "text_en": " This tradition has been transmitted by Kushaif with a different chain of narrators and to the same effect. This version adds:                      The Prophet of Allah (ﷺ) uttered takbir and both rows uttered takbir together.Abu Dawud said: This tradition has been narrated by al-Thawri to the same effect on the authority of Khusaif. 'Abd al-Rahman b. Samurah also prayed in like manner. But the section which he (the Prophet) led in one rak'ah and then uttered the salutation and went and took the place of their companions. They came and prayed one rak'ah by themselves. Then they returned to their place and they prayed (one rak'ah) by themselves.Abu Dawud said: Muslim b. Ibrahim reported from 'Abd al-Samad b. Habib on the authority of his father that they had fought a battle at Kabul along with 'Abd al-Rahman b. Samurah. He led us in prayer in time of danger.",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "20587"
      ]
    },
    {
      "id": "sunan-abi-daud-1903",
      "hadith_no": "1903",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا تميم بن المنتصر، أخبرنا إسحاق بن يوسف، أخبرنا شريك، عن إسماعيل بن أبي خالد، قال سمعت عبد الله بن أبي أوفى، بهذا الحديث زاد ثم أتى الصفا والمروة فسعى بينهما سبعا ثم حلق رأسه ‏.‏",
      "text_en": " Isma’il bin Abi Khalid said I heard ‘Abd Allaah bin Abi Aufa narrated this tradition. His version added “He then came to Al Safa’ and Al Marwah and ran between them seven times and then shaved his head.",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "20587",
        "11418",
        "5115"
      ]
    },
    {
      "id": "sunan-abi-daud-1912",
      "hadith_no": "1912",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن إبراهيم، حدثنا إسحاق الأزرق، عن سفيان، عن عبد العزيز بن رفيع، قال سألت أنس بن مالك قلت أخبرني بشىء، عقلته عن رسول الله صلى الله عليه وسلم أين صلى رسول الله صلى الله عليه وسلم الظهر يوم التروية فقال بمنى ‏.‏ قلت فأين صلى العصر يوم النفر قال بالأبطح ثم قال افعل كما يفعل أمراؤك ‏.‏",
      "text_en": " ‘Abd Al ‘Aziz bin Rufai’ said I asked Anas bin Malik saying “Tell me something you knew about the Apostle of Allaah(ﷺ) viz where he offered the noon prayer on Yawm Al Tarwiyah(8th of Dhu Al Hijjah). He replied, In Mina I asked Where did he pray the afternoon prayer on Yaum Al Nafr(12th or 13th of Dhu Al Hijjah). He replied In al-Abtah he then said “Do as your commanders do.”",
      "usc_msa_ref": "",
      "chain": [
        "30494",
        "20411",
        "20012",
        "11257",
        "19"
      ]
    },
    {
      "id": "sunan-abi-daud-1930",
      "hadith_no": "1930",
      "source": "Sunan Abi Da'ud",
      "chapter": "The Rites of Hajj (Kitab Al-Manasik Wa'l-Hajj) - كتاب المناسك",
      "chapter_no": "11",
      "text_ar": "حدثنا محمد بن سليمان الأنباري، حدثنا إسحاق، - يعني ابن يوسف - عن شريك، عن أبي إسحاق، عن سعيد بن جبير، وعبد الله بن مالك، قالا صلينا مع ابن عمر بالمزدلفة المغرب والعشاء بإقامة واحدة فذكر معنى حديث ابن كثير ‏.‏",
      "text_en": " Sa’id bin Jubair and ‘Abd Allah bin Malik said “We offered the sunset and the night prayers at Al Muzdalifah along with ibn ‘Umar with one iqamah.” The narrator then narrated the rest of the tradition as reported by Ibn Kathir.",
      "usc_msa_ref": "",
      "chain": [
        "31160",
        "20411",
        "20587",
        "11049",
        "11050"
      ]
    },
    {
      "id": "sunan-abi-daud-2140",
      "hadith_no": "2140",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا عمرو بن عون، أخبرنا إسحاق بن يوسف، عن شريك، عن حصين، عن الشعبي، عن قيس بن سعد، قال أتيت الحيرة فرأيتهم يسجدون لمرزبان لهم فقلت رسول الله أحق أن يسجد له قال فأتيت النبي صلى الله عليه وسلم فقلت إني أتيت الحيرة فرأيتهم يسجدون لمرزبان لهم فأنت يا رسول الله أحق أن نسجد لك ‏.‏ قال ‏\"‏ أرأيت لو مررت بقبري أكنت تسجد له ‏\"‏ ‏.‏ قال قلت لا ‏.‏ قال ‏\"‏ فلا تفعلوا لو كنت آمرا أحدا أن يسجد لأحد لأمرت النساء أن يسجدن لأزواجهن لما جعل الله لهم عليهن من الحق ‏\"‏ ‏.‏",
      "text_en": " Narrated Qays ibn Sa'd:                     I went to al-Hirah and saw them (the people) prostrating themselves before a satrap of theirs, so I said: The Messenger of Allah (ﷺ) has most right to have prostration made before him. When I came to the Prophet (ﷺ), I said: I went to al-Hirah and saw them prostrating themselves before a satrap of theirs, but you have most right, Messenger of Allah, to have (people) prostrating themselves before you. He said: Tell me , if you were to pass my grave, would you prostrate yourself before it? I said: No. He then said: Do not do so. If I were to command anyone to make prostration before another I would command women to prostrate themselves before their husbands, because of the special right over them given to husbands by Allah.",
      "usc_msa_ref": "",
      "chain": [
        "30154",
        "20411",
        "20587",
        "15097",
        "11052",
        "172"
      ]
    },
    {
      "id": "sunan-abi-daud-5032",
      "hadith_no": "5032",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا تميم بن المنتصر، حدثنا إسحاق، - يعني ابن يوسف - عن أبي بشر، ورقاء، عن منصور، عن هلال بن يساف، عن خالد بن عرفجة، عن سالم بن عبيد الأشجعي، بهذا الحديث عن النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Salim ibn Ubayd al-Ashja'i:                     The tradition mentioned above (No. 5013) has also been mentioned by Salim ibn Ubayd al-Ashja'i to the same effect from the Prophet (ﷺ) through a different chain of narrators.",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "11419",
        "11067",
        "10835",
        "18241",
        "5045"
      ]
    },
    {
      "id": "sunan-abi-daud-5249",
      "hadith_no": "5249",
      "source": "Sunan Abi Da'ud",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عبد الحميد بن بيان السكري، عن إسحاق بن يوسف، عن شريك، عن أبي إسحاق، عن القاسم بن عبد الرحمن، عن أبيه، عن ابن مسعود، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اقتلوا الحيات كلهن فمن خاف ثأرهن فليس مني ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Mas'ud:                     The Prophet (ﷺ) said: Kill all the snakes, and he who fears their revenge does not belong to me.",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "20587",
        "11049",
        "19896",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-152",
      "hadith_no": "152",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن منيع، والحسن بن الصباح البزار، وأحمد بن محمد بن موسى المعنى، واحد، قالوا حدثنا إسحاق بن يوسف الأزرق، عن سفيان الثوري، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال أتى النبي صلى الله عليه وسلم رجل فسأله عن مواقيت الصلاة فقال ‏\"‏ أقم معنا إن شاء الله ‏\"‏ ‏.‏ فأمر بلالا فأقام حين طلع الفجر ثم أمره فأقام حين زالت الشمس فصلى الظهر ثم أمره فأقام فصلى العصر والشمس بيضاء مرتفعة ثم أمره بالمغرب حين وقع حاجب الشمس ثم أمره بالعشاء فأقام حين غاب الشفق ثم أمره من الغد فنور بالفجر ثم أمره بالظهر فأبرد وأنعم أن يبرد ثم أمره بالعصر فأقام والشمس آخر وقتها فوق ما كانت ثم أمره فأخر المغرب إلى قبيل أن يغيب الشفق ثم أمره بالعشاء فأقام حين ذهب ثلث الليل ثم قال ‏\"‏ أين السائل عن مواقيت الصلاة ‏\"‏ ‏.‏ فقال الرجل أنا ‏.‏ فقال ‏\"‏ مواقيت الصلاة كما بين هذين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب صحيح ‏.‏ قال وقد رواه شعبة عن علقمة بن مرثد أيضا ‏.‏",
      "text_en": " Sulaiman bin Buraidah narrated that his father said:                     \"A man came to the Prophet to ask him about the times for Salat. So he said: 'Stay with us, In sha Allah.' So he ordered Bilal to call the Iqamah when Fajr began, then he ordered him to call the Iqamah when the Sun passed the zenith, then he prayed Zuhr. Then he ordered him to call the Iqamah to pray Asr while the sun was elevated and white. Then he ordered him (to call the Iqamah for) Maghrib when the (top) edge of the sun had set. Then he ordered him to call the Iqamah for Isha when the horizon (twilight) had vanished. Then he ordered him in the morning (to give the call for Fajr prayer), when the light of Fajr glowed. Then he ordered (him to call the Iqamah for) Zuhr, so he waited well until it had cooled. Then he ordered (him to call the Iqamah for) Asr, so he calIed the Iqamah while the sun was later in its position than what it was (the day before). Then he ordered him to delay Maghrib until right before the twilight had disappeared. Then he ordered (him to call the Iqamah for) Isha, so he called the Iqamah when a third of the night had passed. Then he said: 'Where is the one who asked about he times for the Salat?' So the man said, 'It is I.' So he said: 'The times [or the Salat are what are between these two.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "30244",
        "30304",
        "20411",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "jami-al-tirmidhi-964",
      "hadith_no": "964",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Hajj - كتاب الحج عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "9",
      "text_ar": "حدثنا أحمد بن منيع، ومحمد بن الوزير الواسطي المعنى، واحد، قالا حدثنا إسحاق بن يوسف الأزرق، عن سفيان، عن عبد العزيز بن رفيع، قال قلت لأنس بن مالك حدثني بشيء، عقلته عن رسول الله صلى الله عليه وسلم أين صلى الظهر يوم التروية قال بمنى ‏.‏ قال قلت فأين صلى العصر يوم النفر قال بالأبطح ‏.‏ ثم قال افعل كما يفعل أمراؤك ‏.‏ قال أبو عيسى هذا حديث حسن صحيح يستغرب من حديث إسحاق بن يوسف الأزرق عن الثوري ‏.‏",
      "text_en": " Abdul-Aziz bin Rufai narrated:                     \"I said to Anas bin Malik: 'Narrated something to me that you understand about where the Messenger of Allah performed Zuhr on the Day of Tarwiyah.' He said: 'In Mina.'\" \"I said: 'So where did he pray Asr on the day of departure?' He said: 'In Al-Abtab.' Then he said: 'Do what your leaders do.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20411",
        "20012",
        "11257"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1061",
      "hadith_no": "1061",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا إسحاق بن يوسف، حدثنا العوام بن حوشب، عن أبي محمد، مولى عمر بن الخطاب عن أبي عبيدة بن عبد الله بن مسعود، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قدم ثلاثة لم يبلغوا الحلم كانوا له حصنا حصينا من النار ‏\"‏ ‏.‏ قال أبو ذر قدمت اثنين ‏.‏ قال ‏\"‏ واثنين ‏\"‏ ‏.‏ فقال أبى بن كعب سيد القراء قدمت واحدا قال ‏\"‏ وواحدا ولكن إنما ذاك عند الصدمة الأولى ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وأبو عبيدة لم يسمع من أبيه ‏.‏",
      "text_en": " Abdullah bin Mas'ud narrated that:                     The Messenger of Allah said: \"Whoever has three that precede him (in death) while they did not reach the age of puberty, then they will be a well-fortified fortress for him against the Fire.\"",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20411",
        "11441",
        "15681",
        "16"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1086",
      "hadith_no": "1086",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Marriage - كتاب النكاح عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "11",
      "text_ar": "حدثنا أحمد بن محمد بن موسى، أخبرنا إسحاق بن يوسف الأزرق، أخبرنا عبد الملك بن أبي سليمان، عن عطاء، عن جابر، أن النبي صلى الله عليه وسلم قال ‏\"‏ إن المرأة تنكح على دينها ومالها وجمالها فعليك بذات الدين تربت يداك ‏\"‏ ‏.‏ قال وفي الباب عن عوف بن مالك وعائشة وعبد الله بن عمرو وأبي سعيد ‏.‏ قال أبو عيسى حديث جابر حديث حسن صحيح ‏.‏",
      "text_en": " Jabir narrated that:                     The Prophet said: \"Indeed the woman is married for her religion, her wealth, and her beauty, so take the one with religion, and may your hands be dusty.\"",
      "usc_msa_ref": "",
      "chain": [
        "30304",
        "20411",
        "10945",
        "11029",
        "34"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1361",
      "hadith_no": "1361",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Chapters On Judgements From The Messenger of Allah - كتاب الأحكام عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن وزير الواسطي، حدثنا إسحاق بن يوسف الأزرق، عن سفيان، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، قال عرضت على رسول الله صلى الله عليه وسلم في جيش وأنا ابن أربع عشرة فلم يقبلني فعرضت عليه من قابل في جيش وأنا ابن خمس عشرة فقبلني ‏.‏ قال نافع وحدثت بهذا الحديث عمر بن عبد العزيز فقال هذا حد ما بين الصغير والكبير ‏.‏ ثم كتب أن يفرض لمن يبلغ الخمس عشرة ‏.‏  حدثنا ابن أبي عمر، حدثنا سفيان بن عيينة، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم نحو هذا ولم يذكر فيه أن عمر بن عبد العزيز كتب أن هذا حد ما بين الصغير والكبير ‏.‏ وذكر ابن عيينة في حديثه ‏.‏ قال نافع فحدثنا به عمر بن عبد العزيز فقال هذا حد ما بين الذرية والمقاتلة ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ والعمل على هذا عند أهل العلم وبه يقول سفيان الثوري وابن المبارك والشافعي وأحمد وإسحاق يرون أن الغلام إذا استكمل خمس عشرة سنة فحكمه حكم الرجال وإن احتلم قبل خمس عشرة فحكمه حكم الرجال ‏.‏ وقال أحمد وإسحاق البلوغ ثلاثة منازل بلوغ خمس عشرة أو الاحتلام فإن لم يعرف سنه ولا احتلامه فالإنبات يعني العانة ‏.‏",
      "text_en": " Narrated Nafi':                     that Ibn 'Umar said: \"I was reviewed before the Messenger of Allah (ﷺ) in the army, and I was fourteen years old, but he did not accept me. Then I was reviewed before him in the army later while I was fifteen years old, and he accepted me.\" Nafi' said: \"I narrated this Hadith to 'Uman bin 'Abdul Azeez and he said: 'This is the limit that distinguishes between childhood and adulthood.' Then he wrote to give salaries to whoever reached fifteen years old.\" (Another chain) from Nafi', from Ibn 'Umar from the Prophet (ﷺ) and it is similar, but he did not mention in it that 'Umar bin 'Abdul-'Aziz wrote that this is the limit that distinguishes between youth and childhood and adulthood. In his narration, Ibn 'Uyainah said (that Nafi' said): \"I narrated it to 'Umar bin 'Abdul-'Aziz and he said: 'This is the limit that distinguishes between children and soldiers.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "20012",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1431",
      "hadith_no": "1431",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Legal Punishments (Al-Hudud) - كتاب الحدود عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "17",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا إسحاق بن يوسف الأزرق، عن داود بن أبي هند، عن سعيد بن المسيب، عن عمر بن الخطاب، قال رجم رسول الله صلى الله عليه وسلم ورجم أبو بكر ورجمت ولولا أني أكره أن أزيد في كتاب الله لكتبته في المصحف فإني قد خشيت أن تجيء أقوام فلا يجدونه في كتاب الله فيكفرون به ‏.‏ قال وفي الباب عن علي ‏.‏ قال أبو عيسى حديث عمر حديث حسن صحيح وروي من غير وجه عن عمر ‏.‏",
      "text_en": " 'Umar bin Al-Khattab said:                      \"The Messenger of Allah (ﷺ) stoned, Abu Bakr stoned, and I stoned. If I didn't dislike that I add to the Book of Allah. I would have written it in the Mushaf, for I fear that there will come a people and they will not find it in the Book of Allah, so they will disbelieve in it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20411",
        "11585",
        "11002",
        "3"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1527",
      "hadith_no": "1527",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Vows and Oaths - كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا إسحاق بن يوسف الأزرق، عن هشام الدستوائي، عن يحيى بن أبي كثير، عن أبي قلابة، عن ثابت بن الضحاك، عن النبي صلى الله عليه وسلم قال ‏\"‏ ليس على العبد نذر فيما لا يملك ‏\"‏ ‏.‏ قال وفي الباب عن عبد الله بن عمرو وعمران بن حصين ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Thabit bin Adh-Dahhak:                     That the Prophet (ﷺ) said: \"It is not for a person to vow about that over which he has no control.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20411",
        "20295",
        "11449",
        "11047",
        "1902"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1543",
      "hadith_no": "1543",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Vows and Oaths - كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "20",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا إسحاق بن يوسف الأزرق، عن هشام الدستوائي، عن يحيى بن أبي كثير، عن أبي قلابة، عن ثابت بن الضحاك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف بملة غير الإسلام كاذبا فهو كما قال ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وقد اختلف أهل العلم في هذا إذا حلف الرجل بملة سوى الإسلام فقال هو يهودي أو نصراني إن فعل كذا وكذا ففعل ذلك الشىء فقال بعضهم قد أتى عظيما ولا كفارة عليه وهو قول أهل المدينة وبه يقول مالك بن أنس وإلى هذا القول ذهب أبو عبيد ‏.‏ وقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم والتابعين وغيرهم عليه في ذلك الكفارة وهو قول سفيان وأحمد وإسحاق ‏.‏",
      "text_en": " Narrated Thabit bin Adh-Dahhak:                     That the Messenger of Allah (ﷺ) said: \"Whoever swears by a religion other than Islam while lying, then he is as he said.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20411",
        "20295",
        "11449",
        "11047",
        "1902"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1699",
      "hadith_no": "1699",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن وزير الواسطي، حدثنا إسحاق بن يوسف الأزرق، عن سفيان، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، أن رسول الله صلى الله عليه وسلم أجرى المضمر من الخيل من الحفياء إلى ثنية الوداع وبينهما ستة أميال وما لم يضمر من الخيل من ثنية الوداع إلى مسجد بني زريق وبينهما ميل وكنت فيمن أجرى فوثب بي فرسي جدارا ‏.‏ قال أبو عيسى وفي الباب عن أبي هريرة وجابر وعائشة وأنس ‏.‏ وهذا حديث صحيح حسن غريب من حديث الثوري ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     \"The Messenger of Allah (ﷺ) arranged for the Mudammar among horses to race from Al-Hafiya' to Thaniyyah Al-Wada', between which was a distance of six miles. And for whatever horse was not among the Mudammar, they raced from Thaniya Al-Wada' to the Masjid of Banu Zuraiq, between which was a distance of a mile. I was among those who raced, and my horse jumped along with me over a wall.\"[Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah, Jabir, Anas, and 'Aishah. This Hadith is Hasan Sahih Gharib as a narration of Ath-Thawri.",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "20012",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1711",
      "hadith_no": "1711",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jihad - كتاب الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "23",
      "text_ar": "حدثنا محمد بن الوزير الواسطي، حدثنا إسحاق بن يوسف الأزرق، عن سفيان، عن عبيد الله بن عمر، عن نافع، عن ابن عمر، قال عرضت على رسول الله صلى الله عليه وسلم في جيش وأنا ابن أربع عشرة فلم يقبلني ثم عرضت عليه من قابل في جيش وأنا ابن خمس عشرة فقبلني ‏.‏ قال نافع فحدثت بهذا الحديث عمر بن عبد العزيز فقال هذا حد ما بين الصغير والكبير ‏.‏ ثم كتب أن يفرض لمن بلغ الخمس عشرة ‏.‏",
      "text_en": " Narrated Nafi:                     That Ibn 'Umar said: \"I was reviewed before army, and I was fourteen years old, but he did not accept me. Then I was reviewed before him later in army while I was fifteen years old, and he accepted me.\"Nafi said: \"I narrated this Hadith to 'Umar bin 'Abdul-'Aziz and he said: 'This is the limit that distinguishes between youth and manhood.' The he wrote to give salaries to whoever reached fifteen years of age.",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "20012",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2131-2",
      "hadith_no": "2131",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters On Wala' And Gifts - كتاب الولاء والهبة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "31",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا إسحاق بن يوسف الأزرق، حدثنا حسين المكتب، عن عمرو بن شعيب، عن طاوس، عن ابن عمر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ مثل الذي يعطي العطية ثم يرجع فيها كالكلب أكل حتى إذا شبع قاء ثم عاد فرجع في قيئه ‏\"‏ ‏.‏ قال أبو عيسى وفي الباب عن ابن عباس وعبد الله بن عمرو ‏.‏",
      "text_en": " Ibn 'Umar narrated that the Messenger of Allah (S.A.W)said:                     \"The parable of the one who gives a gift, and then takes it back, is that of a dog who eats until he is full, and vomits, then he returns to [take back] his vomit.\"[Abu 'Eisa said:] There are narrations on this topic from Ibn 'Abbas and 'Abdullah bin 'Amr.",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20411",
        "19934",
        "11053",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2636-2",
      "hadith_no": "2636",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Faith - كتاب الإيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "40",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا إسحاق بن يوسف الأزرق، عن هشام الدستوائي، عن يحيى بن أبي كثير، عن أبي قلابة، عن ثابت بن الضحاك، عن النبي صلى الله عليه وسلم قال ‏\"‏ ليس على العبد نذر فيما لا يملك ولاعن المؤمن كقاتله ومن قذف مؤمنا بكفر فهو كقاتله ومن قتل نفسه بشيء عذبه الله بما قتل به نفسه يوم القيامة ‏\"‏ ‏.‏ وفي الباب عن أبي ذر وابن عمر ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Narrated Ad-Dhahak:                     that the Prophet (ﷺ) said: \"It is not for a slave (of Allah) to vow about something he does not possess, and cursing a believer is like killing him, and whoever accuses a believer of disbelief, then it is like he has killed him, and whoever kills himself with something, then Allah will punish him with whatever he killed himself with on the Day of Judgement.\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20411",
        "20295",
        "11449",
        "11047",
        "1902"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3049",
      "hadith_no": "3049",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Manners - كتاب الأدب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "43",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا إسحاق بن يوسف الأزرق، حدثنا عبد الملك بن أبي سليمان، حدثني مولى، أسماء عن ابن عمر، قال سمعت عمر، يذكر أن النبي صلى الله عليه وسلم قال ‏\"‏ من لبس الحرير في الدنيا لم يلبسه في الآخرة ‏\"‏ ‏.‏ وفي الباب عن علي وحذيفة وأنس وغير واحد وقد ذكرناه في كتاب اللباس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح قد روي من غير وجه عن عمر ‏.‏ ومولى أسماء بنت أبي بكر الصديق اسمه عبد الله ويكنى أبا عمر وقد روى عنه عطاء بن أبي رباح وعمرو بن دينار ‏.‏",
      "text_en": " Narrated The freed slave of Asma:                     from Ibn 'Umar who said: \"I heard 'Umar mentioning that the Prophet (ﷺ) said: 'Whoever wears silk in the world he shall not wear it in the Hereafter.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20411",
        "10945",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3347",
      "hadith_no": "3347",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا إسحاق بن يوسف الأزرق، حدثنا داود بن أبي هند، عن الشعبي، عن مسروق، قال كنت متكئا عند عائشة فقالت يا أبا عائشة ثلاث من تكلم بواحدة منهن فقد أعظم على الله الفرية من زعم أن محمدا رأى ربه فقد أعظم الفرية على الله والله يقول ‏:‏ ‏(‏ لا تدركه الأبصار وهو يدرك الأبصار وهو اللطيف الخبير ‏)‏ ، ‏(‏ ما كان لبشر أن يكلمه الله إلا وحيا أو من وراء حجاب ‏)‏ وكنت متكئا فجلست فقلت يا أم المؤمنين أنظريني ولا تعجليني أليس يقول الله ‏:‏ ‏(‏ ولقد رآه نزلة أخرى ‏)‏، ‏(‏ ولقد رآه بالأفق المبين ‏)‏ قالت أنا والله أول من سأل عن هذا رسول الله صلى الله عليه وسلم قال ‏\"‏ إنما ذاك جبريل ما رأيته في الصورة التي خلق فيها غير هاتين المرتين رأيته منهبطا من السماء سادا عظم خلقه ما بين السماء والأرض ‏\"‏ ‏.‏ ومن زعم أن محمدا كتم شيئا مما أنزل الله عليه فقد أعظم الفرية على الله يقول الله ‏:‏ ‏(‏ يا أيها الرسول بلغ ما أنزل إليك من ربك ‏)‏ ومن زعم أنه يعلم ما في غد فقد أعظم الفرية على الله والله يقول ‏:‏ ‏(‏قل لا يعلم من في السموات والأرض الغيب إلا الله ‏)‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ومسروق بن الأجدع يكنى أبا عائشة وهو مسروق بن عبد الرحمن وهكذا كان اسمه في الديوان ‏.‏",
      "text_en": " Narrated Masruq:                     \"I was reclining in the presence of 'Aishah when she said: 'O Abu 'Aishah! There are three things, whoever speaks of one of them, then he has uttered one of the worst lies against Allah. Whoever claims that Muhammad saw his Lord. Then he has uttered one the worst lies against Allah, Allah says: No vision can grasp Him, but His grasp is over all vision, and He is the Most Subtle, Well-Acquainted with all things (6:103). It is not for any human being that Allah should speak to him unless (it be) by revelation or from behind a veil (42:91).' I was reclining so I sat up an said: 'O Mother of the Believers! Take your time with me and do not be hasty with me! Did Allah Most High not say: And indeed he saw him at a second descent (53:13). (And) 'And indeed he saw him in the clear horizon (81:23).' She said 'By Allah! I was the first who asked the Messenger of Allah (ﷺ) about this. He said: \"That was only Jibril. I did not see him in the appearance he was created in except for these two times. I saw him descending from the heavens, and due to his tremendous size he filled what was between the heavens and the earth.\" \"And whoever claimed that Muhammad hid anything that Allah revealed to him, then he uttered one of the worst lies against Allah. Allah says: O Messenger! Proclaim what has been sent down to you from your Lord (5:67).\" \"And whoever claimed that he (ﷺ) knew what would be tomorrow, then he has uttered one of the worst lies against Allah. Allah says: Say: 'None in the heavens and in the earth knows the unseen but Allah (27:65).'\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20411",
        "11585",
        "11052",
        "11018"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3533",
      "hadith_no": "3533",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن وزير الواسطي، حدثنا إسحاق بن يوسف الأزرق، عن سفيان الثوري، عن أبي سفيان، عن أبي نضرة، عن أبي سعيد الخدري، قال كانت بنو سلمة في ناحية المدينة فأرادوا النقلة إلى قرب المسجد فنزلت هذه الآية ‏:‏ ‏(‏إنا نحن نحيي الموتى ونكتب ما قدموا وآثارهم ‏)‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن آثاركم تكتب ‏\"‏ ‏.‏ فلم ينتقلوا ‏.‏ قال هذا حديث حسن غريب من حديث الثوري وأبو سفيان هو طريف السعدي ‏.‏",
      "text_en": " Narrated Abu Sa'eed Al-Khudri:                     \"Banu Salamah's dwellings were on the outskirts of Al-Madinah, so they wanted to relocate closer to the Masjid. Then this Ayah was revealed: 'Verily, We give life to the dead, and We record that which they send before (them), and their traces... (36:12)' So the Messenger of Allah (ﷺ) said: 'Your steps are recorded, so do not relocate.'\"",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "20012",
        "11249",
        "10721",
        "38"
      ]
    },
    {
      "id": "sunan-an-nasai-489",
      "hadith_no": "489",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Salah - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا إسحاق بن يوسف الأزرق، عن زكريا بن أبي زائدة، عن أبي إسحاق، عن البراء بن عازب، قال قدم رسول الله صلى الله عليه وسلم المدينة فصلى نحو بيت المقدس ستة عشر شهرا ثم إنه وجه إلى الكعبة فمر رجل قد كان صلى مع النبي صلى الله عليه وسلم على قوم من الأنصار فقال أشهد أن رسول الله صلى الله عليه وسلم قد وجه إلى الكعبة ‏.‏ فانحرفوا إلى الكعبة ‏.‏",
      "text_en": " It was narrated that Al-Bara bin 'Azib said:                      \"The Messenger of Allah (ﷺ) came to Al-Madinah and prayed toward Bait Al-Maqdis for sixteen months, then he was commanded to face towards the Ka'bah. A man who had prayed with the Prophet (ﷺ) passed by some of the Ansar and said: 'I bear witness that the Messenger of Allah (ﷺ) has been commanded to face towards the Ka'bah' so they turned to face the Ka'bah.\"",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "20411",
        "11338",
        "11049",
        "400"
      ]
    },
    {
      "id": "sunan-an-nasai-742",
      "hadith_no": "742",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of the Qiblah - كتاب القبلة",
      "chapter_no": "9",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، قال حدثنا إسحاق بن يوسف الأزرق، عن زكريا بن أبي زائدة، عن أبي إسحاق، عن البراء بن عازب، قال قدم رسول الله صلى الله عليه وسلم المدينة فصلى نحو بيت المقدس ستة عشر شهرا ثم وجه إلى الكعبة فمر رجل قد كان صلى مع النبي صلى الله عليه وسلم على قوم من الأنصار فقال أشهد أن رسول الله صلى الله عليه وسلم قد وجه إلى الكعبة ‏.‏ فانحرفوا إلى الكعبة ‏.‏",
      "text_en": " Narrated Al Bara bin Azib:                     Al Bara bin Azib said: The messenger of Allah (peace be upon him) came to Al-Madinah and prayed toward Bait-al-Maqdis for sixteen months, then he was commanded to pray toward the Ka'bah. A man who had prayed with the prophet (peace be upon him)passed by some of the Ansar and said: \"I bear witness that the messenger of Allah (peace be upon him) has been commanded to face toward the Ka'bah. So they turned to face the Ka'bah\".",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "20411",
        "11338",
        "11049",
        "400"
      ]
    },
    {
      "id": "sunan-an-nasai-1876",
      "hadith_no": "1876",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم ابن علية، وعبد الرحمن بن محمد، قالا حدثنا إسحاق، - وهو الأزرق - عن عوف، عن محمد، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ ما من مسلمين يموت بينهما ثلاثة أولاد لم يبلغوا الحنث إلا أدخلهما الله بفضل رحمته إياهم الجنة ‏\"‏ ‏.‏ قال ‏\"‏ يقال لهم ادخلوا الجنة فيقولون حتى يدخل آباؤنا فيقال ادخلوا الجنة أنتم وآباؤكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet said:                     \"There are no two Muslims, three of whose children die before reaching puberty, but Allah will admit them to Paradise by virtue of His mercy toward them. It will be said to them: 'Enter Paradise.' They will say: 'Not until our parents enter.' So it will be said: 'Enter Paradise, you and your parents.\"'",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "20411",
        "11298",
        "11035",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2010",
      "hadith_no": "2010",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا إسحاق بن يوسف، قال حدثنا سفيان، عن أيوب، عن حميد بن هلال، عن هشام بن عامر، قال ‏:‏ شكونا إلى رسول الله صلى الله عليه وسلم يوم أحد فقلنا ‏:‏ يا رسول الله الحفر علينا لكل إنسان شديد فقال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ احفروا وأعمقوا وأحسنوا، وادفنوا الاثنين والثلاثة في قبر واحد ‏\"‏ ‏.‏ قالوا ‏:‏ فمن نقدم يا رسول الله قال ‏:‏ ‏\"‏ قدموا أكثرهم قرآنا ‏\"‏ ‏.‏ قال ‏:‏ فكان أبي ثالث ثلاثة في قبر واحد ‏.‏",
      "text_en": " It was narrated that Hisham bin 'Amir said:                     \"We complained to the Messenger of Allah on the day of Uhud, saying: 'O Messneger of Allah, it is too difficult for us to dig a grave for each person.' The Messenger of Allah said: 'Dig graves and make them good and deep, and bury two or three in one grave.' They said: 'Who should we put in first, O Messenger of Allah?' He said: 'Put in first the one who knew more Qur'an.\"' He said: \"My father was the third of three in one grave.\"",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20411",
        "20012",
        "11015",
        "11281",
        "1331"
      ]
    },
    {
      "id": "sunan-an-nasai-2693",
      "hadith_no": "2693",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا أحمد بن نصر، قال أنبأنا عبد الله بن الوليد، - يعني العدني - عن سفيان، ح وأنبأنا محمد بن عبد الله بن المبارك، قال أنبأنا إسحاق، - يعني الأزرق - قال أنبأنا سفيان، عن الحسن بن عبيد الله، عن إبراهيم، عن الأسود، عن عائشة، قالت كأني أنظر إلى وبيص الطيب في رأس رسول الله صلى الله عليه وسلم وهو محرم وقال أحمد بن نصر في حديثه وبيص طيب المسك في مفرق رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " It was narrated that Aishah said:                     \"It is as if I can see the glistening of the perfume on the head of the Messenger of Allah when he is in Ihram.\" Ahmad bin Nasr (one of the narrators) said in his narration: \"The glistening of the perfume of musk in the parting (of the hair) of the Messenger of Allah\"",
      "usc_msa_ref": "",
      "chain": [
        "33014",
        "20012",
        "20411",
        "20012",
        "10755",
        "11051",
        "11054",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-2759",
      "hadith_no": "2759",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا عمران بن يزيد، قال أنبأنا شعيب، قال أنبأنا ابن جريج، قال أخبرني صالح بن كيسان، ح وأخبرني محمد بن إسماعيل بن إبراهيم، قال حدثنا إسحاق يعني ابن يوسف، عن ابن جريج، عن صالح بن كيسان، عن نافع، عن ابن عمر، أنه كان يخبر أن النبي صلى الله عليه وسلم أهل حين استوت به راحلته ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar:                     That he used to narrate that the Prophet began the Talbiyah when his mount stood up with him.",
      "usc_msa_ref": "",
      "chain": [
        "20428",
        "11070",
        "11176",
        "34188",
        "20411",
        "11070",
        "11176",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-2997",
      "hadith_no": "2997",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرنا محمد بن إسماعيل بن إبراهيم، وعبد الرحمن بن محمد بن سلام، قالا حدثنا إسحاق الأزرق، عن سفيان الثوري، عن عبد العزيز بن رفيع، قال سألت أنس بن مالك فقلت أخبرني بشىء، عقلته عن رسول الله صلى الله عليه وسلم أين صلى الظهر يوم التروية قال بمنى ‏.‏ فقلت أين صلى العصر يوم النفر قال بالأبطح ‏.‏",
      "text_en": " It was narrated that Abdul-Aziz bin Rafi said:                     \"I asked anas bin Malik: 'Tell me of something that you learned from the Messenger of Allah; where did he pray Zuhr on the day of At-Tarwiyah?' He said: 'In Mina.' I said: 'Where did he pray Asr on the day of An-Nafr?' He said: 'In Al-Abtah.'\"",
      "usc_msa_ref": "",
      "chain": [
        "34188",
        "36587",
        "20411",
        "20012",
        "11257",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-3085",
      "hadith_no": "3085",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عبد الرحمن بن محمد بن سلام، قال حدثنا إسحاق الأزرق، قال حدثنا سفيان، عن الأعمش، عن مسلم، عن سعيد بن جبير، عن ابن عباس، قال لما أخرج النبي صلى الله عليه وسلم من مكة قال أبو بكر أخرجوا نبيهم إنا لله وإنا إليه راجعون ليهلكن ‏.‏ فنزلت ‏{‏ أذن للذين يقاتلون بأنهم ظلموا وإن الله على نصرهم لقدير ‏}‏ فعرفت أنه سيكون قتال ‏.‏ قال ابن عباس فهي أول آية نزلت في القتال ‏.‏",
      "text_en": " Narrated It was narrated that Ibn Abbas said:                     “When the Prophet was expelled from Makkah, Abu Bakr said to him: ‘They have driven out their Prophet, verily to Allah we belong and to Him we return. They are surely doomed.’ Then it was revealed: ‘Permission to fight (against disbelievers) is given to those (believers) who are fought against, because they have been wronged; and surely, Allah is able to give them (believers) victory.’ Then I knew that there would be fighting.” Ibn Abbas said: “This is the first Verse that was revealed concerning fighting.”",
      "usc_msa_ref": "",
      "chain": [
        "36587",
        "20411",
        "20012",
        "11060",
        "11392",
        "11050",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-3338",
      "hadith_no": "3338",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمد بن إبراهيم، وعبد الرحمن بن محمد بن سلام، قالا حدثنا إسحاق الأزرق، عن عبيد الله، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال نهى رسول الله صلى الله عليه وسلم عن الشغار ‏.‏ قال عبيد الله والشغار كان الرجل يزوج ابنته على أن يزوجه أخته ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah forbade Ash-Shighar.\" (One of the narrators) 'Ubaidullah said: \"Ash-Shighar means when a man gives his daughter in marriage on condition that (the other man) gives him his sister in marriage.\"",
      "usc_msa_ref": "",
      "chain": [
        "11213",
        "36587",
        "20411",
        "11201",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-3637",
      "hadith_no": "3637",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Wills - كتاب الوصايا",
      "chapter_no": "30",
      "text_ar": "أخبرنا عبد الرحمن بن محمد بن سلام، قال حدثنا إسحاق، - وهو الأزرق - قال حدثنا زكريا، عن الشعبي، عن جابر، أن أباه، توفي وعليه دين فأتيت النبي صلى الله عليه وسلم فقلت يا رسول الله إن أبي توفي وعليه دين ولم يترك إلا ما يخرج نخله ولا يبلغ ما يخرج نخله ما عليه من الدين دون سنين فانطلق معي يا رسول الله لكى لا يفحش على الغرام فأتى رسول الله صلى الله عليه وسلم يدور بيدرا بيدرا فسلم حوله ودعا له ثم جلس عليه ودعا الغرام فأوفاهم وبقي مثل ما أخذوا‏.‏",
      "text_en": " It was narrated from Jabir that his father died owing debts. \"I came to the Prophet and said:                      '(O Messenger of Allah!) My father has died owing debts, and he has not left anything but what his date-palms produce. What his date-palms produce will not pay off his debts for years. Come with me, O Messenger of Allah, so that the creditors will not be harsh with me.' The Messenger of Allah went to each heap, saying Salams and supplicating for it, then sitting on it. He called the creditors and paid them off, and what was left was as much as what they had taken.\"",
      "usc_msa_ref": "",
      "chain": [
        "36587",
        "20411",
        "11338",
        "11052",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-3703",
      "hadith_no": "3703",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Gifts - كتاب الهبة",
      "chapter_no": "32",
      "text_ar": "أخبرنا عبد الرحمن بن محمد بن سلام، قال حدثنا إسحاق الأزرق، قال حدثنا به، حسين المعلم عن عمرو بن شعيب، عن طاوس، عن ابن عمر، وابن، عباس قالا قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يحل لأحد أن يعطي العطية فيرجع فيها إلا الوالد فيما يعطي ولده ومثل الذي يعطي العطية فيرجع فيها كالكلب يأكل حتى إذا شبع قاء ثم عاد فرجع في قيئه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Amr bin Shu'aib, from Tawus, from Ibn 'Umar and Ibn 'Abbas, that they said:                      \"The Messenger of Allah said: 'It is not permissible for anyone to give a gift then take it back, except a father with regard to what he gives to his son. The likeness of the one who gives a gift then takes it back, is that of the dog which eats then when it is full it vomits, then it goes back to its vomit.'\"",
      "usc_msa_ref": "",
      "chain": [
        "36587",
        "20411",
        "19934",
        "11053",
        "18",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-3910",
      "hadith_no": "3910",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن عبد الله بن المبارك، قال حدثنا إسحاق الأزرق، قال حدثنا ابن عون، عن نافع، عن ابن عمر، أنه كان يأخذ كراء الأرض حتى حدثه رافع عن بعض عمومته أن رسول الله صلى الله عليه وسلم نهى عن كراء الأرض فتركها بعد‏.‏‏ رواه أيوب عن نافع عن رافع ولم يذكر عمومته‏.‏‏",
      "text_en": " It was narrated from Ibn 'Umar that he used to take rent for land until Rafi' narrated to him, from some of his paternal uncles, that the Messenger of Allah forbade leasing land. So he stopped doing that afterward.",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "11071",
        "11014",
        "18"
      ]
    },
    {
      "id": "sunan-an-nasai-3991",
      "hadith_no": "3991",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fighting [The Prohibition of Bloodshed] - كتاب تحريم الدم",
      "chapter_no": "37",
      "text_ar": "أخبرنا سريع بن عبد الله الواسطي الخصي، قال حدثنا إسحاق بن يوسف الأزرق، عن شريك، عن عاصم، عن أبي وائل، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أول ما يحاسب به العبد الصلاة وأول ما يقضى بين الناس في الدماء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah said:                     \"The Messenger of Allah [SAW] said: 'The first thing concerning which a person will be brought to account will be the Salah, and the first thing concerning which scores will be settled among the people, will be bloodshed.\"",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "20587",
        "11080",
        "11353",
        "16"
      ]
    },
    {
      "id": "sunan-an-nasai-4869",
      "hadith_no": "4869",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا عبد الرحمن بن محمد بن سلام، قال حدثنا إسحاق الأزرق، عن الفضيل بن غزوان، عن عكرمة، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا يزني العبد حين يزني وهو مؤمن ولا يشرب الخمر حين يشربها وهو مؤمن ولا يسرق وهو مؤمن ولا يقتل وهو مؤمن ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah said: 'No one who commits Zina is a believer at the moment when he is committing Zina, and no one who drinks wine is a believer at the moment when he is drinking it, and no thief is a believer at the moment when he is stealing, and no killer is a believer at the moment he is killing",
      "usc_msa_ref": "",
      "chain": [
        "36587",
        "20411",
        "20349",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-4954",
      "hadith_no": "4954",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Cutting off the Hand of the Thief - كتاب قطع السارق",
      "chapter_no": "46",
      "text_ar": "حدثنا سوار بن عبد الله بن سوار، قال حدثنا خالد بن الحارث، قال حدثنا عبد الملك، ح وأنبأنا عبد الرحمن بن محمد بن سلام، قال أنبأنا إسحاق، - هو الأزرق - قال حدثنا به عبد الملك، عن عطاء، عن أيمن، مولى ابن الزبير - وقال خالد في حديثه مولى الزبير - عن تبيع عن كعب قال من توضأ فأحسن الوضوء ثم صلى - وقال عبد الرحمن فصلى العشاء الآخرة - ثم صلى بعدها أربع ركعات فأتم - وقال سوار يتم - ركوعهن وسجودهن ويعلم ما يقترئ - وقال سوار يقرأ - فيهن كن له بمنزلة ليلة القدر ‏.‏",
      "text_en": " It was narrated that Ka'b said:                     \"Whoever performs wudu and performs wudu, well, then prays ('Abdur-Rahman said: and prays Isha), then prays after that four Rakahs and does them well (Sawwar said: and understands what he is reciting (Sawwar said: and recites therein), they will be equivalent to (praying) Lailat Al-Qadr for him\". (Hasan Maqtu)",
      "usc_msa_ref": "",
      "chain": [
        "20226",
        "11368",
        "36587",
        "20411",
        "11029"
      ]
    },
    {
      "id": "sunan-an-nasai-5378",
      "hadith_no": "5378",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا عبد الرحمن بن محمد بن سلام، قال حدثنا إسحاق الأزرق، قال حدثنا سفيان، عن عون بن أبي جحيفة، عن أبي جحيفة، قال كنا مع النبي صلى الله عليه وسلم بالبطحاء وهو في قبة حمراء وعنده أناس يسير فجاءه بلال فأذن فجعل يتبع فاه ها هنا وها هنا ‏.‏",
      "text_en": " It was narrated that Abu Juhaifah said:                      \"We were with the Prophet (ﷺ) in Al-Batha' and he was in a red tent, and some people were with him, and he was about to set out. Bilal came and called the Adhan, turning this way and that.\"",
      "usc_msa_ref": "",
      "chain": [
        "36587",
        "20411",
        "20012",
        "11383",
        "4047"
      ]
    },
    {
      "id": "sunan-an-nasai-5648",
      "hadith_no": "5648",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرني أحمد بن خالد، قال حدثنا إسحاق، - يعني الأزرق - قال حدثنا عبد الملك بن أبي سليمان، عن أبي الزبير، عن جابر، قال كان رسول الله صلى الله عليه وسلم ينبذ له في سقاء فإذا لم يكن له سقاء ننبذ له في تور برام ‏.‏ قال ونهى رسول الله صلى الله عليه وسلم عن الدباء والنقير والمزفت ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"(Fruit) would be soaked for the Messenger of Allah [SAW] in a water skin, and if he did not have a water skin, it would be made for him in a small vessel of stone. And the Messenger of Allah [SAW] forbade Ad-Dubba' (gourds), An-Naqir, and Al-Muzaffat.\"",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "10945",
        "11263",
        "34"
      ]
    },
    {
      "id": "sunan-ibn-majah-178",
      "hadith_no": "178",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسحاق الأزرق، عن الأعمش، عن ابن أبي أوفى، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ الخوارج كلاب النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn Awfa said:                     \"The Messenger of Allah said: 'The Khawarij are the dogs of Hell.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20411",
        "11060",
        "5115"
      ]
    },
    {
      "id": "sunan-ibn-majah-667-2",
      "hadith_no": "667",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن الصباح، وأحمد بن سنان، قالا حدثنا إسحاق بن يوسف الأزرق، أنبأنا سفيان، ح وحدثنا علي بن ميمون الرقي، حدثنا مخلد بن يزيد، عن سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، قال جاء رجل إلى النبي  صلى الله عليه وسلم  فسأله عن وقت الصلاة فقال ‏\"‏ صل معنا هذين اليومين ‏\"‏ ‏.‏ فلما زالت الشمس أمر بلالا فأذن ثم أمره فأقام الظهر ثم أمره فأقام العصر والشمس مرتفعة بيضاء نقية ثم أمره فأقام المغرب حين غابت الشمس ثم أمره فأقام العشاء حين غاب الشفق ثم أمره فأقام الفجر حين طلع الفجر فلما كان من اليوم الثاني أمره فأذن الظهر فأبرد بها وأنعم أن يبرد بها ثم صلى العصر والشمس مرتفعة أخرها فوق الذي كان وصلى المغرب قبل أن يغيب الشفق وصلى العشاء بعدما ذهب ثلث الليل وصلى الفجر فأسفر بها ثم قال ‏\"‏ أين السائل عن وقت الصلاة ‏\"‏ ‏.‏ فقال الرجل أنا يا رسول الله ‏.‏ قال ‏\"‏ وقت صلاتكم بين ما رأيتم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sulaiman bin Buraidah that his father said:                     \"A man came to the Prophet and asked him about the times of the prayer. He said: 'Pray with us for two days.' When the sun passed its zenith he commanded Bilal to call the Adhan, then he commanded him to give the Iqamah for Zuhr; then he commanded him to give the Iqamah for 'Asr when the sun was high and clearly white. Then he commanded him to give the Iqamah for Maghrib when the sun had set; then he commanded him to give the Iqamah for 'Isha' when the red afterglow had disappeared; then he commanded him to give the Iqamah for Fajr when dawn came. On the following day he commanded him to give the Adhan for Zuhr when the extreme heat had passed and it had cooled down; then he prayed 'Asr when the sun was still high, but he delayed it more than he had done the day before; then he prayed Maghrib before the red afterglow disappeared; he prayed 'Isha' when one-third of the night had passed; and he prayed Fajr at the time when it was already light. Then he said: 'Where is the one who was asking about the times of Prayer?' The man said: 'Here I am, O Messenger of Allah.' He said: 'The times of your prayer are between the times you have seen.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30269",
        "30297",
        "20411",
        "20012",
        "38412",
        "20462",
        "20005",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-680-2",
      "hadith_no": "680",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Prayer - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا تميم بن المنتصر الواسطي، حدثنا إسحاق بن يوسف، عن شريك، عن بيان، عن قيس بن أبي حازم، عن المغيرة بن شعبة، قال كنا نصلي مع رسول الله  صلى الله عليه وسلم  صلاة الظهر بالهاجرة فقال لنا ‏\"‏ أبردوا بالصلاة فإن شدة الحر من فيح جهنم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Mughirah bin Shu'bah said:                     We were praying Zuhr with the Messenger of Allah at the time of intense heat (i.e., midday when the sun has just passed its zenith) and he said to us, \"Wait for it to cool down before you pray, for intense heat is from the flaring up of the Hell-fire.\"",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "20587",
        "11326",
        "11046",
        "166"
      ]
    },
    {
      "id": "sunan-ibn-majah-1282",
      "hadith_no": "1282",
      "source": "Sunan Ibn Majah",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا عبد الحميد بن بيان الواسطي، حدثنا إسحاق الأزرق، عن سفيان، عن جابر، عن أبي حريز، عن وائل بن حجر، قال رأيت النبي  صلى الله عليه وسلم  صلى جالسا على يمينه وهو وجع ‏.‏",
      "text_en": " It wasnarrated that Wa’il bin Hujr said:                      “I saw the Prophet (ﷺ)performing prayer while sitting on his right side when he was sick.”",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "20012",
        "34",
        "3045"
      ]
    },
    {
      "id": "sunan-ibn-majah-1674",
      "hadith_no": "1674",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثنا إسحاق بن يوسف، عن العوام بن حوشب، عن أبي محمد، مولى عمر بن الخطاب عن أبي عبيدة، عن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من قدم ثلاثة من الولد لم يبلغوا الحنث كانوا له حصنا حصينا من النار ‏\"‏ ‏.‏ فقال أبو ذر قدمت اثنين ‏.‏ قال ‏\"‏ واثنين ‏\"‏ ‏.‏ فقال أبى بن كعب أبو المنذر سيد القراء قدمت واحدا ‏.‏ قال ‏\"‏ وواحدا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Abdullah that the Messenger of Allah (ﷺ)said:                     “Whoever sends fourth three of his children who had not reachedtheage of puberty, they will be a strong fortification for himagainstthe Fire.” Abu Dharr said: “I sent forth two.” He said: “Andtwo” Ubayy bin Ka’b, the chief of the reciters, said: “I sentforthone.” He said: “Even one.”",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20411",
        "11441",
        "10",
        "16"
      ]
    },
    {
      "id": "sunan-ibn-majah-2482",
      "hadith_no": "2482",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Charity - كتاب الصدقات",
      "chapter_no": "15",
      "text_ar": "حدثنا تميم بن المنتصر الواسطي، حدثنا إسحاق بن يوسف، عن شريك، عن هشام بن عروة، عن عمر بن عبد الله بن عمر يعني، عن أبيه، عن جده، عمر أنه تصدق بفرس على عهد رسول الله صلى الله عليه وسلم فأبصر صاحبها يبيعها بكسر فأتى النبي صلى الله عليه وسلم فسأله عن ذلك فقال ‏\"‏ لا تبتع صدقتك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Umar, meaning, from his father, his grandfather 'Umar, that :                     he gave a horse in charity at the time of the Messenger of Allah (ﷺ), then he saw its owner selling it for a low price. He went to the Prophet (ﷺ) and asked him about that, and he said: “Do not buy what you gave in charity.”",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "20587",
        "11065",
        "10511",
        "3"
      ]
    },
    {
      "id": "sunan-ibn-majah-2715",
      "hadith_no": "2715",
      "source": "Sunan Ibn Majah",
      "chapter": "The Chapters on Blood Money - كتاب الديات",
      "chapter_no": "21",
      "text_ar": "حدثنا سعيد بن يحيى بن الأزهر الواسطي، حدثنا إسحاق بن يوسف الأزرق، عن شريك، عن عاصم، عن أبي وائل، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ أول ما يقضى بين الناس يوم القيامة في الدماء ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abdullah that the Messenger of Allah (ﷺ) said:                     The first matter concerning which judgment will be passed among the people on the Day of Resurrection will be bloodshed.”",
      "usc_msa_ref": "",
      "chain": [
        "30254",
        "20411",
        "20587",
        "11080",
        "11353",
        "16"
      ]
    },
    {
      "id": "sunan-ibn-majah-3531",
      "hadith_no": "3531",
      "source": "Sunan Ibn Majah",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا عبد الحميد بن بيان الواسطي، حدثنا إسحاق بن يوسف، عن شريك، عن سماك، عن القاسم بن مخيمرة، عن ابن بريدة، عن أبيه، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ كنت نهيتكم عن الأوعية فانتبذوا فيه واجتنبوا كل مسكر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Ibn Buraidah from his father that the Prophet(ﷺ)said:                      “I used to forbid you to use certain vessels, but now makeNabidh in them, but avoid all intoxicants.”",
      "usc_msa_ref": "",
      "chain": [
        "20411",
        "20587",
        "10770",
        "10812",
        "11432",
        "3131"
      ]
    },
    {
      "id": "sunan-ibn-majah-4168",
      "hadith_no": "4168",
      "source": "Sunan Ibn Majah",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا علي بن ميمون الرقي، حدثنا عبد الواحد بن صالح، حدثنا إسحاق بن يوسف، عن الأعمش، عن يحيى بن وثاب، عن ابن عمر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ المؤمن الذي يخالط الناس ويصبر على أذاهم أعظم أجرا من المؤمن الذي لا يخالط الناس ولا يصبر على أذاهم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn ‘Umar that the Messenger of Allah (ﷺ)said:                      “The believer who mixes with people and bears their annoyancewith patience will have a greater reward than the believer who doesnot mix with people and does not put up with their annoyance.”",
      "usc_msa_ref": "",
      "chain": [
        "38412",
        "20411",
        "11060",
        "18"
      ]
    }
  ],
  "total_hadiths": 65
}