{
  "id": "20416",
  "name": "Ja'far bin Awn bin Ja'far جعفر بن عون بن جعفر",
  "full_name": "Ja'far bin Awn bin Ja'far جعفر بن عون بن جعفر",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "130",
      "date_gregorian": "NA",
      "date_display": [
        "130 AH"
      ],
      "place": ""
    },
    "death": {
      "date_hijri": "227",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ ع  -  صدوق ]"
    ],
    "tags": [
      "B.Makhzum"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "18010",
      "name": "Ibrahim bin Muslim al-'Abdi إبراهيم بن مسلم العبدي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11060",
      "name": "Sulaiman al-A'mash الأعمش / سليمان بن مهران",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11062",
      "name": "Yahya bin Sa'id al-Ansari يحيى بن سعيد الأنصاري",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20342",
      "name": "'Utba bin 'Abdullah bin 'Utba عتبة بن عبد الله بن عتبة أبو العميس",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28326",
      "name": "'Abdur Rahman bin Ziyad عبد الرحمن بن زياد بن أنعم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30115",
      "name": "al-Hasan bin 'Ali al-Halwani الحسن بن علي الخلال الحلواني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30553",
      "name": "'Abd bin Hameed bin Nasr عبد بن حميد بن نصر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30160",
      "name": "Muhammad bin Bashar Bindar محمد بن بشار بندار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30524",
      "name": "Harun bin 'Abdullah al-Hamal هارون بن عبد الله بن مروان الحمال",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30022",
      "name": "Zuhayr bin Harb زهير بن حرب بن شداد أبو خثيمة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "35029",
      "name": "al-Hasan bin 'Ali bin 'Affan الحسن بن علي بن عفان",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "45",
      "source": " Sahih Bukhari ",
      "chapter": "Belief - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسن بن الصباح، سمع جعفر بن عون، حدثنا أبو العميس، أخبرنا قيس بن مسلم، عن طارق بن شهاب، عن عمر بن الخطاب، أن رجلا، من اليهود قال له يا أمير المؤمنين، آية في كتابكم تقرءونها لو علينا معشر اليهود نزلت لاتخذنا ذلك اليوم عيدا‏.‏ قال أى آية قال ‏{‏اليوم أكملت لكم دينكم وأتممت عليكم نعمتي ورضيت لكم الإسلام دينا‏}‏‏.‏ قال عمر قد عرفنا ذلك اليوم والمكان الذي نزلت فيه على النبي صلى الله عليه وسلم وهو قائم بعرفة يوم جمعة‏.‏",
      "text_en": "      Narrated 'Umar bin Al-Khattab:                          Once a Jew said to me, \"O the chief of believers! There is a verse in      your Holy Book Which is read by all of you (Muslims), and had it been      revealed to us, we would have taken that day (on which it was revealed     as a day of celebration.\" 'Umar bin Al-Khattab asked, \"Which is that      verse?\" The Jew replied, \"This day I have perfected your religion For      you, completed My favor upon you, And have chosen for you Islam as      your religion.\" (5:3) 'Umar replied,\"No doubt, we know when and where      this verse was revealed to the Prophet. It was Friday and the Prophet      was standing at 'Arafat (i.e. the Day of Hajj)\"",
      "chain": [
        "30244",
        "20416",
        "20342",
        "11386",
        "3680",
        "3"
      ]
    },
    {
      "hadith_no": "633",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق، قال أخبرنا جعفر بن عون، قال حدثنا أبو العميس، عن عون بن أبي جحيفة، عن أبيه، قال رأيت رسول الله صلى الله عليه وسلم بالأبطح فجاءه بلال فآذنه بالصلاة، ثم خرج بلال بالعنزة حتى ركزها بين يدى رسول الله صلى الله عليه وسلم بالأبطح وأقام الصلاة‏.‏",
      "text_en": " Narrated `Aun bin Abi Juhaifa:                     My father said, \"I saw Allah's Apostle at a place called Al-Abtah. Bilal came and informed him about the prayer and then came out with a short spear (or stick) and planted it in front of Allah's Apostle at Al-Abtah and pronounced the Iqama.\"",
      "chain": [
        "30021",
        "20416",
        "20342",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "1968",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا محمد بن بشار، حدثنا جعفر بن عون، حدثنا أبو العميس، عن عون بن أبي جحيفة، عن أبيه، قال آخى النبي صلى الله عليه وسلم بين سلمان، وأبي الدرداء، فزار سلمان أبا الدرداء، فرأى أم الدرداء متبذلة‏.‏ فقال لها ما شأنك قالت أخوك أبو الدرداء ليس له حاجة في الدنيا‏.‏ فجاء أبو الدرداء، فصنع له طعاما‏.‏ فقال كل‏.‏ قال فإني صائم‏.‏ قال ما أنا بآكل حتى تأكل‏.‏ قال فأكل‏.‏ فلما كان الليل ذهب أبو الدرداء يقوم‏.‏ قال نم‏.‏ فنام، ثم ذهب يقوم‏.‏ فقال نم‏.‏ فلما كان من آخر الليل قال سلمان قم الآن‏.‏ فصليا، فقال له سلمان إن لربك عليك حقا، ولنفسك عليك حقا، ولأهلك عليك حقا، فأعط كل ذي حق حقه‏.‏ فأتى النبي صلى الله عليه وسلم فذكر ذلك له، فقال النبي صلى الله عليه وسلم ‏\"‏ صدق سلمان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     The Prophet made a bond of brotherhood between Salman and Abu Ad-Darda.' Salman paid a visit to Abu Ad-Darda' and found Um Ad-Darda' dressed in shabby clothes and asked her why she was in that state. She replied, \"Your brother Abu Ad-Darda' is not interested in (the luxuries of) this world.\" In the meantime Abu Ad-Darda' came and prepared a meal for Salman. Salman requested Abu Ad- Darda' to eat (with him), but Abu Ad-Darda' said, \"I am fasting.\" Salman said, \"I am not going to eat unless you eat.\" So, Abu Ad-Darda' ate (with Salman). When it was night and (a part of the night passed), Abu Ad-Darda' got up (to offer the night prayer), but Salman told him to sleep and Abu Ad- Darda' slept. After sometime Abu Ad-Darda' again got up but Salman told him to sleep. When it was the last hours of the night, Salman told him to get up then, and both of them offered the prayer. Salman told Abu Ad-Darda', \"Your Lord has a right on you, your soul has a right on you, and your family has a right on you; so you should give the rights of all those who has a right on you.\" Abu Ad- Darda' came to the Prophet and narrated the whole story. The Prophet said, \"Salman has spoken the truth.\"",
      "chain": [
        "30160",
        "20416",
        "20342",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "2934",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا عبد الله بن أبي شيبة، حدثنا جعفر بن عون، حدثنا سفيان، عن أبي إسحاق، عن عمرو بن ميمون، عن عبد الله  رضى الله عنه  قال كان النبي صلى الله عليه وسلم يصلي في ظل الكعبة، فقال أبو جهل وناس من قريش، ونحرت جزور بناحية مكة، فأرسلوا فجاءوا من سلاها، وطرحوه عليه، فجاءت فاطمة فألقته عنه، فقال ‏\"‏ اللهم عليك بقريش، اللهم عليك بقريش، اللهم عليك بقريش ‏\"‏‏.‏ لأبي جهل بن هشام، وعتبة بن ربيعة، وشيبة بن ربيعة، والوليد بن عتبة، وأبى بن خلف، وعقبة بن أبي معيط‏.‏ قال عبد الله فلقد رأيتهم في قليب بدر قتلى‏.‏ قال أبو إسحاق ونسيت السابع‏.‏ وقال يوسف بن إسحاق عن أبي إسحاق أمية بن خلف‏.‏ وقال شعبة أمية أو أبى‏.‏ والصحيح أمية‏.‏",
      "text_en": " Narrated `Abdullah:                     Once the Prophet was offering the prayer in the shade of the Ka`ba. Abu Jahl and some Quraishi men sent somebody to bring the Abdominal contents of a shecamel which had been slaughtered somewhere in Mecca, and when he brought them, they put them over the Prophet Then Fatima (i.e. the Prophet's daughter) came and threw them away from him, and he said, \"O Allah! Destroy (the pagans of) Quraish; O Allah! Destroy Quraish; O Allah Destroy Quraish,\" naming especially Abu Jahl bin Hisham, `Utba bin Rabi`a, Shaiba bin Rabi`a, Al Walid bin `Utba, Ubai bin Khalaf and `Uqba bin Abi Mitt. (The narrator, `Abdullah added, \"I saw them all killed and thrown in the Badr well).",
      "chain": [
        "30201",
        "20416",
        "20012",
        "11049",
        "11382",
        "16"
      ]
    },
    {
      "hadith_no": "6209",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد بن بشار، حدثنا جعفر بن عون، حدثنا أبو العميس، عن عون بن أبي جحيفة، عن أبيه، قال آخى النبي صلى الله عليه وسلم بين سلمان وأبي الدرداء‏.‏ فزار سلمان أبا الدرداء فرأى أم الدرداء متبذلة فقال لها ما شأنك قالت أخوك أبو الدرداء ليس له حاجة في الدنيا‏.‏ فجاء أبو الدرداء فصنع له طعاما فقال كل فإني صائم‏.‏ قال ما أنا بآكل حتى تأكل‏.‏ فأكل، فلما كان الليل ذهب أبو الدرداء يقوم فقال نم‏.‏ فنام، ثم ذهب يقوم فقال نم‏.‏ فلما كان آخر الليل قال سلمان قم الآن‏.‏ قال فصليا فقال له سلمان إن لربك عليك حقا، ولنفسك عليك حقا، ولأهلك عليك حقا، فأعط كل ذي حق حقه‏.‏ فأتى النبي صلى الله عليه وسلم فذكر ذلك له‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ صدق سلمان ‏\"‏‏.‏ أبو جحيفة وهب السوائي، يقال وهب الخير‏.‏",
      "text_en": " Narrated Abu Juhaifa:                     The Prophet established a bond of brotherhood between Salman and Abu Darda'. Salman paid a visit to Abu ad-Darda and found Um Ad-Darda' dressed in shabby clothes and asked her why she was in that state.?\" She replied, \"Your brother, Abu Ad-Darda is not interested in the luxuries of this world.\" In the meantime Abu Ad-Darda came and prepared a meal for him (Salman), and said to him, \"(Please) eat for I am fasting.\" Salman said, \"I am not going to eat, unless you eat.\" So Abu Ad-Darda' ate. When it was night, Abu Ad-Darda' got up (for the night prayer). Salman said (to him), \"Sleep,\" and he slept. Again Abu- Ad-Darda' got up (for the prayer), and Salman said (to him), \"Sleep.\" When it was the last part of the night, Salman said to him, \"Get up now (for the prayer).\" So both of them offered their prayers and Salman said to Abu Ad-Darda',\"Your Lord has a right on you; and your soul has a right on you; and your family has a right on you; so you should give the rights of all those who have a right on you). Later on Abu Ad-Darda' visited the Prophet and mentioned that to him. The Prophet, said, \"Salman has spoken the truth.\"",
      "chain": [
        "30160",
        "20416",
        "20342",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "299",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا عبد بن حميد، وإسحاق بن منصور، قالا أخبرنا جعفر بن عون، أخبرنا أبو عميس، قال سمعت أبا صخرة، يذكر عن عبد الرحمن بن يزيد، وأبي، بردة بن أبي موسى قالا أغمي على أبي موسى وأقبلت امرأته أم عبد الله تصيح برنة ‏.‏ قالا ثم أفاق قال ألم تعلمي - وكان يحدثها - أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أنا بريء ممن حلق وسلق وخرق ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Abu Burda that Abu Musa fell unconscious and his wife Umm Abdullah came there and wailed loudly. When he felt relief he said:                      Don't you know? -and narrated to her: Verily the Messenger of Allah (may peace be upon him) said: I have no concern with one who shaved her hair, lamented loudly and tore (her clothes in grief).",
      "chain": [
        "30553",
        "30313",
        "20416",
        "20395",
        "11901"
      ]
    },
    {
      "hadith_no": "474",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، حدثنا جعفر بن عون، حدثنا هشام بن سعد، حدثنا زيد بن أسلم، بإسنادهما نحو حديث حفص بن ميسرة إلى آخره وقد زاد ونقص شيئا ‏.‏",
      "text_en": " Abu Bakr b. Abi Shaiba, Ja'far b. 'Aun, Hisham b. Sa'd, Zaid b. Aslam narrated the hadith as transmitted by Hafs b. Maisara, with certain additions and omissions.",
      "chain": [
        "30201",
        "20416",
        "20519"
      ]
    },
    {
      "hadith_no": "503",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني إسحاق بن منصور، وعبد بن حميد، قالا أخبرنا جعفر بن عون، أخبرنا أبو عميس، ح قال وحدثني القاسم بن زكرياء، حدثنا حسين بن علي، عن زائدة، قال حدثنا مالك بن مغول، كلاهما عن عون بن أبي جحيفة، عن أبيه، عن النبي صلى الله عليه وسلم بنحو حديث سفيان وعمر بن أبي زائدة يزيد بعضهم على بعض وفي حديث مالك بن مغول فلما كان بالهاجرة خرج بلال فنادى بالصلاة ‏.‏",
      "text_en": " 'Aun b. Abu Juhaifa narrated from the Apostle of Allah (may peace be upon him) on the authority of his father a hadith like that of Sufyan, and 'Umar b. Abu Za'ida made this addition:                      Some of them tried to excel the others (in obtaining water), and in the hadith transmitted by Malik b. Mighwal (the words are): When it was noon, Bilal came out and summoned (people) to (noon) prayer.",
      "chain": [
        "30313",
        "30553",
        "20416",
        "20315",
        "20320",
        "20358",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "3019",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني إسحاق بن منصور، وعبد بن حميد، قالا أخبرنا جعفر بن عون، أخبرنا أبو عميس، عن قيس بن مسلم، عن طارق بن شهاب، عن أبي موسى، - رضى الله عنه - قال كان رسول الله صلى الله عليه وسلم بعثني إلى اليمن قال فوافقته في العام الذي حج فيه فقال لي رسول الله صلى الله عليه وسلم ‏\"‏ يا أبا موسى كيف قلت حين أحرمت ‏\"‏ ‏.‏ قال قلت لبيك إهلالا كإهلال النبي صلى الله عليه وسلم ‏.‏ فقال ‏\"‏ هل سقت هديا ‏\"‏ ‏.‏ فقلت لا ‏.‏ قال ‏\"‏ فانطلق فطف بالبيت وبين الصفا والمروة ‏.‏ ثم أحل ‏\"‏ ‏.‏ ثم ساق الحديث بمثل حديث شعبة وسفيان ‏.‏",
      "text_en": " Abu Musa (Allah be pleased with him) reported:                      The Messenger of Allah (May peace be upon im) had sent me to Yemen and I came back In the year in which he (the Holy Prophet) performed the (Farewell) Pilgrimage. Allah's Messenger (may peace be upon, him) said to me: Abu Musa, what did you ' say when you entered into the state of Ihram? I said: At thy beck and call; my (Ihram) is that of the Ihram of Allah's Apostle (May peace be upon him). He said: Have you brought the sacrificial animals? I said: No. Thereupon he said: Go and circumambulate the House, and (run) between al-Safa' and al-Marwa and then put off Ihram. The rest of the hadith is the same.",
      "chain": [
        "30313",
        "30553",
        "20416",
        "11386",
        "3680",
        "41"
      ]
    },
    {
      "hadith_no": "4309",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Bequests - كتاب الوصية",
      "chapter_no": "26",
      "text_ar": "وحدثناه أبو كريب، حدثنا أبو أسامة، ح وحدثني الحكم بن موسى، حدثنا شعيب، بن إسحاق ح وحدثني أمية بن بسطام، حدثنا يزيد، - يعني ابن زريع - حدثنا روح، - وهو ابن القاسم - ح وحدثنا أبو بكر بن أبي شيبة، حدثنا جعفر بن عون، كلهم عن هشام بن عروة، بهذا الإسناد أما أبو أسامة وروح ففي حديثهما فهل لي أجر كما قال يحيى بن سعيد ‏.‏ وأما شعيب وجعفر ففي حديثهما أفلها أجر كرواية ابن بشر ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Hisham b. 'Urwa with the same chain of transmitters.",
      "chain": [
        "30216",
        "20318",
        "30502",
        "20239",
        "30124",
        "20304",
        "11586",
        "30201",
        "20416"
      ]
    },
    {
      "hadith_no": "4752",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا جعفر بن عون، أخبرنا سفيان، عن أبي، إسحاق بهذا الإسناد نحوه وزاد وكان يستحب ثلاثا يقول ‏\"‏ اللهم عليك بقريش اللهم عليك بقريش اللهم عليك بقريش ‏\"‏ ‏.‏ ثلاثا وذكر فيهم الوليد بن عتبة وأمية بن خلف ولم يشك ‏.‏ قال أبو إسحاق ونسيت السابع ‏.‏",
      "text_en": " Abu Ishiq has narrated a similar tradition through a different chain of transmitters and has added:                      He (the Messenger of Allah) loved to repeat the supplication thrice. He was saying: O Allah, it is for Thee to deal with the Quraish (repeating these words thrice). And among the Quraish, he mentioned (the names of) al-Walid b. 'Utba and Umayya b. Khalaf. (The narrator says there is no doubt about the names of these persons but he has forgotten the name of the seventh man).",
      "chain": [
        "30201",
        "20416",
        "20012"
      ]
    },
    {
      "hadith_no": "6325",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثنا عبد بن حميد، أخبرنا جعفر بن عون، أخبرنا أبو عميس، عن ابن أبي، مليكة عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لو كنت متخذا خليلا لاتخذت ابن أبي قحافة خليلا ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah reported Allah's Messenger (may peace be upon him) as saying:                      If I were to choose as my bosom friend I would have chosen the son of Abu Quhafa (Abu Bakr) as my bosom friend.",
      "chain": [
        "30553",
        "20416",
        "11090",
        "18"
      ]
    },
    {
      "hadith_no": "6329",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثني الحسن بن علي الحلواني، حدثنا جعفر بن عون، عن أبي عميس، ح وحدثنا عبد بن حميد، - واللفظ له - أخبرنا جعفر بن عون، أخبرنا أبو عميس، عن ابن، أبي مليكة سمعت عائشة، وسئلت، من كان رسول الله صلى الله عليه وسلم مستخلفا لو استخلفه قالت أبو بكر ‏.‏ فقيل لها ثم من بعد أبي بكر قالت عمر ‏.‏ ثم قيل لها من بعد عمر قالت أبو عبيدة بن الجراح ‏.‏ ثم انتهت إلى هذا ‏.‏",
      "text_en": " Ibn Abu Mulaika reported:                      I heard A'isha as saying and she was asked as to whom Allah's Messenger (may peace be upon him) would have nominated his successor if he had to nominate one at all. She said: Abu Bakr. It was said to her: Then whom after Abu Bakr? She said: Umar. It was said to her. Then whom after 'Umar? She said: Abu Ubaida b. Jarrab, and then she kept quiet at this.",
      "chain": [
        "30115",
        "20416",
        "30553",
        "20416",
        "11090",
        "53"
      ]
    },
    {
      "hadith_no": "7712",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Commentary - كتاب التفسير",
      "chapter_no": "57",
      "text_ar": "وحدثني عبد بن حميد، أخبرنا جعفر بن عون، أخبرنا أبو عميس، عن قيس، بن مسلم عن طارق بن شهاب، قال جاء رجل من اليهود إلى عمر فقال يا أمير المؤمنين آية في كتابكم تقرءونها لو علينا نزلت معشر اليهود لاتخذنا ذلك اليوم عيدا ‏.‏ قال وأى آية قال ‏{‏ اليوم أكملت لكم دينكم وأتممت عليكم نعمتي ورضيت لكم الإسلام دينا‏}‏ فقال عمر إني لأعلم اليوم الذي نزلت فيه والمكان الذي نزلت فيه نزلت على رسول الله صلى الله عليه وسلم بعرفات في يوم جمعة ‏.‏",
      "text_en": " Tariq b. Shihab reported that a Jew came to 'Umar and said:                      Commander of the Faithful, there is a verse in your Book, which you recite. Had it been revealed in connection with the Jews, we would have taken it as the day of rejoicing. Thereupon he said: Which verse do you mean? He replied:\" This day I have perfected your religion for you and I have completed My favours upon you and I have chosen al-Islam as religion for you.\" Umar said, I know the day when it was revealed and the place where it was revealed. It was revealed to Allah's Messenger (may peace be upon him) at 'Arafat on Friday.",
      "chain": [
        "30553",
        "20416",
        "11386",
        "3680"
      ]
    },
    {
      "hadith_no": "7731",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Commentary - كتاب التفسير",
      "chapter_no": "57",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وهارون بن عبد الله، وعبد بن حميد، قال عبد أخبرنا وقال الآخران، حدثنا جعفر بن عون، أخبرنا أبو عميس، عن عبد المجيد بن سهيل، عن عبيد الله بن عبد الله بن عتبة، قال قال لي ابن عباس تعلم - وقال هارون تدري - آخر سورة نزلت من القرآن نزلت جميعا قلت نعم ‏.‏ ‏{‏ إذا جاء نصر الله والفتح‏}‏ قال صدقت ‏.‏ وفي رواية ابن أبي شيبة تعلم أى سورة ‏.‏ ولم يقل آخر ‏.‏",
      "text_en": " Ubaidullah b. 'Abdullah b. 'Utba reported:                      Ibn Abbas said to me: Do you know-and in the words of Harun (another narrator): Are you aware of-the last Sura which was revealed in the Qur'an as a whole? I said: Yes,\" When came the help from Allah and the victory\" (cx.). Thereupon, he said: You have told the truth. And in the narration of Abu Shaiba (the words are): Do you know the Sura? And he did not mention the words\" the last one\".",
      "chain": [
        "30201",
        "30524",
        "30553",
        "20416",
        "11705",
        "11004"
      ]
    },
    {
      "hadith_no": "927",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا الحسين بن عيسى الخراساني الدامغاني، حدثنا جعفر بن عون، حدثنا هشام بن سعد، حدثنا نافع، قال سمعت عبد الله بن عمر، يقول خرج رسول الله صلى الله عليه وسلم إلى قباء يصلي فيه - قال - فجاءته الأنصار فسلموا عليه وهو يصلي ‏.‏ قال فقلت لبلال كيف رأيت رسول الله صلى الله عليه وسلم يرد عليهم حين كانوا يسلمون عليه وهو يصلي قال يقول هكذا وبسط كفه ‏.‏ وبسط جعفر بن عون كفه وجعل بطنه أسفل وجعل ظهره إلى فوق ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     The Messenger of Allah (ﷺ) went to Quba to offer prayer. Then the Ansar (the Helpers) came to him and gave him a salutation while he was engaged in prayer. I asked Bilal: How did you find the Messenger of Allah (ﷺ) responding to them when they gave him a salutation while he was engaged in prayer. He replied: In this way, and Ja'far ibn Awn demonstrated by spreading his palm, and keeping its inner side below and its back side above.",
      "chain": [
        "20416",
        "20519",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "1216",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Rules of Law about the Prayer during Journey - كتاب صلاة السفر",
      "chapter_no": "4",
      "text_ar": "حدثنا محمد بن هشام، جار أحمد بن حنبل حدثنا جعفر بن عون، عن هشام بن سعد، قال بينهما عشرة أميال يعني بين مكة وسرف ‏.‏",
      "text_en": " Narrated Hisham b. Sa'd:                     There was a distance of ten miles between them, that is, Mecca and Sarif.",
      "chain": [
        "20416",
        "20519"
      ]
    },
    {
      "hadith_no": "1800",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Food - كتاب الأطعمة عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، قال حدثنا جعفر بن عون، عن سعيد بن أبي عروبة، عن معمر، عن الزهري، عن سالم، عن أبيه، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا أكل أحدكم فليأكل بيمينه وليشرب بيمينه فإن الشيطان يأكل بشماله ويشرب بشماله ‏\"‏ ‏.‏",
      "text_en": " Narrated Az-Zuhri:                     From Salim, from his father, that the Messenger of Allah (ﷺ) said: \"When one of you eats, then let him eat with his right hand, and let him drink with his right hand, for indeed Ash-Shaitan eats with his left hand, and he drinks with his left hand.\"",
      "chain": [
        "30025",
        "20416",
        "11073",
        "20115",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "2413",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters On Zuhd - كتاب الزهد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "36",
      "text_ar": "حدثنا محمد بن بشار، حدثنا جعفر بن عون، حدثنا أبو العميس، عن عون بن أبي جحيفة، عن أبيه، قال آخى رسول الله صلى الله عليه وسلم بين سلمان وبين أبي الدرداء فزار سلمان أبا الدرداء فرأى أم الدرداء متبذلة فقال ما شأنك متبذلة قالت إن أخاك أبا الدرداء ليس له حاجة في الدنيا ‏.‏ قال فلما جاء أبو الدرداء قرب إليه طعاما فقال كل فإني صائم ‏.‏ قال ما أنا بآكل حتى تأكل ‏.‏ قال فأكل فلما كان الليل ذهب أبو الدرداء ليقوم فقال له سلمان نم ‏.‏ فنام ثم ذهب يقوم فقال له نم ‏.‏ فنام فلما كان عند الصبح قال له سلمان قم الآن فقاما فصليا فقال إن لنفسك عليك حقا ولربك عليك حقا ولضيفك عليك حقا وإن لأهلك عليك حقا فأعط كل ذي حق حقه ‏.‏ فأتيا النبي صلى الله عليه وسلم فذكرا ذلك فقال له ‏\"‏ صدق سلمان ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث صحيح ‏.‏ وأبو العميس اسمه عتبة بن عبد الله وهو أخو عبد الرحمن بن عبد الله المسعودي ‏.‏",
      "text_en": " Ubu Juhaifah narrated from his father who said:                     \"The Messenger of Allah (s.a.w) made a bond of brotherhood  between Salman and Abu Ad-Darda. Salman went to visit Abu Ad-Darda, and saw Umm Ad-Darda wearing shabby clothes, So he said: 'Why are you wearing such shabby clothes?' She said: 'Your brother Abu Ad-Darda has no interest in the world.' So when Abu Ad-Darda arrived, he prepared some food for him (Salman) and said: 'Eat, for I am fasting.' He said: 'I shall not eat until you eat.'\" He said: \"So he ate. When night came Abu Ad-Darda started to leave and stand (in prayer), but Salman said to him: 'Sleep.' So he slept. Then he went to stand (in prayer) but he said to him: 'Sleep'. So he slept. When the morning (Fajr) came,Salman said: 'Get up now.'So he got up to perform Salat. Then he (Salman) said: 'Indeed your self has a right upon you, your Lord has a right upon you, your guest has a right upon you, and your family has a right upon you. So give each the right they are due. The Prophet (s.a.w), and that was mentioned to him, so he said: 'Salman has told the truth.'\"",
      "chain": [
        "30160",
        "20416",
        "20342",
        "11383",
        "4047"
      ]
    },
    {
      "hadith_no": "3223",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، أخبرنا جعفر بن عون، أخبرنا الأعمش، عن أبي صالح، عن أبي سعيد، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يدعى نوح فيقال هل بلغت فيقول نعم ‏.‏ فيدعى قومه فيقال هل بلغكم فيقولون ما أتانا من نذير وما أتانا من أحد ‏.‏ فيقول من شهودك فيقول محمد وأمته ‏.‏ قال فيؤتى بكم تشهدون أنه قد بلغ فذلك قول الله ‏:‏ ‏(‏ وكذلك جعلناكم أمة وسطا لتكونوا شهداء على الناس ويكون الرسول عليكم شهيدا ‏)‏ والوسط العدل ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": "",
      "chain": [
        "30553",
        "20416",
        "11060",
        "11161",
        "38"
      ]
    },
    {
      "hadith_no": "3224",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن بشار، حدثنا جعفر بن عون، عن الأعمش، نحوه ‏.‏",
      "text_en": "",
      "chain": [
        "30160",
        "20416",
        "11060"
      ]
    },
    {
      "hadith_no": "3632",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا عبد بن حميد، حدثنا جعفر بن عون، أخبرنا أبو جناب الكلبي، عن الضحاك بن مزاحم، عن ابن عباس، رضى الله عنهما قال من كان له مال يبلغه حج بيت ربه أو تجب عليه فيه الزكاة فلم يفعل سأل الرجعة عند الموت ‏.‏ فقال رجل يا ابن عباس اتق الله إنما سأل الرجعة الكفار قال سأتلو عليك بذلك قرآنا ‏:‏ ‏(‏ يا أيها الذين آمنوا لا تلهكم أموالكم ولا أولادكم عن ذكر الله ‏)‏ ‏:‏ ‏(‏وأنفقوا مما رزقناكم من قبل أن يأتي أحدكم الموت ‏)‏ إلى قوله ‏:‏ ‏(‏ والله خبير بما تعملون ‏)‏ قال فما يوجب الزكاة قال إذا بلغ المال مائتى درهم فصاعدا ‏.‏ قال فما يوجب الحج قال الزاد والبعير ‏.‏",
      "text_en": " Ad-Dahhak bin Muzahim narrated:                     From Ibn Abbas [may Allah be pleased with him] who said: “Whoever has wealth, required him to perform Hajj to the House of his Lord, or upon which Zakat is obligatory, but he does not do it, then he shall ask to return (the world) upon his death.” A man said: “Oh Ibn Abbas! Have Taqwa of Allah! It is only the disbelievers who will be asked to return.” He said: “For that, I shall recite to you from the Qur’an:  You who believe! Let not your properties or your children divert you from the remembrance of Allah. And whosever does that, then they are with the losers. And spend of that which We have provided you before death comes to one of you, and says: “My Lord! If only You would give me respite for a little while, then I should give Sadaqah” up to His saying: “And Allah is All-Aware of what you do.” He said: “So what makes Zakat obligatory?” He said: “When wealth reaches two hundred or above.” He said: “What makes Hajj obligatory?” He said: “Provisions and a camel.”",
      "chain": [
        "30553",
        "20416",
        "19144",
        "19912",
        "17"
      ]
    },
    {
      "hadith_no": "4117",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا رجاء بن محمد العذري، - بصري - حدثنا جعفر بن عون، عن إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن سعد، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اللهم استجب لسعد إذا دعاك ‏\"‏ ‏.‏ قال أبو عيسى وقد روي هذا الحديث عن إسماعيل عن قيس أن النبي صلى الله عليه وسلم قال ‏\"‏ اللهم استجب لسعد إذا دعاك ‏\"‏ ‏.‏ وهذا أصح ‏.‏",
      "text_en": " Narrated Sa'd:                     that the Messenger of Allah (ﷺ) said: \"O Allah, respond to Sa'd when he supplicates to You.\"",
      "chain": [
        "20416",
        "11418",
        "11046",
        "9"
      ]
    },
    {
      "hadith_no": "692",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا أحمد بن عثمان بن حكيم، قال حدثنا جعفر بن عون، عن أبي عميس، قال أخبرنا أبو صخرة، عن أبي الشعثاء، قال خرج رجل من المسجد بعد ما نودي بالصلاة فقال أبو هريرة أما هذا فقد عصى أبا القاسم صلى الله عليه وسلم ‏.‏",
      "text_en": " Abu Sakhrah narrated that Abu Ash-Sha'tha' said:                      \"A man left the Masjid after the call to prayer had been given, and Abu Hurairah said: 'This man has indeed disobeyed Abu Al-Qasim (ﷺ).'\"",
      "chain": [
        "30185",
        "20416",
        "11351"
      ]
    },
    {
      "hadith_no": "3107",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا جعفر بن عون، قال حدثنا مسعر، عن محمد بن عبد الرحمن، عن عيسى بن طلحة، عن أبي هريرة، قال لا يبكي أحد من خشية الله فتطعمه النار حتى يرد اللبن في الضرع ولا يجتمع غبار في سبيل الله ودخان جهنم في منخرى مسلم أبدا ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"No man who weeps for fear of Allah will be touched by the Fire until the milk goes back into the udders. An the dust (of Jihad) in the cause of Allah, and the smoke of Hell, will never be combined in the nostrils of a Muslim.\"",
      "chain": [
        "38022",
        "20416",
        "20359",
        "11105",
        "10573",
        "13"
      ]
    },
    {
      "hadith_no": "3194",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا جعفر بن عون، عن أبي عميس، عن عبد الله بن عبد الله بن جبر، عن أبيه، أن رسول الله صلى الله عليه وسلم عاد جبرا فلما دخل سمع النساء يبكين ويقلن كنا نحسب وفاتك قتلا في سبيل الله ‏.‏ فقال ‏\"‏ وما تعدون الشهادة إلا من قتل في سبيل الله إن شهداءكم إذا لقليل القتل في سبيل الله شهادة والبطن شهادة والحرق شهادة والغرق شهادة والمغموم - يعني الهدم - شهادة والمجنوب شهادة والمرأة تموت بجمع شهيدة ‏\"‏ ‏.‏ قال رجل أتبكين ورسول الله صلى الله عليه وسلم قاعد قال ‏\"‏ دعهن فإذا وجب فلا تبكين عليه باكية ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin 'Abdullah bin Jabr, from his father, that the Messenger of Allah (ﷺ) visited Jabr (when he was sick). When he entered he heard the women crying and saying:                      \"We thought that your death would come when fighting in the cause of Allah.\" He said: \"You think that martyrdom only comes when one is killed in the cause of Allah. In that case your martyrs would be few. Being killed in the  cause of Allah is martyrdom, dying of an abdominal complaint is martyrdom, being burned to death is martyrdom, drowning is martyrdom, being crushed beneath a falling wall is martyrdom, dying of pleurisy is martyrdom, and the woman who dies along with her fetus is a martyr.\" A man said: \"Are you weeping when the Messenger of Allah (ﷺ) is sitting here?\" He said: \"Let them be, but if he dies on one should weep for him.\"",
      "chain": [
        "38022",
        "20416",
        "11185",
        "12206"
      ]
    },
    {
      "hadith_no": "3196",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا أبو داود، سليمان بن سيف قال حدثنا جعفر بن عون، قال أنبأنا ابن جريج، عن عطاء، قال حضرنا مع ابن عباس جنازة ميمونة زوج النبي صلى الله عليه وسلم بسرف فقال ابن عباس هذه ميمونة إذا رفعتم جنازتها فلا تزعزعوها ولا تزلزلوها فإن رسول الله صلى الله عليه وسلم كان معه تسع نسوة فكان يقسم لثمان وواحدة لم يكن يقسم لها ‏.‏",
      "text_en": " Narrated 'Ata':                     It was narrated that 'Ata' said: \"We attended the funeral of Maimunah, the wife of the Prophet, with Ibn 'Abbas in Sarif.  Ibn 'Abbas said: 'This is Maimunah; when you lift up her bier, do not rock it nor shake it.  The Messenger of Allah had nine wives and he used to give a share of his time to eight of them and not to one.'\"",
      "chain": [
        "20416",
        "11070",
        "11029"
      ]
    },
    {
      "hadith_no": "3515",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا حسين بن منصور، قال حدثنا جعفر بن عون، قال حدثنا يحيى بن سعيد، قال أخبرني سليمان بن يسار، قال أخبرني أبو سلمة بن عبد الرحمن، قال كنت أنا وابن، عباس وأبو هريرة فقال ابن عباس إذا وضعت المرأة بعد وفاة زوجها فإن عدتها آخر الأجلين ‏.‏ فقال أبو سلمة فبعثنا كريبا إلى أم سلمة يسألها عن ذلك فجاءنا من عندها أن سبيعة توفي عنها زوجها فوضعت بعد وفاة زوجها بأيام فأمرها رسول الله صلى الله عليه وسلم أن تتزوج ‏.‏",
      "text_en": " Abu Salamah bin 'Abdur-Rahman said:                      \"Ibn 'Abbas, Abu Hurairah and I were together, and Ibn 'Abbas said: 'If a woman gives birth after her husband dies, her 'Iddah is the longer of the two periods.'\" Abu Salamah said: \"We sent Kuraib to Umm Salamah to ask her about that. He came to us and told us from her that the husband of Subai'ah died and she gave birth a few days after her husband died, and the Messenger of Allah told her to get married.\"",
      "chain": [
        "20416",
        "11062",
        "11005",
        "10567"
      ]
    },
    {
      "hadith_no": "5012",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا أبو داود قال حدثنا جعفر بن عون قال حدثنا أبو عميس عن قيس بن مسلم عن طارق بن شهاب قال  جاء رجل من اليهود إلى عمر بن الخطاب فقال يا أمير المؤمنين آية في كتابكم تقرءونها لو علينا معشر اليهود نزلت لاتخذنا ذلك اليوم عيدا قال أي آية قال  اليوم أكملت لكم دينكم وأتممت عليكم نعمتي ورضيت لكم الإسلام دينا  فقال عمر إني لأعلم المكان الذي نزلت فيه واليوم الذي نزلت فيه نزلت على رسول الله صلى الله عليه وسلم في عرفات في يوم جمعة",
      "text_en": " It was narrated that Tariq bin Shihab said:                     \"A Jewish man came to 'Umar bin Al-Khattab and said: 'O Commander of the Believers! There is a Verse in your Book which you recite; if it had been revealed to us Jews we would have taken that day as a festival.' He said: 'Which Verse is that?' He said: 'This day, I have perfected your religion for you, completed My favor upon you, and have chosen for you Islam as your religion.' 'Umar said: 'I know the place where it was revealed and the day on which it was revealed. It was revealed to the Messenger of Allah [SAW] at 'Arafat, on a Friday.'\"",
      "chain": [
        "30002",
        "20416",
        "11386",
        "3680"
      ]
    },
    {
      "hadith_no": "5507",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرنا أحمد بن سليمان، قال حدثنا جعفر بن عون، قال حدثنا عبد الرحمن بن عبد الله، عن أبي عمر، عن عبيد بن خشخاش، عن أبي ذر، قال دخلت المسجد ورسول الله صلى الله عليه وسلم فيه فجئت فجلست إليه فقال ‏\"‏ يا أبا ذر تعوذ بالله من شر شياطين الجن والإنس ‏\"‏ ‏.‏ قلت أوللإنس شياطين قال ‏\"‏ نعم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Dharr said:                     \"I entered the Masjid and the Messenger of Allah [SAW] was there, so I came and sat before him and he said: 'O Abu Dharr, seek refuge with Allah from the evils of the devils among the Jinn and mankind.' I said: 'Are there devils among mankind?' He said: 'Yes.'\"",
      "chain": [
        "38022",
        "20416",
        "20439",
        "23"
      ]
    },
    {
      "hadith_no": "56",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن العلاء الهمداني، حدثني رشدين بن سعد، وجعفر بن عون، عن ابن أنعم، - هو الإفريقي - عن عبد الرحمن بن رافع، عن عبد الله بن عمرو، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ العلم ثلاثة فما وراء ذلك فهو فضل آية محكمة أو سنة قائمة أو فريضة عادلة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Amr said:                     \"The Messenger of Allah (ﷺ) said: 'Knowledge is based on three things, and anything beyond that is superfluous: a clear Verse, an established Sunnah, or the rulings by which the inheritance is divided fairly.'\"",
      "chain": [
        "30216",
        "26012",
        "20416",
        "29"
      ]
    },
    {
      "hadith_no": "1023",
      "source": " Sunan Ibn Majah ",
      "chapter": "Establishing the Prayer and the Sunnah Regarding Them - كتاب إقامة الصلاة والسنة فيها",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو كريب، حدثنا عبدة بن سليمان، وجعفر بن عون، عن الإفريقي، عن عمران بن عبد، عن عبد الله بن عمرو، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ثلاثة لا تقبل لهم صلاة الرجل يؤم القوم وهم له كارهون والرجل لا يأتي الصلاة إلا دبارا - يعني بعد ما يفوته الوقت - ومن اعتبد محررا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin ‘Amr said:                      “The Messenger of Allah9saw) said: ‘There are three whose prayer are not accepted: A manwholeads people while they do not like him; a man who does not cometoprayer until its end – meaning after its time has expired –and onewho enslaves a freed person.’”",
      "chain": [
        "30216",
        "20337",
        "20416",
        "29"
      ]
    },
    {
      "hadith_no": "1653",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters Regarding Funerals - كتاب الجنائز",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن عثمان بن حكيم الأودي، حدثنا جعفر بن عون، عن أبي العميس، قال سمعت أبا صخرة، يذكر عن عبد الرحمن بن يزيد، وأبي، بردة قالا لما ثقل أبو موسى أقبلت امرأته أم عبد الله تصيح برنة فأفاق فقال لها أو ما علمت أني بريء ممن برئ منه رسول الله  صلى الله عليه وسلم  وكان يحدثها أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ أنا بريء ممن حلق وسلق وخرق ‏\"‏ ‏.‏",
      "text_en": " ‘Abdur-Rahman bin Yazid and Abu Burdah said:                      “When Abu Musa fellsick, his wife Umm ‘Abdullah started to wail loudly. He woke up andsaid to her: ‘Do you not know that I am innocent of those whom theMessenger of Allah (ﷺ) declared innocence of?’ And he told herthatthe Messenger of Allah (ﷺ) said: ‘I am innocent of those whoshavetheir heads, raise their voices and tear their garments (attimes ofcalamity).’”",
      "chain": [
        "30185",
        "20416",
        "20342",
        "11055",
        "11901"
      ]
    },
    {
      "hadith_no": "1932",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا أبو كريب، حدثنا عبد الرحمن المحاربي، وجعفر بن عون، عن الإفريقي، عن عبد الله بن يزيد، عن عبد الله بن عمرو، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا تزوجوا النساء لحسنهن فعسى حسنهن أن يرديهن ولا تزوجوهن لأموالهن فعسى أموالهن أن تطغيهن ولكن تزوجوهن على الدين ولأمة خرماء سوداء ذات دين أفضل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abdullah bin Amr that:                     the Prophet said: “Do not marry women for their beauty for it may lead to their doom. Do not marry them for their wealth, for it may lead them to fall into sin. Rather, marry them for her religion. A black slave woman with piercings who is religious is better.”",
      "chain": [
        "30216",
        "20333",
        "20416",
        "1945",
        "29"
      ]
    },
    {
      "hadith_no": "1975",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Marriage - كتاب النكاح",
      "chapter_no": "9",
      "text_ar": "حدثنا إسحاق بن منصور، أنبأنا جعفر بن عون، أنبأنا الأجلح، عن أبي الزبير، عن ابن عباس، قال أنكحت عائشة ذات قرابة لها من الأنصار فجاء رسول الله  صلى الله عليه وسلم  فقال ‏\"‏ أهديتم الفتاة ‏\"‏ ‏.‏ قالوا نعم ‏.‏ قال ‏\"‏ أرسلتم معها من يغني قالت لا ‏.‏ فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن الأنصار قوم فيهم غزل فلو بعثتم معها من يقول أتيناكم أتيناكم فحيانا وحياكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Ibn'Abbas said:                     'Aisaha arranged a marriage for Allah came and said: Have you taken the girl (to her husbands house) ?” They said: “Yes.” He said: “Have you sent someone with her to sing?” She said: “No.” The Messenger of Allah said: “The Ansar are People with romantic feelings. Why don't you send someone with her to say: 'We have come to you, we have come to you, may Allah bless you and us?' ”",
      "chain": [
        "30313",
        "20416",
        "11263",
        "17"
      ]
    },
    {
      "hadith_no": "3065",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Hajj Rituals - كتاب المناسك",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا جعفر بن عون، عن هشام بن سعد، عن زيد بن أسلم، عن أبيه، قال سمعت عمر، يقول فيم الرملان الآن وقد أطأ الله الإسلام ونفى الكفر وأهله وايم الله ما ندع شيئا كنا نفعله على عهد رسول الله  صلى الله عليه وسلم  ‏.‏",
      "text_en": " It wasnarrated from Zaid bin Aslam that his father said:                      “I heard‘Umarsay: ‘Why do they perform Ramal now, when Allah has establishedIslam and done away with disbelief and its people? By Allah,* we willnot give up something that we used to do at the time of the Messengerof Allah (ﷺ).’”",
      "chain": [
        "30201",
        "20416",
        "20519",
        "11163",
        "11416",
        "3"
      ]
    },
    {
      "hadith_no": "3437",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Food - كتاب الأطعمة",
      "chapter_no": "29",
      "text_ar": "حدثنا إسماعيل بن أسد، حدثنا جعفر بن عون، حدثنا إسماعيل بن أبي خالد، عن قيس بن أبي حازم، عن أبي مسعود، قال أتى النبي  صلى الله عليه وسلم  رجل فكلمه فجعل ترعد فرائصه فقال له ‏\"‏ هون عليك فإني لست بملك إنما أنا ابن امرأة تأكل القديد ‏\"‏ ‏.‏ قال أبو عبد الله إسماعيل وحده وصله ‏.‏",
      "text_en": " It wasnarrated that Ibn Mas’ud said:                      “A man came to the Prophet(ﷺ),so he spoke to him, and he started to tremble with awe. He saidtohim: ‘Take it easy. I am not a king; I am just a man whose motherate dried meat.’”",
      "chain": [
        "20416",
        "11418",
        "11046",
        "402"
      ]
    }
  ],
  "total_hadiths": 37
}