{
  "id": "20417",
  "name": "Hisan bin Ibrahim حسان بن إبراهيم",
  "full_name": "Hisan bin Ibrahim حسان بن إبراهيم",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Sadooq/Delusion",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "186",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Kirmani"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq/Delusion] [ خ  م  د  -  صدوق يخطئ ]",
      "Fiqh",
      "Qadhi(Judge)"
    ],
    "tags": [
      "Judge",
      "al-Kirmani"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20016",
      "name": "Sa'id bin Masrooq Ath-Thawri سعيد بن مسروق الثوري",
      "grade": "Succ. (Taba' Tabi') [6th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "11080",
      "name": "'Asim al-Ahwal عاصم الأحول",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "10957",
      "name": "al-Lyth bin Abi Sulaym الليث بن أبي سليم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10616",
      "name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "21262",
      "name": "Zufr bin al-Hadhayl bin Qays زفر بن الهذيل",
      "grade": "Succ. (Taba' Tabi') [Hanafi]"
    },
    {
      "id": "11201",
      "name": "'Ubaidullah bin 'Umar bin Hafs عبيد الله بن عمر بن حفص بن عاصم",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20473",
      "name": "Yusuf bin Ishaq bin Abi Ishaq يوسف بن إسحاق بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20475",
      "name": "Yonus bin Yazid bin Abi al-Nijad يونس بن يزيد بن أبي النجاد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30430",
      "name": "Hameed bin Musa'da bin al-Mubarak حميد بن مسعدة بن المبارك",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30106",
      "name": "'Affan bin Muslim عفان بن مسلم بن عبد الله الصفار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38371",
      "name": "'Ubaidullah bin Muhammad al-'Aishi عبيد الله بن محمد بن حفص العيشي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30423",
      "name": "Ahmed bin 'Ubda bin Musa أحمد بن عبدة بن موسى",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38090",
      "name": "al-Azrq bin 'Ali الأزرق بن علي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "36649",
      "name": "Muhammad bin 'Isa bin al-Tibaa' محمد بن عيسى بن الطباع",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30504",
      "name": "Da'ud bin 'Amr bin Zuhayr داود بن عمرو الضبي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30116",
      "name": "Sa'id bin Mnswr bin Sh'bh سعيد بن منصور بن شعبة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20387",
      "name": "'Ali bin Hujr bin Iyas bin Maqatil علي بن حجر بن إياس بن مقاتل",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30159",
      "name": "Muhammad bin Ishaq bin Mansur kirmani محمد بن إسحاق بن منصور الكرماني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36523",
      "name": "Ishaq bin Abi Isra'il Kamjar إسحاق بن أبي إسرائيل كامجر",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2067",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا محمد بن أبي يعقوب الكرماني، حدثنا حسان، حدثنا يونس، حدثنا محمد، عن أنس بن مالك  رضى الله عنه  قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ من سره أن يبسط له رزقه أو ينسأ له في أثره فليصل رحمه ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     I heard Allah's Apostle saying, \"whoever desires an expansion in his sustenance and age, should keep good relations with his Kith and kin.\"",
      "chain": [
        "30159",
        "20417",
        "20475",
        "20278",
        "19"
      ]
    },
    {
      "hadith_no": "4668",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني محمد بن أبي يعقوب أبو عبد الله الكرماني، حدثنا حسان بن إبراهيم، حدثنا يونس، عن الزهري، عن عروة، أن عائشة، رضى الله عنها قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ رأيت جهنم يحطم بعضها بعضا، ورأيت عمرا يجر قصبه، وهو أول من سيب السوائب ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     Allah's Apostle said, \"I saw Hell and its different portions were consuming each other and saw `Amr dragging his intestines (in it), and he was the first person to establish the tradition of letting animals loose (for the idols).",
      "chain": [
        "30159",
        "20417",
        "20475",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5119",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا علي، سمع حسان بن إبراهيم، عن يونس بن يزيد، عن الزهري، قال أخبرني عروة، أنه سأل عائشة عن قوله تعالى ‏{‏وإن خفتم أن لا تقسطوا في اليتامى فانكحوا ما طاب لكم من النساء مثنى وثلاث ورباع فإن خفتم أن لا تعدلوا فواحدة أو ما ملكت أيمانكم ذلك أدنى أن لا تعولوا‏}‏‏.‏ قالت يا ابن أختي، اليتيمة تكون في حجر وليها، فيرغب في مالها وجمالها، يريد أن يتزوجها بأدنى من سنة صداقها، فنهوا أن ينكحوهن إلا أن يقسطوا لهن فيكملوا الصداق، وأمروا بنكاح من سواهن من النساء‏.‏",
      "text_en": " Narrated 'Ursa:                     that he asked `Aisha about the Statement of Allah: 'If you fear that you shall not be able to deal justly with the orphan girls, then marry (other) women of your choice, two or three or four; but if you fear that you shall not be able to deal justly (with them), then only one, or (the captives) that your right hands possess. That will be nearer to prevent you from doing injustice.' (4.3) `Aisha said, \"O my nephew! (This Verse has been revealed in connection with) an orphan girl under the guardianship of her guardian who is attracted by her wealth and beauty and intends to marry her with a Mahr less than what other women of her standard deserve. So they (such guardians) have been forbidden to marry them unless they do justice to them and give them their full Mahr, and they are ordered to marry other women instead of them.\"",
      "chain": [
        "30026",
        "20417",
        "20475",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "7248",
      "source": " Sahih Bukhari ",
      "chapter": "Judgments (Ahkaam) - كتاب الأحكام",
      "chapter_no": "94",
      "text_ar": "حدثنا محمد بن أبي يعقوب الكرماني، حدثنا حسان بن إبراهيم، حدثنا يونس، قال محمد أخبرني سالم، أن عبد الله بن عمر، أخبره أنه، طلق امرأته وهى حائض، فذكر عمر للنبي صلى الله عليه وسلم، فتغيظ فيه رسول الله صلى الله عليه وسلم ثم قال ‏\"‏ ليراجعها، ثم ليمسكها حتى تطهر، ثم تحيض فتطهر، فإن بدا له أن يطلقها فليطلقها ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     That he had divorced his wife during her menses. `Umar mentioned that to the Prophet. Allah's Apostle became angry and said, \"He must take her back (his wife) and keep her with him till she becomes clean from her menses and then to wait till she gets her next period and becomes clean again from it and only then, if he wants to divorce her, he may do so.\"",
      "chain": [
        "30159",
        "20417",
        "20475",
        "20278",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "237",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا حسان بن إبراهيم، حدثنا يونس بن يزيد، ح وحدثني حرملة بن يحيى، أخبرنا ابن وهب، أخبرني يونس، عن ابن شهاب، أخبرني أبو إدريس الخولاني، أنه سمع أبا هريرة، وأبا، سعيد الخدري يقولان قال رسول الله صلى الله عليه وسلم ‏.‏ بمثله ‏.‏",
      "text_en": " It has been transmitted by Abu Huraira and Abu Sa'id al-Khudri (both of them the reputed Companions of the Holy Prophet) that the Messenger of Allah (may peace be upon him) said like that.",
      "chain": [
        "30116",
        "20417",
        "20475",
        "30487",
        "20029",
        "20475",
        "11013",
        "11027",
        "13",
        "38"
      ]
    },
    {
      "hadith_no": "6379",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثنا محمد بن بكار بن الريان، حدثنا حسان، - يعني ابن إبراهيم - عن  سعيد بن مسروق، عن يزيد بن حيان، عن زيد بن أرقم، عن النبي صلى الله عليه وسلم ‏.‏ وساق الحديث بنحوه بمعنى حديث زهير ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Zaid b. Arqam through another chain of transmitters.",
      "chain": [
        "30512",
        "20417",
        "20016",
        "28642",
        "384"
      ]
    },
    {
      "hadith_no": "6381",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن بكار بن الريان، حدثنا حسان، - يعني ابن إبراهيم - عن سعيد، - وهو ابن مسروق - عن يزيد بن حيان، عن زيد بن أرقم، قال دخلنا عليه فقلنا له لقد رأيت خيرا ‏.‏ لقد صاحبت رسول الله صلى الله عليه وسلم وصليت خلفه ‏.‏ وساق الحديث بنحو حديث أبي حيان غير أنه قال ‏\"‏ ألا وإني تارك فيكم ثقلين أحدهما كتاب الله عز وجل هو حبل الله من اتبعه كان على الهدى ومن تركه كان على ضلالة ‏\"‏ ‏.‏ وفيه فقلنا من أهل بيته نساؤه قال لا وايم الله إن المرأة تكون مع الرجل العصر من الدهر ثم يطلقها فترجع إلى أبيها وقومها أهل بيته أصله وعصبته الذين حرموا الصدقة بعده ‏.‏",
      "text_en": " Yazid b. Hayyan reported:                      We went to him (Zaid b. Arqam) and said to him. You have found goodness (for you had the honour) to live in the company of Allah's Messenger (may peace be upon him) and offered prayer behind him, and the rest of the hadith is the same but with this variation of wording that lie said: Behold, for I am leaving amongst you two weighty things, one of which is the Book of Allah, the Exalted and Glorious, and that is the rope of Allah. He who holds it fast would be on right guidance and he who abandons it would be in error, and in this (hadith) these words are also found: We said: Who are amongst the members of the household? Aren't the wives (of the Holy Prophet) included amongst the members of his house hold? Thereupon he said: No, by Allah, a woman lives with a man (as his wife) for a certain period; he then divorces her and she goes back to her parents and to her people; the members of his household include his ownself and his kith and kin (who are related to him by blood) and for him the acceptance of Zakat is prohibited.",
      "chain": [
        "30512",
        "20417",
        "20016",
        "28642",
        "384"
      ]
    },
    {
      "hadith_no": "6540",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثناه إسحاق بن إبراهيم، ومحمد بن رافع، وعبد بن حميد، عن عبد الرزاق، أخبرنا معمر، عن الزهري، عن ابن المسيب، أن حسان، قال في حلقة فيهم أبو هريرة أنشدك الله يا أبا هريرة أسمعت رسول الله صلى الله عليه وسلم ‏.‏ فذكر مثله ‏.‏",
      "text_en": " Ibn Musayyib reported that Hassan said to a circle in which there was also Abu Huraira:                      Abu Huraira, I adjure you by Allah (to tell) whether you-had not heard Allah's Messenger (may peace be upon him) saying like this.",
      "chain": [
        "30375",
        "30553",
        "20121",
        "20115",
        "11013",
        "11002",
        "20417"
      ]
    },
    {
      "hadith_no": "1083",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن عيسى، حدثنا حسان بن إبراهيم، عن ليث، عن مجاهد، عن أبي الخليل، عن أبي قتادة، عن النبي صلى الله عليه وسلم أنه كره الصلاة نصف النهار إلا يوم الجمعة وقال ‏\"‏ إن جهنم تسجر إلا يوم الجمعة ‏\"‏ ‏.‏ قال أبو داود هو مرسل مجاهد أكبر من أبي الخليل وأبو الخليل لم يسمع من أبي قتادة ‏.‏",
      "text_en": " Narrated AbuQatadah:                     The Prophet (ﷺ) disapproved of the offering of prayer at the meridian except on Friday. The Hell-fire is kindled except on Friday.Abu Dawud said: This is a mursal tradition (i.e. the successor is narrating it directly from the Prophet). Mujahid is older than Abu al-Khalil, and Abu al-Khalil did not hear (any tradition from) Abu Qatadah.",
      "chain": [
        "31167",
        "20417",
        "20023",
        "11028",
        "11291",
        "391"
      ]
    },
    {
      "hadith_no": "3254",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Oaths and Vows (Kitab Al-Aiman Wa Al-Nudhur) - كتاب الأيمان والنذور",
      "chapter_no": "22",
      "text_ar": "حدثنا حميد بن مسعدة الشامي، حدثنا حسان، - يعني ابن إبراهيم - حدثنا إبراهيم، - يعني الصائغ - عن عطاء، في اللغو في اليمين قال قالت عائشة إن رسول الله صلى الله عليه وسلم قال ‏\"‏ هو كلام الرجل في بيته كلا والله وبلى والله ‏\"‏ ‏.‏ قال أبو داود كان إبراهيم الصائغ رجلا صالحا قتله أبو مسلم بعرندس قال وكان إذا رفع المطرقة فسمع النداء سيبها ‏.‏ قال أبو داود روى هذا الحديث داود بن أبي الفرات عن إبراهيم الصائغ موقوفا على عائشة وكذلك رواه الزهري وعبد الملك بن أبي سليمان ومالك بن مغول وكلهم عن عطاء عن عائشة موقوفا ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     The Messenger of Allah (ﷺ) said about the futile oath: It is man's speech in his house: No, by Allah, and Yes, by Allah.Abu Dawud said: Ibrahim al-Sa'igh, the narrator of this tradition , was a pious man. Abu Muslim killed him at 'Aranda. When he raised a hammed and heard the call to prayer, he gave it up.Abu Dawud said: This tradition has been transmitted by Dawud b. Abi al-Furat from Ibrahim al-Sa'igh as a statement of 'Aishah (not attributed to the Prophet). Similarly, it has been transmitted by al-Zuhri, 'Abd al-Malik b. Abi Sulaiman and Malik b. Mughul. All of them transmitted it from 'Ata on the authority of 'Aishah on her own statement.",
      "chain": [
        "30430",
        "20417",
        "18011",
        "53"
      ]
    },
    {
      "hadith_no": "5241",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا عبيد الله بن عمر بن ميسرة، وحميد بن مسعدة، قالا حدثنا حسان بن إبراهيم، قال سألت هشام بن عروة عن قطع السدر، وهو مستند إلى قصر عروة فقال أترى هذه الأبواب والمصاريع إنما هي من سدر عروة كان عروة يقطعه من أرضه وقال لا بأس به ‏.‏ زاد حميد فقال هي يا عراقي جئتني ببدعة قال قلت إنما البدعة من قبلكم سمعت من يقول بمكة لعن رسول الله صلى الله عليه وسلم من قطع السدر ‏.‏ ثم ساق معناه ‏.‏",
      "text_en": " Narrated Hassan ibn Ibrahim:                     I asked Hisham ibn Urwah about the cutting of a lote-tree when he was leaning against the house of Urwah. He said: Do you not see these doors and leaves? These were made of the lote-tree of Urwah which Urwah used to cut from his hand? He said: There is no harm in it. Humayd's version adds: You have brought an innovation, O Iraqi! He said: The innovation is from you. I heard someone say at Mecca: The Messenger of Allah (ﷺ) cursed him who cuts a lote-tree. He then mentioned the rest of the tradition to the same effect.",
      "chain": [
        "30024",
        "30430",
        "20417",
        "11065"
      ]
    }
  ],
  "total_hadiths": 11
}