{
  "id": "20429",
  "name": "Skhr bin Jwyryh Abu صخر بن جويرية أبو نافع مولى بني",
  "full_name": "Skhr bin Jwyryh Abu صخر بن جويرية أبو نافع مولى بني",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Thiqah Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ خ  م  د  ت  س  -  ثقة ثقة ]"
    ],
    "tags": [
      "Client"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah Thiqah] [ خ  م  د  ت  س  -  ثقة ثقة ]",
        "ar": "Narrator[Grade:Thiqah Thiqah] [ خ  م  د  ت  س  -  ثقة ثقة ]",
        "ckb": "Narrator[Grade:Thiqah Thiqah] [ خ  م  د  ت  س  -  ثقة ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "NA",
        "ar": "NA",
        "ckb": "NA"
      }
    ],
    "tags_display": [
      {
        "en": "Client (Mawla)",
        "ar": "مولى",
        "ckb": "مەولا"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sahih-bukhari-246",
      "hadith_no": "246",
      "source": "Sahih Bukhari",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "وقال عفان حدثنا صخر بن جويرية، عن نافع، عن ابن عمر، أن النبي صلى الله عليه وسلم قال ‏\"‏ أراني أتسوك بسواك، فجاءني رجلان أحدهما أكبر من الآخر، فناولت السواك الأصغر منهما، فقيل لي كبر‏.‏ فدفعته إلى الأكبر منهما ‏\"‏‏.‏ قال أبو عبد الله اختصره نعيم عن ابن المبارك عن أسامة عن نافع عن ابن عمر‏.‏",
      "text_en": " Narrated Ibn 'Umar:                      The Prophet () said, \"I dreamt that I was cleaning my teeth with a Siwak and two persons came to me. One of them was older than the other and I gave the Siwak to the younger. I was told that I should give it to the older and so I did.\"",
      "usc_msa_ref": "",
      "chain": [
        "30106",
        "20429",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2764",
      "hadith_no": "2764",
      "source": "Sahih Bukhari",
      "chapter": "Wills and Testaments (Wasaayaa) - كتاب الوصايا",
      "chapter_no": "55",
      "text_ar": "حدثنا هارون، حدثنا أبو سعيد، مولى بني هاشم حدثنا صخر بن جويرية، عن نافع، عن ابن عمر  رضى الله عنهما  أن عمر، تصدق بمال له على عهد رسول الله صلى الله عليه وسلم وكان يقال له ثمغ، وكان نخلا، فقال عمر يا رسول الله إني استفدت مالا وهو عندي نفيس فأردت أن أتصدق به‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ تصدق بأصله، لا يباع ولا يوهب ولا يورث، ولكن ينفق ثمره ‏\"‏‏.‏ فتصدق به عمر، فصدقته ذلك في سبيل الله وفي الرقاب والمساكين والضيف وابن السبيل ولذي القربى، ولا جناح على من وليه أن يأكل منه بالمعروف، أو يوكل صديقه غير متمول به‏.‏",
      "text_en": " Narrated Ibn `Umar:                     In the lifetime of Allah's Apostle , `Umar gave in charity some of his property, a garden of date-palms called Thamgh. `Umar said, \"O Allah's Apostle! I have some property which I prize highly and I want to give it in charity.\" The Prophet; said, \"Give it in charity (i.e. as an endowment) with its land and trees on the condition that the land and trees will neither be sold nor given as a present, nor bequeathed, but the fruits are to be spent in charity.\" So `Umar gave it in charity, and it was for Allah's Cause, the emancipation of slaves, for the poor, for guests, for travelers, and for kinsmen. The person acting as its administrator could eat from it reasonably and fairly, and could let a friend of his eat from it provided he had no intention of becoming wealthy by its means.",
      "usc_msa_ref": "26",
      "chain": [
        "20195",
        "20429",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-4482",
      "hadith_no": "4482",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا محمد، حدثنا عفان، عن صخر بن جويرية، عن عبد الرحمن بن القاسم، عن أبيه، عن عائشة، دخل عبد الرحمن بن أبي بكر على النبي صلى الله عليه وسلم وأنا مسندته إلى صدري، ومع عبد الرحمن سواك رطب يستن به، فأبده رسول الله صلى الله عليه وسلم بصره، فأخذت السواك فقصمته ونفضته وطيبته، ثم دفعته إلى النبي صلى الله عليه وسلم فاستن به، فما رأيت رسول الله صلى الله عليه وسلم استن استنانا قط أحسن منه، فما عدا أن فرغ رسول الله صلى الله عليه وسلم رفع يده أو إصبعه ثم قال ‏\"‏ في الرفيق الأعلى ‏\"‏‏.‏ ثلاثا ثم قضى، وكانت تقول مات بين حاقنتي وذاقنتي‏.‏",
      "text_en": " Narrated Aisha:                     `Abdur-Rahman bin Abu Bakr entered upon the Prophet while I was supporting the Prophet on my chest. `AbdurRahman had a fresh Siwak then and he was cleaning his teeth with it. Allah's Apostle looked at it, so I took the Siwak, cut it (chewed it with my teeth), shook it and made it soft (with water), and then gave it to the Prophet who cleaned his teeth with it. I had never seen Allah's Apostle cleaning his teeth in a better way. After finishing the brushing of his teeth, he lifted his hand or his finger and said thrice, \"O Allah! Let me be with the highest companions,\" and then died. `Aisha used to say, \"He died while his head was resting between my chest and chin.\"",
      "usc_msa_ref": "722",
      "chain": [
        "30213",
        "30106",
        "20429",
        "10530",
        "10535"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6005",
      "hadith_no": "6005",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني يوسف بن موسى، حدثنا الفضل بن دكين، حدثنا صخر بن جويرية، عن نافع، عن عبد الله بن عمر  رضى الله عنهما  سمعت النبي صلى الله عليه وسلم أو قال النبي صلى الله عليه وسلم ‏\"‏ الواشمة والموتشمة، والواصلة والمستوصلة ‏\"‏‏.‏ يعني لعن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ibn `Umar:                     I heard the Prophet saying, (or the Prophet said), \"Allah has cursed the lady who practices tattooing and that who gets it done for herself, and also the lady who lengthens hair artificially and that who gets her hair lengthened artificially.\" The Prophet has cursed such ladies.",
      "usc_msa_ref": "825",
      "chain": [
        "30224",
        "20348",
        "20429",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-7105",
      "hadith_no": "7105",
      "source": "Sahih Bukhari",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا يعقوب بن إبراهيم بن كثير، حدثنا شعيب بن حرب، حدثنا صخر بن جويرية، حدثنا نافع، أن ابن عمر  رضى الله عنهما  حدثه قال قال رسول الله صلى الله عليه وسلم ‏\"‏ بينا أنا على بئر أنزع منها إذ جاء أبو بكر وعمر، فأخذ أبو بكر الدلو، فنزع ذنوبا أو ذنوبين، وفي نزعه ضعف، فغفر الله له، ثم أخذها ابن الخطاب من يد أبي بكر فاستحالت في يده غربا، فلم أر عبقريا من الناس يفري فريه، حتى ضرب الناس بعطن ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Allah's Apostle said, \"(I saw in a dream that) while I was standing at a well and drawing water therefrom, suddenly Abu Bakr and `Umar came to me. Abu Bakr took the bucket and drew one or two buckets (full of water), but there was weakness in his pulling, but Allah forgave him. Then Ibn Al- Khattab took the bucket from Abu Bakr's hand and the bucket turned into a very large one in his hand. I have never seen any strong man among the people doing such a hard job as `Umar did, till (the people drank to their satisfaction) and water their camels to their fill and they sat near the water.\"",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "20194",
        "20429",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-7114",
      "hadith_no": "7114",
      "source": "Sahih Bukhari",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثني عبيد الله بن سعيد، حدثنا عفان بن مسلم، حدثنا صخر بن جويرية، حدثنا نافع، أن ابن عمر، قال إن رجالا من أصحاب رسول الله صلى الله عليه وسلم كانوا يرون الرؤيا على عهد رسول الله صلى الله عليه وسلم فيقصونها على رسول الله صلى الله عليه وسلم فيقول فيها رسول الله صلى الله عليه وسلم ما شاء الله، وأنا غلام حديث السن وبيتي المسجد قبل أن أنكح، فقلت في نفسي لو كان فيك خير لرأيت مثل ما يرى هؤلاء‏.‏ فلما اضطجعت ليلة قلت اللهم إن كنت تعلم في خيرا فأرني رؤيا‏.‏ فبينما أنا كذلك إذ جاءني ملكان في يد كل واحد منهما مقمعة من حديد، يقبلا بي إلى جهنم، وأنا بينهما أدعو الله اللهم أعوذ بك من جهنم‏.‏ ثم أراني لقيني ملك في يده مقمعة من حديد فقال لن تراع، نعم الرجل أنت لو تكثر الصلاة‏.‏ فانطلقوا بي حتى وقفوا بي على شفير جهنم فإذا هي مطوية كطى البئر، له قرون كقرن البئر، بين كل قرنين ملك بيده مقمعة من حديد، وأرى فيها رجالا معلقين بالسلاسل، رءوسهم أسفلهم، عرفت فيها رجالا من قريش، فانصرفوا بي عن ذات اليمين‏.‏",
      "text_en": " Narrated Ibn `Umar:                     Men from the companions of Allah's Apostle used to see dreams during the lifetime of Allah's Apostle and they used to narrate those dreams to Allah's Apostle. Allah's Apostle would interpret them as Allah wished. I was a young man and used to stay in the mosque before my wedlock. I said to myself, \"If there were any good in myself, I too would see what these people see.\" So when I went to bed one night, I said, \"O Allah! If you see any good in me, show me a good dream.\" So while I was in that state, there came to me (in a dream) two angels. In the hand of each of them, there was a mace of iron, and both of them were taking me to Hell, and I was between them, invoking Allah, \"O Allah! I seek refuge with You from Hell.\" Then I saw myself being confronted by another angel holding a mace of iron in his hand. He said to me, \"Do not be afraid, you will be an excellent man if you only pray more often.\" So they took me till they stopped me at the edge of Hell, and behold, it was built inside like a well and it had side posts like those of a well, and beside each post there was an angel carrying an iron mace. I saw therein many people hanging upside down with iron chains, and I recognized therein some men from the Quraish. Then (the angels) took me to the right side. I narrated this dream to (my sister) Hafsa and she told it to Allah's Apostle. Allah's Apostle said, \"No doubt, `Abdullah is a good man.\" (Nafi` said, \"Since then `Abdullah bin `Umar used to pray much.)",
      "usc_msa_ref": "155",
      "chain": [
        "30359",
        "30106",
        "20429",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-muslim-3228",
      "hadith_no": "3228",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثني محمد بن حاتم بن ميمون، حدثنا روح بن عبادة، حدثنا صخر بن جويرية، عن نافع، أن ابن عمر، كان يرى التحصيب سنة وكان يصلي الظهر يوم النفر بالحصبة ‏.‏ قال نافع قد حصب رسول الله صلى الله عليه وسلم والخلفاء بعده ‏.‏",
      "text_en": " Nafi' reported that Ibn 'Umar regarded halt at Muhassab as Sunnah (of the Holy Prophet) and observed the noon prayer on Yaum al-Nafr at that place. Nafi' said:                      Allah's Messenger (may peace be upon him) halted at Muhassab and the Caliphs did the same after him.",
      "usc_msa_ref": "",
      "chain": [
        "30514",
        "20229",
        "20429",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-4628",
      "hadith_no": "4628",
      "source": "Sahih Muslim",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو الربيع العتكي، حدثنا حماد، حدثنا أيوب، ح وحدثنا عبد الله بن عبد، الرحمن الدارمي حدثنا عفان، حدثنا صخر بن جويرية، كلاهما عن نافع، عن ابن عمر، عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn Umar through some other Chains of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "20022",
        "11015",
        "30025",
        "30106",
        "20429",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-6071",
      "hadith_no": "6071",
      "source": "Sahih Muslim",
      "chapter": "The Book of Vision - كتاب الرؤيا",
      "chapter_no": "43",
      "text_ar": "وحدثنا نصر بن علي الجهضمي، أخبرني أبي، حدثنا صخر بن جويرية، عن نافع، أن عبد الله بن عمر، حدثه أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أراني في المنام أتسوك بسواك فجذبني رجلان أحدهما أكبر من الآخر فناولت السواك الأصغر منهما فقيل لي كبر ‏.‏ فدفعته إلى الأكبر ‏\"‏ ‏.‏",
      "text_en": " Abdullah b. 'Umar reported Allah's Messenger (may peace be upon him) as saying:                      I saw in a dream that I was using miswak and the two persons contended to get it from me, the one being older than the other one. I gave the miswak to the younger one. It was said to me to give that to the older one and I gave it to the older one.",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20264",
        "20429",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sahih-muslim-7700",
      "hadith_no": "7700",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "حدثنا نصر بن علي الجهضمي، حدثني أبي، حدثنا صخر، - يعني ابن جويرية - عن نافع، أن عبد الله بن عمر، حدثه أن رسول الله صلى الله عليه وسلم قال ‏\"‏ أراني في المنام أتسوك بسواك فجذبني رجلان أحدهما أكبر من الآخر فناولت السواك الأصغر منهما فقيل لي كبر ‏.‏ فدفعته إلى الأكبر ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. Umar reported that Allah's Messenger (may peace be upon him) said:                      It was shown in a vision that I was rinsing my mouth with miswak and two persons began to contend with one another for getting that miswak. One was older than the other. I gave the miswak to the younger one amongst them, but it was said to me: (Let it be given) to the older one. So I gave it to the older one.",
      "usc_msa_ref": "",
      "chain": [
        "30395",
        "20264",
        "20429",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Sahih Muslim",
        "ar": "صحيح مسلم",
        "ckb": "سەحیحی موسليم"
      }
    },
    {
      "id": "sunan-abi-daud-277",
      "hadith_no": "277",
      "source": "Sunan Abi Da'ud",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا يعقوب بن إبراهيم، حدثنا عبد الرحمن بن مهدي، حدثنا صخر بن جويرية، عن نافع، بإسناد الليث وبمعناه قال ‏\"‏ فلتترك الصلاة قدر ذلك ثم إذا حضرت الصلاة فلتغتسل ولتستثفر بثوب ثم تصلي ‏\"‏ ‏.‏",
      "text_en": " This tradition has been transmitted through the chain of narrators like that of al-Laith to the same effect. It says; She should abandon prayer considering that period (she used to menstruate). When the time of prayer approaches, she should take a bath, tie a cloth over her private parts and offer prayer.",
      "usc_msa_ref": "",
      "chain": [
        "20184",
        "20033",
        "20429"
      ],
      "source_display": {
        "en": "Sunan Abi Da'ud",
        "ar": "سنن أبي داود",
        "ckb": "سونەنی ئەبی داود"
      }
    },
    {
      "id": "jami-al-tirmidhi-1581",
      "hadith_no": "1581",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Military Expeditions - كتاب السير عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "21",
      "text_ar": "حدثنا أحمد بن منيع، حدثنا إسماعيل بن إبراهيم، قال حدثني صخر بن جويرية، عن نافع، عن ابن عمر، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن الغادر ينصب له لواء يوم القيامة ‏\"‏ ‏.‏ قال وفي الباب عن علي وعبد الله بن مسعود وأبي سعيد الخدري وأنس ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وسألت محمدا عن حديث سويد عن أبي إسحاق عن عمارة بن عمير عن علي عن النبي صلى الله عليه وسلم قال ‏\"‏ لكل غادر لواء ‏\"‏ ‏.‏ فقال لا أعرف هذا الحديث مرفوعا ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     The Messenger of Allah (ﷺ) said: \"Indeed the one who betrays will have a banner erected for him on the Day of Judgement.\"[He said:] There are narrations on this topic from 'Ali, 'Abdullah bin Mas'ud, Abu Sa'eed Al-Khudri, and Anas.[Abu 'Eisa said:] This Hadith is Hasan Sahih. I asked Muhammad about the Hadith of Suwaid, from Abu Ishaq, from 'Umarah bin 'Umair, from 'Ali, from the Prophet (ﷺ) who said: \"For every person who betrays there will be banner.\" He said: \"I do not know of this Hadith being Marfu'\"",
      "usc_msa_ref": "",
      "chain": [
        "30242",
        "20208",
        "20429",
        "11014",
        "18"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "jami-al-tirmidhi-4111",
      "hadith_no": "4111",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "حدثنا قتيبة، حدثنا حماد بن زيد، عن صخر بن جويرية، عن هشام بن عروة، قال أوصى الزبير إلى ابنه عبد الله صبيحة الجمل فقال ما مني عضو إلا وقد جرح مع رسول الله صلى الله عليه وسلم ‏.‏ حتى انتهى ذاك إلى فرجه ‏.‏ قال أبو عيسى هذا حديث حسن غريب من حديث حماد بن زيد ‏.‏",
      "text_en": " Narrated Hisham bin 'Urwah:                     \"On the Day of (the battle of) Al-Jamal, Az-Zubair echorted his son 'Abdullah, saying: 'There is not a part of me except that it has been injured while with the Messenger of Allah (ﷺ),' until that ended with his private parts.",
      "usc_msa_ref": "",
      "chain": [
        "30367",
        "20022",
        "20429",
        "11065"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    }
  ],
  "total_hadiths": 13,
  "grade_display": {
    "en": "Successor (Taba' Tabi') [7th Generation]",
    "ar": "تابع التابعين [الجيل السابع]",
    "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی حەوتەم]"
  }
}