{
  "id": "20426",
  "name": "Shababa bin Sawar شبابة بن سوار الفزاري",
  "full_name": "Shababa bin Sawar شبابة بن سوار الفزاري",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "206",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Mada'in",
      "Khurasan",
      "Makkah"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah Thiqah] [ ع  -  ثقة حافظ ]"
    ],
    "tags": [
      "Client",
      "al-Mada'ini",
      "Khurasan",
      "al-Fazari"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11684",
      "name": "Huraiz bin 'Uthman bin Jabir حريز بن عثمان بن جبر الرحبي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20311",
      "name": "Isra'il bin Yonus bin Abi Ishaq إسرائيل بن يونس بن أبي إسحاق",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20020",
      "name": "Shu'bah bin al-Hajjaj شعبة بن الحجاج",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20240",
      "name": "Shayban bin 'Abdur Rahman شيبان بن عبد الرحمن النحوي أبو معاوية",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10846",
      "name": "Yonus bin Abi Ishaq يونس بن أبي إسحاق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20026",
      "name": "'Abdul 'Aziz bin 'Abdullah al-Majashun عبد العزيز بن عبد الله الماجشون",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20363",
      "name": "Wrqa'a bin 'Umar ورقاء بن عمر",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20604",
      "name": "Muhammad bin Talha bin Masraf محمد بن طلحة بن مصرف",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30026",
      "name": "'Ali bin al-Madini علي بن المديني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30020",
      "name": "Yahya bin Ma'in يحيى بن معين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30351",
      "name": "'Abdullah bin Muhammad al-Musandi عبد الله بن محمد المسندي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30201",
      "name": "Abu Bakr bin Abi Shayba أبو بكر بن أبي شيبة",
      "grade": "3rd Century AH"
    },
    {
      "id": "30495",
      "name": "Ahmed bin al-Hasan bin Khrash أحمد بن الحسن بن خراش",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30298",
      "name": "Ahmed bin Abi Sarayj أحمد بن أبي سريج",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38834",
      "name": "Hajjaj bin Yusuf bin al-Sha'ir حجاج بن يوسف الشاعر",
      "grade": "3rd Century AH"
    },
    {
      "id": "30244",
      "name": "al-Hasan bin al-Sbah al-Bzar الحسن بن الصباح البزار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30245",
      "name": "al-Hasan bin Muhammad al-Za'farani الحسن بن محمد الصباح الزعفراني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30115",
      "name": "al-Hasan bin 'Ali al-Halwani الحسن بن علي الخلال الحلواني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30263",
      "name": "'Amr bin Muhammad bin Bukayr عمرو بن محمد بن بكير الناقد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30375",
      "name": "Muhammad bin Rafa'i محمد بن رافع",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30272",
      "name": "Muhammad bin 'Abdul Rahim bin Abi Zuhayr محمد بن عبد الرحيم بن أبي زهير البزاز",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30277",
      "name": "Mahmud bin Ghaylan محمود بن غيلان العدوي مولاهم أبو أحمد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30392",
      "name": "Mutr bin al-Fadl al-Mervazi مطر بن الفضل المروزي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30396",
      "name": "Yahya bin Bashr al-Bulkhi يحيى بن بشر البلخي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30221",
      "name": "Yahya bin Musa Khat يحيى بن موسى خت",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30264",
      "name": "al-Fadl bin Sahl bin Ibrahim الفضل بن سهل بن إبراهيم الأعرج",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30514",
      "name": "Muhammad bin Hatim Al-Samayn محمد بن حاتم البغدادي - السمين",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30273",
      "name": "Muhammad bin 'Ubaidullah محمد بن عبيد الله بن يزيد البغدادي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38044",
      "name": "Ahmed bin al-Frat bin Khalid أحمد بن الفرات بن خالد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30585",
      "name": "'Abbas bin Muhammad bin Hatm عباس بن محمد بن حاتم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38521",
      "name": "Muhammad bin 'Asim al-'Asbhany محمد بن عاصم الأصبهاني الفقيه",
      "grade": "3rd Century AH [12th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "332",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا أحمد بن أبي سريج، قال أخبرنا شبابة، قال أخبرنا شعبة، عن حسين المعلم، عن ابن بريدة، عن سمرة بن جندب، أن امرأة، ماتت في بطن، فصلى عليها النبي صلى الله عليه وسلم فقام وسطها‏.‏",
      "text_en": " Narrated Samura bin Jundub:                     The Prophet offered the funeral prayer for the dead body of a woman who died during delivery (i.e. childbirth) and he stood by the middle of her body.",
      "chain": [
        "30298",
        "20426",
        "20020",
        "11278",
        "11432",
        "394"
      ]
    },
    {
      "hadith_no": "899",
      "source": " Sahih Bukhari ",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا شبابة، حدثنا ورقاء، عن عمرو بن دينار، عن مجاهد، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ ائذنوا للنساء بالليل إلى المساجد ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Umar:                     The Prophet (p.b.u.h) said, \"Allow women to go to the Mosques at night.\"",
      "chain": [
        "30351",
        "20426",
        "20363",
        "11081",
        "11028",
        "18"
      ]
    },
    {
      "hadith_no": "1210",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا محمود، حدثنا شبابة، حدثنا شعبة، عن محمد بن زياد، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم أنه صلى صلاة قال ‏\"‏ إن الشيطان عرض لي، فشد على ليقطع الصلاة على، فأمكنني الله منه، فذعته، ولقد هممت أن أوثقه إلى سارية حتى تصبحوا فتنظروا إليه فذكرت قول سليمان  عليه السلام  رب هب لي ملكا لا ينبغي لأحد من بعدي‏.‏ فرده الله خاسيا ‏\"‏‏.‏ ثم قال النضر بن شميل فذعته بالذال أى خنقته وفدعته من قول الله ‏{‏يوم يدعون‏}‏ أى يدفعون والصواب، فدعته إلا أنه كذا قال بتشديد العين والتاء‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet once offered the prayer and said, \"Satan came in front of me and tried to interrupt my prayer, but Allah gave me an upper hand on him and I choked him. No doubt, I thought of tying him to one of the pillars of the mosque till you get up in the morning and see him. Then I remembered the statement of Prophet Solomon, 'My Lord ! Bestow on me a kingdom such as shall not belong to any other after me.' Then Allah made him (Satan) return with his head down (humiliated).\"",
      "chain": [
        "30277",
        "20426",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "1548",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا يحيى بن بشر، حدثنا شبابة، عن ورقاء، عن عمرو بن دينار، عن عكرمة، عن ابن عباس  رضى الله عنهما  قال كان أهل اليمن يحجون ولا يتزودون ويقولون نحن المتوكلون، فإذا قدموا مكة سألوا الناس، فأنزل الله تعالى ‏{‏وتزودوا فإن خير الزاد التقوى‏}‏‏.‏ رواه ابن عيينة عن عمرو عن عكرمة مرسلا‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The people of Yemen used to come for Hajj and used not to bring enough provisions with them and used to say that they depend on Allah. On their arrival in Medina they used to beg the people, and so Allah revealed, \"And take a provision (with you) for the journey, but the best provision is the fear of Allah.\" (2.197).",
      "chain": [
        "30483",
        "20426",
        "20363",
        "11081",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2259",
      "source": " Sahih Bukhari ",
      "chapter": "Shuf'a - كتاب الشفعة",
      "chapter_no": "36",
      "text_ar": "حدثنا حجاج، حدثنا شعبة، ح وحدثني علي بن عبد الله، حدثنا شبابة، حدثنا شعبة، حدثنا أبو عمران، قال سمعت طلحة بن عبد الله، عن عائشة  رضى الله عنها  قلت يا رسول الله، إن لي جارين، فإلى أيهما أهدي قال ‏\"‏ إلى أقربهما منك بابا ‏\"‏‏.‏",
      "text_en": " Narrated Aisha:                     I said, \"O Allah's Apostle! I have two neighbors and would like to know to which of them I should give presents.\" He replied, \"To the one whose door is nearer to you.\"",
      "chain": [
        "20219",
        "20020",
        "30026",
        "20426",
        "20020",
        "11296",
        "53"
      ]
    },
    {
      "hadith_no": "2808",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا محمد بن عبد الرحيم، حدثنا شبابة بن سوار الفزاري، حدثنا إسرائيل، عن أبي إسحاق، قال سمعت البراء  رضى الله عنه  يقول أتى النبي صلى الله عليه وسلم رجل مقنع بالحديد فقال يا رسول الله أقاتل وأسلم‏.‏ قال ‏\"‏ أسلم ثم قاتل ‏\"‏‏.‏ فأسلم ثم قاتل، فقتل، فقال رسول الله صلى الله عليه وسلم ‏\"‏ عمل قليلا وأجر كثيرا ‏\"‏‏.‏",
      "text_en": " Narrated Al-Bara:                     A man whose face was covered with an iron mask (i.e. clad in armor) came to the Prophet and said, \"O Allah's Apostle! Shall I fight or embrace Islam first? \"The Prophet said, \"Embrace Islam first and then fight.\" So he embraced Islam, and was martyred. Allah's Apostle said, A Little work, but a great reward. \"(He did very little (after embracing Islam), but he will be rewarded in abundance).",
      "chain": [
        "30272",
        "20426",
        "20311",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "3284",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا محمود، حدثنا شبابة، حدثنا شعبة، عن محمد بن زياد، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم أنه صلى صلاة فقال ‏\"‏ إن الشيطان عرض لي، فشد على يقطع الصلاة على، فأمكنني الله منه ‏\"‏‏.‏ فذكره‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet offered a prayer, and (after finishing) he said, \"Satan came in front of me trying persistently to divert my attention from the prayer, but Allah gave me the strength to over-power him.\"",
      "chain": [
        "30277",
        "20426",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "4213",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني محمد بن رافع، حدثنا شبابة بن سوار أبو عمرو الفزاري، حدثنا شعبة، عن قتادة، عن سعيد بن المسيب، عن أبيه، قال لقد رأيت الشجرة، ثم أتيتها بعد فلم أعرفها‏.‏ قال محمود ثم أنسيتها بعد‏.‏",
      "text_en": " Narrated Sa`id bin Al-Musaiyab:                     That his father said, \"I saw the Tree (of the Ar-Ridwan Pledge of allegiance and when I returned to it later, I was not able to recognize it. (The sub--narrator MahmiJd said, Al-Musaiyab said, 'Then; forgot it (i.e., the Tree).)\"",
      "chain": [
        "30375",
        "20426",
        "20020",
        "11019",
        "11002",
        "2070"
      ]
    },
    {
      "hadith_no": "4890",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا شبابة، حدثنا شعبة، عن قتادة، قال سمعت عقبة بن صهبان، عن عبد الله بن مغفل المزني، إني ممن شهد الشجرة، نهى النبي صلى الله عليه وسلم عن الخذف‏.‏",
      "text_en": " Narrated `Uqba bin Sahban:                     `Abdullah bin Mughaffal Al-Muzani who was one of those who witnessed (the event of) the tree, said, \"The Prophet forbade the throwing of small stones (with two fingers).\" `Abdullah bin Al-Mughaffal Al-Muzani also said, \"The Prophet also forbade urinating at the place where one takes a bath.\"",
      "chain": [
        "30026",
        "20426",
        "20020",
        "11019",
        "11602"
      ]
    },
    {
      "hadith_no": "5851",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثنا مطر بن الفضل، حدثنا شبابة، حدثنا شعبة، قال لقيت محارب بن دثار على فرس وهو يأتي مكانه الذي يقضي فيه فسألته عن هذا الحديث فحدثني فقال سمعت عبد الله بن عمر  رضى الله عنهما  يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من جر ثوبه مخيلة، لم ينظر الله إليه يوم القيامة ‏\"‏‏.‏ فقلت لمحارب أذكر إزاره قال ما خص إزارا ولا قميصا‏.‏ تابعه جبلة بن سحيم وزيد بن أسلم وزيد بن عبد الله عن ابن عمر عن النبي صلى الله عليه وسلم‏.‏ وقال الليث عن نافع عن ابن عمر مثله‏.‏ وتابعه موسى بن عقبة وعمر بن محمد وقدامة بن موسى عن سالم عن ابن عمر عن النبي صلى الله عليه وسلم ‏\"‏ من جر ثوبه ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     Allah's Apostle said, \"Whoever drags his clothes (on the ground) out of pride and arrogance, Allah will not look at him on the Day of Resurrection.\"",
      "chain": [
        "30392",
        "20426",
        "20020",
        "20507"
      ]
    },
    {
      "hadith_no": "6693",
      "source": " Sahih Bukhari ",
      "chapter": "Divine Will (Al-Qadar) - كتاب القدر",
      "chapter_no": "82",
      "text_ar": "وقال شبابة حدثنا ورقاء، عن ابن طاوس، عن أبيه، عن أبي هريرة، عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": "",
      "chain": [
        "20426",
        "20363",
        "11433",
        "11053",
        "13"
      ]
    },
    {
      "hadith_no": "7382",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا الحسن بن صباح، حدثنا شبابة، حدثنا ورقاء، عن عبد الله بن عبد الرحمن، سمعت أنس بن مالك، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ لن يبرح الناس يتساءلون حتى يقولوا هذا الله خالق كل شىء فمن خلق الله ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle said, \"People will not stop asking questions till they say, 'This is Allah, the Creator of everything, then who created Allah?' \"",
      "chain": [
        "30244",
        "20426",
        "20363",
        "30025",
        "19"
      ]
    },
    {
      "hadith_no": "7635",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا أحمد بن أبي سريج، أخبرنا شبابة، حدثنا شعبة، عن معاوية بن قرة، عن عبد الله بن مغفل المزني، قال رأيت رسول الله صلى الله عليه وسلم يوم الفتح على ناقة له يقرأ سورة الفتح، أو من سورة الفتح  قال  فرجع فيها  قال  ثم قرأ معاوية يحكي قراءة ابن مغفل وقال ‏\"‏ لولا أن يجتمع الناس عليكم لرجعت كما رجع ابن مغفل ‏\"‏‏.‏ يحكي النبي صلى الله عليه وسلم فقلت لمعاوية كيف كان ترجيعه قال آ آ آ ثلاث مرات‏.‏",
      "text_en": " Narrated Shu`ba:                     Mu'awiya bin Qurra reported that `Abdullah bin Al-Maghaffal Al-Muzani said, \"I saw Allah's Apostle on the day of the Conquest of Mecca, riding his she-camel and reciting Surat-al-Fath (48) or part of Surat-al-Fath. He recited it in a vibrating and pleasant voice. Then Mu'awiya recited as `Abdullah bin Mughaffal had done and said, \"Were I not afraid that the people would crowd around me, I would surely recite in a vibrating pleasant voice as Ibn Mughaffal did, imitating the Prophet.\" I asked Muawiya, \"How did he recite in that tone?\" He said thrice, \"A, A , A.\"",
      "chain": [
        "30298",
        "20426",
        "20020",
        "11306",
        "3242"
      ]
    },
    {
      "hadith_no": "40",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا شبابة، قال قال شعبة وقد لقيت شهرا فلم أعتد به ‏.‏",
      "text_en": "",
      "chain": [
        "38834",
        "20426"
      ]
    },
    {
      "hadith_no": "85",
      "source": " Sahih Muslim ",
      "chapter": "Introduction - كتاب المقدمة",
      "chapter_no": "1",
      "text_ar": "حدثنا حسن الحلواني، قال سمعت شبابة، قال كان عبد القدوس يحدثنا فيقول سويد بن عقلة ‏.‏ قال شبابة وسمعت عبد القدوس يقول نهى رسول الله صلى الله عليه وسلم أن يتخذ الروح عرضا ‏.‏ قال فقيل له أى شىء هذا قال يعني تتخذ كوة في حائط ليدخل عليه الروح ‏.‏",
      "text_en": "",
      "chain": [
        "130115",
        "20426",
        "20426"
      ]
    },
    {
      "hadith_no": "390",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "وحدثني محمد بن رافع، والفضل بن سهل الأعرج، قالا حدثنا شبابة بن سوار، حدثنا عاصم، - وهو ابن محمد العمري - عن أبيه، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الإسلام بدأ غريبا وسيعود غريبا كما بدأ وهو يأرز بين المسجدين كما تأرز الحية في جحرها ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of Ibn 'Umar ('Abdullah b. 'Umar) that the Messenger of Allah (may peace be upon him) observed:                      Verily Islam started as something strange and it would again revert (to its old position) of being strange just as it started, and it would recede between the two mosques just as the serpent crawls back into its hole.",
      "chain": [
        "30375",
        "30264",
        "20426",
        "20163",
        "11217",
        "18"
      ]
    },
    {
      "hadith_no": "321",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني محمد بن رافع، حدثنا شبابة، حدثنا ليث، عن يزيد، عن عراك، عن حفصة بنت عبد الرحمن بن أبي بكر، - وكانت تحت المنذر بن الزبير - أن عائشة، أخبرتها أنها، كانت تغتسل هي والنبي صلى الله عليه وسلم في إناء واحد يسع ثلاثة أمداد أو قريبا من ذلك ‏.‏",
      "text_en": " Hafsa, daughter of 'Abd al-Rahman b. Abu Bakr, reported that 'A'isha narrated to her that she and the Apostle of Allah (may peace be upon him) took a bath from the same vessel which contained water equal to three Mudds or thereabout.",
      "chain": [
        "30375",
        "20426",
        "20023",
        "20304",
        "11204",
        "53"
      ]
    },
    {
      "hadith_no": "442",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا محمد بن حاتم، وابن، رافع قالا حدثنا شبابة، حدثني ورقاء، عن عمرو، عن مجاهد، عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ائذنوا للنساء بالليل إلى المساجد ‏\"‏ ‏.‏ فقال ابن له يقال له واقد إذا يتخذنه دغلا ‏.‏ قال فضرب في صدره وقال أحدثك عن رسول الله صلى الله عليه وسلم وتقول لا ‏.‏",
      "text_en": " Ibn 'Umar reported:                      Grant permission to women for going to the mosque in the night. His son who was called Waqid said: Then they would make mischief. He (the narrator) said: He thumped his (son's) chest and said: I am narrating to you the hadith of the Messenger of Allah (may peace be upon him), and you say: No!",
      "chain": [
        "38487",
        "20426",
        "20363",
        "11081",
        "11028",
        "18"
      ]
    },
    {
      "hadith_no": "1287",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل ابن علية، عن سعيد بن أبي عروبة، ح قال وحدثنا زهير بن حرب، وإسحاق بن إبراهيم، كلاهما عن شبابة بن سوار، قال حدثنا شعبة، جميعا عن قتادة، في هذا الإسناد مثله ‏.‏",
      "text_en": " This hadith has been narrated by Qatada with the same chain of transmitters.",
      "chain": [
        "30201",
        "20208",
        "11073",
        "30022",
        "30123",
        "20426"
      ]
    },
    {
      "hadith_no": "1660",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثني عمرو الناقد، حدثنا شبابة بن سوار المدايني، حدثنا ليث بن سعد، عن عقيل بن خالد، عن الزهري، عن أنس، قال كان النبي صلى الله عليه وسلم إذا أراد أن يجمع بين الصلاتين في السفر أخر الظهر حتى يدخل أول وقت العصر ثم يجمع بينهما ‏.‏",
      "text_en": " Anas reported:                      When the Apostle of Allah (may peace be upon him) intended to combine two prayers on a journey, he delayed the noon prayer till came the early time of the afternoon prayer, and then combined the two.",
      "chain": [
        "30263",
        "20426",
        "20023",
        "11207",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "1818",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثني محمد بن رافع، حدثنا شبابة، حدثني ورقاء، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من يقم ليلة القدر فيوافقها - أراه قال - إيمانا واحتسابا غفر له ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported that the Messenger of Allah (may peace be upon him) prayed one night in the mosque and people also prayed along with him. He then prayed on the following night and there were many persons. Then on the third or fourth night (many people) gathered there, but the Messenger of Allah (may peace be upon him) did not come out to them (for leading the Tarawih prayer). When it was morning he said:                      I saw what you were doing, but I desisted to come to you (and lead the prayer) for I feared that this prayer might become obligatory for you. (He the narrator) said: It was the month of Ramadan.",
      "chain": [
        "30375",
        "20426",
        "20363",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2420",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني محمد بن رافع، حدثنا محمد بن عبد الله بن الزبير، حدثنا شيبان، ح وحدثني محمد بن حاتم، - واللفظ له - حدثنا شبابة، حدثني شيبان بن عبد الرحمن، عن يحيى بن أبي كثير، عن أبي سلمة بن عبد الرحمن، أنه سمع أبا هريرة، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ من أنفق زوجين في سبيل الله دعاه خزنة الجنة كل خزنة باب أى فل هلم ‏\"‏ ‏.‏ فقال أبو بكر يا رسول الله ذلك الذي لا توى عليه ‏.‏ قال رسول الله صلى الله عليه وسلم ‏\"‏ إني لأرجو أن تكون منهم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      He who spent pairs for the sake of Allah, the guardians of Paradise would call him, (in fact) every guardian of the door (of Paradise would welcome him saying): O, so and so, come on. Upon this Abu Bakr said: Messenger of Allah, (it means) there would be no distress on this person. The Messenger of Allah (may peace be upon him) said. I hope you would be among them.",
      "chain": [
        "30375",
        "20240",
        "38487",
        "20426",
        "20240",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2805",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثناه عبيد الله بن معاذ، حدثنا أبي ح، وحدثنا أبو بكر بن أبي شيبة، حدثنا شبابة، ح وحدثنا إسحاق بن إبراهيم، أخبرنا النضر بن شميل، كلهم عن شعبة، بهذا الإسناد‏.‏",
      "text_en": " This hadith has been narrated by Shu'ba with the same chain of transmitters.",
      "chain": [
        "30150",
        "20286",
        "30201",
        "20426",
        "30123",
        "20291"
      ]
    },
    {
      "hadith_no": "3236",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثني زهير بن حرب، حدثنا شبابة، حدثني ورقاء، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ منزلنا - إن شاء الله إذا فتح الله - الخيف حيث تقاسموا على الكفر ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) as saying:                      God willing, when Allah has granted us victory, our halt tomorrow will be at Khaif, where they (the unbelievers of Mecca) had taken an oath on unbelief.",
      "chain": [
        "30022",
        "20426",
        "20363",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "3511",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثني محمد بن حاتم، حدثنا شبابة، حدثنا ورقاء، عن عمرو بن دينار، بهذا الإسناد مثله ‏.‏",
      "text_en": " A hadith like this has been transmitted on the authority of Amr b. Dinar",
      "chain": [
        "38487",
        "20426",
        "20363"
      ]
    },
    {
      "hadith_no": "3573",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا شبابة، حدثنا سليمان، عن ثابث، عن أنس، ح وحدثني به عبد الله بن هاشم بن حيان، - واللفظ له - حدثنا بهز، حدثنا سليمان، بن المغيرة عن ثابت، حدثنا أنس، قال صارت صفية لدحية في مقسمه وجعلوا يمدحونها عند رسول الله صلى الله عليه وسلم - قال - ويقولون ما رأينا في السبى مثلها - قال - فبعث إلى دحية فأعطاه بها ما أراد ثم دفعها إلى أمي فقال ‏\"‏ أصلحيها ‏\"‏ ‏.‏ قال ثم خرج رسول الله صلى الله عليه وسلم من خيبر حتى إذا جعلها في ظهره نزل ثم ضرب عليها القبة فلما أصبح قال رسول الله صلى الله عليه وسلم ‏\"‏ من كان عنده فضل زاد فليأتنا به ‏\"‏ ‏.‏ قال فجعل الرجل يجيء بفضل التمر وفضل السويق حتى جعلوا من ذلك سوادا حيسا فجعلوا يأكلون من ذلك الحيس ويشربون من حياض إلى جنبهم من ماء السماء - قال - فقال أنس فكانت تلك وليمة رسول الله صلى الله عليه وسلم عليها - قال - فانطلقنا حتى إذا رأينا جدر المدينة هششنا إليها فرفعنا مطينا ورفع رسول الله صلى الله عليه وسلم مطيته - قال - وصفية خلفه قد أردفها رسول الله صلى الله عليه وسلم - قال - فعثرت مطية رسول الله صلى الله عليه وسلم فصرع وصرعت قال فليس أحد من الناس ينظر إليه ولا إليها حتى قام رسول الله صلى الله عليه وسلم فسترها - قال - فأتيناه فقال ‏\"‏ لم نضر ‏\"‏ ‏.‏ قال فدخلنا المدينة فخرج جواري نسائه يتراءينها ويشمتن بصرعتها ‏.‏",
      "text_en": " Anas, (Allah be pleased with him) reported:                      Safiyya (Allah be pleased with her) fell to the lot of Dihya in the spoils of war, and they praised her in the presence of Allah's Messenger (may peace be upon him) and said: We have not seen the like of her among the captives of war. He sent (a messenger) to Dihya and he gave him whatever he demanded. He then sent her to my mother and asked her to embellish her. Allah's Messenger (may peace be upon him) then got out of Khaibar until when he was on the other side of it, he halted, and a tent was pitched for him. When it was morning Allah's Messenger (may peace be upon him) said: He who has surplus of provision with him should bring that to us. Some persons would bring the surplus of dates, and the other surplus of mush of barley until there became a heap of bals. They began to eat the hais and began to drink out of the pond which had the water of rainfall in it and which was situated by their side. Anas said that that constituted the wedding feast of Allah's Messenger (may peace be upon him). He (further) said: We proceeded until we saw the walls of Medina, and we were delighted. We made our mounts run quickly and Allah's Messenger (may peace be upon him) also made his mount run quickly. And Safiyya (Allah be pleased with her) was at his back, and Allah's Messenger (may peace be upon him) had seated her behind him. The camel of Allah's Messenger (may peace be upon him) stumbled and he (the Holy Prophet) fell down and she also fell down. And none among the people was seeing him and her, until Allah's Messeuger (may peace be upon him) stood up and he covered her, and we came to him and he said: We have received no injury. We entered Medina and there came out the young ladies of the household. They saw her (hadrat Safiyya) and blamed her for falling down.",
      "chain": [
        "30201",
        "20426",
        "20160",
        "19",
        "20214",
        "20236",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "3701",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Suckling - كتاب الرضاع",
      "chapter_no": "18",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شبابة بن سوار، حدثنا سليمان بن المغيرة، عن ثابت، عن أنس، قال كان للنبي صلى الله عليه وسلم تسع نسوة فكان إذا قسم بينهن لا ينتهي إلى المرأة الأولى إلا في تسع فكن يجتمعن كل ليلة في بيت التي يأتيها فكان في بيت عائشة فجاءت زينب فمد يده إليها فقالت هذه زينب ‏.‏ فكف النبي صلى الله عليه وسلم يده ‏.‏ فتقاولتا حتى استخبتا وأقيمت الصلاة فمر أبو بكر على ذلك فسمع أصواتهما فقال اخرج يا رسول الله إلى الصلاة واحث في أفواههن التراب ‏.‏ فخرج النبي صلى الله عليه وسلم فقالت عائشة الآن يقضي النبي صلى الله عليه وسلم صلاته فيجيء أبو بكر فيفعل بي ويفعل ‏.‏ فلما قضى النبي صلى الله عليه وسلم صلاته أتاها أبو بكر فقال لها قولا شديدا وقال أتصنعين هذا.",
      "text_en": " Anas (Allah be pleased with him) reported that Allah's Apostle (may peace be upon him) had ninewives. So when he divided (his stay) with them, the turn of the first wife did not come but on the ninth (day). They (all the wives) used to gather every night in the house of one where he had to come (and stay that night). It was (the night when he had to stay) in the house of 'A'isha (Allah be pleased with her), when Zainab came there. He (the Holy Prophet) stretched his hand towards her (Zainab), whereupon she ('A'isha) said:                      It is Zainab. Allah's Apostle (may peace be upon him) withdrew his hand. There was an altercation between the two until their voices became loud (and it was at that time) when Iqama was pronounced for prayer. There happened to come Abu Bakr and he heard their voices and said: Messenger of Allah, (kindly) come for prayer, and throw dust in their moths. So the Prophet (may peace be upon him) went out. 'A'isha said: When Allah's Apostle (may peace be upon him) would finish his prayer there would also come Abu Bakr and he would do as he does (on such occasions, i. e. reprimanding). When Allah's Apostle (may peace be upon him) had finished his prayer, there came to her Abu Bakr. and spoke to her ('A'isha) in stern words and said: Do you behave like this?",
      "chain": [
        "30201",
        "20426",
        "20236",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "4123",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "حدثنا أحمد بن الحسن بن خراش، حدثنا شبابة، حدثنا شعبة، عن حميد، قال سمعت أنسا، يقول دعا النبي صلى الله عليه وسلم غلاما لنا حجاما فحجمه فأمر له بصاع أو مد أو مدين وكلم فيه فخفف عن ضريبته ‏.‏",
      "text_en": " Humaid reported Anas (Allah be pleased with him) having said this:                      Allah's Apostle (may peace be upon him) called for young cupper belonging to us. He capped him and he (the Holy Prophet) commanded that he should be paid one sa' or one mudd or two mudds (of wheat). It was said (that charges were high) and a reduction was made in the charges.",
      "chain": [
        "30495",
        "20426",
        "20020",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "4236",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Rules of Inheritance - كتاب الفرائض",
      "chapter_no": "24",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا إسماعيل ابن علية، عن سعيد بن أبي عروبة، ح وحدثنا زهير بن حرب، وإسحاق بن إبراهيم، وابن، رافع عن شبابة بن سوار، عن شعبة، كلاهما عن قتادة، بهذا الإسناد نحوه ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Qatada with the same chain of transmitters.",
      "chain": [
        "30201",
        "20208",
        "11073",
        "30022",
        "30123",
        "20426"
      ]
    },
    {
      "hadith_no": "4244",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Rules of Inheritance - كتاب الفرائض",
      "chapter_no": "24",
      "text_ar": "حدثني محمد بن رافع، حدثنا شبابة، قال حدثني ورقاء، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ والذي نفس محمد بيده إن على الأرض من مؤمن إلا أنا أولى الناس به فأيكم ما ترك دينا أو ضياعا فأنا مولاه وأيكم ترك مالا فإلى العصبة من كان ‏\"‏ ‏.‏",
      "text_en": " Abn Huraira (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) having said this:                      By Him in Whose Hand is the life of Muhammad, there is no believer on the earth with whom I am not the nearest among all the people. He who amongst you (dies) and leaves a debt, I am there to pay it, and he who amongst you (dies) leaving behind children I am there to look after them. And he who amongst You leaves behind property, that is for the inheritor whoever he is.",
      "chain": [
        "30375",
        "20426",
        "20363",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "4379",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثني زهير بن حرب، حدثنا شبابة، حدثني ورقاء، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ قال سليمان بن داود لأطوفن الليلة على تسعين امرأة كلها تأتي بفارس يقاتل في سبيل الله ‏.‏ فقال له صاحبه قل إن شاء الله ‏.‏ فلم يقل إن شاء الله ‏.‏ فطاف عليهن جميعا فلم تحمل منهن إلا امرأة واحدة فجاءت بشق رجل وايم الذي نفس محمد بيده لو قال إن شاء الله ‏.‏ لجاهدوا في سبيل الله فرسانا أجمعون ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace be upon him) as saying that Sulaiman b. Dawud (once) said:                      I will go round in the night to my ninety wives, and every one of them will give birth to a child (who will grow up) as a horseman and fight in the cause of Allah His companions said to him: Say\" Insha' Allah.\" but he did not say Inshii' Allah. He went round all of them but none of them became pregnant but one, and she gave birth to a premature child. And by Him in Whose hand is the life of Muhammad, if he had said, Insha' Allah (his wives would have given birth to the children who would all have grown up into horsemen and fought in the way of Allah). This hadith has been narrated on the authority of Abu Zinad with the same chain of transmitters with a variation of (these words):\" Every one of them giving birth to a child, who would have fought in the cause of Allah.\"",
      "chain": [
        "30022",
        "20426",
        "20363",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "4522",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Punishments Prescribed by Islam - كتاب الحدود",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شبابة، ح وحدثنا إسحاق بن إبراهيم، أخبرنا أبو عامر العقدي، كلاهما عن شعبة، عن سماك، عن جابر بن سمرة، عن النبي صلى الله عليه وسلم ‏.‏ نحو حديث ابن جعفر ووافقه شبابة على قوله فرده مرتين ‏.‏ وفي حديث أبي عامر فرده مرتين أو ثلاثا ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Jabir b. Samura through another chain of transmitters with the difference that along with the mentioning (of the fact) that he (the Holy Prophet) turned him away twice, or thrice.",
      "chain": [
        "30201",
        "20426",
        "30123",
        "20443",
        "20020",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "4592",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Judicial Decisions - كتاب الأقضية",
      "chapter_no": "31",
      "text_ar": "حدثني زهير بن حرب، حدثني شبابة، حدثني ورقاء، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ بينما امرأتان معهما ابناهما جاء الذئب فذهب بابن إحداهما ‏.‏ فقالت هذه لصاحبتها إنما ذهب بابنك أنت ‏.‏ وقالت الأخرى إنما ذهب بابنك ‏.‏ فتحاكمتا إلى داود فقضى به للكبرى فخرجتا على سليمان بن داود عليهما السلام فأخبرتاه فقال ائتوني بالسكين أشقه بينكما ‏.‏ فقالت الصغرى لا يرحمك الله هو ابنها ‏.‏ فقضى به للصغرى ‏\"‏ ‏.‏ قال قال أبو هريرة والله إن سمعت بالسكين قط إلا يومئذ ما كنا نقول إلا المدية ‏.‏",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace be upon him) as saying:                      While two women had been going along witn their two sons, a wolf came and made away with the child of one of them. One of them said to her companion: It is with your child that it (the wolf) has run away The other one said: It has run away with your child. They brought the matter to (Hadrat) Dawud (David) for decision and he made a decision in favour of the elder one. They then went to Sulaiman b. Dawud (may there be peace upon both of them) and told them (the story). He said: Bring me a knife so that I may cut him (the child) (into two parts) for you. The younger one said: No, it can't be, may Allah have mercy upon you, he (the child) belongs to her (the elder). So he gave a decision in favour of the younger one. abu Huraira said: If ever I heard of the word as-sikin at all, it was that day. We called it by no other name but al-Mudya.",
      "chain": [
        "30022",
        "20426",
        "20363",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "4878",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثنا إبراهيم، عن مسلم، حدثني زهير بن حرب، حدثنا شبابة، حدثني ورقاء، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ إنما الإمام جنة يقاتل من ورائه ويتقى به فإن أمر بتقوى الله عز وجل وعدل كان له بذلك أجر وإن يأمر بغيره كان عليه منه ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Huraira that the Prophet of Allah (may peace be upon him) said:                      A commander (of the Muslims) is a shield for them. They fight behind him and they are protected by (him from tyrants and aggressors). If he enjoins fear of God, the Exalted and Glorious, and dispenses justice, there will be a (great) reward for him; and if he enjoins otherwise, it redounds on him.",
      "chain": [
        "20150",
        "20285",
        "30022",
        "20426",
        "20363",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "4889",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا شبابة، حدثنا شعبة، عن سماك، بهذا الإسناد مثله وقال فجذبه الأشعث بن قيس فقال رسول الله صلى الله عليه وسلم ‏\"‏ اسمعوا وأطيعوا فإنما عليهم ما حملوا وعليكم ما حملتم ‏\"‏ ‏.‏",
      "text_en": " It has been narrated through a different chain of transmitters. on the authority of Simak who said:                      Ash'ath b. Qais pulled him (Salama b. Yazid) when the Messenger of Allah (may peace be upon him) said: Listen to them and obey them, for on them shall be the burden of what tney do and on you shall be the burden of what you do.",
      "chain": [
        "30201",
        "20426",
        "20020"
      ]
    },
    {
      "hadith_no": "4928",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثني حجاج بن الشاعر، ومحمد بن رافع، قالا حدثنا شبابة، حدثنا شعبة، عن قتادة، عن سعيد بن المسيب، عن أبيه، قال لقد رأيت الشجرة ثم أتيتها بعد فلم أعرفها.",
      "text_en": " The tradition has been narrated on the authority of Sa'id b. Musayyib who learnt it from his father. The latter said:                      I had seen the tree. When I came to the spot afterwards, I could not recognise it.",
      "chain": [
        "38834",
        "30375",
        "20426",
        "20020",
        "11019",
        "11002",
        "2070"
      ]
    },
    {
      "hadith_no": "5483",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا شبابة بن سوار، حدثنا سليمان بن المغيرة، عن ثابت، عن عبد الرحمن بن أبي ليلى، عن المقداد، قال أقبلت أنا وصاحبان، لي وقد ذهبت أسماعنا وأبصارنا من الجهد فجعلنا نعرض أنفسنا على أصحاب رسول الله صلى الله عليه وسلم فليس أحد منهم يقبلنا فأتينا النبي صلى الله عليه وسلم فانطلق بنا إلى أهله فإذا ثلاثة أعنز فقال النبي صلى الله عليه وسلم ‏\"‏ احتلبوا هذا اللبن بيننا ‏\"‏ ‏.‏ قال فكنا نحتلب فيشرب كل إنسان منا نصيبه ونرفع للنبي صلى الله عليه وسلم نصيبه - قال - فيجيء من الليل فيسلم تسليما لا يوقظ نائما ويسمع اليقظان - قال - ثم يأتي المسجد فيصلي ثم يأتي شرابه فيشرب فأتاني الشيطان ذات ليلة وقد شربت نصيبي فقال محمد يأتي الأنصار فيتحفونه ويصيب عندهم ما به حاجة إلى هذه الجرعة فأتيتها فشربتها فلما أن وغلت في بطني وعلمت أنه ليس إليها سبيل - قال - ندمني الشيطان فقال ويحك ما صنعت أشربت شراب محمد فيجيء فلا يجده فيدعو عليك فتهلك فتذهب دنياك وآخرتك ‏.‏ وعلى شملة إذا وضعتها على قدمى خرج رأسي وإذا وضعتها على رأسي خرج قدماى وجعل لا يجيئني النوم وأما صاحباى فناما ولم يصنعا ما صنعت - قال - فجاء النبي صلى الله عليه وسلم فسلم كما كان يسلم ثم أتى المسجد فصلى ثم أتى شرابه فكشف عنه فلم يجد فيه شيئا فرفع رأسه إلى السماء فقلت الآن يدعو على فأهلك ‏.‏ فقال ‏\"‏ اللهم أطعم من أطعمني وأسق من أسقاني ‏\"‏ ‏.‏ قال فعمدت إلى الشملة فشددتها على وأخذت الشفرة فانطلقت إلى الأعنز أيها أسمن فأذبحها لرسول الله صلى الله عليه وسلم فإذا هي حافلة وإذا هن حفل كلهن فعمدت إلى إناء لآل محمد صلى الله عليه وسلم ما كانوا يطمعون أن يحتلبوا فيه - قال - فحلبت فيه حتى علته رغوة فجئت إلى رسول الله صلى الله عليه وسلم فقال ‏\"‏ أشربتم شرابكم الليلة ‏\"‏ ‏.‏ قال قلت يا رسول الله اشرب ‏.‏ فشرب ثم ناولني فقلت يا رسول الله اشرب ‏.‏ فشرب ثم ناولني فلما عرفت أن النبي صلى الله عليه وسلم قد روي وأصبت دعوته ضحكت حتى ألقيت إلى الأرض - قال - فقال النبي صلى الله عليه وسلم ‏\"‏ إحدى سوآتك يا مقداد ‏\"‏ ‏.‏ فقلت يا رسول الله كان من أمري كذا وكذا وفعلت كذا ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ ما هذه إلا رحمة من الله أفلا كنت آذنتني فنوقظ صاحبينا فيصيبان منها ‏\"‏ ‏.‏ قال فقلت والذي بعثك بالحق ما أبالي إذا أصبتها وأصبتها معك من أصابها من الناس ‏.‏",
      "text_en": " Miqdad reported:                      I and two of my companions were so much afflicted by hunger that we had lost our power of seeing and hearing. We presented ourselves (as guests) to the Companions of the Holy Prophet (may peace be upon him), but none amongst them would entertain us. So we came to Allah's Apostle (may peace be upon him), and he took us to his residence and there were three goats. Allah's Apostle (may peace be upon him) said: Milk these for us. So we milked them and every person amongst us drank his share and we set aside the share of Allah's Apostle (may peace be upon him). (It was his habit) to come during the night and greet (the people present there) in a manner that would not wake up one in sleep but make one who was awake hear it. He would then go to the mosque and say prayer, then go to the milk and drink it. Miqdad added: One night the Satan came to me when I had taken my share, and he said: Muhammad has gone to the Ansar, who would offer him hospitality and he would get what is with them, and he has no need for this draught (of milk). So I took (that milk) and drank it, and when it had penetrated deeply in my stomach and I was certain that there was no way out (but to digest it), the Satan aroused (my sense of) remorse and said: Woe be to thee! what have you done? You have taken the drink reserved for Muhammad! When he would come and he would not find it, he would curse you, and you would be ruined, and thus there would go (waste) this world and the Hereafter (for) you. There was a sheet over me; as I placed (pulled) it upon my feet, my head was uncovered and as I placed it upon my head, my feet were uncovered, and I could not sleep, but my two companions had gone to sleep for they had not done what I had done. There came Allah's Apostle (may peace be upon him), and he greeted as he used to greet (by saying as-Salamu 'Alaikum). He then came to the mosque and observed prayer and then came to his drink (milk) and uncovered it, but did not find anything in it. He raised his head towards the sky, and I said (to myself) that he (the Holy Prophet) was going to invoke curse upon me and I would be thus ruined; but he (the Holy Prophet) said: Allah, feed him who fed me and give drink to him who provided me drink. I held tight the sheet upon myself (and when he had supplicated), I took hold of the knife and went to the goats (possessed by the Holy Prophet) so that I may slauhter one for Allah's Messenger (may peace be upon him) which was the fattest amongst them, and in fact all of them were milch goats; then I took hold of the vessel which belonged to the family of Allah's Messenger (may peace be upon him) in which they used to milk and drink therefrom, and milked them in that until it swelled up with foam. I came to Allah's Messenger (may peace be upon him) and he said: Have you taken your share of the milk during the night? I said: Drink it. and he drank it; he then handed over (the vessel) to me and I said: Allah's Messenger, drink it, and he drank it and handed over (the vessel) to me again, I then perceived that Allah's Apostle (may peace be upon him) had been satiated and I had got his blessings. I burst into laughter (so much) so that I fell upon the ground, whereupon Allah's Messenger (may peace be upon him) said: Miqdad, it must be one of your mischiefs. I said: Allah's Messenger, this affair of mind is like this and this. and I have done so. Thereupon. Allah's Apostle (may peace be upon him) said: This is nothing but a mercy from Allah. Why is it that you did not give me an opportunity so that we should have awakened our two friends and they would have got their share (of the milk)? I said: By Him Who has sent you with Truth. I do not mind whatever you give (to them), and whatever the (other) people happen to get, when I had got it along with you from among the people.",
      "chain": [
        "30201",
        "20426",
        "20236",
        "11269",
        "11196",
        "163"
      ]
    },
    {
      "hadith_no": "5755",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا محمد بن جعفر، حدثنا شعبة، عن  أبي مسلمة، عن أبي نضرة، عن أبي سعيد، ح  وحدثنا أحمد بن الحسن بن خراش، حدثنا شبابة، حدثنا شعبة، عن الجريري، وسعيد بن يزيد كلاهما عن أبي نضرة، قالا سمعناه يحدث، عن أبي سعيد الخدري، ‏.‏ بمعنى حديث بشر بن مفضل عن أبي مسلمة، ‏.‏",
      "text_en": " This hadith bu been narrated on the authority of Abu Sa'id Khudri through another chain of transmitters.",
      "chain": [
        "30170",
        "30160",
        "20173",
        "20020",
        "10721",
        "38",
        "30495",
        "20426",
        "20020",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "5950",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثني محمد بن رافع، حدثني حجين، - يعني ابن المثنى - حدثنا الليث، عن  عقيل، ح وحدثنا إسحاق بن إبراهيم، وعبد بن حميد، قالا أخبرنا عبد الرزاق، أخبرنا  معمر، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا شبابة بن سوار، حدثنا ابن أبي ذئب، ح وحدثني محمد بن رافع، أخبرنا إسحاق بن عيسى، أخبرنا مالك، كلهم عن الزهري، بهذا الإسناد ‏.‏ مثل معنى حديث يونس غير أن مالكا في حديثه ذكر الطيرة وليس فيه ذكر الكهان ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Zuhri with a slight variation of wording.",
      "chain": [
        "30375",
        "20382",
        "20023",
        "11207",
        "30123",
        "30553",
        "20121",
        "20115",
        "30201",
        "20426",
        "20177",
        "30375"
      ]
    },
    {
      "hadith_no": "6247",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني محمد بن رافع، حدثنا شبابة بن سوار، حدثنا شعبة، عن يونس، بهذا الإسناد ‏.‏ نحو حديث يزيد بن زريع ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Yunus with the same chain of transmitters.",
      "chain": [
        "30375",
        "20426",
        "20020"
      ]
    },
    {
      "hadith_no": "6293",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "وحدثني زهير بن حرب، حدثنا شبابة، حدثنا ورقاء، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ يغفر الله للوط إنه أوى إلى ركن شديد ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters but with a slight variation of wording.",
      "chain": [
        "30022",
        "20426",
        "20363",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "6590",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "وحدثني محمد بن رافع، حدثنا شبابة، حدثني ورقاء، عن أبي الزناد، عن الأعرج، عن أبي هريرة، ح",
      "text_en": "",
      "chain": [
        "30375",
        "20426",
        "20363",
        "11061",
        "11197"
      ]
    },
    {
      "hadith_no": "6608",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا محمد بن المثنى، وهارون بن عبد الله، قالا حدثنا عبد الصمد، ح وحدثنيه  عمرو الناقد، حدثنا شبابة بن سوار، قالا حدثنا شعبة، عن أبي بشر، بهذا الإسناد ‏.‏",
      "text_en": " This hadith has been reported on the authority of Abu Bishr with the same chain of transmitters.",
      "chain": [
        "30170",
        "30524",
        "20250",
        "20426",
        "20020"
      ]
    },
    {
      "hadith_no": "6667",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني محمد بن حاتم، حدثنا شبابة، حدثنا محمد بن طلحة، ح وحدثني أحمد، بن خراش حدثنا حبان، حدثنا وهيب، كلاهما عن ابن شبرمة، بهذا الإسناد في حديث وهيب من أبر وفي حديث محمد بن طلحة أى الناس أحق مني بحسن الصحبة ثم ذكر بمثل حديث جرير ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Ibn Shubruma with the same chain of transmitters and the hadith transmitted on the authority of Wuhaib there is a slight variation of wording. Same is the case with the hadith transmitted on the authority of Muhammad b. Talha (and the words are):                     \" Who amongst the people deserves the best treatment from me\".",
      "chain": [
        "38487",
        "20426",
        "20604",
        "20218"
      ]
    },
    {
      "hadith_no": "6742",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثني محمد بن حاتم، حدثنا شبابة، حدثنا عبد العزيز الماجشون، عن عبد الله، بن دينار عن ابن عمر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إن الظلم ظلمات يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Ibu 'Umar reported Allah's Messenger (may peace be upon him) as saying:                      Oppression is the darkness on the Day of Resurrection.",
      "chain": [
        "38487",
        "20426",
        "20026",
        "11183",
        "18"
      ]
    },
    {
      "hadith_no": "7309",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "وحدثني زهير بن حرب، حدثنا شبابة، حدثني ورقاء، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم بمثله ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters.",
      "chain": [
        "30022",
        "20426",
        "20363",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "7352",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "وحدثني محمد بن رافع، حدثنا شبابة، حدثني ورقاء، عن أبي الزناد، عن الأعرج، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ تحاجت النار والجنة فقالت النار أوثرت بالمتكبرين والمتجبرين ‏.‏ وقالت الجنة فما لي لا يدخلني إلا ضعفاء الناس وسقطهم وعجزهم ‏.‏ فقال الله للجنة أنت رحمتي أرحم بك من أشاء من عبادي ‏.‏ وقال للنار أنت عذابي أعذب بك من أشاء من عبادي ولكل واحدة منكم ملؤها فأما النار فلا تمتلئ ‏.‏ فيضع قدمه عليها فتقول قط قط ‏.‏ فهنالك تمتلئ ويزوى بعضها إلى بعض ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as say- ing:                      The Hell and the Paradise fell into dispute and the Hell said: I have been dis- tinguished by the proud and the haughty. And the Paradise said: What is the matter with me that the meek and the humble amongst people and the downtrodden and the simple enter me? Thereupon Allah said to the Paradise: You are (the means) of My Mercy whereby I show mercy to those of My servants whom 1 wish, and He said to the Hell: You are (the means) of punishment whereby 1 punish those of My servants whoml wish. Both of you will be full. The Hell will riot be filled up until Allah puts down His foot in it. The Hell would say: Enough, enough, enough, and at that time it will be filled up, all its parts integrated together.",
      "chain": [
        "30375",
        "20426",
        "20363",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "7695",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Piety and Softening of Hearts - كتاب الزهد والرقائق",
      "chapter_no": "56",
      "text_ar": "وحدثنيه عمرو الناقد، حدثنا هاشم بن القاسم، ح وحدثناه أبو بكر بن أبي شيبة، حدثنا شبابة بن سوار، كلاهما عن شعبة، بهذا الإسناد ‏.‏ نحو حديث يزيد بن زريع وليس في حديثهما فقال رجل ما من رجل بعد رسول الله صلى الله عليه وسلم أفضل منه ‏.‏",
      "text_en": "",
      "chain": [
        "20390",
        "30201",
        "20426"
      ]
    },
    {
      "hadith_no": "537",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا عثمان بن أبي شيبة، حدثنا شبابة، عن إسرائيل، عن سماك، عن جابر بن سمرة، قال كان بلال يؤذن ثم يمهل فإذا رأى النبي صلى الله عليه وسلم قد خرج أقام الصلاة ‏.‏",
      "text_en": " Jabir b. Samurah said:                      Bilal would call the Adhan, then he used come to wait. When he would see that the prophet (ﷺ) had come out (of his house), he would pronounce the iqama.",
      "chain": [
        "30203",
        "20426",
        "20311",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1015",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا إسماعيل بن أسد، أخبرنا شبابة، حدثنا ابن أبي ذئب، عن سعيد بن أبي سعيد المقبري، عن أبي هريرة، أن النبي صلى الله عليه وسلم انصرف من الركعتين من صلاة المكتوبة فقال له رجل أقصرت الصلاة يا رسول الله أم نسيت قال ‏\"‏ كل ذلك لم أفعل ‏\"‏ ‏.‏ فقال الناس قد فعلت ذلك يا رسول الله ‏.‏ فركع ركعتين أخريين ثم انصرف ولم يسجد سجدتى السهو ‏.‏ قال أبو داود رواه داود بن الحصين عن أبي سفيان مولى ابن أبي أحمد عن أبي هريرة عن النبي صلى الله عليه وسلم بهذه القصة قال ثم سجد سجدتين وهو جالس بعد التسليم ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     When the Prophet (ﷺ) finished two rak'ahs of an obligatory prayer, a man asked him: Messenger of Allah, has the prayer been shortened, or have you forgotten? he replied: I did not do all that. The people said: Messenger of Allah, you did that. Therefore, he offered another two rak'ahs or prayer and did not make two prostrations due to forgetfulness.Abu Dawud said: This tradition has also been narrated by Dawud al-Hussain from Abu Sufyan, freed slave of Ibn Abi Ahmad on the authority of Abu Hurairah from the Prophet (ﷺ). This version goes: He then made two prostrations while he was sitting after the salutation.",
      "chain": [
        "20426",
        "20177",
        "11168",
        "13"
      ]
    }
  ],
  "total_hadiths": 97
}