{
  "id": "20423",
  "name": "Khalid bin 'Abdullah al-Tahan خالد بن عبد الله بن عبد الرحمن الطحان",
  "full_name": "Khalid bin 'Abdullah al-Tahan خالد بن عبد الله بن عبد الرحمن الطحان",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "182",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Wasit"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-Mazni",
      "Client",
      "al-Wasti"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [
    {
      "id": "38497",
      "name": "Muhammad bin Khalid al-Wasti محمد بن خالد الطحان الواسطي",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "teachers": [
    {
      "id": "11418",
      "name": "Isma'il bin Abi Khalid al-Ahmsi إسماعيل بن أبي خالد الأحمسي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11326",
      "name": "Byan bin Bashr al-Ahmsi بيان بن بشر الأحمسي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11279",
      "name": "Hameed bin Abi Hameed حميد بن أبي حميد الطويل",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11289",
      "name": "Sulaiman bin Tarkhan al-Taymi سليمان بن طرخان التيمي",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11186",
      "name": "'Abdullah bin 'Abdur Rahman bin Ma'mar عبد الله بن عبد الرحمن بن معمر",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11071",
      "name": "'Abdullah bin 'Awn bin Artaban عبد الله بن عون بن أرطبان الخزار",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11282",
      "name": "Khalid bin Mahran al-Hadha' خالد بن مهران الحذاء",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11210",
      "name": "'Amr bin Yahya bin 'Ammara عمرو بن يحيى بن عمارة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11395",
      "name": "Matruf bin Tarayf al-Harithi مطرف بن طريف",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11173",
      "name": "Suhayl bin Abi Salah سهيل بن أبي صالح",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11585",
      "name": "Da'ud bin Abi Hnd داود بن أبي هند",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11352",
      "name": "Sulaiman bin Abi Sulaiman سليمان بن أبي سليمان",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11404",
      "name": "Yahya bin Sa'id bin Hiyan يحيى بن سعيد بن حيان",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11075",
      "name": "Yonus bin 'Ubaid bin Dinar يونس بن عبيد بن دينار العبدي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20650",
      "name": "Zayd bin al-Habab al-'Akli زيد بن الحباب أبو الحسين العكلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20033",
      "name": "'Abdur Rahman bin Mahdi عبد الرحمن بن مهدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30106",
      "name": "'Affan bin Muslim عفان بن مسلم بن عبد الله الصفار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30154",
      "name": "'Amr bin 'Awn/'Auf bin Aws عمرو بن عون/عوف بن أوس البزار",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30175",
      "name": "Masdad bin Masrhad مسدد بن مسرهد بن مسربل",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30116",
      "name": "Sa'id bin Mnswr bin Sh'bh سعيد بن منصور بن شعبة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38497",
      "name": "Muhammad bin Khalid al-Wasti محمد بن خالد الطحان الواسطي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30269",
      "name": "Muhammad bin al-Sabah محمد بن الصباح البزاز الدولابي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30312",
      "name": "Ishaq bin Shahyn al-Wasti إسحاق بن شاهين بن الحارث الواسطي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30367",
      "name": "Qutayba bin Sa'id bin Jamil قتيبة بن سعيد بن جميل",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "136",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا يحيى بن بكير، قال حدثنا الليث، عن خالد، عن سعيد بن أبي هلال، عن نعيم المجمر، قال رقيت مع أبي هريرة على ظهر المسجد، فتوضأ فقال إني سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إن أمتي يدعون يوم القيامة غرا محجلين من آثار الوضوء، فمن استطاع منكم أن يطيل غرته فليفعل ‏\"‏‏.‏",
      "text_en": " Narrated Nu`am Al-Mujmir:                     Once I went up the roof of the mosque, along with Abu Huraira. He perform ablution and said, \"I heard the Prophet saying, \"On the Day of Resurrection, my followers will be called \"Al-Ghurr-ul- Muhajjalun\" from the trace of ablution and whoever can increase the area of his radiance should do so (i.e. by performing ablution regularly).' \"",
      "chain": [
        "30399",
        "20023",
        "20423",
        "11169",
        "11225"
      ]
    },
    {
      "hadith_no": "191",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا مسدد، قال حدثنا خالد بن عبد الله، قال حدثنا عمرو بن يحيى، عن أبيه، عن عبد الله بن زيد، أنه أفرغ من الإناء على يديه فغسلهما، ثم غسل أو مضمض، واستنشق من كفة واحدة، ففعل ذلك ثلاثا، فغسل يديه إلى المرفقين مرتين مرتين، ومسح برأسه ما أقبل وما أدبر، وغسل رجليه إلى الكعبين، ثم قال هكذا وضوء رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated `Amr bin Yahya:                     (on the authority of his father) `Abdullah bin Zaid poured water on his hands from a utensil containing water and washed them and then with one handful of water he rinsed his mouth and cleaned his nose by putting water in it and then blowing it out. He repeated it thrice. He, then, washed his hands and forearms up to the elbows twice and passed wet hands over his head, both forwards and backwards, and washed his feet up to the ankles and said, \"This is the ablution of Allah's Apostle.\"",
      "chain": [
        "30175",
        "20423",
        "11210",
        "11232",
        "605"
      ]
    },
    {
      "hadith_no": "221",
      "source": " Sahih Bukhari ",
      "chapter": "Ablutions (Wudu') - كتاب الوضوء",
      "chapter_no": "4",
      "text_ar": "حدثنا خالد، قال حدثنا سليمان، عن يحيى بن سعيد، قال سمعت أنس بن مالك، قال جاء أعرابي فبال في طائفة المسجد، فزجره الناس، فنهاهم النبي صلى الله عليه وسلم، فلما قضى بوله أمر النبي صلى الله عليه وسلم بذنوب من ماء، فأهريق عليه‏.‏",
      "text_en": " Narrated Anas bin Malik:                     A Bedouin came and passed urine in one corner of the mosque. The people shouted at him but the Prophet stopped them till he finished urinating. The Prophet ordered them to spill a bucket of water over that place and they did so.",
      "chain": [
        "20423",
        "20160",
        "11062",
        "19"
      ]
    },
    {
      "hadith_no": "309",
      "source": " Sahih Bukhari ",
      "chapter": "Menstrual Periods - كتاب الحيض",
      "chapter_no": "6",
      "text_ar": "حدثنا إسحاق، قال حدثنا خالد بن عبد الله، عن خالد، عن عكرمة، عن عائشة، أن النبي صلى الله عليه وسلم اعتكف معه بعض نسائه وهى مستحاضة ترى الدم، فربما وضعت الطست تحتها من الدم‏.‏ وزعم أن عائشة رأت ماء العصفر فقالت كأن هذا شىء كانت فلانة تجده‏.‏",
      "text_en": " Narrated `Aisha:                     Once one of the wives of the Prophet did I`tikaf along with him and she was getting bleeding in between her periods. She used to see the blood (from her private parts) and she would perhaps put a dish under her for the blood. (The sub-narrator `Ikrima added, `Aisha once saw the liquid of safflower and said, \"It looks like what so and so used to have.\")",
      "chain": [
        "30312",
        "20423",
        "11282",
        "11023",
        "53"
      ]
    },
    {
      "hadith_no": "379",
      "source": " Sahih Bukhari ",
      "chapter": "Prayers (Salat) - كتاب الصلاة",
      "chapter_no": "8",
      "text_ar": "حدثنا مسدد، عن خالد، قال حدثنا سليمان الشيباني، عن عبد الله بن شداد، عن ميمونة، قالت كان رسول الله صلى الله عليه وسلم يصلي وأنا حذاءه وأنا حائض وربما أصابني ثوبه إذا سجد‏.‏ قالت وكان يصلي على الخمرة‏.‏",
      "text_en": " Narrates `Abdullah bin Shaddad:                     Maimuna said, \"Allah's Apostle was praying while I was in my menses, sitting beside him and sometimes his clothes would touch me during his prostration.\" Maimuna added, \"He prayed on a Khumra (a small mat sufficient just for the face and the hands while prostrating during prayers).",
      "chain": [
        "30175",
        "20423",
        "11352",
        "169",
        "61"
      ]
    },
    {
      "hadith_no": "624",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق الواسطي، قال حدثنا خالد، عن الجريري، عن ابن بريدة، عن عبد الله بن مغفل المزني، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ بين كل أذانين صلاة  ثلاثا  لمن شاء ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Mughaffal Al-Muzani:                     Allah's Apostle said thrice, \"There is a prayer between the two Adhans (Adhan and Iqama),\" and added, \"For the one who wants to pray.\"",
      "chain": [
        "30312",
        "20423",
        "11286",
        "11432",
        "3242"
      ]
    },
    {
      "hadith_no": "737",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق الواسطي، قال حدثنا خالد بن عبد الله، عن خالد، عن أبي قلابة، أنه رأى مالك بن الحويرث إذا صلى كبر ورفع يديه، وإذا أراد أن يركع رفع يديه، وإذا رفع رأسه من الركوع رفع يديه، وحدث أن رسول الله صلى الله عليه وسلم صنع هكذا‏.‏",
      "text_en": " Narrated Abu Qilaba:                     I saw Malik bin Huwairith saying Takbir and raising both his hands (on starting the prayers and raising his hands on bowing and also on raising his head after bowing. Malik bin Huwairith said, \"Allah's Apostle did the same.\"",
      "chain": [
        "30312",
        "20423",
        "11282",
        "11047"
      ]
    },
    {
      "hadith_no": "784",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا إسحاق الواسطي، قال حدثنا خالد، عن الجريري، عن أبي العلاء، عن مطرف، عن عمران بن حصين، قال صلى مع علي  رضى الله عنه  بالبصرة فقال ذكرنا هذا الرجل صلاة كنا نصليها مع رسول الله صلى الله عليه وسلم‏.‏ فذكر أنه كان يكبر كلما رفع وكلما وضع‏.‏",
      "text_en": " Narrated `Imran bin Husain:                     I offered the prayer with `Ali in Basra and he made us remember the prayer which we used to pray with Allah's Apostle. `Ali said Takbir on each rising and bowing.",
      "chain": [
        "30312",
        "20423",
        "11286",
        "11395",
        "123"
      ]
    },
    {
      "hadith_no": "828",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا يحيى بن بكير، قال حدثنا الليث، عن خالد، عن سعيد، عن محمد بن عمرو بن حلحلة، عن محمد بن عمرو بن عطاء،‏.‏ وحدثنا الليث، عن يزيد بن أبي حبيب، ويزيد بن محمد، عن محمد بن عمرو بن حلحلة، عن محمد بن عمرو بن عطاء، أنه كان جالسا مع نفر من أصحاب النبي صلى الله عليه وسلم فذكرنا صلاة النبي صلى الله عليه وسلم فقال أبو حميد الساعدي أنا كنت أحفظكم لصلاة رسول الله صلى الله عليه وسلم رأيته إذا كبر جعل يديه حذاء منكبيه، وإذا ركع أمكن يديه من ركبتيه، ثم هصر ظهره، فإذا رفع رأسه استوى حتى يعود كل فقار مكانه، فإذا سجد وضع يديه غير مفترش ولا قابضهما، واستقبل بأطراف أصابع رجليه القبلة، فإذا جلس في الركعتين جلس على رجله اليسرى ونصب اليمنى، وإذا جلس في الركعة الآخرة قدم رجله اليسرى ونصب الأخرى وقعد على مقعدته‏.‏ وسمع الليث يزيد بن أبي حبيب ويزيد من محمد بن حلحلة وابن حلحلة من ابن عطاء‏.‏ قال أبو صالح عن الليث كل فقار‏.‏ وقال ابن المبارك عن يحيى بن أيوب قال حدثني يزيد بن أبي حبيب أن محمد بن عمرو حدثه كل فقار‏.‏",
      "text_en": " Narrated Muhammad bin `Amr bin `Ata':                     I was sitting with some of the companions of Allah's Apostle and we were discussing about the way of praying of the Prophet. Abu Humaid As-Sa`idi said, \"I remember the prayer of Allah's Apostle better than any one of you. I saw him raising both his hands up to the level of the shoulders on saying the Takbir; and on bowing he placed his hands on both knees and bent his back straight, then he stood up straight from bowing till all the vertebrate took their normal positions. In prostrations, he placed both his hands on the ground with the forearms away from the ground and away from his body, and his toes were facing the Qibla. On sitting In the second rak`a he sat on his left foot and propped up the right one; and in the last rak`a he pushed his left foot forward and kept the other foot propped up and sat over the buttocks.\"",
      "chain": [
        "30399",
        "20023",
        "20423",
        "11168",
        "11537",
        "11220",
        "20023",
        "11411",
        "11537",
        "11220"
      ]
    },
    {
      "hadith_no": "1040",
      "source": " Sahih Bukhari ",
      "chapter": "Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "حدثنا عمرو بن عون، قال حدثنا خالد، عن يونس، عن الحسن، عن أبي بكرة، قال كنا عند رسول الله صلى الله عليه وسلم فانكسفت الشمس، فقام النبي صلى الله عليه وسلم يجر رداءه حتى دخل المسجد، فدخلنا فصلى بنا ركعتين، حتى انجلت الشمس فقال صلى الله عليه وسلم ‏\"‏ إن الشمس والقمر لا ينكسفان لموت أحد، فإذا رأيتموهما فصلوا، وادعوا، حتى يكشف ما بكم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakra:                     We were with Allah's Apostle when the sun eclipsed. Allah's Apostle stood up dragging his cloak till he entered the Mosque. He led us in a two-rak`at prayer till the sun (eclipse) had cleared. Then the Prophet (p.b.u.h) said, \"The sun and the moon do not eclipse because of someone's death. So whenever you see these eclipses pray and invoke (Allah) till the eclipse is over.\"",
      "chain": [
        "30154",
        "20423",
        "20475",
        "11016",
        "3229"
      ]
    },
    {
      "hadith_no": "1136",
      "source": " Sahih Bukhari ",
      "chapter": "Prayer at Night (Tahajjud) - كتاب التهجد",
      "chapter_no": "19",
      "text_ar": "حدثنا حفص بن عمر، قال حدثنا خالد بن عبد الله، عن حصين، عن أبي وائل، عن حذيفة  رضى الله عنه  أن النبي صلى الله عليه وسلم كان إذا قام للتهجد من الليل يشوص فاه بالسواك‏.‏",
      "text_en": " Narrated Hudhaifa:                     Whenever the Prophet got up for Tahajjud prayer he used to clean his mouth (and teeth) with Siwak.",
      "chain": [
        "30329",
        "20423",
        "15097",
        "11353",
        "145"
      ]
    },
    {
      "hadith_no": "1545",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا عبد الرحمن بن المبارك، حدثنا خالد، أخبرنا حبيب بن أبي عمرة، عن عائشة بنت طلحة، عن عائشة أم المؤمنين  رضى الله عنها  أنها قالت يا رسول الله، نرى الجهاد أفضل العمل، أفلا نجاهد قال ‏\"‏ لا، لكن أفضل الجهاد حج مبرور ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     (the mother of the faithful believers) I said, \"O Allah's Apostle! We consider Jihad as the best deed.\" The Prophet said, \"The best Jihad (for women) is Hajj Mabrur. \"",
      "chain": [
        "30147",
        "20423",
        "14069",
        "10504",
        "53"
      ]
    },
    {
      "hadith_no": "1625",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا مسدد، حدثنا خالد بن عبد الله، حدثنا إسماعيل بن أبي خالد، عن عبد الله بن أبي أوفى، قال اعتمر رسول الله صلى الله عليه وسلم فطاف بالبيت وصلى خلف المقام ركعتين، ومعه من يستره من الناس فقال له رجل أدخل رسول الله صلى الله عليه وسلم الكعبة قال لا‏.‏",
      "text_en": " Narrated Isma'li bin Abu Khalid:                     `Abdullah bin Abu `Aufa said, \"Allah's Apostle performed the `Umra. He performed Tawaf of the Ka`ba and offered two rak`at behind the Maqam (Abraham's place) and was accompanied by those who were screening him from the people.\" Somebody asked `Abdullah, \"Did Allah's Apostle enter the Ka`ba?\" `Abdullah replied in the negative.",
      "chain": [
        "30175",
        "20423",
        "11418",
        "5115"
      ]
    },
    {
      "hadith_no": "1639",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا مسدد، حدثنا خالد بن عبد الله، حدثنا خالد الحذاء، عن عكرمة، عن ابن عباس  رضى الله عنهما  قال طاف النبي صلى الله عليه وسلم بالبيت على بعير، كلما أتى الركن أشار إليه بشىء كان عنده وكبر‏.‏ تابعه إبراهيم بن طهمان عن خالد الحذاء‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet performed Tawaf of the Ka`ba riding a camel, and every time he came in front of the Corner (having the Black Stone), he pointed towards it with something he had with him and said Takbir.",
      "chain": [
        "30175",
        "20423",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1657",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثني إسحاق الواسطي، حدثنا خالد، عن خالد الحذاء، عن عكرمة، عن ابن عباس  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم طاف بالبيت، وهو على بعير، كلما أتى على الركن أشار إليه بشىء في يده وكبر‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle performed Tawaf (of the Ka`ba) ending a camel (at that time the Prophet had foot injury). Whenever he came to the Corner (having the Black Stone) he would point out towards it with a thing in his hand and say, \"Allahu-Akbar.\"",
      "chain": [
        "30312",
        "20423",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1660",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إسحاق، حدثنا خالد، عن خالد الحذاء، عن عكرمة، عن ابن عباس  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم جاء إلى السقاية، فاستسقى، فقال العباس يا فضل اذهب إلى أمك، فأت رسول الله صلى الله عليه وسلم بشراب من عندها‏.‏ فقال ‏\"‏ اسقني ‏\"‏‏.‏ قال يا رسول الله إنهم يجعلون أيديهم فيه‏.‏ قال ‏\"‏ اسقني ‏\"‏‏.‏ فشرب منه، ثم أتى زمزم، وهم يسقون ويعملون فيها، فقال ‏\"‏ اعملوا، فإنكم على عمل صالح  ثم قال  لولا أن تغلبوا لنزلت حتى أضع الحبل على هذه ‏\"‏‏.‏  يعني عاتقه  وأشار إلى عاتقه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle came to the drinking place and asked for water. Al-Abbas said, \"O Fadl! Go to your mother and bring water from her for Allah's Apostle .\" Allah's Apostle said, \"Give me water to drink.\" Al-Abbas said, \"O Allah's Apostle! The people put their hands in it.\" Allah's Apostle again said, 'Give me water to drink. So, he drank from that water and then went to the Zamzam (well) and there the people were offering water to the others and working at it (drawing water from the well). The Prophet then said to them, \"Carry on! You are doing a good deed.\" Then he said, \"Were I not afraid that other people would compete with you (in drawing water from Zamzam), I would certainly take the rope and put it over this (i.e. his shoulder) (to draw water).\" On saying that the Prophet pointed to his shoulder.",
      "chain": [
        "30312",
        "20423",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "1955",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا إسحاق الواسطي، حدثنا خالد، عن الشيباني، عن عبد الله بن أبي أوفى  رضى الله عنه  قال كنا مع رسول الله صلى الله عليه وسلم في سفر، وهو صائم، فلما غربت الشمس قال لبعض القوم ‏\"‏ يا فلان قم، فاجدح لنا ‏\"‏‏.‏ فقال يا رسول الله، لو أمسيت‏.‏ قال ‏\"‏ انزل، فاجدح لنا ‏\"‏‏.‏ قال يا رسول الله فلو أمسيت‏.‏ قال ‏\"‏ انزل، فاجدح لنا ‏\"‏‏.‏ قال إن عليك نهارا‏.‏ قال ‏\"‏ انزل، فاجدح لنا ‏\"‏‏.‏ فنزل فجدح لهم، فشرب النبي صلى الله عليه وسلم ثم قال ‏\"‏ إذا رأيتم الليل قد أقبل من ها هنا، فقد أفطر الصائم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Abi `Aufa:                     We were in the company of the Prophet on a journey and he was fasting, and when the sun set, he addressed somebody, \"O so-and-so, get up and mix Sawiq with water for us.\" He replied, \"O Allah's Apostle! (Will you wait) till it is evening?\" The Prophet said, \"Get down and mix Sawiq with water for us.\" He replied, \"O Allah's Apostle! (If you wait) till it is evening.\" The Prophet said again, \"Get down and mix Sawiq with water for us.\" He replied, \"It is still daytime.\"(1) The Prophet said again, \"Get down and mix Sawiq with water for us.\" He got down and mixed Sawiq for them. The Prophet drank it and then said, \"When you see night falling from this side, the fasting person should break his fast.\"",
      "chain": [
        "30312",
        "20423",
        "11352",
        "5115"
      ]
    },
    {
      "hadith_no": "1980",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا إسحاق الواسطي، حدثنا خالد، عن خالد، عن أبي قلابة، قال أخبرني أبو المليح، قال دخلت مع أبيك على عبد الله بن عمرو فحدثنا أن رسول الله صلى الله عليه وسلم ذكر له صومي فدخل على، فألقيت له وسادة من أدم، حشوها ليف، فجلس على الأرض، وصارت الوسادة بيني وبينه‏.‏ فقال ‏\"‏ أما يكفيك من كل شهر ثلاثة أيام ‏\"‏‏.‏ قال قلت يا رسول الله‏.‏ قال ‏\"‏ خمسا ‏\"‏‏.‏ قلت يا رسول الله‏.‏ قال ‏\"‏ سبعا ‏\"‏‏.‏ قلت يا رسول الله‏.‏ قال ‏\"‏ تسعا ‏\"‏‏.‏ قلت يا رسول الله‏.‏ قال ‏\"‏ إحدى عشرة ‏\"‏‏.‏ ثم قال النبي صلى الله عليه وسلم ‏\"‏ لا صوم فوق صوم داود  عليه السلام  شطر الدهر، صم يوما، وأفطر يوما ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     Allah's Apostle was informed about my fasts, and he came to me and I spread for him a leather cushion stuffed with palm fires, but he sat on the ground and the cushion remained between me and him, and then he said, \"Isn't it sufficient for you to fast three days a month?\" I replied, \"O Allah's Apostle! (I can fast more).\" He said, \"Five?\" I replied, \"O Allah's Apostle! (I can fast more).\" He said, \"Seven?\" I replied, \"O Allah's Apostle! (I can fast more).\" He said, \"Nine (days per month)?\" I replied, \"O Allah's Apostle! (I can fast more)\" He said, \"Eleven (days per month)?\" And then the Prophet said, \"There is no fast superior to that of the Prophet David it was for half of the year. So, fast on alternate days.\"",
      "chain": [
        "30312",
        "20423",
        "11282",
        "11047",
        "11453"
      ]
    },
    {
      "hadith_no": "2090",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا إسحاق، حدثنا خالد بن عبد الله، عن خالد، عن عكرمة، عن ابن عباس  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الله حرم مكة، ولم تحل لأحد قبلي، ولا لأحد بعدي، وإنما حلت لي ساعة من نهار، ولا يختلى خلاها، ولا يعضد شجرها، ولا ينفر صيدها ولا يلتقط لقطتها إلا لمعرف ‏\"‏‏.‏ وقال عباس بن عبد المطلب إلا الإذخر لصاغتنا ولسقف بيوتنا‏.‏ فقال ‏\"‏ إلا الإذخر ‏\"‏‏.‏ فقال عكرمة هل تدري ما ينفر صيدها هو أن تنحيه من الظل، وتنزل مكانه‏.‏ قال عبد الوهاب عن خالد لصاغتنا وقبورنا‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle said, \"Allah made Mecca a sanctuary and it was neither permitted for anyone before, nor will it be permitted for anyone after me (to fight in it). And fighting in it was made legal for me for a few hours of a day only. None is allowed to uproot its thorny shrubs or to cut down its trees or to chase its game or to pick up its Luqata (fallen things) except by a person who would announce it publicly.\" `Abbas bin `Abdul-Muttalib requested the Prophet, \"Except Al-Idhkhir, for our goldsmiths and for the roofs of our houses.\" The Prophet said, \"Except Al-Idhkhir.\" `Ikrima said, \"Do you know what is meant by chasing its game? It is to drive it out of the shade and sit in its place.\" Khalid said, \"(`Abbas said: Al-Idhkhir) for our goldsmiths and our graves.\"",
      "chain": [
        "30312",
        "20423",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2103",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا مسدد، حدثنا خالد  هو ابن عبد الله  حدثنا خالد، عن عكرمة، عن ابن عباس  رضى الله عنهما  قال احتجم النبي صلى الله عليه وسلم وأعطى الذي حجمه، ولو كان حراما لم يعطه‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Once the Prophet got his blood out (medically) and paid that person who had done it. If it had been illegal, the Prophet would not have paid him.",
      "chain": [
        "30175",
        "20423",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "2245",
      "source": " Sahih Bukhari ",
      "chapter": "Sales in which a Price is paid for Goods to be Delivered Later (As-Salam) - كتاب السلم",
      "chapter_no": "35",
      "text_ar": "حدثنا إسحاق، حدثنا خالد بن عبد الله، عن الشيباني، عن محمد بن أبي مجالد، بهذا وقال فنسلفهم في الحنطة والشعير‏.‏ وقال عبد الله بن الوليد عن سفيان حدثنا الشيباني وقال والزيت‏.‏ حدثنا قتيبة حدثنا جرير عن الشيباني وقال في الحنطة والشعير والزبيب‏.‏",
      "text_en": " Narrated Muhammad bin Abi Al-Mujalid:                     as above (446) and said, \"We used to pay them in advance for wheat and barley (to be delivered later). Narrated Ash-Shaibani--\"And also for oil.\"Narrated Ash-Shaibani:who said \"We used to pay in advance for wheat barley and dried grapes.\"",
      "chain": [
        "30312",
        "20423",
        "11352",
        "20012",
        "11352",
        "30367",
        "20028",
        "11352"
      ]
    },
    {
      "hadith_no": "2579",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن مقاتل أبو الحسن، أخبرنا خالد بن عبد الله، عن خالد الحذاء، عن حفصة بنت سيرين، عن أم عطية، قالت دخل النبي صلى الله عليه وسلم على عائشة  رضى الله عنها  فقال ‏\"‏ عندكم شىء ‏\"‏‏.‏ قالت لا، إلا شىء بعثت به أم عطية من الشاة التي بعث إليها من الصدقة‏.‏ قال ‏\"‏ إنها قد بلغت محلها ‏\"‏‏.‏",
      "text_en": " Narrated Um 'Atiyya:                     Once the Prophet went to `Aisha and asked her whether she had something (to eat). She said that she had nothing except the mutton which Um 'Atiyya had sent to (Buraira) in charity. The Prophet said that it had reached its destination (i.e. it is no longer an object of charity.)",
      "chain": [
        "30118",
        "20423",
        "11282",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "2784",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا مسدد، حدثنا خالد، حدثنا حبيب بن أبي عمرة، عن عائشة بنت طلحة، عن عائشة  رضى الله عنها  أنها قالت يا رسول الله ترى الجهاد أفضل العمل، أفلا نجاهد قال ‏\"‏ لكن أفضل الجهاد حج مبرور ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     (That she said), \"O Allah's Apostle! We consider Jihad as the best deed. Should we not fight in Allah's Cause?\" He said, \"The best Jihad (for women) is Hajj-Mabrur (i.e. Hajj which is done according to the Prophet's tradition and is accepted by Allah).",
      "chain": [
        "30175",
        "20423",
        "14069",
        "10504",
        "53"
      ]
    },
    {
      "hadith_no": "2919",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا أحمد بن المقدام، حدثنا خالد، حدثنا سعيد، عن قتادة، أن أنسا، حدثهم أن النبي صلى الله عليه وسلم رخص لعبد الرحمن بن عوف والزبير في قميص من حرير، من حكة كانت بهما‏.‏",
      "text_en": " Narrated Anas:                     The Prophet allowed `Abdur-Rahman bin `Auf and Az-Zubair to wear silken shirts because they had a skin disease causing itching.",
      "chain": [
        "30121",
        "20423",
        "11168",
        "11019"
      ]
    },
    {
      "hadith_no": "3119",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا مسدد، حدثنا خالد، حدثنا حصين، عن عامر، عن عروة البارقي  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ الخيل معقود في نواصيها الخير الأجر والمغنم إلى يوم القيامة ‏\"‏‏.‏",
      "text_en": " Narrated `Urwa-al-Bariqi:                     The Prophet said, \"Horses are always the source of good, namely, rewards (in the Hereafter) and booty, till the Day of Resurrection.\"",
      "chain": [
        "30175",
        "20423",
        "15097",
        "11052",
        "5176"
      ]
    },
    {
      "hadith_no": "3587",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثني ابن بكير، قال حدثني الليث، عن خالد، عن سعيد بن أبي هلال، عن ربيعة بن أبي عبد الرحمن، قال سمعت أنس بن مالك، يصف النبي صلى الله عليه وسلم قال كان ربعة من القوم، ليس بالطويل ولا بالقصير، أزهر اللون ليس بأبيض أمهق ولا آدم، ليس بجعد قطط ولا سبط رجل، أنزل عليه وهو ابن أربعين، فلبث بمكة عشر سنين ينزل عليه وبالمدينة عشر سنين، وليس في رأسه ولحيته عشرون شعرة بيضاء‏.‏ قال ربيعة فرأيت شعرا من شعره، فإذا هو أحمر فسألت فقيل احمر من الطيب‏.‏",
      "text_en": " Narrated Rabi`a bin Abi `Abdur-Rahman:                     I heard Anas bin Malik describing the Prophet saying, \"He was of medium height amongst the people, neither tall nor short; he had a rosy color, neither absolutely white nor deep brown; his hair was neither completely curly nor quite lank. Divine Inspiration was revealed to him when he was forty years old. He stayed ten years in Mecca receiving the Divine Inspiration, and stayed in Medina for ten more years. When he expired, he had scarcely twenty white hairs in his head and beard.\" Rabi`a said, \"I saw some of his hairs and it was red. When I asked about that, I was told that it turned red because of scent. \"",
      "chain": [
        "30399",
        "20023",
        "20423",
        "11169",
        "11162"
      ]
    },
    {
      "hadith_no": "3760",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "أخبرني عبد الله بن عبد الوهاب، حدثنا خالد، حدثنا شعبة، عن واقد، قال سمعت أبي يحدث، عن ابن عمر، عن أبي بكر  رضى الله عنهم  قال ارقبوا محمدا صلى الله عليه وسلم في أهل بيته‏.‏",
      "text_en": " Abu Bakr:                      Look at      Muhammad through his family (i.e. if you are no good to his family you     are not good to him).",
      "chain": [
        "30143",
        "20423",
        "20020",
        "19124",
        "18",
        "2"
      ]
    },
    {
      "hadith_no": "3770",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا مسدد، حدثنا خالد، حدثنا ابن أبي خالد، عن قيس بن أبي حازم،، قال رأيت يد طلحة التي وقى بها النبي صلى الله عليه وسلم قد شلت‏.‏",
      "text_en": " Narrated Qais bin Abi Hazim:                     I saw Talha's paralyzed hand with which he had protected the Prophet (from an arrow) .",
      "chain": [
        "30175",
        "20423",
        "11418",
        "11046"
      ]
    },
    {
      "hadith_no": "3774",
      "source": " Sahih Bukhari ",
      "chapter": "Companions of the Prophet - كتاب فضائل أصحاب النبى صلى الله عليه وسلم",
      "chapter_no": "62",
      "text_ar": "حدثنا عمرو بن عون، حدثنا خالد بن عبد الله، عن إسماعيل، عن قيس، قال سمعت سعدا  رضى الله عنه  يقول إني لأول العرب رمى بسهم في سبيل الله، وكنا نغزو مع النبي صلى الله عليه وسلم وما لنا طعام إلا ورق الشجر، حتى إن أحدنا ليضع كما يضع البعير أو الشاة، ما له خلط، ثم أصبحت بنو أسد تعزرني على الإسلام، لقد خبت إذا وضل عملي‏.‏ وكانوا وشوا به إلى عمر، قالوا لا يحسن يصلي‏.‏",
      "text_en": " Narrated Qais:                     I heard Sa`d saying, \"I was the first amongst the 'Arabs who shot an arrow for Allah's Cause. We used to fight along with the Prophets, while we had nothing to eat except the leaves of trees so that one's excrete would look like the excrete balls of camel or a sheep, containing nothing to mix them together. Today Banu Asad tribe blame me for not having understood Islam. I would be a loser if my deeds were in vain.\" Those people complained about Sa`d to `Umar, claiming that he did not offer his prayers perfectly.",
      "chain": [
        "30154",
        "20423",
        "11418",
        "11046",
        "9"
      ]
    },
    {
      "hadith_no": "3870",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا إسحاق الواسطي، حدثنا خالد، عن بيان، عن قيس، قال سمعته يقول قال جرير بن عبد الله  رضى الله عنه ما حجبني رسول الله صلى الله عليه وسلم منذ أسلمت، ولا رآني إلا ضحك‏.‏",
      "text_en": "     Narrated Jarir bin 'Abdullah:                          Allah's Apostle has never refused to admit me since I embraced Islam, and whenever he saw me, he would smile.",
      "chain": [
        "30312",
        "20423",
        "11326",
        "11046",
        "4057"
      ]
    },
    {
      "hadith_no": "4353",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "فلقيت أبا معبد فسألته فقال صدق مجاشع‏.‏ وقال خالد عن أبي عثمان عن مجاشع أنه جاء بأخيه مجالد‏.‏",
      "text_en": "",
      "chain": [
        "20423",
        "11113"
      ]
    },
    {
      "hadith_no": "4386",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني إسحاق، حدثنا خالد، عن الشيباني، عن سعيد بن أبي بردة، عن أبيه، عن أبي موسى الأشعري  رضى الله عنه  أن النبي صلى الله عليه وسلم بعثه إلى اليمن، فسأله عن أشربة تصنع بها، فقال ‏\"‏ وما هي ‏\"‏‏.‏ قال البتع والمزر‏.‏ فقلت لأبي بردة ما البتع قال نبيذ العسل، والمزر نبيذ الشعير‏.‏ فقال ‏\"‏ كل مسكر حرام ‏\"‏‏.‏ رواه جرير وعبد الواحد عن الشيباني عن أبي بردة‏.‏",
      "text_en": " Narrated Abi Burda:                     That Abu Musa Al-Ash`ari said that the Prophet had sent him to Yemen and he asked the Prophet about certain (alcoholic) drink which used to be prepared there The Prophet said, \"What are they?\" Abu Musa said, \"Al-Bit' and Al-Mizr?\" He said, \"Al-Bit is an alcoholic drink made from honey; and Al-Mizr is an alcoholic drink made from barley.\" The Prophet said, \"All intoxicants are prohibited.\"",
      "chain": [
        "30312",
        "20423",
        "11352",
        "11345",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "4398",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا مسدد، حدثنا خالد، حدثنا بيان، عن قيس، عن جرير، قال كان بيت في الجاهلية يقال له ذو الخلصة والكعبة اليمانية والكعبة الشأمية، فقال لي النبي صلى الله عليه وسلم ‏\"‏ ألا تريحني من ذي الخلصة ‏\"‏‏.‏ فنفرت في مائة وخمسين راكبا، فكسرناه وقتلنا من وجدنا عنده، فأتيت النبي صلى الله عليه وسلم فأخبرته، فدعا لنا ولأحمس‏.‏",
      "text_en": " Narrated Jarir:                     In the Pre-lslamic Period of Ignorance there was a house called Dhu-l-Khalasa or Al-Ka`ba Al- Yamaniya or Al-Ka`ba Ash-Shamiya. The Prophet said to me, \"Won't you relieve me from Dhu-l- Khalasa?\" So I set out with one-hundred-and-fifty riders, and we dismantled it and killed whoever was present there. Then I came to the Prophet and informed him, and he invoked good upon us and Al- Ahmas (tribe) .",
      "chain": [
        "30175",
        "20423",
        "11326",
        "11046",
        "4057"
      ]
    },
    {
      "hadith_no": "4401",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسحاق، أخبرنا خالد بن عبد الله، عن خالد الحذاء، عن أبي عثمان، أن رسول الله صلى الله عليه وسلم بعث عمرو بن العاص على جيش ذات السلاسل قال فأتيته فقلت أى الناس أحب إليك قال ‏\"‏ عائشة ‏\"‏‏.‏ قلت من الرجال قال ‏\"‏ أبوها ‏\"‏‏.‏ قلت ثم من قال ‏\"‏ عمر ‏\"‏‏.‏ فعد رجالا فسكت مخافة أن يجعلني في آخرهم‏.‏",
      "text_en": " Narrated Abu `Uthman:                     Allah's Apostle sent `Amr bin Al As as the commander of the troops of Dhat-us-Salasil. `Amr bin Al- `As said, \"(On my return) I came to the Prophet and said, 'Which people do you love most?' He replied, `Aisha.' I said, 'From amongst the men?' He replied, 'Her father (Abu Bakr)'. I said, 'Whom (do you love) next?' He replied, \"`Umar.' Then he counted the names of many men, and I became silent for fear that he might regard me as the last of them.\"",
      "chain": [
        "30312",
        "20423",
        "11282",
        "11113"
      ]
    },
    {
      "hadith_no": "4658",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عمرو بن عون، حدثنا خالد، عن إسماعيل، عن قيس، عن عبد الله، رضى الله عنه قال كنا نغزو مع النبي صلى الله عليه وسلم وليس معنا نساء فقلنا ألا نختصي فنهانا عن ذلك، فرخص لنا بعد ذلك أن نتزوج المرأة بالثوب، ثم قرأ ‏{‏يا أيها الذين آمنوا لا تحرموا طيبات ما أحل الله لكم ‏}‏",
      "text_en": " Narrated `Abdullah:                     We used to participate in the holy wars carried on by the Prophet and we had no women (wives) with us. So we said (to the Prophet ). \"Shall we castrate ourselves?\" But the Prophet forbade us to do that and thenceforth he allowed us to marry a woman (temporarily) by giving her even a garment, and then he recited: \"O you who believe! Do not make unlawful the good things which Allah has made lawful for you.\"",
      "chain": [
        "30154",
        "20423",
        "11418",
        "11046",
        "16"
      ]
    },
    {
      "hadith_no": "4926",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني إسحاق، حدثنا خالد، عن خالد، عن عكرمة، عن ابن عباس، أن النبي صلى الله عليه وسلم قال وهو في قبة له يوم بدر ‏\"‏ أنشدك عهدك ووعدك، اللهم إن شئت لم تعبد بعد اليوم أبدا ‏\"‏‏.‏ فأخذ أبو بكر بيده وقال حسبك يا رسول الله فقد ألححت على ربك‏.‏ وهو في الدرع فخرج وهو يقول ‏\"‏ ‏{‏سيهزم الجمع ويولون الدبر * بل الساعة موعدهم والساعة أدهى وأمر‏}‏‏\"‏",
      "text_en": " Narrated Ibn `Abbas:                     While in his tent on the day the Battle of Badr, the Prophet said, \"O Allah! I request You (to fulfill) Your promise and contract. O Allah! It You wish that the Believers be destroyed). You will never be worshipped henceforth.\" On that, Abu Bakr held the Prophet by the hand and said, \"That is enough, O Allah's Apostle! You have appealed to your Lord too pressingly\" The Prophet was wearing his armor and then went out reciting: 'Their multitude will be put to flight and they will show their backs. Nay, but the Hour is their appointed time (for their full recompense), and the Hour will be more previous and most bitter.' (54.45-46)",
      "chain": [
        "30312",
        "20423",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "4948",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثني حفص بن عمر، حدثنا خالد بن عبد الله، حدثنا حصين، عن سالم بن أبي الجعد، وعن أبي سفيان، عن جابر بن عبد الله  رضى الله عنهما  قال أقبلت عير يوم الجمعة ونحن مع النبي صلى الله عليه وسلم فثار الناس إلا اثنا عشر رجلا فأنزل الله ‏{‏وإذا رأوا تجارة أو لهوا انفضوا إليها‏}‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     A caravan of merchandise arrived at Medina on a Friday while we were with the Prophet All the people left (the Prophet and headed for the caravan) except twelve persons. Then Allah revealed:-- 'But when they see some bargain or some amusement they disperse headlong to it.' ..(62.11)",
      "chain": [
        "30329",
        "20423",
        "15097",
        "11342",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "5329",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا إسحاق الواسطي، حدثنا خالد، عن خالد الحذاء، عن عكرمة، أن أخت عبد الله بن أبى، بهذا، وقال ‏\"‏ تردين حديقته ‏\"‏‏.‏ قالت نعم‏.‏ فردتها وأمره يطلقها‏.‏ وقال إبراهيم بن طهمان عن خالد عن عكرمة عن النبي صلى الله عليه وسلم وطلقها‏.‏",
      "text_en": " Narrated `Ikrima:                     The sister of `Abdullah bin Ubai narrated (the above narration, 197) with the addition that the Prophet said to Thabit's wife, \"Will you return his garden?\" She said, \"Yes,\" and returned it, and (then) the Prophet ordered Thabit to divorce her. Narrated Ibn `Abbas: The wife of Thabit bin Qais came to Allah's Apostle and said, \"O Allah's Apostle! I do not blame Thabit for any defects in his character or his religion, but I cannot endure to live with him.\" On that Allah's Apostle said, \"Will you return his garden to him?\" She said, \"Yes.\"",
      "chain": [
        "30312",
        "20423",
        "11282",
        "11023",
        "20187",
        "11282",
        "11023"
      ]
    },
    {
      "hadith_no": "5474",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا عمرو بن عون، حدثنا خالد بن عبد الله، عن أبي طوالة، عن أنس، عن النبي صلى الله عليه وسلم قال فضل عائشة على النساء كفضل الثريد على سائر الطعام ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"The superiority of `Aisha to other women is like the superiority of Tharid to other kinds of food . \"",
      "chain": [
        "30154",
        "20423",
        "11186",
        "19"
      ]
    },
    {
      "hadith_no": "5483",
      "source": " Sahih Bukhari ",
      "chapter": "Food; Meals - كتاب الأطعمة",
      "chapter_no": "70",
      "text_ar": "حدثنا مسدد، حدثنا خالد، حدثنا عبد الله بن عبد الرحمن، عن أنس، عن النبي صلى الله عليه وسلم قال ‏\"‏ فضل عائشة على النساء كفضل الثريد على سائر الطعام ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     The Prophet said, \"The superiority of `Aisha to other ladies is like the superiority of Tharid to other kinds of food.\"",
      "chain": [
        "30175",
        "20423",
        "30025",
        "19"
      ]
    },
    {
      "hadith_no": "5614",
      "source": " Sahih Bukhari ",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا مسدد، حدثنا خالد بن عبد الله، حدثنا مطرف، عن عامر، عن البراء بن عازب  رضى الله عنهما  قال ضحى خال لي يقال له أبو بردة قبل الصلاة، فقال له رسول الله صلى الله عليه وسلم ‏\"‏ شاتك شاة لحم ‏\"‏‏.‏ فقال يا رسول الله إن عندي داجنا جذعة من المعز‏.‏ قال ‏\"‏ اذبحها ولن تصلح لغيرك ‏\"‏‏.‏ ثم قال ‏\"‏ من ذبح قبل الصلاة فإنما يذبح لنفسه، ومن ذبح بعد الصلاة فقد تم نسكه، وأصاب سنة المسلمين ‏\"‏‏.‏ تابعه عبيدة عن الشعبي وإبراهيم‏.‏ وتابعه وكيع عن حريث عن الشعبي‏.‏ وقال عاصم وداود عن الشعبي عندي عناق لبن‏.‏ وقال زبيد وفراس عن الشعبي عندي جذعة‏.‏ وقال أبو الأحوص حدثنا منصور عناق جذعة‏.‏ وقال ابن عون عناق جذع، عناق لبن‏.‏",
      "text_en": " Narrated Al-Bara' bin `Azib:                     An uncle of mine called Abu Burda, slaughtered his sacrifice before the `Id prayer. So Allah's Apostle said to him, \"Your (slaughtered) sheep was just mutton (not a sacrifice).\" Abu Burda said, \"O Allah's Apostle! I have got a domestic kid.\" The Prophet said, \"Slaughter it (as a sacrifice) but it will not be permissible for anybody other than you\" The Prophet added, \"Whoever slaughtered his sacrifice before the (`Id) prayer, he only slaughtered for himself, and whoever slaughtered it after the prayer, he offered his sacrifice properly and followed the tradition of the Muslims.\"",
      "chain": [
        "30175",
        "20423",
        "11395",
        "11052",
        "400"
      ]
    },
    {
      "hadith_no": "5724",
      "source": " Sahih Bukhari ",
      "chapter": "Patients - كتاب المرضى",
      "chapter_no": "75",
      "text_ar": "حدثنا إسحاق، حدثنا خالد بن عبد الله، عن خالد، عن عكرمة، عن ابن عباس  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم دخل على رجل يعوده فقال ‏\"‏ لا بأس طهور إن شاء الله ‏\"‏‏.‏ فقال كلا بل حمى تفور على شيخ كبير كيما تزيره القبور‏.‏ قال النبي صلى الله عليه وسلم ‏\"‏ فنعم إذا ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Allah's Apostle entered upon sick man to pay him a visit, and said to him, \"Don't worry, Allah willing, (your sickness will be) an expiation for your sins.\" The man said, \"No, it is but a fever that is boiling within an old man and will send him to his grave.\" On that, the Prophet said, \"Then yes, it is so.\"",
      "chain": [
        "30312",
        "20423",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "6042",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثني إسحاق، حدثنا خالد الواسطي، عن الجريري، عن عبد الرحمن بن أبي بكرة، عن أبيه  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ ألا أنبئكم بأكبر الكبائر ‏\"‏‏.‏ قلنا بلى يا رسول الله‏.‏ قال ‏\"‏ الإشراك بالله، وعقوق الوالدين ‏\"‏‏.‏ وكان متكئا فجلس فقال ‏\"‏ ألا وقول الزور وشهادة الزور، ألا وقول الزور وشهادة الزور ‏\"‏‏.‏ فما زال يقولها حتى قلت لا يسكت‏.‏",
      "text_en": " Narrated Abu Bakra:                     Allah's Apostle said thrice, \"Shall I not inform you of the biggest of the great sins?\" We said, \"Yes, O Allah's Apostle\" He said, \"To join partners in worship with Allah: to be undutiful to one's parents.\" The Prophet sat up after he had been reclining and added, \"And I warn you against giving forged statement and a false witness; I warn you against giving a forged statement and a false witness.\" The Prophet kept on saying that warning till we thought that he would not stop.",
      "chain": [
        "30312",
        "20423",
        "11286",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "6257",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا مسدد، حدثنا خالد، حدثنا حصين، عن سالم، عن جابر  رضى الله عنه  قال ولد لرجل منا غلام فسماه القاسم فقالوا لا نكنيه حتى نسأل النبي صلى الله عليه وسلم فقال ‏\"‏ سموا باسمي، ولا تكتنوا بكنيتي ‏\"‏‏.‏",
      "text_en": " Narrated Jabi:                     A man among us begot a boy whom he named Al-Qasim. The people said, \"We will not call him (i.e., the father) by that Kuniya (Abu-l-Qasim) till we ask the Prophet about it. The Prophet said. \"Name yourselves by my name, but do not call (yourselves) by my Kuniya.\"",
      "chain": [
        "30175",
        "20423",
        "15097",
        "11011",
        "34"
      ]
    },
    {
      "hadith_no": "6351",
      "source": " Sahih Bukhari ",
      "chapter": "Asking Permission - كتاب الاستئذان",
      "chapter_no": "79",
      "text_ar": "حدثنا إسحاق، حدثنا خالد،‏.‏ وحدثني عبد الله بن محمد، حدثنا عمرو بن عون، حدثنا خالد، عن خالد، عن أبي قلابة، قال أخبرني أبو المليح، قال دخلت مع أبيك زيد على عبد الله بن عمرو فحدثنا أن النبي صلى الله عليه وسلم ذكر له صومي، فدخل على، فألقيت له وسادة من أدم حشوها ليف، فجلس على الأرض، وصارت الوسادة بيني وبينه، فقال لي ‏\"‏ أما يكفيك من كل شهر ثلاثة أيام ‏\"‏‏.‏ قلت يا رسول الله‏.‏ قال ‏\"‏ خمسا ‏\"‏‏.‏ قلت يا رسول الله‏.‏ قال ‏\"‏ سبعا ‏\"‏‏.‏ قلت يا رسول الله‏.‏ قال ‏\"‏ تسعا ‏\"‏‏.‏ قلت يا رسول الله‏.‏ قال ‏\"‏ إحدى عشرة ‏\"‏‏.‏ قلت يا رسول الله‏.‏ قال ‏\"‏ لا صوم فوق صوم داود، شطر الدهر، صيام يوم، وإفطار يوم ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     The news of my fasting was mentioned to the Prophet . So he entered upon me and I put for him a leather cushion stuffed with palm-fibres. The Prophet sat on the floor and the cushion was between me and him. He said to me, \"Isn't it sufficient for you (that you fast) three days a month?\" I said, \"O Allah's Apostle! (I can fast more than this).\" He said, \"You may fast) five days a month.\" I said, \"O Allah's Apostle! (I can fast more than this).\" He said, \"(You may fast) seven days.\" I said, \"O Allah's Apostle!\" He said, \"Nine.\" I said, \"O Allah's Apostle!\" He said, \"Eleven.\" I said, \"O Allah's Apostle!\" He said, \"No fasting is superior to the fasting of (the Prophet David) which was one half of a year, and he used, to fast on alternate days. (See Hadith No. 300, Vol 3)",
      "chain": [
        "30312",
        "30351",
        "30154",
        "20423",
        "11282",
        "11047",
        "11453"
      ]
    },
    {
      "hadith_no": "6599",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن خالد، عن سعيد بن أبي هلال، عن زيد بن أسلم، عن عطاء بن يسار، عن أبي سعيد الخدري، قال النبي صلى الله عليه وسلم ‏\"‏ تكون الأرض يوم القيامة خبزة واحدة، يتكفؤها الجبار بيده، كما يكفأ أحدكم خبزته في السفر، نزلا لأهل الجنة ‏\"‏‏.‏ فأتى رجل من اليهود فقال بارك الرحمن عليك يا أبا القاسم، ألا أخبرك بنزل أهل الجنة يوم القيامة قال ‏\"‏ بلى ‏\"‏‏.‏ قال تكون الأرض خبزة واحدة كما قال النبي صلى الله عليه وسلم فنظر النبي صلى الله عليه وسلم إلينا، ثم ضحك حتى بدت نواجذه ثم قال ألا أخبرك بإدامهم قال إدامهم بالام ونون‏.‏ قالوا وما هذا قال ثور ونون يأكل من زائدة كبدهما سبعون ألفا‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri:                     The Prophet said, \"The (planet of) earth will be a bread on the Day of Resurrection, and The resistible (Allah) will topple turn it with His Hand like anyone of you topple turns a bread with his hands while (preparing the bread) for a journey, and that bread will be the entertainment for the people of Paradise.\" A man from the Jews came (to the Prophet) and said, \"May The Beneficent (Allah) bless you, O Abul Qasim! Shall I tell you of the entertainment of the people of Paradise on the Day of Resurrection?\" The Prophet said, \"Yes.\" The Jew said, \"The earth will be a bread,\" as the Prophet had said. Thereupon the Prophet looked at us and smiled till his premolar tooth became visible. Then the Jew further said, \"Shall I tell you of the udm (additional food taken with bread) they will have with the bread?\" He added, \"That will be Balam and Nun.\" The people asked, \"What is that?\" He said, \"It is an ox and a fish, and seventy thousand people will eat of the caudate lobe (i.e. extra lobe) of their livers.\"",
      "chain": [
        "30399",
        "20023",
        "20423",
        "11169",
        "11163",
        "11020",
        "38"
      ]
    },
    {
      "hadith_no": "6852",
      "source": " Sahih Bukhari ",
      "chapter": "Laws of Inheritance (Al-Faraa'id) - كتاب الفرائض",
      "chapter_no": "85",
      "text_ar": "حدثنا مسدد، حدثنا خالد  هو ابن عبد الله  حدثنا خالد، عن أبي عثمان، عن سعد  رضى الله عنه  قال سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ من ادعى إلى غير أبيه، وهو يعلم أنه غير أبيه، فالجنة عليه حرام ‏\"‏‏.‏   فذكرته لأبي بكرة فقال وأنا سمعته أذناى، ووعاه، قلبي من رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Sa`d:                     I heard the Prophet saying, \"Whoever claims to be the son of a person other than his father, and he knows that person is not his father, then Paradise will be forbidden for him.\" I mentioned that to Abu Bakra, and he said, \"My ears heard that and my heart memorized it from Allah's Apostle.",
      "chain": [
        "30175",
        "20423",
        "11282",
        "11113",
        "9"
      ]
    },
    {
      "hadith_no": "6902",
      "source": " Sahih Bukhari ",
      "chapter": "Punishment of Disbelievers at War with Allah and His Apostle - كتاب المحاربين من أهل الكفر والردة",
      "chapter_no": "87",
      "text_ar": "حدثني إسحاق، حدثنا خالد، عن الشيباني، سألت عبد الله بن أبي أوفى هل رجم رسول الله صلى الله عليه وسلم قال نعم‏.‏ قلت قبل سورة النور أم بعد قال لا أدري‏.‏",
      "text_en": " Narrated Ash Shaibani:                     I asked `Abdullah bin Abi `Aufa, 'Did Allah's Apostle carry out the Rajam penalty ( i.e., stoning to death)?' He said, \"Yes.\" I said, \"Before the revelation of Surat-an-Nur or after it?\" He replied, \"I don't Know.\"",
      "chain": [
        "30312",
        "20423",
        "11352"
      ]
    },
    {
      "hadith_no": "7129",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "وقال قتيبة حدثنا أبو عوانة، عن قتادة، عن عكرمة، عن أبي هريرة، قوله من كذب في رؤياه‏.‏ وقال شعبة عن أبي هاشم الرماني سمعت عكرمة قال أبو هريرة قوله من صور، ومن تحلم، ومن استمع‏.‏ حدثني إسحاق حدثنا خالد عن خالد عن عكرمة عن ابن عباس قال ‏\"‏ من استمع، ومن تحلم، ومن صور ‏\"‏‏.‏ نحوه‏.‏ تابعه هشام عن عكرمة عن ابن عباس قوله‏.‏",
      "text_en": "",
      "chain": [
        "30367",
        "20469",
        "11019",
        "11023",
        "20020",
        "11454",
        "11023",
        "30312",
        "20423",
        "11282",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "7184",
      "source": " Sahih Bukhari ",
      "chapter": "Afflictions and the End of the World - كتاب الفتن",
      "chapter_no": "93",
      "text_ar": "حدثنا إسحاق الواسطي، حدثنا خالد، عن بيان، عن وبرة بن عبد الرحمن، عن سعيد بن جبير، قال خرج علينا عبد الله بن عمر فرجونا أن يحدثنا، حديثا حسنا  قال  فبادرنا إليه رجل فقال يا أبا عبد الرحمن حدثنا عن القتال في الفتنة والله يقول ‏{‏وقاتلوهم حتى لا تكون فتنة‏}‏ فقال هل تدري ما الفتنة ثكلتك أمك، إنما كان محمد صلى الله عليه وسلم يقاتل المشركين، وكان الدخول في دينهم فتنة، وليس كقتالكم على الملك‏.‏",
      "text_en": " Narrated Sa`id bin Jubair:                     `Abdullah bin `Umar came to us and we hoped that he would narrate to us a good Hadith. But before we asked him, a man got up and said to him, \"O Abu `Abdur-Rahman! Narrate to us about the battles during the time of the afflictions, as Allah says:-- 'And fight them until there is no more afflictions (i.e. no more worshipping of others besides Allah).'\" (2.193) Ibn `Umar said (to the man), \"Do you know what is meant by afflictions? Let your mother bereave you! Muhammad used to fight against the pagans, for a Muslim was put to trial in his religion (The pagans will either kill him or chain him as a captive). His fighting was not like your fighting which is carried on for the sake of ruling.\"",
      "chain": [
        "30312",
        "20423",
        "11326",
        "11662",
        "11050"
      ]
    }
  ],
  "total_hadiths": 363
}