{
  "id": "20424",
  "name": "Da'ud bin Abi al-Frat داود بن أبي الفرات عمرو",
  "full_name": "Da'ud bin Abi al-Frat داود بن أبي الفرات عمرو",
  "grade": "Succ. (Taba' Tabi') [8th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  ت  س  ق  -  ثقة ]"
    ],
    "tags": [
      "al-Kundi"
    ],
    "area_of_interest_display": [
      {
        "en": "Narrator[Grade:Thiqah] [ خ  ت  س  ق  -  ثقة ]",
        "ar": "Narrator[Grade:Thiqah] [ خ  ت  س  ق  -  ثقة ]",
        "ckb": "Narrator[Grade:Thiqah] [ خ  ت  س  ق  -  ثقة ]"
      }
    ],
    "places_of_stay_display": [
      {
        "en": "NA",
        "ar": "NA",
        "ckb": "NA"
      }
    ],
    "tags_display": [
      {
        "en": "al-Kundi",
        "ar": "al-Kundi",
        "ckb": "al-Kundi"
      }
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [],
  "students": [],
  "hadiths": [
    {
      "id": "sahih-bukhari-1368",
      "hadith_no": "1368",
      "source": "Sahih Bukhari",
      "chapter": "Funerals (Al-Janaa'iz) - كتاب الجنائز",
      "chapter_no": "23",
      "text_ar": "حدثنا عفان بن مسلم، حدثنا داود بن أبي الفرات، عن عبد الله بن بريدة، عن أبي الأسود، قال قدمت المدينة وقد وقع بها مرض، فجلست إلى عمر بن الخطاب  رضى الله عنه  فمرت بهم جنازة فأثني على صاحبها خيرا فقال عمر  رضى الله عنه  وجبت‏.‏ ثم مر بأخرى فأثني على صاحبها خيرا، فقال عمر  رضى الله عنه  وجبت‏.‏ ثم مر بالثالثة، فأثني على صاحبها شرا فقال وجبت‏.‏ فقال أبو الأسود فقلت وما وجبت يا أمير المؤمنين قال قلت كما قال النبي صلى الله عليه وسلم ‏\"‏ أيما مسلم شهد له أربعة بخير أدخله الله الجنة ‏\"‏‏.‏ فقلنا وثلاثة قال ‏\"‏ وثلاثة ‏\"‏‏.‏ فقلنا واثنان قال ‏\"‏ واثنان ‏\"‏‏.‏ ثم لم نسأله عن الواحد‏.‏",
      "text_en": " Narrated Abu Al-Aswad:                     I came to Medina when an epidemic had broken out. While I was sitting with `Umar bin Al-Khattab a funeral procession passed by and the people praised the deceased. `Umar said, \"It has been affirmed to him.\" And another funeral procession passed by and the people praised the deceased. `Umar said, \"It has been affirmed to him.\" A third (funeral procession) passed by and the people spoke badly of the deceased. He said, \"It has been affirmed to him.\" I (Abu Al-Aswad) asked, \"O chief of the believers! What has been affirmed?\" He replied, \"I said the same as the Prophet had said, that is: if four persons testify the piety of a Muslim, Allah will grant him Paradise.\" We asked, \"If three persons testify his piety?\" He (the Prophet) replied, \"Even three.\" Then we asked, \"If two?\" He replied, \"Even two.\" We did not ask him regarding one witness.",
      "usc_msa_ref": "449",
      "chain": [
        "30106",
        "20424",
        "11432",
        "11105"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-2643",
      "hadith_no": "2643",
      "source": "Sahih Bukhari",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا داود بن أبي الفرات، حدثنا عبد الله بن بريدة، عن أبي الأسود، قال أتيت المدينة وقد وقع بها مرض، وهم يموتون موتا ذريعا، فجلست إلى عمر  رضى الله عنه  فمرت جنازة فأثني خير فقال عمر وجبت‏.‏ ثم مر بأخرى فأثني خيرا فقال وجبت‏.‏ ثم مر بالثالثة فأثني شرا، فقال وجبت‏.‏ فقلت ما وجبت يا أمير المؤمنين قال قلت كما قال النبي صلى الله عليه وسلم ‏\"‏ أيما مسلم شهد له أربعة بخير أدخله الله الجنة ‏\"‏‏.‏ قلنا وثلاثة قال ‏\"‏ وثلاثة ‏\"‏‏.‏ قلت واثنان قال ‏\"‏ واثنان ‏\"‏‏.‏ ثم لم نسأله عن الواحد‏.‏",
      "text_en": " Narrated Abu Al-Aswad:                     Once I went to Medina where there was an outbreak of disease and the people were dying rapidly. I was sitting with `Umar and a funeral procession passed by. The people praised the deceased. `Umar said, \"It has been affirmed\" (Paradise). Then another funeral procession passed by. The people praised the deceased. `Umar said, \"It has been affirmed.\" (Paradise). Then another funeral procession passed by. The people praised the deceased. `Umar said, \"It has been affirmed (Paradise).\" Then a third funeral procession passed by and the people talked badly of the deceased. `Umar said, \"It has been affirmed (Hell).\" I asked `Umar, \"O chief of the believers! What has been affirmed?\" He said, \"I have said what the Prophet said. He said, 'Allah will admit into paradise any Muslim whose good character is attested by four persons.' We asked the Prophet, 'If there were three witnesses only?' He said, 'Even three.' We asked, 'If there were two only?' He said, 'Even two.' But we did not ask him about one witness.\"",
      "usc_msa_ref": "811",
      "chain": [
        "20040",
        "20424",
        "11432",
        "11105"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-3474",
      "hadith_no": "3474",
      "source": "Sahih Bukhari",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا موسى بن إسماعيل، حدثنا داود بن أبي الفرات، حدثنا عبد الله بن بريدة، عن يحيى بن يعمر، عن عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم قالت سألت رسول الله صلى الله عليه وسلم عن الطاعون، فأخبرني ‏\"‏ أنه عذاب يبعثه الله على من يشاء، وأن الله جعله رحمة للمؤمنين، ليس من أحد يقع الطاعون فيمكث في بلده صابرا محتسبا، يعلم أنه لا يصيبه إلا ما كتب الله له، إلا كان له مثل أجر شهيد ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) I asked Allah's Apostle about the plague. He told me that it was a Punishment sent by Allah on whom he wished, and Allah made it a source of mercy for the believers, for if one in the time of an epidemic plague stays in his country patiently hoping for Allah's Reward and believing that nothing will befall him except what Allah has written for him, he will get the reward of a martyr.\"",
      "usc_msa_ref": "680",
      "chain": [
        "20040",
        "20424",
        "11432",
        "11316",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-5793",
      "hadith_no": "5793",
      "source": "Sahih Bukhari",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا إسحاق، أخبرنا حبان، حدثنا داود بن أبي الفرات، حدثنا عبد الله بن بريدة، عن يحيى بن يعمر، عن عائشة، زوج النبي صلى الله عليه وسلم أنها أخبرتنا أنها سألت رسول الله صلى الله عليه وسلم عن الطاعون فأخبرها نبي الله صلى الله عليه وسلم ‏\"‏ أنه كان عذابا يبعثه الله على من يشاء، فجعله الله رحمة للمؤمنين، فليس من عبد يقع الطاعون فيمكث في بلده صابرا، يعلم أنه لن يصيبه إلا ما كتب الله له، إلا كان له مثل أجر الشهيد ‏\"‏‏.‏ تابعه النضر عن داود‏.‏",
      "text_en": " Narrated `Aisha:                     (the wife of the Prophet) that she asked Allah's Apostle about plague, and Allah's Apostle informed her saying, \"Plague was a punishment which Allah used to send on whom He wished, but Allah made it a blessing for the believers. None (among the believers) remains patient in a land in which plague has broken out and considers that nothing will befall him except what Allah has ordained for him, but that Allah will grant him a reward similar to that of a martyr.\"",
      "usc_msa_ref": "630",
      "chain": [
        "30312",
        "20218",
        "20424",
        "11432",
        "11316"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "sahih-bukhari-6701",
      "hadith_no": "6701",
      "source": "Sahih Bukhari",
      "chapter": "Divine Will (Al-Qadar) - كتاب القدر",
      "chapter_no": "82",
      "text_ar": "حدثني إسحاق بن إبراهيم الحنظلي، أخبرنا النضر، حدثنا داود بن أبي الفرات، عن عبد الله بن بريدة، عن يحيى بن يعمر، أن عائشة  رضى الله عنها  أخبرته أنها، سألت رسول الله صلى الله عليه وسلم عن الطاعون فقال ‏\"‏ كان عذابا يبعثه الله على من يشاء، فجعله الله رحمة للمؤمنين، ما من عبد يكون في بلد يكون فيه، ويمكث فيه، لا يخرج من البلد، صابرا محتسبا، يعلم أنه لا يصيبه إلا ما كتب الله له، إلا كان له مثل أجر شهيد ‏\"‏‏.‏",
      "text_en": " Narrated `Aisha:                     I asked Allah's Apostle about the plague. He said, \"That was a means of torture which Allah used to send upon whom-so-ever He wished, but He made it a source of mercy for the believers, for anyone who is residing in a town in which this disease is present, and remains there and does not leave that town, but has patience and hopes for Allah's reward, and knows that nothing will befall him except what Allah has written for him, then he will get such reward as that of a martyr.\"",
      "usc_msa_ref": "616",
      "chain": [
        "30021",
        "20291",
        "20424",
        "11432",
        "11316",
        "53"
      ],
      "source_display": {
        "en": "Sahih Bukhari",
        "ar": "صحيح البخاري",
        "ckb": "سەحیحی بوخاری"
      }
    },
    {
      "id": "jami-al-tirmidhi-1059",
      "hadith_no": "1059",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Jana''iz (Funerals) - كتاب الجنائز عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "10",
      "text_ar": "حدثنا يحيى بن موسى، وهارون بن عبد الله البزاز، قالا حدثنا أبو داود الطيالسي، حدثنا داود بن أبي الفرات، حدثنا عبد الله بن بريدة، عن أبي الأسود الديلي، قال قدمت المدينة فجلست إلى عمر بن الخطاب فمروا بجنازة فأثنوا عليها خيرا فقال عمر وجبت ‏.‏ فقلت لعمر وما وجبت قال أقول كما قال رسول الله صلى الله عليه وسلم قال ‏\"‏ ما من مسلم يشهد له ثلاثة إلا وجبت له الجنة ‏\"‏ ‏.‏ قال قلنا واثنان قال ‏\"‏ واثنان ‏\"‏ ‏.‏ قال ولم نسأل رسول الله صلى الله عليه وسلم عن الواحد ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو الأسود الديلي اسمه ظالم بن عمرو بن سفيان ‏.‏",
      "text_en": " Abu Al-Aswad Ad-Dill narrated:                     \"I arrived in Al-Madinah and while I was sitting with Umar bin Al-Khattab they passed by with a funeral, over (a person) whom they were praising with good. Umar said: 'Granted.' I said to Umar: 'What is granted?' He said: 'I said as the Messenger of Allah said: \"There is no Muslim about whom three bear witness, except that he is granted Paradise.\" He said: \"And two (as well).\" He said: 'We did not ask the Messenger of Allah about one.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30221",
        "20547",
        "20424",
        "11432",
        "11114"
      ],
      "source_display": {
        "en": "Jami' al-Tirmidhi",
        "ar": "جامع الترمذي",
        "ckb": "جاميعي تیرمیزی"
      }
    },
    {
      "id": "sunan-an-nasai-1934",
      "hadith_no": "1934",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Funerals - كتاب الجنائز",
      "chapter_no": "21",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال حدثنا هشام بن عبد الملك، وعبد الله بن يزيد، قالا حدثنا داود بن أبي الفرات، قال حدثنا عبد الله بن بريدة، عن أبي الأسود الديلي، قال أتيت المدينة فجلست إلى عمر بن الخطاب فمر بجنازة فأثني على صاحبها خيرا فقال عمر وجبت ‏.‏ ثم مر بأخرى فأثني على صاحبها خيرا فقال عمر وجبت ‏.‏ ثم مر بالثالث فأثني على صاحبها شرا فقال عمر وجبت ‏.‏ فقلت وما وجبت يا أمير المؤمنين قال قلت كما قال رسول الله صلى الله عليه وسلم ‏\"‏ أيما مسلم شهد له أربعة قالوا خيرا أدخله الله الجنة ‏\"‏ ‏.‏ قلنا أو ثلاثة قال ‏\"‏ أو ثلاثة ‏\"‏ ‏.‏ قلنا أو اثنان قال ‏\"‏ أو اثنان ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Aswad Ad-Dili said:                     \"I came to Al-Madinah and sat with 'Umar bin Al-Khattab. A funeral passed by and the deceased was praised, and 'Umar said: 'It is granted.' Then another passed by and the deceased was praised, and 'Umar Said: 'It is granted.' Then a third passed by, and the deceased was criticized, and 'Umar said: 'It is granted.' I said: What is granted, O commander of the believers?' He said: 'I said what the Messenger of Allah said: Any Muslim for whom four people bear witness and say good things, Allah will admit him to Paradise.' We said: 'Or three?' He said: 'Or three.' We said: 'Or two?' He said: 'Or two.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "1945",
        "20424",
        "11432",
        "11114"
      ],
      "source_display": {
        "en": "Sunan an-Nasa'i",
        "ar": "سنن النسائي",
        "ckb": "سونەنی نەسائی"
      }
    },
    {
      "id": "sunan-ibn-majah-606",
      "hadith_no": "606",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا يونس بن محمد، عن داود بن أبي الفرات، عن محمد بن زيد، عن أبي شريح، عن أبي مسلم، مولى زيد بن صوحان قال كنت مع سلمان فرأى رجلا ينزع خفيه للوضوء فقال له سلمان امسح على خفيك وعلى خمارك وبناصيتك فإني رأيت رسول الله  صلى الله عليه وسلم  يمسح على الخفين والخمار ‏.‏",
      "text_en": " It was narrated that Abu Muslim, the freed slave of Zaid bin Suhan, said:                     \"I was with Salman, and he saw a man removing his leather socks for ablution. Salman said to him\" 'Wipe over your leather socks and your head cover, and your forehead, for I saw the Messenger of Allah wiping over his leather socks and head cover.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "20393",
        "20424",
        "11217",
        "5355"
      ],
      "source_display": {
        "en": "Sunan Ibn Majah",
        "ar": "سنن ابن ماجه",
        "ckb": "سونەنی ئیبن ماجە"
      }
    }
  ],
  "total_hadiths": 8,
  "grade_display": {
    "en": "Successor (Taba' Tabi') [8th Generation]",
    "ar": "تابع التابعين [الجيل الثامن]",
    "ckb": "شوێنكەوتووی شوێنكەوتوو [نەوەی هەشتەم]"
  }
}