{
  "id": "20434",
  "name": "'Abdullah bin 'Umar عبد الله بن عمر النميري",
  "full_name": "'Abdullah bin 'Umar عبد الله بن عمر النميري",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "NA"
    ],
    "area_of_interest": [
      "Narrator[Grade:Sadooq] [ خ  -  صدوق ]"
    ],
    "tags": []
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "20475",
      "name": "Yonus bin Yazid bin Abi al-Nijad يونس بن يزيد بن أبي النجاد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "14422",
      "name": "Yazid bin Aban al-Raqqashi يزيد بن أبان الرقاشي",
      "grade": "Follower(Tabi') [5th generation]"
    }
  ],
  "students": [
    {
      "id": "20219",
      "name": "Hajjaj bin al-Minhal حجاج بن المنهال",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "23033",
      "name": "'Abdullah bin Yazid al-'Advi عبد الله بن يزيد العدوي المقري القصير",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20040",
      "name": "Musa bin Isma'il al-Munqari al-Tabudhaki موسى بن إسماعيل المنقري - لتبوذكي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20556",
      "name": "'Abdul Malik bin Qarib - al-Asma'i عبد الملك بن قريب بن عبد الملك - الأصمعي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "2637",
      "source": " Sahih Bukhari ",
      "chapter": "Witnesses - كتاب الشهادات",
      "chapter_no": "52",
      "text_ar": "حدثنا حجاج، حدثنا عبد الله بن عمر النميري، حدثنا يونس،‏.‏ وقال الليث حدثني يونس، عن ابن شهاب، قال أخبرني عروة، وابن المسيب، وعلقمة بن وقاص، وعبيد الله، عن حديث، عائشة  رضى الله عنها  وبعض حديثهم يصدق بعضا، حين قال لها أهل الإفك، فدعا رسول الله صلى الله عليه وسلم عليا وأسامة حين استلبث الوحى يستأمرهما في فراق أهله، فأما أسامة فقال أهلك ولا نعلم إلا خيرا‏.‏ وقالت بريرة إن رأيت عليها أمرا أغمصه أكثر من أنها جارية حديثة السن تنام عن عجين أهلها، فتأتي الداجن فتأكله‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ من يعذرنا من رجل بلغني أذاه في أهل بيتي فوالله ما علمت من أهلي إلا خيرا، ولقد ذكروا رجلا ما علمت عليه إلا خيرا ‏\"‏‏.‏",
      "text_en": " Narrated `Urwa bin Al-Musaiyab Alqama bin Waqqas and Ubaidullah bin `Abdullah:                     About the story of `Aisha and their narrations were similar attesting each other, when the liars said what they invented about `Aisha, and the Divine Inspiration was delayed, Allah's Apostle sent for `Ali and Usama to consult them in divorcing his wife (i.e. `Aisha). Usama said, \"Keep your wife, as we know nothing about her except good.\" Buraira said, \"I cannot accuse her of any defect except that she is still a young girl who sleeps, neglecting her family's dough which the domestic goats come to eat (i.e. she was too simpleminded to deceive her husband).\" Allah's Apostle said, \"Who can help me to take revenge over the man who has harmed me by defaming the reputation of my family? By Allah, I have not known about my family-anything except good, and they mentioned (i.e. accused) a man about whom I did not know anything except good.\"",
      "chain": [
        "20219",
        "20434",
        "20023",
        "20475",
        "11013",
        "10511",
        "11002",
        "11042",
        "11201"
      ]
    },
    {
      "hadith_no": "2879",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا عبد الله بن عمر النميري، حدثنا يونس، قال سمعت الزهري، قال سمعت عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله، عن حديث، عائشة، كل حدثني طائفة، من الحديث قالت كان النبي صلى الله عليه وسلم إذا أراد أن يخرج أقرع بين نسائه، فأيتهن يخرج سهمها خرج بها النبي صلى الله عليه وسلم، فأقرع بيننا في غزوة غزاها، فخرج فيها سهمي، فخرجت مع النبي صلى الله عليه وسلم بعد ما أنزل الحجاب‏.‏",
      "text_en": " Narrated `Aisha:                     Whenever the Prophet intended to proceed on a journey, he used to draw lots amongst his wives and would take the one upon whom the lot fell. Once, before setting out for Jihad, he drew lots amongst us and the lot came to me; so I went with the Prophet; and that happened after the revelation of the Verse Hijab (i.e. veiling).",
      "chain": [
        "20219",
        "20434",
        "20475",
        "11013",
        "10511",
        "11002",
        "11042",
        "11004"
      ]
    },
    {
      "hadith_no": "4075",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا الحجاج بن منهال، حدثنا عبد الله بن عمر النميري، حدثنا يونس بن يزيد، قال سمعت الزهري، قال سمعت عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله، عن حديث، عائشة  رضى الله عنها  زوج النبي صلى الله عليه وسلم كل  حدثني طائفة من الحديث  قالت فأقبلت أنا وأم مسطح فعثرت أم مسطح في مرطها فقالت تعس مسطح‏.‏ فقلت بئس ما قلت، تسبين رجلا شهد بدرا فذكر حديث الإفك‏.‏",
      "text_en": " Narrated Yunus bin Yazid:                     I heard Az-Zuhri saying, \"I heard `Urwa bin Az-Zubair. Sa`id bin Al-Musaiyab, 'Alqama bin Waqqas and 'Ubaidullah bin `Abdullah each narrating part of the narrative concerning `Aisha the wife of the Prophet. `Aisha said: When I and Um Mistah were returning, Um Mistah stumbled by treading on the end of her robe, and on that she said, 'May Mistah be ruined.' I said, 'You have said a bad thing, you curse a man who took part in the battle of Badr!.\" Az-Zuhri then narrated the narration of the Lie (forged against `Aisha).",
      "chain": [
        "20219",
        "20434",
        "20475",
        "11013",
        "10511",
        "11002",
        "11042",
        "11004"
      ]
    },
    {
      "hadith_no": "4736",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد العزيز بن عبد الله، حدثنا إبراهيم بن سعد، عن صالح، عن ابن شهاب،‏.‏ قال وحدثنا الحجاج، حدثنا عبد الله بن عمر النميري، حدثنا يونس بن يزيد الأيلي، قال سمعت الزهري، سمعت عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله، عن حديث، عائشة زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا فبرأها الله، كل حدثني طائفة من الحديث قال النبي صلى الله عليه وسلم ‏\"‏ إن كنت بريئة فسيبرئك الله، وإن كنت ألممت بذنب فاستغفري الله وتوبي إليه ‏\"‏‏.‏ قلت إني والله لا أجد مثلا إلا أبا يوسف ‏{‏فصبر جميل والله المستعان على ما تصفون‏}‏ وأنزل الله ‏{‏إن الذين جاءوا بالإفك‏}‏ العشر الآيات‏.‏",
      "text_en": " Narrated Az-Zuhri:                     `Urwa bin Az-Zubair, Sa`id bin Al-Musaiyab, 'Al-Qama bin Waqqas and 'Ubaidullah bin `Abdullah related the narration of `Aisha, the wife the Prophet, when the slanderers had said about her what they had said and Allah later declared her innocence. Each of them related a part of the narration (wherein) the Prophet said (to `Aisha). \"If you are innocent, then Allah will declare your innocence: but if you have committed a sin, then ask for Allah's Forgiveness and repent to him.\" `Aisha said, \"By Allah, I find no example for my case except that of Joseph's father (when he said), 'So (for me) patience is most fitting.' \" Then Allah revealed the ten Verses:-- \"Verily those who spread the slander are a gang amongst you..\" (24.11)",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "20381",
        "20434",
        "20475",
        "11013",
        "10511",
        "11002",
        "11042",
        "11004"
      ]
    },
    {
      "hadith_no": "6743",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا الأويسي، حدثنا إبراهيم، عن صالح، عن ابن شهاب، ح وحدثنا حجاج، حدثنا عبد الله بن عمر النميري، حدثنا يونس، قال سمعت الزهري، قال سمعت عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله، عن حديث، عائشة زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا، فبرأها الله، وكل حدثني طائفة من الحديث  فقام النبي صلى الله عليه وسلم فاستعذر من عبد الله بن أبى، فقام أسيد بن حضير فقال لسعد بن عبادة لعمر الله لنقتلنه‏.‏",
      "text_en": " Narrated Az-Zuhri:                     I heard `Urwa bin Az-Zubair, Sa`id bin Al-Musaiyab, 'Alqama bin Waqqas and 'Ubaidullah bin `Abdullah narrating from `Aisha, the wife of the Prophet, the story about the liars who said what they said about her and how Allah revealed her innocence afterwards. Each one of the above four narrators narrated to me a portion of her narration. (It was said in it), \"The Prophet stood up, saying, 'Is there anyone who can relieve me from `Abdullah bin Ubai?' On that, Usaid bin Hudair got up and said to Sa`d bin 'Ubada, La`Amrullahi (By the Eternity of Allah), we will kill him!' \"",
      "chain": [
        "30105",
        "20150",
        "11176",
        "11013",
        "20219",
        "20434",
        "20475",
        "11013",
        "10511",
        "11002",
        "11042",
        "11004"
      ]
    },
    {
      "hadith_no": "6760",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا عبد العزيز، حدثنا إبراهيم، عن صالح، عن ابن شهاب، ح وحدثنا الحجاج، حدثنا عبد الله بن عمر النميري، حدثنا يونس بن يزيد الأيلي، قال سمعت الزهري، قال سمعت عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله بن عتبة، عن حديث، عائشة زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا، فبرأها الله مما قالوا  كل حدثني طائفة من الحديث  فأنزل الله ‏{‏إن الذين جاءوا بالإفك‏}‏ العشر الآيات كلها في براءتي‏.‏ فقال أبو بكر الصديق  وكان ينفق على مسطح لقرابته منه  والله لا أنفق على مسطح شيئا أبدا، بعد الذي قال لعائشة‏.‏ فأنزل الله ‏{‏ولا يأتل أولو الفضل منكم والسعة أن يؤتوا أولي القربى‏}‏ الآية‏.‏ قال أبو بكر بلى والله إني لأحب أن يغفر الله لي‏.‏ فرجع إلى مسطح النفقة التي كان ينفق عليه وقال والله لا أنزعها عنه أبدا‏.‏",
      "text_en": " Narrated Az-Zuhri:                     I heard `Urwa bin Az-Zubair, Sa`id bin Al-Musaiyab, 'Alqama bin Waqqas and 'Ubaidullah bin `Abdullah bin `Uqba relating from `Aisha, the wife of the Prophet the narration of the people (i.e. the liars) who spread the slander against her and they said what they said, and how Allah revealed her innocence. Each of them related to me a portion of that narration. (They said that `Aisha said), ''Then Allah revealed the ten Verses starting with:--'Verily! Those who spread the slander..' (24.11-21) All these verses were in proof of my innocence. Abu Bakr As-Siddiq who used to provide for Mistah some financial aid because of his relation to him, said, \"By Allah, I will never give anything (in charity) to Mistah, after what he has said about `Aisha\" Then Allah revealed:-- 'And let not those among you who are good and are wealthy swear not to give (any sort of help) to their kins men....' (24.22) On that, Abu Bakr said, \"Yes, by Allah, I like that Allah should forgive me.\" and then resumed giving Mistah the aid he used to give him and said, \"By Allah! I will never withhold it from him.\"",
      "chain": [
        "20167",
        "20150",
        "11176",
        "11013",
        "20381",
        "20434",
        "20475",
        "11013",
        "10511",
        "11002",
        "11042",
        "11004"
      ]
    },
    {
      "hadith_no": "7592",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا حجاج بن منهال، حدثنا عبد الله بن عمر النميري، حدثنا يونس بن يزيد الأيلي، قال سمعت الزهري، قال سمعت عروة بن الزبير، وسعيد بن المسيب، وعلقمة بن وقاص، وعبيد الله بن عبد الله، عن حديث، عائشة زوج النبي صلى الله عليه وسلم حين قال لها أهل الإفك ما قالوا فبرأها الله مما قالوا  وكل حدثني طائفة من الحديث الذي حدثني  عن عائشة قالت ولكن والله ما كنت أظن أن الله ينزل في براءتي وحيا يتلى، ولشأني في نفسي كان أحقر من أن يتكلم الله في بأمر يتلى، ولكني كنت أرجو أن يرى رسول الله صلى الله عليه وسلم في النوم رؤيا يبرئني الله بها فأنزل الله تعالى ‏{‏إن الذين جاءوا بالإفك‏}‏ العشر الآيات‏.‏",
      "text_en": " Narrated `Urwa bin Az-Zubair:                     Sa`id bin Al-Musaiyab, 'Alqama bin Waqqas and 'Ubaidullah bin `Abdullah regarding the narrating of the forged statement against `Aisha, the wife of the Prophet, when the slanderers said what they said and Allah revealed her innocence. `Aisha said, \"But by Allah, I did not think that Allah, (to confirm my innocence), would reveal Divine Inspiration which would be recited, for I consider myself too unimportant to be talked about by Allah through Divine Inspiration revealed for recitation, but I hoped that Allah's Apostle might have a dream in which Allah would reveal my innocence. So Allah revealed:-- 'Verily! Those who spread the slander are a gang among you...' (The ten Verses in Suratan- Nur) (24.11-20)",
      "chain": [
        "20219",
        "20434",
        "20475",
        "11013",
        "10511",
        "11002",
        "11042",
        "11004"
      ]
    }
  ],
  "total_hadiths": 7
}