{
  "id": "20438",
  "name": "'Abdur Rahman bin Sharih عبد الرحمن بن شريح أبو شريح المعافري",
  "full_name": "'Abdur Rahman bin Sharih عبد الرحمن بن شريح أبو شريح المعافري",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "167",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Alexandria",
      "Egypt"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Ma'fari",
      "Alexandria",
      "Al-Masri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "16023",
      "name": "Hayy bin Hani' Abu Qabayl حيي بن هانئ بن ناضر",
      "grade": "Follower(Tabi') [3rd Generation]"
    },
    {
      "id": "11857",
      "name": "Sahl bin Abi Umama bin Sahl bin Hanif سهل بن أبي أمامة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11105",
      "name": "Muhammad bin 'Abdur Rahman محمد بن عبد الرحمن بن نوفل",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10861",
      "name": "Shrahyl bin Yazid شراحيل بن يزيد",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "10869",
      "name": "Abd al-Krym bin al-Harith عبد الكريم بن الحارث بن يزيد الحضرمي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "16108",
      "name": "Wahb bin 'Abdullah واهب بن عبد الله المعافري",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "16093",
      "name": "Muhammad bin Shmyr محمد بن شمير",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "11263",
      "name": "Muhammad bin Muslim bin Tadras محمد بن مسلم بن تدرس أبو الزبير",
      "grade": "Follower(Tabi') [4th generation]"
    }
  ],
  "students": [
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20029",
      "name": "'Abdullah bin Wahb عبد الله بن وهب بن مسلم القرشي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30234",
      "name": "'Abdur Rahman bin al-Qasim عبد الرحمن بن القاسم بن خالد بن جنادة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38456",
      "name": "al-Qasim bin Kathir bin al-N'man القاسم بن كثير بن النعمان الإسكندراني",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20650",
      "name": "Zayd bin al-Habab al-'Akli زيد بن الحباب أبو الحسين العكلي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20636",
      "name": "Musa bin Da'ud al-Dby موسى بن داود الضبي أبو عبد الله",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "36036",
      "name": "'Abdullah bin Salah عبد الله بن صالح بن محمد أبو صالح المصري",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "7393",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا سعيد بن تليد، حدثني ابن وهب، حدثني عبد الرحمن بن شريح، وغيره، عن أبي الأسود، عن عروة، قال حج علينا عبد الله بن عمرو فسمعته يقول سمعت النبي صلى الله عليه وسلم يقول ‏\"‏ إن الله لا ينزع العلم بعد أن أعطاهموه انتزاعا، ولكن ينتزعه منهم مع قبض العلماء بعلمهم، فيبقى ناس جهال يستفتون فيفتون برأيهم، فيضلون ويضلون ‏\"‏‏.‏ فحدثت عائشة زوج النبي صلى الله عليه وسلم ثم إن عبد الله بن عمرو حج بعد فقالت يا ابن أختي انطلق إلى عبد الله فاستثبت لي منه الذي حدثتني عنه‏.‏ فجئته فسألته فحدثني به كنحو ما حدثني، فأتيت عائشة فأخبرتها فعجبت فقالت والله لقد حفظ عبد الله بن عمرو‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr:                     I heard the Prophet saying, \"Allah will not deprive you of knowledge after he has given it to you, but it will be taken away through the death of the religious learned men with their knowledge. Then there will remain ignorant people who, when consulted, will give verdicts according to their opinions whereby they will mislead others and go astray.\"",
      "chain": [
        "27421",
        "20029",
        "20438",
        "11105",
        "10511"
      ]
    },
    {
      "hadith_no": "5048",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "حدثني أبو الطاهر، أخبرنا ابن وهب، عن عبد الرحمن بن شريح، عن عبد الكريم، بن الحارث عن أبي عبيدة بن عقبة، عن شرحبيل بن السمط، عن سلمان الخير، عن رسول الله صلى الله عليه وسلم بمعنى حديث الليث عن أيوب بن موسى ‏.‏",
      "text_en": " This tradition has been handed down on the authority of Salman al-Khair through another chain of transmitters.",
      "chain": [
        "20029",
        "20438",
        "10869",
        "6225"
      ]
    },
    {
      "hadith_no": "1520",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا يزيد بن خالد الرملي، حدثنا ابن وهب، حدثنا عبد الرحمن بن شريح، عن أبي أمامة بن سهل بن حنيف، عن أبيه، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من سأل الله الشهادة صادقا بلغه الله منازل الشهداء وإن مات على فراشه ‏\"‏ ‏.‏",
      "text_en": " Suhail b. Hunaif reported on the authority of his father:                      The Messenger of Allah (ﷺ) said: If anyone asks Allah for martyrdom sincerely, Allah make him reach the ranks of martyrs though he may die on his bed.",
      "chain": [
        "38715",
        "20029",
        "20438",
        "405",
        "403"
      ]
    },
    {
      "hadith_no": "1529",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Detailed Injunctions about Witr - كتاب الوتر",
      "chapter_no": "8",
      "text_ar": "حدثنا محمد بن رافع، حدثنا أبو الحسين، زيد بن الحباب حدثنا عبد الرحمن بن شريح الإسكندراني، حدثني أبو هانئ الخولاني، أنه سمع أبا علي الجنبي، أنه سمع أبا سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قال رضيت بالله ربا وبالإسلام دينا وبمحمد رسولا وجبت له الجنة ‏\"‏ ‏.‏",
      "text_en": " Abu Sa'id al-Khudri reported the Messenger of Allah (ﷺ) as saying:                      If anyone says \"I am pleased with Allah as Lord, with Islam as religion and with Muhammad (ﷺ) as Apostle\" Paradise will be his due.",
      "chain": [
        "30375",
        "20438",
        "10856",
        "38"
      ]
    },
    {
      "hadith_no": "1653",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن سهل بن عسكر البغدادي، حدثنا القاسم بن كثير المصري، حدثنا عبد الرحمن بن شريح، أنه سمع سهل بن أبي أمامة بن سهل بن حنيف، يحدث عن أبيه، عن جده، عن النبي صلى الله عليه وسلم قال ‏\"‏ من سأل الله الشهادة من قلبه صادقا بلغه الله منازل الشهداء وإن مات على فراشه ‏\"‏ ‏.‏ قال أبو عيسى حديث سهل بن حنيف حديث حسن غريب لا نعرفه إلا من حديث عبد الرحمن بن شريح ‏.‏ وقد رواه عبد الله بن صالح عن عبد الرحمن بن شريح ‏.‏ وعبد الرحمن بن شريح يكنى أبا شريح وهو إسكندراني ‏.‏ وفي الباب عن معاذ بن جبل ‏.‏",
      "text_en": " Narrated Sahl bin Abi Umamah bin Sahl bin Hunaif:                     From his father, from his grandfather, that the Prophet (ﷺ) said: \"Whoever asks Allah for Martyrdom sincerely in his heart, Allah will grant the status of martyrdom for him, even if he were to die in his bed.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib as a narration of Sahl bin Hunaif. We do not know of it except from the report of 'Abdur-Rahman bin Shuraih. 'Abdullah bin Salih reported it from 'Abdur-Rahman bin Shuraih, and 'Abdur-Rahman bin Shuraih's kunyah is Abu Shuriah, and he is from Iskandarani.There is something on this topic from Mu'adh bin Jabal.",
      "chain": [
        "30516",
        "38456",
        "20438",
        "11857",
        "405"
      ]
    },
    {
      "hadith_no": "3117",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا عصمة بن الفضل، قال حدثنا زيد بن حباب، عن عبد الرحمن بن شريح، قال سمعت محمد بن شمير الرعيني، يقول سمعت أبا علي التجيبي، أنه سمع أبا ريحانة، يقول سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ حرمت عين على النار سهرت في سبيل الله ‏\"‏ ‏.‏",
      "text_en": " Abu 'Ali At-Tujibi (said) that he heard Abu Raihanah say:                      \"I heard the Messenger of Allah (ﷺ) say: 'The eye that stays awake in the cause of Allah will be forbidden to the Fire.'\"",
      "chain": [
        "20650",
        "20438",
        "16093",
        "10696"
      ]
    },
    {
      "hadith_no": "3162",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا ابن وهب، قال حدثني عبد الرحمن بن شريح، أن سهل بن أبي أمامة بن سهل بن حنيف، حدثه عن أبيه، عن جده، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من سأل الله عز وجل الشهادة بصدق بلغه الله منازل الشهداء وإن مات على فراشه ‏\"‏ ‏.‏",
      "text_en": " Sahl bin Abi Umamah bin Sahl bin Hunaif narrated from his father, from his grandfather, that the Messenger of Allah (ﷺ) said:                      \"Whoever asks Allah, the mighty and Sublime, sincerely for martyrdom, Allah will cause him to reach the status of the martyrs even of he dies in his bed.\"",
      "chain": [
        "30493",
        "20029",
        "20438",
        "11857",
        "405"
      ]
    },
    {
      "hadith_no": "3163",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "أخبرنا يونس بن عبد الأعلى، قال حدثنا ابن وهب، قال حدثني عبد الرحمن بن شريح، عن عبد الله بن ثعلبة الحضرمي، أنه سمع ابن حجيرة، يخبر عن عقبة بن عامر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ خمس من قبض في شىء منهن فهو شهيد المقتول في سبيل الله شهيد والغرق في سبيل الله شهيد والمبطون في سبيل الله شهيد والمطعون في سبيل الله شهيد والنفساء في سبيل الله شهيد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Uqbah bin 'Amir that the Messenger of Allah (ﷺ) said:                      \"There are five things, whoever dies of any of them is a martyr. The one who is killed in the cause of Allah is a martyr; the one who dies of an abdominal complaint in the cause of Allah is a martyr; the one who dies of the plague in the cause of Allah is a martyr; and the woman who dies in childbirth in the cause of Allah is a martyr.\"",
      "chain": [
        "30493",
        "20029",
        "20438",
        "16053",
        "189"
      ]
    },
    {
      "hadith_no": "3167",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Jihad - كتاب الجهاد",
      "chapter_no": "25",
      "text_ar": "قال الحارث بن مسكين قراءة عليه وأنا أسمع، عن ابن وهب، أخبرني عبد الرحمن بن شريح، عن عبد الكريم بن الحارث، عن أبي عبيدة بن عقبة، عن شرحبيل بن السمط، عن سلمان الخير، عن رسول الله صلى الله عليه وسلم قال ‏\"‏ من رابط يوما وليلة في سبيل الله كان له كأجر صيام شهر وقيامه ومن مات مرابطا أجري له مثل ذلك من الأجر وأجري عليه الرزق وأمن من الفتان ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Salman Al-Khair that the Messenger of Allah (ﷺ) said:                      \"Whoever guards Ribat (the frontier) for one day and one night, will be given a reward like that for fasting and praying Qiyam for a month, and whoever dies at Ribat (guarding the frontier) will be rewarded, and he will be given provision, and he will be kept safe from Al-Fattan.\" [1][1] According to As-Sindi, the preferred pronunciation is Al-Fattan, plural of Fatan refering to Al-Munkar and An-Nakir, while Al-Fattan would refer to Ash-Shaitan or the like, among the punishment of the grave, or, the angels of chastisement.",
      "chain": [
        "36017",
        "20029",
        "20438",
        "10869",
        "6225"
      ]
    },
    {
      "hadith_no": "2903",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Chapters on Jihad - كتاب الجهاد",
      "chapter_no": "24",
      "text_ar": "حدثنا حرملة بن يحيى، وأحمد بن عيسى المصريان، قالا حدثنا عبد الله بن وهب، حدثني أبو شريح عبد الرحمن بن شريح، أن سهل بن أبي أمامة بن سهل بن حنيف، حدثه عن أبيه، عن جده، أن النبي صلى الله عليه وسلم قال ‏\"‏ من سأل الله الشهادة بصدق من قلبه بلغه الله منازل الشهداء وإن مات على فراشه ‏\"‏ ‏.‏",
      "text_en": " Sahl binAbu Umamah bin Sahl bin Hunaif narrated from his father,from hisgrandfather that the Prophet (ﷺ) said:                      “Whoever asks Allahformartyrdom, sincerely from his heart, Allah will cause him to reachthe status of the martyrs even if he dies in his bed.”",
      "chain": [
        "30487",
        "30227",
        "20029",
        "20438",
        "11857",
        "405"
      ]
    }
  ],
  "total_hadiths": 10
}