{
  "id": "20436",
  "name": "Abu Bakr bin Abi Uvais أبو بكر بن أبي أويس",
  "full_name": "Abu Bakr bin Abi Uvais أبو بكر بن أبي أويس",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "202",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  ت  س  -  ثقة ]"
    ],
    "tags": [
      "al-Asbahi",
      "Ally B. Taym",
      "Madni"
    ]
  },
  "parents": [
    {
      "id": "20506",
      "name": "Abu Uvais al-Madni أبو أويس المدني الأصبحي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "30103",
      "name": "Isma'il bin 'Abdullah bin 'Abdullah إسماعيل بن عبد الله بن عبد الله بن أويس",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "20506",
      "name": "Abu Uvais al-Madni أبو أويس المدني الأصبحي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "21725",
      "name": "al-Rabi' bin Malik bin Abi 'Amir الربيع بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10616",
      "name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "26529",
      "name": "Hisham bin Sa'id al-Talaqani هشام بن سعيد الطالقاني أبو أحمد البزاز",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30103",
      "name": "Isma'il bin 'Abdullah bin 'Abdullah إسماعيل بن عبد الله بن عبد الله بن أويس",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20158",
      "name": "Ayoub bin Sulaiman bin Bilal أيوب بن سليمان بن بلال",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30375",
      "name": "Muhammad bin Rafa'i محمد بن رافع",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30008",
      "name": "Ibn Sa'd محمد بن سعد البغدادي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36056",
      "name": "Muhammad bin 'Abdullah bin 'Abdul Hakam محمد بن عبد الله بن عبد الحكم",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "120",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا إسماعيل، قال حدثني أخي، عن ابن أبي ذئب، عن سعيد المقبري، عن أبي هريرة، قال حفظت من رسول الله صلى الله عليه وسلم وعاءين، فأما أحدهما فبثثته، وأما الآخر فلو بثثته قطع هذا البلعوم‏.‏",
      "text_en": " Narrated Abu Huraira:                     I have memorized two kinds of knowledge from Allah's Apostle . I have propagated one of them to you and if I propagated the second, then my pharynx (throat) would be cut (i.e. killed).",
      "chain": [
        "30103",
        "20436",
        "20177",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "534",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أيوب بن سليمان، قال حدثنا أبو بكر، عن سليمان، قال صالح بن كيسان حدثنا الأعرج عبد الرحمن، وغيره، عن أبي هريرة‏.‏ونافع مولى عبد الله بن عمر عن عبد الله بن عمر، أنهما حدثاه عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ إذا اشتد الحر فأبردوا عن الصلاة، فإن شدة الحر من فيح جهنم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira and `Abdullah bin `Umar:                     Allah's Apostle said, \"If it is very hot, then pray the Zuhr prayer when it becomes (a bit) cooler, as the severity of the heat is from the raging of the Hell-fire.\"",
      "chain": [
        "20158",
        "20436",
        "20160",
        "11176"
      ]
    },
    {
      "hadith_no": "569",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أيوب بن سليمان، قال حدثني أبو بكر، عن سليمان، قال صالح بن كيسان أخبرني ابن شهاب، عن عروة، أن عائشة، قالت أعتم رسول الله صلى الله عليه وسلم بالعشاء حتى ناداه عمر الصلاة، نام النساء والصبيان‏.‏ فخرج فقال ‏\"‏ ما ينتظرها أحد من أهل الأرض غيركم ‏\"‏‏.‏ قال ولا يصلى يومئذ إلا بالمدينة، وكانوا يصلون فيما بين أن يغيب الشفق إلى ثلث الليل الأول‏.‏",
      "text_en": " Narrated Ibn Shihab from `Urwa:                     `Aisha said, \"Once Allah's Apostle delayed the `Isha' prayer till `Umar reminded him by saying, \"The prayer!\" The women and children have slept. Then the Prophet came out and said, 'None amongst the dwellers of the earth has been waiting for it (the prayer) except you.\" `Urwa said, \"Nowhere except in Medina the prayer used to be offered (in those days).\" He further said, \"The Prophet used to offer the `Isha' prayer in the period between the disappearance of the twilight and the end of the first third of the night.\"",
      "chain": [
        "20158",
        "20436",
        "20160",
        "11176",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "577",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا إسماعيل بن أبي أويس، عن أخيه، عن سليمان، عن أبي حازم، أنه سمع سهل بن سعد، يقول كنت أتسحر في أهلي ثم يكون سرعة بي أن أدرك صلاة الفجر مع رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     I used to take the \"Suhur\" meal with my family and hasten so as to catch the Fajr (morning prayer) with Allah's Apostle.",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "1029",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "قال أيوب بن سليمان حدثني أبو بكر بن أبي أويس، عن سليمان بن بلال، قال يحيى بن سعيد سمعت أنس بن مالك، قال أتى رجل أعرابي من أهل البدو إلى رسول الله صلى الله عليه وسلم يوم الجمعة فقال يا رسول الله، هلكت الماشية هلك العيال هلك الناس‏.‏ فرفع رسول الله صلى الله عليه وسلم يديه يدعو، ورفع الناس أيديهم معه يدعون، قال فما خرجنا من المسجد حتى مطرنا، فما زلنا نمطر حتى كانت الجمعة الأخرى، فأتى الرجل إلى نبي الله صلى الله عليه وسلم فقال يا رسول الله، بشق المسافر، ومنع الطريق‏.‏",
      "text_en": " Narrated Anas bin Malik:                      A bedouin came to Allah's Messenger () on a Friday  and said, \"O Allah's Messenger ! The livestock, the offspring, and the people have perished.\" So, Allah's Messenger (saw) raised both his hands invoking Allah (for rain) and the people too raised their hands with Allah's Messenger () invoking Allah (for rain). We had not left the mosque when it started raining. It rained till the next Friday when the same man came to Allah's Messenger () and said, \"O Allah's Messenger! The travelers are compelled to postpone their journeys (because of excessive rain) and the roads are overflowed.\"",
      "chain": [
        "20158",
        "20436",
        "20160",
        "11062",
        "19"
      ]
    },
    {
      "hadith_no": "1077",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا إبراهيم بن موسى، قال أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني أبو بكر بن أبي مليكة، عن عثمان بن عبد الرحمن التيمي، عن ربيعة بن عبد الله بن الهدير التيمي  قال أبو بكر وكان ربيعة من خيار الناس عما حضر ربيعة من عمر بن الخطاب  رضى الله عنه  قرأ يوم الجمعة على المنبر بسورة النحل حتى إذا جاء السجدة نزل فسجد وسجد الناس، حتى إذا كانت الجمعة القابلة قرأ بها حتى إذا جاء السجدة قال يا أيها الناس إنا نمر بالسجود فمن سجد فقد أصاب، ومن لم يسجد فلا إثم عليه‏.‏ ولم يسجد عمر  رضى الله عنه‏.‏ وزاد نافع عن ابن عمر  رضى الله عنهما إن الله لم يفرض السجود إلا أن نشاء‏.‏",
      "text_en": " Narrated Rabi`a:                     `Umar bin Al-Khattab recited Surat-an-Nahl on a Friday on the pulpit and when he reached the verse of Sajda he got down from the pulpit and prostrated and the people also prostrated. The next Friday `Umar bin Al-Khattab recited the same Sura and when he reached the verse of Sajda he said, \"O people! When we recite the verses of Sajda (during the sermon) whoever prostrates does the right thing, yet it is no sin for the one who does not prostrate.\" And `Umar did not prostrate (that day). Added Ibn `Umar \"Allah has not made the prostration of recitation compulsory but if we wish we can do it.\"",
      "chain": [
        "30309",
        "20467",
        "11070",
        "11569",
        "11525",
        "20436"
      ]
    },
    {
      "hadith_no": "1205",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا بشر بن محمد، أخبرنا عبد الله، قال يونس قال الزهري أخبرني أنس بن مالك، أن المسلمين، بينا هم في الفجر يوم الاثنين، وأبو بكر  رضى الله عنه  يصلي بهم ففجأهم النبي صلى الله عليه وسلم قد كشف ستر حجرة عائشة  رضى الله عنها  فنظر إليهم، وهم صفوف، فتبسم يضحك، فنكص أبو بكر  رضى الله عنه  على عقبيه، وظن أن رسول الله صلى الله عليه وسلم يريد أن يخرج إلى الصلاة، وهم المسلمون أن يفتتنوا في صلاتهم فرحا بالنبي صلى الله عليه وسلم حين رأوه، فأشار بيده أن أتموا، ثم دخل الحجرة وأرخى الستر، وتوفي ذلك اليوم‏.‏",
      "text_en": "      Narrated Anas bin Malik:                          While Abu Bakr was leading the people in the morning prayer on a      Monday, the Prophet came towards them suddenly having lifted the      curtain of 'Aisha's house, and looked at them as they were standing in     rows and smiled. Abu Bakr tried to come back thinking that Allah's      Apostle wanted to come out for the prayer. The attention of the      Muslims was diverted from the prayer because they were delighted to      see the Prophet. The Prophet waved his hand to them to complete their      prayer, then he went back into the room and let down the curtain. The      Prophet expired on that very day.",
      "chain": [
        "30318",
        "20025",
        "20475",
        "11013",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "1464",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن معاوية بن أبي مزرد، عن أبي الحباب، عن أبي هريرة  رضى الله عنه  أن النبي صلى الله عليه وسلم قال ‏\"‏ ما من يوم يصبح العباد فيه إلا ملكان ينزلان فيقول أحدهما اللهم أعط منفقا خلفا، ويقول الآخر اللهم أعط ممسكا تلفا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Every day two angels come down from Heaven and one of them says, 'O Allah! Compensate every person who spends in Your Cause,' and the other (angel) says, 'O Allah! Destroy every miser.' \"",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11541",
        "13"
      ]
    },
    {
      "hadith_no": "1474",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عبد الله، قال حدثني أبي قال، حدثني ثمامة، أن أنسا، حدثه أن أبا بكر  رضى الله عنه  كتب له التي فرض رسول الله صلى الله عليه وسلم ‏\"‏ وما كان من خليطين فإنهما يتراجعان بينهما بالسوية ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Abu Bakr wrote to me what Allah's Apostle has made compulsory (regarding Zakat) and this was mentioned in it: If a property is equally owned by two partners, they should pay the combined Zakat and it will be considered that both of them have paid their Zakat equally.",
      "chain": [
        "30561",
        "11270",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "1477",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عبد الله بن المثنى الأنصاري، قال حدثني أبي قال، حدثني ثمامة بن عبد الله بن أنس، أن أنسا، حدثه أن أبا بكر  رضى الله عنه  كتب له هذا الكتاب لما وجهه إلى البحرين بسم الله الرحمن الرحيم ‏\"‏ هذه فريضة الصدقة التي فرض رسول الله صلى الله عليه وسلم على المسلمين، والتي أمر الله بها رسوله، فمن سئلها من المسلمين على وجهها فليعطها، ومن سئل فوقها فلا يعط في أربع وعشرين من الإبل فما دونها من الغنم من كل خمس شاة، إذا بلغت خمسا وعشرين إلى خمس وثلاثين ففيها بنت مخاض أنثى، فإذا بلغت ستا وثلاثين إلى خمس وأربعين ففيها بنت لبون أنثى، فإذا بلغت ستا وأربعين إلى ستين ففيها حقة طروقة الجمل، فإذا بلغت واحدة وستين إلى خمس وسبعين ففيها جذعة، فإذا بلغت  يعني  ستا وسبعين إلى تسعين ففيها بنتا لبون، فإذا بلغت إحدى وتسعين إلى عشرين ومائة ففيها حقتان طروقتا الجمل، فإذا زادت على عشرين ومائة ففي كل أربعين بنت لبون، وفي كل خمسين حقة، ومن لم يكن معه إلا أربع من الإبل فليس فيها صدقة، إلا أن يشاء ربها، فإذا بلغت خمسا من الإبل ففيها شاة، وفي صدقة الغنم في سائمتها إذا كانت أربعين إلى عشرين ومائة شاة، فإذا زادت على عشرين ومائة إلى مائتين شاتان، فإذا زادت على مائتين إلى ثلاثمائة ففيها ثلاث، فإذا زادت على ثلاثمائة ففي كل مائة شاة، فإذا كانت سائمة الرجل ناقصة من أربعين شاة واحدة فليس فيها صدقة، إلا أن يشاء ربها، وفي الرقة ربع العشر، فإن لم تكن إلا تسعين ومائة فليس فيها شىء، إلا أن يشاء ربها ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     When Abu Bakr; sent me to (collect the Zakat from) Bahrain, he wrote to me the following:-- (In the name of Allah, the Beneficent, the Merciful). These are the orders for compulsory charity (Zakat) which Allah's Apostle had made obligatory for every Muslim, and which Allah had ordered His Apostle to observe: Whoever amongst the Muslims is asked to pay Zakat accordingly, he should pay it (to the Zakat collector) and whoever is asked more than that (what is specified in this script) he should not pay it; for twenty-four camels or less, sheep are to be paid as Zakat; for every five camels one sheep is to be paid, and if there are between twenty-five to thirty-five camels, one Bint Makhad is to be paid; and if they are between thirty-six to forty-five (camels), one Bint Labun is to be paid; and if they are between forty-six to sixty (camels), one Hiqqa is to be paid; and if the number is between sixty-one to seventy-five (camels), one Jadha is to be paid; and if the number is between seventy-six to ninety (camels), two Bint Labuns are to be paid; and if they are from ninety-one to one-hundredand twenty (camels), two Hiqqas are to be paid; and if they are over one-hundred and-twenty (camels), for every forty (over one-hundred-and-twenty) one Bint Labun is to be paid, and for every fifty camels (over one-hundred-and-twenty) one Hiqqa is to be paid; and who ever has got only four camels, has to pay nothing as Zakat, but if the owner of these four camels wants to give something, he can. If the number of camels increases to five, the owner has to pay one sheep as Zakat. As regards the Zakat for the (flock) of sheep; if they are between forty and one-hundred-and-twenty sheep, one sheep is to be paid; and if they are between one-hundred-and-twenty to two hundred (sheep), two sheep are to be paid; and if they are between two-hundred to three-hundred (sheep), three sheep are to be paid; and for over three-hundred sheep, for every extra hundred sheep, one sheep is to be paid as Zakat. And if somebody has got less than forty sheep, no Zakat is required, but if he wants to give, he can. For silver the Zakat is one-fortieth of the lot (i.e. 2.5%), and if its value is less than two-hundred Dirhams, Zakat is not required, but if the owner wants to pay he can.'",
      "chain": [
        "11270",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "1680",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا علي، سمع أبا بكر بن عياش، حدثنا عبد العزيز، لقيت أنسا‏.‏ وحدثني إسماعيل بن أبان، حدثنا أبو بكر، عن عبد العزيز، قال خرجت إلى منى يوم التروية فلقيت أنسا  رضى الله عنه  ذاهبا على حمار فقلت أين صلى النبي صلى الله عليه وسلم هذا اليوم الظهر فقال انظر حيث يصلي أمراؤك فصل‏.‏",
      "text_en": " Narrated `Abdul `Aziz:                     I went out to Mina on the day of Tarwiya and met Anas going on a donkey. I asked him, \"Where did the Prophet offer the Zuhr prayer on this day?\" Anas replied, \"See where your chiefs pray and pray similarly.\"",
      "chain": [
        "30026",
        "20373",
        "20312",
        "20436",
        "11295"
      ]
    },
    {
      "hadith_no": "1748",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن يونس، أخبرنا أبو بكر، عن عبد العزيز بن رفيع، عن عطاء، عن ابن عباس  رضى الله عنهما  قال رجل للنبي صلى الله عليه وسلم زرت قبل أن أرمي‏.‏ قال ‏\"‏ لا حرج ‏\"‏‏.‏ قال حلقت قبل أن أذبح‏.‏ قال ‏\"‏ لا حرج ‏\"‏‏.‏ قال ذبحت قبل أن أرمي‏.‏ قال ‏\"‏ لا حرج ‏\"‏‏.‏ وقال عبد الرحيم الرازي عن ابن خثيم أخبرني عطاء عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم‏.‏ وقال القاسم بن يحيى حدثني ابن خثيم عن عطاء عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم‏.‏   وقال عفان أراه عن وهيب، حدثنا ابن خثيم، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم‏.‏ وقال حماد عن قيس بن سعد وعباد بن منصور عن عطاء عن جابر  رضى الله عنه  عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A man said to the Prophet \"I performed the Tawaf-al-Ifada before the Rami (throwing pebbles at the Jamra).\" The Prophet replied, \"There is no harm.\" The man said, \"I had my head shaved before slaughtering.\" The Prophet replied, \"There is no harm.\" He said, \"I have slaughtered the Hadi before the Rami.\" The Prophet replied, \"There is no harm.\"",
      "chain": [
        "30184",
        "20436",
        "11257",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "1779",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني أخي، عن سليمان، عن يونس بن يزيد، عن ابن شهاب، عن سالم بن عبد الله، أن عبد الله بن عمر  رضى الله عنهما  كان يرمي الجمرة الدنيا بسبع حصيات، ثم يكبر على إثر كل حصاة، ثم يتقدم فيسهل، فيقوم مستقبل القبلة قياما طويلا، فيدعو ويرفع يديه، ثم يرمي الجمرة الوسطى كذلك، فيأخذ ذات الشمال فيسهل، ويقوم مستقبل القبلة قياما طويلا، فيدعو ويرفع يديه، ثم يرمي الجمرة ذات العقبة من بطن الوادي، ولا يقف عندها، ويقول هكذا رأيت رسول الله صلى الله عليه وسلم يفعل‏.‏",
      "text_en": " Narrated Salim bin `Abdullah:                     `Abdullah bin `Umar used to do Rami of the Jamrat-ud-Dunya with seven small pebbles and used to recite Takbir on throwing each stone. He, then, would proceed further till he reached the level ground, where he would stay for a long time, facing the Qibla to invoke (Allah) while raising his hands. Then he would do Rami of the Jamrat-ul-Wusta similarly and would go to the left towards the level ground, where he would stand for a long time facing the Qibla to invoke (Allah) while raising his hands. Then he would do Rami of the Jamrat-ul-Aqaba from the middle of the valley, but he would not stay by it. Ibn `Umar used to say, \"I saw Allah's Apostle doing like that.\"",
      "chain": [
        "30103",
        "20436",
        "20160",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1902",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني أخي، عن سليمان، عن عبيد الله، عن سعيد المقبري، عن أبي هريرة  رضى الله عنه  أن النبي صلى الله عليه وسلم قال ‏\"‏ حرم ما بين لابتى المدينة على لساني ‏\"‏‏.‏ قال وأتى النبي صلى الله عليه وسلم بني حارثة فقال ‏\"‏ أراكم يا بني حارثة قد خرجتم من الحرم ‏\"‏‏.‏ ثم التفت، فقال ‏\"‏ بل أنتم فيه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"I have made Medina a sanctuary between its two (Harrat) mountains.\" The Prophet went to the tribe of Bani Haritha and said (to them), \"I see that you have gone out of the sanctuary,\" but looking around, he added, \"No, you are inside the sanctuary.\"",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11201",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "1958",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو بكر، عن سليمان، عن ابن أبي أوفى  رضى الله عنه  قال كنت مع النبي صلى الله عليه وسلم في سفر، فصام حتى أمسى، قال لرجل ‏\"‏ انزل، فاجدح لي ‏\"‏‏.‏ قال لو انتظرت حتى تمسي‏.‏ قال ‏\"‏ انزل، فاجدح لي، إذا رأيت الليل قد أقبل من ها هنا فقد أفطر الصائم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Abi `Aufa:                     I was with the Prophet on a journey, and he observed the fast till evening. The Prophet said to a man, \"Get down and mix Sawiq with water for me.\" He replied, \"Will you wait till it is evening?\" The Prophet said, \"Get down and mix Sawiq with water for me; when you see night falling from this side, the fasting person should break his fast.\"",
      "chain": [
        "30184",
        "20436",
        "20160",
        "5115"
      ]
    },
    {
      "hadith_no": "2039",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال أخبرني أخي، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن علي بن الحسين  رضى الله عنهما  أن صفية، أخبرته‏.‏ حدثنا علي بن عبد الله، حدثنا سفيان، قال سمعت الزهري، يخبر عن علي بن الحسين، أن صفية  رضى الله عنها  أتت النبي صلى الله عليه وسلم وهو معتكف، فلما رجعت مشى معها، فأبصره رجل من الأنصار، فلما أبصره دعاه فقال ‏\"‏ تعال هي صفية  وربما قال سفيان هذه صفية  فإن الشيطان يجري من ابن آدم مجرى الدم ‏\"‏‏.‏ قلت لسفيان أتته ليلا قال وهل هو إلا ليل",
      "text_en": " Narrated `Ali bin Al-Husain from Safiya:                     Safiya went to the Prophet while he was in I`tikaf. When she returned, the Prophet accompanied her walking. An Ansari man saw him. When the Prophet noticed him, he called him and said, \"Come here. She is Safiya. (Sufyan a sub-narrator perhaps said that the Prophet had said, \"This is Safiya\"). And Satan circulates in the body of Adam's offspring as his blood circulates in it.\" (A sub-narrator asked Sufyan, \"Did Safiya visit him at night?\" He said, \"Of course, at night.\")",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11013",
        "11045"
      ]
    },
    {
      "hadith_no": "2042",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا إسماعيل بن عبد الله، عن أخيه، عن سليمان، عن عبيد الله بن عمر، عن نافع، عن عبد الله بن عمر، عن عمر بن الخطاب  رضى الله عنه  أنه قال يا رسول الله إني نذرت في الجاهلية أن أعتكف ليلة في المسجد الحرام‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ أوف نذرك ‏\"‏‏.‏ فاعتكف ليلة‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     `Umar bin Al-Khattab said, \"O Allah's Apostle! I vowed in the Pre-Islamic period to perform I`tikaf in Al-Masjid-al-Haram for one night.\" The Prophet said, \"Fulfill your vow.\" So, he performed I`tikaf for one night.",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11201",
        "11014",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "2044",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا عبد الله بن أبي شيبة، حدثنا أبو بكر، عن أبي حصين، عن أبي صالح، عن أبي هريرة  رضى الله عنه  قال كان النبي صلى الله عليه وسلم يعتكف في كل رمضان عشرة أيام، فلما كان العام الذي قبض فيه اعتكف عشرين يوما‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet used to perform I`tikaf every year in the month of Ramadan for ten days, and when it was the year of his death, he stayed in I`tikaf for twenty days.",
      "chain": [
        "30201",
        "20436",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2487",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن عبد الله بن المثنى، قال حدثني أبي قال، حدثني ثمامة بن عبد الله بن أنس، أن أنسا، حدثه أن أبا بكر  رضى الله عنه  كتب له فريضة الصدقة التي فرض رسول الله صلى الله عليه وسلم قال ‏\"‏ وما كان من خليطين فإنهما يتراجعان بينهما بالسوية ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     that Abu Bakr As-Siddiq wrote to him the law of Zakat which was made obligatory by Allah's Apostle. He wrote: 'Partners possessing joint property (sheep) have to pay its Zakat equally.",
      "chain": [
        "11270",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "2581",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  أن نساء، رسول الله صلى الله عليه وسلم كن حزبين فحزب فيه عائشة وحفصة وصفية وسودة، والحزب الآخر أم سلمة وسائر نساء رسول الله صلى الله عليه وسلم، وكان المسلمون قد علموا حب رسول الله صلى الله عليه وسلم عائشة، فإذا كانت عند أحدهم هدية يريد أن يهديها إلى رسول الله صلى الله عليه وسلم أخرها، حتى إذا كان رسول الله صلى الله عليه وسلم في بيت عائشة بعث صاحب الهدية إلى رسول الله صلى الله عليه وسلم في بيت عائشة، فكلم حزب أم سلمة، فقلن لها كلمي رسول الله صلى الله عليه وسلم يكلم الناس، فيقول من أراد أن يهدي إلى رسول الله صلى الله عليه وسلم هدية فليهده إليه حيث كان من بيوت نسائه، فكلمته أم سلمة بما قلن، فلم يقل لها شيئا، فسألنها‏.‏ فقالت ما قال لي شيئا‏.‏ فقلن لها فكلميه‏.‏ قالت فكلمته حين دار إليها أيضا، فلم يقل لها شيئا، فسألنها‏.‏ فقالت ما قال لي شيئا‏.‏ فقلن لها كلميه حتى يكلمك‏.‏ فدار إليها فكلمته‏.‏ فقال لها ‏\"‏ لا تؤذيني في عائشة، فإن الوحى لم يأتني، وأنا في ثوب امرأة إلا عائشة ‏\"‏‏.‏ قالت فقالت أتوب إلى الله من أذاك يا رسول الله‏.‏ ثم إنهن دعون فاطمة بنت رسول الله صلى الله عليه وسلم فأرسلن إلى رسول الله صلى الله عليه وسلم تقول إن نساءك ينشدنك الله العدل في بنت أبي بكر‏.‏ فكلمته‏.‏ فقال ‏\"‏ يا بنية، ألا تحبين ما أحب ‏\"‏‏.‏ قالت بلى‏.‏ فرجعت إليهن، فأخبرتهن‏.‏ فقلن ارجعي إليه‏.‏ فأبت أن ترجع، فأرسلن زينب بنت جحش، فأتته فأغلظت، وقالت إن نساءك ينشدنك الله العدل في بنت ابن أبي قحافة‏.‏ فرفعت صوتها، حتى تناولت عائشة‏.‏ وهى قاعدة، فسبتها حتى إن رسول الله صلى الله عليه وسلم لينظر إلى عائشة هل تكلم قال فتكلمت عائشة ترد على زينب، حتى أسكتتها‏.‏ قالت فنظر النبي صلى الله عليه وسلم إلى عائشة، وقال ‏\"‏ إنها بنت أبي بكر ‏\"‏‏.‏ قال البخاري الكلام الأخير قصة فاطمة يذكر عن هشام بن عروة عن رجل عن الزهري عن محمد بن عبد الرحمن‏.‏ وقال أبو مروان عن هشام عن عروة كان الناس يتحرون بهداياهم يوم عائشة‏.‏ وعن هشام عن رجل من قريش، ورجل من الموالي، عن الزهري عن محمد بن عبد الرحمن بن الحارث بن هشام قالت عائشة كنت عند النبي صلى الله عليه وسلم فاستأذنت فاطمة‏.‏",
      "text_en": " Narrated `Urwa from `Aisha:                     The wives of Allah's Apostle were in two groups. One group consisted of `Aisha, Hafsa, Safiyya and Sauda; and the other group consisted of Um Salama and the other wives of Allah's Apostle. The Muslims knew that Allah's Apostle loved `Aisha, so if any of them had a gift and wished to give to Allah's Apostle, he would delay it, till Allah's Apostle had come to `Aisha's home and then he would send his gift to Allah's Apostle in her home. The group of Um Salama discussed the matter together and decided that Um Salama should request Allah's Apostle to tell the people to send their gifts to him in whatever wife's house he was. Um Salama told Allah's Apostle of what they had said, but he did not reply. Then they (those wives) asked Um Salama about it. She said, \"He did not say anything to me.\" They asked her to talk to him again. She talked to him again when she met him on her day, but he gave no reply. When they asked her, she replied that he had given no reply. They said to her, \"Talk to him till he gives you a reply.\" When it was her turn, she talked to him again. He then said to her, \"Do not hurt me regarding Aisha, as the Divine Inspirations do not come to me on any of the beds except that of Aisha.\" On that Um Salama said, \"I repent to Allah for hurting you.\" Then the group of Um Salama called Fatima, the daughter of Allah's Apostle and sent her to Allah's Apostle to say to him, \"Your wives request to treat them and the daughter of Abu Bakr on equal terms.\" Then Fatima conveyed the message to him. The Prophet said, \"O my daughter! Don't you love whom I love?\" She replied in the affirmative and returned and told them of the situation. They requested her to go to him again but she refused. They then sent Zainab bint Jahsh who went to him and used harsh words saying, \"Your wives request you to treat them and the daughter of Ibn Abu Quhafa on equal terms.\" On that she raised her voice and abused `Aisha to her face so much so that Allah's Apostle looked at `Aisha to see whether she would retort. `Aisha started replying to Zainab till she silenced her. The Prophet then looked at `Aisha and said, \"She is really the daughter of Abu Bakr.\"",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2705",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا إسماعيل بن أبي أويس، قال حدثني أخي، عن سليمان، عن يحيى بن سعيد، عن أبي الرجال، محمد بن عبد الرحمن أن أمه، عمرة بنت عبد الرحمن قالت سمعت عائشة  رضى الله عنها  تقول سمع رسول الله صلى الله عليه وسلم صوت خصوم بالباب عالية أصواتهما، وإذا أحدهما يستوضع الآخر، ويسترفقه في شىء وهو يقول والله لا أفعل‏.‏ فخرج عليهما رسول الله صلى الله عليه وسلم فقال ‏\"‏ أين المتألي على الله لا يفعل المعروف ‏\"‏‏.‏ فقال أنا يا رسول الله، وله أى ذلك أحب‏.‏",
      "text_en": " Narrated Aisha:                     Once Allah's Apostle heard the loud voices of some opponents quarreling at the door. One of them was appealing to the other to deduct his debt and asking him to be lenient but the other was saying, \"By Allah I will not do so.\" Allah's Apostle went out to them and said, \"Who is the one who was swearing by Allah that he would not do a favor?\" That man said, \"I am that person, O Allah's Apostle! I will give my opponent whatever he wishes.\"",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11062",
        "10959",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "2886",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا يحيى بن يوسف، أخبرنا أبو بكر، عن أبي حصين، عن أبي صالح، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ تعس عبد الدينار والدرهم والقطيفة والخميصة، إن أعطي رضي، وإن لم يعط لم يرض ‏\"‏‏.‏ لم يرفعه إسرائيل عن أبي حصين‏.‏",
      "text_en": "      Narrated Abu Huraira:                          The Prophet said, \"Let the slave of Dinar and Dirham of Quantify and      Khamisa (i.e. money and luxurious clothes) perish for he is pleased if     these things are given to him, and if not, he is displeased!\"",
      "chain": [
        "30282",
        "20436",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3106",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا محمد بن عبد الله الأنصاري، قال حدثني أبي، عن ثمامة، عن أنس، أن أبا بكر  رضى الله عنه  لما استخلف بعثه إلى البحرين، وكتب له هذا الكتاب وختمه، وكان نقش الخاتم ثلاثة أسطر محمد سطر، ورسول سطر، والله سطر‏.‏",
      "text_en": " Narrated Anas:                     That when Abu Bakr became the Caliph, he sent him to Bahrain and wrote this letter for him, and stamped it with the Ring of the Prophet. Three lines were engraved on the Ring, (the word) 'Muhammad' was in a line, 'Apostle' was in another line, and 'Allah' in a third.",
      "chain": [
        "20280",
        "11599",
        "11270",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "3269",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا إسماعيل بن أبي أويس، قال حدثني أخي، عن سليمان بن بلال، عن يحيى بن سعيد، عن سعيد بن المسيب، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يعقد الشيطان على قافية رأس أحدكم إذا هو نام ثلاث عقد، يضرب كل عقدة مكانها عليك ليل طويل فارقد‏.‏ فإن استيقظ فذكر الله انحلت عقدة، فإن توضأ انحلت عقدة، فإن صلى انحلت عقده كلها، فأصبح نشيطا طيب النفس، وإلا أصبح خبيث النفس كسلان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"During your sleep, Satan knots three knots at the back of the head of each of you, and he breathes the following words at each knot, 'The night is, long, so keep on sleeping,' If that person wakes up and celebrates the praises of Allah, then one knot is undone, and when he performs ablution the second knot is undone, and when he prays, all the knots are undone, and he gets up in the morning lively and gay, otherwise he gets up dull and gloomy. \"",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11062",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "3350",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال أخبرني أخي عبد الحميد، عن ابن أبي ذئب، عن سعيد المقبري، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ يلقى إبراهيم أباه آزر يوم القيامة، وعلى وجه آزر قترة وغبرة، فيقول له إبراهيم ألم أقل لك لا تعصني فيقول أبوه فاليوم لا أعصيك‏.‏ فيقول إبراهيم يا رب، إنك وعدتني أن لا تخزيني يوم يبعثون، فأى خزى أخزى من أبي الأبعد فيقول الله تعالى إني حرمت الجنة على الكافرين، ثم يقال يا إبراهيم ما تحت رجليك فينظر فإذا هو بذيخ ملتطخ، فيؤخذ بقوائمه فيلقى في النار ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"On the Day of Resurrection Abraham will meet his father Azar whose face will be dark and covered with dust.(The Prophet Abraham will say to him): 'Didn't I tell you not to disobey me?' His father will reply: 'Today I will not disobey you.' 'Abraham will say: 'O Lord! You promised me not to disgrace me on the Day of Resurrection; and what will be more disgraceful to me than cursing and dishonoring my father?' Then Allah will say (to him):' 'I have forbidden Paradise for the disbelievers.\" Then he will be addressed, 'O Abraham! Look! What is underneath your feet?' He will look and there he will see a Dhabh (an animal,) blood-stained, which will be caught by the legs and thrown in the (Hell) Fire.\"",
      "chain": [
        "30103",
        "20436",
        "20177",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "3529",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا خالد بن يزيد الكاهلي، حدثنا أبو بكر، عن أبي حصين، عن سعيد بن جبير، عن ابن عباس، رضى الله عنهما‏.‏ ‏{‏وجعلناكم شعوبا وقبائل‏}‏ قال الشعوب القبائل العظام، والقبائل البطون‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Regarding the Verse: 'And (We) made you into Shu'ub and Qabail-- (49.13) that Shu'uib means the big Qabail (i.e. nations) while the Qabail (i.e. tribes) means the branch tribes.",
      "chain": [
        "30191",
        "20436",
        "11371",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3569",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، عن عروة، عن عائشة، أن أبا بكر  رضى الله عنه  دخل عليها وعندها جاريتان في أيام منى تدففان وتضربان، والنبي صلى الله عليه وسلم متغش بثوبه، فانتهرهما أبو بكر، فكشف النبي صلى الله عليه وسلم عن وجهه، فقال ‏\"‏ دعهما يا أبا بكر، فإنها أيام عيد، وتلك الأيام أيام منى ‏\"‏‏.‏   وقالت عائشة رأيت النبي صلى الله عليه وسلم يسترني، وأنا أنظر إلى الحبشة، وهم يلعبون في المسجد فزجرهم ‏{‏عمر‏}‏ فقال النبي صلى الله عليه وسلم ‏\"‏ دعهم أمنا بني أرفدة ‏\"‏‏.‏ يعني من الأمن‏.‏",
      "text_en": " Narrated `Aisha:                     That during the Mina days, Abu Bakr came to her, while there where two girls with her, beating drums, and the Prophet was (lying) covering himself with his garment. Abu Bakr rebuked the two girls, but the Prophet uncovered his face and said, \"O Abu Bakr! Leave them, for these are the days of Id (festival).\" Those days were the days of Mina-. `Aisha added, \"I was being screened by the Prophet while I was watching the Ethiopians playing in the Mosque. `Umar rebuked them, but the Prophet said, \"Leave them, O Bani Arfida! Play. (for) you are safe.\"",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "10511",
        "53",
        "20436"
      ]
    },
    {
      "hadith_no": "3611",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن شريك بن عبد الله بن أبي نمر، سمعت أنس بن مالك، يحدثنا عن ليلة، أسري بالنبي صلى الله عليه وسلم من مسجد الكعبة جاء ثلاثة نفر قبل أن يوحى إليه، وهو نائم في مسجد الحرام، فقال أولهم أيهم هو فقال أوسطهم هو خيرهم وقال آخرهم خذوا خيرهم‏.‏ فكانت تلك، فلم يرهم حتى جاءوا ليلة أخرى، فيما يرى قلبه، والنبي صلى الله عليه وسلم نائمة عيناه ولا ينام قلبه وكذلك الأنبياء تنام أعينهم ولا تنام قلوبهم، فتولاه جبريل ثم عرج به إلى السماء‏.‏",
      "text_en": " Narrated Sharik bin `Abdullah bin Abi Namr:                     I heard Anas bin Malik telling us about the night when the Prophet was made to travel from the Ka`ba Mosque. Three persons (i.e. angels) came to the Prophet before he was divinely inspired was an Aspostle), while he was sleeping in Al Masjid-ul-Haram. The first (of the three angels) said, \"Which of them is he?\" The second said, \"He is the best of them.\" That was all that happened then, and he did not see them till they came at another night and he perceived their presence with his heart, for the eyes of the Prophet were closed when he was asleep, but his heart was not asleep (not unconscious). This is characteristic of all the prophets: Their eyes sleep but their hearts do not sleep. Then Gabriel took charge of the Prophet and ascended along with him to the Heaven.",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11858",
        "19"
      ]
    },
    {
      "hadith_no": "3627",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا إسماعيل، قال حدثني أخي، عن سليمان بن بلال، عن يحيى بن سعيد، قال أخبرني حفص بن عبيد الله بن أنس بن مالك، أنه سمع جابر بن عبد الله  رضى الله عنهما  يقول كان المسجد مسقوفا على جذوع من نخل فكان النبي صلى الله عليه وسلم إذا خطب يقوم إلى جذع منها، فلما صنع له المنبر، وكان عليه فسمعنا لذلك الجذع صوتا كصوت العشار، حتى جاء النبي صلى الله عليه وسلم فوضع يده عليها فسكنت‏.‏",
      "text_en": " Narrated Anas bin Malik:                     That he heard Jabir bin `Abdullah saying, \"The roof of the Mosque was built over trunks of datepalms working as pillars. When the Prophet delivered a sermon, he used to stand by one of those trunks till the pulpit was made for him, and he used it instead. Then we heard the trunk sending a sound like of a pregnant she-camel till the Prophet came to it, and put his hand over it, then it became quiet.\"",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11062",
        "11686",
        "34"
      ]
    },
    {
      "hadith_no": "3890",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا إسماعيل، حدثني أخي، عن سليمان، عن يحيى بن سعيد، عن عبد الرحمن بن القاسم، عن القاسم بن محمد، عن عائشة  رضى الله عنها  قالت كان لأبي بكر غلام يخرج له الخراج، وكان أبو بكر يأكل من خراجه، فجاء يوما بشىء فأكل منه أبو بكر فقال له الغلام تدري ما هذا فقال أبو بكر وما هو قال كنت تكهنت لإنسان في الجاهلية وما أحسن الكهانة، إلا أني خدعته، فلقيني فأعطاني بذلك، فهذا الذي أكلت منه‏.‏ فأدخل أبو بكر يده فقاء كل شىء في بطنه‏.‏",
      "text_en": " Narrated `Aisha:                     Abu Bakr had a slave who used to give him some of his earnings. Abu Bakr used to eat from it. One day he brought something and Abu Bakr ate from it. The slave said to him, \"Do you know what this is?\" Abu Bakr then enquired, \"What is it?\" The slave said, \"Once, in the pre-Islamic period of ignorance I foretold somebody's future though I did not know this knowledge of foretelling but I, cheated him, and when he met me, he gave me something for that service, and that is what you have eaten from.\" Then Abu Bakr put his hand in his mouth and vomited whatever was present in his stomach.",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11062",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "3969",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا أصبغ، حدثنا ابن وهب، عن يونس، عن ابن شهاب، عن عروة بن الزبير، عن عائشة، أن أبا بكر  رضى الله عنه  تزوج امرأة من كلب يقال لها أم بكر، فلما هاجر أبو بكر طلقها، فتزوجها ابن عمها، هذا الشاعر الذي قال هذه القصيدة، رثى كفار قريش وماذا بالقليب قليب بدر من الشيزى تزين بالسنام وماذا بالقليب، قليب بدر من القينات والشرب الكرام تحيي بالسلامة أم بكر وهل لي بعد قومي من سلام يحدثنا الرسول بأن سنحيا وكيف حياة أصداء وهام",
      "text_en": " Narrate Aisha:                     Abu Bakr married a woman from the tribe of Bani Kalb, called Um Bakr. When Abu Bakr migrated to Medina, he divorced her and she was married by her cousin, the poet who said the following poem lamenting the infidels of Quraish: \"What is there kept in the well, The well of Badr, (The owners of) the trays of Roasted camel humps? What is there kept in the well, The well of Badr, (The owners of) lady singers And friends of the honorable companions; who used to drink (wine) together, Um Bakr greets us With the greeting of peace, But can I find peace After my people have gone? The Apostle tells us that We shall live again, But what sort of life will owls and skulls live?:",
      "chain": [
        "30228",
        "20029",
        "20475",
        "11013",
        "10511",
        "53",
        "20436"
      ]
    },
    {
      "hadith_no": "4187",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن سنان بن أبي سنان الدؤلي، عن جابر بن عبد الله  رضى الله عنهما  أخبره أنه، غزا مع رسول الله صلى الله عليه وسلم قبل نجد، فلما قفل رسول الله صلى الله عليه وسلم قفل معه، فأدركتهم القائلة في واد كثير العضاه، فنزل رسول الله صلى الله عليه وسلم، وتفرق الناس في العضاه يستظلون بالشجر، ونزل رسول الله صلى الله عليه وسلم تحت سمرة، فعلق بها سيفه، قال جابر فنمنا نومة، ثم إذا رسول الله صلى الله عليه وسلم يدعونا، فجئناه فإذا عنده أعرابي جالس فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن هذا اخترط سيفي، وأنا نائم فاستيقظت، وهو في يده صلتا، فقال لي من يمنعك مني قلت الله‏.‏ فها هو ذا جالس ‏\"‏‏.‏ ثم لم يعاقبه رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     That he fought in a Ghazwa towards Najd along with Allah's Apostle and when Allah's Apostle returned, he too, returned along with him. The time of the afternoon nap overtook them when they were in a valley full of thorny trees. Allah's Apostle dismounted and the people dispersed amongst the thorny trees, seeking the shade of the trees. Allah's Apostle took shelter under a Samura tree and hung his sword on it. We slept for a while when Allah's Apostle suddenly called us, and we went to him, to find a bedouin sitting with him. Allah's Apostle said, \"This (bedouin) took my sword out of its sheath while I was asleep. When I woke up, the naked sword was in his hand and he said to me, 'Who can save you from me?, I replied, 'Allah.' Now here he is sitting.\" Allah's Apostle did not punish him (for that). Through another group of narrators, Jabir said, \"We were in the company of the Prophet (during the battle of) Dhat-ur-Riqa', and we came across a shady tree and we left it for the Prophet (to take rest under its shade). A man from the pagans came while the Prophet's sword was hanging on the tree. He took it out of its sheath secretly and said (to the Prophet ), 'Are you afraid of me?' The Prophet said, 'No.' He said, 'Who can save you from me?' The Prophet said, Allah.' The companions of the Prophet threatened him, then the Iqama for the prayer was announced and the Prophet offered a two rak`at Fear prayer with one of the two batches, and that batch went aside and he offered two rak`a-t with the other batch. So the Prophet offered four rak`at but the people offered two rak`at only.\" (The subnarrator) Abu Bishr added, \"The man was Ghaurath bin Al-Harith and the battle was waged against Muharib Khasafa.\" Jabir added, \"We were with the Prophet at Nakhl and he offered the Fear prayer.\" Abu Huraira said, \"I offered the Fear prayer with the Prophet during the Ghazwa (i.e. the battle) of Najd.\" Abu Huraira came to the Prophet during the day of Khaibar.",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11013",
        "11511",
        "34"
      ]
    },
    {
      "hadith_no": "4218",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسماعيل، عن أخيه، عن سليمان، عن عمرو بن يحيى، عن عباد بن تميم، قال لما كان يوم الحرة والناس يبايعون لعبد الله بن حنظلة فقال ابن زيد على ما يبايع ابن حنظلة الناس قيل له على الموت‏.‏ قال لا أبايع على ذلك أحدا بعد رسول الله صلى الله عليه وسلم‏.‏ وكان شهد معه الحديبية‏.‏",
      "text_en": " Narrated `Abbas bin Tamim:                     When it was the day (of the battle) of Al-Harra the people were giving Pledge of allegiance to `Abdullah bin Hanzala. Ibn Zaid said, \"For what are the people giving Pledge of allegiance to `Abdullah bin Hanzala?\" It was said to him, \"For death.\" Ibn Zaid said, \"I will never give the Pledge of allegiance for that to anybody else after Allah's Apostle .\" Ibn Zaid was one of those who had witnessed the day of Al-Hudaibiya with the Prophet.",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11210",
        "639"
      ]
    },
    {
      "hadith_no": "4261",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن يحيى، عن حميد الطويل، سمع أنس بن مالك  رضى الله عنه أن النبي صلى الله عليه وسلم أقام على صفية بنت حيى، بطريق خيبر ثلاثة أيام، حتى أعرس بها، وكانت فيمن ضرب عليها الحجاب‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet stayed with Safiya bint Huyai for three days on the way of Khaibar where he consummated his marriage with her. Safiya was amongst those who were ordered to use a veil.",
      "chain": [
        "30103",
        "20436",
        "20160",
        "20031",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "4433",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن ثور بن زيد، عن أبي الغيث، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ الإيمان يمان، والفتنة ها هنا، ها هنا يطلع قرن الشيطان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Belief is Yemenite while afflictions appear from there (the east) from where the side of the head of Satan will appear.\"",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "4495",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، قال أخبرني أبو سلمة، أن عائشة، أخبرته أن أبا بكر  رضى الله عنه  أقبل على فرس من مسكنه بالسنح حتى نزل، فدخل المسجد فلم يكلم الناس حتى دخل على عائشة، فتيمم رسول الله صلى الله عليه وسلم وهو مغشى بثوب حبرة، فكشف عن وجهه ثم أكب عليه فقبله وبكى‏.‏   ثم قال بأبي أنت وأمي، والله لا يجمع الله عليك موتتين، أما الموتة التي كتبت عليك فقد متها‏.‏   قال الزهري وحدثني أبو سلمة، عن عبد الله بن عباس، أن أبا بكر، خرج وعمر يكلم الناس فقال اجلس يا عمر، فأبى عمر أن يجلس‏.‏ فأقبل الناس إليه وتركوا عمر، فقال أبو بكر أما بعد من كان منكم يعبد محمدا صلى الله عليه وسلم فإن محمدا قد مات، ومن كان منكم يعبد الله فإن الله حى لا يموت، قال الله ‏{‏وما محمد إلا رسول قد خلت من قبله الرسل‏}‏ إلى قوله ‏{‏الشاكرين‏}‏ وقال والله لكأن الناس لم يعلموا أن الله أنزل هذه الآية حتى تلاها أبو بكر، فتلقاها منه الناس كلهم فما أسمع بشرا من الناس إلا يتلوها‏.‏ فأخبرني سعيد بن المسيب أن عمر قال والله ما هو إلا أن سمعت أبا بكر تلاها فعقرت حتى ما تقلني رجلاى، وحتى أهويت إلى الأرض حين سمعته تلاها أن النبي صلى الله عليه وسلم قد مات‏.‏",
      "text_en": " Narrated `Aisha:                     Abu Bakr came from his house at As-Sunh on a horse. He dismounted and entered the Mosque, but did not speak to the people till he entered upon `Aisha and went straight to Allah's Apostle who was covered with Hibra cloth (i.e. a kind of Yemenite cloth). He then uncovered the Prophet's face and bowed over him and kissed him and wept, saying, \"Let my father and mother be sacrificed for you. By Allah, Allah will never cause you to die twice. As for the death which was written for you, has come upon you.\" Narrated Ibn `Abbas: Abu Bakr went out while `Umar bin Al-Khattab was talking to the people. Abu Bakr said, \"Sit down, O `Umar!\" But `Umar refused to sit down. So the people came to Abu Bakr and left `Umar. Abu Bakr said, \"To proceed, if anyone amongst you used to worship Muhammad , then Muhammad is dead, but if (anyone of) you used to worship Allah, then Allah is Alive and shall never die. Allah said:--\"Muhammad is no more than an Apostle, and indeed (many) apostles have passed away before him..(till the end of the Verse )......Allah will reward to those who are thankful.\" (3.144) By Allah, it was as if the people never knew that Allah had revealed this Verse before till Abu Bakr recited it and all the people received it from him, and I heard everybody reciting it (then). Narrated Az-Zuhri: Sa`id bin Al-Musaiyab told me that `Umar said, \"By Allah, when I heard Abu Bakr reciting it, my legs could not support me and I fell down at the very moment of hearing him reciting it, declaring that the Prophet had died.\"",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "10567",
        "53",
        "20436"
      ]
    },
    {
      "hadith_no": "4498",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبد الله بن أبي شيبة، حدثنا يحيى بن سعيد، عن سفيان، عن موسى بن أبي عائشة، عن عبيد الله بن عبد الله بن عتبة، عن عائشة، وابن، عباس أن أبا بكر   رضى الله عنه  قبل النبي صلى الله عليه وسلم بعد موته‏.‏",
      "text_en": " Narrated Aisha and Ibn `Abbas:                     Abu Bakr kissed the Prophet after his death.",
      "chain": [
        "30201",
        "20031",
        "20012",
        "11399",
        "11004",
        "53",
        "17",
        "20436"
      ]
    },
    {
      "hadith_no": "4605",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أحمد بن يونس  أراه قال  حدثنا أبو بكر، عن أبي حصين، عن أبي الضحى، عن ابن عباس، ‏{‏حسبنا الله ونعم الوكيل‏}‏ قالها إبراهيم عليه السلام حين ألقي في النار، وقالها محمد صلى الله عليه وسلم حين قالوا ‏{‏إن الناس قد جمعوا لكم فاخشوهم فزادهم إيمانا وقالوا حسبنا الله ونعم الوكيل‏}‏",
      "text_en": " Narrated Ibn `Abbas:                     'Allah is Sufficient for us and He Is the Best Disposer of affairs,\" was said by Abraham when he was thrown into the fire; and it was said by Muhammad when they (i.e. hypocrites) said, \"A great army is gathering against you, therefore, fear them,\" but it only increased their faith and they said: \"Allah is Sufficient for us, and He is the Best Disposer (of affairs, for us).\" (3.173)",
      "chain": [
        "30184",
        "20436",
        "11371",
        "11392"
      ]
    },
    {
      "hadith_no": "4703",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن صالح، عن ابن شهاب، أن حميد بن عبد الرحمن، أخبره أن أبا هريرة أخبره أن أبا بكر  رضى الله عنه  بعثه في الحجة التي أمره رسول الله صلى الله عليه وسلم عليها قبل حجة الوداع في رهط يؤذن في الناس أن لا يحجن بعد العام مشرك ولا يطوف بالبيت عريان‏.‏ فكان حميد يقول يوم النحر يوم الحج الأكبر‏.‏ من أجل حديث أبي هريرة‏.‏",
      "text_en": " Narrated Humaid bin `Abdur-Rahman:                     Abu Huraira said that Abu Bakr sent him during the Hajj in which Abu Bakr was made the chief of the pilgrims by Allah's Apostle before (the year of) Hajjat al-Wada` in a group (of announcers) to announce before the people; 'No pagan shall perform the Hajj after this year, and none shall perform the Tawaf around the Ka`ba in a naked state. Humaid used to say The Day of Nahr is the day of Al- Hajj Al-Akbar (the Greatest Day) because of the narration of Abu Huraira.",
      "chain": [
        "30312",
        "20184",
        "20150",
        "11176",
        "11013",
        "10561",
        "13",
        "20436"
      ]
    },
    {
      "hadith_no": "4709",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا حبان، حدثنا همام، حدثنا ثابت، حدثنا أنس، قال حدثني أبو بكر  رضى الله عنه  قال كنت مع النبي صلى الله عليه وسلم في الغار، فرأيت آثار المشركين قلت يا رسول الله، لو أن أحدهم رفع قدمه رآنا‏.‏ قال ‏\"‏ ما ظنك باثنين الله ثالثهما ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakr:                     I was in the company of the Prophet in the cave, and on seeing the traces of the pagans, I said, \"O Allah's Apostle If one of them (pagans) should lift up his foot, he will see us.\" He said, \"What do you think of two, the third of whom is Allah?\"",
      "chain": [
        "30351",
        "20218",
        "20297",
        "11269",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "4816",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسماعيل، حدثنا أخي، عن ابن أبي ذئب، عن سعيد المقبري، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ يلقى إبراهيم أباه فيقول يا رب إنك وعدتني أن لا تخزني يوم يبعثون فيقول الله إني حرمت الجنة على الكافرين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, Abraham will meet his father (on the Day of Resurrection) and will say, 'O my Lords You promised me that You would not let me in disgrace on the Day when people will be resurrected.' Allah will say, 'I have forbidden Paradise to the non-believers.\"",
      "chain": [
        "30103",
        "20436",
        "20177",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "4937",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو بكر، عن حصين، عن عمرو بن ميمون، قال قال عمر رضى الله عنه أوصي الخليفة بالمهاجرين الأولين أن يعرف لهم حقهم، وأوصي الخليفة بالأنصار الذين تبوءوا الدار والإيمان من قبل أن يهاجر النبي صلى الله عليه وسلم أن يقبل من محسنهم ويعفو عن مسيئهم‏.‏",
      "text_en": " Narrated `Umar:                     I recommend that my successor should take care of and secure the rights of the early emigrants; and I also advise my successor to be kind to the Ansar who had homes (in Medina) and had adopted the Faith, before the Prophet migrated to them, and to accept the good from their good ones and excuse their wrong doers.",
      "chain": [
        "30184",
        "20436",
        "15097",
        "11382",
        "3"
      ]
    },
    {
      "hadith_no": "5049",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا خالد بن يزيد، حدثنا أبو بكر، عن أبي حصين، عن أبي صالح، عن أبي هريرة، قال كان يعرض على النبي صلى الله عليه وسلم القرآن كل عام مرة، فعرض عليه مرتين في العام الذي قبض، وكان يعتكف كل عام عشرا فاعتكف عشرين في العام الذي قبض ‏{‏فيه‏}‏",
      "text_en": " Narrated Abu-Huraira:                     Gabriel used to repeat the recitation of the Qur'an with the Prophet once a year, but he repeated it twice with him in the year he died. The Prophet used to stay in I`tikaf for ten days every year (in the month of Ramadan), but in the year of his death, he stayed in I`tikaf for twenty days.",
      "chain": [
        "11408",
        "20436",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "5133",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني أخي، عن سليمان، عن هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  قالت قلت يا رسول الله أرأيت لو نزلت واديا وفيه شجرة قد أكل منها، ووجدت شجرا لم يؤكل منها، في أيها كنت ترتع بعيرك قال ‏\"‏ في الذي لم يرتع منها ‏\"‏‏.‏ تعني أن رسول الله صلى الله عليه وسلم لم يتزوج بكرا غيرها‏.‏",
      "text_en": " Narrated `Aisha:                     I said, \"O Allah's Apostle! Suppose you landed in a valley where there is a tree of which something has been eaten and then you found trees of which nothing has been eaten, of which tree would you let your camel graze?\" He said, \"(I will let my camel graze) of the one of which nothing has been eaten before.\" (The sub-narrator added: `Aisha meant that Allah's Apostle had not married a virgin besides herself .)",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5345",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا إسماعيل بن أبي أويس، عن أخيه، عن سليمان، عن حميد الطويل، أنه سمع أنس بن مالك، يقول آلى رسول الله صلى الله عليه وسلم من نسائه، وكانت انفكت رجله فأقام في مشربة له تسعا وعشرين، ثم نزل فقالوا يا رسول الله آليت شهرا‏.‏ فقال ‏\"‏ الشهر تسع وعشرون ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle took an oath that he would abstain from his wives, and at that time his leg had been sprained (dislocated). So he stayed in the Mashruba (an attic room) of his for 29 days. Then he came down, and they (the people) said, \"O Allah's Apostle! You took an oath to abstain from your wives for one month.\" He said, \"The month is of twenty nine days.\"",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "5629",
      "source": " Sahih Bukhari ",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني أخي، عن سليمان، عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، عن عائشة  رضى الله عنها  قالت الضحية كنا نملح منه، فنقدم به إلى النبي صلى الله عليه وسلم بالمدينة فقال ‏\"‏ لا تأكلوا إلا ثلاثة أيام ‏\"‏‏.‏ وليست بعزيمة، ولكن أراد أن يطعم منه والله أعلم‏.‏",
      "text_en": " Narrated `Aisha:                     We used to salt some of the meat of sacrifice and present it to the Prophet at Medina. Once he said, \"Do not eat (of that meat) for more than three days.\" That was not a final order, but (that year) he wanted us to feed of it to others, Allah knows better.",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "5771",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا يحيى بن سعيد، حدثنا سفيان، قال حدثني موسى بن أبي عائشة، عن عبيد الله بن عبد الله، عن ابن عباس، وعائشة، أن أبا بكر  رضى الله عنه  قبل النبي صلى الله عليه وسلم وهو ميت‏.‏   قال وقالت عائشة لددناه في مرضه، فجعل يشير إلينا، أن لا تلدوني‏.‏ فقلنا كراهية المريض للدواء‏.‏ فلما أفاق قال ‏\"‏ ألم أنهكم أن تلدوني ‏\"‏‏.‏ قلنا كراهية المريض للدواء‏.‏ فقال ‏\"‏ لا يبقى في البيت أحد إلا لد  وأنا أنظر  إلا العباس فإنه لم يشهدكم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas and `Aisha:                     Abu Bakr kissed (the forehead of) the Prophet when he was dead. `Aisha added: We put medicine in one side of his mouth but he started waving us not to insert the medicine into his mouth. We said, \"He dislikes the medicine as a patient usually does.\" But when he came to his senses he said, \"Did I not forbid you to put medicine (by force) in the side of my mouth?\" We said, \"We thought it was just because a patient usually dislikes medicine.\" He said, \"None of those who are in the house but will be forced to take medicine in the side of his mouth while I am watching, except Al-`Abbas, for he had not witnessed your deed.\"",
      "chain": [
        "30026",
        "20031",
        "20012",
        "11399",
        "11004",
        "17",
        "53",
        "20436"
      ]
    },
    {
      "hadith_no": "5939",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني محمد بن عبد الله الأنصاري، قال حدثني أبي، عن ثمامة، عن أنس، أن أبا بكر  رضى الله عنه  لما استخلف كتب له، وكان نقش الخاتم ثلاثة أسطر‏.‏ محمد سطر، ورسول سطر، والله سطر‏.‏",
      "text_en": " Narrated Anas:                     that when Abu Bakr became the Caliph, he wrote a letter to him (and stamped it with the Prophet's ring) and the engraving of the ring was in three lines: Muhammad in one line, 'Apostle' in another line, and 'Allah' in a third line. Anas added: 'the ring of the Prophet was in his hand, and after him, in Abu Bakr's hand, and then in `Umar's hand after Abu Bakr. When `Uthman was the Caliph, once he was sitting at the well of Aris. He removed the ring from his hand and while he was trifling with it, dropped into the well. We kept on going to the well with `Uthman for three days looking for the ring, and finally the well was drained, but the ring was not found.",
      "chain": [
        "20280",
        "11599",
        "11270",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "6511",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني يحيى بن يوسف، أخبرنا أبو بكر، عن أبي حصين، عن أبي صالح، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تعس عبد الدينار والدرهم والقطيفة والخميصة، إن أعطي رضي، وإن لم يعط لم يرض ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Perish the slave of Dinar, Dirham, Qatifa (thick soft cloth), and Khamisa (a garment), for if he is given, he is pleased; otherwise he is dissatisfied.\"",
      "chain": [
        "30282",
        "20436",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "6523",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو بكر، حدثنا أبو حصين، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ ليس الغنى عن كثرة العرض، ولكن الغنى غنى النفس ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Riches does not mean, having a great amount of property, but riches is selfcontentment.\"",
      "chain": [
        "30184",
        "20436",
        "11371",
        "11161",
        "13"
      ]
    }
  ],
  "total_hadiths": 239
}