{
  "id": "20436",
  "name": "Abu Bakr bin Abi Uvais أبو بكر بن أبي أويس",
  "full_name": "Abu Bakr bin Abi Uvais أبو بكر بن أبي أويس",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "202",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Medina"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  م  د  ت  س  -  ثقة ]"
    ],
    "tags": [
      "al-Asbahi",
      "Ally B. Taym",
      "Madni"
    ]
  },
  "parents": [
    {
      "id": "20506",
      "name": "Abu Uvais al-Madni أبو أويس المدني الأصبحي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "spouses": [],
  "siblings": [
    {
      "id": "30103",
      "name": "Isma'il bin 'Abdullah bin 'Abdullah إسماعيل بن عبد الله بن عبد الله بن أويس",
      "grade": "3rd Century AH [10th generation]"
    }
  ],
  "children": [],
  "teachers": [
    {
      "id": "20506",
      "name": "Abu Uvais al-Madni أبو أويس المدني الأصبحي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "21725",
      "name": "al-Rabi' bin Malik bin Abi 'Amir الربيع بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi')"
    },
    {
      "id": "20177",
      "name": "Muhammad bin 'Abdur Rahman b. Abi Dh'ab محمد بن عبد الرحمن بن أبي ذئب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "10616",
      "name": "Muhammad bin Ajlan al-Madni محمد بن عجلان المدني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20001",
      "name": "Imam Maalik مالك بن أنس بن مالك بن أبي عامر",
      "grade": "Succ. (Taba' Tabi') [7th generation] [Maliki]"
    },
    {
      "id": "20160",
      "name": "Sulaiman bin Bilal al-Taymi سليمان بن بلال التيمي",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20012",
      "name": "Sufyan bin Sa‘id Ath-Thawri سفيان الثوري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "26529",
      "name": "Hisham bin Sa'id al-Talaqani هشام بن سعيد الطالقاني أبو أحمد البزاز",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "students": [
    {
      "id": "30103",
      "name": "Isma'il bin 'Abdullah bin 'Abdullah إسماعيل بن عبد الله بن عبد الله بن أويس",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20158",
      "name": "Ayoub bin Sulaiman bin Bilal أيوب بن سليمان بن بلال",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "30021",
      "name": "Ishaq bin Rahwaya إسحاق بن راهويه",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30375",
      "name": "Muhammad bin Rafa'i محمد بن رافع",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30008",
      "name": "Ibn Sa'd محمد بن سعد البغدادي",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "36056",
      "name": "Muhammad bin 'Abdullah bin 'Abdul Hakam محمد بن عبد الله بن عبد الحكم",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "120",
      "source": " Sahih Bukhari ",
      "chapter": "Knowledge - كتاب العلم",
      "chapter_no": "3",
      "text_ar": "حدثنا إسماعيل، قال حدثني أخي، عن ابن أبي ذئب، عن سعيد المقبري، عن أبي هريرة، قال حفظت من رسول الله صلى الله عليه وسلم وعاءين، فأما أحدهما فبثثته، وأما الآخر فلو بثثته قطع هذا البلعوم‏.‏",
      "text_en": " Narrated Abu Huraira:                     I have memorized two kinds of knowledge from Allah's Apostle . I have propagated one of them to you and if I propagated the second, then my pharynx (throat) would be cut (i.e. killed).",
      "chain": [
        "30103",
        "20436",
        "20177",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "534",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أيوب بن سليمان، قال حدثنا أبو بكر، عن سليمان، قال صالح بن كيسان حدثنا الأعرج عبد الرحمن، وغيره، عن أبي هريرة‏.‏ونافع مولى عبد الله بن عمر عن عبد الله بن عمر، أنهما حدثاه عن رسول الله صلى الله عليه وسلم أنه قال ‏\"‏ إذا اشتد الحر فأبردوا عن الصلاة، فإن شدة الحر من فيح جهنم ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira and `Abdullah bin `Umar:                     Allah's Apostle said, \"If it is very hot, then pray the Zuhr prayer when it becomes (a bit) cooler, as the severity of the heat is from the raging of the Hell-fire.\"",
      "chain": [
        "20158",
        "20436",
        "20160",
        "11176"
      ]
    },
    {
      "hadith_no": "569",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا أيوب بن سليمان، قال حدثني أبو بكر، عن سليمان، قال صالح بن كيسان أخبرني ابن شهاب، عن عروة، أن عائشة، قالت أعتم رسول الله صلى الله عليه وسلم بالعشاء حتى ناداه عمر الصلاة، نام النساء والصبيان‏.‏ فخرج فقال ‏\"‏ ما ينتظرها أحد من أهل الأرض غيركم ‏\"‏‏.‏ قال ولا يصلى يومئذ إلا بالمدينة، وكانوا يصلون فيما بين أن يغيب الشفق إلى ثلث الليل الأول‏.‏",
      "text_en": " Narrated Ibn Shihab from `Urwa:                     `Aisha said, \"Once Allah's Apostle delayed the `Isha' prayer till `Umar reminded him by saying, \"The prayer!\" The women and children have slept. Then the Prophet came out and said, 'None amongst the dwellers of the earth has been waiting for it (the prayer) except you.\" `Urwa said, \"Nowhere except in Medina the prayer used to be offered (in those days).\" He further said, \"The Prophet used to offer the `Isha' prayer in the period between the disappearance of the twilight and the end of the first third of the night.\"",
      "chain": [
        "20158",
        "20436",
        "20160",
        "11176",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "577",
      "source": " Sahih Bukhari ",
      "chapter": "Times of the Prayers - كتاب مواقيت الصلاة",
      "chapter_no": "9",
      "text_ar": "حدثنا إسماعيل بن أبي أويس، عن أخيه، عن سليمان، عن أبي حازم، أنه سمع سهل بن سعد، يقول كنت أتسحر في أهلي ثم يكون سرعة بي أن أدرك صلاة الفجر مع رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Sahl bin Sa`d:                     I used to take the \"Suhur\" meal with my family and hasten so as to catch the Fajr (morning prayer) with Allah's Apostle.",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "1029",
      "source": " Sahih Bukhari ",
      "chapter": "Invoking Allah for Rain (Istisqaa) - كتاب الاستسقاء",
      "chapter_no": "15",
      "text_ar": "قال أيوب بن سليمان حدثني أبو بكر بن أبي أويس، عن سليمان بن بلال، قال يحيى بن سعيد سمعت أنس بن مالك، قال أتى رجل أعرابي من أهل البدو إلى رسول الله صلى الله عليه وسلم يوم الجمعة فقال يا رسول الله، هلكت الماشية هلك العيال هلك الناس‏.‏ فرفع رسول الله صلى الله عليه وسلم يديه يدعو، ورفع الناس أيديهم معه يدعون، قال فما خرجنا من المسجد حتى مطرنا، فما زلنا نمطر حتى كانت الجمعة الأخرى، فأتى الرجل إلى نبي الله صلى الله عليه وسلم فقال يا رسول الله، بشق المسافر، ومنع الطريق‏.‏",
      "text_en": " Narrated Anas bin Malik:                      A bedouin came to Allah's Messenger () on a Friday  and said, \"O Allah's Messenger ! The livestock, the offspring, and the people have perished.\" So, Allah's Messenger (saw) raised both his hands invoking Allah (for rain) and the people too raised their hands with Allah's Messenger () invoking Allah (for rain). We had not left the mosque when it started raining. It rained till the next Friday when the same man came to Allah's Messenger () and said, \"O Allah's Messenger! The travelers are compelled to postpone their journeys (because of excessive rain) and the roads are overflowed.\"",
      "chain": [
        "20158",
        "20436",
        "20160",
        "11062",
        "19"
      ]
    },
    {
      "hadith_no": "1077",
      "source": " Sahih Bukhari ",
      "chapter": "Prostration During Recital of Qur'an - كتاب سجود القرآن",
      "chapter_no": "17",
      "text_ar": "حدثنا إبراهيم بن موسى، قال أخبرنا هشام بن يوسف، أن ابن جريج، أخبرهم قال أخبرني أبو بكر بن أبي مليكة، عن عثمان بن عبد الرحمن التيمي، عن ربيعة بن عبد الله بن الهدير التيمي  قال أبو بكر وكان ربيعة من خيار الناس عما حضر ربيعة من عمر بن الخطاب  رضى الله عنه  قرأ يوم الجمعة على المنبر بسورة النحل حتى إذا جاء السجدة نزل فسجد وسجد الناس، حتى إذا كانت الجمعة القابلة قرأ بها حتى إذا جاء السجدة قال يا أيها الناس إنا نمر بالسجود فمن سجد فقد أصاب، ومن لم يسجد فلا إثم عليه‏.‏ ولم يسجد عمر  رضى الله عنه‏.‏ وزاد نافع عن ابن عمر  رضى الله عنهما إن الله لم يفرض السجود إلا أن نشاء‏.‏",
      "text_en": " Narrated Rabi`a:                     `Umar bin Al-Khattab recited Surat-an-Nahl on a Friday on the pulpit and when he reached the verse of Sajda he got down from the pulpit and prostrated and the people also prostrated. The next Friday `Umar bin Al-Khattab recited the same Sura and when he reached the verse of Sajda he said, \"O people! When we recite the verses of Sajda (during the sermon) whoever prostrates does the right thing, yet it is no sin for the one who does not prostrate.\" And `Umar did not prostrate (that day). Added Ibn `Umar \"Allah has not made the prostration of recitation compulsory but if we wish we can do it.\"",
      "chain": [
        "30309",
        "20467",
        "11070",
        "11569",
        "11525",
        "20436"
      ]
    },
    {
      "hadith_no": "1205",
      "source": " Sahih Bukhari ",
      "chapter": "Actions while Praying - كتاب العمل فى الصلاة",
      "chapter_no": "21",
      "text_ar": "حدثنا بشر بن محمد، أخبرنا عبد الله، قال يونس قال الزهري أخبرني أنس بن مالك، أن المسلمين، بينا هم في الفجر يوم الاثنين، وأبو بكر  رضى الله عنه  يصلي بهم ففجأهم النبي صلى الله عليه وسلم قد كشف ستر حجرة عائشة  رضى الله عنها  فنظر إليهم، وهم صفوف، فتبسم يضحك، فنكص أبو بكر  رضى الله عنه  على عقبيه، وظن أن رسول الله صلى الله عليه وسلم يريد أن يخرج إلى الصلاة، وهم المسلمون أن يفتتنوا في صلاتهم فرحا بالنبي صلى الله عليه وسلم حين رأوه، فأشار بيده أن أتموا، ثم دخل الحجرة وأرخى الستر، وتوفي ذلك اليوم‏.‏",
      "text_en": "      Narrated Anas bin Malik:                          While Abu Bakr was leading the people in the morning prayer on a      Monday, the Prophet came towards them suddenly having lifted the      curtain of 'Aisha's house, and looked at them as they were standing in     rows and smiled. Abu Bakr tried to come back thinking that Allah's      Apostle wanted to come out for the prayer. The attention of the      Muslims was diverted from the prayer because they were delighted to      see the Prophet. The Prophet waved his hand to them to complete their      prayer, then he went back into the room and let down the curtain. The      Prophet expired on that very day.",
      "chain": [
        "30318",
        "20025",
        "20475",
        "11013",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "1464",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن معاوية بن أبي مزرد، عن أبي الحباب، عن أبي هريرة  رضى الله عنه  أن النبي صلى الله عليه وسلم قال ‏\"‏ ما من يوم يصبح العباد فيه إلا ملكان ينزلان فيقول أحدهما اللهم أعط منفقا خلفا، ويقول الآخر اللهم أعط ممسكا تلفا ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Every day two angels come down from Heaven and one of them says, 'O Allah! Compensate every person who spends in Your Cause,' and the other (angel) says, 'O Allah! Destroy every miser.' \"",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11541",
        "13"
      ]
    },
    {
      "hadith_no": "1474",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عبد الله، قال حدثني أبي قال، حدثني ثمامة، أن أنسا، حدثه أن أبا بكر  رضى الله عنه  كتب له التي فرض رسول الله صلى الله عليه وسلم ‏\"‏ وما كان من خليطين فإنهما يتراجعان بينهما بالسوية ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     Abu Bakr wrote to me what Allah's Apostle has made compulsory (regarding Zakat) and this was mentioned in it: If a property is equally owned by two partners, they should pay the combined Zakat and it will be considered that both of them have paid their Zakat equally.",
      "chain": [
        "30561",
        "11270",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "1477",
      "source": " Sahih Bukhari ",
      "chapter": "Obligatory Charity Tax (Zakat) - كتاب الزكاة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن عبد الله بن المثنى الأنصاري، قال حدثني أبي قال، حدثني ثمامة بن عبد الله بن أنس، أن أنسا، حدثه أن أبا بكر  رضى الله عنه  كتب له هذا الكتاب لما وجهه إلى البحرين بسم الله الرحمن الرحيم ‏\"‏ هذه فريضة الصدقة التي فرض رسول الله صلى الله عليه وسلم على المسلمين، والتي أمر الله بها رسوله، فمن سئلها من المسلمين على وجهها فليعطها، ومن سئل فوقها فلا يعط في أربع وعشرين من الإبل فما دونها من الغنم من كل خمس شاة، إذا بلغت خمسا وعشرين إلى خمس وثلاثين ففيها بنت مخاض أنثى، فإذا بلغت ستا وثلاثين إلى خمس وأربعين ففيها بنت لبون أنثى، فإذا بلغت ستا وأربعين إلى ستين ففيها حقة طروقة الجمل، فإذا بلغت واحدة وستين إلى خمس وسبعين ففيها جذعة، فإذا بلغت  يعني  ستا وسبعين إلى تسعين ففيها بنتا لبون، فإذا بلغت إحدى وتسعين إلى عشرين ومائة ففيها حقتان طروقتا الجمل، فإذا زادت على عشرين ومائة ففي كل أربعين بنت لبون، وفي كل خمسين حقة، ومن لم يكن معه إلا أربع من الإبل فليس فيها صدقة، إلا أن يشاء ربها، فإذا بلغت خمسا من الإبل ففيها شاة، وفي صدقة الغنم في سائمتها إذا كانت أربعين إلى عشرين ومائة شاة، فإذا زادت على عشرين ومائة إلى مائتين شاتان، فإذا زادت على مائتين إلى ثلاثمائة ففيها ثلاث، فإذا زادت على ثلاثمائة ففي كل مائة شاة، فإذا كانت سائمة الرجل ناقصة من أربعين شاة واحدة فليس فيها صدقة، إلا أن يشاء ربها، وفي الرقة ربع العشر، فإن لم تكن إلا تسعين ومائة فليس فيها شىء، إلا أن يشاء ربها ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     When Abu Bakr; sent me to (collect the Zakat from) Bahrain, he wrote to me the following:-- (In the name of Allah, the Beneficent, the Merciful). These are the orders for compulsory charity (Zakat) which Allah's Apostle had made obligatory for every Muslim, and which Allah had ordered His Apostle to observe: Whoever amongst the Muslims is asked to pay Zakat accordingly, he should pay it (to the Zakat collector) and whoever is asked more than that (what is specified in this script) he should not pay it; for twenty-four camels or less, sheep are to be paid as Zakat; for every five camels one sheep is to be paid, and if there are between twenty-five to thirty-five camels, one Bint Makhad is to be paid; and if they are between thirty-six to forty-five (camels), one Bint Labun is to be paid; and if they are between forty-six to sixty (camels), one Hiqqa is to be paid; and if the number is between sixty-one to seventy-five (camels), one Jadha is to be paid; and if the number is between seventy-six to ninety (camels), two Bint Labuns are to be paid; and if they are from ninety-one to one-hundredand twenty (camels), two Hiqqas are to be paid; and if they are over one-hundred and-twenty (camels), for every forty (over one-hundred-and-twenty) one Bint Labun is to be paid, and for every fifty camels (over one-hundred-and-twenty) one Hiqqa is to be paid; and who ever has got only four camels, has to pay nothing as Zakat, but if the owner of these four camels wants to give something, he can. If the number of camels increases to five, the owner has to pay one sheep as Zakat. As regards the Zakat for the (flock) of sheep; if they are between forty and one-hundred-and-twenty sheep, one sheep is to be paid; and if they are between one-hundred-and-twenty to two hundred (sheep), two sheep are to be paid; and if they are between two-hundred to three-hundred (sheep), three sheep are to be paid; and for over three-hundred sheep, for every extra hundred sheep, one sheep is to be paid as Zakat. And if somebody has got less than forty sheep, no Zakat is required, but if he wants to give, he can. For silver the Zakat is one-fortieth of the lot (i.e. 2.5%), and if its value is less than two-hundred Dirhams, Zakat is not required, but if the owner wants to pay he can.'",
      "chain": [
        "11270",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "1680",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا علي، سمع أبا بكر بن عياش، حدثنا عبد العزيز، لقيت أنسا‏.‏ وحدثني إسماعيل بن أبان، حدثنا أبو بكر، عن عبد العزيز، قال خرجت إلى منى يوم التروية فلقيت أنسا  رضى الله عنه  ذاهبا على حمار فقلت أين صلى النبي صلى الله عليه وسلم هذا اليوم الظهر فقال انظر حيث يصلي أمراؤك فصل‏.‏",
      "text_en": " Narrated `Abdul `Aziz:                     I went out to Mina on the day of Tarwiya and met Anas going on a donkey. I asked him, \"Where did the Prophet offer the Zuhr prayer on this day?\" Anas replied, \"See where your chiefs pray and pray similarly.\"",
      "chain": [
        "30026",
        "20373",
        "20312",
        "20436",
        "11295"
      ]
    },
    {
      "hadith_no": "1748",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا أحمد بن يونس، أخبرنا أبو بكر، عن عبد العزيز بن رفيع، عن عطاء، عن ابن عباس  رضى الله عنهما  قال رجل للنبي صلى الله عليه وسلم زرت قبل أن أرمي‏.‏ قال ‏\"‏ لا حرج ‏\"‏‏.‏ قال حلقت قبل أن أذبح‏.‏ قال ‏\"‏ لا حرج ‏\"‏‏.‏ قال ذبحت قبل أن أرمي‏.‏ قال ‏\"‏ لا حرج ‏\"‏‏.‏ وقال عبد الرحيم الرازي عن ابن خثيم أخبرني عطاء عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم‏.‏ وقال القاسم بن يحيى حدثني ابن خثيم عن عطاء عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم‏.‏   وقال عفان أراه عن وهيب، حدثنا ابن خثيم، عن سعيد بن جبير، عن ابن عباس  رضى الله عنهما  عن النبي صلى الله عليه وسلم‏.‏ وقال حماد عن قيس بن سعد وعباد بن منصور عن عطاء عن جابر  رضى الله عنه  عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A man said to the Prophet \"I performed the Tawaf-al-Ifada before the Rami (throwing pebbles at the Jamra).\" The Prophet replied, \"There is no harm.\" The man said, \"I had my head shaved before slaughtering.\" The Prophet replied, \"There is no harm.\" He said, \"I have slaughtered the Hadi before the Rami.\" The Prophet replied, \"There is no harm.\"",
      "chain": [
        "30184",
        "20436",
        "11257",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "1779",
      "source": " Sahih Bukhari ",
      "chapter": "Hajj (Pilgrimage) - كتاب الحج",
      "chapter_no": "25",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني أخي، عن سليمان، عن يونس بن يزيد، عن ابن شهاب، عن سالم بن عبد الله، أن عبد الله بن عمر  رضى الله عنهما  كان يرمي الجمرة الدنيا بسبع حصيات، ثم يكبر على إثر كل حصاة، ثم يتقدم فيسهل، فيقوم مستقبل القبلة قياما طويلا، فيدعو ويرفع يديه، ثم يرمي الجمرة الوسطى كذلك، فيأخذ ذات الشمال فيسهل، ويقوم مستقبل القبلة قياما طويلا، فيدعو ويرفع يديه، ثم يرمي الجمرة ذات العقبة من بطن الوادي، ولا يقف عندها، ويقول هكذا رأيت رسول الله صلى الله عليه وسلم يفعل‏.‏",
      "text_en": " Narrated Salim bin `Abdullah:                     `Abdullah bin `Umar used to do Rami of the Jamrat-ud-Dunya with seven small pebbles and used to recite Takbir on throwing each stone. He, then, would proceed further till he reached the level ground, where he would stay for a long time, facing the Qibla to invoke (Allah) while raising his hands. Then he would do Rami of the Jamrat-ul-Wusta similarly and would go to the left towards the level ground, where he would stand for a long time facing the Qibla to invoke (Allah) while raising his hands. Then he would do Rami of the Jamrat-ul-Aqaba from the middle of the valley, but he would not stay by it. Ibn `Umar used to say, \"I saw Allah's Apostle doing like that.\"",
      "chain": [
        "30103",
        "20436",
        "20160",
        "20475",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1902",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of Madinah - كتاب فضائل المدينة",
      "chapter_no": "29",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني أخي، عن سليمان، عن عبيد الله، عن سعيد المقبري، عن أبي هريرة  رضى الله عنه  أن النبي صلى الله عليه وسلم قال ‏\"‏ حرم ما بين لابتى المدينة على لساني ‏\"‏‏.‏ قال وأتى النبي صلى الله عليه وسلم بني حارثة فقال ‏\"‏ أراكم يا بني حارثة قد خرجتم من الحرم ‏\"‏‏.‏ ثم التفت، فقال ‏\"‏ بل أنتم فيه ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"I have made Medina a sanctuary between its two (Harrat) mountains.\" The Prophet went to the tribe of Bani Haritha and said (to them), \"I see that you have gone out of the sanctuary,\" but looking around, he added, \"No, you are inside the sanctuary.\"",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11201",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "1958",
      "source": " Sahih Bukhari ",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو بكر، عن سليمان، عن ابن أبي أوفى  رضى الله عنه  قال كنت مع النبي صلى الله عليه وسلم في سفر، فصام حتى أمسى، قال لرجل ‏\"‏ انزل، فاجدح لي ‏\"‏‏.‏ قال لو انتظرت حتى تمسي‏.‏ قال ‏\"‏ انزل، فاجدح لي، إذا رأيت الليل قد أقبل من ها هنا فقد أفطر الصائم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn Abi `Aufa:                     I was with the Prophet on a journey, and he observed the fast till evening. The Prophet said to a man, \"Get down and mix Sawiq with water for me.\" He replied, \"Will you wait till it is evening?\" The Prophet said, \"Get down and mix Sawiq with water for me; when you see night falling from this side, the fasting person should break his fast.\"",
      "chain": [
        "30184",
        "20436",
        "20160",
        "5115"
      ]
    },
    {
      "hadith_no": "2039",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال أخبرني أخي، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن علي بن الحسين  رضى الله عنهما  أن صفية، أخبرته‏.‏ حدثنا علي بن عبد الله، حدثنا سفيان، قال سمعت الزهري، يخبر عن علي بن الحسين، أن صفية  رضى الله عنها  أتت النبي صلى الله عليه وسلم وهو معتكف، فلما رجعت مشى معها، فأبصره رجل من الأنصار، فلما أبصره دعاه فقال ‏\"‏ تعال هي صفية  وربما قال سفيان هذه صفية  فإن الشيطان يجري من ابن آدم مجرى الدم ‏\"‏‏.‏ قلت لسفيان أتته ليلا قال وهل هو إلا ليل",
      "text_en": " Narrated `Ali bin Al-Husain from Safiya:                     Safiya went to the Prophet while he was in I`tikaf. When she returned, the Prophet accompanied her walking. An Ansari man saw him. When the Prophet noticed him, he called him and said, \"Come here. She is Safiya. (Sufyan a sub-narrator perhaps said that the Prophet had said, \"This is Safiya\"). And Satan circulates in the body of Adam's offspring as his blood circulates in it.\" (A sub-narrator asked Sufyan, \"Did Safiya visit him at night?\" He said, \"Of course, at night.\")",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11013",
        "11045"
      ]
    },
    {
      "hadith_no": "2042",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا إسماعيل بن عبد الله، عن أخيه، عن سليمان، عن عبيد الله بن عمر، عن نافع، عن عبد الله بن عمر، عن عمر بن الخطاب  رضى الله عنه  أنه قال يا رسول الله إني نذرت في الجاهلية أن أعتكف ليلة في المسجد الحرام‏.‏ فقال له النبي صلى الله عليه وسلم ‏\"‏ أوف نذرك ‏\"‏‏.‏ فاعتكف ليلة‏.‏",
      "text_en": " Narrated `Abdullah bin `Umar:                     `Umar bin Al-Khattab said, \"O Allah's Apostle! I vowed in the Pre-Islamic period to perform I`tikaf in Al-Masjid-al-Haram for one night.\" The Prophet said, \"Fulfill your vow.\" So, he performed I`tikaf for one night.",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11201",
        "11014",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "2044",
      "source": " Sahih Bukhari ",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثنا عبد الله بن أبي شيبة، حدثنا أبو بكر، عن أبي حصين، عن أبي صالح، عن أبي هريرة  رضى الله عنه  قال كان النبي صلى الله عليه وسلم يعتكف في كل رمضان عشرة أيام، فلما كان العام الذي قبض فيه اعتكف عشرين يوما‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet used to perform I`tikaf every year in the month of Ramadan for ten days, and when it was the year of his death, he stayed in I`tikaf for twenty days.",
      "chain": [
        "30201",
        "20436",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "2487",
      "source": " Sahih Bukhari ",
      "chapter": "Partnership - كتاب الشركة",
      "chapter_no": "47",
      "text_ar": "حدثنا محمد بن عبد الله بن المثنى، قال حدثني أبي قال، حدثني ثمامة بن عبد الله بن أنس، أن أنسا، حدثه أن أبا بكر  رضى الله عنه  كتب له فريضة الصدقة التي فرض رسول الله صلى الله عليه وسلم قال ‏\"‏ وما كان من خليطين فإنهما يتراجعان بينهما بالسوية ‏\"‏‏.‏",
      "text_en": " Narrated Anas:                     that Abu Bakr As-Siddiq wrote to him the law of Zakat which was made obligatory by Allah's Apostle. He wrote: 'Partners possessing joint property (sheep) have to pay its Zakat equally.",
      "chain": [
        "11270",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "2581",
      "source": " Sahih Bukhari ",
      "chapter": "Gifts - كتاب الهبة وفضلها والتحريض عليها",
      "chapter_no": "51",
      "text_ar": "حدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  أن نساء، رسول الله صلى الله عليه وسلم كن حزبين فحزب فيه عائشة وحفصة وصفية وسودة، والحزب الآخر أم سلمة وسائر نساء رسول الله صلى الله عليه وسلم، وكان المسلمون قد علموا حب رسول الله صلى الله عليه وسلم عائشة، فإذا كانت عند أحدهم هدية يريد أن يهديها إلى رسول الله صلى الله عليه وسلم أخرها، حتى إذا كان رسول الله صلى الله عليه وسلم في بيت عائشة بعث صاحب الهدية إلى رسول الله صلى الله عليه وسلم في بيت عائشة، فكلم حزب أم سلمة، فقلن لها كلمي رسول الله صلى الله عليه وسلم يكلم الناس، فيقول من أراد أن يهدي إلى رسول الله صلى الله عليه وسلم هدية فليهده إليه حيث كان من بيوت نسائه، فكلمته أم سلمة بما قلن، فلم يقل لها شيئا، فسألنها‏.‏ فقالت ما قال لي شيئا‏.‏ فقلن لها فكلميه‏.‏ قالت فكلمته حين دار إليها أيضا، فلم يقل لها شيئا، فسألنها‏.‏ فقالت ما قال لي شيئا‏.‏ فقلن لها كلميه حتى يكلمك‏.‏ فدار إليها فكلمته‏.‏ فقال لها ‏\"‏ لا تؤذيني في عائشة، فإن الوحى لم يأتني، وأنا في ثوب امرأة إلا عائشة ‏\"‏‏.‏ قالت فقالت أتوب إلى الله من أذاك يا رسول الله‏.‏ ثم إنهن دعون فاطمة بنت رسول الله صلى الله عليه وسلم فأرسلن إلى رسول الله صلى الله عليه وسلم تقول إن نساءك ينشدنك الله العدل في بنت أبي بكر‏.‏ فكلمته‏.‏ فقال ‏\"‏ يا بنية، ألا تحبين ما أحب ‏\"‏‏.‏ قالت بلى‏.‏ فرجعت إليهن، فأخبرتهن‏.‏ فقلن ارجعي إليه‏.‏ فأبت أن ترجع، فأرسلن زينب بنت جحش، فأتته فأغلظت، وقالت إن نساءك ينشدنك الله العدل في بنت ابن أبي قحافة‏.‏ فرفعت صوتها، حتى تناولت عائشة‏.‏ وهى قاعدة، فسبتها حتى إن رسول الله صلى الله عليه وسلم لينظر إلى عائشة هل تكلم قال فتكلمت عائشة ترد على زينب، حتى أسكتتها‏.‏ قالت فنظر النبي صلى الله عليه وسلم إلى عائشة، وقال ‏\"‏ إنها بنت أبي بكر ‏\"‏‏.‏ قال البخاري الكلام الأخير قصة فاطمة يذكر عن هشام بن عروة عن رجل عن الزهري عن محمد بن عبد الرحمن‏.‏ وقال أبو مروان عن هشام عن عروة كان الناس يتحرون بهداياهم يوم عائشة‏.‏ وعن هشام عن رجل من قريش، ورجل من الموالي، عن الزهري عن محمد بن عبد الرحمن بن الحارث بن هشام قالت عائشة كنت عند النبي صلى الله عليه وسلم فاستأذنت فاطمة‏.‏",
      "text_en": " Narrated `Urwa from `Aisha:                     The wives of Allah's Apostle were in two groups. One group consisted of `Aisha, Hafsa, Safiyya and Sauda; and the other group consisted of Um Salama and the other wives of Allah's Apostle. The Muslims knew that Allah's Apostle loved `Aisha, so if any of them had a gift and wished to give to Allah's Apostle, he would delay it, till Allah's Apostle had come to `Aisha's home and then he would send his gift to Allah's Apostle in her home. The group of Um Salama discussed the matter together and decided that Um Salama should request Allah's Apostle to tell the people to send their gifts to him in whatever wife's house he was. Um Salama told Allah's Apostle of what they had said, but he did not reply. Then they (those wives) asked Um Salama about it. She said, \"He did not say anything to me.\" They asked her to talk to him again. She talked to him again when she met him on her day, but he gave no reply. When they asked her, she replied that he had given no reply. They said to her, \"Talk to him till he gives you a reply.\" When it was her turn, she talked to him again. He then said to her, \"Do not hurt me regarding Aisha, as the Divine Inspirations do not come to me on any of the beds except that of Aisha.\" On that Um Salama said, \"I repent to Allah for hurting you.\" Then the group of Um Salama called Fatima, the daughter of Allah's Apostle and sent her to Allah's Apostle to say to him, \"Your wives request to treat them and the daughter of Abu Bakr on equal terms.\" Then Fatima conveyed the message to him. The Prophet said, \"O my daughter! Don't you love whom I love?\" She replied in the affirmative and returned and told them of the situation. They requested her to go to him again but she refused. They then sent Zainab bint Jahsh who went to him and used harsh words saying, \"Your wives request you to treat them and the daughter of Ibn Abu Quhafa on equal terms.\" On that she raised her voice and abused `Aisha to her face so much so that Allah's Apostle looked at `Aisha to see whether she would retort. `Aisha started replying to Zainab till she silenced her. The Prophet then looked at `Aisha and said, \"She is really the daughter of Abu Bakr.\"",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2705",
      "source": " Sahih Bukhari ",
      "chapter": "Peacemaking - كتاب الصلح",
      "chapter_no": "53",
      "text_ar": "حدثنا إسماعيل بن أبي أويس، قال حدثني أخي، عن سليمان، عن يحيى بن سعيد، عن أبي الرجال، محمد بن عبد الرحمن أن أمه، عمرة بنت عبد الرحمن قالت سمعت عائشة  رضى الله عنها  تقول سمع رسول الله صلى الله عليه وسلم صوت خصوم بالباب عالية أصواتهما، وإذا أحدهما يستوضع الآخر، ويسترفقه في شىء وهو يقول والله لا أفعل‏.‏ فخرج عليهما رسول الله صلى الله عليه وسلم فقال ‏\"‏ أين المتألي على الله لا يفعل المعروف ‏\"‏‏.‏ فقال أنا يا رسول الله، وله أى ذلك أحب‏.‏",
      "text_en": " Narrated Aisha:                     Once Allah's Apostle heard the loud voices of some opponents quarreling at the door. One of them was appealing to the other to deduct his debt and asking him to be lenient but the other was saying, \"By Allah I will not do so.\" Allah's Apostle went out to them and said, \"Who is the one who was swearing by Allah that he would not do a favor?\" That man said, \"I am that person, O Allah's Apostle! I will give my opponent whatever he wishes.\"",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11062",
        "10959",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "2886",
      "source": " Sahih Bukhari ",
      "chapter": "Fighting for the Cause of Allah (Jihaad) - كتاب الجهاد والسير",
      "chapter_no": "56",
      "text_ar": "حدثنا يحيى بن يوسف، أخبرنا أبو بكر، عن أبي حصين، عن أبي صالح، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ تعس عبد الدينار والدرهم والقطيفة والخميصة، إن أعطي رضي، وإن لم يعط لم يرض ‏\"‏‏.‏ لم يرفعه إسرائيل عن أبي حصين‏.‏",
      "text_en": "      Narrated Abu Huraira:                          The Prophet said, \"Let the slave of Dinar and Dirham of Quantify and      Khamisa (i.e. money and luxurious clothes) perish for he is pleased if     these things are given to him, and if not, he is displeased!\"",
      "chain": [
        "30282",
        "20436",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3106",
      "source": " Sahih Bukhari ",
      "chapter": "One-fifth of Booty to the Cause of Allah (Khumus) - كتاب فرض الخمس",
      "chapter_no": "57",
      "text_ar": "حدثنا محمد بن عبد الله الأنصاري، قال حدثني أبي، عن ثمامة، عن أنس، أن أبا بكر  رضى الله عنه  لما استخلف بعثه إلى البحرين، وكتب له هذا الكتاب وختمه، وكان نقش الخاتم ثلاثة أسطر محمد سطر، ورسول سطر، والله سطر‏.‏",
      "text_en": " Narrated Anas:                     That when Abu Bakr became the Caliph, he sent him to Bahrain and wrote this letter for him, and stamped it with the Ring of the Prophet. Three lines were engraved on the Ring, (the word) 'Muhammad' was in a line, 'Apostle' was in another line, and 'Allah' in a third.",
      "chain": [
        "20280",
        "11599",
        "11270",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "3269",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا إسماعيل بن أبي أويس، قال حدثني أخي، عن سليمان بن بلال، عن يحيى بن سعيد، عن سعيد بن المسيب، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ يعقد الشيطان على قافية رأس أحدكم إذا هو نام ثلاث عقد، يضرب كل عقدة مكانها عليك ليل طويل فارقد‏.‏ فإن استيقظ فذكر الله انحلت عقدة، فإن توضأ انحلت عقدة، فإن صلى انحلت عقده كلها، فأصبح نشيطا طيب النفس، وإلا أصبح خبيث النفس كسلان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said, \"During your sleep, Satan knots three knots at the back of the head of each of you, and he breathes the following words at each knot, 'The night is, long, so keep on sleeping,' If that person wakes up and celebrates the praises of Allah, then one knot is undone, and when he performs ablution the second knot is undone, and when he prays, all the knots are undone, and he gets up in the morning lively and gay, otherwise he gets up dull and gloomy. \"",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11062",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "3350",
      "source": " Sahih Bukhari ",
      "chapter": "Prophets - كتاب أحاديث الأنبياء",
      "chapter_no": "60",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال أخبرني أخي عبد الحميد، عن ابن أبي ذئب، عن سعيد المقبري، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ يلقى إبراهيم أباه آزر يوم القيامة، وعلى وجه آزر قترة وغبرة، فيقول له إبراهيم ألم أقل لك لا تعصني فيقول أبوه فاليوم لا أعصيك‏.‏ فيقول إبراهيم يا رب، إنك وعدتني أن لا تخزيني يوم يبعثون، فأى خزى أخزى من أبي الأبعد فيقول الله تعالى إني حرمت الجنة على الكافرين، ثم يقال يا إبراهيم ما تحت رجليك فينظر فإذا هو بذيخ ملتطخ، فيؤخذ بقوائمه فيلقى في النار ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"On the Day of Resurrection Abraham will meet his father Azar whose face will be dark and covered with dust.(The Prophet Abraham will say to him): 'Didn't I tell you not to disobey me?' His father will reply: 'Today I will not disobey you.' 'Abraham will say: 'O Lord! You promised me not to disgrace me on the Day of Resurrection; and what will be more disgraceful to me than cursing and dishonoring my father?' Then Allah will say (to him):' 'I have forbidden Paradise for the disbelievers.\" Then he will be addressed, 'O Abraham! Look! What is underneath your feet?' He will look and there he will see a Dhabh (an animal,) blood-stained, which will be caught by the legs and thrown in the (Hell) Fire.\"",
      "chain": [
        "30103",
        "20436",
        "20177",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "3529",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا خالد بن يزيد الكاهلي، حدثنا أبو بكر، عن أبي حصين، عن سعيد بن جبير، عن ابن عباس، رضى الله عنهما‏.‏ ‏{‏وجعلناكم شعوبا وقبائل‏}‏ قال الشعوب القبائل العظام، والقبائل البطون‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     Regarding the Verse: 'And (We) made you into Shu'ub and Qabail-- (49.13) that Shu'uib means the big Qabail (i.e. nations) while the Qabail (i.e. tribes) means the branch tribes.",
      "chain": [
        "30191",
        "20436",
        "11371",
        "11050",
        "17"
      ]
    },
    {
      "hadith_no": "3569",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، عن عروة، عن عائشة، أن أبا بكر  رضى الله عنه  دخل عليها وعندها جاريتان في أيام منى تدففان وتضربان، والنبي صلى الله عليه وسلم متغش بثوبه، فانتهرهما أبو بكر، فكشف النبي صلى الله عليه وسلم عن وجهه، فقال ‏\"‏ دعهما يا أبا بكر، فإنها أيام عيد، وتلك الأيام أيام منى ‏\"‏‏.‏   وقالت عائشة رأيت النبي صلى الله عليه وسلم يسترني، وأنا أنظر إلى الحبشة، وهم يلعبون في المسجد فزجرهم ‏{‏عمر‏}‏ فقال النبي صلى الله عليه وسلم ‏\"‏ دعهم أمنا بني أرفدة ‏\"‏‏.‏ يعني من الأمن‏.‏",
      "text_en": " Narrated `Aisha:                     That during the Mina days, Abu Bakr came to her, while there where two girls with her, beating drums, and the Prophet was (lying) covering himself with his garment. Abu Bakr rebuked the two girls, but the Prophet uncovered his face and said, \"O Abu Bakr! Leave them, for these are the days of Id (festival).\" Those days were the days of Mina-. `Aisha added, \"I was being screened by the Prophet while I was watching the Ethiopians playing in the Mosque. `Umar rebuked them, but the Prophet said, \"Leave them, O Bani Arfida! Play. (for) you are safe.\"",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "10511",
        "53",
        "20436"
      ]
    },
    {
      "hadith_no": "3611",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن شريك بن عبد الله بن أبي نمر، سمعت أنس بن مالك، يحدثنا عن ليلة، أسري بالنبي صلى الله عليه وسلم من مسجد الكعبة جاء ثلاثة نفر قبل أن يوحى إليه، وهو نائم في مسجد الحرام، فقال أولهم أيهم هو فقال أوسطهم هو خيرهم وقال آخرهم خذوا خيرهم‏.‏ فكانت تلك، فلم يرهم حتى جاءوا ليلة أخرى، فيما يرى قلبه، والنبي صلى الله عليه وسلم نائمة عيناه ولا ينام قلبه وكذلك الأنبياء تنام أعينهم ولا تنام قلوبهم، فتولاه جبريل ثم عرج به إلى السماء‏.‏",
      "text_en": " Narrated Sharik bin `Abdullah bin Abi Namr:                     I heard Anas bin Malik telling us about the night when the Prophet was made to travel from the Ka`ba Mosque. Three persons (i.e. angels) came to the Prophet before he was divinely inspired was an Aspostle), while he was sleeping in Al Masjid-ul-Haram. The first (of the three angels) said, \"Which of them is he?\" The second said, \"He is the best of them.\" That was all that happened then, and he did not see them till they came at another night and he perceived their presence with his heart, for the eyes of the Prophet were closed when he was asleep, but his heart was not asleep (not unconscious). This is characteristic of all the prophets: Their eyes sleep but their hearts do not sleep. Then Gabriel took charge of the Prophet and ascended along with him to the Heaven.",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11858",
        "19"
      ]
    },
    {
      "hadith_no": "3627",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا إسماعيل، قال حدثني أخي، عن سليمان بن بلال، عن يحيى بن سعيد، قال أخبرني حفص بن عبيد الله بن أنس بن مالك، أنه سمع جابر بن عبد الله  رضى الله عنهما  يقول كان المسجد مسقوفا على جذوع من نخل فكان النبي صلى الله عليه وسلم إذا خطب يقوم إلى جذع منها، فلما صنع له المنبر، وكان عليه فسمعنا لذلك الجذع صوتا كصوت العشار، حتى جاء النبي صلى الله عليه وسلم فوضع يده عليها فسكنت‏.‏",
      "text_en": " Narrated Anas bin Malik:                     That he heard Jabir bin `Abdullah saying, \"The roof of the Mosque was built over trunks of datepalms working as pillars. When the Prophet delivered a sermon, he used to stand by one of those trunks till the pulpit was made for him, and he used it instead. Then we heard the trunk sending a sound like of a pregnant she-camel till the Prophet came to it, and put his hand over it, then it became quiet.\"",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11062",
        "11686",
        "34"
      ]
    },
    {
      "hadith_no": "3890",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا إسماعيل، حدثني أخي، عن سليمان، عن يحيى بن سعيد، عن عبد الرحمن بن القاسم، عن القاسم بن محمد، عن عائشة  رضى الله عنها  قالت كان لأبي بكر غلام يخرج له الخراج، وكان أبو بكر يأكل من خراجه، فجاء يوما بشىء فأكل منه أبو بكر فقال له الغلام تدري ما هذا فقال أبو بكر وما هو قال كنت تكهنت لإنسان في الجاهلية وما أحسن الكهانة، إلا أني خدعته، فلقيني فأعطاني بذلك، فهذا الذي أكلت منه‏.‏ فأدخل أبو بكر يده فقاء كل شىء في بطنه‏.‏",
      "text_en": " Narrated `Aisha:                     Abu Bakr had a slave who used to give him some of his earnings. Abu Bakr used to eat from it. One day he brought something and Abu Bakr ate from it. The slave said to him, \"Do you know what this is?\" Abu Bakr then enquired, \"What is it?\" The slave said, \"Once, in the pre-Islamic period of ignorance I foretold somebody's future though I did not know this knowledge of foretelling but I, cheated him, and when he met me, he gave me something for that service, and that is what you have eaten from.\" Then Abu Bakr put his hand in his mouth and vomited whatever was present in his stomach.",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11062",
        "10530",
        "10535",
        "53"
      ]
    },
    {
      "hadith_no": "3969",
      "source": " Sahih Bukhari ",
      "chapter": "Merits of the Helpers in Madinah (Ansaar) - كتاب مناقب الأنصار",
      "chapter_no": "63",
      "text_ar": "حدثنا أصبغ، حدثنا ابن وهب، عن يونس، عن ابن شهاب، عن عروة بن الزبير، عن عائشة، أن أبا بكر  رضى الله عنه  تزوج امرأة من كلب يقال لها أم بكر، فلما هاجر أبو بكر طلقها، فتزوجها ابن عمها، هذا الشاعر الذي قال هذه القصيدة، رثى كفار قريش وماذا بالقليب قليب بدر من الشيزى تزين بالسنام وماذا بالقليب، قليب بدر من القينات والشرب الكرام تحيي بالسلامة أم بكر وهل لي بعد قومي من سلام يحدثنا الرسول بأن سنحيا وكيف حياة أصداء وهام",
      "text_en": " Narrate Aisha:                     Abu Bakr married a woman from the tribe of Bani Kalb, called Um Bakr. When Abu Bakr migrated to Medina, he divorced her and she was married by her cousin, the poet who said the following poem lamenting the infidels of Quraish: \"What is there kept in the well, The well of Badr, (The owners of) the trays of Roasted camel humps? What is there kept in the well, The well of Badr, (The owners of) lady singers And friends of the honorable companions; who used to drink (wine) together, Um Bakr greets us With the greeting of peace, But can I find peace After my people have gone? The Apostle tells us that We shall live again, But what sort of life will owls and skulls live?:",
      "chain": [
        "30228",
        "20029",
        "20475",
        "11013",
        "10511",
        "53",
        "20436"
      ]
    },
    {
      "hadith_no": "4187",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن سنان بن أبي سنان الدؤلي، عن جابر بن عبد الله  رضى الله عنهما  أخبره أنه، غزا مع رسول الله صلى الله عليه وسلم قبل نجد، فلما قفل رسول الله صلى الله عليه وسلم قفل معه، فأدركتهم القائلة في واد كثير العضاه، فنزل رسول الله صلى الله عليه وسلم، وتفرق الناس في العضاه يستظلون بالشجر، ونزل رسول الله صلى الله عليه وسلم تحت سمرة، فعلق بها سيفه، قال جابر فنمنا نومة، ثم إذا رسول الله صلى الله عليه وسلم يدعونا، فجئناه فإذا عنده أعرابي جالس فقال رسول الله صلى الله عليه وسلم ‏\"‏ إن هذا اخترط سيفي، وأنا نائم فاستيقظت، وهو في يده صلتا، فقال لي من يمنعك مني قلت الله‏.‏ فها هو ذا جالس ‏\"‏‏.‏ ثم لم يعاقبه رسول الله صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     That he fought in a Ghazwa towards Najd along with Allah's Apostle and when Allah's Apostle returned, he too, returned along with him. The time of the afternoon nap overtook them when they were in a valley full of thorny trees. Allah's Apostle dismounted and the people dispersed amongst the thorny trees, seeking the shade of the trees. Allah's Apostle took shelter under a Samura tree and hung his sword on it. We slept for a while when Allah's Apostle suddenly called us, and we went to him, to find a bedouin sitting with him. Allah's Apostle said, \"This (bedouin) took my sword out of its sheath while I was asleep. When I woke up, the naked sword was in his hand and he said to me, 'Who can save you from me?, I replied, 'Allah.' Now here he is sitting.\" Allah's Apostle did not punish him (for that). Through another group of narrators, Jabir said, \"We were in the company of the Prophet (during the battle of) Dhat-ur-Riqa', and we came across a shady tree and we left it for the Prophet (to take rest under its shade). A man from the pagans came while the Prophet's sword was hanging on the tree. He took it out of its sheath secretly and said (to the Prophet ), 'Are you afraid of me?' The Prophet said, 'No.' He said, 'Who can save you from me?' The Prophet said, Allah.' The companions of the Prophet threatened him, then the Iqama for the prayer was announced and the Prophet offered a two rak`at Fear prayer with one of the two batches, and that batch went aside and he offered two rak`a-t with the other batch. So the Prophet offered four rak`at but the people offered two rak`at only.\" (The subnarrator) Abu Bishr added, \"The man was Ghaurath bin Al-Harith and the battle was waged against Muharib Khasafa.\" Jabir added, \"We were with the Prophet at Nakhl and he offered the Fear prayer.\" Abu Huraira said, \"I offered the Fear prayer with the Prophet during the Ghazwa (i.e. the battle) of Najd.\" Abu Huraira came to the Prophet during the day of Khaibar.",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11013",
        "11511",
        "34"
      ]
    },
    {
      "hadith_no": "4218",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسماعيل، عن أخيه، عن سليمان، عن عمرو بن يحيى، عن عباد بن تميم، قال لما كان يوم الحرة والناس يبايعون لعبد الله بن حنظلة فقال ابن زيد على ما يبايع ابن حنظلة الناس قيل له على الموت‏.‏ قال لا أبايع على ذلك أحدا بعد رسول الله صلى الله عليه وسلم‏.‏ وكان شهد معه الحديبية‏.‏",
      "text_en": " Narrated `Abbas bin Tamim:                     When it was the day (of the battle) of Al-Harra the people were giving Pledge of allegiance to `Abdullah bin Hanzala. Ibn Zaid said, \"For what are the people giving Pledge of allegiance to `Abdullah bin Hanzala?\" It was said to him, \"For death.\" Ibn Zaid said, \"I will never give the Pledge of allegiance for that to anybody else after Allah's Apostle .\" Ibn Zaid was one of those who had witnessed the day of Al-Hudaibiya with the Prophet.",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11210",
        "639"
      ]
    },
    {
      "hadith_no": "4261",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن يحيى، عن حميد الطويل، سمع أنس بن مالك  رضى الله عنه أن النبي صلى الله عليه وسلم أقام على صفية بنت حيى، بطريق خيبر ثلاثة أيام، حتى أعرس بها، وكانت فيمن ضرب عليها الحجاب‏.‏",
      "text_en": " Narrated Anas bin Malik:                     The Prophet stayed with Safiya bint Huyai for three days on the way of Khaibar where he consummated his marriage with her. Safiya was amongst those who were ordered to use a veil.",
      "chain": [
        "30103",
        "20436",
        "20160",
        "20031",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "4433",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا إسماعيل، قال حدثني أخي، عن سليمان، عن ثور بن زيد، عن أبي الغيث، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ الإيمان يمان، والفتنة ها هنا، ها هنا يطلع قرن الشيطان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Belief is Yemenite while afflictions appear from there (the east) from where the side of the head of Satan will appear.\"",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "4495",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا يحيى بن بكير، حدثنا الليث، عن عقيل، عن ابن شهاب، قال أخبرني أبو سلمة، أن عائشة، أخبرته أن أبا بكر  رضى الله عنه  أقبل على فرس من مسكنه بالسنح حتى نزل، فدخل المسجد فلم يكلم الناس حتى دخل على عائشة، فتيمم رسول الله صلى الله عليه وسلم وهو مغشى بثوب حبرة، فكشف عن وجهه ثم أكب عليه فقبله وبكى‏.‏   ثم قال بأبي أنت وأمي، والله لا يجمع الله عليك موتتين، أما الموتة التي كتبت عليك فقد متها‏.‏   قال الزهري وحدثني أبو سلمة، عن عبد الله بن عباس، أن أبا بكر، خرج وعمر يكلم الناس فقال اجلس يا عمر، فأبى عمر أن يجلس‏.‏ فأقبل الناس إليه وتركوا عمر، فقال أبو بكر أما بعد من كان منكم يعبد محمدا صلى الله عليه وسلم فإن محمدا قد مات، ومن كان منكم يعبد الله فإن الله حى لا يموت، قال الله ‏{‏وما محمد إلا رسول قد خلت من قبله الرسل‏}‏ إلى قوله ‏{‏الشاكرين‏}‏ وقال والله لكأن الناس لم يعلموا أن الله أنزل هذه الآية حتى تلاها أبو بكر، فتلقاها منه الناس كلهم فما أسمع بشرا من الناس إلا يتلوها‏.‏ فأخبرني سعيد بن المسيب أن عمر قال والله ما هو إلا أن سمعت أبا بكر تلاها فعقرت حتى ما تقلني رجلاى، وحتى أهويت إلى الأرض حين سمعته تلاها أن النبي صلى الله عليه وسلم قد مات‏.‏",
      "text_en": " Narrated `Aisha:                     Abu Bakr came from his house at As-Sunh on a horse. He dismounted and entered the Mosque, but did not speak to the people till he entered upon `Aisha and went straight to Allah's Apostle who was covered with Hibra cloth (i.e. a kind of Yemenite cloth). He then uncovered the Prophet's face and bowed over him and kissed him and wept, saying, \"Let my father and mother be sacrificed for you. By Allah, Allah will never cause you to die twice. As for the death which was written for you, has come upon you.\" Narrated Ibn `Abbas: Abu Bakr went out while `Umar bin Al-Khattab was talking to the people. Abu Bakr said, \"Sit down, O `Umar!\" But `Umar refused to sit down. So the people came to Abu Bakr and left `Umar. Abu Bakr said, \"To proceed, if anyone amongst you used to worship Muhammad , then Muhammad is dead, but if (anyone of) you used to worship Allah, then Allah is Alive and shall never die. Allah said:--\"Muhammad is no more than an Apostle, and indeed (many) apostles have passed away before him..(till the end of the Verse )......Allah will reward to those who are thankful.\" (3.144) By Allah, it was as if the people never knew that Allah had revealed this Verse before till Abu Bakr recited it and all the people received it from him, and I heard everybody reciting it (then). Narrated Az-Zuhri: Sa`id bin Al-Musaiyab told me that `Umar said, \"By Allah, when I heard Abu Bakr reciting it, my legs could not support me and I fell down at the very moment of hearing him reciting it, declaring that the Prophet had died.\"",
      "chain": [
        "30399",
        "20023",
        "11207",
        "11013",
        "10567",
        "53",
        "20436"
      ]
    },
    {
      "hadith_no": "4498",
      "source": " Sahih Bukhari ",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثني عبد الله بن أبي شيبة، حدثنا يحيى بن سعيد، عن سفيان، عن موسى بن أبي عائشة، عن عبيد الله بن عبد الله بن عتبة، عن عائشة، وابن، عباس أن أبا بكر   رضى الله عنه  قبل النبي صلى الله عليه وسلم بعد موته‏.‏",
      "text_en": " Narrated Aisha and Ibn `Abbas:                     Abu Bakr kissed the Prophet after his death.",
      "chain": [
        "30201",
        "20031",
        "20012",
        "11399",
        "11004",
        "53",
        "17",
        "20436"
      ]
    },
    {
      "hadith_no": "4605",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أحمد بن يونس  أراه قال  حدثنا أبو بكر، عن أبي حصين، عن أبي الضحى، عن ابن عباس، ‏{‏حسبنا الله ونعم الوكيل‏}‏ قالها إبراهيم عليه السلام حين ألقي في النار، وقالها محمد صلى الله عليه وسلم حين قالوا ‏{‏إن الناس قد جمعوا لكم فاخشوهم فزادهم إيمانا وقالوا حسبنا الله ونعم الوكيل‏}‏",
      "text_en": " Narrated Ibn `Abbas:                     'Allah is Sufficient for us and He Is the Best Disposer of affairs,\" was said by Abraham when he was thrown into the fire; and it was said by Muhammad when they (i.e. hypocrites) said, \"A great army is gathering against you, therefore, fear them,\" but it only increased their faith and they said: \"Allah is Sufficient for us, and He is the Best Disposer (of affairs, for us).\" (3.173)",
      "chain": [
        "30184",
        "20436",
        "11371",
        "11392"
      ]
    },
    {
      "hadith_no": "4703",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسحاق، حدثنا يعقوب بن إبراهيم، حدثنا أبي، عن صالح، عن ابن شهاب، أن حميد بن عبد الرحمن، أخبره أن أبا هريرة أخبره أن أبا بكر  رضى الله عنه  بعثه في الحجة التي أمره رسول الله صلى الله عليه وسلم عليها قبل حجة الوداع في رهط يؤذن في الناس أن لا يحجن بعد العام مشرك ولا يطوف بالبيت عريان‏.‏ فكان حميد يقول يوم النحر يوم الحج الأكبر‏.‏ من أجل حديث أبي هريرة‏.‏",
      "text_en": " Narrated Humaid bin `Abdur-Rahman:                     Abu Huraira said that Abu Bakr sent him during the Hajj in which Abu Bakr was made the chief of the pilgrims by Allah's Apostle before (the year of) Hajjat al-Wada` in a group (of announcers) to announce before the people; 'No pagan shall perform the Hajj after this year, and none shall perform the Tawaf around the Ka`ba in a naked state. Humaid used to say The Day of Nahr is the day of Al- Hajj Al-Akbar (the Greatest Day) because of the narration of Abu Huraira.",
      "chain": [
        "30312",
        "20184",
        "20150",
        "11176",
        "11013",
        "10561",
        "13",
        "20436"
      ]
    },
    {
      "hadith_no": "4709",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا عبد الله بن محمد، حدثنا حبان، حدثنا همام، حدثنا ثابت، حدثنا أنس، قال حدثني أبو بكر  رضى الله عنه  قال كنت مع النبي صلى الله عليه وسلم في الغار، فرأيت آثار المشركين قلت يا رسول الله، لو أن أحدهم رفع قدمه رآنا‏.‏ قال ‏\"‏ ما ظنك باثنين الله ثالثهما ‏\"‏‏.‏",
      "text_en": " Narrated Abu Bakr:                     I was in the company of the Prophet in the cave, and on seeing the traces of the pagans, I said, \"O Allah's Apostle If one of them (pagans) should lift up his foot, he will see us.\" He said, \"What do you think of two, the third of whom is Allah?\"",
      "chain": [
        "30351",
        "20218",
        "20297",
        "11269",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "4816",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا إسماعيل، حدثنا أخي، عن ابن أبي ذئب، عن سعيد المقبري، عن أبي هريرة  رضى الله عنه  عن النبي صلى الله عليه وسلم قال ‏\"‏ يلقى إبراهيم أباه فيقول يا رب إنك وعدتني أن لا تخزني يوم يبعثون فيقول الله إني حرمت الجنة على الكافرين ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, Abraham will meet his father (on the Day of Resurrection) and will say, 'O my Lords You promised me that You would not let me in disgrace on the Day when people will be resurrected.' Allah will say, 'I have forbidden Paradise to the non-believers.\"",
      "chain": [
        "30103",
        "20436",
        "20177",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "4937",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو بكر، عن حصين، عن عمرو بن ميمون، قال قال عمر رضى الله عنه أوصي الخليفة بالمهاجرين الأولين أن يعرف لهم حقهم، وأوصي الخليفة بالأنصار الذين تبوءوا الدار والإيمان من قبل أن يهاجر النبي صلى الله عليه وسلم أن يقبل من محسنهم ويعفو عن مسيئهم‏.‏",
      "text_en": " Narrated `Umar:                     I recommend that my successor should take care of and secure the rights of the early emigrants; and I also advise my successor to be kind to the Ansar who had homes (in Medina) and had adopted the Faith, before the Prophet migrated to them, and to accept the good from their good ones and excuse their wrong doers.",
      "chain": [
        "30184",
        "20436",
        "15097",
        "11382",
        "3"
      ]
    },
    {
      "hadith_no": "5049",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues of the Qur'an - كتاب فضائل القرآن",
      "chapter_no": "66",
      "text_ar": "حدثنا خالد بن يزيد، حدثنا أبو بكر، عن أبي حصين، عن أبي صالح، عن أبي هريرة، قال كان يعرض على النبي صلى الله عليه وسلم القرآن كل عام مرة، فعرض عليه مرتين في العام الذي قبض، وكان يعتكف كل عام عشرا فاعتكف عشرين في العام الذي قبض ‏{‏فيه‏}‏",
      "text_en": " Narrated Abu-Huraira:                     Gabriel used to repeat the recitation of the Qur'an with the Prophet once a year, but he repeated it twice with him in the year he died. The Prophet used to stay in I`tikaf for ten days every year (in the month of Ramadan), but in the year of his death, he stayed in I`tikaf for twenty days.",
      "chain": [
        "11408",
        "20436",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "5133",
      "source": " Sahih Bukhari ",
      "chapter": "Wedlock; Marriage (Nikaah) - كتاب النكاح",
      "chapter_no": "67",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني أخي، عن سليمان، عن هشام بن عروة، عن أبيه، عن عائشة  رضى الله عنها  قالت قلت يا رسول الله أرأيت لو نزلت واديا وفيه شجرة قد أكل منها، ووجدت شجرا لم يؤكل منها، في أيها كنت ترتع بعيرك قال ‏\"‏ في الذي لم يرتع منها ‏\"‏‏.‏ تعني أن رسول الله صلى الله عليه وسلم لم يتزوج بكرا غيرها‏.‏",
      "text_en": " Narrated `Aisha:                     I said, \"O Allah's Apostle! Suppose you landed in a valley where there is a tree of which something has been eaten and then you found trees of which nothing has been eaten, of which tree would you let your camel graze?\" He said, \"(I will let my camel graze) of the one of which nothing has been eaten before.\" (The sub-narrator added: `Aisha meant that Allah's Apostle had not married a virgin besides herself .)",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11065",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "5345",
      "source": " Sahih Bukhari ",
      "chapter": "Divorce - كتاب الطلاق",
      "chapter_no": "68",
      "text_ar": "حدثنا إسماعيل بن أبي أويس، عن أخيه، عن سليمان، عن حميد الطويل، أنه سمع أنس بن مالك، يقول آلى رسول الله صلى الله عليه وسلم من نسائه، وكانت انفكت رجله فأقام في مشربة له تسعا وعشرين، ثم نزل فقالوا يا رسول الله آليت شهرا‏.‏ فقال ‏\"‏ الشهر تسع وعشرون ‏\"‏‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle took an oath that he would abstain from his wives, and at that time his leg had been sprained (dislocated). So he stayed in the Mashruba (an attic room) of his for 29 days. Then he came down, and they (the people) said, \"O Allah's Apostle! You took an oath to abstain from your wives for one month.\" He said, \"The month is of twenty nine days.\"",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "5629",
      "source": " Sahih Bukhari ",
      "chapter": "Al-Adha Festival Sacrifice (Adaahi) - كتاب الأضاحي",
      "chapter_no": "73",
      "text_ar": "حدثنا إسماعيل بن عبد الله، قال حدثني أخي، عن سليمان، عن يحيى بن سعيد، عن عمرة بنت عبد الرحمن، عن عائشة  رضى الله عنها  قالت الضحية كنا نملح منه، فنقدم به إلى النبي صلى الله عليه وسلم بالمدينة فقال ‏\"‏ لا تأكلوا إلا ثلاثة أيام ‏\"‏‏.‏ وليست بعزيمة، ولكن أراد أن يطعم منه والله أعلم‏.‏",
      "text_en": " Narrated `Aisha:                     We used to salt some of the meat of sacrifice and present it to the Prophet at Medina. Once he said, \"Do not eat (of that meat) for more than three days.\" That was not a final order, but (that year) he wanted us to feed of it to others, Allah knows better.",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11062",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "5771",
      "source": " Sahih Bukhari ",
      "chapter": "Medicine - كتاب الطب",
      "chapter_no": "76",
      "text_ar": "حدثنا علي بن عبد الله، حدثنا يحيى بن سعيد، حدثنا سفيان، قال حدثني موسى بن أبي عائشة، عن عبيد الله بن عبد الله، عن ابن عباس، وعائشة، أن أبا بكر  رضى الله عنه  قبل النبي صلى الله عليه وسلم وهو ميت‏.‏   قال وقالت عائشة لددناه في مرضه، فجعل يشير إلينا، أن لا تلدوني‏.‏ فقلنا كراهية المريض للدواء‏.‏ فلما أفاق قال ‏\"‏ ألم أنهكم أن تلدوني ‏\"‏‏.‏ قلنا كراهية المريض للدواء‏.‏ فقال ‏\"‏ لا يبقى في البيت أحد إلا لد  وأنا أنظر  إلا العباس فإنه لم يشهدكم ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas and `Aisha:                     Abu Bakr kissed (the forehead of) the Prophet when he was dead. `Aisha added: We put medicine in one side of his mouth but he started waving us not to insert the medicine into his mouth. We said, \"He dislikes the medicine as a patient usually does.\" But when he came to his senses he said, \"Did I not forbid you to put medicine (by force) in the side of my mouth?\" We said, \"We thought it was just because a patient usually dislikes medicine.\" He said, \"None of those who are in the house but will be forced to take medicine in the side of his mouth while I am watching, except Al-`Abbas, for he had not witnessed your deed.\"",
      "chain": [
        "30026",
        "20031",
        "20012",
        "11399",
        "11004",
        "17",
        "53",
        "20436"
      ]
    },
    {
      "hadith_no": "5939",
      "source": " Sahih Bukhari ",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني محمد بن عبد الله الأنصاري، قال حدثني أبي، عن ثمامة، عن أنس، أن أبا بكر  رضى الله عنه  لما استخلف كتب له، وكان نقش الخاتم ثلاثة أسطر‏.‏ محمد سطر، ورسول سطر، والله سطر‏.‏",
      "text_en": " Narrated Anas:                     that when Abu Bakr became the Caliph, he wrote a letter to him (and stamped it with the Prophet's ring) and the engraving of the ring was in three lines: Muhammad in one line, 'Apostle' in another line, and 'Allah' in a third line. Anas added: 'the ring of the Prophet was in his hand, and after him, in Abu Bakr's hand, and then in `Umar's hand after Abu Bakr. When `Uthman was the Caliph, once he was sitting at the well of Aris. He removed the ring from his hand and while he was trifling with it, dropped into the well. We kept on going to the well with `Uthman for three days looking for the ring, and finally the well was drained, but the ring was not found.",
      "chain": [
        "20280",
        "11599",
        "11270",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "6511",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني يحيى بن يوسف، أخبرنا أبو بكر، عن أبي حصين، عن أبي صالح، عن أبي هريرة  رضى الله عنه  قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تعس عبد الدينار والدرهم والقطيفة والخميصة، إن أعطي رضي، وإن لم يعط لم يرض ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Perish the slave of Dinar, Dirham, Qatifa (thick soft cloth), and Khamisa (a garment), for if he is given, he is pleased; otherwise he is dissatisfied.\"",
      "chain": [
        "30282",
        "20436",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "6523",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو بكر، حدثنا أبو حصين، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ ليس الغنى عن كثرة العرض، ولكن الغنى غنى النفس ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"Riches does not mean, having a great amount of property, but riches is selfcontentment.\"",
      "chain": [
        "30184",
        "20436",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "6584",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثني يحيى بن يوسف، أخبرنا أبو بكر، عن أبي حصين، عن أبي صالح، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ بعثت أنا والساعة كهاتين ‏\"‏‏.‏ يعني إصبعين‏.‏ تابعه إسرائيل عن أبي حصين‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"I have been sent and the Hour (is at hand) as these two (fingers).",
      "chain": [
        "30282",
        "20436",
        "11371",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "6608",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا إسماعيل، حدثني أخي، عن سليمان، عن ثور، عن أبي الغيث، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال ‏\"‏ أول من يدعى يوم القيامة آدم، فتراءى ذريته فيقال هذا أبوكم آدم‏.‏ فيقول لبيك وسعديك‏.‏ فيقول أخرج بعث جهنم من ذريتك‏.‏ فيقول يا رب كم أخرج فيقول أخرج من كل مائة تسعة وتسعين ‏\"‏‏.‏ فقالوا يا رسول الله إذا أخذ منا من كل مائة تسعة وتسعون، فماذا يبقى منا قال ‏\"‏ إن أمتي في الأمم كالشعرة البيضاء في الثور الأسود ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The Prophet said, \"The first man to be called on the Day of Resurrection will be Adam who will be shown his offspring, and it will be said to them, 'This is your father, Adam.' Adam will say (responding to the call), 'Labbaik and Sa`daik' Then Allah will say (to Adam), 'Take out of your offspring, the people of Hell.' Adam will say, 'O Lord, how many should I take out?' Allah will say, 'Take out ninety-nine out of every hundred.\" They (the Prophet's companions) said, \"O Allah's Apostle! If ninety-nine out of every one hundred of us are taken away, what will remain out of us?\" He said, \"My followers in comparison to the other nations are like a white hair on a black ox.\"",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11155",
        "11165",
        "13"
      ]
    },
    {
      "hadith_no": "6703",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا محمد بن مقاتل أبو الحسن، أخبرنا عبد الله، أخبرنا هشام بن عروة، عن أبيه، عن عائشة، أن أبا بكر  رضى الله عنه  لم يكن يحنث في يمين قط، حتى أنزل الله كفارة اليمين وقال لا أحلف على يمين فرأيت غيرها خيرا منها، إلا أتيت الذي هو خير، وكفرت عن يميني‏.‏",
      "text_en": " Narrated `Aisha:                     Abu Bakr As-Siddiq had never broken his oaths till Allah revealed the expiation for the oaths. Then he said, \"If I take an oath to do something and later on I find something else better than the first one, then I do what is better and make expiation for my oath.\"",
      "chain": [
        "30118",
        "20025",
        "11065",
        "10511",
        "53",
        "20436"
      ]
    },
    {
      "hadith_no": "6747",
      "source": " Sahih Bukhari ",
      "chapter": "Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "83",
      "text_ar": "حدثنا أحمد بن يونس، حدثنا أبو بكر، عن عبد العزيز بن رفيع، عن عطاء، عن ابن عباس  رضى الله عنهما  قال قال رجل للنبي صلى الله عليه وسلم زرت قبل أن أرمي‏.‏ قال ‏\"‏ لا حرج ‏\"‏‏.‏ قال آخر حلقت قبل أن أذبح‏.‏ قال ‏\"‏ لا حرج ‏\"‏‏.‏ قال آخر ذبحت قبل أن أرمي‏.‏ قال ‏\"‏ لا حرج ‏\"‏‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     A man said to the Prophet (while he was delivering a sermon on the Day of Nahr), \"I have performed the Tawaf round the Ka`ba before the Rami (throwing pebbles) at the Jamra.\" The Prophet said, \"There is no harm (therein).\" Another man said, \"I had my head shaved before slaughtering (the sacrifice).\" The Prophet said, \"There is no harm.\" A third said, \"I have slaughtered (the sacrifice) before the Rami (throwing pebbles) at the Jamra.\" The Prophet said, \"There is no harm.\"",
      "chain": [
        "30184",
        "20436",
        "11257",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "7124",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا إسماعيل بن عبد الله، حدثني أخي عبد الحميد، عن سليمان بن بلال، عن موسى بن عقبة، عن سالم بن عبد الله، عن أبيه، أن النبي صلى الله عليه وسلم قال ‏\"‏ رأيت كأن امرأة سوداء ثائرة الرأس، خرجت من المدينة، حتى قامت بمهيعة  وهى الجحفة  فأولت أن وباء المدينة نقل إليها ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah:                     The Prophet said, \"I saw (in a dream) a black woman with unkempt hair going out of Medina and settling at Mahai'a, i.e., Al-Juhfa. I interpreted that as a symbol of epidemic of Medina being transferred to that place (Al-Juhfa).",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "7126",
      "source": " Sahih Bukhari ",
      "chapter": "Interpretation of Dreams - كتاب التعبير",
      "chapter_no": "92",
      "text_ar": "حدثنا إبراهيم بن المنذر، حدثني أبو بكر بن أبي أويس، حدثني سليمان، عن موسى بن عقبة، عن سالم، عن أبيه، أن النبي صلى الله عليه وسلم قال ‏\"‏ رأيت امرأة سوداء ثائرة الرأس، خرجت من المدينة، حتى قامت بمهيعة فأولت أن وباء المدينة نقل إلى مهيعة، وهى الجحفة ‏\"‏‏.‏",
      "text_en": " Narrated Salim's father:                     The Prophet said, \"I saw (in a dream) a black woman with unkempt hair going out of Medina and settling in Mahai'a. I interpreted that as (a symbol of) epidemic of Medina being transferred to Mahai'a, namely, Al-Juhfa.\"",
      "chain": [
        "30308",
        "20436",
        "20160",
        "11106",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "7415",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا أيوب بن سليمان، حدثنا أبو بكر بن أبي أويس، عن سليمان بن بلال، عن صالح بن كيسان، قال ابن شهاب أخبرني أنس بن مالك، أن رسول الله صلى الله عليه وسلم كان يصلي العصر فيأتي العوالي والشمس مرتفعة‏.‏ وزاد الليث عن يونس، وبعد العوالي أربعة أميال أو ثلاثة‏.‏",
      "text_en": " Narrated Anas bin Malik:                     Allah's Apostle used to perform the `Asr prayer and then one could reach the `Awali (a place in the outskirts of Medina) while the sun was still quite high. Narrated Yunus: The distance of the `Awali (from Medina) was four or three miles.",
      "chain": [
        "20158",
        "20436",
        "20160",
        "11176",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "7437",
      "source": " Sahih Bukhari ",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا إسماعيل، عن أخيه، عن سليمان بن بلال، عن عبد المجيد بن سهيل بن عبد الرحمن بن عوف، أنه سمع سعيد بن المسيب، يحدث أن أبا سعيد الخدري، وأبا، هريرة حدثاه أن رسول الله صلى الله عليه وسلم بعث أخا بني عدي الأنصاري واستعمله على خيبر، فقدم بتمر جنيب فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أكل تمر خيبر هكذا ‏\"‏‏.‏ قال لا والله يا رسول الله إنا لنشتري الصاع بالصاعين من الجمع‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تفعلوا، ولكن مثلا بمثل، أو بيعوا هذا واشتروا بثمنه من هذا وكذلك الميزان ‏\"‏‏.‏",
      "text_en": " Narrated Abu Sa`id Al-Khudri and Abu Huraira:                     Allah's Apostle sent the brother of the tribe of Bani Adi Al-Ansari as governor of Khaibar. Then the man returned, bringing Janib (a good kind of date). Allah's Apostle asked him, \"Are all the dates of Khaibar like that?\" He replied, \"No, by Allah, O Allah's Apostle! We take one Sa' of these (good) dates for two Sas of mixed dates.\" Allah's Apostle then said, \"Do not do so. You should either take one Sa of this (kind) for one Sa' of the other; or sell one kind and then buy with its price the other kind (of dates), and you should do the same in weighing.\"",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11705",
        "11002",
        "38",
        "13"
      ]
    },
    {
      "hadith_no": "7555",
      "source": " Sahih Bukhari ",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا أبو اليمان، أخبرنا شعيب، عن الزهري،‏.‏ وحدثنا إسماعيل، حدثني أخي عبد الحميد، عن سليمان، عن محمد بن أبي عتيق، عن ابن شهاب، عن علي بن حسين، أن حسين بن علي  عليهما السلام  أخبره أن علي بن أبي طالب أخبره أن رسول الله صلى الله عليه وسلم طرقه وفاطمة بنت رسول الله صلى الله عليه وسلم ليلة فقال لهم ‏\"‏ ألا تصلون ‏\"‏‏.‏ قال علي فقلت يا رسول الله إنما أنفسنا بيد الله، فإذا شاء أن يبعثنا بعثنا، فانصرف رسول الله صلى الله عليه وسلم حين قلت ذلك، ولم يرجع إلى شيئا، ثم سمعته وهو مدبر يضرب فخذه ويقول ‏\"‏ ‏{‏وكان الإنسان أكثر شىء جدلا‏}‏‏\"‏",
      "text_en": " Narrated `Ali bin Abi Talib:                     That one night Allah's Apostle visited him and Fatima, the daughter of Allah's Apostle and said to them, \"Won 't you offer (night) prayer?.. `Ali added: I said, \"O Allah's Apostle! Our souls are in the Hand of Allah and when He Wishes to bring us to life, He does.\" Then Allah's Apostle went away when I said so and he did not give any reply. Then I heard him on leaving while he was striking his thighs, saying, 'But man is, more quarrelsome than anything.' (18.54)",
      "chain": [
        "30330",
        "20428",
        "11013",
        "20208",
        "20436",
        "20160",
        "11013",
        "11045",
        "31",
        "5"
      ]
    },
    {
      "hadith_no": "125",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، ومحمد بن بشار، وألفاظهم، متقاربة - قال أبو بكر حدثنا غندر، عن شعبة، وقال الآخران، حدثنا محمد بن جعفر، حدثنا شعبة، - عن أبي جمرة، قال كنت أترجم بين يدى ابن عباس وبين الناس فأتته امرأة تسأله عن نبيذ الجر، فقال إن وفد عبد القيس أتوا رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم ‏\"‏ من الوفد أو من القوم ‏\"‏ ‏.‏ قالوا ربيعة ‏.‏ قال ‏\"‏ مرحبا بالقوم أو بالوفد غير خزايا ولا الندامى ‏\"‏ ‏.‏ قال فقالوا يا رسول الله إنا نأتيك من شقة بعيدة وإن بيننا وبينك هذا الحى من كفار مضر وإنا لا نستطيع أن نأتيك إلا في شهر الحرام فمرنا بأمر فصل نخبر به من وراءنا ندخل به الجنة ‏.‏ قال فأمرهم بأربع ونهاهم عن أربع ‏.‏ قال أمرهم بالإيمان بالله وحده ‏.‏ وقال ‏\"‏ هل تدرون ما الإيمان بالله ‏\"‏ ‏.‏ قالوا الله ورسوله أعلم ‏.‏ قال ‏\"‏ شهادة أن لا إله إلا الله وأن محمدا رسول الله وإقام الصلاة وإيتاء الزكاة وصوم رمضان وأن تؤدوا خمسا من المغنم ‏\"‏ ‏.‏ ونهاهم عن الدباء والحنتم والمزفت ‏.‏ قال شعبة وربما قال النقير ‏.‏ قال شعبة وربما قال المقير ‏.‏ وقال ‏\"‏ احفظوه وأخبروا به من ورائكم ‏\"‏ ‏.‏ وقال أبو بكر في روايته ‏\"‏ من وراءكم ‏\"‏ وليس في روايته المقير ‏.‏",
      "text_en": " Abu Jamra reported:                      I was an interpreter between Ibn Abbas and the people, that a woman happened to come there and asked about nabidh or the pitcher of wine. He replied: A delegation of the people of 'Abdul-Qais came to the Messenger of Allah (may peace be upon him). He (the Holy Prophet) asked the delegation or the people (of the delegation about their identity). They replied that they belonged to the tribe of Rabi'a. He (the Holy Prophet) welcomed the people or the delegation which were neither humiliated nor put to shame. They (the members of the delegation) said: Messenger of Allah, we come to you from a far-off distance and there lives between you and us a tribe of the unbelievers of Mudar and, therefore, it is not possible for us to come to you except in the sacred months. Thus direct us to a clear command, about which we should inform people beside us and by which we may enter heaven. He (the Holy Prophet) replied: I command you to do four deeds and forbid you to do four (acts), and added: I direct you to affirm belief in Allah alone, and then asked them: Do you know what belief in Allah really implies? They said: Allah and His Messenger know best. The Prophet said: It implies testimony to the fact that there is no god but Allah, and that Muhammad is the messenger of Allah, establishment of prayer, payment of Zakat, fast of Ramadan, that you pay one-fifth of the booty (fallen to your lot) and I forbid you to use gourd, wine jar, or a receptacle for wine. Shu'ba sometimes narrated the word naqir (wooden pot) and sometimes narrated it as muqayyar. The Holy Prophet also said: Keep it in your mind and inform those who have been left behind.",
      "chain": [
        "30201",
        "30170",
        "30160",
        "20436",
        "20278",
        "20020",
        "20173",
        "20020",
        "11309"
      ]
    },
    {
      "hadith_no": "130",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب وإسحاق بن إبراهيم جميعا عن وكيع، - قال أبو بكر حدثنا وكيع، - عن زكرياء بن إسحاق، قال حدثني يحيى بن عبد الله بن صيفي، عن أبي معبد، عن ابن عباس، عن معاذ بن جبل، - قال أبو بكر ربما قال وكيع عن ابن عباس، أن معاذا، - قال بعثني رسول الله صلى الله عليه وسلم قال ‏\"‏ إنك تأتي قوما من أهل الكتاب ‏.‏ فادعهم إلى شهادة أن لا إله إلا الله وأني رسول الله فإن هم أطاعوا لذلك فأعلمهم أن الله افترض عليهم خمس صلوات في كل يوم وليلة فإن هم أطاعوا لذلك فأعلمهم أن الله افترض عليهم صدقة تؤخذ من أغنيائهم فترد في فقرائهم فإن هم أطاعوا لذلك فإياك وكرائم أموالهم واتق دعوة المظلوم فإنه ليس بينها وبين الله حجاب ‏\"‏ ‏.‏",
      "text_en": " It is reported on the authority of Ibn 'Abbas that Mu'adh said:                      The Messenger of Allah sent me (as a governor of Yemen) and (at the time of departure) instructed me thus: You will soon find yourself in a community one among the people of the Book, so first call them to testify that there is no god but Allah, that I (Muhammad) am the messenger of Allah, and if they accept this, then tell them Allah has enjoined upon them five prayers during the day and the night and if they accept it, then tell them that Allah has made Zakat obligatory for them that it should be collected from the rich and distributed among the poor, and if they agree to it don't pick up (as a share of Zakat) the best of their wealths. Beware of the supplication of the oppressed for there is no barrier between him and Allah.",
      "chain": [
        "30201",
        "20032",
        "20436",
        "20032",
        "11244",
        "11448",
        "13127",
        "17",
        "32",
        "20032",
        "17",
        "32"
      ]
    },
    {
      "hadith_no": "145",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، كلاهما عن إسماعيل بن إبراهيم، - قال أبو بكر حدثنا ابن علية، - عن خالد، قال حدثني الوليد بن مسلم، عن حمران، عن عثمان، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من مات وهو يعلم أنه لا إله إلا الله دخل الجنة ‏\"‏ ‏.‏",
      "text_en": " It is narrated on the authority of 'Uthman that the Messenger of Allah (may peace be upon him) said. He who died knowing (fully well) that there is no god but Allah entered Paradise.",
      "chain": [
        "30201",
        "30022",
        "20208",
        "20436",
        "20208",
        "11282",
        "10725",
        "11421",
        "4"
      ]
    },
    {
      "hadith_no": "326",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، جميعا عن سليمان، - قال أبو بكر حدثنا سليمان بن حرب، - حدثنا حماد بن زيد، عن حجاج الصواف، عن أبي الزبير، عن جابر، أن الطفيل بن عمرو الدوسي، أتى النبي صلى الله عليه وسلم فقال يا رسول الله هل لك في حصن حصين ومنعة - قال حصن كان لدوس في الجاهلية - فأبى ذلك النبي صلى الله عليه وسلم للذي ذخر الله للأنصار فلما هاجر النبي صلى الله عليه وسلم إلى المدينة هاجر إليه الطفيل بن عمرو وهاجر معه رجل من قومه فاجتووا المدينة فمرض فجزع فأخذ مشاقص له فقطع بها براجمه فشخبت يداه حتى مات فرآه الطفيل بن عمرو في منامه فرآه وهيئته حسنة ورآه مغطيا يديه فقال له ما صنع بك ربك فقال غفر لي بهجرتي إلى نبيه صلى الله عليه وسلم فقال ما لي أراك مغطيا يديك قال قيل لي لن نصلح منك ما أفسدت ‏.‏ فقصها الطفيل على رسول الله صلى الله عليه وسلم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ اللهم وليديه فاغفر ‏\"‏",
      "text_en": " It is narrated on the authority of Jabir that Tufail son of Amr al-Dausi came to the Apostle (may peace be upon him) and said:                      Do you need strong, fortified protection? The tribe of Daus had a fort in the pre-Islamic days. The Apostle (may peace be upon him) declined this offer, since it (the privilege of protecting the Holy Prophet) had already been reserved for the Ansar. When the Apostle (may peace be upon him) migrated to Medina, Tufail son of Amr also migrated to that place, and there also migrated along with him a man of his tribe. But the climate of Medina did not suit him, and he fell sick. He felt very uneasy. So he took hold of an iron head of an arrow and cut his finger-joints. The blood streamed forth from his hands, till he died. Tufail son of Amr saw him in a dream. His state was good and he saw him with his hands wrapped. He (Tufail) said to him: What treatment did your Allah accord to you? He replied. Allah granted me pardon for my migration to the Apostle (may peace be upon him): He (Tufail) again said: What is this that I see you wrapping up your hands? He replied: I was told (by Allah): We would not set right anything of yours which you damaged yourself. Tufail narrated this (dream) to the Messenger of Allah (may peace be upon him). Upon this he prayed: O Allah I grant pardon even to his hands.",
      "chain": [
        "30201",
        "30123",
        "20160",
        "20436",
        "20193",
        "20022",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "257",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وزهير بن حرب، جميعا عن سفيان، - قال أبو بكر حدثنا ابن عيينة، - عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ الفطرة خمس - أو خمس من الفطرة - الختان والاستحداد وتقليم الأظفار ونتف الإبط وقص الشارب ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported:                      Five are the acts quite akin to the Fitra, or five are the acts of Fitra: circumcision, shaving the pubes, cutting the nails, plucking the hair under the armpits and clipping the moustache.",
      "chain": [
        "30201",
        "30263",
        "30022",
        "20005",
        "20436",
        "20005",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "274",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "3",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قال أبو بكر حدثنا أبو معاوية، عن الأعمش، عن مسلم، عن مسروق، عن المغيرة بن شعبة، قال كنت مع النبي صلى الله عليه وسلم في سفر فقال ‏\"‏ يا مغيرة خذ الإداوة ‏\"‏ ‏.‏ فأخذتها ثم خرجت معه فانطلق رسول الله صلى الله عليه وسلم حتى توارى عني فقضى حاجته ثم جاء وعليه جبة شامية ضيقة الكمين فذهب يخرج يده من كمها فضاقت عليه فأخرج يده من أسفلها فصببت عليه فتوضأ وضوءه للصلاة ثم مسح على خفيه ثم صلى ‏.‏",
      "text_en": " Mughira b. Shu'ba reported:                      I was in the company of the Messenger of Allah (may peace be upon him) on a journey when he said: Mughira take hold of this jar (of water). I took hold of it and I went out with him. (I stopped but) the Messenger of Allah (may peace be upon him) proceeded on till he was out of my sight. He relieved himself and then came back and he was wearing a tight-sleeved Syrian gown. He tried to get his forearms out. but the sleeve of the gown was very narrow, so he brought his hands out from under the gown. I poured water over (his hands) and he performed ablution for prayer, then wiped over his socks and prayed.",
      "chain": [
        "30201",
        "30216",
        "20436",
        "20354",
        "11060",
        "20285",
        "11018",
        "166"
      ]
    },
    {
      "hadith_no": "306",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "وحدثني محمد بن أبي بكر المقدمي، وزهير بن حرب، قالا حدثنا يحيى، - وهو ابن سعيد - عن عبيد الله، ح وحدثنا أبو بكر بن أبي شيبة، وابن، نمير - واللفظ لهما - قال ابن نمير حدثنا أبي وقال أبو بكر، حدثنا أبو أسامة، - قالا حدثنا عبيد الله، عن نافع، عن ابن عمر، أن عمر، قال يا رسول الله أيرقد أحدنا وهو جنب قال ‏\"‏ نعم إذا توضأ ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Umar reported:                      Umar said: Is one amongst us permitted to sleep in a state of impurity (i. e. after having sexual intercourse)? He (the Holy Prophet) said: Yes, after performing ablution.",
      "chain": [
        "30161",
        "30022",
        "20031",
        "11201",
        "30201",
        "30212",
        "20331",
        "20436",
        "20318",
        "11201",
        "11014",
        "18",
        "3"
      ]
    },
    {
      "hadith_no": "366",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثني إسحاق بن منصور، وأبو بكر بن إسحاق قال أبو بكر حدثنا وقال ابن منصور، أخبرنا عمرو بن الربيع، أخبرنا يحيى بن أيوب، عن يزيد بن أبي حبيب، أن أبا الخير، حدثه قال رأيت على ابن وعلة السبئي فروا فمسسته فقال ما لك تمسه قد سألت عبد الله بن عباس قلت إنا نكون بالمغرب ومعنا البربر والمجوس نؤتى بالكبش قد ذبحوه ونحن لا نأكل ذبائحهم ويأتونا بالسقاء يجعلون فيه الودك ‏.‏ فقال ابن عباس قد سألنا رسول الله صلى الله عليه وسلم عن ذلك فقال ‏\"‏ دباغه طهوره ‏\"‏ ‏.‏",
      "text_en": " Abu al-Khair reported:                      I saw Ibn Wa'la al-Saba'i wear a fur. I touched it. He said: Why do you touch it? I asked Ibn 'Abbas saying: We are the inhabitants of the western regions, and there (live) with us Berbers and Magians. They bring with them rams and slaughter them, but we do not eat (the meat of the animals) slaughtered by them, and they come with skins full of fat. Upon this Ibn 'Abbas said: We asked the Messenger of Allah (may peace be upon him) about this and he said: Its tanning makes it pure.",
      "chain": [
        "30313",
        "11108",
        "20436",
        "20379",
        "11411",
        "17"
      ]
    },
    {
      "hadith_no": "368",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Menstruation - كتاب الحيض",
      "chapter_no": "4",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة وابن نمير جميعا عن أبي معاوية، قال أبو بكر حدثنا أبو معاوية، عن الأعمش، عن شقيق، قال كنت جالسا مع عبد الله وأبي موسى فقال أبو موسى يا أبا عبد الرحمن أرأيت لو أن رجلا أجنب فلم يجد الماء شهرا كيف يصنع بالصلاة فقال عبد الله لا يتيمم وإن لم يجد الماء شهرا ‏.‏ فقال أبو موسى فكيف بهذه الآية في سورة المائدة ‏{‏ فلم تجدوا ماء فتيمموا صعيدا طيبا‏}‏ فقال عبد الله لو رخص لهم في هذه الآية - لأوشك إذا برد عليهم الماء أن يتيمموا بالصعيد ‏.‏ فقال أبو موسى لعبد الله ألم تسمع قول عمار بعثني رسول الله صلى الله عليه وسلم في حاجة فأجنبت فلم أجد الماء فتمرغت في الصعيد كما تمرغ الدابة ثم أتيت النبي صلى الله عليه وسلم فذكرت ذلك له فقال ‏\"‏ إنما كان يكفيك أن تقول بيديك هكذا ‏\"‏ ‏.‏ ثم ضرب بيديه الأرض ضربة واحدة ثم مسح الشمال على اليمين وظاهر كفيه ووجهه ‏.‏ فقال عبد الله أولم تر عمر لم يقنع بقول عمار",
      "text_en": " Shaqiq reported:                      I was sitting in the company of Abdullah and Abu Musa when Abu Musa said: 0 'Abd al-Rahman (kunya of 'Abdullah b. Mas'ud), what would you like a man to do about the prayer if he experiences a seminal emission or has sexual intercourse but does not find water for a month? 'Abdullah said: He should not perform tayammum even if he does not find water for a month. 'Abdullah said: Then what about the verse in Sura Ma'ida:\" If you do not find water, betake yourself to clean dust\"? 'Abdullah said: If they were granted concession on the basis of this verse, there is a possibility that they would perform tayammum with dust on finding water very cold for themselves. Abu Musa said to Abdullah: You have not heard the words of 'Ammar: The Messenger of Allah (may peace be upon him) sent me on an errand and I had a seminal emission, but could find no water, and rolled myself in dust just as a beast rolls itself. I came to the Messenger of Allah (may peace be upon him) then and made a mention of that to him and he (the Holy Prophet) said: It would have been enough for you to do thus. Then he struck the ground with his hands once and wiped his right hand with the help of his left hand and the exterior of his palms and his face. 'Abdullah said: Didn't you see that Umar was not fully satisfied with the words of 'Ammar only?",
      "chain": [
        "30399",
        "20354",
        "20436",
        "20354",
        "11060",
        "11353"
      ]
    },
    {
      "hadith_no": "394",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وإسحاق بن إبراهيم، جميعا عن سفيان، - قال أبو بكر حدثنا سفيان بن عيينة، - عن الزهري، عن محمود بن الربيع، عن عبادة بن الصامت، يبلغ به النبي صلى الله عليه وسلم ‏\"‏ لا صلاة لمن لم يقرأ بفاتحة الكتاب ‏\"‏ ‏.‏",
      "text_en": " 'Ubada b. as-Samit reported from the Apostle of Allah (may peace be upon him ):                      He who does not recite Fatihat al-Kitab is not credited with having observed the prayer.",
      "chain": [
        "30201",
        "30263",
        "30123",
        "20005",
        "20436",
        "20005",
        "11013",
        "5278"
      ]
    },
    {
      "hadith_no": "400",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا علي بن حجر السعدي، حدثنا علي بن مسهر، أخبرنا المختار بن فلفل، عن أنس بن مالك، ح  وحدثنا أبو بكر بن أبي شيبة، - واللفظ له - حدثنا علي بن مسهر، عن المختار، عن أنس، قال بينا رسول الله صلى الله عليه وسلم ذات يوم بين أظهرنا إذ أغفى إغفاءة ثم رفع رأسه متبسما فقلنا ما أضحكك يا رسول الله قال ‏\"‏ أنزلت على آنفا سورة ‏\"‏ ‏.‏ فقرأ ‏\"‏ بسم الله الرحمن الرحيم ‏{‏ إنا أعطيناك الكوثر * فصل لربك وانحر * إن شانئك هو الأبتر‏}‏ ‏\"‏ ‏.‏ ثم قال ‏\"‏ أتدرون ما الكوثر ‏\"‏ ‏.‏ فقلنا الله ورسوله أعلم ‏.‏ قال ‏\"‏ فإنه نهر وعدنيه ربي عز وجل عليه خير كثير هو حوض ترد عليه أمتي يوم القيامة آنيته عدد النجوم فيختلج العبد منهم فأقول رب إنه من أمتي ‏.‏ فيقول ما تدري ما أحدثت بعدك ‏\"‏ ‏.‏ زاد ابن حجر في حديثه بين أظهرنا في المسجد ‏.‏ وقال ‏\"‏ ما أحدث بعدك ‏\"‏ ‏.‏",
      "text_en": " Anas reported:                      One day the Messenger of Allah (may peace be upon him) was sitting amongst us that he dozed off. He then raised his head smilingly. We said: What makes you smile. Messenger of Allah? He said: A Sura has just been revealed to me, and then recited: In the name of Allah, the Compassionate, the Merciful. Verily We have given thee Kauthar (fount of abundance). Therefore turn to thy Lord for prayer and offer sacrifice, and surely thy enemy is cut off (from the good). Then he (the Holy Prophet) said: Do you know what Kauthar is? We said: Allah and His Messenger know best. The Holy Prophet (may peace be upon him) said: It (Kauthar) is a canal which my Lord, the Exalted and Glorious has promised me, and there is an abundance of good in it. It is a cistern and my people would come to it on the Day of Resurrection, and tumblers there would be equal to the number of stars. A servant would be turned away from (among the people gathered there). Upon this I would say: My Lord, he is one of my people, and He (the Lord) would say: You do not know that he innovated new things (in Islam) after you. Ibn Hujr made this addition in the hadith:\" He (the Holy Prophet) was sitting amongst us in the mosque, and He (Allah) said: (You don't know) what he innovated after you\"",
      "chain": [
        "20387",
        "20345",
        "10962",
        "19",
        "20436",
        "20345",
        "19"
      ]
    },
    {
      "hadith_no": "411",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا يحيى بن يحيى، وقتيبة بن سعيد، وأبو بكر بن أبي شيبة وعمرو الناقد وزهير بن حرب وأبو كريب جميعا عن سفيان، - قال أبو بكر حدثنا سفيان بن عيينة، - عن الزهري، قال سمعت أنس بن مالك، يقول سقط النبي صلى الله عليه وسلم عن فرس فجحش شقه الأيمن فدخلنا عليه نعوده فحضرت الصلاة فصلى بنا قاعدا فصلينا وراءه قعودا فلما قضى الصلاة قال ‏\"‏ إنما جعل الإمام ليؤتم به فإذا كبر فكبروا وإذا سجد فاسجدوا وإذا رفع فارفعوا وإذا قال سمع الله لمن حمده ‏.‏ فقولوا ربنا ولك الحمد ‏.‏ وإذا صلى قاعدا فصلوا قعودا أجمعون ‏\"‏ ‏.‏",
      "text_en": " Anas b. Malik reported:                      The Apostle of Allah (may peace be upon him) fell down from a horse and his right side was grazed. We went to him to inquire after his health when the time of prayer came. He led us in prayer in a sitting posture and we said prayer behind him sitting, and when he finished the prayer hesaid: The Imam is appointed only to be followed; so when he recites takbir, you should also recite that; when he prostrates, you should also prostrate; when he rises up, you should also rise up, and when he said\" God listens to him who praises Him,\" you should say:\" Our Lord, to Thee be the praise,\" and when he prays sitting, all of you should pray sitting.",
      "chain": [
        "30399",
        "30367",
        "20005",
        "20436",
        "20005",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "419",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثني عمرو الناقد، وحسن الحلواني، وعبد بن حميد، - قال عبد أخبرني وقال الآخران، حدثنا يعقوب، - وهو ابن إبراهيم بن سعد - وحدثني أبي، عن صالح، عن ابن شهاب، قال أخبرني أنس بن مالك، أن أبا بكر، كان يصلي لهم في وجع رسول الله صلى الله عليه وسلم الذي توفي فيه حتى إذا كان يوم الاثنين - وهم صفوف في الصلاة - كشف رسول الله صلى الله عليه وسلم ستر الحجرة فنظر إلينا وهو قائم كأن وجهه ورقة مصحف ‏.‏ ثم تبسم رسول الله صلى الله عليه وسلم ضاحكا - قال - فبهتنا ونحن في الصلاة من فرح بخروج رسول الله صلى الله عليه وسلم ونكص أبو بكر على عقبيه ليصل الصف وظن أن رسول الله صلى الله عليه وسلم خارج للصلاة فأشار إليهم رسول الله صلى الله عليه وسلم بيده أن أتموا صلاتكم - قال - ثم دخل رسول الله صلى الله عليه وسلم فأرخى الستر - قال - فتوفي رسول الله صلى الله عليه وسلم من يومه ذلك ‏.‏",
      "text_en": " Anas b. Malik reported, Abu Bakr led them in prayer due to the illness of the Messenger of Allah (may peace be upon him) of which be died. It was a Monday and they stood in rows for prayer. The Messenger of Allah (may peace be upon him) drew aside the curtain of ('A'isha's) apartment and looked at us while he was standing, and his (Prophet's) face was (as bright) as the paper of the Holy Book. The Messenger of Allah (may peace be upon him) felt happy and smiled. And we were confounded with joy while in prayer due to the arrival (among our midst) of the Messenger of Allah (may peace be upon him), Abu Bakr stepped back upon his heels to say prayer in a row perceiving that the Messenger of Allah (may peace be upon him) had come out for prayer. The Messenger of Allah (may peace be upon him) with the help of his hand signed to them to complete their prayer. The Messenger of Allah (may peace be upon him) went back (to his apartment) and drew the curtain. He (the narrator) said:                      The Messenger of Allah (may peace be upon him) breathed his last on that very day.",
      "chain": [
        "30263",
        "130115",
        "30553",
        "20184",
        "20150",
        "11176",
        "11013",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "426",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن حجر، واللفظ، لأبي بكر قال ابن حجر أخبرنا وقال أبو بكر، حدثنا علي بن مسهر، عن المختار بن فلفل، عن أنس، قال صلى بنا رسول الله صلى الله عليه وسلم ذات يوم فلما قضى الصلاة أقبل علينا بوجهه فقال ‏\"‏ أيها الناس إني إمامكم فلا تسبقوني بالركوع ولا بالسجود ولا بالقيام ولا بالانصراف فإني أراكم أمامي ومن خلفي - ثم قال - والذي نفس محمد بيده لو رأيتم ما رأيت لضحكتم قليلا ولبكيتم كثيرا ‏\"‏ ‏.‏ قالوا وما رأيت يا رسول الله قال ‏\"‏ رأيت الجنة والنار ‏\"‏ ‏.‏",
      "text_en": " Anas reported:                      The Messenger of Allah (may peace be upon him) one day led us in the prayer. and when he completed the Prayer he turned his face towards us and said: 0 People, I am your Imam, so do not precede me in bowing and prostration and in standing and turning (faces, i. e. In pronouncing salutation), for I see you in front of me and behind me, and then said: By Him in Whose hand Is the life of Muhammad, if you could see what I see, you would have laughed little and wept much more. They said: What did you see, Messenger of Allah? He replied: (I saw) Paradise and Hell.",
      "chain": [
        "30201",
        "20387",
        "20436",
        "20345",
        "10962",
        "19"
      ]
    },
    {
      "hadith_no": "448",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "وحدثنا قتيبة بن سعيد، وأبو بكر بن أبي شيبة وإسحاق بن إبراهيم كلهم عن جرير، - قال أبو بكر حدثنا جرير بن عبد الحميد، - عن موسى بن أبي عائشة، عن سعيد بن جبير، عن ابن عباس، في قوله عز وجل ‏{‏ لا تحرك به لسانك‏}‏ قال كان النبي صلى الله عليه وسلم إذا نزل عليه جبريل بالوحى كان مما يحرك به لسانه وشفتيه فيشتد عليه فكان ذلك يعرف منه فأنزل الله تعالى ‏{‏ لا تحرك به لسانك لتعجل به‏}‏ أخذه ‏{‏ إن علينا جمعه وقرآنه‏}‏ إن علينا أن نجمعه في صدرك ‏.‏ وقرآنه فتقرأه ‏{‏ فإذا قرأناه فاتبع قرآنه‏}‏ قال أنزلناه فاستمع له ‏{‏ إن علينا بيانه‏}‏ أن نبينه بلسانك فكان إذا أتاه جبريل أطرق فإذا ذهب قرأه كما وعده الله ‏.‏",
      "text_en": " Ibn 'Abbas reported with regard to the words of Allah, Great and Glorious:                     \" Move not thy tongue therewith\" (Ixxv. 16) that when Gabriel brought revelation to him (the Holy Prophet) he moved his tongue and lips (with a view to committing it to memory instantly). This was something hard for him and it was visible (from his face). Then Allah, the Exalted. revealed this a\" Move not thy tongue therewith to make haste (in memorising it). Surely on us rests the collecting of it and the reciting of it\" (ixxv. 16), i. e. Verily it rests with Us that We would preserve it in your heart and (enable you) to recite it You would recite it when We would recite it and so follow its recitation, and He (Allah) said:\" We revealed it, so listen to it attentively. Verily its exposition rests with Us. i. e. We would make it deliver by your tongue.\" So when Gabriel came to him (to the Holy Prophet), he kept silence, and when he went away he recited as Allah had promised him.",
      "chain": [
        "30367",
        "20028",
        "20436",
        "20028",
        "11399",
        "11050"
      ]
    },
    {
      "hadith_no": "479",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayers - كتاب الصلاة",
      "chapter_no": "5",
      "text_ar": "قال أبو بكر حدثنا سفيان، عن سليمان، حدثنا يحيى بن أيوب، حدثنا إسماعيل بن جعفر، أخبرني سليمان بن سحيم، عن إبراهيم بن عبد الله بن معبد بن عباس، عن أبيه، عن عبد الله بن عباس، قال كشف رسول الله صلى الله عليه وسلم الستر ورأسه معصوب في مرضه الذي مات فيه فقال ‏\"‏ اللهم هل بلغت ‏\"‏ ‏.‏ ثلاث مرات ‏\"‏ إنه لم يبق من مبشرات النبوة إلا الرؤيا يراها العبد الصالح أو ترى له ‏\"‏ ‏.‏ ثم ذكر بمثل حديث سفيان ‏.‏",
      "text_en": " 'Abdullah b. 'Abbas reported:                      The Messenger of Allah (may peace be upon him) drew aside the curtain and his head was bandaged on account of illness in which he died. He said: O Allah, have I not delivered (Thy Message)? (He repeated it) three times. Nothing has been left out of the glad tidings of apostlebood, but good vision. which a pious servant (of Allah) sees or someone else is made to see for him. He then narrated like the hadith transmitted by Sufyan.",
      "chain": [
        "20436",
        "20012",
        "11060",
        "20379",
        "20155",
        "11855",
        "11825",
        "11873",
        "17"
      ]
    },
    {
      "hadith_no": "1216",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، - واللفظ لأبي بكر - قال إسحاق أخبرنا وقال أبو بكر، حدثنا زكرياء بن عدي، عن عبيد الله بن عمرو، عن زيد بن أبي أنيسة، عن عمرو بن مرة، عن عبد الله بن الحارث النجراني، قال حدثني جندب، قال سمعت النبي صلى الله عليه وسلم قبل أن يموت بخمس وهو يقول ‏\"‏ إني أبرأ إلى الله أن يكون لي منكم خليل فإن الله تعالى قد اتخذني خليلا كما اتخذ إبراهيم خليلا ولو كنت متخذا من أمتي خليلا لاتخذت أبا بكر خليلا ألا وإن من كان قبلكم كانوا يتخذون قبور أنبيائهم وصالحيهم مساجد ألا فلا تتخذوا القبور مساجد إني أنهاكم عن ذلك ‏\"‏ ‏.‏",
      "text_en": " Jundub reported:                      I heard from the Apostle of Allah (may peace be upon him) five days before his death and he said: I stand acquitted before Allah that I took any one of you as friend, for Allah has taken me as His friend, as he took Ibrahim as His friend. Had I taken any one of my Ummah as a friend, I would have taken Abu Bakr as a friend. Beware of those who preceded you and used to take the graves of their prophets and righteous men as places of worship, but you must not take graves as mosques; I forbid you to do that.",
      "chain": [
        "30201",
        "30123",
        "30312",
        "20436",
        "30464",
        "30024",
        "11340",
        "11381",
        "10780",
        "4053"
      ]
    },
    {
      "hadith_no": "1463",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، قال أبو بكر حدثنا وقال، إسحاق أخبرنا وكيع، عن علي بن المبارك، عن يحيى بن أبي كثير، في هذا الإسناد بمثله ‏.‏",
      "text_en": " This hadith has been reported by Yahya b. Abd Kathir with the same chain of transmitters.",
      "chain": [
        "30201",
        "30123",
        "20436",
        "30312",
        "20032",
        "20449"
      ]
    },
    {
      "hadith_no": "1558",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، حدثنا وكيع، عن سفيان، قال أبو بكر وحدثنا محمد بن بشر، عن زكرياء، كلاهما عن سماك، عن جابر بن سمرة، أن النبي صلى الله عليه وسلم كان إذا صلى الفجر جلس في مصلاه حتى تطلع الشمس حسنا ‏.‏",
      "text_en": " Simak narrated on the authority of Jabir b. Samura that when the Apostle of Allah (may peace be upon him) observed the dawn prayer, he sat at the place of worship till the sun had risen enough.",
      "chain": [
        "30201",
        "20032",
        "20012",
        "20436",
        "20352",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1564",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو سعيد الأشج كلاهما عن أبي خالد، - قال أبو بكر حدثنا أبو خالد الأحمر، - عن الأعمش، عن إسماعيل بن رجاء، عن أوس بن ضمعج، عن أبي مسعود الأنصاري، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ يؤم القوم أقرؤهم لكتاب الله فإن كانوا في القراءة سواء فأعلمهم بالسنة فإن كانوا في السنة سواء فأقدمهم هجرة فإن كانوا في الهجرة سواء فأقدمهم سلما ولا يؤمن الرجل الرجل في سلطانه ولا يقعد في بيته على تكرمته إلا بإذنه ‏\"‏ ‏.‏ قال الأشج في روايته مكان سلما سنا ‏.‏",
      "text_en": " Abu Mas'ud al-Ansari reported Allah's Messenger (may peace be upon him) as saying:                      The one who is most versed in Allah's Book should act as Imam for the people, but If they are equally versed in reciting it, then the one who has most knowledge regarding Sunnah if they are equal regarding the Sunnah, then the earliest one to emigrate; it they emigrated at the same time, then the earliest one to embrace Islam. No man must lead another in prayer where (the latter) has authority, or sit in his place of honour in his house, without his permission. Ashajj in his narration used the word,\" age\" in place of\" Islam\".",
      "chain": [
        "30201",
        "30200",
        "20436",
        "20326",
        "11060",
        "10740",
        "10744",
        "402"
      ]
    },
    {
      "hadith_no": "1615",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، ومحمد بن بشار، كلاهما عن غندر، - قال أبو بكر حدثنا محمد بن جعفر، غندر - عن شعبة، عن يحيى بن يزيد الهنائي، قال سألت أنس بن مالك عن قصر الصلاة، فقال كان رسول الله صلى الله عليه وسلم إذا خرج مسيرة ثلاثة أميال أو ثلاثة فراسخ - شعبة الشاك - صلى ركعتين ‏.‏",
      "text_en": " Yahya b. Yazid al-Huna'i reported:                      I asked Anas b. Malik about shortening of prayer. He said: When the Messenger of' Allah (may peace be upon him) had covered a distance of three miles or three farsakh (Shu'ba, one of the narrators, had some doubt about it) he observed two rak'ahs.",
      "chain": [
        "30201",
        "30160",
        "20278",
        "20436",
        "20278",
        "20020",
        "19"
      ]
    },
    {
      "hadith_no": "1715",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنيه علي بن حجر، حدثنا علي يعني ابن مسهر، ح وحدثناه أبو كريب، حدثنا أبو أسامة، ح وحدثناه أبو بكر، وأبو كريب وابن نمير عن عبد الله بن نمير، ح وحدثناه عمرو الناقد، حدثنا وكيع، كلهم عن هشام، بهذا الإسناد وفي حديث أبي أسامة إذا طلع الفجر ‏.‏",
      "text_en": " This hadith has been narrated by the same chain of transmitters and in the hadith narrated by Usama the words are:                     \" When it was dawn\".",
      "chain": [
        "20345",
        "30216",
        "20318",
        "20436",
        "20331",
        "30263"
      ]
    },
    {
      "hadith_no": "1740",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، قال أبو بكر حدثنا إسماعيل ابن علية، عن الوليد بن أبي هشام، عن أبي بكر بن محمد، عن عمرة، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم يقرأ وهو قاعد فإذا أراد أن يركع قام قدر ما يقرأ إنسان أربعين آية ‏.‏",
      "text_en": " Alqama b. Waqqas reported:                      I asked 'A'isha how the Messenger of Allah (may peace be upon him) did in the two rak'ahs as he (observed them) sitting. She said: He would recite (the Qur'an) in them, and when he intended to bow, he would stand up and then bowed.",
      "chain": [
        "30201",
        "30123",
        "20436",
        "20208",
        "10622",
        "11455",
        "53"
      ]
    },
    {
      "hadith_no": "1766",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ونصر بن علي، وابن أبي عمر، قال أبو بكر حدثنا سفيان بن عيينة، عن أبي النضر، عن أبي سلمة، عن عائشة، قالت كان النبي صلى الله عليه وسلم إذا صلى ركعتى الفجر فإن كنت مستيقظة حدثني وإلا اضطجع ‏.‏",
      "text_en": " A hadith like this has been narrated by 'A'isha by another chain of transmitters.",
      "chain": [
        "30201",
        "30395",
        "30421",
        "20436",
        "20005",
        "11164",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "1842",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة جميعا عن هشيم، - قال أبو بكر حدثنا هشيم، - أخبرنا أبو حرة، عن الحسن، عن سعد بن هشام، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا قام من الليل ليصلي افتتح صلاته بركعتين خفيفتين ‏.‏",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace be upon him) as saying When any one of you gets up at night, he should begin the prayer with two short rak'ahs.",
      "chain": [
        "30399",
        "20468",
        "20436",
        "20468",
        "20573",
        "11016",
        "11166",
        "53"
      ]
    },
    {
      "hadith_no": "1903",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب جميعا عن حفص، - قال أبو بكر حدثنا حفص بن غياث، - عن الأعمش، عن إبراهيم، عن عبيدة، عن عبد الله، قال قال لي رسول الله صلى الله عليه وسلم ‏\"‏ اقرأ على القرآن ‏\"‏ ‏.‏ قال فقلت يا رسول الله أقرأ عليك وعليك أنزل قال ‏\"‏ إني أشتهي أن أسمعه من غيري ‏\"‏ ‏.‏ فقرأت النساء حتى إذا بلغت ‏{‏ فكيف إذا جئنا من كل أمة بشهيد وجئنا بك على هؤلاء شهيدا‏}‏ رفعت رأسي أو غمزني رجل إلى جنبي فرفعت رأسي فرأيت دموعه تسيل ‏.‏",
      "text_en": " This hadith has been narratted by A'mash with the same chain of transmitters but with this addition:                     \" The Messenger of Allah (may peace be upon him) was on the pulpit when he asked me to recite to him.\"",
      "chain": [
        "30201",
        "20436",
        "20317",
        "11060",
        "11051",
        "11370",
        "16"
      ]
    },
    {
      "hadith_no": "1945",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وابن، نمير جميعا عن وكيع، - قال أبو بكر حدثنا وكيع، - عن الأعمش، عن أبي وائل، قال جاء رجل يقال له نهيك بن سنان إلى عبد الله فقال يا أبا عبد الرحمن كيف تقرأ هذا الحرف ألفا تجده أم ياء من ماء غير آسن أو من ماء غير ياسن قال فقال عبد الله وكل القرآن قد أحصيت غير هذا قال إني لأقرأ المفصل في ركعة ‏.‏ فقال عبد الله هذا كهذ الشعر إن أقواما يقرءون القرآن لا يجاوز تراقيهم ولكن إذا وقع في القلب فرسخ فيه نفع إن أفضل الصلاة الركوع والسجود إني لأعلم النظائر التي كان رسول الله صلى الله عليه وسلم يقرن بينهن سورتين في كل ركعة ‏.‏ ثم قام عبد الله فدخل علقمة في إثره ثم خرج فقال قد أخبرني بها ‏.‏ قال ابن نمير في روايته جاء رجل من بني بجيلة إلى عبد الله ولم يقل نهيك بن سنان ‏.‏",
      "text_en": " Abu Wa'il reported:                      A person came to 'Abdullah, who was called Nahik b. Sinan, and the rest of the hadith is the same but for this:\" Alqama came to him ('Abdullah b. Mas'ud) and we said to him: Ask him about the manners in which he combined (two surahs) in one rak'ah. So he went to him and asked him and then came to us and said: Twenty are the mufassal surahs in the compilation (of the Qur'an) made by 'Abdullah.\"",
      "chain": [
        "30201",
        "20032",
        "20436",
        "20032",
        "11060",
        "11353"
      ]
    },
    {
      "hadith_no": "1975",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب جميعا عن ابن فضيل، - قال أبو بكر حدثنا محمد بن فضيل، - عن مختار بن فلفل، قال سألت أنس بن مالك عن التطوع، بعد العصر فقال كان عمر يضرب الأيدي على صلاة بعد العصر وكنا نصلي على عهد النبي صلى الله عليه وسلم ركعتين بعد غروب الشمس قبل صلاة المغرب ‏.‏ فقلت له أكان رسول الله صلى الله عليه وسلم صلاهما قال كان يرانا نصليهما ‏.‏ فلم يأمرنا ولم ينهنا.",
      "text_en": " Anas b. Malik reported:                      When we were in Medina, the moment the Mu'adhdhin made the call to the sunset prayer, the people hastened to the pillars of the mosque and prayed two rak'ahs with the result that any stranger coming into the mosque would think that the obligatory prayer had been observed owing to the number who were praying then.",
      "chain": [
        "30201",
        "20356",
        "20436",
        "20356",
        "19"
      ]
    },
    {
      "hadith_no": "2026",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Friday) - كتاب الجمعة",
      "chapter_no": "8",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، قال أبو بكر حدثنا يحيى، بن آدم حدثنا حسن بن عياش، عن جعفر بن محمد، عن أبيه، عن جابر بن عبد الله، قال كنا نصلي مع رسول الله صلى الله عليه وسلم ثم نرجع فنريح نواضحنا ‏.‏ قال حسن فقلت لجعفر في أى ساعة تلك قال زوال الشمس ‏.‏",
      "text_en": " Jabir b. 'Abdullah reported:                      We used to observe (Jumu'a) prayer with the Messenger of Allah (may peace be upon him) and then we returned and gave rest to our camels used for carrying water. Hassan[ (one of the narrators) said: I asked Ja'far what time that was. He said.. It is the time when the sun passes the meridian.",
      "chain": [
        "30201",
        "30123",
        "20436",
        "20364",
        "10898",
        "11442",
        "34"
      ]
    },
    {
      "hadith_no": "2082",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Two Eids) - كتاب صلاة العيدين",
      "chapter_no": "9",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وابن أبي عمر، قال أبو بكر حدثنا سفيان بن، عيينة حدثنا أيوب، قال سمعت عطاء، قال سمعت ابن عباس، يقول أشهد على رسول الله صلى الله عليه وسلم لصلى قبل الخطبة - قال - ثم خطب فرأى أنه لم يسمع النساء فأتاهن فذكرهن ووعظهن وأمرهن بالصدقة وبلال قائل بثوبه فجعلت المرأة تلقي الخاتم والخرص والشىء ‏.‏  وحدثنيه أبو الربيع الزهراني، حدثنا حماد، ح وحدثني يعقوب الدورقي، حدثنا إسماعيل بن إبراهيم، كلاهما عن أيوب، بهذا الإسناد نحوه ‏.‏",
      "text_en": " Ibn 'Abbas reported:                      I bear testimony to the Messenger of Allah (may peace be upon him) offering prayer before Kbutba. He (after saying prayer) delivered the Kutba, and he found that the women could not hear it, so he came to them and exhorted them and preached them and commanded them to give alms, and Bilal had stretched his cloth and the women were throwing rings, earrings and other things. This hadith has been narrated on the authority of Ayyub with the same chain of transmitters.",
      "chain": [
        "30201",
        "30421",
        "20436",
        "20005",
        "11015",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "2164",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا أبو بكر، وعثمان، ابنا أبي شيبة ح وحدثني عمرو الناقد، قالوا جميعا حدثنا أبو خالد الأحمر، عن يزيد بن كيسان، عن أبي حازم، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لقنوا موتاكم لا إله إلا الله ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Exhort to recite\" There is no god but Allah\" to those of you who are dying.",
      "chain": [
        "20436",
        "30263",
        "20326",
        "10845",
        "11172",
        "13"
      ]
    },
    {
      "hadith_no": "2181",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن عبد الله بن نمير، جميعا عن ابن بشر، - قال أبو بكر حدثنا محمد بن بشر العبدي، - عن عبيد الله بن عمر، قال حدثنا نافع، عن عبد الله، أن حفصة، بكت على عمر فقال مهلا يا بنية ألم تعلمي أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إن الميت يعذب ببكاء أهله عليه ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah b. 'Umar reported that Hafsa wept for 'Umar (when he was about to die). He ('Umar) said:                      Be quiet, my daughter. Don't you know that the Messenger of Allah (may peace be upon him) had said:\" The deceased is punished because of his family's weeping over the death\"?",
      "chain": [
        "30201",
        "20436",
        "20352",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "2219",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا يحيى بن أيوب، وأبو بكر بن أبي شيبة وعمرو الناقد كلهم عن ابن علية، - قال أبو بكر حدثنا إسماعيل ابن علية، - عن خالد، عن حفصة، عن أم عطية، أن رسول الله صلى الله عليه وسلم قال لهن في غسل ابنته ‏\"‏ ابدأن بميامنها ومواضع الوضوء منها ‏\"‏ ‏.‏",
      "text_en": " Umm 'Atiyya reported that the Messenger of Allah (may peace be upon him) said to them (the women) in regard to the washing of his daughter to start from the right side and with those parts of the body over which Wudu' is performed.",
      "chain": [
        "20379",
        "20208",
        "20436",
        "20208",
        "11282",
        "11039",
        "71"
      ]
    },
    {
      "hadith_no": "2229",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، جميعا عن ابن عيينة، - قال أبو بكر حدثنا سفيان بن عيينة، - عن الزهري، عن سعيد، عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ أسرعوا بالجنازة فإن تك صالحة فخير - لعله قال - تقدمونها عليه وإن تكن غير ذلك فشر تضعونه عن رقابكم ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Apostle (may peace be upon him) as saying:                      Make haste at a funeral; if the dead person was good, it is a good state to which you are sending him on; but if he was otherwise it is an evil of which you are ridding yourselves.",
      "chain": [
        "30201",
        "30022",
        "20005",
        "20436",
        "20005",
        "11013",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "2260",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، وابن، بشار قالوا حدثنا محمد، بن جعفر حدثنا شعبة، - وقال أبو بكر عن شعبة، - عن عمرو بن مرة، عن عبد الرحمن، بن أبي ليلى قال كان زيد يكبر على جنائزنا أربعا وإنه كبر على جنازة خمسا فسألته فقال كان رسول الله صلى الله عليه وسلم يكبرها ‏.‏",
      "text_en": " It is narrated on the authority of 'Abd al-Rahman b. Abu Laila that Zaid used to recite four takbirs on our funerals and he recited five takbirs on one funeral. I asked him the reason (for this variation), to which he replied:                      The Messenger of Allah (may peace be upon him) recited thus.",
      "chain": [
        "30201",
        "30170",
        "30160",
        "20173",
        "20020",
        "20436",
        "20020",
        "11381",
        "11196"
      ]
    },
    {
      "hadith_no": "2282",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Funerals) - كتاب الجنائز",
      "chapter_no": "12",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة - واللفظ ليحيى - قال أبو بكر حدثنا وقال، يحيى أخبرنا وكيع، عن مالك بن مغول، عن سماك بن حرب، عن جابر بن، سمرة قال أتي النبي صلى الله عليه وسلم بفرس معرورى فركبه حين انصرف من جنازة ابن الدحداح ونحن نمشي حوله ‏.‏",
      "text_en": " It is reported on the authority of Jabir ibn Samura that an unsaddled horse was brought to the Holy Prophet (may peace be upon him) and he rode on it when he returned after having offered the funeral prayer of Ibn Dahdah and we walked on foot around him.",
      "chain": [
        "30399",
        "20436",
        "20031",
        "20032",
        "20358",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "2521",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإسحاق، جميعا عن يزيد، - قال أبو بكر حدثنا يزيد بن هارون، - عن العوام بن حوشب، حدثنا أبو إسحاق الشيباني، عن أسير بن عمرو، عن سهل بن حنيف، عن النبي صلى الله عليه وسلم قال ‏\"‏ يتيه قوم قبل المشرق محلقة رءوسهم ‏\"‏ ‏.‏",
      "text_en": " Sahl b. Hunaif reported Allah's Apostle (may peace be upon him) as saying:                      There would arise from the east a people with shaven heads.",
      "chain": [
        "30201",
        "20472",
        "20436",
        "20472",
        "11441",
        "11352",
        "403"
      ]
    },
    {
      "hadith_no": "2570",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قال أبو بكر حدثنا وكيع، عن علي، بن مبارك عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، - رضى الله عنه - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقدموا رمضان بصوم يوم ولا يومين إلا رجل كان يصوم صوما فليصمه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      Do not observe fast for a day, or two days ahead of Ramadan except a person who is in the habit of observing a particular fast; he may fast on that day.",
      "chain": [
        "30201",
        "30216",
        "20436",
        "20032",
        "20449",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2647",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثني هارون بن سعيد الأيلي، حدثنا ابن وهب، أخبرني عمرو، - وهو ابن الحارث - عن عبد ربه، عن عبد الله بن كعب الحميري، أن أبا بكر، حدثه أن مروان أرسله إلى أم سلمة - رضى الله عنها - يسأل عن الرجل يصبح جنبا أيصوم فقالت كان رسول الله صلى الله عليه وسلم يصبح جنبا من جماع لا من حلم ثم لا يفطر ولا يقضي ‏.‏",
      "text_en": " Abu Bakr reported that Marwan sent him to Umm Salama to ask whether a person should observe fast who is in a state of junub and the dawn breaks upon him, whereupon she said that the Messenger of Allah (may peace be upon him) (was at times) junbi on account of intercourse and not due to sexual dream, and the dawn broke upon him, but he neither broke the fast nor recompensed.",
      "chain": [
        "30492",
        "20029",
        "20377",
        "11870",
        "20436"
      ]
    },
    {
      "hadith_no": "2668",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، وابن، بشار جميعا عن محمد، بن جعفر - قال أبو بكر حدثنا غندر، - عن شعبة، عن محمد بن عبد الرحمن بن سعد، عن محمد بن عمرو بن الحسن، عن جابر بن عبد الله، - رضى الله عنهما - قال كان رسول الله صلى الله عليه وسلم في سفر فرأى رجلا قد اجتمع الناس عليه وقد ظلل عليه فقال ‏\"‏ ما له ‏\"‏ ‏.‏ قالوا رجل صائم ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ليس من البر أن تصوموا في السفر ‏\"‏ ‏.‏",
      "text_en": " Jabir b. 'Abdullah (Allah be pleased with both of them) reported that in the course of a journey Allah's Messenger (may peace be upon him) saw a man, people crowding around him and providing him a shade. Upon this he (the Holy Prophet) said:                      What is the matter with him? They said: He is a person observing fast. Whereupon the Messenger of Allah (may peace be upon him) said: It is no righteousness that you fast on journey.",
      "chain": [
        "30201",
        "30170",
        "20173",
        "20436",
        "20278",
        "20020",
        "11863",
        "34"
      ]
    },
    {
      "hadith_no": "2684",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وأبو كريب قالا حدثنا ابن نمير، وقال أبو بكر، حدثنا عبد الرحيم بن سليمان، كلاهما عن هشام، بهذا الإسناد أن حمزة، قال إني رجل أصوم أفأصوم في السفر.",
      "text_en": " This hadith has been narrated on the authority of Hisham with the same chain of transmitters that Hamza said:                      I am a person much used to fasting. Should I fast during the journey? (The rest of the hadith is the same.)",
      "chain": [
        "30201",
        "30216",
        "30212",
        "20436"
      ]
    },
    {
      "hadith_no": "2704",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب جميعا عن أبي معاوية، قال أبو بكر حدثنا أبو معاوية، عن الأعمش، عن عمارة، عن عبد الرحمن بن يزيد، قال دخل الأشعث بن قيس على عبد الله وهو يتغدى فقال يا أبا محمد ادن إلى الغداء ‏.‏ فقال أوليس اليوم يوم عاشوراء قال وهل تدري ما يوم عاشوراء قال وما هو قال إنما هو يوم كان رسول الله صلى الله عليه وسلم يصومه قبل أن ينزل شهر رمضان فلما نزل شهر رمضان ترك ‏.‏ وقال أبو كريب تركه ‏.‏",
      "text_en": " Abd al-Rahman b. Yazid said:                      When al-Ash'ath b. Qais entered the house of 'Abdullah he was having his breakfast. He ('Abdullah b. Umar) said: Abd Muhammad (al-Asha'th), come near to the breakfast. Thereupon he said: Is not today the day of 'Ashura? He ('Abd al-Rahman) said: Do you know what the day of 'Ashura is? He said: What is it? He said: It is a day on which the Messenger of Allah (may peace be upon him) used to observe fast before the (fasting) in the month of Ramadan (became) obligatory. But when it became obligatory the (fasting of 'Ashura) was abandoned (as compulsory). Abu Kuraib said: He (the Holy Prophet) abandoned it.",
      "chain": [
        "30201",
        "20354",
        "20436",
        "20354",
        "11060",
        "11379",
        "20395"
      ]
    },
    {
      "hadith_no": "2718",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، جميعا عن سفيان، - قال أبو بكر حدثنا ابن عيينة، - عن عبيد الله بن أبي يزيد، سمع ابن عباس، - رضى الله عنهما - وسئل عن صيام، يوم عاشوراء ‏.‏ فقال ما علمت أن رسول الله صلى الله عليه وسلم صام يوما يطلب فضله على الأيام إلا هذا اليوم ولا شهرا إلا هذا الشهر يعني رمضان ‏.‏",
      "text_en": " Ibn Abbas was asked about observing of fast on the day of Ashura, whereupon he said:                      I do not know Allah's Messenger (may peace be upon him) singling out any day's fast and considering it more excellent than another, except this day (the day of Ashura) and this month, meaning the month of Ramadan.",
      "chain": [
        "30201",
        "20005",
        "20436",
        "20005",
        "11258",
        "17"
      ]
    },
    {
      "hadith_no": "2778",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، جميعا عن ابن عيينة، - قال أبو بكر حدثنا سفيان بن عيينة، - عن ابن أبي لبيد، عن أبي سلمة، قال سألت عائشة - رضى الله عنها - عن صيام رسول الله صلى الله عليه وسلم فقالت كان يصوم حتى نقول قد صام ‏.‏ ويفطر حتى نقول قد أفطر ‏.‏ ولم أره صائما من شهر قط أكثر من صيامه من شعبان كان يصوم شعبان كله كان يصوم شعبان إلا قليلا ‏.‏",
      "text_en": " Abu Salama reported:                      I asked 'A'isha (Allah be pleased with her) about the fasting of the Messenger of Allah (may peace be upon him). She said: He used to observe fast (at times so continuously) that we said: He has fasted (never to break), and he did not observe fast till we said: He has given up perhaps never to fast, and I never saw him observing (voluntary fasts) more in any other month than that of Sha'ban. (lt appeared as if) he observed fast throughout the whole of Sha'ban except a few (days).",
      "chain": [
        "30201",
        "20005",
        "20436",
        "20005",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "2944",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، وزهير بن حرب، جميعا عن ابن، عيينة - قال أبو بكر حدثنا سفيان بن عيينة، - حدثنا أيوب بن موسى، عن نبيه بن وهب، قال خرجنا مع أبان بن عثمان حتى إذا كنا بملل اشتكى عمر بن عبيد الله عينيه فلما كنا بالروحاء اشتد وجعه فأرسل إلى أبان بن عثمان يسأله فأرسل إليه أن اضمدهما بالصبر فإن عثمان - رضى الله عنه - حدث عن رسول الله صلى الله عليه وسلم في الرجل إذا اشتكى عينيه وهو محرم ضمدهما بالصبر ‏.‏",
      "text_en": " Nubaih b. Wabb reported:                      We went with Aban b. Uthman (in a state of lhram). When we were at Malal the eyes of Umar b. Ubaidullah became sore and, when we reached Rauba' the pain grew intense. He (Nubaib b. Wahb) sent (one) to Aban b. Uthman to ask him (what to do). He sent him (the message) to apply aloes to them, for 'Uthman (Allah be pleased with him) reported that the Messenger of Allah (may peace be upon him) applied aloes to the person whose eyes were sore and he was in the state of Ihram.",
      "chain": [
        "30201",
        "30263",
        "30022",
        "20005",
        "20436",
        "20005",
        "11241"
      ]
    },
    {
      "hadith_no": "3009",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، جميعا عن حاتم، - قال أبو بكر حدثنا حاتم بن إسماعيل المدني، - عن جعفر بن محمد، عن أبيه، قال دخلنا على جابر بن عبد الله فسأل عن القوم، حتى انتهى إلى فقلت أنا محمد بن علي بن حسين، ‏.‏ فأهوى بيده إلى رأسي فنزع زري الأعلى ثم نزع زري الأسفل ثم وضع كفه بين ثديى وأنا يومئذ غلام شاب فقال مرحبا بك يا ابن أخي سل عما شئت ‏.‏ فسألته وهو أعمى وحضر وقت الصلاة فقام في نساجة ملتحفا بها كلما وضعها على منكبه رجع طرفاها إليه من صغرها ورداؤه إلى جنبه على المشجب فصلى بنا فقلت أخبرني عن حجة رسول الله صلى الله عليه وسلم ‏.‏ فقال بيده فعقد تسعا فقال إن رسول الله صلى الله عليه وسلم مكث تسع سنين لم يحج ثم أذن في الناس في العاشرة أن رسول الله صلى الله عليه وسلم حاج فقدم المدينة بشر كثير كلهم يلتمس أن يأتم برسول الله صلى الله عليه وسلم ويعمل مثل عمله فخرجنا معه حتى أتينا ذا الحليفة فولدت أسماء بنت عميس محمد بن أبي بكر فأرسلت إلى رسول الله صلى الله عليه وسلم كيف أصنع قال ‏\"‏ اغتسلي واستثفري بثوب وأحرمي ‏\"‏ ‏.‏ فصلى رسول الله صلى الله عليه وسلم في المسجد ثم ركب القصواء حتى إذا استوت به ناقته على البيداء نظرت إلى مد بصري بين يديه من راكب وماش وعن يمينه مثل ذلك وعن يساره مثل ذلك ومن خلفه مثل ذلك ورسول الله صلى الله عليه وسلم بين أظهرنا وعليه ينزل القرآن وهو يعرف تأويله وما عمل به من شىء عملنا به فأهل بالتوحيد ‏\"‏ لبيك اللهم لبيك لبيك لا شريك لك لبيك إن الحمد والنعمة لك والملك لا شريك لك ‏\"‏ ‏.‏ وأهل الناس بهذا الذي يهلون به فلم يرد رسول الله صلى الله عليه وسلم عليهم شيئا منه ولزم رسول الله صلى الله عليه وسلم تلبيته قال جابر - رضى الله عنه - لسنا ننوي إلا الحج لسنا نعرف العمرة حتى إذا أتينا البيت معه استلم الركن فرمل ثلاثا ومشى أربعا ثم نفذ إلى مقام إبراهيم - عليه السلام - فقرأ ‏{‏ واتخذوا من مقام إبراهيم مصلى‏}‏ فجعل المقام بينه وبين البيت فكان أبي يقول ولا أعلمه ذكره إلا عن النبي صلى الله عليه وسلم كان يقرأ في الركعتين ‏{‏ قل هو الله أحد‏}‏ و ‏{‏ قل يا أيها الكافرون‏}‏ ثم رجع إلى الركن فاستلمه ثم خرج من الباب إلى الصفا فلما دنا من الصفا قرأ ‏{‏ إن الصفا والمروة من شعائر الله‏}‏ ‏\"‏ أبدأ بما بدأ الله به ‏\"‏ ‏.‏ فبدأ بالصفا فرقي عليه حتى رأى البيت فاستقبل القبلة فوحد الله وكبره وقال ‏\"‏ لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير لا إله إلا الله وحده أنجز وعده ونصر عبده وهزم الأحزاب وحده ‏\"‏ ‏.‏ ثم دعا بين ذلك قال مثل هذا ثلاث مرات ثم نزل إلى المروة حتى إذا انصبت قدماه في بطن الوادي سعى حتى إذا صعدتا مشى حتى أتى المروة ففعل على المروة كما فعل على الصفا حتى إذا كان آخر طوافه على المروة فقال ‏\"‏ لو أني استقبلت من أمري ما استدبرت لم أسق الهدى وجعلتها عمرة فمن كان منكم ليس معه هدى فليحل وليجعلها عمرة ‏\"‏ ‏.‏ فقام سراقة بن مالك بن جعشم فقال يا رسول الله ألعامنا هذا أم لأبد فشبك رسول الله صلى الله عليه وسلم أصابعه واحدة في الأخرى وقال ‏\"‏ دخلت العمرة في الحج - مرتين - لا بل لأبد أبد ‏\"‏ ‏.‏ وقدم علي من اليمن ببدن النبي صلى الله عليه وسلم فوجد فاطمة - رضى الله عنها - ممن حل ولبست ثيابا صبيغا واكتحلت فأنكر ذلك عليها فقالت إن أبي أمرني بهذا ‏.‏ قال فكان علي يقول بالعراق فذهبت إلى رسول الله صلى الله عليه وسلم محرشا على فاطمة للذي صنعت مستفتيا لرسول الله صلى الله عليه وسلم فيما ذكرت عنه فأخبرته أني أنكرت ذلك عليها فقال ‏\"‏ صدقت صدقت ماذا قلت حين فرضت الحج ‏\"‏ ‏.‏ قال قلت اللهم إني أهل بما أهل به رسولك ‏.‏ قال ‏\"‏ فإن معي الهدى فلا تحل ‏\"‏ ‏.‏ قال فكان جماعة الهدى الذي قدم به علي من اليمن والذي أتى به النبي صلى الله عليه وسلم مائة - قال - فحل الناس كلهم وقصروا إلا النبي صلى الله عليه وسلم ومن كان معه هدى فلما كان يوم التروية توجهوا إلى منى فأهلوا بالحج وركب رسول الله صلى الله عليه وسلم فصلى بها الظهر والعصر والمغرب والعشاء والفجر ثم مكث قليلا حتى طلعت الشمس وأمر بقبة من شعر تضرب له بنمرة فسار رسول الله صلى الله عليه وسلم ولا تشك قريش إلا أنه واقف عند المشعر الحرام كما كانت قريش تصنع في الجاهلية فأجاز رسول الله صلى الله عليه وسلم حتى أتى عرفة فوجد القبة قد ضربت له بنمرة فنزل بها حتى إذا زاغت الشمس أمر بالقصواء فرحلت له فأتى بطن الوادي فخطب الناس وقال ‏\"‏ إن دماءكم وأموالكم حرام عليكم كحرمة يومكم هذا في شهركم هذا في بلدكم هذا ألا كل شىء من أمر الجاهلية تحت قدمى موضوع ودماء الجاهلية موضوعة وإن أول دم أضع من دمائنا دم ابن ربيعة بن الحارث كان مسترضعا في بني سعد فقتلته هذيل وربا الجاهلية موضوع وأول ربا أضع ربانا ربا عباس بن عبد المطلب فإنه موضوع كله فاتقوا الله في النساء فإنكم أخذتموهن بأمان الله واستحللتم فروجهن بكلمة الله ولكم عليهن أن لا يوطئن فرشكم أحدا تكرهونه ‏.‏ فإن فعلن ذلك فاضربوهن ضربا غير مبرح ولهن عليكم رزقهن وكسوتهن بالمعروف وقد تركت فيكم ما لن تضلوا بعده إن اعتصمتم به كتاب الله ‏.‏ وأنتم تسألون عني فما أنتم قائلون ‏\"‏ ‏.‏ قالوا نشهد أنك قد بلغت وأديت ونصحت ‏.‏ فقال بإصبعه السبابة يرفعها إلى السماء وينكتها إلى الناس ‏\"‏ اللهم اشهد اللهم اشهد ‏\"‏ ‏.‏ ثلاث مرات ثم أذن ثم أقام فصلى الظهر ثم أقام فصلى العصر ولم يصل بينهما شيئا ثم ركب رسول الله صلى الله عليه وسلم حتى أتى الموقف فجعل بطن ناقته القصواء إلى الصخرات وجعل حبل المشاة بين يديه واستقبل القبلة فلم يزل واقفا حتى غربت الشمس وذهبت الصفرة قليلا حتى غاب القرص وأردف أسامة خلفه ودفع رسول الله صلى الله عليه وسلم وقد شنق للقصواء الزمام حتى إن رأسها ليصيب مورك رحله ويقول بيده اليمنى ‏\"‏ أيها الناس السكينة السكينة ‏\"‏ ‏.‏ كلما أتى حبلا من الحبال أرخى لها قليلا حتى تصعد حتى أتى المزدلفة فصلى بها المغرب والعشاء بأذان واحد وإقامتين ولم يسبح بينهما شيئا ثم اضطجع رسول الله صلى الله عليه وسلم حتى طلع الفجر وصلى الفجر - حين تبين له الصبح - بأذان وإقامة ثم ركب القصواء حتى أتى المشعر الحرام فاستقبل القبلة فدعاه وكبره وهلله ووحده فلم يزل واقفا حتى أسفر جدا فدفع قبل أن تطلع الشمس وأردف الفضل بن عباس وكان رجلا حسن الشعر أبيض وسيما فلما دفع رسول الله صلى الله عليه وسلم مرت به ظعن يجرين فطفق الفضل ينظر إليهن فوضع رسول الله صلى الله عليه وسلم يده على وجه الفضل فحول الفضل وجهه إلى الشق الآخر ينظر فحول رسول الله صلى الله عليه وسلم يده من الشق الآخر على وجه الفضل يصرف وجهه من الشق الآخر ينظر حتى أتى بطن محسر فحرك قليلا ثم سلك الطريق الوسطى التي تخرج على الجمرة الكبرى حتى أتى الجمرة التي عند الشجرة فرماها بسبع حصيات يكبر مع كل حصاة منها مثل حصى الخذف رمى من بطن الوادي ثم انصرف إلى المنحر فنحر ثلاثا وستين بيده ثم أعطى عليا فنحر ما غبر وأشركه في هديه ثم أمر من كل بدنة ببضعة فجعلت في قدر فطبخت فأكلا من لحمها وشربا من مرقها ثم ركب رسول الله صلى الله عليه وسلم فأفاض إلى البيت فصلى بمكة الظهر فأتى بني عبد المطلب يسقون على زمزم فقال ‏\"‏ انزعوا بني عبد المطلب فلولا أن يغلبكم الناس على سقايتكم لنزعت معكم ‏\"‏ ‏.‏ فناولوه دلوا فشرب منه ‏.‏",
      "text_en": " Ja'far b Muhammad reported on the authority of his father:                      We went to Jabir b. Abdullah and he began inquiring about the people (who had gone to see him) till it was my turn. I said: I am Muhammad b. 'Ali b. Husain. He placed his hand upon my head and opened my upper button and then the lower one and then placed his palm on my chest (in order to bless me), and I was, during those days, a young boy, and he said: You are welcome, my nephew. Ask whatever you want to ask. And I asked him but as he was blind (he could not respond to me immediately), and the time for prayer came. He stood up covering himself in his mantle. And whenever he placed its ends upon his shoulders they slipped down on account of being short (in size). Another mantle was, however, lying on the clothes rack near by. And he led us in the prayer. I said to him: Tell me about the Hajj of Allah's Messenger (May peace be upon him). And he pointed with his hand nine, and then stated: The Messenger of Allah (may peace be upon him) stayed in (Medina) for nine years but did not perform Hajj, then he made a public announcement in the tenth year to the effect that Allah's Messenger (may peace be upon him) was about to perform the Hajj. A large number of persons came to Medina and all of them were anxious to follow the Messenger of Allah (May peace be upon him) and do according to his doing. We set out with him till we reached Dhu'l-Hulaifa. Asma' daughter of Umais gave birth to Muhammad b. Abu Bakr. She sent message to the Messenger of Allah (May peace be upon him) asking him: What should 1 do? He (the Holy Prophet) said: Take a bath, bandage your private parts and put on Ihram. The Messenger of Allah (May peace be upon him) then prayed in the mosque and then mounted al-Qaswa (his she-camel) and it stood erect with him on its back at al-Baida'. And I saw as far as I could see in front of me but riders and pedestrians, and also on my right and on my left and behind me like this. And the Messenger of Allah (may peace be upon him) was prominent among us and the (revelation) of the Holy Qur'an was descending upon him. And it is he who knows (its true) significance. And whatever he did, we also did that. He pronounced the Oneness of Allah (saying):\" Labbaik,0 Allah, Labbaik, Labbaik. Thou hast no partner, praise and grace is Thine and the Sovereignty too; Thou hast no partner.\" And the people also pronounced this Talbiya which they pronounce (today). The Messenger of Allah (May peace be upon him) did not reject anything out of it. But the Messenger of Allah (May peace. be upon him) adhered to his own Talbiya. Jabir (Allah be pleased with him) said: We did not have any other intention but that of Hajj only, being unaware of the Umra (at that season), but when we came with him to the House, he touched the pillar and (made seven circuits) running three of them and walking four. And then going to the Station of Ibrahim, he recited:\" And adopt the Station of Ibrahim as a place of prayer.\" And this Station was between him and the House. My father said (and I do not know whether he had made a mention of it but that was from Allah's Apostle [May peace be upon him] that he recited in two rak'ahs:\" say: He is Allah One,\" and say:\" Say: 0 unbelievers.\" He then returned to the pillar (Hajar Aswad) and kissed it. He then went out of the gate to al-Safa' and as he reached near it he recited:\" Al-Safa' and al-Marwa are among the signs appointed by Allah,\" (adding: ) I begin with what Allah (has commanded me) to begin. He first mounted al-Safa' till he saw the House, and facing Qibla he declared the Oneness of Allah and glorified Him, and said:\" There is no god but Allah, One, there is no partner with Him. His is the Sovereignty. to Him praise is due. and He is Powerful over everything. There is no god but Allah alone, Who fulfilled His promise, helped His servant and routed the confederates alone.\" He then made supplication in the course of that saying such words three times. He then descended and walked towards al-Marwa, and when his feet came down in the bottom of the valley, he ran, and when he began to ascend he walked till he reached al-Marwa. There he did as he had done at al-Safa'. And when it was his last running at al-Marwa he said: If I had known beforehand what I have come to know afterwards, I would not have brought sacrificial animals and would have performed an 'Umra. So, he who among you has not the sacrificial animals with him should put off Ihram and treat it as an Umra. Suraqa b. Malik b. Ju'sham got up and said: Messenger of Allah, does it apply to the present year, or does it apply forever? Thereupon the Messenger of Allah (May peace be upon him) intertwined the fingers (of one hand) into another and said twice: The 'Umra has become incorporated in the Hajj (adding):\" No, but for ever and ever.\" 'All came from the Yemen with the sacrificial animals for the Prophet (May peace be upon him) and found Fatimah (Allah be pleased with her) to be one among those who had put off Ihram and had put on dyed clothes and had applied antimony. He (Hadrat'Ali) showed disapproval to it, whereupon she said: My father has commanded me to do this. He (the narrator) said that 'Ali used to say in Iraq: I went to the Messenger of Allah (may peace be upon him) showing annoyance at Fatimah for what she had done, and asked the (verdict) of Allah's Messenger (may peace be upon him) regarding what she had narrated from him, and told him that I was angry with her, whereupon he said: She has told the truth, she has told the truth. (The Holy Prophet then asked 'Ali): What did you say when you undertook to go for Hajj? I ('Ali) said: 0 Allah, I am putting on Ihram for the same purpose as Thy Messenger has put it on. He said: I have with me sacrificial animals, so do not put off the Ihram. He (Jabir) said: The total number of those sacrificial animals brought by 'Ali from the Yemen and of those brought by the Apostle (may peace be upon him) was one hundred. Then all the people except the Apostle (may peace be upon him) and those who had with them sacrificial animals, put off Ihram, and got their hair clipped; when it was the day of Tarwiya (8th of Dhu'l-Hijja) they went to Mina and put on the Ihram for Hajj and the Messenger of Ailah (may peace be upon him) rode and led the noon, afternoon, sunset 'Isha' and dawn prayers. He then waited a little till the sun rose, and commanded that a tent of hair should be pitched at Namira. The Messenger of Allah (may peace be upon him) then set out and the Quraish did not doubt that he would halt at al-Mash'ar al-Haram (the sacred site) as the Quraish used to do in the pre-Islamic period. The Messenger of Allah (may peace be upon him), however, passed on till he came to 'Arafa and he found that the tent had been pitched for him at Namira. There he got down till the sun had passed the meridian; he commanded that al-Qaswa should be brought and saddled for him. Then he came to the bottom of the valley, and addressed the people saying: Verily your blood, your property are as sacred and inviolable as the sacredness of this day of yours, in this month of yours, in this town of yours. Behold! Everything pertaining to the Days of Ignorance is under my feet completely abolished. Abolished are also the blood-revenges of the Days of Ignorance. The first claim of ours on blood-revenge which I abolish is that of the son of Rabi'a b. al-Harith, who was nursed among the tribe of Sa'd and killed by Hudhail. And the usury of she pre-Islamic period is abolished, and the first of our usury I abolish is that of 'Abbas b. 'Abd al-Muttalib, for it is all abolished. Fear Allah concerning women! Verily you have taken them on the security of Allah, and intercourse with them has been made lawful unto you by words of Allah. You too have right over them, and that they should not allow anyone to sit on your bed whom you do not like. But if they do that, you can chastise them but not severely. Their rights upon you are that you should provide them with food and clothing in a fitting manner. I have left among you the Book of Allah, and if you hold fast to it, you would never go astray. And you would be asked about me (on the Day of Resurrection), (now tell me) what would you say? They (the audience) said: We will bear witness that you have conveyed (the message), discharged (the ministry of Prophethood) and given wise (sincere) counsel. He (the narrator) said: He (the Holy Prophet) then raised his forefinger towards the sky and pointing it at the people (said):\" O Allah, be witness. 0 Allah, be witness,\" saying it thrice. (Bilal then) pronounced Adhan and later on Iqama and he (the Holy Prophet) led the noon prayer. He (Bilal) then uttered Iqama and he (the Holy Prophet) led the afternoon prayer and he observed no other prayer in between the two. The Messenger of Allah (may peace be upon him) then mounted his camel and came to the place of stay, making his she-camel al-Qaswa, turn towards the side where there we are rocks, having the path taken by those who went on foot in front of him, and faced the Qibla. He kept standing there till the sun set, and the yellow light had somewhat gone, and the disc of the sun had disappeared. He made Usama sit behind him, and he pulled the nosestring of Qaswa so forcefully that its head touched the saddle (in order to keep her under perfect control), and he pointed out to the people with his right hand to be moderate (in speed), and whenever he happened to pass over an elevated tract of sand, he slightly loosened it (the nose-string of his camel) till she climbed up and this is how he reached al-Muzdalifa. There he led the evening and 'Isha prayers with one Adhan and two Iqamas and did not glorify (Allah) in between them (i. e. he did not observe supererogatory rak'ahs between Maghrib and 'Isha' prayers). The Messenger of Allah (may peace be upon him) then lay down till dawn and offered the dawn prayer with an Adhan and Iqama when the morning light was clear. He again mounted al-Qaswa, and when he came to al-Mash'ar al-Haram, he faced towards Qibla, supplicated Him, Glorified Him, and pronounced His Uniqueness (La ilaha illa Allah) and Oneness, and kept standing till the daylight was very clear. He then went quickly before the sun rose, and seated behind him was al-Fadl b. 'Abbas and he was a man having beautiful hair and fair complexion and handsome face. As the Messenger of Allah (May peace be upon him) was moving on, there was also going a group of women (side by side with them). Al-Fadl began to look at them. The Messenger of Allah (may peace be upon him) placed his hand on the face of Fadl who then turned his face to the other side, and began to see, and the Messenger of Allah (may peace be upon him) turned his hand to the other side and placed it on the face of al-Fadl. He again turned his face to the other side till he came to the bottom of Muhassir. 1680 He urged her (al-Qaswa) a little, and, following the middle road, which comes out at the greatest jamra, he came to the jamra which is near the tree. At this be threw seven small pebbles, saying Allah-o-Akbar while throwing every one of them in a manner in which the small pebbles are thrown (with the help of fingers) and this he did in the bottom of the valley. He then went to the place of sacrifice, and sacrificed sixty-three (camels) with his own hand. Then he gave the remaining number to 'All who sacrificed them, and he shared him in his sacrifice. He then commanded that a piece of flesh from each animal sacrificed should be put in a pot, and when it was cooked, both of them (the Holy Prophet and Hadrat 'All) took some meat out of it and drank its soup. The Messenger of Allah (May peace be upon him) again rode and came to the House, and offered the Zuhr prayer at Mecca. He came to the tribe of Abd al-Muttalib, who were supplying water at Zamzam, and said: Draw water. O Bani 'Abd al-Muttalib; were it not that people would usurp this right of supplying water from you, I would have drawn it along with you. So they handed him a basket and he drank from it.",
      "chain": [
        "30201",
        "30123",
        "20159",
        "20436",
        "20159",
        "10898",
        "11442"
      ]
    },
    {
      "hadith_no": "3124",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وابن، نمير جميعا عن أبي خالد، - قال أبو بكر حدثنا أبو خالد الأحمر، - عن عبيد الله، عن نافع، قال رأيت ابن عمر يستلم الحجر بيده ثم قبل يده وقال ما تركته منذ رأيت رسول الله صلى الله عليه وسلم يفعله ‏.‏",
      "text_en": " NAfi' (Allah be pleased with him) reported:                      I saw'lbn 'Umar (Allah be pleased with them) touching the Stone with his hand and then kissing his hand. and he said: I have never abandoned it since I saw Allah's Messenger (way peace be upon him) doing It.",
      "chain": [
        "30201",
        "20436",
        "20326",
        "11201",
        "11014"
      ]
    },
    {
      "hadith_no": "3130",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، جميعا عن وكيع، - قال أبو بكر حدثنا وكيع، - عن سفيان، عن إبراهيم بن عبد الأعلى، عن سويد بن غفلة، قال رأيت عمر قبل الحجر والتزمه وقال رأيت رسول الله صلى الله عليه وسلم بك حفيا ‏.‏",
      "text_en": "  Suwaid b. Ghafala reported:                      I saw Umar (Allah be pleased with him) kissing the Stone and clinging to it and saying: I saw Allah's Messenger (may peace be upon him) having great love for you.",
      "chain": [
        "30201",
        "30022",
        "20032",
        "20436",
        "20032",
        "20012",
        "11174"
      ]
    },
    {
      "hadith_no": "3221",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، وزهير بن حرب، قال أبو بكر حدثنا ابن عيينة، عن الزهري، عن عيسى بن طلحة، عن عبد الله بن عمرو، قال أتى النبي صلى الله عليه وسلم رجل فقال حلقت قبل أن أذبح ‏.‏ قال ‏\"‏ فاذبح ولا حرج ‏\"‏ ‏.‏ قال ذبحت قبل أن أرمي ‏.‏ قال ‏\"‏ ارم ولا حرج ‏\"‏ ‏.‏",
      "text_en": " Adullah b. 'Amr (b. al-'As) (Allah be pleased with him) reported that a person came to Allah's Apostle (may peace be upon him) and said:                      I got (my head) shaved before sacrificing the, animal, whereupon be (the Holy Prophet) said: Sacrifice the animal (now) ; there is no harm in it. He (the person said): I sacripced the animal before throwingpebbles. whereupon he said: Throw pebbles (now) ; there is no harm in it.",
      "chain": [
        "30201",
        "30022",
        "20436",
        "20005",
        "11013",
        "10573",
        "29"
      ]
    },
    {
      "hadith_no": "3231",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، عن الزهري، عن سالم، أن أبا بكر، وعمر، وابن، عمر كانوا ينزلون الأبطح ‏.‏ قال الزهري وأخبرني عروة، عن عائشة، أنها لم تكن تفعل ذلك وقالت إنما نزله رسول الله صلى الله عليه وسلم لأنه كان منزلا أسمح لخروجه ‏.‏",
      "text_en": " Salim reported that Abu Bakr, 'Umar and Ibn Umar used to halt at Abtah. 'Urwa narrated from 'A'isha (Allah be pleased with her) that he did not observe this practice and said:                      Allah's Messenger (may peace be upon him) halted there, for it is a place from where it was easy to depart.",
      "chain": [
        "30553",
        "20121",
        "20115",
        "11013",
        "11011",
        "20436",
        "3",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3317",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، وابن أبي عمر، جميعا عن ابن، عيينة - قال أبو بكر حدثنا سفيان بن عيينة، - عن إبراهيم بن عقبة، عن كريب، مولى ابن عباس عن ابن عباس، عن النبي صلى الله عليه وسلم لقي ركبا بالروحاء فقال ‏\"‏ من القوم ‏\"‏ ‏.‏ قالوا المسلمون ‏.‏ فقالوا من أنت قال ‏\"‏ رسول الله ‏\"‏ ‏.‏ فرفعت إليه امرأة صبيا فقالت ألهذا حج قال ‏\"‏ نعم ولك أجر ‏\"‏ ‏.‏",
      "text_en": " Ibn Abbas reported that Allah's Apostle (may peace be upon him) met some riders at al-Rauha and asked who they were. They replied that they were Muslims. They said:                      Who art thou? He said: (I am) Messengef of Allah. A woman (then) lifted up a boy to him and said: Would this child be credited with having performed the Hajj? Thereupon he said: Yes, and you will have a reward.",
      "chain": [
        "30201",
        "30022",
        "30421",
        "20005",
        "20436",
        "20005",
        "11125",
        "11211",
        "17"
      ]
    },
    {
      "hadith_no": "3336",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، كلاهما عن سفيان، - قال أبو بكر حدثنا سفيان بن عيينة، - حدثنا عمرو بن دينار، عن أبي معبد، قال سمعت ابن عباس، يقول سمعت النبي صلى الله عليه وسلم يخطب يقول ‏\"‏ لا يخلون رجل بامرأة إلا ومعها ذو محرم ولا تسافر المرأة إلا مع ذي محرم ‏\"‏ ‏.‏ فقام رجل فقال يا رسول الله إن امرأتي خرجت حاجة وإني اكتتبت في غزوة كذا وكذا ‏.‏ قال ‏\"‏ انطلق فحج مع امرأتك ‏\"‏ ‏.‏",
      "text_en": " Ibn 'Abbas (Allah be pleased with them) reported:                      I heard Allah's Messenger (may peace be upon him) delivering a sermon and making this observation:\" No person should be alone with a woman except when there is a Mahram with her, and the woman should not undertake journey except with a Mahram.\" A person stood up and said: Allah's Messenger, my wife has set out for pilgrimage, whereas I am enlisted to fight in such and such battle, whereupon he said:\" You go and perform Hajj with your wife.\"",
      "chain": [
        "30201",
        "30022",
        "20005",
        "20436",
        "20005",
        "11081",
        "13127",
        "17"
      ]
    },
    {
      "hadith_no": "3383",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، كلاهما عن أبي أحمد، - قال أبو بكر حدثنا محمد بن عبد الله الأسدي، - حدثنا سفيان، عن أبي الزبير، عن جابر، قال قال النبي صلى الله عليه وسلم ‏\"‏ إن إبراهيم حرم مكة وإني حرمت المدينة ما بين لابتيها لا يقطع عضاهها ولا يصاد صيدها ‏\"‏ ‏.‏",
      "text_en": " Jabir (Allah be pleased with him) reported Allah's Apostle (may peace be upon him) as saying:                      Ibrahim declared Mecca as sacred; I declare Medina, that between the two mountains, as inviolable. No tree should be lopped and no game is to be molested.",
      "chain": [
        "30201",
        "20436",
        "20012",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3454",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وسعيد بن عمرو الأشعثي، قال سعيد أخبرنا وقال أبو بكر، حدثنا حاتم بن إسماعيل، عن حميد، عن أبي سلمة، عن أبي سعيد، عن النبي صلى الله عليه وسلم بمثله ولم يذكر عبد الرحمن بن أبي سعيد في الإسناد ‏.‏",
      "text_en": " Abu Sa'id reported from Allah's Apostle (may peace be upon him) a hadlth like this, but in the chain of transmitters no mention was made of Abd al- Rahman b. Abu Sa'id.",
      "chain": [
        "30201",
        "30465",
        "11168",
        "20436",
        "20159",
        "11279",
        "10567",
        "38"
      ]
    },
    {
      "hadith_no": "3632",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "17",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، قال إسحاق أخبرنا وقال، أبو بكر حدثنا سفيان، عن عمرو، عن عطاء، عن جابر، قال كنا نعزل والقرآن ينزل ‏.‏ زاد إسحاق قال سفيان لو كان شيئا ينهى عنه لنهانا عنه القرآن.",
      "text_en": " Jabir (Allah be pleased with him) reported:                      We used to practise 'azl while the Qur'an was revealed (during the days when the Holy Prophet was alive).",
      "chain": [
        "30201",
        "30123",
        "30312",
        "20436",
        "20012",
        "11081",
        "11029",
        "34"
      ]
    },
    {
      "hadith_no": "3788",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "19",
      "text_ar": "وحدثنا عبيد الله بن معاذ العنبري، حدثنا أبي، حدثنا شعبة، حدثني أبو بكر، قال دخلت أنا وأبو سلمة على فاطمة بنت قيس زمن ابن الزبير فحدثتنا أن زوجها طلقها طلاقا باتا ‏.‏ بنحو حديث سفيان ‏.‏",
      "text_en": " Abu Bakr reported:                      I and Abu Salama came to Fatima bint Qais (Allah be pleased with her) during the time of Ibn Zubair (Allah be pleased with him) and she narrated to us that her husband gave her an irrevocable divorce. (The rest of the hadith is the same.)",
      "chain": [
        "30150",
        "20286",
        "20020",
        "20436"
      ]
    },
    {
      "hadith_no": "4066",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Masaaqah - كتاب المساقاة",
      "chapter_no": "23",
      "text_ar": "وحدثني غير، واحد، من أصحابنا قالوا حدثنا إسماعيل بن أبي أويس، حدثني أخي، عن سليمان، - وهو ابن بلال - عن يحيى بن سعيد، عن أبي الرجال، محمد بن عبد الرحمن أن أمه، عمرة بنت عبد الرحمن قالت سمعت عائشة، تقول سمع رسول الله صلى الله عليه وسلم صوت خصوم بالباب عالية أصواتهما وإذا أحدهما يستوضع الآخر ويسترفقه في شىء وهو يقول والله لا أفعل ‏.‏ فخرج رسول الله صلى الله عليه وسلم عليهما فقال ‏\"‏ أين المتألي على الله لا يفعل المعروف ‏\"‏ ‏.‏ قال أنا يا رسول الله فله أى ذلك أحب ‏.‏",
      "text_en": " A'isha (Allah be pleased with her) reported:                      Allah's Messenger (may peace be upon him) heard the voices of altercation of two disputants at the door; both the voices were quite loud. The one demanded some remission and desired that the other one should show leniency to him, whereupon the (other one) was saying: By Allah will not do that. Then there came Allah's Messenger (may peace be upon him) to them and said: Where is he who swears by Allah that he would not do good? He said: Massenger of Allah, it is I. He may do as he desires.",
      "chain": [
        "30103",
        "20436",
        "20160",
        "11062",
        "10959",
        "11455"
      ]
    },
    {
      "hadith_no": "4286",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Gifts - كتاب الهبات",
      "chapter_no": "25",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، - واللفظ لأبي بكر قال إسحاق أخبرنا وقال أبو بكر، حدثنا سفيان بن عيينة، عن عمرو، عن سليمان بن يسار، أن طارقا، قضى بالعمرى للوارث لقول جابر بن عبد الله عن رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Sulaiman b. Yasir reported that Jabir gave this verdict. The inheritor has a right (to inherit) the life grant according to the statement of Jabir (b. 'Abdullah) (Allah be pleased with him) which he narrated from Allah's Messenger (may peace be upon him).",
      "chain": [
        "30201",
        "30123",
        "30312",
        "20436",
        "20005",
        "11081",
        "11005"
      ]
    },
    {
      "hadith_no": "4429",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Oaths - كتاب الأيمان",
      "chapter_no": "28",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، عن ابن عيينة، قال أبو بكر حدثنا سفيان بن عيينة، قال سمع عمرو، جابرا يقول دبر رجل من الأنصار غلاما له لم يكن له مال غيره فباعه رسول الله صلى الله عليه وسلم ‏.‏ قال جابر فاشتراه ابن النحام عبدا قبطيا مات عام أول في إمارة ابن الزبير ‏.‏",
      "text_en": " Jabir is reported to have said:                      A person amongst the Ansar who had no other property declared a slave free after his death. Allah's Messenger (may peace be upon him) sold him, and Ibn al-Nahham bought him and he was a Coptic slave (who) died in the first year of the Caliphate of Ibn Zubair.",
      "chain": [
        "30201",
        "30123",
        "20005",
        "20436",
        "20005"
      ]
    },
    {
      "hadith_no": "4695",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Jihad and Expedition - كتاب الجهاد والسير",
      "chapter_no": "33",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، وابن، بشار - وألفاظهم متقاربة - قال أبو بكر حدثنا غندر، عن شعبة، وقال الآخران، حدثنا محمد بن جعفر، حدثنا شعبة، - عن سعد بن إبراهيم، قال سمعت أبا أمامة بن سهل بن حنيف، قال سمعت أبا سعيد، الخدري قال نزل أهل قريظة على حكم سعد بن معاذ فأرسل رسول الله صلى الله عليه وسلم إلى سعد فأتاه على حمار فلما دنا قريبا من المسجد قال رسول الله صلى الله عليه وسلم للأنصار ‏\"‏ قوموا إلى سيدكم - أو خيركم ‏\"‏ ‏.‏ ثم قال ‏\"‏ إن هؤلاء نزلوا على حكمك ‏\"‏ ‏.‏ قال تقتل مقاتلتهم وتسبي ذريتهم ‏.‏ قال فقال النبي صلى الله عليه وسلم ‏\"‏ قضيت بحكم الله - وربما قال - قضيت بحكم الملك ‏\"‏ ‏.‏ ولم يذكر ابن المثنى وربما قال ‏\"‏ قضيت بحكم الملك ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Sa'id al-Khudri who said:                      The people of Quraiza surrendered accepting the decision of Sa'd b. Mu'adh about them. Accordingly, the Messenger of Allah (may peace be upon him) sent for Sa'd who came to him riding a donkey. When he approached the mosque, the Messenger of Allah (may peace be upon him) said to the Ansar: Stand up to receive your chieftain. Then he said (to Sa'd): These people have surrendered accepting your decision. He (Sa'd) said: You will kill their fighters and capture their women and children. (Hearing this), the Propbot (may peace he tpon him) said: You have adjudged by the command of God. The narrator is reported to have said: Perhaps he said: You have adjuged by the decision of a king. Ibn Muthanna (in his version of the tradition) has not mentioned the alternative words.",
      "chain": [
        "30201",
        "30170",
        "20436",
        "20278",
        "20020",
        "20173",
        "20020",
        "11063",
        "405",
        "38"
      ]
    },
    {
      "hadith_no": "5148",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Games and the Animals which May be Slaughtered and the Aninals that Are to be Eaten - كتاب الصيد والذبائح وما يؤكل من الحيوان",
      "chapter_no": "35",
      "text_ar": "وحدثني أبو بكر بن النضر، وعبد بن حميد، قال عبد أخبرني وقال أبو بكر، حدثنا  يعقوب بن إبراهيم بن سعد، حدثنا أبي، عن صالح بن كيسان، عن ابن شهاب، عن أبي، أمامة بن سهل عن ابن عباس، أنه أخبره أن خالد بن الوليد أخبره أنه، دخل مع رسول الله صلى الله عليه وسلم على ميمونة بنت الحارث وهى خالته فقدم إلى رسول الله صلى الله عليه وسلم لحم ضب جاءت به أم حفيد بنت الحارث من نجد وكانت تحت رجل من بني جعفر وكان رسول الله صلى الله عليه وسلم لا يأكل شيئا حتى يعلم ما هو ‏.‏ ثم ذكر بمثل حديث يونس وزاد في آخر الحديث وحدثه ابن الأصم عن ميمونة وكان في حجرها ‏.‏",
      "text_en": " Khalid b. Walid reported that he visited Maimuna daughter of al-Harith with the Messenger of Allah (may peace be upon him), and she was the sister of his mother. She presented to Allah's Messenger (may peace be upon him) the flesh of a lizard which Umm Hufaid daughter of al-Harith had brought from Najd, and she had been married to a person belonging to Banu Ja'far. It was the habit of Allah's Messenger (may peace be upon him) not to eat anything until he knew what that was. The rest of the hadith is the same but with this (addition):                     \" Ibn al-Asamm narrated it from Maimuna and he was under her care.\"",
      "chain": [
        "14443",
        "30553",
        "20436",
        "20184",
        "20150",
        "11176",
        "11013",
        "405",
        "17",
        "22"
      ]
    },
    {
      "hadith_no": "5227",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Sacrifices - كتاب الأضاحى",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، قالا حدثنا محمد بن فضيل، قال أبو بكر عن أبي سنان، وقال ابن المثنى، عن ضرار بن مرة، عن محارب، عن ابن بريدة، عن أبيه، ح",
      "text_en": "",
      "chain": [
        "30201",
        "30170",
        "20356",
        "20436",
        "11389",
        "11432"
      ]
    },
    {
      "hadith_no": "5324",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، ومحمد بن المثنى، قالا حدثنا محمد بن فضيل، قال أبو بكر عن أبي سنان، وقال ابن المثنى، عن ضرار بن مرة، عن محارب، عن ابن بريدة، عن أبيه، ح",
      "text_en": "",
      "chain": [
        "30201",
        "30170",
        "20356",
        "20436",
        "11389",
        "11432"
      ]
    },
    {
      "hadith_no": "5354",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثني محمد بن سهل التميمي، وأبو بكر بن إسحاق - قال أبو بكر أخبرنا  وقال ابن سهل، حدثنا - ابن أبي مريم، أخبرنا محمد، - وهو ابن مطرف أبو غسان - أخبرني أبو حازم، عن سهل بن سعد، قال ذكر لرسول الله صلى الله عليه وسلم امرأة من العرب فأمر أبا أسيد أن يرسل إليها فأرسل إليها فقدمت فنزلت في أجم بني ساعدة فخرج رسول الله صلى الله عليه وسلم حتى جاءها فدخل عليها فإذا امرأة منكسة رأسها فلما كلمها رسول الله صلى الله عليه وسلم قالت أعوذ بالله منك قال ‏\"‏ قد أعذتك مني ‏\"‏ ‏.‏ فقالوا لها أتدرين من هذا فقالت لا ‏.‏ فقالوا هذا رسول الله صلى الله عليه وسلم جاءك ليخطبك قالت أنا كنت أشقى من ذلك ‏.‏ قال سهل فأقبل رسول الله صلى الله عليه وسلم يومئذ حتى جلس في سقيفة بني ساعدة هو وأصحابه ثم قال ‏\"‏ اسقنا ‏\"‏ ‏.‏ لسهل قال فأخرجت لهم هذا القدح فأسقيتهم فيه ‏.‏ قال أبو حازم فأخرج لنا سهل ذلك القدح فشربنا فيه قال ثم استوهبه بعد ذلك عمر بن عبد العزيز فوهبه له ‏.‏ وفي رواية أبي بكر بن إسحاق قال ‏\"‏ اسقنا يا سهل ‏\"‏ ‏.‏",
      "text_en": " Sahl b. Sa'd reported:                      An Arab woman was mentioned before Allah's Messenger (may peace be upon him). He commanded Abu Usaid to send a message to her and he (accordingly) sent a message to her. She came and stayed in the fortresses of Banu Sa'idah. Allah's Messenger (may peace be upon him) went out until he came to her while she was (at that time) sitting with her head downcast. When Allah's Messenger (may peace be upon him) talked to her, she said: I seek refuge with Allah from you. Thereupon he said: I (have decided to) keep you away from me. They (the people near her) said: Do you know who he is? She said: No. They said: He is the Messenger of Allah (may peace be upon him). He came to you in order to give you the proposal of marriage. She said: Then I am the most unfortunate woman because of this (i. e. my defiance). Sahl said: Allah's. Messenger (may peace be upon him) then set forth on that day until he sat in the Saqifa of Banu Sa'idah along with his Companions. He then said to Sahl: Serve us drink. He (Sahl) said: I brought out for them this bowl (containing drink) and served them this. Abu Hazim said: Sahl brought out this cup for us and we also drank from that. Then 'Umar b. 'Abd al-'Aziz asked him to give that (cup) as a gift to him and he gave (it to) him as a gift. In the narration of Abu Bakr b. Ishaq (the words) are:\" Sahl, serve us drink.\"",
      "chain": [
        "11108",
        "20436",
        "30232",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "5388",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وابن أبي عمر، جميعا عن سفيان، قال أبو بكر حدثنا سفيان بن عيينة، عن الوليد بن كثير، عن وهب بن كيسان، سمعه من، عمر بن أبي سلمة قال كنت في حجر رسول الله صلى الله عليه وسلم وكانت يدي تطيش في الصحفة فقال لي ‏\"‏ يا غلام سم الله وكل بيمينك وكل مما يليك ‏\"‏ ‏.‏",
      "text_en": " 'Umar b. Abu Salama reported:                      I was under the care of Allah's Messenger (way peace be upon him), and as my hand used to roam about in the dish he said to me: Boy, mention the name of Allah, and eat with your right hand and eat from what is near to you.",
      "chain": [
        "30201",
        "30421",
        "20005",
        "20436",
        "20005",
        "11230",
        "11231"
      ]
    },
    {
      "hadith_no": "5452",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو سعيد الأشج كلاهما عن حفص، قال أبو بكر حدثنا حفص بن غياث، عن مصعب بن سليم، حدثنا أنس بن مالك، قال رأيت النبي صلى الله عليه وسلم مقعيا يأكل تمرا ‏.‏",
      "text_en": " Anas b. Malik reported:                      I saw Allah's Apostle (may peace be upon him) squatting and eating dates.",
      "chain": [
        "30201",
        "30200",
        "20436",
        "20317",
        "10827",
        "19"
      ]
    },
    {
      "hadith_no": "5690",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "حدثنا محمد بن المثنى، وابن، بشار قالا حدثنا أبو داود، حدثنا شعبة، ح وحدثنا  أبو بكر بن أبي شيبة، - واللفظ له - حدثنا يحيى بن أبي بكير، عن شعبة، عن عمرو بن، مرة قال سمعت الحسن بن مسلم، يحدث عن صفية بنت شيبة، عن عائشة، أن جارية، من الأنصار تزوجت وأنها مرضت فتمرط شعرها فأرادوا أن يصلوه فسألوا رسول الله صلى الله عليه وسلم عن ذلك فلعن الواصلة والمستوصلة ‏.‏",
      "text_en": " A'isha reported that a girl of the Ansar who had fallen ill and had lost the hair was married. They (her relatives) thought of adding false hair (to her head). so they asked Allah's Messenger (may peace be upon him) about it, whereupon he cursed the woman who adds false hair and the woman who asks for it.",
      "chain": [
        "30170",
        "30160",
        "30002",
        "20020",
        "20436",
        "20365",
        "20020",
        "11381",
        "11557",
        "2802",
        "53"
      ]
    },
    {
      "hadith_no": "5722",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة قال أبو بكر حدثنا معتمر بن، سليمان عن الركين، عن أبيه، عن سمرة، وقال، يحيى أخبرنا المعتمر بن سليمان، قال سمعت  الركين، يحدث عن أبيه، عن سمرة بن جندب، قال نهانا رسول الله صلى الله عليه وسلم أن نسمي رقيقنا بأربعة أسماء أفلح ورباح ويسار ونافع ‏.‏",
      "text_en": " Samura b. Jundub reported:                      Allah's Messenger (may peace be upon him) forbade us to give names to our servants as these four names: Aflah (Successful), Rabdh (Profit), Yasar (Wealth), and Nafi' (Beneficial).",
      "chain": [
        "30399",
        "30201",
        "20436",
        "20288",
        "11289",
        "394",
        "20031",
        "20288",
        "11289",
        "394"
      ]
    },
    {
      "hadith_no": "5762",
      "source": " Sahih Muslim ",
      "chapter": "The Book on General Behaviour - كتاب الآداب",
      "chapter_no": "39",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة - واللفظ لأبي بكر - قال يحيى أخبرنا وقال أبو بكر، حدثنا - وكيع، عن شعبة، عن محمد بن المنكدر، عن جابر بن عبد، الله قال استأذنت على النبي صلى الله عليه وسلم فقال ‏\"‏ من هذا ‏\"‏ ‏.‏ فقلت أنا ‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ أنا أنا ‏\"‏ ‏.‏",
      "text_en": " Jabir b. Abdullah reported:                      I sought permission from Allah's Messenger (may peace be upoh him) to see him. He said: Who is it? I said: It is I. Thereupon Allah's Messenger (may peace be upon him) said: It is I. it is I (these words lead me to no conclusion).",
      "chain": [
        "30399",
        "20031",
        "20436",
        "20032",
        "20020",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "5849",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب وإسحاق بن إبراهيم - قال إسحاق أخبرنا وقال أبو بكر، وأبو كريب - واللفظ لهما - حدثنا محمد بن بشر، عن مسعر، حدثنا  معبد بن خالد، عن ابن شداد، عن عائشة، أن رسول الله صلى الله عليه وسلم كان يأمرها أن تسترقي من العين ‏.‏",
      "text_en": " 'A'isha reported that Allah's Messenger (may peace be upon him) commanded the use of incantation for curing the influence of an evil eye.",
      "chain": [
        "30201",
        "30312",
        "20436",
        "20352",
        "20359",
        "11396",
        "53"
      ]
    },
    {
      "hadith_no": "5875",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "حدثنا يحيى بن يحيى، و أبو بكر بن أبي شيبة وأبو كريب قال يحيى - واللفظ له - أخبرنا وقال الآخران، حدثنا أبو معاوية، عن الأعمش، عن أبي سفيان، عن جابر، قال بعث رسول الله صلى الله عليه وسلم إلى أبى بن كعب طبيبا فقطع منه عرقا ثم كواه عليه ‏.‏",
      "text_en": " Jabir reported that Allah's Messenger (may peace be upon him) sent a phystian to Ubayy b. Ka'b. He cut the vein and then cauterised it.",
      "chain": [
        "30399",
        "20436",
        "20354",
        "11060",
        "116",
        "34"
      ]
    },
    {
      "hadith_no": "5880",
      "source": " Sahih Muslim ",
      "chapter": "The Book on Salutations and Greetings - كتاب السلام",
      "chapter_no": "40",
      "text_ar": "وحدثناه أبو بكر بن أبي شيبة، وأبو كريب قال أبو بكر حدثنا وكيع، وقال، أبو كريب - واللفظ له - أخبرنا وكيع، عن مسعر، عن عمرو بن عامر الأنصاري، قال سمعت أنس بن مالك، يقول احتجم رسول الله صلى الله عليه وسلم وكان لا يظلم أحدا أجره ‏.‏",
      "text_en": " Anas b. Malik reported that Allah's Messenger (may peace be upon him) got himself cupped and never withheld the wages of anyone.",
      "chain": [
        "30201",
        "30216",
        "20436",
        "20032",
        "20032",
        "20359",
        "15406",
        "19"
      ]
    },
    {
      "hadith_no": "6020",
      "source": " Sahih Muslim ",
      "chapter": "The Book Concerning the Use of Correct Words - كتاب الألفاظ من الأدب وغيرها",
      "chapter_no": "41",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، كلاهما عن المقرئ، قال أبو بكر حدثنا أبو عبد الرحمن المقرئ، عن سعيد بن أبي أيوب، حدثني عبيد الله بن أبي جعفر، عن عبد الرحمن الأعرج، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من عرض عليه ريحان فلا يرده فإنه خفيف المحمل طيب الريح ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      He who is presented with a flower should not reject it, for it is light to carry and pleasant in odour.",
      "chain": [
        "30201",
        "30022",
        "20436",
        "20375",
        "11409",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "6187",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا مجاهد بن موسى، وأبو بكر بن النضر بن أبي النضر وهارون بن عبد الله جميعا عن أبي النضر، قال أبو بكر حدثنا أبو النضر، - يعني هاشم بن القاسم - حدثنا سليمان بن المغيرة، عن ثابت، عن أنس بن مالك، قال كان رسول الله صلى الله عليه وسلم إذا صلى الغداة جاء خدم المدينة بآنيتهم فيها الماء فما يؤتى بإناء إلا غمس يده فيها فربما جاءوه في الغداة الباردة فيغمس يده فيها ‏.‏",
      "text_en": " Anas b. Malik reported that when Allah's Messenger (may peace be upon him) had completed his dawn prayer, the servants of Medina came to him with utensils containing water, and no utensil was brought in which he did not dip his hand; and sometime they came in the cold dawn (and he did not feel reluctant in acceding to their request even in the cold weather) and dipped his hand in them.",
      "chain": [
        "30521",
        "30283",
        "20436",
        "20390",
        "20236",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "6277",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Excellent Qualities of the Holy Prophet (may Peace be upon them) and His - كتاب الفضائل",
      "chapter_no": "44",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعمرو الناقد، كلاهما عن الأسود بن عامر، - قال أبو بكر حدثنا أسود بن عامر، - حدثنا حماد بن سلمة، عن هشام بن عروة، عن  أبيه، عن عائشة، وعن ثابت، عن أنس، أن النبي صلى الله عليه وسلم مر بقوم يلقحون فقال ‏\"‏ لو لم تفعلوا لصلح ‏\"‏ ‏.‏ قال فخرج شيصا فمر بهم فقال ‏\"‏ ما لنخلكم ‏\"‏ ‏.‏ قالوا قلت كذا وكذا قال ‏\"‏ أنتم أعلم بأمر دنياكم ‏\"‏ ‏.‏",
      "text_en": " Anas reported that Allah's Messenger (may peace be upon him) happened to pass by the people who had been busy in grafting the trees. Thereupon he said:                      If you were not to do it, it might be good for you. (So they abandoned this practice) and there was a decline in the yield. He (the Holy Prophet) happened to pass by them (and said): What has gone wrong with your trees? They said: You said so and so. Thereupon he said: You have better knowledge (of a technical skill) in the affairs of the world.",
      "chain": [
        "30201",
        "20380",
        "20436",
        "20380",
        "20021",
        "11065",
        "10511",
        "53",
        "11269",
        "19"
      ]
    },
    {
      "hadith_no": "6421",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة - واللفظ ليحيى - قال أبو بكر حدثنا وقال، يحيى أخبرنا أبو معاوية، عن عاصم الأحول، عن مورق العجلي، عن عبد، الله بن جعفر قال كان رسول الله صلى الله عليه وسلم إذا قدم من سفر تلقي بصبيان أهل بيته - قال - وإنه قدم من سفر فسبق بي إليه فحملني بين يديه ثم جيء بأحد ابنى فاطمة فأردفه خلفه - قال - فأدخلنا المدينة ثلاثة على دابة ‏.‏",
      "text_en": " Abdullah b. Ja'far reported that when Allah's Messenger (may peace be, upon him) came back from a journey, the children of his family used to accord him welcome. It was in this way that once he came back from a journey and I went to him first of all. He mounted me before him. Then there came one of the two sons of Fatima and he mounted him behind him and this is how we three entered Medina riding on a beast.",
      "chain": [
        "30399",
        "20436",
        "20031",
        "20354",
        "11080",
        "11308",
        "108"
      ]
    },
    {
      "hadith_no": "6472",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا زهير بن حرب، أخبرني عمرو بن عاصم الكلابي، حدثنا سليمان بن المغيرة، عن ثابت، عن أنس، قال قال أبو بكر رضى الله عنه بعد وفاة رسول الله صلى الله عليه وسلم لعمر انطلق بنا إلى أم أيمن نزورها كما كان رسول الله صلى الله عليه وسلم يزورها ‏.‏ فلما انتهينا إليها بكت فقالا لها ما يبكيك ما عند الله خير لرسوله صلى الله عليه وسلم ‏.‏ فقالت ما أبكي أن لا أكون أعلم أن ما عند الله خير لرسوله صلى الله عليه وسلم ولكن أبكي أن الوحى قد انقطع من السماء ‏.‏ فهيجتهما على البكاء فجعلا يبكيان معها ‏.‏",
      "text_en": " Anas reported that after the death of Allah's Messenger (may peace be upon him) Abu Bakr said to 'Umar:                      Let us visit Umm Aiman as Allah's Messenger (may peace be upon him) used to visit her. As we came to her, she wept. They (Abu Bakr and Umar) said to her: What makes you weep? What is in store (in the next world) for Allah's-Messenger (may peace be upon him) is better than (this worldly life). She said: I weep not because I am ignorant of the fact that what is in store for Allah's Messenger (may peace be upon him) (in the next world) is better than (this world), but I weep because the revelation which came from the Heaven has ceased to come. This moved both of them to tears and they began to weep along with her.",
      "chain": [
        "30022",
        "20267",
        "20236",
        "11269",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "6629",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Merits of the Companions (Allah Be Pleased With Them) of the Holy Prophet - كتاب فضائل الصحابة رضى الله تعالى عنهم",
      "chapter_no": "45",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، وعبد الله بن عمر بن أبان، كلهم عن حسين، - قال أبو بكر حدثنا حسين بن علي الجعفي، - عن مجمع بن يحيى، عن سعيد بن أبي بردة، عن أبي بردة، عن أبيه، قال صلينا المغرب مع رسول الله صلى الله عليه وسلم ثم قلنا لو جلسنا حتى نصلي معه العشاء - قال - فجلسنا فخرج علينا فقال ‏\"‏ ما زلتم ها هنا ‏\"‏ ‏.‏ قلنا يا رسول الله صلينا معك المغرب ثم قلنا نجلس حتى نصلي معك العشاء قال ‏\"‏ أحسنتم أو أصبتم ‏\"‏ ‏.‏ قال فرفع رأسه إلى السماء وكان كثيرا مما يرفع رأسه إلى السماء فقال ‏\"‏ النجوم أمنة للسماء فإذا ذهبت النجوم أتى السماء ما توعد وأنا أمنة لأصحابي فإذا ذهبت أتى أصحابي ما يوعدون وأصحابي أمنة لأمتي فإذا ذهب أصحابي أتى أمتي ما يوعدون ‏\"‏ ‏.‏",
      "text_en": " Abu Burda reported on the authority of his father:                      We offered the sunset prayer along with Allah's Apostle (may peace be upon him). We then said: If we sit (along with Allah's Messenger) and observe night prayer with him it would be very good, so we sat down and he came to us and said: You are still sitting here. I said: Allah's Messenger, we observed evening prayer with you, then we said: Let us sit down and observe night prayer along with you, whereupon he said: You have done well or you have done right. He then lifted his head towards the sky and it often happened that as he lifted his head towards the sky, he said: The stars are a source of security for the sky and when the stars disappear there comes to the sky, i. e. (it meets the same fate) as it has been promised (it would plunge into darkness). And I am a source of safety and security to my Companions and when I would go away there would fall to the lot (of my Companions) as they have been promised with and my Companions are a source of security for the Umma and as they would go there would fall to the lot of my Umma as (its people) have been promised.",
      "chain": [
        "30201",
        "30123",
        "11278",
        "20436",
        "20315",
        "10821",
        "11345",
        "11901",
        "41"
      ]
    },
    {
      "hadith_no": "6827",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Virtue; Good Manners and Joining of the Ties of Relationship - كتاب البر والصلة والآداب",
      "chapter_no": "46",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، قال إسحاق أخبرنا وقال، أبو بكر حدثنا - سفيان بن عيينة، عن عمرو، سمع جابرا، يقول مر رجل في المسجد بسهام فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أمسك بنصالها ‏\"‏ ‏.‏",
      "text_en": " 'Amr heard Jabir as saying:                      A person happened to come to the mosque with an arrow; thereupon Allah's Messenger (may peace be upon him) said to him: Take hold of its pointed head.",
      "chain": [
        "30201",
        "30123",
        "30312",
        "20436",
        "20005",
        "11081",
        "34"
      ]
    },
    {
      "hadith_no": "6987",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Remembrance of Allah; Supplication; Repentance and Seeking Forgiveness - كتاب الذكر والدعاء والتوبة والاستغفار",
      "chapter_no": "49",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وزهير بن حرب، جميعا عن ابن علية، قال أبو بكر حدثنا إسماعيل ابن علية، عن عبد العزيز بن صهيب، عن أنس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا دعا أحدكم فليعزم في الدعاء ولا يقل اللهم إن شئت فأعطني فإن الله لا مستكره له ‏\"‏ ‏.‏",
      "text_en": " Anas reported Allah's Messenger (may peace be upon him) as saying:                      When one of you makes supplication, he should supplicate with a will and should not say: O Allah, confer upon me if Thou likest, for there is none to coerce Allah.",
      "chain": [
        "30201",
        "30022",
        "20208",
        "20436",
        "20208",
        "11295",
        "19"
      ]
    },
    {
      "hadith_no": "7168",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Repentance and Exhortation to Repentance - كتاب التوبة",
      "chapter_no": "51",
      "text_ar": "حدثنا محمد بن عبد الله بن نمير، وأبو كريب قالا حدثنا أبو معاوية، ح وحدثنا  أبو بكر بن أبي شيبة، - واللفظ له - حدثنا عبد الله بن نمير، وأبو معاوية عن الأعمش، عن شقيق، عن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا أحد أغير من الله ولذلك حرم الفواحش ما ظهر منها وما بطن ولا أحد أحب إليه المدح من الله ‏\"‏ ‏.‏",
      "text_en": " 'Abdullah reported Allah's Messenger (may peace be upon him) as saying:                      None is more self-respectidg than Allah and it is because of this that He has prohibited abominable acts-both visible and invisible-and none loves His praise more than Allah Himself.",
      "chain": [
        "30212",
        "30216",
        "20354",
        "20436",
        "20331",
        "20354",
        "11060",
        "11353",
        "16"
      ]
    },
    {
      "hadith_no": "7406",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to Paradise; Its Description; Its Bounties and Its Intimates - كتاب الجنة وصفة نعيمها وأهلها",
      "chapter_no": "54",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وعلي بن حجر، جميعا عن إسماعيل، قال أبو بكر حدثنا ابن علية، عن أيوب، عن عبد الله بن أبي مليكة، عن عائشة، قالت قال رسول الله صلى الله عليه وسلم ‏\"‏ من حوسب يوم القيامة عذب ‏\"‏ ‏.‏ فقلت أليس قد قال الله عز وجل ‏{‏ فسوف يحاسب حسابا يسيرا‏}‏ فقال ‏\"‏ ليس ذاك الحساب إنما ذاك العرض من نوقش الحساب يوم القيامة عذب ‏\"‏ ‏.‏",
      "text_en": " 'A'isha reported that Allah's Messenger (may peace be upon him) said:                      He who is taken to account on the Day of Resurrection is in fact put to torment. I said: Has Allah, the Exalted and Glorious, not said this: 'He will be made subject to an easy reckoning\" (Ixxxiv. 8)? Thereupon he said: (What it implies) is not the actual reckoning, but only the presentation of one's deeds to Him. He who is thoroughly examined in reckoning is put to torment.",
      "chain": [
        "30201",
        "20387",
        "20208",
        "20436",
        "20208",
        "11015",
        "11090",
        "53"
      ]
    },
    {
      "hadith_no": "7506",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "وحدثني محمد بن عمرو بن جبلة، حدثنا محمد بن جعفر، ح وحدثنا عقبة بن، مكرم العمي وأبو بكر بن نافع قال عقبة حدثنا وقال أبو بكر، أخبرنا غندر، حدثنا شعبة، قال سمعت خالدا، يحدث عن سعيد بن أبي الحسن، عن أمه، عن أم سلمة، أن رسول الله صلى الله عليه وسلم قال لعمار ‏\"‏ تقتلك الفئة الباغية ‏\"‏ ‏.‏",
      "text_en": " This hadith has been transmitted on the authority of Umm Salama that Allah's Messenger (may peace be upon him) said to 'Ammar:                      A group of rebels would kill you.",
      "chain": [
        "38562",
        "20173",
        "30441",
        "189",
        "20436",
        "20278",
        "20020",
        "11282",
        "11287",
        "10737",
        "56"
      ]
    },
    {
      "hadith_no": "7524",
      "source": " Sahih Muslim ",
      "chapter": "The Book Pertaining to the Turmoil and Portents of the Last Hour - كتاب الفتن وأشراط الساعة",
      "chapter_no": "55",
      "text_ar": "حدثنا يحيى بن يحيى، وأبو بكر بن أبي شيبة قال يحيى أخبرنا وقال أبو بكر حدثنا أبو الأحوص، ح وحدثنا أبو كامل الجحدري، حدثنا أبو عوانة، كلاهما عن  سماك، عن جابر بن سمرة، قال سمعت رسول الله صلى الله عليه وسلم يقول ‏\"‏ إن بين يدى الساعة كذابين ‏\"‏ ‏.‏ وزاد في حديث أبي الأحوص قال فقلت له آنت سمعت هذا من رسول الله صلى الله عليه وسلم قال نعم ‏.‏",
      "text_en": " Jabir b. Samura reported:                      I heard Allah's Messenger (may peace be upon him) as saying: Before the Last Hour there would be many liars, and there is an addition in the badith transmitted on the authority of Abu Ahwas of these words:\" I said to him: Did you hear it from Allah's Messenger (may peace be upon him)? He said: Yes.\"",
      "chain": [
        "30399",
        "30201",
        "20031",
        "20436",
        "20327",
        "30559",
        "10770",
        "393"
      ]
    },
    {
      "hadith_no": "1557",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Zakat (Kitab Al-Zakat) - كتاب الزكاة",
      "chapter_no": "9",
      "text_ar": "حدثنا ابن السرح، وسليمان بن داود، قالا أخبرنا ابن وهب، أخبرني يونس، عن الزهري، قال قال أبو بكر إن حقه أداء الزكاة وقال عقالا ‏.‏",
      "text_en": " This tradition has also been transmitted by Al Zuhri through a different chain of narrators. This version has “Abu Bakr said its due is the payment of zakat.” He used the word “a rope of a Camel”",
      "chain": [
        "30485",
        "30584",
        "20029",
        "20475",
        "11013",
        "20436"
      ]
    },
    {
      "hadith_no": "2478",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا أبو بكر، وعثمان، ابنا أبي شيبة قالا حدثنا شريك، عن المقدام بن شريح، عن أبيه، قال سألت عائشة - رضى الله عنها - عن البداوة، فقالت كان رسول الله صلى الله عليه وسلم يبدو إلى هذه التلاع وإنه أراد البداوة مرة فأرسل إلى ناقة محرمة من إبل الصدقة فقال لي ‏\"‏ يا عائشة ارفقي فإن الرفق لم يكن في شىء قط إلا زانه ولا نزع من شىء قط إلا شانه ‏\"‏ ‏.‏",
      "text_en": " Miqdan bin Shuraih reported on the authority of his father. I asked A’ishah about settling in the desert (to worship Allaah in loneliness). She said “The Apostle of Allaah(ﷺ) would go out (from Madina) to these torrential streams. Once he intended to go out to the desert (for worshipping Allaah). He sent me a She-Camel from the Camels of sadaqah that was not used as a mount. He said to me “A’ishah be lenient, for leniency makes a thing  decorated and when it is removed from a thing it makes it defective.",
      "chain": [
        "20436",
        "20587",
        "10830",
        "10774",
        "53"
      ]
    },
    {
      "hadith_no": "2556",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن رافع، حدثنا أبو بكر بن أبي أويس، حدثني سليمان بن بلال، عن العلاء بن عبد الرحمن، عن أبيه، عن أبي هريرة، أن النبي صلى الله عليه وسلم قال في الجرس ‏\"‏ مزمار الشيطان ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the Apostle of Allaah(ﷺ) as saying “The bell is a wooden wind musical instrument of Satan.”",
      "chain": [
        "30375",
        "20436",
        "20160",
        "10606",
        "11884",
        "13"
      ]
    },
    {
      "hadith_no": "2889",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Shares of Inheritance (Kitab Al-Fara'id) - كتاب الفرائض",
      "chapter_no": "19",
      "text_ar": "حدثنا منصور بن أبي مزاحم، حدثنا أبو بكر، عن أبي إسحاق، عن البراء بن عازب، قال جاء رجل إلى النبي صلى الله عليه وسلم فقال يا رسول الله يستفتونك في الكلالة فما الكلالة قال ‏\"‏ تجزيك آية الصيف ‏\"‏ ‏.‏ فقلت لأبي إسحاق هو من مات ولم يدع ولدا ولا والدا قال كذلك ظنوا أنه كذلك ‏.‏",
      "text_en": " Narrated Al-Bara' ibn Azib:                     A man came to the Prophet (ﷺ) and said: Messenger of Allah, they ask thee for a legal decision about a kalalah. What is meant by kalalah? He replied: The verse revealed in summer is sufficient for you.  I asked AbuIshaq: Does it mean a person who dies and leaves neither children nor father? He said: This is so. The people think it is so.",
      "chain": [
        "30523",
        "20436",
        "11049",
        "400"
      ]
    },
    {
      "hadith_no": "3376",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Commercial Transactions (Kitab Al-Buyu) - كتاب البيوع",
      "chapter_no": "23",
      "text_ar": "حدثنا أبو بكر، وعثمان، ابنا أبي شيبة قالا حدثنا ابن إدريس، عن عبيد الله، عن أبي الزناد، عن الأعرج، عن أبي هريرة، أن النبي صلى الله عليه وسلم نهى عن بيع الغرر - زاد عثمان - والحصاة ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     The Prophet (ﷺ) forbade the type of sale which involves risk (or uncertainty) and a transaction determined by throwing stones.",
      "chain": [
        "20436",
        "20102",
        "11201",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "3496",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا أبو بكر، وعثمان، ابنا أبي شيبة قالا حدثنا وكيع، عن سفيان، عن ابن طاوس، عن أبيه، عن ابن عباس، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من ابتاع طعاما فلا يبعه حتى يكتاله ‏\"‏ ‏.‏ زاد أبو بكر قال قلت لابن عباس لم قال ألا ترى أنهم يتبايعون بالذهب والطعام مرجى ‏.‏",
      "text_en": " Narrated Ibn 'Abbas:                     The Messenger of Allah (ﷺ) as saying: If anyone buys grain, he should not sell it until he measures it. Abu Bakr added in his version: I asked Ibn 'Abbas: Why ? He replied: Do you not see that they sell (grain) for gold, but the grain is still with the seller.",
      "chain": [
        "20436",
        "20032",
        "20012",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "4345",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا محمد بن العلاء، أخبرنا أبو بكر، حدثنا مغيرة بن زياد الموصلي، عن عدي بن عدي، عن العرس بن عميرة الكندي، عن النبي صلى الله عليه وسلم قال ‏\"‏ إذا عملت الخطيئة في الأرض كان من شهدها فكرهها ‏\"‏ ‏.‏ وقال مرة ‏\"‏ أنكرها ‏\"‏ ‏.‏ ‏\"‏ كمن غاب عنها ومن غاب عنها فرضيها كان كمن شهدها ‏\"‏ ‏.‏",
      "text_en": " Narrated Al-'Urs bin 'Amirat al-Kindi:                     The Prophet (ﷺ) said: When sin is done in the earth, he who sees it and disapproves of it will be taken like one who was not present, but he who is not present and approves of it will be like him who sees.",
      "chain": [
        "30216",
        "20436",
        "19947",
        "18721"
      ]
    },
    {
      "hadith_no": "4643",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا محمد بن العلاء، حدثنا أبو بكر، عن عاصم، قال سمعت الحجاج، وهو على المنبر يقول اتقوا الله ما استطعتم ليس فيها مثنوية واسمعوا وأطيعوا ليس فيها مثنوية لأمير المؤمنين عبد الملك والله لو أمرت الناس أن يخرجوا من باب من أبواب المسجد فخرجوا من باب آخر لحلت لي دماؤهم وأموالهم والله لو أخذت ربيعة بمضر لكان ذلك لي من الله حلالا ويا عذيري من عبد هذيل يزعم أن قراءته من عند الله والله ما هي إلا رجز من رجز الأعراب ما أنزلها الله على نبيه عليه السلام وعذيري من هذه الحمراء يزعم أحدهم أنه يرمي بالحجر فيقول إلى أن يقع الحجر قد حدث أمر فوالله لأدعنهم كالأمس الدابر ‏.‏ قال فذكرته للأعمش فقال أنا والله سمعته منه ‏.‏",
      "text_en": " ‘Asim said:                      I heard al-Hajjaj say on the pulpit: Fear Allah as much as possible; there is no exception in it. Hear and obey the Commander of the Faithful ‘Abd al-Malik; there is no exception in it. I swear by Allah, if order people to come but from a certain gate of the mosque, and they come out from another gate, their blood and their properties will be lawful for me. I swear by Allah, if I seize the tribe of Rabi’ah for the tribe of Mudar, it is lawful for me from Allah. Who will apologies to me for the slave of Hudhail (i.e. ‘Abd Allah b. Mas’ud) who thinks that his reading of the Quran is from Allah. I swear by Allah, it is a rhymed prose of the Bedouins. Allah did not reveal it to his Prophet (ﷺ). Who will apologies to me for these clients (non-Arab). One of them thinks that he will throw a stone and when it falls (on the ground) he says: Something new has happened. I swear by Allah, I shall leave them (ruined and perished) like the day that passes away.He said: I mentioned it to al-A’mash. He said: I swear by Allah, I heard it from him.",
      "chain": [
        "30216",
        "20436",
        "11080",
        "20381"
      ]
    },
    {
      "hadith_no": "4946",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا أبو بكر، وعثمان، ابنا أبي شيبة - المعنى قالا حدثنا أبو معاوية، قال عثمان وجرير الرازي ح وحدثنا واصل بن عبد الأعلى، حدثنا أسباط، عن الأعمش، عن أبي صالح، - وقال واصل قال حدثت عن أبي صالح، ثم اتفقوا - عن أبي هريرة، عن النبي صلى الله عليه وسلم قال ‏\"‏ من نفس عن مسلم كربة من كرب الدنيا نفس الله عنه كربة من كرب يوم القيامة - ومن يسر على معسر يسر الله عليه في الدنيا والآخرة ومن ستر على مسلم ستر الله عليه في الدنيا والآخرة والله في عون العبد ما كان العبد في عون أخيه ‏\"‏ ‏.‏ قال أبو داود لم يذكر عثمان عن أبي معاوية ‏\"‏ ومن يسر على معسر ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported the prophet (ﷺ) as saying:                      If anyone removes his brother’s anxiety of this world, Allah will remove for him one of the anxieties of the Day of resurrection; if anyone makes easy for an impoverished man, Allah will make easy for him in this world and on the day of resurrection; if anyone conceals a Muslim’s secrets, Allah will conceal his secrets in this world and on the Day of resurrection; Allah will remain in the aid of a servant so long as the servant remains in the aid of his brother.Abu Dawud said: ‘Uthman did not transmit the following words from Abu Mu’awiyah: “if anyone makes easy for an impoverished man”.",
      "chain": [
        "20436",
        "20354",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "1525",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Vows and Oaths - كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "20",
      "text_ar": "حدثنا أبو إسماعيل الترمذي، - واسمه محمد بن إسماعيل بن يوسف حدثنا أيوب بن سليمان بن بلال، حدثنا أبو بكر بن أبي أويس، عن سليمان بن بلال، عن موسى بن عقبة، ومحمد بن عبد الله بن أبي عتيق، عن الزهري، عن سليمان بن أرقم، عن يحيى بن أبي كثير، عن أبي سلمة، عن عائشة، عن النبي صلى الله عليه وسلم قال ‏\"‏ لا نذر في معصية الله وكفارته كفارة يمين ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب وهو أصح من حديث أبي صفوان عن يونس ‏.‏ وأبو صفوان هو مكي واسمه عبد الله بن سعيد بن عبد الملك بن مروان وقد روى عنه الحميدي وغير واحد من جلة أهل الحديث ‏.‏ وقال قوم من أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم لا نذر في معصية الله وكفارته كفارة يمين ‏.‏ وهو قول أحمد وإسحاق واحتجا بحديث الزهري عن أبي سلمة عن عائشة ‏.‏ وقال بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم لا نذر في معصية ولا كفارة في ذلك ‏.‏ وهو قول مالك والشافعي ‏.‏",
      "text_en": " Narrated 'Aishah:                     That the Prophet (ﷺ) said: \"There is no vowing in disobedience to Allah, and its atonement is the atonement of an oath.\"",
      "chain": [
        "36621",
        "20158",
        "20436",
        "20160",
        "11106",
        "20175",
        "11013",
        "24178",
        "11449",
        "10567",
        "53"
      ]
    },
    {
      "hadith_no": "3379",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا زياد بن أيوب البغدادي، حدثنا عفان بن مسلم، حدثنا همام، حدثنا ثابت، عن أنس، أن أبا بكر، حدثه قال قلت للنبي صلى الله عليه وسلم ونحن في الغار لو أن أحدهم ينظر إلى قدميه لأبصرنا تحت قدميه ‏.‏ فقال ‏\"‏ يا أبا بكر ما ظنك باثنين الله ثالثهما ‏\"‏ ‏.‏ قال هذا حديث حسن صحيح غريب إنما يعرف من حديث همام تفرد به ‏.‏ وقد روى هذا الحديث حبان بن هلال وغير واحد عن همام نحو هذا ‏.‏",
      "text_en": " Narrated Anas:                     that Abu Bakr narrated to him, he said: \"While were in the cave, I said to the Prophet (ﷺ): 'If one of them were to look down at his feet, then he would see us under his feet.' So he said: 'O Abu Bakr! What do you think about two, the third of whom is Allah?'\"",
      "chain": [
        "30249",
        "30106",
        "20297",
        "11269",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "3609",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Tafsir - كتاب تفسير القرآن عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "47",
      "text_ar": "حدثنا أبو كريب، حدثنا معاوية بن هشام، عن شيبان، عن أبي إسحاق، عن عكرمة، عن ابن عباس، قال قال أبو بكر رضى الله عنه يا رسول الله قد شبت ‏.‏ قال ‏\"‏ شيبتني هود والواقعة والمرسلات و عم يتساءلون وإذا الشمس كورت ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه من حديث ابن عباس إلا من هذا الوجه ‏.‏ وروى علي بن صالح هذا الحديث عن أبي إسحاق عن أبي جحيفة نحو هذا ‏.‏ وروي عن أبي إسحاق عن أبي ميسرة شيء من هذا مرسلا ‏.‏",
      "text_en": " Abu Ishaq narrated from Ikrimah, from Ibn Abbas who said:                     “Abu Bakr [may Allah be pleased with him] said: ‘O Messenger of Allah! You have become gray.’ He said: ‘I have gone gray from (Surat) Hud, Al-Waqiah, Al-Mursalat and Amma Yatasa’lim and Idhash Shamsu Kuwwirat.’”",
      "chain": [
        "30216",
        "20609",
        "20240",
        "11049",
        "11023",
        "17",
        "20436"
      ]
    },
    {
      "hadith_no": "4030",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Virtues - كتاب المناقب عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "49",
      "text_ar": "وروى بعضهم، عن شعبة، عن الجريري، عن أبي نضرة، قال قال أبو بكر وهذا أصح ‏.‏ حدثنا بذلك، محمد بن بشار حدثنا عبد الرحمن بن مهدي، عن شعبة، عن الجريري، عن أبي نضرة، قال قال أبو بكر فذكر نحوه بمعناه ولم يذكر فيه عن أبي سعيد وهذا أصح ‏.‏",
      "text_en": "",
      "chain": [
        "20020",
        "11286",
        "10721",
        "20436",
        "20033",
        "20020",
        "11286",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "563",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرنا محمد بن إسماعيل الترمذي، قال حدثنا أيوب بن سليمان، قال حدثنا أبو بكر، عن سليمان بن بلال، عن يونس، عن ابن شهاب، عن سالم، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من أدرك ركعة من صلاة من الصلوات فقد أدركها إلا أنه يقضي ما فاته ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Salim that the Messenger of Allah (ﷺ) said:                      \"Whoever catches up with a Rak'ah of one of the prayers has caught up with it, except that he has to make up the portion that he missed.\"",
      "chain": [
        "36621",
        "20158",
        "20436",
        "20160",
        "20475",
        "11013",
        "11011"
      ]
    },
    {
      "hadith_no": "2297",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن بشار، قال حدثنا أبو بكر، قال حدثنا عبد الحميد بن جعفر، عن عمران بن أبي أنس، عن سليمان بن يسار، عن حمزة بن عمرو، قال سألت رسول الله صلى الله عليه وسلم عن الصوم في السفر فقال ‏\"‏ إن شئت أن تصوم فصم وإن شئت أن تفطر فأفطر ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hamzah bin 'Amr said:                     \"I asked the Messenger of Allah about fasting while traveling. He said: 'If you wish to fast then fast, and if you wish not to fast then do not fast.\"'",
      "chain": [
        "30160",
        "20436",
        "11875",
        "10605",
        "11005",
        "4123"
      ]
    },
    {
      "hadith_no": "2455",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا عبيد الله بن فضالة بن إبراهيم النسائي، قال أنبأنا شريح بن النعمان، قال حدثنا حماد بن سلمة، عن ثمامة بن عبد الله بن أنس بن مالك، عن أنس بن مالك، أن أبا بكر، رضى الله عنه كتب له أن هذه فرائض الصدقة التي فرض رسول الله صلى الله عليه وسلم على المسلمين التي أمر الله بها رسوله صلى الله عليه وسلم فمن سئلها من المسلمين على وجهها فليعطها ومن سئل فوقها فلا يعطه فيما دون خمس وعشرين من الإبل في خمس ذود شاة فإذا بلغت خمسا وعشرين ففيها بنت مخاض إلى خمس وثلاثين فإن لم تكن ابنة مخاض فابن لبون ذكر فإذا بلغت ستة وثلاثين ففيها بنت لبون إلى خمس وأربعين فإذا بلغت ستة وأربعين ففيها حقة طروقة الفحل إلى ستين فإذا بلغت إحدى وستين ففيها جذعة إلى خمسة وسبعين فإذا بلغت ستة وسبعين ففيها ابنتا لبون إلى تسعين فإذا بلغت إحدى وتسعين ففيها حقتان طروقتا الفحل إلى عشرين ومائة فإذا زادت على عشرين ومائة ففي كل أربعين ابنة لبون وفي كل خمسين حقة فإذا تباين أسنان الإبل في فرائض الصدقات فمن بلغت عنده صدقة الجذعة وليست عنده جذعة وعنده حقة فإنها تقبل منه الحقة ويجعل معها شاتين إن استيسرتا له أو عشرين درهما ومن بلغت عنده صدقة الحقة وليست عنده إلا جذعة فإنها تقبل منه ويعطيه المصدق عشرين درهما أو شاتين ومن بلغت عنده صدقة الحقة وليست عنده وعنده ابنة لبون فإنها تقبل منه ويجعل معها شاتين إن استيسرتا له أو عشرين درهما ومن بلغت عنده صدقة بنت لبون وليست عنده إلا حقة فإنها تقبل منه ويعطيه المصدق عشرين درهما أو شاتين ومن بلغت عنده صدقة بنت لبون وعنده بنت مخاض فإنها تقبل منه ويجعل معها شاتين إن استيسرتا له أو عشرين درهما ومن بلغت عنده صدقة ابنة مخاض وليست عنده إلا ابن لبون ذكر فإنه يقبل منه وليس معه شىء ومن لم يكن عنده إلا أربعة من الإبل فليس فيها شىء إلا أن يشاء ربها وفي صدقة الغنم في سائمتها إذا كانت أربعين ففيها شاة إلى عشرين ومائة فإذا زادت واحدة ففيها شاتان إلى مائتين فإذا زادت واحدة ففيها ثلاث شياه إلى ثلاثمائة فإذا زادت واحدة ففي كل مائة شاة ولا تؤخذ في الصدقة هرمة ولا ذات عوار ولا تيس الغنم إلا أن يشاء المصدق ولا يجمع بين متفرق ولا يفرق بين مجتمع خشية الصدقة وما كان من خليطين فإنهما يتراجعان بينهما بالسوية وإذا كانت سائمة الرجل ناقصة من أربعين شاة واحدة فليس فيها شىء إلا أن يشاء ربها وفي الرقة ربع العشر فإن لم يكن المال إلا تسعين ومائة فليس فيه شىء إلا أن يشاء ربها ‏.‏",
      "text_en": " It was narrated from Anas bin Malik that Abu Bakar, may Allah be pleased with him, wrote to him:                     \"This is the obligation of Sadaqah which  the Messenger of Allah enjoined upon the Muslims, as Allah commanded the Messenger of Allah Whoever is asked for it in the manner explained (in the letter of Abu Bakar), let him give it, and whoever is asked for more than that, let him not give it. When there are less than twenty-five camels, for every five camels, one sheep (is to be given). If the number reaches twenty-five, then a Bint Makhad (a one-year-old she-camel) is due, up to thirty-five. If a Bint Makhad (a one-year-old male camel). If the number reaches thirty-six, then a Bint Labun (a two-year-old she-camel) is due, up to forty five. If the number reaches forty-six, then a Hiqqah (a three year old she-camel) that was bred by a stallion camel is due, up to sixty. If the number reaches sixty-one, then a Jadh'ah (a four-year-old she-camel) is due, up to seventy-five. If the number reaches seventy-six, then two Bint Labun are due, up to ninety. If the number reaches ninety-one, then two Hiqqahs that have been bred by stallion camels are due, up to one hundred and twenty. If there are more than one hundred and twenty, then for every forty a Bint Labun and for every fifty a Hiqqah. In the event that a person does not have a camel of the age specified according to the Sadaqah regulation, then if a person owes a Jadh'ah but he has a Hiqqah, then the Hiqqah should be accepted from him and he should give two sheep along with it if they are available, or twenty Dirhams. If a person owes a Hiqqah as Sadaqah but he only has a Jadh'ah, then it shold be accepted from him, and the Zakah collector should give him twenty Dirhams or two sheep. If a person owes a Hiqqah and does not have one but he has a Bint Labun, it should be accepted from him, and he should give two sheep along with it, if they are available, or twenty Dirhams. If a person owes a Bint Labun as Sadaqah but he only has a Hiqqah, it should be accepted from him, and the Zakah collector should give him twenty Dirhams or two sheep. If a person owes a Bint Labun as Sadaqah and he does not have a Bint Labun, but he has a Bint Makhad. It should be accepted from him, and he should give two sheep along with it, if they are available, or twenty Dirhams. If a person owes a Bint Makhad as Sadaqah but he only has a Bint Labun, a male, it shold be accepted from him and nothing else (need be given) with it. If a person has only four camels, then nothing is due on them, unless their owner wishes (to give something). With regard to the Sadaqah of grazing sheep, if there are forty then one sheep is due, up to one hundred and twenty. If there is one more than that, then two sheep are due, up to two hundred. If there is one more than that, then three sheep are due, up to three hundred. If there is one more than that, then for every hundred one sheep is due, and no decrepit or defecting sheep or male sheep should be taken as Sadaqah unless the Zakah collector wishes. Do not combine separate flocks or separate combined flocks for fear of Sadaqah, Each partner (who has a share in a combined flock) shold pay Sadaqah in proportion to his shares. If a man's flock is one less than forty sheep, then nothing is due from them unless their owner wishes. With regard to silver, one-quarter of one-tenth, and if there are only one hundred and ninety, nothing is due unless the owner wishes.\"",
      "chain": [
        "20021",
        "19",
        "20436"
      ]
    },
    {
      "hadith_no": "3224",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمد بن نصر، قال حدثنا أيوب بن سليمان بن بلال، قال حدثني أبو بكر بن أبي أويس، عن سليمان بن بلال، قال قال يحيى - يعني ابن سعيد - وأخبرني ابن شهاب، قال حدثني عروة بن الزبير، وابن عبد الله بن ربيعة، عن عائشة، زوج النبي صلى الله عليه وسلم وأم سلمة زوج النبي صلى الله عليه وسلم أن أبا حذيفة بن عتبة بن ربيعة بن عبد شمس - وكان ممن شهد بدرا مع رسول الله صلى الله عليه وسلم - تبنى سالما وهو مولى لامرأة من الأنصار كما تبنى رسول الله صلى الله عليه وسلم زيد بن حارثة وأنكح أبو حذيفة بن عتبة سالما ابنة أخيه هند ابنة الوليد بن عتبة بن ربيعة وكانت هند بنت الوليد بن عتبة من المهاجرات الأول وهي يومئذ من أفضل أيامى قريش فلما أنزل الله عز وجل في زيد بن حارثة ‏{‏ ادعوهم لآبائهم هو أقسط عند الله ‏}‏ رد كل أحد ينتمي من أولئك إلى أبيه فإن لم يكن يعلم أبوه رد إلى مواليه ‏.‏",
      "text_en": " Narrated 'Aishah:                     It was narrated from 'Aishah the wife of the Prophet, and Umm Salamah the wife of the Prophet that Abu Hudhaifah bin 'Utbah bin Rabi'ah bin Abd Shams --who was one of those who had been present at Badr with the Messenger of Allah-- adopted Salim --who was the freed slave of an Ansari woman-- as the Messenger of Allah had adopted Zaid bin Harithah.  Abu Hudhaifah bin 'Utbah married Salim to his brother's daughter Hind bint Al-Walid bin 'Utbah bin Rabi'ah. Hind bint Al-Walid bin 'Utbah was one of the first Muhajir women, and at that time she was one of the best single women of the Quraish. When Allah, the Mighty and Sublime, revealed the following concerning Zaid bin Harithah: \"Call them by (the names of) their fathers, that is more just with Allah. But if you know not their fathers' (names, call them) your brothers in Faith and Mawalikum (your freed slaves).' Each of them went back to being called after his father, and if a person's father was unknown, he was named after his former masters.",
      "chain": [
        "20158",
        "20436",
        "20160",
        "11062",
        "11013",
        "10511"
      ]
    },
    {
      "hadith_no": "3381",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Marriage - كتاب النكاح",
      "chapter_no": "26",
      "text_ar": "أخبرنا محمد بن نصر، قال حدثنا أيوب بن سليمان، قال حدثني أبو بكر بن أبي أويس، عن سليمان بن بلال، عن يحيى، عن حميد، أنه سمع أنسا، يقول إن رسول الله صلى الله عليه وسلم أقام على صفية بنت حيى بن أخطب بطريق خيبر ثلاثة أيام حين عرس بها ثم كانت فيمن ضرب عليها الحجاب ‏.‏",
      "text_en": " It was narrated from Humaid that he heard Anas say:                      \"The Messenger of Allah stayed with Safiyyah bint Huyayy bin Akhtab on the way (back from) Khaibar for three days when he married her, then she was among those who were commanded to observe Hijab.\"",
      "chain": [
        "20158",
        "20436",
        "20160",
        "11449",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "3839",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا محمد بن إسماعيل الترمذي، قال حدثنا أيوب بن سليمان، قال حدثني أبو بكر بن أبي أويس، قال حدثني سليمان بن بلال، عن محمد بن أبي عتيق، وموسى بن عقبة، عن ابن شهاب، عن سليمان بن أرقم، أن يحيى بن أبي كثير الذي، كان يسكن اليمامة حدثه أنه، سمع أبا سلمة، يخبر عن عائشة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا نذر في معصية وكفارتها كفارة يمين ‏\"‏ ‏.‏ قال أبو عبد الرحمن سليمان بن أرقم متروك الحديث والله أعلم ‏.‏ خالفه غير واحد من أصحاب يحيى بن أبي كثير في هذا الحديث ‏.‏",
      "text_en": " It was narrated from 'Aishah that the Messenger of Allah said:                      \"There is no vow to commit an act of disobedience, and its expiation is the expiation for an oath.\"",
      "chain": [
        "36621",
        "20158",
        "20436",
        "20160",
        "11106",
        "11013",
        "24178",
        "53"
      ]
    },
    {
      "hadith_no": "143",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا الحسن بن علي الخلال، حدثنا يحيى بن آدم، حدثنا أبو بكر بن عياش، عن عاصم، عن زر، عن عبد الله بن مسعود، ‏.‏ أن أبا بكر، وعمر، بشراه أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ من أحب أن يقرأ القرآن غضا كما أنزل فليقرأه على قراءة ابن أم عبد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from 'Abdullah bin Mas'ud that:                     Abu Bakr and 'Umar gave him the glad tidings that the Messenger of Allah had said: \"Whoever would like to recite the Qur'an as fresh as when it was revealed, let him recite it like Ibn Umm 'Abd.'\"",
      "chain": [
        "30115",
        "20364",
        "20373",
        "11080",
        "11337",
        "20436"
      ]
    },
    {
      "hadith_no": "1817",
      "source": " Sunan Ibn Majah ",
      "chapter": "Fasting - كتاب الصيام",
      "chapter_no": "7",
      "text_ar": "حدثنا أبو بكر، حدثنا عبد الله بن المبارك، ح وحدثنا محرز بن سلمة العدني، حدثنا عبد العزيز بن محمد، جميعا عن موسى بن عبيدة، عن جمهان، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لكل شىء زكاة وزكاة الجسد الصوم ‏\"‏ ‏.‏ زاد محرز في حديثه وقال رسول الله  صلى الله عليه وسلم  ‏\"‏ الصيام نصف الصبر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “For everything there is Zakat and the Zakat of the body isfasting.”",
      "chain": [
        "20436",
        "20025",
        "20167",
        "12527",
        "13"
      ]
    },
    {
      "hadith_no": "3274",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Sacrifices - كتاب الأضاحي",
      "chapter_no": "26",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، حدثنا عبد الأعلى، عن خالد الحذاء، عن أبي قلابة، عن أبي زيد، - قال أبو بكر وقال غير عبد الأعلى عن عمرو بن بجدان، عن أبي زيد، - ح وحدثنا محمد بن المثنى أبو موسى، حدثنا عبد الصمد بن عبد الوارث، حدثنا أبي، عن خالد الحذاء، عن أبي قلابة، عن عمرو بن بجدان، عن أبي زيد الأنصاري، قال مر رسول الله  صلى الله عليه وسلم  بدار من دور الأنصار فوجد ريح قتار فقال ‏\"‏ من هذا الذي ذبح ‏\"‏ ‏.‏ فخرج إليه رجل منا فقال أنا يا رسول الله ذبحت قبل أن أصلي لأطعم أهلي وجيراني ‏.‏ فأمره أن يعيد ‏.‏ فقال لا والله الذي لا إله إلا هو ما عندي إلا جذع أو حمل من الضأن ‏.‏ قال ‏\"‏ اذبحها ولن تجزئ جذعة عن أحد بعدك ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Zaid Al-Ansari said:                      “The Messenger of Allah(ﷺ) passed by one of the houses of the Ansar and noticed the smellof a cooking pot. He said: ‘Who is this who has slaughtered?’ Amanfrom among us came out and said: ‘It is me, O Messenger ofAllah, Islaughtered before the prayer so that I could feed my familyandneighbors.’ He commanded him to repeat it. He said: ‘No, bythe Onebesides Whom there is none worthy of worship, I do not haveanythingbut a one-year-old sheep or a lamb.’ He (ﷺ) said:‘Sacrifice it, buta one-year-old sheep will not do for anyoneafter you.’”",
      "chain": [
        "30201",
        "20246",
        "11282",
        "11047",
        "20436",
        "19856",
        "30170",
        "20250",
        "20258",
        "11282",
        "11047"
      ]
    },
    {
      "hadith_no": "3530",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Drinks - كتاب الأشربة",
      "chapter_no": "30",
      "text_ar": "حدثنا أبو بكر، والعباس بن عبد العظيم العنبري، قالا حدثنا شبابة، عن شعبة، عن بكير بن عطاء، عن عبد الرحمن بن يعمر، قال نهى رسول الله  صلى الله عليه وسلم  عن الدباء والحنتم ‏.‏",
      "text_en": " It wasnarrated that ‘Abdur-Rahman bin Ya’mar said:                      “The Messenger ofAllah (ﷺ) forbade Dubba’ and Hantam.”",
      "chain": [
        "20436",
        "30437",
        "20426",
        "20020",
        "19862"
      ]
    },
    {
      "hadith_no": "3651",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر، حدثنا يحيى بن أبي بكير، حدثنا زهير بن محمد، عن يزيد بن خصيفة، عن عمرو بن عبد الله بن كعب، عن نافع بن جبير، عن عثمان بن أبي العاص الثقفي، أنه قال قدمت على النبي  صلى الله عليه وسلم  وبي وجع قد كاد يبطلني فقال لي النبي  صلى الله عليه وسلم  ‏\"‏ اجعل يدك اليمنى عليه وقل بسم الله أعوذ بعزة الله وقدرته من شر ما أجد وأحاذر سبع مرات ‏\"‏ ‏.‏ فقلت ذلك فشفاني الله ‏.‏",
      "text_en": " It wasnarrated that ‘Uthman bin Abul-‘As Thaqafi said:                      “I came totheProphet (ﷺ) and I was suffering pain that was killing me. TheProphet (ﷺ) said to me: ‘Put your right hand on it and say:Bismillah, a’udhu bi’izzatil-lahi wa qudratihi min sharri maajidu wauhadhiru. (In the Name of Allah, I seek refuge in the mightand powerof Allah from the evil of what I feel and what I fear),”seven times.’I said that, and Allah healed me.”",
      "chain": [
        "20436",
        "20365",
        "20394",
        "11235",
        "19819",
        "11059",
        "3210"
      ]
    },
    {
      "hadith_no": "3671",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Medicine - كتاب الطب",
      "chapter_no": "31",
      "text_ar": "حدثنا أبو بكر، ومجاهد بن موسى، ومحمد بن خلف العسقلاني، قالوا حدثنا يونس بن محمد، حدثنا مفضل بن فضالة، عن حبيب بن الشهيد، عن محمد بن المنكدر، عن جابر بن عبد الله، أن رسول الله  صلى الله عليه وسلم  أخذ بيد رجل مجذوم فأدخلها معه في القصعة ثم قال ‏\"‏ كل ثقة بالله وتوكلا على الله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Jabir bin ‘Abdullah that the Messenger of Allah(ﷺ)took the hand of a leper and made him eat with him, and said:                     “Eat,with trust in Allah and reliance upon Allah.”",
      "chain": [
        "20436",
        "30521",
        "38502",
        "20393",
        "20378",
        "11275",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "3688",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا سفيان بن عيينة، عن الزهري، عن عطاء بن يزيد الليثي، عن أبي سعيد الخدري، أن النبي  صلى الله عليه وسلم  نهى عن لبستين فأما اللبستان فاشتمال الصماء والاحتباء في الثوب الواحد ليس على فرجه منه شىء ‏.‏",
      "text_en": " It wasnarrated from Abu Sa’eed Al-Khudri that the Prophet (ﷺ)forbadetwo kinds of dress. Those two types of dress are Ishtimalus-Samma’*and Ihtiba’ in a single garment, with no part of it upon hisprivate part.**",
      "chain": [
        "20436",
        "20005",
        "11013",
        "11206",
        "38"
      ]
    },
    {
      "hadith_no": "3709",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا ابن دكين، عن زهير، عن عروة بن عبد الله بن قشير، حدثني معاوية بن قرة، عن أبيه، قال أتيت رسول الله  صلى الله عليه وسلم  فبايعته وإن زر قميصه لمطلق ‏.‏ قال عروة فما رأيت معاوية ولا ابنه في شتاء ولا صيف إلا مطلقة أزرارهما ‏.‏",
      "text_en": " Mu’awiyah bin Qurrah narrated that his father said:                      “I came totheMessenger of Allah (ﷺ) and gave him my pledge, and the buttonsofhis shirt were undone.”",
      "chain": [
        "20436",
        "20321",
        "18726",
        "11306",
        "5238"
      ]
    },
    {
      "hadith_no": "3711",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا المعتمر بن سليمان، عن عبيد الله بن عمر، عن نافع، عن سليمان بن يسار، عن أم سلمة، قالت سئل رسول الله  صلى الله عليه وسلم  كم تجر المرأة من ذيلها قال ‏\"‏ شبرا ‏\"‏ ‏.‏ قلت إذا ينكشف عنها ‏.‏ قال ذراع لا تزيد عليه ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Umm Salamah said:                      “The Messenger of Allah (ﷺ)wasasked about how long a woman’s hem should hang down. He said: ‘Ahand span.’ I said: ‘But then (her legs and feet) will beuncovered.’He said: ‘Then a forearm’s length, but no more thanthat.’”",
      "chain": [
        "20436",
        "20288",
        "11201",
        "11014",
        "11005",
        "56"
      ]
    },
    {
      "hadith_no": "3712",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا عبد الرحمن بن مهدي، عن سفيان، عن زيد العمي، عن أبي الصديق الناجي، عن ابن عمر، أن أزواج النبي،  صلى الله عليه وسلم  رخص لهن في الذيل ذراعا فكن يأتينا فنذرع لهن بالقصب ذراعا ‏.‏",
      "text_en": " It wasnarrated from Ibn ‘Umar:                      “The wives of the Prophet (ﷺ) wereallowed to let their hems hang down, so they used to come to us andwewould measure one forearms length for them with a reed.”",
      "chain": [
        "20436",
        "20033",
        "20012",
        "14135",
        "11268",
        "18"
      ]
    },
    {
      "hadith_no": "3726",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا عبد الرحيم بن سليمان، عن محمد بن إسحاق، عن يزيد بن أبي حبيب، عن عبد العزيز بن أبي الصعبة، عن أبي الأفلح الهمداني، عن عبد الله بن زرير الغافقي، سمعته يقول سمعت علي بن أبي طالب، يقول أخذ رسول الله  صلى الله عليه وسلم  حريرا بشماله وذهبا بيمينه ثم رفع بهما يديه فقال ‏\"‏ إن هذين حرام على ذكور أمتي حل لإناثهم ‏\"‏ ‏.‏",
      "text_en": " ‘Alibin Abu Talib said:                      “The Messenger of Allah (ﷺ) took hold ofsomesilk in his left hand and some gold in his right, then he raisedhishands and said: ‘These two are forbidden for the males of mynation, and permitted to the females.’”",
      "chain": [
        "20436",
        "20334",
        "11107",
        "11411",
        "12310",
        "5"
      ]
    },
    {
      "hadith_no": "3728",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا عبد الرحيم بن سليمان، عن الإفريقي، عن عبد الرحمن بن رافع، عن عبد الله بن عمرو، قال خرج علينا رسول الله  صلى الله عليه وسلم  وفي إحدى يديه ثوب من حرير وفي الأخرى ذهب فقال ‏\"‏ إن هذين محرم على ذكور أمتي حل لإناثهم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin ‘Umar said:                      “The Messenger ofAllah(ﷺ) came out to us, and in one of his hands was a garment ofsilkand in the other was some gold. He said: ‘These are forbidden tothe males of my nation and permitted to the females.’”",
      "chain": [
        "20436",
        "20334",
        "29"
      ]
    },
    {
      "hadith_no": "3729",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا عيسى بن يونس، عن معمر، عن الزهري، عن أنس، قال رأيت على زينب بنت رسول الله  صلى الله عليه وسلم  قميص حرير سيراء ‏.‏",
      "text_en": " It wasnarrated that Anas said:                      “I saw Zainab the daughter of theMessenger of Allah (ﷺ) wearing a shirt of Siyara’ silk.*",
      "chain": [
        "20436",
        "20347",
        "20115",
        "11013",
        "19"
      ]
    },
    {
      "hadith_no": "3734",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا عيسى بن يونس، عن هشام بن الغاز، عن عمرو بن شعيب، عن أبيه، عن جده، قال أقبلنا مع رسول الله  صلى الله عليه وسلم  من ثنية أذاخر فالتفت إلى وعلى ريطة مضرجة بالعصفر فقال ‏\"‏ ما هذه ‏\"‏ ‏.‏ فعرفت ما كره فأتيت أهلي وهم يسجرون تنورهم فقذفتها فيه ثم أتيته من الغد فقال ‏\"‏ يا عبد الله ما فعلت الريطة ‏\"‏ ‏.‏ فأخبرته فقال ‏\"‏ ألا كسوتها بعض أهلك فإنه لا بأس بذلك للنساء ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Amr bin Shu’aib, from his father, that hisgrandfather said:                      “We came with the Messenger of Allah (ﷺ) wasThaniyyat Adhakhir. He turned to me, and I was wearing a thin cloakdyed with safflower, and said: ‘What is this?’ And I realizedthat hedisliked it. I came to my family when they were heating theiroven andthrew it (in the oven). Then I came to him the following dayand hesaid: ‘O ‘Abdullah, what happened to the thin cloak?’ Itold him (whatI had done) and he said: ‘Why did you not give it tosome of yourfamily to wear, for there is nothing wrong with it forwomen.’”",
      "chain": [
        "20436",
        "20347",
        "20729",
        "19934",
        "19911"
      ]
    },
    {
      "hadith_no": "3740",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا سفيان بن عيينة، عن زيد بن أسلم، عن عبد الرحمن بن وعلة، عن ابن عباس، قال سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ أيما إهاب دبغ فقد طهر ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “I heard the Messenger of Allah(ﷺ) say: ‘Any skin that has been tanned has been purified.’”",
      "chain": [
        "20436",
        "20005",
        "11163",
        "17"
      ]
    },
    {
      "hadith_no": "3744",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا جرير، عن منصور، ح وحدثنا أبو بكر بن أبي شيبة، حدثنا علي بن مسهر، عن الشيباني، ح وحدثنا أبو بكر، حدثنا غندر، عن شعبة، كلهم عن الحكم، عن عبد الرحمن بن أبي ليلى، عن عبد الله بن عكيم، قال أتانا كتاب النبي  صلى الله عليه وسلم  ‏\"‏ أن لا تنتفعوا من الميتة بإهاب ولا عصب ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Abdullah bin ‘Ukaym said:                      “There came to us aletter from the Prophet (ﷺ) (saying): ‘No not make use of theuntanned skin and sinew of dead animals.’”",
      "chain": [
        "20436",
        "20028",
        "11067",
        "30201",
        "20345",
        "11352",
        "20436",
        "20278",
        "20020",
        "11069",
        "11196",
        "10786"
      ]
    },
    {
      "hadith_no": "3747",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا وكيع، عن شعبة، عن محمد بن زياد، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا انتعل أحدكم فليبدأ باليمنى وإذا خلع فليبدأ باليسرى ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                     “When anyone of you puts on his sandals, let him start with theright, and when he takes them off, let him start with the left.”",
      "chain": [
        "20436",
        "20032",
        "20020",
        "11216",
        "13"
      ]
    },
    {
      "hadith_no": "3748",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا عبد الله بن إدريس، عن ابن عجلان، عن سعيد بن أبي سعيد، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يمشي أحدكم في نعل واحد ولا خف واحد ليخلعهما جميعا أو ليمش فيهما جميعا ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)said;“None of you should walk in one sandal or in one leather sock.Lethim take them both off or walk in both of them.”",
      "chain": [
        "20436",
        "20102",
        "10616",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "3751",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا وكيع، حدثنا دلهم بن صالح الكندي، عن حجير بن عبد الله الكندي، عن ابن بريدة، عن أبيه، أن النجاشي، أهدى لرسول الله  صلى الله عليه وسلم  خفين ساذجين أسودين فلبسهما ‏.‏",
      "text_en": " It wasnarrated from Ibn Buraidah, from his father, that an-Najashisent apair of pure black Khuff as a gift to the Prophet (ﷺ) of,which hewore.",
      "chain": [
        "20436",
        "20032",
        "15130",
        "28094",
        "11432",
        "3131"
      ]
    },
    {
      "hadith_no": "3752",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا سفيان بن عيينة، عن الزهري، سمع أبا سلمة، وسليمان بن يسار، يخبران عن أبي هريرة، يبلغ به النبي  صلى الله عليه وسلم  قال ‏\"‏ إن اليهود والنصارى لا يصبغون فخالفوهم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Abu Hurairah attributed to the Prophet (ﷺ):                     “TheJews and the Christians do not dye (their hair), so differ fromthem.”",
      "chain": [
        "20436",
        "20005",
        "11013",
        "10567",
        "11005"
      ]
    },
    {
      "hadith_no": "3753",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا عبد الله بن إدريس، عن الأجلح، عن عبد الله بن بريدة، عن أبي الأسود الديلي، عن أبي ذر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إن أحسن ما غيرتم به الشيب الحناء والكتم ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Dharr that the Messenger of Allah (ﷺ)said:                      “Thebest things with which you change gray hair are henna andKatam.”*",
      "chain": [
        "20436",
        "20102",
        "11432",
        "11114",
        "23"
      ]
    },
    {
      "hadith_no": "3754",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا يونس بن محمد، حدثنا سلام بن أبي مطيع، عن عثمان بن موهب، قال دخلت على أم سلمة ‏.‏ قال فأخرجت إلى شعرا من شعر رسول الله  صلى الله عليه وسلم  مخضوبا بالحناء والكتم ‏.‏",
      "text_en": " It wasnarrated that ‘Uthman bin Mawhab said:                      “I entered upon UmmSalamah and she brought out for me a hair of the Messenger of Allah(ﷺ), which was dyed with henna and Katam.”",
      "chain": [
        "20436",
        "20393",
        "20550",
        "18716"
      ]
    },
    {
      "hadith_no": "3758",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا إسحاق بن منصور، حدثنا محمد بن طلحة، عن حميد بن وهب، عن ابن طاوس، عن طاوس، عن ابن عباس، قال مر النبي  صلى الله عليه وسلم  على رجل قد خضب بالحناء فقال ‏\"‏ ما أحسن هذا ‏\"‏ ‏.‏ ثم مر بآخر قد خضب بالحناء والكتم فقال ‏\"‏ هذا أحسن من هذا ‏\"‏ ‏.‏ ثم مر بآخر قد خضب بالصفرة فقال ‏\"‏ هذا أحسن من هذا كله ‏\"‏ ‏.‏ قال وكان طاوس يصفر ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Abbas said:                      “The Prophet (ﷺ) passed by amanwho had dyed his hair with henna and said: ‘How handsome this is!’Then he passed by another who had dyed his hair with henna and Katam,and said: ‘This one is more handsome than that one.’ Then hepassed byanother who had dyed his hair yellow and said: ‘This oneis morehandsome than all of them.’”",
      "chain": [
        "20436",
        "30313",
        "20604",
        "23013",
        "11433",
        "11053",
        "17"
      ]
    },
    {
      "hadith_no": "3773",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا عبد الله بن نمير، عن عبيد الله، عن نافع بن جبير، مولى علي عن علي، قال نهى رسول الله  صلى الله عليه وسلم  عن التختم بالذهب ‏.‏",
      "text_en": " It wasnarrated that ‘Ali said:                      “The Messenger of Allah (ﷺ) forbadewearing gold rings.”",
      "chain": [
        "20436",
        "20331",
        "11201",
        "11059",
        "5"
      ]
    },
    {
      "hadith_no": "3774",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا علي بن مسهر، عن يزيد بن أبي زياد، عن الحسن بن سهيل، عن ابن عمر، قال نهى رسول الله  صلى الله عليه وسلم  عن خاتم الذهب ‏.‏",
      "text_en": " It wasnarrated that Ibn ‘Umar said:                      “The Messenger of Allah (ﷺ)forbade gold rings.”",
      "chain": [
        "20436",
        "20345",
        "10844",
        "18"
      ]
    },
    {
      "hadith_no": "3781",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا غندر، عن شعبة، عن علي بن مدرك، عن أبي زرعة، عن عبد الله بن نجى، عن أبيه، عن علي بن أبي طالب، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ إن الملائكة لا تدخل بيتا فيه كلب ولا صورة ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from ‘Ali bin Abu Talib that the Prophet (ﷺ) said:                     “Theangels do not enter a house in which there is a dog or an image.”",
      "chain": [
        "20436",
        "20278",
        "20020",
        "11377",
        "11406",
        "5"
      ]
    },
    {
      "hadith_no": "3785",
      "source": " Sunan Ibn Majah ",
      "chapter": "Chapters on Dress - كتاب اللباس",
      "chapter_no": "32",
      "text_ar": "حدثنا أبو بكر، حدثنا أبو الأحوص، عن أبي إسحاق، عن هبيرة، عن علي، قال نهى رسول الله  صلى الله عليه وسلم  عن خاتم الذهب وعن الميثرة يعني الحمراء ‏.‏",
      "text_en": " It wasnarrated that ‘Ali said:                      “The Messenger of Allah (ﷺ) forbaderings of gold and Al-Mitharah,”* meaning the red ones.",
      "chain": [
        "20436",
        "20327",
        "11049",
        "5"
      ]
    },
    {
      "hadith_no": "3697",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا عبدة بن سليمان، ومحمد بن بشر، عن سعيد، عن قتادة، عن أنس بن مالك، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا سلم عليكم أحد من أهل الكتاب فقولوا وعليكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said \"the Messenger of Allah(ﷺ) said\":                     \"When any of the People of the Book greets you with Salam (peace), then say, Wa 'alaikum(and also upon you).\"",
      "chain": [
        "20436",
        "20337",
        "20352",
        "11168",
        "11019",
        "19"
      ]
    },
    {
      "hadith_no": "3698",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا أبو معاوية، عن الأعمش، عن مسلم، عن مسروق، عن عائشة، أنه أتى النبي  صلى الله عليه وسلم  ناس من اليهود فقالوا السام عليك يا أبا القاسم ‏.‏ فقال ‏\"‏ وعليكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Aishah that some of the Jews came to the Prophet(ﷺ) and said:                     \"Assam o alaika (death be upon you), O Abul-Qasim!\" He said: \"Wa 'alayikum (and also upon you).\"",
      "chain": [
        "20436",
        "20354",
        "11060",
        "11392",
        "11018",
        "53"
      ]
    },
    {
      "hadith_no": "3699",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا ابن نمير، عن محمد بن إسحاق، عن يزيد بن أبي حبيب، عن مرثد بن عبد الله اليزني، عن أبي عبد الرحمن الجهني، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إني راكب غدا إلى اليهود فلا تبدءوهم بالسلام فإذا سلموا عليكم فقولوا وعليكم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu 'Abdur-Rahman Al Juhani that the Messenger of Allah(ﷺ) said:                     \"I am riding to the Jews tomorrow. Do not initiate the greeting with them, and if they greet you, then say: Wa 'alaikum (and also upon you)\".",
      "chain": [
        "20436",
        "30212",
        "11107",
        "11411",
        "11410",
        "5363"
      ]
    },
    {
      "hadith_no": "3700",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا أبو خالد الأحمر، عن حميد، عن أنس، قال أتانا رسول الله  صلى الله عليه وسلم  ونحن صبيان فسلم علينا ‏.‏",
      "text_en": " It was narrated that Anas said:                     \"The Messenger of Allah(ﷺ) came to us, and we were young boys, and he greeted us with (the greeting of) peace\".",
      "chain": [
        "20436",
        "20326",
        "11279",
        "19"
      ]
    },
    {
      "hadith_no": "3701",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا سفيان بن عيينة، عن ابن أبي حسين، سمعه من، شهر بن حوشب يقول أخبرته أسماء بنت يزيد، قالت مر علينا رسول الله  صلى الله عليه وسلم  في نسوة فسلم علينا ‏.‏",
      "text_en": " Asma bint Yazid said:                     \"The Messenger of Allah(ﷺ) passed by us, among (a group of) women, and he greeted us with (the greeting of) peace.\"",
      "chain": [
        "20436",
        "20005",
        "84"
      ]
    },
    {
      "hadith_no": "3705",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا عبد الله بن إدريس، وغندر، وأبو أسامة عن شعبة، عن عمرو بن مرة، عن عبد الله بن سلمة، عن صفوان بن عسال، أن قوما، من اليهود قبلوا يد النبي  صلى الله عليه وسلم  ورجليه ‏.‏",
      "text_en": " It was narrated from Safwan bin 'Assal that:                     \"Some people among the Jews kissed the hands and feet of the Prophet(ﷺ).\"",
      "chain": [
        "20436",
        "20102",
        "20278",
        "20318",
        "20020",
        "11381",
        "4143"
      ]
    },
    {
      "hadith_no": "3706",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا يزيد بن هارون، أنبأنا داود بن أبي هند، عن أبي نضرة، عن أبي سعيد الخدري، أن أبا موسى، استأذن على عمر ثلاثا فلم يؤذن له فانصرف فأرسل إليه عمر ما ردك قال استأذنت الاستئذان الذي أمرنا به رسول الله  صلى الله عليه وسلم  ثلاثا فإن أذن لنا دخلنا وإن لم يؤذن لنا رجعنا ‏.‏ قال فقال لتأتيني على هذا ببينة أو لأفعلن ‏.‏ فأتى مجلس قومه فناشدهم فشهدوا له فخلى سبيله ‏.‏",
      "text_en": " It was narrated from Abu Saeed Khudri that Abu Musa asked permission to enter upon 'Umar three times, and he did not give him permission, so he went away.'Umar sent word to him saying:                     \"Why did you go back?\" He said: \"I asked permission to enter three times, as the Messenger of Allah(ﷺ) enjoined upon us, then if we are given permission we should enter, otherwise we should go back.\" He said: \"You should bring me proof of that, or else!\" Then he came to a gathering of his people and asked them to swear by Allah concerning that, and they did so, so he let him go.\"",
      "chain": [
        "20436",
        "20472",
        "11585",
        "10721",
        "38"
      ]
    },
    {
      "hadith_no": "3710",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا عيسى بن يونس، عن عبد الله بن مسلم، عن عبد الرحمن بن سابط، عن جابر، قال قلت كيف أصبحت يا رسول الله قال ‏\"‏ بخير من رجل لم يصبح صائما ولم يعد سقيما ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir said:                     \"I said: 'How are you this morning, O Messenger of Allah?' He said: 'I am better than one who did not get up fasting, and who did not visit and sick.'\"",
      "chain": [
        "20436",
        "20347",
        "11872",
        "10646",
        "34"
      ]
    },
    {
      "hadith_no": "3719",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا وكيع، عن زمعة بن صالح، عن الزهري، عن وهب بن عبد بن زمعة، عن أم سلمة، ح وحدثنا علي بن محمد، حدثنا وكيع، حدثنا زمعة بن صالح، عن الزهري، عن عبد الله بن وهب بن زمعة، عن أم سلمة، قالت خرج أبو بكر في تجارة إلى بصرى قبل موت النبي  صلى الله عليه وسلم  بعام ومعه نعيمان وسويبط بن حرملة وكانا شهدا بدرا وكان نعيمان على الزاد وكان سويبط رجلا مزاحا فقال لنعيمان أطعمني ‏.‏ قال حتى يجيء أبو بكر ‏.‏ قال فلأغيظنك ‏.‏ قال فمروا بقوم فقال لهم سويبط تشترون مني عبدا لي قالوا نعم ‏.‏ قال إنه عبد له كلام وهو قائل لكم إني حر ‏.‏ فإن كنتم إذا قال لكم هذه المقالة تركتموه فلا تفسدوا على عبدي ‏.‏ قالوا لا بل نشتريه منك ‏.‏ فاشتروه منه بعشر قلائص ثم أتوه فوضعوا في عنقه عمامة أو حبلا ‏.‏ فقال نعيمان إن هذا يستهزئ بكم وإني حر لست بعبد ‏.‏ فقالوا قد أخبرنا خبرك ‏.‏ فانطلقوا به فجاء أبو بكر فأخبروه بذلك ‏.‏ قال فاتبع القوم ورد عليهم القلائص وأخذ نعيمان ‏.‏ قال فلما قدموا على النبي  صلى الله عليه وسلم  وأخبروه ‏.‏ قال فضحك النبي  صلى الله عليه وسلم  وأصحابه منه حولا ‏.‏",
      "text_en": " It was narrated that Umm Salamah said:                     \"Abu Bakr went our to trade in Busra, one year before the Prophet(ﷺ) died, and with him were Nu'aiman and Suwaibit the sons of Harmalah, who had been present at Badr. Nu'iaman was in charge of the provisions, and Suwaibit was a man who joked a lot. He said to Nu'iman: 'Feed me'. He said: 'Not until Abu Bakr comes'. He said: 'Then I will have to annoy you'. Then they passed by some people, and Suwaibit said to them: 'Will you buy a slave from me?' They said: 'Yes'. He said ' He is a slave who talks a lot and he will tell you, \"I am a free man\". If you are going to let him go when says that to you, do not bother buying him.' They said: 'We will buy him from you.' So they bought him from him in return for ten young she-camels, then they brought him and tied a turban or a rope around his neck. Nu'aiman said: 'This man is making fun of you. I am a free man, not a slave.' They said: 'He has already told us about you; and they took him off.' THen Abu Bakr came and he (Suwaibit) told him about that. So he followed those people and returned their camels to them, and took Nu'iaman back. Whent hey came to the Prophet(ﷺ) they told him what had happened, and the Prophet(ﷺ) and his companions laughed about it for a year.\"",
      "chain": [
        "20436",
        "20032",
        "10636",
        "11013",
        "56",
        "38409",
        "20032",
        "10636",
        "11013",
        "2308",
        "56"
      ]
    },
    {
      "hadith_no": "3726",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا يحيى بن سعيد، عن عبيد الله بن الأخنس، عن الوليد بن عبد الله، عن يوسف بن ماهك، عن ابن عباس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من اقتبس علما من النجوم اقتبس شعبة من السحر زاد ما زاد ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Abbas that the Messenger of Allah(ﷺ) said:                     \"Whoever learns about the stars, he learns a branch of magic; the more he learns (of the former) the more he learns (of the latter).\"",
      "chain": [
        "20436",
        "20031",
        "20444",
        "11264",
        "17"
      ]
    },
    {
      "hadith_no": "3727",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا يحيى بن سعيد، عن الأوزاعي، عن الزهري، حدثنا ثابت الزرقي، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا تسبوا الريح فإنها من روح الله تأتي بالرحمة والعذاب ولكن سلوا الله من خيرها وتعوذوا بالله من شرها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah(ﷺ) said:                     \"Do not curse the wind, for it is from the mercy of Allah, bringing Rahmah (i.e., rain and breezes), or destruction. But ask Allah for its goodness, and seek refuge with Allah from its evil.\"",
      "chain": [
        "20436",
        "20031",
        "20024",
        "11013",
        "13"
      ]
    },
    {
      "hadith_no": "3728",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا خالد بن مخلد، حدثنا العمري، عن نافع، عن ابن عمر، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ أحب الأسماء إلى الله عز وجل عبد الله وعبد الرحمن ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that the Prophet(ﷺ) said:                     \"The most beloved of names to Allah are 'Abdullah and 'Abdur-Rahman.\"",
      "chain": [
        "20436",
        "30463",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3730",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا المعتمر بن سليمان، عن الركين، عن أبيه، عن سمرة، قال نهى رسول الله  صلى الله عليه وسلم  أن نسمي رقيقنا أربعة أسماء أفلح ونافع ورباح ويسار ‏.‏",
      "text_en": " It was narrated that Samurah said:                     \"The Messenger of Allah(ﷺ) forbade giving our slaves four names: Aflah (successful), Nafi' (beneficial), Rabah (profit) and Yasar(prosperity).\"",
      "chain": [
        "20436",
        "20288",
        "11289",
        "394"
      ]
    },
    {
      "hadith_no": "3731",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا هاشم بن القاسم، حدثنا أبو عقيل، حدثنا مجالد بن سعيد، عن الشعبي، عن مسروق، قال لقيت عمر بن الخطاب فقال من أنت فقلت مسروق بن الأجدع ‏.‏ فقال عمر سمعت رسول الله  صلى الله عليه وسلم  يقول ‏\"‏ الأجدع شيطان ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Masruq said:                     \"I met 'Umar bin Khattab and he said: 'Who are you?' I said: 'Masruq bin Adja'.' 'Umar said: 'I heard the Messenger of Allah(ﷺ) saying,\"Ajda' is a devil.\"",
      "chain": [
        "20436",
        "20390",
        "10820",
        "11052",
        "11018"
      ]
    },
    {
      "hadith_no": "3732",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا غندر، عن شعبة، عن عطاء بن أبي ميمونة، قال سمعت أبا رافع، يحدث عن أبي هريرة، أن زينب، كان اسمها برة فقيل لها تزكي نفسها فسماها رسول الله  صلى الله عليه وسلم  زينب ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     \"Zainab used to be called \"Barrah\" (good), and it was said that she was praising herself. So the Messenger of Allah(ﷺ) changed her name to Zainab.\"",
      "chain": [
        "20436",
        "20278",
        "20020",
        "11601",
        "13",
        "57"
      ]
    },
    {
      "hadith_no": "3733",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا الحسن بن موسى، حدثنا حماد بن سلمة، عن عبيد الله، عن نافع، عن ابن عمر، أن ابنة لعمر، كان يقال لها عاصية فسماها رسول الله  صلى الله عليه وسلم  جميلة ‏.‏",
      "text_en": " It was narrated from Ibn Umar that:                     \"a daughter of 'Umar was Asiyah(disobedient) then the Messenger of Allah(ﷺ) named her 'Jamilah' (beautiful).\"",
      "chain": [
        "20436",
        "20383",
        "20021",
        "11201",
        "11014",
        "18"
      ]
    },
    {
      "hadith_no": "3734",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا يحيى بن يعلى أبو المحياة، عن عبد الملك بن عمير، حدثنى ابن أخي عبد الله بن سلام، عن عبد الله بن سلام، قال قدمت على رسول الله  صلى الله عليه وسلم  وليس اسمي عبد الله بن سلام فسماني رسول الله  صلى الله عليه وسلم  عبد الله بن سلام ‏.‏",
      "text_en": " It was narrated that Abdullah bin Salam said:                     \"I came to the Messenger of Allah(ﷺ), and my name was not Abdullah bin Salam. The Messenger of Allah(ﷺ) named me Abdullah bin Salam.\"",
      "chain": [
        "20436",
        "103"
      ]
    },
    {
      "hadith_no": "3736",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا أبو معاوية، عن الأعمش، عن أبي سفيان، عن جابر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ تسموا باسمي ولا تكنوا بكنيتي ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir that the Messenger of Allah(ﷺ) said:                     \"Call yourselves by my name but do not call yourselves by my Kunyah.\"",
      "chain": [
        "20436",
        "20354",
        "11060",
        "11249",
        "34"
      ]
    },
    {
      "hadith_no": "3739",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا وكيع، عن هشام بن عروة، عن مولى، للزبير عن عائشة، ‏.‏ أنها قالت للنبي  صلى الله عليه وسلم  كل أزواجك كنيته غيري ‏.‏ قال ‏\"‏ فأنت أم عبد الله ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Aisha that she said to the Prophet(ﷺ):                     \"All of your wives have a Kunyah except me.\" He said: \"You are Umm Abdullah\".",
      "chain": [
        "20436",
        "20032",
        "11065"
      ]
    },
    {
      "hadith_no": "3741",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا عبد الله بن إدريس، عن داود، عن الشعبي، عن أبي جبيرة بن الضحاك، قال فينا نزلت معشر الأنصار ‏{ولا تنابزوا بالألقاب‏)‏ قدم علينا النبي  صلى الله عليه وسلم  والرجل منا له الاسمان والثلاثة فكان النبي  صلى الله عليه وسلم  ربما دعاهم ببعض تلك الأسماء فيقال يا رسول الله إنه يغضب من هذا ‏.‏ فنزلت ‏{ولا تنابزوا بالألقاب}‏ ‏.‏",
      "text_en": " It was narrated that Abu Jabirah bin Dahhak said:                     \"(Allah's saying) \"Nor insult one another by nicknames(Surah Al Hujarat 49:11)\" was revealed concerning us, the Ansar. When the Prophet(ﷺ) came to us, a man among us would have two or three names, and the Prophet(ﷺ) might call him by one of those names, only to be told: \"O Messenger of Allah(ﷺ), he does not like that name.\" Then:\"Nor insult one another by nicknames.\" was revealed.\"",
      "chain": [
        "20436",
        "20102",
        "11052",
        "1903"
      ]
    },
    {
      "hadith_no": "3742",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا عبد الرحمن بن مهدي، عن سفيان، عن حبيب بن أبي ثابت، عن مجاهد، عن أبي معمر، عن المقداد بن عمرو، قال أمرنا رسول الله  صلى الله عليه وسلم  أن نحثو في وجوه المداحين التراب ‏.‏",
      "text_en": " It was narrated that Miqdad bin 'Amr said:                     \"The Messenger of Allah(ﷺ) commanded us to throw dust in the faces of those who praise others.\"",
      "chain": [
        "20436",
        "20033",
        "20012",
        "11331",
        "11028",
        "11360"
      ]
    },
    {
      "hadith_no": "3744",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا شبابة، حدثنا شعبة، عن خالد الحذاء، عن عبد الرحمن بن أبي بكرة، عن أبيه، قال مدح رجل رجلا عند رسول الله  صلى الله عليه وسلم  فقال رسول الله  صلى الله عليه وسلم  ‏\"‏ ويحك قطعت عنق صاحبك ‏\"‏ ‏.‏ مرارا ثم قال ‏\"‏ إن كان أحدكم مادحا أخاه فليقل أحسبه ولا أزكي على الله أحدا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abdur-Rahman bin Abu Bakrah that his father said:                     \"A man praised another man in the presence of Messenger of Allah(ﷺ). The Messenger of Allah(ﷺ) said: 'Woe to you,you have cut the neck of your companion,'several times. Then he said: 'If anyone of you praises his brother, let him say: \"I think he is lie this, but I do not sanctify anyone before Allah.\"",
      "chain": [
        "20436",
        "20426",
        "20020",
        "11282",
        "11294",
        "3229"
      ]
    },
    {
      "hadith_no": "3747",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا يحيى بن زكريا بن أبي زائدة، وعلي بن هاشم، عن ابن أبي ليلى، عن أبي الزبير، عن جابر، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ إذا استشار أحدكم أخاه فليشر عليه ‏\"‏ ‏.",
      "text_en": " It was narrated from Jabir that that the Messenger of Allah(ﷺ) said:                     \"If one of you consults his brother, then let him advise him.\"",
      "chain": [
        "20436",
        "20366",
        "11196",
        "11263",
        "34"
      ]
    },
    {
      "hadith_no": "3748",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا عبدة بن سليمان، ح وحدثنا علي بن محمد، حدثنا خالي، يعلى وجعفر بن عون جميعا عن عبد الرحمن بن زياد بن أنعم الإفريقي، عن عبد الرحمن بن رافع، عن عبد الله بن عمرو، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ تفتح لكم أرض الأعاجم وستجدون فيها بيوتا يقال لها الحمامات فلا يدخلها الرجال إلا بإزار وامنعوا النساء أن يدخلنها إلا مريضة أو نفساء ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abdullah bin Amr said:                     \"The Messenger of Allah(ﷺ) said: 'You will conquer the lands of the non-Arabs, where you will find houses called Hammamat (bathhouses). Men Should only enter them wearing a waist wrap, and do not let women enter them unless they are sick or bleeding following childbirth.\"",
      "chain": [
        "20436",
        "20337",
        "38409",
        "28326",
        "29"
      ]
    },
    {
      "hadith_no": "3755",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا عبد الله بن المبارك، عن يونس، عن الزهري، حدثنا أبو بكر بن عبد الرحمن بن الحارث، عن مروان بن الحكم، عن عبد الرحمن بن الأسود بن عبد يغوث، عن أبى بن كعب، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إن من الشعر لحكمة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ubbay bin Ka'b that the Messenger of Allah(ﷺ) said:                     \"In some poetry there is wisdom.\"",
      "chain": [
        "20436",
        "20025",
        "20475",
        "11013",
        "11003",
        "858",
        "2206",
        "39"
      ]
    },
    {
      "hadith_no": "3756",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا أبو أسامة، عن زائدة، عن سماك، عن عكرمة، عن ابن عباس، أن النبي  صلى الله عليه وسلم  كان يقول ‏\"‏ إن من الشعر حكما ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn Abbas that the Prophet(ﷺ) said:                     \"In some poetry there is wisdom.\"",
      "chain": [
        "20436",
        "20318",
        "20320",
        "10770",
        "11023",
        "17"
      ]
    },
    {
      "hadith_no": "3759",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا حفص، وأبو معاوية ووكيع عن الأعمش، عن أبي صالح، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لأن يمتلئ جوف الرجل قيحا حتى يريه خير له من أن يمتلئ شعرا ‏\"‏ ‏.‏ إلا أن حفصا لم يقل يريه ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah(ﷺ) said:                     \"If a man were to fill his stomach completely with pus until it destroyed him, that would be better for him than filling (his mind) with poetry.\"",
      "chain": [
        "20436",
        "20317",
        "11060",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3763",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا عبد الله بن نمير، وأبو أسامة عن سفيان، عن علقمة بن مرثد، عن سليمان بن بريدة، عن أبيه، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ من لعب بالنردشير فكأنما غمس يده في لحم خنزير ودمه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Sulaiman bin Buraidah from his father that the Prophet(ﷺ) said:                     \"Whoever plays backgammon, it is as if he dipped his hand in the flesh and blood of a pig.\"",
      "chain": [
        "20436",
        "20331",
        "20318",
        "20012",
        "11374",
        "10916",
        "3131"
      ]
    },
    {
      "hadith_no": "3765",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا الأسود بن عامر، عن حماد بن سلمة، عن محمد بن عمرو، عن أبي سلمة، عن أبي هريرة، أن النبي  صلى الله عليه وسلم  رأى رجلا يتبع حمامة فقال ‏\"‏ شيطان يتبع شيطانة ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet(ﷺ) saw a man chasing a pigeon and said:                     \"A male devil following a female devil.\"",
      "chain": [
        "20436",
        "20380",
        "20021",
        "11220",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "3769",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا سفيان بن عيينة، عن الزهري، عن سالم، عن أبيه، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ لا تتركوا النار في بيوتكم حين تنامون ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Salim, from his father, that the Prophet(ﷺ) said:                     \"Do not leave fire in your houses when you go to sleep.\"",
      "chain": [
        "20436",
        "20005",
        "11013",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "3780",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا عبيد الله بن موسى، أنبأنا شيبان، عن فراس، عن عطية، عن أبي سعيد الخدري، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ يقال لصاحب القرآن إذا دخل الجنة اقرأ واصعد ‏.‏ فيقرأ ويصعد بكل آية درجة حتى يقرأ آخر شىء معه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Saeed Al-Khudri that the Messenger of Allah(ﷺ) said:                     \"It will be said to the companion of the Quran, when he enters Paradise: 'Recite and rise one degree for ever Verse,' until he recites the last thing that he knows.\"",
      "chain": [
        "20436",
        "20340",
        "20240",
        "11385",
        "38"
      ]
    },
    {
      "hadith_no": "3787",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا خالد بن مخلد، حدثنا سليمان بن بلال، حدثني سهيل، عن أبيه، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ‏{قل هو الله أحد}‏ تعدل ثلث القرآن ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said that the Messenger of Allah(ﷺ) said:                     \"Qul Huwa Allahu ahad [Say: He is Allah, (the) One] is equivalent to one third of the Quran.\"",
      "chain": [
        "20436",
        "30463",
        "20160",
        "13"
      ]
    },
    {
      "hadith_no": "3792",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا محمد بن مصعب، عن الأوزاعي، عن إسماعيل بن عبيد الله، عن أم الدرداء، عن أبي هريرة، عن النبي  صلى الله عليه وسلم  قال ‏\"‏ إن الله عز وجل يقول أنا مع عبدي إذا هو ذكرني وتحركت بي شفتاه ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Prophet(ﷺ) said:                     \"Allah says: 'I am with My slave when he remembers Me and his lips move saying My Name.'\"",
      "chain": [
        "20436",
        "28536",
        "20024",
        "11457",
        "13"
      ]
    },
    {
      "hadith_no": "3793",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا زيد بن الحباب، أخبرني معاوية بن صالح، أخبرني عمرو بن قيس الكندي، عن عبد الله بن بسر، أن أعرابيا، قال لرسول الله  صلى الله عليه وسلم  إن شرائع الإسلام قد كثرت على فأنبئني منها بشىء أتشبث به ‏.‏ قال ‏\"‏ لا يزال لسانك رطبا من ذكر الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abdullah bin Busr that a Bedouin said to the Messenger of Allah(ﷺ) said:                     \"The laws of Islam are burdensome for me. Tell me of something that I will be able to adhere to. He said: 'Always keep your tongue moist with the remembrance of Allah, the Mighty and Sublime.'\"",
      "chain": [
        "20436",
        "20650",
        "20675",
        "19935",
        "3650"
      ]
    },
    {
      "hadith_no": "3794",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا الحسين بن علي، عن حمزة الزيات، عن أبي إسحاق، عن الأغر أبي مسلم، أنه شهد على أبي هريرة وأبي سعيد أنهما شهدا على رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إذا قال العبد لا إله إلا الله والله أكبر ‏.‏ قال يقول الله عز وجل صدق عبدي لا إله إلا أنا وأنا أكبر ‏.‏ وإذا قال العبد لا إله إلا الله وحده ‏.‏ قال صدق عبدي لا إله إلا أنا وحدي ‏.‏ وإذا قال لا إله إلا الله لا شريك له ‏.‏ قال صدق عبدي لا إله إلا أنا ولا شريك لي ‏.‏ وإذا قال لا إله إلا الله له الملك وله الحمد ‏.‏ قال صدق عبدي لا إله إلا أنا لي الملك ولي الحمد ‏.‏ وإذا قال لا إله إلا الله ولا حول ولا قوة إلا بالله ‏.‏ قال صدق عبدي لا إله إلا أنا ولا حول ولا قوة إلا بي ‏\"‏ ‏.‏ قال أبو إسحاق ثم قال الأغر شيئا لم أفهمه ‏.‏ قال فقلت لأبي جعفر ما قال فقال من رزقهن عند موته لم تمسه النار ‏.‏",
      "text_en": " It was narrated from Abu Hurairah and Abu Saeed bore witness that the Messenger of Allah(ﷺ) said:                     \"If a person says: 'La ilaha illallahu wa Allahu Akbar (None has the right to be worshipped but Allah and Allah is the Most Great),'Allah says: 'My slave has spoken the truth; there is none worthy of worship except I, and I am the Most Great.' If a person says: La ilaha Illallah wahdahu (There is none worthy of worship except Allah alone), Allah says: 'My slave has spoken the truth; there is none worthy of worship except I, alone.' If he says, La ilaha illallahu la sharikalahu (There is none worthy of worship except Allah with no partner or associate),' Allah says: 'My slave has spoken the truth; there is none worthy of worship except I, with no partner or associate.' If he says: 'La illah illallah, lahul mulku wa lahul hamdu (There is none worthy of worship except Allah, all dominion is His and all praise is to Him),' Allah says: 'My slave has spoken the truth; there is none of worthy of worship except I, all dominion Mine and all praise is due to Me.' If he says: ' La illaha illallah, la hawla wa la quwwata illa billah (There is none worthy of worship and there is no power and no strength except with Allah),' Allah says: 'My slave has spoken then truth; there is none worthy of worship except I, and tehre is no power and no strength except with Me.' One of the narrators Abu Ishaq said: \"Then Agharr (another narrator) said something that I did not understand. I said to Abu Jafar: 'What did he say?' He said: 'Whoever is blessed with (the ability to say) them (these words) at the time of death, the Fire will not touch him.'\"",
      "chain": [
        "20436",
        "20315",
        "20583",
        "11049"
      ]
    },
    {
      "hadith_no": "3798",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا أبو بكر، حدثنا زيد بن الحباب، عن مالك بن أنس، أخبرني سمى، مولى أبي بكر عن أبي صالح، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من قال في يوم مائة مرة لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير كان له عدل عشر رقاب وكتبت له مائة حسنة ومحي عنه مائة سيئة وكن له حرزا من الشيطان سائر يومه إلى الليل ولم يأت أحد بأفضل مما أتى به إلا من قال أكثر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     the Messenger of Allah(ﷺ) said: \"Whoever says one hundered times each day: La ilaha illahu wahdahu la sharikalahu, wa lahul-mulku wa lahul hamduwa huwa ala kulli shayin qadeer (None has the right to be worshipped but Allah alone, with no partner or associate. His is the dominion, all praise is to Him, and He is able to do all things), it will be equivalent to him freeing ten slaves, and one hundered merits will be recorded for him, and one hundered bad deeds will be erased from (his record), and it will be a protection for him against Satan all day until night comes. No one can do anything better then him except one who says more.'\"",
      "chain": [
        "20436",
        "20650",
        "20001",
        "11161",
        "13"
      ]
    },
    {
      "hadith_no": "3842",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر، حدثنا محمد بن مصعب، عن الأوزاعي، عن إسحاق بن عبد الله، عن جعفر بن عياض، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ تعوذوا بالله من الفقر والقلة والذلة وأن تظلم أو تظلم ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that :                     the Messenger of Allah (saas) said: \"Seek refuge with Allah from poverty, insufficiency and humiliation, and from wronging (others) and being wronged.'\"",
      "chain": [
        "20436",
        "28536",
        "20024",
        "11151",
        "13"
      ]
    },
    {
      "hadith_no": "3845",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر، حدثنا يزيد بن هارون، أنبأنا أبو مالك، سعد بن طارق عن أبيه، أنه سمع النبي  صلى الله عليه وسلم  وقد أتاه رجل فقال يا رسول الله كيف أقول حين أسأل ربي قال ‏\"‏ قل اللهم اغفر لي وارحمني وعافني وارزقني ‏\"‏ ‏.‏ وجمع أصابعه الأربع إلا الإبهام ‏\"‏ فإن هؤلاء يجمعن لك دينك ودنياك ‏\"‏ ‏.‏",
      "text_en": " Abu Malik, Sa'd Bin Tariq, narrated from his father that :                     when a man had come to the Messenger of Allah (saas), he heard him say: \"O Messenger of Allah, what should I say when I ask of Allah?\" He said: \"Say: Allahumma-ghfirli warhamni wa 'afini warzuqni (O Allah, forgive me, have mercy on me, keep me safe and sound and grant me provision),\" and he held up his four fingers apart from the thumb and said: \"These combine your religious and worldly affairs.\"",
      "chain": [
        "20436",
        "20472"
      ]
    },
    {
      "hadith_no": "3849",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر، وعلي بن محمد، قالا حدثنا عبيد بن سعيد، قال سمعت شعبة، عن يزيد بن خمير، قال سمعت سليم بن عامر، يحدث عن أوسط بن إسماعيل البجلي، أنه سمع أبا بكر، حين قبض النبي  صلى الله عليه وسلم  يقول قام رسول الله  صلى الله عليه وسلم  في مقامي هذا عام الأول ثم بكى أبو بكر ثم قال ‏\"‏ عليكم بالصدق فإنه مع البر وهما في الجنة وإياكم والكذب فإنه مع الفجور وهما في النار وسلوا الله المعافاة فإنه لم يؤت أحد بعد اليقين خيرا من المعافاة ولا تحاسدوا ولا تباغضوا ولا تقاطعوا ولا تدابروا وكونوا عباد الله إخوانا ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Awsat (bin Isma'il) Al-Bajali that :                     he heard Abu Bakr, when the Prophet (saas) had passed away, saying: \"The Messenger of Allah (saas) stood in this place where I am standing, last year.\" Then Abu Bakr wept, then he said: \"You must adhere to the truth, for with it comes righteousness and they both lead to Paradise. And you must beware of lying for with it comes immorality, and they both lead to Hell. Ask Allah for Al-Mu'afah, for no one is given anything after certainty that is better than Mu'afah. Do not envy one another, do not hate one another, do not sever ties with one another, do not turn your backs on one another and be, O slaves of Allah, brothers.\"",
      "chain": [
        "20436",
        "38409",
        "20665",
        "20020",
        "10981",
        "10915"
      ]
    },
    {
      "hadith_no": "3854",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر، حدثنا عبد الله بن إدريس، عن ابن عجلان، عن أبي الزناد، عن الأعرج، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ لا يقولن أحدكم اللهم اغفر لي إن شئت وليعزم في المسألة فإن الله لا مكره له ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the :                     Messenger of Allah (saas) said: \"No one among you should say: \"O Allah, forgive me if You will.' Let him be definite in his asking, and no one can compel Allah.\"",
      "chain": [
        "20436",
        "20102",
        "10616",
        "11061",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "3855",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر، حدثنا عيسى بن يونس، عن عبيد الله بن أبي زياد، عن شهر بن حوشب، عن أسماء بنت يزيد، قالت قال رسول الله  صلى الله عليه وسلم  ‏\"‏ اسم الله الأعظم في هاتين الآيتين ‏{وإلهكم إله واحد لا إله إلا هو الرحمن الرحيم}‏ وفاتحة سورة آل عمران ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Asma' bint Yazid that :                     the Messenger of Allah (saas) said: \"The Greatest Name of Allah is in these two Verses: And your Ilah (God) is One Ilah (God - Allah), La Ilaha Illa Huwa (none has the right to be worshipped but He), the Most Gracious, the Most Merciful.' And at the beginning of Surah Al 'Imran.\"",
      "chain": [
        "20436",
        "20347",
        "11044",
        "84"
      ]
    },
    {
      "hadith_no": "3862",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر، حدثنا عبد الله بن بكر السهمي، عن هشام الدستوائي، عن يحيى بن أبي كثير، عن أبي جعفر، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ ثلاث دعوات يستجاب لهن لا شك فيهن دعوة المظلوم ودعوة المسافر ودعوة الوالد لولده ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah that :                     the Messenger of Allah (saas) said: \"There are three supplications that will undoubtedly be answered: the supplication of one who has been wronged; the supplication of the traveler; and the supplication of a father for his child.\"",
      "chain": [
        "20436",
        "20244",
        "20295",
        "11449",
        "13"
      ]
    },
    {
      "hadith_no": "3867",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر، حدثنا الحسن بن موسى، حدثنا حماد بن سلمة، عن سهيل بن أبي صالح، عن أبيه، عن أبي عياش الزرقي، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من قال حين يصبح لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شىء قدير - كان له عدل رقبة من ولد إسماعيل وحط عنه عشر خطيئات ورفع له عشر درجات وكان في حرز من الشيطان حتى يمسي وإذا أمسى فمثل ذلك حتى يصبح ‏\"‏ ‏.‏ قال فرأى رجل رسول الله  صلى الله عليه وسلم  فيما يرى النائم فقال يا رسول الله إن أبا عياش يروي عنك كذا وكذا ‏.‏ فقال ‏\"‏ صدق أبو عياش ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu 'Ayyash Az-Zuraqi that :                     the Messenger of Allah (saas) said: \"Whoever says in the morning: 'La illaha illalahu wahdahu la sharika lahu, lahul-mulku wa lahul-hamdu, wa Huwa 'ala kulli shay'in Qadir (None has the right to be worshipped but Allah alone, with no partner or associate.  His is the dominion and all praise is to Him, and He is Able to all things)' - he will have (a reward) equal to freeing a slave among the sons of Isma'il, ten bad deeds will be erased from (his record), he will be raised (in status) ten degrees, and he will have protection against Satan until evening comes.  When evening comes, (if he says likewise) he will have the same until morning comes.'\" (Sahih)He (one of the narrators) said: \"A man saw the Messenger of Allah (saas) in a dream and said: 'O Messenger of Allah, Abu 'Ayyash narrated such and such from you.' He said: 'Abu 'Ayyash spoke the truth.'\"",
      "chain": [
        "20436",
        "20383",
        "20021",
        "11173",
        "11161"
      ]
    },
    {
      "hadith_no": "3874",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر، حدثنا عبد الله بن نمير، عن عبيد الله، عن سعيد بن أبي سعيد، عن أبي هريرة، أن رسول الله  صلى الله عليه وسلم  قال ‏\"‏ إذا أراد أحدكم أن يضطجع على فراشه فلينزع داخلة إزاره ثم لينفض بها فراشه فإنه لا يدري ما خلفه عليه ثم ليضطجع على شقه الأيمن ثم ليقل رب بك وضعت جنبي وبك أرفعه فإن أمسكت نفسي فارحمها وإن أرسلتها فاحفظها بما حفظت به عبادك الصالحين ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that:                     the Messenger of Allah (saas) said: \"When anyone of you wants to go to bed, let him undo the edge of his Izar (waist wrap) and dust of his bed with it, for he does not know what came to it after him. Then let him lie down on his right side and say: 'Rabbi bika wada'tu janbi wa bika arfa'uhu, fa in amsakta nafsi farhamha, wa in arsaltaha fahfazha bima hafizta bihi 'ibadikaas-salihin (O Lord, by Your leave I lie down and by Your leave I rise, so if You should take my soul then have mercy on it, and if You should return my soul then protect it as You protect Your righteous slaves).\"",
      "chain": [
        "20436",
        "20331",
        "11201",
        "11168",
        "13"
      ]
    },
    {
      "hadith_no": "3875",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر، حدثنا يونس بن محمد، وسعيد بن شرحبيل، أنبأنا الليث بن سعد، عن عقيل، عن ابن شهاب، أن عروة بن الزبير، أخبره عن عائشة، أن النبي  صلى الله عليه وسلم  كان إذا أخذ مضجعه نفث في يديه وقرأ بالمعوذتين ومسح بهما جسده ‏.‏",
      "text_en": " It was narrated from 'Aishah that:                     whenever the Prophet (saas) went to bed, he would blow into his hands, recite Al-Mu'awwidhatain, then wipe his hands over his body.",
      "chain": [
        "20436",
        "20393",
        "30194",
        "20023",
        "11207",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "3882",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر، حدثنا محمد بن بشر، ح وحدثنا علي بن محمد، حدثنا وكيع، جميعا عن عبد العزيز بن عمر بن عبد العزيز، حدثني هلال، مولى عمر بن عبد العزيز عن عمر بن عبد العزيز، عن عبد الله بن جعفر، عن أمه، أسماء ابنة عميس قالت علمني رسول الله  صلى الله عليه وسلم  كلمات أقولهن عند الكرب ‏\"‏ الله الله ربي لا أشرك به شيئا ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Asma’ bint ‘Umais said:                      “The Messenger of Allah (ﷺ) taught me some words to say at times of distress: Allah! Allahu Rabbi la ushriku bihi shay’an (Allah, Allah is my Lord, I do not associate anything with Him).”",
      "chain": [
        "20436",
        "20352",
        "38409",
        "20032",
        "20166",
        "11010",
        "108",
        "69"
      ]
    },
    {
      "hadith_no": "3888",
      "source": " Sunan Ibn Majah ",
      "chapter": "Supplication - كتاب الدعاء",
      "chapter_no": "34",
      "text_ar": "حدثنا أبو بكر، حدثنا عبد الرحيم بن سليمان، وأبو معاوية عن عاصم، عن عبد الله بن سرجس، قال كان رسول الله  صلى الله عليه وسلم  يقول - وقال عبد الرحيم يتعوذ - إذا سافر ‏\"‏ اللهم إني أعوذ بك من وعثاء السفر وكآبة المنقلب والحور بعد الكور ودعوة المظلوم وسوء المنظر في الأهل والمال ‏\"‏ ‏.‏ وزاد أبو معاوية فإذا رجع قال مثلها ‏.‏",
      "text_en": " It was narrated that ‘Abdullah bin Sarjis said:                      “The Messenger of Allah (ﷺ) used to say” – and (one of the narrators) ‘Abdur-Rahim said: “he used to seek refuge” – “when he traveled: ‘Allahumma inni a’udhu bika min wa’tha’is-safar, wa ka’abatil-munqalab, wal-hawri ba’dal-kawr, wa da’watil-mazlum, wa su’il-manzari fil-ahli wal-mal (O Allah, I seek refuge with You from the hardships of travel and the sorrows of return, from decrease after increase, from the prayer of the one who has been wronged, and seeing some calamity befall my family or wealth).’”(One of the narrators) Abu Mu’awiyah added: “And when he returned he said likewise.”",
      "chain": [
        "20436",
        "20334",
        "20354",
        "11080",
        "3245"
      ]
    },
    {
      "hadith_no": "3914",
      "source": " Sunan Ibn Majah ",
      "chapter": "Interpretation of Dreams - كتاب تعبير الرؤيا",
      "chapter_no": "35",
      "text_ar": "حدثنا أبو بكر، حدثنا هشيم، عن يعلى بن عطاء، عن وكيع بن عدس العقيلي، عن عمه أبي رزين، أنه سمع النبي  صلى الله عليه وسلم  يقول ‏\"‏ الرؤيا على رجل طائر ما لم تعبر فإذا عبرت وقعت ‏\"‏ ‏.‏ قال ‏\"‏ والرؤيا جزء من ستة وأربعين جزءا من النبوة ‏\"‏ ‏.‏ قال وأحسبه قال ‏\"‏ لا يقصها إلا على واد أو ذي رأى ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated from Abu Razin that he heard the Prophet (ﷺ) say:                     “Dreamsare attached to the foot of a bird* until they areinterpreted, thenwhen they are interpreted they come to pass.” Hesaid: “Anddreams are one of the forty-six parts of prophecy.” He (thenarrator) said: “And I think he said: ‘(A person) should not tellthemexcept to one whom he loves or one who is wise.’”",
      "chain": [
        "20436",
        "20468",
        "10986",
        "10826"
      ]
    },
    {
      "hadith_no": "3923",
      "source": " Sunan Ibn Majah ",
      "chapter": "Interpretation of Dreams - كتاب تعبير الرؤيا",
      "chapter_no": "35",
      "text_ar": "حدثنا أبو بكر، حدثنا معاوية بن هشام، حدثنا علي بن صالح، عن سماك، عن قابوس، قال قالت أم الفضل يا رسول الله رأيت كأن في بيتي عضوا من أعضائك قال ‏\"‏ خيرا رأيت تلد فاطمة غلاما فترضعيه ‏\"‏ ‏.‏ فولدت حسينا أو حسنا فأرضعته بلبن قثم قالت فجئت به إلى النبي  صلى الله عليه وسلم  فوضعته في حجره فبال فضربت كتفه فقال النبي  صلى الله عليه وسلم  ‏\"‏ أوجعت ابني رحمك الله ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that Qabus said:                      “Umm Fadl said: ‘O Messenger ofAllah!It is as if I saw (in a dream) one of your limbs in my house.’Hesaid: ‘What you have seen is good. Fatimah will give birth to a boyand you will breastfeed him.’ Fatimah gave birth to Husain orHasan,and I breastfed him with the milk of Qutham.’ She said: ‘Ibrought himto the Prophet (ﷺ) and placed him in his lap, and heurinated, so Istruck him on the shoulder.” The Prophet (ﷺ) said:“You have hurt myson, may Allah have mercy on you.”",
      "chain": [
        "20436",
        "20609",
        "20593",
        "10770",
        "15453"
      ]
    },
    {
      "hadith_no": "4106",
      "source": " Sunan Ibn Majah ",
      "chapter": "Tribulations - كتاب الفتن",
      "chapter_no": "36",
      "text_ar": "حدثنا أبو بكر، حدثنا أبو الأحوص، عن أبي حصين، عن أبي صالح، عن أبي هريرة، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من كان يؤمن بالله واليوم الآخر فليقل خيرا أو ليسكت ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ)said:                      “Whoever believes in Allah and the Last Day, let him saysomething good, or else remain silent.”",
      "chain": [
        "20436",
        "20327",
        "11371",
        "11161",
        "13"
      ]
    }
  ],
  "total_hadiths": 239
}