{
  "id": "20448",
  "name": "'Ali bin 'Ayyash علي بن عياش",
  "full_name": "'Ali bin 'Ayyash علي بن عياش",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "219",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Hims"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ خ  4  -  ثقة ثبت ]"
    ],
    "tags": [
      "al-Alhani",
      "al-Himsi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11684",
      "name": "Huraiz bin 'Uthman bin Jabir حريز بن عثمان بن جبر الرحبي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20179",
      "name": "Muhammad bin Matraf محمد بن مطرف",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20428",
      "name": "Shu'aib bin Abi Hamza شعيب بن أبي حمزة",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "17008",
      "name": "Thabit bin Thwban al-Nsy ثابت بن ثوبان العنسي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "32017",
      "name": "'Abdul 'Aziz bin Abi Salma b. 'Ubaidulla عبد العزيز بن أبي سلمة بن عبيد الله",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "20023",
      "name": "al-Laith bin Sa'd الليث بن سعد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "27047",
      "name": "al-Walid bin Kaml bin Mua'dh الوليد بن كامل بن معاذ",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "23061",
      "name": "al-Muthna bin al-Sabah المثنى بن الصباح",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28210",
      "name": "Sa'id bin Amarh bin Safwan سعيد بن عمارة بن صفوان",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "30516",
      "name": "Muhammad bin Sahl bin Askr محمد بن سهل بن عسكر",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "31908",
      "name": "Ibrahim bin al-Hythm al-Bldy إبراهيم بن الهيثم",
      "grade": "3rd Century AH"
    },
    {
      "id": "38589",
      "name": "Muhammad bin Masfa bin Bahlwal محمد بن مصفى بن بهلول",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "37534",
      "name": "Mhmwd bin Khalid محمود بن خالد",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38655",
      "name": "Musa bin Sahl bin Qadim موسى بن سهل بن قادم",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38088",
      "name": "Ibrahim bin Y'aqub bin Ishaq إبراهيم بن يعقوب بن إسحاق",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38433",
      "name": "'Amr bin Mnswr al-Nsa'iy عمرو بن منصور النسائي أبو سعيد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "37544",
      "name": "Yazid bin Muhammad يزيد بن محمد بن عبد الصمد",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "37513",
      "name": "'Abbas bin al-Walid al-Khalal عباس بن الوليد بن صبح",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30285",
      "name": "'Abdur Rahman bin Ibrahim عبد الرحمن بن إبراهيم - دحيم",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30511",
      "name": "Muhammad bin Ishaq al-Saghani محمد بن إسحاق الصغاني",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30554",
      "name": "Abu Zara' al-Razi أبو زرعة الرازي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38588",
      "name": "Muhammad bin Muslim bin al-Wara محمد بن مسلم بن عثمان - بن وارة",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38566",
      "name": "Muhammad bin Awf bin Sufyan محمد بن عوف بن سفيان الطائي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38696",
      "name": "Yahya bin Aktham bin Muhammad يحيى بن أكثم بن محمد بن قطن",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38363",
      "name": "Abd al-Whab bin Njd'h عبد الوهاب بن نجدة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38039",
      "name": "Ahmed bin Abd al-Whab أحمد بن عبد الوهاب بن نجدة",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "31463",
      "name": "Ahmed bin al-Farj bin Sulaiman أحمد بن الفرج بن سليمان",
      "grade": "3rd Century AH"
    },
    {
      "id": "38437",
      "name": "'Imran bin Bakar al-Kula'i عمران بن بكار الكلاعي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38279",
      "name": "Safwan bin 'Amr صفوان بن عمرو",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "614",
      "source": " Sahih Bukhari ",
      "chapter": "Call to Prayers (Adhaan) - كتاب الأذان",
      "chapter_no": "10",
      "text_ar": "حدثنا علي بن عياش، قال حدثنا شعيب بن أبي حمزة، عن محمد بن المنكدر، عن جابر بن عبد الله، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قال حين يسمع النداء اللهم رب هذه الدعوة التامة والصلاة القائمة آت محمدا الوسيلة والفضيلة وابعثه مقاما محمودا الذي وعدته، حلت له شفاعتي يوم القيامة ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Allah's Apostle said, \"Whoever after listening to the Adhan says, 'Allahumma Rabba hadhihi-dda` watit-tammah, was-salatil qa'imah, ati Muhammadan al-wasilata wal-fadilah, wa b`ath-hu maqaman mahmudan-il-ladhi wa`adtahu' [O Allah! Lord of this perfect call (perfect by not ascribing partners to You) and of the regular prayer which is going to be established, give Muhammad the right of intercession and illustriousness, and resurrect him to the best and the highest place in Paradise that You promised him (of)], then my intercession for him will be allowed on the Day of Resurrection\".",
      "chain": [
        "20448",
        "20428",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "2076",
      "source": " Sahih Bukhari ",
      "chapter": "Sales and Trade - كتاب البيوع",
      "chapter_no": "34",
      "text_ar": "حدثنا علي بن عياش، حدثنا أبو غسان، محمد بن مطرف قال حدثني محمد بن المنكدر، عن جابر بن عبد الله  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ رحم الله رجلا سمحا إذا باع، وإذا اشترى، وإذا اقتضى ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Allah's Apostle said, \"May Allah's mercy be on him who is lenient in his buying, selling, and in demanding back his money.\"",
      "chain": [
        "20448",
        "20179",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "3549",
      "source": " Sahih Bukhari ",
      "chapter": "Virtues and Merits of the Prophet (pbuh) and his Companions - كتاب المناقب",
      "chapter_no": "61",
      "text_ar": "حدثنا علي بن عياش، حدثنا حريز، قال حدثني عبد الواحد بن عبد الله النصري، قال سمعت واثلة بن الأسقع، يقول قال رسول الله صلى الله عليه وسلم ‏\"‏ إن من أعظم الفرى أن يدعي الرجل إلى غير أبيه، أو يري عينه ما لم تر، أو يقول على رسول الله صلى الله عليه وسلم ما لم يقل ‏\"‏‏.‏",
      "text_en": " Narrated Wathila bin Al-Asqa:                     Allah's Apostle said, \"Verily, one of the worst lies is to claim falsely to be the son of someone other than one's real father, or to claim to have had a dream one has not had, or to attribute to me what I have not said.\"",
      "chain": [
        "20448",
        "11672",
        "4049"
      ]
    },
    {
      "hadith_no": "4766",
      "source": " Sahih Bukhari ",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا علي بن عياش، حدثنا شعيب بن أبي حمزة، عن محمد بن المنكدر، عن جابر بن عبد الله  رضى الله عنهما  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من قال حين يسمع النداء اللهم رب هذه الدعوة التامة والصلاة القائمة، آت محمدا الوسيلة والفضيلة، وابعثه مقاما محمودا الذي وعدته، حلت له شفاعتي يوم القيامة ‏\"‏‏.‏ رواه حمزة بن عبد الله عن أبيه عن النبي صلى الله عليه وسلم‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     Allah's Apostle said, \"Whoever, after listening to the Adhan (for the prayer) says, 'O Allah, the Lord of this complete call and of this prayer, which is going to be established! Give Muhammad Al-Wasila and Al-Fadila and raise him to Al-Maqam-al-Mahmud which You have promised him,' will be granted my intercession for him on the Day of Resurrection.\"",
      "chain": [
        "20448",
        "20428",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "6090",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا علي بن عياش، حدثنا أبو غسان، قال حدثني محمد بن المنكدر، عن جابر بن عبد الله  رضى الله عنهما  عن النبي صلى الله عليه وسلم قال ‏\"‏ كل معروف صدقة ‏\"‏‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     The Prophet said, Enjoining, all that is good is a Sadaqa.\"",
      "chain": [
        "20448",
        "20179",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "6572",
      "source": " Sahih Bukhari ",
      "chapter": "To make the Heart Tender (Ar-Riqaq) - كتاب الرقاق",
      "chapter_no": "81",
      "text_ar": "حدثنا علي بن عياش، حدثنا أبو غسان، قال حدثني أبو حازم، عن سهل بن سعد الساعدي، قال نظر النبي صلى الله عليه وسلم إلى رجل يقاتل المشركين، وكان من أعظم المسلمين غناء عنهم فقال ‏\"‏ من أحب أن ينظر إلى رجل من أهل النار فلينظر إلى هذا ‏\"‏‏.‏ فتبعه رجل فلم يزل على ذلك حتى جرح، فاستعجل الموت‏.‏ فقال بذبابة سيفه، فوضعه بين ثدييه، فتحامل عليه، حتى خرج من بين كتفيه‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ إن العبد ليعمل فيما يرى الناس عمل أهل الجنة، وإنه لمن أهل النار، ويعمل فيما يرى الناس عمل أهل النار وهو من أهل الجنة، وإنما الأعمال بخواتيمها ‏\"‏‏.‏",
      "text_en": " Narrated Sa`d bin Sahl As-Sa`idi:                     The Prophet looked at a man fighting against the pagans and he was one of the most competent persons fighting on behalf of the Muslims. The Prophet said, \"Let him who wants to look at a man from the dwellers of the (Hell) Fire, look at this (man).\" Another man followed him and kept on following him till he (the fighter) was injured and, seeking to die quickly, he placed the blade tip of his sword between his breasts and leaned over it till it passed through his shoulders (i.e., committed suicide).\" The Prophet added, \"A person may do deeds that seem to the people as the deeds of the people of Paradise while in fact, he is from the dwellers of the (Hell) Fire: and similarly a person may do deeds that seem to the people as the deeds of the people of the (Hell) Fire while in fact, he is from the dwellers of Paradise. Verily, the (results of) deeds done, depend upon the last actions.\"",
      "chain": [
        "20448",
        "20179",
        "11172",
        "399"
      ]
    },
    {
      "hadith_no": "192",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا موسى بن سهل أبو عمران الرملي، حدثنا علي بن عياش، حدثنا شعيب بن أبي حمزة، عن محمد بن المنكدر، عن جابر، قال كان آخر الأمرين من رسول الله صلى الله عليه وسلم ترك الوضوء مما غيرت النار ‏.‏ قال أبو داود هذا اختصار من الحديث الأول ‏.‏",
      "text_en": " Jabir said:                      The last practice of the Messenger of Allah (ﷺ) was that he did not perform ablution after taking anything that was cooked with the help of fire.Abu Dawud said: This is the abridgment of the former tradition.",
      "chain": [
        "20448",
        "20428",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "529",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا علي بن عياش، حدثنا شعيب بن أبي حمزة، عن محمد بن المنكدر، عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال حين يسمع النداء اللهم رب هذه الدعوة التامة والصلاة القائمة آت محمدا الوسيلة والفضيلة وابعثه مقاما محمودا الذي وعدته إلا حلت له الشفاعة يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " Jabir b. ‘Abd Allah reported the Messenger of Allah (ﷺ) as saying:                      if anyone says when he hears the call to prayer : “O Allah, Lord of this perfect call and of the prayer which is established for all time, grant Muhammad the wasilah and excellency, and raise him up in a praiseworthy position which Thou hast promised, he will be assured of my intercession.",
      "chain": [
        "30007",
        "20448",
        "20428",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "693",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمود بن خالد الدمشقي، حدثنا علي بن عياش، حدثنا أبو عبيدة الوليد بن كامل، عن المهلب بن حجر البهراني، عن ضباعة بنت المقداد بن الأسود، عن أبيها، قال ما رأيت رسول الله صلى الله عليه وسلم يصلي إلى عود ولا عمود ولا شجرة إلا جعله على حاجبه الأيمن أو الأيسر ولا يصمد له صمدا ‏.‏",
      "text_en": " Narrated Al-Miqdad ibn al-Aswad:                     I never saw the Messenger of Allah (ﷺ) praying in front of a stick, a pillar, or a tree, without having it opposite his right or left eyebrow, and not facing it directly.",
      "chain": [
        "37534",
        "20448",
        "17068",
        "19497"
      ]
    },
    {
      "hadith_no": "2487",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن المصفى، حدثنا علي بن عياش، عن الليث بن سعد، حدثنا حيوة، عن ابن شفى، عن شفى بن ماتع، عن عبد الله، - هو ابن عمرو - عن النبي صلى الله عليه وسلم قال ‏\"‏ قفلة كغزوة ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     The Prophet (ﷺ) said: Returning home is like going on an expedition.",
      "chain": [
        "20448",
        "20023",
        "26010",
        "29"
      ]
    },
    {
      "hadith_no": "211",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن سهل بن عسكر البغدادي، وإبراهيم بن يعقوب، قالا حدثنا علي بن عياش الحمصي، حدثنا شعيب بن أبي حمزة، حدثنا محمد بن المنكدر، عن جابر بن عبد الله، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال حين يسمع النداء اللهم رب هذه الدعوة التامة والصلاة القائمة آت محمدا الوسيلة والفضيلة وابعثه مقاما محمودا الذي وعدته إلا حلت له الشفاعة يوم القيامة ‏\"‏ ‏.‏ قال أبو عيسى حديث جابر حديث صحيح حسن غريب من حديث محمد بن المنكدر لا نعلم أحدا رواه غير شعيب بن أبي حمزة عن محمد بن المنكدر ‏.‏ وأبو حمزة اسمه دينار ‏.‏",
      "text_en": " Jabir bin Abdullah narrated that :                     Allah's Messenger said: \"Whoever says, when he hears the call: (Allahumma, rabba hadhihidda 'watit-tammati was Salatilqa'imah, ati Muhammadanil wasilata wal-Fadilata, wab'athhu Maqamun Mahmudan alladhi wa'adtahu) 'O Allah! Lord of this perfect call and established prayer, grant Muhammad Al-Wasilah and Al-Fadilah, and raise him to the praised station that you promised him' - then intercession on the Day of Resurrection is made lawful for him.\"",
      "chain": [
        "30516",
        "38088",
        "20448",
        "20428",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "3537",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا إبراهيم بن يعقوب، حدثنا علي بن عياش، حدثنا عبد الرحمن بن ثابت بن ثوبان، عن أبيه، عن مكحول، عن جبير بن نفير، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ إن الله يقبل توبة العبد ما لم يغرغر ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏ حدثنا محمد بن بشار، حدثنا أبو عامر العقدي، عن عبد الرحمن بن ثابت بن ثوبان، عن أبيه، عن مكحول، عن جبير بن نفير، عن ابن عمر، عن النبي صلى الله عليه وسلم نحوه بمعناه ‏.‏",
      "text_en": " Ibn Umar narrated that the Prophet said:                     “Indeed Allah accepts the repentance of a slave as long as (his soul does not reach his throat).”",
      "chain": [
        "38088",
        "20448",
        "20731",
        "11066",
        "4097",
        "18"
      ]
    },
    {
      "hadith_no": "186",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Purification - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا علي بن عياش، قال حدثنا شعيب، عن محمد بن المنكدر، قال سمعت جابر بن عبد الله، قال كان آخر الأمرين من رسول الله صلى الله عليه وسلم ترك الوضوء مما مست النار ‏.‏",
      "text_en": "",
      "chain": [
        "38433",
        "20448",
        "20428",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "688",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Adhan (The Call to Prayer) - كتاب الأذان",
      "chapter_no": "7",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا علي بن عياش، قال حدثنا شعيب، عن محمد بن المنكدر، عن جابر، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من قال حين يسمع النداء اللهم رب هذه الدعوة التامة والصلاة القائمة آت محمدا الوسيلة والفضيلة وابعثه المقام المحمود الذي وعدته إلا حلت له شفاعتي يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir said:                      \"The Messenger of Allah (ﷺ) said: 'Whoever says, when he hears the call to prayer: \"Allahumma rabba hadhihid-da'wat it-tammah was-salat il-qaimah, ati Muahmmadan al-wasilah wal-fadilah, wab'athu maqaman mahmudan alladhi wa'adtahu (O Allah, Lord of this perfect call and the prayer to be offered, grant Muhammad the privilege (of interceding) and also the eminence, and resurrect him to the praised position that you have promised),' will be granted my intercession on the Day of Resurrection.\"",
      "chain": [
        "38433",
        "20448",
        "20428",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "876",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Commencement of the Prayer - كتاب الافتتاح",
      "chapter_no": "11",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا علي بن عياش، قال حدثنا شعيب، عن الزهري، قال حدثني سالم، ح وأخبرني أحمد بن محمد بن المغيرة، قال حدثنا عثمان، - هو ابن سعيد - عن شعيب، عن محمد، - وهو الزهري - قال أخبرني سالم بن عبد الله بن عمر، عن ابن عمر، قال رأيت رسول الله صلى الله عليه وسلم إذا افتتح التكبير في الصلاة رفع يديه حين يكبر حتى يجعلهما حذو منكبيه وإذا كبر للركوع فعل مثل ذلك ثم إذا قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ فعل مثل ذلك وقال ‏\"‏ ربنا ولك الحمد ‏\"‏ ‏.‏ ولا يفعل ذلك حين يسجد ولا حين يرفع رأسه من السجود ‏.‏",
      "text_en": " It was narrated that Ibn Umar said:                     I saw the Messenger of Allah (ﷺ) when he said the opening Takbir of the prayer, raise his hands until they were level with his shoulders. When he said the Takbir before bowing he did likewise, and when he said: 'Sami Allahu liman hamidah (Allah hears those who praise Him),' he did likewise, then he said: 'Rabbana wa lakal-hamd (Our Lord, to You be praise).' But he did not do that when he prostrated or when he raised his head from prostration.",
      "chain": [
        "38433",
        "20448",
        "20428",
        "11013",
        "11011",
        "30304",
        "28388",
        "20239",
        "11011",
        "18"
      ]
    },
    {
      "hadith_no": "1762",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Qiyam Al-Lail (The Night Prayer) and Voluntary Prayers During the Day - كتاب قيام الليل وتطوع النهار",
      "chapter_no": "20",
      "text_ar": "أخبرنا عمرو بن منصور، قال حدثنا علي بن عياش، قال حدثنا شعيب، عن الزهري، قال أخبرني عروة، عن عائشة، قالت كان رسول الله صلى الله عليه وسلم إذا سكت المؤذن بالأولى من صلاة الفجر قام فركع ركعتين خفيفتين قبل صلاة الفجر بعد أن يتبين الفجر ثم يضطجع على شقه الأيمن ‏.‏",
      "text_en": " It was narrated that Aishah said:                     \"When the Muaddhin fell silent after the Adhan for the beginning of Fajr, he would pray two brief rak'ahs, then he would lie down on his right side.\"",
      "chain": [
        "38433",
        "20448",
        "20428",
        "11013",
        "10511",
        "53"
      ]
    },
    {
      "hadith_no": "2448",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا عمران بن بكار، قال حدثنا علي بن عياش، قال حدثنا شعيب، قال حدثني أبو الزناد، مما حدثه عبد الرحمن الأعرج، مما ذكر أنه سمع أبا هريرة، يحدث به قال قال رسول الله صلى الله عليه وسلم ‏\"‏ تأتي الإبل على ربها على خير ما كانت إذا هي لم يعط فيها حقها تطؤه بأخفافها وتأتي الغنم على ربها على خير ما كانت إذا لم يعط فيها حقها تطؤه بأظلافها وتنطحه بقرونها - قال - ومن حقها أن تحلب على الماء ألا لا يأتين أحدكم يوم القيامة ببعير يحمله على رقبته له رغاء فيقول يا محمد ‏.‏ فأقول لا أملك لك شيئا قد بلغت ‏.‏ ألا لا يأتين أحدكم يوم القيامة بشاة يحملها على رقبته لها يعار فيقول يا محمد ‏.‏ فأقول لا أملك لك شيئا قد بلغت - قال - ويكون كنز أحدهم يوم القيامة شجاعا أقرع يفر منه صاحبه ويطلبه أنا كنزك فلا يزال حتى يلقمه أصبعه ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah said:                     \"The Messenger of Allah said: '(On the Day of Resurrection) camels will come to their owner in the best state of health that they ever had (in this world) and if he did not pay what was due on them, they will trample him with their hooves. Sheep willcome to their owner in the best state of health that they ever had (in this world) and if he did not pay what was due on them, they will trample him with their cloven hooves and gore him with their horns. And among their rights are that they should be milked with water in the front of them. I do not want any one of you to come on the Day of Resurrection with a groaning camel on his neck, saying , O Muhammad, and I will say: I cannot do anything for you, I conveyed the message. I do not  want any one of you to come on the Day of Resurrection with a bleating sheep on his neck, saying, \"O Muhammad,\" and I will say: \"I cannot do anything for you, I conveyed the message.\" And on the Day of Resurrection the hoarded treasure of one of you will be a blad-headed Shujaa[1]from which its owner will flee, but it will chase him (saying), I am your hoarded treasure, and it will keep (chasing him) until he gives it his finger to swallow.\"'",
      "chain": [
        "38437",
        "20448",
        "20428",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2464",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرني عمران بن بكار، قال حدثنا علي بن عياش، قال حدثنا شعيب، قال حدثني أبو الزناد، مما حدثه عبد الرحمن الأعرج، مما ذكر أنه سمع أبا هريرة، يحدث قال وقال عمر أمر رسول الله صلى الله عليه وسلم بصدقة فقيل منع ابن جميل وخالد بن الوليد وعباس بن عبد المطلب ‏.‏ فقال رسول الله صلى الله عليه وسلم ‏\"‏ ما ينقم ابن جميل إلا أنه كان فقيرا فأغناه الله وأما خالد بن الوليد فإنكم تظلمون خالدا قد احتبس أدراعه وأعتده في سبيل الله وأما العباس بن عبد المطلب عم رسول الله صلى الله عليه وسلم فهي عليه صدقة ومثلها معها ‏\"‏ ‏.‏",
      "text_en": " Abu Hurariah said:                     \"Umar said: 'The Messenger of Allah enjoined Sadaqah and it was said that Ibn Jamil, Khalid bin Al-Walid and 'Abbas bin 'Abdul-Muttalib had withheld some. The Messenger of Allah said: What is the matter with Ibn Jamil? Was he not poor then Allah made him rich? As for Khalid bin Al-Walid, you are being unfair to Khalid, for he is saving his shields and weapons for the sake of Allah. As for Al-Abbas bin 'Abdul-Muttalib, the paternal uncle of the Messenger of Allah, it is and obligatory charity for him and he has to pay as much again.\"'",
      "chain": [
        "38437",
        "20448",
        "20428",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "2523",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Zakah - كتاب الزكاة",
      "chapter_no": "23",
      "text_ar": "أخبرنا عمران بن بكار، قال حدثنا علي بن عياش، قال حدثنا شعيب، قال حدثني أبو الزناد، مما حدثه عبد الرحمن الأعرج، مما ذكر أنه سمع أبا هريرة، يحدث به عن رسول الله صلى الله عليه وسلم وقال ‏\"‏ قال رجل لأتصدقن بصدقة فخرج بصدقته فوضعها في يد سارق فأصبحوا يتحدثون تصدق على سارق فقال اللهم لك الحمد على سارق لأتصدقن بصدقة فخرج بصدقته فوضعها في يد زانية فأصبحوا يتحدثون تصدق الليلة على زانية فقال اللهم لك الحمد على زانية لأتصدقن بصدقة فخرج بصدقته فوضعها في يد غني فأصبحوا يتحدثون تصدق على غني قال اللهم لك الحمد على زانية وعلى سارق وعلى غني فأتي فقيل له أما صدقتك فقد تقبلت أما الزانية فلعلها أن تستعف به من زناها ولعل السارق أن يستعف به عن سرقته ولعل الغني أن يعتبر فينفق مما أعطاه الله عز وجل ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah said:                     \"A man said\" 'I am going to give some charity.' So he went out with his charity and put it in the hand of a thief. The next morning they started talking about how charity had been given to a thief. Then he said: 'O Allah, to You be praise for the thief. I am going to give some charity.' So he went out with his charity and put it in the hand of a prostitute. The next morning they started talking about how charity had been given to a prostitute. He said: 'O Allah, to You be praise for the prostitute. I am going to give some charity. So he went out with his charity and put it in the hand of a rich man. The next morning they started talking about how charity had been given to a rich man. He said: 'O Allah, th You be praise for the prostitute, the thief and the rich man. 'Then the message came to him: As for your charity, it is accepted. As for the prostitute, perhaps it will keep her from committing Zina. As for the thief, perhaps it will stop him from stealing. And as for the rich man, perhaps he will learn a lesson, and will spend from that which Allah, the Mighty and Sublime, has given him.\"'",
      "chain": [
        "38437",
        "20448",
        "20428",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "3438",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا عمران بن بكار، قال حدثنا علي بن عياش، قال حدثني شعيب، قال حدثني أبو الزناد، مما حدثه عبد الرحمن الأعرج، مما ذكر أنه سمع أبا هريرة، يحدث عن رسول الله صلى الله عليه وسلم قال قال ‏\"‏ انظروا كيف يصرف الله عني شتم قريش ولعنهم إنهم يشتمون مذمما ويلعنون مذمما وأنا محمد ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah said:                      \"Look at how Allah diverts the insults and curses of Quraish from me. They insult 'Mudhammam' and curse 'Mudhammam' -but I am Muhammad.\"",
      "chain": [
        "38437",
        "20448",
        "20428",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "3831",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا عمران بن بكار، قال حدثنا علي بن عياش، قال أنبأنا شعيب، قال حدثني أبو الزناد، مما حدثه عبد الرحمن الأعرج، مما ذكر أنه سمع أبا هريرة، يحدث به عن رسول الله صلى الله عليه وسلم قال ‏\"‏ قال سليمان بن داود لأطوفن الليلة على تسعين امرأة كلهن يأتي بفارس يجاهد في سبيل الله عز وجل فقال له صاحبه إن شاء الله ‏.‏ فلم يقل إن شاء الله فطاف عليهن جميعا فلم تحمل منهن إلا امرأة واحدة جاءت بشق رجل وايم الذي نفس محمد بيده لو قال إن شاء الله لجاهدوا في سبيل الله فرسانا أجمعين ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah said:                      \"Sulaiman bin Dawud said: 'Tonight I will go around ninety women, each of whom will bear a horseman who will perform Jihad in the cause of Allah.' His companion said to him: 'If Allah wills.' But he did not say: 'If Allah wills.' Then he went around to them all, but none of them got pregnant except a woman who bore half a man. By the One in Whose Hand is my soul! If he had said, 'If Allah wills,' they would all have performed Jihad in the cause of Allah as horsemen.\"",
      "chain": [
        "38437",
        "20448",
        "20428",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "4196",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of al-Bay'ah - كتاب البيعة",
      "chapter_no": "39",
      "text_ar": "أخبرنا عمران بن بكار، قال حدثنا علي بن عياش، قال حدثنا شعيب، قال حدثني أبو الزناد، مما حدثه عبد الرحمن الأعرج، مما ذكر أنه سمع أبا هريرة، يحدث عن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنما الإمام جنة يقاتل من ورائه ويتقى به فإن أمر بتقوى الله وعدل فإن له بذلك أجرا وإن أمر بغيره فإن عليه وزرا ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah narrated that the Messenger of Allah said:                     \"The Imam is like a shield whose orders should be obeyed when they (the Muslims) fight, and where they should seek protection. If he enjoins fear of Allah and behaves justly, then he will be rewarded, but if he enjoins otherwise, then it will be a burden (of sin) on him.\"",
      "chain": [
        "38437",
        "20448",
        "20428",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "5015",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book Of Faith and its Signs - كتاب الإيمان وشرائعه",
      "chapter_no": "47",
      "text_ar": "أخبرنا عمران بن بكار قال حدثنا علي بن عياش قال حدثنا شعيب قال حدثنا أبو الزناد مما حدثه عبد الرحمن بن هرمز مما ذكر أنه سمع أبا هريرة يحدث به  عن رسول الله صلى الله عليه وسلم قال والذي نفسي بيده لا يؤمن أحدكم حتى أكون أحب إليه من ولده ووالده",
      "text_en": " Abu Hurairah narrated that:                     The Messenger of Allah [SAW] said: \"By the One in Whose hand is my soul, none of you has believed until I am dearer to him than his son or his father.'\"",
      "chain": [
        "38437",
        "20448",
        "20428",
        "13"
      ]
    },
    {
      "hadith_no": "5402",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Etiquette of Judges - كتاب آداب القضاة",
      "chapter_no": "49",
      "text_ar": "أخبرنا عمران بن بكار بن راشد، قال حدثنا علي بن عياش، قال حدثنا شعيب، قال حدثني أبو الزناد، مما حدثه عبد الرحمن الأعرج، مما ذكر أنه سمع أبا هريرة، يحدث به عن رسول الله صلى الله عليه وسلم قال وقال ‏\"‏ بينما امرأتان معهما ابناهما جاء الذئب فذهب بابن إحداهما فقالت هذه لصاحبتها إنما ذهب بابنك ‏.‏ وقالت الأخرى إنما ذهب بابنك ‏.‏ فتحاكمتا إلى داود عليه السلام فقضى به للكبرى فخرجتا إلى سليمان بن داود فأخبرتاه فقال ائتوني بالسكين أشقه بينهما ‏.‏ فقالت الصغرى لا تفعل يرحمك الله هو ابنها ‏.‏ فقضى به للصغرى ‏\"‏ ‏.‏ قال أبو هريرة والله ما سمعت بالسكين قط إلا يومئذ ما كنا نقول إلا المدية ‏.‏",
      "text_en": " Abu Hurairah narrated that:                     The Messenger of Allah [SAW] said: \"There were two woman who had two children, and the wolf came and took away the son of one of them. She said to her companion: 'It took away your son.' The other one said: 'No, it took away your son.' They referred the matter to Dawud, peace be upon him, for judgment (about the remaining child) and he ruled in favor of the older one. Then they went out to Sulaiman bin Dawud and told him (about that). He said: 'Give me a knife and I will cut him in half (to be shared) between you.' The younger one said: 'Do not do that, may Allah have mercy on you; he is her son.' So he ruled that (the child) belonged to the younger woman.\" Abu Hurairah said: \"By Allah! I never heard 'Sikkin' used until that day. We would only say: 'Mudyah.'\"",
      "chain": [
        "38437",
        "20448",
        "20428",
        "11197",
        "13"
      ]
    },
    {
      "hadith_no": "722",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Adhan and the Sunnah Regarding It - كتاب الأذان والسنة فيها",
      "chapter_no": "3",
      "text_ar": "حدثنا محمد بن يحيى، والعباس بن الوليد الدمشقي، ومحمد بن أبي الحسين، قالوا حدثنا علي بن عياش الألهاني، حدثنا شعيب بن أبي حمزة، عن محمد بن المنكدر، عن جابر بن عبد الله، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ من قال حين يسمع النداء اللهم رب هذه الدعوة التامة والصلاة القائمة آت محمدا الوسيلة والفضيلة وابعثه مقاما محمودا الذي وعدته - إلا حلت له الشفاعة يوم القيامة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Jabir bin 'Abdullah said:                     \"The Messenger of Allah said: 'Whoever says when he hears the call to the prayer: \"Allahumma Rabba hadhihid-da'watit-tammah was-salatil-qa'imah, ati Muhammadanil-wasilata wal-fadilah, wab'athhu maqaman mahmudanilladhi wa'adtah (O Allah, Lord of this perfect call and the prayer to be offered, grant Muhammad the privilege (of intercession) and also the eminence, and resurrect him to the praised position that You have promised),\" my intercession for him will be permitted on the Day of Resurrection.'\"",
      "chain": [
        "11222",
        "20448",
        "20428",
        "11048",
        "34"
      ]
    },
    {
      "hadith_no": "3671",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا العباس بن الوليد الدمشقي، حدثنا علي بن عياش، حدثنا سعيد بن عمارة، أخبرني الحارث بن النعمان، سمعت أنس بن مالك، يحدث عن رسول الله  صلى الله عليه وسلم  أنه قال ‏\"‏ أكرموا أولادكم وأحسنوا أدبهم ‏\"‏ ‏.‏",
      "text_en": " Anas bin Malik narrated that the Messenger of Allah(ﷺ) said:                     \"Be kind to your children, and perfect their manners.\"",
      "chain": [
        "20448",
        "19"
      ]
    }
  ],
  "total_hadiths": 26
}