{
  "id": "20449",
  "name": "'Ali bin al-Mubark al-Hna'iy علي بن المبارك الهنائي",
  "full_name": "'Ali bin al-Mubark al-Hna'iy علي بن المبارك الهنائي",
  "grade": "Succ. (Taba' Tabi') [7th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "Basra"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Hana'i",
      "Basri"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11295",
      "name": "'Abdul 'Aziz bin Suhaib عبد العزيز بن صهيب البناني",
      "grade": "Follower(Tabi') [4th generation]"
    },
    {
      "id": "11015",
      "name": "Ayoub al-Sakhtiyani أيوب السختياني",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11065",
      "name": "Hisham bin 'Urwa هشام بن عروة",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11449",
      "name": "Yahya bin Abi Kathir يحيى بن أبي كثير الطائي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "11557",
      "name": "al-Hasan bin Muslim bin Yanaq الحسن بن مسلم بن يناق",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "19516",
      "name": "Krymh bint Hmam كريمة بنت همام",
      "grade": "Follower(Tabi') [3rd Generation]"
    }
  ],
  "students": [
    {
      "id": "20032",
      "name": "Waki' bin al-Jarrah وكيع بن الجراح",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20031",
      "name": "Yahya bin Sa'id bin Farroukh al-Qatan يحيى بن سعيد بن فروخ القطان",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20025",
      "name": "'Abdullah bin Mubarak عبد الله بن المبارك",
      "grade": "Succ. (Taba' Tabi') [8th generation]"
    },
    {
      "id": "20233",
      "name": "Salm bin Qutayba, Abu Qutayba سلم بن قتيبة الشعيري - أبو قتيبة",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "38160",
      "name": "al-Hasan bin Yahya bin Kathir الحسن بن يحيى بن كثير",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "24402",
      "name": "Muhammad bin 'Aabad al-Hana'i محمد بن عباد الهنائي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20261",
      "name": "'Uthman bin Abi Rawud al-Azdi عثمان بن أبي رواد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20231",
      "name": "Sa'id bin al-Rabi' سعيد بن الربيع",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20262",
      "name": "'Uthman bin 'Umar bin Fars عثمان بن عمر بن فارس",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    },
    {
      "id": "20285",
      "name": "Muslim bin Ibrahim al-Azdy مسلم بن إبراهيم الأزدي الفراهيدي",
      "grade": "Succ. (Taba' Tabi') [9th generation]"
    }
  ],
  "hadiths": [
    {
      "id": "sahih-bukhari-909",
      "hadith_no": "909",
      "source": "Sahih Bukhari",
      "chapter": "Friday Prayer - كتاب الجمعة",
      "chapter_no": "11",
      "text_ar": "حدثنا عمرو بن علي، قال حدثني أبو قتيبة، قال حدثنا علي بن المبارك، عن يحيى بن أبي كثير، عن عبد الله بن أبي قتادة  لا أعلمه إلا عن أبيه  عن النبي صلى الله عليه وسلم قال ‏\"‏ لا تقوموا حتى تروني، وعليكم السكينة ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin Abi Qatada on the authority of his father:                     The Prophet (p.b.u.h) said, \"Do not stand up (for prayer) unless you see me, and observe calmness and solemnity\".",
      "usc_msa_ref": "32",
      "chain": [
        "30153",
        "20233",
        "20449",
        "11449"
      ]
    },
    {
      "id": "sahih-bukhari-945",
      "hadith_no": "945",
      "source": "Sahih Bukhari",
      "chapter": "Fear Prayer - كتاب صلاة الخوف",
      "chapter_no": "12",
      "text_ar": "حدثنا يحيى، قال حدثنا وكيع، عن علي بن مبارك، عن يحيى بن أبي كثير، عن أبي سلمة، عن جابر بن عبد الله، قال جاء عمر يوم الخندق، فجعل يسب كفار قريش ويقول يا رسول الله ما صليت العصر حتى كادت الشمس أن تغيب‏.‏ فقال النبي صلى الله عليه وسلم ‏\"‏ وأنا والله ما صليتها بعد ‏\"‏‏.‏ قال فنزل إلى بطحان فتوضأ، وصلى العصر بعد ما غابت الشمس، ثم صلى المغرب بعدها‏.‏",
      "text_en": " Narrated Jabir bin `Abdullah:                     On the day of the Khandaq `Umar came, cursing the disbelievers of Quraish and said, \"O Allah's Apostle! I have not offered the `Asr prayer and the sun has set.\" The Prophet replied, \"By Allah! I too, have not offered the prayer yet. \"The Prophet then went to Buthan, performed ablution and performed the `Asr prayer after the sun had set and then offered the Maghrib prayer after it.\"",
      "usc_msa_ref": "67",
      "chain": [
        "30020",
        "20032",
        "20449",
        "11449",
        "10567",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-1853",
      "hadith_no": "1853",
      "source": "Sahih Bukhari",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا سعيد بن الربيع، حدثنا علي بن المبارك، عن يحيى، عن عبد الله بن أبي قتادة، أن أباه، حدثه قال انطلقنا مع النبي صلى الله عليه وسلم عام الحديبية فأحرم أصحابه، ولم أحرم، فأنبئنا بعدو بغيقة فتوجهنا نحوهم، فبصر أصحابي بحمار وحش، فجعل بعضهم يضحك إلى بعض، فنظرت فرأيته فحملت عليه الفرس، فطعنته، فأثبته، فاستعنتهم، فأبوا أن يعينوني، فأكلنا منه، ثم لحقت برسول الله صلى الله عليه وسلم وخشينا أن نقتطع، أرفع فرسي شأوا، وأسير عليه شأوا، فلقيت رجلا من بني غفار في جوف الليل فقلت أين تركت رسول الله صلى الله عليه وسلم فقال تركته بتعهن وهو قائل السقيا‏.‏ فلحقت برسول الله صلى الله عليه وسلم حتى أتيته فقلت يا رسول الله، إن أصحابك أرسلوا يقرءون عليك السلام ورحمة الله وبركاته، وإنهم قد خشوا أن يقتطعهم العدو دونك، فانظرهم، ففعل فقلت يا رسول الله، إنا اصدنا حمار وحش، وإن عندنا فاضلة‏.‏ فقال رسول الله صلى الله عليه وسلم لأصحابه ‏\"‏ كلوا ‏\"‏‏.‏ وهم محرمون‏.‏",
      "text_en": " Narrated `Abdullah bin Abu Qatada:                     That his father said \"We proceeded with the Prophet in the year of Al-Hudaibiya and his companions assumed Ihram but I did not. We were informed that some enemies were at Ghaiqa and so we went on towards them. My companions saw an onager and some of them started laughing among themselves. I looked and saw it. I chased it with my horse and stabbed and caught it. I wanted some help from my companions but they refused. (I slaughtered it all alone). We all ate from it (i.e. its meat). Then I followed Allah's Apostle lest we should be left behind. At times I urged my horse to run at a galloping speed and at other times at an ordinary slow speed. On the way I met a man from the tribe of Bani Ghifar at midnight. I asked him where he had left Allah's Apostle . The man replied that he had left the Prophet at a place called Ta'hun and he had the intention of having the midday rest at As-Suqya. So, I followed Allah's Apostle till I reached him and said, \"O Allah's Apostle! I have been sent by my companions who send you their greetings and compliments and ask for Allah's Mercy and Blessings upon you. They were afraid lest the enemy might intervene between you and them; so please wait for them.\" So he did. Then I said, \"O Allah's Apostle! We have hunted an onager and have some of it (i.e. its meat) left over.\" Allah's Apostle told his companions to eat the meat although all of them were in a state of Ihram.\"",
      "usc_msa_ref": "48",
      "chain": [
        "20231",
        "20449",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "id": "sahih-bukhari-1974",
      "hadith_no": "1974",
      "source": "Sahih Bukhari",
      "chapter": "Fasting - كتاب الصوم",
      "chapter_no": "30",
      "text_ar": "حدثنا إسحاق، أخبرنا هارون بن إسماعيل، حدثنا علي، حدثنا يحيى، قال حدثني أبو سلمة، قال حدثني عبد الله بن عمرو بن العاص  رضى الله عنهما  قال دخل على رسول الله صلى الله عليه وسلم فذكر الحديث يعني ‏\"‏ إن لزورك عليك حقا، وإن لزوجك عليك حقا ‏\"‏‏.‏ فقلت وما صوم داود قال ‏\"‏ نصف الدهر ‏\"‏‏.‏",
      "text_en": " Narrated `Abdullah bin `Amr bin Al-`As:                     \"Once Allah's Apostle came to me,\" and then he narrated the whole narration, i.e. your guest has a right on you, and your wife has a right on you. I then asked about the fasting of David. The Prophet replied, \"Half of the year,\" (i.e. he used to fast on every alternate day).",
      "usc_msa_ref": "195",
      "chain": [
        "30313",
        "20292",
        "20449",
        "11449",
        "10567",
        "29"
      ]
    },
    {
      "id": "sahih-bukhari-2036",
      "hadith_no": "2036",
      "source": "Sahih Bukhari",
      "chapter": "Retiring to a Mosque for Remembrance of Allah (I'tikaf) - كتاب الاعتكاف",
      "chapter_no": "33",
      "text_ar": "حدثني عبد الله بن منير، سمع هارون بن إسماعيل، حدثنا علي بن المبارك، قال حدثني يحيى بن أبي كثير، قال سمعت أبا سلمة بن عبد الرحمن، قال سألت أبا سعيد الخدري  رضى الله عنه  قلت هل سمعت رسول الله صلى الله عليه وسلم يذكر ليلة القدر قال نعم، اعتكفنا مع رسول الله صلى الله عليه وسلم العشر الأوسط من رمضان  قال  فخرجنا صبيحة عشرين، قال فخطبنا رسول الله صلى الله عليه وسلم صبيحة عشرين فقال ‏\"‏ إني أريت ليلة القدر، وإني نسيتها، فالتمسوها في العشر الأواخر في وتر، فإني رأيت أني أسجد في ماء وطين، ومن كان اعتكف مع رسول الله صلى الله عليه وسلم فليرجع ‏\"‏‏.‏ فرجع الناس إلى المسجد، وما نرى في السماء قزعة  قال  فجاءت سحابة فمطرت، وأقيمت الصلاة، فسجد رسول الله صلى الله عليه وسلم في الطين والماء، حتى رأيت الطين في أرنبته وجبهته‏.‏",
      "text_en": " Narrated Abu Salama bin `Abdur-Rahman:                     I asked Abu Sa`id Al-Khudri, \"Did you hear Allah's Apostle talking about the Night of Qadr?\" He replied in the affirmative and said, \"Once we were in I`tikaf with Allah's Apostle in the middle ten days of (Ramadan) and we came out of it in the morning of the twentieth, and Allah's Apostledelivered a sermon on the 20th (of Ramadan) and said, 'I was informed (of the date) of the Night of Qadr (in my dream) but had forgotten it. So, look for it in the odd nights of the last ten nights of the month of Ramadan. I saw myself prostrating in mud and water on that night (as a sign of the Night of Qadr). So, whoever had been in I`tikaf with Allah's Apostle should return for it.' The people returned to the mosque (for I`tikaf). There was no trace of clouds in the sky. But all of a sudden a cloud came and it rained. Then the prayer was established (they stood for the prayer) and Allah's Apostle prostrated in mud and water and I saw mud over the forehead and the nose of the Prophet.",
      "usc_msa_ref": "",
      "chain": [
        "30353",
        "20449",
        "11449",
        "10567",
        "38"
      ]
    },
    {
      "id": "sahih-bukhari-3195",
      "hadith_no": "3195",
      "source": "Sahih Bukhari",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا علي بن عبد الله، أخبرنا ابن علية، عن علي بن المبارك، حدثنا يحيى بن أبي كثير، عن محمد بن إبراهيم بن الحارث، عن أبي سلمة بن عبد الرحمن، كانت بينه وبين أناس خصومة في أرض، فدخل على عائشة فذكر لها ذلك، فقالت يا أبا سلمة اجتنب الأرض، فإن رسول الله صلى الله عليه وسلم قال ‏\"‏ من ظلم قيد شبر طوقه من سبع أرضين ‏\"‏‏.‏",
      "text_en": " Narrated Muhammad bin Ibrahim bin Al-Harith:                     from Abu Salama bin `Abdur-Rahman who had a dispute with some people on a piece of land, and so he went to `Aisha and told her about it. She said, \"O Abu Salama, avoid the land, for Allah's Apostle said, 'Any person who takes even a span of land unjustly, his neck shall be encircled with it down seven earths.' \"",
      "usc_msa_ref": "417",
      "chain": [
        "30026",
        "20208",
        "20449",
        "11449",
        "11213"
      ]
    },
    {
      "id": "sahih-bukhari-4202",
      "hadith_no": "4202",
      "source": "Sahih Bukhari",
      "chapter": "Military Expeditions led by the Prophet (pbuh) (Al-Maghaazi) - كتاب المغازى",
      "chapter_no": "64",
      "text_ar": "حدثنا سعيد بن الربيع، حدثنا علي بن المبارك، عن يحيى، عن عبد الله بن أبي قتادة، أن أباه، حدثه قال انطلقنا مع النبي صلى الله عليه وسلم عام الحديبية فأحرم أصحابه، ولم أحرم‏.‏",
      "text_en": " Narrated Abu Qatada:                     We set out with the Prophet in the year of Al-Hudaibiya, and all his companions assumed the state of Ihram but I did not.",
      "usc_msa_ref": "470",
      "chain": [
        "20231",
        "20449",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "id": "sahih-bukhari-4526",
      "hadith_no": "4526",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عثمان بن عمر، أخبرنا علي بن المبارك، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  قال كان أهل الكتاب يقرءون التوراة بالعبرانية، ويفسرونها بالعربية لأهل الإسلام، فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تصدقوا أهل الكتاب ولا تكذبوهم، وقولوا ‏{‏آمنا بالله وما أنزل‏}‏ الآية‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The people of the Scripture (Jews) used to recite the Torah in Hebrew and they used to explain it in Arabic to the Muslims. On that Allah's Apostle said, \"Do not believe the people of the Scripture or disbelieve them, but say:-- \"We believe in Allah and what is revealed to us.\" (2.136)",
      "usc_msa_ref": "12",
      "chain": [
        "30160",
        "20262",
        "20449",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-4971",
      "hadith_no": "4971",
      "source": "Sahih Bukhari",
      "chapter": "Prophetic Commentary on the Qur'an (Tafseer of the Prophet (pbuh)) - كتاب التفسير",
      "chapter_no": "65",
      "text_ar": "حدثنا يحيى، حدثنا وكيع، عن علي بن المبارك، عن يحيى بن أبي كثير، سألت أبا سلمة بن عبد الرحمن عن أول، ما نزل من القرآن‏.‏ قال ‏{‏يا أيها المدثر‏}‏ قلت يقولون ‏{‏اقرأ باسم ربك الذي خلق‏}‏ فقال أبو سلمة سألت جابر بن عبد الله رضى الله عنهما عن ذلك وقلت له مثل الذي قلت فقال جابر لا أحدثك إلا ما حدثنا رسول الله صلى الله عليه وسلم قال ‏\"‏ جاورت بحراء، فلما قضيت جواري هبطت فنوديت فنظرت عن يميني فلم أر شيئا، ونظرت عن شمالي فلم أر شيئا، ونظرت أمامي فلم أر شيئا، ونظرت خلفي فلم أر شيئا، فرفعت رأسي فرأيت شيئا، فأتيت خديجة فقلت دثروني وصبوا على ماء باردا  قال  فدثروني وصبوا على ماء باردا قال فنزلت ‏{‏يا أيها المدثر * قم فأنذر * وربك فكبر‏}‏ ‏\"‏‏.‏",
      "text_en": " Narrated Yahya bin Abi Kathir:                     I asked Aba Salama bin `Abdur-Rahman about the first Sura revealed of the Qur'an. He replied \"O you, wrapped-up (i.e. Al Muddaththir).\" I said, \"They say it was, 'Read, in the Name of your Lord Who created,' (i.e. Surat Al-`Alaq (the Clot).\" On that, Abu Salama said, \"I asked Jabir bin `Abdullah about that, saying the same as you have said, whereupon he said, 'I will not tell you except what Allah's Apostle had told us. Allah's Apostle said, \"I was in seclusion in the cave of Hiram', and after I completed the limited period of my seclusion. I came down (from the cave) and heard a voice calling me. I looked to my right, but saw nothing. Then I looked up and saw something. So I went to Khadija (the Prophet's wife) and told her to wrap me up and pour cold water on me. So they wrapped me up and poured cold water on me.\" Then, 'O you, (Muhammad) wrapped up! Arise and warn,' (Surat Al Muddaththir) was revealed.\" (74.1)",
      "usc_msa_ref": "444",
      "chain": [
        "30020",
        "20032",
        "20449",
        "11449",
        "10567",
        "34"
      ]
    },
    {
      "id": "sahih-bukhari-5896",
      "hadith_no": "5896",
      "source": "Sahih Bukhari",
      "chapter": "Dress - كتاب اللباس",
      "chapter_no": "77",
      "text_ar": "حدثني محمد بن بشار، حدثنا عثمان بن عمر، حدثنا علي بن المبارك، عن يحيى بن أبي كثير، عن عمران بن حطان، قال سألت عائشة عن الحرير، فقالت ائت ابن عباس فسله‏.‏ قال فسألته فقال سل ابن عمر‏.‏ قال فسألت ابن عمر فقال أخبرني أبو حفص  يعني عمر بن الخطاب  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إنما يلبس الحرير في الدنيا من لا خلاق له في الآخرة ‏\"‏‏.‏ فقلت صدق وما كذب أبو حفص على رسول الله صلى الله عليه وسلم‏.‏ وقال عبد الله بن رجاء حدثنا حرب عن يحيى حدثني عمران‏.‏ وقص الحديث‏.‏",
      "text_en": "",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20262",
        "20449",
        "11449",
        "11715",
        "53"
      ]
    },
    {
      "id": "sahih-bukhari-6116",
      "hadith_no": "6116",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عثمان بن عمر، حدثنا علي بن المبارك، عن يحيى بن أبي كثير، عن أبي قلابة، أن ثابت بن الضحاك، وكان، من أصحاب الشجرة حدثه أن رسول الله صلى الله عليه وسلم قال ‏\"‏ من حلف على ملة غير الإسلام فهو كما قال، وليس على ابن آدم نذر فيما لا يملك، ومن قتل نفسه بشىء في الدنيا عذب به يوم القيامة، ومن لعن مؤمنا فهو كقتله، ومن قذف مؤمنا بكفر فهو كقتله ‏\"‏‏.‏",
      "text_en": " Narrated Thabit bin Ad-Dahhak:                     (who was one of the companions who gave the pledge of allegiance to the Prophet underneath the tree (Al-Hudaibiya)) Allah's Apostle said, \"Whoever swears by a religion other than Islam (i.e. if somebody swears by saying that he is a non-Muslim e.g., a Jew or a Christian, etc.) in case he is telling a lie, he is really so if his oath is false, and a person is not bound to fulfill a vow about a thing which he does not possess. And if somebody commits suicide with anything in this world, he will be tortured with that very thing on the Day of Resurrection; And if somebody curses a believer, then his sin will be as if he murdered him; And whoever accuses a believer of Kufr (disbelief), then it is as if he killed him.\"",
      "usc_msa_ref": "73",
      "chain": [
        "30160",
        "20262",
        "20449",
        "11449",
        "11047",
        "1902"
      ]
    },
    {
      "id": "sahih-bukhari-6170",
      "hadith_no": "6170",
      "source": "Sahih Bukhari",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثنا محمد، وأحمد بن سعيد، قالا حدثنا عثمان بن عمر، أخبرنا علي بن المبارك، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة  رضى الله عنه  أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا قال الرجل لأخيه يا كافر فقد باء به أحدهما ‏\"‏‏.‏",
      "text_en": "      Narrated Abu Huraira:                          Allah's Apostle said, \"If a man says to his brother, O Kafir      (disbeliever)!' Then surely one of them is such (i.e., a Kafir). \"",
      "usc_msa_ref": "",
      "chain": [
        "30213",
        "30296",
        "20262",
        "20449",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-7429",
      "hadith_no": "7429",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثنا سعيد بن الربيع، حدثنا علي بن المبارك، عن يحيى بن أبي كثير، حدثني عكرمة، عن ابن عباس، أن عمر  رضى الله عنه  حدثه قال حدثني النبي صلى الله عليه وسلم قال ‏\"‏ أتاني الليلة آت من ربي وهو بالعقيق أن صل في هذا الوادي المبارك وقل عمرة وحجة ‏\"‏‏.‏ وقال هارون بن إسماعيل حدثنا علي عمرة في حجة‏.‏",
      "text_en": " Narrated `Umar:                     The Prophet said to me, \"Someone came to me tonight from my Lord while I was in the 'Aqiq (valley), and said to me, \"Offer prayer in this blessed valley and say: 'Labbaik' for the (performance of) `Umra and Hajj.\"",
      "usc_msa_ref": "442",
      "chain": [
        "20231",
        "20449",
        "11449",
        "11023",
        "17",
        "3"
      ]
    },
    {
      "id": "sahih-bukhari-7449",
      "hadith_no": "7449",
      "source": "Sahih Bukhari",
      "chapter": "Holding Fast to the Qur'an and Sunnah - كتاب الاعتصام بالكتاب والسنة",
      "chapter_no": "97",
      "text_ar": "حدثني محمد بن بشار، حدثنا عثمان بن عمر، أخبرنا علي بن المبارك، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، قال كان أهل الكتاب يقرءون التوراة بالعبرانية ويفسرونها بالعربية لأهل الإسلام فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تصدقوا أهل الكتاب، ولا تكذبوهم وقولوا ‏{‏آمنا بالله وما أنزل إلينا وما أنزل إليكم‏}‏ ‏\"‏‏.‏ الآية‏.‏",
      "text_en": " Narrated Abu Huraira:                     The people of the Book used to read the Torah in Hebrew and then explain it in Arabic to the Muslims. Allah's Apostle said (to the Muslims). \"Do not believe the people of the Book, nor disbelieve them, but say, 'We believe in Allah and whatever is revealed to us, and whatever is revealed to you.' \"",
      "usc_msa_ref": "460",
      "chain": [
        "30160",
        "20262",
        "20449",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-bukhari-7637",
      "hadith_no": "7637",
      "source": "Sahih Bukhari",
      "chapter": "Oneness; Uniqueness of Allah (Tawheed) - كتاب التوحيد",
      "chapter_no": "98",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عثمان بن عمر، أخبرنا علي بن المبارك، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، قال كان أهل الكتاب يقرءون التوراة بالعبرانية، ويفسرونها بالعربية لأهل الإسلام فقال رسول الله صلى الله عليه وسلم ‏\"‏ لا تصدقوا أهل الكتاب، ولا تكذبوهم و‏{‏قولوا آمنا بالله وما أنزل‏}‏ الآية ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     The people of the Scripture used to read the Torah in Hebrew and explain it to the Muslims in Arabic. Then Allah's Apostle said, \"Do not believe the people of the Scripture, and do not disbelieve them, but say, 'We believe in Allah and whatever has been revealed...' (3.84)",
      "usc_msa_ref": "632",
      "chain": [
        "30160",
        "20262",
        "20449",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-428",
      "hadith_no": "428",
      "source": "Sahih Muslim",
      "chapter": "The Book of Faith - كتاب الإيمان",
      "chapter_no": "2",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عثمان بن عمر، أخبرنا علي بن المبارك، عن يحيى بن أبي كثير، بهذا الإسناد وقال ‏\"‏ فإذا هو جالس على عرش بين السماء والأرض ‏\"‏ ‏.‏",
      "text_en": " Yahya b Abi Kathir has reported this hadith with the same chain of transmitters and narrated:                      And there he was sitting on the Throne between the heaven and the earth.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20262",
        "20449",
        "11449",
        "10567",
        "34"
      ]
    },
    {
      "id": "sahih-muslim-1319",
      "hadith_no": "1319",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثني حجاج بن الشاعر، حدثنا هارون بن إسماعيل الخزاز، حدثنا علي، - وهو ابن المبارك - حدثنا يحيى، حدثنا أبو سلمة، حدثنا أبو هريرة، أن رسول الله صلى الله عليه وسلم صلى ركعتين من صلاة الظهر ثم سلم فأتاه رجل من بني سليم فقال يا رسول الله أقصرت الصلاة أم نسيت وساق الحديث ‏.‏",
      "text_en": " Abu Huraira reported:                      The Messenger of Allah (may peace be upon him) said two rak'ahs of the noon prayer and then gave salutation when a man from Band Sulaim came to him and said: Messenger of Allah. has the prayer been shortened, or have you forgotten? -and the rest of the hadith is the same.",
      "usc_msa_ref": "",
      "chain": [
        "38834",
        "20449",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-1463",
      "hadith_no": "1463",
      "source": "Sahih Muslim",
      "chapter": "The Book of Mosques and Places of Prayer - كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
      "chapter_no": "6",
      "text_ar": "وحدثنا أبو بكر بن أبي شيبة، وإسحاق بن إبراهيم، قال أبو بكر حدثنا وقال، إسحاق أخبرنا وكيع، عن علي بن المبارك، عن يحيى بن أبي كثير، في هذا الإسناد بمثله ‏.‏",
      "text_en": " This hadith has been reported by Yahya b. Abd Kathir with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30123",
        "20436",
        "30312",
        "20032",
        "20449"
      ]
    },
    {
      "id": "sahih-muslim-2379",
      "hadith_no": "2379",
      "source": "Sahih Muslim",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "وحدثني أبو بكر بن نافع العبدي، حدثنا يحيى بن كثير، حدثنا علي، - يعني ابن المبارك - حدثنا يحيى، عن زيد بن سلام، عن جده أبي سلام، قال حدثني عبد الله، بن فروخ أنه سمع عائشة، تقول قال رسول الله صلى الله عليه وسلم ‏\"‏ خلق كل إنسان ‏\"‏ ‏.‏ بنحو حديث معاوية عن زيد ‏.‏ وقال ‏\"‏ فإنه يمشي يومئذ ‏\"‏ ‏.‏",
      "text_en": " This hadith has been narrated by 'A'isha through anothr chain of transmitters in which she reported Allah's Messenger (may peace be ulon him) as saying:                     \" Every man is created\" ; the rest of the hadith is the same and he said:\" He walks on that day.\"",
      "usc_msa_ref": "",
      "chain": [
        "20302",
        "20449",
        "11449",
        "10912",
        "24242"
      ]
    },
    {
      "id": "sahih-muslim-2570",
      "hadith_no": "2570",
      "source": "Sahih Muslim",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "حدثنا أبو بكر بن أبي شيبة، وأبو كريب قال أبو بكر حدثنا وكيع، عن علي، بن مبارك عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، - رضى الله عنه - قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقدموا رمضان بصوم يوم ولا يومين إلا رجل كان يصوم صوما فليصمه ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira (Allah be pleased with him) reported Allah's Messenger (may peace be upon him) as saying:                      Do not observe fast for a day, or two days ahead of Ramadan except a person who is in the habit of observing a particular fast; he may fast on that day.",
      "usc_msa_ref": "",
      "chain": [
        "30201",
        "30216",
        "20436",
        "20032",
        "20449",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "id": "sahih-muslim-3403",
      "hadith_no": "3403",
      "source": "Sahih Muslim",
      "chapter": "The Book of Pilgrimage - كتاب الحج",
      "chapter_no": "16",
      "text_ar": "وحدثنا زهير بن حرب، حدثنا إسماعيل ابن علية، عن علي بن المبارك، حدثنا يحيى بن أبي كثير، حدثنا أبو سعيد، مولى المهري عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ اللهم بارك لنا في صاعنا ومدنا واجعل مع البركة بركتين‏\"‏.",
      "text_en": " Abu Sa'id al-Kbudri (Allah be pleased with him) reported that Allah's Messenger (may peace be upon him) said:                      O Allah, bless us in our sa' and mud and shower with its blessings two other blessings (multiply blessings showerted upon it).",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20208",
        "20449",
        "11449",
        "10992",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-5013",
      "hadith_no": "5013",
      "source": "Sahih Muslim",
      "chapter": "The Book on Government - كتاب الإمارة",
      "chapter_no": "34",
      "text_ar": "وحدثنا زهير بن حرب، حدثنا إسماعيل ابن علية، عن علي بن المبارك، حدثنا  يحيى بن أبي كثير، حدثني أبو سعيد، مولى المهري عن أبي سعيد الخدري، أن رسول الله صلى الله عليه وسلم بعث بعثا إلى بني لحيان - من هذيل - فقال ‏\"‏ لينبعث من كل رجلين أحدهما والأجر بينهما ‏\"‏ ‏.‏",
      "text_en": " It has been narrated on the authority of Abu Sa'id Khudri that the Messenger of Allah (may peace be upon him) sent a force to Banu Lihyan (who are from Banu Hudhail, and said:                      One man from every two and the reward (will be divided) between the two.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20208",
        "20449",
        "11449",
        "10992",
        "38"
      ]
    },
    {
      "id": "sahih-muslim-5271",
      "hadith_no": "5271",
      "source": "Sahih Muslim",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "37",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عثمان بن عمر، أخبرنا علي، - وهو ابن المبارك - عن يحيى، عن أبي سلمة، عن أبي قتادة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تنتبذوا الزهو والرطب جميعا ولا تنتبذوا الرطب والزبيب جميعا ولكن انتبذوا كل واحد على حدته ‏\"‏ ‏.‏ وزعم يحيى أنه لقي عبد الله بن أبي قتادة فحدثه عن أبيه عن النبي صلى الله عليه وسلم بمثل هذا ‏.‏",
      "text_en": " Abu Qatada reported Allah's Messenger (may peace be upon him) as saying:                      Do not prepare Nabidh by mixing nearly ripe and fresh dates and do not prepare Nabidh by mixing together fresh dates and grapes, but prepare Nabidh out of each (one of them) separately. Yahya stated that he had met 'Abdullah b. Abu Qatada and he narrated it on the authority of his father that Allah's Apostle (may peace be upon him) said this. This hadith has been narrated on the authority of Yahya b. Abu Kathir through these two chains of transmitters but with a slight variation of words.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20262",
        "20449",
        "11449",
        "10567",
        "391"
      ]
    },
    {
      "id": "sahih-muslim-5556",
      "hadith_no": "5556",
      "source": "Sahih Muslim",
      "chapter": "The Book Pertaining to Clothes and Decoration - كتاب اللباس والزينة",
      "chapter_no": "38",
      "text_ar": "وحدثنا زهير بن حرب، حدثنا يزيد بن هارون، أخبرنا هشام، ح وحدثنا أبوبكر بن أبي شيبة حدثنا وكيع، عن علي بن المبارك، كلاهما عن يحيى بن أبي كثير، بهذاالإسناد وقالا عن خالد بن معدان، ‏.‏",
      "text_en": " This hadith has been reported on the authority of Yahya b. Abu Kathir with the same chain of trarnmitteis.",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20472",
        "20295",
        "20032",
        "20449"
      ]
    },
    {
      "id": "sahih-muslim-6051",
      "hadith_no": "6051",
      "source": "Sahih Muslim",
      "chapter": "The Book of Vision - كتاب الرؤيا",
      "chapter_no": "43",
      "text_ar": "وحدثنا محمد بن المثنى، حدثنا عثمان بن عمر، حدثنا علي، - يعني ابن المبارك - ح وحدثنا أحمد بن المنذر، حدثنا عبد الصمد، حدثنا حرب، - يعني ابن شداد - كلاهما عن يحيى بن أبي كثير، بهذا الإسناد ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Yahyi b. Abu Kathir with the same chain of transmitters.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20262",
        "20449",
        "20250",
        "20220"
      ]
    },
    {
      "id": "sunan-abi-daud-653",
      "hadith_no": "653",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا علي بن المبارك، عن حسين المعلم، عن عمرو بن شعيب، عن أبيه، عن جده، قال رأيت رسول الله صلى الله عليه وسلم يصلي حافيا ومنتعلا ‏.‏",
      "text_en": " Narrated Abdullah ibn Amr ibn al-'As:                     I saw the Messenger of Allah (ﷺ) praying both  barefooted and wearing sandals.",
      "usc_msa_ref": "",
      "chain": [
        "20285",
        "20449",
        "11278",
        "19934",
        "19911"
      ]
    },
    {
      "id": "sunan-abi-daud-921",
      "hadith_no": "921",
      "source": "Sunan Abi Da'ud",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا مسلم بن إبراهيم، حدثنا علي بن المبارك، عن يحيى بن أبي كثير، عن ضمضم بن جوس، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ اقتلوا الأسودين في الصلاة الحية والعقرب ‏\"‏ ‏.‏",
      "text_en": " Narrated AbuHurayrah:                     The Prophet (ﷺ) said: Kill the two black things during prayer, the snake and scorpion.",
      "usc_msa_ref": "",
      "chain": [
        "20285",
        "20449",
        "11449",
        "19914",
        "13"
      ]
    },
    {
      "id": "sunan-abi-daud-2132",
      "hadith_no": "2132",
      "source": "Sunan Abi Da'ud",
      "chapter": "Marriage (Kitab Al-Nikah) - كتاب النكاح",
      "chapter_no": "12",
      "text_ar": "حدثنا محمد بن المثنى، حدثنا عثمان بن عمر، حدثنا علي، - يعني ابن المبارك - عن يحيى، عن يزيد بن نعيم، عن سعيد بن المسيب، أن رجلا، يقال له بصرة بن أكثم نكح امرأة فذكر معناه ‏.‏ وزاد وفرق بينهما ‏.‏ وحديث ابن جريج أتم ‏.‏",
      "text_en": " Sa'id b. al-Musayyab said:                      A man called Basrah b. Akhtam married a woman. The narrator then reported the rest of the tradition to the same effect. This version added: And he separated them. The tradition narrated by Ibn Juraij is perfect.",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20262",
        "20449",
        "11449",
        "11002"
      ]
    },
    {
      "id": "sunan-abi-daud-2187",
      "hadith_no": "2187",
      "source": "Sunan Abi Da'ud",
      "chapter": "Divorce (Kitab Al-Talaq) - كتاب الطلاق",
      "chapter_no": "13",
      "text_ar": "حدثنا زهير بن حرب، حدثنا يحيى بن سعيد، حدثنا علي بن المبارك، حدثني يحيى بن أبي كثير، أن عمر بن معتب، أخبره أن أبا حسن مولى بني نوفل أخبره أنه، استفتى ابن عباس في مملوك كانت تحته مملوكة فطلقها تطليقتين ثم عتقا بعد ذلك هل يصلح له أن يخطبها قال نعم قضى بذلك رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " Narrated Umar ibn Mu'tab:                     Abu Hasan, a client of Banu Nawfal asked Ibn Abbas: A slave had a wife who was a slave-girl. He divorced her by two pronouncements. Afterwards both of them were freed. Is it permissible for him to ask her in marriage again? He said: Yes. This is a decision given by the Messenger of Allah (ﷺ).",
      "usc_msa_ref": "",
      "chain": [
        "30022",
        "20031",
        "20449",
        "11449"
      ]
    },
    {
      "id": "sunan-abi-daud-4164",
      "hadith_no": "4164",
      "source": "Sunan Abi Da'ud",
      "chapter": "Combing the Hair (Kitab Al-Tarajjul) - كتاب الترجل",
      "chapter_no": "35",
      "text_ar": "حدثنا عبيد الله بن عمر، حدثنا يحيى بن سعيد، عن علي بن المبارك، عن يحيى بن أبي كثير، قال حدثتني كريمة بنت همام، أن امرأة، أتت عائشة - رضى الله عنها - فسألتها عن خضاب الحناء فقالت لا بأس به ولكني أكرهه كان حبيبي رسول الله صلى الله عليه وسلم يكره ريحه ‏.‏ قال أبو داود تعني خضاب شعر الرأس ‏.‏",
      "text_en": " Narrated Aisha, Ummul Mu'minin:                     Karimah, daughter of Hammam, told that a woman came to Aisha (Allah be pleased with her) and asked her about dyeing with henna. She replied: There is no harm, but I do not like it. My beloved, the Messenger of Allah (ﷺ), disliked its odour.Abu Dawud said: She meant the colour of hair of the head.",
      "usc_msa_ref": "",
      "chain": [
        "11201",
        "11062",
        "20449",
        "11449",
        "19516"
      ]
    },
    {
      "id": "jami-al-tirmidhi-390",
      "hadith_no": "390",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Salat (Prayer) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا علي بن حجر، حدثنا إسماعيل ابن علية، هو ابن إبراهيم عن علي بن المبارك، عن يحيى بن أبي كثير، عن ضمضم بن جوس، عن أبي هريرة، قال أمر رسول الله صلى الله عليه وسلم بقتل الأسودين في الصلاة الحية والعقرب ‏.‏ قال وفي الباب عن ابن عباس وأبي رافع ‏.‏ قال أبو عيسى حديث أبي هريرة حديث حسن صحيح ‏.‏ والعمل على هذا عند بعض أهل العلم من أصحاب النبي صلى الله عليه وسلم وغيرهم وبه يقول أحمد وإسحاق ‏.‏ وكره بعض أهل العلم قتل الحية والعقرب في الصلاة ‏.‏ وقال إبراهيم إن في الصلاة لشغلا ‏.‏ والقول الأول أصح ‏.‏",
      "text_en": " Abu Hurairah narrated:                     \"Allah's Messenger (S) ordered killing the two black things in Salat; the snake and the scorpion.\"",
      "usc_msa_ref": "",
      "chain": [
        "20387",
        "20208",
        "20449",
        "11449",
        "19914",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-685",
      "hadith_no": "685",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا هناد، حدثنا وكيع، عن علي بن المبارك، عن يحيى بن أبي كثير، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لا تقدموا شهر رمضان بصيام قبله بيوم أو يومين إلا أن يكون رجل كان يصوم صوما فليصمه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏",
      "text_en": " Abu Hurairah narrated that :                     the Messenger of Allah said: \"Do no precede the month of Ramadan by fasting a day or two before it, unless it is the case of a man who normally performs some fast, then let him fast it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30480",
        "20032",
        "20449",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1240",
      "hadith_no": "1240",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Divorce and Li'an - كتاب الطلاق واللعان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "13",
      "text_ar": "حدثنا إسحاق بن منصور، أنبأنا هارون بن إسماعيل الخزاز، أنبأنا علي بن المبارك، أنبأنا يحيى بن أبي كثير، أنبأنا أبو سلمة، ومحمد بن عبد الرحمن بن ثوبان، أن سلمان بن صخر الأنصاري، أحد بني بياضة جعل امرأته عليه كظهر أمه حتى يمضي رمضان فلما مضى نصف من رمضان وقع عليها ليلا فأتى رسول الله صلى الله عليه وسلم فذكر ذلك له فقال له رسول الله صلى الله عليه وسلم ‏\"‏ أعتق رقبة ‏\"‏ ‏.‏ قال لا أجدها ‏.‏ قال ‏\"‏ فصم شهرين متتابعين ‏\"‏ ‏.‏ قال لا أستطيع ‏.‏ قال ‏\"‏ أطعم ستين مسكينا ‏\"‏ ‏.‏ قال لا أجد ‏.‏ فقال رسول الله صلى الله عليه وسلم لفروة بن عمرو ‏\"‏ أعطه ذلك العرق ‏\"‏ ‏.‏ وهو مكتل يأخذ خمسة عشر صاعا أو ستة عشر صاعا فقال ‏\"‏ أطعم ستين مسكينا ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏ يقال سلمان بن صخر ويقال سلمة بن صخر البياضي ‏.‏ والعمل على هذا الحديث عند أهل العلم في كفارة الظهار ‏.‏",
      "text_en": " Abu Salamah and Muhammad bin Abdur-Rahman (bin Thawban) narrated that :                     Salman bin Sakhr Al-Ansari - from Banu Bayadah -  said that his wife was like the back of his mother to him until Ramadan passed. After half of Ramadan had passed he had intercourse with his wife during the night. So he went to the Messenger of Allah to mention that to him. The Messenger of Allah said to him: \"Free a slave.\" He said: \"I don't have one.\" So he said: \"Then fast two consecutive months.\" He said: \"I am unable.\" He said: \"Feed sixty needy people.\" He said: \"I can not.\" So the Messenger of Allah said to Farwah bin Amr: \"Give him that Araq - and it is a large basket that holds fifteen or sixteen Sa - to feed sixty needy people.\"",
      "usc_msa_ref": "",
      "chain": [
        "30313",
        "20292",
        "20449",
        "11449",
        "10567",
        "11218"
      ]
    },
    {
      "id": "jami-al-tirmidhi-1642",
      "hadith_no": "1642",
      "source": "Jami' al-Tirmidhi",
      "chapter": "The Book on Virtues of Jihad - كتاب فضائل الجهاد عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "22",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عثمان بن عمر، أخبرنا علي بن المبارك، عن يحيى بن أبي كثير، عن عامر العقيلي، عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ عرض على أول ثلاثة يدخلون الجنة شهيد وعفيف متعفف وعبد أحسن عبادة الله ونصح لمواليه ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     That the Messenger of Allah (ﷺ) said, \"I was shown the first of (every) three to enter Paradise: A martyr, an 'Atif, who is a Muta'affif, and a slave who perfected his worship of Allah, and was sincere to his masters.\"[Abu 'Eisa said:] This Hadith is Hasan.",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20262",
        "20449",
        "11449",
        "13"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2202",
      "hadith_no": "2202",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Medicine - كتاب الطب عن رسول اللَّهِ صلى الله عليه وسلم",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو حفص، عمرو بن علي حدثنا يحيى بن كثير أبو غسان العنبري، حدثنا علي بن المبارك، عن يحيى بن أبي كثير، حدثني حية بن حابس التميمي، حدثني أبي أنه، سمع رسول الله صلى الله عليه وسلم يقول ‏\"‏ لا شىء في الهام والعين حق ‏\"‏ ‏.‏",
      "text_en": " \"Hayyah bin Habis At-Tamimi narrated:                      My father narrated that he heard the Messenger of Allah (s.a.w) saying:\"There is nothing to Al-Ham, and the eye is real.\"",
      "usc_msa_ref": "",
      "chain": [
        "30286",
        "20302",
        "20449",
        "11449",
        "18235"
      ]
    },
    {
      "id": "jami-al-tirmidhi-2655-2",
      "hadith_no": "2655",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Knowledge - كتاب العلم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "41",
      "text_ar": "حدثنا علي بن نصر بن علي، حدثنا محمد بن عباد الهنائي، حدثنا علي بن المبارك، عن أيوب السختياني، عن خالد بن دريك، عن ابن عمر، عن النبي صلى الله عليه وسلم قال ‏\"‏ من تعلم علما لغير الله أو أراد به غير الله فليتبوأ مقعده من النار ‏\"‏ ‏.‏ وفي الباب عن جابر ‏.‏ قال أبو عيسى هذا حديث حسن غريب لا نعرفه من حديث أيوب إلا من هذا الوجه ‏.‏",
      "text_en": " Narrated Ibn 'Umar:                     that the Prophet (ﷺ) said: \"Whoever learns knowledge for other than (the sake of) Allah, or intends by it other than Allah, then let him take his seat in the Fire.\"",
      "usc_msa_ref": "",
      "chain": [
        "30557",
        "24402",
        "20449",
        "11015",
        "19906",
        "18"
      ]
    },
    {
      "id": "jami-al-tirmidhi-3395-2",
      "hadith_no": "3395",
      "source": "Jami' al-Tirmidhi",
      "chapter": "Chapters on Supplication - كتاب الدعوات عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "48",
      "text_ar": "حدثنا محمد بن بشار، حدثنا عثمان بن عمر، حدثنا علي بن المبارك، عن يحيى بن أبي كثير، عن يحيى بن إسحاق ابن أخي، رافع بن خديج عن رافع بن خديج، رضى الله عنه أن النبي صلى الله عليه وسلم قال ‏\"‏ إذا اضطجع أحدكم على جنبه الأيمن ثم قال اللهم إني أسلمت نفسي إليك ووجهت وجهي إليك وألجأت ظهري إليك وفوضت أمري إليك لا ملجأ ولا منجا منك إلا إليك أومن بكتابك وبرسلك ‏.‏ فإن مات من ليلته دخل الجنة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن غريب من هذا الوجه من حديث رافع بن خديج رضى الله عنه ‏.‏",
      "text_en": " Rafi bin Khadij narrated that:                     The Prophet said: “When one of you dies down on his right side, then says: ‘O Allah, I have submitted myself to You, and I have turned my face to You, and I lay myself down relying upon You, and I have entrusted my affair to You, there is no refuge [nor escape] from You except to You. I believe in Your Book and Your Messengers (Allahumma Inni Aslamtu Nafsi Ilaika Wa Wajjahtu Wajhi Ilaika, Wa Alja’tu Zahri Ilaika, Wa Fawwadtu Amri Ilaika, La Malja [Wa La Manja] Minka Illa Ilaik, Uminu Bikitabika Wa Birasulika)’ – then if he dies that night, he shall enter Paradise.”",
      "usc_msa_ref": "",
      "chain": [
        "30160",
        "20262",
        "20449",
        "11449",
        "30525",
        "1986"
      ]
    },
    {
      "id": "sunan-an-nasai-Grade-47",
      "hadith_no": "Grade",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Jumu'ah (Friday Prayer) - كتاب الجمعة",
      "chapter_no": "14",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا هارون بن إسماعيل، قال حدثنا علي، - وهو ابن المبارك - عن يحيى، عن محمد بن عبد الرحمن، عن ابنة حارثة بن النعمان، قالت حفظت ‏{‏ ق والقرآن المجيد ‏}‏ من في رسول الله صلى الله عليه وسلم وهو على المنبر يوم الجمعة ‏.‏",
      "text_en": " It was narrated from Muhammad bin 'Abdur-Rahman that:                     The daughter of Harithah bin An-Nu'man said: \"I memorized 'Qaf. By the Glorious Qur'an.'\" From the mouth of the Messenger of Allah (ﷺ) when he was on the minbar on Friday.\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20292",
        "20449",
        "11449",
        "11105"
      ]
    },
    {
      "id": "sunan-an-nasai-1481",
      "hadith_no": "1481",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Eclipses - كتاب الكسوف",
      "chapter_no": "16",
      "text_ar": "أخبرنا أبو بكر بن إسحاق، قال حدثنا أبو زيد، سعيد بن الربيع قال حدثنا علي بن المبارك، عن يحيى بن أبي كثير، قال حدثني أبو حفصة، مولى عائشة أن عائشة، أخبرته أنه، لما كسفت الشمس على عهد رسول الله صلى الله عليه وسلم توضأ وأمر فنودي أن الصلاة جامعة فقام فأطال القيام في صلاته ‏.‏ قالت عائشة فحسبت قرأ سورة البقرة ثم ركع فأطال الركوع ثم قال ‏\"‏ سمع الله لمن حمده ‏\"‏ ‏.‏ ثم قام مثل ما قام ولم يسجد ثم ركع فسجد ثم قام فصنع مثل ما صنع ركعتين وسجدة ثم جلس وجلي عن الشمس ‏.‏",
      "text_en": " Abu Hafs, the freed slave of 'Aishah, narrated that 'Aishah told him:                     \"When the sun was eclipsed during the time of the Messenger of Allah (ﷺ), he performed wudu' and ordered that the call be given: 'As-salatu jami'ah.' He stood for a long time in prayer,\" and 'Aishah said: \"I thought that he recited Surah Al-Baqarah. Then he bowed for a long time, then he said: Sami' Allahu liman hamidah. Then he bowed, then prostrated. Then he stood up and did the same again, bowing twice and prostrating once. Then he sat and the eclipse ended.\"",
      "usc_msa_ref": "",
      "chain": [
        "30511",
        "20231",
        "20449",
        "11449",
        "53"
      ]
    },
    {
      "id": "sunan-an-nasai-2138",
      "hadith_no": "2138",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا أبو داود، قال حدثنا هارون، قال حدثنا علي، - هو ابن المبارك - قال حدثنا يحيى، عن أبي سلمة، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ الشهر يكون تسعة وعشرين ويكون ثلاثين فإذا رأيتموه فصوموا وإذا رأيتموه فأفطروا فإن غم عليكم فأكملوا العدة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                     \"The Messenger of Allah said: The month may be twenty-nine days or it may be thirty. When you see it, then stop fasting, and it is obscured from you (too cloudy), then complete the count.\"'",
      "usc_msa_ref": "",
      "chain": [
        "30002",
        "20449",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "id": "sunan-an-nasai-2260",
      "hadith_no": "2260",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا إسحاق بن إبراهيم، قال أنبأنا وكيع، قال حدثنا علي بن المبارك، عن يحيى بن أبي كثير، عن محمد بن عبد الرحمن بن ثوبان، عن جابر بن عبد الله، رضى الله عنهما عن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس من البر الصيام في السفر عليكم برخصة الله عز وجل فاقبلوها ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Jabir bin 'Abdullah that the Messenger of Allah said:                     \"It is not righteousness to fast when traveling. Take to the concession which Allah, the mighty and sublime, has granted you, accept it.\"",
      "usc_msa_ref": "",
      "chain": [
        "30123",
        "20032",
        "20449",
        "11449",
        "11218",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-2261",
      "hadith_no": "2261",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا محمد بن المثنى، عن عثمان بن عمر، قال أنبأنا علي بن المبارك، عن يحيى، عن محمد بن عبد الرحمن، عن رجل، عن جابر، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ ليس من البر الصيام في السفر ‏\"‏ ‏.‏",
      "text_en": " It was narrated from a man, from Jabir that the Messenger of Allah said:                     \"It is not righteousness to fast when traveling.\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20262",
        "20449",
        "11449",
        "11105",
        "34"
      ]
    },
    {
      "id": "sunan-an-nasai-3427",
      "hadith_no": "3427",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا عمرو بن علي، قال سمعت يحيى، قال حدثنا علي بن المبارك، قال حدثنا يحيى بن أبي كثير، عن عمر بن معتب، أن أبا حسن، مولى بني نوفل أخبره قال كنت أنا وامرأتي، مملوكين فطلقتها تطليقتين ثم أعتقنا جميعا فسألت ابن عباس فقال إن راجعتها كانت عندك على واحدة قضى بذلك رسول الله صلى الله عليه وسلم ‏.‏ خالفه معمر ‏.‏",
      "text_en": " It was narrated from 'Umar bin Mu'attib that Abu Hasan, the freed slave of Banu Nawfal, said:                      \"My wife and I were slaves, and I divorced her twice, then we were both set free. I asked Ibn 'Abbas and he said: 'If you take her back, you have two divorces left. This is how the Messenger of Allah ruled.'\"",
      "usc_msa_ref": "",
      "chain": [
        "30153",
        "20031",
        "20449",
        "11449"
      ]
    },
    {
      "id": "sunan-an-nasai-3497",
      "hadith_no": "3497",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Divorce - كتاب الطلاق",
      "chapter_no": "27",
      "text_ar": "أخبرنا أبو علي، محمد بن يحيى المروزي قال أخبرني شاذان بن عثمان، أخو عبدان قال حدثنا أبي قال، حدثنا علي بن المبارك، عن يحيى بن أبي كثير، قال أخبرني محمد بن عبد الرحمن، أن الربيع بنت معوذ ابن عفراء، أخبرته أن ثابت بن قيس بن شماس ضرب امرأته فكسر يدها وهي جميلة بنت عبد الله بن أبى فأتى أخوها يشتكيه إلى رسول الله صلى الله عليه وسلم فأرسل رسول الله صلى الله عليه وسلم إلى ثابت فقال له ‏\"‏ خذ الذي لها عليك وخل سبيلها ‏\"‏ ‏.‏ قال نعم ‏.‏ فأمرها رسول الله صلى الله عليه وسلم أن تتربص حيضة واحدة فتلحق بأهلها ‏.‏",
      "text_en": " Ar-Rubayy' bint Mu'awwidh bin 'Afra' narrated that Thabit bin Qais bin Shammas hit his wife and broke her arm --her name was Jamilah bint 'Abdullah bin Ubayy. Her brother came to the Messenger of Allah to complain about him, and the Messenger of Allah sent for Thabit and said:                      \"Take what she owes you and let her go.\" He said: \"Yes.\" And the Messenger of Allah ordered her to wait for one menstrual cycle and then go to her family.",
      "usc_msa_ref": "",
      "chain": [
        "20449",
        "11449",
        "11105",
        "617"
      ]
    },
    {
      "id": "sunan-an-nasai-4808",
      "hadith_no": "4808",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Oaths (qasamah), Retaliation and Blood Money - كتاب القسامة",
      "chapter_no": "45",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا وكيع، قال حدثنا علي بن المبارك، عن يحيى، عن عكرمة، عن ابن عباس، قال قضى رسول الله صلى الله عليه وسلم في المكاتب يقتل بدية الحر على قدر ما أدى ‏.‏",
      "text_en": " It was narrated that Ibn 'Abbas said:                     \"The Messenger of Allah ruled that the Diyah for a Mukatab who is killed should be (equivalent) to the Diyah for a free mand, proportionate to the amount be had paid off (toward buying his freedom).\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20032",
        "20449",
        "11449",
        "11023",
        "17"
      ]
    },
    {
      "id": "sunan-an-nasai-5090",
      "hadith_no": "5090",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرني إبراهيم بن يعقوب، قال حدثنا أبو زيد، سعيد بن الربيع قال حدثنا علي بن المبارك، قال سمعت كريمة، قالت سمعت عائشة، سألتها امرأة عن الخضاب، بالحناء قالت لا بأس به ولكن أكره هذا لأن حبي صلى الله عليه وسلم كان يكره ريحه ‏.‏ تعني النبي صلى الله عليه وسلم ‏.‏",
      "text_en": " Karimah said:                     \"I heard a woman asking 'Aishah about dyeing the hair with Henna. She said: 'There is nothing wrong with it, but I do not like to do it because my beloved- meaning the Prophet [SAW]- disliked its smell.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38088",
        "20231",
        "20449"
      ]
    },
    {
      "id": "sunan-an-nasai-5153",
      "hadith_no": "5153",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا يحيى بن كثير، قال حدثنا علي بن المبارك، عن يحيى، حدثني أبو شيخ الهنائي، عن أبي حمان، أن معاوية، عام حج جمع نفرا من أصحاب رسول الله صلى الله عليه وسلم في الكعبة فقال لهم أنشدكم الله أنهى رسول الله صلى الله عليه وسلم عن لبس الذهب قالوا نعم ‏.‏ قال وأنا أشهد ‏.‏ خالفه حرب بن شداد رواه عن يحيى عن أبي شيخ عن أخيه حمان ‏.‏",
      "text_en": " It was narrated from Abu Himman:                     That when Mu'awiyah went on Hajj, he gathered together a group of the Companions of the Messenger of Allah [SAW] at the Ka'bah and said to them: \"I adjure you by Allah, did the Messenger of Allah [SAW] forbid wearing gold?\" They said: \"Yes.\" He said: \"And I bear witness to that.\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20302",
        "20449",
        "11449"
      ]
    },
    {
      "id": "sunan-an-nasai-5208",
      "hadith_no": "5208",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Adornment - كتاب الزينة من السنن",
      "chapter_no": "48",
      "text_ar": "أخبرنا أبو داود، سليمان بن سيف الحراني قال حدثنا هارون بن إسماعيل، قال حدثنا علي بن المبارك، قال حدثنا عبد العزيز بن صهيب، عن أنس بن مالك، قال اتخذ رسول الله صلى الله عليه وسلم خاتما ونقش عليه نقشا قال ‏\"‏ إنا قد اتخذنا خاتما ونقشنا فيه نقشا فلا ينقش أحد على نقشه ‏\"‏ ‏.‏ ثم قال أنس فكأني أنظر إلى وبيصه في يده ‏.‏",
      "text_en": " It was narrated that Anas bin Malik said:                     \"The Messenger of Allah [SAW] put on a ring, and he had some words inscribed on it. He said: 'We have put on a ring and have had some words engraved on it; no one of you should copy this inscription.'\" Then Anas said: \"It is as if I can see its whiteness on his hand.\"",
      "usc_msa_ref": "",
      "chain": [
        "38247",
        "20292",
        "20449",
        "11295",
        "19"
      ]
    },
    {
      "id": "sunan-an-nasai-5552",
      "hadith_no": "5552",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا محمد بن المثنى، قال حدثنا عثمان بن عمر، قال حدثنا علي، - وهو ابن المبارك - عن يحيى، عن أبي سلمة، عن أبي قتادة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ لا تنبذوا الزهو والرطب جميعا ولا تنبذوا الزبيب والرطب جميعا ‏\"‏‏.‏",
      "text_en": " It was narrated from Abu Qatadah that:                     The Messenger of Allah [SAW] said: \"Do not soak Az-Zahuw and ripe dates together, and do not soak raisins and ripe dates together.\"",
      "usc_msa_ref": "",
      "chain": [
        "30170",
        "20262",
        "20449",
        "11449",
        "10567",
        "391"
      ]
    },
    {
      "id": "sunan-an-nasai-5681",
      "hadith_no": "5681",
      "source": "Sunan an-Nasa'i",
      "chapter": "The Book of Drinks - كتاب الأشربة",
      "chapter_no": "51",
      "text_ar": "أخبرنا سويد بن نصر، قال أنبأنا عبد الله، عن علي بن المبارك، قال حدثتنا كريمة بنت همام، أنها سمعت عائشة أم المؤمنين، تقول نهيتم عن الدباء، نهيتم عن الحنتم، نهيتم عن المزفت، ‏.‏ ثم أقبلت على النساء فقالت إياكن والجر الأخضر وإن أسكركن ماء حبكن فلا تشربنه ‏.‏",
      "text_en": " It was narrated that 'Ali bin Al-Mubarak said:                     \"Karimah bint Hammam told me that she heard 'Aishah, the Mother of the Believers, say: 'You have been forbidden Ad-Dubba' (gourds), you have been forbidden Al-Hantam, you have been forbidden Al-Muzaffat.' Then she turned to women and said: 'Beware of green earthenware jars, and if the water in your clay vessels intoxicates you, do not drink it.'\"",
      "usc_msa_ref": "",
      "chain": [
        "38265",
        "20025",
        "20449",
        "19516",
        "53"
      ]
    },
    {
      "id": "sunan-ibn-majah-269",
      "hadith_no": "269",
      "source": "Sunan Ibn Majah",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا زيد بن أخزم، وأبو بدر عباد بن الوليد قالا حدثنا محمد بن عباد الهنائي، حدثنا علي بن المبارك الهنائي، عن أيوب السختياني، عن خالد بن دريك، عن ابن عمر، أن النبي  صلى الله عليه وسلم  قال ‏\"‏ من طلب العلم لغير الله أو أراد به غير الله فليتبوأ مقعده من النار ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Ibn 'Umar that:                     The Prophet said: \"Whoever seeks knowledge for a reason other than the sake of Allah, or intends it for a purpose other than for the sake of Allah, let him take his place in hell.\"",
      "usc_msa_ref": "",
      "chain": [
        "30136",
        "36577",
        "24402",
        "20449",
        "11015",
        "19906",
        "18"
      ]
    },
    {
      "id": "sunan-ibn-majah-3898",
      "hadith_no": "3898",
      "source": "Sunan Ibn Majah",
      "chapter": "Interpretation of Dreams - كتاب تعبير الرؤيا",
      "chapter_no": "35",
      "text_ar": "حدثنا علي بن محمد، حدثنا وكيع، عن علي بن المبارك، عن يحيى بن أبي كثير، عن أبي سلمة، عن عبادة بن الصامت، قال سألت رسول الله  صلى الله عليه وسلم  عن قول الله سبحانه ‏{لهم البشرى في الحياة الدنيا وفي الآخرة}‏ ‏.‏ قال ‏\"‏ هي الرؤيا الصالحة يراها المسلم أو ترى له ‏\"‏ ‏.‏",
      "text_en": " It wasnarrated that ‘Ubadah bin Samit said:                      “I asked the MessengerofAllah (ﷺ) the about the Saying of Allah, Glorious is He: ‘Forthem are glad tidings, in the life of the present world, and in theHereafter.”[10:64] He said: ‘Those are good dreams that a Muslimseesor are seen about him.’”",
      "usc_msa_ref": "",
      "chain": [
        "38409",
        "20032",
        "20449",
        "11449",
        "10567",
        "40"
      ]
    }
  ],
  "total_hadiths": 52
}