{
  "id": "20442",
  "name": "'Abdul Quddus bin al-Hajjaj al-Khulani عبد القدوس بن الحجاج الخولاني",
  "full_name": "'Abdul Quddus bin al-Hajjaj al-Khulani عبد القدوس بن الحجاج الخولاني",
  "grade": "Succ. (Taba' Tabi') [9th generation]",
  "reliability_grade": "Thiqah",
  "biography": {
    "birth": {
      "date_hijri": "NA",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "NA"
    },
    "death": {
      "date_hijri": "212",
      "date_gregorian": "NA",
      "date_display": null,
      "place": "",
      "reason": "Natural"
    },
    "places_of_stay": [
      "al-Hims"
    ],
    "area_of_interest": [
      "Narrator[Grade:Thiqah] [ ع  -  ثقة ]"
    ],
    "tags": [
      "al-Khulani",
      "al-Himsi"
    ]
  },
  "parents": [],
  "spouses": [],
  "siblings": [],
  "children": [],
  "teachers": [
    {
      "id": "11684",
      "name": "Huraiz bin 'Uthman bin Jabir حريز بن عثمان بن جبر الرحبي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "10921",
      "name": "Safwan bin 'Amr bin Harm al-Saksaki صفوان بن عمرو بن هرم السكسكي",
      "grade": "Follower(Tabi') [5th generation]"
    },
    {
      "id": "20724",
      "name": "'Abdur Rahman bin 'Abdullah bin 'Utba عبد الرحمن بن عبد الله بن عتبة المسعودي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "27053",
      "name": "Abu Bakr bin 'Abdullah bin Abi Maryum أبو بكر بن عبد الله بن أبي مريم",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "20638",
      "name": "Sa'id bin 'Abdul 'Aziz al-Tanuqi سعيد بن عبد العزيز التنوخي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "17025",
      "name": "al-Sry bin Yn'm السري بن ينعم",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20432",
      "name": "'Abdullah bin Salm al-Asha'ri عبد الله بن سالم الأشعري",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "18549",
      "name": "'Abdullah bin 'Ali عبد الله بن علي بن يزيد بن ركانة",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20024",
      "name": "'Abdur Rahman bin 'Amr al-Awza'i عبد الرحمن بن عمرو أبو عمرو الأوزاعي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28386",
      "name": "'Utba bin Dmrh bin Habib عتبة بن ضمرة بن حبيب بن صهيب",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "19130",
      "name": "al-Walid bin Sulaiman bin Aby الوليد بن سليمان بن أبي السائب القرشي",
      "grade": "Follower(Tabi') [6th generation]"
    },
    {
      "id": "20336",
      "name": "'Abdul Malik bin Hameed bin Abi Ghaniya عبد الملك بن حميد بن أبي غنية",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "27042",
      "name": "M'aan bin Rafa'a معان بن رفاعة السلامي",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    },
    {
      "id": "28645",
      "name": "Yazid bin Ata'a bin Yazid يزيد بن عطاء بن يزيد",
      "grade": "Succ. (Taba' Tabi') [7th generation]"
    }
  ],
  "students": [
    {
      "id": "30001",
      "name": "al-Bukhari محمد بن اسماعيل البخاري",
      "grade": "3rd Century AH [11th generation] [Shafi'ee]"
    },
    {
      "id": "30313",
      "name": "Ishaq bin Mansur al-Kausaj إسحاق بن منصور بن بهرام - الكوسج",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30007",
      "name": "Ahmad bin Hanbal أحمد بن حنبل",
      "grade": "3rd Century AH [10th generation] [Hanbali]"
    },
    {
      "id": "38589",
      "name": "Muhammad bin Masfa bin Bahlwal محمد بن مصفى بن بهلول",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38363",
      "name": "Abd al-Whab bin Njd'h عبد الوهاب بن نجدة",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30417",
      "name": "Salmah bin Shbyb سلمة بن شبيب",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30025",
      "name": "'Abdullah bin 'Abdur Rahman al-Daarimi عبد الله بن عبد الرحمن الدارمي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38442",
      "name": "'Isa bin Abi 'Isa عيسى بن أبي عيسى",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38566",
      "name": "Muhammad bin Awf bin Sufyan محمد بن عوف بن سفيان الطائي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "30023",
      "name": "Muhammad bin Yahya bin Faris al-Dhahli محمد بن يحيى بن فارس الذهلي",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38429",
      "name": "'Amr bin 'Uthman bin Sa'id bin Kahtir عمرو بن عثمان بن سعيد بن كثير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "38705",
      "name": "Yahya bin 'Uthman bin Sa'id bin Kathir يحيى بن عثمان بن سعيد بن كثير",
      "grade": "3rd Century AH [10th generation]"
    },
    {
      "id": "30535",
      "name": "Ahmed bin Yusuf bin Khalid أحمد بن يوسف بن خالد حمدان",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "37510",
      "name": "Shu'aib bin Shu'aib bin Ishaq شعيب بن شعيب بن إسحاق",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38279",
      "name": "Safwan bin 'Amr صفوان بن عمرو",
      "grade": "3rd Century AH [11th generation]"
    },
    {
      "id": "38437",
      "name": "'Imran bin Bakar al-Kula'i عمران بن بكار الكلاعي",
      "grade": "3rd Century AH [11th generation]"
    }
  ],
  "hadiths": [
    {
      "hadith_no": "1868",
      "source": " Sahih Bukhari ",
      "chapter": "Penalty of Hunting while on Pilgrimage - كتاب جزاء الصيد",
      "chapter_no": "28",
      "text_ar": "حدثنا أبو المغيرة عبد القدوس بن الحجاج، حدثنا الأوزاعي، حدثني عطاء بن أبي رباح، عن ابن عباس  رضى الله عنهما  أن النبي صلى الله عليه وسلم تزوج ميمونة وهو محرم‏.‏",
      "text_en": " Narrated Ibn `Abbas:                     The Prophet married Maimuna while he was in the state of Ihram, (only the ceremonies of marriage were held).",
      "chain": [
        "20442",
        "20024",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "3292",
      "source": " Sahih Bukhari ",
      "chapter": "Beginning of Creation - كتاب بدء الخلق",
      "chapter_no": "59",
      "text_ar": "حدثنا أبو المغيرة، حدثنا الأوزاعي، قال حدثني يحيى، عن عبد الله بن أبي قتادة، عن أبيه، عن النبي صلى الله عليه وسلم‏.‏ حدثني سليمان بن عبد الرحمن، حدثنا الوليد، حدثنا الأوزاعي، قال حدثني يحيى بن أبي كثير، قال حدثني عبد الله بن أبي قتادة، عن أبيه، قال قال النبي صلى الله عليه وسلم ‏\"‏ الرؤيا الصالحة من الله، والحلم من الشيطان فإذا حلم أحدكم حلما يخافه فليبصق عن يساره، وليتعوذ بالله من شرها، فإنها لا تضره ‏\"‏‏.‏",
      "text_en": " Narrated Abu Qatada:                     as below.Narrated Abu Qatada:The Prophet said, \"A good dream is from Allah, and a bad or evil dream is from Satan; so if anyone of you has a bad dream of which he gets afraid, he should spit on his left side and should seek Refuge with Allah from its evil, for then it will not harm him.\"",
      "chain": [
        "20442",
        "20024",
        "11449",
        "11804",
        "391"
      ]
    },
    {
      "hadith_no": "6175",
      "source": " Sahih Bukhari ",
      "chapter": "Good Manners and Form (Al-Adab) - كتاب الأدب",
      "chapter_no": "78",
      "text_ar": "حدثني إسحاق، أخبرنا أبو المغيرة، حدثنا الأوزاعي، حدثنا الزهري، عن حميد، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف منكم فقال في حلفه باللات والعزى‏.‏ فليقل لا إله إلا الله‏.‏ ومن قال لصاحبه تعال أقامرك، فليتصدق ‏\"‏‏.‏",
      "text_en": " Narrated Abu Huraira:                     Allah's Apostle said: \"Whoever amongst you swears, (saying by error) in his oath 'By Al-Lat and Al- Uzza', then he should say, 'None has the right to be worshipped but Allah.' And whoever says to his companions, 'Come let me gamble' with you, then he must give something in charity (as an expiation for such a sin).\" (See Hadith No. 645)",
      "chain": [
        "30313",
        "20442",
        "20024",
        "11013",
        "11280",
        "13"
      ]
    },
    {
      "hadith_no": "1810",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Prayer (Travellers) - كتاب صلاة المسافرين وقصرها",
      "chapter_no": "7",
      "text_ar": "حدثنا إسحاق بن منصور، أخبرنا أبو المغيرة، حدثنا الأوزاعي، حدثنا يحيى، حدثنا أبو سلمة بن عبد الرحمن، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ إذا مضى شطر الليل أو ثلثاه ينزل الله تبارك وتعالى إلى السماء الدنيا فيقول هل من سائل يعطى هل من داع يستجاب له هل من مستغفر يغفر له حتى ينفجر الصبح ‏\"‏ ‏.‏",
      "text_en": " Abu Huraira reported Allah's Messenger (may peace be upon him) as saying:                      Allah descends to the lowest heaven at half of the night or at one-third of the latter part and says: Who is there to supplicate Me so that I answer him? Who is there to ask Me so that I grant him? And then says: Who will lend to One Who is neither indigent nor tyrant? (This hadith has been narrated by Sa'd b. Sa'id with the same chain of transmitters with this addition:\" Then the Blessed and the Exalted (Lord) stretches His Hands and says: Who will lend to One Who is neither indigent nor tyrant? )",
      "chain": [
        "30313",
        "20442",
        "20024",
        "11449",
        "10567",
        "13"
      ]
    },
    {
      "hadith_no": "2477",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Zakat - كتاب الزكاة",
      "chapter_no": "13",
      "text_ar": "حدثنا زهير بن حرب، حدثنا عبد الصمد بن عبد الوارث، حدثنا همام، ح وحدثني زهير بن حرب، حدثنا عمر بن يونس، حدثنا عكرمة بن عمار، ح وحدثني سلمة بن شبيب، حدثنا أبو المغيرة، حدثنا الأوزاعي، كلهم عن إسحاق بن عبد الله بن أبي طلحة، عن أنس، بن مالك عن النبي صلى الله عليه وسلم بهذا الحديث ‏.‏ وفي حديث عكرمة بن عمار من الزيادة قال ثم جبذه إليه جبذة رجع نبي الله صلى الله عليه وسلم في نحر الأعرابي ‏.‏ وفي حديث همام فجاذبه حتى انشق البرد وحتى بقيت حاشيته في عنق رسول الله صلى الله عليه وسلم ‏.‏",
      "text_en": " This hadith has been narrated on the authority of Anas b. Malik through another chain of transmitters. And In the hadith transmitted by Ikrima b. 'Ammir there is an addition:                     \" He (the bedouin) pulled his (mantle) so violently that the Apostle of Allah (may peace be upon him) was drifted very close to the bedouin.\" And in the hadith transmitted by Hammam, (the words are):\" He pulled it so violently that the mantle was torn and the border was left around the neck of the Messenger of Allah (may peace be upon him).\"",
      "chain": [
        "30022",
        "20250",
        "20297",
        "30022",
        "20450",
        "10704",
        "30417",
        "20442",
        "11151",
        "19"
      ]
    },
    {
      "hadith_no": "2830",
      "source": " Sahih Muslim ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "14",
      "text_ar": "وحدثنا عبد بن حميد، أخبرنا عبد الرزاق، أخبرنا معمر، ح وحدثنا عبد الله، بن عبد الرحمن الدارمي أخبرنا أبو المغيرة، حدثنا الأوزاعي، كلاهما عن يحيى بن أبي، كثير بهذا الإسناد ‏.‏ نحوه وفي حديثهما رأيت رسول الله صلى الله عليه وسلم حين انصرف وعلى جبهته وأرنبته أثر الطين ‏.‏",
      "text_en": " This badith has been reported on the authority of Yahya b. Abu Kathir with the same chain of transmitters (with a slight variation of these words):                      I saw the Messenger of Allah (may peace be upon him) after he had completed (the prayer) and there was a trace of clay on his forehead and tip (of the nose).",
      "chain": [
        "30553",
        "20121",
        "20115",
        "30025",
        "20442"
      ]
    },
    {
      "hadith_no": "2843",
      "source": " Sahih Muslim ",
      "chapter": "The Book of I'tikaf - كتاب الاعتكاف",
      "chapter_no": "15",
      "text_ar": "وحدثناه ابن أبي عمر، حدثنا سفيان، ح وحدثني عمرو بن سواد، أخبرنا ابن، وهب أخبرنا عمرو بن الحارث، ح وحدثني محمد بن رافع، حدثنا أبو أحمد، حدثنا سفيان، ح وحدثني سلمة بن شبيب، حدثنا أبو المغيرة، حدثنا الأوزاعي، ح وحدثني زهير بن حرب، حدثنا يعقوب بن إبراهيم بن سعد، حدثنا أبي، عن ابن إسحاق، كل هؤلاء عن يحيى بن، سعيد عن عمرة، عن عائشة، - رضى الله عنها - عن النبي صلى الله عليه وسلم ‏.‏ بمعنى حديث أبي معاوية ‏.‏ وفي حديث ابن عيينة وعمرو بن الحارث وابن إسحاق ذكر عائشة وحفصة وزينب - رضى الله عنهن - أنهن ضربن الأخبية للاعتكاف ‏.‏",
      "text_en": " This hadith has been reported through another chain of transmitters, and there it is mentioned that. 'A'isha, Hafsa and Zainab (Allah be pleased with them) pitched the tents for i'tikaf.",
      "chain": [
        "30421",
        "20005",
        "30443",
        "20377",
        "30375",
        "20355",
        "20012",
        "30417",
        "20442",
        "20024",
        "30022",
        "20184",
        "20150"
      ]
    },
    {
      "hadith_no": "121",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن محمد بن حنبل، حدثنا أبو المغيرة، حدثنا حريز، حدثني عبد الرحمن بن ميسرة الحضرمي، سمعت المقدام بن معديكرب الكندي، قال أتي رسول الله صلى الله عليه وسلم بوضوء فتوضأ فغسل كفيه ثلاثا ثم تمضمض واستنشق ثلاثا وغسل وجهه ثلاثا ثم غسل ذراعيه ثلاثا ثلاثا ثم مسح برأسه وأذنيه ظاهرهما وباطنهما ‏.‏",
      "text_en": " Narrated Al-Miqdam ibn Ma'dikarib al-Kindi:                     The ablution water was brought to the Messenger (ﷺ) and he performed ablution; he washed his hands up to wrists three times, then washed his forearms three times.  He then rinsed his mouth and snuffed up water three times; then he wiped his head and ears inside and outside.",
      "chain": [
        "30007",
        "20442",
        "18651"
      ]
    },
    {
      "hadith_no": "385",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Purification (Kitab Al-Taharah) - كتاب الطهارة",
      "chapter_no": "1",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا أبو المغيرة، ح وحدثنا عباس بن الوليد بن مزيد، أخبرني أبي ح، وحدثنا محمود بن خالد، حدثنا عمر، - يعني ابن عبد الواحد - عن الأوزاعي، - المعنى - قال أنبئت أن سعيد بن أبي سعيد المقبري، حدث عن أبيه، عن أبي هريرة، أن رسول الله صلى الله عليه وسلم قال ‏\"‏ إذا وطئ أحدكم بنعليه الأذى فإن التراب له طهور ‏\"‏ ‏.‏",
      "text_en": " Abu Hurairah reported:                      The Messenger of Allah (ﷺ) said: When any one of you treads with his sandal upon an unclean place, the earth will render it purified.",
      "chain": [
        "30007",
        "20442",
        "38288",
        "28624",
        "37534",
        "27536",
        "11168",
        "11212",
        "13"
      ]
    },
    {
      "hadith_no": "1135",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Prayer (Kitab Al-Salat) - كتاب الصلاة",
      "chapter_no": "2",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا أبو المغيرة، حدثنا صفوان، حدثنا يزيد بن خمير الرحبي، قال خرج عبد الله بن بسر صاحب رسول الله صلى الله عليه وسلم مع الناس في يوم عيد فطر أو أضحى فأنكر إبطاء الإمام فقال إنا كنا قد فرغنا ساعتنا هذه وذلك حين التسبيح ‏.‏",
      "text_en": " Narrated Abdullah ibn Busr:                     Yazid ibn Khumayr ar-Rahbi said: Abdullah ibn Busr, the Companion of the Messenger of Allah (ﷺ) came out along with the people on the day of the breaking of the fast or on the day of sacrifice (to offer the prayer). He disliked the delay of the imam, and said: We would finish (our 'Id prayer) at this moment, that is, at the time of forenoon.",
      "chain": [
        "30007",
        "20442",
        "10921",
        "10981"
      ]
    },
    {
      "hadith_no": "1257",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Voluntary Prayers - كتاب التطوع",
      "chapter_no": "5",
      "text_ar": "حدثنا أحمد بن حنبل، حدثنا أبو المغيرة، حدثنا عبد الله بن العلاء، حدثني أبو زيادة، عبيد الله بن زياد الكندي عن بلال، أنه حدثه أنه، أتى رسول الله صلى الله عليه وسلم ليؤذنه بصلاة الغداة فشغلت عائشة - رضى الله عنها - بلالا بأمر سألته عنه حتى فضحه الصبح فأصبح جدا قال فقام بلال فآذنه بالصلاة وتابع أذانه فلم يخرج رسول الله صلى الله عليه وسلم فلما خرج صلى بالناس وأخبره أن عائشة شغلته بأمر سألته عنه حتى أصبح جدا وأنه أبطأ عليه بالخروج فقال ‏\"‏ إني كنت ركعت ركعتى الفجر ‏\"‏ ‏.‏ فقال يا رسول الله إنك أصبحت جدا ‏.‏ قال ‏\"‏ لو أصبحت أكثر مما أصبحت لركعتهما وأحسنتهما وأجملتهما ‏\"‏ ‏.‏",
      "text_en": " Narrated Bilal:                     Ziyadah al-Kindi reported on the authority of Bilal that he (Bilal) came to the Messenger of Allah (ﷺ) to inform him about the dawn prayer. Aisha kept Bilal engaged in a matter which she asked him till the day was bright and it became fairly light. Bilal then stood up and called him to prayer and called him repeatedly. The Messenger of Allah (ﷺ) did not yet come out. When he came out, he led the people in prayer and he (Bilal) informed him that Aisha had kept him engaged in a matter which she asked him till it became fairly light; hence he became late in reaching him (in time). He (Bilal) said: Messenger of Allah, the dawn became fairly bright. He said: If the dawn became brighter than it is now, I would pray them (the two rak'ahs of the sunnah prayer), offer them well and in a more beautiful manner.",
      "chain": [
        "30007",
        "20442",
        "20399",
        "24"
      ]
    },
    {
      "hadith_no": "2544",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Jihad (Kitab Al-Jihad) - كتاب الجهاد",
      "chapter_no": "15",
      "text_ar": "حدثنا محمد بن عوف الطائي، حدثنا أبو المغيرة، حدثنا محمد بن مهاجر، حدثنا عقيل بن شبيب، عن أبي وهب، قال قال رسول الله صلى الله عليه وسلم ‏:‏ ‏\"‏ عليكم بكل أشقر أغر محجل، أو كميت أغر ‏\"‏ ‏.‏ فذكر نحوه ‏.‏ قال محمد - يعني ابن مهاجر - سألته ‏:‏ لم فضل الأشقر قال ‏:‏ لأن النبي صلى الله عليه وسلم بعث سرية فكان أول من جاء بالفتح صاحب أشقر ‏.‏",
      "text_en": " Narrated AbuWahb:                     The Prophet (ﷺ) said: Keep to every sorrel horse with a white blaze and white on the legs, or dark bay with a white blaze. He then  mentioned something similar. Muhammad ibn al-Muhajir said: I asked him: Why was a sorrel horse preferred? He replied: Because the Prophet (ﷺ) had sent a contingent, and the man who first brought the news of victory was the rider of a sorrel horse.",
      "chain": [
        "38566",
        "20442",
        "20637",
        "18745"
      ]
    },
    {
      "hadith_no": "2953",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Tribute, Spoils, and Rulership (Kitab Al-Kharaj, Wal-Fai' Wal-Imarah) - كتاب الخراج والإمارة والفىء",
      "chapter_no": "20",
      "text_ar": "حدثنا سعيد بن منصور، حدثنا عبد الله بن المبارك، ح وحدثنا ابن المصفى، قال حدثنا أبو المغيرة، جميعا عن صفوان بن عمرو، عن عبد الرحمن بن جبير بن نفير، عن أبيه، عن عوف بن مالك، أن رسول الله صلى الله عليه وسلم كان إذا أتاه الفىء قسمه في يومه فأعطى الآهل حظين وأعطى العزب حظا ‏.‏ زاد ابن المصفى فدعينا وكنت أدعى قبل عمار فدعيت فأعطاني حظين وكان لي أهل ثم دعي بعدي عمار بن ياسر فأعطى له حظا واحدا ‏.‏",
      "text_en": " Narrated 'Awf bin Malik:                     When the spoils (fai') came to the Messenger of Allah (ﷺ), he divided it that day ; he gave two portions to a married man and one to a bachelor. The narrator Ibn al-Musaffa added: We were summoned, and I would be summoned before 'Ammar. So I was summoned and he gave me two portions, for I had a family ; then 'Ammar b. Yasir was summoned after me and given one.",
      "chain": [
        "30116",
        "20025",
        "20442",
        "10921",
        "10942",
        "10805"
      ]
    },
    {
      "hadith_no": "3466",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Wages (Kitab Al-Ijarah) - كتاب الإجارة",
      "chapter_no": "24",
      "text_ar": "حدثنا محمد بن المصفى، حدثنا أبو المغيرة، حدثنا عبد الملك بن أبي غنية، حدثني أبو إسحاق، عن عبد الله بن أبي أوفى الأسلمي، قال غزونا مع رسول الله صلى الله عليه وسلم الشام فكان يأتينا أنباط من أنباط الشام فنسلفهم في البر والزيت سعرا معلوما وأجلا معلوما فقيل له ممن له ذلك قال ما كنا نسألهم ‏.‏",
      "text_en": " Narrated Abdullah ibn AbuAwfa ibn AbuAwfa al-Aslami:                     We made a journey to Syria on an expedition along with the Messenger of Allah (ﷺ). The Nabateans of Syria came to us and we paid in advance to them (in a salam contract) in wheat and olive oil at a specified rate and for a specified time. He asked (by the people): you might have contracted with him who had these things in his possession? He replied: We did not ask them.",
      "chain": [
        "20442",
        "20336",
        "11049"
      ]
    },
    {
      "hadith_no": "4242",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Trials and Fierce Battles (Kitab Al-Fitan Wa Al-Malahim) - كتاب الفتن والملاحم",
      "chapter_no": "37",
      "text_ar": "حدثنا يحيى بن عثمان بن سعيد الحمصي، حدثنا أبو المغيرة، حدثني عبد الله بن سالم، حدثني العلاء بن عتبة، عن عمير بن هانئ العنسي، قال سمعت عبد الله بن عمر، يقول كنا قعودا عند رسول الله صلى الله عليه وسلم فذكر الفتن فأكثر في ذكرها حتى ذكر فتنة الأحلاس فقال قائل يا رسول الله وما فتنة الأحلاس قال ‏\"‏ هي هرب وحرب ثم فتنة السراء دخنها من تحت قدمى رجل من أهل بيتي يزعم أنه مني وليس مني وإنما أوليائي المتقون ثم يصطلح الناس على رجل كورك على ضلع ثم فتنة الدهيماء لا تدع أحدا من هذه الأمة إلا لطمته لطمة فإذا قيل انقضت تمادت يصبح الرجل فيها مؤمنا ويمسي كافرا حتى يصير الناس إلى فسطاطين فسطاط إيمان لا نفاق فيه وفسطاط نفاق لا إيمان فيه فإذا كان ذاكم فانتظروا الدجال من يومه أو من غده ‏\"‏ ‏.‏",
      "text_en": " Narrated Abdullah ibn Umar:                     When we were sitting with the Messenger of Allah (ﷺ), he talked about periods of trial (fitnahs), mentioning many of them.  When he mentioned the one when people should stay in their houses, some asked him: Messenger of Allah, what is the trial (fitnah) of staying at home?  He replied: It will be flight and plunder. Then will come a test which is pleasant. Its murkiness is due to the fact that it is produced by a man from the people of my house, who will assert that he belongs to me, whereas he does not, for my friends are only the God-fearing. Then the people will unite under a man who will be like a hip-bone on a rib. Then there will be the little black trial which will leave none of this community without giving him a slap, and when people say that it is finished, it will be extended. During it a man will be a believer in the morning and an infidel in the evening, so that the people will be in two camps: the camp of faith which will contain no hypocrisy, and the camp of hypocrisy which will contain no faith. When that happens, expect the Antichrist (Dajjal) that day or the next.",
      "chain": [
        "20442",
        "35061",
        "11415",
        "18"
      ]
    },
    {
      "hadith_no": "4350",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Battles (Kitab Al-Malahim) - كتاب الملاحم",
      "chapter_no": "39",
      "text_ar": "حدثنا عمرو بن عثمان، حدثنا أبو المغيرة، حدثني صفوان، عن شريح بن عبيد، عن سعد بن أبي وقاص، أن النبي صلى الله عليه وسلم قال ‏\"‏ إني لأرجو أن لا تعجز أمتي عند ربها أن يؤخرهم نصف يوم ‏\"‏ ‏.‏ قيل لسعد وكم نصف يوم قال خمسمائة سنة ‏.‏",
      "text_en": " Narrated Sa'd ibn AbuWaqqas:                     The Prophet (ﷺ) said: I hope my community will not fail to maintain their position in the sight of their Lord if He delays them half a day. Sa'd was asked: How long is half a day? He said: It is five hundred years.",
      "chain": [
        "10581",
        "20442",
        "10921",
        "18414",
        "9"
      ]
    },
    {
      "hadith_no": "4597",
      "source": " Sunan Abi Da'ud ",
      "chapter": "Model Behavior of the Prophet (Kitab Al-Sunnah) - كتاب السنة",
      "chapter_no": "42",
      "text_ar": "حدثنا أحمد بن حنبل، ومحمد بن يحيى، قالا حدثنا أبو المغيرة، حدثنا صفوان، ح وحدثنا عمرو بن عثمان، حدثنا بقية، قال حدثني صفوان، نحوه قال حدثني أزهر بن عبد الله الحرازي، عن أبي عامر الهوزني، عن معاوية بن أبي سفيان، أنه قام فينا فقال ألا إن رسول الله صلى الله عليه وسلم قام فينا فقال ‏\"‏ ألا إن من قبلكم من أهل الكتاب افترقوا على ثنتين وسبعين ملة وإن هذه الملة ستفترق على ثلاث وسبعين ثنتان وسبعون في النار وواحدة في الجنة وهي الجماعة ‏\"‏ ‏.‏ زاد ابن يحيى وعمرو في حديثيهما ‏\"‏ وإنه سيخرج من أمتي أقوام تجارى بهم تلك الأهواء كما يتجارى الكلب لصاحبه ‏\"‏ ‏.‏ وقال عمرو ‏\"‏ الكلب بصاحبه لا يبقى منه عرق ولا مفصل إلا دخله ‏\"‏ ‏.‏",
      "text_en": " Abu ‘Amir al-Hawdhani said:                      Mu’awiyah b. Abi Sufiyan stood among us and said: Beware! The Apostle of ALLA H (SAWS) stood among us and said: Beware! The people of the Book before were split up into seventy-two sects, and this community will be split into seventy three: seventy-two of them will go to Hell and one of them will go to Paradise, and it is the majority group.Ibn Yahya and ‘Amr added in their version : “ There will appear among my community people who will be dominated by desires like rabies which penetrates its patient”, ‘Amr’s version has: “penetrates its patient. There remains no vein and no joint but it penetrates it.”",
      "chain": [
        "30007",
        "11222",
        "20442",
        "10921",
        "10581",
        "20644",
        "10921",
        "18019",
        "27"
      ]
    },
    {
      "hadith_no": "4878",
      "source": " Sunan Abi Da'ud ",
      "chapter": "General Behavior (Kitab Al-Adab) - كتاب الأدب",
      "chapter_no": "43",
      "text_ar": "حدثنا ابن المصفى، حدثنا بقية، وأبو المغيرة، قالا حدثنا صفوان، قال حدثني راشد بن سعد، وعبد الرحمن بن جبير، عن أنس بن مالك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ لما عرج بي مررت بقوم لهم أظفار من نحاس يخمشون وجوههم وصدورهم فقلت من هؤلاء يا جبريل قال هؤلاء الذين يأكلون لحوم الناس ويقعون في أعراضهم ‏\"‏ ‏.‏ قال أبو داود حدثناه يحيى بن عثمان عن بقية ليس فيه أنس ‏.‏",
      "text_en": " Narrated Anas ibn Malik:                     The Prophet (ﷺ) said: When I was taken up to heaven I passed by people who had nails of copper and were scratching their faces and their breasts. I said: Who are these people,  Gabriel? He replied: They are those who were given to back biting and who aspersed people's honour.Abu Dawud said: Yahya b. 'Uthman has also transmitted it from Baqiyyah, there is no mention of Anas in it.",
      "chain": [
        "20644",
        "20442",
        "10921",
        "19909",
        "10865",
        "19"
      ]
    },
    {
      "hadith_no": "701",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Fasting - كتاب الصوم عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "8",
      "text_ar": "حدثنا عبد الله بن عبد الرحمن، أخبرنا أبو عاصم، وأبو المغيرة، عن الأوزاعي، بهذا الإسناد نحوه ‏.‏ قال أبو عيسى هذا حديث حسن غريب ‏.‏",
      "text_en": " Abu Hurairah narrated:                     (A Hadith similar to no. 700 with a different chain).",
      "chain": [
        "30025",
        "20241",
        "20442",
        "20024"
      ]
    },
    {
      "hadith_no": "1517",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Sacrifices - كتاب الأضاحى عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "19",
      "text_ar": "حدثنا سلمة بن شبيب، حدثنا أبو المغيرة، عن عفير بن معدان، عن سليم بن عامر، عن أبي أمامة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ خير الأضحية الكبش وخير الكفن الحلة ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث غريب ‏.‏ وعفير بن معدان يضعف في الحديث ‏.‏",
      "text_en": " Narrated Abu Umamah:                     That the Messenger of Allah (ﷺ) said: \"The best of Udhiyah (sacrifice) is a ram, and the best (burial) shroud is the Hullah.\"",
      "chain": [
        "30417",
        "20442",
        "10915",
        "405"
      ]
    },
    {
      "hadith_no": "1545",
      "source": " Jami' al-Tirmidhi ",
      "chapter": "The Book on Vows and Oaths - كتاب النذور والأيمان عن رسول الله صلى الله عليه وسلم",
      "chapter_no": "20",
      "text_ar": "حدثنا إسحاق بن منصور، حدثنا أبو المغيرة، حدثنا الأوزاعي، حدثنا الزهري، عن حميد بن عبد الرحمن، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف منكم فقال في حلفه واللات والعزى فليقل لا إله إلا الله ومن قال تعال أقامرك فليتصدق ‏\"‏ ‏.‏ قال أبو عيسى هذا حديث حسن صحيح ‏.‏ وأبو المغيرة هو الخولاني الحمصي واسمه عبد القدوس بن الحجاج ‏.‏",
      "text_en": " Narrated Abu Hurairah:                     That the Messenger of Allah (ﷺ) said: \"Whoever among you swears, saying in his oath: 'By Al-Lat! By Al-'Uzza!' Then let him say 'La ilaha illa Allah' And whoever says: 'Come let me gamble with you!' Then let him give in charity.\"",
      "chain": [
        "30313",
        "20442",
        "20024",
        "11013",
        "10561",
        "13"
      ]
    },
    {
      "hadith_no": "561",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of the Times (of Prayer) - كتاب المواقيت",
      "chapter_no": "6",
      "text_ar": "أخبرني شعيب بن شعيب بن إسحاق، قال حدثنا أبو المغيرة، قال حدثنا الأوزاعي، عن الزهري، عن سعيد بن المسيب، عن أبي هريرة، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من أدرك من الصلاة ركعة فقد أدركها ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Hurairah said:                      \"The Messenger of Allah (ﷺ) said: 'Whoever catches up with a Rak'ah of the prayer has caught up with it.\"",
      "chain": [
        "37510",
        "20442",
        "20024",
        "11013",
        "11002",
        "13"
      ]
    },
    {
      "hadith_no": "2269",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Fasting - كتاب الصيام",
      "chapter_no": "22",
      "text_ar": "أخبرنا إسحاق بن منصور، قال أنبأنا أبو المغيرة، قال حدثنا الأوزاعي، عن يحيى، عن أبي قلابة، عن أبي المهاجر، عن أبي أمية الضمري، قال قدمت على رسول الله صلى الله عليه وسلم من سفر فسلمت عليه فلما ذهبت لأخرج قال ‏\"‏ انتظر الغداء يا أبا أمية ‏\"‏ ‏.‏ قلت إني صائم يا نبي الله ‏.‏ قال ‏\"‏ تعال أخبرك عن المسافر إن الله تعالى وضع عنه الصيام ونصف الصلاة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Abu Umayyah Ad-Damri said:                     \"I came to the Messenger of Allah from a journey and greeted him with Salam. When I was going to leave he said: 'Stay and have meal for breakfast, O Abu Umayyah.' I said: 'I am fasting, O Prophet of Allah.' He said: 'Come and I will tell about the traveler. Allah, most high, has waived fasting and of the prayer for him.\"'",
      "chain": [
        "30313",
        "20442",
        "20024",
        "11449",
        "11047"
      ]
    },
    {
      "hadith_no": "2841",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Hajj - كتاب مناسك الحج",
      "chapter_no": "24",
      "text_ar": "أخبرني شعيب بن شعيب بن إسحاق، وصفوان بن عمرو الحمصي، قالا حدثنا أبو المغيرة، قال حدثنا الأوزاعي، عن عطاء بن أبي رباح، عن ابن عباس، أن النبي صلى الله عليه وسلم تزوج ميمونة وهو محرم ‏.‏",
      "text_en": " It was narrated from Ibn Abbas:                     That the Prophet married Maimunah when he was in Ihram.",
      "chain": [
        "37510",
        "38279",
        "20442",
        "20024",
        "11029",
        "17"
      ]
    },
    {
      "hadith_no": "3813",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Oaths and Vows - كتاب الأيمان والنذور",
      "chapter_no": "35",
      "text_ar": "أخبرنا إسحاق بن منصور، قال حدثنا أبو المغيرة، قال حدثنا الأوزاعي، قال حدثني يحيى، عن أبي قلابة، عن ثابت بن الضحاك، قال قال رسول الله صلى الله عليه وسلم ‏\"‏ من حلف بملة سوى ملة الإسلام كاذبا فهو كما قال ومن قتل نفسه بشىء في الدنيا عذب به يوم القيامة وليس على رجل نذر فيما لا يملك ‏\"‏ ‏.‏",
      "text_en": " It was narrated from Thabit bin Ad-Dahhak, that the Messenger of Allah said:                      \"Whoever swears by a religion other than Islam, telling a lie, will be as he said, and whoever kills himself with something, he will be punished with it in the Hereafter, and there is no vow concerning that which a man does not possess.\"",
      "chain": [
        "30313",
        "20442",
        "20024",
        "11449",
        "11047",
        "1902"
      ]
    },
    {
      "hadith_no": "5524",
      "source": " Sunan an-Nasa'i ",
      "chapter": "The Book of Seeking Refuge with Allah - كتاب الاستعاذة",
      "chapter_no": "50",
      "text_ar": "أخبرني عمران بن بكار، قال حدثنا أبو المغيرة، قال حدثنا الأوزاعي، قال حدثني عبدة، قال حدثني ابن يساف، قال سئلت عائشة ما كان أكثر ما كان يدعو به النبي صلى الله عليه وسلم قالت كان أكثر دعائه أن يقول ‏\"‏ اللهم إني أعوذ بك من شر ما عملت ومن شر ما لم أعمل بعد ‏\"‏ ‏.‏",
      "text_en": " Ibn Yasaf said:                     \"I asked 'Aishah, what was the supplication that the Prophet [SAW] said the most? She said: 'The supplication that he said the most was: Allahumma, inni a'udhu bika min sharri ma 'amiltu wa min sharri ma lam a'mal ba'd (O Allah, I seek refuge with You from the evil of what I have done, and from the evil of what I have not done yet.)'\"",
      "chain": [
        "38437",
        "20442",
        "20024",
        "20337"
      ]
    },
    {
      "hadith_no": "52",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا عبد الله بن سعيد، حدثنا بشر بن منصور الخياط، عن أبي زيد، عن أبي المغيرة، عن عبد الله بن عباس، قال قال رسول الله  صلى الله عليه وسلم  ‏\"‏ أبى الله أن يقبل عمل صاحب بدعة حتى يدع بدعته ‏\"‏ ‏.‏",
      "text_en": " It was narrated that 'Abdullah bin 'Abbas said:                     \"The Messenger of Allah (ﷺ) said: 'Allah refuses to accept the good deeds of one who follows innovation until he gives up that innovation.'\"",
      "chain": [
        "11184",
        "20531",
        "20442",
        "17"
      ]
    },
    {
      "hadith_no": "253",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of the Sunnah - كتاب المقدمة",
      "chapter_no": "0",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا أبو المغيرة، حدثنا معان بن رفاعة، حدثني علي بن يزيد، قال سمعت القاسم بن عبد الرحمن، يحدث عن أبي أمامة، قال مر النبي  صلى الله عليه وسلم  في يوم شديد الحر نحو بقيع الغرقد وكان الناس يمشون خلفه فلما سمع صوت النعال وقر ذلك في نفسه فجلس حتى قدمهم أمامه لئلا يقع في نفسه شىء من الكبر ‏.‏",
      "text_en": " It was narrated that Abu Umamah said:                     \"The Prophet walked on a very hot day towards Baqi' Al-Gharqad (graveyard of Al-Madinah), and the people were walking behind him. When he heard the sound of their shoes, it affected his soul so he sat down until he made them go ahead of him, lest that make him feel too proud.\"",
      "chain": [
        "11222",
        "20442",
        "27042",
        "19896",
        "405"
      ]
    },
    {
      "hadith_no": "669",
      "source": " Sunan Ibn Majah ",
      "chapter": "The Book of Purification and its Sunnah - كتاب الطهارة وسننها",
      "chapter_no": "1",
      "text_ar": "حدثنا محمد بن يحيى، حدثنا أبو المغيرة، حدثنا الأوزاعي، عن الزهري، عن عروة بن الزبير، وعمرة بنت عبد الرحمن، أن عائشة، زوج النبي  صلى الله عليه وسلم  قالت استحيضت أم حبيبة بنت جحش وهي تحت عبد الرحمن بن عوف سبع سنين فشكت ذلك للنبي  صلى الله عليه وسلم  فقال النبي  صلى الله عليه وسلم  ‏\"‏ إن هذه ليست بالحيضة وإنما هو عرق فإذا أقبلت الحيضة فدعي الصلاة وإذا أدبرت فاغتسلي وصلي ‏\"‏ ‏.‏ قالت عائشة فكانت تغتسل لكل صلاة ثم تصلي وكانت تقعد في مركن لأختها زينب بنت جحش حتى إن حمرة الدم لتعلو الماء ‏.‏",
      "text_en": " It was narrated from 'Urwah bin Zubair and 'Amrah bint 'Abdur-Rahman that :                     'Aishah the wife of the Prophet said: \"Umm Habibah Jahsh experienced prolonged non-menstrual bleeding for seven years when she was married to 'Abdur-Rahman bin 'Awf. She complained about that to the Prophet and the Prophet said: 'That is not menstruation, rather it is a vein, so when the time of your period comes, leave the prayer, and when it is over, take a bath and perform prayer.'\" 'Aishah said: \"She used to bathe for every prayer and then perform the prayer. She used to sit in a washtub belonging to her sister Zainab bint Jahsh and the blood would turn the water red.\"",
      "chain": [
        "11222",
        "20442",
        "20024",
        "11013",
        "10511",
        "11455"
      ]
    },
    {
      "hadith_no": "3817",
      "source": " Sunan Ibn Majah ",
      "chapter": "Etiquette - كتاب الأدب",
      "chapter_no": "33",
      "text_ar": "حدثنا علي بن محمد، حدثنا أبو بكر بن عياش، عن أبي إسحاق، عن أبي المغيرة، عن حذيفة، قال كان في لساني ذرب على أهلي وكان لا يعدوهم إلى غيرهم فذكرت ذلك للنبي  صلى الله عليه وسلم  فقال ‏\"‏ أين أنت من الاستغفار تستغفر الله في اليوم سبعين مرة ‏\"‏ ‏.‏",
      "text_en": " It was narrated that Hudhaifah said:                     \"I was harsh in the way I spoke to my family, but not to others.  I mentioned that to the Prophet (saas) and he said: 'Why don't you ask for forgiveness? Ask Allah to forgive you, seventy times each day.'\"",
      "chain": [
        "38409",
        "20373",
        "11049",
        "20442",
        "145"
      ]
    }
  ],
  "total_hadiths": 30
}